{"pub": "independent", "url": "https://independent.co.uk/sport/football/premier-league/liverpool-vs-leicester-milner-mane-maddison-rodgers-record-a9144446.html", "downloaded_at": "2019-10-05 23:00:57.534654+00:00", "title": "Liverpool vs Leicester: Reds maintain perfect start but run has unsustainable feel with record in sight", "language": "en", "text": "Another nervy 90 minutes, another imperfect performance, but another three points. Liverpool won their 17th consecutive Premier League game, one short of equalling the all-time record.\n\nThe top flight’s only 100 per cent start to the season will last beyond the October international break. The question is whether it be can maintained for much longer on such tense, nerve-shredding victories.\n\nEven at half time, when Sadio Mané had opened the scoring and Leicester City had not registered a shot on goal, this felt like a close contest.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nEven after James Milner’s decisive stoppage-time penalty, the visitors parked themselves in front of the Kop, seeking their second equaliser of the afternoon.\n\nIt did not come. Brendan Rodgers oh-so-nearly punished his former club for missing several clear-cut chances and dented their nascent title aspirations. James Maddison cancelled out Mane’s strike with 10 minutes remaining. At that point, it appeared as though a point at Anfield would boost Leicester’s top-six credentials.\n\nShape Created with Sketch. Ratings: Liverpool vs Leicester Show all 23 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Ratings: Liverpool vs Leicester 1/23 Liverpool vs Leicester: Player ratings Action Images via Reuters 2/23 Adrian - 6 PA 3/23 Trent Alexander-Arnold - 8 REUTERS 4/23 Dejan Lovren - 7 Action Images via Reuters 5/23 Virgil van Dijk - 6 Getty Images 6/23 Andrew Robertson - 7 AFP via Getty Images 7/23 Georginio Wijnaldum - 6 Getty Images 8/23 Fabinho - 7 Getty Images 9/23 James Milner - 8 Man of the match. Action Images via Reuters 10/23 Sadio Mane - 8 Liverpool FC via Getty Images 11/23 Mohamed Salah - 7 AFP via Getty Images 12/23 Roberto Firmino - 6 Action Images via Reuters 13/23 Kasper Schmeichel - 7 EPA 14/23 Ricardo - 7 Leicester City FC via Getty Imag 15/23 Jonny Evans - 7 Leicester City FC via Getty Imag 16/23 Caglar Soyuncu - 7 Getty Images 17/23 Ben Chilwell - 6 Getty Images 18/23 Wilfred Ndidi - 7 AP 19/23 Harvey Barnes - 6 AP 20/23 Dennis Praet - 6 Leicester City FC via Getty Imag 21/23 Youri Tielemans - 6 Leicester City FC via Getty Imag 22/23 James Maddison - 7 EPA 23/23 Jamie Vardy - 6 EPA 1/23 Liverpool vs Leicester: Player ratings Action Images via Reuters 2/23 Adrian - 6 PA 3/23 Trent Alexander-Arnold - 8 REUTERS 4/23 Dejan Lovren - 7 Action Images via Reuters 5/23 Virgil van Dijk - 6 Getty Images 6/23 Andrew Robertson - 7 AFP via Getty Images 7/23 Georginio Wijnaldum - 6 Getty Images 8/23 Fabinho - 7 Getty Images 9/23 James Milner - 8 Man of the match. Action Images via Reuters 10/23 Sadio Mane - 8 Liverpool FC via Getty Images 11/23 Mohamed Salah - 7 AFP via Getty Images 12/23 Roberto Firmino - 6 Action Images via Reuters 13/23 Kasper Schmeichel - 7 EPA 14/23 Ricardo - 7 Leicester City FC via Getty Imag 15/23 Jonny Evans - 7 Leicester City FC via Getty Imag 16/23 Caglar Soyuncu - 7 Getty Images 17/23 Ben Chilwell - 6 Getty Images 18/23 Wilfred Ndidi - 7 AP 19/23 Harvey Barnes - 6 AP 20/23 Dennis Praet - 6 Leicester City FC via Getty Imag 21/23 Youri Tielemans - 6 Leicester City FC via Getty Imag 22/23 James Maddison - 7 EPA 23/23 Jamie Vardy - 6 EPA\n\nBut like in many of Liverpool’s previous 16 league victories, Jürgen Klopp’s side would find a way. Marc Albrighton was the culprit, running himself into trouble inside his own penalty area in the second minute of four added-on. While inexplicably steering the ball away from his team-mate Kasper Schmeichel, he scraped Mane’s ankles. VAR upheld the penalty decision, Milner made it count.\n\nLiverpool, in fairness, had enough chances to win this game comfortably. Milner, Roberto Firmino and Mohamed Salah all missed close-range opportunities.\n\nAt least one of those should perhaps have been scored. The afternoon would have been a lot easier. Instead, a Leicester fightback always felt likely, even if their attack was somewhat blunt.\n\nAnd yet, for the seventeenth time on the bounce, Liverpool win. For the third consecutive league game, the three points were earned by a single goal. In a climate where draws are the new defeats, that is an invaluable quality. It is also, perhaps, an unsustainable one.", "description": "Another nervy 90 minutes, another imperfect performance, but another three points. Liverpool won their 17th consecutive Premier League game, one short of equalling the all-time record. The top flight’s only 100 per cent start to the season will last beyond the October international break. The question is whether it be can maintained for much longer on such tense,", "authors": ["Mark Critchley"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/05/17/Milner-celebrates-scoring-the-winner-for-Liverpool-vs-Leicester.jpg", "published_at": "2019-10-05"}