{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/09/brazil-beach-oil-slick-venezuela-government", "downloaded_at": "2019-10-09 22:07:46.989235+00:00", "title": "Oil contaminating Brazil's beaches 'very likely from Venezuela', minister says", "language": "en", "text": "Government says foreign ship appears to have caused the spill, in accusation likely to further strain Brazilian-Venezuelan relations\n\nThick crude oil that has stained hundreds of miles of pristine Brazilian beach in recent weeks probably originated in Venezuela, the Brazilian government has said, in an accusation likely to further strain relations between the two countries.\n\n'Chaos, chaos, chaos': a journey through Bolsonaro's Amazon inferno Read more\n\nBrazilian authorities have been investigating the growing disaster for more than a month, as the oil has spread to more than 130 beaches across nine states.\n\nOn Wednesday, the country’s environment minister, Ricardo Salles, told a congressional hearing that a study by the state oil company Petrobras had concluded that the oil “is very likely from Venezuela”.\n\nHe said that a foreign ship near Brazil’s coastline appeared to have caused the spill “accidentally or not”.\n\nSalles said that more than 100 tonnes of oil had already been collected from the coastline since 2 September, but said that the disaster was proving “enormously difficult to contain”.\n\nThere was no immediate response from Venezuela, but the Brazilian assertion is likely to further escalate tensions between the two countries. Jair Bolsonaro, Brazil’s far-right president, is a longstanding critic of Venezuela’s embattled leader, Nicolás Maduro, and has close relations with rightwing Venezuelan groups seeking his overthrow.\n\nEarlier this week, Bolsonaro dismissed speculation that the spill had been released by a sinking ship. “If it was a shipwreck, oil would still be coming up. It is more probable that something was dumped there criminally,” he told reporters.\n\nBolsonaro said he did not want to blame another country without proof, but hinted darkly: “We have a country on our radar screen that could be the origin of the oil.”\n\nPetrobras’s chief executive, Roberto Castello, said on Tuesday that the amount of oil spilled so far – approximately 500 barrels – was far too much to have been from the result of a routine tank cleaning.\n\nSocial media users have shared shocking images of the spill, showing kilometers of white sand stained with oil blotches and dead, oil-covered turtles and dolphins. One video shows thick black oil lapping up against a rocky jetty.\n\nThe oil’s appearance came shortly after Brazil became the focus of international criticism over record wildfires and deforestation in the Amazon rainforest – both of which have surged since Bolsonaro came to office.\n\nEnvironmentalists and indigenous leaders say that Bolsonaro’s stripping back of environmental legislation and protections has stoked a fresh assault on the country’s ecosystems.\n\n“The oil spill that’s reached over 132 beaches in the north-east is criminal. Removing the residue from the ocean can take 10 to 20 years,” said the former environment minister Marina Silva in a tweet. “This is a warning that we need to strengthen and not suffocate the environmental monitoring institutions in the country.”", "description": "Government says foreign ship appears to have caused the spill, in accusation likely to further strain Brazilian-Venezuelan relations", "authors": ["Anna Jean Kaiser"], "top_image": "https://i.guim.co.uk/img/media/c6a085294c01236be332ac1c2e433803725f973e/0_36_1080_648/master/1080.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ac9651dc54f07c324e9bd9d0cad55322", "published_at": "2019-10-09"}