{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/tv/2019/10/10/shark-tank-exclusive-new-list-20-best-selling-products/3841699002", "downloaded_at": "2019-10-10 18:45:30.848242+00:00", "title": "'Shark Tank' exclusive: The new list of the 20 best-selling products from the show", "language": "en", "text": "As \"Shark Tank\" – ABC's competition among entrepreneurs seeking investors – racks up more valuable deals in its 11th season, this year's list of the top 20 products in the show's history adds eight new entries, and totals more than $1.8 billion in retail sales.\n\nThe new No. 1 product? Bombas socks, which match each pair sold with a gift to the homeless. Founders David Heath and Randy Goldberg say they've donated 25 million pairs to date, and racked up $225 million in sales, elbowing super sponge Scrub Daddy out of the top spot, according to data compiled by producer Sony Pictures Television.\n\nOther products new to the top 20 include Lovepop, a line of 3D pop-up greeting cards; CordaRoys, a beanbag chair that converts to a bed; and PhoneSoap, a device that uses ultraviolet light to sanitize cellphones. And in an unusual development, The Bouq – an \"eco-friendly\" online flower shop that shark Robert Herjavec passed on during a taping but invested in later – also made the list, with sales of $100 million.\n\nIn the tank: 'Shark Tank' secrets: Life-changing moments on an assembly line of product pitches\n\nBombas, a sock company that donates a pair to the homeless for every one sold, is now the top-selling product pitched on \"Shark Tank.\" (Photo: ABC)\n\nHeath, inspired by the charitable \"one-for-one business model\" employed by Warby Parker and Toms footwear, says that when a casting agent for the show emailed them, \"we thought it was one of those emails from a Nigerian prince,\" full of empty promises.\n\nBut the \"Shark Tank\" exposure \"shaved at least one year off our growth. We were on track to do roughly $1 million in our first year, and then we did $1.2 million in the first two months\" after the show aired in September 2014, and topped out at $2 million, but \"only because we ran out of inventory.\"\n\n\"Shark Tank\" has become the standard-bearer for showcasing and highlighting entrepreneurship of America,\" says Goldberg.\n\nABC's \"Shark Tank\" celebrity investor sharks Barbara Corcoran, Kevin O' Leary and Lori Greiner quiz the entrepreneurs about their pitches during taping of the show on Sept. 15, 2019, at Sony Pictures Entertainment in Culver City, Calif. (Photo: Dan MacMedan, USA TODAY)\n\nDaymond John, who invested $200,000 for a 17% stake in the company, says he learned an important lesson along the way. \"Every consumer at the end of the year wants to say, ‘I didn't give at the end of the year; I gave every time I purchased. So I gave to a thousand organizations.’ And that's more important now to always have a social cause than ever before.\"\n\nQ&A: 'Shark Tank': All your burning questions, answered\n\nWhat else has changed since the show, based on a Japanese format called \"Dragon's Den,\" premiered on ABC in 2009?\n\n“The quality of the products and pitches and services have gone way up over the last couple of years, and I think the reason is that a lot of investors, venture capitalists, entrepreneurs, understand the power of the Shark Tank to really accelerate growth,\" says shark Kevin O'Leary. \"Millions of people see the show. It's on in multiple countries now. When a deal gets on ‘Shark Tank,’ the retailers want it. I mean, it's a beast of a machine for distribution, so I've just found the deals are getting better and better every year. This year they're incredible, and the size of the investments we can make, because the companies have (proven) sales, are much higher. It's not uncommon to do a $1 million, $2 million deal now. That never happened in the early years.”\n\nThe entrepreneurs behind Original Comfy, a blanket/sweatshirt, had no real business plan when they pitched it in 2017. But Shark Barbara Corcoran still offered them $50,000 for a 30% stake. It's now one of the top \"Shark Tank\" products. (Photo: ABC)\n\nA pro-social business plan and a heartbreaking story are often key to getting on \"Shark Tank.\" But sometimes a proven track record isn't necessary to guarantee success.\n\nCorcoran's favorite pitch was for Season 9's Original Comfy, a successor to the Snuggie craze. \"All they had was a sweatshirt-blanket contraption with a hood; I thought they were crazy,\" she says. \"They wanted $20,000. They didn't know what it was going to cost to make. They didn't know what it would cost to sell it. They didn't know where they were going to sell it. And today, they have $85 million in sales.”\n\nBarbara Corcoran, Daymond John, Mark Cuban, Kevin O'Leary, Robert Herjavec and Lori Greiner are counting sales in the 11th season of ABC's \"Shark Tank.\" (Photo: Patrick Ecclesine, ABC)\n\nThe new \"Shark Tank\" Top 20, measured by total sales:\n\n1. Bombas\n\nWhat it is: Socks\n\nPitched on (episode airdate): 9/26/14\n\nShark: Daymond John\n\nOffer/stake (on broadcast): $200,000/17%\n\nTotal sales: $225 million\n\n2. Scrub Daddy\n\nWhat it is: Kitchen sponge\n\nPitched on (episode airdate): 10/26/12\n\nShark: Lori Greiner\n\nOffer/stake (on broadcast): $200,000/20%\n\nTotal sales: $209 million\n\n3. Squatty Potty\n\nWhat it is: Footrest for toilet\n\nPitched on: 11/14/14\n\nShark: Lori Greiner\n\nOffer/stake: $350,000/10%\n\nSales: $164 million\n\n4. Simply Fit Board\n\nWhat it is: Curved exercise board\n\nPitched on: 11/6/15\n\nShark: Lori Greiner\n\nOffer/stake: $125,000/20%\n\nSales: $160 million\n\n5. The Original Comfy\n\nWhat it is: Sweatshirt blanket\n\nPitched on: 12/3/17\n\nShark: Barbara Corcoran\n\nOffer/stake: $50,000/30%\n\nSales: $150 million\n\n6. Tipsy Elves\n\nWhat it is: \"Ugly\" Christmas sweaters\n\nPitched on: 12/13/13\n\nShark: Robert Herjavec\n\nOffer/stake: $100,000/10%\n\nSales: $125 million\n\n7. The Bouqs*\n\nWhat it is: Online flower bouquets\n\nPitched on: 5/2/14\n\nShark: Robert Herjavec\n\nOffer/stake: No offers (Herjavec invested later)\n\nSales: $100 million\n\n8. Sleep Styler\n\nWhat it is: Hairstyling accessories\n\nPitched on: 3/3/17\n\nShark: Lori Greiner\n\nOffer/stake: $75,000/25%\n\nSales: $100 million\n\n9. Lovepop*\n\nWhat it is: Pop-up greeting cards\n\nPitched on: 12/11/15\n\nShark: Kevin O'Leary\n\nOffer/stake: $300,000/15%\n\nSales: $80 million\n\n10. Cousins Maine Lobster\n\nWhat it is: Seafood trucks\n\nPitched on: 10/19/12\n\nShark: Barbara Corcoran\n\nOffer/stake: $55,000/15%\n\nSales: $65 million\n\n11. EverlyWell*\n\nWhat it is: Home health testing kits\n\nPitched on: 11/26/17\n\nShark: Lori Greiner\n\nOffer/stake: $1 million (line of credit)/5%\n\nSales: $65 million\n\n12. FiberFix\n\nWhat it is: Repair tape\n\nPitched on: 10/25/13\n\nShark: Lori Greiner\n\nOffer/stake: $120,000/12%\n\nSales: $65 million\n\n13. CordaRoys*\n\nWhat it is: Convertible beanbag chair\n\nPitched on: 3/8/13\n\nShark: Lori Greiner\n\nOffer/stake: $200,000/58%\n\nSales: $48 million\n\n14. Grace & Lace\n\nWhat it is: Leg warmers\n\nPitched on: 11/22/13\n\nShark: Barbara Corcoran\n\nOffer/stake: $175,000/10%\n\nSales: $47 million\n\n15. PhoneSoap*\n\nWhat it is: UV light phone sanitizer\n\nPitched on: 1/30/15\n\nShark: Lori Greiner\n\nOffer/stake: $300,000/10%\n\nSales: $46 million\n\n16. Readerest*\n\nWhat it is: Magnetic eyeglass holder\n\nPitched on: 2/24/12\n\nShark: Lori Greiner\n\nOffer/stake: $150,000/65%\n\nSales: $38 million\n\n17. Drop Stop*\n\nWhat it is: Car seat gap filler\n\nPitched on: 3/29/13\n\nShark: Lori Greiner\n\nOffer/stake: $300,000/20%\n\nSales: $38 million\n\n18. Tower Paddle Boards\n\nWhat it is: Stand-up paddle board\n\nPitched on: 3/16/12\n\nShark: Mark Cuban\n\nOffer/stake: $150,000/30%\n\nSales: $36 million\n\n19. Sun-Staches\n\nWhat it is: Novelty sunglasses\n\nPitched on: 10/17/14\n\nShark: Daymond John\n\nOffer/stake: $300,000/20%\n\nSales: $30 million\n\n20. Wine & Design*\n\nWhat it is: Paint and sip classes\n\nPitched on: 5/12/17\n\nShark: Kevin O'Leary\n\nOffer/stake: $500,000 (including $350,000 loan)/10%\n\nSales: $25 million\n\n* New to top 20 list in 2019\n\nSource: Sony Pictures Television; sales figures are cumulative as of Sept. 10, 2019.\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/tv/2019/10/10/shark-tank-exclusive-new-list-20-best-selling-products/3841699002/", "description": "In a USA TODAY exclusive, ABC's 'Shark Tank' unveils a new list of the 20 top-selling products over 11 seasons.", "authors": ["Gary Levin", "Bill Keveney", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/26/USAT/d68bdc78-052a-4498-956b-174f165b9ccd-XXX_Shark_Tank_20190915_USA_djm_0017.jpg?crop=4516,2541,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-10"}