{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/26/world-series-game-3-astros-nationals", "downloaded_at": "2019-10-26 07:27:07.580010+00:00", "title": "World Series: Houston Astros strike back in Game 3 over sloppy Nationals", "language": "en", "text": "The World Series finally showed up back in Washington, 86 years later – and, sparked by José Altuve, the Houston Astros finally showed up in this World Series.\n\nAltuve doubled twice and scored both times, Zack Greinke repeatedly worked out of trouble, and the Astros made sure they wouldn’t go quietly despite looking listless while falling into a big hole at home, beating the Nationals 4-1 on Friday night to cut their deficit to 2-1 in the best-of-seven Fall Classic.\n\nWorld Series Game 3: Houston Astros v Washington Nationals – live! Read more\n\n“I just liked the competitiveness of our at-bats,” Astros manager AJ Hinch said. “We were kind of pretty focused on handing the baton to the next guy, which is really important. We’re at our best when we do that.”\n\nHouston can even things up in Game 4 on Saturday night at Nationals Park. Washington will start $140m lefty Patrick Corbin, while Hinch said he’ll go with rookie José Urquidy.\n\nWashington’s eight-game winning streak, tied for the longest in a single postseason, ended with a sloppy performance in the first World Series game hosted by the nation’s capital since the Senators lost to the New York Giants in 1933.\n\nA sellout crowd of 43,867, dressed mostly in red for the occasion, soaked it all in, standing in unison at key moments, booing ball-strike calls that hurt their team, chanting “Let’s go, Nats!” often and even getting to do their “Baby Shark” sing-and-clap-along when that children’s tune blared as a walk-up song in the sixth.\n\nBut the wild-card Nationals were unable to move one win from a championship, undone by an inability to come through in the clutch: Birthday boy Juan Soto, MVP candidate Anthony Rendon and co were 0-for-10 with runners in scoring position, leaving 12 runners on base.\n\nHow big was this win for Houston? No team ever has come back after dropping the first three games of a World Series.\n\nMaybe that’s why several Astros players gathered for a private meeting following their 12-3 loss in Game 2 on Wednesday. Whatever was said apparently worked.\n\nAfter playing what might have been their worst baseball of 2019, the Astros suddenly played more like the club that led the majors with 107 regular-season wins.\n\nGreinke, the 2009 AL Cy Young award winner, only lasted 4 2/3 innings, and allowed seven hits and three walks, but managed to give up just one run. He was followed by five relievers who combined to give up two hits across 4 1/3 scoreless innings.\n\nJosh James earned the win, striking out Ryan Zimmerman with two aboard to end the fifth. Roberto Osuna heard boos when he entered in the ninth but got three outs for a save.\n\nJosh Reddick delivered an RBI single in the second, Robinson Chirinos homered in the sixth and Houston scored four runs in 5 1/3 innings off Aníbal Sánchez. The 35-year-old righty had taken a no-hitter into the eighth inning of his previous start, in Game 1 of the NL Championship Series against St Louis two weeks earlier. He gave up a hit on his 103rd pitch that night; this time, he allowed one on his third, to George Springer.\n\nSánchez went sprawling off the mound to try to make a play, but couldn’t. All part of a rough night in which he got so upset by a couple of ball calls that he asked plate umpire Gary Cederstrom, “Where was that one?”\n\nSánchez later barely avoided taking a ball to the face, getting his glove in the way just in time to deflect what ended up as a single. Another Houston hit came when Springer sent a comebacker off reliever Joe Ross’ left foot in the eighth.\n\nIn sum: After the Nationals could do no wrong for so long, things went awry Friday.\n\nThey made two errors and at least three other misplays on what were ruled hits. They allowed the aggressive Astros to steal four bases, two by Springer. Washington catcher Kurt Suzuki left in the sixth after taking a ball off his arm behind the plate.\n\nSoto, serenaded by fans in left field to celebrate his 21st, was charged with an error for a wild throw home that sailed over the head of Suzuki and a leaping Sánchez, backing up the play. Named a Gold Glove finalist Thursday, Soto let another ball trickle past his glove and went 0 for 4 with three strikeouts at the plate. He went down looking to end the game.", "description": "The Astros showed they were not going to go quietly, beating the Nationals 4-1 to cut their deficit to 2-1 in the best-of-seven Fall Classic", "authors": ["Associated Press"], "top_image": "https://i.guim.co.uk/img/media/4d2cf20e0865e11f6610b4165fa81a8a70223daa/0_76_4067_2442/master/4067.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5bac0c78786cd1370afd42a4143ac93c", "published_at": "2019-10-26"}