{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7549735/First-picture-British-couple-drowned-Portugal-tributes-paid-pregnant-mother.html", "downloaded_at": "2019-10-08 15:09:25.980195+00:00", "title": "First picture of British couple who drowned in Portugal as tributes are paid to pregnant mother", "language": "en", "text": "These are the first pictures of the British couple who drowned in the sea off Portugal on Sunday.\n\nYoga teacher Kim Fletcher, 33, and Danny Johnson, 34, were engaged to be married and had a four-year-daughter called Aveyja.\n\nFormer rap artist Mr Johnson lost his life after trying to save his fiancee, who was reportedly four months pregnant, as she got carried out to sea by a dangerous rip tide off picturesque Zambujeira do Mar in south-west Portugal.\n\nLocal bodyboarder Joao Mendes told yesterday how he pulled them out of the water and made an unsuccessful attempt to revive them alongside others after they went into cardiac arrest.\n\nFriends have paid tribute to the pair from Stoke-on-Trent, who were staying at a spiritual retreat in Portugal. As well as their daughter, they cared for Kim’s 15-year-old girl Maicee from a previous relationship she had.\n\nMs Fletcher wrote ahead of her trip: 'Cannot wait for the Portuguese sunshine on my face'\n\nThe Portuguese coastguard arriving on the scene with a helicopter to try and save the British couple on Sunday\n\nFriends have paid tribute to the pair from Stoke-on-Trent, who were holidaying in Portugal with two friends\n\nThat particular stretch of beach in the Zambujeira do Mar area has no lifeguard service after September 15\n\nSteph Critchlow told the MailOnline: 'They were just such beautiful people inside and out, and they've left their two girls behind, one who's just four-years-old the same as my son. We all met when our babies were only months old.'\n\nShe added: 'We met four years ago and just connected. She and Danny were inseparable.'\n\nAnother friend wrote on social media: 'Lighting my candle from you, for you. Two most beautiful souls.'\n\nAnother added: 'RIP to my two beautiful friends. Can't believe the sky has taken you so soon. Absolutely gutted. Words can't express how I'm feeling. Sending all my love and energy to the families.'\n\nMs Fletcher, who has a teenage daughter from a previous relationship, had travelled to Portugal last month after finishing a successful yoga workshop she described as 'the first of many to come.'\n\nShe wrote ahead of her trip: 'Cannot wait for the Portuguese sunshine on my face.'\n\nHer fiancee made a name for himself as a member of North Staffordshire rap group The Gar, who were spotted at a 2006 'Urban Link' music contest in Stoke-on-Trent and ended up recording tracks and shooting videos with US hip-hop producer Herb Middleton.\n\nThe trio, who appeared at the 2009 Love Music Hate Racism festival alongside the likes of Beverley Knight and Kelly Rowland, featured Mr Johnson whose stage name was Dirty D, his brother Benny and a cousin.\n\nIn 2010 they released a rap mixtape with Wolverhampton-born DJ Tricksta, who founded UK hip hop table Wolftown Recordings and has DJ'ed all over the world.\n\nMr Johnson, who is thought to have been helping Ms Fletcher run her successful yoga business after putting his music career on hold, sung for her on her 28th birthday in a romantic online post.\n\nYoga teacher Kim Fletcher, 33, and Danny Johnson, 34, were engaged to be married. They died after getting into difficulty in the water off Zambujeira do Mar in south-west Portugal on Sunday\n\nMedical responders reached the scene by helicopter and made an unsuccessful attempt to revive them by practicing CPR\n\nHe said: 'I thought I'd do a special birthday video for you, I hope you like the track. It's especially for you. Happy Birthday. You know I love you' before breaking into a hip hop tune which included the chorus: 'I sing your blessings when I look up above. I never curse it. I wouldn't change a single thing if I could because you're perfect.'\n\nMs Fletcher replied: 'Thank you so much my perfect man. You naughty boy though for making me cry.'\n\nAt the start of July, he posted a video on social media showing his take on life in which he revealed he had worried about not tending his allotment during heavy rain before adding: 'I went up there today and everything's perfect and growing as it should be.\n\n'It didn't need my help, my worry, just a little bit of a water today. It's a bit like that in life. It takes care of yourself, you don't need to get involved as much as you think you do.\n\n'We try to be in control of all these things that are just happening and when we leave it to life to do its own thing and everything to flow in its own way, you'll find the fruit will come out much sweeter and the flowers grow much better and you just sit along and enjoy the ride and have fun with your experience.'\n\nThe alarm was raised around 2.30pm on Sunday. Mr Johnson swam out to rescue his fiancee after she got into difficulties but the pair disappeared from view as they swam back to shore from rocks she had been clinging to.\n\nFormer rap artist Mr Johnson lost his life after trying to save his fiancee, who was reportedly four months pregnant, as she got carried out to sea by a dangerous rip tide off picturesque Zambujeira do Mar in south-west Portugal\n\nJoao Mendes, 36, how owns the Hakuna Matata Hostel, said: 'I've been bodyboarding at the beach for around 20 years and know the area very well.\n\n'People often call on us to help in rescues. I had been bodyboarding about 40 minutes before the tragedy and left to go home for lunch but I got a call telling me what had happened and I drove down to the beach with my board.\n\n'I was the second or third bodyboarder to arrive. I paddled out and didn't see anyone else at first. The waves were pretty big.\n\n'I was heading further out to sea with another bodyboarder when we spotted the woman's body.\n\n'She was face-down in the water and was being bashed against rocks.\n\n'We put her on my board and pushed her up onto the rocks and started practicing CPR.\n\n'At that point I didn't know there was a second person in the water. I was on the phone with the medical coordination team and they asked me if there were two people and I said I thought it was only one.\n\n'That's when another local said there were two and pointed out the man in the water. It must have been around 10 minutes after we got the woman out.\n\n'He was a big guy and with help from someone else, we put him on my board and brought him back to the same rocks.\n\n'Other people including a nurse and a doctor had arrived by then and we split into two teams trying to revive them while we waited for the ambulance to arrive with more specialized equipment but they were in pretty bad shape and it was impossible. Neither ever had any pulse.\n\n'A male friend of the British pair was on the beach but we told him to stay back because it wasn't very nice to see.\n\nMr Johnson, who is thought to have been helping Ms Fletcher run her successful yoga business after putting his music career on hold, sung for her on her 28th birthday in a romantic online post\n\nMr Johnson and his fiancee Ms Fletcher, she was reportedly four months pregnant at the time of her death\n\n'Another male friend arrived while we were trying to revive them who had been in the town buying fruit. They were in a state of shock.\n\n'The woman's body was taken away in a normal ambulance but the man's body was taken away by helicopter because the tide was rising and the sea was getting rough.'\n\nHe added: 'The corner where the woman was swimming is very dangerous because there's a rip tide.\n\n'People who don't know the ocean sometimes go there because it's an area with a bit more water where there appear to be less waves.\n\n'If there had been lifeguards around they would probably have warned her to stay away but the lifeguard service at the beach finished last month.\n\n'I didn't speak to the friends much so I don't know where they were staying.\n\n'I feel very sorry for their loss. It must have been awful for them.\n\n'If it had happened 40 minutes earlier when I was still bodyboarding everything could have been so different and I may have been able to help her reach safety with none of the terrible consequences there were.'", "description": "Danny Johnson, 34, died while trying to save his fiancee Kim Fletcher, 33, who was reportedly four months pregnant, as she got caught in a rip tide off Zambujeira do Mar in south-west Portugal.", "authors": ["Gerard Couzens For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/14/19443870-0-image-a-52_1570540947520.jpg", "published_at": "2019-10-08"}