{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7569443/Arturo-Vidal-says-difficult-Griezmann-Barcelona.html", "downloaded_at": "2019-10-14 00:03:17.495820+00:00", "title": "Arturo Vidal says 'it has been difficult' for Griezmann at Barcelona", "language": "en", "text": "Arturo Vidal says his new Barcelona team-mate Antoine Griezmann has found life difficult since his move to the club, according to Diario Sport (via Football Espana).\n\nBarcelona brought in the Frenchman for £108million over the summer, and scored twice on his debut for the side. However, since then, he has only added one more goal.\n\n'It has been difficult for him to integrate and adapt,' said the Chilean midfielder.\n\nAntoine Griezmann hasn't quite hit his peak form since arriving at Barcelona this summer\n\nArturo Vidal says he has found it difficult to adapt, but remains confident he will improve\n\n'He has arrived at the best team in the world, with the best players,' he added. Barcelona have spent nearly £1billion over the past five years on new players, adding to the likes of Lionel Messi.\n\nGriezmann arrived from Atletico Madrid, where he scored 94 goals in 180 appearances from 2014-2019.\n\n'He has come from a side that plays a very different way to Barcelona,' said Vidal. 'But we know that he has a lot of quality and he is one of the best players in the world.\n\n'We need to give him time, and once he knows exactly what the manager wants from him, he will help the team a lot.'\n\nBarcelona are currently second in La Liga, two points behind arch rivals Real Madrid at the top\n\nAfter a rocky start to the season, Barcelona are now back on track in the league with three wins on the bounce.\n\nThey sit two points behind Real Madrid at the top of La Liga, and one point above Griezmann's former team Atletico Madrid.\n\nThe Catalans will be hoping the forward can get back to his best form as they look to keep pace with their rivals.", "description": "Arturo Vidal says his new Barcelona team-mate Antoine Griezmann has found life difficult since his move to the club, according to Diario Sport (via Football Espana).", "authors": ["Matt Porter For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/00/19670224-0-image-a-71_1571008726078.jpg", "published_at": "2019-10-13"}