{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/15/the-latest-juul-reviewing-ny-ban-agrees-action-nee", "downloaded_at": "2019-09-15 23:09:47.704763+00:00", "title": "The Latest: Juul reviewing NY ban, agrees action needed", "language": "en", "text": "NEW YORK (AP) - The Latest on New York Gov. Andrew Cuomo pushing for a ban on the sale of flavored e-cigarettes (all times local):\n\n2:25 p.m.\n\nThe largest player in the e-cigarette market says it’s reviewing an announcement from New York Gov. Andrew Cuomo that would ban the sale of flavored e-cigarettes, but agrees there’s a need for “aggressive category-wide action.”\n\nJuul Labs Inc. spokesman Austin Finan says in a statement Sunday the company would “fully comply” with local laws and any federal policy when they’re effective.\n\nCuomo, a Democrat, announced Sunday the state health commissioner would be making a recommendation this week to the state Public Health and Health Planning Council.\n\nThe council can issue emergency regulations banning the flavored vapored products. Cuomo referenced young people getting addicted to nicotine in introducing the ban.\n\nJuul says it has stopped selling flavored products in traditional retail stores since November of last year.\n\n___\n\n12:48 p.m.\n\nNew York Gov. Andrew Cuomo says he’s directing state health officials to ban the sale of flavored e-cigarettes, citing the risk of young people getting addicted to nicotine.\n\nThe Democrat announced Sunday that the state health commissioner would be making a recommendation this week to the state Public Health and Health Planning Council.\n\nThe council can issue emergency regulations that could go into effect in as soon as two weeks.\n\nIn announcing the action, Cuomo sharply criticized the flavors that are for sale, like bubble gum and cotton candy, as being “obviously targeted” to young people.\n\nThe ban would not impact tobacco- and menthol-flavored e-cigarettes.\n\nCuomo signed legislation earlier this year raising the statewide smoking age to 21.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Latest on New York Gov. Andrew Cuomo pushing for a ban on the sale of flavored e-cigarettes (all times local):", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/15/vaping_new_york_86963_c0-111-2652-1657_s1770x1032.jpg?3984d57d7c8385fbfdb88c2d90d72829b6f4a068", "published_at": "2019-09-15"}