{"pub": "breitbart", "url": "https://breitbart.com/news/debate-rivals-assail-warren-as-she-joins-democrats-top-rank", "downloaded_at": "2019-10-16 05:53:15.315455+00:00", "title": "Debate rivals assail Warren as she joins Democrats’ top rank", "language": "en", "text": "Elizabeth Warren repeatedly came under attack during Tuesday’s Democratic presidential debate as rivals accused the Massachusetts senator of ducking questions about the cost of Medicare for All and her signature “wealth tax” plan in an attempt to derail her rising campaign.\n\nThe pile-on reinforced her new status as a front-runner in the contest to take on President Donald Trump next year. With first state primaries rapidly approaching, her many challengers have dwindling opportunities to emerge as powerful alternatives to the progressive agenda she’s championing.\n\nThe night’s confrontations were mostly fought on familiar terrain for the Democrats, who have spent months sparring over the future of health care with former Vice President Joe Biden and other moderates pressing for a measured approach while Warren and Sen. Bernie Sanders call for a dramatic, government-funded overhaul of the insurance market. Still, unlike Sanders, Warren refused to say whether she would raise taxes on the middle class to pay for a Medicare for All universal health insurance plan — a stance that’s increasingly difficult to maintain given her more prominent status.\n\nHer rivals seized on the opportunity to pounce.\n\n“I appreciate Elizabeth’s work but, again, the difference between a plan and a pipe dream is something you can actually get done,” said Minnesota Sen. Amy Klobuchar.\n\nPete Buttigieg, the mayor of South Bend, Indiana, added: “We heard it tonight. A ‘yes’ or ‘no’ question that didn’t get a ‘yes’ or ‘no’ answer.”\n\nWarren insisted that she has “made clear what my principles are here,” arguing that lower premiums would mean that overall costs would go down for most Americans.\n\nCalifornia Sen. Kamala Harris tried to get in on the action on another subject, scolding Warren for not echoing her calls for Twitter to suspend Trump’s account. Warren responded, “I don’t just want to push Trump off of Twitter. I want to push him out of the White House.”\n\nFeaturing a dozen candidates, the debate sponsored by CNN and The New York Times was the largest in modern history. It was the first time the White House hopefuls gathered in a little more than a month. In that time, the political landscape has changed with Trump facing an impeachment inquiry in the House centered on his quest to get Ukraine to dig up unflattering details about Biden, another front-runner among the Democrats hoping to unseat the president.\n\nThe debate also served as Sanders’ return to the campaign trail following a heart attack earlier this month. The Vermont senator failed to show all the fire of previous debates but made his points with force. He was applauded when he thanked supporters and rivals for their good wishes and declared, “I’m feeling great.”\n\nThe debate touched on foreign policy, too, a subject that has dominated the news in recent weeks as Trump said he was withdrawing most U.S. forces from Syria and then Turkey invaded the northern part of the country to attack Kurdish fighters.\n\nHawaii Rep. Tulsi Gabbard, who served in Iraq with the Army, questioned the need for U.S. involvement in “regime change” conflicts in the Middle East. That prompted Buttigieg, himself a veteran, to respond: “What we are doing or what we were doing in Syria was keeping our word.”\n\n“I would have a hard time today looking an Afghan civilian or soldier in the eye after what just happened over there,” said Buttigieg, who served in Afghanistan. “It is undermining the honor of our soldiers. You take away the honor of our soldiers, you might as well go after their body armor next.”\n\nBiden has faced the sharpest criticism from rivals in previous debates. But fewer candidates engaged with him on Tuesday as they trained their focus on Warren.\n\nStill, he struggled to fully explain why his newly promised ethics plan to prevent conflicts of interest involving his relatives wasn’t applied to his son Hunter when he was hired in 2014 as a director for a Ukrainian energy company.\n\nThat relationship has become a focal point of Trump’s push for a Ukrainian government probe of the Bidens — an effort that was a major factor leading to the House impeachment inquiry.\n\nOn Sunday, Biden had vowed that “no one in my family will have an office in the White House, will sit in on meetings as if they’re a Cabinet member, will in fact have any business relationship with anyone that relates to a foreign corporation or a foreign country.”\n\nCNN anchor Anderson Cooper asked, “If it’s not OK for a president’s family to be involved in foreign businesses, why was it OK for your son when you were vice president?”\n\nBiden faltered some before offering, “My son did nothing wrong, I did nothing wrong.”\n\nToward the end, Biden was more confident when he accused Warren and Sanders of “being vague” on the true costs of Medicare for All.\n\n“Tell people what it’s going to cost, how you’re going to do it and why you’re going to do it,” he said.\n\nSanders responded by criticizing the former vice president’s record, including his support for what Sanders called the “disastrous war in Iraq.” Warren also accused Biden of not doing enough as vice president to empower a consumer financial protection agency she helped set up in the wake of the national financial crisis.\n\n“I went on the floor and got you votes,” Biden responded, waving his finger at Warren.\n\nWarren answered that she was “deeply grateful” that then-President Barack Obama supported her efforts, implying that Biden didn’t help.\n\nShe swatted back at criticism of her sweeping plan to tax wealth Americans to pay for her domestic agenda. Klobuchar said she wanted to provide a “reality check” on the issue while former Texas Rep. Beto O’Rourke suggested it was “punitive.”\n\nWarren framed the measure as part of the ambitious agenda she’s pitching to fundamentally reshape the economic and political system.\n\n“Look, I understand that this is hard, but I think as Democrats we are going to succeed when we dream big and fight hard, not when we dream small and quit before we get started,” Warren answered.\n\nThough Warren fielded much of the criticism on Tuesday, other rivalries emerged.\n\nO’Rourke and Buttigieg argued about gun control, with the mayor saying the Texan himself wasn’t even sure how the mandatory federal buyback of assault weapons he’s called for would work. That touched off a stretch where both candidates talked over one another.\n\nAt one point, Buttigieg told O’Rourke: “I don’t need lessons from you on courage, political or personal.”\n\nAlso debating were New York entrepreneur Andrew Yang, New Jersey Sen. Cory Booker, former Obama housing chief Julián Castro and billionaire activist Tom Steyer.\n\n___\n\nWeissert and Superville reported from Washington.", "description": "Elizabeth Warren repeatedly came under attack during Tuesday's Democratic presidential debate as rivals accused the Massachusetts senator of ducking", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/15/6f729b_aptopix-election-2020-debate-69824-elizabeth-warren-joe-biden-pete-buttigieg-640x335.jpg", "published_at": "2019-10-15"}