{"pub": "reuters", "url": "https://uk.reuters.com/article/us-usa-fed-kashkari/feds-kashkari-says-more-easing-needed-not-sure-how-much-idUKKBN1WM1NQ", "downloaded_at": "2019-10-07 23:36:30.726792+00:00", "title": "Fed's Kashkari says more easing needed, not sure how much", "language": "en", "text": "FILE PHOTO: President of the Federal Reserve Bank on Minneapolis Neel Kashkari listens to a question during an interview in New York, U.S., March 29, 2019. REUTERS/Shannon Stapleton\n\n(Reuters) - The U.S. Federal Reserve should continue to cut interest rates in order to offset growing risks to the economy, Minneapolis Federal Reserve Bank President Neel Kashkari said on Monday.\n\n“My message is clear: we should be supporting the economy, not tapping the brakes on the economy so I want to look at the data over the next few months but so far I am happy that we’re cutting interest rates,” Kashkari said during an event in Prior Lake, Minnesota.\n\n“How much more do we have to cut? I don’t know yet,” he said, citing slowing global growth, weakening business investment and inflation that is below the central bank’s 2% target as economic risk factors.\n\nKashkari has repeatedly said he thinks the U.S. economy should have interest rates lower than the current level in order to draw more people back into work and push up wages.\n\nDuring his appearance, Kashkari repeated his belief that inflation has not been rising more quickly because there are still more workers that can be enticed back to work. Data from the Labor Department last Friday showed unemployment to be near a 50-year low at 3.5%.\n\nAsked about the potential for the Federal Reserve to have less room to stimulate the economy in the event of a recession owing to already low interest rates, Kashkari said quantitative easing, when the Fed buys bonds to boost market liquidity, could be used again as happened following the 2008 financial crisis.\n\n“I feel like we have more confidence now that if we needed to use (other tools) we would be able to use them maybe even more powerfully than we did in the past,” Kashkari said.\n\nThe Fed is currently divided on the need to further lower borrowing costs. The benchmark overnight lending rate was lowered to a target range between 1.75% and 2.0% after a 7-3 vote in favor of the move at the central bank’s last meeting in September.\n\nThe Federal Reserve next meets on Oct. 29-30 and investors currently expect a rate cut at that policy meeting. Kashkari does not currently have a vote on monetary policy but will next year as part of the Fed’s rotation system.", "description": "The U.S. Federal Reserve should continue to cut interest rates in order to offset growing risks to the economy, Minneapolis Federal Reserve Bank President Neel Kashkari said on Monday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191007&t=2&i=1438103917&w=1200&r=LYNXMPEF9610V", "published_at": "2019-10-07"}