{"pub": "zdnet", "url": "https://www.zdnet.com/article/tu-ora-data-breach-exposes-medical-data-of-one-million-new-zealand-residents", "downloaded_at": "2019-10-08 10:26:19.122277+00:00", "title": "Tū Ora Compass Health data breach exposes medical data of one million people", "language": "en", "text": "The true cost of a data breach in 2019 Wendi Whitmore, IBM X-Force global lead for incident response and intelligence services, talks to Tonya Hall about how the cost of data breaches is determined by the time it takes to detect and respond to the breach.\n\nTū Ora Compass Health has revealed a data breach resulting in the potential exposure of sensitive medical information belonging to one million individuals.\n\nThe primary health organization (PHO), formerly known as the Greater Wellington Health Trust, provides healthcare services when contracted by entities including GPs and community groups. Compass Health, in its present-day state, is the result of a merger of four PHOs -- Capital PHO, Tumai Mo Te Iwi, Kapiti PHO, and Wairarapa PHO.\n\nOn October 5, the PHO said its website was defaced during a cyber incident that occurred in August. The public compromise of the website led to an investigation into Compass Health's overall IT systems and security posture, leading to the discovery of cyberattacks dating back from 2016 to March 2019.\n\nCompass Health says it holds information on users as far back as 2002 from the greater Wellington, Wairarapa and Manawatu regions in New Zealand. Anyone registered with a medical center during the 2016 - 2019 timeframe may be impacted.\n\nSee also: Hey Google: What we search for most in cybersecurity .. cyber security?\n\n\"The current population of these areas is around 648,000 people, but including those now deceased, or, who have moved away from the area, the data covers nearly one million people,\" the organization says.\n\nThe organization says it holds data including who is registered at what medical center, National Health Index Numbers, names, dates of birth, ethnicity, and addresses.\n\nPHOs collect and analyze primary health data on long-term conditions, demographics, immunization records, diabetes checks, cervical screening logs, and flu shot records for those over 65 years of age.\n\n\"We also hold some organizational financial data for the practices and other health care providers that we work with e.g. invoices and account details, that enable us to pay for services delivered,\" the PHO added.\n\nCNET: US negotiates sharing electronic evidence internationally\n\nCompass Health said that no GP notes are stored and therefore should be safe. No banking, financial account data, passport numbers, driver license numbers, or, tax numbers belonging to patients have been involved in the security breach.\n\nThe PHO added that it \"cannot say for certain\" whether or not patient information was stolen but it is necessary to \"assume the worst.\"\n\nAfter filing a complaint with law enforcement, the PHO has begun to work with the National Cyber Security Centre and the Ministry of Health to investigate how the cyberattacks were able to take place.\n\nTechRepublic: Shifting allegiances of hackers causing confusion for defense efforts\n\n\"We are devastated that we weren't able to keep people's information safe,\" said Martin Hefford, CEO of Compass Health. \"While this was illegal and the work of cybercriminals, it was our responsibility to keep people's data safe and we've failed to do that.\"\n\nThe organization added that in light of the security incidents it plans to shift to a modern and more secure platform through Microsoft Azure. The move is expected to be completed by April 2020.\n\nPrevious and related coverage\n\nHave a tip? Get in touch securely via WhatsApp | Signal at +447713 025 499, or over at Keybase: charlie0", "description": "The health organization has admitted its failure in safeguarding user data.", "authors": ["Charlie Osborne"], "top_image": "https://zdnet3.cbsistatic.com/hub/i/r/2019/10/08/6082bf98-c678-4869-9891-735eb3d1248f/thumbnail/770x578/74efa497264e110cabcd63cf14f9db17/screenshot-2019-10-08-at-09-19-50.png", "published_at": "2019-10-08"}