{"pub": "mirror", "url": "https://mirror.co.uk/news/world-news/paediatrician-accused-reusing-syringes-after-20740854", "downloaded_at": "2019-10-28 13:20:10.165276+00:00", "title": "Paediatrician accused of reusing syringes after 900 children diagnosed with HIV", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAt least 900 children have tested positive for HIV amid allegations a paediatrician repeatedly reused old syringes in Pakistan.\n\nMuzaffar Ghanghro has been charged with negligence, manslaughter and causing unintentional harm following the outbreak in the small city of Ratodero in April.\n\nThe paediatrician, believed to have been charging 16p per visit for the area's poorest parents, works as a GP at a government hospital.\n\nSo far 1,100 people are positive for the virus but health officials fear the number of those infected could be far higher as less than a quarter of the city's 200,000 population has been tested.\n\n(Image: AFP/Getty Images)\n\nThe outbreak came to light when residents fell sick with fevers that resisted treatment, leading to a frenzied panic as they rushed to get tested for the virus.\n\nHealth officials then revealed that many of the infected children had gone to the same paediatrician, Ghanghro.\n\nLocal journalist Gulbahar Shaikh got his children tested as they had been treated by the suspect and was horrified to discover his two-year-old daughter had the virus.\n\n(Image: AFP/Getty Images)\n\nAnother resident, Imtiaz Jalbani, said Ghanghro treated all six of his children and four of them contracted HIV.\n\nHis 14-month-old child and three-year-old daughter have now died.\n\nHe alleges that he saw the paediatrician rummage through rubbish for a syringe to use on his six-year-old son - who also has the virus - and that when confronted Ghanghro claimed he was only doing so because Mr Jalbani was too poor to pay for a new one, according to The New York Times.\n\nGhanghro reportedly insisted he is innocent and never reused syringes, and health officials have said he is unlikely to be the only cause of the outbreak, as there was evidence of numerous doctors reusing syringes.\n\n(Image: AFP/Getty Images)\n\nThey added barbers often use the same razor on multiple customers, and roadside dentists are known to use unsterilized tools.\n\nThe unhygienic practices are thought to be the main cause of Pakistan's soaring HIV rates, according to health officials, who added the virus is likely to be far more prevalent in Ratodero because of how poor it is.", "description": "Since the epidemic emerged 1,100 people in a city in Pakistan have been diagnosed with the virus but the figure is feared to be much higher", "authors": ["Chris Flanagan", "Image", "Afp Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20740697.ece/ALTERNATES/s1200/0_PAKISTAN-HEALTH-HIV-CHILDREN.jpg", "published_at": "2019-10-28"}