{"pub": "reuters", "url": "https://in.reuters.com/article/india-dhfl-debt/shadow-lender-dhfls-resolution-plan-hits-roadblock-idINKBN1W21QF?utm_medium=Social&utm_source=Twitter", "downloaded_at": "2019-09-18 07:24:57.524913+00:00", "title": "Shadow lender DHFL's resolution plan hits roadblock", "language": "en", "text": "A bird flies past a signboard of Dewan Housing Finance Corporation Ltd. (DHFL) outside its office on the outskirts of Mumbai, January 31, 2019. REUTERS/Francis Mascarenhas/File Photo\n\nMUMBAI (Reuters) - A plan to rescue India’s debt-laden Dewan Housing Finance Corporation Ltd (DHFL) has hit a major roadblock as only a small segment of bondholders has agreed to be on board the proposed resolution, according to a custodian of DHFL bonds.\n\nThe process has been further complicated as certain bondholders have also initiated a process to take DHFL to bankruptcy court, the custodian added.\n\nOut of the 87,000 debenture holders who had been asked to be party to the resolution plan being deliberated upon by banks, only 24,400 debenture holders, or less than 30%, had responded before the due date earlier this month.\n\nThe banks have signed an inter-creditor agreement (ICA) to come up with a plan to restructure nearly 1 trillion rupees ($14 billion) of DHFL’s debt. They had been trying to get bondholders on board as well for the plan to succeed.\n\nUnder new central bank rules for resolving bad debts, it is mandatory for 75% of lenders by value and 60% by number to sign the ICA to execute a revival plan which in DHFL’s case can be achieved only with the support of bondholders.\n\nBanks, with an exposure of just about 360 billion rupees, will need support from insurance companies, pension funds and other institutional investors to approve the resolution plan, the deadline for which ends on Sept. 25.\n\nDHFL, one of the largest housing finance companies in India ran into trouble last year soon after the collapse of IL&FS, a shadow banking behemoth. Troubles at both lenders have sparked an acute liquidity crunch which may worsen.\n\n($1 = 71.7650 Indian rupees)", "description": "A plan to rescue India's debt-laden Dewan Housing Finance Corporation Ltd (DHFL) has hit a major roadblock as only a small segment of bondholders has agreed to be on board the proposed resolution, according to a custodian of DHFL bonds.", "authors": ["Nupur Anand", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190917&t=2&i=1430869445&w=1200&r=LYNXMPEF8G161", "published_at": "2019-09-17"}