{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/susanna-clarke-announces-piranesi-her-first-book-since-jonathan-strange-mr-norrell", "downloaded_at": "2019-10-01 15:28:50.441048+00:00", "title": "Susanna Clarke Announces Piranesi, Her First Book Since Jonathan Strange & Mr Norrell", "language": "en", "text": "A look at the TV adaptation of Jonathan Strange & Mr. Norrell. (Image: BBC)\n\nIt’s now been over a decade since Susanna Clarke exploded onto the scene with Jonathan Strange & Mr Norrell, an eye-popping magical adventure. Fifteen years later, she’s finally back with a follow-up novel about a watery labyrinth and its many mysteries. But that’s not all we can expect from Clarke.\n\nAccording to the Bookseller, Bloomsbury has picked up Piranesi, Clarke’s first novel since 2004's Jonathan Strange & Mr Norrell, an alternate history tale set in 19th century England where magic — once a powerful tool — has mostly become a thing of the past. Piranesi is described as an “intricate, fascinating puzzle” centered around a man named Piranesi who lives in a giant house with a multitude of secrets, hinting at something much bigger than the seemingly endless labyrinth... the only world he’s ever known.\n\nPiranesi has always lived in the House. It has hundreds if not thousands of rooms and corridors, imprisoning an ocean. A watery labyrinth. Once in a while he sees his friend, The Other, who needs Piranesi for his scientific research into A Great and Secret Knowledge. Piranesi records his findings in his journal. Then messages begin to appear; all is not what it seems. A terrible truth unravels as evidence emerges of another person and perhaps even another world outside the House’s walls.\n\nJonathan Strange, which took over a decade to write, was a critically acclaimed debut that went on to win the Hugo Award for Best Novel and got adapted into a 2015 television series for the BBC. Fans were eager to see the author return, but her “persistent ill-health” prevented her from diving into another novel; she’s since released a collection of short stories set in the universe of Jonathan Strange, but that’s about it. In a statement, agent Jonny Geller revealed how Clarke had hinted she was ready to start writing again. Much to his surprise... she was basically already done.\n\n“There are a few moments in an agent’s life when something so unexpected and so wonderful pops up in your inbox, you can’t quite believe it,” Geller said. “Susanna hinted she may be writing again after such a long hiatus, but I never really believed a fully imagined world, a perfectly constructed novel, would just be sitting there.”\n\nPiranesi is set to be released in September 2020. According to the Bookseller, Clarke is planning on following up with another novel — though it’s unclear whether it will be a sequel or another original story.", "description": "It’s now been over a decade since Susanna Clarke exploded onto the scene with Jonathan Strange & Mr Norrell, an eye-popping magical adventure. Fifteen years later, she’s finally back with a follow-up novel about a watery labyrinth and its many mysteries. But that’s not all we can expect from Clarke....", "authors": ["David Tracy", "Andrew Couts"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/zquhtgy69koqdk3dwnqr.jpg", "published_at": "2019-10-01"}