{"pub": "yahoo", "url": "https://news.yahoo.com/huawei-debt-bulls-scoff-trump-043549637.html", "downloaded_at": "2019-10-17 06:28:14.192229+00:00", "title": "Huawei Debt Bulls Scoff at Trump Attacks", "language": "en", "text": "(Bloomberg Opinion) -- Blacklisting by the U.S. government, accusations of espionage and the arrest of its chief financial officer haven’t been enough to scare investors away from Huawei Technologies Co.\n\nShares of China’s biggest telecoms equipment and smartphone maker aren’t publicly listed, making its equity largely unavailable to outsiders. Its bonds, however, do trade and have continued their upward trajectory over the past year, impervious to Donald Trump’s best efforts to make Huawei the biggest scalp in his trade war with China.\n\nFour different series of U.S. dollar bonds, with maturities in 2022 through 2027, have climbed as much as 5.6% since a low in December. That’s a lot for fixed-income markets. Even a massive drop in May — when the Trump administration moved to ban U.S. companies from selling vital components to Huawei — was shrugged off by debt investors within a month. Each of those securities is now within striking distance of record highs.\n\nThe concern at that time, and which persists even today, is that shutting off access to American products such as semiconductors and software would hobble the world’s second-biggest smartphone maker. U.S. companies including Qualcomm Inc., Broadcom Inc. and Intel Corp. supply parts used in electronics products that are difficult to substitute, especially given that China lags behind in chip technology.\n\nEven a ban on Alphabet Inc.’s Google from supplying bits of its Android operating system to Huawei was considered a major blow, since Android is used on more than two-thirds of smartphones. The prohibition follows the December arrest of CFO Meng Wanzhou, who was detained in Canada at the request of the U.S. over allegations that include lying about the company’s dealings with Iran.\n\nDebt investors brushed off these worries, perhaps believing that Huawei’s status as a national hero coupled with its deep technological abilities ensure that the company would be able to pay its debts. Huawei was sitting on $39 billion of cash and short-term investments at the end of last year, with just $10.2 billion in total borrowings, according to its latest annual report.\n\nThat makes Huawei’s $4.5 billion in outstanding bonds a trifle. And in the context of a slowing Chinese economy and concerns about the pileup of debt throughout the nation’s financial system, Huawei looks like one of the safest bets around.\n\nSuch bullishness was rewarded this week when Huawei announced nine-month sales figures. Rather than get strangled by all those forces working against it, the Shenzhen-based company posted a 25% increase in third-quarter revenue to 209.5 billion yuan ($30 billion), according to my calculations. That’s 5% less than the prior quarter, but not the apocalyptic scenario many had expected. Importantly, it managed to maintain the 8.7% net profit margin it posted in the first half, which is actually higher than the same figure for full-year 2018.\n\nAll of this goes to show that no matter what the U.S. and the economy throw at it, Huawei will be fine. Or at least its debt holders will.\n\nTo contact the author of this story: Tim Culpan at tculpan1@bloomberg.net\n\nTo contact the editor responsible for this story: Patrick McDowell at pmcdowell10@bloomberg.net\n\nThis column does not necessarily reflect the opinion of the editorial board or Bloomberg LP and its owners.\n\nTim Culpan is a Bloomberg Opinion columnist covering technology. He previously covered technology for Bloomberg News.\n\nFor more articles like this, please visit us at bloomberg.com/opinion\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg Opinion) -- Blacklisting by the U.S. government, accusations of espionage and the arrest of its chief financial officer haven’t been enough to scare investors away from Huawei Technologies Co. Shares of China’s biggest telecoms equipment and smartphone maker aren’t publicly listed, making", "authors": ["Tim Culpan"], "top_image": "https://s.yimg.com/uu/api/res/1.2/pSre.Ykba4Opn3mrEoo17A--~B/aD04MzQ7dz0xMjk2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_opinion_268/d45b1ba18faf66f0b070ee3ab02effb2", "published_at": "2019-10-17"}