{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/27/no-20-michigan-hopes-to-bounce-back-with-win-over-", "downloaded_at": "2019-09-27 09:29:39.835745+00:00", "title": "No. 20 Michigan hopes to bounce back with win over Rutgers", "language": "en", "text": "ANN ARBOR, Mich. (AP) - Jim Harbaugh faces one of his biggest challenges in five seasons at Michigan.\n\nThe 20th-ranked Wolverines fell behind by five touchdowns last week at Wisconsin before scoring the last two touchdowns, scores that did little to take away the sting of the humiliating defeat.\n\n“That was a bad day,” Harbaugh acknowledged. “That was not a banner day for Michigan. It can turn into two losses, and we won’t let one loss turn into two.”\n\nMichigan (2-1, 0-1 Big Ten) seems to have a good shot to bounce back, hosting Rutgers (1-2, 0-1) on Saturday in a game it is expected to win by four touchdowns. The Scarlet Knights have been outscored in their last two games 60-16 against Iowa and Boston College.\n\nThe Wolverines, though, are not in a position to be overly confident against any opponent after getting routed by the Badgers.\n\n“It was pretty obvious to everybody that watched it, the entire football world,” Harbaugh said. “From A to Z, it wasn’t good. It wasn’t good enough. Not acceptable. It starts, really, with not acceptable for me.”\n\nHere are some things to watch at the Big House:\n\nART AGAIN\n\nRutgers sophomore quarterback Art Sitkowski had his best game of his short college career against Boston College. With graduate transfer Carter McLane in concussion protocol, Sitkowski will start against the Wolverines.\n\nSitkowski was 23 for 33 for 304 yards and one touchdown in the loss to Boston College, throwing a late interception.\n\nBLACK AND BLUE\n\nMichigan quarterback Shea Patterson hurt his oblique in the opener and appeared to have a shoulder injury at Wisconsin. His backup, Dylan McCaffrey, was also hit hard by the Badgers and is likely out this week with a concussion.\n\n“We’ve got to do a better job of protecting the quarterback,” Harbaugh said. “Shea is a tough guy, but we have to give him time.”\n\nPatterson completed 43.8% of his passes last week, barely surpassing his career low.\n\nFLAGS GALORE\n\nRutgers coach Chris Ash has a lot of things to fix. Cutting down penalties may be at the top of the list. The Scarlet Knights rank 125th nationally, averaging 8.3 penalties for 80.3 yards to rank last in the Big Ten. They had 11 penalties for 100 yards against Boston College last week.\n\n“Penalties killed drives, put us behind the sticks several times,” Ash said. “Every time we seemed to get something going, we would shoot ourselves in the foot, and that was disappointing.”\n\nRutgers averaged 51.8 yards in penalties during Ash’s first three seasons.\n\nTRYING HARDER\n\nAt times, the Wolverines looked like they may have given up against the Badgers.\n\n“There were some plays where effort could’ve been better,” offensive tackle Jon Runyan said.\n\nWARMING SEAT\n\nAsh has won just two of his last 15 games, including 10 straight Big Ten games. He is 8-31 overall in three-plus seasons and 3-25 in the conference.\n\n___\n\nMore AP college football: https://apnews.com/tag/Collegefootball and https://twitter.com/AP_Top25\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Jim Harbaugh faces one of his biggest challenges in five seasons at Michigan.", "authors": ["The Washington Times Http", "Larry Lage"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/20/college_football_picks_21755_c0-280-4642-2986_s1770x1032.jpg?fed4e2db4a5642acee493cb264aba56a3280bad3", "published_at": "2019-09-27"}