{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7595725/Duchess-Meghans-emotional-interview-damaging-royals-claims-royal-expert.html", "downloaded_at": "2019-10-21 09:49:25.078382+00:00", "title": "Duchess Meghan's emotional interview was 'very damaging' for royals, claims royal expert", "language": "en", "text": "Duchess Meghan's emotional interview, where she claimed nobody had asked her whether or not she was 'okay', could be 'very damaging' to the royal family, says a royal expert.\n\nRoyal editor Russell Myers appeared on Lorraine today to speak about the documentary in which Meghan, 38, revealed she's found it difficult to cope since marrying Prince Harry, 35, and giving birth to their son Archie.\n\nThe expert alleged that the interview could be the 'beginning of the end' of the couple's relationship with Harry's family - because her comments reflect poorly on the other royals.\n\nHe explained that her comments insinuation that likes of Prince Charles and his wife Camilla, and Prince William and Kate Middleton are unconcerned about the well-being of Meghan, despite them all being aware of the 'struggles she's going through'.\n\nDuchess Meghan was close to tears as she spoke about her 'struggle' in the spotlight during an interview for ITV documentary 'Harry and Meghan: An African Journey'\n\nThe expert alleged that the interview could be the 'beginning of the end' in terms of the couple's relationship with Harry's family , including the Duke and Duchess of Cambridge who are pictured here on their royal tour of Pakistan\n\nHe said: 'Meghan is struggling. The very powerful moment where she says nobody has asked her if she's okay, I think that was very raw and very emotional.\n\n'But I think this is potentially very damaging for the royal family as well.\n\n'Because what does she mean by that? Does she mean that Prince Charles, Prince William, Kate, Camilla, have not asked her how she is?\n\n'They obviously understand the struggles she's going through as well.'\n\nHe alleged that her accusation of nobody asking whether she's 'okay' suggested that senior royals, including Prince Charles and Camilla Parka Bowles, were unconcerned with her well-being\n\nHe went on to explain that he's been on engagements with the royal couple where the pair 'don't look like they're having fun', and compared their recent tour of Africa to the Duke and Duchess of Cambridge's recent tour of Pakistan.\n\nHe said: 'At its base they don't look very happy, they look like they're struggling in the public eye.\n\n'When I've been on engagements with them they don't look like they're having fun - a lot of comparisons were made with William and Kate's tour of Pakistan.\n\n'They looked like they were having a good time.\n\nHe appeared on Lorraine today to share his view on the royal couple's and shared that while on engagements with the couple, he doesn't think they 'have fun'\n\n'Will they be stepping away? We could be seeing the beginning of the end with their relationship with the royal family.'\n\nIn the same documentary, Harry seemingly confirmed a rift with his brother as he acknowledged there had been deepening tensions between himself and William, following months of speculation about the state of the brothers’ relationship.\n\nRussel revealed that for the last few months palace aides have been 'at odds to really damp this down'.\n\nHe said: 'He confirmed these reports that have been spoken about for the best part of a year.\n\nIn the same documentary, Harry seemingly confirmed a rift with his brother as he acknowledged there had been deepening tensions between himself and William\n\nRussell said Meghan was 'very, very vulnerable' and revealed that the family are considering permanently moving away following their break from the spotlight\n\n'For the best part of a year palace aides have been at odds to really damp this down throughout the last few months and now we've got confirmation there has been a falling out.'\n\nThe expert added that Meghan and Harry are even considering moving abroad to escape the spotlight.\n\nHe said: 'They're taking a break now. Looking at Meghan she looks very, very vulnerable and they're even thinking about moving away.'", "description": "Appearing on today's episode of Lorraine, royal editor Russell Myers said that Meghan's claim that nobody has asked if she's OK, insinuates that the likes of Kate and William are not supportive.", "authors": ["Monica Greep For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/10/19982198-0-image-a-10_1571648879411.jpg", "published_at": "2019-10-21"}