{"pub": "mirror", "url": "https://mirror.co.uk/news/world-news/couple-wedding-40-age-gap-20536293", "downloaded_at": "2019-10-08 15:10:01.425969+00:00", "title": "Woman, 33, plans to wed OAP lover 40 years her senior after meeting at bus stop", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA woman has revealed how she fell for a man 40 years her senior - and says they now have plans to get married as soon as possible.\n\nRachael Roberts, 33, met old age pensioner Nev McDermott five years ago at a bus stop near their home in Anna Bay, New South Wales, Australia.\n\nTheir whirlwind romance began when Ms Roberts, then aged 28, offered Nev a lift in her car after noticing he had undergone a knee replacement.\n\nDescribing him as \"pretty handsome for an old fella\", Rachel says she was not put off by the huge age gap between them.\n\n(Image: Medavia)\n\n(Image: Medavia)\n\nDuring the drive they struck up a conversation and soon began talking about more personal matters.\n\n\"Nev knew I’d recently lost my lovely dad Allan to a heart attack, so he asked how me and my mum Hazel, 63, were coping.\n\n\"We missed Dad dearly – and without him, the yard work had piled up.\"\n\nNev said he wanted to help out around the house and was soon coming around everyday to visit.\n\nThey soon struck up a close bond while weeding and gardening, discovering they both loved bands the Bee Gees and Nickelback and adored wildlife.\n\n(Image: Medavia)\n\n(Image: Medavia)\n\n\"After spending every day together for about a month, I felt sad when the sun went down and Nev went home, Rachael said.\n\n\"If I go to bed early, I’ll wake up quicker and he’ll be back.\"\n\n\"It seemed like he was making excuses for us to spend more alone time together too. We were driving to hardware store Bunnings daily to get extra nails and screws!\"\n\nAbout two months into their friendship Nev decided to confess his feelings for Rachael while having coffee together in a local cafe.\n\n\"I’ve got a mate who has feelings for someone much younger than him,’ he said. \"He doesn’t know if he should tell them..\"\n\n(Image: Medavia)\n\nRachael said: \"Neither of us had been in love before, but there was no mistaking our connection.\n\n\"Within a few days I’d asked Nev to move in with me and Mum.\"\n\nShe added: \"Nev was worried, but he needn’t have been, as Mum gave him a big hug.\n\n\"Nev and Mum got on like a house on fire – she particularly loved that my boyfriend was a whiz in the kitchen.\n\nRachael says their relationship became the talk of their small town - with a cruel rumour claiming she was a golddigger.\n\n\"Our family and friends were happy for us, and we were ecstatic - that’s all that mattered\".\n\n(Image: Medavia)\n\n\"Every day with Nev was an adventure. We both loved fishing and swimming. And sometimes, when it rained, Nev would grab my hand and we’d run outside and dance!\"\n\nLast November, Nev decided to pop the question after four years together.\n\n\"With Nev now 73, we want to say ‘I do’ as soon as we can. We’ve been asking people to generously donate a venue, flowers, anything, to help us get our special day.\n\n\"Sadly, at Nev’s age, we won’t get a lifetime together.\n\n(Image: Medavia)\n\n\"Still, we’d rather quality than quantity.\n\n\"If I fell pregnant, we’d be ecstatic, but I know it’s unlikely – and I’ve made my peace with it. Nev’s worth it.\n\n\"Our time together is precious and we won’t waste a single second worrying what anyone thinks.\"", "description": "Rachael Roberts, 33, met partner Nev McDermott, 73, at a bus stop near her home in Anna Bay, New South Wales, Australia, four years ago", "authors": ["Beth Young", "Image", "Medavia"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20536565.ece/ALTERNATES/s1200/0_PAY-THP_CHP_081019Slug_10485JPG.jpg", "published_at": "2019-10-08"}