{"pub": "yahoo", "url": "https://news.yahoo.com/polls-show-americans-have-come-to-support-trumps-impeachment-much-faster-than-nixons-or-clintons-155418911.html", "downloaded_at": "2019-10-18 01:08:17.477237+00:00", "title": "Polls show Americans have come to support Trump's impeachment much faster than Nixon's or Clinton’s", "language": "en", "text": "Welcome to 2020 Vision, the Yahoo News column covering the presidential race with one key takeaway every weekday and a wrap-up each weekend. Reminder: There are 109 days until the Iowa caucuses and 383 days until the 2020 election.\n\nFor the first time, a majority of Americans said this week that they supported the impeachment of President Trump. Not just in one, outlying poll — in an average of all current national polls compiled by the data journalists at FiveThirtyEight.\n\nFor Trump this polling milestone comes less than one month after reports first surfaced of a Ukraine whistleblower and roughly three weeks after House Speaker Nancy Pelosi announced the start of a formal impeachment inquiry — meaning that it represents a historical milestone as well.\n\nTrump hasn’t just crossed the 50 percent threshold on impeachment, peaking at 50.3 percent earlier this week. He’s gotten there faster than Richard Nixon — and, for that matter, Bill Clinton, who never got there at all.\n\nLet’s rewind. From start to finish, the Watergate scandal took more than two years to unfold. The break-in at the Democratic National Committee headquarters occurred in June 1972; Nixon was reelected that November; the burglars’ trial began in January 1973; top White House aides resigned in April; a special prosecutor was appointed in May; the Saturday Night Massacre went down in October; formal impeachment proceedings began in May 1974; the House Judiciary Committee passed articles of impeachment in July; and Nixon resigned in August.\n\nPhoto: Win McNamee/Getty Images More\n\nBut for the vast majority of that time, public support never passed the 50 percent mark. In June 1973, right after the Senate Watergate Committee launched televised hearings, only 19 percent of Americans told Gallup that Nixon should be impeached and removed from office. By November, after the Saturday Night Massacre, that number had ticked up to 38 percent. But it wasn’t until August of the following year — after articles of impeachment had been approved and after the Supreme Court forced Nixon to release the transcript of a “smoking gun” tape that showed he had helped orchestrate the cover-up — that a majority of Americans came around to the view that he should be impeached and removed.\n\nIn other words, if you start the clock with the Senate hearings, it took 14 months for Nixon to get where Trump has gotten in one. Start with formal impeachment proceedings — which began three months before support for Nixon’s impeachment breached 50 percent — and Trump still outpaces his ignominious predecessor by some distance.\n\nThe contest with Clinton, meanwhile, isn’t even close. In early 1998, Clinton denied that he’d had a sexual relationship with Monica Lewinsky, both publicly and in a sworn deposition; in August he admitted that he’d lied; in September independent counsel Kenneth Starr released a report accusing Clinton of committing perjury and trying to influence witnesses to hide the affair; in October the House Judiciary Committee launched a formal impeachment inquiry; in December the House approved two articles of impeachment against Clinton; and in February 1999 the Senate rejected both articles, acquitting the president.\n\nThroughout that entire process, however, public sentiment barely budged: Polls consistently showed that only a quarter to a third of Americans favored Clinton’s impeachment. The highest that number ever got — retrospectively, in late 1999 — was 44 percent, which is still 5 to 6 percentage points lower than Trump’s number today.", "description": "President Trump hasn’t just crossed the 50 percent threshold on impeachment, peaking at 50.3 percent earlier this week. He’s gotten there faster than Richard Nixon — and, for that matter, Bill Clinton, who never got there at all.", "authors": ["Andrew Romano", "West Coast Correspondent"], "top_image": "https://s.yimg.com/uu/api/res/1.2/6chInFwjBRmtbDvvnIWIwA--~B/aD0yNTEwO3c9MzU2MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/1105bac0-f0f6-11e9-a322-999b676dcb36", "published_at": "2019-10-17"}