{"pub": "yahoo", "url": "https://news.yahoo.com/smith-jada-pinkett-smith-staged-104535923.html", "downloaded_at": "2019-09-24 14:06:05.824242+00:00", "title": "Will Smith and Jada Pinkett Smith staged an 'intervention' after son Jaden's vegan diet left his skin looking ‘grey’", "language": "en", "text": "Will Smith and Jada Pinkett Smith have revealed that they were forced to stage an “intervention” when their son Jaden started “wasting away” after adopting a vegan diet.\n\nThe Hollywood couple revealed how Jaden’s diet left them feeling “very nervous” when he started to lose weight and look “drained.”\n\n“Will and I had a bit of an intervention with Jaden because he’s a vegan now, but we realised he wasn’t getting enough protein,” Pinkett Smith, 48, revealed on her Facebook Watch show Red Table Talk.\n\n“So he was wasting away. He just looked drained, he was just depleted, he wasn’t getting the nutrients.”\n\nDiscussion: The family opened up about their diets in the new episode (Facebook Watch / Red Table Talk) More\n\nHer husband recalled that their son, now 21, had “dark circles under his eyes,” adding: “There was even a little greyness to his skin and we got really nervous but you’re definitely looking better now.”\n\nJaden then clarified that he is now vegetarian after he “tried to be vegan,” telling his parents: “I’ve tried to eat vegan meals, I’ll go vegan for a week or so but for the past year I’ve been vegetarian.”\n\nDrained: Jaden's parents were concerned he was More\n\nHe revealed that he would often eat “two meals a day, maybe one,” adding: “Maybe just that one big meal and I’m like ‘Oh, you know, I didn’t get around to it.”\n\nIn July, the musician marked his 21st birthday by launching a vegan food truck that served free food to the homeless community in Los Angeles.\n\nPinkett Smith’s Facebook Watch show sees her discuss a range of issues with her mother Adrienne Banfield-Jones and daughter Willow Smith.\n\nSpeaking to Standard Online earlier this year, the actress revealed that she uses her past experiences of being interviewed to help her guests - including Gabrielle Union, Toni Braxton and Tiffany Haddish - “open up.”\n\n“It’s easy for me because I’ve been on the other side of being interviewed for so many years,” she said. “So all I think about is, ‘what would I need in order to open up?’”\n\nRed Table Talk is available to stream on Facebook Watch now.\n\nRead more\n\nWill Smith and Martin Lawrence reunite in Bad Boys for Life trailer\n\nWill Smith Face Swaps with Jada Pinkett Smith in hilarious video\n\nWill Smith joins co-stars on 'magic carpet' for Aladdin premiere", "description": "Will Smith and Jada Pinkett Smith have revealed that they were forced to stage an “intervention” when their son Jaden started “wasting away” after adopting a vegan diet.The Hollywood couple revealed how Jaden’s diet left them feeling “very nervous” when he started to lose weight and look “drained.”", "authors": ["Katie Rosseinsky"], "top_image": "https://s.yimg.com/uu/api/res/1.2/XjRJduAlR5q4yMBKQPX8kA--~B/aD0zODM7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/evening_standard_239/33517ff3ae950e32d0a89ac9792d736e", "published_at": "2019-09-24"}