{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/chase-fans-reckon-answer-harsh-20715419", "downloaded_at": "2019-10-25 00:42:14.447367+00:00", "title": "The Chase fans reckon answer to 'harsh' question is completely wrong", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nFans of ITV's The Chase have slammed the show for an answer to a question they think is wrong.\n\nAlun from Cardiff was going up against the formidable Shaun \"The Dark Destroyer\" Wallace when host Bradley Walsh read out the question which would make or break his round.\n\nGetting the right answer would have boosted Alun's team's find up to £18,000.\n\nBradley asked: \"Which of these is the act of accidentally phoning someone when carrying a mobile phone in your back pocket?\"\n\nThe options were \"butt dial\", \"booty call\" or \"bottom ring.\"\n\nAlun, looking confused, chose \"booty call\" and confessed: \"I normally call it a pocket dial but it wasn't up there.\"\n\n(Image: ITV)\n\n(Image: ITV)\n\nBradley seemed just as fazed, admitting: \"Never called it that, butt dial. Never heard of that.\"\n\nShaun confirmed it was the correct answer, catching up with Alun and eliminating him from the game.\n\nBradley looked crestfallen on his behalf, shaking his hand and wishing the best for him and his family.\n\n(Image: ITV)\n\nFans headed over to Twitter to vent the frustration they felt on Alun's behalf.\n\nOne asked: \"Since when was it called butt dial? #thechase.\"\n\nAnother reckoned it was an American thing: \"It's not a butt dial. It's a bum dial. We're not American...\"\n\nA third was even more angry: \"Nobody calls it a f*****g butt dial either #TheChase.\"\n\nA fourth was less sympathetic, laughing: \"As if some guy on The Chase got beaten by the chaser because he thought the term butt dial was actually booty call.\"\n\nShaun's been stirring drama on the show recently after his chilly responses to player Kelly's blatant romantic advances.\n\nAfter he had caught up and beaten her in the game, she could be seen mouthing: \"I love you. Call me.\"\n\n\"I'm going back to the library,\" Shaun threatened after Bradley joked he could picture the two of them taking a stroll together hand-in-hand.", "description": "Even host Bradley Walsh admitted that he'd never heard the answer to a question that had fans and contestants scratching their heads", "authors": ["Rebecca Koncienzcy", "Image", "Itv"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20715842.ece/ALTERNATES/s1200/3_EHP_CHP_241019The-Chase_6754JPG.jpg", "published_at": "2019-10-24"}