{"pub": "guardian", "url": "https://theguardian.com/food/2019/sep/26/fin-to-gill-eating-cook-sustainably-heads-organs-bones", "downloaded_at": "2019-09-26 07:52:53.865881+00:00", "title": "Fin-to-gill eating: how to cook fish without discarding a thing", "language": "en", "text": "When it comes to fish, in Britain we rarely eat anything other than fillets and discard everything else. Now a new breed of chefs is trying to encourage a more adventurous approach\n\nSweetmeats. Tripe. Tongue. You may not have been eating them since 1994, when the chef Fergus Henderson brought us the gospel of eating animals “nose to tail” via his London restaurant St John, but many have. His mantra, and his menu of lamb brains and bone marrow, spawned not only a resurgence in offal, but – more recently – an equivalent philosophy for plants: “root to fruit”. Carrot peel, cauliflower leaves, broccoli stems and more have been elevated from compost to plate in a drive to cut food waste that makes Josh Niland’s new The Whole Fish Cookbook almost inevitable. “People keep asking me: ‘Why fish? Why now?’ – but it’s just logical,” says Niland. The time to eat “fin to gill” is long overdue.\n\nFacebook Twitter Pinterest The Whole Fish Cookbook by Josh Niland\n\nThe statistics are staggering: of an 851,984 tonne haul of fish and shellfish, Seafish UK estimates that only 43% ends up on our tables. For cod and haddock, for example, fillets make up just 50% of their whole weight; the rest – head, organs, bones – is discarded or ground into fishmeal. Outside the UK, the US and Australia, Niland’s homeland, however, such discards are delicacies, prized for their flavour and nutritional value. In Iceland, fish stomachs are stuffed with cod’s liver, while in Japan, steamed monkfish livers are a speciality.\n\nSpain, Scandinavia and Asian and African countries with coastlines use “livers, eyeballs and sperm all the time,” says Niland, “but, for me, the question was: how can I get people like my mum to enjoy them?” His answer, developed over a decade of working for Australia’s Stephen Hodges, Heston Blumenthal in the UK and himself at his own Sydney restaurant, Saint Peter, was to put aside convention and reconsider fishmongering as a whole.\n\nFacebook Twitter Pinterest Asian countries with coastlines often use all the parts of fish in their cooking. Photograph: Ivan/Getty Images\n\n“When you remove the fact that you’re handling a fish and start with a clean mind,” Niland says, “so much becomes possible.” At Saint Peter’s adjacent “Fish Butchery”, the counter recalls a butcher’s block, with fish sausages and fish black pudding, while the restaurant menu boasts grouper head terrine and, in a fishy nod to Henderson, toast served with fish bone marrow. “It brings humour – but the conversation behind it is: ‘Why are we chucking it away?’”\n\nSuch techniques are not taught in British chefs’ schools. The chefs and home cooks I speak to who practise it are self-taught, or inspired by less squeamish cultures. An acclaimed chef of 40 years’ standing, Jeremy Lee, of Quo Vadis in London, has vivid memories of his first trips to Spain. “Smoked cod roe on hot buttered toast was something we adored, growing up [in Scotland], but it wasn’t until I visited Catalonia and Basque country that I saw cod tripe, hake throat and curious bits and bobs baked with potato and salsa verde.” A later trip around Norway’s fjords introduced him to “poached pieces of cod’s liver and roe with boiled potatoes” – and he was struck by the simplicity of the dish, which required only basic equipment. This Scandi speciality demonstrated just how easy it is to create something “fruity and delightful” from fish offal, an ease Lee emulates in Quo Vadis’s fish pate (which mixes the smoked livers and hearts of herring with the meat itself) and hearty, bones-and-bits-based veloutés.\n\nFacebook Twitter Pinterest Bottarga – grey mullet roe – is a Mediterranean delicacy. Photograph: Getty Images/iStockphoto\n\nAs Jeremy Chan, of the West African-inspired British restaurant Ikoyi, observes, favouring fillets at the expense of all else is a modern phenomenon. Garum, a fermented fish sauce that is “basically organs, water and salt”, has been around since antiquity. For much of history it was unthinkable to chuck anything edible away. “If you think about a family in the hills of Campania rearing a pig, do you think they are just going to eat the loins and fillets?” Niland asks. “They’re going to use everything.” Joe Bloggs is unlikely to make John Dory liver terrine, or dry-age their fish as per Saint Peter, but Niland’s aim with his book is mainly to encourage us to use our fishmongers better, and more. “I wouldn’t buy fish at the supermarket. Go specifically to somebody who is passionate about working with fish. Take my book and ask: ‘Can you keep the bones? Leave the head on?’ And they’ll say: ‘Yes – I just never saw it as marketable.’”\n\n“There needs to be more demand,” Lee agrees. “My local fishmonger, Fin & Flounder, has always been very amenable. I just need to call them.” Not only is this environmentally sound but, if your fishmonger is anything like the food writer Sue Quinn’s, it’s also pounds in your pocket: “Generally, the fishmonger throws the bones and trimmings away, but I take them off his hands because it’s treasure, and it’s free.”\n\nNiland wrote his book around species that are seasonal and native to Australia, but the principles apply elsewhere (he provides suggestions). At Ikoyi, in hake or turbot season, two or three tables a night will be treated to fish heads, the cheeks roasted into sweet nuggety morsels, the bones sticky and finger-licking good. “We buy in whole fish and feed people accordingly,” Chan says. It’s more interesting for both chefs and customers. This isn’t necessarily a restaurant thing, says Imogen Davis, chef and co-founder of Native in London. If you have done a fish filleting course or can follow YouTube tutorials, a whole fish is “a good place to start for home cooks. Fish cheeks can be used in a fish chowder, scrap bits of trim can make fishcakes and, if you batter and deep fry the collars, you can make the meatiest, most juicy fish and chips.”\n\nFacebook Twitter Pinterest Fish-head terrine, one of the dishes in The Whole Fish Cookbook\n\nI like the sound of the “tongue in cheek” ravioli suggested by Adam Handling of the Frog restaurants, for the pun as much as the zero-waste mentality. “Fish tongue, throat and cheeks are delicious. You don’t have to do much to make them taste good,” he says, of an approach to fish that is as much about “commercial sense” as it is “saving the planet”. “My staff value the ingredients, but they also value every penny going in and out of the kitchen.”\n\nFor readers balking at Niland’s eyeball crackers and puffed bladders, Quinn’s advice is, don’t panic. “The gills-to-fin approach can be tricky for home cooks – whipping up a weeknight supper using fish scales or eyeballs just isn’t going to happen in most households – but there are little things everyone can do.” Her suggestion of crumbing the cheeks and frying them up “like goujons” seems deliciously doable, as does transforming bones and heads into soups and risottos. The journey toward fish sustainability seems long and slippery, but it can start with a single stock.\n\nThe Whole Fish Cookbook by Josh Niland is published by Hardie Grant (£25)", "description": "When it comes to fish, in Britain we rarely eat anything other than fillets and discard everything else. Now a new breed of chefs is trying to encourage a more adventurous approach", "authors": ["Clare Finney"], "top_image": "https://i.guim.co.uk/img/media/16e46891e806a81949f8b5a6481b4c30ccc97858/277_227_4737_2843/master/4737.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ab780d9a7592ce3f4f99d618d1215290", "published_at": "2019-09-26"}