{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7570137/Bride-Prejudices-Nathan-reveals-Codie-Leas-X-rated-trick.html", "downloaded_at": "2019-10-15 00:06:43.554997+00:00", "title": "Bride & Prejudice's Nathan reveals Codie Lea's X-rated trick", "language": "en", "text": "They're the Gold Coast-based couple who have become inseparable since meeting at the races in 2015.\n\nAnd on Monday's episode of Bride and Prejudice: The Forbidden Weddings, Nathan and Codie Lea were certainly brazen when it came to their dinner table conversation.\n\nIn front of their co-stars, the 25-year-old FIFO worker revealed his blonde fiancée's X-rated sex trick involving a grapefruit.\n\n'Nothing else can top it': Bride & Prejudice's Nathan, 25, revealed Codie Lea's X-rated sex trick involving a grapefruit, on Monday night's episode\n\nEarly on in the episode, Codie Lea said that she's only got sex on the brain.\n\n'All day in my head it's been \"sex, sex, sex\" and we get to dinner and it's \"wine, sex, wine, sex\",' she confessed.\n\n'So there's not really much on my mind apart from wine and sex!' she added.\n\nOnce at the dinner table, the bold confessions continued, with Nathan declaring to the group: 'Codie \"grapefruited\" me.'\n\nConfession: Early on in the episode, Codie Lea, 21, said that she's only got sex on the brain\n\n'So Codie comes to me one day and says, \"I've got a cool trick\", and I said, \"OK\", and she's like, \"I need to turn the lights off and you can't look\",' he continued.\n\n'I ran into the kitchen, I grabbed the biggest grapefruit I could find, I've cut both ends off, I put like a hole in it,' Codie Lea, 21, interrupted.\n\nThe table was noticeably silent except for Jess, 38, who exclaimed: 'Oh my God!'\n\nCodie Lea and Nathan then encouraged other couples at home to try it out.\n\nDinner table conversation: And once at the dinner table, the bold confessions continued, with the FIFO worker declaring to the group: 'Codie \"grapefruited\" me'\n\nCodie Lea explained to the group: 'I ran into the kitchen, I grabbed the biggest grapefruit I could find, I've cut both ends off, I put like a hole in it'\n\n'Don't knock it 'til you try it,' the mother-of-one remarked in a piece to camera, while Nathan added: 'I don't know what else can top it.'\n\nHe mentioned that the pair had learned the trick from the 2017 film, Girls Trip, starring Tiffany Haddish.\n\nIn one scene, Tiffany shows her friends how to please a man with a grapefruit, using a banana as a lewd instructional device.\n\nRacy: The pair had learned the trick from the 2017 film, Girls Trip, starring Tiffany Haddish (pictured). In one scene, Tiffany shows her friends how to please a man with a grapefruit, using a banana as a lewd instructional device\n\nPrior to appearing in Girls Trip, the term 'grapefruiting' was made popular by the viral video, Angel's Grapefruit Technique, released in 2014.\n\nIn previous episodes, Codie Lea has had to deal with 'mother-in-law from hell' Laurelle, who called her a 'plastic c**t' during a tense confrontation.\n\nAnd in another shocking scene, Laurelle threatened to take her son Nathan to court for visitation rights to see her two-year-old granddaughter, Starr-Armani.\n\nDrama: In previous episodes of Bride and Prejudice, Codie Lea has had to deal with 'mother-in-law from hell' Laurelle, who called her a 'plastic c**t' during a tense confrontation\n\n'Codie is a plastic Barbie girl and I don't think she's human,' Laurelle said.\n\n'She has taken my son and my granddaughter away, and if she was on fire I wouldn't even spit on her... I hate her guts.'\n\n'You're a plastic b***h!' Laurelle later raged during a sit-down with Codie Lea.\n\n'Everything on you is fake. Fake hair, fake lips, fake boobs, fake eyelashes, fake tan - you're plastic!'", "description": "On Monday's episode of Bride and Prejudice: The Forbidden Weddings, Nathan and Codie Lea were certainly brazen when it came to their dinner table conversation", "authors": ["Kristy Johnson For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/08/19681154-0-image-a-10_1571039521921.jpg", "published_at": "2019-10-14"}