{"pub": "yahoo", "url": "https://news.yahoo.com/week-hell-leaves-trump-seeking-101328151.html", "downloaded_at": "2019-10-21 11:31:08.942547+00:00", "title": "Week From Hell Leaves Trump Seeking New Start", "language": "en", "text": "(Bloomberg) -- Want to receive this post in your inbox every day? Sign up for the Balance of Power newsletter, and follow Bloomberg Politics on Twitter and Facebook for more.\n\nIn a presidency defined by chaos and controversy, last week was still a rough one for Donald Trump.\n\nBeset with an impeachment inquiry that polls show is resonating with voters, Trump struggled to gain traction via a partial trade deal with China and a U.S.-brokered cease-fire in northern Syria.\n\nNow he needs to turn the corner after one of the most calamitous stretches of his presidency where he’s been weakened by self-inflicted missteps.\n\nThe cease-fire hasn’t quelled criticism from fellow Republicans — whose support he’ll need as he fights impeachment — that his decision to withdraw U.S. troops from northern Syria abandoned Kurdish allies. The Chinese, meanwhile, suggested Trump was prematurely touting a trade deal, the status of which remains unclear.\n\nThen there was his weekend reversal of the decision to hold next year’s Group of Seven summit at his Doral golf resort in Miami — a move that led even some die-hard Trump fans in Congress to say he’d gone too far.\n\nThe president has an opportunity to set the tone for the week at a late-morning Cabinet meeting. In the past, they’ve morphed into contests where officials vie to offer the most effusive praise for Trump. This latest one could be a more somber affair.\n\nGlobal Headlines\n\nBrexit push | With 10 days before the U.K.’s scheduled departure from the European Union, Prime Minister Boris Johnson’s government will try to put its Brexit deal to the House of Commons, undeterred after lawmakers on Saturday forced him to write to the EU asking for a three-month extension. Today’s gambit puts him on a possible collision course with Speaker John Bercow, who could say asking lawmakers to decide on the same question twice in the same session breaches parliamentary rules.\n\nRead about what happens next and see our special edition from yesterday. U.K. businesses are increasingly frustrated with the Brexit impasse.\n\nClock ticking | Turkey set a deadline of 10 p.m. local time tomorrow for Kurdish militants to leave northern Syria, threatening fresh action against them otherwise. Still, a senior defense official also said the buffer zone was now a 120-kilometer frontier strip between towns on the border, narrower than the 444 kilometers Turkey has said it eventually wants the Kurds to withdraw from.\n\nTurkey’s move against the Kurds has exposed the EU’s near irrelevance in events that shape security in its own back yard. Click here to read how.\n\nHigh-profile advice | Facebook CEO Mark Zuckerberg has privately recommended several potential hires to U.S. Democratic presidential candidate Pete Buttigieg’s campaign, Tyler Pager and Kurt Wagner exclusively report. It’s a rare example of direct political involvement from one of tech’s most powerful executives.\n\nZuckerberg testifies Wednesday before the House Financial Services Committee, which is examining Facebook’s plans to create a crypto-currency. In another 2020 development, Representative Alexandria Ocasio-Cortez said her move to formally endorse Bernie Sanders on Saturday, weeks after the Democratic candidate suffered a heart attack, was an “authentic decision.”\n\nStiff test | Bolivian President Evo Morales’s bid for a fourth term stumbled unexpectedly, with early results from yesterday’s election showing he may face a run-off against former president Carlos Mesa in December. While South America’s longest-serving leader has presided over more than a decade of economic growth, his democratic commitment has been questioned since he ignored the result of a 2016 referendum on presidential term limits.\n\nHeavy hitters | Indonesian President Joko Widodo’s new cabinet is taking shape with some well-known business figures joining his team as he pledges to build a $7 trillion economy by 2045. The most high-profile recruit so far is Nadiem Makarim, co-founder of the nation’s biggest startup, the ride-hailing service Gojek.\n\nWhat to Watch This Week\n\nCanadian Prime Minister Justin Trudeau appears set to retain power in a close election today, but the expected loss of his parliamentary majority may force him to rely on a left-leaning party. Japan enthrones its first emperor in 30 years, Emperor Naruhito, before a crowd of dignitaries from 180 countries tomorrow, including Britain’s Prince Charles and Hong Kong’s Carrie Lam, who left her protest-racked city to attended the ceremonies in Tokyo. Australia’s fiercely competitive newspaper industry shelved rivalries today and published front pages with most of the text redacted to protest what they say is a government campaign to restrict media freedom. Switzerland’s two main environmentalist parties captured about a quarter of the lower house of parliament in yesterday’s election, while the euro-skeptic Swiss People’s Party suffered a setback. Thailand’s government used its slim majority to get the annual budget bill through an initial parliamentary vote, but there’s no guarantee the coalition will survive future tests.", "description": "(Bloomberg) -- Want to receive this post in your inbox every day? Sign up for the Balance of Power newsletter, and follow Bloomberg Politics on Twitter and Facebook for more.In a presidency defined by chaos and controversy, last week was still a rough one for Donald Trump.Beset with an impeachment inquiry", "authors": ["Justin Sink", "Kathleen Hunter"], "top_image": "https://s.yimg.com/uu/api/res/1.2/4zwksWlzKHCnNvRtvgUffA--~B/aD0xMzM0O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/f91eb629abd2526645a3aa1841b730db", "published_at": "2019-10-21"}