{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7573627/Music-festival-inquest-proposals-make-perfect-sense-says-Jennie-Ross-King.html", "downloaded_at": "2019-10-15 04:27:16.277139+00:00", "title": "Music festival inquest proposals 'make perfect sense' says Jennie Ross-King", "language": "en", "text": "The mother of a young woman who died of a drug overdose at a music festival says if pill testing was around at the time her daughter would still be alive.\n\nJennie Ross-King believes that had her daughter Alex, 19, been educated by experts in a pill testing tent she would never have taken a fatal dose of MDMA at the FOMO music festival in January this year.\n\nAlex was one of six young people to die after overdosing on drugs at music festivals across New South Wales between December 2017 and January 2019.\n\nThe deaths of Ms Ross-King, Josh Tam, 22, Nathan Tran, 18, Callum Brosnan, 19, Diana Nguyen, 21 and Joseph Pham, 23, led to a coronial inquest.\n\nNSW state coroner Harriet Grahame's proposed findings were leaked on Tuesday and include major reductions in policing - including strip searches - and the introduction of pill testing.\n\nAlex Ross-King (pictured), 19, was one of six young people to die after drug overdoses at music festivals across New South Wales between December 2017 and January 2019\n\nHer mother Jennie Ross-King (left) told Daily Mail Australia that pill testing could have saved the life of her daughter. 'I know that Alex had the service available she would have used the service,' Ms Ross-King said\n\nWhile it is too late for her daughter, Ms Ross-King told Daily Mail Australia she hopes the changes will save the lives of other young partygoers.\n\n'I know that Alex had the service available she would have used the service,' Ms Ross-King said.\n\n'I also know that Alex would have not only listened to the 'experts', but acted on the information and whatever education they could have given her.'\n\nMs Ross-King said she that since the inquest she had kept in regular contact with the other parents who like her had sat through the inquest after losing children to music festival drug overdoses.\n\nShe said the draft recommendations were 'comprehensive and made perfect sense'.\n\n'I think pill testing is the last post for people that have an intention to take a drug, be it at a music festival and or any other time,' Ms Ross-King said.\n\n'Pill testing and more importantly the peer services that accompany the testing is the last safety net of intervention and education.\n\nHaving heard and read all the information proved to the Coroner... they make perfect sense Jennie Ross-King\n\n'It can be made available to better inform the user at the very moment they intend on taking a drug that is potentially harmful to them.'\n\nThe Daily Telegraph reports that Ms Grahame's leaked draft proposals have angered both NSW Police and the state government, who remain opposed to pill testing.\n\nOne government source said of the draft proposals: 'You might as well legalise drugs at festivals from what is contained in the ­report.'\n\nAs part of her report the state coroner cited her own experience at two festivals she attended, saying the heavy police presence 'made her feel nervous'.\n\nSniffer dogs, strip searches and an overwhelming police presence at music festivals could soon be banned if the draft proposals are agreed to\n\nGroovin The Moo in Canberra trialled pill testing earlier this year. Samples of the drugs were measured and weighed before the testing continued. All results were recorded for future reference\n\nState coroner Harriet Grahame (middle) attends a pill testing demonstration at the Splendour in the Grass music festival in Byron Bay, NSW, earlier this year\n\nAs part of her investigations Ms Grahame cited her own experience at two music festivals she attended in 2019, saying the heavy police presence 'made her feel nervous'\n\n'There were lines and lines of police and dogs. I was surprised at how intense it was,' Ms Grahame said of the experience.\n\nMs Grahame's experience was supported by psychologist Dr Stephen Bright, one of a number of experts to give evidence at the inquest.\n\nDr Bright suggested the overwhelming police presence at the entry gates may have contributed to the spate of deaths, with revellers consuming their supply of drugs in a single dose in a bid to avoid detection.\n\nThe inquest also put the police powers under scrutiny after young people came forward claiming they had been unfairly targeted and humiliated by strip searches.\n\nThe state's law enforcement watchdog, the Law Enforcement Conduct Commission, confirmed it will conduct a three-day investigation into allegations NSW Police are abusing their strip searching rights.\n\nStrip searches are only supposed to be carried out on the field when police believe the urgency and seriousness of the situation requires it.\n\nThe youngest person subjected to the procedure between 2016 and 2018 was just 10 years old.\n\nThe coroner heard a 28-year-old reveller - whose name was suppressed - was told by a female officer at a festival she would make the strip search 'nice and slow' after she denied carrying any drugs.\n\nMs Ross-King attends the inquest into deaths at music festivals in NSW earlier this year. Draft proposals from state coroner Harriet Grahame were revealed on Tuesday, with Ms Ross-King saying they 'made perfect sense'\n\nParents of those who died, Andrew Murphy, Jennie Ross-King, Julie Tam, Matthew King, John Tam and Cornelius Brosnan pose for a photograph outside the inquest in September this year\n\nMatthew King, the father of Alex Ross-King, hugs Cornelius Brosnan, the father of Callum Brosnan, outside the Coroner's Court following the inquest in September this year\n\nThe strip search resulted in no drugs being found on her body, but left her feeling humiliated.\n\nNSW frontbencher Andrew Constance argued the recommendations, if enforced, would do little to stop drug overdoses at festivals.\n\n'If the pure form of the drug is tested and found not to be laced and people still take it, they can still lose their life,' he told reporters in Sydney on Tuesday.\n\n'What we're seeing is young people at these festivals ... dehydrated, overdosing, and they're losing their lives. So I don't see pill testing as the answer.'\n\nBut NSW Greens MP Cate Faehrmann said in a statement the recommendations 'appear to confirm that the government's zero tolerance approach is doing nothing to save lives'.\n\n'No government in the world has been able to stop people taking drugs,' she said.\n\n'More and more countries are recognising that the war on drugs has been a colossal failure and are adopting harm reduction measures and saving lives.'\n\nMs Grahame's final recommendations will be handed down on November 8.", "description": "Jennie Ross-King, who has supported pill testing ever since her daughter Alex, 19, died of an MDMA overdose at a music festival, said she wishes it had of been introduced earlier.", "authors": ["Josh Hanrahan For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/04/19721330-0-image-a-51_1571110455466.jpg", "published_at": "2019-10-15"}