{"pub": "yahoo", "url": "https://finance.yahoo.com/news/waiting-fomc-nice-occasions-dax-102330088.html", "downloaded_at": "2019-10-30 16:08:23.507537+00:00", "title": "Waiting for FOMC. Nice Occasions on DAX, USDMXN and USDTRY", "language": "en", "text": "Yesterday, we talked about SP500, today, I will show You the situation on DAX. We will focus on the long-term as this is the best timeframe to trade shares. For the past two years, DAX was creating an inverse head and shoulder pattern, which bounced from the major up trendline. In the middle of October, the price broke the neckline of this formation, creating a buy signal. With this, the movement towards the highs from 2017 and 2018 seems very probable.\n\nNow, two emerging markets currencies. First one will be a Mexican Peso with the USD. Here, we do have a positive sentiment towards the MXN, mostly thanks to the trade deal between Mexico, US and Canada, which is signed but not yet ratified. Typical market behavior – as for now, we are buying the rumors. Selling the facts can come afterwards. Technically, we are inside of the symmetric triangle pattern. The price is bouncing from its lower line, which can be a good buy signal. On the other hand, the bearish breakout here, will bring as a negative sentiment.\n\nLast is Turkish Lira also in a pair with the USD. Few weeks ago, situation here wasn’t looking good for the TRY. Recent agreement helped a bit but it seems that we are coming back to the weakness of Lira. After the bullish breakout from the symmetric triangle pattern, the price is now breaking the upper line of the wedge. Wedge, in this case, can be considered as a trend continuation pattern and is promoting a further rise.\n\nThis article is written by Tomasz Wisniewski, Director of Research and Education at Axiory\n\nThis article was originally posted on FX Empire\n\nMore From FXEMPIRE:", "description": "Today is a big day, possibly another rate cut from FED and there is a chance that this time it is the last one, at least for now. Ahead of this, stocks are climbing higher and traders are pretty optimistic about the future.", "authors": ["Tomasz Wiśniewski"], "top_image": "https://s.yimg.com/uu/api/res/1.2/7vXnG9OeesaJ0GoZHoJvMg--~B/aD00MTA7dz02MTU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/fx_empire_176/4cb3fd2a15ea397dce167e007a847a8b", "published_at": "2019-10-30"}