{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/arsenal-transfer-chief-raul-sanllehis-20724146", "downloaded_at": "2019-10-25 16:22:48.485435+00:00", "title": "Arsenal transfer chief Raul Sanllehi's telling reaction to Dayot Upamecano question", "language": "en", "text": "Get the biggest Arsenal FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nHead of Football at Arsenal Raul Sanllehi keeps his cards close to his chest where the Gunners' transfer business is concerned.\n\nThe Emirates club went into this summer's window knowing they had a number of areas to strengthen but without the big bucks in which to do so.\n\nBut Arsenal came out the other end looking much stronger after landing the likes of Kieran Tierney, Gabriel Martinelli and David Luiz for relatively small amounts, as well as big-money forward Nicolas Pepe.\n\nIn paying for the Ivorian in installments it seems that Sanllehi pulled off something of a coup, enabling Arsenal to keep pace with the league's big spenders Manchester City, Liverpool and Man United, without putting the club in financial turmoil.\n\n(Image: Arsenal FC via Getty Images)\n\nAs a result, many Gunners supporters trust the transfer guru, and one took the opportunity to ask him about a man the club has seemingly been in pursuit of for a long time: Dayot Upamecano.\n\nFollowing Arsenal's dramatic 3-2 win over Vitoria in the Europa League on Thursday, Sanllehi stopped in his car to speak to a few Gunners fans.\n\nOne asked him: \"Upamecano, 2020?\" to which Sanllehi responded with a laugh.\n\nOf course, it would be very unlikely for Arsenal's Head of Football to admit one way or the other whether the club are actively pursuing someone.\n\n(Image: Bongarts/Getty Images)\n\nBut in Sanllehi refusing to rule it out, some fans are getting excitement.\n\nReacting to the video, one Gunners supporter tweeted: \"Get in there,\" while another posted a gif of Cristiano Ronaldo celebrating.", "description": "Arsenal were linked with the RB Leipzig centre-back throughout the summer transfer window", "authors": ["Jake Polden", "Image", "Arsenal Fc Via Getty Images", "Bongarts Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article18649487.ece/ALTERNATES/s1200/12_Arsenal-Pre-Season-Tour-of-the-United-States.jpg", "published_at": "2019-10-25"}