{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nascar/2019/10/10/stewart-haas-racing-tire-changer-daniel-smith-playoff-return/3936069002", "downloaded_at": "2019-10-11 00:25:58.677508+00:00", "title": "Inspiring Kevin Harvick tire changer back for final stretch of NASCAR playoffs", "language": "en", "text": "CLOSE\n\nAs he prepared to jump off the wall in August 2018 at Bristol Motor Speedway, Daniel Smith felt abnormally calm in changing tires for Kevin Harvick.\n\nHe loosened and tightened lug nuts routinely as cars whizzed by him, while keeping a heavy secret, something only three members of his Stewart-Haas Racing team even knew.\n\nTruth be told: Smith didn’t know if he ever again would change tires. And that concern ranked as the least of his worries.\n\nHe would soon start treatment for Stage 3c testicular cancer, where the cancer had spread to other parts of his body. The American Cancer Society lists the survival rate at 74%, and while not an insurmountable diagnosis, it’s one that will scare even the toughest of individuals.\n\n“I knew that night I was going into surgery in a day or two and I had an uphill climb ahead of me,” Smith said. “My goal then was just being alive. Changing tires was very low on that list.”\n\nDaniel Smith was with Kevin Harvick’s pit crew until August lymph node surgery. The tire changer is back this weekend. (Photo: Andrew Coppley, Harold Hinson Photography)\n\nThe father of three children with the oldest age 4, Smith missed the remainder of the 2018 season. He did everything he could to make it back for the 2019 Daytona 500.\n\n“It’s not often that you see people getting injected with their chemo while they’re doing their workout,” Harvick said. “That’s the type of guy that Daniel is. … He likes his job, but obviously his kids and his family are highly motivating to him.”\n\nSmith has needed that motivation for more than a year. He did return for the 2019 Daytona 500 and worked for much of the regular season. But at Bristol in August, he found himself again on the sideline, this time after surgery to remove lymph nodes in his lower abdomen.\n\nTalladega Superspeedway hosts the fifth race of the NASCAR Cup Series playoffs. (Photo: USA TODAY Sports)\n\nThe 35-year-old Smith had asked his doctors in the spring to wait until the end of the season to perform the surgery. Doctors told him that was not a good option. He then developed a blood clot that delayed the surgery until August, forcing him to miss the last three races of the regular season and the first four of the Monster Energy NASCAR Cup Series playoffs.\n\nHarvick will have Smith changing tires at Talladega Superspeedway as Smith makes another triumphant return this weekend.\n\n“We got all the aggressive stuff that would kill you in six months” with the 2018 surgery, Smith said. “But if I didn’t get those out and I just left them in there, those lymph nodes could potentially continue to grow and that teratoma would invade my other organs.”\n\nWhen Harvick won at Indianapolis Motor Speedway last month without Smith, Harvick texted Smith the next day.\n\n“Everybody is super supportive and he’s super motivating for everybody because of how ambitious he is to work through all the things that he is going through and plan on coming back and changing a tire,” Harvick said. “He’s quite the human being.”\n\nMany tire changers have a stand that they use to practice tightening and loosening lug nuts, but that wasn’t enough for Smith during his rehabilitation from the initial surgery. SHR tire carrier Mike Morneau built a wheel hub, attached it to the back of a utility vehicle and brought a light tire to Smith so he could go through all of the motions.\n\nOPINION: Did failure to make NASCAR playoffs cost Stenhouse his ride?\n\nLARSON: Dover was a timely win in more ways than one\n\nTALLADEGA: Playoff race will pay tribute to Dale Earnhardt Sr.\n\nSmith would work changing tires a few times a week while going through treatments. He would do it Sunday mornings before a race and send film to his teammates.\n\n“That was huge for me just from a mental standpoint,” Smith said. “If I had not been hitting lug nuts that whole time, mentally it would have gotten me down more. It was nice to go out there and hit lugs. … It was therapeutic.”\n\nDaniel Smith, left, with Stewart-Haas Racing tire carrier Mike Morneau. (Photo: Courtesy of Daniel Smith)\n\nSmith will have the confidence at Talladega of knowing he already returned once to perform at a high level. When the Harvick team had the best time of any team on pit road at Atlanta Motor Speedway in the second race of the season, Smith knew he had returned to form.\n\n“That’s when I was like, ‘All right, I can still do this. We’re going to be all right,’” Smith said.\n\nMorneau, who along with Smith joined Haas CNC Racing (the precursor to SHR) in 2004, had few doubts Smith would return to perform at an elite level.\n\n“Overall he’s the same guy, the same tire changer, the same mentality of kicking everybody’s ass has not changed,” Morneau said. “He’s always been the guy that if he’s going to do something, he’ll do it. If he wants to beat you at golf, he’s the guy that will beat you.”\n\nQuitting wasn’t an option.\n\n“It never crossed my mind,” Smith said. “What else am I going to do, though? Every other job is going to be boring.”\n\nBob Pockrass is a Fox Sports NASCAR reporter. Follow him @bobpockrass.", "description": "Daniel Smith, 35, will be at Talladega Sunday changing tires for Kevin Harvick's No. 4 SHR Ford after battling Stage 3c testicular cancer.", "authors": ["Bob Pockrass", "Special For Usa Today", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/10/USAT/814c91ad-3c13-41bc-942d-6edfc7506988-smith-car.jpg?crop=2475,1392,x525,y424&width=3200&height=1680&fit=bounds", "published_at": "2019-10-10"}