{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/trump-islam-religion-university-program-education-a9112581.html", "downloaded_at": "2019-09-19 23:13:03.831731+00:00", "title": "Trump administration threatens to cut funding from university course for 'positive' discussion of Islam", "language": "en", "text": "The Trump administration has threatened to disqualify a university-level Middle East studies programme from receiving federal funding for teaching the “positive aspects of Islam”.\n\nThe US Department of Education has ordered that the programme run by the University of North Carolina at Chapel Hill and Duke University revise their course plans by 22 September or risk losing future funding.\n\nThe administration claims the course has “critical shortcomings and impermissible biases”, with “very little serious instruction” on national security and instead “considerable emphasis” on the “positive aspects of Islam”.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIn a letter dated August 29 and sent to the programme’s directors, the Department says course topics including Iranian art and film offer “little to no relevance” under the funding guidelines, nor do they “support the development of foreign language and international expertise for the benefit of US national security and economic stability”. Instead, the course places “considerable emphasis on advancing ideological priorities”, the Department has claimed.\n\nThe programme “should not be funded or subsidised in any way by American taxpayers” unless the courses “clearly demonstrate that such programmes are secondary to more rigorous coursework helping American students to become fluent Farsi speakers and to prepare for work in areas of national need\", according to the letter.\n\nShape Created with Sketch. Everyone Trump has fired or forced out Show all 13 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Everyone Trump has fired or forced out 1/13 John Bolton Trump claimed to have fired Bolton, his national security adviser, while Bolton claimed he offered to resign. An anonymous White House source that Bolton's departure came as a result of the national security adviser working too independently of the president AFP/Getty 2/13 Anthony Scaramucci Scaramucci lasted only six days in his role as Trump's communications director before being fired by John Kelly, the incoming chief of staff Getty 3/13 Jeff Sessions Attorney General Sessions was asked to resign after nearly two years of drawing Trump's ire, most notably with regards to the Mueller Probe Getty 4/13 Rex Tillerson Tillerson, Trump's first secretary of state, was fired after a series of clashes with the president over policy Getty 5/13 James Mattis Mattis served as secretary of defense from the beginning of Trump's administration until retiring on 1 January 2019. However, the president later claimed that he had \"essentially fired\" Mattis Getty 6/13 James Comey Comey was fired as director of the FBI early in Trump's presidency after serving in the role for four years prior. His dismissal is widely thought to have been related to the Russia investigation Getty 7/13 Reince Priebus Priebus, Trump's first chief of staff, was forced out after six tumultuous months AFP/Getty 8/13 David Shulkin Veterans affairs secretary Shulkin claims that he was fired, the White House claims that he resigned Getty 9/13 John Kelly Kelly, Trump's second chief of staff, was forced out after 17 months in office. His departure was a confused affair though it is clear that Trump wanted Kelly out AFP/Getty 10/13 Michael Flynn Flynn lasted 24 days as Trump's national security adviser before being fired for lying to the FBI Getty 11/13 Lee Cisna Cisna served as director of citizen and immigration services between October 2017 and June 2019 before being asked to resign amid a major personnel change in the department of homeland security 12/13 Madeline Westerhout Westerhout served as Trump's personal assistant after leaking private information about his family AFP/Getty 13/13 Mira Ricardel Ricardel was forced out of her role as Deputy National Security Advisor after first lady Melania Trump publicly called for her to be fired 1/13 John Bolton Trump claimed to have fired Bolton, his national security adviser, while Bolton claimed he offered to resign. An anonymous White House source that Bolton's departure came as a result of the national security adviser working too independently of the president AFP/Getty 2/13 Anthony Scaramucci Scaramucci lasted only six days in his role as Trump's communications director before being fired by John Kelly, the incoming chief of staff Getty 3/13 Jeff Sessions Attorney General Sessions was asked to resign after nearly two years of drawing Trump's ire, most notably with regards to the Mueller Probe Getty 4/13 Rex Tillerson Tillerson, Trump's first secretary of state, was fired after a series of clashes with the president over policy Getty 5/13 James Mattis Mattis served as secretary of defense from the beginning of Trump's administration until retiring on 1 January 2019. However, the president later claimed that he had \"essentially fired\" Mattis Getty 6/13 James Comey Comey was fired as director of the FBI early in Trump's presidency after serving in the role for four years prior. His dismissal is widely thought to have been related to the Russia investigation Getty 7/13 Reince Priebus Priebus, Trump's first chief of staff, was forced out after six tumultuous months AFP/Getty 8/13 David Shulkin Veterans affairs secretary Shulkin claims that he was fired, the White House claims that he resigned Getty 9/13 John Kelly Kelly, Trump's second chief of staff, was forced out after 17 months in office. His departure was a confused affair though it is clear that Trump wanted Kelly out AFP/Getty 10/13 Michael Flynn Flynn lasted 24 days as Trump's national security adviser before being fired for lying to the FBI Getty 11/13 Lee Cisna Cisna served as director of citizen and immigration services between October 2017 and June 2019 before being asked to resign amid a major personnel change in the department of homeland security 12/13 Madeline Westerhout Westerhout served as Trump's personal assistant after leaking private information about his family AFP/Getty 13/13 Mira Ricardel Ricardel was forced out of her role as Deputy National Security Advisor after first lady Melania Trump publicly called for her to be fired\n\nThe Department also accuses the programme of having a “lack of balance” in its discussion of Islam, “while there is an absolute absence of any similar focus on the positive aspects of Christianity, Judaism, or any other religion or belief system in the Middle East”.\n\nEducation secretary Betsy DeVos ordered the investigation in June following a complaint from Republican North Carolina congressman George Holding alleging “severe anti-Israel bias and antisemitic rhetoric” at a consortium-hosted conference. The March conference discussed “Conflict Over Gaza: People, Politics, and Possibilities” at UNC.\n\nThe letter didn’t confirm those allegations but asserted that the programme advances “narrow, particularized views of American social issues”.\n\nThe US National Resource Centre programme was founded in 1965 to offer federal funding for language and culture programming for students entering careers in diplomacy and national security. The National Resource Centre awarded $22 million in grant funding to language courses at 40 universities last year; the Duke-UNC Consortium for Middle East Studies received $235,000 from federal grant funds last year.\n\nAcademics have warned that creeping political interest into academia could endanger other programmes that receive similar funds.\n\nHenry Reichman, chairman of a committee on academic freedom for the American Association of University Professors, told the Associated Press that “the odour of right wing political correctness that comes through this definitely could have a chilling effect”.", "description": "The Trump administration has threatened to disqualify a university-level Middle East studies programme from receiving federal funding for teaching the “positive aspects of Islam”. The US Department of Education has ordered that the programme run by the University of North Carolina at Chapel Hill and Duke University revise their course plans by 22 September or risk losing", "authors": ["Alex Woodward"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/11/16/19/betsy-devos.jpg", "published_at": "2019-09-19"}