{"pub": "cnbc", "url": "https://cnbc.com/2019/09/07/bill-gates-funded-solar-geoengineering-could-help-stop-global-warming.html", "downloaded_at": "2019-09-07 13:36:36.984938+00:00", "title": "This Bill Gates-funded chemical cloud could help stop global warming", "language": "en", "text": "Fires burning across the Amazon rainforest have renewed the debate about solutions to climate change. Bill Gates is backing the first high-altitude experiment of one radical approach called solar geoengineering. It's meant to mimic the effects of a giant volcanic eruption. Thousands of planes would fly at high altitudes, spraying millions of tons of particles around the planet to create a massive chemical cloud that would cool the surface.\n\n\"Modeling studies have found that it could reduce the intensity of heat waves, for instance, apparently it could reduce the rate of sea level rise. It could reduce the intensity of tropical storms,\" said Andy Parker, project director at the Solar Radiation Management Governance Initiative.\n\nThe technology is not far from being ready and it's affordable, but it could cause massive changes in regional weather patterns and eradicate blue sky.\n\n\"These consequences might be horrific. They might involve things like mass famine, mass flooding, drought of kinds that will affect very large populations,\" said Stephen Gardiner, author of \"A Perfect Moral Storm: The Ethical Tragedy of Climate Change.\"\n\nWatch the video to learn how it would work and hear the debate around the ethics and efficacy of solar geoengineering.", "description": "As fires in the Amazon prompt renewed global outcry over climate change, Bill Gates is backing the first experiment of one controversial solution. It's called solar geoengineering, and it would create a huge chemical cloud that would cool the earth.", "authors": ["Katie Schoolov"], "top_image": "https://image.cnbcfm.com/api/v1/image/106117008-1567809599035gettyimages-462437570.jpg?v=1567809726", "published_at": "2019-09-07"}