{"pub": "news24", "url": "https://city-press.news24.com/News/we-have-cyrils-ear-cosatu-20191026", "downloaded_at": "2019-10-30 00:08:12.071291+00:00", "title": "We have Cyril’s ear – Cosatu", "language": "en", "text": "News We have Cyril’s ear – Cosatu\n\nCosatu president Zingiswa Losi says the trade federation is not ashamed of its proximity to President Cyril Ramaphosa and uses that opportunity to help correct his mistakes.\n\n“We fought hard to ensure his election and to give the ANC a clear anticorruption, pro-worker election mandate. We are committed to ensuring that mandate is implemented in full and that Ramaphosa’s presidency delivers on jobs,” said Losi.\n\nHer federation has, however, been accused of compromising its mandate of placing workers’ interests first and treating Ramaphosa’s government with kid gloves due to the close relationship.\n\nThis is an accusation that Losi has dismissed as unfounded.\n\n“Yes, Cosatu is close to the president, proudly so, as he is a son of Cosatu [alluding to Ramaphosa’s tenure as a trade union leader in both the Council of Unions of SA and NUM, the National Union of Mineworkers]. We have given him a clear mandate to save jobs, the country’s economy and rid the state of corruption. He is doing well. He is not a magician. We all need to come to the party as government, business and labour,” said Losi.\n\nShe said when “the ANC and the government [make] blunders, we intervene in the interest of workers and the working class in this country”.\n\nLosi said the union’s proximity to Ramaphosa was actually positive because it ensured that Cosatu had the president’s ear and could tell him when the government or the ANC made mistakes “and we engage them to fix these”.\n\n“Cosatu’s mandate is to unite and organise workers, we advance members interests on all fronts irrespective of who’s in power, be it ANC nationally or the DA in Cape Town or the IFP [Inkatha Freedom Party] in KwaZulu-Natal municipalities,” said Losi.\n\n“We fought hard to ensure his election and to give the ANC a clear anticorruption, pro-worker election mandate. We are committed to ensuring that mandate is implemented in full and that Ramaphosa’s presidency delivers on jobs Zingiswa Losi\n\nCosatu had been lobbying to have Ramaphosa address mine workers in Marikana during workers’ day next year.\n\nCosatu spokesperson Sizwe Pamla said the presidency had “agreed in principle”.\n\n\n\nAs proof that Cosatu was not soft on government, Losi recounted how under her administration, “Nehawu [National Education, Health and Allied Workers’ Union] has led mass strikes. Popcru [Police and Prisons Civil Rights Union] has forced the SA Police Service to improve members’ conditions. Denosa [Democratic Nursing Organisation] has mobilised to improve nursing allowances, training and employment. Sadtu [SA Democratic Teachers’ Union] has ensured the education department addresses teacher safety. NUM defied Eskom management which wanted to cut wages and retrench. CWU [Communication Workers Union] has saved SABC jobs. Samwu [SA Municipal Workers’ Union] has fought to ensure municipalities pay what is due to workers, to name but a few”.\n\nLosi served as Cosatu’s second deputy president from 2009 until her unopposed election as president to lead a federation with more than 1.6 million members in September last year.\n\nShe emphasised that Cosatu’s “mandate starts and stops with the needs of workers, unapologetically so”.\n\nShe said: “The president, at our insistence, held progressive jobs and investment summits to drive the economy’s revival. We now meet the president and Cabinet and top business leaders monthly to deal with its implementation.”\n\n\n\nAccording to Cosatu political and organisational reports released in September last year, the federation’s membership continued to decline after the expulsion of its biggest affiliate, the National Union of Metalworkers (Numsa) with Cosatu haemorrhaging 317 463 members from 2015 to last year.\n\nLosi claims to have stemmed the tide.\n\n“Many had written Cosatu off saying we were a weak spent force. This has changed drastically and decisively. Cosatu today is stable, healing and growing. Many unions are now applying to join Cosatu. Membership has stabilised and is now growing across all sectors.”\n\nCosatu president Zingiswa Losi says the trade federation is not ashamed of its proximity to President Cyril Ramaphosa and uses that opportunity to help correct his mistakes.\n\nThe latest Cosatu political and organisational report has not been released but Losi said unions which had been bleeding workers “were now working closely with Cosatu leadership to deal with the challenges, to clean up, do forensic audits, go to congress and get their houses back on track”.\n\n\n\nLosi said members of the SA Communist Party (SACP) – a tripartite alliance partner – had threatened to go it alone in the upcoming municipal elections.\n\nShe said the party was an independent organisation with the freedom to do as it wished.\n\n“The SACP is an ally yes, but remains independent. It makes its own decisions based upon its members’ views and analysis and we cannot speak on its behalf or dictate what it can and cannot do. We respect its views,” Losi said.", "description": "Cosatu president Zingiswa Losi says the trade federation is not ashamed of its proximity to President Cyril Ramaphosa and uses that opportunity to help correct his mistakes.", "authors": ["Juniour Khumalo"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9533/412957ffe2b14124b0cddda79259752c.jpg", "published_at": "2019-10-30"}