{"pub": "abcnews", "url": "https://abcnews.go.com/International/wireStory/afghan-official-taliban-attack-kills-including-child-66523200", "downloaded_at": "2019-10-25 16:07:26.328244+00:00", "title": "Afghan official: Taliban attack kills 5, including child", "language": "en", "text": "A Taliban suicide attack on Friday targeted a convoy carrying officials from Afghanistan's intelligence service, killing five people including a child in eastern Nangarhar province, the provincial governor's spokesman said.\n\nInterested in Afghanistan? Add Afghanistan as an interest to stay up to date on the latest Afghanistan news, video, and analysis from ABC News. Add Interest\n\nThe Taliban claimed responsibility for the explosion in the center of the provincial capital Jalalabad. The powerful blast wounded 21 people, including six security personnel, said Attaullah Khogyani.\n\nHours later, a second explosion targeted a checkpoint at the congested entrance to Jalalabad killing two security personnel. Six people were wounded, said Khogyani. The explosion happened near a bus stand crowded with people heading t the capital of Kabul.\n\nThe attacks are the latest in near daily attacks carried out by insurgents. Nangarhar has become increasingly violent in recent years as both the Taliban and an Islamic State group affiliate are active there.\n\nLast week, more than 60 people were killed in a brutal attack on a mosque in the province, and more than 100 were wounded. No one claimed responsibility for that attack, and the Taliban condemned it, denying involvement.\n\nThe United Nations has condemned the growing number of civilian casualties, with more than 8,000 killed and wounded so far this year. The U.N. called on all sides in the conflict to protect civilians.\n\nNangarhar has also been the scene of battles between Taliban and Islamic State fighters, whose members include disgruntled Taliban opposed to negotiating a peace settlement, as well as Pakistanis, Bangladeshis, some from Arab countries and Uzbeks, many of whom were members of the Islamic Movement of Uzbekistan.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/WireAP_c0db159a9dc9484ba04e6da64c4d0579_16x9_992.jpg", "published_at": "2019-10-25"}