{"pub": "businessinsider", "url": "https://businessinsider.com/textron-howe-and-howe-flir-ripsaw-m5-robotic-combat-vehicle-2019-10", "downloaded_at": "2019-10-14 23:30:16.911924+00:00", "title": "Textron, Howe & Howe and FLIR roll out a small robot tank that can deploy drones in bid to build the Army's new robotic combat vehicle", "language": "en", "text": "Textron Systems, Howe & Howe, and FLIR Systems, Inc. have unveiled their bid to build the Army a new robotic combat vehicle.\n\nTheir submission is the Ripsaw M5, a well-armed tracked vehicle equipped with high-end sensors for multi-spectral surveillance (TacFLIR 280-HD) and able to deploy unmanned air and ground assets (the FLIR SkyRaider and SUGV).\n\nThe robotic tank is modular, meaning that the turret can be reconfigured for different missions sets, and it is scalable, suggesting that it could be pitched as a solution for the Army's light and medium RCV.\n\nClick here for more BI Prime stories .\n\nWASHINGTON, DC — Textron Systems, its subsidiary Howe & Howe, and FLIR Systems, Inc. unveiled their bid for a new Army robotic combat vehicle Monday — the Ripsaw M5, a well-armed tracked vehicle equipped with high-end sensors that can deploy unmanned air and ground assets like a drone mothership.\n\nRipsaw M5 Ryan Pickrell/Business Insider\n\nThis robotic combat vehicle design was on display Monday at the Association of the United States Army conference in Washington, DC.\n\nThe vehicle is modular, meaning that the top turret can be reconfigured for different mission sets, and scalable, which is to say that it can be pitched as a solution for the light and medium robotic combat vehicle programs. The Army has yet to put out an request for proposal, so this is something of a conversation starter, although this is a working prototype.\n\nThe Ripsaw M5 is a multi-mission combat platform equipped with 360-degree sensing capabilities. While this vehicle has a top speed of about 40 mph, it has the ability to approach targets silently.\n\nRipsaw M5 Courtesy of FLIR\n\nOne of the most interesting features of the Ripsaw M5 is its ability to deploy other drones, namely the tethered FLIR R80D SkyRaider drone and the ground-based FLIR SUGV.\n\n\"Incorporating our world-class intelligent sensors and unmanned assets on the Ripsaw M5 will provide a leap-ahead technology solution for the Army,\" David Ray, president of FLIR Systems' Government and Defense business unit, said in a press statement.\n\nFLIR SkyRaider Courtesy of FLIR\n\n\"From cameras delivering 360-degree situational awareness to surveillance gimbals, tethered drones and ground robots, we'll give our troops a tactical edge by keeping them on technology's edge.\"\n\nOf the drones the M5 can carry, the SkyRaider is a tethered quadcopter drone with the ability to provide high-quality video and images of the battlespace any time day or night, offering valuable beyond line-of-sight reconnaissance and target recognition capabilities and increased situational awareness.\n\nThe SUGV is a small, portable unmanned vehicle that can climb stairs and manipulate objects, as well as offer imaging services for EOD, surveillance, and remote inspection missions.\n\nFLIR SUGV Courtesy of FLIR\n\n\"The battlefield is filled with really awful places where humans do tasks today they shouldn't have to,\" Brig. Gen. Ross Coffman, director of the Army Next Generation Combat Vehicle Cross-Functional Team (NGCV-CFT), explained recently.\n\nRead more: This monstrous new 80-ton robotic battlefield bulldozer will keep US troops out of the 'most dangerous place on the planet'\n\n\"But today,\" he continued, \"with the way our technology has advanced, our robotic vehicles can move forward of a manned force to see what's out there, detect chemicals, put direct fire on the enemy, determine whether or not there's an obstacle, and then team with humans to determine the best course of action.\"\n\nThe Army is currently interested in acquiring three classes of Robotic Combat Vehicles (light, medium, and heavy). The service requested $160 million in Research, Development, Test and Evaluation funding for the RCV in its Fiscal year 2020 budget request.\n\nThe expectation is that these vehicles will serve as scouts for follow-on forces and escorts for accompanying units, among other potential missions.", "description": "An industry team unveiled a new pitch for the Army's robotic combat vehicle program. It's a drone mothership that can field air and ground assets.", "authors": ["Ryan Pickrell"], "top_image": "https://image.businessinsider.com/5da49c6dcc4a0a634e796eb4?width=1200&format=jpeg", "published_at": "2019-10-14"}