{"pub": "marketwatch", "url": "https://mansionglobal.com/articles/brexit-ice-starting-to-melt-for-buyers-in-the-u-k-208581", "downloaded_at": "2019-10-24 23:59:52.921552+00:00", "title": "‘Brexit Ice’ Starting to Melt For Buyers in the U.K.", "language": "en", "text": "U.K. mortgage approvals ticked up in September despite continuing uncertainty around Brexit, according to a report Thursday from UK Finance.\n\n\n\nThere were 42,376 mortgage approvals for home purchases by main high street banks last month, 13.5% higher than in September 2018, which was a particularly subdued month for the mortgage market, said the industry body, which pools data from major lenders.\n\n\n\nMore: Ultra-Modern London Mansion With Pool and Tennis Court Asks £40 Million\n\nThe mortgages equated to total borrowing of £15 billion (US$19.2 billion), a 15.8% increase compared to last year.\n\n\n\n“The latest figures demonstrate a very real appetite for homeownership across the U.K. and mark the sixth consecutive month we’ve seen mortgage approval levels exceed a healthy 42,000,” said Anita Mehra, managing director of estate agency Benham and Reeves, in a statement about the findings.\n\n\n\n“This suggests that despite our political system continuing to crumble from the inside out, the Brexit ice is starting to melt when it comes to buyer sentiment and their intent to purchase,” Ms. Mehra said.\n\n\n\nBrexit is tentatively still scheduled for Oct. 31—though another extension is now very likely—and buyers and sellers across the country have been holding out to see what the deadline brings before committing to a new purchase or sale.\n\n\n\nFrom Penta: Rare Whiskey Remains World's Best-Performing Luxury Asset\n\nSome might also have been delaying their purchases in response to speculation that Chancellor Sajid Javid may cut stamp duty in his first budget, according to analysts at Pantheon Macroeconomics.\n\n\n\nThe budget, which lays out the government's economic proposals for the upcoming financial year, was scheduled for Nov. 6, but was reportedly postponed Thursday amid the government's calls for a general election.\n\n\n\nNonetheless, low unemployment and falling mortgage rates are helping offset the slipping demand for homes from political uncertainty, said Pantheon’s chief U.K. economist Samuel Tombs.\n\n", "description": "", "authors": ["Liz Lucking"], "top_image": "https://images.mansionglobal.com/im-120531?size=1.4988290398126465&width=1280", "published_at": "2019-10-24"}