{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7570751/Week-old-baby-upside-buried-pile-rubbish-bin-saved-Thailand.html", "downloaded_at": "2019-10-14 11:31:29.896533+00:00", "title": "Week-old baby found upside down and buried under a pile of rubbish in a bin is saved in Thailand", "language": "en", "text": "A baby girl was rescued after being stuffed inside an old hairdryer box and dumped in a bin.\n\nThe infant - believed be to one week old - was buried inside the pile of rubbish in an alleyway in Bangkok, Thailand, on Saturday evening.\n\nResident Maneerang Phangmam, 32, was collecting old bottles to be recycled when she peered inside the purple box and noticed the baby.\n\nShe said there was a white cloth wrapped around her and the cardboard box had food and rotting vegetables dropped on top.\n\nThe girl was not making any noise and was upside down but miraculously, she was still alive.\n\nThe one week old baby girl (left and right the bin) was found upside down in a bin in a box under piles of rotting food\n\nThe newborn baby girl (pictured) was rescued after being stuffed inside an old hairdryer box and dropped into a bin in Bangkok, Thailand\n\nManeerang yelled for help and several neighbours appeared to call the emergency services.\n\nShe said: 'I had finished work and I was collecting bottles when I saw the hairdryer box. I wanted to see if their was anything valuable inside, then when I looked I saw the little baby girl.\n\n'I was frightened and didn't know what to do. I just shouted for help and said ''there's a baby here, somebody call the police and an ambulance''.'\n\nParamedics from the local rescue foundation arrived and took the girl into an ambulance where she was given oxygen while being cleaned.\n\nAmbulance driver Piyapong Kanjan said the baby was recovering after being dumped in the Khlong Sam Wa district of the Thai capital.\n\nThe alleyway in the Khlong Sam Wa district, Bangkok, Thailand, where the baby girl was found. She was taken to hospital after being checked over by paramedics\n\nHe said: 'We think she is about one week old. She has been taken to the Nopparat Rajathanee Hospital where nurses are caring for her.'\n\nPolice are now interviewing residents in the street where the abandoned baby was found.\n\nColonel Thanusorn Krittiyachot said: 'The station was notified at 6.20pm of the baby found in the alleyway. We arrived with rescue officials to inspect the scene.\n\n'We will inquire with people who live and work in the alleyway to check if they saw anybody leave the baby.'", "description": "A baby, believed be to one week old, was buried inside a pile of rubbish in an alleyway in Bangkok, Thailand. A woman saw the infant in a box with food and vegetables dropped on top.", "authors": ["Chris Dyer For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/10/19685518-0-image-a-85_1571046910051.jpg", "published_at": "2019-10-14"}