{"pub": "metro", "url": "https://metro.co.uk/2019/10/19/rose-west-myra-hindley-lesbian-affair-prison-10946612", "downloaded_at": "2019-10-19 13:31:29.808995+00:00", "title": "Rose West and Myra Hindley ‘had lesbian affair in prison’", "language": "en", "text": "Rose West lawyer of 12 years claims she had a lesbian fling with Moors Murderer Myra Hindley (Picture: Rex)\n\nBritain’s most notorious female serial killers were lovers, one of the pair’s former lawyers has claimed in new book.\n\nRose West and Myra Hindley had the affair after the two were held in the same Durham Prison in the mid-1990s, Leo Goatley claimed.\n\nDetails of the short-lived lesbian fling were highlighted in Understanding Fred and Rose West which comes out next week, ahead the 25th anniversary of his suicide in prison on January 25.\n\nMr Goatley was Rose’s lawyer between 1992 and 2004 and the book is based on more than a decade’s worth of letters, interviews and visits with West.\n\nIn it he writes how the House of Horrors killer was ‘quite taken’ with the Moors Murderer and was ‘impressed by her knowledge and ability’ but the short-lived fling ended after a few months because Hindley was ‘very manipulative’ and ‘dangerous’, the Mail reports.\n\nFred West asphyxiated himself while on remand at HM Prison Birmingham on 1 January 1995, at which time he and Rose were jointly charged with multiple murders ( Picture: SWNS.com)\n\nMr Goatley, represented West for 12 years, including at her 1995 trial for murdering ten girls and young women. He also visited her in prison on dozens of occasions.\n\nAdvertisement\n\nAdvertisement\n\nHe wrote: ‘Rose’s first paramour was the Moors murderer, Myra Hindley, who happened to be on the hospital wing at HMP Durham at the same time in 1995 and early 1996. Hindley was there because she had ‘fallen over’ in the exercise yard of F Wing. It was prison policy that a new inmate who was a lifer would first be assessed on the prison wing.\n\n‘I recall that Rose was quite taken with Hindley, impressed by her knowledge and ability. Rose said Hindley had studied various Open University courses.\n\n‘She said, ‘Yeah, Myra, she’s all right, we get on, I want to see how it goes’. This was a reference to a flowering, albeit short-lived, lesbian relationship.’\n\nRose’s relationship with Myra soon soured after her opinon of Hindley changed (Picture: Rex Features) When Mr Goatley visited a few months later he learned how Rose’s opinion of Hindley had changed dramatically, saying ‘She is very manipulative. You don’t realise it, but she gets you doing stuff for her. Oh, she’s clever, all right. She’s flippin’ dangerous, that one. She ain’t going to take me for a c*** again.’ And so heralded the end of the romance.’ Mr Goatley says the affair was one of many female relationships West enjoyed in prison, adding: ‘The friendships were genuinely supportive and often sexual. They could also be unstable and end in resentment.’ Hindley was convicted in 1966 for killing ten-year-old Lesley Ann Downey and Edward Evans, 17. She was also an accessory when her boyfriend Ian Brady murdered 12-year-old John Kilbride. She died 60 in 2002. West was jailed for life in 1995 for killing 10 women. Both women received life sentences. Got a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Rose West and Myra Hindley 'had lesbian affair in prison' new book by House of Horror killer's lawyer Leo Goatley claims", "authors": ["Chris Caulfield"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_90607496_1571489857.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-19"}