{"pub": "news24", "url": "https://city-press.news24.com/Voices/mondli-makhanya-there-has-to-be-more-to-renaming-things-after-struggle-heroes-than-just-a-loud-sign-20191028", "downloaded_at": "2019-10-28 00:32:15.320659+00:00", "title": "Mondli Makhanya: There has to be more to renaming things after struggle heroes than just a loud sign", "language": "en", "text": "Voices Mondli Makhanya: There has to be more to renaming things after struggle heroes than just a loud sign\n\nTurn on the radio in the morning and you will hear the traffic report presenter telling you that the robots are out of order at the corner of this road named after a struggle hero and that road named after another.\n\nOpen a newspaper or news website and you will read about rampant corruption or wanton maladministration at a municipality named after a stalwart of the revolution.\n\nAnd if you follow the news closely, you will regularly hear about horrific accidents on roads named after our liberators.\n\nWalk down Anton Lembede Street, one of the main drags in Durban, and you will see chaos and litter.\n\nThe same goes for Thabo Mbeki Street in Polokwane.\n\nFor about 10 years, Luthuli House, which is on Pixley ka Seme Street, was inhabited by a vile thief whose values did not resemble those two giants of the liberation struggle.\n\nIn the provinces, ANC offices are named after one or other hero, but those inside the buildings will be busy scheming about how to pilfer public resources.\n\nBut let us go back to the municipalities.\n\nIn May, when Auditor-General Kimi Makwetu released the national municipal audit report for the 2016/17 financial year, he revealed that the Nelson Mandela Bay Metropolitan Municipality had incurred a staggering R8.18 billion in irregular expenditure.\n\nThis was the worst in the whole country, followed closely by OR Tambo District Municipality, which incurred R3 billion in irregular expenditure.\n\nRead: Auditor-General sets sights on 26 misusers of taxpayers’ money\n\nIf you consider the place of these leaders in the South African pantheon and look at the towns that were named in their honour, you just want to weep.\n\nRated as one of the poorest and most underdeveloped municipalities in the country, OR Tambo is plagued by corruption and maladministration.\n\nWhat is heartbreaking is that the thieves mainly target the water and sanitation budgets, colluding with suppliers to inflate prices.\n\nOn other occasions, this administration has had to return money to Treasury because they didn’t know how to spend it, leaving the poor bereft of basic needs.\n\nNelson Mandela Bay is legendary for the gangster’s paradise proclivities of its senior leaders.\n\nA city that should be one of South Africa’s leading metropolises and the province’s economic anchor has been betrayed by leaders of Nelson Mandela’s party.\n\nThe culture of plunder there was vividly described by public servant Crispian Olver in his book How to Steal a City, which unpacked the ANC mafia-type networks in Port Elizabeth and surrounds.\n\nOut in North West, the Dr Ruth Segomotsi Mompati District Municipality – named after a fearless leader who was at the forefront of the defiance campaign, the women’s march and the exile struggle – was described as “a health hazard” by ANC chairperson Gwede Mantashe when he visited earlier this year, because raw sewage and dirty water were flowing freely along the potholed streets of the town.\n\nSo freely, in fact, that residents have contracted diseases and parents fear their toddlers will disappear into stagnant ponds in the middle of the roads.\n\nRead: Lack of accountability is why North West, Free State have poor audits: AG\n\nOne resident told City Press that the water shortages the municipality had been suffering from were “a good thing [because] we don’t have it constantly flowing 24 hours a day. When there is no water, people do not flush toilets that much, which means we get less sewer spillage, but it gets worse in the morning and evening. And so does the smell, which penetrates our houses and invades our dinners. We can live with less water as plans were often made for water to be delivered in trucks, but this smell is something else, and could lead to the whole community becoming sick.”\n\nThe reason for this mess? Corruption, maladministration and incompetence.\n\nThis was then topped off by a R150 million investment in VBS Mutual Bank, which tipped a teetering municipality into full-blown crisis.\n\nThere are hundreds more examples of towns, streets, buildings and other infrastructure that do not come close to living up to the character of the great person after whom they were named.\n\nThere are many more to come.\n\nEkurhuleni recently decided to name a whole batch of streets and community facilities after struggle heroes, including Winnie Madikizela-Mandela and George Bizos.\n\nIn itself, there is nothing wrong with renaming places after those who sacrificed for our freedom.\n\nThe only problem is that it has all been about the party that is currently in power, with little regard for other – albeit smaller – strands of the liberation struggle.\n\nBut that’s for another day.\n\nWhat is the purpose of honouring an icon if we proceed to disgrace the name of that person?\n\n\n\nSurely naming a municipality after Tambo should inspire those who run it to live up to his character of selflessness, honesty and servant leadership.\n\nOne wonders what the gangsters of Nelson Mandela Bay think when they concoct schemes in the name of the great man and render the municipality ungovernable in their quest to access the public purse.\n\nDo those who run the Ruth Mompati municipality care that her name is now associated with corruption, putrid smells, disease and VBS theft?\n\nIt is all well and good to want to honour the titans who led our freedom struggle, but it has to mean something.\n\nThere has to be more to renaming things than just a loud sign.", "description": "Turn on the radio in the morning and you will hear the traffic report presenter telling you that the robots are out of order at the corner of this road named after a struggle hero and that road named after another.", "authors": ["Mondli Makhanya"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7438/c76bd2495dd54c6b8650f2aef8dd7717.jpg", "published_at": "2019-10-28"}