{"pub": "npr", "title": "Pregnant Behind Bars: What We Do And Don't Know About Pregnancy And Incarceration", "url": "https://npr.org/sections/health-shots/2019/03/21/705587775/pregnant-behind-bars-what-we-do-and-dont-know-about-pregnancy-and-incarceration", "language": "en", "published_at": "2019-03-21", "downloaded_at": "2019-09-02 07:17:45.147435+00:00", "text": "Pregnant Behind Bars: What We Do And Don't Know About Pregnancy And Incarceration\n\nEnlarge this image toggle caption Image Source/Getty Images/Image Source Image Source/Getty Images/Image Source\n\nThere are 111,616 incarcerated women in the United States, a 7-fold increase since 1980. Some of these women are pregnant, but amid reports of women giving birth in their cells or shackled to hospital beds, prison and public health officials have no hard data on how many incarcerated women are pregnant, or on the outcomes of those pregnancies.\n\nA study published in The American Journal of Public Health Thursday changes that. The study included 57 percent of the US prison population (New York, California and Florida were not included). It found that 3.8 percent of newly admitted women were pregnant and that in a single year, incarcerated women had 753 live births, 46 miscarriages, four stillbirths and 11 abortions.\n\nThe correctional system hasn't adapted to the large increase in incarcerated women, according to study author Dr. Carolyn Sufrin, an OB-GYN at Johns Hopkins School of Medicine. And there are profound health and social consequences for the children of incarcerated mothers. She says the report provides the first data that could inform policy changes to address the health and well-being of incarcerated women who are pregnant, and the children born to them.\n\nNPR's Ailsa Chang spoke with Dr. Sufrin to discuss the study.\n\nThis interview has been edited for clarity and length.\n\nThis is the first ever review of this population pregnant women who are incarcerated. Why has there been so little research on this population?\n\nPregnant incarcerated people are one of the most marginalized and forgotten groups in our country. People in general don't often think about what happens to people behind bars. People think even less about the fact that there are pregnant women behind bars, or even consider it as a possibility.\n\nThat trickles down to who gets counted and who doesn't. We've seen tremendous neglect in understanding what is happening to pregnant women behind bars.\n\nWhy has this research been personally important for you?\n\nI worked as an OB-GYN in a jail for about six years and took care of pregnant people. When writing or giving talks I would cite the statistic that 3 to 5 percent of incarcerated women are pregnant, or that there are about 1,400 births every year to women in custody.\n\nI began to wonder where these numbers came from and I looked at the sources to discover that they were a decade and a half to two decades old. I also realized that there was no information whatsoever about abortion, about miscarriages and a variety of other outcomes.\n\nAnd given that the rate of increase of incarcerated women continues to rise we can't assume that these numbers from decades ago are accurate. That prompted me to fill in that gap because when we don't know the numbers, when we don't know what's happening that means that no one's looking and anything can happen to these women.\n\nThey can be shackled during childbirth .... I've seen it firsthand. They can be placed in solitary confinement. They can have their complaints of contractions, bleeding, labor complaints ignored and deliver babies in their jail cells or prison cells. They can be denied their right to access abortion. They can be denied access to quality prenatal care. When you don't have any numbers to pay attention to them, then anything can happen.\n\nWhat do we already know about pregnancy in prison?\n\nWe know that there is a lot of variability in the kind of medical care that any incarcerated person, but especially a pregnant incarcerated person, receives. Despite a constitutional mandate that prisons and all institutions of incarceration provide health care to people inside, there is no mandatory oversight that these institutions must follow. And so you get a wide range ... of some places that are actually providing relatively good pregnancy care and others that are providing harmful, neglectful or absent pregnancy care.\n\nHow did you try to learn more?\n\nSo from 2016 to 2017 we had 22 state prison systems across the country representing a geographically diverse range of states as well as the Federal Bureau of Prisons reporting to our study database every month for an entire year and each month they would report a variety of outcomes. How many pregnant people were admitted. How many births there, how many were miscarriages, abortions, stillbirths, maternal deaths.\n\nSo they reported this on a monthly basis for a year and that's how we collected the data.\n\nWhat did your study find?\n\nWe found that over 90 percent of pregnancies ended in live births. And that is not consistent with how the variety of ways that pregnancies end more generally in the general population in the United States.\n\nHow is it different?\n\nIn the United States about [10 percent] of clinically recognized pregnancies end in miscarriage, about 18 percent of pregnancies end in abortion, and in our study we found an overall miscarriage rate of 6 percent and an abortion rate of 1 percent.\n\nWhat happens to the babies born to an incarcerated mother?\n\nThis study wasn't designed to follow the outcomes of the children who were born. There has been some research on the lives of children who were born to incarcerated mothers and much of that comes from studying children born to women while incarcerated who then stay in these so-called prison nursery programs, where the babies can go back to the prisons with their moms.\n\nThe consequences of being born to a mother who's incarcerated or even having a parent who's incarcerated for the next generation are profound especially when we consider the deep racial disparities in incarceration rates.\n\nThis is a matter of equity, of racial justice. And we know that children who are separated from their mothers because they're in custody are more likely to end up in the foster care system even from birth and not have visits from their parents.\n\nKids starting out in the foster care system already have a lot stacked against them in terms of their opportunities for emotional stability and support, stable housing and education. They're also more likely to be incarcerated themselves in the future. So the impact of these pregnancies on the next generation on families on communities particularly communities of color is profound.\n\nHow does your study fit in to the broader conversation around incarceration in America?\n\nIt's a starting point. We now have a better idea of what's going on, how many people there are, and the scope of their problems. You need to know what's going on. You need to know how many people there are. We've laid the groundwork for developing programs or healthcare standards that could serve these women.\n\nThat's why we've placed an importance on making sure that these data are publicly available, so that people can use these data to to make policies.", "description": "Pregnant women in prison face difficult circumstances, and data on their pregnancies has been scarce. New research lays the groundwork for addressing this neglected public health issue.", "authors": ["Jonathan Lambert"], "top_image": "https://media.npr.org/assets/img/2019/03/21/pregnant-and-incarcerated-women_wide-c10466dd13730992849a389cce185425124564a2.jpg?s=1400"}