{"pub": "bbc", "url": "https://bbc.com/news/world-europe-49613074", "downloaded_at": "2019-09-07 02:22:02.543875+00:00", "title": "Canan Kaftanciouglu: Turkish opposition figure faces jail for tweets", "language": "en", "text": "Image copyright AFP Image caption Canan Kaftancioglu has suggested the charges are politically motivated\n\nA leading secular politician in Turkey has been sentenced to nearly 10 years in jail for \"terror propaganda and insults\" against the Turkish state.\n\nCanan Kaftancioglu, 47, was convicted mainly over tweets which date back several years.\n\nShe has said the charges were politically motivated and remains free pending an appeal.\n\nShe heads the main opposition Republican People's Party (CHP) in Istanbul, the country's largest city.\n\nKaftancioglu played a key in the CHP's triumph in Istanbul's mayoral election in June, defeating the governing AKP party.\n\nCHP's Ekrem Imamoglu beat the AKP candidate in the re-run poll, delivering a stinging blow to Turkish President Recep Tayyip Erdogan.\n\nWhat was Canan Kaftanciouglu convicted of?\n\nOn Friday, she was sentenced to nine years, eight months and 20 days in prison.\n\nShe was accused of \"insulting\" President Erdogan and the Turkish state in the posts, as well as \"spreading terror propaganda\".\n\nThe charges related to 2013 anti-government protests and the outlawed Kurdistan Worker's Party (PKK).\n\nThe hashtag #TurkiyeSeninleCananBaskan (Turkey Stands With You, Chief Canan) trended online during Kaftanciouglu's trial in Istanbul.\n\nSpeaking shortly after the court's verdict, Mr Imamoglu said: \"There is no justice in this country. In Turkey, instead of listening to their conscience, judges look towards the palace (the President's office).\"\n\nHe said Ms Kaftancioglu was sentenced \"because of her success in İstanbul elections\".\n\nWhat about the Istanbul mayoral re-run in June?\n\nCHP candidate Ekrem Imamoglu beat his AKP rival Binali Yildirim, a former prime minister, by a bigger margin than he achieved in the earlier election.\n\nThat victory in March had been annulled after the AKP alleged irregularities.\n\nMedia playback is unsupported on your device Media caption Ekrem Imamoglu and his supporters celebrate in Istanbul\n\nMr Yildirim conceded to Mr Imamoglu, while President Erdogan congratulated the CHP candidate on victory.\n\nMr Erdogan had previously said that \"whoever wins Istanbul, wins Turkey\".\n\nHe has ruled the country since 2003 both as prime minister and now president, becoming the most powerful leader since Mustafa Kemal Atatürk, the founder of the modern Turkish republic.", "description": "Canan Kaftanciouglu is the Istanbul head of the main opposition CHP party that now runs the city.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/A486/production/_107581124_9a3dbd96-7564-4ef0-9af8-0685e545158d.jpg", "published_at": "2019-09-06"}