{"pub": "businessinsider", "url": "https://businessinsider.com/trump-rat-baltimore-balloon-protest-republican-hotel-2019-9", "downloaded_at": "2019-09-13 08:07:29.844048+00:00", "title": "A giant rat balloon with features resembling Trump greeted Republicans for the president's visit to Baltimore", "language": "en", "text": "An inflatable, giant rat with features resembling Donald Trump's greeted lawmakers as the president traveled to Baltimore on Thursday for a speech at an annual congressional Republican retreat.\n\nThe balloon, which held a cellphone and bore Trump-like hair, was positioned on top of a vehicle with a sticker that said \"Fight Fascism, Stop Trump.\"\n\nThroughout the day, protesters gathered around the effigy and deployed other visual aids for their political statements, including a street sign labeled \"BARACK OBAMA AVE\" under the actual street name, \"S. PRESIDENT STREET,\" according to CBS Baltimore.\n\nProtesters held signs that said, \"Trump and the GOP are the real rats\" and \"Welcome rat king,\" the Associated Press reported.\n\nUS Secret Service and police officers reportedly patrolled the area amid the protests, which were a few blocks away from the Republican-sponsored event at the Waterfront Marriott.\n\nRead more: Trump says the 20-foot-tall angry-baby blimp flying in London makes him feel 'unwelcome'\n\nTrump's history with Baltimore made headlines earlier this year.\n\nHis statements about the city in July rankled many Democrats and Baltimoreans. He also attacked House Oversight Committee chairman Elijah Cummings, whose district includes part of the city. Trump suggested the Baltimore's living conditions were deplorable and characterized the city as a \"disgusting, rat and rodent infested mess,\" where \"no human being would want to live.\"\n\nTrump's comments prompted condemnation from Baltimore officials, and the city's newspaper, The Baltimore Sun, published an editorial calling him \"the most dishonest man to ever occupy the Oval Office.\"\n\n\"Better to have some vermin living in your neighborhood than to be one,\" the newspaper wrote.\n\n\"I hope he has a pleasant visit,\" Cumming said to CNN on Thursday. \"I hope he gets a chance to see quite a bit of Baltimore.\"\n\nTrump has no plans to stay in Baltimore following his speech, the White House said, according to the Associated Press.", "description": "The giant rat balloon, which held a cellphone and bore similarities to Trump's features, was positioned on top of a vehicle.", "authors": ["David Choi"], "top_image": "https://amp.businessinsider.com/images/5d7ad6a52e22af1046784635-2732-1366.jpg", "published_at": "2019-09-12"}