{"pub": "zdnet", "url": "https://www.zdnet.com/article/microsoft-to-enable-end-users-to-buy-power-platform-licenses-without-administrative-approval", "downloaded_at": "2019-10-22 15:10:43.585043+00:00", "title": "Microsoft to enable end users to buy Power Platform licenses without administrative approval", "language": "en", "text": "Credit: Microsoft\n\nThe concept of self-service has been integral to Microsoft's Power Platform for a while now. But a coming change in how self-service will be implemented in the purchasing and licensing of Power BI, PowerApps and Flow products has a number of IT administrators up in arms.\n\n\n\nMicrosoft is starting to notify users of its Power Platform products that self-service purchase capabilities for those products will be turned on automatically, starting in November. This means that administrator approval won't be required -- or even offered the option -- when it comes to purchases by individual end users of the Power Platform products. Individuals will have to pay for licenses themselves, not using corporate funds, but they won't be barred from doing so.\n\nA quick refresher about Microsoft's Power Platform: It's the collection of Power BI, Power Apps and Flow and is meant to bring low-code/no-code app development, process automation and analytics to users. Microsoft also refers to this, on occasion, as its \"Citizen App Platform.\"\n\n\n\nMicrosoft posted this notification in the message center this week:\n\nSelf-service purchase capabilities for Power Platform products will be available for commercial cloud customers starting 11/19. Today, individuals within your organization are unable to purchase subscriptions or assign licenses for themselves or their departments without contacting you, their admin. Based on customer demand, we'll soon be enabling self-service purchase and license management capabilities, which will allow users within your organization to purchase products directly, starting with the Power Platform family of products: Power BI, PowerApps, and Flow.\n\n(Thanks to Carl Knecht, aka @rialtus on Twitter, for the heads up.)\n\nThere are a couple of seemingly obvious reasons Microsoft is doing this. Its CRM archrival Salesforce already offers self-service capabilities to customers as part of its Service Cloud. And removing the requirement for central approval for app purchases will, at least in theory, spur more Power Platform tool sales.\n\n\n\n\"I see both sides on this one. Salesforce has a similar motion and it has not hurt them. But traditional IT folks will go nuts,\" said Steve Mordue, CEO of Microsoft partner Forceworks and a Microsoft Business Applications MVP.\n\n\n\nCustomers were seemingly caught off-guard by the message center notification, claiming there had been no official prior communication about this plan. Some have noted the self-service licensing change leaves them leery of more shadow IT issues.. And there's also the issue of how data owned by companies will be treated.\n\n\n\n\"Does anyone have more info on this? Does this mean that end users willing to pay for a license will be able to connect company data to other sources and bypass their admins altogether?\" asked \"Kelley E\" in the Microsoft Tech Community forum.\n\nI've asked Microsoft whether users will be able to connect company data to other sources as part of this coming change. No word back so far.\n\nWhen I asked Knecht about his objections to the self-service plan, he had plenty. He said it \"completely bypasses approval authority that our company's auditors and policy mandate. Uninformed clients purchasing products they don't need (like Power BI Pro when they already have M365 E5). No opt-out. Increased costs because IT isn't allocating subs to others.\"\n\n\n\nAccording to Microsoft, Power BI will be available for self-service purchase in the U.S. starting November 19. PowerApps and Flow and additional geographies will get the self-service capabilities beginning December 4. (The self-service purchasing option will not be available for government, nonprofit or education.) This new self-service capability will arrive automatically, and is not configurable, Microsoft officials have said.\n\n\n\nAdministrators will have a \"view\" of all self-service purchases made within their tenants, enabling them to see how many licenses users have purchased and to which Azure Active Directory enabled users those licenses have been assigned. Users who purchase these products directly will have access to a \"scoped version\" of the Microsoft 365 admin center limited to their purchases, Microsoft officials said.\n\n\n\nSelf-service purchasers will be responsible for managing their own billing information, subscriptions and license assignment. They will be able to get support directly from Microsoft. Self-service purchasers won't be able to view or manage purchases and licenses at the organizational level.", "description": "Microsoft is planning to roll out a major change in the way users will be able to buy Power BI, Power Apps and Flow starting in mid-November. And a number of IT admins are none too pleased.", "authors": ["Mary Jo Foley"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2019/10/22/ff74cd1d-755f-4ed4-9079-a974cdf55963/thumbnail/770x578/94a82a6c17d8cf50241d4037b1cefaa0/powerplatformselfservice.jpg", "published_at": "2019-10-22"}