{"pub": "vice", "url": "https://vice.com/en_us/article/ne84bg/renata-flores-brought-quechua-to-youtube-and-then-everything-changed", "downloaded_at": "2019-10-30 23:16:45.821643+00:00", "title": "Renata Flores Brought Quechua to YouTube, and Then Everything Changed", "language": "en", "text": "Long before her songs became viral hits on YouTube, Renata Flores used to listen to her grandparents, parents, and extended family speak “in code.” She remembers that, when she was a young child, strange and inimitable words emanated from their mouths, like a magician’s chant before revealing their illusion. The elders in her family, Flores said, spoke in a hidden language to conceal the contents of their conversations—maybe gossip, risque jokes, or private discussions.\n\n\n\nBut there was something more, something subtle and revelatory: when they spoke in that language, everyone seemed more at ease, more confident and trusted. Flores would wish to be part of that circle of trust, that exclusive conversation. This way, she'd be able to understand the topics that were exclusive to adults.\n\nWhat Flores grew up with was Quechua, a native Andean language of the Quechua indigenous people. Quechua is the second-most spoken language in Peru, and also used in Ecuador, Colombia, Bolivia, Chile and Argentina.\n\n“Maybe my curiosity to figure out what they were saying was the catalyst for all this,” said Flores, who's from Huamanga, a small province of Ayacucho, an Peruvian Andes region south of Lima.\n\n“All of this” is her actual career as a pop singer in Quechua, a career that took off in 2015 from her cover of Michael Jackson’s famous hit “The Way You Make Me Feel.” Flores has dedicated nearly the last five years to performing songs in her family and ancestors' native tongue, and combines trap, hip-hop, and electronic influences with Andean instruments. In a country like Peru, where many feel pressure to hide their indigenous roots, Flores’s singing is surprising and provocative.\n\nHer unconventional musical choices have brought huge success: millions of views on YouTube; features and interviews in Peruvian media and foreign press like The Clinic, Telemundo, El País, AJ+ Español, CNN, and BBC; fans in Bolivia, Ecuador, Chile, Argentina, Guatemala, Dominican Republic, Costa Rica, Puerto Rico, Mexico, the United States, Spain, Italy, China, Algeria, and counting. And with it, Flores is challenging the very way people value languages, especially indigenous ones.\n\nWhen she first began to sing, around five or six years old, Flores didn’t know Quechua. Her maternal and paternal grandparents, the most gifted Quechua speakers of the family, didn’t really instill it in their children. Flores's parents became attentive listeners but rarely spoke it. Over time, neither grandparents, parents, or any other family members found it necessary, much less useful, to teach Quechua to Flores. The singing granddaughter began to train her voice in English.\n\nPatricia Rivera, Flores's mother and manager, remembers the first time she heard Renata sing: she sang a Green Day song to herself in her bedroom.\n\n“It was a strong and serious voice,” Rivera told VICE. \"When I heard her, I was impressed.”\n\nRivera and Flores's father, Milder Flores, were both musicians who owned an academy called Shapes and Sounds. Renata started attending the academy at an early age, where she learned the violin and continued her studies with piano, and eventually focused on singing.\n\nFlores rehearsed with songs by Adele, The Animals, Alicia Keys, and Michael Jackson, putting more and more emphasis on her vocal training. Since she wasn’t fluent in English, she would sing the covers phonetically. Instead of picking up Quechua, Flores was doing what many Peruvians and Latin Americans do because they consider it necessary to survive: learning English.\n\nIt’s very common for many Quechua speakers to not teach their children or grandchildren the language because they consider this knowledge as a burden. To explain the shortage of active bilingualism in Peru, the linguist Virginia Zavala uses the concept of \"linguistic ideologies,\" which are the ideas that people have about languages. For example: French is the language of love; German sounds rough; Italian, Portuguese, and Spanish are similar.\n\nQuechua, similarly to other indigenous languages, is associated with poverty, rural life, and illiteracy. These ideas have been shaped by history and society to the point that people hold on to these beliefs as if they were universal truths. And these “truths” are deeply embedded in their conscious thought process. Value hierarchies also exist with languages. Some are “worth” more than others.\n\nThe end result is that many native Quechua speakers believe that using Quechua in public is unnecessary after learning Spanish. Either by shyness or shame, they reserve their maternal tongue for private spaces and intimate conversations.\n\n“Quechua is a mark of vulnerability,” Zavala says in one of her YouTube classes—or worse, a sign of inferiority that isolates and condemns its speakers. That’s why some Quechua speakers are reticent to use the language more widely.\n\nIn 2014, Flores's life took what one might call a linguistic turn. After participating in a singing TV show titled \"The Voice Kids,\" she and her mom decided to do a cover and shoot a music video. She was determined to stand out from the competition. The idea was to combine Andean instruments, like the quena and the charango, with the piano, which Flores knew how to play very well. But both mother and daughter agreed that there should be something more, something new.\n\n\n\n“Immediately the idea of language dawned on us,” said Rivera.\n\nIn the video clip of “Intipa lluksina wasi,” Flores appears to be playing the piano in the middle of La Pampa de la Quinua grasslands, a perfect representation of her home region of Ayacucho. On YouTube and Facebook, the video received hundreds of likes and comments. But that was nothing, or very little, compared to what happened a month later.\n\nEncouraged by the positive reception of her song, Flores and Rivera wanted to try it again but this time with a Quechua cover of “The Way You Make Me Feel” by Michael Jackson titled “Chaynatam ruwanki cuyanaita.” From that song, a fusion of blues, jazz and Peruvian music, everything escalated in a way that neither Flores nor her family could have imagined.\n\nIn less than two weeks from the release of the video—which naturally was recorded in Vilcashuamán, an Incan fortress—it received more than a million views. The calls and interview requests poured in. TV programs and radio shows, newspapers, magazines, blogs, Peruvian and foreign, were talking about this blue chullo-wearing girl who, against the serene mountainous backdrop, sang modern songs in the Incan tongue.\n\nJust like she did as a young girl in English, Flores memorized Quechua lyrics phonetically. Since no one taught her, she only know how to say “añañau” after eating something tasty, or “acacau” when something was hurting, or “alalau” when she felt cold. For tips pronunciation and linguistic nuance, Renata asked her paternal grandmother Adalberta, a family relative who until then had spoken the Andean language in private. Her grandmother, although surprised by the request, accepted.\n\nFlores knows that many of her fans and followers are not fluent in Quechua, so she makes her songs easy to pronounce and understand. Sometimes, she has captioned videos at her concerts so the audience can read and sing along. “I believe they do understand and learn the lyrics that way,” she said. “Music is the true universal language.\"\n\n“I like Quechua because it’s a language that is considerate of others,” said Flores. In Quechua, for example, there are two pronouns for “us”: “ñuqanchik” and “ñuqaiku”. The first translates to “you and I, or you and us,” and the second translates to “us, but not them.” (It's referred to as “us inclusive” and “us exclusive.\")\n\nHer lyrics, which are composed in Spanish and later translated to Quechua with the assistance of a professor in Huamanga, use pop, trap, hip hop, electronica fused with Andean music and instruments, such as quena, zampoña or violins, such as in the song \"Tijeras\":\n\nManan pipas qawanchu manan imatapas\n\nAtinichu ruwayta, rimayta munani\n\nQaparispanmi, tukuy runamanan uyarikunchu\n\nRimasqayta Qinaspa nini Qaparisaqmi\n\n“No one sees anything, I can’t do anything, I want to speak with loudness, people don’t hear what I say, so I’ll shout,” Flores sings.\n\nQuechua is an official language of Peru, and it is also the second most widely spoken language after Spanish. According to statistics from the Ministry of Culture, 3,805,531 Peruvians speak Quechua, representing a little over 13% of the population. That’s more than the population of Uruguay, and comparable to the population of Panama. Peruvian Quechua speakers represent a little over 13% of Peru’s population, and in the last 10 years, have grown by almost half a million.\n\nWhile these are positive numbers for Quechua, the statistics are not favorable for other native languages. Of the 6,700 worldwide, approximately 40% are in danger of disappearing. Peru has the third-most language diversity in Latin America, behind Mexico and Brazil. The country is host to 48 native languages, but 21 are in danger of disappearing. According to information from the Ministry of Culture, there are a number of Amazonian languages under real threat, with very few speakers. For example, the Muniche only has eight remaining speakers; the Iñapari has only five; and the Omagua and Resígaro have just three each. The Taushiro language has only one speaker left.\n\n“The key to encouraging bilingualism,” Virgina Zavala says in a YouTube video, “is to fundamentally change the [social] environment,” which is currently not supportive of native languages. It is crucial to change the social thought process that sees \"Quechua is a problem\" to \"Quechua is a resource.\"\n\nThis change must be implemented by both public institutions and the speakers themselves. The institutions can do this by passing new legislature, through public policy, scholarships, and workshops which promote Quechua speech. The speakers can implicitly agree with one another to use the language in spaces where it was not done before—just like Flores, who is bringing Quechua to the world of pop.\n\n“I used to see the discrimination that my grandmother would face for knowing Quechua. There was one time I felt ashamed of being with her, and now I regret that,” Renata says in “Who I Am,” a short documentary about her life.\n\nFlores said she was a bit freaked out by her sudden rise to fame. Why all this attention? Why did other people care so much about this musical experiment she created with her mother? The media spoke about reclaiming Quechua, and how Flores was helping the language gain new value. Those are big words, ones that suggest a commitment that Flores wasn't sure she was ready for. One day, Flores asked, “Mom, what did we get ourselves into?”\n\nIn \"Who I Am\", Rivera tells a story of a random man on the street who lashed out to Renata: \"Who are you to represent the Quechua people?\" Despite her popularity, Flores has received criticism from those who still do not accept Quechua in new spaces, as if those spaces degrade or distort the \"essence\" of the language.\n\nRenata, however, is not the only transgressor of the supposed status quo in the Andean language. There are plenty of other Peruvian singers who are taking the language to various musical genres which are not traditional: Liberato Kani with hip hop, soprano Sylvia Falcón sings in Andean lyrics, Damaris fuses it with pop, Uchpa with rock. Other Latin American countries also have singers in this similar vein; Mexico is one of the most prolific with the Mixe soprano María Reyna, Mayan rapper Pat Boy, and the Tsotsil band Lumatok's psychedelic rock.\n\n“The stereotype where indigenous people are seen as timeless or pure must be challenged. When native people are put in that box, we are fossilizing them,” said Américo Mendoza Mori, coordinator of the Quechua Program at the University of Pennsylvania in Pennsylvania. Mori, who was also an advisor on the Quechua dialogue in the “Dora the Explorer\" movie, strongly believes in Quechua reaching the rest of the world in different media, from movies to pop songs. He also also encourages speakers of indigenous languages to use present-day social media platforms to communicate with one another, something Flores has found great success with.\n\n“Sunqullay” and “pitaq kani” are Flores’s favorite words in Quechua. She uses sunqullay—“my little sweetheart” or “with heart”—constantly in her social media posts to express gratitude to her fans and followers for their support. “Pitaq kani” is a question the young singer frequently asks herself: “Who am I?\"\n\nEven before she blew up, Flores hadn’t really thought about who she was, which is another way of asking where do I come from? When she finally did ask, she started taking Quechua classes (she’s improving, but still has a long road ahead) and studying the Andean worldview. The project “Young people also speak Quechua,” which she established with her mother to spread Quechua, became “Pitaq kani”, and this year they received governmental funding to continue growing. She also began to create original compositions: “Mirando a la misma luna” / ”Looking at the same moon”, “Tijeras” / “Scissors”, “Miradas” / “Looks”, songs that deal with identity, discrimination, and violence against women. Her latest release, “Qam hina,” which Flores composed and produced, is about the hard life for girls in rural areas.\n\n“My mother and I always talk about issues that are happening, what could be the theme for the next song, what it can teach. I don’t want to make songs about nothing, I want them to reach people,” said Flores.", "description": "When she was 14, Flores rose to fame with her Quechua cover of Michael Jackson’s “The Way You Make Me Feel”, which has over 2 million views. Now 18, she is a spokesperson for one of the most widely spoken indigenous languages in Latin America.", "authors": [], "top_image": "https://video-images.vice.com/articles/5d9283f81b54520008099e96/lede/1569941661643-169_RenataFlores_V1.png?crop=1xw:1xh;center,center&resize=1200:*", "published_at": "2019-10-30"}