{"pub": "cbc", "url": "https://cbc.ca/news/canada/newfoundland-labrador/innu-nation-perry-trimper-reaction-1.5282187", "downloaded_at": "2019-09-13 18:12:12.579802+00:00", "title": "N.L. minister leaves cabinet after 'very racist' remarks surface | CBC News", "language": "en", "text": "Newfoundland and Labrador's environment minister has stepped down from cabinet after remarks he left on a voice mail were described as \"very racist\" by a staffer and shocked the Innu Nation.\n\nPremier Dwight Ball is holding a news conference at 4 p.m NLT to discuss Perry Trimper's resignation from cabinet.\n\nTrimper, who was moved to the portfolio just last week from Speaker of the House, announced Friday he would be stepping back from his ministerial duties.\n\n\"Reflecting upon the hurt that my words have caused, I've decided to step back from my ministerial responsibilities as my focus must be on repairing relationships,\" he said. \"This is the best decision.\"\n\nTrimper remains in the Liberal government caucus.\n\n\"When I first listened to it I was shocked and baffled,\" Grand Chief Gregory Rich said on Friday, a day after the release of a voice mail left by Trimper, the member of the House of Assembly for Lake Melville.\n\n\"I had to listen to it more than twice, in order to grasp what I was hearing — to the point where I had to get my other colleagues to listen to it to really bring me to reality of the contents of what this person was saying.\"\n\nTrimper had called Innu Nation executive assistant Dominic Rich's phone number, leaving a voice mail in relation to questions about translator services for motor vehicle registration.\n\nThe call didn't hang up, and an exchange between Trimper and an unidentified woman was also recorded.\n\nWhat did Perry Trimper and a colleague say? Hear the recording:\n\nLake Melville MHA Perry Trimper accidentally left a voicemail on a member of the Innu Nation's voicemail. 5:01\n\nThat recorded conversation was posted by the Innu Nation on Thursday.\n\nIn it, the woman says \"they have a feeling of entitlement.\" Trimper says, \"the race card comes up all the time.\"\n\n\"Man, don't play that on me. I've been 32 years working with you guys, don't play that on me,\" he says in the recording.\n\nTrimper apologized on air for the remarks during CBC's Here & Now.\n\n\"Regardless if it was recorded or not, I shouldn't have said it,\" he told CBC News on Thursday after apologizing.\n\nTrimper did call Rich on Thursday night to apologize over the phone. But when asked by Rich, wouldn't identify the woman on the recording.\n\n\"He said he was very sorry for what he said on the voice mail where he was recorded, and that's not him,\" Rich said.\n\n\"My spiritual balance cannot bring me into that environment to accept the apology.... The implications and the ripple effect of those contents, those words, and the demonstration of that racism, remarks and statements has a tremendous impact to the Innu and the First Nations.\"\n\nBut what about the unidentified woman?\n\nRich told CBC News on Friday that he would like to have her identified\n\n\"This person has the same views, and the same spiritual, emotional and psychological mentality as Mr. Trimper,\" Rich said via Skype interview.\n\n\"I would love, very much [for her] to be identified. Yes. It would undermine everything that the Innu has been working for. Their aspirations. And not just the Innu, but other groups as well.\"\n\nMinutes after Trimper's announcement Friday, PC Leader Ches Crosbie told reporters that Trimper made the right decision to resign from cabinet.\n\nWhen asked if he should be removed from the Liberal caucus, Crosbie said that should be up to the Innu Nation.\n\nChief Rich, meanwhile, said the Innu Nation is still reeling.\n\n\"We were very shocked and today we are still talking about it, and we were wondering why would Minister Trimper say these kinds of things to the Innu people,\" Rich said.\n\n\"Basically it's a racial remark to the Innu people, and we've been working with Minister Trimper for many years and we don't understand why he would make comments toward Innu people like that.\"\n\nInnu Nation Grand Chief Gregory Rich says Trimper called him Thursday to apologize for remarks in a voice mail recording. Rich said it makes him question what has been said behind closed doors. (Bailey White/CBC)\n\nThe Innu Nation planned to be meet later on Friday to discuss what they plan to do about it, he said.\n\n\"We're going to draft a strongly worded letter to the premier and at the same time we'll talk internally of what we need to do, because this is a very serious issue, when this kind of comment is coming from [a member of] the government, like Minister Trimper,\" Rich said.\n\nLake Melville MHA and cabinet minister Perry Trimper apologized live on Here & Now Thursday after a voicemail was leaked 6:23\n\n\"It also makes me wonder what's being said behind closed doors.\"\n\nOn Thursday, Premier Dwight Ball sent out a statement, saying he had spoken to Chief Rich to apologize for what happened.\n\n\"In no way does Minister Trimper's comments reflect the views of Premier Ball, or that of the government of Newfoundland and Labrador. Government values the relationship with the Innu Nation and holds the Innu Nation in the highest respect,\" the premier said in a statement.\n\nRead more articles from CBC Newfoundland and Labrador", "description": "Remarks left on a voice message by a Newfoundland and Labrador cabinet minister that one staffer describes as \"very racist\" shocked Innu Nation Grand Chief Gregory Rich.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5188710.1561460511!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/perry-trimper.jpg", "published_at": "2019-09-13"}