{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7608045/Olympic-gymnast-Simone-Biles-performs-incredible-standing-flip.html", "downloaded_at": "2019-10-26 06:58:55.520590+00:00", "title": "Olympic gymnast Simone Biles performs incredible standing back flip", "language": "en", "text": "Record-breaking gymnast Simone Biles wowed crowds at the second game of the World Series when she performed an incredible back flip with a twist before throwing the ceremonial first pitch.\n\nThe four-time Olympic gold medalist kicked off Game 2 at Minute Maid Stadium in Houston with the unexpected move on the pitcher's mound.\n\nShe then threw out the first ceremonial pitch of the game between the Houston Astros and Washington Nationals on Wednesday night.\n\nArtistic gymnast Simone Biles wowed crowds at the second game of the World Series when she performed a back flip with a twist\n\nBiles performing a back flip with a twist in front of amazed crowds on Wednesday evening\n\nThe four-time Olympic gold medalist kicked off Game 2 at Minute Maid Stadium in Houston with the unexpected move on the pitcher's mound. She pulled off a back flip with a twist to the delight of the crowd\n\nTake It Back pic.twitter.com/IRLf2BpBUr — Simone Biles (@Simone_Biles) October 24, 2019\n\nAstros outfielder Jake Marisnick served as Biles's catcher and signed the ball for her after the pitch.\n\nThe expert gymnast, who looked every inch the eager baseball fan in an Astros jersey and a pair of American Eagle Ne(X)t Level jeans, later tweeted pictures of herself performing the stunt with the words: 'Take It Back.'\n\nBiles has had glittering success at the Olympics and was part of the gold-medal-winning team dubbed the 'Final Five' at the 2016 Games in Rio de Janeiro.\n\nHailing from Spring, Texas, Biles previously threw the first pitch for the Astros in 2016.\n\nEarlier this month, the 22-year-old won her 25th world title at the World Gymnastics Championships.\n\nGymnast Simone Biles high-fives (left) and gets baseball outfielder Jake Marisnick to sign a ball for her (right)\n\nShe then threw out the first pitch of the game between the Houston Astros and Washington Nationals, wearing an Astros jersey and a pair of American Eagle Ne(X)t Level jeans\n\nEarlier this month, the 22-year-old won her 25th world title at the World Gymnastics Championships\n\nShe broke the all-time record for most medals by any gymnast at the world championships by winning the balance beam and floor exercise.\n\nBiles won her 24th medal on the beam, breaking a tie with the male Belarusian gymnast Vitaly Scherbo, and added her 25th less than two hours later.\n\nAnd if that wasn't enough, the 4-foot-8 Biles scored an impressive 15.066 on the beam with a near-flawless routine, opting for a simpler dismount than the double-double she performed earlier in the championships.\n\nThe Nationals beat the Astros 12-3 in Wednesday night's game. They now hold a 2-0 lead with the series shifting to Washington for Friday's Game 3.", "description": "Olympic gymnast Simone Biles wowed crowds at the second game of the World Series in Houston, Texas on Wednesday night when she performed a back flip with a twist while throwing out the first pitch.", "authors": ["Sophie Tanno For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/12/20128680-0-image-a-2_1571917074025.jpg", "published_at": "2019-10-24"}