{"pub": "indiatimes", "url": "https://indiatimes.com/health/breast-cancer-the-myths-just-got-busted-377839.html", "downloaded_at": "2019-10-16 13:53:11.227242+00:00", "title": "Breast Cancer: The Myths Just Got Busted", "language": "en", "text": "October is Breast cancer month and very rightly for India where in this month, we celebrate and worship feminism during our Navratras. This is the time when each one of us should support, encourage & educate the ladies around us to care for themselves and their wellbeing and why so because Breast Cancer is the most common cancer detected in Indian females, with nearly 1.5 lakh per year being diagnosed with this disease. The scenario in India is that nearly 70% of the patients are diagnosed in its advance stage which actually impacts upon-\n\nthinkstock/comyan\n\n1. The outcome (which directly depends on the stage)\n\n2. The cost of the treatment which goes higher because of the late presentation and the complexity of treatment in the late stages.\n\nThere are certain myths and apprehensions discussed which we have gathered from our patients and have been the reason for their late presentation. Some of them are discussed hereby.\n\nMyth - Breast cancer would be a painful Breast Lump.\n\nFact- Breast lumps are usually detected by doing a regular monthly self-breast examination which should start by 20 years of age. This is usually done by palm of the opposite hand and any swelling in the breast and armpit is checked for. Most of the lumps detected are noncancerous in nature. However, a painless lump especially after 4th decade should be reported to the family physician or Gynecologist- So most of the times early breast cancer would present as painless lump.\n\nDon't Miss\n\nkohajone.com\n\nMyth-Breast cancer usually would happen in a lady having family history of same.\n\nFact – The most common cause of Breast cancer is advancing age. Most of the Breast cancers are caused after 5th decade and it is a prolonged exposure (i.e early menarche and late menopause) to the hormonal cyclical changes during the menstrual cycle which is rather responsible for it. Also attributable are certain factors as nulliparity and poor Breast feeding. Obesity is another important factor which contributes to the cancer risk. Amongst the familial cancers which account for nearly 10-15 % of breast cancers -the most common gene involved is the BRCA (breast cancer gene) mutation. This gene is responsible for both breast and ovarian cancer and also breast and prostate cancer in males, so a complete family history should be discussed with the treating physician.\n\nMyth-Mammogram can prevent breast Cancer also Mammograms are harmful because of radiation exposure.\n\nFact- Mammograms have been used as a screening test and detect cancer at a very early stage and therefore, the survival and outcomes are improved. The benefit of the mammogram is enormous and far outweighs the miniscule risk of a small X -ray dose. It is indicated annually after the age of 50 years.\n\nMyth- Biopsy is a cause of spread/spillage of cancer cells.\n\nFact- This particular myth is also prevalent with actually most of other cancers as well, Biopsy is of utmost importance before starting the treatment and therefore it is essential at this point of time to establish a comprehensive diagnosis that guides in appropriate treatment , as of now research done has negated this fact.\n\nMyth – Breast cancer surgery- i.e Mastectomy is a better procedure in terms of cancer survival than preserving the Breast (Breast Conservation Surgery-which entails removal of the affected part of breast and preservation of normal tissue).\n\nFact- Breast Conservation surgery is the way to go if it can be done, the overall outcomes in terms of survival are quite equivalent with Mastectomy.\n\nBCCL\n\nMyth – Surgery is the first treatment for all breast Cancers\n\nFact - In certain patients, the role of chemotherapy first and thereafter surgery is important in helping breast conservation, also in a subset with high risk disease it could be the first decision of choice. Make sure that the whole treatment plan is discussed in a TUMOR BOARD which comprises of various cancer specialists like medical, surgical and radiation oncologists.\n\nMyth -Chemotherapy is essential in all Breast Cancer patients.\n\nFact- It depends on the variant of the Breast cancer the patient has. Cancer tissue which have a strong Estrogen receptor and progesterone receptor positivity may be treated with oral hormonal therapy only and there are gene tests like OncotypeDx and Mammaprint available, also there are certain genetic tests which can now predict especially in the same group of patients whether one can derive benefit from hormonal therapy or chemotherapy, which the treating oncologist would discuss.\n\nMyth-Chemotherapy results in permanent Alopecia.\n\nFact- Chemotherapy does cause Alopecia, but once the whole treatment schedule is over there is hair growth after the same in a couple of months and some patients do report a better texture and quality of hair they get after therapy completion.\n\nstraitstimes\n\nMyth – If detected with BRCA gene positive in otherwise healthy female, one would have to undergo bilateral Breast removal surgery (mastectomy) like the measure taken by Angelina Jolie?\n\nFact- It depends on whether the mutation detected is clinically significant or not. Yes in a clinically significant mutation the chances of acquiring Breast and Ovarian cancer are above 50%, but factors like adopting healthy lifestyle (regular exercise, diet rich in antioxidants and avoidance of smoking both active and passive) result in risk reduction, apart from this a annual MRI of the Breast and hormonal treatment is advised.\n\nTo conclude I would want to quote from one of my patients who rightly said –“ You never know how strong are you until being strong is the only choice you have.\n\nThe author is a Delhi-based Consultant Medical Oncologist at Manipal Hospital New Delhi. Email :peush.bajpai@manipalhospitals.com", "description": "October is the Breast cancer month and very rightly for India where in this month we celebrate and worship feminism in our Navratras .This is the time when each one of us should support, encourage & educate the ladies around us to care for themselves and their wellbeing and why so because Breast Cancer is the most common cancer detected in Indian females.", "authors": ["Dr Peush Bajpai"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/breast_cancer_1571121486_800x420.jpg", "published_at": "2019-10-16"}