{"pub": "bbc", "url": "https://bbc.com/news/world-middle-east-49973218", "downloaded_at": "2019-10-09 18:39:43.784213+00:00", "title": "Four maps that explain the Turkish offensive in north-east Syria", "language": "en", "text": "Image copyright Reuters\n\nTurkey has launched a military operation against Kurdish-led forces in north-eastern Syria, days after US troops pulled back from the border.\n\nThese maps help explain the offensive and its potential consequences.\n\nMajority-Kurdish areas\n\nKurds make up between 7% and 10% of Syria's population. For decades, they were suppressed and denied basic rights by President Bashar al-Assad and, before him, his father Hafez.\n\nBefore the uprising against Mr Assad began in 2011 most Kurds lived in the cities of Damascus and Aleppo, and in three northern areas near the Turkish border - Afrin in the west, Kobane (Ain al-Arab) in the centre, and Qamishli in the east.\n\nWhen the uprising evolved into a civil war, the main Kurdish parties avoided taking sides. In 2012, government forces withdrew from Kurdish areas to concentrate on fighting rebel factions elsewhere, and Kurdish militias took control in their wake.\n\nImage copyright Reuters Image caption The People's Protection Units (YPG) is the biggest militia in north-east Syria\n\nIn late 2014, the jihadist group Islamic State (IS) launched an assault on Kobane. The battle sparked alarm across the world and a US-led multinational coalition against IS intervened by carrying out air strikes. After the militants retreated, the Kurds became the coalition's most critical partner on the ground in Syria.\n\nThe biggest Kurdish militia, the People's Protection Units (YPG), formed an alliance with local Arab militias called the Syrian Democratic Forces (SDF) in 2015. With the help of coalition airpower, weaponry and advisers, SDF fighters drove IS out of a quarter of Syria and captured its last pocket of territory in the country in March 2019. They also set up an \"autonomous administration\" to govern the region.\n\nTurkey's \"safe zone\"\n\nTurkey has long threatened to launch a military operation in SDF-held territory to create a 32km (20-mile) deep \"safe zone\" running for 480km (300 miles) along the Syrian side of the border.\n\nIt wants to push back members of the YPG, which it views as an extension of a Kurdish rebel group that has been fighting in Turkey for decades and is designated a terrorist organisation. Turkey also hopes to resettle at least 1 million of the 3.6 million Syrian refugees it is currently hosting in the zone.\n\nIn an attempt to avert an offensive, the US military agreed in August to set up with the Turkish military a \"security mechanism\" in the border area. The YPG co-operated, withdrawing heavy weapons and dismantling fortifications.\n\nImage copyright Getty Images Image caption President Donald Trump says US troops will not support the Turkish operation\n\nBut on 6 October, Turkish President Recep Tayyip Erdogan told US President Donald Trump that a cross-border operation would \"soon be moving forward\", the White House said. Mr Trump responded by saying US troops based in the area would not support or be involved in the operation, and would withdraw, it added.\n\nThe SDF reacted angrily to Mr Trump's decision, warning that an \"unprovoked attack\" by Turkey would \"have a negative impact on our fight against [IS] and the stability and peace we have created in the region\".\n\n\"We are determined to defend our land at all costs,\" it added.\n\nIt is thought that the Turkish operation will focus initially on a 100km stretch of the border between the towns of Tal Abyad and Ras al-Ain, which is a sparsely populated, mostly Arab area.\n\nPotential population displacement\n\nThe area falling within Turkey's \"safe zone\" is fertile plain that once served as Syria's breadbasket. It is dotted with dozens of villages and towns, unlike the barren, desert regions to the south. The city of Qamishli, part of which remains under Syrian government control, had a population of 200,000 before the war.\n\nThe International Rescue Committee, a humanitarian organisation, said the region currently under SDF control was home to about 2 million civilians who had \"already survived [IS] brutality and multiple displacements\".\n\n\"A military offensive could immediately displace at least 300,000 people and disrupt life-saving humanitarian services,\" it tweeted on 7 October.\n\nImage copyright AFP Image caption Syrian Kurds protested against Turkey's plans for a safe zone\n\nSave the Children said 1.65 million civilians were in need of humanitarian assistance in the region, including more than 650,000 displaced by war.\n\nThe UN's Regional Co-ordinator for Syria, Panos Moumtzis, said it had made contingency plans to assist civilians forced to flee their homes by an offensive.\n\nAny military operation had to take the effects on civilians into account, he warned, adding: \"We are hoping for the best, but preparing for the worst\".\n\nMr Moumtzis said the UN had a \"bitter history\" with the concept of safe zones and that it never encouraged their creation, citing the massacre at Srebrenica in 1995.\n\nDetained IS fighters and their families\n\nThe SDF says that it is detaining more than 12,000 men suspected of being IS members in seven prisons. At least 4,000 of the prisoners are foreign nationals. Some of the prisons are reportedly close to the Turkish border.\n\nThe families of suspected IS members meanwhile are being held at three camps for displaced people - Roj, Ain Issa, and al-Hol.\n\nRoj and Ain Issa, which are home to 1,700 and 12,900 people respectively in May 2019, would both be located inside Turkey's proposed \"safe zone\".\n\nImage copyright Reuters Image caption Some 70,000 people suspected of links to the Islamic State group are detained at al-Hol camp\n\nAl-Hol, which is by far the biggest such camp with more than 68,000 residents, is about 60km from Turkey and so would not be in the zone. More than 94% of the people at al-Hol are women and children, and 11,000 are foreign nationals.\n\nMr Trump told Mr Erdogan that Turkish troops would be responsible for securing detained IS fighters in areas they captured, according to the White House. The SDF has said its fighters will continue to guard the prisons and camps, but there is a concern they could be called away to other areas or be forced to flee if attacked.", "description": "The Turkish military says the operation aims to create a \"safe zone\" in Kurdish-held territory.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/170E4/production/_109163449_mediaitem109163448.jpg", "published_at": "2019-10-09"}