{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKBN1WU08D-OCASP", "downloaded_at": "2019-10-15 04:27:16.464640+00:00", "title": "Stephen Jones: Cowboys coach Garrett safe", "language": "en", "text": "FILE PHOTO: Sep 29, 2019; New Orleans, LA, USA; Dallas Cowboys head coach Jason Garrett claps in the first quarter against the New Orleans Saints at the Mercedes-Benz Superdome. Mandatory Credit: Chuck Cook-USA TODAY Sports\n\nThe Cowboys’ third straight loss, to the previously winless New York Jets on Sunday, hasn’t changed the thoughts of Dallas executive vice president Stephen Jones about the future of head coach Jason Garrett.\n\n“Absolutely not,” Stephen Jones said on his radio show Monday on 105.3 The Fan. “We’re ready to go. I think this team just needs to get a win under its belt, and I still think we can have a great year and feel good about it and feel great about Jason and his staff and feel like we’ll go to work here this week and move forward.”\n\nJones was echoing the sentiment of his father, Cowboys owner Jerry Jones, who said Garrett is in no danger of losing his job.\n\nThe elder Jones said his vision of the future was shorter term, when the Cowboys host the Philadelphia Eagles on Sunday. The teams are 3-3 and tied for first atop the NFC East.\n\n“I haven’t even come close to those future-type considerations,” Jerry Jones said Sunday after Dallas’ 24-22 loss to the Jets. “I’m looking at future as next week against those Eagles. I’m looking next week against our division.”\n\nStephen Jones said Monday he isn’t faulting his players’ effort.\n\n“I think you turn on the tape, and our guys are playing hard. I just think go back to the word execute,” Stephen Jones said. “We just have to execute better. We’ve got to get off to a faster start.\n\n“I know everybody is going to want to read into that and try to figure what you say when you say that, but I don’t think it’s really that complicated. We just have to get out there and execute and hopefully get a little more healthy as we move forward and play better.”\n\n—Field Level Media", "description": "The Cowboys' third straight loss, to the previously winless New York Jets on Sunday, hasn't changed the thoughts of Dallas executive vice president Stephen Jones about the future of head coach Jason Garrett.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191015&t=2&i=1440944287&w=1200&r=LYNXMPEF9E03V-OCASP", "published_at": "2019-10-15"}