{"pub": "vice", "url": "https://vice.com/en_asia/article/ywapww/madhya-pradesh-man-says-crows-keep-attacking-him-after-he-failed-to-save-their-baby-chick", "downloaded_at": "2019-09-04 03:45:23.678368+00:00", "title": "Madhya Pradesh Man Says Crows Keep Attacking Him After He Failed to Save Their Baby Chick", "language": "en", "published_at": "2019-09-04", "text": "This article originally appeared on VICE India.\n\nShiva Kewat, a daily wage labourer from the Shivpuri district of Madhya Pradesh, has a story straight out of Alfred Hitchcock’s nail-biter The Birds, where evil flying creatures attack innocent citizens. Turns out, a murder of crows keeps attacking the poor man for a misinterpreted mistake he says he made three years ago.\n\n\n\nIn this bizarre case, Kewat claims that every time he steps out of his house, he is mercilessly made the object of prey by the sharp-beaked birds, who dive straight at him. He says this started after he tried and failed to rescue a crow chick who was caught in an iron netting, three years ago. \"It died in my hands. If only I could explain it to them, I was only trying to help,\" Kewat tells The Times Of India, certain that the crows have blamed him for the death and assumed him to be a killer deserving of their vengeful wrath.\n\nNow, every time Kewat steps out of his house, the birds “attack him like they show fighter jets diving at targets in movies,” according to locals in the area. While he didn’t think it was possibly part of a coordinated plan by the birds, he began to grow suspicious since no one else from the village was ever attacked by these birds. Now, his misfortune means he has to carry a stick every time he leaves his house to shield himself from unexpected aerial attacks, and has even sustained multiple head injuries, unable to do much to defuse the situation.\n\nWhile Kewat is shook that these crows have such advanced facial recognition and a thirst for revenge, this is highly likely as crows are intelligent birds, with a sharp memory capable of registering the faces of those who have harmed them and holding grudges against them. In fact, according to Professor Ashok Kumar Munjal from the Barkatullah University in Bhopal who researches bird behaviour, “It may not be as complex as in humans, but they do have a tendency of remembering individuals and targeting those who have wronged them.”\n\nWell, they don’t call it a murder of crows for nothing.\n\nFollow Shamani Joshi on Instagram.", "description": "Shiva Kewat, a daily wage labourer, claims that the bizarre bird attacks started after a misinterpreted mistake he made three years ago.", "authors": ["Talia Slonim", "Meera Navlakha", "David Gilbert"], "top_image": "https://video-images.vice.com/articles/5d6e498bfffff30008de03ba/lede/1567508900102-Madhya-Pradesh-man-says-crows-keep-attacking-him-after-he-failed-to-save-their-baby-chick-three-years-ago.jpeg?crop=1xw:1xh;center,center&resize=1200:*"}