{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/scarlett-moffatt-hits-back-fat-20540843", "downloaded_at": "2019-10-09 00:57:01.735589+00:00", "title": "Scarlett Moffatt hits back at fat-shamers by 'showing more of her figure off'", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nScarlett Moffatt is fighting fat-shamers by no longer keeping her curves under wraps.\n\nThe reality TV personality, 29, who has been targeted for her changing shape over the years, has discussed how she is now \"really happy\" and \"embracing her body.\"\n\nSharing on her plan to show she in not bothered by trolls commenting on her appearance, the bubbly star has told that instead of covering up she is trying to show-off her figure more.\n\n\"The world would be a boring place if we all looked the same,\" she told new! magazine.\n\nScarlett continued: \"I've been lots of different shapes and sizes but I feel like now I'm just really happy in myself and I think that reflects on the outside.\n\n\"I'm not pretending that I'm the perfect body shape. I've got boobs and hips and rather than try and cover them up, I'm embracing them. I'm trying to show them off a bit more.\"\n\n(Image: Instagram)\n\nScarlett's love-live is also thriving at the moment and she recently opened up about her new relationship and revealed why policeman Scott Dobinson is different from everyone she has dated before.\n\nThe smitten star has been dating Scott since the beginning of the year after they met through a mutual friend.\n\nThe pair have kept their relationship out of the spotlight, and their coupling followed unlucky-in-love Scarlett's split from ex Lee Wilkinson, who she branded a \"pathological liar\".\n\nLee had cheated on Scarlett, but she took him back in a move that saw fans brand her an \"idiot', and the romance did not last.\n\n(Image: Channel 4)\n\nBefore that, Luke Crodden dumped Scarlett on her 27th birthday.\n\nBut all that is behind the star now, as she gushed about how happy she is with new man Scott to CelebsNow .\n\n\"Things are going really, really good with Scott\", she said.\n\n\"He’s just really kind, he’s just a really, genuinely kind person.\"\n\n(Image: Getty)\n\n(Image: PA)\n\nShe added: \"I think the difference with him to my other boyfriends is he’s got his own career going on.\n\n\"He’s got a sensible job, he’s a policeman, he doesn’t want to be involved in this industry.\n\n\"He’s just lovely.\"\n\nShe added: \"I know that if I said “Do you want to go to a premiere?” he’d be like, 'No, I’ll just wait until it’s out in the cinema and we’ll go together.' He’s very chill.\"", "description": "The Googlebox star has admitted that she is embracing her 'boobs and hips' after receiving some cruel comments online", "authors": ["Sara-Aisha Kent", "Image", "Instagram", "Channel", "Getty", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article18995912.ece/ALTERNATES/s1200/2_Sink-the-Pink-Spring-Ball-2019.jpg", "published_at": "2019-10-08"}