{"pub": "businessinsider", "url": "https://businessinsider.com/trump-impeachment-celebrities-reactions-lizzo-2019-9", "downloaded_at": "2019-09-25 23:35:21.093691+00:00", "title": "Lizzo posted a spicy tweet in support of impeaching Trump, and later gave a live demonstration of her message at a concert", "language": "en", "text": "\"Truth Hurts\" singer Lizzo tweeted in support of Trump's impeachment on Tuesday, and gave a live demonstration of her message at a concert that night.\n\nThe singer had tweeted \"IMPEACHMENT,\" with the peach emoji in place of the word \"peach.\"\n\nOnstage, Lizzo used her butt to show the audience what her message meant, since butts and peaches both use the peach emoji.\n\nOther celebrities have also shared their support of the impeachment proceedings on social media, like Chrissy Teigen and Debra Messing.\n\nVisit Insider's homepage for more stories.\n\n\"Juice\" singer Lizzo gave a live demonstration of her pro-Trump impeachment tweet at a concert on Tuesday.\n\nLizzo had tweeted \"IMPEACHMENT\" Tuesday afternoon, with a peach emoji in place of the word \"peach.\" And onstage, she gave concertgoers who were a little confused about the tweet some clarification.\n\n—|L I Z Z O| (@lizzo) September 24, 2019\n\n\"For those who don't know, let me spell it out for you: im-peach-ment,\" the singer said to a cheering crowd, turning around and pointing to her butt when she said the word \"peach.\"\n\nRead more: 5 things you didn't know about Lizzo, America's next 'bop' star\n\nLizzo's audience went wild after she used her backside in reference to Trump's impeachment, and the singer herself seemed pretty pleased with the way she explained it.\n\nBut Lizzo is far from the only celebrity who's shown their support for the Trump impeachment proceedings on social media. Stars like Rosie O'Donnell, Mark Ruffalo, and Chelsea Handler have all spoken out in favor of impeachment.\n\nDirector Ava DuVernay tweeted a GIF from the Emmy Awards of her and the \"Exonerated Five\" (the group of five Black and Latinx men who, as teenagers, were wrongfully convicted of raping a white woman, and later acquitted due to a lack of evidence).\n\nTrump famously took out page-length ads in magazines and papers following the Central Park rape case urging for the return of the death penalty and more police.\n\n\"We are dressed and ready for the #ImpeachmentParty,\" wrote DuVernay, who directed an adaptation of the men's stories with the Netflix series \"When They See Us.\"\n\nOther supporters included \"Will & Grace\" actress Debra Messing (who was berated by Trump for suggesting a \"blacklist\" of his supporters in Hollywood) and actor Jon Cryer.\n\nChrissy Teigen initially tweeted that she didn't \"get\" the impeachment proceedings, before clarifying her feelings in a subsequent tweet.\n\nThis isn't the first time celebrities have banded together to call out Trump or his supporters. In the past, stars like Teigen, Billy Eichner, and Chris Evans have all spoken out against the president and his policies.", "description": "The 'Truth Hurts' singer joined other stars like Chrissy Teigen and Mark Ruffalo on the prospect of filing charges against President Donald Trump.", "authors": [], "top_image": "https://image.businessinsider.com/5d8bda71f4fc242c5308d3ac?width=1200&format=jpeg", "published_at": "2019-09-25"}