{"pub": "breitbart", "url": "https://breitbart.com/news/nobel-figure-sara-danius-who-quit-after-metoo-crisis-dies", "downloaded_at": "2019-10-12 15:17:41.926178+00:00", "title": "Nobel figure Sara Danius who quit after #Metoo crisis dies", "language": "en", "text": "Stockholm (AFP) – Swedish scholar Sara Danius, who quit as head of the academy that awards the Nobel literature prize after a sex scandal unveiled by the #Metoo movement, has died.\n\nThe Swedish Academy said on Saturday that Danius, who revealed in 2014 that she was suffering breast cancer, died at the age of 57.\n\nDanius — the first woman to head the academy as its permanent secretary — stepped down from the post in April 2018 and then quit the body in February of this year.\n\nDanius, a scholar at Stockholm University, joined the academy in 2013 and became its permanent secretary two years later.\n\nAs such she was the voice of the body that awarded the Nobel Prize in Literature to Belarussian journalist Svetlana Alexievitch, US songwriter Bob Dylan and British novelist Kazuo Ishiguro.\n\nThe acadamy was forced to postpone the 2018 award after Swedish newspaper Dagens Nyheter published the testimonies of 18 women claiming to have been raped, sexually assaulted or harassed by Frenchman Jean-Claude Arnault.\n\nArnault is married to Katarina Frostenson, a member of the Academy who later resigned over the scandal. He was jailed for rape in 2018.\n\nArnault received generous subsidies from the academy and boasted he was the “19th member”. According to witnesses, he leaked the names of the future Nobel laureates to his friends.\n\nThe scandal exposed the opaque functioning of the academy, the rivalry between its members.\n\nDanius denounced the forces of “patriarchy” at work within the Academy.\n\nThe Swedish Academy has since been at pains to repair its reputation and saw many of its members leave in the wake of the scandal.\n\nOn Thursday, Polish writer Olga Tokarczuk was awarded the 2018 Nobel Literature Prize, while Austrian novelist and playwright Peter Handke took the 2019 award.", "description": "Stockholm (AFP) – Swedish scholar Sara Danius, who quit as head of the academy that awards the Nobel literature prize after a sex scandal unveiled", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/12/aa2dbe_swedish-academy-permanent-secretary-sara-danius-was-suffering-breast-640x335.jpg", "published_at": "2019-10-12"}