{"pub": "metro", "url": "https://metro.co.uk/2019/10/09/euromillions-won-last-night-check-results-10886425", "downloaded_at": "2019-10-09 08:28:59.912584+00:00", "title": "Was the EuroMillions won last night – how to check your results", "language": "en", "text": "Does your ticket contain the winning numbers? (Picture: The National Lottery)\n\nLuxury cars, incredible holidays, a ticket to space with Sir Richard Branson’s Virgin Galactic – the possibilities of what you could buy with £170 million are fairly endless and that’s the prize money on offer in the biggest ever EuroMillions jackpot this week.\n\nThe draw was last night, Tuesday October 8, meaning that the winning numbers have now been announced and a winner could be revealed.\n\nSo, how do you check if you are the lucky winner?\n\nHow to check your Euromillions results\n\nIf you bought a lottery ticket, you can check it to see if you’ve won by comparing the numbers on your ticket to the winning numbers in the draw.\n\nIn order to win you’d have to match all five of the main numbers – 07, 10, 15, 44, 49 – and the two lucky stars – 03, 12.\n\nYou can also go online to national-lottery.co.uk and use the Euromillions automatic number checker to see if your current or old tickets are winners.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nWas the Euromillions won last night?\n\nAdvertisement\n\nAdvertisement\n\nThey say your chances of winning the Euromillions jackpot are 1 in 139,838,160, but for one lucky UK resident those odds have actually worked in their favour and they’ve just become one of the richest people in the country by scooping the eye-watering £170 million lottery jackpot.\n\nNow richer than multiple-award-winning artist Ed Sheeran, the lucky ticket holder is the UK’s biggest ever lottery winner, but that’s all we know about them at this stage as their identity currently remains anonymous.\n\nThe Euromillions winner will automatically become richer than Ed Sheeran (Picture: Luigi Rizzo/Pacific Press/LightRocket via Getty Images)\n\nThe new winner will join the 78 jackpot winners there have already been in the UK since 2004.\n\nThe winner will receive a visit from the Camelot Winners Advisory team next and their journey towards a new life as a lottery winner will begin.\n\nJealous? Us? No, not at all…\n\nMORE: What actually happens when you win the EuroMillions?\n\nMORE: What country wins EuroMillions the most and where have the biggest jackpots been won?", "description": "The EuroMillions draw was won last night and with largest ever jackpot of £170 million up for grabs, here is how to check if you have won.", "authors": ["Rachael Martin"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/09/PRI_87247224_1570609297.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-09"}