{"pub": "cbc", "url": "https://cbc.ca/news/canada/montreal/quebec-teachers-religious-symbols-ban-1.5297120", "downloaded_at": "2019-09-26 01:33:52.655532+00:00", "title": "Quebec's religious symbols ban causes 'irreparable harm,' teachers tell court | CBC News", "language": "en", "text": "Civil rights groups fighting Quebec's religious symbols law have filed new evidence which, they say, demonstrates without a doubt it has \"caused and continues to cause irreparable harm.\"\n\nLawyers submitted affidavits last week from Muslim women who were denied employment opportunities or internships by Montreal school boards because they wear a headscarf.\n\nThe testimony, which the plaintiffs hope will sway the courts, describes how the ban leaves aspiring teachers with a narrowing scope of career options.\n\n\"This is causing them immediate financial hardship, but also enormous uncertainty about their ability to pursue the careers they have spent years training for, as well as stress and the sense of being singled out among their peers,\" the plaintiffs said in a court document, submitted Sept. 20.\n\n\"This is immediate, severe, irreparable, and unacceptable prejudice.\"\n\nThe law, passed by the Coalition Avenir Québec government in June, bans public-sector teachers, police officers, government lawyers and other authority figures from wearing religious symbols at work.\n\nTeachers already on the job, who remain in their current positions, are exempt under a grandfather clause.\n\nThe National Council of Canadian Muslims (NCCM) and the Canadian Civil Liberties Association (CCLA) filed a motion challenging the law's constitutionality only hours after it went into effect.\n\nQuebec Superior Court Justice Michel Yergeau rejected a request for an emergency injunction in July, saying there was no evidence the law had caused irreparable harm.\n\nAnother request to suspend the law will be heard this fall, on Nov. 26, at the Quebec Court of Appeal.\n\nOne Montreal-born woman, whose name is subject to a publication ban, describes in her affidavit how she's had to take a job working 16 hours a week at a private school after being unable to get a full-time job.\n\nShe told two Montreal school boards she was willing to remove her hijab in front of the children, but would need to be accommodated by having no male aides in the classroom.\n\nQuebec's ban on religious symbols bars public-sector teachers, police officers, government lawyers and other authority figures from wearing religious symbols at work. (Fred Ernst/Associated Press)\n\nThe woman, a graduate of McGill University's education program, said she didn't hear back from either the Lester B. Pearson School Boards or the Commission scolaire de Montréal.\n\n\"Now, I am depressed and anxious, and I feel like a second-class citizen in my own province,\" she said in the document.\n\nAnother woman, who wears a hijab and has worked for years as a preschool and primary school teacher, said she tried to secure a position with the Commission Scolaire Marie-Victorin, in Montreal's South Shore, at the end of last year in order to qualify for the grandfather clause.\n\nAt the beginning of September, she was told she no longer had a job if she didn't remove her hijab. Now, she works as a school monitor at another school, with a lower salary.\n\n\"I had to find a job, but I cannot take off my hijab,\" she said in her affidavit.\n\nThere are four criteria for a judge to grant an injunction: a law must raise serious constitutional questions, cause irreparable harm, its suspension must not be overly inconvenient and the matter must be urgent.\n\nIn his July decision, Yergeau found the plaintiffs had only satisfied the first condition.\n\nThe civil rights groups contend in last week's court filing that the judge erred in saying the other criteria weren't satisfied.\n\nThey argue, furthermore, that there is no longer any question that the impact of the law is \"hypothetical.\"", "description": "Civil rights groups fighting Quebec's religious symbols law have filed new evidence which, they say, demonstrates without a doubt it has \"caused and continues to cause irreparable harm.\"", "authors": ["Benjamin Shingler Covers Politics", "Immigration", "Social Issues For Cbc Montreal. Follow Him On Twitter"], "top_image": "https://i.cbc.ca/1.5205513.1562696249!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/bill-21-challenge-20190709.jpg", "published_at": "2019-09-25"}