{"pub": "yahoo", "url": "https://sports.yahoo.com/marquez-couldnt-breathe-five-seconds-105642644.html", "downloaded_at": "2019-10-05 03:51:29.320108+00:00", "title": "Marquez \"couldn't breathe\" for five seconds after MotoGP FP1 crash", "language": "en", "text": "Marquez\n\nMarc Marquez says he \"couldn't breathe\" for five seconds after his massive and \"strange\" MotoGP Thailand Grand Prix FP1 crash, which he admitted was at least in part his mistake.\n\nMarquez, who is well-placed to take a sixth premier class title this weekend, had a heavy highside crash at the Turn 7 right-hander in the closing stages of the first 45-minutes practice session at Buriram.\n\nScroll to continue with content Ad\n\nThe Honda rider was transferred to a local hospital for precautionary checks on his legs and back, but was declared fit and returned to action for FP2 - where he ended up sixth fastest, having led the session early on.\n\nMarquez said that although it is \"painful everywhere\" for him, he quickly recovered after the crash and the main worry was not being able to breathe for five seconds.\n\n\"Was around five seconds that I couldn't breath,\" recalled Marquez.\n\n\"For that reason I was [staying] there on the floor, in the gravel. It is only five seconds, but for me was like 20 seconds.\n\n\"It was a big impact and it is true that step-by-step, [I got] better and better and when I arrived in the medical centre, I was already okay.\n\n\"But then, I fully understand, the doctors try to manage the situation in the best way and they prepared to have a deep scan [to check] all these things, and we went to the hospital. But the most important thing is that I am okay.\n\n\"[I am] painful everywhere, but the biggest thing after the crash was that I couldn't breathe in a good way. This was the main problem.\"\n\nMarquez explained the crash was partly caused by the bike's engine braking locking the rear when he completely shut the throttle going through Turn 7 - something not normally done at that corner.\n\nMarquez\n\n\"I was much slower than the normal laps because I was [coming] out of the box,\" he explained.\n\nStory continues\n\n\"It was with new tyres, maybe the track was not clean enough, but that is normal.\n\n\"The main difference is that normally on that corner, we don't completely close the gas. On that lap I closed it completely because I went out of the box and I was not pushing.\n\n\"The out-lap, I closed the gas. When you close the gas, engine braking is going on, and that is when I locked the rear.\n\n\"It's not a mechanical problem, it's more because it was my mistake because I was riding slow.\n\n\"[Aside from] this change of riding, maybe the tyre was not ready or maybe I was a little bit on the dirt. Difficult to understand.\"\n\nPramac's Jack Miller said that it is \"very easy\" to have a crash like Marquez had at Turn 7, which the Australian takes as if it was wet.\n\n\"Very easy to do that,\" the Pramac Ducati rider said of Marquez's crash.\n\n\"Honestly, on a new tyre you go out there and because [there are] so many hard right-hand corners here, the right-hand side of the tyre you really gotta be careful on that first lap.\n\n\"It caught him out there.\n\n\"I'm going through there [Turn 7] like it is in the wet, keeping a tiny bit of partial throttle not to upset the bike at all.\n\n\"It is slippy, it is not a nice point, you saw [Miguel] Oliveira also go down there this morning on the out-lap.\"\n\nGet unlimited access to the world’s best motorsport journalism with Autosport Plus", "description": "Marc Marquez says he \"couldn't breathe\" for five seconds after his massive and \"strange\" MotoGP Thailand Grand Prix FP1 crash, which he admitted was at least in part his mistake", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/qITA93DHAWrQzlH4l_Fwhg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTYwMDtoPTQwMA--/https://s.yimg.com/uu/api/res/1.2/f4TRISidl8jAU6oAu8cE7g--~B/aD0yMDA7dz0zMDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/autosport_578/c2e352827b300607581b6c1383134958", "published_at": "2019-10-04"}