{"pub": "reuters", "url": "https://in.reuters.com/article/uk-athletics-world-kipruto/kipruto-wins-photo-finish-to-claim-steeplechase-gold-idINKBN1WJ29J", "downloaded_at": "2019-10-05 00:00:26.727359+00:00", "title": "Kipruto wins photo finish to claim steeplechase gold", "language": "en", "text": "DOHA (Reuters) - Kenya’s Conseslus Kipruto edged out Lamecha Girma of Ethiopia in a photo finish to successfully defend his 3,000 metres steeplechase world title on Friday.\n\nAthletics - World Athletics Championships - Doha 2019 - Men's 3000 Metres Steeplechase Final - Khalifa International Stadium, Doha, Qatar - October 4, 2019 Kenya's Conseslus Kipruto celebrates winning gold REUTERS/Ahmed Jadallah\n\nIn the home straight the race came down to a 100m sprint and Kipruto just won it, dipping to pip the 18-year-old Girma on the line in a time of eight minutes, 1.35 seconds.\n\nGirma was 0.01 seconds back and had to settle for silver, Ethiopia’s first ever medal in the event.\n\nMorocco’s Soufiane El Bakkali completed the podium by taking the bronze.\n\n“The Ethiopians really pushed hard because they knew I was kicking,” Kipruto said. “They had their plans before we started the race and I had plans for us Kenyans to push hard.\n\n“For me in championships I always believe experience matters a lot, it is not about shape.\n\n“Steeplechase is normally a Kenyan event it belongs to Kenyans but nowadays there are competitors from around the world.”\n\nKipruto’s victory extended Kenya’s dominant run to seven consecutive men’s world steeplechase gold medals going back to the 2007 championships in Japan.\n\nBut the 24-year-old Kipruto only managed to keep his country on top by the smallest of margins.\n\nTrailing the 18-year-old Girma over the final barrier, the Kenyan tapped into his experience and timed his kick to perfection to beat his rival to the wire by millimetres.\n\n“This is my first major international competition and I am very happy,” Girma said. “In the last 50 metres I was thinking I am going to win. Before the race I did not expect to win.\n\n“I am very thrilled to be the first Ethiopian to medal at the world championships.”", "description": "Kenya's Conseslus Kipruto edged out Lamecha Girma of Ethiopia in a photo finish to successfully defend his 3,000 metres steeplechase world title on Friday.", "authors": ["Steve Keating", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191004&t=2&i=1437176847&w=1200&r=LYNXMPEF931PC", "published_at": "2019-10-04"}