{"pub": "yahoo", "url": "https://news.yahoo.com/property-chiefs-want-speedy-decision-102900993.html", "downloaded_at": "2019-10-30 14:38:09.631188+00:00", "title": "Property chiefs want speedy decision on Brexit after general election", "language": "en", "text": "Property bosses hurt by political and economic uncertainty on Wednesday urged whichever party wins the just-announced general election to make a Brexit decision swiftly and not neglect the housing market.\n\nFirms that have been grappling with some weaker buyer confidence made their pleas after MPs last night backed Prime Minister Boris Johnson’s call for an election.\n\nThe UK will go to the polls on December 12.\n\nNick Leeming, chairman of estate agents chain Jackson-Stops, said: “It is clear that each of the main political parties’ manifestos need to have housing as a priority.”\n\nHis firm today published results of a survey from 1100 of its clients. Of these, over half believe housing isn’t a priority for Johnson.\n\nWeston Homes' chief executive Bob Weston said he hopes the election “puts uncertainty to an end one way or the other”.\n\nGeoffrey Lander, chairman of property law firm Davitt Jones Bould, said: “The dinner-party chat I hear is whether we remain in or leave the EU is less important than a decision being taken so we can all move on.”\n\n\n\n\n\nRead more\n\nHousebuilder London Square hit by delayed sales and partnerships\n\nSajid Javid urged to set Budget date amid stamp duty confusion\n\nHousebuilder to create flats on former London and Epsom police sites", "description": "Property bosses hurt by political and economic uncertainty on Wednesday urged whichever party wins the just-announced general election to make a Brexit decision swiftly and not neglect the housing market.Firms that have been grappling with some weaker buyer confidence made their pleas after MPs last", "authors": ["Joanna Bourke"], "top_image": "https://s.yimg.com/uu/api/res/1.2/5NH9bB4R1LSMxrYWmWjDkA--~B/aD0zNTE7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/evening_standard_239/a541e1bd9e48d994b6372e5af3286ad9", "published_at": "2019-10-30"}