{"pub": "businessinsider", "url": "https://businessinsider.com/tj-maxx-what-to-buy-deals-products-2019-10", "downloaded_at": "2019-10-30 00:05:10.943411+00:00", "title": "18 products that are worth buying at TJ Maxx — and 8 more you should skip", "language": "en", "text": "TJ Maxx is one of the biggest off-price retailers in the US, with more than 1,260 stores across America.\n\nWe consulted a shopping expert and several blogs and online reviews to find the best and worst products at TJ Maxx.\n\nHere are 18 products to buy at TJ Maxx and eight to consider skipping.\n\nVisit Business Insider's homepage for more stories.\n\nAs one of the biggest off-price retailers in the US, TJ Maxx has found a special place in the heart of many Americans looking to score a bargain on everything from designer jeans to bedroom furniture.\n\nAlong with its sister companies Marshalls and HomeGoods, TJ Maxx has managed to stay afloat as traditional retailers and department stores struggle, thanks to its loyal fan base and savvy business model. Its parent company, TJX Cos., consistently reports positive quarterly sales growth, including most recently in August, when it reported that comparable sales grew by 2% in the second quarter of 2019.\n\nAccording to the shopping expert Michelle Madhok, TJ Maxx's primary appeal is the opportunity it offers for discovery. It's a place where shoppers come seeking bargains for items on their shopping list and uncover unexpected deals.\n\n\"The fun thing about TJ Maxx is the hunt,\" Madhok, who runs the shopping website SheFinds.com, told Business Insider. \"It's for someone who likes novelty in shopping. If you know exactly what you want, you can go on Amazon and get it delivered. TJ Maxx is for someone who enjoys the activity of shopping.\"\n\nAnother expert tip is to hit TJ Maxx on Wednesdays, which is when most of the stores restock with new products, Madhok said. Shoppers can also plan around the retailer's annual sales in January and July.\n\nWith such an expansive product assortment, it can be tough to identify the best bargains. With that in mind, here are 18 products to buy at TJ Maxx and eight you should skip.", "description": "We consulted a shopping expert and several blogs and online reviews to find the best and worst products at TJ Maxx.", "authors": ["Bethany Biron"], "top_image": "https://image.businessinsider.com/5db876a2dee01911362e7413?width=1200&format=jpeg", "published_at": "2019-10-29"}