{"pub": "dailymail", "url": "https://thisismoney.co.uk/money/markets/article-7580743/Savers-frozen-second-Woodford-fund-charging-fees.html", "downloaded_at": "2019-10-16 23:19:51.071345+00:00", "title": "Savers frozen out of second Woodford fund: But he is STILL charging fees", "language": "en", "text": "Neil Woodford is still raking in fees from his doomed investment empire even after barring savers from taking their money out of a second of his funds.\n\nIn yet another insult to investors who trusted the once-feted fund manager with their money, the 59-year-old is taking £5,000 a day from customers with savings in the Woodford Income Focus fund.\n\nBut while Woodford continues to cash in, investors have been stopped from withdrawing their cash from the fund following the implosion of his business.\n\nIn yet another insult to investors who trusted Neil Woodford with their money, the 59-year-old is taking £5,000 a day from customers with savings in the Woodford Income Focus fund\n\nLink Fund Solutions, the firm charged with overseeing the management of Woodford’s operations, froze the Income Focus fund yesterday.\n\nThe move came after Woodford resigned from running the fund on Tuesday, having been fired from managing his separate Equity Income fund hours earlier.\n\nBut he will remain in place as the manager of the £253million Income Focus fund until a successor is found, allowing him to keep raking in fees.\n\nHis decision to keep charging savers mirrors a similar move at his Equity Income fund.\n\nAfter Equity Income was frozen in June, signalling the beginning of the end for the Woodford empire, he continued to collect £65,000 a day from savers.\n\nHe was finally fired but only after his now-collapsed firm Woodford Investment Management pocketed fees of £8.8million since the fund was frozen.\n\nFormer pensions minister Baroness Ros Altmann said: ‘This totally undermines the confidence of the ordinary investor.\n\nWhat now for worried investors Equity Income Investors have been denied access to their cash since June 3. The fund will begin to be wound up on January 17. That is when money should start to be returned to investors. But savers face a long wait before they get all their money back. And they are likely to get back far less than they put in. Income Focus This fund was frozen yesterday, stopping savers from accessing their money. Administrators Link say they will update investors within two weeks. Until that update, it is unclear when savers will get their money back. Patient Capital Trust The trust trades on the stock market. This means that investors can buy or sell at any time. But with shares at a record low, savers face heavy losses.\n\n‘Smaller investors rely on a regulatory system that is letting them down. You have to wonder where the regulator was in all this – asleep at the wheel, it seems.\n\nWhy does the Financial Conduct Authority not have powers to stop a manager taking fees in a situation like this?’\n\nJustin Modray, of Candid Financial Advice, added: ‘Woodford really alienated investors by charging management fees on a fund suspended because of his own poor judgement.’\n\nLink’s decision to fire the fallen manager has caused his empire, Woodford Investment Management, to crumble.\n\nAsset managers Blackrock and Park Hill have been appointed to wind up the Equity Income fund, selling assets and returning money to investors.\n\nWoodford resigned as manager of his two other funds, Income Focus and the Patient Capital Trust, and decided to shut down his firm.\n\nThe downfall of Britain’s most famous fund manager follows years of dismal performance.\n\nThe Equity Income fund saw its value peak at £10.2billion in June 2017 but is now worth just £3billion.\n\nIncome Focus has seen its value fall from £747million to £253million while shares in Patient Capital have fallen 73 per cent.\n\nHe has a six-month notice period to work through at the Income Focus fund. If he remains manager for all of that time, investors will pay him another £900,000 in fees.\n\nLink is hoping to hammer out a deal to decide the future of the Income Focus fund within the next 13 days.", "description": "In yet another insult to investors who trusted the once-feted fund manager with their money, the 59-year-old is taking £5,000 a day from customers with savings in the Woodford Income Focus fund.", "authors": ["Lucy White For The Daily Mail", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/20/19804206-0-image-a-6_1571255394595.jpg", "published_at": "2019-10-16"}