{"pub": "marketwatch", "url": "https://marketwatch.com/story/cannabis-stocks-mixed-as-euphoria-over-banking-bill-fades-in-face-of-tricky-senate-2019-09-26?mod=rsswn", "downloaded_at": "2019-09-27 11:26:19.584988+00:00", "title": "Cannabis stocks mostly lower as euphoria over banking bill fades in face of tricky U.S. Senate path", "language": "en", "text": "Cannabis stocks fell on Thursday as the initial euphoria sparked by a House of Representatives vote in favor of a bill that would protect banks that serve the cannabis sector faded, as analysts cautioned that the Senate is unlikely to give it a thumbs-up — and may not even vote this year.\n\nThe ETFMG Alternative Harvest ETF MJ, -0.45% was last down 1.2%, with 21 of its 34 stocks declining. The Horizons Marijuana Life Sciences ETF HMMJ, +0.00% was down 0.8% with 26 of its 54 components lower.\n\nThe bill, called the Secure and Fair Enforcement (SAFE) Banking Act, was approved in a 321 to 103 tally that was widely expected given bipartisan support for the measure. Because cannabis is banned at the U.S. federal level, banks that are federally insured are reluctant to do business with companies in states that have legalized, hampering the development of the sector.\n\nBut Height Securities said they estimate the bill has just 25% odds of being approved by the Senate, where the Senate Banking Committee, which would first need to vote, has not marked up a bill in almost 500 days.\n\nIn case you missed it: Cannabis companies are having a horrible summer as scandals mount and stocks slide\n\n“Our work has indicated that cannabis is a topic that divides the Republican Senate caucus and Senate Majority Leader Mitch McConnell (R-KY) has focused on legislation that has had more unified Republican support,” analysts wrote in a note to clients.\n\nThat dynamic has not changed, although McConnell may want to support Senators Cory Gardner, a Colorado Republican, and Susan Collins, a Maine Republican, in their reelection bids to ensure the Senate remains Republican-controlled. Both are in states that greatly support the cannabis sector. Meanwhile, Senate Minority Leader Chuck Schumer, a New York Democrat, may try to stop the bill passing despite broad Democratic support, in order to retake the Senate for Democrats in 2020, the analysts wrote.\n\n“While House passage of SAFE was in line with our outlook, passage is in the Senate is far from certain, even if SBC marks up SAFE or a similar bill,” they wrote.\n\nAlliance Global Partners said the move still brings the sector a step closer to having banking and is a “positive indicator for the legitimacy of the cannabis industry.” But Alliance also views the Senate as a more challenging chamber, given McConnell’s stance.\n\nCannabis market leader Canopy Growth shares CGC, +0.20% WEED, +0.49% fell 1.5%, after MKM Partners said the passage of the SAFE Act would likely not be a trigger for its acquisition of Acreage Holdings ACRGF, +3.02% Analyst Bill Kirk said the bill as currently written is unlikely to prove sufficient to meet the terms of the deal, in which Canopy has the right to acquire Acreage once U.S. cannabis restrictions have been eased.\n\nSee also: Key Republican sounds noncommittal on protecting banks that work with the marijuana industry\n\n“We think the biggest benefits would fall with the smaller operators rather than the better capitalized and resourced publicly traded companies in our coverage,” Kirk wrote. The analyst rates Canopy as neutral but has a buy rating on Acreage.\n\nAlliance analysts agreed and said the Canopy/Acreage deal will require the lifting of the federal ban on cannabis. They too said that smaller players are likely bigger beneficiaries of Wednesday’s vote.\n\n“The biggest impact we believe could be if the SAFE Act opened up the use of credit cards at dispensaries/retail stores, which we believe would help to increase customer spend (though it is uncertain if the SAFE Act would open up broader credit card spending),” they wrote.\n\nTilt Holdings shares TLLTF, -3.48% TILT, +14.29% rose briefly then slid 9%, after the company said the vaping ban in its home commonwealth of Massachusetts should have little to no effect on its revenue and growth in the short term. The Cambridge-based company said four-month ban will prevent it from selling Jupiter Research LLC products in the Commonwealth, but said those account for less than 2% of Jupiter’s overall annual revenue, citing internal company data. The stock has fallen 90% in 2019 and is now trading at just 26 cents.\n\nTilt said the ban, which comes after an outbreak of a serious lung illness that has killed at least eight people and sickened more than 530 and is believed to be linked to vaping, will also have little effect on its subsidiary Commonwealth Alternative Care.\n\nSee now: Aurora Cannabis stock sinks after analyst says it’s time to ‘sell’\n\n“In the long term, we believe this is an opportunity for regulatory bodies to eliminate many of the unsafe products on the market in Massachusetts,” the company said.\n\nPatients have told doctors they had vaped THC-based products, mostly acquired in the black market, and cannabis companies have urged a greater crackdown on black market activities in its wake.\n\nCalifornia health officials have also warned consumers to stop vaping and Walmart WMT, -0.14% has stopped selling e-cigarettes. A report from 420Intel.com said China, the world’s biggest market for smokers, is also preparing to impose controls on vaping.\n\nSee also: Vape sales are falling on fears about the outbreak of vaping-related lung illness\n\nGreenlane Holdings Inc. reversed early gains to trade down another 5%, bringing the stock’s week-to-date loss to 19%. Cronos CRON, -2.19% fell 3.2% and Tilray TLRY, +0.41% was down 0.6%.\n\nCannabis Watch: For all of MarketWatch’s coverage of cannabis\n\nAurora Cannabis Inc. ACB, -0.42% ACB, -0.16% was down 0.4% and Hexo HEXO, -0.72% was up 0.2%. Organigram OGI, -2.89% fell 2.5%, Green Growth Brands GGBXF, -6.09% GGB, +0.00% was down 2.7% and Aleafia Health ALEAF, +0.40% ALEF, -1.08% was flat.\n\nThe S&P 500 SPX, -0.24% and the Dow Jones Industrial Average DJIA, -0.30% were down 0.1%.\n\nRead now: ‘Don’t smoke the Kool-Aid,’ analyst says in sober note on the cannabis sector", "description": "Cannabis stocks turned mixed on Thursday, as the initial euphoria sparked by the U.S. House of Representatives vote in favor of a bill that would protect...", "authors": ["Ciara Linnane", "Corporate News Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS141_mcconn_ZG_20190926114110.jpg", "published_at": "2019-09-26"}