{"pub": "dailymail", "url": "https://dailymail.co.uk/money/bills/article-7485339/Angry-customer-blasts-BT-superfast-broadband-failure.html", "downloaded_at": "2019-10-05 08:51:10.047896+00:00", "title": "Angry customer blasts BT over superfast broadband failure", "language": "en", "text": "A BT customer who took two days off work to get superfast broadband installed has blasted it for shoddy work, missed appointments and weeks spent without internet.\n\nMum-of-two Nicole Beebee said she was 'seduced' by an offer of a free £40 pre-paid card and Xbox when signing up to a new BT deal that would provide a new home phone, superfast broadband and a TV package that included sports.\n\nBut a catalogue of errors left her with damaged brickwork, children without TV or internet during the school holidays and a struggle to get things sorted until This is Money stepped in.\n\nDamage: A BT engineer managed to drill through the external walls of a customer's property\n\nThis is Money reader Nicole, of Bristol, got in touch for help with her dispute with BT over their inability to set up her phone, broadband and TV package.\n\nShe initially paid £79.99 to the telecommunications firm and was informed that everything was due to be installed on 13 August with the equipment arriving the day before.\n\nHowever, after taking the day off work in order for the installation to take place, no BT engineer showed up.\n\nWhen she called BT to complain, she was told there was never any appointment booked despite her having text and email proof to the contrary.\n\nAnother appointment was booked for 20 August for which Nicole took another day off work.\n\nThe BT engineer arrived at 9am and stayed until 5pm but by the time he left, nothing was working.\n\nMore frustratingly, however, the engineer drilled through the walls of Nicole's home for the installation, breaking one of the bricks in the process. He proceeded to fix this messily with what looked to Nicole like white glue.\n\nShe also claims that he managed to drill through many of the walls inside the house.\n\nA third appointment was made for the 22 August, with Nicole taking yet another day off work but no engineer showed.\n\nShe said: 'My children have had no TV or internet for weeks in the school holidays and have missed the entire football season so far. Then there is the state of my walls. DIY SOS need to come!'\n\nWith no internet, she and her sons went over their mobile data limits and she had to pay out £45 for a dongle to be able to access the internet.\n\nA fourth appointment was made where the engineer did show up but was still unable to find out the source of the issue.\n\nIncreasingly frustrated, Nicole contacted This is Money for help, whilst also suggesting she would be getting in touch with the regulator as 'nobody at BT is doing anything to help'.\n\nSince This is Money contacted BT about the issue, Nicole's phone line has been properly installed and she is now able to use all the services she has been waiting weeks to use.\n\nA BT engineer failed to properly install a customer's phone line, instead leaving damaged walls\n\nA BT spokesperson said: 'We're very sorry for the time taken to fully install Ms Beebee's BT services and for any inconvenience caused. Engineers fixed the fault with her phone line and have successfully set-up her TV service, so all of Ms Beebee's services are now up and running.\n\n'Ms Beebee will be compensated in line with Ofcom's Automatic Compensation Scheme and we have offered an additional goodwill gesture to cover the costs.'\n\nNicole has since received £195, equivalent to £5 for each day she had no services and £25 for each missed appointment. She was also given a sum to cover all the costs she endured in the meantime, for example going over data on phones, buying a dongle for £44.99 and a gesture of goodwill.\n\nHowever, Nicole's complaint with OpenReach, a division of BT, about the damage caused to her home is still outstanding.\n\nShe added: 'BT Openreach are still investigating so I've not had any compensation for the damage to my home nor a time scale for how long it will take them! It's just all been so bad.'\n\nIt is not just Nicole that has had a bad experience however as Ofcom have confirmed to This is Money that since 1 September 2018, it has received nine ‘Fault/Service/Provision’ complaints against Openreach that contain the word ‘damage’.", "description": "A catalogue of errors left a mum-of-x with damaged brickwork, children without TV or internet during the school holidays and a struggle to get things sorted until This is Money stepped in.", "authors": ["Grace Gausden For This Is Money", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/09/20/11/18714308-0-image-a-25_1568976464549.jpg", "published_at": "2019-09-30"}