{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7554629/Jodie-Chesneys-killer-attacked-wrong-people-revenge-attack.html", "downloaded_at": "2019-10-09 19:15:33.570161+00:00", "title": "Jodie Chesney's 'killer attacked the wrong people in revenge attack'", "language": "en", "text": "Jodie Chesney was stabbed to death in east London. Prosecutors have suggested her killer was trying to kill a rival of his\n\nTeenage girl scout Jodie Chesney was murdered by a teenager who was trying to 'bang out' a rival but got the wrong people, a court has heard.\n\nJodie, 17, was sitting with friends in a park in Harold Hill, east London, when she was stabbed in the back on 1 March. Four alleged drug dealers - Svenson Ong-a-Kwie, Manuel Petrovic and two boys who cannot be named - are on trial for her murder.\n\nA jury at the Old Bailey has heard claims Ong-a-Kwie, 19, was seeking revenge after he was stabbed a couple of months earlier.\n\nManuel Petrovic, 20, who is said to have taken Ong-a-Kwie to the park, was later recorded talking to a friend who visited him at HMP Belmarsh, where he was being held while on remand following his arrest.\n\nA transcript of their conversation records Petrovic as saying: 'You know what actually happened?\n\nMs Grey asked: 'What?'\n\n'They went to bang out (attack) on their ops (rivals) and banged out the wrong people,' replied Petrovic.\n\nWhen asked how he knew, Petrovic, said: 'Because I know that...it was to do with Svenson's op - they cheffed (stabbed) him up a couple of month or something, a couple of months before.\n\n'Someone gave him the drop (tip off). He went to ride out and rid out on the wrong people in the park and they thought it was them because they chill in the area. That's why she (Jodie) got it from behind.'\n\nSvenson Ong-a-Kwie (left) is said to have carried out the attack. Manuel Petrovic (right) was later recorded telling his friend that the attack was aimed at rivals of Ong-a-Kwie\n\nTwo other men who were in the park shortly before the attack may have been the intended targets, prosecutors suggested. There is no suggestion they were involved in her killing.\n\nEarlier conversations recorded in HMP Belmarsh reveal Petrovic musing about being prosecuted under drugs charges and a possible sentence of around five years.\n\n'I get five, I might even get two suspended. A year and half behind doors out for Xmas.'\n\nWhile he was waiting for his trial to start, he and friends discussed the press coverage of the trial.\n\nReferring to a court sketch of Petrovic, his friend said: 'Your ears, it is awful. Mate they have taken the p**s with your ears.'\n\nOng-a-Kwie was pictured on CCTV in the hours before the killing, the trial has heard\n\nMs Grey and Petrovic also spoke about the length of sentence if he was convicted for the murder of Jodie believing it could range from 15 to 30 years.\n\nMs Grey said: 'You have just got to look at this like a little holiday camp..'\n\nBut Petrovic had quipped HMP Belmarsh should be dubbed HMP Hellmarsh after bemoaning the shower facilities, the court heard.\n\nPetrovic, of Collier Row, east London, Ong-a-Kwie, of Romford, a 17-year-old and 16-year-old, both from east London, who cannot be named, deny her murder.\n\nThe trial continues.", "description": "Jodie, 17, was sitting with friends in a park in Harold Hill, east London, when she was stabbed in the back on 1 March. Four alleged drug dealers are on trial for her murder.", "authors": ["Richard Spillett", "Crime Correspondent For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/15/19495870-0-image-a-48_1570631604169.jpg", "published_at": "2019-10-09"}