{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7573149/Jackie-O-defends-Masked-Singer-judges-not-able-guess-Kate-Ceberano-Lion.html", "downloaded_at": "2019-10-15 02:18:04.786965+00:00", "title": "Jackie O defends The Masked Singer judges not being able to guess Kate Ceberano as the Lion", "language": "en", "text": "She's had a radio career that extends across almost two and a half decades.\n\nBut after Jackie O Henderson was criticised for failing to recognise Kate Ceberano as the Lion on The Masked Singer this week, she took to the airwaves to defend herself.\n\nSpeaking on her KIIS FM radio show on Tuesday, the celebrity judge insisted that she and her fellow judges 'don't hear what you hear'.\n\n'We don't hear what you hear': Jackie O Henderson has defended herself and fellow judges after they were lambasted by fans for not being able to guess Kate Ceberano on The Masked Singer Australia on Tuesday\n\n'When you're at that judging panel you've got the crowd, you've got so much going on, you don't hear what you hear back home,' she explained.\n\nJackie admitted that re-watching Kate's performances on television made her question how she could have gotten her identity so wrong.\n\n'Watching on TV, I was like, 'Oh my god that sounds exactly like Kate Ceberano, how did we not pick that up?'\n\n'How did we not pick that up?' Jackie admitted that re-watching Kate's performances on television made her question how she could have gotten her identity so wrong\n\n'I will say this, everyone listening at home was guessing Kate Ceberano because you could hear Kate Ceberano, right, it was so obvious,' she said.\n\nMost fans appeared to have guessed that Lion was Kate weeks ago, with some so sure that they called the reveal 'underwhelming'.\n\nWhen the 52-year-old lifted off her mane, many viewers also expressed their surprise that the judges were unable to identify her.\n\nGig's up! Most fans appeared to have guessed that Lion was indeed singer Kate Ceberano weeks ago, with some so sure that they called the reveal 'underwhelming'\n\nAlso during Tuesday's radio show, KIIS FM co-host Kyle Sandilands asked why some the judges continued to make 'dumb' guesses.\n\n'Hughesy throws in some odd ones for comic relief,' she responded.\n\n'We don't want those comic relief ones,' Kyle told her. 'It's so infuriating.'\n\nThe Masked Singer continues Tuesday night at 7.30pm on Channel 10", "description": "She's had a radio career that extends across almost two and a half decades.", "authors": ["Ali Daher For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/00/19715552-0-image-a-5_1571094822548.jpg", "published_at": "2019-10-15"}