{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/4/miamis-bahamian-ties-inspire-relief-effort-after-d", "downloaded_at": "2019-09-04 08:07:04.839488+00:00", "title": "Miami's Bahamian ties inspire relief effort after Dorian", "language": "en", "published_at": "2019-09-04", "text": "MIAMI (AP) - Spared from the wrath of Hurricane Dorian, people in South Florida are donating water, food and household supplies in a relief effort spearheaded by descendants of some of Miami’s earliest settlers from the Bahamas.\n\nFloridians showed up in droves Tuesday to give cans of food, bottles of water and boxes of diapers to members of two historically black churches who were sorting them before they were to be flown to the devastated islands of Abaco and Grand Bahama.\n\n“We have to channel all that anxiety into something positive,” relief coordinator Jonathan Archer said. Archer is the former head of a parish in Long Island, Bahamas, and current rector of the Christ Episcopal Church in Miami’s historic Coconut Grove neighborhood, some of whose first settlers hailed from the Bahamas.\n\nSome of the volunteers were frantically trying to text cousins, uncles, aunts and nieces who braved the powerful storm in their island homes. Few had any luck Tuesday.\n\n“I am grateful that we weren’t hit but the severity of the damage in Abaco and Freeport just breaks my heart,” said Diane Alexander, a 57-year-old retired teacher who has cousins in Nassau. Alexander bought provisions for Dorian then decided to donate them when the storm no longer threatened a direct hit on Florida.\n\nPractically parking over a portion of the Bahamas for a day and a half, Dorian pounded Abaco and Grand Bahama with winds up to 185 mph (295 kph) and torrential rain, ripping apart homes and trapping people in their attics on the island nation. The government on Tuesday had reported five deaths but the full extent of the damage wasn’t yet clear.\n\nThe storm finally moved into open waters Tuesday, but was still centered not far from the western tip of the Bahamas as it crawled northwest toward the southeastern U.S. Its winds were down to a still-dangerous 110 mph (175 kph).\n\nFlorida state Rep. Shevrin Jones, who was asking people to donate, said one of his extended relatives is an officer with the Bahamas immigration agency and had been working as a first responder. Jones tweeted a screen shot of a WhatsApp message he received from the relative, who said she and her rescue team had found family members curled up together, all of them dead.\n\nHelping to collect supplies was Elvrern Ross, a native of Nassau, Bahamas, and now a member of the Greater St. Paul A.M.E. Church in Coconut Grove, one of the institutions seeking donations. Ross said she has an uncle and aunt with young children who did not want to evacuate their home in Marsh Harbour, where storm surge was reported at 18 to 23 feet (5.5 to 7 meters). She has not been able to reach them.\n\nRoss arranged boxes of toothpaste and soap bars on a table Tuesday, working alongside the great-granddaughter of one of the Bahamian worshippers who founded St. Paul in 1896.\n\n“I wanted to volunteer to take my mind off all that stuff that is going on there,” she said.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Spared from the wrath of Hurricane Dorian, people in South Florida are donating water, food and household supplies in a relief effort spearheaded by descendants of some of Miami's earliest settlers from the Bahamas.", "authors": ["The Washington Times Http", "Adriana Gomez Licon"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/04/tropical_weather_florida_relief_effort_72860_c0-82-1960-1224_s1770x1032.jpg?e23d5b4a10b9aafc387c204d76cee53f6daf5d34"}