{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/15/1929915/0/en/VanillaSoft-Named-G2-Momentum-Leader-in-Sales-Performance-Management.html", "downloaded_at": "2019-10-15 15:04:02.078935+00:00", "title": "VanillaSoft Named G2 Momentum Leader in Sales Performance Management", "language": "en", "text": "Plano, TX, Oct. 15, 2019 (GLOBE NEWSWIRE) -- VanillaSoft, a leading sales engagement technology company, has been recognized as a top Momentum Leader on the G2 Grid for Sales Performance Management – leading all other vendors in terms of momentum.\n\nThe G2 Momentum Grid, “identifies products that are on a high growth trajectory based on user satisfaction scores, employee growth, and digital presence. VanillaSoft leads all other vendors in the Sales Performance Management grid in terms of momentum - outpacing industry growth by delivering innovative solutions that meet the evolving needs of users.\n\nDavid Hood, CEO at VanillaSoft, said:\n\n“At VanillaSoft we are continually striving to ensure that our customers have the best sales engagement technology at their fingertips to help them move their sales processes forward efficiently and effectively. We are pleased to see that our customers appreciate this, and are sharing their positive experiences of using VanillaSoft with the G2 community.”\n\nHighlights of VanillaSoft customer reviews on G2.com:\n\n“My call volume has increased, as VanillaSoft organizes all of my follow up calls and appointments for my clients and makes it easy for me to see my day at a glance so I don't worry about missing any customer interactions.”\n\n“VanillaSoft’s easy-to-use interface is well designed for a fast-paced and effective workflow.”\n\n“VanillaSoft’s features are outstanding in terms of customization, service, interface, and simplicity. The entire user experience is a 10 out of 10.”\n\nFor more information and to see the G2 Momentum Grid for Sales Performance Management, visit https://www.g2.com/categories/sales-performance-management?trending=#grid.\n\n###\n\nAbout VanillaSoft\n\nVanillaSoft, the industry’s most successful sales engagement platform, helps sales development teams engage over 15,000,000 contacts every month. Used standalone, or in combination with existing traditional CRM systems, VanillaSoft empowers sales reps to respond to new leads faster, interact with leads more consistently, across more channels, and generate more qualified sales opportunities. Globally, thousands of users employ VanillaSoft’s queue-based sales engine and intellective routing to implement sales cadence automation resulting in substantial gains in speed-to-lead, persistency, productivity, and revenue-per-rep. VanillaSoft is a privately held company headquartered in Plano, Texas, USA. To learn more, visit www.vanillasoft.com.\n\nAbout G2.com\n\nHeadquartered in Chicago, G2.com's revolutionizing how businesses discover, buy and manage software and services. More than three million monthly users rely on G2 to help them find and buy the best software for their businesses. The platform has 900,000 reviews, and $100M in total funding invested by IVP, Accel Partners, LinkedIn, Emergence Capital, Pritzker Group, Chicago Ventures, Hyde Park Ventures, industry leaders and founders. G2's customers include IBM and Zoom. Its most recent funding, a $55M Series C, was in October 2018, followed by the company's acquisitions of Siftery and Advocately.\n\nNicole Baker VanillaSoft 613-862-4316 nicole.baker@vanillasoft.com", "description": "", "authors": [], "top_image": "", "published_at": "2019-10-15"}