{"pub": "realclearpolitics", "url": "https://thefederalist.com/2019/10/03/its-not-a-crime-for-trump-to-ask-china-and-ukraine-to-investigate-biden", "downloaded_at": "2019-10-04 23:45:23.633634+00:00", "title": "It's Not A Crime For Trump To Ask China And Ukraine To Investigate Biden", "language": "en", "text": "Today the president reiterated that he wants Ukraine and China to investigate Joe Biden. Democrats have not made clear why that is a crime.\n\nPresident Trump threw a glass of cold water over the impeachment inquiry in the House of Representatives today by essentially stipulating to the main allegation being made against him. In fact, he doubled down on it.\n\nAsked about what he wants Ukrainian President Volomydyr Zelensky to do about Hunter Biden’s business dealings there Trump said, “I would recommend that they start an investigation into the Bidens.” He also suggested that China should open a similar investigation. But what Trump was mostly saying is that he is the president and there is nothing wrong with saying such things to foreign leaders.\n\nThe issue of whether the president may urge foreign leaders to conduct investigations of American citizens running for office has now become the crux of the impeachment inquiry. Long gone now are allegations of any quid pro quo with Zelensky. That ship sailed when the transcript of Trump’s call with the Ukrainian leader offered no evidence that the president was offering military aid as a carrot, which was the initial allegation.\n\nNow Democrats insist that no quid pro quo is needed to prove a high crime or misdemeanor occurred during the phone call. Instead, they insist, this is a question of an illegal campaign contribution. They seem to be suggesting that Trump was asking the Ukrainian government to dig up dirt on his political rival Joe Biden, rather than asking them to root out corruption that allegedly involved his son Hunter Biden, and potentially the former vice president himself.\n\nBut is that a high crime or misdemeanor? We know that Hunter Biden took an extremely lucrative job from a Ukrainian energy concern for which he had no relevant experience. Is it really so strange for Americans to want to know if what he was really offering was access to the vice president?\n\nLikewise we know that Hunter Biden traveled to China with his father on Air Force Two in 2013, and that during that trip he met with a Chinese banker, and 10 days after the trip the Chinese granted a license for a new fund on which Hunter was a board member.\n\nPerhaps these are just coincidences. Perhaps Hunter Biden possesses some vast expertise in business that he honed while snorting cocaine during his time in the Navy. But it does not seem completely unreasonable to imagine his proximity to the White House might have played a role in his hiring.\n\nThat brings us back to President Trump. Trump clearly feels that something untoward and perhaps illegal occurred regarding Hunter Biden in Ukraine and China. In regard to the former, he received information from attorney Rudy Giuliani raising questions about the firing of a prosecutor investigating the company where the younger Biden worked. So the question is, is it illegal for Trump to ask foreign leaders to look into it?\n\nThe answer to this question seems to almost certainly be no. In fact, the closest thing the Democrats can pin to the president is a vague campaign finance violation. Is it tacky? Does it violate norms? Yes, probably, but it is just as plausible that Trump wanted answers about family members in the Obama administration getting sweet deals from foreign governments as it is that he was trying to damage a potential political rival.\n\nAnd what if both things are true? What if Trump is genuinely concerned about corruption in our foreign affairs, and the fact that Joe Biden might be mixed up in it is a just a bonus? If there are cases, which there certainly are, when it is appropriate and legal for a president to urge foreign leaders to investigate potential wrongdoing by Americans, then the Democrats have to prove why in this case is wasn’t.\n\nTheir answer is that Joe Biden is running for president. Their entire argument for impeachment now rests on the idea that Biden’s candidacy makes him immune to such calls for scrutiny. But they will not and can not point to an actual law that Trump violated in the conversation. Rather, they make vague arguments about courting foreign interference in an election and potential campaign finance violations.\n\nToday Trump called the Democrats’ bluff. Now both sides have stipulated that Trump asked Zelensky to look into Biden, and that he may ask China to do the same. Democrats are free to impeach the president on this basis, even without pointing to a specific crime. The Senate is free, as is likely, to acquit the president, since there isn’t any crime.\n\nThen it will be left to the voters. The ball is in the Democrats’ court. Impeachment without a specific crime is a risky play, but they may have gone too far to un-ring this bell.", "description": "Today the president reiterated that he wants Ukraine and China to investigate Joe Biden. Democrats have not made clear why that is a crime.", "authors": ["David Marcus"], "top_image": "https://thefederalist.com/wp-content/uploads/2019/09/40932975713_9326d48817_k.jpg", "published_at": "2019-10-03"}