{"pub": "marketwatch", "url": "https://marketwatch.com/story/how-adding-1-to-your-saving-earning-and-investing-can-change-your-life-2019-10-18", "downloaded_at": "2019-10-19 11:01:39.375126+00:00", "title": "How adding 1% to your saving, earning and investing can change your life", "language": "en", "text": "In finances (and life) small steps can really add up. I have seen time and time again over my lifetime examples of small, often seemingly insignificant steps, adding up over time to make a huge impact. This is why I’m an advocate of making at least a small amount of progress on your goals each day — because they add up over time.\n\nThis column will focus on how something that seems like a trivial amount — a small 1% gain — can make a huge difference in your earning, saving, and investing.\n\nThe impact of 1% in your career\n\nThere’s no doubt about it: managing a career for maximum growth can have a huge financial payoff. In fact, the difference between someone working their career and a person who doesn’t can be millions of dollars.\n\nThe key to extra millions lies in getting higher than average salary increases. Some people complain that 4%, 5%, or 6% average annual income gains are unrealistic, so let’s just look at the power of 1% more.\n\nBut before we do that, I want to get a commitment from those who doubt. Do you think a person could squeak out just a 1% gain in raises over a career (assuming you would get 3% on average and now move to 4%) by taking the few, simple steps required to make the most of your career?\n\nIn other words, let’s say Jim is an average employee and he gets average raises of 3% a year. Sue puts in time and effort at managing her career — exceeding expectations, being likable, networking, proactively managing her career (including asking for raises, moving jobs when needed, etc.), and the like.\n\nDo you think it’s reasonable for Sue to average 4% raises a year? It seems like a no-brainer to me. In fact, her gains will probably be much higher. But today we’re just looking at that extra 1%. And given the effort she’s putting in it, it seems likely she could make it. What does that 1% do for Sue? Assuming she and Jim both start work at 22, they both work until 65, and they both start at annual salaries of $35,000 a year, here are their results if Jim averages 3% raises and Sue averages 4%:\n\n• Jim ends up making $121k at 65 and makes $3.0 million over the course of his career.\n\n• Sue ends up making $182k at 65 and makes $3.9 million over the course of her career.\n\nIn this case, the value of just that extra 1% is $900,000. Almost a million dollars.\n\nSue ends up making 30% more than Jim simply by averaging an extra 1% raise over the course of her career. And this seems entirely reasonable to do this, right? Of course, we’ve already agreed to that.\n\nHow do you get this extra 1%? It’s not that difficult. Follow my career improvement suggestions. These should most certainly get you an extra 1% a year — and will likely result in more.\n\nIt’s also worth noting that even though their salaries grew at different rates, both Sue and Jim each earned millions of dollars over their working careers. In other words, almost any career is worth millions of dollars. That’s why it is your most valuable financial asset. What else do you own that’s worth a few million? Another reason to take care of your career…but I digress.\n\nThe impact of 1% in your savings\n\nNow let’s look at the power of saving an extra 1%.\n\nLet’s say Sue wasn’t the career champion noted above, but more of a saving expert. Here are the financial stats we’ll begin with:\n\n• 22 years old\n\n• Earns starting salary of $35,000 a year\n\n• Gets average annual pay increases of 3%\n\n• Starts out saving 10% of income\n\n• Savings earns 7% a year\n\nFrom here, let’s look at a couple different scenarios.\n\nIn the first one, Sue saves 10% a year throughout her working career. Nothing more, nothing less. Under the above assumptions, she retires at 65 with a nest egg of $1.3 million. Not bad. But it could be more.\n\nLet’s bump that savings rate by 1% and see what happens.\n\nIf Sue saves 11% a year, she retires with almost $1.4 million, $100,000 more for only a fraction more saved. It’s not life-changing, but why not pocket an extra $100,000 for doing basically nothing? And if an extra $100,000 isn’t worth the effort for you, stay tuned. I have some ideas below to really make your finances sing.\n\nHow do you get this extra 1%? I’d suggest you focus on the best ways to save money. Certainly these can help you save at least 1% extra, probably more.\n\nThe impact of 1% in your investments\n\nNow let’s look at the impact of 1% on investments. We’ll take the same starting scenario as above with Sue’s finances (saving 10%). But this time, instead of earning 7% on her money, she earns 8%.\n\nHere are the results:\n\n• Investing 10% for 43 years at 7% yields $1.3 million.\n\n• Investing 10% for 43 years at 8% yields $1.7 million.\n\nNot bad, right? An extra $400k for an extra 1%. How do you get this extra 1%?\n\nWhen comes to investing it’s more about not shooting yourself in the foot. I’d personally suggest:\n\nNot buying individual stocks. You are not smarter than fund managers who have the time, talent, and resources to make great picks — and even they can’t earn more consistently. This is why most millionaires don’t focus their investing on individual stocks — they have tried them and in the vast majority of cases it turns out to be an investing mistake.\n\nAvoid market timing. Studies show that most people are their own worst enemies when trying to time the market. They inevitably sell at the bottom of a market and buy at the top. It’s better to be in for the long term, taking the punches of the drops but also enjoying the times the market flies high.\n\n• Cut expenses. Investing expenses — and there are a host of them — can kill any gains you might get. We’re talking about the power of 1% extra in this post, but when it comes to investing an extra 1% in costs can kill your returns over time.\n\nThese issues are some of the reasons I invest with index funds. They address all these issues and many more. If you want more specifics and a deeper review of index fund investing, check out “The Simple Path to Wealth” and “The Bogleheads’ Guide to Investing,” two of the best investing books out there.\n\nMaking the most of an extra 1%\n\nSo far, we’ve looked at an extra 1% from an earning, savings, and investing standpoint — and seen the impact of each individually. And the results have been pretty impressive for such a small set of incremental changes. That said, Sue has not made the most of her financial gains in a couple ways.\n\nFirst, she hasn’t combined their impacts. She’s only done one at a time in our examples. Second, she hasn’t pushed the power of 1% as much as she could in savings, where doing so could make a massive difference. (And let’s face it, with all the extra money she’s making at work, she can certainly afford to save more.)\n\nLet’s look at the power of 1% turned up a notch and see what would the results be. As you might imagine, the three factors work together in concert as follows:\n\n• The more Sue earns in her career, the more she can save.\n\n• The more Sue saves, the more she has to compound over time.\n\n• The more Sue earns on her investments, the faster compounding works.\n\nAgain, here’s the original scenario:\n\n• 22 years old\n\n• Earns starting salary of $35,000 a year\n\n• Gets average annual pay increases of 3%\n\n• Starts out saving 10% of income\n\n• Savings earns 7% a year\n\nAs a reminder, these stats gave her $1.3 million saved at the end of 43 years. Now here’s a ramped-up version of the above:\n\n• 22 years old\n\n• Earns starting salary of $35,000 a year\n\n• Gets average annual pay increases of 4%\n\n• Starts out saving 11% of income and adds 1% a year to this amount (12% in year 2, 13% in year 3, etc.) until it peaks out at 40%\n\n• Savings earns 8% a year\n\nDoing this she ends up with $4.9 million saved at the end of 43 years. Kind of magical, right? She’s not only making more, but as she does, she’s saving an increasing percentage of the pie. All this from a $35,000 starting salary, growing her income, increasing her savings rate annually, and time. It’s the power of 1% in all areas of her financial life and it makes a huge difference in her net worth.\n\nDoing even more\n\nThe amazing thing is that these results are just the tip of the financial iceberg. With a bit more pushing, Sue could make the numbers really silly. How could she improve upon these?\n\nA few thoughts:\n\n• Start at a higher salary. Negotiating the starting salary of your first job can make hundreds of thousands of dollars difference.\n\n• Get higher raises. Some people may think that 5%+ average raises are things of the past, but I don’t. There will always be more than enough compensation growth for good employees. These workers manage their careers intentionally, delivering above average value. This value then gets rewarded in extra pay. This is exactly what millionaires do to grow their incomes at higher rates.\n\n• Create a side hustle. A career isn’t the only way to add extra income — a side hustle is an awesome way to make more money. It’s so powerful that it can get you to financial independence within 10 years.\n\n• Start with a higher savings rate. Nothing says that 11% is the peak starting point for savings. You can begin with a much higher rate from the get-go.\n\n• Get matches. If Sue has a 401(k) company match, that would add to these numbers.\n\n• Keep saving past 40%. Many early retirees save much more than 40% of their income. Sue could do the same.\n\n• Higher returns. This is possible, so I’ll include it, but I’d say it’s not probable. Some would say the market has returned 10% over the long-term and Dave Ramsey would say 12%, but I feel comfortable with 8%. That said, if she did earn more than 8%, the results would be better.\n\nFor kicks, let’s run a scenario to show how crazy things can get. Let’s assume the following:\n\n• Sue’s age — 22 years old\n\n• Starts out earning $40,000 a year. She negotiates well from day one and begins higher than she would have without doing it.\n\n• Gets average annual pay increases of 5%. She asks for raises, changes companies, gets promoted, and negotiates more along the way.\n\n• Starts out saving 20% of income and adds 1% a year to this amount (21% in year 2, 22% in year 3, etc.) until it peaks out at 60%.\n\n• Gets a company match of 4.5% of her salary (a bit below the national average of 4.7%).\n\n• Adds in a side hustle in year five that earns $10k a year (which she also invests).\n\n• Savings earns 8% a year.\n\nAny guesses at how much she ends up with at 65?\n\nAlmost $13 million. It doesn’t even represent the top of what can happen (there is still room for improvement). But the numbers are so over the top that pushing them more almost transports us to the Twilight Zone. In the end, this is a powerful demonstration of what can be accomplished financially with simple but powerful moves over time.\n\nBy the way, she hits the following milestones:\n\n• $1 million in 19 years\n\n• $2 million in 25 years\n\n• $3 million in 29 years\n\n• $4 million in 31 years\n\n• $5 million in 34 years (rounding carries this to three years instead of two)\n\n• $6 million in 35 years\n\nSo she’s financially independent well before 65.\n\nDon’t fret if you’re older\n\nYou may be 20 years into a career and think this advice is not for you — that it only holds true for those at the beginning of their careers. I have a couple thoughts for you:\n\n• If you start taking the steps above now, no matter where you are in your finances, you will ultimately be better off than you would be without doing anything.\n\n• Sure, an extra 1% over 40 years is better than an extra 1% over 20 years. But an extra 1% over 20 years is better than nothing extra over 20 years.\n\nEven if you’re older and have messed up your finances so far, there’s still hope for you. You don’t need 40+ years to become wealthy. If you really set your mind to it and apply the principles above, you can have substantial wealth in 20 years — or even 15. So don’t say “it’s too late for me” if you’re 40 or 45 or even 50.\n\nAnd for those of you older than 50 and in financial trouble, if you put the above principles into action now, you’ll be much better off at retirement than you would be if you keep on doing what you’ve been doing up to this point.\n\nThis column originally appeared on ESI Money. It was republished with permission.", "description": "Small changes can make a big difference in your net worth.", "authors": ["John Esi Money"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT615_kid_sa_ZG_20191018102401.jpg", "published_at": "2019-10-18"}