{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/lockheed-34-billion-deal-478-more-f-35-stealth-fighters-2019-10", "downloaded_at": "2019-10-29 15:15:15.986798+00:00", "title": "The Pentagon and Lockheed Martin seal $34 billion deal for the delivery of 478 more F-35 stealth fighters", "language": "en", "text": "The Department of Defense and Lockheed Martin have finalized a $34 billion deal to deliver 478 additional F-35 Lightning II Joint Strike Fighters, military leaders announced at the Pentagon Tuesday morning.\n\nA Department of Defense contract memo released Monday revealed that Lockheed had been awarded $7 billion for the delivery of 114 additional F-35s.\n\nThat award is part of the $27 billion that has already been put on the table for around 370 aircraft as part of the larger F-35 deal with Lockheed. Another $7 billion for the roughly one hundred aircraft remaining will be awarded later.\n\nThe Department of Defense and contractor Lockheed Martin have finalized a $34 billion deal, one that has been in the works for years, to deliver hundreds more F-35 Lightning II Joint Strike Fighters, department officials announced Tuesday.\n\n\"The $34 billion agreement for F-35 low-rate initial production of lots 12-14 includes the delivery of 478 F-35 aircraft,\" Under Secretary of Defense for Acquisition and Sustainment Ellen Lord announced at the Pentagon Tuesday morning.\n\n\"This agreement represents our continued commitment to reduce F-35 costs aggressively, incentivize industry to meet required performance and deliver advanced capabilities to our warfighters at the best value to taxpayers,\" she added.\n\nThe deal is expected to see the unit cost for F-35s drop 12.7% in coming years.\n\nLord revealed that the F-35 program will reach the unit recurring flyaway (URF) cost per aircraft target of $80 million for US Air Force F-35As by lot 13, a delivery installment expected in 2021. The unit cost, the Pentagon revealed, will drop to $77.9 million by 2022.\n\nThe hundreds of aircraft included in this buy includes aircraft for all three services, as well as fighters for US partners and allies. The 478 aircraft will be delivered in installments of 149, 160, and 169 aircraft.\n\nAs for the unit breakdown, Lockheed will deliver 351 F-35As, 86 F-35Bs, and 41 F-35Cs, Lt. Gen. Eric T. Fick, F-35 program executive officer, revealed during Tuesday's press briefing.\n\nThe Department of Defense announced in a contract memo Monday afternoon that Lockheed had been awarded $7 billion for the delivery of 114 F-35s.\n\nThat specific buy is to include 48 F-35As for the Air Force, 20 F-35Bs for the Marine Corps, and nine F-35Cs for the Navy, a total of 77 fifth-generation stealth fighters to the US military. Additionally, this contract will see 15 F-35As go to Australia, 12 to Norway, and eight to Italy. The latter will also receive two F-35Bs.\n\nThe contract award announced Monday is one part of the larger $34 billion deal.\n\nAs part of this deal, the Pentagon has obligated roughly $27 billion over the past few years for around 370 aircraft. There are about 100 aircraft and around $7 billion remaining. Because the department does not yet have a budget, it has not made a contract award announcement for the final part of the deal with Lockheed.\n\nLord characterized the agreement with Lockheed Martin as a \"historic milestone for the F-35 program.\"", "description": "After years of negotiations, the Department of Defense and Lockheed Martin have finally hammered out a deal for hundreds more stealth fighters.", "authors": ["Ryan Pickrell"], "top_image": "https://image.businessinsider.com/5870071bf10a9a22008b7277?width=1200&format=jpeg", "published_at": "2019-10-29"}