{"pub": "hotair", "url": "https://hotair.com/archives/allahpundit/2019/09/19/mysterious-whistleblower-complaint-involving-trump-foreign-leader", "downloaded_at": "2019-09-20 02:27:17.994974+00:00", "title": "Is this what that mysterious whistleblower complaint involving Trump and a foreign leader is about?", "language": "en", "text": "Lots of buzz about this in political media this afternoon. But then, there were also many “bombshells” during the course of the Mueller investigation that caused a stir in political media and you know how those turned out.\n\nSpeculation about the troubling “promise” Trump may or may not have made to a foreign leader has naturally focused on Putin and Kim Jong Un. Did he promise Putin he’d make some startling international concession, like exiting NATO, in exchange for God knows what? Did he tell Kim that he’d withdraw U.S. troops from South Korea if Kim did X,Y, and Z? The mind reels. Journalist Laura Rozen flagged this passage from a story yesterday in the Independent, though, that may point in a different direction.\n\nNote that the story has nothing to do with the whistleblower complaint. It’s about Trump’s relations with the new president of Ukraine, Volodymyr Zelensky. But the timeline fits. And there’s been some odd media chatter about Trump and Ukraine lately.\n\n[T]here have been claims that Mr Trump had refused to meet Mr Zelensky after his election this year, and that US officials have warned this would continue to be the case unless the Ukrainian authorities reopened the Burisma files. The house committees’ chairs say they will scrutinise a telephone call between the US president and Mr Zelensky on 25 July, during which Mr Trump allegedly told the Ukrainian president to reopen the Biden investigation if he wanted to improve relations with the US. They claim that Kurt Volker, the US special representative for Ukraine, was told to intercede with President Zelensky by the White House, and they are looking into the activities of Rudy Giuliani, Mr Trump’s personal lawyer.\n\nThe whistleblower complaint landed on the inspector general’s desk on August 12. “The Biden investigation” refers to allegations that Joe Biden leaned on the Ukrainian government while he was VP to fire a prosecutor who just so happened to be looking into a company called Burisma, one of whose directors was Biden’s son, Hunter. That investigation was eventually shut down but Team Trump has taken an interest in seeing it reopened since at least May. Rudy Giuliani was slated to visit Ukraine to lobby for reopening the case that month but canceled his trip when the media noticed. Was the president using his lawyer to muscle a foreign power in order to generate dirt on his most likely 2020 opponent?\n\nA month later, Trump flatly told ABC News that he probably would accept dirt on an opponent from foreign sources. And Giuliani did finally end up meeting the Ukrainians in August to discuss the Biden case and whether any Ukrainian officials tried to damage Trump during the 2016 campaign by sharing dirt with the Democrats.\n\nAs I write this, no newspaper has claimed to know the substance of the whistleblower complaint or what the mystery call between Trump and the foreign leader was about. But whether they really don’t know or *do* know and are withholding the information right now are two different things. There may be natsec reasons not to report what they know, or it may be that they simply can’t nail down the story with sufficient sourcing yet. But WaPo published an editorial two weeks ago about Trump and Ukraine that took the unusual step of introducing some original reporting into the mix — a strange move for a feature in the opinion section.\n\n[W]e’re reliably told that the president has a second and more venal agenda: He is attempting to force Mr. Zelensky to intervene in the 2020 U.S. presidential election by launching an investigation of the leading Democratic candidate, Joe Biden. Mr. Trump is not just soliciting Ukraine’s help with his presidential campaign; he is using U.S. military aid the country desperately needs in an attempt to extort it.\n\n“We’re reliably told”? Who told them? And why wasn’t that information reliable enough for a news story?\n\nMaybe this was WaPo’s way of teasing what it knew about the whistleblower complaint, tucking it into an editorial while it remains technically unsubstantiated so that it doesn’t have to stake the credibility of the news division on it just yet. If so, the “promise” Trump may have made to the as yet unnamed foreign leader could be this: “Zelensky, if you reopen the Biden investigation and generate dirt on him for me, I promise that you’ll finally get that military aid we’ve pledged.” Lo and behold, after a long delay, just one week ago Ukraine did get the $250 million in U.S. military aid it had been waiting for. Not only that, according to Zelensky it’s getting an extra $140 million. Why? Unclear right now.\n\nThere’s one other thing. The Times reported today, cryptically, that the whistleblower complaint was “related to a series of actions that go beyond any single discussion with a foreign leader, according to interviews on Thursday.” It’s not just the chat between Trump and the mystery president, it’s other stuff too. That would also potentially fit Ukraine and Zelensky as the subject — there’s military aid involved, there’s Giuliani leaning on them over the Biden case, there’s the angle involving 2016 dirt. As I say, Trump’s team has showed interest in the Biden matter since at least May, shortly after Grandpa Joe entered the presidential race. There’s more to this than just a phone call, if in fact Zelensky is the leader in question.\n\nIt’s all just speculation. But if it turns out that Trump tried to extort a foreign leader into damaging his 2020 opponent and used taxpayer money to do it, yeah, he’s going to be impeached. Not even Pelosi will be able to stop that train.\n\nIf this actually happened, @realDonaldTrump should be impeached and removed from office without delay. https://t.co/WkiA3yXPEx — George Conway (@gtconway3d) September 19, 2019\n\nYou can already anticipate the response: “Why wasn’t Biden impeached when he leaned on the Ukrainians over the prosecutor sniffing around his son’s business?” We may end up spending the better part of next year on that.\n\nThere’s an interesting legal question swirling around all this, as tends to happen with Trump’s uses of presidential power. Does Congress have the constitutional authority to perform oversight of the president on national security? There’s a secondary legal question of whether they have *statutory* authority to perform oversight in this case: According to the Times, the acting DNI and the inspector general have a difference of opinion on the matter, with the IG claiming that the statute says the whistleblower complaint must be handed to Congress and the DNI claiming that Trump technically isn’t part of the “intelligence community,” in which case no, it doesn’t. (Adam Schiff is threatening to sue.)\n\nBut there’s a deeper, and frightening, question of whether Congress is entitled to the complaint under the Constitution even if the courts decide that the IG is right about what the statute says. Read this short but interesting Twitter thread from lawyer Jack Goldsmith who argues … no, Congress shouldn’t be entitled to know what the president is saying to foreign leaders even if he’s abusing his foreign-policy power. “Putting it brutally,” he writes, “Article II gives the president the authority to do, and say, and pledge, awful things in the secret conduct of U.S. foreign policy. That is a very dangerous discretion, to be sure, but has long been thought worth it on balance.” The president gets to do what he wants on FoPo and we must simply trust him and hope for the best — unless, of course, someone in the executive branch leaks his communications and accepts the criminal consequences. That person would go to prison. But Congress would have the material it needs, potentially, to impeach.\n\nUpdate: If only I’d waited a few hours to write this post I could have saved myself some work. WaPo is reporting this evening that, yes, the whistleblower complaint is about Ukraine.", "description": "Speculation.", "authors": ["John Sexton", "Ed Morrissey", "Hot Air Staff"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/tt.jpg", "published_at": "2019-09-19"}