{"pub": "washingtonpost", "title": "How to teach a child to reset after a bad day (without fixing their problems for them)", "url": "https://washingtonpost.com/lifestyle/on-parenting/how-to-teach-a-child-to-reset-after-a-bad-day-without-fixing-their-problems-for-them/2019/08/22/8761489a-b21e-11e9-8949-5f36ff92706e_story.html", "language": "en", "published_at": "2019-08-22", "downloaded_at": "2019-09-02 07:08:32.592411+00:00", "text": "Did you ever have one of those days where everything is going just fine, and then your child comes through the door upset, frustrated, angry and all your fine-ness slips down the drain?\n\nMaybe you want to fix it right away. You tell your little girl everything will be okay, or you tell your tween how to handle a friend kerfuffle, or you commiserate with your teen who’s complaining that his teacher hates him.\n\nAs much as you may ache to make it all better, that’s not the way to go.\n\n“Parents are taking so much responsibility for their children’s mood and spirit that it feels like it’s your job to reset as soon as possible,” says Wendy Mogel, clinical psychologist and the author of “The Blessing of a Skinned Knee: Raising Self-Reliant Children” and “Voice Lessons for Parents.” “It deprives them of the opportunity to be crabby and cross when they finish school or at the end of a day of camp.” In other words, when we try to fix everything for our children, they don’t learn how to work through their problems.\n\nPart of the reason kids may be upset when they get home is that home is “the soft landing,” Mogel says. It’s the place they feel comfortable enough to get it all out. “They followed all those rules all day. They were polite to all the teachers. It’s exhausting.”\n\nAnd then they come home, she says, and their parents “are studying their posture, facial expression, etcetera, to reassure themselves that this is a good day. This is, in some ways, an intrusion of their natural recovery time.”\n\nSometimes, says Robbye Fox, an independent education consultant and certified parent educator with the Parent Encouragement Program (PEP), “the child may just want to vent. If we rush in too quickly, we may make the issue seem bigger than it is, or that they aren’t capable” of handling it.\n\nShe suggests parents practice “reflective listening.” So, for instance, a child comes home and is frustrated after a tough day in math class. The parent then says, “Wow, it sounds like math was really overwhelming today.” Then the child says something else, and the parent reflects their feelings back to them. “Each time they feel heard, it brings the emotion down and they can see it for what it is,” she says.\n\n“It’s hard to see any child angry and frustrated,” says Emory Luce Baldwin, a marriage and family therapist and PEP certified parent educator. But you can remind them, she says, that the best feeling in the world doesn’t last forever, and neither does the worst one.\n\n“We don’t want to preach or teach to our kids, particularly when they are upset,” she says. You can say that you are sorry they feel so bad right now or that you can understand that the day was a really tough day.\n\n“Show that you’re affirming that this was today, this is now. Don’t use a global ‘I’m sorry you’re so upset’ or ‘It’s terrible that you hate school,’ ” Baldwin advises. “Respond in a way that helps kids hear this isn’t a permanent thing.”\n\nWhen her 12- or 8-year-old is struggling, Cara Schaaf Whitmarsh reminds them that “it’s okay to have a bad day,” and then they talk about how to make “tomorrow a good day” by focusing on the things that upset them. She wrote in a conversation via Facebook: “We acknowledge their feelings (anger, frustration, sadness, jealousy) and then make a game plan to help them deal with it.”\n\nAlong those lines, Baldwin suggests we remind our children they can do things to make themselves feel better. Sometimes, when children (or, let’s face it, adults) are upset or down, it’s hard to remember there are joyful, positive things in our lives. She suggests saying, “I’ve noticed you like to play with the dog when you feel like this, or put that music on that you love.”\n\nThere are times when an issue is larger and requires a bigger plan, conversations with teachers and more. But many times, a bad day is just that: a bad day.\n\n“Just helping kids connect with what they can do to feel better” is helpful, Baldwin says.\n\nA parent’s role in this is to help a child build problem-solving skills. Fox says she is on a parent advisory board at a college. She often hears about students who may have taken 15 Advanced Placement courses, but they don’t know how to navigate an airport. “They have no problem-solving skills or resilience.”\n\nSo when your child forgets his lunch and it seems like a huge deal to him, your role is to help him rebound from that, Fox says, not just fix it or slough it off. “It’s like building blocks to the next bigger problem.”", "description": "They need to learn to push through, but parents can help.", "authors": ["Amy Joyce", "Writer", "Editor For On Parenting", "Amy Joyce Is A Writer", "Editor For On Parenting."], "top_image": "https://www.washingtonpost.com/resizer/ajlwvgskiwr4IElyA7CMEF44ZSE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OOXBCWVTCAI6TCKJL43P7ETQNY.jpg"}