{"pub": "dailybeast", "url": "https://thedailybeast.com/jojo-rabbit-review-taika-waititis-nazi-satire-tries-and-fails-to-find-the-funny-in-fascism", "downloaded_at": "2019-10-19 10:44:00.455841+00:00", "title": "‘Jojo Rabbit’ Review: Taika Waititi’s Nazi Satire Tries and Fails to Find the Funny in Fascism", "language": "en", "text": "Jojo Rabbit is the story of a wannabe-Hitler Youth cadet in World War II Germany whose imaginary best friend is none other than that charming, irascible rascal himself, Adolf Hitler! As embodied by writer/director Taika Waititi, the Führer is a hate-spewing clown cast in a Shaggy-by-way-of-Looney Tunes mold, all childish exaggerations and cartoonish anti-Semitism, encouraging and abetting his young creator’s desire to be an ideal Aryan adolescent (as well as sparking a national craze akin to Beatlemania). Far from Charlie Chaplin’s Hitler proxy in 1940’s The Great Dictator, he’s a lovable sort of genocidal monster, the kind of goofy caricature you’re not meant to derisively laugh at so much as laugh with as he accompanies his young charge on his quest to be the very best Nazi he can be.\n\nThis, you’ll no doubt realize, is meant to be ironic. Unfortunately, it’s irony of a bad, unfunny sort.\n\nBafflingly bestowed with the People’s Choice Award at this year’s Toronto International Film Festival, Jojo Rabbit isn’t just a misfire for its creator (whose prior What We Do in the Shadows and Thor: Ragnarok were superior comedic efforts); it’s an eye-opening miscalculation that, premiering Friday, Oct. 18 amidst white nationalism’s rise throughout Europe and America, couldn’t arrive at a worse time. Waititi is, I’m sure, opposed to fascism, and his latest’s message is, in the end, about how the blackest hearts and minds can be transformed by face-to-face communication with people who are different from us. No matter the heartwarming uplift it eventually dispenses, however, the film is an ill-advised disaster that thinks it’s pulling a provocative bait-and-switch, even as it makes a series of missteps that validate the criticisms it was courting from the start.\n\nThe incongruity of a mainstream comedy about Nazis is the entire point of Jojo Rabbit, which thinks it can get away with deeply humanizing its characters because, in the end, those figures will see the error of their ways and, thus, prove examples of how kindness and compassion can prevail over intolerance. While that’s certainly a fine message in the abstract, the means by which Waititi’s film goes about it is disingenuous to the point of repugnant, and thus destroys any humor or heart that might have materialized from this tale (adapted from Christine Leunens’ novel Caging Skies). Even Life is Beautiful, Roberto Benigni’s 1997 Oscar-winner, knew better than to mine comedy and pathos from the perpetrators of the Holocaust, which is exactly what Waititi does here, via a collection of colorful Nazis that—save for Stephen Merchant’s Gestapo guard, and a couple of early bullies—are nothing short of likable, entertaining and inherently decent.\n\nThat begins with Jojo (Roman Griffin Davis), a 10-year-old who just can’t wait to be an active member of the Third Reich. There’s nothing that excites Jojo more than the opportunity to show his boot-stomping stuff at a Hitler Youth retreat, and with his trusty make-believe Hitler (Waititi) by his side, he’s super-enthused about getting in the swing of Jew-killing things. Whether pumping himself up in the mirror or hanging out with his mates, Jojo talks a big bigoted game, although he turns out to be, deep down, a good person—something we first learn when he balks at his teenage superiors’ orders to kill a rabbit (hence his nickname, shorthand for “coward”). If that weren’t enough to make us emotionally side with adorably lively Jojo, his subsequent act to get back in his comrades’ good graces does: running and leaping in slow-motion through the woods alongside fake Hitler, and grabbing a grenade from the hands of Captain Klenzendorf (Sam Rockwell) and throwing it like a pro.\n\n“ ‘Jojo Rabbit’ is, in the end, about how the blackest hearts and minds can be transformed by face-to-face communication with people who are different from us. ”\n\nAlas, the resultant blast leaves Jojo’s cherubic face scarred and his leg injured. Oh no, his Aryan perfection has been marred! This troubles Jojo but not his mom Rosie (Scarlett Johansson), whom Jojo Rabbit depicts as angelic. That’s in keeping with its characterizations of everyone involved in this mess, be it pompous and absurd Klenzendorf, “crazy” Fraulein Rahm (Rebel Wilson), or Jojo’s upbeat best friend Yorki (Archie Yates), all of whom are portrayed—by Waititi’s script, and by the game cast—as hilarious misfits who treat their Final Solution duties as business as usual, and who, at every meaningful turn, choose to do the right thing. Who knew SS stormtroopers were so fun, silly and secretly caring and considerate?\n\nJojo Rabbit’s story really kicks into gear once Jojo discovers that his mother has been hiding a Jewish girl named Elsa (Thomasin McKenzie) in their apartment’s clandestine crawlspace. This rocks Jojo’s Jews-are-horned-devils world, but because Elsa is nice and cute, and he’s nice and cute, well, you can guess that they soon strike up an aww-shucks quasi-romantic relationship. This development is Anne Frank wish-fulfillment of the grossest kind, and Waititi milks it for all its worth, having Jojo pen her phony love letters from her fiancé (since Jojo adores her! And her fiancé is really dead because of the Nazis!), write a book about the “evils” of Jews (that really illustrates the idiocy of anti-Semitic stereotypes), and do whatever it takes to protect her. Waititi’s Hitler, predictably, disapproves of Jojo’s behavior (because he’s such an incorrigible anti-Semite, haha!). But the film certainly doesn’t, segueing in its latter portions from treating Nazis as endearingly amusing oddballs to painting them as benevolent souls who, after getting to know Jews, sacrifice everything to save them.\n\nIt goes without saying that this is horseshit of the highest order. But worse is that Waititi normalizes his white nationalists by placing them front and center in a saga that, in most respects, hews to a traditional modern comedic formula. Jojo’s tale isn’t very different from that of Ron Burgundy or Ricky Bobby; like them, he (and everyone around him) is an over-the-top buffoon who’s defined by his tasteless antics, and who ultimately has to realize the foolishness of his opinions and actions. The latter comes during a third act that has our protagonist change for the better, thus demonstrating that the very inappropriate material we were laughing at earlier was “bad.” In spirit, Jojo Rabbit is really just a pint-sized Wedding Crashers with more swastikas.\n\nThe problem with that, of course, is that Nazis aren’t the same as promiscuous American thirtysomethings, or funny newscasters, or race car drivers, and equating them indicates a fundamental misunderstanding—and willful denial and warping—of history. Jojo Rabbit knows what it’s doing, and thinks it’s oh-so-devilishly clever for making you care about its cretinous subjects, whose ridiculousness is designed to invite empathy rather than scorn. That alone makes it ill-advised (not to mention mirthless). But the fact that it does this in service of a treacly “anti-hate” sermon—as if we needed to be reminded, by Nazis themselves no less, that mass-murdering Jews is uncool!—only compounds its wrong-headedness. Irony may not be dead, but the brand peddled by Jojo Rabbit is certainly DOA.", "description": "Save for a handful of its Gestapo caricatures, the Nazis in writer-director Taika Waititi’s latest are nothing short of likable, entertaining and inherently decent.", "authors": ["Nick Schager"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2700,w_4800,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1571437822/191018-Schager-Jojo-Rabbit_1_ze4m8z", "published_at": "2019-10-19"}