{"pub": "cbs", "url": "https://cbsnews.com/news/snakehead-fish-georgia-tells-anglers-to-kill-invasive-fish-that-can-breathe-air-and-survive-for-days-on-land", "downloaded_at": "2019-10-11 19:56:21.915019+00:00", "title": "After fish that survives on land is found, Georgia tells anglers: Kill them immediately", "language": "en", "text": "Lawrenceville, Ga. — Georgia's Department of Natural Resources has a message for anglers: If you catch a northern snakehead, kill it immediately. Northern snakeheads are invasive fish that can breathe air and survive for days on land.\n\nAn angler recently reported catching one in a private pond in Gwinnett County.\n\nIf you find a northern snakehead in Georgia, kill it immediately and contact a DNR Regional Office. https://t.co/dbxWM0gaZQ — Georgia DNR Wildlife (@GeorgiaWild) October 10, 2019\n\nHow it got there is a mystery. State wildlife officials said in a press release it's the first time the species has been confirmed in Georgia waters. It's been found in 14 other states.\n\nSnakeheads are native to Asia. They're long, thin and up to 3 feet long, colored blotchy brown. Their dorsal fins stretch along the entire back.\n\nOfficials urge anglers who catch one to do the following, according to Georgia's Department of Natural Resources:\n\nDO NOT RELEASE IT. Kill it immediately and freeze it. They can survive on land. If possible, take pictures of the fish. Include close ups of its mouth, fins and tail. Note where it was caught like the waterbody, landmarks or GPS coordinates. Immediately report it to your regional Georgia DNR Wildlife Resources Division Fisheries Office.\n\nA species is considered invasive when it moves into an ecosystem that has not evolved to control it. Once a species gains a foothold in territory without its natural predators, it can multiply rapidly. CBSN Originals explored the growing problem of invasive species in the documentary, \"Burmese Python Invasion: Fighting Invasive Species\" – watch in the video player below:", "description": "Georgia's Department of Natural Resources has a message for anglers: If you catch a northern snakehead, kill it immediately", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/11/c20fc494-2b66-4ee7-a7aa-3ae9994b6fdd/thumbnail/1200x630/3dda5a0b38aa7d0f7013225c836333b1/snakehead.png", "published_at": "2019-10-11"}