{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/royal-family-official-account-just-145600724.html", "downloaded_at": "2019-10-23 16:43:53.087174+00:00", "title": "The Royal Family’s Official Account Just Liked a Tweet Shading Meghan Markle Trolls", "language": "en", "text": "From Town & Country\n\nThe royal family’s official Twitter account just Liked a tweet shading Meghan Markle trolls.\n\nMeghan recently opened up about how hard it is to have a newborn and be a newlywed while being in the spotlight of British tabloids.\n\nGrab a cup, because the royal family's official Twitter account may have just thrown some shade on the Meghan Markle trolls.\n\nIn case you aren’t caught up, ever since Prince Harry and Meghan Markle started dating, the British tabloids have been all up in their business and things have turned pretty mean. It’s become a huge problem, and it even prompted Harry to file lawsuits against some major publishers. And just last week, Meghan opened up about how difficult it’s been since she joined the royal family, and the video is heartbreaking. She said:\n\n“Any woman, especially when they’re pregnant, you’re really vulnerable, and so that was made really challenging. And then when you have a newborn, you know. And especially as a woman, it’s a lot. So you add this on top of just trying to be a new mom or trying to be a newlywed. It’s, um…yeah.”\n\n\n\n\n\nITV's @tombradby spoke to Meghan as he gained exclusive access to the royal couple as they toured Africa for 10 days with their son Archie.\n\n\n\nThe documentary, Harry & Meghan: An African Journey, airs on Sunday at 9pm on @ITV #HarryandMeghan https://t.co/Uy21iE6ozJ pic.twitter.com/XYlHVytiHF\n\n\n\n— ITV News (@itvnews) October 18, 2019\n\n\n\n\n\nOkay, knowing all this, you need to witness how the royal family shaded all those trolls. If you check out the official Twitter account’s Liked tweets, you can see they Liked a post from October 12 that praised Meghan for celebrating “forces for change” and being one herself. The Twitter user, named @TudorChick1501, aka “Anne Boleyn,” wrote:\n\n“These anti- #MeghanMarkle trolls are all the same: they pine for ‘the good old days.’ She was genius to title her Vogue issue ‘Forces for Change.’ We are witnessing a seismic shift in power and culture, and her haters are furious and terrified. Oh well. Get used to it.”\n\nView photos Photo credit: Twitter More\n\nView photos Photo credit: Twitter More\n\nView photos Photo credit: Twitter More\n\nSo, yeah, that’s apparently what the royal fam thinks about that!\n\nYou Might Also Like", "description": "The Twitter account \"liked\" a post that praised Meghan for being a force of change.", "authors": ["Shannon Barbour"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Dc6aS8fPCSnTydcRDLvPHQ--~B/aD03MjA7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/town_country_721/f346480f73a495cf34a292f590605bda", "published_at": "2019-10-23"}