{"pub": "cnbc", "url": "https://cnbc.com/2019/09/08/saudi-arabia-names-prince-abdulaziz-as-new-energy-minister.html", "downloaded_at": "2019-09-08 11:39:58.576509+00:00", "title": "Saudi Arabia names Prince Abdulaziz as new energy minister, removing Khalid al Falih", "language": "en", "text": "A worker stands at a pipeline, watching a flare stack at the Saudi Aramco oil field complex facilities in Shaybah, Saudi Arabia.\n\nSaudi Arabia has named Prince Abdulaziz bin Salman, a son of the king, as energy minister, replacing Khalid al-Falih, state news agency SPA reported on Sunday, citing a royal decree.\n\nThe appointment represents the first time a member of the ruling Al Saud family has held the energy minister post in the world's top oil exporter.\n\nPrince Abdulaziz is a longstanding member of the No. 1 crude exporter's delegation to the Organisation of the Petroleum Exporting Countries (OPEC) with decades of experience in the oil sector.\n\nAs a veteran of OPEC policy-making, Prince Abdulaziz is not expected to change the kingdom's oil policy, since he helped negotiate the current agreement between OPEC and non-OPEC countries to cut global crude supply to support prices and balance the market, analysts say.\n\nIn 2017, he was named Minister of State for Energy Affairs, and has worked closely with previous oil minister Ali al-Naimi as his deputy for years.\n\nSome industry insiders say the prince's lengthy experience has overcome what has always been seen as the impossibility of appointing a royal to the post of energy minister in Saudi Arabia.\n\nConventional thinking has been that the ruling Al Saud family has viewed the oil portfolio as so important that giving it to a prince might upset the dynasty's delicate balance of power and risk making oil policy hostage to princely politicking, Saudi sources and diplomats say.\n\nSaudi Arabia has had five oil ministers since 1960, and none of them has been a royal.\n\nLast month, Saudi Arabia created a ministry for industry and mineral resources, separating it from the kingdom's colossal energy ministry.\n\nBefore the separation decision, Falih had overseen more than half the Saudi economy through the super-ministry, which was created in 2016 to help streamline new reforms.\n\nLast week, Falih was also removed from his post as chairman of state oil giant Aramco, and Yasser al-Rumayyan, who heads the sovereign wealth fund PIF, was named as the new chairman.\n\nSaudi Arabia has been pumping less than 10 million barrels per day for most of 2019, below its OPEC output target. Falih has helped broker the deal with non-OPEC producers led by Russia, emerging as the main face of OPEC and the kingdom's oil diplomacy over the past three years.", "description": "", "authors": [], "top_image": "https://image.cnbcfm.com/api/v1/image/105514007-1539836946810gettyimages-1052343338.jpeg?v=1545616451", "published_at": "2019-09-08"}