{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/harrowing-last-letter-iraq-war-20566594", "downloaded_at": "2019-10-13 00:24:39.382819+00:00", "title": "Harrowing last letter of Iraq war hero before he took his life in PTSD despair", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA former soldier driven to despair by post-traumatic stress wrote a heartbreaking letter days before killing himself.\n\nDave Jukes’s words were: “I hate my life and wish it could end so I didn’t have to hurt the ones I love.”\n\nHis widow Jo, 47, released the letter to give people a better understanding of post-traumatic stress disorder.\n\nYesterday she said: “It shows the battle he was having between the good man and the person he had turned into.”\n\nHer husband began: \"I’m David (Dave). I’m 49-years-old but feel like 69.\n\n“I used to be a nice and caring guy that would do anything for anyone.\n\n(Image: Roland Leon/Sunday Mirror)\n\n(Image: Sunday Mirror)\n\n“I’ve tried so many times to take my life, but for some reason always pulled through (why).\n\n“I don’t know how to be a good husband/Dad, when that’s all I want.”\n\nThe former Staffordshire Regiment soldier served in Afghanistan, Iraq and Bosnia and was diagnosed with PTSD in 2006.\n\nHe suffered violent mood swings, flashbacks, nightmares and ­survivors’ guilt and spent years self-medicating with drugs and alcohol.\n\nShortly before his death Jo took out a court order to ban him from the family home in Birmingham after he smashed the place up.\n\nHis letter goes on: “For many years now something went wrong, really wrong and I never saw it, or should I say I chose not to see it.\n\n(Image: Sunday Mirror)\n\n“I am labelled with PTSD and over the last few years I’ve become a nasty person. All I do is take, take, take and give nothing back, which is wrong.\n\n“I am the only person in this house that is always right, but I know that’s not the case. I hurt the people who mean the most to me and I don’t care.\n\n“My family deserve more and better things than they have now. I have no idea why they are still here. All the help I have ever got is because my wife has got it for me. I have no idea why she does it, but she does.\n\n“If I have to tell the truth I’m so scared of getting help as I think I have failed. I have done more things than most people so I should be proud not feel like I have failed.\n\n“I find it so hard when someone tells me that I’m wrong but I have to try to understand I’m not always right, which is very hard.\n\n“I really want treatment, but it scares me so much it’s unreal. I don’t want to face the truth but I know I have to beat this to be the man my family deserve.\n\n“But how do I defeat the thoughts in my head about death and ­everyone is against me? Anything goes wrong in my life and that’s the first thing I think of. I’m a good guy at heart but can switch so fast and I don’t even know I’m doing it.\n\n“I have so much to offer, but no idea how to show it or do it.\n\n“It’s not nice to know I hurt the ones that love and care about me (that really hurts me). “I just hope I can cope with whatever ­treatment they offer me, as this life is s***.\n\n“It pains me to see what I’ve done in the past. I want to go out and not have earphones in, just so that I feel safe.\n\n“But I will beat this with the right help and have the best family support as well.”\n\n(Image: Roland Leon/Sunday Mirror)\n\nA week after signing the letter to a therapist he was found hanged on October 9 last year.\n\nMum-of-two Jo, a teacher, released the note on the first anniversary as part of Mental Health Awareness Week.\n\nThe loss of her husband and years of living with a mentally ill veteran took a terrible toll and last month she was diagnosed with PTSD.\n\nMore than q00 ­veterans and serving personnel have taken their lives since January last year.\n\nThe Sunday People’s Save Our Soldiers ­campaign is calling for a radical overhaul of mental health treatment for ­soldiers and veterans.", "description": "EXCLUSIVE: The Sunday People is demanding better mental health treatment for soldiers and veterans", "authors": ["Sean Rayment", "Image", "Sunday Mirror", "Roland Leon Sunday Mirror"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20566123.ece/ALTERNATES/s1200/1_RLP_MSM_171018_PTSD_15JPG.jpg", "published_at": "2019-10-12"}