{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/satya-nadella-says-stopping-microsofts-research-in-china-would-hurt-2019-10", "downloaded_at": "2019-10-07 12:21:08.502374+00:00", "title": "Microsoft CEO Satya Nadella says stopping the firm's controversial research in China would hurt", "language": "en", "text": "Microsoft CEO Satya Nadella has said halting the firm's research in China would \"hurt more\" than it helped.\n\nNadella was speaking to BBC News about Microsoft's work in the world's most populous country.\n\nSome observers have claimed Microsoft's work in China on artificial intelligence could be used for oppressive purposes, while others have said the work puts US cybersecurity at risk.\n\nVisit Business Insider's homepage for more stories.\n\nMicrosoft CEO Satya Nadella has said halting the firm's research in China would \"hurt more\" than it resolved, despite concerns around cybersecurity and human rights.\n\nIn an interview with BBC News published on Thursday, Nadella discussed Microsoft's research in China, and emphasized what he called the \"open\" nature of his firm's research.\n\nHe said: \"A lot of AI research happens in the open, and the world benefits from knowledge being open. That to me is been what's been true since the Renaissance and the scientific revolution. Therefore, I think, for us to say that we will put barriers on it may in fact hurt more than improve the situation everywhere.\"\n\nNadella's remarks come amid growing US concern about American businesses having any ties to China, thanks to worries about national security and IP theft.\n\nMicrosoft's main Chinese research centre in Beijing is its largest outside the US with over 200 scientists.\n\nIn April, the Financial Times reported that Microsoft was working with researchers at the National University of Defense Technology in Changsha, China. In the same report, Republican Senator Ted Cruz told the FT that \"American companies need to understand that doing business in China carries significant and deepening risk.\"\n\n\"In addition to being targeted by the Chinese Communist party for espionage, American companies are increasingly at risk of boosting the Chinese Communist party's human rights atrocities,\" Cruz added.\n\nRead more: A futuristic Chinese TikTok video shows a woman paying for vending machine items with no money or card — just her face\n\nWhile Nadella acknowledged the need for \"an equilibrium [between China and the US]\" he said we live in \"an interdependent world.\"\n\n\"That doesn't mean that any country, such as the US, doesn't have real national security issues and concerns,\" he continued. \"They have mechanisms for that, and they will exercise them. It's the same with China, too.\"\n\nFacial recognition technology is widely used in China across a number of domains. Franck Boston on Shutterstock\n\nLast week, China's IT ministry announced that anyone applying for mobile and internet services must have their face scanned. Discussing the possibility that Microsoft-developed AI could eventually be used to oppress Chinese citizens, especially through facial recognition schemes, Nadella insisted Microsoft controls who uses its tech.\n\n\"We do have control on who gets to use our technology,\" he said. \"And we do have principles. Beyond how we build it, how people use it is something that we control through Terms of Use. And we are constantly evolving the terms of use.\n\n\"We also recognise whether it's in the United States, whether it's in China, whether it's in the United Kingdom, they will all have their own legislative processes on what they accept or don't accept, and we will abide by them.\"", "description": "Nadella discussed Microsoft's research in China, and emphasized what he called the \"open\" nature of his firm's research.", "authors": ["Charlie Wood"], "top_image": "https://image.businessinsider.com/5d9b045eb151022dd770af1f?width=1200&format=jpeg", "published_at": "2019-10-07"}