{"pub": "townhall", "url": "https://finance.townhall.com/columnists/charlespayne/2019/10/16/strong-earnings-are-the-magic-elixir-the-stock-market-needed-n2554832", "downloaded_at": "2019-10-16 20:39:27.431283+00:00", "title": "Strong Earnings Are The Magic Elixir The Stock Market Needed", "language": "en", "text": "All the major indices were higher yesterday, with the NASDAQ Composite and Russell 2000 enjoying the largest gain. The market breadth was the best it’s been in some time with three times the up volume than down volume on the NYSE and the NASDAQ.\n\nAlthough 2,262 advancers dwarfed, and there were 881 decliners, there are more new lows than new highs (72 to 66) on the NASDAQ.\n\nStrong Medicine\n\nIt turns out strong earnings is the magic elixir it has always been going back to the beginning of the stock market. That medicine made Health Care the top-performing sector yesterday, powered by earnings results from Johnson & Johnson (JNJ) and United Health (UNH).\n\nS&P 500 Index +1.00% Communication Services (XLC) +1.71% Consumer Discretionary (XLY) +0.88% Consumer Staples (XLP) -0.43% Energy (XLE) +0.41% Financials (XLF) +1.44% Health Care (XLV) +1.82% Industrials (XLI) +0.81% Materials (XLB) +0.70% Real Estate (XLRE) +0.08% Technology (XLK) +1.10% Utilities (XLU) -0.31%\n\nHealth Care could get a nice boost today after reports surfaced last night that sent shares of drug distributors surging in after-hours trading:\n\nMcKesson (MCK): +7.1%\n\nAmerisourceBergen (ABC): +7.5%\n\nCardinal Health (CAH): +4.9%\n\nApparently, an agreement is close to settling lawsuits brought by state and local governments accused of fueling the opioid epidemic. The stocks popped because this would mean closure, but it’s also because the reported terms of $18 billion paid out over 18 years isn’t a major hit to their bank accounts. Note: there is also talk Johnson & Johnson could be a part of this settlement.\n\nThe Health Care sector has been dogged by political pressure and stodgy drug pipelines at major companies, but underlying stocks could rally by clearing two hurdles.\n\n92.5 & 94.5\n\nConsumers Sleeping like Babies & Flying the Friendly Skies\n\nAfter the close, Sleep Number posted record revenue and earnings that beat the street.\n\nRevenue: $475 million (consensus $462 million)\n\nEarnings: $0.94 (consensus $0.79)\n\nComp-store sales: +10%\n\nUnited Airlines (UAL) posted strong results and raised guidance from the prior range.\n\nPortfolio Approach\n\nCommunication Services Consumer Discretionary Consumer Staples 1 3 2 Energy Financials Healthcare 1 2 2 Industrial Materials Real Estate 3 2 1 Technology Utilities Cash 3 0 0\n\nToday's Session", "description": "All the major indices were higher yesterday, with the NASDAQ .10/16/2019 16:39:45PM EST.", "authors": ["Charles Payne", "Matt Vespa", "Timothy Meads", "Bronson Stocking", "Cortney O'Brien", "Julio Rosas"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/361/961af30f-4ed8-4db3-994c-0af3726c6edf.png", "published_at": "2019-10-16"}