{"pub": "reuters", "url": "https://reuters.com/article/us-usa-trump-whistleblower-arrests/two-men-linked-to-trumps-lawyer-arrested-on-campaign-finance-violations-idUSKBN1WP218", "downloaded_at": "2019-10-10 15:34:53.813586+00:00", "title": "Two men linked to Trump's lawyer arrested on campaign-finance violations", "language": "en", "text": "WASHINGTON (Reuters) - Two Florida businessmen associated with U.S. President Donald Trump’s personal lawyer Rudy Giuliani have been arrested over violations of campaign finance laws, a spokesman for the Manhattan U.S. Attorney’s office said on Thursday.\n\nFILE PHOTO: U.S. President Trump's personal lawyer Rudy Giuliani has coffee with Ukrainian-American businessman Lev Parnas at the Trump International Hotel in Washington, U.S. September 20, 2019. REUTERS/Aram Roston/File Photo\n\nThe businessmen, Lev Parnas and Igor Fruman, were arrested in connection with a New York case involving campaign finance laws, a spokesman for the U.S. Attorney’s Office in Manhattan said.\n\nThe two men had been planning to fly to Vienna on Wednesday night, according to a source familiar with the matter.\n\nParnas and Fruman were expected to appear in a federal court in Virginia later on Thursday, the Wall Street Journal reported, citing people familiar with the matter.\n\nParnas and Fruman conspired to “funnel foreign money to candidates for federal and state office,” according to a federal court filing in New York.\n\nJohn Dowd, the lawyer for the two men, declined comment on the charges.\n\nParnas is a Ukrainian businessman. Fruman is a real estate investor. Both, according to various media accounts, helped introduce Giuliani into top Ukrainian political circles.\n\nThe arrests come as the Democratic-led U.S. House of Representatives has launched an impeachment inquiry into the Republican president. The probe concerns Trump’s request in a July telephone call for Ukraine’s president to launch an investigation into former Vice President Joe Biden, a leading Democratic rival in the 2020 presidential election.\n\nThe Campaign Legal Center, a nonprofit that favors campaign finance regulation, had urged a U.S. government agency in a July 2018 complaint to investigate whether Parnas and Fruman had broken the law by using a shell company to disguise the source of a $325,000 donation to a pro-Trump political action committee.\n\nThe CLC later supplemented its complaint to the U.S. Federal Election Commission to include evidence of wire transfers showing the movement of the funds.", "description": "Two Florida businessmen associated with U.S. President Donald Trump's personal lawyer Rudy Giuliani have been arrested over violations of campaign finance laws, a spokesman for the Manhattan U.S. Attorney's office said on Thursday.", "authors": ["David Morgan", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439305270&w=1200&r=LYNXMPEF991HX", "published_at": "2019-10-10"}