{"pub": "chosun", "url": "https://english.chosun.com/site/data/html_dir/2019/10/30/2019103000984.html", "downloaded_at": "2019-10-30 04:15:59.218261+00:00", "title": "S.Korean Weightlifters Snubbed During Championships in Pyongyang", "language": "en", "text": "South Korean weightlifters returned home on Tuesday after their 11-day trip to Pyongyang for the Asian Youth and Junior Weightlifting Championships. The athletes on Tuesday arrived at Incheon International Airport via Beijing with 53 medals -- 14 gold, 20 silver and 19 bronze -- from the competition, which ended on Sunday. The youth event drew much attention as it kicked off just five days after an inter-Korean football match in Pyongyang for the second round of Asian qualifiers for the 2022 FIFA World Cup in Qatar.\n\nSouth Korea's Yeom Da-hoon (third from left) gestures to North Korea's Pak Kum-il (right) to join him on the podium during a medal ceremony at the Asian Youth and Junior Weightlifting Championships in Pyongyang on Sunday. /Yonhap\n\nThe football match was held in bizarre circumstances without a live broadcast, fans or media present. The North did not allow any South Korean reporters to come along and denied the entry of foreign media and a cheering squad, resulting in the match taking place in an empty stadium, prompting the South to lodge an official complaint to the Asian Football Confederation over the North's lack of cooperation. Scenes at the weightlifting competition were somewhat different from the football match. North Korean spectators filled the venue, and two South Korean reporters were allowed to cover the event this time. Some speculate the motive behind the North's authorization of reporters was to promote its hosting of a major international event for a discipline in which it is traditionally strong. The official Rodong Sinmun daily reported North Korea finished with a haul of 55 gold medals, the most among participating countries. However, it did not mention a word about South Korea's participation in the event.\n\nNorth Korean spectators leave the stands when South Korean weightlifters appear for a match at the Asian Youth and Junior Weightlifting Championships in Pyongyang on Oct. 22. /Yonhap\n\nThe young weightlifters' stay in the North Korean capital was not as \"nightmarish\" -- as an official at the Korea Football Association put it -- as the South Korean football team's experience, yet still was not exactly pleasant. The footballers were harassed for over two hours after they arrived at Pyongyang Sunan International Airport and they suspected the North planted bugs in their hotel rooms. As for the weightlifters, they had some food they brought confiscated at the airport and were not allowed to keep their cellphones or go out of the hotel. When South Koreans appeared for a match or were honored during medal ceremonies, North Korean spectators emptied the stands, returning later to sing their national anthem when it was North Korea's turn to receive medals. South Korea's Yeom Da-hoon, who won a gold medal in the men's 89-kg competition, invited North Korean bronze winner Pak Kum-il to stand on the top podium together, only to get the cold shoulder. \"I couldn't talk to North Korean athletes at all. They were wary of our presence and kept a distance from us the whole time,\" Yeom said.", "description": "S.Korean Weightlifters Snubbed During Championships in Pyongyang", "authors": [], "top_image": "http://english.chosun.com/site/data/img_dir/2019/10/30/2019103000967_0.jpg", "published_at": "2019-10-30"}