{"pub": "news24", "url": "https://city-press.news24.com/Sport/safas-ref-unit-must-be-proactive-with-erratic-match-officials-20191012", "downloaded_at": "2019-10-13 18:45:28.388453+00:00", "title": "Safa’s ref unit must be proactive with erratic match officials", "language": "en", "text": "Sport Safa’s ref unit must be proactive with erratic match officials\n\nMatch officials are ruining our football, and something has to be done about it.\n\nThere have been so many complaints over the years about poor officiating, and there seems to be no solution to end this madness.\n\nIt has become so common to hear complaints about it that one wonders what’s going on when a week goes by and there isn’t one.\n\nLast week, there wasn’t anything to write home about as far as incidents of poor officiating are concerned. Oh, it was because it was international break week and there wasn’t any domestic action. International week meant taking a break from more referees’ mistakes.\n\nThis is not a joke, but rather the sad state of affairs of South African football.\n\nThis is not the first time poor officiating has reared its ugly head – and it will definitely not be the last.\n\nIf anything, the opening quarter of the season was characterised by match officials’ below-par performances and this can’t be business as usual.\n\nYes, a few have been punished, but is this the real solution to the root cause of the problem?\n\nSome coaches have already lost their jobs because of some questionable and dubious decisions.\n\nTwo assistant referees have been sanctioned following some poor decisions that affected the outcomes of matches.\n\nAssistant referee Mervyn van Wyk, who officiated in the AmaZulu versus Kaizer Chiefs league fixture on Heritage Day, has been sanctioned for four weeks of non-appointment in NSL matches.\n\nRead: Erratic match official loses his Fifa badge\n\nA similar penalty was imposed on Athuxolo Madela, who manned the line during the Chiefs versus Baroka match last month. The pair will be eligible to officiate only in regional league matches.\n\nThe problem with Safa is that it is more reactive than proactive.\n\nBy demoting the duo, Safa bowed to public pressure and played to the gallery.\n\nWhy didn’t Safa say anything about Shaun Oliver after his mistake in the game between Cape Town City and Chiefs in August?\n\nTo refresh your memory, Oliver is the assistant ref who ruled out Khama Billiat’s legitimate goal.\n\nIs it because it was not a game-changing decision at the end of the match as Chiefs went on to win the game, or is it because people did not make a noise about this dubious decision?\n\nA wrong is a wrong, and this was the wrong call.\n\nI’m told Oliver was sanctioned, but this was not communicated to the public. How do we know if this indeed was the case?\n\nAnother problem is with Safa’s referees’ department: Is it selective or is it preferential treatment of officials?\n\nThe problem with Safa is that it is more reactive than proactive.\n\nWe are still waiting for answers on what happened to Victor Gomes following his mistake in a game between Golden Arrows and AmaZulu last season.\n\n\n\nOkay, sanction officials, but then what? Do they come back better? What happens to them psychologically when they are banished to the lower leagues?\n\nI was glad to hear Safa saying it assigned senior match commissioners to help them get better. But is this really happening?\n\nI think we need to call a spade a spade and point out where the problem is – someone at Safa wanted to become a hero by promoting these young and inexperienced officials en masse.\n\nAs one former ref told me, you can’t use a microwave for cooking and expect the same results as if you were cooking on a proper stove.\n\nA quick glance at the panel shows a handful of experienced match officials – not more than five.\n\nThe former official said: “It took me more than six years to break into the premier division, but officials are parachuted to the top these days because someone wants to take the glory to Safa and say that Safa’s development is working. The fact is, you can’t substitute experience and the sooner Safa realises that, the better.”\n\nI couldn’t agree more.\n\nAs we go back to the domestic action next weekend, one can only hope (underline hope) that poor officiating is a thing of the past – gone with the international break. We can only hope and wish. But knowing our officials and their obsession with the limelight, they might be back with a bang and continue where they left off. I hope not.\n\n. timothy@citypress.co.za\n\n.Follow me on Twitter @TimspiritMolobi", "description": "Match officials are ruining our football, and something has to be done about it.", "authors": ["Timothy Molobi"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9320/3c9dadac64bd4d728d4c8f8df85f0a1d.jpg", "published_at": "2019-10-13"}