{"pub": "news.com.au", "url": "https://news.com.au/national/nsw-act/news/teenagers-filmed-causing-chaos-david-jones-store-in-east-maitland/news-story/a4aef6f53c018678446b48c71b6ee49a", "downloaded_at": "2019-10-21 10:29:41.006220+00:00", "title": "Teens filmed behaving badly David Jones store in East Maitland", "language": "en", "text": "Two teenage girls have been filmed causing chaos in a NSW department store, punching and screaming at people during an angry outburst.\n\nThe girls allegedly wrecked havoc in a David Jones store at Stockland Green Hills, East Maitland near Newcastle.\n\nThe video begins with the girls trying to punch the person filming their antics, before a security guard turns up.\n\n“Turn off your f***ing video, I’m telling you c**t,” one of them screams.\n\nThe girls yell at the security guard that staff won’t return their bag.\n\n“Our bags are in there, they are trying to say our bag ain’t in there, but we seen it,” a girl wearing blue hoodie yells.\n\nShe screams that their bus is going to be there in “one minute”.\n\nThe security guard tries to calm the situation saying: “That’s fine, but what are you doing running around trying to punch customers?”\n\nAs they try to explain the situation, a girl dressed in black screams at the person to stop filming and tries to lunge at him but is blocked by the security guard.\n\n“We need our s**t!” the girls scream. The person filming can be heard laughing.\n\nAs the ranting continues the man videoing the scene taunts them saying “go to school”, adding “your mum probably has a Sunday roast waiting for you at home”.\n\nBut the scene becomes even more chaotic as the girls start running around the store, one of them even screams as she jumps on a display bed.\n\nAnother guard arrives and the girls are eventually escorted out of the store.\n\n“Maitland’s finest,” the man jokes as they leave.\n\nSince being shared on Facebook today, the post has already been shared more than 11,000 times and attracted 17,000 comments, with many describing the girls’ behaviour as “disgusting”.\n\nA local resident known as Jacinta posted the video on her profile after it was removed from the Facebook page of the man who filmed the incident.\n\nShe told news.com.au that the girls are well known to her as they live nearby. She says she’s caught them destroying her elderly neighbours’ fences and property, and they often yell abuse at her.\n\nShe also posted footage of the girls confronting and getting into fights with other girls. She said she believed attention needed to be brought to what they were doing.\n\n“I have witnessed them damage properties and assault people,” she said.\n\n“I am scared to have my car parked in my own front yard because I know the high chances of having one of these teens walk by and damage my property.\n\n“They are being allowed to roam our streets at night and cause havoc without consequences.”\n\nShe said she thought people were sharing the video “because they are simply in shock and disgust that these girls and boys are still on our streets doing these horrible things and nothing serious is being done about it”.\n\nNews.com.au has contacted NSW Police for a response.", "description": "Two teenage girls have been filmed causing chaos in a NSW department store, punching and screaming at people during an angry outburst.", "authors": [], "top_image": "https://cdn.newsapi.com.au/image/v1/67e45384ebe02543382cfecdee4d8c00?width=650", "published_at": "2019-10-21"}