{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/brexit-news-boris-johnson-tuc-frances-o-grady-general-election-vote-parliament-a9096816.html", "downloaded_at": "2019-09-09 06:51:39.497871+00:00", "title": "Brexit: Boris Johnson accused of ‘running scared’ from parliament by TUC boss ahead of fresh snap election bid", "language": "en", "text": "Boris Johnson will be accused of “surrendering to the Brexit Party” and running scared of parliament by union leaders, as he mounts a fresh bid to beg opposition MPs for a snap election.\n\nAhead of another momentous week in Westminster, TUC general secretary Frances O’Grady urged opposition MPs to “hold their nerve” against the prime minister’s calls for a snap poll until a Brexit delay has been secured.\n\nIn a speech at the TUC’s annual conference in Brighton, Ms O’Grady will accuse the “clown prince of Downing Street” of treating Brexit like a game and demand a Final Say referendum on any agreement.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nShe will tell delegates: “Boris Johnson accuses his opponents of being cowards. But what could be more cowardly than running scared of parliament?\n\n“He’s the one waving the white flag. He surrendered to the Brexit Party and he’s ready to surrender our NHS to Donald Trump.\n\n“It tells us everything we need to know about the moral vacuum at the heart of No 10 – and why we can’t trust him on Brexit.”\n\nMs O’Grady will argue that no deal must be “ruled out for good” before an election can take place, after the government signalled it could defy rebel legislation to prevent the UK crashing out of the EU next month.\n\nOn Monday the prime minister will suspend parliament until 14 October if he cannot secure an early election – something Labour and other opposition parties have refused to support.\n\nBut Jeremy Corbyn is facing pressure from some union bosses to back an election at an earlier date.\n\nOn the first day of congress, Mark Serwotka, the outgoing TUC president, demanded immediate action to oust a prime minister he deemed “worse than Thatcher” and his ”cabal of hard-right, free-market fanatics”.\n\nMr Serwotka, who is also general secretary at PCS union for civil servants, said: “Let the cry go out – we have no confidence in this government and we want a general election on our terms now.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Inside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\n“We will mobilise to campaign for one, and this should including organising a massive national demonstration.”\n\nBut Ms O’Grady urged opposition MPs to “hold your nerve” against the “bullying” tactics of the prime minister.\n\nOpening the congress, she said: “He would sell livelihoods down the river because all he cares about is political power.\n\n“So my advice to MPs is this – when you’ve got your opponents on the ropes, don’t let them off. Hold your nerve until 31 October and call Boris Johnson’s bluff.”\n\nManuel Cortes, general secretary at the TSSA union, praised the strategy to withhold an election, saying Mr Corbyn had “played Johnson like a fiddle”.\n\nHe told The Independent: “[Corbyn] has got Boris in a headlock. Boris has said that he will die in a ditch – well, he’d better start digging it because he’s got no way out now.\n\nShape Created with Sketch. Thousands protest after Boris Johnson requests to suspend parliament Show all 29 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Thousands protest after Boris Johnson requests to suspend parliament 1/29 Houses of Parliament AP 2/29 Downing Street AFP/Getty Images 3/29 Houses of Parliament AP 4/29 Houses of Parliament to Downing Street AFP/Getty Images 5/29 Downing Street AP 6/29 Houses of Parliament Getty Images 7/29 Houses of Parliament EPA 8/29 Houses of Parliament AP 9/29 Whitehall AFP/Getty Images 10/29 Houses of Parliament AP 11/29 AP 12/29 PA 13/29 AP 14/29 AP 15/29 AP 16/29 AP 17/29 AP 18/29 PA 19/29 EPA 20/29 AP 21/29 AP 22/29 AFP/Getty Images 23/29 AFP/Getty Images 24/29 Getty Images 25/29 AP 26/29 AP 27/29 Getty Images 28/29 Getty Images 29/29 Getty Images 1/29 Houses of Parliament AP 2/29 Downing Street AFP/Getty Images 3/29 Houses of Parliament AP 4/29 Houses of Parliament to Downing Street AFP/Getty Images 5/29 Downing Street AP 6/29 Houses of Parliament Getty Images 7/29 Houses of Parliament EPA 8/29 Houses of Parliament AP 9/29 Whitehall AFP/Getty Images 10/29 Houses of Parliament AP 11/29 AP 12/29 PA 13/29 AP 14/29 AP 15/29 AP 16/29 AP 17/29 AP 18/29 PA 19/29 EPA 20/29 AP 21/29 AP 22/29 AFP/Getty Images 23/29 AFP/Getty Images 24/29 Getty Images 25/29 AP 26/29 AP 27/29 Getty Images 28/29 Getty Images 29/29 Getty Images\n\n“He’s either going to have to resign, or eat his words and ask for an extension. If he doesn’t, he is going to be removed by parliament or face legal action. He’s in a headlock.”\n\nUnite’s assistant general secretary Steve Turner drew applause with a fiery speech, when he said “f*** you” to Mr Johnson, in response to the prime minister’s notorious “f*** business” comments.\n\nOn Monday, the TUC will say firms should be forced to report any differences in the pay of staff based on their class as part of measures to tackle “unfair barriers” faced by people from a working class background.\n\nThe union organisation called for new legal measures to tackle “class discrimination” in the workplace, claiming that graduates from wealthier backgrounds are more than twice as likely to be on a £30,000 starting salary than those from working-class backgrounds.\n\nThe union organisation urged the government to make discrimination on the basis of class unlawful – just like race, gender and disability.", "description": "Boris Johnson will be accused of “surrendering to the Brexit Party” and running scared of parliament by union leaders, as he mounts a fresh bid to beg opposition MPs for a snap election. Ahead of another momentous week in Westminster, TUC general secretary Frances O’Grady urged opposition MPs to “hold their nerve” against the prime minister’s calls for a snap poll until a", "authors": ["Lizzy Buchan"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/08/14/pri83724486.jpg", "published_at": "2019-09-09"}