{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7567353/Sarah-Silverman-oozes-casual-smart-corduroy-blazer-tie-jeans-2019-New-Yorker-Festival.html", "downloaded_at": "2019-10-13 08:50:46.424168+00:00", "title": "Sarah Silverman oozes casual-smart in a corduroy blazer, tie and jeans at 2019 New Yorker Festival", "language": "en", "text": "The New Yorker Festival brings together a who's-who of the arts, politics and everything in between to stages in and around New York City.\n\nAnd on Saturday, comedian Sarah Silverman brought her fearlessly funny perspective on some of the hot topics of the day for a sit down in front of a live audience with New Yorker staff writer Andrew Marantz.\n\nSome of the other high-profiles names to hit the stage on day two of the three-day event organized by New Yorker magazine included actors Paul Rudd, Sarah Paulson, and Kathryn Hahn, as well as Broadway theater performer Billy Porter and Speaker Of The U.S. House Of Representatives Nancy Pelosi (D-CA).\n\nOn point: Sarah Silverman, 48, brought her witty humor for a sit down at the 20th New Yorker Festival in New York City on Saturday\n\nSilverman, 48, was her usual witty, funny and introspective self, wearing form-fitting blue jeans that flared out from the knee down.\n\nGoing for a causal-smart look, she also donned a brown corduroy blazer with a dress shirt and tie.\n\nShe rounded out her ensemble with a pair of black-heeled boots and had her long raven tresses pulled back into a top ponytail.\n\nDuring her time on the stage she dished about her best-selling memoir - The Bedwetter: Stories Of Courage, Redemption, And Pee - which is currently being adapted into a musical that's to debut in 2020.\n\nFearlessly funny: Sarah Silverman went with a casua-smart look in a blazer, tie and jeans when she dished about a number of hot topics with Andrew Marantz at the 2019 New Yorker Festival\n\nWorking it: Paul Rudd brought his brand of funny and casual cool style\n\nA conversation: Rudd, 50, talked about some of his career choices with Michael Specter\n\nAcclaimed actor and all-around funnyman Paul Rudd, 50, also brought his brand of comedy when he sat down with New Yorker staff writer Michael Specter.\n\nThe 40-Year-Old Virgin star looked casual-cool in a navy slacks, an olive button-down shirt and a brown zipper-jacket that had retro-look to it.\n\nDuring his time in the spotlight he talked about some of his decisions in his career that led to such hits as Clueless, Anchorman, Knocked Up, This Is 40 and Ant-Man.\n\nNext up, he will star in the film Ghostbusters 2020 and the Netflix series Living With Yourself.\n\nElegently cool: Sarah Paulson, 44, wore a grey-patterned, double-breasted suit\n\nPaulson chatted with with Michael Schulman\n\nUnique: Billy Porter, 50, showed off his legs in a long black skirt that was paired with a black suede jacket and a white button-down shirt\n\nIntrospective: The Broadway theater entertainer chatted with Rachel Syme\n\nSarah Paulson, 44, looked elegantly cool in a grey-patterned, double-breasted suit.\n\nThe baggy ensemble was paired with a black t-shirt and black heels.\n\nThe 12 Years A Slave actress had her light brown bob-cut style to the side with a right part.\n\nAlways one to push the envelope when it comes to fashion, Billy Porter showed off his legs in a long black skirt that was paired with a black suede jacket and a white button-down shirt.\n\nThe Broadway theater performer, 50, got a boost in a pair of black platform boots and added a touch of style with couple of stylish scarf around his neck.\n\nCoordinated: Kathryn Han, 46, went with a cream-colored ensemble that consisted of a long skirt, blazer and shirt\n\nNew project: Hahn dished about her new HBO series Mrs. Fletcher with Tom Perrotta\n\nKathryn Hahn, 46, pushed her new HBO series Mrs. Fletcher during her conversation with best-selling author Tom Perotta.\n\nShe went with a cream-colored ensemble that consisted of a long skirt, blazer and shirt.\n\nThe Parks And recreation star also wore heels and styled her dark brown locks long, wavy and slight unkempt.\n\nU.S. House Speaker Nancy Pelosi talked everything politics with investigative journalist Jane Mayer, dressed in a cream-colored pant suit, heels with a purple shirt.\n\nThe festival was first held in 1999 and has become a major draw for cultural icons and advertisers alike.\n\nIN the know in DC: Speaker Of The U.S. House Of Representatives Nancy Pelosi (D-CA), 79, talked everything politics and the upcoming 2020 elections", "description": "Sarah Silverman went for a casual-smart look in a brown blazer, tie and blue jeans at the 20th Annual New Yorker Festival in New York City on Saturday.", "authors": ["Kevin Kayhart For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/05/19645898-0-image-a-64_1570942387832.jpg", "published_at": "2019-10-13"}