{"pub": "politico", "url": "https://politico.com/news/2019/10/10/trump-economy-midwest-trade-manufacturing-043711", "downloaded_at": "2019-10-10 15:05:49.575972+00:00", "title": "‘An existential political risk’: Trump manufactures a swing-state problem", "language": "en", "text": "“Manufacturing is in recession right now. This is what all the data show,” said Torsten Slok, chief economist at Deutsche Bank Securities. “And everywhere I go in the world, the fear I hear is that we are going to be driven deeper into recession because this is all about uncertainty caused by the trade war.”\n\nBroad national gauges of manufacturing are already troubling, countering some of the president’s claims of success. The Institute for Supply Management manufacturing survey — a widely followed indicator of factory health — has shown a declining sector two months in a row, recently hitting a level not seen since the end of the Great Recession due to a sharp drop in new export orders. Respondents to the survey blamed a trade war that has reduced export demand and increased costs for parts used in manufacturing.\n\nAt the county and state level, the environment looks even darker for Trump.\n\nIn Racine County, Wisc., where Trump narrowly defeated Hillary Clinton, manufacturing had a 22.5 percent share of employment in 2016. The jobless rate in the county rose by three tenths of a percent from January 2018 to August 2019.\n\nOther manufacturing-heavy states that Trump narrowly won in 2016, and where the current slump could hurt him, include Michigan and North Carolina. A recent study by LendingTree found that Michigan is the U.S. state most at risk of a near-term recession based on employment trends, house prices and other data — with a nearly 60 percent chance of weak economic fundamentals in the fourth quarter of this year. The ongoing General Motors strike that began last month puts the state at even greater risk.\n\nPresident Donald Trump greets supporters in Michigan at a March rally. Michigan is one of the states where the current slump could hurt him. | Scott Olson/Getty Images\n\nThe negative news on manufacturing comes as senior Chinese officials arrive in Washington for another round of talks aimed at reaching a deal with Trump that would reduce heavy tariffs that have imposed significant economic costs on both sides. Stocks rose a bit Wednesday on reports that the Chinese might accept a limited deal that does not include the kind of structural reforms Trump wants.\n\nIt’s unclear whether Trump would accept such a deal that could eliminate tariffs and relieve some of the pressure on the manufacturing sector, and he told reporters Wednesday afternoon that he didn’t think China was lowering expectations for a trade deal.\n\n“I think they feel I am driving a tough bargain,” he said. “I think China has a lot of respect for me, for our country, for what we are doing. I think they can’t believe what they have gotten away with for so long.”\n\nIt’s not certain that even such a deal will reverse negative trends in the manufacturing sector, which overall is a small slice of the American economy but an important part of overall corporate profits. Manufacturing also supports all kinds of ancillary service-industry jobs that suffer whenever factory work declines.\n\nOverall, the growth in manufacturing jobs — one of Trump’s biggest promises — has essentially vanished. After adding as many as 25,000 new manufacturing jobs per month last spring, the numbers began to decline as the trade war with China intensified. In September, the sector lost 2,000 jobs. That number could grow for October when striking GM workers are included.\n\n“To the extent that the manufacturing slowdown continues unabated, which is likely unless there is a de-escalation in trade tensions, the electoral map could be more difficult for President Trump and Republicans in 2020,” Deutsche Bank analysts wrote in a report this week.\n\nThe still-strong national employment numbers, with a jobless rate at a half-century low of 3.5 percent, can also tell a misleading political story. It’s clearly an overall positive for Trump, who loves to tout the number.\n\n“Breaking News: Unemployment Rate, at 3.5%, drops to a 50 YEAR LOW. Wow America, lets impeach your President (even though he did nothing wrong!),” Trump tweeted last week.\n\nBut dig deeper and large numbers of the jobs are coming from uncontested states like California. States that make up Trump’s coalition are not doing quite as well. According to data from Moody’s and the Bureau of Labor Statistics, manufacturing shed jobs between October 2018 and August of this year in Pennsylvania, Wisconsin and North Carolina. Michigan was flat.\n\nThat creates a challenging dynamic for Trump’s campaign pledge to “Keep America Great.”\n\n“It’s an existential political risk,” said Moody's Analytics chief economist Mark Zandi. “He won the election based on carrying Pennsylvania, Michigan and Wisconsin and appealing to those voters who work in manufacturing or related industries. He promised he would bring manufacturing jobs back and his policies are doing the precise opposite. Jobs losses are mounting, particularly in those states.”\n\nThe Trump campaign is pitching itself on the overall gains in manufacturing jobs since Trump was elected, unemployment for women and minorities near record lows and resilient overall economic data beyond manufacturing and business investment.\n\n“Since the election, President Trump has created more than 500,000 new jobs in manufacturing, and there is no denying this record,” said Trump campaign spokesperson Daniel Bucheli. “While the president continues pushing his pro-growth, pro-job, pro-business agenda, the economy remains strong and growing, and could be even better if the Do Nothing Democrats would pass the USMCA.“\n\nIn a recent appearance on CNBC, Trump trade adviser Peter Navarro dismissed recent weak numbers and said bluntly, “Manufacturing is strong as a rock.”\n\nOthers aren’t so positive. In a relatively grim inaugural speech as chief of the International Monetary Fund on Tuesday, Kristalina Georgieva said the global economy is experiencing a “synchronized slowdown” that could get worse if trade tensions are not resolved. “There is a serious risk that services and consumption could soon be affected,” she added.\n\nPOLITICO NEWSLETTERS Morning Trade A speed read on global trade news — weekday mornings, in your inbox. Sign Up Loading By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nTrump’s trade battle with China has also slammed rural states where farmers have been unable to sell soybeans and other products into one of their biggest markets. Trump has responded by moving to dole out $30 billion in bailout money and praising “patriot farmers.” Many of the states hit by the drop in agriculture exports like Indiana, Nebraska and Kansas are solid Trump country. Others like Iowa could be a problem for the campaign.\n\nTrump is also trying to make inroads in Minnesota, where he narrowly lost in 2016, and plans to hold a rally there Thursday night. But Minnesota is feeling pressure both in manufacturing and agriculture, as are states like Iowa and Pennsylvania.\n\nAnd it’s not clear that even a quick and limited deal with the Chinese could reverse some of the major negative trends in manufacturing.\n\nConfidence among American executives dropped sharply during the trade war with major capital spending plans put on hold. According to the Conference Board, CEO confidence dipped in the third quarter of this year to the lowest level since the first quarter of 2009. Core capital goods orders and non-residential fixed investment both began to decline along with executive confidence as trade tensions began to peak last year.\n\nFlipping the switch back on could be difficult, especially as the fate of NAFTA continues to hang in the balance and any small deal with the Chinese could be subject to reversal on a presidential whim.\n\nThere is also still the overhanging threat of possible automobile tariffs coming later this year. “Even if he gets the infamous skinny deal with China, the question then is does that really end all uncertainty? How credible would that deal be?” said Slok.\n\nUltimately, Trump’s reelection could come down to three states — Michigan, Pennsylvania and Wisconsin — where manufacturing trends are working against him and where he will need a sharp turnaround. “In those three key states, the economies are weakening. Unemployment is low but rising,” said Zandi. “If it continues to rise between now and Election Day it will be very difficult for him to recover. The trend lines don’t look good.”", "description": "", "authors": [], "top_image": "https://static.politico.com/97/25/c079542043fa985981e32ea61831/20191009-trump-economy-gty-773.jpg", "published_at": "2019-10-10"}