{"pub": "news24", "url": "https://sport24.co.za/Rugby/RugbyWorldCup2019/sa-referees-website-claims-peyper-was-denied-rwc-semi-20191023", "downloaded_at": "2019-10-23 15:18:07.160664+00:00", "title": "SA Referees claim Peyper was due to blow England v NZ", "language": "en", "text": "Cape Town - The South African Rugby Referees' Association claims Jaco Peyper was due to officiate the Rugby World Cup semi-final between New Zealand and England before being stood down.\n\n\n\nThis comes after the South African referee caused an uproar after posing for a picture with Welsh fans following their quarter-final win over France last weekend.\n\n\n\nIn the picture, Peyper appears to mimic the elbow that led to France lock Sebastien Vahaamahina's red card.\n\n\n\nPeyper dismissed the French lock in Oita last Sunday after video replays showed him smashing his elbow into the face of Welsh flank Aaron Wainwright early in the second half.\n\n\n\nThe French were leading 19-10 at the time, before going on to lose 20-19.\n\n\n\nPeyper has since apologised for his actions, but it was not enough for him to be considered for action this weekend.\n\nA report on the SA Rugby Referees website claims that Peyper was due to officiate Saturday's match in Yokohama.\n\nThe post read: \"The picture appeared on social media, and there was an outcry amongst disappointed French supporters. That was on Sunday. On Monday, World Rugby chose Peyper for the semi-final match between England and New Zealand. On Tuesday morning they took him off the match and instead appointed Nigel Owens, saying: 'World Rugby can confirm that the match officials selection committee did not consider Jaco Peyper for selection this weekend.'\"\n\n\n\nThe post continued: \"In effect he was suspended, not allowed to perform for a match. That is what would happen to a player guilty of foul play on the field. Peyper's involvement in the picture hardly qualified as foul play. It also is highly unlikely that he would have posed for the picture with the intention of publishing it for the world to see. It seemed merely a bit of fun, and most people would be happy to see a referee acting as a normal person. It would certainly not have endeared referees to that group of Welsh supporters if he had rebuffed their friendly joy.\"\n\nALSO READ: Clive Woodward calls uproar over Peyper picture 'ludicrous'\n\n\n\nWorld Rugby went on to announce that Frenchman Jerome Garces would referee Sunday's World Cup semi-final between South Africa and Wales in Yokohama.\n\n\n\nGarces will be assisted by England's Wayne Barnes and New Zealand's Ben O'Keeffe, with another Kiwi, Ben Skeen, the television match official (TMO).\n\n\n\nThe New Zealand v England semi-final in Yokohama on Saturday under Owens' guidance will kick off at 10:00 SA time.\n\n\n\nOwens will be assisted by French duo Romain Poite and Pascal Gauzere, with South Africa's Marius Jonker as TMO.\n\n\n\nThe global governing body said the selection was \"based on merit after a review of performances” by its match officials selection committee.\n\n- Compiled by Herman Mostert", "description": "The SA Rugby Referees' Association claims Jaco Peyper was due to officiate the Rugby World Cup semi-final between New Zealand and England before being stood down.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9509/0930f09bff4142598c961c7825850b37.jpg", "published_at": "2019-10-23"}