{"pub": "fox", "url": "https://foxnews.com/world/china-xi-jinping-hong-kong-protest-divide-crushed-bodies-shattered-bones", "downloaded_at": "2019-10-14 23:23:59.988770+00:00", "title": "China's Xi Jinping warns attempts to divide country will end in 'crushed bodies and shattered bones'", "language": "en", "text": "As street battles between protesters and police continue to escalate in Hong Kong, China's authoritarian leader warned Sunday any further attempt to divide the country will literally be crushed.\n\nChinese President Xi Jinping made the comments during a visit to Nepal, where he became the first Chinese president in more than two decades to visit the country.\n\n“Anyone attempting to split China in any part of the country will end in crushed bodies and shattered bones,” he told Nepalese Prime Minister K.P. Sharma Oli, China's state broadcaster CCTV reported. “And any external forces backing such attempts dividing China will be deemed by the Chinese people as pipe-dreaming!”\n\nMAN WHO HAD PRO-HONG KONG SIGN CONFISCATED AT NBA GAME IN WASHINGTON SAYS LEAGUE IS 'AFRAID' OF CHINA\n\nXi made the explicit comments at a meeting where the two signed more than 20 agreements Sunday, including one commissioning a feasibility study of a China-Nepal cross-border railway project. The railway construction is being considered under an ambitious project that's a component of China's signature Belt and Road Initiative.\n\nThe two countries also signed agreements in areas of connectivity, security, border management, trade, tourism and education.\n\nDuring the meeting, CCTV reported Nepal’s Oli told Xi the country will oppose any “anti-China activities” on its soil, according to Reuters.\n\nChina has seen growing international pressure due to the escalating Hong Kong pro-democracy protests during the last four months. The demonstrations began in June over a contested extradition bill and have snowballed into a wide-ranging anti-government, anti-police and anti-China movement.\n\nOn Monday, police in Hong Kong said a homemade, remote-controlled bomb intended to \"kill or to harm\" riot control officers was detonated as the police deployed against renewed street violence.\n\n\"It exploded less than 2 meters away from a police vehicle. We have reason to believe that the bomb was meant to target police officers,\" Deputy Commissioner Tang Ping-keung said at a news conference, speaking through a translator.\n\nWHITE HOUSE PETITION ASKING US TO RECOGNIZE TAIWAN SURPASSES 100K SIGNATURES\n\nWhile peaceful rallies in Hong Kong have continued to draw thousands, small groups of violent protesters have managed to wreak havoc. Several popped up Sunday in multiple locations across the city, overwhelming the fanned-out police deployment.\n\nPolice said they arrested 201 people, ages 14 to 62, on Saturday and Sunday. They said 12 officers were injured, including one who was slashed in the neck with a sharp object, severing a nerve.\n\nPresident Trump, who's in the middle of a trade dispute with China, has said it would be difficult to negotiate with Xi if anything “bad” happens as a result of Chinese authorities’ handling of the Hong Kong protests. During a meeting Friday with Chinese Vice Premier Liu He during the latest round of trade talks, Trump said the protests have \"toned down a lot\" and that the situation is \"going to take care of itself.\"\n\nIn addition to the unrest in Hong Kong, China has been facing condemnation for what it calls \"re-education and training centers\" in the Xinjiang region. Activists, however, say the centers are actually detention camps holding more than one million ethnic Uighurs and other Muslims, according to Sky News.\n\nCLICK HERE FOR THE FOX NEWS APP\n\nLast week, Washington blacklisted 28 Chinese companies over the treatment of predominantly Muslim ethnic minorities in the country\n\nAnd adding to China's recent bad press, controversy erupted amid an NBA public relations visit there last week after a general manager for a team not on the China trip tweeted a supportive statement about the Hong Kong demonstrations. The resulting uproar saw all NBA news conferences in China canceled, a nationwide ban on showing the exhibition games (though they were available to watch internationally) and debate in the U.S. about free speech and athletes' activism.\n\nThe Associated Press contributed to this report.", "description": "As street battles between protesters and police continue to escalate in Hong Kong, China's authoritarian leader warned Sunday any further attempt to divide the country will literally be crushed.", "authors": ["Travis Fedschun", "Travis Fedschun Is A Reporter For Foxnews.Com. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Xi_1.jpg", "published_at": "2019-10-14"}