{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7578791/Labour-MPs-accuse-Jeremy-Corbyn-living-planet.html", "downloaded_at": "2019-10-16 14:19:34.110647+00:00", "title": "Labour MPs accuse Jeremy Corbyn of 'living on another planet'", "language": "en", "text": "brexit countdown_bg Created with Sketch.\n\nJeremy Corbyn and his allies have been accused of 'living on another planet' by furious Labour MPs amid a growing row over when a general election should take place.\n\nMr Corbyn remains adamant that a snap election should come before a second Brexit referendum but he is under increasing pressure to switch his stance.\n\nMany MPs and senior figures believe a referendum must take place before an election to avoid the party suffering heavy losses over its neutral Brexit policy.\n\nThe issue came to a head at a meeting of the Parliamentary Labour Party earlier this week.\n\nIan Lavery and Andrew Gwynne, the two shadow cabinet ministers in charge of coordinating Labour's election campaign, reportedly told the PLP that the party had 'never been in better shape' for a snap poll.\n\nBut the claim was met with incredulity by many MPs who apparently told Mr Corbyn's allies that they could not support an early election before a referendum.\n\nOne MP who was at the meeting told the Politics Home website said: 'We had 15 minutes from Lavery telling us we are election ready and an hour of MPs saying we are not.'\n\nAnother MP said: 'He united the PLP in one clear unambiguous position: we cannot have an election.'\n\nMany Labour MPs are not only concerned about the impact the party's Brexit policy could have on their election chances.\n\nThey are also worried about Mr Corbyn's leadership and the fact the party trails the Tories in most recent opinion polls.\n\nJeremy Corbyn, pictured in London on October 14, remains committed to holding a general election before a second referendum\n\nKevan Jones, a former shadow defence minister, reportedly asked Mr Lavery and Mr Gwynne: 'What colour is the sky on your planet?'\n\nMeanwhile, Peter Kyle, the MP for Hove, apparently raised concerns about what Labour's election campaign strategy would look like.\n\nAccording to The Times he said the party's current strategy was too similar to the one deployed against Theresa May which saw the party fall short of winning power in 2017.\n\nAnother source said MPs at the PLP meeting 'didn't get angry' but were left 'dismayed and found the whole thing laughable'.\n\nOne gloomy MP summed up Labour's electoral prospects like this: 'Half of us think we will lose to the Lib Dems, the other half are looking over their shoulders at the Brexit Party.'\n\nLabour's official stance is that the party wants a general election and then, after winning power, Mr Corbyn would facilitate a second referendum on Brexit.\n\nThe party would remain neutral on the issue at the election before adopting a final position ahead the referendum campaign.\n\nBut Mr Corbyn is under growing pressure to change his stance and back holding a second referendum.\n\nNumerous senior Labour figures including Sir Keir Starmer and Emily Thornberry have suggested they would prefer a second referendum over a general election to break the Brexit impasse.\n\nIan Lavery, pictured in Newcastle at the start of October, reportedly told Labour MPs on Monday that the party has 'never been in better shape' for an election\n\nBut Mr Corbyn remains unmoved on the issue.\n\nHe was asked during a broadcast interview at the end of September if he intended to whip his MPs to vote for an election once an Article 50 extension has been agreed.\n\nHe replied: 'Absolutely. Once we have agreed on the extension... at that point, I've made it very clear, we will support a general election.'\n\nHe added: 'Once Boris Johnson has taken his no-deal threat off the table, and the EU has granted an extension, that is the point we will go for it.'\n\nThe issue could culminate at the start of next week after the Liberal Democrats tabled an amendment to the Queen's Speech which would require any Brexit deal to be put to a so-called People's Vote.", "description": "Jeremy Corbyn and his allies have been accused of 'living on another planet' by furious Labour MPs amid a growing row over when a general election should take place.", "authors": ["Jack Maidment", "Deputy Political Editor For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/09/19779098-0-image-a-4_1571216388978.jpg", "published_at": "2019-10-16"}