{"pub": "bbc", "url": "https://bbc.com/news/world-middle-east-50095448", "downloaded_at": "2019-10-18 10:34:42.301530+00:00", "title": "Lebanon scraps WhatsApp tax as protests rage", "language": "en", "text": "Image copyright AFP Image caption Thousands have taken to the streets over the government's handling of an economic crisis.\n\nThe Lebanese government has backtracked on plans to tax WhatsApp calls as protests rage over the government's handling of an economic crisis.\n\nIt had announced a new $0.20 (£0.16) daily charge on voice calls made through Facebook-owned WhatsApp and other similar apps.\n\nBut it scrapped the plans hours later amid clashes between security forces and protesters.\n\nThe demonstrations are some of the biggest Lebanon has faced in years.\n\nDozens were reported injured as protesters burned tires and security forces fired tear gas.\n\nLebanese Prime Minister Saad al-Hariri may cancel Friday's cabinet meeting, a website linked to his party said, as protesters gathered around the government's headquarters.\n\nImage copyright Reuters Image caption Dozens have been injured in the clashes\n\nWhy are people protesting in Lebanon?\n\nThousands of Lebanese have taken to the streets amid an economic crisis that many blame on the government.\n\n\"I was sitting at home and I saw the people on the move and so I came out,\" Cezar Shaaya, an accountant protesting in Beirut, told Reuters news agency.\n\n\"I am married, I have mortgage payments due every month and I am not working. It's the state's fault.\"\n\nChants of \"the people want to topple the regime\" echoed around Beirut's Riad al-Solh square on Thursday.\n\nMany were also angered by perceived inaction by authorities to tackle the country's worst wildfires in decades.\n\nImage copyright AFP Image caption Protesters have gathered around government headquarters\n\nWhat about the WhatsApp tax?\n\nOn Thursday, the government announced a new daily tax for calls made via voice-over-internet-protocol (Voip), which is used by apps including WhatsApp, Facebook Messenger and Apple's FaceTime.\n\nDespite the plans being pulled just hours later, protests have continued.\n\n\"We are not here over the WhatsApp, we are here over everything: over fuel, food, bread, over everything,\" said Abdullah, a protester in Beirut.\n\nThe prime minister is expected to deliver a speech on the crisis later on Friday.", "description": "The government announced, then scrapped, a tax on app-based calls amid angry protests over the economy.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/120BE/production/_109281937_mediaitem109281936.jpg", "published_at": "2019-10-18"}