{"pub": "yahoo", "url": "https://news.yahoo.com/top-marine-corps-scout-sniper-205113845.html", "downloaded_at": "2019-10-23 12:27:28.092521+00:00", "title": "A top Marine Corps scout sniper managed to sneak up on his enemy completely naked except for a pair of boots", "language": "en", "text": "A U.S. Green beret sniper, assigned to 10th Special Forces Group (Airborne), takes aim at a long-range target for a timed shooting event during advanced skills sniper training on Fort Carson, Colorado, Dec. 12, 2018. More\n\nU.S. Army photo by Sgt. Connor Mendez\n\n\n\n\n\nSnipers train to disappear in any environment in stalking exercises, where snipers attempt to sneak up on a simulated enemy, set up a forward firing position, and take a shot without being detected.\n\nInsider recently observed Marine snipers participating in a stalking exercise at Marine Corps Base Quantico in Virginia.\n\nDuring that visit, two instructors shared a story of a former instructor who successfully completed stalking training naked to prove that movement, route selection, and screens as opposed to ghillie suits and camouflage are most important when it comes to achieving operational invisibility.\n\nVisit Business Insider's homepage for more stories.\n\nAn expert sniper can sneak up on an enemy naked as the day he was born. It's not particularly advised, but one top sharpshooter did exactly that just to prove a point, Marine snipers told Insider.\n\n\"Ghillie suits make people feel like they are invisible,\" a Marine Corps scout sniper instructor at Marine Corps Base Quantico in Virginia explained of the full-body uniforms that snipers are trained to adorn with grass and other materials to blend into their environment.\n\n\"The vegetation and the camouflage, that's only one part of it,\" the instructor added. \"It's more route selection and movement. It's about what you are putting between you and the target.\"\n\nRead more: A top sniper slipped past about a dozen Marines — no one saw him even when he was less than 3 feet away\n\nOne top sniper proved that to be true by completing stalking training — an exercise where snipers are asked to sneak into position and fire on a target without getting caught by observers using high-powered optics — in nothing but his boots, two Marines told Insider.\n\n\"He was one of our instructors, and he wanted to show up his fellow HOGs on the glass,\" a schoolhouse instructor said, referring to the observers (nicknamed \"Hunters of Gunmen\" or HOGs) searching for the PIGs (Professionally Instructed Gunmen) in the field with monocular or binocular devices.\n\n\"I'm going to do this naked, and you're not going to catch me,\" the legendary sniper supposedly said. \"I'm going to go out there and burn you guys down naked except for boots on.\"\n\nAnd, he did, Insider learned from the Marines.\n\nNo clothes. No ghillie suit. No vegetation. The sniper went into the field with nothing but a painted face and a pair of boots. Insider recently observed a stalking exercise at Quantico, where snipers in training worked their way down a lane filled with snakes, various bugs, and quite a few thorns. It was not an environment for someone to crawl around in nude. It's unclear what type of stalking lane the naked Marine was on.\n\nThe sniper is said to have used screens, natural features on the stalking lane that shield the sniper from view, to avoid the watchful eyes of his training enemy.\n\nHe was also very careful and deliberate with his movements.\n\n\"That's the art of invisibility,\" an instructor told Insider. \"It's all about movement. Some animals are phenomenal at it.\" Lions, for example, will crawl low and burn through the grass until they get in range of their target.\n\nThat's a hard skill to learn though. \"When you are crawling on the ground, it's hard to understand where you are at. It's like being an ant,\" a second instructor explained. \"It's the weirdest thing in the world when you get that low to the earth and you start crawling. It makes people uncomfortable.\"\n\nRead more: A top sniper slipped past about a dozen Marines — no one even saw him when he was less than 3 feet away\n\nWhen Insider visited the base last month, we watched a group of trainees go through stalking training for the first time. Several of them were spotted in the lane because they raised their heads to see their target more clearly.\n\n\"They love to raise up. They love to look up,\" an instructor explained. \"It's such a natural human instinct, to think that to see something you need 180 degrees.\"", "description": "The nude sniper proved that to truly disappear you don't need clothes, just that you fully embrace the \"weirdest thing in the world.\"", "authors": ["Ryan Pickrell"], "top_image": "https://s.yimg.com/uu/api/res/1.2/caXP1JpuQFFBQzbAbNIqOQ--~B/aD02Mjc7dz04MzY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/business_insider_articles_888/0a4df0553faaa7c5f8c188e753ae5580", "published_at": "2019-10-22"}