{"pub": "huffpost", "url": "https://huffpost.com/entry/beto-orourke-2020-election-running-for-office_n_5da61563e4b02253a2f99452", "downloaded_at": "2019-10-15 23:05:15.452754+00:00", "title": "Beto O'Rourke 'Cannot Fathom' Running For Office Again If He's Not The Nominee", "language": "en", "text": "Democratic presidential candidate Beto O’Rourke doesn’t appear to have any plans to run for office in the future if he doesn’t win his party’s 2020 nomination.\n\n“I cannot fathom a scenario where I would run for public office again if I’m not the nominee,” he told Politico in an interview published Tuesday.\n\nThe former Texas congressman is currently polling around 2%, lagging far behind former Vice President Joe Biden, Massachusetts Sen. Elizabeth Warren and Vermont Sen. Bernie Sanders ― all of whom are firmly in the double digits and are leading the pack of 19 hopefuls jockeying for the Democratic bid.\n\nO’Rourke dismissed the numbers while speaking to The New York Times last month, stating that he has instead “just been focused on saying what’s on my mind, being myself.”\n\n“And not really in the slightest being interested in polls, or how things poll, or what you’re supposed to say,” he added.\n\nO’Rourke drove that point home in the third Democratic debate in September when, in the wake of the August mass shooting that left 22 people dead at an El Paso, Texas, Walmart, he told the audience, “Hell yes, we’re going to take your AR-15, your AK-47.”\n\nThe vociferous call for gun control sparked outrage from the right and even troubled members of his own party who raised concerns that the comment was practically a gift to the GOP.\n\nSouth Bend, Indiana, Mayor Pete Buttigieg, another Democratic candidate, told CNN days later that he felt O’Rourke’s statement played into Republicans’ hands.\n\nHowever, in his latest interview with Politico, O’Rourke, who is pushing for a mandatory assault weapons buyback program, showed no signs of backing down.\n\n“We have to continue to keep this issue front and center if we’re going to make any progress on it,” he said. “And I have an opportunity to do that.”\n\nO’Rourke will face off on Tuesday night with 11 other candidates at the fourth Democratic debate, which will be held at Otterbein University in Westerville, Ohio.", "description": "For the Democratic presidential candidate, it may be all or nothing.", "authors": ["Trends Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5da62dd3200000ba0c503b84.jpeg?cache=sgsu1acpcn&ops=1778_1000", "published_at": "2019-10-15"}