{"pub": "news24", "url": "https://fin24.com/Economy/what-you-need-to-know-about-south-africas-new-energy-plan-20191018", "downloaded_at": "2019-10-19 11:29:58.150800+00:00", "title": "What you need to know about South Africa's new energy plan", "language": "en", "text": "Government's long-awaited energy plan has been released, and contains a number of surprising policy interventions.\n\nHere are some of the notable inclusions in the Integrated Resource Plan (IRP2019), which was published on Friday.\n\nBig shift to wind\n\nThe plan projects that by 2030, almost 60% of SA electricity will still be generated from coal. Currently, coal plants generate 77% of electricity in the country.\n\n\"Coal will continue to play a significant role in electricity generation as the country has the resource in abundance,\" Mineral Resources and energy Minister Gwede Mantashe said at a briefing on the electricity blueprint on Friday.\n\nBut government has hiked the expected contribution from wind by a large margin.\n\nIn the initial draft version of the plan, released last year, wind was only supposed to deliver 13% of SA’s electricity by 2030– this has now been increased to more than 18%.\n\nPreviously, government thinking was that wind farms were supposed to represent 11 442MW (or 15%) of \"installed energy capacity\" in the country by 2030. (Installed capacity refers to the maximum output of electricity a plant can produce under ideal conditions.) This has now been increased by 55% to 17 742MW in the latest round.\n\nIn all, 20.4GW of power capacity will be generated by renewables, split somewhat more for wind than solar despite the lower expected cost of solar in future rounds than wind which is strange, says Peter Attard Montalto, head of capital markets at Intellidex.\n\nBy 2030, solar will supply 7% of electricity. Hydro plants will contribute 8%, nuclear 4.5% and the rest from gas and diesel.\n\nNew small coal plants may be constructed\n\nThe new plan notes that government found from its experience with private energy producers that there is a \"business case\" for modular and smaller power plants of between 300MW and 600MW. By comparison, one of Eskom largest current coal-fired power plants, Majuba, has an installed capacity of 4 100MW.\n\nCoal units producing 1.5GW of power will be added, but because a number of Eskom plants will be decommissioned in coming years, there will be a net fall of 3.8GW.\n\nGovernment also intends to direct funding towards research into clean coal technologies to help the country comply with climate and environmental requirements, the IRP reads.\n\nSmall new nuclear reactors planned - maybe\n\nNuclear is very expensive at commissioning and at decommissioning, but when it is operational it is \"most reliable and cost effective,\" Mantashe told journalists on Friday.\n\nAccording to a wrong version of the IRP2019, which was erroneously released via the government gazette, government wanted to \"immediately commence\" with a new nuclear build programme of 2 500MW because it is a \"no-regret option\" in the long term and in case the Inga project does not materialise.\n\nThis project on the Congo River has been under construction for more than 10 years, and the IRP2019 notes that the DRC has not yet concluded the work needed for South Africa to start receiving electricity, as agreed, from 2023.\n\nBut this was later corrected. The real version of the IRP2019 says that government will begin preparing for a nuclear build programme \"at a pace and scale that the country can afford\". The reference to Inga was dropped.\n\nMontalto said that new nuclear capacity does not come onstream before 2030, but discussion of work to start on scoping new nuclear is in the plan for coming on grid beyond 2030.\n\nThe IRP argued that smaller nuclear plants will be more manageable investments than large-scale projects. But government acknowledges that these could take ten years or more to construct, and no additional nuclear power is set to come online before 2030.\n\nSmall nuclear plants are being developed in Russia, China and in the US, where the government there recently approved a small nuclear reactor design, which would take up 1% of the space of a conventional reactor. But the world’s first small-scale nuclear power reactor may still be eight years away, Bloomberg reported in April 2018.\n\nBrulpadda gas could be used for electricity\n\nGovernment wants to convert its expensive diesel-powered \"peakers\" (emergency power plants) to gas-to-power plants. It has identified plants in Ankerlig (Saldanha Bay), Gourikwa (Mossel Bay), Avon (Outside Durban) and Dedisa (Coega IDZ) to be converted.\n\nThe gas will come from Mozambique, from coal-bed methane and shale gas, as well as the Brulpadda gas block, an area of 19 000 km², some 275km south of Mossel Bay. In February this year, Total announced it found a potential 1 billion barrels of \"wet\" gas in the block.\n\nMantashe said government is very excited about Brulpadda and is keen to \"facilitate\" the development of the block. While government won't interfere, it wants the company to develop the find \"the sooner, the better\".\n\nKoeberg will carry on till 2044\n\nEskom-owned Koeberg nuclear plant, SA's sole nuclear power plant, was designed to close its doors in 2024. But government says that because Koeberg is one of the best performing power plants in its arsenal, its operating life will be extended by another 20 years \"by immediately undertaking the necessary technical and regulatory work\".\n\nCap on coal prices\n\nWhile not set out in the new plan, Mantashe mentioned on Friday that government wants a stricter cap on coal prices, as \"coal producers can't make obscene profits\".\n\nGovernment wants to buy power from South Africans\n\nSouth Africans must be encouraged to generate their own electricity, \"through the enactment of policies and regulations that eliminate red tape without compromising security of supply,\" the reports states. It wants to immediately establish a \"medium-term power purchase programme\" to help ease the supply constraints from Eskom.\n\nBattery hope\n\nStoring excess energy for times when there's a demand crunch is crucial for South Africa, especially as more wind and solar projects come online. The trouble with wind and solar plants are that they generate power when there's wind and sun – not necessarily at peak demand periods.\n\nThe IRP2019 makes provision for the development of new storage technologies (including air energy storage, flywheel energy storage, hydrogen fuel cells), and says that Eskom is already preparing to pilot an energy storage-technology project based on batteries.\n\nThe article has been change to reflect the correct version of IRP2019.", "description": "From small nuclear power plants to plans for the offshore Brulpadda gas find, these are the key takeaways.", "authors": ["Helena Wasserman", "Lameez Omarjee"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8746/bc8908bf5d8640bfa95c7dcfe995bab3.jpg", "published_at": "2019-10-18"}