{"pub": "yahoo", "url": "https://sports.yahoo.com/rob-gronkowski-compares-bill-belichick-to-grinch-always-trying-to-take-away-the-fun-224716186.html", "downloaded_at": "2019-10-20 23:51:06.530056+00:00", "title": "Rob Gronkowski compares Bill Belichick to Grinch: 'Always trying to take away the fun'", "language": "en", "text": "This is why Fox hired Rob Gronkowski.\n\nThe former New England Patriots tight end and current network analyst is known for his lack of filter, and he didn’t hold back during Sunday’s pregame show when asked about who or what he would compare Bill Belichick to.\n\n.@PSchrags: Last week you compared Julian Edelman to a squirrel... What are you comparing Belichick to?@RobGronkowski: The Grinch, always trying to take away the fun 🤣🤣 pic.twitter.com/7M62JivI3I — FOX Sports: NFL (@NFLonFOX) October 20, 2019\n\nScroll to continue with content Ad\n\n“Oh man. On a daily basis? The Grinch — always trying to take away the fun,” Gronkowski said, referring to the notoriously grumpy Dr. Seuss character. ... “And then here I come in all jolly, I’m Santa Claus. Ho, ho, ho.”\n\n[Watch live NFL games on the Yahoo Sports app, here's how]\n\nTypical Gronk\n\nGronkowksi was one of a kind in New England, seemingly getting away with treading ground that no other Patriot — not even Tom Brady — would dare to broach. This included using a Super Bowl trophy as a baseball bat, resulting in a dent that the Patriots were proud to display.\n\nAs usual, Rob Gronkowski prefers to operate without a filter. (Jim Rogash/Getty Images)\n\nNow in retirement, he’s not giving a second thought to making jokes at Belichick’s expense, dicey territory for any current or former Patriot not named Gronkowski.\n\nBut Gronk is Gronk. And here’s guessing Belichick will have a laugh if he gets wind of Gronkowksi’s jab.\n\nMore from Yahoo Sports:\n\nStory continues\n\n\n\n", "description": "As usual, Rob Gronkowski prefers to operate without a filter.", "authors": ["Jason Owens"], "top_image": "https://s.yimg.com/ny/api/res/1.2/hdyAOC7S80nzzmcCfOEaWg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05MTAuOTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/vwW4deHFVll3rKwuPYDPcg--~B/aD0xMzA5O3c9MTgzOTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/fe144b10-f38a-11e9-a73a-ccde1423e1d9", "published_at": "2019-10-20"}