{"pub": "nymag", "url": "https://vulture.com/2019/10/kanye-west-jesus-is-king-lost-films.html", "downloaded_at": "2019-10-24 23:55:38.748181+00:00", "title": "A History of Lost Kanye West Films Ahead of Jesus Is King", "language": "en", "text": "All stuck in “Kanye Land,” apparently. Photo: Kevin Mazur/Getty Images for Yeezy Season 3\n\nIf you think these past few months have taught us not to trust Kanye West, you haven’t been paying attention. Sure, the Jesus Is King rollout has been rough and confusing, from when Kim Kardashian announced the project for her husband over Twitter to when September 29 came and passed with no new album. (In fact, we can’t even be sure we’ll get an album this Friday, October 25, either!) But to those who’ve stayed loyal to Kanye in spite of all this, it’s just the latest in a long line of botched rollouts, broken promises, and projects that never made it past their announcements.\n\nWe’re not just talking about albums either (but where is Yandhi, anyway?) — it’s the same story throughout Kanye’s prolific film career. And while those among us who still have the desire after all this [waves hands] have been able to get our tickets to Jesus Is King the movie — the delayed album’s companion IMAX film, which documents a Sunday Service filmed in James Turrell’s Roden Crater, and opens in theaters Thursday night — we weren’t lucky enough to see some of Kanye’s other films. Here’s a quick history of all his lost, forgotten, or abandoned visual projects.\n\n2007: HBO comedy series\n\nKanye West has called himself many things, so you’ve probably forgotten that, in 2007, he deemed himself “the black Larry David.” It came along with an announcement of a half-hour HBO comedy pilot inspired by Curb Your Enthusiasm, to be directed by former Seinfeld writer Larry Charles. They indeed turned in a pilot, although it was a full hour at first thanks to Kanye’s addition of serious interviews with academics like Cornel West. (We’re … curious.) It eventually got cut to 30 minutes, which HBO supposedly criticized for not having enough Kanye. (The rapper had Upright Citizens Brigade member Matt Besser teach him improv, but tended to let his cast members like J.B. Smoove and then-unknown Wyatt Cenac have the big moments.) So HBO didn’t move forward with the project, but it did have exactly one full unofficial screening at Cenac’s “Night Train” show in Brooklyn. The whole thing got taken off the internet, but the above (absurd) clip of Kanye meeting a Make-A-Wish kid is still intact on Vimeo as part of actor Alison Quinn’s clip reel.\n\n2008: What Doesn’t Kill Me\n\nAt the time, the Glow in the Dark tour was Kanye’s most maximal live endeavor, with its hilly custom-designed set, setting up future tour stunts like Saint Pablo’s floating stage. Not to mention, it was West’s first headlining world tour, spanning April to December 2008. And just look at this list of openers: Lupe Fiasco, Nas, Santigold, N.E.R.D, and Rihanna (touring on Good Girl Gone Bad, no less!). Wish there were maybe some sort of filmed evidence of the whole thing? We do too — and apparently there is, we just may never get to see it. Complex pointed out last year that a trailer for a tour documentary called What Doesn’t Kill Me, directed by Tobias Spellman, had quietly been uploaded to Vimeo. The five-minute clip shows behind-the-scenes footage of Kanye and his crew crisscrossing the country and in the studio, and gives a taste of the drama caused by the tour’s ambitious design. There’s no telling if we’ll ever get the full cut (although, over a decade later, we’d guess not), but hey, a trailer’s something.\n\n2012: Cruel Summer\n\nthe steve jobs theater attempting to close in on @kanyewest \"surround vision\" 7-screen experience pic.twitter.com/d4JiGtqiMJ — Justin Staple (@justinstaple) March 25, 2019\n\nMost of the time, if a movie screens at Cannes Film Festival, it has hopes of ending up in theaters. Not so with Kanye’s Cruel Summer, which he showed out of competition in 2012. Paired with the G.O.O.D. Music compilation album of the same name, it stars Kid Cudi as a car thief in love with a blind Arabian princess, who can only win her over by passing three challenges set up by her father. The real draw of the project, though, was its technology. Cruel Summer is now known for its seven-screen experience. Filmed with seven cameras at once, it’s meant to be shown on seven screens: three in front, one on each side, one on the ceiling, and one on the floor. To accommodate this, Kanye contracted design firm 2x4 to construct a pyramid-shaped theater at Cannes. At the festival, Kanye promised to take his new installation on tour to New York City and Qatar (its setting). We’re still waiting on that.\n\n2013: “New Slaves﻿”\n\n2013 changed the album release as we know it, and not just because of Beyoncé’s surprise December release. Six months prior, Kanye West preceded the release of his long-awaited sixth album, Yeezus, with a black-and-white closeup video of his face as he performed “New Slaves” projected onto 66 buildings worldwide. Thanks to dedicated Kanye fans who took video during the projections (because why would you not?), this stunt lives on online, even though Kanye never released the video properly. Another difference with this version? Kanye seems to sing his part of the outro without the heavy effects present on the album cut. And that falsetto needs to be archived!\n\n2014: Yeezus tour documentary\n\nTake note: We wouldn’t trust Kanye if he announced another tour documentary. Six years after Glow in the Dark, he said he documented the Yeezus tour with a film, and this time actually released the trailer himself online — directed by frequent Kanye collaborator Hype Williams, no less! Supposedly, it was planned for a theatrical release but never made it, and judging by the lack of coverage of the film itself, it likely never screened. Around the same time Kanye announced the project, American Psycho writer and now-anti-political-correctness advocate Bret Easton Ellis said he was working on a movie with Ye, and we have to assume it was this. (He couldn’t admit much, since the project was “in Kanye Land,” which is where we imagine many of these other films are sitting as well.)\n\n2015: “All Day”/”I Feel Like That”\n\nThere’s something about Kanye video premieres and France. When it came time to debut the music video for “All Day,” directed by Steve McQueen and also featuring unreleased song “I Feel Like That,” Kanye took it to the Louis Vuitton Foundation during Paris Fashion Week. McQueen shot the video just a week before, he said — a one-take of Kanye running around a nearly empty wood-paneled warehouse during “All Day,” then sitting down to catch his breath for “I Feel Like That.” He officially premiered the video four months later at the Los Angeles County Museum of Art, but never released it online. That’s not to say it’s not out there if you know where to look (which we do).\n\n2016: “Only One” video game\n\nAfter dozens of music videos and a handful of short films, Kanye wanted to branch out for his one-off song “Only One” with a video game. The ballad itself is sung from the perspective of his deceased mom, and upon its 2015 release, he announced a game based off the song would follow. It wasn’t just a random Kanye promise — a year later, at his Yeezy Season 3 event, where he debuted his new clothing line and album The Life of Pablo, he also premiered a trailer for the game. “The idea of the game is my mom traveling through the gates of heaven,” he explained at the time. Since then, we haven’t heard much on this project, and Business Insider reported in August 2017, “Sources we spoke with say ‘Only One’ hasn’t been in active production since the summer of 2016. One source familiar with the project said that people working on the game were told at one point that funding for the project had fallen through.” Reps for Kanye and game studio Encyclopedia Pictura said the project was still moving at the time, but we won’t bet on getting a Kanye game on our phones anytime soon.\n\nTBD: A documentary about Kanye’s life?\n\nLet’s not forget that when GQ profiled Kim Kardashian for its 2016 “Love, Sex, and Madness” issue, we got this little detail from writer Caity Weaver: “Kim’s husband commissions videographers to film everything when he’s recording an album, for posterity (and possibly, one day, a documentary).” Could a Kanye West life documentary one day hit theaters? Don’t count on it — but don’t count it out, either.", "description": "Kanye West’s Sunday Service film Jesus Is King may hit theaters this weekend, but not all of his past film projects have made it out to the public.", "authors": ["Justin Curto"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/23/23-kanye-west-ureleased-films.w1200.h630.jpg", "published_at": "2019-10-24"}