{"pub": "nytimes", "url": "https://nytimes.com/2019/10/07/opinion/security-camera-privacy.html", "downloaded_at": "2019-10-07 12:09:20.603438+00:00", "title": "Opinion | How We Spy on Each Other Every Day", "language": "en", "text": "But it also matters what you do with the footage you collect.\n\nNeighborhood apps such as Nextdoor and Citizen offer ways for neighbors to chat about local crimes (often with a side of racism) and share footage about supposed perpetrators. Amazon’s Ring, another doorbell camera, uses its own app, Neighbors. You can upload footage directly from your Ring camera to the app, and that footage is accessible by other users, including local police departments. For years I assumed the surveillance culture would be spearheaded by the state, but instead we’re leading it ourselves.\n\nIf there’s a compromise that offers security but also protects everyone’s privacy, it’s being mindful of the placement of security cameras so that they don’t pick up everyday visitors or people on the street (which, for me, rules out doorbell cameras). It also means staying away from neighborhood apps and disabling the audio recording on cameras.\n\n[If you’re online — and you are — chances are someone is using your information. We’ll tell you what you can do about it. Sign up for our limited-run newsletter.]\n\nScenario 2: Indoor cameras for watching the nanny (and everyone else it happens to catch)\n\nWhen a nanny, Angella Foster, explored the topic of nanny cams, her conclusion was straightforward: It’s usually O.K. to record video — beneficial, even, since there’s evidence of what happened if something goes awry — but making everyone aware that there is recording goes a long way to building trust. After all, the purpose of the camera is to keep your children safe, not to catch the nanny doing something wrong.\n\nGenerally speaking, you can legally record video in your home, though not in areas like bedrooms or bathrooms, where a person expects privacy. The legal line is typically drawn at recording audio, just as it is with outdoor cameras.\n\nOnce guests step into your home, they have a higher expectation of privacy. Although you may not be legally required in your state to tell visitors they’re on camera, you really should. It’s a terrible feeling to find out you’ve been recorded, even if you weren’t doing anything interesting. Indoor cameras with audio can easily pick up private footage, like a friend who casually dunks on your choice of throw blanket, or a sibling who disciplines her children.\n\nWhereas outdoor cameras are typically used only for security, indoor cameras aren’t as obviously beneficial. They certainly feel creepier.", "description": "Technology allows us to do it. Should we?", "authors": ["Thorin Klosowski"], "top_image": "https://static01.nyt.com/images/2019/10/07/opinion/07klosowski/07klosowski-facebookJumbo.jpg", "published_at": "2019-10-07"}