{"pub": "reuters", "url": "https://reuters.com/article/us-at-t-divestiture-puertorico/att-to-sell-certain-assets-in-puerto-rico-u-s-virgin-islands-for-1-95-billion-idUSKBN1WO1L6", "downloaded_at": "2019-10-09 19:08:13.891325+00:00", "title": "AT&T to sell certain assets in Puerto Rico, U.S. Virgin Islands for $1.95 billion", "language": "en", "text": "(Reuters) - AT&T Inc (T.N) said on Wednesday it would sell its wireless and wireline operations in Puerto Rico and U.S. Virgin Islands to Liberty Latin America Ltd (LILA.O) for $1.95 billion, as the second-largest U.S. wireless carrier cuts its huge debt pile.\n\nFILE PHOTO: The company logo for AT&T is displayed on a screen on the floor at the New York Stock Exchange (NYSE) in New York, U.S., September 18, 2019. REUTERS/Brendan McDermid\n\nThe deal comes as the company faces calls from activist investor Elliott Management to end its acquisition spree and focus on improving its business.\n\n“This transaction is a result of our ongoing strategic review of our balance sheet and assets to identify opportunities for monetization,” Chief Financial Officer John Stephens said in a statement.\n\nReuters had reported in July that AT&T was exploring a sale for its Puerto Rico assets for $3 billion to cut the debt it took on to purchase Time Warner Inc for $85 billion last year.\n\n“Reports that we originally sought $3 billion for these assets are not accurate,” a company representative said. “That was never our expectation and that valuation wouldn’t have reflected the value of the assets or the market for such assets.”\n\nAT&T’s long-term debt stood at $157.79 billion as of June end, according to a regulatory filing.\n\nThe company has already sold its stake in streaming service Hulu for $1.43 billion and WarnerMedia’s Manhattan offices at Hudson Yards for about $2.2 billion.\n\nLiberty Latin America will support its FirstNet program in Puerto Rico and the U.S. Virgin Islands, AT&T said. FirstNet is a national communication platform that is dedicated to first responders.\n\nAT&T expects the deal to close in the next nine months subject to review by the U.S. Department of Justice and Federal Communications Commission.\n\nThe company’s business in Puerto Rico comprises internet, TV, landlines and business services.\n\nAT&T also said shareholders should expect buybacks in the fourth quarter as it aims at balancing its debt and profit.", "description": "AT&T Inc said on Wednesday it would sell its wireless and wireline operations in Puerto Rico and U.S. Virgin Islands to Liberty Latin America Ltd for $1.95 billion, as the second-largest U.S. wireless carrier cuts its huge debt pile.", "authors": ["Neha Malara", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191009&t=2&i=1438841147&w=1200&r=LYNXMPEF9817M", "published_at": "2019-10-09"}