{"pub": "abcnews", "url": "https://abcnews.go.com/US/fed-expected-cut-interest-rates-means/story?id=65690102", "downloaded_at": "2019-09-18 23:25:54.583942+00:00", "title": "US Federal Reserve cuts interest rates, here's what that means for you", "language": "en", "text": "The U.S. Federal Reserve cut interest rates by a quarter of a percentage point on Wednesday, which will directly affect people's mortgages, car payments and the economy in general.\n\n\"Today, we decided to lower interest rates,\" Federal Reserve Chair Jerome Powell said in a news conference. \"We took this step to help keep the U.S. economy strong in the face of some notable developments and to provide insurance against ongoing risks.\"\n\nWhile Powell maintains that the U.S. economy \"has continued to perform well,\" the household spending has been a key driver of growth, he said, noting that \"business investment and exports have weakened amid failing manufacturing output.\"\n\nThe main reasons for this \"appear to be slower growth abroad and trade policy developments, two sources of uncertainty that we've been monitoring all year,\" Powell said.\n\nDavid Wessel, a senior fellow in economic studies at the Brookings Institute and the director of the Hutchins Center on Fiscal and Monetary Policy, told ABC News Wednesday prior to the Fed's afternoon announcement that, \"If you think about what the Fed does, it basically set the level of interest rates in the economy, when it lowers interest rates they hope that that makes it easier for people to borrow and makes it easier for people to spend money,\"\n\n\"Right now the economy seems to be in pretty good shape, but most of the Fed officials seem to be worried that it is slowing down too much, partly because of all the noise Trump is making about trade,\" he added. \"So they want to give the economy a little more gas.\"\n\nAndrew Caballero-Reynolds/AFP/Getty Images, FILE\n\n\"One thing to watch [Wednesday] is, yes, they are going to cut interest rates by a quarter of a percentage point, but unless you are a zillionaire that's not going to make a big difference,\" Wessel said.\n\nThe impact this move will have, however, on everyday people is that \"it means that it tends to get cheaper if you have a home equity loan, it tends to be cheaper to get a car loan.\"\n\nIt affects the bond market, according to Wessel, which means that mortgage rates come down.\n\nHowever, it also means savers will likely see \"less money on their market money funds.\"\n\n\"In short, lower rates help people and businesses who borrow and tend to hurt people who save,\" Wessel explained.\n\n\"The Fed's calculation here is that they want to help the borrowers a little more so borrowers will spend,\" he added. \"So the economy will keep growing.\"\n\nKrista Schwarz, a finance professor at the University of Pennsylvania's Wharton School, told ABC News that the last time the Fed lowered interest rates was in July, \"and in that time the 30-year fixed rate has come down about .2%,\" though other factors may have impacted that as well.\n\nInfighting in the Fed\n\nAnother thing economists are keeping an eye on Wednesday is what Federal Reserve Chairman Jerome Powell himself said during his afternoon news conference.\n\n\"There is actually quite a bit of disagreement in the Fed, there are some people who look over the horizon and say look manufacturing has been weak, business investment has been weaker than we thought, China is slowing down,\" Wessel said before the press conference. \"So as we look ahead we have to worry that some of our biggest customers are going to be buying less, so we have to offset that by cutting interest rates here.\"\n\n\"The other camp says, 'You guys are crazy, the economy is doing fine, and interests rates are low by historical standards,'\" Wessel said. \"So this is not the time to give the economy more gas, this is the time to sit and wait and see what happens.\"\n\nAn added complication to these disagreements is \"all the pressure from President Trump to cut interest rates.\"\n\nToday, \"a lot of focus is going on what Fed Chair Jerome Powell says they are going to do for the rest of the year,\" and more specifically, \"what they are going to do in the coming months and why.\"\n\n\"If you're not in the stock market and you're not in the bond market, you might not care about this stuff, but what happens in the bond market affects mortgage rates and what happens in the stock market affects how business heads feel and that can make them less likely to hire, less likely to invest,\" Wessel said.\n\n\"You know that everyone in the markets will be watching the body language carefully and listening to what led them to cut interest rates [Wednesday] and what they expect him to do in the future,\" Wessel said.\n\nAs for the current state of the economy, \"we've never gone this long before without a recession,\" according to Wessel. \"The economy has been growing every quarter since 2009.\"\n\nThe Fed's job today is to \"turn the dials on the economy, the ones that they can control, in order to keep that going.\"", "description": "An economist breaks down what the Fed's rate cut today could mean for your mortgage, car payment, savings and more.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Business/federal-reserve-building-gty-jc-181219_hpMain_2_16x9_992.jpg", "published_at": "2019-09-18"}