{"pub": "cbc", "url": "https://cbc.ca/news/politics/rcmp-violence-campaign-1.5305905", "downloaded_at": "2019-10-06 11:28:50.361684+00:00", "title": "Access Denied", "language": "en", "text": "The RCMP are compiling daily threat reports on online hate targeting federal political leaders during this election campaign, fearing it could spill over into real-world violence, sources tell CBC News.\n\nGovernment sources close to the file say there's been an increase in online posts condoning violence during this campaign — and one of the investigators' main areas of concern is the growing number of anti-immigration posts.\n\nBack in February, then-clerk of the privy council Michael Wernick issued a dire warning about hate on the campaign trail.\n\n\"I worry about the rising tides of incitements to violence when people use terms like 'treason' and 'traitor' in open discourse. Those are the words that lead to assassination,\" he said ahead of his testimony in front of the justice committee on the SNC-Lavalin affair.\n\n\"I'm worried that somebody is going to be shot in this country this year during the political campaign.\"\n\nSources, speaking on the condition of anonymity because they're not authorized to talk publicly about the issue, say the RCMP's protective intelligence unit combs through online chatter using key words and party leaders' names. Unit officers have been scanning both closed chatrooms and the \"dark web\" — corners of the internet accessible only to users with special software.\n\nMembers of the protective intelligence unit then flag troubling statements or threats to the leaders' security teams and tell them, based on IP addresses, whether the author of those statements is located close enough to the campaign itself to present a threat.\n\nHate, at its end, can result in death. So it is scary and it is real. ​​​​ - NDP Leader Jagmeet Singh\n\nSources said officers already have tracked down and spoken with people who have written death threats online against party leaders. They said that Liberal Leader Justin Trudeau is often a target.\n\nFor security reasons, the RCMP won't comment publicly on their tactics.\n\n\"Throughout the election campaign, the RCMP will undertake risk and threat assessments on an ongoing basis and adapt its security posture accordingly,\" said Cpl. Caroline Duval in an email to CBC.\n\n\"The RCMP does not investigate movements or ideologies but will investigate the criminal activity of any individuals who threaten the safety and security of Canadians.\"\n\nAs the incumbent leader, Trudeau is a lightning rod for hateful threats. He's not the only one, though.\n\n'It's disgusting'\n\nQuebec Conservative candidate Mariam Ishak said Montreal police offered her extra security after five of her campaign signs were defaced with anti-Semitic graffiti. She turned them down.\n\n\"I hope I won't have to get to that point,\" said Ishak, who was born in Cairo. \"That's not my community, that's not where I live. That's not how Pierrefonds-Dollard or the West Island is.\"\n\nSeveral of Conservative candidate Mariam Ishak's signs were defaced with swastikas. For now, she's turned down an offer of added security. (Dennis Cleary/CBC)\n\nFour of her signs were tagged with swastikas. Someone also slapped an anti-Semitic drawing over her face on a fifth sign — and covered it in clear tape to protect it from weather.\n\n\"I've never experienced something like that before,\" said Ishak, citing racist online attacks targeting her as a immigrant Canadian. \"But since I'm a candidate I'm getting several messages on Facebook that made me realize that, you know what? There is a problem there.\n\n\"It's disgusting. It hurts to see that. I think hate exists and we can see it rising.\"\n\nOttawa Liberal candidate Catherine McKenna has been the target of a lot of vitriol, both online and in person. In one instance she was verbally assaulted by a passerby while outside of a movie theatre with her children.\n\nMcKenna has taken the precaution of adding a security detail — a level of protection beyond what she would have received as environment minister.\n\nKaren McCrimmon, the Liberal candidate in Kanata-Carleton, filed a police report after seeing this homemade sign. Conservative candidate Justina McCaffrey denounced the sign and asked staff to remove her own lawn sign from the property. (Laurie Fagan/CBC)\n\nMcKenna's caucus colleague Karen McCrimmon filed a police report earlier this month after someone in her Kanata-Carleton riding put up a homemade sign which read, \"We shoot every third Liberal. Second one just left.\"\n\nAnd last weekend, violence erupted outside an event featuring People's Party of Canada Leader Maxime Bernier and Dave Rubin, an American YouTuber and political commentator.\n\nProtesters opposing the event stood outside with signs advocating for immigrant rights and yelling chants comparing ticketholders to Nazis. A scuffle occurred in the crowd of around 100 shortly before the event was scheduled to start. Hamilton police arrested and later released unconditionally four people from both sides of the protest.\n\nA peaceful protest outside an event for Maxime Bernier turned violent last weekend. Four people were arrested and then later released, according to Hamilton Police. (Justin Mowat/CBC)\n\n'People's lives are at risk': Singh\n\nAnatoliy Gruzd, director of the Social Media Lab at Ryerson University, said most hate online is steeped in anti-immigration rhetoric.\n\nAs the Canada research chair in social media data stewardship, he has been analyzing tweets tied to Canadian politics for months.\n\n\"The most troubling ones that were suspended by Twitter over the summer would be those making anti-Islamic statements, anti-immigration statements. So those have been proactively removed, but of course it's so easy to create a new account,\" he said.\n\n\"There is still concern that if conversations online [are] becoming more polarized and relying on misinformation and using hyper-partisan websites as a source to back up some of the ideas, if those conversations become polarized that can spill over to the physical world.\"\n\nA man in Montreal told NDP Leader Jagmeet Singh he would 'look like a Canadian' if he removed his turban. After shaking hands the man said he hopes Singh wins. 0:27\n\nNDP Leader Jagmeet Singh said he is acutely aware of how identity is playing out in this election.\n\nJust a few days ago, a man confronted him at a Montreal market urging him to \"cut off\" his turban to \"look like a Canadian.\" The elderly man later told Singh he hopes he wins the election.\n\nSingh said he hasn't experienced violence himself during the campaign, but it's a worry.\n\n\"I'm concerned for Canadians more than myself,\" he said in an interview with CBC before the market incident.\n\n\"It does mean people's lives are at risk. Hate, at its end, can result in death. So it is scary and it is real. We've got to do our best to tackle it in every element, denouncing it, denouncing policies and also trying to bring in place economic security for people.\"", "description": "The RCMP are compiling daily threat reports on online hate targeting the federal political leaders during this election campaign, fearing it could spill over into real-world violence, sources tell CBC News. One of their main concerns is anti-immigration online chatter.", "authors": [], "top_image": "https://i.cbc.ca/1.5307873.1570130319!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/fedelxn-liberals-20190927.jpg", "published_at": "2019-10-06"}