{"pub": "time", "url": "https://time.com/5685017/lucy-in-the-sky-true-story-lisa-nowak", "downloaded_at": "2019-10-03 23:26:14.446823+00:00", "published_at": "2019-10-03", "title": "The True Story Behind Lucy in The Sky", "language": "en", "text": "In 2007 the world was captivated by the sensational details surrounding an “astronaut love triangle”— turning the story into a media spectacle.\n\nThat story is the inspiration for Lucy in the Sky, a new film starring Natalie Portman which hits theaters Oct. 4 following its September premiere at the Toronto International Film Festival. The film is loosely inspired by the life of NASA astronaut Lisa Nowak, who was widely reported to have worn a diaper on a 14-hour cross country drive to confront the new flame of her former lover, becoming the first astronaut ever to be arrested.\n\nLucy in the Sky, the big-screen directorial debut of Fargo and Legion showrunner Noah Hawley, follows the downfall of the fictional astronaut Lucy Cola, who upon returning to earth from a space mission feels discontented with the smallness of her normal life. Lucy becomes obsessed with returning to space and becomes entangled in an affair with a handsome co-worker played by Jon Hamm. When things begin to fall apart professionally and personally for Lucy, she falls into an epic spiral that lands her in police custody. Fueled by jealousy and rage, Lucy is driven to madness when her NASA colleagues deny her an opportunity to participate in an upcoming mission.\n\nWhile Lucy in the Sky does reflect some major events in Nowak’s life, the film uses her strange real-life downfall more as a backdrop to a larger story about the psychological effects of space travel on astronauts—similar to what Apollo 11 astronaut Buzz Aldrin has described experiencing upon his return to Earth following his famous mission to the moon.\n\n“There was no goal, no sense of calling, no project worth pouring myself into,” Aldrin wrote in his autobiography Magnificent Desolation.\n\nLisa Nowak’s attorney, Donald Lykkebak, tells TIME in a statement that Nowak has had no desire to comment on the film that he describes as “an entirely fictional story and not based on reality.”\n\n“It should be noted that the movie is being advertised as ‘loosely based on the story of…’ Although that is the line they are using, the key word is ‘loosely.’ Lisa Nowak is not the ‘Lucy” in the movie,” Lykkebak says.\n\nHere’s a breakdown of the story that loosely inspired Lucy in the Sky.\n\nWho is Lisa Nowak?\n\nMission Specialist Lisa Nowak speaks at a post mission press conference July 17, 2006 at Kennedy Space Center in Florida. Philip Andrews-Getty Images\n\nLisa Marie Nowak was born on May 10, 1963, in Washington, D.C. Raised in Maryland, Nowak entered the U.S. Naval Academy in Annapolis, and in 1985 she graduated with a Bachelor of Science in aerospace engineering.\n\nIn 1996, Nowak was selected to be an astronaut at the Johnson Space Center in Houston, qualifying as a mission specialist in robotics. According to friends and family, Nowak was a dedicated mother and wife, who would have neighbors over for Easter brunches, and whose hobbies included bicycling, growing African violets and collecting rubber stamps. Friends and family said Nowak was deeply affected by the 2003 Columbia shuttle explosion, in which one of her best friends, Laurel Clark, died.\n\n“It’s devastating for everybody, and when it’s friends, people that you know, it’s even harder,” Nowak told NASA in a pre-mission interview in 2006. “Three of those people were in my class, that I knew very well. So that’s hard. But I remember on that day, sitting there with my son, and we’re both watching together everything’s that’s happening, and he reached over and took my hand and said, ‘Mom, I still want you to go.’ So, it’s a terrible tragedy to happen, but we know that there is a cause behind it and that we’re going to continue to follow that.”\n\nThree years after the explosion, Nowak went on her first mission—STS 121—in July 2006, aboard the space shuttle Discovery as a mission flight engineer, spending nearly two weeks in space.\n\nDespite all of her previous accomplishments, she may forever be known for a single night in February 2007, when Nowak took a 900-mile journey to confront her ex-lover’s new girlfriend.\n\nMost notably, according to a police report, Nowak told one detective she brought baby diapers on the drive to avoid pit stops, a claim that grew more florid in the retelling. Soon many media reports, not to mention late-night talk show monologues, were saying that she had been wearing a “Maximum Absorbent Garment”—an adult diaper that astronauts commonly use upon launch and re-entry—a story that was denied by Nowak’s attorney Donald Lykkebak, who called it “an absolute fabrication.”\n\nNowak was initially charged with attempted murder and kidnapping, but charges were eventually reduced to burglary and misdemeanors. Nowak pleaded guilty in 2009 and was sentenced to a year of probation. The following year, Nowak was discharged from the Navy. She now lives in Texas and works in the private sector.\n\nIn Lucy in the Sky, Lucy Cola follows a similar trajectory. Portrayed as a lifelong overachiever at the behest of her domineering grandmother (Ellen Burstyn), Cola’s competitive drive is what sets her apart from her peers. Upon returning from a space mission, she becomes obsessed with returning and begins training immediately. But she is distracted by a budding romance with Mark Goodwin (Hamm)—a love affair that leads her into a downward spiral.\n\nLucy’s competitive nature ultimately brings about her downfall. When she is rejected romantically and at work, she refuses to take “no” for an answer and takes extreme measures to set things “right.” As Portman plays the character, she is completely unaware of her erratic behavior and the way she is perceived by others.\n\nWho was involved in the astronaut love triangle?\n\nNot much is known about the exact nature of the real relationship between Nowak and William Oefelein. Nowak described it to police as “more than a working relationship but less than a romantic relationship.” Nowak was married to her husband Richard Nowak for 19 years. The pair had three children; at the time of her arrest, her son was a teenager and her twin daughters were 5 years old.\n\nWilliam Oefelein of NASA, left, and Lisa Nowak of NASA pose during winter training in Valcartier, Quebec, Canada, Jan. 21, 2004. Bloomberg via Getty Images\n\nNowak met Navy Cmdr. William Oefelein in 1996, and they trained alongside one another in the NASA space shuttle program. Oefelein told police the relationship began in 2004, before Nowak separated from her husband of 19 years, and ended before he began dating Colleen Shipman, a 30-year-old U.S. Air Force captain and engineer based at the Kennedy Space Center in Florida, in November 2006.\n\nOefelein, who described his relationship with Nowak as “somewhat exclusive,” told police he ended things with Nowak as his relationship with Shipman intensified. According to police, after going through Oefelein’s computer and finding romantic emails with Shipman, Nowak discovered Shipman’s travel plans. It was then that she decided to make the journey to Orlando to confront her.\n\nFollowing Nowak’s arrest, she was ordered to stop all contact with Oefelein. Nowak and her husband divorced in 2008, and in 2010, Shipman and Oefelein married and moved to Alaska, where they live with their son.\n\nIn Lucy in the Sky, Lucy and Mark’s relationship begins almost immediately after Lucy returns from space. Lucy has been married to her husband Drew (Dan Stevens) for six years. The pair had put off having children due to Lucy’s focus on advancing in her career, but they agree to try to have a child when she returns from her next mission. In the meantime, they help raise Lucy’s brother’s teen daughter, Blue Iris (Pearl Amanda Dickson).\n\nWhile training for a spot in the next space mission, Lucy is charmed by Mark, who has a reputation for philandering. The two slowly grow closer until Lucy is completely captivated by her co-worker. While Lucy is head-over-heels in love, Mark is shown to be more casual about their relationship.\n\nNatalie Portman and Jon Hamm are star-crossed lovers in Lucy in the Sky Photo Courtesy of Fox Searchlight Pictures\n\nUnlike Nowak, who never met Shipman until their confrontation, Lucy competes with her rival Erin (Zazie Beetz) for a qualifying position on an upcoming space mission. Lucy does not seem threatened by Erin until an awkward encounter reveals she and Mark are a romantic item.\n\nLucy’s life begins to unravel following several setbacks—including being rejected by a distant Mark—and things come to a head when she is told she is no longer being considered for a space mission and learns that Mark contributed to her rejection.\n\nLucy in the Sky gives its protagonist a less sinister motive than what police records allege happened in real life. Lucy does not seem to hold animosity towards Erin and never attempts to hurt her.\n\nThe infamous “diaper” drive\n\nAir Force Capt. Colleen Shipman testifies at the hearing for former NASA astronaut Lisa Nowak, Friday, August 24, 2007, at the Orange County courthouse in Orlando, Florida. Red Huber/Orlando Sentinel/Tribune News Service via Getty Images\n\nIn the early hours of Feb. 5, 2007, Nowak arrived in Orlando after making a 14-hour, 900-mile journey from Houston, armed with a steel mallet, BB gun, a 4-inch knife and large trash bags, according to the New York Times. Despite the already bizarre nature of the case, the detail that attracted the most headlines was the police report that Nowak carried, and used, baby diapers on her journey to save time by avoiding pitstops.\n\nDonning a dark wig, sunglasses and trench coat, Nowak approached Shipman in the parking lot of Orlando International Airport, following her on a bus and then onto a parking lot where she cornered her into her car, banging on her window claiming she needed help. When Shipman cracked opened the window, Nowak pepper-sprayed Shipman, according to police. Shipman drove away from the scene and alerted police, who found Nowak throwing her wig and BB–gun into a garbage can.\n\nWhen police arrested Nowak, she claimed her intention was to confront Shipman about her relationship with Oefelein, but prosecutors alleged Nowak had a well-thought-out plan to harm Shipman and charged her with attempted murder and kidnapping.\n\nDuring the trial, Shipman asked the judge to sentence Nowak to jail time, claiming Nowak had every intention of harming her. “She was going to kill me. It was in her eyes: a blood-chilling expression of limitless rage and glee,” Shipman said in court.\n\nAfter striking a plea deal, Nowak was sentenced to a year’s probation, community service and counseling. In one of her only public statements regarding the case, Nowak issued an apology to Shipman outside a Florida courtroom.\n\n“I know this has also been very hard for Colleen Shipman and I would like her to know how very sorry I am for having frightened her in any way and about the subsequent public harassment that has followed all of us,” Nowak told reporters.\n\nThe climax of Lucy in the Sky also involves the protagonist heading on an ill-fated interstate drive but with key differences from Nowak’s—mainly the exclusion of the headline-grabbing diapers. In the film, Lucy heads to the airport (in San Diego instead of Orlando) to confront Mark, not Erin. When Lucy tracks down Mark, she sees he is joined by Erin.\n\nErin(Zazie Beetz) and Natalie Portman (Lucy) play astronauts competing for a spot on an upcoming space mission in Lucy in the Sky Photo Courtesy of Fox Searchlight Pictures\n\nLucy follows Mark into the parking lot and is spotted by Erin, but instead of turning her anger towards Erin, she pepper-sprays Mark. Unlike Nowak, Lucy is also accompanied on her trip by her niece, who at one point hides a loaded gun from Lucy out of fear she might use it. Lucy’s ill-fated trip is fueled by her jealousy of Mark and Erin’s relationship, but her intention differs from that of Nowak, who confessed she meant to confront her ex-lover’s new girlfriend.\n\nAnyone with any knowledge of Nowak’s cross-country trip will be surprised to find that the film does not make mention of the infamous diaper detail. Many people on Twitter, after initial reviews came out of Toronto, lamented the absence of this feature of the story. Portman, the film’s star, addressed the lack of diapers in the film in an interview, saying that the film is not specifically based on Nowak’s life, just inspired by it.\n\n“It was an interesting detail because it was something that seemed so radical to all of us listening to it,” she told the Los Angeles Times. “But actually it’s part of an astronaut’s life. They wear diapers the whole time because that’s what you do in space. It’s not like it would be an unusual choice. It seems a lot nuttier if that’s not something you do every day. But I guess I still have a diaper movie in my future to fulfill everyone’s expectations.”\n\nWrite to Gina Martinez at gina.martinez@time.com.", "description": "The new movie directed by Noah Hawley and starring Natalie Portman is loosely inspired by the life of NASA Astronaut Lisa Nowak.", "authors": ["Gina Martinez"], "top_image": "https://timedotcom.files.wordpress.com/2019/09/lucynasa.jpg?quality=85&w=1200&h=628&crop=1"}