{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-russia-election-moscow/russias-ruling-party-loses-a-third-of-seats-in-moscow-election-after-protests-idUKKCN1VU0D7", "downloaded_at": "2019-09-09 11:45:41.486301+00:00", "title": "Russia's ruling party loses a third of seats in Moscow election after protests", "language": "en", "text": "MOSCOW (Reuters) - Russia’s ruling United Russia party, which backs President Vladimir Putin, has lost one third of its seats in the Moscow parliament, near complete data cited by Russian news agencies showed on Monday, in an awkward setback for the Kremlin.\n\nRussia's President Vladimir Putin speaks with journalists as he visits a polling station during the Moscow city parliament election in Moscow, Russia September 8, 2019. Sputnik/Alexei Nikolsky/Kremlin via REUTERS\n\nHowever, the party still retained its majority in the Moscow assembly following Sunday’s nationwide local elections, and its candidates for regional governor appeared to have won in St Petersburg and in 15 other parts of the vast country.\n\nThe outcome of the local elections was closely watched in Moscow after the exclusion of many opposition candidates triggered the biggest protests there in nearly a decade.\n\nPublic anger over more than five years of falling incomes and an unpopular hike in the pension age also helped fuel the Moscow protests, with the Communist Party benefiting most in Sunday’s polls from the discontent.\n\nPutin’s spokesman told reporters the Kremlin thought United Russia had done well despite the setback in Moscow.\n\n“In general the election campaign across Russia was very successful for the United Russia party. It won more in some places than others. But in general for the country the party showed its political leadership,” said the spokesman, Dmitry Peskov.\n\nThe Kremlin was not inclined to link the Moscow result to a protest vote, added Peskov.\n\nProminent opposition politician Alexei Navalny and his allies saw the Moscow poll as an opportunity to make inroads against United Russia ahead of a national parliamentary election in 2021.\n\nRelated Coverage Google, Facebook rebuff Russia over political advertising accusation\n\nTACTICAL VOTING\n\nNavalny’s close allies were among those excluded from the Moscow vote and he had advised supporters to vote tactically for the candidates with the best chance of defeating United Russia.\n\nHe saw the results as vindicating his strategy, though other activists were unhappy that he had asked people to hold their noses and vote for parties that cooperate with the Kremlin.\n\nUnited Russia was on track to control 26 of the Moscow’s parliament’s 45 seats, data showed, meaning it will not have to rely on the Communists, who in any case have often voted with the ruling party on major national issues to get things done.\n\nIn the last Moscow election in 2014, United Russia performed better, winning 28 seats in its own name and a further 10 through independent candidates whom it had backed.\n\nThe Communist Party won 13 seats on Sunday, up from five, at the expense of United Russia, the data showed. Two other opposition parties, the opposition Yabloko Party and the Fair Russia Party, appeared to have won three each.\n\nSeveral videos circulating on social media showed some voters openly stuffing ballot boxes with multiple voting slips.\n\nUnited Russia’s Moscow candidates rebranded as independents in an apparent effort to distance themselves from the party, whose popularity is at a more than decade-long low, a tactic that appears not to have paid off.\n\nLocal or regional elections took place on Sunday across all of Russia’s 11 time zones. United Russia also suffered a setback in an election for the Khabarovsk region’s local parliament in the Far East winning just two seats.\n\nBut the main focus was on Moscow, where the Central Election Commission refused in July to register a large number of opposition candidates, saying they had failed to collect enough signatures from genuine backers.\n\nRussian opposition leader Alexei Navalny stands near a ballot box at a polling station during the Moscow city parliament election in Moscow, Russia September 8, 2019. REUTERS/Tatyana Makeyeva\n\nThat decision triggered the biggest sustained protest movement in Russia since 2011-2013.\n\nPutin’s own popularity rating, at more than 60%, is much higher than most Western leaders, though lower than it has been previously. The former KGB officer won a landslide election victory last year that will keep him in office until 2024.", "description": "Russia's ruling United Russia party, which backs President Vladimir Putin, has lost one third of its seats in the Moscow parliament, near complete data cited by Russian news agencies showed on Monday, in an awkward setback for the Kremlin.", "authors": ["Andrew Osborn", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190909&t=2&i=1427830439&w=1200&r=LYNXNPEF880DK", "published_at": "2019-09-09"}