{"pub": "businessinsider", "url": "https://businessinsider.sg/a-24-year-old-singaporean-hacker-called-spaceraccoon-earned-over-s11000-for-finding-9-bugs-in-government-sites", "downloaded_at": "2019-10-01 11:45:19.880172+00:00", "title": "A 24-year-old Singaporean hacker called ‘spaceraccoon’ earned over S$11,000 for finding 9 bugs in Government sites", "language": "en", "text": "Unlike their malicious counterparts, white hat (or ethical) hackers use their skills to help companies test their online security. The New Paper\n\nSingapore’s cybersecurity agency (CSA) doled out over US$25,000 (S$35,940) to white hat hackers worldwide on Tuesday (Oct 1) as thanks for finding various bugs in Government systems that could result in sensitive data being leaked.\n\nUnlike their malicious counterparts, white hat (or ethical) hackers use their skills to help companies test their online security.\n\nSome 300 white hat hackers were recruited under a Government bug bounty programme organised by CSA, Singapore’s Government Technology Agency (GovTech) and HackerOne, a US-based bug bounty company, to scour nine Government systems for bugs between July 8 and 28, HackerOne said in a statement.\n\nTo participate, the hackers had to be registered and have their credentials checked. They also had to sign an agreement not to leak information about any vulnerabilities they found, The Straits Times previously reported.\n\nThey found 31 bugs, four of high severity and 27 of medium or low severity.\n\nOne-quarter of participating hackers were Singaporean, with the top hacker – a 24-year-old Singaporean known as “spaceraccoon” – single-handedly finding nine bugs, for which the Government paid US$8,500 (S$11,775).\n\nSeven of the top 10 hackers were from Singapore, HackerOne added.\n\nA earlier round of the bug bounty programme in March yielded 26 bugs, one of high severity, for which the Government paid US$11,000.\n\nA third round will be organised next month.\n\nHackerOne’s GovTech programme manager Fifi Handayani, said the Singapore Government saw value in maximising hacker engagement, and it is an Apac leader in using hacker-powered security solutions.\n\nRead also:", "description": "Business Insider - In all, The Government paid hackers over S$35,000 for finding 31 bugs.. Read more at businessinsider.sg", "authors": ["Rachel Genevieve Chia"], "top_image": "https://static.businessinsider.sg/sites/2/2019/10/20190321-hacking-generic-pic-NP.jpg", "published_at": "2019-10-01"}