{"pub": "scmp", "url": "https://yp.scmp.com/junior-reporters/top-10/article/114586/top-10-no-place-i%E2%80%99d-rather-be", "downloaded_at": "2019-10-30 02:24:39.208729+00:00", "title": "Top 10: No place I’d rather be", "language": "en", "text": "Kowloon City. If I lived there, it would be very easy for me to get to school. There are many buses that travel through the area, so it would be easy for me to visit other places in Hong Kong. Not only are there many restaurants to try in the area, too, but there are also some recreational parks where I can play sports in my free time.\n\nHo Siu-chung, 16, STFA Seaward Woo College\n\nI’d choose Cheung Chau because it is nice and quiet there. Sometime Hong Kong can be too fast paced, and I prefer a slower lifestyle. I also find walking on the beach very relaxing. If I lived in Cheung Chau I could go down to the beach whenever I’m feeling stressed.\n\nKenny Lee, 16, Fung Kai No. 1 Secondary School\n\nWho would be the best exchange student ever?\n\nI’d pick Wan Chai. It is Hong Kong’s oldest district and is well known as a creative arts hub. I find looking at art very relaxing and love looking at the graffiti art on the walls around the area.\n\nHu Ye-yan, 17, STFA Seaward Woo College\n\nI’d live in Mong Kok because it is in the centre of the city and a lot of people like going there for food and shopping. A lot of young people like hanging out in the area, so I would invite my friends over often. I prefer lively places like Mong Kok to quiet areas.\n\nRita Dai, 16, Fung Kai No. 1 Secondary School\n\nTai Po district is my favourite among Hong Kong’s many districts. There are many interesting places to visit in Tai Po, such as the Hong Kong Railway Museum, Tai Po Lookout Tower, and the Insect House. Tai Po is also great for people who love trekking and hiking like me.\n\nKimson Li, 15, Fung Kai Liu Man Shek Tong Secondary School\n\nWhich font suits your personality best?\n\nI have lived in Sha Tin since I was born, and my love for the area has grown over time. What makes Sha Tin so special is that there are many iconic buildings, such as the Hong Kong Heritage Museum and Che Kung Temple, that reflect our local culture.\n\nVenus Chan, 9, PLK Camoes Tan Siu Lin Primary School\n\nDefinitely Sai Kung. It has the perfect balance between crowded and peaceful; quiet and relaxing parks, and happy crowds around the seafood market. There are also unique snacks and drinks that you can only get in that area. That is why I find the area so special.\n\nKatie Lai, 16, Fung Kai Liu Man Shek Tong Secondary School\n\nI’d choose Tung Chung because it is close to the airport and convenient for when my family goes travelling. The apartments in the area seem very nice and they are close to Citygate Outlets, which has many good restaurants and shops.\n\nHo Lok-man, 14, Ng Yuk Secondary School\n\nWhat's the perfect piece of art for your room?\n\nYuen Long. There are a lot of farm in the area, and I haven’t experienced living in the countryside before. I don’t enjoy the hustle and bustle of the city. In Yuen Long, it will be nice and peaceful at night and I would be able to gaze up at the stars there.\n\nRainbow Tong, 14, Ng Yuk Secondary School\n\nI’d choose Sham Shui Po. There are many old buildings and shops, such as the Golden Computer Arcade, and old-fashioned barber shops that you don’t really find in other areas in the city. As a Hongkonger, I’d like to explore more about the city’s history and also learn more about its culture.\n\nRosanna Tung, 14, Law Ting Pong Secondary School", "description": "We asked our readers which part of Hong Kong they would like to live in. From slow-paced Cheung Chau to bustling Mong Kok, here are our favourite answers.", "authors": [], "top_image": "https://yp.scmp.com/sites/default/files/styles/900x506/public/images/aa0defd2-fa2c-11e9-acf9-cafedce87d15imagehires171709.jpg", "published_at": "2019-10-30"}