{"pub": "yahoo", "url": "https://finance.yahoo.com/news/3-monster-growth-stocks-keep-122550481.html", "downloaded_at": "2019-10-20 13:28:02.743500+00:00", "title": "3 Monster Growth Stocks That Will Keep Soaring in 2020", "language": "en", "text": "Which stocks are ready to take off in 2020? This is the question growth investors constantly have on their minds. However, finding these stocks that are primed for explosive growth is no simple task.\n\nThat’s where TipRanks comes in. Using the platform’s Stock Screener tool, I got access to market data that let me zero in on 3 stocks with strong long-term growth narratives.\n\nI’m putting these names at the top of my buy list based on their upside potential from the current share price. We’re talking 20% or more here. Not to mention each boasts a “Strong Buy” consensus rating, which is generated from all ratings assigned by Wall Street analysts over the last three months.\n\nHere are the 3 monster growth stocks poised to soar in 2020:\n\nL3Harris Technologies (LHX)\n\nL3Harris is a technology, defense and information services provider that designs C6ISR systems and products, wireless equipment and tactical radios. The company, which is a product of the Harris Corporation and L3 Technologies merger this past June, looks poised to deliver gains in 2020 on top of the 47% year-to-date growth it has already achieved.\n\nLHX has the advantage over other defense companies in that the merger has led to several synergies. For example, the combination of antennas from L3 and combined processing from Harris for avionics applications and the integration of Harris’ payloads on L3’s airborne platforms is expected to lead to an increase in revenue generation.\n\n4-star Morgan Stanley analyst Rajeev Lalwani also sees possible wins from the company's tactical radios that include Manpack, its electronics for F-35 and its electronic warfare for F-16 and F-18. All of this lends the analyst to his conclusion that LHX has “positioned itself as one of the better margin narratives in the industry”.\n\nLalwani rates LHX stock a \"buy\" along with $259 price target. If everything goes as planned, LHX will soar about 30% over the next 12 months. (To watch Lalwani's track record, click here)\n\n“Given above-average potential around sales growth, margin expansion, FCF generation, and capital returns, alongside a leadership team that has previously executed, we see no reason why the legacy HRS premium valuation should not be retained has previously executed, we see no reason why the legacy HRS premium valuation should not be retained,” Lalwani added.\n\nThe rest of the Street takes a similar approach when it comes to LHX. The defense stock sports a ‘Strong Buy’ analyst consensus and $238 average price target, indicating 20% upside potential. (See L3Harris stock analysis on TipRanks)\n\nFacebook (FB)\n\nFacebook has been a tear this year — with shares soaring 42% — and analysts say the gains may not be done yet.\n\nAhead of its upcoming Q3 earnings release, the Street is standing firmly in Facebook’s corner with both Barclays and Deutsche Bank recently publishing bullish calls.\n\nBased on each firm’s channel checks, demand for Facebook ads remains healthy. According to Deutsche Bank’s Lloyd Walmsley, data indicates that there wasn’t any ad spend deceleration from the second quarter and that same client spending improved for FB.\n\nAdding to the good news, Walmsley sees gains in store thanks to Instagram Checkout as well as the company’s focus on monetizing Instagram influencers. Instagram Checkout lets users easily buy products they discover on the social media platform. Its growing number of partners and the addition of new features like alerts is expected to contribute to impressive top-line results in 2020.\n\nStory continues", "description": "Which stocks are ready to take off in 2020? This is the question growth investors constantly have on their minds. However, finding these stocks that are primed for explosive growth is no simple task.That’s where TipRanks comes in. Using the platform’s Stock Screener tool, I got access to market data", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/mVxNCq7cFqWw1NMDR6.aYA--~B/aD01NjU7dz0xMTg5O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/tipranks_452/155f9610a0d3e1e491076afa2a4d020d", "published_at": "2019-10-20"}