{"pub": "reuters", "url": "https://af.reuters.com/article/worldNews/idAFKBN1WK072", "downloaded_at": "2019-10-05 12:27:36.385892+00:00", "title": "North Korean and U.S. negotiators meet to break nuclear stalemate in Sweden", "language": "en", "text": "A motorcade carrying North Korean delegation heads for Villa Elfvik on the island of Lidingo off Stockholm, Sweden, October 5, 2019. REUTERS/Anna Ringstrom\n\nSTOCKHOLM (Reuters) - U.S. and North Korean officials arrived to begin nuclear talks at an isolated conference centre on the outskirts of Stockholm on Saturday, in an attempt to end months of stalemate.\n\nThe meeting will be the first formal working-level talks since U.S. President Donald Trump and North Korean leader Kim Jong Un met in June and agreed to restart negotiations that stalled after a failed summit in Vietnam in February.\n\nPolice had closed off the approaches to the complex facing the Baltic Sea on the island of Lidingo, where the delegations led by U.S. Special Representative for North Korea Stephen Biegun and North Korea’s Kim Myong Gil were expected to meet.\n\nTwo motorcades entered the secluded centre early on Saturday with a police officer confirming one carried the North Korean officials. The other included cars used by Biegun when he met Swedish Foreign Ministry officials on Friday.\n\nThe delegation from North Korea, also known as the Democratic People’s Republic of Korea (DPRK), which is under sanctions banning much of its trade due to its nuclear programme, arrived in Sweden on Thursday after Pyongyang unexpectedly said talks would take place on Oct. 5.\n\nNewly-appointed Foreign Minister Ann Linde gave Sweden’s first acknowledgment of the negotiations, while a foreign ministry spokesman also confirmed the working-level talks.\n\n“I am encouraged that US and DPRK working level delegations are currently in Sweden to hold talks. Dialogue needed to reach denuclearisation and peaceful solution,” Linde said on Twitter.\n\nAnalysts have said the leaders of both countries face growing incentives to reach a deal, although it is unclear whether common ground can be found after months of tension and deadlock.\n\nOnly a day after announcing the resumption of talks, North Korea said it had test-fired a new ballistic missile designed for submarine launch, a provocative gesture that also underscored the need for Washington to move quickly to negotiate limits on Pyongyang’s growing arsenal.", "description": "U.S. and North Korean officials arrived to begin nuclear talks at an isolated conference centre on the outskirts of Stockholm on Saturday, in an attempt to end months of stalemate.", "authors": ["Anna Ringstrom", "Johan Ahlander", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191005&t=2&i=1437333337&w=1200&r=LYNXMPEF9406W", "published_at": "2019-10-05"}