{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/30/saudis-officials-struggle-to-keep-economic-reforms", "downloaded_at": "2019-10-01 00:12:59.000437+00:00", "title": "Saudis officials struggle to keep economic reforms on track after attack", "language": "en", "text": "Saudi Arabia economic officials are pushing to stay on track after devastating strikes just two weeks ago rocked the country’s oil industry, as the kingdom pushes ahead with new strategies to attract tourists, diversify the economy and restore and expand production of its primary export, oil, aiming to grow as a global power over the next decade.\n\nOn Friday, the country relaxed visa restrictions for nearly 50 other nations in what Saudi Arabia’s tourism minister Ahmed al-Khateeb called a “historic moment.”\n\nThe kingdom is loosening its notably strict dress codes for women who visit the country, the BBC reported, with the hope to boost its tourism rates from 3% to 10% by 2030. A giant resort city is being planned in an attempt to lure Western vacationers to a land with a reputation as a forbidding, alcohol-less place.\n\nFemale tourists are still required to dress conservatively but will no longer need to cover their bodies with traditional robes that are still required for Saudi citizens — a move intended to appeal to Western female travelers, Saudi officials has opened up the country’s borders to women traveling alone.\n\nThe tourism minister explained that he does not believe his industry will be impacted by the Sept. 14 attacks that briefly knocked out the world’s largest oil processing facility.\n\n“Our cities are among the most safest cities globally,” Mr. Khateeb said. “Therefore, we don’t believe at all it will impact our plans. We have all the expats living in Saudi Arabia, enjoying Saudi Arabia. We’re very secure.”\n\nBut the image questions and doubts about the limits of its economic liberalization plan have not dissipated. Wednesday marks the one-year anniversary of the killing of dissident, U.S.-based journalist Jamal Khashoggi by top agents of the Saudi government, and Riyadh received another blow Monday when the credit rating agency Fitch cut the kingdom’s sovereign credit rating from A+ to A, citing the tensions in the region and the vulnerability of key Saudi assets in the wake of the oil facility attacks.\n\nThe agency said in a note it believed “there is a risk of further attacks on Saudi Arabia, which could result in economic damage.”\n\nBut the Saudis say they have restored production lost in the Sept. 14 attack more quickly than many outside analysts had predicted, and Riyadh insists it will proceed with a closely watched public sale of stock in the state-owned oil giant Saudi Aramco, a centerpiece of hard-charging Crown Prince Mohammed bin Salman’s “Saudi 2030” modernization plan.\n\n“Anything relating to Aramco is tied to the Saudi 2030 plan,” Anthony H. Cordesman, a strategy expert for the Center for Strategic and International Security, told The Washington Times.\n\nSaudi Aramco is seeking $1 billion in bids from banks to finance projects following the attacks, according to Reuters. The company has not confirmed what projects the money will fund.\n\n“This is a critical priority for Saudi Arabia,” Mr. Cordesman said. “There’s a crisis. It is an opportunity, in an odd sense, to kind of monetize the damage, but it is not a sign that somehow the kingdom desperately needs $1 billion to support Aramco.”\n\nSaudi Aramco has said that its oil production capacity has bounced back to over 11 million barrels per day, equal to production levels before the attacks.\n\nWhile experts are confident that the company and industry can rebuild, Mr. Cordesman said it is unclear how much money and resources the Kingdom wants to invest in immediate affairs while the industry remains vulnerable to future attacks.\n\n“Everybody’s assuming this is over … [because] you put money into fixing something that’s proved vulnerable before you can improve the defenses,” he continued.\n\nBut new figures out Monday found that even before the attack, the Saudi economy was struggling to gain altitude. Government data Monday reported that economic growth slowed to just 0.5% in the second quarter of 2019, down from 1.66% in the first quarter of 2019 and from 2.2% growth in 2018.\n\nBut in a hopeful sign for the crown prince’s diversification program, the slowdown was attributed largely to oil shipment cuts. The no-oil Saudi economy expanded by almost 3% — the fastest pace in four years.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Saudi Arabia economic officials are pushing to stay on track after devastating strikes just two weeks ago rocked the country's oil industry, as the kingdom pushes ahead with new strategies to attract tourists, diversify the economy and restore and expand production of its primary export, oil, aiming to grow as a global power over the next decade.", "authors": ["The Washington Times Http", "Lauren Meier"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/27/Saudi_Daily_Life_31368.jpg-b7048_c0-164-3451-2176_s1770x1032.jpg?d6bcc28e13b335d1674db862375c12d5c286bd77", "published_at": "2019-09-30"}