{"pub": "usatoday", "url": "https://usatoday.com/story/sports/fantasy/2019/10/15/fantasy-football-waiver-wire-hunter-henry-jets-receivers-shine/3985251002", "downloaded_at": "2019-10-16 03:57:34.683332+00:00", "title": "Fantasy football waiver wire: Hunter Henry, Sam Darnold star in return from injuries", "language": "en", "text": "CLOSE Charles Curtis gives you four fantasy things to know for Week 7. USA TODAY\n\nInjuries can be brutal to fantasy football teams, depriving them of their best players at the most inopportune times. However, once players prove they're able to come back from injuries, they present buying opportunities that could help to turn a team's season around.\n\nLet's see who might be out there as Week 7 approaches.\n\nRecommended bids based on a free agent acquisition budget (FAAB) of $100 for the season.\n\nBEST BETS\n\nTE Hunter Henry, Los Angeles Chargers ($24): Henry returned to action Sunday night for the first time since suffering a knee injury in Week 1 and looked like he never missed a beat. He had eight catches for 100 yards and two touchdowns, looking all the while like he’s a TE1 going forward. Henry isn't available in all leagues, but if an owner in yours cut him to clear roster space, now is the time to pounce.\n\nLos Angeles Chargers tight end Hunter Henry scores a touchdown against the Pittsburgh Steelers. (Photo: Jake Roth, USA TODAY Sports)\n\nNFL power rankings: Texans rocket into top five, while Cowboys tumble from top half\n\nWeek 6 winners, losers: Cowboys at a crossroads while Chiefs searching for answers\n\nQB Sam Darnold, New York Jets ($9 – $20 in 2-QB formats): Darnold had also been out of action since the opening week of the season. He missed three games (and a bye week) recovering from mononucleosis, but returned in a big way – throwing for 338 yards and two touchdowns in leading the Jets to their first win. While Darnold may not look like a game-changer right now – especially with the top-ranked New England Patriots defense up next – the Jets schedule gets a lot easier the rest of the way.\n\nWRs Jamison Crowder and Robby Anderson, New York Jets ($12): Yes, we're going a little out of order on our values here, but neither of these guys should still be available in anything beyond the shallowest leagues. The soft schedule and the return of Darnold are obvious reasons to buy now. Crowder (six catches, 98 yards) is the possession guy, while Anderson (five receptions, 125 yards, TD) is the deep threat. Take your pick.\n\nRB Jamaal Williams, Green Bay Packers ($11): When he's healthy, Williams is a co-equal branch of the Packers' rushing attack with Week 5 star Aaron Jones. After missing the previous game with a concussion, Williams returned with a vengeance on Monday night, rushing for 104 yards and catching four passes for 32 yards and a touchdown. (Jones' early fumble may have altered the workload somewhat.)\n\nRB Adrian Peterson, Washington Redskins ($10): The ageless Peterson (OK, he's 34) registered season highs in carries (23) and rushing yards (118) in Week 6. Facing the winless Dolphins might have been a factor, but new coach Bill Callahan’s run-first philosophy will put the ball in Peterson’s hands much more often.\n\nREPLACEMENTS\n\nWR Jaron Brown, Seattle Seahawks ($6): Sunday’s surprise standout scored on two of his three receptions for 29 yards. The loss of TE Will Dissly to an Achilles injury could result in more targets for Brown going forward.\n\nRB Brandon Bolden, New England Patriots ($3): It’s always risky depending on a Patriots running back, but Bolden racked up 45 total yards and scored a touchdown for the third consecutive week. He could be a helpful bye-week filler.\n\nRB Mark Walton, Miami Dolphins ($2): It’s even riskier depending on a Dolphins running back, but Walton has been getting regular work lately. Against the Redskins, he had six carries for 32 yards and five catches for 43 more.", "description": "Returning to action for first time since Week 1, Chargers tight end Hunter Henry and Jets QB Sam Darnold are creating value for fantasy owners.", "authors": ["Steve Gardner", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/16/USAT/ede577fd-7098-4d96-9f28-be3ddec98ad0-USATSI_13513184.jpg?crop=2808,1580,x0,y108&width=3200&height=1680&fit=bounds", "published_at": "2019-10-15"}