{"pub": "realclearpolitics", "title": "Drug makers conspired to worsen the opioid crisis. They have blood on their hands | Chris McGreal", "url": "https://theguardian.com/commentisfree/2019/aug/29/opioids-crisis-drug-makers-pharma", "language": "en", "published_at": "2019-08-29", "downloaded_at": "2019-09-03 01:02:14.977927+00:00", "text": "Johnson & Johnson came out swinging after an Oklahoma judge ruled this week that the company has blood on its hands for driving America’s opioid epidemic.\n\nOxyContin maker offers up to $12bn to settle more than 2,000 opioid claims Read more\n\nThe pharmaceutical giant tried to blame Mexicans, doctors and, inevitably, the victims themselves for the biggest drug epidemic in the country’s history. Its lawyers reframed a corporate engineered tragedy that has escalated for two decades, and claimed more than 400,000 lives, as a “drug abuse crisis”, neatly shifting responsibility from those who sold prescription opioids to those who used them.\n\nJohnson & Johnson painted itself as a victim of unwarranted smears by grasping opportunists trying to lay their hands on its money when all the company wanted to do was help people.\n\nJudge Thad Balkman wasn’t having it. After hearing nearly two months of evidence, the Oklahoma judge’s damning verdict placed Johnson & Johnson squarely at the forefront of what can only be called a conspiracy by opioid manufacturers to profit from addiction and death.\n\nBalkman found that the company’s “false, misleading, and dangerous marketing campaigns have caused exponentially increasing rates of addiction, overdose deaths”. He said the drug maker lied about the science in training sales reps to tell doctors its high-strength narcotic painkillers were safe and effective when they were addictive and had a limited impact on pain.\n\nOklahoma’s attorney general, Mike Hunter, called the marketing strategy “a cynical, deceitful multimillion-dollar brainwashing campaign” to pressure doctors into prescribing narcotic painkillers even as the death toll mounted.\n\nBalkman also found that Johnson & Johnson was part of a wider collaboration by opioid makers to change medical policy in the US by creating the illusion of an epidemic of untreated pain to which opioids were the solution. The result was a surge through the 2000s in the prescribing of narcotic painkillers as a long-term treatment for even minor pain, with no proper study of the claims made for the drugs or the consequences.\n\nThe ruling is the most significant since Purdue Pharma pleaded guilty to criminal charges in 2007 and paid a $600m fine over the marketing of its high-strength opioid OxyContin, which played a major role in firing up the epidemic.\n\nThe two cases are striking in their similarity. Much of what Balkman found about Johnson & Johnson’s methods echoed those of Purdue in its conviction 12 years ago. That in itself is indicative of how little a central lesson of the epidemic – that corporations should not be allowed to take control of medical policy – was learned after Purdue’s conviction. The opioid industry went on much as before.\n\nAnd even now, amid a flood of lawsuits and financial settlements, there is little evidence that lesson is being applied. Purdue continued its old ways for years and is only now being held to some kind of account with the revelation this week that its owners, members of the Sackler family, have offered to give up control of the company and some of the profits they made from OxyContin as part of a settlement worth up to $12bn.\n\nAt the heart of the opioid crisis is the structure of American healthcare. It is less of a service than an industry with corporations – drug makers, insurance companies, hospital chains – wielding considerable influence over medical policy and the provision of treatment.\n\nSenator Joe Manchin has described the flooding of his state, West Virginia, with millions of prescription opioids as a business strategy: “It’s an epidemic because we have a business model for it. Follow the money.”\n\nIt was a business model the industry was free to pursue because its vast wealth kept sceptical parts of the medical profession, regulators and politicians at bay. And when the opioid profiteers did run into trouble, they bought their way out with little accountability or change.\n\nPurdue, Johnson & Johnson and other opioid makers used their huge resources to shape a policy that made opioids the default treatment for pain. They funded ostensibly independent professional organisations that were instrumental in the introduction of policies that led hospitals and clinics to strong-arm doctors into prescribing narcotics. Medical policies shaped by industry marketing departments took precedence of the judgment of doctors.\n\nAlmost unbelievably, it was taken as normal that sales reps with no medical background would “educate” primary care doctors, who received little training in the treatment of pain. Johnson & Johnson, Purdue and others exploited that gap to send in their reps waving manipulated studies and thin data to reassure doctors there was little risk of addiction from prescription opioids. Never was there a proper discussion of addiction itself. The sales reps weren’t trained to do that.\n\nWhen the alarm bells began to ring as addiction and overdoses rose, those same companies kept the floodgates of mass prescribing open by buying the complicity of Congress and compliance of the American Medical Association. The din of money drowned out the many warnings about the devastation being wrought as the industry fought back by creating the myth of an epidemic of untreated pain and forged a false moral argument that the “addicts” should not be permitted to take opioids away from “legitimate” pain patients.\n\nWhen occasionally the regulators and prosecutors intruded, opioid makers bought their way out of a public accounting by paying millions of dollars to settle cases without admitting liability. That has been going on so long it’s regarded as the cost of doing business. And it’s not restricted to opioids.\n\nSix years ago, Johnson & Johnson and its pharmaceutical subsidiaries paid more than $2bn to head off criminal charges and civil suits for illegally pushing three of its drugs to doctors for uses for which they were not approved as well as paying bribes to physicians to prescribe them. As with Purdue in 2007, the settlement required the company to sign a Corporate Integrity Agreement which was supposed to ensure federal oversight of Johnson & Johnson’s marketing.\n\nIn practice, the payments and oversight changed little. The epidemic rolled on and grew.\n\nNeither was it just the manufacturers. Opioid distributors – some of the largest corporations in the US if not the most widely known – have paid hundreds of millions of dollars to the justice department to avoid trials for repeatedly failing to obey the law. Their response to being held accountable was to use their political clout to avoid criminal prosecutions and pressure Congress to weaken the Drug Enforcement Administration’s powers to regulate opioid deliveries.\n\nSo what has changed? There has been some financial accounting. Purdue Pharma is a shell of the company it once was. Other drug makers may struggle to survive or take a big hit to their profits to stay out of court. A few executives may go to prison.\n\nBut as Johnson & Johnson’s response shows, the opioid makers don’t think they’ve done anything wrong. They certainly don’t take responsibility for launching a prescription pill epidemic that morphed into a heroin and fentanyl crisis as well.\n\nThe pharmaceutical industry remains influential over medical policy and practice, and continues to spend more than any other business on lobbying Congress. The drug makers still defend profits at the expense of patients. Just ask those Americans forced to go to Canada to buy the insulin they can’t afford at home.\n\nReform of the system that made the opioid epidemic is still a long way off. Much easier to blame the Mexicans.", "description": "Johnson & Johnson and others profited from addiction and death – and yet they still don’t think they’ve done anything wrong", "authors": ["Chris Mcgreal"], "top_image": "https://i.guim.co.uk/img/media/cfb7d29bc3fe7be9924a7c80900e9a0813afa48d/0_0_6433_3860/master/6433.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=8063a77290999427bd36ef2ba420be50"}