{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7532329/Cardi-B-reveals-shes-returning-big-screen-film-debut-Hustlers-enjoy-checks.html", "downloaded_at": "2019-10-05 06:18:03.929083+00:00", "title": "Cardi B reveals she's returning to the big screen after her film debut in Hustlers: 'I enjoy checks'", "language": "en", "text": "After earning rave reviews for her feature film debut in Hustlers, Grammy-winning rapper Cardi B revealed she will be continuing to further her acting career.\n\nThe 26 year old Yellow Bodak singer appeared on Ellen on Thursday, along T.I. and Chance the Rapper, her fellow judges on Netflix's reality music series Rhythm + Flow, debuting October 9.\n\nWhile Cardi didn't seem to enthusiastic about all the trappings of life on the set, when Ellen asked if she was going to act again, she coyly said, 'Oh yes I am.\n\nCardi the actor: After earning rave reviews for her feature film debut in Hustlers, Grammy-winning rapper Cardi B revealed she will be continuing to further her acting career\n\nEllen said she couldn't let Cardi go without telling her how fantastic she was in Hustlers, which earned nearly $100 million worldwide from a $20 million budget.\n\nWhen asked if she enjoyed her time on the set, Cardi said, ' I enjoyed it, and I just couldn't believe I was on set for like 16 hours and then like... is this what actors gotta go through?'\n\nShe added, 'Artists, we have long days but it's just full of excitement, like we move around we're doing something. Like, you gotta wait in the trailer until it's your turn, you gotta do the same scene like 20 times.'\n\nFantastic: Ellen said she couldn't let Cardi go without telling her how fantastic she was in Hustlers, which earned nearly $100 million worldwide from a $20 million budget\n\nBut, when Ellen said, 'you're not going to do that again aren't you, the rapper said, 'Oh yes I am. Yup. I am going to film for a movie this month.'\n\nWhen Ellen mentions that Cardi just said she didn't enjoy the process of acting, Cardi melodically stated, 'I enjoy the checks.'\n\nWhen asked if she did Rhythm and Flow for the check, she said yes, and T.I. and Chance appeared to agree, but she went on to elaborate a bit.\n\nRhythm and Flow: When asked if she did Rhythm and Flow for the check, she said yes, and T.I. and Chance appeared to agree, but she went on to elaborate a bit\n\n'We did it for the check, but once we were there... you know something, I grew a connection to the contestants. I was really emotional the last day. I was so sad.'\n\nT.I. said that they, 'came for the check but stayed for the artists,' while Cardi added that she felt bad because she, 'crushed a couple of people's dreams.'\n\nThe trio serve as the main judges of Netflix's Rhythm + Flow, the streaming service's first hip-hop competition series, with new episodes available every Wednesday.\n\nJudges: The trio serve as the main judges of Netflix's Rhythm + Flow, the streaming service's first hip-hop competition series, with new episodes available every Wednesday\n\nThe judges also played a rousing game of Never Have I Ever, where Ellen asked for 'complete honesty' from the judges.\n\nEllen didn't pull any punches either, asking if any of them have hooked up with a fan, with only T.I. claiming he had, until Cardi clarified.\n\n'Well, my husband (Offset) said he was a fan of me before he met me, so I have,' she said.", "description": "After earning rave reviews for her feature film debut in Hustlers, Grammy-winning rapper Cardi B revealed she will be continuing to further her acting career.", "authors": ["Brian Gallagher For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/03/07/19240472-0-image-a-107_1570083423793.jpg", "published_at": "2019-10-03"}