{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/26/wizards-head-into-training-camp-with-injuries-see-opportunity", "downloaded_at": "2019-09-26 20:48:03.877876+00:00", "title": "Wizards head into training camp with injuries, but see opportunity", "language": "en", "text": "\n\nWizards first-round pick Rui Hachimura, who played for his native Japan during the FIBA World Cup this summer, won't be on a minutes watch in training camp, according to GM Tommy Sheppard. (Lintao Zhang/Getty Images)\n\nWashington Wizards guard Isaiah Thomas stood outside the arena one recent morning around 7:15, pausing briefly on his way an informal workout, when one of the team’s rookies arrived behind him.\n\n“Why are you late?” the veteran asked, according to a story Wizards first-year General Manager Tommy Sheppard recounted Thursday afternoon during a session with local media at Capital One Arena.\n\nFollowing thumb surgery a little more than a week ago, Thomas won’t be available during training camp, which begins Tuesday, but he is out of his cast and wearing a splint, Sheppard said. He’s also been contributing in other valuable ways, most notably with professionalism and leadership for a roster filled with new, youthful pieces.\n\n[New GM Tommy Sheppard seeks players who will follow ‘The Wizards Way’]\n\nIn addition to Thomas, the Wizards go into camp, which begins next week, with a handful of rotational players nursing ailments preventing them from practicing.\n\nThat includes C.J. Miles, who underwent a procedure in July to repair a stress fracture in his left foot and is out indefinitely, although Sheppard indicated the forward has been participating in noncontact shooting drills.\n\nMore recently Troy Brown Jr. strained his left calf, the team announced, during a routine workout Monday and is expected to miss approximately a month.\n\n“I think the neatest thing is the players themselves [saying], ’Hey, next man up,’ ” Sheppard said. “Give somebody else an opportunity to shine. I think we have some interesting players that we acquired from the Lakers this summer that kind of joined us midstream, summer league, and that’s basically organized pickup.\n\n“You don’t have a great idea of what they’re like, so now you have with Mo Wagner, with Isaac Bonga, with Jemerrio Jones, you’ve got some opportunities to let those guys loose a little bit more in camp, get them a little bit more reps at their positions.”\n\nSheppard also mentioned Justin Robinson, whom the Wizards signed to a partially guaranteed contract after the former Virginia Tech point guard went undrafted on the heels of a record-setting career in Blacksburg, Va.\n\nRobinson finished as the Hokies’ career leader in assists despite missing a dozen games last season with a nagging foot ailment.\n\nHe came back in time for the first game of the NCAA tournament and helped Virginia Tech reach the round of 16, where the Hokies, seeded fourth in the East Region, narrowly lost to No. 1 seed Duke, 75-73.\n\nThe game took place at Capital One Arena, allowing Sheppard to get another firsthand look at Robinson, who grew up in Manassas, Va., in a family that owned Wizards season tickets.\n\n“The only time I saw him lose was in this building last year, and I remind him of that all the time, the Duke game,” Sheppard said. “But Justin wins. He’s a winner.”\n\nSheppard said the same of first-round pick Rui Hachimura, who went to the Final Four with Gonzaga.\n\nThe Japanese sensation had a busy offseason, including playing for his native country in the FIBA World Cup in Shanghai. His tournament, however, ended after three games because of knee discomfort and general fatigue, but, according to Sheppard, he won’t be on a minutes watch during training camp.\n\nHachimura participated in a pickup game Wednesday, Sheppard said, without any lingering effects in his knee, remaining on the court the entire time.\n\n“He’s in good shape,” Sheppard said. “I think there’s an overall perspective we’re bringing in from a sports science area to really, I’m not even going to use the two dirty words in sports right now — load management — but I think what we’re going to try to do is really be intelligent about how we work through the preseason and how we’re going to work through the season.”\n\nRead more:\n\nAdam Silver on NBA’s stricter tampering rules: Fans ‘were losing confidence in our system’\n\nScott Brooks and 4 other NBA coaches who could soon be on the hot seat\n\nNBA fines Bucks for tampering with Giannis Antetokounmpo, who is on the Bucks\n\nTrump teases that he’d like to visit India to watch an NBA game next month\n\nAfter free agency free-for-all, NBA implements stiffer tampering rules", "description": "First-year GM Tommy Sheppard provided updates on a few injured players and how it will affect the preseason.", "authors": ["Gene Wang", "Sports Reporter Covering Local", "National College Football", "September At Pm", "Gene Wang Is A Sports Reporter Covering Multiple Beats", "Including Virginia", "Virginia Tech Football", "Basketball", "The Wizards", "Boxing"], "top_image": "https://www.washingtonpost.com/resizer/8l8H8NkU2fNcA9T6zg-L2FZ996c=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5TJRYTGP7UI6TJRABKIWK3L5WY.jpg", "published_at": "2019-09-26"}