{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/14/report-syrian-troops-enter-town-close-to-turkeys-b", "downloaded_at": "2019-10-14 11:29:16.595564+00:00", "title": "Syrian army moves to confront Turkish forces as U.S. withdraws; Kurds reach deal with Damascus", "language": "en", "text": "DAMASCUS, Syria (AP) — Syria’s army deployed near the Turkish border on Monday, hours after Syrian Kurdish forces previously allied with the U.S. said they had reached a deal with Damascus to help them fend off Turkey’s invasion.\n\nThe announcement of a deal between Syria’s Kurds and its government is a major shift in alliances that came after President Trump ordered all U.S. troops to withdraw from the northern border area amid the rapidly deepening chaos.\n\nThe shift sets up a potential clash between Turkey and Syria and raises the specter of a resurgent Islamic State group as the U.S. relinquishes any remaining influence in northern Syria to President Bashar Assad and his chief backer, Russia.\n\nOn Monday morning, Syria’s state news agency said that the army had moved into the town of Tal Tamr, which is about 20 kilometers (12 miles) from the Turkish border.\n\nSANA said government forces would “confront the Turkish aggression,” without giving further details. Photos posted by SANA showed several vehicles and a small number of troops.\n\nTal Tamr is a predominantly Assyrian Christian town that was once held by IS before it was retaken by Kurdish-led forces. Many Syrian Christians, who make up about 10 percent of Syria’s pre-war population of 23 million, left for Europe over the past 20 years, with the flight gathering speed since the country’s conflict began in March 2011.\n\nSANA did not say from which area the Syrian army had moved into the town.\n\nDespite widespread criticism from its NATO allies in Europe and the U.S., Turkey has pressed on with its offensive into northern Syria.\n\nTurkish forces appeared set to launch an operation on the town of Manbij farther west on Monday, according to CNN-Turk, which said the forces had reached the city’s edge.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Syria's army deployed near the Turkish border on Monday, hours after Syrian Kurdish forces previously allied with the U.S. said they had reached a deal with Damascus to help them fend off Turkey's invasion.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/14/turkey_us_syria_37688_c0-193-3200-2059_s1200x700.jpg?b8df03b62988acbc176e31e0ad5ea4b48875fce3", "published_at": "2019-10-14"}