{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/activist-group-targets-palantir-over-controversial-ice-raid-2019-10", "downloaded_at": "2019-10-03 23:39:11.095904+00:00", "published_at": "2019-10-03", "title": "Palantir's tech was used by ICE in the controversial arrests of 680 people at a Mississippi chicken farm according to an immigrants' rights group", "language": "en", "text": "Immigration activist group Mijente is about to publish a blog post accusing Palantir of supplying tech used in ICE's biggest workplace raid this summer.\n\nThe group believes Palantir tech was used during the controversial raid on chicken processing plants where 680 immigrants were arrested.\n\nMijente has been pounding the drums over Palantir's use by ICE, even as Palantir has insisted that its tech is used by a different group within ICE that is not responsible for deportations or family separations at the border.\n\nMijente's pressure campaign appears to be having some success. Employees at Palantir have signed at least two letters asking management to adopt new policies concerning its ICE contracts.\n\nVisit Business Insider's homepage for more stories.\n\nImmigrant rights group Mijente has led the charge to stop Palantir, a $20 billion Silicon Valley tech firm, from selling its software to the Immigration and Customs Enforcement (ICE).\n\nPalantir is the big data software company founded by Donald Trump supporter Peter Thiel.\n\nMijente says that on Friday it will publish a blog post about Palantir technology being used by ICE agents as part of the largest US immigration raid in a decade. The raid, which occurred in August, targeted a Mississippi chicken processing plants and resulted in the arrests of 680 migrant workers.\n\nThat incident was controversial not just for its size — and the widely-circulated video of a crying 11-year-old girl whose father was detained — but because of its timing. It occurred hours before President Trump arrived in El Paso, Texas. He was visiting the city days after an anti-immigrant, white nationalist killed 22 people at a Walmart.\n\nPalantir has been providing ICE with software since 2014. ICE renewed its contract with Palantir in August, a contract that will run through 2020, Motherboard reported at the time. Palantir has repeatedly denied that its technology is being used by the part of ICE that handles family separations and deportations.\n\nA spokesperson told the New York Times in December that its contracts support a different part of the agency:\n\n\"There are two major divisions of ICE with two distinct mandates: Homeland Security Investigations, or H.S.I., is responsible for cross-border criminal investigations. The other major directorate, Enforcement and Removal Operations, or E.R.O., is responsible for interior civil immigration enforcement, including deportation and detention of undocumented immigrants. We do not work for E.R.O.\"\n\nEven so, back in 2017, the Intercept reported that Palantir tech was being used to assist ICE with tracking immigrants and deporting them.\n\nThe Mississippi connection\n\nMijente believes that Palantir's tech assisted with the controversial August raid in Mississippi thanks to an affidavit from an HSI investigator requesting a search warrant for the raid.\n\nIn that affidavit, the investigator describes using the agency's \"tipline\" and a database system to find and identify immigrants believed to be working at the plant illegally. Mijente say it has documents that show the tipline is part of a special product that Palantir built for ICE.\n\nMijente has been using such evidence to call on other like-minded activists to pressure Palantir to drop their Ice contracts. As Business Insider's Rosalie Chan reported in August, this includes organizing protest marches at the company's Palo Alto, California headquarters.\n\nMijente has also participated in protests of Amazon Web Services, the cloud service used by Palantir.\n\nThe protests are having an effect. Some employees have mixed feelings about the company's work with ICE. In August more than 60 Palantir employees signed a petition asking management to redirect profits from ICE contracts to a nonprofit charity, the Washington Post reported. And last year, over 200 employees reportedly signed a letter expressing their displeasure with the situation.\n\nICE is not Palantir's only contract with the federal government. It currently has over $160 million worth of contracts from multiple agencies including the DoD, Treasury and others.\n\nIn July, Palantir cofounder Joe Lonsdale described Palantir as \"patriotic.\"\n\nThere had been some talk that Palantir might try for an IPO soon, though word is that it has paused that idea and is working on raising another round of private funding instead.\n\nPalantir declined comment.", "description": "Immigration activist group Mijente has been pressuring Palantir to stop selling its software to ICE. It just found a new reason to protest.", "authors": ["Julie Bort"], "top_image": "https://image.businessinsider.com/5d967dc4754caa0448283d13?width=1200&format=jpeg"}