{"pub": "washingtonpost", "url": "https://washingtonpost.com/transportation/2019/10/25/th-annual-marine-corps-marathon-is-sunday-heres-what-you-need-know/?arc404=true", "downloaded_at": "2019-10-27 00:00:13.522703+00:00", "title": "The 44th annual Marine Corps Marathon is Sunday. Here’s what you need to know.", "language": "en", "text": "\n\nRichard Sames of Laredo, Tex., rallies spectators as racers pass near the Lincoln Memorial during the 2018 Marine Corps Marathon. (Matt McClain/The Washington Post))\n\nThe 44th annual Marine Corps Marathon, one of the biggest street events in the Washington region, is Sunday and whether you plan to participate or watch, there are lots of things you need to be aware of — from street closings to parking restrictions to Metro hours.\n\nAbout 30,000 people will participate in 26.2-mile race that starts and ends in Arlington and takes runners across the Potomac River into Georgetown, Rock Creek Park and the Mall area. Thousands of supporters are expected to cheer them on from the sidewalks.\n\nThe event will make driving and parking challenging Sunday. Anyone who drives near or within the marathon’s perimeter Sunday should consider other alternative transportation or routes.\n\nMetro will open two hours early to accommodate marathon crowds, and it will have extra trains. See more details below.\n\nRunners and spectators should prepare for some unsettled weather Sunday morning. The Capital Weather Gang is forecasting temperatures in mid-50s to start the race, and cloudy conditions with intermittent showers, with temperatures rising into the 60s by mid-to-late morning. Keep an eye out for a more detailed forecast closer to Sunday.\n\n[Showers could dampen World Series Game 4 and Marine Corps Marathon]\n\nThis map will help you explore the 2019 Marine Corps Marathon racecourse. Keep reading for more travel tips and a full list of the street closings.\n\nRace route Road closure Mile marker First aid 1 Water station Food station MARATHON COURSE D.C. FINISH START Potomac River Runners Village VIRGINIA 1/2 MILE MCM50K COURSE FINISH START MCM10K COURSE START FINISH Sources: Marine Corps Marathon, WMATA THE WASHINGTON POST Race route Road closure Mile marker First aid 1 Water station Food station MARATHON COURSE M ST. NW 3rd ST. NW D.C. CONSTITUTION AVE. NW FINISH INDEPENDENCE AVE. SW START Runners Village Potomac River VIRGINIA 1/2 MILE MCM50K COURSE MCM10K COURSE START FINISH FINISH START 1/2 MILE Sources: Marine Corps Marathon, WMATA THE WASHINGTON POST Race route Road closure Mile marker First aid Water station Food station 1 MARATHON COURSE Georgetown 6:30 a.m. to noon Eastbound Lee Highway/ Spout Run/G.W. Parkway 6:30 a.m. to noon D.C. M ST. NW Rock Creek and Potomac Parkway 6 a.m. to 11:30 a.m. 3rd ST. NW Key Bridge 6:30 a.m. to noon G St. NW West Potomac Park roads 6:30 a.m. to noon Rosslyn 3:30 a.m. to 6 p.m. FINISH Madison and Jefferson Drives 4 a.m. to 1:30 p.m. Potomac River OHIO DR. SW Route 110 from I-66 to Route 1; 3:30 a.m. to 6 p.m. START Runners Village East Potomac Park Pentagon VIRGINIA Ohio Drive 6:30 a.m. to noon Crystal City 6:30 a.m. to 4 p.m. 1/2 MILE MCM50K COURSE MCM10K COURSE START FINISH FINISH START 1/2 MILE Sources: Marine Corps Marathon, WMATA THE WASHINGTON POST Race route Road closure Mile marker First aid Water station Food station 1 MARATHON COURSE D.C. Eastbound Lee Highway/ Spout Run/G.W. Parkway 6:30 a.m. to noon Georgetown 6:30 a.m. to noon M ST. NW Rock Creek and Potomac Parkway 6 a.m. to 11:30 a.m. Key Bridge 6:30 a.m. to noon 3rd ST. NW G St. NW West Potomac Park roads 6:30 a.m. to noon Rosslyn 3:30 a.m. to 6 p.m. wilson blvd. FINISH Madison and Jefferson Drives 4 a.m. to 1:30 p.m. Potomac River OHIO DR. SW START Route 110 from I-66 to Route 1; 3:30 a.m. to 6 p.m. Runners Village East Potomac Park VIRGINIA Pentagon Ohio Drive 6:30 a.m. to noon Crystal City 6:30 a.m. to 4 p.m. 1/2 MILE MCM50K COURSE MCM10K COURSE START FINISH FINISH START 1/2 MILE Sources: Marine Corps Marathon, WMATA THE WASHINGTON POST\n\nThe event\n\nThe marathon officially starts at 7:45 a.m. The start line is on Route 110 in Arlington County between the Pentagon and Arlington Memorial Drive. The course remains open until 3 p.m. The Finish Festival, where runners meet up with their supporters, is in the area around Wilson Boulevard and North Lynn Street in Rosslyn. This is close to the Rosslyn Metro station. The Finish Festival ends around 4 p.m.\n\nOrganizers have added an ultramarathon this year, the MCM 50K, for racers willing to complete an extra 4.87 miles on top of the marathon’s 26.2. Ultramarathoners will start at 7:30 a.m. and will cover the entire MCM course with the addition of a 4.87-mile diversion at mile 4.5.\n\nOther events include a 10K that will take participants from the National Gallery of Art to the Marine Corps War Memorial. There also is a 1-mile “just-for-fun running challenge” that attracts about 3,600 children each year. The Kids Run on Saturday is held at the Pentagon parking lot.\n\nA packet pickup and health and fitness expo will be held at the Gaylord National Resort starting Friday. This will add traffic to the area around National Harbor in Prince George’s County.\n\nGetting there\n\nMetro. Metro will open at 6 a.m., two hours early, for the marathon.\n\nThe closest Metro station to the marathon start line is Pentagon station on the Blue and Yellow lines. To avoid crowds, runners can use Pentagon City station, also on the Blue and Yellow lines.\n\nArlington Cemetery station doesn’t open until 8:30 a.m., after the marathon is underway. The Rosslyn station, on the Blue, Orange and Silver lines, is within walking distance of the finish line.\n\nMetro will run additional Blue Line trains between Franconia-Springfield and Stadium-Armory between 6 and 9 a.m. and between 11:15 a.m. and 4:15 p.m. Extra Yellow Line trains will run between Huntington and Mount Vernon Square from 6 to 9 a.m.\n\nIf you are going to the 10K on the Mall, the closest stations to the start line are Archives and L’Enfant Plaza.\n\nRiders are encouraged to purchase SmarTrip cards in advance to avoid the crush at fare machines. Riders age 5 or older need their own card to enter the system.\n\nMetrobus. The Pentagon bus terminal will be closed Saturday until 2 p.m. to accommodate the Marine Corps Marathon Kids Run and until 4 p.m. Sunday for the main event. During those hours, buses will use the Pentagon City station.\n\nThe Rosslyn bus terminal will be closed from 4 a.m. to about 6 p.m. Buses will be relocated to Oak Street.\n\nNearly two dozen Metrobus routes will be detoured because of the marathon and 10K. Bus riders should anticipate delays.\n\nBikes and scooters. E-scooters and bicycles will not be allowed inside some restricted areas of the course.\n\nDriving. Several major roads and bridges will close, including Route 110, Washington Boulevard, Rock Creek and Potomac parkways, Wisconsin Avenue, M Street, Pennsylvania and Independence avenues, along with some of the major gateways into the city: the Key Bridge, Memorial Bridge and 14th Street bridge.\n\nRunners may be dropped off at a Kiss and Run lots on the corner of Army Navy Drive and Fern Street.\n\nParking. Free parking will be available at the corner of 23rd Street and Crystal Drive in Arlington, near the Metro station and the shuttle. Parking Sunday is free at all Metro lots and garages.\n\nStreet parking within the marathon route will be restricted in Arlington and the District. Police will implement strict “no parking” restriction along the route. Vehicles that are parked in violation will be ticketed and/or towed, police said.\n\nRoad Closures\n\nRoad closures for the marathon begin at 3 a.m. Sunday. Local jurisdictions will reopen roads after the event course closes at 3:30 p.m. Some streets may remain closed until the evening. Marine Corps Marathon organizers have compiled this full list of streets that will be affected, including times of closures.\n\nIn Arlington, streets will begin to close at 3 a.m. Sunday. These are the streets that will be impacted in the county:\n\n3 a.m. — 5:30 p.m. Marshall Drive from North Meade Street to Route 110\n\nfrom North Meade Street to Route 110 3 a.m. — 5:30 p.m. North Meade Street from Marshall Drive to North Lynn Street\n\nfrom Marshall Drive to North Lynn Street 3 a.m. — 6 p.m. Route 110 from I-66 to Richmond Highway\n\nfrom I-66 to Richmond Highway 3 a.m. — 6 p.m. Wilson Boulevard from North Nash Street to Route 110\n\nfrom North Nash Street to Route 110 3 a.m. — 6 p.m. Lynn Street from North Meade Street to Lee Highway\n\nfrom North Meade Street to Lee Highway 3 a.m. — 6 p.m. Fort Myer Drive from North Meade Street to Lee Highway\n\nfrom North Meade Street to Lee Highway 3 a.m. — 6 p.m. North Moore Street from Wilson Boulevard to Lee Highway\n\nfrom Wilson Boulevard to Lee Highway 3 a.m. — 6 p.m. 19th Street North from North Lynn Street to North Nash Street\n\nfrom North Lynn Street to North Nash Street 3 a.m. — 4 p.m. Route 110 ramp from Washington Boulevard to Pentagon North parking\n\nramp from Washington Boulevard to Pentagon North parking 6 a.m. — noon. Lee Highway eastbound from North Lynn Street to Kirkwood Road\n\neastbound from North Lynn Street to Kirkwood Road 6 a.m. — noon. Spout Run Parkway from southbound George Washington Memorial Parkway (GWMP) to Lee Highway\n\nfrom southbound George Washington Memorial Parkway (GWMP) to Lee Highway 6 a.m. — noon. GWMP northbound from Spout Run to Memorial Circle Drive\n\nnorthbound from Spout Run to Memorial Circle Drive 6 a.m. — noon. Francis Scott Key Bridge (all lanes)\n\n(all lanes) 6 a.m. — noon. I-66 westbound ramp for Exit 75\n\nramp for Exit 75 6 a.m. — noon. I-66 eastbound ramp for Exit 73\n\nramp for Exit 73 6 a.m. — 2 p.m. HOV lanes from 14th Street Southwest to HOV ramp at South Eads Street\n\nfrom 14th Street Southwest to HOV ramp at South Eads Street 5 a.m. — 4:30 p.m. South Eads Street from South Rotary Road to Army Navy Drive\n\nfrom South Rotary Road to Army Navy Drive 5 a.m. — 4:30 p.m. Army Navy Drive from South Fern Street to 12th Street South\n\nfrom South Fern Street to 12th Street South 6 a.m. — 10 p.m. 15th Street South from Crystal Drive to South Eads Street\n\nfrom Crystal Drive to South Eads Street 6 a.m. — 4 p.m. 12th Street South from South Eads Street to Crystal Drive\n\nfrom South Eads Street to Crystal Drive 6 a.m. — 4 p.m. Crystal Drive from 12th Street South to 23rd Street South\n\nfrom 12th Street South to 23rd Street South 6 a.m. — 4 p.m. Long Bridge Drive from 12th Street South to I-395\n\nfrom 12th Street South to I-395 6 a.m. — 4 p.m. Sixth Street South from Long Bridge Drive to South Ball Street\n\nfrom Long Bridge Drive to South Ball Street 6 a.m. — 4 p.m. 10th Street South from Long Bridge Drive to South Ball Street\n\nfrom Long Bridge Drive to South Ball Street 6 a.m. — 4 p.m. South Ball Street from Sixth Street South to 10th Street South\n\nfrom Sixth Street South to 10th Street South 3 a.m. — 5 p.m. Boundary Channel Drive from I-395 to Pentagon North Parking\n\nfrom I-395 to Pentagon North Parking 3 a.m. — 5 p.m. Washington Boulevard from Columbia Pike to Memorial Circle\n\nD.C. police said a “no emergency parking” policy will be in effect from 2 a.m. to 2 p.m. Sunday. The following streets and bridges will close in the District starting at 4 a.m. Sunday and are expected to reopen by 1:30 p.m.:", "description": "About 30,000 runners are expected to participate in one of Washington’s biggest street events.", "authors": ["Luz Lazo", "Transportation Reporter Covering Washington'S Metro", "Buses", "Capital Bikeshare", "Taxis", "The Region'S Road Network"], "top_image": "https://www.washingtonpost.com/resizer/GnPN594u28KmTNwxowsvKEL3-mU=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/AZO7NKW24AI6RC5MX7QB7TODUY.jpg", "published_at": "2019-10-25"}