{"pub": "blastingnews", "url": "https://us.blastingnews.com/opinion/2019/10/black-and-blue-is-a-film-that-tugs-at-the-heart-003006983.html", "downloaded_at": "2019-10-30 02:24:46.753840+00:00", "title": "'Black and Blue' is a film that tugs at the heart", "language": "en", "text": "\"Black and Blue\" may not have drawn much attention from moviegoers, but it's definitely worth spending the time to watch it. Naomie Harris kills it in the film and the story delivers an emotional punch. \"Queen and Slim,\" is a similar movie that dropped a trailer, showing us their take on police brutality. While the film has not been released yet, the trailer dropped before the trailer was released for \"Black and Blue.\" The latter film did not create the same impact.\n\nIt became the second option for Movies about law enforcement.\n\nAs the film hits the credits, I found myself a little emotional. Naomie Harris (Moonlight) delivered a strong performance tacking the issue of police brutality and police-African American relations, as well as a soundtrack that set the mood. \"Black and Blue\" went deep into the controversial relationship between the police and the African American community.\n\nHarris plays a veteran turned police officer who just wants to make a difference in her old community. \"Black and Blue,\" was more than just an action movie.\n\n'Black and Blue' Story\n\nNaomie Harris plays Alicia West. a rookie cop who has only been on the force for three weeks. She ends up taking her partner's shift when he is called up for a double-shift. Her partner was planning to spend time with his family.\n\nOfficer West rides with veteran officer Deacon Brown (James Moses Black), who attempts to show her the ropes of the police culture.\n\nBrown receives a phone call and ends up riding to an abandoned building. He orders her to stay in the car, but she hears gun shots and immediately runs into the building. This is where she stumbles upon something she shouldn't have witnessed. Her fellow officers then order her to leave, give up her body camera footage and accept the reality of being a dirty cop.\n\nThis causes West to run and is fighting for her life as she works to expose the dirty cops. After leaving the city for a few years and now returning as a cop, she does not have many friends to rely on for help. She's stuck between the cops and a hard place.\n\nNaomie Harris shined in 'Black and Blue'\n\nNaomie Harris is an Oscar-nominated actress, but has not been given the opportunity to shine as she did in \"Black and Blue.\" She's always done well in supporting roles, but this time she gave a strong performance in the lead role.\n\nThe tone was set early on. She runs into her old friend Nafessa Williams' character Missy at a gas station. Missy acts like she doesn't know Officer West. It's later revealed they have a complicated friendship. West is seen to be dealing with some things, but I'm not sure if it's from her military service, her job or her past in her community.\n\n\"Black and Blue\" allows West to slowly realize how bad her situation is and watch her attitude and approach change over time. As the story progresses, she makes you feel her desperation. The movie lets her feel real as she becomes overwhelmed emotionally.\n\nSupporting cast\n\nThe casting was spectacular in the film. While seeing Mike Colter transition from Marvel superhero to gangster was a little tough to accept. You could see that his character was not fully used. Frank Grillo (Captain America: The Winter Soldier) playing a dirty cop, seems appropriate considering his role as a Marvel/Hydra agent. Beau Knapp and Tyrese' transition to these new worlds seemed like an easy transition considering their experiences with \"Seven Seconds,\" and \"Fast and Furious.\" The only thing they did not manage to perfect is the New Orleans accents.\n\n\"Black and Blue\" is a film that gives you everything you would want in a movie: from great acting, a tension driven story, an emotional message and something to leave with. Moviegoers will appreciate the effort of the film driving its message.", "description": "The movie 'Black and Blue' does deliver a message of trying to be a part of the change.", "authors": ["Music Crowns", "Oliver Vandervoort", "E. Cross", "Zeegee Cecilio", "Read More On The Same Topic Lawrence Lease", "Tarantino Hit 'Once Upon A Time In Hollywood' Returning To Theaters With New Footage", "Joe Girardi Returning To Dugout As Phillies Manager", "'Zombieland", "Double Tap' Brings More Thrills", "Kills After A Decade Of Waiting"], "top_image": "https://staticr1.blastingcdn.com/media/photogallery/2019/10/28/os/b_1200x630/black-and-blue-is-a-film-with-a-powerful-message-and-deserves-your-time-image-credit-moviefoneyoutube_2346245.jpg", "published_at": "2019-10-29"}