{"pub": "reuters", "url": "https://reuters.com/article/us-usa-biofuels/trump-to-meet-with-usda-epa-officials-about-biofuels-plan-sources-idUSKCN1VQ2TK", "downloaded_at": "2019-09-06 12:14:52.630701+00:00", "title": "Trump to meet with USDA, EPA officials about biofuels plan: sources", "language": "en", "text": "(Reuters) - U.S. President Donald Trump is expected to meet with Department of Agriculture and Environmental Protection Agency officials late Thursday to consider a plan that would include boosting biofuels requirements for 2020 by 1 billion gallons, according to two sources familiar with the discussions.\n\nFILE PHOTO: Corn is loaded into a truck at a farm in Tiskilwa, Illinois, U.S., July 6, 2018. REUTERS/Daniel Acker/File Photo\n\nTrump has promised to deliver a “giant package” to U.S. farmers related to ethanol, in response to ire from U.S. farmers and biofuels advocates over a large number of exemptions regulators have given to oil refineries to free them of requirements to blend biofuels.\n\nThe Renewable Fuel Standard, signed into law by President George W. Bush in 2005, requires refineries to blend increasing volumes of biofuels into their fuel each year. Small facilities under financial strain can be exempted, and Trump authorized the EPA to grant 31 waivers to small refineries in August, far more than the Obama administration had typically granted.\n\nThe draft plan under consideration would include a previously discussed increase of 500 million gallons for conventional biofuels, largely corn-based ethanol, as well as an additional 500 million gallons for advanced biofuels like biodiesel for 2020. It would also include an addition to the biodiesel mandate for 2021 of 250 million gallons.\n\nThat increase would help address “excess waivers,” which have also harmed biodiesel and soy farmers, the document said.\n\nAn EPA spokesperson declined to confirm or comment on the plan but said the agency will continue to consult on the best path forward for the program.\n\n“The president will always seek to engage with stakeholders to achieve wins for the agriculture and energy sectors,” the spokesperson said.\n\nEPA in July proposed setting biofuels requirements at 20.04 billion gallons in 2020, up from 19.92 billion gallons in 2019. That included 15 billion gallons of conventional biofuels like ethanol. The EPA also proposed setting the 2021 biodiesel volume at 2.43 billion gallons, unchanged from 2020.\n\nFurther details about Thursday’s meeting and the latest proposal were unclear but had already drawn criticism from the oil industry.\n\n“Pursuing this plan jeopardizes the refining industry’s support of the president and would undoubtedly raise fuel prices for consumers, neither of which would be good for the president going into next year’s election,” said Chet Thompson, head of the American Fuel and Petrochemical Manufacturers.\n\nBacklash to the waivers has been particularly strong in Iowa, the largest producer of corn and ethanol, and a swing state won twice by former Democrat President Barack Obama but which voted for Trump in 2016.\n\n“The EPA’s exemptions have destroyed demand for far more than a billion gallons each year,” said Brooke Coleman of the Advanced Biofuels Business Council. “Farm-state champions are looking for a fix that will put the RFS back on the track that Congress intended.”", "description": "U.S. President Donald Trump is expected to meet with Department of Agriculture and Environmental Protection Agency officials late Thursday to consider a plan that would include boosting biofuels requirements for 2020 by 1 billion gallons, according to two sources familiar with the discussions.", "authors": ["Chris Prentice", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190906&t=2&i=1426738493&w=1200&r=LYNXNPEF8423M", "published_at": "2019-09-06"}