{"pub": "bbc", "title": "Mat Dan: 'I became an accidental celebrity 6,000 miles from home'", "url": "https://bbc.com/news/world-asia-49466721", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 09:28:45.834762+00:00", "text": "Image copyright Mat Dan Image caption A poster for a chat show featuring Mat Dan\n\nAs soon as Mohammed Kareef Daniel Abdullah steps out of his front door in Malaysia's capital, it doesn't take long before heads start turning and for his nickname to be shouted.\n\n\"People say 'Look, look it's Mat Dan!'\" his mother says, adding that only some muster the courage to ask for a selfie.\n\nWhether it's starring in his own primetime travel programme, hosting his breakfast radio show or appearing on billboards advertising tours to Mecca, Mat Dan is big news in Malaysia.\n\nIt's not the usual path for an Englishman born Daniel Tyler.\n\nGrowing up in the middle-class town of Cheltenham in the English Cotswolds, Dan's upbringing was nothing out of the ordinary.\n\nHe wasn't the biggest fan of school but excelled at cricket, representing Gloucestershire at youth level. But by his mid-teens, cricket had taken a back seat as Dan discovered music and partying. He dropped out of college and could usually be found in the pub or working in a clothes shop.\n\nImage copyright Alex Duncan Image caption Dan on a holiday to Magaluf in 2007\n\nIn 2008, Dan had saved enough money for a backpacking trip to South-East Asia with some friends, including myself. Although he came back to the UK after just a couple of months, he decided to return to the region later that year.\n\nLittle did he know that the decision to return would change his life forever.\n\nDan wound up on the tiny island of Pulau Kapas on Malaysia's east coast. Rather than just spending his time travelling with Western backpackers, Dan decided to immerse himself among locals on the island.\n\nIt didn't take long for him to start picking up the local language - what he thought was bahasa Malay, the main language of Malaysia. But on a trip to Kuala Lumpur, a shop assistant couldn't understand him. The penny then dropped that he had actually been learning a local dialect called Terengganu - spoken by about a million natives of Terengganu state.\n\nHe was initially disheartened. \"I was like: 'I'm screwed if I go anywhere else,'\" he says. But his accidental mastery of this Malay dialect ended up being the making of him.\n\nA buzz had already started to build around Dan in Terengganu state as word spread of a young Englishman who had embraced the local language and way of life. But when a student from Kuala Lumpur secretly filmed Dan speaking Terengganu, the video clocked up hundreds of thousands of views across Malaysia on YouTube.\n\nA TV crew from the capital came knocking and asked if he wanted to try his hand in front of the camera. After realising he had a knack for presenting, Dan was offered his own primetime travel series: Haramain Backpackers - Trans Siberian.\n\nImage copyright Mat Dan Image caption During filming of 'Haramain Backpackers - Trans Siberian'\n\nOnce the programme aired, Dan's life changed almost overnight. He is now recognised everywhere he goes and has 838,000 followers on Instagram.\n\nAfter a second series, Dan started branching out. He bagged his own cooking show despite not being able to cook. He began hosting a radio show on Manis FM and is now a regular fixture on Malaysian chat shows.\n\n\"Every shop, every meal, every road crossed you hear an echo of shouts 'Hey Mat Dan, Mat Dan!', which would almost always end with a series of selfies with strangers,\" says his friend Daniel Beames, who visited him in late 2017.\n\nWhile initially revelling in his friend's new-found fame, Daniel said he started to find it tiring after a few days. \"All the attention would be very time consuming and not necessarily ideal when trying to get things done,\" he said.\n\nTun Faisal, district officer for Marang in Terengganu state, said it wasn't just Dan's use of Terengganese slang that set him apart from other foreigners fluent in Malay.\n\n\"His understanding of both the Malay language and culture makes him a unique personality in Malaysia,\" Faisal says. \"I think his greatest success is that he has linked himself closely with Terengganu, and whenever people see him, they see Terengganu.\"\n\nImage copyright Mat Dan Image caption Dan with his wife, Nurnadifa, and son, Zayne, in Mecca\n\nWhile in Malaysia, Dan also converted to Islam and met his Muslim wife Nurnadifa. He won't take on jobs that conflict with his religious beliefs, for example, if he was asked to emcee an event sponsored by an alcohol brand or if an acting job required a romantic scene with another woman.\n\nWhile most of the attention is positive, he has encountered criticism from what he calls Malaysia's \"keyboard warriors\".\n\n\"A lot of people say they know hundreds of foreign workers who come over here and speak Malay in two or three months and they don't turn into a celebrity,\" Dan says.\n\n\"They say: 'What's the difference between Mat Dan and a Bangladeshi worker who can speak Malay?'\"\n\nSome of the criticism has come from religious conservatives. While most of his followers in the Muslim-majority country have welcomed his conversion to Islam, some have taken issue with it, or cast doubt on it. \"One even emailed my brother saying: 'Your brother's a Jew'\",\" Dan says.\n\nDan respects his critics' right to an opinion. But those who doubt the sincerity of his religious beliefs? \"They get blocked.\"\n\nAlthough Dan has settled in Malaysia, he makes annual trips back to the UK.\n\nWhile he relishes catching up with his family - who also regularly visit Malaysia - he sometimes feels alienated from the place he was raised. \"I don't really feel at home,\" he says.\n\nImage copyright Mat Dan Image caption Dan and his family on a trip back to the UK\n\nWeekends centred on alcohol and gambling no longer fit into his way of life. He describes the awkwardness of once watching TV with some old friends when a news report casting Muslims in a negative light was aired.\n\n\"It's kind of like if you're watching TV with your mum and there's a sex scene,\" he says. \"Islam comes up on the news and there's a kind of awkward silence where nobody is saying anything,\" he says, adding that he will always have a soft spot for his childhood friends.\n\nIt's not just Dan's way of life that has changed. Growing up with a broad West Country accent, almost a decade speaking Malay and Terengganu has resulted in Dan developing an international hybrid accent almost unrecognisable from before.\n\n\"I called my nan a few years ago on her birthday and she put the phone down on me because she thought I was trying to sell her broadband,\" he recalls.\n\n\"A few people are like 'Where are you from?' And I say I'm from here and they're like 'No you're not... why you speaking all Welsh?'\"\n\n\"I'm like: 'I'm not Welsh.'\"\n\nImage copyright Mat Dan Image caption Dan's mum, Nicola, and dad, Kevin, with Nurnadifa and Zayne\n\nHis mother, Nicola, says it has been \"surreal\" seeing her son turn into a star on the other side of the world. But despite the major changes in his life, \"he's still the same Dan\", she says.\n\n\"I always thought if any of the boys were going to do something different it'd be Dan but I would have never thought he'd have done this,\" she laughs.\n\n\"They've really embraced him out there and it's a privilege, really.\"\n\nNow settled with a one-year-old son, Zayne, Dan is having to take a step back from TV projects that are too time consuming.\n\nHe's now a tourism ambassador for Terengganu, has a new clothing line on the way and is about to star in his first film. Last year he was awarded permanent residency by then-deputy prime minister Ahmad Zahid Hamidi on live TV.\n\nImage copyright Mat Dan Image caption Dan is now a tourism ambassador for Terengganu state\n\n\"The [TV] work I do, I can't do it forever. It could drop off at any time,\" he says. \"I'm not necessarily thinking about a retirement plan but something that has a bit more longevity.\"\n\nBut whether he's on primetime TV or taking a backseat role, Dan sees Malaysia as his home. \"I now see Malay as my first language,\" he says. \"But, for me, it's not just the language. I've completely immersed myself in Malay culture, my whole way of life and demeanour, the way I speak, the way I act, the way I eat.\n\n\"I'm more Malay than English.\"", "description": "When Daniel Tyler went backpacking, little did he know he'd end up a star in Malaysia.", "authors": ["George Wright", "Bbc News"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/AE10/production/_108506544_82f5c9e1-fa72-437c-90c2-06ce4da38c34.jpg"}