{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/26/mi-jung-hur-shoots-63-to-take-lpga-tour-lead-in-in", "downloaded_at": "2019-09-26 23:46:46.724423+00:00", "title": "Mi Jung Hur shoots 63 to take LPGA Tour lead in Indy", "language": "en", "text": "INDIANAPOLIS (AP) - Mi Jung Hur shot a 9-under 63 on Thursday to take the first-round lead in the Indy Women in Tech Championship.\n\nHur had a bogey-free round at Brickyard Crossing, the layout that features four holes inside the Indianapolis Motor Speedway oval.\n\n“I was trying to keep on being present,” Hur said. “That’s the key to play good today. … If you think about the future, mess up everything. It’s really hard to do it, but that’s my goal for the whole year.”\n\nThe South Korean player won the Ladies Scottish Open last month for her third LPGA Tour victory.\n\n“I got a lot of confidence and playing like a bit more comfy,” Hur said. “My long game gets better and putting doing well, everything doing well, so had a good year so far.”\n\nEngland’s Bronte Law, coming off Europe’s victory over the United States in the Solheim Cup, was two strokes back with Denmark’s Nanna Koerstz Madsen and Japan’s Sakura Yokomine.\n\n“I think just obviously playing in the intensity for a week, and obviously there was so much good golf that went on, just kind of riding off the back of that,” Law said. “It doesn’t really surprise me to see that.”\n\nYokomine had five straight birdies on her front nine.\n\n“This week, just kind of start with like no thinking,” Yokomine said through a translator. “Was thinking like too much about mechanics.”\n\nMarina Alex topped the nine U.S. Solheim Cup players in the field with a 66. She eagled the par-5 14th.\n\n“It’s fun, it’s a good golf course,” Alex said. “There’s some good little short holes, par 5s are accessible, greens roll really nice. Scorable, but also if you get on the wrong side of things, it can be tricky, too. I think it’s pretty fair.”\n\nAmy Olson and Pornanong Phatlum also shot 66. Ally McDonald followed at 67 with Lauren Stephenson, Jodi Ewart Shadoff, Mirim Lee and Chella Choi. Defending champion Sung Hyun Park opened with a 70.\n\nLexi Thompson, winless at the Solheim Cup, had a 76. The winner of the inaugural event in 2017, she had a double bogey and two bogeys in the birdie-free round.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Mi Jung Hur shot a 9-under 63 on Thursday to take the first-round lead in the Indy Women in Tech Championship.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/26/lpga_tour_golf_57139_c0-103-2470-1543_s1770x1032.jpg?fd53e754f568df408dbce92adbfa9b270a5ec216", "published_at": "2019-09-26"}