{"pub": "reuters", "url": "https://ca.reuters.com/article/topNews/idCAKBN1W10VW-OCATP", "downloaded_at": "2019-09-16 12:04:03.042553+00:00", "title": "Whistleblower Snowden: I'd love to be granted asylum in France", "language": "en", "text": "FILE PHOTO: Edward Snowden speaks via video link during a conference at University of Buenos Aires Law School, Argentina, November 14, 2016. REUTERS/Marcos Brindicci\n\nPARIS (Reuters) - Former U.S spy agency contractor Edward Snowden said he would love French President Emmanuel Macron to grant him political asylum after one of Macron’s ministers said if it was up to her she would offer him asylum.\n\nFrench Justice Minister Nicole Belloubet said at the weekend she supported granting asylum to him, though she made clear she was speaking in a personal capacity and it was not an official offer.\n\nAsked about the prospect of asylum in France in an interview aired on Monday on France Inter radio, Snowden said: “I applied for asylum in France in 2013 under [former French President Francois] Hollande and of course we would love to see Macron roll out an invitation.”\n\n“But it’s not about France, it’s about Europe, it’s about the world and the system that we have. Protecting whistleblowers is not a hostile act. Welcoming someone like me is not an attack on the United States”.\n\nSnowden, about to publish his memoirs ‘Permanent Record’, has been living in Russia since 2013 after he revealed details of secret surveillance programs by U.S. intelligence agencies.\n\nMany civil rights activists see him as a hero, but at home in the United States authorities want him to stand trial for espionage.", "description": "Former U.S spy agency contractor Edward Snowden said he would love French President Emmanuel Macron to grant him political asylum after one of Macron's ministers said if it was up to her she would offer him asylum.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190916&t=2&i=1430397259&w=1200&r=LYNXMPEF8F0K9-OCATP", "published_at": "2019-09-16"}