{"pub": "axios", "url": "https://link.axios.com/2020-democratic-debate-ohio-cbfe021c-b1b9-4377-a637-302a9079641d.html", "downloaded_at": "2019-10-16 01:38:10.530398+00:00", "title": "Axios", "language": "en", "text": "Warren has become the frontrunner since September's debate in Houston and is taking the heat from many of the candidates on stage.\n\nhas become the frontrunner since September's debate in Houston and is taking the heat from many of the candidates on stage. Still, Sen. Cory Booker (D-N.J.) rejected the sparring, saying \"tearing each other down because we have a different plan to me is unacceptable. I have seen this script before.\"\n\nImpeachment\n\nAll candidates support an impeachment inquiry on President Trump for asking Ukraine's president to investigate one of the Democratic presidential frontrunners, Joe Biden.\n\nWhat they’re saying:\n\nWarren has continuously backed impeachment after the Mueller report was released. \"Sometimes there are issues that are bigger than politics. And I think that's the case with this impeachment inquiry,\" she said.\n\nhas continuously backed impeachment after the Mueller report was released. \"Sometimes there are issues that are bigger than politics. And I think that's the case with this impeachment inquiry,\" she said. Sanders : \"Mitch McConnell has got to do the right thing and allow a free and fair trial in the Senate.\"\n\n: \"Mitch McConnell has got to do the right thing and allow a free and fair trial in the Senate.\" Biden : \"I said from the beginning that if, in fact, Trump continued to stonewall, ... [Congress] would have no choice -- no choice -- but to begin an impeachment proceeding.\"\n\n: \"I said from the beginning that if, in fact, Trump continued to stonewall, ... [Congress] would have no choice -- no choice -- but to begin an impeachment proceeding.\" Sen. Kamala Harris: \" I don't really think this impeachment process is going to take very long, because as a former prosecutor, I know a confession when I see it.\"\n\nI don't really think this impeachment process is going to take very long, because as a former prosecutor, I know a confession when I see it.\" Cory Booker: \"This has got to be about patriotism and not partisanship.\"\n\nHealth care\n\nMayor Pete Buttigieg and others took shots at Warren's Medicare for All proposal, after she was once again asked how she is going to fund a public option health care plan without raising taxes on the middle class.\n\nThe exchange:\n\nWarren: \"I will not sign a bill into law that does not lower costs for middle-class families.\"\n\n\"I will not sign a bill into law that does not lower costs for middle-class families.\" Buttigieg: “Your signature, senator, is to have a plan for everything except this.\"\n\n“Your signature, senator, is to have a plan for everything except this.\" Warren: ”Let's be clear, whenever someone hears the term 'Medicare for all who want it,' understand what that really means. It's Medicare for all who can afford it.\"\n\n”Let's be clear, whenever someone hears the term 'Medicare for all who want it,' understand what that really means. It's Medicare for all who can afford it.\" Buttigieg: “I don’t understand why you believe the only way to get affordable coverage for everybody is to obliterate private plans.”\n\nSens. Amy Klobuchar, Harris and Booker tried to turn the health care conversation to women’s health and opioids rather than the public versus private option.\n\nEconomy\n\nCandidates criticized trade deals, corporate greed and offered ways to resolve the General Motors strike.\n\nWhat they're saying:\n\nAndrew Yang : Rejects Sanders' federal jobs program, pushed for universal income and his \"freedom dividend\" of $1,000 a month for each American.\n\n: Rejects Sanders' federal jobs program, pushed for universal income and his \"freedom dividend\" of $1,000 a month for each American. Sanders: \"We cannot afford a billionaire class whose greed and corruption has been at war with the working families of this country.\"\n\n\"We cannot afford a billionaire class whose greed and corruption has been at war with the working families of this country.\" Billionaire Tom Steyer: \"There have been 40 years where corporations have bought this government, and those 40 years have meant a 40-year attack on the rights of working people.\"\n\nWealth tax\n\nCandidates targeted Warren for her wealth tax, though many said they are open to a wealth tax to address income inequality.\n\nWhat they’re saying:\n\nFormer Rep. Beto O'Rourke: \" Sometimes Sen. Warren is more about being punitive and pitting some part of the country against each other ... She has yet to describe her tax plan and whether or not that person I met would see a tax increase.\"\n\nSometimes Sen. Warren is more about being punitive and pitting some part of the country against each other ... She has yet to describe her tax plan and whether or not that person I met would see a tax increase.\" Klobuchar : \"I want to give a reality check to Elizabeth. No one on this stage wants to protect billionaires. Not even the billionaire wants to protect billionaires. We have different approaches. Your idea is not the only idea.\"\n\n: \"I want to give a reality check to Elizabeth. No one on this stage wants to protect billionaires. Not even the billionaire wants to protect billionaires. We have different approaches. Your idea is not the only idea.\" Warren : \"I'm really shocked at the notion that anyone thinks I'm punitive. Look, I don't have a beef with billionaires. ... Billionaires \"pitch in 2 cents so every other kid in America has a chance to make it.\"\n\n: \"I'm really shocked at the notion that anyone thinks I'm punitive. Look, I don't have a beef with billionaires. ... Billionaires \"pitch in 2 cents so every other kid in America has a chance to make it.\" Yang: \"We should look at what Germany, France, Denmark and Sweden still have, which is a value-added tax. If we give the American people a tiny slice of every Google sale, we can put it into our hands because we know best how to use it.\"\n\nGo deeper:", "description": "Smart, efficient news worthy of your time, attention, and trust", "authors": [], "top_image": "https://assets.axios.com/203e9f932cc97836ac2ff4c6c982676c.png", "published_at": "2019-10-16"}