{"pub": "cnbc", "url": "https://cnbc.com/2019/10/22/industrials-analyst-stephen-tusa-favorite-stock-united-technologies.html", "downloaded_at": "2019-10-22 20:49:58.651959+00:00", "title": "Top analyst Stephen Tusa, who called GE's decline, has a favorite stock in the industrial space", "language": "en", "text": "Shares of United Technologies were higher after the company reported third-quarter results that beat Wall Street's expectations for earnings and revenue, according to a FactSet survey of analysts. The stock then climbed more than 2%, hitting its high of the day of $142.24 a share after Tusa's comments. Tusa is widely followed for his analysis of industrial conglomerates, especially after his early warnings on General Electric's came true.\n\n\"This is in my view one of the best-of-both-world stocks,\" J.P. Morgan analyst Stephen Tusa.\n\nUnited Technologies shares rose in trading Tuesday after the top industrials analyst on Wall Street said on CNBC's \"Halftime Report\" that he likes the conglomerate's upside from here.\n\nUnited Technologies is more diversified than others in the industrials space, Tusa said, protecting it from the sector's current short cycle recession.\n\n\"Keep in mind this is a story that's been many years on the come up. They've been in a heavy investment cycle for five or six years now and every year it was kind of a bit of a false start on Street expectations as to when this thing would inflect,\" Tusa said. \"I think we are finally here.\"\n\nA key market for United Technologies is aircraft engines, Tusa said. While GE historically dominates the market for aircraft engines, J.P.Morgan sees United Technologies grabbing increasing market share.\n\n\"We believe the UTX turbofan technology is ultimately a better technology and they are the shared gainer over the next, call it, you know, one to two decades,\" Tusa said, adding that United Technologies has \"very minimal exposure\" to the Boeing 737 MAX crisis. GE makes most of the engines used on Beoing's 737 MAX aircraft.\n\nTusa has an underperform rating on GE, with a $5 price target. GE shares closed up 3% Tuesday.\n\n\"The bottom line [for GE] to me has always been what's the free cash flow trajectory for the next couple years? I think that over the next several months we're going to get much more visibility on what I consider to be the bridge year, which is 2020,\" Tusa said.\n\n\"Ultimately, I don't see an inflection here in the next couple years,\" Tusa added.", "description": "The top industrials analyst on Wall Street said on CNBC's \"Halftime Report\" that he likes United Technologies' upside from here.", "authors": ["Michael Sheetz"], "top_image": "https://image.cnbcfm.com/api/v1/image/105956965-1562944998787gettyimages-468275715r.jpg?v=1571155336", "published_at": "2019-10-22"}