{"pub": "reuters", "url": "https://in.reuters.com/article/japan-fukushima-reinvestigation/japan-regulator-to-re-investigate-fukushima-nuclear-disaster-idINKCN1VW0OS", "downloaded_at": "2019-09-11 07:31:57.953983+00:00", "title": "Japan regulator to re-investigate Fukushima nuclear disaster", "language": "en", "text": "TOKYO (Reuters) - Japan’s nuclear regulator plans to reinvestigate the Fukushima disaster, in which three reactors at an atomic power plant run by Tokyo Electric Power melted down after an earthquake and tsunami eight years ago, it said on Wednesday.\n\nA Reuters reporter measures a radiation level of 9.76 microsieverts per hour in front of Kumamachi Elementary School inside the exclusion zone in Okuma, near Tokyo Electric Power Co's (TEPCO) tsunami-crippled Fukushima Daiichi nuclear power plant, Fukushima Prefecture, Japan, February 13, 2016. REUTERS/Toru Hanai/Files\n\nThe March 2011 disaster led to explosions and the meltdown of the three reactors at the Fukushima Daiichi nuclear station north of the capital, Tokyo, spewing radiation that forced 160,000 people to flee, many never to return.\n\nIn its investigation, the Nuclear Regulation Authority (NRA) will seek to establish where radiation is leaking from damaged reactor containment vessels, a paper it released showed.\n\nIt will also look at cooling systems set up to keep the melted fuel in the reactors from overheating, it said.\n\nA spokesman for the utility, contacted by Reuters by telephone, could not immediately comment.\n\nThe disaster led to the eventual shutdown of all Japan’s reactors, which before the disaster had supplied about 30 percent of the electricity in the world’s third-largest economy.\n\nSeveral investigations since have looked into the world’s worst nuclear disaster since Chernobyl in 1986.\n\nOne of them concluded that Fukushima “was a profoundly manmade disaster – that could and should have been foreseen and prevented, (while) its effects could have been mitigated by a more effective human response.”\n\nIn 2016, the government estimated the total cost of plant dismantling, decontamination of affected areas, and compensation would be 21.5 trillion yen ($199 billion), or about a fifth of Japan’s annual budget.\n\n($1=107.7800 yen)", "description": "Japan's nuclear regulator plans to reinvestigate the Fukushima disaster, in which three reactors at an atomic power plant run by Tokyo Electric Power melted down after an earthquake and tsunami eight years ago, it said on Wednesday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190911&t=2&i=1428599818&w=1200&r=LYNXNPEF8A0G2", "published_at": "2019-09-11"}