{"pub": "yahoo", "url": "https://news.yahoo.com/baghdadi-violent-jihadist-supremo-against-odds-154601196.html", "downloaded_at": "2019-10-29 01:51:05.492171+00:00", "title": "Baghdadi: violent jihadist supremo against all odds", "language": "en", "text": "In the beginning no one predicted that Abu Bakr al-Baghdadi was charismatic enough to lead, says his biographer Sofia Amara (AFP Photo/-)\n\nBeirut (AFP) - Jihadist supremo Abu Bakr al-Baghdadi may have instilled fear in millions before Washington announced his death Sunday, but he started out barely able to utter a sentence, his biographer says.\n\nJournalist Sofia Amara tells AFP how the Iraqi with the demeanour of a small town preacher overcame his weaknesses to emerge as the leader of an unprecedented experiment in jihadist statehood.\n\n- What kind of man was he? -\n\nIn the beginning, no one predicted Baghdadi was charismatic enough to lead, says Amara, who conducted years of field research that went into her book \"Baghdadi, The Caliph of Terror\", published in French in 2018.\n\n\"Then he became emboldened, high on the power procured by his status as the head of a rich, ultra-violent state that was able to strike even at the heart of Europe.\"\n\nWhen Baghdadi -- thought to be 48 at the time of his death -- took to a mosque pulpit in the Iraqi city of Mosul in 2014 to proclaim himself \"caliph\", he did not look particularly impressive, Amara says.\n\nHe limped as he walked up the steps to declare his rule over large swathes of Syria and Iraq and some in the congregation wondered who \"the old guy\" was.\n\nHe was never able to join the army because he was short-sighted and did not do particularly well in high school, Amara adds.\n\n\"Since he was little, he'd had trouble expressing himself. He'd practise in front of the mirror for hours just to be able to utter a few sentences.\"\n\nEven as recently as April this year, the filming of a major comeback propaganda video took hours because he was tired and kept stuttering.\n\n- So how did he do it? -\n\nOsama Bin Laden, the late head of the rival Al-Qaeda organisation, was reportedly against Baghdadi becoming a jihadist figurehead, Amara says.\n\nAccording to the Al-Qaeda chief, who was also announced killed by the Americans in 2011, \"Baghdadi didn't have the legitimacy, the stature, or the experience\".\n\nBut Baghdadi set his sights on rising to the top, incorporating into his group Iraqi officers once loyal to president Saddam Hussein's Baath party and made bitter after the US dissolution of the Iraqi army in 2003.\n\n\"He had the quite diabolical genius of sealing a reconciliation between secular Baathists and veteran jihadists,\" Amara adds.\n\nHe was very patient according to one of his wives -- he is thought to have had three -- and determined to build on his knowledge of the Koran to make up for a lack of military legitimacy.\n\nOn tricky religious issues, he consulted Hossam Allami, a mufti he met during his stint in 2004 in the American prison camps of Bucca and Abu Ghraib.\n\nAllami \"used to WhatsApp Baghdadi, who often asked him to validate his view of such or such an issue in Islam\", Amara says.\n\nOne enslaved girl from the Yazidi minority recounted how she and others were made to wash and recite the Koran at 3:00 am when they were taken to Baghdadi, even though US-coalition bombs were raining down outside, she adds.\n\n- What's his legacy? -\n\nAt the height of IS rule, Baghdadi lead an army of 50,000 to 60,000 fighters, and his extremist followers imposed their brutal version of Islam on seven million people.\n\n\"It's a rather surprising journey,\" Amara says.\n\nHe \"actually managed to physically realise the caliphate project, which even Bin Laden had not done\".\n\nSeveral military campaigns gradually chipped away at his proto-state, which was pummelled to ashes by US-backed forces in eastern Syria in March.\n\nBut for almost five years, he was in charge of something that resembled a country.\n\nAt its largest, it spanned an area the size of the United Kingdom and had its own religious courts, a tax system and even its own currency.\n\nBut the group leaves behind a brutal legacy of beheadings, mass killings, abductions and rape, by which it sought to bring to heel all in its territory.\n\n\"Baghdadi and his gang pushed back the boundaries of horror,\" Amara says.\n\nToday, IS has been reduced to sleeper cells and thousands of suspected followers rounded up in jails and camps, \"but the ideology is still there\".\n\nBaghdadi's death, Amara says, is a symbolic, but not fatal, blow.", "description": "Jihadist supremo Abu Bakr al-Baghdadi may have instilled fear in millions before Washington announced his death Sunday, but he started out barely able to utter a sentence, his biographer says.  Journalist Sofia Amara tells AFP how the Iraqi with the demeanour of a small town preacher overcame his weaknesses", "authors": ["Jean-Marc Mojon"], "top_image": "https://s.yimg.com/uu/api/res/1.2/pv7xsADIN.yhntbXJMIAxQ--~B/aD00MzU7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/47400ec2cfdbae76d041277376fffe08a3db079c.jpg", "published_at": "2019-10-28"}