{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/bernie-sanders-kamala-harris-financial-transaction-tax-bad-idea-chamber-of-commerce-2019-9-1028542486", "downloaded_at": "2019-09-22 15:31:23.118167+00:00", "title": "The US Chamber of Commerce released a report slamming taxes on Wall Street like those proposed by Bernie Sanders and Kamala Harris", "language": "en", "text": "Brian Snyder/Reuters\n\nThe US Chamber of Commerce's Center for Capital Markets Competitiveness released a new report detailing how financial transaction taxes would hurt US taxpayers, investors, and consumers.\n\nDemocratic presidential candidates Bernie Sanders, Kamala Harris, and others have proposed taxing trades to raise revenue for various plans.\n\nBut there's debate over how much the taxes would actually raise, and what costs investors would pay.\n\nCountries that do have successful financial transaction taxes largely include exemptions for market makers and high frequency traders, which US plans aim to curb.\n\nRead more on Markets Insider.\n\nThe US Chamber of Commerce's Center for Capital Markets Competitiveness has released a new report detailing how a financial transaction tax would hurt US taxpayers, investors, and consumers. Such taxes have been proposed and highly touted by Democratic presidential candidates Bernie Sanders and Kamala Harris.\n\n\"Main street will pay for the tax, not Wall Street,\" wrote the report's author, James Angel, an associate professor of finance at Georgetown University.\n\n\"It won't punish bad actors or prevent the next financial crisis, or even tame market volatility,\" he continued. \"Instead, it will punish all Americans through depressed asset values, making saving enough for retirement even harder.\"\n\nAngel also said it could result in higher consumer prices, fewer jobs, and damaged financial markets.\n\nWhile Sanders has proposed a financial transaction tax to pay for his \"College for all and cancel all student debt\" plan, Harris has designs on it funding her \"Medicare for all\" proposal.\n\nBeyond the 2020 campaign trail, a few key pieces of legislation have been proposed in that call for a tax on trades — The Wall Street Tax Act by Senator Brian Schatz and Representative Peter DeFazio, and the Inclusive Prosperity Act of 2019, introduced in May by Sanders and Representative Barbara Lee to \"curb Wall Street greed.\"\n\nThe Inclusive Prosperity Act outlines a tax of 0.5% for stocks, 0.1% for bonds, and 0.005% for derivatives — similar to Sanders' \"College for all\" plan. This is the structure most organizations use to model the impact of a tax on trades.\n\nHere are some arguments cited in the Chamber of Commerce's study:\n\nSome experts think average Americans will incur additional costs\n\nThe US Chamber of Commerce report argues that, over a lifetime, Sanders' plan would create a \"serious dent\" in retirement portfolios to the tune of a roughly 8.5% drop in accumulation.\n\nHere's how it shakes out: A worker who saved $1,500 each year for 46 years in a fund earning 5% annually would see an approximately $20,000 drop in average lifetime retirement savings from the tax, according to Angel's math.\n\nA recent study by the Modern Markets Initiative also detailed how much a tax on trades would cost retirement savers, as well as pension funds, 529 college savings plans, and university endowments — and didn't paint a particularly rosy picture.\n\nThe taxes likely wouldn't raise the money they claim they would\n\nSanders claims his plan will raise roughly $2.2 trillion over a 10-year period, which would be used to service the $1.6 trillion of outstanding student loan debt held by 45 million Americans.\n\nBut Angel says it's unlikely the plan would raise that much.\n\n\"FTTs rarely raise the desired net revenue because of their imact on trading volume along with the damage to other tax revenue through decreased capital gains and lower economic activity,\" he wrote.\n\nMeanwhile, it's worth noting that when Sanders proposed a similar plan in 2016, the Tax Policy Center concluded that the plan would generate $400 billion over a decade — not $3 trillion as he claimed.\n\nThis was attributed to the idea that a tax on trades would discourage trading, hence bringing in less revenue through the tax.\n\n\"An FTT has merits,\" wrote Howard Gleckman, a senior fellow at the Tax Policy Center. \"But its ability to raise revenue is limited because trading will decline and perhaps migrate to markets not subject to the tax.\"\n\nThe proposed plans don't look like ones in other countries\n\nFinancial transaction taxes do exist in other countries, with various degrees of success. In the US, most plans propose a tax as a way to curb high-frequency trading and rein in Wall Street in addition to raising revenue.\n\nBut Angel argues that not all high-frequency trading is bad.\n\n\"HFTs such as market makers are not screwing regular people,\" Angel wrote. \"They are providing beneficial services to investors when they want to buy or sell stocks.\"\n\nIn other countries that tax trading, there are exemptions for market makers who are seen doing beneficial work. The UK, France, and Italy all exempt market makers from financial transaction taxes, Angel wrote.\n\nThat's something not included in the current versions of US proposals. Dean Baker, the co-director for the Center for Economic and Policy Research, said he recommends market makers pay the tax and then apply for a refund later for trades conducted to make the market.\n\n\"I think it would be desirable to put that exemption in,\" Baker told Markets Insider. \"They do play a useful role. The point is to distinguish between when they're making the market and when they're trading on their own behalf.\"\n\nThere is also debate over how much of a tax is appropriate to bring in revenue and not slow markets too much.\n\n\"The Sanders plan is higher than I would go,\" Baker said.\n\nHis worry is that at a higher tax rate, investors may be incentivized to avoid the tax by hiding trades. He says that a 0.2% tax on stock trades might be a better balance.\n\n\"There would be much less gaming\" at that level, he said. \"You can't with a straight face say it would bring the markets crashing down.\"", "description": "The US Chamber of Commerce's Center for Capital Markets Competitiveness released a new report detailing how financial transaction taxes would hurt US taxp...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d713aea2e22af682403cdd9-2000/bernie-sanders.jpg", "published_at": "2019-09-10"}