{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7524025/Are-Instagram-worthy-working-spaces-Europe.html", "downloaded_at": "2019-10-13 08:56:41.880320+00:00", "title": "Are these the most Instagram worthy co-working spaces across Europe?", "language": "en", "text": "Advertisement\n\nIf you're freelance or self employed there's no need to work from home every day with these Instagram worthy spaces to work from.\n\nThese co-working spaces, from all over Europe, are an Instagrammers heaven - with the spaces boasting funky bars to vibrant insta-worthy working areas - which wouldn't look out of place in a design magazine.\n\nPredictions show that half of the workforce will become self-employed or freelance in the next ten years - and these working spaces are designed with creativity in mind.\n\nWith the Uncommon, a co-working space in London launching their flagship space in London's Liverpool Street, which leads the way for well designed creative spaces, with wellness in mind, Femail reveals the best co-working spaces with design-led open working areas, rooftops and even spinning bikes.\n\nThe Uncommon in London has funky work areas with comfy sofas, plants and spacious areas to connect with others\n\nThe Uncommon's flagship location in Liverpool street has a bar and even a wellness studio with Peleton spinning bikes\n\nThe Uncommon, London\n\nWith five co-working spaces in London - including Fulham, Islington and Uncommon’s flagship space in Liverpool street they are all meticulously designed spaces, with a wellness focus in mind.\n\nThe spaces draw inspiration from a blend of Scandinavian and Italian design with a combination of rich textures and tonal colours to stimulate focus and maintain levels of calmness.\n\nThe Liverpool Street office features a one of a kind interactive light installation, from designer and artist, Marcus Lyall. ‘In a Heartbeat’ is an interactive art installation, which showcases your heartrate through music and light.\n\nIt also has dedicated the entire 8th floor to wellbeing and fitness, and have just introduced Peleton bikes. They also have an open-air roof top terrace, as well as four walnut-clad Pods for members to take time out of their day.\n\nStockholm, WeWork\n\nThe common area at Stockholm's WeWork is inviting, bringing the outside inside in with plants surrounding the working space\n\nThe WeWork space in Stockholm also has front desk service, private offices, and conference rooms, the onsite showers and bike storage - while they're also dog friendly\n\nThe WeWork space in Stockholm has clean lines and looks on to the infamous sights and sounds of central Stockholm.\n\nThe common area is inviting, bringing the outside inside in with plants surrounding the working space, which will make it easier if you're in the office all day.\n\nThe space also has front desk service, private offices, and conference rooms, the onsite showers and bike storage - while they're also dog friendly. While events including nutrition workshops.\n\nBerlin WeWork\n\nOpen working spaces give a sense of more freedom and this space in WeWork’s Friedrichshain office gives a collaborative feeling\n\nThe eating area in WeWork’s Friedrichshain office is also Instagram worthy with a funky canteen look to it - with drop down lighting and a rustic feel\n\nAnother reason why WeWork isn't just your standard co-working space is their Berlin office which has large open plan office, with funky artwork and even Pilates in the office.\n\nOpen working spaces give a sense of more freedom and this space in WeWork’s Friedrichshain office gives a collaborative feeling - even if you are working on your own. It has desks and colourful settees in the middle of a the space, with steps which have been made into seating.\n\nThe eating area is also Instagram worthy with a funky canteen look to it - with drop down lighting and a rustic feel.\n\nThe office is based in a vibrant neighborhood and also includes six floors of collaborative workspaces, private offices, and an outdoor space.\n\nLeeds, Duke Studios\n\nWith vibrant colours adorning the film set-style offices it would be a delight to go to work every day if you worked at Duke Studios in Leeds\n\nBased in the up and coming south bank area of Leeds it has offices and co-working spaces for freelancers and entrepreneurs in the creative industries\n\nWith vibrant colours adorning the film set like offices, which opened in 2011, it would be a delight to go to work every day if you worked in these offices.\n\nBased in the up and coming south bank area of Leeds it has offices and co-working spaces for freelancers and entrepreneurs in the creative industries.\n\nThe raw, industrial space has various break out areas to give you freedom to think about your next big project and also a cafe attached to it.\n\nWhile they have also been awarded various co-working office awards in the UK and Europe.\n\nLondon, Public Hall\n\nThe modern and creative design at Public Hall in London includes blue velvet sofas, funky wallpaper and high ceilings\n\nCreated in partnership with leading GovTech venture firm PUBLIC is located at the heart of the UK’s policy making district\n\nBased on the iconic Horse Guards Avenue the new co-working space is primarily for startups, investors and innovators transforming public services.\n\nCreated in partnership with leading GovTech venture firm PUBLIC is located at the heart of the UK’s policy making district.\n\nThe modern and creative design includes blue velvet sofas, funky wallpaper and high ceilings.\n\nThey offer memberships ranging from co-working spaces for 10 days a month to full studio packages.\n\nLiverpool, Launch 22\n\nThe rustic look, including open beams and woodwork, gives the space a edgy but homely look at Launch 22 in Liverpool\n\nOriginating in London's Shoreditch Launch 22 opened its Liverpool office in 2017 - giving entrepreneurs a space in the city to work in.\n\nThe rustic look, including open beams and woodwork, gives the space a edgy but homely look. The roof top also gives it a sociable feel.\n\nThe 4,500sq ft space also has 500MB broadband, hot-desking, table football, ping pong and hot desking.", "description": "These co-working spaces, from all over Europe, are an Instagrammers heaven - with funky bars to vibrant working area - which wouldn't look out of place in a design magazine.", "authors": ["Sarah Finley For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/16/19499684-0-image-a-16_1570636610334.jpg", "published_at": "2019-10-13"}