{"pub": "yahoo", "url": "https://sports.yahoo.com/chase-elliott-leads-hendrick-sweep-talladega-qualifying-223918278--nascar.html", "downloaded_at": "2019-10-13 18:52:28.337663+00:00", "title": "Chase Elliott leads Hendrick sweep in Talladega qualifying", "language": "en", "text": "TALLADEGA, Ala. (AP) -- Chase Elliott rebounded from last week's devastating engine failure to lead a Hendrick Motorsports sweep in qualifying for Sunday's playoff race at Talladega Superspeedway.\n\nElliott turned a lap at 192.552 mph in Saturday qualifying to give Chevrolet the front two rows. Elliott, winner of the April race at the Alabama track, bested Hendrick teammates Alex Bowman, William Byron and Jimmie Johnson in the qualifying session. Bowman and Byron are both challenging Elliott for the seven remaining spots in the next round of the NASCAR's playoffs.\n\n''To have all for Hendrick cars 1-2-3-4 was really sharp,'' Elliott said. ''We'll try to stay with our friends as long as we can tomorrow and try to stay out of trouble.''\n\nScroll to continue with content Ad\n\nElliott last week dropped below the cutline when his engine failed in the opening laps at Dover. He's in the bottom four of the standings with Joey Logano, Clint Bowyer and Ryan Blaney with Talladega and next week's race at Kansas to whittle down the field to eight.\n\nSunday is expected to be a race with a heavy emphasis on manufacturer alignments as Chevrolet, Ford and Toyota have ordered their teams to work together. Elliott ended a seven-race Ford winning streak in April, and now has four Chevrolets at the front of the field.\n\nBut defending race winner Aric Almirola qualified fifth in a pack of six Fords that includes his Stewart-Haas Racing teammate Bowyer, as well as Team Penske drivers Blaney and Logano.\n\n''It's kind of hard to figure out what's going to happen,'' Blaney said. ''You can plan all you want, but sometimes things don't go according to plan, so you just try to stay up front, try to stay in a spot to where you have a chance at the end of one of these things.''\n\nErik Jones was the highest-qualifying Toyota driver at 11th.\n\nStory continues\n\nElliott noted that the plan for manufacturer alliances could be challenged by the starting lineup.\n\n''I've got three teammates behind you, but then not a lot of Chevrolets back behind that for a little while,'' Elliott said. ''So, there are a bunch of other guys stacked in between us. So, we'll see. I'm sure these games will be played pretty early. And hopefully we can stay up front and grab some stage points and hopefully get a win.''\n\nDenny Hamlin will start last after his engine failed on his qualifying lap. He was actually thrilled with the timing, because if the engine was ill, it is far better for the Daytona 500 that it failed on his qualifying lap and not as soon as the race began.\n\n''We were 15 seconds from finishing dead last in this race, so I am very, very fortunate that it happened right there at the end of the lap,'' Hamlin said. ''We're going to be starting in last, but we'll get through there and be fine by the time the race gets going.''\n\n---\n\nMore AP auto racing: https://apnews.com/apf-AutoRacing and https://twitter.com/AP-Sports", "description": "Chase Elliott rebounded from last week's devastating engine failure to lead a Hendrick Motorsports sweep in qualifying for Sunday's playoff race at Talladega Superspeedway.  Elliott turned a lap at 192.552 mph in Saturday qualifying to give Chevrolet the front two rows.  Elliott, winner of the", "authors": ["Jenna Fryer", "Ap Auto Racing Writer"], "top_image": "https://s.yimg.com/ny/api/res/1.2/T7g_Yz01AKGa74ozRIZwUw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwMjQ7aD02ODI-/https://s.yimg.com/uu/api/res/1.2/T9bLCP32ziH70lg3gGx8pg--~B/aD0zNDE7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201910121711619014492", "published_at": "2019-10-12"}