{"pub": "afr", "url": "https://afr.com/technology/pin-pulled-on-logistics-software-company-temando-20191003-p52xf0", "downloaded_at": "2019-10-07 06:54:34.993609+00:00", "title": "Pin pulled on logistics software company Temando", "language": "en", "text": "\"The business will be subject to an orderly shutdown over time, subject to Temando's legal obligations to its customers and other stakeholders,\" Neopost said.\n\nNeopost failed to respond to a request for comment prior to publication.\n\nThe staggered closure of the business has already started putting pressure on local competitor Shippit to pick up the slack, with Shippit co-founder and joint chief executive Rob Hango-Zada saying its closure was an opportunity for Shippit to step up and fill the void.\n\n\"We're conscious that we need to step up and save Christmas for Australia's largest retailers, now that a foreign owner has basically pulled the rug from under them at the busiest time of year,\" he said.\n\n\"Orders will grow 5-fold in a single day during this time, and for mission critical infrastructure like logistics software, investments made by Shippit in our technology platform mean we are well prepared to handle the load.\"\n\nShippit is also in conversations with Temando staff and expects to offer some of the displaced employees jobs.\n\nMr Hartmann is no longer with Temando and has since started two new business Shortlyster and Lyre's Non-Alcoholic Spirit Co. He said it was tough not to feel sad about Temando's closure, despite having moved on from the company a few years ago.\n\n\"I really feel for the remaining employees who have lost their jobs. Perhaps the only silver lining is the chronic skills shortage we have for technical talent in Australia will mean there will be no shortage of job offers for the remaining talent.\"", "description": "Temando was once one of the shining stars of local start-ups, having raised $50 million from a French multinational, but now it's being shut down.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.8929%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_502%2C$y_60/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/fca8bebf568bf58975aeaddb18ee3e0ef9a6a365", "published_at": "2019-10-03"}