{"pub": "npr", "url": "https://npr.org/2019/08/29/755326470/many-britons-react-with-anger-over-suspension-of-parliament", "downloaded_at": "2019-10-19 19:04:14.174338+00:00", "title": "Many Britons React With Anger Over Suspension Of Parliament", "language": "en", "text": "Many Britons React With Anger Over Suspension Of Parliament\n\nEnlarge this image toggle caption WIktor Szymanowicz/NurPhoto via Getty Images WIktor Szymanowicz/NurPhoto via Getty Images\n\nThe leader of Britain's House of Commons on Thursday called lawmakers opposed to the suspension of Parliament \"phony\" and questioned whether they have the \"courage or the gumption\" to change the law or bring down the government to avoid a no-deal Brexit.\n\nSpeaking to the BBC, Jacob Rees-Mogg made the comments a day after Queen Elizabeth II approved an extraordinary request from Prime Minister Boris Johnson to suspend Parliament, known as prorogation.\n\nProrogation leaves Parliament little time to take up Rees-Mogg's challenge — either to pass a no-confidence motion against Johnson or to push back the Brexit date.\n\nLawmakers reconvene Sept. 3 but under prorogation will disband the following week. They return Oct. 14, just 17 days before Britain's Oct. 31 deadline to leave the European Union.\n\nIn 2016, Britain voted in a referendum to leave the EU. Former Prime Minister Theresa May negotiated a divorce deal with the EU but Parliament rejected the agreement three times. The impasse ultimately brought down her government.\n\nMeanwhile, Brexiteers have insisted that despite concerns over economic chaos, Britain must leave even without a deal.\n\n\"All these people who are wailing and gnashing of teeth know that there are two ways of doing what they want to do,\" Rees-Mogg, a member of Johnson's Conservative Party and a confirmed euroskeptic, told the broadcaster. \"One, is to change the government and the other is to change the law.\"\n\n\"If they don't have either the courage or the gumption to do either of those then we will leave on the 31st of October in accordance with the referendum result,\" he added.\n\nJohnson's move infuriated opposition politicians and sparked a strong reaction from many ordinary Britons who turned out in the streets.\n\nThousands of anti-Brexit protesters, some carrying signs that read \"Stop the Coup,\" gathered Wednesday night in Parliament Square. There were smaller demonstrations in Manchester, Cambridge, Cardiff, Edinburgh and Durham, according to the Evening Standard.\n\nProtester Emma Cooper, 28, spoke to The Guardian. \"I feel absolutely livid. I haven't been to a protest for a long time,\" she said. \"What's happening in this country and the right wing shift around the world is really worrying. I think Brexit is xenophobia extended to a bigger level.\"\n\nWell over 1 million people have also signed a petition against suspending Parliament.\n\nCommons Speaker John Bercow, a hard-line \"Remainer,\" called Johnson's move a \"constitutional outrage.\"\n\n\"At this early stage in his premiership,\" he said, \"the prime minister should be seeking to establish rather than undermine his democratic credentials and indeed his commitment to parliamentary democracy.\"\n\nJeremy Corbyn, leader of the main opposition Labour Party, wrote to the queen to protest Johnson's move \"in the strongest possible terms on behalf of my party and I believe all the other opposition parties are going to join in with this.\"\n\nJohnson, who became prime minister barely a month ago, holds a single-seat majority in Parliament, but some of his own party members oppose a no-deal Brexit.", "description": "The leader of Britain's House of Commons called those opposed to the move \"phony\" and questioned whether lawmakers have the \"courage or the gumption\" to bring down the government.", "authors": ["Scott Neuman"], "top_image": "https://media.npr.org/assets/img/2019/08/29/gettyimages-1164576775_wide-53e361fe4dce64a8f3c1ddcfa425db3e8d15a233.jpg?s=1400", "published_at": "2019-08-29"}