{"pub": "marketwatch", "url": "https://marketwatch.com/story/millennials-are-the-new-face-of-the-retirement-crisis-2019-08-19", "downloaded_at": "2019-09-04 23:48:13.540107+00:00", "published_at": "2019-08-19", "title": "Millennials are the new face of the retirement crisis", "language": "en", "text": "You think you are facing a retirement finance crisis?\n\nConsider the millennial generation, those born between 1981 and 1996. Starting this year they became the largest living generation in the U.S.\n\nCompared with their dismal retirement finance prospects, those currently in or close to retirement would seem to be living on Easy Street.\n\nAt least that is the depressing conclusion I draw from recent research into the situation millennials will likely face when they begin to retire around 2050.\n\nThis research, which began circulating on the Social Science Research Network in early July, is entitled “How Will Retirement Saving Change by 2050? Prospects for the Millennial Generation.” Its authors are William Gale, a senior fellow in the Economic Studies Program at the Brookings Institution; Hilary Gelfond, a graduate student at the Kennedy School of Government at Harvard; and Jason Fichtner, a senior lecturer at the School of Advanced International Studies (SAIS) at Johns Hopkins University.\n\nThe researchers first focus on the advantages millennials have as they save and invest for their retirement, relative to previous generations. They then enumerate their relative disadvantages, and it’s no contest. The list of those disadvantages is far longer.\n\nWhen it comes to the advantages, the researchers could come up with just one: Millennials as a group are more educated than any previous generations, which should translate into significantly greater earning potential.\n\nThe researchers also point to a second potential advantage, but in the end it turns out to be a double-edged sword: Millennials as a group are healthier and thus should be able to work until a more advanced age than previous generations. That, in turn, should enable them to save and invest more for their retirement. The double-edged sword is that millennials are also likely to live longer than previous generations, and thus must fund a longer retirement. These two effects could very well cancel each other out.\n\nNow the disadvantages. Note carefully that these are “relative” disadvantages when compared with previous generations:\n\n• Millennials’ “careers have gotten off to a rocky start because of the financial crisis… and the ensuing slow recovery over the subsequent few years.” As a group, therefore, they are not exploiting the full potential of the theoretical advantage afforded them by their greater educational attainment.\n\n• To a greater extent than prior generations, millennials will be employed in “contingent jobs”—the gig economy—that provide little or no automatic enrollment in, or contributions to, any retirement programs.\n\n• Partly because of these first two disadvantages, and also because they have more student debt than prior generations, millennials have lower net worths than previous generations. This is illustrated in the accompanying graph; the median net worth of the 25-35 cohort is today some 40% less (in constant 2016 dollars) than for the comparable cohort in 2001—a huge decline.\n\n• Millennials are marrying, buying homes, and having children later in life than previous generations. These life decisions impact retirement savings in a couple of ways. One is behavioral: People often “feel the need to ‘get settled’ by purchasing a house and raising children before beginning to think about saving for retirement,” as the researchers write. Another is that, by buying a house at a later age, there is less time before retirement for it to appreciate.\n\n•Millennials will inevitably feel the financial burden of whatever the government does to make up funding shortfalls facing Social Security and Medicare. As has been widely discussed, for example, the Social Security trust fund is currently slated to run out of money in 2034, at which point it will be able to pay just 79 cents of every dollar that is otherwise obligated. That comes a decade or more prior to when the millennial generation enters retirement, of course. By definition, any solution to that shortfall will involve either higher taxes, lower benefits, or both.\n\n• Millennials face a future with lower rates return and economic growth than in the past. I have discussed this in prior columns, of course. But to the extent future equity returns are lower than in the past, millennials will find it that much more difficult to build up adequate retirement portfolios even if they didn’t face all the other disadvantages enumerated above. And if interest rates are low when they retire and try to annuitize some of their assets, they will find that the annuity payouts are that much lower.\n\n• Greater inequality. This is a disadvantage because it means that, unless a millennial is among the generation’s very wealthiest, chances are greater that he or she will be among the very worst off. This is where average numbers can paint a misleadingly sanguine picture. For example, the researchers report, the net worth of the bottom 25% of the age 25-35 cohort fell from minus $1,200 in 1989 to minus $5,000 in 2007 and to minus $20,000 in 2016 (all in constant 2016 dollars).\n\nA pretty sobering portrait, isn’t it? As the researchers put it, in their highly refined academicese: “There is clearly cause for concern.”\n\nIs there anything special that millennials can do to overcome these challenges? No. The retirement finance options available to them are no different than those available to previous generations. All that retirement planners can suggest is to pursue those options to the maximum extent possible.\n\nIt’s like being told to go fight a new war with the weapons of the previous one.\n\nOf course, realizing that subsequent generations face overwhelming retirement finance challenges doesn’t mean that those currently in or close to retirement suddenly become better off than before—in any material sense. But perspective does play a crucial role in our outlooks.\n\nAnd as we contemplate what the millennial generation will face when they retire in 2050, we may very well choose to reframe what we otherwise consider to be a crisis into a situation for which we can be thankful.\n\nMark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. Hulbert can be reached at mark@hulbertratings.com.", "description": "That longer lifespan is a blessing and a curse", "authors": ["Mark Hulbert"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GQ720_millen_ZG_20180926132726.jpg"}