{"pub": "zdnet", "url": "https://www.zdnet.com/article/carvana-ceo-ernie-garcia-on-data-science-technology-investment-and-disrupting-an-industry", "downloaded_at": "2019-09-29 23:29:40.962114+00:00", "title": "Carvana CEO Ernie Garcia on data science, technology investment and disrupting an industry", "language": "en", "text": "Carvana: How data informs buying a car online Carvana CEO Ernie Garcia talks to ZDNet editor Larry Dignan about the role of technology in buying and selling cars online. There are a lot of data dots to connect. Read more: https://zd.net/2mRJTK5\n\nCarvana, an e-commerce company focused on selling used cars, is approaching a $4 billion annual revenue run rate courtesy an aggressive expansion plan known for its car vending machines.\n\nCarvana\n\nIn the company's second quarter, Carvana sold 44,000 retail units (cars) and delivered revenue of $986.2 million, up 108% from a year ago. Carvana reported a second quarter net loss of $64.1 million, but is clearly in growth mode as it opened 28 new markets in the quarter for a total of 137.\n\nAnd for fiscal 2019, Carvana is projecting retail unit sales of 167,500 to 172,500 and revenue between $3.6 billion and $2.7 billion. By the end of the fiscal year, Carvana said it will be in 140 to 145 markets and cover 67% of the US population.\n\nBehind that growth is cloud computing, data science and various technologies from the likes of Docusign and Slack as well as home grown efforts to display photos and tours of cars. Carvana also plays in a market ripe for disruption and buying a car in 10 minutes with a 7 day money-back guarantee has its appeal. However, Carvana also faces competition from physical car sales players such as Carmax, which is deploying a omnichannel strategy.\n\nZDNet caught up with Carvana CEO Ernie Garcia to get his perspective on technology investments and the role of data in operations and corporate culture. I researched Carvana's model and ultimately bought a car from the company and the process was largely seamless.\n\nHere are a few takeaways from my conversation with Garcia with the full interview in the video.\n\nCustomer and problem first, then technology. \"I think the way we try to think about every problem is just what does the customer need, and then we try to build from there. So I don't think we start with technology, we usually start with the customer and then we try to back into the solution we have to build,\" said Garcia.\n\n× carvana-1.png\n\nHow data is used. Garcia said data runs throughout Carvana's business. For instance, Carvana looks at feeds of \"hundreds of thousands of cars every single day\" to figure what cars to acquire and at what price. Carvana also reconditions cars so there is process management as well as data on repairs. And naturally, there's the data involved with credit scoring, pricing and structuring financing. The logistics network has to deliver the cards to customers and there's a lot of data about scheduling and routes to optimize.\n\n× carvana-2.png\n\nHow to win with prescriptive analytics Analytics has evolved from the basics -- visualizations, historicals and dashboards -- to the more complex with recommendations and predictions of outcomes. Now it's time to step it up and get prescriptive. Read More\n\nData centric vs. buzzwords. Garcia said data science and algorithms are central to Carvana's business, but there's no need to latch onto to the artificial intelligence and machine learning buzzwords. He said:\n\n(Data science has) a very central role, and I want to try to answer that question in a way that's a little different than normal. I feel like in many of these interviews people can't wait to get the word artificial intelligence or machine learning out of their mouths, because it's so in vogue. But the truth is, foundationally, our problem is a problem that requires a lot of data-centricity. As I said, every car that we buy, sight unseen, is a differentiated asset. Every car is different. We have to collect all the data we possibly can and be intelligent about which cars we buy. We have to look at all the click stream data on our website, which cars customers are attracted to, and be smart about allocating our capital and our inventory to cars that customers want. We've got a standard, a very standard data problem in our credit process, where we're trying to get customers as few a click financing as we possibly can, and so we're going to do all that credit scoring and pricing and structuring. We've got kind of traditional operations research problems in our logistics network, where we have to optimize our scheduling and we have to optimize where we put cars on which trucks, because we own our own logistics network. Just the reality of our business is that there are many, many different data problems inside of it.\n\nBuying vs. building technology. Garcia said differentiating features and products are typically ones that Carvana will choose to build. If the benefits are more incremental, Carvana will choose to buy technology. The other reality to ponder in the buy vs. build technology decision is recognizing that \"every technology problem you tackle is going to end up being many times more difficult than you think when you first set out to tackle it.\"\n\nAttracting talent. Garcia said recruiting talented data-centric people often revolves around having tough problems to solve. \"I think oftentimes the most talented data-centric people are really interested in working on hard problems and they're really interested in making an impact,\" said Garcia. \"The great news is we have hard problems inside of our business.\"\n\n× carvana-3.png\n\nZDNET'S MONDAY MORNING OPENER\n\nThe Monday Morning Opener is our opening salvo for the week in tech. Since we run a global site, this editorial publishes on Monday at 8am AEST in Sydney, Australia, which is 6pm Eastern Time on Sunday in the US. It is written by a member of ZDNet's global editorial board, which is comprised of our lead editors across Asia, Australia, Europe, and North America.\n\nPREVIOUSLY ON MONDAY MORNING OPENER:", "description": "Carvana can sell you a car in 10 minutes and consumers are starting to buy used autos online. Here's how technology is putting Carvana on a nearly $4 billion annual revenue run rate.", "authors": ["Larry Dignan"], "top_image": "https://zdnet3.cbsistatic.com/hub/i/r/2019/09/23/f9f85dc5-7bad-450a-9c1b-e1ad1915d5e3/thumbnail/770x578/052f9321c2f61b057b5496fe28126ab0/carvana-vending-machine.png", "published_at": "2019-09-29"}