{"pub": "yahoo", "url": "https://finance.yahoo.com/news/falconstor-software-hosts-third-quarter-203000271.html", "downloaded_at": "2019-10-23 10:58:46.392622+00:00", "title": "FalconStor Software hosts third quarter 2019 Financial Webcast Presentation And Conference Call", "language": "en", "text": "\n\n\n\n\n\n\n\nAUSTIN, Texas, Oct. 21, 2019 /PRNewswire/ -- FalconStor Software, Inc.'s (FALC) will announce financial results for the third quarter 2019, ending September 30, 2019 after the close of the market on Thursday, November 14, 2019. FalconStor will host a webcast presentation and conference call at 3:30 PM CDT to discuss the results. In conjunction with the conference call, FalconStor will also host a presentation on the internet.\n\nFalconStor (PRNewsfoto/FalconStor) More\n\nWHO:\n\nTodd Brooks, President and Chief Executive Officer,\n\nFalconStor Brad Wolfe, Chief Financial Officer, FalconStor\n\nWHEN:\n\nThursday, November 14, 2019\n\n3:30 PM CDT\n\nHOW:\n\nWebcast and Presentation:\n\nTo participate in the webcast and presentation, please copy and paste the following link into your browser.\n\nFALCONSTOR THIRD QUARTER 2019 FINANCIAL TELECONFERENCE AND PRESENTATION\n\n\n\nConference Call:\n\nPlease dial the following if you would like to interact with and ask questions to FalconStor's hosts:\n\nToll Free: 1-800-367-2403\n\nInternational: 1-334-777-6978\n\nConference ID: 3776223\n\nREPLAY:\n\nA conference call replay will be available beginning November 14th at 6:30 PM CDT through 6:30 PM CDT on November 21st. To listen to the replay of the call, dial:\n\nToll Free: 1-888-203-1112\n\nInternational: 1-719-457-0820\n\nPasscode: 3776223\n\nAbout FalconStor\n\nFalconStor Software, Inc (OTCQB: FALC ) empowers IT professionals to achieve mastery of their data – an organization's most precious asset – so they can responsibly push the boundaries of what's possible in the digital economy. The company's award-winning flagship solution, FalconStor® Data Mastery Platform, is a modern, comprehensive and easy-to-use global data mastery software platform that gives IT professionals centralized data management control across all their resources to reduce operational costs, lower risk, and avoid technology compromises. FalconStor's vendor- and hardware-agnostic solutions are designed to work with existing investments across complex environments, including legacy data centers, hyper-converged infrastructure, cloud, and hybrids.\n\nFounded in 2000, FalconStor is headquartered in Austin, Texas and has additional offices in New York, Europe and Asia. Our solutions are available and supported by a vast network of system integrators and resellers. For more information, please visit www.falconstor.com.\n\n\n\nFalconStor and FalconStor Software are trademarks or registered trademarks of FalconStor Software, Inc., in the U.S. and other countries. All other company and product names contained herein may be trademarks of their respective holders.\n\nLinks to websites or pages controlled by parties other than FalconStor are provided for the reader's convenience and information only. FalconStor does not incorporate into this release the information found at those links nor does FalconStor represent or warrant that any information found at those links is complete or accurate. Use of information obtained by following these links is at the reader's own risk.\n\nCONTACT INFORMATION\n\nFor more information, contact:\n\nBrad Wolfe\n\nChief Financial Officer FalconStor Software Inc.\n\ninvestorrelations@falconstor.com\n\n\n\n\n\nCONTACT US AROUND THE GLOBE Corporate\n\nHeadquarters Europe Headquarters Asia Headquarters 701 Brazos Street Rosa-Bavarese-Straße 3 Room 1571, NCI Tower, 12A Jianguomenwai Ave Suite 400 80639 Munich, Germany Chaoyang District Austin, Texas 78701 Tel: +49 (0) 89.41615321.10 Beijing, 100022 China Tel: +1.631.777.5188 salesemea@falconstor.com Tel: +86.400.120.6287 salesinfo@falconstor.com\n\nsalesasia@falconstor.com\n\n\n\n\n\nCision More\n\nView original content to download multimedia:http://www.prnewswire.com/news-releases/falconstor-software-hosts-third-quarter-2019-financial-webcast-presentation-and-conference-call-300941329.html", "description": "AUSTIN, Texas, Oct. 21, 2019 /PRNewswire/ --  FalconStor Software, Inc .'s (OTCQB: FALC) will announce financial results for the third quarter 2019, ending September 30, 2019 after the close of the market ...", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/d26lGUCPEM_XlKzkWvBsDQ--~B/aD0yOTt3PTQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://globalfinance.zenfs.com/en_us/Finance/US_AFTP_PRNEWSWIRE_LIVE/FalconStor_Software_hosts_third_quarter-b8a861c37a5d461f7cc75bfa25f1b15d", "published_at": "2019-10-21"}