{"pub": "huffpost", "url": "https://huffpost.com/entry/judge-aaron-persky-brock-turner-case-coaches-girls-high-school-tennis_n_5d78dac4e4b094928f090a5d", "downloaded_at": "2019-09-11 13:50:27.305717+00:00", "title": "Judge Recalled After Brock Turner Case Now Coaches Girls High School Tennis", "language": "en", "text": "The judge in the Brock Turner sexual assault case, who was recalled after sentencing the former Stanford University student to just six months in jail, is now coaching girls tennis at a high school in California.\n\nAaron Persky, the former Santa Clara County Superior Court judge, took a job this fall at Lynbrook High School in San Jose, California, where he’s coaching junior varsity girls tennis. Rachel Zlotziver, a spokesperson for the Fremont Union High School District, confirmed to HuffPost that Persky is working at Lynbrook High under his full name, Michael Aaron Persky.\n\nPersky applied for the position over the summer and “successfully completed” all of the hiring requirements, Zlotziver said.\n\n“He was a highly qualified applicant for the position, having attended several tennis coaching clinics for youth, and holds a high rating from the United States Tennis Association,” she said.\n\nZlotziver added that the school was apparently unaware of Persky’s involvement in the Turner case, telling HuffPost that the information “was brought to [the school’s] attention” late last week.\n\nThe school held a meeting with parents of the JV and varsity girls tennis teams on Monday after some had voiced concerns about Persky coaching young girls.\n\n“Our focus remains on ensuring that our students have the best possible educational experience ― both academically and athletically,” Zlotziver said.\n\nMediaNews Group/The Mercury News via Getty Images via Getty Images Judge Aaron Persky talks to the media at the No Recall campaign rally in front of the Santa Clara County Government Center in San Jose, California, on Wednesday, May 30, 2018.\n\nResidents of Santa Clara County voted to recall Persky from the bench in June 2018 after his controversial sentencing in the Turner case. Turner was arrested in 2015 for sexually assaulting an unconscious woman behind a dumpster during a fraternity party at Stanford.\n\nHe was later convicted on three felony assault charges: sexual assault of an unconscious person, sexual assault of an intoxicated person and sexual assault with intent to commit rape. Although he faced up to 14 years in prison, Persky sentenced him to only six months in county jail and three years of probation. Turner was released after serving three months.\n\nPersky said part of his decision in giving Turner such a light sentence was due to “mitigating” factors like the role that alcohol played in the assault.\n\n“A prison sentence would have a severe impact on him. I think he will not be a danger to others,” Persky infamously said during sentencing.\n\nA petition to remove Persky from his coaching position at Lynbrook has already been created.\n\n“We as a community should be so disappointed in my alma maters the decision to hire recalled Judge Aaron Persky as their new Tennis Coach for the girls’ JV team,” the petition reads. “Survivors deserve better. Our community deserves better. We can, should, and ought to do better. Fire Persky from Lynbrook High, now.”\n\nThe survivor in the case, who read a historic victim impact statement in court, was known only as “Emily Doe” throughout the trial. Just last week, she revealed her identity as Chanel Miller as she prepares to release her highly-anticipated memoir, “Know My Name.”", "description": "Former judge Aaron Persky now coaches girls junior varsity tennis at a high school in California, and many parents are not happy about it.", "authors": ["Women'S Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d78dc542300001005512c91.jpeg?cache=j4xt9owcrt&ops=1778_1000", "published_at": "2019-09-11"}