{"pub": "washingtonpost", "url": "https://washingtonpost.com/outlook/2019/09/22/what-justin-trudeaus-brownface-photo-says-about-white-innocence", "downloaded_at": "2019-09-22 13:12:04.246283+00:00", "title": "What Justin Trudeau’s brownface photo says about white innocence", "language": "en", "text": "Both apologized but the incidents have raised questions: How could they have appeared in blackface without knowing it was deeply racist and wrong? Why were people still doing blackface, an old-fashioned practice that has long been unacceptable in public spaces, into the 2000s? How have these yearbook photos gone unnoticed this long?\n\nThe answer to all of these questions is related to the production and preservation of “white innocence” — the mechanisms white people have deployed to absolve themselves of their participation in racist practices. The public has focused, in these moments, on what individuals like Northam and Trudeau were thinking. But doing blackface is more than the action of one individual, it is a socially sanctioned event that encompasses many others, including the smiling partygoers flanking Trudeau, the people responsible for the yearbook layout, the school officials who approved the design and the community members who flipped through the pages and remained silent.\n\nThey all played a role in the performance of blackface and in the preservation of white innocence. Understanding those roles and the apparatus behind these photos sheds light on how racism permeates everyday culture and how blackface has endured.\n\nBlackface has roots in the 19th century minstrel show, when white performers blackened their faces and imitated black people in condescending, stereotypical ways. As scholars have shown, racial anxiety and desire fueled these practices, while the performances brought together ethnic working-class audiences and solidified their claims to whiteness. By the mid-19th century the minstrel show had become the most popular entertainment of the day, embraced by white mainstream society, whose audiences laughed at depictions of African Americans as unintelligent, lazy, violent and childlike.\n\nMany people embraced those depictions as real, which in turn reinforced ideas about white supremacy and black inferiority that were used to justify racial discrimination and violence against African Americans in the Jim Crow era.\n\nBy the 1920s, the professional touring minstrel shows had nearly vanished, losing out to vaudeville and then film and radio entertainment. But minstrelsy lived on in local communities. Churches, civic organizations, colleges and schools put on shows for fun and charity. A national industry of how-to guides, makeup and props emerged to meet these demands. Companies produced scripts for young children, for all-women groups and for mixed groups of men and women.\n\nAmateur shows featuring white people donning blackface remained popular into the 1950s and in some places even persisted into the 1970s. And they were everywhere — in every state and in large cities, suburbs, college campuses, small towns and even in Canada.\n\nLooking back on the long popularity of blackface minstrelsy, did performers and audiences know it was racist? Should we accept the familiar defense that they were simply products of their time?\n\nIn fact, that explanation is an instrument of white innocence, akin to “I didn’t know it was wrong.” It ends the discussion. We should instead insist on asking, what is it about their time — or any time — that led so many white people to put on blackface? Regardless of an individual’s intent, these performances dehumanized African Americans and reproduced ideas of black inferiority that sustained discrimination.\n\nIn addition, despite blackface’s widespread popularity, some people were telling the larger public that these performances were wrong. African American leaders vocally protested blackface and its accompanying stereotypes, making clear the racist implications of these representations. By the 1940s and 50s, the NAACP regularly wrote to groups imploring them to cease doing minstrel shows.\n\nSome did. Others were oblivious to these critiques. Still others defended the practice. For example, in response to a letter from the NAACP in 1950, the University of Vermont president refused to end the school’s annual blackface “Kake Walk” show, claiming that it was a long tradition that had emerged from “the genius of your own people.” That show finally ended in 1970. Others reasoned that blackface was wholesome family fun or that the performers meant no harm.\n\nSuch claims epitomized white innocence — disowning the racial intent even when called out by a civil rights group.\n\nIn the shadow of the civil rights movement, images on television and in newspapers of actual black people marching and protesting may have made minstrelsy appear especially dated or even awkward. And minstrel shows did fade slowly.\n\nBut crucially, when they died, the practices of white innocence kicked in: communities buried the memory of those shows, never discussing the destructive nature of blackface or its relationship to the present. Those silences and the historical forgetting helped blackface to survive, no longer in minstrel shows but now at school events, talent shows and in yearbooks. Although blackface was no longer central to popular entertainment, people still did it, and they were unlikely to be ostracized for it. After all, people continued to snap those photos, put them in the yearbook and then approve and print those yearbooks.\n\nIn the 21st century, blackface has largely become taboo but it still makes occasional appearances at Halloween, and on Instagram and Snapchat. As the perpetrators are chastised, they often draw on a well-worn defense — that they meant no harm or that they didn’t know it was wrong — sometimes even arguing that they were paying homage to a black celebrity or political figure. Underlying their defense, like that of many minstrel show organizers of the mid 20th century, is that their intentions mattered more than the consequences of perpetuating a demeaning racial caricature.\n\nToday, because the public in general and communities in particular have not reckoned with their long involvement in blackface, each new yearbook reveal is wrongly framed as an isolated event from the distant past. But these events are not isolated nor so distant. Framing them as such preserves white innocence and makes historical reckoning that much more evasive.\n\nThroughout the 20th century, blackface was not carried out by a few people on the fringe; it was put on by the Rotary Club, the Presbyterians and the eighth graders at the neighborhood school. Shows attracted hundreds or even thousands of spectators and garnered front-page headlines in the local newspapers. Knowing that history and shifting our focus from the individuals in these photos to the broader community of people who encouraged and sanctioned their production can help us confront the deep and often local cultural practices that perpetuate racial disparities.\n\nOf course Justin Trudeau should have known better as a teacher in 2001. That he and the other people smiling in that photograph thought nothing of brownface is a reflection of the partial truth that societies like the U.S. and Canada have told about the enduring power of white supremacy. Being ignorant of the history of blackface is not to be innocent of it, however, and such claims of innocence have always been dangerous.", "description": "Racist incidents are not isolated or distant in the past.", "authors": ["Stephen A. Berrey", "Stephen A. Berrey Is Associate Professor Of American Culture", "History At The University Of Michigan", "Author Of"], "top_image": "https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TEFC6DG4E4I6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-22"}