{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7583247/Couple-spent-60k-renovating-280k-home-slam-cowardly-busybody.html", "downloaded_at": "2019-10-17 11:36:34.963915+00:00", "title": "Couple who spent £60k renovating their £280k home slam 'cowardly busybody'", "language": "en", "text": "A couple who spent £60,000 renovating their home have slammed a 'cowardly busybody' who sent them of a photo of their own house with 'what a mess' scrawled across the back.\n\nMarcus Thickins, 34, was stunned when he received the 'poorly written' insult written on the reverse of the picture, with the anonymous writer seemingly taking offence to an unpainted fence panel.\n\nSupermarket logistics manager Marcus, along with wife Annie Thickins, have spent two years gutting their £280,000 three-bedroom house in Somerset and transforming it into the dream family home for them and their two children.\n\nA couple who spent £60,000 renovating their home have slammed a 'cowardly busybody' who sent them of a photo of their house with 'what a mess' scrawled across it\n\nMarcus Thickins (pictured), 34, was stunned when he received the 'poorly written' insult written on the reverse of the picture, with the anonymous writer seemingly taking offence to an unpainted fence panel\n\nThe couple have even now downed their paintbrushes and have held off finishing painting the fence as they 'refuse to be bullied into finishing it by a busybody'\n\nHowever Annie, 33, opened their mail and discovered the 'petty' note on a picture of their semi-detached home, which focused on the six foot high fencing.\n\nFather-of-two Marcus saw the note when he returned from work on October 1st and believes the raging writer has taken umbrage to the fencing where rain has washed off some paint and two posts that have yet to be levelled.\n\nThe couple have even now downed their paintbrushes and have held off finishing painting the fence as they 'refuse to be bullied into finishing it by a busybody'.\n\nMarcus, from Clevedon, Somerset, said: 'Somebody went to the trouble of taking a photograph of the outside of my house, printed it off on a professional photo printer and mailed it to me in the post - it's not normal.\n\n'There's no crime in sending someone a picture of the outside of their house.\n\n'But the fact it's been poorly written in an effort to disguise the person's writing and then posted makes me think they don't want to talk about what's bothering them with me - it's cowardice.'\n\nPuzzled Marcus said he and his wife poured over the photograph, at a loss at the conclusive issue the note writer had with their home.\n\nMarcus said: 'In the back garden there's a trampoline, a climbing frame and 10ft flagpole with a pirate flag on it - as you do when you've got a four-year-old.\n\nSupermarket logistics manager Marcus, along with wife Annie Thickins, have spent two years gutting their £280,000 three-bedroom house in Somerset and transforming it into a family home for them and their two children\n\n'She doesn't do princess and ponies, she does pirates and dinosaurs.\n\n'If the issue was with any of the play equipment or the pirate flag that wouldn't have been the photograph I'd have taken.\n\n'The photograph looks very specifically to be of the fence and the wall. The only thing wrong with that fence is we haven't trimmed down the fence posts yet to the same height as the panels.\n\n'It also needs one last coat of paint on a couple of the end panels where we started doing it and it rained and the paint's washed off.\n\n'What on earth is possessing anyone to think it's anyone's business but mine? I could understand if it's somebody who lived nearby and had to see it every day but it's not.\n\nFather-of-two Marcus saw the note when he returned from work on October 1st and believes the raging writer has taken umbrage to the fencing where rain has washed off some paint and two posts that have yet to be levelled\n\n'I know it's not one of our neighbours because the address on the envelope has the name of the road incorrectly and I would assume they know where they live.\n\n'It's got to be somebody who is either doing the school run to the school at the end of the road or just some busybody with nothing better to do.'\n\nMarcus and Annie bought the property at the end of 2017 and have ploughed a huge amount of time and money into overhauling it.\n\nSince moving in they've replaced the concrete guttering, repaired the roof, put up new fencing and had a new driveway and patio laid.\n\nAll the windows and doors have been replaced, the kitchen and two bathrooms have been renovated, seven laminate floors have been installed and the whole place has been rewired.\n\nMarcus said: 'We've done a full renovation and apart from things like the electrics and the plastering we've done it all ourselves because we're pretty competent DIY-ers.\n\n‹ Slide me › Father-of-two Marcus saw the note when he returned from work on October 1st and believes the raging writer has taken umbrage to the fencing where rain has washed off some paint and two posts that have yet to be levelled\n\n'A year of that time we've also had a baby while doing all the work - so we've been busy.\n\n'All the fencing we put up ourselves so we're painting it ourselves in our spare time, but obviously with two kids and us both working we don't have a lot of spare time.\n\n'With the house being on a corner plot there's a lot of side space hence the need for a lot of fencing.\n\n'We had an initial budget of £40,000 to renovate but we've spent closer to £60,000.\n\n'The property has totally changed since we bought it, I'm really proud of it, and from talking to a lot of the neighbours they really appreciate the fact that it isn't an eyesore anymore.\n\n'The outside space was all overgrown shrubs and brambles sticking out everywhere, and there was a dilapidated chicken coop in the front garden that I had to demolish.\n\n'The road now smells a lot sweeter since that's gone.'\n\nHaving hacked away at the overgrown foliage, the couple opted to put up fencing to ensure the garden was safe for their two young children, Jessica, four, and 10-month-old Evan.\n\nMarcus said: 'There are very low walls all around the property and once we cut back the vegetation we have to put the fencing up because I don't want the children running out into the road.\n\n'We're just about finished now, painting the fence was the last little bit - then we got this letter.'\n\nMarcus said he and wife Annie were able to brush off the contents of the note, but were concerned that the recipient may have been someone vulnerable who could have been upset by it.\n\nMarcus said: 'To start with, I was just very confused as to why somebody would take those particular steps of taking a photograph, printing it out and then sending it to me with a stamp on.\n\n'Then I was quite angry and remember thinking 'why on earth would somebody do this?'\n\n'Having thought it through over the last few days I'm really quite concerned about who could have received this note.\n\n'We're a perfectly happy little family getting on doing up our house but if somebody else who is a bit more vulnerable received that, who knows what that letter might have done to their mental health? It's just irresponsible.'\n\nThe couple had planned to get the panelling finished during the next sunny weekend they had free - but instead decided to put their paintbrushes down and spend the time doing something else.\n\nMarcus said: 'Last week it was a lovely sunny day here and Annie's original plan was on the next sunny day to finish painting the fence. But now it's at the bottom of the list.\n\n'But after receiving that petty little note it's now at the bottom of the list.\n\n'I'm not going to let someone bully us into finishing the fence.'", "description": "Marcus Thickins, 34, was stunned when he received the 'poorly written' insult written on the back of the snap, with the anonymous writer seemingly taking offence to an unpainted fence panel.", "authors": ["Rod Ardehali For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/10/19828524-0-image-a-12_1571304106212.jpg", "published_at": "2019-10-17"}