{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/16/all-raise-expands-vc-cohorts", "downloaded_at": "2019-10-16 13:35:59.582914+00:00", "title": "All Raise expands to new geos, launches ‘VC Cohorts’ – TechCrunch", "language": "en", "text": "Dozens of impeccably dressed women outfitted in jumpsuits and Rothy’s gathered at the Greylock offices last week for a “structured networking” session hosted by All Raise, an 18-month-old nonprofit organization that seeks to amplify the voices of and support women in tech.\n\nThe organization, active in the Bay Area and New York City, is announcing new chapters in Los Angeles and Boston this week, as well as a new director of engagement, Domonique Fines, formerly of Y Combinator, and a new chief of staff, Jack Dorsey’s former chief of staff at Square, Alicia Burt.\n\nAll Raise chief executive officer Pam Kostka, who joined the business earlier this year, says demand for an All Raise presence in local geographies continues to increase: “Women are hungry for the support and guidance we provide,” Kostka tells TechCrunch. “I think the movement is just gathering momentum.\n\nWith a focus on female venture capitalists and founders, All Raise hosts an annual conference, several in-person and virtual fundraising workshops and networking sessions and, recently, the group began creating curated peer groups for investors. Called VC Cohorts, All Raise is for the first time speaking publicly about how these 12-person subgroups will give their members career guidance and, perhaps more importantly, the ability to share deals.\n\n“The idea was how do we hack the old boys’ network? said Elisa Schreiber, Greylock’s vice president of marketing and a member of All Raise’s advisory committee. “We have to force this familiarity, connectivity among women in venture so that people are helping each other.”\n\nCurrently, All Raise manages 14 active cohorts made up of 175 women. The idea is to put women with check-writing abilities, typically partners and general partners, together in groups with newer VCs, typically with an associate or principal title, paired together. These groups are expected to meet every six to eight weeks to talk shop.\n\n“It’s basically like having 12 coffee chats in one evening,” Impact Capital managing partner Heidi Patel, who helps oversee the VC Cohorts program, tells TechCrunch. “It’s highly concentrated. It’s highly efficient and everyone walks out of there feeling like they’ve got a new tool in their tool kit.”\n\nThe new program has already proven an effective avenue for deal sourcing. During the first VC Cohorts meeting, NEA partner Vanessa Larco found an investor to lead the Series B of one of her existing portfolio companies, an Atlanta identity and credential verification startup called Evident. That Series B lead was Aspect Ventures partner (now a founding partner at aCrew Capital) Lauren Kolodny. The two All Raise members now sit on the company’s board of directors.\n\n“Our cohort meetings always end with talking about portfolio companies that are currently raising,” Larco said in a statement. “I didn’t expect to share a deal with someone in my cohort, but she was an ideal investor for one of my portfolio companies.”\n\nMale VCs have always had cross-firm relationships that facilitate deal-making. Women, who are much less represented — occupying only 11% of investment partner roles, according to Crunchbase News — have historically had fewer resources available to develop these critical relationships.\n\nMoving forward, All Raise will continue building and launching new products tailored for women in tech, add additional folks to the small but growing All Raise team and determine how they can better reach women outside of VC hubs.\n\n“Just because you’re sitting in Oklahoma doesn’t mean you don’t have the most amazing idea that can disrupt an entire category,” Kostka said.", "description": "All Raise has established new chapters in Los Angeles and Boston.", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/DSC06135.jpg?w=600", "published_at": "2019-10-16"}