{"pub": "afr", "url": "https://afr.com/companies/infrastructure/cimic-reports-53m-cash-deficit-20191023-p533d1", "downloaded_at": "2019-10-23 09:44:03.405349+00:00", "title": "CIMIC reports $53m cash deficit", "language": "en", "text": "Construction group CIMIC has reported a $53 million cash deficit at the end of September after applying new accounting rules related to leases that require companies to bring liabilities back on their balance sheets.\n\nThe new cash deficit of the company, which is building several of Australia's biggest infrastructure projects, including Sydney motorway WestConnex, compares with a cash position of $494.9 million three months ago and $453 million a year earlier.\n\nThe deficit was caused by $1.24 billion of gross debt in the third quarter and $879 million of lease liabilities, which have been restated due to a new standard known as AASB16 that requires companies to put the cost of operating leases on their balance sheets. Excluding the lease liabilities, CIMIC had net cash of $826.3 million.\n\nCIMIC, which released its third quarter results late on Tuesday after financial markets closed, also said operating cash flow slid 29 per cent to $282 million in the three months to September compared with a year earlier.\n\nThe company's earnings conversion rate dropped to 52 per cent from 80 per cent a year earlier. It has blamed the fall in the conversion rate on winning more \"alliance-style\" contracts, which pay contractors throughout the project rather than giving them big up-front payments (as is the case in fixed-price contracts, which shift the risk of design and construction onto the contractor) as well as growth in its mining business.\n\nNet contractor debtors, which reflect how much money CIMIC is owed, rose to $1.51 billion from $1.44 billion three months earlier.", "description": "A new accounting standard related to leases has hurt the construction group's quarterly cash position.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2361%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_110/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/91f43bd772ff39599de39d8a9f6884855d356e13", "published_at": "2019-10-23"}