{"pub": "foxnews", "url": "https://foxnews.com/entertainment/shark-tank-kevin-oleary-linda-oleary-fatal-boat-crash-charge-regrettable", "downloaded_at": "2019-09-25 13:47:15.605439+00:00", "title": "'Shark Tank' star Kevin O'Leary's wife's lawyer calls fatal boat crash charge regrettable", "language": "en", "text": "The lawyer for \"Shark Tank\" star Kevin O'Leary's wife is calling Canadian authority's decision to charge her in a fatal boat cash regrettable.\n\nLinda O'Leary was charged Tuesday with careless operation of a vessel in a boat crash in Canada that killed two people last month.\n\nBrian Greenspan, O'Leary's lawyer, said it is regrettable and inappropriate that police have decided to charge her with a \"regulatory offense under the Shipping Act.\"\n\n'SHARK TANK' STAR KEVIN O'LEARY'S WIFE LINDA CHARGED IN FATAL BOAT CRASH\n\n\"She has always been a cautious and experienced boater who came into collision with an unlit craft on a dark and moonless night,\" he said. \"The other boat was sitting in a dark spot on a lake, no cottage lights nearby, no moon.\"\n\nGreenspan said the maximum penalty is not eight months imprisonment or a $1 million fine. He said it's $10,000.\n\n\"They are absolutely wrong. That applies to ocean going vessels. The pleasure craft provision is a maximum $10,000 fine,\" he said.\n\n'SHARK TANK' STAR KEVIN O'LEARY'S ACCOUNT OF FATAL BOAT CRASH UNDER SCRUTINY AS ABC, CO-STARS STAY QUIET\n\nGreenspan said any suggestion or rumor that Kevin O'Leary was operating the boat is false. \"Unequivocally, clearly, without any risk of contradiction he was not the driver. He was a passenger,\" Greenspan said.\n\nTwo boats crashed Aug. 24 on Lake Joseph near Seguin, Ontario, killing 64-year-old Gary Poltash of Florida and a 48-year-old woman identified as Susanne Brito, a mother of three.\n\nOntario Provincial Police Sgt. Carolle Dionne said Linda O'Leary is scheduled to appear in court on Oct. 29.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nPolice have also charged 67-year-old Richard Ruh of Orchard Park, New York, with failing to exhibit navigation lights while underway. Ruh was the operator of the other boat.\n\nDionne declined to give specifics on why O'Leary was charged with careless operation of a vessel because the matter is now before the courts.\n\nDionne said the maximum penalty O'Leary faces is 18 months imprisonment or a $1 million fine.\n\nThe Associated Press contributed to this report.", "description": "The lawyer for \"Shark Tank\" star Kevin O'Leary's wife is calling Canadian authority's decision to charge her in a fatal boat cash regrettable.", "authors": ["Sasha Savitsky", "You Can Find Sasha Savitsky On Twitter"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/24/694940094001_6089148462001_6089148546001-vs.jpg", "published_at": "2019-09-25"}