{"pub": "cnbc", "url": "https://cnbc.com/2019/09/09/ecb-prospects-for-qe-rate-cuts-divides-economists.html", "downloaded_at": "2019-09-09 10:25:01.548385+00:00", "title": "Analysts divided on ECB stimulus prospects amid conflicting tones from officials", "language": "en", "text": "Analysts are split over what to expect from the European Central Bank (ECB) on Thursday, after central bank officials moved to downplay market expectations of immediate and substantial quantitative easing (QE). In June, ECB President Mario Draghi confirmed he was exploring measures to boost the 19-member euro zone economy, citing persistent low inflation and sluggish growth. These have been mooted to include a change in forward guidance, rate cuts, a tiered deposit rate and recommencing asset purchases, or QE. However, ECB officials have dampened hopes of a substantial monetary stimulus package of late. French central bank President Francois Villeroy de Galhau and Estonian central bank President Madis Muller are the latest to cast doubt on the scale of intervention. They join Sabine Lautenschlager, a member of the ECB executive board, Klaas Knot, president of the Dutch central bank, and Bundesbank President Jens Weidmann, who have all signaled skepticism about relaunching QE. The thrust of their comments seemed to contradict both Draghi and Ollie Rehn, president of the Bank of Finland, who recently called for an \"impactful and significant\" stimulus package.\n\n'Puzzling' change of tone\n\nShweta Singh, managing director of global macro at TS Lombard, said in a note Wednesday that the shift in ECB communications was \"puzzling.\" With Italy's economy stagnating in the second quarter while Germany, the euro area's largest economy, contracting and indicating further weakness to come, Singh suggested there was \"little room for optimism on the economic outlook.\" \"Manufacturing remains in the doldrums and the weakness is spreading quite rapidly to services. Businesses are revising lower their hiring and expansion plans, citing weak demand as a key constraint on production,\" Singh said. The central bank's QE program has long proven controversial in Germany, where the country's constitutional court is embroiled in an ongoing case centering on whether the ECB's bond-buying constitutes so-called \"monetary financing,\" which is prohibited under EU law. Singh also highlighted that a combination of a new round of tit-for-tat tariffs in the U.S.-China trade war, a strong dollar weighing on global financing conditions and dampening demand for euro area exports, and the chaos surrounding Brexit does little to ease these concerns. Without a great deal of support from fiscal policy, she suggested the ECB will have to do the heavy lifting, but the effectiveness of a fresh round of stimulus would depend on what form it takes.\n\n\"The marginal benefits of cutting rates that are already negative are limited at best, even if such a move is accompanied by a new round of cheaper long-term refinancing operations (TLTROs) and a tiering of deposit rates,\" Singh said. She added that on the other hand, a second round of quantitative easing by the ECB (QE2) could provide a more meaningful boost to monetary and financing conditions. However, this would still have a milder impact than QE1, when \"borrowing costs were higher, fragmentation across the euro area was severe and domestic risks were far greater.\" \"Crucially, there may be much less scope this time for the euro to edge lower and thus boost inflation expectations, while the pool of eligible assets that the ECB can buy has shrunk since QE1 was launched.\" TS Lombard researchers expect that QE2 could be around a third of the size of the 2.6 trillion euros ($2.88 trillion) injected in QE1. However, they projected that if the ECB was to loosen some of its self-imposed constraints on asset purchases, such as raising issuer limits from 33% to 50%, it could buy up to 1.5 trillion euros in government, supranational and non-bank private sector debt. Singh's team still expects a package of stimulus on Thursday, but cautioned that cutting rates without QE2 would be a \"recipe for disaster.\"\n\nGo big or go home?\n\nFor the ECB to close a 0.5% inflation gap, at least 600 billion euros of QE2 would be needed, according to Pictet senior European economist Frederik Ducrozet. In a note published Thursday, Ducrozet suggested that if anything, the decreasing marginal returns of QE and the risk of a \"de-anchoring of inflation expectations\" call for an even more aggressive program. \"Our initial expectation was for QE2 to be set at 50 billion euros per month over 12 months,\" Ducrozet said. \"A compromise could take the form of a smaller quantum of purchases for longer—say 30 billion over 18 months, 25 billion over two years, or even open-ended asset purchases linked to a state-contingent forward guidance. Either way, we expect the issuer limits to be raised from 33% to 50%.\"", "description": "Analysts are split over what to expect from the European Central Bank (ECB) week, after central bank officials moved to downplay market expectations of immediate and substantial quantitative easing (QE).", "authors": ["Elliot Smith"], "top_image": "https://image.cnbcfm.com/api/v1/image/105015920-GettyImages-545058564.jpg?v=1532563682", "published_at": "2019-09-09"}