{"pub": "huffpost", "title": "George Takei On Reliving Japanese American Concentration Camp Experience On Set", "url": "https://huffpost.com/entry/george-takei-on-reliving-japanese-american-concentration-camp-experience-on-set_n_5d52b766e4b0cfeed1a36591", "language": "en", "published_at": "2019-08-14", "downloaded_at": "2019-09-02 07:06:50.489108+00:00", "text": "Legendary actor George Takei lived some of the earliest years of his life behind barbed wire, when Japanese Americans were incarcerated during World War II.\n\nFor his latest television show, “The Terror: Infamy,” a horror series that centers around the lives of a Japanese American community during that era, Takei had to relive the chilling experience.\n\nThe actor sat down with HuffPost to chat about his time on the show and how he felt confronting a set that looked eerily similar to the camps where he was imprisoned.\n\nLooking at it as an adult, and imagining my parents going into that black, shabby, rustic space, I felt my parents’ pain in absentia. George Takei\n\nHe explained that because he was so young during Japanese American incarceration, he hadn’t fully registered the gravity and trauma inflicted on his community at the time. But now, looking at such a realistic version of the camp, Takei said he was agonized thinking about his parents’ experience.\n\n“Looking at it as an adult, and imagining my parents going into that black, shabby, rustic space, I felt my parents’ pain in absentia,” he said. “I felt their anguish and their sense of rage to be inflicted by all that.”\n\n“The Terror: Infamy” follows a series of bizarre deaths that haunt the community as well as a mysterious entity that plagues them all. Lead character Chester Nakayama, played by Derek Mio, seeks to grasp the presence that’s further inflicting harm on them during the period of rampant anti-Japanese sentiment.\n\nTakei said that set designer Jonathan McKinstry, who largely based the set on the Manzanar concentration camp, had meticulously researched the incarceration sites. The actor, who was imprisoned with his family at Rohwer War Relocation Center as well as Tule Lake, said that upon seeing the barracks, he was hit with nostalgia. He recalled his childhood adventures with his brother in the dark crawl spaces beneath the barracks as well as other areas of the set.\n\n“When I walked into the mess hall with all the extras and the sound and the clatter and the clamor and the scent ... I recognized it. it was a familiar recognition there,” he said.\n\nTakei explained that he only had begun to comprehend the injustice of Japanese American incarceration after diving into some research in his teen years and underscored how the public has been largely ignorant to the struggles of those in the Asian American community. While “The Terror” represents the rare Asian American plot line that’s made it to the small screen, Takei stressed that this is the result of outspoken advocates who’ve made it their mission to increase awareness around the dark period of U.S. history.\n\n“We were committed to making it possible,” the actor said of getting the story represented on-screen. “Things don’t happen just because people are nice. We have to take proactive part in telling that story and it’s been my lifelong mission to raise the awareness by every medium that we can.”", "description": "The set of the new series \"The Terror: Infamy\" looked remarkably similar to the concentration camps where he had been imprisoned with his family.", "authors": ["Asian-American Affairs Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d5473d03b00004b00dbb085.jpeg?cache=zeseda8p01&ops=1778_1000"}