{"pub": "metro", "url": "https://metro.co.uk/2019/10/09/gareth-thomas-tears-thanks-husband-support-hiv-blackmail-10892106", "downloaded_at": "2019-10-09 22:00:35.406776+00:00", "title": "Gareth Thomas tears up as he thanks husband for support through HIV blackmail", "language": "en", "text": "Gareth Thomas thanked his husband Stephen for support Picture: PA)\n\nGareth Thomas almost broke down in tears as he thanked his husband and stepdaughter for their support following his decision to reveal his HIV diagnosis.\n\nThe 45-year-old bravely told the world that he is living with HIV after people threatened that they would reveal his status but as he accepted the Attitude Awards honour for game-changer, he admitted that they stood by him and have given him ‘the strength to stand here today’.\n\n‘I can’t believe I can stand here when six months ago I came to the conclusion my life was over, so I want to thanks everyone in this room,’ he said.\n\n‘There are two special people in this room I have to thank, my husband and my stepdaughter.\n\n‘Because generally, behind closed doors, when I live in absolute fear being rejected and turned away and not being supported, those two people stood by me and gave me the strength to stand here today so as much as I may be the game-changer, I am only that because they made my life possible.’\n\nGareth Thomas celebrated with husband Stephen and stepdaughter Anna (Picture: Wireimage)\n\nHe concluded: ‘I just want to say, I have HIV but HIV does not f***ing have me.’\n\nAdvertisement\n\nAdvertisement\n\nGareth has been praised for his bravery and openness about living with HIV, having shared his story in the BBC documentary Gareth Thomas: HIV and Me.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nThe former rugby player has kept his marriage out of the limelight, but revealed that he met Stephen when the pair were helping children who were struggling in school.\n\nStephen is from the Valley and the pair live together in Bridgend with Stephen’s daughter, Anna.\n\nStephen, who married Gareth in 2016, said it was ‘horrendous’ seeing his husband being threatened about his HIV positive status, and admits that before Gareth told him, he was ignorant about the condition.\n\nThe medication Gareth takes every morning is enough to suppress the virus, and makes it undetectable and untransmittable.\n\nThe 45-year-old bravely told the world that he is living with HIV after people threatened that they would reveal his status (Picture: Rex)\n\nWhen telling Stephen about his status, the Celebrity Big Brother star wanted to make sure ‘he knew and that he understood everything fully’.\n\nAdvertisement\n\nAdvertisement\n\nHe said: ‘No conversation is difficult with Stephen. He doesn’t judge people. When I told Stephen, he didn’t know anything about HIV.\n\n‘But he trusted me and the conversation was simple to have.’\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Cheryl goes for gold in plunging dress at Attitude Awards 2019 and we stan\n\nMORE: I’m A Celebrity Extra Camp 2019 swaps Scarlett Moffat and Joe Swash for Emily Atack and Adam Thomas", "description": "Gareth Thomas accepted the game-changer accolade at Attitude Awards 2019.", "authors": ["Rebecca Lewis", "Abigail Gillibrand"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/gareththomas-a6d1_1570656073.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-09"}