{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/racing/article-7592165/King-Change-takes-centre-stage-victory-Queen-Elizabeth-II-Stakes.html", "downloaded_at": "2019-10-20 00:25:42.253102+00:00", "title": "King of Change takes centre stage with victory in Queen Elizabeth II Stakes", "language": "en", "text": "In a rarity for 2019, Frankie Dettori was not centre stage as the star of Qipco British Champions day was Queen Elizabeth II Stakes winner King of Change.\n\nDettori still got on the scoreboard, with John Gosden-trained Star Catcher giving him his 18th Group One win of the season and the 250th top-level success with a short-head win from Delphinia in the Qipco Fillies & Mares’ Stakes.\n\nBut the one Dettori and Gosden wanted slipped away as dual Ascot Gold Cup winner Stradivarius was hauled back and beaten a nose by Kew Gardens in the Long Distance Cup.\n\nKing of Change beat The Revenant by a length and a quarter in the Queen Elizabeth II Stakes\n\nThe outcome of the QEII Stakes was nowhere near as nail-biting.\n\nTrainer Richard Hannon has played a patient game with his 12-1 winner but in a season where the search for a dominant force among the three-year-old milers had proved inconclusive, the best may have been saved for last as King of Change beat The Revenant by a length and a quarter. It was only a second run for the mount of Sean Levey since he finished a 66-1 second to Magna Grecia in the 2,000 Guineas in May.\n\nThat had been easy to dismiss as a fluke, but on Saturday Hannon proved to the world his faith in King of Change was not misplaced. Magna Grecia floundered 30 lengths behind.\n\nHannon said: ‘Perhaps people thought I was a little petulant after not celebrating being second in the 2,000 Guineas but we have always thought the world of this horse.\n\nStradivarius was hauled back and beaten a nose by Kew Gardens in the Long Distance Cup\n\n‘People don’t remember you finishing second in the Guineas but they’ll remember him now. We gave him the summer off because he had a hard race in the Guineas.\n\n‘I’m not going to lie, I thought he’d win or go very close. It will be a shorter winter off the back of this win and we’ll be thinking about races like the Queen Anne Stakes (at Royal Ascot) next year.’\n\nDettori has had a great season but will still reflect on some close shaves. Just like Enable in the Arc, Stradivarius looked the winner a furlong out. But Kew Gardens dug deep to provide the first of a big double for jockey Donnacha O’Brien, who was later successful on Magical in the feature Champion Stakes. Both are trained by his father Aidan.\n\nO’Brien jnr was making hay while Ryan Moore was in Australia.\n\nMagical, three-quarter of a length winner from Addeyyb, has run nine times this season and may not have finished yet, with O’Brien eyeing the Breeders’ Cup.\n\nO’Brien snr said: ‘She’s the ultimate racehorse. Every morning she wakes up and says “what do you want me to do today?”.’", "description": "In a rarity for 2019, Frankie Dettori was not centre stage as the star of Qipco British Champions day was Queen Elizabeth II Stakes winner King of Change.", "authors": ["Marcus Townend For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/22/19937772-0-image-a-6_1571520347555.jpg", "published_at": "2019-10-19"}