{"pub": "yahoo", "url": "https://news.yahoo.com/stewart-embraces-love-quits-tories-104548312.html", "downloaded_at": "2019-10-04 12:37:46.629964+00:00", "title": "Rory Stewart Quits Tories to Run for London Mayor", "language": "en", "text": "(Bloomberg) -- Rory Stewart, who ran against Boris Johnson to be Tory leader and was expelled from the Parliamentary party for voting against the prime minister’s Brexit strategy, announced he won’t run for election again and has quit the Conservative Party.\n\nBut he almost immediately announced his next move. To run as an independent candidate for mayor of London, which he described as “the greatest city on earth.”\n\nDismissing Parliament as a “Gothic shouting chamber,” and saying its divisive politics carried on “as if Trump has never left London,” he said in a video posted online that he wants to move away from the extremism dominating U.K. debate in favor of the politics of “love.”\n\n“Our politicians have been taken hostage by public relations consultants, and despite their optimistic promises, they are privately uneasy, pessimistic, and indecisive leaders, who have little experience of how to actually change the world,” Stewart wrote in an open letter to Londoners published in the Evening Standard newspaper on Friday. “We are only going to succeed when we finally break free from the suffocating embrace of our dying party politics.”\n\nStewart, a former army officer who has confessed to smoking opium, took the Tory leadership contest by surprise with his campaign, in which he pledged to see Theresa May’s Brexit deal over the line and refused to countenance a no-deal split from the EU.\n\nDespite attending Eton, the same elite private school as Johnson, he cut a different figure from his rivals, styling himself as an outsider and making videos as he strode around the country speaking to voters in a series of “Rory’s walks.” He got to the last five candidates before being knocked out of the contest.\n\n“I am proud of not being a professional politician,” he wrote. “I will be spending the coming weeks walking around London — not campaigning, but listening and learning, and walking through every borough.”\n\nTo contact the reporter on this story: Thomas Penny in London at tpenny@bloomberg.net\n\nTo contact the editors responsible for this story: Tim Ross at tross54@bloomberg.net, Robert Hutton, Caroline Alexander\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Rory Stewart, who ran against Boris Johnson to be Tory leader and was expelled from the Parliamentary party for voting against the prime minister’s Brexit strategy, announced he won’t run for election again and has quit the Conservative Party.But he almost immediately announced his next", "authors": ["Thomas Penny"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-04"}