{"pub": "fox", "url": "https://foxnews.com/tech/california-statewide-earthquake-early-warning-system", "downloaded_at": "2019-10-18 01:14:39.918568+00:00", "title": "California launches America's first statewide earthquake early warning system", "language": "en", "text": "Officials in California unveiled the nation's first statewide earthquake early warning system on Thursday.\n\nThe California Earthquake Early Warning System utilizes a smartphone app as well as traditional alert and warning delivery methods, such as Wireless Emergency Alerts.\n\n\"The system uses ground motion sensors from across the state to detect earthquakes before humans can feel them and will notify Californians so that they can ‘Drop, cover and hold on’ in advance of an earthquake,\" said the California Governor's Office of Emergency Services (Cal OES) in a statement.\n\nThe system uses a new version of the MyShake app developed by the University of California, Berkeley, according to the LA Times.\n\nMASSIVE CALIFORNIA EARTHQUAKES COULD BE SEEN FROM SPACE\n\nCalifornia Governor Gavin Newsom and Oakland Mayor Libby Schaaf took part in the launch event at Gateway Park in Oakland. The launch coincides with California’s annual Great Shakeout earthquake safety drill.\n\n\"Today, we are making a big leap forward in terms of focusing attention on prevention - we're announcing the nation's first comprehensive early alert system for earthquakes,\" said Newsom, during the launch event. \"We're announcing the ability for millions and millions of Californians to download an app, MyShake ... if millions of people do that, we will have points of contact, the ability to crowdsource information, the likes of which no country in the world has advanced.\"\n\n\"I say that knowingly, that Japan and Mexico have systems already in place in this space, but because of the extraordinary complementary work that has been done by UC Berkeley, by Caltech, by USGS, and by our own Office of Emergency Service, we feel that we're on the leading and cutting edge in terms of the ability to utilize that technology,\" he added.\n\nThursday also marks the 30th anniversary of the deadly Loma Prieta earthquake, which ravaged the San Francisco Bay area on Oct. 17, 1989. The 7.1 magnitude 'quake killed 63 people and at the time, caused $6 billion in damage.\n\nThe new system integrates the existing ShakeAlert earthquake early warning system, which sends alerts before 'quakes hit. Warnings produced by the ShakeAlert system will be pushed through two delivery systems: the MyShake cellphone app and the same wireless notification system that issues Amber Alerts, meaning people may receive both notifications.\n\nCALIFORNIA MEGA-EARTHQUAKE FEAR: IS THE SAN ANDREAS FAULT AT RISK OF THE 'BIG ONE'?\n\n\"This app is at a place now where we're satisfied with the performance and the testing, which has been very well done, (so) that we think we're at a place where it's not perfect but we can keep people safe, and that's our ultimate threshold,\" said Brian Ferguson, deputy director for crisis communication and public affairs at the Office of Emergency Services, earlier this week.\n\nThe state earthquake app is available for download to iOS users through the App Store and through Google Play stores for Android phones.\n\n“The alerts will only go to people that are going to feel shaking,\" said Richard Allen, director of the UC Berkeley Seismological Laboratory, earlier this week.\n\nCALIFORNIA COMPANY WANTS TO ‘HOVER’ BUILDINGS, PROTECTING AGAINST EARTHQUAKES\n\nThe thresholds for an alert are an earthquake of magnitude 4.5 and shaking intensity level 3. \"Intensity 1 is you don't feel it; intensity 2 is some people may feel it; intensity 3 is many people do feel it,\" Allen said.\n\nThe MyShake system maintains a database of which cellphones are in 10-kilometer-by-10-kilometer (6.2-mile-by-6.2-mile) cell grids and pushes the alerts to phones in zones where at least level 3 shaking will occur, so receiving an alert is not based on which tower the phone is communicating with, Allen said.\n\nThe Wireless Emergency Alerts system, known as WEA, operates slightly differently.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nWEA creates polygons that include cellphone towers, said Ryan Arba, chief of the seismic hazards branch of the Office of Emergency Services.\n\nThe Associated Press contributed to this article. Follow James Rogers on Twitter @jamesjrogers", "description": "Officials in California unveiled the nation's first statewide earthquake early warning system on Thursday.", "authors": ["James Rogers"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/LomaPrietaEarthquakeGetty1989.jpg", "published_at": "2019-10-17"}