{"pub": "yahoo", "url": "https://sports.yahoo.com/cleveland-browns-seven-players-entire-secondary-out-inactive-against-los-angeles-rams-231606196.html", "downloaded_at": "2019-09-23 01:33:17.770164+00:00", "title": "Browns entire starting secondary inactive for matchup against Rams", "language": "en", "text": "The Cleveland Browns defense will have a few new faces on Sunday night when it takes the field at FirstEnergy Stadium\n\nActually, it will have a lot of new faces.\n\n[Watch live NFL games all season long for free on the Yahoo Sports app]\n\nScroll to continue with content Ad\n\nSeven Browns players are listed as inactive for their “Sunday Night Football” matchup against the Los Angeles Rams, including their entire starting secondary.\n\nCornerbacks Denzel Ward and Greedy Williams were added to the Browns injury report on Thursday with hamstring injuries, and were listed as questionable headed into the game. Safety Damarious Randall was already out with a concussion, and safety Morgan Burnett was listed as questionable with a quad injury on Friday.\n\n“You don’t want to rush anything,’’ Burnett said on Friday, via Cleveland.com’s Mary Kay Cabot. “You just want to follow the protocol of the doctors and trainers. But that’s the thing about this business, you’ve got to be accountable and trust one another and everyone can get the job done because if they couldn’t, they wouldn’t be here.\n\nOffensive linemen Kendall Lamm and Chris Hubbard and wide receiver Rashard Higgins are also inactive for Sunday’s game. Higgins was listed as questionable on Friday with a knee injury, and missed their game last week against the New York Jets. Hubbard sprained his ankle during their game against the Jets, and missed practice all week.\n\nWho will step in for the Browns secondary?\n\nStory continues\n\nThe Browns don’t appear to be worried about the excessive absences in their defense.\n\n“Now the guys have the opportunity for their number to be called and I feel like they’re prepared, they’re going to do their job and guys like myself, we do our part and help out the best way we can,” Burnett said, via Cleveland.com.\n\nSafety Jermaine Whitehead and cornerback Eric Murray should see an increase in minutes, as will cornerback T.J. Carrie and cornerback Terrance Mitchell.\n\nWhile stopping Jared Goff and the Rams will be no easy task, Whitehead said he’s looking forward to the challenge — and more than ready to step into his new role.\n\n“It’s time like these in my career when I’ve kind of been able to be that guy to keep everybody together and keep everybody going,’’ Whitehead said, via Cleveland.com. “Like I said, I ain’t looking down at any of my teammates. I’m expecting all of those guys to come out and execute. It’s my turn to be the leader, and I can’t wait to go out and do that.’’\n\nMore from Yahoo Sports:", "description": "The Cleveland Browns defense will have plenty of new faces on Sunday night for their matchup against the Rams.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/5R.LLNiWrKtexfgaLyhyMw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03OTUuNzMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/KSM_MEWTpLypHLqng49zew--~B/aD0xODg4O3c9MzAzNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/d2fc37b0-dd8e-11e9-bfb7-c0ceb68a53b4", "published_at": "2019-09-22"}