{"pub": "nymag", "url": "https://vulture.com/2019/10/kanye-west-jesus-is-king-album-review.html", "downloaded_at": "2019-10-29 00:23:02.483596+00:00", "title": "The Gospel According to Kanye West", "language": "en", "text": "Jesus Is King runs the risk of playing Hillsong to hip-hop. Photo: Kevin Winter/Getty Images for ABA\n\nAl Green was a born pastor, an Arkansas church kid raised in a family so devout they threw him out at 16, when his father found a Jackie Wilson record the young singer smuggled into the home for inspiration. This war between secular and liturgical music, between soul and gospel, raged in Green throughout his early-’70s hot streak, where romantic fare like “Call Me” and “Tired of Being Alone” was balanced out by religious favorites and faithful originals like “God Is Standing By” and “Jesus Is Waiting.” The scales tipped in 1974, when Green’s sometime girlfriend, Mary Woodson, scorned by his refusal to get married, doused him in boiling grits in the bath, and shot herself. By 1976, Green had renounced secular music and become pastor of a Memphis Baptist church. The gospel records bricked on the charts (perhaps unfairly, considering the unbridled fire of performances captured in the 1984 documentary The Gospel According to Al Green), and Green returned to secular music in the ’90s and aughts, but he never left the church.\n\nBob Dylan had a silver cross thrown his way by a fan at a San Diego gig late in his lengthy 1978 world tour, a comeback of sorts after the whimsical Rolling Thunder Revue excursion. Instinctively, he picked it up. Ill in Arizona the next day, he put the cross around his neck. Things got mystical from there. Dylan says an apparition appeared to him in the night. “There was a presence in the room that couldn’t have been anybody but Jesus,” he told the Washington Post in 1980. His next three albums — 1979’s Slow Train Coming, 1980’s Saved, and 1981’s Shot of Love — explored spiritual themes and Christian eschatology, to what critics considered to be diminishing returns. Dylan’s abrupt gospel detour broke his lengthy streak of gold- and platinum-selling studio albums and incurred the wrath of admirers like John Lennon, who, in the last months of his life, rebuffed Slow Train Coming’s “Gotta Serve Somebody” with the caustic answer song “Serve Yourself.” Dylan wouldn’t see another platinum album until 1997’s Time Out of Mind.\n\nThere comes a time, when musicians devote themselves to big questions, where the biggest question of them all comes calling, the question of what, if anything, orders the universe. Sometimes, mercurial ones whose work views the world and its processes from a bird’s-eye view see purpose and intent behind the rhythm and balance of human life. Some take to calling that intent “God.” Inquisitive ones might go long, poring over readings as one might sponge up culture in a trip to another country, as Dylan did in an intensive three-month Bible-study course in the late ’70s, as Kanye West has this year, meeting with pastor Adam Tyson of Santa Clarita’s Placerita Bible Church on Tuesdays to flesh out questions of faith that have informed his art since “Jesus Walks.” “I was being convicted that I was running away from God,” Tyson recalled West saying, interviewed on the Pure Flix podcast this fall, “and I knew I needed to make things right, so I came to Christ.” West’s new album and Imax short film Jesus Is King turn sharply away from the druggy, horny moods of The Life of Pablo and Ye, but can music’s biggest ego be tamed?\n\nKing’s “Follow God,” built on a sample of Whole Truth’s 1974 Christian soul nugget “Can You Lose by Following God,” suggests that Kanye will always be provocative and difficult, nestling a casual boast — “I was looking at the Gram, and I don’t even like likes” — in the middle of a verse about the hard work that goes into being less hardheaded. (In an interview promoting the new album, Kanye told Zane Lowe he is the “greatest artist in human existence” and complained about flak for his recent political affiliations with Atlanta radio personality Big Boy. More on that in a bit.) “Follow God” feels like a bridge out of the breakneck oversharing of Ye’s “Yikes” and Pablo’s “No More Parties in LA.” The new album splits the difference between rousing choir exercises, Christian trap tunes, and holy chipmunk soul workouts that call back to College Dropout, an album that sampled the old spiritual “I Want Jesus to Walk With Me” and covered the 1929 hymn “I’ll Fly Away.” In that sense, Jesus Is King is the man coming full circle.\n\nKanye West’s present rejection of secular music is bound to divide the fandom. People who have come to his music in the past to bask in honesty, affluence, and arrogance won’t find as much of that among the liturgical verses and choruses here. When the old Kanye does show face, it’s to grouse about criticism from inside the church (“What have you been hearing from the Christians? / They’ll be the first ones to judge me”) or else to flex on people who don’t support the new direction (“Switch my, switch my attitude / I’m so, I’m so radical”). These moments bear out the newness of the enterprise. Gospel is a music of the overwhelmed, the weary. Songwriting titan Thomas A. Dorsey wrote the classic “Take My Hand, Precious Lord” having just received news that his wife and infant son passed away in childbirth. The standards of the form — “Rough Side of the Mountain,” “Mary Don’t You Weep,” “Why We Sing,” “Never Would Have Made It,” “Take Me to the King” — are songs of black perseverance. This energy comes and goes on Jesus Is King. West opens “On God” with encouragement for single mothers and incarcerated men but descends precipitously into listing off personal achievements. The message is immediately lost (unless the message is the prosperity gospel, which would explain why Joel Osteen is circling Kanye this month).\n\nThe writing here is about on par with what West achieved last year with Ye, as far as the ratio of quality to cringe apparent in the lyrics. The hook to “Closed on Sunday” — “You’re my Chick-fil-A” — gives a serious message about the downside to fame an undeserved silliness. “Everything We Need” detours into corn in verse two: “What if Eve made apple juice / You gon’ do what Adam do?” When Kanye avoids his worst impulses, these songs get compelling. “Use This Gospel” achieves it by slotting him in between verses from the reunited Clipse, whose story of narrowly missing Fed time is the kind of miraculous testimony this album could use more of. “Hands On” tells a horror story in four lines: “Cut out all the lights, He the light / Got pulled over, see the brights / ‘What you doing on the street at night?’ / Wonder if they gonna read your rights.” Like the bright spots in West’s back catalogue, “Hands On” uses hip-hop as a bully pulpit to deliver a word about American injustice. A few more cuts like these might’ve helped reconnect the artist with the abrasive radicalism of his music before Yeezus, Pablo, and Ye, Kanye’s “Me” trilogy.\n\nJesus Is King’s secret weapon is one Kanye has employed before in songs like “Two Words,” “Bring Me Down,” and “Ultralight Beam.” He can wield a chorus of voices like a sword of fire. “Every Hour” opens the album in the middle of a brilliant choral exercise by West’s Sunday Service Choir. They lift the invocation “Selah” into the stratosphere on a booming “Hallelujah” chorus. “Everything We Need” adds Ty Dolla $ign, who delivers a hair-raisingly good lyric about a passing night storm, bouncing silky harmonies off himself. “Water” sends voices careening around the mix like a school of fish. Kanye, who excels by slotting friends with varied skill sets into teams greater than the sum of their parts, is uplifted by singers hitting the notes he can’t. (That said, “God Is,” where West shreds his voice singing joyously over a towering sample of King of Gospel James Cleveland’s Southern California Community Choir, is proof there’s passion in this change of heart. The triumphant vocal feels like a photo negative of the self-excoriation of “Runaway.”)\n\nThe Sunday Service Choir takes center stage in Jesus Is King’s Imax film, a half-hour performance inside Roden Crater, James Turrell’s Arizona observatory and art installation. In the crater, the choir revisits exercises performed on tour with Kanye since the Sunday Service group debuted at Coachella. They’re airtight and spirited, as they’ve been in pop-up performances at churches across the country, and they keep those gigs’ taste for hokey Christian trap covers at a minimum. In this cycle’s most notable act of humility, Kanye plays a fly on the wall in most of these scenes, until the end, where he sings a revamped version of 808s & Heartbreak’s “Street Lights” dramatically as dusk draws in, and sings a bit of “Use This Gospel” to Psalm West for the touching conclusion. The crater is both a wise and an odd place to think to shoot a gospel movie. The acoustics are incredible, but the placid, eerie quiet of the crater, accentuated by the use of the circular frame the Coachella performance was shot through, is tough to shake.\n\nGospel is communicative music. Testimony is shared. Audience and performer have a rapport; they stew and stir each other til the room bubbles over. You can see it happen in the selections at any church service. You can watch it in any of the classic gospel documentaries. (See Aretha Franklin and Sydney Pollack’s Amazing Grace, Al Green’s aforementioned The Gospel According To …, George Nierenberg’s Say Amen, Somebody, and the ’80s concert package Gospel and its sister film Oh Happy Day!) The air of exclusivity in staging a praise service at a remote location matches the invite-only nature of the early Sunday Service events. Kanye approaching spirituality the way he does his sneakers and clothing lines runs the risk of the streetwear-ification of the faith. As is the case with West’s apparel, some fans came out of the Imax experience complaining that the price point is too high. The line in “On God” where he tries to sanctify a reference to his own merch — “Off the 350s, He supplied” — ain’t, as Twitter folk say, it.\n\nThis all could’ve gone over catastrophically poorly (and there is still the chance that the box office and streaming numbers will reflect an audience not fully willing to follow Kanye West into his Christian era). The finished product feels equal parts polished and rushed, especially if you’ve heard the leaks for the abandoned Yandhi album. Jesus Is King’s Clipse reunion and Kenny G collaboration “Use This Gospel” originally contained Grand Theft Auto references and lines about money and time being fake. “Everything We Need” was home to a verse full of threats from the late XXXTentacion. In a recent interview with The Shade Room, Nicki Minaj let slip how abrupt and taxing this change of concepts has been, saying she wrote three different verses for the snide Yandhi track “New Body” — which, if snippets are to be trusted, was in store for a coat of Christ-like paint after scrubbing vocals from Tekashi 6ix9ine — only to see the song get shelved. At 11 songs in 27 minutes, Jesus Is King feels even choppier than Ye, though it houses better beats and less embarrassing lyrics. The temptation to call it a serviceable Christian trap project and a necessary step back from the brink of destruction hinted at in songs like “Yikes” is strong, but the (orange) elephant in the room and the gaping hole in the logic animating this project deserve mention.\n\nLike many affluent Evangelicals, Kanye fails to see the glaring flaw in casting in his lot with the American president, separator of families and divider of peoples, how a message of love is tainted by silence in the face of real cruelty. West positions himself as an advocate for prison reform while supporting a regime that’s caging immigrants at the border and denying them due process. He stuck his neck out speaking up for LGBTQ hip-hop fans in 2005, but now he’s petulant about the blowback for his Chick-fil-A shoutout (as if dispensing common sense in an interview once shores you against all future criticism), and making nice with Jerry Falwell Jr., president of the Virginia Christian school Liberty University, which has been in hot water under three different presidential administrations for poor treatment of LGBTQ students. The music of Jesus Is King is pretty, and the message is mostly positive. But unless this organization distinguishes itself from the divisive ideologies of political figures angling to jack into the considerable cultural cachet of Kanye West and his star-studded expanse of collaborators, it runs the risk of playing Hillsong to hip-hop. Does Kanye fix up and change course, or does he tarry awhile, like Dylan and Al Green, bleeding public interest until he sorts out the balance? Three years into his red-hat era, there’s no end on the horizon.", "description": "’Jesus Is King’ splits the difference between rousing choir exercises, Christian trap tunes, and holy chipmunk soul workouts that call back to ‘College Dropout.’ In that sense, Jesus Is King is the man coming full circle.", "authors": ["Craig Jenkins"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/25/kanye-west/kanye-2.w1200.h630.jpg", "published_at": "2019-10-28"}