{"pub": "cbc", "url": "https://cbc.ca/news/health/what-purdue-pharma-s-bankruptcy-filing-means-for-canada-1.5291859", "downloaded_at": "2019-09-21 14:48:35.657197+00:00", "title": "What Purdue Pharma's bankruptcy filing means for Canada | CBC News", "language": "en", "text": "This is an excerpt from Second Opinion, a weekly roundup of eclectic and under-the-radar health and medical science news emailed to subscribers every Saturday morning. If you haven't subscribed yet, you can do that by clicking here.\n\nPurdue Pharma filed for bankruptcy in the U.S. this week to protect itself and its owners from more than 2,000 lawsuits over their role in the ongoing opioid crisis, but the move has put pressure on Canadian efforts to bring the company to face legal action here.\n\nThe company, which is owned by members of the Sackler family, made billions selling the prescription painkiller OxyContin that is widely seen as a catalyst to the crisis that claimed hundreds of thousands of lives. It filed for Chapter 11 bankruptcy Sunday and proposed a settlement in the U.S. worth up to $12 billion US.\n\nAt the centre of the lawsuits is the allegation that the company marketed and promoted prescription opioids as less addictive than was actually known, while misleading both those prescribing the medications and the patients themselves about the risks.\n\nFuture of Canadian lawsuits\n\nLast year, the B.C. government launched a similar class-action lawsuit against Purdue Pharma and more than 40 other companies on behalf of all provincial, territorial and federal governments over the marketing of opioids in Canada. The suit aims to recover the health care costs of the crisis.\n\nThe concern in Canada is that because of the U.S. bankruptcy filing, the assets at the centre of the lawsuit could be in jeopardy, says Matthew Herder, director of the Health Law Institute at Dalhousie University in Halifax.\n\n\"There's a bit of a race underway to secure what wealth remains in that company because that is ultimately the source of the money that might be paid,\" he said.\n\n\"There have been reports of the Sackler family having transferred wealth to various offshore locations, so there are growing questions around what the financial state of play is for that company and its affiliates like the Canadian ones.\"\n\nReidar Mogerman, lead counsel for the lawsuit in B.C., says the provinces are looking for \"fair resolution\" that can address the ongoing opioid crisis.\n\n\"The total cost, if I win my case, is bigger than Purdue can pay. They have set loose an epidemic that is larger than they can pay for,\" Mogerman said.\n\n\"The provinces are realistic about what they will recover. They're not necessarily going to recover every dollar they've spent, but they are going to recover enough money to help fix the crisis, and they're going to recover from the people they say were responsible for the crisis.\"\n\nThe bankruptcy filing also speaks to the lack of federal regulation Purdue Pharma has faced in Canada over its marketing of OxyContin, says Dr. Nav Persaud, a family doctor at St. Michael's Hospital in Toronto.\n\nAllegations of misleading advertising in the marketing of opioids such as OxyContin are at the heart of the lawsuits in the U.S. and Canada. (Toby Talbot/The Associated Press)\n\n\"It shows how Purdue Pharma and other opioid manufacturers have been given free rein in Canada,\" he said.\n\nA key point of contention in the lawsuit is the claim from Purdue Pharma Canada that it is a \"separate company\" from Purdue Pharma in the U.S. and the actions taken to settle litigation there don't \"directly affect\" its business in Canada.\n\n\"Purdue Canada is being a bit cute in saying that they are a separate entity for the purpose of the bankruptcy because they are a wholly owned asset of the bankrupt company,\" Mogerman said.\n\n\"Eventually, that bankruptcy will swallow Purdue Canada.\"\n\nMisleading marketing allegations\n\nThe Canadian lawsuit rests on the same principles alleging misleading advertising and understating the addictive qualities of opioids, but there are differences in the legal systems that make prosecuting the companies challenging — including the speed in which the courts move.\n\n\"It has taken them I think 20 years, but the tobacco companies in Canada are now bankrupt and facing the recovery actions brought by the provinces. It has just taken a long time to get there,\" Mogerman said.\n\n\"Eventually, the result will be the same. If they did something bad they're going to have to pay in Canada, just like they will in the U.S.\"\n\nPurdue Pharma Canada said in a statement that it followed all of Health Canada's regulations, including those governing marketing, and it's \"deeply concerned\" about the opioid crisis in B.C. and across Canada.\n\nBut Persaud says there is \"documented evidence\" that Purdue Pharma Canada alleged in medical journals that long-acting opioids such as OxyContin had a lower abuse potential than earlier opioids.\n\nSacklers under fire\n\nAhead of the bankruptcy filing this summer, the Canadian class action also applied to add individual members of the Sackler family to the lawsuit, as well as other \"senior decision makers\" at Purdue Pharma Canada.\n\n\"We are comfortable, based on the things that we've alleged, that those individuals are also liable for the healthcare costs that the government entities paid in relation to opioids,\" Mogerman said.\n\n\"They're not the company but they have their own potential individual liability and they don't want to be chased to the ends of the earth for their share.\"\n\nHerder says the decision to apply to add the Sacklers to the Canadian lawsuit is the \"right move\" but doesn't necessarily mean it will be successful in establishing liability.\n\n\"I don't think that's the end of the story as to whether the Sacklers will ever pay a dime of their own personal finances.\"\n\nTo read the entire Second Opinion newsletter every Saturday morning, please subscribe.", "description": "Purdue Pharma has filed for bankruptcy in the United States, but what does that mean for the lawsuits in Canada over the opioid crisis? The concern in Canada is that because of the U.S. bankruptcy filing, the assets at the centre of the lawsuit could be in jeopardy.", "authors": [], "top_image": "https://i.cbc.ca/1.5262264.1569021718!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/opioid-crisis-arizona-lawsuit.jpg", "published_at": "2019-09-21"}