{"pub": "fox", "url": "https://foxnews.com/media/former-tulsa-police-officer-on-assault-weapons-ban-push-what-were-up-against-is-a-very-well-organized-and-well-funded", "downloaded_at": "2019-09-26 14:58:59.379245+00:00", "title": "Former police officer speaks out after fiery message to Congress on assault weapons: 'This is my line in the sand'", "language": "en", "text": "Former police officer Dianna Muller, fresh off her explosive testimony to the House Judiciary Committee hearing on assault weapons, said Thursday that gun owners need to “get involved and engaged” because the Second Amendment is at stake.\n\n“What we’re up against is a very well-organized, well-funded effort to take guns away from American citizens,” the former Tulsa, Okla., officer and founder of gun advocacy group The DC Project told “Fox & Friends.\"\n\n“If you are a gun owner and you feel like you’re under attack, you need to call your congressmen and, you know, it sounds cliche, but it's more important now than ever,” Muller said, adding she has drawn a \"line in the sand.\"\n\nMuller made a bold proclamation during the congressional hearing regarding a proposed assault weapons ban, vowing that she would not comply.\n\nKAMALA HARRIS SAYS SHE SUPPORTS A MANDATORY BUYBACK ON 'ASSAULT WEAPONS'\n\nThe session on an otherwise contentious issue flew largely under the radar amid the Trump-Ukraine controversy and the Democrats' impeachment push.\n\nAmid a spate of deadly mass shootings that prompted renewed calls for strict laws on assault weapons, Muller said, such a ban would force lawful gun owners to either give up their arms or become criminals.\n\nMuller said that there are many law enforcement officers who agree with her, and that opponents are using terms such as “weapons of war” to incite emotion.\n\n“More people are killed with hammers and blunt objects than all rifles combined according to FBI statistics so it doesn’t make sense to me that this is going to solve the problem,” Muller said.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe gun control push from Democrats was evident at a recent presidential debate, where candidate Beto O'Rourke, a former congressman from Texas, generated a huge round of applause by vowing to use a mandatory gun buyback program to take assault weapons from Americans. Meantime, the White House has been in negotiations with lawmakers on measures like increased background checks.\n\nDeputy Press Secretary Hogan Gidley told Fox News last week that he expected an announcement on new gun legislation “very soon.” Gidley said President Trump wanted to make sure that any new laws would address actual problems and not just be “feel-good legislation.”\n\nFox News’ Ronn Blitzer contributed to this report.", "description": "Former police officer Dianna Muller, fresh off her explosive testimony to the House Judiciary Committee hearing on assault weapons, said Thursday that gun owners need to “get involved and engaged” because the Second Amendment is at stake.", "authors": ["Joshua Nelson", "Joshua Nelson Is A Freelance Reporter For Fox News."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Screen-Shot-2019-09-26-at-8.48.09-AM.png", "published_at": "2019-09-26"}