{"pub": "businessinsider", "url": "https://businessinsider.com/i-had-fling-with-celebrity-crush-i-wouldnt-do-again-2019-10", "downloaded_at": "2019-10-19 16:19:40.231620+00:00", "title": "I had a fling with my celebrity crush, and I would never do it again", "language": "en", "text": "In my early 20s, I had a short-lived fling with a famous actor.\n\nKnowing him from television and social media blurred the lines of reality. David McNew/Getty Images\n\nI had admired him for years in his role as the sweet, sensitive boyfriend on one of my favorite TV shows. I watched his comedy shows frequently. None of my girlfriends ever thought he was funny, but I didn't care.\n\nOne night, he announced he was doing a surprise show in my city and I immediately jumped at the chance to see him live. \"Really, you guys are going to make me go alone?\" I asked my friends. They all insisted on staying home, saying, \"I don't think he's that funny. Besides, maybe you'll meet him if you go alone.\"\n\nI posted something online about needing new friends. He saw it, and we began messaging back and forth. As my friends correctly predicted, I actually ended up meeting him and a few of his friends after the show. I joined him at a pool party the next day, and from there, it seemed we got along pretty well. Over the next year, I traveled with him to a few different cities while he did some shows. As a fan of his, it was exhilarating to me. But his celebrity status had affixed cartoon heart eyes onto my face, painting him as the person I wished he was, like the character he played on TV, and not the real person in front of me, who was anything but that. TV and social media had blurred my line of fantasy and reality.\n\nHow could I have known that starting a relationship with my celebrity crush would not be healthy in any way, shape, or form?\n\nIn rare moments where he and I would sit and talk alone, I caught glimpses of him as a real, genuinely good person. Maybe it was my heart eyes, but I swear for a moment I actually liked the person in front of me more than the famous actor. At other times, I recognized his bad behavior, like rude comments or lazy efforts to see mqe, but I always made excuses for him. I felt lucky that he wanted to spend time with me at all.\n\nSilly girl, I think when I look back now. That was exactly how he wanted me to feel. Me and every other girl he was seeing across the country. I was naive, though, and had no precedent for this situation. How could I have known that starting a relationship with my celebrity crush would not be healthy in any way, shape, or form?\n\nI also started to notice the way other people acted around him. We once boarded a flight together, and a man held up the boarding process because he spotted the actor. The passenger refused to keep walking without getting a picture. The man's selfie outburst was funny at first, but it quickly turned uncomfortable. The fan would not proceed down the aisle, but instead held up the boarding process and berated the actor for denying him a picture. My crush would not agree to the picture, so the fan got really upset and called him names as he walked away to find a seat. All over a selfie.\n\nI couldn't believe a grown man was throwing a fit over a selfie on a plane. Sure, my crush could've agreed to a picture to make him happy, but he shouldn't have to. He didn't owe him that. And this man embarrassed himself because he didn't get his way.\n\nThings like that happened often; people demanded pictures or attention, and when they didn't get it, they'd act childish and rude. It shocked me to learn that this fan behavior occurred frequently. It shouldn't have, because my behavior changed when I was around him, too. Everyone wanted to be his friend, and I wanted to be his only girl.", "description": "Dating a celebrity made writer Jessica Mendez realize that she should be giving her adoration to people she knows in real life.", "authors": ["Jessica Mendez"], "top_image": "https://image.businessinsider.com/5da876b2cc4a0a46bb45b2b5?width=1200&format=jpeg", "published_at": "2019-10-19"}