{"pub": "heritage", "url": "https://heritage.org/defense/report/the-role-the-2020-national-defense-authorization-act-ndaa-rebuilding-the-us-military", "downloaded_at": "2019-09-04 04:10:44.766836+00:00", "published_at": "2019-09-04", "title": "The Role of the 2020 National Defense Authorization Act (NDAA) in Rebuilding the U.S. Military", "language": "en", "text": "The 2020 defense budget will be the most important defense budget of the Trump Administration. The 2020 budget request is the first one fully developed by the Trump team. It is also the first to be fully informed by the January 2018 National Defense Strategy (NDS).REF This budget must also contend with the final two years of the spending caps mandated by the 2011 Budget Control Act (BCA), which cover fiscal years (FYs) 2020 and 2021.REF\n\nIn great measure, the 2020 budget will determine the destiny of the military rebuild championed by President Donald Trump and by Congress. As it currently stands, due to budget increases from FY 2017 to FY 2019, the military has seen gains in readiness, but the rebuild is far from a completed task. Every service has expressed the imperative to increase in size and in capabilities in order to counter great power competition described in the National Defense Strategy. The 2020 defense budget represents the fork in the road for the military rebuild and for the viability of the defense strategy.\n\nThe National Defense Authorization Act (NDAA) for FY 2020 will be a clear signal of how Congress intends to shape the resources that will define the military’s effort and direction. As the old maxim goes—a strategy without resources is nothing but a wish.\n\nThe State of the Military Rebuild\n\nSince taking office, President Trump has placed an emphasis on rebuilding the military, which led to increased defense budgets. The 2017 “Request for Additional Appropriations” targeted maintenance shortfalls,REF and the Bipartisan Budget Act (BBA) of 2018 offered substantial boosts to the resources dedicated to defending the nation.REF\n\nNonetheless, rebuilding the military is not a simple equation in which taxpayers’ dollars are automatically transformed into a ready force. It takes time for increased resources to produce increased readiness and a larger force. There is a considerable lag time between the input of resources and the output of increased readiness, lethality, or force. It took multiple years for the readiness cracks to start showing, and, by the same token, it will take years for these cracks to disappear.\n\nThe Heritage Foundation’s Index of U.S. Military Strength evaluates the changes in the capacity, capability, and readiness of each military service over the previous year.REF Measurements are on a five-point scale that ranges from “very weak” to “very strong,” with “marginal” being the middle option. The 2019 edition started to show some of the effects of increased resources. The Army’s readiness increased from “weak” to “strong.” The Navy saw increases in its capability from “weak” to “marginal,” due to investments in seamanship skills. These gains are part of a rebuilding process that is slow, fragile, and requires consistent funding.\n\nThe previous Secretary of Defense, James Mattis, described the need for continued effort and attention in 2017 when discussing the Department of Defense’s (DOD’s) budget:\n\n[A]s I mentioned in my opening remarks, we didn’t get into this situation in one year. We’re not going to get out of it in one year. And I recognize that Congress has a responsibility to raise armies and sustain navies, but we can’t do [that] in one year or put a marker down in one year. It’s unrealistic. And I mentioned that we’re going to have to have sustained growth F.Y. ’19 to 2023, and this is [where] you’ll see the biggest growth[:] Army, Air Force, and Navy showing up as we’re still digging ourselves out of a readiness operation and maintenance hole. REF\n\nThe 2020 NDAA represents a pivotal opportunity that will help determine the future of our current effort to rebuild the military. Both former Secretary Mattis and Chairman of the Joint Chiefs of Staff General Joseph Dunford expressed that the military needs between 3 percent and 5 percent above inflation budget growth between 2018 and 2023.REF The military was able to achieve that growth in 2018 and in 2019. It will require similar growth in order to be able to keep up with the current demands placed on our military by the National Defense Strategy.\n\nThe 2019 Fiscal Year. In many ways, FY 2019, fueled by the BBA,REF was an exception to the current budgetary problems and delays. Both the defense authorization and defense appropriation legislation were signed by the President before the start of the fiscal year. The budgetary process worked in the timeline that it is supposed to work.\n\nThe John S. McCain National Defense Authorization Act for Fiscal Year 2019 was presented to the President for signature on August 3, 2018. The President signed it on August 13,REF which was the earliest it had been signed since 1978.REF The defense appropriations bill was presented to the President for signature on September 27, 2018, and signed the next day.REF\n\nThe passage of both these pieces of legislation before the end of the fiscal year on September 30, 2018, is, on its face, a simple achievement. After all, it means that Congress was capable of following the plan that it outlined for itself for a fiscal year. Nonetheless, it is a major departure from the norm. Since 2010, every single fiscal year has started under a continuing resolution—a temporary mechanism designed to give Congress more time to negotiate its annual budget, while keeping the budgetary status quo for the federal agencies. It is a process that has considerable negative impacts on the DOD, especially when it comes to efficient contracting for goods and services and the development of new materiel programs.REF\n\nThe Pressures in 2020. In many ways, the budgetary arguments and legislation for FY 2019 were an exception that is unlikely to happen again in FY 2020. As a matter of fact, the 2020 budget has some unique pressures which compound the challenge of an on-time budget.\n\nThe coming fiscal year’s defense budget cannot count on the benefits experienced in 2019 mainly because of the re-imposition of the BCA budget cap for defense. Similar to other years in which the caps were renegotiated, it is likely that Congress will modify the spending levels for FY 2020 and 2021. However, the budget outlook is already unsustainable and it is critical that Congress offset any new spending without increasing the debt.\n\nThere are at least two ways to do this. First, Congress could reduce non-defense spending by an equal amount to any the proposed defense increase. Second, Congress could offset any new spending over the next 10 years using mandatory savings.\n\nA second pressure is a scheduled transfer of Overseas Contingency Operations (OCO) funds, which are exempt from the BCA caps, to the base DOD budget, which is not.REF The DOD had previously announced plans to transfer $49 billion from OCO to the base budget in order to align the usage of these funds with its reality.REF Regardless of the proper account where expenditures should be, the important political difference is that whatever amount the DOD decides to transfer to the base budget will have to be accounted for in the BCA cap. Otherwise it will be effectively reducing the defense budget.\n\nA third pressure is the high deficit experienced in FY 2018, which further added to the country’s mounting debt. The rising debt is a threat not only to the defense budget, but to the whole country, since it has the potential to slow down the economic growth substantially, and to eventually consume all federal government expenditures.REF Therefore it will be very important to balance all the priorities of the federal budget in order to put the government on a better financial footing.\n\nBreaking the BCA Firewall. Under the BCA, defense and non-defense spending are each capped in separate categories rather than one aggregate total. This firewall splits the overall discretionary funding allocation between defense and non-defense, and under the law each are governed by separate limits. Defense and non-defense spending were designed to share an equal proportion of the cuts imposed by the BCA, a concept termed “parity.”\n\nThis parity is arbitrary and a political construct that is no longer relevant.REF The original BCA cuts had a disproportionately negative impact on the national defense budget. Since 2011, it has also led to irresponsible spending increases. National defense is a core constitutional function and the levels set by the BCA were too low to fully and properly fund the military. This has been the impetus for three separate budget deals passed by Congress to increase defense spending. However, in order to increase defense spending some congressional leaders have demanded an increase in unrelated non-defense spending in order to maintain parity.REF In total, base non-defense spending has increased by more than $200 billion since 2013.\n\nThe President’s and House budget proposals have consistently called for the elimination of the firewall between defense and non-defense spending.REF Congress and President Trump already departed from this construct in the May 2017 funding bill, which provided $16.5 billion more for defense than for non-defense.REF Lawmakers need to continue making progress in prioritizing defense needs over domestic programs. Congress’s goal in budgeting responsibly should be to focus on key constitutional responsibilities, such as national defense, within existing spending controls.\n\nCongress should revise the current BCA structure to eliminate the firewall between defense and non-defense spending permanently. This will give Congress greater flexibility to adjust national defense spending without the need for a statutory change each year. A wide variety of cuts could be made to domestic programs and through budget-process reforms to offset increases to defense spending. The President and Congress could also generate billions of dollars in savings by passing a rescissions package and eliminating budget gimmicks, which inflate domestic spending each year. This would provide more transparency within the budget process and leave less leeway for lawmakers to abuse these designations or use them in non-intended ways.REF\n\nThe National Defense Strategy. The release of the National Defense Strategy in January 2018 marked the beginning of a change of focus from terrorism and counterterrorism operations to great power competition.REF In order to actually shift the emphasis toward great power competition, the DOD must be able to properly invest in the defense of the country. The strategy explains that the budget must be sustained and predictable in order to empower the DOD to make the necessary investments to maintain the competitive distance between the United States and Russia and China. This is the reason why the Navy and Heritage Foundation researchers have discussed the importance of increasing the size of the fleet.REF It is why the Air Force has discussed its plans to increase its squadrons by 74 (24 percent) with the goal of reaching 386 squadrons.REF\n\nAs the Index of U.S. Military Strength has highlighted since its inaugural edition in 2015, the American military is only marginally ready to engage in two simultaneous major regional contingencies.REF Index scoring is based on the concept that the United States should size its forces to be able to engage in two major regional contingencies simultaneously and still have a reserve capacity.REF It is the enduring measure of what a superpower should be able to execute. It is also reflective of the guidance of the National Defense Strategy to be ready for great power competition with both Russia and China.\n\nThe construct driven by the assessment in the Index of U.S. Military Strength and the National Defense Strategy requires the country to invest in both rebuilding and expanding its military. It is the path that the 2018 and the 2019 defense budgets began. Some of the gains observed by the military have already shown in the 2019 edition of the Index.REF Nonetheless, these readiness gains are ethereal and require consistent and constant maintenance. In this sense, the military rebuild is at a very fragile moment at which the DOD and Congress need to assure proper levels of resourcing.\n\nNational Defense Strategy Commission. On November 13, 2018, the National Defense Strategy Commission released its assessment of the defense strategy.REF The bipartisan commission was directed by the 2017 NDAA and was tasked with providing an independent assessment of the National Defense Strategy.REF The commission generally agreed with the direction of the defense strategy, but it highlights multiple shortcomings of the strategy, mainly the lack of definition of means, and the current resource shortcomings.REF\n\nThe commission questions whether the DOD has the plans and concepts necessary to meet the challenges outlined by the National Defense Strategy, especially when it comes to engaging in long-term near-peer competition against China and Russia. Further, the commission endorses the 3 percent to 5 percent annual real growth to the DOD’s budget necessary to meet the threats articulated in the defense strategy—budget growth that is not currently planned.REF The bipartisan nature of the commission’s report reflects that there is still a bipartisan consensus on the threats that the United States faces and on the requirements these threats impose.\n\nIn its report, the commission lays out a clear case that there is currently a mismatch between the threats and ambitions outlined in the National Defense Strategy and the current budgetary plans of the DOD—and that closing that gap will require more resources and better planning. Congress has a substantial role to play in realigning the strategy with the resources available to the Pentagon: Realigning with the strategy starts with the topline budget, but it permeates every aspect of the NDAA. As stated by Thomas Spoehr, Director of the Center for National Defense at The Heritage Foundation, “For those seeking to [know] the truth about our defense needs, the NDS Commission’s report should serve as an authoritative reference.”REF\n\nIn order to build on the gains from the previous two years, the NDAA for FY 2020 needs to be designed to continue rebuilding the military, and should reflect the recommendations outlined in this Special Report.\n\nThe Topline\n\nThe federal government has a constitutional mandate to provide for the common defense.REF As such, it is crucial that Congress ensure that the Department of Defense has the resources to meet the threats that the country faces. Sufficient funding does not guarantee that the country will be able to meet all threats—but insufficient funding guarantees that it will not.\n\nThe authors of this Special Report detail 57 specific recommendations for rebuilding the military and preparing it for great power competition.\n\nRecommendation 1: Increase the Discretionary Base Budget (050) to $697 Billion for 2020. The base budget increase is necessary to continue the process of rebuilding the military’s capacity, capability, and readiness. It is an important step to show both internal and external audiences that the country is committed to its National Defense Strategy and to addressing the great power competition that it outlines. It is a 5 percent growth over the base topline recommended by Heritage Foundation experts for 2019.REF\n\nRecommendation 2: Set the Overseas Contingency Operations (OCO) Account at $45 Billion for 2020. The OCO account must be set at a level that supports overseas operations, while reducing the reliance on the account for base budget expenditures. At $45 billion in 2020, the account will be in a downward trajectory, enabling a transition away from relying on the OCO account to fund enduring expenses. It is important that enduring expenses are represented in the base budget.REF\n\nThe level of funding recommended in this Special Report would amount to $742 billion for defense in FY 2020. The increase is balanced with other federal budget priorities in order to create a sustainable fiscal direction for the country.REF\n\nThe Four Military Services\n\nEach of the services is facing unique challenges in how to re-orient its current force structure to great power competition and set priorities accordingly. Additionally, there is the important discussion of how to establish a service responsible for space. The recommendations in this section detail how each service should prepare for the future, and how Congress can help.\n\nThe Army. The Army is struggling with two major dilemmas as it enters FY 2020: insufficient size and an anemic modernization program. Both deserve the attention of Congress in the 2020 NDAA.\n\nIn terms of size, Chief of Staff of the Army General Mark Milley has testified that the Army is too small to meet wartime requirements: “We need to be bigger and stronger, and more capable.”REF In June 2018, Army Secretary Dr. Mark Esper, while outlining his priorities, stated, “We must grow the regular Army above 500,000 soldiers with associated growth in the Guard and Reserve. And we must recruit and retain the very best.”REF\n\nRecommendation 3: Congress Should Direct the Army to Establish an Additional Armored Brigade Combat Team (ABCT) by 2022. This additional ABCT would be the 12th Regular Army ABCT, bringing the total of Regular Army BCTs from 31 to 32. In 2019, the Army will only field 31 active Brigade Combat Teams, 19 below the 50 we assess is required to meet a two-major-regional-contingency (MRC) requirement.REF Some critics question the need for a two-MRC force. The Administration’s own 2018 National Defense Strategy does not fully embrace a two-MRC construct, calling instead for a force capable of “defeating aggression by a major power; deterring opportunistic aggression elsewhere; and disrupting imminent terrorist and WMD threats.”REF But the bipartisan National Defense Strategy Commission, composed of distinguished national security experts, unanimously concluded that “a two-war force sizing construct makes more strategic sense today than at any previous point in the post-Cold War era.”REF\n\nFurthermore, the National Defense Strategy does not explain how the U.S. could hope to “deter opportunistic aggression” without the ability to actually fight a second conflict. Thus the assessment by Heritage defense analysts remains that the Army needs a two-MRC force of 50 BCTs, and should gradually increase its number of Regular Army BCTs from 31 to 32.\n\nRecommendation 4: Congress Should Authorize the Increase in Size of the Regular Army by 5,000 soldiers to 492,500 soldiers in the 2020 NDAA. In the 2019 NDAA, Congress authorized 4,000 additional soldiers for the Regular Army, bringing the total authorized Regular Army end strength to 487,500. The Army National Guard remained unchanged at 343,500, and the Army Reserve, at 199,500. The 2020 NDAA should continue to increase the size of the Regular Army in order to put it on a firm path to an adequately sized and ready force, and Congress should authorize more than 500,000 additional soldiers by 2022, the same year the Army aims to have achieved its readiness goals.REF\n\nRecommendation 5: Congress Should Closely Examine the Factors that Contribute to the Army’s and other service’s inability to attract volunteers. Congress should then increase targeted incentives for volunteering for military service.\n\nRecommendation 6: Congress Should Convene a Hearing on Recruiting Problems and Demand Detailed Recommendations from the DOD to Increase the Effectiveness of Recruiting Programs. Recruiting sufficient volunteers to meet this higher end strength will not be easy. In 2018, the Army fell short of its recruiting goals by 6,500 recruits. While record-low unemployment does make recruiting more difficult, that is far from the only reason for the shortfall. Today 71 percent of Americans ages 17 to 24 are ineligible for military service due to obesity, poor health, or lack of a high school diploma.REF Propensity and willingness to serve is also declining, perhaps in part due to a growing distance between the U.S. military and the American public. Congress should be concerned that the challenge that the Army had in achieving its recruiting goals in 2018 is the proverbial “canary in the coal mine” that might signal the beginning of an ever increasingly difficult period for military recruiting overall.\n\nRecommendation 7: In the Face of Anticipated Industry Pushback, Congress Should Underwrite the Army’s Funding Cuts for Legacy Platform Upgrades and Other Program Decrements in Favor of Investments in Next Generation Technology. Turning to modernization programs, the Army has implemented several changes to deliver a modernized force. The activation of the Army Futures Command on August 24, 2018, was perhaps the most visible of these changes.REF The intent behind the Army Futures Command is to achieve better unity of command and execution for Army modernization. The Army has also established six modernization priorities and nine cross-functional teams to manage these priorities.\n\nTo its credit, the Army has also reportedly moved $25 billion for the next five years (2020 through 2024) from lower-priority programs, which are not focused on the six modernization priorities, to higher-priority programs, such as long-range precision-fire systems.REF These cuts of roughly $4 billion to $5 billion per year in existing lower-priority programs are likely to cause immediate industry consternation and subsequent congressional concern. To find these amounts of money, the Army will likely have had to cut into large programs, such as the combat vehicle upgrades (Abrams M1A2 SepV3, Bradley A2A4, and Armored Multipurpose Vehicle) and helicopter modernization (Chinook CH-47F and Blackhawk UH-60M). Additionally, the Army will not be able to enter into procurement for any of its new systems—long-range precision-fire systems, next-generation combat vehicles, or Future Vertical Lift (the plan for helicopter development)—until 2021 at the earliest. Thus there will be the near-term pain of program cuts and eliminations, without the immediate procurement of new systems to compensate for the losses in work.\n\nRecommendation 8: Congress Should Authorize the Accelerated Procurement of No Fewer than 4,000 Joint Light Tactical Vehicles (JLTVs) in 2020 for the Army. Because of the anticipated shift in Army modernization from procurement of legacy upgrades to next-generation systems, this Special Report does not contain recommendations on quantities of major platforms for procurement in the 2020 NDAA, except for the JLTV. The JLTV is achieving success and meeting all milestones, and is urgently needed by the Army and the Marine Corps. A full-rate production decision on the JLTV is expected in 2019.REF Congress should continue its strong support for this program. Despite the fact that the Army Procurement Objective is currently 49,099 JLTVs in its 2019 budget request, the Army only projected procuring 3,035 JLTVs in 2020.REF At this rate, it will take 16 years to complete the program, an unacceptably long time.\n\nThe Navy. The increased funding that Congress provided in FY 2017 and FY 2018 allowed the Navy to support greater surface-ship operational proficiency; ship and aviation depot maintenance; aviation spares; and flying hours, and to purchase additional ships and aircraft to increase fleet size. The Navy has also done a good job of increasing its end strength to support a growing fleet, as well as correcting manning shortfalls on its ships.\n\nAlthough these larger defense appropriations have already helped to turn the tide of Navy readiness and modernization, it will take years to restore complete readiness, and decades to increase fleet capacity and field the new capabilities needed to execute the 2018 National Defense Strategy. Rebuilding a Navy capable of winning this new long-term strategic competition requires a balance of resources to fund new ships and aircraft, sustain research and development (R&D) funding to properly mature and field new capabilities, improve readiness through more training and maintenance, and increase personnel and infrastructure to properly support the current and much bigger future fleet.\n\nAs the recently released report from the National Defense Strategy Commission recommends: “The United States needs a larger force than it has today if it is to meet the objectives of the strategy…. The Navy must expand its submarine fleet and dramatically recapitalize and expand its military sealift forces.”REF The FY 2018 NDAA established a fleet of “not fewer than 355 battle force ships,”REF as the official U.S. policy coupled with the Navy’s recent fleet readiness issues also point to the need for a much larger and more capable fleet.\n\nEven with the additional readiness funding provided by Congress, and the additional 1,778 public shipyard workers hired in FY 2018, the number of days of depot maintenance delays for aircraft carriers, surface ships, and submarines all increased in FY 2018.REF Admiral John Richardson, Chief of Naval Operations, testified before the Senate Armed Services Committee that it would take until 2021 or 2022 to restore fleet readiness to an “acceptable” level, and that the continued lack of “stable and adequate funding” would delay these efforts.REF\n\nThe reality of the time required to modernize aging public shipyards, hire and train new shipyard workers, and reduce the backlog of ship depot maintenance while addressing current maintenance demands dictates that there is no “quick fix” solution to Navy readiness.\n\nRecommendation 9: Increase the Navy’s End Strength. The Navy successfully recruited 6,000 personnel in FY 2018, and surpassed its end strength goal of 327,900. The Navy must still add more than 14,900 additional sailors by FY 2023 to meet the personnel demands of expanding the fleet to 355 ships and eliminating manning gaps. A recent study by the Government Accountability Office (GAO) found that, even with the efforts to reduce insufficient manning on its ships, the sailors on U.S. Navy ships based in Japan still work more than 100 hours a week to meet all their watch-standing, maintenance, and training requirements.REF Congress should therefore authorize the Navy to increase its end strength by an additional 5,000 sailors in FY 2020 to a size of 340,400.\n\nRecommendation 10: Increase Fleet Size and Acquire 11 New Ships in FY 2020. The Navy’s fleet size, currently at 287 ships, remains significantly below the Navy’s revised fleet requirement of 355 ships, as well as Heritage defense analysts’ 400-ship, two-MRC recommendation.REF On November 27, 2018, Assistant Secretary of the Navy for Research, Development and Acquisition James Geurts testified that the Navy’s shipbuilding plan, coupled with service-life extensions of the entire class of Arleigh Burke destroyers, will accelerate achieving a 355-ship Navy from the 2050s to the year 2034.REF Congress should authorize and fully fund the acquisition of 11 battle force ships in FY 2020: two Block V Virginia-class attack submarines; two Flight III Arleigh Burke-class guided-missile destroyers; the first future frigate FFG(X); one San Antonio-class Flight II amphibious ship; two Lewis-class oilers; one expeditionary sea base; and two towing, salvage, and rescue ships. This number would provide one ship above the Navy’s shipbuilding plan for FY 2020, and would leverage industrial-base capacity to help reduce the logistic ship deficit.\n\nRecommendation 11: Increase Naval Aviation Capacity—Navy Must Have 10 Operational Carrier Air Wings by 2025. Congress should fully fund and authorize the acquisition of the following manned and unmanned aircraft in FY 2020: 16 F-35C Joint Strike Fighters, 24 F/A-18E/F strike fighters, four E-2D airborne early warning aircraft, nine P-8A maritime patrol aircraft, and three MQ-4C Triton maritime surveillance aircraft. In addition, Congress should fully fund the engineering, manufacturing, and development of the MQ-25 carrier-launched unmanned refueling aircraft prototype to ensure that it meets the Navy’s goal of first flight in 2021.\n\nRecommendation 12: Maximize Shipyard Capacity to Eliminate the Attack Submarine Maintenance Backlog. Even with the additional funding for maintenance in FY 2017 and FY 2018, attack submarines suffered an increased number of days of maintenance delays in FY 2018. Public shipyards will be unlikely to meet the demands of ship depot maintenance for the next several years. The Navy has stated that it is developing a 30-year ship repair and modernization plan to more effectively forecast and efficiently schedule ship maintenance.REF The Navy should therefore work with private shipyards to plan additional depot maintenance availabilities in FY 2020 to most efficiently balance the demands of submarine maintenance and construction of new submarines.\n\nRecommendation 13: Fund Service-Life Extensions for Six Additional Attack Submarines. Vice Admiral William Merz testified before the Senate Armed Services Committee on November 27 that the Navy is evaluating the potential for an additional six Los Angeles-class submarine service-life extensions using available reactor cores beyond the one funded in FY 2019.REF Assistant Secretary of the Navy for Research, Development and Acquisition James Geurts recently testified that “the most looming shortfall in terms of capacity is in attack submarines.”REF The Navy’s requirement for attack submarines is 66, yet the current fleet only has 51 attack submarines. Extending the life of an additional six submarines would change the valley of the attack submarine force from 42 in 2028 to 45 in 2026.REF The Navy and Congress should fund the service-life extension of a second Los Angeles-class attack submarine in FY 2020, and develop a plan to refuel an additional five Los Angeles-class submarines over the next 10 years depending on public and private shipyard capacity.\n\nRecommendation 14: Provide Funding for the Columbia-Class Ballistic Missile Submarine Program. Congress and the DOD should provide the Navy with funding for advanced procurement and R&D for the Columbia-class ballistic missile submarine to ensure that the nation’s number one priority defense program remains on schedule for its first strategic deterrent patrol in 2031. Providing the Navy with additional shipbuilding funding would also prevent the Columbia-class program from adversely affecting the Navy’s ability to build other much-needed ships, such as combat fleet logistics ships, frigates, and attack submarines.\n\nRecommendation 15: Fully Fund the Navy’s Shipyard Optimization Plan. The Navy’s shipyard optimization plan is a 20-year plan for public-shipyard-infrastructure modernization to improve obsolete dry docks and production-facilities conditions and layout, and to replace aging equipment.REF This modernization is critical to reducing current ship maintenance backlogs as well as meeting the maintenance needs of a much larger future fleet. The estimated cost for the Navy is approximately $21 billion over 20 years, well above the Navy’s historical infrastructure budget, and will negatively affect other readiness and acquisition programs if the Navy does not receive additional funding in FY 2020 and beyond.\n\nRecommendation 16: Fund Naval Aviation Maintenance to 100 Percent of the Requirement. The Navy was only able to support aviation maintenance at 92 percent of the projected requirement in FY 2019 due to limited spare parts and a too-small maintenance workforce. The Secretary of Defense tasked the Navy with achieving 80 percent strike-fighter-squadron mission-capable readiness by the end of FY 2019. Even with implemented improvements to the Navy’s aviation enterprise in FY 2018, which have resulted in F/A-18 Hornet readiness levels increasing from 31 percent in 2017REF to a mission-capable rate of 49 percent by December 2018,REF achieving the Secretary of Defense’s 80 percent mission capable goal by the end of the fiscal year will be a significant challenge. The Navy must plan and fund aviation maintenance to 100 percent of the projected requirement in FY 2020 and beyond to achieve and maintain acceptable strike fighter force readiness.\n\nRecommendation 17: Fully Fund Research and Development. Congress should fully fund the R&D required in FY 2020 to complete initial design studies to support contract awards for the following new ship classes in FY 2023: Large Surface Combatant, Large Unmanned Surface Vehicle, Future Small Auxiliary, and Future Large Auxiliary (common hull auxiliary multi-mission platform). Additionally, Congress should ensure that the Navy fully funds the development and fielding of critical new weapons capabilities, such as an offensive hypersonic missile, the Surface Navy Laser Weapon System, the Snakehead Large Displacement Unmanned Undersea Vehicle, the Orca Extra-Large Unmanned Undersea Vehicle, the MQ-25 Stingray Unmanned Aerial Refueling Aircraft, and the electromagnetic railgun. These new capabilities are crucial for addressing the growing threats from similar weapons systems that strategic competitors, such as China and Russia, are fielding. The Chief of Naval Operations’ “Design for Maintaining Maritime Superiority, Version 2.0”REF has tasked the fleet with fielding several of these new capabilities no later than 2025.REF If this deadline is to be met, Congress will need to fully fund the R&D phase of these systems.\n\nThe Marine Corps. Like the other services, the Marine Corps is under immense budgetary pressure to balance the multiple demands of current readiness, sustain repeated operational rotations with a smaller force, modernize or replace its aging equipment, and prepare for the future. It is well short of the size it needs to be to handle historically consistent operational tasks, much less the new requirements that have arisen, such as its contributions to the Marine Corps Forces Special Operations Command (MARSOC)—nearly 3,000 Marines—and the establishment of Marine Corps Forces Cyberspace Command (MARFORCYBER).\n\nAn increase in funding for the Marine Corps enabled it to make gains in readiness: reducing backlogged maintenance, replenishing inventories of parts, and returning broken equipment to operational status that helped units and individuals, such as pilots, to do more training. The budget for FY 2019 should sustain needed levels of support. It will be vitally important for the 2020 NDAA to continue this trend, since readiness in particular is fragile (it must constantly be attended to), and force competency and capacity depends on a stable flow of funding.\n\nRecommendation 18: Increase Marine Corps End Strength. At present, the Corps remains too small for the tasks assigned to it. Its operating forces are still dealing with a deployment-to-dwell ratio of approximately 1 to 2, meaning seven months deployed and 14 months at home. This wears out the force, both personnel and equipment. The Marine Corps currently has an authorized end strength of 186,100—which should be increased over time to a minimum of 194,000, and ideally to just over 200,000 (in 2011, it was 202,000). The Corps has stated that it can responsibly increase the service by an additional 3,000 Marines per year and it should do so in 2020.REF The increase would amount to an authorized end strength of 189,100 in 2020. A larger Corps will make it possible to reduce the current deployment burden; decrease high operational usage for any one piece of equipment or individual, thus extending the life of the item or person; and enable proper training, education, and preparation that ensures greater resilience of the force.\n\nFurther, growth of new capabilities, such as MARSOC and MARFORCYBER, under the funding ceiling imposed by the BCA has come at the expense of standard operational units, such as infantry battalions (which numbered 27 for many years but have fallen to 24) and aviation squadrons, worsening the deployment burden borne by the fewer remaining units.\n\nRecommendation 19: Fully Fund Marine Corps Modernization Programs. Congress should fully fund key modernization programs, such as for the Amphibious Combat Vehicle (ACV) intended to augment (and eventually replace) the Vietnam-era Assault Amphibious Vehicle (AAV), and the Corps’ Aviation Modernization Plan, for which the 2020 NDAA should include the funding needed to accelerate procurement of F-35 and CH-53K aircraft. The ACV program is finally underway with a contractor selected this past summer to produce the ACV 1.1. This should receive Congress’s full support, as the AAV is approaching half a century in age; in fact, the Corps decided to stop a survivability enhancement program for the AAV, determining that funding would be better used for the ACV.REF\n\nFor its aviation portfolio, the Corps’ decision to pursue an all-F-35 fleet meant that it declined to join the Navy in purchasing the Super Hornet, the latest version of the F/A-18, leaving it with rapidly aging Hornets and increasing the importance of fielding the F-35 as quickly as possible. Similarly, the Corps’ ability to move and sustain ground forces that have become heavier due to the evolving need for additional armor on the modern battlefield means the CH-53K is now essential for battlefield mobility. The 2020 NDAA should account for both conditions—modern aviation assets in both fixed and rotary wing fleets—in its support of Marine Corps warfighting capabilities.\n\nRecommendation 20: Examine Marine Corps Air Defense Capabilities. The Marine Corps has minimal short-range air defense capabilities, largely limited to two battalions of air defense units that employ the FIM-92 Stinger, a short-range/low-altitude, man-portable, surface-to-air missile that can also be employed from various vehicle-mounted systems. This minimal capability has not been a problem since the end of the Cold War, as U.S. military engagements dealt with irregular and terrorist opponents who lacked any offensive air capabilities. But as the National Defense Strategy has highlighted, the military must prepare itself for potential combat against major powers that will field advanced offensive air forces. The 2020 NDAA should include a provision that calls on the Marine Corps to explain how it intends to protect its forces from such threats.\n\nRecommendation 21: Investigate Marine Corps Airborne Electronic Warfare Capabilities. With the EA-6B Prowler completing its last operational deployment in November 2018,REF the Marine Corps has no organic electronic warfare aircraft and will have to rely on the U.S. Navy’s EA-18G Growlers. The National Defense Strategy makes the case that the return of great power competition will require the U.S. military to prepare for combat against major states with the full range of modern warfighting capabilities; this will include advanced electronic warfare and the use of platforms, weapons, and systems that exploit the electromagnetic spectrum for both offense and defense. The 2020 NDAA should include a provision that calls on the Corps to explain how it intends to provide sufficient electronic warfare support comparable to what was provided by the EA-6B.\n\nRecommendation 22: Assess Marine Corps Operational Concepts in Relationship to Modernization Programs. The Marine Corps regularly publishes its thinking on future combat and implications for the tactics, techniques, organizations, and capabilities (usually manifested in equipment and how it will be used) it will need to succeed on future battlefields. The Marine Corps Operating Concept,REF Littoral Operations in a Contested Environment,REF and Expeditionary Advanced Base OperationsREF all posit a combat environment that will feature opponents wielding advanced military capabilities (weapons, sensors, and platforms across all domains and energy spectrums) and thus require the Corps to operate more dispersed, with less signature, and more nimbly.REF This implies that Marine Corps acquisition programs and capability portfolios will likely need to change. However, current programs and portfolios were initiated years ago and do not seem to have been influenced by the Corps’ new thinking. The 2020 NDAA should include a provision that calls for the Corps to explain how its new concepts are affecting, or will affect, its program going forward.\n\nRecommendation 23: Call on the Corps to Explain Alignment of Marine Corps Concepts and Efforts with the Navy’s Shipbuilding Program. As noted in the Recommendation 23, the Corps is developing new concepts that have substantial implications for the capabilities it will need in the coming years—especially those fielded by the U.S. Navy. These include the ships, at-sea and ship-to-shore connectors, and supporting aviation platforms (manned and unmanned) and weapons systems that the Navy will use to support Marine Corps operations in a naval campaign.\n\nThe Navy’s 30-year shipbuilding planREF is heavily skewed toward aircraft carriers, destroyers, and submarines, though it does include plans for a 38-ship amphibious fleet. However, the amphibious ships are large, multifunctional platforms that are nearly identical to those that have been acquired since the 1980s, albeit with more modern systems. The 2020 NDAA should include a provision calling upon the Marine Corps to explain how it is working with the Navy to develop the naval capabilities needed to execute the concepts it is developing, and the extent to which current Navy aviation and shipbuilding programs reflect such planning.\n\nThe Air Force. During the Air Force Association’s 2018 annual conference, Secretary of the Air Force Heather Wilson announced the results of a study to determine how large the Air Force needs to be in order to meet a National Defense Strategy that directs the services to prepare for strategic competition with China and Russia.REF The study revealed that the service needs 74 additional operational squadrons, including at least 15 additional tankers, 50 bombers, 182 fighters, and 210 refueling aircraft than it currently has in its inventory. When asked if any of these aircraft would be legacy platforms, such as fourth-generation fighters, Secretary Wilson responded that the new aircraft would be fifth-generation fighter and bombers and the KC-46.\n\nWhile the specifics of that study have yet to be revealed, few could rightly question the capacity and capability shortfalls spelled out by Secretary Wilson. Filling the cockpits of those aircraft will require at least 900 additional pilots who are currently not on the Air Force roster. Couple that with the 2,000-pilot shortfall the service is now experiencing, and a picture of the lagging nature of every other training pipeline for almost every Air Force specialty comes into view. As the Air Force moves to fill the airframe capacity shortfall, it must find ways to grow, accelerate, or compress respective training pipelines to meet the needs spelled out by the Secretary.\n\nRecommendation 24: Increase Air Force End Strength in FY 2020 by 4,000 to 333,100. New airmen billets will be filled as recruiting capacity and training pipelines expand, but graduation rates across the spectrum of Air Force career fields need to accelerate to meet the need.\n\nGaining the end strength required to manifest the Secretary’s vision is critically important and, in light of the U.S. Army falling short of its 2018 requiting goal, it must be done methodically. Yet, if the Air Force is to be ready for a full-out war with a near-peer competitor in the 2020s, accepting further delay in accelerating the pipeline for most career fields can no longer be tolerated. In 2021, the Air Force should be further increased to 337,100 airmen,REF and to 350,000 by 2025.REF\n\nRecommendation 25: Institute Flying-Hour Contracts with Operational and Training Wings in FY 2020 that Increase Flying Hours by at Least 20 Percent Above FY 2019 Numbers. Flying-hour contracts set a specific number of flying hours that each wing must fly during a fiscal year—a contract that wing commanders and their subordinate maintenance commanders must fulfill. Years of underfunding during sequestration, coupled with emphasis on the maintenance level of warfighting units caused the Air Force to abandon these contracts. They were replaced with flexible and easier-to-reach flying-hour goals, with the understanding that most wings would fail to meet them. The new contracts must stretch the manpower and materiel assets of each wing—and respective commander evaluations should be based on fulfilling those contracts.\n\nThe Secretary of Defense’s direction to increase aircraft mission-ready rates from as low as ~40 percent to 80 percent is an important first step in bringing units up to an acceptable standard.REF The second half of that equation is giving pilots enough training time in the air to be fully prepared for high-threat, high-intensity combat operations. Delivering flying hours at an increased rate will also expand the experience base of pilots in operational and training units more rapidly. Once these individuals become more experienced, they can move on to more senior roles, expanding the training pipelines. Expanding training opportunities will also aid in the absorption of individuals exiting those accelerated training pipelines.\n\nRecommendation 26: Cut the Duration of Pilot Training, Introduction to Fighter Fundamentals, and All Aircrew Replacement Training by 20 Percent, and Increase the Number of Annual Training Classes by a Commensurate Level by the End of FY 2020. The Army Air Corps graduated 249 pilots from a 12-month flight school in 1939. With war on the horizon, the Army compressed the duration of flight school from 12 months to 10 months in 1939, and to seven months in 1940.REF\n\nWhile wartime demands forced some sacrifices in training to get the course down to seven months, most every course within the current Air Force training pipeline has timelines that can be compressed without sacrificing quality. And quality needs to rise.\n\nThe quality of the current pilot training curriculum has been in question for several years due to graduation rates that defy historic thresholds for quality.REF Between July 1939 and August 1945, the Army Air Corps flying school graduated 193,440 pilots, and failed approximately 124,000 cadets.REF As the Air Force increases the number of training classes with the goal of increasing the overall number of graduates for each specialty, it should re-integrate screening in line with the expectations of a high-end conflict on the horizon.\n\nRecommendation 27: Increase F-35A Acquisition by 12 Jets in FY 2020, and Increase Jet Acquisition by 20 Percent Annually Until an Annual Rate of 100 F-35As Is Accepted by the Air Force. This increased production rate should be commensurate with flying-hour increases and pilot-training increases. The current F-35A delivery schedule tops out at 60 jets per year in 2026, and the total purchase of 1,763 will not be fulfilled until the year 2048—nearly 30 years from now. Even if the purchase were reduced to a total of 1,260 F-35As, the Air Force would not receive the last jet until 2037—18 years from now. The Air Force needs to get the F-35 to the flight lines as quickly as it can.\n\nRecommendation 28: Curtail the Light Attack Aircraft (LAA) Competition, and Forgo Any Move to Acquire New Fourth-Generation Platforms. If actualized, the LAA competition will end with an award for the production of approximately 179 close-air support/light attack aircraft, costing the Air Force between $3.2 billion and $4.5 billion.REF The aircraft is designed for a slow, low threat environment, and carries limited ordnance capacity, making it not worth that amount of money, particularly in light of the small mission set it could fill. The competition should end with a contract for a handful of LAA aircraft purchased to support training requirements of partner nations.\n\nCost is driving a discussion within the Office of Secretary of Defense for the Services, particularly the Air Force, to buy more than 200 fourth-generation platforms. Here, even the cost argument is not viable, as most new fourth-generation fighters will cost more per airframe than the projected price of an F-35A. While one can argue the operating costs will be higher for the stealth fighter, none of the fourth-generation fighters in the discussion would survive to engage with air-to-air missiles or deliver air-to-ground ordnance in any high-threat area. As the Secretary of the Air Force has rightly put it, capacity is an issue—but that capacity shortfall must be filled with platforms that can thrive in and among the threats of today and tomorrow. Going backward simply does not make sense.\n\nThe Space Force\n\nOne of the key issues facing the Department of Defense will be the issue of outer space security. Much discussion has already arisen over the creation of a U.S. Space Force, the first new service proposed since the creation of the U.S. Air Force in 1947.\n\nBecause of the bifurcated responsibilities between the services and the combatant commands, there has been some uncertainty about the roles and responsibilities of a Space Force. The services do not, in fact, fight America’s wars. The U.S. Army, Navy, Air Force, and Marine Corps do not commit divisions, warships, or squadrons, nor do they develop war plans. The services organize, train, and equip the forces that the combatant commands (COCOMs), such as Central Command (CENTCOM), responsible for the Middle East, or the Indo-Pacific Command (INDOPACOM), responsible for the Asian regions from the Pacific to the Indian Ocean, employ to fight wars.\n\nOuter space has been part of the purview of Strategic Command (STRATCOM), in part because of the importance of space-based early warning systems. STRATCOM has had responsibility for both outer space and the cyber realm. Indeed, it inherited responsibility for some cyber operations when it absorbed the U.S. Space Command in 2002, which itself had assumed responsibility for cyber operations in 2000.\n\nIt has become clear, however, that both outer space and the cyber realm will be major battlefields in future conflicts. This led to the separation of Cyber Command (CYBERCOM) as its own unified command in 2017,REF and will see the separation of space, and the (re)creation of the U.S. Space Command in the next year.\n\nRecommendation 29: Create an Independent Space Force that Includes All Service and National Security Space Assets and Capabilities. As a combatant command, U.S. Space Command, however, will still not have the authorities necessary to organize, train, and equip forces—the responsibility of a service. For the DOD to have that authority, it will be necessary for Congress to reconsider the organization of the DOD and the associated Title 10 authorities.\n\nEqually important, any Space Force will have to manage its human capital. In order to attract bright, young officers, a clear career path must be available to them, including opportunities to command forces, which in turn will lead to promotions. It was the creation of such clear professional trajectories in the interwar period that helped make American carrier aviation and land-based air forces so effective in World War II.\n\nWhat is clear, unfortunately, is that the U.S. military has not paid sufficient attention to how to approach the challenge of space when confronted with a peer competitor. Two decades of counterinsurgency, and a decade of fighting far-less-capable adversaries before that, have deeply eroded the skills and mental approaches necessary for confronting an enemy that can challenge the U.S. not only in the air and at sea, but also in outer space and information space. Both congressional and presidential actions reflect the concern that, in the event of a major power conflict, the U.S. military may find itself ill-prepared to contest, never mind control, the ultimate high ground.\n\nConsequently, if an effective Space Force is to emerge, it must be oriented toward providing the U.S. with the ability to secure space dominance.REF This will mean bureaucratic streamlining—simply aggregating the current range of bureaucracies will not be enough. The Space Force should not be a space version of the Department of Homeland Security. It will also require a real focus on warfighting as a central mission, with careful attention to properly managing acquisition of forces and promotion of personnel, if it is to succeed.\n\nCyber Capabilities. The U.S. military’s technological edge is eroding—quickly. The U.S. now has peer-competitors in cyberspace and, as the Director of National Intelligence observed in the 2018 World Wide Threat Assessment, “we remain concerned by the increasingly damaging effects of cyber operations and the apparent acceptance by adversaries of collateral damage.”REF The 2020 NDAA needs to prioritize optimizing the DOD’s cyber strategy, authorities, and human capitol pipeline if the military is to thrive in the emerging national security environment.\n\nRecommendation 30: Follow Through on the Cyber Solarium Commission. The 2019 defense budget created the U.S. Cyber Solarium Commission,REF a commission of government and civilian experts tasked with exploring alternative grand strategies for the United States in cyberspace. The commission is scheduled to submit its recommendations on September 1, 2019, and the DOD should be prepared to follow up on these findings. Accordingly, the 2020 NDAA should contain a provision requiring the Pentagon to develop a National Cyber Defense Strategy incorporating the research and relevant findings of the Cyber Solarium Commission within 12 months of its submission to Congress.\n\nRecommendation 31: Expand Special Operations Forces (SOF) Authorities to Perform Offensive Cyber Operations. Currently, only Special Mission Units regularly receive national-level support from the U.S. Intelligence Community for offensive cyber operations while theater special operations forces are routinely de-prioritized for this support and are explicitly prohibited from conducting offensive cyber operations. As the battlefield continues to digitize, however, this restriction unduly constrains the ability of Special Operations Forces to accomplish their mission, while simultaneously forcing them to accept elevated operational risk. These authorities should be reviewed.\n\nSpecifically, the 2020 NDAA should task the DOD with reviewing and with providing recommendations on what, if any, changes should be made to relevant sections of Title 10 and to any other relevant statute, authority, or policy.\n\nRecommendation 32: Expand Acceptable Professional Qualifications for Cyber Talent. Cyber talent in the United States is in high demand and in short supply. As the DOD seeks to fill its critical cyber workforce, it should accept non-traditional professional credentialing and schooling and thereby significantly expand the talent pools from which it draws personnel. Specifically, cyber-related credentialing from so-called technology boot camps and massive online open courses (MOOCs) should be allowed as an alternative to traditional education requirements, provided that candidates meet the necessary technical standards. Further, the DOD should also allow military personnel to apply GI Bill and related benefits toward these cyber-related alternatives.\n\nAllies\n\nA central cornerstone of American national security is the United States’ network of allies. This network is extensive and requires consistent investment and proper communication. This section’s recommendations are focused on the U.S. posture toward allies and alliances.\n\nRecommendation 33: Congress Should Remain Interested in Stationing Additional Forces in Europe, Particularly Poland. These forces should include an ABCT and air defense and missile defense battalions and batteries.\n\nRecommendation 34: Congress Should Convene a Hearing on the Subject and Continue to Press for This Change in Global Posture. In terms of global posture, in the 2019 NDAA, Congress required the Secretary of Defense to submit a report by March 1, 2019, on the feasibility and advisability of permanently stationing additional forces in Poland.REF Much of this section’s language focuses on the Army. Nevertheless, permanently stationing additional forces in Europe, especially in Poland, is an excellent means of reinforcing deterrence against opportunism by the Russian Federation and, in the case of conflict, making available immediate forces to respond, without the need for flow from the United States. The last two European Command commanders have both advocated permanently stationed, versus rotational, forces.\n\nCurrent U.S. basing structures in Europe harken back to a time when Denmark, West Germany, and Greece represented the front lines of freedom. The security situation in Europe has changed, and the U.S. should account for this shift by establishing a permanent military presence in allied nations further east, including the Baltic States and Poland.\n\nThe DOD is currently studying the feasibility of permanent basing in Poland, weighing the advantages of permanent versus rotational forces, and assessing potential basing sites. In addition, former Defense Secretary James Mattis has stated that the DOD is considering additional support elements, which any new permanent U.S. presence would require, stating: “You know it’s not just about a base, it’s about training ranges, it’s about maintenance facilities, all these kinds of things and a host of details you’ve got to study alongside.”REF\n\nThe Polish government has committed to providing between $1.5 billion and $2 billion to cover the cost of a potential permanent U.S. presence in Poland.REF The U.S. already has a sizeable presence in Poland as the framework nation for the multinational battlegroup stationed in Orzysz, where nearly 800 U.S. troops form the backbone of NATO’s Enhanced Forward Presence in Poland.REF\n\nThe U.S. continues to invest heavily in rebuilding infrastructure in Europe, including $31 million to upgrade Amari Air Base in Estonia, $4 million at Lielvarde Air Base in Latvia, $3 million at Siauliai Air Base in Lithuania, and $4.1 million at Powidz Air Base and $14 million at Lask Air Base, both in Poland.REF\n\nDespite these significant investments, the U.S. continues to rely on rotational deployments in the Baltic states and Poland. Permanent forces would provide a much greater deterrence value than rotational troops. In November 2017, Army Chief of Staff General Milley emphasized the value of ground forces in deterrence: “The air [and] maritime capabilities are very important, but I would submit that ground forces play an outsize role in conventional deterrence and conventional assurance of allies. Because your physical presence on the ground speaks volumes.”REF\n\nIn addition to providing greater deterrence value, permanently stationed forces in Europe are better prepared, better able to hold exercises, build greater interoperability with allies, and are more cost-effective. In addition, permanently stationed forces may foster increased morale as families need not be separated.REF\n\nAs the U.S. continues to reassure allies in response to continued Russian aggression, establishing a permanent presence in Eastern Europe will send a strong signal that the U.S. remains committed to collective defense.\n\nRecommendation 35: Ensure that NATO Retains Its Lead Role in European Defense Matters. In November, French President Emmanuel Macron reiterated calls for the creation of a “true European Army.”REF Despite assurances that a European Union army will complement rather than compete with NATO structures, the 2016 Global Strategy for the European Union’s Foreign and Security Policy very clearly states an ambition of “strategic autonomy for the European Union.”REF The establishment of an independent EU army will undermine transatlantic security, and will serve to decouple the United States from the legitimate interests it retains in a peaceful and secure European continent. As such, Congress should discontinue its reflexive support for European defense integration.\n\nThe U.S. should continue to focus on advancing a “NATO first” agenda, one that ensures American engagement and influence in European-related defense matters. NATO has been the cornerstone of transatlantic security for almost seven decades. It affords the U.S. a level of influence in the region commensurate with the amount of troops, equipment, and funding the U.S. commits to Europe.\n\nThe creation of duplicative EU structures, whether an unnecessary and expensive EU operational headquarters or the aspirational EU army, weakens NATO. EU defense integration undermines NATO by siphoning off scarce resources from the Alliance. Any money spent on the EU’s Common Security and Defense Policy (CSDP) is less money that can be spent on NATO. In addition, the veto power of six non-NATO EU states (five of which are neutral), almost guarantees that any EU assets would not be available for NATO operations.\n\nThe CSDP has not delivered increased military capability for the U.S. or for NATO. Rather, it competes with NATO for scarce European defense resources. This in turn undermines NATO—the ultimate guarantor of transatlantic security—a dangerous proposition, especially in light of Russian aggression. U.S. allies in Europe should focus on fixing NATO, and living up to their Article III commitments under the North Atlantic Treaty “to maintain and develop their individual and collective capacity to resist armed attack.”REF\n\nRecommendation 36: Oppose the Development of Nord Stream II. The Nord Stream II pipeline project that would connect Germany with Russia is neither economically necessary, nor is it geopolitically prudent. It is a political project to greatly increase European dependence on Russian gas, magnify Russia’s ability to use its European energy dominance as political trump card, and specifically undermine U.S. allies in Eastern and Central Europe.\n\nGerman Chancellor Angela Merkel acknowledged the political nature of the project in April.REF In 2017, Russia supplied 45 percent of German natural gas imports.REF U.S. opposition to Nord Stream II is having an impact; in September, Germany announced plansREF to build a liquefied natural gas import terminal in an effort to address U.S. concerns over Nord Stream II, and to add diversification to the country’s gas supply.\n\nWhile this decision is positive, it has not assuaged U.S. concerns. As Secretary of Energy Rick Perry recently stated, “Energy security in turn requires energy diversity. That is the reason we oppose the Nord Stream 2 project which would further increase the dangerous energy dependence many European nations have on the Russian federation.”REF Indeed, estimates are that if completed, Nord Stream II would help “concentrate 70–80 percent of Russian gas imports to Europe in one Kremlin controlled route.”REF\n\nIn addition, the project poses environmental and security risks, including allowing “Moscow to install undersea surveillance and monitoring equipment in the Baltic Sea.”REF Nord Stream II will increase Russia’s economic and political leverage in Europe and undermine security. Congress should continue its strong opposition to the pipeline project, and look for ways to hamper its financing and construction.\n\nRecommendation 37: Oppose Treaties that Harm U.S. National Security. Congress should push the Administration to promptly “unsign” the Arms Trade Treaty (ATT) and reject the Anti-Personnel Mine Ban Convention (known as the Ottawa Convention) and the Convention on Cluster Munitions (CMC). The ATT, the Ottawa Convention, and the CMC could have significant harmful effects on U.S. national security. The Senate has not provided its advice and consent to any of these treaties, the latter two have not been transmitted to the Senate, and none of them is in the U.S. national interest.\n\nArms Trade Treaty. The U.S. has not ratified the ATT, and a bipartisan majority of the Senate opposes its ratification on the grounds that it is vague, easily politicized, and could hinder the U.S. in fulfilling its commitments to provide arms to key allies. Many other leading arms-exporting and arms-importing countries also oppose the ATT, but despite its own assertion that any ATT that did not include all U.N. members would be “less than useless,” the Obama Administration signed the ATT in 2013, and belatedly transmitted it to the Senate in December 2016.\n\nRecommendation 38: Reject Funding for ATT Implementation. Congress should reiterate its previous rejections of funding to implement the ATT domestically, and should, in addition, prevent the ATT from being used as the basis for domestic prosecutions, and require that the ATT ratification process include House and Senate implementing legislation. As of 2018, the U.S. paid more of the administrative budget for the ATT than any nation except Japan. Finally, Congress should condition the payment of fees to attend the ATT’s annual conferences of states parties by requiring that such fees not exceed the amount reasonably required to pay the actual costs for attendance by the U.S. delegation, and are not used to cross-subsidize the ATT’s secretariat.\n\nAnti-Personnel Mine Ban Convention. The U.S. has not ratified this convention and it has never been submitted to the Senate. U.S. anti-personnel landmines meet or exceed all relevant international standards, and the U.S. employs such landmines responsibly. Studies by the NATO and other organizations confirm their military utility, and in 2014, the Chairman of the Joint Chiefs of Staff stated that anti-personnel landmines remain “an important tool in the arsenal of the armed forces of the United States.”REF But in June 2014, the Obama Administration banned their use outside the Korean peninsula.\n\nIn the 2017 NDAA, Congress prohibited the destruction of U.S. anti-personnel landmine stockpiles before the DOD completes a comprehensive study on department policy on the use of landmines as required in the 2016 NDAA.REF This study should contain a 10-year inventory and cost projection for current stockpiles, a similar projection for replacement munitions, and an assessment of the effects of the projected inventory on operational plans, as well as the briefing on the current state of R&D for operational alternatives to anti-personnel landmines required by the 2017 NDAA.\n\nRecommendation 39: Prohibit the Destruction of Landmine Stockpiles. Congress should repeat the requirements and prohibitions contained in the 2017 NDAA, and should also ban funding for the destruction of existing stockpiles until the DOD certifies that the replacement of anti-personnel landmines by alternative munitions will not endanger U.S. or allied forces, or pose any operational challenges. Despite the fact that the study mandated in the 2016 and 2017 NDAAs has not been published, the 2018 and 2019 NDAAs contained no similar provisions.REF\n\nCluster Munitions Convention (CMC). The U.S. has not ratified this convention, and it has never been submitted to the Senate. In 2009, Harold Koh, legal adviser to the Department of State, stated that the U.S. national security interest “cannot be fully ensured consistent with the terms of the CMC.”REF In 2001, Secretary of Defense William Cohen stated that future U.S. cluster munitions would have a 99 percent or higher functioning rate, thus reducing the danger of unexploded ordnances. This policy also allowed U.S. forces to retain and use “legacy” cluster munitions until replacement by more reliable models.\n\nIn 2008, Secretary of Defense Robert Gates stated that, after 2018, the U.S. would only use munitions with a functioning rate of 99 percent or higher. The only U.S. munition that meets this standard is the CBU-105 Sensor Fused Weapon (SFW). The U.S. has not budgeted funds to purchase the SFW since 2007, and in 2016, its manufacturer—Textron—announced it would discontinue production of the SFW.\n\nAs of May 2017, Jim Shields, the Army’s Program Executive Officer (PEO) for Ammunition, stated that the deadline creates “capability gaps that we are really concerned about.”REF As an interim measure, the U.S. Army is purchasing Swedish munitions and is considering Israeli munitions, while developing the Guided Multiple Launch Rocket System Alternative Warhead, which replaces the explosive sub-munitions in conventional cluster munitions with approximately 160,000 preformed tungsten fragments. Shields noted that the U.S. has “initiated de-milling all of our cluster munitions, but we have put a hold on that because we don’t know what the current Administration’s position is with regard to the use of cluster munitions.”REF\n\nThe CMC has also created serious problems for the F-35. The F-35 is intended to engage stationary and moving surface targets. When the F-35 was in development, it was going to use a cluster munition to achieve that objective. But then, as Air Force Lieutenant General Christopher Bogdan, PEO for the F-35 program, put it in April 2017: “The U.S., by treaty, is not allowed to use those weapons. So when that weapon left the inventory, we were left without a weapon that could hit moving targets.” While General Bogdan is incorrect that the U.S. is not allowed by treaty to use these weapons, his larger implication is accurate: The effect of the CMC, which the U.S. has neither signed nor ratified, has been to significantly degrade the F-35 program, which is projected to cost over $400 billion.REF Few enemies have imposed a heavier cost on the Armed Forces of the United States than the CMC, a treaty backed almost entirely by U.S. allies, many of whom are partners in the F-35 program.\n\nIn late November 2017, the DOD announced a modification of the 2008 policy, which requires military departments to program for capabilities that meet the 99 percent standard while maintaining a stockpile of existing cluster munitions sufficient to meet operational needs. These stockpiles will not be demilitarized until sufficient quantities of munitions that meet the 99 percent standard are available. Finally, Combatant Commanders are now authorized in cases of immediate warfighting need to accept transfers of cluster munitions that do not meet this standard, and to use these munitions in combat.\n\nRecommendation 40: Ban the Destruction of Cluster Munitions. Congress should support the November 2017 policy by prohibiting the destruction of U.S. cluster munitions stockpiles, except if required for storage safety reasons, until the DOD completes a comprehensive study on these munitions and Congress explicitly authorizes the DOD to resume its de-milling program. This study should assess the military utility of cluster munitions; provide an inventory of current stockpiles coupled with a study of past U.S. patterns of cluster-munitions use and an assessment of the effects of the closure of the SFW line; and assess the current state of R&D, acquisition, and deployment of operational alternatives to conventional cluster munitions.\n\nInternal DOD Operations\n\nReforming and refining how the DOD works has been a constant since its establishment. It is an effort that requires continuous attention and investment. Nonetheless, it has the important benefit of increasing the value that the country gets for its defense dollars and properly providing for the military. This section’s recommendations focus on improvements and reforms to the DOD’s operations.\n\nRecommendation 41: Establish Education Savings Accounts (ESAs) for Military-Connected Children. The federal government has a constitutional duty to maintain a strong military force to ensure national defense. However, military families’ dissatisfaction with education options is a major impediment to retaining a strong military force. To the frustration of many military parents, most military children are required to enroll in whichever public school is closest to the military base, regardless of whether that school is a good fit. More than one-third of families responding to a Military Times survey reported that “dissatisfaction with their child’s education was a significant factor in their decision to remain in or leave military service.”REF\n\nMilitary families, who already make many sacrifices, should not have to sacrifice their children’s education, too. Service members already face an assignment to a military base when they enroll in the Armed Forces. Empowering all families who serve with school choice would ensure that their children do not face mandatory assignment to the nearest district school. Providing military parents with ESAs would allow them to find education options that are the right fit for their children, wherever their next assignment takes them. Indeed, ESAs have garnered support from 75 percent of active duty military families.REF Moreover, Congress can repurpose existing federal revenue sources, such as Impact Aid or other titles in the Elementary and Secondary Education Act, to fund ESAs for children of military families.REF\n\nESAs can improve education options for military children since they meet the unique needs of military families. Through an ESA, a portion of what would have been spent on a child in the public system goes directly to a parent-controlled savings account. Funds can then be used for private school tuition as well as education products, tutoring, education therapy, and online learning. Education funds can even be rolled over from year to year and saved for college tuition. ESAs give military families the option to enroll their children in the local school system or pursue a school of choice. Military ESAs give parents the ability to make the best education choice for their children.REF\n\nRecommendation 42: Support the Seamless Integration of the National Technology and Industrial Base (NTIB). The 2017 NDAA required the Secretary of Defense to develop a plan to “reduce the barriers to the seamless integration” of the NTIB’s partners.REF The 2020 NDAA should support reforms that will make it easier for the U.S. to export defense technologies to its closest allies, such as the United Kingdom and Australia. These should include allowing all defense-related exports to be licensed to close allies absent a U.S. decision to refuse within a specified and limited time period, and the system-level licensing of such exports, which would allow the automatic and immediate export of follow-on parts, components, servicing, or technical plans. Canada is already rightly treated separately under U.S. law, and the Defense Secretary’s plan should reflect this fact and ensure that its exemption is updated to show the pending completion of export-control reform, and to remove any other impediments discovered in the course of preparing the plan.\n\nRecommendation 43: Authorize Full Pay Raises as Determined by the Employment Cost Index to Assist in Recruiting from a Shrinking Candidate Pool. Demographic trends and lower unemployment rates mean that the DOD will have a more difficult time recruiting for the increasing Armed Forces. Adding to this problem is a growing number of individuals between the ages of 17 and 24 who are physically or mentally ineligible for military service. The Center for Naval Analyses estimates that only 29 percent of Americans in this age group are eligible for military service, based on recruitment practices and demographic trends.REF\n\nRecommendation 44: Reform Basic Allowance for Housing (BAH). Congress needs to reform the BAH rules. The BAH needs to be restored to its proper role of an allowance by requiring married military couples to share a single allowance, and by requiring all service members to document their housing expenditures in order to receive the allowance. These changes would reduce costs and are completely appropriate. Congress should phase in a more accurate housing allowance, since it is solely designed to help service members pay for accommodation. This allowance is not military compensation. Service members are not entitled to, nor should they have any expectation, that BAH money they receive in excess of what they pay for housing can be retained as extra compensation.\n\nRecommendation 45: Reduce Commissary Subsidies and Combine Commissary and Exchange Systems. Congress should merge commissary and exchange systems. The DOD operates two parallel, but similar, organizations for providing service members and their families with access to goods and groceries. The commissaries provide groceries at cost plus 5 percent, which is only sustainable through an annual subsidy. In FY 2018, Congress subsidized the commissaries at $1.4 billion.REF On the other hand, the military exchanges operate largely without subsidies by passing appropriate costs on to the consumers. Maintaining access to affordable groceries and goods is important for service members, particularly those stationed overseas or in remote locations. In the debates for the 2018 NDAA, Congress had a reporting requirement that would provide a cost-benefit analysis and aim to reduce the operational costs of commissaries and exchanges by $2 billion. Congress should revisit the question and continue with reforms to the systems. This is especially important at a time when the GAO has found that the DOD does not properly measure the recruiting and retention benefits created by the systems.REF\n\nRecommendation 46: Authorize a New Round of Base Realignment and Closure (BRAC). Congress should authorize a new round of BRAC. The DOD has assessed that it has more than 19 percent excess infrastructure that would be reduced through a BRAC.REF Further, Congress has mandated that the DOD study its excess capacity; that report is due with the 2021 budget.REF The report should serve as the starting point for a new round of BRAC, not as an excuse to delay the process even further. The excess capacity burdens taxpayers and the Department with unnecessary costs that would be better allocated elsewhere in the budget. The DOD estimates that a new round of BRAC would save $2 billion in fixed costs.REF\n\nA new round of BRAC should set a target reduction goal to reduce the infrastructure by a percentage that Congress should determine. There are multiple ways in which Congress can change how a BRAC round develops to quash questions and doubts that lawmakers might have.REF From establishing different criteria for installation assessments to dedicating full-time staff to BRAC and its studies, Congress and the DOD can work together to mitigate all the questions that have led to the rejection of a new round of BRAC.\n\nRecommendation 47: Reject New “Buy American” Requirements. The DOD, like other federal agencies, has a limited budget on which it relies to support its mission. “Buy American” is a great bumper sticker and political slogan, but it is bad economic and security policy.REF Buy American requirements can artificially increase the costs of goods and services procured by the DOD, increasing the tax burden for Americans and reducing the DOD’s overall purchasing power and ability to procure goods that are essential for national defense. Not only are Buy American laws unnecessary for most commercial goods, but ensuring that the DOD complies with these regulations can be costly. Budgeting policies should allow the DOD to readily source goods, especially items that are non-essential for military defense and are widely market-accessible.\n\nBuy American requirements, like other protectionist measures, such as tariffs, harm the overall U.S. economy more than they help, as they can lead to higher costs and a decline in American innovation. While it is the DOD’s mission to keep America secure, it is not the mission of the DOD to execute industrial policies. Buy American advocates argue that DOD resources should subsidize U.S. industries and employment regardless of the price. It is also an attempt to shield local industries from competition.\n\nThe 1933 Buy American Act sets a price preference for domestic products by requiring the DOD to add 50 percent of the lowest foreign offer.REF After applying the additional 50 percent to the foreign offer, the DOD then determines which offer is the best value. Often the price preference ensures that the domestic producer will win the bid.REF This means that a project that could have cost the DOD $20 million could cost American taxpayers as much as $30 million before a foreign bid may be considered.\n\nPurchases by the DOD under $3,000 have been exempt from the Buy American Act to allow for expediency around regulatory compliance. Over the years, this threshold has steadily increased to $10,000, given the likely increase in compliance costs.\n\nThe DOD is also subject to the Berry Amendment, which restricts the DOD from using funds to purchase food, clothing, tents, and certain other goods unless the items are “entirely grown, reprocessed, reused, or produced within the United States.”REF The Defense Logistics Agency has issued waivers for a number of goods, such as zipper components, gloves, fasteners, or sandbags, that are not 100 percent domestically sourced material.REF Still, the DOD continues to go through multiyear review processes to find domestic sources for footwear and other items that are widely available internationally.\n\nAccording to the Inspector General’s report, the DOD has trouble complying with Washington’s Buy American requirements.REF DOD contracting personnel did not comply with 40 of 109 contracts that were subject to the Berry Amendment, nor with 41 of 171 contracts that were subject to Buy American Act requirements. In total, $214.4 million of $610 million in procurement, roughly one-third of the contracts, were not Buy American compliant and required all military services and the Defense Logistics Agency to modify these contracts.\n\nThe same goes for expanding Buy America to our strategic allies. From a national security perspective, the DOD already has the authority and flexibility to avoid relying on potential adversaries for critical resources or capabilities. Free and open competition among friendly countries will produce the best products and best prices, and ensure that America’s service members overseas receive the supplies they need when they need them.\n\nRecommendation 48: Lift the Moratorium on Public–Private Competition. Under pressure from federal employee unions since 2012, Congress has prohibited competition between public and private organizations for the more cost-effective services for the U.S. government. This moratorium even extends to public–public competition, which leads to situations, for instance, where the municipality in which a base is located may not offer its services to the installation. DOD-specific competition remains prohibited per section 325 of the 2010 NDAA.REF\n\nYet even critics will admit that “competition is the greatest single driver of performance and cost improvement.”REF The RAND Corporation has estimated that opening support services for the military to private competition could result in savings of between 30 percent and 60 percent.REF The common criticism levied against such competition is that the process has not been updated and has yield problems for both government and the private sector.REF This is more reason for Congress to revisit Circular A-76 and make the necessary updates to allow implementation.REF\n\nRecommendation 49: Exempt the DOD from the Davis–Bacon Act. Congress should exempt the DOD from Davis–Bacon requirements to ensure that military construction projects are as affordable as possible. The Davis–Bacon Act requires that construction contractors pay prevailing wages when working on projects for the federal government. The increased cost of construction is significant for the DOD, which requested $10.5 billion for construction projects in FY 2019.REF The prevailing wage rates used by the government bear no resemblance to actual market wages. As a result, the Davis–Bacon Act increases the cost of federally funded construction by 9.9 percent.REF\n\nRecommendation 50: Increase Use of Performance-Based Logistics (PBL). Congress should incentivize and enable the broader use of PBL throughout the acquisition process. The DOD should increase the use of PBL in weapon-systems maintenance and sustainment. It is estimated that these arrangements could save between $9 billion and $32 billion a year. REF PBL is an arrangement in which the contractor is responsible for a larger portion of the support throughout the life cycle of the product. Thus, instead of having a contract that is associated with the delivery of a platform, it is associated with the proper functioning of said platform.REF It serves to align the contractors’ interests with the DOD in maintaining the readiness of platforms. PBL is both DOD policy and a priority for product support solutions and it is estimated that it saves between 5 percent and 20 percent of contract costs.REF\n\nRecommendation 51: Congress Should Direct the Pentagon to Provide a Report Listing Potential Changes to Streamline the Audit and to Focus on the Areas of Highest Payoff. On November 15, 2018, the Pentagon announced that it had “failed” its financial audit—the first it ever had to undergo.REF To be more accurate, the auditors gave the Pentagon a “disclaimer” on their books, meaning they were unable to render an opinion because the records were insufficiently available or maintained. For decades, the Pentagon has struggled to comply with the law, which requires it to undergo an audit.REF And, the struggle is real, and it is related to the size and history of the DOD.\n\nThe DOD is the largest of all federal departments. It has more than $2.7 trillion in assets and more than 2 million people spread over the globe. The nation’s military is 243 years old, and it was not built for auditability. It was constructed incrementally over time to win wars, and today finds itself composed of a multitude of overlapping and diverse financial and inventory systems and processes.\n\nPentagon Comptroller David Norquist estimated that, in 2018 the audit will cost $918 million; $367 million in direct costs and $551 million to fix the problems the audit finds. That is a small fraction of the DOD’s 2018 budget of $700 billion, but still enough to buy nine F-35 jet fighters.\n\nThere is a widespread, but misplaced, belief in Congress that the financial audit of the DOD will identify large areas of waste or fraud; yet the audit experiences of other federal agencies and private corporations largely do not support that expectation.REF\n\nThere are better methods to reduce waste or inefficiency, such as “waste audits” or zero-based budgeting techniques. Further, many of the audit requirements imposed on private corporations make little sense when applied to the DOD. An example of the illogic of the financial audit construct as applied to the DOD is the requirement to report precisely the value of all $2.4 trillion worth of its tangible assets, including decades-old equipment, like M113 armored personnel carriers purchased in the 1970s, and buildings constructed hundreds of years ago. This makes sense in the private sector, not for the DOD.\n\nClearly, the Pentagon should be held accountable for the funds with which it is entrusted. No one is arguing for a “free pass” for the DOD. But since the Pentagon downplayed the importance of the audit for so many years, it now is in an unfavorable position to take the lead in advocating changes in the requirements.\n\nTo make the audit more effective, then, Congress must take the lead. Lawmakers must engage with the Pentagon and, together with the Federal Accounting Standards Advisory Board, implement commonsense changes to the audit. For example, Congress could remove non-value-added areas, such as balance-sheet valuation and accounting for the existence and completeness of major military equipment—an area in which no problems were found in the 2018 audit.\n\nRecommendation 52: Create a Pilot Program to Roll Over Unused Funds. Congress should authorize a program that allows the DOD to roll over unused funding to the next fiscal year. On October 1 of every fiscal year, any funding that remains unused vanishes. This creates the fear among DOD agencies that unused funds could mean less funding the next year. This creates a “use it or lose it” mentality within the department, which leads to poor spending choices, as unnecessary purchases are made in the interest of using up the funds. DOD agencies tend to spend up to 31 percent of their annual funds in the fourth quarter. September is especially busy, with spending twice as high as during the other months of the year.REF\n\nAs Jason Fichtner and Robert Greene, economists at the Mercatus Center, assessed, this acceleration of federal spending decreases the quality of spending, as poor choices are made in the interest of quickly using funds.REF So long as the entities do not benefit from saving funds, there is no incentive for them to spend more efficiently. A pilot program for specific DOD agencies enabling them to roll over 5 percent of their budget could go a long way toward finding a solution to this problem across the entire department. This program would have the added benefit of helping the DOD cope with the constant continuing resolutions that erode spending authorities.\n\nRecommendation 53: Increase the Lifespan of Operations and Maintenance (O&M) Funding to Two Years. Recent budget years have led to multiple years starting under a continuing resolution. These continuing resolutions reduce the time that the DOD has to allocate taxpayers’ dollars, since they reduce the time available to implement changes.REF The time reduction is especially important when dealing with dollars allocated to the O&M account, since this is funding that must be spent in the same fiscal year in which they are appropriated. The funding for other accounts has a longer shelf life, and the DOD has been able to take advantage of that longer shelf life to dampen the effects of continuing resolutions.\n\nCongress should increase the lifespan of resources in the O&M account to enable the Pentagon to better navigate the realities created by continuing resolutions. It is a recommendation backed by the NDS Commission, which states that “[o]ne concrete step would be for Congress to authorize DOD to expend Operations and Maintenance funds from any given fiscal year during that fiscal year and the subsequent one.”REF It would be a simple solution that would help the DOD cope with the realities of Congress’s budget discussions.\n\nRecommendation 54: Remove Non-Defense Research Funding. Congress should keep non-defense research funding out of the NDAA. Congress has the bad habit of inserting non-defense research projects into the NDAA that do not directly contribute to the national defense, or to the better functioning of the Armed Forces. These tend to concentrate around medical research, such as the Army’s Congressionally Directed Medical Research Programs.REF These programs are better suited elsewhere in the medical community, be it inside or outside government. It is a stretch to argue that the Army is the best institution to conduct research on breast cancer.\n\nRecommendation 55: Review Reporting Requirements. As they write the 2020 NDAA, Members of Congress should be cognizant of the fact that a portion of the workforce’s size in the Pentagon is directly driven by the need to prepare and review congressionally required reports. Reporting requirements have increased and crept up through time. These requirements lead to increased staff time dedicated to producing these reports. Congress should start to sunset reports that are no longer relevant, and also be mindful of new reporting requirements.\n\nRecommendation 56: Advance Reform of Occupational Licensing for Military Families. Occupational licensing requirements can restrict a myriad of employment opportunities with minimal or no public safety benefit, and these barriers to lawful employment can be particularly troublesome for military families.REF While the states should continue to reduce unnecessary occupational licensing restrictions, the 114th Congress introduced legislation to begin to address this issue and the 116th Congress should return to that debate.REF “Many states make it difficult for former service members to find work in the private sector in fields such as nursing and truck driving even though the military fully trained them in those occupations.”REF Military spouses face similar hardship: They are 10 times more likely than the average American to move interstate, 35 percent to 50 percent have occupations that require licensure, and approximately 75 percent require re-licensure after moving interstate.REF It is unsurprising, therefore, that unemployment among military spouses is nearly 12 percent higher than the national average.REF\n\nIn 2018, the U.S. Departments of Homeland Security and Defense reported that they have worked successfully with some state legislatures to establish interstate compacts adopting uniform standards for license portability for certain occupations, and the two departments aptly recommended that states continue to increase economic opportunity through those compacts.REF In 2016, both chambers of Congress introduced the Alternatives to Licensing that Lower Obstacles to Work (ALLOW) Act, which, in part, would have enabled military spouses to use on military bases whatever professional licenses they earned elsewhere.REF That would also be a step in the right direction. The 116th Congress should reintroduce a revised version of that bill “to permit any licensed military spouse to continue practicing anywhere in his new state of residence, or at least to apply to any property owned or leased by the federal government on a military installation or elsewhere” to further expand economic opportunities to military families.REF\n\nRecommendation 57: Strengthen Spiritual Fitness Resources in Veteran Suicide Prevention. Congress should direct the DOD, in consultation with commanders, chaplains, and military medical professionals, to develop a suicide-prevention program based on the findings and recommendations of Harold Koenig and Tyler VanderWeele.REF The program should be available to all members of the Armed Forces and their dependents. It incorporates, as an optional component, opportunities for religious practice in accordance with each member’s faith. Congress should direct the DOD to make appropriate training on the availability and reported benefits of such a suicide prevention program available to commanders, chaplains, and military medical professionals.\n\nConclusion\n\nThe NDAA for FY 2020 will determine whether the military will sustain the gains in readiness of the past few years, or if the rebuild will languish in its infancy. Congress needs to be a part of the solution and provide the Department of Defense with the resources it needs to continue the rebuild. A FY 2020 topline of $742 billion would show U.S. allies and adversaries alike that the United States intends to follow through with its new National Defense Strategy and focus on great power competition. After all, the defense budget not only serves to equip the Armed Forces, but also to signal America’s posture abroad. Congress needs to send the message that the United States is seriously investing in competition and shaping the future of the international order.\n\n—Frederico Bartels is Policy Analyst for Defense Budgeting Policy in the Center for National Defense, of the Kathryn and Shelby Cullom Davis Institute for National Security and Foreign Policy, at The Heritage Foundation. Justin Bogie is Senior Policy Analyst in Fiscal Affairs in the Grover M. Hermann Center for the Federal Budget, of the Institute for Economic Freedom. Ted R. Bromund, PhD, is Senior Research Fellow in Anglo-American Relations in the Margaret Thatcher Center for Freedom, of the Davis Institute. Thomas Callender is Senior Research Fellow for Defense Programs in the Center for National Defense. Dean Cheng is Senior Research Fellow in the Asian Studies Center, of the Davis Institute. Emilie Kao is Director of the Richard and Helen DeVos Center for Religion and Civil Society, of the Institute for Family, Community, and Opportunity. Klon Kitchen is Senior Research Fellow in Technology, National Security, and Science Policy in the Douglas and Sarah Allison Center for Foreign Policy, of the Davis Institute. Daniel Kochis is Policy Analyst in European Affairs in the Thatcher Center. Jude Schwalbach is Research Assistant in the Center for Education Policy, of the Institute for Family, Community, and Opportunity. John-Michael Seibler is Legal Fellow in the Edwin Meese III Center for Legal and Judicial Studies, of the Institute for Constitutional Government. Thomas W. Spoehr is Director of the Center for National Defense. John Venable is Senior Research Fellow for Defense Policy in the Center for National Defense. Riley Walters is Policy Analyst for the Asian Economy and Technology in the Asian Studies Center. Dakota L. Wood is Senior Research Fellow for Defense Programs in the Center for National Defense.", "description": "The 2020 defense budget will be the most important defense budget of the Trump Administration. The 2020 budget request is the first one fully developed by the Trump team.", "authors": ["Frederico Bartels"], "top_image": "https://www.heritage.org/themes/heritage/src/images/bell.png"}