{"pub": "bbc", "url": "https://bbc.co.uk/news/technology-49880018", "downloaded_at": "2019-10-01 11:45:30.436020+00:00", "title": "Brits' internet use peaks at 21:00 on Wednesdays, ONS says", "language": "en", "text": "Image copyright Getty Images\n\nPeak time for being on the internet in Britain is 21:00 on Wednesdays, the Office for National Statistics (ONS) suggests.\n\nBy contrast 04:45 on weekdays is the quietest time, it says.\n\nThe ONS has started analysing internet traffic volume for the first time, using publicly available data from one of Britain's largest internet exchanges.\n\nHowever, it acknowledges the early results are not conclusive.\n\nOne expert told the BBC the data used had a significant limitation because it was unlikely to have included box-set streaming.\n\nSpotting trends\n\nThe study made use of data from the London Internet Exchange (Linx), which connects internet service providers and content delivery networks.\n\nIt operates exchanges in London, Edinburgh, Cardiff and Manchester, but some of the data was extrapolated from the London area alone.\n\nAndrew Ferguson from the news website ThinkBroadband told the BBC that while the study had merit, often online box-set viewing will not be included in Linx data as this is delivered in a different way.\n\n\"This is not the full story but when combined with other data can reveal trends, rather than absolute figures,\" he said.\n\nWhile the ONS said it was still working on the statistics, it found that internet traffic in the UK increases in winter and decreases in summer.\n\nLinx London data throughput 2011 to 2019 monthly average\n\nOther insights included that traffic:\n\nfalls between 16:00 and 18:00 with its lowest point at 18:00 on weekdays (not weekends)\n\nis quietest between 02:00 and 07:00\n\npeaks at 21:00 on weekdays, particularly midweek\n\nis generally quieter at weekends and bank holidays\n\npeaks at 13:00 during weekends\n\nSaturday night is lowest data flow\n\nThe ONS made comparisons with other data such as road traffic information - for example, matching an increase in traffic on the M25 motorway around London during the time that internet data traffic was lower, as people commuted home after work.\n\nThis approach also revealed some interesting behaviours around special events: there was not a significant spike in data flow during online shopping sale cyber- Monday, and during the England v Croatia football World Cup semi-final in 2018 there was more data exchanged during half time and before the extra time at the end of the match than there was during game itself.\n\n\"Insights on large-scale events such as adverse weather and sports could potentially help to provide measurements of economic impact over time,\" wrote Philip Stubbings, lead data scientist at the ONS Data Science Campus.", "description": "The Office for National Statistics has begun to analyse internet data use for the first time.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/E544/production/_109029685_gettyimages-614526398-1.jpg", "published_at": "2019-09-30"}