{"pub": "yahoo", "url": "https://sg.sports.yahoo.com/hamilton-apos-no-interest-whatsoever-134000843.html", "downloaded_at": "2019-10-25 16:31:14.486383+00:00", "title": "Hamilton has 'no interest whatsoever' in Formula E", "language": "en", "text": "Formula 1 world champion Lewis Hamilton says he has \"no interest whatsoever\" in trying Formula E despite his eco-friendly ideals, and addressed allegations of hypocrisy over recent environmental comments.\n\nThe Mercedes driver has been a vocal proponent of his plant-based diet and has been increasingly active in raising concerns about the environment on his social media platforms.\n\nFE champion Jean-Eric Vergne recently told Motorsport.com that the all-electric series, which cites helping against climate change and promoting electric vehicles as its primary objective, was the perfect fit for Hamilton and his green credentials after his F1 career ends.\n\nRead Also:\n\nHowever, when asked by Motorsport.com about strong recent comments about the state of the planet and if he would like to try FE, Hamilton said: \"I have no interest whatsoever to do Formula E.\n\n\"It's not something I plan currently to do beyond [F1].\"\n\nHamilton's environmental comments on Instagram drew scorn from some critics, who labelled him a hypocrite for telling others to be more eco-friendly when he races in F1 and travels around the world to do so.\n\nContinuing his answer to Motorsport.com's question, Hamilton admitted it was difficult for those on the outside to reconcile an F1 driver talking about environmentalism.\n\n\"People have opinions about how I use social media but ultimately it's my platform,\" he said. \"We all have a voice, it's how you choose and how you want to use it.\n\n\"It's not the easiest because we are travelling around the world and using Formula 1 cars. Our carbon footprint is for sure higher than the average homeowner who lives in the same city!\n\n\"But that doesn't mean you should be afraid to speak out for positive change. I'm always looking at things I can improve on the effect I'm having on the world.\n\n\"It's something over time you become more aware of, it's not a quick fix, it takes time to understand the implications.\n\n\"It's just about education. I'm just trying to highlight areas. Whether people choose to look into those it's up to them. I'd feel like I wasn't doing anything positive if I didn't mention it.\"\n\nHamilton's comments and use of social media to espouse his views was supported on Thursday by four-time world champion Sebastian Vettel.\n\nVettel, who shuns social media, agreed it is \"very difficult to get acceptance from the outside, because we don't have the smallest footprint because the races happen around the world\" but said that does not mean those in F1 cannot talk about it.\n\n\"F1, I feel, should do more,\" said Vettel. \"It is a worldwide operating platform, I think we should send a much stronger message regarding this subject.\n\n\"This is free to everyone. Everyone can do something, contribute a little bit and if the whole world would act like that it would make a huge difference.\n\n\"It is inevitable that change is coming and hopefully sooner rather than later.\"\n\nRacing Point driver Sergio Perez added: \"It is very important that we raise our voices. Especially for someone like Lewis.\n\n\"I see the messages he sends out on social media are good, a lot of people follow him. If we can impact the world, if we can help a bit, we are obliged to do. So I don't see anything wrong with that.\"\n\nRead Also:\n\n\n\n", "description": "Formula 1 world champion Lewis Hamilton says he has \"no interest whatsoever\" in trying Formula E despite his eco-friendly ideals, and addressed allegations of hypocrisy over recent environmental comments.", "authors": ["Feedback", "Scott Mitchell"], "top_image": "https://s.yimg.com/uu/api/res/1.2/MMCp.A.rMHS0VSg8XuPkRA--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-GB/homerun/motor1_uk_340/52d4197100b62e483f980cee699e1968", "published_at": "2019-10-25"}