{"pub": "investing.com", "url": "https://in.investing.com/news/forex-news/em-asia-fxmost-asian-units-firm-thai-baht-hits-over-6year-high-2001857", "downloaded_at": "2019-10-09 07:24:26.962944+00:00", "title": "EM ASIA FX-Most Asian units firm; Thai baht hits over 6-year high", "language": "en", "text": "© Reuters. EM ASIA FX-Most Asian units firm; Thai baht hits over 6-year high\n\n* Thai baht firms to strongest level since June 2013\n\n* Philippine c.bank may not cut rates further this year\n\n* High-level Sino-U.S. trade talks awaited\n\n(Adds text, updates prices)\n\nBy Shreya Mariam Job\n\nOct 9 (Reuters) - Most Asian currencies edged higher against the dollar on Wednesday, with the Thai baht hitting a more than six-year peak, as investors held their ground amid a fresh escalation in Sino-U.S. tensions ahead of high-level trade talks.\n\nRelations between the world's two biggest economies worsened after the U.S. government widened its trade blacklist to include some of China's top artificial intelligence startups, which drew a sharp rebuke from Beijing. altercations just days ahead of the high-level talks dampened hopes of a deal to be struck at the negotiation.\n\n\"Expectations for the high-level trade talks are very low. Thus, any news that suggests a further deterioration in the U.S.- China relationship has been broadly priced in,\" said Eugenia Fabon Victorino, head of Asia strategy at Skandinaviska Enskilda Banken.\n\nThe Chinese yuan CNY=CFXS opened slightly weaker before firming 0.1%, while the Singapore dollar and the Taiwan dollar TWD=TP remained largely unchanged.\n\nMeanwhile, the Indonesian rupiah IDR=ID slipped 0.2%, while the Indian rupee INR=IN and the Malaysian ringgit weakened marginally.\n\nSouth Korean financial markets were closed for a holiday.\n\nTHAI BAHT\n\nThe baht THB=TH strengthened 0.3% against the dollar to its strongest since June 2013, with traders shrugging off the central bank's worries about the currency's strength. baht has been the strongest performer among Asian units this year, driven by the country's hefty current account surplus and fund inflows. It has also shown a resilience to global volatility over the U.S.-China trade spat.\n\nPHILIPPINE PESO\n\nThe peso firmed 0.3% after the central bank governor indicated that last month's rate cut may be the last for the year.\n\nHowever, Governor Benjamin Diokno said the central bank will deliver more cuts in the reserve requirement ratio (RRR) should the inflation outlook continue to improve. eased in September to the lowest in more than three years, putting this year's inflation target within reach.\n\nCURRENCIES VS U.S. DOLLAR Change on the day at 0601 GMT\n\nCurrency\n\nLatest bid Previous day Pct Move Japan yen\n\n107.170\n\n107.07\n\n-0.09 Sing dlr\n\n1.382\n\n1.3824\n\n+0.04 Taiwan dlr\n\n30.847\n\n30.842\n\n-0.02 Baht\n\n30.330\n\n30.41\n\n+0.26 Peso\n\n51.750\n\n51.91\n\n+0.31 Rupiah\n\n14175.000 14150\n\n-0.18 Rupee\n\n71.110\n\n71.02\n\n-0.13 Ringgit\n\n4.196\n\n4.192\n\n-0.10\n\n7.142\n\n7.1465\n\n+0.07\n\nChange so far in 2019\n\nCurrency\n\nLatest bid End 2018\n\nPct Move Japan yen\n\n107.170\n\n109.56\n\n+2.23 Sing dlr\n\n1.382\n\n1.3627\n\n-1.38 Taiwan dlr\n\n30.847\n\n30.733\n\n-0.37 Korean won\n\n1193.100\n\n1115.70\n\n-6.49 Baht\n\n30.330\n\n32.55\n\n+7.32 Peso\n\n51.750\n\n52.47\n\n+1.39 Rupiah\n\n14175.000 14375\n\n+1.41 Rupee\n\n71.110\n\n69.77\n\n-1.88 Ringgit\n\n4.196\n\n4.1300\n\n-1.57 Yuan\n\n7.142\n\n6.8730\n\n-3.76", "description": "EM ASIA FX-Most Asian units firm; Thai baht hits over 6-year high", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEA8F0KP_L.jpg", "published_at": "2019-10-09"}