{"pub": "theverge", "url": "https://theverge.com/2019/10/30/20939056/call-of-duty-modern-warfare-campaign-review-single-player", "downloaded_at": "2019-10-30 14:17:16.648949+00:00", "title": "Call of Duty: Modern Warfare’s political message is buried under blockbuster bravado", "language": "en", "text": "This post contains light spoilers for the single-player campaign of Call of Duty: Modern Warfare (2019).\n\nEarly Sunday morning in northwest Syria, US forces invaded the compound of ISIS leader Abu Bakr al-Baghdadi, forcing the leader of one of the most vicious, well-organized, and resourceful terrorist groups in recent history to retreat into a series of underground tunnels. There, he detonated a suicide vest and killed three of his children in the process. The mission was deemed a success, and President Trump has since declared the raid a stunning victory for his administration and “a great night for the United States and for the world.”\n\nJust hours later and thousands of miles away, I was watching a near-identical virtual simulation of such a moment play out on my television screen, courtesy of the latest Call of Duty game. Playing as newly recruited spec ops specialist SAS Sergeant Kyle Garrick, I was participating in a joint US-UK raid on the compound of Omar “The Wolf” Sulam, the leader of the fictional terrorist group Al-Qatala, in the made-up country of Urzikstan.\n\nDeveloper Infinity Ward, of course, were not privy to any such real-life operation; the whole mission is modeled after the real-life Abbottabad raid that took down Osama bin Laden, with some obvious visual cues borrowed from Kathryn Bigelow’s film Zero Dark Thirty. But the context of such missions, it seems, is always similar enough these days not to matter.\n\nThis is Modern Warfare, and the game is billed as a grisly return-to-form for the aimless yet massively popular first-person shooter series. This iteration brings back the franchise’s once-signature single-player campaign with the aim of capturing an unprecedented level of gritty realism. And Infinity Ward largely succeeds in that respect: the new Modern Warfare is far and away the most graphically impressive, pulse-pounding, and immersive war game I have played since the Battlefield series’ visceral recreation of WWI.\n\nLike its predecessors, Modern Warfare also offers little in the way of thoughtful commentary on war or geopolitics, yet I’m starting to feel it unfair to ever expect that or to think shooter games are even capable of such a feat. That said, it sure does try, mostly by amplifying the sights and sounds of combat to an alarming degree of fidelity.\n\nIn the Wolf raid mission, you move through the compound’s three-story house, and you’re asked to clear each room of each floor with methodical, high-precision lethality. It’s one of a few nighttime raid sequences in the game modeled after high-profile assassination operations the US has carried out over the last decade. These missions almost singularly define the single-player campaign’s newfound tone: slow, maddeningly tense, and punctuated by brief and shocking outbursts of violence.\n\nModern Warfare also offers little in the way of thoughtful commentary on war or geopolitics, but it does try\n\nYou’re given only about two magazines of ammo, but you need no more than two or three bullets for each of the house’s armed inhabitants, which are typically middle-aged and nondescript Middle Eastern men found in rooms adjacent to cowering women and children. The game urges you to mount your silenced automatic rifle on the edges of door frames, so you can peak around corners with night vision activated and laser sights viewable only by you and your team. You see a pair of eyes, and as soon as a gun is raised, you squeeze the trigger three times. The sound design — the way the silenced bullets feel like they’re being siphoned through a steel straw and the heavy thump of bodies slumping to the ground — makes your hair stand on end. Shoot an unarmed woman and it’s game over and you start back at the bottom. Those are the rules of engagement.\n\nEventually, you discover the Wolf is not located in the house, but in a series of tunnels underneath the building. You chase him down there, and the game switches from tense military thriller to full-blown action flick. Anything that moves that’s not your partner, Urzikstan freedom fighter and US ally Farah, is fair game. You’re dodging flaming debris from the explosions collapsing the tunnel behind you and flash banging away the sight lines from turret-manning bad guys. You find The Wolf holed away inside a bunker, broadcasting his message to his followers as you close in. One shot to the head and it’s over. Yet you then have to clip a series of wires on his suicide vest to prevent it from detonating and taking you with him. Mission accomplished.\n\nModern Warfare’s main strength is that it does not shy away from acknowledging that conflict today operates on a different moral plane than the historically sanitized world wars of past popular shooters. In this game, you move painfully slow, often under the cover of night, and aided by the US’s Goliath-level technological advantage. Your fights are claustrophobic, fought in tight quarters, and often prone to collateral damage. Civilians are caught in the crossfire, despite your best efforts, and the game’s primary thematic bent is grappling with the notion that the “good guys” may have to resort to bad tactics to achieve the morally righteous result.\n\n“When you take the gloves off, you risk getting blood on your hands,” longtime series favorite Captain Price tells his new protege Garrick, who becomes an acolyte of Price’s brand of state-sanctioned strong-arming after he only barely survives a terrorist attack at Piccadilly Circus in London that left scores dead and the culprits on the loose. So you, as the player, take up arms as Garrick, and occasionally the more steely CIA verteran Alex, to bring the real fight to the terrorists, with the gloves off.\n\nYou move painfully slow, often under the cover of night, and aided by the US’s Goliath-level technological advantage\n\nThat appears to be the game’s muddy message. That this is what the world’s most skilled soldiers must resort to if they’re to maintain peace and, more importantly, US international hegemony. That it’s not all good guys vs. bad guys, but more mushy grey serving the interests of amorphous concepts like liberal democracy and, unsaid in the game, the military industrial complex that keeps the US at the top and everyone else playing by its rules. That is until someone breaks the rules or tries to change the game, and you’re tasked with taking them out.\n\nMuch of the conversation around Modern Warfare so far has centered on its dicey depictions of war crimes, aimed seemingly at stirring up controversy for controversy’s sake. There is indeed an interactive waterboarding scene (you’re on the receiving end of the torture), and a child soldier sequence (it’s more of a cinematic escape mission where you play a very young version of main character Farah, who must kill enemy soldiers to survive a Russian slaughter). Yes, you can use white phosphorus, a weaponized chemical agent banned for use near civilians under the rules of the Geneva Convention, as a killstreak reward item in the game’s competitive multiplayer.\n\nI certainly sympathize with the concerns. The interactive waterboarding sequence was gross and unnecessary, even if in the moment it felt jarring and effective. And the child soldier scene was gratuitous, even if the mission’s opening featured Farah’s father ushering her through a Russian massacre of her small village in one of the most disturbing video game cinematics I’ve ever witnessed.\n\nThese moments need to be earned. It’s hard to argue that Modern Warfare does enough of the legwork in its painfully short cutscenes and minimal environmental storytelling in the roughly six-hour campaign to use topics like torture and genocide as narrative tools, instead of blunt instruments of shock and awe. It’s just more “No Russian,” the infamous mission from Modern Warfare 2 that had you, the player, get to choose to participate or not in an airport terrorist attack at your discretion. It’s nothing new for video games, even if it does look and feel alarmingly real these days.\n\nBut I find those elements of the Modern Warfare campaign overshadow what it does manage to do well: creating an unrivaled and convincing atmospheric war experience that feels of its time and doesn’t go grossly overboard with its sanitization of Western foreign policy. (I understand that last bit is up for debate.) It’s what the game is selling and it delivers in full, and anyone looking for a shooter campaign with superb writing, stellar acting, and a mix of tense combat with mind-blowing set pieces could do a whole lot worse than Modern Warfare.\n\nThis is what a modern shooter should look, feel, and play like. And unless you find the entire genre morally compromised, which is a perfectly reasonable position to hold, you will find Modern Warfare’s campaign both exhilarating and upsetting in equal measure. That is clearly by Infinity Ward’s design.\n\nIf there is concrete political philosophy with any kind of depth in the game, it comes from a line spoken by Price that first turned heads when it was just a bit of voice over in an early trailer: “We get the dirty and the world stays clean; that’s the mission.” It’s used to reassure Garrick after a particularly arresting interrogation sequence the game openly invites you not to participate in, which of course makes that much more complicated when you find yourself in the room with a tied-up Al-Qatala leader and a gun pointed to his wife’s head. “Where do we draw the line?” Garrick asks Price afterward. “Wherever you need to,” he says.\n\nA bolder, less blockbuster-focused game might have made Price the true villain — a UK-born monster largely of America and its Western allies’ making that will go to the ends of the Earth to do what he thinks is right, international law be damned. But that’s not what this game wants to do and it’s certainly not what it wants to say. There are sequels to make, after all.\n\nCall of Duty, like the wars it tries to tell stories about, marches on toward the next villain\n\nInstead, Call of Duty, like the wars it tries to tell stories about, marches on toward the next villain. There’s always another head for Price to claim, so long as the US writes the checks, and there’s always another game to make, so long as consumers keep buying and playing them. Throw in the towel and stop fighting, and all hell might break loose, we keep being told. The writers of Modern Warfare couldn’t come up with a tidier metaphor for Western foreign policy if they tried.\n\nBut I would be lying if, when I put the controller down as the credits rolled and CIA handler Kate Laswell identifies the new head of Al-Qatala, I said I didn’t feel like something profound had crashed over me. The US had killed al-Baghdadi, and just today, Trump says we killed his No. 2. Maybe ISIS vanishes, yet something else will likely take its place. And Modern Warfare, finished months before any of this went down and based largely on Hollywood depictions of armed conflict, did a better job of articulating that vicious cycle than anything else I’ve experienced in recent memory. Perhaps it’s entirely by accident, but it’s a message worth hearing all the same.", "description": "Call of Duty: Modern Warfare is billed as a grisly return-to-form for the aimless yet massively popular first-person shooter series. This iteration brings back the franchise’s once-signature single-player campaign with the aim of capturing an unprecedented level of gritty realism. And Infinity Ward largely succeeds in that respect.", "authors": ["Nick Statt", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/a8IyYQ0EHDQePh7I4mCU9HE06so=/0x0:2048x1072/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19329892/call_of_duty_modern_warfare_1.png", "published_at": "2019-10-30"}