{"pub": "newrepublic", "url": "https://newrepublic.com/article/155249/spreading-gospel-modern-monetary-theory", "downloaded_at": "2019-10-03 23:25:54.561162+00:00", "published_at": "2019-10-03", "title": "Spreading the Gospel of Modern Monetary Theory", "language": "en", "text": "For all of the technical discussions of MMT in dueling op-eds and Twitter debates alike, this year’s gathering of the MMT community suggested that the key promoters of MMT are now lay activists who, like Coates, have taken the ideas underpinning MMT directly to curious voters and academics with an interdisciplinary interest in social justice movements. Coates was joined on the civil rights panel by University of Washington historian Camille Walsh, who gave a presentation on tax rhetoric and school segregation, and Bucknell University professor Nina Banks, who is penning a biography of Sadie Alexander, the first African-American economist and a proponent of the job guarantee. There was a nod to this in a presentation by University of Missouri-Kansas City professor Scott Fullwiller. “There are no economic problems,” he said at one point. “There are social problems, there are technological problems, there are environmental problems, there are social-technological-environmental problems. There are not economic problems.”\n\n\n\nThe conference’s attendees included not just professors and curious college students, but activists, software engineers, and a smattering of the currently unemployed. One of the latter, an IT specialist named Stephen, spoke up after the civil rights panel to describe how his life had been upended by the global financial crisis. “While I’m very progressive, I’m not unlike many Trump voters,” he told the panelists. “I look like them, I often sound like them—there’s a lot of things that you could see in my life that mirror them.”\n\n“This is very real to me,” he continued. “This isn’t some fun thing. You know, I am constantly on edge living like a feral cat.”\n\n“The only thing that kept me from hanging in my basement was the fact that I’ve got a child with autism who will never probably be independent a day in his life,” he continued. “This is very real to me,” he continued. “This isn’t some fun thing. You know, I am constantly on edge living like a feral cat.”\n\n\n\nHis words reflected the general mood of many of the non-economists who found themselves at the conference, including more or less ordinary people who found, in MMT, further fuel for their skepticism and anger toward both financial institutions and the traditional economic assumptions fomented by the recession and its aftermath.\n\nOne of the blows against orthodox thinking has been the persistence of low inflation rates even as unemployment has plummeted—economic convention holds that there ought to be an inverse relationship between unemployment and inflation, an idea that has at times justified contractionary measures to slow down the economy in order to stave inflation off. In a viral exchange with Ocasio-Cortez during a House hearing in July, Federal Reserve chair Jerome Powell conceded that conventional wisdom about inflation had been defied in recent years, the memory of which drew renewed ire from Rocco Million, a self-described disabled vet who attended the conference’s workshop on inflation. “That’s sadistic!” he said. “And nobody even blinks an eye. Every citizen should be flipping out. We’re forcing millions of people to be unemployed to fight a war against inflation when we don’t even know what creates it!”\n\n“The national debt, you know—every baby’s born with $64,000 worth of debt,” laughed Allyson Drucker of Real Progressives, a site promoting MMT. “It’s fear porn! It’s by design to keep us from learning the truth and being able to see what they’re doing.”\n\n\n\n“Wages are the way they are because corporations have control,” she continued. “Because of money going into politics and deregulation and all that crap. So a lot of people say job guaranteed or a or a Green New Deal or whatever isn’t going to happen because the corporate world won’t let it happen. I don’t believe that. I think we have the power and it’s going to happen.\n\n\n\n“They’re saying Bernie’s crazy,” Million responded, “What are they talking about? We’ve got millions of people all across America that are either under-employed or unemployed.”\n\n\n\nExchanges like this suggest that MMT has taken on a life of its own—discussions among those who have developed an interest in its theories have moved well beyond its basics. This is in part because some of those basics have been at least partially conceded by a number of prominent economic voices over the past few years in statements often chronicled by Stony Brook economics professor Stephanie Kelton—easily the most high profile voice in the MMT movement—who spoke during a panel on “MMT and the Public Sphere.”\n\n\n\n“Here comes [outgoing American Economic Association president] Olivier Blanchard, January of this year, at the AEA presidential address,” she said. “He delivers remarks that shift the policy discussion almost overnight. What does he do? He gets up and says, ‘Actually it appears that the debt is not on an unsustainable trajectory. Given the relationship between interest rates and growth rates for the last three decades, it is reasonable to expect that the neutral term will look much like the recent past, and therefore we could probably sustain not just trillion dollar deficits, but perhaps even larger ones.’”\n\n\n\nShe mentioned, too, recent remarks from European Central Bank (ECB) president Mario Draghi about MMT, which he brought up unprompted at a meeting of the ECB’s Governing Council as an example of heterodox monetary ideas worth examining. “These are objectively pretty new ideas,” he said. “They have not been discussed by the Governing Council. We should look at them, but they have not been tested.”\n\n\n\n“[Federal Reserve Chair Jay] Powell was asked about MMT,” Kelton said. “Janet Yellen was asked about MMT. The question gets posed, but with Draghi—he just invoked it on his own.”\n\n\n\nThe question is being posed in the United States not only in direct response to the ideas advanced by MMT’s theorists but in response to fiscal and political realities—debt reduction has been jettisoned from the national political conversation and we’ve already entered a world of expanding deficits without commensurate budget cuts or increases in taxation. Even skeptical economists and thinkers have conceded that some of the policy projects on which MMT advocates focus, such as addressing climate change, will be as expensive as they are existentially necessary.\n\n\n\nIn a policy landscape where debt is already an afterthought, MMT’s significance seems to be in its role as a new kind of public economics for progressives. This new way of thinking about the political economy is winning converts less on the strength of any particular argument about money creation or inflation than on the implications of its reframing of our political and economic constraints, and its suggestion that solving much of what ails our increasingly unequal society is a matter of willpower rather than finances. Those speaking up in defense of the assumptions MMT assails would do well to consider that the hearts and minds of the public are rarely won on technicalities.", "description": "Once the province of wonks, the MMT cause is being embraced by ordinary people in search of a more moral economy.", "authors": ["Osita Nwanevu"], "top_image": "https://images.newrepublic.com/760eb82905e63989f99088135b252669db04378c.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg"}