{"pub": "bbc", "title": "How veganism is taking the step from kitchen to closet", "url": "https://bbc.com/news/business-49409405", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 09:32:09.603355+00:00", "text": "Image copyright Doctor Martens Image caption Dr Martens' vegan boots represent 4% of all pairs sold\n\nRemember when synthetic leather was the fall-back option, if you couldn't afford the real thing?\n\nNot any more.\n\nIt has just become a selling point: clothes and accessories marketed as free from cow skin and any other animal products, are being launched by retailers up and down the High Street, including Marks & Spencer, Zara and New Look.\n\nThere are fur coats, that are \"vegan\", jute and plastic \"vegan\" belts, and shoes made from tree bark, natural rubber and coconut fibre, labelled \"vegan\".\n\nWhile an increasing number of Brits are trying to eat less meat, market researchers Mintel found in their latest fashion and sustainability report that the trend is now spreading from kitchen to closet. It found animal welfare came top of a list of issues that people said they considered before buying clothes, with 42% saying it was important to them.\n\nMintel predicted 2019 would see a boom in animal-free shoe collections with shoppers of all ages saying they would buy footwear labelled \"vegan\".\n\n\"It seems to be a bit of a buzz word,\" says Patsy Perry, senior lecturer in fashion marketing at the University of Manchester.\n\nImage copyright Getty Images Image caption Designer Stella McCartney is seen as a pioneer of animal-friendly fashion\n\nAs well as being on trend - and with a much better ring to it than \"synthetic leather\" - the \"vegan\" label does convey an important extra distinction, Ms Perry points out.\n\n\"If you are labelling it as vegan, the whole product needs to be vegan,\" she says. That means checking things like the glue that holds the shoe together for example and the chemicals used for finishing them.\n\nAt the top end, designers like Stella McCartney - described by Ms Perry as the original pioneer in this area - have shunned leather and fur for some time. Her fashion house is now exploring a leather substitute made from fungi, and looking at replacing silk with yeast proteins.\n\nBut it is at the more accessible end of the market where the trend is really taking off, with some big brands already converting demand for vegan fashion into sales.\n\nDr Martens - purveyors of high-top leather boots - has experienced a 300% rise in sales of the vegan version of its stompers over the past year.\n\nLaunched right back in 2011, the vegan DMs are made from a combination of polyester fabric and polyurethane. After last year's rapid growth, vegan boots represented 4% of all pairs sold.\n\nThe Vegan Society says they've seen a boom in products registered with the vegan trademark: in 2018 there were 119. So far this year it says 1,956 have been registered.\n\n\"New products are being added daily, and many new brands are currently in the process of submitting products for review - including some very well-known High Street brands,\" says the Vegan society's Dominika Piasecka.\n\nThese new products aren't for the most part, though, coming at an extra to cost to consumers.\n\nVegan Doc Martens cost the same as the leather originals. New Look, one of the first High Street chains to use the vegan trademark prices ballet \"flats\" at £7.99 and a vegan laptop handbag at £29.99, comparable with its other products.\n\nThis marks a change, points out retail analyst Kate Hardcastle. In the past ethical products, whether that was fair trade or organic came at a premium.\n\nOn the other hand, once upon a time that \"leather-look\" handbag would have cost half the price of the real thing. So should these products cost less?\n\nCharging similar prices to general ranges is justifiable, argues Ms Hardcastle, since the cost of materials is a small part of the overall cost and the cost of production isn't likely to be significantly lower for vegan products.\n\nShe does strike a note of caution though, over just how ethical these new ranges are overall.\n\nThe debate over durability, production techniques, crop-growing impacts, pollution, biodegradability and recyclability is a complicated one, not to mention the ethics around the working conditions for people making the products, whatever the component materials.\n\nEnvironmental campaigners are adamant that the best approach to is to buy less, never mind what the item is made of.\n\nSome companies are \"dressing up\" items using the vegan tag, warns Ms Hardcastle, to make products appear \"far more environmentally [and] ethically friendly than the product actually is\".\n\nConsumers should not be \"lulled into a false sense of security\" that just because something isn't an animal hide it is suddenly therefore environmentally friendly, she warns. \"That isn't the case.\"", "description": "How the vegan trend is moving from kitchen to clothes closet.", "authors": ["Jill Treanor", "Dan Ascher", "Business Reporter", "Bbc News"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/17D3E/production/_108389579_vegan_1460_black_landscape_.jpg"}