{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/20/WS5dabdaa2a310cf3e3557177d.html", "downloaded_at": "2019-10-20 08:19:48.810926+00:00", "title": "Winter sports industry bridges China and the world", "language": "en", "text": "Visitors try their hand at curling during the World Winter Sports (Beijing) Expo 2019 at the National Convention Center in the capital on Oct 17, 2019. [Photo/Xinhua]\n\nBEIJING - Wearing VR glasses and walking on snow boards, passionate visitors lined up to experience the 4-minute \"Skiing in the Alps\".\n\nThis is a glimpse of how enthusiastic people get about ice and snow sports in China.\n\nPeople's love for ice and snow was on full display at the World Winter Sports (Beijing) Expo 2019 in Beijing this week, where more than 600 enterprises from China and abroad showcased their products and services.\n\nAs the annual WWSE enters its fourth year, China is moving into a new era of market boom and technological advances in the field.\n\nAccording to a recent report by IDG Asia, China's ice and snow market is estimated to reach one trillion yuan by 2022.\n\nChina has also launched a development plan for the winter sports industry in March this year to enrich mass ice and snow activities, implement the strategy of \"expanding to the North, the West and the East,\" promote the expansion of ice and snow sports during all four seasons, and strive to achieve the goal of involving 300 million people in ice and snow sports.\n\n\"It's an ambition to have 300 million Chinese people have access to winter sports,\" Jan Dijkema, President of International Skating Union, said. \"The upcoming Olympics 2022 is a huge opportunity for China. The Expo provides exchanges of information and technology, and it's an incredible opportunity for China to realize the ambition.\"\n\n\"With higher expectations on the 2022 Games, it's important to promote the high-quality development of winter sports,\" said Zhang Jiandong, vice mayor of Beijing and executive vice chairman of the Organizing Committee for the 2022 Winter Olympics and Paralympics.\n\n\"We hope that you can make full use of the platform of the winter Expo, conduct in-depth discussions and exchanges, and extensively carry out practical cooperation in enterprise docking, project cooperation, personnel training, winter tourism, so as to achieve more fruitful results.\"\n\nBOOMING DEMAND\n\nIce and snow equipment are well represented at this year's WWSE.\n\nCarving Ski, one of China's leading ski resort service specialists, showcased its latest automated snowmaker.\n\n\"With the improvement of people's living standards, skiing has gradually become popular not just among athletes but also among ordinary families. Although the European industry has a history of 100 years, we have only 20 years, but it doesn't affect our pace of catching up,\" said Yu Yang, Vice president of Carving Ski.\n\n\"Now China's ice and snow market is huge and the cost of imported equipment is high, so we increased independent research and development, reduce costs to help more Chinese people to be able to afford ice and snow sports,\" she added.\n\nCarving Ski is one of the many Chinese companies that have cashed in on China's huge demand for winter sports, as the country enters the \"Olympic Cycle\" and deploys a plan to localize.\n\nIn June 2019, the Ministry of Industry and Information Technology, the State General Administration of Sport and other nine departments jointly issued an action plan for the development of the ice and snow equipment industry (2019-2022).\n\nIt is proposed that, by 2022, the annual sales revenue of China's ice and snow equipment industry will exceed 20 billion yuan, with an average annual growth rate of more than 20%.\n\n\"We now provide design, construction, management and operation for about half of the country's snow fields. This benefits from the expanding consumer demand behind it,\" Yu said.\n\nAccording to the data of IDG, in 2018-2019, the number of domestic skiers reached 23.45 million, an increase of 21.5% compared with 19.3 million in 2017-2018.", "description": "", "authors": [], "top_image": "http://img2.chinadaily.com.cn/images/201910/20/5dabdaa2a310cf3e97a21422.jpeg", "published_at": "2019-10-20"}