{"pub": "yahoo", "url": "https://news.yahoo.com/over-why-political-influence-foreign-184935747.html", "downloaded_at": "2019-10-22 13:45:48.928552+00:00", "title": "'Get Over It'? Why Political Influence in Foreign Policy Matters", "language": "en", "text": "WASHINGTON — A July 25 call between President Donald Trump and the president of Ukraine is the basis for an impeachment inquiry into whether Trump withheld U.S. military aid until Ukrainian officials investigated former Vice President Joe Biden and his son Hunter.\n\nLast week, the acting White House chief of staff, Mick Mulvaney, effectively acknowledged the quid pro quo, although he said the aid was in part contingent on Ukraine’s investigating Trump’s widely debunked theory that Ukraine, not Russia, was responsible for hacking Democratic Party emails in 2016. The theory is politically helpful to Trump because it would show he was elected president without that Russian help.\n\nMulvaney was unapologetic in his remarks. “I have news for everybody: Get over it,” Mulvaney told reporters at the White House. “There’s going to be political influence in foreign policy.” (He later reversed himself and has said his comments were misconstrued.)\n\nReaders have asked The New York Times to explain why, exactly, another nation’s interference in the democratic process is such a serious issue.\n\nHere are some answers.\n\nWhy don’t we want foreign countries involved in our elections?\n\nOther countries have their own interests, and those interests don’t always match ours, said Trevor Potter, the founder of the Campaign Legal Center, a nonpartisan group that works to ensure fair elections.\n\n“Many countries are rivals of ours and of our democratic system,” Potter said. He listed as two chief examples China and Russia, countries that Trump has publicly suggested could help him achieve his political aims. “In some cases, they’re going to want policies that help them and therefore hurt us. In other cases, though, they just want us to fail.”\n\nTrump administration officials — but not the president himself — have publicly and repeatedly warned foreign governments not to meddle in U.S. elections.\n\nAre protections against this kind of thing in place?\n\nYes. The ability of a foreign nation to gain access and influence over the U.S. democratic process has been a concern since the early days of the republic.\n\nDuring the Constitutional Convention in Philadelphia in the summer of 1787, delegates debated what kind of behavior should merit a president’s removal from office. George Mason suggested the standard of “high crimes and misdemeanors,” which holds to this day. One of the high crimes the framers had in mind was accepting money from a foreign power, or what Alexander Hamilton said was giving in to “the desire in foreign powers to gain an improper ascendant in our councils.”\n\nIn short, the authors of the Constitution saw few bigger threats than a president corruptly tied to forces from overseas.\n\nWhat was the quid pro quo on the Ukraine call?\n\nTrump has denied any explicit quid pro quo — a favor or advantage granted or expected in return for something — in his call with the Ukrainian president, Volodymyr Zelenskiy. He has repeatedly referred to it as a “perfect” conversation.\n\nBut several elements of the call could conceivably have been used as bargaining chips by Trump.\n\nOne was the U.S. military aid, which came to nearly $400 million for security assistance to help Ukraine fight Russian aggression on its eastern border. The other was a proposed Oval Office meeting between Zelenskiy and Trump, highly desired by Zelenskiy as a powerful show of U.S. support at a time when Ukraine is under threat from Russia.\n\nAccording to a summary of the call released by the White House, Trump raised two matters after Zelenskiy spoke of his need for U.S. help. “I would like you to do us a favor, though,” Trump said, shifting the conversation to ask Zelenskiy to investigate the Bidens as well as the conspiracy theory.\n\nZelenskiy responded that his prosecutor general would look into those issues, and asked Trump to provide any additional information that could aid in the investigation.\n\nSo what’s the problem?\n\nAt its most basic level, asking another government for help — whether a quid pro quo existed or not — means that Trump would find himself indebted to another country.\n\nDoing this in private is especially alarming, Potter said, because the Trump administration’s decision to even temporarily withhold military aid for a country that needs to arm itself against Russia goes directly against U.S. national security interests.", "description": "WASHINGTON -- A July 25 call between President Donald Trump and the president of Ukraine is the basis for an impeachment inquiry into whether Trump withheld U.S. military aid until Ukrainian officials investigated former Vice President Joe Biden and his son Hunter.Last week, the acting White House chief", "authors": ["Katie Rogers"], "top_image": "https://s.yimg.com/uu/api/res/1.2/3eF2QY5FBt58BNQkV81dWA--~B/aD0yMjAwO3c9MzMwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/the_new_york_times_articles_158/56c0ded27720df738120109434e15a4a", "published_at": "2019-10-21"}