{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/brexit-boris-johnson-latest-news-no-deal-terrorism-organised-crime-eu-a9147476.html", "downloaded_at": "2019-10-08 15:13:44.673530+00:00", "title": "Brexit: UK at greater risk of terrorism and organised crime if it leaves EU with no deal, government admits", "language": "en", "text": "Britain will be at greater risk from terrorism and organised crime if it crashes out of the EU without a deal, a government document has admitted.\n\nAttempts to reach new security agreements with EU members – to replace the European Arrest Warrant and the Schengen Information System database of suspects – “cannot fully compensate”, it concedes.\n\nThe admission comes just weeks after James Cleverly, the Conservative party chairman, insisted security co-operation would continue seamlessly, even after a no-deal Brexit on 31 October.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIn contrast, the ‘No-Deal Readiness Report, published by Michael Gove, states that a crash-out “would result in some mutual loss of capability for the UK and EU member states”.\n\nThe UK would be forced to aim for “maximising our use of Interpol” and to use “bilateral channels and other multilateral mechanisms outside EU structures”.\n\nShape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty\n\nThe document insists they are “largely tried and tested mechanisms” already used with the likes of Norway and Switzerland – while admitting they are inferior.\n\nThe 155-page – which follows the leak of the Operation Yellowhammer warnings of food, fuel and medicine shortages – also states:\n\n* The UK is still “seeking arrangements” for involvement in Europol after a no-deal Brexit and to continue sharing passenger data.\n\n* There “may be reduced availability and choice” of some food products – although “there would be no overall shortage”.\n\n* The EU is refusing to grant the UK an immediate “adequacy decision” to allow the free flow of data – which will force companies and other organisations to try to make their own arrangements.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\n* UK ferry companies will be required to provide extensive data in order to continue operating, such as “last 10 ports visited, special or additional security measures taken by the ship, crew list and passenger list”.\n\n* It will take “up to five days” for adult social care providers to import products from the EU.\n\n* Emergency supplies of chemicals may have to be imported to “purify the water supply”, if the industry’s contingency plans are insufficient.\n\n* The biggest suppliers of insulin, life-saving treatment for diabetics, have capacity to stockpile 18 weeks’ worth of supplies.\n\n* A total of 15,000 civil servants have been pulled off working on other projects to prepare for Brexit.\n\nThe British Chambers of Commerce warned its fears of a no-dal Brexit were still “rising”, as a bitter briefing war broke out between London and EU capitals.\n\n“It’s good that government has got its shoulder to the wheel, but it’s going to have to push a lot harder to give businesses answers to the many complex and detailed questions they have in order to trade successfully in the event of an unwanted no-deal exit,” said Dr Adam Marshall, its director general.", "description": "Britain will be at greater risk from terrorism and organised crime if it crashes out of the EU without a deal, a government document has admitted.", "authors": ["Rob Merrick"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2014/07/03/09/uk-airport-security.jpg", "published_at": "2019-10-08"}