{"pub": "marketwatch", "url": "https://marketwatch.com/story/rising-optimism-for-brexit-deal-as-eu-talks-go-into-final-stretch-2019-10-16", "downloaded_at": "2019-10-17 01:49:22.888552+00:00", "title": "Rising optimism for Brexit deal as EU talks go into ‘final stretch’", "language": "en", "text": "BRUSSELS — The European Union and Britain inched ever closer to a Brexit deal on Wednesday, with the leaders of France and Germany saying they expected an agreement could be sealed within a day at an EU summit.\n\nPositive vibes radiated from French President Emmanuel Macron and German Chancellor Angela Merkel at a joint news conference in Toulouse, France.\n\nMerkel told reporters that negotiations were “in the final stretch.” Macron said: “I want to believe that a deal is being finalized and that we can approve it” Thursday, when EU leaders are due to meet British Prime Minister Boris Johnson in Brussels.\n\nDifferences between the two sides remained but were narrowing.\n\n“Good progress, and work is ongoing,” EU chief Brexit negotiator Michel Barnier told reporters Wednesday evening as he prepared to brief the EU Parliament’s Brexit steering group.\n\nJohnson, meanwhile, likened Brexit to climbing Mount Everest, saying the summit was in sight, though still shrouded in cloud.\n\nBrexit negotiations have been here before — seemingly closing in on a deal that is dashed at the last moment. But with Britain’s Oct. 31 departure date looming and just hours to go before the EU leaders’ summit, hopes were increasingly turning toward getting a broad political commitment, with the full legal details to be hammered out later. That could mean another EU summit on Brexit before the end of the month.\n\nNegotiators were locked inside EU headquarters with few details leaking out. Wild movements in the British pound Wednesday underscored the uncertainty over what, if anything, might finally be decided.\n\nMeetings between Barnier and key EU legislators as well as with ambassadors of the member nations were rescheduled for the evening — an indication there was still momentum in the ongoing talks among technical teams from both sides.\n\nThe focus of recent talks has been the thorniest component of a deal: how goods and people will flow across the land border between EU member Ireland and Northern Ireland, which is part of the U.K.\n\nSo far, all plans to keep an open and near-invisible border between the two have hit a brick wall of opposition from Johnson’s key Northern Irish ally, the Democratic Unionist Party. Leaders from the party met several times with the British prime minister Wednesday as he tried to win their support. Without it, any Brexit deal is likely to be rejected by Britain’s Parliament — which has already voted down prospective deals three times.\n\nJohnson told Conservative Party lawmakers on Wednesday that he believed a deal was close.\n\nLegislator Bim Afolami quoted the prime minister as saying “the summit is in sight, but it is shrouded in cloud. But we can get there.”\n\nNorthern Ireland is not the only issue. The eventual withdrawal agreement will be a legal treaty that also lays out other aspects of the U.K.’s departure — including issues like the divorce bill Britain must pay to leave and the rights of U.K. and EU citizens living in each other’s territories. It will set up a transition period in which relations would remain as they are now at least until the end of 2020, to give people and businesses time to adjust to new rules.\n\nBut the agreement will likely leave many questions about the future unanswered, and Britain’s departure is sure to be followed by years of negotiations on trade and other issues.\n\nEven if a deal is inked this week, moves in the British Parliament could still mean another delay to Britain’s planned Oct. 31 departure.\n\nU.K. lawmakers are determined to push for another delay rather than risk a chaotic no-deal Brexit that economists say could hurt the economies of both the U.K. and the EU. They have passed a law ordering Johnson’s government to seek to delay the departure if a deal isn’t in place by Saturday.\n\nJohnson has both promised to obey Parliament’s order and vowed to leave the bloc on Oct. 31, deal or no deal.\n\nParliament has also repeatedly rejected previous attempts at a Brexit deal. With the need to get Parliament’s approval looming over negotiations, EU leaders are seeking reassurances from Johnson during this week’s summit that he has the political weight to push any new deal through the House of Commons, which is due to meet Saturday for its first weekend session in almost 40 years.\n\nThe Brexit talks plodded ahead Wednesday, further delaying preparations for the EU summit. Since the weekend, negotiators have been locked in long sessions on how to deal with detailed customs, value-added tax and regulatory issues under British proposals to keep goods and people flowing freely across the border between Northern Ireland and Ireland.\n\n“Talks have been constructive, but there still remains a number of significant issues to resolve,” EU Commissioner Dimitris Avramopoulos said after being briefed by Barnier.\n\nBeyond the questions of disrupting daily life, an open Irish border underpins both the local economy and the 1998 peace accord that ended decades of Catholic-Protestant violence in Northern Ireland. But once Britain exits, that border will turn into an external EU frontier that the bloc wants to keep secure.\n\nThe big question is how far Johnson’s government is prepared to budge on its insistence that the U.K., including Northern Ireland, must leave the EU’s customs union — something that would require checks on goods passing between the U.K. and the EU.\n\nAn alternative is to have checks in the Irish Sea between Britain and Northern Ireland. But Northern Ireland’s DUP, the party that props up Johnson’s minority Conservative government, strongly opposes any measures that could loosen the bonds between Northern Ireland and the rest of the U.K.\n\nPro-Brexit Conservative British lawmaker David Davis said success in passing a Brexit deal rests on the stance of the DUP.\n\n“If the DUP says, ‘This is intolerable to us’ that will be quite important,” he said.\n\nDUP leader Arlene Foster said the party had not yet consented to a deal. She tweeted: “Discussions continue. Needs to be a sensible deal which unionists and nationalists can support.”", "description": "The European Union and Britain inched ever closer to a Brexit deal on Wednesday, with the leaders of France and Germany saying they expected an agreement...", "authors": ["Associated Press"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT450_merkel_ZG_20191016162543.jpg", "published_at": "2019-10-16"}