{"pub": "townhall", "url": "https://townhall.com/tipsheet/timothymeads/2019/09/25/acting-dni-maguire-can-you-cut-it-with-the-fake-news-crap-about-me-im-not-quitting-n2553721", "downloaded_at": "2019-09-25 23:27:33.281466+00:00", "title": "Trump's Acting DNI: Cut The Fake News Crap. I'm Not Quitting.", "language": "en", "text": "At 2:44 PM, the Washington Post ran a story, titled, \"Acting director of national intelligence threatened to resign if he couldn’t speak freely before Congress on whistleblower complaint.\" At 3:25 PM, Acting Director of National Intelligence Joseph Maguire politely issued a statement basically calling this report absolute fake news.\n\nWaPo thought it had a bombshell report. It looked as if Maguire was going to quit because President Donald J. Trump and his White House were going to do their best to block him from testifying before Congress regarding the Ukrainian whistleblower complaint.\n\nvia WaPo: The acting Director of National Intelligence threatened to resign over concerns that the White House might attempt to force him to stonewall Congress when he testifies Thursday about an explosive whistleblower complaint about the president, according to current and former U.S. officials familiar with the matter. The revelation reflects the extraordinary tensions between the White House and the nation’s highest-ranking intelligence official over a matter that has triggered impeachment proceedings against President Trump. The officials said that Joseph Maguire, who was thrust into the top intelligence post last month, warned the White House that he was not willing to withhold information from Congress, where he is scheduled to testify in open and closed hearings on Thursday. The move was in part designed to force the White House to make an explicit legal decision on whether it was going to assert executive privilege over the whistleblower complaint, which centers on a call that Trump made with the leader of Ukraine in late July.\n\nSwing and a miss. Here is what Maguire told Olivia Gazis at CBS: \"At no time have I considered resigning my position since assuming this role on Aug. 16, 2019. I have never quit anything in my life, and I am not going to start now.\"\n\n\"I am committed to leading the Intelligence Community to address the diverse and complex threats facing our nation,\" Maguire added.\n\nI am committed to leading the Intelligence Community to address the diverse and complex threats facing our nation.” — Olivia Gazis (@Olivia_Gazis) September 25, 2019\n\nThe Left is in overdrive, folks. The impeachment frenzy has revved their engines and the mainstream media is falsely reporting any tidbit from this swamp of a town that could make President Trump look like a bad guy. The next few months will be a fake news a la carte buffet line where the mainstream media will grab whatever they can if it advances their agenda. Tune in to Townhall for the truth about the impeachment.", "description": "\"I have never quit anything in my life, and I am not going to start now.\".09/25/2019 19:25:21PM EST.", "authors": ["Timothy Meads", "Matt Vespa", "Cortney O'Brien"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/268/393a22cf-ec8e-4c10-b1c3-e90101b2b657.png", "published_at": "2019-09-25"}