{"pub": "yahoo", "url": "https://news.yahoo.com/chile-protests-three-killed-supermarket-193152869.html", "downloaded_at": "2019-10-21 01:36:10.607702+00:00", "title": "Chile protests: At least eight people killed during riots in Santiago", "language": "en", "text": "Debris of a burnt and looted supermarket in Chile: REUTERS\n\nAt least eight people have been killed in Chile during a second day of protests and rioting in the South American nation.\n\nThree people were left dead after a looted building was set ablaze, the governor of Santiago, the country’s capital, said.\n\nFive more people were later found dead in the basement of a burned-out warehouse.\n\nThe Chilean military declared another night-time curfew for Sunday evening as the government struggled to contain the violent protests.\n\nDemonstrations first began on Monday after a 4 per cent hike in public transport fares was announced.\n\nStudents reacted by organising protests, which involved hundreds of young people descending on metro stations in Santiago.\n\nThe crowds jumped over turnstiles in a fare-dodging protest.\n\nBut hundreds of thousands of commuters were left stranded after subway services were suspended.\n\nThe demonstrations have become increasingly violent over the course of a week, prompting a state of emergency to be declared.\n\nSantiago descended into chaos on Friday as riots left several buildings on fire and shuttered the city’s metro system.\n\nHugo Millacoy Gonzalez, a mechanical engineer, took his young son to the San Jose de La Estrella metro station to protest the fare hikes.\n\nHe said he was demonstrating “so my son sees that they can’t mock the people”.\n\nA protester kicks a tear gas canister during clashes in Santiago (AP) More\n\nStudents also set up barricades, started fires at the entrances to subway stations and looted businesses.\n\nPolice officers fired tear gas at crowds of protesters in response.\n\nSebastian Pinera, Chile’s president, announced he was cancelling the fare increase on Saturday night.\n\n“I have heard with humility the voice of my compatriots,” said Mr Pinera.\n\nBut despite the announcement the violent demonstrations continued into Sunday.\n\nPolice detain a protester in Santiago (Esteban Felix/AP) More\n\nThe burnt supermarket was one of 60 Walmart-owned outlets which have been vandalised in recent days.\n\nThe company have said many of its stores were closed as the violence continued.\n\nMr Pinera declared a state of emergency on Friday, as riots caused millions of pounds in damage to vandalised metro stations, shops and office buildings.\n\nA curfew remains in effect for six Chilean cities.\n\nTroops have been called in to patrol the streets of Santiago and at least two airlines have cancelled flights into the capital.\n\nAdditional reporting by agencies", "description": "At least eight people have been killed in Chile during a second day of protests and rioting in the South American nation.Three people were left dead after a looted building was set ablaze, the governor of Santiago, the country’s capital, said.", "authors": ["Zamira Rahim"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ngVP6zHQbmzZ9UJwoJ1bfQ--~B/aD0zOTU7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_635/374a161e2b1d0be2067d2d462a909465", "published_at": "2019-10-20"}