{"pub": "fox", "url": "https://foxbusiness.com/luxury/neiman-marcus-christmas-fantasy-gifts-include-champagne-vending-machines-an-aston-martin-and-more-for-under-a-cool-1-million", "downloaded_at": "2019-10-18 10:36:39.546354+00:00", "title": "Neiman Marcus unveils 2019 fantasy gifts", "language": "en", "text": "It’s the most wonderful time of the year for holiday shoppers with expensive taste.\n\nContinue Reading Below\n\nNeiman Marcus has rolled out its annual Christmas Book with more than 800 luxury fantasy items and experiences for the holidays ranging from $99 to under a cool $1 million.\n\nWell-heeled gift-givers with deep pockets can shell out for custom Christian Louboutin pumps or an electric blue Aston Martin custom-designed by 007 Daniel Craig himself and a Michelin-star dinner by Italian chef Massimo Bottura. Make your list and check your bank account twice if you can afford to splurge on some of these most over-the-top fantasy items and experiences on the list.\n\nPassport to Paris for $125,000 custom Louboutins\n\nFashionistas can get the chance to visit iconic designer Christian Louboutin’s boutique on rue Jean Jacques Rousseau where they can choose five pairs from the latest collection to bring home. That’s not all, you’ll then get to design a one-of-a-kind custom couture shoe and kick up your heels at a cabaret club. The $125,000 splurge will also include a two-bedroom suite at the Mandarin Oriental in Paris, and Mr. Louboutin will send you home with an original sketch.\n\nDrive off like a secret agent for $700,007\n\nDrive off in an electric blue Aston Martin custom-designed by James Bond himself, actor Daniel Craig. There are only seven of the cars available, each complete with a twin-turbo 5.2-liter v12 engine. Lucky drivers will also get an all-platinum Seamaster Diver 300M Omega watch, and tickets to the world premiere of “No Time to Die,” the 25th installment of the James Bond series.\n\nEat Michelin quality Italian for $200,000\n\nChef Massimo Bottura, owner of the three-Michelin star restaurant Osteria Francescana, will give lucky eaters a taste of Italy. Bottura, whose restaurant was named the best in the world twice in 2016 and 2018, will teach a cooking class followed by dinner at his restaurant in Modena, Italy. The food fun doesn’t stop there – lucky spenders will get a guided tour of the local markets while zipping through the Emilia Romagna region in exotic cars.\n\nChampagne vending machine for $35,000\n\nPop bottles from the comfort of your living room. Champagne house Moet & Chandon, owned by LVMH, will transport a champagne vending machine fully loaded with 360 mini bottles of champagne that can be dispensed with just the push of a button.\n\nMakeup like Kim Kardashian for $400,000\n\nGet your makeup done by selfie queen Kim Kardashian’s makeup artist Mario Dedivanovic. Beauty gurus will get a personalized makeup session with Dedivanovic (who is fully booked a year in advance) and then get featured on his personal Instagram page. Glam buffs will also walk away with special makeup products.\n\nJet set to Tokyo with sneaker icon Jeff Staple for $110,000\n\nDesigner Jeff Staple will host a meet and greet in Tokyo for sneaker fans. Guests will enjoy a private dinner with Staple at his favorite restaurant, Narisawa, and stay at the luxury Aman Tokyo, a stone’s throw away from some of the city’s best shopping.\n\nVersace punching bag for $1,550\n\nTake your aggression out in style. Italian designer Donatella Versace designed a limited edition series of boxing accessories, including $3,275 gloves and a black and gold pro-style bag users can hang for décor or use to let off some steam.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "Neiman Marcus' annual Christmas Book has luxury fantasy items for under $1 million.", "authors": ["Jeanette Settembre"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/rachel-smaller.jpg?ve=1&tl=1", "published_at": "2019-10-17"}