{"pub": "zdnet", "url": "https://www.zdnet.com/article/best-raspberry-pi-alternatives-september-2019-edition", "downloaded_at": "2019-09-03 23:48:02.048325+00:00", "title": "Best Raspberry Pi alternatives (September 2019 edition)", "language": "en", "published_at": "2019-09-03", "text": "Single board computers are amazing for a variety of applications where a full-blown PC just wouldn't work, from basic homebrew builds all the way to advanced applications such as automation, and even AI and ML. Here is a selection with prices ranging from around $10 to over $250.\n\nMust read: The 2019 iPhone 11 will be annoying, boring, and expensive\n\n#1: Nvidia Jetson Nano Developer Kit\n\nThe Nvidia Jetson Nano Developer Kit is a single-board computer that allows you to work with multiple neural networks in parallel for applications like image classification, object detection, segmentation, and speech processing.\n\nIt also comes with support for many popular AI frameworks, like TensorFlow, PyTorch, Caffe, and MXNet.\n\nThere's also a full desktop Linux environment to make it even easier to work with.\n\nPriced at $99, this one is the perfect choice for those looking to leverage AI but without needing a full-blown PC.\n\n#2: NanoPi Neo\n\nA cheap, $10 quad-core powered board that's ideally suited for hobbyists, and coming in with a decent spec.\n\nAllwinner H3 quad-core ARM Cortex-A7 up to 1.2GHz\n\n256MB/512MB of RAM\n\n10/100 Ethernet\n\nUSB 2.0\n\n#3: Raspberry Pi Compute Module 3+\n\nThis is the latest update of the Raspberry Pi boards aimed at industrial applications and businesses. You can think of this as a Raspberry Pi 3B+ (it features the same Broadcom BCM2837B0 CPU) but without the USB and HDMI ports.\n\nIt also features eMMC flash, which replaces the less reliable SD cards, and comes with support for two cameras, two displays, and extra GPIO pins.\n\n#4: UDOO X86 II ULTRA\n\nThe UDOO x86 II ULTRA is something special -- it is a powerful x86 maker board and an Arduino 101-compatible platform, combined onto the same board. This combination results in a board that's ten times more powerful than a Raspberry Pi 3. But at $270, this is not a cheap \"disposable\" board (unless your project has deep pockets!).\n\nIntel Quad Core up to 2.00 GHz\n\n2 GB of RAM\n\n1 x HDMI\n\n2 x miniDP++\n\neMMC 8 GB\n\n#5: NanoPi Neo4\n\nIf you are looking for a cheap six-core single board computer, look no further than the Nano Pi Neo4, which at $50 is hard to beat. The only downside to this board is that there's only 1GB of RAM, which may introduce a bottleneck for some applications.\n\nRK3399 SoC featuring ARM-based dual-core A72 and quad-core A53 processors\n\nMali T-864 GPU\n\n1GB DDR3-1866 RAM\n\nUSB 3.0\n\nBuilt-in Wi-Fi and Gigabit Ethernet\n\nPCIe x2 interface\n\n#6: LattePanda Alpha 800\n\nThe LattePanda Alpha 800 is a beast of a board both in terms of price ($379) and performance. This board is powered by 7th-generation Intel Core m3 processor (as found in MacBooks and other laptops), 8GB of LPDDR3 RAM, optional 32GB/64GB of EMMC 5.0 storage, and Intel HD 615 graphics.\n\nWith all this hardware, it's no surprise that this board can run Windows 10 Pro comfortably.\n\n7th-gen Intel Core m3-7y30 CPU\n\nIntel HD Graphics 615\n\n8GB LPDDR3 1866MHz Dual-Channel RAM\n\n64GB eMMC\n\n3x USB 3.0 Type-A\n\n1x USB-C port supporting Power Delivery\n\nDual M.2 ports\n\nSee also:", "description": "Here is a selection of single board computers with prices ranging from around $10 to over $250.", "authors": ["Adrian Kingsley-Hughes"], "top_image": "https://zdnet2.cbsistatic.com/hub/i/r/2018/12/01/919dc21d-3879-4d55-89d9-6c2a39f9fd52/thumbnail/770x578/03ad3f9354feea31fc0e9824af21daac/2018-11-0516-55-26-2.jpg"}