{"pub": "theverge", "url": "https://theverge.com/2019/7/3/20681048/moment-pro-camera-ios-long-exposure-motion-blur-light-trails", "downloaded_at": "2019-10-05 13:24:38.546534+00:00", "title": "Moment Pro Camera gets support for long-exposure photography on iOS", "language": "en", "text": "Moment Pro Camera, the camera app originally designed for Moment’s range of aftermarket smartphone lenses, is getting support for long-exposure photography on iOS. The feature is technically blending together a number of shorter exposures rather than creating a long single exposure like a traditional camera would, but it can be used to create a couple of different photo effects, such as light trails or motion blur. It supports exposures of predetermined lengths, or you can manually start and stop your exposure.\n\nIt’s a pretty simple implementation, but the functionality can create some neat results. I particularly liked the light trail effect, which worked well, despite the fact that I was using it in a bright room. The downside is that you really need to use a tripod if you want any parts of your image to remain sharp. No matter how hard I tried, I couldn’t hold my hand steady enough to keep the background in focus.\n\nOnce you’ve shot the image, it will save as a Live Photo to your iOS camera roll by default, but there are also options to export each image as a static JPG or as a MOV video file. You can check out how the new mode works in Moment’s video below.\n\nMoment isn’t the only company to experiment with long-exposure photography in a camera app. Earlier this year, the team behind Halide released Spectre, an app that attempted to use AI to optimize your images. Its AI was meant to stabilize your images, so you wouldn’t get motion blur as a result of the long exposure. It was an ambitious idea, but at launch, it was a little more hit and miss in practice. The best way to get a clear shot was still to use an old-fashioned tripod.\n\nMoment Pro Camera has come a long way since its days as a simple companion app for the company’s smartphone camera lenses. Nowadays, the app is a pretty capable third-party camera app in its own right, with support for features like setting separate focus and exposure points and manually tweaking ISO, shutter speed, and white balance.\n\nMoment’s new long-exposure mode is releasing today on iOS where the app currently costs $5.99. The feature isn’t ready for the Android version of the app, but Moment tells me it’s looking into adding the feature at a later date.", "description": "Moment Pro Camera is getting support for long-exposure photography on iOS. The feature can be used to create a couple of different photo effects, such as light trails or motion blur.", "authors": ["Jon Porter", "Jul"], "top_image": "https://cdn.vox-cdn.com/thumbor/5XSU-i4-ythgW2R0Y3CORfVVDMs=/0x62:2209x1219/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18279073/moment_app_iOS_5.jpg", "published_at": "2019-07-03"}