{"pub": "news24", "url": "https://businessinsider.co.za/photos-abandoned-luxury-hotel-japan-2018-11", "downloaded_at": "2019-10-19 11:27:52.333890+00:00", "title": "There's an abandoned luxury hotel on a remote island in Japan and the eerie photos will give you goosebumps", "language": "en", "text": "Hachijo Royal Hotel was once one of the biggest hotels in Japan, drawing people to its remote island for beach vacations and relaxation. Today it lies in ruins. The abandoned hotel has not seen guests in over a decade, becoming overrun with moss and mildew.\n\nPolish photographer Natalia Sobanska travelled to the French baroque-style hotel to capture the dilapidated building. Her photos are a glimpse into the hotel rooms that once welcomed guests from all over Japan, but now has fallen to pieces.\n\nKeep scrolling to take a look at what has become of the Hachijo Royal Hotel.\n\nSince it was difficult for locals to get a passport in the '60s, they travelled locally. Stunning Hachijojima Island, just a short ferry ride from the mainland, seemed like the perfect spot for a luxury resort.\n\nSource: The Mirror\n\nThe Hachijo Royal Hotel was built in 1963 and quickly flourished, becoming one of the largest in Japan.\n\nSource: Ridgeline Images\n\nOnce overseas travel became more commonplace around the turn of the century, the remote island wasn't seen as a desirable vacation destination any longer.\n\nSource: Ridgeline Images\n\nThe hotel officially closed in 2006, leaving behind everything to crumble in the heat.\n\nA lot of the décor still remains in the exact location it was left over a decade ago.\n\nLikewise, some parts of the hotel are almost fully intact, alluding to its once lively past.\n\nThe pool table still stands in the game room.\n\nThe grand piano that used to entertain thousands of guests now remains untouched in the rotting hotel.\n\nThe swimming pool is now filled with murky water.\n\nWhile Sobanska has travelled all over the world to photograph abandoned places, she says the Hachijo Royal Hotel stands out for its unique style.\n\nFor example, ornate statues that pay homage to the Greeks are common throughout the hotel.\n\nShe spent seven hours in the ruins photographing the \"classic Japan style destroyed by nature.\"\n\nNot surprisingly, Sobanska says the resort is eerily quiet.\n\nBut \"not creepy or scary as people think.\"\n\nThe rooms themselves did not age as well as the common spaces.\n\nThe crumbled ceilings now lay scattered over the decaying floor.\n\nA mixture of hot air and saltwater has helped make these ruins a jungle.\n\n\"In abandoned places, I am captivated by how nature takes back what it owns,\" Sobanska said.\n\nShe continued, \"It sounds absurd, but when you see it with your own eyes, it's just a natural beauty.\"\n\nJust a peek at the view out the windows helps you understand the natural beauty and how people were drawn to this scenic escape.\n\n\n\n\n\nReceive a single WhatsApp every morning with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "The Hachijo Royal Hotel was once a popular tourist destination, but now it lies in ruins. One photographer captured its eeriness in stunning photos.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8205/1b16d4d86f5a4fa6ac8d902a21265450.jpg", "published_at": "2018-11-19"}