{"pub": "indiatimes", "url": "https://indiatimes.com/entertainment/18-years-of-rehna-hai-tere-dil-mein-r-madhavan-dia-mirza-s-twitter-chat-is-making-us-fall-in-love-with-maddy-again-378183.html", "downloaded_at": "2019-10-20 08:22:59.130883+00:00", "title": "Rehna Hai Tere Dil Mein:18 Years Of Rehna Hai Tere Dil Mein: R Madhavan & Dia Mirza’s Twitter Chat Is Making Us Fall In Love With Maddy Again", "language": "en", "text": "18 Years Of Rehna Hai Tere Dil Mein: R Madhavan & Dia Mirza’s Twitter Chat Is Making Us Fall In Love With Maddy Again\n\n18 Years Of Rehna Hai Tere Dil Mein: R Madhavan & Dia Mirza’s Twitter Chat Is Making Us Fall In Love With Maddy Again\n\n“Ek ladki dekhi bilkul bijli ki tarah... one flash... ek chamak aur main apna dil kho baitha... mujhe lagta hai mujhe us ladki se behadd pyar ho gaya hai... bas ab ek hi tamanna hai... rehna hai uske dil mein”\n\nIt was 18 years ago that Bollywood gave us an epic romantic movie that captivated all of us instantly. Chocolaty boy R Madhavan alias Maddy became the man of dreams for many, and he still continues to rule our hearts, doesn’t he?\n\nBeauty queen Dia Mirza’s innocence was is still etched in our hearts. And who can forget the ever-charming role that Saif Ali Khan portrayed. Years may have gone by, but Rehna Hai Tere Dil Mein is still one of our favourite films.\n\nDon't Miss 40.5 K SHARES 6.1 K SHARES 3.1 K SHARES 3 K SHARES 1.4 K SHARES\n\nTo celebrate the 18th anniversary of the movie, Dia Mirza took to Twitter to share a GIF from the movie. She asked fans about their favourite scene in the movie.\n\nWhile fans got nostalgic reminiscing their favourite scene from the movie, R Madhavan also commented on her post. “It seems to me like yesterday... especially since you look the same my lady @deespeak …\" he wrote.\n\nIt seems to me like yesterday... especially since you look the same my lady @deespeak ... https://t.co/1lU2tJ3NnI — Ranganathan Madhavan (@ActorMadhavan) October 19, 2019\n\nDia Mirza thinks that Rehna Hai Tere Dil Mein was way ahead of its time. Recalling her journey, she told IANS, “Firsts are always special but 'RHTDM' is a film that was ahead of its time, and packaged romance in a beautiful story. Apart from being a memorable start to my acting career, it has given me lifelong relationships and friendships that I cherish every day. Even now, it is difficult to believe it has been 18 years since we shot the film.\n\nMaddy and Reena should be together forever, right?\n\nFun Fact: Did you know RHTDM was a remake of Tamil film Minnale?", "description": "To celebrate the 18th anniversary of Rehna Hai Tere Dil Mein, Dia Mirza took to Twitter to share a GIF from the movie. She asked fans about their favourite scene in the movie. While fans got nostalgic reminiscing their favourite scene from the movie, R Madhavan also commented on her post. “It seems to me like yesterday... especially since you look the same my lady @deespeak …", "authors": ["Garima Satija"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/rehna_hai_tere_dil_mein_r_madhavan__dia_mirzas_adorable_chat_is_making_us_fall_in_love_with_maddy_1571553493_800x420.jpg", "published_at": "2019-10-20"}