{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7577327/Aidy-Boothroyd-hoping-Callum-Hudson-Odoi-spend-little-time-England-21s.html", "downloaded_at": "2019-10-15 23:54:04.745016+00:00", "title": "Aidy Boothroyd hoping Callum Hudson-Odoi can spend a little more time with England Under-21s", "language": "en", "text": "England Under-21s manager Aidy Boothroyd hopes that he gets to see more of Callum Hudson-Odoi, even if it might be wishful thinking.\n\nThe Chelsea youngster was the star of the show as he scored two first-half goals in the 5-1 European Championship qualifying win over Austria at MK Dons where Arsenal's Eddie Nketiah scored a hat-trick.\n\nHudson-Odoi was making his first competitive start for the Young Lions and it will surely be his last as it was clear he was a step above this level and seems certain to be back with the senior squad for next month's Euro 2020 qualifiers.\n\nCallum Hudson-Odoi showed he was a class above the rest upon his England U21 return\n\nHe scored two goals during a 5-1 thrashing of Austria in a U21 qualifying clash for England\n\nBoothroyd said himself at the start of the international break that his inclusion in the under-21s squad was part of his rehab from his Achilles injury, but he hopes to get his hands on him again in the future.\n\n'I hope not,' the boss replied when asked if he thought that would be the last time he would be involved with the Young Lions.\n\n'He's been brilliant for us, if a player was a senior and then came back down to us they could be moody but he has been first class, on and off the pitch.\n\nThe Chelsea starlet now looks set to be propelled straight back into the senior England squad\n\n'If anything in both games he was almost trying too hard, things don't come off but what he did tonight was exceptional.'\n\nHudson-Odoi opened the scoring with a sizzling 12-yard volley and then completed a riotous first-half performance with a brilliant goal, finding the top corner after running the length of the pitch.\n\nIn between that Leeds loanee Nketiah scored twice as the Young Lions went into the break 4-0 up.\n\nNketiah grabbed the matchball late on in the second half and could have scored four but missed a penalty.\n\nThe 20-year-old is yet to start for Leeds in the Championship, even though he has scored 10 goals in 13 games for club and country this season, but Boothroyd thinks he is doing just fine.\n\nAidy Boothroyd praised the way Hudson-Odoi conducted himself after making a step down\n\n'He gets his minutes with us and I'm sure he'll do well at his club team,' he said.\n\n'He is in a brilliant place, learning off a great coach and I know because he has said he is enjoying being there at such a big club and when he comes to us he is ready and fresh hopefully we can send him back as a better player.'\n\nThe win makes it three wins from three in their bid to make the 2021 tournament, sending them above Austria to the top of Group 3.\n\nBoothroyd said: 'It was a terrific performance. The result was great because we needed it, if we hadn't got anything it would have meant a big gap for us to close [to Austria].\n\n'We played terrific stuff against a really good team.'", "description": "England Under-21s manager Aidy Boothroyd hopes that he gets to see more of Callum Hudson-Odoi, even if it might be wishful thinking.", "authors": ["Jonathan Veal", "Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/22/19761122-0-image-a-22_1571176297637.jpg", "published_at": "2019-10-15"}