{"pub": "businessinsider", "url": "https://businessinsider.com/youtube-diver-nuggetnoggin-finds-undamaged-iphone-in-river-2019-9", "downloaded_at": "2019-09-26 21:11:03.138792+00:00", "title": "A woman lost her iPhone that had texts from her late father, and a YouTube star pulled it out of a river 15 months later in perfect condition", "language": "en", "text": "A YouTube star who films his diving escapades pulled an iPhone out of a river that had been dropped 15 months earlier — and it was in working condition.\n\nThe phone's owner, Erica Bennett, told local media outlets she'd been devastated about the loss of the phone. It contained texts from her late father she assumed she would never read again.\n\nMichael Bennett, who goes by the username \"nuggetnoggin,\" filmed himself opening the phone's waterproof case, pulling it out perfectly intact, charging it, and tracking down the owner.\n\nVisit Insider's homepage for more stories.\n\nErica Bennett was devastated in June 2018 when she dropped her iPhone in a river. The device had contained text messages from her late father that she assumed she would never read again.\n\nThe South Carolina woman said the last text she received from him was on Father's Day.\n\n\"It was kind of emotional because the last thing I have from him is saying, 'Hey I'm playing phone tag with you, so I just figured I just text you, how are you feeling?' And I think he had called me after that,\" Bennett told ABC30 News.\n\nDuring a family trip down the Edisto River just days after that last text, Bennett said her phone somehow fell overboard while she gathered her belongings.\n\nMore than 15 months later, a YouTube star known for his diving escapades fished it out of the river — perfectly intact and protected by a waterproof case.\n\nThe diver filmed himself pulling the phone out of the water and surprising Bennett with a phone call\n\nMichael Bennett, who goes by the username \"nuggetnoggin\" and is not related to Erica Bennett, uploaded a YouTube video on Wednesday showing how he fished it out of the river, turned it back on, and called Erica.\n\nHe has nearly 750,000 subscribers and often finds personal belongings during his dives, like money and jewelry.\n\n\"Oh man, I think it's going to be dry,\" Michael said in the video with glee, as he cracked open the case's seal. \"I don't feel any water in there.\"\n\nRead more: How to tell if your iPhone is waterproof or water-resistant, and to what extent\n\nHe eventually unsealed what appeared to be an immaculate, unscathed iPhone, and held it up to the camera.\n\n\"This thing looks brand new,\" he said.\n\nMichael filmed himself charging it and trying to figure out who its owner was, eventually managing to get Erica on the phone.\n\n\"Did you ever think you were going to get your phone back?\" Michael asked.\n\n\"Really never, never, never,\" Erica replied.", "description": "A YouTube star known for his diving escapades fished a woman's long-lost iPhone out of the river — intact and protected by a waterproof case.", "authors": ["Michelle Mark"], "top_image": "https://image.businessinsider.com/5d8d171221214c0810733ba5?width=1200&format=jpeg", "published_at": "2019-09-26"}