{"pub": "nationalreview", "url": "https://nationalreview.com/news/kurt-volker-former-envoy-warned-rudy-giuliani-that-biden-info-was-not-credible-report", "downloaded_at": "2019-10-05 06:21:22.340657+00:00", "title": "Former Envoy Kurt Volker Warned Giuliani That Biden Info Wasn't Credible: Report", "language": "en", "text": "Kurt Volker, then-U.S. Special Representative for Ukraine Negotiations, during an interview with Reuters in Kiev in 2017 (Valentyn Ogirenko/Reuters)\n\nFormer U.S. special envoy to Ukraine Kurt Volker told lawmakers in a closed-door session Thursday that he had warned President Trump’s personal attorney, Rudy Giuliani, that his information regarding corruption allegations against Joe and Hunter Biden wasn’t credible, according to two sources cited by the Washington Post.\n\nThe sources, who were present at the meeting but asked to remain anonymous, said that Volker told Giuliani that the latter’s contacts in the Ukrainian government couldn’t be trusted to provide accurate information on the Bidens. One of those contacts was Ukraine’s former top prosecutor, Victor Shokin, who was himself accused of corruption and removed from office after Joe Biden, acting at the behest of the Obama administration and America’s European allies, pressured Ukraine to do so.\n\nVolker also said during the meeting that he advised Ukrainian officials to steer clear of U.S. politics to avoid the impression they were interfering in U.S. elections, according to the Post.\n\nVolker was questioned for several hours by the House committees conducting an impeachment inquiry into President Trump. Republican representatives Jim Jordan and Michael Turner, both of Ohio, attended the meeting and said afterward that Voker’s testimony would not support the impeachment inquiry.\n\nThe former envoy resigned last week after he was named in a whistleblower complaint against Trump as the individual who arranged a meeting between Giuliani and a top aide to Ukrainian president Volodymyr Zelensky.\n\nHouse Democrats have alleged that Trump used his office to pressure Zelensky into conducting an investigation into the Ukrainian business holdings of Joe Biden’s son, Hunter, possibly withholding military aid from the country to use as leverage.\n\nTrump suggested on Thursday that he might ask Chinese president Xi Jinping to look into other corruption allegations against the Bidens in China, and reiterated his stance that Zelensky should look into the Bidens.", "description": "Former U.S. special envoy to Ukraine Kurt Volker told lawmakers in a closed-door session Thursday that he had warned President Trump's personal attorney, Rudy Giuliani, that his information regarding corruption allegations against Joe and Hunter Biden wasn't credible, according to two sources cited by the Washington Post.", "authors": ["Zachary Evans", "Andrew C. Mccarthy", "Alexandra Desanctis", "Kevin D. Williamson", "Jim Geraghty", "John Yoo", "Kyle Smith", "David French", "Mairead Mcardle", "Read More"], "top_image": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/kurt-volker-kiev.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-03"}