{"pub": "reuters", "url": "https://reuters.com/article/us-britain-economy-retail/uk-retail-sales-fall-eases-stocks-at-record-high-cbi-idUSKBN1X719O", "downloaded_at": "2019-10-28 13:41:24.971051+00:00", "title": "UK retail sales fall eases, stocks at record high: CBI", "language": "en", "text": "FILE PHOTO: Shoppers walk past a temporary store front display in central London August 15, 2013. REUTERS/Toby Melville\n\nLONDON (Reuters) - British retailers reported that their sales fell at the gentlest pace in six months in October but uncertainty about Brexit contributed to the highest stock levels on record, an industry survey showed.\n\nThe Confederation of British Industry said on Monday its monthly index of reported sales rose to -10 from -16 in September. Economists who took part in a Reuters poll had forecast on average a reading of -20.\n\nHowever, the six-month run of falling sales represented the longest such period of decline since the global financial crisis a decade ago, the CBI said.\n\nThe highest level of stocks since 1983, when the CBI began its surveys, also reflected Brexit uncertainty on top of preparations by retailers for the busy Christmas trading period.\n\n“The timing could not be worse,” Rain Newton-Smith, the CBI’s chief economist, said. “The run-up to Christmas is a crucial time of year for the retail sector, and not knowing where we will be on Nov. 1 is adding more strain to an already beleaguered sector.”\n\nEarlier on Monday, the European Union agreed a 3-month flexible delay to Britain’s departure from the bloc which had been scheduled for Oct. 31.\n\nThe CBI survey showed a small positive net balance of +1 among retailers when asked about sales expectations for November, the first positive figure since June.\n\nThe survey was conducted between Sept. 26 and Oct. 17 and 82 firms took part, of which 41 were retailers, 38 were wholesalers and three were motor traders, the CBI said.", "description": "British retailers reported that their sales fell at the gentlest pace in six months in October but uncertainty about Brexit contributed to the highest stock levels on record, an industry survey showed.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191028&t=2&i=1445833772&w=1200&r=LYNXMPEF9R0V3", "published_at": "2019-10-28"}