{"pub": "cnn", "url": "https://cnn.com/2019/09/19/perspectives/fed-rate-cut-recession/index.html", "downloaded_at": "2019-09-19 23:10:11.590235+00:00", "title": "Powell says he expects the economy to remain strong. Don't believe him (Opinion)", "language": "en", "text": "Sven Henrich is founder and lead market strategist at NorthmanTrader. The opinions expressed in this commentary are his own.\n\nFederal Reserve Chairman Jerome Powell is having a Ben Bernanke moment. He is trying to maintain confidence by insisting there is no risk of a recession, yet he's pursuing a policy of rate cuts at the same time.\n\nRecall that, in 2007, former Fed Chair Bernanke was pursuing a similar path. He cut rates in September and told Congress in November that while the US economy was indeed facing some risks, it did not appear headed for a recession. Yet, just a month later, the US economy did just that and fell into the Great Recession\n\nThe current Fed has cut rates twice so far this year. Powell and the Fed have been chasing deteriorating conditions just as Ben Bernanke did in 2007. In doing so, Powell appears to be fighting to avert the inevitable: The US economy is eventually headed for a recession.\n\nEconomic growth is slowing\n\nReal GDP growth has been slowing markedly in 2019 versus 2018. Q2 GDP came in at 2% this year versus 3.5% in Q2 2018. And, according to the New York Fed's Nowcast model , Q3 is currently projected at 1.5% versus 2.9% in Q3 2018 and Q4 is expected to be even lower at 1.1%. While these projections will likely change, the trend shows slowing growth versus last year -- a trend similar to what the Fed was facing in 2007.\n\nThe job market is slowing\n\nIn 2019, average monthly jobs growth has slowed to 158,000 jobs added versus 223,000 in 2018. While the unemployment rate remains at a low of 3.7%, slowing jobs growth signals that economic expansion is ending. Given continued trade war uncertainty, and slowing global economic growth, global employers have been slowing the pace of hiring and reducing weekly work hours. After jobs growth peaked in 2006, 2007 saw similar slowing in global employment\n\nYield curve inversions\n\nWhile Powell insists he's not expecting a recession, the Fed's own yield curve inversion model is sending a different message. The inversion of the 10-year bond rate versus the 3-month Treasury bill has preceded each of the last 7 recessions . The recent reversal in bonds have sent yield curves on a steeper path, a sign of increased recession risk. Yield curves were inverted for several months in 2007, then reverted and began to steepen in the fall before the recession hit.\n\nFalling consumer confidence\n\nto spend confidently is a must for the economy in order to prevent it from falling into a recession. For now consumers are still spending, but cracks are appearing. US consumer confidence, while still high, has fallen from summer highs. As manufacturing has slowed dramatically, getting consumers to continueto spend confidently is a must for the economy in order to prevent it from falling into a recession. For now consumers are still spending, but cracks are appearing.\n\nConsumers that are concerned about a coming recession may end up reducing their spending in anticipation. Another concern on that front: Consumers are increasingly relying on credit cards to finance their spending, adding more than $20 billion in credit card debt in the second quarter alone. While overall interest rates are low, credit card interest rates have soared to 15.3% -- the highest in almost 20 years -- and with over $1 trillion in credit card balances, rising interest payments are hitting consumers' disposable pocketbooks which begs the question: How strong and confident is the consumer really? Lose the consumer, lose the economy.\n\nThe Fed, under Bernanke, dealt with similar conditions in 2007. While consumer confidence reached a near high for the cycle in January of 2007, it started declining by the end of the year and helped precipitate the recession. Any further deterioration in consumer confidence would spell trouble for the economy.\n\nInflation rising?\n\nBy cutting rates, the Fed is letting the economy run hot, and as inflation rises, real disposable income shrinks and consumer spending diminishes. Rising inflation may eventually force the Fed to raise rates again.\n\nJust because Powell says he's not forecasting a recession does not mean a recession isn't coming. While no set of circumstances are alike, he is facing some of the very same macro ingredients that set the US economy on the path toward a recession in 2007: a business cycle funded by debt expansion, slowing economic growth, slowing employment growth, yield curve inversions and weakening consumer confidence.\n\nWith an increasing number of Americans believing recession risk is real into next year, Powell needs to shore up confidence among consumers and the markets. That may be difficult. This week's Fed vote showed great division within the Fed over the most recent rate cut.\n\nThough Powell is facing similar macroeconomic issues to Bernanke, he has a unique problem: he has the least amount of ammunition of any Fed chair in history to combat a downturn. Bernanke could cut rates from 5% to 0% to heat up the economy. Powell can only lower rates by 1.75% before hitting zero. The Fed needs new tools. Powell can't solely rely on Bernanke's rate-cutting playbook. He must forge is own path.", "description": "Federal Reserve Chairman Jerome Powell is having a Ben Bernanke moment. He is trying to maintain confidence by insisting there is no risk of a recession, yet he's pursuing a policy of rate cuts at the same time.", "authors": ["Sven Henrich For Cnn Business Perspectives", "Sven Henrich For"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190918145045-jerome-powell-rate-cut-0918-super-tease.jpg", "published_at": "2019-09-19"}