{"pub": "reuters", "url": "https://reuters.com/article/us-walmart-cigarettes/walmart-to-stop-sales-of-e-cigarettes-in-u-s-stores-company-memo-idUSKBN1W523O", "downloaded_at": "2019-09-20 23:16:35.967190+00:00", "title": "Walmart to stop sales of e-cigarettes in U.S. stores: company memo", "language": "en", "text": "WASHINGTON (Reuters) - Walmart Inc (WMT.N) told staff on Friday it will stop selling e-cigarettes and electronic nicotine delivery products at its U.S. stores, amid a growing crackdown on surging teenage use of such products, reports of vaping-related lung disease and some deaths.\n\nIn an internal memo seen by Reuters, the retailer said growing federal, state and local regulatory complexity and uncertainty were behind its decision.\n\nWalmart’s move comes on the heels of bans on sales of flavored vaping products in New York and Michigan and after the Trump administration announced plans to remove all flavored e-cigarettes from store shelves as officials warned that sweet flavors had drawn millions of children into nicotine addiction.\n\nPresident Donald Trump and other top U.S. officials also expressed concern about the growing use of such products as health officials investigate the matter.\n\nOne possible culprit identified so far is a line of illicit marijuana vape products sold under the brand names “Dank Vapes” and “Chronic Carts.”\n\nThe New York State Department of Health identified “Dank Vapes” and “Chronic Carts” as products containing Vitamin E acetate, a thickening agent in THC oil that has been a focus in its investigation of the illnesses.\n\nLeading makers of nicotine e-cigarettes, including Juul Labs Inc, British American Tobacco Plc (BATS.L) and Imperial Brands Plc (IMB.L), said last week their products did not contain Vitamin E compounds.\n\nLast week Amazon.com Inc (AMZN.O) said it took down vape paraphernalia in line with its policies, although the company did not specify the exact products it removed.\n\nIn May, Walmart raised the minimum age to purchase tobacco products to 21 in all its stores and said it would stop selling fruit-flavored e-cigarettes. The move came after the U.S. Food and Drug Administration called out the company for illegally selling tobacco products to minors.\n\nSlideshow (2 Images)\n\nThe regulator also called out other retailers like Kroger (KR.N), Family Dollar, which is owned by Dollar Tree (DLTR.O), 7-Eleven, Casey’s General Stores and Sunoco (SUN.N), which were among more than half a dozen convenience store and gas station chains cited for illegally selling tobacco products to minors.\n\nThe companies did not immediately respond to a request for comment on whether they plan to follow Walmart’s decision and stop selling the products.\n\nWalmart shares were little changed in late trading, while shares of Altria Group Inc (MO.N) were up nearly 2%.", "description": "Walmart Inc told staff on Friday it will stop selling e-cigarettes and electronic nicotine delivery products at its U.S. stores, amid a growing crackdown on surging teenage use of such products, reports of vaping-related lung disease and some deaths.", "authors": ["Nandita Bose", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190920&t=2&i=1432093845&w=1200&r=LYNXMPEF8J1U8", "published_at": "2019-09-20"}