{"pub": "reuters", "url": "https://in.reuters.com/article/usa-trump/protesters-greet-trump-in-baltimore-after-critical-tweets-idINKCN1VY019", "downloaded_at": "2019-09-13 01:10:47.963014+00:00", "title": "Protesters greet Trump in Baltimore after critical tweets", "language": "en", "text": "U.S. President Donald Trump speaks at the 2019 House Republican Conference Member Retreat dinner in Baltimore, Maryland, U.S., September 12, 2019. REUTERS/Leah Millis\n\nBALTIMORE (Reuters) - Dozens of protesters lined the streets of downtown Baltimore on Thursday as President Donald Trump made his first visit to the city since he blasted it as “disgusting” and “rodent-infested” in hotly debated tweets two months ago.\n\nTrump gave a speech to House of Representatives Republicans gathered for an annual retreat in the predominantly black city, after protesters greeted his motorcade with signs that described Trump as a rat and directed him to return to the swamp.\n\nThe chilly reception came after Trump in July lashed out on Twitter at Elijah Cummings, a prominent African-American congressman from Baltimore, calling him a “brutal bully” who should concentrate on cleaning up his “disgusting, rat and rodent infested” district rather than criticizing the work of U.S. immigration officers on the Mexican border.\n\nCummings, who chairs the House Committee on Oversight and Reform, has led investigations into Trump and his administration, called him a racist and blasted the president’s hard-line immigration policies.\n\nCummings responded to Trump’s tweets by inviting him to tour the city and observe hardworking residents.\n\nBaltimore, a city of about 625,000 people known for its scenic harbour and high crime rates, is located roughly 40 miles (65 kilometres) north of Washington, D.C.\n\nHouse Republican minority leader Kevin McCarthy and Minority Whip Steve Scalise spoke on Thursday ahead of Trump’s remarks, which competed for air time with a Democratic presidential debate in Houston ahead of elections next year.\n\nTrump is running on a strong economy, helped by steep tax cuts passed in 2017, a hardline stance on immigration and an aggressive approach to China, as well as divisive rhetoric that appeals to some supporters.\n\nAs Trump’s motorcade rolled into Baltimore one sign read, “Dump Trump, Ditch Mitch,” referring to Senate Majority Leader Mitch McConnell. At least one sign favouring Trump in 2020 could be seen.", "description": "Dozens of protesters lined the streets of downtown Baltimore on Thursday as President Donald Trump made his first visit to the city since he blasted it as \"disgusting\" and \"rodent-infested\" in hotly debated tweets two months ago.", "authors": ["Alexandra Alper", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190913&t=2&i=1429252831&w=1200&r=LYNXNPEF8C01X", "published_at": "2019-09-13"}