{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/advice/carolyn-hax-be-open-and-supportive-with-friend-whose-child-is-involved-in-scandal/2019/10/24/8bfff244-f507-11e9-ad8b-85e2aa00b5ce_story.html", "downloaded_at": "2019-10-25 16:09:33.956305+00:00", "title": "Carolyn Hax: Be open and supportive with friend whose child is involved in scandal", "language": "en", "text": "Advice columnist\n\nHi, Carolyn: Recently a friend's child posted a photo of themselves with an ethnic slur on social media. The photo went viral and I suspect there is significant fallout. I don't have a child at her child's school and know the mom through a different avenue.\n\nMom is a lovely person who seemed not to see her child was often churlish and badly behaved. Fortunately, I was able to avoid spending time with the child and focus on my friend.\n\nDo I reach out to offer support? I am certain she is devastated by this. However, I don't want to make it worse by checking in, as it will confirm the scandal has gone outside the school community. I also don't want to call a mutual friend and seem like I am gossiping or trying to get more details. Ugh!\n\n— Concerned Friend\n\nConcerned Friend: Check in on your friend directly. Don’t pretend you don’t know.\n\nAnd don’t assume she didn’t see her child’s shortcomings; brave faces take many forms, including misguided ones. (I’m taking your word she’s “lovely” and not bigoted herself.)\n\nAnd don’t assume social-media stupidity is the sole province of churlish, badly behaved children; each new communication platform is gas on the fire of an adolescent prefrontal cortex.\n\nSomething can always go wrong when you try to help, so it makes sense that you’re cautious — but you don’t make bad things worse for people by caring about them. Supporting others tends to go right if you keep it simple: compassionate intent, an open mind, and enough restraint to let them do most of the talking.\n\nDear Carolyn: We go out to dinner often with my in-laws, and both of them are very rude to the staff. They complain loudly about everything, from where we are seated to the temperature of the food. They send food back at almost every occasion and cause a huge scene. It is very embarrassing.\n\nWe have tried to stop going out with them as much — we used to go weekly — but they ask all the time, and I don't know the best way to handle it.\n\n— J.\n\nJ.: Rudeness is always bad, but it’s a special kind of stupid to mistreat the person in control of your food.\n\nAnyway.\n\nThe best way to handle it is for your spouse to say to your in-laws, in the moment, “I am not comfortable with the way you’re treating the staff.” And tip obscenely.\n\nSecond-best is for your spouse to say, upon the next invitation and with examples of mistreatment handy, “Dining out with you two is stressful for me, given the way you treat the staff. Let’s find other ways to spend time together.”\n\nPresumably said spouse won’t do this? In which case, third-best option, you speak up, with your spouse’s knowledge.\n\nYou can also stay the course without speaking up, or accept their dining invitations even less, or never. There’s an art to picking battles, especially with family.\n\nBut your embarrassment, while a valid complaint, is not the real problem here. It’s that restaurant staffers within your in-laws’ outing radius are getting abused on a regular basis, and their only choices are to take it or risk their livelihoods. That’s what makes your in-laws so awful, and why I hope one of you speaks up.", "description": "The woman’s kid posted a photo with an ethnic slur, and people outside the school are talking.", "authors": ["Carolyn Hax", "Advice Columnist", "October At Pm", "Carolyn Hax Started Her Advice Column In", "After Five Years As A Copy Editor", "News Editor In Style", "None As A Therapist. The Column Includes Cartoons", "Relationship Cartoonist", "Nick Galifianakis", "Carolyn'S Ex-Husband"], "top_image": "https://www.washingtonpost.com/resizer/bsQK6BEPtmVMqwqSbVUH-TDdprA=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MNUNHAXPTYI6TO362IBG5YGBTE.jpg", "published_at": "2019-10-24"}