{"pub": "businessinsider", "url": "https://businessinsider.com/nintendo-ring-fit-adventure-switch-release-date-trailer-wii-fit-2019-9", "downloaded_at": "2019-09-15 00:09:42.150884+00:00", "title": "Nintendo wants to make exercise fun again with this successor to Wii Fit on the Switch", "language": "en", "text": "Earlier this week Nintendo surprised fans with the announcement of \"Ring Fit Adventure,\" a new fitness game for the Nintendo Switch that's set to release on October 18. \"Ring Fit Adventure\" will include two new accessories to help track exercise motions and a story mode to keep players engaged.\n\nNintendo is no stranger to fitness games — the company's wildly popular Wii console was celebrated for its motion controls and found use in physical therapy clinics more than a decade ago. In 2007 Nintendo released \"WiiFit,\" an exercise game that made use of motion controls and a special board to guide players through routines. Earlier this year, the company published \"Fitness Boxing,\" which uses the Nintendo Switch's motion controls for cardio exercise.\n\n\"Ring Fit Adventure\" will go a step further by introducing a new peripheral to the Switch family, the Ring-Con. Using the Switch's wireless Joy-Con, the Ring-Con can accurately track hand movements and the amount of force used during different exercises. \"Ring Fit Adventure\" will also include a leg strap to holster a second Joy-Con and track lower body movement.\n\nThe game will include an adventure mode spanning multiple courses, and players will be able to level up their character to take on increasingly difficult challenges. Players will be able to track their fitness progress with tons of in-game data and the Switch's IR sensor will check their heart rate between each stage.\n\n\"Ring Fit Adventure\" is still a month away, but here's what we know so far:", "description": "\"Ring Fit Adventure\" will use new accessories, motion controls, and a leveling system to encourage people to workout with their Switch.", "authors": ["Kevin Webb"], "top_image": "https://amp.businessinsider.com/images/5d7c13232e22af2aeb0c8df9-1136-568.jpg", "published_at": "2019-09-14"}