{"pub": "euronews", "url": "https://euronews.com/2019/06/20/temperatures-of-35-40-celsius-expected-to-grip-europe-next-week", "downloaded_at": "2019-10-12 01:01:01.453504+00:00", "title": "Europe heatwave: temperatures could pass 44.1C record in France", "language": "en", "text": "France could set a temperature record on Friday as authorities in the south of France raised the heatwave alert level from orange to red.\n\nThe current temperature record was set in 2003 at 44.1 Celcius.\n\nA ferocious heatwave has struck the continent this week.\n\nWildfires have ravaged across nearly 10,000 acres across Catalonia, which are said to be among the worst the region has seen in 20 years.\n\nOn Wednesday, temperatures reached 34.9 Celsius in France to become the hottest June day on record, according to France’s meteorological agency, Météo-France.\n\nIt was even hotter in Germany on Wednesday, which set another June record of 38.6 Celsius. Poland too set a June record of 38.2 Celsius, and the Czech Republic recorded another June high of 38.9 Celsius\n\nHundreds of schools have been closed across France due to the heat and Spain has warned of forest fires.\n\nRead more: Hundreds of schools closed throughout France as temperatures top 40C\n\nWhy has the heatwave gripped Europe this month?\n\nAccording to Jonny Day from the European Centre for Medium-range Weather Forecasts (ECMWF), this is not the first example of such a phenomenon.\n\n\"In terms of the time of year and spatial pattern of warmth, the ongoing event in Europe is quite similar to the 2015 European heatwave, which most severely affected southern and central Europe, and which set the all-time temperature records for Germany and Switzerland\" Day said, adding that we will need to wait until after the peak of this event to really know how severe it has been.\n\nOver this week, Europeans will be sweltering as temperatures reach between 35 and 40 degrees Celsius in most of France and Italy, potentially reaching 40 degrees in northern Spain. Models show temperatures much higher than average in Germany, Poland and the Czech Republic.\n\nA hot air mass rising from North Africa will cause temperatures to soar.\n\nTemperatures already rose on Monday and this will continue through to Friday with the risk of a heatwave for much of the week.\n\nEurope is being swept by strong, hot winds from Africa which are also bringing a high concentration of small particles PM2.5 which stay in the air for a long time as they are so light.\n\nAccording to a study by the American Heart Association, \"exposure to PM(2.5) over a few hours to weeks can trigger cardiovascular disease-related mortality and nonfatal events; longer-term exposure (eg, a few years) increases the risk for cardiovascular mortality to an even greater extent than exposures over a few days and reduces life expectancy within more highly exposed segments of the population by several months to a few year.\"\n\nA heatwave is classified as multiple days with abnormally high temperatures.\n\nIt can be especially risky for older people and children.\n\n\"Even though it will be short-lived, this heatwave could be remarkable for its momentum and intensity,\" Météo France said.\n\nThe new normal?\n\nMeteorologists warned earlier this month that heatwaves could be a trend for summer in Europe this year due to high-pressure systems.\n\nAnca Brookshaw, expert on seasonal prediction at ECMWF Copernicus explained this trend to Euronews:\n\n“The most recent seasonal prediction favours above-average temperatures over much of Europe, for the period July to September as a whole. While the seasonal average is not a perfect indicator of the risk of heatwaves (or of severity of any such events), over Europe there is a direct correlation: seasons which include more heatwaves than usual are likely to record above-average seasonal means.\"\n\nThe areas indicated as most at risk by this forecast are southwest Europe and the extreme eastern part of the continent.\n\nAccording to the European Environment Agency, 2018 was among the three warmest years on record in Europe.\n\nEuronews spoke to Dr Dim Como, an expert on Climate Change and Extreme Weather at Amsterdam University, said that “due to simple warming, due to global warming these type of heat extremes are much more likely. So if you have the circulation that can bring heatwaves then heatwaves will be much more intense.”\n\nWatch and listen to Dr Dim Como by clicking on the player above.\n\nWant more news?", "description": "A number of European countries have broken June temperature records and the worst is yet to come.", "authors": ["Lauren Chadwick"], "top_image": "https://static.euronews.com/articles/stories/03/97/67/50/1000x563_cmsv2_b6eb788b-a6a3-5055-84ff-0821dcf3d680-3976750.jpg", "published_at": "2019-06-20"}