{"pub": "foxnews", "url": "https://foxnews.com/media/fox-nation-steve-doocy-golden-gate-bridge-american-built", "downloaded_at": "2019-09-23 19:19:06.861685+00:00", "title": "How an iconic American landmark nearly looked very different than it does today", "language": "en", "text": "San Francisco's Golden Gate Bridge nearly looked much different than it does today.\n\n\"The Department of War suggested black and yellow stripes so incoming boats could see it,\" narrated Steve Doocy in the new Fox Nation docu-series \"American Built.\"\n\nMIKE HUCKABEE JOKES ABOUT SHARING SPOTLIGHT WITH HIS DAUGHTER, SARAH\n\nIn the end, builders settled on international orange for the color of the paint that covers the bridge today.\n\nIn the premiere episode of the series, Fox and Friends co-host Steve Doocy explores the improbable building of the 1.7-mile long, 90-foot wide and 890,000-ton bridge, which became one of the greatest engineering marvels in world history.\n\n\"This was a once in a lifetime opportunity to create this new structure which would demonstrate ... American industrial capacity\" said Paul Sparrow, Director of the Franklin Delano Roosevelt Presidential Library and Museum.\n\nLAURA INGRAHAM CALLS OUT 'SAVED BY THE BELL' REBOOT\n\nFDR's administration committed federal funding to the construction of the bridge in the midst of the Great Recession. The federal pledge, coupled with a $35 million dollar bond issue made the project a reality.\n\nThe raw steel for the bridge was produced by Pennsylvania's Bethlehem Steel, in five different plants, the largest two of which were located on the east coast, make the logistical obstacles nearly as challenging as the engineering.\n\nOn top of that the actual building of the bridge was dangerous and deadly.\n\n\"On a bad day, it's brutal. The winds in there can gust up to 70-miles an hour... You have these fogs that come in off the ocean, even in the summertime, where you can't see 20 feet in front of you,\" recounted Sparrow.\n\nMen worked hundreds of feet in the air. Safety nets were built to catch workers if they fell, but that was not sufficient to guarantee their safety.\n\n'I HUNG UP AND PHONE AND CRIED' DANA PERINO ON SETBACK THAT LED TO WHITE HOUSE\n\n\"On February 17, 1937, 10 men fell to their death when a piece of scaffolding fell through the safety nets,\" Doocy said.\n\nTowering over the city of San Francisco at 746 feet tall, the Golden Gate Bridge stood as a glimmer of hope coming out of the Great Depression. Today, it stands as a reflection of the American spirit.\n\nTo watch all of American Built: Golden Gate Bridge go to Fox Nation and sign up today.\n\nCLICK HERE TO SIGN UP FOR A FOX NATION FREE TRIAL\n\nFox Nation programs are viewable on-demand and from your mobile device app, but only available only for Fox Nation subscribers. Go to Fox Nation to start a free trial and watch the extensive library from Tomi Lahren, Pete Hegseth, Abby Hornacek, Laura Ingraham, Greg Gutfeld, Judge Andrew Napolitano and many more of your favorite Fox News personalities.", "description": "Few people know that San Francisco's Golden Gate Bridge nearly looked much different than it does today, with its iconic international orange paint.", "authors": ["Matt London"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Golden-Gate-Split.jpg", "published_at": "2019-09-23"}