{"pub": "cbc", "url": "https://cbc.ca/news/business/september-jobs-report-54000-1.5317636", "downloaded_at": "2019-10-11 19:54:09.584616+00:00", "title": "Canada added 54,000 jobs, mostly in full-time work, in September, StatsCan says | CBC News", "language": "en", "text": "The economy added 54,000 jobs in September, bringing the unemployment rate down to 5.5 per cent from 5.7 per cent, according to Statistics Canada.\n\nThe gains were mostly in full-time work, the agency's Labour Force Survey says.\n\nThere are 456,000 more jobs in Canada than a year ago, bringing employment up 2.4 per cent.\n\nThe rate of employment grew in Ontario and Nova Scotia, but held steady in the rest of the country. Growth was evenly split between men and women of core working age between 24 and 54.\n\nEmployment in health care and social assistance accounted for 30,000 of the new jobs. Year over year, employment in this sector has grown by 108,000.\n\nThere were also notable gains in accommodation and food services, which grew by 23,000 jobs last month.\n\n\"Canada posted another strong overall increase in employment in September,\" said Brendon Bernard, economist for job site Indeed Canada, in a written statement. \"Gains were driven by the more volatile self-employment and public sectors, while the number of private sector employees fell-back after a spike in August.\n\n\"The increase was large enough to bump up the working-age employment rate 0.2 percentage points to 74.7 per cent, edging out May as the highest rate on record.\"\n\nBig gains for Ontario, Nova Scotia\n\nMost of the growth was concentrated in Ontario, where there were 41,000 new, mostly full-time jobs last month, bringing the unemployment rate down to 5.3 per cent.\n\nIn Nova Scotia, employment grew by 3,200 jobs, bringing the higher-than-average unemployment rate to 7.2 per cent.\n\nEmployment was little changed in other provinces, but there were improvements in the unemployment rate in Newfoundland and Labrador (down 1.6 percentage points to 11.5 per cent) and Alberta (down 0.6 percentage points to 6.6 per cent).\n\nWages also saw a bump in September. The average hourly rate rose to $28.13 from $27.66, an increase of 1.7 per cent.\n\n\"Wage growth was a bit of a positive surprise in today's numbers. Hourly earnings growth rose at perhaps exaggerated rates earlier in the second quarter, but looked to be easing last month,\" said Bernard. \"However the pace reaccelerated in September to 4.3 per cent from a year earlier.\n\n\"Should other wage metrics follow, it could be a signal that Canadian incomes are ready to show progress in step with the quantity of jobs.\"\n\nReason to 'wait and see' on interest rates?\n\nJames Marple, senior economist for TD Economics, said \"we're running out of superlatives to describe Canadian job market performance.\"\n\nWhile global economic uncertainty stemming from factors like the U.S.-China trade war continues to cloud the outlook, Marple said the Canadian labour market is sending a different signal.\n\n\"Ongoing healthy growth, with a wide dispersion across regions, alongside accelerating wage gains should give pause to expectations for the Bank of Canada to follow its peers in reducing interest rates. If anything, this puts the central bank back in wait-and-see mode.\"\n\nIn August, the labour market report found Canada added 81,100 jobs, most of them part time.\n\nThis is the last report from the national statistician's monthly Labour Force Survey before Canadians head to the polls Oct. 21.", "description": "Canada's economy added 54,000 jobs in September, bringing the unemployment rate down to 5.5 per cent from 5.7 per cent, according to Statistics Canada.", "authors": ["Cbc News", "Brandie Weikle Is A Senior Writer For Cbc News Based In Toronto. She'S A Long-Time Magazine", "Newspaper Editor", "Podcast Host With Specialities In Family Life", "Health", "The Workplace. You Can Reach Her At Brandie.Weikle Cbc.Ca."], "top_image": "https://i.cbc.ca/1.5317685.1570798820!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/canada-economy-employment.jpg", "published_at": "2019-10-11"}