{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/a-year-after-hurricane-florence-coal-ash-is-still-a-huge-concern-for-north-carolina", "downloaded_at": "2019-09-16 05:38:25.536560+00:00", "title": "A Year After Hurricane Florence, Coal Ash Is Still A Huge Concern For North Carolina", "language": "en", "text": "On Sept. 21, 2018, the North Carolina Department of Environmental Quality documented light grey material flowing out of a flooded coal ash dump toward the Cape Fear River at Duke Energy’s L.V. Sutton Power Station near Wilmington, North Carolina. (Photo: AP)\n\nHurricane Florence made landfall in North Carolina a year ago today. And while its winds were only Category 1-force, its record rainfall and floodwaters caused major devastation — especially to coal ash ponds, which can contain toxins like mercury and lead. This toxic sludge can pose a major public health threat if it reaches waterways or nearby communities.\n\nA year later, the state of North Carolina has made strides cleaning up these toxic sites, but advocates argue a lot of work remains.\n\nThe toxic tragedy began well after Hurricane Florence hit the coast. Floodwaters stayed high, and in many places rose more than a week after the hurricane made landfall.\n\nAll that water eventually caused a dam to break at Lake Sutton, which is next to a former coal plant with a coal ash pond operated by Duke Energy. The water breached the pond’s retaining wall and released the mixture into surface water, which flowed into the Cape Fear River. A study by Duke University researchers confirmed that fact — which was previously a source of debate — earlier this year in a peer-reviewed study.\n\nCoal ash was a problem in the state before Hurricane Florence, so the company had already begun the process of cleaning up. Still, the hurricane underscored the dangers of coal ash, Frank Holleman, a senior attorney at the Southern Environmental Law Centre, told Gizmodo. A certain level of urgency followed the fallout of Florence — an urgency that was much needed and much delayed.\n\n“Even when the weather is good, these sites are dangerous.” Holleman said. “But when the weather is bad, there’s an even greater risk.”\n\nDuke Energy has cleaned up the coal ash pond at its Sutton Plant since Florence, as well as another two coal ash basins, company spokesperson Bill Norton told Gizmodo. Eight basins have been excavated in total, amounting to some 20 million tons of coal ash. That includes 5 million tons in the last year alone, he said.\n\n“We’ve made a huge amount of progress,” Norton said.\n\nBut Duke Energy also has a history of coal ash issues. The Dan River spill in 2014 is a prime example, when some 39,000 tons of coal ash leaked out of a pipe near a defunct coal plant, threatening the environment.\n\nThat coal ash spill remains one of the largest the nation’s seen, yet Duke was barely able to recover any of the coal ash. The state had launched four lawsuits against Duke Energy the year before, and the Dan River disaster served as further incentive for the state to begin enforcing environmental protections and shut down these facilities.\n\nBy 2015, Duke Energy announced it’d begin cleaning up some of its 59 coal ash basins, recycling some of it into construction material and sending the rest to landfills. However, the company has been moving slowly. No excavations started until 2015, and none were completed until 2017. It will take another 30 years to completely shut down its operational plants, storing coal ash in nearby landfills instead of ponds in the meantime.\n\nThe process can be so slow because a proper plan must be made with ample time for the public to comment. Environmental reviews take at least a year (and usually more). Once a decision is made on what to do with the coal ash — whether that’s excavating a site entirely or capping a pond in place — the execution of that plan can take at least a few years if it’s done right. But this delayed response turned into a disaster when Hurricane Florence arrived.\n\n“All of these coal ash ponds should be fully excavated, taken away from the banks of our rivers, and put into lined landfills that will no longer poison our communities and our environment.”\n\nSeven months after Florence, the North Carolina Department of Environmental Quality decided it would help Duke Energy skip a step in deciding how to clean up: It ordered the company to excavate all its remaining sites, not cap in place.\n\nExcavation involves removing all water from coal ash ponds, and then transporting the remaining ash to a landfill. The process is costlier than capping a pond in place. When a site is capped in place, the water is removed, but the coal ash stays there, covered with liners and sometimes dirt and plants. It’s buried under a layer of protection that’s supposed to ensure the ash never escapes, but many advocates don’t believe that’s a safe alternative to excavating the ash entirely because there’s always a chance that system fails. The state appears to agree.\n\n“Capping in place is pollution in place and should never be allowed to happen,” Matthew Starr, an organiser with the Upper Neuse Riverkeeper, told Gizmodo. “All of these coal ash ponds should be fully excavated, taken away from the banks of our rivers, and put into lined landfills that will no longer poison our communities and our environment.”\n\nDuke disagrees with advocates and the state. It’s challenging that order in court. The company argues that capping the remaining basins is “a safe method” and that excavating the remaining six sites instead would cost the company an additional $US5 ($7) billion — an added cost it would pass along to its customers.\n\n“Plant retirement costs are, historically, paid for by our customers,” Duke Energy’s Norton wrote in an email to Gizmodo.\n\n“Customers typically pay for the construction of the plant, the operation of the plant, and the retirement of the plant. Additionally, the North Carolina Utilities Commission has determined that costs to comply with environmental requirements established by state and federal regulators are part of the normal operations of an energy company, and those costs are appropriate to include in customer bills. Managing waste and safely closing ash basins are also part of the work of supplying customers with reliable electricity to meet their energy needs.”\n\nWhile the legal battles play out, a large amount of coal ash remains vulnerable to flooding. And that threat only increases in a warmer world where our atmosphere holds more moisture, and unleashes more intense rains. The situation is looking better than it did a year ago, but another Hurricane Florence could cause yet another environmental tragedy.\n\nThe truth is, however, that nearly all coal ash sites around the country are already leaking into groundwater — and that’s without the damage of an extreme storm. That’s why advocates want to see these sites cleaned up. Not just in North Carolina but everywhere.\n\n“Every day that millions of tons of toxic waste sit in unlined pits, more and more hazardous chemicals leak into the groundwater,” Earthjustice senior counsel Lisa Evans, told Gizmodo. “More and more damage occurs every day, so the sooner that the utility can remove the ash and close the site, that’s the action that will stop the damage.”", "description": "Hurricane Florence made landfall in North Carolina a year ago today. And while its winds were only Category 1-force, its record rainfall and floodwaters caused major devastation — especially to coal ash ponds, which can contain toxins like mercury and lead. This toxic sludge can pose a major public health threat if...", "authors": ["Sarah Basford", "Matt Novak"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/orsojpaof4xb4aocqeaw.jpg", "published_at": "2019-09-16"}