{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/former-bishops-teacher-under-medical-care-as-investigation-against-her-continues-20191021", "downloaded_at": "2019-10-21 13:11:42.823924+00:00", "title": "Former Bishops teacher 'under medical care' as investigation against her continues", "language": "en", "text": "A teacher at the centre of a sex scandal at expensive Cape Town private school Bishops is receiving medical care as the investigation into the allegations that she had a sexual relationship with a pupil continues.\n\n\"She needs counselling, and she's under medical care,\" said attorney William Booth, who was appointed by her family to monitor developments in the case.\n\n\"People can be severely affected by this, emotionally,\" Booth said of Fiona Viotti, a former model turned history teacher and sports coach.\n\nREAD | Ex-Bishops teacher also a victim of sexual misconduct incident in 2017 - report\n\nAfter the story broke, Bishops Diocesan College in Rondebosch said Viotti had resigned, but an investigation into allegations of \"serious sexual misconduct\" was launched.\n\nThe school has asked for privacy as the allegations got tongues wagging with various accounts of what happened.\n\nBooth said much of what has been reported is speculation, but would not \"go into the merits\" and clear up what was wrong or right in the reports.\n\nOPINION | Bishops: Looking for excellence in all the wrong places\n\nThe lawyer appointed to represent the pupil's interests made it clear that he would not discuss anything, so his version is limited to an inner circle.\n\n\"I can't comment, sorry,\" he said.\n\nIn the meantime, an intimate solo video purporting to be of Viotti, has returned to a pornographic site after being taken down last week.\n\nBooth expressed concern that people do not understand that they are at risk of being fined up to R300 000, or imprisoned for up to four years, or both, for distributing the content without permission.\n\nHe explained that people were allowed to send intimate pictures of themselves to a partner in private, but distributing without permission was a crime.", "description": "A teacher at the centre of a scandal at expensive Cape Town private school Bishops is receiving medical care as the investigation into the allegations that she had a sexual relationship with a pupil continues.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/2872/0e082f71285340f39a1f4d2a1f61f9c9.jpg", "published_at": "2019-10-21"}