{"pub": "wsj", "url": "https://wsj.com/articles/high-spirits-even-at-529-a-shot-japanese-whisky-is-selling-out-fast-11567698000?mod=rsswn", "downloaded_at": "2019-09-06 12:10:50.426697+00:00", "title": "High Spirits: Even at $529 a Shot, Japanese Whisky Is Selling Out Fast", "language": "en", "text": "Bartenders at New York’s Copper & Oak have identified a new breed of problem drinker: the ones who order $100 shots of Japanese whisky just to crow about it on social media.\n\nFlavien Desoblin, owner of the Lower East Side bar, says he is haunted by customers swilling rare Japanese whiskies “like cowboys, sometimes asking for ice,” and often cuts them off to preserve the scarce supplies for genuine whisky lovers.\n\nJapanese whisky shot to global prominence around a decade ago when it began regularly winning international awards. Japanese distillers like Suntory, which makes the Hibiki and Yamazaki brands, didn’t have enough stock to meet a tsunami of demand, and supplies dried up. High-end whiskies have to mature in barrels for several years before being bottled and sold.\n\nThe upshot has been a scramble to secure—and ration—even some of the more numerous bottles of Japanese whisky.\n\nRaymundo Delgado, lead bartender at Japanese restaurant PABU in San Francisco, describes the quest for each bottle as a journey. PABU is part of a restaurant group that sells over $40 million of alcoholic drinks a year, giving it leverage in negotiations with suppliers. “I still have to sit down for 30 minutes to get one high-end product,” Mr. Delgado says.\n\nA very rare 50-year-old bottle of Suntory’s Yamazaki whisky is displayed in a 2018 auction in Hong Kong. Photo: alex hofford/epa/Shutterstock\n\nTo negotiate for a bottle of Yamazaki, for example, Mr. Delgado has to agree to buy a few cases of another spirit sold by Suntory, which bought U.S. liquor maker Beam Inc. in 2014 and also produces the brands Jim Beam and Maker’s Mark bourbon. He often plans the week’s cocktail list based on the cases of alcohol he purchases to get Japanese whisky.\n\nOften, it’s worth it. Mr. Delgado recently got his hands on a rare 27-year-old bottle of Mars Komagatake, which he sells at $529 for a 2-ounce shot. The sticker shock is little deterrent for some customers. “People get promoted, they get to be partners, they want to celebrate,” he said. “These bottles fly out the window.”\n\nIt wasn’t always hard, or expensive, to get a good bottle of Japanese whisky. Whisky dealer David Wainwright remembers telling a customer in 1990s London that a batch of old Japanese whiskies the customer was trying to off-load had no commercial value after he failed to find a buyer for the lot at around $100 at current exchange rates.\n\nIts value today: over $4,000.\n\nLuxury sales have reached head-spinning levels: A 50-year-old bottle of Yamazaki sold for nearly $430,000 in January at a Taipei auction and a set of 54 Hanyu bottles, each labeled with the design of a different playing card, recently sold for about $917,000 at a Hong Kong auction. Industry insiders say private sales can reach $1 million.\n\nA limited-edition set of Hanyu whisky bottles, each labeled with the design of a different playing card. Photo: Aaron Chan\n\nTo keep bar prices down, some employees shop at duty-free stores, where high-end Japanese whisky can often be found, before entering the U.S., people in the industry say—even though such workarounds could cost a bar its liquor license.\n\nAt Mizunara the Library, a Hong Kong whisky bar, a crisis is fermenting: It is down to two-thirds of a bottle of Yamazaki Mizunara from 2012, which is aged in a cask of the bar’s namesake Mizunara, a rare Japanese wood. The bar’s owner has located a new bottle and is negotiating with the seller over price says general manager Masahiko Endo, but the market for rare whisky is so sensitive that he wouldn’t say where the seller is or the range of prices being discussed.\n\nShare Your Thoughts How much would you be willing to pay for your favorite beverage? Join the conversation below.\n\nA single measure from the bar’s remaining bottle goes for around $460, but for now, staff keep it hidden on the second row of the display to ensure they don’t run out.\n\n“In Japan, it’s almost impossible to find” the best bottles, says Mr. Endo, who is from Fukuoka in western Japan.\n\nJapanese whisky isn’t unique for its scarcity and high prices, but unlike other hot brands such as Pappy Van Winkle, the notoriously hard-to-get bourbon, the widespread absence of Japanese whisky from the market isn’t deliberately manufactured. Rather, Japanese whisky makers didn’t foresee the rapid increase in demand for their products in the early 2010s in time to start producing more.\n\nLast year, Suntory said it would discontinue sales of two of its most popular whiskies because of dwindling supplies, including 17-year-old Hibiki, which appeared in a mock television commercial featuring an aging actor played by Bill Murray in the 2003 movie “Lost in Translation.” Suntory spokeswoman Hasumi Ozawa said the company had raised production of whisky but the long maturation process means it is hard to determine when supplies will be able to meet demand. Suntory has invested over $300 million to boost whisky production since 2013, she said.\n\nSuntory staff occasionally joke they aren’t allowed to drink their own whisky to preserve supplies.\n\nMeantime, price inflation has pushed some drinkers to explore other options. At Butler, another Hong Kong whisky bar, a shot of 12-year-old Yamazaki goes for around $30. Bartender Yuta Inagaki says that’s how much a whole bottle of the spirit—his favorite drink—cost when he left Japan for Hong Kong in 2014. He cites a mention by Beyoncé of Yamazaki whisky in a 2016 song as a symbol of the drink’s transition to a luxury item.\n\nCopper & Oak, a bar in New York with a large selection of Japanese whiskies. Photo: Copper & Oak\n\nCharly Kwok, a 32-year-old nurse who is a regular at Butler, says Japanese whisky is no longer her go-to drink because of the cost. “Now I prefer scotch,” she said.\n\nAt Copper & Oak, the New York City bar with one of the largest selections of Japanese whisky in the U.S., Mr. Desoblin says that despite his deep relations with his suppliers he’s able to buy only a handful of the most sought-after bottles of Japanese whisky each year.\n\nLuckily, he stocked up on the spirit at auctions before prices reached their current highs, so he is able to keep most drinks flowing to sate New Yorkers’ thirst.\n\n“You could be making Japanese whisky out of marinara sauce and it would sell,” Mr. Desoblin said.", "description": "Suntory and other Japanese distillers never expected to become so popular with global trend-setters, so there isn’t enough stock to meet demand; Yamakazi and the Beyoncé effect.", "authors": ["Eli Binder"], "top_image": "https://images.wsj.net/im-104061/social", "published_at": "2019-09-05"}