{"pub": "npr", "url": "https://npr.org/2019/10/29/774400675/australia-accuses-google-of-misleading-consumers-over-location-data", "downloaded_at": "2019-10-30 02:24:47.409928+00:00", "title": "Australia Accuses Google Of Misleading Consumers Over Location Data", "language": "en", "text": "Australia Accuses Google Of Misleading Consumers Over Location Data\n\nEnlarge this image toggle caption Alastair Grant/AP Alastair Grant/AP\n\nThe Australian consumer watchdog accused Google on Tuesday of lying to customers about personal location data the company collects through its Android mobile operating system. The Australian Competition and Consumer Commission is taking the tech giant to court, seeking penalties and the establishment of a compliance program.\n\nCourt documents allege that from January 2017 until late 2018, Google led consumers to incorrectly believe that turning off the setting \"Location History\" would prevent data from being collected.\n\nThe commission said that another setting, \"Web & App Activity,\" also had to be disabled for data collection to be turned off. Officials said that Google was purposefully \"staying silent\" about the secondary setting.\n\nRegulators added that Google failed to tell users what the company used the collected location data for.\n\n\"We consider that because of Google's failure to disclose this use of data, consumers were and still are deprived of the opportunity to make an informed choice about whether to share their personal location data with Google,\" ACCC Chair Rod Sims said in a statement.\n\nThe suit alleges that Google used personal data to infer demographic information and supply advertising services to third parties, among other purposes.\n\nA Google spokesperson said that the company is reviewing the allegations and will cooperate with the ACCC, but it intends to defend itself.\n\nEarlier this year, the ACCC released a report that recommended that legislation pass sweeping consumer protection reforms to address the dominance of digital platforms such as Google and Facebook.\n\n\"Action on consumer law and privacy issues, as well as on competition law and policy, will all be vital in dealing with the problems associated with digital platforms' market power and the accumulation of consumers' data,\" Sims said earlier this year.\n\nThe Australian suit is the latest challenge regarding privacy that Google has faced from government entities. In September, the European Court of Justice ruled that Google must agree to European residents' requests to be \"forgotten\" online.\n\nAnd in France, the data protection authority fined Google 50 million euros (about $55 million) in January, for \"lack of transparency, inadequate information and lack of valid consent regarding the ads personalization.\"\n\nPaolo Zialcita is an intern on NPR's News Desk.", "description": "The Australian Competition and Consumer Commission said that Google purposefully misled Android users into thinking their personal data were not being collected.", "authors": ["Paolo Zialcita"], "top_image": "https://media.npr.org/assets/img/2019/10/29/ap_19302335636974_wide-20b3f20d15ad3c6c2d88cf37be9adcca664fdc98.jpg?s=1400", "published_at": "2019-10-29"}