{"pub": "marketwatch", "url": "https://mansionglobal.com/articles/brooklyn-rents-reach-record-high-as-sales-market-stays-soft-207188", "downloaded_at": "2019-09-12 12:43:36.546538+00:00", "title": "Brooklyn Rents Reach Record High As Sales Market Stays Soft", "language": "en", "text": "Median rents in Brooklyn are at an all-time high, according to an August rental report released Thursday by Douglas Elliman.\n\n\n\nThe median rental price in Brooklyn is up 2.2% year over year to $3,015, compared to $2,950. Rents are up in Manhattan as well, with the median rental price in Manhattan up 2.9% to $3,500 a month, compared to $3,400 in August 2018.\n\n\n\nMore: Bette Midler Lists Manhattan Penthouse for $50 Million\n\nNew York’s soft sales market has fueled rentals, according to Hal Gavzie, executive manager of leasing for Douglas Elliman.\n\n\n\n“We’re still seeing people holding off on buying,” he said. “Many remain on the sales sidelines.”\n\n\n\nMore: Once Asking $120 Million, Stanley Druckenmiller Buys Fifth Avenue Co-op for Steep Discount\n\nMr. Gavzie noted that concessions from landlords—such as free rent for a month or two or waived fees—are slowing. In Manhattan, the share of apartments offering concessions dropped to 31.9% in August, compared to 34.7% for the same month in 2018.\n\n\n\nIt was the seventh decline in the last eight months, according to the report. The size of concessions also slipped to 1.2 months of free rent or equivalent, down from 1.3 months the previous year.\n\n\n\nIn Brooklyn, concessions were part of 38% of the deals in August, compared to 42% last year. But Mr. Gavzie cautioned that concessions could increase in mid-November and continue through the off-season.\n\n\n\nRental price growth in Manhattan was seen across all market segments and sizes of apartments. The median rental price for luxury apartments, defined by Elliman as the top 10% of leases, rose 3.9% year over year to $8,000 a month, compared to $7,700.\n\n\n\nMedian rent for luxury units in Brooklyn rose more than 13% to $6,523, compared to $5,770 in August 2018, according to the report.\n\n\n\nFrom Penta: Watchmaker Richard Mille Had a Big Weekend in the World of Sports\n\nReal estate brokerage Citi Habitats also found rents have risen in its Rental Market Analysis released Thursday.\n\n\n\nIt found the most expensive New York City neighborhood for renters last month was SoHo/Tribeca (by a large margin), which had a median rent of $7,480. In Brooklyn, the highest median rent, $5,650, was in Dumbo.\n\n", "description": "", "authors": ["V.L. Hendrickson"], "top_image": "https://images.mansionglobal.com/im-106283?size=1.5005861664712778&width=1280", "published_at": "2019-09-12"}