{"pub": "nationalreview", "url": "https://nationalreview.com/corner/donald-trump-trade-and-the-border-a-question", "downloaded_at": "2019-10-05 06:19:42.899512+00:00", "title": "Donald Trump, Trade, & the Border: A Question", "language": "en", "text": "President Trump talks to reporters at his Mar-a-Lago estate in Palm Beach, Fla., March 29, 2019. (Joshua Roberts/Reuters)\n\nTrump said Friday: “I’ll just close the border, and with a deficit like we have with Mexico and have had for many years, closing the border will be a profit-making operation.”\n\nHere’s the video:\n\nTRUMP: \"With a deficit like we have with Mexico and have had for many years, closing the border will be a profit-making operation.\" (That is not at all how trade works!) pic.twitter.com/jnuJpQEMfU — Aaron Rupar (@atrupar) March 29, 2019\n\nThis is hardly the first time the president has said this type of thing. He’s often claimed that tariffs are essentially profitable because other countries pay them (they don’t). In September he said “China’s now paying us billions of dollars in tariffs and hopefully we’ll be able to work something out.” And there was this:\n\n….I am a Tariff Man. When people or countries come in to raid the great wealth of our Nation, I want them to pay for the privilege of doing so. It will always be the best way to max out our economic power. We are right now taking in $billions in Tariffs. MAKE AMERICA RICH AGAIN — Donald J. Trump (@realDonaldTrump) December 4, 2018\n\nIf you don’t understand why the president’s statements are wrong, this post isn’t for you. But closing the border would, among other things, throw the supply chains of various American businesses into a tailspin. Also, trade deficits aren’t like budget deficits which reflect spending in excess of revenue. I have a trade deficit with my cigar shop, barber shop, supermarket and liquor store. They get my money and I get goods and services in return. Here are some explainers.\n\nAnyway, what I’m sincerely curious about is what Trump supporters think of stuff like this. Do they think he understands how trade works and just deceives the public in order to sell protectionist policies or tactics? Or do Trump supporters think that he honestly believes that closing the border with Mexico would be profitable and that China and other trading partners pay tariffs instead of American consumers? Does he really think trade deficits are akin to budget deficits?\n\nOn the latter theory, one could, I suppose, make the case that this is brilliant statecraft; by sending the signal that he actually believes these untrue things, he makes his protectionist threats more believable. One hears this sort of thing often. He’s a free trader, but he’s using protectionism to get to a desirable goal. (But as Charlie Cooke often notes, the same people often also defend tariffs as good things in and of themselves. If tariffs are so “profitable,” why pursue free trade at all?).\n\nThis is of a piece with the “chessmaster” school of Trumpology. It seems to me this is a very hard theory to support. You’d have to believe that Trump’s tendency to say whatever comes into his mind is a ruse or a façade and that he in fact has incredible message discipline, refraining from ever once speaking accurately about his true feelings or betraying his real knowledge of how trade actually works.\n\nIt’s a sincere question. Whenever I hear versions of it asked of Trump administration officials, the answers are usually evasive. Such as: “Look, the president hears arguments on all sides of the issue” (I’ve heard one Trump official say this in four different off-the-record settings). Another reply one often hears on TV is “I may not see eye-to-eye with the president on every aspect of trade, but at least I know he’s fighting for American workers and putting America first.”\n\nThat’s all fine as political handwaving or statements of emotional support. But my question remains: Does the president know the facts and is therefore deceiving the public about his beliefs or is he truly ignorant of some of the most basic concepts of one of his signature issues?\n\nOr, is there some way to square this circle I am missing? I am eager to hear it if so (Oh, and a pro-tip for folks on Twitter and even in the comment section, “Shut up you RINO asshat” is not a dispositive answer to the question).", "description": "Does Trump really think trade deficits are akin to budget deficits?", "authors": ["Jonah Goldberg", "Andrew C. Mccarthy", "Alexandra Desanctis", "Kevin D. Williamson", "Jim Geraghty", "John Yoo", "Kyle Smith", "David French", "Mairead Mcardle", "Read More"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/04/RTS2FHR1.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-04-01"}