{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7555215/Leonardo-DiCaprio-keeps-casual-backwards-cap-polo-shirt-jeans-solo-stroll-LA.html", "downloaded_at": "2019-10-09 19:18:39.476962+00:00", "title": "Leonardo DiCaprio keeps it casual in backwards cap with polo shirt and jeans on solo stroll in LA", "language": "en", "text": "He is one of the greatest living actress and is known for dating dozens of the most beautiful women in the world.\n\nBut Leonardo DiCaprio still enjoys 'me time' despite his A-list lothario lifestyle.\n\nThe 44-year-old actor was seen all by his lonesome on a solo outing in Los Angeles on Monday.\n\nSolo stroll: Leonardo DiCaprio was seen all by his lonesome on a solo outing in Los Angeles on Monday\n\nHe kept things casual by wearing a backwards baseball cap and sunglasses with a navy blue polo shirt with all the buttons undone.\n\nLeo also sported a pair of slim indigo-washed jeans with a pair of his Allbirds sneakers in all white.\n\nNot seen on the stroll was Leo's 22-year-old girlfriend Camila Morrone.\n\nChill: The 44-year-old actor kept things casual by wearing a backwards baseball cap and sunglasses with a navy blue polo shirt with all the buttons undone\n\nThe high-profile couple first began their romance in December 2017, and they've been going strong ever since.\n\nThe two were initially introduced by Al Pacino, who had a years-long romance with Camila's mother Lucila Polak.\n\nCamila refers to the Dog Day Afternoon star as her step-father to this day, even though Pacino and her mother never married.\n\nOn the go: Leo also sported a pair of slim indigo-washed jeans with a pair of his Allbirds sneakers in all white\n\nLeo reunited with the actor this summer for Quentin Tarantino's Once Upon A Time In Hollywood, marking the first time they'd appeared on screen together.\n\nIn addition to his repeat work with director Quentin Tarantino, Leonardo has become the go-to actor for Martin Scorsese.\n\nHe led the iconic directors epics Gangs Of New York, The Aviator and The Wolf Of Wall Street, as well as the horror–thriller Shutter Island.\n\nLady love: Not seen on the stroll was Leo's 22-year-old girlfriend Camila Morrone, they are seen here last week in New York\n\nThe two collaborators are currently in pre-production on an upcoming film adaptation of David Grann's non-fiction book Killers Of The Flower Moon, about the investigation into a Native American tribe that was decimated through murder and deception after coming into oil money.\n\nHe's also tentatively set to star in Scorsese's Roosevelt, a biopic about President Theodore Roosevelt.\n\nLeo and the Taxi Driver director will reunite again for a rare foray into television to adapt Erik Larson's The Devil In The White City, about the early American serial killer H. H. Holmes, who terrorized Chicago around the time of the World's Columbian Exhibition in Chicago in 1893.", "description": "The 44-year-old actor was seen all by his lonesome on a solo outing in Los Angeles on Monday.  He kept things casual by wearing a backwards baseball cap and sunglasses.", "authors": ["Justin Enriquez For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/16/19500030-0-image-a-7_1570636647179.jpg", "published_at": "2019-10-09"}