{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/25/coaching-carousel-sabres-krueger-fine-with-being-u", "downloaded_at": "2019-09-25 08:44:42.860110+00:00", "title": "Coaching carousel: Sabres Krueger fine with being unknown", "language": "en", "text": "Ralph Krueger doesn’t care if you have never heard of him.\n\nHaving just turned 60, the Buffalo Sabres’ new coach leans on the benefit of his vast experience - in hockey, soccer, and life as a father, husband, author and motivational speaker - to have stopped worrying a long time ago about how others view him and whether he might have something to prove returning to the NHL following a six-year absence.\n\n“I don’t care about that at all. Not one second, not even a millisecond do I care about my popularity here,” Krueger emphatically told The Associated Press earlier this month.\n\n“I have zero fear in this job because I have nothing to prove to anybody other than I want this team to be successful and give back to the city,” he added. “But it’s not that I’m out to prove to people that I was an out-of-the-box hire.”\n\nThis offseason’s NHL coaching carousel featured seven changes. While it had the Florida Panthers landing the most highly-prized candidate in three-time Stanley Cup champion Joel Quenneville, the Sabres took the most intriguing approach in hiring Krueger to turn things around. The other changes have Dallas Eakins in Anaheim, Dave Tippett in Edmonton, Todd McLellan in Los Angeles, D.J. Smith in Ottawa and Alain Vigneault in Philadelphia.\n\nIn Buffalo, the Sabres essentially split the middle in choosing between hiring a so-called retread versus a first-timer by luring Krueger back to hockey after he spent the past five years running soccer’s Southampton FC of the English Premier League.\n\nFrom Winnipeg, Manitoba, Krueger is not exactly a fresh new face though he is highly respected for the quarter-century spent in hockey on both sides of the Atlantic. He has coached Switzerland’s national team, led Team Europe to a second-place finish at the 2016 World Cup of Hockey, and was as a consultant for Canada’s gold-medal team at the 2014 Winter Games.\n\nHe’s also not exactly a recycled entity either, despite having spent 2012-13 coaching the Edmonton Oilers before being fired - via Skype of all things - following a 19-22-7 finish.\n\nIf Quenneville benefits from having instant recognition when walking into a locker room, Krueger focused on making a good impression on a Sabres lineup featuring a majority of players who weren’t in the NHL when he was in Edmonton.\n\nHe began by reaching out to players by phone or personally, such as visiting with captain Jack Eichel and forward Sam Reinhart in Slovakia, where they competed at the world championships in May. And Krueger then gripped his players’ attention during a pre-camp-opening speech which forward Kyle Okposo said was so impassioned several of his teammates were ready to run through a wall afterward.\n\n“He’s got that presence about him,” Okposo said “I’ve been around a lot of coaches, a lot of people, and I would say he’s an alpha.”\n\nKrueger regarded Okposo’s impression of him as a compliment and believed it referred to the open line of communication he’s established with players.\n\nThough Krueger prides himself for being always upbeat, that doesn’t mean he’ll avoid being critical.\n\n“I’m not a smiley, friendly guy,” he said. “Positive isn’t always friendly. Positive is constructive. Positive is working toward solutions. So if a player gets sent down, there’s an opportunity for him, too. And we’ll be clear on why and what has to be worked on.”\n\nKrueger spent his time away from hockey developing on-ice strategies, some of which he experimented with while coaching Team Europe. He emphasizes simplicity in allowing players to play to their strengths, and speed in always being focused on attacking the opposing zone.\n\nThough he has no regrets leaving hockey, the hiatus gave him time to realize how much he missed the game and dealing directly with players.\n\n“My kids, when they saw me at the World Cup of Hockey said, ‘Dad, that was the happiest period you’ve had in the last five years,’” he said. “They didn’t mean I wasn’t happy, but it was more in my job, the energy, and that stuck with me.”\n\nThe joy to be back behind a bench is reflected in messages he sends to his family in Switzerland.\n\n“The nicest thing I’m telling them is I really feel at home,” Krueger said.\n\nNEW FACES\n\nDallas Eakins, Anaheim.\n\nNHL coaching record: 36-63-14 (Edmonton, 2013-15)\n\nReplaces: Ducks GM Bob Murray, who finished season as interim coach after Randy Carlyle was fired.\n\nWhat they’re saying: “You can already see it and feel it around the room that guys are ready to go, and guys are ready to turn that page,” forward Adam Henrique said of Eakins, who spent past three years coaching the Ducks’ AHL affiliate in San Diego. “It’s a lot of fun coming to the rink. He’s here to work.”\n\n___\n\nRalph Krueger, Buffalo.\n\nNHL coaching record: 19-22-7 (Edmonton, 2012-13)\n\nReplaces: Phil Housley, who was fired after two seasons.\n\nWhat they’re saying: “I think the thing that sticks out is the personality. He’s somebody you want to be around, you want to be a better person around,” captain Jack Eichel said. “He’s very calculated, very smart. He knows what he wants.”\n\n___\n\nTodd McLellan, Los Angeles.\n\nNHL coaching record: 434-282-90 (San Jose, 2008-15, Edmonton, 2015-19)\n\nReplaces: Willie Desjardins, who wasn’t retained after replacing John Stevens early in the season.\n\nWhat they’re saying: “He’s just honest person. He said he don’t care what you did before. He said you just have to show up and show everybody what you can,” said forward Ilya Kovalchuk.\n\n___\n\nJoel Quenneville, Florida.\n\nNHL coaching record: 890-532-137-77 (St. Louis, 1997-2004, Colorado, 2005-2008, Chicago, 2008-2018)\n\nReplaces: Bob Boughner, who was fired after two seasons.\n\nWhat they’re saying: “It’s fantastic for him to coach again. It’s the right situation with his relationship with Dale,” Devils GM Ray Shero said, referring to Panthers GM Dale Tallon, who worked with Quenneville in Chicago. “It’s not cheap to get a guy like that. But you know what, it’s an important market and they want to win.”\n\n____\n\nD.J. Smith, Ottawa.\n\nNHL coaching record: None.\n\nReplaces: Interim coach Marc Crawford, who finished season after Guy Boucher was fired.\n\nWhat they’re saying: “D.J. did a really good job for us,” said Maple Leafs coach Mike Babcock, quoted in The Toronto Sun, referring to his former assistant. “We talked about this when he first interviewed with me five years ago that he would have an opportunity like this. He sent me a really nice text the other day about feeling really prepared and confident.”\n\n____\n\nDave Tippett, Edmonton.\n\nNHL coaching record: 553-413-120-28 (Dallas, 2002-09, Arizona, 2009-17)\n\nReplaces: McLellan, who was fired after four seasons.\n\nWhat they’re saying: “He’s a big structure guys with his systems and I think that’s going to be big for us because I think in the past, when things start going bad for us, we kind of abandon our structure and then things get worse and worse,” forward Ryan Nugent-Hopkins said. “When things start to go wrong, I think Tipp’s going to be able to keep us within that structure.”\n\n___\n\nAlain Vigneault, Philadelphia.\n\nNHL coaching record: 648-435-98-35 (Montreal, 1997-2000, Vancouver, 2006-2013, New York Rangers, 2013-2018)\n\nReplaces: interim coach Scott Gordon, who took over in December after Dave Hakstol was fired.\n\nWhat they’re saying: “It was obviously a huge reason why I decided to go there,” said trade acquisition forward Kevin Hayes, who played for Vigneault in New York. “He was a big contributor to my game changing in the NHL, from being kind of just offensive to a 200-foot player that I believe that I am today.”\n\n___\n\nAP Hockey Writer Stephen Whyno contributed to this story.\n\n___\n\nMore AP NHL: https://apnews.com/NHL and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Ralph Krueger doesn't care if you have never heard of him.", "authors": ["The Washington Times Http", "John Wawrow"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/25/maple_leafs_sabres_hockey_69357_c0-70-1696-1058_s1770x1032.jpg?72b4e4b65827174f380e1056ecc3b10dd18be0e2", "published_at": "2019-09-25"}