{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/trump-questions-whistleblower-account-asks-spy-partisan/story?id=65901671", "downloaded_at": "2019-09-28 01:14:22.334477+00:00", "title": "Trump again questions whistleblower account, asks if it's from 'spy' or 'partisan'", "language": "en", "text": "President Trump on Friday, in a series of tweets aimed at discrediting the Ukraine call whistleblower and Democrats investigating the person's formal complaint, claimed that the whistleblower's account \"proved to be so inaccurate\" a leaker, spy or partisan operative must have fed it to him or her.\n\nInterested in Donald Trump? Add Donald Trump as an interest to stay up to date on the latest Donald Trump news, video, and analysis from ABC News. Add Interest\n\nTrump's comments come a day after he suggested whoever communicated with the whistleblower might be guilty of treason.\n\n“I want to know who’s the person who gave the whistleblower the information because that’s close to a spy,” Trump said at the U.S. Mission to the United Nations on Thursday. “You know what we used to do in the old days when we were smart with spies and treason, right? We used to handle it a little differently than we do now.”\n\nPablo Martinez Monsivais/AP\n\n\"Sounding more and more like the so-called Whistleblower isn’t a Whistleblower at all,\" Trump tweeted Friday. \"In addition, all second hand information that proved to be so inaccurate that there may not have even been somebody else, a leaker or spy, feeding it to him or her? A partisan operative?\"\n\nSounding more and more like the so-called Whistleblower isn’t a Whistleblower at all. In addition, all second hand information that proved to be so inaccurate that there may not have even been somebody else, a leaker or spy, feeding it to him or her? A partisan operative? — Donald J. Trump (@realDonaldTrump) September 27, 2019\n\nNeither the White House nor the president has provided evidence of inaccuracies in the whistleblower complaint, which was deemed “credible” by acting Director of National Intelligence Joseph Maguire and the Intelligence Community Inspector General Michael Atkinson. The whistleblower stated in his or her complaint that information about the phone call between President Trump and Ukraine's President Volodymyr Ukraine was gathered from multiple White House sources, and the complaint appeared to accurately reflect the conversation as documented in a White House reconstruction of it released on Tuesday.\n\nThe president’s attorney Jay Sekulow in Friday also focused on the fact that the whistleblower did not directly hear the call, and alleged the complaint appeared to be written by a law firm, not an individual.\n\n“It was hearsay,” Sekulow said on \"Fox & Friends.\" “Look at the phraseology, the end notes and footnotes. This wasn't drafted by this individual. This was written by a law firm.”\n\nIn his Friday morning tweets, the president also lashed out House Intelligence Committee Chairman Adam Schiff and called on him to \"immediately resign\" after the Democrat gave a dramatic retelling of the July 25 phone call with the president of Ukraine that is now at the heart of a congressional impeachment investigation.\n\nHouse Democratic leaders Reps. Eliot Engel, Adam Schiff, and Elijah Cummings, in a statement slammed Trump's Thursday comments about the whistleblower and the White House officials he cited as “reprehensible witness intimidation.”\n\n“President Trump is fully aware that our Committees are seeking testimony from this whistleblower and others referenced in the whistleblower’s complaint released today as part of the House’s impeachment inquiry, and our nation’s laws prohibit efforts to discourage, intimidate, or otherwise pressure a witness not to provide testimony to Congress,” The statement read. “No officials with knowledge relevant to the Committees’ investigation, including knowledge of the subject of the whistleblower complaint, may be subject to any intimidation, reprisal, or threat of reprisal, and all witnesses must be made available for congressional testimony.”\n\n“The President’s comments today constitute reprehensible witness intimidation and an attempt to obstruct Congress’ impeachment inquiry,” the statement went on to say.\n\nDuring his testimony on Thursday, Maguire stated that whistleblowers must be protected.\n\n“I will not permit the whistleblower to be subject to any retaliation or adverse consequences for going to the IG. I am absolutely committed to that,” Maguire said.\n\nLawmakers, including House Speaker Nancy Pelosi, voiced concerns about comments the president made Thursday.\n\nDuring an interview with CNN Friday morning, she called Trump's comments \"beyond irresponsible.\"\n\n\"It's dangerous,\" she said.", "description": "President Trump on Friday again questioned the whistleblower account , claiming without evidence that it's inaccurate and maybe came from a 'partisan operative.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/trump-5-ap-er-190926_hpMain_16x9_992.jpg", "published_at": "2019-09-27"}