{"pub": "townhall", "url": "https://townhall.com/columnists/humbertofontova/2019/09/21/more-cause-for-the-new-york-times-fury-against-brett-kavanaugh-n2553438", "downloaded_at": "2019-09-21 07:12:28.184591+00:00", "title": "More Cause for The New York Times’ Fury Against Brett Kavanaugh", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\n“Yup, I gotta confess, that now-famous picture of a U.S. marshal in Miami pointing an automatic weapon toward Donato Dalrymple (and 7-year-old Elian Gonzalez)… warmed my heart.” (Thomas Friedman, New York Times, April 25, 2000.)\n\n“You (Brett Kavanaugh) worked on the Elian Gonzalez case pro-bono against the INS returning him to Cuba…” (Sen. Ted Cruz during confirmation hearing, Sept. 6, 2018.)\n\n“Yes, I was asked to get involved and it was a case of importance for people (Elian’s humble Miami relatives) who needed help.” (Judge Brett Kavanaugh confirmation hearing, Sept. 6, 2018.)\n\nMany forget how widespread across the political spectrum—thanks to the non-stop Fake News Media/Clinton parroting of Castroite propaganda--was the public pressure to partner (not with those “deplorable” anti-communist Cuban-Americans, heaven forbid!) --but with Fidel Castro and return Elian to his Stalinist clutches.\n\n“Everywhere in America outside the Greater Miami area, the reaction to Janet Reno's dawn raid was not `Oh, my God, how could she do that?' but `What took her so long?” wrote Mark Steyn (no less!) expressing his own sentiments. “Everyone was sick of Elian's `Miami family.”\n\nSadly, most Americans swallowed Castro’s bait, as did the otherwise brilliant Steyn. Polls at the time showed most Americans siding with Fidel Castro on the issue.\n\nBut Brett Kavanaugh wasn’t having any of it. He was not swayed. His backbone remained straight and stiff. His fortitude prevailed. Unlike “savants” like Mark Steyn and a majority of Americans, Brett Kavanaugh saw right through the Castroite/ Fake News Media/ Democrat scam. Better still, he was so outraged by its vileness that he volunteered to work with and for those (deplorable-before-the-term-was-cool) Cuban-Americans pro bono!\n\nGranted, the scam that took in Mark Steyn and so many others was a skillful and elaborate one, typical of the Castro regime’s propaganda schemes:\n\nLest we forget, on Dec. 1st 1999, shortly after Elian’s rescue at sea, the matter seemed settled. The INS asserted that Miami-based uncle Lazaro was indeed Elian’s legal custodian and Florida’s family court indeed the place to arbitrate further issues. In addition, Elian’s father Juan Miguel thanked his Miami relatives for rescuing Elian and vowed to soon follow him.\n\nThen on Dec. 5th, 1999, Fidel Castro stepped onto the stage, issued a sharp whistle and his Fake News Media lapdogs rushed around him, their eyes wide, their tongues out and their tails wagging frantically.\n\n“Much more valuable than rural recruits for our Cuban guerrilla force were American media recruits to export our propaganda.” -Ernesto “Che” Guevara 1959)\n\nAnd those invaluable American “reporters” (especially from The New York Times) were still as tail-waggingly eager for Castro/Che commands in April 2000 as they’d been in 1957--and as they remain today for his successors.\n\nThe genuine issue during the Elian Gonzalez circus had nothing to do with “parental rights,” as the Castro/Fake News Media/ Democrat propaganda campaign claimed (and many half-wits swallowed.) Instead it was: should a mass-murdering, terror-sponsoring foreign dictator trample on the U.S. Constitution and Bill of Rights with the compliance of a U.S. President.\n\nWell, a Clinton was in the White House. So naturally, despite the best efforts of people like Brett Kavanaugh, the communist dictator whose lifelong dream was to nuke the U.S., whose own “courts” channeled Stalin’s during the Great Terror, and whose sidekick Che Guevara boasted that “judicial procedures are an archaic bourgeois detail” –the whims of this mass-murdering international terrorist and criminal easily prevailed over the U.S. Constitution.\n\nAfter all, even lifelong liberal Democrats like Alan Dershowitz and Harvard‘s Lawrence Tribe gagged at the unconstitutionality of Elian’s kidnapping by the INS (on Fidel Castro’s orders as obeyed by Bill Clinton and transmitted to Eric Holder, Janet Reno and ultimately the INS.)\n\n“They (the Clinton administration) acted lawlessly. They should have gotten a court order. They didn't go for a court order because they knew they couldn't get one. It's a dangerous day for all Americans. (Alan Dershowitz, April 25, 2000.)\n\nIn fact, this key item was frantically hushed by the Fake News Media/Democrat cabal, but: Elian’s father was initially delighted that his motherless son was in the U.S. and in the loving arms of his uncles and cousins.\n\nMauricio Vicent, a reporter for Madrid newspaper El Pais, wrote that a week after Elian’s rescue at sea, he’d visited Elian’s hometown of Cardenas in Cuba and talked with Elian’s father, Juan Miguel, along with other family members and friends. All confirmed that Juan Miguel had always longed for his son Elian to flee to the United States. Shortly after Elian’s rescue, his father had even applied for a U.S. visa!\n\nThen Fidel Castro stepped into the picture. The mass-murderer stuck his fingers in his mouth, issued a sharp whistle of summons and instantly the Media/Democrat complex (including the Clinton team) was all around him, tails wagging and tongues hanging, eager to start taking their usual dictation regarding his every whim and wish….but we’ve exposed the details of that legal and moral atrocity often hereabouts.\n\n“I always said I would turn over Elian to his father,” repeatedly explained Elian’s Miami uncle Lazaro, “if Juan Miguel would come here freely and claim him. But I knew he could never do that. I knew it wasn’t Juan Miguel requesting Elian--it was Fidel.\"\n\nSomehow Brett Kavanaugh’s instincts told him the same thing.", "description": "“Yup, I gotta confess, that now-famous picture of a U.S. .09/21/2019 3:12:33AM EST.", "authors": ["Humberto Fontova", "Matt Vespa", "Cortney O'Brien"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/184/fee76cbd-1122-41b5-a349-87c5a6ec3b13.jpg", "published_at": "2019-09-21"}