{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/othersports/article-7576157/Tour-France-unveil-2020-race-route-key-mountain-time-trial-Nice.html", "downloaded_at": "2019-10-15 16:51:12.193742+00:00", "title": "Tour de France unveil 2020 race route with key mountain time trial in Nice", "language": "en", "text": "Tour de France organisers put a spring in the step of the climbers on Tuesday after unveiling the route for the 2020 race featuring a first mountain stage on the second day and only one time trial on the eve of the final parade on the Champs Elysees.\n\nThe race could be decided on the penultimate stage in the 36km solo effort against the clock ending up the Planche des Belles Filles, home to fans' darling Thibaut Pinot, who was in position to win this year's race with two days to go but had to pull out injured.\n\nPinot will be back on the Tour next year and the super hilly route will favour him as well as defending champion Egan Bernal of Colombia, who will face internal competition within Team Ineos as four-time champion Chris Froome returns after missing this year's event through injury.\n\nThe Tour de France released their animated interpretation of the 2020 race route on Tuesday\n\nA key mountain stage in Nice is set to be definitive as they face a crucial time trial section\n\n'We tried to make it as exciting as possible but it is the riders who make the race,' Tour director Christian Prudhomme told reporters.\n\nPrudhomme took over as Tour boss in 2006 and has tried to spice up the route. This year's race is no exception with mountain stages stretching from start to finish.\n\nThe second stage will take the peloton around Nice with three climbs - Col de la Colmiane, Col de Turini and Col d'Eze - on the menu, giving early opportunities to the overall contenders.\n\nRiders will then complete the final parade in typical fashion along the Champs Elysees\n\nThere will be two mountain-top finishes in the opening six days, a rarity in Tour de France history. That should not suit Dutchman Tom Dumoulin, who fares well in the mountains but makes his mark in time trials.\n\nThe race will stay within French borders and avoid the northern part of the country but will go through all five mountain ranges - Alps, Pyrenees, Vosges, Jura and Massif Central - making the 2020 Tour a rollercoaster that could also favour Julian Alaphilippe.\n\nThe Frenchman spent 14 days in the yellow jersey this year and the undulating nature of the 2020 race, with only four hill-top finishes, will suit his aggressive style.\n\nThe queen stage, however, might prove too much of an effort for Alaphilippe as it will take the riders to 2,304 metres above sea level with a finish in Meribel, at the top of the Col de la Loze, a brutal 21.5-km climb at an average gradient of 7.8 per cent.\n\nThe race starts a week earlier than usual because of the Tokyo Olympics.\n\n'The last stage will also end around 19:15 (local time), instead of 21:15 last year, because some riders will be flying straight to Tokyo afterwards,' added Prudhomme.", "description": "Tour de France organisers put a spring in the step of the climbers after unveiling the 2020 route featuring a mountain stage on the second day and one time trial on the eve of the final \nChamps Elysees parade.", "authors": [], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/17/19749926-0-image-a-61_1571156067462.jpg", "published_at": "2019-10-15"}