{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7609867/Alec-Baldwin-seen-boys-Hilaria-family-make-fun-birthday-video-Ireland.html", "downloaded_at": "2019-10-25 00:08:48.340779+00:00", "title": "Alec Baldwin goes out with sons as family mock Instagram video", "language": "en", "text": "He's a father to a grown-up daughter and four little ones with another on the way.\n\nAnd on Wednesday Alec Baldwin was the dutiful daddy when he was spotted taking his sons Leonardo, two, and Romeo, 10 months, in a stroller near Washington Square Park in Greenwich Village, NYC.\n\nThe new slimline star showed off his bulging pecs as he pushed the stroller wearing a short-sleeved grey T-shirt, dark grey pants and black sneakers.\n\nDoting daddy: Alec Baldwin showed off her bulging biceps and slimmer figure as he took sons Leonardo, two, and Romeo, 10 months, out in a stroller in Greenwich Village, NYC, Wednesday\n\nIt was evidently a bit chilly as he later covered up with a blue zipped jacket.\n\nThe actor, 61, dropped his pants on The Tonight Show Starring Jimmy Fallon on Sunday to show off his new slender physique.\n\nAnd he joked: 'That was just for you, Jimmy. I wouldn't do it on any other show!'\n\nMeanwhile, Alec took to Instagram to wish daughter Ireland, whom he shares with ex-wife Kim Basinger, a happy 24th birthday in a video he shot as he sat in the back of a car on Wednesday.\n\nSlimmer star: The 61-year-old certainly looked younger and more in shape\n\nPush it: His two youngest children seemed to be enjoying themselves as they rolled along\n\nAnd Hilaria and their little ones couldn't help mocking the semi-serious way he said it in an Instagram video she shared on Wednesday.\n\nShe captioned it: 'You have to see Alec’s happy bday Ireland post for this to make sense...we like to laugh and poke fun in our family...as I always say: making fun of you is the highest form of flattery...Alec informs me that it’s actually: imitation is the sincerest form of flattery. Whatever.'\n\nThen the 35-year-old yoga expert, Carmen, five, Rafael, three, and Leonardo all took turns at copying how Alec had said 'happy birthday Ireland.' Even baby Romeo had a go but ended up saying 'no!' much to everyone's amusement.\n\nSuper boy: Rafael, three, was wearing his super hero T-shirt when he had a go at copying how his Dad had said 'happy birthday Ireland'\n\nWho's in there? Leonardo, two, was unrecognizable in his Statue Of Liberty mask as he wishe his half sister a happy 24th birthday\n\nCo cute: Even baby Romeo had a go but ended up saying 'no!' much to everyone's amusement\n\nFamily fun: The video ended with the whole family gathered to wish Ireland a happy birthday\n\nThe whole family got together at the end to wish Ireland a happy birthday.\n\nThis comes as it emerged at the weekend that The Hunt For Red October star had a one-night meet up with Jackie Onassis 30 years ago.\n\nThe widow of President John F. Kennedy invited him to be her plus one at Dancing At Lughnasa on Broadway when he was 31 and she was 62.\n\nIt was a double date with Carly Simon and her now ex-husband James Hart and Jackie later called it a 'magical night.'", "description": "The 61-year-old star was spotted out pushing his sons Leonardo, two, and Romeo, 10 months, in a tandem stroller near Washington Square Park in Greenwich Village, NYC on Wednesday.", "authors": ["Bobbie Whiteman For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/16/20137562-0-image-a-4_1571931498643.jpg", "published_at": "2019-10-24"}