{"pub": "investing.com", "url": "https://investing.com/analysis/why-avid-bioservices-cdmo-could-be-positioned-for-a-slump-200468232", "downloaded_at": "2019-09-26 15:23:08.856005+00:00", "title": "Why Avid Bioservices (CDMO) Could Be Positioned For A Slump", "language": "en", "text": "Similar to wise buying decisions, exiting certain underperformers at the right time helps maximize portfolio returns. Selling off losers can be difficult, but if both the share price and estimates are falling, it could be time to get rid of the security before more losses hit your portfolio.\n\nOne such stock that you may want to consider dropping is Avid Bioservices, Inc. (NASDAQ: ) , which has witnessed a significant price decline in the past four weeks, and it has seen negative earnings estimate revisions for the current quarter and the current year. A Zacks Rank #4 (Sell) further confirms weakness in CDMO.\n\nA key reason for this move has been the negative trend in earnings estimate revisions. For the full year, we have seen three estimates moving down in the past 30 days, compared with no upward revisions. This trend has caused the consensus estimate to trend lower, going from a loss of 7 cents per share a month ago to its current level of a loss of 16 cents.\n\nAlso, for the current quarter, Avid Bioservices has seen three downward estimate revisions versus no revision in the opposite direction, dragging the consensus estimate down to a loss of 4 cents a share from a loss of 2 cents over the past 30 days.\n\nThe stock also has seen some pretty dismal trading lately, as the share price has dropped significantly in the past month.\n\nAvid Bioservices, Inc. Price and Consensus\n\nSo, it may not be a good decision to keep this stock in your portfolio anymore, at least if you don't have a long-time horizon to wait.\n\nIf you are still interested in the Medical - Biomedical and Genetics industry, you may instead consider a better-ranked stock - Anika Therapeutics Inc. (NASDAQ: ) . The stock currently holds a Zacks Rank #1 (Strong Buy) and may be a better selection at this time. You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nLooking for Stocks with Skyrocketing Upside?\n\nZacks has just released a Special Report on the booming investment opportunities of legal marijuana.\n\n\n\nIgnited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.\n\nSee the pot trades we're targeting>>", "description": "Stocks Analysis by Zacks Investment Research covering: Anika Therapeutics Inc, Peregrine Pharmaceuticals Inc. Read Zacks Investment Research's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-26"}