{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/13/liz-cheney-twitter-fight-rand-paul-was-enjoyable", "downloaded_at": "2019-09-13 18:24:35.356864+00:00", "title": "Liz Cheney: Twitter fight with Rand Paul was 'enjoyable'", "language": "en", "text": "The war of words between GOP Conference Chair Liz Cheney and Sen. Rand Paul continued Friday, with both lawmakers saying it was an important debate for the direction of the party’s foreign policy.\n\nSpeaking at the House GOP retreat in Baltimore Friday morning, Ms. Cheney said she “enjoyed” the Twitter spat with the Kentucky senator.\n\n“I thought it was an enlightening exchange,” the congresswoman told reporters at the retreat. “Here I thought the Senate was dull.”\n\nThe feud began Wednesday when Mr. Paul shared an article criticizing Ms. Cheney for being at odds with President Trump’s position on the war in Afghanistan.\n\nIt continued throughout the week after the president fired his National Security Adviser John R. Bolton — with Mr. Paul accusing Ms. Cheney of “warmongering” and being slammed for his 2016 campaign in return.\n\nThe Wyoming Republican continued to swipe at Mr. Paul’s failed presidential run, arguing Americans don’t respond to his isolationist ideas.\n\n“There are issues that surround whether or not you put America first, as President Trump does, or blame America first as Rand Paul does and has for years,” she said.\n\nMr. Paul fired back Friday afternoon, doubling down on accusing Ms. Cheney of opposing the president’s foreign policy strategy.\n\n“Few people have been as wrong on foreign policy over the last few years as the neocons and Liz Cheney. The Twitter exchange represents a real and significant debate on the future of our foreign policy between realists like myself and NeverTrumper neoconservatives like Cheney.”\n\nWhen asked if the feud was a symptom of a larger rift in the party over foreign policy, Minority Leader Kevin McCarthy dismissed the idea.\n\nHe said Republicans embrace a rigorous debate, before swiping at Democrats for the number of primary challengers current members are facing from more liberal candidates.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The war of words between GOP Conference Chair Liz Cheney and Sen. Rand Paul continued Friday, with both lawmakers saying it was an important debate for the direction of the party's foreign policy.", "authors": ["The Washington Times Http", "Gabriella Muñoz"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/13/House_Republicans_57847.jpg-1a66d_c0-336-4800-3134_s1770x1032.jpg?0bf0df74674a97fd99d82eadc5221bd35289763a", "published_at": "2019-09-13"}