{"pub": "aljazeera", "url": "https://aljazeera.com/ajimpact/uaw-strike-knocks-wind-gm-profit-forecast-191029145314397.html", "downloaded_at": "2019-10-30 00:02:37.135813+00:00", "title": "UAW strike knocks wind out of GM's profit forecast", "language": "en", "text": "General Motors Co on Tuesday slashed its earnings forecast for 2019, saying that a 40-day United States labour strike by the United Auto Workers (UAW) union that brought virtually all of its North American operations to a standstill would cost the company around $3bn in profits this year.\n\nDespite the blow to the forecast, GM shares rose 1.6 percent in premarket trading on the back of a better-than-expected quarterly net profit fuelled by robust US sales of high-margin pickup trucks and SUVs.\n\nMore:\n\nWall Street analysts have viewed the strike costs as a trade-off for three US plant closures to which the union agreed - and which will boost GM's profitability.\n\n\"The underlying business was strong this quarter,\" Chief Financial Officer Dhivya Suryadevara told reporters at GM's headquarters, describing the strike as a \"one-time impact\".\n\nLast Friday, the 48,000 UAW union members at GM ratified a new four-year labour deal with the Detroit company. The 40-day strike cost GM more than $2bn, according to analysts.\n\nThe Detroit-based automaker reported a six percent increase in third-quarter US sales, led by its highly-profitable full-size pickup trucks, SUVs and crossover vehicles.\n\nVirtually all of the pre-tax profits came from its North American business and its captive finance arm.\n\nIn China, where GM reported a 17.5 percent drop in third-quarter sales, the company's equity income fell 40 percent to $300m.\n\nIt was the fifth straight quarterly sales decline for GM in China, the world's largest auto market, where the industry is expecting a second consecutive annual sales drop.\n\nThe China Association of Automobile Manufacturers expects a five percent decline for industry sales in 2019, then contraction or slow growth over the next three years.\n\n\"It [China] remains volatile,\" GM CFO Suryadevara said.\n\nLast week, GM's smaller US rival, Ford Motor Co, cut its forecast for operating profit for the year after a disappointing quarter that was hurt by higher warranty costs, bigger discounts and weaker-than-expected performance in China.\n\nGM said the strike by the UAW had cost it $1bn in pre-tax profits in the quarter, or 52 cents per share. CFO Suryadevara said the automaker lost around 300,000 units of vehicle production during the strike.\n\nThe union negotiated higher pay and other benefits from GM as part of the deal to end the strike.\n\nUnder the deal, GM will invest $9bn in the US, including $7.7bn directly in its plants there, with the rest going to joint ventures.\n\nThe number one US automaker said the full-year impact of the strike would be around $2 per share, or around $3bn.\n\nGM said it now expected full-year adjusted earnings per share between $4.50 to $4.80, down from its previous forecast of $6.50 to $7 per share.", "description": "The 40-day strike by US-based UAW GM workers cost the automaker  more than $2bn, according to analysts.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/29/1dc44834142147f590caa8bb98fbe677_18.jpg", "published_at": "2019-10-29"}