{"pub": "realclearpolitics", "url": "https://nationalinterest.org/blog/middle-east-watch/war-weary-us-troops-are-ready-leave-afghanistan-91696", "downloaded_at": "2019-10-30 04:15:09.913822+00:00", "title": "War Weary: U.S. Troops Are Ready to Leave Afghanistan", "language": "en", "text": "If the United States were engaged in a war of national survival, then it would be willing to accept the costs posed by counterinsurgent war. But Afghanistan is not a war of national survival.\n\nHopes that a peace settlement in Afghanistan would be reached were dashed when a Taliban attack in Kabul killed a U.S. soldier and eleven others on September 6. Less than two weeks later, two separate Taliban attacks killed forty-eight people on the same day, after which the Taliban killed twenty people with a truck bomb at a hospital in Qalat Ghilji city in southern Afghanistan.\n\nThere is every reason to think this sort of chaos will continue, but it should not delay the United States’ overdue exit from its longest running war. President Donald Trump called off peace talks with the Taliban following the September 6 attack, but he doesn’t need to negotiate a peace to make good on his campaign promise and bring U.S. troops home.\n\nTo be sure, withdrawing U.S. forces from Afghanistan will not magically result in a peaceful resolution—but neither will keeping them there. In fact, the U.S. military presence is part of what fuels Afghanistan’s violence because U.S. troops are a foreign occupation force that breeds resentment with the population–regardless of our intentions, just as would happen if a foreign military was ensconced in America.\n\nMoreover, the fourteen thousand U.S. soldiers in Afghanistan are realistically insufficient to quell the country’s violence, which predates U.S. intervention and will persist after those soldiers are gone. The accepted standard for successful counterinsurgency is a force ratio of at least twenty troops per one thousand residents. According to the January 2019 Special Inspector General for Afghanistan Reconstruction quarterly report, Afghan insurgents “slightly increased its control or influence over areas where 10.8% of the population (3.6 million people) lived” and “the population living in contested areas increased to 8.5 million people” (this data has subsequently been discontinued in subsequent reports). That would require a force of 242,000 soldiers, more than twice the high water mark of the one hundred thousand U.S. troops reached in August 2010. A deployment of that scale would exact an enormous price on our military, and the American people—wisely—would not support it.\n\nThere is also the inevitable problem of collateral damage. No matter how hard we try to avoid it, military action intended to kill the enemy all too often results in killing innocent civilians. Indeed, last week a U.S. drone strike aimed at an Islamic State hideout in Afghanistan instead killed at least thirty civilians. Since January 2009, the United Nations has documented more than sixteen thousand civilian deaths, and so far this year alone the number is more than thirteen hundred. The result of this collateral damage is the alienation of the civilian population, which creates more resentment of foreign forces and more sympathy for the insurgents.\n\nIf the United States were engaged in a war of national survival, then it would be willing to accept the costs posed by counterinsurgent war. But Afghanistan is not a war of national survival. The Taliban, Al Qaeda, and even ISIS are internal threats to the Afghan government and part of a power struggle over who controls the country, but none are direct (let alone existential) threats to the United States. And however desirable a representative, multiethnic, democratic government in Afghanistan would be, it is not a necessity for U.S. national security. All we need is for whatever government controls Afghanistan to understand that the United States will not tolerate support for or the harboring of any terrorist group with global reach that directly threatens the United States. That’s true even if the government in question is not a friendly government.\n\nDon’t forget that the Authorization for the Use of Military Force approved by Congress on September 14, 2001, was “to use all necessary and appropriate force against those nations, organizations, or persons he determines planned, authorized, committed, or aided the terrorist attacks that occurred on September 11, 2001, or harbored such organizations or persons.” That means Osama bin Laden, Al Qaeda, and the then-Taliban-led government in Afghanistan because it gave safe haven to bin Laden and Al Qaeda.\n\nThat mission has long since been completed. The Taliban was driven from power in a matter of weeks. Al Qaeda’s senior leadership was disrupted and scattered over the next few years—largely to neighboring Pakistan. And Osama bin Laden was found and killed by U.S. Special Operations Forces in May 2011.\n\nSo, it’s fair to say “mission accomplished,” and it’s well past time to recognize that the present threat in Afghanistan doesn’t warrant a continued U.S. military presence. The mission has become one of nation building, which Trump rightly eschewed as a candidate. Rather than continue to risk American blood and treasure, we should exit Afghanistan posthaste.\n\nCharles V. Peña is a senior fellow with Defense Priorities. He has more than twenty—five years of experience as a policy and program analyst and senior manager, supporting both the Departments of Defense and Homeland Security. Peña is the former director of defense—policy studies at the Cato Institute and author of Winning the Un—War: A New Strategy for the War on Terrorism.\n\nImage: Flickr / Department of Defense", "description": "If the United States were engaged in a war of national survival, then it would be willing to accept the costs posed by counterinsurgent war. But Afghanistan is not a war of national survival.", "authors": [], "top_image": "https://nationalinterest.org/sites/default/files/main_images/8033044703_a65a13d2b5_o.jpg", "published_at": "2019-10-28"}