{"pub": "cbc", "url": "https://cbc.ca/news/technology/lucki-morneau-married-cousin-rumour-false-1.5288672", "downloaded_at": "2019-09-18 23:23:05.314365+00:00", "title": "False online rumour claims RCMP chief is married to Bill Morneau's cousin | CBC News", "language": "en", "text": "A rumour that RCMP Commissioner Brenda Lucki's husband is related to Finance Minister Bill Morneau was shared widely online over the past week. The rumour claims the supposed familial relationship is the reason the RCMP has not launched an official investigation into the Trudeau government's handling of the SNC-Lavalin scandal.\n\nBut it's not true. Morneau and Lucki's husband aren't related.\n\nThe unfounded rumour appears to be based on hearsay and was first mentioned by a Twitter account with fewer than 500 followers, offering no evidence of a link between the two officials. The rumour was then amplified to reach an audience of tens of thousands of Canadians on Facebook and Twitter in a matter of days.\n\nThe falsehood spread far enough that both the RCMP and Morneau felt compelled to issue statements clarifying there was no family relationship between Lucki's husband, Ray Gauthier, and Bill Morneau.\n\n\"These allegations are false,\" said a spokesperson for Bill Morneau's campaign team in an email to CBC News.\n\nActing Sgt. Caroline Duval, an RCMP spokesperson, told CBC the force had confirmed that Gauthier is not related to Morneau.\n\nCBC News also reviewed publicly-available family trees for both Morneau and Lucki's husband, as well as several family obituaries, and could find no link between the two.\n\nPrimed to go viral\n\nThis kind of rumour is primed to go viral because it fits into an existing belief system, said Christopher Schneider, an associate professor of sociology at Brandon University in Manitoba who studies social media and policing.\n\n\"There's already an existent narrative that this particular meme and rumour can be placed neatly into, whether it's real or false,\" Schneider said. \"They want to believe that there's some sort of dirt, or something going on with the investigation, or that there is corruption there.\"\n\nHe added that the specifics of the rumour are believable but hard to verify — which makes it even more likely to be shared.\n\n\"It's also not completely implausible. It's not a meme that says, 'Brenda Lucki has two heads and secretly hides one of her heads.' The idea that she could be married to somebody's cousin doesn't seem out of the realm of possibility,\" Schneider said.\n\nThe rumour also emerged as the RCMP is facing questions about its own internal affairs, after senior intelligence officer Cameron Ortis was charged with violating Canada's official secrets act.\n\nFirst tweeted by account with just a few hundred followers\n\nThe first mention of the rumour that CBC managed to find on social media appeared on Aug. 26. In a response to a tweet about the RCMP and SNC-Lavalin, an unidentified person who goes by \"Kim\" claimed that they had obtained information from a retired RCMP officer.\n\n\"[Minister of Public Security] Ralph Goodale has tied the hands of the commissioner, who is married to a relative of Bill Morneau,\" this person claimed, offering no evidence.\n\nIn fact, in a later tweet, the user expressed frustration over being unable to find any information about the family of Lucki or Gauthier. When contacted via Twitter, the person running the account refused to speak with CBC. The initial tweet was shared 29 times.\n\nThat tweet is the earliest instance of the allegation that CBC News could find online. All of the early tweets and Facebook posts propagating the rumour either cite this tweet, or other posts referencing it, as evidence. No earlier traces of the rumour have been found and the original tweeter seems to indicate that they obtained their information from an in-person conversation, not from an online source.\n\nThe unfounded rumour had a limited spread immediately following its first mention. CBC News managed to find a handful of tweets referencing it, as well as some Facebook posts, none of which garnered a large number of reactions.\n\nBut on September 10, the false story began picking up steam. The rumour began popping up in response to reporters' tweets about a Globe & Mail story alleging that the Trudeau government had refused to lift cabinet confidentiality on the SNC-Lavalin issue, blocking RCMP inquiries into whether the SNC-Lavalin case amounted to obstruction of justice.\n\nThe Globe also reported that the RCMP were pausing their inquiries because of the federal election campaign.\n\nMentions of the rumour also appeared in responses to a tweet by an obscure Canadian conspiracy website on Sept. 13. Some of those responses claimed Lucki herself was Morneau's cousin; the website subsequently tweeted out the cousin rumour later in the day.\n\nFrom there, the story reached a larger audience beginning September 15, when memes featuring pictures of Lucki and Morneau and the false rumour of their connection started to emerge. Several partisan commentators and pages on both Twitter and Facebook shared these memes, generating thousands of shares and comments.\n\nThis meme puts the false rumour into an easy-to-share format, which spread quickly on social media. (Image: Facebook)\n\nExact numbers are difficult to determine because many different versions of the memes and posts pushing the rumour were shared across social media platforms.\n\nThe story was posted on Sept. 16 by Alberta Canada Campaign, a Facebook page that's part of a network of partisan pages created by former Conservative Party organizer Larry Brandt. The post was shared 3,300 times. (Incidentally, the person listed as the administrator of Alberta Canada Campaign, Maureen Gow Zelmer, was also one of the first people to post the rumour to Facebook on Aug. 26.)\n\n\"A rumour like this quickly gains a life of its own,\" Schneider said. \"Even while news journalists investigate this and debunk it, that does not necessarily deter the circulation and the virality, because in certain circumstances, people want to believe this.\"", "description": "Despite a lack of evidence, many people were quick to share a rumour of a family connection between Brenda Lucki and the finance minister, and to claim the relationship is the reason why the RCMP has not launched a formal investigation into the SNC-Lavalin affair.", "authors": [], "top_image": "https://i.cbc.ca/1.5288711.1568834272!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/brenda-lucki-and-bill-morneau.jpg", "published_at": "2019-09-18"}