{"pub": "cbc", "url": "https://cbc.ca/radio/q/c-line-dion-talks-courage-life-after-ren-ang-lil-and-her-new-outlook-1.5289958", "downloaded_at": "2019-09-20 22:49:03.754392+00:00", "title": "CBC Radio", "language": "en", "text": "Céline Dion has been reinventing herself ever since she got her first taste of stardom in Quebec at age 12.\n\nAt 22 years old, the Charlemagne, Que.-born artist released her first English-language album, Unison, and not long after that she burst into the English-speaking world with a cascade of massive hits, including Beauty and the Beast, The Power of Love and My Heart Will Go On.\n\nIn 1994, Dion married her longtime manager, René Angélil, in a lavish ceremony that was one of the biggest celebrity events in Canada's history. Less than a decade later, in 2003, she headed to Las Vegas where her theatrical, explosive concert residency transformed the city.\n\nToday, Dion is evolving again. She's been emerging from the passing of her husband in 2016, she wrapped up her 16-year residency in Las Vegas this summer, and the word that seems to define her the most right now is \"courage.\" Beyond describing her current outlook on life, Courage is also the name of her new album and world tour that just kicked off this week in Quebec City.\n\nCéline Dion with q host Tom Power in Montreal. (Sean Brocklehurst/CBC)\n\nThe Canadian music icon sat down with q host Tom Power in Montreal to tell us more about this new chapter in her life.\n\nHere is part of that conversation.\n\nOn her final residence show in Las Vegas\n\nIf I recall correctly, people thought that it was going to be very emotional for me, and that it was going to be really hard for me, but I knew what I was getting myself into probably the next day or a couple of days after that. Of course, don't get me wrong, I stayed so long in Vegas ⁠— actually, I still live in Vegas and I raised my kids in Vegas ⁠— it will always be a home for me because this is where I still live. Even though I am in Montreal right now where my roots are and this is really home.\n\nTo make a long story short, I felt very strong. When I did the live show, even though there were a lot of butterflies, I did not want to cry. I love what I do and when I get embraced by the audience, I get taken by the emotions. So I said to myself, I want to have a good time, especially tonight, because it's my last show, so let's make it like a party. I have to say, I don't remember if I cried, I don't think I did. If I did not cry, I'm very proud of myself. Everything that I've done for so long there with my team, we have accomplished so much and I'm proud of that.\n\nOn what the word \"courage\" means to her\n\nWell, it means that everybody is going through things in life. I would say when something bad happens to you in life, you have to find a way to overcome these obstacles and find a way to find inner strength. To say, that's part of life, this is not something that you choose. This is something that is imposed on you by life. It's up to you to go through these obstacles, and you have the options, if you're going to need help or not, or how you're going to go through this. We all do have good moments and bad moments. And we all lose people.\n\nCéline Dion has released three new tracks from her latest album, Courage. Expected to drop Nov. 15, Courage is Dion’s first English album in six years. (Sony Music)\n\nOn the loss of her late husband and longtime manager, René Angélil\n\nLosing the father of my children, my husband, my manager, the person that I love the most in the world and the person that I can rely upon without questioning anything since I was 12 years old — losing that person was a big deal for me. It reflected on a lot of people that I've been surrounded by for 20 years. We are still missing him tremendously, believe it or not.\n\nIt takes courage because I'm a single mom and I don't want my kids, my entourage and the people that I love to feel that because I have lost the man of my life that I'm going to lose the essence of what I love, my passion.\n\nI really believe that through all the years with René, who gave me so much, who taught me so much, who gave me so much luggage, that when he left for his new chapter, his new life, he gave me the rest of his luggage. I feel him through the eyes of my kids and inside of me. I felt very, very, very strong, probably stronger than ever before.\n\nOn the evolution of her career and younger generations discovering her music for the first time\n\nWell, I don't know. Don't make me blush. I'm happy. I see it. Don't get me wrong, you cannot please everybody, but I don't care. I've done everything that's needed to be done to have an international career because this is what I wanted. I don't need to prove to my family, my friends, the industry or myself anymore. I did that. They gave me a spot and I took it. I never wanted to have a hit, I wanted to have a career.\n\nOn working with producer David Foster on All By Myself\n\nDavid and I had taken a whole day with the piano on a speakerphone to choose the key. I arrived in L.A. and he says, \"You're gonna freak out. I'm so happy about my production. I'm going to play you the track. Let's do this. It's going to be amazing. It's going to be big.\" I mean, with David, everything's going to be big, you know? So it was amazing, but then I said, \"David, is that the final key?\" I think it was like a key and a half higher, and I'm like, okay, why did we spend a whole day on the key that works and now I'm over here? I think everything exploded, my pants, my bra, my shirt. When I hit that note, what you hear in the back is not the drums, it's my clothes that exploded. People stop breathing when I hit that note.\n\nOn how it feels to be back home in Quebec\n\nIt's amazing. To see my kids enjoy where I grew up, where they don't come enough, and to see their uncles and my mom, and to play outside in their bare feet and they don't burn their feet. Vegas has given us a lot over all these years, but when you go outside in bare feet in Vegas, you might come back with melted toenails. So here it's like the weather, and the nature, and to pick tomatoes from our little gardens. For the kids to just play badminton, and ball, and bicycle, it's like I said, these are the moments that they will never forget. This is a heritage that I give them and I'm so lucky that I was born here. This is the blood that's going through my veins mixed with some maple syrup. So that's why I'm a sweet girl.\n\nDion just launched a world tour called Courage. Her latest album, also called Courage, will be released later this year. Below are three songs from the new album.\n\nThis transcript has been edited for length and clarity. To hear the full extended interview with Céline Dion, download our podcast or click 'Listen' near the top of this page.\n\nInterview with Céline Dion produced by ​Mitch Pollock.", "description": "Céline Dion sat down with q’s Tom Power in Montreal to talk about her new tour, music and why she’s more courageous now than ever before.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5289967.1568996250!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_620/celine-dion.jpeg", "published_at": "2019-09-20"}