{"pub": "investingcom", "url": "https://za.investing.com/news/stock-market-news/update-1south-african-platinum-miners-wage-talks-go-to-internal-abitrators-1952478", "downloaded_at": "2019-09-10 08:24:14.122530+00:00", "title": "UPDATE 1-South African platinum miners' wage talks go to internal abitrators", "language": "en", "text": "© Reuters. UPDATE 1-South African platinum miners' wage talks go to internal abitrators\n\n(Adds detail, Amplats comment)\n\nJOHANNESBURG, Sept 10 (Reuters) - South Africa's main platinum mining union said it had formally declared that wage talks with Anglo American (LON: ) Platinum (Amplats) and Sibanye-Stillwater were deadlocked, raising the possibility of strike action if the issue cannot be resolved.\n\nThe formal declaration means the talks are now being overseen by internal arbitrators.\n\nThe Association of Mineworkers and Construction Union (AMCU) demanded in June a monthly basic wage hike of about 48% but talks broke down and it said last month that it was disappointed by a wage offer for workers at Lonmin, which was acquired by Sibanye this year. prices for precious metals and a weaker rand currency have boosted profits at the world's top platinum miners and emboldened the union to seek higher wage demands.\n\nSouth Africa's AMCU union General Secretary Jeff Mphalele said the union had formally declared talks were deadlocked, when asked by Reuters on Tuesday.\n\nAmplats, which in July reported half-year profits more than doubled on the back of higher metals prices, confirmed that AMCU had formally declared a wage dispute. matter is being dealt with through internal dispute resolution mechanisms,\" Amplats spokeswomen Jana Marais said.\n\nIf an internal resolution is not reached the matter could then be referred to resolution body the Commission for Conciliation, Mediation and Arbitration (CCMA).\n\nPrecious metals producer Sibanye, however, fell into the red in the first half of its 2019 financial year after a five-month strike by AMCU at its South African gold operations hit production. could not be reached for comment.\n\nDespite higher metals prices, South African producers are still warning that if wage hikes were unsustainable it could hit jobs and production.\n\nThe industry is still reeling from a 2014 strike that cost billions and forced firms to cut jobs and close mines after a supply glut weighed on platinum prices.", "description": "UPDATE 1-South African platinum miners' wage talks go to internal abitrators", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB6J0AJ_L.jpg", "published_at": "2019-09-10"}