{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/food/thamee-lets-diners-feast-on-burmese-stories/2019/06/13/d2a7070e-8965-11e9-98c1-e945ae5db8fb_story.html", "downloaded_at": "2019-09-26 15:03:13.591815+00:00", "published_at": "2019-06-13", "title": "Tom Sietsema’s Top 10 restaurants: Thamee is No. 10", "language": "en", "text": "AD\n\nAD\n\nEarly access for subscribers: See all 10 restaurants now\n\nDon’t get too attached to the above. Thamee’s menu changes this month, and for the broader. The owners are adding stuffed grilled eggplant, fried chicken Mondays and large plates, including sugar cane glazed duck with naan and dipping sauces.\n\nSure, there’s milk tea to sip, but visitors can also wash back a meal with something bolder, maybe pork fat-washed rye whiskey with jaggery caramel and fish sauce tincture. Billed as the Edward, it resembles a funky old-fashioned. Little details make big impressions: The food is presented on tabletops bearing digital reproductions of fetching textiles from Myanmar (also known as Burma), and bills are dropped off inside miniature coconuts. Above all, Thamee wants you to explore and have fun. “Happy Caturday,” Jacobson welcomed me one recent weekend — in an outfit stamped with feline designs.\n\nThamee: 1320 H St. NE. 202-770-6529. thamee.com.\n\nAD\n\nAD\n\nOpen: Dinner Wednesday through Monday, brunch weekends.\n\nPrices: Dinner mains $18-$25.\n\nSound check: 72 decibels / Must speak with raised voice.\n\nThe Top 10 restaurants of 2019:\n\n10. Thamee\n\n9. Anju\n\n8. Three Blacksmiths\n\n7. Mama Chang\n\n--\n\nThe following preview was originally published June 14, 2019.\n\nThamee lets diners feast on Burmese stories\n\nJocelyn Law-Yone is the head chef at Thamee, but as far as I can tell, she spends just as much time in the dining room as the kitchen of the new Burmese restaurant she co-owns on H Street NE.\n\nAmbassadors tend to mingle easily.\n\n“I grew up on this,” says the smiling native of Yangon, Myanmar, as she brings two of us a bowl of congee set off with a couple of fried prawns. The rice, shot through with lime leaves and lemongrass, has the unexpected texture of a firm risotto. The seafood is nubby with Japanese bread crumbs.\n\nAD\n\nAD\n\nMohinga — catfish noodle curry — comes with a story, too. “This is what everybody wakes up for,” says the chef, who also remembers eating the national treasure as a child after school. “It’s a happy party in your mouth.” Thamee’s version marries chickpea broth and fish broth, plus thin rice noodles and a sail of fried chickpeas. I can see why the sheer comfort, yellow from turmeric and gently bitter with banana stems, is so revered on its home turf.\n\nLaw-Yone shares mistress of ceremonies duties with her daughter and business partner, Simone Jacobson, who like her mother comes to the restaurant from Toli Moli, their Burmese bodega inside Union Market. Thamee, which translates to “daughter” in English, takes the place of Sally’s Middle Name and counts Eric Wang as a co-founder. The chef’s poise in the dining room stems from her résumé: In a previous life, Law-Yone was an English and art history teacher at Duke Ellington School of the Arts.\n\nPickled tea leaf salad is brought to the table. Now, it’s Jacobson’s turn to talk up the food of her mother’s origin. If the appetizer tastes unlike any you may have had before, she says, it’s likely because the signature ingredient was procured from Burgundy Hills, a mindful husband-and-wife source in Myanmar, which is also known as Burma. “One of our servers went to New York to pick up 70 pounds” at John F. Kennedy International Airport, where the waiter met a friend of the tea leaf growers who happened to be visiting the country around the time Thamee opened its doors.\n\nAD\n\nAD\n\nAs I eat the salad, a jumble of crisp vegetables, lime juice and earthy, identifiable tea leaves, I find myself agreeing with Jacobson about how much better the key ingredient is than the mass market variety, which resembles a paste. “It’s the difference between a Ferrari and a Camry,” she says. The manager’s desire to do things right extends to the cane juice she gets by chopping and peeling the sugar cane herself — with a machete. Ahead of Thamee’s maiden brunch, Jacobson stayed up till 3 a.m. to slice and juice 50 pounds of cane.\n\nThamee’s menu is short but brims with dishes you are eager to try again. Shrimp and buthee, a gourd, are tossed in rice flour and garam masala, then fried to a bronze and paired with a dipping sauce that ricochets from hot chiles to sour tamarind. Pickled shaved ginger salad — pulsing with lime juice and crunchy with cabbage and spiced peanuts — is as enticing as the toss of tea leaves. I’m sorry when it’s gone. As for the hot, salty, sour sauces with the fragile samosas, a brunch staple, I wish they were sold by the bottle. The best marriage of meat and fruit in recent memory is the union of pork belly and pickled mango officiated by Law-Yone.\n\nThe food is flattered by table tops whose colorful designs are digital reproductions of Burmese textiles, some dating to the early 1900s. (As for the steel chairs in the 40-seat space, let’s just say they don’t facilitate lingering.)\n\nAD\n\nAD\n\nMyanmar’s passion for tea is underscored in the dining room, where a shelf is dedicated to teacups, some inherited from the previous restaurant. While there’s not much of a drinking culture in the country, Thamee acknowledges the era of British rule in Burma with creations including a Negroni made purple with butterfly pea flower steeped in the grape-based spirit called Singani. Gimlet fans will greet the refreshing Bago Club with open lips.\n\nJacobson says the Burmese embrace “a hundred different languages, cultures and tribes,” and she hopes diners’ experiences at Thamee “spark some conversation.”\n\nNo easy task when your mouth is hosting a party, but we’ll try.\n\nAD", "description": "A vibrant celebration of Burmese food — and drink — on H Street NE.", "authors": ["Tom Sietsema", "Food Critic"], "top_image": "https://www.washingtonpost.com/resizer/aGS3_l2DR_x2_FgNPEtEJ4A5Qvc=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VPY5QRGZMII6TINFCYVYVHE4UI.jpg"}