{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/12/dc-teen-dies-following-stabbing-metro-car-15-year-", "downloaded_at": "2019-10-13 00:22:38.430909+00:00", "title": "D.C. teen dies following stabbing on Metro; 15-year-old suspect charged with murder", "language": "en", "text": "Police said Saturday that a 15-year-old boy has died after being stabbed aboard a Metro train the previous afternoon as it approached a station on Capitol Hill in Washington, D.C.\n\nThe Metropolitan Police Department identified the victim as Jaquar McNair, a resident of Southeast D.C. He was found suffering from a stab wound at around 12:37 p.m. Friday at the Capitol South Metro Station, treated at the scene for life-threatening injuries and transported to an area hospital in very critical condition where he later died.\n\nPolice arrested a 15-year-old suspect shortly after the stabbing and charged her Saturday with first-degree murder while armed, MPD said in a statement. Her name has not been disclosed.\n\nChief Peter Newsham had told reporters Friday that a preliminary investigation determined the stabbing resulted from a dispute among juveniles riding an inbound Orange Line rail car as it approached Capitol South, an underground station that is the closest in the transit system to the U.S. Capitol.\n\nDistrict schools were not in session Friday, the police chief noted.\n\nStatistics maintained by the MPD but not updated daily listed 134 homicides in D.C. this year as of earlier Friday, up 7% from 125 homicides at the same point last year.\n\n“We need to pay close attention to this violence that’s going on in the city,” the police chief said Friday.\n\nMcNair is the 10th known homicide victim this year age 17 or younger, NBC Washington reported.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Police said Saturday that a 15-year-old boy has died after being stabbed aboard a Metro train the previous afternoon as it approached a station on Capitol Hill in Washington, D.C.", "authors": ["The Washington Times Http", "Andrew Blake"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/11/Boy_Stabbed_Capitol_88213.jpg-dae14_c0-172-4127-2579_s1200x700.jpg?ab182f5b3200d20679cd2f45021d1b0d397126f4", "published_at": "2019-10-12"}