{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/26/indonesias-criminal-code-what-is-it-why-does-it-matter-and-will-it-be-passed", "downloaded_at": "2019-09-26 01:33:46.040777+00:00", "title": "Indonesia's criminal code: what is it, why does it matter, and will it be passed?", "language": "en", "text": "1. What is the draft criminal code?\n\nIndonesia’s draft criminal code is a comprehensive set of proposed changes to the country’s existing penal code, which dates back to the days of Dutch colonial rule. The draft bill has been decades in the making, but was finalised by a parliamentary taskforce on 15 September this year. Before the recent widespread and vociferous uproar over the sweeping changes, parliament had scheduled to vote on it on Tuesday. It has been delayed, but the fate of the bill still hangs in the balance.\n\n2. Why are so many people unhappy about it?\n\nIf passed, the proposed criminal code would usher in sweeping and significant changes that could threaten a wide range of civil liberties. There are more than 18 problematic articles within the bill but in protests this week students slammed the parliament for attempting to regulate their private lives and police their morality.\n\nFacebook Twitter Pinterest Indonesians protest in Jakarta on Wednesday.\n\nPhotograph: Ed Wray/Getty Images\n\nAmong the most controversial articles are those that would outlaw extramarital sex, which activists say would criminalise homosexuality and cohabitation for unmarried couples. The bill also stipulates new laws on discussions of sex education and contraception, and includes a four-year jail term for unauthorised abortions.\n\nBut the draft code is also much more. It is feared that a vague article that refers to “living laws” could be used to legitimise hundreds of existing and discriminatory sharia laws at local level. The code also expands the existing blasphemy law, which has been used to prosecute religious minorities, and makes insulting the president, vice president and state a criminal offense, which activists fear could impact Indonesia’s hard-won press freedoms. Other articles also outlaw black magic and associating with Marxist-Leninist organisations.\n\n3. Will tourists be affected?\n\nFacebook Twitter Pinterest A protester throws a stone during clashes with police in Jakarta. Photograph: Antara Foto/Reuters\n\nEveryone in Indonesia will be affected by the law, including tourists visiting Bali. On Friday the Australian government updated its travel advice to its citizens living in, or planning to visit Indonesia, noting on its smartraveller page that: “You’re subject to local laws and penalties, including those that appear harsh by Australian standards.” The advice proceeds to outline several key changes and adds that if passed the new criminal code would not come into effect for two years.\n\n4. What has the government/president’s response been to the crisis?\n\nUntil last week the government appeared ready to pass this controversial bill into law, but on the back of widespread outcry last Friday the president, Joko Widodo, ordered the parliament to postpone, saying more input was required.\n\nMany students feared the parliament might still attempt to push in through in the last few days of their term, which is one of the reasons tens of thousands have protested around the country this week. Students are also angry about a new law on the country’s anti-corruption body, which will likely weaken its powers, as well as the raging forest fires in Sumatra and Kalimantan, outstanding cases of human rights abuses and militarisation in West Papua, to name a few of their concerns with the current government.\n\n5. How likely is it that the code will be passed?\n\nIt now looks unlikely the bill will be passed in its current form by the current parliament. The head of the House of Representatives said on Tuesday the bill would be delayed to “reduce public tension and meet public aspirations”, while the head of the parliamentary commission that oversees legal matters also said the bill would be passed onto the next set of legislators. Indonesia’s security minister Wiranto further urged students to end their demonstrations yesterday, saying the bill had been postponed. The question looking forward is what the next parliament will do with the bill, and what revisions might be made to a number of problematic articles it includes.", "description": "Violent protests have stymied the draft bill that contains controversial measures on sex, abortion and blasphemy", "authors": ["Kate Lamb"], "top_image": "https://i.guim.co.uk/img/media/c57b30004d6dbee1a5c37c5cf0005228167322ec/0_168_3500_2102/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8acb7cc654dc93f7212913db749c895f", "published_at": "2019-09-26"}