{"pub": "yahoo", "url": "https://news.yahoo.com/giuliani-says-he-will-cooperate-with-trump-impeachment-inquiry-only-if-the-president-gives-him-the-green-light-201452352.html", "downloaded_at": "2019-09-29 23:31:31.000738+00:00", "title": "Giuliani says he will cooperate with Trump impeachment inquiry — only if the president gives him the green light", "language": "en", "text": "Rudy Giuliani, President Trump's personal attorney, defended himself Sunday on \"This Week With George Stephanopoulos\" from accusations lodged by a former White House official that he has trafficked unfounded theories about foreign interference in the 2016 presidential election. (Photo by Jeff Neira/Walt Disney Television via Getty Images)\n\nPresident Trump’s personal attorney, Rudy Giuliani, said Sunday he would cooperate the House impeachment inquiry, but only if directed by his client.\n\nTrump, according to a memo of his July 25 phone conversation with Ukrainian President Volodymyr Zelensky and an anonymous whistleblower complaint, repeatedly pressed Ukrainian officials to investigate former Vice President Joe Biden and his son Hunter, and noted that Giuliani would be in contact with Ukraine on the probe.\n\n\"Rudy very much knows what's happening and he is a very capable guy,\" Trump told Zelensky. \"I will have Mr. Giuliani give you a call and I am also going to have Attorney General [William] Barr call and we will get to the bottom of it.\"\n\nThe investigation was based on a dubious claim that, as vice president in 2016, Biden pushed Ukraine’s government to oust a prosecutor, Viktor Shokin, who was investigating Burisma, a Ukrainian gas company that had Hunter Biden on its board starting in 2014, where he received a monthly salary of $50,000.\n\nWhile Joe Biden did call for the prosecutor’s removal, he was one of many international leaders who did so in response to concerns about corruption, a fact that undercuts Giuliani’s claim that Biden acted in his son’s interests. The investigation into Burisma had been closed prior to the vice president calling for the prosecutor’s ouster, Bloomberg News reported. In fact, in late 2014, the Obama administration pressed the Ukrainians to assist the U.K. in a separate investigation into Burisma’s owner.\n\nYet, despite the lack of evidence, Giuliani began pressing the Ukrainians to investigate the Bidens' role in the prosecutor’s firing earlier this year and has maintained his argument that there was wrongdoing on behalf of the Bidens.\n\nGiuliani was named “a central figure” in Trump’s effort to use “the power of his office to solicit interference from a foreign country in the 2020 U.S. election,” according to the released whistleblower complaint against the president for his dealings with Ukraine and allegedly withholding almost $400 million in military aid from the country as leverage for a probe into the Bidens. Giuliani could be one of the potential witnesses Democrats in the six House committees involved in the investigation may seek to interview, as they are said to be eyeing a fast-paced impeachment inquiry, which officially began last week.\n\nAs Senate Democrats came out in support of the inquiry, Illinois Sen. Dick Durbin said Tuesday there’s an expectation that the “Trump White House will stonewall” congressional investigators.\n\n“Are you going to cooperate with the House Intelligence Committee?” Giuliani was asked by ABC News’ “This Week” host George Stephanopoulos.\n\n“That is a question that has a lot of implications to it,” Giuliani responded. “Believe it or not, I'm an attorney. Everything I did was to defend my client. I am proud of what I did. And I am proud of having uncovered what will turn out to be a massive pay-for-play scheme, not unlike the Clinton Foundation.”\n\nWhen Giuliani started to discuss looking into “places that Hunter Biden went to sell his father's office,” Stephanopoulos asked again if he would cooperate with the House Intelligence Committee.\n\n“I wouldn't cooperate with [House Intelligence Committee Chairman] Adam Schiff,” Giuliani said. “I think Adam Schiff should be removed. If they remove Adam Schiff, if they put a neutral person in, who hasn't prejudged the case, if they put someone in, a Democrat who hasn't expressed an opinion yet — if I had a judge in the case and he had already announced I'm going to impeach, if he already went ahead and did a whole false episode, wouldn't I move to recuse that judge?”\n\n“So that's your answer, you're not going to cooperate?” Stephanopoulos pressed.\n\n“I didn’t say that,” Giuliani pushed back. “I said I would consider it.”\n\n“I have to be guided by my client, frankly,” he continued. “I'm a lawyer. It's his privilege, not mine. If he decides that he wants me to testify, of course I'll testify, even though I think Adam Schiff is an illegitimate chairman. He has already prejudged the case.”\n\nGiuliani added: “If we want fairness here, we've got to put somebody in charge of that committee who has an open mind, not someone who wants to hang the president.”", "description": "President Trump’s personal attorney, Rudy Giuliani, said Sunday he would cooperate the House impeachment inquiry, but only if directed by his client.", "authors": ["Kadia Tubman"], "top_image": "https://s.yimg.com/uu/api/res/1.2/hKeP6knQuXqJuRawY9bPvQ--~B/aD0yMzk1O3c9MzYwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/6cc35390-e2e1-11e9-be91-11481d814271", "published_at": "2019-09-29"}