{"pub": "nyt", "url": "https://nytimes.com/2019/09/04/technology/san-diego-electric-scooters.html", "downloaded_at": "2019-09-04 23:40:19.858199+00:00", "title": "Welcome to San Diego. Don’t Mind the Scooters.", "language": "en", "published_at": "2019-09-04", "text": "Safety has become a big issue. A three-month study published in May from the Centers for Disease Control and Prevention and the Public Health and Transportation Departments of Austin, Tex., found that for every 100,000 scooter rides, 20 people were injured. Nearly half of the injuries were to the head; 15 percent of those showed evidence of traumatic brain injury.\n\nBird, Lime and Skip are trying to secure new funding, according to three people familiar with the talks , who declined to be identified because the discussions were not finished. In May, Lime replaced its chief executive; several other top executives also left. And in July, Bird’s chief executive called a report about the company’s losses “fake.”\n\nScooters are “a fun and convenient mode of transportation that really does put people at risk and introduces significant spatial challenges to the civic commons,” said Adie Tomer, a metropolitan policy fellow at the Brookings Institution. “Those tensions are not going anywhere anytime soon.”\n\nBird declined to comment.\n\nMany scooter companies miscalculated how long the scooters would last — often not long enough for rental fees to cover their costs — and are struggling with profitability, acknowledged Sanjay Dastoor, Skip’s chief executive. His company has designed a way to produce more durable scooters that can be repaired more easily and last long enough to turn a profit, he said, allowing it to “run a safe fleet that we are proud of.”\n\nLindsey Haswell, Lime’s head of communications, said new industries often faced regulatory challenges, “but our investors are willing to take the long view.” She added that the issues in San Diego did not reflect the global scooter market. Lime has provided more than three million trips in San Diego, she said, and has “as many supporters as we have detractors” there.\n\nHans Tung, an investor at GGV, which has backed Lime, said he was encouraged by the company’s progress and was confident it would make its scooters safe and profitable. “I don’t see how that couldn’t be achieved,” he said.\n\nBird and Lime deployed their scooters in San Diego in February 2018, followed by other companies. The start-ups pitched themselves as environmentally friendly, a message that jibed with San Diego’s goal to reduce greenhouse emissions.", "description": "A year ago, electric rental scooters were hailed as the next big thing in transportation. But their troubles in San Diego show how the services have now hit growing pains.", "authors": ["Erin Griffith"], "top_image": "https://static01.nyt.com/images/2019/08/26/business/00scootermess6/00scootermess6-facebookJumbo-v2.jpg"}