{"pub": "businessinsider", "url": "https://businessinsider.com/amazon-consumer-business-last-oracle-database-aws-2019-10", "downloaded_at": "2019-10-15 23:07:33.845702+00:00", "title": "Amazon's consumer business just shut down its last Oracle database, and says that it reduced its costs by 60% doing it", "language": "en", "text": "Amazon just shut down the last Oracle database powering a big chunk of its business, and moved it over to its home-grown Amazon Web Services technology instead.\n\nOn Tuesday, Amazon announced in a blog post that the consumer business — which encompasses Amazon Prime, Alexa, and Kindle — has turned off the last Oracle database it was using, migrating 75 petabytes of data to Amazon Web Services databases. Previously, that data was stored in nearly 7,500 Oracle databases. Over 100 teams were involved in this effort, the company says.\n\nBarr wrote that the migrations were completed with little or no downtime, and now that it's using AWS databases, it reduced its costs by 60% and latency of consumer applications was reduced by 40%. He also said that with AWS databases, it was easier to scale its advertising data, which previously would have taken months, and its buyer fraud data now has the same or better performance at half the cost.\n\n\"Over my 17 years at Amazon, I have seen that my colleagues on the engineering team are never content to leave good-enough alone,\" AWS chief evangelist Jeff Barr wrote in the blog post. \"Over the years we realized that we were spending too much time managing and scaling thousands of legacy Oracle databases.\"\n\nThis comes as part of Amazon's broader efforts to move away from Oracle's software. Previously, CNBC reported that Amazon plans to move completely off Oracle's databases by early 2020, although Oracle CTO and founder Larry Ellison scoffed at the idea.\n\nIn April, Amazon Fulfillment moved off its last Oracle database. Previously, Amazon CTO Werner Vogels said that his happiest day at Amazon was when the company turned off its largest Oracle data warehouse,and that its software is now moving faster because of it.\n\nRead more: Amazon CTO Werner Vogels says the whole company is moving more quickly thanks to ditching some Oracle software\n\nBusiness Insider has reached out to Oracle for comment.", "description": "Amazon's consumer business, which includes Amazon Prime, Kindle, and Alexa, has moved off Oracle databases to Amazon Web Services' own.", "authors": ["Rosalie Chan"], "top_image": "https://image.businessinsider.com/5be387ceda27f86c8721f8b2?width=1200&format=jpeg", "published_at": "2019-10-15"}