{"pub": "yahoo", "url": "https://news.yahoo.com/rush-limbaugh-blasts-fox-news-213925630.html", "downloaded_at": "2019-10-03 07:48:05.136358+00:00", "published_at": "2019-10-02", "title": "Rush Limbaugh Blasts Fox News: They Should Change Name to ‘Fox Never Trumper Network’", "language": "en", "text": "Conservative radio star Rush Limbaugh inserted himself directly into the middle of the Fox News civil war between the network’s news division and opinion personalities, complaining on Wednesday that the conservative-leaning network isn’t completely on board with the president.\n\nBlasting the House Democrats impeachment inquiry during Wednesday’s broadcast of The Rush Limbaugh Show, the right-wing talker bellowed about the coverage of President Donald Trump’s now-infamous July 25 call in which he pressured the Ukrainian president to investigate Democratic presidential candidate Joe Biden.\n\n“They’re trying to create the illusion that Trump is a mob boss,” Limbaugh exclaimed. “And he was ordering someone to make up dirt or else we’re not going to give you the money. Or worse. None of what they’re saying happened in that phone call!”\n\nLimbaugh then took aim at Fox News, complaining that there are “Never Trumpers all over” the network, mocking those at Fox who have said the call is hard to defend or inappropriate.\n\n“There’s nothing hard to defend about the phone call,” the radio host yelled. “You just don’t want to defend it! You know, Fox really ought to change the name of the network from the Fox News Channel to the Fox Never Trumper Network! Because that’s who’s getting the highlights, and they’re bringing in Democrats like Donna Brazile!”\n\nIn the wake of House Speaker Nancy Pelosi’s announcement last week that the House Democrats were pursuing an impeachment inquiry, there have been several notable on-air scuffles between Trump-supporting Fox News hosts and Fox anchors and analysts.\n\nAnchor Shep Smith, for instance, took issue with primetime host Tucker Carlson allowing Trump-defending guest Joe diGenova to call Fox News senior judicial analyst Judge Andrew Napolitano “a fool” unchallenged, prompting Carlson to return fire by mocking Smith while suggesting he’s a “partisan opinion host.”\n\nRead more at The Daily Beast.\n\nGot a tip? Send it to The Daily Beast here\n\nGet our top stories in your inbox every day. Sign up now!\n\nDaily Beast Membership: Beast Inside goes deeper on the stories that matter to you. Learn more.", "description": "REUTERSConservative radio star Rush Limbaugh inserted himself directly into the middle of the Fox News civil war between the network’s news division and opinion personalities, complaining on Wednesday that the conservative-leaning network isn’t completely on board with the president.Blasting the House", "authors": ["Justin Baragona"], "top_image": "https://s.yimg.com/uu/api/res/1.2/.2ExP4Wu14RcvYECu4nUxA--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/0f22a8c399f981b04f729d9e9b2b32f6"}