{"pub": "investing.com", "url": "https://investing.com/news/economy/eu-should-only-agree-to-brexit-extension-if-london-has-a-plan-bdi-1980471", "downloaded_at": "2019-09-18 09:08:41.779499+00:00", "title": "EU should only agree to Brexit extension if London has a plan: BDI", "language": "en", "text": "© Reuters. EU should only agree to Brexit extension if London has a plan: BDI\n\nBERLIN (Reuters) - The European Union should not agree to another Brexit extension unless Britain underpins such a request with a proposal on how to unlock a domestic deadlock and avoid a no-deal Brexit, Germany's powerful BDI industry association said on Wednesday.\n\n\"There must be no free ticket for another delay without a clear roadmap,\" BDI Managing Director Joachim Lang told reporters in Berlin.\n\nIf the British government submits a further request for an extension of the Brexit deadline under Article 50 of the European Treaties, it must be clear how London intends to avoid a bruising no-deal Brexit, Lang said.\n\n\"Only then and with credible parliamentary support, would a further delay make sense in our view,\" said Lang, adding that another extension without any conditions would simply increase business uncertainty.\n\nThe latest postponement of the Brexit date to Oct. 31 did not help political negotiations, Lang said. Instead, many companies that based their business planning on the initial Brexit date of March 29 incurred unnecessary expenditure, he added.\n\n\"A last-minute delay in particular is very expensive,\" Lang said.\n\nThe BDI industry association lamented the lack of progress in political negotiations, blaming London in unusually blunt terms.\n\n\"The behavior by the British government is disturbing. It's irresponsible and playing with fire,\" Lang said.\n\nThere is no plan in sight from the British government to prevent a no-deal Brexit and that's why companies have no choice but to work on the assumption that Britain will crash out of the EU without a transition deal on Oct. 31, Lang said.\n\nHowever, such an outcome would be the worst-case-scenario for German companies, and could push growth down to close to zero for this year, Lang said.\n\nThe government expects the economy to grow by 0.5% this year based on the assumption that a no-deal Brexit can be avoided. This represents a sharp slowdown from an 1.5% expansion last year.\n\nGermany's export-dependent manufacturers are generally suffering from sluggish foreign demand amid a global economic slowdown and rising trade tensions linked to U.S. President Donald Trump's 'America First' policies.\n\nBut trade data reviewed by Reuters showed last month that Germany's recent export slump in the second quarter was driven mainly by weaker sales to Britain rather than the broader trade war.\n\nIn 2018, German exports to Britain accounted for roughly 6% of overall foreign sales, making the United Kingdom the fifth most important export destination for German goods producers.", "description": "EU should only agree to Brexit extension if London has a plan: BDI", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEF1A14U_L.jpg", "published_at": "2019-09-18"}