{"pub": "townhall", "title": "SMART goals help you get and stay healthy", "url": "https://townhall.com/health/health-beauty/2019/01/31/smart-goals-help-get-stay-healthy-n11900", "language": "en", "published_at": "2019-01-31", "downloaded_at": "2019-09-02 07:15:35.064196+00:00", "text": "A few weeks ago, I wrote about 9 healthy habits to bring into the new year. I also offered some pointers for turning those habits into long-term lifestyle choices. So, today I want to follow up with you on your plans to become a healthy and happier person in 2019 and beyond.\n\nSo how’s it going so far? Swimmingly? Doing alright but hit a snag? Still trying to get off the ground? Let’s pull up your health plan, take inventory of your successes and setbacks. Using that info, you can make a tweak or a change—maybe even restart entirely—to get you back on track.\n\nA SMART Health Plan\n\nA good plan to get healthy is has SMART goals. SMART stands for:\n\nSpecific : Define your goal in clear terms to ensure a greater likelihood of accomplishing it. “Eating better” is not specific. “Eating 5 servings of vegetables every day” is.\n\n: Define your goal in clear terms to ensure a greater likelihood of accomplishing it. “Eating better” is not specific. “Eating 5 servings of vegetables every day” is. Measurable : Set criteria that you can use to show your progress toward a goal. Not just your actions, but also the results of your actions.\n\n: Set criteria that you can use to show your progress toward a goal. Not just your actions, but also the results of your actions. Attainable: Set a realistic goal instead of one that is a step shy of impossible. It’s just as important for you to be realistic about your abilities, schedule, desires, dislikes or anything that could help you reach a goal or stand in the way of it. Exercising for 15 minutes every day is very attainable…exercising for three hours every day is unrealistic (especially if you’re just getting started).\n\nSet a realistic goal instead of one that is a step shy of impossible. It’s just as important for you to be realistic about your abilities, schedule, desires, dislikes or anything that could help you reach a goal or stand in the way of it. Exercising for 15 minutes every day is very attainable…exercising for three hours every day is unrealistic (especially if you’re just getting started). Relevant : It’s important to distinguish goals that are important to you and goals that are important to others. In other words, don’t copy and paste a friend’s health goals. Think: Why are your health goals your goal? What would achieving them mean for you?\n\n: It’s important to distinguish goals that are important to you and goals that are important to others. In other words, don’t copy and paste a friend’s health goals. Think: Why are your health goals your goal? What would achieving them mean for you? Timely: A deadline to achieve your goal gives you a sense of urgency. That motivation can sometimes be that extra umph you need to keep pushing when you feel the temptation to quit. Start by setting daily and weekly goals. Then move on to monthly. Quarterly deadlines also help—especially if you think you might lose momentum after banking a few early wins.\n\nIf you recall, getting better sleep was the first of the nine steps to a healthy life. Let’s make a plan with SMART goals to achieve just that.\n\nSpecifically, I suggest you shoot for 7 to 8 hours of sleep per night. And you can measure that by keeping a daily journal or chart with times you went to bed and woke up.\n\nMake sure that 7 to 8 hours is attainable for you. For example, an existing sleeping disorder can interfere with getting steady sleep so be realistic about your goal. Consider how relevant sleep is to your health, happiness and overall functioning level. Sleep is important, no doubt, but maybe you feel that you need to put more energy into achieving other goals like better diet or more exercise.\n\n(Psst! Here’s a tip: A better diet and regular exercise are proven to help you sleep.)\n\nFinally, set a timeframe to achieve your goal. Remember, you want to work up to a goal. If you are a light sleeper, don’t expect immediate results overnight.\n\nNow That You Have Goals, What are Your Plans?\n\nYou’ve set some SMART goals. You are excited to get started. But what’s your plan?\n\nThis is where it’s important to incorporate the three Rs: Reminder, Routine, and Reward.\n\nThe reminder is your cue or trigger for your new healthy routine. That routine must be repeated over and over. And every time you do that routine, give yourself a reward for doing the right thing.\n\nThe repetition of the three Rs cement these healthy habits into your daily life to the point where you’re no longer working on a new behavior, you’re just doing your thing!\n\nGet My FREE Curcumin Report Chronic Inflammation Decoded\n\nThat’s a broad overview of how it works. Let’s narrow the focus to the second step to healthy living: a better diet. Say your SMART goal is “Eat at least 5 servings of vegetables every day.” The reminder can be a refrigerator full of veggies. Or perhaps you print out a meal plan for the week and post it on your fridge (or both!). Your new routine can be to incorporate those veggies into your daily diet—peas or diced carrots in your starchy dishes, side salads with meals, kale chips or celery sticks instead of potato chips as snacks, blend veggies into your smoothies (pro tip, this is a great way to get those healthy veggies that you don’t love—the smoothie can mask the taste but you still get the benefits), etc.\n\nIt’s important to track your progress, such as counting the number of days per week that you achieve your SMART goal. This data can help you evaluate whether you need to make adjustments to your reminder or your routine.\n\nAfter a week of success, reward yourself for hitting your goal. I usually reward myself with something relevant to the SMART goal, like fun kitchen gadgets that make it easier to eat more veggies. Your reward should be fun—something you look forward to that truly feels like a reward (a new outfit, a trip to the movies, a night out dancing). But I would caution you against using junk foods as a reward. They can very easily unhinge all of the progress you’ve made.\n\nNow apply the SMART goals method and the three Rs to the rest of the nine steps to a healthy lifestyle:\n\nDon’t try to change too much at once. Pick one or two goals to start. And be patient because it takes about two to three weeks for a new behavior to become a habit—that’s not a long time in the grand scheme of things but it can feel like an eternity in the thick of it. If you feel like your will power is about to give in, try to think about how much better you’ll feel a month from now.\n\nMaking Adjustments to Your Plan\n\nAt some point, you may need to make an adjustment. That’s perfectly normal and commendable. It tells me that you recognize that you’re not getting the results you want and you’re open to new ideas to achieve them.\n\nBut before you consider new ideas and draw up new plans, it’s important to look at what went wrong with your existing plan. Was the goal too lofty? Was your plan to achieve it unrealistic with your schedule demands? Are there specific things or people that are getting in the way of your effort to form healthy habits? Did you incorporate your three Rs in your plans?\n\nBe honest with yourself about your goals and plans before making new ones. And just like you previously did, draw up SMART goals so you increase the chances that you hit your marks.\n\nOne Step at a Time\n\nSMART goals and support from the three Rs are vital to keep you motivated and on task. Just as important, they engrain these healthy plans into your brain so that they become new healthy habits.\n\nRemember, Rome wasn’t built in a day. But its construction was remarkably planned. Keep that in mind during the first few weeks of working toward your SMART goals. They are the most critical.\n\nWith each day, with each forward step, you are on your way to creating a happier, healthier life.\n\nNo References\n\nDid You Enjoy This Article? Sign up to get FREE access to more health tips, latest research, and exclusive offers to help you reach your health and wellness goals!\n\nThe post SMART goals help you get and stay healthy appeared first on Newport Natural Health.", "description": "A SMART Health Plan\nNow That You Have Goals, What are .09/02/2019 3:15:32AM EST.", "authors": ["Lily Moran", "Beth Baumann"], "top_image": "https://media.townhall.com/_townhall/resources/images/thog.png"}