{"pub": "mirror", "url": "https://mirror.co.uk/science/asteroid-twice-size-london-bus-20535327", "downloaded_at": "2019-10-08 10:00:53.357716+00:00", "title": "Asteroid twice the size of a London bus will skim past Earth today, NASA warns", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThe idea of an enormous asteroid skimming past Earth may sound like the plot from a science-fiction blockbuster, but today, it will become a reality.\n\nThe asteroid, dubbed 2019 TW1, measures up to 16 metres in diameter, making it almost twice as big as a London bus.\n\nWorryingly, NASA ’s Centre for Near Earth Object Studies only discovered the enormous space rock on October 5 - three days before its passing.\n\nThankfully, the chances of the asteroid colliding with Earth are very low, with the space rock passing our planet a safe distance of 351,000 miles.\n\n(Image: Getty Images)\n\nWhile this might sound far, NASA classifies it as a ‘close’ passing.\n\n2019 TW1 is one of seven near-Earth asteroids expected to pass our planet today - although the other six won’t come as close as this particular space rock.\n\nOther asteroids include 2019 TC1, which will pass at a distance of 834,000 miles, and 2019 TU, which will be just over one million miles from our planet during the passing.\n\n(Image: Getty)\n\nThe largest of the seven, called 2019 RK, is around the same size as the Arc de Triomphe, and only slightly smaller than the famous Chelyabinsk meteor that exploded in the sky over Russia in 2013.\n\nThankfully, 2019 RK will be around four million miles from our planet during its passing today.\n\nThe fact that NASA only discovered many of these asteroids in the last few weeks raises concerns about the asteroid detection system.\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nIn July this year, a huge asteroid came within 45,000 miles of Earth, yet went undetected by NASA.\n\n\"This one did sneak up on us,\" Lindley Johnson, NASA's planetary defence officer, told colleagues the day after the 55,000mph fly-by on July 25.", "description": "The asteroid, dubbed 2019 TW1, measures up to 16 metres in diameter, making it almost twice as big as a London bus", "authors": ["Shivali Best", "Image", "Getty Images Istockphoto", "Getty Images", "Getty"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article19007426.ece/ALTERNATES/s1200/0_asteroid-approaching-planet-Earth-meteorite-in-orbit-before-impact.jpg", "published_at": "2019-10-08"}