{"pub": "afr", "url": "https://afr.com/companies/retail/woolworths-same-store-supermarket-sales-soar-20191029-p535h9", "downloaded_at": "2019-10-29 23:56:07.393943+00:00", "title": "Woolworths same-store supermarket sales soar", "language": "en", "text": "Woolworths' online business also grew faster than Coles, with online food sales rising 43 per cent and total online sales up 37 per cent, while Coles Online sales rose 23.5 per cent.\n\nThe figures indicate that Woolworths' sales growth momentum slowed in September, as same-store sales grew at an unprecedented 7.5 per cent in July and August.\n\nWoolworths has now outperformed Coles for 11 of the past 12 quarters.\n\nHowever, analysts expect Woolworths' same-store food sales to return to a more \"normal\" 4 per cent in the December quarter.\n\nTotal Australian supermarket sales rose 7.8 per cent to $10.7 billion, boosted by two new stores and seven refurbishments.\n\nNew Zealand supermarkets also performed well, with same-store sales rising 4.8 per cent and total sales by 4.6 per cent to $1.7 billion.\n\nAt Endeavour Drinks, which is soon to be fully merged with 75-per cent owned hotel and gaming business ALH, same-store sales rose 3.2 per cent after 1.7 per cent growth in the June quarter, with both BWS and Dan Murphy’s reporting solid growth.\n\nAt ALH, same-store sales grew 3.6 per cent and total sales by 5.5 per cent, driven by strong performances in food and bars.\n\nAdvertisement\n\nBig W continued to gain ground, although momentum slowed since the end of June, with same-store sales rising 4.4 per cent after 7.2 per cent growth in the fourth quarter of 2019.\n\nChief executive Brad Banducci said the results were pleasing.\n\n\"We are pleased with trading in the year to date and preparations for the Christmas period are well progressed,\" he said.\n\n\"We remain focused on providing the best possible customer experience across all of our businesses as we manage a material change agenda in the first half including the implementation of our new customer operating model in Woolworths supermarkets, the rollout of Fresh Made Easy and the ramp-up of the [automated distribution centre].\"\n\nCustomer metrics in Australian supermarkets went backwards, with net promoter score slipping from 50 to 49 and store controllable voice of the customer, a shopper scorecard that measures satisfaction with basics such as trolleys, service, prices, on-shelf availability, checkout queues and the quality of the fruit and vegetables, slipping from 82 per cent to 80 per cent.\n\nThe new store operating model, which has led to significant disruption for suppliers and staff, may have contributed to this decline.\n\nHowever, Mr Banducci said no one factor led to the slight softening in the scores, citing for example, the time it took checkout staff to hand out Discovery Garden seedlings.\n\nCustomer transactions rose 2.8 per cent and items per basket rose 4.7 per cent, fuelled by the collectable programs and online shopping, where orders tend to be bigger than in-store purchases.\n\nmore to come...", "description": "Same-store supermarket sales grew 6.6 per cent as shoppers flocked to stores for free Lion King ooshies and plant seedlings.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.5298%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_109/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/f7850987f504c69d6af59faa6183d28319854594", "published_at": "2019-10-29"}