{"pub": "guardian", "url": "https://theguardian.com/culture/2019/oct/01/stephen-colbert-trump-seth-meyers-trevor-noah", "downloaded_at": "2019-10-02 00:36:36.741565+00:00", "title": "Stephen Colbert: Trump trying to 'confuse everyone about a very simple story'", "language": "en", "text": "Stephen Colbert\n\nThe pressure of the impeachment inquiry is clearly getting to Donald Trump, said Stephen Colbert on Monday’s Late Show. This weekend, “the president and his allies all journeyed to the mountains of madness, where all meaning was devoured in the cavernous maw of stupid, and they all got on the crazy train for one reason: to try to confuse everyone about a very simple story”, joked Colbert.\n\nThat story is called Don and the Giant Impeach, and it goes like this: “Once upon a time, Donald Trump called the president of Ukraine and asked the foreign leader to investigate Joe Biden. The end.”\n\nIt should also be the end “of his presidency, you would think”, Colbert said, especially after an abridged transcript, released by the White House, of a phone call between Trump and the Ukrainian president, Volodymyr Zelenskiy, seemed to confirm allegations from a whistleblower in the intelligence community.\n\n'Wild west of the drug industry': John Oliver takes on compounding pharmacies Read more\n\nOver the weekend, Trump went after the whistleblower, whose identity remains legally protected. “You know the phrase: hey, don’t kill the messenger?” Colbert asked. “Trump doesn’t know that phrase.”\n\nTrump tweeted, for instance, that he deserved to meet his accuser. Colbert issued a slight correction: “You only have the right to meet your accuser in a court of law. And I certainly hope you get that opportunity.”\n\nSeth Meyers\n\n“Reality is catching up with Trump as Democrats move forward with their impeachment inquiry and support for impeachment rises in the polls,” said Seth Meyers on Late Night. “And in response to all that, Trump is predictably losing his mind.”\n\nMeyers recapped a weekend of paranoid Trump tweets, including the president’s threats to punish the whistleblower who reported the Ukraine call and alleged cover-up to Congress.\n\nTrump’s rhetoric was “dangerous”, said Meyers. “The president is threatening arrest and imprisonment for people who dare to investigate his abuses of power. The only thing stopping our system from collapsing is that everyone just ignores him.\n\n“We’ve all gotten to the point where we just have to treat the president of the United States like a guy taking a shit in the subway car,” Meyers said. “At some point, everyone’s just gonna move to the other end of the country.”\n\nMeanwhile, Trump loyalists made the rounds on cable talkshows, especially Rudy Giuliani, the president’s personal lawyer who is directly named in the whistleblower complaint. Meyers showed a clip from ABC’s This Week in which Giuliani, asked if he would acquiesce to congressional subpoenas, answered: “That is a question with a lot, a lot of implications. Believe it or not, I’m an attorney.”\n\nJimmy Kimmel on Trump's whistleblower: 'If this isn't it, nothing will be' Read more\n\n“I do not believe it,” Meyers answered. “I think you are a bunch of body parts sewn together and brought to life in a laboratory, and maybe, just maybe, some of the body parts were from attorneys.”\n\nLater on Fox News, Giuliani showed text messages discussing the Trump-Zelenskiy call from the state department official Kurt Volker and said: “The whistleblower falsely alleges that I was operating on my own. Well, I wasn’t operating on my own.”\n\n“I like that Rudy is trying to smear the whistleblower by pointing out the crimes they didn’t report,” said Meyers.\n\nTrevor Noah\n\nThe Daily Show (@TheDailyShow) What started as a scandal involving a call to Ukraine is now snowballing bigly. pic.twitter.com/uDmuse0Sz2\n\nOn the Daily Show, Trevor Noah turned to another arm of the impeachment investigation: a report from the New York Times, later confirmed by NBC News, that Trump pressured the Australian prime minister to help him discredit the Mueller report. The report is bad for “two reasons”, said Noah. “One, because it would mean Trump has been using the presidency as his personal vendetta machine. And two, it also means he’s been using world leaders as his personal errand boys.”\n\nThe Australia story demonstrates, Noah said, “that what started as a scandal about a call to Ukraine is now snowballing bigly”. Democrats are moving to impeach, and polls are showing more Americans in favor of “proceedings to impeach his ass”. But luckily for Trump, “there’s a group of supporters that will never leave his side, and those are Republican lawmakers”.\n\nNoah recapped a laundry list of Trump loyalists deployed to defend the president by going after the whistleblower or, in the case of the House minority leader, Kevin McCarthy, falsely accusing a news anchor of adding “though” to “I want you to do us a favor, though,” from the Ukrainian call notes.\n\n“It’s no surprise most Republican lawmakers are standing with President Trump,” Noah surmised. “But what is a little surprising is that they’re arguing that not only did Trump not do anything wrong, but the real bad guy here is the one who reported the crime in the first place.”", "description": "Late-night hosts battle a barrage of paranoid Trump tweets and Republican defenses as the impeachment investigation snowballs", "authors": ["Adrian Horton"], "top_image": "https://i.guim.co.uk/img/media/321941ca9f6ccbd5a294b35526a54d234b4f857e/74_0_1502_901/master/1502.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=74a7f75ce9c4ac0d7563ef505e83789d", "published_at": "2019-10-01"}