{"pub": "fox", "url": "https://foxnews.com/us/florida-human-remains-ocala-national-forest-hunting", "downloaded_at": "2019-10-23 08:43:45.736605+00:00", "title": "Florida hunter discovers human remains at Ocala National Forest: Smelled 'like death'", "language": "en", "text": "A Florida man discovered human remains at Ocala National Forest on Sunday when he happened upon a suspicious-looking area that smelled “like death,” authorities said.\n\nA man whom investigators didn’t name was hunting deer with friends on Oct. 15 when he found what he thought were deer scratchings on the ground deep into a trail, according to an incident report from the Marion County Sheriff’s Office.\n\nCALIFORNIA HIKERS UNEARTH 'MYSTERY' HUMAN SKELTON BENEATH SECOND-HIGHEST PEAK\n\nThe hunter told deputies he returned Sunday and found leaves covering the disturbed area. He thought it looked suspicious and asked his friend to bring him a shovel, according to the report.\n\nWhen the man started digging, he told deputies the area “smelled really bad, like death.”\n\nHe then called a Florida Fish and Wildlife officer, who contacted the sheriff’s office.\n\nDetectives said it was still an active investigation and further details, including the identity of the remains, will not be immediately released. Authorities said they will provide an update when more information becomes available.\n\nCLICK HERE FOR THE FOX NEWS APP\n\nThe sheriff’s office asked anyone with information to contact Detective O’Cull at (352)‐732‐9111 or leave an anonymous tip with the Crime Stoppers of Marion County at (352)‐368‐STOP or (352)‐368‐7867.", "description": "A Florida man discovered human remains at Ocala National Forest on Sunday when he happened upon a suspicious-looking area that smelled “like death,” authorities said.", "authors": ["Stephen Sorace"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/ocala-national-park-body-found1.jpg", "published_at": "2019-10-22"}