{"pub": "yahoo", "url": "https://uk.style.yahoo.com/rail-ship-foot-8-epic-080000130.html", "downloaded_at": "2019-09-15 09:22:48.054167+00:00", "title": "By rail, ship and on foot - 8 epic ways to explore Australia", "language": "en", "text": "Dreaming of an Australian adventure? With over 2.9 million square miles to explore, this vast stretch of land has a journey to suit almost everyone's travel taste.\n\nWith trips to please cruise aficionados, veteran hikers, rail enthusiasts or road trippers, here are some of the continent's greatest journeys.\n\n1. Ride The Ghan railway\n\nJourney through Australia’s “red centre” on this 1,851 mile line from Adelaide to Darwin via Alice Springs. The Ghan has been dubbed Australia’s Greatest Train Journey by Telegraph Travel – and it's a comfortable ride. The name is said to honour the Afghan camel drivers that arrived in Australia in the late 19th century with animals imported from India. Along the way you’ll see the farming country of the Adelaide Plains, the Spencer-Gulf inlet and sand hills and scrub forest.\n\n\n\nTelegraph Travel writer Anthony Lambert calls the country’s red centre “one of the most charismatic wildernesses in the world”. In Katherine, you can stop for a lengthy boat ride between the limestone walls of Nitmiluk Gorge and Alice Springs. The journey is 54 hours long, so settle in for the ride.\n\n\n\nThe Ghan, between Adelaide and Darwin, starts from $1,919/£1,067 (journeybeyondrail.com.au).\n\n\n\n\n\n\n\n\n\n2. Take the Australind to lunch\n\nTravel in style on this narrow-gauge railway service, which travels twice a day between Bunbury (the gateway to Australia’s South West) and Perth, is 112 miles and two and a half hours long. Soak up the window views of an area renowned for its fruit growing and wildflower collection – it has over 12,000 species. Catch the blanket of colour during the six-month flowering season, which starts around June.\n\nThen, enjoy a leisurely meal about half way along your route at Pinjarra, the junction for the Hotham Valley Tourist Railway. Here, you’ll find a 1919-built dining-car train serving five-course meals. Banbury itself offers up historic buildings and a centre for bottlenose dophins.\n\nThe Australind runs twice daily between Banbury and Perth and costs £38 return (transwa.wa.gov.au).\n\n3. Cruise the Murray on a paddlesteamer\n\nNearly 1,600 miles long, the Murray river is steeped in aboriginal history (with more to be unearthed). It’s also ripe for wildlife spotting. The river winds through New South Wales, Victoria and South Australia.\n\n\n\nForming the border between Victoria and New South Wales is the Barmah-Millewa forest. Here you could enjoy the sound of the kookaburra in gum trees or watch kangaroos bounce along the banks. With 236 bird species and 50 mammals in this region there's plenty of wildlife spotting to be done. Drink it all in on one of the world’s last wood-fired cruising paddle steamers – the Emmylou, which has all the trappings of a 19th-century vessel.\n\n\n\n\n\nFour-night round-trip cruises from Echuca on the Murray River are available aboard the PS Emmylou, starting from £1,519 (murrayriverpaddlesteamers.com.au).\n\nA trek of epic proportions: the Larapinta Trail Credit: Getty More\n\n4. Trek the Larapinta Trail\n\nItchy feet? Take to a trail instead, specifically the Larapinta Trail. This 140-mile hiking route is ideal for those seeking to escape the crowds. The route cuts west from the outback town of Alice Springs to Mount Sonde. When not clocking up the miles, you could take a dip in a cool waterhole, before setting up camp beneath the stars. Make it (relatively) easy for yourself on Australian Walking Holidays' six-day trek. You’ll stay in semi-permanent camps, while still putting in the rigours of a long walk.\n\nStory continues", "description": "Dreaming of an Australian adventure? With over 2.9 million square miles to explore, this vast stretch of land has a journey to suit almost everyone's travel taste.", "authors": ["Telegraph Travel"], "top_image": "https://s.yimg.com/uu/api/res/1.2/u.mkHwTBTDEBEdY6bO.mAQ--~B/aD0xMjI2O3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_818/c733d7b2b8346b8144768f39560d630b", "published_at": "2019-09-15"}