{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/kate-wrights-wedding-moment-shell-20535605", "downloaded_at": "2019-10-08 11:39:57.328562+00:00", "title": "as she glides down water aisle to Rio Ferdinand", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nKate Wright lifted the lid on the wedding moment she would never forget.\n\nThe blushing bride, 27, cherished the moment she sashayed down the impressive water aisle towards her love Rio Ferdinand , 40, in Turkey.\n\nIn the astonishing snap, the former TOWIE bombshell could be seen floating down the aisle flanked by Rio's sons Lorenz, 13, and Tate, 11.\n\nThe dad-of-three could be seen looking on with love at his bride as she made her way towards him.\n\nRio stood under the amazing arch which had a mirrored structure and white flowers were cascading down over the frame.\n\nShe wrote: \"There were so many special moments at our wedding... But this is one I will never forget.\"\n\nKate added the hashtags \"proud\" and \"myboys\" to the Instagram post.\n\nThis is the very same moment that made Rio break down in tears during the glittering ceremony.\n\n(Image: Instagram)\n\nIn the first interview about the wedding, the dad-of-three admitted he got \"so emotional\" when he saw his daughter Tia, eight, walk down the aisle before seeing his stunning new bride.\n\nHe told OK! magazine : “I cried as soon as the day started. Seeing Tia walk up the aisle before Kate set me off. It was just so emotional.\n\n\"There was just no going back on the emotion, that’s why I had to keep my shades on!\n\n(Image: Instagram)\n\n\"Seeing Tate and Lorenz walk Kate down the aisle was particularly poignant and we wouldn’t have wanted to do it any other way.\n\n\"They were so proud and they couldn’t wait to do that, they felt important.\"\n\nKate was walked down the first half of the aisle by her previously estranged dad Phil Wright.\n\n(Image: Instagram)\n\nThe electrician celebrated his daughter's big day as he revealed the \"amazing wedding\" brought him closer to his daughter.\n\nHe told The Sun On Sunday : \"It was an amazing wedding and I felt very proud.\n\n“There has been a lot of emotion all round . . . it’s been a mad few days.”\n\nKate has legally changed her maiden name Wright to Ferdinand after the ceremony.\n\nThe newly-weds jetted straight back to the UK as Rio returned to work as a sports pundit.\n\nThey didn't slack on their exercise either as the couple hit the gym just four days after their nuptials.", "description": "Kate shared her very favourite moment from the wedding and it was incredible how she glided down an aisle made to look as though it was water", "authors": ["Lily Waddell", "Image", "Instagram"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20385365.ece/ALTERNATES/s1200/3_Kate-Wright.jpg", "published_at": "2019-10-08"}