{"pub": "marketwatch", "url": "https://marketwatch.com/story/how-trump-came-to-see-ukraine-as-adversary-rather-than-ally-a-view-that-aligns-with-those-of-putin-and-orban-2019-10-22", "downloaded_at": "2019-10-22 15:36:35.529339+00:00", "title": "How Trump came to see Ukraine as adversary rather than ally — a view that aligns with those of Putin and Orbán", "language": "en", "text": "WASHINGTON (AP) — Behind closed doors, President Donald Trump has made his views on Ukraine clear: “They tried to take me down.”\n\nThe president, according to people familiar with testimony in the House impeachment investigation, sees the Eastern European ally, not Russia, as responsible for the interference in the 2016 election that was investigated by special counsel Robert Mueller.\n\nIt’s a view denied by the intelligence community, at odds with U.S. foreign policy and dismissed by many of Trump’s fellow Republicans but part of a broader skepticism of Ukraine being shared with Trump by Russian President Vladimir Putin and his key regional ally Viktor Orbán of Hungary.\n\nTrump’s embrace of an alternative view of Ukraine suggests the extent to which his approach to Kyiv — including his request, now central to the impeachment inquiry, that the Ukraine president do him a “favor” and investigate Democrats — was colored by a long-running, unproven conspiracy theory that has circulated online and in some corners of conservative media.\n\nOn Monday, Trump derided the impeachment probe anew as a “witch hunt,” insisting that he did nothing wrong in his phone call with Ukrainian President Volodymyr Zelensky.\n\nAssociated Press U.S. President Donald Trump meets with Ukrainian President Volodymyr Zelensky on Sept. 25 during the United Nations General Assembly.\n\nSee: Pence counseled against release of transcript of Trump call with Ukraine’s Zelensky\n\nBut those testifying in the impeachment inquiry, now entering its fifth week, are recalling that Trump’s views on Ukraine were seen as a problem by some in the administration.\n\nSome of those testifying recalled a May meeting at the White House when U.S. officials, just back from attending Zelensky’s inauguration in Kyiv, briefed Trump.\n\nAmbassador to the European Union Gordon Sondland, special envoy Kurt Volker and other witnesses have described Trump as suspicious of Ukraine despite well-established American support for the fledgling democracy there. That’s according to publicly released transcripts, as well as people familiar with the private testimony to impeachment investigators. They spoke on the condition of anonymity to discuss it.\n\nSeveral witnesses have testified that Trump believed Ukraine wanted to destroy his presidency.\n\nOne career State Department official, George Kent, told lawmakers that Putin and Orbán had soured Trump’s attitude toward Ukraine. Russia and Ukraine have been foes since Putin’s invasion of Crimea in 2014, as Kyiv tries to align with the West, while Putin and Orban grow closer.\n\n“President Trump was skeptical,” Sondland testified, according to his written remarks. Sondland said that only later did he understand that Trump, by connecting the Ukrainians with his personal lawyer Rudy Giuliani, was interested in probing the 2016 election as well as the family of his potential 2020 rival, Joe Biden.\n\nSee: Jovanovitch tells Congress that Trump pushed State Department to oust her as ambassador to Ukraine\n\n“It was apparent to all of us that the key to changing President Trump’s mind on Ukraine was Mr. Giuliani.”\n\nHouse Democrats launched the impeachment inquiry after a whistleblower filed a complaint that included Trump’s July call with Zelensky. The call was placed the day after Mueller testified to Congress and brought an end to the two-year Trump-Russia probe.\n\n“Our country has been through a lot and Ukraine knows a lot about it,” Trump told Zelensky, according to a rough transcript of the call released by the White House.\n\n“I would like you to find out what happened with this whole situation with Ukraine, they say CrowdStrike,” Trump said. “The server, they say Ukraine has it.”\n\nTrump was airing the conspiracy-theory view, shared by Giuliani, that the security firm CrowdStrike, which was hired by the Democratic National Committee to investigate the 2016 hack of its email, may have had ties to Ukraine.\n\nSee: ‘We are an independent country’: Zelensky says Ukraine cannot be ordered to probe Biden\n\nCrowdStrike determined in June 2016 that Russian agents had broken into the committee’s network and stolen emails that were subsequently published by WikiLeaks. The firm’s findings were confirmed by FBI investigators and helped lead to Mueller’s indictments of 12 individuals from Russia’s military intelligence agency.\n\n‘I’ve never been a CrowdStrike fan — I mean, this whole thing of a server.’ Rep. Mark Meadows, a North Carolina Republican\n\nBut the loose conspiracy theory contends that the DNC email hack was a setup, bolstered by fake computer records, designed to cast blame on Russia. Even the president’s Republican allies have tried to dissuade Trump from it.\n\n“I’ve never been a CrowdStrike fan — I mean, this whole thing of a server,” said Republican Rep. Mark Meadows of North Carolina last week.\n\nMeadows, a confidant of Trump, said he’s sure Ukraine had some role in the U.S. election. But he views the search for the email server as farfetched. “I would not, on my dime, send a private attorney looking for some server in a foreign country,” Meadows told reporters.\n\nPerhaps contributing to the conspiracy theories surrounding CrowdStrike and the DNC is the fact that the FBI never took possession of the actual computer server that would have held the hacked emails.\n\nInstead, the FBI relied on the forensics provided by CrowdStrike.\n\nThe FBI had “repeatedly stressed” to the DNC its desire to have access to servers, former FBI Director James Comey testified at a March 2017 hearing before a House panel. But he acknowledged it is not unusual for the FBI to use such forensics in place of the actual hard drive during cyber investigations.\n\nOther Republicans have also tried to convince Trump it was not Ukraine that was involved.\n\nTrump’s former homeland-security adviser, Tom Bossert, said Giuliani had done Trump a disservice by pushing the false story.\n\n“I am deeply frustrated with what he and the legal team is doing and repeating that debunked theory to the president,” Bossert said in September on ABC. “It sticks in his mind when he hears it over and over again,” said Bossert, who also was an adviser to President George W. Bush. “That conspiracy theory has got to go. They have to stop with that. It cannot continue to be repeated.”\n\nOn the call, Trump went on to ask Zelensky to also look into Burisma, the Ukraine gas company on whose board of directors Biden’s son Hunter served when the then–vice president was the Obama administration’s main emissary to Ukraine.\n\nLast week, Trump’s acting chief of staff, Mick Mulvaney, acknowledged that Trump essentially engaged in a quid pro quo in seeking Zelensky’s help in exchange for military aid the White House was withholding from Ukraine.\n\nMulvaney said the request was not improper because Trump wanted help with the 2016 investigation rather than looking ahead to 2020. It is against the law to seek or receive help of value from a foreign entity in U.S. elections.\n\nMulvaney later revised his comments, saying, “The president never told me to withhold any money until the Ukrainians did anything related to the server.”", "description": "Behind closed doors, President Donald Trump has made his views on Ukraine clear: “They tried to take me down.”", "authors": ["Associated Press"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS338_trump__ZG_20190930154540.jpg", "published_at": "2019-10-22"}