{"pub": "bbc", "url": "https://bbc.com/news/business-50175594", "downloaded_at": "2019-10-24 23:59:46.187407+00:00", "title": "In the war on plastic is Coca-Cola friend or foe?", "language": "en", "text": "Media playback is unsupported on your device Media caption For many, the Coca-Cola brand now stands for plastic pollution and childhood obesity.\n\nThere was a time for people of certain generations (including mine) when Coca-Cola was associated with teaching the world to sing.\n\nThe famous 1970s song by the New Seekers was reprised in the hit show Mad Men, when advertising guru Don Draper had an epiphany on a hippie retreat about how to sell the fizzy drink as a symbol for global harmony.\n\nTimes have changed.\n\nFor many people, the Coca-Cola brand now stands for plastic pollution and childhood obesity.\n\nBut talking to the BBC, global chief executive James Quincey insists that in the battle against public harms, Coca-Cola is a friend rather than a foe.\n\nThat is a bold claim for the head of a company that produces over 100 billion plastic bottles a year.\n\nA recent global audit found there was more Coca Cola plastic waste in our environment than the next three big consumer companies combined. James Quincey insists the company is moving in the right direction.\n\nImage copyright Getty Images Image caption One of the firm's biggest growth areas is low-sugar drinks\n\n\"We aim to recover every bottle for every one we sell by 2030. And then to use 50% of them back in our own bottles. Where are we now? Well, we already recovered 59% of our bottles, and we already use 9% of our bottles back in the bottle.\"\n\nRecovering and recycling 59% of your own plastic waste is not nothing.\n\nBut that leaves 40 billion bottles out there. Every year.\n\nJames Quincey concedes there is a long way to go. He admits that Coca-Cola has no plans to reduce its own use of plastic but says 50% of its new plastic production will come from recycled bottles. Why not 100% ?\n\n'Substantial number'\n\n\"We actually compete with other industries to use recycled plastic. There are lots of industries that depend on buying recycled plastic.\"\n\nAs a market leader with over $40bn in annual revenues, many would think that Coca Cola could afford to outbid others for the renewable plastic on sale.\n\nSo just how much of that $40bn in sales is Coca Cola spending on its various environmental initiatives?\n\nMr Quincey seems unsure.\n\n\"It's a very substantial number. I don't have, I mean, I don't have a number, we're setting an ambition. We're saying, look, we're going to get there. If I were to say 1%, rather than 2%, or 0.1%. That seems to imply that there's some number which are not going to do it. No, it's the other way around. We're going to find a way of doing it and work out how to do it and still have a business.\"\n\nImage copyright Getty Images Image caption Coca-Cola produces over 100 billion plastic bottles a year\n\nCoca-Cola doesn't just sell calorific fizzy drinks. Its biggest growth areas are in zero-sugar formulations of Coca-Cola and its water and juice businesses.\n\nHowever, Coca-Cola is the blockbuster fizzy drink and numerous studies have fingered those drinks as a major cause of what some describe as an obesity epidemic. In a policy response, the UK government introduced a sugar tax in 2016.\n\nA recently-published report by Public Health England highlighted how the UK levy resulted in reductions in the sugar content of sugary drinks - a 29% reduction per 100ml in retailer own-brand and manufacturer-branded products. And it has also pushed consumers towards low or zero-sugar products.\n\nSo the sugar tax has been a great success, right?\n\nMr Quincey feels uncomfortable with this conclusion. Obesity hasn't gone down and there are plenty of other things that make you fat.\n\nImage caption Coca-Cola CEO James Quincey insists that in the battle against public harms, Coca-Cola is a friend rather than a foe.\n\n\"If the stated objective is solving the obesity crisis, it doesn't seem to me that attacks over a narrow category is solving the crisis, I think there needs to be a much more comprehensive approach. Whether that involves fiscal measures across more categories or whatever it is.\"\n\nTime for a cake or biscuit tax maybe?\n\nMr Quincey is keen to show me new plastic bottles made from plastic retrieved from the sea. Or, sort of. The retrieved bit makes up around 25% of the total plastic content.\n\nThere is a reason that Coca Cola is the biggest plastic polluter in the world. It's the most successful consumer drinks company in the world. The interesting word in that sentence is \"consumer\". The choice ultimately is ours. We don't have to drink this stuff and chuck the bottles indiscriminately.\n\nCoca-Cola may be one of the biggest baddies - but by virtue of its scale it can arguably affect the most change.\n\nA 5% reduction in plastic use at Coke means 500 million fewer bottles. Try achieving that at a local level.\n\nAs with the fossil fuel sector, powerful incumbents, and their customers, often hold the key to real change.", "description": "For many people, the Coca-Cola brand now stands for plastic pollution and childhood obesity.", "authors": ["Simon Jack", "Business Editor"], "top_image": "https://ichef.bbci.co.uk/images/ic/1024x576/p07rzrz3.jpg", "published_at": "2019-10-24"}