{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7572883/Married-Sight-2020-Lesbian-couple-Amanda-Tash-appear.html", "downloaded_at": "2019-10-14 23:24:57.845324+00:00", "title": "Married At First Sight 2020: Lesbian couple Amanda and Tash to appear", "language": "en", "text": "Married At First Sight's highly anticipated seventh season will feature the show's first ever same-sex female couple.\n\nMelbourne-based bodybuilder Amanda Micallef, 34, said 'I do' to heavily tattooed model Tash Herz in a lavish ceremony last month as filming commenced.\n\nThe show is currently half-way through production in Sydney, and is expected to premiere across Australia on Nine at the end of January.\n\nMarried At First Sight's upcoming seventh season will feature the show's first ever lesbian couple, bodybuilder Amanda Micallef (left) and tattooed model Tash Herz (right)\n\nAmanda and Tash's inclusion comes after fans of the social experiment have long called for more LGBTQ representation on the show.\n\nSince premiering in 2015, MAFS has only featured one gay couple, Craig Roach and Andy Ankers in season three, who did not stay together.\n\nAlthough little is known about Amanda and Tash's relationship so far, the couple are both similar aged and appear passionate about health and fitness.\n\nFitness fanatic: Bodybuilder Amanda, 34, (pictured) describes herself as a 'strength, physique and mindset coach', and has her own personal training business, Divine Physiques Coaching\n\nSpiritual: Amanda also had a 'mindset' podcast, and is followed on Instagram by former cast member Dino Hira, who is best known for his spiritual side. Pictured: Amanda with a client\n\nBodybuilder Amanda describes herself as a 'strength, physique and mindset coach', and has her own personal training business, Divine Physiques Coaching.\n\nShe also has a 'mindset' podcast, and is followed on Instagram by former cast member Dino Hira, who is best known for his spiritual side.\n\nIn 2011, The Australian reported that Tash works as a 'body-piercer and an alternative burlesque performer' as she competed in Miss Ink tattoo beauty pageant.\n\nAlternative: In 2011, The Australian reported that Tash works as a 'body-piercer and an alternative burlesque performer' as she competed in Miss Ink tattoo beauty pageant\n\nBody art: Tash (pictured) is certainly not shy, having previously done racy lingerie shoots showcasing her body art, which she describes as a constant 'work in progress'\n\nSocial media influencers in the making? Tash (pictured) currently has 7,400 Instagram followers, whereas Amanda has 3,600\n\nTash is certainly not shy, having previously done racy lingerie shoots showcasing her body art, which she describes as a constant 'work in progress'.\n\nInterestingly, she is followed on Instagram by season six's Nic Jovanovic, suggesting many of the new cast members may have links to last year's stars.\n\nTash currently has 7,400 Instagram followers, whereas Amanda has 3,600.\n\nDaily Mail Australia has contacted Channel Nine for comment.", "description": "Married At First Sight's highly anticipated  seventh season will feature the show's first ever same-sex female couple.", "authors": ["Joshua Fox For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/23/19714692-0-image-a-17_1571093418673.jpg", "published_at": "2019-10-14"}