{"pub": "politico", "url": "https://politico.eu/author/clara-serrano-marketing-leader-corteva-agriscience", "downloaded_at": "2019-10-15 08:01:08.584598+00:00", "title": "Celebrating women in agriculture", "language": "en", "text": "via Corteva Agriscience Sponsored Content Celebrating women in agriculture As worldwide events take place to celebrate the International Day of Rural Women (Tuesday 15 October) it is more important than ever to keep moving toward more gender-balanced agriculture\n\nAs farmers adapt to a new agricultural landscape and look at ways to overcome environmental challenges while meeting consumer demands for more and better-quality food, it is now more important than ever to mobilize the entire rural workforce — especially women.\n\nWomen in agriculture play a vital role in society, and a wide-reaching study conducted by Corteva Agriscience last year found that women are all too often subject to gender discrimination which stops them from meeting their potential, stunting their ability to grow what matters.\n\nAs our study showed, the pay gap persists, and almost three-quarters of women believe it will take 30 years or more to achieve full equality for women in agriculture. That is simply too long. Change is needed now if we are to help farmers produce the quality and quantity of food that is required for a growing population of demanding consumers.\n\nOn October 15, I am taking part in an event at the European Parliament to celebrate the International Day of Rural Women (IDRW). Now in its 11th year, IDRW is a chance to reflect on progress towards gender equality and on the challenges that remain. I’m excited to join MEPs, farmers and other stakeholders at the event organized by the Copa-Cogeca farming union to discuss issues such as business development for women and gender balance in farming schools.\n\nIf female farmers are to keep up with societal demand for a more sustainable agriculture, they need to be well versed in practical agronomy education on the latest technological solutions.\n\nAs the European Parliament report on the professional status of rural women in the EU shows, more business education and training is needed for women in rural areas. According to the report, this training should be personalized and focused on making business plans, developing leadership skills and bookkeeping. And if female farmers are to keep up with societal demand for a more sustainable agriculture, they need to be well versed in practical agronomy education on the latest technological solutions. This is an area in which Corteva hopes to contribute — using the expertise and passion of our people to promote change and enhance agricultural education for women.\n\nWe talked to Polish farmer Magdalena Węgiel, who is among those calling on policymakers to step up and show real support for rural women. Magdalena struggled against gender bias in the industry when she and her daughter bought and established the trout farm Pstrąg Ojcowski in a national park in southern Poland, rescuing the traditional trout farm ponds there, which had come under threat of abandonment in 2014.\n\n“The European Union should increase the visibility of women in agriculture, thus contributing to them becoming more active and self-confident,” said Ms Węgiel. “This is a very important issue because if rural women are strong, Europe will also be strong.”\n\nMagdalena went on to win one of the prestigious Copa-Cogeca 2018 Innovation Awards for Women Farmers, for her efforts in bringing trout farming back to her region. Her goals also include propagating conscious and ethical farming practices, educating society in local history and culinary traditions, and helping other women in her village to achieve their career goals.\n\n“This is a very important issue because if rural women are strong, Europe will also be strong.”\n\nCorteva’s purpose is to enrich the lives of those who produce and those who consume, ensuring progress for generations to come. That means removing barriers to full equality, and we are actively pursuing concrete steps which include research and direct action, as well as partnering with governments, NGOs and other groups, so that women farmers can flourish alongside men.\n\nTalentA is one such initiative, a collaboration between Corteva Spain and the Federation of Rural Women Associations in Spain. We are inviting women entrepreneurs working in agriculture or the agrifood sector across the rural regions of Spain to submit their innovative business ideas. A jury of agricultural experts will select two finalists who will receive substantial training opportunities, and a grand winner who will be awarded financial support.\n\nIt has never been more important to identify the challenges and remove the barriers to women’s full and equal participation in the agricultural economy. Empowering women farmers and those interested in working in agriculture could help revive rural areas, while meeting the rising demand for food. If we are not able to remove the challenges that women farmers are facing, we will all be struggling together, since the consequences also affect the people who need them: their families, their communities and the societies that depend on them for food and more.\n\nAuthors:", "description": "As worldwide events take place to celebrate the International Day of Rural Women (Tuesday 15 October) it is more important than ever to keep moving toward more gender-balanced agriculture", "authors": ["Clara Serrano", "Marketing Leader Europe", "Corteva Agriscience"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/10/Ojców-9075-1200x628.jpg", "published_at": "2019-10-15"}