{"pub": "nymag", "url": "https://vulture.com/2019/10/the-good-place-season-4-episode-3-recap-chillaxing.html", "downloaded_at": "2019-10-11 02:27:27.955889+00:00", "title": "The Good Place Recap: Beats on Repeat", "language": "en", "text": "The Good Place Chillaxing Season 4 Episode 3 Editor’s Rating 3 stars * * * * * « Previous Next Photo: Colleen Hayes/NBC\n\nWhenever the producers of a heavily serialized television show announce an end-date to the series, fans tend to expect that, with a finish line in mind, the writers will start treating each episode with a little more urgency, not wanting to waste a single remaining minute. But the reality is that TV is still TV. It’s a storytelling medium broken up by the rigid demands of scheduling and time slots, where the needs of the narrative are sometimes undercut by the need to fill 22 or 44 minutes — and no more.\n\nAll of this is a prelude to saying that The Good Place’s latest chapter seems awfully slight, at least in comparison to this show at its craziest and most ambitious. But perhaps’s that’s to be expected. Even the most inventive television plots require at least some laborious set-up.\n\nThis week’s episode primarily completes the thoughts begun in the two-part season premiere. “A Girl from Arizona” introduced the remaining participants in the new Neighborhood experiment, and gave Eleanor a head start on bringing Brent and Simone into line. This week, Tahani deals with her John problem, while the rest of the gang handles Chidi, who’s become an unexpected complication. Most of the half-hour feels like housekeeping, meant to get this final season ready for its real action… which is teased by a closing image of a hooded figure on a railroad hand-car, moving rapidly toward our heroes.\n\nThe scary hooded thing will have to wait, though. This episode is more aptly called “Chillaxing,” which is a new(ish) portmanteau coined by Michael, combining “Chidi” and “relaxing.” It describes the state Chidi’s in when this story begins: Happy and untroubled in paradise, and not bothered in the least when Brent bails on his ethics class after one session. (It turns out that the B+ Princeton student thinks he should be leading the class, not taking it.) Even when Eleanor tries to appeal to Chidi’ sense of responsibility, asking, “What would Kant say about your duty to help your fellow human beings?,” he waves her off and heads out for an afternoon of picnicking and frisbee golf.\n\nEleanor and Michael quickly realize their issue: They’ve never really known an unstressed Chidi. Figuring they can only motivate him through irritation (“Gotta get some sand in your clam,” Eleanor says, misunderstanding how pearls are made), they bring Jason off the bench for the perfect pinch-hitting role. Replicating some of the conditions of the original experiment, they have Jason confess to Chidi that he’s not really a Buddhist monk, forcing the ethicist to wrestle with whether his obligation is to be honest or to protect his new friend from eternal torture.\n\nThe funniest parts of “Chillaxing” — which are too scant, frankly — involve the Odd Couple relationship between the freewheeling, impulse-driven Jason and the micromanaging Chidi, who scrambles to cover for the Jacksonville DJ’s “bud hole” lifestyle. The breaking point for our man comes during a Neighborhood luau, where the residents each throw a magic lava stone into a bonfire and receive their truest desire. For Jason, this turns out to be a vehicle he accurately describes as “the Pam Anderson boob-motorcycle” — which an embarrassed Chidi then has to claim as his own, lest his “monk” pal be exposed. Defeated, Chidi slumps into the Architect’s office to confess everything, at which point Eleanor realizes she’s been having too much fun torturing the guy she loves, and bursts into tears. (“Oh no, I made God cry,” Chidi laments.)\n\nThis storyline has the desired effect of getting Chidi into gear. By the end of the episode, with a little encouragement from Michael, his spirits are lifted just enough for him to resume his ethics class. But what’s most fun about these scenes is they give Jason a chance to be a hilarious Florida dirtbag again. (He even gets to throw his magic lava stone like a molotov cocktail!) The episode’s funniest moment comes when Chidi lies and says he’s upset about his new motorcycle, which — in a quick cutaway shot — Michael immediately explodes, prompting Jason to whine, “Aw, not again.” That’s some good Good Place right there.\n\nSimilarly, the best bits of the John storyline let Tahani be Tahani. While trying to befriend the gossip columnist who used to torment her, she determines that a man who once searched the web for “something called a ‘discount hotel package’” might appreciate the chance to live the insider’s life she knew so well on Earth. With Janet’s help, they have the ultimate “spa day.” They get treatments at a replica of Victoria Beckham’s private “Posh Wash.” They take the private Louvre tour where they get to touch the art. They even “rode Aquamens through the water.” Throughout, though, John remains catty, showing no remorse for how mean he was to the cool crowd when he was alive.\n\nTahini’s first impulse to get John to see the error of his ways is to “go on the attack, just like six of the eight Game of Thrones characters who are based on me would do.” But this just makes John snippier and more defensive. So instead she opens up about her own insecurities and status obsession, saying that her way of life left her “jealous and miserable with no real friends.” Finally, he starts to soften.\n\nAside from some primo Tahani name-dropping, this subplot is pretty pat, feeling at time more like a Saved by the Bell episode than a Good Place. (This week: Jessie and Kelly fake a fight to convince Lisa that gossiping is wrong!) Still, it’s encouraging that at the end of this chapter, Tahani resists putting John in Chidi’s ethics class, saying that human connection will be better for him than academic theory. That’s a genuinely new direction for these characters; and even though it’s early in the season, just about anything new is good. Three weeks into its final year, The Good Place has effectively reestablished its premise, its characters, and its setting. Now it’s time to bring in a little chaos.\n\nIn The Neighborhood\n\n• Jameela Jamil had kind of a rough week, with the social media outcry over her defense (and then her defense of her defense, and then her retraction of her original defense but her continuing defense of her defense of her defense) of the friendship between Ellen DeGeneres and former president George W. Bush. That whole brouhaha may cast Tahani’s efforts at magnanimously extending privilege to the unprivileged in a different light for some viewers. It shouldn’t. But it may.\n\n• Apparently the Good Place is populated by ants who improve picnics by helping with the clean up and supplying bottles of champagne. All hail the magic ants!\n\n• Subject lines of John’s blog posts about supermodels Gigi and Bella Hadid include, “Eat, Pray, Barf,” “I’ve Hadid Up To Here” and “Oh No She Hadidn’t! Gigi Ruins Bali Wedding By Being There!”\n\n• Janet is attempting to recover from her breakup with Jason by following the internet’s rebound suggestions. So far she’s put streaks of color in her hair and watched Mamma Mia: Here We Go Again. Of the latter, she says, “It was okay. It’s just a lot of the same songs as the first one.” A fair criticism!", "description": "Tahani deals with her John problem, while the rest of the gang handles  an unexpected complication: Chidi. A recap of ‘Chillaxing,’ episode 3 of season 4 of The Good Place on NBC.", "authors": ["Noel Murray"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/08/recaps/the-good-place.w1200.h630.jpg", "published_at": "2019-10-11"}