{"pub": "yahoo", "url": "https://news.yahoo.com/new-concussion-psa-tackle-can-wait-compares-youth-football-to-smoking-211057292.html", "downloaded_at": "2019-10-11 20:16:25.120694+00:00", "title": "Kids shown smoking cigarettes in shocking new PSA", "language": "en", "text": "A seemingly beautiful day filled with kids playing football turns dark in a new PSA that effectively compares the sport to smoking.\n\nThe spot, titled “Tackle Can Wait,” was created by the Concussion Legacy Foundation to encourage children under 14 to play flag football rather than the contact version of the sport.\n\nIn the PSA, a group of boys is playing football when one is tackled head-first onto the ground. Afterward, the coach hands out cigarettes to his young team.\n\n“Tackle football is like smoking,\" one boy says in voice-over. \"The younger I start, the longer I'm exposed to danger.\"\n\nThe video continues with stats from the Concussion Legacy Foundation, mentioning a claim that children who play tackle football at age five versus 14 are 10 times more likely to develop the degenerative brain disease chronic traumatic encephalopathy (CTE).\n\n“You wouldn’t let me smoke. When should I start tackling?” the young voice asks at the end of the video.\n\nIn an accompanying behind-the-scenes video, CLF co-founder Chris Nowinski says, “Tackle football is really a man's game, and it's incredibly dangerous to the developing brain.”\n\nSome states, including California, New York and Illinois, have discussed banning tackle football for children under 12.\n\nNowinski adds, “We now have the data that show that playing youth tackle football and developing CTE is correlated in a very similar way to smoking, and developing lung cancer. We're trying to help parents visualize that those two things are equally bad: Letting your kid smoke and letting your kid play tackle football are both bad ideas.\"\n\nThe foundation notes, “During filming, no players were allowed to tackle. A stunt coordinator oversaw the production as two certified teenage stunt actors simulated tackling.”\n\nAccording to the foundation, the ad released Thursday cost $126,095 to produce and many of the services were donated by those who have been affected by CTE, including the spot's creator, Angela Campigotto-Harrison. Her father, Joe Campigotto, played college football and developed stage 4 CTE even though he was never diagnosed with a concussion.\n\nThe referee is played by former San Francisco 49ers linebacker Chris Borland, who retired from the NFL at the age of 24 after suffering two diagnosed concussions and many other sub-concussive injuries.\n\n\"Waiting to play until later is better for the health of young athletes and obviously better for their brains,\" Borland says.\n\nRead more from Yahoo Lifestyle:\n\nFollow us on Instagram, Facebook, Twitter and Pinterest for nonstop inspiration delivered fresh to your feed, every day.\n\n\n\n", "description": "A seemingly beautiful day filled with kids playing football turns dark in a new PSA that effectively compares the sport to smoking.", "authors": ["Kelly Woo"], "top_image": "https://s.yimg.com/uu/api/res/1.2/BCL2aVfnkGqMTauJvOrC4g--~B/aD0xMDk4O3c9MTk2NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/13c0c2e0-eba2-11e9-b7ef-f7324f75df93", "published_at": "2019-10-10"}