{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7570769/Frozen-2-New-trailer-shows-Elsa-risk-losing-alluring-magical-powers.html", "downloaded_at": "2019-10-14 11:30:30.684968+00:00", "title": "Frozen 2: New trailer shows Elsa at risk of losing herself to her alluring magical powers", "language": "en", "text": "Disney have teased more about what is in store for Frozen 2 as they dropped the third trailer on Monday, ahead of its release next month.\n\nSet three years after the events of Frozen, Elsa (Idina Menzel) and sister Anna (Kirsten Bell) go on a journey to explore if she was born with her magical powers.\n\nTogether with Kristoff, Olaf and Sven, the duo set out on a dangerous but remarkable expedition as their kingdom Arendelle faces terrible danger.\n\nChills: Disney have teased more about what is in store for Frozen 2 as they dropped the third trailer on Monday, ahead of its release next month\n\nThe trailer starts with a 'distracted and worried' Elsa hearing a voice which is calling her, before the people of Arendelle are forced to flee the kingdom and take refuge in the cliffs.\n\nTroll King Grand Pabbie informs the royals: 'The kingdom is not safe. Find who is calling to you, they may have answers.'\n\nThe group then travel North across the enchanted lands, with Grand Pabbie warning them of the spirits 'which will test you every step of the way'.\n\nIt appears the film is set in autumn and when Olaf ventures into the forest, a pile of leaves fall on him.\n\nDanger every step of the way: Set three years after the events of Frozen, Elsa (Idina Menzel) and sister Anna (Kirsten Bell) go on a journey to explore if she was born with magical powers\n\nJourney: Together with Kristoff, Olaf and Sven, the duo set out on a dangerous but remarkable expedition as their kingdom Arendelle faces terrible danger\n\nEnchanting: The trailer starts with a 'distracted and worried' Elsa hearing a voice which is calling her\n\nIn trouble: Troll King Grand Pabbie informs the royals: 'The kingdom is not safe. Find who is calling to you, they may have answers'\n\nThreat: The people of Arendelle are forced to flee the kingdom and take refuge in the cliffs\n\nAnna and Elsa then come face-to-face with a group of unknown characters, who previously said in the last trailer entering the magical forest 'was impossible'.\n\nThere is another warning by the troll king, who tells Anna that Elsa could get carried away by her 'alluring' magical powers if she doesn't have her in her life.\n\nAnd it appears Elsa does become enchanted with her ability to turn things into ice and snow, with producers showing the change by differing her hairstyle from her signature braid to her locks flowing around her shoulders.\n\nAutumnal: It appears the film is set in autumn and when Olaf ventures into the forest, a pile of leaves fall on him\n\nWarriors: Anna and Elsa then come face-to-face with a group of unknown characters, who previously said in the last trailer entering the magical forest 'was impossible'\n\nAlluring: There is another warning by the troll king, who tells Anna that Elsa could get carried away by her 'alluring' magical powers if she doesn't have her in her life\n\nAs the group battle stone giants and Elsa runs into the ocean, Anna says: 'I believe in you Elsa, more than anyone or anything, if anyone can save Arendelle it's you.'\n\nThe trailer features several action sequences with Elsa conjuring large sheets of ice from her hands and riding on a horse while the soldiers say they must 'protect Arendelle at all costs'.\n\nThere is also the threat of a large, stone-like monster who storms through the forest chasing Anna.\n\nLosing herself: And it appears Elsa does become enchanted with magic, with producers showing the change by differing her hairstyle from her braid to flowing around her shoulders\n\nChase: There is also the threat of a large, stone-like monster who storms through the forest chasing Anna\n\nQuest: Elsa reveals she has been hearing a voice calling to her and soon must embark on a dangerous journey to save the kingdom of Arendelle\n\nThe original film followed Anna trying to be reunited with Elsa after her powers inadvertently trapped Arendelle in an eternal winter.\n\nThe film won two Academy Awards, one for Best Animated Feature and Best Original Song for Let It Go, and grossed $1.27 billion at the box office.\n\nJoining the cast of Frozen 2 is Evan Rachel Wood as Queen Iduna, who was voiced by Jennifer Lee in the first film, while Sterling K Brown will play Lt. Destin Mattias.\n\nSome fans of the franchise were hoping to see Elsa be given a love interest in the sequel but one of the film's songwriters Kristen Anderson-Lopez confirmed she would not have a romantic storyline.\n\nAdventure: The trailer features several action sequences, including Anna leaping across blocks of ice\n\nShe told IGN: 'Like the first movie, Elsa is not just defined by a romantic interest. There's so many movies that define a woman by her romantic interest.\n\n'That's not a story that we wanted to tell at this point in time. What we really wanted to tell was if you have these powers, how do you grow and change and find your place in the world and find answers that haven't been found before?'\n\nFrozen 2 is set to be released in UK and US cinemas on Friday, November 22.", "description": "Disney have teased more about what is in store for Frozen 2 as they dropped the third trailer on Monday, ahead of its release next month.", "authors": ["Connie Rusk", "Sean O'Grady For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/11/19687342-0-image-a-144_1571048943678.jpg", "published_at": "2019-10-14"}