{"pub": "yahoo", "url": "https://news.yahoo.com/protester-shot-street-britain-could-085846708.html", "downloaded_at": "2019-10-03 07:41:43.318220+00:00", "published_at": "2019-10-02", "title": "As a protester is shot in the street, this is how Britain could make good on its obligations to the Hong Kong people", "language": "en", "text": "This week has seen a dramatic escalation of police violence in Hong Kong. While Britain remains endlessly distracted by Brexit, the rest of the world was watching its former colony as a teenage pro-democracy protestor was shot by Hong Kong police.\n\nConfrontations flashed throughout the city just as the 70th anniversary of the People’s Republic of China sent fireworks sparkling into the Beijing sky. During one of these confrontations, a sixth-form student was shot from point blank range with a live bullet and left in a critical condition.\n\nPolice brutality is being normalised in Hong Kong. A recent Amnesty International report confirms “an alarming pattern of the Hong Kong Police Force deploying reckless and indiscriminate tactics” in their arrests, as well as beating and torturing people in detention. The police have consistently responded to a minority of violent protestors disproportionately: targeting protestors indiscriminately, and sometimes even civilians taking no part in the protests.\n\nThe press now appears to be an acceptable target. A journalist for an Indonesian-language publication was recently shot with a rubber bullet, despite being clearly identifiable as a member of the press. The Foreign Correspondent’s Club reported that over the weekend, journalists were hit by tear gas canisters and rubber bullets, targeted with pepper spray, verbally threatened by the police, and blocked from documenting the arrests of protestors. Buzzfeed’s Rosalind Adams live-tweeted herself being hit with batons while trying to film one arrest.\n\n“Police terrorism”, as it is dubbed by many Hong Kongers, has been on the frontpages of the newspapers on an almost daily basis for months. The result has been a near total collapse of public trust in both the government and the police force.\n\nAny lasting solution to the political crisis will need bold actions for reconciliation to be taken by the Hong Kong government and their counterparts in Beijing. But there is little sign of this.\n\nThe Hong Kong government have refused to agree to what look like moderate and reasonable demands from protestors – including calls for the police force to face an independent inquiry into their actions. Instead it has doubled-down and given the police licence to act with impunity.\n\nAnd so, in the meantime, we must stand with the people of Hong Kong.\n\nThe UK has a special duty to the people of Hong Kong. Not only are Hong Kongers at the forefront of the global battle for freedom and democracy, but we have a historical duty to stand with them.\n\nWhen the UK handed Hong Kong over to China in 1997, the arrangement was made on the basis that the rights and freedoms of the people of Hong Kong would remain unchanged until 2047. The handover agreement, the Sino-British Joint Declaration, writes into international law a moral and legal obligation for the UK to stand up for the freedoms of the people of Hong Kong.\n\nRead more\n\nHong Kong suffers 'one of most violent days in its history'\n\nThe integrity of this agreement is gravely threatened by the events of recent weeks. Dominic Raab issued a statement condemning the “disproportionate” use of force by the police force yesterday, but we must prove that our support for Hong Kong is more than just empty words.\n\nHere are three ways we can do this. First, the government should consider adopting legislation which will ensure that there are consequences if the Hong Kong government continues to trample on people’s freedoms. Magnitsky sanctions, targeted at the individual violators of human rights, could be applied to officials who are deemed to be responsible for breaches of the Joint Declaration.", "description": "This week has seen a dramatic escalation of police violence in Hong Kong. While Britain remains endlessly distracted by Brexit, the rest of the world was watching its former colony as a teenage pro-democracy protestor was shot by Hong Kong police.Confrontations flashed throughout the city just as the", "authors": ["Johnny Patterson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/WCO8MsZg7lSs5tPe.tsdZg--~B/aD0zNTE7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/362c92182e1472cedb0ab1a40c21c970"}