{"pub": "investingcom", "url": "https://investing.com/news/stock-market-news/stocks-push-higher-at-close-treasury-yields-rise-1974927#comments", "downloaded_at": "2019-09-11 00:12:42.495236+00:00", "title": "Stocks Push Higher at Close; Treasury Yields Rise", "language": "en", "text": "© Reuters.\n\n(Bloomberg) -- U.S. stocks erased losses in the final moments of trading to finish in the green. Treasury yields rose for a fifth day.\n\nThe closed positive, while the S&P 500 was little changed and the Nasdaq ended in negative territory. The Dow had briefly turned positive midday following a report that China is ready to buy more U.S. agricultural products.\n\n“That’s the tug of war that’s going on right now,” said Matt Maley, an equity strategist at Miller Tabak & Co. “It’s between monetary policy and the trade war.”\n\nAreas of the market that were previously this year’s best performers fell the most. The opposite was true, too, with energy stocks gaining and small caps outperforming for a second day.\n\n“The rotation from growth to value started a couple of weeks ago, but was out-sized yesterday,” said Michael O’Rourke, JonesTrading’s chief market strategist. “That caught people offside so they need to de-risk more until the situation stabilizes.”\n\nThe pound fluctuated as embattled British Prime Minister Boris Johnson insisted he won’t ask for another Brexit delay, while U.K. wage and unemployment data beat estimates. Most euro-zone sovereign bonds nudged lower as European Central Bank officials prepare to meet.\n\nThe recent pullback in the bond rally “is a correction to an outsized move in yields during August, not a turn in the trend,” Kit Juckes, chief global FX strategist at Societe Generale (PA: ) SA, wrote in his daily note. “Last Friday’s U.S. labor market data show, clearly enough for me, that the U.S. economy is slowing slowly but steadily as the global trade slowdown infects it.”\n\nInvestors are awaiting the ECB’s policy decisions on Thursday and those next week by the Federal Reserve and Bank of England as they assess how much monetary easing may be looming.\n\nElsewhere, oil plunged after President Donald Trump fired one of his most hawkish advisers. Futures fell as much as 1% after Trump announced that National Security Advisor John Bolton was out.", "description": "Stocks Push Higher at Close; Treasury Yields Rise", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEA6G0NG_L.jpg", "published_at": "2019-09-10"}