{"pub": "breitbart", "url": "https://breitbart.com/news/lebanon-pm-to-speak-as-protest-site-attacked", "downloaded_at": "2019-10-29 14:05:45.166359+00:00", "title": "Lebanon PM to speak as protest site attacked", "language": "en", "text": "Beirut (AFP) – Lebanon’s under-fire prime minister was due to speak Tuesday as rumours swirled of his imminent resignation following nearly two weeks of unprecedented protests demanding political change.\n\nSaad Hariri’s office summoned the press for 1400 GMT, even as dozens of counter-demonstrators wielding sticks and throwing stones attacked the main protest site in the capital Beirut.\n\nLocal media had circulated reports of an expected resignation announcement before the premier’s office said he would speak.\n\nAn unprecedented protest movement has gripped Lebanon for almost two weeks, calling for an overhaul of a political class viewed as incompetent and corrupt.\n\nBanks and schools have remained closed and the normally congested main arteries in Beirut blocked by protesters.\n\nOn Tuesday, dozens of rioters descended on to Riad al-Solh Square near the government headquarters, where they attacked protesters, torched tents, and tore down banners calling for “revolution”, said an AFP correspondent in the area.\n\nThe unprecedented attack on the main site of the capital’s largely peaceful protest movement forced the army and riot police to deploy en masse to contain the violence.\n\nAmbulance sirens rang out from all sides, as reports circulated of injuries, an AFP correspondent said.\n\nAn hour earlier, the same counter-demonstrators had gathered on a nearby road where they attacked peaceful protesters who were blocking the key artery, another AFP reporter said.\n\nThe counter-protesters chanted slogans hailing the leaders of two Shiite movements — Hezbollah chief Hassan Nasrallah and Amal head Nabih Berri — as they pushed roadblocks aside and provoked protesters.\n\nPolice intervened to contain the violence, sparking a series of scattered scuffles.\n\nDemonstrators caught in the attack tried to jump over the rails of the highway while others ducked behind concrete blocks.", "description": "Beirut (AFP) – Lebanon’s under-fire prime minister was due to speak Tuesday as rumours swirled of his imminent resignation following nearly", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/29/6cab1b_riot-police-deployed-counter-demonstrators-wielding-sticks-throwing-640x335.jpg", "published_at": "2019-10-29"}