{"pub": "metro", "url": "https://metro.co.uk/2019/10/11/graham-norton-earns-1857-every-minute-bbc-chat-show-air-10904361", "downloaded_at": "2019-10-11 19:51:27.123425+00:00", "title": "Graham Norton earns £1,857 every minute his BBC chat show is on air", "language": "en", "text": "Graham Norton earns £1,857 every minute a Graham Norton Show episode is on air (Picture: Getty)\n\nGraham Norton earns an incredible £1,857 every minute a Graham Norton Show episode airs on BBC One.\n\nThirty-one episodes air each year making him over £92,000 per episode and £2.97 million per year.\n\nDrinks are on you, Graham.\n\nThe popular Irish BBC presenter’s Friday night show is made by So Television Ltd, who pay the 56-year-old his salary for the series.\n\nHis pay comes on top of the £610,000 he is paid by the BBC for hosting his weekly BBC Radio 2 show and a range of other programmes and series.\n\nEarlier in October, Graham admitted that you could not ‘justify’ his wages but he is simply at the mercy of ‘market forces’.\n\n‘All the people who say, ‘he earns that, he doesn’t deserve that,” they’re absolutely right,’ he said.\n\n‘You cannot justify my wages, so I don’t try. Am I still cashing the cheques? Yes, because somehow the market forces have decreed this is my value.’\n\nThe Graham Norton Show is one of the BBC’s most successful shows (Picture:BBC)\n\nSpeaking to the Radio Times, he added: ‘For some reason MPs want to know what famous people at the BBC earn. If they could get ITV to tell them what Phillip Schofield gets, they’d love to know.\n\nAdvertisement\n\nAdvertisement\n\n‘Also, I have to say, what would really shock the public is to discover the disparity between ITV and BBC. People would go, “Wow!”‘\n\nIn the BBC’s annual report, released in July this year, it was revealed that some of Graham’s BBC male colleagues have had a significant pay cut.\n\nIt showed BBC Radio 2 presenter Jeremy Vine and Mastermind star John Humphrys were down £110,000 while BBC Radio 5 Live star Nicky Campbell lost out on £70,000, while his fellow radio presenter Steve Wright is down £85,000.\n\nBut despite the men getting severe changes to their annual wage, it turns out the women have had an increase with Strictly Come Dancing’s Zoe Ball and Claudia Winkleman the top female earners with £370,000.\n\nMORE: Rio Ferdinand names Daniel James as Manchester United’s ‘most influential’ player and defends Solskjaer\n\nMORE: Jane Fonda arrested in Washington DC amid climate change protest", "description": "Graham Norton earns an incredible £1,857 every minute a Graham Norton Show episode airs on BBC One. Thirty-one episodes air each year making him over £92,000 per episode and £2.97...", "authors": ["Rebecca Lewis"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_88259317_1570816980.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-11"}