{"pub": "investing.com", "url": "https://uk.investing.com/analysis/weekly-cot-report-sterling-traders-the-least-bearish-in-3months-200433421", "downloaded_at": "2019-10-14 06:38:11.083614+00:00", "title": "Weekly COT Report: Sterling Traders The Least Bearish In 3-Months", "language": "en", "text": "Large Speculative Positioning\n\nAs of Tuesday 8th October:\n\nTraders increased net-long exposure for a 4th consecutive week by $0.8 billion.\n\nThe Euro saw the largest weekly change among FX majors, seeing net-short exposure increase by 9.4k contracts.\n\nLarge speculators were their least bearish on the British pound in 3 months.\n\nLarge speculators were their least bullish on the Japanese yen in 2 months.\n\nEUR/USD - Large Speculative Positioning\n\nEUR: Net-short exposure dropped to its most bearish level in 4-months. Gross short exposure remains near a 4-month high, although last week’s increase of bearishness was a function of both longs and shorts closing out. Yet, whilst positioning doesn’t scream a sentiment extreme, EUR/USD rallied nearly 1% between Tuesday’s close (when the report was compiled) and Friday’s high on progress with US-China trade talks. So, is the low in? Perhaps, but I’m not currently convinced of this alone. There’s still a long way to go on trade talks, and traders remain net-short on the Euro. So until we see a material pick-up with gross longs and closure of shorts, it’s probably better to assume the trend remains bearish.\n\nGBP - Large Speculative Positioning\n\nGBP: Over the past three weeks, we’ve seen gross longs increase, and gross shorts decreased, albeit by a small amount, but it has allowed net-short exposure to fall to a 3-month low. Given the 4% rally on cable over Thursday and Friday on Brexit developments, we’d expect net-short exposure to fall notably, assuming traders still think there’s the chance of a deal before 31st of October. And looking at the cycles of net-short exposure, it’s plausible that the low was in around mid-August.\n\nLarge Speculative Positioning\n\nAs of Tuesday 8th October:\n\nWTI Traders reduced net-long exposure to a 4-month low.\n\nBullish positioning on Palladium was at its highest level in 8-months.\n\nNet-short exposure to copper was at its most bearish level in 8-weeks.\n\nOnly minor adjustments to gold positioning see net-long exposure remain stubbornly high.\n\nWTI Managed Funds Positioning\n\nWTI: Net-long exposure declined for a fourth consecutive week, taking bullish exposure for large speculators to their least bullish in 4-months. However, managed funds (pictured above) saw bullish net-long exposure fall to a 9-month low. Gross shorts are at their most bearish level since January, adding +36.9k contracts last week alone (or over +75k over the past three weeks), so some funds may have been squeezed following the missile attack on an Iranian oil tanker on Friday. Yet with volatility remaining relatively low following the attack, some funds may see the bounce as a reason to add to shorts unless geopolitical tensions rise, or we see another supply shock to make prices truly rally.\n\n\"Disclaimer: The information and opinions in this report are for general information use only and are not intended as an offer or solicitation with respect to the purchase or sale of any currency or CFD contract. All opinions and information contained in this report are subject to change without notice. This report has been prepared without regard to the specific investment objectives, financial situation, and needs of any particular recipient.\n\nAny references to historical price movements or levels are informational based on our analysis, and we do not represent or warrant that any such movements or levels are likely to reoccur in the future. While the information contained herein was obtained from sources believed to be reliable, the author does not guarantee its accuracy or completeness, nor does the author assume any liability for any direct, indirect or consequential loss that may result from the reliance by any person upon any such information or opinions.\"\n\nOriginal Post", "description": "Market Overview Analysis by City Index (Matt Simpson) covering: . Read City Index (Matt Simpson)'s latest article on Investing.com UK.", "authors": [], "top_image": "https://uk.investing.com/analysis/not found", "published_at": "2019-10-14"}