{"pub": "wsj", "url": "https://marketwatch.com/story/why-your-best-stock-bets-for-the-next-10-years-are-disney-and-target-says-this-ceo-2019-10-24?mod=rsswn", "downloaded_at": "2019-10-24 13:59:09.197053+00:00", "title": "Why your best stock bets for the next 10 years are Disney and Target, says this CEO", "language": "en", "text": "In a massive week for corporate earnings, Amazon reports results after Thursday’s close.\n\nShares AMZN, +0.16% have slipped in recent months on fears one-day shipping and rising cloud competition have been a drag on the e-commerce giant. Still, the ride’s been glorious for faithful investors, with Amazon stock up 1,387% in 10 years.\n\nWe’ve reached a turning point, says our call of the day from Smead Capital Management’s chief executive Bill Smead. He warns investors are “blacked out” to the fact they’re paying too much for future earnings of Amazon and other past decade winners like Netflix NFLX, -0.29%, Visa V, +1.39% and Starbucks SBUX, +0.59%.\n\nHe has been pounding the table lately with the view that investors need to switch to stocks that will cater to future millennial needs — cars, houses and entertainment for their offspring.\n\n“We want to own companies at attractive prices that are going to be where the money is made in the next 10 years,” Smead told MarketWatch in an interview.\n\nThat means retailers like Target TGT, -0.20%, home builder Lennar LEN, -0.32% and Disney DIS, -0.67%, which will soon roll out its new streaming service, and Warren Buffett’s Berkshire Hathaway BRK.B, -0.10% BRK.A, +0.04%, which offers exposure to Bank of America BAC, -0.16%, JP Morgan Chase JPM, -0.46% and even Apple AAPL, -0.23%, says Smead.\n\nHe also likes Qualcomm QCOM, +0.95%, which “has the patents to make everything in 5G happen” and oil and gas exploration group Occidental Petroleum OXY, -0.50%.\n\nBut don’t forget baby boomers and their growing healthcare needs. For that, Smead likes pharmaceutical companies Amgen AMGN, -0.17%, Merck MRK, -0.39%, Pfizer PFE, -0.58% and pharmacy chain Walgreens WBA, +0.20%\n\nThe market\n\nThe Dow DJIA, -0.22% , S&P SPX, +0.02% and Nasdaq COMP, +0.40% are rising in premarket, led by tech stocks, with a possible record on the way. European stocks SXXP, +0.53% are rising after a ton of company updates. The ECB left monetary policy unchanged at President Mario Draghi’s last central bank meeting. Asia markets ADOW, +0.51% finished mixed.\n\nThe chart\n\nFactSet\n\nOur chart of the day shows Tesla shares TSLA, +16.92% soaring after the electric-car maker posted a surprise quarterly profit. Shares jumped 20.5%, or $52.32, to $307, at one point late Wednesday. If that holds through Thursday’s close, it would mark the biggest one-day net gain on record, and the second-biggest one-day percentage rise ever, according to Dow Jones Market Data.\n\nOpinion: Tesla is profitable again. How long will it last this time?\n\nThe buzz\n\nEarly earnings highlights included 3M MMM, -4.11% lowering its outlook and Twitter TWTR, -17.23% reporting revenue below expectations.\n\nAlong with Amazon, Visa V, +1.39%, chip maker Intel INTC, +0.17% and biotech Gilead GILD, -0.29% will report after the close.\n\nLate on Wednesday, Microsoft MSFT, +1.54% reported double-digit percentage gains in profit and sales. Online payments company PayPal PYPL, +9.55% is up on an earnings beat, while Ford F, -5.43% and online auctioneer eBay EBAY, -7.73% are slipping on results.\n\nU.S. and Finland-listed shares in Nokia NOK, -21.92% NOKIA, -22.63% are sinking after the phone maker slashed outlooks and halted dividend payments, due to 5G costs and competition from China.\n\nAlphabet’s Google GOOGL, -0.18% rejects claims it created a spy tool to watch employees and disrupt unionizing efforts.\n\nThe economy\n\nThursday’s data includes jobless claims and durable goods orders, followed by the Markit manufacturing and services purchasing managers indexes, then new home sales.\n\nRead: Here’s why Morgan Stanley’s Mike Wilson is actually rooting for a recession\n\nRandom reads\n\nHistoric moment in Spain as remains of dictator Francisco Franco leaves state mausoleum\n\nFour American Airlines flight attendants arrested over money-laundering charges\n\nDeath toll in Chile rises to 18 as police and protesters continue to clash\n\nLondon bar becomes first in the world to use facial recognition to keep track of who gets served next\n\nNeed to Know starts early and is updated until the opening bell, but sign up here to get it delivered once to your email box. Be sure to check the Need to Know item. The emailed version will be sent out at about 7:30 a.m. Eastern.\n\nFollow MarketWatch on Twitter, Instagram, Facebook.", "description": "Our call of the day, from Smead Capital Management’s Bill Smead says look to the future spending habits of millennials to invest for the next 10 years and...", "authors": ["Barbara Kollmeyer", "Markets Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT902_disney_ZG_20191024032914.jpg", "published_at": "2019-10-24"}