{"pub": "businessinsider", "url": "https://businessinsider.com/modi-tells-xi-relations-are-stable-differences-manageable-2019-10", "downloaded_at": "2019-10-12 09:15:28.824279+00:00", "title": "Modi tells Xi relations are stable, differences manageable", "language": "en", "text": "In this handout photo provided by the Indian Prime Minister's Office, Chinese President Xi Jinping and Indian Prime Minister Narendra Modi shake hands in Mamallapuram, India. Xi met with Modi at a time of tensions over Beijing's support for Pakistan in opposing India's downgrading of Kashmir's semi-autonomy and continuing restrictions on the disputed region. (Indian Prime Minister's Office via AP) Associated Press\n\nMAMALLAPURAM, India (AP) — Indian Prime Minister Narendra Modi told visiting Chinese President Xi Jinping that their relations have attained stability and fresh momentum in the past year and they would manage their differences prudently by not allowing them to become a dispute.\n\nModi says both countries have decided to be sensitive to each other's concerns as he and Xi sat down for delegation-level talks on Saturday in the seaside temple town of Mamallapuram.\n\nThey are meeting at a time of tensions over Beijing's support for India's rival Pakistan in opposing New Delhi's downgrading of Kashmir's semi-autonomy and continuing restrictions in the disputed region.\n\nWithout going into details, Xi said in his opening remarks that he had candid and in-depth discussions with Modi on various issues since his arrival Friday.", "description": "MAMALLAPURAM, India (AP) — Indian Prime Minister Narendra Modi told visiting Chinese President Xi Jinping that their relations have attained stability and fresh momentum in the past year and they would manage their differences prudently by not allowing them to become a dispute.", "authors": ["Associated Press"], "top_image": "https://www.businessinsider.com/public/assets/BI/US/og-image-logo-social.png", "published_at": "2019-10-12"}