{"pub": "japantoday", "url": "https://japantoday.com/category/national/missing-part-of-oldest-tale-of-genji-manuscript-discovered", "downloaded_at": "2019-10-09 00:36:29.283087+00:00", "title": "Missing part of oldest 'Tale of Genji' manuscript discovered", "language": "en", "text": "A missing part of the oldest copy of classic Japanese novel \"The Tale of Genji,\" written by Murasaki Shikibu, has been found among the heirlooms of the family of a former feudal lord, a cultural foundation said Tuesday.\n\nExperts have confirmed the authenticity of the fifth chapter, titled \"Wakamurasaki,\" found in a five-chapter work called \"Aobyoshibon\" (blue cover book) compiled by poet Fujiwara Teika (1162-1241) in the Kamakura period, according to Reizeike Shiguretei Bunko, the foundation for preservation of cultural heritage.\n\nThe novel comprising 54 chapters, written in the early 11th century during Japan's Heian period (794-1185), depicts the romantic life of Hikaru Genji, a son of a Japanese emperor.\n\nThe discovered chapter contains an important part of the novel in which the 18-year-old hero encounters his future wife. The original manuscript of the work has not been found and its contents were preserved in copies.\n\nThe discovered manuscript belongs to a descendant of the former feudal lord of the Mikawa-Yoshida Domain in Aichi Prefecture.\n\nOld manuscripts of all of the four other chapters in \"Aobyoshibon\" had been found by the 1930s and they are designated as important cultural properties by the Japanese government.\n\nThe newly found manuscript mostly matches the commonly known version, but there are some grammatical differences, the foundation said.\n\nTeika is known to have attempted to reconstruct the original version of \"The Tale of Genji\" by comparing various copies of the book available at the time.\n\n© KYODO", "description": "A missing part of the oldest copy of classic Japanese novel \"The Tale of Genji,\" written by Murasaki Shikibu, has been found among the heirlooms of the family of a former feudal lord, a cultural foundation said Tuesday. Experts have confirmed the authenticity of the fifth chapter, titled \"Wakamurasaki,\" found…", "authors": ["Chip Star", "Aly Rustom", "Bugle Boy Of Company B", "Norman Goodman"], "top_image": "https://japantoday.com/images/japan-today-social.jpg", "published_at": "2019-10-08"}