{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/24/mystics-beat-aces-game-4-advance-wnba-finals", "downloaded_at": "2019-09-25 04:41:36.285485+00:00", "title": "Mystics beat Aces in Game 4 to advance to WNBA Finals", "language": "en", "text": "LAS VEGAS — Elena Delle Donne scored 25 points and the Washington Mystics earned a return trip to the WNBA Finals, outlasting the Las Vegas Aces 94-90 to close out their semifinal series on Tuesday night.\n\nThe Mystics, who eliminated the Aces in four games, will host the Connecticut Sun in Game 1 of the Finals on Sunday. Washington was swept by Seattle in last year’s Finals.\n\nEmma Meesseman bounced back from her dismal performance in Game 3, when she was held to just six points, by scoring 22 points for Washington. Kristi Toliver added 20 and Natasha Cloud chipped in with 11.\n\nLas Vegas built a 10-point lead midway through the second quarter, but the Mystics quickly turned things around. Toliver, Delle Donne, Cloud and Meesseman scored consecutive buckets to ignite a 16-4 run that closed the half and gave the Mystics a 45-43 lead at the break.\n\nWashington carried its momentum into the second half when Toliver opened the quarter with a 3-pointer in front of the Aces bench and went on to score 10 of the Mystics’ first 15 points in the third.\n\nLas Vegas wasn’t done, though, as it erased a seven-point deficit and closed the third quarter on a 15-7 run that included five points each from Plum and WNBA Sixth Woman of the Year Dearica Hamby and gave the Aces a 68-67 lead.\n\nLeague MVP Delle Donne and Meesseman took over in the fourth quarter. They scored 21 of Washington’s 26 points in the period to seal the win.\n\nHamby had a chance to tie the game with 3.4 seconds left but missed a 3-pointer from the corner.\n\nTIP-INS\n\nMystics: It won’t show on the stat sheet, but Aerial Powers gave Washington the blue-collar support it needed, including a spark just before its second-quarter run. Powers, who finished with seven points and five rebounds in 16 minutes, stood her ground against a driving Hamby and took the charge on the baseline with 5:40 left, with the Aces leading 34-27. The Mystics outscored Las Vegas 18-9 from there.\n\nAces: Kayla McBride, who averaged 7.5 points over the last six games of the regular season, came in averaging 14.7 per game on 50% shooting in the playoffs. But she went just 2 of 10 from the floor Tuesday night, including 1 of 5 from 3-point range.\n\nNBA INVASION\n\nLeBron James, Anthony Davis, Kyle Kuzma and Quinn Cook of the Los Angeles Lakers were sitting courtside. Golden State Warriors forward Draymond Green also attended.\n\nUP NEXT\n\nWashington will host Connecticut in Game 1 of the WNBA Finals on Sunday.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Elena Delle Donne scored 25 points and the Washington Mystics earned a return trip to the WNBA Finals, outlasting the Las Vegas Aces 94-90 to close out their semifinal series on Tuesday night.", "authors": ["The Washington Times Http", "W.G. Ramirez"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/24/mystics_aces_basketball_50181_c0-168-3055-1949_s1770x1032.jpg?eba2f5663976c415add0fb2b53f1388481018847", "published_at": "2019-09-24"}