{"pub": "yahoo", "url": "https://yahoo.com/entertainment/paula-abdul-reacts-katy-perry-131419557.html", "downloaded_at": "2019-10-10 15:03:36.600935+00:00", "title": "Paula Abdul Reacts to Katy Perry's $25 Million 'American Idol' Salary", "language": "en", "text": "The 57-year-old singer was a judge on the show from 2002 to 2009.\n\nPaula Abdul is celebrating Katy Perry's hefty American Idol salary.\n\nThe 57-year-old singer appeared on Wednesday's episode of Watch What Happens Live With Andy Cohen and responded to a fan question about Perry's reported $25 million paycheck as a judge on Idol.\n\n\"Well, good for her. Good for her!\" Abdul, who was a judge on the show from 2002 to 2009, said. \"Why not?\"\n\n\"Well, good for you for not being bitter about it,\" Cohen replied.\n\n\"I take it out on my chihuahuas behind-the-scenes,\" Abdul quipped with a laugh, before adding that she's seen \"a couple episodes\" of the reboot, which features Perry, Lionel Richie and Luke Bryan as judges.\n\nAbdul previously expressed similar sentiments when ET's Nischelle Turner spoke to her in June 2017. \"Good for her!\" she said of Perry, adding, \"Let's just put it on record. I was not getting paid $​25 million.\"\n\nAs for Perry, during an appearance on KTU's Cubby and Carolina in the Morning Show in May 2017, she gushed over her reported earnings.\n\n\"I'm really proud that, as a woman, I got paid,\" she said. \"I got paid more than pretty much any guy that's been on that show. And by the way, I love men.\"\n\n\"So I'm a paid woman and I'm ready for a beautiful man,\" she added at the time, which came just months after she and her now-fiance, Orlando Bloom, called it quits. The pair eventually rekindled their romance and are now, a source previously told ET, planning a fall wedding.\n\n\"They are so ready to start their new life together,\" the source said. \"Their plan is to have a close friends and family wedding in the fall, but are keeping many of their plans private.\"\n\nWatch the video below for more on Perry.\n\nRELATED CONTENT:\n\nKaty Perry and Ryan Seacrest Have Already Been Brought to Tears During 'American Idol' Auditions (Exclusive)\n\nTaylor Swift Reveals She and Katy Perry Reconnected Over Past 'Miscommunications'\n\nKaty Perry Says Orlando Bloom’s Son Flynn Has Drastically Changed Her Daily Life\n\nRelated Articles:", "description": "The 57-year-old singer was a judge on the show from 2002 to 2009.", "authors": ["Paige Gawley"], "top_image": "https://s.yimg.com/uu/api/res/1.2/s11fLRfZpr8LdSdjV38Rvg--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/homerun/etonline.tv/f52b68b5286a5afb2b817f7979dcf5db", "published_at": "2019-10-10"}