{"pub": "nationalreview", "url": "https://cbsnews.com/news/african-elephants-are-evolving-to-not-grow-tusks-because-of-poaching", "downloaded_at": "2019-10-05 06:28:15.340554+00:00", "title": "African elephants are evolving without tusks because of poaching", "language": "en", "text": "Many elephants at the Gorongosa National Park in Mozambique, Africa, are lacking one distinguishable feature that elephants usually have: tusks. Researchers believe the heavy presence of poaching has led elephants here to evolve without tusks, so their human predators have no reason to kill them and steal their tusks for ivory.\n\nIt's not natural selection that is causing elephants to evolve without tusks, says Ryan Long, a researcher who has studied the elephants at Gorongosa National Park. It's an artificial selection, caused by decades of poaching.\n\n\"There's multiple things that could produce that sort of thing in elephant populations, but the leading hypothesis ... is that there's been a substantial amount of pressure placed on those populations by poachers,\" Long told CBS News.\n\nLong, an assistant professor of wildlife sciences University of Idaho, said tusks are usually a necessity, especially for male elephants. Males use their tusks for combat and for breeding rights, among other things. However, in an environment where poachers are a mortal threat, \"tusks suddenly become a liability,\" Long explained. \"And so, as opposed to being something that benefits elephants, those elephants that have tusks ... they're the ones that get targeted first.\"\n\nTusklessness is almost an exclusively female trait, Long said. It's rare to see a tuskless male elephant because in the absence of poaching, males naturally grow larger tusks, since they use them more. Female elephants do use their tusks, but female elephants in Mozambique are doing just fine without them, according to Long.\n\nResearchers are still trying to pinpoint all the genetics that underpin tusklessness. However, poachers are essentially weeding out the gene for tusk growth from elephant populations. As more elephants with tusks get killed, the ones that survive and breed are more likely to be tuskless ones who pass down their tuskless genes. \"In a very short amount of time, you've got a lot of populations of elephants who don't have tusks,\" Long said.\n\n\"If you don't have big tusks, you may not breed [if you're a male elephant],\" Long said. \"Whereas for female elephants, there's always been a background level of tusklessness in most elephant populations that aren't subjected to poaching pressure.\"\n\nNormally, about 4 to 6 percent of female elephants are tuskless. That number, however, is increasing for populations that have been subjected to poaching. In the Mozambique preserve, only about 200 adult female elephants survive, and according to National Geographic, recent research shows that about a third of the younger females — the generation born since a civil war ended in 1992 — never developed tusks.\n\nIf poaching pressure decreases, tusklessness may become less prevalent, Long said. But poaching is still prevalent in much of Africa. Therefore, tuskless female elephants are expected to be prevalent, too.", "description": "In the presence of poachers, tusks suddenly become a liability – so some elephants just don't have them", "authors": ["Caitlin O'Kane"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/03/27/c44306f7-ad25-46ec-99af-f353a6c81255/thumbnail/1200x630/8742faa0c10536978f9b0358dd4ac52f/gettyimages-479190166.jpg", "published_at": "2019-03-27"}