{"pub": "reuters", "url": "https://reuters.com/article/us-facebook-cryptocurrency/swiss-based-libra-will-have-to-meet-tough-u-s-standards-u-s-treasury-idUSKCN1VV1BT", "downloaded_at": "2019-09-10 23:46:24.668541+00:00", "title": "Swiss-based Libra will have to meet tough U.S. standards-U.S. Treasury", "language": "en", "text": "BERN (Reuters) - The Facebook-led Libra cryptocurrency project must meet the highest standards for combating money laundering and terrorism financing if it is to get off the ground, a senior U.S. Treasury official said on Tuesday.\n\nU.S. Treasury Under Secretary for Terrorism and Financial Intelligence Sigal Mandelker addresses a press roundtable at the U.S. embassy in Bern, Switzerland September 10, 2019. REUTERS/Arnd Wiegmann\n\nAny cryptocurrency project, including Geneva-based Libra, operating in all or substantial parts of the United States will clearly have to satisfy U.S. regulatory standards, U.S. Under Secretary of Terrorism and Financial Intelligence Sigal Mandelker told reporters in the Swiss capital.\n\n“Whether it’s bitcoin, Ethereum, Libra, our message is the same to all of these companies: anti-money laundering and combating the financing of terrorism has to be built into your design from the get-go,” Mandelker said.\n\nShe was speaking after meeting Swiss government officials and representatives from the Bank for International Settlements and other international financial bodies to discuss cryptocurrencies including the planned Libra project, which is to be launched by a Swiss-based association.\n\nWhile the digital currency industry has paid tremendous attention to developing the underlying technology, much of the industry has paid far too little attention to ensuring that the networks they are building do not enable terrorists and other bad actors to hide and move money, Mandelker said.\n\nThe Treasury official said she would meet Switzerland’s financial market supervisor FINMA on Tuesday, where discussing not only the application of proper anti-money laundering safeguards but also taking enforcement actions against companies flouting those rules would be a priority.\n\nFINMA in August granted Switzerland’s first banking and securities licenses to two blockchain service providers and has built up a digital currency hub nicknamed the “Crypto Valley”.\n\n“Switzerland, like a number of other countries, has promoted itself as a hub for fintech and for innovation, and so of course any country that promotes itself in that way — in my view, it’s incumbent upon that country to take these particular concerns at the highest level in(to) the utmost regard,” she added.\n\nThe Libra project was still in very early stages of thinking through steps to prevent such crimes, she said, adding Swiss officials had similar views.\n\n“The Libra Association maintains that financial inclusion, regulatory compliance, and consumer protection are not competing objectives,” Dante Disparte, a spokesman for Libra said.\n\nHe added the association welcomed the public policy dialogue and multi-stakeholder process.\n\nDigital currencies such as Libra raise serious concerns and must be regulated as tightly as possible to ensure they do not upset the world’s financial system, Group of Seven finance ministers and central bankers had said in July.", "description": "The Facebook-led Libra cryptocurrency project must meet the highest standards for combating money laundering and terrorism financing if it is to get off the ground, a senior U.S. Treasury official said on Tuesday.", "authors": ["Brenna Hughes Neghaiwi", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190910&t=2&i=1428311220&w=1200&r=LYNXNPEF8912X", "published_at": "2019-09-10"}