{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-politics-49931937", "downloaded_at": "2019-10-04 09:18:04.164323+00:00", "title": "Former Conservative MP Rory Stewart standing down", "language": "en", "text": "Image copyright Reuters\n\nFormer Conservative leadership candidate Rory Stewart has said he will be standing down at the next general election.\n\nThe MP has also announced he has resigned from the Conservative Party.\n\nMr Stewart tweeted: \"It's been a great privilege to serve Penrith and The Border for the last ten years.\"\n\nHe was expelled from the Conservatives in the Commons along with 20 other Brexit rebels, but remained a member of the party.\n\nWriting for his local newspaper, the Cumberland and Westmorland Herald, he said: \"As you will be aware, I am no longer allowed to run as Conservative MP in Penrith and The Border.\n\n\"Because I have loved the constituency so much, I had considered standing as an Independent; but I have decided that I wouldn't want to run against those Conservative members who have been such wonderful colleagues over the last 10 years.\"\n\nIn his newspaper column, he said he was \"hugely grateful\" for the support he had received from members of his local party, but added: \"It should be no secret that there are also local party members who would rather I did not run again.\"\n\n\"I don't want to test loyalties, destroy old friendships or push any of these issues any further. There is enough toxic division in British politics without importing it into Cumbria!\"\n\nHe said he would \"stay involved in politics\" and \"continue to explain why I voted for a Brexit deal, while rejecting a no-deal Brexit\".\n\n'Great shame'\n\nPrime Minister Boris Johnson expelled 21 MPs from the Parliamentary party at the start of September after they rebelled against him in a bid to prevent a no-deal Brexit.\n\nSome long-serving figures - such as Ken Clarke and Sir Nicholas Soames - are planning to stand down at the next election, while others, such as former Chancellor Philip Hammond and former attorney general Dominic Grieve - are reported to be considering standing as independents.\n\nRobert Craig, president of the Penrith and The Border Conservative Association, said Mr Stewart may not have resigned if he had not had the whip removed by the prime minister.\n\n\"It's a great shame and it is not unexpected given he is still out in the wilderness with the whip removed,\" he said.\n\n\"I suppose had that changed... it seems to have become clear that that wasn't going to change and he has other ambitions.\"\n\nAsked if Mr Stewart would not have taken the decision if the PM had not withdrawn the whip, Mr Craig replied: \"Possibly.\"\n\n'Last rites'\n\nMr Craig said the MP's reasons for resigning would become clear later on Friday and Mr Stewart had told him of the decision two weeks ago.\n\nMr Stewart is a former foreign office official who was the deputy governor of two Iraqi provinces before entering politics.\n\nHe was elected to the Commons in 2010 and is a former international development secretary and prisons minister.\n\nHe did better than initially expected in July's Conservative leadership contest, making it through the first two rounds of voting and eventually coming fifth.\n\nA Remain supporter in the 2016 referendum, he went on to back then prime minister Theresa May's withdrawal deal.\n\nHis former cabinet colleague, Amber Rudd, tweeted that Mr Stewart was an \"outstanding minister\" and it was a \"loss\" to politics.\n\nFormer Tory MP Nick Boles, who resigned from the Conservatives earlier this year, tweeted that Mr Stewart's departure showed that the \"last rites are being read for moderate One Nation conservatism\".\n\nHe added: \"A sad day for British politics but a personal liberation for Rory who will go on to greater things, no doubt.\"\n\nFormer Scottish Conservatives leader Ruth Davidson tweeted: \"Very sorry to see. Our party should have room for talented, experienced and committed people from across the Conservative spectrum.\"", "description": "The former Tory leadership candidate is quitting the party and will not stand at the next election.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/16C0F/production/_109099139_mediaitem109099138.jpg", "published_at": "2019-10-04"}