{"pub": "heritage", "title": "Are Americans Really Going Crazy for Socialism? Don't Abandon All Hope, Freedom Lovers", "url": "https://heritage.org/progressivism/commentary/are-americans-really-going-crazy-socialism-dont-abandon-all-hope-freedom", "language": "en", "published_at": "2019-06-02", "downloaded_at": "2019-09-02 07:22:52.050256+00:00", "text": "A new Gallup poll confirms what other surveys have reported: a disturbingly high percentage of Americans, about four in 10, now look favorably on socialism. Forty-seven percent of Americans even say they would vote for a socialist candidate for president.\n\nWhat’s going on here? Is Rep. Alexandria Ocasio-Cortez, D-N.Y., that persuasive? Are that many Americans ready to abandon the free enterprise system that has made America the most prosperous nation in human history?\n\nFar from it. The same poll revealed that a majority of Americans, 62 percent, continue to endorse the free market rather than government when it comes to decisions affecting the economy. A majority also favor free enterprise rather than government control over health care and higher education.\n\nThese seemingly contradictory results, Gallup said, reveal that Americans are divided on how to describe the current state of the U.S. economy and determine its future direction. I believe they are divided for the following reasons:\n\nMany Americans are still hurting from the Great Recession of 2008 when they lost confidence in the free market and began looking for alternatives like socialism.\n\nThere is a generational gap with younger Americans accustomed to government playing a major role in their lives and older Americans still quoting Barry Goldwater, “Any government big enough to give you everything you want is big enough to take everything you have.”\n\nA powerful trifecta of politicians, educators and media elite have stepped up their campaign to promote socialism as the answer to America’s economic woes. It is not coincidental that Sen. Bernie Sanders, I-Vt., almost won the 2016 Democratic presidential nomination backed as he was by the political-academic-media complex.\n\nThis trifecta has been working to turn America into a socialist state since Franklin D. Roosevelt said in a 1932 campaign address: “The first obligation of government is the protection of the welfare and well-being, indeed the very existence of its citizens.” No president had ever before promised such a sweeping responsibility of the federal government.\n\nAt the same time, John Dewey and his colleagues at Columbia University were turning out educators committed to “democratic socialism,” an effort reinforced by the same 1960s radicals who are tenured university professors today. And all along a media elite evolved that endorsed a central place for government.\n\nHowever, all is not lost. There is a powerful counter-establishment committed to the preservation and protection of our free market system and the checks and balances of the Constitution. Groups including the National Rifle Association, the Right to Work Committee and the Right to Life Committee exist to counter our politicians. To counter the academy, we have groups like the Heritage Foundation and 65 state think tanks from Maine to California. To counter the media elite, we have Fox News, Rush Limbaugh, the Wall Street Journal and a burgeoning presence on social media.\n\nThe freedom movement has one more priceless asset — the truth. Socialism has been tried in some 40 countries over the past century, and it has failed every time and everywhere. The United Kingdom, India, Denmark and Israel all tried socialism, and after decades of misery, rejected it.\n\nThe truth is that planning leads inevitably to tyranny while free enterprise leads to the American Dream.", "description": "A new Gallup poll confirms what other surveys have reported: a disturbingly high percentage of Americans, about four in 10, now look favorably on socialism. Forty-seven percent of Americans even say they would vote for a socialist candidate for president.", "authors": ["Lee Edwards", "Distinguished Fellow In Conservative Thought", "Lee Edwards Is A Leading Historian Of American Conservatism", "The Author Or Editor Of Books."], "top_image": "https://www.heritage.org/sites/default/files/styles/facebook_optimized/public/images/2019-06/GettyImages-1147203622.jpg?itok=nNCLvX6E"}