{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/german-manufacturing-recession-deepens-in-september ", "downloaded_at": "2019-10-01 09:26:39.848367+00:00", "title": "German manufacturing recession deepens in September", "language": "en", "text": "A recession in Germany's manufacturing sector deepened in September with factories recording their weakest performance since the depth of the world financial crisis a decade ago, a survey showed on Tuesday.\n\n[BERLIN] A recession in Germany's manufacturing sector deepened in September with factories recording their weakest performance since the depth of the world financial crisis a decade ago, a survey showed on Tuesday.\n\nIHS Markit's Purchasing Managers' Index (PMI) for manufacturing, which accounts for about a fifth of the German economy, fell to 41.7 from 43.5 in August. This was the lowest reading since June 2009.\n\n\"The downward trend in new orders, which fell the most in more than 10 years, is a particular worry, and continues to drive cutbacks in factory output, employment and prices,\" said Phil Smith, principal economist at IHS Markit.\n\nGermany's export-reliant manufacturers are suffering from a slowing world economy and business uncertainty linked to a trade conflict between the United States and China as well as Britain's planned exit from the European Union.\n\nsentifi.com Market voices on:\n\nThe job losses in manufacturing broadened in September, reaching a scale at which they could start to weigh more heavily on so far relatively resilient consumer morale, Smith said.\n\nThe weakness seen for a long time across the intermediate and investment goods sectors also showed signs of spreading to consumer products, he added.\n\nGermany's leading economic institutes are set to lower on Wednesday their growth forecast for the economy for this year and next, sources told Reuters on Monday, adding to fears that a recession among export-driven manufacturers is spreading.\n\nBut the German economy is showing bright spots despite expectations of a technical recession in the third quarter.\n\nData on Monday showed German unemployment fell unexpectedly in September and retail sales rose in August, allaying some concerns that a manufacturing slump is taking its toll on a consumption-driven growth cycle.\n\nREUTERS", "description": ": THE BUSINESS TIMES Government & Economy - [BERLIN] A recession in Germany's manufacturing sector deepened in September with factories recording their weakest performance since the depth of the world financial crisis a decade ago, a survey showed on Tuesday. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/01/AK_gercar_0110.jpg?itok=qF93uD9S", "published_at": "2019-10-01"}