{"pub": "cbc", "url": "https://cbc.ca/news/canada/nova-scotia/sidney-crosby-helps-foster-penn-girls-youth-hockey-team-1.5323310", "downloaded_at": "2019-10-19 12:26:17.440617+00:00", "title": "Sidney Crosby helps foster girls hockey team in Pennsylvania | CBC News", "language": "en", "text": "Superstar NHLer Sidney Crosby played a significant role in forming a Pennsylvanian hockey league's first-ever all-girls hockey team.\n\nAll 17 players on the 12-and-under girls Johnstown Warriors team took part in the Cole Harbour, N.S.-native's Little Penguins Learn to Play Hockey program, which includes 10 sessions of practice as well as head-to-toe gear.\n\nOn Oct. 10, the team, also known as Crosby's Girls, were surprised with a trip to see the Pittsburgh Penguins play the Anaheim Ducks.\n\n\"They had no idea, like we packed all their equipment and everything and they thought they were going to go play a game, and then they didn't know until they pulled up to PPG Paints Arena,\" said coach Sheri Hudspeth.\n\nThe team had signs and were able to sit by the boards. Each sign had a letter, number or symbol and spelled out \"CROSBY'S GIRLS 87 ❤️.\" They held the signs up during the warm up and during the game.\n\nSidney Crosby’s influence, reach, and kindness just made history for the Johnstown Warriors of the western Pennsylvanian region. <a href=\"https://t.co/P7zKSf9oqw\">https://t.co/P7zKSf9oqw</a> —@Pensburgh\n\nThe Johnstown Warriors held up signs that spelled \"CROSBY'S GIRLS 87 ❤️\" during the Oct. 10 warm up and game. (Submitted by Sheri Hudspeth)\n\n\"It was just kind of a thank you. We gave him a signed jersey from the girls, one of our home jerseys, and a plaque that was thanking his program,\" said Hudspeth, originally from Aurora, Ont.\n\nThey also signed photos of the girls and gave them to Crosby.\n\nChris Glessner, president of the Johnstown Warriors Hockey Organization, said Crosby mentioned the girls team in a post-game interview.\n\n\"He mentioned that he seen them and how excited he was that it's been a success and he's happy for them,\" Glessner said.\n\nThe team and Crosby did not meet — but Hudspeth is hoping that could happen one day.\n\nPutting in work <a href=\"https://twitter.com/hashtag/ForTheGame?src=hash&ref_src=twsrc%5Etfw\">#ForTheGame</a> 💪<br><br>Hey Coach Sheri, check those DMs! <a href=\"https://t.co/SeO1klKbAv\">https://t.co/SeO1klKbAv</a> —@adidashockey\n\nThe team sitting outside PPG Paints Arena the day of the game. (Submitted by Sheri Hudspeth)\n\nShe said since the photo of the girls holding the signs went online, the sportswear brand Adidas offered to sponsor the team and give them shoes.\n\n\"It's been unreal, like everything I've seen is positive — it's such a feel good heart-warming, positive story that also shines a light on girls hockey,\" Hudspeth said.\n\n\"I'm also hoping it sparks interest in here that more girls want to come in and join our Warriors program next year.\"\n\nMORE TOP STORIES", "description": "All 17 players on the Pennsylvania-based Johnstown Warriors team — known as Crosby's Girls — were in Crosby's Little Penguins program.", "authors": ["Anjuli Patil Is A Reporter", "Occasional Video Journalist With Cbc Nova Scotia'S Digital Team."], "top_image": "https://i.cbc.ca/1.5323657.1571267182!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/johnstown-warriors.JPG", "published_at": "2019-10-19"}