{"pub": "metro", "url": "https://metro.co.uk/2019/10/07/deaf-and-blind-puppy-named-piglet-teaches-kids-about-special-needs-pets-10875842", "downloaded_at": "2019-10-07 20:13:30.495796+00:00", "title": "Deaf and blind puppy named Piglet teaches kids about special needs pets", "language": "en", "text": "Glow up (Picture: @pigletpuppy/Instagram)\n\nWe interrupt your day to bring you a puppy piggy hybrid that will automatically make you say ‘aww’.\n\nOkay, so this adorable pooch isn’t actually the result of a dog and pig who got rambunctious, it’s a wee puppy who just happens to look like a little porker.\n\nAnd he’s aptly been named Piglet.\n\nThe young doggo is also deaf and blind which makes him all the more sweet.\n\nPastel-coloured and puppy-eyed, Piglet is a Dachshund Chihuahua mix.\n\nHe is the product of two dapple coloured parents and dapple-to-dapple breeding results in a 25 per cent chance of each puppy being ‘double dapple’, giving Piglet the rare look.\n\nBut this double dapple pattern is linked to congenital ear and eye defects that may result in partially or completely deaf and blind puppies.\n\nThat explains Piglet’s health status. Unfortunately for the youngster, he didn’t have the best start in life either as he was born in a home with 37 other different breeds where he couldn’t get the attention he needed.\n\nAdvertisement\n\nAdvertisement\n\nThankfully he was adopted by his now-owner Melissa Shapiro, from Massachusetts, who now uses Piglet to teach children about differences in animals.\n\nLook at that face (Picture: @pigletpuppy/Instagram)\n\nMelissa explained to People why she chose to give him a forever home: ‘It was quite a decision to make. He is a lot of work and he is like a full-time job, taking care of a little disabled baby.\n\n‘But he’s so cute, and we couldn’t give him away at that point.’\n\nNow Piglet lives comfortably with six other canine friends. But when he first arrived at the apartment, it took him some getting used to, especially as he had been born in a hoarding situation.\n\n‘He was so anxious, he was screaming constantly,’ added Melissa. ‘He would play, then go to sleep, but when he wasn’t doing either of those, he was screaming. I couldn’t leave the house the first month I had the dog here.’\n\nAll grown up (Picture: @pigletpuppy/Instagram)\n\nNot only does he entertain his humans, Piglet has been doing a lot of good work.\n\nWith the help of a year three teacher, Piglet now helps to teach children about special needs pets at a school in Plainville.\n\nSpot Piglet (Picture: @pigletpuppy/Instagram)\n\nPupils even started a programme called Piglet State of Mind, encouraging themselves to think more positively. The initiative is now used in schools around the country, according to Piglet’s website Pink Piglet Puppy.\n\nYou can gander through the site to see the adventures of Piglet who is quickly growing into an adult.\n\nAdvertisement\n\nAdvertisement\n\nMORE: Adorable dog’s face looks very human and people can’t get enough\n\nMORE: Adorable bunny and cat are best friends and they’re completely inseparable\n\nMORE: Woman reunited with her deaf dog five years after he went missing\n\nAdvertisement Advertisement", "description": "Piglet is the product of two dapple coloured parents who gave him a 25% chance of being born with congenital ear and eye defects", "authors": ["Faima Bakar"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_88802742_1570452414.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-07"}