{"pub": "time", "url": "https://time.com/5672018/glory-to-hong-kong-protests-national-anthem", "downloaded_at": "2019-09-10 23:26:46.141329+00:00", "title": "'Glory to Hong Kong': Hong Kong's New 'National Anthem'", "language": "en", "text": "Hong Kong’s protestors want greater autonomy from mainland China, a grievance they’re expressing through a song some are calling their new “national anthem.”\n\n“Glory to Hong Kong” has spread like wildfire: on a quiet Monday night, hundreds of people spread out across four floors of a suburban shopping mall to sing it. The song has been watched on YouTube nearly 800,000 times, and at least half a dozen English translations, and a Japanese iteration, have surfaced.\n\nThe composer is Thomas, a full-time musician in his mid-twenties who asked to be identified only by his first name. He says he recruited performers, as well as people to help with the mixing and arrangement, on Hong Kong’s Reddit-like forum LIHKG, after sharing a demo version last month.\n\n“Music is a tool for unity,” he tells TIME. “I really felt like we needed a song to unite us and boost our morale.”\n\nWhile he wrote the first draft of the lyrics, LIHKG users contributed suggestions in a thread that was upvoted more than a thousand times. One of them was the incorporation of “Reclaim Hong Kong, revolution of our time,” which has become one of the most commonly chanted phrases at pro-democracy protests.\n\n“The message to listeners is that despite the unhappiness and uncertainty of our time, Hong Kong people will not surrender,” the composer says.\n\nProtesters sing songs and shout slogans as they gather at Cityplaza shopping center after business hours in Hong Kong on Sep. 9, 2019. Anthony Kwan—Getty Images\n\nHe adds that he wrote the song as a protest march and that listeners are free to interpret it in any way they want to — including as a “national anthem,” as many have called it. While some protestors don’t agree with the label due to its implications with the controversial idea of separatism, all believe the song reflects the trials and tribulations of the now three months-long movement.\n\nIt’s not the first song to be taken up during Hong Kong’s anti-government demonstrations. At the start of the current wave of protests, Christians and non-Christians alike would break into choruses of “Sing Hallelujah to the Lord” during peaceful gatherings and tense police stand-offs.\n\n“Do You Hear the People Sing,” from Les Miserables, commonly sung during the 2014 Umbrella Revolution, also continues to be intoned today. Last week, students at a high school sang the Broadway tune over the Chinese national anthem, as seen in a video widely shared on social media.\n\nBut no other song has gained the traction that “Glory to Hong Kong” has.\n\n“The song gives me a very strong sense of belonging to Hong Kong,” says Calvin, a 18-year-old protestor. ” It summarizes our hopes, our targets, our ambitions.”\n\nA recent local survey has shown that only about a quarter of those polled identified themselves as “Chinese,” while more than half identified themselves as “Hongkongers.” The former British colony was retroceded to China in 1997, but its 7.2 million inhabitants remain culturally and linguistically distinct from mainland Chinese.\n\nWrite to Hillary Leung at hillary.leung@time.com.", "description": "Written by a young musician, with crowd-sourced lyrics, the song is being hailed as a \"national anthem\" by the protest movement.", "authors": ["Hillary Leung", "Hong Kong"], "top_image": "https://timedotcom.files.wordpress.com/2019/09/gettyimages-1166745252.jpg?quality=85&w=1200&h=628&crop=1", "published_at": "2019-09-10"}