{"pub": "cbc", "url": "https://cbc.ca/news/business/husky-kenney-sask-nfld-alta-alberta-1.5335823", "downloaded_at": "2019-10-26 08:45:45.745780+00:00", "title": "Why Husky is getting a tax cut in Alberta and spending big bucks elsewhere | CBC News", "language": "en", "text": "Alberta's first budget under Premier Jason Kenney this week was filled with deep cuts across the board, with few departments were spared.\n\nThe cuts, though, also extended to taxes.\n\nA slash of the corporate tax rate for all businesses, from 12 to eight per cent by 2022-23, is Kenney's main strategy to lure investment to the province, stimulate job growth, and resurrect the oilpatch.\n\nIt formalizes an election pledge made by the United Conservative Party, and when the first one per cent cut came into effect on July 1, it gave Alberta the lowest corporate tax rate in Canada.\n\nSo far, the appeal of that lower tax rate isn't making much of a difference.\n\nA prime example is Husky Energy, which saw a $233-million benefit from the Alberta tax cut in its second-quarter results. Yet the company is still choosing to spend a significant amount of its capital elsewhere — namely in Saskatchewan, Newfoundland and the U.S.\n\nHusky Energy president and CEO Rob Peabody addresses the company's annual general meeting in Calgary in April. (Jeff McIntosh/The Canadian Press)\n\nHusky CEO Rob Peabody said \"we really appreciate\" the tax changes and that he believes it's the right policy for the provincial government to take. But he said the company won't change its current direction, at least for the next few years.\n\n\"Our strategy still has all of our production growth in Western Canada is coming from Saskatchewan,\" he said during a conference call with investors.\n\nThis week, the company cut its workforce in Alberta, although Husky wouldn't say how many employees were laid off.\n\nLimits on selling oil\n\nThe main reason the Calgary-based company isn't spending more in Alberta is because the province is still limiting how much oil can be produced. The policy has forced companies to reduce the capacity of some of their facilities.\n\nThe previous NDP government chose to limit oil production in order to raise the price of oil and reduce storage levels in the province. Still, the policy is also diminishing how much companies want to spend in Alberta.\n\nThat's the exact opposite of what Kenney wants to achieve.\n\n\"Quotas have held back a lot of people making investments in Alberta,\" said Peabody. \"We would love to spend more money in Alberta, but unfortunately … there are quotas in place that mean we could spend to develop crude oil, but then they wouldn't let us sell it. So that doesn't make any sense.\"\n\nThe corporate tax cut in Alberta is not a 'game-changer' for how oil companies plan to invest their money, says analyst Michael Dunn. (Kyle Bakx/CBC)\n\nOver the last three months, the company spent $868 million on new projects, including on a heavy oil project in Saskatchewan, the West White Rose Project off the coast of Newfoundland, and two refineries south of the border.\n\nHusky expects to spend between $3.3-$3.5 billion on capital projects this year.\n\nThe Alberta government's decision to cut the corporate tax rate by four per cent over the next four years is expected to result in a $1-billion hit to provincial coffers. Beside the energy industry, the government anticipates increased business investment in the manufacturing, transportation and utility sectors.\n\nAs part of Kenney's \"open for business\" strategy, the government says it wants to cut red tape and better promote the construction of new pipelines.\n\nAnalyst Michael Dunn, of GMP FirstEnergy, also says the tax cut won't have a big impact on the oilpatch.\n\nGenerally, oil and gas companies aren't generating significant earnings in Alberta, he said, and some of them can apply past losses toward their tax bills. When Dunn reviewed the companies he covers in light of the tax cut, he didn't find it would make much of a difference for any of them.\n\n\"When that tax cut by Kenney was announced, we didn't go into our financial models for these companies and, all of a sudden, reduce the amount of cash taxes they are paying anytime soon,\" said Dunn.\n\nSpending plans\n\nMany of the larger companies with spare cash on hand are using the funds to pay down debt and buy back shares, instead of spending on new projects.\n\nOne company that does plan to invest in Alberta is Suncor, which recently announced a new $1.4-billion natural gas power plant in the oilsands.\n\nBut considering some oil companies are still restricting their production because of the curtailment policy, coupled with limited space on export pipelines, Dunn said there hasn't been much sector enthusiasm to invest in Alberta.\n\n\"[The tax cut] helps, but it's not a game-changer for these companies' near-term investment plans,\" he said.\n\nThe limits on oil production aren't ending anytime soon, since the UCP government extended the program to the end of 2020, in part because of pipeline capacity.\n\nPeabody said he has spoken to the premier about the issue, but the Husky executive won't speculate on when the policy might be lifted.\n\n\"Predicting these political outcomes seem to be getting more and more difficult, frankly,\" he said.", "description": "A slash of Alberta's corporate tax rate from 12 to eight per cent over the next few years is Jason Kenney's main strategy to lure investment to the province, stimulate job growth, and resurrect the oilpatch. But so far the lower tax rate isn't making much of a difference.", "authors": ["Kyle Bakx Is A Calgary-Based Journalist With Cbc'S Network Business Unit. He'S Covered Stories Across The Country", "Follow", "Kylebakx On Twitter"], "top_image": "https://i.cbc.ca/1.4844927.1572040928!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/oil-gas-earnings-20100201.jpg", "published_at": "2019-10-26"}