{"pub": "guardian", "url": "https://theguardian.com/environment/2019/oct/08/what-are-extinction-rebellion-key-demands-climate-emergency", "downloaded_at": "2019-10-08 15:07:30.803941+00:00", "title": "What are Extinction Rebellion's key demands?", "language": "en", "text": "Just 12 months ago, news that hundreds of environmental activists had been arrested for taking part in peaceful civil disobedience would have seemed unthinkable. Now, as evidence of the climate crisis escalates, it is becoming the new norm. This week, Extinction Rebellion activists are once again blockading central London, and other cities around the world. But why are they protesting, and can their key demands be met?\n\nWhy are Extinction Rebellion protesting this week?\n\nExtinction Rebellion activists want to force political leaders to take urgent action to address the climate emergency, and thousands of them have taken to the streets in cities around the world this week in an attempt to do just that. So far, in London, they have held 11 key sites and carried out a series of “actions” – from glueing themselves to government buildings to locking themselves to a funeral hearse parked across a junction at Trafalgar Square. There have been more than 300 arrests and campaigners say civil disobedience will ramp up as the week progresses.\n\nOrganisers say they plan to maintain the protests for at least 14 days, or until their demands are met.\n\nZuhura Plummer, a 36-year-old charity worker from Oxford who is taking part, said: “While we squabble over Brexit, the planet is burning. I don’t want to be doing this, I just want the government to listen to the science and act. … The moment to act is now, not 2050.”\n\nFacebook Twitter Pinterest Extinction Rebellion activists participate in a protest in Sydney, Australia. Photograph: James Gourley/EPA\n\nWhat are Extinction Rebellion’s demands?\n\nThe UK group has three core demands:\n\n1) Tell the truth\n\nThe government must tell the truth about the scale of the ecological crisis by declaring a climate emergency, “working with other groups and institutions to communicate the urgent need for change”.\n\n2) Net zero emissions by 2025\n\nThe UK must drastically cut its greenhouse gas emissions, hitting net zero by 2025.\n\n3) Citizens’ assembly\n\nThe government must create a citizens’ assembly to hear evidence and devise policy to tackle the climate crisis. Citizens’ assemblies bring together ordinary people to investigate, discuss and make recommendations on how to respond, in this case, to the ecological emergency.\n\nIn the US activists have added a further demand: “A just transition that prioritises the most vulnerable and indigenous sovereignty [and] establishes reparations and remediation led by and for black people, indigenous people, people of colour and poor communities for years of environmental injustice.”\n\nPlay Video 1:58 Extinction Rebellion protests launch around the world – video\n\nCan these demands be met?\n\n1) Tell the truth\n\nPartly through pressure from Extinction Rebellion and the school strike movement, scores of councils and local authorities in the UK have declared a climate emergency – as has the Labour party. In the aftermath of Extinction Rebellion’s April protests, the UK parliament followed suit. But despite increasing numbers of politicians – certainly on the opposition benches – acknowledging that this is the biggest challenge facing humanity, little has changed in terms of action. “We have seen no truth nor action,” said Extinction Rebellion, which said it had approached the government departments of BEIS, Department of Transport, Defra, and the Home Office for their plans to deal with the emergency. “We look forward to their response.” But the Conservative government seems increasingly hostile. Boris Johnson, who has rarely mentioned the ecological crisis since coming to office, dismissed the people taking part in the protests as “uncooperative crusties” who should stop blocking the streets with their “heaving hemp-smelling bivouacs”. [If you need reminding about why the climate crisis is a major global problem, the causes of it and the consequences, have a look at this article which explains it all in just 10 charts.]\n\n2) Zero emissions by 2025\n\nHitting net zero carbon emissions by 2025 would require a complete overhaul of the way we are organised as a society in just six years – fundamentally changing everything from transport to domestic and industrial energy systems, food production to overall levels of consumption. The UK government has set a target of net zero by 2050. Labour backed a much more ambitious target of 2030 at its recent party conference. The transformation required to meet these targets will be a huge challenge – but experts say that in itself would be dwarfed by the ensuing chaos of failing to act now.\n\nFacebook Twitter Pinterest Climate change activists use glue to stick themselves to a sign to block a road in Vienna, Austria. Photograph: Lisi Niesner/Reuters\n\n3) Citizens’ assembly\n\nA citizens’ assembly would, say advocates, help lend public legitimacy to what will need to be a radical tranformation of the economy and our society. They have been successfully used in a number of countries, from Ireland to Canada. This month a panel of 150 French citizens — from unemployed people to pensioners and factory workers — will begin advising President Emmanuel Macron on how France can cut its carbon emissions to tackle the climate emergency.", "description": "The environmental activists want to force political leaders to take urgent action on the climate emergency", "authors": ["Matthew Taylor"], "top_image": "https://i.guim.co.uk/img/media/495f4feb817dc827bb066cacf3386689f50d7223/0_360_6000_3600/master/6000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ce960419fb8ac80322a6ab60715abc41", "published_at": "2019-10-08"}