{"pub": "businessinsider", "url": "https://businessinsider.sg/pope-francis-warns-silicon-valley-about-ai-artificial-intelligence-2019-9", "downloaded_at": "2019-10-01 04:29:13.128898+00:00", "title": "Pope Francis warns Silicon Valley that if it isn’t careful with AI it could lead to an ‘unfortunate regression to a form of barbarism’", "language": "en", "text": "caption Pope Francis waves to the faithful as he leaves St. Peter’s Square at the the end of Palm Sunday Mass on March 29, 2015 in Vatican City, Vatican. source Franco Origlia/Getty Images\n\nPope Francis recently warned Silicon Valley executives about the moral implications of technology at a Vatican conference.\n\n“If mankind’s so-called technological progress were to become an enemy of the common good, this would lead to an unfortunate regression to a form of barbarism dictated by the law of the strongest,” he told conference attendees.\n\n“The Common Good in the Digital Age” conference addressed potential dangers misinformation and technologies including artificial intelligence and cyber security.\n\nVisit Business Insider’s homepage for more stories.\n\nPope Francis attended a Vatican conference last week and discussed what he sees as the moral and ethical issues that accompany technological advances, especially AI.\n\n“The Common Good in the Digital Age” conference held sessions like “The Common Good: Seeking Shared Values” and “Peacebuilding, technology, and the future of warfare,” and the Vatican invited theologians, academics, and tech executives to speak. Mozilla cofounder and executive chairwoman Mitchell Baker and Gavin Corn, director of Facebook’s cyber security law team, were a few of the Silicon Valley representatives who sat on panels.\n\nThe conference was scheduled for September 26-28, and Pope Francis spoke to the attendees on September 27.\n\n“The remarkable developments in the field of technology, in particular those dealing with artificial intelligence, raise increasingly significant implications in all areas of human activity,” he said at the conference, according to Reuters. “For this reason, open and concrete discussions on this theme are needed now more than ever.”\n\nHe also warned of potential moral problems new technologies can introduce.\n\n“If mankind’s so-called technological progress were to become an enemy of the common good, this would lead to an unfortunate regression to a form of barbarism dictated by the law of the strongest,” he said, according to Reuters.\n\nVatican officials suggested that this conference could be used for a future papal document on artificial intelligence. The Vatican has worked this way before, consulting with scientists and policy makers before releasing 2015’s “Laudato Si: On Care for Our Common Home,” an encyclical on the environment and climate change.", "description": "Business Insider - The Pope invited tech execs and academics to the Vatican to discuss the moral implications of AI at a recent conference.. Read more at businessinsider.sg", "authors": ["Mary Meisenzahl", "Business Insider Us"], "top_image": "https://static.businessinsider.sg/sites/2/2019/04/5cb9de1ad1a2f834347c4e32.jpg", "published_at": "2019-09-30"}