{"pub": "cnn", "url": "https://cnn.com/2019/10/12/tech/blizzard-hong-kong-response-blitzchung/index.html", "downloaded_at": "2019-10-12 17:49:06.527897+00:00", "title": "Blizzard said it will return prize money to Hong Kong esports player", "language": "en", "text": "New York (CNN) Video game company Blizzard Entertainment walked back some penalties on an esports player who aired support for the Hong Kong protests after gamers around the world called for a boycott of the company.\n\nBlizzard explained Friday that it disqualified Hearthstone player Ng \"Blitzchung\" Wai Chung for shouting the protest slogan \"Liberate Hong Kong, revolution of our times\" because it was a violation of rules that he had acknowledged. Anything that brings a player into \"public disrepute,\" offends the public, or damages Blizzard's image would lead to a ban and loss of prize money, according to the competition rules.\n\nThe company said that it will reduce Ng's suspension to six months from a year, and return lost prize money. Ng told CNN Business it is about $10,000 in winnings.\n\n\"We've had a chance to pause, to listen to our community, and to reflect on what we could have done better. In hindsight, our process wasn't adequate, and we reacted too quickly,\" J. Allen Brack, president of Blizzard Entertainment, wrote in a statement published Friday.\n\nActivision Blizzard ATVI a penalty was justified.\"There is a consequence for taking the conversation away from the purpose of the event and disrupting or derailing the broadcast,\" Brack said. The lengthy statement from, the maker of games including Call of Duty and World of Warcraft, walked back the full-year suspension while explaining why it believesa penalty was justified.\"There is a consequence for taking the conversation away from the purpose of the event and disrupting or derailing the broadcast,\" Brack said.\n\nRead More", "description": "Blizzard said it will shorten Hong Kong esports player \"Blitzchung\"'s ban to six months and return the prize money to him. But it stands by its decision to penalize \"Blitzchung\" for shouting a Hong Kong protest slogan.", "authors": ["Shannon Liao", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191010122731-ripley-gamer-hong-kong-pkg-super-tease.jpg", "published_at": "2019-10-12"}