{"pub": "thinkprogress", "url": "https://thinkprogress.org/climate-change-destroy-economy-paris-agreement-2044864013a4/", "downloaded_at": "2019-09-04 03:46:35.030058+00:00", "title": "Wealthy nations won’t be spared economic climate impacts, new study finds", "language": "en", "published_at": "2019-08-20", "text": "Failing to adequately address climate change could do significant damage to the U.S. economy and to global markets by the end of the century, new research out this week shows.\n\nThe study, published in the National Bureau of Economic Research (NBER) on Monday, is not the first to highlight the dramatic economic cost of allowing global warming to go unchecked. But the analysis is among the most comprehensive to focus on the sheer scope of potential impacts, emphasizing that climate change will have severe implications for even very wealthy nations.\n\nLower-income countries have been seen as the primary victims of rising temperatures, with research repeatedly indicating that tropical islands and regions like South Asia will be among the worst-hit. But the economic data from 174 nations analyzed for the NBER study shows that no country would be spared from grave climate impacts, including the United States.\n\nIn a “business as usual” scenario in the report, global emissions would remain high and temperatures would continue to increase at around 0.072 degrees Fahrenheit (0.04 degrees Celsius) per year, a scale based on current warming levels between 1960 and 2014. That scenario would be dire, bringing the world to 7.2 degrees Fahrenheit (4 degrees Celsius) of warming and resulting in GDP per capita worldwide taking a 7.2% blow by 2100. In the United States, that would translate to a deeper 10.5% real income cut.\n\nAdvertisement\n\n“[Our estimates] suggest that all regions (cold or hot, and rich or poor) would experience a relatively large fall in GDP per capita by 2100 in the absence of climate change policies,” wrote the research team, comprised of University of Cambridge researchers along with colleagues from the United States, Taiwan, and the International Monetary Fund (IMF).\n\nOther countries that could see GDP losses around 10% include Japan, India, and New Zealand. Canada, a county with a cold climate currently experiencing outsized warming, could experience a 13% GDP blow. Switzerland’s economy could be 12% smaller, with Russia’s taking a 9% dip.\n\nExperts almost unanimously agree that climate change will require significant mitigation and adaptation, with communities forced to change everything from transportation norms to eating habits in order to adjust to a warmer world. The NBER study acknowledges that these shifts will help countries stave off some impacts. However, scientific consensus indicates that it takes three decades to truly adapt to climate change, during which point warming only continues, requiring further adaptations.\n\nThe study also takes a close look at the United States, nodding to the importance of analyzing “geographically-diverse” nations.\n\nAdvertisement\n\n“By concentrating on the U.S., we were able to compare whether economic activity in hot or wet areas responds to temperature fluctuations around historical norms in the same way as that in cold or dry areas within a single large nation,” said Kamiar Mohaddes, co-author of the study and a member of Cambridge’s Faculty of Economics, in a statement.\n\nLooking at the contiguous United States, the researchers analyzed a number of sectors, including agriculture, manufacturing, mining, trade, and retail. They found that every single sector would see impacts from at least one aspect of climate change, including disasters like flooding and general fluctuations in heat.\n\nThose impacts could ultimately cause economic problems on a staggering scale.\n\n“Heavy rainfall prevents mountain access for mining and affects commodity prices. Cold snaps raise heating bills and high street spending drops,” said Mohaddes. “Heatwaves cause transport networks to shut down. All these things add up.”\n\nBut the study also offers a silver lining. The researchers mapped out a scenario in which the world “gets its act together” and adheres to the Paris Agreement. That pact seeks to keep the world from passing 3.6 degrees Fahrenheit (2 degrees Celsius) of global warming over preindustrial temperatures.\n\nIn the more optimistic scenario, global GDP loss could be limited to around 1.1%, the NBER study finds. The United States would see its GDP shrink less than 2%, as would Canada. Mohaddes pointed to that outcome as far more preferable and argued that meeting the Paris Agreement’s goals is a “good start” if affluent nations want to avoid economic crisis.\n\nAdvertisement\n\nThat might be easier said than done. President Donald Trump’s administration has touted climate impacts as a potential source of economic gain. Secretary of State Mike Pompeo argued in May that melting sea ice in the Arctic could present “new opportunities for trade” to the advantage of countries like the United States. Trump himself has said he will withdraw from the Paris climate agreement, arguing that the pact’s climate action agenda is too costly for the U.S. government.", "description": "", "authors": [], "top_image": "https://thinkprogress.org/wp-content/uploads/2019/08/GettyImages-1166468433.jpg?w=1920&h=1080&crop=1"}