{"pub": "afr", "url": "https://afr.com/rear-window/adrian-di-marco-lets-it-rip-for-wisetech-20191023-p533lo", "downloaded_at": "2019-10-23 12:14:06.253947+00:00", "title": "Adrian Di Marco lets it rip for WiseTech", "language": "en", "text": "Nobody will say it better than this newspaper’s markets editor Vesna Poljak did on Tuesday, but we’re nevertheless compelled to remark upon TechnologyOne executive chairman Adrian Di Marco’s spirited defence of Australian tech bagginess, WiseTech’s in particular.\n\n“You have a hard-working company here with WiseTech, a great chief executive who is a visionary guy doing the right thing and building a great business,” Di Marco assured our readers this week. “You can always find unhappy customers and staff and they'll let it rip if they're really unhappy because it didn't go their way.”\n\nCan’t you ever! Like when Di Marco is selling shares in TechnologyOne – all 51 million of them since 2005, raising a stonking $108.72 million. The elder tech bro sold the largest part of that fortune through Wilsons, but when the firm’s new head of research, Mark Bryan, downgraded TechnologyOne to a hold in August 2017, Di Marco let it rip, and this unhappy customer immediately took his business elsewhere. His last two sell-downs have reportedly been handled by UBS, where things must go his way.\n\nWhat’s more, TechnologyOne is no stranger to aggressive accounting tactics in order to maximise its reported profits. When International Financial Reporting Standard 15 forced it to report $27 million less FY19 revenue, the company offset it by capitalising (and amortising over three to seven years) its research and development spending. That will have the convenient effect of augmenting pretax profit by $26 million in FY19. And, as luck would have it, pretax profit is a key measure of Di Marco’s bonus. Which, after it vests, he can sell … through UBS!\n\nIf spreading empathy for a besieged Richard White is the point, we’re not so sure Di Marco’s the face for that campaign.", "description": "If spreading empathy for WiseTech's Richard White is the point, we're not sure Adrian Di Marco is the man for the job.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_1.6444%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/47817e1d683b534e4e8347cb7f2499c6466d61ef", "published_at": "2019-10-23"}