{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/09/WS5d9da64da310cf3e3556f805.html", "downloaded_at": "2019-10-09 10:42:34.615051+00:00", "title": "Major Chinese property developers report strong sales growth", "language": "en", "text": "Xinhua | Updated: 2019-10-09 17:20\n\nPotential homebuyers check out a housing project miniature model at a real estate agency in Dalian, Liaoning province. [Photo by Liu Debing/For China Daily]\n\nBEIJING - Major property developers in China saw better-than-expected sales growth in September, but tightened financing and market regulation still point to pressure on the industry in the coming months.\n\nContracted sales of China Evergrande Group, a leading property firm, set a new monthly record of 83.1 billion yuan (about $11.7 billion) in September, according to a company statement.\n\nCountry Garden, another property giant, said in a statement that contracted sales attributable to the company's shareholders amounted to 51.6 billion yuan in September, up 40.4 percent year-on-year.\n\nDuring the period, Sunac China's sales climbed 18 percent year-on-year to 62.9 billion yuan, the company announced Tuesday.\n\nSome medium-sized developers also posted strong growth, with Shimao Property recording a 57-percent year-on-year increase in sales.\n\nThe data come as the government maintains tighter regulation of the property sector, including home purchase curbs and stricter mortgage policies, to ensure that \"housing is for living in, not for speculation.\"\n\nDespite the robust monthly sales posted by major firms, the whole real estate sector still faces pressure due to slower growth and property controls, according to data from China Real Estate Information Corp (CRIC), an online industrial information provider.\n\nOf those developers that have set annual sales goals, only around 40 percent had accomplished over 75 percent of their goals by the end of September, CRIC data showed.\n\nYan Yuejin, a property researcher at E-house China R&D Institute, said real estate firms still face difficulties in reducing inventories, with no substantial improvement in their overall financial conditions.\n\nA CRIC report predicted that developers would step up market promotions in the fourth quarter to boost sales.", "description": "BEIJING - Major property developers in China saw better-than-expected sales growth in September, but tightened financing and market regulation still point to pressure on the industry in the coming months.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/09/5d9da64da310cf3e97a055e7.jpeg", "published_at": "2019-10-09"}