{"pub": "metro", "url": "https://metro.co.uk/2019/10/27/new-cases-of-deadly-alabama-rot-which-eats-flesh-of-dogs-found-in-uk-10991525", "downloaded_at": "2019-10-27 12:59:08.662474+00:00", "title": "New cases of deadly Alabama Rot which eats flesh of dogs found in UK", "language": "en", "text": "The lethal Alabama Rot disease has killed hundred of dogs in the UK (Picture: Wessex News)\n\nA new outbreak of a dreaded skin disease which kills dogs by eating their flesh has been reported in the UK.\n\nTwo new cases of the lethal Alabama Rot disease have been reported in the Forest of Dean in Gloucestershire and Westbury in Wiltshire.\n\nHundreds of canines have been killed by the vicious skin condition since it spread to the UK from the US seven years ago.\n\nOne of the key symptoms is lesions which can affect the lower limbs, mouth and tongue.\n\nWith an estimated nine million dogs in the UK, vets are urging pet owners to watch out for signs of the disease.\n\nA poor dog which has been infected with the Alabama Rot skin disease (Picture: Wessex News)\n\nThe latest cases were confirmed by Anderson Moores, a specialist veterinary referral centre in Winchester.\n\nAdvertisement\n\nAdvertisement\n\nDavid Walker, from Anderson Moores, said: ‘These further confirmed cases mean it is understandably very worrying for dog owners.\n\n‘However, this disease is still very rare, so we’re advising owners to remain calm but vigilant, and seek advice from their local vet if their dog develops unexplained skin lesions.’\n\nThe highest number of confirmed cases have been in Greater Manchester, Dorset, Devon and Hampshire’s New Forest.\n\nVets4Pets said that treatment is only successful in 20% of cases.\n\nLesions on Tyza, a victim in Redruth, Cornwall (Picture: Wessex News)\n\nDr Ian Hopkins, a vet, said: ‘The best advice is to continue enjoying exercising your dog but always be mindful of certain symptoms which may indicate a nasty disease such as Alabama Rot.\n\n‘These can include lethargy, vomiting and maybe your dog is drinking more than usual.\n\n‘With Alabama Rot, the dog will often have skin lesions or ulcers – in the mouth, on the tongue and lower limbs including feet are common place.\n\n‘However, the lesions are not always present and in the case we have just dealt with, there were no sign of any lesions at all.\n\n‘It affects all types of dogs of all ages which therefore makes it a matter of concern for all dog owners.’\n\nPet owners should contact their vets immediately if they see legions such as this on their dog (Picture: Wessex News)\n\nPet owners have also been warned about an invasion of slugs and snails carrying lungworm.\n\nHundreds of dogs have caught the bug in Somerset along with a small number in Cornwall.\n\nAdvertisement\n\nAdvertisement\n\nThe symptoms can include weight loss, difficulty breathing and a reduced appetite.\n\nDr Huw Stacey, vet and director of clinical services at Vets4Pets, said: ‘If a dog accidentally eats an infected slug or snail, or comes into contact with their slime, they can contract the disease.\n\n‘And the risk of dogs coming into contact with these infected molluscs is high, as it is believed that the average British garden contains over 20,000 slugs and snails, and the larvae which are released in the slime can survive for at least 15 days.’\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Two new cases of the lethal skin disease which has killed hundreds of canines have now been confirmed.", "authors": ["Paul Harper"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_92905118_1572178665.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-27"}