{"pub": "foxnews", "url": "https://foxnews.com/media/marc-thiessen-on-impeachment-democrats-are-risking-the-white-house-and-the-house-majority", "downloaded_at": "2019-09-14 01:44:08.920454+00:00", "title": "Marc Thiessen on impeachment: Dems are risking WH and House majority", "language": "en", "text": "Washington Post columnist Marc Thiessen appeared on \"Special Report with Bret Baier\" Friday and talked about the Democrats' push for impeachment proceedings against President Trump.\n\n\"This is a disaster for Democrats if they will go down this path,\" Thiessen said. \"They're not hurting Donald Trump, they're hurting themselves,\"\n\nPELOSI LASHES OUT AT REPORTERS ON IMPEACHMENT\n\nDemocrats on the House Judiciary Committee voted Thursday to define the rules for future committee impeachment hearings, amid widespread confusion. In the run-up, Democratic leadership has given muddled statements on whether they support an impeachment investigation or whether such a probe is even in progress.\n\nThiessen accused Democrats of not factoring in what Americans want.\n\n\"They're not listening to the American people,\" Thiessen said.\n\nThe columnist cited polling and focus groups as reasons why Democrats should change course on the issue.\n\n\"Americans see them as obsessed with impeachment and investigations at the expense of their agenda,\" Thiessen told Baier. \"That's going to hurt those ... seats they flipped in 2018 and Trump districts because those people want to focus on on the kitchen table issues.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThiessen said Democrats have more on the line in 2020 than the White House. \"It's risking not just the White House but their House majority,\" Thiessen said.\n\nFox News' Adam Shaw contributed to this report.", "description": "Washington Post columnist Marc Thiessen appeared on \"Special Report with Bret Baier\" Friday and talked about the Democrats' push for impeachment proceedings against President Trump.", "authors": ["Victor Garcia"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/marc-thiessen-headshot.jpg", "published_at": "2019-09-14"}