{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-mobile-rural/britains-mobile-operators-team-up-to-tackle-rural-not-spots-idUKKBN1X40NC", "downloaded_at": "2019-10-25 16:48:48.994002+00:00", "title": "Britain's mobile operators team up to tackle rural 'not-spots'", "language": "en", "text": "LONDON (Reuters) - Britain’s four mobile network operators have agreed to build a shared rural network, backed by government funds, banishing countryside “not-spots” where consumers are unable to get an adequate signal.\n\nFILE PHOTO: Different types of 4G, 5G and data radio relay antennas for mobile phone networks are pictured on a relay mast operated by Vodafone in Berlin, Germany April 8, 2019. REUTERS/Fabrizio Bensch/File Photo\n\nEE, Vodafone, O2 and Three will collectively spend 532 million pounds ($684 million) over 20 years, according to the plan published on Friday, potentially supported by a 500 million pound investment from the government.\n\nThe operators would invest in new and existing phone masts they would all share under the proposal, which the government hopes will be formalized early next year.\n\nDigital Secretary Nicky Morgan said she is determined to make sure no part of the country is left behind in mobile connectivity.\n\n“Brokering an agreement for mast sharing between networks alongside new investment in mobile infrastructure will mean people get good 4G signal no matter where they are or which provider they’re with,” she said.\n\n“But it is not yet a done deal and I want to see industry move quickly so we can reach a final agreement early next year.”\n\nThe operators have agreed to share existing masts and infrastructure in areas where there is coverage from at least one but not all operators.\n\nIf this is delivered, the government will then commit up to 500 million pounds of investment to eliminate total not-spots - the hard-to-reach areas where there is no coverage from any operator.\n\nThe agreement will bring high-quality 4G coverage to 95% of Britain by 2025, the government said.\n\nPoor mobile coverage in rural areas has been a problem in Britain for many years, affecting residents and visitors including former Prime Minister David Cameron, who has said he had to cut short holidays in Cornwall, in England’s south west, because of poor communications.\n\nThe government has pushed operators to come up with a solution, including proposing “in-country roaming”, where customers would switch to rival networks if they could not connect to their own.\n\nVodafone UK’s Chief Technology Officer Scott Petty said the networks started working on the plan a year ago, before engaging with government and the regulator Ofcom.\n\n“It will result in great coverage for the country in the most cost-effective way,” he said. “We are sharing our infrastructure as much as possible, it’s great for consumers, who will have maximum choice wherever they live in the UK.”\n\nThe allocation of costs had been agreed between the operators, depending on existing levels of coverage, he said.\n\nThe infrastructure sharing plan was far superior to in-country roaming, which was technically difficult, would drain users’ batteries and hamper competition and investment, he said.", "description": "Britain's four mobile network operators have agreed to build a shared rural network, backed by government funds, banishing countryside \"not-spots\" where consumers are unable to get an adequate signal.", "authors": ["Paul Sandle", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191025&t=2&i=1444834852&w=1200&r=LYNXMPEF9O0SA", "published_at": "2019-10-25"}