{"pub": "cbc", "url": "https://cbc.ca/news/politics/china-ambassador-dominic-barton-1.5269770", "downloaded_at": "2019-09-04 23:48:16.039486+00:00", "published_at": "2019-09-04", "title": "Trudeau names key adviser as Canada's new ambassador to China | CBC News", "language": "en", "text": "The Trudeau government has picked a trusted economic adviser as its new ambassador to China.\n\n\n\nDominic Barton will be heading to Beijing to take on the role after the Chinese government formally accepted his appointment.\n\n\n\nBarton serves as the chair of the finance minister's advisory council on economic growth and has helped the Trudeau government shape its economic policies and strategies.\n\n\n\nHe's also well known in the world of consulting as a former global managing partner at the firm McKinsey & Company.\n\n\"It is an honour to be appointed as Canada's Ambassador to China. The relationship between Canada and China is an important one, and I will work hard to represent our great country and to resolve the challenges that currently exist,\" Barton said in a statement.\n\n\n\nAccording to a corporate biography posted online, Barton has spent time in China before. He was based in Shanghai as the company's Asia chairman from 2004 to 2009.\n\nSources say Freeland revealed that Barton was Canada's choice for the post during her one-on-one meeting with Chinese Foreign Minister Wang Yi on the sidelines of the ASEAN summit in Bangkok last month.\n\nForeign Affairs Minister Chrystia Freeland shakes hands with Chinese Foreign Minister Wang Yi during a meeting on the sidelines of the ASEAN conference in Bangkok, Thailand. (@cafreeland/Twitter)\n\n\n\nThe federal government kept the selection process highly confidential due to the risk that Beijing, in the midst of a diplomatic standoff with Canada, might reject Ottawa's choice.\n\n\n\nAnd while this appointment is taking place shortly before a federal election, two sources say Freeland did not consult opposition parties about it.\n\n\n\nIf the Liberals lose the election, it's not clear whether the winning party would keep Barton in the role. The federal government kept the selection process highly confidential due to the risk that Beijing, in the midst of a diplomatic standoff with Canada, might reject Ottawa's choice.And while this appointment is taking place shortly before a federal election, two sources say Freeland did not consult opposition parties about it.If the Liberals lose the election, it's not clear whether the winning party would keep Barton in the role.\n\n\n\n\n\nCanada has been without an ambassador to China since January, when\n\n\n\nThe former cabinet minister turned diplomat was relieved of his duties after he twice weighed in publicly on the legal case against Huawei executive Meng Wanzhou.\n\n\n\nThe arrest of Meng, at the request of the United States, triggered a crisis in diplomatic relations between Canada and China. Canada has been without an ambassador to China since January, when Prime Minister Justin Trudeau fired John McCallum The former cabinet minister turned diplomat was relieved of his duties after he twice weighed in publicly on the legal case against Huawei executive Meng Wanzhou.The arrest of Meng, at the request of the United States, triggered a crisis in diplomatic relations between Canada and China.\n\nDiplomatic tensions rise\n\nBeijing was furious over Meng's arrest and has been demanding her immediate release.\n\n\n\nIn the ten months since, China has detained two Canadians, Michael Spavor and Michael Kovrig — a move widely seen as retaliation for Meng's arrest.\n\n\n\nChina also stopped buying large quantities of Canadian canola, blocked meat imports and tightened up screening of Canadian imports. Lobster and wheat sales to China, meanwhile, are booming.\n\nDuring a news conference in Toronto, Foreign Affairs Minister Chrystia Freeland was asked about past controversies involving the company for which Barton worked.\n\nThe New York Times reported in December that McKinsey held its corporate retreat in Kashgar, China in 2018 — about four miles from where thousands of Chinese Muslims are locked up in an internment camp. The United Nations has denounced the mass detentions.\n\nMcKinsey also has advised many Chinese state-owned clients, including one that helped build China's artificial islands in the South China Sea, which is a major point of military tension with the U.S.\n\n\"Our government has had, obviously, very detailed and extensive conversations with Mr Barton about what the role of ambassador to China for Canada entails, and that absolutely has included long discussions about the centrality of human rights, of women's rights, to Canada's foreign policy,\" Freeland said.\n\nAppointment 'carefully vetted'\n\nFreeland said the appointment was carefully vetted to ensure there is no conflict of interest. Barton must step down from corporate boards, however, and ensure any decisions about assets he holds are not in conflict with his public service commitments to Canada.\n\nFreeland said Barton's close personal connections to Trudeau and herself means he will have \"close and direct contacts\" that will help him do the job.\n\nShe said his appointment sends \"an important message to China\" about how much Canada values its relationship with China.\n\nConservative foreign affairs critic Erin O'Toole released a statement today criticizing the appointment, saying the situation with China calls for an experienced diplomat in the role of ambassador, not a \"corporate executive advocating for doing business with China as usual.\"\n\n\"He is replacing one Liberal insider with another Liberal insider at a time that we should have a professional diplomat who is conversant with the language, culture and protocols needed to secure the swift release of Canadian citizens and stabilization of export trade,\" he said.\n\n\"Mr. Barton has had great success in the private sector and has been a senior adviser to the Trudeau government, but he has no experience in diplomacy headed into a major diplomatic crisis.\"\n\nRobert Malley is president and CEO of the Crisis Group, an international conflict-resolution analysis consultancy that employs Kovrig. He called the appointment \"gratifying\" news, adding he believes Barton is dedicated to securing the release of the detained Canadians.\n\nHe has the credibility and stature to effectively convey Canada's position and has strong connections to Prime Minister Trudeau and the business world in Asia, he said.\n\n\"I think it means that there's an interlocutor now who will be in Beijing who has the direct ear of the prime minister and obviously could communicate with Chinese leaders,\" he told CBC.\n\n\"An ambassador always is a function of how authoritative one thinks he or she is, and in this case, obviously it can't get much more authoritative. So that's another reason, aside from the fact that I know his commitment to the release of Canadian citizens arbitrarily detained — that's another reason why it's a good choice.\"\n\nPositive signal?\n\nRoland Paris, a professor of international affairs at the University of Ottawa and a former foreign policy adviser to Trudeau, said he sees the appointment as a positive signal that a frosty diplomatic relationship may be thawing. Barton's background and understanding of China will help him navigate the complexities of China's governmental system, he said.\n\n\"He'll need that, because we're in a very serious standoff with China now over the detention of the two Canadians. I think he needs to focus first and foremost on the well-being of those two Canadians, and I'm sure he'll do that,\" he said.\n\nGuy Saint-Jacques, who served as Canada's ambassador to China from 2012-2016, called Barton an \"interesting choice.\"\n\n\"Trudeau wanted him to replace me in 2016 but he declined,\" he said.\n\n\"While he doesn't speak Mandarin, he had good contacts with Chinese leaders in his previous job. This being said, I don't think he will have better access than a career diplomat in present circumstances.\"", "description": "The Trudeau government has picked a trusted economic adviser to be its new ambassador to China. Sources tell CBC News that Dominic Barton will be heading to Beijing to take on the role, after the Chinese government formally accepted his appointment.", "authors": [], "top_image": "https://i.cbc.ca/1.4501310.1516797101!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/trudeau-davos-20180124.jpg"}