{"pub": "financialpost", "url": "https://business.financialpost.com/news/retail-marketing/thomas-cook-collapse-2", "downloaded_at": "2019-10-07 20:04:31.586418+00:00", "title": "Thomas Cook bosses were warned of more than $12 billion in claims ahead of collapse", "language": "en", "text": "Thomas Cook bosses were warned ahead of its collapse that creditor claims could be above 10 billion pounds (US$12.3 billion), as a complex network of off-balance-sheet guarantees unwound.\n\nA confidential report, prepared just days before the 178-year-old company’s failure and seen by The Daily Telegraph, lays bare how an insolvency would wreak havoc across the travel sector, leaving huge debts owed to hoteliers, intermediaries and other suppliers. Many suppliers could expect to recoup just 3.4 pence in every pound owed to them. Bondholders, whose debts totalled more than 1 billion pounds, may only recover 2.3 pence.\n\nSuppliers and bondholders may recover only pennies on the pound, as European taxpayers bill nears 1 billion pounds\n\nThe Thomas Cook brand, once one of the oldest and most revered names in the travel industry, was worth as little as 1.3 million pounds, the report by advisers AlixPartners found. AlixPartners, alongside KPMG, are now handling the liquidation of the company.\n\nThe gloomy predictions come as the bill to European taxpayers of Thomas Cook’s collapse could soon swell to more than 1 billion pounds. Governments across Europe have already shelled out 900 million pounds. While Germany, Spain and Portugal have injected 830 million euros in loans and bailouts to prop up Thomas Cook subsidiaries and protect against contagion, Britain’s bill – to fly customers home and fund redundancy pay – is already estimated at 160 million pounds.\n\nIt has taken the Civil Aviation Authority (CAA) and Whitehall officials two weeks to repatriate more than 150,000 UK holidaymakers. With the final flights arriving yesterday, officials will this week focus on bringing in new system to avoid similar fallout from any future collapses in the travel sector.\n\nThe claims in the report differ to debts disclosed upon collapse of 3.1 billion pounds because of the triggering of multiple guarantees. The analysis lifts the lid on what can be realized from the carcass of Thomas Cook. Other than cash, its assets were only worth 59 million pounds – this a company that had a stock market value of more than 2 billion pounds 18 months ago.\n\nThe sale of take-off and landing slots “is likely to be highly contentious in all jurisdictions,” the analysis found. Slots outside of Britain were deemed worthless. There would only be a “short-period” during which value can be realized from those at UK airports.\n\nHowever, the race to snap up such slots – Thomas Cook had around 200 at London Gatwick and 350 at Manchester – is hotting up, with Air France KLM adding its name to interested parties.\n\n“Clearly we see a saturation point in Europe,” Pieter Elbers, the chief executive of Dutch arm KLM told The Telegraph. “We of course will follow very closely which slots become available.”\n\nIAG, British Airways’ parent company, and easyJet have also said they are interested in Thomas Cook’s slots. Virgin Atlantic, part-owned by Air France KLM, may also be interested.\n\nMinisters have been criticized for rejecting a plea to plug a 200 million pound shortfall in Thomas Cook’s rescue plan in late September. Manuel Cortes, of UK union TSSA, said: “As the governments of Portugal, Spain and Germany have demonstrated, ministers here sitting on their hands is down to their lack of political will rather than EU state aid rules.”\n\nA spokesman for the Department for Transport defended the Government’s decision not to step in, saying: “Unfortunately airlines and tour operators do fail. It is not the Government’s role to prop them up, and any financial assistance risks setting a precedent. We believe anyone looking at the details of this collapse will conclude a rescue deal would have been a poor use of taxpayer money, with no guarantee the company would have remained solvent.”\n\nA spokesman for the official receiver said yesterday: “The official receiver as liquidator will look at the conduct of the directors and the affairs of the company during his investigations into the failure of the company.”\n\nAlixPartners and KPMG declined to comment.", "description": "Confidential report reveals how insolvency could wreak havoc across travel sector, leaving huge debts owed to hoteliers and other suppliers", "authors": ["Oliver Gill In London", "The Telegraph"], "top_image": "https://financialpostcom.files.wordpress.com/2019/10/thomas-cook.jpg", "published_at": "2019-10-07"}