{"pub": "rt", "url": "https://rt.com/uk/471150-plane-aborted-landing-kate-william", "downloaded_at": "2019-10-18 01:17:48.420930+00:00", "title": "Prince William says he and wife Kate are fine after plane twice aborts landing in Islamabad", "language": "en", "text": "Britain’s Prince William says he and his wife Kate are “fine” after their plane twice failed to land in Islamabad, Pakistan due to a thunderstorm. The aircraft carrying royal couple was ultimately forced to return to Lahore.\n\nThe royals are on a four-day visit to Pakistan. They failed to reach Islamabad on Thursday, however, as their RAF Voyager plane was unable to land due to extreme weather conditions.\n\nThe pilots attempted to land at Islamabad International Airport and Rawalpindi air base. They ultimately gave up and decided to return to Lahore.\n\nAlso on rt.com Passengers left with fractures, cuts & serious injuries in TERRIFYING turbulence hit flight\n\nUpon touching down, Prince William told reporters that he and his wife were fine and joked that the landing issues had been caused by him piloting the plane. William has previously worked as a search and rescue helicopter pilot, thus him taking control of a plane is not an entirely unrealistic scenario.\n\nThe royal family is no stranger to transportation issues. Earlier this year, Queen Elizabeth’s husband Prince Philip, 98, was involved in a car crash, and was then caught driving without seatbelt two days later. As the controversy over his ability to drive grew, Philip voluntarily surrendered his driver’s license and has only driven on private land since.\n\nLike this story? Share it with a friend!", "description": "Britain’s Prince William says he and his wife Kate are “fine” after their plane twice failed to land in Islamabad, Pakistan due to a thunderstorm. The aircraft carrying royal couple was ultimately forced to return to Lahore.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5da88f5f85f54020617a96b7.jpg", "published_at": "2019-10-18"}