{"pub": "news.com.au", "url": "https://adelaidenow.com.au/news/south-australia/sas-breaking-news-blog-the-pulse-pedestrian-suffers-leg-injuries-after-being-hit-by-driver-who-allegedly-attempted-to-run-several-people-over-after-argument/live-coverage/3dd5978c84b7885c021043f8c0cdb61a", "downloaded_at": "2019-10-18 01:09:56.491496+00:00", "title": "Man hit by driver who allegedly attempted to run people over", "language": "en", "text": "An argument has resulted in a man being arrested after he allegedly attempted to run over multiple people, hitting a pedestrian, in Adelaide's south.\n\nEmergency service crews were called to Glynville Dr in Hackham West at about 9:55pm on Thursday following reports of a disturbance in the street.\n\nPolice say the driver of a Holden sedan tried to run over several people whom he had an argument with when he crashed his car into the front of a dance studio, reversed away and hit a man who was standing on the footpath.\n\nThe pedestrian was taken to hospital for treatment for leg injuries.\n\nThe driver was detained at the scene by officers.\n\nHe has since been arrested and charged with four counts of acts to endanger life, assault causing serious harm and property damage.\n\nHe has been refused bail and will appear in Christies Beach Magistrates Court later today.\n\nDetectives are investigating the incident and urge anyone with information to contact Crime Stoppers on 1800 333 000, or online at www.crimestopperssa.com.au.\n\nIt is the second crash involving a pedestrian in the Hackham area this week.\n\nIn a separate incident, a man was taken to Flinders Medical Centre with serious leg injuries and a head injury after being hit by car on Main South Rd on Wednesday.\n\nA man was hit in his driveway after a driver tried to run people down and crashed into the front of a Hackham dance studio. pic.twitter.com/oW6vws1VFJ — Josephine Lim (@johzlim) October 17, 2019\n\nDriver reported over hit-run crash in the CBD\n\nMeanwhile, a driver has been reported after allegedly hitting a pedestrian in the CBD then fleeing the scene last night.\n\nPolice and paramedics were called to the intersection of George St and Hindley St just before 11.30pm where a pedestrian, a 32-year-old man from Myrtle Bank, had been involved in a hit-run incident.\n\nThe man sustained non life-threatening injuries and was taken to the Royal Adelaide Hospital.\n\nAlthough the driver was stopped by the pedestrian and a member of the public for a short time after the collision, the silver Holden Commodore sedan drove away, heading east along Hindley St.\n\nFollowing investigations, police reported the alleged driver - a 48-year-old man from Greenwith.\n\nHe was reported for driving without due care and failing to stop at the scene of a crash.\n\nHe will be summoned to appear in court at a later date.\n\nFOLLOW ALL THE MORNING'S BREAKING NEWS BELOW", "description": "An argument has resulted in a man being arrested after he allegedly attempted to run over multiple people, hitting a pedestrian, in Adelaide's south. Meanwhile, a man has been reported following a hit-run incident in the CBD.", "authors": ["Emily Cosenza"], "top_image": "https://adelaidenownewscorpau.files.wordpress.com/2019/10/ehg6ocjueaatz7p.jpg?crop=0px%2C0px%2C2048px%2C1154px&resize=1280%2C720&strip=all", "published_at": "2019-10-17"}