{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/nfl/article-7544455/Matt-Nagy-refuses-blame-Chicago-Bears-late-arrival-costly-defeat-Oakland-Raiders.html", "downloaded_at": "2019-10-07 01:10:04.701677+00:00", "title": "Matt Nagy refuses to blame Chicago Bears' late arrival for costly defeat by Oakland Raiders", "language": "en", "text": "It has become commonplace for NFL teams to arrive late in the week before playing in London.\n\nThe Oakland Raiders broke the mould last week, becoming the first team to arrive on Monday since the Los Angeles Rams in 2016.\n\nThe Chicago Bears landed on Friday - and it seemed to take them half of the game to wake up.\n\nBut coach Matt Nagy was not using it as an excuse following their gut-wrenching 24-21 defeat by Oakland.\n\nMo Hurst sacks Bears quarterback Chase Daniel during a superb win for the Raiders\n\n'Had nothing to do with when we came here and when we didn't. It's about playing football,' Nagy said.\n\nIn a game littered with errors, Oakland raced into a 17-0 lead at half-time before the Bears scored 21 unanswered points. Oakland retook the lead late in the fourth quarter largely thanks to coach Jon Gruden's fake punt on a fourth and one.\n\n'Yeah, yeah, you know that. You've still got to stop it. We knew that it could certainly come. You've got to stop it,' Nagy said.\n\nAfter back-up quarterback Chase Daniel led them to a win against NFC North rivals Minnesota last week, the Bears came back to earth with an uneven performance from the signal-caller.\n\nDaniel, who threw two costly interceptions, shouldered the blame: 'It's completely on me. Yeah, I mean, there's no excuses for it. You're in a chance to - you're 16, 17 yards away with a chance to tie the game and send it to overtime, and I like our chances the way we've been playing really in the second half.\n\nPass rusher Khalil Mack had a frustrating afternoon against his former team\n\n'It's unfortunate, just we didn't get a lot of chances in the first half, and when we did we turned the ball over. I took a sack. We couldn't stay on the field. We weren't very good.'\n\nThe Bears managed only 236 total yards and 42 rushing yards and lost pass rusher Akiem Hicks early in the game.", "description": "It has become commonplace for NFL teams to arrive late in the week before playing  in London. The Chicago Bears landed on Friday - and it took them half of the game to wake up.", "authors": ["Peter Carline For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/00/19374564-0-image-a-5_1570405589358.jpg", "published_at": "2019-10-06"}