{"pub": "theverge", "url": "https://theverge.com/2019/10/24/20930214/motorola-moto-g8-plus-one-macro-e6-play-release-date-specs-price-features-camera", "downloaded_at": "2019-10-24 14:57:58.111136+00:00", "title": "Motorola’s Moto G8 Plus announced with three cameras and a big battery", "language": "en", "text": "Motorola’s Moto G8 Plus is the latest G-series device from the budget phone manufacturer. It’s the latest in a series of smartphones with previous entries that have been some of the best budget smartphones you can currently buy. The biggest improvements come with the phone’s camera, which has been bumped up from a dual rear camera to a triple-camera array. Alongside the G8 Plus, Motorola has also announced the Motorola One Macro and Moto E6 Play.\n\nThe £239 (€269) Moto G8 Plus comes with three rear cameras, a main 48-megapixel f/1.7 camera, a 2-megapixel f/2.2 depth sensor, and an 8-megapixel f/2.2 ultra-wide angle camera with a 117-degree field of view. There’s also a laser autofocus sensor on the back, while on the front of the device there’s a 25-megapixel selfie camera enclosed within a small notch above the phone’s 6.3-inch 1080p display.\n\nMotorola has also increased the size of the battery inside of the G8 Plus compared to the G7 Plus. It’s now 4,000mAh, making it a 1,000mAh increase over its predecessor’s 3,000mAh, and it includes 15W TurboPower fast charging. Internally, the phone has a Qualcomm Snapdragon 665 processor, 4GB of RAM, and 64GB of internal storage, which is expandable with up to 512GB of microSD card storage. The phone will be available starting on October 28th in the UK.\n\nMeanwhile, the £179 (€199) Motorola One Macro’s main feature is its dedicated 2-megapixel macro camera, which Motorola claims can let you focus on objects as close as two centimeters away. Alongside the macro camera, there’s also a 13-megapixel f/2.0 main camera, and a 2-megapixel f/2.2 depth sensor. The phone is powered by a MediaTek Helio P70 processor, and it comes with 4GB of RAM, 64GB of storage, a 6.2-inch 720p display, and a 4,000mAh battery. Like the G8 Plus, the phone will also be available on October 28th.\n\nFinally, there’s the budget Moto E6 Play, which Motorola says will retail for under £99 when it releases in the UK in January 2020 and €109 in Europe. It includes a 13-megapixel camera, 5.5-inch 720p display, and it has a 3,000mAh battery. You also get 32GB of internal storage, which is expandable.\n\nUnfortunately, Motorola wasn’t immediately able to provide us with information about whether any of the devices will be receiving a US release, but we’ll update this piece if that changes.", "description": "Motorola has announced three budget devices: the Moto G8 Plus, the Moto E6 Play, and the Motorola One Macro. The Moto G8 Plus features a rear-triple camera array and comes with a large 4,000mAh battery.", "authors": ["Jon Porter", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/8CdYaau2skBnR_vSPCWsl5H-Rj8=/0x137:7200x3907/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19315360/moto_g8_plus____COSMIC_BLUE___COMBO.jpg", "published_at": "2019-10-24"}