{"pub": "afr", "url": "https://afr.com/markets/equity-markets/why-investors-should-be-wary-of-gold-20191017-p531hg", "downloaded_at": "2019-10-17 08:06:07.540089+00:00", "title": "Why investors should be wary of gold", "language": "en", "text": "Still, he said that gold is costly to mine and so far demand has persisted for the precious metal. \"I don’t see gold prices falling much from here but who knows how much higher it can go.\"\n\nA popular stock for Australian investors is healthcare company CSL, which this week traded over $250 a share for the first time. Ms Howitt said that CSL is a high-quality business, while acknowledging its \"valuation is a bit stretched\".\n\nStill, healthcare is a sector where investors generally prefer high quality, high returning, high growth business, she said.\n\n\"So, yes, the valuation is a bit stretched but we think that the stock continues to work until there is a headwind. We can't see that right now because demand for the underlying products is quite strong with various growth options such as China and various biologic indication that the company is bringing to market.\"\n\nThe fund manager said CSL's large market capitalisation makes it attractive at the large cap end of the market which is dominated by banks and miners.\n\nThe focus turned to AMP, which Mr Mawhinney described as \"a very poor quality company\".\n\n\"So the price you pay for it does need to be very low for taking on that risk but it's also a company with an enormous amount of negative sentiment attached to it. It's a very difficult company to own and it's the one company that we get asked about in every single meeting,\" he said.\n\nBut he made the point that AMP is more than financial advice, with a bank and an asset management arm. \"So we think that you get that business for free and perhaps rightly so.\"\n\nMr Mawhinney was unimpressed by the prospect of investing in Telstra.\n\n\"I think there are a lot more attractive companies out there than Telstra,\" the fund manager said. \"It's a utility-style earnings stream in a world of low-returning assets,\" he said. \"I think it's OK, but I don't think it's going to make anyone rich from here.\"", "description": "Gold could easily turn sour, AMP is \"poor quality,\" CSL is high quality but its valuation is \"stretched\", and Telstra isn't going to make anyone rich, top fund managers say.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.3232%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_589%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/44fef716e61c0e874f47a1d0bacfdbfa160ab748", "published_at": "2019-10-17"}