{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/british-hair-stylist-30-dies-20589225", "downloaded_at": "2019-10-16 08:30:08.758891+00:00", "title": "British hair stylist, 30, dies after being hit by motorbike on holiday in Spain", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA British holidaymaker has died after being hit by a motorbike while walking in a Spanish resort.\n\nScott Taylor, from Loughborough, died in Calpe on the Costa Blanca, following the collision, which happened on Monday morning.\n\nA Spanish newspaper reported that specialist medical teams and a life support unit were called to the scene, on the N-332 road, but were unable to save his life, LeicestershireLive reports.\n\nFriends of the 30-year-old, who was also known as Scotty, have set up a crowdfunding page to help pay for his funeral.\n\nCharlotte Maclennan, who is organising the fund-raiser, said on the page: \"Hello everyone, as most of you know our Scotty passed away while on holiday while in Spain and I can’t actually believe I’m having to do this if I’m honest.\n\n\"Due to Scott’s parents using every last penny to get our Scotty home, there’s no spare money left for his funeral.\n\n\"Scott loved a good party. So I’m asking all them that loved him to donate to help Tina, Julian, John, Jodie and Kyla give their son and brother and our dearest, most special friend the biggest send off anyone has ever seen.\n\n\"Please do this for Scott.\"\n\nLifelong family friend Charlotte told LeicestershireLive: \"It happened in the early hours of Monday, at around 2am.\n\n\"He was on holiday with a friend and had only been there for two days.\n\n\"The friend had already gone home, but he wasn't ready to go and stayed.\n\n\"We first heard after Scott's boyfriend tried to get hold of him on his phone and the Spanish police answered.\"\n\nCharlotte was able to speak to an English interpreter who conveyed the news that Scott had died.\n\nScott had worked as a hair stylist at family-run Taylor & Co in Loughborough, for about two years.\n\nCharlotte added: \"People loved him, there were so many people that loved him.\"\n\nMum Tina is currently in Spain along with her husband, Scott's step-dad, John Brinkworth. His dad, Julian, was too upset to go.\n\nCharlotte added: \"Scott also had two sisters, Jodie, who's 27, and Kyla, 12.\n\n\"This has ripped the family apart.\n\n\"I've spoken to the British Embassy and they've told me it shouldn't take longer than a week to get him back home.\n\n\"Scott's family will have to spend their life savings to get him back and won't be able to afford to pay for the funeral which is why we've set up the GoFundMe page to help give him the send-off he deserves.\"\n\nA message on the Facebook page of Taylor & Co Hair and Beauty, reads: \"Due to such tragic news off the loss of our family member but also our team member of Taylor & Co, the salon will be closed for a few days for the rest of the team to process what has happened but don’t worry we will be back... and stronger than ever.\n\n\"For Scott ❤ Cristy and the team xx\"\n\nAmong the many comments and tributes posted online is one which reads: \"Let's give this special person such a special send off.\n\n\"Let's all have one last party with Scotty Taylor.\"", "description": "Friends of Scott Taylor, from Loughborough, have launched a fundraiser to pay for his funeral following the tragedy on the Costa Blanca", "authors": ["Alan Thompson", "Lorraine King"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20589205.ece/ALTERNATES/s1200/0_Leicestershire-man-Scott-Taylor-killed-by-motorbike-while-on-holiday-in-Spain.jpg", "published_at": "2019-10-16"}