{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/breaking-mp-mark-field-who-20644559", "downloaded_at": "2019-10-18 01:15:38.418792+00:00", "title": "MP Mark Field who was sacked after grabbing activist standing down at election", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nTory MP Mark Field has announced he will not be standing in the next general election.\n\nMr Field - who was filmed grabbing a woman by the neck during a black tie dinner event - has held the Cities of London and Westminster seat since 2001.\n\nHe said in a statement to his local association he was proud of his reputation as a \"moderate, consensual MP, invariably keen to work effectively across party lines to the benefit of constituents and communities alike\".\n\nBut he added: \"However, such a pragmatic, co-operative approach to public service has been tested to destruction in the fractious, febrile and deeply divisive aftermath to the EU referendum in 2016.\n\n(Image: AFP/Getty Images)\n\n(Image: ITV)\n\n\"I had dearly hoped that by the time of the next general election these issues would have been resolved.\n\n\"However, it is increasingly clear that divisions over Brexit and our future relationship with the EU-27 will dominate and define domestic politics for many years to come.\"\n\nMr Fields caused controversy this summer after he was filmed manhandling an environmental protester at the Chancellor's Mansion House speech.\n\n(Image: Mark Thomas/REX/Shutterstock)\n\n(Image: PA Archive/PA Images)\n\nThe 55-year-old was later sacked from his ministerial role at the Foreign Office as part of a cabinet reshuffle.\n\nCity of London Police launched an investigation into the incident but later it announced it would not be taking further action.", "description": "The \nTory MP was widely criticised after he grabbed a Greenpeace activist during a black tie event at Mansion House in London earlier this summer", "authors": ["Neil Murphy", "Image", "Afp Getty Images", "Itv", "Mark Thomas Rex Shutterstock", "Pa Archive Pa Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20644557.ece/ALTERNATES/s1200/0_Politicians-Westminster-London-UK-15-Nov-2018.jpg", "published_at": "2019-10-17"}