{"pub": "indiatimes", "url": "https://indiatimes.com/news/india/pmc-account-holder-dies-of-heart-attack-sms-blocked-in-kashmir-more-top-news-377881.html", "downloaded_at": "2019-10-15 15:00:56.217503+00:00", "title": "PMC Account Holder Dies Of Heart Attack, SMS Blocked In Kashmir + More Top News", "language": "en", "text": "The Punjab and Maharashtra Cooperative (PMC) Bank crisis claimed another life on October 14 after 51-year-old Sanjay Gulati died of cardiac arrest after returning home from a protest against the PMC Bank scam. Read more\n\nHere's more top news of the day:\n\n1) After 72 Days Of Communication Blackout, Kashmiris Charged For Blocked Phones & Connections Disrupted For Unpaid Bills\n\nFor many in the Valley, it was no less than a celebratory occasion, for it was a time to reconnect with family members and friends, and for some, another chance at getting back in the business. Read more\n\n2) Why Nobel Laureate Abhijit Banerjee Became A Target Of Hate, Trolls & Called 'Anti-National'\n\nDon't Miss 1.5 K SHARES 955 SHARES 1 K SHARES\n\nIndian-American Abhijit Banerjee, who won Sveriges Riksbank Prize in Economic Sciences, is everything obverse of what the current prime minister Narendra Modi-led ruling Bharatiya Janata Party and its followers believe in. Read more\n\n3) 'Focus More On Women Instead Of Cows': Miss Kohima Contestant's Message For PM Narendra Modi\n\nVikuonuo Sachu, an 18-year-old participant at the pageant, was armed with an answer when she was asked by one of the judges what she would tell PM Modi if he asked her to chat with him. Read more\n\n4) From SDM To Minister, Helpless Flood Victims Of Bihar Out To Teach Authorities A Lesson\n\nThe authorities failed to clear the water-logged areas for well over a week and this revealed their incompetence as well as unpreparedness in dealing with a crisis that ravages many parts of the down-trodden state on an annual basis. Read more\n\n5) Delhi's Air Quality Remains 'Poor' As We Get Closer To Diwali, Might Get Worse Due To Stubble Burning\n\nOn Sunday, it turned \"very poor\" with the overall Air Quality Index going beyond the 300 mark, but on Monday, it had improved by around 50 points. Read more", "description": "The Punjab and Maharashtra Cooperative (PMC) Bank crisis claimed another life on October 14 after 51-year-old Sanjay Gulati died of cardiac arrest after returning home from a protest against the PMC Bank scam. Read moreFor many in the Valley, it was no less than a celebratory occasion, for it was a time to reconnect with family members and friends, and for some, another chance at getting back in t", "authors": [], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/pmc_account_holder_dies_of_heart_attack_sms_blocked_in_valley__more_top_news_1571141218_800x420.jpg", "published_at": "2019-10-15"}