{"pub": "townhall", "url": "https://townhall.com/tipsheet/juliorosas/2019/10/08/acting-dhs-secretary-heckled-by-immigrant-protesters-at-georgetown-university-n2554291", "downloaded_at": "2019-10-08 15:02:46.138433+00:00", "title": "Georgetown Pro-Illegal Immigration Group Invokes 'Heckler's Veto'; Blocks Acting DHS Secretary's Speech", "language": "en", "text": "Pro-illegal immigration protesters invoked what is colloquially known as the \"hecker's veto\" against Acting Secretary of Homeland Security Kevin McAleenan on Tuesday night as he tried to give a speech at Georgetown University before walking off stage without delivering his remarks.\n\nThe protesters continually interrupted McAleenan on Monday by chanting, “When immigrants are under attack, what do we do? Stand up, fight back! When immigrants are under attack, what do we do? Stand up, fight back!\" and \"When children are under attack, what do we do? Stand up, fight back!\"\n\nAt one point, one of the moderators of the event tried to get the protester to stop interrupting.\n\n\"Please, that’s enough now. We hear you. This is a forum where we respect free speech, we respect the right to protest. But with respect to the audience who wants to hear this speaker, let’s save the rest of it for the Q&A period,\" she said.\n\nAfter trying to speak multiple times, McAleenan eventually left the stage after it became clear the protesters would not stop chanting.\n\nThe Migration Policy Institute, who hosted the event, said in a statement it was regrettable McAleenan was unable to deliver his remarks.\n\n\"By drowning out the Secretary's remarks, the protesters deprived immigration attorneys, service providers, journalists, advocates, business leaders, law students, and many others in the public who were in the audience from hearing his point of view and engaging in a meaningful dialogue,\" the group said.\n\nAnd we're off! Follow #immconf today for 16th annual immigration law & policy conference. First up, keynote by DHS secretary Kevin McAleenan pic.twitter.com/CmYiVBFm7R — MigrationPolicy Inst (@MigrationPolicy) October 7, 2019\n\nMcAleenan, who is also the Customs and Border Protection commissioner, has been the acting secretary since replacing former Secretary Kirstjen Nielsen.\n\n\n\n", "description": ".10/08/2019 10:58:03AM EST.", "authors": ["Julio Rosas", "Cortney O'Brien", "Leah Barkoukis", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/98/aa1a747b-5b8b-446e-a3e6-37893a41180d.png", "published_at": "2019-10-08"}