{"pub": "yahoo", "url": "https://sports.yahoo.com/aaron-donald-goes-full-darth-vader-hoisting-devonta-freeman-in-fight-193725136.html", "downloaded_at": "2019-10-20 23:31:08.959299+00:00", "title": "Aaron Donald goes full Darth Vader, hoisting Devonta Freeman in fight", "language": "en", "text": "ATLANTA — Pro tip: if you’re going to fight, don’t fight Aaron Donald.\n\nThe Atlanta Falcons, in the midst of a miserable stretch of football that shows no signs of abating, were suffering through yet another beatdown against the Los Angeles Rams. Matt Ryan had just thrown an interception, and for the Falcons, that was about enough. Atlanta’s Devonta Freeman decided to go after the Rams’ Donald, who responded as if Freeman was concealing plans for the Death Star:\n\nDonald grabbed the neck of Freeman’s jersey and lifted him in the air, Darth Vader style. It’s almost as if Freeman, who is listed at 5-foot-8 and 206 pounds, shouldn’t have gone after Donald, who is listed at 6-1 and 280. The height and weight disparity certainly didn’t work out in his favor.\n\nScroll to continue with content Ad\n\nA referee had to wrestle the Falcons' Devonta Freeman to the ground after he got into a heated altercation with the Rams' Aaron Donald. (AP Photo/John Amis)\n\nFreeman was ejected for throwing the punch that started the scuffle with Donald. During the remaining quarter and a half, he may want to think about why he shouldn’t start fights with guys who have 5 inches and 70 pounds on him.\n\n____\n\nJay Busbee is a writer for Yahoo Sports. Contact him at jay.busbee@yahoo.com or find him on Twitter or on Facebook.\n\nMore from Yahoo Sports:", "description": "Aaron Donald picked Devonta Freeman up by the neck of his jersey and reenacted a scene from \"Star Wars.\"", "authors": ["Jay Busbee"], "top_image": "https://s.yimg.com/ny/api/res/1.2/GdAynOE.NPBgBsIZ8uue6Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/KSBSa.aF59GUqXHnSSuZFA--~B/aD0zMDQ2O3c9NDU2OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/70265d80-f370-11e9-aed6-a0b84b4c5bf2", "published_at": "2019-10-20"}