{"pub": "yahoo", "url": "https://finance.yahoo.com/news/citigroup-c-outpaces-stock-market-214509858.html", "downloaded_at": "2019-09-13 00:57:27.610029+00:00", "published_at": "2019-09-12", "title": "Citigroup (C) Outpaces Stock Market Gains: What You Should Know", "language": "en", "text": "Citigroup (C) closed at $69.32 in the latest trading session, marking a +0.61% move from the prior day. The stock outpaced the S&P 500's daily gain of 0.29%. Elsewhere, the Dow gained 0.17%, while the tech-heavy Nasdaq added 0.3%.\n\nPrior to today's trading, shares of the U.S. bank had gained 12.2% over the past month. This has outpaced the Finance sector's gain of 2.85% and the S&P 500's gain of 2.99% in that time.\n\nInvestors will be hoping for strength from C as it approaches its next earnings release. On that day, C is projected to report earnings of $1.98 per share, which would represent year-over-year growth of 13.79%. Our most recent consensus estimate is calling for quarterly revenue of $18.59 billion, up 1.07% from the year-ago period.\n\nC's full-year Zacks Consensus Estimates are calling for earnings of $7.64 per share and revenue of $74 billion. These results would represent year-over-year changes of +14.89% and +1.57%, respectively.\n\nInvestors might also notice recent changes to analyst estimates for C. These recent revisions tend to reflect the evolving nature of short-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.\n\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\n\nThe Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. The Zacks Consensus EPS estimate has moved 0.24% higher within the past month. C is holding a Zacks Rank of #3 (Hold) right now.\n\nInvestors should also note C's current valuation metrics, including its Forward P/E ratio of 9.02. For comparison, its industry has an average Forward P/E of 11.34, which means C is trading at a discount to the group.\n\nMeanwhile, C's PEG ratio is currently 0.74. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. The Banks - Major Regional was holding an average PEG ratio of 1.42 at yesterday's closing price.\n\nThe Banks - Major Regional industry is part of the Finance sector. This group has a Zacks Industry Rank of 191, putting it in the bottom 26% of all 250+ industries.\n\nThe Zacks Industry Rank gauges the strength of our individual industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nTo follow C in the coming trading sessions, be sure to utilize Zacks.com.\n\n\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n\n\nCitigroup Inc. (C) : Free Stock Analysis Report\n\n\n\nTo read this article on Zacks.com click here.\n\n\n\nZacks Investment Research", "description": "Citigroup (C) closed at $69.32 in the latest trading session, marking a +0.61% move from the prior day.", "authors": ["Zacks Equity Research"], "top_image": "https://s.yimg.com/uu/api/res/1.2/c17LscPwh2ZHDPRMekvC8w--~B/aD02MDA7dz05MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/2f0d6efdd8740952a371c97ddea6e926"}