{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/9/10-spot-cards-oust-braves-from-nlds-with-record-1s", "downloaded_at": "2019-10-10 00:44:05.079319+00:00", "title": "10-spot: Cards oust Braves from NLDS with record 1st inning", "language": "en", "text": "ATLANTA (AP) - With a stunning outburst their first time up, the St. Louis Cardinals scored 10 runs for the biggest opening inning in postseason history and dealt the Atlanta Braves another playoff heartbreak with a 13-1 rout in decisive Game 5 of the NL Division Series on Wednesday.\n\nBefore many fans had reached their seats, the Cardinals were already booking their plans for the NL Championship Series, where they will face either the Los Angeles Dodgers or the Washington Nationals in a best-of-seven set beginning Friday. Those teams were meeting in their own Game 5 at Dodger Stadium. It will be St. Louis‘ first NLCS trip since 2014.\n\nFor the Braves, it might take a while to get over this debacle.\n\nAfter pitching seven scoreless innings in a Game 2 win, Mike Foltynewicz retired only one hitter before getting yanked. First baseman Freddie Freeman made a crucial error that might have limited the damage. The Cardinals scored their final run of the inning on a strikeout - a wild pitch in the dirt that skipped away from catcher Brian McCann.\n\nIt was Atlanta’s 10th straight postseason round loss since its last victory 18 long years ago, tying the ignominious mark set by the Chicago Cubs between 1908 and 2003.\n\nSt. Louis leadoff man Dexter Fowler batted three times before the bottom of Atlanta’s order got its first looks, and the Cardinals made several changes after their 10-spot in what might’ve been the first set of defensive changes ever made by a team before its opponent had batted. There was no need to worry about any more offense with Jack Flaherty on the mound, coming off one of the great second halves by a starting pitcher in baseball history.\n\nThe 23-year-old right-hander had not given up more than three runs in 15 starts after the All-Star break, posting a 0.91 ERA. He certainly wasn’t going to let this massive lead get away, though Josh Donaldson - in perhaps his final game with the Braves - gave the fans a brief reason to cheer in a 13-0 game when he homered over the center-field wall in the fourth.\n\nManager Mike Shildt let Flaherty throw 104 pitches over six innings, surrendering four hits and that lone run for the first postseason win of his blossoming career. Flaherty loaded the bases in the fifth after drilling Ronald Acuña Jr. with a fastball but induced an inning-ending groundout from Freeman.\n\nThis one, though, will long be remembered for what happened before Flaherty even took the mound.\n\nThe Cardinals batted around and got more than halfway through their order a second time. Tommy Edman, Fowler and Kolten Wong all had two-run doubles in what looked like a giant pinball game as St. Louis equaled the highest-scoring inning in postseason history, a record initially set by the Philadelphia Athletics against the Chicago Cubs in the 1929 World Series. It was matched by the Detroit Tigers (1968 World Series vs. St. Louis), the Anaheim Angeles (2002 ALCS vs. Minnesota) and, now, the Cardinals.\n\nIt started ominously for Foltynewicz with a walk to Fowler, who patiently watched three straight balls after falling behind in the count 1-2. The right-hander didn’t walk anyone in his first start of the series, a 3-0 victory by the Braves.\n\nExpecting another close game, the Cardinals had Kolten Wong put down a sacrifice bunt to move Fowler to second. That was the only hitter Foltynewicz retired.\n\nPaul Goldschmidt reached on an infield hit, and the crowd stirred nervously when Marcell Ozuna lined another single to right to bring home the first run. Then, the play that essentially finished off the Braves.\n\nYadier Molina drilled a one-hopper to first that Freeman likely would’ve turned into an inning-ending double if he made the scoop. Instead, everyone was safe when the ball deflected off his glove and rolled slowly toward second base to leave the bases loaded.\n\nMatt Carpenter walked to force in a run and Tommy Edman ripped a two-run double into the right-field corner to make it 4-0. After Paul DeJong was handed an intentional walk to re-load the bases, Atlanta manager Brian Snitker emerged from the dugout to call in 17-game winner Max Fried from the bullpen.\n\nFlaherty drew another bases-loaded walk and Fowler lined a two-run double down the left-field line to make it 7-0. Wong followed with yet another two-run double, pushing the score to a staggering 9-0.\n\nGoldschmidt lined out to right, drawing a sarcastic cheer from the fans as Wong tagged and hustled over to third. Ozuna appeared to end the inning when he flailed at a ball in the dirt for strike three, but McCann couldn’t corral the wild pitch. McCann fell down picking the ball up near the backstop and threw late to first from his backside while Wong sped home.\n\nNo team had ever scored 10-plus runs in the very first inning of a postseason game. It is the first time the Braves franchise has allowed that many first-inning runs in any game since the Boston Braves did it July 2, 1925 against the Brooklyn Robins.\n\nCHOP CHOPPED\n\nThe Braves did not distribute their traditional red foam tomahawks to fans following criticism by St. Louis pitcher Ryan Helsley. The foam cutouts are used when Braves fans perform their Tomahawk Chop chant in games. The Braves said in a statement the change is “out of respect for the concerns” expressed by Helsley, a member of the Cherokee Nation who said he finds the chant insulting.\n\nTRAINER’S ROOM\n\nCardinals: After missing two weeks with a strained left hamstring, 2B Wong has held up well in his postseason return. “He feels great and hasn’t really missed a beat,” Shildt said.\n\nBraves: 2B Ozzie Albies remained in the game after appearing to hurt his right hand while dropping a throw from SS Dansby Swanson attempting to turn a double play in the third inning. A trainer gave Albies’ hand a quick examination on the mound during a pitching change later in the inning, but he stayed in the game.\n\nUP NEXT\n\nThe Cardinals lost to San Francisco in five games at the 2014 NLCS, their last of four straight trips to the round. The NL Central champions went 4-3 vs. the Dodgers during the regular season, sweeping a four-game series at Busch Stadium in April but losing three straight at Los Angeles in August. St. Louis posted a 5-2 edge over Washington in their season series.\n\nAfter a second straight NL East title, the Braves head into the offseason with a solid nucleus of young talent but the burden of another postseason flop. Donaldson is a potential free agent, along with pitcher Dallas Keuchel, who struggled in his two NLDS starts.\n\n___\n\nFollow Paul Newberry on Twitter at www.twitter.com/pnewberry1963 His work can be found at https://apnews.com\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "With a stunning outburst their first time up, the St. Louis Cardinals scored 10 runs for the biggest opening inning in postseason history and dealt the Atlanta Braves another playoff heartbreak with a 13-1 rout in decisive Game 5 of the NL Division Series on Wednesday.", "authors": ["The Washington Times Http", "Paul Newberry"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/09/nlds_cardinals_braves_baseball_35688_c0-186-4454-2782_s1770x1032.jpg?523315228728231796b983b6e4fbf575af035862", "published_at": "2019-10-09"}