{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/nelsons-column-dominic-cummings-street-20565633", "downloaded_at": "2019-10-13 08:49:05.361090+00:00", "title": "Nelson's Column: Dominic Cummings' street urchin look isn't chic. It's a cheek", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nHow you dress does not affect how you think. But it does say something about what you think of others.\n\nBoris Johnson’s oddball sidekick Dominic Cummings is arguably Britain’s most powerful man, the puppeteer pulling the PM’s strings.\n\nThe former Vote Leave supremo favours a scruffy, dishevelled, dragged through a hedge fund backwards look.\n\nWith his crumpled shirts, ripped jeans and scuffed trainers he should be kickflipping in a skateboard park not rocking up for work at No10.\n\nSometimes he tops off this ensemble with a hoodie, but mostly with an armless, padded, quilted jerkin known as a gilet which is French for vest.\n\n(Image: Peter Summers)\n\nI appreciate Cummings would rather be found dead in a ditch than be mistaken for a traditional civil servant.\n\nBut cultivating overgrown street urchin chic is less a fashion statement and more a statement of disdain, not just for the government he serves but by extension the rest of us.\n\nSomeone must have forcibly shoehorned him into the suit he wore for Irish talks on Thursday. No wonder he looked downcast.\n\nOk, I too sometimes sport jeans and a t-shirt in Parliament - but only on non-sitting days.\n\nAnd I don’t turn up in a tie anymore because they are no longer required since Commons Speaker John Bercow ruled we could dispense with them.\n\n(Image: PA)\n\nBut if I do a TV show in which a male presenter is likely to wear one then I will, too. As a guest I respect the host’s dress code. It’s just good manners.\n\nCummings is No10’s unelected guest.\n\nAnd it’s plain rude to dress down to suit himself when everyone else is dressed to suit the stylish surroundings.\n\nOtherwise you might as well put the seat of government in a garden shed.\n\nI remember when Cummings worked for Michael Gove he was more aggressive than persuasive.\n\n(Image: PRU/AFP via Getty Images)\n\nWhich made me less likely to give his boss favourable publicity.\n\nNow Cummings has really powerful figures to browbeat.\n\nLast week he was suspected of releasing No10’s rambling, 800 word Brexit report. His authorship is not denied.\n\nIt rubbished Ireland’s Leo Varadkar, Germany’s Angela Merkel and France’s Emmanuel Macron , and threatened punishment for EU countries backing a Brexit delay.\n\n(Image: CLEMENS BILAN/EPA-EFE/REX)\n\nIt concluded with: “Parliament is as popular as the clap.”\n\nSo there you have it.\n\nThe writer no one cast a vote for despises representative democracy, its leaders, foreign leaders, foreign countries and is obsessed with dumping Europe whatever the cost or the ordinary folk it would hurt.\n\nSurely it’s a national scandal to have someone at the very top of government who drips contempt like rainwater off a gilet.\n\nOur drugs laws have gone to pot\n\n(Image: MDM)\n\nLast year 1,584 children were dragged into court for cannabis possession. Fourteen million Brits have used the drug, 2.4 million in the past 12 months alone.\n\nThe radical think tank Radix and former Lib Dem Health minister Sir Norman Lamb argue legal regulation is the answer.\n\nNorman claims it would lead to reduced use, fewer unsafe high-potency drugs, less crime, and £1billion in tax revenues.\n\nLabour’s David Lammy and Tory Jonathan Djanogly say cannabis should be a child protection issue not a criminal one. Many senior police officers agree.\n\n(Image: BBC)\n\nI would go further. Drug laws in this country are outdated and don’t work.\n\nPortugal decriminalised possession of small amounts of all drugs in 2001 and now has one of the lowest rates of drug-induced death in Europe.\n\nFears it would become an international haven for druggies were unfounded.\n\nBetter for those at risk of addiction to fall into the caring arms of health professionals than the long arm of the law.\n\nThe bog paper minister is on a roll\n\nBog roll minister Simon Hart was as enthusiastic as an Andrex puppy as he flushed claims of a no-deal shortage of toilet tissue down the pan.\n\nThe Implementation minister (for that is his official title) is implementing plans to ensure our supplies of toilet paper are uninterrupted.\n\nHe said: “The Government will prioritise the flow of goods at the border while continuing to take a risk-based approach to controls and checks.”\n\nI take that to mean that as super-soft presents no obvious terrorist threat or is a commodity favoured by smugglers it would not be delayed by fussy paperwork.\n\nBrexit Countdown Days til we leave EU 0 Days 0 Hours 0 minutes 0 Seconds\n\nHart added that this would “minimise additional friction.” That’s a relief.\n\nThere would be much additional friction if we had to go back to that abrasive tracing paper many of us can remember having to use during our schooldays.\n\nSo raise a glass to Simon. Cheers, mate. And bottoms up.\n\nDom could lose another seat\n\n(Image: AFP/Getty Images)\n\nRebel Tory Dominic Grieve still sits in his usual Commons tearoom seat.\n\nBrexiteer Tories want him out.\n\nAndrew Bridgen says: “We must avoid him infecting others with a dose of Europhilia.”\n\nSome MP is being a silly sausage\n\n(Image: PA)\n\nHouse of Commons wifi is patchy, which makes connecting to it a nightmare.\n\nBut it’s entertaining to try because it throws up all the phones you can pair with.\n\nSo come on. Own up.\n\nWhich of you MPs goes by the name German Sausage Boy?\n\nAnd fess up, Pink Duck.\n\nGavers gets an education\n\n(Image: PA)\n\nMPs were puzzled by Gavin Williamson copping Education in Boris Johnson’s Cabinet shuffle.\n\nHe was sacked as Defence Secretary by Theresa May for allegedly leaking security secrets which he stoutly denies.\n\nBut Cabinet Secretary Mark Sedwill told the PM he shouldn’t come back.\n\nBoris protested: “But I promised him a job.”\n\nEducation was the compromise solution.\n\nBecause now Williamson is the one Cabinet minister not required to attend security briefings.", "description": "Does the way those who govern us dress make a difference? Sunday Mirror Political Editor Nigel Nelson\nthinks so", "authors": ["Nigel Nelson", "Image", "Peter Summers", "Pa", "Pru Afp Via Getty Images", "Clemens Bilan Epa-Efe Rex", "Mdm", "Bbc", "Afp Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20565442.ece/ALTERNATES/s1200/1_MAIN-Boris-Johnson_7563JPG.jpg", "published_at": "2019-10-12"}