{"pub": "nytimes", "url": "https://nytimes.com/2019/09/20/opinion/biden-warren-2020-elections.html", "downloaded_at": "2019-09-21 03:37:43.535400+00:00", "title": "Opinion | The Bygone Baggage of Joe Biden", "language": "en", "text": "Will this fine-tuning be enough in an agitated America, whiplashed by President Trump? I doubt it. The under-30s, maybe under-40s, are underwhelmed by Biden, even angry that this honorable man has not chosen dignified retirement. He’s the emblem of the permanent political class, the one that created the conditions for Trump, in an era that Trump’s wild policy lurches and heresies and, yes, lies have now transformed.\n\nAmerica’s restoration, after this trauma, will not be achieved by going back. What created Trump cannot oust Trump. It will demand a new politics, and a new integrity, such as the one Warren has set out and embodied with greater vigor, persuasiveness and coherence than anyone else. Biden, on whom Trump may have been seeking dirt in a July phone call with President Volodymyr Zelensky of Ukraine, can put an end to the president’s sullying of the Oval Office. He can’t, however, embody renewal.\n\nIs Warren too far left to win? Maybe. Does she worry some purple-district Democrats who did well in 2018? Yes. But she can adjust. As for “electability,” an overused word, well, Trump won, and may again, so all bets are off.\n\nI said Biden has come close to a blowup moment. The campaign is grueling. You don’t have to be almost 77 to slip up. But he has demonstrated tone-deafness on race in a way that is disturbing.\n\nHis reference to a “record player” in the last Democratic debate in the context of a question about reparations for slavery tied Biden to a bygone era, but that was far from the worst of it. Talking about black families — that is what the question was about — he actually said: “We bring social workers into homes and parents to help them deal with how to raise their children. It’s not that they don’t want to help. They don’t, they don’t know quite what to do. Play the radio, make sure the television — excuse me, make sure you have the record player on at night, the, the — — make sure the kids hear words.”\n\nThey don’t know what to do! Make sure the kids hear words! This is insulting toward African-Americans. It’s of a piece with Biden’s comment (quickly adjusted) in August that “we have this notion that somehow if you’re poor, you cannot do it. Poor kids are just as bright and talented as white kids.”\n\nThere’s a way, and a need, to talk about fundamental systemic racial injustice, but this is emphatically not it. Black does not equal poor and inept. The genius has left a void. Right now it’s not his vice president who may just fill it enough, but Warren.\n\nThe Times is committed to publishing a diversity of letters to the editor. We’d like to hear what you think about this or any of our articles. Here are some tips. And here’s our email: letters@nytimes.com.\n\nFollow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.", "description": "The politics that created the conditions for Trump cannot be the politics that defeat him.", "authors": ["Roger Cohen"], "top_image": "https://static01.nyt.com/images/2019/09/20/opinion/20cohen1/20cohen1-facebookJumbo.jpg", "published_at": "2019-09-20"}