{"pub": "dailybeast", "url": "https://thedailybeast.com/the-spanish-fraggle-rock-setenil-de-las-bodegas-is-an-andalucian-town-built-under-a-rock", "downloaded_at": "2019-09-13 11:13:45.999481+00:00", "title": "The Spanish Fraggle Rock: Setenil de las Bodegas Is an Andalucian Town Built Under a Rock", "language": "en", "text": "Saying someone lives under a rock isn’t exactly a compliment. But for the 3,000 residents of Setenil de las Bodegas, it’s a simple fact of life. The Spanish town, one of Andalucia’s “Pueblos Blancos,” is built on a cliff with a rocky overhang. City streets are dotted with buildings that use the looming rock as roofs to cover their white-washed facades, and sometimes the entire road is covered by the rock’s shadow. This location has served the city well for centuries as protection from the sun and invaders.\n\nThe town owes its unusual geography to the Rio Trejo, which eroded the gorge that the town is built in. The town’s history can be traced back to neolithic times, with some evidence of pre-Roman inhabitants and visible remnants of Roman dwellers sprinkled around the region. Setenil de las Bodegas’s steep, rocky location provided protection that proved advantageous during the 15th century, when Christian forces battling the Moors unsuccessfully attempted to defeat the town six times, until overtaking its castle on the seventh—nearly 80 years after the first attack. The castle finally fell in 1484 after a 15-day siege and more than 700 years of Moorish rule.\n\nThe town’s name, “Setenil,” derives from a Latin word meaning “seven times nothing,” in commemoration of the epic holdout. The second half of the name, “de las Bodegas,” is thought to refer to the vineyards introduced by new Christian settlers after the town’s defeat. The wine storage units, or bodegas, were perfect for the cool caves. Unfortunately, the grape industry in the region was later wiped out in the mid 1800’s by pests.", "description": "Living in a cave sounds like a big adventure. But in Setenil de las Bodegas, it's been everyday life for centuries.", "authors": ["Nina Strochlic"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1439,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1492189297/articles/2014/01/02/the-spanish-fraggle-rock-setenil-de-las-bodegas-is-an-andalucian-town-built-under-a-rock/131231-strochlic-setenil-bodegas_hxbgbc", "published_at": "2014-01-02"}