{"pub": "nymag", "url": "https://vulture.com/2019/10/living-with-yourself-season-1-finale-recap-episode-8.html", "downloaded_at": "2019-10-20 12:24:17.685465+00:00", "title": "Living With Yourself Finale Recap: Me, Myself, and You", "language": "en", "text": "Living With Yourself Nice Knowing You Season 1 Episode 8 Editor’s Rating 3 stars * * * * * « Previous Next Photo: Eric Liebowitz/Netflix/Eric Liebowitz/Netflix\n\nLet us not, in the final episode of the season, lose sight of the fact that this show is called Living With Yourself. It could be easy to forget because the two versions of Miles haven’t spent much time together, and many of the episodes have been structured around keeping them apart — showing a set of events from one perspective, then coming back around to show the other. What’s been a little bit lost is the conversation that Miles is having with himself, which is the benefit and curse of hanging out with your own clone. Miles has learned about himself through his confrontations with Miles 2.0 — as the more defeated and ill-kempt of the two, he’s had to step up his game a little — but there hasn’t been much sustained Miles-on-Miles (and Rudd-on-Rudd) action.\n\n“Nice Knowing You” finally delivers on that promise, but not before getting sidetracked by the least compelling subplot of the series. It turns out that the two Mileses’ threatened call to the FDA’s criminal division was accidentally a real alert, one that’s had two FDA agents following Miles around in a station wagon. So when Miles was kidnapped at the end of the last episode, he comes face to face with those investigators, who want to get to the bottom of this human cloning operation. Or they might. It’s curious that Miles is treated as if he’s the perpetrator of a crime rather than its beneficiary. They seem to have no interest in going after this network of cloning spas and a keen interest in determining whether Miles is who he says he is. And really, a lie detector test (on defective equipment) wouldn’t reveal anything about whether this is new Miles or original flavor. They share the same memories.\n\nBut these opening minutes press on, pushing the thin joke that Miles is being kept in the FDA’s lactation room rather than a proper holding facility, because there isn’t any money available for cloning probes. This leads to the odd spectacle of Miles plundering the refrigerator for breast milk while working his way through stacks of parenting magazines. The room allows him to refocus on the possibilities of fatherhood after years of withering interest, but it’s a contrived and unfunny situation, made worse by an investigator’s inexplicable line of questioning. (“Have you ever engaged in sodomy?”) When Miles manages to escape the lactation room and wander out into the office area, his release is such a big shoulder-shrug that you wonder why his confinement was necessary at all.\n\n“Nice Knowing You” improves when Miles comes back home to find Kate waiting for him on the stairs, ready to confess her shame in cheating on him with his clone. Before she can, however, Miles feels he has some apologizing to do. (His sputtering about reading a parenting article and drinking breast milk is funnier in the telling. “This is coming out all wrong!” he says in frustration.) After Miles 2.0’s excruciating attempt to coax Kate into re-creating their wedding dance, it’s a huge pleasure to see them cut a rug to Rick James’ “Give It To Me Baby,” falling into step with ease. They are the right couple — they like piña coladas and getting caught in the rain — and it’s obvious to them and to Miles 2.0, who’s spying from upstairs. His Miles ruse gets sidelined before it ever gets started. All he gets out of it is toothpaste stains on a ratty sweater.\n\nBack at his apartment, Miles 2.0 contemplates suicide — though, again, such an extreme act seems out of character, even for a guy who has no purpose. One important thing to note about Miles 2.0’s feelings for Kate is that they’re not as lived-in as his counterpart’s. Just as their years as a couple wind up mattering to Kate more than she anticipated, it follows that Miles 2.0’s memories bring him up short of the deep feeling that she’s a lost soul mate. Miles 2.0 putting a gun in his mouth isn’t convincing, and even he seems to realize that when he can’t pull the trigger. The entire sequence plays like a silly pretext to a physical confrontation between the two Mileses.\n\nOnce Miles and Miles 2.0 finally square off, the metaphysical battle promised with the show’s title bears some fruit. They’re equally incompetent fighters, which leads to some quality slapstick, but the point of the sequence is to bring out their similarities and differences at the same time. It’s a metaphor for the complicated feelings people have about themselves, the self-love and self-hatred that coexists within the same being. They try to murder each other — and Miles succeeds, briefly — but they’re united in their hatred of that horrible credenza, and they’re united again when Kate announces her pregnancy and both can serve a unified purpose.\n\nThere may be no children’s book about a baby having two dads and a mom, so it will be the task of next season to see if there’s room for all three to play their part. (Speaking from experience, if the three of them can get together on feeding schedules during those sleepless first few months, it will be a revolution in parenting.) It wouldn’t be a show if this wasn’t a tenuous arrangement, from the issue of paternity to the perpetually unsettled matter of who’s entitled to Miles’ life. But the fundamentals of Living With Yourself — Rudd’s dual turn, Aisling Bea’s refreshing saltiness, creator Timothy Greenberg’s insight into middle-aged suburban malaise — are enough to keep it rolling for a while, so long as it doesn’t get sidetracked by the cloning police. Cloning works great on the show on a character level; the ethics of the actual practice mean less than nothing here.\n\nDouble Yous:\n\n• Despite this supersize episode — 36 minutes! — it’s still possible to get through this entire first season of Living With Yourself in four hours. Very binge-able. (Though binging may be coming to an end.)\n\n• It really looks like the show used the set from the original Saw for its lactation room. How is this FDA-approved?\n\n• Maybe something’s coming next season, but after using the pig carcass as the framing device for an entire episode, it seems like Miles 2.0 running it over with his car isn’t enough of a payoff.\n\n• That final look from Kate as all three are locked into a hug is something much worse than the famously ambiguous final shot in The Graduate.", "description": "The season ends by fulfilling the promise of sustained Miles-on-Miles action, and a promise of complications to come. A recap of ‘Nice Knowing You,’ the final episode of season 1 of Netflix’s Living With Yourself, starring Paul Rudd and Aisling Bea.", "authors": ["Scott Tobias"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/11/living-with-yourself-recaps/living-with-yourself-ep-8.w1200.h630.jpg", "published_at": "2019-10-20"}