{"pub": "cnn", "url": "https://cnn.com/2019/10/24/entertainment/tobymac-son-death-trnd/index.html", "downloaded_at": "2019-10-24 23:55:33.909953+00:00", "title": "TobyMac writes emotional tribute to his late son", "language": "en", "text": "McKeehan, 21, died Wednesday at his home near Nashville, family spokesperson Velvet Kelm told CNN.\n\nA cause of death has not yet been determined.\n\nMcKeehan was the oldest of TobyMac's five children. He was an up-and-coming musician who performed under the names Truett Foster, truDog, TRU and Shiloh.\n\nHe collaborated with his father on several albums.\n\nIn his tribute, TobyMac wrote about his final moments with his son, where he watched McKeehan perform a show last week. He also shared a screen-shot of their final text exchange in which he told his son how proud he was to see him on stage.\n\nMcKeehan wrote in response, \"love you dad,\" before adding, \"you have always believed in me\" and \"make me feel like a superhero.\"\n\nTobyMac's tribute follows below:\n\nTruett Foster Mckeehan had joy that took the room when he entered. He was a magnetic son and brother and friend. If you met him you knew him, you remembered him. His smile, his laugh, the encouragement he offered with words or even without. He had an untamable grand personality and dreams to match. And he hated being put in a box.\n\nHe expressed himself through the music he made. And by made I mean, written, recorded, produced, mixed, and designed the art. All of it. A true artist. His first show was a week ago, and it was nothing short of electric. Everyone felt it, everyone knew it. He could've easily taken the easy route and put music out when he was 12, 14, 16, even 18, but he always said he wanted to live some life and have something to say before he did it. He didn't want to be a child star, he wanted to be a man with scars and a story to tell. I always admired, respected and encouraged that stand.\n\nTruett always had a soft spot for God. The Bible moved him. His heart was warm to the things of his King. He was by no means a cookie cutter Christian but give me a believer who fights to keep believing. Give me a broken man who recognizes his need for a Savior every time. That's who Truett was and how he should be remembered.\n\nMy last moment with Truett in person was at his first show this past Thursday at the Factory in Franklin, Tennessee. I had to leave the next morning very early to fly and start our Canadian tour. As I stood in the audience and watched my son bring joy to a room, I was as proud as a \"pop\" (as tru called me) could be. It was the culminating moment of a dream that he had since he was 12. It couldn't have been sweeter. Our music, and what we say lyrically couldn't be more different, but the outcome was much the same... offering a room full of people a few minutes of joy in a crazy world.\n\nMy wife and I would want the world to know this...\n\nWe don't follow God because we have some sort of under the table deal with Him, like we'll follow you if you bless us. We follow God because we love Him. It's our honor.\n\nHe is the God of the hills and the valleys.\n\nAnd He is beautiful above all things.", "description": "Christian recording artist TobyMac has penned a moving tribute to his late son, Truett McKeehan. McKeehan, 21, died Wednesday at his home near Nashville, TN., family spokesperson Velvet Kelm told CNN.", "authors": ["Lauren M. Johnson"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191024140742-tobymac-and-son-truett-super-tease.jpg", "published_at": "2019-10-24"}