{"pub": "cbc", "url": "https://cbc.ca/news/world/saudi-oil-attack-britain-france-germany-1.5294500", "downloaded_at": "2019-09-24 00:54:44.304124+00:00", "title": "Britain, France, Germany blame Iran for Saudi attack | CBC News", "language": "en", "text": "France, Britain and Germany said on Monday it is clear Iran was responsible for an attack on Saudi oil facilities on Sept. 14 and called on Tehran to agree to negotiations on its nuclear and missile programs and regional security issues.\n\n\"The time has come for Iran to accept a long-term negotiation framework for its nuclear program, as well as regional security issues, which include its missile programs,\" the three governments said in a joint statement after French President Emmanuel Macron, British Prime Minister Boris Johnson and German Chancellor Angela Merkel met during the annual United Nations gathering of world leaders.\n\nJohnson said late Sunday while flying to the meeting that the U.K. would consider taking part in a U.S.-led military effort to bolster Saudi Arabia's defences.\n\nIranian Foreign Minister Mohammad Javad Zarif again denied his country had any part in the attacks, pointing to claims of responsibility by Yemeni rebels.\n\n\"If Iran were behind this attack, nothing would have been left of this refinery,\" he said.\n\nThe Iran-allied Houthi rebels, \"have every reason to retaliate\" for the Saudi-led coalition's aerial attacks on their country, Zarif said.\n\nIranian Foreign Minister Mohammad Javad Zarif arrives for the United Nations General Assembly in New York City on Monday. (Craig Ruttle/The Associated Press)\n\nHe also stressed that on the eve of President Hassan Rouhani's visit to the UN — which sits in the middle of New York City — \"it would be stupid for Iran to engage in such activity.\"\n\nZarif said he plans to meet Wednesday with ministers of the five countries remaining in the 2015 nuclear deal from which Trump withdrew — Russia, China, Britain, France and Germany.\n\nA U.K. official told The Associated Press that the Houthis' claim of responsibility for the attacks was \"implausible.\" He said remnants of Iran-made cruise missiles were found at the attack site, and \"the sophistication points very, very firmly to Iranian involvement.\"\n\nThe official, who spoke on the condition of anonymity to discuss intelligence findings, did not say whether Britain believed the attack was launched from Iranian soil.\n\nLater on Monday, the U.S. Special Envoy for Iran, Brian Hook, confirmed that Washington will intensify pressure on Iran following the Sept. 14 attacks, but added that the U.S. was seeking a global coalition countering Tehran and that it was going to act \"prudently.\"\n\nFrance has been trying to find a diplomatic solution to the U.S.-Iranian tensions, which soared after the Saudi attacks.\n\nBrian Hook, U.S. Special Representative for Iran, attends a news conference in London on June 28. Hook said Monday the United States will intensify pressure on Iran following the Sept. 14 attacks. (Simon Dawson/Reuters)\n\nMacron said at a news conference at the UN earlier on Monday that he planned to meet separately with both Trump and Rouhani over the next day and would work to foster \"the conditions for discussion\" and not escalation.\n\nBut Trump appeared to rebuff those efforts, telling reporters: \"We don't need a mediator.\"\n\n\"He's [Macron] a friend of mine, but we're not looking for any mediators. They know who to call,\" Trump said.\n\nTrump also said he had no meetings scheduled this week with Rouhani but would not rule out meeting him in New York.\n\nPresident Hassan Rouhani sits at the Mehrabad airport pavilion before leaving Tehran for New York to attend the UN General Assembly, on Monday. (Iranian Presidency Office/The Associated Press)\n\nPush for new deal\n\nJohnson urged Trump on Monday to strike a new nuclear deal with Iran. While Britain still backs the existing agreement and wants Iran to stick to its terms, Johnson said in the long term, there should be a new agreement.\n\n\"Whatever your objections with the old nuclear deal with Iran, it's time now to move forward and do a new deal,\" he said.\n\nJohnson said he would meet Rouhani during this week's UN General Assembly. He said he wants Britain to be \"a bridge\" between Europe and the U.S., \"when it comes to the crisis in the Gulf.\"\n\nJohnson stressed the need for a diplomatic response but said Britain would consider any request for military help. The Trump administration announced Friday that it would send additional U.S. troops and missile defence equipment to Saudi Arabia and the United Arab Emirates as part of a \"defensive\" deployment. Officials said the number of troops was likely to be in the hundreds.\n\n\"We will be following that very closely,\" Johnson said.\n\nBut Iran ruled out the possibility of negotiating a new deal with major powers, Zarif tweeted on Monday, saying European partners have failed to fulfil their commitments under a 2015 nuclear pact.\n\nFrance, Germany and the U.K.'s \"paralysis in fulfilling their obligations w/o US permission has been clear since May 2018 ... No new deal before compliance w/ current one,\" Zarif said on Twitter.\n\nShortly before leaving for the UN meetings Monday, the Iranian president said on state television that his country will invite Persian Gulf nations to join an Tehran-led coalition \"to guarantee the region's security.\"\n\nRouhani said the plan is not limited to security but also encompasses economic co-operation and an initiative for \"long-term\" peace. He said he planned on presenting details while at the UN.\n\nMeanwhile Monday, Iranian government spokesman Ali Rabiei suggested the release of a British-flagged oil tanker held by Tehran since July would be imminent, though he doesn't know when the vessel will leave.\n\nThe Stena Impero has not turned on its satellite-tracking beacon in 58 days, nor has there been any sign that it has left its position off the Iranian coast near the port city of Bandar Abbas.\n\nIran's Revolutionary Guard seized the Stena Impero after authorities in Gibraltar seized an Iranian crude oil tanker. That ship has since left Gibraltar, leading to hopes the Stena Impero would be released.", "description": "France, Britain and Germany joined the U.S. on Monday in saying clear Iran was responsible for an attack on Saudi oil facilities on Sept. 14. The three countries called on Tehran to agree to negotiations on its nuclear and missile programs and regional security issues in a joint statement.", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5294527.1569271047!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/un-general-assembly.jpg", "published_at": "2019-09-23"}