{"pub": "politico", "url": "https://politico.com/magazine/story/2019/10/22/fec-ellen-weintraub-campaign-finance-law-229872", "downloaded_at": "2019-10-22 13:23:54.027385+00:00", "title": "How My FEC Colleague Is Damaging the Agency and Misleading the Public", "language": "en", "text": "Paul Morigi/Getty Images opinion How My FEC Colleague Is Damaging the Agency and Misleading the Public Chairwoman Ellen Weintraub’s anti-Trump publicity tour is harming the legitimacy of the institution she purports to serve.\n\nCaroline Hunter is a member of the United States Federal Election Commission.\n\nOne of my colleagues on the Federal Election Commission has been having a field day. This year’s chair, Ellen Weintraub, has attracted considerable attention thanks to the FEC’s important role in regulating and enforcing federal campaign finance law, which is a hot topic right now. As chair, Weintraub has been rushing around giving interviews, tweeting and generally weighing in on a whole host of topics both within and outside of the FEC’s area of expertise.\n\nUnfortunately, while Weintraub’s tweets and interviews might make for good soundbites and clickbait, they are harming the legitimacy of the institution she purports to serve. Commissioners are meant to be independent and neutral arbiters of campaign finance law. Yet Weintraub’s statements indicate that she has prematurely judged matters that could come before the FEC, and that she radically rejects any legal perspective other than her own. Not only that, she risks misleading the public about what the FEC does and what campaign finance law really says. Not surprisingly, Weintraub’s activities are causing consternation and confusion in several quarters, including on Capitol Hill, and people are starting to ask questions, including about her possible misuse of government resources for ideological and political purposes.\n\nStory Continued Below\n\nWeintraub has used her position at the FEC to take on the president of the United States. She repeatedly challenged his allegations of voter fraud in 2016 in New Hampshire and, in the context of discussing the outcome of the 2016 presidential election, questioned the legitimacy of the Electoral College. The FEC has no authority over either of these issues. Weintraub nonetheless used her official title and Commission letterhead in her public attacks on the president, which made it look as if she was acting on the agency’s behalf and with other commissioners’ support, neither of which was true. By creating these false impressions, Weintraub risked both misleading the public about the FEC’s role and undermining the public’s confidence in the agency.\n\nMore recently, Weintraub has used her position as FEC chair to inject herself and the FEC into the national debate over President Donald Trump’s telephone call with Ukrainian President Volodymyr Zelensky, and whether his recent actions violate campaign finance law prohibiting campaigns from soliciting or accepting contributions from foreign nationals. Without explicitly saying that the president violated the foreign national ban, the timing and tone of Weintraub’s public statements unmistakably convey that impression. For example, within hours after ABC News reported that the president had said he would listen to information from foreign nationals about a political opponent, Weintraub tweeted a statement on Commission letterhead about the illegality of campaigns’ accepting contributions from foreign nationals, along with the snarky comment, “I would not have thought that I needed to say this.” She retweeted her statement with a microphone emoji and an even snarkier “Is this thing on?” when the president said China should investigate Joe Biden and his son Hunter.\n\nWhen the U.S. Department of Justice announced it had determined that the president’s call with Zelensky did not violate campaign finance law, Weintraub, acting unilaterally and without conferring with other commissioners, issued a draft interpretive rule arguably implying that Trump’s actions would be illegal. She posted the draft on the FEC’s website and added it to the agenda of an upcoming meeting, even though she knew the FEC, lacking the four members required for a quorum, could not do anything to act on or enforce it. All her actions did was generate publicity for herself and her view of the law. Weintraub also tweeted a link to the draft rule with a message emphasizing the foreign national prohibition’s “broad scope,” and retweeted it the next day with thick red lines underscoring the relevant language. Weintraub has also appeared on several cable news programs to discuss the foreign national ban.\n\nWhat makes these public statements so concerning is the possibility that this issue might come before Weintraub in an enforcement action. In enforcement actions, commissioners are like judges: We hear complaints alleging that someone violated the law, consider responses from the accused and make a judgement based on the facts presented. And, like judges, commissioners have to be fair and neutral in applying the law to the facts, and decide each case on its own merits. Yet, Weintraub’s statements indicate that she has already made up her mind about the president and his administration—before considering all the facts and deliberating with other commissioners. (For some context, imagine how improper it would be for a judge to go on TV and opine about a high-profile case that could come before him or her in court.) At least one news outlet has interpreted her comments to mean she thought Trump’s actions were illegal. I doubt she demanded a correction to that reading, though she seems to be trying to backtrack from her earlier statements by claiming that she was just explaining the law and not expressing her opinion on how the law applies in this case.\n\nWeintraub’s public statements also risk misleading the public about campaign finance law at a moment when the stakes couldn’t be higher. Media reports indicate that questions about the foreign national ban might play a role in Congress’s impeachment inquiry. There is no dispute that federal law prohibits foreign nationals from making contributions, donations, expenditures and disbursements in connection with U.S. elections, and prohibits any person from soliciting such contributions or donations from foreign nationals. The FEC has enforced these prohibitions in the civil context for decades, and I stand by my votes in favor of enforcement.\n\nBut Weintraub’s statements create the false impression that the law in this area is clear in all cases when, in fact, it is not. Each case has to be considered on its own specific facts. For example, the FEC concluded in a prior enforcement action that Sir Elton John—a foreign national—could give a free concert to Hillary Clinton’s presidential campaign without violating the foreign national ban, even though the concert raised millions of dollars for Clinton’s campaign. The FEC also approved political committees’ proposals to accept free coding services and intellectual property rights from foreign nationals, and to allow a foreign national to make speeches at campaign rallies and to solicit candidate contributions. If the FEC ends up considering the legality of the president’s actions, it would have to base its determination on the specific facts presented; to prejudge the result, as Weintraub seems to have done, is irresponsible.\n\nWeintraub’s hostility to other ways of interpreting the law is so extreme that she took the unprecedented step of refusing to allow the FEC to defend itself in court. Recently, a former colleague and I voted to dismiss a complaint against Clinton’s campaign committee and a pro-Clinton super PAC because, among other reasons, the record did not indicate that the two committees had “coordinated” under applicable law. Weintraub disagreed and wanted to investigate. When her view did not prevail, she threw the entire Commission (and Clinton) under the bus by refusing to allow the FEC to defend our position in court. (At least four commissioners would have had to vote to allow the agency to defend itself. Since we had only four commissioners at the time, the vote had to be unanimous.) When the complainant filed suit against the FEC, the agency was forced to ignore the court’s summons. But Weintraub was not satisfied with merely preventing the FEC from defending itself; she did not want anyone else to defend our position, either. When Clinton tried to intervene in the lawsuit to defend herself and the complainant fought to stop her, Weintraub seemed pleased, tweeting a link to the complainant’s legal brief and calling it “spellbinding reading.”\n\nWeintraub has complained for years that the FEC was dysfunctional when her Republican colleagues disagreed with her legal positions and outvoted her. Now, she is dismissing her colleagues’ views, boasting publicly about her plans to block the agency from defending itself in court whenever she disagrees with its legal position. The United States Court of Appeals for the District of Columbia Circuit has stated that the FEC is “unique among federal administrative agencies” because our “sole purpose” is to regulate “core constitutionally protected activity”—the First Amendment rights of free speech and association in politics. Weintraub’s interpretation of the law doesn’t properly consider the First Amendment—and to make it worse, she’s using radical measures to force her viewpoint.\n\nHer inflammatory public statements and inappropriate tactics risk delegitimizing the FEC by reducing the public’s trust in it to act fairly. While Weintraub is free to speak about any issue she likes in her personal capacity, we commissioners must be circumspect when acting in our official capacities. Instead, Weintraub is using her official position to drag the FEC into political debates in which it does not belong, to promote herself and her personal views of what the law should be, and to mislead the public. In light of her activity, Congress and the president should take a hard look at replacing all three remaining members of the FEC, myself included, and starting fresh with a slate of six new commissioners. No one would blame them if they did.\n\nThis article tagged under: Opinion\n\nElections\n\nFEC", "description": "Chairwoman Ellen Weintraub’s anti-Trump publicity tour is harming the legitimacy of the institution she purports to serve.", "authors": ["Caroline Hunter"], "top_image": "https://static.politico.com/fe/f6/98458fde4aee8407b9b77c192491/191021-weintraub-gty-773.jpg", "published_at": "2019-10-22"}