{"pub": "zdnet", "url": "https://www.zdnet.com/article/is-mind-reading-tech-your-next-big-security-nightmare-yes-but-not-in-the-way-you-might-expect", "downloaded_at": "2019-10-15 12:27:29.755979+00:00", "title": "Is mind-reading tech your next big security nightmare? Yes, but not in the way you might expect", "language": "en", "text": "7 ways brain computer interfaces are changing the world From helping people regain their independence to updating Facebook faster, here are some of the ways brain computer interfaces are being trialled and implemented today.\n\nTechnology allowing our thoughts and feelings to be translated into a digital form – and shared – is already a reality. Brain computer interfaces (BCI) allow us to connect our minds to computers for some limited purposes, and big tech companies including Facebook and many startups want to make this technology commonplace.\n\nspecial feature Managing AI and ML in the Enterprise The AI and ML deployments are well underway, but for CXOs the biggest issue will be managing these initiatives, and figuring out where the data science team fits in and what algorithms to buy versus build. Read More\n\nFor those of you terrified by the prospect of technology recording – and broadcasting – your opinions of the boss, your secret fears, or anything else – relax.\n\nAt least, for now.\n\nBCIs are currently not sophisticated enough to collect such granular information. The data they can gather is more based around measuring the physical movements people want to make or their emotional state. But, as machine-learning algorithms become more sophisticated and BCI hardware becomes more capable, it may be possible to read thoughts with greater precision.\n\nSEE: How to implement AI and machine learning (ZDNet special report) | Download the report as a PDF (TechRepublic)\n\nThere are currently two approaches to connecting up the human brain to external computing systems, invasive and non-invasive.\n\nNon-invasive systems read neural signals through the scalp, typically using EEG, the same technologies used by neurologists to interpret the brain's electrical impulses in order to diagnose epilepsy. Non-invasive systems can also transmit information back into the brain with techniques like transcranial magnetic stimulation, again already in use by medics.\n\nInvasive systems, meanwhile, involve direct contact between the brain and electrodes, and are being used experimentally to help people that have experienced paralysis to operate prostheses, like robotic limbs, or to aid people with hearing or sight problems to recover some element of the sense they've lost.\n\nClearly, there are more immediate hazards to invasive systems: surgery always brings risks, particularly where the delicate tissue of the brain is concerned. So given the risks involved, why choose an invasive system over a non-invasive system – why put electronics into your grey matter itself? As ever, there's a trade-off to be had. Invasive systems cut out the clutter and make it easier to decode what's going on in the brain.\n\nNon-invasive systems use the likes of EEG to read brain activity, which need millions of neurones acting in sync with each other to give a usable idea of what's going on in the brain by creating a large enough electrical field that can be detected outside the surface of the scalp. But it's a very crude measure.\n\n\"It's the equivalent of standing outside a football stadium and trying to work out what's going on in the game just by listening to the cheers. You can get a picture of some of the big events, but it's difficult to get fine-grained information,\" says Ian Daly, lecturer at the University of Essex's School of Computer Science and Electronic Engineering.\n\nInvasive systems, however, are in direct contact with the neurones – so even though they may only gather a signal from a hundred neurones, that signal is clear enough to give an insight into the thought process travelling through it.\n\nTake Ian Burkhart, a man with paraplegia who regained some function of arms using a neurosleeve and software by Canadian BCI company Battelle, as well as a Utah Array implanted into his brain. Typically, the thought required to move an arm is the job of thousands of neurones; Burkhart can move the Battelle system with just a few tens of neurones after training himself to use the system. \"Our brain has 98 billion neurones, the motor cortex has 1.2 billion responsible for hand or limb movements. We are recording from less than 100,\" says Gaurav Sharma, senior research scientist at Battelle.\n\nSEE: Mind-reading systems: Seven ways brain computer interfaces are already changing the world\n\nTo date, most uses of invasive systems have been aimed at helping people with paralysis to move their limbs once again; the greater risks of invasive systems can be worth the payoff for them.\n\nAs such, for consumer-tech applications, the short to medium term future of BCIs is likely to be non-invasive.\n\nWhile non-invasive systems may not match the accuracy of their invasive counterparts, there are new technological avenues opening up that could help researchers level-up non-invasive systems. For example, progress in machine learning is helping scientists better separate the signals from the noise, meaning the accuracy of non-invasive systems will only increase in future.\n\nAs well as software improvements, additional scanning types are beginning to be used by BCI systems: focused ultrasound and transcranial direct-current stimulation, for example, might offer a new way to read brain signals.\n\nOthers believe that existing non-invasive technologies can deliver the same brain-reading capabilities as invasive systems – at least when it comes to motor control.\n\nNew York-based CTRL Labs for example uses EMG (electromyography), which reads the electrical activity in skeletal muscle and is used by neurologists to detect nerve performance in the limbs and elsewhere. CTRL Labs makes wrist bands that measure electrical impulses, known as action potentials, in neurones within muscles, and models them in software. When you move your hand, the CTRL Labs system translates that as a hand movement, including its direction, strength and type. It was acquired by Facebook earlier this month.\n\n\"We believe that if what you're interested in doing is control you can get all the signal you want and get it more easily through non-invasive means\", Adam Berenzweig, head of R&D at CTRL Labs, told ZDNet earlier this month.\n\n\"The signal you want is available on surface EMG if you do it well enough, and more than that, the signal is easier to get because in the cortex, all the billions of neurones in the brain are interfering and are noise,\" says Berenzweig. So if all you're interested in is picking up movement signals from the brain, in most people, non-invasive systems might still do the trick.\n\nSEE: Facebook's 'mind-reading' tech startup deal could completely change how we control computers\n\nWhile invasive systems will continue to be used by those with the greatest amount to gain from BCIs, such as people with spinal injuries or neurological conditions like Parkinson's disease, broader uptake among consumers is likely to be concentrated on non-invasive systems.\n\nBecause reading signals from the brain through the scalp requires direct contact between the skin and the electrodes, it makes unwanted reading of anyone's thoughts at source unlikely and highly noticeable – you'd expect most people would be aware of a stranger unexpectedly touching their head, especially with a set of electrodes. Mind reading at source would be too easy to detect.\n\nThat said, once the data is collected by BCI and passed on to other software, it's just as secure as any other set of information. In the wake of many, many data breaches it's clear there are no guarantees that sensitive information is better protected than other kinds of data.\n\nFinding out that your information has been accessed by a data breach is never pleasant, but that someone could have been browsing your thoughts patterns or emotional states? It doesn't bear thinking about.", "description": "Mind-reading technology is about to go mainstream. Are your thoughts at risk?", "authors": ["Jo Best"], "top_image": "https://zdnet2.cbsistatic.com/hub/i/r/2019/10/10/f28e43a6-7dcf-49dd-822a-f7f37d33dd0e/thumbnail/770x578/6dbc932f2047035b20abff7b195c5798/istock-1031563502.jpg", "published_at": "2019-10-15"}