{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/asia_pacific/for-chinas-embattled-uighurs-a-bank-transfer-abroad-can-become-a-terrorism-ordeal/2019/09/19/eb6a8b1e-c3dd-11e9-b5e4-54aa56d5b7ce_story.html", "downloaded_at": "2019-09-22 00:29:51.801170+00:00", "title": "For China’s embattled Uighurs, a bank transfer abroad can become a ‘terrorism’ ordeal", "language": "en", "text": "\n\nA banner promoting the Chinese state and its ideology is displayed in several locations in Yining, in the mostly-Muslim Xinjiang region. (Anna Fifield/The Washington Post)\n\nThe Chinese state has come down not once, but twice, on Mayila Yakufu.\n\nFirst, the 41-year-old insurance company worker was taken away for 10 months of “vocational training” in one of the internment camps China has set up in the mostly-Muslim Xinjiang region as part of an extensive campaign to strip the Uighur minority of its culture and language.\n\nShe was out for barely four months before the authorities picked her up again — this time for financing terrorism. Now, the single mother of three is in a prison for criminals, serving a sentence of unknown length.\n\n“They are targeting us like the Nazi government targeted the Jews,” said Mayila’s cousin, Nyrola Elima, who lives in Sweden. “We just want to be able to live a normal life.”\n\nThe Chinese campaign to forcibly assimilate the mostly-Muslim Uighur minority, whose culture and language is Turkic, into the Han ethnic majority is showing signs of entering a new phase.\n\nUighurs living abroad have started to hear reports of family members being arrested and jailed on suspicion of financing terrorism after sending money to relatives abroad. Those relatives have also had their savings and assets confiscated by the state, they say.\n\nThis new and alarming effort appears aimed at keeping Uighurs in China from having any contact with their family members beyond the country’s borders, analysts say.\n\n“This is the first I’ve heard of this,” said Rian Thum, who specializes in Uighur history at the University of Nottingham and has been monitoring the crackdown in Xinjiang. “This shows that there has not been any letup or any softening of the policy of pursuing Uighurs who have any connection with the outside world.”\n\nChinese authorities declared in July that their effort to “de-radicalize” the population of Xinjiang had been a success and that 90 percent of the people put into camps had been released — a claim analysts and activists say is highly doubtful.\n\n\n\nMayila Yakufu spent 10 months in an internment camp operated by China. She was picked up again in four months after her release and charged with financing terrorism. (Family photo)\n\nFor the past three years, Chinese authorities have taken somewhere between 1 million and 3 million people, mostly Uighurs and ethnic Kazakhs, into what Beijing calls “vocational training schools” designed to root out extremism in the majority-Muslim area.\n\nWestern governments and human rights activists have condemned the camps and the broader operation to control Uighurs in Xinjiang, to no avail.\n\n[China celebrates ‘very happy lives’ in Xinjiang, after detaining 1 million Uighurs ]\n\nThe story of Mayila and her extended family in Yining — pieced together through interviews and documents — is just one of the many accounts of state-led pressures imposed on Xinjiang and is emblematic of new efforts targeting the Uighur minority.\n\nThe charges against Mayila appear to relate to money she sent to her parents, who had traveled to Australia in 2007 to see their son and his family in Adelaide, about 850 miles west of Sydney.\n\nThen tragedy struck. Their son drowned in the sea on New Year’s Eve. Her parents decided to stay in Australia to support their widowed daughter-in-law and take care of their grandchildren.\n\nThey opened a Uighur restaurant selling shish kebabs and noodles, and they started saving. After six years, they were ready to buy a house.\n\nOn June 23, 2013, they signed a contract for a three-bedroom, one-bathroom house in an Adelaide suburb for 377,500 Australian dollars, or about $259,000 at the current exchange rate. The settlement date was July 9, 2013, according to a copy of the contract provided by Marhaba Yakub Salay, Mayila’s sister, who also lives in Adelaide.\n\n\n\nMayila’s parents signed a contract to buy a house in Adelaide, Australia, on June 23, 2013. The settlement date was July 9, 2013, according to the contract. (Family photos)\n\nBack in Xinjiang, Mayila got busy transferring the savings her parents had left behind — the proceeds of years of running trading businesses in Xinjiang and compensation for land sold to the Chinese government.\n\nBecause of Chinese banking regulations, Mayila split the transfer into three parts.\n\nThe first tranche arrived in Australia on July 2, 2013, with Mayila listed as the sender. The following day, two deposits were sent: One in an aunt’s name and another in her uncle’s name, according to bank statements. By July 9, the settlement date, Mayila’s parents had enough to pay for the house in cash.\n\n\n\nMayila transferred her parents’ savings in three installments. The first tranche arrived in Australia on July 2, 2013. (Family photo)\n\n\n\nThe second and third installment, sent by Mayila’s aunt and uncle, respectively, arrived the following day. (Family photo)\n\nMayila stayed in touch with her parents and her sister in Australia and her cousin Nyrola in Sweden.\n\nMayila was busy at home in Yining, near the border with Kazakhstan. She would bike to the markets early to sell walnuts, before going to her day job at China Life Insurance Co. She was so good at her work that the company awarded her a certificate with a red star.\n\nAt night, Mayila, who studied in a Mandarin Chinese school and university, would teach Uighur children the majority language.\n\n[China wages crackdowns on its Muslims. But Saudi Arabia stays quiet as it bolsters ties with Beijing. ]\n\nTo relax, she enjoyed watching “Modern Family” with her children. Among the characters on the sitcom is a gay couple, and Mayila liked the idea of supporting and accepting one another no matter what.\n\n\n\nBut in 2017, things began to change.\n\nChinese authorities started to sever links between Uighurs in Xinjiang and family members overseas. Officials began conducting spot checks of phones and then installing software so they could monitor electronic communications remotely.\n\n“One by one, my old friends said goodbye to me through WeChat and deleted me,” Marhaba said, referring to the social media app that is the lifeblood of communication in China. “I felt like my sister would delete me soon, too.”\n\nSure enough, she did.\n\nChinese authorities have “created an atmosphere where any contact with relatives overseas or even in a different city is viewed with suspicion,” said James Leibold, an academic at La Trobe University in Australia who has written extensively about the repression in Xinjiang.\n\n\n\nThere is a police box on every corner in central Yining. In 2017, officials began conducting spot checks of phones and then installing software so they could monitor electronic communications remotely. (Anna Fifield/The Washington Post)\n\n\n\nA police box sits at the entrance to an amusement park on Yining’s riverfront. (Anna Fifield/The Washington Post)\n\nThe family later learned that Mayila had been taken to an internment camp.\n\nMayila’s aunt and uncle — Nyrola’s parents — took care of her children, a girl and two boys, and tried to keep them safe. Children of some interned Uighurs have been sent to orphanages.\n\nLike many Uighur families, they kept their heads down to try to avoid more attention from the state.\n\nIn December 2018, Marhaba suddenly received a call from her sister. “We’re good, we’re all good. The Communist Party of China is looking after us very well,” she recalled Mayila saying.\n\n“We think she might have been in a police station and that someone had asked her to make the call,” Marhaba said.\n\nIn April, four months after her release, Mayila went missing again. Marhaba contacted the Australian authorities, who made inquiries about the case.\n\nAustralia’s Department of Foreign Affairs and Trade informed the family that Mayila had been arrested May 15 on suspicion of financing terrorist activities. This week, officials informed the family they had received an update from the Chinese embassy in Canberra.\n\nMayila “was prosecuted in July 2019 for allegedly financing terrorist activities and is currently in good health,” an Australian official wrote in an email to Marhaba.\n\nSuch prosecutions in China almost always result in conviction, but the family has not been able to find out what sentence she received or to visit her. Officials in Yining and in Beijing did not respond to requests for comment or information.\n\n\n\nPeople’s Square in Yining, once a public space for families in the area, is now closed. (Anna Fifield/The Washington Post)\n\nAnother Uighur living abroad, Halmurat Idriss, said his sister was also accused of financing terrorism. She wired $2,800 to his bank account in Turkey, where he moved in 2016 with his parents, his wife and their three children for the promise of work and a better life.\n\n“That money was my parents’ pension funds, and we needed it to survive because I did not have a job at that time,” he said. His sister was detained over the transfer, he said, and he has not heard from her in three years.\n\nThe charge of “terrorism” has become a byword for any activity deemed to undermine the ruling Communist Party.\n\n“The party-state uses the term ‘terrorism’ for anyone who opposed it, from the Hong Kong protesters to the Dalai Lama to Xinjiang,” said Leibold. “I don’t think we can take the party-state at face value when they use that term.”\n\nMayila’s cousin and sister say she has been held in prison for the past six months, with no access to lawyers or family members.\n\nThe authorities also confiscated all of Mayila’s savings — the equivalent of about $56,000, Nyrola said. It was money she had saved from working three jobs. “They are now targeting people with money so that they can take it,” Nyrola said.\n\n[U.S. Senate revives bill that could sanction China over treatment of its Muslims ]\n\nMayila’s aunt and uncle continue to look after Mayila’s children. Abide, 17, is a straight-A student who likes to sing songs by Taylor Swift and read Harry Potter books in English. Lutfulla has just started seventh grade and loves taekwondo. Mayila’s youngest, Zikirulla, was born two months premature and is, in the words of his aunt, “smart but not strong.”\n\nAll three of them go to Mandarin Chinese school in Yining, not schools taught in the Uighur language.\n\nMayila’s aunt and uncle, 60-year-old Gulebaikeremi Maimutimin and 63-year-old Hasimu Tuoheti, live in constant fear that the children will be taken from them.\n\nLast month, they received notices from the Public Security Bureau that they were being investigated on suspicion of helping finance terrorist activities and illegally possessing articles of extremism.\n\nThey trace this action to the fact that their names are associated with the money sent to Australia in 2013 for Mayila’s parents’ house.\n\n“We can prove that this money didn’t go to terrorist activities,” Nyrola said, referring to the bank statements and the housing contract.\n\nHer mother has been busy teaching the children how to cook and shop and look after themselves in case she is jailed, Nyrola said. She has shown them where the winter clothes and bedding are stored and how to turn on the heating once the cold weather arrives.\n\nThey are waiting to see just how bad this winter will be.\n\n\n\nA riverfront amusement park frequented by tourists in Yining. (Anna Fifield/The Washington Post)\n\nRead more:\n\nEditorial board: China is brainwashing Uighur children. How much longer will the world look away?\n\nVolkswagen CEO ‘not aware’ of Uighur detentions despite having factory there\n\n‘Police cloud’: Chinese database tracks apps, car location and even electricity usage in Muslim region\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "description": "One family’s plight suggests wider efforts by Beijing to break ties between mostly-Muslim Xinjiang and its diaspora.", "authors": ["Anna Fifield", "Beijing Bureau Chief."], "top_image": "https://www.washingtonpost.com/resizer/IrDQUIxb27PxQ1_5TIrcZ-SMhIU=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NTVV7JWVRMI6TCJEDW35VR4X7M.jpg", "published_at": "2019-09-19"}