{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-usa-trump-impeachment/ex-campaign-chief-defends-trump-defies-democrats-at-impeachment-hearing-idUKKBN1W211I", "downloaded_at": "2019-09-17 23:30:07.646319+00:00", "title": "Ex-campaign chief defends Trump, defies Democrats at impeachment hearing", "language": "en", "text": "WASHINGTON (Reuters) - President Donald Trump’s former campaign manager on Tuesday acknowledged that his former boss enlisted him to try to limit the Russia election interference inquiry but defended Trump and tangled with Democrats during pugnacious testimony to a U.S. congressional panel mulling whether to impeach the president.\n\nCorey Lewandowski, a Trump confidant eyeing a run as a Republican for the U.S. Senate in New Hampshire, testified under subpoena to the House of Representatives Judiciary Committee at a contentious hearing that once again exposed America’s gaping partisan divisions ahead of the 2020 presidential election.\n\n“The president didn’t ask me to do anything illegal and he never asked me to keep anything secret,” Lewandowski told the Democratic-led committee during a hearing spanning about 5-1/2 hours.\n\nLewandowski told frustrated Democrats that he would refuse to answer questions about his conversations with Trump that Democrats view as evidence of obstruction of justice - a potential impeachment charge - and often dodged their queries.\n\nBut Lewandowski confirmed that Trump had asked him in 2017, when he held no government post, to tell then-Attorney General Jeff Sessions, the top U.S. law enforcement officer, to limit the scope of Special Counsel Robert Mueller’s Russia inquiry in a way that would have ended scrutiny of Trump’s 2016 campaign.\n\nLewandowski also told the committee that he regarded as “a joke” Trump’s remark to him that the president would fire Sessions if the attorney general did not meet with Lewandowski. Sessions, who eventually was fired by Trump in 2018, ultimately did not meet with Lewandowski.\n\nThe committee’s Democratic chairman, Jerrold Nadler, called Lewandowski’s conduct at the hearing “completely unacceptable” and was considering seeking to hold him in contempt of Congress.\n\nLewandowski appeared at the panel’s first hearing since it made clear last week it is actively considering articles of impeachment against Trump. Mueller told the panel in July about his inquiry that detailed Russian interference in the 2016 election to boost Trump’s candidacy, the Trump campaign’s willingness to accept Moscow’s help and the president’s actions to impede the investigation.\n\n“We as a nation, would be better served if elected officials like yourselves concentrated your efforts to combat the true crises facing our country as opposed to going down rabbit holes like this hearing,” Lewandowski said in his opening statement.\n\nNadler began the hearing, focussed on “presidential obstruction of justice and abuse of power,” by slamming the White House for instructing Lewandowski on Monday not to discuss conversations with Trump after he became president by invoking a doctrine called executive privilege.\n\n“We should call this what it is: an absolute cover-up by the White House,” Nadler said.\n\n“The White House is advancing a new and dangerous theory: the crony privilege,” Nadler added.\n\nA group of White House lawyers sat behind Lewandowski during the hearing, a fact noted by Democratic lawmakers who repeatedly hammered the former campaign manager. Trump fired Lewandowski in June 2016 but remained close to him in subsequent years.\n\nCorey Lewandowski, U.S. President Donald Trump's former campaign manager and close confidant, is sworn in to testify at the start of the House Judiciary Committee's impeachment investigation hearing on Capitol Hill in Washington, U.S., September 17, 2019. REUTERS/Joshua Roberts TPX IMAGES OF THE DAY\n\nUnder the U.S. Constitution, the House has the power to vote to impeach a president while the Senate then would hold a trial on whether to remove him from office. The House is controlled by Democrats and the Senate by Trump’s fellow Republicans.\n\n‘ABSOLUTELY IMMUNE’\n\nTwo other witnesses - former Trump White House aides Rob Porter and Rick Dearborn - had been scheduled to appear but the White House directed them not to testify, contending they were “absolutely immune from compelled congressional testimony with respect to matters related to their service as senior advisers to the President.”\n\nLewandowski confirmed Mueller’s account of a June 2017 meeting at the White House in which Trump asked him to deliver a message to Sessions that the attorney general should shift the Russia probe’s focus to future elections despite his recusal from the investigation due to his own contacts with Russia’s former U.S. ambassador.\n\nAt times Lewandowski provided details not included in Mueller’s investigative report released in April, despite the White House’s instructions to limit his testimony. Lewandowski, for example, said he never delivered the message to Sessions because he went on a beach vacation with his children.\n\nAt a second meeting a month later, Trump asked about the status of his message and said Lewandowski should “tell Sessions he was fired” if he would not meet with Lewandowski, according to the Mueller report.\n\n“I took that as a joke,” Lewandowski testified about the firing threat.\n\nLewandowski also acknowledged he did not want to confer with Sessions at the Justice Department, which would have created a public record of his planned meeting.\n\nLewandowski faced friendlier questions from Republican lawmakers, who unsuccessfully sought to have the hearing adjourned early on and accused Democrats of pursuing an endless and fruitless investigation of Trump for political purposes.\n\nTrump on Twitter called Lewandowski’s testimony “beautiful.”\n\nLewandowski assailed the Russia investigation.\n\n“It is now clear the investigation was populated by many Trump haters who had their own agenda - to try and take down a duly elected president of the United States. As for actual ‘collusion’ or ‘conspiracy,’ there was none. What there has been however, is harassment of the president from the day he won the election,” Lewandowski testified.\n\nLewandowski testified that while he had not read the Mueller report and he never called into questions its findings. Lewandowski also acknowledged attending an event where he signed copies of the report.\n\nSlideshow (20 Images)\n\nBarry Berke, a lawyer for the House Democrats, questioned Lewandowski about an appearance on the MSNBC news channel in which he made comments that contradicted his testimony to Mueller.\n\n“Perhaps I was inaccurate at the time,” Lewandowski testified, adding that “I have no obligation to have a candid conversation with the media.”", "description": "President Donald Trump's former campaign manager on Tuesday acknowledged that his former boss enlisted him to try to limit the Russia election interference inquiry but defended Trump and tangled with Democrats during pugnacious testimony to a U.S. congressional panel mulling whether to impeach the president.", "authors": ["David Morgan", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190917&t=2&i=1430945472&w=1200&r=LYNXMPEF8G1LG", "published_at": "2019-09-17"}