{"pub": "breitbart", "url": "https://breitbart.com/tech/2019/10/08/twitter-users-attempt-to-cancel-youtube-star-logan-paul-over-abortion-comments", "downloaded_at": "2019-10-09 00:53:26.548416+00:00", "title": "Twitter Users Attempt to #Cancel YouTube Star Logan Paul over Abortion Comments", "language": "en", "text": "YouTube star and podcast host Logan Paul has been targeted by Twitter users over his recent comments about abortion at a promotional event for an upcoming boxing match. Paul observed that his opponent, KSI, has caused five abortions, adding, “That’s five babies dead.”\n\nYouTube star Logan Paul, who is best known for recording the dead body of a suicide victim in the Aokigahara forest in Japan, is facing criticism for his recent comments about abortion at a promotional event for his upcoming boxing rematch against fellow YouTuber KSI.\n\nDuring the promotional event, Paul made a comment about KSI – real name Olajide William “JJ” Olatunji – and his past history with abortion stating: “Y’all might not know but JJ’s on his fifth abortion. That’s five babies dead and I think I’m gonna return the favor and I might kill you man, I might end you man.”\n\nFootage of Paul’s comments can be seen below:\n\nFirstly @LoganPaul you don’t know shit about jj. Secondly, imagine disagreeing with abortions in 2019. Grow up. Absolute twat I swear. And girls, don’t be ashamed of abortions. #LoganPaulIsOverParty pic.twitter.com/T4s2iRSqv7 — katie (@sdmnjide) October 7, 2019\n\nTwitter users took to the hashtag #LoganPaulIsOverParty to criticize Paul for his comments:\n\n#LoganPaulIsOverParty get it trending bitches — Paige ✨|| JJ win or i sue (@wroetobeech) October 7, 2019\n\n#LoganPaulIsOverParty\n\nI guess chole left you because you dont respect women, but what can we expect from a guy who used death and sui***e for views — Ahmed (@minters_mash) October 7, 2019\n\nCan we just go on record and say that Logan Paul is a cunt. That is all.\n\n#LoganPaul #loganpaulisoverparty — Major's Mess Hall Podcast (@majorsmesshall) January 12, 2019\n\nOthers pointed out that Paul has committed a number of acts that should likely have had him “canceled” long before this incident, such as filming the dead body of a suicide victim and using an electric taser on a dead rat, but the majority of woke warriors did not go after him until he mentioned abortion:\n\nthis dude literally filmed a d**d person and laughed at him and yall are cancelling him NOW bc he is against abortion? #loganpaulisoverparty pic.twitter.com/vlIK6KXN8l — ‏ً (@yslhao) October 7, 2019\n\nThe way y’all cancel Logan and Jake Paul, James Charles, Shane Dawson, And Jeffree Star every year but keep watching them. Very telling pic.twitter.com/aJdopoPGky #loganpaulisoverparty — satan 🎃 (@MARVELOLOGY) October 7, 2019\n\nA number of individuals found themselves agreeing with Paul’s comments:\n\nBREAKING: I can’t believe I’m saying this but I agree with @LoganPaul ABORTION IS MURDER!! And abortion equals dead babies. Abortion for any reason other than life or death isn’t a woman’s “right” it’s murder for convenience! BABY LIVES MATTER! RT!#loganpaulisoverparty — Graham Allen (@GrahamAllen_1) October 7, 2019\n\nLogan Paul is correct. Abortion is shameful and should only ever be a desperate last resort. Treating the unborn like medical waste is a sign of a diseased society.#loganpaulisoverparty — Paul Joseph Watson (@PrisonPlanet) October 7, 2019\n\nYouTuber, Trump supporters, and Republican candidate for Congress Joseph Saladino (also known as Joey Salads) also posted that he doesn’t believe this latest attempt to cancel Paul will have much of an effect:\n\nLogan Paul doesn’t like that babies are killed during abortions. Now the Left is trying to cancel him for this evil stance 😂 These are the same people who canceled him a year ago, that went well…#loganpaulisoverparty — Saladino for Congress (@JoeySalads) October 7, 2019\n\nIt’s unsurprising that Paul would make a statement he likely knew would be controversial during a promotional event for his boxing rematch against KSI. Logan and his brother Jake have made their careers by knowing how to gain views and generate media outrage. Before this incident, the majority of people on Twitter were not discussing Paul and were likely not aware that he had a major boxing match coming up, now thanks to a popular hashtag calling for him to be #canceled he has likely reached a whole new audience.\n\nLucas Nolan is a reporter for Breitbart News covering issues of free speech and online censorship. Follow him on Twitter @LucasNolan or email him at lnolan@breitbart.com", "description": "YouTube star and podcast host Logan Paul has been targeted by Twitter users over his recent comments about abortion at a promotional event for an upcoming boxing match. Paul observed that his opponent, KSI, has caused five abortions, adding, \"That's five babies dead.\"", "authors": ["Lucas Nolan"], "top_image": "https://media.breitbart.com/media/2018/01/wi/afp/02/2fmouin-e1514929825479.jpg", "published_at": "2019-10-08"}