{"pub": "cbs", "url": "https://cbsnews.com/news/chowchilla-kidnapping-parole-hearing-frederick-woods", "downloaded_at": "2019-10-08 12:09:45.573596+00:00", "title": "Parole hearing could re-open scars for children buried alive in 1976 Chowchilla kidnapping", "language": "en", "text": "It was 1976. Twenty-six terrified children – some as young as five – and their school bus driver, Ed Ray, were kidnapped at gunpoint by three armed men in the central California city of Chowchilla and buried alive. It was one of the country's most notorious and bizarre mass kidnappings.\n\n\"I was wondering how it was going to feel to die. I was too scared to move,\" one of the kidnapping victims, Larry Park, told \"48 Hours.\"\n\n\"The first man came on the bus… and he had a gun,\" Park said. \"Ed Ray said, 'What's going on?' And he said, 'Shut up and move to the back.'\"\n\nThe kidnappers, who planned to ask for a $5 million ransom, drove the kids to a rock quarry where a truck trailer had been hidden 12 feet underground, reports CBS News correspondent David Begnaud. They forced the children inside through a hole in the roof and buried them.\n\nThey all managed to survive and escape their kidnappers. But one of the three kidnappers, alleged mastermind Frederick Woods, has a parole hearing Tuesday morning, and the hearing could re-open those scars from years ago.\n\n\"I felt like I was an animal going to the slaughterhouse,\" another victim, Jennifer Brown Hyde, said.\n\n\"It would be silent and then somebody would bust out crying and the hole would just erupt,\" victim Michael Marshall said.\n\nAfter about 12 hours, the roof began to cave in.\n\n\"And I remember children just screaming and crying,\" Park said. \"The sides of the van were bowing in… I knew that I was going to die. I knew it.\"\n\nThey were able to escape, digging their way out and getting to safety. But those 28 hours of terror would impact the rest of their lives.\n\n\"By the time I was 21, I was using meth. I was smoking crack,\" Park said.\n\n\"When you've gone through something that's so traumatic, it's hard to go back and be a normal kid again,\" Hyde said.\n\nSlowly, 43 years later, these survivors are still piecing their lives back together.\n\n\"I have nine years sober. My resentment for them… was killing me,\" Park said, adding, \"One night… I was laying in bed… and I said, 'God help me to forgive them.'\"\n\nForgive he did. Park met with one of the kidnappers, Richard Schoenfeld, and said it changed his life, that he was finally at peace. Schoenfeld and his brother, James, were both paroled within the last seven years.\n\nWatch Begnaud's \"48 Hours\" report, \"The Chowchilla Kidnapping,\" Saturday at 10/9c on CBS.", "description": "26 terrified children – some as young as five – and their school bus driver, Ed Ray, were kidnapped at gunpoint", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/08/b4935feb-21bd-4849-b1c9-1ce7171e007a/thumbnail/1200x630/ddb987e0bba45ebeb31960757ebe9c80/ctm-1008-chowchilla-kidnappers.jpg", "published_at": "2019-10-08"}