{"pub": "hotair", "url": "https://hotair.com/archives/john-s-2/2019/09/26/elizabeth-warren-still-wont-admit-health-plan-raise-taxes", "downloaded_at": "2019-09-27 01:30:50.304105+00:00", "title": "Elizabeth Warren still won’t admit her health plan would raise taxes on the middle class", "language": "en", "text": "Here she goes again. Today, Elizabeth Warren was asked if her health reform plan would raise taxes on the middle class. In keeping with every other time she’s been asked this question, Warren dodged.\n\n“So, yes or no, should middle-class Americans expect their taxes to go up under a Medicare for All system?” NBC News’ Ali Vitali asked.\n\n“You know, you may remember that I spent a big chunk of my life studying why middle-class families go broke,” Warren replied.\n\nI can’t bring myself to transcribe the rest of her minute-long answer to a yes or no question. You’ve probably heard it enough times to recite it yourself by now. She ended her spiel with, “We should expect that for giant corporations and very wealthy individuals, costs will go up, but for middle-class families, for hard-working people costs are going to go down.”\n\n“But that’s not the same as taxes not going up,” Velshi pointed out.\n\n“What matters to families is cost,” Warren replied.\n\nVelshi tried again: “So do you think then that Americans are willing to pay a little bit more in taxes if, generally, the household costs are going down?”\n\n“I think that families care about what their costs are,” Warren replied, still refusing to use the T-word. Then she added, “Over and over and over.” It seemed like a not-so-subtle hint to Velshi, i.e. you can ask me this same question over and over and I’m never going to admit middle-class taxes will go up.\n\nGood for Velshi for at least trying to breach this wall, but she isn’t the first to try and fail. Last Tuesday night, Elizabeth Warren appeared on Stephen Colbert’s show. Colbert begged her to admit the truth about middle-class taxes going up instead of offering the same answer she has been giving for months. Warren refused and instead offered a two-minute-long filibuster. Colbert gave up and used what little time he had left in the segment to ask a few other questions.\n\nThe thing is, Colbert (and probably Velshi) wouldn’t be arguing this point with Warren at all if she’d just admit that middle-class taxes would go up. They aren’t going to challenge her on the claim that overall costs would go down, they just want her to be straightforward on taxes. But she won’t do it.\n\nHere’s why I think Warren keeps this up even if it isn’t fooling anyone in the media. The difference between premiums and taxes is that many people, at present, aren’t paying the full cost of their premiums directly to an insurer. Instead, their employer is shouldering a portion of the cost. Even so, they may have some options about what they want to pay when they renew each year. They can select a Cadillac plan that covers a high percentage of everything or a more modest plan that covers a bit less. But no one gets to make a choice about what taxes they pay. Once taxes go up, you’re stuck paying or facing off with the IRS over failing to do so.\n\nAgain, Warren could make the case that not having a choice is a better system for everyone, but her refusal to admit the truth about taxes on the middle-class suggests she doesn’t quite believe it.", "description": "\"So, yes or no, should middle-class Americans expect their taxes to go up...\"", "authors": ["John Sexton", "Ed Morrissey", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/Warren-Velshi.jpg", "published_at": "2019-09-26"}