{"pub": "businessinsider", "title": "The Jury's Still Out On How Bad Sunscreens Are For Corals", "url": "https://gizmodo.com.au/2019/09/the-jurys-still-out-on-how-bad-sunscreens-are-for-corals", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-02 07:35:49.356393+00:00", "text": "Photo: AP\n\nMikhail Matz loves corals. As a biology professor at the University of Texas at Austin, Matz is well aware of the many threats corals face: global warming, pollution, ocean acidification, you name it. But when it comes to the danger posed by sunscreen chemicals — some of which are now banned in certain states and countries after research found they could bleach coral in the lab — Matz just isn’t convinced.\n\nHe’s tried to induce bleaching in corals, a reaction in which corals expel algae, a main food source, and usually die, in every which way possible. He’s even filled a tub of corals with sunscreen until the water was milky white with the substance. Matz told Gizmodo the corals he tested were fine. In fact, they were “happy,” he said, with their tentacles out and feeding.\n\n“Sunscreen is not a problem,” Matz said. “Actually, you can kill corals much more efficiently if you pee on them,” he joked.\n\nHis attitude highlights a point of contention among coral scientists. On the one hand, research drawing links between certain ultraviolet-filtering chemicals — particularly oxybenzone and octinoxate — is still just a few years old. On the other hand, the state of the world’s corals is dire, and any threat to these ecosystems should be taken seriously.\n\nJust Friday, Australia reduced the health status of the Great Barrier Reef to the lowest status because it’s doing so poorly.\n\nSummer’s coming to an end in the U.S., but the weather’s still ripe for a beach trip in many areas. Perhaps you’re planning a winter getaway to an island paradise. If you’re heading to Hawaii or the U.S. Virgin Islands, your favourite sunscreen may be illegal by 2021 and March 2020, respectively. However, the issue isn’t settled, and some, like Matz, worry the sunscreen debate distracts us from some of the more severe threats to corals.\n\n“The scientific community does not believe it,” Matz told Gizmodo.\n\nExcept, well, many in the science community do. Craig Downs, the executive director of the Haereticus Environmental Laboratory, published some of the first literature on the topic back in 2016. His study, which was peer-reviewed and supported by the National Oceanic and Atmospheric Administration (NOAA), determined that oxybenzone and benzophenone-2, another chemical that can be found in sunscreen, induced bleaching in coral larvae.\n\nThis was all, of course, in a lab setting, because who’s going to pour sunscreen onto a wild coral reef? Since that paper, Downs has heard from thousands of people who want to learn more about the topic, he told Gizmodo.\n\n“The science in that study was the tip of the iceberg,” he wrote to Gizmodo in an email.\n\nPhoto: AP\n\nCheryl Woodley, a research scientist with NOAA’s National Centres for Coastal Ocean Science, worked on that study with Downs. She said the impacts they witnessed aren’t exclusive to corals: Macroalgae, fish, and invertebrates also suffered when exposed to the ultraviolet filters in sunscreens.\n\nShe’s been reviewing the literature on the topic and said she’s identified some 500 recent papers that show the way these ingredients impact living things.\n\nEven the supposedly safer mineral filters, titanium dioxide and zinc oxide, have been linked to harming corals (despite many sunscreen companies dubbing them “reef safe,” a label that requires no regulation or oversight).\n\n“My role is to provide science-based information to managers, to decision-makers, and it’s their role to decide if it’s enough or not ,” she said. “There are some that have decided it’s not enough. There are others — with the body of information based in the science — that have felt like in the protection of their resources and their communities, this is the decision they need to make.”\n\nSince their research, a number of studies and reviews have come out on the specific topic of corals and sunscreen bans. The more research, the better informed these decision-makers can be. But as Abigail Renegar, a corals research at Nova Southeastern University, told Gizmodo, there’s still a lot we don’t know. These experiments look at different coral species and different chemicals.\n\nThey use different methodologies and ways of measuring the concentration of the chemicals in the water. The way sunscreen from the bodies of swimmers might affect corals in the real world is, to put it simply, hard to study, Renegar said.\n\n“All of these experiments have some degree of variability in the methods,” she said. “So it makes understanding what the actual effects are very, very difficult to interpret.”\n\nWhat’s remained consistent, however, is the negative reaction from corals to oxybenzone, the main target of these bans. Despite Renegar’s critical eye to these studies, she believes there’s enough out there to warrant the bans. If corals suffer under short-term exposure, she can only imagine what this long-term exposure to low levels of these chemicals may mean for the corals.\n\n“A lot of researchers that I really respect have done a lot of this research, and it is something that we can do something about ,” she told Gizmodo. “The political will exists right now to do something about that.”\n\nConcerned beachgoers may opt to minimise the amount of sunscreen they use by wearing long-sleeve rash guards and other sun-protective clothing. It’s important not to skimp on sun protection altogether, though: Unlike with corals and sunscreen, the science is settled when it comes to sunburns causing skin cancer.\n\nThe real threat to corals — no matter your stance on sunscreen — is global warming. What the corals need is for us to get our shit together. Sunscreen bans won’t help corals if they’re boiling underwater.", "description": "Mikhail Matz loves corals. As a biology professor at the University of Texas at Austin, Matz is well aware of the many threats corals face: global warming, pollution, ocean acidification, you name it. But when it comes to the danger posed by sunscreen chemicals — some of which are now banned in certain states and...", "authors": ["Tegan Jones", "Sarah Basford"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/twhesbmwrzlutxbummgy.jpg"}