{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/17/new-jersey-council-members-defend-colleagues-repor", "downloaded_at": "2019-09-17 23:30:11.491878+00:00", "title": "New Jersey council members defend colleague's reported use of 'Jew her down': 'It's nothing vicious'", "language": "en", "text": "Two city council members in Trenton, New Jersey, have defended the council president’s reported use of an anti-Semitic slur after she said “Jew her down” during a closed-door meeting earlier this month.\n\nTrenton City Council President Kathy McBride is facing calls to resign after she said on Sept. 5 that a city attorney negotiating a woman’s personal injury lawsuit was “able to wait her out and Jew her down” on settling for a lower amount, the New Jersey Globe reported.\n\nCouncil members Robin Vaughn and George Muschal initially defended the alleged use of the slur, saying it wasn’t anti-Semitic.\n\n“We really need to get a more acute meaning and understanding of ‘anti-Semitic’. I believe her comment ‘jew down’ was more in reference to negotiating not ‘I hate jews,’” Ms. Vaughn wrote on Facebook, NJ.com reported. “Inappropriate in today’s PC culture absolutely, but to Jew someone down is a verb and is not anti-anything or indicative of hating Jewish people.”\n\nMr. Muschal claimed the slur is “just a statement of speech.”\n\n“You know, it’s like a car dealer, they wanted $5,000, you Jew ‘em down to $4,000,” he told the Globe. “It’s nothing vicious. The expression has been said millions of times.”\n\nAt-large councilman Jerell Blakeley has called on all three members to step down.\n\n“All three are an embarrassment to the city of Trenton and should resign,” he told NJ.com.\n\nTrenton Mayor Reed Gusciora said Ms. McBride and Mr. Muschal have since apologized privately to the city attorney who worked on the settlement. Ms. Vaughn has yet to apologize, and none of them have yet done so publicly.\n\n“This is a teachable moment that people should [be] more tolerant and at the end of the day words do matter, and that if they’re hurtful they should be either retracted or apologized for,” the mayor told NJ.com.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Two city council members in Trenton, New Jersey, have defended the council president's reported use of an anti-Semitic slur after she said \"Jew her down\" during a closed-door meeting earlier this month.", "authors": ["The Washington Times Http", "Jessica Chasmar"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/17/Kathy_McBride_c0-0-900-524_s1770x1032.jpg?9b28fa881f4a33acee1b165db0076e895212ff98", "published_at": "2019-09-17"}