{"pub": "yahoo", "url": "https://yahoo.com/entertainment/friday-ratings-2019-world-series-180524476.html", "downloaded_at": "2019-10-28 03:14:23.222911+00:00", "title": "Friday Ratings: The 2019 World Series Hits A Home Run With Viewers, Winning The Night", "language": "en", "text": "Click here to read the full article.\n\nThe 2019 World Series dominated the Friday night ratings, as the Houston Astros crawled out of the two-game hole they dug against the Washington Nationals with a 4-1 victory. The riveting comeback drew a 2.6 and 11.74 million viewers for Fox, dominating the competition.\n\nWhile the Series won the night, CBS offered a strong alternative for those not into baseball. Starting with Hawaii Five-0 (0.7, 6.55 million viewers), up a tenth week-to-week and increasing its viewers. Following that strong opener, the Eye Network charged ahead with Magnum P.I. (an 0.6 and 5.93 million), up a tenth in demos and also rising in viewers.\n\nCapping the CBS night was perennial strongman Blue Bloods, which scored an 0.6 and 6.85 million viewers, holding steady week-to-week but down slightly in total viewers.\n\nAt ABC, newsmag 20/20 improved week-to-week by double digits across the board: Total Viewers (+37% – 3.7 million vs. 2.7 million), Adults 18-49 (+50% – 0.6/3 vs. 0.4/2) and Adults 25-54 (+43% – 1.0/4 vs. 0.7/3). That was its strongest news demo performance in over six months.\n\nAmerican Housewife also had a good night, holding steady at 0.6 and 3.35 million total audience, while fellow comedy Fresh Off The Boat had an 0.5 and 2.42 million, holding steady week-to-week.\n\nNBC saw The Blacklist up and matching its season high in demos, scoring an 0.5 and 3.57 million, with Dateline down week-to-week at 0.5 and 3.05 million.\n\nAt The CW, Charmed continued its momentum, holding at 0.2 and up slightly in total viewers to 770,000. Dynasty also held at 0.1 and 480,000.\n\nMore from Deadline\n\nSign up for Deadline's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.", "description": "The 2019 World Series dominated the Friday night ratings, as the Houston Astros crawled out of the two-game hole they dug against the Washington Nationals with a 4-1 victory. The riveting comeback drew a 2.6 and 11.74 million viewers for Fox, dominating the competition. While the Series won the night", "authors": ["Bruce Haring"], "top_image": "https://s.yimg.com/uu/api/res/1.2/JTLtIGVvd9_D8aAty9K0Yg--~B/aD0zNDE7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/deadline.com/b8d4d0cdba90b45d5cfceaa07e7167ea", "published_at": "2019-10-26"}