{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/02/things-are-getting-unstable-global-heating-and-the-rise-of-rockfalls-in-swiss-alps", "downloaded_at": "2019-10-02 12:49:59.446412+00:00", "published_at": "2019-10-02", "title": "'Things are getting unstable': global heating and the rise of rockfalls in Swiss Alps", "language": "en", "text": "As Switzerland’s glaciers melt, dangerous rockfalls become more likely and towns are forced to live under an existential threat\n\nThe thunderous roar that resounded through Bregaglia in Switzerland last month was familiar to its residents. Once again, rocks were falling off the face of the Piz Cengalo mountain.\n\nFacebook Twitter Pinterest Fernando Giovanoli, the vice-mayor of Bregaglia. Photograph: Thomas Cristofoletti/Ruom\n\n“You hear it, and you know immediately what it is. Then you see all the dust,” says Fernando Giovanoli, the commune’s deputy president. He had seen the rockfall from his mountainside home opposite the mountain. People have lived in the valley for more than 1,000 years, but recently, rockfalls have become more frequent, even fatal.\n\nAcross Switzerland, reports of rockfalls are piling up. Some have blocked streets, others have destroyed infrastructure. In the most catastrophic events, millions of cubic tons of rock have crumbled off mountains and crushed tourists. Last week in the Italian Alps, authorities closed roads and evacuated residents after warnings that a large part of the Planpincieux glacier was at risk of collapsing.\n\nFor the Swiss authorities, these increasingly common rockfalls present a major challenge. As global heating melts the myriad glaciers across the Swiss Alps and thaws its soil, related natural disasters are made more likely. What’s impossible to tell is when – or where – the next catastrophe will occur.\n\nThe Piz Cengalo is one example. Although experts were keeping a close eye on movement on the mountain, they could not tell how bad that rockfall in August 2017 would be. One morning, the 100-plus residents of the quaint village of Bondo heard the roar. In an instant, they had to leave their belongings and flee.\n\nMore than 3m cubic meters of rock descended from the Piz Cengalo, killing eight hikers. The sliding rocks then triggered massive mudslides that funnelled down the valley and flooded the village.\n\n“We never thought that we would be displaced for four months, that it’d take so long for us to return,” says Manuela Marazzi, who was ironing shirts when the mountain crumbled. Opposite her home, a car-sized rock engraved with the date of the event serves as a commemoration, one of thousands that washed down the valley that day. Two years later, electricity and water pipes are still provisional. Part of the carpentry shop, the largest employer in the tiny village, is still closed. The hikers’ bodies remain on the mountain.\n\nFacebook Twitter Pinterest The tiny Bondasca creek, once lined by foliage, swelled to a raging river after the Piz Cengalo rock fall two years ago. Rock and debris have now replaced the foliage. Photograph: Thomas Cristofoletti/Ruom\n\nIt was the most deadly rockfall in recent memory, and although the exact cause has not yet been determined scientists say another 3m cubic meters of rock on the Piz Cengalo are so unstable they could fall at any moment.\n\nBut Bondo is prepared. An hour’s hike from the village, Giovanoli points to a device that measures the water level. Should it swell to a dangerous level, four sirens will warn residents to evacuate and traffic will be barred from entry. A radar and a seismic station have also been installed.\n\nFor most of the Alps, however, there are no alarms or movement monitors.\n\nFacebook Twitter Pinterest Marcia Phillips, a permafrost expert with the Institute of Snow and Avalanche Research, tours the bottom of the Flüela Wisshorn near her institute’s headquarters in Davos. In spring 2019, more than 250,000 cubic meters of ice and rock came crashing down, covering a popular hiking trail. Photograph: Thomas Cristofoletti/Ruom\n\nA 10-minute drive from Davos, which hosts the World Economic Forum each year, Marcia Phillips, a scientist at the Institute for Snow and Avalanche Research, gets out of her car and looks at the Flüela Wisshorn. About 300,000 tons of rock fell off the mountain in March.\n\n“It was very lucky that it happened during the night, because it is a very popular route with ski touring, so it could have easily killed several people,” she says.\n\nReports of the rockfall reached the scientists a few hours after the event because it is popular with tourists and close to a road. But most rockfalls happen in remote areas where nobody takes note, and very few can be surveyed and studied. On-site measurements of the unstable Piz Cengalo, for example, would simply be too dangerous. What’s certain, Phillips says, is that there have been more reports of rockfalls.\n\n“At the moment we have the impression that a lot more is coming down,” she says, “and things have definitely got unstable.”\n\nThe reasons are complex. The structure of the mountain and the way it eroded over millennia play a role, as does the warming climate. In the past 120 years, temperatures in the Alps have risen by just under 2C – twice the global average.\n\n“Climate change has a direct effect on the ice masses and the retreating glaciers,” says Andreas Bauder, a glaciologist at ETH Zurich. Glaciers, he explains, contribute to the stability of the Alps both because they can support rock and because they protect the mountains from precipitation. If water seeps into the mountain, that can lead to erosion – and rockfalls.\n\nFacebook Twitter Pinterest A scientist explains how instruments help track any movement on the mountains, allowing them to alert and evacuate residents and tourists ahead of a major rock fall. Photograph: Thomas Cristofoletti/Ruom\n\nPermafrost – rock and soil that is permanently below freezing – is the same. Once it is no longer frozen, water can seep in, working like a wedge in the rock, Phillips says.\n\n“We have glaciers retreating, permafrost thawing, water coming in, so definitely, things are getting unstable,” she says. The result are complex chain reactions, so-called hazard chains that can include not only rockfalls but flooding and mudslides.\n\n“If we reach our climate goals, the hope would be that the glaciers will recover,” says Bauder. “But even if we reach them, it will take a while for the climate to recover, and the glaciers will respond afterward.” Half the Alps’ glaciers are already lost due to our past emissions and are expected to have fully melted by 2050.\n\nOften, smaller rockfalls are the first heralds of looming disasters, says Anton Lüthi, a natural disasters specialist working for the canton of Bern. In the past years, he has worked out emergency plans for at-risk areas. “It’s a matter of being prepared, and knowing what to do when something happens,” he says.\n\nOne morning in July, Lüthi inspected a particularly worrisome area at Öschinen Lake, a popular tourist spot which attracts as many as 3,000 people a day in summer. A massive rock protrudes from the mountains around the lake, and two years ago, a paraglider observed a widening gap in the crag. Geologists found it was shifting fast, moving 2cm every day. Now, experts say 15m cubic meters of rock – enough to fill 6,000 Olympic-sized swimming pools – is at risk of crashing down.\n\nFacebook Twitter Pinterest Experts approach Oeschinen See, which sees up to 4,000 tourists per day. Photograph: Thomas Cristofoletti/Ruom\n\nOpposite the shifting crag, a surveying instrument scans the mountain’s surface every 30 minutes. Experts analyse the data to determine whether movement is increasing, and try to predict when a major rockfall is imminent. So far, more than half a million pounds has been spent on surveying just this rock; across the country, billions have been spent on such responses to the threats posed by climate breakdown.\n\nEmergency plans have been mapped down to the finest details, from the exact wording of messages that will be disseminated to tourists and locals, to the location of the keys for emergency shelters. Even the signs to cordon off hiking trails have already been printed.\n\nIn the village at the foot of the mountains, locals are unfazed by the looming danger. “We’ve been watching smaller chunks fall off for a year now,” says Fabienne Kallen, a waitress at the Ermitage hotel, one of the buildings closest to the rock. “I guess if it’s something bigger, we’d have to evacuate the hotel,” she says. “But we trust in the fire brigade to let us know.”\n\nThe same nonchalance is found in Bondo. “The mountains are always dangerous – we just underestimate it because they look so peaceful,” Giovanoli shrugs. “But you’re never safe in the mountains. Not 100%.”", "description": "As Switzerland’s glaciers melt, dangerous rockfalls become more likely and towns are forced to live under an existential threat", "authors": ["Denise Hruin Bondo"], "top_image": "https://i.guim.co.uk/img/media/722fa017727dc187ffd65473a059413186b3c211/0_202_5464_3279/master/5464.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2ad79bce64e508bc1716e24f9bf6af66"}