{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7592199/Japan-living-dream-hosts-set-compete-Rugby-World-Cup-quarter-final.html", "downloaded_at": "2019-10-20 00:25:51.152972+00:00", "title": "Japan living the dream as hosts get set to compete in Rugby World Cup quarter final", "language": "en", "text": "On the office wall of the Japan Rugby Federation in Kita-Aoyama, there is a photograph of their now president, Shigetaka Mori, skipping around the then England captain Bill Beaumont.\n\nIt is from 1979, when the Brave Blossoms were a mere dot in the ocean on international rugby’s map.\n\nFour decades later, Tokyo is today the centre of the rugby universe when it hosts Japan’s World Cup quarter-final against South Africa. Beaumont is back in his role as World Rugby chairman, while Mori is on a mission.\n\nJapan have taken the rugby world by storm as hosts of the 2019 Rugby World Cup\n\nThe country were rugby minnows 40 years ago but will now compete in a quarter final\n\n‘Bill was in here recently and when I showed him this picture, he said it must be a fake!’ laughed Mori. ‘Back in 1979, did I imagine Japan hosting the World Cup? Did I imagine them reaching the quarter-finals? I would not have dreamed about it. It’s taken 40 years to get here but the effort has all been worth it.\n\n‘The world knows that we are strong and we are ready to challenge. We don’t want this last few weeks to be a once in a lifetime experience.’\n\nThe national team have become the darlings of the World Cup.\n\nBut their foundations are creaky, with tough questions asked about the schools’ system. The Sunwolves, are set to be kicked out of Super Rugby next year. Regular Tests against Tier One sides are few and far between.\n\nMori wants to reinstate the Sunwolves and has plans for the national team to join the annual tussle between the southern hemisphere’s top four teams.\n\nJapan have beaten Ireland and Scotland in Pool A on the road to Sunday's quarter-final\n\nThe hosts defeated opponents South Africa in the last World Cup and hope to do so again\n\n‘If I had it my way, we would join the Rugby Championship next year. We wish for the Sunwolves to continue in Super Rugby. That is our hope. The next World Cup is 2023 in France. To keep playing at a high level, we need to compete with Tier One teams constantly.\n\n‘Not just once a year. Next July, England will play two Test matches here, so that is a good start. The mood in Japan is that rugby here has a big future.’\n\nJapan have created stars who will step into a different life after the World Cup.\n\nThe Japanese have embraced the tournament and want to continue the journey\n\n‘This team is a reflection of modern, multi-cultural Japan,’ Mori said. ‘Michael Leitch, our captain, is a thoughtful man. It was his idea to give a sword to the opposition after every match.\n\n‘This is not just a present. It is a symbol of giving away your weapon. It is our way of saying, “The fight is finished”.\n\n‘This team has won a lot of fans. Our next mission is to maintain this interest.", "description": "On the office wall of the Japan Rugby Federation in Kita-Aoyama, there is a photograph of their now president, Shigetaka Mori, skipping around the then England captain Bill Beaumont.", "authors": ["Nik Simon For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/22/19937418-0-image-a-206_1571519262471.jpg", "published_at": "2019-10-19"}