{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/h-i-g-capital-acquires-an-office-complex-in-lyon", "downloaded_at": "2019-10-21 11:29:21.436708+00:00", "title": "H.I.G. Capital Acquires an Office Complex in Lyon", "language": "en", "text": "LONDON — H.I.G. Capital, LLC (“H.I.G.”), a leading global private equity investment firm with over $34 billion of equity capital under management, announced today that one of its affiliates has recently completed the acquisition of an office complex totaling approximately 29,000 sqm in Lyon, France’s second economic centre. The buildings are expected to be delivered in March 2021 and have already been 70% pre-let to an A rated French corporate tenant on a long-term basis. Terms were not disclosed.\n\nH.I.G. continues to add to its sizeable holdings of real estate assets across Europe, consisting of both equity as well as debt investments, with a particular focus on its target market of value-added small and midcap opportunities.\n\nRiccardo Dallolio, Managing Director and Head of H.I.G. Realty Partners Europe, commented: “Our focus in France is on high delivering quality assets with strong tenants that have the potential of becoming highly liquid institutional product as the result of the envisaged value-add initiatives.”\n\nMihai Gavriloiu, Principal at H.I.G. Europe Realty Partners in London, added: “France represents an important part of our European strategy and we continue to seek additional small and mid-cap, value-add, investment opportunities to increase H.I.G.´s presence in this market. Lyon, the second economic centre after Paris, currently has very strong growth prospects which will benefit this project.”\n\nAbout H.I.G. Capital\n\nH.I.G. is a leading global private equity and alternative assets investment firm with over $34 billion of equity capital under management.* Based in Miami, and with offices in New York, Boston, Chicago, Dallas, Los Angeles, San Francisco, and Atlanta in the U.S., as well as international affiliate offices in London, Hamburg, Madrid, Milan, Paris, Rio de Janeiro, São Paulo and Bogotá, H.I.G. specializes in providing both debt and equity capital to small and mid-sized companies, utilizing a flexible and operationally focused/value-added approach:\n\nH.I.G.’s equity funds invest in management buyouts, recapitalizations and corporate carve-outs of both profitable as well as underperforming manufacturing and service businesses. H.I.G.’s debt funds invest in senior, unitranche and junior debt financing to companies across the size spectrum, both on a primary (direct origination) basis, as well as in the secondary markets. H.I.G. is also a leading CLO manager, through its WhiteHorse family of vehicles, and manages a publicly traded BDC, WhiteHorse Finance. H.I.G.’s real estate funds invest in value-added properties, which can benefit from improved asset management practices.\n\nSince its founding in 1993, H.I.G. has invested in and managed more than 300 companies worldwide. The firm’s current portfolio includes more than 100 companies with combined sales in excess of $30 billion. For more information, please refer to the H.I.G. website at www.higcapital.com.\n\n* Based on total capital commitments managed by H.I.G. Capital and affiliates.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191021005335/en/\n\nContacts\n\nRiccardo Dallolio\n\nManaging Director\n\nrdallolio@higrealty.com\n\nP +44 (0) 207 318 5700\n\nwww.higcapital.com", "description": "LONDON — H.I.G. Capital, LLC (“H.I.G.”), a leading global private equity investment firm with over $34 billion of equity capital under management, announced today that one of its affiliates has recently completed the acquisition of an office complex totaling approximately 29,000 s...", "authors": [], "top_image": "https://mms.businesswire.com/media/20191021005335/en/750870/3/HIG_Europe_logo_RGB.jpg", "published_at": "2019-10-21"}