{"pub": "metro", "url": "https://metro.co.uk/2019/10/05/britains-got-talent-viewers-livid-clueless-superfans-twist-pulse-win-champions-10868855", "downloaded_at": "2019-10-05 22:58:46.477580+00:00", "title": "Britain’s Got Talent viewers livid at ‘clueless’ superfans after Twist And Pulse win", "language": "en", "text": "Did the right act win the show? (Picture: ITV)\n\nBritain’s Got Talent: The Champions crowned Twist And Pulse the winner in a spectacular final, but not everyone was entirely on board with the decision.\n\nThe dancing duo – made up of best friends Ashley Glazebrook and Glen Murphy – managed to win over some stiff competition in the likes of Stavros Flatley and sand artist Kseniya Simonova.\n\nThey weren’t the only highlights either, with Alexa Lauenburger and her dancing dogs proving a highlight, while Bello and Annaliese Nock provided another masterclass daredevil routine.\n\nUnlike the traditional Britain’s Got Talent show, the winner was decided by votes from superfans in the audience, instead of the viewing public.\n\nStavros Flatley lost out to Twist And Pulse (Picture: Dymond/Thames/Syco/REX)\n\nAs Twist And Pulse were announced as the winner, some viewers weren’t exactly supporting the superfans in their decision.\n\nKsenyia or Alexa should have won. Their talent was in another league. Superfans suck. #BGT — Kel🌈 (@Kel_elizabeth) October 5, 2019\n\nWhat a disappointment! Wanted the dancing dogs to win! 😭👎🏼 Well their my winners anyway!! 😍😍😍 🐶 #BGTChampions #BGT #BGTTheChampions — Carly Marie 👑 (@xcarly_mariex) October 5, 2019\n\nIf #BGTChampions was voted for by us viewers, then the finalists and the winner would of been different.\n\nSo so different! The whole thing was a bit of a disappointment for me tbh just my opinion! #BGTTheChampions #BGT — Vicki ⭐️ (@x__Vickii__x) October 5, 2019\n\nWho tf are these 'superfans'? They clearly arent superfans when they get it so wrong every time, should have been a public vote, they ruined the show #BGTTheChampions #BGT — Nameless (@8um8njdHg4SSaqc) October 5, 2019\n\nWhat an Absolute Joke !! ' Superfans ' aka a bunch of clueless social media teeny boppers. Doc Act and Sand Lady not to even … Clearly this just shows … Our Nation has lost any ability to make any sort of sane decision #BGTChampions#BGT — Sully (@Sulsters_inc) October 5, 2019\n\nWho are these super fans on @BGT the champions??!? Because the German girl with the dogs was the clear winner but didn’t even get in the top 3, but the sand woman did, this country in imploding 🙄#BGTChampions #BGTTheChampions #BGT — Normal Life ? 👾😷 (@NormalLife7) October 5, 2019\n\nAdvertisement\n\nAdvertisement\n\nThere were some happy citizens though.\n\nTwist and Pulse are hands down my favourite dance act on #BGT so glad they finally won! 💥 — Eleanor Prince (@ElJPrince) October 5, 2019\n\nSpeaking on the show after their win, Glen said: ‘I am absolutely speechless, I can’t thank you guys enough. I’m holding back everything right now!’\n\nAshley said: ‘Literally feel amazing. I’ve said it before, things like this don’t happen to me and my best friend Glen, so we’d just like to say thank you so much!\n\n‘This means the world to us, honestly.’\n\nBritain’s Got Talent: The Champions is available on ITV Player.\n\nMORE: When were Britain’s Got Talent: The Champions winners Twist and Pulse first on the show?\n\nMORE: Britain’s Got Talent’s Simon Cowell dancing to Stavros Flatley in Champions final is a total mood", "description": "Some viewers aren't happy with the superfan votes on the final of Britain's Got Talent: The Champions.", "authors": ["Adam Starkey"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/erwerwrwe-e16a_1570314440.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-05"}