{"pub": "washingtonpost", "url": "https://washingtonpost.com/crime-law/2019/09/17/officers-responded-wreck-they-found-drivers-wife-his-van-dead-weeks-police-say", "downloaded_at": "2019-09-17 23:23:54.115437+00:00", "title": "Officers responded to a wreck. They found the driver’s wife in his van, dead for weeks, police say.", "language": "en", "text": "\n\nCasei Jones of Summerfield, Fla., was found dead in her husband's van, where police say her body had been for weeks. Michael Wayne Jones, 38, is charged with second-degree murder in her death. The 32-year-old, along with her four children, had not been seen for six weeks when they were reported missing. The couple's four children were later found dead, as well. (Marion County, Fla., Sheriff's Office)\n\nPolice responding to a single-vehicle crash in Brantley County, Ga., on Sunday made the grisly discovery that the 38-year-old driver was hiding his wife’s body in the back of the van, just one day after relatives reported her and her four children missing in Florida. Detectives say 32-year-old Casei Jones of Summerfield, Fla., had been dead for several weeks.\n\n“Go ahead and arrest me, my wife’s body is in the back,” Michael Wayne Jones told the Georgia police officers at the crash scene, according to Sgt. Paul Bloom of the Marion County, Fla., Sheriff’s Office.\n\n[How Google Earth helped solve the mystery of a decades-old disappearance]\n\nAfter the crash, Jones led Georgia police to a nearby wooded area, where they found four more bodies. Police have yet to identify them officially, but based on crime scene evidence and interviews, they say they’re certain that the bodies are those of Casei Jones’s young children, two of whom she had with Jones: Cameron Bowers, 10; Preston Bowers, 5; Mercalli Jones, 2; and Aiyana Jones, 1.\n\nJones was arrested and charged with second-degree murder in his wife’s killing.\n\n\n\nMichael Wayne Jones of Summerfield, Fla., is charged with second-degree murder in the death of his wife, Casei Jones. (Marion County, Fla., Sheriff's Office)\n\nPolice say they think Jones killed his family about 170 miles away, in their Summerfield home. That’s where investigators said Jones probably kept their bodies for about three weeks before he put them in his van, where they remained for several weeks more.\n\nAt a Monday news conference, Marion County, Fla., Sheriff Billy Woods grew emotional at times and called the news both heartbreaking and infuriating.\n\n“All we need to know is that’s evil. And evil did something. And evil needs to pay for what he did,” Woods said in reference to Jones.\n\n[He’s suspected in four women’s deaths — and ‘would have killed again,’ sheriff says]\n\nThe discovery of the bodies is a grim conclusion to the weeks of worry by Jones’s family. According to a spokeswoman for the Marion County Sheriff’s Office, Casei Jones’s mother, Nikki Jones, told police she had not seen or heard from her daughter or her grandchildren in about six weeks and was concerned that Michael Jones had done something to his family.\n\n“The red flag, which for anybody that knew Casei, was when she didn’t post anything [to Facebook] for her son’s birthday,” Sarah Gilbert, Jones’s sister, told ABC 9 in Florida.\n\nRelatives reported Casei and the children missing Saturday, prompting Marion County sheriff’s deputies to visit the family’s home in Summerfield. There, the well-being check turned into a crime scene discovery: Police observed the home looked as if it had been vacant for “several weeks,” and once the landlord let them inside, they described smelling the “odor of decomposition.”\n\nThe search warrant for the home was being executed in Florida around the same time Jones was caught.\n\nThough the bodies of Casei Jones and her children have been found, Bloom said more questions remain; he notes Michael Jones had no previous record, and there had been no prior calls to the family home.\n\nThe slayings, meanwhile, have shocked the town.\n\n“Everyone in the community is trying to make sense of something that’s senseless,” Bloom said. He noted that one of the lead detectives in the sheriff’s department celebrates his 31st year on the job this week. That detective “said this is the worst he’s seen.”\n\nRead more:\n\nA man said his SUV randomly caught fire and killed his family. A decade later, he’s charged with murder.\n\nA college student was found dead. A classmate was arrested in her killing.\n\nBank accidentally puts $120,000 in couple’s account. They were arrested after spending it, police say.", "description": "After the crash, Jones led Georgia police to a nearby wooded area where they found four more bodies.", "authors": ["Kim Bellware", "Reporter Covering National Breaking News", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/jPgvPlZALLRfOS0i9G4QYkBbSJo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/G7IC6GGZNEI6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-17"}