{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nhl/2019/10/29/carolina-hurricanes-andrei-svechnikov-lacrosse-style-goal/2503803001", "downloaded_at": "2019-10-30 04:15:10.023170+00:00", "title": "Carolina Hurricanes forward Andrei Svechnikov scores lacrosse-style goal against Calgary Flames", "language": "en", "text": "USA TODAY\n\nThe NHL season isn't even a month old and we've already seen plenty of goal of the year candidates.\n\nFirst, Blake Coleman scored with a one-handed flick of the wrist during the New Jersey Devils' opener on Oct. 4. Then the Columbus Blue Jackets' Sonny Milano scored on a shot from between his own legs on the 16th. Six days later, the Boston Bruins' David Pastrnak upped the ante with a similar move while skating backward on the 22nd.\n\nBut Carolina Hurricanes forward Andrei Svechnikov topped them all with a ridiculous lacrosse-style goal Tuesday night during the third period of a 2-1 victory against the Calgary Flames.\n\nThe second-year player faked that he was going to circle behind the Flames' net, but stopped, cradled the puck on his stick and tucked it behind unsuspecting goalie David Rittich.\n\n\"I think (Svechnikov) was pretty shocked, too,\" Hurricanes defenseman Dougie Hamilton told reporters after the game. \"He was smiling and laughing for a couple minutes after that.\"\n\nThe goal tied the game, and Svechnikov scored a more traditional goal later in the period for the game-winner. He has four goals in his last two games.\n\nThe hockey world was already abuzz when Nils Hoglander scored a similar goal recently in Sweden. But Svechnikov, 19, wasn't imitating. He has practiced the move \"every day for the past two years,\" coach Rod Brind'Amour told reporters.\n\nStill, it takes great skill to pull off that move.\n\n\"I can't do it,\" Hamilton said. \"He was trying to teach me, but I have no chance.\"", "description": "Hurricanes forward Andrei Svechnikov cradles puck onto his stick, picks it up and tucks it past unsuspecting Flames goalie David Rittich.", "authors": [], "top_image": "https://www.gannett-cdn.com/presto/2019/10/30/USAT/077f2f06-b6c5-4cec-b3b5-69d411e36ad6-svechnikov_goal.JPG?crop=2989,1681,x377,y0&width=2078&height=1212&format=pjpg&auto=webp", "published_at": "2019-10-29"}