{"pub": "yahoo", "url": "https://sports.yahoo.com/charles-barkley-gets-skinny-version-130031664.html", "downloaded_at": "2019-09-15 00:21:06.725239+00:00", "title": "Charles Barkley gets skinny version of himself statue outside 76ers practice facility", "language": "en", "text": "Charles Barkley looks svelte again.\n\nIn a statue form, outside the 76ers practice facility.\n\nScroll to continue with content Ad\n\nThe 76ers unveiled a new statue of the “Round Mound of Rebound” from his Philadelphia days outside the Sixers practice facility, and Barkley likes how it looks.\n\nYou can see how pleased Chuck was with this sculpture by artist Chad Fisher pic.twitter.com/dPPzxDMEVz — Michael Lee (@MrMichaelLee) September 13, 2019\n\n\n\n\n\nCharles Barkley: \"I don't know if I've ever been that skinny.\" pic.twitter.com/quKGBXHefY — Michael Lee (@MrMichaelLee) September 13, 2019\n\n\n\n\n\nBarkley came into the league a little heavy and credited Moses Malone for setting him right.\n\nCharles Barkley took some time to acknowledge the late Moses Malone, whom he credits for having the greatest influence on his career. As a rookie, Chuck asked, “Why am I not getting to play?” Moses told him, “Because you’re fat and you’re lazy.” Then he helped him lose 50 lbs. — Michael Lee (@MrMichaelLee) September 13, 2019\n\n\n\n\n\nBarkley went on to a Hall of Fame career that included an MVP, 11 All-NBA nods, 11 All-Star teams, and a gold medal as part of the Dream Team in 1992. His best seasons came in that Sixers jersey, it’s fitting he has a statue outside the facility.", "description": "Charles Barkley looks svelte again — in statue form.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/mtNLTCFDMxxIxfV3QwV8BQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/85Lm1k34QQDz6a3XQ.eufw--~B/aD01MDQ7dz04OTY7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-US/homerun/nbcsports.com/78e63472f5135d61d94435186facdf0c", "published_at": "2019-09-14"}