{"pub": "townhall", "url": "https://finance.townhall.com/columnists/politicalcalculations/2019/10/10/us-recession-odds-peak-begin-to-recede-n2554505", "downloaded_at": "2019-10-10 18:24:59.341744+00:00", "title": "U.S. Recession Odds Peak, Begin To Recede", "language": "en", "text": "Based on recent changes in the trends for the U.S. Treasury yield curve and the level of the Federal Funds Rate, the probability the national U.S. economy will enter into recession sometime in the next twelve months appears to have peaked during the last month and has begun to recede.\n\nThat's tough to tell from the Recession Probability Track, which still shows an 11% probability the U.S. economy will enter into recession between 9 October 2019 and 9 October 2020, but that's due to our rounding the probability to the nearest whole percentage point. When we round the recession odds to one decimal point, we find the percentage probability peaked at 11.3% just before our last update three weeks ago, which has since declined to 10.5% as of 9 October 2019.\n\nThat's primarily due to the effect of the Fed's two quarter point reductions of the Federal Funds Rate since 31 July 2019, which is starting to have an effect on the recession odds that may be determined using the methodology laid out by the Federal Reserve Board's Jonathan Wright in a 2006 paper.\n\nMeanwhile, in the last several days, the Federal Reserve has all but thrown in the towel for resisting further interest rate cuts and has launched a new program of quantitative easing to buy large quantities of U.S. Treasury securities and mortgage-backed securities from government-supported enterprises like Fannie Mae and Freddie Mac to stimulate the economy, just like it did during the Great Recession, although Fed Chair Jerome Powell is working overtime to keep from calling it \"QE\". Perhaps the funniest thing we've read in some time on the topic of the Federal Reserve's monetary policies is Mark Orsley's article \"First Rule of QE Club, Don't Call It QE\" over at ZeroHedge - looks like Tyler Durden has a new catch phrase!\n\nOne important thing to remember at this point is what Wright's methodology is forecasting - the probability that the National Bureau of Economic Research will someday declare that a recession began sometime in the twelve month period from 9 October 2019 to 9 October 2020. Should the NBER ever make such a declaration, it could come as early as sometime in late 2020, or it could come sometime in 2021. To provide a frame of reference, in late March 2007, Wright's method forecast a peak 50% probability the NBER would someday declare the U.S. would enter recession sometime between April 2007 and April 2008. The NBER didn't make a public declaration of recession until December 2008, when they announced what would become known as the Great Recession had begun after the U.S. economy peaked in December 2007.\n\nNormally, when the Fed releases the minutes of its previous Open Market Committee meetings, we've featured an alternate scenario analysis that factors in the effects of what had been the Fed's previous policy of quantitative tightening, which would make the effective Federal Funds Rate much higher, boosting the odds of recession starting between September 2019 and October 2020 as high as 54.5%. Like the 'official' Wright odds of 11% (or a one-in-nine probability), that alternative estimated risk of recession has dipped fractionally in the six weeks since we estimated that probability, but would still round to about 54%.\n\nThe Recession Probability Track is based on Jonathan Wright's recession forecasting method using the level of the effective Federal Funds Rate and the spread between the yields of the 10-Year and 3-Month Constant Maturity U.S. Treasuries. If you would like to run your own recession probability scenarios, as we recently did after factoring in all the quantitative tightening the Fed achieved prior to its policy reversal in July 2019, please take advantage of our recession odds reckoning tool.\n\nIt's really easy. Plug in the most recent data available, or the data that would apply for a future scenario that you would like to consider, and compare the result you get in our tool with what we've shown in the most recent chart we've presented above.\n\nIf you would like to catch up on any of the analysis we've previously presented, here are all the links going back to when we restarted this series back in June 2017.", "description": "Based on recent changes in the trends for the U.S. .10/10/2019 14:22:39PM EST.", "authors": ["Political", "Bronson Stocking", "Cortney O'Brien", "Guy Benson", "Katie Pavlich", "Julio Rosas"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/235/bb2d0f2f-5b32-434f-903e-a6f0867db76d.jpg", "published_at": "2019-10-10"}