{"pub": "abcnews", "url": "https://abcnews.go.com/International/harry-potter-author-jk-rowling-donates-20-million/story?id=65557713", "downloaded_at": "2019-09-12 11:37:42.069090+00:00", "title": "Harry Potter author JK Rowling donates $20 million to neurology research", "language": "en", "text": "J.K. Rowling, the author of the Harry Potter series, has donated almost $20 million (£15.3m) to support research into neurological conditions in honor of her late mother.\n\nThe latest philanthropic act from the woman behind the fantasy empire will help create new facilities and support research at the University of Edinburgh's Anne Rowling Regenerative Neurology Clinic, seeking to improve the lives of people with multiple sclerosis (MS) and similar conditions.\n\nThe research center was set up following an earlier $12 million (£10m) donation from the author in 2010, and is named in memory of her mother Anne, who died of MS at age 45.\n\nThe facility studies neurological conditions including multiple sclerosis, motor neurone disease (MND), Parkinson’s and dementia, and aims to support sufferers of degenerative illnesses affecting the brain.\n\nWalter McBride/WireImage via Getty Images, FILE\n\n\"When the Anne Rowling Clinic was first founded, none of us could have predicted the incredible progress that would be made in the field of Regenerative Neurology, with the Clinic leading the charge,\" Rowling said. \"I am delighted to now support the Anne Rowling Regenerative Neurology Clinic into a new phase of discovery and achievement, as it realizes its ambition to create a legacy of better outcomes for generations of people with MS and non-MS neurodegenerative diseases.\"\n\nThe author said in a statement that the center's efforts are \"a matter of great pride\" for her while staff expressed their gratitude for her \"incredibly far-sighted and generous donation\" which will \"unlock the potential of personalized medicine for people with MS in Scotland and further afield,\" according to Professor Siddharthan Chandran, the director of the research hub.\n\n\"This inspiring donation will fund a whole new generation of researchers who are focused on discovering and delivering better treatments and therapies for patients,\" University of Edinburgh Principal and Vice Chancellor, Professor Peter Mathieson, said: \"We are immensely honored that J.K. Rowling has chosen to continue her support for the Anne Rowling Regenerative Neurology Clinic.\"\n\nJ.K. Rowling is one of the best selling authors in the world, and has accumulated a net worth of $924 million (£750m), according to The Sunday Times Rich List.\n\nThe much-loved Harry Potter series has sold more than 500 million books worldwide and has been translated into over 80 different languages.", "description": "J.K. Rowling, the author of the Harry Potter series, has donated almost $20 million (£15.3m) to support research into neurological conditions in honor of her late mother.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/j-k-rowling-gty-ml-181108_hpMain_16x9_992.jpg", "published_at": "2019-09-12"}