{"pub": "fox", "url": "https://foxnews.com/politics/biden-slams-trump-says-president-becoming-more-erratic-on-economy", "downloaded_at": "2019-09-07 02:24:46.201026+00:00", "title": "Biden slams Trump in NH, claims economy is 'teetering on a recession'", "language": "en", "text": "Former Vice President Joe Biden spoke of a need to reauthorize the 25-year old ‘Violence Against Women Act’ and took aim at the man he hopes to replace in the White House for “demeaning women,” as he kicked off a weekend campaign swing in New Hampshire on Friday.\n\nBiden, the frontrunner in the Democratic presidential nomination, argued that President Trump is becoming “more erratic” in dealing with “an economy that’s teetering on a recession.”\n\nAXELROD CLAIMS BIDEN 'SERIALLY DISTORTING' RECORD\n\nBiden said “the president is feeling pressure on the economy. ... He inherited a pretty good economy from Barack Obama, just like he inherited everything in his life.”\n\nThe line received loud applause from the standing-room-only audience in a Laconia mill building. Biden repeated a variation of the line at his second town hall, held in New Castle, on the state's short Atlantic coast.\n\nBiden devoted a good portion of his stump speech at both events to violence against women. He said his drafting of the Violence Against Women Act of 1994 and his push to pass the legislation amounted to the “proudest moment” of his career.\n\n“This act must be reauthorized. It has fundamentally altered the prospects and lives of so many women in America,” he said.\n\nThe law, which beefed up the investigation and prosecution of violent crimes against women and established an ‘Office on Violence Against Women’ within the Justice Department, is up for a fourth reauthorization this year.\n\nBiden highlighted what he called a need to “fundamentally change the culture in America” when it comes to violence against women.\n\n“No means no means no, no matter when no is uttered,” said Biden, who added that the culture still has to change, especially under a president who “grabs any woman anywhere he wants ... demeaning women the way he describes them and talks about them.”\n\nSome two dozen women have accused Trump of sexual misconduct dating back to his 2016 presidential campaign. The president has repeatedly denied the allegations.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nBiden’s well known for an affectionate brand of physical politics, was thrust into the spotlight in the early spring, thanks to allegations from 2014 Nevada Democratic lieutenant governor nominee Lucy Flores, who said the then-vice president made her feel \"uneasy, gross and confused\" at a campaign rally when she said he kissed her on the back of the head.\n\nNumerous other women came forward to claim they'd had similar, unsettling physical encounters with Biden.", "description": "Biden said Friday that Trump \"inherited a pretty good economy from Barack Obama, just like he inherited everything in his life.”", "authors": ["Paul Steinhauser", "Paul Steinhauser Is A Politics Reporter Based In New Hampshire."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/JoeBiden-Laconia-Sept2019.jpg", "published_at": "2019-09-06"}