{"pub": "townhall", "url": "https://finance.townhall.com/columnists/michaelpento/2019/10/08/gold-its-all-about-real-rates-not-the-dollar-n2554363", "downloaded_at": "2019-10-09 00:32:40.609622+00:00", "title": "Gold: It’s All About Real Rates, Not The Dollar", "language": "en", "text": "The Federal Reserve’s recent need to supply $100’s of billions in new credit for the overnight repo market underscores the condition of dollar scarcity in the global financial system. This dearth of dollars and its concomitant strength has left most market watchers baffled.\n\nSince 2008, the Fed has printed $3.8 trillion (with a “T”) of new dollars in an effort to weaken the currency and boost asset prices--one would then think the world should now be awash in dollar liquidity. Yet, surprisingly, there is still an insatiable demand for the greenback, leading many to wonder what is causing its strength. And importantly for precious metals investors, there is a need to understand why this dreaded dollar strength has not served to undermine the bull market for gold.\n\nThe primary drivers for dollar strength are growth and interest rate differentials. The Federal Reserve was able to raise overnight lending rates to nearly 2.5% and end its QE program, before its recent retreat from a hawkish monetary policy to one that is more dovish. The Fed Funds Rate now stands at 1.75-2.0%. However, the ECB and BOJ both have negative deposit rates and are currently engaged in QE. Not only this, but the extra income investors can receive owning a US 10-year Treasury Note compared to those of Japan and Germany are 175bps and 200 bps, respectively. In addition, year over year GDP growth in the EU was just 1.4% in Q2 of 2019; and Japan’s growth registered a paltry 1.0%. Growth in the US was 2.3% y/y. While that is not earth-an shattering rate of growth, it is still better than our major trading partners.\n\nWith sub-par growth and little hope for improvement on the horizon, the ECB and BOJ have decided to continue with ZIRP and QE in a futile attempt to spur growth. Nevertheless, their economies are still stagnating.\n\nThe US central bank is now being forced to lower rates once again. This is primarily due to the strengthening dollar that is hurting foreign holders of USD-denominated debt--of which there are a lot.\n\nThe BIS estimates that foreign USD-based debt now exceeds $11.5 trillion.\n\nA rising US dollar puts further stress on these dollar-based foreign loans and makes them harder to service. In effect, this creates a squeeze on dollar shorts. When you add in the Fed’s burning of nearly $800 billion worth of base money during its Quantitative Tightening (QT) Program, you can clearly see the reasons for dollar strength.\n\nBut those who believed the US dollar would increase its buying power against gold have been dead wrong. This is because the primary driver behind the dollar price of gold is the direction of real interest rates.\n\nTherefore, it is imperative not to measure the US dollar’s real strength by measuring it against other flawed fiat currencies that are backed by even more reckless central banks. Instead, the genuine value of the dollar should be weighed against real money…gold.\n\nConventional wisdom would tell you that the dollar and gold have a reciprocal relationship. When the dollar decreases in value, gold increases and vice versa. However, recently, the dollar and gold have both been strengthening in tandem. Just look at a chart of the dollar index vs the GLD.\n\nAgain, the primary driver of gold isn’t the direction of the dollar but the direction of real interest rates. Hence, if US growth is accelerating in a non-inflationary environment, gold should suffer regardless of the direction of the US dollar. Conversely, the USD dollar can be in a bull market against a basket of fiat currencies—as it has been for the past year—and yet can still lose significant ground against gold as long as nominal interest rates are falling in an environment of rising inflation.\n\nThe year-over-year change in core CPI increased 2.4% in August, which was the highest level in a year. All the while the US 10-year Note yield was crashing from nearly 3% to 1.6% over the past 12 months. Therefore, real yields have been crashing as gold has been rising.\n\nThese falling real yields were rocket fuel for gold, and this was in spite of the USD’s bull market against the euro and yen. The price of gold increased by double digits even though the Dollar Index has also increased by nearly 5% in the last 12 months. But still, for those of us who love gold it can be a love/hate relationship. It is still down 20% from the highs made in 2011, and the mining shares have crashed by 60%; underscoring the need to know how to trade the cycles of this sector.\n\nThe questions for gold investors now are: have nominal yields stopped dropping and what is the direction for the rate of inflation? In the short-run, the answer to that question can be found in the trade talks scheduled for October 10th and 11th. The reason for this is, the boy has cried wolf once too often, and it is now time to poop or get off the pot when it comes to reaching an agreement with China on trade. And yes, that boy is Donald Trump. Wall Street and international corporations cannot do business under this cloud of uncertainty any longer; where one day tariffs go up, and the next day they are coming down.\n\nSince early 2017, investors and the C suite have dealt with a perpetual series of dizzying trade war escalations and treaties. Just this September alone, Trump raised duties on China on the1st of the month. Then on the 11th he announced a list of exemptions to those very same tariffs. Then, on the 25th he attacked China viciously at his UN speech, saying: “\"For decades the international trading system has been easily exploited by nations acting in very bad faith. Not only has China declined to adopt promised reforms, it has embraced an economic model dependent on massive market barriers, heavy state subsidies, currency manipulation, product dumping, forced technology transfers and the theft of intellectual property and also trade secrets on a grand scale,\"\n\nThe very next day, Trump said that a deal with China could come \"much sooner than most think.\" Then, on September 27th, Bloomberg reported that the White House threatened to ban the listing of Chinese companies on US exchanges. Businesses simply cannot adequately plan capital expenditures under such unstable circumstances.\n\nThe US and China meet on October 10th &11th to decide the future of trade between the two nations. Tariffs are set to increase on Oct.15th on $250 billion worth of Chinese goods to 30%, from the current 25%. There is no appetite on Wall Street for the continued ambiguity of this trade war any longer. Therefore, on October the 11th, I expect President Trump to announce the most wonderful trade deal in history has occurred since we purchased Manhattan from the Indians. Such an announcement should provide a temporary boost in the major averages and could also cause a sharp selloff in gold. This is because such a deal should put a temporary hold on the Fed’s rate-cutting cycle.\n\nThe Fed’s broken models have caused it to fail to grasp the debt-disabled condition of the developed world. China can no longer boost global GDP because it cannot significantly add to its $40 trillion debt pile without cratering the yuan. Also, fiscal and monetary policies are already extremely stretched and are unable to easily pull the economy out of its malaise.\n\nGlobal growth is faltering, and US GDP growth has shrunk from over 4% last year, to under 2% in Q3, according to the Atlanta Fed. The most important part of the yield curve remains inverted. There is illiquidity in the Repo market. D.C. is in utter turmoil and annual deficits have vaulted over the trillion dollar mark. The Q3 earnings report card is about to arrive, and it will receive an “F.” And global central banks are virtually out of ammo. Meanwhile, the stock market sits at all-time record high valuations.\n\nThe pressure on Mr. Trump is now immense. A trade deal must be reached in a matter of days that abrogates future tariffs and rescinds most, if not all, existing duties on China. Any other type of agreement will not be nearly enough to turn the global economy around or fool Wall Street any longer into thinking that it will.\n\nThe sad truth is, even a comprehensive trade deal won’t fix the massive debt and asset bubble imbalances that must inevitably implode. Which means, real interest rates should be setting record lows in the near future.\n\nMichael Pento is the President and Founder of Pento Portfolio Strategies, produces the weekly podcast called, “The Mid-week Reality Check” and Author of the book “The Coming Bond Market Collapse.”", "description": "The Federal Reserve’s recent need to supply $100’s of billions .10/08/2019 20:30:55PM EST.", "authors": ["Michael Pento", "Matt Vespa", "Beth Baumann", "Cortney O'Brien"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2014/205/d123f47c-2997-4b9a-982c-3bc15800a817.jpg", "published_at": "2019-10-08"}