{"pub": "wsj", "url": "https://wsj.com/articles/how-to-keep-your-mobile-banking-safe-11569204421?mod=rsswn", "downloaded_at": "2019-09-23 07:31:37.794120+00:00", "title": "How to Keep Your Mobile Banking Safe", "language": "en", "text": "As people increasingly do their banking on mobile devices, concerns about digital security have come to the forefront.\n\nWhile many security issues are in the hands of your bank, experts say there are several measures you can take on your own to keep things safe.\n\nHere are some tips to help ensure your mobile banking is as secure as possible.\n\nEnable multifactor authentication\n\nPhoto: Greg Mably\n\nTwo-factor or multifactor authentication ensures that no one can gain access to your account with just your password. Often the second level of authentication is a code that is sent to your phone. It’s a quick and easy way to help protect your banking information from being hacked.\n\nBut even authentication codes sent via text message aren’t entirely secure, as hackers can gain control of your phone through a so-called SIM swap—in which they convince your wireless carrier to transfer your phone number to a new SIM card—meaning they’ll receive the codes and can use them to access your account if they’ve also managed to steal your password, says Arvind Narayanan, an associate professor of computer science at Princeton University whose research focuses on information privacy and security.\n\n“Instead,” Dr. Narayanan says, “using an authenticator app is a more secure second factor.” These apps generate a code, which changes regularly, that can be used to unlock your accounts. Since the codes only appear on your device, they can’t be stolen in a SIM swap.\n\nApply software updates promptly\n\nIt might seem onerous, but it’s a good idea to update your phone, as well as any banking apps you might use, so you aren’t leaving yourself vulnerable to malware that could steal your information. It often isn’t clear what exactly you are protecting yourself against when you update your software, says Will LaSala, director of security solutions at OneSpan , a cybersecurity company. But that’s because the software providers don’t want to reveal the software’s vulnerabilities, he says. So, you should make all updates as they become available, even if you aren’t sure why they’re needed.\n\nCheck your app’s permissions\n\nPhoto: Greg Mably\n\nWhen you install a new app, it’s tempting to allow it to access whatever it asks permission for, just so you don’t have to think about it. But you should be wary of doing that, particularly for banking apps, as hackers can exploit those permissions to gain access to your personal information.\n\nOnly install apps from official channels\n\nYou shouldn’t download banking apps—or any apps, for that matter—if you come across them in a third-party app store, where bogus versions of official apps are “rampant,” says Michael Covington, vice president of product strategy at Wandera, which develops mobile security solutions. Mr. Covington adds that you should be careful not to be fooled into installing any extras, such as developer certificates or profiles, which could allow developers to inspect your internet traffic or install other apps on your device.\n\nBanking App Acceptance Top Reasons for Not Mobile Banking, by Generation How They Are Used Consumers who use mobile-banking apps like them for different things, with some performing only a couple of tasks. In percent of U.S. adults with a bank account and a mobile phone: Concerns about security were foremost in the minds of respondents to a 2016 international survey who said they weren't likely to use mobile-banking services. General user Generation Z (ages 15-20) Task-only user* Millennials (21-34) Generation X (35-49) Check balance or transactions Baby boomers (50-64) Silent generation (65+) Receive alerts I'm concerned about security Locate ATM or branch I prefer to visit a physical location/bank Transfer money between accounts Pay bills I don't need it Deposit a check electronically Screen too small Send money to relatives or friends in the U.S. 0% 10 20 30 40 50 60 0% 5 10 15 20 25 30 35 40 Top Reasons for Not Mobile Banking, by Generation How They Are Used Consumers who use mobile-banking apps like them for different things, with some performing only a couple of tasks. In percent of U.S. adults with a bank account and a mobile phone: Concerns about security were foremost in the minds of respondents to a 2016 international survey who said they weren't likely to use mobile-banking services. General user Generation Z (ages 15-20) Task-only user* Millennials (21-34) Generation X (35-49) Check balance or transactions Baby boomers (50-64) Silent generation (65+) Receive alerts I'm concerned about security Locate ATM or branch I prefer to visit a physical location/bank Transfer money between accounts Pay bills I don't need it Deposit a check electronically Screen too small Send money to relatives or friends in the U.S. 0% 5 10 15 20 25 30 35 40 10 20 30 40 50 60 0% Top Reasons for Not Mobile Banking, by Generation How They Are Used Consumers who use mobile-banking apps like them for different things, with some performing only a couple of tasks. In percent of U.S. adults with a bank account and a mobile phone: Concerns about security were foremost in the minds of respondents to a 2016 international survey who said they weren't likely to use mobile-banking services. General user Generation Z (ages 15-20) Task-only user* Millennials (21-34) Generation X (35-49) Check balance or transactions Baby boomers (50-64) Silent generation (65+) Receive alerts I'm concerned about security Locate ATM or branch I prefer to visit a physical location/bank Transfer money between accounts Pay bills I don't need it Deposit a check electronically Screen too small Send money to relatives or friends in the U.S. 0% 5 10 15 20 25 30 35 40 0% 10 20 30 40 50 60 How They Are Used Consumers who use mobile-banking apps like them for different things, with some performing only a couple of tasks. In percent of U.S. adults with a bank account and a mobile phone: General user Task-only user* Check balance or transactions Receive alerts Locate ATM or branch Transfer money between accounts Pay bills Deposit a check electronically Send money to relatives or friends in the U.S. 0% 5 10 15 20 25 30 35 40 Top Reasons for Not Mobile Banking, by Generation Concerns about security were foremost in the minds of respondents to a 2016 international survey who said they weren't likely to use mobile-banking services. Generation Z (ages 15-20) Millennials (21-34) Generation X (35-49) Baby boomers (50-64) Silent generation (65+) I'm concerned about security I prefer to visit a physical location/bank I don't need it Screen too small 0% 10 20 30 40 50 60\n\nCheck your bank’s website\n\nThough you may do most of your banking on your app, it’s also a good idea to log in to your bank’s website on occasion, according to Mr. Covington. Doing so typically will let you see the last several logins to your account, so you can see if there has been any unauthorized activity. Also, he says, “many banks are now identifying known attacks against mobile users in the fraud section of their web portals,” information that you can use to remain vigilant against the latest methods being used by hackers.\n\nDon’t use public wireless networks\n\nTry to avoid logging in to any banking apps over public Wi-Fi, where hackers can easily dangle rogue wireless networks that can gain access to your traffic. It’s always a safer choice to use your device’s cellular data, says Brian Reed, chief marketing officer at NowSecure, a mobile-app security company, as it is “incredibly difficult” to steal data over a cellular connection.\n\nShare Your Thoughts What would you like to see from your wireless banking experience? Join the conversation below.\n\n“When in doubt, stay connected to the cell tower,” he says. If you choose to use a mobile hotspot instead, he adds, use a VPN, or virtual private network, so you can encrypt your traffic.\n\nSee that your financial apps adhere to regulatory standards\n\nBe careful which apps you use to keep track of your finances, says Mr. Reed. While there are a number of apps aside from your main banking app that can help manage your expenses and keep an eye on your personal finances, they may not have the same reporting requirements that commercial banks do. So you should only go with credible companies—and take the same security measures that you would with your main banking app.\n\nThe same goes for mobile payment apps, he says. Venmo, for instance, is federally regulated, as it says on its website. In general, Mr. Reed says, you should look to popular, well-known brands, and apps with four- and five-star reviews that also have thousands of reviewers. If you see an app with only a few dozen reviews that does the same thing as an app with, say, 100,000 reviews, opt for the app with more reviews, he says.\n\nUse a password manager\n\nPhoto: Greg Mably\n\nIt’s a good idea to use a different password for every website you patronize. If you aren’t willing to do that, you should at least use a long, complex password for your banking app that is different from every other password you have. This will help ensure that if your other passwords are compromised, hackers won’t be able to use them to access your account. To keep track of everything, you would do well to use a password manager, says Jeremy Gillula, tech projects editor at the Electronic Frontier Foundation, which advocates for digital privacy.\n\nSuch managers store your passwords directly on your device or in encrypted form in the cloud, making them difficult to hack. If you want to take your digital security one step further, Mr. Gillula says, you can use the password manager to make up random password-recovery questions—which you can also write out on a piece of paper, stored in a secure location, should you have any concerns that the password manager won’t work when you need it to.\n\nMr. Kassel is a writer in New York. He can be reached at reports@wsj.com.", "description": "A lot of it depends on your bank, but there are things customers can do as well.", "authors": ["Matthew Kassel", "Tomio Geron", "Lucy Harley-Mckeown", "Mischa Frankl-Duval", "Maitane Sardon", "Kimberly Chin"], "top_image": "https://si.wsj.net/public/resources/images/JR-AA230_FISECU_SOC_20190920195945.jpg", "published_at": "2019-09-23"}