{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/oct/19/jennifer-aniston-the-one-where-she-breaks-the-internet", "downloaded_at": "2019-10-19 15:12:37.958209+00:00", "title": "Jennifer Aniston: The One Where She Breaks the Internet | Rebecca Nicholson", "language": "en", "text": "If Instagram were a TV series, then it is in the middle of one of those season highlights that you know everyone will be talking about the next day. It’s the explosion episode of Bodyguard, Game of Thrones’s Red Wedding, any season finale of Succession.\n\nAfter the previous week gave birth to the thriller of the year, the Rooney/Vardy you-dunnit, last week provided another blockbuster moment. Jennifer Aniston signed up, posted a selfie with fellow Friends cast members and promptly broke the internet, without so much as a champagne glass poised perilously on a gravity-defying backside.\n\n“We are aware that some people were having issues following Jen’s profile,” an Instagram representative told CNN. Even so, she set a Guinness world record for accruing one million followers – it took her five hours and 16 minutes – which meant she beat the previous record set by @sussexroyal. During an interview with Jimmy Kimmel, she called herself “the most reluctant person to ever join Instagram”.\n\nAniston was one of the few A-listers holding out against having a social media presence. Part of me wishes that such reluctance, which has already gained her 13 million followers, was more commonplace. I like watching films, for example, without being tempted to think about what the lead actor’s gym routine looks like. But the former enigmatic distance of the Hollywood elite has long since been replaced with a cutesy, curated-candour, direct-to-fans approach. Aniston’s bio line is “My friends call me Jen”. The Friends pic has a caption that resembled my parents’ liberal approach to caps lock, “And now we’re Instagram FRIENDS too. HI INSTAGRAM”, followed by the waving emoji.\n\nIf anyone deserves a platform from which they can speak directly to the public, it’s Aniston, who has been the subject of tabloid speculation about her life and womb for decades. She was moved to write about this in a 2016 piece for the Huffington Post, declaring, finally, that she was “fed up” and criticising “how much we define a woman’s value based on her marital and maternal status”.\n\nSo far, she has posted only gentle pictures and a video, dipping a toe into the muddy waters of the internet, but should she find herself fed up once again, she won’t need to write much more than an Instagram caption, alongside a knowing Smelly Cat meme, to address it. Or perhaps, like everyone else, Aniston simply wanted to know which mystery Colleen was going to solve next.\n\nPaul Dano: it’s no laughing matter for this edgy Riddler\n\nI already love The Batman, with its take-me-seriously definite article. I bet that, as Bruce Wayne, Robert Pattinson will wear wire-framed glasses. He will drink his coffee black. His Batmobile will almost certainly have a top-notch stereo, just so he can make out every word of the latest album by the National.\n\nLast week, there were two big casting announcements for Matt Reeves’s take on the least super superhero. After talks with Jonah Hill collapsed, Paul Dano will now play the Riddler, while Zoë Kravitz will take on Catwoman.\n\nBoth new recruits continue to push the idea that this will be an edgier Batman, particularly Dano, who is one of those actors who seems to menace the screen as soon as he appears. Though Joker has left me wary of taking the fun out of films in this genre (really, can we not just do a few gags, some big explosions and be done with it?), I’m all for a cast that would be right at home in a Sundance grand jury prize winner.\n\nHowever, there is talk of a new “gritty” version of Clueless, too. Another TV series is in development (with respect to the Rachel Blanchard 1996 sitcom) and an unofficial description frames it as “a baby pink and bisexual blue-tinted, tiny sunglasses-wearing, oat milk latte and Adderall-fuelled look at what happens when the high-school queen bee, Cher (played in the 1995 film by Alicia Silverstone), disappears and her lifelong No 2 steps into Cher’s vacant Air Jordans”.\n\nEdgy up my Batman, sure, but if the life-affirming silliness of Clueless goes over to the dark side, I will, as Cher says, be buggin’.\n\nTed Bundy: still causing serial offence\n\nFacebook Twitter Pinterest Ted Bundy: TV’s obsession with him goes unchecked. Photograph: Really/UKTV\n\nThere are a handful of phrases that will instantly put me off a show before I’ve even seen it – “David Walliams judges”, “8pm sitcom”, “faithful reenactment” – but few descriptions repel as much as “another Ted Bundy documentary”. The serial killer who commissioners just can’t seem to stop loving will be the subject of another examination, this time in the form of a five-part Amazon Prime documentary, Ted Bundy: Falling For a Killer.\n\nThe series follows the film Extremely Wicked, Shockingly Evil and Vile, which cast hunky Zac Efron as the murderer and rapist, and then did some moral contortions as to the purpose of its existence, settling on an unconvincing defence of “this is for the victims”. Netflix’s series Conversations With a Killer: The Ted Bundy Tapes elicited such a confused reaction from its viewers that its unsettlingly sentient Twitter presence told them off: “I’ve seen a lot of talk about Ted Bundy’s alleged hotness and would like to gently remind everyone that there are literally THOUSANDS of hot men on the service – almost all of whom are not convicted serial murderers.”\n\nEven a multibillion-dollar corporation referring to itself as “I” is not as offensive as this ongoing obsession with Bundy.\n\n• Rebecca Nicholson is an Observer columnist", "description": "Friends? She’s got a few, thanks to her presence now on Instragram", "authors": ["Rebecca Nicholson"], "top_image": "https://i.guim.co.uk/img/media/2b0866083b560669f8c31b2bdc3166d7dfc765bf/0_203_3936_2361/master/3936.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tb3BpbmlvbnMucG5n&enable=upscale&s=4c3fc7771698e56760d1c51f22d319e3", "published_at": "2019-10-19"}