{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201910237026/boeing-to-cut-787-production-as-earnings-take-a-hit-update", "downloaded_at": "2019-10-23 14:59:40.980426+00:00", "title": "Boeing to Cut 787 Production as Earnings Take a Hit — Update", "language": "en", "text": "By Doug Cameron\n\nBoeing Co. said its profits more than halved in the latest quarter and plans to cut production of its 787 Dreamliner jet next year, but still expects the 737 MAX to return to service by the end of the year.\n\nThe company said slowed production of the MAX will cost an additional $900 million on top of the $2.7 billion already booked over the life of the program, though it plans to maintain monthly output of the 737 range at 42, rising to 57 by the end of next year.\n\nThe update quelled concerns that Boeing would be forced to freeze MAX production, though it still has to secure approval from regulators and most operators don't expect the plane to resume service until early next year.\n\nIts shares rose in premarket trading after sharp falls in recent sessions.\n\nThe MAX crisis has made Boeing more reliant on its larger jets and defense sales, and the decision to reduce output of the 787 reflects the impact of trade tensions between the U.S. and China, the company's largest market.\n\nTrade tensions and tariffs have this year slowed the growth in passengers that's underpinned huge jet orders for Boeing and Airbus SE over the past decade.\n\nBoeing earlier this year boosted monthly output of the Dreamliner to 14 from 12, but will reverse that in 2020 for two years.\n\nChief Executive Dennis Muilenburg, who's been stripped of his chairman role because of the MAX crisis, last month warned China tensions could hit its wide-body business as it had assumed fresh orders from the country's airlines that have yet to materialize.\n\nBoeing also has pushed back the planned entry into service of its larger 777X jetliner into 2021 after problems with its General Electric Co. engines ruled out a planned first flight this year.\n\nBoeing on Tuesday ousted the head of its commercial airplanes unit, the first executive to lose his job over the MAX crisis.\n\nThe moves came as Boeing reported a sharp drop in quarterly earnings, with profits falling to $1.17 billion from $2.63 billion. Per-share earnings dropped to $2.05 from $4.07 -- ahead of the $1.92 consensus among analysts polled by FactSet.\n\nSales fell 21% to $20 billion. Boeing handed over just 63 jetliners in the September quarter compared with 190 in the same period last year, with analysts estimating it is piled up around 350 undelivered MAX jets, as well as the 380 grounded in March.\n\nThe company also announced steps to manage its liquidity after burning through $2.4 billion in cash over the past three months, on top of the $1 billion drained in the prior quarter.\n\nCredit-rating firms have put Boeing on watch for a potential downgrade because of its weakening liquidity.\n\nBoeing has already set aside an initial $5.6 billion to cover compensation payments to MAX customers, and reached deals with some carriers. As well as cash payments, Boeing is also offering discounts on future sales, delivery positions and services.\n\nIt hasn't suffered any cancellations because of the MAX crisis, but slowing traffic growth and airline failures have dented orders this year.\n\nBoeing boosted its liquidity to $10.9 billion at the end of the quarter after tapping the debt markets. The $2.4 billion cash drain in the quarter was much worse than analysts expected, with airlines withholding payments on jets and suppliers securing better payment terms. Boeing said its debt levels are 'manageable.'\n\nWrite to Doug Cameron at doug.cameron@wsj.com\n\n(END) Dow Jones Newswires\n\nOctober 23, 2019 08:48 ET (12:48 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-23"}