{"pub": "bbc", "title": "Trade war: US hits China with new wave of tariffs", "url": "https://bbc.com/news/business-49505781", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-02 09:28:05.690384+00:00", "text": "Image copyright Getty Images\n\nThe US has imposed fresh tariffs on $112bn (£92bn) of Chinese imports such as shoes, nappies and food.\n\nThe new tariffs are a sharp escalation in the bruising trade war, and could cost households $800 a year.\n\nThe move is the first phase of US President Donald Trump's latest plan to place 15% duties on $300bn of Chinese imports by the end of the year.\n\nIn response, Beijing began to introduce measures targeting $75bn worth of US goods.\n\nThe measures included a 5% tariff on US crude oil, the first time fuel has been hit in the trade battle between the world's two largest economies.\n\nWhat was initially a dispute over China's allegedly unfair trade practices is increasingly seen as a geopolitical power struggle.\n\nSo far, Washington has imposed tariffs on hundreds of billions of dollars worth of Chinese goods to pressure Beijing into changing its policies on intellectual property, industrial subsidies, market access, and the forced transfers of technology to Chinese firms.\n\nBeijing has consistently denied that it engages in unfair trade practices, and has retaliated with tariffs on a wide range of US products.\n\nHow do they differ from previous tariffs?\n\nKatie Prescott, BBC Business Reporter\n\nIt's the American consumer who will bear the brunt of these fresh tariffs, unlike previous rounds which have hit the manufacturing sector hardest.\n\nNappies, dishwashers, shoes, clothes, food - looking through the 122-page list of eligible products, it's hard to find something that's not on there.\n\nMany retailers say they have little choice but to pass on the cost to shoppers.\n\nThe president of the American Apparel and Footwear Association, Rick Helfenbein, describes the tariffs as like \"punishing your daughter for something your son did. It makes no sense\".\n\nThe next round of tariffs on more clothes and big-ticket items like laptops and iPhones are due in December. Mr Trump says this will help to protect spending during the Christmas season.\n\nBy the end of the year, they'll be in place on almost all goods that the US buys every year from China.\n\nAnd that could add up to $800 to the average household's annual spend, according to Katheryn Russ from the University of California.\n\nHow has industry reacted?\n\nBusinesses are finding it increasingly hard to navigate the uncertainty of the long-running trade dispute.\n\nAnalysts say that in view of the latest escalation, the prospect of a resolution looks grim.\n\n\"It's difficult at this stage to see how there can be a deal or at least a good deal,\" Julian Evans-Pritchard, a senior China economist at Capital Economics, told the BBC.\n\n\"Since talks broke down back in May, the position of both sides has hardened and there have been other complications, namely the Huawei ban and Hong Kong protests, which have made it even more difficult to bridge the gap.\"\n\nThe US government put Huawei on a trade blacklist in May, while Mr Trump has tied protests in Hong Kong to a possible trade deal with China.\n\nIf fully imposed, Mr Trump's programme would mean that nearly all Chinese imports - worth about $550bn - would be subject to punitive tariffs.\n\nWho pays for tariffs?\n\nMr Trump has repeatedly argued that China pays for tariffs, but many US companies have rebutted that claim.\n\nMore than 200 footwear firms - including Nike and Converse - said the new duties would add to existing tariffs of up to 67% on some shoes, driving up costs for consumers by $4bn each year.\n\nThey said the incoming tariffs on footwear would \"also mean these massive tax increases hit tens of millions of Americans when they purchase shoes during the holiday season\".\n\nThe American Chamber of Commerce in China also voiced concerns after the US said it was going ahead with new tariffs.\n\n\"Our members have long been clear that tariffs are paid by consumers and harm business,\" it said in a statement.\n\n\"We urge... that both sides work towards a sustainable agreement as soon as possible that resolves the fundamental, structural issues foreign businesses have long faced in China.\"\n\nWhat's next?\n\nMr Trump has said that trade teams from the US and China are continuing to talk and will meet in September, but further details have not been publicly confirmed.\n\nFrom 15 December, the second phase of 15% tariffs will be rolled out on the remainder of Chinese good not previously affected.\n\nThis includes technology like phones which Mr Trump has sought to protect until now.\n\nOn the same date, China will roll out tariffs on around 3,000 more US products.\n\nThe Trump administration plans, in addition, to raise the rates on existing duties from 25% to 30% on 1 October.\n\nMr Evans-Pritchard from Capital Economics said this rate could increase further still.\n\n\"The tariff rate could go all the way up to 45%,\" he said. \"Those are the goods that do the most damage to China and the least collateral damage to the US.\"\n\nFor the US and Chinese economies, analysts say the pressure created by tariffs is also building.\n\n\"The full-blown trade war, together with China's retaliation in kind, could reduce potential US GDP growth in the short run by almost 1%,\" said Gary Hufbauer of the Washington-based Peterson Institute for International Economics.\n\n\"The impact on China would be larger, as much as 5%.\"\n\nUntil 20 September, the US trade department will collect public comments on the planned tariff increases to 30%.", "description": "The bruising trade war between the world's two largest economies intensifies.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/16A47/production/_108534729_gettyimages-1163647675.jpg"}