{"pub": "guardian", "url": "https://theguardian.com/politics/2019/oct/23/jeremy-corbyn-urged-by-mps-to-resist-calls-for-election", "downloaded_at": "2019-10-23 23:31:44.006373+00:00", "title": "Jeremy Corbyn urged by MPs to resist calls for election", "language": "en", "text": "Jeremy Corbyn is facing significant pressure from his own MPs to resist any government calls for an immediate general election, as Labour refused to confirm when they might back such a poll even if a lengthy Brexit extension is agreed.\n\nWhile the official Labour position remains that Corbyn will support an election once the immediate threat of a no-deal Brexit no longer exists, the party leadership is refusing to be pinned down on what reassurances would be needed for this to happen.\n\nThe deliberate ambiguity is partly caused by extreme anxiety among Labour MPs about the prospect of abandoning the idea of a Brexit referendum for a pre-Christmas election, especially with the party a dozen or so percentage points behind the Conservatives in recent polls.\n\nElection rumours intensify after Johnson and Corbyn Brexit stalemate Read more\n\nOne Labour backbencher told the Guardian they believed up to half the parliamentary party could rebel if Corbyn decided to whip his MPs to support a motion seeking an election under the Fixed-term Parliaments Act (FTPA).\n\nAnother MP described the opposition to an election within Labour as “very strong and widespread”. A party source added: “It’s fair to say there’s not a great appetite for an election in December.”\n\nUnder the FTPA, which came into force in 2011, if a government wants to force a general election sooner than the standard five-year cycle it must pass a motion with a two-thirds majority in the House of Commons, or at least 430 votes.\n\nBoris Johnson has twice called such a vote to seek an election, but failed to attract the necessary number of votes after Labour abstained.\n\nOne ardently pro-remain Labour MP said some colleagues believe a general election may be the party’s last, best hope of blocking Brexit, and he was “totally split” about whether to support it. Another warned: “I think only a very small fraction would vote for it.”\n\nAt the shadow cabinet meeting on Tuesday, Corbyn loyalists including Dan Carden and Laura Pidcock spoke out in favour of supporting an early poll – but others would prefer to push for a referendum.\n\nCorbyn’s spokesman, giving a briefing to reporters after prime minister’s questions on Wednesday, repeated that the party’s policy remained backing an election once no-deal was prevented, but repeatedly refused to say whether this would happen if the EU agreed a Brexit delay until 31 January.\n\n“Exactly how the extension is made, and how it’s communicated and what the legal status is, will determine whether we consider [no deal] taken off the table, and the risk of a crash-out there or not,” he said.\n\n“As soon as the threat of a no-deal crash-out is off the table, and that is clear and guaranteed, then of course we would support an election.”\n\nThe spokesman declined to say what further guarantees would be sought on preventing no deal, saying only: “We need to wait and see what it is that they’re going to come up with, which I think is going to be quite soon.”\n\nAsked if the concern would be the fact that under law, if Labour supported an election motion under the Fixed-term Parliaments Act then it would be up to the government to set a poll date, the spokesman said this was “one of the worries”, but not the only one.\n\nIf Corbyn did decide to support an election, it would seem unlikely that a backbench Labour rebellion could prevent this.\n\nIf Conservatives in the Commons were joined by the SNP and Liberal Democrats, both of whom have liaised with Labour over whether to back an election, it would need little more than a third of Labour MPs to back the plan for it to reach 430 votes.\n\nAdditionally, Labour whips would try to suppress any rebellion by impressing on MPs the need to show the party as united before an election.\n\nThe timing of any election hinges in part on whether Johnson pushes for an immediate poll or tries instead to again shepherd his Brexit-enabling withdrawal agreement bill through the Commons after MPs rejected the accelerated timetable on Tuesday.\n\nAt a meeting between Corbyn and Johnson on Wednesday, called to discuss a possible revised parliamentary timetable, Dominic Cummings, the PM’s chief of staff, appeared keenest on pushing Brexit through parliament in time to hit the 31 October deadline – even if it meant holding all-night sittings.\n\nThe meeting was good-natured but inconclusive, according to one person present, who claimed the No 10 side had kicked off by asking how Labour might respond if a Brexit extension was vetoed by France.\n\nWhile Theresa May and her advisers faced Corbyn across the table in her Westminster office, Johnson, who has inherited the room, chose to conduct the conversation on sofas.\n\nWhile the talks were described as “cordial”, it quickly became clear that there was no common ground at all over Labour’s idea of a longer timetable for the Brexit bill.\n\nAsked if the process would resume, a Downing Street source said: “I do not expect any further talks.”", "description": "Labour MPs anxious about prospect of abandoning idea of Brexit referendum", "authors": ["Peter Walker", "Heather Stewart"], "top_image": "https://i.guim.co.uk/img/media/cab68ccab7655c8fdcf191bc9d0faac9b9bef04d/823_104_4745_2847/master/4745.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c62d91d9ba3cf5f1f84fb5e77636d786", "published_at": "2019-10-23"}