{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/24/WS5db102cda310cf3e355723cc.html", "downloaded_at": "2019-10-24 04:29:43.018643+00:00", "title": "Early elections seen as Brexit hits roadblock", "language": "en", "text": "By Earle Gale in London | China Daily | Updated: 2019-10-24 09:47\n\nBritish Prime Minister Boris Johnson makes a point in the House of Commons in London during the debate on the EU Withdrawal Agreement Bill on Tuesday. UK PARLIAMENT/AP\n\nPoll 'only way' to break impasse, says minister, as Tusk looks beyond Oct 31\n\nBritish Prime Minister Boris Johnson, with his plan to take the nation out of the European Union on Oct 31 in tatters, appears to be gearing up for an early election.\n\nJohnson is understood to want to bring down his own government after he suffered a defeat on Tuesday in the House of Commons on the EU Withdrawal Agreement Bill.\n\nThe prime minister is believed to want to trigger a general election in the hope that his ruling Conservative Party will win a clear majority and be able to get his Brexit divorce deal approved by lawmakers.\n\nBut the UK has fixed-term parliaments and two-thirds of MPs must support the premature calling of an election, so he is in the bizarre situation of wanting opposition MPs to bring down his government.\n\n\"If we can't crack on, regrettably it does seem that a general election is the only way to sort this impasse out,\" Justice Secretary Robert Buckland told the BBC on Wednesday.\n\nOn Tuesday evening, the British Parliament supported Johnson's Brexit divorce deal in principle but balked at his three-day timetable to get the wide-ranging legislation approved by MPs.\n\nJohnson said MPs' support for his deal, which he had secured with EU negotiators in tense negotiations the previous week, was \"welcome, even joyful\". It was a feat his predecessor, Theresa May, had not managed when she tabled her own Brexit divorce deal on three earlier occasions.\n\nBut Johnson was bitterly disappointed that MPs would not support his timetable and \"paused\" his legislation while he considered his options.\n\nThe Guardian newspaper said Republic of Ireland leader Leo Varadkar welcomed the House of Commons' decision to support Johnson's withdrawal agreement.\n\n\"We will now await further developments from London and Brussels about the next steps, including the timetable for the legislation and the need for an extension,\" he said.\n\nThe European Union is likely to grant the UK more time to get its parliamentary business done, something Johnson has repeatedly said he does not want to happen because he is adamant the UK should leave on the previously set Oct 31 deadline.\n\nEuropean Council President Donald Tusk has already said he will recommend to European leaders that they approve a Brexit deadline extension.\n\nTusk tweeted: \"Following PM's decision to pause the process of ratification of the Withdrawal Agreement, and in order to avoid a no-deal Brexit, I will recommend the EU27 accept the UK request for an extension.\"\n\nEU leaders will hope the additional time will ensure Johnson's government or its replacement can get the Brexit divorce deal past the UK Parliament.\n\nGermany's Die Welt newspaper summed up the situation with its headline on Wednesday that read: \"The only thing that is clear is that Brexit is not happening on 31 October.\"\n\nRichard Burgon, the Labour Party's shadow justice secretary, said on Radio 4's Today program that his party would support an early general election if the EU grants a three-month extension and if a no-deal Brexit has been ruled out.\n\nIf the UK Parliament was to call an early general election, the soonest one could be held would be at the end of November, because the election law requires a gap of at least 25 days between an election being triggered and voting day.\n\nSky News noted that Johnson could abandon plans for an early general election and attempt to get his bill passed by Parliament, albeit after the Oct 31 deadline he has been targeting. But the broadcaster quoted an unnamed Johnson insider as saying: \"This Parliament is totally broken. The only way the country can move on is with an election.\"", "description": "British Prime Minister Boris Johnson, with his plan to take the nation out of the European Union on Oct 31 in tatters, appears to be gearing up for an early election.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/24/5db102cda310cf3e97a2b26d.jpeg", "published_at": "2019-10-24"}