{"pub": "townhall", "url": "https://finance.townhall.com/columnists/pauldykewicz/2019/09/17/how-to-profit-from-fed-rate-cuts-n2553279", "downloaded_at": "2019-09-18 05:09:22.025375+00:00", "title": "How to Profit from Fed Rate Cuts", "language": "en", "text": "How to profit from Fed rate cuts is a key question many investors likely are asking as they look to achieve that goal.\n\nInvestors may need to adjust their portfolio holdings to capitalize on new Federal Reserve rate reductions that are expected to occur as the U.S. central bank pursues its statutory mandate of maximum employment and price stability. The Fed lowered its target range for the federal funds rate by 0.25 percent to 2 to 2.25 percent in August 2019, but forecasters are expecting a second 0.25 percent rate cut on Sept. 18 and possibly another one later in 2019, which would mark the third decrease in 2019 and heighten the need for investors to know how to profit from Fed rate cuts.\n\nThe Sept. 18 policy statement of the Federal Open Market Committee (FOMC) and related press conference by Fed Chair Jerome Powell are expected to usher in a quarter-point drop, following nine 0.25 percent rate hikes that started December 2015 and ended December 2018. Before August 2019, the last previous federal funds rate cut occurred in December 2008, during the Great Recession.\n\nHow to Profit from Fed Rate Cuts: Asset Reallocation\n\nThe latest “cross currents” in the market create a challenge for investors to reallocate their assets to different sectors based on Fed monetary policy changes, said New York-based money manager Hilary Kramer, whose new 2-Day Trader service has turned a profit in 11 out of 12 trades for an average return of 12.1 percent.\n\n“While the Fed lowering rates would seem to favor growth stocks and income vehicles such as utilities, these stocks have already enjoyed significant outperformance in 2019,” Kramer said. “However, these stocks have lagged since late August as renewed confidence in the economy and the hopes for a trade deal have led to value stocks coming back to life.”\n\nThe key for investors is to watch what the long end of the yield curve does if the Fed cuts rates, said Kramer, who also heads the Value Authority, GameChangers, Turbo Trader, High Octane Trader and Inner Circle advisory services. If the 10-year Treasury bond continues to rise and moves back above 2 percent, it would be a clear signal that confidence in the economy is growing and value stocks should do well, especially banks amid hope from investors of a widening yield curve, she added.\n\nInvestment columnist Paul Dykewicz interviews New-York-based money manager Hilary Kramer.\n\nHow to Profit from Fed Rate Cuts: Technology and Income Stocks\n\nIf the yield on the 10-year Treasury bond falls with short-term rates, growth stocks, such as those in the technology sector, and income-oriented shares once again could regain their leadership of the market, Kramer said. The challenge investors now face is making sense of the Fed’s abrupt turnaround to cut rates after raising them as recently as last December, she added.\n\n“People and automated trading algorithms alike naturally associate falling interest rates with rising recession risk, so it would be nice for Chairman Powell to communicate very clearly and very forcefully whether that’s the motive here.”\n\nIn that scenario, investors should become defensive with their portfolio holdings to ride out the “storm” by pivoting into utilities, big pharmaceutical companies and real estate investment trusts (REITs), Kramer said. Energy equities also would gain investor interest if the oil market is on the Fed’s radar, she added.\n\nHow to Profit from Fed Rate Cuts: Energy Fund\n\nSector funds like the Energy Select Sector SPDR (NYSE:XLE) offer current yields of more than 3 percent now and eventually will benefit from a little relief from what had become a global supply glut, Kramer said. If the Fed’s new monetary policy easing is a sign that its previous tightening cycle went too far, it is good for dividend-paying investments, since lower Treasury yields in a more robust economic environment push investors out of bonds, she added.\n\n“At a minimum, you want to be able to keep up with inflation, which means 2 percent is the threshold for simply maintaining purchasing power in the long term,” Kramer said. “However, an economy strong enough to generate inflation internally also is strong enough to keep growth stocks moving and support the high-multiple names that came so far early this year and have crashed so hard lately. Either way, we’re sticking to our established strategy of capturing growth at the right price and locking in attractive yields. The best names in both categories are represented in my GameChangers and Value Authority services, respectively.”\n\nGiven stark differences of opinion about where to invest next, it’s “crucial to remain agile and alert,” Kramer said. She spoke of having “great success” squeezing incremental profit out of very short-term positions, especially in the options market, where her ultra-short-term 2-Day Trader has started strongly with more than 90 percent winners.\n\n“The strategic orientation changes day by day, just like the market as a whole, but simply riding the swings has liberated quite a bit of cash in what’s otherwise a confused and crowded environment,” Kramer said.\n\nHow to Profit from Fed Rate Cuts: Preferred Stocks\n\nBob Carlson, who leads the Retirement Watch advisory service, said preferred securities and real estate investment trusts (REITs) tend to do well when interest rates are low or falling.\n\n\n\n“With preferred securities, you earn a higher yield than available through treasury and investment-grade bonds,” Carlson said. “You earn close to the yield of high-yield bonds but are taking much lower risk. The preferred securities also should increase in value when interest rates decline.”\n\n\n\nThe best way to invest in preferred securities is through a closed-end fund that uses leverage, Carlson said. The leverage increases the yield and the return, he added.\n\n“Most closed-end funds have only a 20 to 30 percent leverage ratio, so the leverage adds only a reasonable amount of risk,” Carlson said.\n\n\n\nCohen & Steers Limited Duration Preferred and Income Fund (NYSE:LDP) is Carlson’s recommendation to profit from reduced rates. The fund has a 30 percent leverage ratio, trades at a discount to net asset value of 1.97 percent, offers a distribution yield of 7.38 percent and has achieved a total return of more than 22 percent so far in 2019.\n\n\n\nHow to Profit from Fed Rate Cuts: REITs\n\n“I like REITs because commercial real estate benefits from a low-interest, low-growth environment,” Carlson said. “The economic growth causes rents to increase and vacancy rates to decline. But the low growth stymies speculation that could lead to overbuilding.”\n\n\n\nInvestors can own roughly equal amounts of preferred securities and REITs through Cohen & Steers REIT & Preferred Income (NYSE:RNP), Carlson said. The fund has a yield of 6.31 percent and sells at a discount of 3.16 percent. So far this year, the total return of RNP is 38.72 percent.\n\nThe recent rotation out of growth and dividend stocks and into deep cyclical and value stock has caused several top-shelf REITs to pull back, said Bryan Perry, who leads the Cash Machine, Premium Income, Hi-Tech Trader, Instant Income Trader and Quick Income Trader advisory services. With the Fed expected to cut rates, Perry is looking for investors to put money back into utilities, telecommunications, consumer staples and, in particular, the data center, cell tower and self-storage REITs that offer the best discounts from where they were trading at new highs in early September.\n\n“These three sub-sectors are taking full advantage of the bullish secular trends in moving data to the cloud, the massive 5G rollout and relocation of a highly mobile and fully employed workforce,” Perry said.\n\nHow to Profit from Fed Rate Cuts: Follow the Fed\n\nThe months of September and October are historically volatile for the markets, but investors need to pay attention to the Fed’s actions and invest accordingly. The Fed announced on July 31 that the FOMC’s timing and size of future adjustments to the target range for the federal funds rate will assess realized and expected economic conditions to attain its maximum employment objective and its goal of 2 percent inflation. This assessment will factor in a wide range of information, including measures of labor market conditions, indicators of inflation pressures and inflation expectations, along with readings on financial and international developments.\n\nSteve Moore, a Distinguished Visiting Fellow at the Heritage Foundation’s Institute for Economic Freedom and Opportunity, received consideration to be nominated to the Federal Reserve Board by President Trump before the former Wall Street Journal editorial writer withdrew after his candidacy drew controversy. In an interview with Moore at FreedomFest in Las Vegas during July, he told me the Fed ideally would become “transparent and open” with its policymaking to avoid the need for prognosticating.\n\n?\n\nPaul Dykewicz interviewing Steve Moore at FreedomFest.\n\n“The idea that this is a secret chamber is wrong,” said Moore, who added the U.S. central bank should not operate beyond a “stone wall of silence.”\n\nThe Fed’s action affect money supply, interest rates and the economy, Moore said. His preference would be for the Fed to institute a “rules-based monetary policy,” in which decisions about changes to rates would be based on objective criteria.\n\nA key goal of the Fed is to hold prices stable and a rules-based rate-setting regime would support such an objective, Moore told me. Inflation and deflation are “negative” for the economy, he added.\n\nWithout a rules-based process for the Fed to set rates, the drama of each FOMC meeting and its decisions will pose uncertainty for investors. However, the public comments from Fed leaders and forecasters, along with economic data and President Trump’s calls for cuts, are indicating rate reductions could be on the immediate horizon.\n\nPaul Dykewicz, www.pauldykewicz.com, is an accomplished, award-winning journalist who has written for Dow Jones, the Wall Street Journal, Investor’s Business Daily, USA Today, the Journal of Commerce, Seeking Alpha, GuruFocus and other publications and websites. Paul is the editor of StockInvestor.com and DividendInvestor.com, a writer for both websites and a columnist. He further is the editorial director of Eagle Financial Publications in Washington, D.C., where he edits monthly investment newsletters, time-sensitive trading alerts, free e-letters and other investment reports. Paul previously served as business editor of Baltimore’s Daily Record newspaper. Paul also is the author of an inspirational book, “Holy Smokes! Golden Guidance from Notre Dame’s Championship Chaplain,” with a foreword by former national championship-winning football coach Lou Holtz. Follow Paul on Twitter @PaulDykewicz.\n\nThe post How to Profit from Fed Rate Cuts appeared first on Stock Investor.", "description": "How to profit from Fed rate cuts is a key .09/18/2019 1:08:16AM EST.", "authors": ["Paul Dykewicz", "Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/_townhall/resources/images/thog.png", "published_at": "2019-09-17"}