{"pub": "bbc", "url": "https://bbc.co.uk/news/technology-49893909", "downloaded_at": "2019-10-02 00:37:34.551265+00:00", "title": "Email signature ruling 'cost seller £25,000'", "language": "en", "text": "Image copyright Getty Images\n\nA High Court judge has ruled an email sent by a lawyer is legally binding as it includes his automated signature.\n\nThe email is part of an exchange between lawyers whose clients were in dispute over the sale of some land.\n\nIn his email, the lawyer for the owners set out terms, including a sale price £25,000 lower than the original asking price, which the other lawyer accepted.\n\nBut he then said the terms had not been finalised because no paperwork had been officially signed by both parties.\n\nThe owners' lawyer, Daniel Tear, argued this fell under Section 2 (1) of the Law of Property Act of 1989, which states: \"The document incorporating the terms or, where contracts are exchanged, one of the documents incorporating them (but not necessarily the same one) must be signed by or on behalf of each party to the contract.\"\n\nHowever, the judge said Mr Tear's auto-signature at the bottom of the email - although not added deliberately by him - served as a signature.\n\n\"The purported signature of the solicitor on behalf of the defendant was by 'automatic' generation of his name, occupation, role and contact details at the foot of an email,\" wrote Judge Pearce, at Manchester Civil Justice Centre.\n\nHe also pointed out not all of the email correspondence from Mr Tear had included the auto-signature and said his use of the words \"many thanks\" at the end of the email text showed \"an intention to connect the name with the contents of the email\".\n\n\"I am satisfied that Mr Tear signed the relevant email on behalf of the defendant,\" Judge Pearce said.\n\nMr Tear said in his defence this had not been his intention.\n\nBBC News has contacted him for comment.\n\n\"Be careful what you add your signature block to,\" said journalist Gareth Corfield, who covered the story on technology news website The Register.", "description": "A High Court judge rules an auto-signature at the end of an email makes it legally binding.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/A9BE/production/_109045434_gettyimages-1052890590.jpg", "published_at": "2019-10-01"}