{"pub": "cnn", "url": "https://cnn.com/travel/article/rolls-royce-boeing-747-testbed-seattle/index.html", "downloaded_at": "2019-10-17 08:06:52.492141+00:00", "title": "Rolls-Royce to use retired Boeing 747 as testbed for revolutionary jet engine", "language": "en", "text": "(CNN) — When airplanes retire, they get transformed into everything from hotels to underwater art installations\n\nOne Boeing 747 has a slightly less glamorous but nevertheless exciting future path. After 20 years soaring through the skies in Qantas livery, it's been recruited by Rolls-Royce's aerospace operations to start a new life as a testbed for futuristic engines.\n\nThe aircraft's final commercial flight was from Sydney to Los Angeles, and it's now based at AeroTEC, a flight center just outside Seattle. Here, this Boeing 747 is set to be transformed during a two-year-long, $70 million process, before helping to launch the next generation of Rolls-Royce jet engines.\n\nThe airplane flew more than 70 million kilometers over the course of its Qantas career, carrying some 2.5 million passengers.\n\nAs a flying testbed, the airplane will trial commercial and business engines at super fast speeds and high altitudes, operated by a crew of specialist test pilots.\n\nThe aircraft will join forces with Rolls-Royce's existing flying testbed, another Boeing 747 that's completed 285 test flights and counting.\n\nNew life\n\nA mock-up image of how the aircraft will look when it's modified depicts the Boeing 747 testing the upcoming UltraFan engine, which the aviation company says will \"redefine the world of jet engines.\"\n\nThe fan engine looks pretty big compared to the aircraft's standard power units.\n\n\"It's a really big fan, about 140-odd inches, compared to say, XWB that's got an 118 inch diameter,\" Caroline Day, head of marketing, strategy and future programs at Rolls-Royce, tells CNN.\n\nRelated content What happens to planes when they are retired?\n\nOn a visit to the UK Rolls Royce Aerospace factory in Derby, England, Day tells CNN Travel the company is building a number of UltraFan engines to test.\n\n\"That program is significant, there's hundreds of people working on it, because we want to get it ready for the back end of the next decade,\" she confirms.\n\nThe team are determined that the new engine will be more fuel efficient and safe and smooth.\n\nRelated content How an airplane engine gets made\n\nAs a testbed, the former Qantas airplane will be outfitted with instrumentation and systems allowing it to take measurements of engine performance while it's in the air.\n\n\"This airborne laboratory will enable the development and certification of new, highly advanced engine technologies designed to increase efficiency and minimize environmental impacts,\" said AeroTEC president and founder Lee Human.", "description": "At AeroTEC flight center outside Seattle, Rolls-Royce will use a 20-year-old Boeing 747 to test its UltraFan jet engine. The company believes the engine could revolutionize aviation.", "authors": [], "top_image": "https://dynaimage.cdn.cnn.com/cnn/w_1200/http%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F191015170556-rr-flying-testbed-ultrafan-tight-crop-super-tease.jpg", "published_at": "2019-10-16"}