{"pub": "metro", "url": "https://metro.co.uk/2019/10/28/matteo-guendouzi-speaks-rugby-tackle-stop-wilfried-zaha-arsenals-draw-crystal-palace-10995667", "downloaded_at": "2019-10-28 09:51:42.256909+00:00", "title": "Matteo Guendouzi speaks out on his 'rugby tackle' against Wilfried Zaha in Arsenal's draw vs Crystal Palace", "language": "en", "text": "Matteo Guendouzi stopped Wilfried Zaha with a rugby tackle (Getty Images)\n\nMatteo Guendouzi insists he had no choice but to rugby tackle Wilfried Zaha to the ground during the final stages of Arsenal’s 2-2 draw with Crystal Palace on Sunday.\n\nThe Gunners slipped up once again as they threw away a two-goal lead at the Emirates Stadium and were held to a point by Roy Hodgson’s side.\n\nBut it could have got even worse for Arsenal late in injury time as Palace threatened to counter through Zaha but he was stopped in his tracks as Guendouzi hauled him to the ground by the neck.\n\n‘I had to foul Zaha at the end, otherwise he is through on goal on his own,’ said Guendouzi.\n\nMatteo Guendouzi did a rugby – tackling on Zaha and escaped a red card ? How ? 😳 🤔 pic.twitter.com/sRlSEgCBiU — Ùnited Galàctico 🔴 (@galactico_mufc) October 27, 2019\n\n‘I’m the last defender but I’m far from our goal as well. I had to do it.’\n\nAdvertisement\n\nAdvertisement\n\nGuendouzi was given a yellow card by referee Martin Atkinson but Hodgson believes the Arsenal midfielder was lucky to escape a red.\n\n‘There’s no way he wanted to cause any harm,’ said the Palace manager.\n\nWilfried Zaha trolled Guendouzi for his tackle (Twitter)\n\n‘He just wanted to stop Zaha getting free because they wouldn’t have caught him and it would have been a case of can he convert one on one.\n\n‘I think he is quite lucky he got the yellow card, some might say it was a red, but that’s of no interest to me.\n\n‘I’m just disappointed Wilf didn’t get chance to win the game for us.’", "description": "Matteo Guendouzi insists he had no choice but to rugby tackle Wilfried Zaha to the ground during the final stages of Arsenal's 2-2 draw with Crystal Palace on Sunday. The...", "authors": ["Metro Sport Reporter"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_93085988_1572255854.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-28"}