{"pub": "townhall", "url": "https://townhall.com/tipsheet/cortneyobrien/2019/09/26/the-whistleblower-complaint-is-out-n2553748", "downloaded_at": "2019-09-26 14:51:54.347402+00:00", "title": "The Whistleblower Complaint Is Out. IG Notes 'Arguable Political Bias' of Complainant.", "language": "en", "text": "The House Intelligence Committee has released the whistleblower complaint against President Trump which accuses him of threatening to withhold military aid from Ukraine if the government did not honor his request to investigate Joe and Hunter Biden.\n\nIt can be viewed here. The complainant outlines his \"urgent concern\" about the call he heard about between Trump and Ukrainian President Volodymyr Zelensky. He was relying on what he heard \"from multiple U.S. government officials\" to conclude that Trump \"is using the power of his office to solicit interference from a foreign country to investigate one the President's main domestic political rivals.\" The complainant also names Trump's personal lawyer Rudy Giuliani and Attorney General Bill Barr as accomplices.\n\nAlthough the whistleblower was not a direct witness, he or she found these colleagues' accounts to be credible because, \"in almost all cases, multiple officials recounted fact patterns that were consistent with one another.\" The complainant adds that they were \"deeply disturbed\" by what they heard.\n\nThe committee has also released a letter from Inspector General of the Intelligence Community Michael Atkinson to Acting DNI Joseph Maguire regarding the complaint.\n\nIn the letter, Atkinson acknowledges that the whistleblower \"was not a direct witness\" to Trump's phone call with Zelensky. But, \"other information obtained during the ICIG's preliminary review, however, supports the Complainant's allegation that, among other things, that during the call the President 'sought to pressure the Ukrainian leader to take actions to help the President's 2020 reelection bid.'\"\n\nAtkinson also notes that the ICIG \"identified some indicia of an arguable political bias on the part of the Complainant in favor of a rival political candidate.\" But, that did not change their opinion that the complaint \"appears credible.\"\n\nHe adds that requesting access to the records of the telephone call were \"not necessary\" to determine that the urgent concern appeared credible. He later notes that those transcripts would, however, be \"relevant\" to future investigations into the matter.\n\nDemocrats who read the complaint Wednesday night alleged that its contents were \"deeply disturbing\" and \"troubling.\" They've already announced a formal impeachment inquiry against the president.\n\nTrump tweeted this morning that is \"under siege\" from Democrats who have wanted him out of office since the day he entered it.", "description": ".09/26/2019 10:51:12AM EST.", "authors": ["Cortney O'Brien", "Katie Pavlich", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/268/393a22cf-ec8e-4c10-b1c3-e90101b2b657.png", "published_at": "2019-09-26"}