{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/transfer-news/zinedine-zidane-set-january-battle-20556990", "downloaded_at": "2019-10-11 05:10:37.041083+00:00", "title": "Zinedine Zidane set for January battle with Real Madrid chiefs over Paul Pogba and Christian Eriksen", "language": "en", "text": "Get the biggest Real Madrid CF stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nReal Madrid manager Zinedine Zidane and club President Florentino Perez are reportedly in disagreement over whether to sign Christian Eriksen or Paul Pogba in January.\n\nThe Spanish giants, who are currently top of La Liga, are understood to be keen to strengthen their midfield options during the winter transfer window after being affected by a number of injuries.\n\nBoth players were linked with a move to the Bernabeu during the summer but the Spanish giants were unable to complete moves after spending almost £275m on the likes of Eden Hazard, Eder Militao, Ferland Mendy and Luka Jovic.\n\nEriksen has hinted at a departure in recent months and will be able to leave Spurs on a free transfer when his current deal expires next summer.\n\n(Image: AFP/Getty Images)\n\nHowever, rather than get the Danish playmaker for free next summer, ESPN reports that Perez wants to complete a move in January.\n\nAccording to the publication, the Madrid President believes a £26.5m (€30m) offer will be enough to convince the North London club to part with the 27-year-old six months early.\n\nHowever, it is claimed that the La Liga club could face a potential obstacle in the form of Eriksen's preference to complete the move in the summer, as the absence of a transfer fee would allow him to request a higher signing bonus.\n\nWhile Eriksen is thought to be Perez's top target, ESPN also reports that he could face opposition from his own manager because he \"has his heart set on signing Pogba.\"\n\n(Image: REUTERS)\n\nZidane has made his admiration for the 26-year-old well-known but was unable to meet United's £150m asking price for their star midfielder over the summer, despite the player's affirmations he was ready to leave Old Trafford.\n\nAlthough Perez has attempted to convince him otherwise, the Real boss is understood to be confident a deal can happen due to his compatriot's strong desire to make the switch to Spain.\n\nPogba has made six appearances in all competitions for the Red Devils this season but has seen his game-time limited by an ankle injury.", "description": "The Madrid boss is reportedly still interested in signing Pogba, despite Florentino Perez's attempts to complete a January move for the Spurs star", "authors": ["Hassan Rashed", "Image", "Afp Getty Images", "Reuters"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article17996736.ece/ALTERNATES/s1200/0_FBL-ENG-PR-TOTTENHAM-MAN-UTD.jpg", "published_at": "2019-10-11"}