{"pub": "metro", "url": "https://metro.co.uk/2019/10/16/plastic-surgeon-suggests-piers-morgan-goes-knife-sort-soft-chin-dropping-eyelids-10926822", "downloaded_at": "2019-10-16 08:30:07.009303+00:00", "title": "Plastic surgeon suggests Piers Morgan sorts 'dropping eyelids'", "language": "en", "text": "Piers Morgan was left seething over feedback about his features (Picture: ITV)\n\nPiers Morgan has been recommended some cosmetic surgery on his ‘soft chin’ and ‘dropping eyelids’.\n\nCosmetic surgeon Dr Julian de Silva analysed the faces of Piers and his Good Morning Britain co-host Susanna Reid and pointed out their highlights and flaws.\n\nWhile he feels Piers was ‘quite handsome as a young man’, he criticised other areas that have come on with age.\n\nThe surgeon had mapped Piers and Susanna’s faces based on the ‘golden ratio’ of beauty, originally created by the ancient Greeks using maths, and gave his thoughts on their looks and bone structure.\n\nHe said: ‘Piers has strong features an a particularly well shaped nose, which is quite remarkable for a man. You can tell from the main structure of his face that he must have been quite handsome as young man.\n\n‘What lowers his score somewhat is the softening of the jawline and around the neck and chin which is quite common in a man of his age, and also some slightly dropping of the eyelids above the eye, but all these things can be greatly improved with cosmetic surgery procedures.’\n\nAdvertisement\n\nAdvertisement\n\n‘Plastic surgeon wants more work shocker,’ the presenter quipped.\n\nPiers was ‘quite handsome as a young man’, according to De Silva (Picture: ITV)\n\nSusanna was declared ‘extremely beautiful’ (Picture: ITV)\n\nHowever the doctor was full of praise for Susanna, calling her ‘an extremely beautiful woman’.\n\nDe Silva went on: ‘Her nose is in wonderful proportion to her lips. In fact all of her mapping scores were in the 80s or above which shows a high degree of symmetry and it’s clear she is an extremely beautiful woman.’\n\nOf course Piers was grouchy about the feedback his co-presenter received, saying: ‘Where are the negatives? No negatives. Absolutely ridiculous. I used to be alright once and now you’re a fat lad. She gets, oh radiant, beautiful, wonderful.’\n\nDe Silva was the man who declared model Bella Hadid the most beautiful woman in the world based on the ‘golden ratio’.\n\nGood Morning Britain airs weekdays from 6am on ITV.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Man who identifies as broccoli torn apart on Good Morning Britain as Piers Morgan brands him ‘an idiot’\n\nMORE: The Apprentice star Claude Littner undergoes back surgery", "description": "Plastic surgeon suggests Piers Morgan sorts 'dropping eyelids and soft jaw'", "authors": ["Sarah Deen"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/piers-af2a_1571212818.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-16"}