{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/23/WS5db00000a310cf3e3557220d.html", "downloaded_at": "2019-10-24 04:30:57.589916+00:00", "title": "South Africa signs agreement with Tencent to boost tourism", "language": "en", "text": "By Edith Mutethya in Nairobi, Kenya | chinadaily.com.cn | Updated: 2019-10-23 15:23\n\nThe Tencent logo is reflected in rippling water surrounding a fountain. [Photo/IC]\n\nSouth African Tourism, the official marketing agency for the country, on Tuesday signed a strategic partnership with Tencent, aimed at boosting tourism.\n\nMmamoloko Kubayi-Ngubane, minister of Tourism in South Africa, said through the two-year partnership, WeChat will market South Africa as a tourism destination to millions of Chinese travelers.\n\nShe said the partnership aims to position South Africa as a preferred tourism destination in China, through digital marketing campaigns on WeChat as well as other platforms within the Tencent ecosystem.\n\n\"Through WeChat, Tencent will assist us to access multiple segments of the Chinese travelers' market. In addition to customized market for each market segment, Tencent platforms will also enrich Chinese travelers' experience when they travel to South Africa,\" Kubayi-Ngubane said.\n\nTencent will also assist South Africa Tourism with a knowledge-transfer program on best practices for destination development through QR codes.\n\nThis is in addition to advice on how the country can accelerate the implementation of WeChat Pay for Chinese travelers to South Africa.\n\nKubayi-Ngubane said South Africa is open for business and offers diverse and world-class attractions, excellent transport services and communications infrastructure that competes with the best in the world.\n\n\"This strategic co-operation agreement is one of many initiatives developed to increase arrivals from China to South Africa,\" she said.\n\n\"China is South Africa's largest trading partner and we are using these trade relations to strengthen the people-to-people exchange between the two countries. I am pleased that, together with Tencent, South African Tourism in China is laying a solid foundation for growth in visitor arrivals from China to South Africa\".", "description": "South African Tourism, the official marketing agency for the country, on Tuesday signed a strategic partnership with Tencent, aimed at boosting tourism.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/23/5db00000a310cf3e97a29b56.jpeg", "published_at": "2019-10-23"}