{"pub": "investing.com", "url": "https://ph.investing.com/news/stock-market-news/global-marketsglobal-shares-lose-steam-on-weak-us-retail-sales-brexit-in-focus-67937", "downloaded_at": "2019-10-17 01:50:57.044390+00:00", "title": "GLOBAL MARKETS-Global shares lose steam on weak U.S. retail sales, Brexit in focus", "language": "en", "text": "GLOBAL MARKETS-Global shares lose steam on weak U.S. retail sales, Brexit in focus\n\n* U.S. retail sales fall for first time in 7 months\n\n* Upbeat U.S. earnings cushion blow from data\n\n* Sterling volatile as Brexit talks continue\n\n* Asian stock markets: https://tmsnrt.rs/2zpUAr4\n\n\n\nBy Hideyuki Sano\n\nTOKYO, Oct 17 (Reuters) - Global stocks barely moved on\n\nThursday as soft U.S. retail sales data raised concerns about\n\nthe health of the world's largest economy and risk of global\n\nrecession, while sterling was volatile as negotiations on a\n\nBrexit deal continued.\n\nBoth MSCI's broadest index of Asia-Pacific shares outside\n\nJapan and Japan's Nikkei were little\n\nchanged in early trade while U.S. stock futures lost\n\n0.15%.\n\nThe S&P 500 shed 0.20% the previous day after data\n\nshowed U.S. retail sales contracted in September for the first\n\ntime in seven months, in a potential sign that manufacturing-led\n\nweakness could be spreading to the broader economy. \"It looks like the trade war has claimed yet another victim,\n\nin addition to diminished business confidence and reduced\n\ninvestment spending, as consumers are starting to chicken out,\"\n\nsaid Chris Rupkey, chief financial economist at MUFG Union Bank.\n\nGiven U.S. consumption has been one of few remaining bright\n\nspots in the global economy, the data fanned worries about a\n\nglobal recession.\n\nU.S. Treasury Secretary Steven Mnuchin said on Wednesday\n\nthat U.S. and Chinese trade negotiators were working on nailing\n\ndown a Phase 1 trade deal text for their presidents to sign next\n\nmonth.\n\nBut he also said there were no plans for another high-level\n\nmeeting on the trade deal outlined last week.\n\n\"While the U.S. suspended a hike in tariffs, it hasn't gone\n\nas far as scrapping the tariffs altogether, so it is hard to\n\nexpect a quick pick-up in the economy,\" said Yoshinori Shigemi,\n\nglobal market strategist at JPMorgan Asset Management.\n\nLosses in equities were offset by a solid start to the\n\nearnings season, though that is partly because investors have\n\nalready marked down their expectations substantially, with\n\nearnings for S&P 500 companies expected to show a decline of 3%\n\nfor the quarter, according to Refinitiv data.\n\nBank of America BAC.N shares rose 2.0% following its\n\nquarterly results. Netflix rose 9.9% in after-hours\n\ntrade after its earnings beat Wall Street estimates.\n\nIn the currency market, soft U.S. retail sales took the\n\nshine out of the dollar.\n\nThe dollar index =USD fell 0.30% on Wednesday and last\n\nstood at 97.964, having touched its lowest since Aug. 27.\n\nAgainst the yen the dollar slipped to 108.73 yen ,\n\nafter peaking at 108.90 on Tuesday.\n\nThe euro stood at $1.1075 , up 0.04% so far in Asia,\n\nnear a one-month high of $1.1085 hit in U.S. trade on Wednesday.\n\nSterling traded at $1.2823 GBP=D4 , having risen to as high\n\nas $1.2877 on Wednesday, its loftiest level since mid-May.\n\nIt has risen more than 5% in the past five sessions on the\n\nprospect that the United Kingdom and the European Union can\n\nstrike a fresh deal to avoid a no-deal exit in the summit on\n\nThursday and Friday.\n\nInvestors have welcomed optimistic comments from key\n\nofficials during last few days. British culture minister Nicky\n\nMorgan said late on Wednesday there is a good chance of a deal.\n\nStill, many doubts remained, not the least of which is if\n\nBritish Prime Minister Boris Johnson can ensure his government\n\nand factious parliament approve the plan.\n\nIn one sign of investor caution, in currency option markets,\n\nrisk reversal spreads in sterling GBP1MRR=FN turned in favour\n\nof pound puts after briefly favouring pound calls earlier this\n\nweek, meaning demand to protect the currency's downside is\n\nstronger than that for the upside.\n\nThe Turkish lira steadied off seven-week lows as U.S.\n\nPresident Donald Trump's sanctions for Turkey's military\n\nincursion into Syria were perceived to be lighter than expected.\n\nLira bears also suffered a flashback of their suffocating\n\nMarch squeeze as the authorities moved to keep a lid on\n\nvolatility by restricting the supply of lira to overseas\n\ncounterparts.\n\nThe lira stood at 5.8825 per dollar TRYTOM=D3\n\nOil prices eased after U.S. data showed a\n\nlarger-than-expected build in U.S. crude stocks. Brent crude futures fell 0.82% to $58.93 a barrel\n\nwhile U.S. West Texas Intermediate (WTI) crude lost 1.01%\n\nto $52.82 per barrel.\n\n\n\n", "description": "GLOBAL MARKETS-Global shares lose steam on weak U.S. retail sales, Brexit in focus", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/Brazil-Stock-Market_3_800x533_L_1414427437.jpg", "published_at": "2019-10-17"}