{"pub": "afr", "url": "https://afr.com/wealth/investing/ai-isn-t-as-good-as-humans-when-it-comes-to-funds-management-20191014-p530d3", "downloaded_at": "2019-10-14 00:19:07.812114+00:00", "title": "AI isn't as good as humans when it comes to funds management", "language": "en", "text": "What's being touted as a revolution has been used by quantitative whizzes for years. Almost all quant funds use machine learning to sweep through social media, news articles, and earnings reports.\n\nPanAgora Asset Management, a $US45 billion quant fund based in Boston, has been creative in using natural language processing to analyse Chinese equities. Its machine-learning tool spiders through online forum posts by retail Chinese traders and identifies cyber slang words they use to avoid government censors, who might crack down on negative language, such as discussions of poor earnings results. Canny Chinese bloggers, for example, replace the word \"rubbish\" with a phonetically similar expression, \"spicy chicken\". PanAgora's model identifies such similar-sounding words and the context in which they appear to gauge sentiment about Chinese companies.\n\nPanAgora is also looking at using AI to execute trades and spot accounting abnormalities that a simple analysis wouldn't find. \"We have tons of data [on the execution of trades], and now instead of making all these individual decisions using anecdotal evidence from the trading desk, we can make a much more quantitative decision given past results,\" says George Mussalli, equities chief investment officer at PanAgora.\n\nOne reason Aberdeen Standard and others are turning to robots for help is the recent market environment. Investors are fretting over the end of the bull market as trade tensions and an inverted yield curve flash warning signs for global growth. But they're afraid to exit too early and miss out on late-cycle returns.\n\nYet swings in investor sentiment are hard for machines to navigate, too. \"If the market becomes unpredictable, it's always more challenging for AI,\" says Anand Rao, global artificial intelligence lead at consulting firm PwC. \"This time around, there are different forces acting. But [the collapse of the credit market bubble in] 2007 was also very different, and so was [the end of the dot-com bubble in] 2000. With more data and more history, AI funds will get better.\"\n\nSo far, machines seem befuddled by these markets. After outperforming the Hedge Fund Research HFRX Equity Hedge Index in four of the past five years, Société Générale's long-short US stock index based on a machine-learning model has been lagging this year, with a return of less than half that of HFRX. The Eurekahedge Artificial Intelligence Hedge Fund Index, which tracks hedge funds that use machine learning, has also underperformed in 2019: Its gain of 2.3 per cent through August 31 trailed the 6.9 per cent return for the broader HFRX Index.\n\n\"This year has been challenging for AI funds. It's probably the first time in the history of the US that you have a president tweeting these kinds of things,\" says Nicky Indradi, an analyst at Eurekahedge. \"If you give AI funds more time to better understand the technology they're using, I'm optimistic that they'll be able to perform well.\"\n\nAdvertisement\n\nOne of the Socgen Index's creators, Andrew Lapthorne, says the robot's strength is in feature recognition: picking biotech stocks that have a better chance of outperforming, for example. But he also warns that the strategy needs time to develop before it can be offered to a larger number of clients - about $US39 million of assets currently track SocGen's machine-learning strategies. In addition, he says double-digit returns are unrealistic.\n\nNobel Prize-winning economist Robert Shiller is also tempered on AI's prospects. \"I think we still need human oversight,\" Shiller says in a London interview. \"AI can really mess up when reacting to text because a word may have a new meaning or there could be a typo. We would recognise it as a typo, but the machine might not.\"\n\nStill, Boyan Filev, co-head of quantitative equity at Aberdeen Standard, says the advantage of using machine learning to manage a portfolio is that it adapts to the market and improves over time. The fund's underperformance, he contends, is mainly the result of challenging markets and the changing behaviour of so-called equity factors, which have led to losses at many quant funds in 2019.\n\n\"Our fund was positioned more defensively at the start of the year in line with the bear market of the end of 2018,\" Filev says. \"However, the sharp reversal of equity markets this year hasn't been particularly helpful. A more stable and slower-evolving environment is more beneficial to our product. Very sharp reversals in market directions are very hard to position against in the short term.\"\n\nFilev expects the fund to adapt to conditions, he says. It just hasn't done so yet.\n\nWashington Post", "description": "\"This year has been challenging for AI funds,\" says one expert. \"It's probably the first time in the history of the US that you have a president tweeting these kinds of things.\"", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2741%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_13/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/9c08b9766ab0d9d37b2247f3fcc675af267a5d52", "published_at": "2019-10-14"}