{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/15/WS5da5281aa310cf3e35570849.html", "downloaded_at": "2019-10-15 02:18:39.102330+00:00", "title": "Ability to detect bio-chemical activity on exoplanets just 30 years away", "language": "en", "text": "By Harvey Morris | China Daily Global | Updated: 2019-10-15 09:59\n\nWinners of the 2019 Nobel Prize in Physics in are announced in Stockholm, Sweden, on Oct 8, 2019. This year's Prize is shared by three scientists, one half to James Peebles \"for theoretical discoveries in physical cosmology\" and the other half jointly between Michel Mayor and Didier Queloz \"for the discovery of an exo-planet orbiting a solar-type star\". [Photo/Xinhua]\n\nIt is less than a quarter of a century since astronomers confirmed the existence of planets beyond our own solar system, raising the prospect of humanity one day finding extraterrestrial life.\n\nThis month, the two scientists who made that breakthrough were awarded with the Nobel Prize in Physics for improving understanding of the evolution of universe and Earth's place in the cosmos.\n\nThe work of Michel Mayor and Didier Queloz, both Swiss, set in motion a scientific quest for so-called exoplanets that resemble Earth and where evidence of life might be located. More than 4,000 exoplanets have been identified in the Milky Way galaxy since the two scientists' 1995 breakthrough.\n\nSo, can mankind expect to detect alien life in the universe anytime soon? Will humans ever face the prospect of inhabiting other Earthlike planets?\n\nMayor and Queloz offered some intriguing answers of their own after their Nobel award was announced.\n\nQueloz, who is based at the Britain's Cambridge University, is confident that alien life will be detected within the next century.\n\nMayor meanwhile quashed the idea that humans would one day colonize other planets and said they should take better care of the one they already have.\n\nHe said that even the nearest theoretically liveable exoplanet would be light years away. \"We are talking about hundreds of millions of days using the means we have available today. We must take care of our planet, it is very beautiful and still absolutely liveable.\"\n\nDistance, however, will not prove a barrier to the efforts of scientists to locate alien life from right here on earth. Queloz believes a new machine capable of detecting bio-chemical activity on exoplanets could realistically be built within 30 years.\n\n\"I can't believe we are the only living entity in the universe,\" Queloz said. \"There are just way too many planets, way too many stars, and the chemistry is universal.\"\n\nThe search for life on exoplanets already figures in the research of organizations such as the United States' NASA and the European Space Agency.\n\nThe privately tech-funded Breakthrough Listen project has also invested in a $100 million program of astronomical observations in search of evidence of intelligent life beyond Earth.\n\n\"Are we alone? Are there habitable worlds in our galactic neighborhood? Can we make the great leap to the stars?\" are the questions Breakthrough Listen poses on its website.\n\nMeanwhile the international FAST telescope project is hunting for exoplanets within 100 light years of Earth that have magnetic fields like our own.\n\nLi Di, a researcher at the National Astronomical Observatories of the Chinese Academy of Sciences and FAST's chief scientist, said this year that scientists are focused on identifying potentially habitable planets, which would require not only water, a suitable temperature and atmosphere, but also a magnetic field.\n\nPhilosophers have theorized about the existence of extraterritorial life for centuries. The question has also spawned generations of speculative fiction featuring intelligent alien life, either hostile or friendly, and fostered widespread but unconfirmed belief in alien UFOs.\n\nOne fundamental question, however, is how humankind should respond if scientists do one day confirm the existence of life beyond Earth.\n\nA recent survey by the UK's Oxford University found that in a planet-wide vote 56.3 percent of the people would opt to make contact with extraterrestrials. Women polled were much less enthusiastic than men to reach out to aliens and most people trusted scientists over politicians to make that decision.\n\nPeter Hatfield of Oxford's physics department said: \"If we do receive a message, it is encouraging to know that the public seem to have confidence in scientists having a key role in the decision-making process of potentially replying.\"\n\nHe said it was hard to estimate if or when such a contact might be made but that most professional astrophysicists considered there was a more or less 10 percent chance in the next 100 years.\n\nSome experts are skeptical about the wisdom of pursuing contact within alien life, if indeed it does exist. Leah Trueblood of Oxford's law department said it was fascinating that most responses to the survey were in favor of contacting aliens. \"Those surveyed are clearly much braver than me,\" she said.\n\nHarvey Morris is a senior media consultant for China Daily UK.", "description": "It is less than a quarter of a century since astronomers confirmed the existence of planets beyond our own solar system, raising the prospect of humanity one day finding extraterrestrial life.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/15/5da5281aa310cf3e97a14310.jpeg", "published_at": "2019-10-15"}