{"pub": "realclearpolitics", "url": "https://news.yahoo.com/johnson-demands-eu-back-down-112849122.html", "downloaded_at": "2019-10-02 15:27:53.102341+00:00", "published_at": "2019-10-02", "title": "Boris Johnson Demands EU Back Down or Face No-Deal Brexit", "language": "en", "text": "(Bloomberg) -- Follow @Brexit and sign up to our Brexit Bulletin.\n\nBoris Johnson outlined his plan for a new Brexit agreement, and warned the European Union to compromise or watch the U.K. walk away from talks and leave the bloc without a deal.\n\nThe U.K. prime minister declared that Britain is “ready” to break away from the EU without an agreement in four weeks’ time if officials in Brussels don’t back down.\n\nIn his first keynote speech as prime minister at his Conservative Party’s conference, Johnson said his team is putting forward details of a “constructive and reasonable” blueprint in Brussels on Wednesday.\n\n“I hope very much that our friends understand that and compromise in their turn,” Johnson told his audience in Manchester, northern England, on Wednesday.\n\n“If we fail to get an agreement because of what is essentially a technical discussion of the exact nature of future customs checks, when that technology is improving the whole time, then let us be in no doubt that the alternative is no deal,” he said. “That is not an outcome we want. It is not an outcome we seek at all. But let me tell you this conference: it is an outcome for which we are ready.”\n\nNo Delay\n\nThe U.K. is due to exit the EU on Oct. 31 and Johnson says he will never agree to delaying Brexit beyond that date, even if it means leaving without an agreement -- risking disruption at ports, to business supply chains, and to the security of food, fuel and water supplies.\n\nThe next few days will be crucial. If Johnson fails to get a deal, he faces a showdown with Parliament and a battle in court over his plan to take Britain out of the bloc with no deal. It could ultimately be up to the judges to decide if Johnson can make good on his threat.\n\nIn his speech, Johnson insisted he loves Europe and wants a strong relationship with the bloc in future. But in an interview with The Sun newspaper he set EU negotiators an Oct. 11 deadline for agreeing a headline deal with the U.K..\n\nHe gave few details of his blueprint to resolve the toxic question of avoiding the need for checkpoints to inspect goods crossing the Irish border, which has held up progress in the negotiations for the past year.\n\nHe said his plan is a “compromise.” It involves a common set of rules for agriculture across the island of Ireland, no customs checks on goods crossing the Irish border “at or near” that frontier, and a “renewable” process in which the Northern Ireland elected assembly gives its consent to the system in operation.\n\nSkeptical\n\nThere are few signs that European leaders are willing to accept Johnson’s proposals. Ireland, a key voice on the EU side, has already rejected elements of the plan.\n\nEarlier on Wednesday, before the prime minister’s speech, Irish Foreign Minister Simon Coveney said the proposals did not appear encouraging. “Essentially, if he’s proposing customs checks on the island of Ireland then I don’t think that’s going to be the basis of an agreement,” he told Sky News.\n\nGiving their initial reaction, European officials in Brussels said they would not be backing down. They said they would consider working for a compromise, but only if Johnson’s plan doesn’t threaten the peace and economy of the island of Ireland or blow holes in the bloc’s single market.\n\nWhile they haven’t seen full details of the plan, EU officials are skeptical, saying it appears unworkable in its current form, primarily because it separates single market regulations from customs rules.\n\nFinal Offer?\n\nIf Johnson intends it to be a take-it-or-leave-it offer rather than the basis for the start of a negotiation that sees the U.K. move much closer to the EU position, the bloc will start working on the terms of another Brexit delay and continue planning for the likelihood of a no-deal Brexit, one official said.\n\nDavid Frost, the prime minister’s EU envoy, will arrive at the European Commission mid-afternoon with copies of the plan for Michel Barnier, the EU’s chief Brexit negotiator, and his team.\n\nEuropean Commission President Jean-Claude Juncker is then expected to speak to German Chancellor Angela Merkel and Johnson by phone later on Wednesday. After a few hours of scrutiny, EU officials will brief and discuss the U.K. plan with diplomats from the EU’s 27 remaining countries.", "description": "(Bloomberg) -- Follow @Brexit and sign up to our Brexit Bulletin. Boris Johnson outlined his plan for a new Brexit agreement, and warned the European Union to compromise or watch the U.K. walk away from talks and leave the bloc without a deal.The U.K. prime minister declared that Britain is “ready” to", "authors": ["Tim Ross", "Ian Wishart"], "top_image": "https://s.yimg.com/uu/api/res/1.2/IpJu.AE4sh7mN11owgCS4g--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/video/bloomberg_politics_video_969/bb0e91e39ba3292c1c092e47fa21cbda"}