{"pub": "fox", "url": "https://foxnews.com/us/second-round-of-power-outages-begin-in-california-amid-wildfire-concerns", "downloaded_at": "2019-10-24 02:32:06.398270+00:00", "title": "Second round of power outages begins in California amid wildfire concerns", "language": "en", "text": "California's largest energy provider began another deliberate blackout Wednesday amid concerns of strong winds that could spark wildfires that have devasted communities across the states in recent years.\n\nPacific Gas & Electric Co. said the 48-hour power outage was to affect nearly 180,000 homes and businesses in portions of 17 counties in the Sierra foothills and north of the San Francisco Bay Area.\n\nThe Santa Rosa Fire Department tweeted that shutoffs had started in the city and it was getting multiple reports of outages.\n\n\"Public Safety Power Shutoffs have begun in Santa Rosa. We have multiple reports of outages from the Rincon Valley and Oakmont Areas,\" the department wrote.\n\nThe utility previously cut off power from Oct. 9-12 to more than 2 million people across the Bay Area to prevent high winds from toppling lines that could then spark deadly wildfires like one that did massive amounts of damage last year.\n\nPG&E BEGINS 2ND WAVE OF CALIFORNIA PLANNED POWER OUTAGES TO HEAD OFF WILDFIRE RISK\n\nThe new rolling blackouts have elicited frustration from residents and business owners and have spurred purchases of batteries, generators and other emergency supplies.\n\n\"Working this close to the last outage is going to be a true trial by fire,\" said Garrett Sanders, owner of Love Birds Coffee & Tea in the old Gold Rush town of Placerville.\n\nSanders said he lost around $6,000 in the last outage. He said he planned to brew coffee and stock up on pastries for a sidewalk sale.\n\nHe sympathized with the argument that the outages are designed to prevent more devastating wildfires. Some Placerville residents relocated from Paradise, a town leveled by last year's fast-moving Camp Fire.\n\nNot everyone is as understanding, however. Angry customers took things further in the earlier power outage, with a PG&E office in Oroville vandalized with eggs.\n\nAuthorities were also investigating an attack in which a PG&E utility truck was shot in Colusa County, and the wife of one utility worked pleaded with the public to not lash out at workers.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nCalifornia Gov. Gavin Newsom said in a letter to Bill Johnson, PG&E's CEO, the utility has failed to upgrade and maintain its equipment, resulting in the massive blackouts and the inconvenience to customers.\n\n\"I believe the unacceptable scope and duration of the previous outage — deliberately forcing 735,000 customers to endure power outages — was the direct result of decades of PG&E prioritizing profit over public safety,\" Newsom wrote\n\nPG&E has denied the blackouts are about saving money in the wake of a string of lawsuits over its role in last year's fires.\n\nFox News' Travis Fedschun and The Associated Press contributed to this report.", "description": "California's largest energy provider began another blackout Wednesday amid concerns of strong winds that could spark wildfires.", "authors": ["Louis Casiano"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/AP19296822530846.jpg", "published_at": "2019-10-23"}