{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/democrats-post-text-impeachment-resolution-showdown-vote-thursday/story?id=66616704", "downloaded_at": "2019-10-30 00:04:19.486756+00:00", "title": "Democrats post text of impeachment resolution, showdown vote as soon as Thursday", "language": "en", "text": "House Democrats on Tuesday posted the text of an resolution laying out the process for the public phase of the impeachment inquiry, a measure Speaker Nancy Pelosi has primed for a full House showdown vote on Thursday.\n\nInterested in Impeachment Inquiry? Add Impeachment Inquiry as an interest to stay up to date on the latest Impeachment Inquiry news, video, and analysis from ABC News. Add Interest\n\nThe text posted Tuesday afternoon, directs \"certain committees to continue their ongoing investigations as part of the existing House of Representatives inquiry into whether sufficient grounds exist for the House of Representatives to exercise its Constitutional power to impeach Donald John Trump, President of the United States of America, and for other purposes.\"\n\nIt also formally empowers the House Judiciary Committee with the ultimate ability to report articles of impeachment to the full House of Representatives \"as it deems proper.\" Articles of impeachment are just one potential course of action, as the committee could also refer a resolution of censure to the House in lieu of or to compliment articles of impeachment.\n\nAndrew Caballero-reynolds/AFP via Getty Images, FILE\n\nWhile Pelosi's move was designed to remove grounds for Republican objections, the White House was quick to reject it.\n\n\"The resolution put forward by Speaker Pelosi confirms that House Democrats’ impeachment has been an illegitimate sham from the start as it lacked any proper authorization by a House vote,\" White House press secretary Stephanie Grisham said in a statement.\n\n\"This resolution does nothing to change the fundamental fact that House Democrats refuse to provide basic due process rights to the Administration,\" she said in part.\n\nThe resolution empowers House Intelligence Committee Chairman Adam Schiff with the responsibility to “designate an open hearing or hearings,” where the Republicans and Democrats will have “equal specified periods of longer than five minutes,” to question witnesses.\n\nIt also states there could be multiple periods of questions, but “not exceeding 90 minutes in the aggregate.” That means the Democratic chair, Schiff, and the ranking Republican. Rep. Devin Nunes, may yield time to Intelligence Committee staff, totaling up to 45 minutes each when counted up with their own questions. Rank and file members are limited to five-minute question periods.\n\nNunes could propose minority witnesses, but it’s up to Schiff to grant access and determine whether the potential witness is “relevant to the investigation.”\n\nIf Schiff concurs, Nunes could also issue subpoenas for witnesses, and is authorized to seek the production of “books, records, correspondence, memoranda, papers and documents.”\n\nIf Schiff denies a proposed action by Nunes, he could appeal to the full committee, where Democrats hold a 13-9 edge in membership - essentially guaranteeing that Democratic rule will dominate the process.\n\nAs chairman, Schiff is also authorized to post electronic copies of transcripts of depositions conducted by the Intelligence Committee, although the transcripts could include redactions of classified and sensitive information.\n\nThe Intelligence Committee is directed to issue a report to the Judiciary Committee on its findings as well as any potential recommendations.\n\nThe resolution “authorizes the Committee on the Judiciary to conduct proceedings relating to the impeachment inquiry,” including such procedures “as to allow for the participation of the President and his counsel.”\n\nLike the rules for public hearings at the Intelligence Committee, the resolution authorizes Judiciary to “promulgate additional procedures as it deems necessary for the fair and efficient conduct of committee hearings,” consistent with procedures and rules of the House. It also gives the Judiciary ranking Republican, Rep. Doug Collins, the power to subpoena, but that power is subject to the approval of Judiciary Chairman Jerry Nadler.\n\nA quartet of Democratic chairs leading the impeachment inquiry explained that the resolution will provide a pathway forward to hear from witnesses in an open hearing, set the parameters of the process and establish authorization to release deposition transcripts, transfer evidence to judiciary, and provide the president with “due process.”\n\n“The evidence we have already collected paints the picture of a President who abused his power by using multiple levers of government to press a foreign country to interfere in the 2020 election. Following in the footsteps of previous impeachment inquiries, the next phase will move from closed depositions to open hearings where the American people will learn firsthand about the President’s misconduct.”\n\nBut it's unclear whether there are sufficient votes from Democrats to pass the resolution on their own.\n\n“We have to consider whether or not it’s ready to go Thursday,” House Majority Leader Steny Hoyer told reporters at a briefing in his office Tuesday morning, adding he “hopes” it’s done because it would “facilitate the next steps” of the Democratic inquiry.\n\nAfter the president and GOP pressed for a full House vote to authorize the Democratic impeachment inquiry, House Republicans say they will not cooperate with Democrats to approve the resolution, arguing the impeachment process has been tainted by Democratic rule on the closed-door depositions to date.\n\nRep. Tom Cole, the senior Republican on the House Rules Committee where the resolution is expected to face a hearing as soon as Wednesday, said Republicans are in a wait-and-see mode, stressing they’ve been party to no discussions or negotiations.\n\nHoyer and Pelosi have also tried to argue that the potential vote is not on whether to authorize a formal impeachment inquiry but rather a vote to transparently demonstrate the process by which the public elements of the inquiry would play out in the coming weeks.\n\nHouse Minority Whip Steve Scalise has called the Democrat-led inquiry a “Soviet process,” and complained that 75 percent of lawmakers representing 230 million Americans haven’t been able to participate in the proceedings so far. He further expressed frustration that Republicans can’t call witnesses, and said the process is “not rooted in fairness.”\n\nRepublicans panned the resolution in a letter to the House Rules Committee, accusing Democrats of working to \"retroactively legitimize\" their impeachment efforts.\n\n“No matter how hard you try to legitimize this sham impeachment inquiry, it cannot hide the Democrats’ goal of re-litigating the results of the 2016 presidential election,\" Reps. Jim Jordan, Nunes and Mike McCaul, the top Republicans on the House Oversight, Intelligence, and Foreign Affairs Committees respectively, wrote.\n\nABC News' Benjamin Siegel contributed to this report.", "description": "Democrats on Tuesday prepare to move into the public phase of impeachment inquiry ahead of a showdown full House vote as soon as Thursday.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/pelosi-getty-aa-191009_hpMain_16x9_992.jpg", "published_at": "2019-10-29"}