{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/brexit-deal-talks-close-breakdown-20534884", "downloaded_at": "2019-10-08 10:00:02.460901+00:00", "title": "Brexit deal talks close to breakdown as No10 plunge into blame game and threats", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nBrexit deal talks look close to breakdown after Downing Street and EU sources released 'private' briefings that plunge both sides into a bitter blame game.\n\nThe vicious briefings come as Boris Johnson has just days left to agree a Brexit deal before a crunch summit of 28 leaders on October 17.\n\nThe PM unveiled his \"reasonable compromise\" last week to rewrite the Brexit deal to ditch the Irish backstop - instead having a system of two borders in the region.\n\nBut he refuses to publish the full legal text and the EU have refused to enter into detailed talks.\n\nToday the BBC reports specific objections to the plan within the EU. Brussels chiefs are said to be \"nonplussed\" at a line in the legal text that asks them to rule out checks on the Irish border.\n\nThey are angry because Boris Johnson's own deal does not guarantee a lack of checks. Instead the Stormont Assembly would be given a veto over future trading rules with the Republic.\n\n(Image: Getty Images)\n\nThe BBC claims EU chiefs were so shocked by the proposal that they asked if it was a mistake.\n\nMeanwhile, however, a scathing verdict on progress over Brexit has been leaked to the right-wing Spectator website by a \"contact\" inside 10 Downing Street.\n\nThe briefing - not disowned by No10 officials - says \"if this deal dies in the next few days, then it won’t be revived\" and any sincere co-operation \"will be in the toilet\".\n\nAnd it claims EU countries that back a delay to Brexit will be punished by being sent to the \"bottom of the queue\" for a future trade deal.\n\nThe briefing says: \"We will make clear privately and publicly that countries which oppose delay will go the front of the queue for future cooperation.\n\n\"Those who support delay will go to the bottom of the queue\".\n\n(Image: REUTERS)\n\nThe hardline statement comes despite the fact it will take the agreement of all 27 other EU leaders to delay Brexit.\n\nThe briefing claims Britain will do \"all sorts of things\" to scupper a delay to Brexit, forcing either no-deal on October 31 or no-deal after an election, the briefing claims.\n\nThat is despite MPs passing a law last month that forces Boris Johnson to ask for a Brexit delay on October 19, if there's no agreement at the EU summit.\n\nThe briefing plays the blame game, claiming Irish Premier Leo Varadkar has \"gone very cold\" and \"attacked us publicly\" since MPs passed their law on delaying Brexit.\n\nThe briefing moans: \"There are quite a few people in Paris and Berlin who would like to discuss our offer.\n\n\"But Merkel and Macron won’t push Barnier unless Ireland says it wants to negotiate. Those who think Merkel will help us are deluded.\"\n\n(Image: Getty)\n\nIt adds: \"To marginalise the Brexit Party, we will have to fight the election on the basis of 'No more delays, get Brexit done immediately'.\n\n\"Those who pushed the Benn Act intended to sabotage a deal and they've probably succeeded.\n\n\"So the main effect of it will probably be to help us win an election by uniting the leave vote and then a no-deal Brexit. History is full of such ironies and tragedies.\"\n\nTransport Secretary Grant Shapps denied Britain was \"threatening\" other countries with no-deal but refused to discuss the briefing today.\n\nFormer Tory Cabinet minister Amber Rudd, who left the party over Boris Johnson's stance, said the \"angry and desperate\" briefing probably came from top aide Dominic Cummings.\n\nThe belligerent Brexiteer, effectively the PM's chief of staff, is infamous in Westminster for his rambling blog posts. The briefing to the Spectator was 827 words long.\n\n(Image: PA)\n\nFrench President Emmanuel Macron has warned that the workings of a deal need to be in place by Friday if there is to be an agreement at the EU summit next week in Brussels.\n\nDowning Street has said the comments were not \"helpful\" and urged Brussels to match the concessions made by the Prime Minister.\n\nHowever, former premier David Cameron, speaking to The Times editor John Witherow at an event to promote his memoirs, said Mr Johnson may have to give more ground to get an agreement.\n\n\"The answer, I suspect, is now compromise on both sides,\" he told the audience at the Barbican Centre in London on Monday.\n\n\"Boris is compromising and I suspect may have to move a bit more. And the EU should compromise too.\"\n\nMr Cameron also said Mr Johnson could not ignore the Benn Act, which requires him to ask the EU for a further delay to Brexit if he cannot get a deal by October 19.\n\n\"You can't disobey the law as Prime Minister,\" he said.", "description": "Downing Street is threatening to send EU countries to the 'bottom of the queue' and throw co-operation in the 'toilet' in an 'angry and desperate' briefing as time runs out", "authors": ["Dan Bloom", "Image", "Getty Images", "Reuters", "Getty", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20535043.ece/ALTERNATES/s1200/0_NHS-funding.jpg", "published_at": "2019-10-08"}