{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Living/start-planning-epic-halloween-party-tips-celebrity-party/story?id=66161029", "downloaded_at": "2019-10-15 09:43:03.636590+00:00", "title": "Start planning an epic Halloween party with these tips from a celebrity party planner", "language": "en", "text": "Edward Perotti is who celebrities including Ariana Gande and Nick Jonas call when they want to throw an epic party.\n\nPerotti has been in event production for more than 28 years, planning celebrity parties and weddings, including more than 2,000 events around the world last year alone.\n\n\"I'm in the business of people, my job is to bring people together,\" Perotti told \"Good Morning America.\"\n\nNow that it's officially Halloween season, Perotti is sharing his advice on how to throw a picture-perfect Halloween party.\n\nWhen it comes to the Halloween parties this year he says people are keeping their parties on the fun side instead of scary, \"people aren't really going for dark, they're not going overly spooky.\"\n\nHere, Perotti shares his his recommendations for how to have an epic party this Halloween.\n\n1. Start with your table\n\nI always start with my table.\n\nWhen starting to plan your party, start with your table and decor, and work your way out.\n\nWhen you look at the bigger picture, it gets very overwhelming.\n\nLook at your table, create your table idea, and then look out at your house and find things that tie in.\n\n2. Use fake pumpkins\n\nUse craft pumpkins instead of the real thing. Craft pumpkins can be painted to go with whatever theme you want for your party.\n\nThe best part is you can paint them ahead of time so you don't feel overwhelmed -- and you can reuse them year after year, so you'll only need to buy them once. It's a better investment to buy a slew of different-sized, fake pumpkins and repaint them every year.\n\nIf you are using real pumpkins, don't carve them so they last longer.\n\n3. Avoid going store-bought and don't duplicate\n\nWhen it comes to hosting the best party, you want some personality behind it. I want to know who the host is, what the reason is for the party.\n\nIf you buy everything from the store, it's generic and there's no host personality in it. You can buy some things from the party store, but it's best to put your own unique spin on the party and use decorations that no one else will have.\n\nIf there were no party stores, what would you do? What speaks to the kids? What speaks to you? And then just kind of play with it.\n\nTake a step back, make a cup of coffee, pour a glass of wine, and just think what can you do.\n\nHalloween and Christmas have become the most duplicated design ideas by people.\n\nIt's good to get inspiration online, but when you try and recreate something exactly, it never works out. In 28 years, I've never done the same event twice.\n\nFind what you like about the picture or design. Take it and make it your own.\n\nCourtesy Edward Perotti\n\n4. Make a branded photo area\n\nIf you're doing the photo booth, check in to see whether or not you can control the background. Can you brand it?\n\nYou want to give your guests a moment to remember. Pre-print a hashtag or props for the photos.", "description": "Celebrity party and wedding planner Edward Perotti gives tips for throwing a Halloween party.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/1011124355-MAIN_hpMain_16x9_992.jpg", "published_at": "2019-10-15"}