{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/5/england-reach-world-cup-quarters-after-beating-14-", "downloaded_at": "2019-10-05 12:26:20.370347+00:00", "title": "England reach World Cup quarters after beating 14-man Pumas", "language": "en", "text": "TOKYO (AP) - Four years after being humiliated at its home Rugby World Cup, England was first into the quarterfinals in Japan after beating 14-man Argentina 39-10 on Saturday.\n\nEngland and old rival France will meet next weekend to decide the winner of Pool C.\n\nArgentina’s earliest exit from a Rugby World Cup in 16 years will become official on Sunday should France beat Tonga in Kumamoto, as expected.\n\nEngland failed to reach the knockout stage in 2015, the first tournament host to be eliminated in the group stage, and its victory on Saturday was eased in Tokyo Stadium when Argentina lock Tomas Lavanini was sent off in the 18th minute.\n\nIn a week in which three others have been red-carded for dangerous tackles, Lavanini inexplicably led with his left shoulder into the neck of England flyhalf Owen Farrell. Lavanini became the second Puma to be sent off in the Rugby World Cup after Pedro Sporleder in 1991.\n\nAt that point, the match was on edge. The players had just come from a midfield fight after Farrell was late-tackled by Argentina captain Pablo Matera.\n\nBut the red card sucked all the tension out of the contest, enough that England, leading 5-3, couldn’t score until the end of the first half.\n\nBut when it did finally score its second try near the end of the first half, it settled. England finished with six tries and a bonus point, while conceding only its second try in three pool wins.\n\nA rousing run by Pumas wing Matias Moroni earned a penalty for Benjamin Urdapilleta, but England replied quickly with an attempted rolling maul try. England’s 11 pushing eight was stopped, though, and flyhalf George Ford ran the short side and drew both defenders to send over Jonny May untouched.\n\nMoments after Lavanini was marched, Argentine fans whistled for a card for Manu Tuilagi, who tackled Argentina’s Emiliano Boffelli in the air. But referee Nigel Owens penalized Tuilagi for only “a timing issue,” adding Boffelli had a foot on the ground.\n\nWith Lavanini out, England’s set-piece firmed up after being shaken, and they played the phases. When the forwards couldn’t get it in, Youngs gave it to fullback Daly, who blew around Boffelli and went over.\n\nIn injury time, England went through 18 phases, and Argentina was so tired that Youngs eventually crossed untouched to make it 15-3 at halftime.\n\nFarrell, who took a serious head knock from Lavanini, missed converting all three tries and a penalty in the first half. But he found his range in the second half and converted all three tries.\n\nThe effort to keep England out sucked the energy from Argentina. The Pumas had to make 97 tiring tackles in the first half and 55 in the second as England exploited their tiring opponents and went wider.\n\nFord scored the fourth try after Tuilagi shortened the defense by bowling in three defenders, Jack Nowell scored the fifth beating three defenders in a great run along the right touchline, and replacement hooker Luke Cowan-Dickie scored the sixth from a rolling maul that the prideful Pumas took umbrage at, causing one last melee.\n\nThe Pumas kept their heads up, and England honest, and scored a fine try themselves executing a move involving five intricate passes to allow Moroni to dive over near the posts. It was small consolation.\n\n___\n\nMore AP Rugby World Cup: https://www.apnews.com/RugbyWorldCup and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Four years after being humiliated at its home Rugby World Cup, England was first into the quarterfinals in Japan after beating 14-man Argentina 39-10 on Saturday.", "authors": ["The Washington Times Http", "Foster Niumata"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/05/aptopix_japan_rugby_wcup_england_argentina_82391_c0-83-5032-3016_s1770x1032.jpg?189f17efe7328234ac0a059ff9aeff903efc9bbb", "published_at": "2019-10-05"}