{"pub": "news24", "url": "https://city-press.news24.com/Sport/some-football-players-are-just-injury-prone-or-simply-unlucky-20191023", "downloaded_at": "2019-10-23 23:34:53.415841+00:00", "title": "Some football players are just injury-prone or simply unlucky", "language": "en", "text": "Sport Some football players are just injury-prone or simply unlucky\n\nCould Oupa Manyisa’s latest setback signal the beginning of the end for the talented midfielder nicknamed Ace? The Mamelodi Sundowns schemer has suffered yet another career-threatening injury, this time snapping an Achilles tendon that will require surgery to repair – with possibly a long spell on the sidelines.\n\nHowever, the player from Mohlakeng township in Randfontein on the West Rand, will find comfort in the words of his coach Pitso Mosimane.\n\n“Oupa knows that at Sundowns we don’t say ‘wena go fedile’ [it’s over] – we support our players,” Mosimane told City Press.\n\nManyisa broke down midway through the first half of the Shell Helix Ultra Cup against Kaizer Chiefs last weekend.\n\n“Cuthbert Malajila had long-term injuries but we stayed with him. When was the last time [Anthony] Laffor played? He’s forever out [injured] every year for six to seven months but when he comes out, he’s a different player.”\n\nMosimane classified Manyisa among those he believes were simply unlucky with injuries. “It’s a fine line whether you’re unlucky or injury-prone. With Oupa and Riva [Rivaldo Coetzee] sometimes it’s bad luck.\n\n“But I also don’t want to live on luck. I also believe [that] if you work hard on your body, you are less likely to get injured. So you’ve got to strengthen weak muscles. There’s no better example than NBA players, who play every two days in addition to long travel but they are forever in the gym,” said Mosimane, an ardent fan of NBA’s Western Conference side Golden State Warriors.\n\n“But at the end of the day when you sum it up, football is a professional sport that is linked with injuries because it’s a high intensity game. Players are talking about ‘thanks God, I hope I don’t get injured this year’.” Mosimane added that coaches were part of the training programme and warned that “if you overload [players] then they’ll get injuries”.\n\nChiefs coach Ernst Middendorp has also had a fair share of setbacks in his squad. The German said this week that utility player Joseph Molangoane won’t play a competitive game anytime soon.\n\nMolangoane has endured an injury-ravaged four years with two leg breaks in that period. Keeper Itumeleng Khune has also been injury-prone.\n\nSometimes, the age factor comes into play when comparing the nature and severity of injuries in players. Renowned sports physician Dr Ephraim Nematswerani has done extensive research on this and provided extracts from some of his articles published in The SA Journal of Sports Medicine in September 2005.\n\n“Older professional soccer players are significantly more likely to sustain an injury than younger players,” noted Nematswerani, who at the time was a team doctor for Moroka Swallows, the SA Under-23s as well as a medical officer for Team SA for multicoded games.\n\n“This study also found that the older players sustained a higher percentage of more severe injuries, while the younger players were more likely to have slight injuries that did not result in long time off training or competition.”\n\nHowever, there have been cases where players’ setbacks have set them up for a greater comeback. One such case is that of former Orlando Pirates defender Benson Mhlongo.\n\nA horrific knee injury in 2009 sidelined him for nine months but he bounced back in a spectacular way, helping the now defunct Platinum Stars win two cups in 2013 – the MTN8 and the Telkom Knockout.\n\nOn the international front, world football is still in awe on how former Arsenal ace Santi Cazorla has resurrected his career at Villarreal in La Liga after two years on the sidelines.\n\nThe Spaniard was almost confined to the scrap heap after an infection ate into his Achilles tendon.\n\nCazorla, who turns 35 in December, scooped player of the season on his comeback last season and, even more remarkably, he was recalled to represent Spain in May, three-and-a-half-years since his last appearance in the national team.\n\nSimilarly, Coetzee has been fighting his way back to the top and he was on the cusp of a Bafana return at the Afcon but he withdrew from the provisional squad to attend to a family matter.", "description": "As much as injuries are part of football, certain players just seem to be more injury-prone, while others are followed by bad luck, writes Daniel Mothowagae.", "authors": ["Daniel Mothowagae"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9376/ea959aa75c0f4eca837a152b8f57ebf2.jpg", "published_at": "2019-10-23"}