{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/breaking-tashan-daniel-two-men-20469373", "downloaded_at": "2019-10-05 22:55:50.465200+00:00", "title": "Tashan Daniel: Two men, 21 and 19, charged with murder of Arsenal fan", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nTwo men have been charged with the murder of an Arsenal fan who had been on his way to watch the team when he was stabbed to death.\n\nAlex Lanning, 21, of Uxbridge, and Jonathan Camille, 19, of Kensington, have both been charged with murdering Tashan Daniel , British Transport Police said in a statement this evening.\n\nThey will both appear in court on Monday.\n\nAn 18-year-old woman from West Drayton, who was arrested on suspicion of assisting an offender, has been released under police investigation.\n\nTashan, 20, was on his way to watch Arsenal play Nottingham Forest on September 24 when he was stabbed to death at Hillingdon London Underground station.\n\nHe had received the tickets two days earlier for his 20th birthday.\n\n(Image: PA)\n\n(Image: Facebook)\n\nBefore leaving for the game he had lunch with his mum and took his granddad to a taster session at a day care centre.\n\nDad Chandy added: \"He swapped an appointment around because he knew how important it was to the family. He put his Arsenal shirt on, I was doing something on the computer and he was helping me.\n\n\"He was short on time - he ruffled my hair, gave me a kiss on the cheek and that's the last time he left home.\"\n\nMembers of the public as well as paramedics and police officers tried to save the aspiring athlete, but he died on board a Tube carriage.\n\n(Image: PA)\n\nTashan's mum Celia arrived at the station minutes after the stabbing but was stopped from immediately going down until police officers realised who she was.\n\nCelia, 48, said: \"Paramedics shook their head and I knew he was gone, I collapsed but I begged him, 'could I please hold his hand'.\"\n\nShe was allowed to hold his hand \"for a tiny second\".", "description": "Alex Lanning, 21, of Uxbridge, and Jonathan Camille, 19, of Kensington, have both been charged with murder", "authors": ["Tom Davidson", "Image", "Facebook", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20175841.ece/ALTERNATES/s1200/0_Tashan-Daniel.jpg", "published_at": "2019-10-05"}