{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/zimbabwe-55-elephants-died-starvation-drought-191022055032175.html", "downloaded_at": "2019-10-22 13:29:30.485750+00:00", "title": "Zimbabwe says 55 elephants died from starvation after drought", "language": "en", "text": "At least 55 elephants have died in a wildlife reserve in western Zimbabwe since September from starvation caused by severe drought.\n\nZimbabwe Parks and Wildlife Management Authority (Zimparks) spokesman Tinashe Farawo said the animals perished near waterholes dotted around the Hwange National Park, a sign they travelled long distances to access water.\n\nInvestigations showed at least 55 elephants died from lack of food and water in the park, which holds the biggest elephant herd of 50,000 animals.\n\n\"The situation is dire. The elephants are dying from starvation and this is a big problem,\" Farawo said.\n\nFarawo said there was \"massive destruction\" of vegetation in Hwange caused by elephants, which were also foraying in villages near the game park, increasing human-wildlife conflict.\n\nMore than 200 people have died from elephant attacks in the past five years, according to Zimparks.\n\nThe agency was looking to drill more boreholes in Hwange because some existing ones had dried up but it lacked the money, said Farawo. The agency does not get funding from the government.\n\nAnimals for sale\n\nZimbabwe has in the past sold baby elephants to China saying it needed the money for conservation in Hwange, where the elephant population is three times the park's carrying capacity.\n\nIn 2016, Zimbabwe put its wild animals up for sale, saying it needed buyers to step in and save the beasts from another devastating drought.\n\nWith support from neighbours Botswana, Namibia, and South Africa, Zimbabwe failed to lobby the Convention on International Trade in Endangered Species (CITES) to lift a ban on ivory trade at a meeting in August.\n\nZimbabwe says its ivory stockpile is worth $300m, money it can use for conservation.\n\nEl Nino-induced drought has cut maize output by more than half in the country, leaving one-third of the human population also needing food aid.", "description": "The animals died near waterholes dotted around the Hwange National Park.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/22/c2bba917d335478aa361c135ef3548e6_18.jpg", "published_at": "2019-10-22"}