{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/10-things-you-need-to-know-before-the-opening-bell-1028579762", "downloaded_at": "2019-10-07 12:15:04.313244+00:00", "title": "10 things you need to know before the opening bell", "language": "en", "text": "Andy Wong/AP Photo\n\nHere is what you need to know.\n\n1. Stocks are dropping after China reportedly signals it will take a tougher stance in trade-war talks this week. The tougher stance could narrow the scope of a potential agreement to end the trade war between the world's two largest economies.\n\n2. HSBC is reportedly planning to axe 10,000 jobs amid a brutal year for global bank workers. The Financial Times reported that most of the jobs being cut will be at the higher levels of the bank.\n\n3. The founder of SoftBank-backed hotel startup Oyo is buying back shares in his company in a $1.5 billion deal. The deal comes as Oyo faces intensifying media scrutiny over its budget hotel platform, and after the canned IPO of another SoftBank-backed property firm, WeWork.\n\n4. An NBA executive is facing major backlash in China after tweeting support for the Hong Kong protests. Daryl Morey, the general manager of the Houston Rockets, voiced support for the demonstrations.\n\n5. Deutsche Bank is creating a new technology division in a strategy shift designed to reduce complexity and lower costs while transforming systems that have held back the bank for years. Its legacy IT systems have been blamed in part for the bank's failure to control costs and for its slow progress in keeping up with the wave of fintech innovation across the industry.\n\n6. SoftBank CEO Masayoshi Son says he is \"embarrassed and flustered\" by his recent track record. \"When I look at the growth of US and Chinese companies, I feel strongly it's not good enough,\" Son said in an interview with Nikkei Business magazine.\n\n7. \"Joker\" had the biggest October opening weekend ever, taking in $93.5 million. The record-breaking weekend intake means Warner Bros has already made back the movie's production budget, which was north of $60 million.\n\n8. Stocks are edging down on Monday. US futures underlying the S&P 500 (-0.3%) and Nasdaq (-0.3%) are falling. Europe opened on the up with the DAX (+0.4%) and Euro Stoxx (+0.4%) both rising. Asia closed mixed, with the Nikkei (-0.2%) down and the Korean KOSPI (+0.1%) up. Chinese markets are closed for holidays.\n\n9. There are several earnings out later. Fashion label Levi's is the highlight.\n\n10. Today is a quieter day for data. Federal Reserve Chair Jay Powell is expected to speak at 1 p.m.", "description": "Here is what you need to know.  1. Stocks are dropping after China reportedly signals it will take a tougher stance in trade-war talks this week. The ...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d9b11275288792e155aa8e0-1620/donaldtrumpchinatradewar.jpg", "published_at": "2019-10-07"}