{"pub": "independent", "title": "Vasyl Lomachenko vs Luke Campbell fight result: Ukrainian beats Briton by unanimous decision to unify WBC, WBA and WBO lightweight titles", "url": "https://independent.co.uk/sport/general/boxing/vasyl-lomachenko-vs-luke-campbell-fight-result-stream-fight-stream-scorecard-latest-video-next-fight-a9087146.html", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:48:02.047492+00:00", "text": "The majestic Vasyl Lomachenko produced a relentless barrage of body shots to outclass Luke Campbell and retain his world titles.\n\nPrevailing on points (119-108, 119-108, 118-109) failed to tell the story though, as Campbell’s resilience to rise from the canvas in the 11th and the Ukrainian’s beauty thrilled a sold out O2. The champion kept his WBA and WBO lightweight titles and picked up the vacant WBC belt to move closer to the undisputed status at 135 pounds that he will surely clinch next year.\n\nHaving left Anthony Crolla mesmerised earlier this year, it was Campbell’s turn to try crack the code and show signs that the brilliant Ukrainian is indeed human.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe Hull man had already displayed resilience entering the bout, having pushed another victim of Lomachenko’s, Jorge Linares, two years ago just weeks after his father passed away.\n\nHis second crack at a world title would come seven years after both fighters’ paths crossed at London 2012, with both shining on their way to gold. But while ‘Loma’ has surged to the pinnacle of the professional game, Campbell has taken a more arduous route, prevailing after a setbacks against Yvan Mendy and Linares to earn his shot at testing the world's best.\n\nShape Created with Sketch. Lomachenko vs Campbell in pictures Show all 33 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Lomachenko vs Campbell in pictures 1/33 Lomachenko vs Campbell WBA and WBO lightweight champion Vasyl Lomachenko makes his way to the ring. Getty Images 2/33 Lomachenko vs Campbell The Ukrainian is a fan favourite even in the United Kingdom. PA 3/33 Lomachenko vs Campbell Lomachenko was looking to add the vacant WBC belt to his collection. PA 4/33 Lomachenko vs Campbell Luke Campbell makes his way to the ring inside the O2 Arena. PA 5/33 Lomachenko vs Campbell Campbell made a low-key entrance compared to Lomachenko. PA 6/33 Lomachenko vs Campbell Campbell appeared calm and focussed on the fight. PA 7/33 Lomachenko vs Campbell Campbell enjoyed early success in round one. Getty Images 8/33 Lomachenko vs Campbell But Lomachenko provided reminders of his dangers. Action Images via Reuters 9/33 Lomachenko vs Campbell Despite the reach advantage, Loma was able to land shots. Action Images via Reuters 10/33 Lomachenko vs Campbell And cracked Campbell with a right hook in round two. Action Images via Reuters 11/33 Lomachenko vs Campbell Campbell refused to be bullied through and gave as good as got. PA 12/33 Lomachenko vs Campbell The Briton was able to land on occasion. Action Images via Reuters 13/33 Lomachenko vs Campbell But each time Lomachenko would fight back with gusto. Action Images via Reuters 14/33 Lomachenko vs Campbell The fight became a tactical yet frantic affair. Action Images via Reuters 15/33 Lomachenko vs Campbell Lomachenko was able to win most of the heavy exchanges. Action Images via Reuters 16/33 Lomachenko vs Campbell Hos jab kept Campbell honest as they moved into the second quarter. PA 17/33 Lomachenko vs Campbell But still Campbell refused to budge and tried to attack in the fifth. Getty Images 18/33 Lomachenko vs Campbell Lomachenko countered beautifully and went on the attack. Action Images via Reuters 19/33 Lomachenko vs Campbell A barrage of body shots in the fifth nearly ended the fight. Getty Images 20/33 Lomachenko vs Campbell Campbell was clearly hurt as he went back to his corner. Action Images via Reuters 21/33 Lomachenko vs Campbell But miraculously the Briton came out swining in the sixth. Action Images via Reuters 22/33 Lomachenko vs Campbell He even looked to have Lomachenko hurt in the sixth round. Getty Images 23/33 Lomachenko vs Campbell But as the final rounds wore on, Loma ground down his opponent. Getty Images 24/33 Lomachenko vs Campbell A brutal barrage send Campbell down tot he canvas in the 11th. Getty Images 25/33 Lomachenko vs Campbell The knockdown put the cherry on the performance. Action Images via Reuters 26/33 Lomachenko vs Campbell Campbell looked to be heading for a premature exit. Action Images via Reuters 27/33 Lomachenko vs Campbell But he took the eight count from referee Victor Loughlin and rose to his feet. Action Images via Reuters 28/33 Lomachenko vs Campbell Loughlin was happy for Campbell to continue. Getty Images 29/33 Lomachenko vs Campbell Lomachenko resumed the assault over the final four minutes. Action Images via Reuters 30/33 Lomachenko vs Campbell Lomachenko complained about a low blow from Campbell in the final round. Action Images via Reuters 31/33 Lomachenko vs Campbell But the two embraced on the final beel as the crowd cheered and gave both a standing ovation. Getty Images 32/33 Lomachenko vs Campbell Lomachenko looked confident of victory. Getty Images 33/33 Lomachenko vs Campbell And so it proved as he clinched a 119-108, 119-108, 118-109 unanimous decision. Action Images via Reuters 1/33 Lomachenko vs Campbell WBA and WBO lightweight champion Vasyl Lomachenko makes his way to the ring. Getty Images 2/33 Lomachenko vs Campbell The Ukrainian is a fan favourite even in the United Kingdom. PA 3/33 Lomachenko vs Campbell Lomachenko was looking to add the vacant WBC belt to his collection. PA 4/33 Lomachenko vs Campbell Luke Campbell makes his way to the ring inside the O2 Arena. PA 5/33 Lomachenko vs Campbell Campbell made a low-key entrance compared to Lomachenko. PA 6/33 Lomachenko vs Campbell Campbell appeared calm and focussed on the fight. PA 7/33 Lomachenko vs Campbell Campbell enjoyed early success in round one. Getty Images 8/33 Lomachenko vs Campbell But Lomachenko provided reminders of his dangers. Action Images via Reuters 9/33 Lomachenko vs Campbell Despite the reach advantage, Loma was able to land shots. Action Images via Reuters 10/33 Lomachenko vs Campbell And cracked Campbell with a right hook in round two. Action Images via Reuters 11/33 Lomachenko vs Campbell Campbell refused to be bullied through and gave as good as got. PA 12/33 Lomachenko vs Campbell The Briton was able to land on occasion. Action Images via Reuters 13/33 Lomachenko vs Campbell But each time Lomachenko would fight back with gusto. Action Images via Reuters 14/33 Lomachenko vs Campbell The fight became a tactical yet frantic affair. Action Images via Reuters 15/33 Lomachenko vs Campbell Lomachenko was able to win most of the heavy exchanges. Action Images via Reuters 16/33 Lomachenko vs Campbell Hos jab kept Campbell honest as they moved into the second quarter. PA 17/33 Lomachenko vs Campbell But still Campbell refused to budge and tried to attack in the fifth. Getty Images 18/33 Lomachenko vs Campbell Lomachenko countered beautifully and went on the attack. Action Images via Reuters 19/33 Lomachenko vs Campbell A barrage of body shots in the fifth nearly ended the fight. Getty Images 20/33 Lomachenko vs Campbell Campbell was clearly hurt as he went back to his corner. Action Images via Reuters 21/33 Lomachenko vs Campbell But miraculously the Briton came out swining in the sixth. Action Images via Reuters 22/33 Lomachenko vs Campbell He even looked to have Lomachenko hurt in the sixth round. Getty Images 23/33 Lomachenko vs Campbell But as the final rounds wore on, Loma ground down his opponent. Getty Images 24/33 Lomachenko vs Campbell A brutal barrage send Campbell down tot he canvas in the 11th. Getty Images 25/33 Lomachenko vs Campbell The knockdown put the cherry on the performance. Action Images via Reuters 26/33 Lomachenko vs Campbell Campbell looked to be heading for a premature exit. Action Images via Reuters 27/33 Lomachenko vs Campbell But he took the eight count from referee Victor Loughlin and rose to his feet. Action Images via Reuters 28/33 Lomachenko vs Campbell Loughlin was happy for Campbell to continue. Getty Images 29/33 Lomachenko vs Campbell Lomachenko resumed the assault over the final four minutes. Action Images via Reuters 30/33 Lomachenko vs Campbell Lomachenko complained about a low blow from Campbell in the final round. Action Images via Reuters 31/33 Lomachenko vs Campbell But the two embraced on the final beel as the crowd cheered and gave both a standing ovation. Getty Images 32/33 Lomachenko vs Campbell Lomachenko looked confident of victory. Getty Images 33/33 Lomachenko vs Campbell And so it proved as he clinched a 119-108, 119-108, 118-109 unanimous decision. Action Images via Reuters\n\nA patient Lomachenko examined Campbell from the first bell, leaving the challenger to seize the centre of the ring and throw up a variety of angles that may not have made his opponent flinch, but certainly forced him to reach for a more intricate way through.\n\nA combination of Campbell’s southpaw stance and range saw Lomachenko fail to immediately find his rhythm, handing Campbell encouragement and likely a share of the first few rounds.\n\nBut like a bolt of lightning, Lomachenko found his target in the third, a clean straight left unsettled Campbell, who did well to earn a nod of the head from the Ukrainian after responding with a smart uppercut of his own. This was unfolding into an intense, compelling chess match.\n\nAnd Loma began to swipe away at Campbell’s body, a trend that would define this fight, ensuring his opponent’s escape off the ropes became gradually slower.\n\nDespite Campbell’s considerable length for a lightweight, Lomachenko’s brief stay inside the pocket was testing trainer Shane McGuigan’s plan to its limits. And a crushing left hook finally removed Campbell from his smooth approach in the fifth, with body shots quickly raining in before the bell saved the challenger as he briefly staggered back to his corner.\n\nBut Campbell was undeterred, firing back whenever the bank of momentum he had built up appeared to be disappearing. After catching Lomachenko in the corner with a smart combination in the seventh, the Ukrainian stormed out like a bull, beautifully mixing up his arsenal of shots as Campbell incredibly weathered another storm.\n\nMimicking the onslaught to the body appeared to stem the tide as Lomachenko was forced to swerve the instinctive counters from Campbell as the bout caught fire once again in the eighth.\n\nA brief pause in the action occurred as the 10th started, with Lomachenko’s face coated in vaseline, before the flow of the fight quickly resumed. Campbell’s resilience continued to defy belief as the wincing attacks continued, but his monotonous jab and instinctive footwork proved as effective as almost any weapon thrown in the way of the mercurial Lomachenko during his short, 15-fight professional career.\n\nCampbell’s chin stood up to the test too after a thudding, clean straight left in the 11th, but moments later Campbell would be rising from the canvas; bludgeoned by more energy-sapping work to the body, he survived the onslaught to reach the 12th.\n\nA stern word from referee Victor Loughlin for a low shot would not deny Lomachenko one last foray at taking out the ballsy Campbell, who tricked his way to the final bell with an interpretation of a wrestling move, hooking the leg of his opponent as he tumbled over.\n\nHis feat earned the respect of the outstanding champion, yet provided no more evidence of how to solve the mystery of Lomachenko.", "description": "The majestic Vasyl Lomachenko produced a relentless barrage of body shots to outclass Luke Campbell and retain his world titles.", "authors": ["Jack Rathborn"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/31/23/Lomachenko-Campbell-10.JPG"}