{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/28/WS5db6496fa310cf3e35573e8e.html", "downloaded_at": "2019-10-28 02:46:57.610359+00:00", "title": "DUP set to stand firm over withholding Brexit backing", "language": "en", "text": "By JULIAN SHEA in London | China Daily Global | Updated: 2019-10-28 09:50\n\nLeader of the DUP Arlene Foster MLA speaks at the Democratic Unionist Party (DUP) annual conference in Belfast, Northern Ireland on Oct 26, 2019. [Photo/Agencies]\n\nThe leader of Northern Ireland's Democratic Unionist Party leader has told British Prime Minister Boris Johnson she wants to see more honesty from his government before her party will support the next steps of the Brexit process.\n\nSpeaking at the annual conference of her Brexit-supporting party, known as the DUP, Arlene Foster said Johnson's plan, which for economic purposes imposes a virtual border down the Irish Sea, takes matters \"in the wrong direction\" and the party will not support it.\n\nAfter the 2017 General Election, when then-prime minister Theresa May lost her majority, the Conservatives made a deal with the DUP's 10 MPs for their support. That is no longer guaranteed, and with Conservative numbers in Parliament having shrunk, Johnson now needs the DUP's backing more than ever. But because his plan gives Northern Ireland a different economic status to the rest of the United Kingdom, the DUP is not interested.\n\n\"With our 10 votes being so critical in Parliament, there is a great responsibility to make sure we support the right decisions for Northern Ireland but have the boldness and strength to stand up and say no when we need to,\" said Foster.\n\n\"On Brexit, we will not give support to the government when we believe they are fundamentally wrong and acting in a way that is detrimental to Northern Ireland and taking us in the wrong direction. We will oppose them and we will use our votes to defeat them.\n\n\"Let me say clearly from this platform today that we want to support a deal that works for the whole of the United Kingdom and which does not leave Northern Ireland behind.\"\n\nRevealingly, there is no Conservative keynote speaker at this year's DUP conference. In 2017, May's deputy Damian Green spoke at the conference's fundraising dinner, and last year Johnson himself was the star turn, telling delegates: \"We would be damaging the fabric of the Union with regulatory checks and even customs controls between Great Britain and Northern Ireland on top of those extra regulatory checks down the Irish Sea that are already envisaged in the withdrawal agreement … I have to tell you that no British Conservative government could or should sign up to any such arrangement.\"\n\nMeanwhile, following last week's abandonment of what Johnson had called the \"do or die, come what may\" Brexit date of Oct 31, the fourth such postponement, leaders of the 27 other European Union member states look poised to grant the British government another extension, but it is unclear as to how long or when.\n\nLast week, in a bid to break the parliamentary deadlock, Johnson said he was willing to grant MPs more time to debate his legislation, if they agreed to have a general election in December, which meant ditching the Oct 31 deadline.\n\nBritain's last December election was in 1923, and arranging one so close to Christmas would be difficult, so it looks unlikely to be accepted. The Liberal Democrats and Scottish National Party counter-off ered suggesting a different date, which the government has declined, raising questions as to whether the election suggestion was just a cover for dropping Oct 31 anyway.", "description": "The leader of Northern Ireland's Democratic Unionist Party leader has told British Prime Minister Boris Johnson she wants to see more honesty from his government before her party will support the next steps of the Brexit process.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/28/5db64e13a310cf3e97a32f3b.jpeg", "published_at": "2019-10-28"}