{"pub": "yahoo", "url": "https://news.yahoo.com/walmart-pilots-news-ways-to-cut-health-care-costs-040101743.html", "downloaded_at": "2019-10-04 02:40:00.474514+00:00", "title": "Walmart to test ideas aimed at reducing unnecessary health care spending", "language": "en", "text": "As part of an effort to curb health care spending, Walmart (WMT) is testing new health-focused programs in select markets for its existing medical plan.\n\nThe goal of the retailer’s new pilot programs is to enhance local care to avoid potentially unnecessary treatments and visits. Beginning in 2020, the nation’s biggest private employer will run pilots in select markets along with its existing medical plan, to see if they can scale across the entire company. Walmart hosts more than 1 million associates and family members on its medical plans.\n\nThe idea is to test whether these new programs — called Featured Providers, Expanded Telehealth, Personal Healthcare Assistant, National Quality Provider Resource, and Nationwide Fitness Club Access — can help prevent users from running up unnecessary or avoidable costs, according to Walmart.\n\nDriving Walmart’s effort is what the company says are approximately one-third of medical costs in the U.S. that are racked up by unneeded treatment. The initiative comes as employer-sponsored insurance costs have skyrocketed around the country.\n\n\"Our healthcare system is just too complex,\" Adam Stavisky, senior vice president of U.S. benefits at Walmart, said. \"The system is opaque. It's expensive. Candidly, it can be intimidating for many people.\"\n\nCalling the rising cost curve “the north star” for Walmart, Stavisky noted that “Thirty percent of all care in America is unnecessary.\"\n\nThe Centers of Excellence example\n\nCustomers shop in the pharmacy section of a Sam's Club store, a division of Wal-Mart Stores in Bentonville, Arkansas June 4, 2009. Warehouse club operators like Sam's Club charge consumers an annual fee to shop in their stores and offer discounts on everything from flat-screen TVs to printer paper to beef tenderloin. REUTERS/Jessica Rinaldi (UNITED STATES BUSINESS HEALTH) More\n\nWalmart’s Centers of Excellence, a program that first debut in 2013, gave the company insight into how and why health care dollars are spent. The program allows for employees enrolled in the company's medical plan to access specialized care at top hospitals. Options include certain cancer treatments, hip and joint replacements, and spinal surgery, among others.\n\nFor example, if a local doctor tells a Walmart employee enrolled in the company's plan that he or she needs spinal surgery, they can go to one of the Centers of Excellence hospitals. The visit is covered under the company's plan, and Walmart also pays for the travel, lodging, and food for the patient and a caregiver.\n\nThe experience taught Walmart that in some cases, patients were being referred for unnecessary treatment. According to the retail giant, more than half of the Walmart employees (or their relatives) who traveled to one of the Centers of Excellence for spine surgery at the recommendation of their local physician discovered that they did not need the procedure. Meanwhile, 20 percent of the patients sent for joint-related issues also didn’t need the procedure.\n\n\"Once they were given a different treatment plan, they avoided unnecessary surgery and recovered more quickly. In addition to better medical outcomes, their medical costs were greatly reduced,\" the company said.\n\nWith that in mind, Walmart associates in Orlando and Tampa, Dallas-Fort Worth — and the retailer's home-base of Northwest Arkansas — will have access to a program called Featured Provider starting next year. To do this, Walmart tapped Embold Health, a startup founded by the retailer's former chief medical officer Daniel Stein.", "description": "Walmart learned first hand that unnecessary medical care is driving costs higher.", "authors": ["Julia La Roche"], "top_image": "https://s.yimg.com/uu/api/res/1.2/MBtRUmX6261ToXuGQQ0Www--~B/aD0yNjM0O3c9NDY4MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/5b2a5470-ded2-11e9-b6fe-ac5b3a3afa34", "published_at": "2019-10-03"}