{"pub": "investing.com", "url": "https://ca.investing.com/news/economy/japans-small-banks-load-up-on-risk-as-they-fight-to-survive-1960001", "downloaded_at": "2019-09-04 03:52:31.303914+00:00", "title": "Japan’s Small Banks Load Up on Risk as They Fight to Survive", "language": "en", "published_at": "2019-09-04", "text": "(Bloomberg) -- Japan’s troubled regional banks are plunging into riskier corners of the credit markets, in a struggle to survive ultra-low interest rates and an industry shakeout.\n\nAs debt yields tumble globally, the lenders are also facing weak business at home, where a shrinking population is hitting the outlying areas hardest. That’s prompting authorities to push for consolidation. Desperate to avoid that fate, the banks are shedding their traditional conservatism, fueling questions about their ability to manage riskier holdings including foreign assets.\n\nThe latest case came last week. Local lenders were among the buyers of Samurai bonds sold by Export-Import Bank of India with a BBB+ rating, just three steps away from junk, that may have dissuaded the financial firms in the past. In another unconventional move last month, a few regional banks also put their money in the first negative-yielding note issued by a Japanese agency.\n\nProfits at regional banks have fallen as they compete for a shrinking pool of borrowers in smaller cities and rural areas where depopulation has led to shuttered shops and abandoned houses. Rock-bottom interest rates are also weighing on their margins. They’re taking bigger risks to compensate, such as lending to the real estate sector, buying overseas debt and investing in structured finance.\n\n“There’s excessive competition among regional banks now, which is driving fierce competition to get profit margins,” said Takayuki Atake, head of credit research at SMBC Nikko Securities Inc. “They used to only buy domestic bond products but they have no choice but to take risks by looking into overseas debt.”\n\nAuthorities are scrutinizing the riskier behavior, which Moody’s Investors Service says could make their earnings more volatile and increase the cost for them to comply with financial regulations.\n\nEven Japan’s two major rating firms, which have tended to take a more lenient view, are sounding alarms. Downgrades and outlook cuts of regional lenders have increased to 13 so far this year at Japan Credit Rating Agency and Rating & Investment Information, the most for similar periods in data compiled by Bloomberg going back to 2010.\n\nGlobal fund managers are looking at such cases in Japan, whose central bank was the first to adopt zero interest rates two decades ago, as harbingers of what might be coming elsewhere. Now plunging rates are a global phenomenon, with more than $17 trillion of investment-grade debt worldwide, or about 30% of the total, having negative yields.\n\nThe subzero rates mean that Europe’s banks may soon need to either change their business model or shrink, the head of Denmark’s financial watchdog said last month. Executives at European lenders are also saying they can’t rule out charging retail clients for deposits, something that would break a taboo in the banking world.\n\nThe signs from Japan aren’t encouraging. Net income of 64 first-tier regional banks fell 21% to a seven-year low of 622.3 billion yen ($5.9 billion) in the year ended March 31, according to Regional Banks Association of Japan data. Profits fell as the cost to deal with non-performing loans increased, it said.\n\nMoody’s cited “the inability of Japanese banks to maintain profits without taking on more risk” last month when it put some of the regional lenders on review for downgrade.\n\nJapan’s shrinking population is also a pressing concern. It’s set to slump by almost a third by 2060, by which time about 40% will be 65 or over, according to the National Institute of Population and Social Security Research.\n\nPolicy makers are taking steps to deal with the increased competition among banks amid those demographic changes.\n\nThe Financial Services Agency last month announced steps to monitor regional lenders to ensure their operations are sustainable, including pushing poorly performing banks to change their business models. The government also said earlier this year that legislation will be submitted to parliament in 2020 that will exempt regional banks from anti-monopoly law for 10 years to facilitate mergers.\n\nThose are positive steps for the sector, whose lending to riskier borrowers hasn’t led to a rise in earnings reflective of the higher risks, Tom Learmouth, Japan economist at Capital Economics, wrote in a report. “Consolidation is the only feasible long-term solution to Japanese regional banking’s ills.”\n\n(Updates with tout on negative-yielding agency bond)", "description": "Japan’s Small Banks Load Up on Risk as They Fight to Survive", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/content/pic40e974747ac82b89f843e01a3a9c7161.jpg"}