{"pub": "yahoo", "url": "https://finance.yahoo.com/news/peloton-start-ipo-roadshow-soon-143558882.html", "downloaded_at": "2019-09-12 07:07:33.469651+00:00", "title": "Peloton to Start IPO Roadshow as Soon as Wednesday", "language": "en", "text": "(Bloomberg) -- Peloton Interactive Inc. seeks to raise as much as $1.16 billion in an initial public offering as it prepares to pitch the subscription exercise business to investors.\n\nThe home-fitness startup plans to offer 40 million Class A shares at $26 to $29 each, it said Tuesday in a filing with the U.S. Securities and Exchange Commission. A listing at the top of that range would value Peloton at about $8.1 billion based on the shares to be outstanding as listed in its filing.\n\nThe company is planning to start its IPO roadshow Wednesday, with presentations this week in Frankfurt and London, according to a schedule obtained by Bloomberg. Meetings with investors will continue in cities including Toronto, San Francisco and New York through Sept. 25, when the shares are set to be priced, according to the schedule\n\nPeloton’s roadshow is kicking off as unprofitable unicorns looking to go public face scrutiny over their business prospects. WeWork plans to schedule meetings with investors as soon as this week, even after a steep cut in its potential value spurred a major shareholder to pressure the company to put off the offering.\n\nValuation Goal\n\nPeloton earlier had planned to seek a valuation of $8 billion to $10 billion in its IPO, people familiar with the matter have said. It was worth about $4.2 billion in its most recent private funding round last year.\n\n“The path to profitability will be the No. 1 focus and I think that would do a lot for their valuation,” said Michael Kawamoto, an analyst with D.A. Davidson & Co.\n\nPeloton lost $196 million on sales of $915 million during the 12 months ended June 30, according to its filings. That compared with a loss of $48 million on $435 million in sales during the same period a year earlier.\n\nFounded in 2012, Peloton describes itself as the “largest interactive fitness platform in the world” with more than 1.4 million members, according to its filing.\n\nThe company sells exercise bikes and treadmills that have screens connected to the internet for showing its own workout programs. It also has an app that shares its exercise programming with users who don’t own its hardware.\n\n‘Connected Fitness’\n\nIts basic “connected fitness” subscription costs $39 a month and the bikes start at about $2,000.\n\nHolders of the Class A shares will get one vote per share, while Class B holders will have 20 votes a share, according to the filing.\n\nGoldman Sachs Group Inc. and JPMorgan Chase & Co. are leading the offering, the filing shows. The company is planning to be listed on Nasdaq Global Select Market under the symbol PTON.\n\n(Updates with valuation in second paragraph)\n\n--With assistance from Julie Verhage.\n\nTo contact the reporters on this story: Gillian Tan in New York at gtan129@bloomberg.net;Michelle F. Davis in New York at mdavis194@bloomberg.net;Crystal Tse in New York at ctse44@bloomberg.net\n\nTo contact the editors responsible for this story: Michael J. Moore at mmoore55@bloomberg.net, ;Liana Baker at lbaker75@bloomberg.net, Michael Hytha, Matthew Monks\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Peloton Interactive Inc. seeks to raise as much as $1.16 billion in an initial public offering as it prepares to pitch the subscription exercise business to investors.The home-fitness startup plans to offer 40 million Class A shares at $26 to $29 each, it said Tuesday in a filing with", "authors": ["Gillian Tan", "Michelle F. Davis", "Crystal Tse"], "top_image": "https://s.yimg.com/uu/api/res/1.2/2_wiuQ_ARjhdxDnWixf4NQ--~B/aD0xMzM0O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/735d5afc1f46820c9d2d500f43f5b5eb", "published_at": "2019-09-10"}