{"pub": "marketwatch", "url": "https://marketwatch.com/story/tornado-rolls-through-dallas-1-dead-from-storm-wreckage-2019-10-21", "downloaded_at": "2019-10-21 14:59:20.505944+00:00", "title": "Tornado rolls through dallas, 1 dead from storm wreckage", "language": "en", "text": "DALLAS (AP) — Crews searched Monday through the rubble of homes and businesses torn apart by a tornado that ripped through the Dallas area the night before, and one person was killed by a falling tree in Arkansas as the storms moved to the northeast.\n\nRadar confirmed the tornado struck near Love Field Airport and moved northeast through the city around 9 p.m. Sunday, said National Weather Service meteorologist Jason Godwin. There were no reports of fatalities or serious injuries in Texas early Monday, but Fire-Rescue spokesman Jason Evans says three people were hospitalized for evaluation of non-life-threatening injuries. Tens of thousands of people were without electricity.\n\nSee also: ‘We’re in a tornado!’ These terrifying videos show a twister tearing through Dallas overnight\n\nOne person died in northwest Arkansas when a tree fell on a home in Rogers, about 150 miles (240 kilometers) northwest of Little Rock, according to the Benton County Department of Public Safety. Arkansas Gov. Asa Hutchinson said “significant storm damage” occurred in northwest Arkansas.\n\nDamage was also reported in the northeast corner of Arkansas in the town of Tyronza, where two people were reported injured, Jonesboro TV station KAIT reported.\n\nPower was out at the Northwest Arkansas Regional Airport in Highfill, about 155 miles (250 kilometers) northwest of Little Rock. The airport says flights were still departing, though security screenings were being done manually.\n\nThe storms also caused damage in Oklahoma and Missouri.\n\nTornado warnings were in effect Monday morning in far eastern Arkansas near the Mississippi River as the storm system moved to the east. The Storm Prediction Center in Norman, Oklahoma, says areas of Alabama, Louisiana, Mississippi and Tennessee could see severe thunderstorms later Monday.\n\nIn Texas, heavy damage was reported in northwest Dallas and Richardson. Nearly 140,000 electric customers were without power as of 4 a.m. Monday, according to Oncor’s online outage map. The electric utility said storms across East Texas had caused significant damage to power lines.\n\nAround 65,000 of the affected electric customers were within Dallas, according to the city, which said it would open a shelter.\n\nCrews searched through homes and businesses that were accessible for about six hours overnight, but were hampered by “limited access and lack of proper lighting,” Evans said. A second set of teams were to resume search efforts in daylight.\n\nSeven people escaped a structure that collapsed in northwest Dallas, but Dallas Fire-Rescue were searching to see if anyone was left inside, Evans said. WFAA-TV reported that a convenience store collapsed in the storm, but the clerk told the station that everyone who was inside made it out safely.\n\nEvans said that the department had also received multiple calls from people injured in their homes by broken glass.\n\nOn Twitter, Dallas Fire-Rescue said one of its own stations sustained significant damage during the storms overnight, and included photos that appeared to show a collapsed roof and debris. Evans said none of the firefighters at Station 41 were hurt, but said the roof was torn off by the high winds.\n\nDallas Stars player Tyler Seguin said a home he owns was heavily damaged. The hockey player said on Twitter that he had moved to another home and that the damaged property was listed for sale. He wrote it’s “an extremely sad sight to see.”\n\nA radio station, KNON-FM, went off the air as the studio suffered major damage from the tornado. Lew Morris, one of the hosts of “Reckless Rock Radio” told The Associated Press in a Facebook message that the power at the station went out first, followed by the “distinctive whistle” of a tornado within three minutes.\n\n“We then heard the building shaking and could hear the glass windows shattering everywhere along with debris banging around. We waited until all the noise died down,” Morris told the AP. “We walked out to see the studio he was just broadcasting from destroyed.”\n\nGodwin, the meteorologist, said the size and severity of the tornado won’t be known until crews arrive to survey the damage. NWS warning coordination meteorologist Jennifer Dunn told the AP there may have been two or more tornadoes in north Texas, but reiterated that the extent wouldn’t be known until later Monday afternoon.\n\nNorth of Dallas, the city of Richardson said in a release that many roads “used by thousands of morning commuters” will be closed while workers clear debris and repair downed traffic lights.\n\nThe city of Sachse, a northeast suburb of Dallas, said in a release that six houses were damaged from the storms, but no injuries were reported.\n\nCiting extensive damage to campuses, the Dallas Independent School District canceled Monday classes at several schools.\n\nIn parts of southern Missouri, the severe weather toppled trees and power lines, damaging some homes and outbuildings. The weather service said crews were headed out Monday morning to determine whether straight line winds or small tornadoes caused the damage.", "description": "The storms caused damage in Dallas, Arkansas, Oklahoma and Missouri.", "authors": ["Associated Press"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT671_dallas_ZG_20191021093418.jpg", "published_at": "2019-10-21"}