{"pub": "marketwatch", "url": "https://marketwatch.com/story/importing-cheaper-drugs-from-canada-isnt-the-miracle-cure-for-high-us-prices-2019-09-30?mod=rsswn", "downloaded_at": "2019-09-30 10:44:54.653843+00:00", "title": "Importing cheaper drugs from Canada isn’t the miracle cure for high U.S. prices", "language": "en", "text": "President Trump has called for ways to allow U.S. residents to buy cheaper prescription drugs from Canada. Many drugs are cheaper in Canada, thanks to government price controls in that country.\n\nI teach a course in medication economics and have written and spoken about drug pricing at the national and state level. My assessment is that buying prescription drugs from our northern neighbor can be risky in terms of quality and safety. And, it isn’t likely to reduce your drug prices.\n\n‘O Canada’ price reduction strategies\n\nCanada offers the same drugs at cheaper prices because the Canadian government, which foots the bill for prescription drugs, will not pay for a drug if a government review board believes the cost is excessive. This board, the Patented Medicine Prices Review Board, is a quasi-judicial agency. It was established by Canadian Parliament in 1987 under the auspices of the minister of health. If the board thinks a price is too high, it won’t pay. Faced with loss of the entire Canadian market if it doesn’t lower prices, manufacturers capitulate.\n\nAlso, Canadians have different expectations about what is covered and what is not. Canadians accept that their health-care resources are finite.\n\nIn addition, there are price caps after a drug appears on the Canadian market. The price charged each successive year is allowed to rise only with the rate of inflation. In the U.S., even generic drug prices can rise precipitously with little advanced warning.\n\nThe result is that drug manufacturers get the best deal they can from Canada and other countries with price controls as long as they have reasonable profitability and make most of their profit from U.S. consumers.\n\nWhy are U.S. drug prices so high?\n\nIn the U.S., price negotiations occur between individual insurers and the manufacturers. The government is not involved.\n\nAlso, drug manufacturers in the U.S. can reach consumers and promote drugs directly through advertising, something not allowed in any other country except New Zealand. Thus, they create demand — and incur hundreds of millions of dollars in advertising that they recoup in the prices they charge.\n\nInsurers developed a way to allow consumers choice and save money. In this setup, expensive drugs are still covered, but drugs in tier one have much lower copay costs than drugs in higher tiers.\n\nWhen consumers find they are paying $100 for a tier two option instead of $20 for a tier one option, they call their doctor and ask for a cheaper alternative. Manufacturers with a higher tiered drug have responded by creating prescription coupons instead of lowering the overall cost of the drug. When the consumer goes to the pharmacy, they pay $20 and the manufacturer pays the other $80 of their copay.\n\nWhile this pricing system may alleviate the out-of-pocket burden on the consumer, manufacturers simply raise the overall price to shift the costs back on the insurers. The additional costs borne by the insurers are then baked into the higher premiums charged to consumers and their employers.\n\nSo why not import from Canada?\n\nBuying drugs from Canada is illegal in the U.S., but the Food and Drug Administration website says it “typically does not object to personal imports of drugs” if there is no commercialization or promotion of the drug to U.S. residents; individuals verify in writing that the drug is for his or her own use; and the drug doesn’t present an unreasonable risk.\n\nSafety is also an issue. The FDA stresses that it cannot ensure the safety and effectiveness of drugs it has not approved. In fact, four former FDA commissioners warn that having prescriptions filled by foreign pharmacies can put substandard, counterfeit, adulterated or contaminated drugs into consumers’ hands.\n\nThe Trump administration’s plan\n\nThe Department of Health and Human Services in July announced a drug importation action plan outlining the parameters under which prescription drugs currently routed to Canada could make their way to U.S. consumers.\n\nThe agency did this in part because of the need to ensure that the products originate in Canada. In 2005, the FDA seized 1,700 drug products allegedly imported from Canada, and the majority did not originate there.\n\nThe plan requires that only manufacturing plants certified to manufacture drugs for the U.S. market be allowed; that the drugs go to U.S. pharmacies, directly or through a wholesaler; and that the drugs be labeled according to U.S. standards.\n\nProblems would still exist.\n\nThe most important would be the loss of an accurate way to track negative drug side effects after drugs reach the market. It would be impossible for the FDA to determine whether adverse events would be due to the U.S. version of the drug, poor quality of the manufacturer, storage or shipment of the drugs into the U.S.\n\nSecond, importation likely would eliminate the pharmacist-patient relationship. This could possibly increase the risk of medication errors, such as overdoses and the taking of duplicate medications. This is because consumers likely would get prescriptions from myriad pharmacies. Different drug importation programs would likely focus on certain classes of medications contracted to specific pharmacy chains or mail order facilities. Patients might stop going consistently to the same pharmacy.\n\nStudies have shown that this is important. For every six patients receiving a pharmacist intervention, there was one fewer patient requiring emergency room care during transitions of care.\n\nFurthermore, controlled substances like opioids, biological products and drugs you inject or infuse in the body are excluded from pilot testing of imports. Biological drugs are among the most expensive drugs on the market, accounting for 45% of total drug spending in the U.S. in 2018.\n\nSimply put, for the next several years, most Americans will be excluded from importing any prescription drugs from Canada, and everyone will be excluded from importing the most expensive ones.\n\nNo perfect solution\n\nA recent study estimates that the entire Canadian drug supply would be exhausted in 183 days, if only 20% of U.S. prescriptions were filled using Canadian prescription drug sources. The U.S. and Canada cannot force the companies to manufacture more.\n\nAlso, Canadians could end up paying more, and Canadians are not happy about this. U.S. drugmakers could give up on Canada and focus on the more profitable U.S. market.\n\nWhen profitability is reduced, there will be consequences. Manufacturers will invest fewer dollars in research and development and will shift their focus from very high-cost biological drugs for rare diseases back to more reasonably priced drugs for more common diseases. The system will be better for some and worse for others, which is why we haven’t already made these difficult choices in the U.S.\n\nC. Michael White is a professor and the head of the department of pharmacy practice at the University of Connecticut. This was first published on The Conversation — “Why cheaper drugs from Canada likely won’t cure what ails US”.", "description": "Start with that the most expensive drugs wouldn’t be covered under the Trump administration’s plan to allow some imports.", "authors": ["C. Michael White"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS249_pharma_ZG_20190927160615.jpg", "published_at": "2019-09-30"}