{"pub": "independent", "url": "https://independent.co.uk/life-style/fashion/johnny-depp-dior-sauvage-advert-cultural-appropriation-native-americans-a9098776.html", "downloaded_at": "2019-09-10 23:32:48.654575+00:00", "title": "Johnny Depp says Dior Sauvage advert was ‘made with respect’ amid cultural appropriation accusation", "language": "en", "text": "Johnny Depp has defended his latest campaign for Dior after it was pulled by the brand following accusations of cultural appropriation.\n\nLast month, the French fashion house released a preview of its Native American-inspired fragrance campaign for “Sauvage” on social media.\n\nDespite stating it had collaborated with Native American consultants, the brand received widespread criticism in the hours following the preview of the campaign with many calling it “racist” and “offensive”.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIn a new interview with The Hollywood Reporter Depp said he wished the world could have seen the full video, instead of just the short sneak peek.\n\n“A teaser obviously is a very concentrated version of images and there were objections to the teaser of the small film,” Depp explained. “The film has never been seen.”\n\nShape Created with Sketch. Blackface controversy in popular culture Show all 5 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Blackface controversy in popular culture 1/5 Alitalia Obama Ad Italian airline Alitalia apologised after releasing a video featuring a white actor in blackface playing Barack Obama to promote their non-stop flight from Rome to Washington 2/5 Katy Perry shoes The Katy Perry Collection pulled this design after it was noted that they resembled blackface. Perry said \"I was saddened when it was brought to my attention that it was being compared to painful images reminiscent of blackface. Our intention was never to inflict any pain.\" Dillard's 3/5 Prada collection In December, lawyer Chinyere Ezie spotted figurines in the Prada shop window in Soho, New York that bore a resemblance to racist depictions of black people, with dark skin and large, red lips and voiced her disgust over social media. Prada has since apologised. Chinyere Ezie / Facebook 4/5 Gucci jumper This \"balaclava jumper\" was removed from sale after it was noted to resemble blackface. In a letter to Gucci employees, designer Alessandro Michele expressed the pain he felt that one of his creative projects was seen as “an intolerable insult”. 5/5 Moncler Penguin French brand Moncler claims the golliwog-style face is really the face of collaborator Friends With You's character \"Malfi the Penguin\" 1/5 Alitalia Obama Ad Italian airline Alitalia apologised after releasing a video featuring a white actor in blackface playing Barack Obama to promote their non-stop flight from Rome to Washington 2/5 Katy Perry shoes The Katy Perry Collection pulled this design after it was noted that they resembled blackface. Perry said \"I was saddened when it was brought to my attention that it was being compared to painful images reminiscent of blackface. Our intention was never to inflict any pain.\" Dillard's 3/5 Prada collection In December, lawyer Chinyere Ezie spotted figurines in the Prada shop window in Soho, New York that bore a resemblance to racist depictions of black people, with dark skin and large, red lips and voiced her disgust over social media. Prada has since apologised. Chinyere Ezie / Facebook 4/5 Gucci jumper This \"balaclava jumper\" was removed from sale after it was noted to resemble blackface. In a letter to Gucci employees, designer Alessandro Michele expressed the pain he felt that one of his creative projects was seen as “an intolerable insult”. 5/5 Moncler Penguin French brand Moncler claims the golliwog-style face is really the face of collaborator Friends With You's character \"Malfi the Penguin\"\n\nThe Pirates of the Caribbean star added that the campaign was made with “great respect”, adding that Dior is working with those who were offended to resolve the issue.\n\n“There was never - and how could there be or how would there be - any dishonourable [intent]. The film was made with a great respect for the indigenous people not just of North America but all over the world,” Depp said.\n\n\"It's a pity that people jumped the gun and made these objections. However, their objections are their objections.\"\n\nHe continued: ”I can assure you that no one has any reason to go out to try to exploit.\n\n“It was a film made out of great respect and with great respect and love for the Native American peoples to bring light to them. They haven't had the greatest amount of help out of the United States government.\n\n\"The idea is as pure as it ever was, so we will come to an agreement so that everyone is happy.\"\n\nJust one day after Dior released the clip of its fragrance campaign, the French fashion brand removed the video from all social media accounts including Twitter, Instagram and YouTube.\n\nThe brand initially posted two clips of Canku Thomas One Star, a member of the Rosebud Sioux Tribe in South Dakota, performing the Fancy War Dance wearing a colourful traditional ensemble.\n\nIn the first clip, the dancer could be seen performing as a voiceover said: “We are the land.”\n\nIn the caption the brand wrote: “An authentic journey deep into the Native American soul in a sacred, founding and secular territory.”\n\nIn a second Instagram post, Dior shared images of Canku Thomas with a longer explanation of the brand’s involvement with the Native American community.\n\n“With images saturated with colours and emotions, @c1star performs the mesmerising Fancy War Dance that embodies all the modernity of the Native American culture,” the caption reads.\n\n“A film developed as a close collaboration between the House of Dior and Native American consultants from the 50-year old Indigenous advocacy organization, @americansforindianopportunity in order to respect Indigenous cultures, values and heritage.”\n\nDepp was also seen producing a guitar and playing a riff by guitarist Link Wray, who was part of the Native American Shawnee group.\n\nDior wrote that there would be “more to come” on 1 September, but before the film was even released fully to the public, it already received backlash on social media.\n\n“Using Indigenous people and our culture for your new perfume aesthetic and feeling the need to name it ‘Sauvage’ is a completely bad take. Do better @Dior,” one person wrote on Twitter.\n\nAnother added: “Cooooool, so you’re telling me that @Dior is profiting off Indigenous culture/imagery, and hired JOHNNY DEPP to star in the ad for a perfume called SAUVAGE?! …who thought this was okay? #boycottdior”.\n\nIn a press release for the fragrance campaign, which is relaunching a scent first released in 2015 and previously advertised by Depp, the brand said the film is meant to be a continuation of the Hollywood star’s last fragrance film, which saw him riding in the desert of the American West.\n\n“This new film is an echo to a ‘declaration of love’. A love letter to the spirit of a land that should be protected and cultures that should be celebrated, and to peoples that should be honoured,” the brand wrote.\n\nIn 2016, Dior faced criticism for continuing to represent Depp following allegations of domestic abuse by his ex-wife Amber Heard.\n\nHeard accused Depp of domestic violence before settling the case for $7m (£5.3m), which the Aquaman star donated to charity.\n\nJust one week after the settlement, Depp featured in a campaign for Sauvage alongside the slogan: \"Wild at heart.\"\n\nSocial media users accused the brand of poor timing and called for the actor to be dropped as the face of the fragrance.\n\n\"Johnny Depp may not be the best choice to represent the new 'Sauvage' fragrance considering the domestic abuse accusations. Bad timing,\" one person wrote on Twitter.\n\nDepp has always denied the abuse allegations and has said that they were, \"salacious false stories, gossip, misinformation, and lies\".", "description": "Johnny Depp has defended his latest campaign for Dior after it was pulled by the brand following accusations of cultural appropriation.", "authors": ["Sarah Young"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/30/20/screen-shot-2019-08-30-at-3.26.35-pm-0.png", "published_at": "2019-09-10"}