{"pub": "independent", "url": "https://independent.co.uk/independentpremium/america-nationality-patriotism-new-york-notebook-us-a9147236.html", "downloaded_at": "2019-10-09 00:47:43.189413+00:00", "title": "Why do so many Americans want to hide their nationality?", "language": "en", "text": "In America, you have this exact conversation a lot: “Where are you from?” someone who clearly grew up in the States will ask you, when they hear you order a coffee or a bagel or a slice of pizza the size of your head at some opportune moment.\n\n“Oh, I’m from England,” you’ll say, shrugging as if I’m some sort of personal defect you couldn’t quite shake, because that’s what English people do.\n\n“Where in England?” they’ll ask, all bright white perfect teeth and shiny hair, and you’ll concede that you have to say “London” because if you say where you’re really from they’ll just say, “Oh, I don’t know there. Is that near Buckingham Palace/the Scottish Highlands/the obscure village in Devon I once visited when I was five and now expect you to know about because to me England is the size of Greenwich Village?”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nSo far, so normal. Then comes the inevitable: “Well, I don’t know London. Because I’m Irish, so.”\n\nThe first time this happened to me, I genuinely thought there must be an east coast American dialect that sounded almost identical to the one spoken in some small part of the Republican of Ireland. In fact, I even thought that the second time it happened. The fifth time, however, you start to smell a rat. You do the same thing they did to you: “But whereabouts in Ireland?” you say, after which they might wave a hand nervously and reply, “Oh, you know. The south.”\n\n“Oh, Cork, is it? Or Kilkenny?”\n\n“Well, you know…” They’ll smile again and say, “My family is from round Dublin.” Because, I mean, it’s always Dublin, isn’t it?\n\nThe trick is not to stop your line of questioning there, otherwise you might naively walk away thinking that you’ve met someone whose mother hails from Limerick and met her husband at Trinity College before immigrating to New York. “Which family member?” you’ll have to ask, and eventually they’ll tell you the truth: “Fifteen generations back, we saw we had a cousin whose surname was O’Malley and we presume they probably came from that part of the world.”\n\nA lot of people will happily claim they’re Swedish, Swiss or Italian … there are entire traditions based around these identities which have little or nothing to do with the actual traditions of the original country\n\nThis interrogation method is absolutely not a way to make friends. But it is one which will save you a lot of time asking your friend from yoga whether her mum is “making the trip over from Dublin this year for Christmas” when actually their more-American-than-apple-pie mother, who has never even so much as thought about owning a passport, will be hosting Christmas dinner at the same brownstone in Brooklyn she was born in 55 years ago\n\nIt doesn’t just happen with Irish heritage: a lot of people will happily claim they’re Swedish, Swiss or Italian as well (oddly, I’ve never found someone claim they’re English — or Spanish.) Additionally, there are entire traditions based around these identities which have little or nothing to do with the actual traditions of the original country.\n\nFor instance: “gravy Sundays”, a weekend ritual enjoyed by Italian American families, where everyone comes together to eat meatball marinara and refers to the tomato sauce as “gravy”. “It’s an old Italian thing,” one of my Italian American friends told me, the, when confronted with the truth — that no Italian born and bred in Italy would know what the hell you were talking about if you said you wanted some of their best gravy spaghetti — merely shrugged and said, “Italian American, then. Anyway, we don’t know if my family is actually Italian. We’re just a mixture and we liked that one best.”\n\nTo someone who grew up in Europe, this habit of wearing picking and choosing different national identities looks completely bizarre — why can nobody inside the United States of America call themselves American when asked? Considering the country’s huge commitment to patriotism, it seems like a strange act of cognitive dissonance.\n\nBut you have to remember that the US of A is a very young country, where people will still point to a building and tell you, in a hushed and reverent tone, “That building is from way back in the 1940s. Can you believe it?” You can choose to be petulant and to insist that someone who has never travelled outside of New York City doesn’t really count as “authentically Swedish”, of course. Or you can just smile, nod and take the high road by writing an article in a national newspaper about how they don’t understand their own heritage.", "description": "In America, you have this exact conversation a lot: “Where are you from?” someone who clearly grew up in the States will ask you, when they hear you order a coffee or a bagel or a slice of pizza the size of your head at some opportune moment. “Oh, I’m from England,” you’ll say, shrugging as if I’m some sort of personal defect you couldn’t quite shake, because that’s what", "authors": ["Holly Baxter"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/08/13/british-flag-new-york-081019.jpg", "published_at": "2019-10-08"}