{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7579319/Chanelle-Hayes-displays-slimmed-physique-reads-self-help-book-poolside-Tenerife.html", "downloaded_at": "2019-10-16 14:25:19.221791+00:00", "title": "Chanelle Hayes displays her slimmed-down physique as she reads a self-help book poolside in Tenerife", "language": "en", "text": "She'd been showcasing her slimmer physique during a sun-soaked break to Tenerife.\n\nAnd Chanelle Hayes was once again showing off the fruits of her labour as she larked around by the pool before tucking into self-help book Just F*cking Do It: Stop Playing Small. Transform Your Life during her recent break.\n\nThe former Big Brother star, 31, donned a bold blue swimsuit which featured a heavily plunging neckline as she frolicked around the pool.\n\nA vision: Chanelle Hayes was once again showing off the fruits of her labour as she larked around by the pool before tucking into self-help book Just F*cking Do It: Stop Playing Small. Transform Your Life during her recent break\n\nChanelle has been very vocal about her weight loss journey, keeping her fans updated with her process over the months.\n\nAnd her hard work certainly seems to be paying off as she happily showcased her much slimmer physique in her stylish one-piece.\n\nThe book she was reading is - Just F*cking Do It: Stop Playing Small. Transform Your Life by Noor Hibbert - who describes herself as 'qualified life and business coach, serial-entrepreneur, motivational speaker, author, mother and spiritual bada*s'.\n\nChanelle, who first shot to fame in 2007 as a feisty 19-year-old contestant on Big Brother, regularly posts Instagram updates documenting how she'd been doing as she continued her fitness regime.\n\nHot stuff: The former Big Brother star, 31, donned a bold blue swimsuit which featured a heavily plunging neckline as she frolicked around the pool\n\nBookworm: Chanelle appeared engrossed in her book as she enjoyed some holiday reading\n\nOh my! She displayed her eye-popping assets in the plunging one-piece\n\nIn April this year she shared a before and after snap of herself which showed off her much slimmer frame.\n\nIn a caption, she wrote: 'It’s spurring me on to get to my goal!! From no waist to waist! From too tight sleeves to sleeves that fit! From leggings to jeans. From big calves to toned calves. From lethargic to energetic. From insecure to confident.'\n\n'When I see my progress from all it does it spur me on to get to where I want to be. And I will. LET’S DO THIS.'\n\nHappy days: In April this year she shared a before and after snap of herself which showed off her much slimmer frame\n\nStripping down: She was pulling off her denim shorts later in the day\n\nEngrossed: She was looking stunning for her holiday after working hard on her weight loss\n\nMeanwhile, Chanelle revealed in May that she had lost more than three stone and gone down to a size 12 for the first time in three years.\n\nShe happily shared a snap of herself in her skinny jeans, where she detailed how confident she felt after shedding enough weight to slip back into them.\n\nShe penned: 'THIS IS OFFICIALLY THE SMALLEST I HAVE BEEN SINCE SUMMER 2016!!\n\nReclining in the sun: Meanwhile, Chanelle revealed in May that she had lost more than three stone and gone down to a size 12 for the first time in three years\n\nHot stuff: She proudly showed how far she's come in her weight loss journey\n\nWoah! The title of the book was sure to turn heads due to its expletive-laden front\n\nDeep in thought: It looked as though Chanelle was engrossed in her book as she sat by the pool\n\n'So in November for my birthday I wore a size 18-20 jumpsuit and hated it, felt like [poo emoji]. I’ve put in a lot of effort and hard work and I can now fit into my size 12s.\n\n'DON’T GET ME WRONG- these jeans are nice and stretchy lol. But my belt is on the smallest hole and could do with being a bit tighter...\n\n'I have no overhang and I feel confident. I have lots of other 12s that still don’t fit yet, but the fact that these do is helping me keep going until I get where I want to be.'\n\nLater that month she revealed yet another before and after photo of herself in a black jumpsuit, she said: 'November 2018 vs May 2019 Size 18-20 outfit vs size 12 outfit 15st 6lbs vs 11st 13lbs 84 RHR vs 54 RHR.'\n\nHot stuff! After finding fame on Big Brother, she has been open about her weight battles\n\nDenim diva: She later pulled on a pair of ripped denim shorts which left little to the imagination\n\nStrutting her stuff: She looked fantastic from every angle as she wowed the crowd", "description": "The former Big Brother star, 31, donned a bold blue swimsuit which featured a heavily plunging neckline as she frolicked around the pool", "authors": ["Ciara Farmer For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/12/19784360-0-image-a-165_1571224391544.jpg", "published_at": "2019-10-16"}