{"pub": "japantoday", "url": "https://japantoday.com/category/features/health/That-last-toke-for-the-road-could-be-a-downer-with-pot-breathalyzers-coming", "downloaded_at": "2019-10-25 22:03:28.050417+00:00", "title": "That last toke for the road could be a downer with pot breathalyzers coming", "language": "en", "text": "By Alex Dobuzinskis\n\nOne toke for the road could end up being a total bummer for drivers who smoke pot, with several companies in the United States preparing to market cannabis breathalyzers as legalized marijuana spreads across the country.\n\nLaw enforcement agencies will require breathalyzers to detect marijuana as they are “faced with the necessity of stopping more and more motor vehicles being operated under the influence of THC,” said Brett Meade, a retired police chief and a senior program manager for Washington-based non-profit group the Police Foundation.\n\nNearly a dozen U.S. states allow recreational marijuana consumption and 33 states permit pot for medical use. But all states prohibit driving under the influence of marijuana.\n\nOakland, California-based Hound Labs is one of the companies developing a breathalyzer to detect THC - the component in marijuana that gets people high - and plans to market it in 2020.\n\nConstruction companies could be a big part of its market, said Hound Labs Chief Executive Officer Mike Lynn.\n\n“Nobody wants a crane operator 50 stories up to be smoking a joint,” he told Reuters.\n\nLynn, a physician, said pregnancy tests, which can detect minute quantities of hormone, inspired him to tackle the challenge of measuring THC on users’ breath.\n\nSeparately, Cannabix Technologies Inc based in the Vancouver suburb of Burnaby is testing a pair of devices at different price points.\n\nIts THC Breath Analyzer could be cheap enough at a few hundred dollars per unit to potentially allow parents interested in testing their teenager before turning over the keys to the family car, said Cannabix CEO Rav Mlait.\n\nThe U.S. court system would need to consider how to treat evidence from THC breathalyzers.\n\nAssuming a motorist who tested positive with a THC breathalyzer was impaired behind the wheel could be “problematic,” said Stanford University law professor Robert MacCoun.\n\nUnlike with alcohol, scientific research has not yet established firm correlations between the amount of marijuana people consume and how impaired they become, MacCoun said.\n\nPaul Armentano, deputy director of the National Organization for the Reform of Marijuana Laws, expressed similar concerns.\n\nBut he welcomed breathalyzers as an improvement over existing tests used by police and employers, such as urine analysis that is unable to determine whether marijuana was used recently with the potential for impairment, or days or weeks in the past. Breathalyzers are likely to only detect a user who consumed cannabis within the last few hours.\n\n“A test like that would frankly make sense,” Armentano said. “Just like we wouldn’t allow employees to have a couple drinks and show up to work.”\n\n© (c) Copyright Thomson Reuters 2019.", "description": "One toke for the road could end up being a total bummer for drivers who smoke pot, with several companies in the United States preparing to market cannabis breathalyzers as legalized marijuana spreads across the country. Law enforcement agencies will require breathalyzers to detect marijuana as they are “faced with…", "authors": [], "top_image": "https://japantoday.com/images/japan-today-social.jpg", "published_at": "2019-10-25"}