{"pub": "cnbc", "url": "https://cnbc.com/2019/09/23/elizabeth-warrens-wealth-tax-may-include-a-1-million-marriage-penalty.html", "downloaded_at": "2019-09-23 17:25:20.356819+00:00", "title": "Elizabeth Warren's wealth tax could include a $1 million marriage penalty", "language": "en", "text": "Sen. Elizabeth Warren's proposed wealth tax may create a new incentive for rich couples to divorce to avoid the tax.\n\nIn a recent analysis of the Democratic presidential candidate's signature tax, Harvard economist N. Gregory Mankiw said that because of the nature and structure of the tax, ultra-wealthy couples could split their fortunes in half through divorce and avoid paying any tax. He said that for certain couples, divorcing could save them $1 million a year.\n\n\"The Warren proposal entails a $1 million per year marriage penalty,\" said Mankiw, who was the head of President George W. Bush's Council of Economic Advisers.\n\nThe strategy is fairly simple. Warren's plan would impose a 2% annual tax on wealth over $50 million and a 3% tax on wealth over $1 billion. If a wealthy couple is worth $100 million, they would pay a 2% tax on any wealth over $50 million, which in their case would amount to $1 million a year. But if they divorce and split their fortune in half, they would each be worth $50 million and neither would owe any wealth tax.\n\nA similar strategy could save even more for billionaires. If a couple is worth $2 billion and split their fortune in half through divorce, they could save $10 million a year.\n\nAccountants to the wealthy add that as long as couples follow the legal process of divorce, the Internal Revenue Service wouldn't likely challenge the strategy.\n\n\"I don't know of any cases where the IRS has stepped into a legal divorce and challenged it,\" said Joseph Perry, tax and services leader for Marcum.\n\nMankiw and other prominent economists, including Lawrence Summers, argue that avoidance strategies by the wealthy would dramatically reduce the projected revenue from any wealth tax. The two economists advising Warren on her wealth tax — Emmanuel Saez and Gabriel Zucman — are projecting the tax would raise $2.75 trillion over 10 years. They say avoidance would be more limited because of better enforcement by the IRS.\n\nSaez, an economics professor at the University of California, Berkeley, says the divorce strategy may not be that effective, since the exemption for individuals could be lowered to $25 million. That would mean that couples worth more than $50 million would still pay a tax even if they divorced.\n\n\"If singles get an exemption only half of the married (say $25 million instead of $50 million), divorcing does not help, unless you remarry a pauper,\" he said. \"Because 80% of top wealth holders are married, the proposals generally don't focus yet on this issue as it complicates the presentation of the tax.\"", "description": "Harvard economist N. Gregory Mankiw says ultra-wealthy couples could split their fortunes in half through divorce and avoid paying a wealth tax proposed by presidential candidate Elizabeth Warren.", "authors": ["Robert Frank"], "top_image": "https://image.cnbcfm.com/api/v1/image/106144064-1569250261388gettyimages-1168743396rr.jpg?v=1569250303", "published_at": "2019-09-23"}