{"pub": "businessinsider", "url": "https://businesstimes.com.sg/consumer/levi-strauss-profit-hit-by-weakness-in-wholesale-business-in-americas ", "downloaded_at": "2019-10-09 00:28:18.579193+00:00", "title": "Levi Strauss profit hit by weakness in wholesale business in Americas", "language": "en", "text": "Levi Strauss & Co reported a 4 per cent drop in third-quarter profit on Tuesday, as the denim apparel maker struggled to grow its wholesale business in its highest revenue-generating market, the Americas.\n\n[BENGALURU] Levi Strauss & Co reported a 4 per cent drop in third-quarter profit on Tuesday, as the denim apparel maker struggled to grow its wholesale business in its highest revenue-generating market, the Americas.\n\nReduced shipments to off price stores and the impact of a delayed acquisition of a South American distributor drove net revenue down about 3 per cent in the region, the first fall since the 165-year-old company went public in March.\n\n\"US wholesale was challenged... particularly the legacy department stores and chain stores, where (the) much publicised traffic declines have negatively impacted our business,\" chief executive officer Chip Bergh said in an interview with Reuters.\n\nThe deteriorating retail landscape has forced longstanding brick-and-mortar chains, including J.C. Penney, to explore options, as they struggle to boost their e-commerce business to compete with the likes of Amazon.com.\n\nsentifi.com Market voices on:\n\nMr Bergh said Levi's has been focusing on selling directly to customers through its stores and online than through off price retailers.\n\nLevi's teamed up with model Chanel Iman and New York Giants player Sterling Shepard during the quarter to create an exclusive drop, launching limited merchandise, for e-commerce retailer Amazon.com Inc's fashion line.\n\n\"We only sell to that (off price) channel... the distressed inventory that we're trying to clear. We don't think its good for the brand,\" Mr Bergh said.\n\nJane Hali & Associates analyst Jessica Ramirez said in the long run, Levi's direct-to-consumer model would yield results, but issues in the wholesale business remain a concern.\n\nRevenue from the direct-to-consumer business in the United States rose 7 per cent in the quarter ended Aug 25, driven by the strength of Levi's flagship brand, while that from wholesale declined 4 per cent.\n\nOverall, the wholesale business grew only 1 per cent, drawing strength from Europe and Asia.\n\nNet income attributable to the company fell to US$124.5 million, or 30 cents per share from US$130.1 million, or 33 cents per share, a year earlier.\n\nRevenue and profit came above Wall Street estimates, as the blue-jeans maker also benefited from a resurgence of the denim trend.\n\nExcluding one-time items, the company earned 31 cents per share, 3 cents above expectations. Net revenue rose 3.8 per cent to US$1.45 billion, compared with the average estimate of US$1.44 billion projected by analysts, according to IBES data from Refinitiv.\n\nShares of the company, which have fallen about 14 per cent since its market debut, were down 0.2 per cent in extended trading.\n\nREUTERS", "description": ": THE BUSINESS TIMES Consumer - [BENGALURU] Levi Strauss & Co reported a 4 per cent drop in third-quarter profit on Tuesday, as the denim apparel maker struggled to grow its wholesale business in its highest revenue-generating market, the Americas. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/09/nz_%3Blevis_091034_0.jpg?itok=4tn_hwls", "published_at": "2019-10-08"}