{"pub": "yahoo", "url": "https://uk.style.yahoo.com/skin-lightening-creams-containing-banned-073300725.html", "downloaded_at": "2019-09-28 10:21:47.947855+00:00", "title": "Skin-lightening creams containing banned ingredients should be avoided ‘at all costs’", "language": "en", "text": "Skin-lightening creams which contain banned ingredients can pose a serious threat to consumers’ health, councils have warned.\n\nIllegal products were still available to purchase on the high street, said the Local Government Association (LGA), which represents councils in England and Wales.\n\nThe organisation has warned that the increasing popularity of skin-lightening creams had led to “inferior toxic products” infiltrating the market, containing ingredients such as bleaching agent hydroquinone and mercury.\n\nHydroquinone – described as the “biological equivalent of paint stripper” – can remove the top layer of skin, increasing a person’s risk of skin cancer, liver and kidney damage.\n\nMercury can also lead to the development of life-threatening health problems.\n\nRead more\n\nLupita Nyong’o: skin lightening adverts compromised my self-worth\n\nThe LGA said that “rogue retailers” who sell the illegal skin-lightening lotions frequently label the ingredients on the products incorrectly.\n\nSkin-lightening products containing banned ingredients can also be bought at low prices online, at car boot sales and from market stalls.\n\n“Skin creams containing banned ingredients are very dangerous and could seriously damage your health, scar you for life and even kill you, so they should be avoided at all costs,” said Simon Blackburn, chair of the LGA’s Safer and Stronger Communities Board.\n\n“Consumers should always check the ingredients of their skin creams, be suspicious of very low prices which are likely to indicate the lotion is fake and potentially harmful, and never use a product containing hydroquinone. If the product doesn’t display the ingredients at all, then don’t use it.”\n\nSkin-lightening products are typically targeted at consumers who are black or from ethnic minorities.\n\nThe creams can also be used to lighten hyperpigmentation and treat acne scarring.\n\nThose which are purchased on prescription should only be used under the supervision of a doctor, the LGA advised.\n\nThe cost of buying skin-lightening products which do not contain banned ingredients can be high, which is why “toxic” alternatives are being sold at a cheaper price.\n\nRead more\n\nMercury-tainted skin cream leaves woman in a coma for weeks\n\n“Councils have been targeting rogue retailers selling these banned creams and people should report any concerns so that town halls can take action to prevent anyone from buying these lotions, potentially ruining their looks forever,” Mr Blackburn said.\n\nStory continues", "description": "Skin-lightening creams which contain banned ingredients can pose a serious threat to consumers’ health, councils have warned.Illegal products were still available to purchase on the high street, said the Local Government Association (LGA), which represents councils in England and Wales.", "authors": ["Sabrina Barr"], "top_image": "https://s.yimg.com/uu/api/res/1.2/K6Q4ZPDlBrMQlOjaaXuWQQ--~B/aD0zOTU7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/2cccf75c7fe20a82a5dbe3238960d153", "published_at": "2019-09-28"}