{"pub": "yahoo", "url": "https://finance.yahoo.com/news/hong-kong-faces-commuter-chaos-023929014.html", "downloaded_at": "2019-09-17 08:25:43.240999+00:00", "title": "Hong Kong faces commuter chaos after rare train derailment", "language": "en", "text": "Emergency crew are seen at a derailed train wreckage near Hung Hom station on the MTR East Rail Line following an accident on a train bound for Mong Kok East in Hong Kong\n\nHONG KONG (Reuters) - A rare train derailment disrupted services in Hong Kong on Tuesday, train authorities said, threatening commuter chaos during rush hour in the heart of the Asian financial hub.\n\nThe disruption to a usually seamless network used by nearly 6 million people every weekday happened after a train derailed while leaving a station in the city's Kowloon area, rail operator MTR Corp said.\n\nLocal media reported that one person was injured. MTR did not immediately give a reason for the accident.\n\nHong Kong's rail system has been a target of vandalism during recent pro democracy protests in the city with activists angry that MTR has closed stations to stop protesters gathering.\n\nTelevision footage on Tuesday morning showed hundreds of passengers trying to disembark from the derailed train. Public broadcaster RTHK said the train suddenly swayed and a door flew off before the train stopped.\n\nNearby stations were overcrowded with a backlog of trains unable to move and trains which normally run at two minute intervals were delayed to run at 12 minute intervals.\n\nShares of MTR fell 1.1% in line with the broader Hang Seng Index which was down 1%.\n\n\n\n\n\n(Reporting by Farah Master; Editing by Jane Wardell)", "description": "A rare train derailment disrupted services in Hong Kong on Tuesday, train authorities said, threatening commuter chaos during rush hour in the heart of the Asian financial hub.  The disruption to a usually seamless network used by nearly 6 million people every weekday happened after a train derailed", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/jOVI_hAYbau0c_YtEPyAeQ--~B/aD0yNTM7dz00NDk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/75abf7fd8a6f6a346107482b9be64ca0", "published_at": "2019-09-17"}