{"pub": "nationalreview", "url": "https://hollywoodreporter.com/amp/news/south-park-banned-chinese-internet-critical-episode-1245783?__twitter_impression=true", "downloaded_at": "2019-10-08 02:15:58.249960+00:00", "title": "'South Park' Banned From Chinese Internet After Critical Episode", "language": "en", "text": "South Park creators Trey Parker and Matt Stone probably saw this coming, and to their credit, simply didn't care. The most recent episode of South Park, \"Band in China,\" has been generating loads of media attention for its sharp critique of the way Hollywood tends to shape its content to avoid offending Chinese government censors in any way whatsoever. Now, those very same government censors, in the real world, have lashed back at South Park by deleting virtually every clip, episode and online discussion of the show from Chinese streaming services, social media and even fan pages.\n\nA cursory perusal through China's highly regulated internet landscape shows the show conspicuously absent everywhere it recently had a presence. A search of the Twitter-like social media service Weibo turns up not a single mention of South Park among the billions of past posts. On streaming service Youku, owned by internet giant Alibaba, all links to clips, episodes and even full seasons of the show are now dead. And on Baidu's Tieba, China's largest online discussion platform, the threads and subthreads related to South Park are nonfunctional. If users manually type in the URL for what was formerly the South Park thread, a message appears saying that, \"According to the relevant law and regulation, this section is temporarily not open.\" The draconian response is par for the course for China's authoritarian government, which has even been known to aggressively censor Winnie the Pooh because some local internet users had affectionately taken to comparing Chinese president Xi Jinping to the character.", "description": "", "authors": ["Mike Barnes", "October"], "top_image": "", "published_at": "2019-10-07"}