{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7577959/Boris-Johnson-readmit-expelled-Tory-rebels-party-vote-Brexit-deal.html", "downloaded_at": "2019-10-16 03:58:30.431450+00:00", "title": "Boris Johnson 'to readmit expelled Tory rebels to the party IF they vote for his Brexit deal'", "language": "en", "text": "'Ladder of redemption'? Boris Johnson could readmit rebels if they back his Brexit deal\n\nExpelled Tory rebels could be allowed back in the party if they vote for Boris Johnson's Brexit deal, senior sources have said.\n\nThe Prime Minister needs the support of many of the 21 MPs kicked out of the party last month if he is to get a deal through.\n\nAnd as speculation mounts over a possible deal being reached this week, the Mail understands those anti-No Deal rebels have been told there is a 'ladder to redemption'.\n\nThe 21 rebels were booted out after voting – with Labour and other Opposition parties – for the so-called Benn Act, which forces the Prime Minister to agree a three-month delay in the absence of a deal. At the time they were told they would not be allowed to stand as Tories at the next election if they voted against the Government.\n\nAmong the rebels were former chancellors Philip Hammond and Ken Clarke, David Gauke, Sir Oliver Letwin and Churchill's grandson Sir Nicholas Soames.\n\nFormer Chancellors Ken Clarke and Philip Hammond are among the rebels would could return\n\nSam Gymiah, left, has already joined the Lib Dems, but Sir Nicholas Soames could return\n\nOne rebel, Sam Gyimah, has joined the Lib Dems while former Tory leadership candidate Rory Stewart is running as an Independent for mayor of London. But there are also more than a dozen MPs whose support Mr Johnson needs to try to pass a deal and several key pieces of Brexit legislation.\n\nOne senior Tory source said: 'The appeals process is under way. Votes on a deal and subsequent legislation are key.' Another said: 'If anyone was serious about coming back they would be voting with the Government. There's a pathway to a deal, but it doesn't confirm there's a deal.'\n\nChief whip Mark Spencer is understood to have told the rebels there is a 'ladder of redemption' but that 'it is a long one and anyone hoping to climb it would have to be with us every rung of the way.'\n\nSenior No10 figures have also discussed kicking out any Eurosceptic Tory rebels who refuse to back a deal.", "description": "The PM needs the support of many of the 21 MPs kicked out of the party last month, including former chancellors Philip Hammond and Ken Clarke, if he is to get a deal through.", "authors": ["Jack Doyle", "Associate Editor", "For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/02/19768570-0-image-a-23_1571191196340.jpg", "published_at": "2019-10-16"}