{"pub": "yahoo", "title": "Pitbull Staying In Florida To Protect Family From Hurricane Dorian, Cancels LA Concert", "url": "https://news.yahoo.com/pitbull-staying-florida-protect-family-011423192.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 01:00:14.545526+00:00", "text": "Singer Pitbull has been forced to cancel his concert in Los Angeles tonight, he has decided to stay back in Florida and ensure the safety of his family.\n\nThe Miami native just released a statement saying, \"Due to Hurricane Dorian’s fast changing weather conditions approaching South Florida and the Eastern Seaboard tonight’s concert has been postponed until September 12. We’re sorry to disappoint fans, but are excited to hit the stage on the new rescheduled date.\"\n\nA spokesperson for the venue, the LA County Fair, also addressed the situation giving their prayers to anyone affected.\n\n\"Due to Hurricane Dorian, the Pitbull concert at the LA County Fair has been tentatively rescheduled for Thursday, Sept. 12 at 7:30 p.m.\n\nAccording to Pitbull’s management, the artist cannot safely depart from Miami. Pitbull, a resident of Miami, has chosen to stay and tend to the safety of his family.\n\nAny ticket holders who planned to attend the Pitbull concert today may still use their ticket to visit the LA County Fair today, Sunday, Sept. 1. Admission will also be honored on the rescheduled date of the concert Thursday, Sept. 12.\n\nOur thoughts are with all affected families along the Southeastern seaboard.\" officials for the LA County Fair wrote.\n\nHurricane Dorian just slammed into the Bahamas and will make its way to the Florida coast tonight.\n\nHarrowing images from the destruction have started to make their way onto social media and newscasts.\n\nCelebrity Chef José Andrés made his way Sunday to the Bahamas and his charity has “kitchens ready to go and shelters mapped out.\"\n\nAndrés shared footage of himself where he said he was around 80 miles away from the eye of the storm.\n\n\"Let's pray for everybody\" the chef says in the video. The footage is scary as the 180 mph winds rages around him as he addresses the public.", "description": "Pitbull Staying In Florida To Protect Family From Hurricane", "authors": ["Mike Walters"], "top_image": "https://s.yimg.com/uu/api/res/1.2/k3CO6d.fRTQ0i8ouMJLv6A--~B/aD03OTM7dz04MTQ7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/theblast_73/94d7490cb10bab55574cafd8a8748f54"}