{"pub": "metro", "url": "https://metro.co.uk/2019/10/27/wilfried-zaha-digs-arsenal-star-matteo-guendouzi-clash-crystal-palace-draw-10994204", "downloaded_at": "2019-10-28 00:30:10.553111+00:00", "title": "Wilfried Zaha digs out Arsenal star Matteo Guendouzi after clash during Crystal Palace draw", "language": "en", "text": "Crystal Palace ace Wilfried Zaha clashed with Arsenal midfielder Matteo Guendouzi (Picture: Getty)\n\nCrystal Palace ace Wilfried Zaha has taken a swipe at Arsenal midfielder Matteo Guendouzi after the pair clashed during the thrilling Premier League draw at the Emirates.\n\nThe Eagles fought back from 2-0 down to earn a point against Unai Emery’s Arsenal on Sunday afternoon\n\nDefensive duo Sokratis Papastathopoulos and David Luiz had seemingly put Arsenal on course for a comfortable win with two goals inside the first ten minutes.\n\nZaha and Guendouzi embrace after the match (Picture: Getty)\n\nBut Arsenal’s defensive fragilities were once again exposed as goals from Luka Milivojevic and Jordan Ayew saw the south Londoners level in the second half.\n\nZaha won the penalty from which Milivojevic scored and led a counter-attack in the dying minutes before being cynically taken down by Frenchman Guendouzi.\n\nThe bizarre foul led to a melee among the players and Zaha has taken to social media to aim a dig at his Arsenal rival.\n\nExplaining why he was forced to take Zaha down so late in the match, Guendouzi said: ‘I had to foul Zaha at the end, otherwise he is through on goal on his own.\n\nAdvertisement\n\nAdvertisement\n\n‘I’m the last defender but I’m far from our goal as well. I had to do it.’\n\nOn Arsenal’s disappointing draw with Palace, Guendouzi added: ‘We really wanted to win the game so we attacked a lot towards the end to get the third goal.\n\n‘We allowed spaces [for Palace on the break] but it’s because we really wanted to win. It’s not a mental issue. We didn’t manage to hold our advantage.\n\n‘We knew they were a good team, with individual quality, and they played well for their goals.\n\n‘Zaha did well to get a penalty. It’s down to us to work so we win these kinds of matches after taking the lead.’\n\nMORE: Jenas reserves special praise for ‘underrated’ Liverpool captain Henderson after Tottenham win", "description": "Crystal Palace ace Wilfried Zaha has taken a swipe at Arsenal midfielder Matteo Guendouzi after the pair clashed during the thrilling Premier League draw at the Emirates. The Eagles fought...", "authors": ["Metro Sport Reporter"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1178483534_1572210603.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-27"}