{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/9/kansas-coach-self-bristles-at-idea-of-trolling-nca", "downloaded_at": "2019-10-10 00:46:20.596058+00:00", "title": "Kansas coach Self bristles at idea of 'trolling' NCAA", "language": "en", "text": "LAWRENCE, Kan. (AP) - Kansas coach Bill Self bristled at the suggestion Wednesday that he was sending a message to the NCAA following its investigation into his basketball program when he donned an Adidas jersey and golden chain for a recent promotional video.\n\nThe Jayhawks received a notice of allegations late last month alleging severe violations tied to recruiting and a responsibility charge leveled against Self, along with a lack of institutional control.\n\nThe notice from the NCAA does not detail what Kansas is accused of doing, but it is among the most prominent to surface during an FBI investigation into Adidas - the school’s longtime sponsor. Among the allegations in that case is that an Adidas employee funneled money from the company to recruits.\n\nThe school and Self said they “strongly disagree” with the accusations and plan to appeal, and some believe the Hall of Fame coach was trolling the NCAA with his promo for Late Night in the Phog.\n\n“That has been a narrative some people have used since this, and anybody who knows me knows I’m not smart enough to figure out some of those things that have transpired would relate to anything other than that moment,” Self said. “I do stuff for Late Night every year. This year was no different.”\n\nOh, but it was different.\n\nNot only did Self star in the controversial promotional video, the featured act was rapper Snoop Dogg, who among other things shot cannons full of fake money at players and prospective recruits.\n\nThe performance led Kansas athletic director Jeff Long to issue a public apology.\n\n“I’ve already addressed and spoke to what happened the other night,” Self said during the Jayhawks‘ annual media day Wednesday. “I don’t know how any entertainer would in any way, shape or form thought to be sticking it to anybody, including the NCAA, by performing.\n\n“I do not like the narrative that has been said concerning that with me,” Self continued, “but I also understand that I can’t control what the media writes or their opinions.”\n\nAll the off-the-court drama has overshadowed what could be a big season for the Jayhawks, who some have already pegged as Final Four contenders. They return a trio of big men that are among the best in the nation in Udoka Azubuike, David McCormick and Silvio de Sousa; they have experience in the backcourt with Devon Dotson and Marcus Garrett; and they have plenty of role players at other positions.\n\nThe Jayhawks, who open the regular season against Duke in the Champions Classic on Nov. 5, also will have a sizeable chip on their shoulder. Not only have the NCAA allegations cast the entire program in a negative light, the Jayhawks are not defending a Big 12 title for the first time in 15 years.\n\nTexas Tech and Kansas State shared the championship last season.\n\n“I don’t want to make it sound like I haven’t been motivated in the past. I’d like to think I’m pretty turned up each and every year,” Self said, “but this has certainly been a unique offseason.”\n\nIn some respects, Self said, the NCAA mess has “put perspective and focus at motivation at the forefront of what we do.” And that could ultimately be a silver lining to it.\n\n“Right now I just think we are so motivated,” De Sousa said. “I have been a part of so many teams, and I’ve just never seen something like this.”\n\nThe Jayhawks already have endured Self’s notorious “boot camp” conditioning program, and they are a couple of weeks into practice. More than anything, the ability to turn the focus to a zone defense - “It’s not very good,” Self quipped - or an offensive set or rebounding is a blessing.\n\nIt sure beats thinking about the NCAA, the FBI investigation and other things out of their control.\n\n“Like coach tells us every day, it has nothing to do with us,” said Garrett, one of the team’s elder statesmen. “He just tells us he’s going to handle it. So we just go out and practice every day trying to get better and get ready for the first game.”\n\n___\n\nMore AP college basketball: https://apnews.com/Collegebasketball and https://twitter.com/AP_Top25\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Kansas coach Bill Self bristled at the suggestion Wednesday that he was sending a message to the NCAA following its investigation into his basketball program when he donned an Adidas jersey and golden chain for a recent promotional video.", "authors": ["The Washington Times Http", "Dave Skretta"], "top_image": "", "published_at": "2019-10-09"}