{"pub": "nytimes", "url": "https://nytimes.com/2019/10/15/us/politics/impeachment-george-kent-state.html", "downloaded_at": "2019-10-15 16:50:12.393043+00:00", "title": "Impeachment Investigators Question George Kent, State Dept. Ukraine Expert", "language": "en", "text": "Investigators were waiting to see if the Trump administration and key witnesses in the case would produce documents related to Mr. Trump’s conversations with Mr. Zelensky, the decision to withhold $391 million in security aid for Ukraine this summer, and other matters. Those already under subpoena to produce the material include the Office of Management and Budget, the Defense Department and Mr. Giuliani. Vice President Mike Pence also faces a deadline to hand over a vast set of records voluntarily, or face a subpoena.\n\nThe deadlines force each department or witness to decide between the demands of Congress and White House’s direction not to cooperate with the House’s work. Seeking to tip the scales in favor of cooperation, Democrats have warned that not doing so will be considered obstruction of their impeachment inquiry, behavior worthy of its own impeachment article against Mr. Trump.\n\nNew requests for depositions were still stacking up. The committees wrote on Friday to two top officials at the White House budget office, requesting they appear next week to discuss the suspension of the security aid, according to one of the officials. They targeted Russ Vought, the office’s acting director, and Michael Duffey, a senior Trump appointee there who was said to have helped approve orders freezing the funds. The letters to the men said merely that investigators believed they had “information relevant to these matters.”\n\nMr. Kent was believed to have special insight into Mr. Trump’s pressure campaign on Ukraine, but he was also deeply involved in previous efforts to persuade the country to investigate corruption. In his earlier roles, Mr. Kent had aggressively pushed Ukrainian prosecutors to pursue investigations into Mykola Zlochevsky, an oligarch who owned a gas company that started paying Hunter Biden, the presidential candidate’s son, as a board member in 2014.\n\nWhen a British case against Mr. Zlochevsky for money laundering was dismissed in January 2015 for lack of evidence, Mr. Kent and others in the State Department blamed Ukrainian prosecutors. The Ukrainian prosecutors had refused to provide evidence to British prosecutors, Mr. Kent told associates, because they and other officials were being paid off by Mr. Zlochevsky or his allies.\n\nTensions boiled over at a previously unreported meeting in early February 2015 in Kiev, in which Mr. Kent scolded a deputy prosecutor in the office of Vitaly Yarema, who was the general prosecutor of Ukraine — the nation’s top law enforcement post, similar to that of the attorney general of the United States.\n\nAccording to a Ukrainian and an American with knowledge of the meeting, Mr. Kent, demanded of the deputy prosecutor, “Who took the bribe and how much was it?”", "description": "Mr. Kent raised concerns to colleagues early this year about the pressure being directed at Ukraine by President Trump and his private lawyer, Rudolph W. Giuliani.", "authors": ["Nicholas Fandos", "Kenneth P. Vogel"], "top_image": "https://static01.nyt.com/images/2019/10/15/us/politics/15dc-impeach01/15dc-impeach01-facebookJumbo.jpg", "published_at": "2019-10-15"}