{"pub": "hotair", "title": "Tony Blair: BoJo’s laying a trap, and Corbyn’s the bait", "url": "https://hotair.com/archives/ed-morrissey/2019/09/02/tony-blair-bojos-laying-trap-corbyns-bait", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:04:10.089623+00:00", "text": "“We want a general election,” Labour leader Jeremy Corbyn declared today, in order to “do everything we can in the coming weeks to prevent a no deal [Brexit].” His more wily predecessor warned in response that Corbyn’s walking into “an elephant trap.” A general election is exactly what Boris Johnson wants, Blair argued later, because it will create a referendum not just on Brexit but also on the idea of the odious Corbyn as prime minister. Blair politely suggested that Labour might not like what British voters have to say about that idea at all:\n\n“Boris Johnson knows that if no-deal Brexit stands on its own as a proposition it might well fail but if he mixes it up with the Corbyn question in a general election he could succeed despite a majority being against a no-deal Brexit because some may fear a Corbyn premiership more,” Blair said. Labour leader Jeremy Corbyn “should see an election before Brexit is decided for the elephant trap it is,” he said.\n\nJohnson ally Jacob Rees-Mogg is already shaping the electoral battlefield in that direction:\n\nHouse of Commons Leader Jacob Rees-Mogg has said rebel legislation would be considered a matter of confidence in the government. “It is important for the government to establish the confidence of the House of Commons and this is essentially a confidence matter: Who should control the legislative agenda, Jeremy Corbyn or Boris Johnson?” Rees-Mogg said.\n\nBlair’s analysis matches that of practically everyone else but Corbyn and his allies. It’s been clear that Johnson has been maneuvering for a no-confidence motion in order to get “pushed” into a general election. Johnson can delay it so that a no-deal Brexit takes place before the election; in fact, it will be nearly impossible to hold an election prior to the October 31st deadline. Corbyn’s demand for an election puts the knife in his hand rather than Johnson’s, which is also a very clever trap by Johnson.\n\nIs it wise to push Corbyn into this position? Johnson thinks his no-holds-barred approach to Brexit will generate a lot of goodwill with voters, and thus far the data suggests he’s correct. A poll in the past two weeks showed the Conservatives vaulting to a 14-point lead over Labour, rising seventeen points from a May survey in the same polling series. Corbyn’s party declined six points in the same period. Some of Johnson’s gains came at the expense of Nigel Farage’s Brexit party, which advocated the hard line that Johnson has adopted. Combine that with the chaos of a no-deal Brexit unfolding at the same time, and a decision by British voters to allow Johnson to steer its course would not be surprising at all.\n\nOn the other hand, Johnson will need strict party cohesion in order to win a general election. He has a one-seat majority in Parliament now, provided by ten seats from the Northern Ireland party DUP where Brexit was unpopular to start with and is getting more unpopular the closer a hard border comes. Johnson can’t afford to lose a single person — and yet today he’s threatening a purge unless Tories stop balking at his hardline tactics:\n\nPrime Minister Boris Johnson sharply raised the stakes in the Brexit fight on Monday, threatening to kick members of Parliament out of the Conservative Party if they don’t support his plans to leave the European Union next month. The move comes as Johnson and his opponents position themselves for a fierce showdown over Brexit on Tuesday when Parliament returns from its summer recess. … Conservative rebels reacted angrily to Johnson’s threat to force them out of the party, which would mean they could not run as Conservative candidates in future elections. A general election, as soon as the next few weeks, is a possibility if Johnson and his opponents fail to reach agreement over Brexit.\n\nTalk about traps. That would work if Johnson can guarantee that new Tory candidates can win in those constituencies over incumbents running under another party banner. It’s more likely that these incumbents are reflecting worries from their constituents over a no-deal Brexit, which means that the Tories would not only lose the power of incumbency but would be asking Brexit-skeptical voters to endorse Johnson’s crash-out strategy. Even if the Kantor poll from late last month is accurate, don’t forget that Theresa May forced an election when Tories looked safe in polling, too — and ended up losing the Conservative majority. Things change quickly in British politics, especially in the Brexit era.\n\nPerhaps the best thing Johnson has going for him is Jeremy Corbyn, but that could be a trap, too. Corbyn could step aside and allow a more moderate — or at least less anti-Semitic and more palatable — Labourite to take the reins of the party. If they do that after Johnson gets his general election, Boris might have stepped into an elephant trap of his own. That’s what Blair hinted at in today’s speech, not-so-subtly urging his successor to take one for the team and for the nation. Corbyn hasn’t been smart enough to see that so far, and unless he has this up his sleeve, he doesn’t appear to have figured out Johnson’s play even while everyone else has.", "description": "Johnson: Expulsion for Tories who cross me.", "authors": ["Ed Morrissey", "Karen Townsend", "Taylor Millard", "Andrew Malcolm", "John Sexton"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/blair-trap.png"}