{"pub": "yahoo", "url": "https://finance.yahoo.com/news/etf-areas-shine-very-good-213009045.html", "downloaded_at": "2019-10-13 08:41:51.851652+00:00", "title": "ETF Areas to Shine on 'Very Good' Trade Negotiation", "language": "en", "text": "President Trump’s comments on the ongoing two-day meeting between high-level officials over trade have ignited hopes of a truce. The more than 15-month long trade tussle has seen tariffs on billions of dollars of goods, impeding global economic growth.\n\n\"We had a very, very good negotiation with China,\" said President Trump to the reporters after the talks were over for the first day of the meeting. He also threw light on his plans to meet the Chinese Vice Premier Liu He at the White House on Oct 11 (read: Chip ETFs in Focus as Trump Blacklists More Chinese Tech Firms).\n\nPartial Trade Deal in the Cards?\n\nA Bloomberg report pointed out that Chinese officials are ready to enter a partial trade deal with the United States. Beijing is ready to increase its purchases of U.S. agricultural products. In return, it expects the United States to call off the tariff hike of 5% on $250 billion of Chinese goods, which is supposed to go into effect on Oct 15.\n\nOf late, there have been some moves made by both the sides toward a truce. China recently provided waivers to several state and private companies to purchase U.S. soybeans without facing retaliatory tariffs. Per a CNN article, the Trump government is prepared to soon approve license requests from the American suppliers for selling non-sensitive goods to the Chinese telecommunication giant, Huawei Technology Co (read: 4 Sector ETFs & Stocks to Bet on Ahead of Q3 Earnings).\n\nETF Winners to Watch\n\nUS Agricultural/Livestock ETFs\n\nThe U.S. agricultural sector has seen the worst due to the trade war. However, the latest developments might bring some relief to the sector. Thus, investors can keep an eye on ETFs like Invesco DB Agriculture Fund DBA, Teucrium Wheat Fund WEAT, ELEMENTS Linked to the Rogers International Commodity Index - Agriculture Total Return RJA, iPath Series B Bloomberg Grains Subindex Total Return ETN JJG and iPath Series B Bloomberg Livestock Subindex Total Return ETN COW (see: all the Agricultural ETFs here).\n\nSemiconductor ETFs\n\nMeanwhile, let’s take a look at some of the semiconductor ETFs that can gain from the cooling down of trade tensions. iShares PHLX Semiconductor ETF SOXX and VanEck Vectors Semiconductor ETF SMH can be given a thought. Investors can also look at leveraged ETFs like Direxion Daily Semiconductors Bull 3x Shares (SOXL) and the ProShares Ultra Semiconductors (USD).\n\nGrowth ETFs\n\nGrowth stocks are high in quality and are likely to witness revenue and earnings growth at a faster rate than the industry average. As such, growth funds tend to outperform during an uptrend. While there are plenty of options in the growth ETF world, we have highlighted five funds that offer broad-based exposure to the U.S. stock market like Vanguard Growth ETF VUG, Schwab U.S. Large-Cap Growth ETF SCHG, iShares Core S&P U.S. Growth ETF IUSG, SPDR S&P 500 Growth ETF SPYG and Vanguard Mega Cap Growth ETF MGK.\n\nChina ETFs\n\nAgainst this backdrop, investors can also keep a tab on a few China ETFs like iShares China Large-Cap ETF FXI, iShares MSCI China ETF MCHI, Xtrackers Harvest CSI 300 China A-Shares ETF ASHR and Invesco Golden Dragon China ETF PGJ.\n\nConclusion\n\nThe easing of monetary policies by certain economies has bolstered confidence in investors and taken care of recessionary fears to some extent. However, some analysts believe that the speed at which ‘attacks and retaliations’ are taking place followed by the decision reversals in the trade-war game, it is increasing the uncertainty in global markets. Such periods of high volatility and ambiguity keep investors on edge while making it difficult for business houses to plan out a strong and concrete business strategy and capital expenditures. Therefore, a trade deal is much needed at this point of time.\n\nWant key ETF info delivered straight to your inbox?\n\nZacks’ free Fund Newsletter will brief you on top news and analysis, as well as top-performing ETFs, each week. Get it free >>\n\n\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n\n\nSchwab U.S. Large-Cap Growth ETF (SCHG): ETF Research Reports\n\n\n\nXtrackers Harvest CSI 300 China A-Shares ETF (ASHR): ETF Research Reports\n\n\n\nInvesco Golden Dragon China ETF (PGJ): ETF Research Reports\n\n\n\niShares China Large-Cap ETF (FXI): ETF Research Reports\n\n\n\nDirexion Daily Semiconductor Bull 3X Shares (SOXL): ETF Research Reports\n\n\n\nVanguard Mega Cap Growth ETF (MGK): ETF Research Reports\n\n\n\niShares MSCI China ETF (MCHI): ETF Research Reports\n\n\n\niShares PHLX Semiconductor ETF (SOXX): ETF Research Reports\n\n\n\nVanEck Vectors Semiconductor ETF (SMH): ETF Research Reports\n\n\n\nTeucrium Wheat Fund (WEAT): ETF Research Reports\n\n\n\nInvesco DB Agriculture Fund (DBA): ETF Research Reports\n\n\n\niPath Series B Bloomberg Grains Subindex Total Return ETN (JJG): ETF Research Reports\n\n\n\niShares Core S&P U.S. Growth ETF (IUSG): ETF Research Reports\n\n\n\nVanguard Growth ETF (VUG): ETF Research Reports\n\n\n\nSprint Corporation (S) : Free Stock Analysis Report\n\n\n\nTo read this article on Zacks.com click here.\n\n\n\nZacks Investment Research\n\n\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report", "description": "We highlight some ETF areas that are poised to gain from the progress in trade talks between the two largest economies.", "authors": ["Sweta Jaiswal"], "top_image": "https://s.yimg.com/uu/api/res/1.2/wEBg3cM2E7Iuk.OdAO74yA--~B/aD00MDA7dz02MzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/c5c71cf7401c7df454ad4e859a131fbf", "published_at": "2019-10-11"}