{"pub": "breitbart", "url": "https://breitbart.com/border/2019/10/10/video-mexican-legislator-hands-marijuana-to-colleague-during-decriminalization-speech", "downloaded_at": "2019-10-10 18:32:45.137643+00:00", "title": "VIDEO: Mexican Legislator Hands Marijuana to Colleague During Decriminalization Speech", "language": "en", "text": "A Mexican congresswoman paused her speech in a legislative session to pull out a marijuana joint in favor of legalization.\n\nA video posted on social media by Rep. Lucia Riojas (Independent–Mexico City) showed the moment she pulled out a marijuana joint and gave it to Mexico’s Secretary of the Interior Olga Sanchez Cordero.\n\nUn recordatorio a @M_OlgaSCordero sobre la urgencia de la despenalización de las drogas.#Legalización pic.twitter.com/tvIsqqUJS6 — lucía (@LuRiojas) October 9, 2019\n\n“This is a reminder of that proposal that you made at the beginning,” Riojas said. The federal legislator identifies as a feminist lesbian on her Twitter bio and carries a reputation for being a young, outspoken activist in the governing body.\n\nView this post on Instagram A post shared by Lucía Riojas (@luriojasm) on Oct 25, 2018 at 10:56am PDT\n\nThe episode comes at a time when several officials are pushing for legalizing drugs amid statements from the country’s president that the war on drugs is “over.”\n\nDespite the push to legalize with the hope for an end to armed cartel conflicts, violence continues to expand into new areas once thought to be immune. In addition to hotspots like Veracruz, Guerrero, Tamaulipas, and Chihuahua, bloodshed is spreading to central Mexican states like Guanajuato, Queretaro, and Mexico State itself while resort areas like Cancun and the Baja continue to suffer.\n\nThe approach by Mexico’s federal government is causing tensions between border states and President Andres Manuel Lopez Obrador. The governor of Tamaulipas publicly shamed federal authorities for not fighting cartels in his region.\n\nIldefonso Ortiz is an award-winning journalist with Breitbart Texas. He co-founded Breitbart Texas’ Cartel Chronicles project with Brandon Darby and senior Breitbart management. You can follow him on Twitter and on Facebook. He can be contacted at Iortiz@breitbart.com.\n\nBrandon Darby is the managing director and editor-in-chief of Breitbart Texas. He co-founded Breitbart Texas’ Cartel Chronicles project with Ildefonso Ortiz and senior Breitbart management. Follow him on Twitter and Facebook. He can be contacted at bdarby@breitbart.com.", "description": "A Mexican congresswoman paused her speech in a legislative session to pull out a marijuana joint in favor of legalization.", "authors": ["Ildefonso Ortiz", "Brandon Darby"], "top_image": "https://media.breitbart.com/media/2019/10/Mexican-Congress-Joint-640x335.png", "published_at": "2019-10-10"}