{"pub": "cnbc", "url": "https://cnbc.com/2019/09/11/naspers-prosus-lists-in-amsterdam-at-100-billion-valuation.html", "downloaded_at": "2019-09-11 13:56:37.412083+00:00", "title": "A $100 billion tech company you've never heard of just listed in Europe", "language": "en", "text": "Prosus, a global consumer internet group and one of the largest technology investors in the world, starts trading through a primary listing on Euronext Amsterdam. Prosus\n\nEurope has lamented its lack of big internet technology companies capable of competing with U.S. and Chinese giants like Google, Facebook, Alibaba and Tencent. Overnight, the continent's fortunes changed in the form of a $100 billion consumer internet company that listed publicly Wednesday in Amsterdam. The company is called Prosus, and it's a spinoff of South African consumer internet conglomerate Naspers. Prosus said its market capitalization on its first day of trading is roughly $100 billion, making it one of the 10 biggest consumer internet groups in the world. \"The listing of Prosus is an exciting step forwards for the group, giving global technology investors direct access to our unique and attractive portfolio of international consumer internet businesses,\" Naspers and Prosus Group CEO Bob van Dijk said in a press release Wednesday.\n\nProsus is not a consumer internet business itself, meaning it doesn't offer digital services under its own brand like Facebook or Alibaba, for example. Instead, it invests in a portfolio of global internet firms in sectors ranging from payments and fintech (financial technology) to food delivery. The group's best-known investment is a 31% stake in Chinese tech giant Tencent, a gaming titan and owner of the hugely popular messaging app WeChat. Naspers made a $32 million investment in Tencent in 2001, a bet now worth $130 billion. Under the new structure, Prosus will hold Nasper's Tencent stake, as well as positions in other firms like Russian social media company Mail.ru Group and German food delivery service Delivery Hero. Naspers will remain a majority owner of the new company.\n\nEurope playing catch-up\n\nThe addition of Prosus to the Amsterdam exchange shakes up Europe's tech landscape, with the company instantly becoming one of the biggest tech entities in the region. According to data compiled by Reuters, it is only outmatched in size by German software firm SAP, which is valued at roughly $135 billion. Europe has lagged behind the U.S. and China as a home for big tech companies. Of the 20 biggest internet companies by value in 2018, none were headquartered in Europe, according to data from the World Economic Forum. Last month, reports emerged that the EU had drafted a plan for a sovereign wealth fund to invest in \"high-potential European companies\" that could compete with U.S. and Chinese big tech firms. \"Naspers believes that the choice of Euronext Amsterdam is, and will be, beneficial to the company as Euronext markets are some of the largest, most integrated and proven capital markets in Europe,\" the company said in its prospectus.\n\nEach morning, the “Beyond the Valley” newsletter brings you all the latest from the vast, dynamic world of tech – outside the Silicon Valley. Subscribe: By signing up for newsletters, you are agreeing to our Terms of Use and Privacy Policy.", "description": "Prosus, a spinoff of South African consumer internet group Naspers valued at $100 billion, listed on the Amsterdam Euronext exchange Wednesday.", "authors": ["Elizabeth Schulze"], "top_image": "https://image.cnbcfm.com/api/v1/image/106123590-1568196113233naspersipo.jpg?v=1568196194", "published_at": "2019-09-11"}