{"pub": "guardian", "url": "https://theguardian.com/fashion/2019/sep/25/the-layering-secret-how-to-get-a-whole-new-wardrobe-from-your-old-clothes", "downloaded_at": "2019-09-25 13:38:07.168190+00:00", "title": "The layering secret: how to get a whole new wardrobe from your old clothes", "language": "en", "text": "Combining items you already own is sustainable and chic, but this season’s big trend takes confidence and skill. Our writer gets a masterclass in how to do it well\n\nThe layering secret: how to get a whole new wardrobe from your old clothes\n\nI feel about layering the same way I feel about flossing – I know I should do it, but I never seem to manage it. Layering seems a bit of a palaver, an elaborate affair for dowagers trussed up in yards of crinoline and lace. Without a maidservant to dress me, I wear a uniform of tracksuit bottoms, T-shirts and hoodies.\n\nAnd besides, I hate to feel constricted. Three-quarter-length sleeves and elasticated waistbands are the equivalent of a window flung open in summer: so freeing! Clothes should accommodate, not constrain.\n\nBut. I’ve seen them lately. Women in gossamer-thin turtlenecks layered under crisp cotton shirts, worn with oversized cardigans with the sleeves rolled up just so. They look purposeful … and warm. The sight of a cuff peeking out of a jumper under a blazer is visual poetry.\n\nThe Olympians of layering are, of course, the Olsen twins: layering icons who have built the respected fashion label the Row out of knowing exactly how many layers the human body can take before it goes from chic to derelicte (in their case, approximately 14. For regular mortals, no more than five.)\n\nFacebook Twitter Pinterest Layered looks on the catwalk from (l-r) Fendi, Victoria Beckham and Joseph. Composite: Getty,\n\nLayering is also a way to reinvigorate your wardrobe, without extra expense. At London fashion week, Extinction Rebellion protested against the fashion industry’s ruinous environmental impact – estimates for the average lifespan of a garment in the UK range between two and three years. New layering combinations could help them live longer. On Instagram, the #iworeitagain challenge urges fashion-conscious consumers to experiment with the clothes they already own. Well-chosen layers give tired outfits a new lease of life – you can shop your own wardrobe, and get ready for the new season. A long-sleeved T-shirt under a slipdress lets you wear your summer wardrobe well into the winter months – and you can channel your inner Courtney Love.\n\nIt is also on trend. At Victoria Beckham’s spring/summer 2020 show, models strode across the Foreign and Commonwealth Office in rollnecks layered under safari shirts, cuffs hanging low to cover the wrists. At Joseph’s SS20 Resort collection: a cobalt-blue double-breasted jacket, worn over a matching kilt – and trousers. At Fendi’s AW19 ready-to-wear show, thin bodysuits were layered underneath shirts, jumpers and dresses, styled with monogrammed tights that looked like leggings.\n\nLayering is an intentional way of dressing; it takes confidence and skill. This is why I have invited the Guardian’s styling editor Melanie Wilkinson over to my home, to help me restyle my wardrobe.\n\n“People are scared of layering,” Wilkinson observes, flipping through my closet. “They think it’s going to look really bulky, but in fact it’s a great way to get the most out of your wardrobe.”\n\nWilkinson teaches me the two cardinal rules of layering: one, never layer your bottom half, and two, start with finer, thinner materials and work your way out.\n\n“The main thing you need to think about when you are layering is the thickness of the fabrics,” she says. “You need lots of light things to go under chunky things.” Stick to these rules, and you won’t end up resembling Joey from Friends.\n\nUsing my own clothes, Wilkinson came up with five brand-new looks to help me layer my way into the winter months.\n\nLook one\n\nFacebook Twitter Pinterest The perfect transitional September dressing. Photograph: Andy Hall/The Observer\n\nWilkinson pulls a Warehouse mididress out of my wardrobe and styles it with a white Topshop long-sleeve rollneck T-shirt. I’m not sure about the fluted three-quarter-length sleeves over a long-sleeve T-shirt, but Wilkinson reassures me they look great. Paired with my trusty Dr Martens, it’s perfect for transitional September dressing. And an outfit I have worn since.\n\nLook two\n\nFacebook Twitter Pinterest Entry-level layering. Photograph: Andy Hall/The Observer\n\nI keep on the Topshop T-shirt, which I wear under my favourite striped LF Markey jumper, the sleeves rolled up slightly. Paired with my blue Katharine Hamnett jeans and brown, low-heeled Nanushka boots, this is entry-level layering: a BTech rather than the full Olsen doctoral programme. I like how the rollneck peeks out from under the jumper, though; it makes an everyday outfit of jumper and jeans look more modern.\n\nLook three\n\nFacebook Twitter Pinterest Smart, with a French tuck. Photograph: Andy Hall/The Observer\n\nA Cos white shirt, under my camel-coloured & Other Stories jumper, with a Monki blazer on top. I keep on the jeans and boots. Wilkinson frowns, and then arranges my jumper so that it is in a French tuck. (It’s good to accentuate your waistline when wearing multiple layers, so that you don’t look swamped in fabric.) I feel smart – I wouldn’t normally wear a shirt under this jumper, which I prefer to pair with jeans and trainers – but it works. I would wear this to a job interview.\n\nLook four\n\nFacebook Twitter Pinterest Wearing a jumper under a shirt is a fresher take on layering. Photograph: Andy Hall/The Observer\n\nI slip a black, long-sleeved & Other Stories jumper under the Cos shirt, and wear my Paloma Wool button-down overcoat on top. On my bottom half, Tommy Hilfiger chinos and my much-loved Vans. It feels odd to be wearing a jumper underneath a shirt, but Wilkinson explains that this is a fresher, modern take on layering.\n\nI feel as if I could do anything in this outfit: build furniture, change a tyre, even heckle a prime minister if the opportunity arose.\n\nLook five\n\nFacebook Twitter Pinterest Style a bomber jacket with a cardigan for effective contrast. Photograph: Andy Hall/The Observer\n\nCos cream jeans, with a sheer black roll-neck I picked up from Depop to wear clubbing, but that now languishes in my wardrobe, because I don’t go out any more. A grey cardigan, my Katharine Hamnett bomber jacket, and Vans. Wilkinson steps back, proud of her handiwork. “Most people wouldn’t style a bomber with a cardigan, but I think the contrast works,” she says. She’s right – the utility-meets-nerd style shouldn’t look good, but it does.", "description": "Combining items you already own is sustainable and chic, but this season’s big trend takes confidence and skill. Our writer gets a masterclass in how to do it well", "authors": ["Sirin Kale"], "top_image": "https://i.guim.co.uk/img/media/7c2b2a26c7b1d2549ff9a417080d9c7ba2591322/278_954_5773_3464/master/5773.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b13eca1a8c08b35a55689b2407759108", "published_at": "2019-09-25"}