{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/15/pear-therapeutics-ceo-explains-app-for-addiction-t", "downloaded_at": "2019-09-15 23:10:16.579126+00:00", "title": "Pear Therapeutics CEO explains app for addiction treatment", "language": "en", "text": "WASHINGTON (AP) - Smartphone apps have transformed the way we read the news, hail rides and connect with friends and family.\n\nPear Therapeutics aims to leverage that technology to enhance treatment for patients battling addiction with alcohol, opioids and other drugs.\n\nThe company’s first program, reSET, won approval from the Food and Drug Administration in 2017. Study results showed that patients working with the program were more than twice as likely to abstain from alcohol, cocaine, marijuana and stimulants, compared with those who didn’t. A year later, the company’s reSET-O program was approved specifically for patients being treated for opioid addiction.\n\nPear CEO Corey McCann spoke with The Associated Press about the company’s technology. The conversation has been edited for clarity and length.\n\nQ: Pear sells the first software programs that require a doctor’s prescription. What happens after a patient downloads a product like reSET?\n\nA: The prescription unlocks the product for 12 weeks of continuous access. And during that 12 weeks, I interact with the products to report my cravings and triggers. All of that goes to my physician and really helps to reinforce the physician-patient interaction. I also complete a set of modules of what’s called community reinforcement approach, which is a very specific type of neuro-behavioral intervention for addiction. I complete four of those modules per week so that’s about 30 minutes of engagement. As I’m completing those modules I receive rewards that incentivize me to continue participating with the software.\n\nQ: Many of us have experienced the addictive nature of apps like Facebook or Twitter. Is this technology similar to that?\n\nA: It’s well known that addicted patients respond very favorably to what are called variable reward schedules. So our program is a highly engaging mechanism for patients with substance use and opioid use disorder. What we’re finding is that all of these different patient populations interact with technology and are engaged in entirely specific ways. What technology has done prior to Pear is to look at the way that healthy, normal people like you and I presumably interact with technology.\n\nQ: So how are these patients different?\n\nA: I guess in layman’s terms, if you’ve ever been to a casino and seen someone playing a slot machine, smoking a cigarette and drinking a martini - there’s an old adage that “it’s all dopamine.” What happens when you look at these patients’ brains is they’re really just swimming in dopamine.\n\nQ: What are the actual rewards or perks that patients get from these apps?\n\nA: Patients receive everything from badges and digital “at-a-boys” to things like gift cards for Starbucks and things of nominal financial value which can’t be exchanged for substances of abuse. And each of the patients interacts with these different reward schedules in different ways. A good deal of the novelty is in pairing up the right patient with the right reward corresponding to the right amount.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Smartphone apps have transformed the way we read the news, hail rides and connect with friends and family.", "authors": ["The Washington Times Http", "Matthew Perrone"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/15/insider_qa-pear_therapeutics_44313_c0-210-5011-3131_s1770x1032.jpg?c60e74d0c1e61e3642a28152ad7dbb04d3e6ca38", "published_at": "2019-09-15"}