{"pub": "fox", "url": "https://foxbusiness.com/sports/new-england-patriots-have-the-best-dressed-fans-in-the-nfl", "downloaded_at": "2019-10-03 23:31:59.725940+00:00", "published_at": "2019-10-03", "title": "This NFL team's logo is the most-requested option for suit linings", "language": "en", "text": "New England Patriots quarterback Tom Brady is considered one of the most fashionable players in the NFL. It turns out that fans of the Patriots are not far behind according to data provided by Tailored Brands.\n\nContinue Reading Below\n\nThe company, which owns men’s clothiers Jos. A. Bank and Men’s Wearhouse, offers NFL linings to their suits. The linings feature a specific team’s logo splashed throughout the inside of the suit jacket. And according to Tailored Brands, the Patriots are the top team purchased at the company's stores.\n\nThe Philadelphia Eagles, who beat the Patriots in the Super Bowl two years ago, were in second place. The Chicago Bears were the third most popular suit choice.\n\nThe fact that the Patriots top the list probably isn’t a surprise. The New England fanbase is expansive and truly regional, both of which coupled with the success of the team in recent years make for a strong connection between the organization and its supporters.\n\nThe same can be said of the Eagles, who won the first Super Bowl in franchise history two years ago and are still riding that wave of euphoria among their fans.\n\nThe data comes from the over 500 Jos. A. Bank stores throughout the country as well as the more than 700 Men’s Wearhouse locations.\n\nThe clothing store announced last week that it also is offering NHL linings for suits.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE", "description": "The best dressed fans in the NFL might just be those who follow the New England Patriots.", "authors": ["Kristian Dyer"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/suit-001.jpg?ve=1&tl=1"}