{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nfl/2019/10/20/cowboys-run-over-eagles-take-1st-in-nfc-east-with-37-10-win/40352243", "downloaded_at": "2019-10-21 04:09:00.748561+00:00", "title": "Cowboys run over Eagles, take 1st in NFC East with 37-10 win", "language": "en", "text": "ARLINGTON, Texas (AP) — Ezekiel Elliott and the Dallas Cowboys are back in control of the NFC East after beating Philadelphia with the division lead on the line.\n\nElliott ran over safety Malcolm Jenkins on his way to 111 yards and a touchdown, Dak Prescott threw an easy scoring pass on a great fake to his star running back before a TD run and the Cowboys rolled to a 37-10 victory over the Eagles on Sunday night.\n\nThe Cowboys (4-3) ended a three-game losing streak that followed their 3-0 start and clouded high expectations for the defending division champs.\n\nCarson Wentz threw an interception and had two of Philadelphia's three lost fumbles. The Eagles (3-4) dropped their second straight game after a two-game winning streak that looked like it might get their season going.\n\nBrett Maher finished the highest-scoring half against Doug Pederson since he became coach of the Eagles in 2016, kicking a 63-yarder on the final play before halftime for a 27-7 lead.\n\nMaher, the only kicker in NFL history with multiple field goals of at least 62 yards, now has three after kicking a 62-yarder last week against the New York Jets. His other from 62 was against the Eagles last season, his first in the league.\n\nPrescott's 8-yard scoring run was the 21st of his career, breaking Roger Staubach's record of 20 rushing TDs by a quarterback.\n\n\"We've just got to keep going,\" Prescott said. \"We've got to build off this.\"\n\nPederson had to clarify during the week that he wasn't guaranteeing a win after saying on his radio show that his team would go down to Dallas, win the game and fly home in first place.\n\nAnd the coach tried to reverse Philadelphia's trend of slow starts by taking the ball after winning the coin flip, just the second time in 33 winning flips that Pederson hasn't deferred in order to start the second half on offense.\n\nIt backfired when the Eagles fumbled on their first two possessions, leading to a pair of touchdowns after the Cowboys got the ball on the opponent's side of the 50 for the first two times this season.\n\nBefore that, Dallas was the only team in the NFL that hadn't started a drive on the favorable side of midfield.\n\n\"I feel like he got a statement today, and so we're going to let him go sleep on it,\" said defensive end DeMarcus Lawrence, whose sack of Wentz created the second turnover.\n\nDallas Goedert fumbled on a hit from Jaylon Smith at the end of an 8-yard catch on the opening possession, and Maliek Collins recovered at the Philadelphia 45. Five plays later, receiver Tavon Austin took an option pitch 20 yards for the score.\n\nAfter Wentz fumbled on the sack by Lawrence, and Antwaun Woods recovered, Elliott ran over Jenkins on the next play on what was ruled a 14-yard score before replay showed his knee down at the 1. Elliott scored on the next play.\n\nThe Cowboys answered the only touchdown from Eagles — Wentz's 28-yard pass to Goedert — when Prescott faked a handoff to Elliott from the 1 and threw to wide-open Blake Jarwin in the end zone for a 21-7 lead.\n\nDallas finished with 189 yards rushing, 116 more than the average that the league's No. 2 run defense was allowing.\n\nElliott, the last back to get 100 yards against the Eagles, did it again on 22 carries. The two-time NFL rushing champion is averaging 115 yards in five games against his division rival. It was his fourth 100-yard game of the season.\n\nPrescott was 21 of 27 for 239 yards with a touchdown and an interception and had another 30 yards rushing. Amari Cooper caught five passes for 106 yards after missing most of a loss to the previous winless New York Jets with a thigh injury.\n\nWentz was 16 of 26 for 191 yards and the Cowboys held the Eagles to 283 yards after the defense struggled at the Jets.\n\nINJURIES\n\nDallas linebacker Leighton Vander Esch didn't return after injuring his neck in the first half. He walked off the field after staying down for a few minutes. Cowboys defensive end Robert Quinn had a sack in the first half before leaving with a rib injury.\n\nUP NEXT\n\nEagles: At Buffalo next Sunday.\n\nCowboys: Open week, followed by a visit to the New York Giants on Monday, Nov. 4.\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nCopyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "Ezekiel Elliott ran over safety Malcolm Jenkins on his way to 111 yards and a touchdown, Dak Prescott accounted for two touchdowns and the Cowboys rolled to a 37-10 victory over the Philadelphia Eagles", "authors": ["Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/49649a4bb8743f0cbed64dad71234e6c49b9413f/c=0-344-4764-3024/local/-/media/2019/10/21/USATODAY/usatsports/e87b9478840d48769b5b9c885bdb669d.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-20"}