{"pub": "usatoday", "url": "https://usatoday.com/story/sports/2019/10/09/world-gymnastics-us-men-have-ways-go-catch-russia-china-japan/3919988002", "downloaded_at": "2019-10-09 18:28:53.296805+00:00", "title": "US men are fourth after near-perfect day at gymnastics world championships", "language": "en", "text": "CLOSE\n\nSTUTTGART, Germany -- The U.S. men have their work cut out for them before the Tokyo Olympics.\n\nAfter a near-perfect day in Wednesday’s team finals, they were still fourth, well behind new world champion Russia, China and Japan. Worse, the gap was even bigger than it was last year, when the Americans were also fourth.\n\nThe U.S. finished more than seven points behind Russia, which won the world title for the first time since the breakup of the Soviet Union. The Americans were about 3½ points from the podium.\n\nBut the Americans aren’t ready to concede the Olympic podium, or any spot on it. Not when the Olympics are still nine months away.\n\nSam Mikulak of the United States celebrates after he competes on the high bar in the men's final of the world gymnastics championships. (Photo: Laurence Griffiths, Getty Images)\n\n“It’s going to be tough,” Sam Mikulak acknowledged. “But our expectation going in is that we’re going to put the pressure on. Hitting routines is how we’re going to be as close as we can. We’re just going to wait for the mistakes to happen on the other hand. That’s going to be our saving grace.\n\n“I can’t promise we’re going to get on that podium. But I can promise we’re going to be a little better next year.”\n\nThe U.S. men haven’t won an Olympic medal since their bronze in 2008. Their last world medal, also bronze, was in 2014. They were seventh in qualifying after a dismal performance, and only Mikulak (all-around, high bar) and Yul Moldauer (all-around) made event finals.\n\nIt’s not for a lack of talent. Mikulak’s score of 86.931 in finals would win him a medal pretty much anywhere, and he also tied for the second-highest score on parallel bars and was third-best on both floor exercise and high bar. Moldauer was sixth on floor.\n\nBut the Americans lack consistency and, more importantly, difficulty.\n\nIn team finals, Russia had 11 routines with a start value of 6.0 or higher, while China had 10 and Japan 13. The Americans? Just six.\n\nThe start value reflects the difficulty of a routine and is combined with the execution score for the final total. Because they don’t have anywhere close to Russia, China or Japan’s difficulty, the Americans are in a deep hole even before the meet begins.\n\n“Obviously we’re doing what we can do,” said U.S. coach Mark Williams, who is Moldauer’s coach at Oklahoma. “The problem is, when you add difficulty, the execution goes down and so does the consistency.”\n\nThe Americans are trying, though.\n\nBrett McClure, the national team coordinator, said team members increased their start values by “two or three tenths” on each event in the past year. If they can do that again ahead of Tokyo, and clean up their bobbles and wobbles – like Mikulak and Moldauer’s dismounts on pommel horse and Trevor Howard’s landing on still rings – the U.S. will be getting somewhere.\n\n“That combination of both will help us get to that 258 to 260 range,” McClure said, referring to the point total needed to reach the podium at this worlds. “We’ll have to be really good, close to perfect if not (perfect). But it’s not out of reach.”\n\nMore depth also would help, Williams said.\n\nPart of what makes the U.S. women so strong is there is a never-ending pipeline of talent. With only about a dozen spots available on the national team and even fewer for world and Olympic teams, the competition is fierce, and gymnasts are constantly pushing each other.\n\nMore than half of the men’s national team retired after the Rio Olympics, leaving a dearth of talent – and competition.\n\n“There was a big hole that we have to fill,” McClure said. “It’s daunting thinking about it in one year, but each year we’ve started to bring more guys into the mix. … You’ve just got to keep pushing forward and doing the same thing.”\n\nIn the meantime, Mikulak and Moldauer will try and make the most of the chances they have left here.\n\n“I just want to keep everything the same as today,” Mikulak said. “Get in the same mindset, just go out, repeat, have fun and keep that energy high.”", "description": "Russia won its first men's team title at the world gymnastics championships since breakup of the Soviet Union. China second, Japan third, USA fourth.", "authors": ["Nancy Armour", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/09/USAT/9a9b4d64-4708-4625-9c0e-103cf6a1f8f5-sam_GTY_1180004536.JPG?crop=4416,2484,x33,y321&width=3200&height=1680&fit=bounds", "published_at": "2019-10-09"}