{"pub": "theverge", "url": "https://theverge.com/2019/9/17/20870706/edward-snowden-book-us-government-justice-lawsuit-profits-release", "downloaded_at": "2019-10-05 13:20:44.898106+00:00", "title": "The US government is suing Edward Snowden for his book profits", "language": "en", "text": "The Justice Department has filed a civil lawsuit against Edward Snowden that would recover all proceeds of his recently released memoir, the department announced on Tuesday. The charges coincide with the official publication of the book, which is titled Permanent Record.\n\nSnowden’s memoir was allegedly not submitted to the CIA or NSA for pre-publication review, a required practice among former employees of intelligence agencies. As such, the department considers the book a breach of Snowden’s fiduciary obligations, and names the publishers as co-defendants in the suit.\n\nThe government of the United States has just announced a lawsuit over my memoir, which was just released today worldwide. This is the book the government does not want you to read: — Edward Snowden (@Snowden) September 17, 2019\n\nGiven the still-classified programs and materials discussed in the memoir, it is unlikely that the book would have been approved for publication by the agencies. Snowden remains a de facto fugitive from the US government, and would likely face charges under the Espionage Act if he returned to the country. But the new civil case could nonetheless cause problems for Snowden, potentially enjoining his publishers from releasing any of the proceeds from the book.\n\nCrucially, the suit does not seek to block the release of Snowden’s memoir, as doing so would be illegal under the First Amendment. Still, many of Snowden’s US defenders see the lawsuit as raising real questions about the constitutionality of the pre-publication review system.\n\n”This book contains no government secrets that have not been previously published by respected news organizations,” said ACLU attorney Ben Wizner, who has represented Snowden in other matters. “Had Mr. Snowden believed that the government would review his book in good faith, he would have submitted it for review. But the government continues to insist that facts that are known and discussed throughout the world are still somehow classified.”\n\nOthers see the lawsuit as an attempt to distract from Snowden’s disclosures. “If only the Justice Department was as concerned with the systematic legal violations carried out by the US government’s mass surveillance programs as they are about trying to blunt the impact of a personal memoir by the person who alerted to public,” Freedom of the Press Foundation director Trevor Timm told The Verge. “This misguided lawsuit is all the more reason everyone should read Snowden’s book.”\n\nUpdate 2:02 PM ET: Updated with comment from Freedom of the Press Foundation and Snowden tweet.\n\n2:31PM ET: Updated with comment from the ACLU’s Ben Wizner.", "description": "The Justice Department has filed a civil lawsuit against Edward Snowden that would recover all proceeds of his recently released memoir, the department announced on Tuesday. The charges coincide with the official publication of the book, which is titled Permanent Record.", "authors": ["Russell Brandom", "Sep"], "top_image": "https://cdn.vox-cdn.com/thumbor/0fFP0zqsPRAtna5HmYpRC4B_V_k=/0x37:2040x1105/fit-in/1200x630/cdn.vox-cdn.com/assets/4525505/Snowden2_CU.png", "published_at": "2019-09-17"}