{"pub": "americanconservative", "url": "https://politico.com/blogs/burns-haberman/2012/05/fordham-piece-called-warren-harvard-laws-first-woman-of-color-123526", "downloaded_at": "2019-10-14 03:48:18.093749+00:00", "title": "Fordham piece called Warren Harvard Law's 'first woman of color'", "language": "en", "text": "Fordham piece called Warren Harvard Law's 'first woman of color'\n\nElizabeth Warren has pushed back hard on questions about a Harvard Crimson piece in 1996 that described her as Native American, saying she had no idea the school where she taught law was billing her that way and saying it never came up during her hiring a year earlier, which others have backed up.\n\nBut a 1997 Fordham Law Review piece described her as Harvard Law School's \"first woman of color,\" based, according to the notes at the bottom of the story, on a \"telephone interview with Michael Chmura, News Director, Harvard Law (Aug. 6, 1996).\"\n\nThe mention was in the middle of a lengthy and heavily-annotated Fordham piece on diversity and affirmative action and women. The title of the piece, by Laura Padilla, was \"Intersectionality and positionality: Situating women of color in the affirmative action dialogue.\"\n\n(See also: 7 pols with Native American heritage)\n\n\"There are few women of color who hold important positions in the academy, Fortune 500 companies, or other prominent fields or industries,\" the piece says. \"This is not inconsequential. Diversifying these arenas, in part by adding qualified women of color to their ranks, remains important for many reaons. For one, there are scant women of color as role models. In my three years at Stanford Law School, there were no professors who were women of color. Harvard Law School hired its first woman of color, Elizabeth Warren, in 1995.\"\n\nPadilla, now at California Western School of Law, told POLITICO in an email that she doesn't remember the details of the conversation with Chmura, who is now at Babson College and didn't respond to a request for comment. It is unclear whether it was Padilla's language or Chmura's.\n\nThe description of her as a minority is coming from the same person - Chmura - whose comments to the Crimson sparked the original story about her heritage, and Warren's camp argued it's old news.\n\nShe has said she had no idea Harvard was billing her that way or how the school found out that her family claims Native American heritage. She learned of it first from the Herald story, she said.\n\nAnd it's possible Warren didn't see the Fordham story.\n\nBut the Fordham piece takes the description of Warren by Harvard Law beyond the boundaries of the Massachusetts school. Warren had described herself as a minority on a law professors' listing for several years, ending in 1995. She has said she wanted to meet people like herself, but stopped when she realized that's not what the listing was for.\n\nShe has pushed back hard on suggestions she got her job based on her heritage, and her backers have noted a 1995 Crimson piece, from the year she was hired, makes no mention of her background.\n\nAsked to comment, Warren spokesman Alethea Harney said, \"There is nothing new in this report. Elizabeth has been clear that she is proud of her Native American heritage and everyone who hired Elizabeth has been clear that she was hired because she was a great teacher, not because of that heritage. It's time to return to issues - like rising student loan debt, job creation, and Wall Street regulation - that will have a real impact on middle class families. It’s also time for Scott Brown to answer serious questions about his votes to let interest rates on student loans double so our kids pay more while he votes to give oil companies – some of the most profitable companies in the world – tax breaks worth billions. There are plenty more, like his votes against jobs bills because they’d make billionaires pay their fair share, or his votes to water down rules to hold Wall Street accountable that have brought him millions in campaign contributions. Scott Brown’s explanation for these votes against Massachusetts families is long overdue.\"\n\nBrown's camp has been calling on Harvard to release records related to Warren's hiring, and for her to do the same. Recently, the AP reported that she described herself as \"white\" when she applied for the University of Texas decades ago, and didn't apply for a minority program at Rutgers Law School - but those documents becoming public help to underscore the questions that Republicans are posing about the remaining ones.\n\n* This post has been updated", "description": "<p>Elizabeth Warren has pushed back hard on questions about a Harvard Crimson piece in 1996 that described her as Native American, saying she had no idea the school where she taught law was billing her that way and saying it never came up during her hiring a year earlier, which others have backed up.</p>", "authors": ["Maggie Haberman"], "top_image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg", "published_at": "2012-05-15"}