{"pub": "euronews", "url": "https://euronews.com/2017/08/06/angry-protests-in-israel", "downloaded_at": "2019-10-22 14:07:12.193455+00:00", "title": "Angry protests in Israel", "language": "en", "text": "There have been protests at the home of Israel’s attorney general.\n\nDemonstrators are urging Avichai Mandelblit to bring indictments in two corruption investigations involving Prime Minister Benjamin Netanyahu.\n\nThere have been protests for the last six months, amid claims the attorney general is dragging his feet in the case.\n\nHowever, more turned out this weekend after news that Netanyahu’s former chief of staff turned state witness on Friday.\n\nWhat has happened?\n\nAri Harow has agreed to give testimony on behalf of the state in two graft cases in which the Israeli leader has been questioned as a suspect.\n\nAri Harow’s decision to turn state witness as part of a plea bargain in his own separate corruption case adds a new dimension to a long-running investigation involving Netanyahu.\n\nWhat are the details of the cases?\n\nThe cases in which Harow is expected to testify have been dubbed “1,000” and “2,000” by police.\n\nCase 1,000 involves Netanyahu and family members receiving gifts, reportedly including cigars and champagne, on a regular basis from two businessmen.\n\nCase 2,000 involves a deal Netanyahu allegedly discussed with the owner of one of Israel’s largest newspapers, Yedioth Ahronoth, for better coverage in return for curbs on competition from a free paper.\n\nWho is Ari Harow?\n\nHe served two stints as Netanyahu’s chief of staff before resigning in 2015 amid allegations he had improperly handled private business affairs.\n\nThe court injunction said he had turned state’s witness but barred publication of any details about what he would tell investigators or testify to.\n\nUnder the deal, Harow agreed to confess to fraud and breach of trust according to the court injunction papers.\n\nHe will be sentenced to six months in prison, commuted to community service, and a fine of 700,000 shekels (164,000 euros)\n\nHas Netanyahu said anything?\n\nHe has denied any wrongdoing.\n\nA family spokesman said he would withstand what he described as a “witch-hunt” designed to force him from office.\n\nIn a Facebook video posting, Netanyahu dismissed Friday’s developments as “the inevitable scandal of the week”.\n\nEven if eventually indicted, Netanyahu would not be obliged by law to resign. His opponents have called on him to do so.\n\nWhat is Netanyahu’s connection to the case?\n\nThe 67-year-old has been questioned under caution by police in two cases.\n\nOne deals with gifts given to him and his family by businessmen, another relates to conversations he held with an Israeli publisher.\n\nA court injunction said the cases involved suspicion of the commission of the felonies of bribery, fraud and breach of trust. However, it does not specify who might be charged for the crimes.\n\nIs this likely to impact Netanyahu’s popularity?\n\nAnalysts think it is unlikely.\n\nThey say Netanyahu has weathered several scandals and police inquiries while in office.\n\nHis approval ratings are generally solid, putting him ahead of potential challengers.\n\nWhat they are saying\n\n“I would like to tell you, citizens of Israel, that I do not heed background noises. I continue to work for you.” – Israeli Prime Minister Benjamin Netanyahu.", "description": "Demonstrators are urging Avichai Mandelblit to bring indictments in two corruption investigations involving Prime Minister Benjamin Netanyahu.", "authors": ["Catherine Hardy"], "top_image": "https://static.euronews.com/articles/381826/1000x563_381826.jpg", "published_at": "2017-08-06"}