{"pub": "reuters", "url": "https://in.reuters.com/article/india-banking-pmc/india-considers-stricter-laws-to-curb-frauds-in-co-operative-banks-finance-minister-nirmala-sitharaman-idINKBN1WP13T", "downloaded_at": "2019-10-10 15:32:33.708619+00:00", "title": "India considers stricter laws to curb frauds in co-operative banks: finance minister", "language": "en", "text": "FILE PHOTO: India's Finance Minister Nirmala Sitharaman and the Reserve Bank of India (RBI) Governor Shaktikanta Das arrive to attend the RBI's central board meeting in New Delhi, India July 8, 2019. REUTERS/Anushree Fadnavis/File Photo\n\nMUMBAI (Reuters) - The India government is considering amending laws to curb malpractices at co-operative banks in Asia’s third-largest economy, following allegations of fraud in Punjab and Maharashtra Co-operative Bank (PMC), Finance Minister Nirmala Sitharaman said on Thursday.\n\nThe government has asked its economic affairs and banking division to study the activities of multi-state cooperative banks such as the PMC, Sitharaman said.\n\nShe also plans to meet the Reserve Bank of India (RBI) Governor Shaktikanta Das later in the day to discuss a faster resolution plan for the PMC.\n\nBank officials on Tuesday had accused PMC Bank’s management of concealing non-performing assets and disbursing loans leading to a loss of at least 43.55 billion rupees ($617 million), adding that the bank camouflaged its financials.\n\nThe PMC case has sparked renewed concerns about India’s banking sector, which has been rocked by a multi-billion dollar fraud at a state-run lender, the collapse of a major infrastructure lender, bad loan issues at state-run banks and a liquidity squeeze that has hit shadow lenders.\n\nMore than two dozen co-operative banks are now under the RBI administration, but PMC Bank - with deposits of 116.2 billion rupees as of March 31 - is by far the largest.", "description": "The India government is considering amending laws to curb malpractices at co-operative banks in Asia's third-largest economy, following allegations of fraud in Punjab and Maharashtra Co-operative Bank (PMC), Finance Minister Nirmala Sitharaman said on Thursday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439189623&w=1200&r=LYNXMPEF990MH", "published_at": "2019-10-10"}