{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/15/headless-cms-company-strapi-raises-4-million", "downloaded_at": "2019-10-15 16:21:24.536021+00:00", "title": "Headless CMS company Strapi raises $4 million – TechCrunch", "language": "en", "text": "French startup Strapi has raised a $4 million seed round led by Accel and Stride.vc. The company has been working on an open-source Node.js headless content management system.\n\nThat’s a lot of technical words in a row, but it’s not that hard to understand what Strapi is. Content management systems, or CMS, are web applications that let you publish and manage content on a website. It can be a blog, a corporate websites with multiple pages, a portfolio, etc. The most popular CMS in the world is WordPress.\n\nOver the past few years, many companies and developers have started to separate the CMS back end (the administration pages where you write and upload content) and the front end (the public website accessible to anyone).\n\nThis way, you can run a CMS in the back end, and develop your own custom front end that queries the back end using API calls — this is what’s called a headless CMS. It provides a ton of flexibility and should make your website faster. This is how TechCrunch.com works for instance, with WordPress running as a headless CMS.\n\nStrapi has become quite popular in the headless CMS space with 500,000 downloads and 250 contributors to the open-source project. The first version was released on GitHub in 2015.\n\nAnybody can download Strapi and run it on their own server. You can then develop your front end, fetch content in your mobile app using the Strapi API and more. Strapi lets you customize the admin panel so that you only see the fields you need when you add content. It works with SQLite, MongoDB, MySQL and Postgres databases.\n\nThe company plans to build an ecosystem of plugins to expand the features of your CMS installation. Eventually, the startup could launch a hosted version of Strapi so that you don’t have to manage the server infrastructure yourself.\n\nSolomon Hykes, Guillermo Rauch and Eli Collins are also participating in today’s round. Existing investors include Bpifrance, SGPA, François-Charles Debeunne, Jean-Philippe Bellaiche, Kima Ventures, Nicolas Debock, Patrick Dalsace and Nicolas Rosset.", "description": "French startup Strapi has raised a $4 million seed round led by Accel and Stride.vc. The company has been working on an open-source Node.js headless content management system. That’s a lot of technical words in a row, but it’s not that hard to understand what Strapi is. Content management systems, or CMS, are web applications […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/Strapi.jpg?w=599", "published_at": "2019-10-15"}