{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/sportsnews/article-7566649/EPO-linked-Nike-athlete-2011-Oregon-Project-overseen-Alberto-Salazar.html", "downloaded_at": "2019-10-13 00:33:56.817402+00:00", "title": "EPO linked to another Nike athlete in 2011 at Oregon Project overseen by Alberto Salazar", "language": "en", "text": "An athlete at the Nike Oregon Project (NOP) run by controversial coach Alberto Salazar provided an anomalous blood sample in the month of the 2011 Athletics World Championships in South Korea, indicating they may have been taking the drug EPO, Sportsmail can reveal.\n\nThe athlete's identity is known to Sportsmail and was not Mo Farah, who was also part of the NOP at the same time. Farah made his global breakthrough in Daegu when he won gold in the 5,000m, six months after linking up with Salazar.\n\nSalazar was banned for four years earlier this month for anti-doping violations. The revelation that another NOP athlete was potentially taking EPO in 2011 raises further questions about Salazar's athletes.\n\nAn athlete at the Nike Oregon Project (NOP) run by Alberto Salazar provided an anomalous blood sample in the month of the 2011 Athletics World Championships in South Korea\n\nSportsmail can also reveal that key figures from UK Athletics (UKA) were aware that Salazar was pushing boundaries before and during a UKA investigation in 2015 into whether Salazar was a fit and proper person to be working with Farah, the crown jewel in UKA's stable over the past decade.\n\nSportsmail have obtained blood test results of the NOP athlete suspected of doping ahead of Daegu, when their 'reticulocyte count', a measure of new red blood cells, was 2.69.\n\nEPO is a doping agent that stimulates the production of red blood cells, increasing the body's oxygen carrying capacity and dramatically improving endurance. When an athlete injects EPO, their body produces new red blood cells, reticulocytes.\n\nThe global governing body of athletics, the IAAF, consider a reticulocyte count of above 2 'suggestive of the presence of EPO'. Experts say the chances that an athlete would naturally produce a reading of 2.69 could be as low as one in 10,000.\n\nKey figures from UK Athletics (UKA) were aware that Salazar was pushing boundaries\n\nSteve Magness, the principle whistleblower who testified about Salazar's wrongdoing to the US Anti-Doping Agency (USADA) investigation that led to his four-year ban, said he had harboured suspicions about the use of EPO by athletes at the NOP. But he told us he was more explicitly concerned about the amount of blood testing being undertaken at Nike on the NOP campus.\n\nMagness said that a new director of the sports science lab commented that it was 'crazy' at how often the athlete's blood parameters were being measured.\n\nMagness was an assistant coach to Salazar over a 17-month period during which Mo Farah was preparing for London 2012. He explains that his experience at NOP left him questioning the ethics of professional sport.\n\n'The whole thing jaded me,' he says. 'It was kind of sad, honestly, the medicalisation of sport and putting athletes in positions where they might have to risk their health just for a small boost in performance.'\n\nSalazar was a paid consultant to UKA from 2013 to 2017. Farah was encouraged to move to the NOP in February 2011 by Ian Stewart, then the head of endurance at UKA, who was married to the president of US Track & Field, Stephanie Hightower. Stewart left UKA in 2013.\n\nAt the time of Farah's move to Salazar, Stewart said 'it's a great decision for Mo. Alberto has attention to detail. I think he can find that extra per cent. Anything that can give you an edge helps.'\n\nIn 2015, when allegations of Salazar's alleged anti-doping violations became public, an independent UKA oversight committee found there was 'no reason to be concerned' by Salazar's link with Farah.\n\nNeil Black, head of UKA in 2015, said that there was 'total trust, total belief, total respect' between Salazar and the governing body\n\nThe then head of UKA, Neil Black, said that there was 'total trust, total belief, total respect' between Salazar and the governing body.\n\nEmail exchanges obtained by Sportsmail now show that UKA were in direct contact with Salazar and Farah over methods to enhance performance that pushed boundaries.\n\nWeeks before the 2011 World Championships, in an email sent by Barry Fudge, now UKA's head of endurance, he instructed Farah to start taking a controversial sports drink.\n\nFudge states that the drink, while it is not a doping agent, 'can't legally' be sold to the public because 'the sodium content is too high'. He presents the drink as having similar benefits to those of a banned doping method.\n\nIn a later email Salazar confirms Farah has benefited from the drink and he instructs other NOP athletes to starting taking it in combination with an L-carnitine infusion to increase performance.\n\nThe type of infusion he mentions led to one of the doping charges he was found liable for last week because it was administrated at excessive levels.\n\nEmails show UKA were in contact with Salazar and Farah over methods to enhance performance\n\nUKA, Black and Fudge all declined to answer questions about these exchanges, directing us to an earlier statement that said: 'The [UKA] Board and POC will now review the arbitration decision [banning Salazar] in full prior to making any further comment.'\n\nMagness told us he was interviewed as part of UKA's investigation into Farah's relationship with Salazar. The interview took place over Skype and lasted just 45 minutes. He claims the investigation was 'half-hearted'.\n\n'It was one of those things, they didn't want to even find it because they were involved in some degree in the [NOP] program.'\n\nBlack has announced he will leave UKA at the end of this month. He is working with Farah at Sunday's Chicago marathon.", "description": "An athlete at the Nike Oregon Project (NOP) run by controversial coach Alberto Salazar provided an anomalous blood sample in 2011, indicating they may have been taking the drug EPO,", "authors": ["Nick Harris And Edmund Willison For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/20/19634542-0-image-a-12_1570909307816.jpg", "published_at": "2019-10-12"}