{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/democratic-chairmen-subpoena-giuliani-documents-impeachment-probe/story?id=65963144", "downloaded_at": "2019-10-01 00:15:25.568135+00:00", "title": "Democratic chairmen subpoena Giuliani for documents in impeachment probe", "language": "en", "text": "President Donald Trump's personal lawyer, Rudy Giuliani, who has played a key role in the Ukraine whistleblower affair that's now become the focus of an impeachment investigation, has been subpoenaed for Ukraine-related documents, the Democratic chairmen of three House committees announced on Monday.\n\nInterested in Donald Trump? Add Donald Trump as an interest to stay up to date on the latest Donald Trump news, video, and analysis from ABC News. Add Interest\n\n‪”I have received a Committee subpoena from 3 Commitees of the House. It raises substantial constitutional and legal issues as well as attorney-client and other privileges. These and other issues must all be considered before a proper decision can be made,‬” Giuliani said in a statement Monday evening.\n\nSOPHIA KEMBOWSKI/EPA via Shutterstock\n\nReps. Adam Schiff, Jerry Nadler and Elijah Cummings said that Giuliani had \"admitted on national television that, while serving as the president’s personal attorney, he asked the government of Ukraine to target former Vice President Joe Biden.\"\n\n“In addition to this stark admission, you stated more recently that you are in possession of evidence—in the form of text messages, phone records, and other communications—indicating that you were not acting alone and that other Trump Administration officials may have been involved in this scheme,” the chairmen wrote.\n\nThe subpoena calls on Giuliani to produce the documents by Oct. 15. Giuliani, who made several trips as a private citizen to Ukraine to confer with Ukrainian officials and urge them to investigate Biden, has denied any wrongdoing, claiming he was defending President Trump.\n\nSchiff chairs the House Intelligence Committee, Nadler the House Judiciary Committee and Cummings the House Oversight and Government Reform Committee.\n\nOn ABC's \"This Week\" Sunday, when ABC News Chief Anchor George Stephanopoulos asked Giuliani whether he will cooperate with the House Intelligence Committee that Schiff chairs, Giuliani initially said he wouldn't cooperate with Schiff. But when pressed said he would “consider it” if his client, the president, signed off.\n\n\"I'm a lawyer. It's his privilege, not mine,\" he responded. \"If he decides that he wants me to testify, of course I'll testify, even though I think Adam Schiff is an illegitimate chairman. He has already prejudged the case.\"\n\nThey three chairmen also sent separate letters seeking documents and noticing depositions with three of Giuliani’s business associates.\n\n“A growing public record indicates that the President, his agent Rudy Giuliani, and others appear to have pressed the Ukrainian government to pursue two politically-motivated investigations,” the chairmen wrote to the three associates. “The Committees have reason to believe that you have information and documents relevant to these matters.”", "description": "President Donald Trump's personal lawyer, Rudy Giuliani, who has played a key role in the Ukraine affair that's now become the focus of an impeachment investigation, was", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/giuliani-01-as-epa-190928_hpMain_16x9_992.jpg", "published_at": "2019-09-30"}