{"pub": "washingtonpost", "url": "https://washingtonpost.com/dc-md-va/2019/10/26/hes-one-man-quest-take-down-confederate-monuments-maryland", "downloaded_at": "2019-10-27 00:18:25.068165+00:00", "title": "He’s on a one-man quest to take down Confederate monuments in Maryland", "language": "en", "text": "Right there on the courthouse lawn, he passed the statue. “To the Talbot Boys,” read the capital letters on its huge stone base. “1861-1865. C.S.A.”\n\nConfederate States of America, that means. Right here in Maryland, though the state never seceded from the United States. Right here in front of the courthouse, the first and most prominent sight that greets anyone arriving to seek justice and law in Talbot County.\n\nAD\n\n“That’s a little bit imposing to be on the courthouse grounds, to me,” Herr said as he first saw the statue in person. “That’s a more North Carolina, Virginia statue. Not Maryland. Not in my own backyard.”\n\nAD\n\nHerr’s goal, tonight, was to convince the Talbot County Council that this long-standing statue doesn’t belong.\n\nHerr is on a one-man quest to remove Confederate monuments wherever he finds them in Maryland, the state where he was born and raised. The Catonsville resident has already succeeded one time, persuading a veterans’ retirement home in St. Mary’s County to take down a plaque. The Eastern Shore’s “Talbot Boys,” erected in memory of the dozens of residents of this county who fought for the Confederacy (while others, not honored in stone, fought for the Union), is next on his growing to-do list.\n\nAD\n\n“When you have monuments on the courthouse grounds and kids walk by it, I don’t know how they don’t feel like the values of the Confederacy are still what the world likes,” he said.\n\nHerr, who is 29 and white, knows that when he shows up at public forums and meets with government officials, he might seem like a somewhat unexpected face of the long-running movement against these statues. He’s cognizant of the white men like him who have marched in defense of Confederate statues and the African American activists who have made the case against these monuments long before he got involved. He’s also very aware of his privilege as a white man and said he hopes perhaps to make use of it in service to this cause.\n\nAD\n\nHis interest was sparked in a class he took on Civil War history at University of Maryland-Baltimore County, where he studied computer science.\n\nAD\n\n“I think it’s great — it’s inspiring, actually — that here’s someone who has taken what he learned in a class and is running with it and is willing to expend the time and energy to change what he thinks is wrong,” said Anne Sarah Rubin, who was the professor of the class and has advised Herr over the past few months in his search for Maryland monuments to take on.\n\nHerr was in Rubin’s class shortly after the 2017 violence in Charlottesville, when what began as a demonstration in favor of keeping a Confederate monument on its pedestal ended in a young woman’s death. Rubin told her students that her own opinion had changed. “What happened in Charlottesville, that really awful juxtaposition of Confederate flags and Nazi emblems, I think it pushed me,” she recalls saying. “What these monuments symbolize, just by their mere existence they’re showing some sort of community sanction. And they need to come down.”\n\nAD\n\nIn the days after Charlottesville, many Marylanders also came to agree with Rubin’s point of view. Baltimore hauled away four Confederate statues in the dead of night. A statue of a Supreme Court justice who defended slavery came down in Annapolis.\n\nAD\n\nBut Maryland — a state that still had slavery when the Civil War began but did not join the Confederacy — still has a few monuments to the Confederacy standing.\n\nHerr started making a list. After what he describes as a contentious meeting with the state secretary of veterans affairs, he prevailed with the plaque at the Charlotte Hall Veterans Home. He wanted more.\n\nHe had the time to devote. Herr has overcome a lot: A decade ago, he was hospitalized for mental illness, then stayed in a homeless shelter. When he started researching Confederate statues, he was out of work, receiving disability benefits.\n\nAD\n\nThree months ago, he got married. This week, he got a job at last, in the technology industry. In the interview, he was asked what he did as a hobby. “Trying to take down Confederate monuments,” he answered. He says he’ll still have time to pursue his quest once he starts working.\n\nAD\n\nHe wants those who say that removing monuments is undoing history to understand just how recent many of them are. That plaque that he got taken down at Charlotte Hall was installed in 1993. A statue of Robert E. Lee at Antietam, which is on his list of targets, was dedicated in 2003. Even now, as monuments come down in some cities, new ones keep going up.\n\nHe has spent hours researching: listing where at least seven remaining Maryland monuments are, mostly near battlefields; trying to figure out who’s responsible for them and how to contact that organization; tracking previous, unsuccessful attempts to take them down.\n\nAD\n\nThe Talbot Boys are currently at the top of his list.\n\nAD\n\nHe had written to the county council, with little result. So on Tuesday, when the council met, he drove down from his home in Catonsville, arriving almost three hours early. He was the first to put his name down on the neon-green sign-in sheet for public comment, the time when any Marylander can speak his piece on any subject, as long as he talks for less than three minutes.\n\nHe went over what he planned to say: His blunt message that the statue implies the county endorses white supremacy. (“I toyed with how to word that,” he says. His wife, Jessica, convinced him: “Why not just call it what it is?”) His offer to personally pay to remove the statue or install a plaque putting it in context. (He emailed a company that makes bronze plaques for a price quote, and thinks it would cost $400. He talked that one over with Jessica too. “We don’t really have a lot,” he said with a slight sigh. “But we don’t really need a lot.”)\n\nAD\n\nFor an hour and a half, he listened to the business of the county council — the tourism report, the zoning amendment. And then at long last, the council’s president, Corey Pack, called his name. Paper shaking slightly in his hands, Herr read his prepared statement: “The people who fought for the Confederacy do not deserve to have their values exemplified and glorified,” he said.\n\nAD\n\nThen, apologizing nervously for the language, he said he wanted them to know what the Confederacy truly stood for, in the words of its own vice president — words widely circulated around the country at the time: “Our new government … its foundations are laid, its cornerstone rests upon the great truth that the negro is not equal to the white man. … This, our new government, is the first in the history of the world based upon this great physical, philosophical and moral truth.”\n\nThe council members listened but didn’t say a word. The buzzer rang. His time was up. Herr stepped down, and four more speakers followed. All of them talked about the county’s proposal for a new recycling center.\n\nAD\n\nHalf an hour later, they were still debating. “Who knew recycling would be so much more contentious than my issue,” Herr muttered.\n\nAD\n\nThen it was on to traffic from the Chesapeake Bay Bridge. Then 911 infrastructure. And then it was all over. Herr had driven all this way, sat stock-still through all these other topics, and no one had even acknowledged him at all. He stood to leave.\n\nCouncil member Pete Lesher tapped him on the shoulder. And, finally, Herr got to plead his case.\n\n“It’s just me. I’m not part of a group. I’ll work with whoever. Whatever I can do to try to advance this, if you have any ideas,” Herr said, and Lesher answered, “The one thing I cannot promise is a quick solution. I think we need time to build the consensus.”\n\nHerr didn’t want to be patient. He pointed out that Talbot County had debated this question at length before, and nothing had changed. “This is one of the last in Maryland,” he said.\n\nAD\n\nHe kept pressing. In the end, Lesher promised to talk to others about the issue, including the head of the local NAACP branch. His final sentence to Herr was, “Not everyone appreciates you raising this issue, but I appreciate you raising the issue.”\n\nHerr walked out the door, past the statue again. He spared only a passing glance for the towering sculpture of a Confederate going off to battle, as he rushed in the rain down the red-brick path. One May day in 1774, two years before the Declaration of Independence, other determined young men had gathered on this same lawn, to express their own resolve to fight the looming unjust power of their day.\n\n“I’m glad there’s movement, at least. I haven’t hit a brick wall yet,” Herr said. “So I’ll keep going.”", "description": "This white 29-year-old has made it his mission to make his state face its history.", "authors": ["Julie Zauzmer", "Reporter Covering Religion", "Faith"], "top_image": "https://www.washingtonpost.com/resizer/_ObyTbdvwMhfkQRUm9jGlMLuDUw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/LN7P7XXXIEI6TMWSD434TWBNXM.jpg", "published_at": "2019-10-26"}