{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/2019102415671/intel-raises-outlook-sending-shares-higher2nd-update", "downloaded_at": "2019-10-24 23:47:44.421981+00:00", "title": "Intel Raises Outlook, Sending Shares Higher—2nd Update", "language": "en", "text": "By Sarah E. Needleman\n\nIntel Corp. reported stronger third-quarter earnings and again raised its full-year outlook, helping ease investor concerns about chip-supply bottlenecks at the company and a broader slowdown in demand.\n\nShares of the chip maker jumped more than 7% in after-market trading.\n\nIntel on Thursday reported adjusted earnings of $1.42 a share, compared with $1.40 for the year-prior period. Analysts surveyed by FactSet were expecting earnings of $1.23 a share.\n\nThird-quarter revenue for the Santa Clara, Calif., company rose to $19.19 billion from $19.16 billion, also topping expectations.\n\nIntel, the largest chip maker in the U.S. by revenue, said sales of chips used in data centers helped deliver the stronger-than-expected result. Those chips are heavily used in the booming cloud-computing market. Microsoft Corp., the No. 2 in cloud computing behind Amazon.com Inc., gave an upbeat outlook for its cloud business.\n\nIntel also said its memory business, which has been underperforming this year compared with last, is starting to turn around. \"It's still down, but it's coming back,\" Intel finance chief George Davis said. He said the momentum helped give the company confidence to raise its full-year outlook for a second period in a row.\n\nThe company reported a 5% drop in PC-related revenue despite healthy demand for the computers.\n\nPC shipments globally rose to 70.9 million units, marking the best third-quarter performance since 2015, according to data from Canalys. The 4.7% increase from a year earlier was the strongest growth since the first quarter in 2012, the research firm said.\n\n\"Last year, there was so much demand for PC processors that we were actually selling down our inventory,\" Mr. Davis said. Without that buffer, he said, Intel has struggled to keep pace this year. \"As we get back to having the supply, we expect those volumes to go back.\"\n\nIntel said it expects $19.2 billion in sales in the current quarter. That outlook could help investors overcome broader concerns that technology spending by large businesses is slowing.\n\nTexas Instruments Inc. this week gave muted guidance for the current quarter, saying customers were more cautious.\n\nIntel raised its full-year revenue outlook by $1.5 billion to $71 billion. It also boosted its full-year earnings outlook to $4.60 a share from $4.40.\n\n\"We now expect to deliver a fourth record year in a row,\" Intel Chief Executive Bob Swan said in a statement.\n\nWrite to Sarah E. Needleman at sarah.needleman@wsj.com\n\n(END) Dow Jones Newswires\n\nOctober 24, 2019 17:32 ET (21:32 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-24"}