{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/2019/10/22/british-lawmakers-are-voting-crucial-piece-brexit-legislation-they-had-hours-read-almost-words", "downloaded_at": "2019-10-22 15:12:20.009793+00:00", "title": "British lawmakers are voting on a crucial piece of Brexit legislation. They had 24 hours to read almost 100,000 words.", "language": "en", "text": "Combined, the two documents have a length of close to 100,000 words; about the same length as Harper Lee’s novel “To Kill a Mockingbird.”\n\nMembers of Parliament are also under a time crunch. Because of the convoluted Brexit timetable, the text of the bill was sent out to lawmakers at 7 p.m. local time on Monday. As Johnson hopes to get the bill passed by the House of Commons in three days, MPs have been asked for their first vote on it at 7 p.m. Tuesday.\n\nAD\n\nAD\n\nSo, have they read it? “No,” Jim Fitzpatrick, an opposition Labour MP who supports Johnson’s Brexit plans, told the BBC’s Victoria Derbyshire on Tuesday morning.\n\n🎙 Do you think it’s acceptable to vote for something in principle when you haven’t read it?\n\n\n\nI will have read it by 7pm I hope @FitzMP\n\n\n\n🎙 You hope? Is this not what people pay you to do?\n\n\n\nBoris Johnson will urge MPs to back his Brexit deal https://t.co/v2OW0qtbSQ pic.twitter.com/5OsT0N3oob — Victoria Derbyshire (@VictoriaLIVE) October 22, 2019\n\nAnd would Fitzpatrick still be voting for it later in the day? “In principle,”he told Derbyshire, adding he hoped to have read the bill before the vote.\n\nNot all British lawmakers have been as blunt as Fitzpatrick, but others have complained about the short time given to consider the bill. Labour MP Alex Sobel tweeted on Monday evening that he was reading through the bill, which he said “normally” would take eight days.\n\nThree hours later, Sobel shared a photograph of a glass of wine and a chocolate bar, a “refreshment break,” he explained.\n\nAD\n\nKeir Starmer, who serves as the Labour party’s shadow secretary of state for Brexit, said it was “outrageous” to deny Parliament the chance to scrutinize the legislation properly and accused the government of trying to “bounce MPs into signing off a Bill that could cause huge damage to our country.”\n\nAD\n\nBut some who support Johnson’s plan have already suggested the complaints were sour grapes and that the accelerated time frame was a good thing.\n\n“We got rid of the King Emperor in 24 hours in 1936; we can get rid of the Imperial yoke of Brussels just as quickly, I would expect,” Jacob Rees-Mogg, leader of the House of Commons with the Conservative government, told the Spectator last week.\n\nAD\n\nSteve Baker, a pro-Brexit Conservative MP, shared an article that called the Withdrawal Agreement Bill dull reading that didn’t require considerable scrutiny. “True story,” he wrote.\n\nWhile reading “To Kill a Mockingbird” in 24 hours is no mean feat, lawmakers have had plenty of time to consider some aspects of Brexit. Johnson’s deal contains much of the same language as the deal first put forward by his predecessor, Theresa May, in November 2018.\n\nAD\n\nBut the short space of time given to scrutinize such important legislation is still unusual. The House of Commons took 29 days to consider the 1993 Maastricht Treaty, which formally deepened European ties and created the European Union.\n\nAnd Joe Owen, Brexit program director for the Institute of Government, observed that British lawmakers were given more time to consider another piece of legislation this year that prohibited the use of wild animals in traveling circuses.\n\nThings given longer in the commons than the EU (Withdrawal Agreement) Bill:\n\n\n\nThe Wild Animals in Circuses Act 2019 — Joe Owen (@jl_owen) October 21, 2019\n\nAD", "description": "At least one lawmaker has admitted he hadn't read the document.", "authors": ["Adam Taylor", "Foreign Reporter Who Writes About A Variety Of Subjects"], "top_image": "https://www.washingtonpost.com/resizer/6kd4LBlfhvMdSsL1ZQ4yeayAQSE=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GWAIDXXU2II6TMWSD434TWBNXM.jpg", "published_at": "2019-10-22"}