{"pub": "cnbc", "url": "https://cnbc.com/2019/10/23/stocks-making-the-biggest-moves-midday-boeing-six-flags-crowdstrike.html", "downloaded_at": "2019-10-23 16:37:42.972233+00:00", "title": "Stocks making the biggest moves midday: Boeing, Six Flags, CrowdStrike, Snap and more", "language": "en", "text": "Check out the companies making headlines in midday trading.\n\nBoeing — Shares of the aerospace giant rose 1.7% after Boeing delivered third-quarter earnings that were below what Wall Street expected but, overall, did not feature any new surprises as the company works through its 737 Max aircraft crisis. While Boeing's revenue slid and the company cut production of its 787 Dreamliner program, Credit Suisse said on the whole that \"no incremental negative news on MAX will be a relief for most\" investors.\n\nCrowdStrike — Shares of software company CrowdStrike rose 7% after Nomura Instinet initiated coverage of the stock with a buy rating. The firm said the cybersecurity company that it had \"superior\" proprietary technology.\n\nTexas Instruments — Shares of the semiconductor name dropped 6% after the company missed revenue estimates and gave weak guidance for the current quarter. Softening demand as well as the ongoing trade war continue to pressure sales, the company said.\n\nSix Flags — Shares of Six Flags tanked 11% after posting dismal third-quarter earnings. The amusement parks operator reported earnings of $2.11 per share, well below the estimated $2.31, according to Refinitiv. Six Flags earned $621 million in revenue, missing estimates of $644 million.\n\nBlackstone — Shares of Blackstone jumped 5% after reporting strong third-quarter earnings. The private equity company posted earnings of 58 cents per share on revenue of $1.735 billion. Wall Street forecast earnings of 53 cents per share on revenue of $1.358 billion, according to Refinitiv.\n\nSnap — Shares of social media company Snap dropped 5% after a weak revenue forecast raised concerns that the momentum the company built up over the first half of the year could be dwindling.\n\nServiceNow- Shares of the software company fell 5% after the company said John Donahoe, the current CEO, is leaving to replace Mark Parker as CEO of Nike. Bill McDermott, who recently stepped down as CEO of SAP, is joining ServiceNow later this year to become its new CEO.\n\nEli Lilly — Shares of the pharmaceutical company fell more than 3% after reporting mixed results for the third quarter. EPS came in at $1.48, which is 7 cents above estimates, but revenue missed expectations, according to Refinitiv. The company did raise its full-year profit forecast based on strength in its diabetes drug as well as a lower tax bill.\n\nAlexion Pharmaceuticals — Shares of Alexion rose 6% after beating on the top and bottom lines of its third quarter earnings. The pharmaceutical company earned $2.79 per share, topping estimates of $2.47, according to Refinitiv. Revenue also beat estimates at $1.263 billion.\n\nBoston Scientific — Shares of Boston Scientific rose 6% after the medical device manufacturer reported strong third-quarter earnings. The company reported earnings of 39 cents per share, topping estimates of 38 cents, according to Refinitiv. Revenue came in at $2.707 billion, higher than the forecast $2.647 billion.\n\nAnthem — Shares of the insurance company rose 3% after reporting third-quarter earnings that beat Street estimates. Anthem reported earnings per share of $4.87 on revenue of $26.444 billion. Analysts forecast earnings per share of $4.82 on revenue of $25.875 billion, per Refinitiv.\n\nChipotle — Shares of Chipotle Mexican Grill fell more than 4% despite reporting quarterly earnings that topped analyst expectations. The company said it earned an adjusted $3.82 per share. Analysts polled by Refinitiv expected a profit of $3.22 per share. However, Chipotle warned its drive-thru plans may delay future store openings.\n\nWalgreens Boots Alliance — Shares of Walgreens Boots Alliance ticked 2% lower following a downgrade to neutral from overweight from J.P. Morgan. The firm said there are better opportunities for upside in its coverage universe.\n\nNorfolk Southern — Shares of the freight railroad company fell 3% after missing Wall Street's estimates for its third-quarter earnings. Norfolk Southern reported earnings of $2.49 per share on revenue of $2.841 billion. Analysts forecast earnings of $2.59 per share on revenue of $2.845 billion, according to Refinitiv.﻿\n\nFor more on ServiceNow, watch CEO John Donahoe's interview on Mad Money tonight at 6 p.m. ET.\n\n— CNBC's Michael Sheetz, Pippa Stevens and Fred Imbert contributed reporting.", "description": "These are the stocks posting the largest in midday trading.", "authors": ["Maggie Fitzgerald"], "top_image": "https://image.cnbcfm.com/api/v1/image/103818142-GettyImages-454781877.jpg?v=1571842805", "published_at": "2019-10-23"}