{"pub": "fox", "url": "https://foxnews.com/us/ed-buck-dem-megadonor-hit-with-federal-charge-in-mans-2017-overdose-death", "downloaded_at": "2019-09-19 23:08:57.690743+00:00", "title": "Ed Buck, Dem megadonor, hit with federal charge in man's 2017 overdose death", "language": "en", "text": "Ed Buck, a Los Angeles political activist and longtime donor to many prominent Democrats, was hit with a federal charge Thursday in the 2017 drug overdose death of 26-year-old Gemmel Moore.\n\nBuck, 65, was charged with distributing methamphetamine resulting in Moore's death. He would face a minimum of 20 years in prison if convicted.\n\nBuck “brought Mr. Moore to L.A. with the purpose of engaging in sexual activity,” U.S. Attorney Nick Hanna told reporters at a news conference to announce the federal charge.\n\nBuck was charged earlier this week with causing the overdose of another man who escaped from his West Hollywood home this month. The man escaped the apartment and reportedly called for help at a nearby gas station.\n\nDEMOCRATIC MEGADONOR ED BUCK NOW FACING ALLEGATIONS OF HUMAN TRAFFICKING, REVENGE PORN\n\nA third man, Timothy Dean, 55, died of an overdose in Buck's home this past January. Prosecutors said Buck provided drugs to several men over the years after luring them to his home. They described the political donor as someone who preyed on the homeless and drug addicts.\n\nIn addition to the federal charge, Buck faced state charges of maintaining a drug house, battery causing serious injury and administering methamphetamine.\n\nHe would face just under six years in prison under the state charges.\n\nBuck's attorney did not immediately comment.\n\nMoore and Dean were black. Buck, a gay activist who is white, was not charged immediately following the deaths, and critics later questioned if wealth, race or political ties influenced the investigation.\n\nCLINTON, OBAMA SILENT ON ED BUCK DONATIONS\n\nBuck has donated tens of thousands of dollars to California political candidates, Gov. Gavin Newsom and others, and is well known in LGBTQ political circles. Some activists argued his political ties and the race of the victims spared him from prosecution.\n\n\"No one on the team knew Mr. Buck,\" Los Angeles County District Attorney Jackie Lacey said. \"We were not at all moved by his reputation.\"\n\n“Under state law, however, we determined there was insufficient admissible evidence to hold Mr. Buck responsible for the deaths of Mr. Moore and Mr. Dean,” Lacey added. “Ultimately, we arrived at the conclusion that there were more options under federal law that could carry a lengthier prison sentence.”\n\nMoore, 26, died in 2017 at Buck's apartment after being injected with methamphetamine, investigators said. He was found naked on a mattress in the living room, which was littered with drug paraphernalia.\n\nHis death initially was ruled an accident. Investigators reopened the case after Dean died.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nMoore's mother, LaTisha Nixon, said her son told her Buck had held him in the home against his will and \"shot him up with drugs,\" Hanna said.\n\nBuck appeared in court Thursday on the state charges and was held pending $4 million bail. His arraignment was postponed until Oct. 11.\n\nHe is expected to also appear in federal court Thursday where prosecutors will seek to detain him, Hanna said.\n\nFox News' Christopher Carbone and The Associated Press contributed to this report.", "description": "Ed Buck, a Los Angeles political activist and longtime donor to many prominent Democrats, was hit with a federal charge Thursday in the 2017 drug overdose death of 26-year-old Gemmel Moore.", "authors": ["Louis Casiano"], "top_image": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png", "published_at": "2019-09-19"}