{"pub": "independent", "url": "https://independent.co.uk/independentpremium/editors-letters/brexit-final-say-march-people-vote-a9164646.html", "downloaded_at": "2019-10-22 13:41:11.048614+00:00", "title": "The Final Say march was a shot in the arm for the curious art of the vox pop", "language": "en", "text": "The result of the EU referendum in 2016 “doesn’t deserve respect” says a woman clutching her young daughter at the Let Us Be Heard march on Saturday in London.\n\nBroadcast on Sky News and bootlegged by someone filming their TV screen before posting it on Twitter, the clip of the woman, who appears to be a mother of two, has been viewed eight million times as I write this.\n\nShe was one of hundreds of thousands of people who took to the streets of the capital at the weekend demanding that the decision on the proposed Brexit deal is put back to the public in the form of a referendum.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe task of finding out “what the person on the street really thinks”, otherwise known as vox pops, is usually pretty arduous for a journalist. You might be standing alone in the rain, perhaps with a print out of a proposed new government anti-smoking campaign. You try your best, but most of the time asking passersby for their thoughts is inefficient and, worse, you have no guarantee of capturing an accurate representation of the public’s view, as if such a thing exists anyway.\n\nTake the same tactics to a major demonstration or protest, however, and the vox pop becomes something really worth doing.\n\nWhen around a million people take to the streets to demand something, in this case a Final Say referendum, you already know what it is they want. They’re in good spirits and always happy to offer their opinion when a camera is shoved in their face. What this allows for is moments of eloquence, as with the viral bootleg of the Sky News clip.\n\nThese people are generally informed on the topic you’re asking them about, as opposed to conjuring an opinion after being ambushed with a disgusting picture of a lung full of tar.\n\nAs a co-organiser of Saturday’s march, The Independent was there in full force. “I want a good future for my children,” one man told Alastair Campbell and I as we roamed around Parliament Square filming our very own vox pop video.\n\nA 13-year-old girl explained to us how she felt it was unfair she wasn’t able to express her voice on an issue that will effect her future so heavily, before telling 62-year-old Alastair that it’s about more than just the lives of “50-year-olds and above”.\n\nSo the march for a Final Say last weekend had multiple benefits. Not only did it fight for democracy and demand that the will of the people be respected, it also made a usually thankless task for people like me utterly worthwhile, interesting and informative.\n\nYours,\n\nTom Richell\n\nHead of video", "description": "The result of the EU referendum in 2016 “doesn’t deserve respect” says a woman clutching her young daughter at the Let Us Be Heard march on Saturday in London. Broadcast on Sky News and bootlegged by someone filming their TV screen before posting it on Twitter, the clip of the woman, who appears to be a mother of two, has been viewed eight million times as I write this.", "authors": ["Tom Richell"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/20/14/final-say-march-93.jpg", "published_at": "2019-10-21"}