{"pub": "financialpost", "url": "https://business.financialpost.com/real-estate/property-post/brookfield-in-talks-to-sell-1000-room-diplomat-beach-resort-to-florida-real-estate-giant", "downloaded_at": "2019-10-07 23:31:32.170336+00:00", "title": "Brookfield in talks to sell 1,000-room Diplomat Beach Resort to Florida real estate giant", "language": "en", "text": "An Brookfield Asset Management Inc. affiliate is in talks to sell the Diplomat Beach Resort, a 1,000-room hotel in Hollywood, Florida, to real estate developer Jeff Soffer, according to people with knowledge of the matter.\n\nThe potential sale would make Soffer one of the largest owners of convention hotels in South Florida, said one of the people, who asked not to be identified because the talks are private. Financial terms of the potential deal couldn’t be learned, though any transaction would likely value the resort at less than US$1 billion, including debt, the people said.\n\nA representative for Brookfield declined to comment. A representative for Soffer didn’t respond to requests for comment.\n\nThe Diplomat is owned by Brookfield Property Partners, which acquired 90 per cent of the business for US$210 million in 2014, according to its annual report that year. The Diplomat had a carrying value of US$390 million as of Dec. 31, according to its 2018 annual report.\n\nThe property, with more than 200,000 square feet of meeting space, sits between the Atlantic Ocean and the intercoastal waterway. It was built on the site of a historic hotel that hosted performances by Judy Garland and Bob Hope.\n\nSouth Florida hotels haven’t been immune to a travel slump that’s weighed on top U.S. hospitality markets. In Miami, revenue per available room has declined 2.5 per cent this year through August, compared to the year before, according to lodging data provider STR. In Fort Lauderdale, it was down 3.8 per cent over the same period.\n\nSoffer is the son of Donald Soffer, a billionaire real estate developer who turned swampland north of Miami into the city of Aventura. The family’s Turnberry Associates has also built shopping centers, upscale dwellings, and mixed-use complexes such as SoLé Mia in North Miami.\n\nJeff Soffer had led Turnberry with his sister until this year, when he left the firm to lead Fontainebleau Development, according to a report in March in the Miami Herald. His firm’s holdings include the JW Marriott Miami Turnberry Resort & Spa, a 398-room property in Aventura, and the Fontainebleau Miami Beach, a 1,500-room hotel situated on a 22-acre oceanfront stretch.\n\nBloomberg.com", "description": "The potential sale would make Jeff Soffer one of the largest owners of convention hotels in South Florida", "authors": ["Gillian Tan", "Scott Deveau", "Patrick Clark", "Bloomberg News"], "top_image": "https://financialpostcom.files.wordpress.com/2019/10/resort.jpg", "published_at": "2019-10-07"}