{"pub": "zdnet", "title": "Cloud needs a modern data foundation, modern data needs a cloud foundation", "url": "https://www.zdnet.com/article/cloud-needs-a-modern-data-foundation-modern-data-needs-a-cloud-foundation", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:00:45.175633+00:00", "text": "It's almost a chicken-or-egg conundrum: going to cloud requires a modern data foundation, going to modern data requires a cloud foundation. The good news is both can be advanced along at the same time.\n\nPhoto: Joe McKendrick\n\nThat's the word from a recent survey of 504 IT executives by Deloitte, authored by a team which included Tom Davenport, Ashish Verma and David Linthicum. Both cloud computing and data modernization efforts are simultaneously reinforcing one another, the researchers report. More than nine in 10 organizations surveyed now primarily keep their data on cloud platforms, with 55% of respondents seeing data modernization as a key reason for cloud migration, second only to security and data protection.\n\nThe majority of enterprises surveyed (84%) report having data modernization efforts underway, with 34% having such initiatives \"fully implemented,\" while half have data modernization initiatives currently underway. They define data modernization as \"moving data from legacy databases to modern databases,\" with an emphasis on storing unstructured data such as images, customer voice audio, social media comments, and clinical notes in health care.\"\n\nI asked other industry experts about the challenges of addressing data requirements within today's burgeoning cloud environments, and some express caution about making the move too quickly. \"The basic management tenets are the same across on-premises and cloud, but cloud has some unique challenges,\" says Bill Talbot, VP of solution marketing at BMC. \"Managing on-premises infrastructure and software has typically been and continues to be managed by a centralized IT team that has the expertise, tools and processes to ensure business needs are met. However, the ease of access to cloud services now enables both IT and business owners to be buyers of cloud infrastructure and platform services, which has made managing cloud services and software more complicated.\"\n\nAlso, Talbot adds, \"microservice based architectures for new cloud applications with continuous deployment demands require different operations and security practices. Enterprises are still developing skills, tools and governance policies when it comes to managing cloud services.\"\n\nCost is another consideration for sending data to the cloud. \"The cloud service providers do not charge for transferring data to the cloud. But they do charge for transferring data from the cloud,\" Talbot points out. \"For high transaction hybrid applications, maintaining data in the cloud can become expensive due to high data transfer fees.\"\n\nThere are multiple factors to be considered when looking at where data should live in the cloud, and two of the more common ones are security and performance, says Michael Procopio, IT operations management manager with Micro Focus. \"For data security, in the early days of cloud, the answer was simple -- keep it on-premises. Today, the landscape is very different. The major cloud vendors all have the security required to support regulations such as HIPAA. AWS, as an example, has documented how to manage to HIPAA. Encryption is available on-disk and during transport by the major cloud vendors. Corporate policy is the determining factor on where data stays regarding security.\"\n\nWhen it comes to cloud performance, \"the application and the data are best being local to each other as network latency will affect performance,\" says Procopio. \"If the application is in cloud, the best performance will be if the data is in the same cloud as well as the same region. The same is true for on-premises applications.\"\n\nProcopio points to the fact that cloud infrastructures are, by design, virtualized. \"As good as virtualization software is these days, there is always a small performance hit,\" he says. \"Staying on-premises also means you control all of the parts and can use the highest performing capabilities such as SAN disk storage and high-speed interconnect that is dedicated to a specific application. Another factor is service level agreements, as we're beginning to see organizations see more difficult problems to diagnose in the cloud than on-premises. This certainly means that it takes more time to fix and this impacts your SLA.\"\n\nWhile moving data storage and capabilities to the cloud needs to be gradual and well-considered, the Deloitte team finds that cloud is already a dominant location for data storage, with 91% primarily keep their data on cloud platforms. \"Of the remaining nine percent that primarily keep their data on premise, nearly all plan to migrate to the cloud. What's more, on average, 57% of respondents' businesses are actually operating on the cloud—meaning that all their important applications and data are on it.\"\n\nWhile on-premise modernization projects are still a reality, \"given that many firms are moving data to the cloud, they often put it on modernized platforms at the same time,\" the Deloitte team states. \"This makes the cloud a non-negotiable part of data modernization.\"", "description": "Survey shows that cloud helps accelerate data modernization and transformation efforts. But it needs to be undertaken gradually, with an eye to security and performance.", "authors": ["Joe Mckendrick"], "top_image": "https://zdnet2.cbsistatic.com/hub/i/r/2019/08/31/dc8cbde7-8c2c-4f2c-bebe-3c3b36277aa4/thumbnail/770x578/ef09f5c718d1f6ba915c8b4bca2529a0/building-newport-pavonia-new-jersey-may-2017-cropped-photo-by-joe-mckendrick2.jpg"}