{"pub": "wsj", "url": "https://wsj.com/articles/complaints-against-nypd-officers-on-the-rise-11568844432?mod=rsswn", "downloaded_at": "2019-09-18 23:26:11.022232+00:00", "title": "Complaints Against NYPD Officers on the Rise", "language": "en", "text": "Civilian complaints against the New York Police Department have reached a five-year high, according to an official tally.\n\nThe New York City Mayor’s Management Report released Tuesday night showed 5,236 public complaints against NYPD officers for the fiscal year 2019 ending in June. The number represented an increase of roughly 20% from the 4,392 complaints filed in the fiscal year 2018.\n\nBy comparison, the number of complaints was 4,165 in 2015, the baseline for the five-year comparison, and has since risen, according to the report, an annual performance review of city agencies.\n\nNew York City Mayor Bill de Blasio on Wednesday attributed the rise in complaints to increased activity by the Civilian Complaint Review Board, a city agency tasked with receiving and investigating complaints against police. People can lodge complaints alleging disrespectful behavior or abuse of power on the part of officers.\n\n“The CCRB has been going out in communities more and encouraging people that have a concern to come forward. And that’s good,” said Mr. de Blasio, a Democrat who rejected the notion that an increase in complaints indicated increased dissatisfaction on the part of the public.\n\nCCRB spokesman Ethan Teicher said the agency delivered 1,070 presentations in 2018, the highest number for a single year in the agency’s history.\n\n“As the CCRB continues to strengthen its outreach efforts, and more New Yorkers learn how to report alleged police misconduct, more civilians may come to the agency with complaints,” Mr. Teicher said.\n\nNYPD spokesman Al Baker said the increase in complaints this past year coincided with a policy enacted last October requiring officers to provide a contact card with their names as well as info on how to file a complaint with the CCRB.\n\nMr. Baker also said the CCRB has held an increased number of public outreach events to inform people on how to file grievances against police.\n\nCynthia Conti-Cook, a staff attorney at the nonprofit Legal Aid Society, also said better efficiency on the part of the CCRB is probably behind the increased number of complaints.\n\n“Those things happen on a much wider scale than what gets reported,” Ms. Conti-Cook said.\n\nWrite to Ben Chapman at Ben.Chapman@wsj.com", "description": "Civilian complaints against the New York Police Department have reached a five-year high, according to an official tally.", "authors": ["Ben Chapman"], "top_image": "https://images.wsj.net/im-108324/social", "published_at": "2019-09-18"}