{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7605895/Dancing-Stars-contestant-Lauren-Alaina-says-lost-25lbs.html", "downloaded_at": "2019-10-24 02:41:12.276277+00:00", "title": "Dancing With The Stars contestant Lauren Alaina has lost 25lbs", "language": "en", "text": "Lauren Alaina has lost a lot of weight since she started competing on season 28 of Dancing With The Stars.\n\nDuring an interview with several outlets this week, the 24-year-old singer shared the good news that she is down a size or two, according to People.\n\n'I've lost like 25 pounds! Since July. None of my clothes fit,' the blonde beauty said. Gleb Savchenko, her professional partner on the ABC show, then cheekily said: 'You're welcome.'\n\nLosing pounds: Lauren Alaina said she has lost 25lbs while on Dancing With The Stars. Seen here on Monday\n\nShedding: On the left she is seen in November 2018, long before she started competing for the mirrorball trophy, and on the right the star is pictured on October 7\n\nLauren has said in the past that she has a history with bulimia.\n\n'I had an eating disorder for like four years, and I was just lost,' she said.\n\n'I found myself in these last few years, through music and family and good people around me.'\n\nAlaina, best known for her time on American Idol, has also been doing better and better with her scores.\n\nAnd on Monday, the songbird delivered one of her best performances.\n\nAnother before and after: On the left she is seen in June and on the right the crooner is pictured on September 23\n\nThe Georgia Peaches singer danced to the song The Other Side for a tribute to her late stepfather, who passed a year ago.\n\n'I was scared of the dance. I was sad,' the beauty revealed.\n\n'I was proud that I could do it. I just was really nervous that I was going to get upset before the dance and not be able to do it, breathe, but I got through it, and then I lost it,' she said.\n\nWith her partner: The former choir girl with Gleb Savchenko on October 14\n\nGood deal: While the singer's weight has gone down, her scores have gone up\n\n'I feel really proud because my stepdad was the most positive, uplifting, happy person I've ever met. And if he had been here tonight, he would've been the most proud of me,' she added.\n\nShe began to tear up in the middle of the dance. But then she got back on track and pulled it off.\n\nAlaina's parents divorced in 2013. Her father is a recovering alcoholic and has been sober since October 2013.\n\nA nice day off from dancing: Lauren and Gleb seen arm in arm in Disneyland\n\nLauren was raised in Georgia and started singing at age three. As a teen she sang in restaurants and churches then won talent shows.\n\nShe came to LA for the 10th season of American Idol. Next came her debut studio album Wildflower in 2011.\n\nShe waited six years until she released Road Less Traveled which has spawned the hits Ladies In The 90s and Like My Mother Does.\n\nSlender gal: Marie Osmond said she shed 27 pounds in 2007 during the show’s fifth season in 2007; next she became a spokesperson for Nutrisystem. Now she is a regular on The Talk\n\nOther stars who have lost weight while on the show include Rob Kardashian, Tonya Harding and Chaz Bono.\n\nMarie Osmond said she shed 27 pounds in 2007 during the show’s fifth season in 2007; next she became a spokesperson for Nutrisystem. Now she is a regular on The Talk.\n\nKelly Osbourne lost 42 pounds in 2009 while dancing with Louis van Amstel.\n\nDrew Scott lost 30 pounds in 2017 and Amber Rose took off 10 pounds in 2016.\n\nMelissa Gilbert competed in 2012 and said she went from a size six to a size two.", "description": "'I've lost like 25 pounds! Since July. None of my clothes fit,' the blonde beauty said.  Gleb Savchenko, her professional partner on the ABC show, then cheekily said: 'You're welcome.'", "authors": ["Heidi Parker For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/18/20095692-0-image-a-67_1571852965889.jpg", "published_at": "2019-10-23"}