{"pub": "yahoo", "url": "https://finance.yahoo.com/news/heed-treasury-market-recession-warning-145245005.html", "downloaded_at": "2019-09-08 12:02:07.720258+00:00", "title": "Heed the Treasury Market’s Recession Warning, Deutsche Bank Says", "language": "en", "text": "(Bloomberg) -- The sweeping bond rally that’s driven Treasury yields toward record lows isn’t being caused by global forces, according to Deutsche Bank AG. Rather, blame a slowing U.S. economy.\n\nIf that’s the case, it’s a blow to optimists arguing that the recession warning sent by this year’s inverted U.S. yield curve can be safely ignored. A Friday report showing a weaker-than-expected American job market bolstered this pessimistic view.\n\n“The bottom line is that payroll growth is slowing and that is a worrying trend,” Deutsche Bank’s chief international economist, Torsten Slok, said Friday on Bloomberg Television. “This is not an economy that is falling over the cliff, but what we’re debating here is what is the slope of where the economy is going? And it does look like the slope is a bit more to the downside than we had thought earlier.”\n\nRates on shorter-term Treasuries -- three-month bills and two-year notes -- have surpassed those on 10-year notes in 2019, which tends to happen before U.S. economic contractions. Some have argued that this so-called inversion is sending a false recession signal. Around the world, more than $15 trillion of debt has a negative yield. Investors seeking positive rates can still find them in Treasuries, possibly distorting things.\n\nThe 10-year Treasury term premium -- or the extra compensation investors require to own the maturity rather than rolling over a shorter-dated obligation -- has fallen to record lows, which casts doubt on the yield curve’s recession prediction.\n\nBut Slok points out that U.S. ISM Manufacturing data and 10-year Treasury yields have been highly correlated, suggesting that fundamental American economic data is driving the rundown in rates. Foreign holdings of Treasuries as a percent of total outstanding U.S. debt has been falling, too, while domestic sources have increased their purchases, he said.\n\n“U.S. rates seem to be driven by domestic forces and not global forces,” Slok wrote in an email to clients. “The bottom line is that if U.S. 10-year rates are driven entirely by U.S. economic fundamentals then this also implies that we in markets put too much weight on the arguments that weak global growth and the savings glut are pushing down U.S. rates and the U.S. term premium.”\n\n--With assistance from Alix Steel, David Westin and Liz Capo McCormick.\n\nTo contact the reporter on this story: Sarah Ponczek in New York at sponczek2@bloomberg.net\n\nTo contact the editors responsible for this story: Benjamin Purvis at bpurvis@bloomberg.net, Nick Baker, Liz Capo McCormick\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- The sweeping bond rally that’s driven Treasury yields toward record lows isn’t being caused by global forces, according to Deutsche Bank AG. Rather, blame a slowing U.S. economy.If that’s the case, it’s a blow to optimists arguing that the recession warning sent by this year’s inverted", "authors": ["Sarah Ponczek"], "top_image": "https://s.yimg.com/uu/api/res/1.2/onjfylYKHfDjHHOlBiUgAg--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/468097d23f1dd2b5a1e72fd70652059f", "published_at": "2019-09-06"}