{"pub": "cnn", "url": "https://cnn.com/2019/09/08/health/malaria-eradication-2050-report-intl/index.html", "downloaded_at": "2019-09-08 23:27:23.248476+00:00", "title": "Can the world eradicate another disease?", "language": "en", "text": "London (CNN) Banishing an infectious disease from the face of the Earth is the holy grail of public health -- a scientific and humanitarian feat for the ages.\n\nIt's also fiendishly difficult.\n\nSmallpox, which once killed 2 million people a year and disfigured many more, is the only human disease to have been eradicated. It was a feat achieved in 1979 following painstaking and lengthy vaccination efforts. (Rinderpest, a disease that affects cattle and also led to food shortages in Africa, was eradicated in 2011 .)\n\nThe world has come close with polio, but the eradication campaign launched in 1998 is nearly two decades past its 2000 deadline, and while the wild polio virus is cornered in Pakistan and Afghanistan, the emergence of new, vaccine-derived strains of the disease have complicated efforts. With some lucky breaks, the disease could be gone by 2023 . Still, the resurgence of measles, another disease once thought to be down and out, serves as a cautionary tale.\n\nLikewise, deadlines for the complete eradication of guinea worm disease , a debilitating condition that causes ulcers and swelling until the worm emerges from the feet, have come and gone without success.\n\nDespite this checkered history, many in the global health community have another deadly disease in their sights: Malaria, which kills 400,000 a year, the majority children younger than 5.\n\nA landmark report by 41 of the world's leading malariologists, biomedical scientists, economists and health policymakers released on Sunday calls for a world free of malaria by 2050 and sets out in detail the case for and path to eradication.\n\nIt comes 50 years after a first attempt failed.\n\n\"For too long, malaria eradication has been a distant dream, but now we have evidence that malaria can and should be eradicated by 2050,\" said Sir Richard Feachem, co-chair of The Lancet Commission on malaria eradication and director of the Global Health Group at the University of California, San Francisco.\n\nAli Maow Maalin, of Merka, Somalia, had the world's last recorded case of endemic smallpox.\n\nComplex enemy\n\nIt's an ambitious goal.\n\nAs a parasitic disease transmitted through the bite of the female mosquito, malaria is a much more complicated to tackle than smallpox or polio viruses, both relatively simple organisms. The parasite goes through many different changes during its life cycles in both its human and insect hosts.\n\nPhotos: 10 diseases you thought were gone There were 216,000 global cases of leprosy, an ancient and disfiguring disease, in 2013. Hide Caption 1 of 10 Photos: 10 diseases you thought were gone In the 19th century, scarlet fever was a common killer in Europe. In 2016, nearly 20,000 cases were reported in the United Kingdom -- the biggest increase in 50 years.\n\n\n\nScarlet fever is just one disease that many have forgotten but that is by no means gone, despite our best efforts to eliminate it. Hide Caption 2 of 10 Photos: 10 diseases you thought were gone\n\nThough it's often thought of as a medieval disease, the World Health Organization reports 1,000 to 3,000 global cases of plague every year. The US averages seven new human cases a year, mostly in the Southwest . Pictured, a patient with gangrene and necrosis, caused by plague. Hide Caption 3 of 10 Photos: 10 diseases you thought were gone This 19-year-old girl in Neijiang, China, is being carried in a basket because she has rickets. Rickets is caused by a lack of vitamin D, which we get from sunlight. Experts believe rickets is making a comeback in developed countries because of the use of sunscreen and less time spent outdoors. Hide Caption 4 of 10 Photos: 10 diseases you thought were gone Gout was once known as the \"disease of kings\" because of its links to excessive food and alcohol consumption. These days, unhealthy lifestyles are behind an increase in gout in developed countries. Hide Caption 5 of 10 Photos: 10 diseases you thought were gone The deadly disease diphtheria affects the nose and throat. Vaccinations mean it is now rare in developed countries, but in 2011, nearly 5,000 cases were reported to the WHO, with many more probably unreported.\n\nHide Caption 6 of 10 Photos: 10 diseases you thought were gone Although there is a pertussis vaccine, there were an estimated 16 million global cases of whooping cough in 2008, killing about 195,000 children. Hide Caption 7 of 10 Photos: 10 diseases you thought were gone But globally, about In April 2015, the Americas became the first region to eliminate rubella; the Centers for Disease Control and Prevention says there are fewer than 10 cases each year.But globally, about 110,000 babies are born with congenital rubella syndrome every year. Hide Caption 8 of 10 Photos: 10 diseases you thought were gone TB, or tuberculosis, is one of the top 10 killers in the world, according to the WHO. In 2016, 10.4 million people around the globe contracted tuberculosis, and more than 1.7 million died. Ninety-five percent of those deaths were in developing countries Hide Caption 9 of 10 Photos: 10 diseases you thought were gone Vaccination programs mean polio is on the verge of extinction -- but there are still cases in Afghanistan and Pakistan. Hide Caption 10 of 10\n\nAnd unlike polio and smallpox, a vaccine looks less likely to play a key role in its plotted demise. While a malaria vaccine is undergoing a large trial in three African countries, Feachem said that the jury was still out on whether that would be widely useful and that the commission's report \"foresees malaria eradication without a vaccine.\"\n\n\"We, the public health community, have had high expectations of malaria vaccines for 40 years and spent a lot of money trying to develop them,\" he said. \"But the commission cautions against spending too much money on vaccine research where the vaccines people have in mind do not confer significant advantages over the vaccine we already have.\"\n\nInstead, the report says eradication will rely on new drugs, diagnostics and insecticides in the pipeline to overcome the growing problem of resistance to malaria drugs and the insecticides used to impregnate things like bednets.\n\nA health worker administers a polio vaccine to a child in Afghanistan in 2017. Afghanistan and Pakistan are the only countries in the world where the disease is endemic.\n\n\"There's this evolutionary arms race between the parasite and our ability to keep on top of its evolving biology.\" Feachem said. \"At the moment we're staying ahead of the evolutionary arms race but there's no certainty we can do that decade after decade. It's an argument that impels us to have a sense of urgency about this.\"\n\nNew technologies like gene editing also offer the promise of genetically modified mosquitoes that fight the others but while the science is there, Feachem said applying it in a real-world setting is likely a decade away, given the regulatory and ethical concerns of releasing a genetically modified creature into the environment.\n\nThere are also wild cards like monkey malaria to contend with. Malaysia has come close to eliminating human malaria, but has seen thousands of people infected with a species of monkey malaria parasite.\n\nHealth care workers test a mother and child for malaria at a border clinic in in Komatipoort, South Africa\n\nOvercoming 'a sense of defeat'\n\nThe world first tried to eradicate malaria soon after the World Health Organization was founded in 1948. The program that lasted from 1955 until 1969 rid several countries of the disease, but it was not implemented in sub-Saharan Africa, the region most affected.\n\n\"Falling short of eradication led to a sense of defeat, the neglect of malaria control efforts and abandonment of research into new tools and approaches,\" the WHO's Strategic Advisory Group on Malaria Eradication said in its summary of a three-year review released on August 23.\n\n\"Malaria came back with a vengeance, millions of deaths followed. It took decades for the world to be ready to fight back against malaria.\"\n\nCollecting a blood sample to later be analyzed for malaria parasites.\n\nHuge progress was made between 2000 and 2015, with a 62% reduction in malaria deaths, according to WHO, and a 41% reduction in the number of cases. However, progress has stalled and more recent data suggests that malaria is making a comeback, with 219 million cases in 2017, compared with 217 million in 2016.\n\nWhile WHO said it remains deeply committed to the disappearance of the malaria parasite, the review suggested it was premature to put a date on it, concluding that the disease would not be eradicated with the currently available drugs and tools -- even though eradication would save millions of lives and a return on investment of billions of dollars.\n\n\"Even with our most optimistic scenarios and projection, we face an unavoidable fact: using current tools, we will still have eleven million cases of malaria in Africa in 2050,\" the report said.\n\n\"In these circumstances, it is impossible to either set a target date for malaria eradication, formulate a reliable operational plan for malaria eradication or to give it a price tag.\n\n\"We must not set the world up for another failed malaria eradication effort that could derail attempt to achieve our vision.\"\n\nJUST WATCHED The challenges in defeating polio Replay More Videos ... MUST WATCH The challenges in defeating polio 08:10\n\nMoonshot?\n\nWhile many of the challenges that existed when the first eradication program was abandoned are similar to those today, Feachem said that our ability to respond to those challenges was \"completely transformed.\"\n\n\"We're now poised at this moment where we can take a cool-headed look at the progress we've made, the tools that we have in our hands and what's in the pipeline,\" he said.\n\n\"To achieve this common vision, we simply cannot continue with a business-as-usual approach.\"\n\nSitting under a newly hung bednet in Mpumalanga province, South Africa\n\nIn addition to new drugs and technological innovations, one thing that will help \"bend the curve\" is better management of eradication programs -- something that's been enabled by better quality and time-sensitive data. In countries like Sri Lanka and China, which hasn't had a case of malaria since 2016, it has allowed authorities to move away from a one-size-fits-all national approach and tailor interventions to specific areas.\n\nMoney, of course, also plays a role and the commission report estimates than an extra $2 billion spending on malaria will be needed per year globally to rid the world of the disease.\n\nFeachem dismisses critics that say now isn't the time to push for an eradication date and instead health authorities should get back on track to meeting existing goals like lowering Malaria cases and mortality by 90% by 2030.\n\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\n\n\"The commitment needs a time line and without one the commitment isn't totally serious,\" he said.\n\n\"If President Kennedy had said in 1961, we will walk on the moon as soon as we can work out how to do it, we would never have walked on the moon by 1969.\n\n\"But ... he said we'll walk on the moon before the end of the decade and it's that combination of a commitment with a timeline that is so powerful.\"", "description": "A newly released report calls for a world free of malaria by 2050 and sets out in detail the case for and path to eradication.", "authors": ["Katie Hunt"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190905133557-10-malaria-eradication-restricted-super-tease.jpg", "published_at": "2019-09-08"}