{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7615099/Frank-Lampard-urges-young-Chelsea-stars-not-relax-securing-sixth-victory-row-Ajax.html", "downloaded_at": "2019-10-26 00:14:05.923066+00:00", "title": "Frank Lampard urges young Chelsea stars not to relax after securing sixth victory in a row at Ajax", "language": "en", "text": "It is at times like this that Frank Lampard is fearful.\n\nHis own playing career taught him that when things are going well is when he also needs to be wary.\n\nThat is a point he has been hammering home to his players whose upward curve continued with Wednesday's 1-0 win at Ajax, Champions League semi-finalists last year.\n\nChelsea head into Saturday evening's Premier League clash away at Burnley in buoyant mood\n\nVictory in Amsterdam was Chelsea's sixth on the spin but Lampard won't allow there to be any let up from his stars.\n\nAhead of Saturday's trip to Burnley, he said: 'I remember being a player and having good runs of form, slightly relaxing in training in moments and the form turned and I had to reassess myself.\n\n'So I became, as I got older, more fearful of good patches, fearful of any form of relaxation so I push that and the staff do too. I certainly am the one who drives that home because that was me as a player.'\n\nKeeping players on their toes is a different task for managers now than it was, certainly earlier, in his career when hairdryer-style treatment would have been the norm.\n\nFrank Lampard has urged his Chelsea side not to let up after securing their sixth straight win\n\n'Probably [uncle] Harry Redknapp in my early days at West Ham would been the one who was most vocal at times, throwing a sandwich or stuff. Old school thing,' Lampard said.\n\n'But the game has moved on and I know that Harry moved on very much, consistently.'\n\nMeanwhile Lampard also had some advice for midfielder Danny Drinkwater who is on loan at Turf Moor but currently out injured after being attacked outside a nightclub last month.\n\nA 2016 title winner with Leicester, Drinkwater didn't play a single competitive game for Chelsea last season and has featured just once since joining Burnley.\n\nLampard said: 'We want him to go there and do well, everyone's approaching it with the right idea trying to do it right and it's now up to Danny himself, to really get his head down, train and work hard because he is our player at the end of the day.'", "description": "It is at times like this that Frank Lampard is fearful. His own playing career taught him that when things are going well is when he also needs to be wary.", "authors": ["Adrian Kajumba For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/21/20197416-0-image-a-121_1572035896868.jpg", "published_at": "2019-10-25"}