{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7611959/Sandra-Bullock-cradles-precious-poodle-pup-pamper-session-Beverly-Hills-hair-salon.html", "downloaded_at": "2019-10-25 16:56:53.859034+00:00", "title": "Sandra Bullock cradles her precious poodle pup after pamper session at Beverly Hills hair salon", "language": "en", "text": "Oscar winner Sandra Bullock cradled her precious poodle after getting her hair done in Beverly Hills on Thursday.\n\nThe Virginia-born 55-year-old - who relies on hairstylist Lona Vigi - dressed down in an all-American white T-shirt, cuffed blue jeans, and white sneakers for her pamper session.\n\nThe Ocean's Eight actress adopted her adorable pup in July after suffering the loss of her two-legged dog Ruby from a stroke and her dog Poppy from a heart tumor (days apart) a year ago.\n\nFur-baby! Oscar winner Sandra Bullock cradled her precious poodle after getting her hair done in Beverly Hills on Thursday\n\nPamper session: The Virginia-born 55-year-old - who relies on hairstylist Lona Vigi - dressed down in an all-American white T-shirt, cuffed blue jeans, and white sneakers\n\nSandra opened up about losing her 'little rides-or-die' as well as her voice coach father John W. Bullock, age 93, in September 2018 while appearing on The Ellen DeGeneres Show.\n\n'Life, I realized, happens whether you schedule it or not. That just blew my mind this year,' Bullock explained on December 20.\n\n'I was like, \"I'm gonna be fine,\" and then a week later, I'm in the bathtub crying and the kids are like, \"Is Mommy okay?\" Everyone was like, \"Just leave Mommy in the bathtub. She's gonna be fine.\"\n\n'So, you know what? It's life. But, you know, when you lose your little rides-or-die, it makes things different.'\n\nRIP: The Ocean's Eight actress adopted her adorable pup in July after suffering the loss of her two-legged dog Ruby from a stroke and her dog Poppy from a heart tumor (days apart) a year ago (pictured in 2008)\n\n'That just blew my mind': Sandra opened up about losing her 'little rides-or-die' as well as her voice coach father John W. Bullock, age 93, in September 2018 while appearing on The Ellen DeGeneres Show (pictured December 20)\n\nMissing from the Golden Globe winner's side on Thursday were her nine-year-old son Louis Bardo and seven-year-old daughter Laila, whom she adopted in 2010 and 2015.\n\nSandra - who enlists a nanny - was said to have first met her photographer beau Bryan Randall in 2015 after hiring him to shoot her son's 5th birthday bash.\n\nThe East Carolina University grad was last pictured with the 53-year-old ex-con on September 16 visiting a pet shop in Hollywood.\n\nCareer break: Bullock has been enjoying an acting hiatus following the success of her Netflix film Bird Box, which was streamed by over 80M households despite scoring a 63% Rotten Tomatoes rating\n\nBryan reportedly has a 26-year-old daughter Skylar Staten with his ex-fiancée Janine Staten, who died from a drug overdose in 2007.\n\nBullock has been enjoying an acting hiatus following the success of her Netflix film Bird Box, which was streamed by over 80M households despite scoring a 63% Rotten Tomatoes rating.\n\nIn Susanne Bier's sci-fi dystopian drama, the divorced mother-of-two played survivor Malorie Hayes, who shepherds two children to safety from an ocular-based violent plague.", "description": "The 55-year-old Oscar winner adopted her canine companion in July after suffering the loss of her two-legged dog Ruby from a stroke and her dog Poppy from a heart tumor a year ago", "authors": ["Cassie Carpenter For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/08/20168798-0-image-a-145_1571986952537.jpg", "published_at": "2019-10-25"}