{"pub": "yahoo", "url": "https://news.yahoo.com/pro-touring-1965-ford-mustang-215826027.html", "downloaded_at": "2019-10-26 02:17:37.634171+00:00", "title": "Pro-Touring 1965 Ford Mustang GT Up For Grabs", "language": "en", "text": "There's just something extra special about the first-gen fastback Mustangs.\n\nWe see so many six-figure restomods and pro-touring cars these days that they've almost lost the shock value. If you're yearning for a classic that has an old-school look and feel with a modernized ride and improved handling, then this 1965 Ford Mustang GT Fastback that will be going up for auction online through All Collector Cars Auctions starting this weekend is a great fit.\n\nPro-Touring 1965 Ford Mustang GT Up For Grabs More\n\nFrom the outside, there's little to signify this 1965 Ford Mustang GT Fastback is anything but stock. The body is perfectly stock without any hood scoops or widened fenders, and the black paint with red striping adds a stylish and sinister look. In fact, if it wasn't for the larger five-spoke wheels that expose the four-wheel disc brakes with drilled and slotted rear rotors, you would be forgiven if you called this a bone-stock Mustang.\n\nThose five-spoke, 17-inch American racing wheels are about the only clue that you'll see that this car has been upgraded with modern suspension components. To better tackle tight turns, this Mustang features a four-link rear suspension with coil-over shocks, which also helps to give the car a cooler, more squatted stance. Again, the builder of this car resisted the urge to build an over-the-top pro-touring car, and as such, it doesn't have the massive wheels or crazy modern engine under the hood.\n\nWhat it does have under the hood is one of the most iconic Mustang engines of all time: the 289 CID V8! This engine has a four-barrel carb, and it lays down its 220 horsepower through a four-speed manual transmission. Pro-Touring cars were created to be driven and enjoyed, and that's exactly what this '65 Mustang is set up to do – even though it might not have the horsepower of some restomods or pro-touring cars. What it does have is that timeless, unmistakable Mustang presence combined with well-hidden modern upgrades to make sure this car is ready for the track or just cruising around town.\n\nThis pro-touring Mustang Fastback is featured by All Collector Cars Auctions, and the online-only auction will run from October 26th until November 2nd. If you want a shot at owning this awesome pony car, then be sure you're registered to bid by clicking HERE.\n\nMore From Raleigh Classic Car Auctions...\n\n\n\n\n\n\n\n\n\n", "description": "There's just something extra special about the first-gen fastback Mustangs.We see so many six-figure restomods and pro-touring cars these days that they've almost lost the shock value. If you're yearning for a classic that has an old-school look and feel with a modernized ride and improved", "authors": ["Jeffrey N. Ross"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Koqn73KhUtzTOY25ICHUhg--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en_us/autoclassics_668/462143f5db352e4eb98fb64b6c20c373", "published_at": "2019-10-25"}