{"pub": "yahoo", "url": "https://finance.yahoo.com/news/companies-to-watch-aapl-gs-pcg-tsla-hog-143826814.html", "downloaded_at": "2019-10-15 15:14:58.403626+00:00", "title": "Apple, Goldman Sachs, PG&E, Tesla, Harley-Davidson, Saks: Companies to Watch", "language": "en", "text": "\n\nHere are the companies the Yahoo Finance team is watching for you today.\n\nPurchases on that fancy new Apple (AAPL) credit card apparently aren't getting reported to the credit bureaus. Marketwatch says Goldman Sachs (GS), which runs the card, hasn't started sharing consumer details with Experian, Equifax or TransUnion because it's a brand new offering. It's not clear when, or if, they might start sharing the info.\n\nCalifornia is asking PG&E (PCG) for a refund. Following the planned power outage last week, the governor is calling for refunds of $100 per residential customer, and $250 for each small business. The outage also crashed PG&E's informational website, and failed to restore power to some customers for days.\n\nTesla (TSLA) will begin to install its Powerwall home power storage batteries in Japan next spring. It marks the product's debut in Asia. The battery panels can store energy generated by solar energy and cost a little over $9,000. Customers in the region have been able to pre-order the panels since 2016, but have been waiting for a timeline for installations.\n\nHarley-Davidson (HOG) is pressing pause on the production of its Live Wire electric motorcycles. That's after the company found a problem linked to the motorcycle’s charging equipment. Harley Davidson said the $30,000 dollar bikes are still safe to ride, but can only be charged with a professional type of charger that’s available at dealerships. Harley has been banking on its electric bike to kickstart slowing sales.\n\nBarneys could get a lifeline amid bankruptcy fears. Authentic Brands Group, owner of Nine West and Aéropostale, is preparing a $270 million bid to license the brand to Saks. Barneys filed for bankruptcy protection in August and is on the clock to clinch a bid by today.", "description": "Apple, Goldman Sachs, PG&E, Tesla, Harley-Davidson and Saks are the companies to watch.", "authors": ["Yahoo Finance"], "top_image": "https://s.yimg.com/uu/api/res/1.2/BP0CkQ8aBCFOe1c5PSjT3w--~B/aD0zMzMzO3c9NTAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/e6dca7f0-ef55-11e9-88ff-71b44d936262", "published_at": "2019-10-15"}