{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/treasury-sec-mnuchin-open-to-relaxing-financial-crisis-bank-laws-2019-10-1028641183", "downloaded_at": "2019-10-30 00:09:14.727243+00:00", "title": "US Treasury Secretary Mnuchin is reportedly open to relaxing bank regulations born from the 2008 financial crisis", "language": "en", "text": "Reuters\n\nUS Treasury Secretary Steven Mnuchin is open to loosening laws that require banks to create emergency reserves for liquidity crises, Bloomberg reported Tuesday.\n\nMnuchin said he spoke with JPMorgan CEO Jamie Dimon and other banks about a September lending rate spike and how to avoid similar issues.\n\nDimon recently said JPMorgan would have intervened in September's liquidity crisis had laws been looser. The spike prompted the Federal Reserve to begin capital injections for the first time since the 2008 financial crisis.\n\nMnuchin's comments arrive just days after Senator Elizabeth Warren warned the Treasury Secretary not to ease the bank regulations.\n\nVisit the Business Insider homepage for more stories.\n\nUS Treasury Secretary Steven Mnuchin is open to loosening bank laws meant to create buffer reserves in case of financial crisis, Bloomberg reported Tuesday afternoon.\n\nThe laws — created in the wake of the 2008 financial crisis — stifle bank liquidity, as the firms are obliged to hold a larger proportion of their free cash in emergency reserves. Larger banks are assessed on how prepared they for financial crises, and some analysts project firms to restrain overnight lending to score better in the year-end reviews.\n\n\"The banks have raised an issue around intra-day liquidity, and that is something that makes sense for regulators to look at,\" Mnuchin said in Tel Aviv.\n\nThe regulations have been under greater focus in recent weeks, as a mid-September spike in the overnight lending rate prompted the Federal Reserve to begin capital injections for the first time in a decade. The central bank began mending the rate through market repurchase agreement, or repo, operations on September 17, and started purchasing Treasury bills on October 15 to further support banks' reserves.\n\nMnuchin told Bloomberg he recently spoke to JPMorgan Chase CEO Jamie Dimon and other banks about the liquidity crisis and how to solve recent pressures. Dimon previously blamed liquidity laws for why JPMorgan didn't step in to calm the repo rate during September's spike.\n\n\"It's a reasonable question: Have we gone too far in the other direction in requiring the banks to maintain this excess liquidity for intra-day operations,\" Mnuchin told Bloomberg.\n\nThe statement comes days after Senator Elizabeth Warren penned a letter to Mnuchin warning him not to relax the bank laws. She asked the Treasury Secretary what he thinks caused the rate spike, and why the Fed is boosting bank reserves when the firms are recording record earnings.\n\n\"These rules were designed to ensure that banks have enough cash on hand to meet their obligations in the event of another market crash,\" Warren wrote. \"Banks are reporting profits at record levels, and it would be painfully ironic if unexplained chaos in a small corner of the banking market became an excuse to further loosen rules that protect the economy from these kinds of risks.\"\n\nThe Federal Open Market Committee meets Tuesday to discuss policy and potentially call for another interest rate cut. The Fed has already cut rates twice in 2019, citing increased risk from trade pressures and global economic slowdown for the actions.\n\nNow read more markets coverage from Markets Insider and Business Insider:\n\nBeyond Meat just served up a reminder to investors that sometimes company performance takes a back seat to technical forces\n\nHere's what's in the first stage of the partial US-China trade agreement\n\nInside the quest to reboot Personal Capital, the wealth manager grappling with its identity in the cutthroat robo-advisory age", "description": "US Treasury Secretary Steven Mnuchin is open to loosening laws that require banks to create emergency reserves for liquidity crises, Bloomberg reported Tu...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5db88a7edee0192f3e1a65c6-2400/2019-10-28t112525z1lynxmpef9r0pertroptp4usa-trump.jpg", "published_at": "2019-10-10"}