{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7529249/Kamala-Harris-ramps-push-Donald-Trump-banned-Twitter-abuse.html", "downloaded_at": "2019-10-05 06:40:48.375073+00:00", "title": "Kamala Harris ramps up push to get Donald Trump banned from Twitter for 'abuse'", "language": "en", "text": "MICHAEL BENNET\n\nAge on Inauguration Day 2021: 56\n\nEntered race: May 2, 2019\n\nCareer: Currently Colorado senator. Educated at elite St. Albans preparatory school and was a Capitol Hill page before graduating Wesleyan and Yale Law School. Was law clerk and worked in Clinton's Department of Justice then moved to Colorado in 1997 as managing director of billionaire Philip Anschutz's investment company. Was chief of staff to Denver mayor John Hickenlooper, then superintendent of Denver Public schools. Appointed to vacant Colorado Senate seat in 2009, held it 48.1 to 46.4 in 2010 and 50 to 44.3 in 2016\n\nFamily: Married to environmental attorney Susan Daggett, with three daughters - Halina, Anne and Caroline. Was born in New Delhi while to diplomat father Douglas Bennet, who went onto be CEO of NPR and a Clinton assistant secretary of state. His grandfather, also Douglas, was an economic adviser to FDR. Mother Susanne is retired elementary school librarian whose parents were Holocaust survivors. Brother James is editor of the New York Times opinion section\n\nReligion: Says he was raised with Jewish and Christian heritage; no known adherence\n\nViews on key issues: Moderate who does not endorse Medicare for all or - so far - Green New Deal. Strongly pro-choice and pro-gay rights, leading to 2010 Senate victory. Pro raising minimum wage. Wants citizenship pathway for 'dreamers.'\n\nWould make history as: First Colorado president\n\nJOE BIDEN\n\nAge on Inauguration Day 2021: 78\n\nEntered race: April 25, 2019\n\nCareer: No current role. A University of Delaware and Syracuse Law graduate, he was first elected to Newcastle City Council in 1969, then won upset election to Senate in 1972, aged 29. Was talked out of quitting before being sworn in when his wife and daughter died in a car crash and served total of six terms. Chaired Judiciary Committee's notorious Clarence Thomas confirmation hearings. Ran for president in 1988, pulled out after plagiarism scandal, ran again in 2008, withdrew after placing fifth in the Iowa Caucuses. Tapped by Obama as his running mate and served two terms as vice president. Contemplated third run in 2016 but decided against it after his son died of brain cancer.\n\nFamily: Eldest of four siblings born to Joe Biden Sr. and Catherine Finnegan. First wife Neilia Hunter and their one-year-old daughter Naomi died in car crash which their two sons, Joseph 'Beau' and Robert Hunter survived. Married Jill Jacobs in 1976, with whom he has daughter Ashley. Beau died of brain cancer in 2015. Hunter's marriage to Kathleen Buhle, with whom he has three children, ended in 2016 when it emerged Hunter was in a relationship with Beau's widow Hallie, mother of their two children. Hunter admitted cocaine use; his estranged wife accused him of blowing their savings on drugs and prostitutes\n\nReligion: Catholic\n\nViews on key issues: Ultra-moderate who will emphasize bipartisan record. Will come under fire over record, having voted: to stop desegregation bussing in 1975; to overturn Roe v Wade in 1981; for now controversial 1994 Violent Crime Act; for 2003 Iraq War; and for banking deregulation. Says he is 'most progressive' Democrat. New positions include free college, tax reform, $15 minimum wage. No public position yet on Green New Deal and healthcare. Pro-gun control. Has already apologized to women who say he touched them inappropriately\n\nWould make history as: Oldest person elected president\n\nSlogan: Working for America\n\nCORY BOOKER\n\nAge on Inauguration Day: 51\n\nEntered race: February 1, 2019\n\nCareer: Currently New Jersey senator. High school football star who went to Stanford or undergraduate and masters degrees before studying in Oxford as a Rhodes scholar and Yale Law School. Worked for advocacy and youth projects and successfully ran for Newark, New Jersey, city council in 1998. Narrowly lost mayoral election in 2002 facing claims he was 'suburban' and 'not black enough.' Ran again in 2006 and won landslide on radical reform platform for troubled city, including being tough on crime, cutting budget deficit, increasing affordable housing and tackling failing schools - controversially taking a huge donation from Mark Zuckerberg for the city. Ran for New Jersey senate seat in 2013 special election and won; won full term in 2014\n\nFamily: Unmarried but dating actress Rosario Dawson. Parents Cary and Carolyn were among IBM's first black executives. Brother Cary Jr. is education adviser to New Jersey's Democratic governor\n\nReligion: Baptist\n\nViews on key issues: Self-proclaimed liberal. Endorses abortion rights; affirmative action; single-payer health care; criminal justice reform; path to citizenship for 'dreamers; federal marijuana decriminalization; $15 minimum wage; but has also spoken against tech regulation and for long-term deficit reduction\n\nWould make history as: First unmarried president since Grover Cleveland in 1886\n\nSlogan: Together, America, We Will Rise\n\nSTEVE BULLOCK\n\nAge on Inauguration Day: 54\n\nEntered race: May 14, 2019\n\nCareer: Currently governor of Montana. Montana native educated at Claremont McKenna College, California, and Columbia Law who worked for Montana Democratic governor and Department of Justice before failed 2000 run for state attorney general. Practiced law then ran again in 2008 and won, using it to springboard to run for governor in 2012, winning 48.9 to 47.3, then winning second term in 2016 by 50.3 to 46.4 in a state which Trump won 56.2 to 35.7. Only Democratic governor to win re-election in a Trump state\n\nFamily: Married to Lisa Downs, who was a year behind him in high school. They have three children, Caroline, Alexandria and Cameron. His parents Michael, a teacher, and Margaret, a school board trustee, divorced when he was at grade school and he has one brother, Bill\n\nReligion: Catholic\n\nViews on key issues: Vocal moderate. Wants Democrats to expand reach beyond the coasts and cities. Not signed up to Green New Deal or Medicare for All. Warned Hillary Clinton against attacking coal mining in 2016. Says government has to afford taxation and spending commitments. Social liberal on abortion and gay marriage. Has shifted from gun control opponent to backing universal background checks and assault weapon ban\n\nWould make history as: First Montanan president\n\nSlogan: To be announced\n\nPETE BUTTIGIEG\n\nAge on Inauguration Day: 39\n\nEntered race: Announced formation of exploratory committee January 23, 2019. Formally entered race April 14, 2019\n\nCareer: Currently mayor of Sound Bend, Indiana. Harvard grad and Rhodes scholar who got a second degree from Oxford before working as a McKinsey management consultant and being commissioned as a Navy Reserve intelligence officer. Elected South Bend mayor in 2011 and served in combat in 2013, won re-election in 2015\n\nFamily: Came out as gay during second mayoral run and married husband Chasten Glezman, a middle school teacher in 2018. Parents were University of Notre Dame academics. Surname is pronounced BOOT-edge-edge. Would be first combat veteran since George H.W. Bush\n\nReligion: Raised as a Catholic, now Episcopalian\n\nViews on key issues: Has said Democratic party needs a 'fresh start'; wrote an essay in praise of Bernie Sanders aged 17; backed paid parental leave for city employees; other policies unknown\n\nWould make history as: First openly gay and youngest-ever president\n\nSlogan: To be announced\n\nJULIAN CASTRO\n\nAge on Inauguration Day: 46\n\nEntered race: January 12, 2018, at rally in his native San Antonio, TX. Had formed exploratory committee two months previously\n\nCareer: No current job. Stanford and Harvard graduate who was a San Antonio, Texas, councilman at 26 and became mayor of the city in 2009. Was Obama's Housing and Urban Development secretary from 2014 to 2016\n\nFamily: Married with nine-year-old daughter, Carina, and four-year-old son, Cristian. His identical twin Joaquin, who is a minute younger, is Democratic congressman. Mother Maria del Rosario Castro was part of 'radical' third party for Mexican-Americans; father left his wife and five children for her but they never married. Would be first Hispanic-American president - announced his run in English and Spanish - and first-ever U.S. president with a twin\n\nReligion: Catholic\n\nViews on key issues: Wants medicare for all; universal pre-K; action on affordable housing; will not take money from political action committees (PACs) tied to corporations or unions. Other views still to be announced\n\nWould make history as: First Hispanic president, first to be a twin\n\nSlogan: One Nation, One Destiny\n\nJOHN DELANEY\n\nAge on Inauguration Day: 57\n\nEntered race: Filed papers July 28, 2017\n\nCareer: No current job. Columbia and Georgetown law educated financial entrepreneur. Set up publicly-traded companies lending capital to healthcare and mid-size businesses and was youngest CEO at the time of a New York Stock Exchange-listed firm. Three-time Maryland congressman, first winning election in 2012; announced run for president instead of running again in 2018\n\nFamily: Married father of four; wife April works for children's issues nonprofit. Credits his working class father's union for helping him through college\n\nReligion: Catholic\n\nViews on key issues: Social liberal in favor of legalized pot and gun control but not single-payer healthcare; fiscally conservative\n\nWould make history as: First president from Maryland. First openly bald president since Eisenhower\n\nSlogan: Focus on the Future\n\nTULSI GABBARD\n\nAge on Inauguration Day: 39\n\nEntered race: Still to formally file any papers but said she would run on January 11 2019\n\nCareer: Currently Hawaii congresswoman. Born on American Samoa, a territory. Raised largely in Hawaii, she co-founded an environmental non-profit with her father as a teenager and was elected to the State Legislature aged 21, its youngest member in history. Enlisted in the National Guard and served two tours, one in Iraq 2004-2006, then as an officer in Kuwait in 2009. Ran for Honolulu City Council in 2011, and House of Representatives in 2012\n\nFamily: Married to her second husband, Abraham Williams, a cinematographer since 2015. First marriage to childhood sweetheart Eduardo Tamayo in 2002 ended in 2006. Father Mike Gabbard is a Democratic Hawaii state senator, mother Carol Porter runs a non-profit.\n\nReligion: Hindu\n\nViews on key issues: Has apologized for anti-abortion and anti-gay marriage views; wants marijuana federally legalized; opposed to most U.S. foreign interventions; backs $15 minimum wage and universal health care; was the second elected Democrat to meet Trump after his 2016 victory\n\nWould make history as: First female, Hindu and Samoan-American president; youngest president ever\n\nSlogan: Lead with Love\n\nKAMALA HARRIS\n\nAge on Inauguration Day: 56\n\nEntered race: Announced she was running January 21, 2018 - Martin Luther King Jr. Day - on Good Morning America. Formally entered race January 27\n\nCareer: Currently California senator. Howard and U.C. Hunter law school grad who worked as assistant district attorney in Alameda County, CA, then in San Francisco's DA's office before being elected San Francisco DA in 2003 and used it as springboard to run successfully for California attorney general in 2010. Won again in 2014 and was at center of U.S. attorney general and Supreme Court speculation but also endured a series of controversies, including over police brutality allegations. Ran for Senate in 2016 and established herself on liberal wing of party\n\nFamily: Born in Berkeley, CA, to immigrant Indian Tamil mother and Jamaican father who were both academics and brought up from seven to 18 in Montreal, Canada. Dated married San Francisco mayor Willie Brown, when he was 60 and she was 29. Married attorney Douglas Emhoff in 2014 and has two stepchildren; Cole, an aspiring actor, and Ella, an art and design student. Sister Maya was a Hillary Clinton adviser and brother-in-law Tony West is Uber's chief legal counsel\n\nViews on key issues: Social ultra-liberal who has rejected criticisms of 'identity politics' and is running without a political action committee, which will make her reliant on small donors. Has shifted left on criminal justice reform; supports Medicare for all; pro-gun control and anti-death penalty; says illegal immigration is a civil not a criminal offense\n\nReligion: Has said she was brought up in both Baptist and Hindu tradition\n\nWould make history as: First female and first Indian-American president\n\nSlogan: For The People\n\nAM Y KLOBUCHAR\n\nAge on Inauguration Day: 60\n\nEntered race: Announced candidacy February 10, 2019 at snow-drenched rally in her native Minneapolis\n\nCareer: Currently Minnesota senator. Yale and University of Chicago law graduate who became a corporate lawyer. First ran unsuccessfully for office in 1994 as Hennepin, MI, county attorney, and won same race in 1998, then in 2002, without opposition. Ran for Senate in 2006 and won 58-38; re-elected in 2012 and 2018\n\nFamily: Married to John Bessler, law professor at University of Baltimore and expert on capital punishment. Daughter Abigail Bessler, 23, works fora Democratic member of New York City council. Father Jim, 90, was a veteran newspaper columnist who has written a memoir of how his alcoholism hurt his family; mom Rose is a retired grade school teacher\n\nReligion: Congregationalist (United Church of Christ)\n\nViews on key issues: Seen as a mainstream liberal: says she wants 'universal health care' but has not spelled out how; pro-gun control; pro-choice; backs $15 minimum wage; no public statements on federal marijuana legalization; has backed pro-Israel law banning the 'boycott, divestment and sanctions' movement; spoke out against abolishing ICE\n\nWould make history as: First female president\n\nSlogan: To be announced\n\nWAYN E MESSAM\n\nAge on Inauguration day: 46\n\nEntered race: Announced March 28, 2019, formal launch March 30, 2019\n\nCareer: Currently mayor of Miramar, Florida. Florida State University football star who played starting wide receiver, and graduated in 1997. Worked in construction industry as contractor and started his own company in 2007. Ran for City of Miramar Commission in 2011 and mayor in 2015, defeating 16-year Democratic incumbent and becoming first black mayor of the city. Won second term March 2019, days before announcing presidential bid\n\nFamily: Married to college sweetheart Angela Sands, 44, who is also his business partner. Three college-age children: son Wayne Jr. and twin daughters Kayla and Kyla. Fourth child and first American-born child of Jamaican immigrants Hubert , a sugar-cane cutter, and his wife Delsey, who are both deceased. Was president of the National Black Caucus of Local Elected Officials in 2018\n\nReligion: Worships at the Fountain of New Life Church in Miami Gardens where he is a deacon\n\nViews on key issues: Says he is staunch advocate of gun control. Wants action on climate change and is opposed to off-shore oil drilling. Opposes Trump immigration policies and proposed forcing immigration officials to get a warrant before entering city property. Yet to state position on health care and foreign policy\n\nWould make history as: First Jamaican-American and first Florida president\n\nSlogan: Your Champion\n\nBETO O'ROURKE\n\nAge on Inauguration Day: 47\n\nEntered race: March 14, 2019\n\nCareer: No current job. Born Robert Francis O'Rourke. Boarding-school educated Columbia grad who lived in a New York loft, playing in a punk band and doing desultory jobs and setting up an internet firm. Ran for El Paso city council in 2005, winning re-election and serving until 2012. Ran for Congress in 2012, defeating eight-term Democratic incumbent in primary. Gave up seat to run for Senate against Ted Cruz in 2018, losing 51-48\n\nFamily: Married to wife Amy Sanders, nine years his junior, with sons Ulysses and Henry, and daughter Molly. Father Pat was long-time El Paso politician who switched from Democrat to Republican; mom Melissa ran family-owned store in city until selling it after IRS probe. Melissa's stepfather Fred Korth was one of JFK's secretaries of the Navy. Father-in-law William Saunders is real estate developer estimated to be worth $500 million\n\nReligion: Catholic\n\nViews on key issues: Wants comprehensive immigration reform to give citizenship to 'dreamers' and a path to it for their parents, and vehemently opposes Trump's wall. Supports federal marijuana legalization. Pro-gun control including an assault rifle ban and universal background checks. Supports single-payer health care but with co-pays and has backed Medicaid expansion. Strongly pro-choice. Has hinted at backing breaking up tech giants. Said he would have voted for impeachment in Congress if he had had the chance\n\nWould make history as: No clear claims\n\nSlogan: To be announced\n\nTIM RYAN\n\nAge on Inauguration Day: 46\n\nEntered race: April 4, 2019\n\nCareer: Currently Ohio congressman. High school football star who got a scholarship to Youngstown State, Ohio, but transferred to nearby Bowling Green University when his career ended in injury. Became a congressional aide, picked up a law degree, then served in the Ohio Senate and when his former House boss Jim Traficant went to prison for fraud ran for his seat in 2002 and won. Has held district - first Ohio 13th then the 17th when Youngstown was redistricted - since with little opposition since. Released book on meditation in 2012 and considered running against Nancy Pelosi for minority leader\n\nFamily: Married first grade schoolteacher Andrea Zetts in 2013. Couple had a son, Brady, the following year. Zetts has a daughter, Bella, and a son, Mason, from her first marriage who Ryan says he 'loves like his own.' Ryan's first marriage ended in divorce. He was brought up by his mom Rochelle after she and his father Allen divorced when he was seven\n\nReligion: Catholic\n\nViews on key issues: Moderate who backs Medicare for all. Flipped from anti-abortion to pro-choice in dramatic fashion in 2015. Does not appear to back the Green New Deal but suggests a carbon tax. Spoken up for capitalism but is also pro-union. Advocated for mindfulness teaching in classrooms. Also flipped on gun control from A rating by NRA to strong support of anti-gun measures\n\nWould make history as: Only second sitting congressman elected president - first was James Garfield, also from Ohio, in 1880\n\nSlogan: To be announced\n\nBERNIE SANDERS\n\nAge on Inauguration Day: 79\n\nEntered race: Sources said on January 25, 2019, that he would form exploratory committee. Officially announced February 19\n\nCareer: Currently Vermont senator. Student civil rights and anti-Vietnam activist who moved to Vermont and worked as a carpenter and radical film-maker. Serial failed political candidate in the 1970s, he ran as a socialist for mayor of Burlington in 1980 and served two terms ending in 1989, and win a seat in Congress as an independent in 1990. Ran for Senate in 2006 elections as an independent with Democratic endorsement and won third term in 2018. Challenged Hillary Clinton for the Democratic nomination in 2016 but lost. Campaign has since been hit by allegations of sexual harassment - for which he has apologized - and criticized for its 'Bernie bro' culture\n\nFamily: Born to a Jewish immigrant father and the daughter of Jewish immigrant parents in Brooklyn, New York. First marriage to college sweetheart Deboarah Shiling Messing in 1964 ended in divorce in 1966; had son Levi in 1969 with then girlfriend Susan Cambell Mott. Married Jone O'Meara in 1988 and considers her three children, all adults, his own. The couple have seven grandchildren. His older brother Larry is a former Green Party councilor in Oxfordshire, England. Would be first Jewish president\n\nReligion: Secular Jewish\n\nViews on key issues: Openly socialist and standard bearer for the Democratic party's left-turn. Wants federal $15 minimum wage; banks broken up; union membership encouraged; free college tuition; universal health care; re-distributive taxation; he opposed Iraq War and also U.S. leading the fight against ISIS and wants troops largely out of Afghanistan and the Middle East\n\nWould make history as: Oldest person elected president\n\nSlogan: Not me. Us.\n\nJOE SESTAK\n\nAge on Inauguration Day: 69\n\nEntered race: June 23, 2019\n\nCareer: U.S. Naval Academy graduate who rose to three-star admiral with assignments including commanding the USS George Washington aircraft carrier battle group and Bill Clinton's National Security Council's director for defense policy but clashed with Donald Rumsfeld. Retired and ran as Democrat in Pennsylvania's 7th district 2006, won and held it until he ran for Pennsylvania's Senate seat in 2010, losing 51-49 with a margin of 80,229 votes. Ran again in 2016 but lost in primary\n\nFamily: Married to wife Susan Clark, a defense and environmental analyst he met on a trip to the then Soviet Union. Daughter Alexandra, born 2004, survived a brain tumor aged four but cancer returned this year. Father Joe Sr. was decorated Navy officer in World War II and is buried in Arlington National Cemetery\n\nReligion: Catholic\n\nViews on key issues: Wants $1 trillion public infrastructure plan; says there is a 'climate crisis' and wants green jobs; attacks China for 'intellectual property theft' but wants U.S. back in the Trans-Pacific Partnership Trump pulled out of; wants Medicare to compete as a 'public option' rather than universal health care; also wants back into Iran deal and Paris accord\n\nWould make history as: First veteran president since George H.W. Bush\n\nSlogan: Accountability to America\n\nTOM STEYER\n\nAge on Inauguration Day 2021: 63\n\nEntered race: July 9, 2019\n\nCareer: Currently retired. New York-born to wealthy family, he was educated at elite Phillips Exeter Academy, same as rival Andrew Yang, and Yale, then Stanford Business School. Morgan Stanley and Goldman Sachs banker who founded his own hedge fund in 1986 and made himself a billionaire; investments included subprime lenders, private prisons and coal mines. Stepped down in 2012 to focus on advocating for alternative energy. Longtime Democratic activist and donor who started campaign to impeach Trump in October 2017. Net worth of $1.6 billion has made him one of the Democrats' biggest single donors\n\nFamily: Married Kathryn Taylor in 1986; they have four adult children who have been told they will not inherit the bulk of his fortune. Announced last November he and his wife would live apart. Father Roy was a Nuremberg trials prosecutor\n\nReligion: Episcopalian\n\nViews on key issues: On the left of the field despite being a hedge fund tycoon. Backs single-payer health care, minimum wage rises and free public college. Previously spoke in favor of Bernie Sanders' agenda. Aggressive backer of climate change action, including ditching fossil fuels\n\nWould make history as: Richest Democratic president ever\n\nELIZABETH WARREN\n\nAge on Inauguration Day: 71\n\nEntered race: Set up exploratory committee December 31, 2018\n\nCareer: Currently Massachusetts senator. Law lecturer and academic who became an expert on bankruptcy law and tenured Harvard professor. Ran for Senate and won in 2012, defeating sitting Republican Scott Brown, held it in 2018 60% to 36%. Was short-listed to be Hillary's running mate and campaigned hard for her in 2016\n\nFamily: Twice-married mother of two and grandmother of three. First husband and father of her children was her high-school sweetheart. Second husband Bruce Mann is Harvard law professor. Daughter Amelia Tyagi and son Alex Warren have both been involved in her campaigns. Has controversially claimed Native American roots; DNA test suggested she is as little as 1,064th Native American\n\nReligion: Raised Methodist, now described as Christian with no fixed church\n\nViews on key issues: Was a registered Republican who voted for the party but registered as a Democrat in 1996. Pro: higher taxes on rich; banking regulation; Dream Act path to citizenship for 'dreamers'; abortion and gay rights; campaign finance restrictions; and expansion of public provision of healthcare - although still to spell out exactly how that would happen. Against: U.S. presence in Afghanistan and Syria; liberalization of gambling\n\nWould make history as: First female president\n\nSlogan: To be announced\n\nMARIANNE WILLIAMSON\n\nAge on Inauguration Day: 68\n\nEntered race: Announced exploratory committee November 15, 2018. Formally entered January 28, 2019\n\nCareer: Currently an author, Dropped out of Pomona College, California, became part of the counter culture and anti-war movement and ran a 'metaphysical bookstore' before publishing spiritual guide A Return to Love and being praised by Oprah, sending it to number one. Published series of follow-ups and founded AIDS charity and subsequently more non-profits including a peace movement. Ran for Congress in 2014 and lost\n\nFamily: Born to immigration attorney father Sam and housewife mother Sophie in Houston, Texas. Married for 'a minute and a half' to unnamed man; daughter India was born in 1990 but Williamson declines to name her father\n\nReligion: Jewish\n\nViews on key issues: Wants vast expansion of physical and mental healthcare; and nutrition and lifestyle reforms including ban on marketing processed and sugary foods to children; universal pre-K; much of the Green New Deal's proposals including a de-carbonized economy, electric cars and rebuilding mass transit; gun control through licensing; wants more vacation time; pro decriminalizing all drugs\n\nWould make history as: First female president\n\nSlogan: Join the Evolution\n\nANDREW YANG\n\nAge on Inauguration Day: 46\n\nEntered race: Filed papers November 6, 2018\n\nCareer: No current job. Went to public school in New York where he describes being bullied with racial slurs, then elite Phillips Exeter Academy boarding school - same as rival Tom Steyer. Brown and Columbia Law graduate who abandoned career as an attorney then started a dotcom flop then become healthcare and education tech executive who set up nonprofit Venture for America\n\nFamily: Married to wife Evelyn with two sons, one of whom he has said is on the autism spectrum. His parents were both immigrants from Taiwan who met at the University of California, Berkeley, as grad students\n\nReligion: Reformed Church\n\nViews on key issues: Warns of rise of robots and artificial intelligence, wants $1,000 a month universal basic income and social media regulated. Spoke out against male circumcision. Wants a state monitor to crack down on 'fake news.'\n\nWould make history as: First Asian-American president\n\nSlogan: Humanity First\n\nAND THOSE WHO'VE ALREADY WITHDRAWN\n\nKIRSTEN GILLIBRAND, New York senator\n\nEntered race: January 16, 2019. Quit: August 28, 2019\n\nBILL DE BLASIO, New York City mayor\n\nEntered race: May 16, 2019. Quit: September 20, 2020\n\nMIKE GRAVEL, Former Alaska governor\n\nEntered race: April 2,2019. Quit: August 2, 2019\n\nJOHN HICKENLOOPER, Former Colorado governor\n\nEntered race: March 4, 2019. Quit: August 15, 2019\n\nJAY INSLEE, Washington state governor\n\nEntered race: March 1, 2019. Quit: August 21, 2019\n\nSETH MOULTON, Massachusetts congressman\n\nEntered race: April 22,2019. Quit: August 23, 2019\n\nRICHARD OJEDA, West Virginia ex-state senator and paratrooper veteran\n\nEntered race: November 12, 2018. Quit: January 25, 2019\n\nERIC SWALWELL, California congressman\n\nEntered race: April 8, 2019. Quit July 8, 2019", "description": "Kamala Harris ramped up her push to get Donald Trump suspended from Twitter, sending a letter to company CEO Jack Dorsey to make her case.", "authors": ["Emily Goodin", "U.S. Politcal Reporter For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/02/15/19207608-0-image-a-2_1570025230421.jpg", "published_at": "2019-10-02"}