{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7578183/Kelly-Gale-Joel-Kinnaman-make-red-carpet-debut-couple.html", "downloaded_at": "2019-10-16 05:11:53.579097+00:00", "title": "Kelly Gale and Joel Kinnaman make their red carpet debut as a couple", "language": "en", "text": "It looks like things are getting serious between Victoria's Secret model Kelly Gale and her new beau, Swedish actor Joel Kinnaman.\n\nOn Tuesday, the genetically-blessed duo made their red carpet debut as a couple while attending the For All Mankind TV show premiere at the Regency Village Theatre in Los Angeles.\n\nKelly stole the show at the event, wearing a daring backless burgundy gown that showed off a hint of sideboob.\n\nIt's getting serious! Victoria's Secret model Kelly Gale and new beau Joel Kinnaman made their red carpet debut as a couple while attending the For All Mankind TV show premiere at the Regency Village Theatre in Los Angeles on Tuesday\n\nShe accessorised the statement dress with bejwelled strappy stilettos and a matching cuff and drop earrings.\n\nMeanwhile, Suicide Squad star Joel looked dashing in a pale pink velvet jacket, a white shirt, black trousers and a matching black skinny tie.\n\nKelly debuted her relationship with Joel earlier this year after splitting from her long-term boyfriend, Johannes Jarl.\n\nRed hot: Kelly stole the show at the event, wearing a daring backless burgundy gown that showed off a hint of sideboob\n\nNew year, new man: Kelly debuted her relationship with Joel earlier this year after splitting from her long-term boyfriend, Johannes Jarl\n\nThe pair were spotted walking together and holding hands in the crowd at the Coachella Music Festival in California.\n\nKelly and her ex Johannes were last spotted together in January as they attended the Australian Open, but it's unclear exactly when they officially parted ways.\n\nJohannes has since unfollowed Kelly on Instagram, while she continues to follow his account.\n\nThe beauty had been dating her Swedish sweetheart since high school, with the two living together in New York City prior to their split.\n\nThe pair previously sparked breakup rumours in November last year, when Johannes was a no-show at the Victoria's Secret Fashion Show in New York City.\n\nMeanwhile, Joel and his ex-wife Cleo Wattenström reportedly split in late 2018 after two years of marriage.\n\nStrike a pose: The leggy brunette has graced the covers of multiple fashion magazines in addition to earning the title of Playboy Playmate of the month in September 2016\n\n'They were actually close friends before they even started dating,' an insider told US magazine in January.\n\n'So they've been able to stay really good friends even through the breakup. It's just made things much easier for both of them,' the insider added.\n\nKelly and Joel have more than their stunning good looks in common - they were both born in Sweden, with the model growing up in Gothenburg while her beau was raised in Stockholm.\n\nThe leggy brunette has graced the covers of multiple fashion magazines in addition to earning the title of Playboy Playmate of the month in September 2016.\n\nMeanwhile Joel, whose real name is Charles, is best known for playing the lead role in the Swedish film Easy Money and the Netflix science fiction series Altered Carbon.", "description": "It looks like things are getting serious between Victoria's Secret model Kelly Gale and her new beau, Swedish actor Joel Kinnaman.", "authors": ["Daily Mail Australia Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/05/19771366-0-image-a-14_1571198820483.jpg", "published_at": "2019-10-16"}