{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Wellness/congresswoman-nicknamed-period-lady-mission-give-women-access/story?id=66232513", "downloaded_at": "2019-10-18 08:51:56.500386+00:00", "title": "This Congresswoman nicknamed 'period lady' is on a mission to give all women access to period products", "language": "en", "text": "A New York congresswoman known as the \"period lady” for her work on ending period poverty has proven critical in enacting changes so that girls in schools and women in prisons and homeless shelters can have free access to pads and tampons.\n\nInterested in Congress? Add Congress as an interest to stay up to date on the latest Congress news, video, and analysis from ABC News. Add Interest\n\nRep. Grace Meng is still fighting for more, trying to create a world where menstruation is not stigmatized and period products are not seen as luxury items but necessities that should be accessible and, in many cases, free.\n\n“I think almost everyone can relate or remember a situation where you were in a public space and you got your period and you didn’t know what to do because either you didn’t have money or you or you weren’t near a drugstore,” Meng, a Democrat who represents Queens, New York, told “Good Morning America.” “These are not luxury products that we choose to use for ourselves and they should be just as available as toilet paper is and paper towels in a bathroom.”\n\nMeng’s activism on the issue all started with a letter from a high school girl who lived in her congressional district and wrote to her concerned that women in homeless shelters did not have access to tampons and pads.\n\nOffice of Congresswoman Grace Meng\n\n“When I first started studying up on this issue I sort of just assumed, OK, this affects people in underdeveloped countries and how can we help girls who have to skip school,” said Meng. “Then the more I learned about it, I realized that it’s happening to people right here in our country and right here in [New York City].”\n\n“I realized there really was a sort of injustice about how girls and boys are being treated, especially in the lens of menstrual equity and just the basic human right of being able to access these products that affect a majority of our population,” she said.\n\nWomen make up more than half of the population in the United States, according to the Census Bureau. They are also more likely than men to live in poverty, and they spend an average of 2,535 days in their lifetime, or almost seven years, on their periods, according to UNICEF.\n\nA survey released this year of low-income women in St. Louis, Missouri, found nearly two-thirds couldn’t afford menstrual hygiene products in the past year, and more than one in five said they had the same problem every month. The women said they instead had to use cloth, rags, tissues, toilet paper and sometimes diapers or paper towels, according to the report published in Obstetrics & Gynecology.\n\nIt is those stories that Meng said she hears too often and which motivate her to make menstruation equity a priority in Congress.\n\n\"In this great country, there should not be anyone who is not able to access these products for a human bodily function that they have no control over,\" she said. \"Access to these products should not depend on your income level or your status in life.\"\n\nFrom a high school student's letter to changing federal prisons\n\nMeng, a mother of two sons, learned after receiving the letter from her high-school-age constituent that federal grants provided to homeless shelters in New York City prohibited the shelters from purchasing and distributing menstrual products.\n\nShe wrote a letter to the Obama administration asking for help, and soon after the Federal Emergency Management Association (FEMA) announced it would allow homeless shelters to use federal grant money to buy the products.\n\nUp next, Meng took on the federal prison system after she heard stories of women in prison having to ration out their menstrual supplies with their cellmates or having to use limited funds in their commissary accounts to buy tampons and pads.\n\nMeng again wrote a letter to the Obama administration asking for menstrual products to be free in federal prisons, but it was close to the 2016 election and the end of President Obama's second term.\n\nWhen President Donald Trump was elected in 2016, Meng said she was \"concerned\" about the future of her request, but the Trump administration expressed its support.\n\nFree menstrual products for inmates at federal prisons was included in the bipartisan First Step Act that Trump signed into law last December.\n\n\"Obviously people in both parties menstruate and know people who get their periods,\" said Meng of the bipartisan support she sees on the issue. \"Quite frankly, I find that a lot of people just haven’t thought about this issue and once they hear and learn about this issue are willing to support and help alleviate these situations.\"\n\nMeng is now pressing governors to increase access to menstrual products in state and local prisons and questioning the Trump administration on their protocols for making sure female migrants at the border have access to menstrual products and showers.\n\nShe is also pushing to require that federal buildings, including the building where her office sits in the U.S. Capitol, have free supplies. It was only this year that House members became allowed to use their budget to purchase menstrual products for their offices.\n\nMeng's \"Menstrual Equity for All\" bill also proposes changes like requiring corporations of 100 employees or more to provide free menstrual products to employees. Her \"Menstrual Products Right to Know\" bill would make tampons and pads just like most other products where manufacturers are required to list out their ingredients.\n\nBoth of those bills are still pending in the House, while legislation she worked on in the last Congress that would allow people to use health savings accounts to buy menstrual products passed the House but was never taken up in the Senate.\n\nKevin Wolf/AP Images For Seventh Generation, FILE\n\n\"[One] big hurdle that we are still trying to overcome is that this, in most cases, is not a life or death issue,\" said Meng. \"So especially in this unpredictable political climate [it] might not necessarily be the first priority issue that is on the minds of people but we definitely want to make it a priority.\"\n\n'I don’t mind being called ‘the period lady’'\n\nPoor menstrual hygiene does pose health risks for women, including reproductive issues and urinary tract infections.\n\nThe taboo around menstruation and the lack of access to menstrual products also hurts women economically because it costs them money for products and may keep them from jobs and school, advocates say. It also sets women back mentally and in a society where something that happens to them naturally is demeaned or even not discussed.\n\n\"Most of us have been conditioned for all of our lives to not talk about menstruation,\" said Jennifer Weiss-Wolf, a lawyer and author of \"Periods Gone Public.\" \"And the things that keep us potentially from succeeding are often the things that happen to be what we don’t talk about in polite society.\"\n\n\"All the ways our bodies work just the way they’re supposed to we don’t talk about because we haven’t truly valued women and girls,\" said Weiss-Wolf, who took up the issue of menstrual equity after teen girls in her community posted on Facebook seeking tampon donations for a food pantry.\n\nWeiss-Wolf, also the co-founder of Period Equity, a law and policy organization fighting for menstrual equity, said the needle has moved in talking publicly about menstrual equity with celebrities including Sophia Bush, Gina Rodriguez and Meghan, the Duchess of Sussex, taking on the issue.\n\nA documentary short on menstruation even won an Oscar this year.\n\nWeiss-Wolf credits Meng with elevating the discussion in a \"really productive and responsible and meaningful way.\" The two have worked together on issues like eliminating the so-called \"tampon tax\" that still exists in more than 30 states in the U.S.\n\n\"Congresswoman Meng really does stand out,\" she said. \"She’s’ been extraordinarily creative in thinking about what federal levers can be pulled.\"\n\nMeng, who took office in 2013, said she doesn't mind being called the \"period lady\" by her colleagues or the public, saying, \"If it helps me be able to talk about the issue and educate people around me, then I don’t mind being called that.\"\n\nShe noted that growing up in a middle-class household, she never knew about the issues of period poverty or menstrual equity, but she did learn from a young age the stigma of having a period.\n\n\"I don’t want to, as I [did when I] grew up, feel like I have to hide my product up my sleeve as I’m walking through the halls of school or the office toward the bathroom,\" Meng said. \"This is a natural part of being a human being and I don’t want people to be ashamed of it.\"\n\n\"What’s been so inspiring is that anywhere I go, I will run into people, mostly women, who come up to me and these are women of all different ethnic backgrounds or come from different professions or are students or grandmothers,\" she said. \"They tell me how much they appreciate our work on this subject and a lot of them tell me they never thought about this issue before and how it impacts so many people in this country.\"", "description": "Rep. Grace Meng has scored victories in making period products a fundamental right.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/grace-meng-ap-jt-191012_hpMain_16x9_992.jpg", "published_at": "2019-10-18"}