{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/ap/article-7573791/Farrow-details-lack-enthusiasm-NBC-Weinstein-story.html", "downloaded_at": "2019-10-15 04:26:56.698690+00:00", "title": "Farrow details lack of enthusiasm at NBC for Weinstein...", "language": "en", "text": "NEW YORK (AP) - In reporter Ronan Farrow's account of his contentious divorce from NBC News, the more evidence he gathered on Hollywood mogul Harvey Weinstein's alleged sexual misconduct, the less enthusiastic his bosses seemed to be.\n\nNBC's decision to let Farrow take his work to the New Yorker magazine is widely regarded as one of the biggest mistakes in journalism in the past few years. The detailed stories on Weinstein published by The New York Times and New Yorker in 2017 shared a Pulitzer Prize and are credited with igniting the #MeToo movement.\n\n\"For six months, the only support I'd had was (NBC News President) Noah Oppenheim scrunching his nose and holding journalism at arm's length, afraid it might get on him,\" Farrow wrote.\n\nHis former employers call Farrow's book, \"Catch and Kill,\" a smear. It's being published Tuesday.\n\nNBC remains adamant that its hand was forced by Farrow's enthusiasm for a story that - at the time he was working there - didn't meet its standards.\n\n\"Farrow's effort to defame NBC News is clearly motivated not by a pursuit of truth, but an axe to grind,\" NBC News President Noah Oppenheim wrote in a detailed memo to NBC News staff on Monday. \"It is built on a series of distortions, confused timelines and outright inaccuracies.\"\n\nThis combination photo shows Pulitzer Prize-winning writer Ronan Farrow at the Vanity Fair Oscar Party in Beverly Hills, Calif. on Feb. 24, 2019, left, and NBC News President Noah Oppenheim at the 2016 AFI Festival \"Jackie\" Centerpiece Gala in Los Angeles on Nov. 14, 2016. Farrow's account of his contentious divorce from NBC News, the more evidence he gathered on Hollywood mogul Harvey Weinstein's sexual misconduct, the less enthusiastic his bosses seemed to be. NBC's decision to let Farrow take his work to the New Yorker magazine is widely regarded as one of the biggest mistakes in journalism the past few years. His former employers call Farrow's book, \"Catch and Kill,\" a smear. It's being published Tuesday. (AP Photo)\n\nTwo years later, the reasons why NBC let Farrow and his explosive reporting leave are murky. Farrow suggests fear of Weinstein, fear of having Matt Lauer's secrets exposed, journalistic timidity or simple misjudgment all may play a role. Farrow's former producer, Rich McHugh, wrote in Vanity Fair that NBC abdicated its responsibility to relentlessly pursue and tell the truth.\n\nOne thing they do agree on: it was Oppenheim's idea in the first place, when he pointed out a tweet by actress Rose McGowan about being abused by an unnamed figure in the movie business.\n\nFarrow, a former MSNBC host who segued into investigative journalism at NBC, scored an interview with McGowan, where she told her story but didn't name Weinstein on camera. Off-camera, she said it was him (Weinstein, who faces a sexual assault trial in New York in January regarding allegations not relating to McGowan, has denied any criminal wrongdoing). Farrow and McHugh pursued other sources and, they soon learned, so was the Times.\n\nYet he wrote about hurdles placed in his way that made him question NBC's desire to do the story.\n\nFarrow wrote of doubts by Oppenheim that Weinstein was a figure many viewers knew or even cared about. When he told a supervisor that the Times was also onto a story, that person said that sometimes it was better to let someone else go first. He and McHugh were told lawyers were worried about whether NBC could get in trouble for talking to victims who had signed non-disclosure agreements, and of a concern that Farrow might be accused of a conflict of interest because his estranged father, Woody Allen, was once in business with Weinstein.\n\nHe and his producer were told at least a dozen times to pause or stop reporting, he wrote.\n\nEventually, the reporting team said they kept working on the story despite a lack of enthusiasm from above, with McHugh quickly switching a side screen on his computer to hide what he was doing when a supervisor was near.\n\nNBC said Farrow mischaracterized conversations; that Oppenheim wondered not about the story's importance but about the news value of one element that had been reported on before - an audio tape from a woman fending off Weinstein. NBC wasn't satisfied coming in second but had noted if one victim came forward elsewhere it might open a floodgate of others who followed.\n\nAs the story moved along, NBC said it asked Farrow to prepare a script and assigned some of its top producers to vet the material.\n\nThe verdict was unanimous: Farrow needed more proof to sustain the claim that Weinstein was a sexual predator, Oppenheim said in an interview on Monday.\n\n\"He refused to accept that decision,\" Oppenheim said. \"He was frustrated by the standards we were upholding.\"\n\nThe book details aggressive efforts by Weinstein to stop the story through the use of lawyers, public relations experts and a shadowy security firm, along with multiple calls to NBC executives.\n\nAfter word got out that Farrow had left NBC, he reports that the mogul bragged to others that he got the network to \"kill\" the story. Weinstein even sent Oppenheim a bottle of expensive vodka (which NBC said he gave away because he doesn't drink).\n\nWeinstein played no role in NBC's decision to hold off on what Farrow had reported, Oppenheim said.\n\nA more sinister theory for NBC's inaction revolved around Matt Lauer, the \"Today\" show host who was fired in November 2017 for \"inappropriate sexual contact\" with a fellow employee. That colleague told Farrow that Lauer raped her in a Sochi hotel room in 2014; Lauer described the sex as consensual.\n\nFarrow wrote that Weinstein \"had made it known to the network that he was aware of Lauer's behavior and was capable of revealing it.\" At the time, Lauer was NBC News' highest-paid news employee, a fixture on the morning show.\n\nBut NBC denies Farrow's claim that its executives were aware, or should have been aware, that Lauer had a sexual misconduct problem.\n\nOnly one person from NBC's hierarchy approached him after the New Yorker piece ran to express regrets about what had happened, Farrow wrote. It was Brian Roberts, chairman of NBC's parent company Comcast.\n\nThe bad blood between Farrow and NBC News has led to a laundry list of he said-he said claims. They don't even agree on whose idea it was to take the reporting elsewhere.\n\nThat is, ultimately, the decision that most befuddled people who weren't directly involved. If the story wasn't ready, why didn't NBC just let Farrow and McHugh keep working on it?\n\nOppenheim said NBC agreed to let him leave because their working relationship had irretrievably broken down.\n\nFarrow \"has refused to even consider the possibility that (NBC employees) were all acting with integrity and good faith and has instead chosen to pursue this conspiracy theory that is completely unfounded,\" he said.", "description": "NEW YORK (AP) - In reporter Ronan Farrow's account of his contentious divorce from NBC News, the more evidence he gathered on Hollywood mogul Harvey...", "authors": ["Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/05/wire-19722330-1571112767-586_636x382.jpg", "published_at": "2019-10-15"}