{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7575231/Priyanka-Chopra-turns-heads-lilac-peach-dress-Nick-Jonas-step-out.html", "downloaded_at": "2019-10-15 15:10:33.504497+00:00", "title": "Priyanka Chopra turns heads in a lilac and peach dress as she and Nick Jonas step out", "language": "en", "text": "They will soon celebrate their first wedding anniversary after tying the knot in traditional Hindu and Christian ceremonies in India in December 2018.\n\nAnd Priyanka Chopra and Nick Jonas still looked very much in the honeymoon period as they held hands while leaving a private event at the San Vicente Bungalows in West Hollywood on Monday evening.\n\nThe actress, 37, and the singer, 27, appeared gleeful as they shared a joke while departing the venue, with Priyanka grinning from ear-to-ear as her husband led her out to a waiting car.\n\nSo in love: Priyanka Chopra and Nick Jonas looked in the honeymoon period as they left an event at the San Vicente Bungalows in West Hollywood holding hands on Monday evening\n\nThe Quantico star turned heads in a striking lilac and peach silk wrap dress, featuring puff sleeves and silver embellishment detailing.\n\nPriyanka added height to her frame with a pair of gunmetal grey strappy stiletto sandals.\n\nThe former Miss World wore her raven locks in loose waves and injected a pop of colour with a slick of deep berry lipstick.\n\nJonas Brothers hitmaker Nick kept his look low-key, choosing a casual black jacket, jeans and a white T-shirt for the couple's evening out.\n\nStriking: The actress, 37, turned heads in a lilac and peach silk wrap dress, featuring puff sleeves and silver embellishment detailing as the singer, 27, guided her to a waiting car\n\nPriyanka was no doubt enjoying some down-time after a busy few weeks of promoting her new movie, The Sky is Pink, which follows the span of a 25-year love story told by a couple's terminally ill teenage daughter.\n\nThe actress stars as Aditi, a mother who is forced to grapple with her newborn's immune deficiency.\n\nDuring the film's promotional trail earlier this month, Priyanka said she and Nick 'really can't wait' to start a family together.\n\nSpeaking during an interview on the Today show, she said of parenthood: 'I can't wait. I really can't wait.\n\nHoneymoon period: The couple will soon celebrate their first wedding anniversary after tying the knot in India in December 2018 (pictured together in Las Vegas last week)\n\n'I mean, there's so much that happens in our lives. Whenever God blesses us with that... it's something that we both definitely want.'\n\nPriyanka and Nick first sparked dating rumours when they attended the prestigious Met Gala together in May 2017, but didn't go public until a year later in the following May.\n\nThe couple announced their engagement in July 2018 when Nick proposed during a trip to Crete with a dazzling Tiffany & Co ring while celebrating Priyanka's 36th birthday.\n\nPriyanka and Nick tied the knot with in a traditional Hindu ceremony at the Umaid Bhawan Palace in Jodhpur, India, in December 2018, followed by a Christian celebration taking place the next day.", "description": "The actress, 37, and the singer, 27, looked in the honeymoon period as they left a private event at the San Vicente Bungalows in West Hollywood holding hands on Monday evening.", "authors": ["Louise Saunders For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/13/19740424-0-image-a-13_1571144191734.jpg", "published_at": "2019-10-15"}