{"pub": "mirror", "url": "https://mirror.co.uk/news/weird-news/mum-spots-rude-pattern-97-20652777", "downloaded_at": "2019-10-19 12:30:20.821175+00:00", "title": "Mum spots rather rude pattern on £97 watch - but not everyone can see it", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nWhen it comes to buying a new watch, what do you look for?\n\nDo you want a leather or a metal strap? A large face or a small one?\n\nThese are the typical things people consider before making their purchase - but have you ever thought about wearing a watch with a rather rude looking pattern on it?\n\nOne woman claims her daughter was recently browsing the Swatch website when she came across just that.\n\nHer mum was so surprised by the bizarre artwork on the £97 timepiece that she shared it with fellow parents on Mumsnet.\n\nIn a post on the site, the unnamed woman asked users whether they would wear the watch and the responses were mixed.\n\nMany, unsurprisingly, were taken aback by the colourful pattern - which features pink and yellow drawings of bums, boobs as well as male and female genitalia.\n\nOne person outright said \"no\", while another exclaimed: \"What the actual f***?\"\n\nA third replied: \"That’s the most bizarre thing I’ve ever seen.\"\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nSomeone else added: \"Who designed this and thought ‘great, lovely design these will fly off the shelves’. These will end up in the January sale.\"\n\nHowever not everyone could see the cheeky pattern - with some mistaking it for lines and swirls.\n\nA confused mum asked: \"What am I missing? Can just see swirls and lines!\"\n\nA second wrote: \"I must be getting old as it just looked like a dotty pattern until I looked closer.\"\n\n\"I thought it was liquorice allsorts until I zoomed in,\" admitted another.\n\nOthers who could see the design clearly confessed they weren't \"offended\" by it at all and one even said they'd consider buying one for themselves.\n\nThey said: \"Yes. I would wear it. I think its fab.\"\n\nWould you wear the watch? Let us know in the comments below.", "description": "While shopping for a new watch online one mum couldn't help but notice a Swatch strap had a very rude design", "authors": ["Courtney Pochin", "Image", "Swatch"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20653254.ece/ALTERNATES/s1200/2_Mum-notices-very-rude-pattern-on-watch-but-not-everyone-can-see-it.jpg", "published_at": "2019-10-19"}