{"pub": "thehill", "url": "https://thehill.com/policy/international/asia-pacific/467652-police-fire-tear-gas-water-cannon-to-break-up-protests-in", "downloaded_at": "2019-10-28 00:25:27.885455+00:00", "title": "Police fire tear gas, water cannon to break up protests in Hong Kong's tourist district", "language": "en", "text": "Hong Kong Police fired tear gas, water cannon and rubber bullets to break up protests in Hong Kong’s tourist district, prompting the protesters to set shops on fire and throw petrol bombs at police.\n\nProtesters in all black and face masks took to the streets once again Sunday to protest police brutality, despite the recent ban in the country against the masks, Reuters reported. Police reported one man was beaten by “masked rioters.”\n\nADVERTISEMENT\n\n“The police warn all rioters to stop all illegal acts immediately,” police said in a statement.\n\nA standoff between protesters and police took place at dusk Sunday, as demonstrators took over the street after police moved away. Officers returned with a water cannon, according to Reuters.\n\nPolice also reported that protesters threw petrol bombs at a police station in Sham Shui Po and set fire to shops in Jordan. Reuters reported two MTR rail entrances were on fire.\n\nThe number of protesters on the scene increased throughout the afternoon, but once police used tear gas and pepper spray, many left the demonstrations, the news wire reported.\n\nProtesters in Hong Kong initially took to the street in June to demonstrate against a now-discarded measure that would allow Hong Kong citizens to be extradited to China for trial. Since then, the protests have escalated demonstrators and have demanded the government address all five of their demands.\n\nProtesters on Sunday also expressed their support for Muslims after police shot a mosque with a water cannon last week, while seeking protesters. Hong Kong Chief Executive Carrie Lam apologized for the incident.", "description": "Hong Kong Police fired tear gas, water cannon and rubber bullets to break up protests in Hong Kong’s tourist district, prompting the protesters to set shops on fire and throw petrol bombs at police.", "authors": [], "top_image": "https://thehill.com/sites/default/files/hongkong_police_10212019_1.jpg", "published_at": "2019-10-27"}