{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/8/cesar-diaz-rodriguez-illegal-immigrant-who-threate", "downloaded_at": "2019-10-09 00:23:40.178116+00:00", "title": "Feds nab illegal immigrant who threatened to shoot ICE officers", "language": "en", "text": "ICE said Tuesday it arrested an illegal immigrant who’d been making threats about trying to shoot deportation officers after repeatedly sneaking into — and being kicked out of — the U.S.\n\nCesar Diaz-Rodriguez, 30, was snared in Houston on charges of illegal reentry.\n\nHe was deported two years ago, and had been “voluntarily returned” to Mexico three times before — twice in the same month in 2004, and again in 2011, according to U.S. Immigration and Customs Enforcement.\n\nICE said this time it had gotten “several anonymous tips” saying Mr. Diaz-Rodriguez had made threats to shoot ICE officers. The tips helped lead them to the migrant.\n\n“This individual brazenly ignored U.S. immigration law, while simultaneously threatening the lives of the brave men and women sworn to uphold it,” said Patrick Contreras, field office director for ICE in Houston.\n\nHe called the threats “cowardly.”\n\nICE has become a focal point for criticism in recent years — but some have gone further and targeted the agency and its personnel for violence. An ICE office in Portland, Oregon, was shut down for several weeks last year because of violent protests, and an anti-ICE activist parroting Democrats’ criticism of the agency was killed during an attack on an ICE facility in Tacoma, Washington, earlier this year.\n\nThe agency’s office in San Antonio was also attacked by a gunman who fired rounds into the building, doing property damage.\n\nICE officials say their mission has been distorted by opponents and that’s fueling unearned anger.\n\nMr. Diaz-Rodriguez’s five times sneaking into the U.S. are striking, but are far from the record.\n\nThe Washington Times reported last year on an illegal immigrant who’d been deported 44 times in 15 years.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "ICE said Tuesday it arrested an illegal immigrant who'd been making threats about trying to shoot deportation officers after repeatedly sneaking into -- and being kicked out of -- the U.S. Cesar Diaz-Rodriguez, 30, was snared in Houston on charges of illegal reentry.", "authors": ["The Washington Times Http", "Stephen Dinan"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/08/AP_060613046030_c0-206-3640-2328_s1770x1032.jpg?e95fdad2a85074aadfa9581334e70c45de51240f", "published_at": "2019-10-08"}