{"pub": "businessinsider", "url": "https://pedestrian.tv/news/cardi-b-sexual-harassment", "downloaded_at": "2019-09-26 01:35:37.103591+00:00", "title": "Cardi B Drags Grub Photographer Who Allegedly Exposed Himself During A Magazine Shoot", "language": "en", "text": "CONTENT WARNING: This article discusses sexual misconduct.\n\nWhat we love about Cardi B is that she says exactly what’s on her mind, and in an interview set to air this week the rapper is coming forward with her harrowing experience of being sexually harassed on the set of a magazine photo shoot.\n\nIn a clip posted to Daily Mail for the upcoming interview with Angie Martinez for the WE TV show Untold Stories of Hip Hop, Cardi claims that she was targeted by a photographer during a shoot for an unnamed publication.\n\nI will never forget how I went to shoot for this magazine and like the photographer, he was trying to get close to me. Like, ‘Yeah, you want to get into this magazine?’ And he pulled his dick out. I was so fucking mad.\n\nWhile the short clip doesn’t reveal the photographer’s name or the magazine in question, or even when the alleged incident took place, Cardi B does tell Martinez that there were zero repercussions afterwards, even though she spoke up about it.\n\nYou know what’s so crazy? I told the magazine owner and he just looked at me like, So? And?’ When I see the #MeToo movement, there’s girls from the ‘hood, I know they went through the same type of treatment. … It happens really every day.\n\nWhen interviewer Martinez asks if she’s run into similar behaviour since, Cardi B replies with “Oh hell no. I’ll put you on blast on my Instagram.”\n\nHelp is available. If you require immediate assistance, please call 000. If you’d like to speak to someone about sexual violence, please call the 1800 Respect hotline on 1800 737 732 or chat online. Under 25? You can reach Kids Helpline at 1800 55 1800 or chat online.", "description": "Cardi B has come forward with a horrific story of being sexually harassed by a photogrpaher while shooting for a magazine.", "authors": ["Josephine Rozenberg-Clarke"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/09/cardi-site.jpg", "published_at": "2019-09-26"}