{"pub": "telegraph", "url": "https://telegraph.co.uk/football/2019/10/05/liverpool-vs-leicester-city-premier-league-2019-20-live-score", "downloaded_at": "2019-10-05 13:52:33.781844+00:00", "title": "Liverpool vs Leicester City, Premier League 2019-20: live score and latest updates", "language": "en", "text": "Is this the biggest test Liverpool have faced this season? Certainly the bookmakers are assessing Leicester City as a genuine top six team, making them the same price as Arsenal when they visited Anfield in August.\n\nIts also Brendan Rodgers back at Liverpool, and he returns a wiser, more self-aware and generally well-respected manager who is building a very solid and balanced side.\n\nLeicester are buoyant after vanquishing Spurs and hammering Newcastle 5-0, but perhaps their attack is not as potent as many assume. They sit 15th in the division for shots on target and eight for Expected Goals mustered so the doubt over them today is whether they can sufficiently trouble Liverpool's defence.\n\nJurgen Klopp's team might just be a touch more circumspect after conceding three at home to Red Bull Salzburg, although first-choice centre-back Joel Matip is out through injury. Joe Gomez has looked suspect so far this season, relying too much on his athleticism at the expense of a sound starting position which might be something Jamie Vardy looks to prey on.\n\nLeicester do look a sounder defensive unit than Arsenal, Chelsea and Spurs currently with a back four of Ricardo Perreira, Jonny Evans, Çağlar Söyüncü and Ben Chilwell well protected by Wilfred Ndidi. Liverpool's effervescent front three will stretch them though.\n\nSpeaking of Rodgers' return, Klopp said: \"I hope the fans will be OK with [Rodgers].\n\n\"It is brilliant living there [in Rodgers' house]. I am not sure he has to work. He is doing really well. I am not surprised about that. An incredible job at Celtic, rebuilding at Leicester. Good signings and brilliant team.\"\n\nRodgers added: \"I am the type of person who is happy for the club and especially happy for players like Jordan [Henderson] and James Milner - players I worked with and had a strong relationship with.\n\n\"I was so happy for Jordan when he lifted the Champions League trophy because I know how much he has developed and worked for it.\"\n\nTeam news on the way shortly.", "description": "\"If one day the club has to make a decision that would not say anything about me at that moment.", "authors": ["Daniel Zeqiri", "Paul Hayward"], "top_image": "https://www.telegraph.co.uk/content/dam/football/2019/10/05/TELEMMGLPICT000212068057-xlarge_trans_NvBQzQNjv4BqytxLMmtfp3sC_cEhhtHl3-Sq2vOoHVhVh4Ty00DIiZk.jpeg?imwidth=1200", "published_at": "2019-10-05"}