{"pub": "foxnews", "url": "https://foxnews.com/media/california-bill-ncaa-paid-athletes-ben-watson", "downloaded_at": "2019-10-01 04:30:33.310528+00:00", "title": "Patriots' Benjamin Watson applauds California bill allowing college athletes to earn money", "language": "en", "text": "New England Patriots tight end Benjamin Watson applauded California Gov. Gavin Newsom for signing a bill allowing college athletes to earn money from endorsements and to hire agents.\n\nWatson told Martha MacCallum Monday on \"The Story\" the new law is a \"step in the right direction,\" pointing to the fact the players are adults and that coaches' salaries can sometimes rival those of the NFL.\n\n\"I agree with the governor,\" he said. \"I believe this is a step in the right direction.\"\n\nWatson, a Super Bowl champion in his second stint with New England, said the NCAA is a billion-dollar business and the athletes involved with it should be able to profit off their skills and success.\n\nCALIFORNIA GOVERNOR SIGNS BILL ALLOWING COLLEGE ATHLETES TO CAPITALIZE ON IMAGE, NAME AND LIKENESS\n\n\"College athletes play sports at a high level. They are adults,\" he said.\n\n\"And, as an adult, they should be afforded the rights any other adult has, which is to profit off of their notoriety -- profit off their ability, whether that be signing autographs or [through] jersey sales.\"\n\nHe said California's law should be a model for other states to follow suit, adding the NCAA itself will benefit from athletes who are able to be paid for endorsements and the like.\n\nHowever, California's bill defies NCAA bylaws and likely sets up a legal challenge that could reshape amateur sports in the U.S. The law also bans schools from kicking athletes off the team if they get paid.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nThe law, which is set to take effect on Jan. 1, 2023, does not apply to community college and bans athletes from accepting endorsement deals that conflict with their schools’ existing contracts.\n\nNCAA President Mark Emmert has spoken out against the bill. He reportedly told athletic directors last week that giving student-athletes the right to capitalize on their name, image and likeness poses an “existential threat” to athletics and the governing body’s business model.\n\nFox News' Ryan Gaydos contributed to this report.", "description": "New England Patriots tight end Benjamin Watson applauded California Gov. Gavin Newsom, a Democrat, for passing a law allowing college athletes to earn money from endorsements and to hire agents.", "authors": ["Charles Creitz"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Newson-McCallum-Watson.jpg", "published_at": "2019-10-01"}