{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/nfl/i-dont-know-what-antonio-brown-did-but-hes-already-damned-by-misogynist-language/2019/09/11/3f42c4e8-d4c0-11e9-9343-40db57cf6abd_story.html", "downloaded_at": "2019-09-12 07:09:27.630096+00:00", "title": "Antonio Brown is already damned by his misogynistic texts", "language": "en", "text": "Columnist\n\nSkank whore here, checking in. Dumb ass bitch, reporting for work. After climbing through the thicket of social media insults that regularly starts the day of a woman in a sportsman’s business, I sat down to read Antonio Brown’s alleged text messages to a young woman who is accusing him of rape. It’s of course impossible to tell from the lawsuit, filed the day after he signed with the New England Patriots, whether he’s guilty of that crime. But if those texts are his, he most assuredly is guilty of using language that countenances it, and now he’s in the position of trying to explain that it was just words.\n\nYou want to be thought of as a good man falsely accused? Then don’t talk like a crude, rapacious brute. Find a different expression. Search out an articulacy, something other than the tongue-tied dead-end vulgar cough that is the word “bitch.” She’s a “lien bitch thought it was easy to get a come up.” She’s a “weak bitch” and a “fake hoe.” She and her mother, too, are “dum ass hoes.” This isn’t innocent language. To employ the phrase of Toni Morrison, it’s “mutant language designed to throttle women.”\n\nYou want the benefit of the doubt? Try talking less like a cut from “A Bitch Iz A Bitch,” and more like New England Patriots tight end Benjamin Watson, who just reduced Laura Ingraham to stammering in a television debate with well-stated facts. Every time I hear Watson speak or read one of his excellent blogs, I feel an overwhelming relief that reminds me of what Morrison wrote in her eulogy of James Baldwin: “In your hands language was handsome again.”\n\n[NFL mulls whether to make Brown ineligible to play]\n\nOn Tuesday, I congratulated Brown for having the smarts and self-control and self-determination to get himself to the Patriots, as opposed to letting himself be powerlessly trapped on a bad team. Today, after reading the messages included in the lawsuit filed by his accuser, I feel compelled to state that I don’t know who Brown really is. I can only hope he’s innocent. But what I do know is that I’m sick of athletes (and their worshipers) who apparently never learned a primary language beyond misogyny, a language that treats women as punchable sex dolls, and excuses violence because the hoe had it coming.\n\nI don’t know the first thing about Britney Taylor, either, whether she’s a victim or an ex looking for a settlement — Brown’s lawyer says the relationship was consensual and she wanted the player to invest $1.6 million in a business project. What I do know is that language matters. As Rebecca Solnit has written, “When you turn ‘torture’ into ‘enhanced interrogation’ . . . you break the power of language to convert meaning, to make us see, feel, and care.’” A fifth of all the “bitches” in America are raped. Feel that. Approximately 1,500 “bitches” a year are killed by male partners, and studies show that prostitution, or “hoeing” in his parlance, is the riskiest occupation in the United States when it comes to violence. Feel it.\n\n[Jerry Brewer: It’s Antonio Brown’s NFL and we’re just living in it]\n\nFor decades now I’ve written about pro athletes with an interest and respect that borders on reverence, and always wanted to err sympathetically on their side — for their ability to turn themselves over so completely to a craft, and yet their susceptibility to being used. For their exquisite physical precision and ephemeral beauty, and yet their propensity to get burned up by others. But I’ve never reconciled myself to the clumsy, casual “all my bitches” way so many of them talk, and the implacable coldness of their refusal to acknowledge the pervasive, contagious damage they do with it.\n\nLanguage is a projection of personal quality. The language of “bitches” and “hoes” that so many great athletes use is exactly what it appears to be — a menacing unfeelingness, a limitedness of expression that bespeaks something insensate, a hardheartedness and determination to subjugate. This kind of language, Morrison said in her epic Nobel Prize lecture, “is ruthless in its policing duties, it has no desire or purpose other than maintaining the free range of its own narcotic narcissism, its own exclusivity and dominance.” It is a profound failure that bespeaks nothing but thwartedness, thoughtlessness, an incapability to form even a sentence. It entraps everybody and prevents any kind of progress or understanding, and it’s as imprisoning for the speaker as much as the target.\n\nI’ll leave it for Morrison, a far superior and more expressive writer, to finish off the thought. “Unreceptive to interrogation, it cannot form or tolerate new ideas, shape other thoughts, tell another story, fill baffling silences.” This dead-end language, she compares to a medieval “suit of armor polished to shocking glitter.” It is “a husk from which the knight departed long ago,” she writes. “Yet there it is: dumb, predatory, sentimental.”", "description": "Too many athletes routinely use crude, violent language about women without acknowledging the pervasive, contagious damage it does", "authors": ["Sally Jenkins", "Sports Columnist", "September At Pm", "Sally Jenkins Is A Sports Columnist For The Washington Post. She Began Her Second Stint At The Washington Post In After Spending The Previous Decade Working As A Book Author", "As A Magazine Writer."], "top_image": "https://www.washingtonpost.com/resizer/w6wZs5yVu5AwC84ghlVPzNwv1ZU=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/H6RL3JGUYQI6TE2DIDNVPT3KXU.jpg", "published_at": "2019-09-11"}