{"pub": "reuters", "url": "https://reuters.com/article/us-usa-trade-japan/trump-says-u-s-reaches-trade-deal-with-japan-idUSKBN1W12TS", "downloaded_at": "2019-09-16 23:24:11.823714+00:00", "title": "Trump says U.S. reaches trade deals with Japan, no vote needed", "language": "en", "text": "WASHINGTON (Reuters) - U.S. President Donald Trump said on Monday that the United States has reached initial trade agreements with Japan on tariff barriers and digital trade that will not require congressional approval.\n\nU.S. President Donald Trump walks to address the media before boarding Marine One for a trip to New Mexico, on the South Lawn of the White House in Washington, U.S., September 16, 2019. REUTERS/Sarah Silbiger.\n\nIn a letter to Congress released by the White House, Trump said that he intends to enter into the agreements “in the coming weeks” and was notifying lawmakers that the tariff deal would be made under a trade law provision allowing the U.S. president to make reciprocal tariff reductions by proclamation.\n\n“In addition, I also will be entering into an Executive Agreement with Japan regarding digital trade,” Trump said in the letter.\n\nNeither agreement would require a vote in Congress under the so-called “fast track” approval process. The Trump administration last year notified Congress that it would pursue negotiations with Japan under this method.\n\nBut over much of the past year, the scope of talks have narrowed to exclude the automotive sector, which is the source of most of the $67 billion U.S. trade deficit with Japan.\n\nInstead, Trump and Japanese Prime Minister Shinzo in August announced an agreement in principle of a deal that covered reductions in tariffs on agricultural and industrial goods, but not autos.\n\nThe two leaders said at the G7 summit in France that they hoped to sign the agreement at next week’s United Nations General Assembly in New York.\n\nTrump’s letter did not disclose any contents of the agreements, but Japan had previously said it was willing to consider a deal that would reduce agriculture tariffs to levels previously contemplated under the Trans-Pacific Partnership, a trade deal that Trump quit on his third day in office in 2017.\n\nTrump’s letter said that the United States would pursue further trade negotiations with Japan.\n\n“My Administration looks forward to continued collaboration with the Congress on further negotiations with Japan to achieve a comprehensive trade agreement that results in more fair and reciprocal trade between the United States and Japan,” Trump said.", "description": "U.S. President Donald Trump said on Monday that the United States has reached initial trade agreements with Japan on tariff barriers and digital trade that will not require congressional approval.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190916&t=2&i=1430617069&w=1200&r=LYNXMPEF8F1RO", "published_at": "2019-09-16"}