{"pub": "dailybeast", "url": "https://thedailybeast.com/amber-guyger-ex-dallas-police-officer-sentenced-to-10-years-for-killing-botham-jean", "downloaded_at": "2019-10-03 07:15:48.894844+00:00", "published_at": "2019-10-02", "title": "Ex-Cop Amber Guyger Sentenced to 10 Years in Prison for Murdering Botham Jean", "language": "en", "text": "Amber Guyger, a white former Dallas police officer convicted of murdering her black neighbor after confusing his apartment for her own, was sentenced to 10 years in prison on Wednesday.\n\nThe 31-year-old was found guilty of murder Tuesday morning and faced a maximum sentence of 99 years in prison for fatally shooting 26-year-old Botham Jean in his apartment on Sept. 6, 2018. His death garnered national attention and sparked a wave of protests against racial bias and police use of excessive force.\n\nThe case came to a close with an emotional two-day sentencing hearing that included testimony from both the Guyger and Jean families. The jury deliberated for less than 90 minutes before determining Guyger’s sentence, which begins immediately. She’ll be eligible for parole in five years.\n\nJean’s little brother, Brandt, gave a gut-wrenching victim statement after the sentencing, telling Guyger he forgives her and “wants the best” for her. He then got Judge Tammy Kemp’s permission to give her a hug.\n\n“I don’t even want you to go to jail. I want the best for you, because I know that’s exactly what Botham would want,” the 18-year-old said in court.\n\nAt one point, Kemp also gave hugs to Jean’s relatives and Guyger—offering both parties words of encouragement.\n\nDozens of people expressed outrage over the sentence outside of the courtroom, with some shouting “justice was not served.”\n\n“Why give her a murder conviction and then only give her 10 years? That’s a slap in the face,” one protester said.\n\nDuring the hearing, the former cop’s mother, Karen Guyger, stunned the courtroom when she told the jury her daughter had been sexually assaulted when she was six, reiterating the defense’s argument that Guyger had experienced adversity as a child that prompted her to become a police officer.\n\n“She wanted to take his place. She always would tell me she wishes she could’ve taken his place. She feels very bad about it,” she said through tears while holding a crumpled tissue.\n\nThe Jean family reportedly arrived at court early on Wednesday, bringing two small bottles of sparkling cider and a crate full of snacks, including water bottles with Jean’s face printed on them alongside the words, “Jesus Loves You. Celebrating the Life of Botham Jean.”\n\nThe hearing opened Tuesday with a tearful testimony from Jean’s mother, Allison, who raised her hands in elation when the verdict was read.\n\n“My life has not been the same. It’s just been like a roller coaster,” Allison Jean said while wearing her middle son’s favorite color, red. “I cannot sleep. I cannot eat. It’s just been the most terrible time for me.”\n\nJean, an accountant at PricewaterhouseCoopers, was sitting on his couch eating vanilla ice cream around 10 p.m. when the five-year police veteran entered his apartment, believing it was her own. Guyger took the stand in her own defense on Friday, claiming she truly believed someone was inside her home when she arrived after a 13-hour shift.\n\nShe testified that she believed she was acting out of self-defense when she shot at him twice.\n\n“I thought that he was coming at me. I was scared he was gonna kill me,” she said, admitting she was shooting to kill when she pulled the trigger. Her lawyers called the incident a tragic misunderstanding after the “exhausted” off-duty cop’s long shift.\n\nBut prosecutors said it was “unreasonable” for Guyger to confuse his unit with her own, and grilled her for calling 911 instead of giving Jean proper medical aid, prosecutors alleged.\n\n“How could that happen to our son, how could we lose Botham? Such a sweet boy,” Botham’s father, Bertram Jean, told the jury on Wednesday through tears. “He tried his best to live a good, honest life. I’ll never see him again and I still want to see him.”\n\nDallas County prosecutors argued throughout the week-long trial Guyger was “distracted” by her affair with her married partner and missed all the signs that should’ve led her to realize she wasn’t in her own apartment. Guyger also testified she texted her married police partner right after the fatal shooting: “Hurry, I need you. I fucked up.”\n\nAllisa Findley, Jean’s sister, told jurors Tuesday her brother’s death has had a ripple effect on their entire family, causing her once “bubbly” younger brother to live in fear of the police and become a “shell of himself.”\n\n“I want my brother back,” she said of Botham. After the sentencing was read, Findley held her head in her hands crying while family members tried to console her.\n\nIn addition to victim testimony, prosecutors showed jurors Guyger’s text messages, saying they show her lack of sensitivity toward black people. In one January 2018 exchange while the former cop was working security during the Dallas Martin Luther King Jr. Day Parade, she groaned the event could take up to three hours and suggested pepper spraying participants to get them to leave.\n\nJurors were also shown texts between Guyger and her married partner, Officer Martin Rivera.\n\n“Damn I was at this area with 5 different black officers !!! Not racist but damn,” Rivera texted Guyger in March 2018, to which she quickly responded: “Not racist but just have a different way of working and it shows.”", "description": "Amber Guyger was convicted Tuesday of murdering her black neighbor, Botham Jean, after mistaking his Dallas apartment for her own.", "authors": ["Pilar Melendez"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1570032957/amber_guyger_zi1csy"}