{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7591467/Almost-Paul-Pogba-reveals-return-soon-despite-Liverpool-injury-blow.html", "downloaded_at": "2019-10-19 17:05:33.980793+00:00", "title": "'Almost there': Paul Pogba reveals he will return soon despite Liverpool injury blow", "language": "en", "text": "Paul Pogba has dropped a massive hint that he will be back in action soon despite the disappointment of him missing out on Manchester United's game with Liverpool.\n\nOle Gunnar Solskjaer confirmed that Pogba would miss out on United's game with their rivals as he failed to recover in time from a foot injury.\n\nThe 26-year-old who missed out on the Red Devil's last two games because of the injury, has taken to social media however to try and prove to supporters that he is doing everything he can to get back into action as soon as possible.\n\nPogba took to Instagram working hard with a medicine ball with the message 'almost there'.\n\nPaul Pogba posted to his Instagram page saying that he is 'almost there' following his injury\n\nIt is not the first time the French midfielder has taken to social media since his injury.\n\nHe has recently been posting videos of himself on Instagram to show his training abroad as he looks to get back to full fitness.\n\nIt will be music to the ears of Manchester United fans who have seen their team's drop in form recently.\n\nPaul Pogba has missed Manchester United's last two games because of a foot injury\n\nThey will hope that Pogba can get back to top form as soon as possible and bring in some creativity that has been lacking in midfield.\n\nAfter the Liverpool game, Manchester United's Europa League campaign continues with a clash against Partizan Belgrade.\n\nSolskjaer will surely be hoping though that Pogba will be back fit and ready for next weekend's visit to Carrow Road to face Norwich City.", "description": "Paul Pogba has posted on his Instagram account that he is 'almost there' as he looks to recover from a foot injury. The French midfielder has been ruled out of Manchester United's game with Liverpool.", "authors": ["Kieran Lynch For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/16/19929250-0-image-a-32_1571499311146.jpg", "published_at": "2019-10-19"}