{"pub": "yahoo", "url": "https://news.yahoo.com/philippine-police-recommends-drug-charges-against-ex-chief-001221049.html", "downloaded_at": "2019-10-21 15:06:04.198614+00:00", "title": "Philippine police recommend drug charges against ex-chief", "language": "en", "text": "Former Philippine police chief Oscar Albayalde (L) could face charges of graft and violating the nation's anti-drug laws (AFP Photo/Ted ALJIBE)\n\nPhilippine police recommended graft and drug charges against its former chief on Monday over a new scandal that has put President Rodrigo Duterte's anti-narcotics crackdown under the spotlight.\n\nThe police face allegations some officers are involved in the illegal drugs trade and that they had the protection of former chief Oscar Albayalde.\n\nIt is the latest controversy to engulf the Philippine police force, which is waging a drug war launched by President Duterte in 2016. It says it has killed over 5,500 drug suspects but human rights groups say the real number is four times higher.\n\nAllegations of police graft and abuse are not rare in the Philippines, with Duterte twice ordering police to stop its anti-narcotics campaign because of allegations of corruption and murder by officers.\n\nThe latest controversy however goes right to the top of the force.\n\nThe police's own investigation unit called on the justice department to charge General Albayalde and 13 others for graft and violating the nation's anti-drugs laws.\n\nThe charges echo the recommendations made by two Senate committees, which also investigated police involvement in the illegal drug trade and found Albayalde was implicated.\n\nThe police complaint stemmed from Albayalde's role as commander of police unit near Manila in 2013 where officers under his supervision allegedly seized and sold a huge haul of narcotics and received bribes to release a drug suspect.\n\nHe was accused by a former police official of intervening to protect his officers from sanctions. Another retired official alleged Albayalde received money from the drug sale.\n\nAlbayalde resigned last week ahead of his November 8 retirement after serving as police chief for more than a year. He has yet to issue a statement but has repeatedly denied allegations of wrongdoing.\n\nState prosecutors will now decide whether to file criminal charges or dismiss them outright.\n\nThis comes as the national police announced Monday it has dismissed three Philippine National Police (PNP) officers involved in another controversial drug raid this year.\n\n\"We admit that the recent controversy involving the PNP has shaken the institution at its core,\" acting police chief Archie Gamboa said in a statement.\n\nHe announced changes to key leadership positions and put promotions on hold.\n\n\"Each one will strictly be held accountable for what his or her unit does or fails to do,\" he said.", "description": "Philippine police recommended graft and drug charges against its former chief on Monday over a new scandal that has put President Rodrigo Duterte's anti-narcotics crackdown under the spotlight.  The police face allegations some officers are involved in the illegal drugs trade and that they had the", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/flb5gMAuGqsFgd8GcvxQfg--~B/aD01NTA7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/ffab0bc8dc1c0c69d0b5c5ac3d8fbae368691e2d.jpg", "published_at": "2019-10-21"}