{"pub": "breitbart", "url": "https://breitbart.com/news/bugging-out-uk-museum-names-blind-beetle-after-greta-thunberg-2", "downloaded_at": "2019-10-27 04:03:25.808923+00:00", "title": "Bugging out: UK museum names blind beetle after Greta Thunberg", "language": "en", "text": "London (AFP) – Britain’s Natural History Museum on Friday named a tiny, blind and wingless beetle after climate activist Greta Thunberg.\n\nThe honey-coloured insect, measuring less than one millimetre, was discovered in the Kenyan capital Nairobi in the 1960s.\n\nBut it apparently remained nameless until the venerable London museum’s scientific associate Michael Darby stepped in.\n\n“I am immensely impressed with the work of this young campaigner and wanted to acknowledge her outstanding contribution in raising awareness of environmental issues,” Darby said.\n\nSweden’s Thunberg, still only 16, has injected a burst of energy into the climate change movement since launching her first school strikes one year ago.\n\nShe has also become a global pop culture icon.\n\nEarlier this month, British superstar DJ Fatboy Slim paid tribute to Thunberg by using samples from her incandescent speech at the United Nations in a remix of his smash hit “Right Here, Right Now”.\n\nBut she has never before been linked to an insect.\n\nMax Barclay, a senior curator at the 146-year-old museum, said “the name of this beetle is particularly poignant”.\n\n“It is likely that undiscovered species are being lost all the time, before scientists have even named them, because of biodiversity loss,” said Barclay.\n\n“So it is appropriate to name one of the newest discoveries after someone who has worked so hard to champion the natural world and protect vulnerable species.”\n\nThe museum said the beetle’s existence in its vast collection had only just been discovered.\n\nIt’s formal scientific name is Nelloptodes gretae.\n\nIt belongs to the “Ptiliidae family of beetles which includes some of the smallest insects in the world,” the museum said in a statement.", "description": "London (AFP) – Britain’s Natural History Museum on Friday named a tiny, blind and wingless beetle after climate activist Greta Thunberg. The", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/26/e78210_honey-coloured-insect-measuring-one-millimetre-was-discovered-in-kenyan-640x335.jpg", "published_at": "2019-10-26"}