{"pub": "breitbart", "url": "https://breitbart.com/middle-east/2019/10/30/saudi-davos-in-desert-glitz-and-smiles-as-attendees-hide-their-name-cards", "downloaded_at": "2019-10-30 10:48:23.872616+00:00", "title": "Saudi 'Davos in Desert': Glitz and Smiles as Attendees Hide Their Name", "language": "en", "text": "Riyadh (AFP) Wall Street titans smiled and schmoozed at a Saudi investment conference widely shunned last year over a critic’s murder, but as wariness lingers some delegates kept their name cards discreetly out of sight.\n\nThousands of policy-makers and executives from over 30 countries packed into Riyadh’s Ritz-Carlton hotel, bedecked with frescoed ceilings and glittering chandeliers, for the three-day Future Investment Initiatve (FII) that opened Tuesday.\n\nIt was a striking contrast with last year’s summit, which was largely filled with delegates from Arab countries — many from Saudi Arabia itself — as the fallout over dissident journalist Jamal Khashoggi’s murder inside the Saudi consulate in Istanbul triggered mass cancellations by Western executives.\n\n“Most notable are the people who came for the inaugural FII (in 2017), boycotted the second and now have returned for the third,” an American finance executive told AFP, declining to be named.\n\n“It’s like they are giving their stamp of approval, saying to others: ‘It’s okay to come back to Saudi’.”\n\nHe referred specifically to American asset management company Blackrock’s chief executive Larry Fink and Stephen Schwarzman, head of private equity firm Blackstone, who participated in panels cheerleading Saudi reforms.\n\nOthers endorsing Crown Prince Mohammed bin Salman included an all-star lineup of speakers, from Indian tycoon Mukesh Ambani to Prime Minister Narendra Modi and Brazil’s President Jair Bolsonaro.\n\nBut despite the ebullient mood on the stage, many delegates were squeamish about being named in media interviews, in a sign of the lingering reputational risk of doing business in Saudi Arabia.\n\nSome sought to fly under the radar, flipping their name cards behind their coats or hiding them behind their ties. Some even appeared hesitant to share their business cards with journalists.\n\nThe Saudi organisers also sought to avoid media scrutiny, banning journalists with cameras from entering the main conference hall and from a gala dinner organised for delegates.\n\n“The sanctions threat over Saudi’s human rights record is currently over, but reputational costs are ongoing,” Ryan Bohl, of the US geopolitical think tank Stratfor, told AFP.\n\n“Most companies have made the judgement whether they will be affected or endure those costs. Those that don’t want those risks are staying away.”\n\n– ‘Massive potential’ –\n\nKhashoggi’s murder plunged Saudi Arabia into a public relations crisis, forcing companies with ties to the kingdom to find a balance between maintaining their reputations and their business considerations.\n\nMany of those attending this year are Wall Street financiers chasing a potential windfall from the upcoming stock market listing of state-owned oil giant Aramco, the world’s most profitable company.\n\n“There is massive potential,” an executive from a Singapore-based manufacturer of engineering equipment told AFP.\n\n“This is Saudi Arabia and Aramco — there is nothing bigger.”\n\nBut this year’s FII has few names from the world’s largest technology companies or from Hollywood, key areas of Saudi investment.\n\nGlobal media companies, which in previous years sponsored the event and even moderated panels, are also absent.\n\nBut not everyone was squeamish — especially those scouting for deals.\n\n“Reputational risk? No,” said Christian Giannini, of European tech investor 01 Ventures.\n\nOn the sidelines of FII, his company received a licence from the Saudi Arabian General Investment Authority to establish a tech investment fund worth millions of dollars, Giannini told AFP.\n\nKPMG, another consultancy with business ties to Saudi Arabia, is being represented at FII by around 25 executives, up from five last year, a company official told AFP.\n\nThe forum is billed as an economic coming-out party for the petro-state, seeking to diversify away from oil — and authorities are eager to project the kingdom’s economic ambitions.\n\nDelegates were greeted with gizmos such as face recognition software used to welcome them by name as they walked into the palatial hotel.\n\nA bevvy of talking robots and self-driving sweepers to clean the conference area were also on display.\n\n“It’s better to help Saudis to build their future rather than sit back and do nothing and complain,” said Rudolph Waels, founder of consultancy Armalia Partners, who has attended all three FIIs.\n\n“I have no hesitation to be here.”", "description": "Wall Street titans smiled and schmoozed at a Saudi investment conference widely shunned last year over a critic's murder.", "authors": ["Breitbart Jerusalem"], "top_image": "https://media.breitbart.com/media/2019/10/saudi-davos-640x335.jpg", "published_at": "2019-10-30"}