{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/13/no-14-boise-state-loses-bachmeier-beats-hawaii-59-", "downloaded_at": "2019-10-13 08:44:31.957855+00:00", "title": "No. 14 Boise State loses Bachmeier, beats Hawaii 59-37", "language": "en", "text": "BOISE, Idaho (AP) - After holding a competitive contest for the starting quarterback job, Boise State coach Bryan Harsin has insisted that the Broncos are well stocked at the position.\n\nSaturday night against Hawaii and its high-powered offense, Harsin’s message was put to the test. Turns out, he was right.\n\nChase Cord threw for 175 yards and three touchdowns in relief of injured starter Hank Bachmeier and No. 14 Boise State beat Hawaii 59-37.\n\nThe Broncos (6-0, 3-0 Mountain West) remained perfect at home against the Rainbow Warriors in seven meetings, despite losing Bachmeier early in the second quarter when he was scrambling for a first down and spun to elude oncoming linebacker Kana’i Picanco.\n\nBachmeier absorbed a hit in his lower back and promptly fumbled. He walked gingerly off the field with the aid of staff trainers before going to the locker room. In the second half, he returned to the sidelines in street clothes.\n\n“(Hank’s injury) was something along the lines of a hip pointer,” Harsin said after the game. “He got hit in the side and was out, and he was not going to go back in. At that point . we decided to just roll with Chase. He was already in the game plan with some packages. So we decided to give Hank a chance to rest up a bit. . He’s going to be fine moving forward.”\n\nWith Bachmeier out, Cord ensured that the Broncos’ passing offense that ranks second in the conference didn’t miss a beat, throwing TD strikes of 33, 42, and 8 yards and finishing with 12 for 18 passing.\n\nHawaii (4-2, 1-1), which entered the game with the Mountain West’s top passing offense and fourth nationally, fell behind early and never seemed to have an answer defensively for any of the three quarterbacks Boise State played.\n\n“The defense played well in the first half but awful field position,” Hawaii coach Nick Rolovich said. “We gave them some real short plays and they took advantage of it. Our defense didn’t play nearly as poorly as the score indicated, but in the second half we gave up some really big plays that we uncharacteristic for us.”\n\nDespite Cord’s commanding presence, the Broncos mixed up the play calling, using five players at quarterback.\n\n“They’re all intelligent enough to do that, so we’re able to have a little bit of fun,” Harsin said. “Everything we’re doing, it’s about how we can get all these players involved.”\n\nOne of those players was Boise State receiver John Hightower, who had seven catches for 141 yards and two touchdowns. He also ran a play with an option to pass.\n\n“It’s tough seeing somebody go down,” Hightower said. “But all the quarterbacks are prepared and they know what they’re doing. It’s nice to see all of them make plays we already know what they’re capable of making.”\n\nJaylon Henderson also played significant time at quarterback as the Broncos’ trio of signal callers combined for 315 yards passing.\n\nHawaii quarterback Cole McDonald threw for 251 yards and three touchdowns, moving past Garrett Gabriel for fifth place on the school’s career passing yardage list.\n\nSTATS THAT MATTER\n\nIn the first half, Boise State’s average starting field position was its own 47, aided by three fumbles.\n\nHawaii finished with four turnovers, which proved costly in the second quarter when Boise State blew open a tight game to take command.\n\nTHE TAKEAWAY\n\nHawaii: The Rainbow Warriors raised some eyebrows early with wins over Pac-12 foes Arizona and Oregon State but fell flat against another Top 25 opponent. The last time Hawaii beat a ranked team was Nevada in 2010. If Hawaii intends to rekindle its glory from earlier the past decade, it needs to find a way to beat one of the country’s top teams.\n\nBoise State: The Broncos played their most complete game of the season, and did so without Bachmeier for most of the contest. That’s exactly the kind of performance Boise State coach Bryan Harsin has been pleading for from his team, and the type of play it will need if the Broncos intend to stay in the driver’s seat for a New Year’s Six bowl game berth among the Group of 5 schools.\n\nPOLL IMPLICATIONS\n\nBoise State could possibly move up after a couple losses by teams above the Broncos.\n\nUP NEXT\n\nHawaii returns home next Saturday to face Air Force.\n\nBoise State will take a break from conference play next week and hit the road for a game with burgeoning regional rival BYU.\n\n___\n\nMore AP college football: https://apnews.com/Collegefootball and http://www.twitter.com/AP_Top25\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "After holding a competitive contest for the starting quarterback job, Boise State coach Bryan Harsin has insisted that the Broncos are well stocked at the position.", "authors": ["The Washington Times Http", "Jason Chatraw"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/13/hawaii_boise_st_football_93413_c0-151-3615-2259_s1200x700.jpg?937da9677b4bb5e1da1bd63dfd761e68aac4bc62", "published_at": "2019-10-13"}