{"pub": "nytimes", "url": "https://nytimes.com/2019/10/14/opinion/daniel-mcready-north-carolina.html", "downloaded_at": "2019-10-14 11:28:21.260217+00:00", "title": "Opinion | I Almost Flipped a Deep Red District. Here’s What I Learned.", "language": "en", "text": "I also wasn’t afraid to share how my faith led me to run, and then helped me press on through challenging times as we battled the election fraud.\n\nSo while I talked about policy, I anchored my candidacy in the things that connect us all. In the end, voters told me they trusted me because they got the real me. It’s a great lesson. We all have our own stories to tell. Lead with the heart, and the rest will follow.\n\nSecond, when it came to policy, I met voters where they were. We focused not on the daily drama in Washington, but on people’s everyday struggles. Voters told me that instead of more partisan fighting, they needed help to afford medication and doctors’ visits. I promised to work across party lines in Congress to lower health care and prescription drug costs. Voters welcomed my proposal to stand up to big drug companies, fix Obamacare and expand Medicaid.\n\nTo be sure, some activists wished I favored a stronger government hand in my health care proposal. But once they got to know me, they poured their hearts into our race because they knew my values and saw that we had the same goal of affordable and quality health care for every American. This taught me how important it is to avoid policy purity tests and focus on the goals we all share.\n\nThis approach also insulated me from some of my opponents’ appalling tactics. Republican groups spent over $6 million lying about my character. They told voters I supported infanticide. They tried to scare voters with racist dog whistles. President Trump and Vice President Mike Pence even came down on the eve of the election to throw fuel on the fire.\n\nBut because we took the time to build a foundation of values and common-sense policy ideas, most persuadable voters found those attacks unbelievable.\n\nThird, we showed that running in a district like mine doesn’t mean a candidate has to sacrifice the Democratic base to win the middle. In fact, the trust we built early on, which we strengthened over countless coffee chats and town halls, set our base on fire. We didn’t always agree on policy specifics, but we trusted one another, and we became like family.", "description": "Lead with values. Promote common-sense policies. And don’t give up on rural voters.", "authors": ["Daniel Mccready"], "top_image": "https://static01.nyt.com/images/2019/09/25/opinion/25mccready1/25mccready1-facebookJumbo.jpg", "published_at": "2019-10-14"}