{"pub": "hotair", "url": "https://hotair.com/archives/jazz-shaw/2019/09/27/ukraine-not-wild-release-call-transcript", "downloaded_at": "2019-09-27 12:08:51.145353+00:00", "title": "Ukraine not wild about release of call transcript", "language": "en", "text": "Well, this was entirely predictable. In fact, I predicted it during a hit on a radio show Wednesday morning, along with countless other pundits observing the train wreck developing around President Trump’s call to Ukranian President Volodymyr Zelensky. (Perhaps this would all go more smoothly if the guy’s name didn’t sound so much like Voldemort.) The press and the public have their collective hands on the transcript of the call, with reporters almost wetting themselves, confident that they’ve finally got the President in their sights and the impeachment hammer will be coming down any day now.\n\nBut what about the other participant on that call? As it turns out, Zelensky isn’t pleased that all the details of his supposedly private conversation with the American president are scrolling across the chyron on CNN. (Associated Press)\n\nUkraine’s president says his comments in a conversation with U.S. President Donald Trump shouldn’t have been publicly released. President Volodymyr Zelenskiy is also playing down Ukraine’s investigation of Democratic presidential candidate Joe Biden… Zelenskiy told reporters at the U.N. General Assembly in New York afterward that “I think such things, such conversations between heads of independent states, they shouldn’t be published.” But he also said he’s “not afraid” of the publication.\n\nThis choice to release the nearly full transcript (with minor redactions) was a bad decision, whether it originated in the White House or the press corps. Granted, some of the information in there was going to have to be handed over, at least to some members of Congress, if not the public. The allegations raised by the so-called “whistleblower” were too incendiary to simply bury it and leave everyone guessing.\n\nBut basically emptying the bag is going to cost Donald Trump in the long run, and I’m not talking about the Democrats’ dreams of impeachment. Why would any other world leaders speak candidly with the President again after this? As Zelensky clearly pointed out, he expected the call to be a private one and now whatever dirty laundry was discussed is out in the public square.\n\nNone of it was too terrible for the Ukranian president. He did a bit of trash-talking about France and Germany, but it was relatively softball stuff involving a decision to build a new Russian pipeline. Thus far Macron and Merkel haven’t commented on it, but you can bet their next interactions with Zelensky will be a bit awkward.\n\nMuch worse undoubtedly goes on during calls between all world leaders on a regular basis. Can you imagine what Trudeau, Merkel and Macron say about Trump when nobody is listening? But they expect that those conversations will remain among the participants. Also, proposals are regularly floated when leaders speak in private, but many of them don’t work out and never see the light of day. Having let the cat out of the bag once, Donald Trump probably won’t be getting the same sort of candid exchanges from other world leaders in the future.\n\nAs to the quid pro quo question and the impeachment fantasies of the media, everyone is seeing what they want to see in that call. You can tell it wasn’t as big of a bang as Trump’s detractors had hoped because the media is already scrambling to remind everyone that the President doesn’t need to break the law to be impeached. But unless we suddenly see a “gang” of Republicans in the Senate lining up in agreement to vote to convict the President, I doubt he’s losing much sleep over it. And they’ve got a budget deal to work out in the meantime.", "description": "Behind closed doors", "authors": ["Jazz Shaw", "John Sexton", "Ed Morrissey", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/Zelensky.jpg", "published_at": "2019-09-27"}