{"pub": "reuters", "url": "https://reuters.com/article/us-italy-eu-budget/eu-warns-france-italy-over-budgets-but-rows-unlikely-idUSKBN1X10NR", "downloaded_at": "2019-10-22 15:09:08.904290+00:00", "title": "EU warns France, Italy over budgets, but rows unlikely", "language": "en", "text": "STRASBOURG (Reuters) - The European Commission said France and Italy draft budgets for next year might breach of European Union fiscal rules and it asked for clarification by Wednesday in letters sent to the countries’ finance ministers.\n\nFILE PHOTO: European Commissioner for Economic and Financial Affairs Pierre Moscovici presents the EU executive's economic forecasts during a news conference at the EU Commission headquarters in Brussels, Belgium, July 10, 2019. REUTERS/Francois Lenoir/File Photo\n\nThe EU executive has also issued budget warnings to Finland over its spending, and to Spain, Portugal and Belgium, who have submitted incomplete budget plans because of recent elections.\n\nThe EU’s move on Italy is considered necessary, since Rome plans to spend more to boost growth. It is unlikely to lead to a repeat of last year’s standoff, when Brussels forced the Italian government to amend its budget to avoid sanctions.\n\nThe letter to Italy, dated Oct. 22 and signed by economic commissioners Valdis Dombrovskis and Pierre Moscovici, said a preliminary assessment of the 2020 draft budget showed that it fell short of EU fiscal recommendations to reduce spending.\n\n“Italy’s plan does not comply with the debt reduction benchmark in 2020,” the letter said.\n\nThat was the same message Brussels sent Italy last year. The situation since then has changed: Italy now has an EU-friendly government, the EU is pushing for more spending to counter recession risks and the current commission is also about to end its five-year mandate.\n\nMoscovici told reporters on Tuesday the situation was different from last year and the commission would not ask for changes to Italy’s budget, reiterating the soothing message he delivered last week in an interview with Reuters.\n\nItalian Prime Minister Giuseppe Conte said Rome would provide the necessary information to Brussels as part of an exchange that finance ministry sources said did not cause concerns.\n\nBrussels wants Italian Finance Minister Roberto Gualtieri to explain why, according to his draft budget, the country’s structural balance, which excludes one-off revenues and expenditures, would worsen by 0.1% of gross domestic product instead of improving by 0.6% as requested by the EU.\n\nThe Commission is also asking why net primary expenditure, which strips out interest payments, is budgeted to grow by 1.9% of output next year, instead of falling as recommended by the EU.\n\nAt the same time, Brussels is looking into whether it could grant Italy leeway for “unusual events”, it said in the letter. If granted, as widely expected after Rome’s request, the flexibility could allow Italy to deviate from fiscal targets without breaching EU fiscal rules.\n\nFRANCE, CARETAKER GOVTS\n\nBrussels sent similar warnings to French Finance Minister Bruno Le Maire, saying under the existing draft budget that Paris would breach EU rules on public debts.\n\nFrance foresees no structural improvement next year, contrary to EU requests for an improvement worth 0.6% of GDP.\n\nParis will provide the requested clarifications, Finance Minister Bruno Le Maire said, adding that he had made a political choice to cut taxes in a bid to address social issues in France and the slowdown of the global economy.\n\nThe Commission, which is in charge of assessing the budgets of euro zone countries, also sent warnings to Spain, Portugal and Belgium, whose caretaker governments were not in a position to submit complete budgets by the Oct. 15 deadline set by EU rules.\n\nFILE PHOTO: European Commissioner Valdis Dombrovskis of Latvia speaks as he attends his hearing before the European Parliament in Brussels, Belgium October 8, 2019. REUTERS/Francois Lenoir\n\nSpain and Belgium have not formed new governments following this year’s elections, with Spain going to the polls again in November. In Portugal, a new cabinet has not yet been sworn in after elections held this month.\n\nCountries occasionally present incomplete budgets because of elections, but the commission warned that the current budgetary measures laid out by the three caretaker executives could fall short of EU fiscal rules.\n\nA warning letter was also sent to Finland because of its growing public spending. Helsinki replied, saying the measures were temporary and necessary to boost employment and improve public finances in the long run.", "description": "The European Commission said France and Italy draft budgets for next year might breach of European Union fiscal rules and it asked for clarification by Wednesday in letters sent to the countries' finance ministers.", "authors": ["Francesco Guarascio", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191022&t=2&i=1443719327&w=1200&r=LYNXMPEF9L10D", "published_at": "2019-10-22"}