{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/08/with-a-possible-apple-tag-waiting-in-the-wings-tile-unveils-sticker-an-adhesive-device-for-tracking-objects", "downloaded_at": "2019-10-08 09:57:50.878513+00:00", "title": "With a possible Apple tag waiting in the wings, Tile unveils Sticker, an adhesive device for tracking objects – TechCrunch", "language": "en", "text": "We are still waiting to see if Apple officially unveils a new spin on the business of tracking tags — the small devices that you put on ‘dumb’ objects like keys, wallets and other objects you have a habit of losing or leaving places to be able to pinpoint their location — but in the meantime, Tile, one of the pioneers of this technology, is upping its game today with its least-obtrusive device yet: a sticker.\n\nToday, the startup unveiled Sticker, a new, waterproof tracking device that it created in collaboration with 3M, which uses adhesive to attach to objects to be able to track them by Bluetooth to a range of 150 feet, or further using Tile’s community network by way of its app.\n\nAlongside this, the startup is also announcing enhancements to its existing range of Tile tracking devices. The Slim is now in the shape and thinness of a credit card, designed for wallets and other places where you might insert card-shaped information (for example, in luggage ID compartments), and its range has been extended to 200 feet with a battery life of three years.\n\nAnd the Mate and Pro tags — the square-shaped fobs that Tile is most famous for — are also getting their ranges extended to 400 feet.\n\nAll four models are going on sale as of today at a range of prices: Tile Stickers starting from $39.99 for a 2-pack, $59.99 for a 4-pack; Tile Slim at $29.99; Tile Mate at $24.99; and Tile Pro at $34.99. The message here is that Tile is continuing to increase its flexibility and use cases with these updates and new Sticker release.\n\n“Over the years we’ve seen our customers use Tile for a variety of items,” said CJ Prober, Tile CEO, in a statement. “From wallets to remote controls, power tools to backpacks, our customers have shown us they want a Tile for everything. We’ve designed our new product line to empower the Tile community to find literally anything.”\n\nThe moves come on the heels of a competitive time for Tile. On the one hand, the business area that it identified early on has clearly caught the attention of a number of other companies, underscoring the opportunity. But the flip side of that is a lot of new competition in an area that is already crowded and has seen some high-profile failures.\n\nOn the launch front, in addition to Apple’s reported interest in launching a competitor, earlier this year Verizon (which also owns TechCrunch) also launched its own IoT play in this area, and Google has also created tighter integrations for people to use its Home devices and Android platform to locate objects. At the same time, some of Tile’s earliest competitors have been heavily challenged to make a go of it: Trackr last year rebranded to Adero and just weeks later laid off nearly half its staff, a decline that we’ve heard has not been halted in the months since.\n\nFor its part, Tile last summer raised $45 million last summer on the heels of some interesting strategic partnerships with the likes of Comcast — which, similar to Verizon, Apple, and Google, sees an opportunity in doing more with item tracking as part of a bigger end-to-end connected home play. The feeling is that Tile raised the money to help leverage its bigger market profile in the hopes of staving off this wave of competitors and the many others that already existed before that.\n\nIndeed, if you search on something like Amazon for Bluetooth tracking stickers, you’ll see that this is not exactly a new thing, and there are a number of alternatives out there (one of the big reasons why this market has been a challenging one).\n\nOne big differentiator with Tile has been the wider network and economies of scale that it promises to its users: once you are out of the Bluetooth range of your tag, you are able to track the object by way of its app and the wider Tile community, which forms a Bluetooth-based P2P network of sorts to be able to locate items. Of course, the premise of this is that enough people are using Tiles to begin with to create the locating network in the first place, which is one reason why forming collaborations with the likes of Google and Comcast can be very critical longer term to Tile’s success.", "description": "We are still waiting to see if Apple officially unveils a new spin on the business of tracking tags — the small devices that you put on ‘dumb’ objects like keys, wallets and other objects you have a habit of losing or leaving places to be able to pinpoint their location — but in the […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/269104663_89ecb7d7e5_k.jpg?w=711", "published_at": "2019-10-08"}