{"pub": "metro", "url": "https://metro.co.uk/2019/10/28/ronnie-osullivan-beaten-first-time-27-years-dominic-dale-world-open-10997047", "downloaded_at": "2019-10-28 13:31:31.648981+00:00", "title": "Ronnie O’Sullivan beaten for ‘first time in 27 years’ by Dominic Dale at World Open", "language": "en", "text": "Ronnie O’Sullivan has fallen at the first hurdle in Yushan (Picture: Getty Images)\n\nRonnie O’Sullivan has fallen at the first hurdle of the World Open in Yushan, losing to fellow veteran Dominic Dale for the first time in his career.\n\nThe Rocket was playing a held over qualifier at the World Open on Monday and was heavily fancied to see off the Spaceman, as he has done so many times before.\n\nHowever, the Welshman was in good form, rolling in four half-centuries en route to a 5-3 win over the five-time world champion.\n\nDale took a two-frame lead, with Ronnie making a pair of half-centuries to bring it back to 2-2, the next two frames were shared, but it was the Welsh veteran who kept his nerve, making 51 and 72 in the final two frames to seal victory.\n\nO’Sullivan shook Dale’s hand with a smile after the match and signed some autographs in the crowd, with people quite literally falling over themselves to get to the Rocket, despite his loss.\n\nDominic Dale has finally beaten the Rocket (Picture: Getty Images)\n\nDale, 47, turned professional for the 1992/93 season, the same year as O’Sullivan, and has finally got the better of him after all these years.\n\nAdvertisement\n\nAdvertisement\n\nThe pair first met at the 1993 World Championship, with the Essex hero beating the Spaceman 10-5, and finally taking a measure of revenge, Dale said: ‘It’s only taken me 27 years!’\n\nO’Sullivan’s early exit is good news for organisers of upcoming events, because he is now much more likely to enter forthcoming tournaments.\n\nWhen asked if he would play in the Northern Ireland Open in November, O’Sullivan said: ‘Yeah probably. It depends how I do in China, if I do well there I can afford to have a few days off.’\n\nThose days off look unlikely now, and we could now see O’Sullivan play in three events next month – the Champion of Champions, Northern Ireland Open and the UK Championship.\n\nMeanwhile, Dale has another battle of the 40-somethings in the last 64 in Yushan, where he will take on Fergal O’Brien.\n\nMORE: Ronnie O’Sullivan will be at the Masters, but maybe not the World Championship, reckons Barry Hawkins\n\nMORE: Ronnie O’Sullivan refuses to commit to next two Home Nations events", "description": "Ronnie O'Sullivan has fallen at the first hurdle of the World Open in Yushan, losing to fellow veteran Dominic Dale for the first time in his career. The Rocket was...", "authors": ["Phil Haigh"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1144561287_1572264079.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-28"}