{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7566083/JWoww-gets-Instagram-apology-toyboy-Zack-Carpinello-mistakes-back.html", "downloaded_at": "2019-10-12 17:09:26.548942+00:00", "title": "JWoww gets Instagram apology from toyboy Zack Carpinello: 'I made mistakes that I cannot take back'", "language": "en", "text": "Zack Carpinello has apologized to Jersey Shore: Family Vacation star Jenni 'JWoww' Farley after their reported breakup.\n\nOn Thursday's episode, Zack wrapped his hand around Angelina Pivarnick's waist in a nightclub and touched her bum as a drunk JWoww snoozed nearby.\n\n'I made mistakes that I cannot take back, which I take full responsibility for,' the 24-year-old wrestler wrote on Instagram this Saturday.\n\n'This is on me': Zack Carpinello has apologized to Jersey Shore: Family Vacation star Jenni 'JWoww' Farley after their reported breakup\n\n'Jenni does not deserve any damage from anybody else. This is on me. I sincerely apologize to Jenni. I apologize to Angelina as well,' he added.\n\n'I love Jenni, with everything I have, I make this known to her every day. I will continue to do everything to make this known to her and her kids, who also have my heart. I will make it certain that nothing like this ever happen again, in any way regardless of the outcome.'\n\nJWoww, 33, shared an Instagram statement Thursday about how 'hurt' she was by the episode and an Us Weekly insider said she has 'ended the relationship.'\n\nAngelina shared during a confessional on Thursday's episode: 'So we're all dancing and having a great time. Jenni is obliviated drunk, passed out on her man right now. And all of a sudden, I just feel this big hand just, like, right on me.'\n\n'I love Jenni': 'I made mistakes that I cannot take back, which I take full responsibility for,' the 24-year-old wrestler wrote on Instagram this Saturday\n\nThe way they were: Jenni dumped the hunky wrestler after witnessing his conduct with her co-star Angelina Pivarnick on Jersey Shore\n\nShe added: 'I was surprised because his hands are so big. It was, like, on my a** and my side. And Jenni's like right there.'\n\nHer co-stars Deena Cortese and Vinny Guadagnino were on the scene and also witnessed the nightclub encounter.\n\nVinny said in a confessional: 'I mean, Jenni is jealous over everything. Like, if she knew what was going on, she would kill both of you.'\n\nTrouble: On Thursday's episode, Zack wrapped his hand around Angelina's waist in a nightclub and touched her bum as a drunk JWoww snoozed nearby\n\nCalling Zack by his age-based nickname, Angelina said: 'We all need to get out of here. Jenni's a f***ing mess right now and 24 is f***ing trouble.'\n\nShe added: 'One minute he's asking me about my sex life, and the next minute, he's like grabbing me. He doesn't know what boundaries are.'\n\nAngelina later confided in her fiance Chris Larangeira about Zack's actions, as seen on a mid-season trailer for the MTV reality show.\n\nWhen JWoww got wind of the incident, she refused to believe Angelina's story, snapping at Angelina: 'How much do you commit to a lie?'\n\nLooking back: Angelina shared in a confessional that 'all of a sudden, I just feel this big hand just, like, right on me,' describing it has 'on my a** and my side'\n\n'Jenni is jealous over everything': Co-star Vinny Guadagnino dished of JWoww in a confessional: 'Like, if she knew what was going on, she would kill both of you'\n\nThe argument threatened to become a brawl as both ladies picked up wine bottles and their co-stars had to restrain them.\n\nJust after Thursday's episode aired, JWoww posted an Instagram statement about her 24-year-old boyfriend's indiscretion.\n\n'After seeing tonight’s episode I’m pretty hurt. I feel disrespected by someone I called a friend and by someone who stated they loved me,' said JWoww.\n\n'For 5 months I was kept in the dark about this. For 5 months I was naïve, probably laughed at and made into a story line that will forever haunt me.'\n\nRevealed: Angelina later confided in her fiance Chris Larangeira about Zack's actions, as seen on a mid-season trailer for the MTV reality show\n\nNo holds barred: When JWoww got wind of the incident, she refused to believe Angelina's story, snapping at Angelina: 'How much do you commit to a lie?'\n\nShe concluded: 'My heart hurts on so many levels. One thing I learned from tonight’s episode is know your value. Don’t ever lower your standards.'\n\nJWoww married truck driver Roger Matthews in 2015 and welcomed two children with him - Meilani, five, and Greyson, three.\n\nIn a video on her YouTube page, Zack played a game called The Boyfriend Tag where he had to answer questions about JWoww and revealed they met at her wedding.\n\nThe mother of two filed for divorce last October and by this April it emerged that she was with Zack. Her split from Roger was finalized in August.", "description": "'I made mistakes that I cannot take back, which I take full responsibility for,' the 24-year-old wrestler wrote on Instagram this Saturday.", "authors": ["Sameer Suri For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/16/19629956-0-image-a-14_1570895632237.jpg", "published_at": "2019-10-12"}