{"pub": "theverge", "url": "https://theverge.com/2019/10/15/20914110/chromebook-how-to-change-chrome-os-channels-unreleased-features-settings", "downloaded_at": "2019-10-15 23:05:51.487119+00:00", "title": "Chromebook 101: How to change your Chrome OS channels and get unreleased features", "language": "en", "text": "You might not know it from glancing at a Chromebook, but Google’s Chrome OS is in a constant state of evolution.\n\nThe operating system receives minor updates every two to three weeks and major releases every six weeks. And at any given moment, Google’s staff is working on features and software enhancements that most people won’t see for a matter of weeks — or months.\n\nHere’s a little secret, though: if you’re feeling adventurous, you can gain access to those unreleased enhancements. All it takes is the flip of a virtual switch in your Chromebook’s settings, and you’ll have all sorts of interesting new options at your fingertips.\n\nFirst, it’s important to understand exactly what’s involved so you can make an educated decision about which setup makes the most sense for you.\n\nUnderstanding the Chrome OS channels\n\nChrome OS actually exists in four separate development channels. The software you see on your Chromebook varies considerably depending on which channel you choose:\n\nThe Stable channel is the polished and ready-for-prime-time version of the software that all devices use by default.\n\nis the polished and ready-for-prime-time version of the software that all devices use by default. The Beta channel is updated weekly and receives new features about a month ahead of its Stable sibling.\n\nis updated weekly and receives new features about a month ahead of its Stable sibling. The Developer channel is updated as frequently as twice a week and sees stuff that’s actively being worked on and has undergone only a small amount of testing.\n\nis updated as frequently as twice a week and sees stuff that’s actively being worked on and has undergone only a small amount of testing. Finally, the Canary channel is what Google describes as the “bleeding edge” Chrome OS path — a channel that receives daily updates, prior to any widespread testing, and can be accessed only by a Chromebook that’s switched into a special developer mode (which, somewhat confusingly, has nothing to do with the Developer channel).\n\nThe Stable channel is the safest option and what the vast majority of people should use — particularly those who need to know their computers will always work flawlessly, without any hiccups or unexpected glitches.\n\nIf you’re feeling adventurous and don’t mind a bit of a risk, the Beta channel is a good way to get a peek at unreleased features without too much instability. The odds of running into something funky are certainly higher than with Stable, but by and large, elements in Beta are fairly well developed and just in the final phases of testing.\n\nMost day-to-day users would be well advised to stay away from the Developer channel, since it receives updates as they’re built and is quite likely to contain bugs. And as for the Canary channel, if you’re not sure whether you ought to be using it, the answer is probably no.\n\nChanging your Chrome OS channel\n\nOnce you’ve decided which channel you want to try, here’s how to make the switch:\n\nOpen your Chromebook’s settings.\n\nClick “About Chrome OS” in the menu on the left, then click “Detailed build information.”\n\nLook for the category “Channel” and click the “Change channel” button. That’ll cause a pop-up to appear that lets you select the Stable, Beta, or Developer channel. (Canary, remember, is available only if your device is in Developer mode — a level of access that opens the door to more advanced forms of OS modification, but also disables some of the software’s standard layers of protection. It requires several extra steps to enable and, again, isn’t advisable for most Chromebook users.)\n\nClick the channel you want, then click the blue confirmation button that appears.\n\nClick the left-facing arrow at the top of the screen to get back to the “About Chrome OS” page. When you see the “Restart” button appear (it may take a minute or two), click it.\n\nAnd that’s it: As soon as your Chromebook finishes restarting, you’ll be on your new channel, with all your accounts, files, and preferences in place just like you left them.\n\nIf you ever decide you want to move back to the Stable channel, repeat that same process and select “Stable.” Just note that moving in that direction — from a higher channel to a less experimental one — generally requires you to Powerwash your Chromebook, which means all of your information and data will be erased, and you’ll have to sign in anew and start over.\n\nThe one exception: if your Chromebook is connected to a work- or school-based G Suite account, your data won’t be deleted and the change won’t take place immediately. Instead, you’ll have to wait until the lower channel catches up to the higher one in version number, which could take anywhere from a few weeks to a few months.", "description": "If you’re feeling adventurous, you can gain access to unreleased Chrome OS enhancements. All it takes is the flip of a virtual switch in your Chromebook’s settings, and you’ll have all sorts of interesting new options at your fingertips.", "authors": ["Jr Raphael", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/RPcDFtcE5RrjJU5XHwG0dCt44Oo=/0x539:3300x2267/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10603037/HP_Chromebook_x2_FrontRight.jpg", "published_at": "2019-10-15"}