{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7543891/Joe-Biden-accuses-Donald-Trump-asking-foreign-governments-make-lies-him.html", "downloaded_at": "2019-10-07 00:13:48.861847+00:00", "title": "Joe Biden accuses Donald Trump of asking foreign governments to make up lies about him", "language": "en", "text": "Joe Biden suggested that Donald Trump asked foreign governments to 'manufacture lies' about him in order to hurt the former vice president's chances in the presidential election.\n\n'In my experience, asking a foreign government to manufacture lies about your domestic political opponent is not ''done all the time,'' Biden asserted in a tweet Sunday afternoon.\n\nThe rebuke came a full two days after Trump made the initial Twitter post on Friday in which he said he has an 'obligation' to try and put an end to corruption.\n\n'As President I have an obligation to end CORRUPTION, even if that means requesting the help of a foreign country or countries,' the president posted to his Twitter on Friday. 'It is done all the time. This has NOTHING to do with politics or a political campaign against the Bidens. This does have to do with their corruption!'\n\nTrump insists that Biden and his son Hunter were engaged in nefarious business situations in Ukraine and China, which is why he said he asked both governments to look into the Bidens' business dealings there.\n\nBiden insists that he never spoke with his son about his position on that board at Burisma Holdings, a natural gas firm in Ukraine, and insists that the focus should remain on Trump's conversation with his Ukrainian counterpart.\n\nJoe Biden accused Donald Trump of asking foreign governments to 'manufacture lies' about him\n\nTrump claimed that foreign governments are often recruited to help with ending corruption, but Biden turned that around and said he was trying to get other governments to make up lies\n\nTrump tweeted Friday that he has an 'obligation to end corruption' and said his efforts had 'nothing to do with politics'\n\nA defiant Joe Biden repeated his vow to beat Donald Trump 'like a drum' in the 2020 election in an op-ed published Sunday in the Washington Post.\n\nThe 76-year-old accused his political foe of 'abusing the power of the presidency' by publicly calling upon Ukraine and China to investigate his son Hunter's business dealings in their countries.\n\nHe also claimed that Trump has 'corrupted the agencies of his administration — including the State Department, the National Security Council staff, the Justice Department and the office of the vice president' in his pursuit to do so.\n\n'He slanders anyone he sees as a threat,' Biden stated.\n\n'That is why is he is frantically pushing flat-out lies, debunked conspiracy theories and smears against me and my family, no doubt hoping to undermine my candidacy for the presidency.'\n\nHowever, the 2020 contender defiantly declared he would not let Trump intimidate him, directly addressing the commander-in-chief and stating: 'Please know that I'm not going anywhere. You won't destroy me, and you won't destroy my family.'\n\nBiden vowed to maintain his focus on the issues affecting American families as he continues his Democratic campaign.\n\nHe claimed that he would keep attention on his goals of 'getting weapons of war off the streets and ending the epidemic of gun violence; building on Obamacare so that every American has access to quality, affordable health care; and taking on the climate emergency imperiling the planet'.\n\nWhile Biden may want to stick to those talking points, it appears others are still interested in probing him about his family's foreign business dealings.\n\nJoe Biden penned an op-ed in The Washington Post on Sunday, claiming President Trump is 'frantically pushing flat-out lies' about his family\n\nBiden accused his political foe of 'abusing the power of the presidency' by publicly calling upon Ukraine and China to investigate his son, Hunter's, business dealings in their countries. Joe and Hunter are pictured together in 2009\n\nOn Friday, the politician lashed out at a reporter in response to a question about his potential conflicts of interest in the Ukraine.\n\nAt a Service Employees International Union forum in Los Angeles, Biden was asked about his work overseeing foreign policy for Ukraine as vice president while his son Hunter served on the board of a major Ukrainian company.\n\n'It's not a conflict of interest. There's been no indication of any conflict of interest, in Ukraine or anywhere else. Period,' Biden snapped.\n\nAsked how his son's cushy $50,000-a-month gig didn't at least create the appearance of a conflict of interest, Biden said: 'I'm not going to respond to that. Focus on this man. What he's doing that no president has ever done. No president.'\n\nThe former VP has previously demanded that reporters 'ask the right questions' and accused Trump of trying to 'hijack' the campaign with unfounded assertions that Biden and his son had corrupt dealings in Ukrainian business and politics.\n\nIn late September in Iowa, Biden scolded a Fox News reporter who asked about his family's ties to Ukraine. 'You should be asking him the question: Why is he on the phone with a foreign leader, trying to intimidate a foreign leader?' he said.\n\n'This appears to be an overwhelming abuse of power. To get on the phone with a foreign leader who is looking for help from the United States and ask about me and imply things … this is outrageous. You have never seen anything like this from any president.'\n\nBiden renewed his attack on the president with a tweet on Saturday, writing: 'Donald Trump is the definition of corruption.'\n\nIn late September in Iowa, the former VP scolded a Fox News reporter who asked about his family's ties to Ukraine\n\nDevon Archer, far left, golfing in the Hamptons with former Vice President Joe Biden and his son Hunter, far right, in 2014. Archer served on the board of the Ukrainian natural gas company Burisma Holdings with Hunter\n\nOn Friday, Trump maintained that he had an 'obligation' to request assistance from foreign governments to investigate alleged corruption and asks he made of China and Ukraine were not politically motivated in any way.\n\nTrump insisted that the foreign investigations he's demanding are about Hunter Biden 'pillaging these countries and hurting us', not his father's bid to become the next president of the United States.\n\nThe scandal surrounding Trump's phone call with the Ukrainian president has the potential to drag on Biden's campaign for the Democratic presidential nomination, in addition to driving the House's impeachment inquiry into Trump.\n\nIn third quarter fundraising reports filed this week with the Federal Election Commission, Biden placed fourth for money raised from donors.\n\nSenator Bernie Sanders leads the field, so far, pulling in $25.3million, with Senator Elizabeth Warren's $24.6million close behind. Pete Buttigieg, the mayor of South Bend, Indiana, came in third with $19.1million.\n\nFrom there, the drop off is steep, with Biden pulling in $15.2million.\n\nThe latest national polling shows Biden with just a 2.2-point lead on Warren, down from a large double-digit lead on his rivals just months ago.\n\nIn third quarter fundraising reports filed this week with the Federal Election Commission, Biden placed fourth for money raised from donors\n\nBiden said that the media should keep the focus on President Trump (seen above returning to the White House after playing golf in his Virginia club on Saturday)", "description": "Joe Biden suggested that Donald Trump asked foreign governments to 'manufacture lies' about him in order to hurt the former vice president's chances in the presidential election.", "authors": ["Katelyn Caralle", "U.S. Political Reporter For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/20/19369418-0-image-a-12_1570391459649.jpg", "published_at": "2019-10-06"}