{"pub": "indiatimes", "url": "https://indiatimes.com/technology/news/spacex-s-starlink-internet-satellite-network-might-launch-another-30-000-into-orbit-378066.html", "downloaded_at": "2019-10-18 08:52:11.888272+00:00", "title": "Elon Musk May Now Launch 30,000 Satellites In Earth Orbit, For 100% Internet Coverage For All", "language": "en", "text": "Tesla CEO Elon Musk is always looking for the next best thing. So when he decided to set up a globe-spanning Internet satellite network in 2018, no one batted an eye. And now, that constellation may turn out to be bigger than any of us ever imagined.\n\nSpaceX\n\nStarlink is Musk's idea to broadcast high speed Internet down to the world from a satellite network in low-Earth orbit. The company, after obtaining permissions, first began deploying the first 60 satellites in May.\n\nThe plan was to launch an additional 1,584 satellites by 2024 and 2,200 more by 2027. Starlink had a main goal to eventually create a constellation of 12,000 satellites between 328 to 580 kilometers up.\n\nHowever, according to recent filings with the International Telecommunication Union (ITU), SpaceX is now aiming to send at least 30,000 Starlink satellites into orbit in the coming years.\n\nDon't Miss 159 K SHARES 41.9 K SHARES 15.3 K SHARES 5.7 K SHARES\n\nThe ITU is a global body, founded by the UN in 1865, that regulates information and communication technologies and helps international networks connect to each other. It's also responsible for allocating some of the global radio spectrum, as well as satellite orbits.\n\nThe US Federal Communications Commission made the filings on behalf of SpaceX, so clearly there's some level of governmental backing. Though the filing is made however, it's unclear how many satellites SpaceX will actually build and launch. They might just stop at 1,000 if the remainder prove uneconomical to launch.\n\nReuters\n\nBut even that number is enough to drastically change how we launch satellites. If over a thousand more objects are sent spinning around in a low orbit, that's half of all the satellites currently in orbit. In fact, we've only ever had about 9,000 objects in total floating around the Earth since the beginning of the Space Age in 1957.\n\nAnd SpaceX isn't the only company with big plans for a satellite network. Amazon and OneWeb also plan to set up satellite-powered Internet networks as well. And all of these spacecraft together can really create a lot of orbital clutter.", "description": "Tesla CEO Elon Musk is always looking for the next best thing. So when he decided to set up a globe-spanning Internet satellite network in 2018, no one batted an eye. And now, that constellation may turn out to be bigger than any of us ever imagined.", "authors": ["Gwyn D'Mello"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/starlink_1571384264_800x420.jpg", "published_at": "2019-10-18"}