{"pub": "metro", "url": "https://metro.co.uk/2019/10/09/justin-trudeau-asked-children-painted-face-brown-10888295", "downloaded_at": "2019-10-09 18:41:32.066361+00:00", "title": "Justin Trudeau asked by children why he painted his face brown", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nJustin Trudeau has been quizzed by children over his decision to paint his face brown.\n\nThe Canadian Prime Minister, 47, appeared on a Facebook Watch show called ‘New Mom, Who Dis?’, hosted by TV personality Jesse Cruickshank.\n\nDuring the show, which aired online today, Trudeau was faced with five young children who were allowed to ask him any questions they wanted.\n\nAt first he was questioned over whether he lives in a mansion, before two girls stood up and asked: ‘Why did you paint your face brown?’\n\nAdvertisement\n\nAdvertisement\n\nTrudeau looked slightly surprised at the question, immediately responding: ‘Ooh. It was something I shouldn’t have done because it hurt people.\n\nJustin Trudeau appeared on Facebook Watch series ‘New Mom, Who Dis?’ (Picture: New Mom, Who Dis?)\n\nHe apologised for his actions to the girls (Picture: New Mom, Who Dis?)\n\n‘It’s not something that you should do and that is something that I learned. I didn’t know it back then and I know it now, and I’m sorry that I hurt people.’\n\nThe girls then persisted with their questioning, asking again: ‘But did you paint your nose and your hands brown?’\n\nShocking moment pilot batters his coworker after they broke up\n\nNodding, Trudeau replied: ‘Mmm-hmm. Yeah. And it was the wrong thing to do.’\n\nTrudeau has recently come under fire after evidence of three separate instances in which he had dressed in brownface came to light.\n\nOne image showed the prime minister wearing dark make up to a party at a private school he had been teaching at in 2001.\n\nA picture of him dressed in brownface at a school function emerged (Picture: AP)\n\nThe video was filmed during the early 1990s (Picture: Global News)\n\nPrinted in the school yearbook, it was taken at an Arabian Nights-themed event, when Trudeau was 29.\n\nAnother image reveals Trudeau wearing brown makeup to sing Jamaican folk song Day O while in a high school talent show.\n\nA third video, shot in the early 1990s, shows him making faces while covered in dark make up, wearing a T-shirt and ripped jeans.\n\nAdvertisement\n\nAdvertisement\n\nIn his apology for images, Trudeau said: ‘Darkening your face, regardless of the context or circumstances, is always unacceptable because of the racist history of blackface.\n\n‘I should have understood that then and I never should have done it.’\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "The Canadian Prime Minister Justin Trudeau appeared on a Facebook Watch show called 'New Mom, Who Dis?', hosted by Jesse Cruickshank.", "authors": ["Lucy Middleton"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/justin-trudeau_1570639643.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-09"}