{"pub": "mirror", "url": "https://mirror.co.uk/sport/boxing/tyson-furys-sparring-partner-doubles-20708013", "downloaded_at": "2019-10-23 16:40:41.554911+00:00", "title": "Tyson Fury's sparring partner doubles down on glove tampering claim", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nTyson Fury's sparing partner Nicholas Asberry has doubled down on his claims that 'The Gypsy King' tampers with his gloves.\n\nAmerican Asberry, who has a professional record of nine wins and a defeat, accused former heavyweight champion Fury of taking the padding out of his gloves to hurt his sparing partners.\n\n\"Took the padding out of his gloves and still hits like new born baby,\" Asberry wrote on Instagram on Saturday, along with a video of him fondling some defective gloves.\n\nThe Illinois based heavyweight has now repeated the allegation and has gone into more detail.\n\n(Image: terror121990/Instagram)\n\n“Yes, I was shocked, p***ed and disappointed all at the same time,\" Asberry told World Boxing News. \"People get seriously hurt in boxing.\n\n“But the proof is in front of their faces. I have no reason to lie and neither does coach Barry (Robinson). The management team was aware and so was everyone at his camp.\n\n“I contacted them and they told me they would compensate me after the Wilder fight. They tried to talk me down and say they didn’t do anything to the gloves.\n\n(Image: Getty Images)\n\n“So, let’s say the possibility is that they didn’t. But as soon as I picked up the glove the inside was falling out. You could manipulate the part of the glove that makes contact with its target.\n\n“I showed in my screenshot conversations that they knew Tyson was sparring with gloves that were, to their account ‘dodgy’. The gloves just didn’t have all of the paddings in there.\n\n“They also had weird marks on the outside of the glove that showed it was in contact with something other than what it was made for.”\n\nFury's trainer Ben Davison vehemently denied the claims of 'dodgy gloves' in an angry post on Twitter .\n\n\"What do you think mate? Tyson/ or a team taking padding out his gloves to hurt sparring partners?!?\" Davison tweeted.\n\n\"When they only do 1-2 maybe 3 rounds at a time in and out? For THERE (sic) benefit! Funny how Tyson has great relationship with everybody he spars. Convenient timing too!\"", "description": "Nicholas Asberry accused former heavyweight champion Tyson Fury of taking the padding out of his sparring gloves", "authors": ["Alex Smith", "Image", "Instagram", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20708105.ece/ALTERNATES/s1200/0_Tyson-Furys-sparring-partner-doubles-down-on-glove-tampering-claim.jpg", "published_at": "2019-10-23"}