{"pub": "yahoo", "url": "https://sports.yahoo.com/charges-against-auston-matthews-indeed-blindsided-maple-leafs-030517888.html", "downloaded_at": "2019-09-28 01:12:55.196292+00:00", "title": "Charges against Auston Matthews indeed blindsided Maple Leafs", "language": "en", "text": "We’ll share points after every game throughout the Toronto Maple Leafs season.\n\nThe Montreal Canadiens proved to be the tonic for the Toronto Maple Leafs in the preseason. With the NHL-ready roster on Wednesday matching the 3-0 defeat the Marlies handed Montreal earlier in the week, the Leafs completed the home-and-home preseason sweep of the Canadiens in what might be the first and last test run for the lineup Mike Babcock will unveil on opening night.\n\nHere are two points from the win:\n\nScroll to continue with content Ad\n\nLeafs look ready. Mandatory Credit: John E. Sokolowski-USA TODAY Sports\n\nFirst Point: Matthews news blindsided Dubas\n\nWith the closest thing to an opening-night simulation, Wednesday’s win produced many talking points from a hockey standpoint. What happened on the ice, however, instantly became secondary the moment Kyle Dubas emerged in the dressing room to formally address the disorderly conduct charge laid against Auston Matthews.\n\nAfter Matthews admitted that he didn’t divulge the information with the Leafs — calling it “an error in judgement” in his post-game media session — Dubas revealed that he heard about the news the same way most did: on Twitter.\n\nDubas said he called Matthews immediately after finding out, and the two had the first of what promises to be many direct conversations moving forward.\n\n“He was very honest about it,” Dubas said. “No denying anything. He was very honest with me about what had happened. I would have liked to have known before, but I’m happy in the moment when he could have ducked away or deferred that he was honest with me.”\n\nDubas echoed the support from Matthews’ teammates and coach Mike Babcock, suggesting the Leafs will learn and improve from the incident.\n\nStory continues\n\n“When someone doesn’t meet the level of expectation that you have for them, or (they) have for themselves, it’s an opportunity for them to learn and to grow,” Dubas said. “And that’s how we’ll approach it.”\n\nAsked about whether or not the incident will impact the Maple Leafs’ decision to name a captain, Dubas said it wasn’t time to address the matter.\n\nSecond Point: These Leafs look ready\n\nSo these are the Toronto Maple Leafs, huh?\n\nYes, Montreal iced an incomplete roster and yes, two normally-reviewable plays that could have swung the scoreline in a different direction weren’t examined under the microscope because the NHL war room wasn’t up and running tonight for whatever reason. But the Leafs, fully operational for the first time in the preseason, looked dominant, comfortable and, most importantly, ready for the regular season through their performance Wednesday night.\n\nToronto submitted two 65-plus-percent possession periods and nearly doubled the Canadiens in shots with 49 placed on Kieth Kinkaid. Morgan Rielly and Auston Matthews logged big minutes, the power play converted, and each of the lines continued to look more and more comfortable.\n\nPlayers like Tyson Barrie and Alexander Kerfoot, who are locked into roster positions but haven’t necessarily impressed to this point, submitted their best performances, while Frederik Andersen continued to demonstrate superb preseason form with 26 saves for the shutout. The No. 1 netminder has allowed one goal across three preseason appearances.\n\nThere were standout performances from the Marlies-heavy lineup iced in the win over the Canadiens earlier in the week. But with not a single player looking out of place tonight, it’s become harder to build a case for one of them to unseat a player included in Mike Babcock’s NHL-ready lineup. And that includes Dmytro Timashov, who, while quiet, was mostly effective in his minutes, and even set up Martin Marincin for a high-danger look in the second period.\n\nIt’s been a long and tumultuous road to the regular season following the contentious Mitch Marner contract negotiations and now the allegations brought against Matthews. Hitting the season schedule running will be the best way to minimize the noise around the team, and the Leafs seem to be ready to do just that.\n\nMore Maple Leafs coverage on Yahoo Sports", "description": "The Toronto Maple Leafs are still reeling from the Auston Matthews news, but they have the look of a team ready to silence the noise.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/cyQHelOeooV.lYLyoAW5hg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD05NjA-/https://s.yimg.com/uu/api/res/1.2/64Zdh_vX2xdIX0x1qUSkNA--~B/aD0yODEyO3c9Mzc0OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/dd8b12b0-e008-11e9-b9ff-00f4ffa60d51", "published_at": "2019-09-26"}