{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7560461/Demi-Moore-56-shares-shocked-crazy-response-nude-Vanity-Fair-cover.html", "downloaded_at": "2019-10-11 00:30:15.414625+00:00", "title": "Demi Moore, 56, shares she was shocked by the 'crazy' response to her nude Vanity Fair cover", "language": "en", "text": "Demi Moore shocked the nation when she posed nude with her bare baby bump for the August 1991 cover of Vanity Fair.\n\nThe actress was seven months pregnant with her first daughter, Rumer Willis, at the time as she was photographed by Annie Leibovitz.\n\n'I was just trying to do the shoot reflective of how I felt,' the Ghost actress told Howard Stern on Wednesday as she promoted her new book Inside Out.\n\nAn open book: Demi Moore talked about her old Vanity Fair cover from 1991 where she posed while pregnant with her first daughter, Rumer, as she visited the Howard Stern show this week\n\nShocked: The world was stunned that the A list actress showed off her bare bump\n\n'It's like, you could celebrate finding out that you're pregnant and you could celebrate once you had the child, but in the in-between … we have to pretend like we never have sex. It's like this immaculate conception,' added the pinup.\n\nHoward told the icon that it was 'a revolutionary thing to actually do it' and it 'liberated everyone.'\n\nSome newsstands censored the cover.\n\nNude again: A year later she was nude again for Vanity Fair, this time without the bump and wearing body paint that made it seem as if she had on a suit and tie\n\n'I can't believe how crazy the response was, as if it was pornographic. How is that possible?' she wondered.\n\nThe shock jock then asked if she is angry that so many women have copied her cover. Mariah Carey, Britney Spears, Cindy Crawford and Jessica Simpson have since posed nude when pregnant.\n\n'I love it,' Demi said. 'It's incredibly complimentary … I like that we have the freedom to express that.'\n\nStill very slender: Demi posed nude again for the November cover of Harper's Bazaar\n\nA year later she was nude again for Vanity Fair, this time without the bump and wearing body paint that made it seem as if she had on a suit and tie.\n\nStern also asked the ex of Bruce Willis about the time she danced in a bikini for David Letterman's late-night show.\n\n'I definitely was uncomfortable,' she said.\n\nThe star wrote about her body in her new book. She used to heavily diet and work out to look every inch the Hollywood siren for her blockbuster films.\n\n'I didn't feel like I could stop exercising,' the ex of Ashton Kutcher writes in her book.\n\nRipped: Moore used to be obsessed with her body. And in her new memoir Inside Out, the star detailed how she used to heavily diet and work out to look great on film; seen in 1996's Striptease\n\nGym rat: 'I didn't feel like I could stop exercising,' the ex of Bruce Willis and Ashton Kutcher writes in her book\n\nThe craze began in 1992 when she as cast opposite Tom Cruise and Jack Nicholson in the military courtroom drama A Few Good Men.\n\nMoore wanted to look her best in the uniform she was asked to wear.\n\n'It was my job to fit into that unforgiving military uniform I'd be wearing in two months in A Few Good Men,' said the star, who had already made a name for herself in the films St Elmo's Fire and About Last Night... with Rob Lowe.\n\nNot much food: 'When I was making Striptease, for breakfast I would measure out a half cup of oatmeal and prepare it with water, then for the rest of the day I would have only protein and some vegetables — and that was it,' she said\n\n'Getting in shape for that movie launched the obsession with working out that would consume me over the next five years. I never dared let up.'\n\nBut when she was filming A Few Good Men she had just welcomed her daughter Scout.\n\nShe wanted the baby weight off. So she hit the gym hard.\n\nThe former Brat Packer started 'excessive exercising' but because she got so slim she did not have 'enough fat in her breast milk.'\n\nDemi was told to start giving the child formula. Though the cover girl was 'crushed' she didn't slow down on the exercise.\n\nNext came the movie Indecent Proposal with Robert Redford and Woody Harrelson. Robert's character pays $1M to sleep with the brunette, so she felt the pressure to look like a supermodel. And there was a sex scene.\n\n'I would be on display again, and all I could think about was my body, my body, my body,' she said.\n\n'I doubled down on my already over-the-top exercise routine. I cut out carbs, I ran and I biked and I worked out on every machine imaginable.'\n\nSlim siren: The craze began in 1992 when she as cast opposite Tom Cruise (pictured) and Jack Nicholson in the military courtroom drama A Few Good Men. Moore wanted to look her best in the uniform she was asked to wear. Also seen is Kevin Pollak\n\nHer babies: But when she was filming A Few Good Men she had just welcomed her daughter Scout. She wanted the baby weight off which made it hard to breastfeed\n\nThen she got sick. Moore came down with walking pneumonia, which made her take a break from the treadmill.\n\nThen there was another film that would put her body front and center: 1996's Striptease. This time she had to look as desirable as can be as she worked a stripper pole.\n\n'When I was making Striptease, for breakfast I would measure out a half cup of oatmeal and prepare it with water, then for the rest of the day I would have only protein and some vegetables — and that was it,' she said.\n\n'If all this obsessing about my body sounds crazy to you, you're not wrong: eating disorders are crazy, they are a sickness. But that doesn't make them less real.'\n\nAnother sexy role: Next came the movie Indecent Proposal with Robert Redford and Woody Harrelson\n\nNo Big Macs for her: Robert's character pays $1M to sleep with the brunette, so she felt the pressure to look like a supermodel. And there was a sex scene. 'I would be on display again, and all I could think about was my body, my body, my body,' she said\n\nThe vet finally stopped heavily dieting when she made G.I. Jane in 1997. The star had to actually put on muscle to play a naval officer.\n\n'My usual reaction would have been to start starving myself again, to begin an exercise regime designed to reduce the bulk, but I did neither,' said Moore, who also shaved her head for the role.\n\n'I had reached my limit,' she said. 'When I got home to Idaho, I had an epiphany in the shower one day: I just need to be my natural size.'", "description": "The actress was seven months pregnant with her first daughter, Rumer Willis, at the time as she was photographed by  Annie Leibovitz.", "authors": ["Heidi Parker For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/22/19559370-0-image-a-99_1570741951044.jpg", "published_at": "2019-10-10"}