{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7607847/Bella-Hadid-flaunts-cleavage-black-string-bikini-fashion-shoot-amid-busy-glamorous-day.html", "downloaded_at": "2019-10-24 08:05:14.734490+00:00", "title": "Bella Hadid flaunts cleavage in black string bikini top in fashion shoot amid busy and glamorous day", "language": "en", "text": "Bella Hadid continues living her best - and most glamorous - life.\n\nThe 23-year-old beauty took to Instagram on Wednesday with a sexy selfie as she wore a lacy black bra top with her black tresses styled into a bun on top, with braids cascading down.\n\nThe 5ft9 beauty was standing inside a tent with green foliage in the background.\n\nStunning: Bella Hadid, 23, took to Instagram on Wednesday with a sexy selfie as she wore a lacy black bra top with her black tresses styled into a bun on top with braids cascading down\n\nBella earlier Wednesday posted a shot on Instagram - where she has 26.4 million followers - from Amsterdam, where she did a shoot for Vogue Netherlands at the Rijksmuseum museum.\n\n'This day was so beyond memorable and to be part of the Dutch art issue makes me so proud to be a Dutchie. I love you Holland,' said the model daughter of Netherlands-born model Yolanda Hadid and businessman Mohamed Hadid.\n\nBella noted the Rembrandt pieces that moved her, including a portrait of Johannes Wtenbogaert and the painting, The Night Watch.\n\nShe later took to Instagram Stories where she documented relaxing in a bubble bath and enjoyed some room service.\n\nRelaxing: The stunning star decompressed with a bubble bath on her trip\n\nYummy: Bella had pizza, french fries and other goodies on hand in her hotel room\n\nThe good life: Bella earlier Wednesday posted a shot on Instagram - where she has 26.4 million followers - from Amsterdam, where she did a shoot for Vogue Netherlands at the Rijksmuseum museum\n\nShe earlier Wednesday stepped out in London, clad in a quirky ensemble of a tan outfit, that looked strikingly similar to a Ghostbuster costume. Bella wore a tan button up decorated with map of the world on it.\n\nThe model layered her uniform-like top over a black turtleneck. She completed her look with khaki pants and black chunky boots.\n\nThe stunning brunette wore her hair pulled back, and sported glam, bronzy make-up.\n\nInteresting look: On Wednesday, Bella, 23, got an early start on the holiday as she stepped out in London, clad in a quirky ensemble\n\nSimilar: The model was dressed in a tan outfit, that looked strikingly similar to a Ghostbuster costume\n\nArtsy: Bella wore a tan button up decorated with a map of the world on it\n\nOn October 9, Bella celebrated her 23rd birthday. This year's celebration was extra special, as she was joined by her on-off love, The Weeknd.\n\nThe couple had only split in August, but they appear to been on friendly terms, and are possibly back together.\n\nBella was celebrating her 23rd birthday with her sister Gigi and pals at Miss Lily's, before leaving the restaurant 'by herself' and getting 'into The Weeknd's car,' a source told E! News.\n\nKeeping warm: The model layered her uniform-like top over a black turtleneck\n\nWhat a beauty! The stunning brunette wore her hair pulled back, and sported glam, bronzy make-up\n\nInsiders have revealed that Bella received a birthday message from her ex The Weeknd, before leaving dinner in his car, according to E! News.\n\n'The Weeknd did reach out to Bella during the day to wish her a 'Happy Birthday' and they have been in touch,' another source told the site.\n\nDespite their reunion, it appears as though the two are staying single for now.\n\n'There is no bad blood between the two and they are on good terms right now. There isn't any chance of them getting back together right now but Bella never wants to have any anger or resentment towards anyone.'\n\nBella and The Weeknd began dating in around May 2015, after connecting the month before.\n\nThe couple would split in November 2016. The Weeknd would go on to date Selena Gomez from January until October 2017.\n\nThe following spring, the duo would begin dating again, before splitting up in August.", "description": "Bella earlier Wednesday posted a shot on Instagram from Amsterdam, where she did a shoot for Vogue Netherlands at the Rijksmuseum museum.", "authors": ["Adam S. Levy For Dailymail.Com", "Brittany Valadez For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/07/20118076-0-image-a-34_1571898872809.jpg", "published_at": "2019-10-24"}