{"pub": "scmp", "url": "https://yp.scmp.com/junior-reporters/top-10/article/114181/doing-it-right-your-number-one-goal-school-year", "downloaded_at": "2019-10-05 22:21:32.543667+00:00", "title": "Doing it right: Your number one goal this school year", "language": "en", "text": "Run up to the exams\n\nI’m in Form Six now, so my goal is to work as hard as possible so that I can get good results in my DSE exams. I don’t want to feel stressed during the exam period, so I will try my best to study at least 30 minutes every day.\n\nFarooq Kainat, 17, HKTA The Yuen Yuen Institute No. 3 Secondary school\n\nBetter than the last\n\nMy goal is to make this year better than the last. Last year was my first year as a senior. There were many things I wasn’t used to, such as the timetable and the new curriculum. Hopefully this year will be easier.\n\nTracy Chen Cheuk-tung, 16, Fung Kai Liu Man Shek Tong Secondary School\n\nTalking Points: what worries you the most about the upcoming school year?\n\nSurvivor\n\nThe usual. Get good enough grades. Make it to the end of the year. Survive.\n\nMichelle Chin, 15, Renaissance College\n\nHow to make time\n\nTime management is a big weakness of mine. I want to learn how to balance my time between work and play, as I enter this fast-paced world of Year Nine. I believe that sorting out my time and priorities is essential for a productive school life.\n\nYuhan Huang, 13, German Swiss International School\n\nHip hip hurrah\n\nI have set a few goals for myself this year, and the first on my list is to sign up for as many activities as possible. Since I am now in Form Five, this might be the last year I will have time to take part in extracurricular activities. That’s why I plan to join the cheerleading team and also plan to do some volunteer work.\n\nQueenwin Hau, 15, Fung Kai Liu Man Shek Tong Secondary School\n\nThe 9 best back-to-school tips to ensure you have fun and stay organised this year\n\nStay posistive\n\nMy goal is to keep a positive mindset. Most students put a lot of pressure on themselves to do well in their exams, and that can take a real toll on their mental health. I think being optimistic is a good way to give ourselves the boost we need. A little encouragement goes a long way, and it doesn’t have to come from other people. I will try to remember this and keep cheering myself on this year.\n\nDonna Izabel, 17, HKTA The Yuen Yuen Institute No. 3 Secondary School\n\nArabian dreams\n\nTo get into my dream university – New York University Abu Dhabi in the United Arab Emirates. It would mean the world to me if I could study there, so I am working hard preparing my application.\n\nCharlotte Fong, 17, International Christian School\n\nFor mother\n\nI want to make my mum proud. She has done a lot to put me in a position where I can reach for the things I want, and I want to make all her hard work and sacrifices worth it.\n\nCheryl Lai, 15, Renaissance College\n\nWhat is your first thought of the day?\n\nStep up and be counted\n\nStep out of my comfort zone. I want to start writing more and sharing my thoughts more, too. These are two thing that I am not comfortable doing. I believe with determination, my writing skills can improve and I can become more confident in speaking\n\nwith others.\n\nAudrey Lo, 16, Pui Ching Middle School\n\nBack to studying\n\nMy number one goal is to maintain the grades I’ve been getting so far, and to build good relationships with all my new teachers this year.\n\nDaniel Chung Ho-man, 15, Victoria Shanghai Academy\n\nFor our next Top 10, tell us:\n\nIf you could choose any person to be an exchange student at your school, who would you pick?\n\nSend your answer, together with your name, age and school, to reporters.club@scmp.com with “Top 10: texts” in the subject field. Our favourite answers will appear in next week’s Top 10 page!", "description": "We asked our readers what their objective is for the new academic year. From managing their time better to joining the cheerleading team, here are our favourite answers.", "authors": [], "top_image": "https://yp.scmp.com/sites/default/files/styles/900x506/public/images/shutterstock_228594847.jpg", "published_at": "2019-10-05"}