{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/help-buy-isa-deadline-looms-everything-need-know-11010788", "downloaded_at": "2019-10-30 16:04:43.775057+00:00", "title": "As the Help to Buy ISA deadline looms, here’s everything you need to know", "language": "en", "text": "The deadline is approaching for new savers (Picture: Getty)\n\nAs we’ve seen from pretty much all of the answers to the same question on our What I Rent series, the outlook on home ownership for many renters seems bleak.\n\nParticularly if you live in a big city and are already paying extortionate rents, it just doesn’t feel realistic to be able to save for a monumental deposit into the tens of thousands.\n\nThere are schemes out there to help ease this stress, but one of the most popular ones – the Help to Buy ISA – is about to end, so you better snap it up quick.\n\nLike many people, you might have buried your head in the sand about the possibility of saving for a deposit.\n\nWhile that’s absolutely understandable, this ISA has big benefits and means that this seemingly insurmountable task is actually doable with a little hard work.\n\nAdvertisement\n\nAdvertisement\n\nThat’s why it’s important to get in there now, to take advantage of all the benefits it offers. Here’s what you can get, and how to get involved before the deadline.\n\nWhat is a Help to Buy ISA?\n\nThe Help to Buy ISA is essentially a special type of bank account where the state adds up to 25% extra on top of your savings for a house.\n\nAs well as that, these ISAs have a higher interest rate than most savings accounts, so you could get 2.58% interest tax-free on what you put in.\n\nHow does it work?\n\nWhile unlimited free money would be ideal, there are some limits.\n\nIn the first month of your ISA, you can put in up to £1,200, which the government will give you your 25% bonus on. After that, the limit is £200 (which again will have the bonus).\n\nAlthough you can open the account with less than the £1,200 limit, the best way to maximise your bonus is to put in as much as you can first time around.\n\nIf you maximise the savings limits, you can make £3,400 into at least £4,250 not including interest.\n\nIt’s a tricky old business (Picture: Getty)\n\nThe maximum the government will add in total is £3,000, and you need to have saved at least £1,600 to get any bonus at all (which will net you £400 extra).\n\nAlthough the deadline to start the ISA is coming up, the government has stated they’ll continue the scheme until 2030, so you could continue paying into it until then.\n\nAdvertisement\n\nAdvertisement\n\nEven if you’re buying in the near future, though, it’s absolutely makes sense to start saving through a Help to Buy ISA, as there’s no minimum amount of time you can save for – again, you just need the minimum £1,600 saved to get your top-up.\n\nYou do have to use the money for a property, too. As it’s targeted at first-time buyers, you can purchase any home under £250,000 – or £450,000 in London – as long as you’re taking out a residential mortgage (rather than buy-to-let).\n\nUnlike some Help to Buy schemes, you don’t specifically need to buy a new build or have a Help to Buy mortgage (although you can if you want, of course).\n\nWho is eligible for a Help to Buy ISA?\n\nAny first-time buyers who are over 16 can open a Help to Buy ISA.\n\nThose who already own a home aren’t able to, which seems pretty fair really given you’ve already got a sweet, sweet property.\n\nCan you get a Help to Buy ISA if you’re a couple?\n\nYou can’t get a Help to Buy ISA as a couple, but you can get them individually as long as each of you are eligible.\n\nAs long as you’re both first-time buyers, you can each open them separately, saving up to £400 in total.\n\nIf your partner already owns property, you can still open a Help to Buy ISA yourself, putting away up to £200 a month.\n\nPlease don’t use this savings method (Picture: Getty)\n\nWhat are the downsides of a Help to Buy ISA?\n\nAdvertisement\n\nAs mentioned before, you can’t get a buy-to-let mortgage if you use a Help to Buy ISA to buy your property. If that’s part of your dastardly plans, this isn’t the scheme for you.\n\nAnother downside is that, as a government scheme, it could be subject to change in the years ahead. Although you technically have 30 years to do your savings, if the law changes in this time it might mean you’ll get no more ‘free’ cash.\n\nWhile not the end of the world, it does mean you should try to save as much as possible (up to the aforementioned limits) as quickly as possible. This will also help you make the most of your cash before prices rises over the years.\n\nThere’s also a caveat in that the 25% top-up that comes from the government won’t actually go through until the sale is completed.\n\nSo, while you can use the money you’ve personally put away as part of the ‘exchange deposit’, which is handed over when contracts are exchanged, and instead get the bonus as part of the ‘mortgage deposit’ that goes through upon completion.\n\nBasically, you’ll still need either 5% or 10% of the purchase price of your house up front (before the bonus) in most cases, but talk to your broker or bank to make sure.\n\nFor those of you unsure on buying a house, it’s worth noting, too, that you won’t get your bonus if you decide to take your savings out without purchasing. You will get your money back, as well as any interest due.\n\nAdvertisement\n\nYou can also make partial withdrawals if necessary, but the bonus will only be applied to the amount you have in the account when you do buy a house.\n\nDo your homework first, check if it’s the right option for you, and get in there quick if it is.\n\nWhy the Help to Buy ISA is being stopped and when it ends\n\nThe Help to Buy ISA closes to new savers on 30 November 2019.\n\nThis is to be replaced by the Lifetime Isa or LISA, a similar product for first-time buyers or those saving for retirement.\n\nIf you manage to get your foot in the door (with up to £1,200), however, you’re able to keep saving until November 2029, and claim your cash bonus from the government until November 2030.\n\nHow to set up a Help to Buy ISA\n\nYou set up a Help to Buy ISA as you would any other bank or savings account.\n\nDifferent banks will offer different interest rates and benefits, and you don’t have to open yours with the same bank you’re already with or the one you plan on getting your mortgage with.\n\nIt’s worth checking on comparison sites first to get the best deal for your needs.\n\nHow to claim your bonus when you buy a home\n\nRather than simply going straight into the ISA as you save, the government 25% top-up has to be claimed when you buy a house.\n\nYou’ll need to let your ISA provider know that you’re buying a house, at which point they’ll close the account and transfer over the money you’ve saved.\n\nThey’ll also send a letter to your solicitor that’ll allow them to claim the bonus for you, and this will be transferred upon completion.\n\nMORE: You can buy a Big Mac for just 99p from McDonald’s next week\n\nMORE: Woman’s self esteem dropped after brain tumour caused nose and chin to grow\n\nAdvertisement Advertisement", "description": "With less than a month to claim your Help to Buy ISA, we look at who is eligible and what you can benefit from.", "authors": ["Jessica Lindsay"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1140404399_1572450520.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-30"}