{"pub": "metro", "url": "https://metro.co.uk/2019/10/19/complicated-relationship-depression-sleep-10945877", "downloaded_at": "2019-10-19 10:40:28.063532+00:00", "title": "The complicated relationship between depression and your sleep", "language": "en", "text": "Depression can make it impossible to sleep, or it can make you want to sleep all the time. Weird, right? (Picture: Ella Byworth for Metro.co.uk)\n\nDepression and sleep have a complex relationship. Often, said relationship is very all-or-nothing, with the sufferer either finding their sleep insufferably broken and disturbed, or finding that they’re compelled to sleep for 17 hours a day.\n\nIt can be a bit of a chicken-and-egg situation, as the majority of people with depression will experience sleep disorders, but also a very high percentage of those with sleep disorders are depressed.\n\nIs one an after-effect of the other? Do they come hand in hand? Is it possible to have one without the other?\n\nFor a lot of people (including me), further investigation into disordered sleeping can be the first step on a path to a diagnosis of depression.\n\nWhen I was waking up at 3.45am every day, a quick Google (on my phone – not a great way to get back to sleep) suggested that I might be depressed and that disrupted sleep can often be a symptom.\n\nAdvertisement\n\nAdvertisement\n\nEqually, a list of search results for ‘can’t stop sleeping all day’ suggest the same diagnosis – but how can one illness have two totally opposite side effects?\n\nIt’s because depression is a tricksy little bitch that doesn’t play by anyone’s rules.\n\nDr Jane Woyka, Principal GP at Harrow Health Care Centre, tells Metro.co.uk: ‘For some, depression can lead to severe insomnia, where patients struggle to sleep or find that they are very restless waking often with a lack of REM sleep, which is important for recovery.\n\n‘In cases of depression as well as a lack of sleep, some patients feel a need to sleep constantly and struggle to stay awake. Insomnia and a constant feeling of sleepiness are obviously connected, so people with depression can get into odd patterns.’\n\nDepression can lead to sleep issues, sleep issues can lead to depression (Picture: Ella Byworth for Metro.co.uk)\n\nDr Woyka is keen to add that although there are a lot of medication options available to help you with any sleep dramas, medicine isn’t actually the best option.\n\n‘There are a number of over the counter products that can be used to treat insomnia, which usually contain an anti-histamine,’ she says. ‘Phenergan is a popular choice, and Piriton is often used for hay fever and causes drowsiness.\n\n‘For some patients stronger medication is required. However, as a GP it’s frowned upon if your patients are taking these sorts of drugs and we are advised to refer them to sleep clinics and psychiatrists to sort out the underlying issues.’\n\nAdvertisement\n\nAdvertisement\n\nUgh, underlying issues. You’ve said a mouthful there, doctor.\n\nOf course, there could be any number of physical ailments that are stopping you getting your kip; you might have sleep apnea, or sleepwalk, or be someone who involuntarily pokes themselves in the eye every five minutes. However, if you have depression then it’s likely that there are other factors contributing to your sleep patterns – it’s a really good idea to talk to your GP about it.\n\nIn the meantime, though, there are small changes you can try to make to encourage your body to be ready for sleep at the time you need to be. Sleep is all about your circadian rhythm; the internal process that regulates your body clock. P\n\naying close attention to when you’re processing lightness and darkness can really make a difference – which means putting down your phone when you’re in bed, buddy. Honestly, how many people have text you to say they can’t sleep? Unsurprising when you have a beam of bright light and all the information in the world held ten inches away from your face, mate.\n\nAnyway, Dr Kate Mason, a clinical psychologist, recommends tackling the following to make sure you really are giving yourself the best chance of a decent night of sleep.\n\nDr Kate Mason's five tips for sorting out your sleep: Remove distractions from your bedroom, and make it only about sleep Your bedroom should be a dedicated Zen palace of sleep. Too much noise, light or distraction can make sleep harder. So, make your room as dark as possible.” Don’t stay in bed if you’re really not sleeping ‘Don’t lie in bed tossing and turning, if you can’t sleep get up and move to another room. Do something that limits movement like reading a book or listening to some calming music. Then, when you are ready, return to your bedroom to sleep. This way, your brain will begin to associate your bed (and bedroom) purely with sleep and not sleep problems.’ Get into a routine bedtime Ok, this one might be less achievable with work schedules and social lives, but if sleep problems are really affecting you then this is really worth a try. ‘Research suggests that keeping a consistent bedtime is just as important as the length of time you sleep,’ says Kate. ‘Avoid naps in the day and don’t clock watch – have some self-compassion don’t tell yourself ‘I should be asleep now… I’ll only have 2,3 hrs sleep’ – this will only serve to increase your anxiety.’ Get outside (not at bedtime, though) ‘Depression wants you to stay indoors and shut the world out (and everyone in it) The though of going outside may seem like an impossible feat but fight that feeling and get outside. ‘Sunlight provides Vitamin D – a great mood enhancer. Not only that, seeing the sun frequently helps your circadian rhythms recalibrate and get back into a rhythm. ‘If you truly can’t face the outside world, at least open your curtains and let the day come to you.’\n\nIf you or a loved one is struggling with mental health, you can find a qualified local counsellor in your area with Counselling Directory. Mental health charity Mind also offer counselling services, and you can call The Samaritans on 116 123 (UK and ROI). The NHS even have a little quiz you can take. If you can, visit your GP for further advice.\n\nAdvertisement\n\nTo talk about mental health in a private, judgement-free zone, join our Mentally Yours Facebook group.\n\nNeed support? Contact the Samaritans For emotional support you can call the Samaritans 24-hour helpline on 116 123, email jo@samaritans.org, visit a Samaritans branch in person or go to the Samaritans website.\n\nMORE: Plants are now being prescribed to help people with anxiety and depression\n\nMORE: How to talk to your boss about your depression\n\nMORE: Brexit has triggered my anxiety and depression – and I’m not the only one\n\nAdvertisement Advertisement", "description": "Depression can cause insomnia or wanting to sleep all the time, but sleep issues can lead to depression. How do you get to sleep when you're depressed?", "authors": ["Kate Lucey"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2018/03/sleeping-at-work_1571472285.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-19"}