{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/10/07/jog-on-jolyon-court-throws-out-latest-anti-brexit-challenge", "downloaded_at": "2019-10-07 20:18:53.408475+00:00", "title": "Jog On, Jolyon: Court Throws Out Latest Anti-Brexit Challenge", "language": "en", "text": "Scotland’s Court of Session has dismissed a request for orders laying out Boris Johnson’s obligation to seek a Brexit delay and “the imposition of penalties” if he does not.\n\nThe case, fronted by Joanna Cherry, the MP for the left-wing Scottish National Party (SNP) who took the Government to court over prorogation, and serial litigant Jolyon Maugham, sought to secure “orders aimed at ensuring that the Prime Minister of the United Kingdom complies with the statutory duties imposed on him under the European Union (Withdrawal) (No 2) Act 2019” — better known as the Benn Act or, to its detractors, the Surrender Act.\n\nMaugham had boasted in late September that “We… have proceedings afoot in Scotland that we believe will bind the Prime Minister’s hands under, if necessary, pain of imprisonment to comply with the obligations placed on him by Parliament” to ask the EU for another Brexit delay — but, assuming this was in reference to the case dismissed today, he has not been successful.\n\nThe Opinion of Lord Pentland in the petition of DALE VINCE, JOLYON MAUGHAM QC and JOANNA CHERRY QC MP\n\nis now available and can be read in full via this link: https://t.co/8HP6LwSaIp — Courtsandtribunals (@SCTScourtstribs) October 7, 2019\n\nLord Pentland, who heard the case, ruled that because the Advocate General, representing Prime Minister Johnson, had assured the court that the PM would comply with the Act — despite previous public statements that he will not ask for a Brexit delay as it requires, and that Britain will indeed leave the EU on the current October 31st deadline — it would be “neither necessary nor appropriate” for the court to intervene.\n\nThe Prime Minister, Lord Pentland suggested, “now accepts that he must comply with the requirements of the 2019 Act and has affirmed that he intends to do so.”\n\nResponding to the ruling on social media, Maugham complained that he “would rather live in the world the Court believes continues to exist” — a world where the Prime Minister will not “renege” on his undertaking to the court to obey the Act — “But I doubt we do.”\n\nIn short, we've lost. THREAD — Jo Maugham QC (@JolyonMaugham) October 7, 2019\n\nIt should be noted, however, that today’s ruling was handed down by the Outer House of the Court of Session, which also ruled that the judges had no right to intervene on the question of prorogation.\n\nThat decision was overturned when it was appealed to Lord Carloway and his colleagues in the Inner House of the Court of Session, who ultimately received the backing of Lady Hale and the justices of the Supreme Court of the United Kingdom when they were asked to settle the matter.\n\nMaugham said that he “expect[s] the Inner House of the Court of Session tomorrow to hear our appeal” against this latest decision on the Benn Act.\n\nEU Celebrates Supreme Court Ruling, Say No Deal Now Less Likely https://t.co/qgj2fyaAUx — Breitbart London (@BreitbartLondon) September 28, 2019\n\nFollow Jack Montgomery on Twitter: @JackBMontgomery", "description": "A Scottish judge dismissed a request for court orders outlining \"the imposition of penalties\" if Boris does not seek a Brexit delay.", "authors": ["Jack Montgomery"], "top_image": "https://media.breitbart.com/media/2019/10/jolyon-640x335.png", "published_at": "2019-10-07"}