{"pub": "breitbart", "url": "https://breitbart.com/middle-east/2019/09/29/saudi-shoot-out-kings-bodyguard-shot-and-killed-in-personal-dispute", "downloaded_at": "2019-10-05 06:12:07.028115+00:00", "title": "Saudi Shoot-Out: King’s Bodyguard Shot and Killed in ‘Dispute’", "language": "en", "text": "A clash between a prominent bodyguard to Saudi Arabia’s King Salman and another “friend” of the ruler has seen the former shot and killed in what authorities described as a “personal dispute,” state TV reported Sunday.\n\nFew details on an incident that shocked the kingdom have been made available as tributes appeared on social media for Maj. Gen. Abdulaziz al-Fagham. He was killed in the Red Sea city of Jeddah, where the government relocates in the summer.\n\nImages on social media showed the bodyguard including one of him bending down to apparently help tie the shoes of King Salman, the 83-year-old ruler of the oil-rich kingdom.\n\nOthers show al-Fagham in the background of events with both King Salman and his predecessor, the late King Abdullah.\n\nThe first official word of the incident and subsequnt death came in a single tweet by Saudi state television.\n\n“Maj. Gen. Abdulaziz al-Fagham, bodyguard of the Custodian of the Two Holy Mosques, was shot dead following a personal dispute in Jiddah,” the tweet read.\n\nAl Fagham, local media reported, was popular among Saudis as he was always present with the late King Abdullah and King Salman, his successor.\n\nIn mid-2017, King Salman issued a royal order to promote Abdulaziz Al Fagham, which was considered an exceptional promotion to the rank of brigadier general.\n\nAccording to Saudi Press Agency (SPA), Al Fagham was at a friend’s house, when a common friend, Mamdouh Bin Meshaal Al Ali, joined them.\n\nA heated argument erupted between Al Fagham and Mamdouh, which led to the latter shooting the brigadier general and two others who were present at the house.\n\nThe shooter tried to escape, randomly shooting at police surrounding the scene, injuring five policemen.\n\nMamdouh was shot dead, according to SPA.", "description": "A prominent bodyguard to Saudi Arabia’s King Salman has been shot and killed in what authorities described as a personal dispute.", "authors": ["Simon Kent"], "top_image": "https://media.breitbart.com/media/2019/09/Abdulaziz-al-Fagham-640x335.jpg", "published_at": "2019-09-29"}