{"pub": "politico", "url": "https://politico.com/news/2019/10/11/trump-loses-appeal-to-withhold-financial-records-from-democrats-000283", "downloaded_at": "2019-10-11 19:43:51.519676+00:00", "title": "Trump loses appeal to withhold financial records from Democrats", "language": "en", "text": "The 66-page opinion against Trump backs Congress by citing a long history of lawmakers using subpoenas to demand information in connection with investigations. The two Democrat-appointed judges in the majority leaned on more than two centuries of history, including Watergate-era precedent that “strongly implies that Presidents enjoy no blanket immunity from congressional subpoenas.”\n\nDemocrats leading the House Oversight and Government Reform Committee issued the subpoena in mid-April seeking financial records from Trump’s longtime accounting firm, Mazars USA, related to work it did for the president before and after he took office.\n\nTheir demands came well before the House launched a broad impeachment inquiry of Trump for his efforts to pressure Ukraine into investigating his political opponents, including former Vice President Joe Biden.\n\nAt the time, Democrats said they wanted the information to help them consider whether changes were needed to government ethics laws. Trump has rejected decades of precedent by refusing to release his tax returns.\n\n“Today’s ruling is a fundamental and resounding victory for Congressional oversight, our Constitutional system of checks and balances, and the rule of law,” Oversight Chairman Elijah Cummings (D-Md.) said Friday. “For far too long, the president has placed his personal interests over the interests of the American people.”\n\nSpeaker Nancy Pelosi called the decision \"a victory for our democracy, as the courts reaffirm the Congress’s authority and responsibility to conduct oversight and consider legislation on behalf of the American people.\"\n\nTrump lost his initial challenge in May before a lower federal judge who said it wasn’t the district court’s role to second-guess the committee’s claims. The president then responded with an appeal in which his lawyers argued Democrats weren’t trying to write legislation but instead were just trying to target Trump.\n\n“It’s law enforcement, that’s the real object, “ Trump attorney William Consovoy said during oral arguments before the D.C. Circuit in July, slamming the House effort as “hyperfocused on one individual.”\n\nTrump's team has a couple of options going forward after Friday's loss. It can either ask for another review by the entire D.C. Circuit, which currently includes 11 active judges — seven appointed by Democratic presidents and four named by Republicans. Or he can turn to the Supreme Court.\n\nJay Sekulow, a personal attorney for the president, said in a brief interview that the Trump legal team was “reviewing the opinion and evaluating options including additional appeals.” In a separate statement, Sekulow said the team was also reviewing the lone dissent from Trump-appointed Judge Neomi Rao, adding, “we continue to believe that this subpoena is not a legitimate exercise of Congress’s legislative authority.”\n\nFriday's majority opinion comes at the end of a rough week for the president on the legal front.\n\nA federal judge in Manhattan released a blistering ruling Monday against Trump, slapping down the president's attempt to stop a New York City prosecutor from obtaining his tax and financial records from Mazars as part of a criminal investigation.\n\nOn Tuesday, the chief judge of the federal district court in Washington signaled during a hearing that she might allow House Democrats access to special counsel Robert Mueller's grand jury materials as part of its impeachment effort.\n\nThen on Wednesday, two foreign-born associates of Trump personal attorney Rudy Giuliani were indicted on campaign finance charges that include alleged schemes to deploy political influence on behalf of both a Ukrainian government official and a Russian businessman.\n\nNow comes the D.C. Circuit, widely seen as the second most important court in the country after the Supreme Court, which said the subpoena from the House Oversight and Government Reform Committee fell well within Congress’ power to determine how to wield its legislative power.\n\nTatel noted that the Constitution gives Congress specific authority to regulate what gifts and payments the president and other foreign officials can accept from foreign sources. The Bill Clinton appointee said that was sufficient grounds for the House to explore Trump’s sources of income.\n\n“If the President may accept no domestic emoluments and must seek Congress’s permission before accepting any foreign emoluments, then surely a statute facilitating the disclosure of such payments lies within constitutional limits,” Tatel wrote. “That is enough. Without treading onto any other potentially fertile grounds from which constitutional legislation could flower, we conclude that given the constitutionally permissible options open to Congress in the field of financial disclosure, the challenged subpoena seeks ‘information about a subject on which legislation may be had.’”\n\nTatel also rejected Trump’s arguments that the committee lacked authority to issue the subpoena without a full, floor vote in the House.\n\n“We … have no authority to impose such a requirement on the House,” Tatel wrote. “Unless and until Congress adopts a rule that offends the Constitution, the courts get no vote in how each chamber chooses to run its internal affairs.”\n\nLurking in the background of the dispute over Trump’s financial records is the issue most riveting Washington: impeachment.\n\nRao stopped short of saying that the House could get the records as part of an impeachment inquiry. But she said that was the only valid avenue open to lawmakers.\n\n“Allegations of illegal conduct against the President cannot be investigated by Congress except through impeachment,” the Trump appointee wrote, adding: “As the Committee has not raised the impeachment power as a basis for this subpoena, questions regarding whether such a subpoena could issue under the impeachment power are outside the scope of this opinion.”\n\nRao, a conservative whose legal philosophy calls for examining the meaning of the Constitution at the time it was adopted, argued it is clear Congress can’t dress up an impeachment as an inquiry aimed at crafting legislation.\n\n“Founding Era practice confirms the Constitution’s original meaning — investigations of unlawful actions by an impeachable official cannot proceed through the legislative power,” she wrote.\n\nTatel said Rao’s stance was a radical one that would effectively force many disputes between the White House and the Congress into impeachment.\n\n“The dissent cites nothing in the Constitution or case law — and there is nothing — that compels Congress to abandon its legislative role at the first scent of potential illegality and confine itself exclusively to the impeachment process. Nor does anything in the dissent’s lengthy recitation of historical examples dictate that result,” Tatel wrote. “The dissent would reorder the very structure of the Constitution.”\n\nTatel also warned that Rao’s position would create a “Hobson’s choice” of “impeachment or nothing.”\n\nRao’s opinion could contribute to arguments from many Republicans and some Democrats that a House vote on impeachment would strengthen the House’s hand in a slew of pending legal disputes with Trump and his administration.\n\nHowever, since Rao was in dissent, the main issue is whether her legal and historical arguments — which ran slightly longer than the the majority opinion — influence other judges or the Supreme Court.\n\nThe Trump appointee’s position would also have potentially wide-ranging implications because she said the limits on Congress’ investigative power applied not only to the president but all other “impeachable officials” — a group that includes senior executive branch officials and judges. It was unclear how her approach could affect the Senate’s power, since it has no role in impeachment.\n\n", "description": "", "authors": [], "top_image": "https://static.politico.com/76/da/d958773849d6824cf4348efd4d0b/191011-donald-trump-ap-773.jpg", "published_at": "2019-10-11"}