{"pub": "huffpost", "url": "https://huffpost.com/entry/democrats-trump-administration-misinformation-misinformation-attack-us-diplomat_n_5d95489fe4b0f5bf796f124d", "downloaded_at": "2019-10-03 07:09:45.935336+00:00", "published_at": "2019-10-03", "title": "Democrats Say Trump Administration Used Misinformation To Attack U.S. Diplomat", "language": "en", "text": "WASHINGTON, Oct 2 (Reuters) - Democrats accused the Trump administration on Wednesday of using “propaganda and disinformation” to attack the former U.S. ambassador to Ukraine and demanded that Secretary of State Mike Pompeo explain how the material circulated at top levels of his department.\n\nThe Democrats, who are pursuing an impeachment probe of President Donald Trump, leveled the charge after State Department Inspector General Steve Linick delivered a package of documents to a hastily called hour-long briefing with staff for eight congressional committees.\n\n“We are now in possession of this packet of propaganda and disinformation,” said Democratic Representative Jamie Raskin, the only lawmaker who joined committee staff members at the meeting. “The real question is where did it come from and how did it end up in our lap?”\n\nPhotographs of some of the documents, seen by Reuters, promoted unsubstantiated conspiracy theories about Marie Yovanovitch, the former U.S. envoy to Ukraine, who was removed from her post in May, months before she was due to leave, after Trump allies accused her of disloyalty.\n\nMultiple meeting participants, speaking on condition of anonymity, said the materials arrived at the State Department this spring and that Linick passed them on to the FBI.\n\nThe materials were inside an envelope marked “White House”that contained folders labeled “Trump Hotel,” said a statement issued by the Democratic chairmen of the House of Representatives intelligence, oversight and foreign relations committees.\n\nThe documents “reinforce concern that the president and his allies sought to use the machinery of the State Department to further the president’s personal political interests,” they said.\n\nThe meeting with Linick came as the Democratic-led U.S. House looks at whether Trump pressured Ukraine to investigate a Democratic political rival, former Vice President Joe Biden, and his son, Hunter, who was a director of a Ukrainian energy firm.\n\nFollowing a whistleblower complaint released last week,Democrats launched the impeachment inquiry focusing on a July 25 call in which Trump asked Ukrainian President Volodymyr Zelenskiy to investigate Biden, a Trump rival in the president’s race for re-election in 2020, and his son.\n\nPompeo said on Wednesday during a visit to Rome that he had listened in on Trump’s call with Zelenskiy.\n\nPhotographs of documents delivered by Linick to Congress included what appeared to be a cover sheet addressed to Pompeo on White House stationery.\n\nOne document, whose source was not disclosed, described a discredited theory promoted by Trump allies that Yovanovitch was installed in her post by billionaire George Soros, a Democratic donor frequently attacked by far-right activists.\n\n“Until she is removed Soros has as much, or more, power over Yovanovitch as the President and the Secretary of State,” said the document.\n\nAlso in the packet was an email from John Solomon, a pro-Trump columnist for The Hill newspaper, to pro-Trump lawyers Victoria Toensing and Joe DiGenova, and Lev Parnas, a Soviet-born businessman who has been aiding Trump’s personal lawyer, Rudy Giuliani.\n\nThe email contained a report by Solomon that the U.S.Embassy in Kiev pressed Ukrainian authorities to end an investigation into an anti-corruption group supported by Soros during the 2016 U.S. election.\n\nThe report also quoted a former Ukrainian prosecutor assaying Yovanovitch had given him a list of people, including Soros allies, who should not be prosecuted. The State Department has vehemently denied such a list existed.\n\nGiuliani, who has called Parnas one of his clients, has been a leading promoter of the unsubstantiated allegation that Biden, while vice president, pressured Ukraine to fire a prosecutor investigating the company in which his son was a director. The prosecutor has said the probe pre-dated Hunter Biden’s role in the company.\n\nThe White House, State Department, Solomon, Toensing and DiGenova did not immediately respond to requests for comment.\n\nBob Menendez, the top Democrat on the Senate Foreign Relations Committee, said the materials provided by Linick appeared “to contain long-debunked theories and false statements about the former U.S. ambassador to Ukraine and one of PresidentTrump’s political opponents.”\n\nHe demanded an explanation of Pompeo’s role.\n\nBefore the meeting, congressional sources had told Reuters the session with Linick would focus on potential political retaliation against career State Department diplomats by the department’s leadership.", "description": "Democrats, who are pursuing an impeachment probe of President Trump, received a package of documents from State Department Inspector General Steve Linick.", "authors": [], "top_image": "https://img.huffingtonpost.com/asset/5d954ac32100004a01f9ac87.jpeg?cache=pnmqbvya1z&ops=1778_1000"}