{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/barbara-windsor-can-no-longer-20422035", "downloaded_at": "2019-10-05 10:22:20.593885+00:00", "title": "Barbara Windsor can no longer remember what her friends do, says Biggins", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nChristopher Biggins has opened up about his good friend Dame Barbara Windsor and revealed the saddest realities about her ongoing battle with Alzheimer's disease.\n\nDuring an interview on the Jeremy Vine show on Friday, the legendary TV personality, 70, gave an update on Barbara, 82, and her health.\n\nChristopher revealed that he regularly visits the British screen icon and last saw her a \"couple of weeks ago\".\n\n(Image: Twitter)\n\nChristopher went on to chat about his lunches with his old pal, as the symptoms of her dementia­ become more pronounced.\n\nTV favourite Biggins confessed: \"She is up and down. That's the best way of describing it.\"\n\nThe pantomime star revealed his dear friend, who was diagnosed with Alzheimer's in 2014 , was repeating questions and asking him where he lives when they recently met.\n\nGiving credit to Barbara's husband, Christopher insisted that \"Scott is incredible\" and he and Barbara are always laughing every time they meet.\n\n(Image: Twitter)\n\n(Image: Twitter)\n\nHe told Jeremy: \"I did a programme about going back to my home town Salisbury; it was a cooking programme and Scott rang me to say that Barbara had watched it.\n\n\"He rang me and said 'every time you come on, she screams with laughter'!\"\n\nRevealing she can remember the past \"brilliantly\", Christopher said it is Barbara's short-term memory that is not so good.\n\nHe sadly explained: \"She must ask me 100 times where are you living now and what is it that you're doing?\n\n\"She recognises me, it's just catching up with the new stuff.\"\n\n(Image: Twitter)\n\nHe went on to speak about how she can \"start singing songs\" when he talks to her.\n\nHe recalled a special moment from their recent catch-up. He said: \"We did an old-time musical together years and years ago and the other days she started singing The Boy I Love is Up in the Gallery from it.\n\n\"It was wonderful. The sensitivity is there and she remembers that.\"\n\nHe proudly added: \"She is such an icon and I think it's marvellous that she has made people very much aware of dementia.\"\n\nBiggins backs Dame Barbara’s call for better social care for dementia patients and believes the government relies too much on families to care for elderly relatives.\n\nChristopher lost his mother at the age of 93 and, at the very end of her life, she also showed signs of dementia.\n\nBarbara was recently appointed as an ambassador of the Alzheimer's Society alongside her husband Scott.\n\nThe couple launched an open letter asking the public to sign up and join the Alzheimer’s Society Fix Dementia Care campaign.\n\nChristopher and Barbara's friendship spans 30 years since they toured the nation in musical Guys & Dolls.\n\nIn his anecdotes, Biggins is very matter-of-fact about life – and death, believing it can sometimes even be a kindness, as in the case of another of his close friend, Cilla Black, who died in 2015 after a stroke.\n\nHe is one of the biggest stars in showbiz with a star-studded repertoire of features. In the 1970s he won plaudits for his acting roles in I, Claudius, Poldark and much-loved comedy Porridge.\n\nBiggins became prime time again when he won I’m a Celebrity…Get Me Out of Here! in 2007.", "description": "Barbara Windsor's great friend, Christopher Biggins, has opened up about his relationship with the actress and her life with dementia", "authors": ["Tiffany Wallis", "Image", "Twitter"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20422928.ece/ALTERNATES/s1200/1_Barbara-Windsor.jpg", "published_at": "2019-10-04"}