{"pub": "cnn", "url": "https://cnn.com/2015/11/26/middleeast/recep-tayyip-erdogan-fast-facts/index.html", "downloaded_at": "2019-10-13 03:51:04.100363+00:00", "title": "Recep Tayyip Erdogan Fast Facts", "language": "en", "text": "(CNN) Here's a look at the life of Recep Tayyip Erdogan , president and former prime minister of Turkey.\n\nPersonal:\n\nBirth date: February 26, 1954\n\nBirth place: Istanbul, Turkey\n\nBirth name: Recep Tayyip Erdogan\n\nFather: Ahmet Erdogan, coastguard and sea captain\n\nMother: Tenzile Erdogan\n\nMarriage: Emine (Gulbaran) Erdogan (July 4, 1978-present)\n\nChildren: Two daughters and two sons\n\nEducation: Marmara University, Faculty of Economics and Administrative Sciences, 1981\n\nReligion: Muslim\n\nOther Facts:\n\nActive in Islamist circles in the 1970s and 1980s.\n\nBefore his political career, Erdogan was a semi-professional football (soccer) player.\n\nErdogan has also been heavily criticized for failing to protect women's and human rights, curbing freedom of speech and attempting to curb Turkey's secular identity.\n\nUnder Erdogan and his ruling Justice and Development Party (AKP), Turkey has lifted restrictions on public expression of religion , including ending the ban on women wearing Islamic-style headscarves.\n\nHas called social media \"the worst menace to society.\"\n\nTimeline:\n\n1984 - Elected as a district head of the Welfare Party.\n\n1985 - Elected as the Istanbul Provincial Head of the Welfare Party and becomes a member of the central executive board of the party.\n\n1994-1998 - Mayor of Istanbul.\n\n1998 - The Welfare Party is banned. Erdogan serves four months in prison for inciting religious hatred after reciting a controversial poem.\n\nAugust 2001 - Co-founds the Islamist-rooted Justice and Development Party (AKP).\n\n2002-2003 - Erdogan's AKP wins the majority of seats in parliamentary elections, and he is appointed prime minister.\n\n2003-2014 - Serves as prime minister.\n\nJune 2011 - AKP wins by a wide margin in the parliamentary elections, securing a third term for Erdogan.\n\nJune 2013 - Anti-government demonstrations target Anti-government demonstrations target Erdogan's policies, including his plan to turn a park into a mall , and call for political reforms. Thousands are reported injured in the clashes.\n\nDecember 2013 - Corruption probe begins which investigates more than 50 suspects, including members of Erdogan's inner circle. The following month, the government dismisses 350 police officers amid the investigation. Ten months later, the prosecutor drops the inquiry.\n\nMarch 2014 - After After Erdogan threatens to \"eradicate\" Twitter at a campaign rally, Turkey bans the social media site, and a two-week countrywide blackout ensues.\n\nAugust 10, 2014 - Erdogan is elected president during the first-ever direct elections.\n\nNovember 2014 - At a summit hosted by a women's group in Istanbul, Erdogan says that At a summit hosted by a women's group in Istanbul, Erdogan says that women and men are not equal \"because their nature is different.\" It's not the first time the Turkish leader has made controversial comments about women: previously, he told Turkish university students that they shouldn't be \"picky\" when choosing a husband and has called on all Turkish women to have three children.\n\nOctober 12, 2017 - Erdogan accuses the United States of Erdogan accuses the United States of sacrificing its relationship with Turkey in a speech made days after the arrest of a US consular staff member and the announcement that he refuses to recognize the authority of US ambassador, John Bass . Erdogan blames Bass and other officials left over from the Obama administration for sabotaging relations between the two countries.\n\nJune 24, 2018 - Is Is re-elected president", "description": "See CNN's Recep Tayyip Erdogan Fast Facts for a look at the life of the Turkish president and former prime minister.", "authors": ["Cnn Library"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/141126100124-erdogan-flag-super-tease.jpg", "published_at": "2015-11-26"}