{"pub": "npr", "title": "A New Treatment Can Relieve Food Allergies, But Few Doctors Offer It", "url": "https://npr.org/sections/health-shots/2019/02/21/696658000/a-new-treatment-promises-relief-for-food-allergies-but-few-doctors-offer-it", "language": "en", "published_at": "2019-02-21", "downloaded_at": "2019-09-02 07:23:37.874422+00:00", "text": "A New Treatment Can Relieve Food Allergies, But Few Doctors Offer It\n\nEnlarge this image toggle caption Cat Gwynn/Getty Images Cat Gwynn/Getty Images\n\nScouring ingredient lists. Carrying an EpiPen. Sitting at the special lunch table at school. These anxiety-ridden measures have become routine for families with severe food allergies, who know it takes only one wrong bite to end up in the emergency room.\n\nNearly 6 million U.S. children and teens — about 8 percent, or two per classroom — have food allergies. In children, allergy to peanuts, which can be life-threatening, has gone up more than 21 percent since 2010.\n\nSome of these kids — as well as adults with severe food allergies — are trying a new treatment. And they're not waiting around for the Food and Drug Administration to approve it. The treatment, known as oral immunotherapy, involves consuming tiny amounts of the trigger food, with gradual increases in dose. Over time, the immune system learns to react less vigorously to the allergen.\n\nBecause there's not yet an FDA-approved version of this treatment, most medical providers don't yet offer it. So most patients can get it only by enrolling in research studies, of which there have been dozens in recent years.\n\nWhen Whitney Block, a clinical research nurse who helped run oral immunotherapy trials at Stanford University, saw that more than 2,000 people were on the waitlist to get into these studies, she decided to start offering oral immunotherapy on her own. In 2017, Block, a nurse practitioner specializing in the treatment of allergies, opened her own clinic, National Allergy Center, in Redwood City, Calif., and just launched a second site in Southern California.\n\n\"What I've done and continue to do in research trials I've brought out to private practice to make it available to more people,\" Block says. Patients have flown to the clinic from the East Coast and even from Bulgaria and the United Arab Emirates.\n\nBlock joins a small but growing number of providers around the U.S. who have begun offering the therapy without enrolling patients in trials. Just four board-certified allergists offered oral immunotherapy for food allergies in 2010, but the number surpassed 100 by 2017, according to the website OIT 101, which is run by parents who've had success with oral immunotherapy and maintains a directory of providers.\n\nThe therapy is not a cure. People who get the treatment still have to read labels and cannot eat whatever they want. And the vast majority have to continue the treatments indefinitely to keep their tolerance. For peanut allergy, for instance, they would need to continue to consume roughly one peanut per day.\n\nYet for many, to be able to tolerate even one or two whole peanuts without symptoms is life-changing. \"It provides that additional margin of safety,\" says Dr. Brian Vickery, an allergist-immunologist at Emory University. \"By undergoing this type of treatment, they can move around in the world with more peace of mind.\"\n\nVickery was the lead author of a paper published in November 2018 in the New England Journal of Medicine that described encouraging results from a placebo-controlled study of peanut protein capsules developed by Aimmune Therapeutics. (He formerly worked at and serves on the board for Aimmune Therapeutics.) While it's possible for clinicians to offer the treatment simply with commercially available peanut flour, Aimmune's product, AR101, offers a standardized dose suitable for rigorous study and FDA approval.\n\nThe South San Francisco biopharmaceutical company tested AR101 in 551 peanut allergy sufferers at 66 sites. At the end of the 12-month trial, more than two-thirds of the group taking the active drug were able to tolerate a dose of peanut protein equivalent to about two peanut kernels. Based on Aimmune's recent results, the company submitted a licensing application to the FDA for its peanut capsules in December. It could be approved in 2019, and approval could lead to broader use of the treatment and to insurance covering it.\n\nDBV Technologies of Montrouge, France, is developing another form of immunotherapy that delivers peanut protein to the immune system through a small skin patch. The company plans to resubmit a licensing application for this product, Viaskin Peanut, in response to the FDA's request for more data on manufacturing procedures and quality controls.\n\nWhile these products work their way toward approval, the vast majority of providers are not yet offering oral immunotherapy to their patients, except as part of a research trial. \"Physicians are concerned that without FDA approval, if something goes wrong, they're going to be held liable,\" says Dr. Christina Ciaccio, a pediatric allergist at the University of Chicago Medicine, who has helped run trials for companies developing peanut allergy treatments.\n\nAt a national immunology meeting in San Francisco this Sunday, experts will debate whether the treatment is ready to go mainstream. The \"yes\" side will be presented by Dr. Richard Wasserman, who started offering the treatment to patients at Dallas Food Allergy Center in July 2008. Since then, the clinic has treated more than 800 people for allergies to 20 foods. \"The response of patients and families to oral immunotherapy has been the most rewarding thing I have done in 40 years of medical practice,\" Wasserman says.\n\nOn the \"no\" side is Dr. Robert Wood, a pediatric allergist at Johns Hopkins Hospital, who has published a study that noted that the degree and duration of protection offered by immunotherapy is unknown and that allergic reactions are common during the treatment.\n\nMany families find the therapy stressful. At some points during the regimen, often on days the doses increase, most patients experience skin rashes, itching in the mouth, abdominal pain and other unwelcome side effects. And it doesn't work for everyone. In the recent trial of Aimmune's peanut capsules, 10 percent of the participants 17 and under who received the active drug needed rescue epinephrine during the exit food challenge at the end of the study.\n\n\"If you have lived your life thinking this stuff is poisonous and can kill you ... and now the treatment is in fact ... to take a little bit of it in food every day, that's a difficult thing for people to wrap their heads around, particularly when they start to experience symptoms,\" Vickery says.\n\nIn addition, immunotherapy requires certain precautions that can hinder daily activity. For instance, patients must avoid exercise, hot showers and anything else that elevates the body temperature for several hours after dosing.\n\nBecause of the difficulty of the treatment and the risks, clinicians caution against patients trying this on their own. \"There is potential for serious side effects,\" warns Block. \"You definitely need medical oversight.\"\n\nOral immunotherapy treatment \"is not going to be suitable and appropriate for everyone,\" says Ciaccio. But she says emerging treatments for food allergies \"will continue to be a hot topic.\"\n\n\"We need more than one — just like we need more than one treatment for diabetes,\" she says.\n\nEditor's note, 3/1/2019: This story has been updated to include information about the researchers' relationships with companies developing pharmaceutical products for the treatment of allergies.\n\nEsther Landhuis is a freelance science journalist in the San Francisco Bay Area. Find her on Twitter: @elandhuis.", "description": "Many parents of kids with life-threatening food allergies live with fear, EpiPen in hand. Some are trying oral immunotherapy, a treatment that can help patients build tolerance to foods like peanuts.", "authors": ["Esther Landhuis"], "top_image": "https://media.npr.org/assets/img/2019/02/21/food-allergy-peanut_wide-8b3cbc13cc4bb4a394cc1d4ddfed642b54da35ce.jpg?s=1400"}