{"pub": "businessinsider", "url": "https://businessinsider.com/miami-dolphins-shut-out-patriots-tank-2019-9", "downloaded_at": "2019-09-15 23:15:12.549805+00:00", "title": "Miami Dolphins put forth another pathetic effort, losing to Patriots 43-0 as tanking efforts appear to be working", "language": "en", "text": "The 2019 Miami Dolphins are the worst team the NFL has seen in some time.\n\nAfter starting the season with a 59-10 loss to the Baltimore Ravens in Miami, the Dolphins came back with an arguably more pathetic effort in Week 2. They were shut out by the Patriots 43-0 in front of their home fans.\n\nThe Dolphins were never really in the game against the Patriots on Sunday. /they went three-and-out on their opening drive and quickly gave up a touchdown to give New England a lead that would only grow. Four of Miami's five drives in the first half would end in a three-and-out, with the Patriots taking a 13-0 lead into the break.\n\nRead more: It only took the Miami Dolphins 30 minutes of awful football to make a case as the worst team in the NFL this year\n\nThings would get decidedly more depressing in the second half. After three more three-and-out drives from the Miami offense, Ryan Fitzpatrick would throw pick-sixes on consecutive possessions to turn the game from a frustrating shut out to an embarrassing blow out.\n\nThe first pick-six came as the Dolphins finally breached Patriots territory for what felt like the first time in the game.\n\nJust four plays later, a tipped ball left Fitzpatrick to connect with the Patriots again for his second touchdown of the game going in the wrong direction.\n\nOne stat from the game put the blow out in painful context.\n\nFitzpatrick would get pulled in favor of second-year quarterback Josh Rosen after that, but things wouldn't improve much for the Dolphins offense.\n\nThe depressing loss only furthers the Miami front office's effort to tank through the 2019 season in favor of acquiring draft picks and planning for the future.\n\nThe Miami front office's intentions became clear before the start of the season when they traded away left tackle Laremy Tunsil and wide receiver Kenny Stills to the Houston Texans in exchange for draft picks. It was a move that was said to have threatened to spark a \"revolt\" from the Dolphins' players.\n\nThen, after their opening loss to the Ravens, multiple players reportedly requested to be traded.\n\nRead more: Multiple Dolphins players reportedly requested to be traded after embarrassing 59-10 loss because the team is tanking\n\nOn Sunday, the Dolphins once again looked uninspired, and it's hard to see how things get better from here.\n\nMiami might be planning for 2020, but the team still has to find a way to get through 14 more games in the 2019 season before the promise of next year's draft can come to fruition.\n\nIf the first two weeks are any indication, it's going to be a painful year for Dolphins fans.\n\nJags star Jalen Ramsey and head coach Doug Marrone get into shouting match and had to be separated on sideline\n\nAntonio Brown scores his first touchdown with the New England Patriots\n\nFire erupts on Tennessee Titans field before NFL game when a pyrotechnics device malfunctioned\n\nAlabama running back Najee Harris hit the truck stick, hurdled a defender, and shouted out Megan Rapinoe to score the most spectacular TD of the college football season so far", "description": "The Miami Dolphins are the worst team in the NFL, and it doesn't look like things are going to get better any time soon.", "authors": ["Tyler Lauletta"], "top_image": "https://amp.businessinsider.com/images/5d7e9ff52e22af058f656bb4-1920-960.jpg", "published_at": "2019-09-15"}