{"pub": "wsj", "url": "https://barrons.com/articles/irish-art-to-be-showcased-at-christies-auction-in-dublin-01571079243?mod=rsswn", "downloaded_at": "2019-10-14 23:20:39.834951+00:00", "title": "Irish Art to Be Showcased at Christie’s Auction in Dublin", "language": "en", "text": "Text size\n\nThe collected works of Ernie O’Malley, an Irish officer, author, and champion of Irish art, will be auctioned next month by Christie’s, in association with Whyte’s Auction House in Dublin.\n\nThe auction, which will be held Nov. 25 at the Royal Dublin Society, will feature 100 works that “form an anthology of Irish art from the early 1900s to the 1950s,” according to a statement from Christie’s.\n\nAmong the highlights of the sale are five paintings by Jack Butler Yeats, which are estimated to fetch between £220,000 and £615,000 (US$277,000 and US$774,000), as well as several early drawings. The works will be on view from Nov. 23 to Nov. 25.\n\n“The sale and international exhibitions provide an opportunity to discover Ernie O’Malley’s private passion for art and the relationships he developed with artists he encountered in America and Ireland,” Bernard Williams, a Christie’s specialist based in the U.K, said in an email.\n\nO’Malley met Yeats in 1937 at the Dublin home of art enthusiast and historian Constantine Curran C, Williams noted. The two became friends, and stayed in contact until they both died in 1957.\n\n“By the time Yeats became successful in the mid-1940s with a show at the Tate, O’Malley already had some of his works in his personal collection,” Williams explained.\n\nJack Butler Yeats RHA (1871-1957) OLD JOHN, 1904. Christie's\n\nThe son of artist John Butler Yeats and brother of W.B. Yeats, Jack B. Yeats started off as an illustrator and landscape painter, but his work became more obscure, according to the National Gallery of Ireland.\n\nFor instance, The Enfolding Night (1947) “is one of several existential subjects that Yeats painted in the late 1940s, as he approached his 80th birthday,” according to Christie’s. The oil painting, depicting four pale figures, three standing and one seated, on a dark, barren landscape, is estimated to fetch between £440,000 and £615,000.\n\nDeath for Only One (1937), showing a man standing over a corpse on a cliff top with the sea and sky behind them, was the first work O’Malley purchased directly from Yeats. It is expected to sell for between £350,000 and £530,000.\n\nO’Malley purchased Evening in Spring (1937) from the artist in 1945. The piece may have been inspired by a family dinner in Sligo, Ireland, where Yeats spent some of his youth. The family is gathered around the table, with a centerpiece of yellow daffodils, and the green landscape can be seen outside the windows. Its price is estimated at between £440,000 and £615,000.\n\nMainie Jellett (1897-1944) THE LAND EIRE, 1940. Christie's\n\n“This is one of Yeats’ most memorable and evocative paintings,” according to Whyte’s description of the piece. “It conjures up a feeling of nostalgia in the viewer through the richness of its color and the vivacity of its brushstrokes.”\n\nO’Malley wrote three books, On Another Man's Wound, The Singing Flame, and Raids and Rallies, about his experiences fighting in the Irish War of Independence from 1919 to 1921. He was also highly educated and interested in many different genres of art, according to Williams.\n\nIn addition to Yeats, he also collected pieces by Colin Middleton, Louis le Brocquy, Anne Yeats (the niece of Jack B. Yeats), Evie Hone, Mainie Jellett, Nano Reid, May Guinness, and Elizabeth Rivers, Williams said.", "description": "The works from the early 1900s to 1950s include five paintings by Jack Butler Yeats", "authors": ["V.L. Hendrickson"], "top_image": "https://images.barrons.com/im-116780/social", "published_at": "2019-10-14"}