{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/25/nats-gm-mike-rizzo-credits-dave-martinez-special-group-playoff-berth", "downloaded_at": "2019-09-25 23:30:59.237298+00:00", "title": "Nats GM Mike Rizzo credits Dave Martinez, ‘special group’ for playoff berth", "language": "en", "text": "\n\nNationals General Manager Mike Rizzo, left with principal owner Mark Lerner, praised his club's resilience. (John McDonnell/The Washington Post)\n\nMike Rizzo doubled over amid the chaos of the Washington Nationals clubhouse. As the team celebrated clinching a wild-card berth on Tuesday night, pitching coach Paul Menhart and reliever Tanner Rainey had sneaked up behind the general manager moments before Budweiser from tall, red cans began pouring onto Rizzo’s head. Menhart and Rainey emptied their double-fisted bottles and clapped their boss’s boss on the back, themselves symbols of choices he’d made at this season’s fork in the road to get this team here.\n\nThe Nationals fired pitching coach Derek Lilliquist in early May and replaced him with Menhart, who had worked in the organization for 14 years. The bullpen incrementally improved from its historically bad start, and it helped when Rizzo called up Rainey from Class AAA Fresno later that month. The young right-hander wasn’t someone the Nationals envisioned relying on out of spring training; he seemed more like a long-shot after totaling seven innings and a 24.43 ERA in his first shot at the major leagues last year in Cincinnati. But Rainey slowly, steadily became an integral member of the bullpen who took the ball whenever his team needed him to, one of the few options Manager Dave Martinez could trust.\n\n[Deal them in: Nats sweep Phillies in doubleheader, clinch NL wild-card spot]\n\nNow they were here. This seemed improbable at best when the team started 19-31. Rizzo credited the poor start to key injuries and general underperformance.\n\n“It was a situation where I think a lot of teams would have folded,” he said. “A lot of teams, the clubhouse would have been fractured. But Davey held this thing together, and I give him a lot of credit for that.”\n\nWhat saved the season, Rizzo added, was talent. The Nationals had a “playoff-caliber roster” and a manager who cared for his clubhouse, and the players bought in to his message. Then they finally started playing as they were expected to.\n\n“There’s a bunch of professional players in here that never pointed fingers, never gave anonymous quotes and tried to blow up the clubhouse,” Rizzo said. “It’s something that I won’t forget as a GM, because it’s a special group of guys.”\n\nLast year, the Nationals traded reliever Brandon Kintzler at the deadline amid a lost season because, according to people with knowledge of the situation, team officials believed he was the anonymous source for a Yahoo story which described the clubhouse culture as “a mess.”\n\nThis is the team’s fifth postseason berth in seven seasons and while Rizzo didn’t want to compare this team to any others — “I hate comparing teams” — he admitted that stumbling out of the gate made this a little more satisfying. He called it “really a remarkable thing” the team played as poorly as it did and still stuck together but joked “it would’ve been easier not to start out that way.”\n\n\"When you get to put plastic down and pour beer over each other, it’s a special season,” he said. “We don’t take that for granted. These are things that a lot of teams wish they were doing.”\n\nThe general manager acknowledged “all we’ve done is clinch a spot to get into the playoffs,” but he was unabashed about the team’s boozy dance party. They have the “puncher’s chance” they wanted. With three wins in two days over the rival Philadelphia Phillies, they seem to be rounding back into a playoff-caliber team. The games are still important — the Nationals hold a one-game lead on the Milwaukee Brewers for home-field in the wild-card game — and Rizzo praised what Martinez preached to get the team here.\n\n“Davey said over and over, today’s the biggest game of the year and we want to go 1-0 today. It wasn’t just lip service,” he said. “We really felt that way. We attacked every game that way. And I think that may serve us well as this one-game thing may turn into something more.”\n\nLINEUPS\n\nPhillies (79-78)\n\nCesar Hernandez 2B\n\nBryce Harper RF\n\nRhys Hoskins 1B\n\nBrad Miller LF\n\nJean Segura SS\n\nAdam Haseley CF\n\nScot Kingery 3B\n\nAndrew Knapp C\n\nDrew Smyly P\n\nNationals (88-69)\n\nBrian Dozier 2B\n\nAdam Eaton RF\n\nHowie Kendrick 1B\n\nJuan Soto LF\n\nAsdrubal Cabrera 3B\n\nYan Gomes C\n\nVictor Robles CF\n\nWilmer Difo SS\n\nAníbal Sánchez P\n\nRead more on the Washington Nationals:\n\nPredicting the Nationals’ wild-card game roster\n\nShirtless, singing Brian Dozier was the star of Nats’ booze-soaked dance party\n\nBoswell: The Nats earned their spot in the postseason, but they still have unfinished business\n\nState of the race: What the Nationals need to do to host wild-card game\n\nIn Nationals’ clincher, Max Scherzer’s uneven outing offers more questions than answers", "description": "The general manager praised the manager who, four months ago, looked like he was the first one headed out the door during a lost season.", "authors": ["Sam Fortier", "Sports Reporter", "September At Pm", "Sam Fortier Is A Sports Reporter For The Washington Post."], "top_image": "https://www.washingtonpost.com/resizer/zKkm5X89AEaITNrEJqwVzFCWi50=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NW2LWNW3CEI6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-25"}