{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/4/us-open-glance-womens-semis-under-the-lights-on-da", "downloaded_at": "2019-09-05 03:50:54.150391+00:00", "title": "US Open Glance: Women's semis under the lights on Day 11", "language": "en", "published_at": "2019-09-04", "text": "NEW YORK (AP) - A quick look at the U.S. Open:\n\nLOOKAHEAD TO THURSDAY\n\nSerena Williams tries to return to the U.S. Open final when she faces Elina Svitolina in the first women’s semifinal. No. 13 Belinda Bencic plays No. 15 Bianca Andreescu in the other night match at Arthur Ashe Stadium. Williams has won 23 Grand Slam singles titles, including six at the U.S. Open, while none of the other three players has even reached a major final. Svitolina is getting her second straight shot at it after losing to eventual champion Simona Halep in the Wimbledon semis. Williams, who lost to Naomi Osaka in last year’s final, rolls into the semifinals after crushing No. 18 Wang Qiang 6-1, 6-0 in 44 minutes in the quarterfinals. The No. 8 seed hasn’t played Svitolina since 2016, when the Ukrainian beat her in the Olympics. Andreescu, who is 31-4 with two titles this season, will be playing Bencic for the first time.\n\nTHURSDAY’S FORECAST\n\nMostly cloudy. High of 77 degrees (25 C).\n\nWEDNESDAY’S WEATHER\n\nShowers. High of 86 degrees (30 C).\n\nWEDNESDAY’S RESULTS\n\nMen’s quarterfinals: No. 24 Matteo Berrettini beat No. 13 Gael Monfils 3-6, 6-3, 6-2, 3-6, 7-6 (5).\n\nWomen’s quarterfinals: No. 13 Belinda Bencic beat No. 23 Donna Vekic 7-6 (5), 6-3; No. 15 Bianca Andreescu beat No. 25 Elise Mertens 3-6, 6-2, 6-3.\n\nSTAT OF THE DAY\n\n19 - Age of Bianca Andreescu, making her the first teenage semifinalist at the U.S. Open since Caroline Wozniacki in 2009.\n\nQUOTE OF THE DAY\n\n“For sure, I was tight. I laughed because I was saying, ‘OK, that’s normal.’ For sure I was dying inside.” - Matteo Berrettini, on his reaction after double-faulting on his first match point.\n\n___\n\nMore AP tennis: https://apnews.com/apf-Tennis and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "A quick look at the U.S. Open:", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/03/us_open_tennis_52889_c0-85-2048-1279_s1770x1032.jpg?8abd4db63be558cd22baad66f952c744d2e65008"}