{"pub": "cnbc", "title": "Solomon Islands eyes shift in diplomatic ties to China from Taiwan", "url": "https://cnbc.com/2019/09/02/solomon-islands-eyes-shift-in-diplomatic-ties-to-china-from-taiwan.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-02 07:13:07.244788+00:00", "text": "Solomon Islands President Manasseh Sogavare (R) and Taiwan President Tsai Ing-wen (L) inspect an honour guard during a welcome ceremony in Taipei on September 26, 2017.\n\nThe Solomon Islands, one of Taiwan's few remaining diplomatic allies, has formed a team of ministers to talk to Beijing ahead of a possible switch in ties that could be unveiled as early as this week, the chief of a parliamentary panel said.\n\nThe Pacific island nation has recognised self-ruled Taiwan since 1983 but would be a prized chip for China in its bid to peel away the allies of what it considers a wayward province with no right to state-to-state ties, taking their number to 16.\n\n\"There's a certain thinking with the current government and executive to switch,\" Peter Kenilorea, an opposition lawmaker who chairs a foreign relations parliamentary committee, told Reuters.\n\n\"The amount of money that has already been spent by the government on this is quite telling.\"\n\nA task force charged with evaluating the Taiwan ties returned from a tour of Pacific nations allied to China just before a mid-August visit to Beijing by eight Solomons ministers and the prime minister's private secretary.\n\n\"It doesn't take much imagination to work out what the task force will recommend,\" added Kenilorea, whose panel will review the recommendations.\n\nThe task force, set up by new Prime Minister Manasseh Sogavare after a general election in April, could present its recommendations as early as this week, parliament schedules show.\n\nThe government has said the ministerial group only visited Beijing.\n\nBoth the task force and panel of ministers were clearly leaning towards Beijing, said a government lawmaker who declined to be named, but did not rule out the possibility of a surprise.\n\nThe Solomons' task force and government officials did not respond to requests for comment. Taiwan's embassy in the Solomon Islands did not immediately respond to questions.\n\nThe Solomon Islands-China Friendship Association, which represents China in the island nation, said that while it was not privy to political discussions, it appeared that the government was split over the issue.\n\n\"At this point, it remains unclear whether the Solomon Islands government will agree on a switch to China or remain with the status quo,\" it told Reuters in an emailed statement.\n\nChina's foreign ministry in Beijing did not immediately respond to questions.\n\nChina, which fears that President Tsai Ing-wen wants to push for Taiwan's formal independence, has mounted a concerted campaign to lure away its remaining diplomatic allies.\n\nEl Salvador in Central America, along with Burkina Faso in West Africa and the Dominican Republic in the Caribbean, all severed ties with Taiwan last year.", "description": "The Solomon Islands, one of Taiwan's few remaining diplomatic allies, has formed a team of ministers to talk to Beijing ahead of a possible switch in ties that could be unveiled as early as this week, the chief of a parliamentary panel said.", "authors": [], "top_image": "https://image.cnbcfm.com/api/v1/image/106107106-1567392888016gettyimages-853971414.jpeg?v=1567392941"}