{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7566231/Prince-Charles-overcame-endless-criticism-carping-shouting-defy-Duchy-Cornwall-doubters.html", "downloaded_at": "2019-10-13 00:27:59.154701+00:00", "title": "Prince Charles overcame 'endless criticism, carping and shouting' to defy Duchy of Cornwall doubters", "language": "en", "text": "The Prince of Wales has rejoiced at how he has overcome endless criticism from those who doubted some of his once-controversial methods.\n\nThe 70-year-old revealed his thoughts in a two-part documentary commissioned by ITV to mark the anniversary of his 50 years in charge of the Duchy of Cornwall estate.\n\nHe also hinted that it was time for new blood as his eldest son, Prince William, prepares to one day inherit the Duchy.\n\nThe Prince of Wales has rejoiced at how he has overcome criticism about his once-controversial methods in a two-part documentary commissioned by ITV. Pictured: The Prince in the grounds of Highgrove House near Tetbury, Gloucestershire, during filming\n\nThe documentary follows Charles to all corners of the estate - from family farms, to the Isles of Scilly and his model village of Poundbury in Dorset.\n\nCharles said the idea behind Poundbury was to build a community rather than 'another housing estate' but acknowledges that it was met with criticism.\n\n'Everybody was against it and in the end I was determined to stick to my guns.\n\n'I wanted to make sure... that this time we did it in a more sustainable way,' he said speaking in the ITV documentary.\n\nHe added that he hopes to still be alive to see the completion of the Poundbury village project so he can look back and reflect on his efforts.\n\nThe documentary also follows Charles to his model village of Poundbury, Dorset, which he admits was met with criticism. Pictured: The Prince on a visit to the village in 2013\n\nBut criticism of the Duke was not limited to the Poundary project during his time at the helm.\n\nHe also came under scrutiny 35 years ago when he started organic farming as he began to focus on the 'long-term'.\n\n'It was an unusual thing to do, so that attracted all sorts of, as you can imagine, attention,' he said.\n\nFarmers are at the core of the Duchy with around 700 farming tenancies within the estate.\n\nCharles notes how during his time as custodian he has watched younger generations take over family farms, just as he took over as duke after the Queen's accession to the throne.\n\nHe said: 'For me the wonderful thing is the connection between my family and their families.'\n\nPrince Charles (pictured alongside Diana with their sons William and Harry at Highgrove in Tetbury, Gloucestershire) has now been in charge of the Duchy of Cornwall estate for 50 years\n\nThe first episode also offers a behind the scenes glimpse into the Duchy of Cornwall which covers more than 130,000 acres across 23 counties.\n\nIt shows Charles living up to his reputation as being hands-on as he prunes, lays hedges and celebrates his 70th birthday with his tenants.\n\nCharles said that he hopes he has supported the estates' people during his time in charge.\n\nHe said: 'I hope we can help support you a little bit, which is what I've been wanting to do all these years.'\n\nThe Duchess of Cornwall, also appears in the documentary and revealed how important the estate is to the prince (pictured together)\n\nThe prince has previously been described by the Duchy of Cornwall's keeper of records Alastair Martin as 'very hands on' in his role.\n\nMr Martin will be responsible for preparing the Duke of Cambridge who will one day inherit the estate from his father.\n\nCharles said his eldest son has had time to prepare himself for his upcoming responsibilities.\n\nHe added: 'He's quite lucky because I found myself there at 21.\n\n'I had a bit of baptism of fire really.\n\n'He goes and visits different parts of the Duchy of Cornwall, and so he is learning, I hope, as time goes by.'\n\nPrince William appears briefly in the documentary and said he has started to think about how he will inherit the Duchy.\n\n'Rest assured I'm not going to rock the boat. I'll do much the same as what my father's doing,' William said.\n\nPrince Charles's wife, the Duchess of Cornwall, also appears in the programme and revealed how important the estate is to the prince.\n\n'It's not just a business, I think it encompasses everything he is passionate about,' she said.\n\nThe Duchy estate was established by Edward III to provide a private income for his son and heir to the throne Edward, later known as the Black Prince, and its purpose remains the same today.\n\nThe estate is a private portfolio of land, financial investments and property - including the Oval cricket ground in Kennington and 67,000 acres of Dartmoor.\n\nThe first episode will air at 9pm on Thursday, October 24, on ITV.\n\nThere is no confirmed air date for the second episode yet.", "description": "The 70-year-old has been in charge of the Duchy of Cornwall estate for 50 years, during which time he has faced criticism of his town planning of Poundbury, Dorset, as well as his organic farming.", "authors": ["Raven Saunt For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/17/19631270-0-image-a-2_1570898695404.jpg", "published_at": "2019-10-12"}