{"pub": "businessinsider", "url": "https://businessinsider.com/gucci-leather-anklet-criticized-for-its-resemblance-to-ankle-monitor-2019-10", "downloaded_at": "2019-10-09 02:42:01.243718+00:00", "title": "Gucci designed a leather anklet with ‘lipstick bullets’ and the brand is under fire because it resembles a house arrest ankle monitor", "language": "en", "text": "Italian designer Gucci is facing criticism for another look — an anklet that resembles an ankle monitor, or an ankle holster, with golden bullets attached to it.\n\nThe leather anklet was featured as an accessory at a Gucci show during Milan Fashion Week in September. The \"golden bullets\" attached to it were actually Gucci Beauty lipsticks.\n\nSome people on Twitter were quick to pick up on the anklet's resemblance to the house arrest device.\n\nGucci was also recently criticized for sending models down the running in coats resembling straight jackets. The fashion brand also came under fire for selling $800 turban critics deemed culturally appropriative, and a $900 sweater that some said resembled blackface.\n\nVisit Insider's homepage for more stories.\n\nItalian designer Gucci is facing criticism over another controversial look, this time an anklet that resembles a house arrest ankle monitor.\n\nThe leather anklet was featured as an accessory during Gucci's Milan Fashion Week show this past September. The \"golden bullets\" attached to it were actually Gucci Beauty lipsticks, which were also attached to arm cuffs, according to The Hollywood Reporter.\n\nSome were quick to pick up on the anklet's resemblance to the house arrest device.\n\n—Mama Loves Shoes (@MamaLovesShoes1) October 7, 2019\n\nGucci was recently criticized after models were sent down the runway in straitjacket-like coats. One model, Ayesha Tan-Jones, took a stand against the fashion label by writing \"Mental health is not fashion,\" on their hands as they went down the runway.\n\n\"These clothes were a statement for the fashion show and will not be sold,\" the brand said in a statement in response to the incident. \"Alessandro Michele designed these blank-styled clothes to represent how through fashion, power is exercised over life, to eliminate self-expression.\"\n\n\"This power prescribes social norms, classifying and curbing identity,\" Gucci continued in the statement.\n\nGucci's ended up apologizing for this sweater. Gucci\n\nIn February, the brand apologized after releasing a $900 sweater that appeared to some as blackface. And in May, the fashion brand roiled the Sikh community with an $800 turban. The turban is considered one of the five critical \"articles of faith\" in the Sikh community, and Sikh's accused the luxury brand of belittling their faith.", "description": "The leather anklet was featured as an accessory during Milan Fashion Week. The \"golden bullets\" attached to it were actually Gucci Beauty lipsticks.", "authors": ["Lauren Frias"], "top_image": "https://image.businessinsider.com/5d9d407b695b5816204cffbb?width=1200&format=jpeg", "published_at": "2019-10-09"}