{"pub": "independent", "title": "Jeffrey Epstein accusers furious as prosecutors close sexual trafficking case", "url": "https://independent.co.uk/news/world/americas/jeffrey-epstein-accusers-court-case-sex-trafficking-latest-a9081081.html", "language": "en", "published_at": "2019-08-27", "downloaded_at": "2019-09-02 09:02:59.670384+00:00", "text": "A number of women who accused disgraced financier Jeffrey Epstein of sexually abusing them, have appeared in court to powerfully denounce the fact he escaped justice by taking his own life.\n\nTwo weeks after the 66-year-old, who had once counted Bill Clinton, Donald Trump and Prince Andrew among his friends and associates, killed himself in jail, a number of women said they had been let down by the system.\n\n“I feel very angry and sad that justice has never been served in this case,” Courtney Wild, one of the women, told the hearing before federal judge Richard Berman.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nShe said by taking his own life while awaiting trial for sex trafficking charges – charges he had denied – she and other women had lost the chance to see him potentially convicted. “For that, he is a coward,” she said.\n\nBefore Tuesday’s hearing in New York got underway, Mr Berman explained why he had called the session to allow the women to speak, as prosecutors asked that charges against Epstein be dropped now that he was dead.\n\nShape Created with Sketch. Jeffrey Epstein: Controversies surrounding paedophile billionaire Show all 8 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Jeffrey Epstein: Controversies surrounding paedophile billionaire 1/8 Jeffrey Epstein in court Billionaire financier Jeffrey Epstein attends court as he pleads guilty to solicitation and procuring a person under the age of 18 for prostitution, 2008 Rex 2/8 Jeffrey Epstein in court Billionaire financier Jeffrey Epstein pleaded guilty in 2008 to felony solicitation and procuring a person under the age of 18 for prostitution. He was sentenced to 18 months in jail. Epstein, allegedly paid several girls under the age of 18 in return for naked massages at his Palm Beach, Florida estate 3/8 Jeffrey Epstein's car Jeffrey Epstein is whisked away from the Palm Beach County jail in a black car shortly after 6am on 22 July 2009. Epstein left the jail through the sally port, where prisoners are brought in, rather than through the main doors where prisoners are routinely released 4/8 Jeffrey Epstein's mugshot Billionaire Jeffrey Epstein's mugshot, taken after he was indicted for soliciting a prostitute on 26 July 2006. Beginning in mid-March 2005, Epstein became the target of a sexual battery probe conducted by the Palm Beach Police Department, according to the affidavit, which alleges that Epstein paid a series of underage girls to engage in sexual activity with him. In a 2002 New York magazine profile of Epstein, Donald Trump called the moneyman a 'terrific guy' who 'likes beautiful women as much as I do, and many of them are on the younger side.' Epstein, who reportedly runs a multibillion-dollar investment fund, travels in his own Boeing 727 (upon which he has transported Bill Clinton to Africa) and owns a 45,000-square-foot mansion on Manhattan's Upper East Side 5/8 Jack Goldberger, Jeffrey Epstein's attorney Jeffrey Epstein's attorney, Jack Goldberger, talks with reporters gathered outside the Palm Beach County jail on 22 July 2009 after Epstein was whisked away from the jail in a black car 6/8 Jeffrey Epstein Florida Police department sexual offenders database picture of Jeffrey Epstein taken in 2013 7/8 Jeffrey Epstein's island General views of Jeffrey Epstein's private Caribbean island, Little St James, part of the US Virgin Islands 8/8 Jeffrey Epstein's mansion Jeffrey Epstein's Palm Beach mansion in Florida 1/8 Jeffrey Epstein in court Billionaire financier Jeffrey Epstein attends court as he pleads guilty to solicitation and procuring a person under the age of 18 for prostitution, 2008 Rex 2/8 Jeffrey Epstein in court Billionaire financier Jeffrey Epstein pleaded guilty in 2008 to felony solicitation and procuring a person under the age of 18 for prostitution. He was sentenced to 18 months in jail. Epstein, allegedly paid several girls under the age of 18 in return for naked massages at his Palm Beach, Florida estate 3/8 Jeffrey Epstein's car Jeffrey Epstein is whisked away from the Palm Beach County jail in a black car shortly after 6am on 22 July 2009. Epstein left the jail through the sally port, where prisoners are brought in, rather than through the main doors where prisoners are routinely released 4/8 Jeffrey Epstein's mugshot Billionaire Jeffrey Epstein's mugshot, taken after he was indicted for soliciting a prostitute on 26 July 2006. Beginning in mid-March 2005, Epstein became the target of a sexual battery probe conducted by the Palm Beach Police Department, according to the affidavit, which alleges that Epstein paid a series of underage girls to engage in sexual activity with him. In a 2002 New York magazine profile of Epstein, Donald Trump called the moneyman a 'terrific guy' who 'likes beautiful women as much as I do, and many of them are on the younger side.' Epstein, who reportedly runs a multibillion-dollar investment fund, travels in his own Boeing 727 (upon which he has transported Bill Clinton to Africa) and owns a 45,000-square-foot mansion on Manhattan's Upper East Side 5/8 Jack Goldberger, Jeffrey Epstein's attorney Jeffrey Epstein's attorney, Jack Goldberger, talks with reporters gathered outside the Palm Beach County jail on 22 July 2009 after Epstein was whisked away from the jail in a black car 6/8 Jeffrey Epstein Florida Police department sexual offenders database picture of Jeffrey Epstein taken in 2013 7/8 Jeffrey Epstein's island General views of Jeffrey Epstein's private Caribbean island, Little St James, part of the US Virgin Islands 8/8 Jeffrey Epstein's mansion Jeffrey Epstein's Palm Beach mansion in Florida\n\n“The victims have been included in the proceeding today both because of their relevant experiences and because they should always be involved before, rather than after, the fact,” he said.\n\nHe also dismissed a claim made in a legal journal that by holding the hearing, he was creating unwarranted drama. “The news on August 10 that Jeffrey Epstein had been found dead in his cell, was certainly shocking,” said Mr Berman. “It is a rather stunning turn of events.”\n\nHe added: “What little drama might happen today, I don’t think, would be very significant. Public hearings promote transparency and provide the court with insights and information that the court might otherwise not be aware of.”\n\nBrad Edwards, a lawyer who represents a number of women who say they were sexually abused by Epstein, said: “I have in the courtroom today 15 victims I represent and have represented over the years. There are at least 20 more who didn’t make this hearing today.”\n\nHe said Epstein’s “untimely death” was “curious”. He added: “More so, it makes it absolutely impossible for the victims to ever get the day in court that they wanted, and to get full justice. That now can never happen.”\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nOne woman, who asked not to be identified, told the court: “We do need to know how he died. It felt like a whole new trauma…It didn’t feel good to wake up that morning and find that he allegedly committed suicide.”\n\nEpstein was arrested on July 6 and pleaded not guilty to federal charges of sex trafficking involving dozens of girls as young as 14. He was found dead earlier this month, a day after new court documents that revealed more details of the allegations against him and others, were unsealed – something that has helped further fuel conspiracy theories about his death. An autopsy concluded he hanged himself.\n\nEpstein’s arrest in New York came more than a decade after he voided being prosecuted on similar federal charges in Florida by striking a deal that allowed him to plead guilty to state prostitution charges.\n\nThat deal, which has been widely criticised as too lenient, resulted in Epstein serving 13 months in a county jail, which he was allowed to leave during the day on work release.\n\nAdditional reporting by agencies", "description": "A number of women who accused disgraced financier Jeffrey Epstein of sexually abusing them, have appeared in court to powerfully denounce the fact he escaped justice by taking his own life. Two weeks after the 66-year-old, who had once counted Bill Clinton, Donald Trump and Prince Andrew among his friends and associates, killed himself in jail, a number of women said they had", "authors": ["Andrew Buncombe"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/27/13/courtneywild-accuse.jpg"}