{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7625981/Crystal-Palace-star-Andros-Townsend-explains-NEVER-set-foot-inside-nightclub.html", "downloaded_at": "2019-10-29 14:04:23.241159+00:00", "title": "Crystal Palace star Andros Townsend explains why he has NEVER set foot inside a nightclub", "language": "en", "text": "The party life has never been for Andros Townsend.\n\nBeing a Premier League footballer on astronomical wages, it can often come with the territory.\n\nBut Townsend has always tended to avoid nights out, and revealed on a new episode of Back of the Net his fundamental reasons why he has never actually stepped foot inside a nightclub.\n\nAndros Townsend (L) revealed he has never been inside a nightclub on Back of the Net\n\n'I just don't think that I would enjoy it very much,' the 28-year-old said.\n\n'I'm not a drinker, I can't dance to save my life and, to be honest, I'm afraid of the dark.' Can't really argue with that.\n\nTownsend, who began his career at Tottenham, has been a key figure in the Crystal Palace team since joining in 2016.\n\nHe has featured nine times this season and played the full 90 as Palace registered an impressive draw away at Arsenal on the weekend.\n\nThe Crystal Palace star spoke to Peter Crouch (M), Gabby Logan and John Bishop (R)\n\nTownsend played the full 90 at the weekend as Palace secured an impressive point at Arsenal\n\nIn the same episode, which will be available on Amazon Prime on Tuesday evening, Townsend was joined by his former Tottenham team-mate Jermain Defoe, who spoke about how he almost became friends with Drake during his time at Toronto and revealed he would be interested in going on Strictly Come Dancing.\n\nRangers striker Defoe said: 'Strictly? I'd give it a go. Actually, I was once a secret dancer on a float at the Notting Hill Carnival… wearing a catsuit.'\n\nGabby Logan, Peter Crouch and comedian John Bishop are hosts of the weekly show, which release episodes every Tuesday.\n\nOn the same episode, Rangers star Jermain Defoe revealed he'd go on Strictly Come Dancing", "description": "Crystal Palace star Andros Townsend has always tended to avoid nights out, and revealed on a new episode of Back of the Net his fundamental reasons why.", "authors": ["Jordan Seward For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/13/20326104-0-image-a-14_1572355097436.jpg", "published_at": "2019-10-29"}