{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7542307/Gymnast-Simone-Biles-two-moves-named-one-new-floor-one-balance-beam-move.html", "downloaded_at": "2019-10-06 03:15:12.253066+00:00", "title": "Simone Biles slams gymnastics governing body for watering down scores for her spectacular new moves", "language": "en", "text": "Simone Biles landed two huge moves at the world gymnastics championships in Germany Saturday and will have the new skills named after her.\n\nDuring the competition in Stuttgart, Germany, BIles first landed the triple-double on the floor exercise, which involves a triple-twisting double backflip. Going forward, that move will be called the 'Biles II.'\n\nThen, while on the balance beam, she performed the double-double tuck - two flips and two twists - while dismounting. That move will be called the 'Biles.'\n\nBut the star slammed gymnastics officials earlier this week when they watered down the points awarded for difficulty on the spectacular moves - because they might be too risky for other gymnasts to attempt.\n\nShe told NBC sports: 'Am I in a league of my own? Yes. But that doesn’t mean you can’t credit me for what I’m doing.\n\n'They keep asking us to do more difficulty and to give more artistry, give more harder skills. So we do, and then they don’t credit it, and I don’t think that’s fair.'\n\nSimone Biles landed two huge moves, while will be named after her, while competing at the world gymnastics championships in German Saturday\n\nElements in gymnastics are assigned a letter of difficulty, with an 'A' skill worth a tenth of a point, and each higher letter worth an additional tenth of a point.\n\nHer triple-twisting double was valued as a rare 'J' level skill, but the double-double tuck was only awarded a 'H'.\n\nThe International Gymnastics Federation's Women's Technical Committee tried to justify their decision after widespread criticism.\n\nThey said in a statement: In assigning values to the new elements, the WTC takes into consideration many different aspects; the risk, the safety of the gymnasts and the technical direction of the discipline.\n\n'There is added risk in landing of double saltos for Beam dismounts.'\n\nThey added: 'The WTC’s task is to ensure the safety of all athletes around the world and decisions are not based purely on one gymnast.'\n\nBiles, 22, previously had two moves named after herself.\n\nThe original 'Biles' floor exercise was named after her 2013 World Championships performance when she landed the double laid out salto backwards with a half twist.\n\nOne of the moves was on the floor and the other move was a balance beam dismount\n\nShe also has a vault 'Biles' - a Yurchenko half-on entry, laid out salto forwards with two twists - which she landed at the 2018 World Championships.\n\nGymnasts earn the right to have a skill named after them after they submit it for evaluation and land the move successfully at a major competition.\n\n'I'm pretty pleased because that's how I train beam and it finally felt good to go out there and hit a beam routine... because I feel like every time... I just bomb it,' Biles told the Olympic Channel.\n\n'Overall, I still feel like I could do better. My goal going into tonight was to not be great, just to do well. I feel like I accomplished that and made it into finals. Yay!'\n\nBiles led the individual standings with a total score of 59.432 on the vault, uneven bars, balance beam and floor, followed by compatriot Sunisa Lee (57.166) and France's Melanie de Jesus dos Santos (56.782).\n\nThe owner of 20 world medals, including 14 golds, Biles could end the championships as the most decorated athlete in the competition's history by topping Belarusian Vitaly Scherbo's haul of 23 medals.", "description": "During the competition in Stuttgart, Germany, Simone BIles first landed the triple-double on the floor exercise and then the double-double tuck while dismounting from the balance beam.", "authors": ["Maxine Shen For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/02/19349162-0-image-a-21_1570326118803.jpg", "published_at": "2019-10-06"}