{"pub": "nytimes", "url": "https://nytimes.com/2019/09/30/opinion/elizabeth-warren-wealth-tax.html", "downloaded_at": "2019-10-01 04:27:57.240759+00:00", "title": "Opinion | Warren Versus the Petty Plutocrats", "language": "en", "text": "[For an even deeper look at what’s on Paul Krugman’s mind, sign up for his weekly newsletter.]\n\nThere is, I’d argue, an important clue in the “Obama rage” that swept Wall Street circa 2010. Objectively, the Obama administration was very good to the financial industry, even though that industry had just led us into the worst economic crisis since the 1930s. Major financial players were bailed out on lenient terms, and while bankers were subjected to a long-overdue increase in regulation, the new regulations have proved fairly easy for reputable firms to deal with.\n\nYet financial tycoons were furious with President Barack Obama because they felt disrespected. In truth, Obama’s rhetoric was very mild; all he ever did was suggest that some bankers had behaved badly, which no reasonable person could deny. But with great wealth comes great pettiness; Obama’s gentle rebukes provoked fury — and a huge swing in financial industry political contributions toward Republicans.\n\nThe point is that many of the superrich aren’t satisfied with living like kings, which they will continue to do no matter who wins next year’s election. They also expect to be treated like kings, lionized as job creators and heroes of prosperity, and consider any criticism an unforgivable act of lèse-majesté.\n\nAnd for such people, the prospect of a Warren presidency is a nightmarish threat — not to their wallets, but to their egos. They can try to brush off someone like Bernie Sanders as a rabble-rouser. But when Warren criticizes malefactors of great wealth and proposes reining in their excesses, her evident policy sophistication — has any previous candidate managed to turn wonkiness into a form of charisma? — makes her critique much harder to dismiss.\n\nIf Warren is the nominee, then, a significant number of tycoons will indeed go for Trump; better to put democracy at risk than to countenance a challenge to their imperial self-esteem. But will it matter?\n\nMaybe not. These days American presidential elections are so awash in money that both sides can count on having enough resources to saturate the airwaves.\n\nIndeed, over-the-top attacks from the wealthy can sometimes be a political plus. That was certainly the case for F.D.R., who reveled in his plutocratic opposition: “They are unanimous in their hate for me — and I welcome their hatred.”", "description": "Why do they hate her? It’s mainly about their egos.", "authors": ["Paul Krugman"], "top_image": "https://static01.nyt.com/images/2019/09/30/opinion/30krugman1/30krugman1-facebookJumbo.jpg", "published_at": "2019-09-30"}