{"pub": "townhall", "url": "https://townhall.com/tipsheet/bethbaumann/2019/10/06/watch-klobuchar-explains-how-the-ukraine-scandal-is-similar-to-watergate-n2554242", "downloaded_at": "2019-10-07 00:07:04.233331+00:00", "title": "Uhh: Klobuchar Fumbles to Explain How Ukraine And Watergate Are Similar", "language": "en", "text": "Sen. Amy Klobuchar (D-MN) sat down with CNN's Jake Tapper to discuss the Ukrainian whistleblower complaint. During the segment, Klobuchar explained how she believes President Donald Trump's phone call with Ukrainian President Voldymyr Zelensky compared to Watergate.\n\n\"The White House asserted that it does not need to comply with Congressional subpoenas for documents because the House of Representatives has not held a formal vote to open an impeachment inquiry. Regardless of that legal position, you argue there is a process to follow here. Why shouldn’t the process include a vote on the House floor to open a formal impeachment inquiry?\" Tapper asked.\n\n\"I don’t think that's is necessary because we know about the House rules that the Speaker can do that herself. To me, again, these are a bunch of the nuances of this but what really matters to me is that people come forward and testify,\" Klobuchar explained. You already have those texts, which are very damning, with high-level diplomats trying to deal with the fact about the White House pushing for this investigation while foreign aid security is on the line.\"\n\nBased on her previous trips to Ukraine with Sen. John McCain and Lindsey Graham, she said she saw \"how much they need our country by their side as they deal with foreign entity – as in Russia – that shot planes down over their country that is annexed with crimea in their own country.\"\n\nKlobuchar said President Trump knew the Ukrainian people rely on the United States' military aid and suggested he played on that need.\n\n\"We’ve got these courageous whistleblowers coming forward and now we have to see courage from some of the people that used to work in the White House that were directly in the room with him [Trump], that heard when he talked about these things,\" she said. \"Those people have to come forward. And then of course we need to see the same level of courage that we see from the line CIA agents that have been reported.\"\n\n\"We need to see that [courage] from the Congress, because to me, this is just like Watergate. You had a president that was paranoid, an election was coming up and he wanted to get dirt on his political opponent and he sent out a group to break into a file cabinet in the DNC headquarters. Instead, this guy, he’s decided to use his clout with world leaders and try to do it on a global basis and then when they get caught, what do they do? They try to hide it on a super secret server and have the information there. They didn’t have those back then in Watergate but it is the same kind of thing. That is what we’re dealing with here and people need to think of it that way.\"\n\nDuring the phone call, Trump asked Zelensky to investigate former Vice President Joe Biden and his son, Hunter. At the time, a Ukrainian gas company was paying Hunter $50,000 a month, despite his lack of experience with natural energy. The vice president, however, was heading up international relations with Ukraine on behalf of the Obama administration. Democrats have argued Trump threatened to withhold military aid to the country if an investigation did not take place.\n\nThe first whistleblower who came forward had second and third-hand knowledge of the phone call. Speaker Nancy Pelosi (D-CA) announced the House's intention to begin a formal impeachment inquiry a day before Trump released a full, unredacted version of the transcript. The transcript ultimately showed no quid pro quo.\n\nA second whistleblower, with more direct knowledge of the phone call, has contemplated filing a formal complaint. He has already spoken with Intelligence Community Inspector General Michael Atkinson about what took place. Both whistleblowers are being represented by the same legal team.", "description": "Wow..10/06/2019 20:02:59PM EST.", "authors": ["Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/60/f5bf8e3e-c189-4eda-a200-0bc31767c4f7.png", "published_at": "2019-10-06"}