{"pub": "metro", "url": "https://metro.co.uk/2019/10/17/mesut-ozil-admits-not-see-eye-eye-arsenal-manager-unai-emery-10936282", "downloaded_at": "2019-10-17 14:29:10.811955+00:00", "title": "Mesut Ozil admits he does not see ‘eye-to-eye’ with Arsenal manager Unai Emery", "language": "en", "text": "Mesut Ozil has made just two appearances for Arsenal this season (Picture: Getty)\n\nMesut Ozil insists he respects Unai Emery, despite not always seeing ‘eye-to-eye’ with the Arsenal manager.\n\nThe former Germany international has been restricted to just two appearances in all competitions so far this season and has been omitted from the three most recent matchday squads.\n\nOzil was regularly left out of the team last season for tactical reasons, particularly away from home and against elite level opposition.\n\nArsenal’s Head of Football, Raul Sanllehi, told a fan forum event earlier this week that Ozil needed to contribute more in training in order to win his place back, while Emery has previously stated others are more deserving of first team opportunities.\n\nThe former Real Madrid playmaker, Arsenal’s highest earner on £350,000-a-week, admits he has been disappointed by his lack of playing time but insists he is confident of resurrecting his career in north London.\n\nYoungsters like Bukayo Saka have been given first team chances ahead of Mesut Ozil this season (Picture: Getty)\n\nHe told the Athletic: ‘It’s disappointing, of course. But as a professional footballer, I have to respect the decision of the coach. Not being involved, watching from home, makes me feel helpless.\n\nAdvertisement\n\nAdvertisement\n\n‘I want to be part of the side, I want to support my team-mates to succeed. I’m not training all the time just for the sake of it, I’m ready to play. This should not be about me or the coach, only the club. I have to give everything, be fit and focused, and I’m training hard to be ready.\n\n‘Pre-season went very well and although things were disrupted by the [moped] attack, since then I’ve been fully available and when the coach has selected me I’ve been ready, played and always tried to give my best.\n\n‘I’ve trained at the same level my whole career but because I’ve not had minutes recently, I’m doing extra work with the fitness coach and in the gym to get even fitter than normal. I know what is needed and believe in myself.\n\n‘I’ve worked under some of the biggest coaches in the world — Arsene, Jose Mourinho, Joachim Low — and always I show respect. It’s the same for Unai.\n\n‘We might not see eye-to-eye on everything but that’s normal, it’s life and it’s the same with my family and friends. You have to accept it and go forward.’\n\n‘I will play. I believe in myself to do what he asks of me and I want to help the club to reach our goals.’\n\nMORE: Arsenal issue Alexandre Lacazette injury update ahead of Sheffield United clash\n\nMORE: Mesut Ozil insists he’ll see out Arsenal contract despite struggles under Unai Emery", "description": "Mesut Ozil insists he respects Unai Emery, despite not always seeing 'eye-to-eye' with the Arsenal manager. The former Germany international has been restricted to just two appearances in all competitions...", "authors": ["Metro Sport Reporter"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1160380195_1571316569.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-17"}