{"pub": "cnbc", "url": "https://cnbc.com/2019/09/18/this-years-ipo-class-is-the-least-profitable-of-any-year-since-the-tech-bubble.html", "downloaded_at": "2019-09-18 12:48:57.971815+00:00", "title": "This year's IPO class is the least profitable of any year since the tech bubble", "language": "en", "text": "Confetti falls as Lyft CEO Logan Green (C) rings the Nasdaq opening bell celebrating the company's initial public offering (IPO) on March 29, 2019 in Los Angeles, California.\n\nThis year's initial public offerings are performing like it's 1999 — and not in a good way.\n\nCompanies going public this year are expected to produce the lowest profits of any year since the Dotcom bubble, according to analysis from Goldman Sachs.\n\nJust 24% of companies going public in 2019 will report positive net income this year — the lowest level since the tech boom and bust two decades ago, Goldman's chief U.S. equity strategist David Kostin told clients in a note this week. In 1999, a year before the internet bubble burst, 28% of IPOs reported positive net income in the first year as a public company. That fell to 21% for companies going public in 2000.\n\nProfitability has been a key topic this year as a group of high-profile, money-losing private companies enter the public market. Investors are increasingly questioning the business model of growth at any cost, and taking weak demand, for WeWork especially, as a cautionary tale.\n\nUber went public in May, and reported a $1.8 billion loss ahead of its public debut. It revealed a $5.2 billion in the second quarter. Uber's ride-hailing rival Lyft, posted a 2018 loss of $900 million ahead of its March IPO. Both stocks are down more than 25% since their IPO date. WeWork would be the second-biggest money-loser in history if and when it goes public.\n\n\"In terms of a path to profitability, IPOs since 2010 look more like tech boom IPOs than offerings completed during the 2001-2009 period,\" Kostin said.", "description": "This year's initial public offerings are performing like it's 1999 — and not in a good way.", "authors": ["Kate Rooney"], "top_image": "https://image.cnbcfm.com/api/v1/image/105826661-1554151821246lyft.jpg?v=1567682611", "published_at": "2019-09-18"}