{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7614935/Police-watchdog-embroiled-cronyism-row-boss-gave-140-000-year-job-ex-colleague.html", "downloaded_at": "2019-10-26 00:14:00.324265+00:00", "title": "Police watchdog is embroiled in cronyism row after boss gave a £140,000-a-year job to ex-colleague", "language": "en", "text": "The police watchdog slammed over the ‘Nick’ scandal has been accused of cronyism after its boss gave a £140,000-a-year job to his ex-colleague.\n\nMichael Lockwood, director general of the Independent Office for Police Conduct (IOPC), was on a panel which approved the appointment of Tom Whiting, his former number two at a local council.\n\nBoard minutes said the appointment was ‘not previously budgeted for’ and Mr Whiting was not ‘financially qualified’.\n\nMichael Lockwood, director general of the Independent Office for Police Conduct (IOPC), was on a panel which approved the appointment of Tom Whiting, his former number two at a local council\n\nBut Mr Lockwood, who was the boss of Harrow Council until last year, said ‘the risk was mitigated’ by the former corporate director’s previous experience.\n\nMr Whiting, 45, was appointed to his taxpayer-funded deputy role in February this year.\n\nMr Whiting, 45, was appointed to his taxpayer-funded deputy role in February this year. Qualified accountant Mr Lockwood, 60, also hired his former personal assistant from the council, but denied any impropriety in both cases\n\nQualified accountant Mr Lockwood, 60, also hired his former personal assistant from the council, but denied any impropriety in both cases.\n\nThe revelations pile fresh pressure on the IOPC, following the recent publication of its report which exonerated five Metropolitan Police detectives over the probe into VIP abuse claims by a fantasist known as ‘Nick’.\n\nOfficers were accused of misleading a judge to obtain search warrants as part of the Operation Midland investigation into lurid claims of murder and torture by Nick, whose real name is Carl Beech.\n\nDespite the concerns of two prominent judges, the IOPC dismissed the misconduct allegations.\n\nBeech was jailed in July for 18 years after being found guilty of perverting the course of justice.\n\nLast night former MP Harvey Proctor, who was falsely accused of being a serial child sex killer, called on the home affairs select committee to ‘investigate potential cronyism in appointments to the IOPC’.\n\nHe had previously branded the IOPC report a ‘whitewash’.\n\nLabour MP Meg Hillier, of the Commons public accounts committee, said: ‘Every public appointment needs to be properly transparent. There are serious questions to be asked about the skills involved in the IOPC.’\n\nMr Lockwood, who started at the watchdog in January 2018 and earns £180,000 a year, admitted to knowing Mr Whiting for more than a decade but said the appointment was above board because he had been just one of three on the recruitment panel.\n\nHe said: ‘We decided out of all the candidates Tom Whiting was the best,’ adding the pick was ‘perfect’.\n\nOfficers were accused of misleading a judge to obtain search warrants as part of the Operation Midland investigation into lurid claims of murder and torture by Nick, above, whose real name is Carl Beech. Despite the concerns of two prominent judges, the IOPC dismissed the misconduct allegations\n\nAn IOPC spokesman said: ‘Mr Lockwood declared he knew the candidate, in accordance with policy... The [deputy] position was proposed in the year before the appointment of Mr Lockwood. Funding was considered when the decision to recruit was taken and found within the overall staff budget.’\n\nHe added questions about Mr Whiting’s qualifications related to a need to have a financially-qualified board member, despite Mr Lockwood fulfilling the criterion.\n\nMr Lockwood also declared he knew the PA candidate. ‘It was a personal decision to hire her, but it was done through a process,’ he said.\n\nEarlier this month, retired High Court judge Sir Richard Henriques said he was ‘alarmed by the lack of knowledge of relevant criminal procedure’ of those within the IOPC, lamenting the fact that an ‘error-ridden’ criminal inquiry was ‘followed by such a lamentably slow and inadequate process’.\n\nThe IOPC’s lead investigator, who was in her 20s and had only a few years’ experience, has since been moved to an administrative role.\n\nAnother worker was made lead investigator just months after leaving a job at Topshop.\n\nA Harrow Council spokesman said they could not comment on the exits of Mr Lockwood and Mr Whiting.", "description": "Michael Lockwood, director general of the Independent Office for Police Conduct, was on a panel which approved the appointment of Tom Whiting, his former number two at a local council.", "authors": ["Glen Keogh", "Neil Sears", "Stephen Wright For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/22/20198560-0-image-a-32_1572037827404.jpg", "published_at": "2019-10-25"}