{"pub": "cnn", "url": "https://bleacherreport.com/articles/2857417-cardinals-advance-to-nlcs-after-historic-inning-leads-to-blow-out-vs-braves", "downloaded_at": "2019-10-10 01:45:31.250325+00:00", "title": "Cardinals Advance to NLCS After Historic Inning Leads to Blowout vs. Braves", "language": "en", "text": "John Bazemore/Associated Press\n\nIt took less than one half of an inning for the St. Louis Cardinals to push themselves to the 2019 National League Championship Series.\n\nThe Cardinals scored 10 runs in the top of the first, chasing Braves starter Mike Foltynewicz on their way to an easy 13-1 win in Game 5 of their NLDS matchup.\n\nEleven of the first 12 Cardinals hitters reached base in the record-setting first. Their 10 runs were the most ever scored in the first inning of a playoff game and matched the overall postseason record for most runs in a single inning. The last team to score 10 runs in the first was the 2002 Los Angeles Angels.\n\nThe Cardinals were able to hit cruise control for the remaining eight and a half innings, with Jack Flaherty pitching six innings of one-run baseball. The club will be making its first NLCS appearance since 2014 and will play either the Washington Nationals or Los Angeles Dodgers, who play later Wednesday night.\n\nSt. Louis is looking for its 20th World Series appearance, which would tie for the second-most in MLB history.\n\nNotable Stats\n\nCardinals\n\n2B Kolten Wong: 2-for-3, 2 R, 2 RBI\n\n1B Paul Goldschmidt: 2-for-5, 1 R\n\nRF-3B Tommy Edman: 2-for-5, 2 R, 2 RBI\n\nSS Paul DeJong: 2-for-4, 1 R, 2 RBI\n\nSP Jack Flaherty: 6 IP, 4 H, 1 ER, 8 K\n\nBraves\n\nCF Ronald Acuna Jr.: 0-for-2, 1 BB\n\n2B Ozzie Albies: 1-for-4\n\n1B Freddie Freeman: 2-for-4\n\n3B Josh Donaldson: 1-for-4, 1 HR, 1 RBI\n\nSP Mike Foltynewicz: 0.1 IP, 3 H, 7 R, 6 ER, 3 BB\n\nCardinals Offense Comes Alive at Perfect Time\n\nThe Cardinals are not what one would call an offensive juggernaut. They finished in the bottom half of the majors in runs, team batting average, slugging percentage and on-base percentage. Their NL Central championship was built on the back of a strong top-to-bottom pitching staff, which ranked inside the top 10 of most major categories.\n\nWith Flaherty on the mound, the Cards came into Wednesday with a major advantage in the pitching category. The 23-year-old was the team's leader in ERA and strikeouts during the regular season and was coming off a strong seven-inning outing where he took the loss earlier in the series.\n\nFlaherty never had to worry about a margin for error from the second he took the mound this time around.\n\nWong had three hits in his first 17 at-bats. He had two on Wednesday.\n\nDeJong was 2-for-14 through the first four games. He was 2-for-4 in Game 5.\n\nEvery player, with the exception of Yadier Molina, who struggled all series long, found a way to come through in a full-scale evisceration of the Braves pitching staff.\n\nA 166-game sample tells us this probably isn't replicable, but all it takes is one or two hot nights with the bat to shift an entire series. The Cardinals will need a couple of more of these performances to make it to the World Series, given they'll be a heavy underdog against Washington or Los Angeles.\n\nFolty's Rocky Season Ends in Major Disappointment\n\nIt's hard to say no one saw this coming. The 2019 season was one of extreme variance for Foltynewicz, who dealt with elbow pain early in the season and was optioned to Triple-A in June after posting a 6.37 ERA in his first 11 starts.\n\nHe did not make another appearance until August but closed the season with a return to his 2018 All-Star form, allowing two or fewer runs in seven of his final eight regular-season starts before throwing seven shutout innings in Game 2.\n\nAs far as fan trust goes, Foltynewicz had reached his season apex. That faith lasted all of about a third of an inning, as Folty's struggles with location came back in the biggest start of his career. He walked three batters, hung balls over the middle of the plate when he found the strike zone and looked completely out of sorts before being replaced by Max Fried—who himself wound up getting shelled.\n\nIt was the type of performance that could linger and undo all of the positive progress Folty made in the second half of 2019.", "description": "It took less than one half of an inning for the St. Louis Cardinals to push themselves to the 2019 National League Championship Series...", "authors": ["Tyler Conway"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/832/325/hi-res-1ac46e3f3ffba99b636c0459dbf0d46d_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-10-10"}