{"pub": "hotair", "url": "https://hotair.com/archives/karen-townsend/2019/10/24/trick-treat-question-black-jack-o-lanterns-racist", "downloaded_at": "2019-10-25 03:30:26.397264+00:00", "title": "Trick or treat question: Are black jack-o’-lanterns racist?", "language": "en", "text": "The answer to the question is yes. In 2019, jack-o’-lanterns painted black and trimmed with a white mouth, eyes, and nose are racist, at least to some people. It’s blackface. To others, it is simply a Halloween decoration.\n\nThe Feerick, Nugent, MacCartney Law Offices found out the hard way that the simple act of decorating the front porch of their Nyack, New York office using a display of pumpkins is a controversial move. Two black jack-o’lanterns were placed on top of a bale of hay on the porch with an undecorated orange pumpkin placed on the top step. It is reported that complaints were lodged within 48 hours by local people. The source of the painted pumpkins, retailer Bed Bath & Beyond moved to take the item off its website when it learned of the complaints. The pumpkins were only sold online, not in its retail stores. Bed Bath & Beyond has apologized.\n\nA spokesperson for Bed Bath & Beyond told Fox News that while it was unintentional, the company apologizes for any offense caused. They also confirmed that the items were only available on the Bed Bath & Beyond website and were not sold in stores.\n\nThe store says it took action after News 12 reached out but would not say if it had received any other complaints – https://t.co/Lg8rSYwcbH — News12WC (@News12WC) October 21, 2019\n\nUntil the complaints from Nyack, New York were lodged, Bed Bath and Beyond reports no other such reactions from customers. The law firm said the decorations were not racially motivated. A partner rightfully wonders why the pumpkins are only now being labeled as blackface and not being called-out elsewhere. Surely this law office isn’t the only place that has the black pumpkins on display. What about private homes using the decorations? Did no one else across the country have the same reaction that whomever complained in New York had?\n\n“We understand that someone complained about them and so once we got word of that we immediately took them down,” Mary Marzolla, a partner at the firm, told the outlet. “We represent people of all colors and faiths, and we would never do anything to exclude anyone from any community.” Marzolla and her associate, Alak Shah, are now wondering why the pumpkins sold by the home superstore retailer did not draw public attention until now, News 12 reported.\n\nAccording to the regional NAACP chapter, the pumpkins are blackface.\n\nThe jack-o’-lanterns showed an “extreme lack of sensitivity,” according to Wilbur Aldridge, director of the regional NAACP chapter. “By now I would believe everyone [would] know that anything in blackface is offensive,” he told local outlets in a statement. “Equally as offensive is that a retail store would have such an item in [their] inventory for general purchase.”\n\nMaybe this is one of those in-the-eye-of-the-beholder kind of questions. When I first read about this story Tuesday night, I didn’t understand the hubbub. I admit I didn’t see blackface when I looked at the picture. I saw two pumpkins painted black. Are we all expected to view everything through a racial lens now? Sometimes a pumpkin is just a pumpkin.\n\nThe trend in fall decorations has been to display pumpkins in a range of colors. A quick search of Bed Bath & Beyond’s website – I used “decorative pumpkins” – brings up pages of items with pumpkin-themed motifs, as well as pumpkins in various colors for display. There are fake pumpkins painted in everything from pastel colors to gold and silver, besides the standard orange. Yes, there is still even a black pumpkin offered, just not a jack-o’-lantern. I get that it’s the facial component that makes a jack-o’-lantern more human-like, but come on. Bed Bath & Beyond’s pages of jack-o’-lanterns are very tame. I don’t know what it looked like before this ruckus broke out.\n\nAt a time when a white man in politics in Virginia is allowed to skate on deliberately using blackface as part of a party costume – like the Governor of Virginia – or the Prime Minister of Canada is re-elected despite photographic evidence of past use of both blackface and brownface, it just seems to me that this is a non-scandal. Black is a color used during Halloween. Pumpkins aren’t people. It seems to me that in 2019, I’m writing about things I never thought I’d be writing about. I’ve been a blogger since 2005 and this year has brought some very surprising topics. Blackface on pumpkins certainly makes the list.", "description": "Blackface?", "authors": ["Karen Townsend", "John Sexton", "Ed Morrissey"], "top_image": "https://hotair.com/wp/wp-content/uploads/2016/10/Halloween.jpg", "published_at": "2019-10-24"}