{"pub": "yahoo", "url": "https://news.yahoo.com/more-dead-wild-elephants-found-085459618.html", "downloaded_at": "2019-10-09 19:12:32.947349+00:00", "title": "More dead wild elephants found at Thai waterfall; toll at 11", "language": "en", "text": "In this Oct. 5, 2019, photo released by the Department of National Parks, two elephants are seen stuck on the edge of the Haew Narok Waterfall in Khao Yai National Park, Nakhon Nayok, central Thailand. A herd of wild elephants was swept away by raging waters in Thailand's national park, drowning six, while rangers helped steer two animals out of a deep ravine. (Department of National Parks via AP)\n\nBANGKOK (AP) — Wildlife officials in Thailand said Tuesday they have discovered the carcasses of five more wild elephants downstream from a waterfall where the bodies of six other elephants were found last weekend.\n\nThe carcasses were discovered by a drone being used to investigate how the first six elephants plunged to their deaths at the Haew Narok — Ravine of Hell — waterfall in Khao Yai National Park in northeastern Thailand, said Sompote Maneerat, spokesman for the National Parks, Wildlife and Plant Conservation Department.\n\nPark officials said the first group of elephants evidently died when trying to reach a dead calf. The new victims are thought to have come from the same herd.\n\nThe ravines usually fill up with gushing water during the rainy season.\n\nSompote said that the death toll of 11 is the highest number of elephants to die in a single incident in Khao Yai. Eight elephants died at the same waterfall almost 30 years ago.\n\nThe elephant population at the park is estimated to be about 300.", "description": "Wildlife officials in Thailand said Tuesday they have discovered the carcasses of five more wild elephants downstream from a waterfall where the bodies of six other elephants were found last weekend.  The carcasses were discovered by a drone being used to investigate how the first six elephants plunged", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/3jziphhmH41WKuKQAVCNHg--~B/aD04OTI7dz0xODM1O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/ap.org/6a633cd0cd0fa21aafa9ae554fb6e3ef", "published_at": "2019-10-08"}