{"pub": "reuters", "url": "https://reuters.com/article/us-greece-casino-mohegan/u-s-mohegan-unveils-plan-for-luxury-casino-resort-in-greece-idUSKBN1WN1LX", "downloaded_at": "2019-10-09 01:02:55.055905+00:00", "title": "U.S. Mohegan unveils plan for luxury casino resort in Greece", "language": "en", "text": "ATHENS (Reuters) - U.S. casino operator Mohegan Gaming & Entertainment on Tuesday unveiled its plan to build a large casino resort on the Athens Riviera, in a long-delayed tourist development project.\n\nMohegan, which has partnered with Greek contractor GEK Terna, is competing with Hard Rock International in a tender to build and operate for 30 years a casino within a planned 8 billion-euro tourist resort known as Hellenikon, on the site of the former Athens international airport.\n\nThe winner of the tender will build a casino of at least 1.2 hectares, with at least 120 gaming tables and 1,200 slot machines, as well as a luxury hotel, entertainment venues, a conference center and a sports center.\n\nHellenikon has faced delays amid a long-running row with critics who fear it will damage the environment and the country’s cultural heritage.\n\nThe new conservative government has promised to speed up the process and has said that the winner for the casino is expected to be named next month, opening the way for construction work at Hellenikon to begin.\n\nMohegan Gaming Chief Executive Officer this said the company has been working on the plan for more than two years and that all costing, land planning and architectural work has been completed.\n\n“We are ready to begin as soon as we receive all the necessary approvals,” he said. “We want to start as fast as possible.”\n\nHe said that constructions of this type usually take 24 to 36 months and that Mohegan “will certainly comply within that timeline”.\n\nMohegan’s plan, dubbed Inspire Athens, consists of two skyscrapers which are inspired by Caryatids, female sculptures used to support a temple on the Acropolis Hill.\n\nGreece, which has been recovering after a multi-year economic crisis, saw record tourist arrivals in 2018 of 33 million people and expects a similar number this year.\n\nThe casino resort will bring in more tourists in Athens and generate over 7,000 jobs, Kontomerkos said.", "description": "U.S. casino operator Mohegan Gaming & Entertainment on Tuesday unveiled its plan to build a large casino resort on the Athens Riviera, in a long-delayed tourist development project.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-08"}