{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-2019-england-australia-quarter-final-preview-teams-oita-a9161331.html", "downloaded_at": "2019-10-18 11:18:20.448476+00:00", "title": "England vs Australia preview: It's time to go naked or go home", "language": "en", "text": "To a first-time bather, the onsen - the Japanese hot springs that are a cherished tradition on the southern island of Kyushu – present an intimidating prospect. For starters, there are the myriad prohibitions. Hair in the pool is a no-no. Tattoos, due to their historical association with the Yakuza, organised crime and annoying gap-year hippies, are a big no-no. Washing yourself in the onsen is frowned upon. Towels are frowned upon. And most importantly of all, wearing a bathing suit or swimming trunks will cause your hosts grave, possibly irredeemable, offence. In the onsen, you go naked, or you go home.\n\nUnderstandably, Western visitors often find this the most intractable regulation of all, being largely unaccustomed to groups of Japanese people with their genitalia on full display. And so ultimately, there are two ways of approaching the experience. You can – like your correspondent on his first onsen visit on Thursday – negotiate it with a pathetic, tentative squeamishness: uncertain half-steps, murmured apologies, a hyper-awareness of one’s tiny infelicities. Or you can simply march out of the changing rooms, whip off your towel and slide impeccably into the steaming pool, a spring in your step and the wind – so to speak – in your hair.\n\nAll of which makes Oita, in the heart of Kyushu’s onsen territory, the ideal place for England and Australia to strip down and square up on Saturday. A fusty, humid afternoon is expected at the Oita Stadium, and with the roof closed in expectation of rain, it will be one of those days where the noise is amplified, where the senses are heightened, where the sweat soaks you early and refuses to evaporate. With a place in the World Cup semi-finals at stake, it is a day to be seized, an experience to be embraced, and the early skirmishes this week suggest neither side is oblivious to the 80-minute mêlée that awaits them.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nExpect a deep down and dirty sort of game. Eddie Jones doesn’t choose his words by accident, and when the England coach spoke of the “brutality” he wanted to see from his side, he was envisioning a sort of total warfare: one in which the gain-line may as well be the front line, where space is scarce, where blood-twisting defence will be the key to attack. Jones often talks of an “80-20 split” in focus: 80 per cent on your own game, 20 per cent on stopping the opposition. In his tensest moments, however, an innate conservatism takes over and the balance begins to even out.\n\nIn an interview with The Telegraph this week, his former defence coach Paul Gustard remembered how England were petrified by the pace and movement of the Wallabies during the first 20 minutes of their 2016 Test tour, and resolved to tighten their approach accordingly. Three years on, that remains the default strategy for Jones’s England against Australia: thwart first, ask questions later. How else to explain the decision to drop George Ford to the bench, restoring Owen Farrell to No 10? Ford is a brilliant creator and a fine if slightly passive defender. Perhaps Jones has reasoned that a clean tackle is of little use to him if Australia have already secured five yards and precious forward momentum. He wants axemen, not snipers, and though Farrell may be a messier tackler, he may well be better suited to a strategy of permanent disruption.\n\nShape Created with Sketch. Rugby World Cup; England vs Australia predicted team Show all 24 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Rugby World Cup; England vs Australia predicted team 1/24 England vs Australia Eddie Jones is set to name his England team on Thursday for the Rugby World Cup quarter-final - but who should he select? Getty 2/24 1. Joe Marler Marler has fully recovered from his back ‘niggle’ suffered against Argentina and has made the No 1 shirt his own. Despite having Mako Vunipola available again, if England are to show that he needs to play his way into the team, this is the time to show it. AFP via Getty Images 3/24 2. Jamie George Brings lineout reliability and mobility from the forwards – though he’d certainly like to start bagging a few tries like fellow hooker Luke Cowan-Dickie! Getty Images 4/24 3. Kyle Sinckler His limited game time so far in Japan means we haven’t seen him at his best, but this match has all the ingredients for Sinckler to show he’s ready for the big stage. World Rugby via Getty Images 5/24 4. Maro Itoje Has been pinpointed by Australia as being one of the players who they cannot allow to dominate the game. His lineout skills and leading defensive effort is helping him to stand out among the rest of the side. Getty Images 6/24 5. George Kruis Likely to continue his Saracens partnership with Itoje, with the lineout set to be a keenly-fought contest between two giant second rows. Getty Images 7/24 6. Tom Curry On stand-by at No 8 should Vunipola not come up good this week, but looks to be finding his feet at blindside flanker and is due a breakout performance. Reuters 8/24 7. Sam Underhill Another of England’s standout performers who is leading the defensive rush along with Itoje. Underhill has been a unit without the ball and chipped in with some powerful carries against Tonga and the US, but against David Pocock and Michael Hooper, this will be his biggest test yet. PA 9/24 8. Billy Vunipola Providing he is towards the scale of fully fit, Vunipola is the man to remain in the No 8 shirt given what he offers this team. Perhaps the biggest tell-tale sign of his impact is not what he does in the match, but what his teammates are able to as opposed to when he isn’t there. Getty 10/24 9. Ben Youngs Scored against Argentina in what wasn’t his best performance overall, but will almost certainly continue in the No 9 shirt unless Eddie Jones springs a massive surprise. EPA 11/24 10. George Ford Arguably England’s most impressive and improved player in Japan, which should help him retain the No 10 shirt despite the questions surrounding Owen Farrell’s best position. Getty 12/24 11. Jonny May England biggest threat out wide, who after opening his account against the Pumas and set to win his 50th cap could make the most of the space that Australia’s play will leave. Getty Images 13/24 12. Owen Farrell The chance to try him back out at 10 disappeared with the cancelled game against France, meaning he almost certainly has to be retained at centre. AFP via Getty 14/24 13. Manu Tuilagi England’s powerhouse option in midfield who has the potential to do some serious damage up against James O’Connor, Tuilagi looks to be playing his best rugby for the last half a decade. REUTERS 15/24 14. Anthony Watson Retains his position due to Jack Nowell’s hamstring injury that looks set to keep him out of the squad altogether. Watson has found his feet well since getting back into the international fold, but now it’s time to step it up a gear. World Rugby via Getty Images 16/24 15. Elliot Daly Will be looking to build on his best outing at full-back for England against Argentina, and is unlikely to face a barrage of high balls from the Wallabies meaning he will get the opportunity to join the attack. Getty Images 17/24 16. Luke Cowan-Dickie Remains England’s top try-scorer of the tournament despite being back-up to Jamie George. Brings good energy to the pack off the bench and his lineout accuracy is improving a great deal. Getty Images 18/24 17. Mako Vunipola A very good argument for him to go straight into the starting XV, but from the bench he and Marler can put together a solid 80-minute showing at loosehead that gives Jones a nice flexibility of when to introduce the Saracens prop. AP 19/24 18. Dan Cole A simple choice with Sinckler still the No 1 tighthead in the squad. PA 20/24 19. Courtney Lawes Is knocking on the door of a start and looks to be well ahead of Joe Launchbury in the pecking order. PA 21/24 20. Lewis Ludlam Is a toss of a coin between him and Mark Wilson for the back-row replacement spot, but with Curry proving he can cover at No 8 if needed two weeks ago, the need to have Wilson there reduces slightly and Jones has been very impressed with Ludlam’s energy. EPA 22/24 21. Willi Heinz Pushing Youngs hard for a start, and his box-kicking ability would certainly prove a problem for the Wallabies. Look out for a new tactic in wearing tape on his fingers to combat the slippery ball. AP 23/24 22. Henry Slade Still has reservations over his injured left knee that remains heavily strapped in training, and with his big run-out scuppered in the France game, a place on the bench looks most likely. Getty Images 24/24 23. Jonathan Joseph With Nowell unlikely to be included, Jones looks set to select Joseph in front of either Joe Cokanasiga and Ruaridh McConnochie. Getty 1/24 England vs Australia Eddie Jones is set to name his England team on Thursday for the Rugby World Cup quarter-final - but who should he select? Getty 2/24 1. Joe Marler Marler has fully recovered from his back ‘niggle’ suffered against Argentina and has made the No 1 shirt his own. Despite having Mako Vunipola available again, if England are to show that he needs to play his way into the team, this is the time to show it. AFP via Getty Images 3/24 2. Jamie George Brings lineout reliability and mobility from the forwards – though he’d certainly like to start bagging a few tries like fellow hooker Luke Cowan-Dickie! Getty Images 4/24 3. Kyle Sinckler His limited game time so far in Japan means we haven’t seen him at his best, but this match has all the ingredients for Sinckler to show he’s ready for the big stage. World Rugby via Getty Images 5/24 4. Maro Itoje Has been pinpointed by Australia as being one of the players who they cannot allow to dominate the game. His lineout skills and leading defensive effort is helping him to stand out among the rest of the side. Getty Images 6/24 5. George Kruis Likely to continue his Saracens partnership with Itoje, with the lineout set to be a keenly-fought contest between two giant second rows. Getty Images 7/24 6. Tom Curry On stand-by at No 8 should Vunipola not come up good this week, but looks to be finding his feet at blindside flanker and is due a breakout performance. Reuters 8/24 7. Sam Underhill Another of England’s standout performers who is leading the defensive rush along with Itoje. Underhill has been a unit without the ball and chipped in with some powerful carries against Tonga and the US, but against David Pocock and Michael Hooper, this will be his biggest test yet. PA 9/24 8. Billy Vunipola Providing he is towards the scale of fully fit, Vunipola is the man to remain in the No 8 shirt given what he offers this team. Perhaps the biggest tell-tale sign of his impact is not what he does in the match, but what his teammates are able to as opposed to when he isn’t there. Getty 10/24 9. Ben Youngs Scored against Argentina in what wasn’t his best performance overall, but will almost certainly continue in the No 9 shirt unless Eddie Jones springs a massive surprise. EPA 11/24 10. George Ford Arguably England’s most impressive and improved player in Japan, which should help him retain the No 10 shirt despite the questions surrounding Owen Farrell’s best position. Getty 12/24 11. Jonny May England biggest threat out wide, who after opening his account against the Pumas and set to win his 50th cap could make the most of the space that Australia’s play will leave. Getty Images 13/24 12. Owen Farrell The chance to try him back out at 10 disappeared with the cancelled game against France, meaning he almost certainly has to be retained at centre. AFP via Getty 14/24 13. Manu Tuilagi England’s powerhouse option in midfield who has the potential to do some serious damage up against James O’Connor, Tuilagi looks to be playing his best rugby for the last half a decade. REUTERS 15/24 14. Anthony Watson Retains his position due to Jack Nowell’s hamstring injury that looks set to keep him out of the squad altogether. Watson has found his feet well since getting back into the international fold, but now it’s time to step it up a gear. World Rugby via Getty Images 16/24 15. Elliot Daly Will be looking to build on his best outing at full-back for England against Argentina, and is unlikely to face a barrage of high balls from the Wallabies meaning he will get the opportunity to join the attack. Getty Images 17/24 16. Luke Cowan-Dickie Remains England’s top try-scorer of the tournament despite being back-up to Jamie George. Brings good energy to the pack off the bench and his lineout accuracy is improving a great deal. Getty Images 18/24 17. Mako Vunipola A very good argument for him to go straight into the starting XV, but from the bench he and Marler can put together a solid 80-minute showing at loosehead that gives Jones a nice flexibility of when to introduce the Saracens prop. AP 19/24 18. Dan Cole A simple choice with Sinckler still the No 1 tighthead in the squad. PA 20/24 19. Courtney Lawes Is knocking on the door of a start and looks to be well ahead of Joe Launchbury in the pecking order. PA 21/24 20. Lewis Ludlam Is a toss of a coin between him and Mark Wilson for the back-row replacement spot, but with Curry proving he can cover at No 8 if needed two weeks ago, the need to have Wilson there reduces slightly and Jones has been very impressed with Ludlam’s energy. EPA 22/24 21. Willi Heinz Pushing Youngs hard for a start, and his box-kicking ability would certainly prove a problem for the Wallabies. Look out for a new tactic in wearing tape on his fingers to combat the slippery ball. AP 23/24 22. Henry Slade Still has reservations over his injured left knee that remains heavily strapped in training, and with his big run-out scuppered in the France game, a place on the bench looks most likely. Getty Images 24/24 23. Jonathan Joseph With Nowell unlikely to be included, Jones looks set to select Joseph in front of either Joe Cokanasiga and Ruaridh McConnochie. Getty\n\nThe shuffling of the midfield pack is just one of a number of fizzing subplots to what is really several games in one. The breakdown, with the stellar young duo of Tom Curry and Sam Underhill going up against the garlanded veterans Michael Hooper and David Pocock, will be a particular zone of interest. The selection of Jordan Petaia at centre, a 19-year-old from Brisbane with just 11 Super Rugby games and two international caps to his name, offers the thrilling frisson of the unknown. Meanwhile, can Australia’s impressive front five disrupt England at the set piece? And in a game that may well be decided from the kicking tee, will Farrell – a pale shadow of his best self so far this tournament – finally stand up?\n\nThese are the fine margins that will decide this quarter-final. Jones adores control, but in his two decades at the sharp end of the sport, he’s seen enough to know that these games are won by infinitesimal fractions. Back in July, the squad sat down together at a training camp in Bristol to watch England win the Cricket World Cup in a thrilling, knife-edge final. Afterwards, Jones stood up and addressed them. “That,” he explained, “is what we train for. The margin of errors.”\n\nAnd so the temptation to anoint England as favourites should be resisted at all costs. There’s been a lot of talk this week about England’s 6-0 recent record against Australia, about Jones’s psychological hold over his opposite number Michael Cheika, a former team-mate back at Randwick in the 1980s. But like the hills and valleys of Oita Prefecture, the rarefied air of World Cups often create their own microclimate. Surprises are surprisingly common at this stage of the tournament: Ireland in 2015, South Africa in 2011 and New Zealand in 2007 will all testify to that.\n\nIn short, we don’t know a thing. Except that for many of the players on both sides, Saturday’s game will take them to places they have never been before. It will be uncomfortable and unfamiliar and stressful beyond measure. And really, when the heat is on and the steam begins to rise, there are two ways of approaching it. You can wilt in the shadows, fearing the worst, doubting yourself. Or you can kick off your Speedos, bare your cheeks to the world and step boldly into the bubbling cauldron.", "description": "To a first-time bather, the onsen - the Japanese hot springs that are a cherished tradition on the southern island of Kyushu – present an intimidating prospect. For starters, there are the myriad prohibitions. Hair in the pool is a no-no. Tattoos, due to their historical association with the Yakuza, organised crime and annoying gap-year hippies, are a big no-no. Washing", "authors": ["Jonathan Liew"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/18/12/Owen-Farrell.jpg", "published_at": "2019-10-18"}