{"pub": "usatoday", "url": "https://usatoday.com/story/sports/ncaaf/bigten/2019/10/05/penn-state-dominates-purdue-set-up-big-ten-showdown-iowa/3881838002", "downloaded_at": "2019-10-05 22:11:50.192572+00:00", "title": "Penn State defense dominant in defeat of Purdue as Big Ten showdowns await", "language": "en", "text": "CLOSE\n\nSTATE COLLEGE, Pa. — They came in heavy waves, like a forever-threatening sky finally opening up over the desert scrub.\n\nIt didn't stop once it began, the onrush of defensive line pressure firing at the helpless backup quarterback.\n\nPenn State's defense led the nation in sacks last year and has been built to inflict this kind of damage routinely, especially up front at scrimmage. The linemen call themselves the \"Wild Dogs\" and they certainly do attack more as a group than relying on any one standout.\n\nForgive them, then, if they looked a bit leaner and hungry through the early-going this season. They wouldn't admit to being frustrated, but it sure looked that way until yesterday's homecoming spectacle in Beaver Stadium.\n\nPenn State defensive end Shaka Toney (18) sacks Purdue quarterback Jack Plummer during the second quarter at Beaver Stadium. (Photo: Jonathan Jones, USA TODAY Sports)\n\nThey won the day that devolved into a most uninspiring day of offense: Penn State 35, Purdue 7.\n\nBefore Saturday, the Penn State pass rush had experienced so many near-misses, particularly galling against the likes of Buffalo and Pittsburgh, the latter in a last-play escape.\n\nEarlier this week, senior tackle Robert Windsor expressed a patient perspective: \"Offenses, they know we have a good D-Line so they are prepared. One, they are getting the ball out quick, and two, they are max protecting. So I'm not worried about the sacks. I know they are going to come.\"\n\nThen battered and beaten Purdue ventured into the day as a four-touchdown underdog, playing without its injured senior quarterback and All-American receiver.\n\nThe Nittany Lions began with just enough flash and fireworks on offense. KJ Hamler pulled off another reel of highlight stop-and-go moves on punt returns. Jahan Dotson looked just as explosive in turning a mid-range pass play into a 72-yard touchdown.\n\nKJ Hamler isn't @PennStateFball's only big-play, shifty WR.\n\n\n\nJahan Dotson (@H55ZY) is pretty good, too. pic.twitter.com/5qOna83S1y — Big Ten Network (@BigTenNetwork) October 5, 2019\n\nQuarterback Sean Clifford looked every bit the comfortable leader, growing a bit more with time.\n\nBut this day was for the defense, particularly with its heavy-hammer throwing up front. It was one promising take heading into the rest of a Big Ten schedule in October that has successive games against No. 14 Iowa, No. 18 Michigan and No. 23 Michigan State.\n\nPenn State still was second in Big Ten sacks (3.8 per game) coming into the weekend, but it didn't feel that successful. Not when you bring down Buffalo and Pittsburgh quarterbacks just four times over 80 pass attempts.\n\nThat changed in the biggest way Saturday, so much pouring down from every angle. Junior Shaka Toney nearly equaled his stunning four-sacks-in-a-quarter effort from last year at Indiana.\n\nThe speedy rusher took down Purdue's Jack Plummer three times in the first quarter.\n\nStar rusher Yetur Gross-Matos crashed into the party twice more early on. Backups Fred Hansard and Jayson Oweh swallowed up late, first-half Purdue drives.\n\nThe total was remarkable for just one half effort in a Big Ten game: seven sacks, all by defensive linemen.\n\nThe nation's No. 2 team in scoring defense held Purdue to only 49 first-half yards.\n\nActually, it seemed a minor miracle that the Boilermakers had scored at all.\n\nThe downpour simply would not end.\n\nOn Purdue's first offensive play of the second half, Windsor and fellow tackle Antonio Shelton combined on yet another sack.\n\nThe onslaught became an even more welcome sight as the afternoon progressed. The Penn State offense and special teams seemed to lose their attention to detail and began a string of nagging mistakes that derailed opportunities.\n\nMaybe some dysfunction as the result of boredom, unknowingly letting your focus slip?\n\nClifford's miscommunication with Hamler led to his second interception of the season — immediately preceding Purdue's only touchdown.\n\nThe Lions muffed a punt return. They still can't get former No. 1 running back Ricky Slade going (4 carries, 2 yards).\n\nThey couldn't put together a scoring drive of any kind again until the very end.\n\nBy the middle of the third quarter it appeared as the Lions had all but buttoned up their offense as if to save fuel for the wicked stretch of opponents to come.\n\nThen again, when your defense can stranglehold an opponent like this one, the Wild Dogs about tearing off their leashes ...\n\nSafety Lamont Wade flying in for the ninth sack early in the fourth quarter.\n\nLinebacker Micah Parson dragging down the QB for the 10th a few minutes later.\n\nLetting those guys clean up the day seemed like not such a disappointing result, after all.", "description": "Penn State unleashed a dominant defense on Purdue and cruised to a 35-7 victory that set up a Big Ten showdown with Iowa.", "authors": ["Frank Bodani", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/05/PPYR/48660737-56bc-4054-97ff-b840ea6b54d8-USATSI_13465397.jpg?crop=4489,2525,x1,y243&width=3200&height=1680&fit=bounds", "published_at": "2019-10-05"}