{"pub": "yahoo", "url": "https://news.yahoo.com/ted-cruz-urges-hong-kong-163529041.html", "downloaded_at": "2019-10-13 08:56:01.636398+00:00", "title": "Ted Cruz urges Hong Kong protesters to shun violence, accuses Carrie Lam of 'weakness'", "language": "en", "text": "Sen. Ted Cruz (R-Texas) wasn't able to make any inroads with Hong Kong Chief Executive Carrie Lam during his visit to the city Saturday, but he did get a chance to meet with a few pro-democracy protesters.\n\nCruz was supposed to meet with Lam, but he was informed upon landing that the meeting was canceled. Cruz said Lam's office had asked that the details of their meeting remain secret and requested Cruz not speak to the press about it. Apparently, the senator wasn't keen on those terms, and it looks like the disagreement proved to be a sticking point for both sides. Cruz described the cancelation as a \"sign of weakness\" and \"fear of the protesters on the streets of Hong Kong.\"\n\nCruz, who is one of Congress' staunchest Beijing critics, was reportedly wearing all black when he arrived in Hong Kong in solidarity with the protest movement. He said he met with a few of the movement's leaders and urged them to shun any forms of violence, even in response to police or government brutality, while they continue their efforts.\n\nCruz wasn't the only U.S. official who came up during Hong Kong's 19th consecutive week of demonstrations. Protesters were reportedly determined to prove to President Trump that the rallies were still going strong after Trump said they had \"toned down a lot\" and that China had made \"great progress\" in its response to the situation. \"We will still come out here swinging the American flag to let him know he is wrong,\" one protester told The Wall Street Journal, adding that many people are still holding out for U.S. support.", "description": "Sen. Ted Cruz (R-Texas) wasn't able to make any inroads with Hong Kong Chief Executive Carrie Lam during his visit to the city Saturday, but he did get a chance to meet with a few pro-democracy protesters.Cruz was supposed to meet with Lam, but he was informed upon landing that the meeting was canceled", "authors": ["Tim O'Donnell"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-12"}