{"pub": "investing.com", "url": "https://investing.com/analysis/correction-in-gold-stocks-continues-200469645", "downloaded_at": "2019-10-02 00:33:17.148325+00:00", "title": "Correction In Gold Stocks Continues", "language": "en", "text": "Several weeks ago both and gold stocks hit major resistance after strong but extended moves. A correction or pause was to be expected. Clearly, we can now say the sector is in correction mode.\n\nCorrections tend to have three legs: a simple down-up-down or A-B-C pattern. The gold stocks (and gold) appear to be on the C leg of that A-B-C pattern.\n\nBelow we plot the daily bar charts for and .\n\nGDX (NYSE: ) has a confluence of strong support at $24-$25 while GDXJ has support at $34-$35 but could fill its open gap at $32.50 to $33.00.\n\nGold Miners, Jr. Gold Miners (bottom)\n\nAs the correction continues, another thing we will follow is our custom breadth indicators. In the chart below we plot GDXJ along with the percentage of GDXJ stocks that closed above their 200-day moving average, 50-day moving average and 20-day moving average.\n\nAt the recent short-term low during the Fed meeting, the percentage of GDXJ stocks trading above the 50-day moving average and 20-day moving average showed a very oversold condition.\n\nBefore Monday, the percentage of GDXJ stocks trading above the 200-day moving average was 87%. That needs to decrease quite a bit before we get a sustainable rebound.\n\nJr. Gold Mining Stocks And Their MAs\n\nCircling back to GDX (NYSE: ), it is critical to understand its long-term technical position. Below we plot the , which is the parent of GDX and has a history of 25 years.\n\nThe large-cap gold stocks (as evidenced by GDX (NYSE: )) are correcting around resistance that dates back over 20 years.\n\nAfter the 2013 crash and ensuing selloff, it took GDX (NYSE: ) three years to rally back to that level. Following that peak, it has taken another three years.\n\nDaily NYSE Gold Miners Index\n\nWhile it will not take another three years for the gold stocks to bust through that resistance, it’s unlikely to take only a few months. It could be anywhere from a few quarters to a year.\n\nThat will depend on the fundamental developments, which we have discussed in our past missives.\n\nFor now, look for more selling in the gold stocks but then a decent rebound into November that could eventually morph into a consolidation. What follows from there will depend on Fed policy and inflation.\n\nIn the meantime, better value and new opportunities will continue to emerge. Don’t panic. Instead, use this time to tweak your portfolio and err on the side of buying quality at a discount.", "description": "Stocks Analysis by Jordan Roy-Byrne, CMT covering: XAU/USD, Gold Futures, ARCA Gold Miners, VanEck Vectors Gold Miners ETF. Read Jordan Roy-Byrne, CMT's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-01"}