{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-israel-election/weakened-netanyahus-offer-of-unity-government-rebuffed-by-rival-gantz-idUKKBN1W40OO", "downloaded_at": "2019-09-19 23:19:41.038732+00:00", "title": "Weakened Netanyahu's offer of unity government rebuffed by rival Gantz", "language": "en", "text": "JERUSALEM (Reuters) - Israel’s weakened Prime Minister Benjamin Netanyahu saw his offer on Thursday of a coalition with his strongest political rival swiftly rebuffed after failing to secure a governing majority in a tight election.\n\nNetanyahu’s surprise move was an abrupt change of strategy for the right-wing leader. Benny Gantz’s rejection of this offer could spell weeks of wrangling after Tuesday’s election, which followed an inconclusive national ballot in April.\n\nGantz’s centrist Blue and White party emerged from the second round of voting this year slightly ahead of Netanyahu’s Likud but lacking the numbers in the 120-member parliament to form a ruling bloc.\n\nNetanyahu, Israel’s longest-serving leader, said in a video clip in which he urged Gantz, the country’s former military chief, to meet him “as soon as today”, that he had pledged during the election campaign to form a right-wing, Likud-led government.\n\n“But to my regret, the election results show that this is impossible,” Netanyahu said. “Benny, we must set up a broad unity government, as soon as today. The nation expects us, both of us, to demonstrate responsibility and that we pursue cooperation.”\n\nResponding to Netanyahu’s call, Gantz made no mention of the prime minister and said he himself would head a “liberal” coalition, political shorthand for one that excludes the Israeli leader’s long-time ultra-Orthodox allies.\n\nGantz said Israelis were eager for a unity government to end the political uncertainty.\n\nBut he then left it to Moshe Yaalon, a fellow Blue and White leader, to deliver a stinging rejection of a partnership with Netanyahu, citing looming corruption charges against the prime minister, who has denied any wrongdoing.\n\n“We will not enter a coalition led by Netanyahu,” Yaalon said, echoing a position Gantz had taken throughout the election campaign and appearing to suggest that an alliance with Likud would be possible if it dumped its veteran chief.\n\n“The time has come for you to tell Netanyahu, ‘Thank you for all you’ve done’,” Yaalon urged Likud members - who have shown no sign so far of rebellion.\n\nNetanyahu said he was “surprised and disappointed” and reiterated his call to Gantz to join him.\n\n“It’s what the public expects of us,” Netanyahu said about a broad government.\n\nNARROW DIFFERENCES\n\nThe campaigns run by Netanyahu, 69, and Gantz, 60, pointed to only narrow differences on many important issues, and an end to the Netanyahu era would be unlikely to bring about significant changes in policy on relations with the United States, the regional struggle against Iran or the Palestinian conflict.\n\nIsraeli Prime Minister Benjamin Netanyahu, Israeli President Reuven Rivlin and Benny Gantz, leader of Blue and White party, hold hands at a memorial ceremony for late Israeli President Shimon Peres, at Mount Herzl in Jerusalem September 19, 2019. REUTERS/Ronen Zvulun\n\nWith Israeli media reporting 99 percent of votes counted in Tuesday’s election, a Likud-led right-wing, religious bloc looked poised to control 55 of parliament’s 120 seats, with up to 57 going to a centre-left alliance.\n\nOnce all the votes are counted, President Reuven Rivlin, who welcomed Netanyahu’s unity call, will hold consultations with parties that won representation in parliament and give one of its leaders up to 42 days to form a government.\n\nThe political deadlock left former defence minister Avigdor Lieberman, head of the far-right Yisrael Beitenu party which has eight seats, as a potential king-maker in the coalition-building. He has called for a secular unity government.\n\nBut Lieberman, on Thursday was unconvinced by Netanyahu’s unity offer, which, in a statement, he said was “no more than a trick and an attempt to paint a false picture to prepare public opinion for a third round of elections.”\n\nGantz is a newcomer to politics. Many voters saw him as a “Mr Clean”, an alternative to Netanyahu and the cloud of alleged criminal misdeeds hanging over him.\n\nNetanyahu’s call for a broad government preceded a scheduled visit later on Thursday by outgoing U.S. envoy Jason Greenblatt, an architect of President Donald Trump’s as-yet unveiled plan for Israeli-Palestinian peace.\n\nA senior White House official said Greenblatt “will have discussions with various parties regarding the U.S.-Israel relationship, regional dynamics and the administration’s peace efforts.”\n\nIsraeli media said Greenblatt may meet both Netanyahu and Gantz.\n\nSlideshow (5 Images)\n\nPalestinians, who seek a state in the West Bank and Gaza Strip with East Jerusalem as its capital, have rejected the Trump plan out of hand, accusing the president of pro-Israeli bias.\n\nWith Israeli politics in flux, Netanyahu cancelled his annual speech at the U.N. General Assembly next week, a spokesman said on Wednesday about a visit that might have provided an opportunity to meet with Trump.\n\nNetanyahu highlighted his close ties with Trump in his election campaign. But in Los Angeles on Wednesday, Trump appeared to distance himself from Netanyahu, amid political stalemate in Israel.\n\nHe told reporters he had not spoken to Netanyahu since Tuesday’s ballot and said: “Our relationship is with Israel”.", "description": "Israel's weakened Prime Minister Benjamin Netanyahu saw his offer on Thursday of a coalition with his strongest political rival swiftly rebuffed after failing to secure a governing majority in a tight election.", "authors": ["Jeffrey Heller", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190919&t=2&i=1431667029&w=1200&r=LYNXMPEF8I0OL", "published_at": "2019-09-19"}