{"pub": "yahoo", "url": "https://finance.yahoo.com/news/ams-renews-4-4-billion-171415858.html", "downloaded_at": "2019-10-21 00:20:32.460114+00:00", "title": "AMS Renews $4.4 Billion Bid for German Lighting Maker Osram", "language": "en", "text": "(Bloomberg) -- AMS AG renewed its 4 billion-euro ($4.4 billion) offer for Osram AG, relaxing a key shareholder acceptance requirement as a rival suitor dropped out of the bidding for the German lighting company.\n\nWhile the price offered by the Austrian sensor maker remains 41 euros a share, the acceptance threshold was lowered to 55%, AMS said in a statement Friday. Osram jumped 3% in Germany, while AMS dropped 4.6% in Zurich before trading was suspended prior to the announcement.\n\nAMS, a supplier to Apple Inc., has pursued the former Siemens AG division through numerous setbacks and a prolonged takeover battle. It moved to block rival suitors Bain Capital and Advent International by acquiring a 19.9% stake in Osram, yet AMS Chief Executive Officer Alexander Everke has yet to win over the German company’s labor unions.\n\n“We are in constructive discussions with Osram,” Everke said in the release, adding that commitments to employees and manufacturing locations in Germany are among the topics on the table.\n\nAMS’s latest move follows a supervisory board meeting Friday, where executives looked at options including upping the capital contribution to finance the deal to lower the debt component, people with knowledge of the matter said earlier.\n\nBain and Advent said separately on Friday that they have dropped their pursuit of Osram “for the time being.”\n\nOsram representatives had urged AMS to address lingering concerns around strategy, job cuts and the massive debt burden tied to the deal, one of the people said. AMS planned to invest in the company’s Regensburg, Germany site that makes high-tech chip components, but said it would sell the digital division that makes lighting controls, stage and theater lights.\n\n“Over the past few days, we have had constructive discussions with AMS about the conditions for a new takeover bid,” Osram CEO Olaf Berlien said. “The managing board welcomes the progress made so far and is confident that both sides can agree on a future-oriented strategic concept.”\n\nAMS’s previous offer received 51.6% support from Osram investors, short of the 62.5% acceptance threshold that was in place then.\n\nBringing the two companies together should create synergies in excess of 300 million euros, AMS said. The figure includes more than 120 million euros from optimizing manufacturing operations and an additional more than 120 million euros from combining corporate functions, IT and research and development.\n\nAMS has also lined up a 4.4 billion-euro bridge facility and slightly increased a proposed share sale to 1.6 billion euros to pay for the deal.\n\nOsram’s workforce continues to oppose the transaction which the IG Metall union called a “hostile” takeover. “The reasons for our clear rejection of a takeover by AMS are still valid. The already unacceptably high financial risks are even further increased by the new approach,” IG Metall said in a statement on Saturday.\n\n(Adds union statement in last paragraph)\n\nTo contact the reporter on this story: Eyk Henning in Frankfurt at ehenning1@bloomberg.net\n\nTo contact the editors responsible for this story: Anthony Palazzo at apalazzo@bloomberg.net, Angela Cullen\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- AMS AG renewed its 4 billion-euro ($4.4 billion) offer for Osram AG, relaxing a key shareholder acceptance requirement as a rival suitor dropped out of the bidding for the German lighting company.While the price offered by the Austrian sensor maker remains 41 euros a share, the acceptance", "authors": ["Eyk Henning"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-20"}