{"pub": "guardian", "url": "https://theguardian.com/lifeandstyle/2019/sep/27/why-anything-is-better-than-nothing", "downloaded_at": "2019-09-27 14:59:31.632580+00:00", "title": "Do as much as you can – not as little as you can get away with | Oliver Burkeman", "language": "en", "text": "Do as much as you can – not as little as you can get away with\n\nAccording to new government guidelines, even a minute or two of physical exercise is better than nothing: just walking upstairs and down again, before resuming your otherwise entirely sofa-based afternoon of crisps and television, makes for a healthier life than if you hadn’t bothered. It even counts towards the 150 minutes of moderate-to-brisk exercise you ought to be getting per week. The previous recommendation was for a 10-minute minimum, but for years, the general direction of research has been toward the conclusion that there is no minimum at all. This doesn’t just go for exercise, either. Tiny amounts of meditation make a difference; five minutes in nature can boost your mental health; and while one daily serving of vegetables may be too few, it’s definitely preferable to zero. If you are wondering whether or not some tiny but healthful activity is worth it, the answer, almost always, is yes.\n\nIt’s a little strange, actually, that this is even a topic of debate. Of course anything is better than nothing. For one thing, it’s a good start for building more substantial habits. But tiny actions are valuable in themselves. Human bodies aren’t digital devices, and health generally isn’t a matter of reaching fixed thresholds, or fulfilling quotas; what is good for the organism in large quantities is usually good in smaller ones, too. Naturally, if you have a specific goal – such as running the marathon next year, or measurably reducing your chances of an early death – specific minimums may apply. But for any meaningful definition of “health” it’s still healthier to spend 23 hours and 59 minutes per day in bed, punctuated by a short stroll around the room, than if you had never got up at all.\n\nThe real reason for the controversy is not that the facts are in dispute. It’s that information is dangerous. When public bodies recommend, say, a 10-minute minimum, it’s because they worry that if they don’t, people who might otherwise have exercised for 10 minutes will stop after two.\n\nEven this column risks making things worse. If you had truly been planning to spend all day on the sofa, perhaps I have inspired you to take a five-minute walk; but if there is a chance that you would have gone to the gym for an hour, reading these words might persuade you to settle for the stroll instead.\n\nDoes overconsumption of bad TV lead to populism? | Oliver Burkeman Read more\n\nTo justify your preferred course of action, you simply conjure a hypothetical alternative version of yourself who would have been even lazier – by not exercising at all – then congratulate yourself on doing better than that. (You can justify anything this way: 10 long-haul flights per year may be awful for the climate, but better than the 200 you could have taken.)\n\nIdeally, we would stop thinking about healthy behaviours in terms of minimums: within reason, you should be doing as much exercise as you can, not as little as you can get away with – while remembering that nothing is too minor to be not worth the bother. This is a sensible approach to much of life, I would say, from being a good friend or paying attention to your kids, to saving money or reducing your environmental impact. However much you do, it will never be enough. But that is not a reason to do nothing – on the contrary, it’s a reason to do something\n\nListen to this\n\nIn an episode of the One You Feed podcast, the behavioural scientist Michelle Segar explains why grandiose fitness goals can get in the way of change.", "description": "We should stop thinking in terms of minimums – do as much exercise as you can, not as little as you can get away with", "authors": ["Oliver Burkeman"], "top_image": "https://i.guim.co.uk/img/media/aab833c2d90cd339af1c7b142043a3e01e10dbff/0_19_1453_872/master/1453.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=78031004a08da51f5b5443439014d92d", "published_at": "2019-09-27"}