{"pub": "cbs", "url": "https://secure-fly.cbsnews.com/news/syria-humanitarian-crisis-unfolds-as-violence-escalates-2019-10-14", "downloaded_at": "2019-10-14 23:17:21.404118+00:00", "title": "Humanitarian crisis unfolds as violence escalates in Syria", "language": "en", "text": "Dohuk, Iraq — President Trump Monday called for an immediate halt to Turkey's invasion of Syria and is sending Vice President Mike Pence to Turkey. The president also plans to authorize new sanctions against Turkey's leaders and said he will raise tariffs on Turkish steel.\n\nCivilians and journalists, including CBS News correspondent Charlie D'Agata, are scrambling to flee the fighting. With rumors swirling that the Syrian regime was about to retake the border crossing between Syria and Iraq, CBS News rushed to get there.\n\nBefore crossing back into Iraq Monday, CBS News saw a country that had changed dramatically since the president announced the withdrawal of U.S. troops from Syria.\n\nSyrian regime forces swept into towns and cities held until Sunday by the Syrian Kurds. Kurdish hospitals were overwhelmed with casualties, including small children. Turkish-backed militias took ground quickly and ruthlessly, even executing Kurdish soldiers and civilians on the roadside.\n\nU.S. troops withdrawing from Syria as conflict escalates\n\nDesperate Kurdish forces told CBS News they hoped their U.S. allies would step in. Commander Redur Xelil said they fought alongside Mr. Trump's soldiers and hopes he can at least stop the Turkish airstrikes.\n\n\n\nBut the announcement of the U.S. withdrawal gave the Kurds no choice but to cut a deal with America's sworn enemies, the Syrian regime, backed by Russia. With Turkish forces advancing to a crucial highway in northeast Syria, choking off supply and escape routes, the Syrian regime moved swiftly to take over the key cities of Kobani, Qamishli and Al Hasaka.\n\nMeanwhile, Turkish forces said they found a prison used to hold ISIS fighters deserted. Hundreds of ISIS family members and supporters had escaped from a detention camp, and Kurdish forces told CBS News they were struggling to contain 11,000 ISIS detainees.\n\nMr. Trump said Monday that U.S. troops being pulled out of Syria will remain in the Middle East to prevent an ISIS resurgence. As CBS News correspondent David Martin reports, with Turkish forces moving south and Russian-backed Syrian units advancing north, 1,000 troops are caught in the middle, looking for the safest way out.\n\nU.S. \"preparing to evacuate\" remaining troops from northern Syria, defense secretary says\n\nJoint Chiefs Chairman General Mark Milley spoke by phone with the Russian chief of staff in an effort to make sure there is no interference with the American withdrawal. It will include equipment as well as troops, as Defense Secretary Mark Esper said to Margaret Brennan on \"Face the Nation.\"\n\n\"We want to make sure we de-conflict a pullback of forces. We want to make sure we don't leave equipment behind,\" he said.\n\nWhen the withdrawal order was issued, U.S. troops were strung out across northern Syria from near the Iraq border as far west as Manbij. The most exposed units are being pulled back to larger bases that can be better defended.\n\nKobane near the Turkish border has an airstrip that can handle everything from helicopters to jet transports and has served as the logistics hub for the now-defunct alliance between the U.S. and Kurdish fighters in the campaign against ISIS. If the withdrawal goes according to plan, it will take 15 to 30 days, moving out equipment first and then people.\n\nMr. Trump has blamed the upheaval on Turkey and Turkish President Erdogan. On Monday, he announced he will impose sanctions and is fully prepared to destroy Turkey's economy. Republican Senator Lindsey Graham said Congress would pile on with more.\n\n\"We're going to break his economy until he stops the bloodshed,\" Graham said.", "description": "In little more than a week, longstanding alliances have crumbled and old enemies have teamed up after the U.S. began pulling its forces out and Turkey invaded Syria", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/14/9f2cbdb9-541d-445c-9614-645a9f8b2d2e/thumbnail/1200x630/3077a9e4da34b02565c330770551450b/gettyimages-1175966735.jpg", "published_at": "2019-10-14"}