{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/12/beto-orourke-hands-gop-nra-golden-ticket", "downloaded_at": "2019-09-13 07:23:57.786412+00:00", "title": "Beto O'Rourke hands GOP, NRA golden ticket", "language": "en", "text": "ANALYSIS/OPINION:\n\nThanks, Beto.\n\n“Hell yes, we’re going to take your AR-15, your AK-47,” he said, on television, on the Democratic Party debate stage, for all to hear and see. “We’re not going to allow them to be used against fellow Americans anymore.”\n\nAnd with that, all the Democrats who’ve tried for years to deny the gun confiscation motives behind their gun control pushes went — nooooooo.\n\nIt doesn’t get any clearer than that, does it?\n\n“Hell yes,” we’re going to take your guns.\n\n“Hell yes,” we’re going to confiscate your firearms.\n\n“Hell yes,” we’re going to one day, make it so the Second Amendment is a Second Amendment In Name Only — and that whole God-given right to self-defend is a thing of the past.\n\nDemocrats have been trying for years to convince Americans that registrations and limits on assault weapons and universal background checks and other so-called common sense gun control proposals were harmless steps to curb gun-related violence that even hard-core Second Amendment activists should embrace. That the evil National Rifle Association and all those evil gun rights groups were trying to drum up fears of confiscations that just weren’t true.\n\nThat Democrats had no intention of taking away firearms from the legal gun owners. That if you like your gun, you can keep your gun.\n\nAnd for some, the left’s talking points have been convincing. Particularly, as school shootings and tragic, heartbreaking stories of gun-related violence dominate far too many media cycles.\n\nThen comes Beto, charging to clarify.\n\n“Hell yes,” we’re going to confiscate.\n\nIt doesn’t get more honest than that.\n\nThere’s the golden ticket the NRA, the Republican Party, the patriotic Second Amendment supporters of this country needed to prove their argument, to prove their points, to showcase the truths about the Democrats’ ultimate gun controlling end game.\n\nDemocrats want to confiscate guns, pure and simple. Beto O’Rourke himself admitted it.\n\n• Cheryl Chumley can be reached at [email protected] or on Twitter, @ckchumley.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Thanks, Beto. \"Hell yes, we're going to take your AR-15, your AK-47,\" he said, on television, on the Democratic Party debate stage, for all to hear and see. \"We're not going to allow them to be used against fellow Americans anymore.\" It doesn't get any clearer than that.", "authors": ["The Washington Times Http", "Cheryl K. Chumley"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/12/Election_2020_Debate_30854.jpg-ee593_c0-135-3221-2013_s1770x1032.jpg?c8bdd4e07509b8dad51d9628e0a6f0b7ace9e5e1", "published_at": "2019-09-12"}