{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7600315/British-intelligence-officers-evidence-Manchester-Arena-terror-attack.html", "downloaded_at": "2019-10-22 13:48:00.124208+00:00", "title": "British intelligence officers will give evidence on Manchester Arena terror attack", "language": "en", "text": "British intelligence officers will be able to give evidence about the build-up to the Manchester Arena bombing in private following a decision today.\n\nIt will be the first time that an inquiry into a terrorist attack on mainland Britain has taken place partly behind closed doors since 9/11.\n\nHome Secretary Priti Patel previously applied for key parts of the intelligence material about the bomber to be kept secret due to 'national security considerations' - including a statement provided by MI5 from a person known only as 'Witness X'.\n\nSome of the evidence in the inquests into the victims of the Manchester bombings will be kept secret following a decision by the Home Secretary today\n\nThe coroner has since granted her application and asked for the inquests to convert the inquest into an inquiry so that he could consider the material behind closed doors.\n\nMs Patel has now approved his request, which has the effect that the public and victims' families will be excluded from some parts of the hearing.\n\nIt is a break from tradition, with the 7/7 inquests, Westminster and London Bridge inquests all took place in public, even though the last one involved a live MI5 investigation which failed to stop the attack.\n\nAt a previous hearing where the issue was discussed, John Cooper, a lawyer representing the families of 11 of the 22 victims, said the secrecy application had come from 'the very people who could potentially be severely criticised'.\n\nMr Cooper told a hearing that both the security service and police were open to 'severe analysis with potentially severe and critical consequences.'\n\nHe said the applications were 'very important' for the families and 'go to the root of understanding what happened to their loved ones as well as a wider public understanding.'\n\nFlowers and tributes left in St Ann's Square in Manchester in June 2017, following the attack\n\nRetired High Court judge Sir John Saunders will lead the inquiry into the attack at an Ariana Grande gig in May 2017 which left 22 people dead and 260 injured.\n\nSir John was nominated by the Lord Chief Justice to lead the investigation and inquest into the deaths caused by Salman Abedi, 22, detonating a suicide vest.\n\nMs Patel said she made the decision after 'careful consideration of advice from Sir John that inquest proceedings should be adjourned and an inquiry established'.\n\nHome Secretary Priti Patel (at 10 Downing Street in Westminster today) said she made the decision after 'careful consideration'\n\nShe said: 'It is vital that those who survived or lost loved ones in the Manchester Arena attack get the answers that they need and that we learn the lessons, whatever they may be.\n\n'This process is an important step for those affected as they look to move on from the attack and I know that they want answers as quickly as possible.\n\n'I am determined to make this happen, while ensuring the proper processes are followed.\n\n'Now that the coroner has decided that an inquest cannot properly investigate the deaths, I have agreed to establish an inquiry to consider all the information so that he can make appropriate recommendations.'\n\nThe Government insisted the inquiry 'will have the same scope as the current inquest' and the arrangements for it will now be a matter for the chair.\n\nA spokesman said: 'The Home Office will provide support and ensure that the inquiry has the resources that it needs.'\n\nIn the aftermath of the attack there was a nationwide outpouring of grief with families and friends of the victims left devastated.\n\nThe attack saw 22 people killed by the improvised explosive device which was carried in a rucksack. More than 260 were injured, with 600 people reporting psychological harm.\n\nSaffie Rose Roussos, eight, was the youngest victim to die in the attack, alongside Martyn Hett, 29, Georgina Callander, 18, Olivia Campbell, 15, off-duty police officer Elaine McIver, 43, John Atkinson, 26, Kelly Brewster, 32, Alison Lowe, 44, and friend Lisa Lees, 43.\n\nMarcin Kils, 42, and Angelika Kils, 39, Nell Jones, 14, Jane Tweddle, 51, Michelle Kiss, 45, Sorrell Leczkowski, 14, Chloe Rutherford, 17, and Liam Curry, 19, Eilidh MacLeod, 14, Wendy Fawell, 50, Courtney Boyle, 19, and her stepfather Philip Tron, 32, and Megan Hurley, 15, were also named as victims.", "description": "Retired High Court judge Sir John Saunders will lead the inquiry into the attack by Salman Abedi at an Ariana Grande gig in May 2017 which left 22 people dead and 260 injured.", "authors": ["Duncan Gardham", "Richard Spillett", "Mark Duell For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/13/20033716-0-image-a-10_1571746011900.jpg", "published_at": "2019-10-22"}