{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/economic-dept-of-dubai-unveils-blockchain-based-business-registry", "downloaded_at": "2019-10-08 01:24:07.203459+00:00", "title": "Economic Dept. of Dubai Unveils Blockchain-Based Business Registry", "language": "en", "text": "The Department of Economic Development in Dubai has announced its move to a blockchain-based unified business registry platform (UBRP).\n\nAccording to a Saudi Gazette report on Oct. 7, the platform aims to improve the ease of doing business in Dubai and enable license issuers to manage trade licenses and corporate registries.\n\nThe Silicon Oasis Authority, the Dubai Electricity and Water Authority, and Dubai Multi Commodities Centre have already joined the platform. The UBRP eventually aims to host a total of 40 government entities.\n\nThe solution is hosted on the blockchain-as-a-service platform called Dubai Pulse, which is a joint initiative of Smart Dubai — Duba’s smart city initiative — and telecommunications firm du. Dubai Pulse is also part of the broader Emirates Blockchain Strategy 2021, which was announced in April 2018.\n\nThe UAE has set a goal to make sure that 50% of government transactions will be blockchain-based by 2021.\n\nDubai to launch Know Your Customer-focused blockchain association\n\nCointelegraph reported in July that a partnership between the Dubai International Financial Centre, Mashreq Bank and fintech firm Norbloc was planning to launch a blockchain-based Know Your Customer (KYC) data-sharing association in 2020, with the intention to combine the KYC efforts of participating financial institutions and government bodies.", "description": "The Dubai Department of Economic Development has announced a blockchain-based business registry platform", "authors": ["Joeri Cant"], "top_image": "https://images.cointelegraph.com/images/740_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9mZTMzYWZhNWM0ZTIwNzQ3Y2JjMTlmMzVhZmU0NjE3Mi5qcGc=.jpg", "published_at": "2019-10-08"}