{"pub": "fox", "url": "https://foxnews.com/opinion/trump-economy-results-women-female-entrepreneurs-rose-tennent", "downloaded_at": "2019-10-03 07:24:57.577177+00:00", "published_at": "2019-10-03", "title": "Rose Somma Tennent: Trump’s economy has delivered real results for women. Female entrepreneurs are proof", "language": "en", "text": "Women are thriving in the Trump economy, and female entrepreneurs don’t put much credence in the deceptive liberal narrative about this president. I know because I have talked with many of them.\n\nPast experience dictates that polls are not reliable, particularly when applied to his supporters. Conservative women cannot be stereotyped. -- They can be a stay-at-home mom, a CEO or owner of a large corporation or both. For them, there is no call to comply with a pre-determined lifestyle. They have the support of other women in their Party, regardless of the choices they make.\n\nPresident Trump has delivered real results for women; in his first year of office, the number of women in poverty fell by nearly 600,000. Since then, his pro-growth economic policies have improved the lives of millions of women. Since he took office, the economy has created nearly 6 million new jobs, more than 3 million of which have been filled by women.\n\nTRUMP VISITS OHIO FACTORY WITH AUSTRALIA'S PRIME MINISTER, TOUTS ECONOMY\n\nAdditionally, the national female unemployment rate remained close to its all-time low for many months. Female unemployment has not been this low since the days of Rosie the Riveter.\n\nThere is a huge but silent support base for President Trump. The women highlighted in this article, however, are not silent. They and their businesses have benefitted from the Trump administration’s policies and the president’s commitment to jobs. They recognize that President Trump is fighting for the American worker and American companies. Businesses have waited a long time for an administration that puts them first.\n\nAmerican workers understand that Trump is fighting for their best interests and what will benefit them long term. When President Trump looks to make deals, he does so with our country’s best interests in mind and with the skills of a businessman for whom deals have consequences, as opposed to a politician who depends on the voter forgetting by the next Election Day that his deals didn’t pan out.\n\nPresident Trump's pro-growth economic policies have improved the lives of millions of women. Since he took office, the economy has created nearly 6 million new jobs, more than 3 million of which have been filled by women.\n\nTrump’s policies have lightened the burden by lowering taxes and eliminating regulations that crush the spirit of capitalism.\n\nTrump has demonstrated through policy and trade agreements that everything we’ve been told about America’s decline is wrong. We can manufacture items here at home.\n\nIn the recent past, we were sold the idea that America’s best days were behind her, that the new normal was 1 –1.5 percent annual growth. That was the leveling wind of globalism.\n\nTrump’s policies shattered that idea in less than 18 months. In this new environment, the world is taking notice that the words “made in America” mean something again.\n\nMadeInAmerica.com, Founder and CEO, Don Buckner, will be hosting the first-ever Made In America trade show, where I serve as spokesperson, in Indianapolis from October 3 - 6.\n\nDon was in manufacturing since 1997 when he launched Vac-Tron Equipment from his garage. He sold his company in 2018 to go all-in on #AmericanMade and to hold a trade show to highlight Made In America manufacturers and celebrate National Manufacturing Day on October 4.\n\nWhile manufacturing has traditionally been perceived as a male domain, more and more women are working in manufacturing and leading a myriad of companies. In Indianapolis, among the many exhibitors at the event, there are several female powerhouses in the industry.\n\nThe women highlighted below have benefitted from the administration’s policies and its commitment to jobs. Here's what they told me:\n\nIn 2006, Angela Horevitz wanted to find a better way for those who love to bake, to store or transport baked goods without compromising icing, and to keep food fresh. She started Bakers Sto N Go in 2007, producing a food storage container with adjustable shelves on the inside.\n\nAngela is convinced that the quality of the materials obtained in the U.S. is far superior; “I’ve heard horror stories about purchase order delays, and items arriving damaged or poorly assembled, when ordering from overseas. I find that manufacturers are now hiring at an all-time high, and that’s good for everyone.”\n\nCEO Barbara Creighton’s Sarati International in South Texas provides a natural rebalancing option for women going through menopause.\n\nIn the 1990’s Barbara searched to find a safe product for her personal use and discovered a product that would provide a natural path towards rebalancing. She told me, “I’m so appreciative of what President Trump has done for consumer confidence. Our customers who sell our proprietary or custom formulations in their spas or on Amazon are expanding their businesses. The Trump effect blesses us all as sales and profits increase.”\n\nCLICK HERE TO GET THE OPINION NEWSLETTER\n\nBeverlee Dacey, President of Amodex, a company providing solutions to what could potentially be anyone’s worst nightmare, stains - including a Sharpie. The materials used are non-toxic and sourced in the U.S.\n\nBeverlee took over the company during the recession in 2008 and committed to supporting her fellow U.S. manufactures in the supply chain. She’s less concerned about cost than she is about what might be in the ingredients in solutions from other countries.\n\nShe said that this administration has “restored the Made in USA brand and revived our status in global markets. We’re finding that more foreign companies and consumers want American made products again.”\n\nPresident Trump has put American jobs first. As more manufacturers look to sourcing their materials in the U.S., they’re finding the price for those materials have become increasingly more competitive.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nMany saw the “trade wars” on the horizon and took steps to source materials and products domestically. As the demand grew for more American-made materials, new businesses begun to sprout up to meet that demand. Over the last two and a half years the U.S. economy has added over 500,000 manufacturing jobs according to the Bureau of Labor Statistics.\n\nWomen have made incredible economic progress under President Trump, and as more women continue to enter the workforce at every level, it’s more important than ever to continue to pursue the pro-growth, America first policies that got us to where we are today.\n\nFor more info on the Made In America Trade Show visit www.madeinamerica.com", "description": "Women are thriving in the Trump economy, and female entrepreneurs don’t put much credence in the deceptive liberal narrative about this president. I know because I have talked with many of them.", "authors": ["Rose Tennent", "Rose Tennent Has Been A Prominent Figure For Twenty Years As A Syndicated Conservative Talk Show Host. She Is Currently The Spokesperson For Made In America Trade Show. Rose Serves On Advisory Board For Women For Trump Coalition", "Moms For America."], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/28/694940094001_6090259054001_6090264467001-vs.jpg"}