{"pub": "yahoo", "url": "https://news.yahoo.com/hgtv-star-found-guilty-molesting-210614782.html", "downloaded_at": "2019-10-20 00:18:49.902338+00:00", "title": "HGTV star found guilty of molesting 10-year-old girl in Connecticut", "language": "en", "text": "HGTV star Christopher Dionne was found guilty of molesting a little girl, 10, this week.\n\nOn Wednesday, Dionne was convicted of risk of injury to a minor and fourth degree sexual assault at the New London Superior Court in Connecticut, People reports.\n\nThe November 2017 incident allegedly occurred at Dionne's Connecticut home while his victim was having a sleepover with his daughter, who she was best friends with at the time, per her testimony during the trial this year. According to the arrest warrant, Dionne reportedly touched the little girl inappropriately while his son and daughter were asleep in the same room. She alleges that he also took a photo of her on his phone and molested her a second time a few hours later.\n\nCredit: Connecticut State Police\n\nWhen the little girl refused his advances, which included him asking her if she was a \"big girl or a little girl\" and \"if you tell your mom, I'll go to jail and [my daughter] won't have a daddy,\" the TV star retreated to his own bedroom, the warrant said.\n\nA similar incident allegedly occurred two months earlier, in September, when he asked the 10-year-old if she wanted to kiss his genitals, People reports.\n\nDionne appeared on \"Family Flip,\" which ran for just one episode back in 2015 after HGTV declined to pick the show up.\n\n\"The person you reference in your inquiry appeared in a pilot that premiered on our network more than 2-1/2 years ago,\" the network previously told People. \"The pilot was not picked up for series and is no longer on our air.\"\n\nChristopher Dionne is expected to be released on a $100,000 bond as he awaits his December 11 sentencing.", "description": "Christopher Dionne, who appeared on the pilot episode of 'Family Flip,' was convicted of risk of injury to a minor and fourth degree sexual assault.", "authors": ["Aol.Com Editors"], "top_image": "https://s.yimg.com/uu/api/res/1.2/NIFGhkt3e1fIGXt7qqODKA--~B/aD02NzU7dz0xMDI4O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://o.aolcdn.com/images/dims3/GLOB/crop/782x513+0+280/resize/1028x675!/format/jpg/quality/85/https://s.yimg.com/os/creatr-uploaded-images/2019-10/c980e620-f1ea-11e9-9fef-ae690cd444d2", "published_at": "2019-10-18"}