{"pub": "bbc", "url": "https://bbc.co.uk/news/business-49628875", "downloaded_at": "2019-09-09 11:46:30.988391+00:00", "title": "The UK's 'worst' airport revealed", "language": "en", "text": "Image copyright Sean McMullan Image caption In March, passengers had to queue outside the airport in freezing conditions due to delays at security\n\nLong queues, crowded terminals and pricey parking charges have led to Belfast International being rated the UK's worst airport in a survey by consumer magazine Which?.\n\nCustomers gave the airport an approval score of 42%, saying it was \"shabby\", \"understaffed\" and had a poor layout.\n\nIt came just behind London Luton on 43% and Manchester T3 on 47%.\n\nBy contrast \"cosy\" Doncaster Sheffield came top, followed by Birmingham and Heathrow's Terminal 5.\n\nIn April and May this year, 4,499 Which? members were surveyed about 6,237 airport experiences in terms of satisfaction.\n\nPeople could mention up to four experiences, and an airport would only be included if it got more than 30 responses, with the results then weighted.\n\nImage copyright Which? Image caption Which? members said Belfast International looked \"shabby\"\n\nOf the 4,499 people who took part in survey, 68 of them focused on Belfast International.\n\nThe airport acknowledged passengers had faced problems during the past 18 months, but said satisfaction had improved since the survey.\n\n'Leaps and bounds'\n\nThe survey took place just after the airport invested more than £1m in its security, expanding security lanes following months of complaints about long delays.\n\n\"Our new security company has taken us on in leaps and bounds with our staff,\" Belfast International Airport managing director Graham Keddie told BBC Radio Ulster.\n\n\"It [the survey] was done in April and May before the changes were really in place, in fact we started with the changes at Easter.\n\n\"We have now got a tracking system in place and we're seeing more than 90% of our passengers going through in less than 15 minutes.\n\n\"It's perhaps legacy from the past, but again we've got to take it on board and continue to improve.\"\n\nHe said he believed the airport's parking charges were very reasonable and were below most other UK airports.\n\nOf the largest airports with more than 10 million passengers a year, Luton was the worst performer, a position it has held for four years running.\n\nDespite terminal improvement works finishing in December, Luton travellers complained about \"limited seating\" and \"congested\" security queues.\n\nAberdeen International was ranked the worst Scottish Airport for the fifth year in row, with a customer score of 50%.\n\nCustomers criticised its staff and seating, with one telling Which? they only used the airport for \"geographic convenience\", not out of choice.\n\nBest performers\n\nBy contrast, Doncaster Sheffield topped the survey for the third year in a row, with customers calling it a \"cosy airport\" with no queues that was \"easy to navigate\".\n\nThe Yorkshire hub got a customer satisfaction score of 86% - although some respondents said they wished it offered more connections than its current 55.\n\nHeathrow Terminal 5 was the best performing large airport, with a score of 66%. Customers praised its ample seating, helpful staff and toilet facilities, although there were complaints about its high parking charges.\n\nA spokesperson for London Luton Airport (LLA) said: \"We're disappointed by our ranking but pleased to see this year's customer score has improved 23% compared to last year. This highlights passengers are now beginning to see the benefits of our £160m redevelopment.\"\n\nThey added that of the 4,499 people surveyed by Which?, only 273 had used Luton, while the airport has more than 16 million passengers a year.\n\nSteve Szalay, managing director of Aberdeen International Airport, said Which's survey was \"months out of date and in no way tallies with the hugely positive feedback we're receiving from the tens of thousands of passengers who are travelling through our doors on a weekly basis\".", "description": "A survey by consumer magazine Which? looks at the frustrations of travellers across the UK.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/B0FC/production/_105980354_4c9a8b68-4494-4278-a3c1-426be0ce07bf.jpg", "published_at": "2019-09-09"}