{"pub": "politico", "url": "https://politico.com/story/2019/09/05/jason-greenblatt-mideast-exit-administration-1482619", "downloaded_at": "2019-09-06 12:08:59.975598+00:00", "title": "White House Mideast envoy to exit administration", "language": "en", "text": "Jason Greenblatt (left) and Jared Kushner. | Sean Gallup/Getty Images white house White House Mideast envoy to exit administration\n\nOne of the key architects of President Donald Trump's plan to broker peace between the Israelis and Palestinians is departing the White House, Trump announced Thursday.\n\n\"After almost 3 years in my Administration, Jason Greenblatt will be leaving to pursue work in the private sector. Jason has been a loyal and great friend and fantastic lawyer,” Trump tweeted, adding: “His dedication to Israel and to seeking peace between Israel and the Palestinians won’t be forgotten. He will be missed. Thank you Jason!”\n\nStory Continued Below\n\nIn Greenblatt's absence, Avi Berkowitz, a longtime aide to Trump’s son-in-law and senior adviser Jared Kushner, will take on an expanded role in the talks, as will the State Department's special representative to Iran, Brian Hook.\n\nThe White House began taking steps at the end of last year to make Greenblatt’s departure a smooth transition, including involving Berkowitz more, integrating Greenblatt and Hook’s teams at State and building out the White House’s own team, a senior administration official said.\n\nGreenblatt was one of Kushner’s chief negotiators and a point person in the region as the White House crafted its long-awaited blueprint for peace in the region. The plan, which the president has long touted as the “deal of the century,” has been delayed numerous times; it is not expected to be rolled out before elections in Israel later this month that will decide whether Prime Minister Benjamin Netanyahu is reelected.\n\nGreenblatt, an adviser on Israel to the 2016 Trump campaign, was tapped for the Middle East envoy job shortly after Trump’s election. He had previously served as the executive vice president and chief legal officer for the Trump Organization.\n\nPOLITICO Playbook newsletter Sign up today to receive the #1-rated newsletter in politics Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nIn a statement, Greenblatt called his time with the White House the \"honor of a lifetime.”\n\n“I am incredibly grateful to have been part of a team that drafted a vision for peace. This vision has the potential to vastly improve the lives of millions of Israelis, Palestinians and others in the region,” he continued, thanking his wife and family. “I will thoroughly miss working with my friends and colleagues Jared Kushner, David Friedman and Avi Berkowitz, as well as the many other dedicated individuals within the US government who were instrumental in our efforts.”\n\nWhat little of the administration's peace plan has been unveiled — an economic stimulus package intended to jumpstart local economies — landed with a thud and was dismissed by Palestinians as a “snow job” and a waste of taxpayer dollars. A subsequent Israeli-Palestinian economic summit in Bahrain helmed by the White House was not attended by any officials from Israel or Palestine.\n\nThe plan has also been threatened by escalating tensions with Iran in a summer during which Washington and Tehran have at times appeared on the brink of a military conflict, though it now appears as though both sides are open to talks on Iran’s nuclear program.\n\nA senior administration official said Wednesday that Greenblatt’s exit was his own choice, and that despite the stalled peace efforts, he continued to hold the confidence of Trump and his senior team. He originally intended to join the administration for two years to analyze the Israeli-Palestinian conflict, to draft a realistic and implementable vision to help solve the conflict and to work on developing relationships between Israel and the region, the official said.\n\nThey also said that the White House’s blueprint is complete but will be released when appropriate.\n\nKushner showered praise on Greenblatt for his work, saying in a statement he’d done a “tremendous job.”\n\n“His work has helped develop the relationships between Israel and its neighbors as he is trusted and respected by all of the leaders throughout the region,” Kushner said in a statement. “He is a close friend and partner and will continue to make a positive impact on the world.”\n\nU.S. Ambassador to Israel David Friedman also joined the chorus of praise, calling Greenblatt “a trusted friend and a valued colleague who has touched so many with his wisdom, sincerity and good will. He has made an enormous and indelible contribution which we will seek to build upon as we move forward.”\n\nNetanyahu praised Greenblatt in a tweet from his office’s official account, offering thanks to Greenblatt “for his dedicated work on behalf of security and peace, and for not hesitating for a moment to speak out and tell the truth against all those who spoke ill of the State of Israel.”\n\nNahal Toosi contributed to this report.", "description": "Greenblatt, an adviser on Israel to the 2016 Trump campaign, was tapped for the Middle East envoy job shortly after Trump’s election.", "authors": ["Caitlin Oprysko"], "top_image": "https://static.politico.com/6e/cb/4e55800f4c339a8f661d3111bb77/1985-jason-greenblatt-gty-773.jpg", "published_at": "2019-09-05"}