{"pub": "fox", "url": "https://foxnews.com/us/harvard-student-newspaper-facing-backlash-for-requesting-comment-from-ice", "downloaded_at": "2019-10-23 23:34:12.986018+00:00", "title": "Harvard student newspaper facing backlash for requesting comment from ICE", "language": "en", "text": "The Harvard Crimson, the university’s student-run newspaper, is facing a campus backlash after requesting comment from Immigration and Customs Enforcement (ICE) for an article on a campus protest against the agency.\n\nEleven student groups, including the Harvard College Democrats, signed a petition accusing the Harvard Crimson of showing cultural insensitivity for even contacting the government agency.\n\nOn Sept. 12, students advocating for the abolition of ICE assembled for a rally organized by student group Act on a Dream in Harvard Yard. After the protest concluded, the paper reached out to an ICE spokesperson to ask for a statement in response to the protest for an upcoming story.\n\nPENN STATE FRATERNITY SUSPENDED AFTER HIGH SCHOOL STUDENT, 17, FOUND DEAD AT OFF-CAMPUS HOUSE\n\nSoon after, Act on a Dream published a petition, which currently has over 650 signatures, demanding The Crimson change its policies so that none of its reporters ever make contact with ICE again and apologize for the “harm [it] inflicted on the undocumented community.” It also demanded the paper declare its commitment to protecting undocumented students. The organization called on other groups to boycott speaking to the paper until it agrees to the demands.\n\nNEW JERSEY TEEN ARRESTED IN RUTGERS SEXUAL ASSAULT CASE\n\nThe Harvard Crimson stood by its decision to request comment from ICE. The paper said it seeks to follow “a commonly accepted set of journalistic standards.”\n\n“Foremost among those standards is the belief that every party named in a story has a right to comment or contest criticism leveled against them,” the paper said in a note to readers.\n\n“At stake here, we believe, is one of the core tenets that defines America's free and independent press: the right — and prerogative — of reporters to contact any person or organization relevant to a story to seek that entity's comment and view of what transpired,” the note continued.\n\nThe paper noted it did not provide the names or immigration status of anyone involved in the protest advocating for the abolition of ICE, it did not give ICE forewarning of the protest and it did not seek to interfere with the protest as it was occurring.\n\nEven so, the Harvard College Democrats said they’d cut ties with the paper and accused The Crimson of “calling ICE on students.”\n\n“We're not talking to @thecrimson until they stop calling ICE on students,” the College Democrats tweeted, linking to Act on A Dream’s petition.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“In this political climate, a request for comment is virtually the same as tipping them off, regardless of how they are contacted,” the petition stated.", "description": "The Harvard Crimson, the university’s student-run newspaper, is facing campus backlash after asking for a routine comment request from U.S. Immigration and Customs Enforcement for a story on a campus protest against the agency.", "authors": ["Morgan Phillips"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/harvard.jpg", "published_at": "2019-10-23"}