{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-israel-russia-usa-prisoners/israel-asks-putin-to-pardon-u-s-israeli-jailed-for-moscow-airport-transit-drugs-idUKKBN1WS0I1", "downloaded_at": "2019-10-13 18:48:27.937503+00:00", "title": "Israel asks Putin to pardon U.S.-Israeli jailed for Moscow airport transit drugs", "language": "en", "text": "JERUSALEM (Reuters) - Israel asked Russian President Vladimir Putin on Sunday to pardon a U.S.-Israeli woman given a 7-1/2 year jail sentence for drugs found in her luggage as she transited through a Moscow airport.\n\nNaama Issachar’s case has opened up an unusually public rift between Israel and Russia. Her family says she is being punished disproportionately to pressure Israel into freeing a Russian held in Israel on a U.S. extradition request.\n\nIssachar was arrested in April during a layover in flights from India to Israel. Russian police found 9 grams of cannabis in her luggage, her family says. On Friday, a Russian court sentenced her to 7-1/2 years in jail for drug smuggling.\n\nIn a letter to Putin, Israeli President Reuven Rivlin said Issachar, 25, had “made a grave mistake and has admitted her crime”, and asked the Russian leader for his “personal intervention to grant her an extraordinary pardon”.\n\nThe letter, published on Rivlin’s Twitter account, noted recent Russian help in locating the remains of an Israeli soldier killed by Syrian forces in a 1982 battle.\n\n“The Jewish People and State of Israel are grateful for your sensitivity to human life,” Rivlin wrote to Putin.\n\nPutin would be informed about the letter and consider the request once the Kremlin receives it via diplomatic channels, spokesman Dmitry Peskov told Reuters.\n\nIssachar’s family accuses Russia of punishing her after failing to swap her for Alexei Burkov, a Russian national detained by Israel during a 2015 visit. Israel says he is wanted by the United States for suspected cyber offences.\n\nIsraeli Prime Minister Benjamin Netanyahu has appeared to rule out any such exchange, saying Israel’s Supreme Court had approved Burkov’s extradition to the United States.\n\nIsraeli and U.S. officials would not disclose further details of Burkov’s suspected crimes and his lawyer did not respond to a request for comment.\n\nIsraeli newspaper Globes said Burkov had been indicted in 2015 by the state of Virginia for running an internet credit card scam and was arrested in December that year at the Israeli international airport where he arrived as a tourist.\n\n“I have been held in an Israeli jail for four years now because of political games,” Burkov told Israel’s Reshet TV News in a telephone interview on Sunday. He also said that he had no links to Russian government or intelligence agencies.\n\nTo be implemented, Burkov’s extradition must be formally approved by Israel’s justice minister, Amir Ohana, who on Saturday said he would decide whether to do so within days and hinted that he might weigh a rival Russian extradition request.\n\nSuch a request had been filed by Russia, Ohana told Israel’s Channel 13 TV, but it was “rather thin in terms of material”.\n\n“In order to decide that he is extraditable to Russia, a court needs to rule that he is extraditable. That has not yet happened,” Ohana said.\n\nThe U.S. Embassy in Israel has not commented on the Burkov or Issachar case.", "description": "Israel asked Russian President Vladimir Putin on Sunday to pardon a U.S.-Israeli woman given a 7-1/2 year jail sentence for drugs found in her luggage as she transited through a Moscow airport.", "authors": ["Dan Williams", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-13"}