{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7613515/Louise-Redknapp-admits-doesnt-know-marriage-Jamie-broke-down.html", "downloaded_at": "2019-10-25 16:44:02.924416+00:00", "title": "Louise Redknapp 'doesn't know' why marriage to Jamie broke down", "language": "en", "text": "Louise Redknapp has insisted she still 'doesn't know' why her marriage to Jamie broke down after 19 years together.\n\nThe singer, 44, said on Friday's This Morning that despite rumours, she 'doesn't blame' her stint on Strictly Come Dancing for the breakdown of her marriage, as she and Jamie split in late 2017, a year after she appeared on the show.\n\nLouise also told Richard Madeley and Judy Finnigan that it took her a 'long time' to get over the split thanks to large amount of people involved, but she's moving forward now as she plots her musical comeback.\n\nScroll down for video\n\nCandid: Louise Redknapp, 44, has insisted she still 'doesn't know' why her marriage to Jamie broke down after saying it took 'a long time' to get over the split\n\nLouise candidly spoke about the end of her marriage as she chatted to Richard and Judy about her long-awaited musical comeback.\n\nWhen asked directly what went wrong between her and Jamie, she said: 'I wish I knew, it was really sad and sad times for the whole family. It's something that takes a long time to get over.'\n\nJust a year before she and Jamie split, Louise was a contestant on Strictly in 2016, and during the stint rumours were rife about the show's famous curse.\n\nSad: Louise divorced husband Jamie in late 2017 after 19 years of marriage. The couple are parents to sons Charles, 15, and Beau, ten (pictured in 2016)\n\nOpen: The singer said on Friday's This Morning that she 'doesn't blame' her stint on Strictly Come Dancing for the end of her marriage, despite rumours about the show's 'curse'\n\nBut Louise said that actually taking part in the show actually proved that she can't blame anyone for the end of her marriage.\n\nShe said: 'It reminded me that this was no one's fault, and not Jamie's, things go on far deeper than a TV programme.\n\n'What the programme did for me just reminded me how much I loved performing. My kids see that now they come to their gigs and say ''do you know what mum it's been a tough time but it's really lovely to see you singing along in a car. '\n\n'Times like that I get asked all the time about it, but when there's a whole family involved it's massive in everybody's life.'\n\nSpeaking out: When asked what went wrong, Louise said: 'I wish I knew, it was really sad and sad times for the whole family. It's something that takes a long time to get over'\n\nLouise also spoke to Richard and Judy about her comeback to music, which comes with the release of her new album Heavy Love in early 2020.\n\nWhen asked whether her new album has any reference to the end of her marriage, she said: 'I never went into making the album with it being about that because you don't, but when you're in the studio naturally you pull your heart out.\n\n'There are songs on the album that are never bashing, it was just how I felt as a mother as a wife. This whole album, all you can do is put on what you've been through.'\n\nThe music marks Louise's first new release in 18 years, and she admitted there's no exact reason why she took such a long break from the industry.\n\nTruth: She said: 'It reminded me that this was no one's fault, and not Jamie's, things go on far deeper than a TV programme'\n\nGlamorous: Louise was a guest on This Morning to chat about her long-awaited musical comeback, which comes with her new album set for release in early 2020\n\nShe told Richard and Judy: 'I think it was just life, life got in the way I got married and had a family and as time goes on the industry changes so much, you need something to happen for there to be a reason.\n\n'It wasn't meant to be 18 years it just happened. I did Strictly and wanted to get back out there working, and someone in management said: ''Do you fancy doing a one-off gig.''\n\n'I was really scared it had been a long time. I spent a long time making an album, then we sat down and looked at all the music they said you really need to do an album.'\n\nBefore the interview viewers also enjoyed a throwback clip of Louise from her days in the girl band Eternal, and the star said that she still looks back fondly on her days with the group.\n\n'They were great times being part of Eternal I'm so proud because those record sales just don't happen today, being an artist now so much has changed in my life,' she said.", "description": "The singer, 44, said on Friday's This Morning that she 'doesn't blame' her stint on Strictly Come Dancing for the breakdown of her marriage, after she and Jamie split in late 2017.", "authors": ["Laura Fox For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/12/20177872-0-image-a-95_1572004564315.jpg", "published_at": "2019-10-25"}