{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7595661/Megan-Barton-Hanson-shows-ex-Chelcee-Grimes-shes-missing-dons-eye-popping-lace-catsuit.html", "downloaded_at": "2019-10-21 08:56:23.663574+00:00", "title": "Megan Barton Hanson shows ex Chelcee Grimes what she's missing as she dons eye-popping lace catsuit", "language": "en", "text": "She has reportedly gone her separate ways from singer/songwriter Chelcee Grimes.\n\nAnd Megan Barton Hanson showed her ex what she's missing as she donned a racy lace catsuit for a sultry Instagram snap on Sunday.\n\nThe former Love Island star, 25, exhibited her toned frame and ample bust in the saucy sheer garment, which featured a daring zip down the centre.\n\nChelcee, who? Megan Barton Hanson showed her ex what she's missing as she donned a racy lace catsuit for a sultry Instagram snap on Sunday\n\nTeasing a glimpse of her ample assets and hugging her toned waist, the Ann Summers outfit also showcased her toned legs.\n\nHer raven tresses were styled in tumbling waves, parted in the middle and held back with a pair of cat ears.\n\nThe beauty accentuated her pretty features with smoky shadow and scarlet lipstick.\n\nLooking every inch the sex kitten, the star struck a confident pose in the photo captioned: 'The baddest p***y in the room.'\n\nThe sexy snap comes days after Megan and footballer Chelcee, 27, apparently ended their six week long romance.\n\nOver: Megan and Chelcee, 27, were said to have ended their six-week romance last week (pictured last month)\n\nThe pair are said to both be 'upset' by their separation with the singer apparently busy concentrating on new music.\n\nA source told The Sun: 'They got on really well and enjoyed a brief romance, but decided to call it a day earlier this week.\n\n'Both were a bit upset about it, but remain pals.\n\nEx-lovers: The former couple were last pictured together as they arrived home from a trip to LA earlier this month (Megan, left, and Chelcee, right, pictured in 2011)\n\n'Chelcee is throwing herself into her music projects and concentrating on recording new tracks at the moment.'\n\nMailOnline has contacted both Megan and Chelcee's representatives for comment.\n\nThe former couple were last pictured together as they arrived home from a trip to LA earlier this month.\n\nWhile they visited the Women's Super League trophy in Manchester City's Etihad together last month.\n\nComparing her relationship with Wes, 21, to with Chelsee, Megan previously told Metro Online: 'It is definitely different [dating girls to guys], my whole life I’ve never really had a relationship with girls, like I said on Celebs Go Dating.\n\n'And I’ve had, sexual experiences with girls and I’ve had one night stands with girls, but I feel like this is actually me, I’ve never felt so comfortable in my life, I feel like I’m finally where I should be.\n\n'Don’t get me wrong, I was in love with all my exes but this is just a different feeling, like the connection we have.'\n\nIn September, Megan confirmed their relationship, writing on Instagram: 'SO proud to call this absolute babe my GIRLFRIEND,' with a love heart eyes emoji.", "description": "Megan Barton Hanson showed her ex what she's missing as she donned a racy lace catsuit for a sultry Instagram snap on Sunday.", "authors": ["Eve Buckland For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/09/19981692-0-image-a-41_1571646234519.jpg", "published_at": "2019-10-21"}