{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/ap/article-7545235/US-troops-start-pullout-Turkeys-border-Syria.html", "downloaded_at": "2019-10-07 06:55:21.030198+00:00", "title": "US troops start pullout from along Turkey's border in...", "language": "en", "text": "BEIRUT (AP) - U.S.-backed Kurdish-led forces in Syria say American troops have begun withdrawing from areas along Turkey's border.\n\nThis comes hours after the White House said U.S. forces in northeastern Syria will move aside and clear the way for an expected Turkish assault - essentially abandoning Kurdish fighters who fought alongside American forces in the yearslong battle to defeat the Islamic State group.\n\nThe Syrian Democratic Forces say the move comes as Turkey is preparing to attack Kurdish-held areas in northeast Syria.\n\nThe statement warns the Turkish invasion would be a blow to the fight against IS militants.\n\nThe Kurdish Hawar news agency and the Britain-based Syrian Observatory for Human Rights also say American troops were evacuating positions near the towns of Ras al-Ayn and Tal Abyad on Monday.\n\nIn this Sept. 21, 2019, photo, released by the U.S. Army, a U.S. soldier oversees members of the Syrian Democratic Forces as they demolish a Kurdish fighters' fortification as part of the so-called \"safe zone\" near the Turkish border. (U.S. Army photo by Staff Sgt. Andrew Goedl via AP)\n\nA Turkish n armored vehicles patrol as they conduct a joint ground patrol with American forces in the so-called \"safe zone\" on the Syrian side of the border with Turkey, near the town of Tal Abyad, northeastern Syria, Friday, Oct.4, 2019. The patrols are part of a deal reached between Turkey and the United States to ease tensions between the allies over the presence of U.S.-backed Syrian Kurdish fighters in the area. (AP Photo/Baderkhan Ahmad)\n\nFILE - In this Wednesday, July 11, 2018, file photo, President Donald Trump, left, talks with Turkey's President Recep Tayyip Erdogan, as they arrive together for a family photo at a summit of heads of state and government at NATO headquarters in Brussels. The White House says Turkey will soon invade Northern Syria, casting uncertainty on the fate of the Kurdish fighters allied with the U.S. against in a campaign against the Islamic State group. (AP Photo/Pablo Martinez Monsivais, File)\n\nTurkish and American armored vehicles patrol as they conduct joint ground patrol in the so-called \"safe zone\" on the Syrian side of the border with Turkey, near the town of Tal Abyad, northeastern Syria, Friday, Oct.4, 2019. The patrols are part of a deal reached between Turkey and the United States to ease tensions between the allies over the presence of U.S.-backed Syrian Kurdish fighters in the area. (AP Photo/Baderkhan Ahmad)", "description": "BEIRUT (AP) - U.S.-backed Kurdish-led forces in Syria say American troops have begun withdrawing from areas along Turkey's border.This comes hours after the...", "authors": ["Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/07/wire-19382842-1570430852-365_636x382.jpg", "published_at": "2019-10-07"}