{"pub": "guardian", "url": "https://theguardian.com/travel/2019/oct/08/worlds-first-travel-guide-to-be-displayed-at-the-british-musuem", "downloaded_at": "2019-10-08 12:53:58.843882+00:00", "title": "World’s first travel guide to be displayed at the British Musuem", "language": "en", "text": "Bernhard von Breydenbach made a pilgrimage to the Holy Land in the 15th century – then wrote up his trip in a guidebook\n\nVisitors to the British Museum will get the chance to see the world’s earliest example of a travel guidebook when it goes on display later this week as part of a new exhibition. The 500-year-old book was written by Bernhard von Breydenbach in 1486, following his pilgrimage to the Holy Land from 1483-1484, and features illustrations of Venice and Jerusalem made by the Dutch artist Erhard Reuwich, who travelled with the writer.\n\nPeregrinatio in Terram Sanctam (A pilgrimage to the Holy Land) will be part of the exhibition Inspired by the east: how the Islamic world influenced western art (adults £14, under 16s free), which opens on 10 October and runs until 26 January 2020. The book, written in Latin, caused a stir on publication – as it represented the first time many in western Europe had seen realistic depictions of these notable destinations.\n\nInspired by the East review – a glorious show Boris Johnson really ought to see Read more\n\nAccording to Giulia Bartrum, curator of German prints at the British Museum, the book offered a tantalising glimpse of places many knew of but few had seen before.\n\n“The large panoramas of famous cities are what make this book so remarkable, and are what made it a 15th-century ‘bestseller’,” said Bartrum. “Before it, most of the depictions of places such as Jerusalem or Venice were totally made up. Very few people in Europe had ever visited these places, so they had no realistic idea of what they looked like until this wonderfully detailed guidebook came along.”\n\nThe exhibition will display one of only a handful of surviving first editions of the book, opened at Reuwich’s “pull-out” map of Jerusalem: the first-ever printed map of the city, with the Dome of the Rock at its centre.\n\nBreydenbach’s pilgrimage started in Oppenheim near Mainz, south-west Germany, and was undertaken in the hope of obtaining salvation for his soul after an apparently dissolute youth. As part of this odyssey he also visited Corfu, Rhodes and Cairo, which, much later, also received the travel guidebook treatment.\n\nLooking for a holiday with a difference? Browse Guardian Holidays to see a range of fantastic trips", "description": "Bernhard von Breydenbach made a pilgrimage to the Holy Land in the 15th century – then wrote up his trip in a guidebook", "authors": ["Robert Hull"], "top_image": "https://i.guim.co.uk/img/media/31a3ca7f7faa8c2d7e507809dd4aaa4f7e067aa4/4651_418_4313_2590/master/4313.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3bbe8740de548983169e99f1374ba7ab", "published_at": "2019-10-08"}