{"pub": "politico", "url": "https://politico.com/story/2019/09/06/facebook-google-antitrust-probe-1710488", "downloaded_at": "2019-09-07 02:17:40.020624+00:00", "title": "State antitrust probes target Facebook, Google as feds investigate tech", "language": "en", "text": "A bipartisan group of state attorneys general are looking at the market power of Facebook. | Alexander Koerner/Getty Images Technology State antitrust probes target Facebook, Google as feds investigate tech\n\nFacebook and Google are facing new scrutiny of their size and power across multiple fronts, as news emerges of state antitrust investigations and the escalation of Federal Trade Commission and Justice Department competition inquiries into Silicon Valley.\n\nNew York Attorney General Tish James, a Democrat, announced on Friday she's leading a bipartisan group of state AGs looking at the market power of Facebook. That's on top of a separate probe by more than 30 state AGs led by Texas Attorney General Ken Paxton, a Republican, into Google, two people close to the matter previously told POLITICO. The Google investigation is due to be unveiled at a Monday press conference in Washington.\n\nStory Continued Below\n\n“Even the largest social media platform in the world must follow the law and respect consumers,” James said in a statement. \"We will use every investigative tool at our disposal to determine whether Facebook’s actions may have endangered consumer data, reduced the quality of consumers’ choices, or increased the price of advertising.”\n\nThe AGs taking part in the Facebook probe so far include Colorado, Florida, Iowa, Nebraska, North Carolina, Ohio, Tennessee and the District of Columbia. While some states are involved in both the Facebook and Google investigations, the probes are being handled separately. The Wall Street Journal first reported the state action on Facebook.\n\nWill Castleberry, Facebook's vice president of state and local policy, said the company aims to demonstrate to the states that it is in fact subject to ample competition both in the U.S. and globally. \"People have multiple choices for every one of the services we provide,\" he said in a statement. \"We will work constructively with state attorneys general and we welcome a conversation with policymakers about the competitive environment in which we operate.”\n\nMorning Tech Technology news from Washington and Silicon Valley — weekday mornings, in your inbox. Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nSeparately, Federal Trade Commission competition bureau director Bruce Hoffman told POLITICO that his agency's 15-person technology task force, launched in February to look into anti-competitive behavior, has shifted to investigating potential anti-competitive behavior among Silicon Valley's leading firms, after spending recent months gathering information.\n\n“A substantial part of the activities of the task force have turned to investigations and away from background,” Hoffman said in an interview Thursday. “And investigations I can't talk about, but I think it would be fair to say that the primary energy of the task force now is in investigations.”\n\nThe FTC probes could drive the agency to draw on its \"very broad powers,\" Hoffman said, to revisit past tech acquisitions if it finds they've hurt competition. Agency chairman Joe Simons already raised such a possibility in an August Bloomberg interview. If a previously consummated deal is impossible to simply unwind, the agency may seek to force the company in question to spin off other assets to undo the tie-up's harms, Hoffman said.\n\nHoffman declined to name any of the companies under investigation, but Facebook for one revealed in July that it was facing an FTC antitrust probe. Hoffman wouldn't comment on the specifics of that investigation.\n\nThe FTC probes add to mounting pressure from federal authorities that big tech firms have faced in recent months. According to a Friday Securities and Exchange Commission filing, the Justice Department has asked Google's parent company, Alphabet, to hand over information related to past antitrust probes of the company conducted by regulators in the U.S. and abroad. The company anticipates a similar request from the group of state AGs, it said in the filing.\n\nThat revelation follows DOJ's July announcement of a sweeping antitrust probe into whether major tech companies are stifling competition or innovation. Facebook also recently agreed to a $5 billion settlement with the FTC to settle a probe into its data privacy practices. That agency just slapped Google with a $170 million fineand sanctions over YouTube's handling of children's privacy.\n\nFlorida Playbook newsletter Our must-read briefing on what's hot, crazy or shady about politics in the Sunshine State. Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nFacebook, Google and fellow giants Apple and Amazon are also facing intensive scrutiny from Capitol Hill. They're subject to a competition investigation in the House led by Judiciary antitrust subcommittee Chair David Cicilline (D-R.I.) and to an even broader probe from a Senate Judiciary task force led by Sen. Marsha Blackburn (R-Tenn.) into antitrust, privacy, speech moderation and other qualms Washington has with Silicon Valley.\n\nOne of Congress' most vocal tech critics cheered the state AGs' action in a statement Friday. \"I’m heartened to see a new group of attorneys general with the courage to stand up to these powerful companies and fight for citizens,\" said Sen. Josh Hawley (R-Mo.), who as Missouri attorney general launched his own investigations into Facebook and Google. \"Big Tech companies should be held accountable if they are violating our privacy or harming our children or killing innovation.”\n\nThe states' efforts may only expand in scope as they proceed. While Texas is taking the lead with the Google investigation, several other states are taking a prominent role, the sources close to the probe told POLITICO. The number of states involved could grow, one of the people said, adding the probe has been underway for months.\n\nGoogle, in an earlier statement to POLITICO in response to news about the state action, said its \"services help people every day, create more choice for consumers, and support thousands of jobs and small businesses across the country.\"\n\n\"We continue to work constructively with regulators, including attorneys general, in answering questions about our business and the dynamic technology sector,\" said company spokesperson Jose Castaneda.\n\nSeveral state AGs recently met in Washington with U.S. Attorney General William Barr and Makan Delrahim, who heads the Justice Department's antitrust division, to discuss tech competition issues.\n\n", "description": "While some states are involved in both the Facebook and Google investigations, the probes are being handled separately.", "authors": ["Margaret Harding Mcgill"], "top_image": "https://static.politico.com/cf/dc/ff53a7fa4af0a1f764908b1c2dfe/181217-facebook-logo-gtty-773.jpg", "published_at": "2019-09-06"}