{"pub": "businessinsider", "url": "https://businessinsider.com/what-is-a-credit-line-how-to-get-one", "downloaded_at": "2019-09-06 12:11:41.888173+00:00", "title": "What is a credit line? A loan you can borrow from when you need cash", "language": "en", "text": "If you're in need of money, you might be curious about your available options. While there are more traditional options, such as personal loans, that offer a lump sum of cash and a fixed interest rate, there is also the option to get a credit line. A credit line can offer access to the capital you need and be a flexible option to consider.\n\nWhat is a credit line?\n\nA credit line is a a type of revolving credit. It's an amount of money extended to you by a financial institution, such as a bank, that you can draw from when you need it. How much you get approved for will depend on your credit.\n\nA credit line differs from a loan because you can draw upon any amount up to the limit at any time, instead of receiving a lump sum amount as you would with a loan. So if you have a $10,000 credit line, you can draw upon $5,000 for a new home repair project when you need it, while still having $5,000 left on your line of credit.\n\nYou can receive a credit line of a certain amount with a specific time to repay the amount you borrowed. Once you draw from the funds available to you, you'll start accruing interest on the borrowed amount.\n\nAs you pay back what you borrowed, your available credit will increase, similar to a credit card. A line of credit can offer more flexibility in the amount you borrow and what you have access to, compared to a traditional loan.\n\nWhere to get a credit line\n\nIf you need a credit line, you can apply for one at a financial institution, such as a bank or credit union. You'll want to shop around for the best rates and check out any limits and eligibility requirements.\n\nYou may be able to get a line of credit for several thousand dollars and up. For example, Wells Fargo offers a personal line of credit between $3,000 to $100,000.\n\nBefore applying for a credit line with a bank, check your credit report at AnnualCreditReport.com. The information in your credit report is used to create your credit score, so you want to make sure everything looks correct. If there are errors, you can dispute them.\n\nYou can also check your credit score on Credit Karma to see how strong your credit is. Your credit score shows a lender how creditworthy you are and can determine the amount of your credit line.\n\nAfter checking your credit, you can apply for a credit line. Once approved, the financial institution will approve you for a specific amount and have a draw period in which you can use money from your credit line. The draw period can vary, but may last up to several years.\n\nWhen you're approved and ready to draw money from your credit line, the financial institution may give you a specific card or checks. In other cases, the financial institution may transfer the funds to your checking account.\n\nAfter borrowing from the credit line, interest will start to accrue and you'll begin to make payments. As you pay back the credit line, your available credit from your credit line will increase.\n\nTypes of credit lines\n\nThere are various types of credit lines that you may be eligible for, including secured and unsecured credit lines. Secured credit lines are backed by an asset, such as a car or home, which serves as collateral. Unsecured credit lines aren't backed by any collateral, e.g. most credit cards.\n\nOne popular line of credit is a Home Equity Line of Credit, more commonly known as HELOC. Using a HELOC, homeowners can borrow funds against the equity from the home. This is considered a secured credit line as your home is used as collateral for the line of credit.\n\nOther types of unsecured lines of credit, such as some personal lines of credit, don't have any assets to serve as collateral but may have fees, though there may be an annual fee or upfront costs to access the line of credit. You might want to use one to pay for school expenses or car-maintenance costs, or to fund a business-related project — so long as you know you can repay the loan, that is.\n\nThe bottom line\n\nIf you need a line of credit, make sure you can afford to pay it back. Understand how much interest you might pay over time and know the terms and conditions from the lender.\n\nIf you're responsible and only borrow what you need and can pay it back, a line of credit can be a funding option to consider if you need access to money.\n\nRelated coverage from How to Do Everything: Money", "description": "What is a credit line? It's a type of revolving credit that allows you to continue borrowing money over a period of time.", "authors": ["Melanie Lockert"], "top_image": "https://amp.businessinsider.com/images/5d7150f82e22af568e513d57-1920-960.jpg", "published_at": "2019-09-05"}