{"pub": "afr", "url": "https://afr.com/politics/federal/labor-threatens-to-refer-angus-taylor-to-police-over-forged-document-20191024-p533ym", "downloaded_at": "2019-10-24 08:03:22.520781+00:00", "title": "Labor threatens to refer Angus Taylor to police over 'forged' document", "language": "en", "text": "Mr Taylor told Parliament his office had obtained the figures from a document downloaded on the council's website.\n\nBut the council conducted a metadata analysis that showed the electronic version of the annual report on the website had not been changed since it was published in November last year.\n\nMs Moore wrote to Mr Taylor on Wednesday asking him if she was being misled by the journalist or if he could verify the Telegraph's claims his office had provided them with a fake document.\n\n\"Providing false information to journalists and the public further erodes the community's confidence in elected representatives to lead and serve,\" Ms Moore's letter said.\n\nPressed by Labor about the issue in question time, Mr Taylor claimed it was a conspiracy theory.\n\n\"I reject the bizarre suggestions and assertions being pedalled by the opposition,\" Mr Taylor.\n\n\"They're all smear and no idea.\"\n\nBut Opposition climate change and energy spokesman Mark Butler said the document Mr Taylor's office supplied had different formatting, different spacing and a different font, as well as different numbers to what was in the council's annual report.\n\nAdvertisement\n\nMr Butler said creating a forged document intended to influence a publicly elected official like Ms Moore was punishable by up to 10 years in jail under NSW law.\n\nAlternatively, failing to report a forged document to police carries a maximum two year sentence.\n\nMr Butler said Mr Taylor should release metadata logs of the document his office supplied and if Prime Minister Scott Morrison did not refer the minister to NSW Police within the next 24 hours, Labor would.\n\nGreens MP Adam Bandt described it as Mr Taylor's Godwin Grech moment, referring to a former Treasury official who provided fake emails to the Coalition in 2009 for an attack on Labor.", "description": "The Energy Minister has denied any wrongdoing over claims his office provided a false document to a newspaper for an attack on Sydney Mayor Clover Moore.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.966%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_1528%2C$y_872/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/140a27b2b500fb7ad8ea0f3d5f40806f5c4f257a", "published_at": "2019-10-24"}