{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-forex-poll-sterling/sterling-to-rally-6-against-euro-if-brexit-deal-agreed-reuters-poll-idUKKCN1VP1KW", "downloaded_at": "2019-09-04 23:48:11.603031+00:00", "published_at": "2019-09-04", "title": "Sterling to rally 6% against euro if Brexit deal agreed - Reuters poll", "language": "en", "text": "LONDON (Reuters) - Sterling will rally around 6% against the euro if Britain leaves the European Union with a deal, an outcome looking somewhat more likely after British lawmakers seized control of parliament to try and block a no-deal Brexit, a Reuters poll found.\n\nFILE PHOTO: Pound Sterling notes and change are seen inside a cash resgister in a coffee shop in Manchester, Britain, September 21, 2018. REUTERS/Phil Noble\n\nThe pound GBP= slumped to a three-year low on Tuesday after Prime Minister Boris Johnson's implicit threat to lawmakers to support him on Brexit or face an election sent investors rushing to dump British assets.\n\nBut while the currency rallied on Wednesday following Johnson’s defeat late on Tuesday, it is likely to face more big swings as the battle over Brexit rages on.\n\nOver three years since Britons voted to leave the EU, there is still no clarity over how the two sides will part ways - or if they even will. However, Reuters polls of economists since the June 2016 referendum have repeatedly said a free trade deal will be the most likely eventual outcome.\n\nAccording to a median forecast in an extra question in the poll of 66 foreign exchange strategists, taken before Tuesday’s vote, the pound would strengthen against the euro in the month afterward if Britain leaves with a deal.\n\nOn Wednesday, one euro EURGBP was worth about 90.4 pence but would only get you between 85 to 88 pence if a deal is reached, according to the poll.\n\n“GBP should rebound after October 31, assuming that either a no-deal Brexit is somehow averted, or it is ‘managed’ successfully enough via a stopgap, stand-still trading arrangement with the EU that minimises economic dislocation,” said Everett Brown at IDEAglobal.\n\nJohnson has repeatedly said Britain will leave the EU on Oct. 31 and he will not seek an extension as his predecessor did earlier this year.\n\nIf the more than four-decade long marriage ends without agreement, the euro will strengthen and likely reach parity with sterling, the poll projected. The median forecast range was 95-100p.\n\nThe two currencies have never reached parity since the euro was introduced at the start of 1999. But 13 of 24 strategists in the extra question said it would reach - or even pass that level - with the most pessimistic prediction at 110p.\n\nForecasts in the wider poll said sterling would trade against the U.S. currency at $1.21 in a month, $1.25 in six months and $1.30 in a year, weaker than forecasts given last month. The pound was trading around $1.216 on Wednesday.\n\nAgainst the euro the one-, six- and 12-month forecasts were 92.0p, 90.0p and 88.5p respectively.", "description": "Sterling will rally around 6% against the euro if Britain leaves the European Union with a deal, an outcome looking somewhat more likely after British lawmakers seized control of parliament to try and block a no-deal Brexit, a Reuters poll found.", "authors": ["Jonathan Cable", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190904&t=2&i=1426145600&w=1200&r=LYNXNPEF8312H"}