{"pub": "yahoo", "url": "https://news.yahoo.com/im-meryl-streep-generals-former-025906003.html", "downloaded_at": "2019-10-18 05:02:09.348993+00:00", "title": "'I'm the Meryl Streep of generals': Former Defense Secretary Jim Mattis had an epic response to Trump calling him 'overrated'", "language": "en", "text": "FILE - In this Oct. 23, 2018 file photo, Defense Secretary Jim Mattis speaks beside President Donald Trump, during a briefing with senior military leaders in the Cabinet Room at the White House in Washington. Mattis warns bitter political divisions have pushed American society to the\n\nAssociated Press\n\n\n\n\n\nFormer Defense Secretary Jim Mattis is OK with President Donald Trump calling him the \"world's most overrated general\" because the president also called Meryl Streep \"one of the most over-rated actresses in Hollywood.\"\n\n\"I guess I'm the Meryl Streep of generals,\" Mattis said during his speech at the 74th annual Al Smith dinner — known for its comedic roast tradition — on Thursday.\n\nOn a more serious note, Mattis said that he doesn't like to dip into partisan matters, but he warned that we live in deeply divided times, invoking President Abraham Lincoln's Lyceum speech (which was made before he was president).\n\nHe also addressed US soldiers who fought with the Kurdish-majority Syrian Democratic Forces, who were allies against the Islamic State in the region.\n\nVisit Business Insider's hope page for more stories.\n\nFormer Defense Secretary Jim Mattis is OK with President Donald Trump calling him the \"world's most overrated general\" because the president also called Meryl Streep \"one of the most over-rated actresses in Hollywood.\"\n\n\"I guess I'm the Meryl Streep of generals,\" Mattis said during his speech at the 74th annual Al Smith dinner — known for its comedic roast tradition — on Thursday.\n\n\"And you have to admit, between me and Meryl, at least we've had some victories,\" he added.\n\nThe president attacked Streep after the award-winning actress criticized Trump in a speech she delivered at the Golden Globes in 2017. She condemned Trump mocking a disabled reporter, saying, \"When the powerful use their position to bully others, we all lose.\"\n\nTweet Embed:\n\n//twitter.com/mims/statuses/1185003190690955265?ref_src=twsrc%5Etfw\n\n\"I'm not just an overrated general. I'm the most overrated general,\" Mattis says. \"I'm honored to be considered that by Donald Trump because he also called Meryl Streep an overrated actress. So I guess I'm the Meryl Streep of generals, and frankly that sounds pretty good to me.\" pic.twitter.com/Hzpe5lUeje\n\nRead more: Trump reportedly called Jim Mattis the 'world's most overrated general' in a chaotic meeting on Syria\n\nMattis, a retired four-star Marine Corps general, resigned his post as secretary of defense in December after Trump first expressed the possibility of pulling US troops in Syria. In his resignation letter, he said the president was entitled to \"a Secretary of Defense whose views are better aligned with yours.\"\n\nIn a contentious meeting between Trump and congressional lawmakers on Wednesday (where both Trump and House Speaker Nancy Pelosi said the other was having a \"meltdown\"), Senate Minority Leader Chuck Schumer of New York, invoked comments Mattis made about the withdrawal from Syria in a recent interview, The Washington Post reported.\n\nTrump responded by calling the retired four-star Marine Corps general \"world's most overrated general,\" who wasn't \"tough enough.\"\n\nMattis' response included biting jokes: \"I earned my spurs on the battlefield ... Donald Trump earned his spurs from the doctor,\" he said referring to Trump's medical deferment during the Vietnam war for alleged bone spurs in his heels.\n\nOn a more serious note, Mattis said that he doesn't like to dip into partisan matters, but he warned that we live in deeply divided times, invoking President Abraham Lincoln's Lyceum speech (which was made before he was president).\n\n\"Lincoln went on, it was not the foreign aggressor we must fear; it was corrosion from within. The rot, the viciousness, the lassitude, the ignorance,\" Mattis paraphrased from the speech. \"Anarchy is one potential consequence of all this. Another is the rise of an ambitious leader unfettered by conscience or precedent or decency who would make themselves supreme.\n\n\"'If destruction be our lot,' Lincoln warned, 'We must, ourselves, be its author and finisher,'\" Mattis quoted from the speech.\n\nHe also addressed US soldiers who fought with the Kurdish-majority Syrian Democratic Forces, who were allies against the Islamic State in the region.\n\n\"We owe a debt to all who have fought for liberty including those who tonight serve in the far corners of our planet,\" Mattis said. \"Among them, the American men and women supporting our Kurdish allies.\"\n\nThe Syrian Kurds, who Turkey says are linked to the Turkey-based Kurdistan Workers' Party (PKK) (a group designated as a terrorist organization), are now facing an attack from Turkey in northeastern Syria. Northeastern Syria had been a Kurdish-controlled area of civil war-torn Syria, where detained Islamic State fighters were being held, backed with US special forces, who have since pulled out of the region at Trump's orders.\n\nWith the US decision to pull roughly 1,000 troops from Syria, Turkey launched a military operation.\n\nWatch the speech here:\n\nTweet Embed:\n\n//twitter.com/mims/statuses/1185043378628648962?ref_src=twsrc%5Etfw\n\nA somber former military official deciding to finally break his silence and express his concerns about a President by cracking jokes is quite bizarre. pic.twitter.com/IXKBrtsbvz\n\nNOW WATCH: We went inside Border Patrol boot camp and found the Academy isn't training agents for the job the White House is asking them to do", "description": "\"And you have to admit, between me and Meryl, at least we've had some victories,\" he added at the Al Smith dinner.", "authors": ["Lauren Frias"], "top_image": "https://s.yimg.com/uu/api/res/1.2/rDz5YwuF9_BwGM983lH1kw--~B/aD0xODU1O3c9MjQ3MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/business_insider_articles_888/5046678f5f9a9072f0bd10d71d1cd882", "published_at": "2019-10-18"}