{"pub": "fox", "url": "https://foxbusiness.com/money/generic-drug-companies-face-new-legal-battle-over-collusion-allegations", "downloaded_at": "2019-10-19 11:11:54.109909+00:00", "title": "Generic drug companies face new legal battle over collusion allegations", "language": "en", "text": "Generic drug companies in the U.S. could face an uphill — and costly — legal battle after a new lawsuit filed last week resurfaced collusion allegations.\n\nContinue Reading Below\n\nOn Friday, a subsidiary of UnitedHealth, the nation’s largest health insurer, filed a lawsuit against Teva, Mylan and more than a dozen other generic-drugmakers, accusing them of conspiring in one of the most “egregious and damaging price-fixing conspiracies in the history of the United States” in order to keep costs high and eliminate competition.\n\n“Rather than compete on price to gain market share, defendants systematically communicated with one another directly to suppress competition and maintain anti-competitively high prices,” the 417-page complaint said.\n\nFor instance, UnitedHealth accused Teva of colluding with its competitors on at least 86 different drugs over a 19-month period ending in 2015. By doing so, the Israeli-based drugmaker caused the cost of some of the drugs to increase by more than 1,000 percent, the complaint alleges. Generic drugmakers have denied wrongdoing, arguing the price hikes were the result of a number of different factors, including industry consolidation and FDA-mandated plant closures.\n\nIf the courts side with United, the generic drug companies named in the complaint could be forced to pay a significant figure in damages. The complaint said UnitedHealth is entitled to “treble damages” for all alleged overcharges.\n\nThe complaint is not the first time that generic drug companies drew scrutiny for allegedly inflating prices.\n\nIn May, a coalition of attorneys general from 43 U.S. states and Puerto Rico filed a lawsuit against Teva, accusing it of orchestrating a scheme with 19 other drug companies to inflate drug prices and stifle competition for generic drugs. The lawsuit also named 15 pharma executives as defendants who it said carried out the schemes on a day-to-day basis.\n\nCongress has sought to lower the cost of generic drugs, with House Speaker Nancy Pelosi pushing a bill that would allow Medicare to negotiate lower prices on as many as 250 of the most expensive drugs each year, including insulin. Any pharmaceutical company that refused to negotiate could face a steep penalty, starting at 65 percent of the gross sales of the drug in question.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE", "description": "United accused Teva of colluding with its competitors on at least 86 different drugs.", "authors": ["Megan Henney"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/02/0/0/Pharmacy-FBN.jpg?ve=1&tl=1", "published_at": "2019-10-18"}