{"pub": "townhall", "title": "Ketogenic diet: Benefits and Costs. Is it for you?", "url": "https://townhall.com/health/energy/2018/07/10/ketogenic-diet-benefits-costs-n11806", "language": "en", "published_at": "2018-07-10", "downloaded_at": "2019-09-02 07:11:54.882451+00:00", "text": "For a diet that's been around for 80-some years, it's amazing how much controversy surrounds the ketogenic diet (keto). You'd think everyone would be on the same page by now. But no, keto has avid supporters and avid critics. At the end of the day, that's healthy. The more people scrambling for the truth, the sooner the disagreement ends. Is keto right for you ... or not?\n\nWhat is a ketogenic diet?\n\nStandard American Diet Ketogenic Diet 50 percent carbs 5 percent carbs 15 percent protein 20 percent protein 35 percent fat 75 percent fat\n\nWhy keto works\n\nWhen your body uses ketones directly as its source of energy, you lose weight more readily because your body taps into your own fat stores for energy instead of the sugar you eat.\n\nbecause your body taps into your own fat stores for energy instead of the sugar you eat. Without surges of glucose, your body has improved energy levels because you can use your own body fat for energy—no sugar crashes or food comas. It takes only around half an hour for carbs to process into sugar—whereas protein is converted first into amino acids, and then, if not needed for muscle maintenance, glucose.\n\nbecause you can use your own body fat for energy—no sugar crashes or food comas. It takes only around half an hour for carbs to process into sugar—whereas protein is converted first into amino acids, and then, if not needed for muscle maintenance, glucose. Increased mental focus: Because fat is a more consistent source of energy than glucose, and is preferred by the brain, you don’t have ups and downs in mental energy and focus.\n\nBecause fat is a more consistent source of energy than glucose, and is preferred by the brain, you don’t have ups and downs in mental energy and focus. Longevity and disease prevention: Ketosis has been shown to decrease inflammation, the source of nearly every kind of disease, and has been shown to reduce Alzheimer’s risk, and to benefit cancer patients and diabetics.\n\nKetosis has been shown to decrease inflammation, the source of nearly every kind of disease, and has been shown to reduce Alzheimer’s risk, and to benefit cancer patients and diabetics. Increased physical performance: Ketosis uses oxygen more efficiently and avoids physical crashes of low blood sugar.\n\nKetosis uses oxygen more efficiently and avoids physical crashes of low blood sugar. Reduced risk of heart disease, as natural fats and protein, instead of carbs, become the body's front line energy sources.\n\nThe ketogenic diet drastically lowers daily carb intake and replaces it with healthy fats. The standard keto dietary nutrient ratio is 75 percent fat, 20 percent protein, and 5 percent carbs. This is very different from the standard American diet Wait, 75 percent fat? Won't we all end up massively overweight? And only 5 percent carbs? Won't we all run out of energy and doze away our days? The short answer is, no. It's the carb cutting that's largely responsible for keto success. When carbs are so dramatically limited, your body goes into a metabolic state called ketosis. Sounds ominous, but it's perfectly natural. Let's unpack that.The body's primary fuel source is glucose, that is, sugar. When carbs are broken down, that's what's left in our systems. That's generally OK—but there's a point where it's too much. By eliminating most carbs from the diet, the keto diet brings sugar levels, and their dangerous spikes in blood sugar and insulin levels, way down. And what do our bodies do when starved of sugar? They burn the next most available fuel: the body's store of fat. And when the fat is depleted, our bodies are kept fueled up by compounds called ketones. Here's where we find ketones doing their healthy work:\n\nStarting up\n\nPerhaps the most dramatic of all the keto diet's healing properties is in preventing and even reducing certain cancers.It's different for everyone, of course. But many people starting off on the keto adventure have some less than pleasant moments. That should be no surprise.Let's not mince words—getting on the keto diet means getting off of a wickedly addictive substance called sugar. As with any addiction, the process can be challenging. Some people experience symptoms similar to a light flu. This is known as keto-flu. That means feeling tired, having dizzy spells, running a low fever, and having difficulty concentrating. You may crave sugar, feel slightly nauseous, have trouble sleeping, and become cranky or irritable. In most cases, this adjustment period only lasts about a week—but it's worth going through, not least because those withdrawal symptoms serve to underscore what a truly nasty habit sugar is. It makes you sick when you're on it, and makes it hard to get rid of.As your sugar-hungry cells look for other sources of fuel, it's not just stored fat that it turns to. Muscle mass is another source, so some people may lose muscle. This is usually an effect of inadequate protein consumption, and can be fixed by ensuring adequate protein intake.It's rare, but some people find themselves developing a rash around the belly. This is called Prurigo Pigmentosa. It's not uncomfortable, and will go away if you up your carb intake temporarily. Of course you want to ensure that\n\nFat's chance to shine\n\nWhat's not on the keto menu?\n\nWheat\n\nWhite Flour\n\nQuinoa\n\nRye\n\nCouscous\n\nMost flours\n\nRice\n\nWheat Flour\n\nOats\n\nBarley\n\nCornmeal\n\nCorn\n\nRice Flour\n\nMillet\n\nBran\n\nBuckwheat\n\ncarb intake comes from eating “clean” carbs, like sweet potatoes or fruits . Basically, it's all about letting the body find its own new balance in its new nutritional environment.Though fat has come out from under its misguided reputation as the ultimate health threat, the keto diet's emphasis on plenty of fat still comes as a surprise to many people. A diet built on 75 percent fat—more than double the typical diet of 35 percent—seems counterintuitive. But now we know there's fat, and then there's fat. The keto diet's recommended fats are the kind called medium-chain triglycerides (MCTs). That's the fat found in coconut oil, avocados, butter, olive oil, lard, ghee, and essential fatty acids like omega-3. They earn keto's center stage because the body easily absorbs them, and sends them straight to the liver, where they're put to work right away to help deliver energy anywhere it's needed.There's a lot that's to be avoided on a keto diet. Here's a partial list of carb-heavy grain no-nos:\n\nGarlic Butter Brazilian Steak\n\nLow-Carb Salisbury Steak with Mushroom Gravy\n\nZucchini “Pasta” with Chicken and Pistachios\n\nCreamy Tuscan Garlic Chicken\n\n15-Minute Garlic Shrimp Zoodles\n\nBlackened Salmon with Avocado Salsa\n\nAsparagus, Lemon and Ricotta Stuffed Salmon Rolls\n\nCashew Chicken\n\nPre-keto factors\n\nThe ultimate fix—or fad?\n\nGot your appetite whetted? Wait till you see the desserts. Hint: Cinnamon Bun Fat Bomb Bars.Before diving into a keto diet, you should get a good blood-screening test. This gives you and your doctor a chance to see what your levels of various nutrients and non-nutrients tell us—benchmarks you can refer back to in future screenings to see what's changed, or not. A standard hemoglobin A1C test is always a good place to start. It gives you a great long-term perspective on your body’s relationship with sugar…and how well it’s processing it. This also lets your doctor modify your keto diet. There can be, for example, a vegetarian version that replaces animal-derived fats with purely plant-based fats. For people in very good health, there's what's known as a \"keto quickstart\" diet, which reduces your time spent at the outset while your body adjusts to the keto regimen.As I mentioned at the top, not everyone is on board the keto train. Critics contend the keto diet works only in the short term, and then only because much of the early weight loss is just the body shedding water, according to Lisa Cimperman, a clinical dietitian at Case Medical Center in Cleveland, and a spokesperson for the Academy of Nutrition and Dietetics. Cimperman says “Once your body enters ketosis, you also begin to lose muscle, become extremely fatigued, and eventually enter starvation mode. Then it actually becomes even harder to lose weight,” Another expert warns “Keto diets should only be used under clinical supervision and only for brief periods.” She allows that “They have worked successfully on some cancer patients in conjunction with chemotherapy to shrink tumors and to reduce seizures among people suffering from epilepsy.” But her bottom line is that a keto diet should only be considered in extreme cases. When widespread in the general population, she says, “It can do more harm than good. It can damage the heart, which is also a muscle,” and therefore exposed to the muscle mass loss mentioned. People with type 2 diabetes can benefit from weight loss and a reduced-carb diet because it will improve insulin sensitivity, Cimperman explained. \"But there are many other ways to do it besides a fad diet that won’t keep weight off long-term,” she said. Ouch. A Harvard Health article argues that the diet is so restrictive that many people just can't stick with it for long. That's why there are so few long-term studies—not enough people last long enough to be considered \"long-term.\" Others argue that the keto diet is dangerously deficient in fresh fruits and vegetables— a necessary rebalancer to counter the heavy load of fats and protein. To keto or not to keto is a matter that can be decided only in consultation with your doctor. If you have specific goals that you think keto can help you achieve, bring it up with your medical team at your next appointment. Take good care.\n\nReferences", "description": "For a diet that's been around for 80-some years, it's .09/02/2019 3:11:53AM EST.", "authors": ["Beth Baumann"], "top_image": "https://media.townhall.com/_townhall/resources/images/thog.png"}