{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/08/democrats-keeping-key-impeachment-witness-transcripts-secret", "downloaded_at": "2019-10-08 11:40:00.817255+00:00", "title": "Democrats Keeping Key Impeachment Witness Transcripts Secret", "language": "en", "text": "House Democrats are trying to impeach U.S. President Donald Trump based on information they are so far keeping secret from the public.\n\nThe Democrat-led House Committees on Oversight and Reform, Intelligence, and Foreign Affairs pursuing the impeachment inquiry are refusing to release the full transcripts of the testimony provided by the first two witnesses.\n\nLast week, former U.S. special envoy to Ukraine Kurt Volker and Intelligence Community (IC) Inspector General (IG) Michael Atkinson provided their testimony behind closed doors.\n\nTo the dismay of Republicans, witnesses expected to come to Capitol Hill this week are expected to follow suit.\n\nReps. Eliot Engel (D-NY), Adam Schiff (D-CA), and Elijah Cummings have chosen to release bits and pieces of the evidence gathered so far that favors their impeachment effort.\n\nEngel, Schiff, and Cummings are the committee chairmen leading the impeachment investigation.\n\nOn Monday, Breitbart News reached out to the House panels for comment on when, if ever, they plan to release the full transcripts, but they refused to answer.\n\nIrked by the Democrats’ refusal to release the full transcripts, Republican lawmakers who witnessed the testimony first hand and pundits have called for the information to be made public.\n\nVia Twitter, Rep. Lee Zeldin (R-NY) on Saturday urged Democrats to release Volker’s testimony — which lasted more than eight hours — “so all can read it.”\n\n“He candidly [and] professionally obliterated the bogus charge” by Democrats that President Trump made a quid pro quo offer to his Ukrainian counterpart, Volodymyr Zelensky.\n\nHouse Dems should IMMEDIATELY release Amb Volker’s several hour long transcribed interview so ALL can read it. He candidly & professionally OBLITERATED the bogus charge POTUS made a quid pro quo offer to Zelensky connecting aid to Ukraine with an investigation into Bidens. https://t.co/8zFSIoRHjX — Lee Zeldin (@RepLeeZeldin) October 6, 2019\n\nIt's been 24 hrs & the Volker transcript still hasn't been released by House Dems. No good reason why this hasn't been done yet. Anything to keep the Schiff quid pro quo fairy tale alive one more night. These tactics are unfair to the American public & dividing our great country. pic.twitter.com/xNTfJeEBUc — Lee Zeldin (@RepLeeZeldin) October 5, 2019\n\nAn intelligence community “whistleblower” claimed Trump pushed Zelensky to investigate Joe Biden and his son, Hunter, in exchange for foreign aid during a July 25 call.\n\nThe allegation triggered the impeachment inquiry.\n\nOn Friday, Zeldin stressed on Twitter, “Volker was very clear yesterday in his testimony that it is untrue Trump demanded a quid pro quo of Zelensky that U.S. aid was contingent upon an investigation by Ukraine into the Bidens.”\n\nOn Sunday, Zeldin noted:\n\nIt’s been[three] days [and Rep Schiff] still hasn’t released the transcript of Amb Volker’s interview, instead just cherry-picking some texts. I don’t have to ask why, [because] I was there [with] both of them [Thursday]. Schiff’s not releasing it [because] it obliterates his fairy tale quid pro charge.\n\nIt's been 3 days & @RepAdamSchiff still hasn't released the transcript of Amb Volker's interview, instead just cherry picking some texts. I don't have to ask why, bc I was there w both of them Thurs. Schiff's not releasing it bc it obliterates his fairy tale quid pro charge. — Lee Zeldin (@RepLeeZeldin) October 6, 2019\n\nOn Monday, Zeldin blasted the media’s lack of interest in the full transcript of the impeachment inquiry’s first witness, choosing instead to rely on the Democrats for details.\n\nHe wrote on Twitter:\n\nFascinating that much of the media has had zero interest in reporting on what was actually said by [Amb.] Volker last Thursday in response to several hours of questioning by [Democrats] & GOP. It’s like they don’t want to hear any truths that don’t support Schiff’s quid pro quo fairy tale.\n\nFascinating that much of the media has had zero interest in reporting on what was actually said by Amb Volker last Thursday in response to several hours of questioning by Dems & GOP. It’s like they don’t want to hear ANY truths that don’t support Schiff’s quid pro quo fairy tale. https://t.co/u3G4Kumpmm — Lee Zeldin (@RepLeeZeldin) October 7, 2019\n\nLast week, the chairmen cherry-picked and mischaracterized a series of texts provided by Volker during his testimony Thursday to fuel their impeachment agenda.\n\nIn his prepared remarks, Volker stressed that the texts proved the Trump administration did not pressure Ukraine to investigate Biden and his son.\n\nNevertheless, the Democrats claimed the texts proved the opposite, and the media reported their allegation as a “smoking gun.”\n\nBased on the Democrats’ claim, Volker provided self-incriminating evidence to House lawmakers.\n\nA text from Gordon Sondland, the U.S. ambassador to the European Union, explicitly said there was “no quid pro quo of any kind” between Trump and Zelensky.\n\nRep. Jim Jordan (R-OH), the founding member of the House Freedom Caucus, also called on the Democrats to release the full transcript of Volker’s testimony.\n\nJordan wrote on Twitter Sunday, Volker was “very clear: no quid pro quo of any kind.The American people should see all of Amb. Volker’s testimony. Will [Rep. Schiff] let them?”\n\nAmbassador Volker was very clear: Burisma had a history of corruption and was inextricably linked to the Ukrainian government. He was also very clear: no quid pro quo of any kind. The American people should see all of Amb. Volker's testimony. Will @RepAdamSchiff let them? pic.twitter.com/XBn8u5sfYI — Rep. Jim Jordan (@Jim_Jordan) October 6, 2019\n\nHe added in a different tweet, “The media is giving legitimate corruption concerns a total pass, misconstruing the facts, and helping further [Rep. Schiff’s] impeachment agenda.”\n\nIt is absolutely appropriate for the President to call for rooting out corruption in any country with whom we do business. The media is giving legitimate corruption concerns a total pass, misconstruing the facts, and helping further @RepAdamSchiff’s impeachment agenda. https://t.co/PmEuXcYiT2 — Rep. Jim Jordan (@Jim_Jordan) October 6, 2019\n\nEchoing his colleagues, Rep. Mark Meadows (R-NC), wrote on Twitter Friday:\n\nAmbassador Volker’s full interview yesterday directly undermined the salacious impeachment narrative Democrats are trying to sell you. They don’t want you to see that. It’s why they’re leaking supplemental documents and text messages out of context.\n\nLike Jordan and Zeldin, Meadows also witnessed Volker’s testimony first hand.\n\nDemocrats chose to remain mum after sitting through hours of testimony by Volker.\n\nMeanwhile, their Republicans colleagues — Meadows, Jordan, and Zeldin — told reporters the interview failed to produce the fireworks expected by their rivals.\n\nLast week, Fox News revealed that IG Atkinson testified Friday that he had “no knowledge” of the “whistleblower’s” contacts with the House intelligence panel aide.\n\nThe New York Times reported last Wednesday that the CIA officer who blew the whistle alleging a quid pro quo discussed the accusations against Trump with the House panel before the inspector general received the complaint.\n\nAccording to the law governing whistleblowers in the intelligence community, an official concerned about wrongdoing within the government must go to the IC inspector general before the congressional panels.", "description": "House Democrats are trying to impeach U.S. President Donald Trump based on information they are so far keeping secret from the public.", "authors": ["Edwin Mora"], "top_image": "https://media.breitbart.com/media/2018/10/wi/ap/22/e13a52_trump-russia-probe-democrats-19769-adam-schiff-in-22-2018-file-photo-rep.jpg", "published_at": "2019-10-08"}