{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7575017/Nickel-recovers-heavy-selling-copper-doldrums.html", "downloaded_at": "2019-10-15 11:24:04.804833+00:00", "title": "Nickel recovers after heavy selling; copper in doldrums", "language": "en", "text": "By Eric Onstad\n\nLONDON, Oct 15 (Reuters) - Nickel prices rebounded on Tuesday after heavy losses a day earlier, while copper was weighed down by worries about weak economic growth.\n\nTraders said it was unclear who was behind the selling during final open outcry trading on Monday on the London Metal Exchange that fuelled a $825 tumble of nickel in less than five minutes.\n\nBroker Marex Spectron said in a note that over 1,000 lots were sold in the closing ring, which resulted in LME benchmark nickel ending with losses of more than 5% on Monday.\n\nIt pared some of those losses on Tuesday, rising 1.9% to $16,910 a tonne by 1050 GMT.\n\n\"I think it was as much a technical reaction as anything and it happened at a time of day when liquidity was probably at its worst before Asia comes back in,\" said Ole Hansen, head of commodity strategy at Saxo Bank in Copenhagen.\n\nThe breach of support at $17,000 also sparked further selling, he added.\n\n\"Something does not seem quite right and you would hope the LME is taking a close look at what is going on in the nickel market as it is certainly not reflecting what is happening in the physical market,\" Malcolm Freeman of Kingdom Futures said in a note.\n\nFUNDAMENTALS\n\n* SPREAD: LME cash nickel's premium over the three-month contract <MNI0-3> dipped slightly on Monday to close at $135 a tonne, having hit a peak of $214 two weeks ago, indicating tightness in prompt supplies was easing somewhat.\n\n* STOCKS: Nickel stocks in LME-approved warehouses <MNISTX-TOTAL> rose for the first time in over two weeks after falling to the lowest for more than seven years, daily LME data showed on Tuesday.\n\n* CHINA DATA: China's factory gate prices declined at their fastest pace in more than three years in September, data showed.\n\n* COPPER: LME three-month copper shed 0.7% to $5,780 a tonne on concerns about economic growth following the weak Chinese data.\n\n\"Even if we do get a (U.S.-Chinese trade) deal, the macro economic outlook is not going to shift much and that outlook still looks as if the low point is in front of us. For now, the upside seems to be limited,\" Hansen said.\n\n* CODELCO: Chile's Codelco, the world's largest copper producer, said on Monday it was evaluating the closure of its Ventanas copper smelter in a polluted coastal region.\n\n* PRICES: LME aluminium dipped 0.3% to $1,714.50 a tonne, zinc gained 0.5% to $2,432, lead rose 0.9% to $2,150.50 while tin added 0.1% to $16,530.\n\n* For the top stories in metals and other news, click or (Additional reporting by Mai Nguyen in Singapore; Editing by Mark Potter)", "description": "By Eric OnstadLONDON, Oct 15 (Reuters) - Nickel prices rebounded on  Tuesday after heavy losses a day earlier, while copper was  weighed down by worries...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-15"}