{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/15/british-family-decries-treatment-by-us-after-borde", "downloaded_at": "2019-10-15 23:11:55.202304+00:00", "title": "British family decries treatment by US after border crossing", "language": "en", "text": "Seven members of an extended British family who made an unauthorized crossing into the United States from Canada are being held in federal custody at a Pennsylvania detention center nearly two weeks after their arrest, their lawyer said Tuesday, as U.S. border officials defended their handling of the case by disclosing that two of the adults had previously been denied entry to the country.\n\nThe family said they blundered into Washington state while trying to avoid an animal in the road on the Canadian side and have since been “treated like criminals” by their U.S. jailers, forced to bide their time in a series of cold and unsanitary immigration facilities as they await deportation to England. The detainees include an infant and 2-year-old twins.\n\nTheir attorney, Bridget Cambria, lodged a formal complaint over the family’s treatment with the U.S. Department of Homeland Security’s inspector general and civil rights office. She described the situation as a “very bizarre” case of federal overreach.\n\n“What is bothersome for me as an attorney, and I guarantee for them, was the lack of common sense at almost every stage of their apprehension and detention,” Cambria said.\n\nU.S. officials assert the family of Eileen and David Connors crossed the border on purpose, noting their vehicle was observed “slowly and deliberately” driving through a ditch to cross into U.S. territory in Blaine, Washington, on Oct. 2. Four adults and three children were inside.\n\n“During processing, record checks revealed two of the adults were previously denied travel authorization to come to the United States,” U.S. Customs and Border Protection said Tuesday in a statement to The Associated Press.\n\nOfficials did not say which adults had been denied entry into the U.S., or why.\n\nThe agency said that border agents tried returning the family to Canada, but Canada refused to have them back. After making two attempts to contact British consular officials, the border patrol said it turned the family over to U.S. immigration officials for removal proceedings.\n\nEileen Connors, 24, who is being held in Pennsylvania along with her husband David, their 3-month-old son, and other family members, said U.S. officials have mistreated them.\n\n“We will be traumatized for the rest of our lives by what the United States government has done to us,” she wrote in an affidavit released by immigrants’ rights groups in Pennsylvania.\n\nConnors’ family, a couple related to them, and their young children were driving along the U.S.-Canada border while vacationing in the Vancouver area when Eileen Connors said they detoured briefly onto an unmarked road to avoid an animal - and, in the process, unknowingly crossed into the United States.\n\nA U.S. Border Patrol agent quickly pulled them over, declared they had “crossed an international border” and took them into custody, Connors said. She said the family asked to turn around and go back, but the officer refused.\n\n“This is how the scariest experience of our entire lives started,” Connors wrote.\n\nSeparated from her husband, Connors described being forced to sleep with her infant on the “disgusting floor” of a cold cell the first night of her detention. From there, she was taken to a Red Roof Inn in Seattle, and eventually flown across the country to Pennsylvania.\n\nAt the Berks Family Residential Center - one of three family detention centers in the U.S. that hold children and parents who are seeking asylum or who entered the country illegally - Connors described a frigid facility whose staff claimed they couldn’t turn on the heat until the end of November.\n\nBathrooms are “dirty and broken,” she wrote, and a staff member shines a light in their room every 15 minutes throughout the night. She said her baby developed a swollen, teary eye and rough, blotchy skin in custody.\n\n“We have been treated unfairly from day one,” Connors wrote. “It is undoubtedly the worst experience we have ever lived through.”\n\nU.S. Immigrations and Custom Enforcement said the Berks center “has an outstanding track record” and “is regularly awarded exceptional ratings concerning the health, safety, and treatment of its residents.”\n\nCambria, the immigration lawyer, said the family should be on a plane to England within days.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Seven members of an extended British family who made an unauthorized crossing into the United States from Canada are being held in federal custody at a Pennsylvania detention center nearly two weeks after their arrest, their lawyer said Tuesday, as U.S. border officials defended their handling of the case by disclosing that two of the adults had previously been denied entry to the country.", "authors": ["The Washington Times Http", "Michael Rubinkam"], "top_image": "", "published_at": "2019-10-15"}