{"pub": "zdnet", "url": "https://www.zdnet.com/article/twitter-used-2fa-phone-numbers-for-ad-targeting", "downloaded_at": "2019-10-09 00:25:42.688210+00:00", "title": "Twitter used 2FA phone numbers for ad targeting", "language": "en", "text": "Social networking site Twitter disclosed today that it used phone numbers users provided for two-factor authentication (2FA), along with email addresses, to show targeted ads.\n\nTwitter now joins Facebook, which was caught doing the exact same thing last year by a group of academics from Northeastern University and Princeton University.\n\nWhat went wrong\n\nWhen users and companies promote sponsored tweets on Twitter, they can filter an ad's audience based on a series of criteria.\n\nThe problem, Twitter said, was that emails and phone numbers that users provided to be used specifically for security reasons where \"inadvertantly\" made available for \"Tailored Audiences\" and \"Partner Audiences,\" two of the company's internal advertising systems.\n\nTwitter said this was a bug, and not something it intended to do. The issue was fixed on September 17, and the company said that no user data was shared with external entities.\n\n\"We cannot say with certainty how many people were impacted by this, but in an effort to be transparent, we wanted to make everyone aware,\" the company said in a short statement posted on its website.\n\n\"This was an error and we apologize.\"\n\nA long list of Twitter platform \"issues\"\n\nUnfortunately, these kinds of statements and apologies are becoming the norm at Twitter. For the past year, the company has been disclosing similar blunders all over its platform.\n\nIn September 2018, Twitter said it disclosed details about an API bug that shared users' private DMs with the wrong app devs.\n\nIn January 2019, Twitter disclosed another bug that exposed private tweets for some Android users for almost five years. Those tweets, meant to stay private, were visible to everyone, and were even indexed by search engines.\n\nIn May 2019, Twitter disclosed details about a third bug on its platform that shared location data for some iOS users with \"a trusted partner.\"\n\nIn August 2019, Twitter said fixed a fourth issue on its advertising platform that resulted in the company sharing some user data with advertising partners without the users' express consent. Also, on the same day, Twitter disclosed a fifth issue, one during which its advertising platform made inferences about a user's devices to fine-tune ad delivery without the user's express approval.\n\nToday, we got the seventh such issue in the span of a year.", "description": "Twitter couldn't say how many users had been impacted by this latest bug.", "authors": ["Catalin Cimpanu"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2019/08/07/9ded39c4-7220-4370-9796-dc61f884447a/thumbnail/770x578/50bb5ebcb7b4749d9177d37088a5240e/twitter-phone.jpg", "published_at": "2019-10-08"}