{"pub": "fox", "url": "https://foxnews.com/science/black-holes-as-we-know-them-may-not-exist", "downloaded_at": "2019-10-04 12:35:57.315444+00:00", "title": "Black holes as we know them may not exist", "language": "en", "text": "If you were to dive into a black hole (something we would not recommend), you\"d likely find a singularity, or an infinitely small and dense point, at the center. Or that's what physicists have always thought.\n\nBut now a pair of scientists suggests that some black holes may not be black holes at all. Instead, they may be weird objects chock-full of dark energy — the mysterious force thought to be pushing at the bounds of the universe, causing it to expand at an ever-increasing rate.\n\nRelated: 9 Ideas About Black Holes that Will Blow Your Mind\n\n\"If what we thought were black holes are actually objects without singularities, then the accelerated expansion of our universe is a natural consequence of Einstein's theory of general relativity,\" said Kevin Croker, an astrophysicist at the University of Hawaii at Mānoa.\n\nCroker and a colleague describe this idea in a new study, published online Aug. 28 in the Astrophysical Journal. If they are right, and the singularity at the heart of a black hole could be replaced by a weird energy flinging everything apart, that may revolutionize the way we think about these dense objects.\n\nThe duo was not out to uncover what's inside a black hole. Croker and Joel Weiner, a professor emeritus in mathematics at the same university, were looking at Friedmann's equations, which are simplified from Einstein's theory of general relativity. (Relativity describes how mass and energy warp space-time.) Physicists use Friedmann's equations to describe the expansion of the universe, in part because the math is simpler than in Einstein's body of equations describing relativity. The team found that, in order to properly write down Friedmann's equations, ultradense and isolated regions of space, like neutron stars and black holes, had to be treated in the same mathematical way as all other areas. Previously, cosmologists believed it was reasonable to ignore the internal details of ultradense and isolated regions, such as the inside of a black hole.\n\n\"We showed there's only one way to [construct these equations] correctly,\" Croker told Live Science. \"And if you do it that one way, which is the correct way to do it, you find some interesting things.\"\n\nThe new results suggest that all the dark energy required for the accelerated expansion of the universe could be contained in these alternatives to black holes. The researchers discovered this in the math, after they had corrected the way to write out Friedmann's equations. And in a follow-up paper submitted to The Astrophysical Journal and posted Sept. 7 on the preprint journal arXiv, they showed that these alternatives to black holes, called Generic Objects of Dark Energy (GEODEs), could also help explain peculiarities in gravitational-wave observations from 2016.\n\nThe math from Friedmann's equations showed that over time, these ultradense objects gain weight simply due to the expansion of the universe, even when there is no nearby material for them to consume. Just as light traveling through expanding space loses energy — an effect known as redshift — matter also loses weight as space expands. The effect is usually so tiny it cannot be seen. But in ultradense material with very strong pressures inside, known as relativistic material, the effect becomes noticeable. Dark energy is very relativistic, and its pressure acts oppositely to normal matter and light — so objects made of it (like these hypothetical GEODEs) gain weight over time.\n\n\"Light is sort of a weird thing. It behaves counterintuitively, in many ways,\" Croker said. \"People didn't expect that this behavior could also be exhibited in other objects. But we showed, yes, you can see it in another object,\" namely inside GEODEs.\n\nGEODEs were first proposed as an idea in the 1960s, but the math supporting them was only worked out recently. But it turns out these weird objects could also provide a simple explanation for observed large black hole mergers. In 2016, members of the Laser Interferometer Gravitational-Wave Observatory (LIGO)-Virgo collaboration announced they had the first-ever observations of a black hole merger, but the calculated masses of the supposed black holes was unexpected — scientists expected the masses to be either much higher or lower.\n\nBut GEODEs, unlike traditional black holes, gain weight over time. If two GEODEs that had formed in the younger universe eventually collided, by the time they collided, they would have grown larger than typical black holes. By that point, the GEODEs' masses would match the masses seen in the collision observed by LIGO-Virgo. Instead of having to conceive of a highly specific situation that led to the merger, GEODEs could provide a simpler solution to explain the observations.\n\nNot all scientists are convinced, though. The new description of these objects is \"counterintuitive and hard to digest,\" Vitor Cardoso, professor of physics at Instituto Superior Técnico in Lisbon, Portugal, who was not involved with the study, told Live Science in an email. But, he added, \"I like the idea of finding alternatives to black holes — it forces us to strengthen the black-hole paradigm. Also, sometimes it's hard to find things if we don't look for them.\"\n\nOriginally published on Live Science.", "description": "If you were to dive into a black hole (something we would not recommend), you\"d likely find a singularity, or an infinitely small and dense point, at the center. Or that's what physicists have always thought.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/04/black-hole-m87.jpg", "published_at": "2019-10-03"}