{"pub": "fox", "url": "https://foxnews.com/politics/susan-rice-calls-trumps-troop-withdrawal-from-syria-bats-crazy", "downloaded_at": "2019-10-08 13:00:36.127247+00:00", "title": "Susan Rice slams Trump's troop withdrawal from Syria", "language": "en", "text": "Former Obama National Security Advisor Susan Rice sounded off on President Trump's decision to withdraw troops from Syria, calling the announcement \"bats--- crazy\" during her appearance on \"The Late Show.\"\n\n\"Stephen, I woke of this morning to hear that news and as I do- it seems like six days a week- I just put my head in my hands,\" Rice told \"Late Show\" host Stephen Colbert. \"This is bats--- crazy.\"\n\nRice explained that the Kurds in Syria are \"the people who for the last four years have been fighting on our behalf\" to defeat ISIS and that \"we basically said to them, 'see ya.'\" She also referred to Turkey as the \"hungry wolf who's trying to kill the lamb.\"\n\n\"It's just appalling because we promised them out partnership and we promised them that if they worked with us to defeat our common enemy... then we would stand with them,\" Rice continued. \"And Trump woke up on the wrong side of the bed, it appears, and decided 'Never mind.'\"\n\nCOLIN POWELL SAYS TRUMP'S FOREIGN POLICY 'IS IN SHAMBLES,' REPUBLICAN PARTY NEEDS TO 'GET A GRIP\n\nThe former Obama official credited Republican lawmakers since they have \"gotten a pulse today\" by largely condemning Trump's decision, insisting it \"must be really bad.\"\n\n\"Have you heard any rationale being given for it?\" Colbert asked. \"Because I don't quite understand how he's justifying this.\"\n\n\"Well, there's no justification that you or I would understand,\" Rice responded. \"He seems to be trying to couch this and 'we've been at war for too long,' you know, 'I'm sick and tired of all of this. Somebody else should take up the burden'...\n\n\"That's not a bad argument on a certain level,\" Colbert interjected, \"because America has been at war for a long time since 2001.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"But these are different wars to be precise,\" Rice pushed back. \"This is a war that we have been involved in very smartly through these partners. American service members are not in combat on the ground in Syria in any meaningful way. They have been advising and supporting these very brave Kurdish allies who have taken the fight effectively to ISIS on our behalf. That's a smart way to fight terrorism. And that's what we started and that's what we pursued during the Obama administration. Trump continued it and at some point, I guess he decided that he had enough.\"\n\nRice went on to warn that the ISIS prisoners that are currently in Kurdish custody could \"harm\" Americans and European allies if Turkey intervenes.", "description": "Former Obama National Security Advisor Susan Rice sounded off on President Trump's decision to withdraw troops from Syria, calling the announcement \"bats--- crazy\" during her appearance on \"The Late Show.\"", "authors": ["Joseph Wulfsohn", "Joseph A. Wulfsohn Is A Media Reporter For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/Susan20Rice.jpg", "published_at": "2019-10-08"}