{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/fat-can-build-up-in-the-lungs-study-finds-which-may-explain-obesity-asthma-link", "downloaded_at": "2019-10-18 08:52:35.373855+00:00", "title": "Fat Can Build Up In The Lungs, Study Finds, Which May Explain Obesity-Asthma Link", "language": "en", "text": "On the left, a model demonstrating the inflamed airway of someone with asthma. A model of a healthy airway is shown at right. (Image: Getty Images)\n\nFor people living with obesity and excess weight, fat around the belly may not be the only thing to worry about. A new study out Friday seems to show that fat can build up in a person’s lung airways, too. The discovery may help explain why some health problems like asthma are more common or worse in obese and overweight people.\n\nResearchers from Australia, New Zealand and Canada teamed up for the study. They looked at data from an earlier project that collected lung tissue samples from people in Alberta, Canada who had been diagnosed with asthma and had died recently. This set included people who died because of their asthma as well as those who died of unrelated causes. Then they compared these samples to a control group taken from people without asthma who had died of other causes.\n\nAll told, more than 1,300 samples of the lung’s airway walls were looked at under a microscope, taken from 52 people. The authors found fat tissue in the lungs of all three groups, but those who were overweight and obese had, on average, greater levels of lung fat than everyone else. As BMI increased, the chances of more fat in the lung also increased, and both greater BMI and lung fat was linked to greater thickness and inflammation of the lung airways.\n\nThere have been various theories to explain why people who are overweight or obese are more likely to have asthma, or to have worse asthma symptoms. Some have argued that excess fat can physically constrict the lungs, making it even harder for them to work when someone has an asthma attack. Others have theorised that the chronic inflammation linked to obesity can affect a person’s chances or severity of asthma, since it’s also often caused by inflammation.\n\nAccording to the authors, their findings don’t rule out those theories. But the study, published Thursday in the European Respiratory Journal, might add a new explanation to the list.\n\n“We’ve found that excess fat accumulates in the airway walls where it takes up space and seems to increase inflammation within the lungs,” co-author Peter Noble, an associate professor at the University of Western Australia in Perth, said in a statement released by the study’s publishers. “We think this is causing a thickening of the airways that limits the flow of air in and out of the lungs, and that could at least partly explain an increase in asthma symptoms.”\n\nThe authors say theirs is the first study to go looking for fat inside people’s lungs. But there are known conditions linked to obesity and a build-up of fat in other organs, such as non-alcoholic fatty liver disease.\n\nAt this point, however, there’s still a lot more research that has to be done to confirm this link. The authors say they’re already underway with a study looking for fatty tissue in the lungs of living people. Future research could also test whether weight loss can reduce people’s severity or risk of asthma.", "description": "For people living with obesity and excess weight, fat around the belly may not be the only thing to worry about. A new study out Friday seems to show that fat can build up in a person’s lung airways, too. The discovery may help explain why some health problems like asthma are more common or worse in obese and...", "authors": ["Aaron Gordon", "Tom Mckay"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/wi4zwyfudgmkayagilpg.jpg", "published_at": "2019-10-18"}