{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/5/strasburg-scherzer-pitch-nats-past-dodgers-to-even", "downloaded_at": "2019-10-05 12:28:20.294791+00:00", "title": "Strasburg, Scherzer pitch Nats past Dodgers to even NLDS", "language": "en", "text": "LOS ANGELES — Stephen Strasburg turned in another dominant October outing, Max Scherzer overpowered Los Angeles for an inning out of the bullpen and the Washington Nationals held off the Dodgers 4-2 Friday night to even their NL Division Series at a game apiece.\n\nScherzer struck out the side in the eighth, but Washington’s shaky bullpen still ran into trouble.\n\nDaniel Hudson labored through the ninth, loading the bases with two outs before striking out Corey Seager for the save.\n\nThe tense final inning also included a twisting, falling grab by third baseman Anthony Rendon on Cody Bellinger’s pop fly in shallow left field, as well as a gutsy intentional walk by manager Dave Martinez that brought the winning run to bat.\n\nPitching on the shortest rest of his career, Strasburg took a perfect game into the fifth inning while outdueling Clayton Kershaw.\n\nStrasburg pitched one-run ball for six innings and struck out 10, lowering his career postseason ERA to 0.64 — the best in playoff history for players with at least four starts.\n\nHe edged out Dodgers great Sandy Koufax (0.95 ERA), who watched from the front row.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Stephen Strasburg turned in another dominant October outing, Max Scherzer overpowered Los Angeles for an inning out of the bullpen and the Washington Nationals held off the Dodgers 4-2 Friday night to even their NL Division Series at a game apiece.", "authors": ["The Washington Times Http", "Beth Harris"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/05/nlds_nationals_dodgers_baseball_09899_c0-209-5004-3126_s1770x1032.jpg?1ca3c9b85b3e968a5dedcbee2b29cbb103929389", "published_at": "2019-10-05"}