{"pub": "cbs", "url": "https://cbsnews.com/news/trump-transcript-why-memo-of-president-donald-trump-ukraine-call-isnt-complete-transcript-2019-09-25", "downloaded_at": "2019-09-25 23:32:52.713785+00:00", "title": "Why the \"transcript\" of Trump's Ukraine call isn't a complete transcript", "language": "en", "text": "What's being called a transcript of the controversial phone call between President Trump and Ukrainian President Volodymyr Zelensky isn't really a full transcript. And it's not clear if a complete one even exists.\n\nThe White House acknowledged that the five-page \"unredacted\" memo released Wednesday is not a verbatim record of the conversation between the two leaders July 25, which has become central to the impeachment inquiry against Mr. Trump. Instead, it is based on notes and recollections from Situation Room officers and National Security Council staff, who are assigned to listen to and document presidential conversations.\n\nThere could be no actual recording of the full conversation between Mr. Trump and Zelensky, since presidents stopped taping their conversations decades ago. According to the University of Virginia's presidential recording program, Franklin Delano Roosevelt was the first president to start recording his calls, and it remained a common practice up through President Richard Nixon, who captured about 3,400 hours of discussion. But Nixon's tapes came back to bite him during the Watergate scandal — his refusal of a congressional subpoena for the tapes led to an article of impeachment — and he was the last president to make a habit of recording calls.\n\nThe declassified phone transcript summary, released by the White House, of a conversation between President Trump and Ukrainian President Volodymyr Zelensky from July 25, 2019, is seen in this photo illustration in Washington, D.C., on Wednesday, September 25, 2019. Getty\n\nToday, transcripts of presidential calls are based on notes, which can have varying levels of detail and accuracy. A note at the bottom of the Mr. Trump memo points out that \"a number of factors can affect the accuracy of the record,\" such as poor phone connections, accents and the use of interpreters.\n\nThe White House has not said if there is a longer transcript of the Ukraine call or a recording of it. Mr. Trump said in a press conference late Wednesday that he would release a record of a previous call he had with Zelensky.\n\nTrump reacts to release of Ukraine call memo\n\nMr. Trump has seemed to imply that he recorded some of his White House conversations, though this has never been proven. Days after Mr. Trump fired FBI Director James Comey in May 2017, he tweeted that Comey \"better hope that there are no 'tapes' of our conversations before he starts leaking to the press!\" But no Comey tapes ever emerged, and the existence of such tapes was never confirmed.\n\nThe Washington Post in 2017 published full, leaked transcripts of the president's calls to the leaders of Mexico and Australia. The New York Times reported that after those leaks, the White House put more restrictions on who gets to hear the president's phone calls and see the notes from them.", "description": "There could be no full transcript or recording of the controversial phone call between the two leaders July 25", "authors": ["Jason Silverstein"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/09/25/74950a6b-1d9e-4738-8f5c-b0aa7955dc59/thumbnail/1200x630/e983e631a7adcfb56298070d65543f92/gettyimages-1171027652.jpg", "published_at": "2019-09-25"}