{"pub": "indiatimes", "url": "https://timesofindia.indiatimes.com/blogs/science-nomad/dear-do-gooder-do-you-really-need-to-post-photos-of-the-poor-street-kids", "downloaded_at": "2019-10-28 09:49:48.754501+00:00", "title": "Dear do-gooder, do you really need to post photos of the poor street kids?", "language": "en", "text": "Cometh Diwali and the social media bots collecting information about human faces must be getting ecstatic because they would be experiencing a sudden increase in new faces popping up on social media platforms.\n\nThese new faces hitherto unseen on social media belong to the poor street kids of India, and they are there because thousands of do-gooder, many of them celebrities, are now out on the streets of India carrying boxes of sweets and looking, or rather hunting for the poor street kids to get a candid record of their, mostly one-night-stand with empathy.\n\nFor some inexplicable reason, most of these celebrity do-gooders are accompanied by candid photographers with such an amazing expertise that the images are captured exactly at the point when the box of sweet is exchanging hands, so social media platforms are flooded today with images straight out of the western movies about the poverty of the orient.\n\nWhile there is no denying that Diwali is a festival to spread joy, and there is no better way to do so than sharing what you have with those who have-not, Diwali in most large cities is now turning into a branding event for the real and the aspiring page-three members of each city and the fodder to their hunger for publicity is the poor kids who have no idea that their innocent faces will be used to enhance an already fake façade of social responsibility adorn by the rich.\n\nThough this could be looked at from the perspective of legal appropriateness of sharing images without consent, but as it is about the poor, and that too kids who are obviously not expected to be having any human rights, there is no real point discussing it on privacy violation grounds, so, instead, I want ask a very simple question to all the do-gooders overflowing with human kindness?\n\nIt is great that you have given sweets to these poor kids, and there is no harm if a photo or two are taken for the sake of capturing a moment of joy, but would you like to share it if it was your kids with alms thrust into their faces?\n\nWhat would be your feeling as a parent if your kids were the have-nots and someone came and gave them sweets and posted photos of them on a public platform the next day?\n\nAs today is the first day of a New Year and not a day for the themes that can make us wince, I would not drive the point of role-reversal too hard, but would like to make a small plea.\n\nHuman dignity is the greatest wealth every human has. Even the poorest of the poor on this planet deserve to have their dignity protected.\n\nJust because you wanted your act of empathy to be seen by the world for whatever the reason, it need not be done at the cost of someone’s dignity.\n\nSo, on the New Year Day, if nothing else, let us gift dignity to the poor of India with all the sweets and kindness that we should be gifting to them.\n\nWhile social media is covered with faces of street kids, let us, as a society, recognise the horror that India has 2.5 crore stray dogs and just as many street kids, and a lot of these kids are orphans with no real home but the street.\n\nThe real irony of our nation is that we have social media pages full of pleas to give a “poor darling puppy a home” almost every day and a lot of street dogs finding a home, out of the 2.5 crore orphan humans of India, less than 8000 find a home each year.\n\nAs a human society we have failed our street kids completely, so let us not make it worse by using their innocent faces to build a fake identity of us being a society that really cares.", "description": "Cometh Diwali and the social media bots collecting information about human faces must be getting ecstatic because they would be experiencing a sudden increase in new faces popping up on social media platforms. These new...", "authors": ["Samir Shukla"], "top_image": "https://timesofindia.indiatimes.com/blogs/wp-content/uploads/2018/02/11.jpg", "published_at": "2019-10-28"}