{"pub": "theverge", "url": "https://theverge.com/2018/5/16/17358034/google-pay-how-to-mobile-payments-android-iphone", "downloaded_at": "2019-10-05 15:05:44.338882+00:00", "title": "How to use Google Pay", "language": "en", "text": "Google Pay is a digital wallet and online payment system that’s developed by Google to make it easy for you to make purchases. It automatically syncs your saved credit cards wherever your Google account is logged in for quick payments, and it will import loyalty cards, tickets, and offers from your Gmail account. Google Pay is supported at most major markets, gas stations, and department stores.\n\nSetting up Google Pay is straightforward.\n\nWhat do I need to set up Google Pay?\n\nYou need a debit / credit card or PayPal account, a Google account, and a supported Google Pay device (a non-rooted Android phone using KitKat 4.4 and up, a Wear OS watch, or a desktop / laptop computer). You can even use it with an iOS device (although you can only use the account to pay online, not in a store).\n\nHow do I add payment accounts to Google Pay?\n\nIf you only plan to use Google Pay online to pay for, say, Google Play movies or apps, then you can set up your account from your Google Play app. Just tap on the menu icon (the three parallel lines) in the upper left corner, and select “Payment methods.” This is where you can add a PayPal account, a credit card, or debit account, which Google Pay will use whenever you buy something like an app directly through Google. You can add several accounts if you want.\n\nIf you want to change or remove a payment method — for example, a credit card that you’re no longer using — it’s not difficult. Just go to the same “Payment methods” page, and tap on “More payment settings” at the bottom of the page. You’ll see a list of your current payment methods, with buttons to “Remove” or “Edit” at the bottom of each.\n\nOn the other hand, if you plan to use Google Pay on your phone to make payments at a store, you’ll need to use the Google Pay app. (Chances are, it’s already on your phone.)\n\nDownload the Google Pay app from the Play Store. If you have more than one Google account, you’ll be asked which account you want to use with it.\n\nAgree to the Google Pay terms of service and the Google privacy policy. (You can click on the links to find out more.) Otherwise, click on “Get started.”\n\nAdd a payment method by tapping on “Set it up.” This will take you to the “Choose a card” screen; if you’ve already registered a card or PayPal account with Google (via the above method), it will be listed. Otherwise, you can add a payment method at this point.\n\nNote: You can’t add PayPal to your Google Pay account through the Google Pay app. However, you can add it via the web page or through your Google Play app. Once you do that, your PayPal account will appear as a method of payment in the Google Pay app itself.\n\nYou’re set. From the main screen, you can send money using Google Pay, watch a video about the security methods involved, and see your recent payment activity, among other things.\n\nIf you want, you can also manage your account on the web by going to the Google Pay account page.\n\nWhere can I use Google Pay?\n\nIn the real world, you can use Google Pay just about anywhere you see a credit card terminal with these above symbols. From there, all you need to do is move your phone or watch up to the terminal’s contact point, then wait for the blue checkmark to indicate that your Google Pay account info has been received.\n\nIf I can’t pay in store with an iPhone, what can I do with Google Pay?\n\nThere’s only one current workaround to use Google Pay with an iPhone, and it requires a paired and supported Wear OS watch with an NFC chip. Otherwise, you can only send and receive payments between Google Pay users.\n\nIs Google Pay secure?\n\nFor those of you worrying about merchants having your credit card number when you tap to pay, here’s how Google protects your info: a temporary, encrypted number is shared with merchants, never the actual number.\n\nIf you lose your phone, the Android Device Manager can be accessed from any computer with your Google account. From there, you can lock, locate, or remotely wipe your phone and all of its contents.\n\nUpdate August 29th, 2019, 5PM ET: This article was originally published on May 16th, 2018. Several of the entries have been updated, and additional info has been added.\n\nUpdate August 30th, 2019, 7:30AM ET: Information about how to add a PayPal account to Google Pay was added.", "description": "Google Pay is supported at most major markets, gas stations, and department stores. Google Pay is a digital wallet and online payment system that’s developed by Google for phones, watches, and desktops.", "authors": ["Stefan Etienne", "Barbara Krasnoff", "Aug"], "top_image": "https://cdn.vox-cdn.com/thumbor/sBsLS6rRlL--WlOc4rEzn3x8WgQ=/0x37:1013x567/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/10845487/Screen_Shot_2018_05_15_at_4.25.54_PM.png", "published_at": "2018-05-16"}