{"pub": "reuters", "url": "https://widerimage.reuters.com/story/built-by-my-family-americas-grand-buildings-built-by-slaves", "downloaded_at": "2019-09-04 04:16:54.080055+00:00", "published_at": "2019-09-04", "title": "'Built by my family': America's grand buildings built by slaves", "language": "en", "text": "Monticello, the expansive brick home of Thomas Jefferson, sits atop a hill overlooking farmland, trees and the University of Virginia, the institution founded by the third U.S. president.\n\nBuilt between 1769 and 1809, Monticello is also one of the most famous of the hundreds of landmark American buildings constructed by slaves.\n\nIts distinctive architecture - a columned portico, balconies ringing the upper floors, the famous dome - has landed the residence on the UNESCO World Heritage Site list and the back of the U.S. nickel.\n\nThroughout the United States, the physical legacy of slavery can still be seen in the U.S. Capitol, the White House, the residences of former presidents including George Washington's Mount Vernon and James Madison's Montpelier and universities built using the labor of slaves.\n\nFour hundred years ago this month, the boat carrying what is believed to have been the first 20 enslaved Africans arrived in the British colony of Virginia, an anniversary that has prompted a reckoning of race-based chattel slavery in the United States of America.\n\nThe U.S. Capitol, one of the most iconic symbols of American democracy, was built using enslaved labor, involved in all aspects of construction, including carpentry, masonry, plastering, glazing and painting.\n\nEnslaved people leveled the hill on which the house sits, dug clay for brick-making, quarried limestone for mortar and plaster, and chopped trees that became lumber for framing and woodwork.\n\nTours and exhibits at Monticello highlight the work performed by slaves in the construction of the building and on Jefferson's plantation.\n\nOther prominent landmarks built using the labor of slaves include South Carolina's Fort Sumter, the site in Charleston Harbor where the Civil War that brought the end of slavery erupted in 1861, and the Castillo de San Marcos masonry fort in St. Augustine, Florida.\n\nPlants grow on a wall of Castillo de San Marcos masonry fort. The construction of the masonry fort began in 1673. Among native Americans, former slaves who escaped from the British colonies also worked on the construction of the fort, according to some historians.\n\n\"And then there's people who need to plaster the interior walls as well and lay the floors - and slave craftsmen were involved with all of those steps,\" Hallock added.\n\n“You think of what it took to build Monticello – you need people who made bricks, people who laid the bricks, who chopped the wood, converted it into fine trim and woodwork and then installed it,\" said Gardiner Hallock, director of restorations and collections for the foundation that operates the estate.\n\nThey also assisted white craftsmen hired for the building's construction, with some becoming highly skilled workers in their own right - like John Hemmings, half-brother of Sally Hemings, a woman enslaved by Jefferson who had at least six children with him.\n\n\"All of the original built environment in New York basically was built with the labor of enslaved people,\" said Louise Mirrer, the head of the New York Historical Society.\n\nIn New York City, where as much as 20% of its population was once enslaved, the original street of Broadway, the wall that gave Wall Street its name, historic restaurant and bar Fraunces Tavern and Trinity Church were all built using slave labor.\n\nA man walks by Fraunces Tavern. Built by the De Lancey family in 1719 with the use of enslaved labor, the property has been a private residence, hotel, and one of the most important taverns of the Revolutionary War.\n\nOne prominent institution that has received attention for its role in slavery is Georgetown University in Washington.\n\nGrowing recognition of the role that slaves played in constructing the United States has helped fuel the topic of reparations for descendants of American slaves.\n\nA reflection of Trinity Church in the Financial District of Lower Manhattan. The church was built in 1696 with the use of enslaved people.\n\nStory\n\nIn 2016, Georgetown acknowledged that hundreds of people who were enslaved on Jesuit plantations were sold in 1838 to farms in Louisiana to pay off some of the university's debts.\n\nPeople involved in the GU272 Memory Project, a venture to find the descendants of those slaves, have said they have identified about 9,000 descendants, 4,000 of whom are living. In 2016, the university began offering preferential admission to descendants of slaves who had been owned by the Maryland Province of Jesuits.\n\nOne person who took the university up on its offer was 65-year-old Melisande Short-Colomb, who after a career as a chef decided to attend Georgetown University and complete an undergraduate degree in history and theater.\n\nNow, throughout the school year, she walks past buildings such as Isaac Hawkins Hall, a dormitory believed to have been built in part by slaves and which has since been renamed to honor those who were sold to plantation owners in Louisiana.\n\n\"It's beautiful,\" Short-Colomb said about buildings like Isaac Hawkins Hall on the Georgetown campus, \"and I am in awe of this institution and this place that was built by my family.\"", "description": "Monticello, the expansive brick home of Thomas Jefferson, sits atop a hill overlooking farmland, trees and the University of Virginia, the institution founded by the third U.S. president.", "authors": ["Carlos Barria", "Makini Brice"], "top_image": "https://photos.wi.gcs.trstatic.net/WBTnOVC7qqta06gXHeKsQ50MuH_z0yl7QvDsiRjq6fPeBu7c09oTI6DTnUlmqglKeirpFxswMmKodc5gZrad_QySbBMBf9RQJPtGD5-AnNexjvChvwp3_XGVJwhd2Jjx"}