{"pub": "nymag", "url": "https://vulture.com/2019/10/jerry-saltz-and-justin-davidson-on-the-new-moma.html", "downloaded_at": "2019-10-25 22:17:15.240894+00:00", "title": "Jerry Saltz and Justin Davidson on the New MoMA", "language": "en", "text": "The new MoMA: better gallery flow (we hope) but still a long wait for lunch. Photo: Iwan Baan/Courtesy of MoMA\n\nNew York’s architecture critic Justin Davidson and art critic Jerry Saltz both spent a lot of time considering the expanded and reworked Museum of Modern Art. After multiple visits to the reopened museum, they shared and compared their observations.\n\nJustin Davidson: Let’s start with the architecture. Jerry, you’ve made your distaste for Diller Scofidio + Renfro — and your skepticism about their MoMA design — plain. Did they live up to or down to your expectations?\n\nJerry Saltz: Both. First, I’m grateful we didn’t get one of their grandiose pharaonic shed-things on wheels, or another of their carnivalesque corporate nullities. Art dodged a bullet after DS+R announced its original MoMA plans in 2014. You, I, and a few others had hissy fits about what the starchitects were proposing.\n\nJ.D.: I did object to the demolition of the Folk Art Museum, but … hissy fit?\n\nJ.S.: Okay, maybe not you, and as much as I love the Folk Art Museum its old building was totally useless for art. As for listening to what DS + R had in mind for MoMA, I recall cascades of architect argot about micro galleries, auto-critique, institutional interfacing with the city, surgical interventions, gestures of variation on the white cube and the black box, social and performative space, and “a large new architecturally significant staircase.” Then Liz Diller actually talked about how her spaces were for “installations … performance, lectures, different kinds of events” and “certainly not paintings on a wall.” I recall thinking, Oh, my God, more of that old 1980s painting-is-dead nonsense.\n\nJ.D.: Architects talking about architecture can get pretty scary, it’s true. What about what they actually did, though?\n\nJ.S.: Well, the great news is that along with the rest of us, Diller Scofidio + Renfro were finally beaten down by the reality of just how messed-up and cramped the billion-dollar Taniguchi building was. They fixed some of the problems and tacked on a few fun extras, and added about five Gagosians’ worth of space. But it still amazes me that the suits who make the museum’s real-estate deals sold MoMA short again.\n\nJ.D.: It’s true that MoMA sold part of the site to Hines, the developers of the tower, in exchange for four floors of gallery space — low floors that weren’t worth so much as condos anyway.\n\nJ.S.: Don’t MoMA’s deal-makers understand that their prestige, location, and airspace are worth much more to the developers than the developers are to MoMA? They should’ve gotten, like, four more complete floors. Maybe more. If the developers said no, I’d tell them to take a walk. I wouldn’t have settled without more space for the museum. No matter: I’m thrilled to say that the Museum of Modern Art is now almost big enough.\n\nThe view from 53rd Street. Photo: Brett Beyer/Courtesy of Diller Scofidio + Renfro\n\nJ.D.: Speaking of which, one of the main challenges driving this design was traffic engineering: how to get large numbers of visitors into, out of, and through the building. That’s why the Folk Art Museum had to go, because it interfered with the pathways. But circulation isn’t neutral: here, the idea is that visitors should be able to jump into a chronological narrative at any point, cut across time periods, and have similarly rich experiences no matter whether they turn left or right at any particular juncture. How does that square for you with the experience of actually looking at art?\n\nJ.S.: I love that for the first time ever, you can get lost at MoMA. As with the Met, we may begin to tell ourselves our stories rather than being subjected to the old bullying “Cézanne begat Picasso who begat Duchamp who begat everything post-1979” line. Starry Night is still in the same gallery. Things proceed pretty well after that, till you get to about 1962. Then things turn boring, rote, and focus dissipates. Maybe it’s just that a lot of the great artworks made then — all those formalist squares, squiggles, monochrome canvases, and disarrangements on the ground — don’t speak to people anymore. They don’t do much to me these days, honestly. But students, curators, and collectors revere this and postmodernism, so I guess they should be ecstatic.\n\nJ.D.: Well, what you call bullying, I call teaching. I am deeply grateful to museums that have trained my eye and helped me understand how artists and movements relate to each other — all the begats, as you call them. It’s one thing to get lost at the Metropolitan Museum, which covers many millennia and the entire globe. That kind of disorientation is a wonderful experience, because it gives you a sense of the infinite varieties of art. It’s also overlaid with generations of connoisseurship and culling. But MoMA has a narrower purview, and now it seems less confident about how to navigate it.\n\nJ.S.: How does the building strike you from the outside? And from the inside — other than there being more space? I mean, is it a good building? Is it a building, even?\n\nJ.D.: The outside is hardly noticeable, which is kind of amazing for something so big. It’s a river of glass that flows away from the older parts and right into the base of the new tower by Jean Nouvel, with its bulky, brawny black trusses.\n\nJ.S.: Well, for sure, the building is “hardly noticeable,” and to me, hardly notable. But I care only about whether museums have enough good, usable space for art. Does it?\n\nJ.D.: It’s much more interesting inside. The changing curatorial mission, if in fact it is changing, put the architects in an odd position. They had to come up with a building that expresses the museum’s current vision but can also withstand a future reversal of fashion. If the current administration leaves or has a change of heart, and in a few years the begats reassert themselves, the architecture must adapt without breaking a sweat. I’m sure it can do that. This building works just as well for a Museum of “What’s Modern Art?” as for a Museum of “This Is Modern Art!” But that creates a tension between a high-precision design aesthetic and a museum that’s deliberately blurring its own brand.\n\nJ.S.: You’re way right about the “if in fact it is changing” part. In a way it’s meet the new modernism, same as the old modernism — but with other names. That’s fantastic, but it would be so great if MoMA could finally break the orthodox academic definitions of modernism and treat us to whatever art was going on in, say, India, Iowa, or Iraq in the 1930s. Art that was new and modern but not modernist! It’s like MoMA is saying, “Wherever there’s a grid, we’ll be there.” Oy.\n\nJ.D.: So you want MoMA to stake out the anti-MoMA position, too?\n\nJ.S.: Yes! A lot of that art is thrilling and radical in its own right — have you ever looked at WPA post-office murals in the Southwest and West? Amazing stuff! But it doesn’t fit MoMA’s hard-core formalist program, so you’ll never see it here. Remember that, when the Taniguchi building opened in 2004, less than 5 percent of the artists with work on view were women. Now the names of the canon may be shifting and that’s great, but what the canon supposedly is still has an iron grip on curators. That rigidity is only habit and an illusion. Modern art contained multitudes in that period. Maybe my dream has to wait for a generation that either hasn’t been brainwashed by academic doctrine or that has some real visionaries. Or just the nerve to buck the old dogma. But here’s the real building thing to me: Not to be a buzzkill — after almost every MoMA review has been over-the-top ebullient — I’ve been there on every open day so far, and the hot spots especially, as well as a lot of other galleries, are already pretty crowded, to almost bursting. I don’t blame the architects. Or MoMA. But this hull is already under pressure.\n\nJ.D.: The crowding is extreme but predictable. I couldn’t get near Starry Night unless I was willing to perform the offensive-lineman move I use to get on the 1 train at rush hour. By the time I was done, emerging onto 53rd Street felt like a trip to the country — all that open space! MoMA seems to think the crowds will abate once the opening buzz wears off, but I wonder. Experience has taught us that if you add more lanes to a congested highway, it attracts more cars and immediately becomes congested again. I’m starting to suspect the same principle applies to museums.\n\nJ.S.: What do you make of it spatially and aesthetically now that it’s full of people?\n\nJ.D.: Some things will become obvious only gradually, but on my first post-opening visit, I noticed a handful of trouble spots — none of which were obvious until the crowds arrived, because they’re physical but not visual. The first issue is hunger.\n\nJ.S.: For sure! I gave up five different tries of waiting in the long second-floor coffee-and-croissant line. On the sixth try I made it, but they were out of croissants, so I had my first ever cheese Danish.\n\nJ.D.: Right?! I went up to the sixth floor to try to get some lunch in the groovy new café, and the line stretched down the staircase, so I gave up and left the museum. If you’re going to open an all-day experience, you have to feed the people, quickly, well, and cheaply.\n\nJ.S.: I gave up on the sixth floor café too. But I’m never at MoMA to eat or for coffee anyway, so I guess these aren’t my battles. I say fill in the atrium with gallery space (please, the place is useless); take back the entire education building (which is contiguous with the actual museum; move those wonderful people to offsite offices); and yes, create more space for people to sit, rest, and eat. More benches and spaces for the disabled, please!\n\nJ.D.: The second problem is sound. Especially in mixed-media galleries: I paused in front of Jasper Johns’s Flag, where a handful of people were talking in low voices, and there’s a pocket of resonance in that corner that’s practically crypt-like. Plus I heard two different soundtracks coming from the gallery to my left and a third coming from a Merce Cunningham clip to my right. I believe excessive exposure to that kind of acoustic confusion eventually leads to psychosis.\n\nJ.S.: Curators these days think of museums as a physical Instagram, places where constant stimulation is required for effect. Weird. DS+R are the firm for just this kind of razzle-dazzle.\n\nJ.D.: I disagree with you there: They’re on the more austere end of the razzle-dazzle spectrum. But back to my experiential list: Third, tremors. One of the most striking architectural features of the new wing is the ultrasleek staircase that hangs from a blade-thin wall. I stopped for a moment on the landing and the floor suddenly started jumping so much I thought a football team was thundering down from the third floor. It turned out to be one skinny dude in sneakers. I stayed for another ten minutes, and discovered that even if I turned toward the window, I could estimate how many people were on the stairs behind me just by consulting my inner seismograph.\n\nBut the joyful part of the experience is that it feels like a big-city museum, with all the excitement and disorientation that suggests. You keep making discoveries, like the ground floor “Energy” show, with Massoud Hassani’s handmade, windblown minesweeper that looks like a starburst of toilet plungers. The frustrating part comes if you want to slow down, step out of the flow, and just have a few quiet moments with an artwork you love. I found that virtually impossible.\n\nJ.S.: Well, now that everyone is thinking, “What’s with these two geezers raining on our parade?” I’m going to rate one gallery. Finally, after decades and shaming, MoMA has seen fit to make a place for so-called outsider artists. For this I am deeply grateful. It kills me, however, that they’re sequestered in a ghetto. It would have been miraculous to see some of these artists killing it if simply installed chronologically with art that was being made at the exact same time. Sometimes in the same countries! Bill Traylor would blow a hole through the walls of the 1940s–1950s galleries. Ditto James Castle. The great Native American ledger drawings were made in American concentration camps up to the 1920s. For whatever reason, MoMA can’t think this way. (Amy Sillman’s jam-packed artist-curated group show “Shape” is by far the best single show in the museum — because she thinks like an artist!) On the other hand, the gallery with Florine Stettheimer — the inclusion of the academically approved, super-hipster contemporary artist Jutta Koether aside — makes my heart sing and is a blast of fresh aesthetic air and possibility.", "description": "Justin Davidson and Jerry Saltz—Art and Architecture Critics at New York Magazine—Compare Their MoMA Experiences", "authors": ["Justin Davidson", "Jerry Saltz"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/10/09/moma/09-moma-6.w1200.h630.jpg", "published_at": "2019-10-25"}