{"pub": "breitbart", "url": "https://breitbart.com/news/ravens-edge-steelers-in-overtime-pittsburghs-rudolph-hurt-2", "downloaded_at": "2019-10-08 10:25:50.234882+00:00", "title": "Ravens edge Steelers in overtime, Pittsburgh’s Rudolph hurt", "language": "en", "text": "Los Angeles (AFP) – Justin Tucker drilled a 46-yard field goal to lift the Baltimore Ravens to a 26-23 NFL overtime victory in Pittsburgh on Sunday in a clash of bitter division rivals that saw Steelers quarterback Mason Rudolph exit after a frightening third-quarter hit.\n\nTucker’s kick sealed the win after the Ravens forced a late fumble, Baltimore cornerback Marlon Humphrey knocking the ball loose from Steelers receiver JuJu Smith-Schuster on the Steelers’ second play from scrimmage in overtime.\n\nHumphrey recovered the ball and the Ravens’ drive set up the attempt by Tucker, who had made a 48-yard field goal with 10 seconds left in regulation to force overtime.\n\nThe Ravens overcame a shaky performance from quarterback Lamar Jackson, who connected on 19 of 28 passes for 161 yards, one touchdown and three interceptions.\n\nThe Ravens led 17-13 when Pittsburgh’s Rudolph scrambled out of the pocket and unloaded the ball to teammate James Washington.\n\nRavens safety Earl Thomas charged in, hitting Rudolph under the chin with his helmet.\n\nRudolph crashed to the turf, lying motionless and apparently unconscious as his teammates, some clearly upset, signalled for help from the sidelines.\n\nHe eventually stood and walked with help from the field. The Ravens said he was taken to hospital for further evaluation of a concussion.\n\n“I was just trying to get to the ball and make a play for my team,” said Thomas, who was flagged for roughing the passer on the play.\n\n“I hit the strike zone, I didn’t go high. I didn’t try to intentionally hurt him.”\n\nPittsburgh turned to undrafted rookie quarterback Devlin Hodges, and with him at the helm capped a 10-play, 65-yard drive with a one-yard touchdown run by James Connor that gave the Steelers their first lead of the game at 20-17.\n\nAfter the teams traded field goals, the Ravens gained possession with less than three minutes left in regulation to give Tucker the chance to tie it up and force overtime.\n\nBaltimore improved to 3-2 to take the lead in the AFC North division ahead of the 2-2 Cleveland Browns who play San Francisco on Monday.\n\nThe Steelers slipped to 1-4, third in the division ahead of the Cincinnati Bengals who dropped to 0-5 with a 26-23 loss to Arizona.\n\n“It’s painful, as it should be,” Steelers coach Mike Tomlin said of the defeat.\n\nAlthough they got the win, the Ravens didn’t escape unscathed with safety Ton Jefferson suffering a knee injury that coach John Harbaugh said would require season-ending surgery.\n\n– Brady climbs passing list –\n\nThe day’s action began on the other side of the Atlantic, where Oakland thwarted Chicago’s second-half rally bid in a 24-21 victory at Tottenham Hotspur Stadium in London.\n\nThe Bears trailed 17-0 at halftime but stormed back to take a 21-17 lead before the Raiders regained the lead with less than two minutes remaining on Josh Jacobs’ two-yard touchdown plunge.\n\nIn Washington, New England Patriots quarterback Tom Brady was sacked four times but still managed to hit another milestone in a 33-7 victory over the hapless Redskins.\n\nBrady, 42, threw for 348 yards, three touchdowns and one interception and along the way moved into third place on the NFL career list for passing yards.\n\nHe passed Brett Favre, who amassed 71,838 passing yards with three teams, moving ahead of the former Green Bay great on a 15-yard pass to Julian Edelman in the third quarter.\n\nBrady finished the game with 71,846 career passing yards. He’s just 17 short of Peyton Manning who is second on the list with 71,863.\n\nNew Orleans quarterback Drew Brees, currently sidelined by a thumb injury, leads the all-time list with 78,845.\n\nIn Brees’s absence Sunday, backup Teddy Bridgewater threw four touchdown passes to lead the Saints to a 31-24 victory over the Tampa Bay Buccaneers.\n\nHouston quarterback Deshaun Watson also enjoyed a big day, throwing five touchdown passes in a 53-32 victory over the Atlanta Falcons.\n\nThe Green Bay Packers had another big day in Dallas, building a 28-point lead on the way to a 34-24 victory over the Cowboys.\n\nThe Indianapolis Colts handed the Kansas City Chiefs their first defeat of the year with a 19-13 victory that left the Patriots and the 49ers as the only remaining unbeaten teams.", "description": "Los Angeles (AFP) – Justin Tucker drilled a 46-yard field goal to lift the Baltimore Ravens to a 26-23 NFL overtime victory in Pittsburgh on Sunday", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/08/605d57_baltimore-justin-tucker-kicks-game-winning-field-goal-in-ravens-nfl-overtime-640x335.jpg", "published_at": "2019-10-08"}