{"pub": "yahoo", "url": "https://news.yahoo.com/uh-oh-trump-attorney-general-213306043.html", "downloaded_at": "2019-10-04 03:03:41.621723+00:00", "title": "Uh oh: Trump’s attorney general asks Facebook for ‘backdoor’ messaging access", "language": "en", "text": "Click here to read the full article.\n\nUS Attorney General Bill Barr is scheduled to make some remarks at a Justice Department event Friday focused on how tech companies promoting encryption has hampered government access to information.\n\nThat’s according to a New York Times preview of the event, which will come in tandem with a chilling demand from Barr: In a letter from President Trump’s AG to Facebook dated October 4, Barr asks the social networking giant to immediately halt its plan to expand end-to-end encryption across the company’s messaging services like WhatsApp and Facebook Messenger.\n\nMore from BGR\n\nIf this sounds like the Apple vs. FBI fight all over again, that’s because that’s basically what this is — just on a much larger and scarier scale. That previous battle involved the FBI trying to gain access to a single locked iPhone (the one belonging to one of the San Bernadino terrorists. This time around, the government apparently wants so-called backdoor access that would allow it to peek into essentially any Facebook message until the end of time.\n\n“Companies should not deliberately design their systems to preclude any form of access to content, even for preventing or investigating the most serious crimes,” reads Barr’s letter, which was also signed by UK Home Secretary Priti Patel, acting US Homeland Security Secretary Kevin McAleenan, and Australian Minister for Home Affairs Peter Dutton. Outlets including both the NYT and Buzzfeed obtained the letter early.\n\nThis turn of events comes, it should be noted, in tandem with the next major paradigm shift happening at Facebook. Earlier this year, CEO Mark Zuckerberg unveiled a shift of emphasis away from the public square aspect of the social network (which was on the decline anyway) to groups and private sharing — including, regarding the latter, a stitching together of the infrastructure behind Facebook’s messaging apps like Messenger and WhatsApp. And, also, supporting end-to-end encryption between them.\n\n“We believe people have the right to have a private conversation online, wherever they are in the world,” reads a statement from Facebook in opposition to Barr’s letter. “…We strongly oppose government attempts to build backdoors because they would undermine the privacy and security of people everywhere.”\n\nThis will be a massively important fight to watch, one with global implications. What a strange moment in time this is, where events are threatening to cast Zuckerberg as the privacy champion he never set out to be.\n\nBGR Top Deals:\n\nTrending Right Now:\n\nSee the original version of this article on BGR.com", "description": "US Attorney General Bill Barr is scheduled to make some remarks at a Justice Department event Friday focused on how tech companies promoting encryption has hampered government access to information.That's according to a New York Times preview of the event, which will come in tandem with a chilling", "authors": ["Andy Meek"], "top_image": "https://s.yimg.com/uu/api/res/1.2/x4VlVxhmxbts4fXuLkRLtA--~B/dz0wO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://boygeniusreport.files.wordpress.com/2019/10/webp.net-resizeimage-1-1.jpg?quality=98&strip=all", "published_at": "2019-10-03"}