{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7627883/Huge-two-metre-brown-snake-discovered-hidden-tangled-washing-machine.html", "downloaded_at": "2019-10-30 00:20:14.156686+00:00", "title": "Huge two metre brown snake discovered hidden tangled in a washing machine", "language": "en", "text": "A huge two-metre brown snake has been discovered tangled underneath a washing machine.\n\nThe deadly snake was discovered in the laundry of a family home in Kenilworth, west of Queensland's Sunshine Coast, mid-morning last week.\n\nStuart Mckenzie from Sunshine Coast Snake Catchers 24/7 was called to the job but the eastern brown had disappeared before he arrived.\n\nA deadly two metre brown snake (pictured) was discovered tangled underneath a washing machine\n\nThe photo of the discovery was sent to Mr Mckenzie before he drove to the home.\n\n'Imagine going to throw the dirty washing in the machine and seeing a brown coloured tail disappearing under it,' he said.\n\n'It would definitely be an acceptable excuse not to do the washing.'\n\nThe post was liked over 700 times and 100 people commented on the thread.\n\n'I always want an excuse to not do the washing but this is definitely not one of them!' one wrote.\n\n'You would never think of doing the washing the same again,' another wrote.\n\nOne added: 'I knew house work was dangerous.'\n\nMr Mckenzie told Daily Mail Australia the panicked family called because they thought the snake was stuck.\n\n'I wasn't surprised to learn the snake was found underneath the washing machine,' he said.\n\n'It was probably looking for mice to eat and it's not uncommon for snakes to hunt underneath furniture and houses.'\n\nA snake catcher was called to the job but the eastern brown had disappeared before he arrived (stock image)\n\nHe said the owners 'got a little too close' when they took the photo.\n\n'Please ensure you are a safe distance away from a snake in your house or yard even if you are trying to get a good photo,' he wrote on Facebook.\n\n'A good photo is not worth getting bitten over!'", "description": "The deadly serpent was discovered in a semi-enclosed laundry of a family home in Kenilworth, west of the Sunshine Coast mid-morning last week.", "authors": ["Paula Ahillon For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/21/20348800-0-image-a-2_1572385674297.jpg", "published_at": "2019-10-29"}