{"pub": "reuters", "url": "https://in.reuters.com/article/usa-fed-clarida/feds-clarida-says-inflation-expectations-in-line-with-mandate-idINKBN1WB2KC", "downloaded_at": "2019-09-26 21:09:27.246653+00:00", "title": "Fed's Clarida says inflation expectations in line with mandate", "language": "en", "text": "SAN FRANCISCO (Reuters) - U.S. inflation expectations are currently in line with the central bank’s 2% goal, Federal Reserve Vice Chair Richard Clarida said on Thursday, a remark that suggests he does not see a pressing need for new rate cuts to push inflation back up.\n\nFILE PHOTO: Federal Reserve Vice Chair Richard Clarida talks on the phone during the three-day \"Challenges for Monetary Policy\" conference in Jackson Hole, Wyoming, U.S., August 23, 2019. REUTERS/Jonathan Crosby\n\n“I myself do judge that U.S. inflation expectations do reside in a range that I consider consistent with our price stability mandate,” Clarida said at a conference held at the Federal Reserve Bank of San Francisco which is focussed on the trade-offs in a so-called “hot economy.”\n\nFed policymakers cut interest rates last week to a range of 1.75% to 2.00%. They also lowered borrowing costs at their prior meeting at the end of July, moves Fed Chair Jerome Powell has characterized as “insurance” against the risks to the U.S. economy posed by slowing global growth, U.S. trade tensions and moderate inflation.\n\nBut Powell has also made plain that the Fed will take further decisions on the path of interest rates on a meeting-by-meeting basis and he, Clarida and several other policymakers have said the economy, powered by robust consumer spending, is in a good place.\n\nThe San Francisco Fed conference is part of a series of Fed events Clarida is spearheading that are meant to feed into a review of the central bank’s policy framework, including a look at whether the Fed should change how it targets inflation so that it can more powerfully affect it.\n\nThe central bank expects to release its framework findings sometime in the first half of 2020.\n\nOn Thursday, Clarida in his opening remarks said the U.S. labour market is robust and the 3.7% unemployment rate is in the range of “plausible estimates” of full employment.\n\nYet, he said, “there is no evidence that rising wages are putting upward pressure on price inflation,” noting that structural changes in the economy have weakened the connection between loose monetary policy and the risk of high inflation.\n\nIt was a point that researcher after researcher on following panels drove home to Clarida, San Francisco Fed President Mary Daly and other economists, community leaders and policymakers in the room, as they emphasized the benefits of low interest rates in reducing inequality and giving more people access to jobs.\n\nEven economist Doug Holtz-Eakin, who said his assignment at the conference was to talk about the hot economy’s costs, said he had been surprised at how many workers have been drawn into the U.S. economy in recent months.\n\nHe cautioned, however, that even though too-easy Fed policy is not generating excessive inflation, there is always that possibility, and warned that the Fed should be more cognizant that low interest rates can inflate assets and create financial instabilities.", "description": "U.S. inflation expectations are currently in line with the central bank's 2% goal, Federal Reserve Vice Chair Richard Clarida said on Thursday, a remark that suggests he does not see a pressing need for new rate cuts to push inflation back up.", "authors": ["Ann Saphir", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190926&t=2&i=1434245263&w=1200&r=LYNXMPEF8P1RM", "published_at": "2019-09-26"}