{"pub": "cnbc", "url": "https://cnbc.com/2019/10/01/two-thirds-uk-businesses-opt-for-tech-skills-over-math-and-science.html", "downloaded_at": "2019-10-01 00:11:22.248599+00:00", "title": "Two out of three UK business leaders think tech skills matter more than math and science", "language": "en", "text": "vgajic | Getty Images\n\nMore than two-thirds (68%) of UK business leaders believe employees with technology skills such as coding and cybersecurity are more valuable than those who understand traditional subjects such as math and science. A poll of 502 Information Technology (IT) decision makers from different UK firms found that 53% did not think children were taught enough tech specialisms at school. The survey, carried out by Censuswide on behalf of tech jobs board CWJobs, also found three-quarters (73%) of employers felt tech education needed to happen at either primary or secondary school level. \"If the UK introduces students to tech at an early stage and highlights the diversity of the careers it can lead to, then we can equip them for the future,\" said Dominic Harvey, director at CWJobs, in the report released Tuesday. \"It will also help plug that much-publicized skills gap found in the tech sector currently,\" he added.\n\nCybersecurity top rated tech skill\n\nThe CWJobs 'More Than Code' report referred to another survey from consultancy Deloitte which said that nearly two-thirds (62%) of UK business executives said their tech talent pool did not have the capability to deliver their digital strategy. This was placed as a backdrop to its own research which revealed 63% of business leaders would hire someone with a tech specialism over a candidate without one, in order to futureproof their company. A similar amount said they would opt for employing the tech-savvy candidate so that they would be able to train others (64%) or offer bosses the chance to learn themselves (62%). Cybersecurity was the most in-demand specialism, with 79% citing it as the preferred tech skill, ahead of data analytics and business intelligence. However, cloud computing was most common among employees' existing tech skills (44%), ahead of cybersecurity (43%). \"The UK is facing a skills crisis and those with tech specialisms on their CV are being sought after by all companies, now more than ever,\" Harvey commented. \"What's clear is that learning a tech skill isn't just something that's relevant for one role or one industry, but the entire UK workforce needs to be embracing it if the country is to remain competitive on the world stage.\"\n\nSide-step into the 'dream' industries", "description": "More than two-thirds of UK business leaders believe employees with technology skills such as coding and cybersecurity are more valuable than those who understand traditional subjects such as math and science.", "authors": ["Vicky Mckeever"], "top_image": "https://image.cnbcfm.com/api/v1/image/103717120-GettyImages-507626772.jpg?v=1529471855", "published_at": "2019-10-01"}