{"pub": "breitbart", "url": "https://breitbart.com/national-security/2019/10/16/pro-democracy-lawmakers-chase-hong-kong-chief-out-legislature", "downloaded_at": "2019-10-16 23:13:27.210585+00:00", "title": "Pro-Democracy Lawmakers Chase Hong Kong Chief Out of Legislature", "language": "en", "text": "Hong Kong chief executive Carrie Lam attempted to deliver a policy address to the legislature, known as LegCo, on Wednesday but pro-democracy lawmakers heckled her so aggressively that the meeting was adjourned and Lam was literally chased out of the building.\n\nShe ended up giving her policy address, roughly equivalent to an American State of the Union address, by video later in the afternoon.\n\nThe Hong Kong Free Press reported Lam’s arrival was greeted with shouts of the popular protest slogan “Five Demands, Not One Less!” and calls for Lam to “step down and seek responsibility over police brutality.”\n\nPro-democracy lawmakers shout slogan Chief Executive Carrie Lam as she enters the LegCo chamber. The meeting was halted twice as democrats continued to heckle Lam, interrupting the delivery of her Policy Address.#China #HongKong #HongKongProtests pic.twitter.com/oA0cXhg6u5 — Hong Kong Free Press (@HongKongFP) October 16, 2019\n\nThere were also spirited gestures of defiance against Chinese Communist Party leader Xi Jinping’s threats to crush the protest movement.\n\n[HK's Legislator protest inside the chamber] 1/ I think President Xi definitely misinterprets the actual situation in HK and dodges our calls for democracy. That is an irresponsible remark as he mistakenly treats the people’s quest for democracy as an attempt to split China. pic.twitter.com/DE8tbMuzxo — Joshua Wong 黃之鋒 😷 (@joshuawongcf) October 16, 2019\n\nA legislator named Tanya Chan decided to shine a projector on Lam’s podium to cover it with the “five demands” message, a prank LegCo President Andrew Leung thought was a step too far. Leung suspended the meeting for fifteen minutes and called for more orderly behavior, but more pro-democracy legislators got their hands on projectors and bathed the podium in protest slogans, while the chamber rang with more chants.\n\nLeung canceled the meeting altogether and Lam departed the legislative building chased by pro-democracy lawmakers who were blocked from pursuing her by security. Chan declared Lam was the true “culprit inciting the protests.”\n\nThe Hong Kong Free Press puckishly noted Chinese media cut the streaming video feed from LegCo as soon as the heckling began, replacing it with “images of rural China.”\n\nAfter departing LegCo, Lam was asked by reporters if she had lost the ability and legitimacy to govern.\n\n“Of course I understand that as a result of these four months of social unrest, many people are very unhappy with the situation and even with the government, because we cannot promise them when things will get back to normal, and for some, we cannot promise them the things they want us to do, but this doesn’t mean we have no will to govern,” she replied.\n\n“The will and determination to govern is still there,” she insisted. “That’s why despite the pressure and the time constraints in the past months, my colleagues have pulled together a very substantive policy address and the supplement of more than 220 initiatives. And we will put our minds together to implement all of these.”\n\nSome of the initiatives Lam mentioned are related to Hong Kong’s housing crisis, widely seen as one of the reasons so many citizens, especially young people, were restless enough to erupt into a historically huge and determined protest movement in response to Lam’s now-withdrawn extradition bill. Others are pro-business measures designed to shore up support from Hong Kong’s business community, which is increasingly nervous about the economic fallout from the protests.\n\n“To nobody’s surprise, none of the measures addressed protesters’ demands for universal suffrage and an independent inquiry into police’s alleged abuse of power. Instead, housing and economic measures were dominant,” the South China Morning Post editorialized after watching Lam’s belated policy address on video.\n\nLam concluded her address by looking forward to the day Hong Kong can “emerge from the storm and embrace the rainbow,” thanks to “the spirit of the rule of law, the freedom of expression, and the unique advantage brought by the one country, two systems.”\n\nThis approach sounds less like Lam delivering on her pledge to consider the concerns of protesters, and more like an effort to peel off soft supporters who were really upset by high housing prices and economic troubles. Ardent members of the protest movement would definitely quarrel with her assertion that Hong Kong’s “one country, two systems” relationship with China is a “unique advantage.”", "description": "Hong Kong chief executive Carrie Lam is heckled out of delivering a scheduled policy address to the legislature.", "authors": ["John Hayward"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-1181460762-640x335.png", "published_at": "2019-10-16"}