{"pub": "cnbc", "url": "https://cnbc.com/2019/10/17/nasa-attempting-all-female-spacewalk-oct-18-and-it-would-make-history.html", "downloaded_at": "2019-10-18 01:07:34.092514+00:00", "title": "NASA is making a new attempt at an all-female spacewalk this week — here's how it would make history", "language": "en", "text": "NASA plans to launch its first all-female spacewalk again this Friday, Oct. 18, after cancelling initial plans for an all-female crew earlier this year.\n\nAccording to NASA, astronauts Christina Koch and Jessica Meir will travel outside the International Space Station to replace a faulty battery charge/discharge unit.\n\nKoch, who arrived at the space station on March 14, was set to first make history on March 29 alongside astronaut Anne McClain. The two were scheduled to be the first all-female crew to perform a spacewalk, but were later told by NASA that their mission would be delayed \"due in part to spacesuit availability on the station.\"\n\nMcClain, whose space mission ended over the summer, has since returned back to Earth.\n\nKoch, whose space mission won't end until February 2020, was joined at the International Space Station by Meir in September, reports The Wall Street Journal.\n\nAccording to CBS, a spacewalk, which is known as an \"extra-vehicular activity,\" consists of astronauts going outside of a spacecraft to complete a mission. In July 1984, Svetlana Savitskaya became the first woman to complete a spacewalk, followed by Kathryn Sullivan in October of that year. But on their spacewalks, they were joined by men.\n\nBoth Koch and Meir are graduates of NASA's 2013 class, which was 50% men and 50% women. Koch, who will be completing her fourth spacewalk, is also on track to set a record for the longest single spaceflight done by a woman. Currently, she is scheduled to be in space for another four months, bringing her total time to 328 days. That's 40 days more than former NASA astronaut Peggy Whitson's record of 288 days.\n\nKoch and Meir's historic space mission on Friday will make them the 14th and 15th woman, respectively, to ever walk in space. Their mission will also be NASA's 221st spacewalk since December 1998.\n\nSince its start in 1958, NASA has selected 350 astronaut candidates, with 57 of them being women. Currently, of the 11 astronaut candidates in training and the 38 who are already active, 17 are women.\n\nBesides being a historic event, Koch and Meir's mission will help the station function, NASA says. The failed BCDU they are replacing does not impact station operations, crew safety or the ongoing experiments that are taking place to prepare for humans to travel to the moon and Mars. However, the BCDU \"does prevent a set of batteries installed earlier this month from providing increased station power.\"\n\nIn an interview on NPR's \"Short Wave\" podcast earlier this month, Koch spoke about her and Meir's upcoming mission, as well as the progress the industry has made in welcoming more women.\n\n\"In the past, women haven't always been at the table, and it's wonderful to be contributing to the human spaceflight program at a time when all contributions are being accepted, when everyone has a role, and that can lead in turn to an increased chance for success,\" she said.\n\nLike this story? Subscribe to CNBC Make It on YouTube!\n\nDon't miss: NASA cancels first all-female spacewalk due to 'spacesuit availability'", "description": "Months after cancelling its first all-female spacewalk, NASA is sending astronauts Christina Koch and Jessica Meir outside the International Space Station to replace a faulty battery charge/discharge unit.", "authors": ["Courtney Connley"], "top_image": "https://image.cnbcfm.com/api/v1/image/105778069-1551885861196space.jpg?v=1551885914", "published_at": "2019-10-17"}