{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/aldi-customers-must-check-bank-20466210", "downloaded_at": "2019-10-05 22:53:01.367866+00:00", "title": "Aldi customers must check bank balance after some left 'super skint' by blunder", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAldi customers have lost hundreds of pounds thanks to a technical blunder some say has left them \"super skint.\"\n\nSome customers claimed were deducted from their bank accounts all at once instead of being staggered over weeks.\n\nThat included one man who was horrified to see £450 debited from his account this week.\n\nA brand new store in Rhyl revealed a \"technical issue\" meant payments made over its first five-and-a-half weeks of trading were not processed, reports NorthWalesLive .\n\nMany customers only found out about the error nearly two months later by notices left at the tills.\n\n(Image: Daily Post Wales)\n\n(Image: Daily Post Wales)\n\nThe notices warned people to prepare themselves for the money coming out of their banks all at once.\n\nBut other shoppers noticed straight away and said they reported the problem to the store immediately but nothing was done.\n\nThe German company - known for its popular 'Super Six' fruit and vegetable offers - has since urged people to contact it if they are facing bank charges as a result of the glitch.\n\nOne mum said she was left \"super skint\" after £400 was taken out.\n\nAnother added: \"Disgusting they can do this. We have gone overdrawn into our account by £323, we don't even have a overdraft.\n\n\"We literally have been left with nothing.\"\n\n(Image: Daily Post Wales)\n\nOthers argued that people should have checked their bank accounts and budgeted properly.\n\nBut one woman said: \"I write down all my direct debits, standing orders etc but I also have grown up children who I lend money to and who pay back for catalogues etc so I tick things off as I go along.\n\n\"I was stung for £250 over about 10 transactions so no, never noticed £20 or £12 etc not going out.\n\n\"Luckily, we have some savings but not everyone has. Please don't judge, just be grateful it's not you.\"\n\nRhyl pensioner, Stuart Gladwell, who had £450 taken from his account this week said such shocks could be \"potentially disastrous\" to people his age.\n\n(Image: Daily Post Wales)\n\nHe emailed Aldi to say: \"I am massively disgusted with the way you have handled this matter.\n\n\"You should have stopped taking card payments as soon as you realised you had the problem.\n\n\"Tracking outstanding payments that do not appear as outstanding on one's bank account is difficult to say the least.\n\n\"I thought I owed around £270 but it turned out to be £450, a massive shock to me.\n\n\"As a 73-year-old pensioner, shocks like that are potentially disastrous.\"\n\nMr Gladwell added: \"I have been lucky that my family helped me out. Many others will not be so lucky.\n\n\"You could, and indeed should, have given much more than one days' notice of your intention to take the money and staggered the payments.\n\n(Image: Daily Post Wales)\n\n\"A not very happy customer.\"\n\nAldi responded to the pensioner to say: \"Thank you for taking the time to contact Aldi Customer Services regarding our Rhyl store.\n\n\"The transactions will be submitted on October 2 and customers will see the payments come out of their accounts from October 3.\n\n\"This may take a few days to come out of your account. Regrettably, we are unable to delay these payments.\n\n\"We sincerely apologise for any inconvenience caused.\n\n\"Once again thank you for taking the time to contact us. We value your custom and hope you will continue to shop with us.\"", "description": "One man says £450 vanished from his bank account in one go after an Aldi 'technical issue' meant payments were processed late", "authors": ["Kelly Williams", "Lucy John", "Image", "Daily Post Wales"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20466311.ece/ALTERNATES/s1200/0_The-new-Aldi-store-at-Cei-Marina-Quay-retail-park-in-Rhyl-is-expected-to-open-soon-Image-David-Pow.jpg", "published_at": "2019-10-05"}