{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/rihanna-marks-sixth-return-vogue-20553610", "downloaded_at": "2019-10-10 18:34:59.847698+00:00", "title": "Rihanna marks her sixth return to Vogue as cover girl", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nRihanna has made history again as Vogue November 2019 issue stars her again for the sixth time.\n\nAccording to Forbes, Robyn Rihanna Fenty is the wealthiest female musician in the world, so it's no wonder the singer has been asked to front the issue once again.\n\nThe stunning Barbadian babe wears a chic nude dress for the front cover - her own design from Fenty, teamed with natural makeup to enhance her sultry green eyes and glowy skin.\n\nIn her issue, she chats about fashion, including fashion houses which give her designer envy, and gushes over her Fenty business.\n\nJahleel Weaver, Fenty's style director told Vogue that to cement the brand's design aesthetic, he had to stop limiting it to one aspect of the singer's style.\n\n(Image: Getty)\n\n(Image: Schlein PKI / SplashNews.com)\n\n\"Every woman isn't Rihanna, but many women relate to her all-over-the-place-ness. She is fearless, but she is also a businesswoman. She's a girlfriend. She's a friend. She's all of these things.\"\n\nShe has the most solo American Vogue covers of any black woman in history, and this is her sixth cover for the publication.\n\n(Image: Daily Record)\n\nBefore she modelled for this month's magazine cover, she was on front of the issue for April 2011, November 2012, March 2014, April 2016, and June 2018.\n\nAnd previously, Rihanna and Shari Belafonte were tied for the same amount of solo American Vogue covers with five, and model Naomi Campbell has bagged two solo American Vogue covers, and Lupita Nyong'o and Beyoncé both have four.\n\n(Image: (Credit too long, see caption))\n\nRihanna herself took to Instagram to share the amazing news.\n\n\"So proud to be on another cover of @voguemagazine wearing my own designs from @fenty !!! On stands October 16th!\" she penned in excitement.", "description": "The businesswoman, musician and model is making her mark in history", "authors": ["Brogan-Leigh Hurst", "Image", "Getty", "Schlein Pki", "Splashnews.Com", "Daily Record", "Credit Too Long", "See Caption"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20466718.ece/ALTERNATES/s1200/0_Rihanna.jpg", "published_at": "2019-10-10"}