{"pub": "washingtonpost", "title": "A salad with figs, prosciutto and a sweet-sour dressing hits all the right notes", "url": "https://washingtonpost.com/lifestyle/food/a-salad-with-figs-prosciutto-and-a-sweet-sour-dressing-hits-all-the-right-notes/2019/08/28/185115d8-c912-11e9-be05-f76ac4ec618c_story.html", "language": "en", "published_at": "2019-08-28", "downloaded_at": "2019-09-02 07:09:49.199362+00:00", "text": "\n\nArugula Salad With Figs Agrodolce and Prosciutto; get the recipe, below. (Tom McCorkle for The Washington Post; food styling by Lisa Cherkasky for The Washington Post)\n\nAgrodolce — a traditional Italian sweet-and-sour sauce (agro means “sour” and dolce “sweet”) — is a mouthwatering tussle of contrast that seems to tickle every taste bud. Figs lend themselves to achieving the sauce’s yin-yang blast in a healthier way, because their inherent sweetness means little added sugar is needed to balance its vinegary pucker.\n\nThe balsamic vinegar, with its own deep, natural sweet notes, gets simmered with browned shallot, some water and just a tablespoon of honey until the liquid is reduced to a sumptuously tangy syrup.\n\nThen, quartered black mission figs (an especially sweet variety) and a little salt and pepper are tossed into the warm sauce. (You can use any variety of fresh figs, but you may need to adjust the flavor with a little more honey depending on how sweet they are.)\n\nHere, the figs get scattered on a mound of simply dressed arugula — the pleasant pepperiness of the greens offsets the bold sweet-tang of the fruit — and partnered with bites of salty, silky prosciutto. It’s a salad so flavorful, you’ll wish you could have it all the time, but make it now while you can, during this relatively brief window of fresh fig season.", "description": "NOURISH | Tossed with peppery arugula, the combination of flavors just sings.", "authors": ["Ellie Krieger", "September At Am", "Krieger Is A Registered Dietitian", "Nutritionist", "Author Who Hosts Public Television S", "Ellie S Real Good Food.", "She Blogs", "Offers A Weekly Newsletter At"], "top_image": "https://www.washingtonpost.com/resizer/3dBBn8TtuVCU1tEo_6IS3EsoSFs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NAVR65GE2MI6TC7XZXRNTYEQKU.jpg"}