{"pub": "yahoo", "url": "https://news.yahoo.com/latest-ex-rep-chris-collins-193417877.html", "downloaded_at": "2019-10-02 00:33:00.579316+00:00", "title": "The Latest: Ex-Rep Chris Collins pleads guilty in stock case", "language": "en", "text": "Former U.S. Rep. Chris Collins arrives at Federal court, Tuesday, Oct. 1, 2019, in New York. Collins is expected to plead guilty in an insider trading case Tuesday, a day after saying he was quitting Congress. (AP Photo/Mary Altaffer)\n\nNEW YORK (AP) — The Latest on a guilty plea from former U.S. Rep Chris Collins of New York (all times local):\n\n3:30 p.m.\n\nFormer U.S. Rep. Chris Collins has pleaded guilty in an insider trading case, a day after he resigned from Congress.\n\nThe Republican from western New York entered the plea on Tuesday in federal court in Manhattan. He had been accused of leaking confidential information about a biopharmaceutical company to his son while attending a White House picnic in 2017.\n\nThe information allowed the son and another man to dump their stock in the company and avoid nearly $800,000 in losses.\n\nThe U.S. House made Collins' resignation official Tuesday morning. It's now up to Democratic Gov. Andrew Cuomo to set a special election to fill the seat in the Republican-leaning district.\n\nThe 69-year-old Collins was among the first members of Congress to support President Donald Trump's run for the White House.\n\n___\n\n9:50 a.m.\n\nFormer U.S. Rep. Chris Collins is scheduled to appear before a federal judge for an expected guilty plea in an insider trading case.\n\nCongress made the New York Republican's resignation official Tuesday morning, hours before a planned 3 p.m. appearance before a federal judge in Manhattan.\n\nProsecutors say Collins had access to inside information about a biopharmaceutical company through his seat on its board.\n\nThey say he leaked bad news about a failed clinical trial at the company to his son.\n\nThe tip allowed Cameron Collins and another man to avoid nearly $800,000 in stock losses.\n\nWith his departure from Congress, it will be up to New York Gov. Andrew Cuomo to set a special election to fill the seat in the Republican-leading district.", "description": "Former U.S. Rep. Chris Collins has pleaded guilty in an insider trading case, a day after he resigned from Congress.  The Republican from western New York entered the plea on Tuesday in federal court in Manhattan.", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/pOql_60CAR.6EGyzgiWqwg--~B/aD0zMTM3O3c9NDcwNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/b506f9cb07afd67c55e542671a84a777", "published_at": "2019-10-01"}