{"pub": "cbc", "url": "https://cbc.ca/news/canada/new-brunswick/offensive-term-remove-urban-planet-1.5305540", "downloaded_at": "2019-10-03 23:26:25.518248+00:00", "published_at": "2019-10-02", "title": "'This word is our N-word': Indigenous teacher asks Urban Planet to drop racial slur | CBC News", "language": "en", "text": "An Indigenous educator is asking clothing franchise Urban Planet to remove its line of T-shirts that feature the word \"savage.\"\n\n\"It's important to understand that for Indigenous people, this word is our N-word,\" said Douglas Stewart, an Indigenous teacher at Harrison Trimble High School in Moncton.\n\n\"And if we had swapped that out and had the N-word on any colour shirt whatsoever, anywhere across this land, this would never have made it to the store, it wouldn't it wouldn't fly at all.\"\n\nStewart, of the Sylix/Okanagan Nation, said the word \"savage\" is a derogatory term, because it was used to describe Indigenous people when they were being colonized in North America.\n\nUrban Planet shirts bearing the word 'savage' are offensive, says Stewart, an Indigenous teacher at Harrison Trimble High School in Moncton. (Urban Planet)\n\nIn recent years, the term has come to mean fearless or fierce, but Stewart said he hasn't heard students use the word as much lately.\n\nStewart heard about the clothing line after a colleague went to Urban Planet to look for a shirt for Orange Shirt Day, which is held to honour Indigenous children who were sent to residential schools.\n\nStewart's colleague said she found shirts that were orange — but they also had \"savage\" written across the chest.\n\n\"I was dismayed and also curious,\" said Stewart, who teaches Indigenous studies and art. \"I try to look at these moments as opportunities to educate and to sort of lay out some history as to how this term came to be offensive.\"\n\nUrban Planet headquarters has not responded to Stewart's letter. (Mike Heenan/CBC)\n\nStewart decided to use the experience as a teaching moment, but he also knew he had to do something about it. He sent a letter to Urban Planet's customer service department, explaining why the clothing line is offensive.\n\n\"My hope for Urban Planet is that they take it off the shelves, which I asked them in the letter, and that they apologize,\" he said.\n\nUrban Planet has not responded to his letter. CBC News also reached out to Urban Planet headquarters but has not received a response.\n\nBut Aurore Pelletier, the assistant manager of the Fredericton store, agreed the slur should be removed from the clothing so customers feel comfortable shopping at Urban Planet.\n\nOrange T-shirts are worn on Sept. 30 to remember children who were sent to residential schools. (Kate Letterick/CBC News )\n\n\"It's affected Indigenous people for hundreds of years, it still affects them,\" Pelletier said. \"It would be the same as any other racial slurs printed and then sold in stores.\"\n\nStewart said his students share Pelletier's concerns.\n\nAlthough people use the word in a different context today, Stewart said he's concerned the word appears on orange shirts.\n\n\"If you look closely at the shirt design itself, it mimics the Every Child Matters logo in the Orange Shirt Campaign,\" he said.\n\n\"Which says to me that if it is an oversight, it's an oversight of serious proportion.\"", "description": "An Indigenous educator is asking clothing franchise Urban Planet to remove its line of T-shirts that feature the word “savage.”", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5305736.1570027930!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/douglas-stewart.jpg"}