{"pub": "wsj", "url": "https://wsj.com/articles/whats-next-for-company-chatbots-11569317402?mod=rsswn", "downloaded_at": "2019-09-24 13:41:23.318029+00:00", "title": "What’s Next for Company Chatbots", "language": "en", "text": "Early corporate adopters of chatbots, finding that the technology has saved them money, are working to improve them and exploring other areas where they could be put to use.\n\nChatbots use artificial-intelligence-based algorithms to understand and answer text or voice questions from customers and sometimes employees. Companies such as TD Ameritrade Holding Corp. , Ernst & Young LLP, Progressive Corp. and International Business Machines Corp. have rolled out chatbots in recent years and say they are seeing tangible benefits.\n\n“It’s a key part of our strategy and we’ll continue to invest in it,” said Vijay Sankaran, chief information officer at brokerage firm TD Ameritrade.\n\nSince it began offering text- and voice-based chatbots to clients in 2017, TD Ameritrade hasn’t needed to hire any new human agents, even though it has added many more clients, Mr. Sankaran said. Chatbots can answer basic questions about trade statuses and resetting passwords, while humans help with more complex problems related to taxes and beneficiaries.\n\nInsurer Progressive offers text-based chatbots on Facebook Messenger and in apps; it plans to roll one out on its website later this year. Chatbots are expected to save the company about $5 million this year thanks to fewer conversations requiring human agents, said Matt White, a customer-experience and -acquisition manager.\n\nPhoto: Progressive\n\nScreenshots of Flo, Progressive's chatbot. Photo: Progressive\n\nThe chatbots can help current and prospective customers with queries about policy coverage, discounts and changing billing dates. The company has also seen undisclosed revenue increases as customers buy more insurance policies because they can get answers to questions about insurance coverage quickly and anytime, Mr. White said.\n\nAbout three-quarters of businesses surveyed by the France-based Capgemini Research Institute, an arm of consulting and technology-services firm Capgemini SE , said they have seen quantifiable benefits from voice- or text-based chatbots, according to a September report. The survey of about 1,000 executives found that 88% said those benefits—including lower customer service costs and better user engagement—had met or exceeded expectations.\n\nThe cost to develop a chatbot ranges from hundreds of thousands to millions of dollars, depending on the project and the client, said Tom Hebner, head of product innovation, voice technology and AI at chatbot vendor Nuance Communications Inc.\n\nWithin the next few years, more companies could be using chatbots to authenticate customers based on their unique voices and the way they type, Mr. Hebner said. Chatbots could also be used more widely in call centers as the technology improves, he added.\n\nChatbots are already getting smarter. Drift.com Inc. is expanding the rollout of a chatbot platform that features “context-switching.” The technology allows it to respond to customers even if they switch topics—a task that’s difficult for other chatbots.\n\nCompanies are also using chatbots to supplement their human-resources departments.\n\nIBM has used its Watson AI technology to launch more than a dozen text-based HR chatbots since 2014. Chatbots handle about 40% of basic inquiries from the company’s 350,000 employees, which means IBM doesn’t need to hire more HR staffers even when some employees leave. “We’ve brought on fewer people but we also have new jobs and they’re paid more because they’re higher-skill,” said Diane Gherson, chief human resources officer for IBM.\n\nBy year-end, the company aims to integrate a more advanced AI technology called Watson Discovery into the chatbots to make them smarter. The chatbots will be able to learn in real time whenever content on an HR website has changed, and then answer a person’s question accordingly instead of just pointing the employee to that website.\n\nProfessional-services firm Ernst & Young has been using an HR chatbot named Goldie for two years, saving HR staff more than 10,000 hours of work between December 2018 and June, said Penny Stoker, global leader of HR services at EY. The company added more features to the chatbot over time, such as a way to answer questions about the day’s weather, after seeing employees engage with it beyond HR uses.\n\nWrite to Sara Castellanos at sara.castellanos@wsj.com", "description": "Early corporate adopters of chatbots, finding that the technology has saved them money, are working to improve them and exploring other areas where they could be put to use.", "authors": ["Sara Castellanos", "Sara.Castellanos Wsj.Com"], "top_image": "https://images.wsj.net/im-110053/social", "published_at": "2019-09-24"}