{"pub": "cbs", "url": "https://cbsnews.com/news/spacex-starship-update-presentation-elon-musk-updating-plans-for-his-gleaming-heavy-lift-starship-rockets-2019-09-28", "downloaded_at": "2019-09-29 05:04:49.203138+00:00", "title": "Space enthusiasts await Elon Musk update on '\"Starship\" plans", "language": "en", "text": "Space reporters, technical writers, bloggers and legions of Elon Musk fans eagerly anticipated a Saturday presentation by the charismatic SpaceX founder updating plans for his gleaming heavy-lift \"Starship\" rockets. The tech billionaire says the spacecraft will open up the solar system for exploration.\n\nPrototypes of the futuristic-looking Starship upper stage, intended to eventually carry payloads and passengers, are under construction in an industrial park near the Kennedy Space Center in Florida and on the south Texas coast near Brownsville, the location Musk chose to make his presentation.\n\nDriving to the desolate site along a two-lane road, visitors can catch a glimpse of the prototype Starship from more than eight miles away as its stainless-steel skin reflects the glare of the Texas sun like a distant light house.\n\nSpaceX engineers and contractors are building the 164-foot-tall Starship outdoors, just a stone's throw away from Boca Chica Boulevard and two miles or so from beaches on the Gulf of Mexico.\n\nA SpaceX \"Starship\" prototype takes shape at the rocket builder's south Texas test site near Brownsville and the hamlet of Boca Chica. William Harwood/CBS News\n\nSecurity guards tolerate but keep an eye on passers by who cannot resist pulling to the shoulder to take snapshots of the huge rocket, surrounded by cranes and work crews who attached the nose section and steering fins last week.\n\nThe prototypes are just that, and they do not include the life support and control systems that would be needed by an operational rocket intended to carry passengers or astronauts. Where that design work stands, how those systems will be integrated into future versions of the Starship, along with what it will eventually cost, are not yet known.\n\nBut the rocket's development has generated widespread interest, in part because of the vision Musk paints in his presentations and tweets describing launch systems that, compared to traditional designs, sound more like science fiction than fact.\n\nHis latest update comes at a time when NASA and Boeing are struggling to finish the first Space Launch System heavy-lift rocket, the giant booster the agency plans to use to send astronauts back to the moon in 2024 as part of the Artemis program.\n\nThe SLS, years behind schedule billions over budget, is not expected to make its first unpiloted test flight until 2021. Likewise, development of commercial crew ferry ships being built by Boeing and SpaceX to carry astronauts to and from the International Space Station also is lagging due to earlier funding shortfalls and technical issues.\n\nIn a tweet Friday, NASA Administrator Jim Bridenstine acknowledged the widespread interest in Musk's update, saying \"I am looking forward to the SpaceX announcement.\"\n\nBut, he added, \"in the meantime, commercial crew is years behind schedule. NASA expects to see the same level of enthusiasm focused on the investments of the American taxpayer. It's time to deliver.\"\n\nAn earlier artist's impression of a Starship and Super Heavy booster climbing out of the lower atmosphere on their way to orbit. SpaceX\n\nPlans for a super heavy-lift rocket were first unveiled by Musk during a 2016 meeting of the International Astronomical Congress. He outlined an architecture he called the Interplanetary Transport System built around a 42-engine first stage and a nine-engine upper stage built to carry crew, cargo or both.\n\nThe rocket eventually came to be known as the BFR, standing for Big Falcon Rocket or Big (fill in the blank) Rocket. In 2017, Musk downsized the rocket somewhat and last year changed the name, referring to the first stage as the \"Super Heavy\" and the upper stage as \"Starship.\" Fully assembled, the rocket would stand nearly 390 feet tall.\n\nAfter propelling the Starship into orbit, the Super Heavy booster, powered by 35 Raptor engines, would return to its launch site with a tail-first landing like SpaceX's current Falcon boosters, ready for refurbishment and re-launch.\n\nThe Starship, powered by a cluster of six Raptor engines, three of them optimized for use in vacuum, then could either deploy satellites, visit the International Space Station or carry astronauts and equipment to the moon or beyond.\n\nMusk said earlier the Starship could even be used for intercontinental flights on Earth, carrying passengers from city to city at unprecedented speeds. A flight from New York to Paris, he said, would take about 30 minutes.\n\n\"SpaceX's Starship and Super Heavy Rocket represent a fully reusable transportation system designed to service all Earth orbit needs as well as the Moon and Mars,\" SpaceX says on its website.\n\n\"This two-stage vehicle -- composed of the Super Heavy rocket (booster) and Starship -- will eventually replace Falcon 9, Falcon Heavy and Dragon. By creating a single system that can service a variety of markets, SpaceX can redirect resources from Falcon 9, Falcon Heavy and Dragon to Starship, which is fundamental in making the system affordable.\"\n\nThree methane-fueled Raptor engines have been installed in the Starship prototype at SpaceX's Boca Chica facility. SpaceX\n\nSpaceX has been testing a stubby single-engine prototype known as the Starhopper just down the road at the Boca Chica facility, successfully launching it to an altitude of about 500 feet last month before bringing it down to a successful landing.\n\nThe company is expected to begin launching the new three-engine Starship prototype on test flights later this year before attempting to propel the ship all the way to orbit. Details are not yet known, but a test flight to an altitude of about 12 miles could take place in the next month or two.\n\nThe Boca Chica prototype is known as the Mk 1. An identical Mk 2 Starship is under construction in Florida. It will be moved to SpaceX facilities at the Kennedy Space Center where construction crews are planning modifications to launch complex 39A where Falcon 9 and Falcon Heavy rockets are sent off.\n\nIt is not yet known when or where the Super Heavy booster will be built or when it might fly.\n\nIt's also not yet known how SpaceX plans to launch the Starship on orbital test flights in the absence of the Super Heavy. Musk tweeted earlier the Starship could make it to orbit on its own, but only by forgoing a heat shield and enough propellant to return to Earth.\n\nIn any case, Musk has said he hopes to launch an unpiloted mission to Mars by 2022 and a piloted flight by 2024.", "description": "The SpaceX founder visits the company's Texas launch site to deliver a Starship update", "authors": ["William Harwood", "Bill Harwood Has Been Covering The U.S. Space Program Full-Time Since", "First As Cape Canaveral Bureau Chief For United Press International", "Now As A Consultant For Cbs News. He Covered Space Shuttle Missions", "Every Interplanetary Flight Since Voyager Flyof Neptune", "Scores Of Commercial", "Military Launches. Based At The Kennedy Space Center In Florida", "Harwood Is A Devoted Amateur Astronomer", "Co-Author Of", "Comm Check"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/09/28/a0a657c6-f81c-4acc-9c1d-5b0dcbda40c4/thumbnail/1200x630/ef1754ccfa5ba0f13e78c91c9c188b6e/092719-starship3.jpg", "published_at": "2019-09-28"}