{"pub": "breitbart", "url": "https://breitbart.com/crime/2019/10/15/pennsylvania-police-warn-parents-thc-laced-halloween-candy", "downloaded_at": "2019-10-15 23:10:27.253202+00:00", "title": "Pennsylvania Police Warn Parents of THC-Laced Halloween Candy", "language": "en", "text": "Police officers in one Pennsylvania town are warning parents about THC-laced candy ahead of the Halloween holiday after seizing packages of Nerds Rope edibles containing THC.\n\nThe Johnstown Police Department announced Thursday that the department was conducting a search warrant in Stoney Creek Twp. when it found the THC edibles.\n\nTHC is the ingredient in marijuana which is psychoactive, giving its users a “high.”\n\n“During Halloween, we urge parents to be ever vigilant in checking their children’s candy before allowing them to consume those treats,” the Johnstown Police Department wrote in the post. “Drug laced edibles are package[d] like regular candy and may be hard to distinguish from the real candy.”\n\nThe police department also shared photos of the Nerds Rope candy, which had labels stating “for medical use only” and “keep out of reach of children and animals.”\n\nFerrara Candy Company, the candy company that produces Nerds, issued a statement saying it was cooperating with authorities, adding that the product in the police department photo is “counterfeit.”\n\n“We want to reassure consumers that the products they find at major retailers across the country are safe for them to consume,” the candy company said in a statement.\n\nMarijuana is legal for medical use in Pennsylvania but is not permitted for recreational use.", "description": "Police officers in one Pennsylvania town are warning parents about THC-laced candy ahead of the Halloween holiday after seizing THC candy.", "authors": ["Katherine Rodriguez"], "top_image": "https://media.breitbart.com/media/2019/08/GettyImages-1039329616-1-640x335.png", "published_at": "2019-10-15"}