{"pub": "guardian", "url": "https://theguardian.com/music/2019/sep/22/thom-yorke-ex-partners-death-desert-island-discs-rachel-owen", "downloaded_at": "2019-09-22 13:11:26.268010+00:00", "title": "Thom Yorke opens up about pain of ex-partner’s death", "language": "en", "text": "Thom Yorke has spoken of the “hard time” his family went through after his ex-partner died from cancer.\n\nThe Radiohead frontman met Rachel Owen, an artist and Oxford University lecturer, as art students at Exeter University. The couple were partners for 23 years and had two children together, Noah and Agnes, before separating in 2015.\n\nOwen died aged 48, in 2016, after suffering from cancer. She had been in poor health that year but continued to teach Italian into her final months.\n\nAsked about being a father to the two teenagers, Yorke told Lauren Laverne, presenter of the BBC Radio 4 programme Desert Island Discs: “I can’t hope to be their mum but we’re all right. I’m just really proud of them both. It stuns me most days. I can’t believe they’re anything to do with me. They’re just such great people.”\n\nOwen was an internationally renowned artist, mixing photography and printmaking. Her academic work focused on Italian medieval literature.\n\nYorke said: “When the kids’ mum died, it was a very difficult period and we went through a lot. It was very hard. She suffered a great deal and my ambition is to make sure that we have come out of it all right, and I hope that’s what’s happening.\n\n“I’m lucky now because I have a new partner who has come and brought a light into all of it, which has taken a great deal of strength. And really if all that’s OK … If I’m able to make some music that expresses all that and is still important to people, that’s more than I can ask for.”\n\nThe musician has spent much of his career criticising politicians for not doing enough about the climate emergency. But he admitted to Laverne that he was a hypocrite for flying around the world on tour while campaigning for change.\n\n“The thing I’ve always struggled somewhat with, is if I’m campaigning on climate change, I’m someone who has to fly for my work so ... I’m a hypocrite. I totally agree I’m a hypocrite but … what do you want to do about it?”\n\nLast month, the Duke and Duchess of Sussex sparked a furore for reportedly taking four private jet journeys in 11 days, despite speaking out on environmental issues. Sir Elton John came to their defence, claiming he had made sure the flights were carbon neutral by contributing to a carbon footprint fund.\n\nWhen asked about the criticism, Yorke said: “The truth of the matter is we’re all part of a system. It’s a systemic thing that has to change. You can do stuff but the real stuff has to happen in parliament and the UN, and has to happen now, we’re out of time.”\n\nYorke also spoke of how he found it difficult to cope with Radiohead’s success initially. “I got angry. I’m an extremely angry person. I got more control-freakery. I put my hands on the steering wheel and I was white-knuckled, and I didn’t care who I hurt or what I said,” he said. “Years later I sat down with the guys and apologised. By the time we got to recording OK Computer the doors had opened up and we had the best time doing that record.”\n\nHe said REM frontman Michael Stipe “helped me when things went crazy, when people started to talk to me like I was Jesus … on the street”.\n\nDesert Island Discs is on Radio 4 on Sunday at 11.15am and will then be available on the BBC Sounds app.", "description": "Radiohead singer talks on Desert island Discs about the strain on his family after Rachel Owen died", "authors": ["Aamna Mohdin"], "top_image": "https://i.guim.co.uk/img/media/a0601e4f67d408f9a46eec64d3a0b1a332d3de5f/579_142_3365_2019/master/3365.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=1cf2689982667a2d6e01afb09571d0f2", "published_at": "2019-09-22"}