{"pub": "huffpost", "url": "https://huffpost.com/entry/benjamin-netanyahu-boris-johnson-name-video_n_5d760abae4b0fde50c2971f5", "downloaded_at": "2019-09-09 11:45:23.626296+00:00", "title": "Netanyahu Botches Boris Johnson's Name, Official Video Attempts To Cover It Up", "language": "en", "text": "Israeli Prime Minister Benjamin Netanyahu has been mocked on social media for mistakenly calling U.K. leader Boris Johnson by the wrong name — and then attempting to cover up his blunder with a clumsily edited video.\n\nNetanyahu, who met with Johnson in London last week, made the error during a Sunday meeting with his Cabinet.\n\n“I’ve returned from a very pleasant visit in London, where I’ve met with Prime Minister Boris Yeltsin and the U.S. defense secretary,” Netanyahu said, using the name of the former Russian president who died in 2007.\n\nNetanyahu’s ministers immediately interjected, pointing out his mistake.\n\nThe Israeli leader reacted with a grin and corrected himself. “Boris Johnson,” he repeated, adding that he’d merely been checking to see if everyone was paying attention.\n\nNetanyahu tells the cabinet he met UK PM Boris *Yeltsin* 🤦🏻‍♀️\n\npic.twitter.com/joWFiDGV2t — Noa Landau נעה לנדאו (@noa_landau) September 8, 2019\n\nThough Netanyahu appeared to shrug off the slip-of-the-tongue, the gaffe was conspicuously missing from an official video of the meeting later released by the prime minister’s office.\n\nThe video shows Netanyahu speaking of his recent visit to the U.K. ― but instead of his Yeltsin slip-up, footage of Netanyahu saying “Boris Johnson” was spliced in.\n\nWATCH: Prime Minister Benjamin Netanyahu's remarks at the start of the weekly Cabinet meeting (English captions available)\n\n\n\nFull remarks >>https://t.co/NSUICfUkGD pic.twitter.com/CcXL5N9Z8F — PM of Israel (@IsraeliPM) September 8, 2019\n\nNetanyahu ― who is days away from a do-over election ― was teased for his blooper on Twitter.\n\nA doctored image of the prime minister’s re-election poster was circulated on the social media platform. The poster originally showed Netanyahu shaking hands with U.S. President Donald Trump, but the fake images showed the Israeli leader getting chummy with Yeltsin instead.\n\nמישהו יכול לדמיין שם את גנץ? pic.twitter.com/oWQbLqXlEu — Yoav Rabinovitz 🇮🇱 (@yoavr) September 8, 2019", "description": "The Israeli prime minister referred to his British counterpart as \"Boris Yeltsin.\" But the blunder was conspicuously edited out of an official video of h...", "authors": ["Senior Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d7612653b00002a74d0c2ef.jpeg?cache=9fpvn47hwt&ops=1778_1000", "published_at": "2019-09-09"}