{"pub": "bbc", "url": "https://bbc.com/news/uk-england-50168257", "downloaded_at": "2019-10-25 02:25:56.462936+00:00", "title": "Essex lorry deaths: 'How I nearly suffocated in the back of a lorry'", "language": "en", "text": "Image copyright Katie Barlow Image caption Jawad Amiri said news of the 39 found dead in a lorry in Essex brought back vivid memories\n\nWhen 39 Chinese nationals were found dead in the back of a lorry in Essex, Jawad Amiri remembered vividly how he nearly suffocated as he was smuggled into the UK.\n\nThe 28-year-old from Afghanistan was one of 15 people pulled from a sealed container on the M1 as oxygen became perilously low.\n\nHe described his harrowing journey from a Calais migrant camp and how a text from his seven-year-old brother Ahmad saved their lives.\n\n'It was like a moving grave'\n\nImage copyright Ahmad Amiri Image caption Ahmad, now 10, drew a picture of the lorry he nearly suffocated in\n\nEvery night the people smugglers would open a lorry and put groups of 20 to 30 people inside. They have taken your money and they don't care if you live or die.\n\nMe and my seven-year-old brother Ahmad got inside a refrigerated lorry with 13 others. They locked the door behind you and everybody was scared because you cannot open it from the inside.\n\nInside the lorry were cartons of medicine. There was a space of half a metre between the boxes and the roof. We had to lie there for 15 or 16 hours. We couldn't move, or sit or stand. It was like a moving grave.\n\nIt was completely dark and in the beginning it was very cold because it was refrigerated. But then the air conditioning was broken and it got warmer and warmer.\n\nWe took off our blankets and clothes. All we had was water and then that was gone. There was nowhere to go to the toilet.\n\n'We were banging on the walls'\n\nImage copyright Sally Bunkham Image caption Ahmad sent a text message which saved the lives of 15 refugees in danger of suffocating\n\nIt was difficult to breathe. My brother was crying, he was scared and he was coughing. I kept saying to him: \"You will be fine, they will open the door.\"\n\nWe were sweating, it was getting hotter and hotter and you couldn't talk very well.\n\nWe kept calling to the driver and banging on the roof. He stopped many times and we hoped he would open the doors but he did not want to.\n\nHe was using very bad language and shouting at us to be quiet.\n\nSome of the others had phones but they did not want to call the police because they were scared they would be sent back.\n\n'There was no oxygen'\n\nImage caption This is the text message Ahmad sent to alert a charity\n\nMy phone battery had gone but Ahmad had a very small phone and he sent a message to the lady at the charity in the camp who had given him the phone.\n\nHe said we needed help, the driver would not stop and there was no oxygen.\n\nShe said: \"Don't move, relax, don't talk too much we are going to call the police\".\n\nThey came with the dog and found the lorry and opened the door for us and by that time everyone was happy.\n\nSome people were upset because they were scared they would be sent back.\n\nA doctor came to check us and they said we were ok and they sent us to a hostel.\n\n'I am so sad for them'\n\nImage copyright Jawar Amiri Image caption Jawad Amiri now lives in Peterborough training to be a builder\n\nNow I am very happy. I have my right to remain in the UK and I am at college training to be a builder.\n\nMy little brother is 10 now and he has created a virtual reality experience of his journey and his dreams called Parwaz VR.\n\nI was in the car talking to my friend and he had the news of the deaths in Essex on the radio. I was physically inside the car but inside my head I was back in the lorry.\n\nIt made me feel very sick and sad and brought back bad memories. I think for those people the oxygen stopped and I am so sad for them.\n\nThey are not just 39 people who died. They are 39 families who have lost a brother or sister.\n\nPeople in the UK are intelligent, nice, kind people and I hope this will show that we should have more responsibility to look after people who have left their homes, their families, everything.\n\nMore on this story:\n\nAs told to Jennifer Meierhans.", "description": "Jawad Amiri says nearly suffocating inside a refrigerated lorry was like lying in a moving grave.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/5D08/production/_109361832_661b22d1-4265-4646-b2a7-0adc66439bed.jpg", "published_at": "2019-10-24"}