{"pub": "cnbc", "url": "https://cnbc.com/2019/10/20/linda-hamilton-termintor-workout-routine-at-63.html", "downloaded_at": "2019-10-20 16:57:00.316011+00:00", "title": "'Terminator' star Linda Hamilton worked with Serena Williams' trainer and didn't eat carbs for over a year for the role", "language": "en", "text": "When Linda Hamilton starred in the 1991 movie \"Terminator 2: Judgment Day\" alongside ex-bodybuilder Arnold Schwarzenegger, she became known for her impressive strength and fitness. Her portrayal of Sarah Connor turned \"Linda Hamilton arms\" into a cultural phenomenon.\n\nAccording to a 1991 Entertainment Weekly story, Hamilton worked out three hours a day for six days a week while filming the second \"Terminator\" film, and could bench press 85 pounds.\n\nNow, Hamilton is returning to her role in Paramount's latest Terminator remake, \"Terminator: Dark Fate,\" which premieres on Thursday. At 63, her workout routine has changed a lot in the past 28 years, and she still had to work hard to prepare for the physical demands of the job.\n\nIn an interview with InStyle, Hamilton revealed that she trained for a year with Mackie Shilstone, a trainer whose other clients include tennis champion Serena Williams and NFL star Peyton Manning. \"I got to work with him because Serena Williams was pregnant,\" she told InStyle. \"It was a wonderful accident of timing.\"\n\nHamilton's workouts included a combination of weight-lifting, Pilates and cross-training.\n\nAlong with Shilstone, Hamilton worked with a group of other clinicians, such as a cardiologist, physical therapist and dietitian. At their direction, she took dietary supplements and went on a strict diet.\n\n\"I didn't eat carbohydrates for a year and a half,\" she told InStyle.\n\nThis challenging prep work wasn't all about aesthetics; Hamilton told InStyle that the rigorous filming schedule and physical demands of the role were very taxing on her body too.\n\n\"On the film, we worked a lot of six-day weeks; even if we had a weekend off, there was probably a scuba lesson or military training,\" Hamilton told InStyle. \"When I did have a day off, I'd sleep 20 hours. I'd rest my body and read my books to take my mind elsewhere.\"\n\nHamilton also worked with an Army Ranger to learn how to properly handle the weapons featured in the film, she told \"Extra\" in July 2019.\n\n\"Terminator: Dark Fate\" is the sixth film in the \"Terminator\" franchise. \"Terminator 2: Judgement Day\" the second film, made the most money, grossing over $204 million in the United States, according to Box Office Mojo.\n\nLike this story? Subscribe to CNBC Make It on YouTube!", "description": "To prepare for her role in the upcoming movie \"Terminator: Dark Fate,\" 63-year-old star Linda Hamilton told InStyle she had to adhere to a strict workout regimen involving Pilates and weight-lifting, and follow a low-carb diet.", "authors": ["Cory Stieg"], "top_image": "https://image.cnbcfm.com/api/v1/image/106190193-1571415925589gettyimages-1176332418.jpeg?v=1571415972", "published_at": "2019-10-20"}