{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/10/13/yom-kippur-synagogue-shooter-was-former-army-member-father", "downloaded_at": "2019-10-13 09:24:14.140941+00:00", "title": "Yom Kippur Synagogue Shooter Was Former Army Member", "language": "en", "text": "Synagogue shooting suspect Stephan Balliet, 27, had previously been a member of the German armed forces, the Bundeswehr, according to his father.\n\nThe father of the suspected far-right terrorist, who killed a woman and a man near a synagogue in the German city of Halle, claimed that he had verbally fought with Mr Balliet. “There was always a fight. My opinion did not count. I could not get to him,” he said, according to Austrian newspaper Kronen Zeitung.\n\nWhile the father admitted that his son had been a member of the Bundeswehr, he added that the 27-year-old had no specialised training. He also revealed that he was not aware of his son’s involvement until he heard about the attack on the news. The father was silent when asked about his thoughts on the incident.\n\nThe father’s information corroborates witness testimony that described the movement of Balliet as being like that of a soldier.\n\nInvestigators say that Balliet was previously unknown to them, having no prior criminal record, and was not known for having any far-right extremist sympathies in the past. He also evaded scrutiny by manufacturing his own weapons rather than seeking a license to buy firearms legally.\n\nA series of documents have emerged online, suspected to have been written by Balliet. It details the various weapons built by the suspect and used in the attack.\n\nTwo people were killed outside a synagogue in the eastern German city of Halle as firearms were discharged and, according to reports, a grenade detonated in the building’s cemetery Wednesday morning. https://t.co/AX6dKwWWLN — Breitbart News (@BreitbartNews) October 9, 2019\n\nThe document lists five self-made firearms, including two sub-machine guns, two shotguns, and a single-fire pistol. It also claims that the ammunition used was also largely homemade as well.\n\nAlong with the homemade firearms, the document claims Balliet also had in his possession a combat knife, a longsword, 11 homemade fragmentation grenades, five pipe bombs, seven nail bombs, a smoke grenade, a thermite charge, a breaching charge, and 25 detonation caps.", "description": "Synagogue shooting suspect Stephan Balliet, 27, had previously been a member of the German armed forces, according to his father.", "authors": ["Chris Tomlinson"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-1174966999-640x335.png", "published_at": "2019-10-13"}