{"pub": "independent", "url": "https://independent.co.uk/sport/football/premier-league/liverpool-fc-news-kijana-hoever-carabao-cup-results-fixtures-a9121586.html", "downloaded_at": "2019-09-26 16:51:42.808871+00:00", "title": "MK Dons vs Liverpool: Carabao Cup ‘perfect’ opportunity for Reds youngsters says Ki-Jana Hoever", "language": "en", "text": "Ki-Jana Hoever believes the Carabao Cup presents the \"perfect way\" for Liverpool boss Jurgen Klopp to blood his young players.\n\nThe Reds saw off MK Dons 2-0 in their third-round clash on Wednesday night as Klopp made wholesale changes, including handing out three senior Liverpool debuts.\n\nHoever scored the second goal on his first start for the European champions, who had taken the lead in the first half as Dons goalkeeper Stuart Moore fumbled James Milner's effort over the line.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nWith 16-year-old Harvey Elliott becoming the youngest player to start for Liverpool in the club's history, Caoimhin Kelleher playing in goal and the likes of Rhian Brewster and Curtis Jones getting a chance to impress, Hoever feels the competition is an ideal proving ground.\n\n\"I think that's the perfect way to start learning how to play for Liverpool, how they want to play, with some experience in the team,\" the Dutch youth international told the club's official website.\n\nShape Created with Sketch. Liverpool's most expensive signings Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Liverpool's most expensive signings 1/10 1. Virgil van Dijk Price: £75m\n\nClub: Southampton Getty Images 2/10 2. Alisson Price: £66.8m\n\nClub: Roma Getty Images 3/10 3. Naby Keita Price: £52.75m\n\nClub: RB Leipzig Getty 4/10 4. Fabinho Price: £43.7m\n\nClub: Monaco Getty Images 5/10 5. Mohamed Salah Price: £36.9m\n\nClub: Roma Getty Images 6/10 Andy Carroll Price: £35m\n\nClub: Newcastle United Getty Images 7/10 Alex Oxlade-Chamberlain Price: £35m\n\nClub: Arsenal Getty Images 8/10 Sadio Mané Price: £34m\n\nClub: Southampton Getty Images 9/10 Christian Benteke Price: £34m\n\nClub: Southampton Getty Images 10/10 Roberto Firmino Price: £29m\n\nClub: Hoffenheim Getty Images 1/10 1. Virgil van Dijk Price: £75m\n\nClub: Southampton Getty Images 2/10 2. Alisson Price: £66.8m\n\nClub: Roma Getty Images 3/10 3. Naby Keita Price: £52.75m\n\nClub: RB Leipzig Getty 4/10 4. Fabinho Price: £43.7m\n\nClub: Monaco Getty Images 5/10 5. Mohamed Salah Price: £36.9m\n\nClub: Roma Getty Images 6/10 Andy Carroll Price: £35m\n\nClub: Newcastle United Getty Images 7/10 Alex Oxlade-Chamberlain Price: £35m\n\nClub: Arsenal Getty Images 8/10 Sadio Mané Price: £34m\n\nClub: Southampton Getty Images 9/10 Christian Benteke Price: £34m\n\nClub: Southampton Getty Images 10/10 Roberto Firmino Price: £29m\n\nClub: Hoffenheim Getty Images\n\n\"I think it's nice to have a few youngsters. You need to play your game. You are here because you can play good football so you need to show everyone and not try to hide, just show your talent and we all tried to do that.\n\n\"I have never scored before for Liverpool in the U18s or the U23s so it's the first one for Liverpool and I'm really happy.\"\n\nHoever, 17, moved to Liverpool from Ajax last year and is hoping to be involved in the fourth round of the Carabao Cup as Klopp's side welcome Premier League rivals Arsenal to Anfield.\n\n\"You hope the manager starts you in the next game again and gives you minutes,\" he added.\n\n\"That's what you are hoping for - the next game.\"\n\nElliott hit the woodwork twice during the match but MK Dons created opportunities of their own as Jordan Bowery also saw a shot strike the post.\n\n\"I'm quite gutted really, I think we could have scored a few,\" said Dons defender Regan Poole.\n\n\"We didn't hold back, had a good go and a fair few chances and we should have scored a couple - that is the only regret really.\n\n\"We were always hoping to have a right go with nothing to lose and I think we showed that. In the second half I think we were really good.\n\n\"We need to take this confidence now into the league, kick on and get back to winning ways.\"\n\nPA", "description": "Ki-Jana Hoever believes the Carabao Cup presents the \"perfect way\" for Liverpool boss Jurgen Klopp to blood his young players. The Reds saw off MK Dons 2-0 in their third-round clash on Wednesday night as Klopp made wholesale changes, including handing out three senior Liverpool debuts.", "authors": ["Mark Mann-Bryans"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/26/15/Ki-Jana-Hoever-.jpg", "published_at": "2019-09-26"}