{"pub": "yahoo", "url": "https://yahoo.com/entertainment/kylie-jenner-travis-scott-reportedly-013411679.html", "downloaded_at": "2019-10-02 02:29:25.725702+00:00", "title": "Kylie Jenner and Travis Scott Reportedly Taking a Break After More Than 2 Years of Dating", "language": "en", "text": "The pair, who share a 1-year-old daughter, are reportedly stepping away from their relationship for the time being.\n\nKylie Jenner and Travis Scott have decided to go their separate ways.\n\nThe reality star and the Astroworld rapper -- who share a 1-year-old daughter, Stormi Webster -- have decided to take a break from their relationship, according to multiple reports.\n\nThe pair reportedly tried to make things work, but have chosen to step away for the time being, TMZ reports.\n\nThe pair were last seen together in public, looking totally in love, at the premiere of Scott's new Netflix documentary, Travis Scott: Look Mom I Can Fly in August. The couple packed on the PDA on the red carpet, and attended the event with their baby girl.\n\nThe pair first sparked romance rumors in April 2017, and their romance blossomed throughout the year until initial reports began to spread that Jenner was pregnant with their baby. The reality star and cosmetics mogul then welcomed Stormi on Feb. 1, 2018.\n\nFor over a year before their split, the pair were continuously the focus of engagement rumors, and took to calling each other \"husband\" and \"wife,\" prompting many fans to believe that they'd secretly gotten married.\n\nEarlier this year, the pair weathered a supposed cheating scandal when Scott faced rumors and allegations of cheating, which he vehemently denied. By March, it seemed the pair had moved on and their relationship appeared intact.\n\nOn September 10, Jenner posted a nude snapshot, from her photo-shoot for Playboy magazine, in which she posed alongside Scott. However, that was the last Instagram pic in which Scott has appeared.\n\nET has reached out to reps for both Jenner and Scott for comment.\n\nFor more on the pair's relationship, watch the video below.\n\nRELATED CONTENT:\n\nKylie Jenner Says Being a Mom Has Improved Her Sex Life With Travis Scott in 'Playboy'\n\nStormi Webster Reveals Which Parent Loves Her Most -- Kylie Jenner or Travis Scott\n\nTravis Scott's Life With Kylie Jenner and Stormi: 7 Things We Learned From His 'Mom I Can Fly' Doc\n\nTravis Scott Doc: Everything We Learned About His Life With Kylie Jenner\n\nRelated Articles:", "description": "The pair, who share a 1-year-old daughter, are reportedly stepping away from their relationship for the time being.", "authors": ["Zach Seemayer"], "top_image": "https://s.yimg.com/uu/api/res/1.2/tTzevDrSgnNqBiLZSE4gfQ--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/homerun/etonline.tv/e75a2fa9a62585e28c327f11b3f83fab", "published_at": "2019-10-02"}