{"pub": "nytimes", "url": "https://nytimes.com/2019/10/17/us/politics/mick-mulvaney-trump-ukraine.html", "downloaded_at": "2019-10-18 01:04:00.084710+00:00", "title": "Mulvaney Says, Then Denies, That Trump Held Back Ukraine Aid as Quid Pro Quo", "language": "en", "text": "“Once again, the media has decided to misconstrue my comments to advance a biased and political witch hunt against President Trump,” Mr. Mulvaney wrote. “Let me be clear, there was absolutely no quid pro quo between Ukrainian military aid and any investigation into the 2016 election. The president never told me to withhold any money until the Ukrainians did anything related to the server.”\n\nBut in his earlier remarks to reporters, Mr. Mulvaney pointed to “three issues” that explained why officials withheld the aid: corruption in Ukraine, frustration that European governments were not providing more money to Ukraine and the president’s demand that Kiev officials investigate the issue of the Democratic National Committee server.\n\n“Did he also mention to me in passing the corruption related to the D.N.C. server?” Mr. Mulvaney said, referring to Mr. Trump. “Absolutely. No question about that.” He added, “That’s why we held up the money.”\n\nDemocrats ridiculed the reversal.\n\n“Mick Mulvaney was either lying then, or he’s lying now,” said Representative Ted Lieu, a California Democrat involved in the inquiry. “I think he’s lying now.”\n\nAt the White House, staff members recognized that Mr. Mulvaney had created an entirely new controversy with his remarks. Jay Sekulow, one of Mr. Trump’s personal lawyers, said Thursday, “The president’s legal counsel was not involved in acting chief of staff Mick Mulvaney’s press briefing.”\n\nMr. Mulvaney’s performance was only part of another extraordinary day in Mr. Trump’s presidency. Mr. Mulvaney made his remarks after he stepped before the cameras to announce that the leaders of the Group of 7 nations would meet in June at Mr. Trump’s golf resort in South Florida, even as he acknowledged the choice could be seen as self-enrichment. In Texas, Mr. Trump hailed a Middle East cease-fire that would cement Turkey’s goal of pushing Kurds from Northern Syria as “a great day for civilization.”\n\nAnd on Capitol Hill, Gordon D. Sondland, the president’s ambassador to the European Union and a wealthy donor to Mr. Trump’s campaign, was implicating the president in the Ukraine scandal by telling lawmakers that Mr. Trump had delegated Ukraine policy to his personal lawyer Rudolph W. Giuliani.", "description": "Conflicting comments by the acting White House chief of staff threw Washington into turmoil.", "authors": ["Michael D. Shear", "Katie Rogers"], "top_image": "https://static01.nyt.com/images/2019/10/17/us/politics/17dc-impeachbriefing-mulvaney/17dc-impeachbriefing-mulvaney-facebookJumbo-v2.jpg", "published_at": "2019-10-17"}