{"pub": "yahoo", "url": "https://news.yahoo.com/2011-missouri-murder-involving-disabled-163011656.html", "downloaded_at": "2019-10-04 17:08:07.112139+00:00", "title": "2011 Missouri murder involving disabled man to get new look", "language": "en", "text": "FILE - In this 2016 file booking photo, provided by the St. Charles County, Mo., Prosecuting Attorney's Office shows Pamela Hupp. The Major Case Squad of Greater St. Louis has agreed to reopen the investigation of the 2011 murder of Betsy Faria in Lincoln County, Mo. The decision comes two months after Faria's friend, Hupp, was sentenced to life in prison without parole for another murder. Faria's husband was initially convicted in her death but later acquitted in retrial. (St. Charles County, Missouri, Prosecuting Attorney's Office via AP, File)\n\nST. LOUIS (AP) — The 2011 murder of an eastern Missouri woman is getting new scrutiny.\n\nLincoln County Sheriff's Department Lt. Andy Binder on Friday confirmed an investigation by the Major Case Squad of Greater St. Louis in the death of Betsy Faria. It is the latest development in a string of events that have seen Faria's husband convicted in the killing, but later exonerated; and her friend, Pamela Hupp, who was sent to prison for life for killing a man in another county in 2016.\n\nFaria was stabbed 55 times in February 2011, soon after Hupp became beneficiary of Faria's $150,000 life insurance policy.\n\nRuss Faria was charged and initially convicted. The conviction was overturned and he was acquitted at retrial in 2015. He blamed Hupp, who denies killing Betsy Faria.\n\n___\n\nThis story has been corrected to show that Betsy Faria's death is getting new scrutiny.", "description": "The 2011 murder of a mentally disabled man in Missouri is getting new scrutiny.  Lincoln County Sheriff's Department Lt. Andy Binder on Friday confirmed an investigation by the Major Case Squad of Greater St. Louis.  Authorities believed Faria's murder was intended to divert attention from an", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-04"}