{"pub": "thehill", "url": "https://thehill.com/policy/healthcare/466476-ebola-outbreak-wanes-but-funding-lags", "downloaded_at": "2019-10-19 11:09:30.173378+00:00", "title": "Ebola outbreak wanes, but funding lags", "language": "en", "text": "The World Health Organization (WHO) and the Congolese health ministry said Friday that only 15 new cases of the Ebola virus had been identified in North Kivu and Ituri provinces in the last week.\n\nADVERTISEMENT\n\nThat marks the fourth straight week in which case counts have declined. As recently as April, the health ministry was reporting more than 100 new cases per week.\n\n“This outbreak remains a complex and dangerous outbreak. We need the full force of all partners to bring this outbreak under control and to meet the needs of the people affected. However, we should all be pleased with the very impressive progress we have made since the committee last met,” Tedros Adhanom Ghebreyesus, the director general of WHO, said at a press conference Friday in Geneva.\n\nSo far, the outbreak that started in August 2018 has infected at least 3,228 people and killed 2,158. It is the worst Ebola outbreak in Congo’s history, and the second-worst outbreak in modern times. The actual numbers are likely higher, as some families hide their sick and dead for fear of the stigma of being associated with the virus.\n\nOn Thursday, the health ministry reported only a single new case of the disease. Four infected people died, including one who was not being treated in a medical facility.\n\nThere are some troubling signs that the virus might be circulating out of view of public health officials. Only 13 percent of the new cases in recent weeks have occurred in people who have been in confirmed contact with someone who contracted the virus, meaning other chains of transmission likely exist in communities that are reluctant to seek help from medical authorities.\n\nBut several of the epicenters of the outbreak over the last year are seeing case counts slow dramatically. In the twin cities of Katwa and Butembo, home to nearly a thousand cases over the last year, no new cases have been reported for the last two weeks. In Beni, where the outbreak first took hold, only two new cases were identified this week.\n\n“We must remain cautious. There might be setbacks. For me, this outbreak is like a marathon, and the last mile is always the most difficult,” said Robert Steffen, an epidemiologist at the University of Zurich who heads the WHO’s emergency committee monitoring the Congolese outbreak.\n\nBut public health officials have warned that those scrambling to stop the outbreak are running low on money. The WHO has said it and partner groups need $394 million to continue running the response at a sufficient level through December, but that just $126 million has been received.\n\nThe WHO has asked wealthy nations to contribute $66 million for neighboring countries to prepare to fight the virus if it jumps international borders. Of that, only $4.5 million has been funded.\n\n“There’s a massive gap between the rhetoric and the reality,” said Mike Ryan, executive director of the WHO’s Health Emergencies Program. “Our biggest problem right now is not the pledging of money, it is the disbursements of those funds into the field.”\n\n“The funding is still not adequate,” Ryan said. “Funding being pledged is not a guarantee of funding arriving in time to make a difference in the epidemic.”\n\nTedros said the preparedness funding concerns him. The Ebola virus has already jumped into Uganda at least once, and teams in Burundi, South Sudan and Rwanda are preparing for the possibility that the virus crosses into their countries too.\n\n“The world responds when there is panic. And I think in the current situation, people don’t see the urgency,” Tedros said. “We’re not ready as a global community, we’re not ready to invest in preparedness, to fix the roof before the rain comes.”\n\nIn a significant step, the European Medicines Agency (EMA), the European Union’s equivalent to the U.S. Food and Drug Administration, said Friday it would recommend that an Ebola vaccine in use in Congo be authorized for commercial sale.\n\nThe European Commission must still authorize the drug, but the EMA’s decision means the world is one step closer to having an approved Ebola vaccine. Ryan said that once a vaccine is licensed, it will become easier for at-risk countries to stockpile supplies to prepare for future outbreaks.", "description": "Global health officials are cautiously optimistic that an outbreak of the deadly Ebola virus in Congo is slowly coming under control after more than a year spent battling one of the most complex epidemics in modern history.", "authors": [], "top_image": "https://thehill.com/sites/default/files/congoebola_100919getty.jpg", "published_at": "2019-10-18"}