{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-stocks/ftse-unable-to-shake-off-growth-fears-sig-drags-on-mid-caps-idUKKBN1WM0IF", "downloaded_at": "2019-10-07 09:13:15.613290+00:00", "title": "FTSE unable to shake off growth fears; SIG drags on mid-caps", "language": "en", "text": "(Reuters) - London’s FTSE 100 fell further on Monday, with markets unable to dispel broader growth fears that had dragged the index to its worst week in nearly a year, while SIG slumped to a near three-year low after a profit warning and dragged the mid-caps lower.\n\nTraders look at financial information on computer screens on the IG Index trading floor in London, Britain February 6, 2018. REUTERS/Simon Dawson/Files\n\nThe main index .FTSE, which shed more than 3.6% last week on fears of a global economic slowdown in the face of a long U.S.-China trade dispute and the risk of a recession, drifted in and out of the red before settling 0.2% lower by 0800 GMT.\n\nThe FTSE 250 .FTMC lagged the European benchmark index and fell 0.5%, with building materials supplier SIG (SHI.L) tanking 23% after saying weaker construction activity in the UK would hit annual profit in its core units.\n\nSIG’s warning hit shares of fellow suppliers. Kingfisher (KGF.L), Travis Perkins (TPK.L) and Howden Joinery (HWDN.L) shed between 2.1%-3.7%.\n\nBlue-chip financial stocks .FTNMX8350 were down the most, with Asia-focussed HSBC (HSBA.L) more than 1% lower. Separately, the Financial Times reported that the bank was planning to cut up to 10,000 jobs to reduce costs.\n\nMost blue-chip exporter stocks were unable to capitalize on a drop in the value of the pound, as weakness in the currency was outweighed by broader uncertainty.\n\nLondon-listed shares of Carnival (CCL.L) fell 2.7% to the bottom of the FTSE 100 after HSBC cut its rating and price target on the cruise operator’s stock.\n\nAny hopes that the blue-chip index could muster a comeback after last week’s sell-off were dashed despite an upbeat U.S. jobs report on Friday, with most market participants pinning hopes of an upturn on this week’s Sino-U.S. trade talks.\n\n“Broadly speaking, the trade talks will drown out the data prints this week on all but a very short-term basis,” said Jeffrey Halley, senior market analyst, Asia Pacific at Oanda.\n\n“Soothing noises from either side that the talks have progressed well should be enough to jumpstart markets around the world, even if only temporarily.”\n\nInvestors will also look intently at the latest minutes from the U.S. Federal Reserve amid hopes that the central bank will cut interest rates for the third time this year.\n\n“An official no progress or breakdown (in trade talks) will have a magnified adverse effect... the odds of a Fed cut at the end of the month will become a 100% done-deal,” Halley said.", "description": "London's FTSE 100 fell further on Monday, with markets unable to dispel broader growth fears that had dragged the index to its worst week in nearly a year, while SIG slumped to a near three-year low after a profit warning and dragged the mid-caps lower.", "authors": ["Shashwat Awasthi", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191007&t=2&i=1437973786&w=1200&r=LYNXMPEF960AF", "published_at": "2019-10-07"}