{"pub": "yahoo", "url": "https://yahoo.com/entertainment/hustlers-director-praises-cardi-b-202045680.html", "downloaded_at": "2019-09-17 08:28:02.245283+00:00", "title": "Hustlers director praises Cardi B, Lizzo's 'gifted' acting skills", "language": "en", "text": "It wasn’t difficult for writer-director Lorene Scafaria to get into the groove of transforming her hit stripper drama Hustlers from page to screen — especially when she had the natural rhythm of musicians like Jennifer Lopez, Cardi B, Lizzo, and Keke Palmer amping her up.\n\n“She has a natural ability, that timing and rhythm, kind of like Lizzo, Jennifer, and Keke — they all are gifted,” Scafaria, 41, previously told EW of bringing rap superstar Cardi B — a real-life ex-stripper who taught her costars a thing or two about the craft — into her already eclectic cast for the film, which follows a band of exotic dancers (led by Constance Wu’s Destiny and Lopez’s ringleader, Ramona) as they scam unfathomable sums of cash out of their bougie Wall Street patrons.\n\nScafaria credited “musicians, performers, dancers, and singers” as being “great actors” because of their rhythmic intuition, singling out Cardi, 26, and “Truth Hurts” hitmaker Lizzo, 31, for their improvisational skills on set.\n\n“I certainly let her improvise as much as she wanted to. I gave her a script and she delivered scripted lines, but if she wanted to make something her own, she could. There were moments I’d just have her yell at someone, there were moments where it’s a locker room scene with 15 women and they’re all playing characters, and Cardi is [right there with] them,” Scafaria observed of Cardi, who plays a foul-mouthed stripper named Diamond, a character the artist based on a real woman she knew from her days working in the New York City sex industry. “She’s an incredibly gifted and talented person who came from a lot. What she’s made of herself is an inspiration, and I am so grateful that she was in this film [and] read the script and felt it was an authentic enough to be a part of it.”\n\nThough Scafaria helmed the film, she admitted Lopez had “more to do” with courting Cardi for the project than she did, and that it created an electric dynamic of diverse energy during production.\n\n“Having that group of different women from different kinds of entertainment was incredible to see them coexist in a scene together,” Scafaria said. ‘To their credit, people like Cardi and Lizzo not just improvised, but read scripted lines and played characters. Cardi based Diamond on someone she used to know. To everybody’s credit, they were just actors in the same film.”\n\nHustlers — which notched the highest live-action opening of Lopez’s career with $33.2 million — is now playing in theaters nationwide. For more on the movie, read EW’s exclusive digital cover story featuring Wu and Lopez here.\n\nRelated content:", "description": "Hustlers director on Cardi B, Lizzo acting roles", "authors": ["Joey Nolfi"], "top_image": "https://s.yimg.com/uu/api/res/1.2/LUAvv8ohF3obsMU3gnajRw--~B/aD02MzA7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/entertainment_weekly_785/80c45d1ebf1da0ca81e2050d68b0e5ec", "published_at": "2019-09-16"}