{"pub": "businessinsider", "url": "https://businesstimes.com.sg/companies-markets/sgx-to-launch-price-collars-for-opening-midday-and-closing-auctions", "downloaded_at": "2019-09-26 16:48:47.726036+00:00", "title": "SGX to launch price collars for opening, midday and closing auctions", "language": "en", "text": "FOLLOWING a public consultation, the Singapore Exchange (SGX) plans to introduce price collars during the securities market opening, midday and closing auction routines so as to guard against the risk of severe price dislocations during auctions, it said on Thursday.\n\nThe price collars, or bands, comprise: plus/minus 30 per cent of the reference price during the opening auction; plus/minus 10 per cent of the reference price during midday break and plus/minus 10 per cent of the reference price during closing auction.\n\nThe reference price for the opening auction is the last traded price as at the end of the previous market day, while that of the midday break and closing auction is the last traded price earlier in the same market day.\n\nThe price collars will apply to all components of the Straits Times and MSCI Singapore Indexes, said SGX. In addition, they will also be effective on stocks, and units of stapled securities, Reits and business trusts, funds, as well as exchange-traded funds with a price of at least S$0.50.\n\nsentifi.com Market voices on:\n\nTwelve parties - including associations representing groups of market participants - responded to the public consultation. Most respondents preferred price collars as they are more comprehensible than time extensions, easier to implement and more cost-effective, added SGX.", "description": ": THE BUSINESS TIMES Companies & Markets - FOLLOWING a public consultation, the Singapore Exchange (SGX) plans to introduce price collars during the securities market opening, midday and closing auction routines so as to guard against the risk of severe price dislocations during auctions, it said on Thursday. . Read more at The Business Times.", "authors": ["Nisha Ramchandani"], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-09-26"}