{"pub": "yahoo", "url": "https://finance.yahoo.com/news/support-will-grow-for-impeachment-if-the-american-people-get-the-evidence-tom-steyer-133653998.html", "downloaded_at": "2019-09-27 15:10:37.554403+00:00", "title": "Voters are 'going to agree with me' on impeachment: Tom Steyer", "language": "en", "text": "Tom Steyer, the hedge fund manager turned Democratic activist now running for president, founded a group (and spent millions of dollars) to advocate removal of President Trump from office.\n\nThe biggest challenge, according to Steyer, is changing public perception.\n\n“I believe that if the American people get the evidence, they're going to agree with me,” he told Rick Newman during a conversation as part of Yahoo Finance’s Meet the Candidate series.\n\nThe 62-year-old self-made billionaire is now in the race to replace Trump. Steyer has long been one of the most visible and deep-pocketed supporters of impeachment. He has also qualified for next month’s Democratic debates.\n\nHe added that his group, Need to Impeach, has seen evidence of this in their work. “When they see it, whether they're a Trump supporter or Trump opposer, they all say the same thing -- I didn't know it. He's a liar and a crook. If I did that, I'd be in jail,” he said. “They all say those three things.”\n\nA recent poll found that, as of last week, a majority of Americans remain opposed to impeachment: 37% say Trump should be removed from office, while 57% oppose the move.\n\nDemocratic presidential candidate and businessman Tom Steyer walks down the grand concourse during a visit to the Iowa State Fair, Sunday, Aug. 11, 2019, in Des Moines, Iowa. (AP Photo/Charlie Neibergall) More\n\nThe poll, by Quinnipiac University, was conducted from Sept. 19 to 23 before the dramatic revelations from a whistleblower and from the a summary of a call released by the White House.\n\n‘That’s their funeral’\n\nIt will be several days before new polling gives a sense of how much House Speaker Nancy Pelosi’s announcement of an impeachment inquiry has shifted public opinion. One tracking poll released Thursday found growing voter support for impeachment.\n\nThe impeachment process is designed, in part, to educate the public about the charges facing the president. Currently, six House committees will continue their ongoing investigations into the to formulate the articles of impeachment. Then, it would lead to the House floor for a debate.\n\nIf the House impeaches Trump, the next step would be a trial in the Senate. Such a trial would be a made for television spectacle that would surely test Steyer’s hypothesis that the more the American people know about Trump’s misdeeds, the more likely they are to support removing him from office.\n\nThe outcome of a trial isn’t the most important thing for Steyer (and in fact, the president would likely be acquitted if his Republican colleagues support him). “People think that the court is going to be the Republican Senators and I disagree” he says.\n\n“If the American people decide, this guy has to go and the Republican senators vote to keep him – that's their funeral.”\n\nBen Werschkul is a producer for Yahoo Finance in Washington, DC.\n\nRead more:\n\nThe leading Democrats have minimal business backgrounds. Maybe that's a good thing.\n\nHow the 2020 Democrats would fix Social Security\n\nBernie Sanders and Elizabeth Warren aren't the only candidates with plans for student loans\n\nRead the latest financial and business news from Yahoo Finance\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, LinkedIn, YouTube, and reddit.", "description": "He has been pushing for impeachment for over 2 years. The challenge, according to billionaire Tom Steyer, is changing public perception.", "authors": ["Ben Werschkul", "Dc Producer"], "top_image": "https://s.yimg.com/uu/api/res/1.2/NUKHFUA1DKyu0yRrmCN5gg--~B/aD0yMzMzO3c9MzUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/54783420-e09a-11e9-9efb-cbf31187155d", "published_at": "2019-09-27"}