{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/oct/17/trump-autocrat-congress-judiciary-democracy", "downloaded_at": "2019-10-17 10:32:12.093600+00:00", "title": "Trump is using the autocrat's playbook. Democratic institutions must step up", "language": "en", "text": "Democracy in the United States is under threat as a president who behaves like an autocrat intensifies his assaults on the country’s democratic institutions.\n\nTrump has long exhibited the characteristics of an autocrat. Dictators exist in a perpetual state of paranoia that their hold on power is in danger, and they respond by attacking institutions not under their control. As Congress and the courts attempt to hold Trump to account, he will lash out and could inflict even more severe damage to American democracy.\n\nAutocrats throughout history have attacked perceived “enemies” and attempted to create scapegoats for society’s problems. Hungary’s autocratic prime minister, Viktor Orbán, has smeared the Jewish philanthropist George Soros to discredit Soros’s work to support democracy in his native country and to justify more illiberal policies to “save Hungary” from efforts by Soros and others to promote immigration. Trump attempts to blame just about everyone – from immigrants to Democratic politicians to the media – for his and the country’s problems. Trump even adopted a phrase Stalin used to describe opponents – “enemies of the people” – to attack the media.\n\nAutocrats use the state to advance personal interests. For dictators, the interests of the state are synonymous with the interests of the leader, and so they use the power of government to protect themselves at the expense of the people. They steal money, jail political opponents, rig elections, punish dissent, and co-opt the media for propaganda.\n\nTo keep power, autocratic leaders need to attack institutions, and the ways they respond help determine the fates of democracies\n\nTrump has been using his official power to advance his own personal interests. Trump promotes his private businesses and directs taxpayer dollars to himself as administration officials – such as the vice-president, Mike Pence – stay at Trump properties. Foreign governments and entities stay at these Trump hotels, lining Trump’s pockets and attempting to curry favor. Trump attempted to obstruct justice by smearing and trying to stop Robert Mueller’s investigation into Russian collusion with the Trump campaign in the 2016 election. And Trump attempted to extort Ukraine – withholding congressionally authorized military assistance – to get Ukraine to smear Trump’s domestic political opponent. Trump has accused Congress of attempting a “coup” for exercising its constitutional obligation to pursue an impeachment inquiry. For Trump, anyone who opposes him is America’s enemy because he thinks of himself as synonymous with the state.\n\nAutocrats use force against their own people. While it’s virtually impossible to imagine the US military abiding by orders from Trump to turn on Americans, Trump has already used the military as a dangerous political prop aimed against other people when he sent thousands of troops unnecessarily to the border to deal with immigration. Trump has incited violence numerous times, which arguably resulted in a Trump fan sending bombs to politicians and at least one person committing mass murder because of conspiracy theories that Trump regularly promotes. Trump even suggested that his impeachment could lead to “civil war”.\n\nDespite serious challenges, the US is a vibrant democracy. Democratic institutions – from the agencies of the executive branch to the courts, Congress to civil society to the press – have protected America from the kind of damage autocrats elsewhere have inflicted on their people.\n\nDonald Trump: xenophobe in public, international mobster in private | Robert Reich Read more\n\nBut in order to keep power, autocratic leaders need to attack institutions, and the ways that the institutions respond help determine the fates of democracies. The intelligence community whistleblower who exposed Trump’s wrongdoing over Ukraine and the corroborating testimony of the career foreign service officer Marie Yovanovitch, the former ambassador to Ukraine, illustrates exactly the way the democratic institutions are supposed to operate.\n\nTrump calls officials that work in the agencies of the executive branch the “deep state”, implying that they are unelected bureaucrats attempting to thwart the will of the people (represented, of course, by Trump). But these officials are public servants and patriots. And for those who think they all answer to the president, remember that these officials work for the American people and swear an oath to uphold the constitution – not to follow the president. Furthermore, Congress authorized and annually appropriates money for their agencies, endowing all officials with direct support from America’s congressional representatives.\n\nThis battle between Trump and America’s democratic institutions is playing out in other areas as well. Trump has attempted to hide his personal finances from the public and benefit from private business while in office, both of which have been challenged in the courts. The press is doing yeoman’s work in exposing Trump’s wrongdoing even as Trump continues to attack them. Civil society activists are on the streets every day advocating for the rights of Americans while Trump tries to restrict the rights of people to vote.\n\nThe longer an autocrat stays in power, the more the institutions are endangered as the leader attempts to reshape institutions to further his goals. In Hungary, Orbán and his allies have eroded the country’s formerly democratic institutions by altering the makeup of the courts and changing the constitution, among many other moves. In Turkey, Recep Tayyip Erdoğan has undermined his country’s institutions, jailing his opponents, muzzling the press, stacking the judiciary, and changing the constitution to eliminate any checks on his power.\n\nIn America today, Trump and his allies are remaking the judiciary by halting the confirmation of judges until conservatives are in power, and then changing the rules to push through ideological judges – Trump has already appointed more than 10% of the federal judiciary and more than 20% of appellate court judges. The more partisan Trump judges, the more courts there will be likely to rule in favor of Trump’s power grabs.\n\nAmerican democracy is only as strong as its institutions, and today we need America’s democratic institutions to step up.", "description": "The president uses state power for his own interests and seeking scapegoats for society’s problems. Can our democracy keep him in check?", "authors": ["Michael H Fuchs"], "top_image": "https://i.guim.co.uk/img/media/d77d1acd336a30c4c45065d2023138e4230cc7e8/108_0_3284_1971/master/3284.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=8fcb6415acb83026e5eacab1be26ffa0", "published_at": "2019-10-17"}