{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/29/georgia-back-on-track-with-win-uruguay-back-to-ear", "downloaded_at": "2019-09-29 07:54:14.771948+00:00", "title": "Georgia back on track with win; Uruguay back to earth", "language": "en", "text": "KUMAGAYA, Japan (AP) - Jaba Bregvadze gave Georgian and Japanese fans a bonus cheer when he scored a try and set up another with a chip kick to lead his lineup to a 33-7 victory over Uruguay in a Rugby World Cup Pool D game on Sunday.\n\nUruguay was coming off an upset win over Fiji on Wednesday and didn’t have the energy to match the physical Georgian lineup, which was overhauled after an opening loss to Wales.\n\nThe 32-year-old Bregvadze, who plays for the Japan-based Sunwolves in Super Rugby and was leading his national team for the first time, secured a bonus point with Georgia’s fourth try when he dived across from a rolling maul in the 52nd minute.\n\nGeorgia had nothing going on in attack six minutes later when the veteran hooker, standing one out from a ruck, decided to chip ahead and then pinned Uruguayan Rodrigo Silva on the tryline, allowing center Giorgi Kveseladze the easiest of tries.\n\nFrom 12-7 up at halftime, Georgia added three tries and led 33-7 before the hour mark.\n\nThe Georgians will have to regroup quickly for a crucial game against Fiji on Thursday, while Uruguay gets an extra two days off before taking on two-time champion Australia.\n\nUruguay finished a man down after replacement prop Facundo Gattas was red-carded for a high tackle with two minutes to go.\n\nGeorgia scored tries through left winger Alexander Todua and No. 8 Otari Giorgadze in the first half hour and appeared to be on the verge of taking control of the game before Uruguay rallied with a try against the run of play in the 33rd.\n\nTodua scored out wide in the ninth after two cut-out passes and, after a short water break in the 20th because of the humidity at Kumagaya, the Georgians finally converted their scrum dominance into points in the 30th after declining to take several shots at goal from easy kicking range.\n\nGiorgadze picked up from the base of a five-yard scrum just before it wheeled too far, and crashed over the top of a defender to score near the posts. Tedo Abzhandadze converted to make it 12-0.\n\nUruguay then took advantage of a lapse in the lineout defense from the Georgians, allowing center Andres Vilaseca to cross after a getting an inside ball from a strong running Rodrigo Silva.\n\nFelipe Berchesi converted and had a chance to close the gap further but missed a penalty attempt late in the half and Georgia led 12-7 at the break.\n\nFurther underscoring Georgia’s advantage in the pack, prop Levan Chilachava barged over three minutes after halftime to complete a simple move down the short side.\n\nBregvadze also scored from close range, then livened up the crowd with his chip kick that resulted in points, but may not get the blessing of his coach.\n\n___\n\nMore AP Rugby World Cup: https://www.apnews.com/RugbyWorldCup and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Jaba Bregvadze gave Georgian and Japanese fans a bonus cheer when he scored a try and set up another with a chip kick to lead his lineup to a 33-7 victory over Uruguay in a Rugby World Cup Pool D game on Sunday.", "authors": ["The Washington Times Http"], "top_image": "", "published_at": "2019-09-29"}