{"pub": "fox", "url": "https://foxbusiness.com/markets/former-uaw-president-dennis-williams-cabin-black-lake", "downloaded_at": "2019-10-09 19:02:48.549174+00:00", "title": "Lakefront cabin for former UAW president part of federal investigation: report", "language": "en", "text": "A high-end lakefront cabin built for former United Auto Workers president Dennis Williams is part of a federal corruption investigation into the union, according to three sources cited by The Detroit News.\n\nContinue Reading Below\n\nFederal agents are trying to ascertain whether Detroit auto companies indirectly financed Williams' home at the UAW's Michigan resort. Even though the home is not owned by Williams, investigators want to know whether paying for the upkeep of the retreat center is a way to illegally steer money for Williams' benefit, according to The Detroit News.\n\n\"Importantly, the new cabin is, and always will be, the property of the UAW, and is not owned by Dennis Williams,\" UAW spokesman Brian Rothenberg wrote in an email to The Detroit News. \"It is a permanent asset of the UAW's Black Lake Education Center.\"\n\nOther retired UAW presidents have been provided with homes at Black Lake.\n\n\"Black Lake is a 50-year old facility that welcomes tens of thousands of UAW members and the public each year,\" Rothenberg wrote in an email to The News. \"There were renovations to those facilities during President Williams' term of office done by UAW Black Lake employees who belong to the United Steelworkers union.\"\n\nTicker Security Last Change Change % GM GENERAL MOTORS COMPANY 34.09 +0.21 +0.61% F FORD MOTOR COMPANY 8.59 +0.04 +0.53% FCAU FIAT CHRYSLER AUTOMOBILES N.V. 12.43 +0.16 +1.30%\n\nThe feds want to know whether money from any of the Detroit Three — General Motors, Ford and Fiat Chrysler — ended up padding the retreat center's budget with or without auto executives' knowledge, according to The Detroit News.\n\nA team from the FBI, Internal Revenue Service and Labor Department raided the retreat on Aug. 28, the same day they raided the home of Gary Jones, the current UAW president.\n\nInvestigators have targeted a contractor who worked at the retreat with a grand jury subpoena, according to sources cited by The Detroit News.\n\nThe Williams home's design plan included granite counters, stainless-steel appliances, a wood-burning fireplace and hidden room concealed behind a bookcase, according to blueprints obtained by The Detroit News. The UAW finished construction on the home last fall.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nThe corruption scandal comes as the 23-day strike by UAW members at GM has stalled production of 165,000 cars and trucks, passing the point at which the manufacturer could make up for lost volume, according to industry analysts.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE", "description": "Even though the home is not owned by Williams, investigators want to know whether paying for the upkeep of the retreat center is a way to illegally steer money.", "authors": ["Evie Fordham"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/Dennis-Williams-Getty.jpg?ve=1&tl=1", "published_at": "2019-10-09"}