{"pub": "reuters", "url": "https://reuters.com/article/us-nissan-ceo/renault-chairman-auditions-narrowed-field-of-nissan-ceo-candidates-idUSKBN1WH1NC", "downloaded_at": "2019-10-02 15:45:44.118064+00:00", "published_at": "2019-10-02", "title": "Renault chairman auditions narrowed field of Nissan CEO candidates", "language": "en", "text": "(Reuters) - The Nissan Motor Co (7201.T) CEO race has narrowed to a contest between three Renault-Nissan veterans, with Renault’s chairman conducting interviews ahead of a Renault-Nissan alliance meeting scheduled for Wednesday, people familiar with the matter said.\n\nFILE PHOTO: The logos of car manufacturers Renault and Nissan are seen in front of dealerships of the companies in Reims, France, July 9, 2019. REUTERS/Christian Hartmann/File Photo\n\nRenault (RENA.PA) chairman Jean-Dominique Senard spoke on Tuesday with the candidates in person in Paris or via TV conference ahead of Wednesday’s meeting, the people said.\n\nSenard sits on the Nissan board’s nominating committee, a post he received in June after a battle with Nissan executives.\n\nTwo of the candidates are Japanese company veterans - Nissan’s acting CEO Yasuhiro Yamauchi and former Nissan China chief Jun Seki. They are seen as the frontrunners, the sources said. But Nissan’s board and Renault have kept up dialogue with Indian-born Ashwani Gupta, and a possible external candidate.\n\nGupta, 49, joined Renault in 2006 in India as a purchasing manager, and was sent this year to Nissan’s alliance partner Mitsubishi Motors Corp (7211.T) as chief operating officer.\n\nGupta was interviewed by Senard on Tuesday via TV conference, the sources said.\n\nThe support of Renault, which has a 43.4% stake in Nissan, will be critical in winning the race, as will support from Japan’s trade ministry, which has intervened in Nissan’s affairs, sensitive to Renault’s upper hand in the alliance.\n\nA Renault spokesman declined to comment.\n\nOne issue Senard raised, according to the sources, was Nissan’s ability and willingness to defend its dividend payout, which was cut for the fiscal year ended March 31 following a 45% decline in Nissan’s operating profit. That dividend cut wiped 130 million euros ($146 million) off Renault’s 2019 earnings.\n\nNissan is forecasting earnings to continue to slip this fiscal year.\n\nYamauchi came out of his meeting in Paris with Senard smiling, according to one of the sources. Seki, meanwhile, also met Senard in Paris and told his colleagues he “had a blast” with the Frenchman, according to a message viewed by Reuters.\n\nTOUGH CHOICES\n\nRelations between Renault and Nissan have been strained since the 2018 arrest in Japan of the alliance’s architect, Carlos Ghosn, on charges of financial misconduct, which he denies. Nissan executives have pushed for a restructuring of the alliance and more independence from Renault.\n\nThe tensions contributed earlier this year to the collapse of a proposed merger between Renault and Fiat Chrysler Automobiles NV (FCHA.MI).\n\n“We want (Nissan’s) board to pick a leader that can restore Nissan’s business and free us from all the politics we’ve been forced to cope with,” one of the sources told Reuters.\n\nThe selection process highlights an internal debate over Nissan’s strategy. Ghosn sought to combine tight cost control with ambitious expansion goals. But Nissan’s profits have plunged to a ten-year low, undercut by low-margin sales to rental fleets aimed at propping up market share.\n\nNissan’s next CEO faces a restructuring task, and tough choices about where to focus investment as China and Europe demand more electric vehicles.\n\nNissan’s board of directors has narrowed a list of candidates in part by using a business school style-CEO aptitude test to measure candidates’ leadership quality, sources said.\n\nFILE PHOTO: Renault Chairman Jean-Dominique Senard arrives to a Renault, Nissan and Mitsubishi chiefs' joint news conference in Yokohama, Japan, March 12, 2019. REUTERS/Kim Kyung-Hoon\n\nYamauchi, the acting CEO, was groomed as a cost manager and climbed the ranks under Ghosn. He is favored by older top managers, people familiar with internal discussions said.\n\nSeki is backed by younger leaders and is especially popular among rank and file employees who see him as more likely to chart a new course for Nissan.\n\nSeki has been leading the company’s recovery team which is looking at a deeper restructuring of the business that would shutter plants in some markets and exit certain global markets and vehicle segments.", "description": "The Nissan Motor Co <7201.T> CEO race has narrowed to a contest between three Renault-Nissan veterans, with Renault's chairman conducting interviews ahead of a Renault-Nissan alliance meeting scheduled for Wednesday, people familiar with the matter said.", "authors": ["Norihiko Shirouzu", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191002&t=2&i=1436274039&w=1200&r=LYNXMPEF9115G"}