{"pub": "townhall", "url": "https://townhall.com/tipsheet/guybenson/2019/10/25/here-we-go-were-about-to-know-a-lot-more-about-the-origins-of-the-trumprussia-probe-n2555355", "downloaded_at": "2019-10-25 22:05:38.391993+00:00", "title": "Revealed: Forthcoming IG Report Will Help Explain Why Durham Review Into Russia Investigation Origins is Now a Criminal Probe", "language": "en", "text": "Let's start with the backdrop to all of this. A counter-intelligence probe into the Trump campaign's potential coordination with the Russian government's 2016 electoral meddling eventually morphed into the Mueller probe, following the firing of then-FBI Director James Comey. It ultimately found no collusion, despite years of wild speculation and hype. How, precisely, did that original investigation get started? And were there abuses by the Obama-era Justice Department and other governmental entities accused of partisan bias, relying on dodgy (Democrat-funded and possibly Russian-planted) rumors, and concealing key facts from judges signing off on surveillance warrants? That's the first element.\n\nThe second element is the Left's irate loathing of Attorney General Bill Barr, which can be traced back to his use of the word \"spying\" in discussing the aforementioned surveillance on American citizens connected to the Trump campaign, as well as his appropriate handling of the public dissemination of the Mueller report, which triggered cartoonish bouts of irrational derangement. That hatred, coupled with consternation about whatever is being discovered by respected US Attorney John Durham in an ongoing review approved and supported by Barr, explains the unsubtle efforts to paint the current 'investigation of the investigation' as a political hit job meant to provide cover for President Trump. There have also been efforts to undermine the credibility of a related probe from DOJ Inspector General Michael Horowitz, focusing on possible FISA abuses and a handful of other elements, which is confirmed to be forthcoming:\n\nBREAKING: DOJ IG Horowitz sends letter to Congressional leaders. Says report is going through declassification (\"nearing completion\"), is lengthy, and he anticipates few redactions. Doesn't foresee \"a need to prepare and issue separate classified and public versions.\" — Shannon Bream (@ShannonBream) October 24, 2019\n\n\n\nFirst we learned that the IG report is about to drop. Then we learned, as reported last night, that Durham's review has become a criminal investigation:\n\nA probe by Attorney General William Barr into the origins of the Russia investigation has changed from an administrative review into a criminal investigation, a person familiar with the review confirmed to NBC News. The review is being conducted by Connecticut U.S. Attorney John Durham. The New York Times first reported Thursday that the administrative review has turned into a criminal investigation. It’s not clear when the change occurred, but the probe began in May as an administrative review. The Times reported that the change in status gives Durham the power to subpoena witness testimony and documents, to impanel a grand jury and to file criminal charges.\n\nAnd finally, we learned this tantalizing fact:\n\nJuicy little morsel in Fox News report on the Durham probe becoming a criminal investigation. The forthcoming IG report will shed light on the reason for the change in status. https://t.co/u7BdQ3E15m pic.twitter.com/AQ8QtKcu44 — Chuck Ross (@ChuckRossDC) October 25, 2019\n\nTwo sources now confirm this to @FoxNews - one telling our @edhenry - \"the long-awaited Justice Dept IG report will shed light on why the John Durham-led investigation is now officially a criminal probe\" — Shannon Bream (@ShannonBream) October 25, 2019\n\n\n\nSo Durham's shift from administrative review to criminal inquiry will be at least partially explained by the contents of Horowitz's report. Intriguing. Both investigations are important and justified. Let's have the truth. If there were abuses over the course of the Russia probe -- at its onset or beyond -- those responsible should be held accountable. And any effort to paint all of this as pro-Trump hackery from Barr, the foundation for which has already been laid in the press, will run into the stubborn problem of the sterling nonpartisan reputations of the two men spearheading these parallel reviews.\n\nWe know that some intelligence community figures are lawyering up. We know that Horowitz has been very tough on James Comey and Andrew McCabe. And we know that Durham's probe has expanded in scope, in addition to becoming criminal in nature. It seems as though we are going to learn a lot more about what happened over the coming days and months.", "description": "Here We Go..10/25/2019 18:03:11PM EST.", "authors": ["Guy Benson", "Matt Vespa", "Cortney O'Brien", "Timothy Meads"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/169/55c89da8-dc28-4873-ab9a-d4c08095341e.jpg", "published_at": "2019-10-25"}