{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/trump-border-wall-us-mexico-mike-pompeo-white-house-moat-kirstjen-nielsen-a9128991.html", "downloaded_at": "2019-10-02 12:50:49.172485+00:00", "published_at": "2019-10-02", "title": "Trump shouted 'you're making me look like an idiot' at White House staff, report claims", "language": "en", "text": "Donald Trump reportedly told aides and cabinet ministers they were making him look like an “idiot” in an expletive-laden rant over his failure to clamp down on the nation’s southern border.\n\nIn a March Oval Office meeting in which he called for entry to the US from Mexico to be completely shut down, the president is said to have berated officials including secretary of state Mike Pompeo, aide Stephen Miller and former homeland security secretary Kirstjen Nielsen.\n\n“You are making me look like an idiot,” he said, according to an excerpt of a new book featured in The New York Times, which said the statement also included an expletive.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nBorder Wars: Inside Trump’s Assault on Immigration by Julie Hirschfeld Davis and Michael D Shear, also claims that Mr Trump considered a range of increasingly bizarre border policies – including fortifying the wall with a moat filled with snakes or alligators.\n\nThe week ended with the firing of Ms Nielsen after the 45th President said he wanted a cement wall on the Mexican border, despite contracts having already been secured for a steel barrier.\n\nShape Created with Sketch. Everyone Trump has fired or forced out Show all 13 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Everyone Trump has fired or forced out 1/13 John Bolton Trump claimed to have fired Bolton, his national security adviser, while Bolton claimed he offered to resign. An anonymous White House source that Bolton's departure came as a result of the national security adviser working too independently of the president AFP/Getty 2/13 Anthony Scaramucci Scaramucci lasted only six days in his role as Trump's communications director before being fired by John Kelly, the incoming chief of staff Getty 3/13 Jeff Sessions Attorney General Sessions was asked to resign after nearly two years of drawing Trump's ire, most notably with regards to the Mueller Probe Getty 4/13 Rex Tillerson Tillerson, Trump's first secretary of state, was fired after a series of clashes with the president over policy Getty 5/13 James Mattis Mattis served as secretary of defense from the beginning of Trump's administration until retiring on 1 January 2019. However, the president later claimed that he had \"essentially fired\" Mattis Getty 6/13 James Comey Comey was fired as director of the FBI early in Trump's presidency after serving in the role for four years prior. His dismissal is widely thought to have been related to the Russia investigation Getty 7/13 Reince Priebus Priebus, Trump's first chief of staff, was forced out after six tumultuous months AFP/Getty 8/13 David Shulkin Veterans affairs secretary Shulkin claims that he was fired, the White House claims that he resigned Getty 9/13 John Kelly Kelly, Trump's second chief of staff, was forced out after 17 months in office. His departure was a confused affair though it is clear that Trump wanted Kelly out AFP/Getty 10/13 Michael Flynn Flynn lasted 24 days as Trump's national security adviser before being fired for lying to the FBI Getty 11/13 Lee Cisna Cisna served as director of citizen and immigration services between October 2017 and June 2019 before being asked to resign amid a major personnel change in the department of homeland security 12/13 Madeline Westerhout Westerhout served as Trump's personal assistant after leaking private information about his family AFP/Getty 13/13 Mira Ricardel Ricardel was forced out of her role as Deputy National Security Advisor after first lady Melania Trump publicly called for her to be fired 1/13 John Bolton Trump claimed to have fired Bolton, his national security adviser, while Bolton claimed he offered to resign. An anonymous White House source that Bolton's departure came as a result of the national security adviser working too independently of the president AFP/Getty 2/13 Anthony Scaramucci Scaramucci lasted only six days in his role as Trump's communications director before being fired by John Kelly, the incoming chief of staff Getty 3/13 Jeff Sessions Attorney General Sessions was asked to resign after nearly two years of drawing Trump's ire, most notably with regards to the Mueller Probe Getty 4/13 Rex Tillerson Tillerson, Trump's first secretary of state, was fired after a series of clashes with the president over policy Getty 5/13 James Mattis Mattis served as secretary of defense from the beginning of Trump's administration until retiring on 1 January 2019. However, the president later claimed that he had \"essentially fired\" Mattis Getty 6/13 James Comey Comey was fired as director of the FBI early in Trump's presidency after serving in the role for four years prior. His dismissal is widely thought to have been related to the Russia investigation Getty 7/13 Reince Priebus Priebus, Trump's first chief of staff, was forced out after six tumultuous months AFP/Getty 8/13 David Shulkin Veterans affairs secretary Shulkin claims that he was fired, the White House claims that he resigned Getty 9/13 John Kelly Kelly, Trump's second chief of staff, was forced out after 17 months in office. His departure was a confused affair though it is clear that Trump wanted Kelly out AFP/Getty 10/13 Michael Flynn Flynn lasted 24 days as Trump's national security adviser before being fired for lying to the FBI Getty 11/13 Lee Cisna Cisna served as director of citizen and immigration services between October 2017 and June 2019 before being asked to resign amid a major personnel change in the department of homeland security 12/13 Madeline Westerhout Westerhout served as Trump's personal assistant after leaking private information about his family AFP/Getty 13/13 Mira Ricardel Ricardel was forced out of her role as Deputy National Security Advisor after first lady Melania Trump publicly called for her to be fired\n\nAsked by Mr Trump to erect such a barricade, Ms Nielsen replied: “Sir, I literally don’t think that’s even possible”.\n\nThis prompted the president to request her resignation by saying he wanted “to make a change”.\n\nIn another reported exchange between the pair, Ms Nielsen attempted to focus on subjects beyond the wall including requests for legal powers to take down drones.\n\nBut she was cut off half way through her request.\n\n“Kirstjen, you didn’t hear me the first time, honey,” Mr. Trump said. “Shoot ’em down. Sweetheart, just shoot ’em out of the sky, OK?”", "description": "Donald Trump reportedly told aides and cabinet ministers they were making him look like an “idiot” in an expletive-laden rant over his failure to clamp down on the nation’s southern border.", "authors": ["Vincent Wood"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/28/23/trump-hispanic.jpg"}