{"pub": "news24", "url": "https://sport24.co.za/Rugby/RugbyWorldCup2019/box-ticked-as-erasmus-praises-kolbe-20191004", "downloaded_at": "2019-10-05 10:55:11.789078+00:00", "title": "'Box ticked' as Erasmus praises Kolbe", "language": "en", "text": "Shizuoka - South Africa coach Rassie Erasmus said his team had \"ticked the box\" with Friday's seven-try 49-3 demolition of Italy that sets up them up for the Rugby World Cup quarter-finals.\n\n\"Our game against Italy was always going to determine who would progress from the pool,\" said Erasmus, who has seen his men lose their opener to New Zealand and hammer African neighbours Namibia 57-3.\n\nThe Springboks next take on Canada on Tuesday after destroying an Italian side reduced to 14 men for most of the second-half after prop Andrea Lovotti was red carded for a tip-tackle.\n\nErasmus added: \"One box ticked. We have the Canada game and then another game (the quarter-final) in the same frame of intensity as tonight.\"\n\n\"We were nervous about this game and we were in play-off mode,\" said the coach.\n\nThe turning point was the red carding of Lovotti, Erasmus said, with uncontested scrums from the 18th minute after Italy's two tighthead props went off injured.\n\nTwo of the seven tries were scored by dynamic winger Cheslin Kolbe, who has proved a thorn in the side of any opposition, whether in a Springbok jersey or playing for Toulouse in the French Top 14.\n\n\"He played a wonderful game, both in attack and defence,\" Erasmus said, naming him alongside All Blacks Sevu Reece and Damian McKenzie as having \"that X-factor, they can make something out of nothing\".\n\n\"It's great to have him there.\"\n\nREAD | Bok ratings: Kolbe's wowing the world!\n\nKolbe was taken off late on, however, after turning his ankle in a tackle but the coach gave him a clean bill of health.\n\n\"He rolled his ankle a little bit,\" Erasmus said. \"His ankle is fine.\n\n\"We didn't have a reserve, but we thought it was good to get him off the park and play the last minute or two with 14 men.\"\n\nErasmus stressed the match had not been \"perfect\", highlighting discipline in defence as one thing his side needed to improve on.\n\n\"And we definitely need to get better on the attacking side. But I'm pretty happy how we handled that game.\n\n\"We play to our strengths. We know that the way we played tonight was enough to get through to the quarter-finals.\"\n\nItaly coach Conor O'Shea said he had told the Azzurri squad of his huge disappointment with the result.\n\n\"For 40 minutes, we were able to keep the score to 17-3 and break the lines,\" the former Ireland full-back said.\n\n\"Everything had to go perfectly for us. We came into this match full of confidence about what we could do.\n\n\"The boys never stopped fighting, but the game was finished with the red card.\"\n\nO'Shea agreed replacement prop Nicola Quaglia was also lucky to escape a red card for his part in the tip-tackle.\n\n\"It was just a stupid act, we were quite calm at half-time. Andrea is more destroyed than all of us.\"\n\nWhile Italy now have to play the in-form All Blacks, O'Shea was full of praise for a \"formidable\" South Africa team he dubbed one of the most powerful he'd seen take to the pitch.\n\n\"They're an outstanding side. This was no friendly autumn international. They came with us standing in the way,\" he said.\n\n\"To play with 14 men for 40 minutes against that, you just can't.\n\n\"They're massive and they have that X-factor in the backline. They're very structured. They're going to be a very difficult side to beat.\"", "description": "South Africa coach Rassie Erasmus said his team had \"ticked the box\" with Friday's seven-try demolition of Italy.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9438/bb0c9889ea1d46b4875afe11e4378f1a.png", "published_at": "2019-10-04"}