{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/5/us-debt-threatens-defense-and-entitlements", "downloaded_at": "2019-09-06 12:15:47.943373+00:00", "title": "Why Americans should worry about the national debt", "language": "en", "text": "ANALYSIS/OPINION:\n\nThe federal government is plunging deeply into record-breaking debt, undermining the very foundations of our country and its economic health.\n\nPresident Trump rarely, if ever, talks about it, and you hardly ever hear about it on the nightly news, even though economic analysts are warning that it threatens to end programs and benefits upon which millions of Americans depend.\n\nFor many decades the growth of the federal deficit was measured in tens of billions of dollars, and then hundreds of billions, as government spending and debt spun wildly out of control.\n\nLast year, the nonpartisan Congressional Budget Office (CBO) forecast that the government was speeding toward a $1 trillion plus deficit by 2020, and will whiz well beyond that in the years to come.\n\nFor a very, very long time, members of Congress hid their heads in the sand, saying the government would be able to raise whatever they needed to spend in the bond market. What’s to worry?\n\n“Let’s face it: For most of us, the federal debt is somewhere between a snoozer and an abstraction,” David Davenport, a federal policy analyst at the Hoover Institution, wrote last year in Forbes Magazine.\n\n“There are plenty more tangible and immediate problems to worry about. Even if we did get stirred up about it, what can we do?” he wrote.\n\nThen CBO released its annual Budget and Economic Outlook in 2019 about the financial ill health of the federal government, and it’s not a pretty picture. It forecasts:\n\n• “Debt held by the public will increase by more than $12.5 trillion under current law over the next decade — from $16.1 trillion today to $28.7 trillion by 2029.”\n\n• “Debt as a share of the economy will rise rapidly, from today’s post-war record of 78 percent of GDP to nearly 93 percent of GDP by 2029.”\n\n“Under current law, CBO projects [budget] deficits will grow from $779 billion last year to $897 billion in 2019,” and to an estimated $1 trillion or more by 2020.\n\n“On a basic level, this means the U.S. government is spending way more money than it brings in,” writes economics reporter Heather Long of The Washington Post.\n\n“The United States has been running a deficit every year since 2002, but the situation is about to get really ugly,” she says … If spending keeps up at this pace (and there is every indication that it will), President Trump and his successors are going to have less flexibility to pump up the economy during a downturn or even a crisis.”\n\nIn his Forbes article “Five Reasons Why You Should Worry About The Federal Debt”, Mr. Davenport writes that “your Social Security and Medicare entitlements are at risk if the federal debt continues to grow … Since it will be almost impossible to cut federal spending and the national debt without touching expensive entitlements, your entitlements — especially if you are younger than the Baby Boomers — are very much at risk.”\n\nMoreover, he argues, “the growing debt increases the risk to our national defense,” recalling how National Intelligence Director Dan Coats scolded senators at a hearing, saying that uncontrolled federal spending “is threatening our ability to properly defend our nation, both in the short term and especially in the long term.”\n\nMr. Trump promised in his campaign to balance the federal budget, but has failed to honor that pledge, Mr. Davenport points out. He quotes the president’s Treasury Secretary Steve Mnuchin who said government spending is “not an issue we’re focused on right now.”\n\nMr. Davenport says that every American should be very concerned about out of control federal spending because the politicians in Congress and in the executive branch are spending like there’s no tomorrow.\n\n“If you think you’re too young to worry about the federal debt, you’re precisely the one who should be worried,” he says, adding, “As President Herbert Hoover wisely said, ‘Blessed are the young for they shall inherit the national debt.”\n\n• Donald Lambro is a syndicated columnist and contributor to The Washington Times.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The federal government is plunging deeply into record-breaking debt, undermining the very foundations of our country and its economic health.", "authors": ["The Washington Times Http", "Donald Lambro"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/06/12/6_122019_b3-thom-american-de8201_c0-215-1120-868_s1770x1032.jpg?3e014dd7bc60eb63f6610c75ea77909fa401502f", "published_at": "2019-09-05"}