{"pub": "investing.com", "url": "https://investing.com/news/forex-news/top-5-things-to-know-in-the-market-on-thursday-1997986", "downloaded_at": "2019-10-17 10:33:45.451650+00:00", "title": "Top 5 Things to Know in the Market on Thursday", "language": "en", "text": "© Reuters.\n\nInvesting.com -- There's a Brexit deal in the offing, although it still needs to be approved by a recalcitrant British parliament. The pound and other U.K. and European assets are responding with enthusiasm. Elsewhere, Netflix (NASDAQ: ) is set for a pop after stronger-than-expected earnings in the third quarter, even though subscriber growth again fell short of expectations. There are also regular updates on U.S. industrial production and the housing market, while oil is struggling after a big build in stocks last week. Here's what you need to know in financial markets on Thursday, 17th October.\n\n1. Brexit deal agreed\n\nThe European Union and U.K. governments agreed a that would see the U.K. leave the bloc on Oct. 31, averting the prospect of a disorderly Brexit. The deal is set to be approved in principle by a summit of EU leaders that starts later Thursday.\n\nThe pound and U.K. stock markets rallied, hitting its highest against the dollar since May this year, while the rose 0.6%. The also gained over 0.5% against the dollar, hitting $1.11 for the first time since August.\n\nHowever, the deal still has to pass the House of Commons, which could still prove an obstacle, having three times voted down the previous Withdrawal Agreement negotiated by Prime Minister Theresa May. The Northern Irish Democratic Unionist Party that it would not support the deal.\n\n2. Netflix (NASDAQ: ) beats on profits, but subs growth misses again\n\nNetflix (NASDAQ: ) reassured investors that it can continue to grow despite increased competition in the streaming space. Its shares rose nearly 10% in after-hours trading to their highest in over two months, on the back of a profit well in excess of consensus forecasts.\n\nHowever, subscriber growth still missed the company’s own targets for the second straight quarter, coming in at only 6.8 million worldwide, rather than the 7 million forecast. The domestic shortfall was even starker, at 517,000 compared to the 800,000 it expected. That suggests that U.S. customers may be holding off to see the reality of new services from Apple (NASDAQ: ), Disney and others before committing to new subscriptions.\n\n3. Stocks to open higher; earnings due from Big Tobacco, Wall Street and more\n\nU.S. stocks look set to open sharply higher on the back of the Brexit deal announced earlier, which ought to remove a major uncertainty from the outlook for the world economy if ratified in the U.K. parliament.\n\nBy 6 AM ET (1000 GMT), were up 122 points or 0.5%, while were back above 3,000 with a gain of 0.4% and were also up 0.5% (boosted not least by Netflix (NASDAQ: )).\n\nToday’s earnings roster includes Philip Morris (NYSE: ), Honeywell (NYSE: ) and Union Pacific (NYSE: ), while Morgan Stanley (NYSE: ) rounds out the reports from Wall Street. Earlier, consumer giant Nestle unveiled a 20 billion franc stock buyback while its rival Unilever (LON: ) said it remained on course to meet its 2020 profit targets.\n\n4. Can industry turn around after the consumer shows signs of weakening?\n\nThere’s a harsher spotlight on the U.S. data today after the weakest report this year cast doubt on the ability of the consumer to sustain an economy hit by import tariffs and a broad manufacturing slowdown.\n\nThere will be housing starts and building permit data for September at 8:30 AM ET along with the weekly jobless claims numbers. The Philadelphia Fed’s manufacturing survey will also be published at that time.\n\nAt 9:15 AM ET, there will follow September’s figures for industrial production, manufacturing output and capacity utilization.\n\n5. Oil flounders on stock build\n\nis one of the few risk assets not responding much to the Brexit news, with U.S. Crude futures still down 0.4% on the day at $53.14 a barrel by 6:15 AM ET.\n\nThat’s largely because of a monster 10.5 million barrel increase in stocks last week, according to data from the American Petroleum Institute late Wednesday. The government’s data are all due out at 10:30 AM ET, and look likely to confirm the market is quickly slipping out of balance as supply growth continues to run ahead of the world’s ability to absorb it.", "description": "Top 5 Things to Know in the Market on Thursday", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEF1A14U_L.jpg", "published_at": "2019-10-17"}