{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7556623/Eden-Health-Retreat-week-long-tech-detox-change-life.html", "downloaded_at": "2019-10-12 00:17:56.050776+00:00", "title": "Eden Health Retreat: How a week-long tech detox will change your life", "language": "en", "text": "Advertisement\n\nIf you were asked to give up your phone and access to technology cold turkey for seven days, chances are you wouldn't be too keen on the idea.\n\nAnd you wouldn't be alone, with many Australians regularly plagued with anxiety over the mere concept of logging off and checking out for an hour, let alone a week.\n\nIn a world where we are more accessible and connected than ever before, few realise the impact that being 'online' 24/7 can have on their health - and just how powerful a 'tech detox' can be.\n\nEnter Eden Health Retreat.\n\nDescribed as a 'secluded place of tranquil beauty', Eden Health Retreat is nestled in a rainforest at the end of the Currumbin Valley, a stunning section of the Gold Coast Hinterland in Queensland\n\nIt's one of Australia's longest established retreats and invites guests to experience a smoke, alcohol, caffeine and tech free week where they have time to reset, refresh and heal in a way that suits them\n\nDescribed as a 'secluded place of tranquil beauty', Eden Health Retreat is nestled in a rainforest at the end of the Currumbin Valley, a stunning section of the Gold Coast Hinterland in Queensland.\n\nIt's one of Australia's longest established retreats and invites guests to experience a smoke, alcohol, caffeine and tech free week where they have time to reset, refresh and heal in a way that suits them.\n\nWhether it's a solo corporate worker looking to take time out and relax, a stay-at-home mum looking for some me-time or a group of friends wanting to work on their fitness, the program is designed for all walks of life.\n\nUpon arrival at Eden, all guests are met with a refreshing snack before meeting one-on-one with a therapist at the spa to discuss why they are there and what they hope to get out of their seven days.\n\nIn a world where we are more accessible and connected than ever before, few realise the impact 24-hour communication can have on their health - and just how powerful a 'tech detox' can be\n\nEach night guests return to their villa (pictured) to find this personalised program for the following day including planned (totally optional) activities, meal times (five) and any therapies/treatments that have been organised\n\nWhat does a typical day look like at Eden Health Retreat? Flying fox pictured 5.55am: Wake up 6.15am: Qi Gong or yoga looking out over the valley as the sun rises 7.30am: Breakfast, ranging from tofu scrambled eggs and vibrant fruit bowls to poached eggs and protein pancakes 8.30am: Valley bike ride (8km) to a local organic cafe and back 10.00am: Morning tea, ranging from healthy muffins to fruit and organic friands 10.30am: Pilates overlooking the valley 12.00pm: Lunch - eg. a loaded macro bowl with roasted pumpkin, pickled beetroot, smashed avocado and salsa 1.30pm: Flying fox through the rainforest 2.30pm: Workshop on the mind/energy, cooking or learning how to align your spine 4.00pm: Free time 6.00pm: Dinner, ranging from dahl and crusted salmon fillets to rainbow veggie bowls with quinoa, sweet potato, beetroot and hemp 7.30pm: Folk singer music session or crystal bowl healing 8.30pm: Bed\n\nThe therapists then discuss relevant spa treatments and therapies which are then included in the guests' personal daily program on various days throughout the week.\n\nEach night guests return to their villa to find this personalised program for the following day including planned (totally optional) activities, meal times (five) and any therapies/treatments that have been organised.\n\nEveryone deserves the time, space and peace to remember what they love doing, why they love solitude, what it feels like to make new friends and how they feel when they've eaten, slept and exercised well.\n\nThe morning activities are designed to help guests 'start the day with energy and vibrancy' while the afternoon activities tend to be more focused on 'relaxation, education and time to reflect'.\n\nActivities range from adventure experiences like the giant swing or a flying fox to active experiences like yoga, gym-based cardio workouts, Pilates and bush walks.\n\nPictured is the dahl with Greek yoghurt, a healthy papadum and a rainbow salad with fruit and coriander\n\nThe focus on 'healing' at Eden is at the forefront, with guests encouraged to take time out to focus on themselves and what they truly need to step back into the outside world equipped with a new mindset and renewed energy (left are wholefood banana 'Splitz' made from fruit, coconut milk, macadamias and chia seeds)\n\nThere are also healing workshops, wake up Qi Gong classes, educational group talks and healthy cooking demonstrations on offer.\n\nThe focus on 'healing' at Eden is at the forefront, with guests encouraged to take time out to focus on themselves and what they truly need to step back into the outside world equipped with a new mindset and renewed energy.\n\nWhile some may struggle at first, within 24 hours guests are forming new friendships, embracing new, vibrant foods and finding themselves stepping out of their comfort zone in ways they never knew they could.\n\nSpeaking to FEMAIL, Eden's General Manager Chris Van Hoof said Eden averages 28 guests per week - and they constantly walk out with a new ability to 'check out' from the stresses of social media and a fresh new perspective.\n\nWhy should you consider a tech detox? How many hours today have you been more than a metre away from your mobile phone? This is the question Beyond Blue wants Australians to ask themselves to realise how much of an impact this constant connectivity is truly having on our health. For most people, the answer will be a few hours or less. For others, it may even be no time at all. In today's technology-driven world, the smartphone has almost become an extension of the human hand. An accessory so essential that you feel naked without it. And, when you're not looking at your phone, there's a strong chance you're looking at a computer or watching TV – home entertainment streaming services like Netflix have such a large range that, let's be honest, one episode is rarely enough. Then there's your work life... there's no escaping the screen. So why cut back? You find calm again: There have been thousands of social experiments where people have taken a break from technology and the participants are almost always surprised to find themselves less stressed because of it. When you're on your phone or absorbed in your emails, you're not living in the present. Healthier relationships: If you're stuck in cyber world too long, your social connections in real life can take a back seat. Better physical health: If your eyes are glued to the screen, you're probably sitting or lying down. A growing obesity problem in Australia is partly because of a lifestyle tied to the couch staring at a screen. It's not only terrible for your lower back and neck, it's also bad on your waist line. Unplug, go outside and get the blood moving. Improved sleep: When your body knows it's time to sleep, your brain releases a chemical called melatonin, which helps the body relax and prepare for some shut-eye. Science has shown that when you look at a screen before bedtime, your brain is tricked into thinking it must remain alert and awake, preventing melatonin from being released.\n\n'We repeatedly receive glowing feedback thanking us for creating a space for guests to switch off and focus on the present,' he said.\n\n'Whether it's a digital detox, looking to eat healthier, move more, sleep better or just wind down, Eden has created an ideal seven day escape where it's safe for people to do what they need to in order to regroup and recharge.\n\n'The average Australian checks their phone 150 times a day, or around 160 minutes every day - checking emails, social media and scrolling the internet. We have become attached to our phones, and not in a good way!\n\n'The lack of wi-fi at Eden Health Retreat means that people are forced to give up their social media habit and realise that the world will keep turning.'\n\nMr Van Hoof added that it's important for people to remember how much of their time, energy and emotions they hand over to social media.\n\nThe morning activities are designed to help guests 'start the day with energy and vibrancy' while the afternoon activities tend to be more focused on 'relaxation, education and time to reflect'\n\nWhat accommodation is on offer at Eden? Eden Superior ($3,350pp or $3,050pp double share) Eden Suite ($3,950pp or $3,350pp double share) Valley View Deluxe ($4,550pp or $3,650pp double share) Each includes five meals a day, use of all facilities including steam room, sauna, pool and gym, all group activities, cycling, wellness classes and $400 of therapy vouchers\n\n'This time and energy could be much better utilised elsewhere, such as relaxing, exercising or with friends and family,' he said.\n\nWhat makes Eden stand out from the rest is the rustic, no-judgement 'make this whatever you need it to be' approach and the true passion each of the staff has for the retreat and everything it has to offer.\n\nMost of them have been there for many years and have been working on perfecting their activities and customised treatments.\n\nOne of the stand-out treatments is the Kahuna Bodywork Massage - an ancient Hawaiian technique that involves vigorous and rhythmic movements to deeply relax the body and mind.\n\nPerformed on a client wearing nothing but a sarong, this massage balances, nourishes and heals the mind, body and spirit through gentle, deep tissue massage, joint rotations, stretches and dynamic energy with breath and music.\n\nThe thing that makes Eden stand out from the rest is the rustic, no-judgement 'make this whatever you need it to be' approach and the true passion each of the staff has for the retreat and everything it has to offer\n\nFor most, the combination of being free of the distractions of the outside world, experiencing treatments, genuine connections and focusing on a healthy diet and exercise leads to a deeply transformative and often life-changing week\n\nFor 110 minutes, guests are taken on a 'spiritual journey' and often report intense sinus clearing, 'aha' moments, feeling highly emotional, tears and walking out with a new lease on life.\n\nFor most, the combination of being free of the distractions of the outside world, experiencing treatments, genuine connections and focusing on a healthy diet and exercise leads to a deeply transformative and often life-changing week.\n\n'As the manager, of course I think that we offer a world-class, five star retreat for those who are tired, stressed, carrying too much weight, or just can't find the motivation to make positive changes – but it's more than that,' Mr Van Hoof said.\n\n'I think everyone deserves the time, space and peace to remember what they love doing, why they love solitude, what it feels like to make new friends and how they feel when they've eaten, slept and exercised well.'", "description": "Described as a 'secluded place of tranquil beauty', Eden Health Retreat is nestled in a rainforest at the end of the Currumbin Valley, a stunning section of the Gold Coast Hinterland in Queensland.", "authors": ["Laura House For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/04/19570012-0-image-a-13_1570764985036.jpg", "published_at": "2019-10-11"}