{"pub": "guardian", "url": "https://theguardian.com/football/2019/oct/25/mauricio-pochettino-tottenham-amazon-prime-liverpool", "downloaded_at": "2019-10-27 12:03:36.468987+00:00", "title": "Mauricio Pochettino concerned by Tottenham’s Amazon Prime series", "language": "en", "text": "Mauricio Pochettino has admitted that he has concerns about Tottenham’s participation in a new Amazon Prime documentary, fearing it will add to an already formidable workload during the remainder of the season.\n\nThe fly-on-the-wall programme will adopt a similar format to those that previously lifted the bonnet on goings-on at Manchester City, Leeds and Borussia Dortmund, charting a campaign that has got off to a fraught start. Filming has begun, with Pochettino’s blessing, but he half-joked that he must add the title of “producer” to the rest of his responsibilities.\n\nTottenham manager Mauricio Pochettino says 5-0 win is a ‘first step’ Read more\n\n“When the club agreed the deal with Amazon, of course we were worried about it,” Pochettino said, referring to himself and his staff. “Because it is not easy, not easy. It is tough to have the camera in your office, and then how you handle the situation to have the capacity to say: ‘OK, I am not in a good mood, but sometimes the camera is going to be there.’ It is so complicated, it is another thing to worry about and of course that adds a lot.\n\n“If we were busy, now we are super busy. To plan every day, everything, is not an easy job. That is why, when I told you I feel that I am not any more a manager, I am a coach, now I am like a producer. Being coach, manager and producer.”\n\nWhile Pochettino may be worried about showing his best face for television, there is the obvious risk that Tottenham themselves will not come out glowingly if their fortunes on the pitch do not improve. It is, the manager accepts, simply a danger inherent to the process.\n\n“It’s going to be the reality,” he said. “It is like when we started to do the book [Inside Pochettino’s Spurs, in 2017] one season. It was the same risk. The most important is to live the reality, not to try to generate something that is fake or not real. And then what you are going to love, what the people are going to love to see, is that we are normal people working. We can win, we can lose.\n\n“Like the book, I hope there is a happy ending. But if not, you are going to see another point of view, from a different vision.”\n\nJadon Sancho holds all the cards as Dortmund look to cash in on his promise | Barney Ronay Read more\n\nVictory at Anfield on Sunday, in Tottenham’s first meeting with Liverpool since their defeat in the Champions League final, would improve the chances of a positive denouement. The form books might suggest that is an improbable outcome, and Spurs have not won in the past nine iterations of this fixture, but Pochettino believes his embattled squad remains a match for Jürgen Klopp’s side.\n\n“Of course, because I love my players and believe we have an unbelievable squad with unbelievable players,” he said. “When we are at our best we can beat any team.”\n\nHe offered a reminder that Liverpool have been free of the stadium-related upheaval, and associated strains, Spurs have faced over the past half-decade. “Of course, expectations are so high, but when you analyse five years ago, both clubs have different objectives in that time,” he said.\n\n“For them, they were focused on trying to build a team that can compete and win titles. For us, the same because we are so competitive, but the priority was in different areas. That makes it more difficult.”", "description": "Mauricio Pochettino likened himself to a producer after raising concerns about Tottenham’s decision to film an Amazon Prime documentary covering this season", "authors": ["Nick Ames"], "top_image": "https://i.guim.co.uk/img/media/282691cf584e0044a448502ce71a7c7ff437d713/173_219_3008_1805/master/3008.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a46469681a5f9363e60308da2ef1d669", "published_at": "2019-10-25"}