{"pub": "guardian", "url": "https://theguardian.com/lifeandstyle/2019/oct/20/in-the-darkness-of-a-matinee-cinema-judy-offers-a-glint-of-hope", "downloaded_at": "2019-10-20 13:00:32.427433+00:00", "title": "The darkness of a matinee cinema trip offers a glint of hope", "language": "en", "text": "I understand now. I absolutely get it, the reason one should go to the cinema alone. Last Thursday I had the day off work and took a piece of cake to a matinee performance of Judy. As the credits rolled, this epiphany swept over me in a wonderful wave, and I leant back in my velvet seat and sighed like a snore.\n\nSelf-care is an amorphous word and one that has been wrung so dry from overuse it disintegrates to the touch. The concept originated as doctors’ advice to elderly patients about how to avoid falls at home, then evolved to encompass the doctors themselves as they started to understand the need for people with emotionally testing jobs to look after their own mental health. From the early 1970s, self-care became a political act, as people of colour realised autonomy over their bodies was essential in order to fight racist systems and push the civil rights movement forward.\n\nFor an idea originally centred in day-to-day survival, in 2019 there aren’t half a lot of vitamin-infused sheet masks that claim to do the job. Though the word itself has dried out, the self-care market is flooded, an overflowing bath, running so fast and so long that the damp threatens the very foundations of the house.\n\nUntil the first notes of Somewhere Over the Rainbow, I hadn’t realised I’d been holding in tears for an entire adulthood\n\nThere are face oils, tea bags, vibrators, blankets, bath salts, tote bags and toothpastes. There are podcasts to subscribe to, and Instagram accounts to follow, of body parts and inspirational messages, which you can click through to buy as a poster for someone you disrespect.\n\nThere are lotions to put on you, objects to put in you, crystals to hang from your neck and around your desk and above your bed, craft projects to theme a hen night, birth plan and marriage around. It is possible, if so inclined, for a person to build themselves an entire palace of self-care, a lavender-scented mausoleum in which they can meditate themselves into a state of complete absence, where the self is so cushioned by the care it slowly ceases to exist.\n\nI have been thinking about self-care recently in relation to those out on the streets protesting the climate crisis. Their days are soaked in rain and passion, and their nights bright with dread, their awareness and anxiety about the end of the world having overtaken any thoughts of their own individual comfort. The original meaning of self-care rolls often through my mind as I worry for acquaintances whose mental health is being compromised by their focus on apocalypse, whether fretting over the plastic their lettuce is wrapped in or when to glue themselves to a statue. Though I am in awe of their dedication, my personal dreads remain domestic and manageable. “Have you got snacks?” I texted a friend who had taken Trafalgar Square, and later: “What happens when you need a wee?” Her neighbour, she reassured me, had brought incontinence pads.\n\nAnd so it occurred to me that Thursday afternoon, that in the context of self-care, we so rarely hear about the matinee cinema performance. It was me and approximately 18 elderly ladies, two of whom thoughtfully included me in their discussion about whether red pepper causes arthritis. My cake finished with the trailers, as Judy started I allowed myself the privilege of a minute to consider the way the world canonises tragic women, whether Judy Garland or Amy Winehouse, their suffering becoming more relevant than their talent. And whether we, their contemporary audiences, were stretching the abuse they’d lived through into new shapes in order to enjoy them afresh once dead. That thought considered, sealed and neatly put aside, I watched and adored the film, taking up three velvet seats with my body, my problems and my coat. There is no darkness like the darkness of an old cinema at lunchtime. It calms you like a weighted blanket, the polite rustle of popcorn adding texture to the blackness.\n\nUntil the first notes of Somewhere Over the Rainbow, I hadn’t realised I’d been holding in tears for approximately an entire adulthood. I bawled, alone and loudly, as behind me I heard my pepper friends doing the same. Sobs pooled in the dip of my neck, soaked my T-shirt and dragged eyeliner down my cheeks in streams of sadness, stress and fury.\n\nAt college I remember reading film theory about the way a cinema recreates the womb, dark red and warm, but it is also a time machine and a bomb shelter, and a place to be alone together.\n\nWhen the lights came up, I felt as though I’d completed a silent yoga retreat. My phone had remained in my bag, my makeup had removed itself, and my muscles had relaxed into a position suitable for bowing to greatness. I looked around at strangers similarly readjusting to the truth of a suburban afternoon, my face still gleaming wet, and we all smiled dazedly at each other, somehow cured.\n\nEmail Eva at e.wiseman@observer.co.uk or follow her on Twitter@EvaWiseman\n\n\n\n", "description": "Alone in the velvet seats, Judy made me cry. By Eva Wiseman", "authors": ["Eva Wiseman"], "top_image": "https://i.guim.co.uk/img/media/04ca25c295a62926649fc3f6557e8a206295f8a6/0_312_3337_2002/master/3337.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=b53bb575b65bb233e631cd842f50c41b", "published_at": "2019-10-20"}