{"pub": "politico", "url": "https://politico.com/news/2019/10/07/trump-china-uighur-surveillance-038309", "downloaded_at": "2019-10-08 01:24:14.795434+00:00", "title": "Trump administration blacklists Chinese firms linked to surveillance of Uighur minority", "language": "en", "text": "\"Specifically, these entities have been implicated in human rights violations and abuses in the implementation of China’s campaign of repression, mass arbitrary detention, and high-technology surveillance against Uighurs, Kazakhs, and other members of Muslim minority groups in the XUAR,\" the Commerce Department notice said.\n\nThe eight firms include Dahua Technology; Hikvision; IFLYTEK; Megvii Technology; Sense Time; Xiamen Meiya Pico Information Co. Ltd.; Yitu Technologies; and Yixin Science and Technology Co. Ltd, according to a Commerce Department notice posted on the Federal Register website.\n\nThe ruling Chinese Communist Party has placed more than 1 million Uighur Muslims in internment camps, according to the United Nations.\n\nThe move, which has been under consideration for months, may appease some Republicans who criticized President Donald Trump of appearing soft on the authoritarian actions of China.\n\nIt also comes as the United States is preparing to host Chinese Vice Premier Liu He on Thursday and Friday for high-level trade talks aimed at unraveling tariffs the two sides have imposed on hundreds of billions of dollars of each other's goods over the past year.\n\nIn comments to the media, Trump indicated Monday that he didn’t want a partial deal with China but hinted that trade talks this week could result in something “very substantial.”\n\n“I would much prefer a big deal and I think that’s what we’re shooting for,” Trump said during a White House event to formally sign a Japanese trade deal. “Can something happen? I guess, maybe, but it’s unlikely.”\n\nLiu and other senior Chinese officials will meet with U.S. Trade Representative Robert Lighthizer and Treasury Secretary Steven Mnuchin on Thursday and Friday for what will be the 13th round of talks.\n\n“They want to make a deal,” Trump said of Beijing. The U.S. is set to escalate tariffs on roughly $250 billion worth of imports on Oct. 15.\n\nTrump also again denied that he told Chinese President Xi Jinping that he would stay quiet on the unrest in Hong Kong during the ongoing trade talks with Beijing.\n\n“I think if anything bad happened that would be a very bad thing for the negotiations,” he said, adding that he wants a “humane solution” to the unrest there.", "description": "", "authors": [], "top_image": "https://static.politico.com/3f/d2/64f51d0a4f519b61373f0937cf25/191007-cameras-xinjiang-ap-773.jpg", "published_at": "2019-10-07"}