{"pub": "washingtonpost", "url": "https://beta.washingtonpost.com/world/2019/09/13/charlie-cole-photographer-who-captured-tiananmen-tank-man-has-died", "downloaded_at": "2019-09-13 18:09:02.146746+00:00", "title": "Charlie Cole, photographer who captured the Tiananmen ‘Tank Man,’ has died", "language": "en", "text": "\n\nThis photo of the Tiananmen \"Tank Man\" in 1989 was taken by Jeff Widener for the Associated Press. Charlie Cole, who died last week, took a similar picture for Newsweek that went on to win the 1990 World Press Photo of the year. (JEFF WIDENER/AP)\n\nThere is a decisive moment, the French photographer Henri Cartier-Bresson wrote, often just a fraction of a second, where the significance of an event and the precise form to render it come into view.\n\nOn a clear day in 1989, perched on an upper balcony of the Beijing Hotel, American photographer Charlie Cole, 34, found himself faced with this moment. With his eye to the viewfinder and his finger on the shutter button of a camera with a 300-millimeter lens, Cole took a photo that not only captured, but came to define, an inflection point in world history.\n\nCole, who became known after this point as one of a handful of “Tank Man” photographers, died last week at his home in Bali, the BBC reported. The Texas native was 64.\n\nIn May 1989, nearly a decade after he had moved to Japan from the United States, Cole was sent to Beijing to cover ongoing student protests for Newsweek. When he arrived, the peak of the protests seemed to have passed and most publications had started sending their photographers elsewhere. The magazine, Cole said, told him to stay on.\n\nOne Sunday night, after being punched, kicked and prodded by members of the Chinese secret police, Cole took cover in a hotel with Stuart Franklin, a Magnum photographer working for Time magazine. As the sun began to rise on June 5, the two Americans looked over at Tiananmen Square as tanks began to roll in, accompanied by thousands of troops from the People’s Liberation Army. Around noon, soldiers began firing automatic weapons to clear out crowds of protesters.\n\n“Where there had been hundreds of people just moments before, were only deserted bicycles and burned-out buses,” Cole remembered.\n\nFollowing this, a line of around 25 tanks started to move out of the square. Then a man, of unknown age and origin, came into view. Holding a shopping bag in one hand and a jacket in the other, the man in the white shirt stood in front of the tanks. Cole tightened the frame, angling his camera so that the first three tanks and the white lines on the road pointed toward the man, small and stark, in the bottom left corner. The tanks inched closer, the first one bringing its gun barrel above the man’s head. Cole clicked.\n\nLater, after hiding this roll of film in the tank of the hotel room toilet during a raid by Chinese secret police, Cole brought the image to the Associated Press office in Beijing and transmitted it to Newsweek. For months, even years, afterward, his image, along with those of the other photographers, was printed on front pages across the world.\n\nAt the time, this image, which was awarded the 1990 World Press Photo, seemed to epitomize the ongoing conflict between Chinese citizens and military authorities. As the New York Times’s James Barron wrote at the time:\n\nIt was a close call — the tank came [within] perhaps a second or two of killing him -— and it seemed to encapsulate many of the confrontations in recent days between the citizens and the army: the touch-and-go maneuvering, with soldiers not sure when to press on and when to retreat; the determination of the demonstrators, brave and unyielding in ways that might have been unthinkable a few weeks ago. In its quiet way, this little confrontation seemed to symbolize the fragility of the Government’s position.\n\nIn the years since, however, the photo has transcended that particular news cycle, serving not only as veritable, urgent evidence of a key moment in Chinese history but as a symbol for peaceful protests across the world. Marking the anniversary of the Tiananmen massacre earlier this year, The Washington Post’s Ishaan Tharoor wrote: “Part of what makes the memory of Tiananmen so important is the fragility of that memory itself.\"\n\nFor decades, Chinese leaders have worked to expunge this legacy of dissent from public consciousness, scrubbing references to it in local media and school textbooks. “Hundreds of millions of people in the country, to this day, have no knowledge of what happened,” Tharoor wrote. Cole’s photo, and those like it, have helped to ensure that the rest of the world does not forget.\n\nDespite the accolades he received for his photo, Cole has said he wishes that the image had not come to overshadow the work of other photojournalists during that period of unrest. Citing a list of nine other photographers, Cole told the New York Times in 2009, “We should not be lured into a simplistic, one-shot view of this amazingly complex event.”\n\nIn his lifetime, the photographer also asserted multiple times that on that Monday afternoon in 1989, he was an observer — and not a maker — of a moment seared into history by the white-shirted man.\n\n“I think his action captured people’s hearts everywhere, and when the moment came, his character defined the moment rather than the moment defining him,” he told the BBC in 2005. “He made the image; I just took the picture.\"\n\n“I felt honored to be there.”", "description": "“He made the image; I just took the picture,\" Cole said about the white-shirted man who stood before Chinese tanks in 1989. \"I felt honored to be there.”", "authors": ["Rebecca Tan", "Local Reporter", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/Oo26goQq0pkLAlF-YX_WK1mq9zE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/D3ZWUSWWEII6TCJEDW35VR4X7M.jpg", "published_at": "2019-09-13"}