{"pub": "investing.com", "url": "https://uk.investing.com/news/general/lack-of-shock-value-a-measure-of-how-far-japan-have-come--borthwick-1972086", "downloaded_at": "2019-09-29 05:10:23.548012+00:00", "title": "Lack of shock value a measure of how far Japan have come - Borthwick", "language": "en", "text": "By Peter Rutherford\n\nKOBE (Reuters) - Japan's stunning World Cup victory over Ireland did not register as a huge surprise for Steve Borthwick and the England forwards coach said on Sunday the hosts have grown to such an extent they go into games against the elite sides believing they can win.\n\nFour years on from delivering the sport's biggest upset by beating South Africa at the 2015 tournament, Japan pulled off another shock for the ages with a 19-12 win over the Irish, who only recently lost top spot in the world rankings to New Zealand.\n\nWhile their famous win over the Springboks in England was like a bolt from the blue Saturday's result did not carry the same shock value, said Borthwick, who was on Eddie Jones's coaching staff with Japan from 2012 to 2015.\n\n\"Not surprising,\" said Borthwick. \"I had the privilege of coaching Japan, coaching a tier two team, and you see the growth in the tier two teams. There is the expectation that they can win, they believe they can win.\n\n\"They have very good coaches in Jamie Joseph and Tony Brown and the team played with tenacity and it was very impressive.\n\n\"You have seen the results they have had in the last few years and they have jumped up to their highest ranking.\"\n\nThe win lifts Japan to eighth in the world and offers them a tremendous opportunity to reach the knockout stages of a World Cup for the first time.\n\nWith group games to come against Samoa and Scotland, who are ranked lower than Japan, the hosts are a strong bet to top Pool A, which would be a remarkable rise for a team that prior to 2015 had recorded one win from their 24 World Cup games.\n\n\"If you look at Japan's history in World Cups prior to 2015, it does not make pretty reading,\" said Borthwick. \"Now Japan go into these games expecting to win and that's great credit to what that coaching team have done with them.\n\n\"Physically they are very good. I think the rugby is good to watch. They play to their strengths. They are smart with it.\n\n\"When you see the excitement in the stadiums with their supporters they have, the passion for the game is there. As more and more people are exposed to the sport during this tournament, I think it can grow even bigger.\"", "description": "Lack of shock value a measure of how far Japan have come - Borthwick", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8S02N_L.jpg", "published_at": "2019-09-29"}