{"pub": "dailybeast", "url": "https://thedailybeast.com/democratic-debate-rivals-tear-down-frontrunner-elizabeth-warrens-pipe-dream-plans", "downloaded_at": "2019-10-16 03:56:52.176524+00:00", "title": "Democratic Rivals Try to Tear Down Frontrunner Elizabeth Warren’s ‘Pipe Dream’ Plans", "language": "en", "text": "WESTERVILLE, Ohio—Elizabeth Warren has plans. And on Tuesday evening they were put through the wringer.\n\nThe Massachusetts Democrat spent much of the evening’s Democratic primary debate being dragged by her opponents. It was a different treatment from what she received in the past, when she often managed to skate through the debates without drawing attacks or ire.\n\nBut that ended on the stage inside Otterbein College’s Rike Center. And it signified that Warren’s steady rise in the polls has turned her insurgent candidacy into that of a frontrunner.\n\nAfter The New York Times’ Marc Lacey asked Warren to answer yes or no whether her Medicare for All plan would raise taxes on the middle class—as Sen. Bernie Sanders (I-VT) has conceded would happen under his similar proposal—Warren launched into a detailed, and now familiar, dodge.\n\nPressed again by the moderator, she did it again.\n\n“Costs will go up for the wealthy and for big corporations, and for hardworking middle-class families, costs will go down,” Warren said, side stepping the “yes” or “no” request.\n\nWhen asked to respond, Mayor Pete Buttigieg called her out.\n\n“You heard it tonight: a yes or no question that didn’t get a yes or no answer,” he said. “Your signature, Senator, is to have a plan for everything, except this. No plan has been laid out to explain how a multi-trillion-dollar hole in this Medicare for All plan that Senator Warren is putting forward is supposed to get filled in.”\n\nThen Sen. Amy Klobuchar (D-MN) brought down the hammer.\n\n“I appreciate Elizabeth’s work,” Klobuchar said. “The difference between a plan and a pipe dream is a plan is something that you can actually get done.”\n\nIt was the beginning of a sustained attack of Warren and her canon of plans, seemingly aimed at bringing her and her poll numbers down to earth as well as highlight the moderate options in a primary that has increasingly rewarded the most liberal proposals. The exchanges also provided a glimpse into what the next few months could look like for Warren should she remain at or near the top of the pack.\n\nDuring the conversation about Warren’s wealth tax—a plan to tax the ultra wealthy at 2 percent or 3 percent depending on their income, several candidates sought to shut down the senator’s claim that she and Sanders were the only candidates willing to go up against the super rich.\n\n“My question is not why do Bernie and I support a wealth tax,” Warren said during one defense of her proposal. “It’s why is it does everyone else on this stage think it is more important to protect billionaires than it is to invest in an entire generation of Americans?”\n\n“ I want to give a reality check here to Elizabeth, because no one on this stage wants to protect billionaires. Not even the billionaire wants to protect billionaires. ” — Amy Klobuchar\n\n“No one is supporting billionaires,” former vice president Joe Biden interjected.\n\nFrom there, Klobuchar picked up the baton. “I want to give a reality check here to Elizabeth,” she said, “because no one on this stage wants to protect billionaires. Not even the billionaire wants to protect billionaires.”\n\nWarren responded, “Look, I understand that this is hard, but I think as Democrats we are going to succeed when we dream big and fight hard, not when we dream small and quit before we get started.”\n\nTo which Klobuchar replied, “You know, I think simply because you have different ideas doesn’t mean you’re fighting for regular people.”\n\nThe exchanges between Warren and several of the candidates weren’t the only contentious moments of a three-hour marathon debate featuring 12 presidential hopefuls. A heated exchange over how the U.S. should extract itself from the conflict in Syria between Buttigieg and Rep. Tulsi Gabbard (D-HI) offered a stark contrast between the two military veterans on the stage.\n\n“Donald Trump has the blood of the Kurds on his hand, but so do many of the politicians in our country from both parties who have supported this ongoing regime change war in Syria that started in 2011, along with many in the mainstream media, who have been championing and cheerleading this regime change war,” she said.\n\nTrump shocked the international community last week after his surprise removal of U.S. troops stationed on Syrian border triggered an immediate invasion from Turkey, whose forces slaughtered Kurdish fighters who have fought alongside U.S. troops against ISIS for years. The action drew condemnation from both sides of the aisle, and was viewed as a betrayal of a vulnerable ally.\n\n“We need to get out, but we need to do this through a negotiated solution,” Gabbard said.\n\nButtigieg replied Gabbard was “dead wrong.”\n\n“The slaughter going on in Syria is not a consequence of American presence, it is a consequence of a withdrawal and a betrayal by this president of American allies and American values,” he said. “OK, I didn’t think we should have gone to Iraq in the first place. I think we need to get out of Afghanistan, but it’s also the case that a small number of specialized, special operations forces and intelligence capabilities were the only thing that stood between that part of Syria and what we’re seeing now, which is the beginning of a genocide and the resurgence of ISIS.”\n\n“ We’ve got to level with people… Tell people what it’s going to cost, how you’re going to do it, and why you’re going to do it. That’s the way to get it done. Presidents are supposed to be able to persuade. ” — Joe Biden\n\nBut time and time again, the debate returned to Warren—and at times Sanders—and their collective visions for America. The Massachusetts Democrat was taken to task for her call to break up the major tech giants, with several candidates saying they understood the idea in principle but thought it was ill conceived or impractical. Former Rep. Beto O’Rourke (D-TX) called it Trumpian for a politician to single out individual companies like Warren had done.\n\nLater in the debate, Warren’s competitors went after her for being overly partisan and overly audacious. Biden said her pitch for structural political change, while attractive to “a lot of people,” was ultimately unrealistic.\n\n“[Y]ou know, Senator Warren said we can’t be running any vague campaigns,” he said. “We’ve got to level with people… Tell people what it’s going to cost, how you’re going to do it, and why you’re going to do it. That’s the way to get it done. Presidents are supposed to be able to persuade.”\n\nBy that point, Warren seemed to have gotten her footing a bit more. And when she pointed out that she had dreamed up and ultimately helped pass the Consumer Financial Protection Bureau—an agency designed to shield consumers from corporate malfeasance—Biden nearly exploded with exasperation.\n\n“I got votes for that bill,” Biden said. “ I convinced people to vote for it, so let’s get those things straight, too.”\n\nWarren paused and then said carefully, “I am deeply grateful to President Obama, who fought so hard to make sure that agency was passed into law, and I am deeply grateful to every single person who fought for it and who helped pass it into law.”\n\n“You did a hell of a job in your job,” Biden replied.\n\n“Thank you,” Warren, responded, sounding a little surprised.", "description": "Now leading the polls, the Massachusetts Democrat took heat from all sides Tuesday night—and her opponents were no longer content to let her dodge the tough questions.", "authors": ["Jackie Kucinich", "Washington Bureau Chief"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_675,w_1200,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1571197127/191015-debate-wrap-tease-2_ofztjy", "published_at": "2019-10-16"}