{"pub": "vice", "url": "https://i-d.vice.com/en_us/article/59nkw3/shaun-king-audia-jones-interview", "downloaded_at": "2019-10-16 20:31:56.357921+00:00", "title": "shaun king wants real justice", "language": "en", "text": "This story originally appeared in i-D's The Post Truth Truth Issue, no. 357, Autumn 2019. Order your copy here.\n\nShaun King is a journalist, podcaster, activist and community organiser and one of the most vital voices fighting social, political and racial injustice in America today. He is a co-founder of Real Justice, a political organisation helping to elect progressive District Attorneys across the US, who then seek to change and remake the system from within. Audia Jones is one of them. She is standing to be DA in Harris County, Houston. On a phone line between Brooklyn and Texas, Shaun and Audia discussed the task of making America a fairer place to live…\n\nShaun: In 2014 I was working in California for an environmental charity. One day I got a Facebook message from a buddy I went to college with and my whole life changed. He was living in New York and knew the young brother who filmed Eric Garner being killed by the police. He sent me a link to it on YouTube. I was so shook by it.\n\nWe see horrible videos like that way too often now but in July 2014 I’d never seen anything like that. I never worked another day for the company. I quit. I started trying to work out how I could help this family get justice. Then three weeks later John Crawford was shot and killed at a Walmart in Ohio. Mike Brown was shot and killed in Ferguson. Tamir Rice was shot in Cleveland. A young brother in LA called Ezell Ford, who was struggling with mental illness, was killed by police. People all over the country started saying “black lives matter”, but we also started asking for justice for these families.\n\nThen the next year Freddie Grey was killed, and Sandra Bland died in police custody. Then it was Alton Sterling and Philando Castile, and each time we fought for justice and got nothing. I had a real reckoning with myself. Whatever we were doing was not working and it wasn’t because we didn’t put enough effort in, or because we didn’t care enough.\n\nI realised something. There was a local District Attorney in each of those cities and counties, and if that DA didn’t care or see you as a part of their constituency and if they weren’t willing to take a risk by charging a police officer then justice wouldn’t be done.\n\nSo we started Real Justice because we wanted to help compassionate, creative, reform-minded women and men get into those positions. We’ve won elections in Philly, St Louis, San Antonio and Boston. When people think about the victories the Black Lives Matter (BLM) movement has had, this to me is a victory. Even you, Audia, are a victory. I’m grateful for your courage and proud of you.\n\nAudia: People do not always realise the scale of the power that the District Attorney has over the life and death of people. You named a lot of the individuals who have lost their lives, and their family members have been used as vehicles on the road to prosecution and then thrown away by the justice system. Sometimes the lives of those family members aren’t as important as somebody with a badge.\n\nOn the flipside, we see a lot of poor, black and brown individuals who just are picked off by the justice system. When I worked in the prosecutor’s office, I saw it first hand. These low level offenders get put in jail. When I tell people the numbers they are disgusted. Of the people in our jails in Harris County, Houston – where I’m running for office – 75 per cent are nonviolent. The media makes you think everyone in prison is a murderer or a robber, but that’s just not true. The way the criminal justice system works at the moment hasn’t helped anyone. Our crime rates haven’t decreased but the prison population has increased.\n\nThe way it works at the moment is a waste of resources, time and energy. We could be doing so much more to make our communities safer if we weren’t spending tens of millions of dollars on cracking down on these low level offenses.\n\nWhat we’ve seen is a real awakening, people love the fact that we have a plan. It’s not just about being exposed to these videos of horrific police brutality, because you can feel so helpless when you see this stuff. It’s about knowing that I can get on the phone and call the DA. That I can vote. It’s so inspiring to see you lead this charge, and to see other people come up behind you.\n\nFor a while we thought that sharing this footage would get us closer to justice, but even if there is shocking evidence it doesn’t mean there will be justice. Especially if the person running the system doesn’t value the people who are asking for justice.\n\nShaun wears T-shirt Calvin Klein Jeans. Trousers and jewellery model's own.\n\nIt’s gonna take time and it’s gonna take courage. I had never considered running for District Attorney but it had got to the point where I could no longer be complicit in a system that decimates our communities. If we focus on actual violent crimes that will make our community safer. And then there will be less incidents like the one that happened to Charnesia Corley here in Harris County. She was a young black woman and police officers conducted a roadside strip search on her, apparently looking for marijuana.\n\nIf marijuana was not criminalised then that incident wouldn’t have happened. Something I’ve had to communicate to people is that the criminalisation of poverty, drug addiction, and mental health problems has caused excessive over-policing of very particular communities. A lot of these incidents stem from how and why certain communities are deemed unsafe.\n\nBefore my family moved to California, we didn’t know where to move to. We found this city in southern California called Irvine, and it was actually listed as the safest city in America. So we moved to Irvine and it was the weirdest experience – there were no police. I was in Irvine for eight weeks before I saw a police car, and it was parked in the lot of a grocery store and the officer was running errands. This is the safest city in America and it has no police? So why is Irvine so safe? Well everyone has a job and the schools are amazing and well resourced.\n\nBut then when my kid went to High School in Irvine she learned something, and it was a real lesson for me too. This school was an elite, public, High School with a huge drug problem. But it was treated as a public health concern. What I realised was that in rich, white communities, they’ve already decriminalised drugs. When white folk smoke marijuana they just don’t go to prison for doing it.\n\nThat’s the root of it all. When we throw black and brown people – or poor or drug addicted people, or people suffering from mental health problems – into prison then you just destabilise them. They get stuck in jail because they can’t afford cash bonds to get out and they lose their jobs, and that just destabilises them even more. The root of a safe community is a stable community, a community where there’s jobs, training and education. In Harris County we spend $137 million a year to run the county jail, but those financial resources could be aimed at treating a lot of these issues as social and health issues rather than just locking these people up.\n\nI did this event with Chesa Boudin – who is running for DA in San Francisco – and at the time the city was having this wild crisis of car break-ins and someone asked what he was going to do about it. He answered the question from the audience member in a beautiful way. He said, we have discovered that about a third of the people breaking into these cars are homeless, and they are doing it because they are extremely desperate, and will do almost anything to relieve that. Another third are dealing with drug addiction and mental health illness. Only the final third are doing the break-ins for genuinely nefarious reasons. If you focus on the two thirds who are homeless and suffering from mental illness and drug addiction and get them the help they need, we will then be better able to deal with the other third. So when is your primary?\n\nWe’re eight months away.\n\nWhat are the most pressing concerns that you need to work on in the next eight months?\n\nThe thing is getting your message out and it’s a message that I think the country is ready to hear. People are waking up, social media and the internet are helping people to get educated – so hats off to you, because you’re spreading that message. We’ve heard so many people say before that their vote doesn’t change anything, but now they’re seeing that there is hope because there will be action\n\nCredits\n\nPhotography Mario Sorrenti\n\nStyling Alastair McKimm\n\n\n\nHair Bob Recine for Rodin.\n\nMake-up Kanako Takase at Streeters.\n\nNail technician Honey at Exposure NY using Dior.\n\nPhotography assistance Lars Beaulieu, Kotaro Kawashima, Javier Villegas and Chad Meyer.\n\nStyling assistance Madison Matusich, Milton Dixon III and Yasmin Regisford.\n\nHair assistance Kabuto Okuzawa and Kazuhide Katahira.\n\nMake-up assistance Kuma. Production Katie Fash.\n\nProduction assistance Layla Néméjanksi and Adam Gowan.\n\nCreative and casting consultant Ruba Abu-Nimah.\n\nCasting director Samuel Ellis Scheinman for DMCASTING.", "description": "For The Post Truth Truth Issue, the activist and journalist got on the phone with District Attorney Audia Jones to discuss the task of making America a fairer place to live.", "authors": [], "top_image": "https://video-images.vice.com/articles/5d9c6fa936f549000a2e0867/lede/1570534427711-shaunsplash.jpeg?crop=1xw:1xh;center,center&resize=1200:*", "published_at": "2019-10-16"}