{"pub": "realclearpolitics", "url": "https://reviewjournal.com/opinion/editorials/editorial-californias-bullet-train-to-nowhere-continues-to-misfire-1874776", "downloaded_at": "2019-10-23 14:56:18.767282+00:00", "title": "EDITORIAL: California’s bullet train to nowhere continues to misfire", "language": "en", "text": "California’s bullet train won’t be carrying passengers anytime soon, but it has one practical use. It’s a tangible illustration of what happens when political promises meet reality.\n\nAn elevated section of the high-speed rail under construction is seen in Fresno, Calif., in 2017. (AP Photo/Rich Pedroncelli)\n\nCalifornia’s bullet train won’t be carrying passengers anytime soon, but it has one practical use: It’s a tangible illustration of what happens when political folly and empire building meet reality.\n\nIn 2008, California voters approved the bullet train by ballot measure. The initial cost estimate was $33.6 billion, with the train running by 2029. In the state’s voter guide, project supporters made a tantalizing pitch. The train would allow people to “travel from Los Angeles to San Francisco in about two-and-a-half hours for about $50 a person,” they wrote.\n\nOf course, the cost overruns began soon after, eventually ballooning to $77 billion in 2018. That was enough for newly elected Gov. Gavin Newsom. Earlier this year, he announced the project was moving forward on a reduced scale. It’s now supposed to run from Merced, population 83,000, to Bakersfield, population 381,000. That doesn’t have quite the same ring as a line connecting Los Angeles and San Francisco.\n\nThis 119-mile project will cost $20 billion — pending future cost overruns. For perspective, Nevada’s two-year general fund budget is around $9 billion.\n\nLast month, the L.A. Times had a long piece detailing the ins and outs of this fiasco. Despite the ability to use eminent domain to condemn land, the California High-Speed Rail Authority still needs to acquire hundreds of plots of parcels. It also must manage the land it has already acquired.\n\n“It owns toxic waste sites, vacant lots and rental homes,” Ralph Vartabedian wrote in the Times. “The California High-Speed Rail Authority is now a player in the agriculture industry with at least 466 acres of land under cultivation, a side effect of having to purchase entire fields just to acquire a corner for the rail route.”\n\nAn official with a contracting company working on the project has said the authority has delayed its efforts 48 times. The company is considering asking for up to $600 million in delay claims, in addition to what the state has already paid out for past delays. These bureaucratic hiccups will double the cost of its original $1 billion contract. Also, one of its consultants has been suspended from the project because of an ongoing state ethics investigation.\n\n“I am going to ride this train, but I am afraid it is going to be my ashes in an urn,” one middle manager on the project told the Times. “I told my kids to take my ashes on the bullet train.”\n\nWhat a perfect encapsulation of this government boondoggle.", "description": "California’s bullet train won’t be carrying passengers anytime soon, but it has one practical use. It’s a tangible illustration of what happens when political promises meet reality.", "authors": ["Las Vegas Review-Journal"], "top_image": "https://www.reviewjournal.com/wp-content/uploads/2019/10/12861807_web1_bulletfresnoweb.jpg", "published_at": "2019-10-21"}