{"pub": "cnbc", "url": "https://cnbc.com/2019/09/09/lizzo-almost-quit-music-the-day-she-released-her-no-1-billboard-hit.html", "downloaded_at": "2019-09-09 23:18:43.340892+00:00", "title": "Lizzo says she almost quit music the day she released her now No. 1 Billboard hit", "language": "en", "text": "Billboard's latest chart-topper is a sleeper hit that almost never was — but thanks to Lizzo's grit (and a supportive producer), it's reached everyone from pop stars to former presidents and the rest of us in between. In a recent interview with Elle, the magazine's October cover star shares that the day she released her now No. 1 Billboard single \"Truth Hurts,\" Lizzo almost quit the music industry altogether. \"I just felt like I was throwing music into the world and not even making a splash,\" she tells Elle. \"A tree was falling in the forest and not making a sound, you know? I was crying in my room all day.\" She texted her producer to admit how demoralized she felt by her career as a solo artist and the music industry in general, believing that if she stopped making music, no one would care. In response, her producer came to her apartment to give the artist a pep talk. Lizzo recalls her producer consoling her: Even if her music didn't feel important to the world, it was important to the two of them. \"I just made the decision to keep going as an artist,\" the rapper, singer and classically-trained flutist continues. \"And I'm so grateful I did, but it was by the skin of my teeth.\" Lizzo's decision to keep pursuing music that day in 2017 would pay dividends just two years later.\n\nI just felt like I was throwing music into the world and not even making a splash. A tree was falling in the forest and not making a sound, you know? Lizzo\n\nThis year, Lizzo has made waves with her breakthrough album \"Cuz I Love You,\" which recently climbed to the No. 4 spot on the Billboard 200 chart. She's delivered show-stopping performances at Coachella, the BET Awards, MTV Video Music Awards and Today show stages. She attended the Met Gala, toured the U.S., dropped multiple viral music videos, became an Urban Decay brand ambassador and will appear in the movie \"Hustlers,\" out Sept. 13. And tying it all back to that pivotal track in 2017, \"Truth Hurts\" reached No. 1 on the Billboard Hot 100 this week, making Lizzo the first black woman to have a chart-topper in 2019. She's one of only a handful of black women who've reached the milestone in the past decade, joining the likes of Beyoncé, Rihanna, Janelle Monáe and Cardi B. \"Now the song that made me want to quit is the song that everyone's falling in love with me for,\" Lizzo tells People, \"which is such a testament to journeys: Your darkest day turns into your brightest triumph.\" Lizzo, born Melissa Jefferson in Detroit, moved to Houston at age 10 and became interested in performing music as a teenager. She formed a rap group with her friends when she was 14 and went on to study music at the University of Houston. At 21, Lizzo spent a year living in her car as she tried to break into the music industry. She moved to Minneapolis in 2010, where she began making a name for herself as a member of the rap/R&B groups The Chalice and GRRRL PRTY. Through this work, she was invited to record with the Mill City's own Prince. \"Prince was the first person to really make me feel validated as an artist when I heard that track,\" Lizzo tells NPR of being featured on the song \"Boy Trouble\" for Prince's 2014 album \"Plectrumelectrum.\" \"And I got paid! My first big check ever. Thank you, Prince, for my laptop.\"\n\nThe years of hard work since have involved a permanent relocation to Los Angeles and breakout EP with Atlantic Records, \"Coconut Oil,\" in 2016. Now, with her first full-length album under her belt, Lizzo, 31, shows no signs of stopping. Her genre-defying sound is as infectious as it is joyous, often featuring messages of self love, empowerment, inclusivity and body positivity. The social-media savvy star has been open with fans about dealing with depression and learning to be both vulnerable and communicative about her feelings. In June, she wrote in an Instagram post about feeling depressed and having no one to turn to for support; she immediately found that support in the form of fan messages. \"I learned in the last 24 hours that being emotionally honest can save your life,\" Lizzo wrote in an Instagram post. \"Reaching out may be hard, but as soon as I did it, I was immediately covered in love.\" Making a positive impact among her fan base is core to what drives the artist. She tells Elle that even if a follow-up album to \"Cuz I Love You\" doesn't see the same critical acclaim, she'll still be grateful for the experience so long as she can still spread her message to those who need to hear it: \"I've been touring for a long time — why would that stop? I'm gonna continue to do that forever.\" Regardless of what kinds of stages she'll take following a successful year, Lizzo plans to continue putting her art and authentic self in the center. As she tells Rolling Stone: \"When you're an artist, your career isn't defined by trends or age. That's the biggest lesson I learned from Prince: Perpetuate positivity, and also art is forever. Be eternal.\" Like this story? Subscribe to CNBC Make It on YouTube! Don't miss: YouTube star Lilly Singh on the 'all or nothing' attitude that helped her land a late-night show", "description": "\"I just felt like I was throwing music into the world and not even making a splash,\" she tells Elle.", "authors": ["Jennifer Liu"], "top_image": "https://image.cnbcfm.com/api/v1/image/106116459-1567787223798gettyimages-1171608161.jpg?v=1567787602", "published_at": "2019-09-09"}