{"pub": "cbc", "title": "CBC Radio", "url": "https://cbc.ca/radio/asithappens/antique-dildo-will-stay-in-ireland-after-sex-shop-owner-campaigns-to-save-it-1.5230262", "language": "en", "published_at": "2019-07-30", "downloaded_at": "2019-09-02 07:18:31.214064+00:00", "text": "Transcript\n\nWhen Shawna Scott saw an advertisement for a Victorian-era dildo, she couldn't believe her luck.\n\nThat's because two years ago, she thought the piece of Irish history had left the country forever.\n\n\"I've been kind of, like, obsessed with this dildo,\" the Dublin-based owner of the online sex shop Sex Siopa told As It Happens guest host Rosemary Barton.\n\nAccording to Matthew Fine Art Auction, the sex toy was carved out of ivory in the 18th century and sent from China, where its owner was fighting in the 1899 Boxer Rebellion, to his wife in Ireland.\n\n\"I guess that was just a thing that people did back then when they weren't sure if they were going to come home,\" Scott said.\n\n'This will be a dildo for Ireland'\n\nIn 2017, the 130-year-old ivory sex toy — known as Lot 475 — was sold to a private collector from the United States for $4,695.97 Cdn.\n\nIt was billed at the time as an \"antique carved ivory ladies' companion in scarlet lined leather upholstered carry box with inset bevelled glass panel.\"\n\nShawna Scott is the proud new owner of a Victoria-era dildo. (Ruth Connolly)\n\n\"I was absolutely devastated that it was going to be leaving the country because we don't have a whole lot of, like, Irish sexual history artifacts, \" Scott said.\n\n\"Our museums tend to prioritize things that have to do ... with the [Great Famine] or the 1916 Easter Rising, stuff to do with the revolution, and not so much our own sexual history.\"\n\nBut it wasn't over yet.\n\nOn July 27, Scott received an email from a customer with a link to an auction house out of Cork — and a very unique sale.\n\n\"I thought, 'Oh my god, I think it's the same dildo,'\" she said.\n\nScott says that the original buyer was likely unable to bring the piece to the U.S. because of an Obama-era ban on ivory imports, meaning she was able to buy it at a bargain price.\n\nThat's when Scott decided to start a Twitter campaign to keep the piece of Irish history in the country.\n\nFOLKS! WE DID IT! WE WON THE DILDO FOR IRELAND!!!!!!! 🇮🇪🇮🇪🇮🇪🇮🇪 —@SexSiopa\n\n\"I was like, 'Look, I know this is a long shot. Will someone please take me up on this and, like, maybe we can get a few donations going — and if we win, this will be a dildo for Ireland.\"\n\nShe said she received over $1,000 in less than 90 minutes. In the end, she bought the sex toy for about $900 Cdn.\n\n'Something tells me it's going to be a lot smaller'\n\nThe sex toy has a little heart carved at the base of it, where the owner's fingers would lie. There's also a compartment that can store a lock of lover's hair, or where hot water can be added to heat it up.\n\n\"Apparently, it's very romantic,\" Scott said.\n\nThe auction house's description doesn't list the item's dimensions, and Scott hasn't yet seen it up close.\n\n\"The photos make it look massive, but something tells me it's going to be a lot smaller ... when it gets here,\" she said.\n\nScott hopes to have it verified and placed in a museum. She already has offers flooding her inbox from museums, academics and a digital heritage organization that wants to do a 3D scan.\n\n\"That's going to be my next two weeks,\" she said. \"Doing admin work on this ancient dildo.\"\n\nScott said she is excited to receive the sex toy in the mail, and see it in real life.\n\n\"It's going to be like meeting a celebrity,\" she said.\n\nWritten by Sarah Jackson. Produced by Morgan Passi.", "description": "Shawna Scott is over the moon that she got her hands on a Victorian-era sex toy — and saved a piece of Irish history at the same time.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5230425.1564507835!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_620/antique-victorian-dildo.jpeg"}