{"pub": "breitbart", "url": "https://breitbart.com/news/turkeys-offensive-into-syria-more-casualties-displacement", "downloaded_at": "2019-10-11 08:16:02.114511+00:00", "title": "Turkey’s offensive into Syria: More casualties, displacement", "language": "en", "text": "AKCAKALE, Turkey (AP) — Turkish forces pushed deeper into northeastern Syria on Friday, the third day of Ankara’s cross-border offensive against Syrian Kurdish fighters that has set off another mass displacement of civilians and met with widespread criticism from the international community.\n\nThere were casualties on both sides and Turkey reported its first military fatality, saying a soldier was “martyred” in the fighting.\n\nEarlier, at least six civilians were reported killed in Turkey and seven in Syria have been killed since Ankara this week launched the air and ground operation into Syria’s northeast, after President Donald Trump opened the way by pulling American troops from their positions near the border and abandoning U.S.-allied Syrian Kurdish fighters.\n\nTrump’s unexpected decision came as he faces an impeachment inquiry at home and drew swift criticism from Republicans and Democrats in Congress, along with many national defense experts who say it’s endangered not only the Syrian Kurds and regional stability but U.S. credibility as well. The Syrian Kurdish militia was the only U.S. ally in the campaign that brought down the Islamic State group in Syria.\n\nTrump warned Turkey to act with moderation and safeguard civilians. But the barrages of the invasion so far showed little sign of holding back.\n\nIn Syria, residents fled with their belongings loaded into cars, pickup trucks and motorcycle rickshaws, while others escaped on foot. The U.N. refugee agency said tens of thousands were on the move, and aid agencies warned that nearly a half-million people near the border were at risk — in scenes similar to those from a few years ago, when civilians fled the Islamic State group militants.\n\nThe Turkish ministry statement reported the death of a soldier also said three soldiers were wounded in the action but didn’t provide details. Separately, the ministry said 49 more “terrorists” were “neutralized” in the incursion, in reference to Syrian Kurdish fighters. It said the total number of Kurdish fighters killed so far numbers 277. Those figures could not be independently verified.\n\nTurkey considers the Syrian Kurdish fighters terrorists linked to a Kurdish insurgency within Turkey and says the offensive is necessary for national security.\n\nTurkish officials said the Kurdish militia has fired dozens of mortars into Turkish border towns the past two days, including Akcakale, killing at least six civilians, including a 9-month-old boy and three girls under 15. On the Syrian side, seven civilians and eight Kurdish fighters have been killed since the operation began, according to activists in Syria.\n\nThe Turkish Defense Ministry said the offensive was progressing “successfully as planned.” A Kurdish-led group and Syrian activists said that despite the bombardment, Turkish troops had not made much progress on several fronts they had opened. But their claims could not be independently verified.\n\nAs the incursion drew widespread criticism, Turkish President Recep Tayyip Erdogan warned the European Union not to call Ankara’s incursion into Syria an “invasion.” He threatened, as he has in the past, to “open the gates” and let Syrian refugees flood into Europe.\n\nTurkish Foreign Minister Mevlut Cavusoglu has said the military intends to move 30 kilometers (19 miles) into northern Syria and that its operation will last until all “terrorists are neutralized.”\n\n__\n\nAssociated Press writer Suzan Fraser in Ankara, Turkey, contributed to this report.", "description": "AKCAKALE, Turkey (AP) — Turkish forces pushed deeper into northeastern Syria on Friday, the third day of Ankara's cross-border offensive against Syrian", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/11/8e1fcd_turkey-us-syria-52214-in-photo-turkish-border-turkey-syria-in-akcakale-sanliurfa-640x335.jpg", "published_at": "2019-10-11"}