{"pub": "washingtonpost", "url": "https://washingtonpost.com/podcasts/post-reports/the-city-didnt-need-another-statement-of-failure-baltimore-still-reeling-after-freddie-gray?tid=aud_hpto_postreportslnch", "downloaded_at": "2019-09-14 01:41:20.218969+00:00", "title": "‘The city didn’t need another statement of failure’: Baltimore still reeling after Freddie Gray", "language": "en", "text": "Aaron Blake shares his takeaways from the third Democratic debate. And Erin Cox describes the healing and reawakening of Baltimore after the death of Freddie Gray.\n\nPost Reports is the daily podcast from The Washington Post. Unparalleled reporting. Expert insight. Clear analysis. Everything you’ve come to expect from the newsroom of The Post -- for your ears.\n\nWinners and losers from the third Democratic debate\n\nDemocratic presidential candidates met in Houston on Thursday night for their third debate of 2019, this time all on one night.\n\n\n\n\n\nBased on their performance, politics reporter Aaron Blake says, “this was a step in the right direction” for Democrats worried about how their favorite candidates might shape up in debates against President Trump. “We didn’t really see any candidates have really awful moments like we have seen in some of these debates.”\n\n\n\n\n\nMore on this topic:\n\n\n\n\n\nA ‘fascinating and complex and heartbreaking place’\n\nThis week marked President Trump’s first visit to Baltimore since he described the city as “hell” and a “disgusting, rat and rodent infested mess” where “no human being would want to live.”\n\n\n\n\n\nHis critique was not well received in the city that is still healing from the 2015 death of 25-year-old Freddie Gray while in police custody. Since then, the city has been forced to reckon with its racial and economic inequities under the national spotlight.\n\n\n\n\n\nTens of millions of dollars poured into the city after Gray’s death, says Maryland politics reporter Erin Cox : “There was this rush of people at every level of government and community deciding they were going to help finally address the systemic issues of poverty and racism.”\n\n\n\n\n\nBut four years later, vague promises and fading media attention has left the city back where it started.\n\n\n\n\n\n“When you make an impossible promise, they tend to be impossible to keep,” Cox says.\n\n\n\n\n\nMore on this topic:", "description": "Aaron Blake shares his takeaways from the third Democratic debate. And Erin Cox describes the healing and reawakening of Baltimore after the death of Freddie Gray.", "authors": [], "top_image": "https://www.washingtonpost.com/pbox.php?url=https://podcast.posttv.com/podcast/20190913/t_1568395889869_name_6UKQLFPLXZHLFFWJHZDY36FGFY.jpeg&w=1484&op=resize&opt=1&filter=antialias&t=20170517", "published_at": "2019-09-13"}