{"pub": "reuters", "url": "https://reuters.com/article/us-eu-corruption/great-expectations-but-eus-first-fraud-prosecutor-undaunted-by-challenge-idUSKBN1X717Z", "downloaded_at": "2019-10-28 13:40:05.741311+00:00", "title": "'Great expectations', but EU's first fraud prosecutor undaunted by challenge", "language": "en", "text": "BUCHAREST (Reuters) - Romanians regularly stop Laura Codruta Kovesi in the street to shake her hand or to be photographed with the woman who for five years led the country’s fight against corruption.\n\nFILE PHOTO: Laura Codruta Kovesi, who has been appointed the first fraud prosecutor for the European Union, reacts during an interview with Reuters in Bucharest, Romania, October 24, 2019. Picture taken October 24, 2019. Inquam Photos/Octav Ganea via REUTERS\n\nHer work as the head of Romania’s DNA anti-corruption agency, which secured convictions of mayors, lawmakers and ministers, won Kovesi many admirers in her homeland and in the rest of the European Union.\n\nIt also earned the wrath of the center-left government, and she was driven out of office in July last year. But government opposition to her candidacy was not enough to prevent Kovesi being confirmed this month as the EU’s first fraud prosecutor.\n\nShe starts the job next month, but warns against expecting immediate results from the new European Public Prosecutor’s Office (EPPO) she will lead in the battle against fraud and corruption affecting the EU budget.\n\n“I think there will be very high expectations once the institution effectively starts working on cases,” Kovesi, 46, told Reuters in an interview. “But I think people must understand that credible results will come in two, three years, once final verdicts from courts start coming in.”\n\nRomania’s government has come under fire in the EU over changes to judicial legislation and staffing that have undermined the rule of law and weakened the fight against entrenched corruption.\n\nBut Kovesi, who is likely to start in her new role on Nov. 4, makes clear she will not be daunted by pressure from anyone.\n\n“There will certainly be pressure - once investigations start - on the institution and prosecutors, let’s not forget that the people using European funds are generally businessmen, some of whom are very powerful,” Kovesi said.\n\n“But I am extremely well trained for it, I am not even a little bit worried about that.”\n\nMULTI-BILLION-EURO BUDGET\n\nThe EU is working on adopting a 2020 budget of nearly 160 billion euros ($177.5 billion). The bloc has lost just under 9 billion euros to tax fraud during 2002-2016, a report by the European Court of Auditors said earlier this year.\n\nDue to be launched in 2020, the EPPO will be geared to investigating and pressing criminal charges in cases crossing the EU’s internal borders, particularly those affecting the budget since November 2017. Twenty-two of the EU’s 28 member states are participating so far.\n\nMuch of the EPPO’s efficacy will depend on Kovesi’s ability to convince member states to give it the prosecutors and resources it needs. Some, such as Hungary, have not joined, saying prosecutorial powers should remain at the national level.\n\nKovesi will run the EPPO from a central office in Luxembourg alongside one European prosecutor from each member state. Investigations will be run by delegated prosecutors nationally.\n\nTheir number will be determined after negotiations with justice ministers and general prosecutors in each state. Kovesi said estimating the number of potential cases EPPO will handle and the number of prosecutors needed in each state are immediate priorities.\n\n“It is possible that in some states, the desire to have more prosecutors is bigger, maybe other states will not want to have that many,” Kovesi said. “There will certainly be talks and negotiations to solve this problem.”\n\nSlideshow (5 Images)\n\nPrior to leading Romania’s anti-corruption agency, Kovesi was the country’s prosecutor general and worked her way up from being a prosecutor in the central Romanian city of Sibiu.\n\nThough she has protection, she still enjoys doing the things she used to do back then — walking, going to the park or gym, and attending church and has no plans to change her life in Luxembourg.\n\n“It is what I applied for, what I wanted,” Kovesi said. “For now my main concern is to ensure the institution has the budget and resources it needs to work.”", "description": "Romanians regularly stop Laura Codruta Kovesi in the street to shake her hand or to be photographed with the woman who for five years led the country's fight against corruption.", "authors": ["Luiza Ilie", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191028&t=2&i=1445839993&w=1200&r=LYNXMPEF9R0Y0", "published_at": "2019-10-28"}