{"pub": "afr", "url": "https://afr.com/companies/manufacturing/tesla-ramps-up-just-as-china-cools-on-electric-vehicles-20191027-p534ni", "downloaded_at": "2019-10-27 04:00:04.159114+00:00", "title": "Tesla ramps up just as China cools on electric vehicles", "language": "en", "text": "Patriotic Chinese motorists can now pre-order a locally-made Tesla Model 3. Erratic boss Elon Musk is banking on demand from Chinese buyers to propel the US company’s growth. It is a pity demand for electric cars is waning in China.\n\nThe rally in Tesla’s US-listed shares that followed Wednesday’s earnings beat therefore looks overly bullish. Lower operating costs and net quarterly profit are a nice surprise. As is often the case, Mr Musk is getting ahead of himself, this time with his plan to conquer the Middle Kingdom.\n\nTesla deserves credit for starting production at its Chinese plant the Gigafactory 3. Sidestepping shipping costs and the uncertainties of the trade war will help it keep prices down.\n\nThis, however, cannot counteract weakening structural support from Beijing. A faster-than-expected economic slowdown has blunted the edge of the country’s previously steely determination to boost buying of so-called “new energy vehicles” (electric and hybrid cars).\n\nAcross China, general auto sales have fallen for 15 months. Given the hefty contribution these revenues make to Chinese GDP, it is easy to see why previous limits on petrol cars have been relaxed.\n\nRange anxiety and poor resale values have damped buyer enthusiasm too. Sales of NEVs fell 34 per cent in September from the previous year. They may fall further next year, when NEV subsidies are phased out.", "description": "It is a good job Mr Musk is fearless and long-term in his thinking. Both qualities are needed when fate decrees that a sales push coincides with a market downturn.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.426%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/54d1abee2ffa7c37479625fe87dfa88f0c8b0c40", "published_at": "2019-10-27"}