{"pub": "metro", "url": "https://metro.co.uk/2019/10/23/nick-grimshaw-djing-loved-pda-inside-cara-delevingnes-raucous-nasty-gal-party-box-10967823", "downloaded_at": "2019-10-23 10:52:52.505385+00:00", "title": "Inside Cara Delevingne’s raucous Nasty Gal launch party at The Box", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nCara Delevingne pulled out all the stops as she launched her Nasty Gal collaboration in style, with a raucous night at The Box.\n\nThe 27-year-old looked incredible for the night, opting for a tailored grey checked blazer with matching trousers.\n\nShe finished the outfit off with a plain white crop top, and plain black heels.\n\nThe model was joined by a string of her famous friends as she partied the night away in Soho, including girlfriend Ashley Benson, Nick Grimshaw, Daisy Lowe and Lottie Moss.\n\nAt one point, Grimmy found himself in the DJ booth as he hopped on the decks as the bash.\n\nAdvertisement\n\nAdvertisement\n\nThe former X Factor judge looked a total natural as he span tracks, while pal Daisy Lowe seemed to have a fabulous time dancing behind him.\n\nCara rocked a matching checked blazer and trousers for the bash (Picture: Backgrid)\n\nNick Grimshaw got up on the decks like a pro (Picture: Getty)\n\nDaisy Lowe definitely still has those Strictly Come Dancing moves (Picture: Getty)\n\nSide note: She’s definitely still got those Strictly Come Dancing moves.\n\nDespite it being Cara’s big night, an insider revealed she ‘didn’t leave’ Ashley’s side all night, packing on all the PDA with the Pretty Little Liars actress.\n\nAfter they were seen having a quick kiss in the DJ booth, a source told Metro.co.uk: ‘Cara didn’t leave Ashley’s side even though it was her night.\n\n‘She made sure Ashley was with her the whole time.\n\nAshley Benson was a total proud girlfriend on the night (Picture: Getty)\n\nLottie Moss joined the bash (Picture: Getty)\n\nElla Eyre and Vanessa White also partied with the model (Picture: Getty)\n\n‘They seem totally loved up, they only have eyes for each other.’\n\nBut the supermodel managed to tear herself away from the dancefloor to share a video by a fish tank, to promote her upcoming collaboration, which launches on 23 October.\n\n‘Hey guys I’m here with my friends celebrating at The Box for the new Nasty Gal collection that is coming out tomorrow,’ she told her 43.5million followers.\n\n‘Check it out and I will see you there.’\n\nLottie Tomlinson looked chic as she got involved with the celebrations (Picture: Getty)\n\nCara’s Nasty Gal collaboration comes out on 23 October (Picture: Getty)\n\nCara and Ashley kept their heads down as they left the party (Picture: Backgrid)\n\nWhile we’re not sure entirely what relevance the fish tank has, we’re still into it.\n\nAdvertisement\n\nAdvertisement\n\nCara’s 40-piece range – yes, 40 different outfits – comes complete with leopard print, faux fur coats, slogan t-shirts and silk skirts.\n\nAnd we want every single piece.\n\nSpeaking about the collection, she said: ‘I am so excited to get to join Nasty Gal in this new part of their brand journey.\n\n‘It’s such an exciting time to be working with them.\n\n‘It’s empowering to select pieces of clothing to illustrate how you feel on the inside on any given day.’\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Gladiators star Cobra admits he was drunk during filming\n\nMORE: Logan Paul channels inner Rocky as he gets ripped for KSI rematch", "description": "Cara Delevingne pulled out all the stops as she launched her Nasty Gal collaboration in style, with a raucous night at The Box", "authors": ["Rishma Dosani"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_91429883_1571821654.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-23"}