{"pub": "news.com.au", "url": "https://news.com.au/national/nsw-act/news/toddler-hit-by-ute-in-driveway-of-taree-home-dies-in-hospital/news-story/96710f82d16d6c6e19260d9178ed9a3f", "downloaded_at": "2019-10-22 20:39:34.395631+00:00", "title": "Toddler death, Taree: Girl hit by ute in NSW driveway dies in hospital", "language": "en", "text": "Are you the perfect driver? If not, here are some road rules you mightn't have known about and have probably broken.\n\nAussie road rules you’ve probably never heard of\n\nA toddler has died after she was hit by a ute in the driveway of a home on the NSW mid north coast.\n\nEmergency services were called out to the property at Taree about 5pm on Tuesday following reports a 20-month-old girl had been struck by a Holden Rodeo.\n\nThe little girl was treated at the scene then taken to Manning Rural Referral Hospital where she died.\n\nPolice today said the male driver of the ute, a 24-year-old man, was taken to hospital for blood and urine testing.\n\nA crime scene was established at the home and investigations are continuing into the circumstances surrounding the fatal crash.\n\nA report will be prepared for the coroner.\n\nIt has been a shocking month nationwide for such deaths.\n\nIn South Australia, a two-year-old girl died from serious injuries sustained when she was run over in the driveway by a 4WD being driven by a family member.\n\nShe was struck on Range Rd in Parawa on October 5 but was pronounced dead the following day, SA Police said in a statement.\n\nMeanwhile, a three-year-old girl named Charlotte was killed when the family car rolled backwards and struck her outside an Epping childcare centre in Melbourne’s north on October 14.\n\nCharlotte’s mother was tending to her other children in the back seat when the vehicle started moving. The 26-year-old was knocked to the ground and hospitalised for her injuries.\n\nMore to come", "description": "A toddler has died after she was hit by a ute in the driveway of a home on the NSW mid north coast.", "authors": ["Sarah Mcphee"], "top_image": "https://cdn.newsapi.com.au/image/v1/14fcbf3ff5955b7028bf288646eb98e0?width=650", "published_at": "2019-10-22"}