{"pub": "fox", "url": "https://foxnews.com/media/cms-administrator-socialist-options-would-eviscerate-medicare", "downloaded_at": "2019-10-04 23:56:43.726842+00:00", "title": "Trump administration Medicare official: Sanders and Warren's 'socialist experiments' won't work for seniors", "language": "en", "text": "Centers for Medicare and Medicaid Services (CMS) Administrator Seema Verma said Friday that proposals from 2020 presidential candidates like Senators Elizabeth Warren, D-Mass., and Bernie Sanders, I-Vt., would \"eviscerate\" Medicare.\n\nAppearing on \"America's Newsroom\" with host Bill Hemmer, Verma said President Trump's executive order – which would expand the program's private insurance option – is \"all about demonstrating his vision to protect and secure the Medicare program.\"\n\nIn the executive order, the Trump administration claims his Medicare plan will:\n\nProvide more plan choices and time with providers\n\nStreamline approval of therapies\n\nReform link payments with value\n\nEliminate waste, fraud, and abuse\n\nReduce regulation\n\n‘MEDICARE-FOR-ALL' SPONSOR SAYS PLAN WOULD GUT 1 MILLION PRIVATE INSURANCE JOBS\n\n\"He's just building on the tremendous success that we've already had with the program,\" she told Hemmer. \"President Trump's Medicare program is putting money back into the pockets of seniors. We've lowered out-of-pocket costs for drugs and for doctors' visits.\"\n\nShe added that Medicare Advantage rates were announced at historic lows, citing lower Part D premiums and decreases in drug pricing.\n\nMedicare itself remains popular, but 2020 Democratic presidential candidates' calls to enact a single-payer, government-run system for everyone are far more controversial. Speaking to a retirement community in Florida on Thursday, the president said Democrats want to \"raid Medicare to fund the idea of socialism.\"\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\n\"All of the Democrats' plans would totally devastate our health care plans,\" he exclaimed.\n\nSanders' \"single-payer\" approach would cover people of any age and would incorporate the Medicare program. Private health insurance, including the Medicare Advantage option used by about one-third of seniors, would no longer have a role.\n\nSanders, who underwent a heart procedure this week, has argued that \"Medicare-for-all\" would offer seniors broader benefits and lower costs.\n\n\"In all of these versions, whether it's 'Medicare-for-all' or the public option ... what they're talking about is a government takeover of our private health care system stripping 180 million Americans from private coverage and putting them into a government-run program,\" Verma explained.\n\n\"What we've seen from other countries that have tried these socialist experiments is that that leads to reductions in care, reduced access, long wait times, and rationing of care,\" she said.\n\nFELLOW 2020 CANDIDATE CALLS BERNIE'S 'MEDICARE-FOR-ALL' PLAN A 'LOSING BATTLE' THAT WILL SET COUNTRY BACK 10 YEARS\n\n\"These types of options that we're hearing from people, would eviscerate the Medicare program. and, it would put our seniors in a situation where they're waiting in line for their care,\" Verma stated.\n\n\"President Trump has a very different vision,\" she concluded. \"He wants to strengthen and protect the Medicare program, make it better for seniors.\"\n\nThe Associated Press contributed to this report.", "description": "CMS Administrator Seema Verma said Friday that proposals from 2020 Democratic Socialist presidential candidates like Senators Elizabeth Warren, D-Mass., and Bernie Sanders, I-Vt., would \"eviscerate\" Medicare.", "authors": ["Julia Musto", "Julia Musto Is A Reporter For Foxnews.Com"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Sanders-Warren-AP.jpg", "published_at": "2019-10-04"}