{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/7/jay-gruden-fired", "downloaded_at": "2019-10-07 12:13:54.150291+00:00", "title": "Redskins fire Jay Gruden; Bill Callahan expected to be named interim coach", "language": "en", "text": "The Washington Redskins fired Jay Gruden on Monday, a day after a 33-7 loss to the New England Patriots.\n\nGruden, who was hired in 2014, was in his sixth year with the team, the longest tenure of any Redskins coach under owner Dan Snyder. But the 52-year-old entered the year on shaky footing and the season got out of hand quickly.\n\nOffensive line coach Bill Callahan, 63, was expected to be named interim head coach later Monday.\n\nThe Redskins are 0-5 and have lost 11 of their last 12 dating back to last season, when quarterback Alex Smith suffered a season-ending broken leg.\n\nGruden’s removal had been rumored for weeks as losses piled up and Washington got off to its worst start since 2001.\n\nAsked about his status following Sunday’s loss, Gruden said he had not been told anything and would show up to work as long as his key worked.\n\nGruden finished with a record of 35-49-1. The Redskins made the playoffs just once in that span, last making it during the 2015 season.\n\nGruden finished with a record of 35-49-1 from 2014 through Sunday. The Redskins made the playoffs just once in that span, last making it during the 2015 season.\n\nInternally, the Redskins had hoped a retooled offense and a young, talented defense would carry them in 2019, but that quickly proved not to be the case.\n\nGruden knew 2019 would be a make-or-break year. In May, he joked with reporters that if he didn’t make the playoffs this season, he’d be out of a job.\n\nWith his future uncertain, Gruden seemed determined to go about his final months doing things his way.\n\nWhen the Redskins took Dwayne Haskins with the 15th overall pick in April, Gruden said the rookie needed development before being ready to play in the NFL.\n\nThere were pre-draft reports that Gruden preferred Duke’s Daniel Jones, a more experienced starter, or wanted the Redskins to use the 15th pick on a different position entirely.\n\nAs the season began, Gruden immediately incited controversy. For the season-opener, he benched running back Adrian Peterson, making the 34-year-old inactive after second-year back Derrius Guice had won the starting the job. The move was unpopular in the team’s locker room, especially among the team’s veterans.\n\nThree weeks later, Gruden came under fire for his handling of Haskins.\n\nDown 14 points to the New York Giants, Gruden turned to the rookie in a moment of desperation and hope that Haskins could provide a spark. But Haskins struggled, throwing three interceptions in the 24-3 loss.\n\nAfter the game, Gruden re-opened the team’s quarterback competition — and refused to call Haskins the future of the franchise. “He’s got to earn that right first,” he said.\n\nOutside the organization, with the Redskins 0-4, experts and fans tore into Gruden. ESPN analyst Louis Riddick blasted the coach for playing Haskins against the Giants, suggesting the Ohio State product was being set up for failure. ESPN’s Stephen A. Smith said Gruden had “completely quit” on the Redskins.\n\nBut Gruden stuck to his convictions — taking jabs at his critics along the way.\n\n“No matter what we do with (Haskins), we’re going to be wrong, so it doesn’t really matter,” Gruden said. “My view is that I’ve got to do what’s best for him and what’s best for this football team and what I think is best.”\n\nFinally, Gruden announced Friday the Redskins would start Colt McCoy — not Haskins — against the Patriots.\n\nThat decision, too, was seen as an act of lashing out. By not turning to the rookie, Gruden went with the quarterback he had favored over his six seasons as coach. Like Gruden, McCoy arrived to Washington in 2014 and knew the offense inside and out. If Gruden was going to go down, he’d do it with his preferred quarterback.\n\nMcCoy wasn’t enough to save his job and the Redskins again looked disorganized in Sunday’s loss.\n\nMonday’s firing didn’t come as a surprise, but it was startling to Gruden struggle this season with the dysfunction surrounding the organization.\n\nThroughout his first five years, the 52-year-old routinely navigated obstacles — from quarterback controversies to off the field incidents to a plethora of injuries.\n\nOver the course of 2017 and 2018, the Redskins had a combined 49 players on injured reserve, a league-high. Gruden kept his composure through it all and his players responded by playing with effort, even if they were overmatched.\n\nGruden’s easy-going demeanor, though, drew criticism, including from a few players.\n\nFormer safety D.J. Swearinger ripped the Redskins for, in his view, not practicing hard enough during the week. But other players generally appreciated Gruden’s approach, calling him a player’s coach who could also get serious when needed.\n\nIn 2014, Washington hired Gruden following a fractious season with former coach Mike Shanahan and quarterback Robert Griffin III. Gruden was chosen in hopes he would revive Griffin’s career, given his success with Bengals quarterback Andy Dalton the year prior.\n\nGruden, though, did not mesh with Griffin. The Redskins finished 4-12 in 2014 and the following season, Gruden turned to Kirk Cousins as the team’s full-time starter. With Cousins at the helm, Washington made the playoffs in 2015 — going 9-7 en route to winning the NFC East.\n\nBut the success was short-lived. The Redskins slipped back to the pack, and off-the-field drama involving Cousins’ contract led to the quarterback’s departure in the 2018 offseason.\n\nThe Redskins replaced Cousins with Smith, a reliable veteran who helped Washington get off to a 6-3 start before breaking his leg against the Houston Texans.\n\nSince Smith’s injury, the Redskins have played five quarterbacks.\n\n“You would love to have some continuity (quarterback), some consistency there,” Gruden said last week. “Unfortunately, we have not had that luxury here in a while.”\n\nIf the Redskins do find that luxury, if Haskins does establish himself as the franchise’s savior, Gruden won’t be around to see it.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The Washington Redskins fired Jay Gruden on Monday, a day after a 33-7 loss to the New England Patriots, ousting the figure who was the longest-tenured coach under owner Dan Snyder.", "authors": ["The Washington Times Http", "Matthew Paras"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/06/Patriots_Redskins_Football_59139.jpg-3ee62_c0-176-4206-2628_s1770x1032.jpg?75bf4eab8b0f692aab80dc62509a0f1d3dfe65be", "published_at": "2019-10-07"}