{"pub": "news24", "url": "https://food24.com/News-and-Guides/Features/5-elements-of-japanese-food-etiquette-that-might-shock-you-20191011", "downloaded_at": "2019-10-11 13:00:36.257106+00:00", "title": "5 elements of Japanese food etiquette that might shock you", "language": "en", "text": "5 elements of Japanese food etiquette that might shock you Asia is on every foodie’s radar right now. If you’re in Japan or perhaps planning a trip there, don’t be caught off guard. by: Tessa Purdon | 11 Oct 2019\n\n\n\n\n\nJapan has become a trendy bucket-list travel destination in the last few years and with the 2019 Rugby World Cup currently taking place in The Land of the Rising Sun, the country and its culture has certainly been in the spotlight.\n\n\n\n\n\nAsk any traveler to Asia about their favourite part of the trip and it will inevitably include food – and about how exotic and incredibly different it is to what they’re used to eating at home. There are the ingredients themselves that are vastly foreign and intriguing, but also the cultural norms that go with eating them.\n\n\n\nVisiting Japan this year? We’ve listed a few customs in Japanese food culture that you should be aware of when you’re there.\n\n1. Slurping is a sign of appreciation\n\nWhile many cultures would see this as rude, slurping food and making a sound when doing it signals that you’re enjoying the meal. From a sensory standpoint, it’s also said to enhance the dish’s flavours.\n\n\n\n2. Don’t leave chopsticks standing vertically in a bowl\n\nWhile this is often an innocent habit, it is in fact a symbolic gesture at Japanese funerals – a bowl of rice is left with two chopsticks standing vertically in the center.\n\n\n\n3. Doggie bags don’t exist\n\nToo full to finish your meal and want to take the rest home with you? The answer will generally be no, as doggie bags aren’t offered in Japan. So eat it or leave it.\n\n\n\n4. Taking your shoes off isn’t seen as rude or strange\n\n\n\nThe restaurants with tatami flooring (a type of mat), require guests to remove their shoes and wear special slippers that the establishment provides.\n\n\n\n5. Tipping in Japan is considered rude\n\nThe Japanese take offence when being given a tip, as it insinuates that the person being tipped doesn’t earn enough or that the business/restaurant is going through hard times.\n\nALSO READ: Why is rooibos tea suddenly big in Japan?\n\nImages via Unsplash\n\nSources:\n\nNomiya Restaurant\n\n\n\nFluentU\n\n\n\nReal Estate Tokyo\n\n\n\nTripsavvy.com\n\nRead more on: features | travel | asian | cuisine", "description": "Asia is on every foodie’s radar right now. If you’re in Japan or perhaps planning a trip there, don’t be caught off guard.", "authors": ["Tessa Purdon"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9464/6a30bdfde09a45b2a9ca85afa5cc6d47.jpg", "published_at": "2019-10-11"}