{"pub": "npr", "title": "House Passes Resolution To Block Trump's National Emergency Declaration", "url": "https://npr.org/2019/02/26/698345376/house-passes-resolution-to-block-trumps-national-emergency-declaration", "language": "en", "published_at": "2019-02-26", "downloaded_at": "2019-09-02 07:28:09.474327+00:00", "text": "House Passes Resolution To Block Trump's National Emergency Declaration\n\nEnlarge this image toggle caption Guillermo Arias/AFP/Getty Images Guillermo Arias/AFP/Getty Images\n\nThe Democratic-led House approved by a 245-182 vote a resolution on Tuesday that would terminate President Trump's declaration of a national emergency at the U.S.-Mexico border — a declaration he made to allow him to access funds to build a wall without congressional consent.\n\nOnly 13 Republicans joined Democrats to oppose the president, signaling that Congress will not ultimately have the veto-proof margin required to override Trump.\n\nThe resolution now heads to the Senate. It is a privileged measure, which means it is not subject to a filibuster, needs only a simply majority and is required to come to the floor for a vote within weeks. Senate Majority Leader Mitch McConnell, R-Ky., told reporters on Tuesday that he expects the Senate will vote on it before March 18.\n\nSo far only three Senate Republicans — Susan Collins of Maine, Lisa Murkowski of Alaska, and Thom Tillis of North Carolina — say they will vote with Democrats in opposition to the president's actions.\n\nThe Republican-led Senate is split 53-47, which means Democrats need one more vote in addition to Collins, Murkowski and Tillis for the measure to pass. McConnell declined to handicap the vote, but other members of Senate leadership including Sen. John Barrasso, R-Wyo., said they expect it to pass the Senate.\n\nVice President Pence and a Justice Department lawyer huddled privately with Senate Republicans for their weekly Tuesday meeting that was dominated by debate over the president's legal authority to use his emergency powers as he has to find funding for a border wall.\n\nMcConnell characterized it as a \"robust, vigorous\" discussion and said he had not \"reached a total conclusion\" over the legality of the president's actions. However, McConnell has already publicly committed to voting against the resolution in support of the president's position.\n\nThe White House asserts that the president has the legal authority to declare a national emergency and to redirect existing federal funds to address that emergency. Congress did approve $1.375 billion for new physical barriers along the border in a spending bill approved earlier this month, but it was less than the White House requested. Soon after, the president declared a national emergency to redirect more than $6 billion to build additional barrier.\n\nIf the resolution reaches his desk, it will be the first veto of Trump's presidency. House Minority Whip Steve Scalise, R-La., told reporters that Congress will not be able to block Trump's emergency declaration. \"When you see the vote today there will be nowhere near the votes to override a veto,\" he said, \"Ultimately we are gonna stand with the president in making sure we can secure this border and confront this national crisis that's taking lives every single day.\"\n\nA coalition of 16 states has filed suit against the Trump administration to try to block his emergency declaration. Speaker Nancy Pelosi, D-Calif., and Senate Minority Leader Chuck Schumer, D-N.Y., have also said they will challenge the national emergency declaration in court, setting up a potential constitutional test over the balance of power between the legislative and executive branches of government.", "description": "Democrats are also planning court challenges to fight the president's use of executive authority to redirect federal funds and build a wall along the U.S.-Mexico border.", "authors": ["Susan Davis"], "top_image": "https://media.npr.org/assets/img/2019/02/26/gettyimages-1127148974borderart_wide-371cb14ed40e9f2dd75685d30a59562933bba6ee.jpg?s=1400"}