{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/05/WS5d97f4a2a310cf3e3556ed22.html", "downloaded_at": "2019-10-05 13:49:44.352704+00:00", "title": "Wu writes more history with a little Moscow magic", "language": "en", "text": "Espanyol's Wu Lei (right) is beaten to a header by CSKA's Hoerdur Bjoergvin Magnusson during Thursday's Europa League Group H match in Moscow. [Photo/IC]\n\nWu Lei added another impressive achievement to his fast-growing list of firsts on Thursday night.\n\nThe forward became the first Chinese man to score in a major UEFA club competition, excluding the qualifying rounds, by bagging Espanyol's 64th-minute opener in a 2-0 Europa League victory over CSKA Moscow.\n\nChina international Wu acknowledged his latest feat on Weibo, posting pictures of his historic strike and one with him posing with jubilant Chinese fans draped in national flags in the Russian capital, accompanied by the message: \"Thanks!\"\n\nThe 27-year-old has been a big hit at Chinese-owned Espanyol since joining the Barcelona-based side from Shanghai SIPG in January for a reported 2 million euros ($2.25 million).\n\nThe deal saw Wu become the first Chinese to sign permanently for a Spanish top-flight club, with some observers suspicious that the move was motivated more by the player's marketing potential than his ability on the pitch.\n\nHowever, he quickly proved the doubters wrong with another milestone - opening his Spanish account in a March victory over Real Valladolid to become the first Chinese to score in La Liga.\n\nMore goals and assists followed until the end of the season as Wu helped Espanyol out of the relegation mire and to a seventh-place finish, thereby booking a spot in the Europa League qualifiers.\n\nWu also found the net during those preliminary rounds, but will hope Thursday's goal against more illustrious opposition in CSKA, which regularly features in the Champions League, can kickstart his scoring in La Liga this term, beginning with Sunday's trip to Real Mallorca.\n\nEspanyol, with new head coach David Gallego at the helm following the departure of Rubi to Real Betis, has struggled domestically so far this season, with just five points from seven matches to find itself languishing in the relegation zone.\n\nWu sent Espanyol on its way to victory at CSKA Arena by latching on to a Matias Vargas pass before coolly dinking over Russia international goalkeeper Igor Akinfeev.\n\nSubstitute Victor Campuzano made sure of the points in injury time to earn Espanyol a victory that leaves it to second in Group H, two points adrift of Ludogorets, which it faces on Oct 24 in Bulgaria.\n\nEspanyol drew its opening Group H game 1-1 at home to Hungary's Ferencvaros.\n\nWu's goal is not the first by a Chinese national in a men's UEFA club competition. That honor went to Sun Jihai, who registered for Manchester City in a UEFA Cup qualifier against Welsh side The New Saints in August 2003.\n\nIt took another decade for a compatriot to match Sun's achievement: Wang Chu striking in both legs for Luxembourg's Jeunesse Esch as it got the better of Finland's TPS Turku in a 2013-14 Europa League qualifier.\n\nIn addition to being China's first group-stage scorer, Wu matched two other national records on Thursday.\n\nHaving already scored in qualifying for Espanyol, he is now level with Wang Chu as China's top scorer in UEFA club competitions, and playing his eighth European club game means he has also matched former PSV Eindhoven and Austria Vienna man Sun Xiang's record for UEFA competition appearances.\n\nElsewhere, Manchester United's miserable form continued as Ole Gunnar Solksjaer's side was held to a 0-0 draw by Dutch side AZ Alkmaar in The Hague.\n\nAn utterly uninspiring United failed to register a shot on target in the Europa League for the first time as its winless streak on the road stretched to 10 games.\n\nThe English giant was indebted to goalkeeper David de Gea for a string of second-half saves as it escaped with a point. United is second in Group L behind leader Partizan Belgrade on goal difference.\n\nIn London, Arsenal thumped Belgium's Standard Liege 4-0 thanks to two goals from Brazilian teenager Gabriel Martinelli and further strikes from Joe Willock and Dani Ceballos.\n\nThe Gunners top Group F, three points ahead of Liege and Eintracht Frankfurt.", "description": "", "authors": [], "top_image": "http://img2.chinadaily.com.cn/images/201910/05/5d97f4a2a310cf3e979fd3a6.jpeg", "published_at": "2019-10-05"}