{"pub": "hotair", "url": "https://hotair.com/archives/jazz-shaw/2019/09/22/elizabeth-warrens-plan-slash-retirement-funds", "downloaded_at": "2019-09-22 23:11:47.040905+00:00", "title": "Elizabeth Warren’s plan to slash your retirement funds", "language": "en", "text": "Now that Massachusetts Senator Elizabeth Warren is somehow legitimately in contention for the nomination, I suppose we should get more familiar with the policies she’s planning on implementing should this train wreck of a candidate end up in the Oval Office. One area of immediate concern is her antipathy toward capitalism in general and how she plans on making sure employers are “responsible stewards of their communities.” (You might want to make sure you’re sitting down for this one.)\n\nElizabeth Bauer at Forbes has an informative deep dive into a couple of Warren’s policies that will not only have a dramatic effect on employers but on your personal retirement plans as well. It mostly revolves around her grand scheme known as “Accountable Capitalism.” Let’s see how that’s supposed to work.\n\nIt’s a proposal that’s a repeat of legislation she proposed in 2018, the “Accountable Capitalism Act,” which, as it happens, I dug into at the time on another platform. The most nebulous part of the proposal is the notion that large corporations would be obliged to pursue the “best interests” of a long list of entities, not merely shareholders but also employees, suppliers, customers, the local communities where the companies locations are based, and others, with the fundamental premise that such a corporation “shall have the purpose of creating a general public benefit.” But however much writers such as Kevin D. Williamson decried this as “the wholesale expropriation of private enterprise in the United States” this all appears to be aspirational and symbolic, without any enforcement mechanism included in the legislation, or administrative agency named to ensure the corporation is indeed “creating a public benefit.”\n\nThe first thing you might notice, as Bauer points out, is that this anti-capitalist notion of mandating companies to create a “public benefit” is rather toothless on the surface. If there is no enforcement mechanism or punishment for companies that fail to comply, perhaps the damage will be minimized. Also, how does a hypothetical Warren administration plan to define what constitutes a public benefit and how much will each corporation have to spend on that effort? It all sounds more like leftist word salad than any sort of public policy.\n\nBut when you look deeper, some aspects of this plan definitely would have a very real impact on taxpayers. Buried in that proposal is a plan to force all corporations with more than $1 billion in revenue to staff up at least 40% of their board of directors with representatives elected by the employees. Traditionally, board members are major stockholders and their focus is on maximizing corporate revenue to deliver the best return on investment for shareholders.\n\nUnder this new scheme, the board could look into more esoteric aspects of corporate policy and stop worrying quite so much about pesky details like making a profit. As the article notes, Germany already has laws along these same lines and it’s resulted in slower growth and lower stock prices. One estimate suggests that share prices at affected American companies could fall by as much as 25%.\n\nSo how would that impact your average voter? As it turns out, somewhere between 37 and 50 percent of US stocks are held by retirement investment accounts. You know… the people who manage your 401K accounts? If the companies take a 25% hit, so does your retirement nest egg. On top of that, companies making less profit tend to lay people off rather than hiring more. Sounds like Warren has a real recipe for success here. Oh, sorry… I meant to say disaster.\n\nAll of these details also fail to touch on the fact that her policies simply fly in the face of democratic capitalism. Private corporations are not social justice agents. They exist to make a profit with the happy side effect of producing jobs and creating wealth. Trying to turn all of them into social services offices will result in disaster. This point should be brought up loudly and often during the general election.", "description": "For the greater good", "authors": ["Jazz Shaw", "Ed Morrissey", "Karen Townsend", "John Sexton"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/Warren5.jpg", "published_at": "2019-09-22"}