{"pub": "businessinsider", "url": "https://businesstimes.com.sg/banking-finance/singlife-clarifies-deposit-insurance-coverage-for-newly-launched-account", "downloaded_at": "2019-09-23 08:39:01.055215+00:00", "title": "Singlife clarifies 'deposit insurance' coverage for newly launched account", "language": "en", "text": "INSURANCE tech (insurtech) firm Singlife on Monday clarified its marketing collateral for its recently launched Singlife account and debit card promotion to say that the funds in the Singlife account is protected only up to “specific limits”.\n\nEarlier on its website, Singlife had said that the funds in the Singlife account is protected up to S$100,000 by the Singapore Deposit Insurance Corporation.\n\nThe company, which also marketed “free life insurance” as one of the key features of the Singlife account, also revised its marketing terms to say that it provides insurance coverage for death, of up to 5 per cent of the customer’s account value.\n\nThe insurtech firm had last week launched the hybrid product that combines savings, endowment insurance and layoff benefits, as it seeks to expand its reach in financial services.\n\nsentifi.com Market voices on:\n\nLiam McCance, chief marketing officer of Singlife, told The Business Times on Monday that the changes made are in the normal course of doing business. \"At times we make minor adjustments in order to give greater clarity,\" he said.\n\nTo date, the company has secured funding of US$153 million, with backers including big names such as Sumitomo Life Insurance, Aberdeen Standard Investments and US insurer Aflac. Its latest valuation stood at US$358 million.", "description": ": THE BUSINESS TIMES Banking & Finance - INSURANCE tech (insurtech) firm Singlife on Monday clarified its marketing collateral for its recently launched Singlife account and debit card promotion to say that the funds in the Singlife account is protected only up to “specific limits”. . Read more at The Business Times.", "authors": ["Vivien Shiao"], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-09-23"}