{"pub": "yahoo", "url": "https://yahoo.com/entertainment/bethenny-frankel-says-support-daughter-042537794.html", "downloaded_at": "2019-10-09 12:49:17.086797+00:00", "title": "Bethenny Frankel Says 'I Have All the Support I Need' As Daughter Holds Up Star's Breasts", "language": "en", "text": "Bethenny Frankel declares she has all the “support” she needs thanks to her daughter Bryn.\n\nOn Tuesday, Frankel, 48, shared a photo — promoting her Skinnygirl shapewear — of her 9-year-old daughter standing behind her, holding up her mom’s breasts with both hands.\n\n“I have all the support I need,” Frankel captioned the shot, adding “Hands not included with purchase.”\n\n“Get #Skinnygirlshapewear to feel supported AND sexy!” the former Real Housewives of New York City cast member wrote.\n\nFrankel also took the post as an opportunity to encourage women to get their mammogram as October is Breast Cancer Awareness Month.\n\nIn the comment section of the post, some fans raved over the photo, calling Brynn “funny like mommy” and “cute.”\n\n“Mom & daughter goals,” another fan expressed. However, not everyone felt the same and some criticized the star.\n\nThe reality star posted a video of the moment a week ago on her Instagram Stories and the Skinnygirl Instagram, it was deleted off the latter’s social media not long after it was posted.\n\nIn the clip, Frankel explained how much buyers love her Skinnygirl tank tops as Bryn repeatedly squeezed her breasts.\n\n“They come with a 9-year-old. A 9-year-old is going to be shipped to your house with the shapewear to squeeze your boobies when nobody else will,” Frankel said in the video.\n\nFrankel shares Bryn with ex-husband Jason Hoppy.\n\nBethenny Frankel | Cindy Ord/Getty Images More\n\nFrankel is now dating real estate developer and film producer Paul Bernon.\n\nEarlier on Tuesday, Frankel shared a slideshow of photos to Instagram featuring Bernon as the two attended a wedding in Boston, Massachusetts, over the weekend.\n\nRELATED: Bethenny Frankel Is Leaving ‘The Real Housewives of New York City’\n\n“Love is in the air,” Frankel wrote in the caption for the post, adding the hashtags, “Boston,” “Wedding,” “BostonWedding” and “Love.”\n\nWhile Frankel and Bernon were guests this time around, the star recently had fans wondering if she would soon be planning her own wedding after she posted a photo with a large diamond ring on her left ring finger.\n\nHowever, an insider told PEOPLE at the time that “she’s not engaged. She has an amazing jewelry closet.”\n\nNonetheless, Frankel is in good place in her relationship with Bernon. The two celebrated their one-year anniversary last month.\n\n“Having such a supportive and loving partner makes me a better person & inspires me to achieve the impossible,” Frankel wrote in an Instagram tribute to Bernon in September. “Happy Anniversary! I love you and thank you for the most beautiful year! ♥️❌⭕️♥️😘”\n\nRELATED: Bethenny Frankel Says She’s Living ‘in the Moment’ Nearly 1 Year After Dennis Shields’ Death\n\nFrankel’s relationship with Bernon comes after the death of her on-again, off-again boyfriend Dennis Shields.\n\nShields was found dead in his Trump Tower apartment last August of a suspected overdose. He was 51.", "description": "Bethenny Frankel's Daughter Holds Up Star's Breasts in Photo", "authors": ["Robyn Merrett"], "top_image": "https://s.yimg.com/uu/api/res/1.2/OZnNEimZF.0PUIgp7r58gQ--~B/aD02MzA7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/people_218/696d37f736554a67c2b4fae1197cd951", "published_at": "2019-10-09"}