{"pub": "axios", "url": "https://sec.gov/news/press-release/2019-212", "downloaded_at": "2019-10-12 00:21:17.094931+00:00", "title": "SEC Halts Alleged $1.7 Billion Unregistered Digital Token Offering", "language": "en", "text": "FOR IMMEDIATE RELEASE\n\n2019-212\n\nThe Securities and Exchange Commission today announced that it has filed an emergency action and obtained temporary restraining order against two offshore entities conducting an alleged unregistered, ongoing digital token offering in the U.S. and overseas that has raised more than $1.7 billion of investor funds.\n\nAccording to the SEC’s complaint, Telegram Group Inc. and its wholly-owned subsidiary TON Issuer Inc. began raising capital in January 2018 to finance the companies’ business, including the development of their own blockchain, the “Telegram Open Network” or “TON Blockchain,” as well as the mobile messaging application Telegram Messenger. Defendants sold approximately 2.9 billion digital tokens called “Grams” at discounted prices to 171 initial purchasers worldwide, including more than 1 billion Grams to 39 U.S. purchasers. Telegram promised to deliver the Grams to the initial purchasers upon the launch of its blockchain by no later than October 31, 2019, at which time the purchasers and Telegram will be able to sell billions of Grams into U.S. markets. The complaint alleges that defendants failed to register their offers and sales of Grams, which are securities, in violation of the registration provisions of the Securities Act of 1933.\n\n“Our emergency action today is intended to prevent Telegram from flooding the U.S. markets with digital tokens that we allege were unlawfully sold,” said Stephanie Avakian, Co-Director of the SEC’s Division of Enforcement. “We allege that the defendants have failed to provide investors with information regarding Grams and Telegram’s business operations, financial condition, risk factors, and management that the securities laws require.”\n\n“We have repeatedly stated that issuers cannot avoid the federal securities laws just by labeling their product a cryptocurrency or a digital token,” Steven Peikin, Co-Director of the SEC’s Division of Enforcement. “Telegram seeks to obtain the benefits of a public offering without complying with the long-established disclosure responsibilities designed to protect the investing public.”\n\nThe SEC’s complaint, filed today in federal district court in Manhattan, charges both defendants with violating the registration provisions of Sections 5(a) and 5(c) of the Securities Act, and seeks certain emergency relief, as well as permanent injunctions, disgorgement with prejudgment interest, and civil penalties.\n\nThe SEC’s investigation is being conducted by Daphna A. Waxman, Morgan B. Ward Doran, and John O. Enright of the SEC’s Cyber Unit. The case is being supervised by Carolyn Welshhans, Acting Chief of the SEC’s Cyber Unit and Lara Shalov Mehraban, Associate Regional Director of the New York Regional Office. The SEC’s litigation will be led by Jorge G. Tenreiro and Kevin McGrath.", "description": "", "authors": [], "top_image": "", "published_at": "2019-10-11"}