{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/housing-developers-photoshop-roads-havent-20531801", "downloaded_at": "2019-10-07 20:13:35.390004+00:00", "title": "Housing developers 'photoshop' roads that haven’t been completed for 10 years", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA housing developer photoshopped roads which haven’t been completed for 10 years.\n\nMorris Homes built almost 500 houses on the estate but left it without tarmacing the streets.\n\nIt's allegedly left roads broken and muddied in Waterside Village in St Helens, Merseyside.\n\nBut Liverpool Echo shows advertising brochures depict pristine roads fully tarmaced.\n\nOne angry resident, David Lyons, said people are expected to pay Morris Homes between £200 and £500 a year as a service charge which goes towards the “upkeep” of the development.\n\nThe 34-year-old father said: “They finished building on the site earlier this year and numerous times we have been told that they will be completing the roads but they haven’t done it yet.”\n\n(Image: Liverpool Echo)\n\nMr Lyons explained that Morris Homes began building Waterside Village in 2008 before his wife bought a home there in 2009.\n\nAfter they married and had two children together, the couple moved to another home on the development.\n\nHe said: “We were told that the roads would be completed when all the houses were built, but they kept adding to them.\n\n“Because of the work vehicles, the roads are full of pot holes and the kerbs are extremely high.\n\n“People around here have suffered damage to their cars and one neighbour even fell down a manhole that wasn’t properly covered.\n\n(Image: LIVERPOOL ECHO)\n\n(Image: Liverpool Echo)\n\n“We are paying hundreds of pounds for them to ‘cut the grass’ and look after the estate but they refuse to do the one thing we have asked for.”\n\nBut hospital worker David said his neighbours became infuriated when Morris Homes purchased land next to their estate to develop a second phase of Waterside Village.\n\nHe said: “Our estate was clearly so popular that they decided to build another just like it.\n\n(Image: Liverpool Echo)\n\n“So far they have built about 15 homes so we knew they weren’t going to be bothered about sorting out roads.\n\n“The most ridiculous thing they have done though, was use a picture of our estate for their new brochure.\n\n“It shows a row of houses from one of the streets, but they have photoshopped tidy, clean, tarmac roads onto the picture.\n\n“That just proves that they are aware of the issue and have decided to cover it up with some clever computer work rather than just fixing the problem.”\n\nWaterside Village is a collection of two, three and four bedroom homes that start from around £140,000 in price.\n\nAccording to the Morris Homes website, Waterside Village “will blend timeless character with high specification and modern design” but the residents disagree with how they have been treated.\n\nDavid added: “We were sold a dream and unfortunately, we are still waiting for that to become a reality.”\n\nA Morris Homes spokesperson said: \"We have only recently finished construction and are working with the local authority to ensure that the carriageways receive their final surfacing as soon as possible.\"", "description": "Residents in Waterside Village in St Helens, Merseyside, have expressed their fury at Morris Homes", "authors": ["Jenny Kirkham", "Image", "Liverpool Echo"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20531841.ece/ALTERNATES/s1200/0_LIVERPOOL-ECHO-Waterside-Village-Road-Row-06.jpg", "published_at": "2019-10-07"}