{"pub": "cbs", "url": "https://cbsnews.com/news/teen-with-vape-related-lung-illness-sues-e-cigarette-maker-juul-labs-today-2019-09-13", "downloaded_at": "2019-09-14 05:27:09.540543+00:00", "title": "Teen with vape-related lung illness sues e-cigarette maker Juul Labs", "language": "en", "text": "A recently hospitalized Chicago teen is suing the makers of an e-cigarette he used as well as the place where he got it from, CBS Chicago reports. In a complaint filed on Friday, the civil suit names Juul Labs Inc., as well MFD Mobile, also known as The Gas Stop in Waukegan, for allegedly illegally selling nicotine-based products to 18-year-old Adam Hergenreder.\n\nAccording to the lawsuit, Mergenreder had been vaping for about a year and a half but was recently hospitalized for severe lung damage.\n\nOfficials in Illinois confirmed in August a man died from a vaping-related illness. Last week an Indiana resident died as a result of an illness related to vaping. Nationwide, more than 450 people are known to be suffering from illnesses connected to using e-cigarettes.\n\nHergenreder is part of that statistic.\n\n\"When I first got (to the hospital), it was like a baby bear was on my chest,\" Hergenreder said.\n\nWhen reached for comment by CBS Chicago, Juul Labs issued a statement touting its \"aggressive action plan to combat underage use.\"\n\n\"It was our hope that others in the category would self-impose similar restrictions to address youth usage and it is now our hope that regulators will impose these same restrictions to protect youth and to preserve the opportunity to eliminate combustible cigarettes, the deadliest legal consumer product known to man,\" the company said.\n\nDonald Trump took a similar tact in a Friday evening tweet, calling for safe cigarette alternatives as well as bans on underage sales and counterfeit vaping products.", "description": "According to the lawsuit, the 18-year-old had been vaping for about a year and a half but was recently hospitalized for severe lung damage", "authors": [], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/09/14/e246021a-6bf3-4402-b64b-0d17bb28f31b/thumbnail/1200x630/c6799ac3c12419e2b706ca5ea416f253/chicago-vaping-lawsuit.jpg", "published_at": "2019-09-13"}