{"pub": "cbc", "url": "https://cbc.ca/sports/rugby/canada-rugby-world-cup-departure-1.5319886", "downloaded_at": "2019-10-13 18:37:17.503919+00:00", "title": "CBC Sports", "language": "en", "text": "With Typhoon Hagibis closing in, the Canadian rugby team went to bed Saturday with three possible scenarios for its final Pool B match against Namibia at the Rugby World Cup in Japan.\n\nGo ahead as scheduled with the 12:15 p.m. start (local time) Sunday in Kamaishi, delay the kickoff or cancel the game.\n\nIt turned out to be Plan C, with Canada coach Kingsley Jones meeting with captain Tyler Ardron and team manager Alana Gattinger in his hotel room just after 6 a.m. Sunday to plan their next move in the wake of World Rugby's decision.\n\nCanada will leave winless for the second straight tournament, with the weather tying its hands this time.\n\n\"We've grown throughout the competition but for us we wanted to get that win. We wanted to win a game at the World Cup — at a minimum,\" a disappointed Jones said in an interview. \"It would have been a tough opponent today but a team at the same level as us.\"\n\nCanada, ranked 22nd in the world, and No. 23 Namibia were the lowest-ranked teams at the 20-country tournament.\n\nCoaches agree with World Rugby decision\n\nThe Canadians, the last team to qualify 11 months ago via a repechage, had targeted the Namibia match. Namibia looked to snap a record 22-loss streak in Rugby World Cups over the last 20 years.\n\nOutgoing Namibia coach Phil Davies was happy to take the two points received for a default draw for the cancellation.\n\n\"We gained one point in the last World Cup, and this year we've gained two,\" Davies said. \"Statistically we've improved.\"\n\nWhile the teams were tied at two points apiece, Namibia finished fourth in the pool ahead of Canada on points difference (minus-141 for Namibia and minus-163 for Canada).\n\nBoth coaches understood World Rugby's decision.\n\n\"I've never seen so much rain — and being from Wales we see a lot of rain — but it's been phenomenal,\" said Davies.\n\nAdded Jones: \"It is what it is. We accept the reasons.\"\n\nJones said Scotland assistant coach Danny Wilson had sent him video of his hotel \"blowing in the wind.\"\n\n\"It's crazy,\" Jones added.\n\nCanadian players, staff pitch in\n\nCanada, on a five-day turnaround after a heavy loss to South Africa, was left looking for positives.\n\n\"I still feel the group has grown,\" Jones said. \"There's a lot of young players who have got a lot of experience. About 19, 18 of these players will have the ability to play in 2023. We're in a good place in terms of young rugby players. It's just making sure that those players get into a daily training environment (in Major League Rugby).\"\n\nWith no game to play and a mess around them in Kamaishi left by the typhoon, about 15 Canada players and staff grabbed shovels and brooms to sweep mud and debris off roads, and even from inside residents' homes.\n\n\"In times like this there are an awful lot more important things than rugby, and when we got here we saw people's houses absolutely destroyed, water [rising] up the walls,\" Canada fly half Peter Nelson said. \"We're just trying our very small part to help them in any way we can.\"\n\nLock Josh Larsen added: \"We felt for the people of Kamaishi. (We're) happy to help.\"\n\nThe typhoon impacted Jones on a personal level. His wife and family were stuck in Tokyo, looking to rearrange travel plans.\n\n\"It's affected everyone,\" he said. \"Same for the families of the players here and the travelling support. You genuinely feel for everyone.\"\n\nThe Canadian team is due to leave Monday.\n\nCanada focused on learned lessons from tourney\n\nThe Canadian men, who went 0-4-0 at the 2015 tournament, have not won a game at the World Cup since a 25-20 victory over Tonga at the 2011 competition. They have lost their last eight tournament matches, outscored 387-87 in the process.\n\nCanada is now riding a 10-match tournament winless streak dating to 2011 when it lost to France and New Zealand and tied Japan after beating Tonga.\n\nRugby Canada said it will conduct a survey of its players, coaches and team management focused on learning lessons from the tournament — as well as a broader quadrennial (2016- 2019) program review.\n\nIn the past, such reviews have impacted the head coach. But that is not likely this year with the pre-tournament announcement that Jones' role is being broadened to director of men's performance rugby. The former Wales captain, hired in September 2017 by Rugby Canada, will continue as men's head coach.\n\nStill, it was a painful tournament for the Canadians with Taylor Paris, Nick Blevins, Ben LeSage and Mike Sheppard all forced out by injury.\n\nLarsen was banned for three games after being sent off against South Africa for an illegal tackle. But the 25-year-old from Parksville, B.C., won worldwide kudos after the Springboks released video of Larsen visiting the South Africa dressing room after the game to apologize for the high hit.\n\nOutscored 177-14 at the tournament, Canada registered just two tries (by Andrew Coe and Matt Heaton).", "description": "After Canada's Rugby World Cup match against Namibia was cancelled six hours before Sunday's scheduled start because of flooding and landslides caused by Typhoon Hagibis, coach Kingsley Jones says the team hasn't had the chance to measure its growth.", "authors": ["The Canadian Press"], "top_image": "https://i.cbc.ca/1.5319890.1570975865!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/canada-rugby-world-cup-191008-1180.jpg", "published_at": "2019-10-13"}