{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/23/nfl-icymi-maybe-the-giants-found-a-new-qb-in-danie", "downloaded_at": "2019-09-23 07:32:23.286825+00:00", "title": "NFL ICYMI: Maybe the Giants found a new QB in Daniel Jones", "language": "en", "text": "So maybe all those fans and media members blasting the choice of Daniel Jones with the No. 6 overall pick in the NFL draft were being a little hasty in their judgment of him and New York Giants general manager Dave Gettleman.\n\nAnd maybe, just maybe, so are the folks getting ready to put Jones in the Pro Football Hall of Fame about six months and - checks notes - one start later.\n\nStill, Jones’ debut in place of Eli Manning as the Giants’ starting QB was an auspicious one, including erasing an 18-point deficit, even if the 32-31 victory over the Buccaneers on Sunday came courtesy of a botched 34-yard field goal attempt by Tampa Bay’s Matt Gay (after a questionable decision by coach Bruce Arians to purposely take a 5-yard penalty for delay of game to make the kick longer than it had to be).\n\n“Probably the story of the game will be the rookie quarterback,” New York coach Pat Shurmur said at his news conference, stating the obvious and likely relishing it. “You guys tell me: I thought he did a pretty good job, first time out. … We believed in him from the day we drafted him.”\n\nSo there.\n\nJones, who played in college at Duke, went 23 of 36 for 336 yards and zero interceptions, throwing for a pair of touchdowns and rushing for two more, including the go-ahead score on a 7-yard run on fourth down with 76 seconds left. Even inspired star running back Saquon Barkley to giddily hop off the field, keeping his injured right ankle and crutches aloft.\n\n“He keeps passing the test, in our mind. Until this afternoon, he hadn’t played in a regular-season NFL game,” Shurmur said about Jones. “Maybe I’m seeing it wrong, but he didn’t disappoint.”\n\nJones is the first rookie since 1970 with at least 300 yards passing, two TDs through the air and another two on the ground in a game.\n\nAnd this silly stat was making the rounds on Twitter: Jones now is 1-0 when trailing by 18, while Manning never won once when facing such a deficit.\n\nOn the other hand, Manning has a 2-0 edge in Super Bowl championships.\n\nManning, to the surprise of no one, spent time with Jones on the sideline Sunday, offering up a congratulatory first bump after the new guy’s first scoring run.\n\n“I can’t thank him enough for his support throughout the week,” Jones said, “and today throughout the game.”\n\nHere’s what else people are talking about after the third Sunday of the NFL season:\n\nBYE, AB\n\nThe Antonio Brown saga just keeps unfolding, and unraveling, with the receiver who’s been accused of rape and trying to intimidate another woman, and who was jettisoned by three teams in 2019, declaring on Twitter that he “will not be playing in the NFL anymore.”\n\nHe also typed up, then deleted, a scorched-earth rant before the day’s games kicked off, taking shots at New England Patriots owner Bob Kraft and Pittsburgh Steelers quarterback Ben Roethlisberger, among others.\n\nPatriots coach Bill Belichick, whose team employed Brown for one game, wouldn’t respond to a reporter’s question Sunday about the receiver - days after cutting short a session with the media because he didn’t want to discuss a player who at the time was still on his team’s roster.\n\nPATRIOTS’ D\n\nSpeaking of the Patriots, their defense has done something no other team has done in the Super Bowl era: not allowed a TD to an opposing offense via a pass or run through three games.\n\nThen again, New England hasn’t exactly been facing The Greatest Show on Turf. Its opponents before beating the Luke Falk-led New York Jets 30-14 in Week 3? The Steelers, the team Brown played for last season, and the Miami Dolphins. Combined record: 0-9.\n\nThe Patriots, let’s not forget, are the reigning Super Bowl champions, and they still have Belichick running the defense and Tom Brady leading the offense. They’re also not the only club to take full advantage of a weak-as-can-be schedule so far. The Bills are also 3-0, and they’ve played the Giants, the Jets and the Cincinnati Bengals, who dropped to 0-3 with Sunday’s 21-17 loss at Buffalo.\n\n___\n\nFollow Howard Fendrich on Twitter at http://twitter.com/HowardFendrich\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "So maybe all those fans and media members blasting the choice of Daniel Jones with the No. 6 overall pick in the NFL draft were being a little hasty in their judgment of him and New York Giants general manager Dave Gettleman.", "authors": ["The Washington Times Http", "Howard Fendrich"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/22/giants_buccaneers_football_88311_c0-180-4200-2628_s1770x1032.jpg?44ea4e92a683e577965550bdf99569a8183d8455", "published_at": "2019-09-23"}