{"pub": "yahoo", "url": "https://sports.yahoo.com/diaz-reynolds-rally-pirates-past-marlins-6-5-023051957--mlb.html", "downloaded_at": "2019-09-05 03:52:17.925612+00:00", "title": "Diaz, Reynolds rally Pirates past Marlins 6-5 in 9th", "language": "en", "published_at": "2019-09-05", "text": "Diaz, Reynolds rally Pirates past Marlins 6-5 in 9th Pittsburgh Pirates' Bryan Reynolds (10) gets a bucket of ice water dumped over him by Chris Archer in celebration after Reynolds drove in two runs with a single in the ninth inning of a baseball game to defeat the Miami Marlins, Wednesday, Sept. 4, 2019, in Pittsburgh. The Pirates won 6-5. (AP Photo/Keith Srakocic)\n\nPITTSBURGH (AP) -- Bryan Reynolds has a chance to make history, though he isn't making a big deal about it.\n\nReynolds' two-run bloop single capped a three-run ninth inning as the Pittsburgh Pirates rallied for a 6-5 victory over the Miami Marlins on Wednesday.\n\nA 2-for-5 night boosted the outfielder's average to .332 as he tries to become the first rookie to win a National League batting title. Washington third baseman Anthony Rendon's .338 mark tops the league\n\nScroll to continue with content Ad\n\n''I try not to think about it because there is still a lot of baseball left,'' Reynolds said before smiling and adding, ''but it's hard not to think about it when it comes up in every interview.''\n\nElias Diaz started the winning rally with a leadoff homer against Jose Urena (4-8) that drew the Pirates within a run. It was just the backup catcher's second home run of the season.\n\n''That really provided a lift,'' Pittsburgh manager Clint Hurdle said.\n\nPinch-hitter Kevin Kramer walked and went to third on Adam Frazier's double before Reynolds flared a single into left-center to give the Pirates their fifth win in six games.\n\nIt was the first game-ending hit of Reynolds' nascent career.\n\n''I like to hit in those situations with the game on the line and I've had a couple of other chances this year when I didn't come through, so it feels good to finally do it,'' said Reynolds, who could not recall his last walk-off hit.\n\nFrazier and Reynolds both had two hits at the top of the order. Making just his 10th start in center field with Starling Marte getting the night off, Reynolds also turned in a pair of outstanding diving catches.\n\nGarrett Cooper's two-run homer off Kyle Crick with two outs in the seventh put the Marlins ahead 5-3.\n\nStory continues\n\nMiami's Starlin Castro had four hits, all for extra bases, as he homered and doubled three times. Cooper also had a double among his three hits.\n\n''Coop and Star put on a show all day,'' Marlins manager Don Mattingly said. ''Kind of a dynamic duo all day long. It's just unfortunate in a game like that, it ends quickly.''\n\nWei-Chung Wang (2-0) pitched a scoreless ninth.\n\nMarlins rookie Robert Dugger was in line for his first major league win after allowing three runs - two earned - over six innings in his third career start.\n\nPirates starter Trevor Williams basically matched Dugger's line as he gave up three runs - two earned - and seven hits in six innings, though he had six strikeouts and one walk.\n\n''We were able to hang in there and keep things close and give Bryan Reynolds the opportunity to do Bryan Reynolds things,'' said Williams, who referred to the 24-year-old as ''an emerging superstar.''\n\nCastro's two-run homer in the fifth put Miami ahead 3-1. Pittsburgh tied it on Frazier's run-scoring triple in the fifth and pinch-hitter Pablo Reyes' RBI double in the sixth.\n\nJosh Bell drove in the Pirates' first run with a first-inning single.\n\nTRAINER'S ROOM\n\nPirates: Rookie OF Jason Martin will miss the rest of the season after dislocating his left shoulder Tuesday night when Marlins RHP Jarlin Garcia fell on him during a play at the plate. Martin, though, will not require surgery. ... RHP Mitch Keller (bruised right wrist) played catch a day after being struck by a line drive. ... RF Gregory Polanco (left shoulder inflammation) will undergo a series of platelet-rich plasma injections. He won't play again this season. ... SS Kevin Newman missed his third straight start with a right hip injury but flied out as a pinch-hitter in the sixth.\n\nROSTER MOVES\n\nThe Pirates recalled Kramer, a utility player, from Triple-A Indianapolis and placed RHP Keone Kela on the paternity list. Kela is expected to miss three games.\n\nTHE FIRST TIME\n\nMarlins C Tyler Heineman made his major league debut in the eighth and struck out as a pinch-hitter. His brother Scott, an outfielder with the Texas Rangers, played in his first career game Monday.\n\nUP NEXT\n\nMarlins: RHP Elieser Hernandez (3-5, 5.06 ERA) is scheduled to pitch Thursday night's series finale. He is 2-1 with a 4.18 ERA in his last five starts.\n\nPirates: RHP Dario Agrazal (4-5, 4.50) has won his last two starts despite giving up seven runs in 10 innings.\n\n---\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP-Sports", "description": "Bryan Reynolds has a chance to make history, though he isn't making a big deal about it.  Reynolds' two-run bloop single capped a three-run ninth inning as the Pittsburgh Pirates rallied for a 6-5 victory over the Miami Marlins on Wednesday.  Elias Diaz started the winning rally with a leadoff", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/74403uKfFN9nke_FeJOsbg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwMjQ7aD02ODI-/https://s.yimg.com/uu/api/res/1.2/NL0i3EYtPRGzQOByVJI9Eg--~B/aD0zNDE7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201909042126772138623"}