{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7618027/Hugh-Jackman-looks-handsome-promotes-coffee-company-red-carpet-Philadelphia.html", "downloaded_at": "2019-10-27 12:12:53.358859+00:00", "title": "Hugh Jackman looks handsome as he promotes his coffee company on the red carpet in Philadelphia", "language": "en", "text": "He's the hunky actor who enjoys giving back to the community.\n\nAnd on Saturday, philanthropic Hugh Jackman looked to be in good spirits as he stepped out at the Philly Fights Cancer charity gala in Philadelphia.\n\nThe Wolverine Origins star opted for smart-casual ensemble consisting of black trousers, a printed blazer and a black T-shirt emblazoned with the logo of his charity coffee brand Laughing Man.\n\nHappy as can be! Hugh Jackman was all smiles as he stepped out for Philly Fights Cancer charity match in Philadelphia on Saturday\n\nHugh established Laughing Man in 2011 to provide a marketplace for farmers in developing companies to sell their goods to customers in America.\n\nAside from his red carpet duties, the actor performed three songs throughout the charity event.\n\nHugh was joined by the likes of Emmy-winning comedian John Mulaney and US pop star Andy Grammer who also performed.\n\nCharitable: The Wolverine Origins star opted for smart-casual ensemble consisting of black trousers, a printed blazer and a black T-shirt emblazoned with the logo of his charity coffee brand Laughing Man\n\nThe Award-winning actor was a red carpet delight, posing alongside event stylist Paige Dietz and Boyds Philadelphia's Melissa Dietz.\n\nHugh recently wrapped up his international world tour, where he performed songs from The Greatest Showman, Les Misérables and The Boy From Oz.\n\nHe is set to make his return to Broadway as Harold Hill in The Music Man where he will be joined by Sutton Foster as Marian.\n\nFan friendly: The Award-winning actor posed alongside event stylist Paige Dietz (left) and Boyds Philadelphia's Melissa Dietz (right)\n\nThe sighting comes after Hugh and his wife Deborra-Lee Furness hosted the Global Citizen Festival in New York last month.\n\nThe pair, who wed in 1996, have been involved with the Global Citizen Festival since 2014 and attended the event arm-in-arm.\n\n'It's a massive movement,' Hugh said of the festival, created by Hugh Evans to eradicate extreme poverty. 'You get that feeling, this is going to happen.'", "description": "He's the hunky actor who enjoys giving back to the community.", "authors": ["Ali Daher For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/03/20234050-0-image-a-15_1572148659004.jpg", "published_at": "2019-10-27"}