{"pub": "reuters", "url": "https://in.reuters.com/article/uk-soccer-india-league/afc-backs-single-india-national-league-in-2024-25-to-end-club-turmoil-idINKBN1WT0YU", "downloaded_at": "2019-10-14 10:16:10.929054+00:00", "title": "AFC backs single India national league in 2024-25 to end club turmoil", "language": "en", "text": "MUMBAI (Reuters) - India should merge two domestic soccer leagues into one top-tier national championship in the 2024/25 season, the Asian Football Confederation (AFC) said on Monday in a bid to end years of turmoil in club football.\n\nA waiter walks past a logo of Indian Super League before a news conference during the domestic player auction and draft in Mumbai, India, July 10, 2015. India's most prolific goal-scorer Sunil Chhetri drew the highest bid in Friday's auction and will join former France striker Nicholas Anelka at the Mumbai FC in the second edition of the Indian Super League (ISL). REUTERS/Danish Siddiqui\n\nThe All India Football Federation’s (AIFF) plan to merge the franchise-based Indian Super League (ISL) with the I-League has faced major obstacles, leaving fans and stakeholders confused about the future of club football.\n\nIn July, the AIFF openly backed the ISL as India’s elite competition for the first time, saying it would recommend the AFC awarded its champions a slot in the continent’s elite club competition.\n\nIn response six I-League clubs wrote to Indian Prime Minister Narendra Modi and FIFA requesting intervention as well as an inquiry into the running of the AIFF.\n\nOn Monday, the AFC recommended that the ISL champions get a playoff slot in the AFC Champions League while the I-League winners would take a place in the AFC Cup starting next season.\n\n“Everyone has to put the good of Indian football at the forefront and take the best decisions to develop Indian club football,” AFC general secretary Windsor John said in a statement.\n\n“The AFC will be very much involved to ensure the growth of the game to the next level with the pathway to a single league,” he added.\n\nThe winners of the traditional I-League were previously awarded the slot in the continent’s elite club competition, AFC Champions League, while the champions of the upstart ISL gained entry to the secondary AFC Cup competition.\n\nThe ISL, promoted by billionaire Mukesh Ambani’s Reliance Industries and Rupert Murdoch’s Star India TV, has grown more popular since its launch in 2014, while interest in the I-League has stagnated.\n\nThe I-League was formed in 2007 as a rebrand of the National Football League, India’s first professional league when it was launched in 1996.\n\nUnder the AFC plan, no club will be promoted or relegated in the ISL for the next three years, and the winner of the I-League will be promoted to the ISL from the 2022/23 season.\n\nThe AFC proposed one main league, with promotion and relegation, and one knock-out Cup tournament starting in the 2024/25 season.\n\n“Every point of this package – and it is a package – has been thought-out extremely carefully and it is aimed simply at providing the best chance to develop Indian club football,” John said, adding the plan would be presented to the AFC and AIFF executive committees.\n\n“We have informed the AIFF that 10-12 teams are not enough for the top league – it must be bigger,” he said.", "description": "India should merge two domestic soccer leagues into one top-tier national championship in the 2024/25 season, the Asian Football Confederation (AFC) said on Monday in a bid to end years of turmoil in club football.", "authors": ["Sudipto Ganguly", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191014&t=2&i=1440651372&w=1200&r=LYNXMPEF9D0MJ", "published_at": "2019-10-14"}