{"pub": "usatoday", "url": "https://usatoday.com/story/money/cars/2019/10/16/volvo-xc-40-recharge-electric-car/3998548002", "downloaded_at": "2019-10-16 20:40:07.425349+00:00", "title": "Volvo reveals its first electric car: XC40 Recharge SUV makes debut", "language": "en", "text": "CLOSE\n\nVolvo revealed its first electric car on Wednesday as the automotive brand moves ahead with its plan to convert its entire lineup into electric or hybrid cars.\n\nThe Swedish brand, which is owned by Chinese automaker Geely, debuted the Volvo XC40 Recharge SUV.\n\nIf it looks familiar, that's because it's essentially a battery-powered version of the standard XC40. Another difference is a brand-new infotainment system using Google's Android operating system.\n\nThe price will start at less than $48,000 after a $7,500 federal tax credit, Volvo said. The vehicle will be available for pre-order later this year but won't be delivered to customers until the fourth quarter of 2020.\n\nThe automaker plans to launch a battery-powered car each year for the next five years. The company hopes to transition its sales to 50% electric cars and 50% hybrids by 2025.\n\nPurely electric or plug-in hybrid cars will be sold under the Recharge brand variant. The company said it would also provide a refund to plug-in hybrid users for the average cost of electricity for their first year of ownership.\n\nThe Volvo XC40 Recharge. (Photo: Volvo)\n\n“We have said this several times before: for Volvo Cars, the future is electric,” Volvo CEO Håkan Samuelsson said in a statement. “Today we take a major new step in that direction with the launch of our fully electric XC40 and the Recharge car line.”\n\nGoodbye, gas: Volvo ditching conventional engines for electric, hybrid cars after 2019\n\nThe Volvo XC40 Recharge will get more than 248 miles on a single charge, though that figure is based on European regulatory standards. The U.S. figure is likely to be closer to 200.\n\nVolvo said its goal is to cut the amount of carbon emissions from its cars by 40% from 2018 to 2025.\n\nFollow USA TODAY reporter Nathan Bomey on Twitter @NathanBomey.\n\nRead or Share this story: https://www.usatoday.com/story/money/cars/2019/10/16/volvo-xc-40-recharge-electric-car/3998548002/", "description": "Volvo revealed its first electric car, the XC40 Recharge, as the brand accelerates its plan to convert its entire lineup into electric or hybrid cars.", "authors": ["Nathan Bomey", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/16/USAT/c5183359-8931-4d9a-99a1-79d3e3279caa-259191_Volvo_XC40_Recharge_P8_AWD_in_Glacier_Silver.jpg?crop=4524,2545,x0,y421&width=3200&height=1680&fit=bounds", "published_at": "2019-10-16"}