{"pub": "financialpost", "url": "https://driving.ca/porsche/taycan/auto-news/news/this-lower-priced-porsche-taycan-is-the-real-tesla-killer", "downloaded_at": "2019-10-14 23:17:27.208506+00:00", "title": "This lower-priced Porsche Taycan is the real Tesla-killer", "language": "en", "text": "Take a good look at the Taycan on these pages. Sexy as the Turbo and Turbo S we showed you last month, isn’t it?\n\nAnd, like the Turbo and Turbo S, this new 4S has twin permanent-magnet electric motors on both axles (hence, all-wheel-drive), a fully-touchscreened interior and, as you can plainly see, the sportiest silhouette in the entire electric sedan segment.\n\nIt is, again like the Turbo and Turbo S that wowed us at their Niagara Falls world unveiling, the electric vehicle writ Porsche.\n\nBuy you know what it doesn’t have? The one thing it doesn’t share with its two siblings, the feature that, in its absence is going to wow potential EVers all the way to Porsche dealerships?\n\nThe outrageous price tag.\n\nWhile they did indeed wow the world, the Turbo and Turbo S versions of the Taycan also shocked for their price tag. At $173,900 for the base Turbo and a seriously wallet-challenging $213,900 for the Turbo S, the original Taycans put it to Tesla’s Model S in every way but affordability.\n\nNot the new 4S. At $119,400 for the base version, it is not just a bargain by Taycan standards, it’s almost exactly the same price as a plain old Panamera 4S. Wow! Double wow!\n\nNow, there are some sacrifices. The base car’s battery, for instance, is a smaller, single-layer 79.2-kilowatt-hour affair (the Turbo’s two-deck 93.4-kWh affair, now dubbed Performance Plus, is available as an option).\n\nHorsepower is down some, the base car offering 522 horsepower while that Performance Plus option bumps things to 562 hp. But the 4S still has twin electric motors, still drives all four wheels and still scoots to 100 kilometres an hour in 4.0 seconds (slower, of course than the Taycan Turbo’s 3.2 seconds, but faster than every non-Turbo Panamera in Porsche’s lineup).\n\nRange, according to the European WTLP standard, is 407 kilometres for the base model; 463 km for the Performance Plus. The base car’s maximum charging ability is also slightly reduced, with peak charging power at 225 kilowatts; the Performance Plus can take a faster-charging 270 kW.\n\nTechnologically, the 4S uses the same 600-amp (rear) and 300-amp (front) inverters as the Turbo Taycan. And, in fact, the innovative two-speed transmission in the rear (for maximum acceleration from a stop) and single speed-gearbox in front is used as on the more expensive models. Ditto for the adaptive air suspension, which is also standard on the 4S. The base 4S even boasts six-piston front brake calipers.\n\nIn other words, while it is obviously aimed at a different clientele, and we do not have information on the exact interior spec and standard equipment, the 4S has not in any way been neutered. We expect it to be just as sporty, albeit a little less rapid, than the Turbo and Turbo S Taycans.\n\nPorsche Canada is taking orders now and expects to start delivering the Taycan 4S in the summer of 2020.", "description": "Porsche springs a way more affordable Taycan 4S on us barely a month after taking the wrappers off its ground-breaking EV", "authors": ["Hours Ago"], "top_image": "https://postmediadriving.files.wordpress.com/2019/10/02-porsche-taycan-4s-.jpg?quality=80", "published_at": "2019-10-14"}