{"pub": "independent", "url": "https://independent.co.uk/extras/indybest/us/casper-wave-hybrid-best-mattress-is-it-good-hybrid-comfortable-firmness-a9103361.html", "downloaded_at": "2019-09-14 01:40:22.549958+00:00", "title": "Casper Wave Hybrid is the mattress-in-a-box firm's most expensive model yet - so how good is it?", "language": "en", "text": "Mattress-in-a-box company Casper recently started targeting the higher-end of the mattress market with its newest model, the Wave Hybrid.\n\nIt’s a tricked-out version of the Casper Wave memory foam mattress, a hybrid combining the features of the Wave model, along with gel pods for additional support, and an innerspring coil base that adds bounce and durability.\n\nThe starting point when selecting a mattress is considering how firm you want it to be. Some people want to be almost enveloped by their mattress, others want it to barely move when they rest on it.\n\nThis sits right in the middle; it’s got a decent amount of give, and you’ll be comforted in a small ident while you’re sleeping. For couples with a firmness preference on either end of the scale, this is the perfect compromise. If you insist on a hard mattress, or something ridiculously squishy, this likely isn’t for you.\n\nThe innerspring coil base is an improvement on the base model, making the mattress respond and settle quickly when someone gets into and out of the bed - avoiding that squishy ‘waterbed’ feeling that some bulky memory foam beds have.\n\nMemory foam mattresses often get a bad reputation for overheating sleepers. But the Casper Wave Hybrid is built on a 7-inch foundation of pocket coils that allow air to flow freely through the space in between each coil. This will keep you cool, though it won’t sleep quite as cool as a full innerspring or full latex mattress. Keep that in mind if you tend to sleep hot.\n\nThe Wave Hybrid is built on a seven-inch foundation of pocket coils which are designed to allow air to circulate. It’s still toastier than a typical innerspring mattress, but a lot cooler than previous memory foam mattresses we’ve tried. Obviously, this is more of a concern in summer, in winter we can see this being welcome.\n\nIt’s incredibly soft, with a wool finish - but you’ll likely be covering the surface with a sheet so it’s not something you’ll regularly get to enjoy. However, it’s moisture-wicking, which should reduce bedtime sweatiness on hot nights.\n\nBear in mind the slat requirements if you’re buying this for a wooden bed - Casper recommends that they’re spaced no further than four inches apart, presumably to avoid sagging. This is typical for most memory foam mattress and worth considering whether you need a few extra slats (as I did).\n\nThe verdict? After the first night on the Casper Wave hybrid mattress my body genuinely felt different - like a masseuse had cracked my back into the correct posture. I’d sometimes feel lower-back pain on my previous memory foam mattress, but this provided the right amount of gently distributed support.\n\nIt's soft, cosy, and keeps me relatively cool when compared to some of its competitor products that I've tried.\n\nBut the price tag is significant - $2,495 for the queen-size mattress, for example. And whether you're prepared to spring that kind of cash on a mattress probably depends on how important sleep is to you. In the way that some people eat to live while others live to eat, the same goes with sleep. My girlfriend is one of those people for whom sleep is one of the highlights of her day - and when she hops into this bed, she lets out an almost cartoon-like 'aahhh' every time she lies down. She can't help it.\n\nCasper offers a 100-night trial to help you make up your mind, and if you decide against it they’ll send a courier to pack it away and remove it - before attempting to donate it to a local charity or recycle it. There’s also an industry standard 10-year limited warranty.\n\nThe queen-size mattress - which we tested - weighs just over 110 pounds and measures 60 inches by 80 inches.\n\nCasper offers ‘white-glove’ delivery whereby someone will carry the mattress right to your apartment and unpack (useful if you’re up a few flights of stairs with no elevator, like me) and even take your old one away.\n\nIndyBest product reviews are unbiased, independent advice you can trust. On some occasions, we earn revenue if you click the links and buy the products, but we never allow this to bias our coverage. The reviews are compiled through a mix of expert opinion and real-world testing.", "description": "Mattress-in-a-box company Casper recently started targeting the higher-end of the mattress market with its newest model, the Wave Hybrid. It’s a tricked-out version of the Casper Wave memory foam mattress, a hybrid combining the features of the Wave model, along with gel pods for additional support, and an innerspring coil base that adds bounce and durability.", "authors": ["Dave Maclean"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/13/20/1-2.jpg", "published_at": "2019-09-13"}