{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7543235/Sportsbet-refunds-bets-Canberra-Raiders-win-NRL-Grand-Final-robbed.html", "downloaded_at": "2019-10-07 00:14:39.783230+00:00", "title": "Sportsbet refunds bets on the Canberra Raiders to win the NRL Grand Final after they were robbed", "language": "en", "text": "Sportsbet has kindly offered to refund furious footy fans who placed bets on the Canberra Raiders to beat the Sydney Roosters in Sunday night's NRL Grand Final.\n\nThe game will go down as one of the most controversial Grand Finals in rugby league history after several refereeing blunders went against the Raiders, who were robbed of what could have been their first premiership in 25 years.\n\nThe worst happened during a crucial period with less than 10 minutes to go with scores tied at 8-all when lead referee Ben Cummins waved his hand to signal six more tackles to the Raiders deep in their territory before changing his mind to say it was the last tackle.\n\nA heartbroken Josh Papalii ponders what could have been after refereeing blunders cost the Canberra Raiders in Sunday night's NRL grand final against the Sydney Roosters\n\nSportsbet had good news for fans who backed Canberra to cause an upset in the grand final\n\nThe Roosters got the ball back and full-back James Tedesco scored the match-winning try in the next set of six.\n\nShortly after the Roosters became the first club since the Brisbane Broncos in 1993 to claim back to back premierships, Sportsbet took to social media with a generous consolation prize to those who backed the Raiders.\n\n'JUSTICE REFUND: If you placed a head-to-head bet on the Raiders, we will be refunding your stake in bonus bets. Standby, it'll take a few minutes to process. Cheers for your patience,' Sportsbet posted on Facebook.\n\nIt later added: 'We've now refunded $1.35 million in bonus bets to customers who backed the Raiders head-to-head in the GF and also outright markets. An absolute heartbreaker.\n\nThis is the moment that referee Ben Cummins broke the hearts of Canberra Raiders fans\n\nSportsbet's kind gesture to refund bets to furious punters hasn't gone unnoticed\n\nThe betting company has been inundated with glowing praise from fans for the gesture.\n\nThat is the best decision you have ever made. I didn’t Back anyone but that refs call was the worst I have seen and it killed a great spectacle. Good work guys,' one fan posted.\n\nAnother added: 'I didn't have a bet but this is legendary. Sportsbet acknowledging the true outcome. Respect.'\n\nCanberra Raiders players were devastated after coming so close to lifting the trophy\n\nOther fans urged Sportsbet to distance itself from the NRL after the refereeing farce.\n\n'Please drop all your sponsorship of the NRL and move it to another sport, unfair outcomes like this should be put to the police as it could be construed as abetting scandal,' a furious fan wrote.\n\nBut not everyone was convinced about the gesture.\n\n'Really... And what about all the multi bets that were affected? Mid season bets for premiers, line bets, margins, and every other bet that was impacted by Ben Cummins? A lot of money has filled the pockets of stock holders of Sportsbet! More than h2h has to be repaid,' one fan posted.\n\nAnother tweeted: 'Do you do that on every bad decision that costs a team during the year?'\n\nBen Cummins (pictured) made a number of controversial decisions during the ga,e\n\nSportsbet won over thousands of rugby league fans for its 'justice refund' over the result\n\nControversial plays 3rd minute: Charged down kick which could have led to a Canberra Raiders try hit a Sydney Roosters trainer on the field in the head. 6th minute: The Sydney Roosters draw first blood when hooker Sam Verrills scores the first game of the match 49th minute: Josh Papalii denied a penalty try when he was tackled without the ball. Cooper Cronk was sin-binned over the incident. 71st minute: The Roosters were given the ball back deep in Raiders territory when the referees initially waved six more tackles to Canberra but then changed their minds. 73rd minute: Roosters full-back James Tedesco races away to score the match-winning try\n\nIt was one of several controversial decisions that went against the Raiders in their first Grand Final appearance in 25 years.\n\nIn the opening stages, a charged down kick which could have led to a Canberra Raiders try hit the Sydney Roosters physio on the field at the time, in the head.\n\nThe Raiders were also denied a penalty try when Josh Papalii was tackled without the ball metres from the try-line, which resulted in the sin-binning of retiring Roosters star Cooper Cronk.\n\nFans and former players erupted with outrage after the full-time siren over the blunder that gave the Roosters victory.\n\n'Signalling six again & then changing their mind is the biggest referring blunder in grand final history... Absolute disgrace,' former Cronulla Sharks and Penrith Panthers star Martin Lang tweeted.\n\nActor Russell Crowe added: Horses**t result in the Grand Final. Yet another rugby League embarrassment. Raiders ripped off.'\n\nThe beer flowed in the Roosters' dressing room after a hard-fought 14-8 grand final victory\n\nA shattered Raiders coach Ricky Stuart refused to comment on the controversy in his post-match press conference.\n\n'It's not the time to talk about it,' Stuart said.\n\n'You know, the Roosters achieved something very special tonight in winning two grand finals in a row. I don't want to take the spotlight off that.\n\nStuart was also tight-lipped over the incident involving the Roosters physio in the opening stages.\n\n‘It ricocheted off their trainer and we lose the advantage. You write what you want,' Stuart told reporters.", "description": "Sportsbet has kindly offered to refund furious footy fans who placed bets on the Canberra Raiders to beat the Sydney Roosters in Sunday night's NRL grand final.", "authors": ["Kylie Stevens For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/14/19361788-0-image-a-71_1570368717896.jpg", "published_at": "2019-10-06"}