{"pub": "nymag", "url": "https://vulture.com/2019/09/hustlers-oral-history.html", "downloaded_at": "2019-09-04 23:48:16.180078+00:00", "published_at": "2019-09-04", "title": "The Hustle Behind Hustlers", "language": "en", "text": "From left, Lili Reinhart, Constance Wu, Jennifer Lopez, and Keke Palmer. Photo: Art Streiber\n\nJennifer Lopez is hanging upside down on a stripper pole as dozens of extras gently pelt her with money in the opening scene of Hustlers. Lopez started her career almost 30 years ago as a Fly Girl on In Living Color and remains in spectacular shape, but she still had to train for months to execute this gravity-defying feat, which, as the film’s writer-director, Lorene Scafaria, puts it, “requires muscles you didn’t even know you had.” The scene depicts a sort of reciprocal ecstasy. Lopez’s expression — the epitome of self-satisfaction — was key to its authenticity. “There’s no better feeling than having money fall all over your body,” says Jacqueline Frances, a stripper who consulted on the film.\n\nBut behind the scenes, the dollar bills didn’t rain down as freely. The film is based on Jessica Pressler’s 2015 New York article “The Hustlers at Scores,” about a group of strippers who drugged Wall Street guys and then ran up charges on their credit cards. Gloria Sanchez Productions — sister ship to Adam McKay and Will Ferrell’s Gary Sanchez company — bought the rights, and Annapurna Pictures began developing the film. But it turns out that persuading rich white men to make a movie about other rich white men being scammed wasn’t easy. “I’d literally stand at the front of rooms with white men and try to get them to open their wallets,” says Scafaria. “I felt very much like I could understand them. I think we’ve all danced for the money a little bit.” This is the oral history of how Hustlers got made.\n\n1. Pray Scorsese Passes\n\nIn early 2017, Annapurna Pictures asked Scafaria to be the screenwriter. Scafaria wanted to direct the film as well, but the producers had other ideas.\n\nJessica Elbaum, producer and founder, Gloria Sanchez Productions: When we first read the script, we were like, “We gotta get this to Martin Scorsese.” We also thought about Adam McKay at one point. I guess it’s, like, the lazy approach, which we’re all guilty of at times: “Oh my God, send this to the people that we’ve seen make this type of movie.”\n\nLorene Scafaria: I was really trying to fight for the job and hoped that I could do as much directing as possible on paper in order to start to convince everyone that the director of The Meddler [an earnest mother-daughter comedy-drama starring Susan Sarandon and Rose Byrne] should be the director of Hustlers. I did a second draft, and then it became a sort of reckoning of who was going to direct it. Adam McKay knew I really wanted it. I remember him saying, “I hope Scorsese passes.”\n\nAt that point, I had already started editing a sizzle reel, a proof of concept, with Kayla Emter, who would eventually be the editor. I was editing at home, on my computer, footage of strippers and stripteases and setting them to Chopin.\n\nKayla Emter, editor: I love working with female directors. I think it’s freeing. The communication comes a little bit easier between women — there’s just a shorthand, or you can ramble and they can translate, versus having to be super specific about your work. It’s more of a conversation than bullet points.\n\nElbaum: The reel was, like her writing, extraordinary — and it was sort of undeniable at that point, after those very few big swings, that it should be Lorene. It was like, “Oh God, no, the person that should make this movie is standing right in front of us. What are we doing?” I joked with her: “God, I’m so glad Martin Scorsese didn’t do this movie.”\n\n2. Pray J.Lo Doesn’t\n\nPhoto: Art Streiber\n\nAfter Scafaria landed the job, she spent two years chasing the cast of her dreams. Lizzo, Trace Lysette, Keke Palmer, Mette Towley, Jacq the Stripper, and Cardi B all eventually signed on. But for Scafaria, one name loomed the largest: Jennifer Lopez. She knew if she didn’t get Lopez, the whole thing might fall apart.\n\nScafaria: I don’t really think of any actors when I’m writing a script, but as soon as I was done, I realized, Oh my God, Ramona is Jennifer Lopez. Jennifer Lopez is Ramona. It has to be her.\n\nElbaum: So we got the script to Jennifer’s team, and they responded and loved it.\n\nScafaria: Then we met at her home in January of 2018. She’s also a producer on the film, so it was really collaborative and thought out. There were little things we did to tailor Ramona [to her], and other things we could actually do more of because it was Jennifer Lopez. I never expected to get somebody who’s such a gifted dancer and performer.\n\nGayle Keller, casting director: Cardi’s name was always in the mix. Lorene said, “How can you write a movie about strippers and not put Cardi B in it?” She’s phenomenal just for her Instagram alone. I mean, she’s influencing Bernie Sanders.\n\nElbaum: Lorene had the idea to get Cardi, and Jennifer got it done.\n\nElaine Goldsmith-Thomas, producer: Jennifer called Cardi and said, “You need to be a part of this. You know this world.”\n\nJennifer Lopez, Ramona: I know she knew this world better than any of us. I told her she had to do it. And I wasn’t going to take no for an answer.\n\nKeller: Once we got her, I remember Lorene and I just screaming and yelling.\n\nConstance Wu, Destiny: I got the script from my agent, and I immediately knew it was something I wanted to do and I could do. But I knew that my résumé at that point didn’t really have anything that would indicate that I could pull off this role. I mean, I play a middle-aged mother of three boys on Fresh Off the Boat, and then I play an ingénue in Crazy Rich Asians. So I was like, “I will gladly put myself on tape for this because I love this.” I would work on my TV show Monday through Friday, and then on the weekends I would work on Destiny.\n\nScafaria: I remember trying to cast the Mercedes role and saying, “It has to be Keke Palmer.” This character needs to be the one who makes Ramona laugh.\n\nKeke Palmer, Mercedes: Lorene said she knew just from seeing my Insta, my personality, my work. Usually when I have a meeting with the director or writer, it’s about 30, 40 minutes. Lorene and I were there for two hours. I’m sure we talked about something crazy. Maybe the avocado toast we were eating?\n\nElbaum: The producers primarily were women, our filmmaker was a woman. Our editor is a woman. Our costume designer — well, he’s a gay man. Our production designer’s a woman; our line producer was a woman. But Lorene hired the people who were right for the job. I think this script just spoke to women.\n\nGoldsmith-Thomas: Everyone agreed to be paid less than they usually would.\n\nJulia Stiles, Elizabeth: My agent sent me the script and said, “It’s not a really flashy part; it’s not one of the strippers.” I was like, “I don’t care if I have to make sandwiches and sweep the floors. I’ll do anything to be a part of this movie.” [She plays the journalist.]\n\nKeller: Lili Reinhart’s was the last part we ended up casting. It was the hardest to cast. Everyone knows her from Riverdale, but we had seen this indie movie she had done in Texas, and there was something in there — a very sweet kind of ingénue, a damaged side to her. But [the role in Hustlers] was also a part that had some comedic qualities: She throws up when she gets nervous.\n\nLili Reinhart, Annabelle: It was animal crackers and Sprite mixed together. I would take a large gulp of it and keep it in my mouth, and when they were ready, I would just let it go. But it just tasted like animal crackers, so I didn’t care.\n\n3. Sweet-Talk the Suits\n\nDirector Lorene Scafaria and cinematographer Todd Banhazl on set. Photo: Courtesy of STX\n\nShortly after Lopez became attached, Annapurna dropped the film.\n\nScafaria: The movie fell apart the day before my 40th birthday.\n\nElbaum: I think we were just part of a handful of movies that they kind of walked away from for whatever reason. We’ll never really know.\n\nGoldsmith-Thomas: I was Sisyphus with the boulder of Hustlers on my back. Sometimes it would fall off and roll back on me. When it did, I’d just grab the hands of Jessica and Jennifer and Lorene and put it back on my back. And I was selling primarily to men. Hustling, you might say.\n\nScafaria: It’s the only time I really feel like a woman. I don’t really feel that when I’m on a set; I don’t really feel that when I’m working closely with my DP or my first AD. I feel that way when it comes to money.\n\nGoldsmith-Thomas: I’d say [the male studio executives] were a little uncomfortable. Everybody could see the commercial value of this movie, but they were like, “Can they just drug the bad guys? Can they just do it to the people that deserve it?” They all could celebrate The Wolf of Wall Street — a guy doing it to women. By the way, does anyone deserve to be drugged? No!\n\nScafaria: Part of the struggle of getting this movie made was not the crime-drama element of it but the judgment that people have about strippers. I don’t fault any stripper or sex worker for trying to make ends meet in a world that values women for their bodies. Men are also under their own construct. It’s not to say I feel so horrible for the guys on Wall Street who ripped off America and the world, but I do think we’re all playing a part.\n\nGoldsmith-Thomas: It was just dancing for a group of men and explaining to them, “Yes, the women do drug the guys, and no, they’re not all bad guys, and yes, they do bad things.”\n\nJacq the Stripper, comfort consultant and cast member: When I read the story a couple of years ago, I was like, Damn, this is an amazing story, and yeah, it’s problematic. Surviving under capitalism is problematic for everybody, and it’s important to just talk about it.\n\nElbaum: There was a small piece inside of me going, Who is going to make this?\n\nScafaria: It was an existential crisis for a while there. But I felt like I couldn’t stop. I had to get another writing job, but I refused to take any other directing job. I refused to pursue any other film. I just thought, If this isn’t it, I don’t know what movies are. It was really dark.\n\nI knew there was a market for this movie. There aren’t strip-club movies that portrayed women in a way that I was excited about. Why are we focused on these guys sitting at the table? We were pointing the camera at the wrong place.\n\nElbaum: Jennifer and her team have a strong relationship with STX, so we shared it with them and [producer] Adam Fogelson, who loved it, loved Lorene and her vision, and was super-passionate about it. I think nowadays studios are taking a lot less chances, and STX was willing to take a chance on this.\n\nIt didn’t take long after meeting with STX to actually get it made. I want to say less than a year. We met with them in the fall. Lorene did another pass on the script, and in December we turned it in.\n\nScafaria: I really do like to smash everything on the ground and start over. So I did a page-one rewrite of the script at some point. It was a totally different script that we got a lot of scenes out of, but it wasn’t the right script. Then I did a third script with a million drafts in between. That’s this movie.\n\nElbaum: We were prepping by February, we made the movie in March, we wrapped it in May, and the movie’s coming out in September, which is insane. Elaine Goldsmith-Thomas always joked on set, “I think we’re actually making this movie?” Even the day we wrapped, she was like, “Guys, I think we’re making this movie.”\n\n4. Hit the Pole\n\nJ.Lo behind the scenes. Photo: Courtesy of STX\n\nThe problem: How to make it realistic but not exploitative?\n\nJane Musky, production designer: I’ve been in the business long enough to have seen an awful lot of strip clubs in my life. But we all decided this had to be that big, broad strip club where so much was going on, the way the real Scores is.\n\nScafaria: We rented out Show Palace, a club in Long Island City, and actually cast a few of the dancers out of there. We had an open call, and a couple of the girls were just so good.\n\nMusky: When I first read the script, Show Palace was the exact strip club I had in my mind — big enough and multilevel enough to really jazz up. The owner was a great guy, and we put him in the movie; he’s paying Destiny her tip in the office.\n\nWu: I installed a pole in my living room. I took pole classes; I took private coaching sessions. And this was all stuff I paid for by myself before we even started the movie. I became friends with a couple of strippers. I went to a lot of strip clubs in San Francisco — that’s what I spent my Christmas Eve doing. I went with two of my guy friends, and we went to five different clubs. It was so fucking fun. And nobody knew who I was. I’m not really that famous. Also nobody expects this sitcom mother of three boys to be in a strip club.\n\nScafaria: I know Jennifer and Alex [Rodriguez] went and visited a strip club, and she was able to give me some insight.\n\nJohanna Sapakie, choreographer: I asked Jennifer, “Have you been to a strip club before?” She said no, and I said, “Okay, well, that’s something you should do.”\n\nLopez: I watched the ladies do their routines, met with them backstage, and talked about what it was like to have a career as a dancer. I soaked up the atmosphere and wanted to learn how to do things authentically.\n\nSapakie: Of course, she got recognized. She said some of the women were quite forward about trying to get 20 bucks. But obviously they were very generous in the club.\n\nLopez: I think it would surprise people (although it shouldn’t) that most of these women are just normal women trying to get by. Just trying to pay for school, provide for their children, provide for their families. The anti-heroes and their behaviors portrayed in Hustlers are not the norm. I also asked if it was common to go home with any of the guys from the club, and they were quick to correct me. It was “No, no! I am a dancer, not an escort.” There is a strict line. There are boundaries.\n\nScafaria: Jennifer is such an unbelievable dancer, but she trained so hard-core for this. I know she had a pole in her house. She’s the most in-shape person you’ve ever seen in your life, but pole dancing is not like anything else. So we did treat it a little bit like a sports movie.\n\nLopez: And their moves aren’t easy. They really are athletes.\n\nSapakie: We worked together for about two and a half months prior to filming, and then we continued to work through filming. For someone who’s never pole-danced, that’s a short window. The very first thing we start with is always “This is how you climb the pole.” Then you move on to spinning. And then the last hurdle was anything inverted — turning upside down and making sure she felt safe and comfortable.\n\nWu: I’ve never been so sore in my life.\n\nJacq the Stripper: This is what I told the girls: When in doubt, touch yourself. Touch your leg, touch your boobs, touch your butt, play with your hair, touch your body.\n\nWu: Go slow. Slow is sexy. That was the best tip.\n\nSapakie: I also worked with Constance, Lili, and Keke. Lili enjoyed it so much that she came back for an additional session with me, just to play.\n\nReinhart: That’s my party trick now.\n\n5. Make It Feel Like 2007\n\nJ.Lo and Wu lead the pack. Photo: Courtesy of STX\n\nScheduling got tricky: Cardi B was on tour, as was Lizzo; Lopez was about to be. Reinhart was filming Riverdale’s third season and would have to fly back and forth from Canada multiple times in one week. Shooting began in March, with every day a “white-knuckle race against the sun or the clock or reality,” says Scafaria.\n\nElbaum: People lose their minds when they see Jennifer Lopez. You’re followed by paparazzi always.\n\nGoldsmith-Thomas: We were told, “If people find out where you guys are shooting, we’re going to take away your permit,” because it would incite a riot. But the paparazzi always figure it out.\n\nWu: That was quite distracting.\n\nStiles: My scene with Jennifer was my first day filming, and it took every ounce of my being not to have my jaw drop. I was floored by her. She was handed a one-page monologue at the last minute, and she just read it a couple of times to herself and then delivered it as though it was not scripted. It was very surreal.\n\nScafaria: Part of the joy was seeing [Lopez’s character] Ramona dress like her style icon Jennifer Lopez. We spoke about the labels that were big back then and Juicy — Jennifer made the Juicy suit famous herself! I have a feeling she’s going to bring it back. We wanted things that made people go, “Oh my God, I was wearing those in 2007.” Every earring is telling a story. I have a feeling there are going to be a lot of bandage dresses coming back. But I hope not.\n\nElbaum: Jennifer’s first dance was a “holy shit” moment. What she does on that pole is insane.\n\nScafaria: We treated it like a stunt, with three cameras. She’d go through it a few times, and then we’d isolate certain things and pick out other shots.\n\nSapakie: We wanted it to feel really powerful. It needed to really impress upon the viewer that this woman is the queen bee of this world. We started working on that choreography maybe about two and a half, three weeks prior to actually filming it.\n\nJason Markey, music supervisor: One of Jennifer’s ideas was to dance to Fiona Apple’s “Criminal,” but that had never been licensed for a film. And Fiona said yes. She’s probably a fan of Jen’s.\n\nScafaria: To me, the craziest part about this is that Jennifer Lopez stripped in a club in front of 250 people — and that’s all her, you know what I mean?\n\nWu: Working with all girls, that was special because so often in movies, there’s one girl. That naturally creates a scarcity complex, which creates competition. But there was zero competition.\n\nKeller: Sometimes it can be intimidating to go into a room where it’s just a bunch of guys. But with women, you get excited about certain things that you wouldn’t get excited about if there was a male director or producer. We get giddy; we talk a lot. If I was having a bad day, someone would go, “Gayle, everything’s gonna be okay. Don’t you worry — you’re doing a great job.”\n\nPalmer: We all keep in touch, but no group chat. I have too many goddamn group chats already.\n\n6. Let the Money Fall\n\nLorene Scafaria. Photo: Art Streiber\n\nScafaria was constantly in conversation with the cast members about their levels of comfort with various scenes.\n\nElbaum: Our last week we shot in the strip club.\n\nJacq the Stripper: It was like a utopian strip club from days gone by. I felt so respected for my opinion and my expertise, coming from my background where sex work is stigmatized and considered not real work, and that we’re disposable and that violence against us is acceptable. It’s really important to have compassionate and authentic representation of sex workers in mainstream media. And the only way that’s going to be achieved is by hiring sex workers to play the parts and to consult on these films.\n\nPeople are constantly shitting on me all the time about strippers being dumb bitches. It’s so toxic and it’s violent. It results in literal violence against sex workers.\n\nScafaria: There’s a cameo [in the club] that I’m trying not to fully spoil, but that was the most fun, without question. I wrote this cameo into the script years ago, so the fact that it happened was remarkable. To watch all of the actors reacting to him was so fun. The girls were flipping out. He was a crush for everybody at some point in their lives. So that was the day we wanted to blow it out. We had the most extras we could possibly fit in the room. We had all of the women on stage together, dancing. That was our crane day. We brought out the green lasers.\n\nWu: I didn’t want to do nudity. I just wasn’t into it. It’s not that I think there’s anything wrong with it and I don’t believe in it. It’s just a personal thing.\n\nJacq the Stripper: In one shot, my pussy popped out of my G-string and I was like, “This G-string is too small.” But Lizzo was like, “Oh, the carpets match the drapes!” Hanging out with her and seeing her radiant, affirmative energy was really fucking cool.\n\nScafaria: I never wanted to have nudity be the reason that someone wasn’t in the film. I didn’t realize Lizzo was game for it until she did an interview later! The girls are all wearing exactly what they would want to be wearing, curated by the incredible Mitchell Travers. But I believe you can actually see one of our characters topless in one of the scenes.\n\nJacq the Stripper: I don’t wanna, like, ruin Hollywood, but my character has new tits, and my tits are just the ones I was born with. So we were workshopping Jennifer fondling my tits. I don’t know what cut we went with, but there was a lot of playing around with my boobs. I got girls grabbing my boobs all the time — I’m a stripper and pretty gay. But I was like, “This is cool. She’s got soft hands, very consenting.”\n\nScafaria: If we’re focused on someone’s body in these scenes, it’s because they want us to be. It’s a bit of a Trojan horse, that way, the movie. It toys with the male gaze, the same way strippers might toy with it.\n\nEmter: Exactly when you want more is when we cut out. Just to keep you leaning forward and to control the gaze.\n\nElbaum: I’ve been at this for a while, but this movie validated what it is that I’ve been trying to do and what I’m going to keep doing.\n\nScafaria: Movies about women — I think people want them to be perfect, just like they do in life. I heard it was hard to get Ocean’s Eight made. That makes me crazy.\n\n*This article appears in the September 2, 2019, issue of New York Magazine. Subscribe Now!", "description": "How the ‘Hustlers’ movie got made, with Jennifer Lopez, Constance Wu, Keke Palmer, Lili Reinhart, and more. How do you get a film about rich white men getting scammed made in an industry run by rich white men? First step: Get J.Lo to sign on.", "authors": ["Rachel Handler"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/08/29/magazine/hustler/30-hustlers-opener.w1200.h630.jpg"}