{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/couples-mercedes-vanishes-after-leaving-20644803", "downloaded_at": "2019-10-18 01:11:26.671116+00:00", "title": "Couple's Mercedes vanishes after they leave it with airport 'meet and greet' firm", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA couple's dream holiday turned into a headache after the Mercedes they left it with an airport 'meet and greet' firm vanished.\n\nLisa Hook and Antony Smith paid £77 to leave their car near Manchester Airport while they went on a two-week holiday to Turkey - only to find it had been stolen while they were away.\n\nThey were shocked when they returned on October 8 and staff at the parking firm Meet and Greet Manchester Airport Services Ltd said they couldn't find their car.\n\nLisa and Antony got a taxi to the firm's site and were appalled by the state of the fields where cars are left, reports the Manchester Evening News .\n\n(Image: MEN MEDIA)\n\nPhotographs show scores of vehicles parked in muddy, rutted fields.\n\nThe car park is not affiliated with Manchester Airport.\n\nDespite two trips to the site and numerous phone calls, the firm said they were unable to locate the car.\n\nPolice confirmed the couple's silver Mercedes C-class 220 CDI AMG sport edition had been reported as stolen.\n\nLisa, a warehouse operator, and Antony, a wagon driver, had saved for years for the car and say it is worth around £10,000.\n\nThey'd booked the meet and greet parking via a website called Fly Park Plus.\n\nLisa, 50, said: \"It has been so stressful.\n\n(Image: MEN MEDIA)\n\n\"We followed all of the instructions we were given on the booking email.\n\n\"On the way out we called the number half-an-hour before we arrived, as instructed, and dropped the car off with one of their drivers.\n\n\"He knew our names and our booking. He took it and we assumed it would be returned to us when we came back.\n\n\"We rang after we'd landed and they said they couldn't find the car.\n\n\"There were a lot of phone calls back and forth - all in the early hours of the morning.\n\n\"First they were saying they couldn't find the car, then they couldn't locate the keys and then they started denying we had ever left our car with them.\n\n\"We went to the police at the airport and explained what had happened.\n\n(Image: MEN MEDIA)\n\n\"They gave us the address to head up to the car park in Styal. When we got there the women who we had spoken to on the phone started saying they weren't the company we'd booked with.\n\n\"At one point she asked if we were sure we'd dropped it off at the right place.\n\n\"It was ridiculous. We'd not put it in the suitcase and took it with us.\n\n\"In the end we had to go back to the airport with no idea where our car had gone.\n\n\"That car was immaculate, there wasn't a scratch on it and we'd saved for a long time to buy it.\n\n\"We just don't understand how they could have lost.\"\n\n(Image: MEN MEDIA)\n\nLisa and Antony were unsure how they were going to get back to their home, but fortunately spotted private hire vehicle from Barnsley back at the airport.\n\nThe taxi driver offered to take them back to the car park in Styal in daylight.\n\n\"We couldn't believe it when we saw what it looked like in daylight,\" added Lisa.\n\n\"It was shocking. All those people who book with these firms don't realise where they're actually leaving their car.\"\n\nMeet and Greet Manchester Airport Services Ltd said they are co-operating with police on the matter.\n\nMr Ali, day-time dispatch manager, said: \"We are not sure what happened to the vehicle.\n\n\"We can't say what happened and we haven't been faced with this kind of situation for a while.\n\n\"It is on our system and we should have the vehicle. We know it came into the car park and then exited the car park.\n\n\"We are working with the police and checking all of the CCTV footage minute-by-minute.\n\n\"We will also be checking the CCTV footage at the airport car park to see who collected the car.\n\n\"It's quite a big issue for us at the moment and we're looking into it.\"\n\nWith regard to the state of the car park, Mr Ali said there had been a lot of rainfall and that improvements were going to be made to the site.\n\nA Manchester Airport spokesman, said: “Meet and Greet Manchester Airport Services has no affiliation to Manchester Airport and does not offer official airport car parking.\n\n“We would urge any customers to thoroughly research the company they book their parking with before handing their keys over. If anyone has any doubts about if their car parking is officially associated with Manchester Airport they can verify it with our customer services team.\n\n“We continue to work closely with Manchester City Council, Trading Standards and GMP to take action against third party operators who falsely claim to be affiliated with the airport as well as those that have unscrupulous working practices.”\n\nA GMP spokesman added: \"Police were called shortly after 8.30am on Tuesday 8 October 2019 after a vehicle left with a third-party meet and greet company unaffiliated to Manchester Airport failed to be returned to its owner and was subsequently reported stolen.\n\n\"Enquiries are ongoing.\n\n\"Anyone with information should contact police on 101 or the independent charity Crimestoppers, anonymously, on 0800 555 111 quoting incident number 629 of 08/10/2019.\"", "description": "The pair returned from their holiday to Turkey to find Meet and Greet Manchester Airport Services Ltd had no idea where their car was", "authors": ["Charlotte Dobson", "Image", "Men Media"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20644867.ece/ALTERNATES/s1200/1_Antony-and-Lisa.jpg", "published_at": "2019-10-17"}