{"pub": "guardian", "url": "https://theguardian.com/environment/2019/oct/10/fires-explosions-front-range-residents-fracking-colorado-climate", "downloaded_at": "2019-10-10 15:10:45.693816+00:00", "title": "Fires, explosions and toxic releases: Front Range residents fight fracking boom", "language": "en", "text": "For Barb Binder, the bad news arrived with a knock on the door. That’s when she learned from a local activist that a patch of open public space across from her “forever home” in Broomfield County, the Denver suburb where she and her husband planned to retire, was about to become an industrial site.\n\nInitially, she was comforted by the thought that state officials would not possibly allow residential hydraulic fracturing – or fracking, as it is known – to begin if it was not safe.\n\nQ&A What is the polluters project? Show Hide The Guardian has collaborated with leading scientists and NGOs to expose, with exclusive data, investigations and analysis, the fossil fuel companies that are perpetuating the climate crisis – some of which have accelerated their extraction of coal, oil and gas even as the devastating impact on the planet and humanity was becoming clear.\n\nThe investigation has involved more than 20 Guardian journalists working across the world for the past six months. The project focuses on what the companies have extracted from the ground, and the subsequent emissions they are responsible for, since 1965. The analysis, undertaken by Richard Heede at the Climate Accountability Institute, calculates how much carbon is emitted throughout the supply chain, from extraction to use by consumers. Heede said: \"The fact that consumers combust the fuels to carbon dioxide, water, heat and pollutants does not absolve the fossil fuel companies from responsibility for knowingly perpetuating the carbon era and accelerating the climate crisis toward the existential threat it has now become.\" One aim of the project is to move the focus of debate from individual responsibilities to power structures – so our reporters also examined the financial and lobbying structures that let fossil fuel firms keep growing, and discovered which elected politicians were voting for change. Another aim of the project is to press governments and corporations to close the gap between ambitious long-term promises and lacklustre short-term action. The UN says the coming decade is crucial if the world is to avoid the most catastrophic consequences of global heating. Reining in our dependence on fossil fuels and dramatically accelerating the transition to renewable energy has never been more urgent.\n\nBut two years on Binder feels naive for being so trusting. She believes her asthma has become worse since the construction near her home began, and blames the drilling mud that has been used on the site. And then there is the constant worry.\n\n“I had to educate myself about exactly what’s involved in industrial-scale fracking,” she says. “It meant looking at the dangers – the fires, the explosions, the toxic releases, and recognising: ‘Oh my God, I am going to be living right next to this.’”\n\nBinder now spends most of her free time opposing the plans of Extraction Oil and Gas, the Denver-based company that has plans to construct 84 wells around her neighbourhood, 16 of them “literally” – she says – in her backyard.\n\nShe is not alone. Since the advent of the fracking boom in oil-rich Colorado – where there has been a fivefold increase in oil and gas production since 2008 – new wells and production sites have sprung up around residential neighbourhoods in the Front Range faster than environmental researchers can track them.\n\nThere are 40,000 active and inactive wells across the Denver basin, and new permits issued every month for more. They are built close to schools, playgrounds, and clusters of family homes.\n\nThe boom has coincided with anecdotal tales of ill-effects – from children’s nosebleeds to asthma – and a health study that shows more children being born with congenital heart defects in areas of Colorado with high-intensity oil and gas activity compared with areas where there is low or no activity.\n\nExtraction Oil and Gas told the Guardian it had used new technologies to “minimise the impact of oil and gas development” in the Front Range, compared with the way oil was extracted in previous decades.\n\nA spokesperson said the company had learned some lessons from an incident on its Livingston site, after it voluntarily switched a drilling fluid it had been using because residents complained about the odour. It said air monitoring results had found “no health impact” from the smell.\n\n“To date, all published air-quality monitoring results have been stellar, and conclusively show that any effects of our development on the air we breathe are negligible,” the company said.\n\n“We understand that there will always be those who oppose all oil and gas development whatsoever, or want to ‘leave it in the ground’, but we will continue our endeavours to minimise impacts of developing the energy we all use each day – and we will never stop innovating for the betterment of Colorado and our state’s economy.”\n\nYet the conflicts – between industry and residents, and sometimes neighbour versus neighbour – have felt, in the words of the local reporter Chase Woodruff, like a “civil war” at times.\n\nAnd there have been accidents. In 2017, two men were killed, and a woman and child injured, after a house in Firestone, Colorado, exploded because of a leak of “fugitive gas” from an uncapped pipeline that was connected to a gas well near the home.\n\nErin Martinez, who lost her husband and brother in the blast, has moved house again after a new well began construction across from her home.\n\nEnvironmental researchers from the not-for-profit Earthworks group travel from site to site in what sometimes seems like a game of whack-a-mole, using a special gas-finding imaging camera to track, document, and report what they describe as plumes of pollution that are being emitted from the sites, in what they claim is evidence of dangerous releases of methane and other volatile organic compounds that are not visible to the naked eye.\n\nOil companies have claimed that the plumes are not evidence of toxic emissions. The industry has claimed the plumes are a “heat signature” caused by high temperature drilling mud.\n\nDozens of complaints have been filed to state authorities, but regulators have deemed that most of those emissions are in the allowable range.\n\nFacebook Twitter Pinterest Earthworks’s gas-finding camera tracks alleged emissions of methane and other volatile organic compounds\n\nOne proposal that would have forced oil and gas wells to be located at least 2,500ft (760 metres) – or half a mile – from homes and other buildings was voted down on a ballot initiative last year by a vote of 58% to 42%, in a significant blow to anti-fracking activists.\n\nOil and gas advocates argue the “setback” proposal would have decimated their operations in Colorado, in effect barring new drilling from the Denver suburbs where nine in 10 new wells are being constructed.\n\nColorado Rising, one of the leading activist groups in the state, reportedly raised about $1.2m (£1m) to support the initiative, but were outspent when – activists say – industry sources pumped $41m into the race.\n\nOpponents of fracking have, however, won one big victory since then. Last April, Colorado’s new Democratic governor, Jared Polis, signed a new mandate into law that forced one of the state’s most powerful institutions, the Colorado Oil and Gas Conservation Commission (COGCC), to completely upend its mission.\n\nInstead of fostering the oil and gas industry, Senate bill 181 (SB181) has forced the COGCC to regulate it, with a specific priority on public health and safety and focus on the environment.\n\nThe new law has raised questions: about whether a state with deep ties to the fossil fuel industry can ever really change, and whether fears about the climate crisis, and the ill-effects of fracking, will ever make a difference.\n\nFor years, the oil sector has argued that Colorado needs the multibillion-dollar industry and the hundreds of thousands of job it sustains.\n\nSara Loflin, the executive director of the League of Oil and Gas Impacted Coloradans, a campaigning group that helped get SB181 passed, says the legislation was a product of decades of Coloradans living with oil and gas in their communities, and seeing the effect of its pollution: the industrial waste, the bad air, the noise, and the constant low thumping vibrations that have made residents physically ill.\n\nFor years, Loflin told the Guardian, locals who were concerned about debris from abandoned sites, or the way soil at a local playground had changed colour, would have to make more than a dozen calls to get answers from public officials, and still be treated with hostility.\n\nNow her organisation is seeking to remind local governments, who have also been given more power under SB181, that they have “the jurisdiction, the right, and the responsibility” to say no to new permits if health and safety is jeopardised.\n\nBut despite its legal firepower, there is no sign of rapid change within the Colorado market. At a recent meeting of the COGCC in Thornton, on an unseasonably hot autumn day, residents’ frustrations were aimed at Jeff Robbins, the director of the COGCC, who was appointed by Polis.\n\nSince May, Robbins and the COGCC have approved 650 drilling permits and 82 location sites. Some permit applications have been delayed, but not a single one has been denied, despite the COGCC’s new mandate.\n\nPressed by the Guardian about whether he saw it as his job to say no to industry, Robbins said he believed it was his mission to take “a close look” at permit applications that were located close to homes.\n\n“And that’s exactly what I’m doing,” he said. “What 181 says is that we don’t want to see all of the pending permits get a free pass. And we don’t want to see all pending permits be under a moratorium. It says we want you – director – using objective criteria to permit those that can be permitted, and potentially delay others that can’t be permitted, because they are not protected.”\n\nWhen he was asked whether the climate crisis would affect the COGCC’s permit allocations under the new law, Robbins said climate could potentially be considered since SB181 required the commission to evaluate the cumulative effects of oil and gas operations on the environment.\n\nFacebook Twitter Pinterest Workers tend to a well head during a fracking operation at an Encana gas well outside Rifle, western Colorado. Photograph: Brennan Linsley/AP\n\nBut Robbins said he would look for “stakeholder input” for guidance. He meets once a month with environmental activists and residents, and twice a month with industry.\n\nFor residents like Connie Beach, who returned home from a vacation in November 2017 to a letter that said she would soon be living next to a 30-well mega-pad for drilling, and was told there was “nothing to do about it”, the promise of SB181 is losing its lustre.\n\nOn a local Facebook group, people in her neighbourhood post about favoured local candidates who will fight industry. Most end up being challenged by opponents with deep pockets and ties to oil and gas.\n\nContact the Guardian securely Read more\n\nJoe Salazar, a former Democratic state legislator and civil rights lawyer who recently became the head of Colorado Rising, is keeping his eye on a proposed fracking site called Acme, which has been described by environmental experts as one of the most problematic in the state of Colorado. Permits have not yet been approved, but if they are, the site will contain 36 wells within 500ft (150 metres) of homes, and 100ft from a small airport runway.\n\nThe COGCC recently reopened a public comment period, inviting residents to air their views before the commission makes a decision.\n\n“This is going to be one hell of a test case,” Salazar said. “The community is fighting like hell to get the COGCC to deny that. It really is left to the whims and wishes of the director … that’s why there is so much pressure on him.”", "description": "How oil and gas production is devastating Colorado communities and endangering the climate", "authors": ["Stephanie Kirchgaessner"], "top_image": "https://i.guim.co.uk/img/media/321b0b291eff2e6cf2ef8700fb66c44e96797986/0_241_5616_3370/master/5616.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5d3b6a69ac4392bccfae244c27445952", "published_at": "2019-10-10"}