{"pub": "mirror", "url": "https://mirror.co.uk/news/world-news/twenty-ancient-coffins-discovered-egypt-20634869", "downloaded_at": "2019-10-16 20:33:37.711813+00:00", "title": "Twenty ancient coffins discovered in Egypt in one of 'most important finds ever'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nArchaeologists have discovered more than 20 ancient wooden coffins near Luxor in Egypt.\n\nAccording to the country's antiquities ministry, the coffins were found on the River Nile's west bank at the Theban necropolis of Asasif.\n\nThey were in two layers, with some on top across those below, and their coloured decorations were still visible.\n\nAn official statement released by the antiquities ministry said: \"This discovery is one of the largest and most important discoveries that have been made over the past few years.\"\n\n(Image: EGYPT ANTIQUITIES MINISTRY)\n\n(Image: EGYPT ANTIQUITIES MINISTRY)\n\nSeveral photographs showing antiquities minister Khaled El-Anany inspecting the coffins alongside the Supreme Council of Antiquities' secretary general Mostafa Waziri have been released.\n\nThe ministry has not revealed which period the coffins are from but have promised to release more details at a press conference on Saturday.\n\nMost of the tombs at Asasif are from the late period (664-332BC) of ancient Egypt.\n\nBut there are also tombs from the earlier 18th dynasty (1550-1292BC) there which include the famous pharaohs Tutankhamun, Thutmose III, Amenhotep III and Akhenaton.\n\n(Image: EGYPT ANTIQUITIES MINISTRY)\n\n(Image: EGYPT ANTIQUITIES MINISTRY)\n\nLast week, the antiquities ministry announced that archaeologists had discovered an ancient \"industrial zone\" in Luxor's Valley of the Monkeys on the west bank of the Nile river.\n\nThis valley is near the Valley of the Kings - the resting place of the mummy of Tutankhamun.\n\nArchaeologists from the State for Antiquities discovered a range of artefacts at the site dating from the 18th Dynasty, including tools, rings, limestone, pottery and a water storage tank.\n\nThey also discovered the remains of workshops, indicating that there may also have been a royal tomb in the area.\n\n(Image: EGYPT ANTIQUITIES MINISTRY)\n\n(Image: HANAA HABIB/EPA-EFE/REX)\n\nZahi Hawassm, former Minister of State for Antiquities, said: “[An] important discovery that we made, was a discovery of the four foundation deposits, near the four foundation deposits, [we] found graffiti and found working man's huts, means there is a royal tomb in this area.\n\n“We know according to some scholars, that when the Egyptians construct a royal tomb they make four or five foundation deposits.”", "description": "Archaeologists made the discovery on the River Nile's west bank near Luxor in Egypt", "authors": ["Lorraine King", "Image", "Egypt Antiquities Ministry", "Hanaa Habib Epa-Efe Rex"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20634908.ece/ALTERNATES/s1200/0_Egypt.jpg", "published_at": "2019-10-16"}