{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/blake-lively-ryan-reynolds-seen-20756501", "downloaded_at": "2019-10-30 14:17:09.744894+00:00", "title": "Blake Lively and Ryan Reynolds are seen for the first time since birth of third baby", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nBlake Lively and her beau Ryan Reynolds were spotted in public for the first time since welcoming their third child earlier this month.\n\nThey appeared to finally be enjoying some adult time together since Blake gave birth to their daughter - whose name has been kept a secret.\n\nThe happy couple were seen on Tuesday making their way home from brunch in New York City.\n\nBlake, 32, was dressed in a cosy long coat with a black and white gingham scarf draped around her neck as she wrapped up for the colder months.\n\nShe dressed her cosy outfit with a pair of black leggings and white trainers, finishing her look with a chunky knit olive beanie that covered her hair.\n\nThe pair looked loved-up as they linked arms while crossing the street to their apartment in a bid to escape the New York autumn air.\n\nMeanwhile Ryan, 43, kept warm in a puffy body warmer layered over several jumpers, paired with slim grey slacks and white sneakers.\n\n(Image: DIGGZY / SplashNews.com)\n\n(Image: DIGGZY / SplashNews.com)\n\nBut parents-of-three Blake and Ryan want to protect their daughter's identity, as Ryan shared a snap of the first family photo on Twitter which read: \"I want my daughters to experience the same natural playground I grew up in.\"\n\n(Image: DIGGZY / SplashNews.com)\n\n(Image: DIGGZY / SplashNews.com)\n\nThey are already parents to daughters Inez, 3, and James, 4, and Lively and Reynolds tied the knot in 2012.\n\nA source told PEOPLE : \"They are so happy and excited about having another baby.\n\n(Image: DIGGZY / SplashNews.com)\n\n\"They really are the most in-love and in-tune couple, and very hands-on parents. They'd have a dozen kids if they could.\"\n\nBlake has previously gushed about creating a family with her husband, as she told Allure in 2012: \"I've always wanted a big family. Oh, I'd love 30 [children] if I could.\"", "description": "Actress Blake Lively and her hubby Ryan Reynolds were spotted coming back from brunch after welcoming their third child earlier this month", "authors": ["Brogan-Leigh Hurst", "Image", "Diggzy", "Splashnews.Com"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20756899.ece/ALTERNATES/s1200/0_PAY-EXCLUSIVE-NO-WEB-UNTIL-340PM-PST-1029Blake-Lively-Seen-Out-With-Hubby-Ryan-Reynolds-For-the-Fir.jpg", "published_at": "2019-10-30"}