{"pub": "huffpost", "url": "https://huffpost.com/entry/mark-zuckerberg-livestream-facebook-leaked-remarks_n_5d96b3a1e4b0da7f662427a1", "downloaded_at": "2019-10-04 07:40:33.073240+00:00", "title": "Mark Zuckerberg Holds Livestream With Facebook After Leaked Remarks", "language": "en", "text": "Facebook CEO Mark Zuckerberg said Thursday that he’ll “try not to antagonize” Sen. Elizabeth Warren any further after transcripts of candid comments he made about her were leaked this week.\n\nAt a livestreamed Q&A with Facebook employees, Zuckerberg talked about leaked remarks he made to employees in July, when he said he was ready to “go to the mat … and fight” if the Massachusetts Democrat becomes president and attempts to break up tech giants like Facebook.\n\n“Sure, I may have said it in more of an unfiltered way, but fundamentally we believe in everything that was in there,” he said of the audio recordings published Tuesday by The Verge. “At this point, I do such a bad job at interviews, it’s like, ‘What do we have to lose?’”\n\nWarren responded to Zuckerberg’s leaked comments by doubling down on her plan to break up Big Tech, saying: “What would really ’suck’ is if we don’t fix a corrupt system that lets giant companies like Facebook engage in illegal anticompetitive practices, stomp on consumer privacy rights, and repeatedly fumble their responsibility to protect our democracy.”\n\nZuckerberg’s livestream came out as Attorney General William Barr joined officials from Britain and Australia in asking the Facebook CEO to delay plans to encrypt its messaging services, including Messenger, WhatsApp and Instagram.\n\nA letter dated for Friday and obtained by BuzzFeed says that end-to-end encryption will prevent law enforcement from being able to track illegal activity on the platforms, and it requests that Facebook allow law enforcement backdoor access into such messaging.\n\nAt the Q&A on Thursday, Zuckerberg said that he understands officials’ concerns and that the issue is “one of the core tensions that I think we face.” But a Facebook spokesperson told the Daily Beast that the company will “strongly oppose attempts to build backdoors because they would undermine the privacy and security of people everywhere.”", "description": "The Facebook CEO spoke of his candid comments about Sen. Elizabeth Warren and demands by Attorney General William Barr on encryption of messaging apps.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d96b6cc2000005e004c32fd.jpeg?cache=v8gq0i7fyr&ops=1778_1000", "published_at": "2019-10-04"}