{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/bride-told-never-use-legs-walks-aisle-wedding-11008666", "downloaded_at": "2019-10-30 07:54:33.231909+00:00", "title": "Bride who was told she would never have use of her legs walks down the aisle", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nEmma Kitson was told she would never have use of her legs again after crushing her spine working as a gunner with the Royal Artillery.\n\nBut she stunned everyone by walking down the aisle on her wedding day.\n\nEmma, 35, joined the army as a gunner with the Royal Artillery when she was just 18 and saw active service in Iraq in 2003.\n\nAdvertisement\n\nAdvertisement\n\nAs one of a very small number of female gunners, she wanted to prove herself and ‘keep up with the lads’, not realising the 100lb shells – AS90 bullets for tanks – she was carrying on her back were slowly damaging her spine.\n\nEmma Kitson (right) in the army (Picture: SWNS)\n\nShe left the army as a 21-year-old, when the pain in her back became too much to bear.\n\nThe pain became worse throughout her twenties, and seven years ago doctors told her they would need to operate to try to repair the damage.\n\nWhen Emma woke up from surgery, she couldn’t feel her left leg. She has needed to use a wheelchair ever since due to the extreme pain she experiences while walking.\n\nBut when her partner, swimming coach Chris Kitson, 38, proposed, Emma was determined to spend most of her wedding day out of her wheelchair.\n\nYears spent carrying heavy shells in the army crushed Emma’s spine, and after surgery she is now in too much pain to walk (Picture: SWNS)\n\nShe put in hours of training to strengthen her legs, allowing her to make the 20ft journey to the altar without her wheelchair.\n\nEmma didn’t tell anyone of her plans, including her husband-to-be, so they were all surprised to see her walk on the day.\n\nShe managed the walk down the aisle with her dad and her son by her side, then had her husband for support on the way back. She also took ‘tons’ of medication to help with the pain.\n\nAdvertisement\n\nAdvertisement\n\nDebt charity worker Emma said: ‘I thought to myself “whatever happens when I get out of that church I actually do not care”.\n\n‘If I’m in a wheelchair for the rest of my life I do not care because I can actually say I’ve walked to Christopher and then I’ve walked with him out of the church, and that’s everyone’s dream, isn’t it?\n\nShe was determined to walk down the aisle on her wedding day, and she did it (Picture: Your Story Studios / SWNS)\n\nShe danced, too (Picture: Your Story Studios / SWNS)\n\n‘I wanted to avoid being in my wheelchair for as much of the day as possible – I wanted to show my dress off as much as I could on my special day.’\n\nTraining was tough – at one point Emma pushed herself so hard she managed 29 seconds walking on the treadmill.\n\nThankfully Emma is used to pushing her limits. She took part in last year’s 2018 Canada Invictus Games and won three swimming gold medals and a bronze in power-lifting, and met Chris as a result.\n\nHer journey in fitness began when she entered the Warrior Games, a multi-sport event for wounded, injured or ill service personnel and veterans organised by the United States Department of Defence, in 2014.\n\n‘It was being with the squaddies again,’ Emma added. ‘Some of them have lost limbs and it just put my life into perspective.’\n\nEmma Kitson with husband Chris and kids Kiera (14) & Archie (10) at the Invictus Game (Picture: SWNS)\n\nThe games gave her back her confidence and gave her the strength to leave an abusive relationship.\n\nAdvertisement\n\nThen while training for the Invictus Games, she met Chris. She says he made her feel like ‘life was worth living again’.\n\nThe couple now live in Halifax with their daughter Charlotte, three, and Emma’s children from a previous relationship, Kiera, 14, and Archie, 10.\n\n‘I am now more active than I have ever been, and my children are also achieving their own sporting goals,’ said Emma.\n\n‘Yes, I am in constant pain and on so many painkillers that I would rattle if you shook me, but I get on with my life and I enjoy it.\n\n‘Right now I am really happy that I ended my single life walking, and started my married life walking.\n\n‘I do not see myself as an inspiration. I make my own inspiration. Everybody can be their own inspiration, you can achieve your dreams.’\n\nMORE: Dare you not to cry at this groom surprising the bride with a kitten on their wedding day\n\nMORE: Bride ties the knot wearing a wedding dress made of patches crafted by friends and family\n\nAdvertisement Advertisement", "description": "Emma Kitson trained for hours in order to surprise her husband by walking down the aisle on their wedding day.", "authors": ["Ellen Scott"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_93862968_1572418431.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-30"}