{"pub": "yahoo", "url": "https://sports.yahoo.com/fantasy-football-should-you-buy-or-sell-these-young-showstealing-w-rs-181114553.html", "downloaded_at": "2019-09-12 07:11:40.817614+00:00", "title": "Fantasy Football: Should you buy or sell these young, show-stealing WRs?", "language": "en", "text": "Young receivers absolutely stole the show in Week 1. Whether we’re talking about highly regarded rookies or a few post-hype sleepers, the youth movement kicked down the door of the new season, making quite the loud entrance as they shoved their way to the front of fantasy waiver wires.\n\nMarquise Brown, A.J. Brown, Terry McLaurin, John Ross, Michael Gallup, D.J. Chark … all secured yardage at or north of the century mark; all made big-time, highlight-worthy plays, flashing explosiveness that certainly helped make them hot adds off the wire.\n\nThe sheer number of young players who shined was certainly unique but it’s a phenomenon that seasoned fantasy managers have seen far too often. Young player explodes ... then promptly does nothing for the next few weeks before being cast off for a bye-week defense.\n\nScroll to continue with content Ad\n\nKoh Knows\n\nSo of these young high-flyers, whose stock are you buying, whose stock are you selling off like Lyft shares after it’s been battered 30 percent? (Totally didn’t happen to me and I’m totally not bitter about it.)\n\nTOO MANY BROWNS\n\nWhether we’re talking Cleveland fantasy assets or Antonio or “Hollywood” or A.J., there were far too many Brown storylines after Week 1. But for the purposes of this article, we’ll focus on the rookies.\n\nMarquise Brown, Baltimore Ravens\n\nHollywood was an absolute stud in his NFL debut as the Ravens demolished the Dolphins. Four receptions on five targets for 147 yards and two touchdowns, that’ll work just fine for your flex, right?\n\nWell, here’s the thing … Brown only played on — get this — 12 offensive snaps. It was the fewest number of snaps among all the team’s receivers, good for just 17% of the overall offensive plays.\n\nStory continues\n\nI get it, with the explosiveness he exhibited, it stands to reason that the rookie will see more playing time moving forward, but even if he gets up to 50 or 60% snap share, it’s awfully hard to trust that level of playing time.\n\nPlus, from a strategic standpoint, the Dolphins basically ran a single high safety for almost the entire game, daring Lamar Jackson to throw … and throw he did.\n\nI can’t imagine future opponents will be as ill prepared as Miami moving forward, even if the schedule reads extremely soft (ARI, KC, CLE, PIT, CIN).\n\nJust due to overall volume concerns, I expect the rookie to come back down to earth.\n\nVERDICT: SELL\n\nA.J. Brown, Tennessee Titans\n\nWhatever I just wrote for Marquise, read again for A.J. He only played on 39% of the Titans’ offensive snaps. He ended up converting his paltry four targets into three receptions for 100 yards, but with an asterisk or two.\n\nBrown picked up 56 of those yards after the catch. YAC yardage is tough to come by so expect those numbers to come way down moving forward.\n\nAgain, we’re talking about a low-volume receiver in a low-volume passing attack. Tennessee attempted just 437 passes all of last year, the second-fewest passes thrown in the NFL.\n\nVERDICT: SELL\n\nTerry McLaurin, Washington Redskins\n\nThe rookie from Ohio State was able to show out in his first NFL game, grabbing five receptions off of seven targets, good for 125 yards and a score. Unlike his other rookie mates listed above, I do think there’s sustainability here.\n\nMcLaurin played on 91% of the team’s offensive snaps and remember, Washington cut Josh Doctson, meaning other than Paul Richardson, there’s really no other WR on the roster that will push McLaurin for snaps as an outside receiver.\n\nAs a clear-cut starter, there is reason to believe McLaurin will continue to see 5-9 targets per game and anywhere between 90-130 air yards per game as well. That volume puts him in WR2 territory. Plus, you throw in his 4.35 40-speed, and there’s definitely intrigue here.\n\nThis week he plays a tough Dallas defense which should mute his overall production but he’s worth an upside play in deep leagues and is, of course, worth a stash on your bench in 12-teamers.\n\nVERDICT: BUY\n\nPOST-HYPE SLEEPERS: AWAKE OR NAH?\n\nJohn Ross, Cincinnati Bengals\n\nUp until this point, the legend of John Ross >>> the actual game of John Ross.\n\nA top-10 pick in 2017, Ross came into the season with a grand total of 210 receiving yards in his previous 2 years combined.\n\nWaiver wire fodder in many leagues, Ross went on to rack up 158 yards in Week 1.\n\nWhat makes me believe a 3rd-year breakout is possible for the former Washington Husky is twofold: The coaching change and the volume.\n\nOut is Marvin Lewis, in comes former quarterback and Big 12 offensive player of the year in Zac Taylor. The rookie head coach and ex-Nebraska Cornhusker had Andy Dalton toss 51 pass attempts, tied for the third-most attempts in his career.\n\nAnd it’s not as if the Bengals were chasing points either; they led for good chunks of this game. It became abundantly clear Cincy is going all-in on the pass game this year as they threw on an unreal 80% of their offensive plays. For context, in 2018 Green Bay led the NFL in pass play percentage, throwing the ball on 67.54% of their plays.\n\nRoss saw 12 targets Week 1. With A.J. Green out and with Dalton slinging the rock 50+ times per game, I don’t see why eight to 12 targets per game isn’t an easily repeatable figure.\n\nYou throw in his 4.22 40-time, and Ross is an every week upside flex play in 12-team or deeper leagues.\n\nNow that being said, this week against the Niners, his range of outcomes is zero to hero. He could easily post another big line or he could get shut out as he will primarily tangle with Richard Sherman.\n\nVERDICT: BUY\n\nMichael Gallup, Dallas Cowboys\n\nThe second-year man exploded onto the scene in Week 1, catching all seven of his targets for 158 yards against the Giants. And like Ross above, I don’t believe this to be a one-and-done.\n\nGallup played on 78% of the team’s offensive snaps, which actually led all Dallas receivers. Remember, Allen Hurns and Cole Beasley are both gone, freeing up significant playing time for the former Colorado State standout.\n\nAdding to the upside is the fact that former quarterback Kellen Moore is the new offensive coordinator in Dallas, bringing with him a noticeably more aggressive passing offense.\n\nAfter averaging 7.6 air yards per pass attempt last year, Dak Prescott averaged 8.4 air yards per pass in Week 1, according to Next Gen Stats.\n\nIt’s clear Dak is being asked to and deliver on deeper passes. Now, granted, it was the Giants, but still, it’s obvious Moore will be more aggressive in his play-calling, providing more big-play opportunities for the likes of Gallup and Amari Cooper.\n\nVERDICT: BUY\n\nD.J. Chark, Jacksonville Jaguars\n\nThe second-year man out of LSU had four catches for 146 yards and a score in Week 1.\n\nIt was a great game for the 6-foot-3, 200-pound receiver, but color me skeptical for a repeat performance.\n\nChark only saw four targets all game and while he did play on 70% of the team’s offensive snaps, Marquise Lee and Keelan Cole could eat into his overall snap share as the season wears on.\n\nAs for the quarterback situation, free agent acquisition Nick Foles couldn’t make it out of the first quarter before getting hurt and being placed on I.R.\n\nLook, I love me some Gardner Minshew, but I’m not ready to say he and his powerful mustache will be an upgrade for Jacksonville’s passing game.\n\nIf you picked up the Chark Attack, let him ride your bench for the week until we see what his usage looks like moving forward.\n\nVERDICT: SELL\n\nListen to the Yahoo Fantasy Football Podcast", "description": "What should we believe from Week 1's young WR outburst? James Koh analyzes whether you should buy or sell these young studs in your fantasy football leagues.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/Y2YqbKtgegY7I0iKKSnkvw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/xdgMyoGVrTOQgp92gKiXBw--~B/aD0zNjQ4O3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/2088a960-d4bf-11e9-b1f9-8c30db8e4a79", "published_at": "2019-09-11"}