{"pub": "npr", "title": "Brazilian Judge Acquits Man Who Stabbed Jair Bolsonaro", "url": "https://npr.org/2019/06/15/733032255/brazilian-judge-acquits-man-who-stabbed-jair-bolsonaro", "language": "en", "published_at": "2019-06-15", "downloaded_at": "2019-09-02 07:30:04.107722+00:00", "text": "Brazilian Judge Acquits Man Who Stabbed Jair Bolsonaro\n\nEnlarge this image toggle caption Brazil Military Police /AP Brazil Military Police /AP\n\nA Brazilian judge has acquitted a man who stabbed then-presidential candidate Jair Bolsonaro. The judge ruled that Adélio Bispo de Oliveira was mentally ill and ordered him held in a mental facility indefinitely, The Associated Press reports.\n\nJair Bolsonaro was campaigning for president on Sept. 6, 2018 in Juiz de Fora, about 115 miles north of Rio de Janeiro, when he was attacked. NPR's Philip Reeves reported that Bolsonaro was sitting on a supporter's shoulders when an assailant plunged a blade into his stomach. \"The man reportedly told investigators he was acting on the orders of God,\" Reeves reported.\n\nThe attack damaged Bolsonaro's intestines and required a two-hour surgery to stop internal bleeding. After the attack, Bispo confessed and Bolsonaro won the October elections, despite spending three weeks of the campaign in hospital, NPR reported. Voters supported the retired army captain's anti-corruption message, despite his record of disparaging women, the LGBT community and people of color.\n\nJudge Bruno Savino ruled Friday that Bispo would be held in a mental facility within the federal prison system, the AP reports.\n\n\"The hospitalization will last for an indefinite period until medical experts have proven that he is no longer dangerous,\" Savino said in a statement, according to the AP.\n\nBolsonaro has vowed to overturn the decision. The BBC reports Bolsonaro told local media, \"I will contact my lawyer. I will try to do whatever is possible.\"\n\nBrazil's leader has suggested the attack was politically motivated, and says he will find the culprit behind what he believes is a conspiracy.\n\n\"They tried to kill me. I am certain who they were, but I can't say, I don't want to prejudge anyone,\" the BBC reported him saying.\n\nThe acquittal comes as Bolsonaro contends with the first general strike of his presidency. Thousands of people filled the streets on Friday to protest budget cuts and pensions reform. NPR's Philip Reeves reports that unions and opposition groups held demonstrations and blocked roads, and police fired tear gas at protesters.", "description": "The judge says Adélio Bispo de Oliveira was mentally ill when he almost killed the then-presidential candidate during a campaign stop. Bolsonaro, now president, vows to overturn the ruling.", "authors": ["Daniella Cheslow"], "top_image": "https://media.npr.org/assets/img/2019/06/15/ap_18249845421300_wide-525393b9938a97358772684f4e7f4e67fa366d59.jpg?s=1400"}