{"pub": "yahoo", "url": "https://finance.yahoo.com/news/softbank-expects-invest-almost-200-100055337.html", "downloaded_at": "2019-10-30 11:08:01.620683+00:00", "title": "SoftBank Expects to Invest in Almost 200 Companies With Its Vision Funds", "language": "en", "text": "(Bloomberg) -- SoftBank Group Corp. expects to have funded almost 200 companies once its second Vision Fund is up and running, according to Rajeev Misra, the fixed-income veteran who runs the investment vehicle.\n\n\"We have 86 companies in our portfolio in fund one, with another 100 in fund two,\" Misra said at the Future Investment Initiative in Riyadh on Wednesday. \"So those 186 companies interacting with each other and doing business with each other will be immense.\"\n\nVision Fund 2 is the next iteration of SoftBank’s first $100 billion fund, which since 2017 has sent tremors through the startup world with its giant bets on tech companies, including the now-flailing co-working giant WeWork. The Japanese conglomerate is still in the process of raising money for the new fund, and has said it expects it to be even larger than the first.\n\nLast year, SoftBank Chairman and CEO Masayoshi Son told Businessweek that he plans to raise a new $100 billion fund every two to three years, and invest around $50 billion each year.\n\nMisra also said:\n\n\"The fundamental premise of all our portfolio companies is to disrupt regular traditional businesses that are run inefficiently, for whatever reason it may be\" \"They run inefficiently because they have too many middlemen, they run inefficiently because of legacy systems, because of cost management, and to use AI and technology to go in and disrupt those industries -- whether it’s how hotels are run, how cars are sold, healthcare, how homes are sold, etc\"\"AI and technology disruption, unlike internet, is going to disrupt every aspect of the GDP\"Technology disruption “has been fast but it will be much more rapid in the next 5 years\"\n\n--With assistance from Farah Elbahrawy.\n\nTo contact the reporter on this story: Dinesh Nair in London at dnair5@bloomberg.net\n\nTo contact the editors responsible for this story: Shaji Mathew at shajimathew@bloomberg.net, Stefania Bianchi\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- SoftBank Group Corp. expects to have funded almost 200 companies once its second Vision Fund is up and running, according to Rajeev Misra, the fixed-income veteran who runs the investment vehicle.\"We have 86 companies in our portfolio in fund one, with another 100 in fund two,\"", "authors": ["Dinesh Nair"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-30"}