{"pub": "politico", "url": "https://politico.com/story/2019/09/08/pompeo-taliban-afghanistan-trump-1484743", "downloaded_at": "2019-09-08 23:26:42.316831+00:00", "title": "Pompeo: Taliban must behave", "language": "en", "text": "Secretary of State Mike Pompeo said “enormous progress” had been made over the past months working with the Afghan government. | Nicholas Kamm/AFP/Getty Images Foreign Policy Pompeo: Taliban must behave\n\nSecretary of State Mike Pompeo on Sunday said Afghanistan’s Taliban must learn to behave.\n\nPompeo said President Donald Trump broke off peace talks with the Taliban because he is “not going to reward” its behavior after the Taliban killed an American last week. “An agreement is just a piece of paper. We have to actually see that change in behavior,” Pompeo told George Stephanopoulos on ABC’s “This Week.”\n\nStory Continued Below\n\n“When we saw this action when we were closing in on a solution and closing in on opportunity for the president to actually meet with the decision-makers that can actually deliver that reconciliation peace to the Afghan people, President Trump said, ‘That's enough. We're not going to do that; we’re not going to reward that behavior,’ and broke it off,” Pompeo continued.\n\nTrump on Saturday announced he had canceled secret meetings with Taliban leaders and the Afghan president set to take place this weekend at Camp David.\n\nPompeo said “enormous progress” had been made over the past months working with the Afghan government.\n\n\"We had a commitment from the Taliban that said they would break from al-Qaida publicly and permanently,\" Pompeo added. \"We had a commitment from them that said they would reduce violence.\n\n“We had a commitment that they would meet in Oslo to begin reconciliation conversation, and then the Taliban overreached,” Pompeo said. “They killed an American in an effort to gain leverage at the negotiating table, and President Trump said, 'Enough.'”\n\nPompeo acknowledged that in the past, peace talks had resumed in the face of other attacks, but, he added American forces are “putting real pressure on the Taliban.”\n\n“In just the last 10 days alone, we've killed over 1,000 Taliban,” he said.\n\nPompeo said America’s negotiator will be returning to the United States for now.", "description": "\"President Trump said ‘that's enough,’” Pompeo said. “‘We're not going to do that, we’re not going to reward that behavior,’ and broke it off.”", "authors": ["Bianca Quilantan"], "top_image": "https://static.politico.com/60/bb/0baa5b35420181329d7f14913f6c/180925-mike-pompeo-gtty-773.jpg", "published_at": "2019-09-08"}