{"pub": "independent", "title": "Original Flava cookbook: Recipes from ackee fish to pumpkin rice", "url": "https://independent.co.uk/life-style/food-and-drink/recipes/original-flava-recipe-cookbook-ackee-fish-pumpkin-rice-cooking-instructions-a9081456.html", "language": "en", "published_at": "2019-08-28", "downloaded_at": "2019-09-02 07:34:10.064270+00:00", "text": "A ckee and saltfish\n\nServes 4–6\n\n600g boneless salt cod\n\n2 tbsp vegetable oil\n\n1 medium onion, finely diced\n\n4 garlic cloves, finely chopped\n\n3 spring onions, thinly sliced\n\n1 scotch bonnet pepper, deseeded and finely chopped\n\n1 tsp dried thyme\n\n1 tsp ground pimento (allspice)\n\n1⁄2 red bell pepper, deseeded and finely diced\n\n1⁄2 green bell pepper, deseeded and finely diced\n\n1 large tomato, diced\n\n2 x 540g cans ackee, drained\n\nFreshly ground black pepper\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nPut the salt cod in your pot and cover with cold water. Bring to the boil, then boil for 5 minutes, drain and add fresh cold water to cover. Repeat this process until you’re happy with the saltiness when tasted; we boil the fish three times in total for a perfect balance of salt. Drain for the final time and leave to cool. Use a fork to shred the saltfish into pieces and set aside.\n\nNow you’ll need a large frying pan. Pour the vegetable oil into the frying pan and place over high heat. Once the oil is sizzling hot, turn the heat down to medium-low. Add the onion, garlic, spring onions and scotch bonnet, then cook until soft, for around 5 to 7 minutes.\n\nAdd the saltfish, dash in some black pepper, the thyme and pimento or allspice, then mix together and cook down for around 3 minutes.\n\nNext, add in the red and green bell peppers, along with your tomato. Mix together and cook down for 2 to 3 minutes. These ingredients help to bring a heat balance, so it’s not too spicy.\n\nNow you’ll need to add in your ackee and dash in a likkle more black pepper. Fold in the ackee; the ackee is soft so it’s important to fold it in very gently – nobody likes mushy ackee. Once folded in, simmer for 3–5 minutes before serving. Food DUN! Enjoy.\n\nPumpkin rice\n\nThis recipe is full of flavaful spices to give the dish a mild kick and a warm, scented aroma, and its authentic, rich colour comes from adding pumpkin. All in all, it’s an exciting way to spice up ya rice! The recipe is straight from Jamaica, where we had it for the first time in our family’s homes and also from street-food stalls.\n\nThe pumpkin season is short, but you can use butternut squash as an alternative. Why not try it with some tasty roasted veg skewers or curry chicken? The flavours will give you that Caribbean spicy feeling. YA MON!\n\nServes 4\n\n1 tbsp olive oil\n\n1 small onion, diced\n\n1 small red onion, diced\n\n4 garlic cloves, finely chopped\n\n1 tsp salt\n\n1 tsp freshly ground black pepper\n\n1 tsp ground pimento (allspice)\n\nHandful of fresh thyme sprigs\n\n500g pumpkin or butternut squash, peeled, deseeded and diced\n\n250ml vegetable stock\n\n250ml coconut milk\n\n1 scotch bonnet pepper\n\n400g long-grain or basmati rice\n\nAdd the oil to a large pot over a high heat, then add the onions and garlic. Cook down over a medium heat for 5–7 minutes until soft.\n\nSeason with the salt, black pepper, pimento and thyme, then add the diced pumpkin or squash and mix together. Add 250ml cold water, bring to the boil and simmer for 15 minutes. Add the stock and coconut milk, along with the scotch bonnet.\n\nRinse the rice well under cold running water, then add to the pot. Cook for 15 minutes, stirring from time to time, until the rice is cooked. Season to taste and serve.\n\nRoti\n\nProbably the most popular dish to come out of Trinidad, the roti has a similar shape to a large tortilla wrap, but the method is completely different and uses lots of butter to give it a soft, melt-in-the-mouth texture. The traditional cooking process requires equipment that’s not in your everyday kitchen, so we’ve put our spin on it and created an easy alternative that can be cooked at home in a simple frying pan.\n\nWe love going to authentic Trini food spots and eating some good roti with a chana (chickpea) or lentil curry inside, wrapped with the roti bread. Finger-lickin’ heaven!\n\nMakes 6\n\n650g plain flour, plus extra for dusting\n\n3 tsp baking powder\n\n1⁄4 tsp salt\n\n400ml water\n\n100ml vegetable oil\n\n1 tbsp melted butter, plus extra for brushing\n\nMix the flour, baking powder and salt together in a mixing bowl and add the water a likkle at a time until the mixture comes together in a soft dough. Knead into a ball and let sit for 15 minutes.\n\nDust your work surface with flour, spread the dough out into a medium-sized thick sausage shape, and cut into 6 evenly sized pieces.\n\nFlatten out one piece into a small circle, dust with flour and then, using a rolling pin, roll out into a round as thinly as possible (about 1 to 2mm) without splitting or tearing the dough.\n\nDo this with each piece of dough. Place on a plate, covered with damp kitchen paper.\n\nMix the oil and the tablespoon of melted butter together.\n\nLightly coat a frying pan with this oil mixture and place over a high heat. Once hot, turn down to a medium–high heat and place a roti in the pan.\n\nCook for 30 seconds or until you see bubbles form on the surface, then turn over the roti and cook on the second side for a further 30 seconds.\n\nPat the roti down slightly and keep flipping it over, from one side to the other, brushing with the melted butter. Continue until the roti starts to take on some colour.\n\n‘Original Flava: Caribbean Recipes from Home’ by Craig & Shaun McAnuff is out now (Bloomsbury, £20). Photos: Matt Russell", "description": "Ackee and saltfish Serves 4–6", "authors": ["Craig", "Shaun Mcanuff"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/28/09/ackee-saltfish-recipe.jpg"}