{"pub": "businessinsider", "url": "https://businessinsider.com/inside-kelloggs-approach-to-cracking-digital-and-e-commerce-2019-9", "downloaded_at": "2019-09-16 23:27:44.018994+00:00", "title": "A top Kellogg exec reveals what traditional CPG companies get wrong about e-commerce — and provides a blueprint for how to approach it instead", "language": "en", "text": "LAS VEGAS — Traditional retailers and large CPG brands have been slow to adapt to e-commerce. Julie Bowerman, chief global digital consumer and customer experience officer at Kellogg Co., explained why this happens — and what they can do about it.\n\nSpeaking at Groceryshop, a conference for CPG brands, grocers, mass retailers, and startups, Bowerman said that these traditional companies' scale and legacy structures and lack of leadership support impedes their growth.\n\nThese companies also face short-term market pressures and typically don't hire pure digital experts, which holds back the e-commerce efforts they do make.\n\n\"The categories that we participate in are modest growth categories, so it's hard to have scale...to justify investment,\" Bowerman said. \"So I call it 'checking the digital box because I did this, and I've worked for companies that did this,' where we just took brick-and-mortar and put it online. We would only invest in e-commerce based on scale... and that doesn't work. You have to invest ahead of scale.\"\n\nBowerman, who had a long career at consumer packaged goods companies including Coca-Cola and Hain Celestial, said that traditional retailers and CPG companies need to combine the scale and structure of their legacy businesses and the speed, direct nature, and digital expertise of digitally native brands.\n\nRead More: Direct-to-consumer brands like Casper, FabFitFun, and Peloton are turning to scientific testing to find out which ads are a waste of money\n\n\"I believe that if you're a big brand, you need to sit in the middle,\" she said. \"That's what we're doing at Kellogg's.\"\n\nKellogg has set up an integrated digital team and established e-commerce business metrics\n\nAt the cereal giant, Bowerman combined consumer marketing, shopper marketing, and customer management into one digital team. She also hired not only tech and digital talent from startups, but traditional retail experts.\n\nTo ensure that its e-commerce ambitions have support from the top, Bowerman said she established business growth metrics that Kellogg's leaders would understand and care about, like accretive economics, or whether the company is making more money than it does offline; category leadership; brand health; and channel growth. These metrics have also been integrated into the company's P&L and measurement routines, she said.\n\n\"We don't think about this [e-commerce] as just sales; we don't think about it just as brand marketing,\" she said. \"The beauty of e-commerce is that it's a platform that drives both transaction and builds brands.\"\n\nTo appeal to naysayers, she paints a picture for leaders of what the business could look in five years if Kellogg doesn't embrace e-commerce, she said. Bowerman also shared how she has done actual demos, like using Amazon Prime to get Coca-Cola delivered during a meeting while she worked at the company.\n\nBowerman said that she looks for employees who will break down barriers, work across disciplines and teams, and take ownership of different agendas.\n\nThe approach is already yielding results, she said, pointing at strong online customer ratings for Kellogg's brands and industry awards it has won for customer satisfaction.\n\nKellogg's brands are also acing search rankings, appearing as the top organic search result for when anyone looks for \"cereal\" and \"chips/crisps,\" and doubling their digital growth rates globally. In the US, Canada and India, digital growth was up 37%, 145% and 49% year-over-year in the first quarter, Bowerman said.", "description": "Kellogg has made strides in e-commerce by setting up an integrated team, establishing business metrics and hiring right, said Julie Bowerman.", "authors": ["Tanya Dua"], "top_image": "https://amp.businessinsider.com/images/5d7f9d002e22af16465d1d53-2732-1366.jpg", "published_at": "2019-09-16"}