{"pub": "yahoo", "url": "https://sports.yahoo.com/many-yards-mitch-trubisky-throw-054056180.html", "downloaded_at": "2019-09-23 00:16:01.283452+00:00", "published_at": "2019-09-22", "title": "How many yards will Mitch Trubisky throw for vs. Washington?", "language": "en", "text": "The 2019 NFL season is still very young with only two weeks in its rear-view mirror, but the talking points surrounding Chicago Bears QB Mitch Trubisky are starting to get really old. He's been the subject of relentless criticism because of the offense's slow start and while some concerns regarding his development have merit, most of them are the product of impatience.\n\nFor example, the lazy suggestion that Trubisky is a bust because his 2017 NFL draft classmates Patrick Mahomes and DeShaun Watson, both of whom he was drafted ahead of, are already league superstars is just wrong. Players evolve and develop at different speeds. Trubisky is the only one of the three on his second head coach and is only just now beginning to develop timing with his receivers, all of whom were added to the team via free agency or the draft last season. Neither Watson nor Mahomes have had nearly as much turbulence and turnover as Trubisky through three seasons. And that matters.\n\nScroll to continue with content Ad\n\nIt also matters who a quarterback faces from week to week. Trubisky's 2019 season started against two of the NFL's better defenses in Green Bay and Denver, so his poor stat line is a combination of his below-average play meeting above-average defenses. It's tough for a young quarterback to get out of a slump when he's battling top-tier pass rushers and quality secondaries along the way.\n\nFortunately, he'll get his first big opportunity to put up quality stats against the Redskins Monday night; Washington is one of the NFL's worst defenses right now, including against the pass.\n\nBut Bears fans are still somewhat skeptical about Trubisky's ceiling in Week 3. A matchup like this should make a 300-yard game within his reach. Maybe even a couple of touchdowns. But according to a recent poll I ran on Twitter, Bears fans don't see it coming out that way.\n\nHow many yards will #Bears QB Mitch Trubisky throw for against Washington? — Bryan Perez (@BryanPerezNFL) September 21, 2019\n\nThe majority of fans (36%) think Trubisky will end the game with somewhere between 200-249 yards, which by today's NFL standards is very (very!) average. If you factor the 29% who think he won't even reach 200 yards, you end up with 65% of Bears fans thinking Trubisky won't reach 250 yards and, in theory, could struggle to even hit the 200-yard mark.\n\nThat's pretty surprising, considering the numbers the Redskins have given up in Weeks 1 and 2. Carson Wentz threw for 313 yards and three touchdowns in Week 1 against and Dak Prescott sliced them up for 269 yards and three touchdowns last Sunday. There's no reason to think Trubisky can't have a game similar to Prescott's, assuming Matt Nagy dials up the right plays to put him in position to succeed.\n\nHow many yards will Mitch Trubisky throw for vs. Washington? originally appeared on NBC Sports Chicago", "description": "The 2019 NFL season is still very young with only two weeks in its rear-view mirror, but the talking points surrounding Chicago Bears QB Mitch Trubisky are starting to get really old. He's been the subject of relentless criticism because of the offense's slow start and while some concerns regarding", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/j2878u0wT.0.2qbiXyBdMg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/anoiCnpRzOA44xNfULCl2A--~B/aD0zNDU2O3c9NTE4NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/csnchicago.com/12988f43c726657ada266037e02523f4"}