{"pub": "yahoo", "url": "https://finance.yahoo.com/news/study-big-food-brands-may-be-falling-short-on-lofty-climate-goals-211535878.html", "downloaded_at": "2019-09-08 23:28:50.423531+00:00", "title": "Study: Big food brands may be falling short on lofty climate goals", "language": "en", "text": "Big brands like McDonalds (MCD), Nestlé (NESN.SW), and Walmart (WMT) are championing climate action, but a network of investors argue the big brands’ suppliers aren’t aligned with their messaging.\n\nA new report suggests that the bold public commitments these big brands have made diverge from the reality.\n\nWithin the vast global food supply chain, there’s a large gap between what big food brands commit to in terms of reducing the environmental impact, and what their suppliers have in place, according to the latest Protein Producer Index from the Farm Animal Investment Risk and Return (FAIRR).\n\nThe FAIRR index is created to bring transparency into the “hidden” supply chain by tracking 60 of the world’s largest exchange-listed protein suppliers.\n\nIt assigns a “risk rating” determined from nine critical risks that impact sustainable farming including greenhouse gas emissions, food safety, and working conditions for laborers.\n\n“It is the companies hidden upstream in the meat and dairy supply chain who face the most significant climate and public health risks,” said Jeremy Coller, FAIRR founder said in a statement.\n\n“Our research shows that the largest animal protein producers have failed to deliver any solutions,” he said — with some of the key offenders being suppliers to McDonalds, Tesco (TSCO.L), Nestlé, and Walmart.\n\nMcDonald's on Tuesday, March 20, 2018, announced a number of steps it will take to cut the greenhouse gases it emits into the air, including tweaking the way the beef in its Big Macs and Quarter Pounders is produced. The Coller FAIRR Protein Producer Index 2019 findings revealed the fast food giant's suppliers do not measure their greenhouse gas emissions. (AP Photo/Keith Srakocic, File) More\n\nThe FAIRR network is made up of institutional investors holding $17.1 trillion in assets under management. The group believes “intensive animal production poses material risks to the global financial system and hinders sustainable development.”\n\nFor instance, McDonald’s has a target to reduce 31% of greenhouse gas emissions across its supply chain by 2030. Yet according to FAIRR, three-quarters of major meat, fish, and dairy producers suppliers do not measure emissions.\n\n“When we took a deep-dive look into the actual producers, we didn’t see these public commitments and we didn’t see the public available data or information,” said Maria Lettini, Director of FAIRR on YFi PM.\n\n“It’s up to us there and the investor market to connect the dots there to ask the producers and sellers to see if they’re actually aligned with the commitments we’ve seen,’ said Lettini.\n\nFor example, Walmart commits to zero net deforestation in its supply by 2020, but suppliers such as Sanderson Farms (SAFM) do not have expressed commitments to reduce deforestation, FAIRR pointed out.\n\n“These companies urgently need to address issues such as climate risk, deforestation and antibiotic use to future proof their own business models,” Coller said.\n\nIn doing so, these companies should “prevent the commitments of their customers, the high-street brands, from becoming nothing but fake promises,” he added.\n\n\n\n\n\n\n\nGrete Suarez is producer at Yahoo Finance for YFi PM and The Ticker. Follow her on Twitter: @GreteSuarez\n\nRead more:\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.", "description": "Brands McDonalds (MCD), Nestlé (NESN.SW), and Walmart (WMT) are championing climate action, but a network of investors said the big brand suppliers aren’t aligned with their messaging.", "authors": ["Grete Suarez"], "top_image": "https://s.yimg.com/uu/api/res/1.2/VrGJ1nH1HOoNC71u4IUgPQ--~B/aD0yMjE2O3c9MzI4MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/b392a6f0-d0ed-11e9-be7d-b29919931860", "published_at": "2019-09-08"}