{"pub": "reuters", "url": "https://in.reuters.com/article/india-kashmir-pakistan/pakistan-warns-of-genocide-in-kashmir-expects-no-talks-with-india-idINKCN1VV14L", "downloaded_at": "2019-09-10 23:37:00.902587+00:00", "title": "Pakistan warns of genocide in Kashmir, expects no talks with India", "language": "en", "text": "GENEVA (Reuters) - Pakistan’s foreign minister told the United Nations human rights forum on Tuesday that India’s military presence in the disputed Muslim-majority territory of Kashmir raised the spectre of genocide.\n\nPakistan foreign minister Shah Mehmood Qureshi addresses the United Nations Human Rights Council in Geneva, Switzerland, September 10, 2019. REUTERS/Denis Balibouse\n\nIndia, which stripped Kashmir of its autonomy on Aug. 5, in response accused Pakistan of “offensive rhetoric..of false allegations and concocted charges” against it.\n\nIndia and Pakistan both rule parts of the Himalayan region while claiming it in full. They have fought two wars over it and India’s move to impose direct rule on its side of the de facto border has reignited hostility.\n\nPakistani Foreign Minister Shah Mehmood Qureshi evoked past and current atrocities in Europe, Africa and Asia when he addressed the U.N. Human Rights Council in Geneva.\n\n“The forlorn, traumatised towns, mountains, plains and valleys of Indian-occupied Jammu & Kashmir reverberate today, with the grim reminders of Rwanda, Srebrenica, the Rohingya, and the pogrom of Gujarat,” he said.\n\n“I shudder to mention the word genocide here, but I must... The Kashmiri people in the occupied territory - as a national, ethnic, racial and religious group of people - face grave threats to their lives, way of living and livelihoods from a murderous, misogynistic and xenophobic regime.”\n\nLater India’s vice minister for foreign affairs , Vijay Thakur Singh, took the floor at the forum to hit back.\n\n“The world is aware that this fabricated narrative comes from the epicentre of global terrorism, where ring-leaders are sheltered for years,” she said.\n\n“This country conducts cross-border terrorism as a form of alternate diplomacy,” she added, without naming Pakistan.\n\nIndia flooded the Kashmir valley with troops, restricted movements and cut off communication as Prime Minister Narendra Modi withdrew special rights for the region on Aug. 5. Mobile and internet connections have been cut off ever since.\n\nSingh said the Jammu and Kashmir civil administration was ensuring basic services and essential supplies, and restrictions were being eased.\n\n“Temporary preventive measures were needed to ensure security in the face of credible threats of cross-border terrorism,” she said.\n\nIndia has battled separatist militants in its part of Kashmir since the late 1980s, accusing Muslim Pakistan of supporting them. Pakistan denies that, saying it only offers political support to the people of Kashmir.\n\nQureshi, speaking to reporters, said: “I do not see in the present environment any possibility of a bilateral engagement with India.”\n\nHe urged U.N. Secretary-General Antonio Guterres and the Security Council to help defuse tensions.\n\n“Today 8 million people are in prison, deprived of every political and civil liberty. The world cannot remain silent,” he said.\n\nSlideshow (6 Images)\n\nHe said that if India used some pretext to attack Pakistan, Islamabad would respond.\n\n“And we will respond with force, and you never know, we could be into an accidental war,” he said.\n\nIndian and Pakistani forces regularly trade fire across a 740-km (466-mile) Line of Control, which is the de facto border.", "description": "Pakistan's foreign minister told the United Nations human rights forum on Tuesday that India's military presence in the disputed Muslim-majority territory of Kashmir raised the spectre of genocide.", "authors": ["Stephanie Nebehay", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190910&t=2&i=1428366356&w=1200&r=LYNXNPEF890YL", "published_at": "2019-09-10"}