{"pub": "cbs", "url": "https://cbsnews.com/news/governor-andrew-cuomo-announces-flavored-vaping-e-cigarette-ban-in-new-york-state-amid-lung-disease-deaths", "downloaded_at": "2019-09-15 23:10:43.025464+00:00", "title": "New York Governor Andrew Cuomo announces ban on flavored e-cigarettes", "language": "en", "text": "New York Governor Andrew Cuomo announced an \"emergency executive action\" on Sunday to place a ban on the sale of flavored e-cigarettes. The governor's office said the executive order will advance legislation that aims to eliminate deceptive marketing practices of e-cigarettes to underage users and raises the purchasing age of e-cigarettes from 18 to 21-years-old.\n\n\"New York is confronting this crisis head-on and today we are taking another nation-leading step to combat a public health emergency,\" Governor Cuomo said in a statement. \"Manufacturers of fruit and candy-flavored e-cigarettes are intentionally and recklessly targeting young people, and today we're taking action to put an end to it. At the same time, unscrupulous stores are knowingly selling vaping products to underage youth - those retailers are now on notice that we are ramping up enforcement and they will be caught and prosecuted.\"\n\nAccording to the governor's office, New York state police will now partner with the Department of Health to conduct undercover investigations under the Adolescent Tobacco Use Prevention Act. Under the executive order, retailers who are caught selling tobacco and vaping products to underage individuals will face criminal penalties on top of civil penalties.\n\nWhat we still don't know about the effects of vaping\n\nOn Sunday morning, Cuomo held a press conference with New York State Health Commissioner Dr. Howard Zucker. Cuomo said the new executive order could go into effect within two weeks and said the state police superintendent will work with the Department of Health commissioner to crack down on stores selling products to people under 18. The Cuomo administration would like to start enforcing the executive order by October 4.\n\nCuomo was critical of the vaping industry's power over lawmakers in Washington, D.C. He said that \"we're on our own\" in terms of federal government action regarding guns, opioids, and vaping and said he believes vaping industry lobbyists are capable of stopping federal action because \"their money can buy Washington.\"\n\nCuomo's executive action comes as the Trump administration is trying to ban all non-tobacco flavored vaping products from the market. Last week, President Trump declared during an Oval Office meeting on e-cigarettes. It's a move aimed at dissuading children from picking up the habit of vaping.\n\nMr. Trump said he wants parents to know his administration is carefully reviewing e-cigarettes. The products have been linked to a growing number of lung-related diseases and deaths recently.\n\n\"We may very well have to do something very, very strong about it,\" the president told reporters.\n\nHealth and Human Services Secretary Alex Azar elaborated on plans for the FDA to develop guidelines to remove all e-cigarette flavors except plain tobacco from the market. Azar insisted to reporters that the administration is well within its rights to do so, saying the Obama administration allowed the products to go to market without enough certainty that they were safe.\n\nKathryn Watson contributed to this report", "description": "Cuomo's executive action comes as the Trump administration is trying to ban flavored vaping products from the market", "authors": ["Brian Pascus"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2018/12/17/d019e4a0-b78f-4dcc-9cfc-8fd4f9f360e9/thumbnail/1200x630/f803e0a95a5bdfaf13bdfd2d3b7f6dc1/ap-18311129112155.jpg", "published_at": "2019-09-15"}