{"pub": "yahoo", "url": "https://news.yahoo.com/were-asking-dig-deep-biden-155937332.html", "downloaded_at": "2019-10-28 02:47:44.511670+00:00", "title": "'We're Asking You to Dig Deep': Biden Seeks to Steady Finances as Allies Fret", "language": "en", "text": "Steve Ricchetti, one of Joe Biden’s closest confidantes, is reaching out to wary donors to shore up support. The Biden presidential campaign is watching costs — some staff members are sleeping at homes of volunteers — and facing criticism for spending on chartered jets. Biden’s team is also urging allies to redouble fundraising efforts before the calendar turns to 2020 and he has fewer days to devote to the money trail.\n\nAnd in a confidential memo to top bundlers this week, Biden’s campaign manager, Greg Schultz, sought to allay growing concerns that Biden is facing a cash crunch and will not be able to stay competitive with his rivals on the airwaves and on the ground.\n\n“We will have the resources we need to execute our plan,” Schultz wrote in the memo, obtained by The New York Times. But he simultaneously exhorted the money-raisers to do more: “We’re asking you to dig deep.”\n\nThe Biden campaign and its backers are racing to contain fallout from revelations this month that his campaign is spending more money than it is taking in, unlike his leading rivals. Biden’s cash on hand — $9 million — is now only a fraction of what Sens. Bernie Sanders ($33.7 million) and Elizabeth Warren ($25.7 million) have banked. He even has less on hand than two candidates, Mayor Pete Buttigieg and Sen. Kamala Harris, who are well behind him in the polls.\n\nOn Thursday, the Biden campaign delivered the clearest signal yet that it will do whatever it takes to survive financially, abandoning Biden’s long-held opposition to a super PAC independent of the campaign and clearing the way for donors to give unlimited sums in support of him. Biden advisers cited continuing attacks from President Donald Trump for the reversal.\n\nSix months into his candidacy and 100 days until the Iowa caucuses, Biden is no longer the undisputed Democratic front-runner he once was. He entered the race in April making the case that, as Barack Obama’s vice president and a longtime leader with moderate and liberal views, he stood the best chance of uniting the party, attracting voters across racial, gender and ideological lines and winning over swing voters in battleground states.\n\nWhile Biden still leads in many polls, and many voters still express deep appreciation for him, his financial situation — the inability to consolidate traditional big-money donors or inspire a sufficiently large online base of small contributors — has served as a flashing warning sign about the potential limits of his appeal.\n\nOne rival, Sen. Cory Booker of New Jersey, said pointedly this week that he was “getting calls from people who are Biden supporters who now want to hedge their bet” on the former vice president.\n\nEd Rendell, the former Pennsylvania governor and a Biden fundraiser, acknowledged he had heard the anxieties. “They’re worried when they see only $9 million in the bank, because donors have a tendency to believe the person with the most amount of money wins,” said Rendell, who added that he does not share that view.\n\nSchultz, the Biden campaign manager, said Friday that Biden was facing a financial situation unlike any other Democrat: He is taking incoming fire from both the White House and primary opponents on a daily basis, and needs to play both offense and defense within the limits of $2,800 maximum donations.\n\n“We can’t both do a general election and primary. And no one can,” Schultz said. Of his rivals who have denounced the super PAC reversal, he added, “If they were being attacked with $10 million-plus of outside money in a general election sense, I would love to see what they would do.”\n\nBiden’s allies are not only concerned about his fundraising: There is also the spending. Biden raised $15.7 million in the third quarter, but he spent $2 million more than that. Among his biggest expenses was more than $920,000 on chartered jets.\n\nTerry McAuliffe, the former governor of Virginia and a prolific fundraiser, said that donors were “furious” about the jet spending and called the campaign’s overall money situation “very alarming.” McAuliffe’s wife recently invited donors to attend a fundraiser for Biden at their home in early November.\n\nSchultz, when asked about the chartered travel, said that “whatever maximizes Joe Biden and voter interaction, the greater chance we have to win.” The campaign said Biden had flown commercial but declined to indicate when his last such flight was.", "description": "Steve Ricchetti, one of Joe Biden's closest confidantes, is reaching out to wary donors to shore up support. The Biden presidential campaign is watching costs -- some staff members are sleeping at homes of volunteers -- and facing criticism for spending on chartered jets. Biden's team is also", "authors": ["Shane Goldmacher"], "top_image": "https://s.yimg.com/uu/api/res/1.2/kPNELbzK1dEZ99HmEEfmaQ--~B/aD0yNDAwO3c9MzYwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/the_new_york_times_articles_158/31b1b2f580368b3c8cfc9a18eb4b465c", "published_at": "2019-10-27"}