{"pub": "businessinsider", "url": "https://businessinsider.co.za/heaviest-rugby-players-at-world-cup-and-their-biggest-hits-2019-9", "downloaded_at": "2019-09-28 10:21:50.219556+00:00", "title": "The 10 heaviest players at the Rugby World Cup, and their biggest hits of all time", "language": "en", "text": "The Rugby World Cup in Japan kicked off earlier this month and runs until November 2.\n\nThe tournament plays host to 20 of the world's finest rugby nations, as well as some of the biggest, strongest, and toughest men on the planet - as well as the heaviest.\n\nWe've listed the 10 heaviest players at the tournament alongside some of their most devastating (and sometimes comical) moments.\n\nVisit BusinessInsider.co.za for more stories.\n\nThe Rugby World Cup.\n\nThe quadrennial event where the world's 20 best rugby nations, as well as some of the biggest, strongest, and toughest men from across the planet, come together to battle it out for the sport's most sought after prize - The Webb Ellis Cup.\n\nMost, if not all, of the players who travelled to Japan fall into the above categories of big, strong, and tough - but none more so than these 10 powerhouses.\n\nHere are the heaviest players at this year's tournament, ranked in ascending order, along with some of their most explosive (and occasionally hilarious) moments.\n\n=7: Zane Kapeli — Tonga (287lbs/130 kg)\n\nYou most likely won't recognise Tonga's Zane Kapeli from the above photo, seeing as he's grown himself a huge afro for this year's tournament.\n\nOne man who will recognise Kapeli, however, is England's Billy Vunipola, who found himself on the end of a crunching tackle from the loose forward during the two nation's World Cup opener.\n\nSee Kapeli's monster hit here :\n\n=7: Konstantin Mikautadze — Georgia (287lbs/130kg)\n\nAt 287 pounds and over 6 ft 6\" tall, Georgia's Konstantin Mikautadze is a real man mountain.\n\nUnsurprisingly, such physical attributes make him a dominant force in the scrum, where he's proven himself to be indispensable for his country and his clubs - most recently French side Montpelier Herault - over the last near decade.\n\n=7: Paul Alo-Emile — Samoa (287lbs/130kg)\n\nBorn in New Zealand, Alo-Emile went on to represent Australia as both a schoolboy and at U20s levels, however in 2017, the now 27-year-old decided to pledge his allegiance to Samoa.\n\nIt's proven a wise a decision for both him and his country, with the 287 pound Stade Francais prop emerging as a key figure for the Samoans in their march to the World Cup.\n\n=7: Atu Moli — New Zealand (287lbs/130kg)\n\nIn February last year, Atu Moli sustained an injury whilst playing for former side the Chiefs that had doctors fearing they may have to amputate his leg, according to Stuff NZ.\n\nHowever, after recovering from the setback, Moli was called up to the New Zealand squad for the first time in July, and subsequently the World Cup roster just a few months later.\n\nHe recently signed for the Tasman Mako ahead of the 2019/20 season.\n\nWatch Moli in action here:\n\n=4: Rhys Carre — Wales (291lbs/132kg)\n\nRhys Carre was a surprise call up to Wales' World Cup squad.\n\nBut while surprising, it certainly wasn't unwarranted.\n\nThe 21-year-old (if you can believe that) established himself as a regular for the Cardiff Blues last season, before being picked up by Premiership champions Saracens in the summer.\n\nWatch his welcome video, including some big hits, here:\n\n=4: Latu Talakai — Tonga (291lbs/132kg)\n\nTalakai represents Tonga internationally, but plays club rugby in New Zealand for Northern District side Eastwood.\n\nThe club, whose hilarious club song includes references to \"beer,\" \"arses,\" and not giving \"a f---\" has a track record of producing international rugby stars - the most recent of whom is Talakai, who made his Tonga debut in 2017 against Wales.\n\nTalakai's not singing, but take a listen here:\n\n=4: Taniela Tupou — Australia (291lbs/132kg)\n\nThe \"Tongan Thor\" made a name for himself as a youngster when he became an internet sensation after footage emerged of him trampling over his competitors as a schoolboy in New Zealand.\n\nSince turning professional in 2015, Tupoa has assumed the much less conspicuous role of prop forward, but that still hasn't stopped him menacing opponents with his superhero-esque strength and power.\n\nThis video is a must watch:\n\n3: Levan Chilachava — Georgia (293lbs/133kg)\n\nLevan Chilachava is an imposing figure on the rugby pitch for his opponents.\n\nBut it turns out the Georgian powerhouse can be just as scary for his teammates too, after the 28-year-old posted a hilarious video to Instagram on Sunday in which he jumped out of a bin to frighten hooker Vano Karkadze.\n\nWell played, Levan.\n\nWatch the Georgian's prank here:\n\n2: Tomas Francis — Wales (298lbs/135kg)\n\nWales' Tomas Francis holds a degree in mechanical engineering.\n\nBut while he might not use his qualification in the literal sense, the big man can certainly engineer himself around the scrum.\n\nThe tighthead prop is a key figure for the Exeter Chiefs - whom he helped lift the Aviva Premiership in 2017 - and for his country.\n\nWales, the current Six Nations champions, kicked off the World Cup with a 43-14 victory over Georgia.\n\n1: Ben Tameifuna — Tonga (333lbs/151kg)\n\nGood luck stopping this man.\n\nWeighing in at 333lbs (151kg), Tonga's Tameifuna is comfortably the heaviest man at the tournament.\n\nUnsurprisingly, \"Big Ben\" has already become a crowd favourite in Japan, however unfortunately for the fans, and of course for Tameifuna, it looks likely Tonga will be going home early after an opening game defeat to England.\n\nThis one's got to hurt:\n\nReceive a daily email with all our latest news: click here.", "description": "The Rugby World Cup in Japan is playing host to some of the biggest, strongest, and toughest athletes on the planet, as well as some of the heaviest.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7199/4fc45b52cf9f485fa1f36aa3f93ccf69.jpg", "published_at": "2019-09-22"}