{"pub": "washingtonpost", "url": "https://washingtonpost.com/arts-entertainment/2019/09/26/kevin-feige-could-be-biggest-thing-happen-star-wars-since-darth-vader", "downloaded_at": "2019-09-26 20:49:10.383820+00:00", "title": "Kevin Feige could be the biggest thing to happen to Star Wars since Darth Vader", "language": "en", "text": "\n\nMarvel Studios President Kevin Feige attends an award show in October 2018. (Jordan Strauss/Invision/AP)\n\nKevin Feige turned B-list Marvel superheroes into Hollywood legends, so imagine what he can do with a lightsaber.\n\nFeige, the president of Marvel Studios, will develop a new Star Wars movie, according to the Hollywood Reporter. As the Skywalker family saga ends this December with the release of “Star Wars: Episode IX — The Rise of Skywalker,” Lucasfilm President Kathleen Kennedy is looking to usher in the next phase in Disney’s faraway universe.\n\n“With the close of the Skywalker Saga, Kathy is pursuing a new era in Star Wars storytelling, and knowing what a die-hard fan Kevin is, it made sense for these two extraordinary producers to work on a Star Wars film together,” Alan Horn, the co-chairman of Walt Disney Studios, told THR.\n\nFeige’s fandom has already proved helpful with that other franchise: With his encyclopedic knowledge of all things Marvel, Feige helped mold Marvel Studios films into the definitive cinematic experience, despite not having control over some of the company’s most popular characters, Spider-Man and the X-Men (who were with Sony and Fox).\n\nWith the movie rights Marvel Studios was able to scoop up with secondary heroes Iron Man, Captain America, Thor, the Hulk, Black Widow and Hawkeye, Feige was able to form the Avengers. The heaviest of those hitters would go on to have solo movies, and the Avengers’ on-screen team-ups turned into worldwide box-office events.\n\n[‘Black Panther II’: Five things we want to see in the 2022 sequel]\n\nThough Marvel Studios and Sony would go on to split the Spider-Man rights for a time, meaning the popular character was added to the Avengers lineup, they have since split. While the two Hollywood powers’ separation when it comes to the wall-crawler has been the one blemish on Feige’s otherwise perfect report card, Feige and Marvel Studios deserve the credit for making Spidey great again after some floundering in movie purgatory. And with Disney purchasing Fox, the X-Men could soon be getting the Feige touch after the disastrous results of Fox’s final X-Men film “Dark Phoenix.”\n\nBut Feige working on anything Star Wars-related is next level.\n\nStar Wars’ return to the big screen — after Disney purchased Lucasfilm from George Lucas for $4 billion — has been a moneymaker, but not without controversy.\n\n“The Force Awakens” guided fans back into this universe with the nostalgia of the original cast, as Harrison Ford, Mark Hamill and the late Carrie Fisher ushered in the next generation of Star Wars heroes and villains.\n\nNext-gen hero/villain combo Rey (Daisy Ridley) and Kylo Ren (Adam Driver) were a part of the next sequel, the divisive “Star Wars: The Last Jedi,” directed by Rian Johnson. But “The Force Awakens” director J.J. Abrams was brought back to try to assure the final film in the new trilogy ends with a satisfying big bang.\n\nThough the franchise’s 2010s comeback has been spotty, as stand-alone films such as “Rogue One” and “Solo” didn’t make the type of waves expected for films so highly anticipated, Feige is seen as someone with the magic touch. He made Ant-Man into a household name, and turned the Guardians of the Galaxy — heroes even die-hard comic fans weren’t that familiar with — into part of a major franchise (and would include both as part of the Avengers machine).\n\nHe could help do something similar with lesser-known or brand-new Star Wars characters, or he could go straight to the big time. Imagine a retelling of a legend such as Darth Vader that delves into his prime years, based on the fantastic tales Marvel Comics has published lately to which Feige has total access. (If Feige made a two-hour Vader movie as good as the final moments of “Rogue One,” they should go ahead and start building statues dedicated to him at all Disney parks.)\n\nWe still haven’t seen the greatest lightsaber battle ever — the one that was supposed to take advantage of modern 21st-century special effects and top the brilliant “Duel of the Fates”/Obi-Wan Kenobi/Qui-Gon Jinn vs. Darth Maul battle from the polarizing “The Phantom Menace.” But we have to imagine Feige probably already has something cooked up to top it, because how can you doubt the guy who made the Infinity Gauntlet common knowledge in the pop culture stratosphere?\n\nDisney is also without a doubt thinking about its big debut in November of Disney+, a monster that will continually need to be fed with content. Original series “The Mandalorian” looks like a winner, but Feige plotting in the Star Wars universe would be an incredible addition to an already loaded streaming service.\n\nBecause Feige fixed Marvel on film. Feige fixed Spider-Man when the brand was dead on arrival. Star Wars doesn’t need fixing, per se, but it does need Feige to give it a fresh shot in the arm.\n\nThe possibilities are too spectacular to ignore. May the Force be with him.\n\nRead more:\n\n‘The Rise of Skywalker’ trailer: 6 takeaways from the Star Wars Episode IX celebration", "description": "The Marvel Studios mastermind is about to enter a galaxy that is far, far away.", "authors": ["David Betancourt", "Reporter Focusing On Comic Book Culture", "September At Pm", "David Betancourt Writes About All Aspects Of Comic Book Culture For The Washington Post'S Comic Riffs Blog."], "top_image": "https://www.washingtonpost.com/resizer/GPJ9KfB5dvddoZubYHAJBWXfWj4=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HEB3DJWV24I6TCJEDW35VR4X7M.jpg", "published_at": "2019-09-26"}