{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/top-business-stories-this-week-wework-vmware-refinery29-2019-10", "downloaded_at": "2019-10-07 00:09:36.013223+00:00", "title": "What's next at WeWork, a secret superpower in the cloud wars, and inside Refinery29", "language": "en", "text": "Hello!\n\nWe're still picking through the wreckage left behind from WeWork's IPO debacle here at Business Insider.\n\nFirst off, Julie Bort and Meghan Morris talked to 20 current and former WeWork employees, executives, and business partners, and unveiled fresh details on life at the company under former CEO Adam Neumann. They reported on an atmosphere in which boundaries between work and play did not exist. You can read their story here:\n\n(If you're interested in how Meghan and Julie went about reporting this story, you can read this Q&A with Meghan.)\n\nWeWork's methods in delivering outsized growth under Neumann are now facing fresh scrutiny. Troy Wolverton, Meghan, and Alex Nicoll reported that in some cases, WeWork offered deep discounts to convince existing customers to move in to its new locations as it went on a growth binge:\n\nFollowing the excesses of the Neumann era, WeWork's two new co-CEOs, Artie Minson and Sebastian Gunningham, are trying to clamp down on costs. Meghan teamed up with Becky Peterson to report that WeWork's planning on shedding up to a quarter of its staff:\n\nMeanwhile, there's a broader question of whether WeWork's failed IPO somehow marks the top. Venture capitalists like Bill Gurley and Fred Wilson have weighed in from Silicon Valley. As Marley Jay reports, the view from Wall Street is less favorable:\n\nAnd then there's the question of what's next for Neumann himself. Dakin Campbell reported Friday that Neumann is in talks with banks about getting new terms on a credit line:\n\nWhat have we missed? Let me know.\n\n-- Matt\n\nMoving markets\n\nAshley Rodriguez reported Friday on exclusive data which suggests Netflix's international growth has bounced back, a story that triggered a spike in Netflix's stock price. The data has a solid track record: Ashley previously reported that in the second quarter the data suggested that Netflix was faltering overseas, just before the streaming giant announced it underperformed on subscriber growth in all regions internationally.\n\nEarlier in the week, Bradley Saacks and Casey Sullivan had the scoop on Silicon Valley cybersecurity company FireEye hiring Goldman Sachs for a potential sale. That too sent FireEye's stock surging.\n\nPrime members had exclusive access to these market moving stories.\n\nReminder\n\nWe're hosting an event focused on the future of transportation in San Francisco on Tuesday, October 22. IGNITION: Transportation will feature speakers like Zoox cofounder Jesse Levinson, Waymo chief external officer Tekedra N. Mawakana, and JetBlue Technology Ventures president Bonny Simi.\n\nThe event is complimentary. You can get more information on the event and apply to attend right here.\n\nFinance and Investing\n\nHere are the top bankers raising money, putting together deals, and raking in millions in the global cannabis industry\n\nCannabis companies have been going public, merging, and acquiring competitors in a race for a competitive edge as cannabis legalization continues to sweep the globe.\n\nMerrill Lynch hiked starting salaries for trainee advisers by $10,000 and has taken on 1,700 newbies so far this year. We have the details.\n\nBank of America's Merrill Lynch Wealth Management has sweetened starting salaries for trainee financial advisers, hired 1,700 newbies so far this year, and deployed performance managers around the country to coach them.\n\nDan Fuss is revered as 'the Warren Buffett of bonds.' He walked us through the investing approach that's delivered market-beating returns and turbocharged his 61-year career.\n\nIt is often said that the bond market is smarter than the stock market.\n\nTech, Media, Telecoms\n\nFantasy-sports site DraftKings is looking to raise new funding at a $2 billion valuation in march toward IPO\n\nThe fantasy-sports site DraftKings is raising hundreds of millions of dollars in fresh funds in a new round that could value the company at as much as $2 billion, two people familiar with the matter told Business Insider.\n\nHealthcare, Retail, Transportation\n\nA wave of private-equity cash has poured into doctors' practices. We got an inside look at how the largest medical group in the US is weighing the benefits and pitfalls.\n\nFor investors like private-equity firms, medicine is an increasingly lucrative target. The trend has aroused concerns among doctors, who worry that it is affecting patient care.\n\nWhy $45 billion pharma giant Roche is teaming up with a buzzy health-insurance startup to find new treatments for diseases\n\nWhen it comes to data, Genentech has its eyes out for all types.", "description": "Here are the top business stories this week, including what's next at WeWork, a secret superpower in the cloud wars, and inside Refinery29's deal with Vice.", "authors": ["Matt Turner"], "top_image": "https://image.businessinsider.com/5d8e71c82e22af24aa3a33b2?width=1200&format=jpeg", "published_at": "2019-10-06"}