{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/drone-attacks-on-saudi-oil-facilities-spark-explosions-and-fires/2019/09/14/b6fab6d0-d6b9-11e9-ab26-e6dbebac45d3_story.html", "downloaded_at": "2019-09-14 09:24:33.439955+00:00", "title": "Drone attacks on Saudi oil facilities spark explosions and fires", "language": "en", "text": "\n\nSmoke is seen after a fire at an Aramco factory in Abqaiq, Saudi Arabia, on Saturday. (Reuters)\n\nISTANBUL – Drone attacks on oil facilities in eastern Saudi Arabia belonging to state oil giant Aramco set off explosions and massive fires early Saturday, according to videos posted online and the Saudi interior ministry, which did not say who had carried out the attacks.\n\nThe two attacks occurred about 4 a.m. in the provinces of Khurais, the site of a large oil field, and Abqaiq, where Aramco maintains its largest oil-processing facility, according to a statement by the Saudi state news agency that quoted the interior ministry. It did not say whether anyone was injured in the attack, adding that Aramco teams were able to bring the fire under control.\n\nThere was no immediate claim of responsibility. A rebel group in Yemen, Saudi Arabia’s neighbor, has previously carried out drone attacks inside Saudi territory. The group, referred to as the Houthis, has been fighting a Saudi-led military coalition inside Yemen for more than four years.\n\nA Houthi drone attack last month on the Shaybah oilfied, also in eastern Saudi Arabia, caused a fire but did not result in any injuries.\n\nSaudi Arabia has also faced a persistent threat from Sunni Muslim extremists, including the Al Qaeda militant group. Al Qaeda carried out an attack on the Abqaiq processing facility in 2006.\n\nVideos posted online early Saturday showed a series of large fires trailing huge plumes of smoke. Large explosions and the sounds of gunfire could be heard in some of the videos.\n\nState-owned Aramco, the most profitable company in the world, is preparing an initial public offering that would raise billions for Saudi Crown Prince Mohammed bin Salman’s social and economic reform program and help wean the kingdom off its dependency on oil revenue.\n\nRead more:\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "description": "The Saudi interior ministry did not say who was responsible for the attacks on the Aramco facilities", "authors": ["Kareem Fahim", "Istanbul Bureau Chief Covering The Middle East", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/WgebAW9J73tTZ5XJE9hD2YT1kns=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KVZQVWWWXUI6TE2DIDNVPT3KXU.jpg", "published_at": "2019-09-14"}