{"pub": "metro", "url": "https://metro.co.uk/2019/10/25/jon-bernthal-quit-ncis-join-walking-dead-people-thought-mind-10983105", "downloaded_at": "2019-10-25 23:59:45.409636+00:00", "title": "Jon Bernthal quit NCIS to join The Walking Dead", "language": "en", "text": "Jon Bernthal ditched an NCIS role for The Walking Dead…\n\nThe Walking Dead’s Jon Bernthal was told he was ‘out of [his] damn mind’ when he gave up a role on NCIS: Los Angeles to audition for the show.\n\nJon ended up playing the role of Shane Walsh in the first two seasons of the zombie drama, a part he wanted ‘real bad’, even though he originally auditioned for the lead role of Rick.\n\n‘I read that [Walking Dead] script and it was the best script I had ever read, best pilot script I ever read. I had auditioned for a part on, I believe, NCIS: LA, and I had gotten it,’ he said at the Fandemic Tour in Houston last weekend.\n\n‘I was going to go do that show — I would still be doing that show. But I had read that script, and I said, “I can’t take this part until I at least audition for The Walking Dead.” Everybody thought I was out of my damn mind, but I was like, “I just gotta try.”’\n\nAdvertisement\n\nAdvertisement\n\nThe final round of auditions for the show had whittled down the search for Rick and Shane to about ten actors, when they had to read an early scene that introduced Rick and Shane over burgers in their squad car.\n\nPeople told Jon he was ‘out of his mind’ for auditioning for The Walking Dead (Kevin Winter/Getty Images)\n\n‘Normally these auditions are the most artificial, worst-ass things you’ve ever seen. You go into a room with a bunch of people in suits, and you do the scene in front of them, and they’re all awkward and they don’t know what they’re looking at, and they’re thinking about numbers and all this bullsh*t. It’s a real kind of artificial kind of situation,’ Jon said.\n\n‘But [showrunner] Frank Darabont did something very different. For the audition for Walking Dead, he had all the people that he was interested in, all the Ricks and Shanes, and he brought them onto a soundstage, and there was a real police car.’\n\n‘I remember praying the night before I went in, I just said, ‘I want to be me tomorrow. Don’t let the situation get the better of you.’ I wanted it real bad.\n\nAdvertisement\n\nAdvertisement\n\n‘And I said, just be graceful and gracious to everybody, and it was a really beautiful process,’ he added. ‘So they ended up casting me as Shane, and that’s really the part that I wanted.’\n\nSometimes things really do work out for the best.\n\nThe Walking Dead season 10 continues on Sunday in the US, and airs in the UK on Fox on Mondays.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: The Walking Dead’s Jeffrey Dean Morgan clearly wasn’t a fan of Negan in seasons 7 and 8 either\n\nMORE: The Walking Dead’s third spin-off series will be ‘so different from anything we’ve seen before’", "description": "The Walking Dead’s Jon Benthal was told he was ‘out of [his] damn mind] when he gave up a role on NCIS: Los Angeles to audition for the show.", "authors": ["Rachel Finn"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_92256601_1572013259.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-25"}