{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/international/england-vs-usa-rugby-world-cup-2019-five-things-we-learned-result-a9121431.html", "downloaded_at": "2019-09-26 15:21:08.553821+00:00", "title": "Five things we learned from England vs USA", "language": "en", "text": "1) England have too much power for unfancied opponents\n\nAs against Tonga, England simply had too much brute force for the USA. Two first-half tries came as the result of powerful, driving mauls, and the Americans struggled to contain the hard-hitting forwards they were faced with.\n\nThis was not a particularly refined or measured performance from England; it was an assault, a clinical and ruthless display that left the US disorientated and on the back foot from the start.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nYoung prop David Ainuʻu was forced off early on, which left the Americans’ pack lighter. And they could do little to compete with a determined, forceful England team.\n\n2) Jones vindicated in picking impressive Vunipola\n\nShape Created with Sketch. Rugby World Cup 2019 best pictures Show all 25 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Rugby World Cup 2019 best pictures 1/25 Rugby World Cup 2019 The tournament takes place in Japan AFP/Getty Images 2/25 Rugby World Cup 2019 France's players attends a training session at the Fuji Hokuroku Park AFP/Getty Images 3/25 Rugby World Cup 2019 Japanese children perform the Haka AFP/Getty Images 4/25 Rugby World Cup 2019 Ireland's Rhys Ruddock attends a gym training session AFP/Getty Images 5/25 Rugby World Cup 2019 Japan's wing Kotaro Matsushima is tackled by Russia's centre Vladimir Ostroushko AFP/Getty Images 6/25 Rugby World Cup 2019 Former New Zealand international Richie McCaw holds the Rugby World Cup trophy during the tournament's opening ceremony AFP/Getty Images 7/25 Rugby World Cup 2019 Japan fans cheer on their team AFP/Getty Images 8/25 Rugby World Cup 2019 An Argentina fan wearing a mask with an image of football player Lionel Messi AFP/Getty Images 9/25 Rugby World Cup 2019 France supporters kiss outside the Tokyo Stadium AFP/Getty Images 10/25 Rugby World Cup 2019 A France supporter dressed as Obelix AFP/Getty Images 11/25 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 12/25 Rugby World Cup 2019 Australia's hooker Silatolu Latu is tackled AFP/Getty Images 13/25 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 14/25 Rugby World Cup 2019 A France fan waits AFP/Getty Images 15/25 Rugby World Cup 2019 Argentina's centre Jeronimo de la Fuente (C) is tackled by France's wing Yoann Huget AFP/Getty Images 16/25 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 17/25 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 18/25 Rugby World Cup 2019 Japan's players bow AFP/Getty Images 19/25 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara (L) and full back Ben Smith interact with fans AFP/Getty Images 20/25 Rugby World Cup 2019 Fans await the start of a game AFP/Getty Images 21/25 Rugby World Cup 2019 Ireland's wing Jacob Stockdale (2nd R) runs with the ball AFP/Getty Images 22/25 Rugby World Cup 2019 England's centre Manu Tuilagi scores a try AFP/Getty Images 23/25 Rugby World Cup 2019 England supporters attend a match AFP/Getty Images 24/25 Rugby World Cup 2019 A dog with ears coloured in pink AFP/Getty Images 25/25 Rugby World Cup 2019 A Wales supporters laughs outside the City of Toyota Stadium AFP/Getty Images 1/25 Rugby World Cup 2019 The tournament takes place in Japan AFP/Getty Images 2/25 Rugby World Cup 2019 France's players attends a training session at the Fuji Hokuroku Park AFP/Getty Images 3/25 Rugby World Cup 2019 Japanese children perform the Haka AFP/Getty Images 4/25 Rugby World Cup 2019 Ireland's Rhys Ruddock attends a gym training session AFP/Getty Images 5/25 Rugby World Cup 2019 Japan's wing Kotaro Matsushima is tackled by Russia's centre Vladimir Ostroushko AFP/Getty Images 6/25 Rugby World Cup 2019 Former New Zealand international Richie McCaw holds the Rugby World Cup trophy during the tournament's opening ceremony AFP/Getty Images 7/25 Rugby World Cup 2019 Japan fans cheer on their team AFP/Getty Images 8/25 Rugby World Cup 2019 An Argentina fan wearing a mask with an image of football player Lionel Messi AFP/Getty Images 9/25 Rugby World Cup 2019 France supporters kiss outside the Tokyo Stadium AFP/Getty Images 10/25 Rugby World Cup 2019 A France supporter dressed as Obelix AFP/Getty Images 11/25 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 12/25 Rugby World Cup 2019 Australia's hooker Silatolu Latu is tackled AFP/Getty Images 13/25 Rugby World Cup 2019 A France fan reacts AFP/Getty Images 14/25 Rugby World Cup 2019 A France fan waits AFP/Getty Images 15/25 Rugby World Cup 2019 Argentina's centre Jeronimo de la Fuente (C) is tackled by France's wing Yoann Huget AFP/Getty Images 16/25 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 17/25 Rugby World Cup 2019 New Zealand's players perform the Haka AFP/Getty Images 18/25 Rugby World Cup 2019 Japan's players bow AFP/Getty Images 19/25 Rugby World Cup 2019 New Zealand's scrum-half TJ Perenara (L) and full back Ben Smith interact with fans AFP/Getty Images 20/25 Rugby World Cup 2019 Fans await the start of a game AFP/Getty Images 21/25 Rugby World Cup 2019 Ireland's wing Jacob Stockdale (2nd R) runs with the ball AFP/Getty Images 22/25 Rugby World Cup 2019 England's centre Manu Tuilagi scores a try AFP/Getty Images 23/25 Rugby World Cup 2019 England supporters attend a match AFP/Getty Images 24/25 Rugby World Cup 2019 A dog with ears coloured in pink AFP/Getty Images 25/25 Rugby World Cup 2019 A Wales supporters laughs outside the City of Toyota Stadium AFP/Getty Images\n\nThere were suggestions that Jones may choose to rest Billy Vunipola, given the number of games he’s played of late and his recent history of injuries. But he had no intention of leaving out a player who is quickly establishing himself as a key man.\n\nVunipola powered over the line for the second try of the game and carried and tackled with typical authority. And he was withdrawn after a dominant first-half performance, saved for the tougher tests to come.\n\nThe signs are good for England’s number eight, who looks set for a successful World Cup.\n\n3) England still lacking a little fluidity\n\nThis, like the opening game against Tonga, was an efficient, industrious victory. Jones highlighted the importance of starting fast in the build-up, and that is what England did: George Ford surged into a gap and scored the first try inside six minutes.\n\nFor all of England’s dominance, though, there was perhaps a lack of subtlety in attack, a lack of the fluidity that may be required to break through against better opposition. Things improved after the break, though, as the US tired and more spaces appeared.\n\nThis was a comfortable, accomplished win, and there are plenty of positives to take from it. But there remains a feeling that there is more to come from this England side.\n\n4) Battling USA won't be easy opposition\n\nThey were well beaten here, as many expected, but the US might yet prove a thorn in the side of Pool C’s other fancied teams, France and Argentina.\n\nGold’s side kept things relatively tight in the first half against England, restricting the favourites well and preventing them from settling into any sort of rhythm.\n\nUnderstandably, they struggled to contain England as the game progressed. But the US showed enough to suggest they could at least give France and Argentina a game.\n\n5) Solid defence gives England foundation for success\n\nEngland , before Bryce Campbell's late effort, had gone 280 minutes of rugby without conceding a try. And the US, for all their hard work, did almost nothing to trouble a supremely disciplined, organised defence. It was a typically structured display from Jones’ side, one that will give them confidence heading into the latter stages of the competition.\n\nEven the best teams, you feel, will find it difficult to score freely against England. There are sterner tests to come, of course – France and Argentina will provide a clearer indication as to where England are at – but their work at the back and without the ball in this tournament thus far has been impressive.", "description": "1) England have too much power for unfancied opponents As against Tonga, England simply had too much brute force for the USA. Two first-half tries came as the result of powerful, driving mauls, and the Americans struggled to contain the hard-hitting forwards they were faced with. This was not a particularly refined or measured performance from England; it was an assault, a", "authors": ["Callum Rice-Coates"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/26/13/England-vs-USA.jpg", "published_at": "2019-09-26"}