{"pub": "cbs", "url": "https://cbsnews.com/news/2020-daily-trail-markers-former-south-carolina-governor-backs-joe-biden", "downloaded_at": "2019-09-09 23:24:41.135864+00:00", "title": "2020 Daily Trail Markers: Former South Carolina governor backs Joe Biden", "language": "en", "text": "FROM THE CANDIDATES\n\nPETE BUTTIGIEG: Ahead of a 2-day swing to South Carolina next week, the South Bend mayor's campaign has announced that Jarvis Houston will be the team's state director, overseeing 33 staffers on the ground in the Palmetto State, according to CBS News Campaign Reporter LaCrai Mitchell.\n\nDeputy National Press Secretary Tess Whittlesey says that Houston's hiring is another step in executing their team's strategy to run a winning campaign in South Carolina. \"Pete's message calling us to break from the tired ideas of the past to offer bold solutions for our country has resonated with voters in South Carolina,\" said Whittlesey, and added \"…we're putting that enthusiasm to good use, building on a plan and strategy with an organization that will bring Pete's message to South Carolina residents and continue to grow support in the Palmetto State.\"\n\nJOE BIDEN: The former vice president's team has announced an endorsement from two-time South Carolina Democratic governor and former U.S. Secretary of Education Dick Riley, says CBS News Campaign Reporter LaCrai Mitchell.\n\nDr. Terry Peterson, a senior fellow at the College of Charleston, served under Riley as the chief education deputy in the governor's office for two terms and was the chief education adviser for eight years when Riley was education secretary under President Bill Clinton. He says that because of Riley's longstanding relationships with national education groups, his endorsement may afford Biden a second-look in certain educational circles.\n\n\"Educators who have been in the trenches for a while, know [Riley] and trust him all around the country…they like to hear from someone who's been on the ground in their state, in their schools, in their colleges over the years,\" said Peterson. \"They want to know what someone like Dick Riley thinks because he's been among them over many years.\"\n\nBETO O'ROURKE: The former Texas congressman called President Trump \"the most dangerous president the United States has ever had,\" while delivering remarks to the Islamic Society of New Hampshire on Friday in Manchester, New Hampshire. CBS News Campaign Reporters Nicole Sganga and Tim Perry attended the events and spoke to attendees who say they've experienced an uptick in hate and vandalism since the election of President Trump.\n\nDuring the remarks, O'Rourke told attendees that Americans need to \"connect the dots\" between the president's rhetoric and the rise in racist attacks in this country. This is part of O'Rourke's new campaign strategy, which includes visiting communities he says are \"under attack\" from the president.\n\nKAMALA HARRIS: The California senator released a new criminal justice reform plan on Monday. Among other measures, Harris is calling for an end to private prisons, creating a national police use-of-force standard and ending cash bail.\n\nHarris' record during her time as San Francisco's district attorney and California's attorney general has attracted criticism from progressives and civil libertarians in recent months. The Harris campaign told CBS News Campaign Reporter Stephanie Ramirez on Monday that Harris has heard from different people on these issues over the years, learned from experience and has grown as a politician.\n\nCAPITOL COVERAGE\n\nWHITE HOUSE ASSIST: Vice President Mike Pence and acting White House Chief of Staff Mick Mulvaney made a stop at Wingate University on Monday to campaign on behalf of state Sen. Dan Bishop, who is running for the U.S. House in Tuesday's special election in North Carolina's 9th district. CBS News Political Unit Associate Producer Ellee Watson & CBS News Political Unit Broadcast Associate Aaron Navarro report that Pence laid out why top GOP officials are focusing in on this race.\n\nThe vice president told the crowd that the race was about more than this district, and that's why Democrats have been pouring money into the state to support McCready. He said that if Bishop wins, Republicans will prevent the Democrats from rolling back the progress the Trump administration has made.", "description": "The former vice president's team has announced an endorsement from two-time South Carolina Democratic Gov. Dick Riley", "authors": ["Katie Ross Dominick"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/06/12/1691cea9-a445-48df-9a23-20a5738ccb3a/thumbnail/1200x630/ff1449c54bf8b5d726270e5888c76adc/trail-markers-graphic-presidential-4.jpg", "published_at": "2019-09-09"}