{"pub": "abcnews", "url": "https://abcnews.go.com/US/prevent-climate-change-experts/story?id=65721423", "downloaded_at": "2019-09-28 12:06:08.146074+00:00", "title": "What you can do to help prevent climate change, according to experts", "language": "en", "text": "With experts warning that the global climate crisis is becoming more and more dire, scientists and environmental activists say they are turning to the public to help effect change before it's too late.\n\nThe planet is emitting nine gigatons of carbon every year, and that amount increases annually, Jason Smerdon, a climate scientists for Columbia University's Lamont Doherty Earth Observatory, told ABC News. By other estimates, the amount could be more than 30 gigatons a year.\n\nAnd since the Industrial Revolution, more than 555 gigatons of carbon have been emitted into the atmosphere, Smerdon said, adding that scientists have determined a \"climate budget\" of another 100 to 150 gigatons that can be released before the Earth begins to warm more than 1.5 degrees Celsius -- when we will experience more extreme weather patterns, such as severe heat waves.\n\nOther estimates of the amount of carbon that have been released are even higher. The Union of Concerned Scientists says, for instance, that nearly 1,500 gigatons of carbon have been emitted since 1751, with more than half of that since 1988.\n\nIf drastic changes aren't made now, the planet could \"blow past\" the carbon budget in the next decade, Smerdon said.\n\nWhile individual changes may seem futile, experts say collective action from individuals is what's needed to convince political leaders and decision-makers to make larger changes.\n\nRamon Espinosa/AP\n\nHere's what climate change activists say you can do:\n\nGet out and vote\n\nSolutions to halt the ongoing damage are already available, such as using renewable energy, restoring ecosystems, doing regenerative farming and making transportation greener, experts say.\n\nBut they say it's up to the voter to put politicians in place to implement those changes.\n\nThe Trump administration, for instance, has rolled back 85 environmental protections since 2017, including several on drilling and emissions, The New York Times reported.\n\nMost recently, the administration has gone after the strict emissions regulations in California, part of what appears to be an escalating battle with the state.\n\nThe president has defended his actions, saying his \"administration has made it a top priority to ensure that America has among the very cleanest air and cleanest water on the planet\" and that he is \"revising the past administration’s misguided regulations to better protect the environment and to protect our American workers.\"\n\nMany states and other localities have taken matters into their own hands. New York, for instance, passed legislation that would make the state carbon-neutral by 2050 -- the second state behind California to do so.\n\nAnd in New York City, lawmakers increased the on-street bike network by 330 miles, making it easier for commuters to opt for a greener way of getting around the metropolis, Smerdon said.\n\nBruno Kelly/Reuters\n\nAction like this illustrates why it's important to vote in every single election, said Dr. Ayana Elizabeth Johnson, a marine biologist, environmental policy expert and founder of the Urban Ocean Lab, a think tank for urban coastal cities.\n\nShiv Soin, the lead organizer for the New York City youth climate strike that drew about 4 million demonstrators last week, recommended that voters call their local representatives to demand they take action, describing it as a \"super safe way to get involved\" and a way to make \"sure your voice is heard.\"\n\nSpencer Platt/Getty Images\n\nKnow where you do business\n\nJust 100 companies worldwide are responsible for 71% of the world's industrial greenhouse gas emissions since 1988, according to a report by the non-profit Carbon Disclosure Project, published in 2017.\n\nThis is why it's important for consumers to know where they are putting their money, according to activists.\n\nA report published by the non-profit Rainforest Action Network (RAN) in March found that JPMorgan Chase has poured about $196 billion into the fossil fuel sector from 2016-2018, more than any other bank.\n\nIn a statement, JPMorgan said it promotes “inclusive economic growth and opportunity in communities where we operate, and by 2023 we will invest $1.75 billion towards these efforts.\"\n\n“We also work to advance environmental sustainability within our business activities and facilities,\" the statement said. \"We recognize the complexity of climate change issues and actively engage with a diverse set of stakeholders to understand their views. We firmly believe that balancing environmental and social issues with financial considerations is fundamental to sound risk management.”\n\nLindsey Allen, executive director of RAN, said that it is important to “look at the institutions that are financing and expanding and digging us more deeply in this climate hole.\"\n\nThe Washington Post/Getty Images, FILE\n\nAllen said that some banks in Europe have made progress, agreeing that they won't finance coal extraction going forward. Several American banks have pledged to cut financing for coal as well, including JPMorgan and Citi, which cut lending by 62 percent and 87 percent, respectively, in that sector.\n\nCiti spent $4.4 billion on coal power financing from 2016-2018 whereas the Bank of China spent $16 billion during that period, according to RAN data.\n\nBut the financial sector still isn't moving fast enough, she said.\n\nIndividuals can take action by thinking about where their money \"sleeps at night\" and removing it from the banks that they believe don't have a commitment to mitigating climate change, Allen said.\n\n\"I think there really is an opportunity if consumers engage with their dollars and vote with their wallets to really increase the ambition of financial institutions with what the climate crisis demands,\" she said.\n\nKodiak Daily Mirror via AP, FILE\n\nOther actions you can take\n\nDespite any feeling to the contrary, every individual action counts, Smerdon said.\n\n\"We don't need people to be extreme about what they're doing,\" he said. \"Be conscious in every area that you can.\"\n\nSmall steps make a big difference, according to the experts:\n\n-- Plant trees and grow your own food, even if you have just a small bit of land, Johnson said. Also, choose foods that are grown regeneratively, which restores carbon to the soil, \"where it belongs,\" Johnson added.\n\n-- Cut back on beef consumption, which has a “monumental” carbon footprint compared to any other meat, Smerdon said.\n\n-- Reduce your carbon footprint by using less single-use plastic, Soin said.\n\n-- Install solar panels, if you can, and source electricity from non-carbon based energy sources, Smerdon said.\n\nEraldo Peres/AP\n\n-- Put your special skills to use, Johnson said. Creatives can make art to inform and inspire. Those with law backgrounds can use the law to fight for climate justice. Web designers can create websites to help activists organize, and those with skills in the kitchen can cook meals to nourish the demonstrators.\n\n-- If you can't get rid of your car, switch from gas to electric, Smerdon said.\n\n-- Donate time or spare cash to organizations dedicated to the fight against climate change, Johnson said.\n\n-- Continue to talk about climate change to transform the culture and \"mobilize at the scale we need,\" Johnson said.", "description": "As the climate situation on Earth becomes more dire, scientists and environmental activists are turning to the public to use their collective power to create change.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/climate-change-bird-ap-ps-190924_hpMain_16x9_992.jpg", "published_at": "2019-09-28"}