{"pub": "fox", "url": "https://foxnews.com/real-estate/ftc-temporarily-halts-misleading-real-estate-seminar-endorsed-hgtv-personalities", "downloaded_at": "2019-10-09 10:44:32.146962+00:00", "title": "Federal trade commission temporarily halts 'misleading' real-estate seminar endorsed by HGTV personalities", "language": "en", "text": "The Federal Trade Commission is attempting to shut down a Utah-based company that runs a real estate seminar — which has been endorsed by HGTV stars, including “Flip or Flop’s” Tarek El Moussa and Christina Anstead — that the group says is “misleading” and “bogus.”\n\nOn Friday, a federal court agreed to put a temporary restraining order against Zurixx, LLC, which, according to the FTC, “used deceptive promises of big profits to lure consumers into real estate seminars costing thousands of dollars.”\n\nSEE THEM: MICHIGAN REAL ESTATE AGENT ADDS TERRIFYING TOUCH TO LISTING PHOTOS\n\nThe complaint, which was filed by the FTC and the Utah Division of Consumer Protection, says Zurixx would hold free events that were endorsed by the “Flip or Flop” stars, as well as Hilary Farr from HGTV’s “Love It or List It” and Peter Souhleris and Dave Seymour from A&E’s “Flipping Boston.” Once at the event, the presenters would then pitch the group’s three-day workshop that cost $1,997 and promised to teach customers how to “make substantial income from real estate.” At the pricey workshops, presenters encouraged attendees to open new credit cards and increase card limits, and also peddled products and services that could cost up to $41,297, according to the FTC.\n\n“From start to finish, these defendants used the promise of easy money and in-depth information to lure consumers down a path that could cost them thousands of dollars and put them in serious debt,” said Andrew Smith, director of the FTC’s Bureau of Consumer Protection. “When a company tells consumers they have the secret to get rich with little work, we encourage consumers to take a hard look at what’s really being offered.”\n\nFOLLOW US ON FACEBOOK FOR MORE FOX LIFESTYLE NEWS\n\nThe FTC alleges consumers could only get a refund from the company if they signed an agreement prohibiting them from “speaking with the FTC, state attorneys general, and other regulators; submitting complaints to the Better Business Bureau; or posting negative reviews about Zurixx.”\n\nZurixx told the Associated Press in a statement that the organization anticipates “a positive outcome as we work directly and openly with the agencies involved.” HGTV did not immediately respond to AP’s request for comment.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThis article originally appeared in the New York Post.", "description": "“When a company tells consumers they have the secret to get rich with little work, we encourage consumers to take a hard look at what’s really being offered,\" the FTC warned.", "authors": [], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2018/07/02/694940094001_5804491665001_5804490439001-vs.jpg", "published_at": "2019-10-08"}