{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7604797/Thai-king-fires-palace-officials-extremely-evil-conduct.html", "downloaded_at": "2019-10-23 17:16:22.338305+00:00", "title": "Thai king fires palace officials for 'extremely evil' conduct", "language": "en", "text": "In this photo taken on August 26, Thailand's King Maha Vajiralongkorn can be seen with former Royal Consort Sineenat Wongvajirapakdi (pictured). The King announced on October 21 that he would had stripped his 34-year-old consort,of all titles, a shock move less than three months after she was bestowed with a position that had not been used for nearly a century\n\nThailand's King Maha Vajiralongkorn has dismissed six palace officials for 'extremely evil' conduct, a palace announcement said on Wednesday, in a shake-up that come days after the sacking of the king's royal consort.\n\nTwo separate announcements accused the six of severe disciplinary misconduct that caused harm to the royal service, and said they had been fired and stripped of all their official ranks.\n\nThey had abused their status and used their high-ranking positions for their own gain, according to local media.\n\nAFP described the roles among the six as being 'a nurse at the bedroom guard service', a veterinarian, a senior police official and two royal guards.\n\nThe Bangkok Post listed the first official ousted as police lieutenant general, Police Lt. Gen. Sakolket Chantra.\n\nThe rest of the names and ranks included Maj Gen Warinporn Kanisornsophon, Lt Peera Mongkolchairerk and Khunying (a senior ranking married female) Thidarat Thamraksa of the Royal Guards 904. Lt Chayanan Pangsang, and Maj Gen Khun Tharinee Rodson, were listed as attached to the Ratcha Wallop Royal Guards Royal Security Command.\n\n'The king has ordered their dismissal from royal service ... because of their severe disciplinary misconduct and deeds that are considered extremely evil,' one of the announcements said.\n\nPolice lieutenant general, Police Lt. Gen. Sakolket Chantra, has been ousted from his position, along with five others of the royal household, for 'severe disciplinary misconduct' and 'deeds considered evil'\n\nThe six officials couldn't be reached for comment.\n\nThe wave of sackings comes days after the king's former Royal Consort, Sineenat Wongvajirapakdi, was stripped of her titles in an extraordinary announcement on Monday.\n\nThe king made her his royal noble consort in August - the first such appointment in almost a century.\n\nA palace statement on Monday accused his royal concubine of being 'disloyal' and instigating a rivalry with Queen Suthida Bajrasudhabimalalakshana.\n\nQueen Suthida married the King in May, just days before his coronation.\n\nThe whereabouts of Sineenat since her dismissal are unknown.\n\nThai King Maha Vajiralongkorn stands before the lighting of the fire for the cremation of the late Leicester City owner Vichai Srivaddhanaprabh in Bangkok, Thailand in March 21. Since taking over from his father, King Maha Vajiralongkorn, has taken more direct control of royal affairs and the crown's vast wealth, and transferred two military units from the Royal Thai Army to his personal control\n\nThe Wednesday statements did not directly link the six sacked officials to Sineenat's dismissal.\n\nFormer consort, Sineenat, was dismissed from the rank of 'Chao Khun Phra' for 'disloyalty to the king', the Royal Gazette said, as well as 'acting against the appointment of the Queen for her own ambitions'.\n\nShe was appointed the king's official consort after they met when she was part of his royal bodyguard - less than a year after he married the Queen of Thailand.\n\nFormer army nurse Sineenat Wongvajirapakdi (left) was dismissed from the rank of 'Chao Khun Phra' for 'disloyalty to the king'. Queen Suthida is sitting to the King's right watching the ceremony which took place in August this year\n\nVajiralongkorn is known as Thailand's playboy King because he has been married four times and caused a scandal when he was pictured in a tight crop top and with a back tattoo that he later claimed to be fake.\n\nThe statement announcing Sineenat's public downfall added her actions show 'she does not give any honour to the king and does not understand royal tradition.\n\nHer actions are to benefit herself', the statement said, adding she was attempting to elevate her position to the same as Queen Suthida.\n\nHer behaviour is 'deemed disrespectful to His Majesty's grace... and caused divisions among courtiers and misunderstanding among the people', the statement added.\n\nShe was stripped of all military ranks, decorations and royal titles.\n\nThe statement also described Sineenat as 'ungrateful'.\n\n'Royal Noble Consort Sineenat is ungrateful and behaves in ways unbecoming of her title. She is also not content with the title bestowed upon her, doing everything to rise to the level of the queen,' the statement said.\n\n'She lacks the understanding of the good traditions of the royal court. She displays disobedience against the king and the queen.'\n\nDetails on exactly what the former consort did to cause such offence have not yet been released.\n\nA statement said Sineenat was attempting to elevate her position to the same as Queen Suthida (pictured left and right)\n\nKing Vajiralongkorn had made the woman his consort during his birthday ceremony attended by his new wife in August, marking the first time the country's modern monarchy has publicly admitted to polygamy.\n\nHe has dramatically bolstered his authority since his 2016 ascension to the throne, pulling the immense wealth of the crown under his direct control and restructuring key army units to his command.\n\nSince taking the throne following the death of his revered father King Bhumibol Adulyadej in 2016, Vajiralongkorn has proved to be an assertive constitutional monarch, taking more direct control of royal affairs and the crown's vast wealth, and transferring two military units from the Royal Thai Army to his personal control.\n\nPublic criticism of the king or the royal family is illegal under Thailand's strict lese majeste laws, with insults to the monarchy punishable by up to 15 years in prison.", "description": "Thailand's King has dismissed six palace officials for 'extremely evil' conduct, a palace announcement said on Wednesday, in a shake-up that comes days after the firing of the king's consort.", "authors": ["Ryan Fahey For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/16/20090482-0-image-a-2_1571845371448.jpg", "published_at": "2019-10-23"}