{"pub": "investing.com", "url": "https://za.investing.com/news/commodities-news/update-1oil-climbs-but-still-set-for-big-weekly-loss-over-demand-worries-1963571", "downloaded_at": "2019-10-04 09:18:44.051181+00:00", "title": "UPDATE 3-Oil edge up but still set for big weekly loss on demand worries", "language": "en", "text": "© Reuters. UPDATE 3-Oil edge up but still set for big weekly loss on demand worries\n\n* Brent down 6.2% for the week, U.S. crude 5.6% lower\n\n* Weak data, demand concerns drive prices lower this week\n\n* Supply concerns fade as Saudi fully restore output\n\n(Updates prices, adds comments, graphic)\n\nBy Bozorgmehr Sharafedin\n\nSINGAPORE, Oct 4 (Reuters) - Oil prices rose on Friday but were still on track for a second consecutive weekly loss after sliding on fears that slower global economic growth would hurt energy demand.\n\nBenchmark Brent crude rose 36 cents, or 0.6%, to $58.07 a barrel by 0839 GMT, while U.S. West Texas Intermediate (WTI) crude futures rose 30 cents, or 0.6%, to $52.75.\n\nBut Brent was down 6.2% on the week while U.S. crude was 5.6%, lower, on the biggest weekly losses since July.\n\n\"Both are on track for hefty weekly losses and it will take a brave man to bet against the bearish tide,\" Stephen Brennock of oil broker PVM said.\n\n\"As thing stand, demand and supply-side developments are anything but supportive and there can be no happy ending for those of a bullish disposition,\" he added.\n\nWeak U.S. services sector and jobs growth data on Thursday added to worries about global oil demand and exacerbated fears that a protracted U.S.-China trade war could push the global economy into a recession. are awaiting U.S. non-farm payrolls data due out on Friday to determine the next move.\n\n\"Given that U.S. growth is largely supported by a buoyant consumer whose confidence is built on a strong job market, this release will be critical in shaping expectations around future Fed policy which will have spillover effects on oil markets,\" said Harry Tchilinguirian, global oil strategist at BNP Paribas (PA: ).\n\nU.S. job growth likely picked up in September, with wages increasing solidly, which could assuage financial market concerns that the slowing economy was teetering on the brink of a recession. Arabia's energy minister, Prince Abdulaziz bin Salman, said on Thursday the world's top crude oil exporter had fully restored oil output after attacks on its facilities last month knocked out more than 5% of global oil supply. spare capacity, the risk of renewed attacks on oil infrastructure in the Middle East, and likely larger oil inventory declines until the end of 2020 following the sharp drop in Saudi oil output suggest to us that oil prices should trade higher in the short term,\" UBS oil analyst Giovanni Staunovo said.\n\nFrance said Iran and the United States have one month to get to the negotiating table, suggesting that Tehran's plan to increase its nuclear activities in November would spark renewed tension in the region. Major Oil Supply Diruptions png\n\nhttps://tmsnrt.rs/2nkroOv\n\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^>", "description": "UPDATE 3-Oil edge up but still set for big weekly loss on demand worries", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEB5F109_L.jpg", "published_at": "2019-10-04"}