{"pub": "theverge", "url": "https://theverge.com/2019/2/1/18204980/honor-view-20-review-oneplus-competition", "downloaded_at": "2019-10-05 13:10:06.196264+00:00", "title": "Honor View 20 review: top-notch performance without the notch", "language": "en", "text": "Over the past three years, OnePlus has reigned mostly unchallenged as the “flagship-class Android phone with a midrange price” champion. Fast performance, tons of specs, and a respect for a customer’s wallet have earned that company a loyal and passionate following. But 2019 sees a challenger for the affections of the budget-conscious crowd emerging, and it’s none other than the Honor View 20. This new smartphone ticks many of the same boxes as OnePlus’ latest 6T while also adding a few advantages all its own. With prices for both phones starting at an identical £499 in the UK (the View 20 is set for a US launch later in the year), there can only be one winner, and I’ve come to a surprising conclusion about my favorite.\n\nThe eye-grabbing features of the View 20 include a hole-punch display with a 91.82 percent screen-to-body ratio, a 48-megapixel AI camera, and a gorgeous chevron-patterned glass back design. More about them later, but the things that make this phone truly compelling to use are its insanely fast performance combined with a reassuringly huge battery. The View 20 is as nimble as any Android flagship on the market, irrespective of price, with the response times of a spooked hare and the smoothness of a Roger Federer backhand.\n\nOur review of Honor View 20 Verge Score 8 out of 10 Good Stuff Lightning-fast performance and fingerprint sensor\n\nHuge battery in an elegant design\n\nHole-punch display is a clear upgrade over most notches\n\nUltra Clarity camera mode is legit Bad Stuff Huawei’s software is still a burden\n\nLacks wireless charging\n\nCamera is mediocre for most common uses\n\nLCD lacks the beauty and contrast of an OLED panel Buy for $655.00 from Honor (UK)\n\nThis phone is as fast as it looks\n\nComing to the View 20 from the Google Pixel 3 XL, which has 4GB of RAM and sometimes over-aggressive power optimizations, the new Honor phone feels luxuriously speedy. Even compared to the OnePlus 6T, the View 20 feels faster. My review handset has 8GB of RAM on board, but I’m confident the entry-level 6GB will be amply sufficient, too — the real star of this show is Huawei’s 7nm Kirin 980 processor at the heart of the View 20, which wipes the floor with the Snapdragon 845 that powers the 6T and Pixel. I already sung the praises of the Kirin 980 in my Mate 20 Pro review, and Honor has managed to trickle that down to a much more affordable price, taking the large 4,000mAh battery along for the ride as well. I can whizz through a day’s work with the View 20 in hand without a single worry about its battery.\n\nHonor made no ergonomic sacrifices in producing a high-performing and long-lasting phone. One of only three Android devices certified to run Fortnite at 60 fps — along with the Mate 20 X and Galaxy Note 9 — the View 20 is by far the most compact and phone-like (though it is still a large smartphone, without a doubt). In my testing, I couldn’t find a game that troubled this phone, and the majority of apps launched and worked faster than I’m used to from other Android phones. The View 20 is a little shorter than the 6.3-inch Pixel 3 XL, but has a slightly larger 6.4-inch screen courtesy of its absentee bezels. Contradicting the platitudes of many of its competitors, Honor even found enough space for a headphone jack inside its spec-rich handset. Amazing.\n\nI’m putting an emphasis on the fundamentals of the Honor View 20, because this phone’s look is so glamorous that you’d instantly think its glitz is designed to distract the eye from some internal failing. The rear glass features a striking chevron pattern, which is accomplished with the help of nanolithography. It instantly gives this handset a playful and unique (at least until someone shamelessly copies it) character. Honor saves the most handsome cerulean and crimson colorways for the pricier 8GB / 256GB edition of the View 20, and I’m especially fond of the red one. We’re spoiled for choice when it comes to picking a well designed and attractive new smartphone, but as a Vlad, I have to admit the idea of a device with a giant V imprint at the back of it appeals to me more than most.\n\nNo notches, no problems\n\nTurning the View 20 around to look at its display, the hole-punch selfie camera arrangement is the only thing that stands out. No notches in sight, and there’s scarcely any bezel, just a sliver at the bottom of the phone. My initial reaction that the hole-punch display is going to be okay has only been reinforced by extended use of this phone. It takes no time at all to zone out the dot in the top left corner that houses the selfie camera, and that process can be accelerated by using a home screen wallpaper that’s dark at the top. Yes, svelte notches like on the OnePlus 6T can claim that, too, but they’re much more disruptive anytime you want to watch a video in full screen.\n\nHonor wisely nudged the camera away from a centered position, taking into account that the corner is more likely to be obscured by a user’s hands when watching or playing something in landscape mode, making it the least intrusive location for a fixed dot in the screen. The camera itself sits under the glass, so there’s no disturbance of the surface of the phone. If you’re going to put a front-facing camera on a phone’s display at all, this is the optimal way to do it.\n\nFor all of Honor’s engineering effort with the dot camera, I’m not particularly enthused by the results produced by it. It has a mighty 25-megapixel resolution, but its quality is poor. Images come out looking both soft and grainy even in decent light. That’s good enough for video calls and to mess around with funky filters, masks, and emoji, but no more than that. The Pixel 3, Galaxy Note 9, and iPhone XS can each produce richly detailed portraits that put the View 20’s selfie camera to shame. But those devices also cost about double, so it’s really going to be a matter of aligning your expectations with your budget. The OnePlus 6T is about as underwhelming as the View 20.\n\nThe rear camera system of the View 20 has already been the subject of a full review by my colleague Sam Byford. Honor uses the main 48-megapixel Sony sensor to produce computationally improved 12-megapixel stills by default. It also adds a cool AI Ultra Clarity mode that stitches together multiple 48-megapixel exposures over the course of a few seconds to create a crisp, high-resolution shot. These are nice things to have, but the overall quality on offer from Honor is, once again, middling. The addition of unconvincing night and portrait modes doesn’t add much value. The OnePlus 6T’s Achilles’ heel is its mediocre camera, and the Honor View 20 sidles up right alongside it. I’d give the View 20 the slightest edge because of the Ultra Clarity mode and the extra potential it promises.\n\nBefore I delve into the meat of what I don’t like about the View 20, I should commend a couple of other inclusions from Honor. One is the notification LED, which has been tucked in next to the vanishingly thin earpiece at the top of the phone. Calls on the View 20 don’t suffer from the tininess of that speaker, and the mono loudspeaker at the bottom of the phone is also respectably solid. You get two SIM slots with the View 20, as is fast becoming the standard across the industry. I love the fingerprint sensor on the back of this phone, which is hyper-responsive and accurate: I need only feather it momentarily with my finger and the phone will be unlocked. Don’t talk to me about in-display fingerprint readers until they’re able to recreate this level of slick and speedy responsiveness.\n\nThe View 20’s Magic UI is trying to move away from Huawei’s unloved EMUI, but it’s still too close for comfort\n\nThe display of the Honor View 20 is a 1080p LCD, which you’ll rightly surmise is the biggest budget corner cut by Honor. I don’t mind it, as the screen is sharp and bright enough, even if it could never match the viewing angles, contrast, and vibrance of an OLED display. Honor’s default Vivid display mode is a touch too saturated, whereas the alternative Normal mode takes on a weird yellow hue. No setting gets you perfect color accuracy. As with the camera, this display is the sort of thing that will be perfectly okay for most people unless and until you decide to compare it side by side with much pricier devices.\n\nBut there is one major “but” with the Honor View 20, and that’s Huawei’s software. Honor is now running what it calls Magic UI, which strips away some of the cruft and fluff from Huawei’s only-occasionally-tolerable EMUI, but you can still see Huawei’s fingerprints all over this phone’s interface. Nagging HiCare notifications serve little purpose but to annoy, attempting to search for anything on the phone brings up a HiSearch notice, and to apply fresh themes you’ll need to log in to a Huawei ID and allow the themes app permission to make phone calls. Even though the name on the back is Honor, this is still a Huawei phone, warts and all.\n\nIn setting up this phone, I had to replace its preset keyboard and clean out unwanted pre-installed apps like Booking.com, Facebook, Amazon Shopping, and an “Honor” app icon that just led to the company’s online store. Android 9 helped me to quiet down a barrage of unhelpful notifications telling me to do things I didn’t want to, such as shutting down Slack and Telegram because they were consuming power in the background (working in the background is what those apps are supposed to do). Honor tells me that Magic UI will move closer to stock Android over time, however we’re not there yet, and these lingering Huawei hallmarks mar an otherwise fast and fluid user experience.\n\nIn spite of my unease about its software, I appreciate that Honor is releasing a phone with fully updated software. Android 9 is to be expected by this point, but Honor’s right up to date with Google’s security patches as well. I also received a couple of software updates during testing, showing a company actively engaged in improving its product after release. As with the basic hardware spec, Honor’s checked off the essential software requirements, even if its reliance on Huawei’s unloved interface design spoils things a bit.\n\nYou get a lot for your money with the View 20\n\nThe one hand-me-down that Honor gets from Huawei that I very much enjoy is the gesture interface. It’s a lot like that on the OnePlus 6T and the iPhone X and XS: a swipe up from the bottom of the screen gets you back to home, or you can hold that swipe and see the multitasking menu. Swipes from either edge of the phone act as a press of the back button. After a while, these gestures start to feel so natural that I forget that they’re not a native Android feature. Given my distaste for Google’s own gesture controls, I consider this a definite upgrade over the Android 9 default.\n\nWith its excellent performance, reliable battery life, handsome looks, and acceptable compromises, the Honor View 20 is hard to criticize. Sure, you miss out on wireless charging, but that’s also true of the OnePlus 6T and the majority of other phones in this price class. Like the 6T, the View 20 has a rapid-charging mode that tops up the phone to 55 percent in 30 minutes. Like OnePlus, Honor appears devoted to delivering Android updates as fast as possible.\n\nThe choice between the 6T and View 20 ultimately comes down to how tolerant you will be of the Magic UI tweaks versus the nearly stock Oxygen OS from OnePlus (and perhaps where you live, as the Honor isn’t yet available in North America). After getting over the initial setup pains, I find myself at ease with Magic UI, and I’d personally favor the View 20 for its greater camera capabilities, prettier design, and subtly more agile responsiveness. And hey, a hole punch is better than a notch any day of the week.", "description": "The Honor View 20 is among the first of a new generation of smartphones with hole-punch displays replacing 2018’s notch design. Powered by a Kirin 980 processor, 4,000mAh battery, and a new 48-megapixel camera, the View 20 is a great contender for the title of best midrange Android phone.", "authors": ["Vlad Savov", "Feb"], "top_image": "https://cdn.vox-cdn.com/thumbor/EUNNIjkfnBDYsWDTOnNdyXueS-Y=/0x0:2040x1068/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13729772/DSCF6842.jpg", "published_at": "2019-02-01"}