{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7603743/Brooklyn-Beckhams-mystery-blonde-identified-stunning-Canadian-actress-Natalie-Ganzhorn-21.html", "downloaded_at": "2019-10-23 09:17:49.457660+00:00", "title": "Brooklyn Beckham's mystery blonde identified as stunning Canadian actress Natalie Ganzhorn, 21", "language": "en", "text": "Brooklyn Beckham was partying with stunning Canadian actress Natalie Ganzhorn, 21, at a plush Beverly Hills party over the weekend.\n\nPhotos of Brooklyn, 20, emerged on Tuesday showing the aspiring photographer leaving a mansion party with a gorgeous blonde, who has been identified as rising star Natalie.\n\nThe son of Victoria and David looked close with Natalie, who boasts over 40k followers on Instagram and a string of acting roles.\n\nNew flame? Brooklyn Beckham was partying with stunning Canadian actress Natalie Ganzhorn, 21, at a plush Beverly Hills party over the weekend\n\nNatalie is best known for her part in popular Canadian musical comedy series Make It Pop, playing the recurring role of Heather until the TV show ended in 2016.\n\nShe has also appeared for the past three years in animated/live-action comedy television series The Stanley Dynamic and an episode of Scary Stories to Tell in the Dark.\n\nNatalie also boasts a large following on Instagram, where she regularly posts stunning selfies and photos from her glam life in Los Angeles for her 42k fans.\n\nBeauty: Photos of Brooklyn, 20, emerged on Tuesday showing the aspiring photographer leaving a mansion party with a gorgeous blonde, who has been identified as rising star Natalie\n\nBrooklyn and Natalie looked like good friends on Sunday, sticking together while the party broke up and their other friends dispersed.\n\nThe beauty put in a leggy appearance for the fun night out in an oversized yellow racing jacket over a mini dress.\n\nThis timing of Brooklyn's outing with Natalie crosses over with reports that he is dating brunette actress Phoebe Torrance, 25, who previously worked as his mum Victoria's lookalike.\n\nRising star: Natalie boasts over 40k followers on Instagram and a string of acting roles\n\nSocial media star: Natalie boasts a large following on Instagram, where she regularly posts stunning selfies and photos from her glam life in Los Angeles for her 42k fans\n\nActress: Natalie is best known for her role in popular Canadian musical comedy series Make It Pop, playing the recurring role of Heather until the TV show ended in 2016\n\nFavourite: Natalie has posted multiple photos of herself in the same distinctive racing jacket she was pictured wearing during her night out with Brooklyn\n\nBrooklyn is said to have enjoyed a string of dates with Phoebe and has reportedly been 'teased by his friends' over how similar his new girlfriend and his famous mother look.\n\nA source told The Sun: 'Bizarrely though, from a certain angle she does look terrifyingly like his mother, Victoria.\n\n'A few of his friends have teased him about it but Brooklyn is adamant that there is nothing \"Oedipal\" about it - or words to that effect.\n\nLA life: She has also appeared for the past three years in animated/live-action comedy television series The Stanley Dynamic and an episode of Scary Stories to Tell in the Dark\n\nCurrent flame? This timing of Brooklyn's outing with Natalie crosses over with reports that he is dating brunette actress Phoebe Torrance, 25 (pictured at The Box, London on Tuesday)\n\n'But Phoebe told pals that she actually did a few jobs as a Victoria lookalike in her early modelling days, the money of which helped fund her university course.\n\n'Presumably she never thought she might one day meet her idol.'\n\nPhoebe's Instagram page shows her glowing good looks, with her posing in a variety of racy shots.\n\nThe star is thought to be popular with Brooklyn's family and even follows his little brother Romeo, 17, on Instagram.\n\nClaims: According to reports, Brooklyn has been 'teased by his friends' over how similar Phoebe, pictured left, and his famous mother, pictured right, look\n\nPhoebe is the daughter of former professional golfer Sam Torrance and has starred as Amber Ross in horror Mandy the Doll and in boxing drama Six Rounds.\n\nThe starlet also featured in a single episode of Friday Night Dinner as Mandy The Waitress.\n\nThe news comes following Brooklyn's split with model Hana Cross in the summer.\n\nThe pair were together for nine months but had had several high profile arguments before their split.\n\nLast month they risked an awkward run-in when they both showed up at the same exclusive event in London.", "description": "The son of Victoria and David looked close with Natalie, who boasts over 40k followers on Instagram and a string of acting roles.", "authors": ["Joanna Crawley For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/08/20071828-0-image-a-4_1571814543133.jpg", "published_at": "2019-10-23"}