{"pub": "cbs", "url": "https://cbsnews.com/news/tropical-storm-karen-puerto-rico-virgin-islands-rain-mudslides-hurricane-recovery-latest-storm-track-2019-09-24", "downloaded_at": "2019-09-25 04:42:12.071040+00:00", "title": "Tropical Storm Karen dumps heavy rain over Puerto Rico as storm moves slowly north", "language": "en", "text": "Tropical Storm Karen drenched the U.S. Virgin Islands on Tuesday as it bore down on an earthquake-shaken Puerto Rico still two years ago. Heavy squalls were expected to hit some areas of the U.S. territories overnight as the storm moved slowly over the region and headed to open waters.\n\nForecasters said the heaviest rains would affect Puerto Rico's southern and eastern region from 8 p.m. Tuesday to about 2 a.m. Wednesday.\n\n\"The worst is yet to come,\" said Elmer Román, secretary of the island's Department of Public Safety.\n\nU.S. Virgin Islands Governor Albert Bryan Jr. said the storm had already caused mudslides in the territory and major power outages were reported early Tuesday, though he said the cause was not yet clear.\n\n\"Don't take the storm lightly,\" Bryan said. \"It will start to throw massive rain.\"\n\nSchools and government offices were already ordered closed in Puerto Rico as well as in the U.S. and British Virgin Islands, with officials warning people to stay indoors.\n\nAs the storm approached, Puerto Ricans were shaken from their beds late Monday by a magnitude 6.0 earthquake that hit in the Atlantic near the island at a shallow depth of 6 miles. Three aftershocks, of magnitude 4.7 and 4.6, followed within less than an hour. Experts say the aftershocks could continue for a week — some may not be felt.\n\nNo significant damage was reported, said Carlos Acevedo, director of Puerto Rico's emergency management agency, adding that the concern now was how much rain Karen would drop on the region. The U.S. National Hurricane Center said it could bring 2 to 4 inches.\n\nHeavy rains were already pelting the southeast coastal town of Yabucoa, where 69-year-old retiree Víctor Ortiz huddled inside his home with his wife.\n\n\"Every year the storms are stronger and more frequent,\" he said, adding that he worried about landslides because he lives in a mountainous region.\n\nThe National Guard, which was activated by Puerto Rico Governor Wanda Vázquez on Monday, carried out a last-minute evacuation of a weeks-old baby from the neighboring island of Vieques, which has been without a hospital since Hurricane Maria hit in 2017. Lieutenant Colonel Paul Dahlen said in a phone interview that the baby was sick and would be taken to a hospital before the storm hits.\n\nKaren regained tropical storm strength Tuesday morning after slipping to a tropical depression. Its maximum sustained winds increased in the afternoon to 45 mph, with additional strengthening expected in upcoming days. The storm was centered about 65 miles south of San Juan and was moving north at 8 mph. Forecasters said it was expected to hit Puerto Rico's southeast region by late afternoon.\n\nIt was expected to keep heading north after passing over Puerto Rico and stay well east of the Bahamas, the Hurricane Center said. A tropical storm warning remained in effect for Puerto Rico, Vieques, Culebra and the U.S. and British Virgin Islands, and forecasters said certain areas could experience stronger winds.\n\nRoberto Garcia, meteorologist in charge of the National Weather Service's San Juan office, said that some towns in the eastern part of Puerto Rico would likely be hit with moderate to serious flooding, especially those next to mountains.\n\nGovernor Vázquez urged people in flood-prone areas to seek shelter, with more than 30 people reported in shelters by Tuesday morning.\n\nThe island is still recovering from Hurricane Maria, which hit as a Category 4 storm two years ago and is estimated to have caused more than $100 billion in damage. More than 25,000 homes still have blue tarps for roofs and the electric grid remains unstable.\n\n\"It's a reality that we might have power outages,\" Vázquez said.\n\nA look at three tropical storms in the Atlantic as of Tuesday, September 24, 2019. NOAA\n\nTropical Storms Jerry and Lorenzo\n\nFarther north, Tropical Storm Jerry was moving northward and was projected to pass near Bermuda by Wednesday morning. It was about 270 miles west-southwest of Bermuda and had sustained winds of 50 mph.\n\nMeanwhile, Tropical Storm Lorenzo formed over the far eastern Atlantic and was projected to become a major hurricane by the end of the week, though while curving out over open sea away from land. It was centered about 370 miles west-southwest of the southernmost Cape Verde Islands and had maximum sustained winds of 65 mph. It was heading west-northwest at 16 mph.", "description": "Karen has drenched the U.S. Virgin Islands and walloped Puerto Rico still scarred by Hurricane Maria two years ago", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/09/25/f3faed2d-9d17-4884-af6d-61f1a8fb8ff9/thumbnail/1200x630/cd58a48b1eb12a4acbae610fe9a59052/tropical-storm-track-today.png", "published_at": "2019-09-24"}