{"pub": "dailymail", "url": "https://dailymail.co.uk/money/cars/article-6666465/Hondas-S2000-sports-car-golden-age-engineering-Cash-Cars.html", "downloaded_at": "2019-10-05 06:18:22.464496+00:00", "title": "Honda's S2000 sports car from a golden age of engineering: Cash Cars", "language": "en", "text": "The Honda S2000 is a fast and capable roadster from a golden age of old-school engineering.\n\nIt proved popular in the UK and if anything its reputation has grown with the years.\n\nNow the S2000 looks to have hit the bottom of its depreciation curve - buy a good one for under £10,000 and it should hold its value and reward you with many miles of high-revving fun, says Tony Middlehurst in our Cash Cars column.\n\nHonda's S2000's party trick was a high-revving engine but it also won the hearts of motoring fans and reviewers with its sharp handling and a good one now costs less than £10,000\n\nWhat’s your favourite engine type? The low throb of a big V8? The creamy whizz of a mid-sized V6? Or the never-gets-old shove of a heavily turbocharged four?\n\nFor some, it’s none of the above. It’s the high-revs scream of a sporting Honda.\n\nYou can pretty much pin it down to that one company because, apart from the rotary-engined Mazda RX-8, which likes to stop starting when it gets hot, no other affordable brands offer that exotic whiff of life at 9,000rpm.\n\nMore than one Honda pulls off that trick, too. They generally have an R somewhere in their name, but there’s one model that doesn’t.\n\nWe’re talking about the S2000 roadster, on sale between 1999 and 2009, and popularised not only by Gran Turismo and Fast And Furious but also by the world’s motoring press.\n\nSome of you may raise a whippersnapper’s eyebrow at the idea of investing in a Japanese sports car that hasn’t been available new since 2009. Uncle Bob, our in-house expert at picking out slow depreciators, will put you straight on that if you’ve got ten minutes to spare and the price of a pint in your pocket.\n\nCash Cars Cars lose money. As a general rule that’s true, with depreciation eating up thousands of pounds of the price you paid. However, it doesn’t have to be the case. Savvy buyers can pick up cars that will not only retain their value, but could be sold for more down the line. In our new Cash Cars series we look for those that fit the bill, read more: Audi A8: Luxury at a bargain price Mercedes SL: R129 about to shine\n\nFor a start, he’ll tell you that there were more S2000s on UK roads in 2018 than there were in 2017. That means there’s still a strong demand for them, either as imports or restoration projects.\n\nThen Bob will outline why that might be.\n\nHe will talk about the Honda Blackbird 1100 motorcycle in his garage. In a 2019 car, an engine of a similar size will produce somewhere between 100bhp and 130bhp, depending on turbo boost.\n\nEighteen years ago, Bob’s non-turbocharged Blackbird came out of the Honda dealership with over 165bhp. It remains totally reliable to this day, despite Bob’s efforts to burst it.\n\nThe point being that Honda knows how to make performance engines that don’t go pop.\n\nNo turbo here: The normally aspirated VTEC 2 litre engine produced up to 247bhp and had a red line at 9,000rpm. It was good for 0 to 60mph in six seconds\n\nDepending on where you bought it, the S2000’s normally aspirated VTEC 2-litre engine produced between 237bhp and 247bhp at a bonkers 8,300rpm.\n\nIn terms of horsepower per litre, it was the most powerful non-turbo engine ever, but 20 years on S2000 engine failure remains about as common as spotting a unicorn.\n\nAs he slams down his empty glass, Bob’s final piece of advice to you will be to check out the prices of other turn-of-the-century or earlier Japanese performance cars like the Nissan R34 Skyline, Toyota’s Supra and Honda’s own NSX.\n\nThe S2000 gives you 0-60mph in six seconds, a 150mph top speed, classic rear-wheel drive independent double wishbone-suspension handling, a slick six-speed manual gearbox, 50/50 front/rear weight distribution, a limited-slip differential and a really cool driving environment – all at prices starting from a measly £3,500.\n\nInterested now? OK. Let Bob tell you the many pluses – and the surprisingly few minuses – of Honda S2000 ownership.\n\nThe S2000 had an optional removable hardtop, handy for the British weather - and the snow if you dare to head there in a rear-wheel drive sports car, as Honda did for the press shots\n\nHonda S2000s: The good stuff\n\nIf you want roadgoing fun in a traditional format rear-wheel drive sports car, your choice isn’t that wide. There’s the Porsche Boxster, BMW Z4, Nissan 350Z or Toyota GT86 – or you could do what everybody else does and get a Mazda MX-5.\n\nThere’s no harm in that. MX-5s provide affordable fun and will always put a smile on your face. But, unlike the S2000, an unmodified MX-5 won’t get you giggling like a loon as you hang onto the lower gears in search of that 8,300rpm power peak and 9,000rpm redline.\n\nFor an example of what we mean, here’s an S2000 giving Porsche 911s and Nissan GT-Rs a run for their money at the Nürburgring.\n\nThe S2000’s aluminium 1,997cc 16-valve four-cylinder engine is all about power. With a mere 152lb ft torque at 7500rpm, and the famed VTEC kick coming in at just under 5,900rpm, it’s not so much Lee Marvin as Lee Evans. You’ll be working that aluminium gearknob hard, but that’s no hardship.\n\nFor a slightly more relaxing drive, post-2004 facelift UK models came with a less manic power curve, courtesy of a new intake manifold and a drive-by-wire throttle. Or you could try to find a US spec AP2 model with a slightly larger 2.2-litre engine.\n\nAs long as you look after your S2000 with regular oil changes – ideally every six months or 6000 miles – the motor is tougher than Bob’s old boots. It runs a timing chain rather than a belt, which is good, but the chain tensioner can wear out, which is not so good. It’s an easy fix though.\n\nSome cars swig oil at a fair rate, which you might see as a good thing as that means it’s always using fresh oil.\n\nThe most important point is that S2000 engine failure is practically unheard of, which is remarkable given its high-revving nature.\n\nHonda's S2000 added to its character with a digital speedometer and rev counter in an arc above it - tempting drivers to head for that golden 8,000rpm level\n\nThe VTEC variable valve timing system has a strong reputation too. If it suddenly stops working, it could be down to a too-low oil level: the car’s electronic brain will respond to that by taking VTEC offline. Clever folk, those Honda engineers.\n\nChassis-wise, S2000s are very sensitive to properly set up suspension. If you’re feeling slighty disappointed by the handling, and your suspicions are being confirmed by uneven tyre wear, a professional suspension alignment will bring rich rewards. So will greasing the double wishbone suspension bushes, something Honda reputedly didn’t bother to do at the factory. Odd folk, those Honda engineers.\n\nThe S2000 cabin is a delight, with comfy leather seats and an LCD strip tacho plus digital speedometer dash that still sets a standard for clarity and style. Climate and stereo controls are within a hand’s span of the steering wheel - a layout that a few of today’s designers might care to study.\n\nAlthough the electrical mechanism for the soft top rarely gives trouble, you’re almost bound to see some rub wear or even tearing of the fabric in the section behind your shoulder. If it’s gone too far, you should be able to source a replacement hood for about £500. Rattling hood catches are easy enough for an owner to replace.\n\nInside the S2000's cabin was snug but comfortable and had ergonomics that put many modern day cars to shame\n\nHonda S2000s: The not so good stuff\n\nThe very first S2000s were a bit skittish under pressure, especially in bad weather, and they also liked to follow longitudinal ruts (tramlining). That was all down to less than brilliant original equipment tyres and slightly mismatched springing and damping.\n\nAs a stopgap measure, Honda tweaked the suspension in 2002. In 2004 they brought in additional suspension and body stiffening mods, along with bigger wheels (up to 17in from 16in) and slightly slower steering. That was a really significant step forward.\n\nA post-’04 car is a good bet if you can afford one, though one downside of the facelift is a slightly fussier look to the front and rear ends.\n\nVSA stability and traction control was added to the options list in 2006, and to the standard equipment list in 2008, when the suspension was again reworked to sharpen up the handling.\n\nKeep an eye on the bodywork if you want your bargain second hand Honda S2000 to remain this fresh, as rust can be a threat (plane not included)\n\nAs regards the body, the usual Japanese recipe of poorly-rustproofed steel (only the bonnet is aluminium) means you do need to keep a close watch on creeping rot, especially in the hard-to-inspect areas behind the rear wheelarch liners. Putting problems right there won’t be cheap.\n\nMX-5 owners will be familiar with that phone call from the MOT inspector to say that their car has failed on a seized brake caliper. S2000s get that too. Given the type of use that S2000s experience, it’s perhaps not that surprising that the synchromesh on the higher gears can wear out on well-used cars.\n\nThe cabin is well put together, but the trim and hinged cover for the stereo head unit has a habit of coming loose.\n\nFinally, never buy an S2000 without trying one for size. If you’re on the lanky side, the driving position will be cosy to say the least, and if you have a GT model with the hard top you may have to leave your top hat at home.\n\nThere were almost 8,000 Honda S2000s that came to the UK and more than half that number are still on the road, indicating popularity. Prices have fallen to a point at which they have now stalled, indicating it may be near the bottom of the depreciation curve.\n\nHonda S2000: Bob’s three to think on\n\nIn the UK, we got nearly 8,000 of the 110,000 Honda S2000s built between 1999 and 2009. Believe it or not, there are still 4,300 or so of the little blighters running around on UK roads. Some of those will be imports, but it’s still a very impressive survival rate.\n\nTwo years ago, prices of clean, road legal, moderate-mileage S2000s started at around £6,000. That’s still the case today. For that sum you’ll get an MOT’d car with 120-130,000 miles and maybe the factory hard top.\n\nThis apparent plateauing of values suggests that S2000s aren’t going to go much lower, but as Bob will tell you, cheaper cars are always available. As with anything in life, it comes down to how much of a risk you want to take.\n\nFixable issues like an odd whine from the back end or a soupcon of suspension clonk will drop the entry price down to something nearer to £4,500.\n\nBob managed to find one for £3,500. That was a 226,000-mile example with a tired clutch (about £400 plus labour) and a bit of rust on the door and rear wing, mind ye. On the other hand it did have the hard top and a fresh MOT with no advisories.\n\nAt the top end of the market, last-year (2009) cars on private sale start at around £14,000, with low-mileage dealer cars approaching £16,000. These prices are pretty comparable to the ones you’ll pay for average-mile Porsche Boxsters of a similar age, although the spread of Porsche prices will be a bit wider depending on mileage.\n\nBMW Z4s are quite a bit cheaper than both, but neither the four-cylinder or the six-cylinder Zeds can compare to the Honda or the Porsche when it comes to refined mechanical thrills or handling delicacy.\n\nEarlier on we mentioned the worthiness of post-’04 cars. Post-2007 S2000s are also a good shout if your budget will stretch to £9,000-£10,000 for a moderately miled-up one because they come with even sweeter steering and a smoother power delivery – although you might not necessarily see that as a plus point if you’re an old-school VTEC fanperson.\n\nThis Honda S2000 on sale through eBay is a private car with just 75,000 miles on it\n\n2002, Honda S2000, £7,000 or make offer\n\nHere’s a nice earlyish (2002) private car that’s done 75,000 miles, was serviced six months/100 miles ago, and has a brand new MOT certificate with no advisories. Despite being undersealed it does have some arch rust and it also has the back-end whirr that is usually a duff wheel bearing. On the plus side it comes with a hardtop and a separate protective top.\n\nThis Honda S2000 is on sale with a dealer on AutoTrader and has the post 2004 suspension upgrades\n\n2006, Honda S2000, £8,995\n\nAs noted earlier, post-2004 cars are worth having for the factory upgrades to the suspension, wheels and steering. This blue 2006-er is well into the desirable era and apart from some light rusting noted on a brake pipe ferrule – hardly a dealbreaker, as most cars of this age will be similarly afflicted – and some light oil misting to one of the rear shocks it looks like good value at under £9,000. Especially as it’s a GT with the hardtop.\n\nThis rare Honda S2000 is the Edition 100, on sale through Pistonheads for a spicy £22,000\n\n2009, Honda S2000 Edition 100, £22,000\n\nThe most expensive S2000 you’re likely to see (if you can find one) will be a final-year Edition 100 in Grand Prix White with red leather and graphite alloys. With only 100 of these made, you’ll need over £20,000 for a low-miles example. Here’s one Bob has managed to find. It’s done just 25,000 miles and is a bit out of his normal price bracket at £22,000.", "description": "Buy a good Honda S2000 now for under £10,000 it should hold its value and reward you with many miles of high-revving fun, says Tony Middlehurst in our Cash Cars column.", "authors": ["Tony Middlehurst For Thisismoney.Co.Uk", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/02/06/18/9479210-0-image-a-7_1549478964731.jpg", "published_at": "2019-02-07"}