{"pub": "townhall", "url": "https://townhall.com/tipsheet/cortneyobrien/2019/09/09/british-airways-cancels-all-of-their-flights-n2552775", "downloaded_at": "2019-09-09 23:18:11.817022+00:00", "title": "British Airways Cancels Almost All of Its Flights", "language": "en", "text": "Excuse me while I breathe a sigh of relief. Having just taken a British Airways flight from London Heathrow on Saturday afternoon back to the States, this morning's headlines were pretty jarring. The airline has cancelled \"nearly 100 percent\" of its flights for 48 hours following a pilot strike.\n\nFrustrated fliers will have to make new plans, but BALPA union leader Brian Strutton explained why British Airways' behavior demanded a response.\n\n“They’ve previously taken big pay cuts to help the company through hard times,\" Strutton said. \"Now BA is making billions of pounds (dollars) of profit, its pilots have made a fair, reasonable and affordable claim for pay and benefits.”\n\nThe airline knew the strike was coming and warned its customers to stay home Monday and Tuesday. Almost 200,000 fliers are affected by the strike, and British Airways offered those individuals full refunds or rebooking options. It also apologized for the disruption.\n\nThere is Industrial Action planned by the pilots’ union, BALPA on 9 and 10 September 2019. We apologise for the significant impact this will have on our flights. If your flight is cancelled, please don’t go to the airport. For the latest info, visit https://t.co/rPEgyOeVyh. — British Airways (@British_Airways) September 7, 2019\n\nThe airline added on Monday that it plans to talk with the union.\n\nHeathrow, London's massive international airport, will be most impacted by the strike. The pilots' decision to stay home is reportedly going to cost British Airways 40 million pounds per day.\n\n“This strike will have cost the company considerably more than the investment needed to settle this dispute,” according to BALPA. “It is time to get back to the negotiating table and put together a serious offer that will end this dispute.”\n\nThe BALPA plans to strike once more on Sept. 27.", "description": ".09/09/2019 19:18:12PM EST.", "authors": ["Cortney O'Brien", "Matt Vespa", "Katie Pavlich"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/218/c91987f7-333d-4a9d-a00c-5c0c85240b02.jpg", "published_at": "2019-09-09"}