{"pub": "reuters", "url": "https://reuters.com/article/us-usa-media/u-s-court-deals-setback-to-fcc-push-to-revamp-media-ownership-rules-idUSKBN1W81YU", "downloaded_at": "2019-09-23 17:37:09.173741+00:00", "title": "U.S. court deals setback to FCC push to revamp media ownership rules", "language": "en", "text": "FILE PHOTO: The Federal Communications Commission (FCC) logo is seen before the FCC Net Neutrality hearing in Washington February 26, 2015. REUTERS/Yuri Gripas/File Photo\n\nWASHINGTON (Reuters) - The Federal Communications Commission suffered a setback on Monday in a long-running legal battle when a federal appeals court struck down its latest effort to loosen U.S. media ownership rules.\n\nThe Republican-led FCC in 2017 voted 3-2 to eliminate the 42-year-old ban on cross-ownership of a newspaper and TV station in a major market. It also voted to make it easier for media companies to buy additional TV stations in the same market, and for local stations to jointly sell advertising time and for companies to buy additional radio stations in some markets.\n\nThe court told the FCC to take up the issue again, saying the regulator “did not adequately consider the effect its sweeping rule changes will have on ownership of broadcast media by women and racial minorities.”\n\nFCC Chairman Ajit Pai said in a statement that despite instructions from Congress to review media ownership regulations a majority of federal appeals court judges for 15 years “has taken that authority for themselves, blocking any attempt to modernize these regulations to match the obvious realities of the modern media marketplace.”\n\nPai added that “there is no evidence or reasoning — newspapers going out of business, broadcast radio struggling, broadcast TV facing stiffer competition than ever — that will persuade them to change their minds.”\n\nThe FCC plans to challenge the decision, he added.\n\nBig media companies including Tegna Inc (TGNA.N), CBS Corp (CBS.N) and Nexstar Media Group Inc (NXST.O) cited the 2017 rule change as motivation for considering expansion opportunities.\n\nThe FCC is weighing other changes to U.S. media ownership rules. In December, it sought comments on a rule that bars one company from owning two TV stations in the same market except under certain circumstances. The FCC asked if those rules continue “to serve the public interest and remains necessary.”\n\nThe FCC is also considering if existing rules that limit the number of local radio stations in a single market should be rescinded, asking if the rule “remains necessary to promote competition, localism, or viewpoint diversity.”", "description": "The Federal Communications Commission suffered a setback on Monday in a long-running legal battle when a federal appeals court struck down its latest effort to loosen U.S. media ownership rules.", "authors": ["David Shepardson", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190923&t=2&i=1433025911&w=1200&r=LYNXMPEF8M1JP", "published_at": "2019-09-23"}