{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/trafficandcommuting/house-gop-wants-deeper-investigation-of-jack-evans-metro-scandal/2019/09/10/8da9b5f4-d341-11e9-9343-40db57cf6abd_story.html", "downloaded_at": "2019-09-10 23:32:14.642625+00:00", "title": "House GOP wants deeper investigation of Jack Evans Metro scandal", "language": "en", "text": "House Republicans are pressing for a deeper investigation of D.C. Council member Jack Evans’s “ethically compromised” behavior when he was Metro board chairman, including whether he and an ally tried to obstruct the inquiry that led to his resignation from the panel.\n\nTwo top GOP congressmen on the House Oversight Committee wrote to their Democratic counterparts on the panel Tuesday, calling for the committee staff to conduct “transcribed interviews” with Evans and four current and former Metro officials.\n\nReps. Jim Jordan (R-Ohio) and Mark Meadows (R-N.C.) said further investigation is warranted, partly because Metro documents suggest Evans (D) and former board member Corbett A. Price sought to block the board’s ethics committee investigation of Evans and conceal its results.\n\nThe Washington Post obtained a copy of the letter and an accompanying staff memorandum describing the GOP concerns.\n\nThe initiative appeared designed in part to highlight the scandal over Evans, a longtime D.C. Council member, as a way to undercut support for District statehood and to tighten federal oversight of Metro.\n\nA congressional hearing on D.C. statehood is scheduled for Sept. 19. Opponents of statehood have often cited corruption in District politics as a reason to oppose it.\n\n[Evans to resign from Metro board after probe shows he ‘knowingly’ violated rules]\n\nJordan is the top Republican on the House Oversight Committee, and Meadows is the ranking GOP member of the panel’s government operations subcommittee. Those panels oversee the District and Metro, respectively.\n\nThe letter was addressed to Oversight Committee Chairman Elijah E. Cummings (D-Md.) and the subcommittee chair, Rep. Gerald E. Connolly (D-Va.).\n\n“The information produced to the Committee to date suggests that Evans attempted to exploit his position on the [Metro] Board for his personal financial benefit,” the letter said. “This investigation has a direct bearing on matters currently before the Committee, including the announced hearings on statehood for the District of Columbia and [Metro] oversight.”\n\nThe Republicans noted that while the Metro board’s ethics committee investigated Evans’s business dealings, there has been no probe of evidence that Evans and Price sought to obstruct the inquiry.\n\nConnolly said his subcommittee would address the Evans controversy and Metro safety issues at an Oct. 22 hearing. He did not say whether he would support the deeper investigation sought by the GOP. “The documents provided to our Committee confirm my serious concerns about Mr. Evans’s unethical behavior,” Connolly said in a statement. “We can’t turn a blind eye to this type of self-dealing and threats.”\n\nMetro board chairman Paul Smedberg said he has accepted an invitation to testify at the hearing, at which he plans to share “the ethics improvements that, as the board’s new chair, I am advancing.” On Thursday, the Metro board will consider changes in its much-criticized ethics procedures, including requiring that ethics findings be made public and that the agency’s inspector general play a bigger role in investigations.\n\nCummings’s office did not immediately respond to a request for comment.\n\nThe Post reported last month that Evans threatened the jobs of Metro’s general counsel and board secretary in an effort to keep secret that the agency’s ethics committee had found Evans committed a violation, according to confidential agency documents and current and former Metro officials. Evans was supported by Price, who badgered Metro General Counsel Patricia Y. Lee and made false statements about the inquiry’s results.\n\n[Jack Evans threatened Metro officials’ jobs in an effort to conceal ethics violation, documents show]\n\n“The concerted effort by a jurisdiction [the District] to derail an investigation to protect one of its own should be investigated thoroughly to ensure Committee members are in possession of all available information, particularly in light of upcoming hearings announced by Chairman Cummings to consider D.C. statehood,” the nine-page memo accompanying the GOP letter said.\n\nThe scandal led both Evans and Price to resign from the board.\n\nJordan and Meadows called on the Democratic-controlled committee to interview Evans and four Metro officials whom documents have identified as being familiar with the efforts to obstruct the ethics probe: Lee, former ethics committee chairman Clarence C. Crawford, board corporate secretary Jennifer Green Ellison and Metro Senior Vice President Lynn M. Bowersox.\n\n[Corbett Price, under fire for concealing ethics violation, resigns from Metro board]\n\nIn describing in detail the allegations of Evans’s ethical violations, the GOP staff memo reviewed information that has previously been made public. It drew on more than 900 pages of confidential documents from the Metro ethics committee’s investigation, which the Republicans requested from Metro in July and which have previously been reported by The Post.\n\n“These documents suggest that Evans was ethically compromised and that he sought and obtained personal financial benefit in return for official actions,” the memo said.\n\nIt cited three broad areas where it said Evans may have committed ethical violations — by helping a parking company with which he had an undisclosed consulting contract paying $50,000 a year; by working on behalf of a digital sign company with which he had a consulting arrangement for a time; and by using his position on the Metro board in an attempt to advance his personal business opportunities.\n\nAn outside law firm retained by Metro found Evans committed multiple ethics violations in those three areas. But the four-member ethics committee could reach agreement only that Evans committed a single violation, by failing to disclose his consulting contract with the parking company.\n\n“The information we have received so far raises serious concerns,” Jordan said. “Congress and District residents need to have complete confidence that the local leaders are accountable and above reproach.”", "description": "Republicans say the controversy is relevant to debates over D.C. statehood and Metro oversight.", "authors": ["Robert Mccartney", "Senior Regional Correspondent Covering Government", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/69dn-kyxJZ5FcIRWoi6utrNJZog=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OE3ZIPUY6YI6TGQW3RKR5JNEHM.jpg", "published_at": "2019-09-10"}