{"pub": "guardian", "url": "https://theguardian.com/football/2019/sep/23/bernardo-silva-mendy-tweet-fa-kick-it-out-calls-action", "downloaded_at": "2019-09-23 10:35:33.222350+00:00", "title": "Kick It Out calls for FA action against Bernardo Silva over Mendy tweet", "language": "en", "text": "Kick It Out has called on the Football Association to take action against a “discriminatory” tweet by Bernardo Silva in reference to his Manchester City teammate Benjamin Mendy.\n\nFA looking into tweet posted by Manchester City’s Bernardo Silva Read more\n\nFootball’s anti-discrimination charity accused Silva of using a “racist stereotype” and expressed shock after the Manchester City midfielder on Sunday posted a photo on Twitter believed to be of Mendy as a child next to an offensive image with the caption: “Guess who?” The image was of the logo for the Spanish confectionery company Conguitos. The tweet was later deleted.\n\nThe FA is aware of the post and, if the game’s governing body decides to investigate further, then Silva, who scored a hat-trick in City’s 8-0 victory over Watford on Saturday, could face a fine or a ban if found guilty of racism. The FA in July introduced a minimum six-game ban for anyone found guilty of racist abuse but that does not automatically apply to social media.\n\nKick It Out said: “We are extremely disappointed to see the tweet posted by Bernardo Silva, which has since been deleted. Racist stereotypes are never acceptable as ‘banter’, and we’re shocked that someone who is a role model to millions has failed to understand the discriminatory nature of his post.\n\nThe tweet sent by Manchester City’s Bernardo Silva. Photograph: Twitter\n\n“The FA have been notified and we believe that retrospective action should be taken, including mandatory education – which is vital to challenge offensive behaviour such as this.”\n\nHaving deleted the initial post, Silva later tweeted: “Can’t even joke with a friend these days... You guys …”, for which he was heavily criticised on the social media platform.\n\nIt is not the first time Silva has appeared to reference Mendy’s skin colour on social media. A video from an earlier date has also emerged of Silva asking the French left-back why he was naked. Mendy is wearing a black T-shirt in the clip.\n\nMendy and Silva are good friends and have played with each other since 2016, first at Monaco and then, from 2017, at Manchester City. Mendy did not seem to be offended by the tweet, replying with three smileys, an emoji with clapping hands and the words “1-0 for you will see”.", "description": "Kick It Out has called on the Football Association to take action against a ‘discriminatory’ tweet by Bernardo Silva in reference to his Manchester City teammate Benjamin Mendy", "authors": ["Jacob Steinberg"], "top_image": "https://i.guim.co.uk/img/media/4a999070c0aa59d0c71ae093eb2c4865a9131287/766_74_4225_2535/master/4225.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4517288c3984b794845f1f00430164a3", "published_at": "2019-09-23"}