{"pub": "politico", "url": "https://politico.eu/article/boris-johnson-facebook-peoples-pmqs", "downloaded_at": "2019-09-12 07:10:25.348951+00:00", "title": "Boris Johnson, the Pericles of the Facebook era", "language": "en", "text": "LONDON — Friends, Britons, countrymen, lend me your EarPods!\n\nThe U.K.'s classicist prime minister, Boris Johnson, is trying out a new (and old) brand of democratic participation — People's PMQs on Facebook Live.\n\nIt began with MP-bashing, it ended with an exhortation of the virtues of the great Athenian democrat Pericles, and while it revealed little in terms of policy, it was a revealing insight into the kind of populist-lite leadership Johnson wants to project.\n\nSeated in his Downing Street office, a model of a double-decker London bus just visible behind him and a silver iPad propped up in front, Johnson began by complaining MPs are still \"off on holiday.\" But here he was primed to take \"unpasteurized\" questions from the public \"via this machine,\" he said, referring to the iPad as if it were the control panel of the TARDIS.\n\nNever mind that MPs spend much of their summer break doing casework in their constituencies, let's not let facts get in the way of a people vs. politicians narrative.\n\nJohnson — who dealt with the public for a mere 10 minutes — has some catching up to do, but we are promised more editions soon.\n\nFirst up, Luther in Cheshire wanted to know how Johnson is going to deliver on his promise to take the U.K. out of the EU, deal or no deal, on October 31, despite the fact the EU won't renegotiate and parliament will try to stop a no-deal Brexit.\n\nThere is, Johnson agreed, a “terrible collaboration” taking place between MPs trying to block Brexit and \"our European friends.\"\n\nEU leaders, he said, are “sticking with every letter, every comma of the Withdrawal Agreement, including the backstop, because they still think that Brexit can be blocked in parliament.” Staring down the camera and waving his hands for emphasis, he insisted he does not want to leave without a deal, but that the longer this apparently malign collusion carries on, the more likely that would be.\n\nNext up was Mickey, a farmer in Scotland, who didn't want to know about tariffs that will be slapped on British produce sold to Europe in the event of no deal, but instead was interested in what Johnson is doing to support the other union, the U.K.\n\nSam from Newport in South Wales asked about a general election, a question Johnson gracefully dodged by saying that the British has endured \"a lot of elections and electoral events\" lately and what they really want now is Brexit (on October 31, did he mention?).\n\nOccasionally he glanced off-camera at an unseen other person or people in the room, which may or may not have included tech-loving, MP-bashing, Pericles-quoting senior adviser Dominic Cummings. Alongside the hard line on Brexit, the questions showcased Johnson and Cummings' wider agenda, centered on issues Downing Street believes represent the public's own priorities: preventing violent crime, supporting the National Health Service, improving internet coverage nationwide.\n\nThough a People's PMQs has all the hallmarks of a Cummings tactic, it is not an especially new idea for leaders seeking to portray themselves as benevolent champions of the people: just ask Vladimir Putin, whose annual phone-ins have been known to last for four hours.\n\nJohnson — who dealt with the public for a mere 10 minutes — has some catching up to do, but we are promised more editions soon.\n\nAfter fielding further tough questions, some of which bore a remarkable and no doubt entirely coincidental resemblance to Downing Street talking points — \"What will you do to restore the British people's faith in politics and politicians?\" \"What efforts will you take to ensure your government represents and hears the voices of all British people across the country?\" — Johnson responded to Oliver who wanted to know who the prime minister's political hero is.\n\n\"Pericles will go down as one of the most powerful articulators of the idea of democracy, which is that the people are ultimately in charge of their own destiny\" — Boris Johnson\n\nJohnson has answered this one several times before, and while mentioning Winston Churchill as one hero, he leaped into an oration on Pericles of Athens.\n\n“Pericles of Athens, who believed in all sorts of wonderful things … he certainly believed in great infrastructure projects, he believed in the importance of the many not the few, but above all Pericles will go down as one of the most powerful articulators of the idea of democracy, which is that the people are ultimately in charge of their own destiny,\" he said.\n\nThe idea that Pericles, who has been dead for more than 2,400 years, \"will go down\" in history as a champion of democracy might have struck some listeners as an odd way to put it. But perhaps Johnson had someone else in mind.", "description": "UK prime minister takes to social media to answer questions from the masses.", "authors": ["Charlie Cooper", "Isabella Borshoff", "Will Hanmer-Lloyd"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/08/GettyImages-1161230601-1-1200x628.jpg", "published_at": "2019-08-14"}