{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7548329/Boy-spots-man-using-phone-film-inside-caravan-park-toilet-New-South-Wales-coast.html", "downloaded_at": "2019-10-08 01:27:51.600080+00:00", "title": "Boy spots man using a phone to film him inside caravan park toilet on New South Wales coast", "language": "en", "text": "A nine-year-old boy was left shaken after finding a man filming him inside a toilet block at a caravan park.\n\nThe boy was with his family at a caravan park on Crowdy Street in Harrington on the New South Wales Mid North Coast at 4.30pm on Monday when he went to a public toilet block.\n\nWhile in the cubicle, the boy noticed a mobile phone on the ground which he believed was on video mode.\n\nA nine-year-old boy was left shaken after finding a man filming inside a toilet block at a caravan park (stock image)\n\nThe boy was with his family at a caravan park on Crowdy Street in Harrington (pictured) on the New South Wales Mid North Coast at 4.30pm on Monday when he went to a public toilet block\n\nAn unknown man in the next cubicle then picked the phone up and continued to film.\n\nThe boy left the toilet block and told his parents.\n\nHe only saw the man's feet and described him as wearing black thongs with one toenail filed to a point.\n\nOfficers from Manning-Great Lakes Police District attended a short time later and searched the area; however could not locate the man.\n\nThe incident has again prompted police to encourage parents to discuss the 'Safe People, Safe Places' messages with their children.\n\nThe incident has again prompted police to encourage parents to discuss the 'Safe People, Safe Places' messages with their children", "description": "The boy was with his family at a caravan park on Crowdy Street in Harrington on the New South Wales Mid North Coast at 4.30pm on Monday when he went to a public toilet block.", "authors": ["Kelsey Wilkie For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/01/19420702-0-image-a-37_1570495132937.jpg", "published_at": "2019-10-08"}