{"pub": "yahoo", "url": "https://news.yahoo.com/amnesty-urges-hong-kong-probe-020916473.html", "downloaded_at": "2019-10-18 06:09:29.710779+00:00", "title": "Hong Kong assembly in chaos; attack on democracy leader a 'chilling signal'", "language": "en", "text": "A lawmaker shouts at Hong Kong's Chief Executive Carrie Lam as she leaves the Legislative Council in Hong Kong\n\nBy Sarah Wu and Jessie Pang\n\nHONG KONG (Reuters) - Hong Kong's parliament descended into chaos on Thursday, with lawmakers dragged out by security guards for heckling leader Carrie Lam as they demanded an inquiry into a brutal attack on a prominent human rights activist ahead of a major rally.\n\nThe knife and hammer attack on Jimmy Sham, which left him bloodied and lying in the street on Wednesday night, was designed to intimidate protesters and incite violence ahead of Sunday's march, pro-democracy lawmaker Claudia Mo told reporters.\n\n\"This very vicious attack took place practically on the eve of the call for yet another massive protest in Hong Kong on Sunday. We can't help feeling that this entire thing is part of a plan to shed blood on Hong Kong's peaceful protests,\" she said.\n\nThe second day of turmoil in the Legislative Council, after Lam was forced to cut short her annual policy speech on Wednesday due to heckling and broadcast it via video instead, underscores the political rift in the city, with no end in sight to more than four months of anti-government protests.\n\n\"Regarding the current situation we are facing, we need to be united against violence, say no to violence,\" Lam said in the chamber and again defended her efforts to end the crisis.\n\n\"I have mentioned that we will be humble, listen to different voices and set up an expert commission to find a way out of the current situation we are facing,\" she said.\n\nLam later staged a Facebook Live event to air her policy address and answer pre-submitted questions. After 30 minutes of the one hour event, 5,700 \"angry\" emojis had been posted compared with 1,300 \"likes\".\n\nHong Kong has been battered by four months of protests, driven by concerns Beijing is eroding freedoms granted when Britain handed the city back to China in 1997.\n\nThe crisis in the Chinese-ruled city is the worst since the handover and poses the biggest popular challenge to China's President Xi Jinping since he took office.\n\nLam offered no olive branch to protesters in her policy speech on Wednesday, but sought to ease resentment by announcing measures to ease Hong Kong's chronic housing shortage that has partly fueled protests - a move widely rejected by pro-democracy leaders.\n\n\n\n\n\n'HORRIFYING ATTACK'\n\nPro-democracy lawmakers again accused Lam of having \"blood on her hands\" for not meeting protesters' demands to end the unrest, introducing colonial-era emergency laws and allowing police to use what activists say is excessive force.\n\nProtesters have five core demands, which include universal suffrage and an independent inquiry into police behavior.\n\nRights group Amnesty International said the \"horrifying attack\" on Sham, head of the Civil Human Rights Front (CHRF), would send a \"chilling signal\" and urged authorities to investigate. Police said they would.\n\nSham was attacked in the gritty Mong Kok district by five men with knives and hammers. Photographs on social media show him lying sprawled on the ground, bleeding from his head.\n\nCHRF said he suffered three wounds to the head and has swollen knees and elbows.\n\nFrom hospital Sham urged people not to seek revenge.\n\n\"Regardless of the identity, ethnicity, skin color of the perpetrators, the root of the problem is the violence of the regime and the political system,\" he said in a statement.\n\nPolice said they believed the attackers were not Chinese, but did not elaborate.\n\n\"No matter how difficult the situation on Sunday might be, everyone please take care and be safe,\" said Sham.\n\n\n\n\n\nSUNDAY MARCH\n\nPolice and protesters, some dressed in black ninja-style outfits, have fought running street battles for weeks, with police firing tear gas, rubber bullets and occasionally live rounds against brick and petrol-bomb throwing activists.\n\nTwo people have been shot and wounded by police and thousands injured. Police have arrested more than 2,300 people since June.\n\n\"Condemning the violence will not help when the police force, executing the repressive policy of a recalcitrant government, is not held to account,\" one of Hong Kong's leading barristers, Lawrence Lok, wrote in an opinion piece in the South China Morning Post on Thursday after Lam's comments.\n\nHardcore protesters have torched the city's metro and Chinese banks and scores of shops they believe are linked to mainland China. The Asian financial hub is facing its first recession in a decade due to the unrest.", "description": "Hong Kong's parliament descended into chaos on Thursday, with lawmakers dragged out by security guards for heckling leader Carrie Lam as they demanded an inquiry into a brutal attack on a prominent human rights activist ahead of a major rally.  The knife and hammer attack on Jimmy Sham, which left", "authors": ["Sarah Wu", "Jessie Pang"], "top_image": "https://s.yimg.com/uu/api/res/1.2/.xnJn.s46emC9gk8MTPYtw--~B/aD0zMDQ7dz00NDk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/e4caba8a889301714ad3f0cd7288c25c", "published_at": "2019-10-17"}