{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7613399/Princess-Elisabeth-Belgium-celebrates-18th-birthday-Royal-Palace-Brussels.html", "downloaded_at": "2019-10-25 16:11:56.274008+00:00", "title": "Princess Elisabeth of Belgium celebrates her 18th birthday at the Royal Palace in Brussels", "language": "en", "text": "Advertisement\n\nMost teenagers celebrate their 18th birthday with a party or first legal drink with friends.\n\nBut it was a decidedly more lavish affair for Crown Princess Elisabeth of Belgium, who marked the occasion with an official ceremony in Brussels today.\n\nThe heir to the Belgian throne, a student at Welsh boarding school UWC Atlantic College, was honoured with a televised celebration at the opulent Royal Palace, complete with ballet dancers, royal speakers - and a performance by a former Eurovision star.\n\nKing Philippe, 59, beamed as he presented Elisabeth with a medal while proud mother Queen Mathilde, 46, fought back a tear as she watched her teenage daughter deliver a speech to the roomful of VIP guests.\n\nHer grandparents, King Albert II and Queen Paola, and siblings Prince Gabriel, 16, Prince Emmanuel, 14, and Princess Eleonore, 11, also attended.\n\nToday's milestone is particularly significant because the princess is now legally old enough to rule without a substitute regent being appointed.\n\nRoyal duties: Crown Princess Elisabeth of Belgium, marked her 18th birthday with a celebration in Brussels. The future Belgian queen posed for photos with dancers from the Royal Ballet School of Antwerp, who were invited to perform at the event\n\nEntertainment: Dancers from the Royal Ballet School of Antwerp performed for guests at the lavish Royal Palace in Brussels, pictured, in honour of the milestone. Eurovision star Blanche - who came fourth in the singing contest - also took to the stage\n\nLoving daughter: Elisabeth gazed at her father King Philippe of Belgium as he presented her with the Order of Leopold. The Order of Leopold is the oldest order of chivalry or knighthood in Belgium having been founded in July 1832\n\nProud mother: Elisabeth, heir to the Belgium throne, was congratulated by her mother Queen Mathilde after receiving the Order of Leopold during today's ceremony. Elisabeth is now old enough to rule without a regent being appointed\n\nPoised: Crown Princess Elisabeth of Belgium, pictured at the podium, was applauded by her parents (seated far left) Mathilde and Philippe after delivering a speech at an event to mark her 18th birthday at Brussels' Royal Palace today\n\nComposed: The Belgian princess demonstrated grace beyond her years when delivering her speech at the birthday event, pictured. The proceedings were broadcast live across three of Belgium's biggest television channels\n\nOvercome: Proud mother Queen Mathilde, 46, fought back a tear and was comforted by husband King Philippe (right) as she watched her teenage daughter deliver a speech to the roomful of VIP guests. Pictured left, their son Prince Gabriel, 16\n\nClassic: Princess Elisabeth plumped for a tailored trench coat dress with a flattering waist belt for the high profile royal occasion today, pictured. The royal was the picture of elegance as she posed for photos following the ceremony (above)\n\nMarking the occasion: Princess Elisabeth led the dancers outside for photos outside the front of the Royal Palace\n\nThe teenager arrived in Brussels this week from South Wales, where she studies at UWC Atlantic College, a top private college dubbed 'hippie Hogwarts'.\n\nShe started at the school - whose alumni include Dutch king Willem-Alexander and Princess Raiyah of Jordan - at the start of the academic year.\n\nToday the young princess demonstrated poise beyond her years as she stood to be presented with a medal by her father in a ceremony that was broadcast live on three of Belgium's biggest TV channels.\n\nBirthday girl! Crown Princess Elisabeth of Belgium marked her 18th birthday with an official ceremony at the Royal Palace in Brussels today. Pictured, Elisabeth with father King Philippe after being presented with the Order of Leopold\n\nSolemn: The look on Philippe's face as he presented Elisabeth with the Order communicated the seriousness of the moment\n\nPicture of pride: King Philippe kissed his smiling teenage daughter on the cheek following the presentation at the palace\n\nMarking the milestone: King Philippe of Belgium also stepped up to the podium to speak about his daughter's milestone\n\nClose relationship: Pictured front row, left to right, Princess Eleonore, Prince Emmanuel, Prince Gabriel, Queen Mathilde, Princess Elisabeth, King Albert II, clap as King Philippe of Belgium stands to speak during the celebrations\n\nBig sister: Crown Princess Elisabeth is congratulated by her siblings Prince Gabriel, 16, Prince Emmanuel, 14, and Princess Eleonore, 11, after receiving the Order of Leopold. Pictured, Prince Emmanuel brings his older sister in for a hug\n\nHonoured: Belgium's Crown Princess Elisabeth is congratuled by her her grandparents, King Albert II and Queen Paola, after receiving the Order of Leopold, at a ceremony on the occasion of her 18th birthday\n\nFull of pride: The King's brother, Prince Laurent of Belgium, congratulates his niece after she received the order from the King\n\nQuiet moment: Queen Mathilde whispered something in her daughter's ear after she received the order at the event\n\nRadiant: Queen Mathilde of Belgium smiled as she held her daughter Princess Elisabeth after she received the order. The Belgian Queen kissed her 18-year-old daughter on the cheek (right) as she congratulated her on the special moment (right)\n\nLike mother, like daughter: Queen Mathilde and Princess Elisabeth both looked elegant today in dresses for the occasion\n\nEmotional: Mathilde, pictured speaking to her eldest son Prince Gabriel, appeared overwhelmed with emotion\n\nCentre of attention: The Belgian royal family, centre, led a room full of VIP guests celebrating Princess Elisabeth's birthday\n\nWelsh boarding school dubbed 'hippie Hogwarts' Princess Elisabeth of Belgium enrolled at UWC Atlantic College in South Wales, a top private college dubbed 'hippie Hogwarts', at the start of the academic year. Her home is the crumbling, 12th century St Donat's Castle in the Vale of Glamorgan where she studies the International Baccalaureate. According to reports students are encouraged to avoid 'excessive displays of wealth' by mingling with people from all walks of life while the use of expensive gadgets such as laptops is discouraged. Alumni include Dutch king Willem-Alexander and Princess Raiyah of Jordan, but students are just as likely to rub shoulders with 'refugees from west Africa' and 'California hippies,' according to an article published in The Times last year.\n\nFollowing the lead of her elegant mother, Princess Elisabeth donned a tailored white trench coat dress and nude suede heels for the celebrations.\n\nKing Philippe delivered a speech before attendees were treated to performances by Eurovision singer Blanche - who came fourth in the singing contest two years ago - and students from the Royal Ballet School of Antwerp.\n\nFive teenagers - two Dutch, two French and one German speaker - were also invited to speak and expressed their dreams for the future and what they'd like from the future head of state.\n\nThey were selected after the palace asked youngsters to send in letters that they'd like to read to the princess.\n\nQueen Mathilde was the picture of motherly pride and stood to hug her daughter after she spoke to the audience - which included politicians as well as other youngsters born in 2001 - and viewers at home.\n\nUsually, a live broadcast of a royal event in Belgium is reserved for weddings and funerals - unlike in the UK where the Queen's Trooping the Colour parade for her birthday is aired on TV.\n\nFamily affair: Queen Mathilde of Belgium (left) and King Philippe (centre) with daughter Elisabeth (right) at today's event\n\nPolished: Following the lead of her elegant mother, Princess Elisabeth donned a tailored white trench coat dress and nude suede heels for the celebrations, pictured left. Right, with mother Queen Mathilde\n\nIn the spotlight: Princess Elisabeth is now allowed to rule without a regent being appointed\n\nBest foot forward: A young dancer prepares to perform a routine for the royal family\n\nFamily honour: King Philippe's mother Queen Paola, the wife of the former King Albert II, who abdicated in 2013. Pictured right, her daughter-in-law Queen Mathilde of Belgium, who looked beautiful in periwinkle blue for the occasion\n\nShy smile: Princess Elisabeth, who studies in Wales, looked demure at today's events\n\nGuiding voice: King Philippe spoke quietly to his daughter Elisabeth during a moment in the ceremony\n\nLight-hearted moment: The Belgian King and Princess appeared to share a joke at one point during the ceremony, pictured\n\nTickled: Queen Mathilde, left, King Philippe, centre, and Queen Elisabeth, right, all enjoyed the entertainment of the day\n\nEsteemed guests: Prince Gabriel of Belgium, 16, (pictured far left) was seated alongside his mother and father (centre) for the ceremony marking his sister's 18th birthday today\n\nPhilippe and Mathilde also have three younger children, Prince Gabriel, 16, Prince Emmanuel, 14, and Princess Eleonore, 11.\n\nOn Wednesday, a selection of images, taken by photographer Michel Gronemberger, were published by the palace to celebrate Elisabeth's birthday.\n\nOne showed her in an elegant blue gown standing on a set of grand steps found in the Royal Palace of Laeken, where her parents live, while another captured her sitting at a desk holding open a photo album.\n\nThe third and final image showed Elisabeth with her father Philippe, who acceded to the throne on 21 July 2013 after his father Albert II abdicated for health reasons.\n\nWoman of the hour: Belgium's Crown Princess Elisabeth poses with dancers and young guests following the ceremony\n\nCrisp and clean: Princess Elisabeth beamed as she made her way outside the front of the Royal Palace for the photos\n\nPhoto call: Princess Elisabeth posed with dancers and other invited guests following the ceremony\n\nDelicate accessories: The heir to the Dutch throne accessorised her tailored ensemble (left) with a small pair of earrings", "description": "Princess Elisabeth, heir to the Belgium throne, was joined by parents King Philippe, 59, and Queen Mathilde, 46, for the event at the opulent Royal Palace this morning.", "authors": ["Stephanie Linning For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/13/20178502-0-image-a-67_1572005627473.jpg", "published_at": "2019-10-25"}