{"pub": "independent", "title": "Southeast US braces for potentially deadly Dorian", "url": "https://independent.co.uk/news/world/americas/hurricane-dorian-storm-latest-tracker-path-florida-bahamas-south-carolina-georgia-a9086741.html", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:49:58.790408+00:00", "text": "The Bahamas and the southeastern US are bracing for Hurricane Dorian as it barrels towards the region with an unclear trajectory and chance of “strong winds and life-threatening storm surge”, according to the National Hurricane Centre.\n\nDorian was expected to move up the southeast coastline and stay just offshore of Florida while skirting the coast of Georgia, forecasters said on Sunday, with the possibility of landfall still a threat on Wednesday. The storm was then expected to continue towards South Carolina by early Thursday, where Governor Henry McMaster declared a state of emergency on Saturday.\n\nEvacuations began on Saturday in the Bahamas as most resorts closed down and authorities evacuated the northern shore and low-lying islands.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe risk of storm surge and strong winds will increase by the middle of next week along the Georgia and South Carolina coasts, the National Hurricane Centre said.\n\nThe centre also said that did not mean Dorian, packing 145 mph (230 kph) winds, won’t hit Florida, with large portions of the state in its cone of uncertainty forecast.\n\nStill, after days of a forecast that put the Sunshine State and Donald Trump’s Mar-a-Lago estate in the centre of expected landfalls, the changes are significant.\n\nShape Created with Sketch. Tropical storm Dorian expected to strengthen to hurricane Show all 7 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Tropical storm Dorian expected to strengthen to hurricane 1/7 Shoppers preparing for the arrival of tropical storm Dorian stock up on supplies at a supermarket in Bridgetown, Barbados, on 25 August 2019. The US National Hurricane Centre warned the storm was expected to strengthen to a hurricane by the time it reached Puerto Rico on 28 August 2019. REUTERS/Nigel R Browne 2/7 Residents board up a pharmacy in Bridgetown, Barbados, 26 August 2019. AP/Chris Brandis 3/7 Storm clouds gather as tropical storm Dorian moves towards St Michael Parish, Barbados, 26 August 2019. AP/Chris Brandis 4/7 Nearly empty shelves where bottled water is normally displayed at a supermarket in Cabo Rojo, Puerto Rico, 26 August 2019. REUTERS/Ricardo Arduengo 5/7 Hotel employees remove sun loungers from a pool area in Gros Islet, St Lucia, 26 August 2019. REUTERS/Andrea de Silva 6/7 Empty shelves that are normally filled with bread are seen empty at a supermarket in Gros Islet, St Lucia, 26 August 2019. REUTERS/Andrea de Silva 7/7 Tropical storm Dorian is pictured off the coast of Venezuela in this NASA satellite photo, 26 August 2019. NASA/Handout via Reuters 1/7 Shoppers preparing for the arrival of tropical storm Dorian stock up on supplies at a supermarket in Bridgetown, Barbados, on 25 August 2019. The US National Hurricane Centre warned the storm was expected to strengthen to a hurricane by the time it reached Puerto Rico on 28 August 2019. REUTERS/Nigel R Browne 2/7 Residents board up a pharmacy in Bridgetown, Barbados, 26 August 2019. AP/Chris Brandis 3/7 Storm clouds gather as tropical storm Dorian moves towards St Michael Parish, Barbados, 26 August 2019. AP/Chris Brandis 4/7 Nearly empty shelves where bottled water is normally displayed at a supermarket in Cabo Rojo, Puerto Rico, 26 August 2019. REUTERS/Ricardo Arduengo 5/7 Hotel employees remove sun loungers from a pool area in Gros Islet, St Lucia, 26 August 2019. REUTERS/Andrea de Silva 6/7 Empty shelves that are normally filled with bread are seen empty at a supermarket in Gros Islet, St Lucia, 26 August 2019. REUTERS/Andrea de Silva 7/7 Tropical storm Dorian is pictured off the coast of Venezuela in this NASA satellite photo, 26 August 2019. NASA/Handout via Reuters\n\n“It’s going to be pretty scary because you’re going to have this gigantic hurricane sitting off the coast of Florida and it’s not going to move,” said private meteorologist Ryan Maue, but with the storm slowing and likely to turn north he adds: “The worst effects of a direct landfall are not in the forecast.”\n\n“At this point the track the hurricane centre is issuing is not the catastrophe that could happen, which is good,” Mr Maue said on Saturday.\n\nBut the Bahamas may be less fortunate. Some of the most reliable computer models suggest the storm will stall and dump as much as 50in (127cm) of rain. He said expect between 2ft and 4ft (0.6 to 1.2 metres) of rain there.\n\nMillions of people in Florida have been in the changing potential path of the hurricane. Forecasters say Dorian, which had top sustained winds of 145 mph on Saturday morning, will hover along Florida’s east coast Tuesday and Wednesday.\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nFlorida Governor Ron DeSantis warned residents not to let their guard down.\n\n“Looking at these forecasts, a bump in one direction or the other could have really significant ramifications in terms of impact. If it bumps further east, that obviously is positive. If it bumps just a little west, than you’re looking at really, really significant impacts,” Mr DeSantis said at a briefing.\n\nHe added that even if Dorian did not make landfall in Florida, the state could still be affected by a “really significant storm surge” as the cyclone heads north along the East Coast.\n\nMr Trump has declared a state of emergency in Florida and authorised the Federal Emergency Management Agency to coordinate disaster-relief efforts. He told reporters that “Mar-a-Lago can handle itself” and that he was more worried about Florida generally.\n\nAs Dorian closed in, Labour Day weekend plans were upended nationwide. Major airlines began allowing travellers to change their reservations without fees. The big cruise lines began rerouting their ships. Meanwhile, Disney World and Orlando’s other resorts found themselves in the storm’s projected path.\n\nAdditional reporting by Associated Press", "description": "The Bahamas and the southeastern US are bracing for Hurricane Dorian as it barrels towards the region with an unclear trajectory and chance of “strong winds and life-threatening storm surge”, according to the National Hurricane Centre.", "authors": ["Chris Riotta"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/31/21/hurricane.dorian.jpg"}