{"pub": "axios", "url": "https://tampabay.com/news/gradebook/2019/10/18/florida-education-news-teacher-pay-raises-hb-7069-lawsuit-and-floridas-latest-education-governor", "downloaded_at": "2019-10-27 00:19:47.071315+00:00", "title": "Florida education news: Teacher pay raises, HB 7069 lawsuit and Florida’s latest ‘education governor’", "language": "en", "text": "TEACHER PAY: The Florida House begins its discussions on Gov. Ron DeSantis’ proposal to put $603 million into teacher salaries, to boost the minimum pay to $47,500. Members say they like the idea, but wonder where the money will come from to cover the cost. More from the Orlando Sentinel.\n\nCONTRACT TALKS: The United School Employees of Pasco rejects the school district’s proposal to have middle and high school teachers teach an extra period each day so that all district workers can get a bigger raise. The union makes a counter economic proposal instead.\n\nCONSOLIDATION: The University of South Florida’s president unveils a new campus consolidation plan that offers more autonomy to the satellite campuses in St. Petersburg and Sarasota.\n\nSTORM’S PATH: Santa Rosa and Escambia county schools cancel after-school activities as anticipated Tropical Storm Nestor approaches, the Pensacola News Journal reports. Area school districts will remain open for classes, though, the Northwest Florida Daily News reports.\n\n‘EDUCATION GOVERNOR’: Some Floridians wondered whether Ron DeSantis even had much of an education agenda as he ran for office. He’s quickly made the issue a signature piece of his tenure, Education Week reports. SCHOOL THREATS: A state appellate court upholds a ruling that a student’s online threats of violence against a school violate Florida law, Law. com reports.\n\nHB 7069 CHALLENGE: Nine Florida school districts ask the state Supreme Court to consider their constitutional challenge to the 2017 law that created new types of charter schools and directed some local tax money to them, the News Service of Florida reports. Read the districts’ brief to the court for more details.\n\nMEDICAL MARIJUANA: The Lee County school district makes minor adjustments to its medical marijuana usage policy, allowing parents to administer it on campus, the Fort Myers News-Press reports.\n\nSTANDARDS REVIEW: About 70 people attend a session in Collier County to express their views on proposed new academic standards, the Naples Daily News reports.\n\nREADING WITH DOGS: Some Polk County struggling readers get some support from dogs, the Ledger reports.\n\nCAMPAIGN TRAIL: A Manatee County education advocate is inspired to run for School Board after the state Education Practices Commission rejects a settlement for superintendent Cynthia Saunders, who was accused of doctoring graduation rates, the Herald-Tribune reports.\n\nNEXT STEPS: Sarasota County School Board members ponder how to proceed in the wake of a damning investigation report against two of their top district administrators, the Herald-Tribune reports.\n\nIN COURT: Former employees of a Manatee County charter school recently taken over by the school district sue for unpaid wages, the Herald-Tribune reports.\n\nBAD ACTS: A Volusia County teacher is arrested on charges of having sex with a minor student, the Daytona Beach News-Journal reports.\n\nICYMI: Yesterday’s Florida education news roundup", "description": "A roundup of stories from around the state.", "authors": ["Jeffrey S. Solochek", "Education Reporter"], "top_image": "https://www.tampabay.com/resizer/xxCkzYn9E8tnA5d3izYL4Gcvgfc=/800x450/smart/arc-anglerfish-arc2-prod-tbt.s3.amazonaws.com/public/KCYSWKGIWUI6TIRQPAY4DVT77I.jpg", "published_at": "2019-10-18"}