{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7546977/FA-West-Ham-open-investigation-reports-fans-throwing-BOTTLES-Jordan-Ayew.html", "downloaded_at": "2019-10-07 23:35:36.573068+00:00", "title": "FA and West Ham open investigation after reports of fans throwing BOTTLES at Jordan Ayew", "language": "en", "text": "The FA and West Ham are investigating reports that objects – including a bottle – were thrown at Crystal Palace striker Jordan Ayew after his late winner in the two sides’ Premier League clash on Saturday.\n\nAyew scored with three minutes to go to secure Palace a 2-1 win at the London Stadium.\n\nAfter the goal was awarded by VAR, the Crystal Palace striker celebrated in front of West Ham supporters at which point objects were allegedly thrown his way.\n\nJordan Ayew (C) after his goal won the game for Crystal Palace at the London Stadium\n\nBoth West Ham and the FA confirmed on Monday that they are looking into the incident, which could land any guilty supporters a lifetime ban from the London Stadium.\n\nIf a group of individuals are implicated, West Ham could face an FA charge for failing to control their supporters, at which point the matter would be referred to an independent regulatory commission.\n\nWest Ham are also investigating disorder among Palace’s travelling supporters after a flare was thrown towards the pitch during the London derby on Saturday night.\n\nFollowing the game, Ayew denied trying to taunt opposition fans with his celebration\n\nSpeaking after the game, Ayew claimed he wasn't hit by anything as he celebrated, insisting: 'I didn't even know about any bottles.’\n\nThe striker said he was not taunting West Ham fans by celebrating in front of them. Rather he only headed towards loved ones in the stands.\n\n'My family was up at the box. They were there and I wanted to celebrate my goal in their direction,' he said.", "description": "Both West Ham and the FA confirmed on Monday that they are looking into the incident, which could land any guilty supporters a lifetime ban from the London Stadium - Ayew had scored a late winner.", "authors": ["Daniel Matthews For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/16/19402470-0-image-a-10_1570462143058.jpg", "published_at": "2019-10-07"}