{"pub": "nytimes", "url": "https://nytimes.com/2019/09/23/opinion/doctor-scientist-medical-research.html", "downloaded_at": "2019-09-23 17:22:29.163741+00:00", "title": "Opinion | We Need More Doctors Who Are Scientists", "language": "en", "text": "About a decade from now, public health statistics will begin to show a substantial decrease in cervical cancer in the United States and other developed countries. That’s because in 2006 , young people began receiving vaccines against a sexually transmitted virus, HPV, that causes cervical cancer. By preventing HPV infections today, those vaccines have the potential to avert hundreds of thousands of cervical cancer cases.\n\nThe HPV vaccine exists because Dr. Douglas Lowy, a physician, and his research collaborator Dr. John Schiller recognized the potential for it after more than a decade studying the family of infectious agents to which HPV belongs .\n\nUnfortunately, Dr. Lowy’s career transition from stethoscope to microscope might not be as feasible today as it was a few decades ago. The number of physicians able to engage in scientific research either alongside a medical career or after medical training has waned greatly. Physician education in medical school has shifted away from basic science. In addition, federal funding has declined. After adjusting for inflation, the 2013 N.I.H. budget was 21.9 percent below its 2003 level. These and other trends have driven the proportion of medical doctors engaged in scientific research to a paltry 1.5 percent of the physician work force .\n\nTime and again, physician-scientists have changed the history of medicine by identifying a problem in the clinic and taking to the lab to address it. Alexander Fleming watched men die of sepsis during World War I while serving in the Royal Army Medical Corps, then returned home to create penicillin. Sidney Farber, a young physician at Children’s Hospital in Boston, committed himself to finding treatments for childhood leukemia, and laid the foundation for modern cancer chemotherapy.", "description": "It’s in everyone’s benefit if physicians participate in research.", "authors": ["Mukesh K. Jain", "Tadataka Yamada", "Robert Lefkowitz"], "top_image": "https://static01.nyt.com/images/2019/09/19/opinion/19Jain/19Jain-facebookJumbo.jpg", "published_at": "2019-09-23"}