{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/09/22/trumps-ukraine-gate-extortion", "downloaded_at": "2019-09-22 23:11:01.501481+00:00", "title": "This may be the worst Trump scandal yet", "language": "en", "text": "\n\nPresident Trump on the South Lawn of the White House on Sept. 16. (Jabin Botsford/The Washington Post)\n\nColumnist\n\nA mob enforcer doesn’t have to say “pay up, or we will destroy your store” to be guilty of extortion. The message is conveyed clearly enough if he says “nice store, shame if anything happened to it” combined with the storekeeper’s knowledge of what the mafia has done to those who didn’t pay up.\n\nLikewise, President Trump did not have to say to Ukrainian President Volodymyr Zelensky, “Accuse Joe Biden of corruption, or you’ll never see any more aid from the United States.” It was sufficient that, according to the Wall Street Journal, in a July 25 call, Trump badgered Zelensky eight times to investigate Biden, before also withholding $250 million in military aid. The Ukrainians got the message whether the quid pro quo was explicitly laid out. As a Ukrainian official told the Daily Beast, “Clearly, Trump is now looking for kompromat to discredit his opponent Biden, to take revenge for his friend Paul Manafort, who is serving seven years in prison.”\n\nWe don’t yet know the full details because of White House stonewalling, but from what we already know, this may be the most shocking revelation of wrongdoing by Trump since he fired FBI Director James B. Comey on May 9, 2017, (by his own admission) to squelch the investigation of his Russia ties. In 2016, candidate Trump implored a foreign power to interfere in the U.S. election on his behalf (“Russia, if you’re listening…”). In 2019, Trump appeared to use the full power of his office to extort a foreign leader to intervene in the next U.S. election on his behalf. The latter is far more egregious than the former. It is hard to imagine a more glaring example of a “high crime and misdemeanor.”\n\nIf there were any justice in the world, this would mark a turning point where Democrats find the courage to impeach and Republicans find the decency to stop defending the indefensible. Instead, so far we are getting a rerun of previous scandals characterized by Trump’s brazenness, Republicans’ servility and Democrats’ pusillanimity.\n\nTrump effectively admitted on Sunday that he told Zelensky to investigate the Democratic front-runner. But he argued, with typical illogic, that the scandal is an invention of the “LameStream Media.” He accused the whistleblower of spying on him and claims to be a victim of the “Demented Deep State” — even though the inspector general who found the allegations credible and urgent is himself a Trump appointee. Trump then doubled down on the spurious accusations of corruption against Biden, which have been reviewed and refuted by Ukrainian authorities and independent journalists, thereby using this as another opportunity to put the smears into public circulation.\n\nTrump’s consigliere, Rudolph W. Giuliani, has the gall to compare Biden to Vice President Spiro Agnew, who resigned after being accused of bribery, extortion and tax evasion. Like Joseph McCarthy’s “secret list” of communists in the State Department, Giuliani insists he has documentation for his lies but will not release it. Both Trump and Giuliani know that the utter falsity of their slanders doesn’t matter: As long as they say it, some people will believe it, and others will shrug in frustration and say they don’t know what to believe.\n\nTrump’s sleazy lies are faithfully amplified by his lickspittle surrogates in the Cabinet, including Treasury Secretary Steven Mnuchin and Secretary of State Mike Pompeo, and in Congress, such as Sen. Josh Hawley (R-Mo.) and Rep. Jim Jordan (R-Ohio).\n\nThen there is the right-wing media machine. As Media Matters for America summarized, Fox News has alternatively ignored Ukraine-gate, denounced it as “pure nonsense,” claimed it was an attempt to distract from Trump’s stellar record, attacked the whistleblower as a “deep state … punk” and even praised Trump’s phone call with Zelensky as an example of the president’s brilliant negotiating style.\n\nUnsurprisingly, the dumbest spin of all came from Trump’s de facto minister of propaganda, Sean Hannity, who suggested that Trump’s actions paled in comparison to President Barack Obama, who was caught on an open mic in 2012 telling Russian President Dmitry Medvedev that he would have more “flexibility” to make deals after the election. Yes, this would be an exact analogue to what Trump did — if Obama had said, “I’ll show more flexibility if you give me some dirt on Mitt Romney.” But he didn’t.\n\nTo think that Republicans bitterly criticized Obama for having supposedly betrayed the American people. Now most of them (Sen. Mitt Romney of Utah is an honorable exception) have fallen strategically silent when it’s imperative to stand up for the rule of law against the most corrupt president in our history — Richard M. Nixon and Warren Harding included.\n\nAs long as Democrats do not proceed with impeachment — and perhaps even if they do — Trump has made clear that he will continue his all-out assault on the Constitution. And Republicans — who congratulate themselves on their alleged devotion to the Constitution — will not do anything about it except to cheer him on.\n\nRead more:\n\nGeorge T. Conway III and Neal Katyal: Trump has done plenty to warrant impeachment. But the Ukraine allegations are over the top.\n\nThe Post’s View: What did Trump tell Ukraine’s president?\n\nAnne Applebaum: Welcome, Americans, to the Ukrainian swamp\n\nGreg Sargent: As whistleblower scandal deepens, Trump bets on the coverup working\n\nMax Boot: If Trump extorted a foreign leader for political gain, it’s impeachment time", "description": "If there were any justice in the world, Ukrainegate would mark a turning point.", "authors": ["Max Boot", "Columnist Covering National Security", "September At Pm", "A Post Columnist", "Is The Jeane J. Kirkpatrick Senior Fellow For National Security Studies At The Council On Foreign Relations", "A Global Affairs Analyst For Cnn. He Is The Author Of", "The Road Not Taken", "Edward Lansdale", "The American Tragedy In Vietnam", "A Finalist For The Pulitzer Prize In Biography."], "top_image": "https://www.washingtonpost.com/resizer/KD-h24EqZYLaarVJYBOWlMrliGw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YOWKM7W4CYI6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-22"}