{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/10/WS5d9ee2c1a310cf3e3556fbc9.html", "downloaded_at": "2019-10-10 08:34:25.647306+00:00", "title": "Internet, tech leaders top China's rich list", "language": "en", "text": "By He Wei in Shanghai | chinadaily.com.cn | Updated: 2019-10-10 15:50\n\nJack Ma, founder of Alibaba Group. [Photo/VCG]\n\nInternet and technology are accelerating wealth accumulation among the country's richest individuals, according to the latest Hurun China Rich List published on Thursday.\n\nJack Ma, who just resigned as chairman of Alibaba Group, retained the top spot of richest man in China for the third time, with wealth of $39 billion.\n\nHe was closely followed by the $37 billion in wealth held by Pony Ma (not related to Jack), chairman and CEO of another internet behemoth Tencent Holdings.\n\nPony replaced Xu Jiayin, chairman of property conglomerate Evergrande Group, who came in third with $30 billion.\n\n\"The China Rich List is now looking like a two-horse race,\" said Rupert Hoogewerf, chairman and chief researcher of Hurun Report. The surname \"Ma\" also means \"horse\" in Chinese.\n\nThe list, entering its 21st year, designated a wealth cut-off point of 2 billion yuan ($290 million). A total of 1,819 individuals made the list, a 4 percent decline from last year's 1,893.\n\nNew entrants into top 10 include Colin Huang Zheng, who founded the high-flying e-commerce giant Pinduoduo, poised to challenge established players from Alibaba to JD. He also became the first self-made entrepreneur born in the 1980s to reach the seventh spot with $19 billion.\n\n\"Colin Huang has created a world first, making $20 billion since founding Pinduoduo just four years ago. Nobody in the world has ever made that much from a standing start,\" said Hoogewerf.\n\nMeanwhile, Robin Li Yanhong and Melissa Ma Dongmin of Baidu have had a bad year, losing $7.7 billion or 43 percent to drop them 25 places to 34. Huawei founder Ren Zhengfei, 75, grew 24 percent to $3 billion, up 36 spots to 162.\n\nBesides, unicorns contributed 52 individuals this year. They were led in the AI sector by Tang Xiaoou of facial-recognition platform SenseTime, in robotics by Wang Tao of drone-maker DJI, in blockchain by Zhan Ketuan of bitcoin miner Bitmain, in the sharing economy by Cheng Wei of Didi, and in e-vehicles by He Xiaopeng of Xpeng Motors.\n\nAlso, the list featured 22 shareholders from 17 companies listed on the newly-founded STAR Board, an equivalent to a Nasdaq-style board for tech companies.\n\n\"The speed of wealth creation in China is quite phenomenal,\" Hoogewerf noted.\n\nIT has surpassed investments to become the third-largest source of wealth for entrepreneurs on the list. Manufacturing remained the No 1 source, but the proportion has fallen from 26.1 percent last year to 24.5 percent. Real estate, accounting for 14.8 percent, remained second.\n\nThe average age of the richest group stood at 54, same as last year. In terms of geographical location, Beijing has the highest concentration, or 16 percent, of all rich individuals on the list. Shenzhen took the second place to stay ahead of Shanghai, in third, followed by Hangzhou, Guangzhou and Hong Kong.", "description": "Internet and technology are accelerating wealth accumulation among the country's richest individuals, according to the latest Hurun China Rich List published on Thursday.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/10/5d9ee2c1a310cf3e97a07be5.jpeg", "published_at": "2019-10-10"}