{"pub": "rt", "url": "https://rt.com/sport/471379-conor-mcgregor-moscow-trip-khabib", "downloaded_at": "2019-10-20 23:22:03.239205+00:00", "title": "Conor McGregor ‘set for Moscow visit’ after Khabib feud reignites", "language": "en", "text": "Conor McGregor is set to visit Moscow just days after the Irish MMA star's feud with Russian UFC lightweight champion Khabib Nurmagomedov spectacularly reignited.\n\nMcGregor lashed out on social media after UFC boss Dana White said that the Irishman “wasn’t the man anymore,” and that undefeated Russian ruler Nurmagomedov was “calling the shots” when it came to future match-ups.\n\nMcGregor’s response was to belittle the recent UFC 242 showcase in Abu Dhabi – an event based around Nurmagomedov, and where he defended his lightweight title against Dustin Poirier.\n\nAlso on rt.com Conor McGregor fumes after UFC boss Dana White says ‘Khabib’s the man now’\n\nThe outburst from ‘The Notorious’ sparked an ugly social media exchange during which Nurmagomedov labelled his rival “an alcoholic” and “a rapist,” while McGregor called the Russian “a pussy” and vowed to “see you in Moscow.”\n\nREAD MORE: Khabib brands McGregor 'alcoholic' & 'rapist,' Irishman labels UFC champ 'a p*ssy' in ugly war of words\n\nIntriguingly, McGregor also shared an image of himself standing outside what appeared to be a Russian visa center, hinting at a potential impending visit to Nurmagomedov’s homeland.\n\nAnd various sources have now told RT Sport that McGregor is set to arrive in the Russian capital as early as next week.\n\nThe visit by ‘The Notorious’ is likely to focus primarily on the promotion of his whiskey brand, Proper No. Twelve, which recently launched in Russia.\n\nHowever, the timing makes the trip all the more interesting, coming as it does in the wake of the revived social media hostilities with Nurmagomedov.\n\nREAD MORE: ‘Let’s go Russia!’ Conor McGregor grapples with local language as he launches whiskey in Khabib’s homeland (VIDEO)\n\nThe Russian recently said McGregor needed to “get in line and stop hitting elderly people” if he wanted any chance of a rematch of the pair’s blockbuster 2018 Las Vegas fight, and that longtime challenger Tony Ferguson was a more deserving next opponent.\n\nMcGregor has visited Moscow before, famously being pictured with Russian President Vladimir Putin at the World Cup final in the summer of 2018. The Irishman used that meeting to goad Nurmagomedov in the run-up to their fight in October of that year.\n\nAlso on rt.com ‘Are you disrespecting Putin!?’ - Conor goads Khabib over WC final pic with Russian President\n\nAfter Nurmagomedov’s victory over Poirier last month, McGregor implored UFC bosses to “book my rematch in Moscow.”\n\nThe Dagestani fighter’s father and trainer, Abdulmanap, has said on several occasions that the Russian capital is “waiting” for McGregor, while 'The Eagle' himself has not completely dismissed the possibility of a rematch at some point, if only for the financial gain it would bring.\n\nGiven the continuingly toxic mood between the pair, McGregor could well use a Russian visit to aim further barbs at Nurmagomedov, only this time from his home soil.\n\nHow Nurmagomedov responds to McGregor's visit – should it happen – remains to be seen, although it’s already clear that things were far from settled between the pair when the Russian choked out McGregor in the fourth round in Las Vegas 12 months ago.\n\nThis is a saga that is set to roll on.", "description": "Conor McGregor is set to visit Moscow just days after the Irish MMA star's feud with Russian UFC lightweight champion Khabib Nurmagomedov spectacularly reignited.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5daccb3e2030274dc177c6ba.jpg", "published_at": "2019-10-20"}