{"pub": "abcnews", "url": "https://abcnews.go.com/Business/wework-board-members-reportedly-ceo-adam-neumann-step/story?id=65798332", "downloaded_at": "2019-09-23 17:21:45.020000+00:00", "title": "WeWork board members reportedly want CEO Adam Neumann to step down", "language": "en", "text": "A handful of board members at the coworking startup WeWork are seeking to push Adam Neumann to step down as CEO, according to reports.\n\nCiting people familiar with the matter, The Wall Street Journal was the first to report on Sunday that among those hoping to oust Neumann as CEO are officials linked to the SoftBank Group -- the biggest investors in WeWork. The report added that there is also a proposal to keep Neumann in the company in a non-executive position.\n\nWeWork declined ABC News' request for comment Monday. The Softbank Group did not immediately respond to a request for comment.\n\nWeWork was co-founded by Neumann in New York City in 2010 and provides freelancers, startups and others with rentable office space they can access through an app and site. It boasts 834 locations, currently open or upcoming, spread out across 125 cities, according to its website.\n\nDrew Angerer/Getty Images\n\nThis news comes approximately a week after the company announced it was delaying its initial public offering until the end of 2019.\n\nWhile trendy and offering amenities such as stocked kitchens, pet-friendly locations and \"art-infused buildings,\" some critics have questioned the company's actual value as it works to go public.\n\nAs a private company, WeWork was recently valued at around $47 billion, according to the Associated Press.\n\nThat figure has come under scrutiny from many, including entrepreneur and 2020 presidential candidate Andrew Yang, who tweeted that the startup's valuation is \"utterly ridiculous.\"\n\nRep. Alexandria Ocasio-Cortez, D-NY, cited WeWork's transition to the public market as an example of a potential risk for everyday investors at a hearing earlier this month of the U.S. House Committee on Financial Services’ Subcommittee on Investor Protection, Entrepreneurship, and Capital Markets.\n\n\"If you invested in WeWork thinking that it had a valuation of $47 billion, you're getting fleeced,\" she said.", "description": "Reports are that some board members are pushing for the CEO to step down a week after the startup delayed its IPO.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Business/Adam-Neumann-gty-ps-190923_hpMain_16x9_992.jpg", "published_at": "2019-09-23"}