{"pub": "cnn", "url": "https://cnn.com/2019/10/14/media/donald-trump-video-new-york-times/index.html", "downloaded_at": "2019-10-14 05:15:52.159294+00:00", "title": "CNN and White House reporters say Trump should denounce vile anti-media video", "language": "en", "text": "(CNN Business) Call someone an \"enemy\" over and over again, and you have some responsibility for what happens to them.\n\nPresident Trump is responsible for a climate that is so hateful, so hostile toward journalists that it spawns videos like this one.\n\n\"A video depicting a macabre scene of a fake President Trump shooting, stabbing and brutally assaulting members of the news media and his political opponents was shown at a conference for his supporters at his Miami resort last week,\" the NYT's Michael S. Schmidt and Maggie Haberman reported Sunday night.\n\nThe \"meme\" is despicable, and the people who saw it at Doral hopefully know that. The hosts of the conference, American Priority, say they reject \"all political violence,\" and \"this matter is under review.\"\n\nBut this is about so much more than a single video. It is about what happens when you plant seeds of hatred and division. It is about what happens when you give your supporters permission to hate and dehumanize people the president views as opponents.\n\nThis isn't the first, and won't be the last\n\nABC's Jonathan Karl, the president of the White House Correspondents' Association, called the video \"Vile. And dangerous.\"\n\nHe issued the following statement: \"The WHCA is horrified by a video reportedly shown over the weekend at a political conference organized by the President's supporters at the Trump National Doral in Miami. All Americans should condemn this depiction of violence directed toward journalists and the President's political opponents. We have previously told the President his rhetoric could incite violence. Now we call on him and everybody associated with this conference to denounce this video and affirm that violence has no place in our society.\"\n\nYes, but... As The Daily Beast's Kelly Weill noted on Twitter, \"the thing about the video is that clips from that genre are common as hell/have already saturated pro-trump spaces online. so for all the rightfully angry mainstream coverage it'll get now, it's a 'yeah, no s***' deal from most trump types who are already inured to all this.\"\n\nIndeed, this rhetorical targeting has been going on for years. Sunday's NYT story is just a shocking reminder.\n\n\"Some of the targets in this video were sent bombs by a Trump superfan last year and the president responded by attacking the press,\" NBC's Benjy Sarlin wrote. \"Saudi Arabia killed a Washington Post columnist and the W.H. stuck by their side. His backers get the text and subtext perfectly clearly.\"\n\nCNN says Trump needs to denounce the video 'immediately'\n\n\"Sadly, this is not the first time that supporters of the president have promoted violence against the media in a video they apparently find entertaining -- but it is by far and away the worst,\" CNN said in a Sunday night statement.\n\n\"The images depicted are vile and horrific,\" CNN said. \"The president and his family, the White House, and the Trump campaign need to denounce it immediately in the strongest possible terms. Anything less equates to a tacit endorsement of violence and should not be tolerated by anyone.\"\n\nI asked W.H. press secretary Stephanie Grisham for comment at 10pm ET, and did not hear back as of 11:45pm.\n\nBut the Trump campaign did tell the NYT that the video \"was not produced by the campaign, and we do not condone violence.\"\n\n\"I'm so sad for all of us\"\n\nNYMag's Washington correspondent Olivia Nuzzi tweeted : \"How disconnected from humanity must you be to find humor in a depiction of a mass shooting of journalists inside a church — knowing, surely, that Americans have been slaughtered in churches & newsrooms, that it's not a fantasy for the families that those shootings made incomplete?\"\n\nThere was a shooting at a church in New Hampshire on Saturday.\n\n\"I'm so sad for all of us,\" Nuzzi added. \"For the people who think it's a joke. For the people who have been and will be hurt by those who think it's a joke. For the people who will be hurt indirectly, just by living in an increasingly polarized and hateful country.\"\n\n\"Blood on the floor\"", "description": "Call someone an \"enemy\" over and over again, and you have some responsibility for what happens to them.", "authors": ["Analysis Brian Stelter", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191014003520-01-trump-1012-restricted-super-tease.jpg", "published_at": "2019-10-14"}