{"pub": "yahoo", "url": "https://finance.yahoo.com/news/starbucks-let-spend-bitcoin-coffee-165333043.html", "downloaded_at": "2019-10-30 09:05:22.488299+00:00", "title": "Starbucks will let you spend Bitcoin on coffee in Bakkt’s app by 2020", "language": "en", "text": "\n\n\n\nBitcoin futures exchange Bakkt today announced that it will be launching a consumer app for cryptocurrency purchases in 2020. Starbucks will be its first launch partner, in keeping with the partnership it unveiled when Bakkt was first announced. App users will be able to spend their bitcoins on coffee, via the app—although they won’t be making direct Bitcoin payments from the person to the store.\n\n“We’re now focused on the development of the consumer app and merchant portal, as well as testing with our first launch partner, Starbucks, which we expect in the first half of next year,” Bakkt chief product officer Mike Blandina said, in the blog post.\n\nBakkt was first unveiled in August, 2018, with partners Starbucks and Microsoft on board. Its plan is to create an open ecosystem for the crypto industry, providing a secure place for both consumers and institutions to store, send and receive bitcoins.\n\nSo far—at least on its futures exchange—Bakkt has only focused on just one cryptocurrency: Bitcoin. But with the upcoming consumer app, it appears that it will branch out to other coins.\n\n“A key feature of the model we’ve designed is to support a superset of digital assets, including cryptocurrencies, as seamlessly as investors transact in stocks in a retail brokerage account,” Blandina added.\n\nStarbucks owns almost 40 percent of the U.S. coffee market and has nearly 30,000 stores worldwide. Bakkt’s pilot program hopes to tap into this market segment, bringing more people into the cryptocurrency space.\n\nWhile users of Bakkt’s consumer app will be able to spend their bitcoins, they won’t be making direct Bitcoin payments to Starbucks stores. When the platform was first announced, Starbucks quickly cleared this up, telling Quartz, “It is important to clarify that we are not accepting digital assets at Starbucks. Rather the exchange will convert digital assets like Bitcoin into US dollars, which can be used at Starbucks.”\n\nBut from the user’s perspective, it gives them a way to seamlessly spend their bitcoins, even if it’s not the cypherpunk’s dream. And that's a start.\n\n\n\n", "description": "Bakkt’s upcoming consumer app for making Bitcoin payments will go live in 2020 with Starbucks as its first launch partner.", "authors": ["Decrypt Staff"], "top_image": "https://s.yimg.com/uu/api/res/1.2/JurnkEsqwXYMcvr2kn72Kw--~B/aD00NzA7dz05MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/decrypt_251/1ae9f3618096ef131e1633b6219ff7cd", "published_at": "2019-10-28"}