{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/sunday-mirror-demands-government-coughs-20468648", "downloaded_at": "2019-10-05 22:52:35.682552+00:00", "title": "Sunday Mirror demands Government coughs up to end GP crisis caused by Tory cuts", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThe Sunday Mirror is launching a campaign to end the crisis in doctors’ surgeries fighting for survival, seriously wounded by savage Tory cuts.\n\nThe Government which has brutally attacked them over the years stands idly by as their life blood – the vital supply of exhausted GPs we all need – drains away.\n\nAppointment waiting times have hit a record high as more and more GPs quit, broken by heavy workloads.\n\nWe want to save our surgeries by:\n\nBOOSTING the number of trainee GPs by at least 5,000 a year to replace the 1,600 already axed by the Tories – and to cover a looming shortfall of 7,000 in the next four years.\n\nCREATING nearly 30 million extra appointments to shrink growing surgery waiting times for everyone which can be as long as TWO MONTHS – especially for patients suffering serious conditions, and\n\nENDING the flood of experienced GPs who are leaving the NHS in droves by improving working conditions wrecked by Tory cuts.\n\nAn annual survey of 901 GPs across the UK has revealed the average waiting time for routine appointments is now almost 15 DAYS – the first time it has gone over a fortnight – with some patients waiting months for treatment.\n\n(Image: Getty)\n\nThat’s caused by a combination of a booming population and far fewer doctors left to cope with it, with GPs blasting the pressure they are under as “ridiculous”.\n\nExperts believe the 1,600 lost through Tory cuts will balloon to a very concerning 7,000 by 2024.\n\nAs overwhelmed doctors quit surgeries, more and more patients are coming through the door.\n\nThe average number seen by each GP rose from 2,000 to 2,160 between 2015 and 2018, an increase of eight per cent over three years.\n\nGPs like Dr Bob Gill, who runs a surgery in Bexley, South East London, know only too well how the Government’s attempt to treat the NHS like a private company is forcing up patient waiting times.\n\n(Image: Getty)\n\nHe co-owned his practice with a German-trained doctor for 10 years – but he quit two years ago.\n\n“The ridiculous pressures we are working under were too much and he moved back to his old country,” said Dr Gill. “Now he has half the workload he had here for the same amount of pay.”\n\nDr Gill now looks after the 5,000 patients which he shared with his German colleague, helped by locum doctors.\n\nHe sees all the patients with long term chronic conditions because it saves time as he knows their individual needs without having to wade through their notes.\n\nIt’s hard work, but he prides himself on being able to see half of patients wanting an appointment on the same day.\n\nDr Gill said: “I am well organised but many practices are struggling because they are burdened by the NHS’s internal market. We all are.”\n\nHe added that hospitals – desperate for income – were discharging patients who need to stay in the hospital system back to GPs so they can boost their income.\n\nDr Richard Vautrey, BMA GP committee chair, said: “Recruitment efforts have been significant over recent years, but despite these efforts, we are still desperately short of GPs across the UK.\n\n“Despite their best efforts, surgeries are struggling to fill vacancies making it hard to cope with growing patient demand.\n\n“This leaves teams demoralised, and communities frustrated as they wait longer to get the care they need.\n\n(Image: Adam Gerrard/Daily Mirror)\n\n\"It’s encouraging that more junior doctors than ever before are choosing to specialise in general practice, but it’s important to realise they cannot be trained overnight.\n\n“More work needs to be done to retain existing, hard-working GPs while we wait for reinforcement.\n\n“The BMA has long called for more resources to encourage GPs to stay. So every effort must be made to ensure general practice, and patient care, is protected now and in the future.”\n\nThe Labour Party is already committed to ending the crisis that is only going to get worse.\n\nThe party took a big step at its party conference by pledging to launch a recruitment drive, aiming to restore the 1,600 axed local doctors by introducing thousands more GP training places every year.\n\n(Image: Getty)\n\nShadow Health Secretary Jon Ashworth said: “Years of Tory cuts have been piling the pressure on our exhausted GPs and patients have been left waiting longer and longer just to see a doctor.\n\n“Fixing the crisis in the NHS starts with training more doctors and nurses and making sure our NHS has all of the cash it needs.\n\n“We will expand GP training places to 5,000 a year helping deliver 27 million extra GP appointments there for you and your family when needed.”\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nWest Yorkshire Labour MP Yvette Cooper said: “People are waiting far too long for GP appointments.\n\n“One of my constituents was told he had to wait eight weeks for an appointment even though he had possible cancer symptoms. It’s not good enough.\n\n“Our NHS is vital and only Labour will stand up for the NHS”.\n\nOAP was left deaf for three months after waiting list shock at surgery\n\n(Image: Internet Uknown)\n\nA pensioner threatened to sue his GP after learning he faced a 12-week wait for treatment that left him almost deaf.\n\nGraham Jones, 76, says he has needed ear irrigation for over a decade to help with a hearing problem but was left stunned when he was told there was a waiting list.\n\nThe retired councillor said: “It was horrendous. I had to try to lip-read. My hearing aid wouldn’t even work.\n\n“It made me really angry. Over the last 10 years I’ve just made an appointment, gone in and it’s been done. Suddenly I was told there was a three-month waiting list.” At one point Mr Jones “seriously considered” suing the practice if he had had an accident as a result of his deafness.\n\nHe said government funding to his local practice in North Norfolk had been cut in the past five years, as patient numbers rose after new homes were built. Mr Jones said his surgery had been left more than £400,000 short of the funding it needed.\n\n“I know two ladies in their 80s who have had to pay £80 to have their ears irrigated privately. I got an appointment after three months. I refused to pay – I believe strongly in the NHS.”\n\nAfter Mr Jones complained, his surgery laid bare the pressure they were under.\n\nTheir astonishing response to him said: “We have to balance the staff we have, the hours they work, their skills, our available space and the overall demand for all services we offer.\n\n“We appreciate ear irrigation is very important for you, but the same applies in respect of anti-coagulation, phlebotomy, post-operative care, complex drug monitoring, taking and interpreting ECGs, tending to minor injuries, monitoring patients with eating disorders, PSA monitoring, diabetes and COPD care, supporting patients with mental health problems, dementia identification, cancer care, chronic kidney disease, epilepsy monitoring, fitting and removing contraceptive implants to name but a few – all in respect of many of our other patients.”", "description": "EXCLUSIVE: New figures reveal some patients are waiting fifteen days for an appointment - the first time it has gone over a fortnight", "authors": ["Alan Selby", "Image", "Getty", "Adam Gerrard Daily Mirror", "Internet Uknown"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20468216.ece/ALTERNATES/s1200/0_JS190355918.jpg", "published_at": "2019-10-05"}