{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/08/chaplains-complaints-of-stench-created-by-homeless-arose-from-concern", "downloaded_at": "2019-10-09 00:26:21.007305+00:00", "title": "Chaplain's complaints of 'stench' created by homeless 'arose from concern'", "language": "en", "text": "The chaplain to the Speaker of the House of Commons has said that complaints by her in internal emails about the “ongoing stench” created by homeless people sleeping at the underground station near to parliament arose from concern for their safety and that of parliamentary staff.\n\nIt emerged on Tuesday that Rose Hudson-Wilkin, who was announced earlier this year as the new bishop of Dover, had written to parliament’s director of security, Eric Hepburn and the then House of Commons clerk, Sir David Natzler, to raise concerns about the situation at the exits from Westminster tube station.\n\nTelling them that she had been devastated to learn of the deaths of at least two homeless people at the station, she added: “I am also concerned about the ongoing stench, due to it being used as a urinal and the fact that it is absolutely filthy. I physically feel as though I am going to be sick each time I go by.”\n\nIn the correspondence from February, which was released following a Freedom of Information request by the New Statesman, she also expressed concern that the homeless had stacked up bedding at the station, which she said “could be used by some unscrupulous people as a cover up for an explosive device”.\n\nHudson-Wilkin went on to say that she had asked to speak with an official at Transport for London on a number of occasions but had been directed Westminster council.\n\n“I really am beginning to feel unsafe personally and equally for everyone else who uses that exit/entrance,” she added.\n\nIn a statement released to the Guardian via the Diocese of Canterbury, she said: “Every week in my prayers in the chapel, I pray for those who are homeless in our city and those who have died on our streets.\n\n“These comments arose not only out of my concern for the safety and wellbeing of parliamentary staff, but also out of concern for those for whom this is their daily reality. We may find it unpleasant and concerning to walk through the underground station on the way to work or home, but for those who have to live like this – forgotten and overlooked by society – it is so much worse. Nobody should have to live like this.”\n\nShe added that “moving people on” would not solve the issue, which required national and systemic problems being addressed.\n\nThe email to Natzler and Hepburn was sent two months after the death of Gyula Remes, 43, a homeless man whose body was found in an underpass linking Westminster tube station to an entrance leading to the Houses of Parliament.\n\nIn February 2018 the death of Marcos Amaral Gourgel drew widespread media attention after he died in freezing weather at Westminster tube station next parliament.", "description": "Rose Hudson-Wilkin also complained about security risk of Westminster homeless", "authors": ["Ben Quinn"], "top_image": "https://i.guim.co.uk/img/uploads/2019/10/08/3500_(4).jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=840ed6c3a4718d50067a583b782fbad5", "published_at": "2019-10-08"}