{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/21/WS5dacf4b6a310cf3e355718a9.html", "downloaded_at": "2019-10-21 00:19:04.281061+00:00", "title": "Envoy's visit sign of better China-Japan relationship", "language": "en", "text": "By Zhou Yongsheng | China Daily | Updated: 2019-10-21 07:58\n\nSONG CHEN/CHINA DAILY\n\nChina's Vice-President Wang Qishan will attend Japanese Emperor Naruhito's enthronement ceremony on Tuesday, a sign of the great progress that has been made in improving Sino-Japanese ties.\n\nChina and Japan have close connections because of their geographical proximity and historical closeness. Respectively being the world's second-largest and third-largest economies, relations between the two neighboring countries have played an important role in the stability and development of East Asia and the world.\n\nWith the world having entered a new era with great changes, such connections can strengthen regional political and economic coordination, together Beijing and Tokyo should shoulder the responsibility to promote regional development and peace. They should therefore work together to continue improving bilateral ties, increase mutual trust and deepen win-win cooperation. Advancing bilateral ties should be a major task of the two countries in the new era.\n\nBy sending its vice-president to the new Japanese emperor's enthronement, China has made a top-level arrangement to show the importance it attaches to bilateral relations. In 1990, China sent then-vice-premier Wu Xueqian to the enthronement of Emperor Akihito, which helped improve China-Japan relations.\n\nVice-President Wang will attend the ceremony as China's special envoy and will pay a visit to Hokkaido. China is making active efforts for more pragmatic cooperation with clear direction so it is very likely that Wang's visit will highlight an investigation of Japan's economic development that prepares for more targeted China-Japan cooperation in the future.\n\nRelations between Beijing and Tokyo had reached a historic low after decades of ups and downs due to historical disputes. And on Thursday Japan's Prime Minister Shinzo Abe sent a ritual offering to the Yasukuni Shrine, drawing strong criticism from China. It shows that for China, the Japanese government having the right approach to history is crucial if bilateral ties to realize their potential.\n\nBorn and growing up in a post-War Japan has helped Emperor Naruhito establish a peaceful image, not only in Japan but also in China, and his enthronement may offer an opportunity to create a fresh start for Sino-Japan relations in the new era in pursuit of harmonious co-development.\n\nThe United States has been sticking to its unilateralist approach and tariff attacks on many countries, including its allies, in a bid to leverage gains, and this has acted as an impetus for Beijing and Tokyo pursuing greater cooperation.\n\nWashington has added Chinese companies to trade blacklists and raised tariffs several times in an attempt to suppress China's trade and technology development. Japan is handicapped by the US-Japan security alliance, on which it has relied on a lot, in the trade talks with Washington. Compared with what the US obtained from the US-Japan trade pact signed on Oct 7, Japan barely acquired the fruits of the economic interests it is most concerned about. Washington also pressed Tokyo to pay for the US troops in Japan.\n\nCooperation with China can help Japan balance its relations with the US.\n\nThe improvement of Sino-Japanese ties will be of increasing strategic importance for both countries in the long term.\n\nThe author is a professor at and deputy director of Japanese Studies Center, China Foreign Affairs University. The views don't necessarily represent those of China Daily.", "description": "", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/21/5dacf4b6a310cf3e97a22021.jpeg", "published_at": "2019-10-21"}