{"pub": "fox", "url": "https://foxnews.com/science/rare-star-wars-toy-worth-500g", "downloaded_at": "2019-10-24 14:06:15.828609+00:00", "title": "Rare, 'holy grail' Star Wars toy could be worth $500G", "language": "en", "text": "May the force be with the buyer — and their checkbook.\n\nConsidered to be the \"holy grail,\" an extremely rare \"Star Wars\" toy from the 1970s could be worth as much as $500,000 when it goes up for auction next month.\n\nThe \"Boba Fett J-slot rocket-firing prototype\" was never produced because of safety concerns from the shooting mechanism, SWNS reports. However, between 80 and 100 of them were made for testing, but only 24 of them are believed to have survived, adding to the collectible's scarcity value.\n\nMETAL DETECTOR ENTHUSIAST FINDS 1,000-YEAR-OLD COINS WORTH $60G\n\n\"The design never made it into mass production due to safety concerns about the toy’s rocket-firing mechanism,\" Consignment manager Kelly McClain said in comments obtained by SWNS. \"For this reason, few prototypes ever made it into collector’s hands.\"\n\nThe figure is AFA-85+ NM+ graded, according to the lot's description, meaning it is in \"near mint condition,\" according to The Action Figure Authority.\n\nThe toy was originally made by Kenner, McClain said, adding that “several of the surviving J-slots are in rather rough condition because they’ve undergone rigorous testing procedures that included heating, freezing and more.\"\n\nMcClain said it's clear that by looking at this particular figure, it was \"not put through such harsh testing challenges\" and the only evidence of testing is \"the presence of indexing marks on the underside of the figure’s feet.”\n\nThe prototype, being auctioned by Hake's Auctions on Nov. 7, comes with two letters of authenticity: one from Kenner's Reliability and Safety technician, John Howlson, the toy's original owner; and the other from Tom Tumbusch of Tomart Publications, who bought it from Howlson in the early 1990s.\n\nDISCOVERY OF A LIFETIME: 'FAKE' GOLD COIN WORTH MILLIONS\n\nIn addition to the rare Boba Fett toy, Hake's is selling 400 other lots in the sale, including an Obi-Wan Kenobi and a Darth Vader figure, each estimated to be worth between $75,000 and $100,000.\n\nOther rare Star Wars items in the auction include a Sand People 12-Back pre-production figure and an encapsulated action figure of Bib Fortuna, both estimated to be worth between $10,000 and $75,000 each.\n\nThe existing record for a Star Wars toy is $112,000, sold at auction in July 2019. This toy, also a Boba Fett prototype, was made for the 1980 Star Wars movie \"The Empire Strikes Back,\" according to Penn Live.\n\nCLICK HERE TO GET THE FOX NEWS APP", "description": "Considered to be the \"holy grail,\" an extremely rare \"Star Wars\" toy from the 1970scould be worth as much as $500,000 when it goes up for auction next month.", "authors": ["Chris Ciaccia"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/boba-fett-1.jpg", "published_at": "2019-10-24"}