{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7541137/Rachel-Maddow-fun-voicing-snarky-gossip-maven-Vesper-Fairchild-CWs-Batwoman.html", "downloaded_at": "2019-10-05 23:05:04.229635+00:00", "title": "Rachel Maddow had the 'most fun' voicing snarky gossip maven Vesper Fairchild in The CW's Batwoman", "language": "en", "text": "MSNBC host Rachel Maddow said providing the voice of snarky gossip maven/media personality Vesper Fairchild in The CW's Batwoman was 'one of the most fun things' she's ever done.\n\n'I know no one's going to believe this is true, but it's true,' the 46-year-old liberal political commentator - who boasts 12.4M followers - tweeted Friday.\n\n'I'm \"Vesper Fairchild\" in the new Batwoman TV show that starts this Sunday night on The CW. (My character is soooo not me; turns out playing her is one of the most fun things I've ever done).'\n\n'My character is soooo not me!' MSNBC host Rachel Maddow said providing the voice of snarky gossip maven/media personality Vesper Fairchild in The CW's Batwoman was 'one of the most fun things' she's ever done\n\nMaddow will not physically appear as Vesper (Bruce Wayne's former flame), but rather she just plays the Gossip Girl-style 'sardonic Voice of Gotham' - according to THR.\n\nAustralian action star Ruby Rose stars as DC Comic's first lesbian superhero Batwoman/Kate Kane, Batman/Bruce Wayne's butt-kicking heiress cousin.\n\nCaroline Dries' sapphic superhero series about an androgynous, Gotham City-born masked vigilante also features Dougray Scott, Meagan Tandy, and Rachel Skarsten.\n\nRachel previously appeared as herself in shows like RuPaul's Drag Race, House of Cards, The Jim Gaffigan Show, Alpha House, 30 Rock, and Ugly Betty.\n\nThe 46-year-old liberal political commentator tweeted Friday: 'I'm \"Vesper Fairchild\" in the new Batwoman TV show that starts this Sunday night on The CW'\n\nPremieres this Sunday! Australian action star Ruby Rose stars as DC Comic's first lesbian superhero Batwoman/Kate Kane, Batman/Bruce Wayne's butt-kicking heiress cousin\n\n'Her time is now': Caroline Dries' sapphic superhero series about an androgynous, Gotham City-born masked vigilante also features Dougray Scott, Meagan Tandy, and Rachel Skarsten\n\nIt's hard to believe the three-time Emmy winner has time for another TV gig since she hosts The Rachel Maddow Show weeknights on MSNBC.\n\nOn top of all that, the Cali-born Rhodes Scholar will next bring her eight-city Blowout book tour to Oklahoma's Magic City Books in Tulsa this Saturday night.\n\nOn the personal front, Maddow splits her time between Manhattan and West Cummington, MA; with her partner of 20 years, artist Susan Mikula.\n\nAll with a fractured foot! It's hard to believe Maddow has time for another TV gig since she hosts The Rachel Maddow Show weeknights on MSNBC (pictured September 25)", "description": "The 46-year-old liberal political commentator plays the former flame of Bruce Wayne and the Gossip Girl-style 'sardonic Voice of Gotham'", "authors": ["Cassie Carpenter For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/16/19336210-0-image-a-28_1570289518756.jpg", "published_at": "2019-10-05"}