{"pub": "yahoo", "url": "https://news.yahoo.com/venezuela-faces-opposition-bid-seat-150303888.html", "downloaded_at": "2019-10-18 01:21:35.312686+00:00", "title": "Venezuela wins seat on UN rights body despite opposition", "language": "en", "text": "FILE - In this Sept. 30, 2019, file photo, Venezuela's President Nicolas Maduro speaks during a press conference at the Foreign Ministry in Caracas, Venezuela. The Venezuelan ambassador to Japan says his bank account has become inaccessible in Japan in what he said was apparently a consequence of President Donald Trump’s decision to freeze Venezuelan assets in the United States. The Trump administration has sought to isolate Venezuelan President Nicolas Maduro by prohibiting high-ranking loyalists from entering the U.S. and by freezing U.S. assets of many included in the no-entry list. (AP Photo/Ariana Cubillos, File)\n\nUNITED NATIONS (AP) — Venezuela won a contested election for a seat on the U.N. Human Rights Council on Thursday despite a campaign by over 50 organizations and many countries opposed to Nicolas Maduro's government and its rights record.\n\nThere was scattered applause in the General Assembly chamber when its president announced the results of the voting for two Latin American seats. Brazil topped the ballot with 153 votes, followed by Venezuela with 105 votes and late entry Costa Rica with 96 votes.\n\nVenezuelan Foreign Minister Jorge Arreaza called the vote \"a victory\" that followed \"a fierce and brutal campaign by the United States ... and its subordinate nations.\"\n\nThe Trump administration has recognized opposition leader Juan Guaidó as Venezuela's interim president and U.S. Ambassador Kelly Craft called the placing of Maduro's government on the council \"an embarrassment to the United Nations and a tragedy for the people of Venezuela.\"\n\n\"That one of the world's worst human-rights abusers would be granted a seat on a body that is supposed to defend human rights is utterly appalling,\" Craft said in a statement after the vote.\n\nPhilippe Bolopion, Human Rights Watch's deputy director for global advocacy, called Venezuela's election undeserved and \"a slap in the face to the country's countless victims who've been tortured and murdered by government forces, as well as the millions who have fled largely because of a humanitarian emergency the government unleashed.\"\n\nBrazil's foreign ministry said its re-election to the council marked an \"important victory\" but criticized Venezuela's selection.\n\nVenezuela's election \"shows that there is still a lot to do to create awareness in the international community about the catastrophic state of human rights in that country,\" the ministry said in a statement.\n\nThe 193-member world body elected 14 members to the 47-member Human Rights Council for three-year terms starting Jan. 1. Under its rules, seats are allocated to regions to ensure geographical representation.\n\nIn other contested races, Iraq lost out in the Asian group contest for four seats to Japan, South Korea, Indonesia and the Marshall Islands, and Moldova lost in the Eastern Europe group race for two seats to Armenia and Poland.\n\nThe Africa region had four countries on the ballot —Benin, Libya, Mauritania and Sudan — for four seats. But diplomats said the regional group did a last-minute switch, putting Namibia on the ballot instead of Benin to include a nation from southern Africa, so Namibia, Libya, Mauritania and Sudan were elected.\n\nThere was no competition for the two Western group seats and Germany and the Netherlands were overwhelmingly elected.\n\nThe Geneva-based Human Rights Council can spotlight abuses and has special monitors watching certain countries and issues. It also periodically reviews human rights in every U.N. member country.\n\nCreated in 2006 to replace a commission discredited because of some members' sorry rights records, the new council soon came to face similar criticism.\n\nThe United States left the council partly because it saw the group as a forum for hypocrisy about human rights, though also because Washington says the council is anti-Israel.\n\nCraft, the U.S. ambassador, said Thursday's vote \"provides ironclad proof that the Human Rights Council is broken and reinforces why the United States withdrew.\"\n\nIsraeli Ambassador Danny Danon said in a statement immediately after the results were announced that the \"Human Rights Council continues to abandon human rights and is now in the business of protecting dictators and war crimes.\"\n\n\"In Venezuela, a dictator starves his people, and in Libya there are camps that torture African migrants,\" Danon said.\n\nVenezuelan officials regularly reject any criticism of the country's human rights record.\n\nWhen the U.N.'s high commissioner for human rights, Michelle Bachelet, chronicled cases of torture, sexual abuse and extrajudicial killings in the country, Deputy Foreign Minister William Castillo said her report \"does not reflect the reality in our country.\"\n\nHe called it a \"biased vision\" of Venezuela and demanded it be \"corrected.\"\n\nGuaidó, the head of Venezuela's opposition-controlled congress who seeks to oust Maduro with backing from the U.S. and more than 50 other nations, said the U.N. has been \"tarnished\" by the vote and \"loses credibility\" by validating Maduro.", "description": "Venezuela won a contested election for a seat on the U.N. Human Rights Council on Thursday despite a campaign by over 50 organizations and many countries opposed to Nicolas Maduro's government and its rights record.  There was scattered applause in the General Assembly chamber when its president", "authors": ["Edith M. Lederer"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Mgq43ay1H7VXxv2WePx7Og--~B/aD0yMzM0O3c9MzUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/722cf99ade16fdf8f959f1cd39d43427", "published_at": "2019-10-17"}