{"pub": "yahoo", "url": "https://news.yahoo.com/gabbard-threatens-boycott-debate-alleges-140223733.html", "downloaded_at": "2019-10-10 15:07:51.055580+00:00", "title": "Gabbard Threatens to Boycott Debate, Alleges DNC ‘Rigging Election Again’", "language": "en", "text": "Democratic Presidential Candidate Tulsi Gabbard (D., Hawaii) announced Thursday that she is “seriously considering” a boycott of the upcoming Democratic debate on Oct. 15, alleging that “the DNC and corporate media are trying to hijack the entire election process.”\n\n“They are attempting to replace the roles of voters in the early states, using polling and other arbitrary methods which are not transparent or democratic, and holding so-called debates which are not debates at all but rather commercialized reality television meant to entertain, not inform or enlighten,” Gabbard said in the statement.\n\nGabbard’s campaign, which is currently polling at just over half a percentage point, has focused in recent weeks on grassroot efforts in early primary voting states.\n\n“There are so many of you who I’ve met in Iowa and New Hampshire who have expressed to me how frustrated you are that the DNC and corporate media are essentially trying to usurp your role as voters in choosing who our Democratic nominee will be,” Gabbard says in the announcement, before stating that she will announce her final decision in the coming days.\n\nGabbard qualified for the upcoming debate but missed out on the last one this past month, after reaching the donor threshold but falling two DNC-approved polls short of clearing the public support threshold. Gabbard’s campaign slammed the committee’s decision-making, arguing that the standards were arbitrary and lacked transparency.\n\n“It creates a lack of faith and trust in the process,” Gabbard told Fox News’ Tucker Carlson in August. “… Really what [the voters] see is a small group of really powerful political elites, the establishment making decisions that serve their interests and maintaining that power while the rest of us are left outside. The American people are left behind.”\n\nGabbard was the most-searched candidate after the first and second Democratic debates earlier this year.\n\nMore from National Review", "description": "Democratic Presidential Candidate Tulsi Gabbard (D., Hawaii) announced Thursday that she is “seriously considering” a boycott of the upcoming Democratic debate on Oct. 15, alleging that “the DNC and corporate media are trying to hijack the entire election process.”“They are attempting to replace the", "authors": ["Tobias Hoonhout"], "top_image": "https://s.yimg.com/uu/api/res/1.2/DiRR6jSs92IIZzFQspkEcw--~B/aD01OTc7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/f0dfbdd9e5149003a80836143c3547bb", "published_at": "2019-10-10"}