{"pub": "reuters", "url": "https://in.reuters.com/article/uk-india-kashmir-conflict/india-pakistan-trade-barbs-over-deadly-kashmir-clash-idINKBN1WZ044", "downloaded_at": "2019-10-20 13:26:21.084746+00:00", "title": "India, Pakistan trade barbs over deadly Kashmir clash", "language": "en", "text": "SRINAGAR, India/ISLAMABAD (Reuters) - India and Pakistan blamed one another for cross-border shelling in the disputed Kashmir region which killed and injured soldiers and civilians on both sides and made it one of the deadliest days since New Delhi revoked Kashmir’s special status in August.\n\nIndia said there was heavy shelling by Pakistan across the border in northern Kashmir’s Tangdhar region late on Saturday night, killing two Indian soldiers and one civilian.\n\nA spokesman for the Pakistani Armed Forces said one of its soldiers and three civilians had died and that India had violated the ceasefire.\n\nKashmir has been disputed by the two nuclear-armed neighbours since they both received independence in 1947. The two countries fought two of their three wars over the region.\n\nTensions between the two countries have flared and there has been intermittent cross-border firing since Aug. 5, when New Delhi flooded Indian Kashmir with troops to quell unrest after it revoked the region’s special autonomous status.\n\nIslamabad has warned that changing Kashmir’s status would escalate tensions but India says the withdrawal of special status is an internal affair and is aimed at faster economic development of the territory.\n\nReuters was unable to verify independently the claims made by both sides on the shelling, which marks an escalation from the small-arms fire usually exchanged by the two armies.\n\nThere was an unprovoked ceasefire violation by Pakistan, Indian defence spokesman Colonel Rajesh Kalia said.\n\n“Our troops retaliated strongly, causing heavy damage and casualties to the enemy,” Kalia said.\n\nAn Indian army source said the shelling was cover to help militants enter India because of which a “calibrated escalation of area weapons was undertaken”. The Indian army “retains the right to respond at a time and place of its choosing” if the Pakistani army continues to do this, he said.\n\nIslamabad has summoned the Indian envoy in protest over the shelling and killings, and offered to have diplomats from the U.N. Security Council’s five permanent members, including the United States and Russia, visit the border and see that no militant camps exist there.\n\nPakistan said India carried out an unprovoked attack deliberately targeted at civilians.\n\nMajor General Asif Ghafoor, a spokesman for the Pakistani Armed Forces, said Pakistan responded “effectively”, killing nine Indian soldiers, injuring several others and destroying two bunkers.\n\nIndian forces in Kashmir have gone “berserk”, said Raja Farooq Haider, prime minister of Pakistan’s Azad Kashmir region, adding that six civilians died and eight were injured.", "description": "India and Pakistan blamed one another for cross-border shelling in the disputed Kashmir region which killed and injured soldiers and civilians on both sides and made it one of the deadliest days since New Delhi revoked Kashmir's special status in August.", "authors": ["Fayaz Bukhari", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-20"}