{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/olivia-buckland-dons-pink-tutu-20528019", "downloaded_at": "2019-10-07 06:17:13.580817+00:00", "title": "Olivia Buckland dons pink tutu dress as she parties with hubby Alex in Dubai", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Daily Love Island stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nLove Island star Olivia Buckland looked stunning in a short pink tutu dress as she continues her anniversary break with husband Alex Bowen in Dubai.\n\nThe couple are celebrating their first year of marriage with a sun-soaked break with a trip around the UAE, having already stopped in Abu Dhabi earlier in the week.\n\nPosing with Alex at popular restaurant STK Dubai, the star captioned the post: “Last night tonight…”.\n\n(Image: oliviadbuck Instagram)\n\nDressed in a cute pink tutu dress from London based brand Lace and Beads, Olivia looked like she was living her best life as she cuddled up to her beau.\n\nShe completed her girlie look with a Gucci handbag and strappy black heels.\n\nOn her Instastory, Olivia continued praising her frock, saying: “I want to wear this for the rest of my life”.\n\n(Image: oliviadbuck Instagram)\n\n(Image: oliviadbuck Instagram)\n\nShe was seen having the time of her life with friends as she drank and danced the night away, documenting her antics for her Instagram followers.\n\nShe continued to show off the fuchsia pink dress at every given opportunity, including filming herself twirling in the bathroom mirror.\n\n(Image: oliviadbuck Instagram)\n\nOlivia and Alex met on Love Island in 2016 and married after two years together.\n\nDescribed as the poster couple when it comes to the show’s romances, the pair have successfully managed to avoid any controversies and look to be going strong.\n\nOlivia And Alex: Happily Ever After airs on Fridays at 9pm on TLC.\n\nDo you have a story to sell? Get in touch with us at webcelebs@trinitymirror.com or call us direct 0207 29 33033", "description": "The 25-year-old is celebrating her first anniversary and looked to be living her best live as she danced the night away", "authors": ["Sofia Petkar", "Image", "Oliviadbuck Instagram"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20528020.ece/ALTERNATES/s1200/0_Olivia-Buckland-dons-cute-pink-tutu-dress-as-she-parties-with-hubby-Alex-for-last-night-in-Dubai.jpg", "published_at": "2019-10-07"}