{"pub": "euronews", "url": "https://euronews.com/2019/10/11/talking-tough-or-tough-talks", "downloaded_at": "2019-10-11 20:37:21.533981+00:00", "title": "Talking tough or tough talks", "language": "en", "text": "A week in which EU leaders, diplomats and MEPs, condemned Turkey’s sudden and controversial incursion into northern Syria\n\n\"I call on Turkey, as well as on the other actors, to act with restraint and to stop operations already, as we are speaking, underway,\" Juncker told MEPs gathered in Brussels for a plenary session.\n\nLater that evening Federica Mogherini, EU Foreign Policy Chief told MEPs:\n\n\"Military action will undermine the security of the coalition's local partners, namely the Kurdish forces and risk protracted instability in northeast Syria, providing fertile ground for the resurgence of Daesh. Let us not forget that Daesh still remains a significant threat to regional, international and European security.\"\n\nBut not everyone was on board - Hungary blocked a common declaration, citing its desire not to upset Turkey\n\nMeanwhile in Brexit land...\n\nWhile talks continue, the chances of a deal, appeared to be slipping.\n\n\"To put things very frankly and to try and be objective, on this particular point, we are not really in a position where we are able to find an agreement,\" Michel Barnier told the European Parliament on Wednesday. However, on Friday talks entered 'a tunnel'.\n\nBut the blame game about the blame game has already begun, with a clearly frustrated Donald Tusk tweeting on Tuesday.\n\nAnd Also - the new Commission team began to collapse after three candidates were rejected. After the rejection of Romanian and Hungarian candidates France's pick, Sylvie Goulard, took a hammering in her vote.\n\nHungary has proposed a new candidate, but as the Romanian government fell this Thursday, there may be a further delay from Bucharest. Getting three new candidates through the whole vetting process could take weeks.\n\n\"We cannot longer take for granted that Ursula von der Leyen will become the next president of the European Commission and her team need an approval by a clear solid majority of the Parliament. As of today, Ursula von der Leyen has not a team, she does not have a majority supporting her political agenda,\" remarks Alberto Alemanno, Jean Monnet Professor of European Union Law and Policy, HEC Paris.\n\nAll views\n\nThis week here at Euronews we sat with a renowned Ukrainian author Andrei Kurkov to talk, Trump, Zelensky and 30 years on since the Fall of the Iron Curtain.\n\nNext week\n\nWe will have the fallout from the Polish elections, Foreign ministers meeting in Luxembourg and of course that Brexit EU council meeting - tune in for the latest coverage live on TV and online in your choice of nine languages.\n\nHowever before we go, politics is normally quite a serious business - but as the Danish PM proved this week, that’s not always the case.", "description": "Brexit enters a new urgent phase, while the EU slammed Turkey's offensive in Northern Syria, we round up the week in Brussels and beyond.", "authors": [], "top_image": "https://static.euronews.com/articles/stories/04/22/40/32/1000x563_cmsv2_4b94ec61-a622-5f91-be9d-3403c13ec300-4224032.jpg", "published_at": "2019-10-11"}