{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/26/russia-plots-surprise-response-us-denying-visas-un", "downloaded_at": "2019-09-26 15:10:31.745139+00:00", "title": "Russia plots 'surprise' response to U.S. denying visas to UN delegation", "language": "en", "text": "Russia is readying a “surprise” response to the U.S. denying visas to members of the country’s United Nations delegation, a top Moscow official said Thursday.\n\nSergey Lavrov, the Russian foreign minister, made the remark after several fellow members of his delegation missed this week’s UN General Assembly in New York City, which Moscow attributed to having their visa applications rejected by the U.S. government.\n\n“We will respond,” Mr. Lavrov told state-owned media, according to an English translation released by the Russian Foreign Ministry. “We will draft the relevant measures. Don’t deprive us of a chance to spring a surprise.”\n\n“Of course we will react sharply,” Mr. Lavrov said in a separate interview with the Kommersant newspaper, state-media reported. “Such impertinence cannot be tolerated.”\n\nRussian officials said earlier in the week that 10 members of the country’s UN delegation were unable to attend the annual meeting at the organization’s New York headquarters due to having their visa applications denied by the U.S. government.\n\nThe U.S. State Department did not immediately comment on Mr. Lavrov’s latest threat. A spokesperson previously told The Washington Times that visa records are confidential and that the agency is unable to discuss individual cases.\n\nThe episode unfolded nearly a month after two American lawmakers critical of Russian President Vladimir Putin’s policies – Sens. Ron Johnson, Wisconsin Republican, and Chris Murphy, Connecticut Democrat — similarly complained about being blocked by Moscow from participating in a congressional delegation to Russia organized by members of Congress.\n\nRussian government officials previously said that the U.S. lawmakers are among Americans included on a blacklist barring them from entering the country.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Russia is readying a \"surprise\" response to the U.S. denying visas to members of the country's United Nations delegation, a top Moscow official said Thursday.", "authors": ["The Washington Times Http", "Andrew Blake"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/25/UN_General_Assembly_39912.jpg-40959_c0-133-3192-1994_s1770x1032.jpg?f02a7729a851b3f027f372237d6a188b49e6ff8d", "published_at": "2019-09-26"}