{"pub": "washingtonpost", "url": "https://washingtonpost.com/travel/2019/10/24/can-tourism-pledges-help-keep-visitors-their-best-behavior", "downloaded_at": "2019-10-25 02:26:00.821447+00:00", "title": "Can tourism ‘pledges’ help keep visitors on their best behavior?", "language": "en", "text": "Drink tap water. Stay on marked paths. Respect locals. Don’t feed the wildlife.\n\nThese are just a sample of the pledges that global destinations from Aspen to New Zealand are seeking from visitors, all in the name of easing the burden of mass tourism. Although the promises largely come without any enforcement tool, some experts believe they are valuable for setting expectations for travelers and spelling out the moral burden of tourism.\n\n“I think there is, without a doubt, a strong and valuable education element,” says Gregory Miller, executive director of the Center for Responsible Travel. “Related to that is just a general awareness of the tremendous natural, cultural, historical values of a particular destination.”\n\nAnother element, Miller says, is “an important commitment — and that’s one of making choices and showing good behavior.”\n\n[We’re in the age of the overtourist. You can avoid being one of them.]\n\nIceland — which has become a case study for the rapid rise of mass tourism — introduced the Icelandic Pledge in mid-2017, urging tourists to be responsible by heeding several rules. They include not venturing off roads, using designated campsites if staying outdoors, parking in approved areas and practicing safe selfies.\n\n“I will take photos to die for, without dying for them,” one line says. Another gets down to business: “When nature calls, I won’t answer the call on nature.”\n\nSigridur Dogg Gudmundsdottir, public relations manager for Visit Iceland, says nearly 70,000 people have signed so far. They can do so online or at the airport, where they can press a button at a display and see the number of pledges increase in front of them.\n\n“We’re trying to speak to the honor code in tourists that are coming to Iceland, and we don’t want to forbid too much,” she says. “We’d much rather send the message in a benign way and ask people to join us in this venture to be responsible and preserve the beautiful nature of Iceland.”\n\n[A local’s guide to Reykjavik, Iceland]\n\nOther destinations followed, including Bend, Ore.; Big Sur, Calif.; the island of Hawaii with its Pono Pledge; and New Zealand with its Tiaki Promise. Finland introduced its Sustainable Finland Pledge last month. Aspen, Colo., launched its own pledge last year, and the Aspen Chamber Resort Association has tied it in to a campaign to “tag responsibly” by not using geotags on Instagram photos of sites that are at risk of becoming trampled by tourists.\n\nMany of the pledges include common themes: treat the destination respectfully, don’t leave trash behind, stay on marked paths and sleep at official campsites. Safety over social media is another constant. (“I won’t risk life or limb [human or sapling] for more likes,” reads Bend’s pledge.) And some are extremely specific to their destinations. Hawaii’s Pono Pledge notes: “Molten lava will mesmerize me, but I will not disrupt its flow.”\n\n\n\n(From the Palau Pledge)\n\nPalau, a Pacific Ocean archipelago, says it is the first country to change its immigration laws to require all visitors to sign a promise in their actual passports — addressed to the nation’s children — when they enter the country. More than 239,000 people have signed on since the Palau Pledge was implemented in late 2017.\n\n“The Pledge was deemed necessary after careless behavior from visitors started to erode Palau’s pristine environment and have a negative impact on its culture,” the initiative’s website says. It notes that the government passed policies that subject visitors who break the pledge’s conditions to fines up to $1 million.\n\nNo other pledges appear to carry a threat of a fine, though some warn against behavior that is against the law. The Icelandic Pledge, for example, includes this promise: “I will follow the road into the unknown, but never venture off the road.” Gudmundsdottir said people can get fined for driving off the road, but that’s not connected to the pledge.\n\n“That’s just the law of the country,” she says.\n\nLikewise, in Finland, littering can result in a fine or up to two years in prison, according to Liisa Kokkarinen, the project manager at Visit Finland responsible for Sustainable Travel Finland. And people might face fines or other legal ramifications for unknowingly violating Finland’s “everyman’s rights” by fishing without a permit, leaving marked paths or taking natural resources from protected areas.\n\n“The pledge is meant to protect travelers visiting Finland and make them aware of these general rules and responsibilities,” Kokkarinen said in an email. “Because visitors may not know about the different rules in nature areas, the pledge offers a way to guide them towards the respectful behavior that is expected of them while visiting Finland.”\n\n[These are the cities overtourism could threaten next]\n\nIn addition to educating tourists on how to be more responsible, Kokkarinen said, the pledge is a guide for people to travel the way most people say they want to these days: like a local.\n\n“The pledge gives a window to travelers to ‘be like a Finn,’ ” she said. “Many tourists appreciate the culture and environment they are visiting, and seek ways to act like the locals to get more in-depth destination experience.”\n\nSome pledges have gone beyond promises and moved into a different sphere of action: raising money. Pledge for the Wild, which launched this summer, is an initiative by five mountain towns — Bend; Bozeman, Mont.; Flagstaff, Ariz.; Steamboat Springs, Colo.; and South Lake Tahoe in California and Nevada — that encourages visitors to donate to keep up public spaces.\n\n“We invite you to consider a pledge of $1/hour for the time you spend mountain biking, hiking to epic peaks or wild flower meadows, fishing pristine rivers and waterways, or any of the other epic adventures you’ve just had,” the website says. It provides codes that people can text to a number to make the donation, with money going to organizations in each community that maintain trails or other public spaces.\n\n“What we’re really talking about is changing the way a visitor visits a destination and the ways in which they have a financial impact on that destination,” says Kevney Dugan, president and chief executive of Visit Bend, who helped launch Pledge for the Wild. His own organization introduced the Bend Pledge in 2017, but he realized there was potential to ask for more from visitors.\n\n“Even if you don’t pledge money, we believe that this effort is also going to make you think a little more about where you’re visiting, how your visit impacts that destination and be a little more thoughtful about how to recreate in those spaces,” Dugan says.\n\nRead more:\n\nA selfie ban in the Czech Republic is the latest effort to combat bad tourist behavior\n\nTell us what you think of By The Way\n\nA girl took a heart-shaped rock from a national park. Then she felt guilty and sent it back.", "description": "Destinations across the world are turning to a new tool: a morality-based honor code, largely without concrete punishments.", "authors": ["Hannah Sampson", "Reporter Focusing On Travel News", "October At Pm", "Hannah Sampson Is A Staff Writer At The Washington Post For The Way", "Where She Reports On Travel News."], "top_image": "https://www.washingtonpost.com/resizer/b4TLfmjtheyzqfxeInAhq8cQ568=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ZNTCHDFCQFBELKSBGKTJH4SPCM.jpg", "published_at": "2019-10-24"}