{"pub": "yahoo", "url": "https://news.yahoo.com/top-gun-dual-japans-f-170000391.html", "downloaded_at": "2019-09-25 23:33:58.016974+00:00", "title": "Top Gun Dual: Japan's F-15 vs. China's J-20 Stealth Fighter (Who Dies?)", "language": "en", "text": "Key point: It is a good thing Japan is getting the F-35 as the F-15 is good, but not stealthy.\n\nAs tensions between China and Japan have increased, there have been more encounters between Chinese and Japanese military aircraft. People’s Liberation Army Air Force (PLAAF) Su-27s have been spotted near Japanese aircraft in the East China Sea, prompting Japanese F-15s based in Okinawa to scramble.\n\nThese encounters appear to be the new normal, and may continue for the foreseeable future—indeed, into a time when China’s J-20 “Soaring Dragon” fighter becomes operational. China’s first fifth generation fighter, the J-20 is expected to enter service by the end of the decade.\n\nAt the same time, Japan is still flying the F-15J Eagle fighter. Although an excellent fighter, Japan’s Ministry of Defense had expected to replace it with the F-22 Raptor by now. Unfortunately for Japan, the now-infamous Obey Amendment passed by the U.S. Congress prohibited the Raptor’s export, and Japan has been stuck without a true F-15 replacement.\n\nJapan took delivery of its first F-15J in 1981. The fighter was manufactured under license by Mitsubishi Heavy Industries, and was largely identical to American-owned jets with the exception of its electronic countermeasures suite and radar warning equipment, which the U.S. government declined to sell. The aircraft were initially armed with AIM-9 Sidewinder air-to-air missiles and the semi-active radar-guided AIM-7 Sparrow—later replaced with the AIM-120 AMRAAM missile. An M61 nose-mounted 20-millimeter gatling gun rounds out the F-15J’s armament.\n\nJapan has taken delivery of 223 F-15Js, with eight lost to accidents.\n\nThe F-15J has been in service for a long time. Japan initiated an upgrade program in the early 2000s that saw a new infra-red guided missiles (AAM-3 and AAM-5), improved engines, improved AN/APG-63 (V)1 mechanically-scanned pulse-doppler radars and the ability to carry AAM-4B radar-guided missiles added to the jet. Improved electronic countermeasures and a nose-mounted infra-red search and track (IRST) sensor were also added to bring the fighter up to date. However, the upgrade is expensive and is only being applied to fewer than ten aircraft per year. Only about half of Japan’s F-15Js have received the upgrades.\n\nThe Chengdu J-20 is an intriguing mystery. As China’s first fifth-generation fighter, the J-20 was first revealed in 2011. A twin-engined, single seat aircraft with forward canards and a stealthy profile, the J-20 is thought to be slightly longer than the F-15J. It has a long, broad fuselage for internal weapons and fuel storage. It appears to have three internal weapons bays, two smaller bays for short-range missiles and one larger bay for long range air-to-air missiles and air-to-ground ordnance.\n\nThe J-20 appears to have a nose cone large enough to conceal an advanced active electronically scanned array (AESA) radar, giving it the ability to detect distant targets and attack them with radar-guided missiles. Newer prototypes appear to be equipped with an infra-red search and track system and an electro-optical targeting system for air-to-ground attacks.\n\nThe J-20’s precise role is not known. The aircraft appears to be built for long-range missions. The “Soaring Dragon” could be like the Russian-built MiG-31, a high speed (and stealthy) interceptor that will pay particular attention to shooting down enemy aerial refueling tankers, AWACS early warning and control aircraft, reconnaissance and intelligence collection aircraft and so on. Alternately, it could be fitted out to be a long range medium bomber, like the American F-111—capable of striking targets like Okinawa and bases across Japan.\n\nFor the sake of argument, let’s assume the J-20 is outfitted as a long-range air superiority fighter. Pitted against the F-15J, which plane would win?\n\nAssuming the J-20’s designers were successful in reducing the plane’s radar cross section, the F-15J may have trouble detecting it at longer ranges. At the same time, the lack of stealth on the F-15J means that with a competent radar, the J-20 will easily detect the Japanese fighter. This doesn’t bode well for the F-15J in the beyond visual range fight, especially if the J-20 is armed with PL-15 missiles. Successfully tested in September 2015, the PL-15 includes an active radar seeker and possibly dual pulse rocket motor propulsion (it might also be ramjet-powered).", "description": "Let's stack them up.", "authors": ["Kyle Mizokami"], "top_image": "https://s.yimg.com/uu/api/res/1.2/4frcYrszZH9ZcXSbgxwxsw--~B/aD05NTc7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_national_interest_705/cea6e3ff7e904871f4a831f78916a319", "published_at": "2019-09-25"}