{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/judge-rules-that-twitchs-contract-with-banned-streamer-includes-unconscionable-language", "downloaded_at": "2019-10-01 00:15:55.408406+00:00", "title": "Judge Rules That Twitch's Contract With Banned Streamer Includes 'Unconscionable' Language", "language": "en", "text": "The legal saga between Twitch and the banned Counter-Strike: Global Offensive streamer James “PhantomL0rd” Varga continues. The judge’s latest ruling is a potential mark in the “win” column for Varga, as well as other Twitch streamers who might have grievances with Twitch in the future.\n\nThe trouble started back in 2016, when Varga was banned from Twitch after he streamed himself using CS:GO gambling sites. According to an exposé by journalist Richard Lewis, Varga allegedly had a financial stake in one of these sites.\n\nTwo years later, Varga sued Twitch for lost income and damages incurred from what he now claims was a wrongful ban. Twitch responded with a counter-suit against Varga that asserted the streamer had violated multiple Twitch policies.\n\nVarga was suing for lost income, and while the legal system has yet to determine whether his ban was actually wrongful and that he should therefore be repaid, his lawsuit has revealed some unusual fine print in the contract he signed with Twitch. Apparently, Varga’s contract stated that he wouldn’t be allowed to receive anything more than $US50,000 ($74,000) from a suit against Twitch.\n\nThe judge’s full ruling, first reported by Dexerto and also obtained by Kotaku, deemed that this $74,000 cap was “overly harsh and unreasonably and unfairly one-sided… There is no reason to limit Varga to [$74,000] when he might well be entitled to a much, much higher sum.”\n\nThe judge continued, “From a practical point of view, which I think is an essential consideration, limiting recovery to [$74,000] virtually kills off the odds of a suit against Twitch at all. The agreement doesn’t appear to have an attorney fees clause, and few — if any — lawyers would take on a contingency case against Twitch for some reasonable percentage of [$74,000]. The cap is unconscionable.”\n\nVarga admitted in court that he hadn’t actually read the contract before first signing it in 2012, nor did he read it when he signed a re-upped version of it two years later. He claimed he didn’t know “if that’s what needed to be done.”\n\nAccording to the judge’s summary: “Varga, who spent virtually all his waking hours on computers, and was familiar with a variety of programs, did not know he could scroll through the agreement. He had time, both in 2012 and 2014, to do so, and if he had, he would have seen [the relevant section]. He simply chose not to do so.”\n\nIf Varga had read the contract, the judge theorised that the streamer could have tried to push back against it before signing. Nonetheless, the judge ultimately ruled that the language in the contact was “unconscionable,” meaning the court can ignore this clause when deciding how much money (if any) to award Varga.\n\nOne mark in Varga’s favour was the “significant difference” between him and Twitch “in their legal sophistication. Varga in 2014 was 26 years old living with his parents, and he had little to no legal experience.” In contrast, Twitch had paid a legal team to draft their end of the bargain, putting the platform at a clear advantage.\n\nAlthough Varga’s case is not particularly sympathetic, since most people just associate him with the CS:GO gambling streams that led to his ban, his case has nonetheless revealed one way that Twitch had been unfair in its contract. Varga may or may not win his overall suit for lost income, but if he does, he’ll now be able to ask for more than $74,000. (According to the ruling, Varga’s income “averaged over $US5,000 ($7,408) per month and appeared to cluster around $US10,000 ($14,816) per month,” so multiple years of lost income would have exceeded the cap.)\n\nThe case will proceed, but regardless of its outcome, this ruling could potentially help other streamers who have a similar clause in their contract and who may bring a suit against Twitch in the future. Most important of all, it’s a reminder to read anything you sign.", "description": "The legal saga between Twitch and the banned Counter-Strike: Global Offensive streamer James “PhantomL0rd” Varga continues. The judge’s latest ruling is a potential mark in the “win” column for Varga, as well as other Twitch streamers who might have grievances with Twitch in the future....", "authors": ["Luke Plunkett", "Alex Walker"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/hbfb7mpjskifih3lcywq.jpg", "published_at": "2019-10-01"}