{"pub": "thenextweb", "url": "https://thenextweb.com/apps/2019/10/21/instagram-is-testing-a-feature-to-clean-up-your-pity-follows", "downloaded_at": "2019-10-21 07:37:03.419953+00:00", "title": "Instagram is testing a feature to clean up your pity follows", "language": "en", "text": "We’ve all been there: You meet someone who wants to stay in touch later, but you don’t want to share your number with them. So you turn to the next best thing — Instagram. These are people whom you follow out of courtesy, but don’t interact with much.\n\nDon’t worry, Instagram is testing a feature that might help you out unfollow some of them. According to app researcher Jane Manchun Wong,the social network is experimenting with a feature to let you group accounts — and it’ll even corral those courtesy follows for you automatically.\n\nSome automatic groups are “Least interacted with” and “Most shown in Feed,” calculated over the course of the last 90 days. You can go through accounts you don’t interact with much, and unfollow some to clear out your list.\n\nInstagram is testing to “group the accounts you follow to make them easier to manage”, such as: “Least Interacted With” and “Most Shown in Feed” which are counted in the last 90 days pic.twitter.com/REykEoMqu5 — Jane Manchun Wong (@wongmjane) October 19, 2019\n\nPlus, this feature will certain help you segregate accounts based on interests such as sports, design, fashion, and memes. This feature is similar to Twitter lists, and which is quite handy for creating alternative feeds.\n\nWe’ve contacted Instagram to learn more about when this feature might roll out, and we’ll update the story if we hear back.", "description": "", "authors": ["Ivan Mehta"], "top_image": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2FInstagram-test.png&signature=52a5e5f9e184cc79cb3160b64dc12de5", "published_at": "2019-10-21"}