{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/10/24/german-police-launch-nationwide-raids-against-people-trafficking-gangs", "downloaded_at": "2019-10-25 23:53:38.407282+00:00", "title": "German Police Launch Nationwide Raids Against People Trafficking Gangs", "language": "en", "text": "Hundreds of officers launched simultaneous raids across four German states Thursday morning against members of suspected people-smuggling gangs, just hours after 39 victims of such gangs were discovered dead in a freight truck in the United Kingdom.\n\nThe effectiveness of the operation may be called into question, however, as despite up to 400 officers executing 26 warrants on what German newspaper Frankfurter Allgemeine Zeitung reported as the “business premises of Arab families” in the Rhineland, Westphalia, Saarland, and Berlin, just two arrests were made.\n\nArab and Kurdish Crime Clans ‘Systematically Recruiting’ Refugees in Merkel’s Germany https://t.co/iNcQJwU4lK — Breitbart London (@BreitbartLondon) October 16, 2018\n\nGermany’s Deutsche Welle reports there may be as many as 10,000 people working for the clans in North Rhine-Westphalia alone, and that the groups are involved in people trafficking, prostitution, and other organised crime. Speaking Thursday, Berlin Attorney General Sjors Kamstra said the wealth and power of the gangs made them difficult to prosecute because they could bribe or intimidate witnesses into silence.\n\nThat goes as far as intimidating the police themselves, with Arab clans accused of spreading sexual rumours about officers. As the clans control prostitution rackets in the city, witnesses claiming to have slept with officers are easily produced.\n\nThe raids came after European political leaders expressed their disgust at the deaths of 39 in the back of a refrigerated truck that had come to the United Kingdom from mainland Europe on Wednesday. It remains likely that the route of the truck from Bulgaria to the UK would have taken it through Germany itself, and German police are assisting the British with their investigations.\n\nWhile German Chancellor Angela Merkel expressed condolences for the dead, government spokesman Steffen Seibert said: “our resolve must be directed against those who organize and carry out such transports.”\n\nAnalysis: Migrants Who Died in Lorry are Victims of Weak Borders and Callous People-Smugglers https://t.co/tHfYhikx5c — Breitbart London (@BreitbartLondon) October 24, 2019\n\nJust hours later, the mass raids against suspected people-smugglers across Germany took place.\n\nGerman-Lebanese academic Ralph Ghadban has blamed the German government’s policy of encouraging multiculturalism for the formation and power of the crime clans in the country. In remarks reported by Breitbart London in March, Ghadban said: “dangerous areas, so-called no-go areas, in which Arab clans have the upper hand” were the result of multiculturalism which encouraged people from different backgrounds to live apart, not assimilate.\n\nIn 2016, it was even said that Berlin’s criminal underworld had been “lost to Arab clans” who recruited young, fit migrants arriving during the Europe Migrant Crisis of that year to do dirty work for the gangs. By contrast, German media today reported police insisting their raids against the clans were now being felt and having an impact.", "description": "Hundreds of officers launched simultaneous raids across four German states Thursday morning against members of suspected people-smuggling gangs, just hours after 39 victims of such gangs were discovered dead in a freight truck in the United Kingdom.", "authors": ["Oliver Jj Lane"], "top_image": "https://media.breitbart.com/media/2019/01/wi/ap/30/5d6d4c_germany-extremism-99894-police-officer-in-building-raid-in-village-meldorf-e1571937724342-640x335.jpg", "published_at": "2019-10-24"}