{"pub": "realclearpolitics", "url": "https://axios.com/joe-biden-family-hunter-ukraine-donald-trump-2020-93dec9f4-cd1b-4235-b538-7d902a81ba89.html", "downloaded_at": "2019-09-28 01:00:08.452618+00:00", "title": "Ukraine controversy spotlights Joe Biden's family problem as 2020 heats up", "language": "en", "text": "Hunter Biden was a paid board member of a Ukrainian gas company while his father was in the White House.\n\nwas a paid board member of a Ukrainian gas company while his father was in the White House. Fact checks have debunked allegations of wrongdoing. [Updated.]\n\nTop Democrats tell us they worry the Ukraine fracas winds up being an albatross for Biden because he'll be associated with an unpopular issue and process, and won't be able to shake questions about Hunter Biden.\n\nAll the fact checks and \"to be sure\" paragraphs in the world may not obviate the collateral damage.\n\nA Democratic strategist not affiliated with a campaign said the Hunter Biden problem is not just his work in Ukraine, but all his personal and business issues.\n\nThey were all detailed in July in a gripping New Yorker article by Adam Entous, who had extensive cooperation from Hunter Biden and the campaign: \"Will Hunter Biden Jeopardize His Father’s Campaign? Joe Biden’s son is under scrutiny for his business dealings and tumultuous personal life.\"\n\nTrump will be \"relentless\" in exploiting and distorting any dirt on Hunter, the Democratic strategist said.\n\nPart of Trump's calculus could be psychological: Trump knows that Biden worries about his son.\n\nThe possible upside for Biden is that such taunting reinforces the idea that he is the 2020 Democrat most feared by Trump.\n\nThe Hillary view: Philippe Reines, a longtime Hillary Clinton confidant, tells Axios he has seen this movie before.\n\n\"This has nothing to do with the reality of your experience, your life or your past,\" Reines said. \"They’re reimagining you however they want. It’s beyond a case of taking something and exaggerating it.\"\n\nThe Biden campaign's thinking: Biden did nothing wrong.\n\nA Biden adviser told me the collateral damage from the Ukraine scandal should be mitigated for the former vice president because people feel they know Biden and find him relatable.\n\nThe campaign says it has had its best week of fundraising since the second week of the campaign.\n\nBiden plans to continue talking about health care, climate change and gun control — although he won't ignore Trump.\n\nThe bottom line: The biggest political beneficiary of the impeachment inquiry could be Elizabeth Warren.\n\nGo deeper: Whistleblower alleges Trump abused power to solicit foreign interference", "description": "All the fact checks in the world may not obviate the collateral damage.", "authors": [], "top_image": "https://images.axios.com/gbDbCY4sYiq87g537TMfEllGA4o=/0x0:1920x1080/1920x1080/2019/09/27/1569577664260.jpg", "published_at": "2019-09-27"}