{"pub": "independent", "url": "https://independent.co.uk/travel/news-and-advice/december-holidays-travel-christmas-markets-winter-sun-a9143391.html", "downloaded_at": "2019-10-07 20:24:02.520028+00:00", "title": "Where to go on holiday in December, from New York to Jamaica", "language": "en", "text": "From gluhwein-fuelled Christmas market city breaks to a different kind of winter warmth down south, here’s where to escape to this festive season.\n\nThe Independent’s hotel recommendations are unbiased, independent advice you can trust. On some occasions, we earn revenue if you click the links and book, but we never allow this to affect our coverage.\n\nNorth West Province, South Africa\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIt may seem a far-flung choice for winter sun, but South Africa’s convenient time difference (GMT+2) and sensational wildlife make it well worth the journey. Fly into Johannesburg and within four hours you can be spotting elephants and lions in Madikwe Game Reserve, one of the lesser known (and malaria free) parks up near the Botswana border.\n\nIt’s home to the highly endangered African Wild dog and hippo as well as the Big Five. With the Duke and Duchess of Sussex bringing baby Archie to South Africa for their autumn tour, it’s proof this is a holiday hotspot the whole family can enjoy. If you know some kids who’d go wild for a Lion King-themed Christmas, Wayfairer Travel has introduced an 11-day South Africa Family Safari & Beach Holiday specifically for families with infants and toddlers, which follows luxe camp Lelapa Lodge with a few days in Mauritius, for you to get your beach fix (from £14,900 per family, based on two adults and two children sharing).\n\nAverage temperature in December: 20C\n\nFlight time: 11h to Johannesburg\n\nGhent, Belgium\n\nFollow the smell of mulled wine and the twinkle of fairy lights to this unsung Flanders city’s Christmas market (6 December to 5 January). While Bruges is Belgium’s de facto romantic mini-break option and Antwerp owns the fashion scene, somehow Ghent’s pretty canals and medieval streets slip under the radar. Its museums are packed with Flemish masterpieces – don’t miss Van Eyck’s Ghent Altarpiece, the most stolen artwork in history – while St Peter’s Abbey dates back to the seventh-century.\n\nBut thanks to students making up a quarter of the city’s population, this is a young-at-heart, lively hub where quirkily cool beer houses, cafes and concept shops sit alongside historic monuments. Slap bang in the middle of its pedestrianised centre is Pillows Grand Hotel Reylof (luxury rooms from €165), which has done a masterful job of renovating a 1724 manor house, slipping a dreamy spa and swimming pool into the original carriage house. Keep out the cold with a slab of gingerbread or yule log as you browse the festive stalls outside Saint Bavo’s Cathedral; Christmas shopping just got a whole lot more appealing.\n\nShape Created with Sketch. The 10 Best Christmas markets Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The 10 Best Christmas markets 1/10 10leeds.jpg 1. Leeds Christkindelmarkt Until 18 December, leeds.gov.uk Leeds' Millennium Square turns into a little bit of Germany with 40 visiting German traders, and there's even an authentic bierkeller. 2/10 10southbank.jpg 2. SouthBank and London Eye Christmas Market Until 24 Dec, xmas-markets.com Pay a visit to Santa in his grotto-cum-chalet or marvel at the illuminated London Eye. 3/10 10belfast.jpg 3. Belfast Christmas Continental Market Until 19 Dec, belfastcity.gov.uk Stalls from 27 countries transform the city hall's grounds into a chocolate-box Christmas scene. 4/10 10caerphilly.jpg 4. Caerphilly Medieval Market 10 and 11 Dec, christmasmarkets.com Experience a medieval Christmas, complete with castle jester, while roaming around 150 craft stalls. 5/10 10manchester.jpg 5. Manchester Christmas Market Until 21 Dec, manchester.gov.uk Mooch around chalet-lined Albert Square and a small forest of plants, and sample the multicultural fare. 6/10 10newcastle.jpg 6. Newcastle Christmas Market Until 11 December, newcastlegateshead.com This is a winter fantasia of carol singers, mulled wine stalls and a whole host of food stalls. 7/10 10birmingham.jpg 7. Frankfurt Christmas Market, Birmingham Until 23 Dec, birmingham.gov.uk The Frankfurt market has German foods and trinkets, as well as local handmade stocking-fillers. 8/10 10bath.jpg 8. Bath Christmas Market Until 11 December, bathchristmasmarket.co.uk Possibly the prettiest of all the markets, between Bath Abbey and the Roman Baths, with 120 gift stalls. 9/10 10winchester.jpg 9. Winchester Christmas Market Until 21 December, winchester-cathedral.org.uk This showcases local painters, glass-makers and textile artists. 10/10 10edinburgh.jpg 10. Edinburgh German Christmas Market and Fair Until 24 December, edinburghschristmas.com A German market with sausages, crêpes and handmade gifts. 1/10 10leeds.jpg 1. Leeds Christkindelmarkt Until 18 December, leeds.gov.uk Leeds' Millennium Square turns into a little bit of Germany with 40 visiting German traders, and there's even an authentic bierkeller. 2/10 10southbank.jpg 2. SouthBank and London Eye Christmas Market Until 24 Dec, xmas-markets.com Pay a visit to Santa in his grotto-cum-chalet or marvel at the illuminated London Eye. 3/10 10belfast.jpg 3. Belfast Christmas Continental Market Until 19 Dec, belfastcity.gov.uk Stalls from 27 countries transform the city hall's grounds into a chocolate-box Christmas scene. 4/10 10caerphilly.jpg 4. Caerphilly Medieval Market 10 and 11 Dec, christmasmarkets.com Experience a medieval Christmas, complete with castle jester, while roaming around 150 craft stalls. 5/10 10manchester.jpg 5. Manchester Christmas Market Until 21 Dec, manchester.gov.uk Mooch around chalet-lined Albert Square and a small forest of plants, and sample the multicultural fare. 6/10 10newcastle.jpg 6. Newcastle Christmas Market Until 11 December, newcastlegateshead.com This is a winter fantasia of carol singers, mulled wine stalls and a whole host of food stalls. 7/10 10birmingham.jpg 7. Frankfurt Christmas Market, Birmingham Until 23 Dec, birmingham.gov.uk The Frankfurt market has German foods and trinkets, as well as local handmade stocking-fillers. 8/10 10bath.jpg 8. Bath Christmas Market Until 11 December, bathchristmasmarket.co.uk Possibly the prettiest of all the markets, between Bath Abbey and the Roman Baths, with 120 gift stalls. 9/10 10winchester.jpg 9. Winchester Christmas Market Until 21 December, winchester-cathedral.org.uk This showcases local painters, glass-makers and textile artists. 10/10 10edinburgh.jpg 10. Edinburgh German Christmas Market and Fair Until 24 December, edinburghschristmas.com A German market with sausages, crêpes and handmade gifts.\n\nAverage temperature in December: 10C\n\nFlight time: 3h by Eurostar\n\nIschgl, Austria\n\nIschgl’s reputation for early-season snow leaves most resorts green with envy – opening in late November, it offers far more skiing above 2,000m than anywhere else in Austria, plus powerful snowmaking facilities to fall back on if needed. It’s long been a favourite with German holidaymakers, but now the secret is getting out among Brits. Long, wide cruising trails, high-altitude powder-rich bowls, a large terrain park for snowboarders – this Tyrolean gem has all bases covered.\n\nThe après-ski scene is epic, too: everyone from Rihanna to Elton has taken to the stage at its Top of the Mountain festival, which opens and closes the ski season, in the past. The coolest crash pad in town? Award-winning design hotel Hotel Madlein, with its fire pit and log cabin-encased sauna.\n\nAverage temperature in December: 4C\n\nFlight time: 1h 45m to Zurich\n\nJamaica\n\nWho needs eggnog and turkey when you have rum punch and jerk chicken? On the Caribbean’s third-largest island, a scintillating dance hall scene meets incredible white-sand coves and outdoorsy adventures like scrambling up the dramatically cascading Dunns River Falls or bamboo rafting along the Martha Brae. And as next year would have been Bob Marley’s 75th birthday, there’s no better time to delve into the home of reggae; start off with a tour of the music legend’s Kingston hangouts.\n\nAnother famous name associated with Jamaica is of course Ian Fleming, who wrote many of the James Bond novels at his Oracabessa retreat GoldenEye (now a plush hotel, with rooms from £304). Nearby Jamaica Inn (from £280 per night) has a similarly starry past – Marilyn Monroe honeymooned there and Winston Churchill was such a fan they named a suite after him. December to April brings the driest, most beach-friendly weather to Jamaica’s shores after the summer hurricane season, so plonk yourself in a hammock and soak up the blissed-out vibes.\n\nAverage temperature in December: 32C\n\nFlight time: 10h\n\nNew York City, USA\n\nFrom Miracle on 34th Street to Home Alone 2, Manhattan filled our childhood minds with visions of festive cheer, and it doesn’t fall short in real life. What’s on the to-do list? Ice-skating in Central Park, of course, then strolling down Fifth Avenue to gawp at the department store window displays and the Rockefeller Center tree. As for catching a show, in lieu of a panto, the Christmas Spectacular Starring the Radio City Rockettes is a seasonal favourite. Don’t overlook the borough across the water, either: Brooklyn’s Dyker Heights is renowned for its next-level house decorations. Seek sustenance on chilly nights at the cosy yet chic Spotted Pig in the West Village, which does comforting old-school eats (including superlative burgers), while boutique hotel newcomer Arlo SoHo (rooms from £143 per night) offers sheepskin and walnut-bedecked compact crash pads in downtown’s old printing district.\n\nAverage temperature in December: 4C\n\nFlight time: 8h", "description": "From gluhwein-fuelled Christmas market city breaks to a different kind of winter warmth down south, here’s where to escape to this festive season. The Independent’s hotel recommendations are unbiased, independent advice you can trust. On some occasions, we earn revenue if you click the links and book, but we never allow this to affect our coverage.", "authors": ["Estella Shardlow"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/04/16/43279047990-03434b4ea2-k.jpg", "published_at": "2019-10-07"}