{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/3/cheikas-australians-to-play-with-verve-at-rugby-wo", "downloaded_at": "2019-10-03 09:36:40.212036+00:00", "published_at": "2019-10-03", "title": "Cheika’s Australians to play with verve at Rugby World Cup", "language": "en", "text": "OITA, Japan (AP) - Anyone reading Michael Cheika’s open letter to his recently deceased ex-club coach will know what style he envisages for Australia’s Rugby World Cup game against Uruguay.\n\nCheika paid tribute to Jeff Sayle, a legendary figure at Randwick and a mentor to four Wallabies coaches, in the wake of last Sunday’s 29-25 loss to Six Nations champion Wales and ahead of this Saturday’s Pool D encounter with Uruguay.\n\nHe praised Sayle’s influence on him, and on the likes of other Wallabies coaches Bob Dwyer, who guided Australia to the 1991 World Cup title, Eddie Jones, and Ewen McKenzie.\n\nAnd he signed off with this vow: “So as you used to say mate, ‘Whooshka boomie. Let’s go.’”\n\n“We will try to honor you by playing with that same verve for the rest of this World Cup.”\n\nIt has long been the Wallaby way to use the ball in hand, sometimes to the detriment of the higher-percentage but more conservative tactical kicking game. Sometimes it works _ Australia has won two Rugby World Cup titles and reached the final in ’03 (under Eddie Jones) and in 2015 (under Cheika) _ and sometimes it backfires.\n\nAfter two slow starts requiring big second-half comebacks so far in Japan, Cheika is insisting this week that the kind of mistakes that resulted in Australia conceding significant leads to Fiji and Wales will be erased.\n\n“If you look at it in a bit of detail, we’ve given away four tries so far in the two games _ an intercept (against Wales), a dropped ball against Fiji where they ran in behind us off a set-piece to run 50 meters, a wide kick and we missed a couple of tackles on the Fijians in game one,” Cheika said. “So there’s maybe a couple of concentration things there that cost us.\n\n“But we’ve also created opportunities. If you watch the two games, we’ve created opportunities at the start of the game, we maybe haven’t taken those opportunities at the start, whereas in the back 60 minutes or 50 minutes of games we have. Sometimes that’s just the nature of it.”\n\nSelection consistency is a secondary consideration against Uruguay, with Cheika making 13 changes to his starting XV in a bid to give the full squad game time.\n\nIt continues the uncertainty over the key No. 10 role, with Christian Leali’ifano recalled after Bernard Foley and Matt Toomua had a half each against the Welsh, with vastly different success. Leali’ifano will reunite in the halves with Nic White in the partnership that started in the opening win over Fiji. The backup 9s have had a big impact off the bench in both games, a role Will Genia and White have shared.\n\n“We’ve only got the two halfbacks here, so the division of time is also very important,” Cheika said. “You’re not going to get one player to dominate seven games in a row.\n\n“I’m a big fan of both of theirs and, at the moment, we’re happy with how they’re both going.”\n\nThe back row combination of regular opensides Michael Hooper and David Pocock playing in tandem will be shelved against Uruguay, with Lukhan Salakaia-Loto deployed as a more traditional blindside flanker and Jack Dempsey getting a start at No. 8. Hooper will play his third straight game as captain.\n\n“As a team, we are after a fast start, it’s something we want to work on,” Dempsey said, underscoring Cheika’s theme, “and, as a back-rower, that is something you can have a hand in, getting that quick start and getting a bit of a roll on.”\n\nThe 19-year-old Jordan Petaia will make his test debut at the Rugby World Cup after getting picked on the wing.\n\nAustralia scored 11 tries in a 65-3 win over Uruguay in the last World Cup and, while the Uruguayans had an upset win over Fiji to open their campaign this time, there’s no real expectation of another major shocker. Wales and Australia are expected to finish top and second in the group to advance to the quarterfinals.\n\nBrothers Agustin and Juan Diego Ormaechea will start together for the first time in the tournament after Uruguay made nine changes. Basically the same Uruguay lineup that upset Fiji 30-7 then lost to Georgia 33-7.\n\nFlyhalf Felipe Berchesi, who scored Uruguay’s only points against Australia in ’15, hooker German Kessler, lock Manuel Leindekar and backs Andres Vilaseca, Rodrigo Silva and Nicolas Freitas will make their third starts of the tournament.\n\n___\n\nLineups:\n\nAustralia: Kurtley Beale, Dane Haylett-Petty, Tevita Kuridrani, Matt Toomua, Jordan Petaia, Christian Leali’ifano, Nic White; Jack Dempsey, Michael Hooper (captain), Lukhan Salakaia-Loto, Adam Coleman, Rob Simmons, Allan Alaalatoa, Folau Fainga’a, James Slipper. Reserves: Jordan Uelese, Sekope Kepu, Taniela Tupou, Rory Arnold, David Pocock, Will Genia, James O’Connor, Adam Ashley-Cooper.\n\nUruguay: Rodrigo Silva, Federico Favaro, Tomas Inciarte, Andres Vilaseca (captain), Nicolas Freitas, Felipe Berchesi, Agustin Ormaechea; Manuel Diana, Juan Diego Ormaechea, Manuel Ardao, Manuel Leindekar, Franco Lamanna, Diego Arbelo, German Kessler, Juan Echeverria. Reserves: Guillermo Pujadas, Joaquin Jaunsolo, Juan Pedro Rombys, Ignacio Dotti, Juan Manuel Gaminara, Santiago Arata, Felipe Etcheverry, Agustin Della Corte.\n\n___\n\nMore AP Rugby World Cup: https://www.apnews.com/RugbyWorldCup and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Anyone reading Michael Cheika’s open letter to his recently deceased ex-club coach will know what style he envisages for Australia’s Rugby World Cup game against Uruguay.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/03/aptopix_japan_rugby_wcup_australia_wales_01123_c0-2-4525-2640_s1770x1032.jpg?3d00dd5a0082f00ff75ac931187f471621e3c742"}