{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7594917/Kevin-Smith-celebrates-25-years-Clerks-premiered-iconic-Quick-Stop-New-Jersey.html", "downloaded_at": "2019-10-21 03:02:43.357758+00:00", "title": "Kevin Smith celebrates 25 years since Clerks premiered at the iconic Quick Stop in New Jersey", "language": "en", "text": "Kevin Smith's cinematic classic Clerks premiered in 1994, igniting a cult following that's endured decades.\n\nThe filmmaker celebrated 25 years since the black-and-white film premiered by visiting the place where it all started.\n\nHe took to Instagram as he and longtime friend/collaborator Jason Mewes visited Quick Stop Groceries in Leonardo, New Jersey.\n\n25 years later: Kevin Smith took to Instagram as he and longtime friend/collaborator Jason Mewes visited Quick Stop Groceries in Leonardo, New Jersey for the 25th anniversary of Clerks\n\nThe old pals posed for photos in the store and on the wall outside, where they've played their hilarious duo Jay and Silent Bob in several of Smith's movies.\n\n\n\nHe wrote in the caption: '25 yrs ago yesterday, my first film CLERKS debuted in limited release on 2 screens in N.Y.C. and L.A.!\n\n'So to celebrate a quarter of a century in the movie business, the @jayandsilentbob #RebootRoadshow Tour kicked off last night in N.J. at the #paramounttheatre on the world famous @theasburyparkboardwalk!'\n\nThe writer/director/actor also announced that he's reopening his SModcastle, where he'll records podcasts and hold other entertainment-related events, at the iconic location.\n\nDynamic duo: The old pals posed for photos in the store and on the wall outside, where they've played their hilarious duo Jay and Silent Bob in several of Smith's movies\n\nLimited release: He wrote in the caption: '25 yrs ago yesterday, my first film CLERKS debuted in limited release on 2 screens in N.Y.C. and L.A.!'\n\nReboot vibes: The night before, they hosted a screening of Jay and Silent Bob Reboot at Paramount Theatre on the Asbury Park Boardwalk\n\nBreaking ground: The writer/director/actor also announced that he's reopening his SModcastle, where he'll records podcasts and hold other entertainment-related events\n\nWhere it began: The new spot will break ground at the iconic location: 'And where else could be more appropriate than the building that started it all? So next month, @odblues7 starts construction inside 64 Leonard Ave - the opposite end of the Quick Stop building!'\n\nSmith wrote: 'And where else could be more appropriate than the building that started it all? So next month, @odblues7 starts construction inside 64 Leonard Ave - the opposite end of the Quick Stop building!'\n\nHe added: 'And you’ll buy your food and drinks at #quickstop - the font from which all my blessings flowed and the spot where the ley lines crossed to create Clerks! After 25 years, I think it’s now safe to say I *am* supposed to be here today!'\n\nSmith actually worked at the convenient store during the day, filming his breakout masterpiece at night.\n\nIt followed a day in the life of Dante (Brian O'Halloran), who was roped into working at the Quick Stop on his day off, and his friend Randal (Jeff Anderson), who worked at RST Video next door.\n\nDay job: Smith actually worked at the convenient store during the day, filming his breakout masterpiece at night\n\nWorkplace comedy: It followed a day in the life of Dante (Brian O'Halloran), who was roped into working at the Quick Stop on his day off, and his friend Randal (Jeff Anderson), who worked at RST Video next door\n\nBest buds: After Clerks, he and Mewes revived their characters Jay and Silent Bob for Mallrats, Chasing Amy, Dogma, Jay and Silent Bob Strike Back and Clerks II\n\nThe low-budget film grossed $3.2 million at the box office, sparking a cult following and multiple other films.\n\nHe and Mewes revived their characters Jay and Silent Bob for Mallrats, Chasing Amy, Dogma, Jay and Silent Bob Strike Back and Clerks II.\n\nMost recently, they reunited with a long list of actors they've previously collaborated with (including Ben Affleck, Matt Damon, Rosario Dawson and James Van Der Beek) for Jay and Silent Bob Reboot.\n\nSmith is getting the gang back together once again for Clerks III, which begins filming next year.", "description": "The writer/director/actor also announced that he's reopening his SModcastle, where he'll records podcasts and hold other entertainment-related events, at the iconic location.", "authors": ["Glenn Garner For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/03/19973488-0-image-a-67_1571623318307.jpg", "published_at": "2019-10-21"}