{"pub": "yahoo", "url": "https://news.yahoo.com/prince-harry-meghan-meet-kids-wellchild-awards-gala-182014170--abc-news-celebrities.html", "downloaded_at": "2019-10-17 14:37:26.760585+00:00", "title": "Prince Harry and Meghan talk baby Archie at gala for kids with serious illnesses", "language": "en", "text": "Prince Harry and Meghan talk baby Archie at gala for kids with serious illnesses originally appeared on goodmorningamerica.com\n\nPrince Harry and Meghan, the Duke and Duchess of Sussex, made their first joint appearance since their South Africa tour to attend the WellChild Awards, an awards ceremony for kids with serious illnesses and their caregivers.\n\nHarry and Meghan met one-on-one with three of the night's winners, a 16-year-old boy who cares for his younger brother, a 12-year-old girl with cerebral palsy and a 6-year-old boy diagnosed with leukemia last year.\n\nThe Duke and Duchess of Sussex meeting WellChild Award winners Dexter, William and Mia. #WellChildAwards @GSK pic.twitter.com/IKGdWonOpP — WellChild (@WellChild) October 15, 2019\n\nWhile talking to the 12-year-old girl, Milly Sutherland, Harry bonded with her over both being redheads while Meghan shared that she had just taken the couple's 5-month-old son Archie to his first playgroup.\n\n\"I just took Archie for his first class,\" Meghan said, according to ABC News royal contributor Omid Scobie. \"It was a lot of fun. He loved it.”\n\nPHOTO: Britain's Prince Harry, Duke of Sussex, and Meghan, Duchess of Sussex are greeted upon their arrival for the WellChild Awards in London, Oct. 15, 2019. (Tolga Akmen/AFP via Getty Images) More\n\nHarry is patron of WellChild, which describes itself as the \"national UK children's charity helping to get seriously ill children and young people out of hospital and home to their families.\"\n\n(MORE: Prince Harry retraces his mom Princess Diana's footsteps at Angola landmine field)\n\nThe Duke of Sussex delivered a poignant speech in which he said attending the event and meeting the families \"pulls at my heart strings in a way I could have never understood until I had a child of my own.\"\n\n“Last year when my wife and I attended we knew we were expecting our first child. No one else did at the time, but we did,\" Harry said. \"And I remember squeezing Meghan’s hand so tight during the awards, both of us thinking what it would be like to be parents one day and, more so, what it would be like to do everything we could to protect and help our child should they be born with immediate challenges or become unwell over time.\"\n\nSpeaking at the WellChild awards, this is the moment the Duke of Sussex broke down with emotion as he paid tribute to \"inspirational\" children pic.twitter.com/lZgIaMWT13 — PA Media (@PA) October 15, 2019\n\n\"And now, as parents, being here and speaking to all of you pulls at my heart strings in a way I could have never understood until I had a child of my own,\" he said.\n\nTouching words from a moved Prince Harry, who has just handed out the awards to @WellChild’s youngest inspirational child winners. As a new father, this year’s #WellChildAwards means even more to him... pic.twitter.com/GqDm6To8lW — Omid Scobie (@scobie) October 15, 2019\n\nMeghan's dark green dress for the awards ceremony in London was nearly identical in shade to the evening gown her sister-in-law Duchess Kate wore Tuesday night at a reception in Pakistan.\n\nPHOTO: Left, Meghan, Duchess of Sussex wearing a green dress to an event in London, Oct. 15, 2019, and right, Catherine, Duchess of Cambridge, wearing a green dress during a visit to Pakistan on the same day. (AFP/Getty Images, Pool via Reuters) More\n\nMeghan's dress for the event also appears to be the same one she wore for a joint interview she and Harry did after their engagement was announced in November 2017.\n\nPHOTO: Britain's Prince Harry and his fiancee, U.S. actress Meghan Markle give their first interview following their engagement, Nov. 27, 2017. (Pool via Kensington Palace) More\n\nMeghan has made a fashion statement recently by recycling some of her old looks, including on at least three occasions on the couple's recent 10-day tour of South Africa.", "description": "Prince Harry and Meghan, the Duke and Duchess of Sussex, made their first joint appearance since their South Africa tour to attend the WellChild Awards, an awards ceremony for kids with serious illnesses and their caregivers.  Harry and Meghan met one-on-one with three of the night's winners, a 16", "authors": ["Katie Kindelan"], "top_image": "https://s.yimg.com/uu/api/res/1.2/9EsH778NxWT_XzFaCHnlWg--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.gma.com/meghan-harry-wellchild-sh-ps-191015_hpMain_16x9_992.jpg", "published_at": "2019-10-15"}