{"pub": "independent", "url": "https://independent.co.uk/voices/sajid-javid-boris-johnson-spending-review-dominic-cummings-a9091951.html", "downloaded_at": "2019-09-04 23:48:14.664840+00:00", "published_at": "2019-09-04", "title": "Javid delivers the worst performance in parliament I’ve ever seen – and the substance was no better", "language": "en", "text": "Today’s spending round was unworthy of the name. It was, in reality, little more than a cynical pre-election stunt drawn up in the hope that taxpayers will fall for the mafiosi at the top of the British government bribing them with their own money.\n\nUsually I’d try to offer some financial and economic analysis of the announcement; looking at what the chancellor was trying to do with this or that, what they missed, what the implications were for the public finances, the economy, and so on.\n\nWith this, hurried out before the Office for Budget Responsibility had the chance to downgrade its economic forecasts in response to the latest fairly dreadful data, there’s really no point.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nDon Dominic Cummings and his underboss Don Boris Johnson looked at the polling data, marked the areas of concern to voters, and sent Sajid Javid out to deliver it to a parliament the pair hold in contempt.\n\nIt’s a plan, like most of the ones they’ve cooked up, that didn’t work out too well.\n\nShape Created with Sketch. Protesters take to streets after Boris Johnson suspends parliament Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Protesters take to streets after Boris Johnson suspends parliament 1/11 Anti Brexit protesters march on Whitehall EPA 2/11 Many of the protesters carried placards AP 3/11 A demonstrator wears a Boris Johnson mask during a London rally AFP/Getty Images 4/11 An anti-Brexit demonstrator wields an EU flag during a London rally. AFP/Getty Images 5/11 The protesters also marched to Trafalgar Square, where they blocked traffic AP 6/11 John McDonnell addressed crowds in Whitehall. PA 7/11 A small group of Brexit supporters attempted to stage a counter protest in central London. AP 8/11 Three people were arrested in London, including a woman who sat on the road near Trafalgar Square. AP 9/11 In Oxford, locals and students gathered outside Balliol College, Boris Johnson's alma mater, to protest. PA 10/11 Thousands of people gather in central Glasgow to protest against the prime minister. AFP/Getty Images 11/11 Jeremy Corbyn spoke to protesters in central Glasgow. Getty 1/11 Anti Brexit protesters march on Whitehall EPA 2/11 Many of the protesters carried placards AP 3/11 A demonstrator wears a Boris Johnson mask during a London rally AFP/Getty Images 4/11 An anti-Brexit demonstrator wields an EU flag during a London rally. AFP/Getty Images 5/11 The protesters also marched to Trafalgar Square, where they blocked traffic AP 6/11 John McDonnell addressed crowds in Whitehall. PA 7/11 A small group of Brexit supporters attempted to stage a counter protest in central London. AP 8/11 Three people were arrested in London, including a woman who sat on the road near Trafalgar Square. AP 9/11 In Oxford, locals and students gathered outside Balliol College, Boris Johnson's alma mater, to protest. PA 10/11 Thousands of people gather in central Glasgow to protest against the prime minister. AFP/Getty Images 11/11 Jeremy Corbyn spoke to protesters in central Glasgow. Getty\n\nNo one would ever pretend Javid was a gifted orator.\n\nBut his stilted performance on his first big event was so bad it made his predecessor “Spreadsheet Phil” Hammond look like the charismatic god of numbers by comparison.\n\nThis was Stumbling Saj at his worst.\n\nHe’d been told to let loose the billions and you might have thought that spraying great chunks of other people’s money around would have been a novel and exciting experience for a former banker turned Tory chancellor.\n\nHere’s some billions for education. Here’s some for social care. Here’s some for defence. Veterans, rough sleepers, youth services, we love all of you. You can have some cash too.\n\nYet despite being ordered to cough up that trolley full of sweets, Javid looked for all the world as if he was the bloke in the corner with no mates at the accountants’ annual ball.\n\nIn 20 years of watching these things I can honestly say I have never seen a worse performance. Dismal doesn’t even begin to describe it.\n\nIt took him five minutes or so just to get to the subject of spending. First we had to listen to him saying exactly the same thing as Boris Johnson’s been saying about Brexit, for which read: telling the same lies.\n\nJohn Bercow, the speaker, had to intervene twice to tell him to get on with the business in hand.\n\nHe nonetheless ploughed on with desperate stuff about how awesome the UK economy is when it actuality shrank in the second quarter and is looking more likely to fall into a full-scale Brexit recession courtesy of him and his colleagues by the day.\n\nWhen he finally got around to some actual spending pledges, he drew ironic cheers.\n\nEven they died when the detail finally emerged.\n\nIt was half arsed even as bribes go, just some numbers plucked out of the air in an attempt to show the public that the Tory party has been reshaped in Don Dominic’s image and will now pretend it cares about the little guy as well as Brexit.\n\nExcept it doesn’t. John Appleby, chief economist at the Nuffield Trust, summed it up when he described the spending review as “a missed opportunity to turn around years of cuts to the crucial budgets that support the NHS and the patients who depend on it”. But the criticisms weren’t just about health.\n\nAusterity, John McDonnell correctly stated, was a choice not a necessity and a new chancellor claiming to end it delivered nothing more than a “compendium of meaningless platitudes”. They will all be under threat in the event of a no-deal Brexit anyway, on which he wasted yet another £2bn.\n\nMcDonnell wasn’t at his best but he didn’t need to be. A half dead rabbit would have looked good by comparison to Javid.\n\nBut perhaps the chancellor’s lack of conviction shouldn’t come as a great surprise. It was noted that he was deprived of a media guru when Don Dominic had his aide Sonia Khan removed from Downing Street by a gun-toting copper. But he didn’t really need one. He is little more than a PR man for his bosses.\n\nHe’d better step up his game as regards to that or he’ll find that he’s next out of the building, perhaps in the gun-toting company of one of the new officers Johnson wants to hire to polish up his law-and-order credentials.", "description": "Today’s spending round was unworthy of the name. It was, in reality, little more than a cynical pre-election stunt drawn up in the hope that taxpayers will fall for the mafiosi at the top of the British government bribing them with their own money.  Usually I’d try to offer some financial and economic analysis of the announcement; looking at what the chancellor was trying to", "authors": ["James Moore"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/04/14/Sajid-Javid.jpg"}