{"pub": "scmp", "url": "https://scmp.com/sport/outdoor/trail-running/article/3033686/moontrekker-shows-everything-unique-about-hong-kongs", "downloaded_at": "2019-10-19 11:03:22.082280+00:00", "title": "Moontrekker shows everything unique about Hong Kong's trail running scene, as team racing becomes a natural extension of community", "language": "en", "text": "I was first introduced to trail running when my girlfriend ran the Barclays Moontrekker and the Oxfam Trailwalker six years ago, in our first year in Hong Kong.\n\nIt is a story similar to many Hongkongers, who arrive and somehow find themselves skipping out the building process, instead going straight to the 100-kilometres mountain distance, using Moontrekker as a warm-up.\n\nThe introduction normalises a great deal about the Hong Kong trail scene, and it wasn't until years later that I reflected upon its uniqueness.\n\nThe idea of running in teams is commonplace in Hong Kong – the Moontrekker has solos, pairs and fours, the Trailwalker is exclusively for four-person teams, but there is a host of other races. The Country of Origin is for three-person teams, the 45km Mac Challenge has different group options, and the list goes on.\n\nAs a reporter, I've watched as teams and pairs have managed their dynamics while one member bonks as another member feels great and wants to fly, only for their moods to reverse 20km later.\n\nWhen Jim Walmsley, the world's No 1-ranked trail runner, was in town earlier this year, he ran in a pair in the Valentine's Day Race.\n\n“The pairs aspect was interesting,” he said. How did it compare to other pairs races, I asked? “I've never run a pairs race,” he said. “Nope, never heard of one.”\n\nNot even heard of one?!\n\nWhen I told him about Trailwalker he seemed gobsmacked (and tempted) at the idea of a major race in a team. When I said that loads of races here are for teams he was surprised to say the least.\n\nThat's when I realised that our love of teams in Hong Kong is abnormal. Other countries may have one or two races as a novelty or for a massive distance like the 300km PTL in France, but here team running is the centre of our universe – the winner of Trailwalker is always front page news.\n\nBut, having always been on the finish line to report on the winners, I'd never experienced a team race myself at any of the major events. So when a friend asked last minute if I'd join his Moontrekker team I jumped at the opportunity.\n\nI wanted to write about the team dynamics so people outside Hong Kong could get a glimpse into our world, but what I found was far better. Our eclectic crew – David Batchelor, Charlie Landale, Dennis Philipse and myself – bolted out into the night for the 40km Moontrekker across Lantau on Friday night.\n\nWe passed a bar where I saw a woman I'd once met atop a hill during Trailwalker, who'd carried champagne up to spend her afternoon watching runners suffering. She spotted me and was ecstatic to see I was running and not reporting this time. “You're doing it!!” she screamed as she grabbed my hand.\n\nLandale seemed the most social man on the trail, bumping into friends left, right and centre. I was met by hugs and high fives when I crossed paths with runners and volunteers I'd written stories about over the years.\n\nPhilipse was stopping for selfies as he saw friends who had helped him bring the Gay Games to Hong Kong. Batchelor was catching up with old acquaintances who'd appear out of the darkness and disappear again as a bobbing light in the distance.\n\nLandale spotted another friend – Georgia Masefield – who was running on her own. We soon adopted her as our fifth teammate.\n\nAs our team ebbed and flowed, and we had to adjust our speeds to meet the highs and lows of each member, so too did Masefield slow for us or we'd slow for her, depending on who was feeling strong at any given time. Our finishing time was not beholden to her, or vice versa, but she was now our team member, and that's what teams do.\n\nSeeing all the camaraderie spontaneously manifest itself throughout the event, not within our preset team, but with everyone we knew and our fifth unofficial team member, made me realise why Hong Kong is obsessed with team races.\n\nThe community is so tightly knit that team racing is a natural extension of our trail's culture. There are no other countries in the world where there are so many races and runners in such a small area.\n\nIt's reflected elsewhere perhaps, in places such as Chamonix or Boulder, Colorado, but they are bubbles within a wider scene. This bubble is the scene in Hong Kong.\n\nAs our team grew from four to five, it struck me: our obsession with running races where you are forced to help each other in the pursuit of a collective time is the most natural thing in the world for a community that is already so tightly bound together by geography.\n\nWhat's more, there is no major city in the world with trails so accessible. Mooontrekker highlights that as bankers, lawyers, teachers, journalists and every other profession leave their desks in the middle of one of the busiest cities in the world at 6pm on a Friday, and are on the start line of a secluded night time race over a 1,000m-high mountain by 8pm.\n\nWhat an amazing experience, and a privilege to be mixed into such an awesome community. Long live the team racing.", "description": "Team races are novelties in the rest of the trail world\n  But they’re are at the centre of Hong Kong’s running universe and that’s a natural extension of our culture", "authors": ["Mark Agnew"], "top_image": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2019/10/19/1ea4220c-f231-11e9-9f3d-785f2d889e39_image_hires_135910.jpg?itok=aJ97XmMy&v=1571464758", "published_at": "2019-10-19"}