{"pub": "abcnews", "url": "https://abcnews.go.com/International/local-election-sparked-moscows-summer-protest/story?id=65438725", "downloaded_at": "2019-09-07 13:35:18.829816+00:00", "published_at": "2019-09-07", "title": "How a local election sparked Moscow's summer of protest", "language": "en", "text": "Moscow will hold its city council elections on Sunday, a normally little-noticed vote that this year has sparked a summer of protests in the Russian capital.\n\nIn mid-July, election authorities refused to register a group of opposition candidates, among them some of Russia’s best-known activists. Since then, on most Saturdays over the last month, a scene has played out in Moscow’s city center: Several thousand demonstrators attempt to gather, demanding fair elections, only to be violently confronted by riot police who arrest them en masse.\n\nThe anti-Kremlin opposition has succeeded in turning the council elections into a flashpoint, bringing thousands of people into the streets in demonstrations that showcase authorities’ intolerance of political dissent.\n\nThe elections are not significant in themselves, as Moscow’s city council has only limited power. But for Alexey Navalny, Russia's best-known opposition leader, and his allies, they represent an opportunity to play to what they see as the Kremlin’s weak spot.\n\nWhile President Vladimir Putin remains popular, his ruling party, United Russia has become toxic. A poll by the state-run VTsIOM agency in May found that only 22% of Muscovites would vote for it.\n\nAndrei Vasilyev/TASS via ZUMA Press\n\nSo unpopular is the party in Moscow that in these elections, it has been running many of its candidates without identifying them as members. To counter this, protesters have been pasting “danger United Russia\" stickers onto those candidates’ election posters.\n\nNavalny has called on people to consider the Moscow elections a “referendum” on United Russia, hoping it will help undermine the image of Putin’s popularity nationally and showcase what Navalny says is Russia's rigged political system. Aware the opposition would likely not be allowed to run, Navalny has promoted a new approach: tactical voting. His group has calculated a list of candidates most likely to beat United Russia’s in each district and urged people to vote for them.\n\n“Elections where our normal candidates aren’t allowed to run will always be unpleasant. But even such elections can be used to deliver a blow against the authorities,” Navalny wrote on his blog.\n\nEpsilon/Oleg Nikishin/Epsilon/Getty Images, FILE\n\nIt is unclear whether Navalny’s tactical voting will have an impact. In practice though, the tactical voting means mostly supporting the Communist Party, which has split liberal Russians unwilling to vote for the party that led the Soviet Union and which now acts as a tame opposition to the Kremlin.\n\nRough treatment of protesters in Moscow is not unusual, but the police response this year has been exceptionally harsh.\n\nHundreds of heavily-armored police wearing masks and wielding clubs have marched on demonstrators, seemingly arresting people almost at random. On July 27 and Aug. 3, well over a thousand people were detained each day.\n\nSo indiscriminate were the arrests that passersby found themselves dragged off by police. One man who happened to be jogging past the Moscow mayor’s office had his leg broken when officers pulled him to the ground.\n\nPolice also repeatedly raided opposition leaders’ homes and their offices. By mid-August, most key opposition leaders had been temporarily jailed.\n\nThe crackdown has had the effect of fueling the protests, which initially attracted several thousand people. When authorities authorized a protest after two weekends of mass arrests, 60,000 people joined -- the largest anti-Kremlin rally in eight years.\n\nState media has painted the peaceful demonstrations as violent riots, producing heavily edited reports to show protesters as aggressive.\n\nPolice also opened a series of criminal trials against ordinary demonstrators on rioting charges. This week, courts jailed five men arrested during the protests, convicting three of violence against police. Konstantin Kotov, a 34-year-old programmer, was sentenced to 4.5 years in a penal colony for repeatedly attending an unauthorized protest.\n\nAlexander Zemlianichenko/AP, FILE\n\nThere also seems to have been a change in the protesters, many of whom no longer seem to fear arrest and the typical 15- to 30-day jail sentence and fine.\n\n“I think there’s been a drastic change in attitudes from both the authorities and the people,” Artem Troitsky, a well-known music critic, told ABC News during the Aug. 3 protest. “People are not afraid of being arrested. They’ve had enough of this regime.”\n\nThe protests seem likely to peter out after election day on Sept. 8. The most recent one attracted a smaller crowd. But observers in Russia believe the protests have exposed cracks in Russia's system of controlled elections.\n\n“When people cease to agree that it’s set up like this and cannot be otherwise, the machine starts to fall apart at the seams in the literal sense of the expression,” said Ekaterina Schulman, a political scientist and member of Putin's presidential human rights council.\n\n\"For now, it’s holding. How much will it hold, we will see on Sept. 8,” she said on the radio station Echo of Moscow. “But it's encountering obstacles in its functioning that are hard for it to overcome.”", "description": "Moscow will hold its city council elections on Sunday, a normally little-noticed vote that this year has sparked a summer of protests in the Russian capital.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/moscow-protests-01-file-ap-jef-190903_hpMain_2_16x9_992.jpg"}