{"pub": "businessinsider", "url": "https://pedestrian.tv/news/rip-curl-kathmandu-sale", "downloaded_at": "2019-10-01 04:30:09.818737+00:00", "title": "Kathmandu, Puffer Vest Kings, Just Purchased Rip Curl For A Lazy $350 Million", "language": "en", "text": "In wild news that’s probably gonna be great for those of you who love both wetsuits and puffer vests, the beyond-iconic Australian surf brand Rip Curl has been sold off to New Zealand-based outdoor clothing company Kathmandu for a hefty $350 million, marking the first time in the company’s 50-year history that ownership has changed hands.\n\nBrian Singer and Doug Warbick, the duo who founded the company in 1969, had made repeated attempts in recent years to sell their ownership of the company off. But today’s deal now marks the first time in the Rip Curl’s history that the company will not be under private, independent ownership.\n\nUnder the deal, Singer and Warbick – who each owned 35.5% of the company – and current Rip Curl CEO Michael Daly will also receive various portions of 10.9 million shares in Kathmandu stock, which is currently worth somewhere around $31 million.\n\nPreviously, Singer and Warbick had attempted to sell off their stake in Rip Curl at least twice before, with a $500 million sale in 2012 not eventuating, and a $400 million attempt in 2017 ultimately falling through.\n\nREAD MORE Billabong's Collab With Blogger Sincerely Jules Is Here To Extend Your Summer\n\nIn a statement published on the Rip Curl website, Singer and Warbick stated that the sale was an “emotional event” for them, but that they realise their “baby has grown into an adult recognised all over the planet.”\n\n“After 50 years it’s an emotional event for us. Surfing and the surf industry has been an integral part of our lives for more than 50 years. We realise, Rip Curl, our baby has grown into an adult recognised all over the planet and we are proud that we have created one of the world’s great brands. We are confident the crew at Rip Curl will continue to look after the brand and products into the future. We look forward to supporting the crew on this journey.”\n\nThe purchase of Rip Curl follows on from Kathmandu’s acquisition of US-based hiking boots brand Oboz, which they purchased for around $70 million in early 2018. Combined, the three brands are set to push Kathmandu’s overall annual revenue above $1 billion for the first time in company history.", "description": "Iconic Australian surf brand Rip Curl has been sold off to NZ outdoor group Kathmandu, with the sale attracting a price tag of a lazy $350 million.", "authors": ["Cam Tyeson"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/10/rip-curl.jpg", "published_at": "2019-10-01"}