{"pub": "bbc", "url": "https://bbc.com/travel/story/20191007-brazil-the-last-frontier-of-gastronomy", "downloaded_at": "2019-10-07 23:33:14.957654+00:00", "title": "Brazil: The last frontier of gastronomy?", "language": "en", "text": "Chefs and researchers are stunned: those ancient tales of little-known South American flora with magical-sounding properties turned out to be true.\n\nJambú, for example, a grassy-flavoured herb that traditional cooks pair with duck is also a tingling anaesthetic. “Here we say, ‘it makes you tremble’,” revealed Joanna Martins, head of the Paulo Martins Institute for the study of indigenous and Amazonian ingredients. Scientists are investigating the plant for use in toothpaste, pharmaceuticals and even erotic wares, she said.\n\nCrajiru vine, whose leaves are consumed as a tea and is also used as body paint, impresses agronomist and farmer Keila Malvezzi da Silva for its ability to increase iron absorption.\n\nAnd many chefs are fascinated by ora-pro-nobis, a member of the cactus family known as “poor people’s meat” for its 25% protein content and for having four times the Vitamin C of oranges.\n\nYou may also be interested in:\n\n• The Amazon in Brazil is on fire – how bad is it?\n\n• The acai seller who got a record deal\n\n• A plan to preserve Peru’s prized vicuna\n\n“These [indigenous] communities possess a profound knowledge of the forest – an understanding we haven’t even dreamed of,” said chef Alex Atala. A former punk-rocker, Atala is as renowned for his study of Brazil’s indigenous ingredients as for restaurant D.O.M.’s two Michelin stars.\n\nWhen I entered the São Paulo restaurant’s dining room, I saw bare glass tables supported by tree stumps, decor ranging from tomes by French chef August Escoffier to Elvis albums, and guests sporting suits and T-shirts, pearls and tattoos. I got the distinct sense that nothing here was going to be ordinary.\n\nBut after consuming intriguing, yet accessible, locally inspired dishes such as flower “ceviche” made with stingless bee honey and humped-backed Zebu beef, so tender it’s served with a spoon, I was stopped dead in my tracks by dessert: there were ants on my plate. I closed my eyes and downed the first little creature. After the disquieting sensation of scratchy legs brushing my throat came a surprise in the form of a mouth-filling burst of citrus and ginger. My gastronomic journey to Brazil had begun with a bungee jump out of my comfort zone.\n\nBrazil is a vast, fecund land, with much of the most remote parts of its 8.5 million sq km known only to inhabitants of indigenous communities and quilombos, settlements created by former African slaves. Brazil is said to possess 20% of the Earth’s species, which compels the food community to learn all it can.\n\nFor Catalan chef Ferran Adrià, considered one of the world’s best and most pioneering chefs, the Amazon is “the last frontier of gastronomy”.\n\nYet, this still-unlocked treasure chest – that is deeply embedded in rural Brazilian culture and is the economic support system of many villages – is being threatened by devastating forest fires, cattle ranching, mining, logging and other forms of human intrusion.\n\nThese indigenous communities possess a profound knowledge of the forest – an understanding we haven’t even dreamed of\n\nSome worry that the proliferation of processed food is threatening indigenous cuisine. “The fast food movement broke into our way of feeding ourselves and we have to reverse that,” said chef Irene Nunes, who runs the hillside Caminho das Gerais restaurant several hours from São Paulo, where she puts her own twist on rustic cuisine.\n\nIn an effort to save the country’s endangered products and culinary skills before they vanish, Brazil’s most prominent gastronomy professionals are taking action. Near the end of 2018, Georges Schnyder, head of Slow Food Brasil, proclaimed the Pledge in Defense of the Culinary Culture of Brasil. Akin to the 2004 Manifesto for the New Nordic Kitchen signed by 12 Nordic chefs, including world-renowned Danish chef René Redzepi, it reaches far beyond cuisine to preserve this country’s agrarian roots.\n\n“Cooking is not about having a recipe,” Schnyder asserted. “It’s culture, it’s sustainability, and this ‘manifesto’ is designed to recognise family growers as the basis of the food chain, and assure that their children can remain in the fields.”\n\nAs fires rage in the Amazon, the need to act is even more pressing. According to Atala, “There is a significant increase in deforested areas, and we must deal with this problem responsibly and not turn the issue into an ideological dispute.”\n\nPreserving traditions\n\nIn support of the Pledge, many chefs are launching parallel careers as explorers, travelling deep into the country’s hinterlands to find and help preserve indigenous plants and artisan products by using them in their restaurants – often elevating or transforming them – and which in turn supports local producers.\n\nIn São Paolo, there’s a futuristic air to Michelin-starred Maní, where model-turned-chef Helena Rizzo transforms local ingredients like manioc (cassava) into such uniquely daring dishes that patrons wait willingly for hours to eat. Rizzo has said she feels it’s crazy to think that 90% of the world’s diet comes from only a handful of species such as corn, rice and wheat. “Ingredients like arrowroot and mangarito [a relative of the yam], are important not only as ingredients but as a part of culture and food biodiversity. We still can find and cook with them, but I don’t know until when. We have already lost so many ingredients...”\n\nMany of Brazil’s food experts believe that manioc is the foundation of the country’s cuisine. Its myriad monikers, such as mani, maniva, aipim, mandioca and macaxeira, and countless by-products, including tapioca, polvilhos (tapioca flour), tucupí (a yellow sauce) and tiquira (an alcoholic beverage), are a testament to its ubiquity. While not yet endangered, manioc is so crucial to Brazilian cuisine that the Pledge specifically cites it as “the iconic product of our ancestral and indigenous culture”.\n\n“It’s the one ingredient that has always been present in all social classes,” said Atala. “We peel it, grate it and press it to obtain a starch [that] we call tapioca. When fermented, the broth becomes tucupí, and the pulp is transformed into manioc flour. Its versatility is impressive.”\n\nChef Tereza Paim’s Salvador restaurant is another safe harbour for traditional foods. At Casa de Tereza, she uses hand-drawn dendê oil (palm oil), turning any left over from cooking into soap for customers and employees to use. She believes that this oil, brought to Brazil by the Portuguese from Africa during the slave trade, is an ingredient that must never be lost, as its distinctive scent of violets and wine-red colour is a hallmark of traditional Brazilian cuisine, particularly in Bahia state.\n\nShe calls it “number one of my heart”, and sees its reddish hue as “painting our food with the colour palette of sunset at All Saints Bay”, the body of water fringing part of the city of Salvador, where food and culture imported during the slave era still thrive. According to Paim, local dendê oil “tells us every day that we are Afro-descendants”.\n\nA mixed heritage\n\nBrazilians are immensely proud of their multi-ethnic heritage. It’s a country inhabited by people of widely diverse backgrounds, from Africa, Asia, Europe and the Middle East, along with more than 200 indigenous populations who also come from vastly different regions ranging from the Amazon’s rainforests to the savannas of the Cerrado to the watery Pantanal. All of their culinary wisdom has co-mingled to create a unique mother cuisine that modern Brazilian gastronomy advocates aim to honour, preserve and evolve for the future.\n\nJust as Brazil’s population has come from all over the globe, so have many of its ingredients and cooking techniques. The seeds of guandu beans, for example, which improve the soil and add nitrogen to crops, are thought to have arrived hidden in the hair of slaves, said agronomist Malvezzi da Silva. And, according to Paim, the first “Brazilian” cooks were slaves in the kitchens of Portuguese nobility, who creatively adapted Portuguese, African and indigenous cuisines to available ingredients.\n\nIndeed, some foods became a secret language for these slaves, who created sanctified dishes for Candomblé, a religion with African roots. According to chef Bel Coelho, these preparations are considered so sacred that they can only be cooked by a yabasse, a woman who has dedicated her life to learning the highly specific preferences of each Orixá, or representative of the Candomblé deity. The closest visitors may get to experiencing this fare is through tasting dinners at Coelho’s São Paulo restaurant Clandestino, where she has devised her own recipes inspired by yabasse cooks. The restaurant is open only for one week each month; dining is by reservation only; and the exact dates are chosen one month in advance.\n\nChef Telma Shiraishi of São Paulo’s Restaurant Aizomê, and now the Japanese Cuisine Goodwill Ambassador in Brazil, represents another populous group: immigrants from Japan. “Like many others, my grandparents came to Brazil as land workers on the coffee plantations,” she noted. “From my point of view, this country is formed by the fusion of native cultures and those of the varied populations that arrived over the centuries, creating this mosaic.”\n\n“Even people who came in search of riches have left us immense treasures,” said chef Mônica Rangel of restaurant Gosto com Gosto, 200km north-west of Rio de Janeiro.\n\nRangel believes that while they originally came to profit from Brazil’s natural resources, these mostly European people enriched the land by making use of it – such as by raising cattle and starting small cheese factories – and added their own cultural flourishes to traditional Brazilian foods.\n\nThrough its cuisine, Brazil has managed to embrace many cultures and nations. “It’s the kitchen of the tropeiro [drovers always on the move] but also of the court,” said Rangel. “And it is amidst these many historical flavours that the chef finds space to exercise fearless creativity.”\n\nAdapting the past to preserve the future\n\nEven people who came in search of riches have left us immense treasures\n\nThese prescient chefs believe that employing creativity – rather than strictly preserving traditions – will help Brazil’s culinary values endure. Indeed, their Pledge specifically defends “a free, creative cuisine that is open to influences and individual expressions”.\n\nAt Maní, Rizzo is inspired by indigenous peoples’ practice of cooking fish on banana leaf, but substitutes leaf of elephant ear, a nonconventional edible plant in the same family as mangarito. And Shiraishi gives traditional Japanese pickles a Brazilian spin using maxixe, a cucumber brought from Africa during the slave trade, and substituting cachaça (a distilled spirit made from sugarcane) for sake.\n\nSome chefs are transforming indigenous ingredients into otherworldly dishes rarely seen on high-end degustation menus. Coelho, for instance, recreates acarajé, a black-eyed pea and bean dumpling traditionally made for Iansã, the goddess of wind and lightning, using the same ingredients of dendê oil, coconut milk, coriander, chilli and peanuts, but with molecular gastronomy techniques. For her version, Coelho makes a very thin black-eyed pea soup, then adds alginate and calcic, a calcium salt, to create a “liquid sphere”.\n\nPaim addresses modern health concerns with her Shrimp Bobo dish, using manioc and dendê oil to create a creamy stew that is both gluten and lactose free.\n\nGenerally speaking, these Brazilian chefs believe their efforts to preserve and evolve culinary products and practices can have an impact far beyond their restaurant kitchens. And as such, several chefs are laying plans for the future in support of local communities and their ingredients.\n\nChef Ana Bueno of Banana da Terra in Paraty, for example, has established the School of Eating in Paraty to improve the nutrition of schoolchildren and educate them about healthy eating and local agriculture.\n\nPreserving and sharing the food wisdom of our ancestors can offer solutions to some of the most pressing sustainability challenges we face today\n\nAnd Rangel organised the Pinhão Festival to celebrate the nut of the endangered Araucária tree. Over the last 26 years, the fete has grown from a one-woman enterprise at Rangel’s restaurant into a nationally known event that involves 42 restaurants, draws celebrity chefs and has helped transform Brazil’s Visconde de Mauádistrict in the countryside of Rio de Janeiro state into a thriving tourism centre.\n\n“Preserving and sharing the food wisdom of our ancestors can offer solutions to some of the most pressing sustainability challenges we face today,” said chef Manu Buffara, a farmer’s daughter who now runs Restaurant Manu in her native town of Curitiba. “Much of what is lost is forgotten,” she warned, so we must continually revisit our culture and our roots.\n\nYet, even as they respect their country’s culinary roots, Brazil’s chefs thrive on innovation. Inspired to use ancient ingredients in new ways they are galvanising one another, sending a wave of madly inventive cuisine across the country.\n\nThere’s poetry in the way Brazilians speak of food, lifting this basic human need to a far higher plane. In the words of Malvezzi da Silva: “Food is the bond of the human being with nature, through which we are regaining consciousness of who we are and where we should go.”\n\nAncient Eats is a BBC Travel series that puts trendy foods back into their ‘authentic’ context, exploring the cultures and traditions where they were born.\n\nJoin more than three million BBC Travel fans by liking us on Facebook, or follow us on Twitter and Instagram.\n\nIf you liked this story, sign up for the weekly bbc.com features newsletter called \"The Essential List\". A handpicked selection of stories from BBC Future, Culture, Worklife and Travel, delivered to your inbox every Friday.", "description": "As Brazil’s food community unites to help save ancient ingredients, it has inspired new ways to use them, sending a wave of madly inventive cuisine across the country.", "authors": ["Janet Forman"], "top_image": "https://ichef.bbci.co.uk/wwfeatures/live/624_351/images/live/p0/7m/l0/p07ml0cm.jpg", "published_at": "2019-10-07"}