{"pub": "thehill", "url": "https://thehill.com/policy/healthcare/467478-buttigieg-i-never-believed-in-medicare-for-all-that-ends-private-insurance", "downloaded_at": "2019-10-25 21:55:18.433107+00:00", "title": "Buttigieg: I 'never believed' in 'Medicare for All' that ends private insurance", "language": "en", "text": "South Bend, Ind., Mayor Pete Buttigieg Peter (Pete) Paul ButtigiegSaagar Enjeti dismisses Buttigieg over policies: He 'really is a neoliberal shapeshifter' Sanders campaign hits Biden over 'reversal' on super PACs Biden campaign signals openness to super PACs as tool to defeat Trump MORE (D) says that he has “never believed” in ending private insurance, denying charges that he has flipped his position on \"Medicare for All.\"\n\nButtigieg, who is running for president and is attacking his rival Sen. Elizabeth Warren Elizabeth Ann WarrenSanders to release health records by end of year Overnight Health Care — Presented by Partnership for America's Health Care Future — Warren faces tough choices on 'Medicare for All' funding | Dems demand answers on Tom Price's charter flights | Medicaid expansion nears 2020 ballot in Oklahoma Warren faces tough choices on funding 'Medicare for all' MORE (D-Mass.) over her support for Medicare for All, has taken criticism for his own tweet last year when he vowed, “I do favor Medicare for All.”\n\nSeeking to explain that statement, Buttigieg told The Nevada Independent that the meaning of Medicare for All has changed, and what he meant was that everyone should have the option of Medicare, not that everyone should be forced onto it.\n\n“Only in the last few months did it become the case that Medicare for All was defined by politicians to mean ending private insurance, and I’ve never believed that that’s the right pathway,” Buttigieg said in the interview. “I still think that we should move toward an environment of Medicare for All.”\n\nProgressives sharply dispute the idea that the meaning of Medicare for All was unclear before a months ago, noting that Sen. Bernie Sanders Bernie SandersSanders to release health records by end of year Warren faces tough choices on funding 'Medicare for all' Saagar Enjeti dismisses Buttigieg over policies: He 'really is a neoliberal shapeshifter' MORE (I-Vt.) ran for the White House on a Medicare for All bill that replaced private insurance four years ago.\n\nButtigieg also appeared to defend a single-payer system that replaces private insurance in a February appearance on MSNBC, calling single-payer a “compromise position” because doctors and hospitals would still be privately owned.\n\nButtigieg’s campaign says he supports Medicare for All as an end goal but views his optional plan, which he has often called \"Medicare for all who want it,\" as creating a “glide path” to get there.\n\nIn a potentially politically important move, Buttigieg also noted that some unions do not want to give up the health plans that they negotiated in favor of Medicare for All, noting Nevada’s powerful Culinary Union.\n\n“I think the best approach is to make this Medicare option available to everybody, but not command everybody to adopt it, especially I’m thinking of folks like the Culinary workers right here in Nevada,” Buttigieg said in The Nevada Independent interview. “There are a lot of labor union members who have negotiated very good health plans that are part of their compensation, and I don’t think they want to be forced into a plan they don’t know.”", "description": "South Bend, Ind., Mayor Pete Buttigieg (D) says that he has “never believed” in ending private insurance, denying charges that he has flipped his position on \"Medicare for All.\"", "authors": [], "top_image": "https://thehill.com/sites/default/files/buttigiegpete_101019getty.jpg", "published_at": "2019-10-25"}