{"pub": "businessinsider", "url": "https://businessinsider.co.za/former-trump-organization-exec-thinks-trump-will-resign-before-impeachment-2019-10", "downloaded_at": "2019-10-08 09:39:14.971830+00:00", "title": "A former Trump Organisation vice president thinks Donald Trump will resign before getting impeached, just like Nixon did", "language": "en", "text": "Barbara Res, a former Trump Organisation vice president, told CNN's Brian Stelter that she thinks President Trump will resign before the impeachment process is through.\n\nRes argued Trump has a track record of doing \"things to save face.\"\n\nThe move mirrors that of former President Richard Nixon, who resigned from office before his own impeachment following the Watergate scandal.\n\nAs his presidency faces increasing turmoil, Res told CNN she sees Trump's latest political moves as made in a panic.\n\nMost recently, Trump announced that he would pull US forces out of Syria in a rambling Twitter thread, which was met with backlash from other GOP members, including Sen. Lindsey Graham, who is known to stand by the president in the past.\n\nFor more stories go to www.businessinsider.co.za.\n\nA former Trump Organisation executive said she thinks President Trump will resign before the impeachment inquiry, brought on by a whistleblower complaint, is complete.\n\n\n\nThe move mirrors that of former President Richard Nixon, who resigned from office before his own impeachment after the emergence of the Watergate scandal.\n\nBarbara Res, a former Trump Organisation vice president, told CNN's Brian Stelter that Trump may resign, given his previous track record of doing \"things to save face.\"\n\n\"There are some things that he can't control, and he's now at the point where he can't control this,\" Res told CNN. \"He can't do anything about this.\"\n\nLike Nixon, Res told CNN that she thinks impeachment is a worse fate than resigning from office for Trump, which could potentially erode his political reputation.\n\n\"It would be very, very, very bad for him to be impeached,\" Res said. \"I don't know that he would be found guilty, but I don't think he wants to be impeached.\"\n\nSince House Speaker Nancy Pelosi launched an official impeachment inquiry into the president at the end of September, House committees have subpoenaed several Trump officials, and additional whistleblowers have spoken up about the Ukraine scandal.\n\nAfter denying that he withheld military aid to Ukraine in return for an investigation into former Vice President Joe Biden and his son Hunter Biden, Trump subsequently told reporters at the White House that he encouraged China to investigate the Bidens as well.\n\nRes told CNN she sees Trump's latest political moves as made in a panic. On Monday, Trump announced that he would pull US forces out of Syria in a rambling Twitter thread, which was met with backlash from other GOP members, including Sen. Lindsey Graham, who is known to stand by the president in the past.\n\n\"My gut tells me he'll leave office; he'll resign,\" she told CNN. \"Or make some kind of a deal even, depending on what comes out.\"\n\nThis isn't the first time the subject of a potential presidential resignation has been broached. A 2017 article by Quartz written less than a month after Trump took office - noted that the online betting site Ladbrokes said there was a 48% chance Trump would either be impeached or resign before completing his first term.", "description": "The move mirrors that of former President Richard Nixon, who also resigned before he was impeached in the midst of the Watergate scandal in the 70s.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/2861/e90f6698abd04f4986af9d695fc7bd5e.jpg", "published_at": "2019-10-08"}