{"pub": "fox", "url": "https://foxbusiness.com/markets/stocks-bonds-gold-and-oil-on-track-for-record-year", "downloaded_at": "2019-10-27 00:26:54.364225+00:00", "title": "Stocks, bonds, gold and oil on track for record year", "language": "en", "text": "For U.S. investors, 2019 is going from good to great.\n\nContinue Reading Below\n\nThe S&P 500 reclaimed its record closing high on Friday, albeit briefly, as November draws closer, kicking off what is historically the best three-month span for equities.\n\nTicker Security Last Change Change % SP500 S&P 500 3022.55 +12.26 +0.41% I:DJI DOW JONES AVERAGES 26958.06 +152.53 +0.57% I:COMP NASDAQ COMPOSITE INDEX 8243.119014 +57.32 +0.70%\n\nAnd there is more good news: Investors who own bonds, gold and oil are also winning big, according to LPL Senior Market Strategist Ryan Detrick, who describes the performance as “awesome.\"\n\n“As bad as last year was for investors, 2019 is a mirror image, with stocks, bonds, gold, and crude oil all potentially finishing the year up double digits for the first time in history,\" he wrote.\n\nSeveral pockets of the U.S. are performing well, as other economies such as Germany are showing little to no growth.\n\nU.S. corporate earnings, from the likes of Intel and Microsoft, are strong, with nearly 80 percent of S&P 500 companies beating profit expectations and over 60 percent beating revenue goals for the third quarter. The job market is healthy, with unemployment hovering at 3.7 percent, near a 50-year low.\n\nThe strong U.S. consumer is also driving oil demand. \"Drivers have racked up record miles of driving,\" said Phil Flynn of The PRICE Futures Group, a FOX Business contributor. \"This strong demand all of a sudden has removed U.S. oversupply,\" he said.\n\nDespite the decent economy and returns for stocks thus far, some investors including Hayman Capital founder Kyle Bass, are concerned a global slowdown will hurt the U.S. next year.\n\n“China is printing the slowest numbers they’ve had in 35 years. Europe’s IP [industrial production] numbers across the board are not so good,” he said during an appearance this week on FOX Business’s Mornings With Maria. \"There is no way for the U.S. to grow if everyone else is slowing, so I think we will have a short recession.\"\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE", "description": "Investors in four key assets are riding high.", "authors": ["Suzanne O'Halloran"], "top_image": "https://a57.foxnews.com/media.foxbusiness.com/BrightCove/854081161001/201910/158/0/0/854081161001_6097777938001_6097783737001-vs.jpg?ve=1&tl=1", "published_at": "2019-10-25"}