{"pub": "investingcom", "url": "https://investing.com/analysis/fed-preview-dollar-could-be-at-a-turning-point-if-powell-capitulates-200465561", "downloaded_at": "2019-09-18 09:08:35.130641+00:00", "title": "Fed Preview: Dollar Could Be At A Turning Point If Powell Capitulates", "language": "en", "text": "The Fed is expected to deliver a second consecutive in what is still technically considered Powell’s mid-cycle adjustment. The big question for market participants is whether the Fed will commit to more cuts. The bond market is still screaming for more cuts to come, with the yield on Treasuries still well below the Fed funds target range.\n\nOptimism growing for Fed Chair to deliver a dovish cut\n\nWill it be an extended mid-cycle adjustment or an easing cycle?\n\nFed’s Repo move signals more easing tools may be on their way\n\nRecent Fed speak from Rosengren, Williams (NYSE: ) and Kaplan have dampened easing cycle bets, but weakness in the labor market is starting to appear, manufacturing is trending lower, and declining confidence, support calls for a much more accommodative stance. The Fed will also have to look at their peers and decide do they want to disrupt a global wave of easing efforts that is trying to fight off a global slowdown and fend off deflationary pressures.\n\nIf Powell focuses on firming inflation and maintains his reluctance to signal a steady flow of rate cuts and openness to QE down the road, the dollar could surge across the board. If Powell emphasizes the downside risks to the economy and delivers a dovish cut, we could see the punchbowl argument support US equities to make a run at those recent record highs. Further accommodation is likely warranted to thwart off the geopolitical risks that include trade wars, tensions in the Persian Gulf, and even Brexit.\n\nRepo Madness\n\nThe Federal Reserve Bank of New York was forced to take action on Tuesday after risks grew that rates were about to exceed the Fed’s 2.25% upper end of the central banks’ target range. The NY Fed bought $53.2 billion of securities in a repo operation. The sudden surge in the overnight rate on Treasury repurchase agreements meant there was not enough cash to come out of money markets and rates jumped over 8%. This problem shows there is some weakness in the mechanism for setting rates.\n\nThis probably bolsters the case for the Fed to also cut the IOER rate tomorrow. The Fed is losing control of dictating rates and if we see continue to see a glut in collateral, the Fed may be forced to introduce a new tool that aims to equalize collateral and reserves. The other way of fixing this problem would be too deliver enough rate cuts to steepen the US yield curve.\n\nDot Plots\n\nThis Fed meeting could be a turning point for the doves to emerge. The downside risks could warrant some members committing to delivering a few more 25 basis-point cuts, with a majority at least supporting one more cut by year end. The hawkish members of the committee have voiced their concerns, which could mean they are ready to capitulate in joining the doves. They could justify a few more rounds of rate cuts to reduce inversion pressures on the yield curve, but once that is in order and the economy is on firming footing, they can return to tightening.\n\nEUR/USD could fall to fresh 2019 lows if Powell disappoints\n\nMany investors are expecting a massive dollar move following the Fed rate decision. If Powell and company disappoint the rising dovish expectations that market has firmly priced in, we could see fall back to the 1.09 lows that were made after the ECB announced their plans for more QE. A dovish cut that solidifies more rate cuts and possibly QE are down the road could help propel EUR/USD towards 1.1200 handle.\n\nOriginal Post", "description": "Forex Analysis by MarketPulse (Ed Moya) covering: EUR/USD, Williams Companies Inc, United States 10-Year. Read MarketPulse (Ed Moya)'s latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-18"}