{"pub": "independent", "url": "https://independent.co.uk/news/science/asteroid-collide-earth-space-ice-age-biodiversity-geoengineering-a9110271.html", "downloaded_at": "2019-09-18 23:24:00.405144+00:00", "title": "Gigantic asteroid collision 470 million years ago caused Earth to freeze over, scientists say", "language": "en", "text": "Dust from a giant asteroid collision in outer space caused Earth to freeze over, which triggered a bloom in biodiversity 466 million years ago, scientist say.\n\nA 93-mile wide asteroid broke apart between Mars and Jupiter, which flung huge amounts of dust towards Earth, blocking light from the sun and causing dramatic global cooling.\n\nThe dust floated down to Earth over a period of 2 million years, which meant the cooling was gradual enough for species to adapt. New creatures evolved to survive in regions with different temperatures.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIt might be tempting to think humans could carry out geoengineering to create a similar dust shower to combat global warming, but researchers are cautious about such proposals.\n\n“Geoengineering proposals should be evaluated very critically and very carefully, because if something goes wrong things could become worse than before,” said researcher Philipp Heck, a curator at the Field Museum and associate professor at the University of Chicago.\n\nShape Created with Sketch. Space as seen from a Grandmother's garden Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Space as seen from a Grandmother's garden 1/10 Rosette Nebula Captured from the back garden of Guernsey grandmother Jean Dean, this picture was named picture of the day by NASA Jean Dean/SWNS 2/10 Witch's Broom Nebula Captured from the back garden of Guernsey grandmother Jean Dean Jean Dean/SWNS 3/10 Horse Head and Flame Nebulae Captured from the back garden of Guernsey grandmother Jean Dean Jean Dean/SWNS 4/10 California Nebula Captured from the back garden of Guernsey grandmother Jean Dean Jean Dean/SWNS 5/10 Pacman Nebula Captured from the back garden of Guernsey grandmother Jean Dean Jean Dean/SWNS 6/10 Andromeda Galaxy Captured from the back garden of Guernsey grandmother Jean Dean Jean Dean/SWNS 7/10 Iris Nebula Captured from the back garden of Guernsey grandmother Jean Dean Jean Dean/SWNS 8/10 Bodes and Cigar Galaxies Captured from the back garden of Guernsey grandmother Jean Dean Jean Dean/SWNS 9/10 Jean Dean with her Sky-Watcher ESPRIT 80ED telescopic camera Guernsey Press/SWNS 10/10 Jean Dean at home Guernsey Press/SWNS 1/10 Rosette Nebula Captured from the back garden of Guernsey grandmother Jean Dean, this picture was named picture of the day by NASA Jean Dean/SWNS 2/10 Witch's Broom Nebula Captured from the back garden of Guernsey grandmother Jean Dean Jean Dean/SWNS 3/10 Horse Head and Flame Nebulae Captured from the back garden of Guernsey grandmother Jean Dean Jean Dean/SWNS 4/10 California Nebula Captured from the back garden of Guernsey grandmother Jean Dean Jean Dean/SWNS 5/10 Pacman Nebula Captured from the back garden of Guernsey grandmother Jean Dean Jean Dean/SWNS 6/10 Andromeda Galaxy Captured from the back garden of Guernsey grandmother Jean Dean Jean Dean/SWNS 7/10 Iris Nebula Captured from the back garden of Guernsey grandmother Jean Dean Jean Dean/SWNS 8/10 Bodes and Cigar Galaxies Captured from the back garden of Guernsey grandmother Jean Dean Jean Dean/SWNS 9/10 Jean Dean with her Sky-Watcher ESPRIT 80ED telescopic camera Guernsey Press/SWNS 10/10 Jean Dean at home Guernsey Press/SWNS\n\nBefore this research the cause of the ice age was a mystery, according to the paper published in Science Advances.\n\nSpace dust from asteroids and comets is normal – Earth gains about 40,000 tons of extraterrestrial material every year – but the explosion of this asteroid caused it to multiply by a factor of up to 10,000.\n\n“Our hypothesis is that the large amounts of extraterrestrial dust over a timeframe of at least 2 million years played an important role in changing the climate on Earth, contributing to cooling,” said Mr Heck.\n\n“We studied extraterrestrial matter, meteorites and micrometeorites in the sedimentary record of Earth, meaning rocks that were once sea floor,” he said.\n\n“And then we extracted the extraterrestrial matter to discover what it was and where it came from.”\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nThe team extracted extraterrestrial matter by treating the rock with an acid which eats away at the stone. They then looked for elements that rarely appear in rocks on Earth.\n\nFor example, helium atoms normally have two protons, two neutrons and two electrons but some that are shot out from space are missing a neutron. The presence of these helium isotopes – as well as the presence of rare metals often found in asteroids – proves the dust originated from space.\n\nLead author Birger Schmitz from Sweden’s Lund University said: “The timing appears to be perfect. The extra dust in the atmosphere helps explain the ice age – by filtering out sunlight, the dust would have caused global cooling.”\n\nAlthough this cooling proved beneficial to life on Earth, fast-paced climate change can be catastrophic.\n\n“In the global cooling we studied, we’re talking about timescales of millions of years,” Mr Heck said.\n\n“It’s very different from the climate change caused by the meteorite 65 million years ago that killed the dinosaurs, and it’s different from the global warming today – this global cooling was a gentle nudge. There was less stress.”\n\nMr Heck said it was undeniable the world was experiencing global warming.\n\nIn terms of looking at geoengineering options, he said: “We need to think about how we can prevent catastrophic consequences, or minimise them. Any idea that’s reasonable should be explored.”", "description": "Dust from a giant asteroid collision in outer space caused Earth to freeze over, which triggered a bloom in biodiversity 466 million years ago, scientist say. A 93-mile wide asteroid broke apart between Mars and Jupiter, which flung huge amounts of dust towards Earth, blocking light from the sun and causing dramatic global cooling.", "authors": ["Phoebe Weston"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/18/13/asteroid-don-davis-southwest-research-institute.jpg", "published_at": "2019-09-18"}