{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/15/nationals-are-virtually-unbeatable-their-navy-blue-alternate-uniforms", "downloaded_at": "2019-10-15 23:09:25.045157+00:00", "title": "The Nationals are virtually unbeatable in their navy blue alternate uniforms", "language": "en", "text": "The Nationals are 6-0 in their navy blue alternates this postseason, including four consecutive wins since facing elimination in Game 4 of the NLDS against the Dodgers. They’re 1-2 in everything else, including a wild-card game triumph over the Brewers while wearing their regular home whites.\n\nPerhaps leery of jinxing their impressive run, or completely unaware of it (heh), Manager Dave Martinez and his players haven’t talked about their success in their navy uniforms. The good luck that the alternate look has brought the Nationals since the uniform was introduced before the 2018 season is becoming impossible to ignore.\n\nAD\n\nAD\n\nThe Nationals are a ridiculous 23-5, including the postseason, and have outscored opponents, 171-85, when wearing their navy blue jerseys with the white “Nationals” script. They’ve also enjoyed some incredible moments in those threads along the way.\n\nCheck out the new alternate jersey for the 2018 All-Star season! Available now at #NatsWinterfest! pic.twitter.com/SNn4qdeOmf — Nats Team Store (@NatsTeamStore) December 16, 2017\n\nThe Nationals debuted the jerseys, which have primarily been worn for Tuesday home games over the past two years, on April 10, 2018. Stephen Strasburg pitched eight shutout innings and Ryan Zimmerman hit a two-run triple in a 4-1 win over the Braves before a crowd of 19,357.\n\nThe Nationals won their first seven games in their new alternates, according to the uniform tracker on SportsLogos.net. The stretch included a 5-3 win over the Yankees in a game that was started on May 15, suspended by rain and completed on June 18. The Nationals wore their navy blue alternates for the start of the game and red alternates for the conclusion, which included a pinch-hit home run by Juan Soto.\n\nOn July 31, the Nationals scored 19 runs in the first five innings of an eventual 25-4 rout of the Mets.\n\nWashington lost for the first time in its navy alternates on Aug. 7, 2018, a 3-1 setback against the Braves, but finished the year 9-2 when it wore that particular uniform.\n\nWere the lucky navy alternates a one-year wonder? The Nationals dropped their first two games when sporting that look this season, including a 3-2 loss to the Cardinals on April 30.\n\nWashington’s first win in their white script “Nationals” jerseys came in a rare appearance on the road, a 5-2 victory at Cincinnati on June 1 that included a three-run homer by Gerardo Parra. By that time, the Nationals had started to turn their season around after a 19-31 start. Washington wore the same uniforms in its next two games, both wins, and won seven straight in its lucky-again alternates until a 2-0 loss to the Orioles on Aug. 27.\n\nNo team can possibly hate the sight of the Nationals’ navy alternates more than the Mets, though the Cardinals are a close second. Washington’s insane seven-run comeback in the ninth inning on Sept. 3, punctuated by Kurt Suzuki’s walk-off home run, took place in the navy alternates, which look just as good when doused in yellow Gatorade.\n\nWashington finished the regular season 8-3 in its navy alternates with the white “Nationals” script, not to be confused with the navy alternates with the curly “W,” in which they went only 6-7. Despite the wild-card game being played on a Tuesday, the Nationals opted to wear white against the Brewers. They won in thrilling fashion.\n\nAfter being shut out by the Dodgers while wearing their road grays at Dodger Stadium in Game 1 of the NLDS, the Nationals made a sartorial switch for Game 2. The result? A 4-2 win to even the series.\n\nThe Nationals wore their regular home whites in Game 3, a 10-4 loss that left them on the brink of elimination. They went back to the blues the next night and Zimmerman’s three-run home run helped force a deciding Game 5 in Los Angeles.\n\nNavy blue never looked as good on a baseball player as it did when Howie Kendrick rounded the bases after hitting a 10th-inning grand slam to help the Nationals clinch their first postseason series win in team history.\n\nAníbal Sánchez flirted with a no-hitter while wearing navy in the Nationals’ Game 1 win over the Cardinals in the NLCS.\n\nMax Scherzer followed suit in Game 2, a 3-1 Nationals win, during which the right-hander blended into Busch Stadium’s afternoon shadows.\n\nWas there any question the Nationals would be wearing the same uniform when they took the field in D.C. for Game 3?\n\nThe Nationals have won 15 of 17 games, in jerseys of various colors and designs, since Sept. 23. They’re playing like a team that could finish off the Cardinals in the nude, but expect them instead to try to do it in blue. It’s worked out well so far.\n\nAD\n\nAD\n\nIf the Nationals keep winning we are going to see them wearing nothing but navy blue alternate jerseys, amiright? — Todd Radom (@ToddRadom) October 14, 2019\n\nNats are gonna wear out the blue jerseys. — JULIE (@DCSportsMom) October 12, 2019\n\nSo I guess the message was heard and we’re going to keep rocking the Navy Blue National tops! 🤞🏽🤞🏽🤞🏽🤞🏽 one more time to get to the big show! #STAYINTHEFIGHT @Nationals — Washington Effin Redskins (@jokersjinxx) October 15, 2019\n\nRead more on the Nationals:\n\nAD", "description": "Washington’s primary color is red, but the team is riding a navy blue wave this postseason.", "authors": ["Scott Allen", "Reporter Covering D.C. Pro", "Local College Sports"], "top_image": "https://www.washingtonpost.com/resizer/Lwn-NZyhF3_xP8kpOXE_Y527lkU=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/SJYPJKXO44I6TO362IBG5YGBTE.jpg", "published_at": "2019-10-15"}