{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7585247/Jessica-Mulroney-looks-chic-steps-New-York-1-300-plaid-suit.html", "downloaded_at": "2019-10-18 01:24:46.276773+00:00", "title": "Jessica Mulroney looks chic as she steps out in New York in a $1,300 plaid suit", "language": "en", "text": "Jessica Mulroney cut a stylish figure in a three-piece tartan-plaid suit and a pussy-bow blouse as she celebrated her one-year anniversary as a style contributor at Good Morning America.\n\nThe 39-year-old stylist was seen out and about in New York City on Thursday after appearing on the morning show to talk about fall fashion on a budget with anchor Robin Roberts.\n\nIn keeping with the latest trends, she donned a '70s-inspired Smythe suit complete with a waistcoat, but it was far from the budget-friendly looks she was touting.\n\nScroll down for video\n\nOut and about: Jessica Mulroney, 39, was seen walking around New York City on Thursday after appearing on Good Morning American\n\nFall fashion: The stylist donned a three-piece red and navy tartan plaid suit by Smythe, which cost a total of $1,300\n\nWork anniversary: Jessica took to Instagram on Thursday to reveal it's been one year since GMA brought her on as a style contributor\n\nThe label's three matching pieces cost a total of $1,300, with the red and navy plaid blazer retailing for $495 while the matching vest and flared pants sell for $395 and $410, respectively.\n\nWhen she stepped on stage on Thursday, she was wearing just the vest over her navy pussy-bow blouse, but she threw on the blazer when she left the studio later in the day.\n\nJessica wore her long dark hair up in a bouncy ponytail, showing off her gold hoop earrings that matched the buttons on her waistcoat.\n\nThe Canadian style guru accessorized her suit with matching navy pumps and a $2,390 Louis Vuitton Alma PM bag.\n\nKeeping warm: When she appeared on the show, she was wearing just the vest over her navy pussy-bow blouse, but she threw on the blazer when she left the studio later in the day\n\nDone for the day: Jessica flashed a bright smile as she left work on Thursday morning\n\nAdded touches: Jessica wore her long dark hair up in a bouncy ponytail, showing off her gold hoop earrings that matched the buttons on her waistcoat\n\nShe threw on a pair of oversized dark sunglasses and carried her cellphone in her hand as she made her way to the bakery chain Le Pain Quotidien.\n\nJessica made back-to-back appearances on GMA this week, but Thursday's show was particularly special for her.\n\nShe took to Instagram after filming her segment to share a photo of herself on set with Robin earlier in the day.\n\n'I got to celebrate ONE YEAR with the @goodmorningamerica team on the show this morning!' she wrote. 'I’m so blessed to work with hosts, producers and a crew that are always smiling and building me up. More fun to come!! I feel proud today.'\n\nDesigner duds: She accessorized her suit with navy pumps and a $2,390 Louis Vuitton bag\n\nReady for anything: The style expert carried her cellphone in her hand as she made her way through the city streets\n\nQuick bite? Jessica made a pit stop at the bakery chain Le Pain Quotidien\n\nBusy woman: Jessica made back-to-back appearances on GMA this week, and she was seen leaving the studio on Wednesday as well\n\nThe mother-of-three has certainly bonded with her co-workers on the show, and on Wednesday afternoon she hit the gym with GMA meteorologist Ginger Zee for a sweat session.\n\nJessica shared clips that shows them doing planks and lunges while admitting she didn't exactly know what she signed up for when she agreed to take a Body By Mark class with her.\n\n'Ok now I'm really mad at you @ginger_zee,' she captioned the footage, revealing Ginger told her it would be a 'light workout.'\n\nIn another video, Jessica can be seen climbing a rope.\n\nKeeping fit: After appearing on Wednesday's show, she hit the gym with GMA meteorologist Ginger Zee for a sweat session at Body By Mark\n\nSweat sesh: Jessica shared clips from their workout while admitting she didn't exactly know what she signed up for when she agreed to take a Body By Mark class with Ginger\n\n'Haven't done this since high school,' she admitted. 'Thank you @bodybymark. My New favorite NYC workout.'\n\nIt's been a jam-packed couple of days for Jessica, who lives in Canada and flies in when she is filming GMA.\n\nThe wedding expert discussed low-key bachelorette parties on Wednesday's show, which was filmed just a few months after she announced the launch of her new bachelor and bachelorette party planning business.\n\nShe donned an emerald pencil dress with long sleeves and a twisted top, pairing the figure-hugging frock with matching heels, gold hoop earrings, and layers of delicate gold necklaces.\n\nFeeling the burn: Jessica did planks and climbed a rope during the sweat session\n\nWorkout: Jessica admitted that she hasn't climbed a rope since she was in high school\n\nCancelled? After Thursday's taping, Jessica revealed on her Instagram Story that she was having some trouble with her upcoming flight\n\nWhen she left the studio for the day, she threw on a sleek sweater coat in a fall-friendly shade of orange and a matching $1,290 round Gucci shoulder bag.\n\nAfter Thursday's taping, Jessica revealed on her Instagram Story that she was having some trouble with her upcoming flight.\n\n'What is happening? Can somebody talk to me? What about me? Where am I going?' she says with a laugh in the clip, which shows her eating breakfast with her fashion assistant Estelle Zentil and GMA producer Taylor Behrendt Rhodes.\n\n'When [airplane emoji] are getting cancelled, then not cancelled and cancelled again. Please just tell me where I'm going,' she wrote.", "description": "Jessica, 39, was seen walking around New York City on Thursday after appearing on GMA to discuss fall trends on a budget.", "authors": ["Erica Tempesta For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/20/19853726-0-image-a-120_1571339743570.jpg", "published_at": "2019-10-17"}