{"pub": "yahoo", "url": "https://finance.yahoo.com/news/americans-spend-monthly-income-192723245.html", "downloaded_at": "2019-10-05 23:02:13.266361+00:00", "title": "How Do Americans Spend Their Monthly Income?", "language": "en", "text": "After taxes, what is the average American’s monthly income? And, perhaps more importantly, how is that income spent? Finally, how does this differ from generation to generation?\n\nLendEDU looked to answer these questions by surveying 1,000 adult Americans about what their monthly take-home pay is and how those dollars are spent on things like mortgage or insurance payments, and living necessities like groceries.\n\nThe results produced some data points that you would expect; for example, millennials are paying the most each month towards student loans, while that debt is nearly nonexistent for baby boomers.\n\nBut there were also some surprises that go against the traditional narrative, including millennials being the most actively involved in everyday investing, while also still equaling Generation X’s monthly retirement contribution percentage.\n\nLet’s get into the data.\n\nThe data: How Americans are spending their monthly income\n\n(Results are based on an online survey of 1,000 adult Americans that was commissioned by LendEDU and conducted online by Pollfish. Generational breakdowns were done according the latest information from Pew Research Center. Silent generation respondents were grouped with baby boomers, while Generation Z respondents were grouped with millennials due to a limited sample size for the silent generation and Generation Z.\n\nThe graphic below presents four different bars: one representing the overall average percentage breakdowns, and each of the next three representing a specific generation. Each percentage is a proportion of the average monthly income reported from the overall respondent pool and the three respective generations.\n\nGraph 1 More\n\nHere are four different charts: one representing the overall respondent average, and the next three each representing a specific generation.\n\nThe average monthly income figure for each chart is listed in the tab and inside the chart.\n\nThe various colors each represent a different expense, and by hovering over each, you can see the average dollar amount spent each month on that expense, in addition to the percentage breakdown.\n\nGraph 2 More\n\nHere you can see either the percentage or dollar breakdown for not only how the overall respondent pool spends monthly income, but how each respective generation does as well.\n\nStory continues", "description": "A survey has found exactly where all your money is going.", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/pN5phn4ZR0c1iYvZDJ1bJg--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/moneywise_327/7d770e62ec31b8986fa70ab8110a44a9", "published_at": "2019-10-04"}