{"pub": "guardian", "url": "https://theguardian.com/film/2019/sep/10/harvey-weinstein-gwyneth-paltrow-jodi-kantor-megan-twohey-new-york-times", "downloaded_at": "2019-09-10 23:28:46.718159+00:00", "title": "Gwyneth Paltrow 'a crucial source' in Harvey Weinstein revelations", "language": "en", "text": "A new book says the actor was scared of going on the record at first but then encouraged other women to speak out\n\nGwyneth Paltrow has been named a key figure in the New York Times story that first catalogued a series of sexual harassment allegations against Harvey Weinstein, and led to the film producer’s dismissal from his own company and subsequent prosecution.\n\nIn a new book titled She Said: Breaking the Sexual Harassment Story That Helped Ignite a Movement by Jodi Kantor and Megan Twohey – the New York Times reporters whose story on 5 October 2017 triggered Weinstein’s downfall – Paltrow is said to have been “scared to go on the record but became an early, crucial source, sharing her account of sexual harassment and trying to recruit other actresses to speak”.\n\nIn an appearance on the Today Show, Kantor and Twohey said: “Gwyneth [Paltrow] was actually one of the first people to get on the phone, and she was determined to help this investigation even when Harvey Weinstein showed up to a party at her house early and she was sort of forced to hide in the bathroom [while speaking to reporters].”\n\nPaltrow, who had acted in a number of Weinstein-backed films including Shakespeare in Love, was later quoted by Kantor and Rachel Abrams, accusing Weinstein of sexual harassment. “I was a kid, I was signed up, I was petrified.” After Brad Pitt, her then boyfriend, confronted Weinstein, she said: “I thought he was going to fire me.”\n\nWeinstein, who is shortly to go on trial for rape and sexual abuse, denies all allegations of non-consensual sexual activity. In a statement to Deadline, a Weinstein representative questioned Paltrow’s claim of “her job being at stake”. “Gwyneth Paltrow comes from Hollywood royalty … Her father was a top producer, her mother a famous actor, her godfather is Steven Spielberg. She didn’t need to make movies with Harvey Weinstein; she wanted to, and she won top awards and was the top paid female actor for nearly a decade, with Weinstein … Her narrative of her job being at stake is just gratuitous.”\n\nKantor and Twohey also describe the activities of high-profile lawyer Lisa Bloom, who acted on Weinstein’s behalf. A memo Bloom wrote in 2016 is quoted in the book. Bloom’s memo outlined a plan to undermine allegations by Rose McGowan, citing her experience as a victims’ representative, saying: “I feel equipped to help you against the Roses of the world, because I have represented so many of them … We can place an article re her becoming increasingly unglued, so that when someone Googles her this is what pops up and she’s discredited.”\n\nIn an interview with Variety, McGowan said: “What these people have done to my standing in the world has been systematic – it’s been evil … It’s one of the worst cases of gaslighting I’ve ever heard, and it’s starring me.\n\n“Her email is staggering. Staggering! This woman should never work again. Lisa Bloom should be disbarred.”\n\nBloom apologised on social media, writing: “While painful, I learn so much more from my mistakes than my successes. To those who missed my 2017 apology, and especially to the women: I am sorry.”", "description": "A new book says the actor was scared of going on the record at first but then encouraged other women to speak out", "authors": ["Andrew Pulver"], "top_image": "https://i.guim.co.uk/img/media/b55b38305a1bf327292e2e133d6ac93394787885/1037_38_2472_1483/master/2472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6cc09b2923ece6dd1164094617295aab", "published_at": "2019-09-10"}