{"pub": "news24", "url": "https://sport24.co.za/Rugby/RugbyWorldCup2019/wales-springboks-seek-to-shrug-off-injuries-in-rwc-semi-final-20191026", "downloaded_at": "2019-10-27 00:33:14.259219+00:00", "title": "Wales, Springboks seek to shrug off injuries in RWC semi-final", "language": "en", "text": "Yokohama - Six Nations champions Wales will be out for revenge in their Rugby World Cup semi-final against Rugby Championship title-holders South Africa in Yokohama on Sunday.\n\nWhile the Welsh have won the last four Tests between the two sides (after winning just two of their first 31), they went down 23-18 in the quarter-finals of the 2015 World Cup at Twickenham with current Bok flyhalf Handre Pollard kicking 18 points.\n\n\"We feel like we owe them one - that will be in the back of our minds and hopefully we can get one over them this week,\" Wales centre Jonathan Davies said.\n\nWales, who have never reached the final, are bidding to become only the second northern-hemisphere team to be crowned world champions, while South Africa have lifted the trophy twice.\n\nDavies sat out his team's nail-biting 20-19 quarter-final win over France with a knee injury, but is back in time for the Springboks.\n\nBoth sides, however, had last-minute withdrawals, Wales fullback Liam Williams and electric Bok winger Cheslin Kolbe both ruled out with ankle injuries.\n\nWales coach Warren Gatland named the experienced Leigh Halfpenny in place of Williams and insisted the team were not \"weakened in any way\" for a game he predicted would be a \"tight kicking fest\".\n\n\"He's undoubtedly a big loss from an attacking perspective and what he's achieved in the game over the last year or so - he's a world-class player,\" Gatland said of Williams.\n\n\"But to bring in someone with the experience of Leigh Halfpenny gives us a different element. We had a long debate over whether to start Leigh in the first place and move Liam to the wing.\"\n\nSpringbok coach Rassie Erasmus brought S'Bu Nkosi in for Kolbe, one of the stand-out players of this World Cup.\n\n\"It's a big blow because everybody knows his quality and the contribution he makes,\" Erasmus said, also quick to point out that Nkosi was no slouch, with eight tries in 10 Tests to his name.\n\nErasmus has transformed South Africa since taking over last year, turning around a terrible set of results and also naming the first black Springbok captain in Siya Kolisi.\n\n\"We've been under pressure in the last couple of years to redeem ourselves,\" he said, with the Boks having lost their pool opener in Japan to New Zealand before hammering Italy to advance as runners-up.\n\n\"We were number five, six, seven in the world since 2015 and had some proper hidings - some people lost faith in us and we're trying to get that respect back.\n\n\"That's a different kind of pressure. People are starting to believe in us again as a team.\"\n\nBoth coaches predicted a kicking-heavy game based around forward domination, with Erasmus again naming a replacements' bench including six huge forwards and two backs.\n\nThat tactic worked well in the quarters as the South Africans effectively outmuscled hosts Japan for a comprehensive 26-3 win.\n\n\"Lately, we've struggled against Wales. They know what they are good at, and focus on that,\" Pollard said.\n\n\"They starve you of possession and territory, and enforce their kicking game on you.\n\n\"They take away your set piece. It's not a game plan or rugby with a lot of flair in it, but it's suffocating. If you fall into that trap, they will enforce their game plan on you for 80 minutes, and you will probably not win that match.\"\n\nThe winners on Sunday face England in the final on November 2, also in Yokohama.\n\n\"We feel we have as good a chance as the other three teams,\" Erasmus said of South Africa, champions in 1995 and 2007.\n\nKick-off is at 11:00 SA time.\n\nTeams:\n\nSouth Africa\n\n15 Willie le Roux, 14 S'bu Nkosi, 13 Lukhanyo Am, 12 Damian de Allende, 11 Makazole Mapimpi, 10 Handre Pollard, 9 Faf de Klerk, 8 Duane Vermeulen, 7 Pieter-Steph du Toit, 6 Siya Kolisi (captain), 5 Lood de Jager, 4 Eben Etzebeth, 3 Frans Malherbe, 2 Bongi Mbonambi, 1 Tendai Mtawarira\n\nSubstitutes: 16 Malcolm Marx, 17 Steven Kitshoff, 18 Vincent Koch, 19 RG Snyman, 20 Franco Mostert, 21 Francois Louw, 22 Herschel Jantjies, 23 Frans Steyn\n\nWales\n\n15 Leigh Halfpenny, 14 George North, 13 Jonathan Davies, 12 Hadleigh Parkes, 11 Josh Adams, 10 Dan Biggar, 9 Gareth Davies, 8 Ross Moriarty, 7 Justin Tipuric, 6 Aaron Wainwright, 5 Alun Wyn Jones, 4 Jake Ball, 3 Tomas Francis, 2 Ken Owens, 1 Wyn Jones\n\nSubstitutes: 16 Elliot Dee, 17 Rhys Carre, 18 Dillon Lewis, 19 Adam Beard, 20 Aaron Shingler, 21 Tomos Williams, 22 Rhys Patchell, 23 Owen Watkin", "description": "Six Nations champions Wales will be out for revenge in their Rugby World Cup semi-final against Rugby Championship title-holders South Africa.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9523/83e659921ad4468b98f00c6f5e40808c.png", "published_at": "2019-10-26"}