{"pub": "nytimes", "url": "https://nytimes.com/2019/09/14/sunday-review/weather-trump.html", "downloaded_at": "2019-09-15 00:00:27.239698+00:00", "title": "Trust Our Weather Forecasters, Not Trump", "language": "en", "text": "When it opened in 1977, the Citicorp Center was the seventh-tallest building in the world. It contained more than 40 million pounds of structural steel and stood along Lexington Avenue from 53rd Street to 54th, one of the most crowded areas in the country. (The building is now called 601 Lexington.)\n\n“They said there would be a domino effect if that were to happen,” Mr. Gibson told me. “The dominoes were already standing — the buildings. They were talking about 18 blocks being wiped out.”\n\nA few months earlier, an engineering student had inquired about the calculations for wind loads used by the structural engineer who designed the tower, William LeMessurier. As he would tell the story, this prompted him to check his firm’s work. It turned out that the skyscraper had weaknesses that would make it vulnerable to collapse in a storm that occurred, on average, every 16 years in New York. That meant that in any given year, the building had a 1 in 16 possibility of facing a destructive storm: a 6 percent chance of failure.\n\nAll this came into focus just as peak hurricane season was beginning.\n\nMr. LeMessurier told his client, the bank. Mr. Robertson was hired to provide a second opinion. He needed to demonstrate the urgency of making repairs to senior executives, Mr. Robertson told me.\n\nAs described by others, he stood a clipboard on end and told the executives:\n\n“Gentlemen, if the wind blows — “\n\nThen he let the clipboard fall over and smack onto the table.\n\n“That’s what will happen to your building,” Mr. Robertson said.\n\nOne day after the meeting at the Weather Service in Rockefeller Center, the city’s three main daily newspapers went on strike for 88 days. Very few people knew what was going on at Citicorp, much less how serious it was.\n\nMost citizens turn over the job of measuring risk to the government, which in 1978 meant people like Mr. Gibson, just as it does in 2019. Civil servants track the weather and make the calls that mean the difference between life and death. As Michael Lewis writes in his book, “The Fifth Risk,” figuring out how to convey warnings at the right moment — to be trustworthy — is central to the National Weather Service’s mission of keeping people alive.", "description": "What if you knew a skyscraper was going to topple in the wind, but no one believed you?", "authors": ["Jim Dwyer"], "top_image": "https://static01.nyt.com/images/2019/09/15/opinion/sunday/15Dwyer/15Dwyer-facebookJumbo.jpg", "published_at": "2019-09-14"}