{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/iraq-pm-calls-talks-thousands-protesters-defy-curfew-191003161024820.html", "downloaded_at": "2019-10-03 23:36:55.258153+00:00", "published_at": "2019-10-03", "title": "Iraq's PM calls for talks as thousands of protesters defy curfew", "language": "en", "text": "Iraq's Prime Minister Adel Abdul Mahdi has called for dialogue after a third consecutive day of deadly anti-government protests in the capital, Baghdad, and several southern cities.\n\nIn a statement quoted by local media on Thursday, Abdul Mahdi's office said the prime minister was \"continuing contacts\" with protesters in a bid to end the political crisis and \"return to normal life\".\n\nAbdul Mahdi was prepared to meet with \"representatives of peaceful demonstrators to consider their legitimate demands\", the statement added.\n\nThe announcement came as 4,000 protesters rallied in the Baghdad, defying a government-enforced curfew to call again for improved services, more jobs and an end to widespread corruption.\n\nThe crowds gathered in Baghdad's Tayaran Square and attempted to march onto the central Tahrir Square only to be met with open fire and heavy tear gas. Police also used live ammunition in the Zafaraniya district of Baghdad and there were protests in the northwestern Shula district.\n\nThe demonstrations, which appear to be independent of any political party, started in the capital on Tuesday, and later spread to cities across Iraq's mainly Shia south. At least 19 people have been killed in three days of clashes, according to the Iraqi High Commission for Human Rights.\n\nThose demonstrating have directed their anger at Abdul Mahdi's year-old government and a wider political class they accuse of being corrupt and doing nothing to improve their lives.\n\nAl Jazeera's Imran Khan, reporting from Baghdad, said the protests \"pose the biggest challenge yet to Abdul Mahdi, but it's unclear how he can stop the outpouring of anger against his rule, with no apparent leaders of protesters to negotiate with.\"\n\nMore than a dozen people have been killed in the protests engulfing Iraq [Thaier al-Sudani/Reuters]\n\nSeveral Iraqis said they received on Thursday text messages from Abdel Mahdi's office giving a number for a hotline that protesters could call to air their grievances.\n\nIraq has the world's fourth-largest reserves of oil, according to the IMF, but much of its population of 40 million lives in poverty and without decent healthcare, education or power and water supply.\n\n\"We'll keep going until the government falls,\" Ali, an unemployed university graduate, told the AFP news agency on Thursday.\n\n\"I've got nothing but 250 lira (20 US cents) in my pocket while government officials have millions,\" the 22-year-old added.\n\nIn addition to imposing curfews, Iraqi authorities have also cut internet access in the capital and across much of the country.\n\nThe measures appear to have done little to stymie the unrest, however.\n\nIn addition to the 19 people killed, at least 1,041 people have been wounded and 62 others arrested, according to the Iraqi High Commission for Human Rights.\n\nMore than half of those killed in the last three days have been in the southern city of Nasiriya.\n\nNews agencies, citing security and medical sources, put the overall death toll much higher on Thursday, however.\n\nAnti-government protesters help a soldier from the Federal Police Rapid Response Forces to get out of the protest site area after other protesters beat him, in Baghdad [Hadi Mizba/ AP]\n\nThe AFP said a total of 30 people have been killed, with six protesters shot dead in Nasiriya on Thursday and four killed in nearby Amara. The agency said two protesters and one police officer was killed in Diwaniyah, a town south of Baghdad.\n\nThe Associated Press, meanwhile, put the death toll at 33. Al Jazeera could not independently verify those figures.\n\nCurfews were in place in Nasiriya, Amara, Najaf and Hilla on Thursday, according to Reuters.\n\n191002120630933\n\nOn Tuesday, Abdul Mahdi expressed regret for the violence in a post on Facebook.\n\n\"It saddens me and breaks our hearts the injuries among the protesters, our sons, and the security forces and the destruction and looting of public and private properties,\" he wrote.\n\n\"We stress to the people of our nation that our priorities were and will remain focused on providing radical realistic solutions to many of the decades-long accumulated problems.\"\n\nThe killings have drawn international concern, with Amnesty International calling on Iraq's government to rein in the security forces and investigate the killings.\n\nYouths carry away a protester injured during clashes with riot police in Baghdad's central Tahrir Square [Ahmad al-Rubaye/ AFP]\n\n\"It is outrageous that Iraqi security forces time and again deal with protesters with such brutality using lethal and unnecessary force,\" said Lynn Maalouf, Amnesty International's Middle East Research Director.\n\n\"It is crucial that the authorities ensure a fully independent and impartial investigation,\" Maalouf added. \"The state must commit to holding those responsible to account.\"\n\nThe United Nations meanwhile urged the government to \"exercise maximum restraint\" and allow peaceful protests. The United Kingdom and the European Union have also appealed for calm.\n\nIraq has struggled to recover since defeating the Islamic State of Iraq and the Levant (ISIL or ISIS) group in 2017.\n\nThe country's infrastructure has been laid to waste by decades of sectarian civil war, foreign occupation, two United States-led invasions, UN sanctions and war against its neighbours.", "description": "Adel Abdul Mahdi's office says he is prepared to meet representatives of protesters as unrest continues for third day.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/3/5f05f540cf1245b4a0de7d1df1743b6c_18.jpg"}