{"pub": "metro", "url": "https://metro.co.uk/2019/10/06/woody-turns-detective-ella-circle-try-sniff-catfishing-contestants-10871910", "downloaded_at": "2019-10-07 00:10:07.487413+00:00", "title": "Woody turns detective with Ella on The Circle to sniff out catfishes", "language": "en", "text": "Woody enlists the help of Ella on The Circle (Picture: Channel 4)\n\nDetective Woody is on the case for potential catfishes on tonight’s episode of The Circle and he’s enlisting the help of his bestie, Ella.\n\nWoody, 18, the son of Fatboy Slim and Zoe Ball, really hit it off with Ella when she first entered Channel 4’s hit-show last week and they’ve been inseparable ever since.\n\nSo it makes sense he’d ask his most trusted friend for help in sniffing out the people who are pretending to be someone else.\n\nIn a sneak preview, Woody says he’s been blindsided by the shock blockings of Jay (who was actually his mum, Katie) and Judy (who was played by none other than presenter Richard Madely).\n\nSo he’s set up a little mind map to note down anything that seems off with his fellow contestants.\n\nHe messaged: ‘In a post-Jay world, where you can’t trust anyone, me and Detective Denny (his stuffed toy) have decided to make a catfish board linked together with string – like you see in the films #DetectiveDenny’.\n\nAdvertisement\n\nAdvertisement\n\nWoody then added: ‘I was just wondering if you had any tidbits on anyone?’\n\nWoody setting up his detective board to suss out potential catfishes (Picture: Channel 4)\n\nElla screamed as she read the message aloud then offered her advice: ‘The only tips I could give you is to write down anything anyone says to see if they trip up on their own lie later. Also, if someone comes across as slightly one-dimensional like Jay, it’s more of a sign they’re a catfish. Although Jay’s mum floored me.’\n\nThe pair agree to ‘put their heads together’ to try to suss out their fellow contestants.\n\n‘I trust Ella’s judgment,’ Woody says to himself out loud.\n\n‘I’m f*****g down,’ Ella says to herself.\n\nSunday night’s episode promises to be a big one, with the latest ratings coming out for each contestant.\n\nThe Circle also shared a preview clip of Jack and Beth meeting for the first time, as Jack realises Beth has been using someone else’s photos.\n\nDAILY DROP! Beth and Jack meet face-to-face and find out the public have been voting to decide their fate 😮 Is this the end of their time in #TheCircle or have you given them a second chance? 👀 pic.twitter.com/gi9TaC0UDb — The Circle (@C4TheCircle) October 6, 2019\n\nOn Friday, Emma Willis announced a shock twist with the lowest ranking people (Jack and Beth) being automatically blocked from The Circle.\n\nThe public then had to vote on whether the two eliminated contestants would meet up and then secretly play as 62-year-old woman named Joyce or bring in a new couple, Ryan and Lauren, who will act solely under Ryan’s profile.\n\nAdvertisement\n\nAdvertisement\n\nWhatever happens, it sounds like Detectives Woody and Ella will be on the case.\n\nThe Circle continues tonight at 10pm on Channel 4.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: What time is The Circle on Channel 4 tonight and what’s the latest twist?\n\nMORE: Ant and Dec apologise after setting off viewers’ Amazon Alexa devices during BGT: The Champions final", "description": "The Circle besties Ella and Woody are joining forces to sniff out potential catfishing contestants.", "authors": ["James Besanvalle"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/woody-and-ella_1570388646.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-06"}