{"pub": "dailymail", "url": "https://dailymail.co.uk/home/event/article-7507375/Keanes-songs-halfway-therapy-session-box-cupcakes.html", "downloaded_at": "2019-10-05 06:51:19.384343+00:00", "title": "Keane's songs are halfway between a therapy session and a box of cupcakes", "language": "en", "text": "Keane\n\nDe La Warr Pavilion, Bexhill-on-Sea Touring until October 7\n\nRating:\n\nKeane are back together after spending five years on a break. In their absence, the music industry didn’t get any better at persuading people to sit through whole albums.\n\nSo Tom Chaplin and company have come up with a radical solution: performing their new album, in full, on the day of release.\n\nIt could go horribly wrong, if it weren’t for three things. First, Keane may be men in their 40s now, but here by the sea in Sussex they’re still local boys bathing in the warmth of a home crowd.\n\nKeane (above) may be men in their 40s now, but here by the sea in Sussex they’re still local boys bathing in the warmth of a home crowd\n\n‘Love you, Tom,’ someone yells. ‘It’s nice,’ Chaplin drily replies, ‘to have our parents in tonight.’\n\nSecond, the new album, Cause And Effect, is as likeable as the oldies that round off the show. The Keane sound remains the same: gentle indie-pop, with Tim Rice-Oxley’s soulful synths supplanting the guitars.\n\nThe lyrics are sadder and heavier, reflecting Rice-Oxley’s divorce and Chaplin’s struggles with addiction, but the music remains light. The songs are halfway between a therapy session and a box of cupcakes.\n\nIT'S A FACT In 1997 the band were called Cherry Keane, after a woman who served tea at Tim and Tom's school. They subsequently dropped the Cherry.\n\nAbove all there is Chaplin’s voice. He’s the kind of singer who can carry a crowd with him – a choirboy with the horsepower of a whole choir. Last time I saw him on stage he was singing the songs of Queen at the London Palladium, and Freddie Mercury’s imprint lingers in the way Chaplin hurls himself into each line.\n\nThis commitment is all the more striking when it comes bursting out of a self-deprecating son of East Sussex.\n\nIf you’re tempted by the new album, I’d suggest starting with Chase The Night Away, a soaring pop song with a kick in the chorus, or Strange Room, a piano ballad with a Christmassy feel (can someone tell John Lewis?).\n\nBetter still, just buy the whole thing.\n\nkeanemusic.com", "description": "Keane are back together after spending five years on a break. In their absence, the music industry didn't get any better at persuading people to sit through whole albums.", "authors": ["Tim De Lisle For Event Magazine"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/26/13/18962386-0-image-a-63_1569500359935.jpg", "published_at": "2019-09-28"}