{"pub": "metro", "url": "https://metro.co.uk/2019/10/21/uk-population-reach-nearly-70000000-next-10-years-ons-says-10954705", "downloaded_at": "2019-10-21 09:47:14.837199+00:00", "title": "UK population to reach nearly 70,000,000 in the next 10 years, ONS says", "language": "en", "text": "The number of people in the UK will grow to nearly 70,000,000 in the next 10 years (Picture: ONS)\n\nThe UK population is projected to increase by three million over the next decade, from an estimated 66.4 million in mid-2018 to 69.4 million in mid-2028, according to the Office for National Statistics.\n\nMost of the growth will be in England with another five per cent compared to 3.7 per cent for Northern Ireland, 1.8 per cent for Scotland and 0.6 per cent in Wales.\n\nExperts say that nearly three quarters of the growth will come from people moving to the UK.\n\nThe ONS said: ‘Over the next 10 years, 27% of UK population growth is projected to result from more births than deaths, with 73% resulting from net international migration.\n\nAn Office for National Statistics expert said: ‘The UK population is projected to grow by 3 million people by 2028. This assumes migration will have a greater impact on the size of the population than the combination of births and deaths.\n\nBy 2043 there will be 72.4 million people in the UK, according to current estimates (Picture: ONS)\n\n‘Although migration declines at first and the number of births is stable, the number of deaths is projected to grow as those born in the baby boom after WWII reach older ages.\n\nAdvertisement\n\nAdvertisement\n\n‘The population is increasingly ageing and this trend will continue. However, because of the expected rise in the State Pension age to 67 years, it is projected that slightly fewer than one in five people will be of pensionable age in 2028, a similar proportion to today.’\n\nThey also predict that the UK population will hit 70 million at some point in mid-2031.\n\nIt is also believed that the proportion of people aged 85 and over will almost double as baby boomers grow older.\n\nLooking at past predictions, growth rate is slower than previously expected and the population is 0.4 million less in mid-2028 and 0.9 million less in mid-2041.", "description": "The UK population is projected to increase by three million over the next decade, from an estimated 66.4 million in mid-2018 to 69.4 million in mid-2028, according to the Office...", "authors": ["Richard Hartley-Parkinson"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1077459624-2401_1571649743.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-21"}