{"pub": "arirang", "url": "https://arirang.com/News/News_View.asp?nseq=245437", "downloaded_at": "2019-10-10 06:16:48.271023+00:00", "title": "News View :: The World On Arirang", "language": "en", "text": "Reporter :\n\nSouth Korea raised the issue of Japan's reported plan to release radioactive wastewater from the Fukushima nuclear plant into the Pacific Ocean …at a global conference of the International Maritime Organization in London this week.During a meeting to discuss the London Convention and Protocol… Seoul's fishery ministry demanded that Tokyo transparently disclose information over its handling of the contaminated water and called for continuous discussion of the issue.The London Protocol is aimed at preventing marine pollution and bans the export of waste or other matter to other countries for dumping or incineration at sea.However, the direct dumping of wastewater from land to sea has been absent from the discussion.With the management of radioactive waste on the agenda for this year's meeting, …representatives from China and Chile also expressed their concern and called for more discussions over the matter.Ghana's representative to the IMO, who is the chair of the meeting, also noted that the issue can be brought up for discussion and that Japan should provide information.For the first time, Japan's representative said it will continue to provide transparent information concerning the contaminated water at Fukushima.This is the latest effort by the Korean government to deter Tokyo from discharging an estimated one.one million tons of contaminated water stored at its Fukushima plant.Last month, Seoul raised the issue at the General Conference of the International Atomic Energy Agency.At the gathering, Japan dismissed criticisms, claiming they were not based on scientific evidence.Park Se-young, Arirang News.", "description": "한국을 대표하는 글로벌 방송! The World On Arirang!", "authors": ["The Korea International Broadcasting Foundation"], "top_image": "http://www.arirang.com/arirang_blue.png", "published_at": "2019-10-10"}