{"pub": "investing.com", "url": "https://uk.investing.com/news/politics/britain-and-ireland-see-a-pathway-to-brexit-deal-1977219", "downloaded_at": "2019-10-11 06:57:55.300187+00:00", "title": "Brexit deal can be done by October 31, Ireland says after 'positive' Johnson meeting", "language": "en", "text": "By Elizabeth Piper and Peter Powell\n\nTHORNTON MANOR, England (Reuters) - A Brexit deal could be clinched by the end of October to allow the United Kingdom to leave the European Union in an orderly fashion, Irish Prime Minister Leo Varadkar said after what he called a very positive meeting with Boris Johnson.\n\nWith just three weeks to go before the United Kingdom is due to leave the world's biggest trading bloc, it remains unclear on what terms it will leave or indeed whether it will leave at all.\n\nAfter Brexit descended into a public row between London and Brussels earlier this week, Johnson, the British prime minister, met Varadkar at Thornton Manor in Cheshire on Thursday in a last ditch bid to avert an acrimonious divorce or another delay.\n\n\"I think it is possible for us to come to an agreement, to have a treaty agreed, to allow the UK to leave the EU in an orderly fashion and to have that done by the end of October,\" Varadkar told Irish reporters.\n\n\"But there's many a slip between cup and lip and lots of things that are not in my control,\" he said.\n\nWhen asked about who made concessions to break the impasse, Varadkar said: \"I don't think this should be seen in the context of who's making concessions, or who the winners and losers are, I don't think that's the game any of us want to play.\"\n\nIn a joint statement, the two leaders said they \"could see a pathway to a possible deal\" and that the EU's chief negotiator Michel Barnier would meet his British counterpart Steve Barclay in Brussels on Friday.\n\nSterling shot up 1.5% to $1.2387. British 10-year government bond yields recorded their biggest one-day rise in nearly four years.\n\nTo get a done deal, Johnson must master the complexities of the Irish border before getting the approval of Europe's biggest powers and then sell any deal to the British parliament in which he has no majority and which he suspended unlawfully last month.\n\nJohnson, the face of the 2016 Brexit campaign, made no further comment on the meeting with Varadkar. The details of what, if anything, had been agreed were unclear.\n\nIreland holds the key to any deal. It will have to consent to any solution to the hardest Brexit riddle of all: how to prevent the British province of Northern Ireland becoming a backdoor into the EU's markets without having border controls.\n\nThe EU fears controls on the 500-km (300-mile) Irish border with Northern Ireland would undermine the 1998 Good Friday Agreement which ended three decades of sectarian and political conflict that killed more than 3,600 people.\n\nAlthough Johnson has insisted Britain will leave the EU on Oct. 31 even if no agreement is reached, the British parliament has passed a law saying he must request a delay.\n\nIRELAND\n\nHopes of a Brexit deal were dented earlier this week when a Downing Street source said agreement was essentially impossible because German Chancellor Angela Merkel had made unacceptable demands. The EU said Johnson was playing a stupid blame game.\n\nIreland is the biggest issue of disagreement.\n\nThe Irish border has been largely invisible since army checkpoints were taken down after the 1998 peace deal largely ended the violence between the region's pro-British majority and an Irish nationalist minority.\n\nPoliticians have warned that the re-imposition of physical infrastructure on the border when it becomes the EU's external frontier would anger Irish nationalists in Northern Ireland who aspire to unification with the Republic of Ireland, and help militants opposed to the peace deal to recruit new members.\n\nTo get around the problem, the EU agreed an insurance policy - known as the backstop - last November with Johnson's predecessor Theresa May.\n\nThe Withdrawal Agreement that May struck says the United Kingdom will remain in a customs union \"unless and until\" alternative arrangements are found to avoid a hard border.\n\nJohnson said that was undemocratic, undermined the unity of the United Kingdom and would keep it trapped in the EU's orbit for years to come.\n\nLast week he proposed an all-island regulatory zone to cover all goods. Northern Ireland would leave the EU's customs area along with the rest of the United Kingdom and the province's institutions would be able to opt to exit the regulatory zone - a step too far for Ireland and the EU.\n\nJohnson and Varadkar said they had discussed consent and customs.\n\nThough Ireland is only about an eighth of the size of the United Kingdom's $2.8 trillion economy, Dublin is backed by the rest of the EU whose economy - minus the United Kingdom - is worth $15.9 trillion.\n\nWhile Ireland would be very badly affected by a no-deal Brexit, the relative importance of Ireland in the negotiations up-ends centuries of history in which it has had a much weaker hand than London, both before and after winning independence from Britain.\n\nThe EU's two most powerful leaders, Germany's Merkel and French President Emmanuel Macron, will meet at the Elysee Palace on Sunday ahead of next week's summit.\n\n\"We want to reduce the negative effects, even if there is a disorderly Brexit, in both countries,\" Merkel said.\n\nMacron said on Thursday Britain would have to pay the price should it decide to proceed with a position over Brexit that is unacceptable for the other 27 EU countries.\n\n\"If they don't want to make any move or make something which is not accepted, they will have to take the responsibility,\" he said.", "description": "Brexit deal can be done by October 31, Ireland says after 'positive' Johnson meeting", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF991J3_L.jpg", "published_at": "2019-10-10"}