{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/darren-gough-honoured-land-england-role-ahead-new-zealand-tests-11014230", "downloaded_at": "2019-10-30 23:21:56.948779+00:00", "title": "Darren Gough reacts to landing England role ahead of New Zealand Tests", "language": "en", "text": "Darren Gough will work with England’s Test bowlers next month (Picture: Getty)\n\nFormer bowler Darren Gough has been appointed as England’s fast bowling consultant ahead of the Test series against New Zealand.\n\nThe England legend will work with Chris Silverwood and Joe Root’s Test team from November 5 to 18, with the opening Test starting in Tauranga on November 20.\n\nGough, 49, finished his international career with 229 wickets from 58 Tests and said: ‘It is a tremendous honour to be asked by Chris and Ashley Giles to be involved in this elite environment.\n\nThe England legend took over 200 wickets for his country (Picture: Getty)\n\n‘I very much look forward to working with all the bowlers and helping them improve.\n\n‘I will gain a lot from the experience and to work at this level will do benefit me as a coach for the long-term. I can’t wait to get cracking.’\n\nSilverwood, who was named England’s head coach last month following Trevor Bayliss’ departure, added: ‘I’m delighted to have Darren on board.\n\nNew England head coach Chris Silverwood (Picture: Getty)\n\n‘I have known him a long time and his vast knowledge and experience at international level will drive our bowling unit forward leading into the two-match Test series.\n\nAdvertisement\n\nAdvertisement\n\n‘He will be excellent around the group and will settle in quickly.’\n\nThe New Zealand Tests will be England’s first red-ball matches since drawing the Ashes 2-2 at home last summer.", "description": "Former bowler Darren Gough has been appointed as England's fast bowling consultant ahead of the Test series against New Zealand. The England legend will work with Chris Silverwood and Joe...", "authors": ["Louis Sealey"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-838287108_1572457572.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-30"}