{"pub": "breitbart", "url": "https://breitbart.com/news/student-performance-lags-on-nations-report-card", "downloaded_at": "2019-10-30 16:03:56.916824+00:00", "title": "Student performance lags on Nation’s Report Card", "language": "en", "text": "ATLANTA (AP) — America’s eighth graders are falling behind in math and reading, while fourth graders are doing slightly better in reading, according to the latest results from the Nation’s Report Card .\n\nBut there were some exceptions to the findings, which also showed declines among fourth graders in math.\n\nMississippi and the District of Columbia showed gains, along with some other big-city school districts.\n\nNationwide, a little more than a third of eighth graders are proficient in reading and math. About a third of fourth graders are proficient in reading, while more than 40% of fourth graders are proficient in math.\n\n“This country is in a student achievement crisis, and over the past decade it has continued to worsen, especially for our most vulnerable students,” Education Secretary Betsy DeVos said.\n\nThe nationwide test is given to a random sampling of students in the fourth and eighth grades every two years.\n\nStudents made big gains in math in the 1990s and 2000s but have shown little improvement since then. Reading scores have risen a little since the tests began in 1992.\n\nThe decline in both reading and math performance among eighth grade students preparing to enter high school was especially concerning, authorities said.\n\n“Eighth grade is a transitional point in preparing students for success in high school, so it is critical that researchers further explore the declines we are seeing here, especially the larger, more widespread declines across states we are seeing in reading,” Peggy Carr, associate commissioner of the National Center for Education Statistics told reporters during a conference call.\n\nBoth low- and high-achieving eighth graders slipped in reading, but the declines were generally worse for lower-performing students.\n\nCarr said it’s up to researchers and other to figure out why scores fell. “The assessment is designed to tell you what, not why,” she said.\n\nDeVos pointed to a widening achievement gap between the highest- and lowest-performing students and used the results to push for expanded school choice, including her proposals for federal tax credits for donations made to groups offering scholarships for private schools, apprenticeships and other educational programs.\n\n“It’s the only way to bring about the change our country desperately needs,” she said.\n\nDaniel Willingham, a professor of psychology at the University of Virginia, said it’s hard to find a coherent story across different state and local school districts, but that he hoped the results would “spur us to do something a little more vigorous.”\n\n“We’ve just absolutely stalled,” Willingham said.\n\nOne theory is that decreased performance is a residue of trauma suffered by families and spending cuts by school districts during the Great Recession. Michael Petrilli, president of education reform group the Thomas Fordham Institute, has pointed to data showing that performance has risen and fallen on the test in the past in sync with the economy.\n\n“What we saw is that great calamity had lingering impacts,” Petrilli said. He said that could also be why “we’d be seeing particularly disappointing results at the lowest end of the spectrum.”\n\nOfficials noted gains in Mississippi, where for the first time in the test’s history, fourth graders scored above the national average in math and at the national average in reading. The state remained behind national averages in eighth grade but continued to improve in math and held its ground in reading despite nationwide losses.\n\n“Our achievement is at an all-time high in Mississippi,” said state Superintendent Carey Wright.\n\nThe state has been among a number with a heavy focus on improving early literacy, but Wright said the state also has devoted resources to helping teachers improve math instruction after it adopted new standards.\n\n“When you improve kids’ reading ability, it’s not surprising that kids’ math ability falls in line,” Wright said.\n\nThe nation’s large-city public schools — they educate more poor students and English language learners — also saw good news in the results. Big-city schools still performed below the nation as a whole, but further narrowed the gap.\n\nOne of those big-city districts highlighted as making gains was the District of Columbia, where Carr said gains have outpaced the nation over the past decade.\n\nIn the last 20 years, the achievement gap between big-city schools and the nation has narrowed by about 50 percent in reading and math, the Council of the Great City Schools said. The schools are now about five to eight points below national averages on NAEP’s 500-point scale.\n\n“We still have more to do, but the era of poor performance in our nation’s urban public-school systems has ended, and it has been replaced by results, accountability and promise,” the council’s executive director, Michael Casserly, said in a news release.\n\n___\n\nThompson reported from Buffalo, New York.\n\n___\n\nFollow Jeff Amy on Twitter at http://twitter.com/jeffamy .", "description": "ATLANTA (AP) — America's eighth graders are falling behind in math and reading, while fourth graders are doing slightly better in reading, according to", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/30/f0b155_nation-report-card-35734-in-2014-file-photo-odessa-high-school-graduates-640x335.jpg", "published_at": "2019-10-30"}