{"pub": "reuters", "url": "https://reuters.com/article/us-hongkong-protests-airlines/airlines-ask-hong-kong-to-waive-airport-fees-as-demand-drops-letter-idUSKBN1W80DH", "downloaded_at": "2019-09-23 07:33:17.522369+00:00", "title": "Airlines ask Hong Kong to waive airport fees as demand drops: letter", "language": "en", "text": "SINGAPORE (Reuters) - Scores of airlines wrote jointly to the Hong Kong government earlier this month to seek airport fee waivers as they struggle to deal with the financial fallout from anti-government protests that have led to a sharp drop in traveler demand.\n\nFILE PHOTO: A plane takes off at Hong Kong International Airport, in Hong Kong, China September 1, 2019. REUTERS/Danish Siddiqui/File Photo\n\nThe Board of Airline Representatives (BAR) of Hong Kong, which represents more than 70 airlines that fly to and from the Asian financial center, wrote to the government asking for temporary relief from landing and parking fees as well as rent and other operational costs, according to a letter seen by Reuters.\n\n“Already we have seen a double-digit drop in passengers in August compared to last year and we expect this to worsen in the remaining months of the year,” BAR Chairman Ronald Lam, a senior executive at Cathay Pacific Airways Ltd (0293.HK), said in the letter dated Sept. 16, which was first reported by the South China Morning Post on Monday.\n\n“Many airlines have already reduced or cut their services to and from Hong Kong as many routes have become unprofitable due to declining passenger numbers,” Lam said in the letter, addressed to the government’s secretary for transport and housing.\n\nAirport Authority Hong Kong and Hong Kong’s Transport and Housing Bureau did not immediately respond to requests for comment.\n\nCathay, the biggest corporate casualty of the sometimes violent protests, this month said it would cut capacity for the upcoming winter season after reporting a 11.3% fall in passenger numbers in August due to falling demand.\n\nThe airline said in a statement that it supported BAR’s request for short-term relief measures to help airlines remain commercially viable.\n\nLanding, parking and route expenses, which would include fees paid to airports outside Hong Kong and air traffic control charges, accounted for 16% of Cathay’s operating costs in 2018, according to its financial accounts.\n\nForeign carriers like Qantas Airways Ltd (QAN.AX) have also been hit by a demand drop, with the Australian carrier switching to smaller planes on the Hong Kong route.\n\nHong Kong was the world’s eighth biggest airport for passenger traffic in 2017, according to the latest annual ranking available from Airports Council International, but the airport said passenger numbers fell 11.5% in August.", "description": "Scores of airlines wrote jointly to the Hong Kong government earlier this month to seek airport fee waivers as they struggle to deal with the financial fallout from anti-government protests that have led to a sharp drop in traveler demand.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190923&t=2&i=1432846360&w=1200&r=LYNXMPEF8M0BI", "published_at": "2019-09-23"}