{"pub": "businessinsider", "url": "https://businessinsider.com/entrepreneurship-advice-ben-horowitz-company-culture-startups-venture-capital", "downloaded_at": "2019-10-29 14:17:53.908078+00:00", "title": "The cofounder of legendary VC firm Andreessen Horowitz on what almost killed Uber, what really led to WeWork's downfall, and what happened after he passed on Airbnb", "language": "en", "text": "An important part of entrepreneurship is building a sustainable company culture.\n\nThat's according to Ben Horowitz, cofounder and general partner at venture-capital firm Andreessen Horowitz.\n\nHorowitz's new book, \"What You Do Is Who You Are,\" outlines key elements of creating a healthy culture early on.\n\nIn an interview with Business Insider, Horowitz also shared his thoughts on hiring for culture fit, Uber's cultural missteps, and why Andreessen Horowitz gives feedback to every founder they decline to invest in.\n\nVisit Business Insider's homepage for more stories.\n\nAndreessen Horowitz was designed as a venture-capital firm where investors could support entrepreneurs beyond just writing them a check.\n\nInvestors would also help catapult startups to success by sharing lessons based on their own experience and by introducing founders to influential leaders in their network.\n\nWhen they launched their namesake firm in 2009, founders Ben Horowitz and Marc Andreessen had previously run the software company Opsware, which they sold to Hewlett-Packard for $1.6 billion in 2007. They'd also tried their hand at angel investing, which is when they started thinking about how investors could better partner with entrepreneurs.\n\nToday, Andreessen Horowitz (a16z, for short) manages $10 billion in assets. Perhaps you've heard of some of their investments, which include Facebook, Airbnb, Lyft, and Instacart.\n\nIn the meantime, Horowitz (whose LinkedIn profile lists his job title as \"Horowitz\" at Andreessen Horowitz) has written two books: \"The Hard Thing About Hard Things,\" his candid guide to entrepreneurship, published in 2014, and \"What You Do Is Who You Are,\" which debuts October 29, 2019. The new book — perhaps more timely than even Horowitz anticipated, given the internal drama at WeWork — outlines the importance of building a sustainable company culture.\n\nIn each chapter, Horowitz juxtaposes a historical event — like the 18th-century slave revolt in Haiti — and a contemporary business story — like Uber's moral crisis — to illustrate a key lesson about company culture. (Unsurprising to anyone familiar with Horowitz's extracurricular passions, several chapters include epigraphs from popular rap songs.)\n\nBusiness Insider recently spoke with Horowitz about the difference between experienced and inexperienced founders in getting investors onboard, how to find out right away if someone will add to your company culture, and what really led to WeWork's downfall.\n\nThe following interview has been edited for length and clarity.\n\nShana Lebowitz: I want to start by talking about something that a lot of our readers at BI struggle with, which is the decision to become an entrepreneur and leave behind a stable career. In the book you describe this moment when you realized you couldn't work for someone else. You'd been a CEO and now you were working at HP. [Horowitz was cofounder and CEO of the software company Opsware, which was acquired by Hewlett-Packard for $1.6 billion in 2007. After that, Horowitz became a vice president and general manager at HP.] Was there a single experience that prompted this realization?\n\nBen Horowitz: I was just too old. You get to a point and it's like, \"Nobody can't tell me nothing.\" I already felt like I knew too much, at least about running an organization. And whether I did or not, it didn't matter, because that's how I felt. So I got myself to a point where I was unmanageable.\n\nBut I definitely wasn't like that when I was young. When I was younger I was much more — I don't want to say open-minded, but I felt like I knew a lot less. So I was happy to get some guidance. I guess it's different when you're old and when you're young, when you're just out of school.\n\nAt that point [when you're young], the only real reason to become an entrepreneur would be that you have an idea that is almost irrepressible. You feel like you have to pursue it. It's so important because if you don't have that, it's hard to get people to follow you because you don't have any experience and you don't have the know-how that they lack. So you're building yourself around the idea.\n\nWhereas if you're later in your career, then people could learn a lot from you personally. And so you could get away with perhaps not as strong an idea and still build the team. So it's a little different. I wouldn't do what I did if I was 20. But when I did it, I was kind of ruined for working for people at that point.\n\nLebowitz: I'd love to dig in a little bit deeper on what you said, that if you're relatively young and early in your career, the only real reason to become an entrepreneur is because you have this idea. Whereas if you're a little bit older and more advanced in your career, people are more inclined to follow you because they feel like they can learn from you. Is this something that you and your partners at Andreessen Horowitz think about when you're evaluating founders who pitch you?\n\nHorowitz: Oh yeah, definitely. Because here's the thing. All entrepreneurship isn't technology entrepreneurship. But technology entrepreneurship is tricky in that there are no local tech companies, right? They're all global. So you're going to be competing at that level, not just for customers, but for talent.\n\nAnd so one of the first questions is: Ok, why would the 21st or 22nd [engineer] join your company? In the beginning, you can [build a company] through your friends, or that kind of thing. There are people who just want a very big percentage of the company [in an equity grant]. But once you get a little further into it, it's not that big a percentage of the company.\n\nAnd so it's got to be just massively compelling. And if you're 22, it's probably not going to be you yourself because you probably haven't accomplished anything at that point. Compare it to other places somebody could go, where they could work for Mark Zuckerberg or Larry Page or something like that. So at that point it really does have to be the idea.\n\n'What would you do if I punched you in the face?' How to see if a job candidate has what it takes to survive at your company\n\nLebowitz: When you look at the founding teams at your portfolio companies, what are the biggest mistakes you see them making when it comes to hiring or building company culture?\n\nHorowitz: I'll start with company culture. I think the biggest mistake, or the most common mistake, is you mistake what you want in the culture with what you have. One of the quotes from the book is from \"the way of the warrior\" [Bushido, the code created by samurai in ancient Japan], where they say a culture is not a set of beliefs. It's a set of actions.\n\nWhen you're running an organization, you might think that what I say in the company values or what I say in all-hands meetings, that's going to be the culture. But it really is not. Often the culture is driven by the people who aren't there when you're talking to somebody. So you'll be talking to somebody directly and they'll want to do something that may be off-culture and you think nobody's looking, but everybody is looking and that will impact the culture and impact people's behavior.\n\nA statue of Chinese military general Sun Tzu. Wikimedia Commons/Hinio\n\nI have an example in the book from \"The Art of War\" [Chinese general Sun Tzu's military treatise], where you have two people not paying attention during drills and he [Tzu] of course beheads them, but the point is that he wasn't talking to them; he was talking to everybody else. And everybody else needs to know that if you don't pay attention during drills, everybody's going to die. And so this is really important, and a lot of culture is like that.\n\nThe mistakes tend to be ones where you think that belief translates into action even when you're not there. That's not true. And that's why it's so complicated, by the way, because it's very hard to get people to behave in a certain way when you're not there. That is what culture is.\n\nHiring is more nuanced when it comes to culture. I think there's a couple of things that people have historically gotten wrong. You always hear, 'Hire for culture,' but there's at least three problems with that.\n\nOne is, it's pretty hard to tell somebody's culture in an interview. You will see signs sometimes, but usually to get a read on that is difficult. Secondly, culture is not fixed; it changes. So the real question isn't, \"Do they have your culture?\" It's, \"Can they adapt to your culture?\"\n\nPart of that is being clear on what exactly your culture is before they come aboard. The third thing is, there are times when your company is missing something culturally and you need to hire that from the outside, particularly into a leadership position.\n\nI talked about this in the book with Toussaint Louverture, bringing in French and Spanish and British soldiers into the slave army because he needed those cultural aspects to make it go. [Louverture led a slave revolt against European colonists in Saint-Domingue, which is now Haiti.] And I think that happens a lot in the corporate world as well.\n\nLebowitz: I'm interested in this idea that it's more difficult than it seems to hire for culture. You mention in the book an anecdote about a job interview that Mark Cranney [former EVP of worldwide field operations at Opsware and former operating partner at Andreessen Horowitz] had at a previous employer. The guy interviewing him said, \"What would you do if I punched you in the face?\"\n\nHorowitz: Yep. That's a very good indication of what their culture was, by the way.\n\nLebowitz: You said [in the book] that this was a very extreme example of a well designed cultural interview. What exactly is a cultural interview? Are there specific questions you should ask the candidates to suss out whether they can adapt or add to your company culture?\n\nHorowitz: \"What would you do if I punched you in the face?\" is a great cultural question on several levels. The first thing is, the guy who asked it clearly indicated this is what our culture is like. That's how extreme we are on this kind of stuff. And in the answer, he was basically testing for can you deal with a confrontational culture in the extreme? Can you deal with me asking you what would you do if I punched you in the face? Now?\n\nThere's many potential right answers and many wrong ones to that question. The way Mark answered it, saying, \"Is that a test of my courage or my intelligence?\" was a great way to answer. In that sales culture, what they're looking for is the courage to ask the uncomfortable question. Because often in a sales situation, a customer will hit you with something that's very difficult. A criticism that's going to make you uncomfortable. And not only do you have to be willing to deal with that, you have to be willing to turn around and ask them something that might make them uncomfortable. So you can get the truth, like, \"Do you really have the budget for this?\" So by asking such a confrontational question, you get at the essence of the cultural character of the interviewee.\n\nThe question Ben Horowitz asks everyone interviewing for a position at his firm\n\nLebowitz: Are there less extreme versions of this question during an interview? Have you ever used these types of questions when you're interviewing people?\n\nHorowitz: Yes. For example, here, a big cultural principal that we have is we don't publicly attack any entrepreneur. Period, for any reason. You'll never see us get on Twitter and go, 'Wow, that idea's really stupid. They're never going to make any money. They're selling dollars for 85 cents,' or all these things that VCs will tend to do.\n\nThe reason is we believe in the dream and we support the entrepreneur and we're always going to talk about entrepreneurs in that light. I might ask somebody [a job candidate], \"What do you think about what Adam did at WeWork?\" Or something like that. That would be a little bit like: How much empathy do you have for the entrepreneur and how much do you just want to show how smart you are by crapping all over them?\n\nLebowitz: Have you actually asked people you're interviewing for positions at Andreessen Horowitz, \"What do you think of Adam Neumann at WeWork?\"\n\nHorowitz: Yes.\n\nLebowitz: Can you share an example of what the person could say that demonstrated empathy versus trying to seem smart?\n\nHorowitz: If they demonstrated empathy, they'd go, He did an unbelievable thing in that he built something that almost nobody has done, which is he built a consumer brand in commercial real estate. What other consumer brand in commercial real estate is there? If you're renting off this space, who do you know other than WeWork? And he told that story so beautifully that he was able to raise a gigantic amount of money and fund this incredible growing operation.\n\nNow, obviously, mistakes were made, but at least put into context what the strengths were, as opposed to, \"that thing was a fraud from the beginning.\" Or somebody might describe it, who didn't really think about what [Neumann] did build, only thought about what they read in the newspaper.\n\nHow WeWork's relentless optimism helped it succeed — and then paved the way for its downfall\n\nAdam Neumann, former WeWork CEO. Jackal Pan / Getty\n\nLebowitz: WeWork is an example of a very high-profile company whose company culture has been widely criticized in the recent past. What do you think allowed those cultural problems to emerge at WeWork?\n\nHorowitz: Oftentimes a cultural strength ends up being — if you're not careful, it can be a weakness. With WeWork — and I don't know the company that well — they had this wonderfully optimistic culture that they could do anything. They were going to change the nature of business. So a very big mission and a very big vision. And beyond that, they were able to not just raise a lot of money but bring in amazing talent. Superstar engineers. That was a strength.\n\nI think that the weakness was the optimism was so relentless that they let small problems become forest fires. I'm sure somebody at some point said at the rate we're burning cash, we could run into a real problem. But if you're totally optimistic, you'll be like, it's no problem. We'll just raise more money or, or what have you. And so these kinds of things sometimes work together.\n\nLebowitz: I wonder what your advice is to early-stage company founders today who want to get ahead of those issues, like letting your strengths become your weaknesses.\n\nHorowitz: I talked about this a bit in the book. It's really important to at least try to anticipate how a culture might be weaponized against you or lead to a bad situation and what you can do to medicate that or define the virtue in a way that provides clarity. One of my favorites is from the way of the samurai [bushido], where they say politeness without honesty is empty. Right? You can be nice to somebody, but if you don't mean it, then there's nothing. The thing is not to be dishonest and overly polite and not tell people the truth, because that's just empty. That stops people from taking something too far.\n\nYou contrast that with Stewart [Butterfield] at Slack. Early on in Slack, empathy was a big part of the culture. They just said empathy, but they didn't define it in a way that people understood clearly enough. So people turned it around and said, well, if you're giving me feedback, you're not very empathetic. That's a classic version of that. When you're talking about behavior, you really have to get all the way to exactly what you mean as opposed to just a high-level definition.\n\nNo one ever talks about 'how good Uber was on so many aspects of their culture'\n\nTravis Kalanick, former Uber CEO. (AP Photo/Paul Sakluma, File)\n\nLebowitz: In the book you also talked about how Uber had this hyperfocus on competitiveness at all times. That may have worked against them eventually. Can you talk more about that and what we can learn from that particular instance?\n\nHorowitz: This is one of the things that doesn't get talked about enough, how good Uber was on so many aspects of their culture. I would say Travis did one of the better jobs in Silicon Valley of constructing the culture. It was very unique. It was super well-defined. They trained people on it. They did a lot of things right.\n\nBut competitiveness and winning were so heavily emphasized, incredibly heavily emphasized, and there wasn't really a counterbalance to that. And as the company grew, it got interpreted in ways that ended up being destructive. The most famous one is the HR manager who got the sexual harassment complaint from Susan Fowler, including the actual texts where she was being harassed.\n\nAnd the [HR] manager said, 'Well, that manager is a high performer, so we're not going to do anything.' There's no way that that instruction would have come from the CEO. I don't care how bad your culture is. Nobody's that ridiculous. Having talked to people about it, [I learned that] Travis was super mad when he found out about it because he's like, 'Look, we're a meritocracy. That's not ok to harass employees.' But because the culture was so strong on winning, that was the interpretation.\n\nToussaint Louverture led the 18th-century Haitian slave revolution. Wikimedia Commons How do you stop that? One example that I used is from the Haitian revolution, where you have a situation where you really need to win. This is a slave revolt. You're fighting Napoleon. So it's a very long-odds situation. One of the incentives that every other army on the colony had — be it the French army, the British army, or the Spanish army — was if they won they got to pillage. And Toussaint said, 'We want to win. But you can't do that. You have to remember what we're fighting for and what we're fighting for is liberty. And you can't get liberty if you're in the business of taking away people's liberty. We've got to stay true to it.'\n\nAnd that cultural constraint that he put on it ended up being very powerful for him in that, the white women on the colony supported Touissaint over the French or the British, which was amazing, or the Spanish. To the point where they even refer to him as 'father' because they were just so happy to have somebody winning who wasn't raping and pillaging and have this army causing death and destruction wherever they went.\n\nIt all came from this constraint, saying 'We're going to win, but we're going to be ethical.' I talked about that in the book. You have to make ethics explicit because people don't infer them. That was probably the thing that Uber ran into. They were very explicit about being competitive and winning, but they weren't explicit on what you would not do to win. Whereas Touissaint really was.\n\nLebowitz: Going back to Uber, they were explicit about being a competitive organization, but they were not as explicit about what they would not do to win. And that led to some misinterpretation or dilution of the mission or the vision.\n\nHorowitz: The bigger the organization, the trickier that gets. The easier it becomes to get misinterpreted because people are no longer speaking with you directly. They're speaking to some kind of reflection of what you said. You just have to be incredibly intentional to get those kinds of things right. It's a big reason I wrote the book. I just felt like people talk about culture, but like they don't talk about how difficult it is and all the things you need to do to get it right. And nobody gets it completely right. But I felt like there was just a dearth of knowledge about how to go about it.\n\nWhy being a small company can be a cultural advantage\n\nLebowitz: Pretty much every company that I know has people all over the world, people working from home. So what is your best advice for building and sustaining a healthy company culture among these remote, distributed teams?\n\nHorowitz: It's super tricky, and it's even more tricky if they're not teams. If it's just an individual working from their home in Nebraska. The big gap is the quality of the communication, which is the key to creating social norms. I think the good news is the tools for that have gotten much more interesting. Slack was probably the big breakthrough that made it possible to start to coordinate work in general, but culture as well, across geographies. There are new tools like Tandem [editor's note: Andreessen Horowitz led Tandem's seed round] that helped with that. That's probably the most basic thing because, to be honest with you, for the first two or three decades of the technology industry, remote work didn't work at all.\n\nMicrosoft used to famously — if they acquired a company, they would move them to Redmond and they wouldn't buy you unless you were willing to move to Redmond. That was literally the state of the communication technology in those days. So it has gotten better in that way. There's not a totally easy answer, but you have to be more intentional about the rules and more thoughtful. Probably the culture is just going to end up being less comprehensive. You have to say, Ok, here are the things that we have to have, ways in which we're all going to behave, and there's going to be a whole set of things that I would like to do, but I'm not going to be able to do it because there's no way to get that to happen. Like from here to Krakow, Poland, to Bangalore. It's just too difficult.\n\nShaka Senghor was imprisoned for murder. He's now an advocate for criminal justice reform. Prince Williams/Getty Images\n\nLebowitz: There's an anecdote in the book about a CEO [Mary Barra at GM] who said everyone can dress informally, and then there was an argument because some employees did need to dress more formally. But the solution turned out to be better communication.\n\nHorowitz: One big advantage Shaka [Senghor, who spent 19 years in Michigan prisons after murdering a man in 1991, and is now an author and advocate for criminal justice reform] had is he would have basically the whole team meet together. They all had lunch together every single day. [Editor's note: In the book, Horowitz describes how Senghor changed the culture in Michigan state prison.] You can do that with a small team and you get cultural cohesion that's hard to achieve at scale. When you have that kind of proximity, the smaller size is a big advantage.\n\nAndreessen Horowitz initially passed on Airbnb. They got a second chance when the startup pitched them again in its Series B financing round.\n\nLebowitz: In the book, you mention that Andreessen Horowitz always gives entrepreneurs feedback, even if you're rejecting someone. How do you find time to do that, given all the many entrepreneurs who pitch you?\n\nHorowitz: It's the most important thing to us because it's the cultural virtue that we built the firm on. It's this idea of respect for the entrepreneur and really understanding what it means to build a company, how hard it is, what they're going through, and so forth. It turns out that that's a really difficult one to implement in a venture capital firm. And the reason is the basic dynamic of the relationship is the entrepreneurs are asking you for money. If you're the one giving the money, you feel like the big person and they're the little person. You're the authoritative figure.\n\nBut that's very dangerous because that quickly slides into disrespect. And we found that when we were entrepreneurs the two things that really were the biggest signs of disrespect: Despite the fact that every venture capital firm would say that they have respect for the entrepreneur, they show up really, really late to meetings with you. Like 30, 40 minutes late. And then they never get back to you if they weren't going to invest; they just ghost you.\n\nSo we thought, ok, it's great to say you have respect for entrepreneurs, but what are the actions? And the two kinds of actions that we settled on that would set the culture were: One, you're always going to be on time and the penalty for that is $10 a minute.\n\nThe other one was you always get back to people. We run a survey with the entrepreneurs we rejected and if your [the VC's] NPS [net promoter score] with entrepreneurs you've rejected falls below a pretty high level, that becomes a very big problem for you here. So everybody knows that's what we measure, that's what we believe. It just became part of the culture that I wouldn't even meet with somebody if I didn't have time to reject them.\n\nLebowitz: When you survey the rejected entrepreneurs, this is like asking about their candidate experience?\n\nHorowitz: Yeah. What was the process like? Were you treated professionally? Did we get back to you?\n\nLebowitz: And when you do get back to them and say, unfortunately we're passing, do you give —\n\nHorowitz: Oh, no. You're required to say why. That's the difficult part because you don't want to hurt their feelings. Sometimes it's a little subtle because you're like, wow, this person really isn't ready to build this company. That one gets a little more nuanced on the feedback because you don't want to squash them. But a lot of times it'll be something like, well, the competitive landscape is just so crowded and we don't think the market is that big. Or you have a good product idea, but we don't know how you're going to get past the first set of customers and you haven't really thought about it yet. Basically what we think.\n\nAirbnb CEO Brian Chesky. Kimberly White/Getty Images for Fortune It's been great because we get a lot of feedback from entrepreneurs saying, you were right about the feedback. You're wrong about the company. Because we took that feedback, we fixed it, and now we're doing great. That's awesome to hear. Whether we invest or not, it's so much better for everybody when entrepreneurs succeed.\n\nLebowitz: Do entrepreneurs ever come back to you once they fix their business and ask for money again?\n\nHorowitz: Definitely. In fact, the way I word it when I reject an entrepreneur is I say, 'Look, we're often wrong about these things, and we certainly hope that you prove us wrong in this case. And if you do, please come back. We'll invest at a higher valuation.' That definitely has happened. Airbnb is one case. And that was lucky for us that they came back. [Editor's note: Andreessen Horowitz initially passed on Airbnb. When Airbnb pitched the firm again during its Series B financing round, they decided to invest.]\n\nAndreessen Horowitz would never call itself a 'founder friendly' investor\n\nLebowitz: I wonder what your thoughts are on how Andreessen Horowitz defines being 'founder friendly' and how that approach has changed in the recent past.\n\nHorowitz: In our cultural doc, I wrote it very specifically as we're not founder friendly because I don't like the word like friendly. It implies something that we can't ever live up to. It's a different kind of entity and has a lot of implications that we won't even aim to get to in this kind of relationship. The way we describe it is we want to be the best venture capital firm for an inventor who wants to run his or her own company. And what that means culturally is a respect for the task and how difficult it is. And what it means operationally is that we're going to give you the kind of advice that will help you become a CEO and then provide for you the kind of network that great professional CEOs have.\n\nNow, with all of that, it's still quite possible that the founder isn't able to do a great job and isn't a great leader for the company. And then our obligation is to the employees. It's not to the founder at that point and we have to do the right thing. We're never thought of it as founder friendly and we want to be super nice to them so that they'll like us better. That's not really what we're about.\n\nLebowitz: Is there anything else you want to add?\n\nHorowitz: There's one thing that I do like to say. It goes with this book. I say to the people here all the time, if you're running an organization 30, 40 years from now, nobody's going to remember the deals that you won or the deals that you lost, or how a quarter went. But they're all going to remember what it felt like to work there and what it was like to do business with you and the impact that you had on everybody's life. And that is a product of your culture. That's why this book is important and this is why it was important to me to write, because I think that really is the impact of these ventures that we're putting out there and funding.\n\nLebowitz: Thank you, Ben, so much for sharing all your wisdom and ideas. I really enjoyed talking to you.\n\nHorowitz: Thank you. That was fun.", "description": "Ben Horowitz also shared his thoughts on hiring for culture fit, and why his firm gives feedback to every founder they decline to invest in.", "authors": ["Shana Lebowitz"], "top_image": "https://image.businessinsider.com/5db33a67dee0196c3658d9c3?width=1200&format=jpeg", "published_at": "2019-10-29"}