{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/8/the-latest-purdue-says-little-harm-to-pause-sackle", "downloaded_at": "2019-10-09 00:59:30.224824+00:00", "title": "The Latest: Purdue says little harm to pause Sackler suits", "language": "en", "text": "The Latest on Purdue Pharma’s settlement efforts (all times local):\n\n6:20 p.m.\n\nPurdue Pharma is telling a judge that letting lawsuits continue against the company’s owners would deplete the assets it wants to use in a settlement.\n\nBut the OxyContin maker says stopping them would not cause much harm to the states suing members of the Sackler family.\n\nAttorneys general for 25 states and lawyers for more than 500 local and tribal governments have asked a judge to let actions against family members move ahead.\n\nIt’s a key question in bankruptcy court, where a judge is working through Purdue’s attempt to settle some 2,600 lawsuits over the opioid crisis.\n\nThe company has said that if the Sacklers face litigation across the country, they may not be willing or able to kick in the $3 billion to $4.5 billion they have said they would contribute to a settlement.\n\n___\n\n3 p.m.\n\nArizona’s attorney general is having misgivings about agreeing to Purdue Pharma’s proposal to settle litigation over the opioid crisis.\n\nAttorney General Mark Brnovich said in a court filing late Monday that the OxyContin maker has “sought to undermine material terms of the deal.”\n\nThe Republican agreed to the Purdue settlement right before the company filed for bankruptcy protection.\n\nHis filing is similar to those made last week by attorneys general in two dozen states and lawyers for more than 500 local and tribal governments.\n\nThey oppose the settlement and want to continue lawsuits against members of the family that owns the company.\n\nBrnovich took their side and said that lawsuits against Purdue should move forward, but that he hasn’t pulled out of the settlement.\n\nPurdue declined to comment.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Latest on Purdue Pharma's settlement efforts (all times local):", "authors": ["The Washington Times Http", "The Associated Press"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/08/opioid_crisis_sackler_lawsuits_56230_c0-144-3452-2156_s1770x1032.jpg?70e7f13edf12b523fe0faff8cb2cd1d18f177355", "published_at": "2019-10-08"}