{"pub": "washingtonpost", "url": "https://washingtonpost.com/nation/2019/09/23/daughter-racially-profiled-mall-cop-sitting-car-loiter-oregon", "downloaded_at": "2019-09-23 10:34:32.384467+00:00", "title": "A lawmaker says her daughter was ‘racially profiled by a mall cop.’ Now she’s calling for a ‘loiter-in.’", "language": "en", "text": "\n\nOregon state Rep. Janelle Bynum (D), left, stands with her daughter, Christine. Both say they have been the targets of racial profiling near Portland, Ore.\n\nWhen a mall security guard tapped on her car window, 17-year-old Christine Bynum didn’t know what she and her two friends had done wrong. The Oregon teenagers had trekked back to Christine’s silver 2004 Buick Century to brainstorm new Friday night plans after being turned away from an R-rated movie because one friend had forgotten her ID.\n\n“We were sitting in the car for no more than 20 minutes, when a very authoritative mall cop circled around the car,” Christine told The Washington Post in a text message late Sunday evening. The girls, who are black, were drinking chocolate milk, eating Kit Kat bars and looking at homecoming dresses on Pinterest, she said.\n\nThe security guard told the girls the mall had “very strict policies for loitering,” said Christine, an honor-roll student with a big smile and glasses. “We didn’t even know what the word meant,” Christine told her mother, Oregon state Rep. Janelle Bynum (D).\n\nThe girls knew the guard was asking them to leave, so they drove four miles to a local park to look up “loitering” on their phones.\n\n“We were confused and didn’t feel that sitting in the car laughing and eating candy qualified as ‘strictly prohibited’ activity,” she said. Christine said the girls saw other people waiting in their cars in the parking lot, and she was unsure why they were singled out.\n\nBy the time she got home and told her parents what had happened, Christine thought she knew why the teens had been kicked out of the mall in a suburb outside of Portland, Ore.\n\n“She believes she was racially profiled by a mall cop,” her mom said on Facebook.\n\nOn Sunday, the state legislator took to social media to encourage people in her district to show up at the Clackamas Town Center mall for a “loiter-in” over the next week, suggesting that people should wait in the food court, sit on benches in the mall and scroll through their social media accounts in the parking lot.\n\n“Go see how long it takes to be asked to leave the mall by mall security,” Bynum wrote. “Let’s figure out if there’s a difference between loitering or being the wrong color.”\n\n\n\nChristine Bynum, 17, was hanging out with two friends at an Oregon mall when a security guard abruptly ordered the girls to leave. (Craig Mitchelldyer/Craig Mitchelldyer)\n\nThe general manager for the Clackamas Town Center did not immediately return a request for comment late Sunday evening. Bynum said the general manager had emailed her Saturday requesting to speak with her and Christine about the incident, but they have not yet met.\n\nThe alleged incident of racial profiling comes more than a year after Bynum, while campaigning door-to-door for reelection, had a woman call the local sheriff’s office to report her as “suspicious.” The incident made national headlines as part of a pattern of white people calling police on black neighbors doing everyday tasks, from cutting grass and selling bottled water to napping in a dorm lounge and sitting in a Starbucks. The calls inspired the viral hashtag #LivingWhileBlack.\n\nAfter the Clackamas County Sheriff’s Office interrupted her campaigning, Bynum, who is the only black person serving in the state House of Representatives, introduced a bill that allows the targets of racially-motivated 911 calls to sue in small claims court for $250. The bill passed in June and will go into effect in Jan. 1.\n\n“I still have flashbacks to the campaigning event,” Bynum told The Post in a statement. “Behind my smile was a sense of just having to muscle through the pain so I could keep talking to neighbors that day. But the truth is, it is deeply insulting and emotionally draining to be accused of being a common criminal when I’ve been a public servant, business owner, and am well-educated.”\n\nIn court records, officers recently called the Clackamas Town Center parking lot a “common spot for interstate drug deals,” the Oregonian reported. But the drug busts at the mall have involved adults carrying massive loads of heroin and methamphetamine.\n\nA black woman who said she works at the mall as a hair stylist wrote on Facebook that she’d had a similar experience to Christine while eating lunch in her car, as she often does during the workday.\n\n“A security guard I’d never seen before pulls up along side my car,” Arjorie Arberry-Baribeault said. The guard rolled down his window and asked her if she was an employee, then drove away. “I was taken a bit back because of how ‘tough’ he was coming off towards me,” she added.\n\nRacial discrimination has been a perennial problem in Portland, Ore., which has been described as the whitest major city in the U.S. Despite that history, Christine said she was still shocked at her treatment by the security guard.\n\n“Never in my life did I think I would be singled out by someone in my own community,” Christine told The Post. “I grew up at this mall, many could even call it my second home. Yet with an experience like this, knowing that we’ve been called out because we looked different, it feels unsettling.”", "description": "A black Oregon lawmaker's daughter was kicked out of a local mall for \"loitering.\" It's not the first time the family says it's faced racial profiling in the whitest major city in America.", "authors": ["Katie Shepherd", "Morning Mix Reporter", "September At Am", "Katie Shepherd Is A Reporter On The Washington Post'S Morning Mix Team. Before Joining The Post", "She Was A Staff Writer At Willamette Week In Portland"], "top_image": "https://www.washingtonpost.com/resizer/3QZVOeolukBNFoHOC9L7VBXmV9U=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7SS5JIARSNBPZNNSNYGRKOPATI.jpg", "published_at": "2019-09-23"}