{"pub": "theverge", "url": "https://theverge.com/2019/10/16/20918044/stranger-things-break-record-third-season-netflix-earnings-report-bird-box", "downloaded_at": "2019-10-16 23:13:05.090785+00:00", "title": "Netflix says Stranger Things’ third season is record-breaking, but what does that mean?", "language": "en", "text": "There’s no question that Stranger Things is one of Netflix’s most popular shows, but we have to question whether it’s as record-breaking as Netflix claims. The company reported in its third-quarter earnings that Stranger Things’ third season is “the most watched season to date,” with “64 million member households” watching it within the first month of its release.\n\nNetflix isn’t exactly forthcoming about how it collects those numbers. In the past, the company has said that it counts one view for a film such as Bird Box when a Netflix viewer’s account completes at least 70 percent of the film. The logical leap would be to assume that Netflix counts a season being watched as one account completing at least 70 percent of every episode that season. That would be approximately 5.6 episodes worth of Stranger Things’ 8-episode third season.\n\nExcept that’s not how Netflix counts views for seasons of a show. A footnote in Netflix’s fourth quarter earnings letter to shareholders in 2018 states that for each series, “due to their highly variable length, we count a viewer if they substantially complete at least one episode (70 percent).” That’s 70 percent of one episode, not 70 percent of an entire season. The number was first used to talk about Elite, a Spanish teen drama that has become a phenomenon on sites like Tumblr. Netflix reported that 20 million accounts watched the show’s first season in four weeks.\n\nThat’s 70 percent of one episode, not 70 percent of an entire season\n\nSince then, Netflix has used this methodology for all of its reported numbers, a Netflix representative confirmed to The Verge. Since Netflix doesn’t work with third-party companies like Nielsen to confirm those numbers, it’s difficult to say just how accurate they are. Nielsen did its own independent study when Stranger Things’ third season first debuted, and found that 26.4 million unique viewers in the United States watched the show within its first three days. Netflix’s own report discovered that more than 40 million people watched the show within its first four days globally. To be fair, Nielsen’s numbers don’t take into account mobile, tablet, or laptop viewing.\n\nWhat’s obvious from both sets of numbers is that Stranger Things is an obvious hit for Netflix. What’s interesting about Netflix’s reported numbers is which shows and films it decides to disclose viewership results for, and which ones it doesn’t. Netflix has hundreds of original shows and films, but only discloses numbers for a select few. The numbers the company discloses are always positive, shedding a light on its major successes. While traditional broadcast networks also spotlight their top performing shows, Nielsen provides an unfiltered look at how every show is performing. Box office numbers do the same thing for films. Netflix doesn’t have that sort of oversight.\n\nOf course Netflix wants to show that its films and TV shows are being watched around the world, but it’s more important than ever right now. Disney and Apple are entering the streaming market in less than a month, and are expected to take some attention away from Netflix. Stranger Things is considered a show that will bring in and retain subscribers, so it’s a good flag to wave. The urgency is also probably why Netflix signed a massive overall deal with Stranger Things showrunners Matt and Ross Duffer, who will produce more series and films for Netflix.\n\nNetflix only released numbers for a few other shows this quarter: La Casa de Papel, Sintonia, The Naked Director, and Sacred Games. They help demonstrate the attention Netflix wants to pay to its global market, but numbers for five shows isn’t enough to help us see whether Netflix’s original content is performing well, period. How many people are watching full seasons of shows is a question, yes, but also: how many people are watching Netflix’s original shows in general?", "description": "There’s no question that Stranger Things is one of Netflix’s most popular shows, but we have to question whether it’s as record-breaking as Netflix claims. The company reported in its third-quarter earnings that Stranger Things’ third season is \"the most watched season to date,\" with \"64 million member households\" watching it within the first month of its release, but that number isn’t the number you  might expect.", "authors": ["Julia Alexander", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/uYhpfkJgVlofRR3d9qlnlZT5XWE=/68x0:1271x630/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/6874549/Screen_Shot_2016-08-01_at_4.32.07_PM__2_.0.png", "published_at": "2019-10-16"}