{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7617041/Is-Southend-bridge-far-Sol-Campbell-illustrious-backroom-team.html", "downloaded_at": "2019-10-27 00:36:22.921447+00:00", "title": "Is Southend a bridge too far for Sol Campbell and his illustrious backroom team?", "language": "en", "text": "The only man at Roots Hall that wasn’t panicking after watching Southend get turned over 7-1 by Doncaster Rovers on Tuesday was Sol Campbell.\n\nThe new Southend boss, sat in the stands, pulled off the great escape at Macclesfield last season in League Two, and this was to be his sequel. Macclesfield were seven points adrift when he took over 11 months ago and survived; Southend were eight before kick-off here.\n\nOn Saturday, in front of a crowd of 8,600, there was a standing ovation when his name was read out over the PA system. He smiled, waved to the three stands housing home fans and for the first time in a while, there was belief that things could get better.\n\nSol Campbell took over the reigns at struggling League One side Southend United on Tuesday\n\nThe former Arsenal defender appointed Hermann Hreidarsson and Andy Cole as his assistants\n\nThe wind was blowing, the rain was coming down as Campbell stood calm, hands in his pockets, hoping his unflappable demeanour would translate to a side with next to no confidence after just one league win all season.\n\nBut come full-time his job description was laid brutally bare. Ten goals conceded at home in a week. Even Emile Acauah’s first senior goal late on couldn’t raise a smile.\n\nPositive body language appeared to be key from the off for the former Arsenal and Tottenham defender. There was no point coming in after a couple of days and berating players at things they know they are doing wrong.\n\nHe focused on his defenders, clapping when they pulled each other into a line and held their shape. That is what Campbell wants for this side, a leader, much like he was as a player, leading from the back.\n\nThere was tentative excitement from supporters that things could be turning for the better and his influence appeared to have an immediate impact four minutes in when Rob Kiernan rose to head in - only for the linesman to rule it out for offside.\n\nCampbell gives out instructions and maintained positive body language on the touchline\n\nCampbell had already turned away with a double-fist pump celebration. He was unmoved when it was chalked off but it was positive, nonetheless.\n\nFour minutes later, though, Campbell saw for himself how much work he still has to do. A ball over the top was collected by Kayden Jackson, who teed up James Norwood to slot in for 1-0.\n\nCampbell walked over to Andy Cole and Hermann Hreidarsson, part of his newly-formed backroom team, put both his arms on top of the dugout and looked exasperated.\n\nIt was the most visibly disappointed he was all afternoon but with his back to the pitch, he refused to let his players see it show on his face.\n\nThe keep calm and carry on approach was parked from that moment, then came the animation, the pointing, the shouting, the clapping. Campbell needed to spark life into himself and his players.\n\nDespite a promising start, Ipswich strolled away from Campbell's stricken Southend side\n\nNoticeably he never sat down in his dugout and both Cole and Hreidarsson never stood in the technical area all game. While early days, it gave a sense as to who will coach, and who will manage to get the club out of this mess.\n\nNorwood and Jackson added gloss to send Ipswich top late on but that was none of Campbell’s concern. His own house was crumbling while the neighbours had a party to go back top.\n\nThis appeared a scouting mission on his own side, learning and observing what tools he had at his disposal, often stood motionless in his technical area in doing so. What will he have learned? Things may get a lot worse before they get better.", "description": "NATHAN SALT AT ROOTS HALL: This appeared a scouting mission on his own side, learning and observing what tools he had at his disposal, often stood motionless in his technical area in doing so.", "authors": ["Nathan Salt For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/18/20221186-0-image-a-9_1572110316453.jpg", "published_at": "2019-10-26"}