{"pub": "hotair", "url": "https://hotair.com/archives/john-s-2/2019/09/18/elizabeth-warren-cant-tell-truth-middle-class-tax-hikes-even-stephen-colberts-help", "downloaded_at": "2019-09-18 23:21:56.931121+00:00", "title": "Elizabeth Warren won’t tell the truth about middle-class taxes despite Stephen Colbert pleading with her to do so", "language": "en", "text": "Elizabeth Warren appeared on the Stephen Colbert show Tuesday night. Colbert’s interview quickly turned into a public attempt to help Warren craft a more honest answer about one of her main policy proposals, Medicare for All. Colbert did his best to make the case that Warren should stop avoiding the fact that her plan would necessitate raising middle-class taxes.\n\nColbert set up the segment by calling her Medicare for All proposal the “most radical” of all of her positions. Warren quibbled with that but then Colbert got to his question. “You keep being asked in the debate ‘How are you going to pay for it? Are you going to raise the middle-class’ taxes?'” Colbert said.\n\nWarren then launched into her well-rehearsed spiel about raising “costs” on the wealth and concluded, “hard-working middle-class families are going to see their costs go down.” Of course, that wasn’t the question.\n\n“But will their taxes go up?” Colbert asked again.\n\n“But here’s the thing…” Warren said.\n\n“No, but here’s the thing,” Colbert interjected. He continued, “I’ve listened to these answers a few times before and I just want to make a parallel suggestion for you about how you might defend the taxes that perhaps you’re not mentioning in your sentence.\n\n“Isn’t Medicare for All like public school? There might be taxes for it, but you certainly save a lot of money on sending your kids to school, and do you want to live in a world where your kids aren’t educated? Do you want to live in a world where your fellow citizens are dying, even if it costs a little bit of money?”\n\nWhat Colbert is really arguing here is that you can offer a defense of M4A without running in circles rhetorically to avoid admitting that it will require higher taxes. It’s a plea for being more forthcoming with the American people. Even Bernie Sanders, who also supports M4A, has admitted it would require raising taxes on the middle-class.\n\nThis is exactly what Warren is refusing to say. But instead of dropping the talking points at Colbert’s prompting, she launched into a filibuster answer that lasted more than two minutes.\n\nAt the end of her spiel, Colbert could have easily destroyed Warren by simply asking her once again, “But will their taxes go up?” That would have highlighted the way in which her lengthy answer never answered his simple question. It probably would have become a viral clip on social media as well. But Colbert is a Democrat and he’s not interested in playing hardball with Democrats, especially ones who have a real shot at securing the nomination. So when Warren was finally finished with her non-answer, Colbert quickly moved on.\n\nTo sum this up, Colbert spends most of this segment trying to encourage Warren to be more honest and when she refuses to take his advice he gives her a pass. You can probably imagine how this would have gone if a Republican candidate were similarly dancing around the truth. Here’s the clip:", "description": "\"But will their taxes go up?\"", "authors": ["John Sexton", "Ed Morrissey", "Jazz Shaw"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/Warren-Colbert.jpg", "published_at": "2019-09-18"}