{"pub": "washingtontimes", "title": "Actor Isaiah Washington, #WalkAway supporter, slams Hollywood's closeted conservatives as 'cowards'", "url": "https://washingtontimes.com/news/2019/aug/27/isaiah-washington-walkaway-supporter-slams-hollywo", "language": "en", "published_at": "2019-08-27", "downloaded_at": "2019-09-02 07:45:28.386806+00:00", "text": "Actor and producer Isaiah Washington, who famously joined the anti-Democratic Party #WalkAway movement earlier this year, said Monday that closeted conservatives in Hollywood are “cowards” for not voicing their beliefs out of fear of being blacklisted.\n\n“I have a message for the Hollywood Actors DM’ing me and revealing that you’re Conservatives,” wrote Mr. Washington, best known for his roles in the CW’s “The 100” and ABC’s “Grey’s Anatomy.”\n\n“Don’t DM me again, because you all are lame and I don’t respond well to hypocrites or cowards,” he wrote. “You’re no different than the bystander that is waiting on the blood to spill from a martyr.”\n\nConservative actors, including Nick Searcy, Dean Cain and Kristy Swanson, praised the tweet.\n\nOh hell yes my brother. https://t.co/nvhgxQLeWn — Nick Searcy, INTERNATIONAL FILM & TELEVISION STAR (@yesnicksearcy) August 27, 2019\n\n\n\nMr. Washington, a Green Party supporter, made headlines earlier this year after he joined Brandon Straka’s #WalkAway movement, which encourages people to leave the Democratic Party. Mr. Washington told Ben Shapiro’s The Daily Wire in April that he joined the movement “to support those who are just doing everything they can to stand on their own and say, ‘I don’t think this way.’ “\n\n“I’m willing to have a town hall and I’m willing to have a dialogue that is not filled with nonsense that I think all of us are tired of, and even more tired of being used and exploited to pit our differences against one another,” the actor said at the time, days before he participated in a #WalkAway town hall in Los Angeles with Joy Villa, Jesse Lee Peterson, Angela King and Major Williams.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Actor and producer Isaiah Washington, who famously joined the anti-Democratic Party #WalkAway movement earlier this year, said Monday that closeted conservatives in Hollywood are \"cowards\" for not voicing their beliefs out of fear of being blacklisted.", "authors": ["The Washington Times Http", "Jessica Chasmar"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/04/02/AP_19068760026221_c0-228-4447-2820_s1770x1032.jpg?32aa9ffb66e44bc83d7717b8a128ffd3496cfee1"}