{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7575097/Samuel-Umtiti-set-Barcelona-return-five-months-knee-injury.html", "downloaded_at": "2019-10-15 12:29:57.521915+00:00", "title": "Samuel Umtiti set for Barcelona return after five months out with knee injury", "language": "en", "text": "Samuel Umtiti is set to return to action for Barcelona this weekend after a frustrating five months out with a knee injury.\n\nUmtiti last played in Barca's penultimate game of last season, a 2-0 victory against Getafe at the Camp Nou on May 12.\n\nThe France international sustained an injury to his knee and has been sidelined since but he is now set to make his return against Eibar on Saturday, according to Spanish outlet Mundo Deportivo.\n\nSamuel Umtiti is yet to play a competitive game this season for Ernesto Valverde's Barcelona\n\nUmtiti has been an onlooker so far this season, but is set to return to action this weekend\n\nSAMUEL UMTITI Age: 25\n\nPosition: Centre back\n\nClubs: Lyon (2012-2016), Barcelona (2016-present)\n\nNational team: France - 31 caps\n\n2018-19 appearances: 15\n\nWith Gerard Pique suspended for the trip to Eibar after picking up a fifth yellow card of the season against Sevilla before the international break, Umtiti could slot straight back into the starting XI.\n\nBut Barcelona boss Ernesto Valverde may be keen to play Umtiti from the bench, given his lack of competitive action, with El Clasico against Real Madrid looming on October 26.\n\nThe 25-year-old has missed Barcelona's last ten matches in all competitions, but his deputy - compatriot Clement Lenglet - has performed well in his absence, alongside Pique.\n\nAs such, Umtiti was a regular substitute in the latter half of last season, as Barca won La Liga and reached the semi-finals of the Champions League.\n\nBarcelona are currently second in La Liga after a mixed start to the season, accumulating 16 points from eight games and two points behind Real Madrid.\n\nUmtiti, who signed for Barcelona from Lyon in 2016, was linked with moves to Arsenal and Manchester United over the summer, but remained in Spain.", "description": "With Gerard Pique suspended for the trip to Eibar after picking up a fifth yellow card of the season against Sevilla, Umtiti could slot straight back into the starting XI on his return from injury.", "authors": ["Kieran Jackson For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/12/19738152-0-image-a-41_1571139458423.jpg", "published_at": "2019-10-15"}