{"pub": "news24", "url": "https://news24.com/World/News/netflix-producer-accuses-weinstein-of-persistent-sexual-assault-20180502", "downloaded_at": "2019-10-26 00:09:47.640611+00:00", "title": "Netflix producer accuses Weinstein of persistent sexual assault", "language": "en", "text": "A Netflix series producer has filed court documents in New York alleging disgraced Hollywood mogul Harvey Weinstein raped, sexually assaulted and verbally abused her over a five-year period.\n\nAlexandra Canosa, an associate producer of \"Marco Polo\", had initially filed a $10m suit in December, and this week amended it to further detail her allegations against the 66-year-old father of five.\n\nShe said Weinstein \"constantly threatened\" her and \"made it clear that if she did not succumb to his demands for sexual contact or if she exposed his unwanted conduct there would be retaliation, including humiliation, the loss of her job and loss of any ability to work in the entertainment business\", according to documents filed on Monday.\n\nThe misconduct included sexual and physical assault and multiple instances of rape between 2010 and 2015, according to the updated filing.\n\nDefendants including the Weinstein Company \"knew or should have known about Harvey Weinstein's conduct, and did not act to correct or curtail such activity\", Canosa alleges.\n\n\"Instead, defendants facilitated, hid and supported his unlawful conduct.\"\n\nDenial\n\nIn August 2017 Canosa says Weinstein – who more than 100 women have accused of sexual misconduct ranging from harassment to rape since exposes published in The New York Times and The New Yorker in October – verbally threatened her against speaking out.\n\nThe deluge of allegations has finished the former movie magnate's career: In October his eponymous film studio company sacked him and he is facing a number of other lawsuits.\n\nWeinstein denies any allegations of non-consensual sex and has said there were never \"any acts of retaliation\" against women for refusing his advances.\n\nThis week actress Ashley Judd, one of the first women to publicly accuse Weinstein, sued him on the grounds that he defamed her after she rejected his advances.\n\nJudd said in a prepared statement that any damages she wins will go to the Time's Up legal fund, \"so that women and men in all professions may have legal redress for sexual harassment, economic retaliation and damage to their careers\".\n\nKEEP UPDATED on the latest news by subscribing to our FREE newsletter.\n\n- FOLLOW News24 on Twitter", "description": "Alexandra Canosa, an associate producer of \"Marco Polo\", had initially filed a $10m suit in December, and this week amended it to further detail her allegations against the 66-year-old father of five.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/4852/a5d22e0a82304cf48d402ce36a2d0574.jpg", "published_at": "2018-05-03"}