{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-england-manchester-49690653", "downloaded_at": "2019-09-15 14:27:39.576677+00:00", "title": "The Stockport woman who befriended a Death Row murderer", "language": "en", "text": "Image copyright Mary Hardiman Image caption Mary Hardiman has flown to Texas twice to meet Chuck Mamou in prison\n\nFor the past 18 months, Mary Hardiman has been writing to a penpal who lives more than 4,500 miles away from her Stockport home.\n\nBut it is not just the distance that is unusual - her friend is a prisoner waiting to be executed in Texas.\n\nCharles Mamou, known as Chuck, has spent 20 years of his life on Death Row.\n\nHe lives in solitary confinement at the Polunsky Unit in West Livingston near Houston.\n\nImage caption When he was convicted, Chuck Mamou was a drug dealer and could not read or write\n\nMamou, originally from Louisiana, was convicted of the murder of Mary Carmouche in 1999 after a botched drug deal.\n\nThree men were shot and Mamou, who was 24 and a father-of-five, drove away with the 17-year-old girl and shot her.\n\nHe has claimed he is innocent but has exhausted all of his appeals and could get a date for his execution any day.\n\nMrs Hardiman said her Catholic faith was what led her to start writing to Mamou.\n\nImage caption Mary Hardiman has received about 80 letters from Chuck Mamou\n\nShe got in contact with him through a charity called Lifelines, after being inspired by a speech from Sister Helen Prejean at a Catholic conference.\n\nMiss Prejean is the author of Dead Man Walking, which tells of her pen-friendship with a prisoner.\n\n\"Since the age of 11, I've been a penfriend,\" Mrs Hardiman said.\n\n\"I've written to thousands and thousands of people, all my life and this was a skill and something I could do.\"\n\nShe said the two of them wrote about \"anything\" and it did not matter to her whether Mamou was innocent or not.\n\n\"Even the most hardened of criminals can soften given the right conditions,\" she said.\n\nImage caption She said it does not matter whether Mamou is innocent or not\n\nBut what would she say to those who may think she should direct her compassion to the victim's family?\n\n\"People have said that to me,\" she said.\n\n\"We all need love, we all need support, we all need somebody to help us when times are really difficult and I think that's the essence of faith in action.\"\n\nMamou said the letters \"sooth\" him and distracted him from the \"chaos\" of life on Death Row.\n\n\"She loves me like a brother, like a friend,\" he said.\n\nHe said their relationship was \"platonic in nature and genuine at the core\".\n\nImage caption Mary Hardiman has visited Chuck Mamou twice in prison\n\nMrs Hardiman has now visited him twice and knows his death could be imminent.\n\n\"I have thought about offering to be there at the end, whether he'd want that or not, I don't really know,\" she said.\n\n\"I just think really the main thing is that if this is the last time I've seen him then at least I've seen him and done something I wouldn't normally have done - and I will never ever regret that experience, ever, not for one moment.\"\n\nYou can see more on this story on Inside Out North West on Monday 16 September 2019 on BBC One North West at 19:30 BST and on iPlayer afterwards.", "description": "Mary Hardiman has struck up a friendship with Chuck Mamou, a murderer waiting for an execution date.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/9286/production/_108801573_mary-chuck2-bbc.jpg", "published_at": "2019-09-14"}