{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/brexit-no-deal-boris-johnson-latest-news-lib-dems-a9119636.html", "downloaded_at": "2019-09-25 13:56:13.658609+00:00", "title": "Brexit: Opposition MPs may need 'extra law' to prevent no-deal exit", "language": "en", "text": "MPs may need to draw up further legislation to prevent Boris Johnson from forcing through a no-deal Brexit, Sir Ed Davey has said.\n\nThe Liberal Democrat deputy leader said there were some concerns the backbench bill to prevent a disorderly Brexit next month was \"not watertight\".\n\nRebel MPs derailed the prime minister's Brexit plans by passing the act, tabled by Labour's Hilary Benn, which compels him to seek a three-month extension if he cannot secure a deal by 19 October.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe move came ahead of Mr Johnson decision to prorogue parliament, which was sensationally overturned by the Supreme Court in a historic ruling.\n\nOpposition MPs are withholding consent for an early election until Mr Johnson has sought an extension from Brussels as distrust between parliamentarians and No 10 hit new lows.\n\nSir Ed told the Today programme: \"The key thing of course is implementing the extension of article 50 so that we can get no-deal totally off the table.\n\n“It might need an extra law, who knows? The key thing is the implementation of the extension of article 50.”\n\nAsked if the bill was watertight, Sir Ed said: “I’ve certainly seen the opinion of a number of very notable lawyers, that it’s not watertight – and if that’s the case we may need another bill to ensure that no-deal Brexit is completely taken off the table.\n\n\"But even with another bill, we have to force the prime minister to extend article 50 to get to this implementation, as well as the law.\"\n\nDespite calls for Mr Johnson to quit, opposition leaders are reluctant to table a motion of no confidence to oust him in case he refuses to comply with the provisions set out in the Benn act.\n\nShape Created with Sketch. Supreme Court verdict: Boris Johnson prorogation unlawful Show all 16 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Supreme Court verdict: Boris Johnson prorogation unlawful 1/16 The Supreme Court has ruled against Boris Johnson by declaring his government unlawfully shut down parliament for five weeks EPA 2/16 Lady Hale handed down the historic verdict, hailed by opposition MPs and anti-Brexit campaigners. She said all 11 judges were unanimous in deciding that the case is “justiciable”, so the government loses that part of the argument. “The court is bound to conclude therefore that the decision to advise Her Majesty to prorogue was unlawful because it had the effect of frustrating or preventing the ability of Parliament to carry out its constitutional functions.” EPA/Supreme Court 3/16 Gina Miller and her team react outside the Supreme Court are the verdict. She said: “Today is not a win for any individual or cause. It is a win for Parliamentary sovereignty, the separation of powers and independence of our British courts. Crucially, today’s ruling confirms that we are a nation governed by the rule of law, laws that everyone, even the Prime Minister, are subject to.\" PA 4/16 A person dressed as a caricature of British Prime Minister Boris Johnson in a prison uniform stands outside the Supreme Court AP 5/16 Labour leader Jeremy Corbyn called for Mr Johnson to “consider his position” following the landmark decision, while Lib Dem leader Jo Swinson said he was “not fit to be prime minister” Getty 6/16 Scottish National Party (SNP) Westminster leader Ian Blackford raises his arms as he comes outside. He said: \"This is an absolutely stunning judgement by the Supreme Court today.\" He went on to say, \"we all want to get back to work, and quite frankly, on the back of this, Boris Johnson must resign immediately.\" AFP/Getty 7/16 Crowds outside celebrated the verdict AP 8/16 Delegates at the Labour party conference applaud after hearing the news AFP/Getty 9/16 Speaker John Bercow said MPs must now “convene without delay” and confirmed the Commons would return at 11.30am on Wednesday AFP/Getty 10/16 Gina Miller said: \"“As a result of this judgment, Parliament is open, it was never prorogued. I urge MPs to get back to work immediately.” AP 11/16 MPs Anna Soubry, Liz Saville Roberts and Caroline Lucas, together with SNP leader Ian Blackford, react. Green MP Caroline Lucas has said the Supreme Court’s decision is “just the start” Reuters 12/16 “The UK deserves a Prime Minister and a Government who act with honesty, integrity and in a manner consistent with our constitution, at all times.\" AFP/Getty 13/16 AP 14/16 The SNP’s Joanna Cherry QC says: “Boris Johnson’s position is untenable and he should have the guts to resign.” PA 15/16 EPA 16/16 Tom Tugendhat MP returned to the chamber in the House of Commons within minutes of the Supreme Court ruling PA 1/16 The Supreme Court has ruled against Boris Johnson by declaring his government unlawfully shut down parliament for five weeks EPA 2/16 Lady Hale handed down the historic verdict, hailed by opposition MPs and anti-Brexit campaigners. She said all 11 judges were unanimous in deciding that the case is “justiciable”, so the government loses that part of the argument. “The court is bound to conclude therefore that the decision to advise Her Majesty to prorogue was unlawful because it had the effect of frustrating or preventing the ability of Parliament to carry out its constitutional functions.” EPA/Supreme Court 3/16 Gina Miller and her team react outside the Supreme Court are the verdict. She said: “Today is not a win for any individual or cause. It is a win for Parliamentary sovereignty, the separation of powers and independence of our British courts. Crucially, today’s ruling confirms that we are a nation governed by the rule of law, laws that everyone, even the Prime Minister, are subject to.\" PA 4/16 A person dressed as a caricature of British Prime Minister Boris Johnson in a prison uniform stands outside the Supreme Court AP 5/16 Labour leader Jeremy Corbyn called for Mr Johnson to “consider his position” following the landmark decision, while Lib Dem leader Jo Swinson said he was “not fit to be prime minister” Getty 6/16 Scottish National Party (SNP) Westminster leader Ian Blackford raises his arms as he comes outside. He said: \"This is an absolutely stunning judgement by the Supreme Court today.\" He went on to say, \"we all want to get back to work, and quite frankly, on the back of this, Boris Johnson must resign immediately.\" AFP/Getty 7/16 Crowds outside celebrated the verdict AP 8/16 Delegates at the Labour party conference applaud after hearing the news AFP/Getty 9/16 Speaker John Bercow said MPs must now “convene without delay” and confirmed the Commons would return at 11.30am on Wednesday AFP/Getty 10/16 Gina Miller said: \"“As a result of this judgment, Parliament is open, it was never prorogued. I urge MPs to get back to work immediately.” AP 11/16 MPs Anna Soubry, Liz Saville Roberts and Caroline Lucas, together with SNP leader Ian Blackford, react. Green MP Caroline Lucas has said the Supreme Court’s decision is “just the start” Reuters 12/16 “The UK deserves a Prime Minister and a Government who act with honesty, integrity and in a manner consistent with our constitution, at all times.\" AFP/Getty 13/16 AP 14/16 The SNP’s Joanna Cherry QC says: “Boris Johnson’s position is untenable and he should have the guts to resign.” PA 15/16 EPA 16/16 Tom Tugendhat MP returned to the chamber in the House of Commons within minutes of the Supreme Court ruling PA\n\nMPs are also split over who could lead a temporary government if Mr Johnson was deposed, as the Lib Dems have refused to put Jeremy Corbyn in No 10.\n\nMr Corbyn said: \"Until it is very clear that the application will be made, per the legislation, to the EU to extend our membership to at least January, then we will continue pushing for that and that is our priority.\n\n\"When that has been achieved we will then be ready with a motion of no confidence.\"", "description": "MPs may need to draw up further legislation to prevent Boris Johnson from forcing through a no-deal Brexit, Sir Ed Davey has said. The Liberal Democrat deputy leader said there were some concerns the backbench bill to prevent a disorderly Brexit next month was \"not watertight\".", "authors": ["Lizzy Buchan"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/05/28/01/ed-davey.jpg", "published_at": "2019-09-25"}