{"pub": "cnn", "url": "https://bleacherreport.com/articles/2860416-stephen-strasburg-outduels-justin-verlander-as-nationals-beat-astros-force-game", "downloaded_at": "2019-10-30 04:16:17.557701+00:00", "title": "Stephen Strasburg, Nationals Beat Justin Verlander, Astros to Force Game 7", "language": "en", "text": "Matt Slocum/Associated Press\n\nSo much for home-field advantage.\n\nThe Washington Nationals defeated the Houston Astros 7-2 in Game 6 of the 2019 World Series on Tuesday at Minute Maid Park and evened the series at three apiece. The road team has won every game of the series, and Stephen Strasburg made sure that continued with an absolute masterpiece.\n\nThat means there will be a winner-take-all Game 7 at the Fall Classic for the third time in four years.\n\nWashington is a single victory away from its first championship in franchise history, while Houston is one win away from its second in three seasons.\n\nNotable Player Stats\n\nWAS Stephen Strasburg: 8.1 innings, two earned runs, five hits, two walks and seven strikeouts\n\nWAS Juan Soto: 1-for-5, one home run, one RBI and one run\n\nWAS Adam Eaton: 1-for-2, one home run, one RBI, two runs and one walk\n\nWAS Anthony Rendon: 3-for-4, one home run, five RBI, one run and one walk\n\nHOU Justin Verlander : five innings, three earned runs, five hits, three walks and three strikeouts\n\nHOU Alex Bregman: 2-for-4, one home run, one RBI and one run\n\nStrasburg, Home Runs Help Nationals Overcome Umpires\n\nIf Houston won Tuesday's game, it would forever be remembered for the call in the top of the seventh inning.\n\nWith Washington nursing a 3-2 lead, Trea Turner dribbled one down the third base line. An errant throw to first got away, leading to runners on second and third with nobody out. However, Turner was called out for runner's interference, kicking off a mind-blowing sequence of events that included a lengthy review for a play that wasn't reviewable because it was a judgement call and Washington protesting the game.\n\nHe was eventually called out, and Nationals manager Dave Martinez was ejected in between innings for vehemently arguing the ruling.\n\nFortunately for the visitors and anyone with Major League Baseball looking to avoid one of the most controversial World Series finishes in history, Anthony Rendon launched a two-run homer two batters later to give the Nationals critical breathing room in a \"ball don't lie\" situation.\n\nHis blast came after Adam Eaton and Juan Soto both went deep in the fifth to give Washington the lead for good.\n\nThe home runs provided the offense, and Strasburg provided the cold-blooded pitching. He allowed two runs in the first inning—one from an Alex Bregman homer—but settled in and dominated the rest of the way. He struck out Carlos Correa with two runners on in the fourth, induced a groundout from Michael Brantley with two runners on in the fifth and powered his way through 8.1 frames in one of the best performances of his career.\n\nThe formula has been fairly straightforward for the Nationals this October. They are 6-0 when Strasburg appears in a game and 5-0 when Max Scherzer appears in a game, and the latter told reporters he will be fine for Game 7 even though he was scratched from a Game 5 start with injury.\n\nStrasburg and the home runs set the stage for Game 7. Now it's up to Scherzer to finish the series.\n\nVerlander's Inability to Match Strasburg Yet Again Puts Astros on the Brink\n\nThere is little questioning Justin Verlander's list of accomplishments that includes a World Series crown, MVP, Cy Young and eight All-Star nods, but he hasn't been his normal self in these playoffs.\n\nHe posted a 4.15 ERA in his first five starts—a far cry from his 2.58 mark during the regular season—and allowed four earned runs in Game 2 against the Nationals while losing to Strasburg.\n\nThe right-hander had the opportunity to atone for his recent struggles in the same matchup but found himself in constant trouble on the way to being chased after five innings. Rendon started the scoring with an RBI single in the first, Eaton tied the game with a solo blast in the fifth and Soto went deep two batters later to give the visitors the lead.\n\nIt could have been even worse, but Verlander worked out of situations with multiple runners on base in the third and fourth innings.\n\nWhile Verlander didn't get much help from his offense or the bullpen, he is a future Hall of Famer who had the World Series title right in front of him. If he pitched up to his potential in either of his two starts, the Astros would be celebrating another championship.\n\nInstead, Strasburg pitched like the future Hall of Famer yet again and will now give the ball to his fellow ace with a chance to close out a championship run.\n\nWhat's Next?\n\nThe decisive Game 7 is Wednesday in Houston.", "description": "So much for home-field advantage.    The Washington Nationals defeated the Houston Astros 7-2 in Game 6 of the 2019 World Series on Tuesday at Minute Maid Park and evened the series at three apiece...", "authors": ["Scott Polacek"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/835/672/hi-res-51b71d1473ff6fe270e97d2db6a52232_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-10-30"}