{"pub": "cbc", "url": "https://cbc.ca/radio/thenextchapter/candy-palmater-recommends-3-nonfiction-books-you-should-read-right-now-1.5299456", "downloaded_at": "2019-09-28 01:10:49.716026+00:00", "title": "CBC Radio", "language": "en", "text": "Comedian, reader and The Next Chapter columnist Candy Palmater shares three can't-miss books lovers of nonfiction should check out.\n\nThe Making of the October Crisis by D'arcy Jenish\n\nD'arcy Jenish is a magazine journalist and author. (Doubleday Canada, Patrick Jenish)\n\n\"What I found fascinating about this book was it didn't zero in on the events of that October itself. It started 10 years earlier. The author carefully laid out where the unrest came from. I could relate with some of that unrest as an Indigenous person. I could understand some of the fear that francophones were having around their culture and their language.\n\n\"He carefully laid out how the political idealism and the radical break off that led to this October Crisis, the kidnapping of two government officials and the eventual death of a Canadian minister.\"\n\nThe Collective Wisdom of High-Performing Women edited by Colleen Moorehead\n\nColleen Moorehead is the editor of The Collective Wisdom of High-Performing Women. (Barlow Books)\n\n\"It's about the Judy Project, which was based on a Canadian businesswoman named Judy Elder. She gave a barnburner of a speech one morning at a gathering of business women from across Canada. Unknown to anybody, she had a rare illness and died two weeks later.\n\n\"Her friends came together and created this thing called the Judy Project, where young women who are entering business would get training based on this speech Judy gave. The reason that it drew me in is that, often in business, there's training for executive-level women to get women at that table. But some of that work has to start at the beginning.\"\n\nIs There Still Sex in the City? by Candace Bushnell\n\nCandace Bushnell's new book is titled Is There Still Sex in the City? (Patrick McMullen, Anansi International )\n\n\"I, like everyone else, watched Sex and the City when it was on TV and I enjoyed it. I have never read a Candace Bushnell book. But when this came across my desk, I picked it up. I thought I'd just read the first chapter and then get back to it when I have time. But the first chapter was so hilarious and also mortifying.\n\n\"This book is not for everybody. If you are getting close to that 50-year-old mark, it's interesting to hear her exploits as a 50-something newly single person out there trying to make it in the dating world.\"\n\nCandy Palmater's comments have been edited for length and clarity", "description": "The Next Chapter columnist discusses The Making of the October Crisis by D'arcy Jenish, The Collective Wisdom of High-Performing Women and Is There Still Sex in the City? by Candace Bushnell.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5299460.1569585019!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/candy-palmater.jpg", "published_at": "2019-09-27"}