{"pub": "axios", "url": "https://cnn.com/2019/10/27/politics/bill-taylor-vietnam-bob-seitz-robert-st-onge/index.html?utm_medium=social&utm_source=fbCNN&utm_content=2019-10-27T15:14:28", "downloaded_at": "2019-10-28 00:27:00.597768+00:00", "title": "Bill Taylor, now dodging Trump attacks, defended as a 'man of honor' by three veterans who served with him", "language": "en", "text": "Washington (CNN) Three veterans who served with Ambassador Bill Taylor , a key witness in the House impeachment inquiry who has come under attack by the President, defended him as a \"man of honor,\" \"public servant\" and \"role model\" in interviews with CNN.\n\nRetired Col. Bob Seitz, retired Maj. Gen. Robert St. Onge and retired Lt. Gen. Karl Eikenberry spoke to the character of a central figure in the impeachment probe who testified before Congress last week. They describe their longtime friend -- the top US diplomat in Ukraine -- as someone with integrity who has served his country faithfully.\n\nEikenberry, a former ambassador to Afghanistan, said he has known Taylor since 2002 when they served in Afghanistan together, adding that the pair \"worked closely together under difficult circumstances.\n\nTaylor was at the US Embassy coordinating US and international aid efforts and Eikenberry was serving as a major general helping the Afghan government establish army and police forces, he said.\n\n\"Ambassador Taylor represents the best of our Department of State. His integrity and courage are the true marks of patriotism, loyal to an oath of office and never to be corrupted or intimidated by those seeking personal gain at our Nation's expense,\" Eikenberry said.\n\nHe described Taylor as a \"most capable but unassuming government servant,\" adding that \"Bill always volunteered for the tough posting.\"\n\nSeitz jumped from helicopters and rucked through jungle-covered mountainous terrain in Vietnam with Taylor for 18 months. In Vietnam, Seitz said, he and Taylor saw and endured, \"Fatigue, hunger, bad weather, dying, killing, and a lot of terrible wounds.\"\n\n\"He was calm and composed under all of this,\" Seitz said. \"And the men needed a leader that was like that. He set the very best example.\"\n\nSeitz, who was classmates with Taylor at West Point, said Taylor's personal character is one of \"integrity, of compassion, and always setting best example, endurance and courage.\"\n\nTaylor's deposition this past week was, Republican sources tell CNN, impactful and \"reverberating\" on Capitol Hill among Republicans. Taylor's testimony was a game-changer in the impeachment inquiry, these sources said.\n\nTaylor detailed conversations with Trump administration officials pushing an explicit quid pro quo — he was told \"everything\" Ukraine wanted from the United States including military aid depended upon the Ukrainian President publicly announcing an investigation into former Vice President Joe Biden and his son, Hunter.\n\nThe White House took aim at Taylor leading up to his testimony. Acting White House chief of staff Mick Mulvaney told reporters: \"What you're seeing now, I believe, is a group of mostly career bureaucrats who are saying: 'You know what? I don't like President Trump's politics so I'm going to participate in this witch hunt that they're undertaking on the Hill'.\"\n\nThe President called Taylor a \"Never Trumper\" and then immediately called all \"Never Trumpers\" \"human scum.\"\n\nSeitz said he was in tears listening to what he called \"untruths\" and \"personal attacks\" on Taylor. Taylor extended his tour in Vietnam an extra six months, he said, and Seitz said none of those attacking Taylor \"stood up for this country for 18 months the way Bill did in Vietnam.\"\n\nTaylor's lifetime of service as a diplomat includes stints in Afghanistan and Iraq, where he faced enemy fire in Baghdad and Fallujah.\n\n\"How could anyone in the White House make such terrible remarks about a veteran that has done so much for our country?\" Seitz said.\n\nSeitz bought a hard copy of Wednesday's New York Times that shows a picture of Taylor on the front page walking into Congress to testify, and said it's been on his breakfast table for days.\n\n\"He's standing alone the way the Currahees have stood alone for our country,\" Seitz said. \"But all of us other Currahees are standing with him,\" he said.\n\nSeitz and Taylor were rifle company commanders of the 506th Regiment of the 101st Airborne — the same regiment from the World War II book and mini-series \"Band of Brothers\" — with their motto \"Currahee,\" meaning \"We stand alone.\"\n\n\"He's a man of honor,\" Seitz said, \"a courageous man who has the endurance to go through all of this.\" Seitz said Taylor is the embodiment of the US Military Academy Cadet Prayer, which says: \"Make us to choose the harder right instead of the easier wrong, and never to be content with a half truth when the whole can be won.\"\n\nSt. Onge was also a West Point classmate of Taylor's, and was in the same battalion as him in Vietnam. They were high school classmates, and Taylor was St. Onge's best man at his wedding.\n\n\"I don't know anything about his politics, I just know that he has served his country faithfully as long as I have known him,\" St. Onge told CNN in a recent interview.\n\nSt. Onge said he would characterize Taylor's service as the motto of the military academy: \"Duty, Honor, Country. I think that's what motivates him.\"\n\n\"The Bill that I know is extraordinarily intelligent, he is articulate, he cares about his soldiers,\" St. Onge said. \"He's been a public servant all the way through. I have the utmost respect for him, and count him among my dearest friends.\"", "description": "Three veterans who served with Ambassador Bill Taylor, a key witness in the House impeachment inquiry who has come under attack by the President, defended him as a \"man of honor\" and a \"public servant\" in interviews with CNN.", "authors": ["Jake Tapper", "Kate Sullivan"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191022194804-05-bill-taylor-1022-leaving-super-tease.jpg", "published_at": "2019-10-27"}