{"pub": "wsj", "url": "https://wsj.com/articles/trump-guidance-on-gun-legislation-may-not-help-build-support-among-republicans-11568036382?mod=rsswn", "downloaded_at": "2019-09-09 23:17:52.087277+00:00", "title": "Trump Guidance on Gun Legislation May Not Help Build Support Among Republicans", "language": "en", "text": "This item first appeared in the Capital Journal newsletter. Read today’s full newsletter here or sign up here for daily updates in your inbox.\n\nThe White House’s previous difficulties mustering Republicans’ support for its legislative goals does not bode well for the odds of passing gun-control legislation this month.\n\nCalls, especially from Democrats, to tighten gun regulations have grown following three mass shootings over the summer, and the White House has said it is exploring possible responses, including expanding background checks, without so far committing to anything. Senate Republican leaders have repeatedly said they are waiting for President Trump to clearly articulate and lobby for specific gun policy changes before committing to bringing a bill to the chamber’s floor.\n\nSen. Roy Blunt (R., Mo.), a member of leadership, said on NBC’s “Meet the Press” on Sunday that any legislation needs the president’s support.\n\n“The president needs to step up here and set some guidelines for what he would do,” Mr. Blunt said.\n\nThe administration has at times sent mixed signals over other policy positions to lawmakers on Capitol Hill, or quickly reversed its position. A Republican effort to pass an immigration bill last year that met the administration’s standards while also winning support from moderates collapsed without vigorous support from the president. A tweet he sent the morning of the vote endorsing the bill did little to salvage it.\n\nMore recently, Mr. Trump’s support for a two-year budget agreement that also raised the U.S. government’s borrowing limit did not translate into widespread GOP support. Unlike some other legislative battles, Mr. Trump and the administration took a more conventional lobbying approach for the bill, calling undecided lawmakers and repeatedly advocating for it in public. Many Republicans defected, however, with 23 Republicans opposing it the Senate and 132 Republicans voting against it in the House.\n\nEven if the White House does commit to specific gun-control provisions, then, Republicans may or may not go along with it.\n\nRelated Video Following three recent major mass shootings, Congress will return amid an outcry for tighter gun controls. WSJ's Gerald F. Seib explains whether a shift in public attitude towards gun laws will translate into action in Congress. Photo: Megan Jelinger/SOPA Images via ZUMA Wire\n\nWrite to Andrew Duehren at andrew.duehren@wsj.com", "description": "The White House’s previous difficulties mustering Republicans’ support for its legislative goals does not bode well for the odds of passing gun-control legislation this month.", "authors": ["Andrew Duehren", "Andrew.Duehren Wsj.Com"], "top_image": "https://images.wsj.net/im-105238/social", "published_at": "2019-09-09"}