{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/bluedrop-performance-learning-inc-announces-organizational-changes-and-proposed-branding-changes", "downloaded_at": "2019-10-05 05:45:33.981079+00:00", "title": "Bluedrop Performance Learning Inc. Announces Organizational Changes and Proposed Branding Changes", "language": "en", "text": "ST. JOHN’S, Newfoundland and Labrador — Bluedrop Performance Learning Inc. (“Bluedrop” or the “Corporation”) (TSX-V: BPLI) announced today that, subject to receipt of required shareholder and regulatory approvals, including the acceptance of the TSX Venture Exchange (TSX-V”), the Corporation proposes to change its name to “BPLI Holdings Inc.” (“BPLI Holdings”). This change is anticipated to take effect following the annual general meeting of the Corporation to be held in March 2020. The Corporation will continue to be the publicly-listed parent company for its two operating subsidiaries, namely, Bluedrop Training and Simulation Inc. (“BTS”) and Bluedrop Learning Networks Inc. (“BLN”). The Corporation will continue to trade under the ticker symbol TSX-V: BPLI.\n\nBPLI Holdings will continue to provide oversight and shared services including financial services, centralized treasury and human resources to the two operating subsidiaries. Emad Rizkalla will continue as Founder and Chief Executive Officer and Derrick Rowe will continue as the Executive Chair of the Board of Directors. Brad Driscoll has been appointed as Chief Financial Officer to replace Bernie Beckett who has announced his planned retirement but who will assume the Treasurer and Corporate Secretary roles on a part-time basis. BPLI Holdings is headquartered in St. John’s, Newfoundland and Labrador.\n\nBLN will be renamed over the coming months. BLN has developed its own software as a service (“SaaS”) training management platform that delivers and validates skills and credentials across a multi-stakeholder ecosystem. The platform is deployed in a variety of regulatory, compliance and workforce employment environments. In addition to its SaaS offering, BLN also provides eLearning specialized content. BLN’s customers and products have grown over the past number of years and the directors of the Corporation have determined that it is now time to rebrand BLN to distinguish this distinct business from the Bluedrop Training and Simulation business carried on by BTS. BLN is headquartered in St. John’s, Newfoundland and Labrador with a staff of 45 people.\n\nEmad Rizkalla will continue as Founder and Chief Executive Officer of BLN and will continue to lead that business unit forward as it grows its base of business and products. Danny Penton has joined the team as Chief Operating Officer providing day to day leadership and guidance for all aspects of the Company’s operations.\n\nBTS will retain its current name “Bluedrop Training & Simulation Inc.” BTS has grown to be a leading provider of training services, in-service support and simulation products for defence and security related industries over the past number of years. It is headquartered in Halifax, Nova Scotia with two facilities there including its main office and its newly opened production facility. It has a staff of 131 with personnel working at various military locations in Nova Scotia, New Brunswick, and Ontario.\n\nDerrick Rowe has been appointed Chief Executive Officer of BTS and will lead that business unit forward as it grows its base of business. John Moores has been appointed Executive Vice President, Delivery and Operations responsible for all delivery and operations for BTS. Jean-Claude Siew has been appointed Executive Vice President, Technology and Simulation and responsibility for all business development activities.\n\nCommenting on the new leadership team and the proposed new branding of the Corporation, Founder and CEO Emad Rizkalla said, “We have seen the two operating business units grow and mature into separate exciting businesses that now need to define themselves and their future growth opportunities as individual entities. Having a dedicated full time Chief Executive Officer for each of the subsidiaries is the natural evolution. We have always thought that at some point we would make a more formal division of the operating companies that we created and now is the time. It will provide more focus on the operations and at the same time more flexibility for any potential future transactions we may wish to explore with either of the businesses.”\n\nCommenting on the changes, Executive Chair Derrick Rowe added, “This new organizational structure started with the acquisition of Atlantis Systems and the creation of the Training and Simulation business unit back in 2013. We have now reached a point where both businesses are growing well but in different markets. Over the last number of years, we have built a strong management team in both businesses and strong customer bases with no overlap in technology, people, or customers. They each have their own intellectual property and development teams and are in different cities. They will now share only corporate oversight, central treasury, financial support, and human resources services as this is still more cost effective at this time. It is hard for investors to understand the business as one when it is really two operating businesses under a holding company. We hope investors will be better able to understand the individual businesses and the different value proposition they offer.”\n\nAbout Bluedrop\n\nBluedrop Performance Learning Inc. (TSX-V: BPLI) is an innovator in both the development of workplace e-learning and simulation as well as the way large organizations deliver, track and manage training. Its two divisions serve the world’s leading aerospace and defence organizations as well as broad cross sections of organizations focused on managing system wide health and safety and developing the skills of external workforces. Bluedrop is creating the workforce of the future by improving the effectiveness, speed and costs of training delivery and management. For more information, visit www.bluedrop.com.\n\nThis news release may contain “forward-looking information” as defined in applicable Canadian securities legislation. All statements, other than statements of historical fact included in this release, constitute forward-looking information that involve various risks and uncertainties. Forward-looking information is based on a number of factors and assumptions which have been used to develop such information but which may prove to be incorrect, including, but not limited to, assumptions in connection with the operational efficiencies associated with the integration of technological and financial systems and general economic and market conditions. There can be no assurance that such information will prove to be accurate and actual results and future events could differ materially from those anticipated in such forward-looking information.\n\nImportant factors that could cause actual results to differ materially from Bluedrop’s expectations include general global economic conditions. For additional information with respect to risk factors applicable to Bluedrop, reference should be made to Bluedrop’s continuous disclosure materials filed from time to time with securities regulators, including, but not limited to, Bluedrop’s Annual Information Form and Management’s Discussion and Analysis of Results of Operations and Financial Condition for the year ended September 30, 2018. The forward-looking information contained in this release is made as of the date of this release and Bluedrop does not undertake to update publicly or revise the forward-looking information contained in this release, whether as a result of new information, future events or otherwise, except as required by applicable securities laws.\n\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191004005452/en/\n\nContacts\n\nBernie Beckett\n\nTreasurer and Corporate Secretary\n\nBluedrop Performance Learning Inc.\n\nberniebeckett@bluedrop.com\n\nPhone: 709-739-4938", "description": "ST. JOHN’S, Newfoundland and Labrador — Bluedrop Performance Learning Inc. (“Bluedrop” or the “Corporation”) (TSX-V: BPLI) announced today that, subject to receipt of required shareholder and regulatory approvals, including the acceptance of the TSX Venture Excha...", "authors": [], "top_image": "https://cts.businesswire.com/ct/CT", "published_at": "2019-10-04"}