{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/30/nolte-2020-democrats-go-all-in-on-the-socialist-vote-less-than-1-5-of-americans", "downloaded_at": "2019-10-30 23:27:15.526048+00:00", "title": "2020 Dems Go All-In on the Socialist Vote—Less than 1/5 of Americans", "language": "en", "text": "The 2020 Democrat presidential candidates are so enthralled by the corporate media and far-left influencers, they are openly embracing socialism, even though only 19 percent of Americans identify as socialists.\n\nMedicare for All is straight-up socialism. It’s stripping 150 million Americans of the health insurance they are satisfied with to force us into a one-size-fits-all, government-run system. Remember how well that worked out for the Veterans Administration? How many people died?\n\nThen there’s “free” college on top of forgiving a trillion dollars in student loan debt that is owed to us, the hard-working taxpayers of America.\n\nDon’t forget a guaranteed income, whether you work hard or stay home all day smoking a bowl in front of the Cartoon Network.\n\nDo you want to know just how good life is in this country?\n\nWe are worried about an epidemic of obesity among the “poor,” and just this week we learned that the children of the “poor” spend more time in front of an electric screen than the non-poor. In other words, poor people have too much food and munch on all that food while enjoying their iPads and iPhones and hand-held video games.\n\nIn other words, they are not really poor.\n\nOther than the mentally ill and those dealing with addiction, people that cannot be helped without violating their civil right to live on the street, America has done it — we have licked poverty.\n\nOh, sure, we can use slide-rules and charts and graphs, we can pull a number out of our backside to designate a certain group of people as “poor,” but while we are doing that the poor are enjoying a standard of living the rich only dreamt of a hundred years ago — central heat, television, air conditioning, an abundance of food, games, Internet access, a cell phone… are you kidding me?\n\nAnd now, because 19 percent of the population — most of them almost assuredly young and dumb, immature and unwise, inexperienced and ignorant — think they want socialism, the 2020 field is prepared to “fix” a market economy that is working miraculously well, because fairness or something…\n\nAnd here’s the thing, most of those 19 percent… They are going to grow out of it. As they gain experience, maturity, and wisdom, they will wake up to certain realities of life and reject socialism, because only a lunatic can look at the history of socialism and want to live that way.\n\nBefore he assassinated President Kennedy, even dedicated Marxist Lee Harvey Oswald got his wish to live in the Soviet Union… and then spent most of his time there trying to return, not just to the United States, but to Texas!\n\nRemember the Woodstock Generation? A majority of them are Republicans now.\n\nThat’s just how it works, how it has always worked…\n\nBut what has changed, what has moved Democrats into a socialist posture that would shock even Barack Obama, is that the establishment media is now infested with radical leftists who all speak as one. On top of that, America’s young and dumb enjoy a presence on social media that over-exaggerates their influence and twists reality (if you’re dumb enough to believe social media is reality) into something it is not.\n\nThe horror show, then, would be a Bernie Sanders or Elizabeth Warren sliding into power, and that would be a horror show even for those 19 percent, because in a few years they are growing to become a little wiser as they struggle and die in the awful world they wished for.\n\nFollow John Nolte on Twitter @NolteNC. Follow his Facebook Page here.", "description": "2020 Democrat candidates are openly embracing socialism, with only 19 percent of Americans identifying as socialists.", "authors": ["John Nolte"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-1181315050-640x335.jpg", "published_at": "2019-10-30"}