{"pub": "guardian", "url": "https://theguardian.com/business/2019/oct/07/super-rich-london-rentals-brexit-pound-knight-frank", "downloaded_at": "2019-10-07 23:32:09.465936+00:00", "title": "Super-rich renting London homes for £5,000-plus a week amid Brexit worries", "language": "en", "text": "Mounting uncertainty around Brexit and the global economy has prompted growing numbers of super-rich people to rent rather than buy in London, with demand for lettings at £5,000-plus a week hitting a seven-year high.\n\nKnight Frank, the upmarket estate agent, recorded 40 lettings for super-prime properties between April and June, up from 33 a year earlier and the highest second-quarter figure for more than seven years. There were 153 super-prime tenancies agreed in the year to June, up from 130 and the highest annual total. Super-prime tenancies are defined as those at £5,000 or more a week.\n\n“People are watching and waiting for the political situation to play out and some have decided to rent,” said Tom Smith, head of super-prime lettings at Knight Frank.\n\n“People tell me they want to remain flexible, not just because of Brexit but because of their concerns around global trade tensions and the state of the world economy.”\n\nBleak surveys for the manufacturing and services sectors in the US, UK and rest of Europe last week heightened concerns over the global economic slowdown. In Britain, the dominant services industries unexpectedly fell into contraction last month, raising fears that the country could enter its first recession since the financial crisis as Brexit looms.\n\nThe weaker pound is also attracting more wealthy tenants to London. Areas such as Notting Hill and St John’s Wood are popular, particularly with Americans. “Demand in both areas is driven by the quality of the schools and they have been particularly popular among US tenants,” Smith said. “The weakening pound means overseas tenants have been able to increase their budgets.”\n\nThe near-17% drop in the pound against the dollar since the Brexit vote in 2016 has benefited tenants with dollar-denominated wealth – a budget of £5,000 a week has been boosted to more than £6,000 by currency movements since the referendum, Knight Frank noted.\n\nMayfair, another affluent neighbourhood, has also attracted more super-rich tenants, after more luxury apartment blocks such as 20 Grosvenor Square and Clarges Mayfair were built, the report said.\n\nAn apartment in the recently completed Clarges Mayfair building has just come on the market and is renting for £30,000 a month, with floor-to-ceiling windows and a marble bathroom in the master bedroom suite. The nine-storey Portland stone block overlooking Green Park houses 33 other apartments, a swimming pool, spa and cinema.\n\nMeanwhile, a semi-detached four-bedroom house at 14 Upper Phillimore Gardens in Kensington costs £25,000 a week to rent, while a four-bed detached house at 80 Elm Park Road in Chelsea is let at £10,000 a week.\n\nSign up to the daily Business Today email or follow Guardian Business on Twitter at @BusinessDesk\n\nOverall, there is a shortage of luxury new-build properties, which has driven rents higher. The number of new super-prime lettings listings declined to 209 in the second quarter of this year compared with 284 a year ago, according to Knight Frank.\n\n“The shortage of supply, particularly for the most in-demand new-build developments, means there can be a premium for the rental values paid,” Smith said.\n\nBrexit-related uncertainty has put the super-rich off buying at the top end of the market, according to a separate Knight Frank report. In the year to January, 109 properties above £10m changed hands, down 19% from 134 in the previous 12 months.", "description": "Weak pound means overseas tenants able to increase budgets, says Knight Frank", "authors": ["Julia Kollewe"], "top_image": "https://i.guim.co.uk/img/media/773264b937cdf61f622af61d85bbf5caf3f09d56/0_206_4914_2949/master/4914.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b51735ba50d8e2265f0b70eefde5d297", "published_at": "2019-10-07"}