{"pub": "nyt", "url": "https://nytimes.com/2019/09/29/opinion/trump-impeachment.html", "downloaded_at": "2019-09-29 23:31:02.258274+00:00", "title": "Opinion | Impeach the Malignant Fraudster", "language": "en", "text": "I will not hold my breath for mass defections from Trump. He has a stranglehold on the Republican Party. And, Republicans in Washington have not only been absolute cowards about standing up to Trump and holding him accountable, some have been completely unseemly in their obsequious kowtowing. I’m looking at you, Lindsey Graham.\n\nBut, I refuse to believe that the totality of the Republican Party system is corrupt beyond the possibility of contrition, that every single Republican senator would turn their backs on the country. Call me naïve. Or, call me hopeful for the future of the country.\n\nThere must be some patriots, at least a handful, in the Republican Party. There must be some who have the courage — the guts! — to stand up for righteousness, to not look like hacks and hypocrites in the annals of history.\n\nThere must be, right?\n\nOr, will they all go down with Trump as flaming sycophants? I’m sure many will. Most may. But, some surely won’t.\n\nThe truth is that many will likely allow the polls to dictate their decision on impeachment. Their ethics are transactional. They’ll go whichever way the wind is blowing at the time, they’ll follow the easiest path for themselves to maintain power and position.\n\nOthers, though, will need to develop a language of penance and conciliation, a way of explaining to the world how they followed in lock step behind Trump and his corruption until that was no longer tenable. It was craven. It was immoral. It was unpatriotic.\n\nBut, if these people emerge, they will likely be a lonely few. History teaches us that most Republicans are likely to rally around Trump rather than fall away from him. As Nicole Hemmer wrote on Vox in 2017:\n\n“Until the very end, Watergate gave Nixon a stature on the right that he had previously lacked. And even after Nixon’s resignation, the right never quite accepted the liberal narrative” of Watergate “as a heroic moment for investigative journalism and a cleansing moment for American politics.”", "description": "This is how Republicans can redeem themselves.", "authors": ["Charles M. Blow"], "top_image": "https://static01.nyt.com/images/2019/09/29/opinion/29Blow/29Blow-facebookJumbo.jpg", "published_at": "2019-09-29"}