{"pub": "businessinsider", "url": "https://businessinsider.co.za/iran-taking-big-step-allows-faster-development-of-nuclear-weapons-2019-9", "downloaded_at": "2019-09-05 07:07:50.380865+00:00", "title": "Iran says it's breaking from the 2015 deal in a move that allows it to develop nuclear weapons much faster", "language": "en", "text": "Iranian President Hassan Rouhani on Wednesday announced Iran will begin developing more advanced centrifuges in what represents its third step away from the 2015 nuclear deal.\n\nMore advanced centrifuges would allow Iran to more rapidly enrich uranium, which could allow it to develop a potential nuclear weapon even faster.\n\nThis comes amid heightened tensions with the US that have raised alarm worldwide, and is designed to place pressure on European countries scrambling to save the 2015 deal.\n\nIran wants relief from crippling economic sanctions imposed by the US, and is using the deal as leverage.\n\nFor more stories go to the Business Insider South Africa homepage.\n\nIranian President Hassan Rouhani on Wednesday announced Iran will take another step away from the 2015 nuclear deal in a move that increases its ability to rapidly develop nuclear weapons.\n\n\n\nRouhani in a televised speech said that beginning on Friday his country will begin developing more advanced centrifuges that would speed up the enrichment of uranium, Reuters reported.\n\n\"From Friday, we will witness research and development on different kinds of centrifuges and new centrifuges and also whatever is needed for enriching uranium in an accelerated way,\" Rouhani said.\n\nUnder the 2015 nuclear deal, Iran agreed to reduce its number of centrifuges and to use older, less efficient models. Iran had 20,000 centrifuges before the deal but under the agreement could only operate a maximum of 5,060.\n\nRouhani on Wednesday said, \"All limitations on our Research and Development will be lifted on Friday.\"\n\nIran has consistently maintained that it does not desire to build a nuclear weapon, but wants nuclear power for civilian purposes. The Trump administration is skeptical of these claims, which was central to President Donald Trump's decision to withdraw from the 2015 nuclear deal - formally known as the Joint Comprehensive Plan of Action (JCPOA).\n\nRouhani's announcement on Wednesday announces the Iran's third break from the 2015 nuclear pact. Amid heightened tensions with the US that have sparked fears of yet another military conflict in the Middle East, Iran in July announced it would stop complying with key portions of the deal on uranium enrichment and stockpiling.\n\nIran's violations of the nuclear deal come as a response to the Trump administration's maximum pressure campaign - harsh economic sanctions that have crippled Iran's economy - and the US government's refusal to honour the 2015 nuclear pact. The international deal, orchestrated by the Obama administration, was designed to prevent Iran from obtaining a nuclear weapon in response for relief from economic sanctions.\n\nIran remained in compliance with the deal for over a year following Trump's withdrawal in May 2018, reports from the UN's nuclear watchdog showed, even amid renewed sanctions from the US.\n\nTrump on Wednesday signaled he'd be open to meeting with Rouhani at the upcoming UN General Assembly in New York City, but Rouhani has ruled out a bilateral meeting with the US. The Iranian president on Tuesday said Iran would be open to a multilateral meeting but only if the US agrees to lift sanctions.\n\nIran's recent violations of the nuclear deal are largely designed to put pressure on European countries scrambling to save the agreement. Tehran wants Europe to offer economic relief from the US sanctions.", "description": "Iranian President Hassan Rouhani on Wednesday announced Iran will begin developing more advanced centrifuges.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9068/a23b1c2a5f4e42df94fed77e24fba3fb.jpg", "published_at": "2019-09-05"}