{"pub": "breitbart", "url": "https://breitbart.com/news/ezekiel-elliott-powers-past-eagles-on-snf-dallas-takes-control-of-nfc-east", "downloaded_at": "2019-10-21 13:19:09.548962+00:00", "title": "Ezekiel Elliott powers past Eagles on SNF; Dallas takes control of NFC East", "language": "en", "text": "Oct. 21 (UPI) — Dallas Cowboys star Ezekiel Elliott plowed over defenders Sunday night en route to 111 rushing yards in a 37-10 win against the Philadelphia Eagles, pushing his team to first place in the NFC East.\n\nElliott totaled 147 yards and had a touchdown in the victory at AT&T Stadium in Arlington, Texas. The Cowboys forced four turnovers in the win, with Eagles quarterback Carson Wentz fumbling twice and throwing an interception.\n\n“This team needed this, especially in the fashion we did it,” Elliott told reporters. “Get some momentum for the season and before this bye week so we can close the season out right.”\n\nThe Cowboys (4-3) scored on their first drive of the game, with Tavon Austin running for a 20-yard touchdown. Dallas added another score on their second drive. DeMarcus Lawrence sacked Wentz, leading to the scoring possession. Antwaun Woods recovered a fumble on the play. The Cowboys took over at the Philadelphia 14-yard line and Elliott scored on a 1-yard run to give Dallas a 14-0 edge. Elliott ran over Malcolm Jenkins prior to the score, lowering his shoulder and driving the Eagles safety into the ground.\n\n“We were playing for first place in the division and wanted to make sure we came out and capitalized,” Lawrence said.\n\nZEKE IS RUNNING STRONG @DallasCowboys take an early two-TD lead. #DallasCowboys @EzekielElliott\n\n: #PHIvsDAL on NBC\n\n: NFL app // Yahoo Sports app\n\nWatch free on mobile: https://t.co/YZGAVQuAGU pic.twitter.com/6QIo8o7PWm— NFL (@NFL) October 21, 2019\n\nWentz hit tight end Dallas Goedert with a 28-yard touchdown pass on the next drive, cutting the deficit in half. Cowboys quarterback Dak Prescott found Blake Jarwin with a 1-yard touchdown pass midway through the second quarter to give Dallas a 21-7 lead. Brett Maher made a 26-yard field goal on the Cowboys’ next drive. He hit a 63-yard try on the Cowboys’ final drive of the first half, giving Dallas a 27-7 lead at the break. The deep kick was the second-longest made field goal in NFL history.\n\nJake Elliott made a 38-yard field goal on the Eagles’ first drive of the second half, and Maher hit his third field goal of the game at the start of the fourth quarter. Prescott scrambled for an 8-yard touchdown in the fourth quarter for the final score of the game.\n\nWentz completed 16 of 26 passes for 191 yards, one score and an interception in the loss. Prescott completed 21 of 27 passes for 239 yards, one score and an interception. Cowboys wide receiver Amari Cooper had five catches for 106 yards.\n\n“After a game like this, we all kind of have to step back and look in the mirror,” Eagles head coach Doug Pederson said. “It starts with me. This is one of those games I take personal from that standpoint. We didn’t play well. I have to get that fixed.”\n\nThe Eagles (3-4) battle the Buffalo Bills at 1 p.m. EDT Sunday at New Era Field in Buffalo. The Cowboys have a Week 8 bye before face the New York Giants in another NFC East affair at 8:15 p.m. EDT Nov. 4 at MetLife Stadium in East Rutherford, N.J.", "description": "Oct. 21 (UPI) — Dallas Cowboys star Ezekiel Elliott plowed over defenders Sunday night en route to 111 rushing yards in a 37-10 win against the", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-21"}