{"pub": "yahoo", "url": "https://news.yahoo.com/turkey-says-syria-operation-preparations-065347292.html", "downloaded_at": "2019-10-08 09:39:51.711617+00:00", "title": "Turkey says Syria operation preparations complete, Trump issues threat", "language": "en", "text": "By Daren Butler\n\nISTANBUL, Oct 8 (Reuters) - Turkey said on Tuesday it had completed preparations for a military operation in northeast Syria after the United States began pulling back troops, opening the way for a Turkish attack on Kurdish-led forces long allied to Washington.\n\nBut U.S. President Donald Trump warned he would \"obliterate\" the NATO ally's economy if it took action in Syria that he considered \"off limits\" following his decision on Sunday to pull 50 American special forces troops from the border region.\n\nThe U.S. withdrawal will leave its Kurdish-led partner forces in Syria vulnerable to an incursion by the Turkish Armed Forces (TSK), which brands them terrorists because of their links to Kurdish militants who have waged a long insurgency inside Turkey.\n\n\"The TSK will never tolerate the establishment of a terror corridor on our borders. All preparations for the operation have been completed,\" the Turkish Defence Ministry said on Twitter early on Tuesday.\n\n\"It is essential to establish a safe zone/peace corridor to contribute to our region's peace and stability, and for Syrians to achieve a safe life,\" it said.\n\nTrump's warning on Turkey's economy appeared aimed at placating critics who accused him of abandoning the Syrian Kurds by pulling out U.S. forces. The decision drew criticism from Democrats and a rebuke from some of Trump's fellow Republicans in Congress, including Senate Majority Leader Mitch McConnell.\n\n\"As I have stated strongly before, and just to reiterate, if Turkey does anything that I, in my great and unmatched wisdom, consider to be off limits, I will totally destroy and obliterate the Economy of Turkey (I've done before!)\" Trump tweeted.\n\nTurkey does not appear \"as of now\" to have begun its expected incursion into northern Syria, a senior Trump administration official said on Monday.\n\nTurkish Foreign Ministry spokesman Hami Aksoy said overnight it was Turkey's fundamental right to take necessary measures for its national security against terrorism threats from Syria.\n\n\"Turkey is determined to clear terrorists from the east of the Euphrates and protect its own security and survival while implementing a secure zone in order to achieve peace and stability,\" Aksoy said in a written statement.\n\nPresident Tayyip Erdogan has said Turkey plans to resettle two million refugees in northern Syria and Turkish media has said the draft resettlement plan involves a 151 billion lira ($26 billion) construction project. Turkey hosts 3.6 million Syrian refugees.\n\nThe Trump administration official, briefing reporters on a conference call, said 50 U.S. troops in the region that Turkey has targeted would be redeployed elsewhere in Syria \"where they aren't in the crossfire.\" The United States has about 1,000 troops in Syria.\n\nTurkey's lira lost 2% of its value against the dollar to hit its weakest level since early September. It stood at 5.8385 early on Tuesday. ($1 = 5.8067 liras)\n\n(Reporting by Daren Butler; Editing by Dominic Evans)", "description": "Turkey said on Tuesday it had completed preparations for a military operation in northeast Syria after the United States began pulling back troops, opening the way for a Turkish attack on Kurdish-led forces long allied to Washington.  The U.S. withdrawal will leave its Kurdish-led partner forces in Syria", "authors": ["Daren Butler"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-08"}