{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/15/cowboys-redskins-week", "downloaded_at": "2019-09-15 14:27:37.529853+00:00", "title": "Shorthanded Redskins look for first win against Cowboys in home opener", "language": "en", "text": "\n\nThe Redskins will need another strong game from quarterback Case Keenum to knock off the Cowboys. (Toni L. Sandys/The Washington Post)\n\nWashington Redskins (0-1) vs. Dallas Cowboys (1-0)\n\nKickoff: 1 p.m., FedEx Field.\n\nTV: Fox.\n\nRadio: 630, 980 AM; 92.7, 94.3, 105.9 FM.\n\nLine: Cowboys by 5.5.\n\nLooking to avoid an 0-2 start after blowing a 17-point lead at Philadelphia last week, the Redskins return home to host the Dallas Cowboys on Sunday. Washington won’t be at full strength on either side of the ball, with tight end Jordan Reed out for a second straight game with a concussion and defensive end Jonathan Allen sidelined with a sprained MCL. The Redskins will also be without their Week 1 starter at running back, Derrius Guice, who was placed on injured reserve after undergoing surgery on the meniscus in his right knee.\n\nAllen’s absence, coupled with fellow defensive lineman Caleb Brantley joining Guice on IR, could be the biggest problem against the Cowboys, who had nearly 500 yards of offense in a 35-17 season-opening win over the New York Giants. Washington allowed 116 rushing yards against Philadelphia and failed to put much pressure on quarterback Carson Wentz after Allen left the game late in the first quarter.\n\nNow the shorthanded defensive line, considered the strength of the team coming into the season, must contend with running back Ezekiel Elliott and quarterback Dak Prescott. Elliott should be well rested after carrying the ball only 13 times in last week’s comfortable win, while Prescott posted a perfect 158.3 passer rating against the Giants.\n\nWashington had success throwing the ball in Week 1, with Case Keenum passing for 380 yards, but the Redskins’ 28 rushing yards were their fewest in an opener since 1965. With Guice out, veteran Adrian Peterson is expected to get most of the carries against Dallas. The 34-year-old was a healthy scratch for the first time in his career last week, a move that sparked criticism of Coach Jay Gruden from both inside and outside the locker room.\n\nThe Cowboys have won seven of 10 games against the Redskins since Gruden was hired in 2014, including five of the last six. The Redskins beat Dallas, 20-17, in last year’s meeting at FedEx Field, when Peterson rushed for 99 yards and Washington limited Elliott to 33 rushing yards. Last Thanksgiving, with Colt McCoy starting in place of the injured Alex Smith, Elliott ran for 121 yards in a 31-23 Cowboys win.\n\nPregame reading\n\nFive keys to Sunday’s game against the Cowboys, including forcing turnovers\n\nWashington failed to force a turnover in last week’s loss at Philadelphia, allowing the Eagles to dominate the second half with several long, clock-consuming touchdown drives. (Read more)\n\nThe Redskins say they have a great defensive line. The numbers don’t show it.\n\nPro Football Focus ranked Washington’s defense last against the run in 2018. The Redskins allowed 116 rushing yards to the Eagles in Week 1. (Read more)\n\nTerry McLaurin spent his college days preparing for the unexpected. In the NFL, it’s paid off.\n\n“I feel like I have a maturity that is beyond my years,” the third-round rookie wide receiver out of Ohio State said after making five catches for 125 yards, including a 69-yard touchdown, in his pro debut. (Read more)\n\nDerrius Guice played on IR; Jonathan Allen and Jordan Reed ruled out for Sunday\n\nThe Redskins’ secondary is banged up ahead of Sunday’s game vs. Cowboys\n\nJay Gruden was already on shaky ground. Benching Adrian Peterson didn’t help.\n\nShawn Springs on the Montgomery County Sports Hall of Fame, mentoring Dwayne Haskins\n\nRedskins release cornerback Greg Stroman\n\nSantana Moss says Redskins deactivating Adrian Peterson was ‘ludicrous’", "description": "Washington has lost five of six against Dallas, and is already in a precarious early-season situation.", "authors": ["Scott Allen", "Reporter Covering D.C. Pro", "Local College Sports", "September At Am", "Scott Allen Has Written About The Capitals", "Nationals", "Redskins", "Wizards", "More For The Washington Post'S D.C. Sports Bog Since Before Joining The Post", "He Wrote About High School Sports For Usa Today"], "top_image": "https://www.washingtonpost.com/resizer/G9AVzzgiCHz74pxdYTFwhPqdMZ8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ITFASVWU7YI6TCJEDW35VR4X7M.jpg", "published_at": "2019-09-15"}