{"pub": "axios", "url": "https://nytimes.com/2019/10/22/world/asia/hong-kong-extradition.html", "downloaded_at": "2019-10-23 09:38:04.949738+00:00", "title": "Hong Kong Frees Murder Suspect Whose Case Led to Protests", "language": "en", "text": "Mr. Koon, who began visiting Mr. Chan because both he and Ms. Poon had graduated from schools affiliated with the Anglican Church, said he had been struck by Mr. Chan’s willingness to confess to the killing and turn himself in.\n\n“Everyone can see that he is just a kid,” Mr. Koon said on Wednesday. “I hope he will be given a second chance to correct his errors and start over.” He denied rumors that officials had put pressure on Mr. Chan to surrender to Taiwan.\n\nMr. Koon told reporters that he had bought plane tickets to Taiwan for himself and Mr. Chan, but canceled them after Taiwan indicated that Mr. Chan would be denied entry.\n\nA Question of Sovereignty\n\nThough Mr. Chan has said he would surrender to Taiwan, that self-governing island and Hong Kong are arguing over the terms. The disagreement is rooted in Taiwan’s disputed sovereignty.\n\nChina claims Taiwan is part of its territory, and Hong Kong, a semiautonomous region of China, is wary of any arrangement that would seem to confer recognition on Taiwan’s government. Taiwanese officials, for their part, have complained about a lack of cooperation from Hong Kong, and they have questioned whether they would receive enough assistance from the city’s authorities to successfully prosecute Mr. Chan.\n\n“According to the Hong Kong side, if we make a request for evidence with regards to Chan’s surrender, the Hong Kong side will actively cooperate. But it also said there is no law for cooperating with Taiwan on criminal justice,” Taiwan’s Mainland Affairs Council said in a statement on Sunday. “We plan to ask the Hong Kong government, based on this contradictory statement, how can you provide assistance to us?”\n\nHong Kong officials say such reservations risk undermining the opportunity to prosecute Mr. Chan. The city’s No. 2 official, Chief Secretary Matthew Cheung, on Tuesday urged Taiwan not to “complicate a simple issue” or “try to exploit politics in order to achieve certain gain at the expense, particularly, of justice.”.", "description": "The extradition bill that ignited Hong Kong’s protests was meant to address the case of Chan Tong-kai, who is wanted in Taiwan. Here’s why he’s been released.", "authors": ["Austin Ramzy"], "top_image": "https://static01.nyt.com/images/2019/10/23/world/23hongkong-1sub/23hongkong-1sub-facebookJumbo.jpg", "published_at": "2019-10-22"}