{"pub": "npr", "url": "https://npr.org/2019/09/30/765694898/up-to-4-feet-of-snow-montana-hit-by-unprecedented-winter-storm", "downloaded_at": "2019-10-01 00:09:34.391516+00:00", "title": "Up To 4 Feet Of Snow: Montana Hit By 'Unprecedented' Winter Storm", "language": "en", "text": "Up To 4 Feet Of Snow: Montana Hit By 'Unprecedented' Winter Storm\n\nEnlarge this image toggle caption Glacier National Park webcam/National Park Service Glacier National Park webcam/National Park Service\n\nMontana is under emergency conditions after an intense winter storm dumped record amounts of snow along with a life-threatening combination of bitter cold and stiff winds. In the town of Browning, 48 inches of snow fell from Friday to Sunday, the National Weather Service says.\n\nDespite coming in late September, the 19.3 inches of snow that just fell over two days in Great Falls is second to only one other two-day total in the city — in any month. The only time the city recorded more snow in two days was during a winter storm more than 10 years ago.\n\nMontana bore the brunt of a strong winter system that brought snow across the northern Rocky Mountains and parts of Idaho and Washington.\n\nWinds were gusting at 30-35 mph late Sunday in hard-hit areas such as Browning, according to meteorologist Megan Syner of the NWS office in Great Falls, who says the massive snowfall and strong winds \"created drifts almost as high as some houses in that area.\"\n\nEmergency crews are busy trying to keep routes clear, and utility crews are working to turn power back on in areas where strong winds downed trees and power lines, especially near and along the Rocky Mountain Front.\n\nEnlarge this image toggle caption Montana Department of Transportation Montana Department of Transportation\n\nMontana Gov. Steve Bullock declared an emergency in his state Sunday as the snow continued to fall.\n\n\"With an unprecedented winter storm throwing our state a surprise in September, state and local governments are working closely together to protect the health and safety of Montanans,\" Bullock said. He urged all residents to follow safety warnings from state and local officials.\n\nSome of the hardest-hit areas — the Blackfeet Indian Reservation, Glacier County and Pondera County — issued their own local emergency declarations.\n\n\"The ongoing major winter storm across the Northern Rockies is expected to wind down on Monday,\" the NWS said in its forecast Monday morning. But the agency adds that an additional 1-2 feet of snow could still fall, especially in parts of western Montana.\n\n\"Winter storm warnings and advisories remain in effect for much of North-Central Montana through Monday morning,\" the NWS said.\n\nEnlarge this image toggle caption Glacier National Park webcam/National Park Service Glacier National Park webcam/National Park Service\n\nEven after the precipitation tapers off, forecasters say many people in Montana will have to endure record cold for late September, with temperatures expected to dip into the single digits in north-central and southwest Montana.\n\n\"Unseasonably cold temperatures will delay snowmelt in some areas and bring the end of the growing season for some agricultural producers,\" the governor's office said. It adds that when the thaw finally comes later this week, Montana could also see flooding from the sudden rush of water that took days to accumulate.\n\nGoing into the weekend, the National Weather Service had warned that a \"historic\" winter storm could wallop Montana with blizzard conditions, and that prediction seems to have been accurate. The city of Great Falls saw 9.6 inches of snow on Sunday — a record for the date of Sept. 29.\n\nThe city set that benchmark one day after the city marked a record for September, as 9.7 inches of snow was reported on Saturday.\n\nThe only winter storm that recorded a higher two-day snow total in Great Falls occurred in late April of 2009, when 24.2 inches were measured, the NWS says.", "description": "Despite coming in September, the amount of snow that just fell over two days in Great Falls is second to only one other two-day total in the city, in any month.", "authors": ["Bill Chappell"], "top_image": "https://media.npr.org/assets/img/2019/09/30/mtdot-vid-000301001-00-02-2019-09-30-14-51_wide-5662b1752b0532a79d2ca975d13b133069515e01.jpg?s=1400", "published_at": "2019-09-30"}