{"pub": "cbc", "url": "https://cbc.ca/news/canada/british-columbia/sturgill-moose-fort-st-john-driftwood-1.5280353", "downloaded_at": "2019-09-13 00:57:25.782074+00:00", "published_at": "2019-09-12", "title": "How a driftwood moose named after a country music star helped raise thousands for arts in northern B.C. | CBC News", "language": "en", "text": "A moose made of driftwood and named after a country music star has helped raise thousands of dollars for arts and culture in northeastern B.C.\n\n\"Sturgill\" was created in 2017 to be part of a temporary exhibit at the North Peace Cultural Centre in Fort St. John, B.C.\n\nBut he proved so popular, the centre mounted a successful fundraising campaign for $5,000 to purchase the moose and put him on permanent display.\n\nToday, the sculpture — named after Grammy Award-winning musician Sturgill Simpson — greets visitors in the lobby that leads to the city's art gallery, library and a theatre, along with information about the centre's latest projects.\n\nAfter a successful fundraising campaign, Sturgill is now on permanent display at the North Peace Cultural Centre in Fort St. John, B.C. (Andrew Kurjata/CBC)\n\nArtist Michelle Pringle says Sturgill's success is a sign of how supportive her community can be toward local artists.\n\n\"Instantly I was getting interviews for the newspaper and local TV,\" she said. \"Fort St. John's great like that.\"\n\nPringle said she created Sturgill over the course of three nights, using pieces of driftwood she and her husband had collected at Williston Lake, west of the city.\n\n\"He was like a piece of my soul that just naturally happened,\" she said. \"I would look down, I would grab a piece [of driftwood] and it would fit... It's like he was this giant puzzle that I already knew how to build.\"\n\nSturgill proved so popular that a fundraising campaign of $5,000 was mounted to allow him to become part of the permanent collection on display at the North Peace Cultural Centre in Fort St. John, B.C. (Andrew Kurjata/CBC)\n\nHer original choice for a name was \"Dirks Bullsteen,\" but it didn't feel appropriate for the final product.\n\nInstead, she named her art after Sturgill Simpson because she had his music on repeat during the entire creation process.\n\nWhile she's pleased with the recognition her driftwood sculpture has already received, Pringle has one more hope.\n\n\"It would be so cool if Sturgill Simpson knew about him,\" she said. \"If he just gave me a nod... That would be the ultimate.\"\n\n'Sturgill' is a moose made of driftwood that was originally part of a temporary exhibit at the Peace River Art gallery in Fort St. John. But he proved so popular, a fundraising campaign was mounted to make him a permanent piece of the gallery. The CBC's Andrew Kurjata speaks to artist Michelle Pringle about how Sturgill was created. 5:14\n\nMore stories from CBC British Columbia North\n\nSubscribe to Daybreak North on CBC Listen or your favourite podcast app, and connect with CBC Northern British Columbia on Facebook, Twitter and Instagram.", "description": "\"Sturgill\" was created in 2017 to be part of a temporary exhibit at the North Peace Cultural Centre in Fort St. John, but he proved so popular the centre mounted a successful fundraising campaign for $5,000 to put him on permanent display.", "authors": ["Cbc Prince George", "Andrew Kurjata Is An Award-Winning Journalist Covering Northern British Columbia For Cbc Radio", "Cbc.Ca", "Situated In The Traditional Territory Of The Lheidli T'Enneh In Prince George.", "You Can Email Him At Andrew.Kurjata Cbc.Ca.", "Twitter", "Facebook", "More Cbc British Columbia Interior"], "top_image": "https://i.cbc.ca/1.5280372.1568304533!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/sturgill-and-michelle.jpg"}