{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7625747/Burnley-fan-Nathan-Higgins-19-accused-racist-Brighton-striker-Gaetan-Bong.html", "downloaded_at": "2019-10-29 15:06:18.011115+00:00", "title": "Burnley fan Nathan Higgins 19 accused of being racist to Brighton striker Gaetan Bong", "language": "en", "text": "Burnley fan Nathan Higgins, 19, and his father Stewart, 53, (pictured outside Brighton Magistrates Court today) is accused of using the N-word and 'black b******' in a racist tirade towards Brighton striker Gaetan Bong\n\nA football and his teenage son hurled racist abuse towards a rival black player during a Premier League match, a court heard today.\n\nBurnley fan Stewart Higgins, 53, is accused of using the N-word and the term 'black b******' in a racist tirade towards Brighton striker Gaetan Bong.\n\nHe and his son Nathan, 19, are also alleged to have used a homophobic slur to shout at Brighton fans in the stands at the Amex Stadium on February 9.\n\nWhen questioned by a home fan, Higgins senior said: 'We're not racist. It's banter - it's just football,' Brighton Magistrates Court heard.\n\nThe court was told that when the incident is alleged to have happened, Bong had already accused a Burnley player of racially abusing him at another match.\n\nDominic Dudkowski, prosecuting, said before the match kicked off, another Burnley fan, Nicholas Ball, heard the two men shouting homophobic insults at Brighton fans.\n\nMr Ball, who was sitting two seats away from Higgins Senior, said he heard him repeatedly shouting 'b*****s'.\n\nMr Dudkowski said: 'The witness also heard the son shouting 'b*****s' a lot towards the home fans but the son was also heard to shout: 'black b*****d' and 'n******' towards a particular player, namely Gaetan Bong.\n\n'This was racist abuse and it was used repeatedly by the son towards that player. It continued for at least 10 minutes.'\n\nThe court was told the insults continued for some time before he finally lost his patience and challenged them.\n\nNathan, 19, (right) and his father Stewart Higgins, 53, (left) are also alleged to have used a homophobic slur to shout at Brighton fans in the stands at the Amex Stadium on February 9.\n\nMr Dudkowski said: 'He said: 'Don't use homophobic or racist language' and told them it was illegal and a hate crime.'\n\nBut Magistrates heard both men turned to him and told him: 'We're not racist. It's banter - it's just football.'\n\nMr Dudkowski said: 'Unfortunately the abuse continued and when the match reached half time the father challenged Mr Ball by taking him by the arm.'\n\nMagistrates were told Higgins Senior told him to mind his own business adding: 'I was just telling you what I used to say in the 70s.'\n\nMr Ball replied: 'That was about 50 years ago.' The court heard Higgins Senior then said: 'You need to get over yourself.'\n\nMr Ball attracted the attention of the steward and both Higgins Senior and Higgins Junior were taken away and later arrested by police.\n\nGiving evidence Mr Ball said: 'I felt scared for my own safety. I asked him to leave me alone but he seemed angered by my intervention.\n\n'I was worried he might hit me. One steward came up to see what was going on. The steward got in between me and older offender.'\n\nAt an earlier hearing both men pleaded not guilty to using threatening or abusive words or behaviour likely to cause harassment, alarm or distress\n\nThe court heard both Higgins Senior and his so were then led away by stewards and later arrested.\n\nMr Ball told the court he had been attending the match with his wife Suzanna and had warned her beforehand there might be homophobic abuse.\n\nBut he said the level of abuse from both men was repeated and he felt compelled to challenge them.\n\nHe told the court: 'I asked them to stop. I encouraged them to focus on the match - they seemed more interested in shouting at the Brighton fans.'\n\nMr Ball, who has campaigned on behalf of Stonewall's attempts to rid football of homophobia, said he felt compelled to take action and confront the men before alerting stewards.\n\nHe added: 'It completely ruined the day for me. I haven't been to a Burnley game again and I'm not sure I will again.\n\n'I'm concerned about being confronted by them or their friends as they were with a big group.'\n\nAt an earlier hearing both men pleaded not guilty to using threatening or abusive words or behaviour likely to cause harassment, alarm or distress.\n\nHiggins junior also pleaded not guilty to using racially aggravated threatening or abusive words or behaviour likely to cause harassment, alarm or distress.\n\nThe case continues.", "description": "Burnley fan Stewart Higgins, 53, and his son Nathan, 19, are accused of using the N-word and the term 'black b******' in a racist tirade towards Brighton striker Gaetan Bong.", "authors": ["Lara Keay For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/13/20326654-0-image-a-74_1572355466589.jpg", "published_at": "2019-10-29"}