{"pub": "yahoo", "url": "https://news.yahoo.com/mcconnell-says-wants-something-stronger-163710891.html", "downloaded_at": "2019-10-18 08:04:19.678985+00:00", "title": "McConnell Says He Wants ‘Something Stronger’ than House Resolution Condemning Syria Troop Withdrawal", "language": "en", "text": "Senate majority leader Mitch McConnell said Thursday that he would like to see “something stronger” than the bipartisan resolution the House passed on Wednesday condemning President Trump’s decision to pull U.S. troops out of northern Syria.\n\n“I believe it’s important that we make a strong, forward-looking strategic statement. For that reason my preference would be for something even stronger than the resolution that the House passed yesterday, which has some serious weaknesses,” McConnell said in a Senate floor speech.\n\nThe resolution overwhelmingly passed the House in a 354 to 60 vote, with 129 Republicans voting in favor. It states that Congress “opposes the decision to end certain United States efforts to prevent Turkish military operations against Syrian Kurdish forces in Northeast Syria” and demands the White House present a plan to support Kurdish fighters and prevent ISIS from regaining a foothold in the area.\n\nTrump announced last week that he would withdraw American troops stationed in the north part of Syria, saying he did not want the U.S. to “police” the area any longer. The decision was condemned by many in Trump’s party, including some of his closest allies, who anticipated that a U.S. troop withdrawal would clear the way for the invasion of the region subsequently launched by Turkey and leave the Kurdish-led Syrian Democratic Forces, who have fought alongside by U.S troops in an alliance against ISIS, open to attack.\n\nHowever, while McConnell said he was “encouraged” by the resolution, he complained that it is “narrowly drafted,” and does not address several crucial issues such as the Sunni Arab and Christian communities in Syria.\n\n“It is curiously silent on the issue of whether to actually sustain a U.S. military presence in Syria, perhaps to spare Democrats from having to go on record on this question,” McConnell remarked. “Many of us will have much more to say on the subject very soon,” he added.\n\nMore from National Review", "description": "Senate majority leader Mitch McConnell said Thursday that he would like to see \"something stronger\" than the bipartisan resolution the House passed on Wednesday condemning President Trump's decision to pull U.S. troops out of northern Syria.\"I believe it's important that we make", "authors": ["Mairead Mcardle"], "top_image": "https://s.yimg.com/uu/api/res/1.2/wOl.kGuVPWKnhHTfkt9cLA--~B/aD01OTc7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/ba27950f7766d24d340fc46198367303", "published_at": "2019-10-17"}