{"pub": "investing.com", "url": "https://in.investing.com/news/stock-market-news/update-1south-african-signs-deal-with-tencent-to-boost-chinese-tourists-2010990", "downloaded_at": "2019-10-22 14:04:13.197681+00:00", "title": "UPDATE 1-South African signs deal with Tencent to boost Chinese tourists", "language": "en", "text": "© Reuters. UPDATE 1-South African signs deal with Tencent to boost Chinese tourists\n\n(Adds details)\n\nCAPE TOWN, Oct 22 (Reuters) - South Africa has signed a two-year agreement with Chinese Internet firm Tencent , which will use its popular WeChat platform to market tourism to millions in China, the South African tourism minister said on Tuesday.\n\nSouth Africa is targeting key untapped tourist markets such as China and India as it promotes tourism as a catalyst to help kick-start its struggling economy.\n\nTravel and tourism contributed around 426 billion rand ($29 billion), just under 9 percent of GDP, to South Africa's economy in 2018, making it the largest tourism market on the continent, the World Travel and Tourism Council says.\n\n\"This strategic co-operation agreement is one of many initiatives developed to increase arrivals from China to South Africa,\" Tourism Minister Mmamoloko Kubayi-Ngubane said in a statement.\n\nShe said TenCent will help position South Africa as a preferred tourism destination, using digital marketing campaigns on WeChat as well as other platforms within the TenCent ecosystem.\n\nTencent will also assist SA Tourism with efforts to accelerate the implementation of WeChat Pay for Chinese travelers visiting South Africa, Kubayi-Ngubane said.\n\nPristine white beaches, legendary Table Mountain and safari tours to see big game animals make South Africa a popular tourist attraction with millions of mainly European visitors each year.\n\n\"In addition to customized market for each market segment, Tencent platforms will also enrich Chinese traveler's experience when they travel to South Africa,\" the minister said.\n\n($1 = 14.6672 rand)", "description": "UPDATE 1-South African signs deal with Tencent to boost Chinese tourists", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPED4H22G_L.jpg", "published_at": "2019-10-22"}