{"pub": "news24", "url": "https://parent24.com/Family/Date-night/re-framing-divorce-families-and-their-changing-shapes-20191009", "downloaded_at": "2019-10-14 23:25:04.749952+00:00", "title": "Re-framing divorce: Families and their changing shapes", "language": "en", "text": "Re-framing divorce: Families and their changing shapes\n\nEven if the shape or structure of your family changes how you treat each other, and your values, should remain the same.\n\nRaising a family together is hard work, and sometimes marriage and relationships don't survive. But splitting up when there are kids involved is even harder. Parent24's #dignifieddivorce series is here to help parents navigate the legal and emotional implications of a divorce.\n\nWikipedia defines divorce in South Africa as the following:\n\n\"Divorce (or the dissolution of marriage) in South African law refers to the termination of a marital union, the canceling of the legal duties and responsibilities of marriage and the dissolving of the bonds of matrimony between a married couple.\n\nDivorce is unlike annulment, which declares the marriage null and void. Divorce requires the sanction of a court in a legal process. The legal process of divorce may also involve issues of alimony (spousal support), child custody, child support, distribution of property and division of debt.\"\n\nAccording to the dictionary, to divorce is to:\n\n1. legally dissolve one's marriage with (someone).\n\n\"she divorced him in 1965\"\n\n2. separate or dissociate (something) from something else, typically with an undesirable effect.\n\n\"religion cannot be divorced from morality\"\n\n'Undesirable effect'\n\nKate Rowe, founder and CEO of explorare.co.za, told us that while common, divorce is still an experience which is challenging, painful and linked with shame and a sense of failure.\n\n\"Divorce is a heavy word,\" she says, \"and often conjures images of fighting, disillusionment, devastation, court battles and people making choices from a place of fear and anger.\"\n\nThis is even more true when the couple has children.\n\nPerspective shift\n\n\"I would like to offer a perspective shift,\" Kate suggests. \"What if instead of speaking about divorce, with all the connotations of pain and anguish, we instead spoke about families changing shape?\"\n\nKate explains that families come in all sorts of shapes, and they morph and change for many reasons, like a new sibling arriving, or someone getting married, or a grandparent coming to live with you or passing away. Families can change shape in a variety of ways.\n\nShe is correct.\n\nIn South Africa it is common for children to move between relatives and to be raised at different stages by grandparents, parents and other relatives, largely the legacy of Apartheid and migrant work.\n\nAlso, recent stats show that two thirds of families are led by single mothers, and 60% of children don’t have their father’s name on their birth certificate.\n\nIt is certainly past time to do away with assumptions about nuclear families, and to embrace the diversity of families and various, changing, living arrangements.\n\nBe present and honest\n\n\"What if you took the time to know what values and agreements hold you together as a family?\" Kate asks. Even if the shape or structure of your family changes how you treat each other, and your values, should remain the same.\n\nThis idea asks a lot, she agrees, as it asks people to be present and honest about what they are feeling, more often, and before a couple, parents or family end up in a place where fighting or silence seem to be the only two options of communicating.\n\nShe explains that this idea \"invites you to pause and take a moment to look at what your values are, what connects you as a couple, what values motivate your actions and choices in your family life.\n\n\"I work with many people who are not clear on what their values are,\" Kate says. \"This perhaps, is a vital step you can take right now no matter if you are single, divorced, married or in relationship which will support you in establishing relationships which are connected and cohesive. No matter their shape.\"\n\n\n\nKate encourages us to ask what values guide our choices and decisions each day, and to consider what values you choose to guide your choices as a family?\n\nFor more on this topic follow Parent24's #dignifieddivorce series here\n\nChat back:\n\nShare your story with us, and we could publish your mail. Anonymous contributions are welcome.", "description": "Even if the shape or structure of your family changes how you treat each other, and your values, should remain the same.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9446/e153a8d6f26047508f59ad384332ebd7.jpg", "published_at": "2019-10-09"}