{"pub": "cnn", "url": "https://cnn.com/2019/09/06/entertainment/disability-representation-in-hollywood/index.html", "downloaded_at": "2019-09-07 02:30:48.738584+00:00", "title": "How Hollywood is working to improve representation of people with disabilities", "language": "en", "text": "(CNN) The second season of SundanceTV's dramedy \"This Close\" opens with what would be a terrifying experience for anyone.\n\nAfter being hit by a car while he was standing in the street, Michael (played by star and co-creator Josh Feldman) is rushed to the hospital. But Michael, like Feldman, is deaf and his attempts to express his situation through sign language go increasingly to no avail. It isn't until his best friend Kate (played by co-creator and fellow deaf actor Shoshannah Stern) arrives to demand a translator, lest the doctors and nurses want an investigation from the ACLU, that things change.\n\nTo Kate and Michael, this experience is everyday life. To a hearing audience watching, the scenes feel claustrophobic, like you're in a psycho-thriller where no one believes you're telling the truth.\n\n\"For the two of us, that kind of experience is very familiar,\" Feldman said through an interpreter of the \"This Close\" second season premiere, which airs September 12. \"Everyone else who isn't deaf wouldn't have that same connection. So it was like a concurrence of story and politics that kind of came together perfectly.\"\n\nStern added that \"we always say that we come up with a story, first and foremost, and we find ways to insert the deaf experience from there ... every time you go to a hospital for an emergency, it takes forever to get an interpreter and a loved one has to step in.\"\n\n'It takes away our story'\n\nDiversity has been a battle cry in Hollywood for years as the influx of programming has (theoretically) made it even easier for networks to champion previously marginalized voices along the gender, race, class and sexuality divides. But one of the ways that storytelling, casting and hiring frequently fail to deliver is when it comes to representation of people who are disabled.\n\n\"There have been countless times where I have entered an audition and the casting director just immediately wrote me off without even seeing me on camera,\" said Steve Way, an actor, comedian, and disability awareness advocate who has muscular dystrophy. Before he appeared with his childhood friend Ramy Youssef in the latter's Hulu show \"Ramy,\" Way largely created his own projects as he routinely lost parts to able-bodied actors -- an ongoing practice that Way describes as both \"offensive and dangerous.\"\n\n\"It's offensive because it takes away our story and takes away jobs from people who deserve it more and earned it more and it's an inauthentic showing,\" he said.\" And it's dangerous because when people see that, that's what they think is real.\"\n\nWhile there are signs of improvement in the casting of disabled people -- filmmaker John August recently Tweeted that he won't make his next movie, which is about a 15-year-old blind girl, unless he finds a blind actress -- these tend to be outliers. Bryan Cranston's portrayal of a character in a wheelchair in the film \"The Upside\" caused internet outrage and some reflection from Trevor Noah of Comedy Central's \"The Daily Show.\" The CW's \"In the Dark\" was panned, in part, because it cast a seeing actress (Perry Mattfeld) as a blind woman. Freddie Highmore, who is not autistic, has been lauded by critics for his portrayal of an autistic surgeon on ABC's \"The Good Doctor\" while those in that community have not always agreed.\n\nRyan O'Connell in 'Special'\n\nThere's also the misunderstandings and stereotypes surrounding what constitutes a person with a disability and why their inclusion matters just as much as those of other minorities.\n\n\"When I first started working in TV ... my agents at the time [said] you're basically a straight white male and it's going to be hard to get you staffed,\" recalled Ryan O'Connell. The creator and star of Netflix's Emmy-nominated \"Special\" has cerebral palsy and is gay. \"I'm a straight, white male? Tell that to my limp, my drool and my hard-on for men.\"\n\nThe upcoming third season of \"Atypical,\" the Netflix series about a teenager (Keir Gilchrist's Sam) on the autism spectrum and his family, will address what it means to be a person with an invisible disability.\n\n\"Sam's going to be in college and the world of someone like Sam -- who is pretty high-functioning -- going to college [meant] we had to learn so much about that,\" series creator Robia Rashid said in regards to the research she and her writers do, especially after the first season of the show -- and the casting of Gilchrist, who is not on the spectrum -- divided the autism community. \"High schools and elementary and middle schools have to provide services to students with disabilities. In college, they don't have to unless the student self-identifies.\"\n\nThis can mean an education for directors and other crew members. The \"This Close\" creators say that not all of their behind-the-scenes staff are fluent in ASL, but many have taken initiatives to learn words and phrases that pertain to their jobs. Rashid said that, just based on its subject matter, \"Atypical\" tends to attract crew members who are parents of kids on the spectrum.\n\nIt's also possible these shows aren't aware of how many disabled people they employ because of the expansive definition of this word -- the Americans with Disabilities Act is broad in what constitutes a \"disability\" -- and the legality in asking.\n\nExpanding the concept of diversity\n\nNetworks and studios are also working to be more inclusive.\n\nKaren Horne, NBC Entertainment and Universal Television Studios' senior vp of programming talent development and inclusion, stressed that while they \"would never put diversity before talent,\" her department has created lookbooks for disabled performers before pilot season and work with showrunners, marketing and publicity on proper language and accessibility.\n\n'Atypical'\n\nJeanne Mau, senior vp of entertainment diversity and inclusion at CBS, said they partner with organizations like Lights! Camera! Access! on workshops about breaking into the business and talk with producers about subtle ways to incorporate inclusion, such as an episode of \"S.W.A.T.\" that used a wheelchair basketball team.\n\nTim McNeal, ABC's vp of development and inclusion, said small but necessary changes to writers rooms have included wheelchair accessible and a showrunner who ensured his staff members made eye contact with their deaf colleague when pitching ideas so that she could read their lips.\n\nBut also important? The need to include disabled people in the development process. Lauren Appelbaum, the vice president of communications for nonprofit and outreach group RespectAbility -- and author of guidebook \"The Hollywood Disability Inclusion Toolkit\"-- said this work needs to begin at entry-level employment.\n\n\"A lot of jobs at production companies and studios require a bachelor's degree [but] only seven percent of people born with a disability graduate college,\" she said, adding that \"internships at these major studios and networks are only open to college students. That makes it very difficult for a person with a disability who is not attending college to break into this field.\"\n\nThere are also questions of how, and when, a disabled person working in Hollywood should divulge this information to an employer.\n\nJudith Heumann, a disability rights advocate and lead author of the Ford Foundation's \"Road Map for Inclusion: Changing the Face of Disability in Media,\" said she'd like to see more established people speaking out about their disabilities in essays and on social media, and that she counsels other members of the community on when (or if) to disclose.\n\nShe added that \"there are like 300 different types of jobs in the industry, and where they are collecting data on diversity, disability should be a part of that data collection.\" She points to reports like GLAAD's annual \"Where We Are in TV\" that catalogs the number of characters with disabilities, as ways we are seeing changes.\n\nSteve Way and Ramy Youssef in a scene in 'Ramy'\n\n\"I think breaking bread together is really important and trying to look at ways of bringing people into the field in full-time positions,\" Heumann said.\n\nAlso important? Showing disabled people of color in lead roles. \"Ramy's\" Way unflinchingly said he \"100 percent\" believes the fact that he is white has helped with his exposure.\n\n\"I am forever grateful that I have been given this platform, but I am just a drop in a massive bucket of on-screen representation,\" Way said. \"It is now up to me to give a platform to those who are more marginalized than I am.\"\n\nHeumann said the industry needs to be \"continuing to move into the various pipelines,\" not just with scouting and training disabled people to fill jobs but also qualm fears of talking about it in general.\n\n\"The other issue is getting people to stop being afraid of discussing disability,\" she said. \"People just need to get over it and just need to recognize that the [Center for Disease Control] says one in four adults in the United States live with a disability,\" she said. \"It's not inappropriate to ask for change. Change needs to happen and change, in part, happens by acceptance.\"", "description": "A look at how differently abled actors and storytellers are working to expand the concept of inclusion in Hollywood.", "authors": ["Whitney Friedlander"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190906095837-ramy-super-tease.jpg", "published_at": "2019-09-06"}