{"pub": "reuters", "url": "https://widerimage.reuters.com/story/victims-of-industry", "downloaded_at": "2019-09-13 00:57:30.768224+00:00", "published_at": "2019-09-13", "title": "Victims of industry", "language": "en", "text": "Advertisement\n\n15-year-old Rasheda lost one arm, and critically injured the other, in a work-place accident at the Abul Khair Steel Mills in Chittagong.\n\nSince the Rana Plaza disaster, which killed 1,132 garment workers, international attention has focused on workers’ safety in Bangladesh. From ship breaking to cigarette making, Bangladeshi workers frequently find themselves labouring in hazardous conditions.\n\n16-year-old Marium, who survived the Rana Plaza complex disaster, had her arm amputated in order to rescue her from the rubble. At least five different Bangladeshi agencies have dispatched teams to start inspecting the country’s thousands of garment factories, but there has been little coordination between them. More than four million people, mostly women, work in Bangladesh's clothing sector, which is the country’s largest employment generator, with annual exports worth $21 billion.\n\nAinul Huq, 55, (right) and Bulbul Hossain, 25, worked for years in a stone-crushing factory. Both suffer from silicosis, an incurable lung disease caused by inhalation of silica dust. The stone crushing industry in the Burimari area of Lalmonirhat, produces lime powder for industrial purposes. According to a report by the Bangladesh Institute of Labour Studies, those working in the industry run the risk of contracting silicosis. A researcher from the organisation said that at least 18 workers in the Burimari area died from the disease over the last four years.\n\nA child fills up empty cigarettes with locally grown tobacco in a small bidi (cigarette) factory at Haragach in Rangpur. US-based NGO, Campaign for Tobacco-Free Kids, says that over 45,000 people in Bangladesh are employed in the industry, including many women and children. A 2011 paper published in the journal Tobacco Control, notes that working conditions are often unhealthy, and can involve poor ventilation and exposure to tobacco dust, which can cause a range of health problems including respiratory and skin diseases.\n\nLabourers disembark from a boat after working on part of a wrecked ship at a breaking yard in Chittagong. The Bangladesh Institute of Labour Studies reports that around 30,000 workers are employed in the ship-breaking industry in Chittagong, a highly polluted coastal belt of around 20 km (12.4 miles). Environmental organisations have said that the number of accidents and casualties at the yard is believed to be the highest in the region. Bangladesh is dependent on ship-breaking for its domestic steel requirements.", "description": "15-year-old Rasheda lost one arm, and critically injured the other, in a work-place accident at the Abul Khair Steel Mills in Chittagong.", "authors": ["Andrew Biraj"], "top_image": "https://photos.wi.gcs.trstatic.net/WBTnOVC7qqta06gXHeKsQ8aDaakIWX7V3rDklDnGCT9HrhyVeKd8mluvIT-J2r3q3z4t0HpM9yPl00pB8ZDPeENfMlN7AfX8Iga7QHXgwDMjsgQTckli32_BQdw3oLGb"}