{"pub": "atlantic", "url": "https://theatlantic.com/ideas/archive/2019/09/unicorn-delusion/598465", "downloaded_at": "2019-09-20 12:54:10.093423+00:00", "title": "WeWork and the Great Unicorn Delusion", "language": "en", "text": "There are several reasons companies that have become synonymous with consumer tech and the new urban Millennial lifestyle might appear zealously averse to turning a profit. Some are temporarily keeping prices down to grow their price-sensitive customer base with the promise that they’ll easily raise prices once they’re big enough. Or they’re earning on every ride and rice-bowl delivery, but they’re losing on customer acquisition. Or they can’t raise prices, because they know that if they do, some other venture-capital darling in their market segment will undercut them—or, just as dispiritingly, the Amazon CEO Jeff Bezos, the archangel of superfluous margins, will swoop down and destroy them.\n\nBut whatever the rationale behind such colossal losses, it’s now clear that the tale private investors heard, and wanted to believe, when they poured tens of billions of dollars into these firms, is in conflict with the less exuberant reality of these companies’ precarity, spelled out in each federal filing.\n\nFor WeWork and Uber, their valuations soared thanks to private investors like the Japanese firm Softbank buying into extraordinary pitches—reinvent urban office space! reinvent urban transportation! Their initial valuations were predicated on a vision of total planetary conquest, which would require colossal capital infusions to buy real state, or to pay drivers, subsidize riders, and lobby governments.\n\nDerek Thompson: The age of tech is over\n\nBut both unicorns have seized up in the harsh light of SEC-compliant scrutiny. What investors and founders may characterize at conferences as an aggressive campaign of global expansion reads as something very different on a simple profit-and-loss statement: ridiculously huge losses. Since going public, Uber’s valuation has fallen nearly 50 percent. The company is on pace to lose more than $8 billion this year, due to onetime payouts to Uber employees and mounting quarterly losses. And that was before California codified a court ruling that could force the company to reclassify its workforce as full-time employees, something with the potential to transform its domestic business.\n\nAs for WeWork, the firm’s SEC filing envisioned an “addressable market opportunity” of $1.6 trillion, with nearly 300 million members. But the same documents showed massive annual deficits, no clear path to profitability, and a history of founder behavior that managed to out–Silicon Valley Silicon Valley.\n\nWithout similar documents on other consumer-tech companies, it’s hard to gauge the health of their businesses. What we can safely say is that WeWork’s and Uber’s reports confirm that too many start-ups are caught between the maybe-workable unit economics of their business—that is, the money Uber and WeWork take when you sit in their cars and chairs—and the maybe-not-so-workable extravagance of their visions, which practically require that capital infusions stay as infinitely and reliably free-flowing as a municipal water supply.", "description": "Why the consumer-tech revolution can’t seem to survive public scrutiny", "authors": ["Derek Thompson", "Staff Writer At"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/RTS2P5XP/facebook.jpg?1568926150", "published_at": "2019-09-20"}