{"pub": "yahoo", "url": "https://finance.yahoo.com/news/7-hot-penny-stocks-consider-143143502.html", "downloaded_at": "2019-09-13 20:12:41.000413+00:00", "title": "7 Hot Penny Stocks to Consider Now", "language": "en", "text": "Penny stocks have a mixed reputation. Some people are drawn to the low-priced stocks as a road to quick riches. Others say to avoid hot penny stocks altogether.\n\nThe truth is in the middle. There’s a ton of bad businesses priced under $5 a share. The saying “you get what you pay for” is based in a general truth, after all.\n\nBut there can be real bargains under $5 as well. You find many hot penny stocks that have gotten beaten up and seen their share prices plummet. And while many will never recover, others go on to triple, quadruple, and reach even greater heights.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nExercise caution and diversify your holdings when buying penny stocks. If you want to make an informed speculation in the space, these seven hot penny stocks are worthy of further consideration.\n\n\n\n\n\nHot Penny Stocks: UP Fintech Holding (TIGR)\n\nHot Penny Stocks: UP Fintech Holding (TIGR) More\n\nSource: Shutterstock\n\nUP Fintech Holding (NASDAQ:TIGR), which runs Tiger Brokers, is a Chinese financial firm that aims to help mainland investors put their money to work in overseas markets. Traditionally, Chinese investors have not had much access to foreign markets, so there is a sizable market opportunity here.\n\nUP Fintech IPO-ed earlier this year around $10 per share and quickly traded up to a high of $23. However, as you can imagine, the trade war has done a number on TIGR stock. The ability and desire of Chinese investors to use UP’s services has come into question given the deterioration in trade relations and the fall in the value of the Chinese Yuan. That, however, has set up an opportunity as TIGR stock has fallen below $5.\n\nWill sentiment turn around and get UP Fintech’s stock heading up again? That remains to be seen. What we do know is that the firm has excellent backers including smartphone giant Xiaomi, and leading U.S. trading shop Interactive Brokers (IEX:IBKR) which has invested in the firm. TIGR stock could continue to decline given the geopolitical difficulties, but with smart operators like Interactive backing it, you have to like the odds that the business will turn things around in due time.\n\n\n\n\n\nDiversified Restaurant Holdings (SAUC)\n\nDiversified Restaurant Holdings (SAUC) More\n\nSource: Susan Montgomery / Shutterstock.com\n\nDespite having diversified in its name, Diversified Restaurant Holdings (NASDAQ:SAUC) is actually a pretty concentrated business. The SAUC ticker symbol is a much better representation of what the firm is up to, as it is the largest independent Buffalo Wild Wings franchisee in the U.S., operating more than 60 locations. Since Inspire Brands bought out Buffalo Wild Wings, SAUC stock has become the only way to publicly invest in Buffalo Wild Wing’s fortunes.\n\nGiven that SAUC stock is trading around 45 cents per share and is down more than 50% since 2018, there are clearly some problems with the business. Arguably, much of this was due to Buffalo Wild Wings’ old management. Since Inspire bought them out, they’ve turned things around as new marketing in particular has same-store sales trending upward again.\n\nThere are a few specific positives that should make a difference for the franchise operators like Diversified. For one, Inspire has turned marketing back toward the sports bar-watching experience, which should raise the average tab. Delivery sales are booming. There has also been some improvement on chicken costs after years of surging wing prices.\n\nSAUC stock remains under pressure for now because the company has to refinance its debt next year. This shouldn’t be a problem; the company in fact just purchased more Buffalo Wild Wings restaurants earlier this year. Still, the market is nervous. However, recent quarterly results show the company nearing break-even. Even a 5% rise in revenues from here should lift SAUC’s EPS to at least 10 cents, which would make the stock exceedingly cheap. It is trading well under a dollar, after all.\n\nStory continues", "description": "Penny stocks have a mixed reputation. Some people are drawn to the low-priced stocks as a road to quick riches. Others say to avoid hot penny stocks altogether.The truth is in the middle. There's a ton of bad businesses priced under $5 a share. The saying \"you get what you pay for\" is based", "authors": ["Ian Bezek"], "top_image": "https://s.yimg.com/uu/api/res/1.2/GJ1P3abINKDWQ0.8AlNE2A--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/investorplace_417/d2af473f3e0c3394da6d3270930199eb", "published_at": "2019-09-13"}