{"pub": "hotair", "url": "https://hotair.com/archives/jazz-shaw/2019/10/09/castro-escorts-asylum-seekers-border-doesnt-end-well", "downloaded_at": "2019-10-09 18:44:14.008850+00:00", "title": "Castro “escorts” asylum seekers over border. It doesn’t end well", "language": "en", "text": "You almost have to give Julian Castro credit. In a crowded field of presidential candidates, the guy just keeps on going like the Energizer bunny and doesn’t let his almost nonexistent presence in the polls slow him down. His latest stunt to draw media attention came in the form of a trip south of the border where he rounded up a group of asylum seekers who were hoping to get a pass from the Remain in Mexico program and be allowed to await their hearing in the United States. The way it wound up playing out, however, wasn’t according to the program. (NPR)\n\nOn Monday, Castro crossed into Matamoros, Mexico, to meet with a dozen asylum seekers who have been waiting there under the Trump administration’s Migrant Protection Protocols policy, also known as Remain in Mexico. The asylum seekers were hoping they could be allowed to wait in the United States for their immigration court dates instead of Mexico where they said they faced violence and harassment because they identify as LGBTQ. Castro walked with the group and their lawyers across the international bridge and asked Customs and Border Patrol to allow them in, claiming an exemption to the MPP because of their status.\n\nSo Castro escorted 12 people seeking an exemption from the policy because of their LGBT status to the border. The CBP officials there agreed to hear their cases and allowed them to come through for interviews. Mission accomplished, right?\n\nNot so much. Three hours later, all 12 of them were back in Mexico.\n\nBREAKING: We just heard the terrible news that all 12 of our clients escorted by @JulianCastro were sent back to Mexico. This is of course a mockery of due process. Here is our statement on the matter:#LetThemIn — Texas Civil Rights Project (@TXCivilRights) October 7, 2019\n\nThese people had already been processed once and were assigned court dates. That’s how the system works. And under the new policy agreed to by both countries, they are supposed to wait in Mexico until that date arrives. Exceptions are made for those in unusual circumstances, but this group apparently didn’t qualify. There are certainly many asylum seekers in Mexico who would prefer to be released into the interior of the United States (probably all of them, actually) but we simply don’t have the facilities to accommodate them all.\n\nAnd while we’re on that subject, consider the massive number of people waiting in Mexico, many of whom certainly have similar complaints. Why would these twelve be given special privileges and head of the line status just because they were lucky enough to have a presidential candidate show up and lead them on a hike to the border?\n\nWhat should be obvious here is that this was a stunt on the part of Castro. He needed a feel-good story to highlight his complaints about the President’s immigration policies. And since it’s such a major issue in the Democratic primary campaign, he specifically selected some gay and lesbian migrants to add to the emotional punch of the story. The migrants may not have gotten to stay in the United States, but the larger mission was accomplished. Castro got his fifteen minutes on CNN and inserted his name back into the news cycle for a while. But I somehow doubt it’s going to move him much closer to frontrunner status.", "description": "Remain in Mexico means what it says", "authors": ["Jazz Shaw", "Ed Morrissey", "Karen Townsend", "John Sexton"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/08/castro-ad.png", "published_at": "2019-10-09"}