{"pub": "npr", "title": "Why The Ebola Response Is A Success In Goma — But Not Elsewhere In Congo", "url": "https://npr.org/sections/goatsandsoda/2019/08/30/755819355/why-the-ebola-response-is-a-success-in-goma-but-not-elsewhere-in-congo", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:28:23.579708+00:00", "text": "Why The Ebola Response Is A Success In Goma — But Not Elsewhere In Congo\n\nEnlarge this image toggle caption Samantha Reinders for NPR Samantha Reinders for NPR\n\nEven at Sunday Mass, you cannot miss the signs of Ebola.\n\nParishioners at St. Francis Xavier Catholic Church in Goma line up behind buckets to douse their hands with a solution of bleach and water. Then they get in another line where a team of health care workers check their temperature with an infrared thermometer.\n\nAfrica The Massive Effort To Halt Ebola In Congo The Massive Effort To Halt Ebola In Congo Listen · 5:22 5:22\n\nThe bells from the church tower toll. Girls run around in formal dresses. They flit around posters warning of Ebola symptoms, as the health workers look out at them from behind protective goggles.\n\nThis scene was very different a few weeks ago, says Jean Roger Paluku Lula, the team leader from Congo's Health Ministry. People were angry. They did not want health workers in their community.\n\nThe Democratic Republic of Congo is as familiar as any place with handling outbreaks of Ebola. The virus was discovered here in 1976, and the country has controlled the previous nine outbreaks without major problems. But the current outbreak — the 10th in its history — is now more than a year old, has killed 2,000 people and has become the second-biggest outbreak in history.\n\nThe outbreak started in a small town called Mangina but worked its way south through the densely populated towns of Beni and Butembo. Eventually, in July, the virus made it to this sprawling city of 2 million. It's a transit hub with an international airport and is just across the border from Rwanda. When Ebola reached Goma, the World Health Organization declared the outbreak a public health emergency of international concern, and funds and resources poured into Eastern Congo.\n\nPeople in Goma reacted as many people did up north. They threw rocks at health workers, suspicious that they were profiting off the response. In this neighborhood, they barricaded roads; they refused to wash their hands.\n\n\"At first, they believed the thermometers we were using were actually a tool that infects people with Ebola,\" Lula says.\n\nEnlarge this image toggle caption Samantha Reinders for NPR Samantha Reinders for NPR\n\nBut health workers did what they've done many times here in Congo: They went deep into the neighborhoods, explaining the disease and the treatments. They talked to leaders. They convinced more than 1,000 people to take an experimental vaccine, and here, at least, people understood. And the outbreak was controlled.\n\ntoggle caption Samantha Reinders for NPR\n\nLula looks around with satisfaction. A family of six had been found to have high fevers. Just a week or two ago, this would have been a tense moment. The crowd, he says, would have likely rallied around the family, afraid that they would be taken to an Ebola treatment center.\n\nBut the family listened to health authorities. They shared their travel history. It turned out they had been nowhere near an Ebola outbreak zone. They were sent home, and everyone else at church continued with their day.\n\nThat's the way an Ebola response is supposed to work.\n\nDashed Hopes\n\nIn a lot of ways, when this outbreak began, there was hope it could be quickly controlled. Unlike the 2013-2016 outbreak in West Africa, scientists had new tools: an experimental vaccine and two treatments that have been proven highly effective.\n\ntoggle caption Samantha Reinders for NPR\n\nIn fact, Congo's ninth outbreak was declared over just days before this one began. Authorities in Equateur province had successfully used this new vaccine to form a protective ring around active cases. In less than three months, the outbreak was contained, limited to 54 confirmed cases.\n\nBut Natalie Roberts, operations manager for Doctors Without Borders, says the vaccines and treatments had worked in very different settings.\n\n\"This is not sort of dealing with it on paper,\" she said. \"It's dealing with it in a very, very difficult context — the Eastern Congo being a very, very complicated environment in which to work.\"\n\nAs soon as you leave Goma, for example, the infrastructure crumbles; the security situation deteriorates. And everything becomes harder: Moving around, keeping vaccines cold, tracking down who is at risk and vaccinating them.\n\nEnlarge this image toggle caption Samantha Reinders for NPR Samantha Reinders for NPR\n\nIn Goma, authorities say they have been able to work every day. They haven't been hampered by attacks on facilities or violent protests. In a lot of ways, that explains why they've been able to stop secondary infections in Goma. But in Beni and Butembo, the outbreak seems to have no end in sight.\n\nNot only that, Roberts says, but those cities are in a part of Congo that experiences so much other suffering.\n\nThis year, for example, more people have been killed by measles than Ebola. Since January, the World Health Organization says more than 3,000 people have died of measles; each year in Congo, malaria kills 48,000 people.\n\nRoberts and her colleagues say in parts of Ituri province, where violence has displaced hundreds of thousands, some of the health centers they are building now have to have separate isolation units for Ebola and measles.\n\n\"This population and this context have 99 problems, and Ebola is just one of them,\" Roberts says.\n\nA Survivor's Story\n\nThe first case of Ebola in Goma was confirmed on July 14 at a house not far from the church. It's a neighborhood carved out of volcanic rocks at the foot of Mount Nyiragongo.\n\nEsperance Nabintu has pinned pictures of her late husband all around her home. He was the second case.\n\nEnlarge this image toggle caption Samantha Reinders for NPR Samantha Reinders for NPR\n\n\"My husband was a good husband,\" she says. \"He was handsome. He was well-created.\"\n\nThere are few jobs in Goma, so her husband had to travel hundreds of miles on a motorcycle to work at a gold mine up north. When he came back for a break, he was already infected with Ebola. He died shortly after being diagnosed.\n\nEnlarge this image toggle caption Samantha Reinders for NPR Samantha Reinders for NPR\n\nNabintu, 42, had 12 kids, but two of them died when they were babies from malaria.\n\nShe and her 6-month-old were both infected with Ebola, but they were saved by a new experimental treatment that was first tested and proven clearly effective in Congo.\n\nEnlarge this image toggle caption Samantha Reinders for NPR Samantha Reinders for NPR\n\nNabintu says she feels lucky. The doctors and nurses treated her and her family with respect and even fed them, she says.\n\nBut then, as she thinks about her husband, her thoughts drift. She sighs.\n\n\"I can't stop thinking,\" she says. \"I was married; I lost my husband, who was the head of the family. And now I have the children.\"\n\nShe beat the odds. She survived Ebola. But now, she says, she has to find a way to keep living.", "description": "What's working in this city of 2 million people, and why hasn't it worked in other parts of the country? The outbreak in Congo has now claimed 2,000 lives and is the second biggest in history.", "authors": ["Eyder Peralta"], "top_image": "https://media.npr.org/assets/img/2019/08/30/npr_drc_samanthareinders_003-87_wide-85f33ec82f031fd9967ed41bce42600176390102.jpg?s=1400"}