{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/joker-sets-october-box-office-record-taking-record/story?id=66097766", "downloaded_at": "2019-10-07 00:14:48.646407+00:00", "title": "'Joker' sets new October box office record, taking in a record $93.5 million", "language": "en", "text": "The \"Joker\" movie collected a record $93.5 million in its first weekend in U.S. theaters, becoming the biggest domestic October launch ever, according to Box Office Mojo.\n\nThe Warner Bros. adaption of the DC Comics classic, starring Joaquin Phoenix and Robert De Niro, also became the fourth-largest domestic opening for an R-rated film. The movie was No. 1 in box offices domestically and internationally, raking in $234 million worldwide.\n\nThose record-shattering numbers were achieved despite the controversy surrounding the film.\n\nPrior to the movie’s release, the FBI had received tips of threatening posts on social media calling for \"unspecific mass shootings\" linked to its release, according to a joint intelligence bulletin obtained by ABC News.\n\nSuch threats had appeared online since at least May 2019. Some referenced the July 20, 2012, mass shooting that killed 12 and wounded 58 people in an Aurora, Colorado, theater showing \"The Dark Knight Rises.\"\n\nStill, thoughts of violence associated with the movie are seemingly not far from moviegoers' minds. At a showing of the movie on Friday, a young man who was loudly cheering and applauding on-screen murders sent some people headed for the exits in a crowded theater in Manhattan's Times Square.\n\nPhotos posted on social media showed officers and a police dog outside a theater where \"Joker\" was being shown in Orlando, Florida, and a police SUV was parked on the sidewalk outside a cinema in suburban Birmingham, Alabama, during a screening.\n\nIn Bristol, Tennessee, the owner of the Twin City Drive-In Theater, Danny Warden, posted a warning on Facebook that anyone wearing a costume or mask to see \"Joker\" wouldn't be allowed in and anyone who smuggled in an outfit would be asked to leave.\n\nWarner Bros.\n\nIn a recent interview on \"Popcorn With Peter Travers,\" Phoenix discussed the threats of violence in relation to the film.\n\n\"I don't think [movies] cause homicidal ideation, the creation of homicidal thoughts,” he said. “I don't think that's the case. But the conversation around them, I think, can be dangerous.\"\n\nABC News' Josh Margolin, Aaron Katersky and Matthew Ley contributed to this report.", "description": "The R-rated movie stars Joaquin Phoenix and Robert De Niro.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/joker-warner-bros-02-ht-jc-190830_hpMain_2_16x9_992.jpg", "published_at": "2019-10-06"}