{"pub": "npr", "url": "https://npr.org/2019/10/16/770357632/in-olive-again-elizabeth-strout-revisits-an-old-friend", "downloaded_at": "2019-10-16 13:35:26.087122+00:00", "title": "In 'Olive, Again,' Elizabeth Strout Revisits An Old Friend", "language": "en", "text": "In 'Olive, Again,' Elizabeth Strout Revisits An Old Friend\n\nOlive, Again by Elizabeth Strout Hardcover, 289 pages | purchase close overlay Buy Featured Book Your purchase helps support NPR programming. How?\n\nTen years after Elizabeth Strout won a Pulitzer Prize for her eponymous collection of linked stories about Olive Kitteridge, a difficult but endearing, retired but not retiring middle school math teacher, she returns to coastal Maine with an update — which is just as wonderful as the original.\n\nYou don't have to have read Olive Kitteridge to appreciate Olive, Again, but you'll probably want to. Like a base coat of paint, it adds depth and helps the finish colors pop. Explaining the genesis of her sequel, Strout has written, \"That Olive! She continues to surprise me, continues to enrage me, continues to sadden me, and continues to make me love her.\"\n\nWell, that Elizabeth Strout! She continues to amaze (if no longer surprise) me. In book after book, from Amy and Isabelle to Anything is Possible, she's plumbed the heartaches and headaches of her characters, capturing their regrets, their moments of grace, and their flawed humanity with clear-eyed compassion. A master of the story cycle form which Sherwood Anderson put his stamp on with Winesburg, Ohio, Strout has at this point pretty much out-Winesburged him with her cumulative, time-lapse portrait of the people of Crosby, Maine.\n\nThe new novel starts shortly after Olive Kitteridge ended, when her ornery title character, lonely after the death of her husband Henry, struck up an unlikely friendship with Jack Kennison, a Harvard professor whom she and Henry had dismissed as one of those entitled, arrogant retirees from out-of-state. Her opinion changed after she found Jack collapsed on a riverside path, and Olive learned that he, too, was lonely following the recent death of his wife, and that he, too, regretted his alienation from his only child.\n\nWhen Olive, Again opens, their promising connection has been lost, like a dropped call. We re-meet Jack first, a clever move which initially enables us to catch up with Olive from afar. Three weeks into their upsetting impasse, Jack heads to Portland in his snazzy red convertible for a drink. He replays his disappointments and feels that perhaps he deserves it all. He rues his reprehensible behavior toward his lesbian daughter, his wife's coldness, (which he sees in a new light after a disturbing email from her old boyfriend), and the surprising harassment lawsuit that forced his early retirement. At 74, Jack wonders, \"How does one live an honest life?\" He's jerked out of his miserable memories by a traffic cop who pulls him over for speeding — a situation that quickly escalates into a power play with class overtones.\n\nAlong with loneliness, class divides and snobbery are again at the forefront of Strout's concerns. Shifting over to irritable Olive, we learn that she's in high dudgeon over \"that horrible old rich flub-dub of a man.\" She attends a baby shower she finds unbearably stupid, but ends up a hero for coolly helping with the emergency delivery of a guest's baby. Eager to tell someone about it, she calls her estranged son Christopher, who barely registers her achievement. Jack, she knows, will react differently.\n\nOlive is a blunt busybody and a gossip, but she's also capable of kindness, and many of these stories involve the mutual benefits that accrue when people help each other. A dying young woman who feels abandoned by all her friends is grateful for Olive's visits, but wonders if the reason Olive confides in her about a fight with Jack is because Olive thinks she'll be dead soon. No, Olive says; it's because she feels comfortable talking to her.\n\n'Olive, Again' repeatedly probes the limits of tolerance and the range of human behavior, sometimes boldly.\n\nStrout works a jaw-droppingly sad saga around to a moving takeaway when she revisits the Larkins, whose son — as we read in Olive Kitteridge — was incarcerated for life after stabbing a woman 29 times. When Suzanne Larkin, the grown daughter, returns to Crosby to meet with the family lawyer after her father's terrible death, we learn some equally terrible details about her family's history. But we're also reassured — as Suzanne and the lawyer are — by the uplift they find in their mutually comforting conversation.\n\nOlive, Again repeatedly probes the limits of tolerance and the range of human behavior, sometimes boldly. A chapter called \"The End of the Civil War Days,\" which involves a couple who have barely spoken to each other for 35 of their 42 years of marriage, draws surprising parallels between the playacting involved in the husband's Civil War re-enactments with their daughter's work as a dominatrix.\n\n\"The Poet,\" an outstanding chapter in Olive's often painful journey toward self-awareness, involves (like Anything is Possible) a now-famous author's return to her hometown. When Olive runs into former U.S. Poet Laureate Andrea L'Rieux at the local coffee shop, she remembers her former student, one of eight kids in a French-Canadian Catholic family, as sad, lonely, and not particularly promising. Later, when someone anonymously sends Olive Andrea's poem based on their unfettered conversation, she's initially appalled at how the writer has nailed her and her loneliness. But Olive reluctantly realizes that \"Andrea had gotten it better than she had, the experience of being another.\"\n\n'Olive, Again' poignantly reminds us that empathy, a requirement for love, helps make life 'not unhappy.'\n\nHere's the thing about Strout: Her characters endure some awful stuff — spousal abuse, parental neglect, the affronts of aging (including loss of independence and the need for adult diapers), blistering loneliness — but they're resilient. And if even harshly opinionated Olive can learn that a little compassion can change the picture, so can we. \"What is your life like, Betty?\" Olive asks a home health aide whose bumper sticker irks her. The question is key; it's the first step toward empathy. Olive, Again poignantly reminds us that empathy, a requirement for love, helps make life \"not unhappy.\"", "description": "Ten years after her Pulitzer Prize-winning Olive Kitteridge, Elizabeth Strout returns to the town of Crosby, Maine, where ornery Olive is learning about compassion, connection, and her own self.", "authors": ["Heller Mcalpin"], "top_image": "https://media.npr.org/assets/img/2019/10/15/oliveagain_esn_wide-c031e788b9f958e4f09432f0b6b09b67f3e99c63.jpg?s=1400", "published_at": "2019-10-16"}