{"pub": "cnbc", "url": "https://cnbc.com/2019/10/28/today-is-historically-the-single-best-day-for-the-stock-market-all-year.html", "downloaded_at": "2019-10-28 13:20:51.944409+00:00", "title": "Today is historically the single best day for the stock market all year", "language": "en", "text": "A trader laughs ahead of the closing bell on the floor of the New York Stock Exchange (NYSE) on February 1, 2019 in New York City.\n\nSeize the day, investors.\n\nOct. 28 has been the single best day of the year for stocks going back to 1950 with an average return of 0.54% on the S&P 500, according to Ryan Detrick, senior market strategist for LPL Financial.\n\nThe S&P 500 is on track hit a fresh all-time high at the open on Monday, lifted by solid earnings and progress on U.S.-China trade. Perhaps the seasonal pattern will get it some extra oomph on Monday.\n\nThis time of the year is also the period when investors following the sell-in-May-and-go-away strategy come back to the market, usually in November.\n\n\"It kicks off the best six months of the year (November-April) and says goodbye to the worst six months,\" Detrick said in a note on Monday. \"The last few days of October to the first few days of November is one of the strongest times of the year.\n\nThe market staged a relief rally last week after the U.S. and China said they were \"close to finalizing\" some parts of a trade agreement, paving way for a bigger deal. A strong earnings season also supported the rally. Of the 202 S&P 500 companies that have reported, 78% have topped analyst expectations, according to FactSet.\n\nThe second best day of the year has been Dec. 26 with the S&P 500 posting a 0.5% gain, according to LPL Financial.\n\nWith a 0.51% loss on average for the S&P 500, Oct. 19 has been the single worst day of the year, the firm noted.", "description": "Oct. 28 has been the single best day of the year for stocks going back to 1950 with an average return of 0.54% on the S&P 500, according to LPL Financial.", "authors": ["Yun Li"], "top_image": "https://image.cnbcfm.com/api/v1/image/105720496-1549377514765gettyimages-1092098460.jpeg?v=1561629648", "published_at": "2019-10-28"}