{"pub": "nymag", "url": "https://vulture.com/2019/09/bh90210-season-1-episode-5-recap-pictures-up.html", "downloaded_at": "2019-09-05 02:16:57.136126+00:00", "title": "BH90210 Recap: Party Like It’s 2019", "language": "en", "published_at": "2019-09-05", "text": "BH90210 Picture’s Up Season 1 Episode 5 Editor’s Rating 5 stars * * * * * « Previous Next Photo: Shane Harvey/FOX\n\nThis was the first night we had a chance to watch BH90210 together in the same room, thigh to thigh, and the result was rapturous. 29 years after the show started and here we are eating tuna melts and watching “new” episodes featuring our favorite ragtag group of former cool kids and Gabrielle Carteris. We can’t believe it’s 2019 and this is real life — somebody pinch us. That’s the general vibe at BH90210 this week, too. Somebody pinch them — it’s 2019!\n\nThe gang keeps acting like they’ve been frozen in the ’90s and reemerged, Encino Man style, only to find the world strange and different, i.e., on-set sex is all intimacy coaches and consent forms. Shannen can’t even eat a banana without getting HR called on her. Ian and head writer Anna continue to court each other using buzzy phrases like “Netflix and chill,” though neither of them seem to know exactly what it means. BAG skateboards everywhere and then laments, “I miss the ’90s.” Gab speaks for us when she replies, “I’m good.”\n\nPost-fire, production is shut down, and thank the angels (we’re talking to you, Scott Scanlon) for that, because now everyone’s got some time to make a list of their enemies in hopes that they can out the arsonist who destroyed the reboot set. Kudos to the writers’ room for sifting through celeb-gossip message boards to include real feuds (Ian versus Dancing with the Stars’ Cheryl Burke, Ian versus Ivanka Trump, Shannen versus Paris Hilton, Shannen versus the creator of the I Hate Brenda newsletters, BAG versus Vanilla Ice) alongside intriguing maybe-made-up feuds that we couldn’t substantiate overnight (Jennie versus Christina Aguilera, Jennie versus Cole Hauser, Gabby versus her Surreal Life co-star Corey Feldman, and Shannen versus male comedians Jerry Seinfeld [whom Shannen stalked!?] and Mike Myers [wtf, someone bring us the receipts!]). It’s worth noting, however, that there is no mention of Shannen’s feud with Alyssa Milano on the set of another Aaron Spelling original, or Jennie’s falling out with castmate and former BFF Tiffani Thiessen. (We are not counting Ian name checking the cast of Saved by the Bell.)\n\nWhile production is stalled, everyone gets QT with their cuties. Jennie has taken to drinking beer and watching golf with her bodyguard boyfriend. She and Ian double-date with their new love interests and everyone keeps insisting that everyone is “such a cute couple,” despite the fact that Jennie seems slightly hung up on Jason. Gab sweats when Christine asks her to backdate a consent form from Fox so she’s protected from being #Metoo’d, but Gab feels overwhelmed by the suggestion. We call baloney. Gab is the president of the actors’ union so she would be hep to this kinda shet, but her resistance proves to be more about a queer paper trail, since writing it down makes it real. Gab is still living in the theoretical even though she knows and we know that not only did she and Christine get it in, but she liked it.\n\nOnce we find out that the balmy Mr. Belvedere from the convention is the fire starter (more on that later), we can finally get back on set to shoot the very first scene of the reboot: a David-Donna love scene. Jason has totally thrown himself into his work, which means he’s once again donning a scarf. He’s also actively avoiding his real life, where his wife, Camille, is a person who drinks kamikazes and is pregnant with another man’s child. Maybe Jason’s not that good of a director. Please just make Ms. Tori Spelling feel comfortable during her sex scene, JP. After all these years, she is panicked about that age-old Hollywood question: “Is it better if BAG gets hard, or if he doesn’t?”\n\nBy the way, Tori Spelling is using her Donna Voice, and to be honest we didn’t know it was different until this mental mindfuck of a show showed us. The way Donna says, “I love you, David” has us downright damp. Tori may be feeling butterflies for BAG due to their on-camera smooshing, but BAG is preoccupied with his newly discovered Beautiful Boy son, who is making coffee runs and tying up cables on set as a PA. BAG is concerned with whether he’ll be able to evolve into more of a DAD and less of a BAG. It might all be for naught, though, since a stranger with a badge who was — wow guys, really? — maybe racially profiled by Gab stole BB’s water bottle for a DNA test. Expect another Maury moment in the season finale.\n\nLast but certainly not least, it’s the couple we are most invested in: Shannen and her green screen. This episode marks the first time Shannen appears to be on location for 90 percent of her scenes. She has ditched the green screen and has now taken up with an assortment of snacks. (Don’t worry if you weren’t keeping track, we were: banana, chips and guac, pickle, tequila, cheese sandwich.) Most of Shannen’s dialogue is snarky commentary or non-sequitur asides, which is to say the script was already written and they let her come in to riff. She’s Don Rickles. She’s the Migos. She’s the motherfucking Genie in Aladdin.\n\nAnd that brings us to this couple: Damian and Anne, your weekly recappers. This episode, we were just 90210-lovin’ best friends, side by side, screaming into each other’s mouths when we thought we had figured out the whodunit exactly one beat ahead of Tori Spelling falling down the stairs. “We called it,” Anne screamed. Damian, mid-celery bite in the aforementioned tuna melt, hollered “JAMIE WALTERS!” It had to be the former 90210 co-star who played Ray Pruit, singer of “How Do You Talk to an Angel?” and apparently now a real-life firefighter. It all made sorta-sense: Jamie’s acting career was derailed by fans’ negative reaction to his character pushing Donna down a flight of stairs — and this was before social media, tweeps — so of course he would be a perfect villain for BH90210. We figured this was Tori’s mea culpa for Aaron Spelling unceremoniously firing Jamie (he reportedly did get a million dollars, so he fine). Anyway, we were hyped, but then we were bamboozled. It wasn’t him after all, but who cares? This is a great opportunity for Jennie Garth to sing “How Do You Talk to an Angel?” into a Stella Artois! The Jamie Walters appearance was [*chef’s kiss*] truly thrilling. Tori Spelling has been calling all the cameos and nods to the show of yore “fan candy,” and we love her forever for it.\n\nIt’s 2019 and this penultimate episode of BH90210 has given us so many gifts: Tori got her boner from BAG, BAG admitted to the gang that he is the father, Gab announced she’s gay undecided, Ian got the girl, and Shannen got her blood sugar up. But going into the finale, this couple needs to know where things stand with Jason and Jennie. Jason was considering leaving Camille, but Jennie was the one who told him to stay. And it’s Jennie who urges him to go to the hospital when his wife is in an ambulance. Will there be a showdown at the hospital? Could their will-they-won’t-they be the season-one cliffhanger? More importantly, will Joe E. Tata show his face?!? Whatever shenanigans come next week, this little queer duo is praying to you, Scott Scanlon, for a season-two order so we can keep partying like it’s 9-0-2-1-0.\n\nPeaches\n\n• We audibly gasped at the callback to Kelly, Donna, and Brenda’s Robert Palmer trio.\n\n• The Ted Casablanca–style E! news show gave us all the feels. We miss you, Ted.\n\n• Kelly and Steve’s relationship was one of our favorites, so it was great seeing Jennie and Ian in a scene together.\n\n• The biggest guffaw of the night came from Shannen asking in earnest, “Siri, how many seasons of 90210 were there?”\n\nPits\n\n• Jennie drinking beers for a boy is bad news.\n\n• Instead of backing up Emily V, the Robert Palmer girls back up David Silver’s slow jam “Keep it Together” during BAG’s Peach Pit After Dark fantasy.\n\n• We call fowl on Shannen’s new scene partner, The Rooster.\n\n• Our math shows that there’s only one episode left but two principal characters who have yet to get a dream sequence (Ian and Shannen). It seems inevitable that Ian will get the gig since he signed on first, but that won’t keep us from holding out hope for Shannen.", "description": "The gang keeps acting like they’ve been frozen in the ’90s and re-emerged, Encino Man style, to a strange new world. A recap of ‘Picture’s Up,’ episode 5 of the Beverly Hills 90210 sequel reboot BH90210.", "authors": ["Damian Bellino", "Anne Rodeman"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/04/04-bh90210-recap.w1200.h630.jpg"}