{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/sep/05/ilhan-omar-send-her-back-somalia-us-foreign-policy", "downloaded_at": "2019-09-05 10:29:42.588415+00:00", "title": "'Send her back' isn't just racist. It ignores the US's critical role in Somalia | Stephanie Savell", "language": "en", "text": "In July, a crowd at a Trump rally chanted “send her back” about the Minnesota representative Ilhan Omar, parroting Trump’s suggestion that she “go back” to Somalia, from which she immigrated as a child. Shortly after, the Kentucky senator Rand Paul offered to buy Omar a plane ticket back to Somalia so that she would be more appreciative of her American home. What few commentators have mentioned is that, when it comes to Somalia, “send her back” is not just racist and offensive. It also completely ignores the critical role of US foreign policy over the past several decades in contributing to what Paul called “the disaster that is Somalia”.\n\nIn Somalia, the climate emergency is already here. The world cannot ignore it | Mustapha Tahir Read more\n\nFew Americans are aware that the US is conducting a rapidly rising number of drone strikes and even boots-on-the-ground combat operations against a group, al-Shabaab, that Washington labels “terrorists”. While the airstrikes are a response to US concerns about Islamist terrorists in Africa and foreign policy priorities evidenced in the so-called “war on terror”, they also are an extension of the long sorry history of US military intervention in Somalia. This history has been characterized by blunders, errors, atrocities, impunity, collusion, corruption and a very high toll on Somali civilians.\n\nA new report released today by Costs of War project, which I co-direct, at Brown University’s Watson Institute for International and Public Affairs, looks at the past four decades of US military involvement in Somalia, including the shadow war being waged there today, and concludes that as long as US military policy in Somalia targets al-Shabaab as a terrorist group, confronting it with the counterinsurgency tactics of the US-led war on terrorism, it won’t work.\n\nAccording to the report, authored by the Colby College professor Catherine Besteman, US actions in Somalia are predicated on a misreading of the local context. Al-Shabaab is not just a terrorist group in the sense of a group that commits violence against civilians, it is also a local resistance movement against foreign interventionism.\n\nThe growth of al-Shabaab has not only been fed by a long history of US operations in Somalia but also by the current US war against it\n\nThe US has played a significant role in Somali politics for decades, starting in the 1970s supporting Somalia’s brutal dictator, Siad Barre, during the cold war, and later attempting ineffectually to rebuild the collapsed state. In 1993, when the infamous Black Hawk Down incident occurred, the US military withdrew from Somalia after a local militia group shot down an American helicopter that was going after its leaders. After 9/11, however, the US once more began conducting military operations in Somalia; as the report states: “US security panics identified Somalia’s ongoing statelessness as offering a potential opportunity for terrorists.” Al-Shabaab has been gaining strength and power ever since, fueled by Somali rage over now decades-long foreign interference in their country. Thus the growth of al-Shabaab has not only been fed by a long history of US operations in Somalia but also by the current US war against it.\n\nToday, US military policy in Somalia ignores al-Shabaab’s deep ties to the Somali government, business interests, Somali national security forces, the African Union Mission in Somalia (AMISOM) and regional entities. For example, it raises funds by smuggling illicit exports of charcoal and sugar, evading a UN ban on such exports, with the collusion of regional government. Members of the Somali national army and its US-trained elite force, Danab, even provide the US with incorrect information about al-Shabaab’s location to minimize the affect of drone strikes on the organization.\n\nAmerica’s counterterrorism strategy has not lessened the impact of al-Shabaab activities. If anything, US actions have, according to the report, “augmented al-Shabaab’s ability to control the local population because al-Shabaab is so tightly connected to the war economy and benefits directly from it”. The money coming in from the US and elsewhere for security operations against al-Shabaab sustains the economy, and “the security economy is the economy in Somalia”. In other words, Besteman writes: “The war is good for business and business makes profit out of war.” Because of this, the US’s success in containing al-Shabaab over the long term through military actions is highly improbable.\n\nThe high cost of the US war in Somalia is borne by the Somali people. In March, Amnesty International called for the US government to investigate credible evidence that its airstrikes have killed numerous civilians in Somalia, despite the denial of most of these deaths by US Africa Command (AfriCom). Caught between the extortion of al-Shabaab and US bombs, Somalis are struggling to forge secure livelihoods and self governance. Millions have fled their homes to take refuge both within Somalia’s borders and beyond. Decades of political turmoil in Somalia and US military operations since the early 2000s have led to 4 million people living in dire conditions and in need of humanitarian assistance.\n\nGiven that al-Shabaab is so enmeshed with prevailing business and political interests, and that foreign militarism has just propelled the group onwards, it is absurd to continue combatting the group with military force, as the US has been focused on doing. Moreover, it is cruel. US lawmakers, pushed by human rights groups, have started to take steps towards ending America’s role in the atrocious human rights violations of the Saudi-led war in Yemen. Now its time to do the same with Somalia.", "description": "When a rally parroted Trump’s remark about Ilhan Omar, few were aware the US has been conducting drone strikes and combat operations against al-Shabaab", "authors": ["Stephanie Savell"], "top_image": "https://i.guim.co.uk/img/media/390424ec02601f2b605ec2846ba53dbd7654d401/0_297_5000_3002/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=0067395e3f4e8cac5e161af4c1c5f262", "published_at": "2019-09-05"}