{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/exclusive-tom-moyane-wanted-to-collapse-the-anc-say-party-vets-20190518", "downloaded_at": "2019-10-24 14:12:56.006327+00:00", "title": "EXCLUSIVE: Tom Moyane wanted to collapse the ANC, say party vets", "language": "en", "text": "A group of ANC veterans, including former deputy foreign affairs minister Aziz Pahad, have penned a stinging rebuke of disgraced former tax boss Tom Moyane, effectively accusing him of attempting to collapse the ANC.\n\nIn a discussion document titled \"Counter revolution, state capture and corruption in South Africa\", Pahad and his co-authors Mongane Wally Serote, Snuki Zikalala, Thami Ntenteni and Fazel Randera say the ANC was mistaken to think a counter-revolutionary offensive against the party's progress would come from outside its ranks.\n\nInstead, the \"deployment of enemies of the ANC and what it stands for\" had brought the country to the precipice.\n\nDespite damaging allegations of state capture emerging from the Zondo Commission, the ANC managed to win its sixth national electoral victory last week by obtaining 57.5% of the national vote – the lowest majority in the party's history.\n\nThe Pahad document, a copy of which News24 had obtained, quotes extensively from the findings of the Nugent Commission into Moyane's destructive reign at the South African Revenue Service (SARS).\n\n\"The aim of all this was to weaken and destroy the capacity of SARS to collect the revenues without which the democratic government and state can neither exist nor function. The aim of all of this was therefore the defeat of the democratic revolution which our people had ushered in in 1994,\" the document reads.\n\nMoyane was appointed as head of SARS by former president Jacob Zuma in 2014 after being extensively briefed by consulting firm Bain & Company on a new strategy for the receiver since October 2013. After his appointment, Moyane contracted Bain to overhaul the structure and strategy of SARS.\n\nThe authors question why Moyane would wreak havoc at SARS, quoting Nugent that \"no responsible leader of a major and complex organisation would have acted as Mr Moyane did, with lasting impact on the current state of SARS\".\n\nThe authors warn President Cyril Ramaphosa and the ANC that forces within the party are conspiring to defeat the \"democratic revolution\".\n\nThese include \"enemies of the revolution\" who are deployed by the ANC in state institutions and a \"cohort of incompetents\" deployed by the ANC who \"wittingly or unwittingly become part of the counter-revolution through no fault of their own\".\n\nThe authors argue that the ANC's policies have been distorted by \"enemies of the ANC and what it stands for\".\n\nThe governing party has been \"denuded of its ideological content and is available to be persuaded by all and sundry\".\n\nThe authors argue that the ANC was mistaken to think the defeat of apartheid was the end of \"apartheid forces\" and that a \"counter-revolutionary offensive\" against democracy would come from outside its ranks.\n\n\"Taking all this into account, it is clear that the country is in the grip of a general political, economic and social crisis which became entrenched in the last nine to ten years. This crisis became entrenched because our system of governance had been captured by forces beholden to the counter-revolution,\" they write.\n\nThe document quotes from a book by author Nadja Manghezi titled They were part of us and we were part of them: The ANC in Mozambique from 1976 to 1990, that details Moyane's time in exile in that country.\n\nAfter being involved in student politics at the University of the North, Moyane and his parents decided that he should travel to Mozambique in 1976, camouflaged as a retrenched Mozambican mine worker with oversized clothes and his hair uncombed.\n\nHe flew out of then Jan Smuts Airport (now OR Tambo International Airport) on board a TAP (Portuguese Airline) plane with his university documents in a battered suitcase, wrote Manghezi. Moyane told the author he met Zuma in 1976 in Mozambique.\n\n\"When President Jacob Zuma appointed Tom Moyane as SARS commissioner in 2014, this was to cap a 38-year old relationship between these two gentlemen.\"\n\nNews24 sent questions to Moyane via his attorney Eric Mabuza. The former tax boss is yet to respond.\n\n", "description": "A group of ANC veterans, including former deputy foreign affairs minister Aziz Pahad, have penned a stinging rebuke of disgraced former tax boss Tom Moyane, effectively accusing him of attempting to collapse the ANC.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8197/8f1855e4cebe4208b4914277ed9ab036.jpg", "published_at": "2019-05-19"}