{"pub": "politico", "url": "https://politico.com/news/2019/10/01/chris-collins-pleads-guilty-insider-trading-000161", "downloaded_at": "2019-10-02 00:32:35.276039+00:00", "title": "Chris Collins pleads guilty to insider trading", "language": "en", "text": "He said he was \"devastated\" to learn a drug being tested for treatment of multiple sclerosis failed a trial.\n\n\"I was shocked. I was devastated by that news,\" he said. \"I was in a very emotional state.\"\n\nCollins could face up to 10 years in prison but as part of his plea deal, he agreed not to appeal any sentence up to four years and nine months. He's scheduled to be sentenced by Judge Vernon Broderick on Jan. 17.\n\nCollins was accused of calling his son from a White House picnic to tip him off to a failed drug trial — allowing the son and his fiancée’s father to unload stock and avoid hundreds of thousands of dollars in losses.\n\nHe said Tuesday he recognized the information would not be public for days.\n\n\"I regret my actions beyond anything I could explain here today,\" he said.\n\nGeoffrey Berman, the U.S. attorney for the Southern District of New York, told reporters outside the court, “Collins admitted to, among other things, illegally tipping his son while standing on the White House lawn. By virtue of his position, Collins helped write the laws of this country and acted as if the law didn’t apply to him.”\n\n“No one is above the law,\" he added.\n\nCollins left the courthouse in an SUV without answering questions from the media.\n\nCollins — the first member of Congress to back Donald Trump for president — submitted his resignation Monday ahead of his court date. He had previously insisted he was innocent of the charges.\n\nDespite the scandal, Collins was able to win reelection just months after being indicted. His resignation has already set off a scramble for his seat, representing the most Republican-leaning district in New York state.\n\nThe former congressman's son, Cameron Collins, and Stephen Zarsky, the father of Cameron's fiancée, are expected to enter their own guilty pleas Thursday.\n\n", "description": "", "authors": [], "top_image": "https://static.politico.com/5d/9c/924b0e65484a9e1d5910bcaab05f/191001-collins-getty-773.jpg", "published_at": "2019-10-01"}