{"pub": "cbs", "url": "https://cbsnews.com/news/the-law-doesnt-protect-your-most-private-financial-secrets-says-cambridge-analytica-whistleblower", "downloaded_at": "2019-10-24 02:31:53.170876+00:00", "title": "\"The law doesn't protect you\" or your financial secrets, says Cambridge Analytica whistleblower", "language": "en", "text": "Brittany Kaiser wants you to buy her memoir. But she also wants you to know what will happen when you do.\n\n\"I hate to break it to you, but by buying this book (perhaps even by reading it, if you have downloaded the e-­book or Audible version), you have produced significant data sets about yourself that have already been bought and sold around the world in order for advertisers to control your digital life,\" Kaiser, the whistleblower and former business development director for infamous political consulting firm Cambridge Analytica, writes in \"Targeted,\" which was released Tuesday.\n\n\"You don't have to consent to this data being collected on you,\" Kaiser told CBS News in an interview. \"Just by being in the United States you have pre-opted in. The law doesn't protect you. So these companies can continue collecting data on you, (it can) continue to be sold and used for any purposes without your knowledge.\"\n\nShe described the paths through which an individuals' private financial information can wind its way from credit rating agencies to data dealers, and ultimately to marketers and political consulting firms that can use that information to finely tailor and target that individual with advertising or misinformation.\n\nBrittany Kaiser CBS News\n\n\"When you go out to make a purchase, every credit card swipe, every purchase you are making, is then recorded by your credit card company and also the store you have gone to. Those financial institutions and companies are selling that on to wider data aggregator companies. So that's everyone from Experian, Infogroup to even political data companies,\" Kaiser said.\n\n\"Once those data sets are collated, then they continue to collect data on you from as many sources as they can gather from, keeping it in a massive data file, which is then purchasable or licensable for anyone who wants it.\"\n\nKaiser first came forward with information about Cambridge Analytica's business practices in April 2018, a month after another whistleblower, Christopher Wylie, went public to expose the extent of the company's data harvesting from Facebook and other sources.\n\nCambridge Analytica whistleblower Christopher Wylie: \"You are the target\" of companies like Facebook\n\nIn November 2018, Britain's Information Commissioner wrote in a report on political data analytics that her office is investigating the privacy implications of services offered to political parties by credit agencies such as Experian. The report was initially expected to be released later that year, but was delayed \"due to the complex nature of the work and the need to be consistent in our approach,\" a spokesperson told CBS News in January. It is unclear when the report will be released.\n\nExperian said in a statement to CBS News that it never licensed data to Cambridge Analytica. It did not immediately respond to a follow-up question about whether it ever did business with Cambridge Analytica's British parent company, SCL.\n\nFinancial data is typically sold in anonymous chunks, but it's no secret that marketing companies and data aggregators can match that information to real people, according to Gennie Gebhart, associate director of research at the nonprofit advocacy group Electronic Frontier Foundation.\n\n\"There's just about no such thing as 'anonymous' or effectively 'aggregated' datasets. Deanonymizing and reverse-engineering identities is terrifyingly easy, especially at scale,\" wrote Gebhart in an email to CBS News. \"The most surprising deanonymization and exposure often happens when a company has access to multiple sources of data—say, financial information from credit agencies, along with purchasing information from data brokers, along with public records about home ownership and voter registration. The more data sources available to them, the more connections they might be able to make that get around even the best anonymization measures.\"\n\nKaiser said deanonymizing allows companies to produce misinformation finely tuned to each individual.\n\n\"I hate to say it, manipulate you. You can say it's a persuasion campaign, but when you are showing people information, specifically meant to manipulate your decision-making, sometimes it's more manipulating than they like to put on their brochures,\" Kaiser said.\n\nDonald Trump's 2016 general election campaign acknowledged employing Cambridge Analytica, as did Senator Ted Cruz's primary campaign operation. But Kaiser reveals in her book that Cambridge Analytica also consulted for Trump during his primary run, meaning it played a role in the two most successful campaigns in an unusually crowded primary of more than a dozen major candidates.\n\nCambridge Analytica used a method called psychographic modeling to compose complex psychological profiles of hundreds of millions of Americans, and for years experimented with different approaches to manipulate people's beliefs, typically using targeted Facebook ads and posts.\n\n\"Unfortunately, what they found was that the most effective personality messaging is based on fear,\" Kaiser said.\n\nGebhart questioned the effectiveness of psychographic profiling, but said it still represents a violation of privacy.\n\n\"Like a lot of targeted advertising technology, it's not clear that psychographic profiling is as accurate or effective as it's often claimed to be. But the sum of all these methods still means that people are targeted based on attributes or characteristics that they never shared themselves, and that's absolutely a tool for trying to manipulate their opinions and decisions,\" wrote Gebhart.\n\nThe solution for those who want protection from targeted advertising, both Gebhart and Kaiser say, is legislation. Kaiser points to the data protection law enacted in the European Union in 2018.\n\n\"In Europe, for instance, you are default opted-out, so you have to opt-in to give your data. Which is why the data given in Europe is much smaller than it is in America,\" Kaiser said. \"So we say the U.S. is the wild west because the amount of data available on everyone is large and is exponentially increasing every day.\"", "description": "Brittany Kaiser describes in a CBS News interview how personal data is routed through financial institutions to companies seeking to \"manipulate you\"", "authors": ["Graham Kates", "Graham Kates Is An Investigative Reporter Covering Criminal Justice", "Privacy Issues", "Information Security For Cbsnews.Com."], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/10/23/e564077c-c141-4b44-a45a-67410031af3b/thumbnail/1200x630/bccd14e24af12cdd37c2195fc4bc8bac/kaiser.jpg", "published_at": "2019-10-23"}