{"pub": "euronews", "url": "https://euronews.com/2019/10/15/christopher-columbus-statue-vandalised-with-red-paint-in-san-francisco", "downloaded_at": "2019-10-15 23:05:37.070054+00:00", "title": "Christopher Columbus statue vandalised with red paint in San Francisco", "language": "en", "text": "Several Christopher Columbus statues were vandalised with red paint and messages against the 15th-century Italian navigator on Monday when the US holiday named after one of the first Europeans to reach the Americas was being celebrated.\n\nIn San Francisco, a Columbus statue at the foot of Coit Tower, in the city's North Beach neighbourhood, was vandalised sometime Saturday night or Sunday morning.\n\nSomeone poured red paint over it and drew anarchy symbols and messages on the concrete base that read \"Destroy all monuments of genocide\" and \"Kill all colonisers.\"\n\nCity workers cleaned the statue Sunday as thousands celebrated Italian culture in North Beach, San Francisco's \"Little Italy.\"\n\nThe New World explorer has become a polarising figure.\n\nNative American advocates have pressed states to change Columbus Day to Indigenous Peoples Day over concerns that Columbus spurred centuries of genocide against indigenous populations in the Americas.\n\nA handful of states celebrated their first Indigenous Peoples Day on Monday as part of a trend to move away from a day honouring Christopher Columbus.\n\nNew Mexico, Vermont and Maine are among the latest to pass measures doing away with Columbus Day celebrations in deference to Native Americans. The federal Columbus Day holiday remains in place.\n\nIn all, around 10 states observe some version of Indigenous Peoples Day in October, along with more than 100 US cities. A celebration was also held in Seattle on Monday.\n\nSince 1992, Native American advocates have pressed states to change Columbus Day to Indigenous Peoples Day over concerns that Columbus helped launched centuries of genocide against indigenous populations in the Americas.\n\nThe change to Indigenous Peoples Day prompted some backlash in conservative circles and among Italian Americans.", "description": "Several Christopher Columbus statues were vandalised with red paint and messages against the 15th-century Italian navigator on Monday when the US holiday named after one of the first Europeans to reach the Americas was being celebrated.", "authors": [], "top_image": "https://static.euronews.com/articles/stories/04/23/44/04/1000x563_cmsv2_2cf4eefd-df4d-5f28-9130-e24c13095d98-4234404.jpg", "published_at": "2019-10-15"}