{"pub": "yahoo", "url": "https://news.yahoo.com/gusty-winds-fuel-wildfire-concerns-095413248.html", "downloaded_at": "2019-09-07 13:45:36.168313+00:00", "title": "Gusty winds to fuel wildfire concerns in California into early next week", "language": "en", "text": "As the number of wildfires burning across California continues to grow, bouts of strong winds will further increase the fire danger into early next week.\n\nSundowner winds, or gusty, northerly winds that develop when an area of high pressure sits just offshore of California, will batter parts of Southern California, the San Joaquin Valley and the Grapevine through Monday night.\n\nSustained winds of 20-30 mph, with gusts up to 50 mph, will be common in these areas, especially during the evening and overnight hours.\n\nSunshine and very dry conditions will accompany the Sundowner wind events, further drying out vegetation and enhancing the risk for wildfire growth, spread and development.\n\nThere are currently one dozen wildfires burning across California, according to Inciweb.\n\nThe Red Bank Fire, which was started by lightning on Thursday, has exploded to 7,340 acres in size as of late Friday evening and is only 7 percent contained, according to Cal Fire.\n\nThe fire, which is located about 30 miles southeast of Redding, has prompted mandatory evacuations for the Shasta-Trinity National Forest and areas between Tedoc Road and Vestal Road.\n\nThe Tenaja Fire, located just west of Temecula in the Elsinore Mountains, has charred 2,000 acres and was only 25 percent contained as of late Friday evening.\n\nAlthough the fire prompted evacuation orders on Thursday, residents were allowed to return to their homes on Friday as firefighters made significant strides in containment efforts, according to the Los Angeles Times.\n\nThe cause of the Tenaja Fire is still under investigation as of Saturday.\n\nUnfortunately, the weather will not cooperate this weekend for firefighters hoping to gain more ground on the ongoing blazes as low humidity accompanies gusty winds statewide.\n\nCampers and hikers should remain cognizant of evacuation orders and coverage of wildfires this weekend to avoid getting into a life-threatening situation.\n\nIn addition, campfires and cigarette butts should be thoroughly extinguished as even the slightest spark could erupt into a large blaze in a matter of hours.\n\nThe howling winds will also threaten to bring down trees and power lines and trigger power outages across southern parts of the state.\n\nMotorists should keep both hands on the wheel and pull off the road if winds become too strong for safe travel. Wind gusts of this magnitude can make it difficult to remain in your lane and keep control of a vehicle.\n\nBy the middle of next week, winds should decrease significantly as the area of high pressure moves directly overhead, making conditions more favorable for firefighting efforts.\n\nHowever, Mother Nature will provide no natural assistance to fire personnel as building heat and continued lack of any rainfall are in store for the second half of next week.", "description": "As the number of wildfires burning across California continues to grow, bouts of strong winds will further increase the fire danger into early next week.Sundowner winds, or gusty, northerly winds that develop when an area of high pressure sits just offshore of California, will batter parts of Southern", "authors": ["Kyle Elliott"], "top_image": "https://s.yimg.com/uu/api/res/1.2/IEgBDlF_nO3dqN1sM2vAVA--~B/aD0zNTg7dz02NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/accuweather_297/7ac8f33e2c6c1dfbe71a04f15031ffea", "published_at": "2019-09-07"}