{"pub": "yahoo", "url": "https://sg.sports.yahoo.com/angels-trout-brewers-yelich-win-mlb-aaron-awards-224716740--spt.html", "downloaded_at": "2019-10-24 04:51:54.117981+00:00", "title": "Angels' Trout, Brewers' Yelich win MLB Aaron awards", "language": "en", "text": "Christian Yelich of the Milwaukee Brewers and Mike Trout of the Los Angeles Angels were named Wednesday as winners of Major League Baseball's Hank Aaron Awards for outstanding offensive performances.\n\nYelich led the National League in batting average for the second year in a row by hitting .329, the first player to repeat as the NL batting champion since Larry Walker in 1998-99, and ranked fourth in the NL with 44 home runs.\n\nTrout led the American League by reaching base on 43.8 percent of his plate appearances and set a career high with 45 homers, scoring at least 100 runs for the seventh time in his nine-year career and driving in at least 100 runs for the third time.\n\nBoth players saw their season end in mid-September after Yelich fractured his right kneecap and Trout underwent right foot surgery.\n\nThe Angels went 72-90, 24 games out of a playoff spot in the AL, while the Brewers went 89-73 and grabbed the last wildcard playoff berth in the NL only to fall to the Washington Nationals in the wildcard game.\n\nIt was the second Aaron award for each player, Yelich having won last year and Trout in 2014. Retired New York Yankees star Alex Rodriguez won it a record four times while Barry Bonds captured the honor three times.\n\nFans and a Hall of Famers panel handpicked by Aaron selected the winners.", "description": "Christian Yelich of the Milwaukee Brewers and Mike Trout of the Los Angeles Angels were named Wednesday as winners of Major League Baseball's Hank Aaron Awards for outstanding offensive performances.  Yelich led the National League in batting average for the second year in a row by hitting .329,", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/w18Z8gAsfcSVCVW9Ltb6iw--~B/aD01MTE7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_sg/News/AFP/5675451af86afde4f98d1b2b82242903e7debecb.jpg", "published_at": "2019-10-23"}