{"pub": "metro", "url": "https://metro.co.uk/2019/10/13/comedian-trans-activist-daphne-dorman-dies-aged-44-apparent-suicide-10909025", "downloaded_at": "2019-10-13 08:43:07.479286+00:00", "title": "Comedian and trans activist Daphne Dorman dies aged 44 from apparent suicide", "language": "en", "text": "Daphne Dorman died after posting a goodbye letter\n\nComedian and trans activist Daphne Dorman has died aged 44 in an apparent suicide, after the actress posted a final message to Facebook saying goodbye to her loved ones.\n\nShe accompanied the post with a shot of herself with her name and the dates 30 April 1975-11 October 2019.\n\nAlong with that, was a message that read: ‘So long and thanks for all the fish.’\n\nForming a career in the entertainment industry, Dorman, a transgender comedian and activist, was mentioned in Dave Chappelle’s divisive Netflix comedy special, Sticks And Stones back in August.\n\n‘I’m sorry. I’ve thought about this a lot before this morning. How do you say “goodbye” and “I’m sorry” and “I love you” to all the beautiful souls you know? For the last time,’ she wrote in her last message, posted on Friday.\n\n‘There’s no good way. That’s what I got out of all that thought.’\n\nDaphne posted to Facebook (Picture: Daphne Dorman / Facebook)\n\n‘To those of you who are mad at me: please forgive me. To those of you who wonder if you failed me: you didn’t. To those of you feel like I failed you: I did and I’m sorry and I hope you’ll remember me in better times and better light.’\n\nAdvertisement\n\nAdvertisement\n\n‘I love you all. I’m sorry. Please help my daughter, Naia, understand that none of this is her fault. Please remind her that I loved her with every fiber of my being.’\n\nDaphne’s sister confirmed her sibling had died, releasing a tribute online.\n\nI'm sorry.I've thought about this a lot before this morning. How do you say \"goodbye\" and \"I'm sorry\" and \"I love you\"… Geplaatst door Daphne Dorman op Vrijdag 11 oktober 2019\n\nBecky Kugler said: ‘Sweet, sweet Daphne. I so wish we could all have helped you through your darkness.\n\n‘We’ll always love you, fly high sweet angel.’\n\nFollowing the news, the Office Of Transgender Initiatives in San Francisco also confirmed Dorman’s death on its Twitter account and offered counselling for anyone who needed help.\n\nDorman was mentioned in Dave Chappelle’s divisive August Netflix comedy special, Sticks And Stones amid backlash and claims it was ‘anti-trans’.\n\nSpeaking about the criticism in an epilogue, Chappelle recalled a story in a ‘secret’ ending to his special, about Dorman attending his shows and ‘laughing the hardest’ at his seemingly offensive jokes.\n\nShe then apparently thanked the comedian for ‘normalizing transgenders.’\n\nThe budding comedian was working on a career in showbiz before she died, however before the Philadelphia native was an accomplished software engineer, previously holding a senior position at software automation and analytics platform Vineti.\n\nNeed support? Contact the Samaritans For emotional support you can call the Samaritans 24-hour helpline on 116 123, email jo@samaritans.org, visit a Samaritans branch in person or go to the Samaritans website.", "description": "Comedian and trans activist Daphne Dorman dies aged 44 from apparent suicide.", "authors": ["Mel Evans"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89672879_1570954414.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-13"}