{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/ap/article-7594989/Jets-snap-3-game-losing-streak-beat-Oilers-shootout.html", "downloaded_at": "2019-10-21 02:24:42.104250+00:00", "title": "Jets snap 3-game losing streak, beat Oilers in shootout", "language": "en", "text": "WINNIPEG, Manitoba (AP) - Kyle Connor and Patrik Laine scored in the shootout and the Winnipeg Jets snapped a three-game losing skid with a 1-0 win over the Edmonton Oilers on Sunday night.\n\nConnor Hellebuyck made 28 saves and recorded his first shutout of the season.\n\nRyan Nugent-Hopkins and Connor McDavid were stopped in the shootout.\n\nThe overtime period was highlighted by tight goaltending.\n\nEdmonton goalie Mike Smith robbed Mark Scheifele in close and Hellebuyck followed that up by denying Connor McDavid on a breakaway.\n\nSmith made 23 saves for the Oilers, who had their two-game winning streak snapped.\n\nEdmonton Oilers' Mike Smith (41) makes a save against Winnipeg Jets' Kyle Connor (81) during second-period NHL hockey game action in Winnipeg, Manitoba, Sunday, Oct. 20, 2019. (Fred Greenslade/The Canadian Press via AP)\n\nWinnipeg (5-5-0) was playing its fourth game of a five-game homestand.\n\nThe Jets are undefeated in regulation in their last seven games against the Oilers. Their last loss was Dec. 1, 2016.\n\nJets defenseman Carl Dahlstrom appeared to score his first NHL goal at 8:23 of the third period, but the play was reviewed, and Scheifele was ruled offside. The goal was wiped away.\n\nEdmonton outshot Winnipeg 7-2 in the first period.\n\nThe Jets didn't get their first shot on goal until 8:06 and finished with another 11 attempts in the period, five that missed the net and six that were blocked.\n\nThe Oilers went on a power play with 1:56 left in the opening period and had one shot that Hellebuyck turned aside.\n\nWinnipeg went on its first power play seven minutes in the second period and got four shots on Smith.\n\nMcDavid was then called for slashing Blake Wheeler late in the second. Winnipeg managed three shots on goal.\n\nShots on goal after the middle frame were 15-12 in Edmonton's favor.\n\nWinnipeg had its third power play of the game 26 seconds into the third and Smith stopped Laine's low, one-timer blast and a shot from Dmitry Kulikov.\n\nLess than a minute after Dahlstrom's goal was disallowed, the Jets went on the power play again. Smith denied three shot attempts, including two quick ones from close in.\n\nNOTES: Oilers forward Leon Draisaitl had his point streak end at eight games. He had six goals and 10 assists in that span. ... Edmonton defenseman Kris Russell played his 800th NHL game.\n\nUP NEXT\n\nOilers: At Minnesota Wild on Tuesday.\n\nJets: Finish a five-game homestand against Los Angeles Kings on Tuesday.\n\n___\n\nMore AP NHL: https://apnews.com/NHL and https://twitter.com/AP_Sports\n\nWinnipeg Jets' goaltender Connor Hellebuyck (37) makes a save as Edmonton Oilers' Josh Archibald (15) holds his stick during the first period of an NHL hockey game in Winnipeg, Manitoba, Sunday, Oct. 20, 2019. (Fred Greenslade/The Canadian Press via AP)\n\nWinnipeg Jets' Jack Roslovic (28) is checked by Edmonton Oilers' Matt Benning (83) during second-period NHL hockey game action in Winnipeg, Manitoba, Sunday, Oct. 20, 2019. (Fred Greenslade/The Canadian Press via AP)\n\nEdmonton Oilers' Darnell Nurse (25) scoops up the puck as Winnipeg Jets' Blake Wheeler (26) is checked by Leon Draisaitl (29) during second-period NHL hockey game action in Winnipeg, Manitoba, Sunday, Oct. 20, 2019. (Fred Greenslade/The Canadian Press via AP)\n\nWinnipeg Jets' Mark Scheifele (55) jumps as the puck is shot toward Edmonton Oilers' Mike Smith (41) during second-period NHL hockey game action in Winnipeg, Manitoba, Sunday, Oct. 20, 2019. (Fred Greenslade/The Canadian Press via AP)", "description": "WINNIPEG, Manitoba (AP) - Kyle Connor and Patrik Laine scored in the shootout and the Winnipeg Jets snapped a three-game losing skid with a 1-0 win over the...", "authors": ["Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/03/wire-19973804-1571624083-738_636x382.jpg", "published_at": "2019-10-21"}