{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/09/the-dishes-you-should-avoid-at-chain-restaurants-according-to-the-people-who-work-there", "downloaded_at": "2019-09-16 09:17:28.953090+00:00", "title": "The Dishes You Should Avoid At Fast Food Restaurants, According To The People Who Work There", "language": "en", "text": "Image: Getty Images\n\nNo one goes to chain restaurants expecting a five-star dining experience, but if you're a tourist travelling into America, you might not know this key fact. Thankfully, you have this Reddit thread to guide you in what items to avoid according to actual fast-food employees.\n\nIf you're gun-shy about food-related illness, there are certain dishes, times of day, and other warning signs to be wary of if you want to minimise your chances of leaving the Outback Steakhouse with more than you bargained for:\n\nBeware of beverages\n\nThe true horror is most likely lurking in your drinking glass, not your chicken entree. One redditor with the ever-relatable handle PM_ME_UR_BUTT_GUYS posted:\n\n\"[Soft drink] is the big one. Not only is it incredibly unhealthy (duh), every single place I worked had mould in their... machine. I cleaned them, of course, but there's only one of me and a few million restaurants.\"\n\nSays Icymountain:\n\n\"Worked at Max Brenner. Some cold drinks come with a metal straw that is impossible to clean inside of, so there's loads of old chocolate and other drink gunk stuck inside. Either avoid those or request for a plastic straw.\"\n\nFast food shouldn't be too fast\n\nThe second most likely hazard? It's a tie between the possibility of kitchen staff sneaking some of your fries — not necessarily a health risk, but annoying nonetheless — or being served old food. Redditor physlizze says:\n\n\"Buffalo wild wings. If your wings don't take at least 10 min to come to your table, you're getting old crusty wings. We were supposed to cook a minimum amount each time, and they could only sit so long, and then we got our asses chewed for high waste. So we stopped wasting old wings and served nasty crusty wings. This is especially bad between 12:45 and 4:30. Once it hits dinner rush it usually isn't a problem. But happy hour was always a problem.\"\n\nConsider asking for your food to be made fresh at McDonald's if you're concerned that it's been sitting out for too long. And vegetarians should be cautious about shared cooking surfaces, stealth ingredients or frying oils; Buffalo Wild Wings reportedly fries everything in beef fat and KFC gravy may contain chicken.\n\nCross your fingers/heart\n\nLooking for the most reliable semi-unwanted-bacteria-free zone? Jimmy John's and Arby's both received fairly high cleanliness reviews from their staffers.\n\nMost of this, however, is reliant on store employees actually following all the corporate procedures, so keep in mind that it may vary significantly by location (and if a franchise seems like it's run badly and totally unclean, it probably is). And we're assuming that you're only concerned about sanitary procedures here and not your caloric intake (which you've probably already decided at this point).\n\nAs Redditor covfefelajefe says:", "description": "No one goes to chain restaurants expecting a five-star dining experience, but if you're a tourist travelling into America, you might not know this key fact. Thankfully, you have this Reddit thread to guide you in what items to avoid according to actual fast-food employees....", "authors": ["Aimée Lutkin", "Anthony Caruana"], "top_image": "https://edge.alluremedia.com.au/m/l/2014/01/Burger.jpg", "published_at": "2019-09-16"}