{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nfl/eagles/2019/10/14/philadelphia-eagles-dallas-cowboys-doug-pederson/3978420002", "downloaded_at": "2019-10-14 23:29:22.039195+00:00", "title": "Eagles coach Doug Pederson: 'We're gonna win' game vs. Cowboys", "language": "en", "text": "CLOSE SportsPulse: Week 6 had some stunning results but none bigger than the Cowboys loss to the winless New York Jets. As Trysta Krick details, they do have one saving grace. USA TODAY\n\nPHILADELPHIA – It's not like the Eagles-Cowboys rivalry needs any more intensity.\n\nAfter all, the stakes are usually high when the two teams meet, as they will this Sunday night in Dallas with first place in the NFC East on the line.\n\nThat's why Eagles coach Doug Pederson said Monday afternoon that he didn't guarantee a win over the Dallas Cowboys on his radio show a few hours earlier.\n\nBut it sure sounded like it, when Pederson, speaking on 94.1 WIP, said, \"We're going down to Dallas, and our guys are gonna be ready to play. And we're gonna win that football game, and when we do, we're in first place in the NFC East.\"\n\nAsked later if he guaranteed a win, Pederson replied, \"I never said that. I never said, 'Guarantee a win.' I would never do that.\"\n\nDid he regret giving that impression?\n\n\"No, because it shows confidence in our football team,\" Pederson replied. \"I promise you (Cowboys coach) Jason Garrett is going to say the same thing to his football team, that they're going to win the football game as well.\n\n\"I'm not going to stand up here and go on record and say, 'We're going to try to win a game' ... It just doesn't show confidence, and I want to show confidence in our players.\"\n\nJASON GARRETT RESPONDS: 'We are excited about the challenge'\n\nBoth teams can certainly use some confidence.\n\nThe Eagles are coming off a 38-20 loss to the Vikings on Sunday in which their secondary was torched for four touchdown passes, including long ones of 62 and 51 yards to wide receiver Stefon Diggs.\n\nThe Cowboys are also 3-3 after losing their third straight game, this time to the previously winless New York Jets.\n\nPederson said he wanted to make sure fans realize that his team and the Cowboys are tied for first place in the NFC East. A win in Dallas would certainly give the Eagles a big advantage in the division nearing the midway point of the season.\n\n\"I also said people on the outside of this building are thinking the sky is falling and everything is crumbling,\" Pederson said. \"You put the tape on this morning and you watch it, and we're just missing on a couple little detail things.\n\n\"There's enough good and positive that came out of this game to get better, and that's what we're going to do.\"\n\nThen he added: \"Dallas is a great football team. They're reeling like we are. They're going to come out and play hard. They always have. They beat us twice last year. We've got a lot of things stacked against us going down there.\n\n\"As the head football coach, I'm going to show confidence in my football team because that's what I have.\"\n\nEagles getting healthier?\n\nPederson said that cornerback Jalen Mills (foot), who's on the physically unable to perform list, is expected to practice this week, and might have a chance to play some against the Cowboys. Mills would have to come off the PUP list before that can happen.\n\nPederson also said that Ronald Darby, who missed the last three games with a hamstring injury, is expected to \"ramp his workload up a little bit, and we'll see where he's at.\"\n\nPederson said both might practice Wednesday.\n\nHe added that wide receiver DeSean Jackson (abdomen) is still day to day. Pederson said Jackson won't practice Wednesday, but will continue running on the side. Jackson has missed the last four games.\n\nAs for the two players injured during the game in left tackle Jason Peters (knee) and linebacker Nigel Bradham (ankle), Pederson said the team is waiting on second opinions for both, which doesn't sound promising.\n\nStill, Pederson said for now, both are considered \"day to day.\" If Peters can't play, rookie Andre Dillard would replace him. Dillard played the entire second half in place of Peters to mixed results.\n\nContact Martin Frank at mfrank@delawareonline.com. Follow on Twitter @Mfranknfl.\n\nIf you love talking football, we have the perfect spot for you. Join our Facebook Group, The Ruling Off the Field, to engage in friendly debate and conversation with fellow football fans and our NFL insiders.", "description": "Doug Pederson denies saying he made a guarantee, but the Eagles coach still made a definitive statement about the matchup with the Cowboys.", "authors": ["Martin Frank", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/14/PWIL/457d2391-c83d-46b4-9698-14cae1b5672e-USATSI_13511305.jpg?crop=4715,2652,x0,y76&width=3200&height=1680&fit=bounds", "published_at": "2019-10-14"}