{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/man-hammer-removes-sceptre-kensington-20665926", "downloaded_at": "2019-10-21 14:57:17.973118+00:00", "title": "Kensington Palace Queen Victoria statue sceptre taken by man with hammer", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Royal Family stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA man carrying a hammer was filmed removing a sceptre from the Queen Victoria statue outside Kensington Palace.\n\nThe man was seen clambering over the 126-year-old statue and forcing the sceptre from her hand.\n\nAfter it breaks free, the man then jumps from the marble statue and into the waist-deep water.\n\nAs he wades through the water onlookers strolling through the London park watch on.\n\nAfter casually walking away, he is seen waving the sceptre - a staff or wand held in the hand by a ruling monarch representing their authority or sovereignty.\n\n(Image: Newsflare)\n\n(Image: Newsflare)\n\nThe statue was designed by Princess Louise, the Duchess of Argyll, in 1893, this marble statue shows her mother, Queen Victoria, in her coronation robes in 1837 at the age of 18.\n\nQueen Victoria was born at Kensington Palace and grew up there.\n\nVictoria learned that she was to become Queen when she was 18 years old while still living at Kensington Palace.\n\nShe held her first council meeting in the palace’s Red Saloon just a few hours later.\n\nVictoria's early childhood at Kensington Palace was said to be loving, creative and stimulating. Known for her outgoing nature and playful imagination, she was indulged by those around her.\n\n(Image: Newsflare)\n\n(Image: Newsflare)\n\nHowever, as her position as future monarch became certain, Victoria’s idyllic childhood gave way to the 'Kensington System' — a strict programme designed to control her life, relationships and public image.\n\nA statement from the Metropolitan Police read: \"Police were called at approximately 2.20pm on Saturday, 19 October to reports of a man causing criminal damage to the Queen Victoria statue in Kensington Palace Gardens.\n\n\"Officers attended and arrested a 26-year-old man nearby on suspicion of criminal damage.\n\n\"The man has been taken to hospital for a mental health assessment.\"\n\nA spokesperson for Historic Royal Palaces said: \"We can confirm that an incident took place in Kensington Palace Gardens on Saturday, during the course of which a sceptre was removed from the statue of Queen Victoria outside the Palace. The police attended the incident.\n\n\"Our conservation experts have examined the statue. It is not damaged and the sceptre will be re-installed shortly.\"", "description": "The man was seeing clambering over the 126-year-old statue and forcing the sceptre from her hand before casually walking away as shocked passersby watch on", "authors": ["Abigail O'Leary", "Image", "Newsflare"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20665931.ece/ALTERNATES/s1200/0_American-tourist-with-hammer-removes-priceless-sceptre-from-Queen-Victoria-statue-outside-Kensing.jpg", "published_at": "2019-10-21"}