{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/04/hong-kong-lam-to-withdraw-extradition-bill-say-reports", "downloaded_at": "2019-09-04 08:06:52.350623+00:00", "title": "Hong Kong: Lam to withdraw extradition bill, say reports", "language": "en", "published_at": "2019-09-04", "text": "The Hong Kong leader, Carrie Lam, is expected to formally withdraw an extradition bill on Wednesday that has sparked month of protests and plunged the territory into its biggest political crisis in decades, according to media reports.\n\nThe South China Morning Post reported that Lam was expected to meet pro-establishment lawmakers at 4pm local time before a possible announcement that the bill will be withdrawn. Chinese-backed news outlet HK01 said Lam was going to meet with lawmakers and they expected the bill to be withdrawn.\n\nReuters later said that it had confirmed the reports with a government source.\n\nLam shelved the bill in June and in July again insisted that it was “dead” after weeks of protest but refused to withdraw it entirely, a key demand of protesters.\n\nQuick guide What are the Hong Kong protests about? Show Hide Why are people protesting? The protests were triggered by a controversial bill that would have allowed extraditions to mainland China, where the Communist party controls the courts, but have since evolved into a broader pro-democracy movement. Public anger – fuelled by the aggressive tactics used by the police against demonstrators – has collided with years of frustration over worsening inequality and the cost of living in one of the world's most expensive, densely populated cities. The protest movement was given fresh impetus on 21 July when gangs of men attacked protesters and commuters at a mass transit station – while authorities seemingly did little to intervene. Underlying the movement is a push for full democracy in the city, whose leader is chosen by a committee dominated by a pro-Beijing establishment rather than by direct elections.\n\nProtesters have vowed to keep their movement going until their core demands are met, such as the resignation of the city’s leader, Carrie Lam, an independent inquiry into police tactics, an amnesty for those arrested and a permanent withdrawal of the bill. Why were people so angry about the extradition bill? Beijing’s influence over Hong Kong has grown in recent years, as activists have been jailed and pro-democracy lawmakers disqualified from running or holding office. Independent booksellers have disappeared from the city, before reappearing in mainland China facing charges. Under the terms of the agreement by which the former British colony was returned to Chinese control in 1997, the semi-autonomous region was meant to maintain a “high degree of autonomy” through an independent judiciary, a free press and an open market economy, a framework known as “one country, two systems”. The extradition bill was seen as an attempt to undermine this and to give Beijing the ability to try pro-democracy activists under the judicial system of the mainland. How have the authorities responded? Lam has shown no sign of backing down beyond agreeing to suspend the extradition bill, while Beijing has issued increasingly shrill condemnations but has left it to the city's semi-autonomous government to deal with the situation. Meanwhile police have violently clashed directly with protesters, repeatedly firing teargas and rubber bullets. Beijing has ramped up its accusations that foreign countries are “fanning the fire” of unrest in the city. China’s top diplomat Yang Jiechi has ordered the US to “immediately stop interfering in Hong Kong affairs in any form”. Lily Kuo and Verna Yu in Hong Kong\n\nThe bill would allow the extradition of suspects to mainland China’s opaque legal system. The protests it sparked have since turned into a broader democracy movement that has challenged Beijing’s authority over the semi-autonomous Chinese territory.\n\nIn recent weeks, protest have escalated and become increasingly violent on both sides with protesters making use of petrol bombs while Hong Kong police have begun to deploy a water cannon in addition to rubber bullets and tear gas.\n\nEarlier this week, Reuters published a recording of Lam speaking to a group of business executives where she said would step down if she were able to – suggesting that Beijing has forced her to remain in office.\n\nHong Kong on brink of recession as protests and trade war take toll Read more\n\nOn Tuesday, however, Lam told reporters that she wanted to remain in office to see Hong Kong through such a difficult period.\n\nSince early June, Hong Kong has been embroiled in its worst political crisis in decades. The waves of protests have entered their 13th week.\n\nThis is a developing news story, please check back for updates.", "description": "Embattled chief executive will reportedly make announcement on Wednesday after meeting allies", "authors": ["Guardian Staff"], "top_image": "https://i.guim.co.uk/img/media/612f9374931bc1523eaac28c29fc19959e8df4f0/145_243_4637_2782/master/4637.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=50e6cf75baeac65b32ebf88cf841cd48"}