{"pub": "news24", "url": "https://city-press.news24.com/Voices/how-mam-winnie-changed-my-life-20191018", "downloaded_at": "2019-10-18 01:16:44.648594+00:00", "title": "How Mam’ Winnie changed my life", "language": "en", "text": "Voices How Mam’ Winnie changed my life\n\nNolitha Fakude has climbed the corporate ladder and, in this edited extract from her memoir, she talks about her life transformed when she met Winnie Madikizela-Mandela.\n\nWhen magic showed its face\n\n\n\nOn April 27 1994, the country held its first democratic elections and the effect in Cape Town was profound – suddenly, there was an ANC Parliament and, with it, a whole new group of black decision-makers and politicians coming to debate and create our new democracy.\n\nFor my own part, after voting in that historic election, I made a promise seriously to contribute to our society’s reconstruction and development.\n\nI was filled with a renewed sense of purpose and a deep commitment to being part of the process to build the new South Africa.\n\nI never guessed that my pledge would be called upon as soon as it was.\n\nAbout two weeks after the election, we received a call from a family friend, Pops Mageza, with an “urgent request”.\n\nPresto and Phila had relocated from Alice to Cape Town about a year after my arrival.\n\nAfter the first couple of years of staying in one of the company flats, in 1993 we bought our own house in Thornton, a suburb in Goodwood.\n\nI thought Pops wanted to speak to Presto, but he said he was actually calling me, and kept referring to “UMama”.\n\nFor a few minutes, I was confused. Not only was Pops not his usual jovial self, but he was whispering with a sense of urgency.\n\nPops went on to explain that he was in a meeting in Mama’s house with Peter Mokaba, who was the ANC Youth League president at the time, and some others, and was acting on behalf of one of them.\n\nIt turned out that the urgent request was for us to “host” Mama Winnie Mandela when she came to Cape Town for the first democratic opening of Parliament and swearing in of the MPs.\n\nVarious controversies at the time meant that she was hounded by the media, and the people who asked us to host Mama Winnie wanted her location to remain private.\n\nI was in a state of shock and honoured excitement, not least because Mama Winnie was scheduled to arrive the following day at noon.\n\nAll I could think was that my house was in no state to host someone of her stature.\n\nBoardroom Dancing by Nolitha Fakude Pan Macmillan 248 pages R290\n\n“Not to worry, Litha, Mama is a very humble person,” Pops assured me.\n\n“I’ve been to your house several times and trust your hospitality skills. I know she will be very happy with this arrangement.”\n\nI put down the phone and immediately started cleaning my house – when I left for the airport the next day to fetch Mama Winnie, Presto was still tidying!\n\nCape Town International Airport was jam-packed with the new ANC MPs and their entourages arriving from all over the country.\n\nEmotionally overwhelmed by the sight of those faces, I burst into tears.\n\nOnly two days earlier, the Independent Electoral Commission had announced the ANC’s overwhelming majority victory.\n\nNow here I was in the middle of what looked like an ANC Women’s League (ANCWL) victory party.\n\nAnd there stood Mama Winnie: tall, beautiful and smiling, talking to her ANCWL colleagues, Sis Thandi Modise next to her, and Mama Albertina Sisulu walking towards her, holding Mama Gertrude Shope’s hand.\n\nIt was a magical moment and it changed my life forever.\n\nIn that period, different people experienced different “magical” moments, and for many it was voting.\n\nFor me, that day at the airport was the first and most immediately tangible evidence I had that we were living in a new era, that political change had been achieved, and that I would be included in the new South Africa.\n\nWhat I had voted for a few weeks earlier suddenly became real.\n\nOne of Mama’s bodyguards drove my car as we left the airport, turning me into part of the entourage as we headed straight to Parliament.\n\nI spent the rest of the day running up and down, trying to help register everyone for the swearing in the following day.\n\nFor most, if not all, of the ANC MPs, it was the first time since the election results that they were meeting in one place.\n\nI can only imagine that for many it was the moment of truth and relief; that what they and millions of others had been fighting for all these years had finally happened.\n\nFreedom in our lifetime.\n\nThe next day, the MPs were sworn in, nominating and then electing Nelson Mandela as the first president of the new Republic of South Africa.\n\n...\n\nTo my delight and honour, Mama Winnie’s “few nights” visit stretched into a 135-day stay at our home.\n\nVery much “settled and at home”, Mama refused to move to either the hotel or government house that had been made available to her, first as an MP, and later as deputy minister of science, arts and culture.\n\n“Nkosazana, you can move to those big and cold houses built by the apartheid government. As for me, I’m perfectly happy here in the warmth of my newfound family,” she replied when I asked when she might want to move.\n\nAt the same time, the media was printing stories about Mama Winnie “living large in a five-star Cape Town hotel at taxpayers’ expenses”.\n\nTalk about fake news!\n\nI suspect that the special attraction of our house was my son Phila, who was about four years old at the time.\n\nI think he was a proxy for her many grandchildren, whom she missed terribly throughout her long stay in Cape Town.\n\nEvery evening, Mama spent at least an hour on the phone talking to them.\n\nOne by one, she asked them about school and their friends, mediating any issues they were having. Nothing was too small for her to discuss with those little ones.\n\nOur telephone was in the dining room, and we often ended up giggling while listening to a song from one child and then a school play rehearsal from another.\n\nI learnt so much from her about being fully present when engaging with children; just one of the many valuable lessons that Mama Winnie taught me.\n\nAs the deputy minister of arts, science and culture, Mam’ Winnie was often with her team late into the evenings planning for the next day.\n\nRegardless of the hour, she always knocked at our door to inform us of her whereabouts for the next day.\n\nI would answer, often in my nightgown, and we would inevitably end up in a long conversation about one of the many fascinating subjects within her portfolio.\n\nHer knowledge and diligence amazed me.\n\nI was working as Woolworths’ community affairs manager at the time, and those talks with Mama deepened my understanding of how to match corporate social responsibility strategy with real community needs to achieve meaningful and lasting impact.\n\nThis was done first and foremost by going into a community not to impose your preconceived ideas about what it required, but rather doing proper research and choosing projects that met real needs based on community consultation.\n\nMama’s background in social work also helped me refine my approach to community consultation when defining and articulating needs.\n\nBecause “community” is such a broad label – so many people make up any community, and those people may not see needs similarly – it was essential that we engage with as many different people in the community as possible to verify and confirm what was really the most pressing need according to a majority of interests.\n\n“Don’t you want to go and visit your projects in Gugulethu? You want to be sure that your company has not ended up wasting money on a white elephant,” she’d say to me on weekends when she was around.\n\nAt the time, there were so many projects sponsored or donated by companies – things like libraries were built simply because there had not been one before.\n\nBut I also knew better than to fall for Mama’s attempts to make an unannounced trip to the township free of her entourage.\n\nWe were under strict instructions from her staff and Mokaba not to let her go anywhere without her bodyguards.\n\nAlthough Mama was seen by the majority of people as our Mother of the Nation, many white Capetonians saw her as “that woman” who challenged and scared people with her uncompromising statements and actions.", "description": "Nolitha Fakude has climbed the corporate ladder and, in this edited extract from her memoir, she talks about her life transformed when she met Winnie Madikizela-Mandela.", "authors": ["Nolitha Fakude"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9466/cf98c0bd3b21452c835c3f1c8ca49b52.jpg", "published_at": "2019-10-18"}