{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/13/soccer-star-says-amazon-didnt-remove-racist-review", "downloaded_at": "2019-09-14 01:49:13.318305+00:00", "title": "Amazon doesn't remove racist reviews of star Aluko's book", "language": "en", "text": "LONDON (AP) - Soccer star Eni Aluko has condemned Amazon for not removing racist reviews of her memoir posted on the online retailer’s web site.\n\nOf the 31 reviews on Amazon’s United Kingdom site, 27 gave “They Don’t Teach This” a one-star rating. The book details the discrimination Aluko faced during her England career.\n\nCustomers have used the platform to call the book “anti-white racist drivel” and “fiction” and accuse the Juventus forward of choosing to “play the race card” and “coming across as a racist herself.”\n\nAluko, who is black, and her publishers have asked Amazon to delete the racist reviews but they remained on the site on Friday night. Amazon told The Associated Press it does not suppress reviews based on star ratings but does use investigators and automated technology to prevent and detect inauthentic comments.\n\nAluko said the offensive reviews were “clearly motivated by tribalism, bitterness and hatred” and wrote in a column for The Guardian that “sometimes the law is the only solution.”\n\nPenguin Random House, the publishers of the book, told the AP that “we’re working with our author, Eni, on this issue and are in contact with Amazon.”\n\nThe players’ union in England and anti-racism activists have denounced Amazon, whose CEO is Jeff Bezos, the world’s richest man, for not removing the posts.\n\n“Amazon, just like social media platforms, have a responsibility to tackle any racist or discriminatory abuse on their website,” Kick It Out, English soccer’s anti-discrimination body, told the AP. “We’re angered by the racial abuse directed at Eni Aluko just for telling her story and we fully support her as one of the leading voices in football shining a light on key issues that the game must address.”\n\nThe use of online reviews to abuse players has opened up a new front to be tackled by the Professional Footballers Association, which met recently with Twitter, Facebook and Amazon after a spate of racist posts directed at its members.\n\n“We have been proud of Eni for standing up against injustice in the past and we applaud her for her brave stance in this instance,” PFA head of equalities Simone Pound said. “As a prominent female player and role model Eni is at the forefront of challenging abuse where and when it happens.\n\n“We are increasingly seeing our members being abused and harassed as they are fulfilling workplace commitments both on and off the field. As a member Eni will continue to have the full support of the PFA.”\n\nThe book went on sale on Aug. 29 on Amazon.\n\n“Some of what has been written about myself and my book is defamatory,” Aluko said. “It is intended to put people off buying my book, and I intend to make sure they understand the consequences of such hatred.”\n\nAluko capped 102 times for England and is a lawyer. She spent two years trying to convince the English Football Association to believe Mark Sampson as national team manager made offensive comments in 2014 about whether her relatives coming from Nigeria for a game were infected with Ebola.\n\nPressure from Aluko led to a new FA investigation after allegations of wrongdoing had been initially dismissed. The FA apologized to Aluko in 2017 after a review established she and a teammate had been racially discriminated against by Sampson but that the coach was not racist.\n\n“Accusing someone of racism isn’t something I would ever do lightly,” Aluko wrote in her book. “It certainly hasn’t been a pleasant experience. I’m willing to bet that no one ever cried racism for fun, or for power, and yet so many people of color don’t share their experiences because they would be shouted down, in the hideous phrase, for ‘using the race card.’”\n\nThe autobiography covers identity and race issues, footballing successes that have seen Aluko win league titles with Chelsea and Juventus, and her career as a lawyer.\n\n“I love being a black women, I wouldn’t change it,” Aluko wrote. “It has always been a cause for celebration and empowerment, never a crutch or an excuse.”\n\n___\n\nMore AP soccer: https://apnews.com/apf-Soccer and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Soccer star Eni Aluko has condemned Amazon for not removing racist reviews of her memoir posted on the online retailer's web site.", "authors": ["The Washington Times Http", "Rob Harris"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/13/britain_soccer_amazon_racism_69247_c0-544-2876-2220_s1770x1032.jpg?b6cb2fadfdff7dafa39780cce4820f3e101071e6", "published_at": "2019-09-13"}