{"pub": "washingtonpost", "title": "Richard Booth, self-named king of Welsh ‘bibliopolis,’ dies at 80", "url": "https://washingtonpost.com/local/obituaries/richard-booth-self-named-king-of-welsh-bibliopolis-dies-at-80/2019/08/30/f8ce1c54-c9d6-11e9-be05-f76ac4ec618c_story.html", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:02:04.908620+00:00", "text": "“Hay-on-Wye?” the American playwright Arthur Miller was said to have remarked upon receiving an invitation to the Welsh hamlet, where his presence was desired at a literary festival. “Is that some kind of a sandwich?”\n\nIndeed it was not, although even Hay’s townspeople might have forgiven him his ignorance. The village, situated on the River Wye just across the English border, might have crumbled along with its Norman castle had it not been for the efforts of its best-known citizen and self-anointed king — Richard Booth, who commanded the attention and affection of bibliophiles, tourists and fellow eccentrics on both sides of the Atlantic by turning Hay into a world capital of used books.\n\nMr. Booth, who has died at 80, opened the first of his bookstores in the early 1960s, fresh out of Oxford, in part to reinvigorate his struggling town. Emboldened with an inherited family fortune, he turned Hay’s castle, firehouse and movie theater into secondhand bookstores. His venture quickly grew into an if-you-build-it-they-will-come phenomenon — “they” being his book-loving customers, as well as other booksellers who set up shop along Hay’s cobblestone streets.\n\nIn time, the town boasted three dozen bookstores, and Mr. Booth obtained the Guinness World Record for world’s largest secondhand bookseller, with 9.9 miles of shelves containing around 1 million volumes. In his view, less was not more; more was more, and he spent the better part of his life buying up more and more books from shuttering libraries, dead book collectors with heirs uninterested in their treasures, and overburdened distributors looking to offload their lots.\n\nA great portion of his books came from the United States. “The only reason for the existence of Detroit,” Mr. Booth once told the Boston Globe, “is to help Hay, with all those car books.” In an unsubtle irony, American tourists then bought and took those books home as souvenirs of their wanderings through Wales.\n\nHis practice of buying books “by the lorryload,” as an obituary in the London Daily Telegraph described it, and at times selling them by the load for wallpaper or kindling, did not endear him to the class of book connoisseurs that dons white gloves to peruse the delicate pages of rare specimens.\n\nBut to those content to lose themselves in the warrens of his stores, and to rifle through old atlases or books on cricket, or to stumble on curiosities such as “HM Ploughing Regulations for Bengal for 1948” or “Fodor’s 1975 Guide to Hungary,” any one of his establishments was a paradise. Day-trippers from London — by car Hay is about 3½ hours away — took home books, the obituarist for the Telegraph mused, as they might have purchased clotted cream in Devon.\n\nBy some measures, Mr. Booth was a great success: In 2001, the Globe reported that Hay received 500,000 visitors a year. Its fame had grown considerably with the establishment in 1988 of the Hay Festival of literature and arts that grew to attract writers as prominent as Maya Angelou, Margaret Atwood, Don DeLillo, Stephen Hawking, Doris Lessing, Penelope Lively, Toni Morrison, Zadie Smith, Muriel Spark and John Updike.\n\nOther numbers, including those in some of Mr. Booth’s ledgers, were less satisfying. By his count, he “inherited one fortune, made two and lost four,” according to the Guardian’s obituary for him. The Washington Post once cited a report that he motored around in a Rolls-Royce “so bruised that the firm became embarrassed and tried to buy it from him.”\n\nHe did not much care for the literary festival that had helped land Hay-on-Wye in the travel pages of newspapers around the world. President Bill Clinton, a featured speaker, once declared the festival “the Woodstock of the mind.” Mr. Booth, for his part, told the Weekend Australian that it amounted to a distraction for “arts, farts and tarts.”\n\nHe resented any intrusion from the government, even in the form of sponsorship, outside of his own: In 1977, he had declared Hay’s independence and crowned himself king, complete with a crown and purple robe. He dubbed himself not Richard the Lionheart, but rather Richard the Bookheart, and by some accounts made a horse prime minister. The town issued currency; it was edible.\n\nMr. Booth, who had markedly less success in mainstream political elections, disapproved of any outside effort to change the humble character of his “bibliopolis,” as Hay has been called.\n\n“I call it the last bastion of manual labor,” he told the Herald of Glasgow, Scotland. “I go with five men and a container to cities like Glasgow, Manchester, and Birmingham and come back five days later with 30,000 books. It is all about being able to handle them. After all moving 10 tons of books is much the same as moving 10 tons of baked beans.”\n\nRichard George William Pitt Booth was born in Plymouth, England, on Sept. 12, 1938, according to news accounts. “My father liked to browse in secondhand book shops,” he once said. “I went with him.”\n\nHis mother was an heiress to a soap and toilet water fortune, and the family moved to Hay when Mr. Booth was young and they were bequeathed an estate there. After attending the University of Oxford, he bought Hay’s castle, he told the New York Times in 1976, “because I couldn’t live with my parents.”\n\nMr. Booth was reportedly married three times. A complete list of survivors was not immediately available.\n\nBy the time of his death, Mr. Booth had closed or sold his remaining bookstores. His detractors criticized what they regarded as his penchant for self-promotion — his memoir, “My Kingdom of Books,” featured him standing amid the Welsh hills clad in full regalia — but he had an undeniable appeal.\n\n“I don’t want to be presented as an enormous eccentric, which is easy to do,” he once told The Post. “An eccentric, after all, doesn’t see himself as an eccentric.”\n\nPat Thornton, an employee of Richard Booth’s Bookshop for 45 years, confirmed by email that Mr. Booth died Aug. 20 at his home in Cusop, near Hay. The cause was not immediately available.\n\nOld books, on the other hand, “never die,” Booth once remarked. “No matter how unattractive they are to 99 percent of the people, there is always somebody somewhere who wants this book or that one.”", "description": "He declared himself the monarch of Hay-on-Wye, the hamlet he turned into a global capital of secondhand books.", "authors": ["Emily Langer", "Obituary Writer"], "top_image": "https://www.washingtonpost.com/resizer/NuZKHbX_82Cg6iwpXc1iRL9A3Vk=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/K4YW2UWJ3II6TFQVR4NDFFROAQ.jpg"}