{"pub": "yahoo", "url": "https://finance.yahoo.com/news/elizabeth-warren-rivals-start-turn-221004338.html", "downloaded_at": "2019-09-19 23:13:46.324657+00:00", "published_at": "2019-09-19", "title": "Elizabeth Warren’s Rivals Start to Turn on Her", "language": "en", "text": "Sen. Elizabeth Warren (D-MA) has mostly been coasting to her position atop the 2020 Democratic primary field, often dodging the scrums other candidates have engaged in on the trail and the debate stage.\n\nBut as she’s risen, her opponents have begun to notice. And this week, several of them have started to test out attack lines against her.\n\nOn Thursday, South Bend Mayor Pete Buttigieg accused Warren of dodging questions about potential tax increases that could come with instituting a Medicare for All healthcare system, which Warren supports.\n\n“You know, Senator Warren is known for being straightforward and was extremely evasive when asked that question, and we’ve seen that repeatedly,” Buttigieg told CNN in an interview. “I think that if you are proud of your plan and it’s the right plan, you should defend it in straightforward terms. And I think it’s puzzling that when everybody knows the answer to that question of whether her plan and Senator Sanders’ plan will raise middle class taxes is ‘Yes,’ why you wouldn’t just say so, and then explain why you think that’s the better way forward?”\n\nWarren, in recent debates, has rejected the premise of questions about whether middle class tax will be part of a Medicare for All health-care system, by stressing that overall costs would go down for individual consumers since they would no longer be paying high costs for coverage. Buttigieg’s campaign, which came out with a “Medicare for All Who Want It” proposal, said that his plan could be paid for with higher corporate taxes but didn’t get into much more detail.\n\nWarren’s campaign did not immediately respond to a request for comment. But Buttigieg wasn’t alone in taking a shot at Warren. He merely offered the most direct one.\n\nDuring a call with reporters on Thursday morning, Sen. Kamala Harris' campaign (D-CA) appeared to knock Warren for transferring money from her Senate campaign prior to her presidential outfit. Though, Warren did raise and donate $11 million to help Democrats up and down the ballot while she was up for re-election in 2018.\n\nAnd Sen. Amy Klobuchar (D-MN), who has attempted to run in a more moderate lane in the primary, continued her derision of plans like Medicare for All and free college during a visit to the Midwest.\n\n“We’ve got a lot of great people running, but some of these ideas are better left in the college faculty lounge,” Klobuchar said in Michigan on Thursday, according to local reports. “I’m a commonsense person who's always governed by that.”\n\nRead more at The Daily Beast.\n\nGet our top stories in your inbox every day. Sign up now!\n\nDaily Beast Membership: Beast Inside goes deeper on the stories that matter to you. Learn more.", "description": "Heidi Gutman/GettySen. Elizabeth Warren (D-MA) has mostly been coasting to her position atop the 2020 Democratic primary field, often dodging the scrums other candidates have engaged in on the trail and the debate stage. But as she’s risen, her opponents have begun to notice. And this week, several of", "authors": ["Gideon Resnick"], "top_image": "https://s.yimg.com/uu/api/res/1.2/iBG_nAHYlboJqEBR11.Riw--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/e390b75784eefc1a6cc0b5bedb9b7980"}