{"pub": "investing.com", "url": "https://investing.com/news/politics/us-democratic-presidential-hopefuls-vie-to-wow-voters-at-iowa-steak-fry-1983265", "downloaded_at": "2019-09-22 00:27:51.366076+00:00", "title": "U.S. Democratic presidential hopefuls vie to wow voters at Iowa steak fry", "language": "en", "text": "By Amanda Becker\n\nDES MOINES, Iowa (Reuters) - Democrats vying for the nomination to take on Republican U.S. President Donald Trump tried to make a splash on Saturday as they entered a party steak fry in Des Moines, Iowa, the state that will host the first nominating contest in early February.\n\nU.S. Senator Kamala Harris marched in accompanied by a drumline. Former U.S. housing chief Julian Castro danced alongside a mariachi band. Supporters of former U.S. Representative Beto O'Rourke launched a makeshift boat with his campaign poster. Two women wore U.S. pennies fashioned out of cardboard, costumed as U.S. Senator Elizabeth Warren's proposed wealth tax.\n\nSeventeen of the 19 Democrats in the race to take on Trump in November 2020 spoke at the steak fry hosted by the Polk County Democrats, the county that includes Des Moines, Iowa's most populous city.\n\nMore than 12,200 attended the Democratic Party fundraiser, breaking previous records and drawing visitors from Germany, Japan and Sweden, according to event organizers.\n\nSupporters arrived early to set up candidate yard signs alongside the road winding into the park. They trekked in wearing t-shirts emblazoned with the name of their favorite contender or cause. They sat in lawn chairs as the candidates spoke, cheering and chanting in the light rain as the ground grew muddy and posters soggy.\n\n\"Regardless of what campaign you support, we are all on the same team,\" O'Rourke said as the crowd cheered his call to defeat Trump.\n\nHarris blasted Trump's trade policies as hurting Iowa's farmers. U.S. Senator Cory Booker said the election was a \"referendum on our spirit.\" U.S. Senator Bernie Sanders said the \"same old type of politics is not going to work.\" Former Vice President Joe Biden said he believed the country could recover from four years of Trump's presidency, but not eight.\n\n\"I'm Elizabeth Warren, I know what is broken, I know how to fix it and we're building a grassroots movement,\" Warren said as chants of \"Two cents! Two cents!\" broke out during her remarks, in a nod to her proposal to impose a 2% tax on wealth above $50 million.\n\nDemocrats at the event said they appreciated having the opportunity to see the candidates in person, given the attention Iowa draws for hosting the first nominating contest.\n\nDustin Schafbuch, 26, attended the steak fry for the first time to see Pete Buttigieg, the mayor of South Bend, Indiana. He wore a bright yellow \"Pete\" t-shirt, though he is still making a final decision about which candidate to support in February.\n\n\"I loved hearing everything he said, I think he had a good crowd, a really good turnout today, he had a lot of people rallying behind him, I really felt good in wearing this shirt today,\" Schafbuch said.", "description": "U.S. Democratic presidential hopefuls vie to wow voters at Iowa steak fry", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8K0U7_L.jpg", "published_at": "2019-09-21"}