{"pub": "yahoo", "url": "https://news.yahoo.com/gms-profit-sharing-offer-uaw-145744269.html", "downloaded_at": "2019-09-23 07:31:43.748689+00:00", "title": "How GM's profit sharing offer to UAW workers missed the mark", "language": "en", "text": "Regina Knuckles, 46, of Flint stays warm next to a fire pit on the fourth day of the nationwide strike of UAW strike against General Motors after stalled contract talks in Flint, Mich. on Thursday, Sept. 19, 2019.\n\nDETROIT - General Motors and UAW negotiators were to continue talks toward a new contract Sunday, day seven of a nationwide strike against the automaker.\n\nDemocratic presidential candidate Elizabeth Warren, for the first time with frontrunner status in a new Iowa Poll, was to join strikers at Detroit-Hamtramck Assembly Plant on the picket lines Sunday. UAW President Gary Jones dubbed it \"Solidarity Sunday\" and invited the public to join strikers across the country. Former Vice President Joe Biden, the leader in most Democratic polls, was expected at a labor rally in Kansas City, Kansas.\n\nTop UAW leaders will be in negotiations rather than at the Detroit rally. Terry Dittes, the union's GM Department vice president will be participating in talks at the Renaissance Center and union President Gary Jones is expected to join the group, the Free Press was told by a person familiar with the negotiations.\n\nThe autoworkers are one of two UAW-represented groups striking GM facilities. About 850 janitors employed by Aramark walked off the job early Sunday at five GM locations in Michigan and Ohio. At the same time, the union's separate 2015 contract with GM expired. Some 24 hours later, 46,000 GM workers went on strike across the United States.\n\nA source familiar with the talks said negotiators resumed bargaining around 9 Sunday morning after going into the evening Saturday.\n\n'It's quick, rash and insensitive': GM dumped health care for striking workers. That poured gas on fire, expert says\n\nProfit sharing\n\nMeanwhile, the Detroit Free Press has learned details of another key sticking point between the union and the automaker: profit sharing, with a person familiar with GM's proposal said it falls short of union demands.\n\nGM has said it offered an improved formula that would boost profit sharing. The biggest issue seems to be that GM's offer did not include temporary workers.\n\nGM spokesman said David Barnas said, \"I can’t comment on current bargaining/negotiations.\" He added that currently all classifications of hourly workers at GM are eligible for profit sharing, except for temporary employees.\n\nIn a media statement Sept. 15, GM said it had offered the UAW an \"improved profit sharing formula\" among other gains in its initial contract offer. The UAW rejected GM's offer, which contained numerous other components, and ordered its 46,000 workers to strike early Monday morning all 55 GM facilities in the United States.\n\nA source with knowledge of the offer GM made to the UAW, said the union considered the profit sharing proposal \"concessionary. It rolls back profit sharing.\"\n\nWhat you need to know: GM promises UAW 5,400 jobs, $7B in US investment\n\n\"The temporary workers don’t get the profit sharing,\" said Harley Shaiken, a professor who specializes in labor at the University of California, Berkeley. \"If 10% of your workforce doesn’t get it, that’s a whoa! That’s a big a check, and if you don’t get it and you’re doing the same job as someone next you who does get it, you’re not going out to celebrate with them that night.”\n\nBut GM has the auto industry’s most generous profit-sharing plan for hourly employees, said a company spokesman, citing a study conducted by the National Opinion Research Center at the University of Chicago.\n\nGM’s yearly profit sharing for the last four years has exceeded $10,000 annually, the company said.\n\nThe government-funded U.S. General Social Survey reported that 32% of American workers received a share of their company’s profits last year. The average payout was $2,000.\n\nHow to get top dollar\n\nA GM worker typically gets $1,000 for every billion in GM's North American pretax profits, Shaiken said.\n\nSo this year, most hourly workers got checks for $10,750, based on GM's North American pretax profit of $10.8 billion in 2018.\n\nJustin McCauley, 36, of Saginaw is a temporary worker with three years experience working atthe General Motors Flint assembly plant, where he know strikes on the fourth day of the nationwide strike of UAW strike against General Motors after stalled contract talks in Flint, Mich. on Thursday, Sept. 19, 2019. More", "description": "GM and the UAW are in day 7 of the strike. They continue to negotiate. One area where the union says GM fell flat is with its profit sharing offer.", "authors": ["Jamie L. Lareau", "Detroit Free Press"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ISooW.LCu0IJHA.vl0sqcA--~B/aD0xNjAwO3c9MjQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_money_325/d35a1fc6d5c04eaa48a935875acf6b6e", "published_at": "2019-09-22"}