{"pub": "abcnews", "url": "https://abcnews.go.com/Technology/wireStory/mexican-agency-govt-pay-fishermen-save-vaquita-66483035", "downloaded_at": "2019-10-24 02:28:40.887012+00:00", "title": "Agency says gov't must pay fishermen to save most endangered marine mammal", "language": "en", "text": "Mexico's National Human Rights Commission said Wednesday the government must renew payments to fishermen who were ordered to stop using nets in order to save the last few vaquita marina, the world's smallest porpoise and the most endangered marine mammal.\n\nInterested in Animals? Add Animals as an interest to stay up to date on the latest Animals news, video, and analysis from ABC News. Add Interest\n\nFishermen say they have returned to fishing in the upper Gulf of California because President Andrés Manuel López Obrador cut off the compensation payments that they were receiving before he took office on Dec. 1.\n\n\"We are fishing,\" said Sunshine Rodriguez, a leader of the fishermen in the port town of San Felipe. \"We have to make a living somehow.\"\n\nThe problem was thrown into sharp relief earlier this month when crews from the environmental group Sea Shepherd and the Museo de la Ballena made a rare sighting of a live vaquita — right next to a fishing boat. Sea Shepherd said in a statement that dozens of fishing boats were spotted in an area where net fishing is prohibited.\n\nThe boats \"are exactly where we saw the remaining vaquitas during the last sighting voyage,\" said Octavio Carranza of Sea Shepherd. \"This is also where we found a dead vaquita tangled in a gillnet a few months ago.\"\n\nFewer than a dozen of the tiny, elusive porpoises remain in the Gulf, also known as the Sea of Cortez, which is the only place where they exist. Fishermen set illegal gill nets to catch totoaba fish, whose swim bladder is considered a delicacy in China. Those nets, some of which are also set to catch shrimp and other fish, can drown vaquitas.\n\nThe Human Rights Commission, whose non-binding recommendations are usually obeyed by government agencies, said Wednesday that Mexico's agricultural and fisheries departments must renew payments aimed at compensating the local fishermen for lost income.\n\n\"Starting now, they should take the necessary steps to guarantee fishermen get continuous and permanent payments that they were assigned for withdrawing their nets in the region of the upper Gulf of California reserve,\" rights commission inspector Nallely Hacha Álvarez said.\n\nAnother commission inspector, José Ulises Carmona, said the vaquita \"is a species that is now very near to extinction.\"\n\nRodriguez said fishermen in San Felipe, Baja California, had not received any payment at all since Lopez Obrador took office. He argued \"the commission should consider that human beings come before vaquitas.\"\n\nThe Department of the Environment did not immediately respond to requests for comment.\n\nIn a statement Monday, the department did not mention the lack of payments. It said that between April 10 and Sept. 30, it had conducted over 12,000 patrols to enforce the fishing ban, but did not explain why dozens of boats were seen fishing in plain sight in the reserve in mid-October.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Technology/WireAP_8fd1eac9644041d0a8eecfba82cc231a_16x9_992.jpg", "published_at": "2019-10-24"}