{"pub": "investing.com", "url": "https://ph.investing.com/news/stock-market-news/global-marketsasian-shares-up-as-very-good-trade-talks-boost-risk-appetite-65319", "downloaded_at": "2019-10-11 05:12:35.455656+00:00", "title": "GLOBAL MARKETS-Asian shares up as \"very good\" trade talks boost risk appetite", "language": "en", "text": "GLOBAL MARKETS-Asian shares up as \"very good\" trade talks boost risk appetite\n\n* MSCI Asia ex-Japan +1.2%; Nikkei +1%\n\n* Oil rises on OPEC head comments, trade deal hopes\n\n* Trump says U.S.-China negotiations \"very, very good\"\n\n* Asian stock markets: https://tmsnrt.rs/2zpUAr4\n\n\n\nBy Andrew Galbraith\n\nSHANGHAI, Oct 11 (Reuters) - Asian shares rose on Friday\n\nafter U.S. President Donald Trump said he would meet with\n\nChina's top trade negotiator, stirring hopes for an agreement,\n\nwhile sterling was flat after earlier jumping on optimism over a\n\npotential Brexit deal.\n\nInvestors' renewed appetite for riskier assets continued to\n\nweigh on the safe-haven yen and U.S. Treasury prices,\n\nwhile oil stayed firm on comments about possible supply cuts\n\nfrom the head of OPEC.\n\nMSCI's broadest index of Asia-Pacific shares outside Japan\n\nrose 1.2%, following on from gains on Wall\n\nStreet. S&P e-mini futures added more than 0.3%.\n\nAustralian shares climbed 0.8%, while Japan's Nikkei\n\nstock index gained 1%. Chinese blue-chips\n\nadded 0.5%.\n\nThe bullish market mood came after a first day of trade\n\ntalks between top U.S. and Chinese negotiators, characterised by\n\nTrump as \"very, very good.\"\n\nA White House official said the talks had gone \"probably\n\nbetter than expected\" and a U.S. Chamber of Commerce official\n\nbriefed by both sides raised the possibility of a currency\n\nagreement this week. Even before Trump's comments, hopes for an agreement helped\n\nto lift U.S. markets. The Dow Jones Industrial Average\n\nadded 0.57%, the S&P 500 gained 0.64% and the Nasdaq\n\nComposite rose 0.6%.\n\nBut while optimism around trade talks helped to drive a\n\n\"classic risk-on session\" overnight, the lack of runaway\n\nenthusiasm reflected broader investor caution, said Matt\n\nSimpson, senior market analyst at GAIN Capital in Singapore. \"We\n\nknow that it's just a few words from Trump.\"\n\nFurther positive developments in trade talks could boost\n\nmarkets on Monday, but low expectations for a deal mean that the\n\nlack of an agreement would not \"necessarily (be) the end of the\n\nworld for risk,\" he added.\n\nAnalysts at National Australia Bank said freezing tariffs at\n\ncurrent levels would be unlikely to reverse the trade-driven\n\nslowdown in economic growth.\n\n\"The uncertainty around unresolved structural issues such as\n\nIP (intellectual property) theft and subsidies to state owned\n\nenterprises are likely to remain deterrents for a pick-up in\n\nmuch needed capital expenditure. On this score details on a\n\npotential currency pact will be important,\" they said in a\n\nmorning note.\n\nOn Friday, the dollar was little changed against the yen at\n\n107.98 , while the euro gained 0.1% to buy $1.1015. The\n\npound was slightly lower, fetching $1.2436.\n\nThe dollar index , which tracks the greenback against\n\na basket of six major rivals, was down at 98.655 after posting\n\nits biggest daily drop in five weeks on waning safe-haven demand\n\nfor the currency.\n\nThe British pound had jumped nearly 2% on Thursday, its\n\nbiggest daily gain since March, after Irish Prime Minister Leo\n\nVaradkar said a Brexit deal could be clinched by the end of\n\nOctober after what he called a very positive meeting with his\n\nBritish counterpart, Boris Johnson. The move away from safe havens also lifted the yield on\n\nbenchmark 10-year Treasury notes to 1.6733% compared\n\nwith a U.S. close of 1.656% on Thursday. Yields rose across the\n\ncurve, with two-year notes yielding 1.5464% compared\n\nwith a U.S. close of 1.53%.\n\nIn commodity markets, oil prices remained higher after the\n\nhead of OPEC said the organisation could take action to balance\n\noil markets, including a deeper cut in oil supplies, and amid\n\nhopes that progress toward ending the U.S.-China trade war could\n\nhelp to revive economic growth and lift fuel consumption.\n\nU.S. crude was up 0.52% to $53.83 a barrel and global\n\nbenchmark Brent crude was up 0.49% at $59.39 per barrel.\n\nGold, which had found its appeal tarnished by rising risk\n\nappetite, recovered some ground, with spot gold trading\n\nup 0.1% at $1,495.36 per ounce. GOL/\n\n\n\n(Editing by Jacqueline Wong & Simon Cameron-Moore)\n\n", "description": "GLOBAL MARKETS-Asian shares up as \"very good\" trade talks boost risk appetite", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/Brazil-Stock-Market_3_800x533_L_1414427437.jpg", "published_at": "2019-10-11"}