{"pub": "hotair", "url": "https://hotair.com/headlines/archives/2019/10/romney-wont-primary-trump-hes-trying-bring", "downloaded_at": "2019-10-08 14:59:11.371024+00:00", "title": "but he's trying to bring him down", "language": "en", "text": "In the Senate, Ben Sasse and Susan Collins have made their usual equivocal noises—but not surprisingly, its Mitt Romney, longtime Trump antagonist and sometime suck-up, who’s become the standard-bearer, leading to questions as to what his game is. According to sources, donors have in recent days called the Utah senator and encouraged him to run against Trump in the primary. “There is a half-billion dollars on the sidelines from guys who are fed up with Trump,” a GOP donor told me. Their hopes were raised when Romney attacked Trump on Friday, tweeting: “By all appearances, the President’s brazen and unprecedented appeal to China and to Ukraine to investigate Joe Biden is wrong and appalling.” Former White House communications director turned Trump antagonist Anthony Scaramucci tweeted a poll showing Romney beating Trump 55% to 37% in a hypothetical primary. Trump fired back on Saturday. “Mitt Romney never knew how to win,” Trump tweeted. “He is a pompous ‘ass’ who has been fighting me from the beginning, except when he begged me for my endorsement for his Senate run (I gave it to him), and when he begged me to be Secretary of State (I didn’t give it to him). He is so bad for R’s!”\n\nAccording to people close to Romney, he’s firmly decided against primarying Trump, an enterprise he believes to be a sure loser given Trump’s enduring GOP support. Romney has also told people that, as an unsuccessful two-time presidential candidate, he’s the wrong person to take on Trump. Instead, a Romney adviser told me, Romney believes he has more potential power as a senator who will decide Trump’s fate in an impeachment trial. “He could have tremendous influence in the impeachment process as the lone voice of conscience in the Republican caucus,” the adviser said. In recent days, Romney has been reaching out privately to key players in the Republican resistance, according to a person briefed on the conversations. “Romney is the one guy who could bring along Susan Collins, Cory Gardner, Ben Sasse. Romney is the pressure point in the impeachment process. That’s why the things he’s saying are freaking Republicans out.” (Romney, through a spokesperson, declined to comment.)", "description": "", "authors": ["Gabriel Sherman", "Vanityfair.Com News"], "top_image": "", "published_at": "2019-10-08"}