{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7546997/Woman-reveals-escaped-child-sex-cult-falling-pregnant-outsider.html", "downloaded_at": "2019-10-08 12:11:25.989595+00:00", "title": "Woman reveals how she escaped from a child sex cult after falling pregnant with outsider", "language": "en", "text": "A woman has revealed how she escaped from child sex cult Children of God when she fell pregnant with an outsider, saying she 'didn't want to bring up a baby in that hellhole.'\n\nChristina Babin, 43, from Louisiana, was forced into Children of God as a child when her mother joined the group, which has been accused of promoting child labor, rape, exorcisms and horrific physical, mental and emotional abuse.\n\nIt still exists to this day, although it changed its name The Family International in 2004.\n\nChristina told Take A Break magazine that she finally found the courage to escape from the cult at the age of 21 after falling pregnant with an outsider, saying she refused to bring a baby into 'that hellhole'.\n\nChristina Babin, 43, from Louisiana, revealed she found the courage to leave the Children of God after falling pregnant with an outsider\n\nChristina joined the hippy evangelist cult along with her mother, and said she faced years of sexual abuse in the group\n\nBabin's mother was convinced into joining the hippie evangelist cult that several other families were a part of and appeared honorable to outsiders.\n\nThe sect was established in the late 1960s by late minister David Brandt Berg.\n\nOriginally known as Teens of Christ, Berg soon changed the name to Children of God in the hopes of appealing to a wider crowd that included vulnerable youths looking for a support and comfort\n\nChristina was forced to take on adult-like responsibilities such as caring for other kids and waking up in the early hours of the morning to work and recite morning prayer.\n\nThe Children of God group were established by late minister David Brandt Berg (pictured) in the late 1960's\n\nShe revealed sex attacks would occur regularly and bedtime stories were terrifying 'tales of an oncoming ­apocalypse.'\n\nChristina was taught not to cry, and the children who did were tormented.\n\nBy the time she was 12, she and her older brother were sent to a camp in Japan for two years without their mother.\n\nThey were banned from going outdoors most days, she said, and were convinced into thinking their lifestyle was holier than those not apart of the cult.\n\nChristina, pictured here with one of her siblings David, said she was raped by adults and ordered not to smile during her time in the group\n\nChristina joined the group with her mother when she was just 11-years-old and said she was raped countless times as a child\n\nDuring her time in the group, she revealed she was raped by the adults and ordered not to smile.\n\nShe has now revealed how she bravely escaped after falling in love with an 'outsider' who was considering joining the group.\n\nShe said she was 19-years-old when they met and he toyed with the idea of joining the cult.\n\nDespite his decision against it, they continued to see each other in secret and over time, he introduced her to the outside world.\n\nBerg was the founder and leader of the new religious movement initially called Teens for Christ, then later The Children of God, now called The Family International\n\nChristina revealed she managed to escape after she fell in love with an outsider, who took her for dinners at his parents house and showed her life outside the group\n\nHe even took her to meet his parents over a dinner party at their home.\n\nShe admitted she was stunned by the experience at the time, saying: 'It was glorious chaos - nobody was watching what they said or worrying about stepping out of line. They were free.'\n\nMonths later, she found out she was pregnant, and called it a turning point in her life in the cult.\n\nKnowing that her child would be subject to the type of suffering she had faced, she said: 'I didn't want to bring my baby up in that hellhole.'\n\nThe 43-year-old said she will always remain grateful to her former husband for helping her escape her former life\n\nShe was 21 when she found the courage to leave the cult, and went on to marry the man who helped her escape.\n\nShe revealed: 'Although the marriage didn't last, we remained on good terms and I'm grateful for him helping me to escape.'\n\nThe cult, founded in California, has frequently been at the center of physical and sexual abuse claims and infamous court cases.\n\nIt's current mission statement is 'sharing the message of God’s love for humankind, promoting personal spiritual growth and enhancing the quality of life of the disadvantaged.'", "description": "Christina Babin, 43, from Louisiana, has revealed how she found the courage to leave the Children of God cult after falling in love with an outsider, who showed her how 'free' life could be.", "authors": ["Harriet Johnston For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/10/19436618-0-image-a-16_1570528167804.jpg", "published_at": "2019-10-08"}