{"pub": "yahoo", "url": "https://news.yahoo.com/long-does-bankruptcy-stay-credit-132551117.html", "downloaded_at": "2019-09-24 00:54:28.328262+00:00", "title": "How Long Will Bankruptcy Haunt Your Credit Reports?", "language": "en", "text": "Filed for bankruptcy, or thinking of filing, and wondering how long it'll mess up your credit report?\n\nThe short answer is that it depends on which type of bankruptcy you filed.\n\nAlthough bankruptcy filings stay on your credit report for up to a decade, the effect on your credit score diminishes over time until it drops off your report completely.\n\nRead on for the different types of bankruptcy, how they impact your credit score and report, plus how you can minimize the impact on your credit reports — and what you should do in the aftermath.\n\nChapter 7 bankruptcy\n\nhakafot | Shutterstock More\n\nChapter 7 bankruptcy is the classic bankruptcy measure for people who have defaulted (that is, failed to pay) their loans. Filling for Chapter 7 forgives most debts, including:\n\nCredit card debt\n\nMedical bills\n\nPersonal loans\n\nChapter 7 bankruptcy stays as a negative mark on your credit report for 10 years (from the date of filing). Filings also could cause your credit score to drop by as much as 200 points or more.\n\nAny debts that were wiped away by filing for Chapter 7 bankruptcy will be included on your credit report.\n\nTo qualify for Chapter 7 bankruptcy, you must first pass a “means test” that assesses your income and assets-to-debt ratio. Often, property, cars and other valuables might have to be liquidated in order to pay back as much of the debt as possible — but some day-to-day essentials that you own might be exempt under law, like your house or computers you use for work.\n\nChapter 7 bankruptcy (unfortunately) doesn’t apply to student loans, taxes, criminal fines, alimony or child support. There are some consequences you can't escape.\n\nChapter 13 bankruptcy\n\ndesigner491 | Shutterstock More\n\nChapter 13 bankruptcy, also known as “wage earner’s bankruptcy,” is for people who earn too much to qualify for Chapter 7 but not enough to meet creditors' immediate payment requirements.\n\nAs with Chapter 7 bankruptcy, filing for Chapter 13 bankruptcy will torpedo your credit score, and the filing will remain on your credit report — for seven years. If you need to apply for another loan during that time, you’ll need to file a motion and obtain the court’s permission first.\n\nUnder Chapter 13 bankruptcy, the court creates a payment plan for you to repay your debt over the span of three to five years.\n\nAfter that span of time, any remaining debts are wiped clean — meaning that your creditors may not get the full amount you owe them. Chapter 13 bankruptcy allows you to repay some of your debt while still holding on to your assets, including cars, jewelry and property.", "description": "Here's how long bankruptcy stays on your credit report and what you can do to rebuild credit afterward.", "authors": ["Sarah Cunnane"], "top_image": "https://s.yimg.com/uu/api/res/1.2/KIi1RNn_Kfo4wCwyl83rhQ--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/moneywise_327/3c67385ef9cf223c656c9a147905beac", "published_at": "2019-09-23"}