{"pub": "cbc", "title": "Why This Indigenous Father Considers Pulling His Son’s Hair an Act of Severe Bullying", "url": "https://cbc.ca/parents/learning/view/boys-with-braids-anti-bullying-initiative", "language": "en", "published_at": "2018-06-22", "downloaded_at": "2019-09-02 07:01:24.462684+00:00", "text": "Every family has its traditions. For Michael Linklater, a Nehiyaw (Cree) father of two boys from Thunderchild First Nation, one of his family's traditions involves hair. Specifically boys with long hair.\n\nAs Linklater puts it, \"Each territory that one would visit, some teachings might be different. Teachings of long hair vary. Generally we believe it's where our strength comes from — a source of our power. A living part of our body. It's really important that we respect the spirit. We don't kill for no reason.\"\n\nAlthough hair is an integral part of his Indigenous traditions, he and his two sons have not always been celebrated for their long hair. In fact, Michael says as a child he would be teased and ridiculed every day, experiences that resurface as his kids became old enough to go to school.\n\n\"Generally we believe it's where our strength comes from — a source of our power.\"\n\nThis is why he started the anti-bullying campaign \"Boys With Braids,\" which seeks to educate Indigenous and non-Indigenous people about the importance of hair, and the problems of bullying. To mark Linklater's progress and commitment to the Indigenous community, he received a 2018 Indspire Award.\n\nHow Common Is Hair Bullying?\n\nLinklater says, \"It's a lot more common than people would think. It's common with Indigenous and non-Indigenous people. I've heard this across North America, and I've seen it with my own eyes.\" According to Michael, this kind of bullying can manifest in a few ways: boys can be \"teased for looking like girls\" or kids can physically tug at braids or even go so far as cutting them off.\n\nHair Bullying Is a Consent Issue\n\n\"No one touches our hair because it's a private part in our traditions,\" Linklater says. \"Touching our hair is like touching one of our private parts. It is serious.\" The idea of non-consensual hair touching challenges Linklater, and he believes these instances of bullying should \"be handled with the same severity as sexual assault.\" Not only that, but he describes the feeling, sharing \"You feel violated [when it happens]. And you feel the same way — some of the same feelings of when you hear reports of sexual assault allegations.\"\n\nWhat Can Parents Do?\n\n\"I think it starts with educators and parents. I know in some places it's now mandatory for the curriculum to include Indigenous teachings. Teachers can do some of their own research,\" Linklater says about the need for adults to become more aware of traditions and cultures that aren't like their own. Education is something Linklater is a strong advocate for — both in the classroom, and at home.\n\n\"Touching our hair is like touching one of our private parts. It is serious.\"\n\nBut in addition to education, he also believes parents need to create an environment where their kids feel heard, so they feel like they have a voice to self-advocate. \"It really has to do with the personal voice. If a young man is comfortable enough to speak up for himself — maybe even speak to what's going on [in the moment] — they can just say [something like] \"don't do that\" and for the reasons why.\"\n\nWhat Can Educators Do?\n\n\"I've talked to my son about this numerous times. The educator plays a huge part in the school system — if a young man has a voice, and goes to tell the educator and the educator does nothing, then that boy is being silenced,\" Linklater tells me, emphasizing how there are numerous factors at play that will help foster a sense of self-advocacy and personal voice. Parents can help nurture their child's voice and independence, but an educator, as Linklater sees it, needs to respond to that voice.\n\nAnd if an educator doesn't know of the traditions around Indigenous hair, he says that more needs to be done to respect it. \"Make sure it comes down to respect,\" he says. \"Simple teachings of being able to respect other cultures, beliefs and differences.\"\n\nWhat Can We Ask Kids to Do?\n\nLinklater believes it's important to not raise kids to be bystanders. In essence, he'd like to see kids raised who can advocate for those who don't feel emboldened to advocate for themselves. \"Kids shouldn't be bystanders,\" he says. \"For them to stand up for someone who is in need of help would be key.\"\n\nWhat Do You Do When Existing Mediation Channels Fail?\n\n\"For those situations where it's traumatic, what needs to happen is restorative justice practices, or a talking circle,\" he says. Linklater recommends this because it's a way of bringing the culture back to mediation — which he says gives everyone, including the victim and perpetrator — an opportunity to share. \"It's very healing — that's why it's called 'restorative.' What's taken is now restored.\"\n\n\"Kids shouldn't be bystanders.\"\n\nLinklater tells us that facilitators of talking circles exist in every province, and that sentencing — which comes from the victim — can be as simple as asking the perpetrator to come over for tea once a week, or recommending they partake in cultural teachings for the next month. He also says that a restorative justice practice or talking circle can only occur if the perpetrator of an offense is willing to accept that what they've done was wrong. When this fails to be an alternative? He says, \"Seeking help or guidance from an elder within your community that you feel comfortable with would be a huge resource for any family.\"\n\nCBC will broadcast the Indspire Awards on Sunday, June 24 on CBC and CBC Radio One at 8 p.m.. The award show event took place in Winnipeg this spring and honoured 13 recipients of all ages who have made outstanding contributions in their field across different Indigenous communities and also features musical performances and special guests.", "description": "It isn't just hair, and here's what this one dad wants you to know.", "authors": [], "top_image": "https://www.cbc.ca/parents/content/imgs/_8col/michael-linklater-.jpg"}