{"pub": "washingtonpost", "url": "https://washingtonpost.com/health/2019/10/03/is-twin-boom-ending", "downloaded_at": "2019-10-03 07:07:13.781321+00:00", "published_at": "2019-10-03", "title": "Is the twin boom ending?", "language": "en", "text": "Demographers credit the boom in twin births since the 1980s to women using fertility treatments and choosing to give birth at older ages, when they tend to produce more eggs per cycle. Now, changes in those fertility trends may be leading to a downturn in twin births.\n\nA new report released by the National Center for Health Statistics on Thursday shows that the twin birthrate fell 4 percent from 2014 to 2018, from 33.9 per 1,000 total births to 32.6 per 1,000 total births after years of increases.\n\nAD\n\nAD\n\nStarting in 1980, the twin birthrate of 18.9 per 1,000 total births rose an average of 2 percent annually through 2003. The pace then slowed down to less than 1 percent annually through 2014. The recent decline was most sharp in women ages 30 and over. For those ages 30-34, it fell 10 percent. For ages 35-39, 23 percent. And for women ages 40 and over by 23 percent.\n\nThe twin birthrate was essentially the same for women in their 20s, according to the report.\n\n“It is difficult to know for sure from the data in the NCHS report what the recent drop is linked to. However, given that declines are concentrated among older mothers, some would argue that changes in reproductive technology are likely playing a role,” said Gretchen Livingston, a senior researcher at the Pew Research Center who is an expert on fertility and family demographics.\n\nIn the past, many fertility doctors transferred multiple embryos during in vitro fertilization to increase the chances that at least one would implant successfully. More than a few of those pregnancies resulted in twins or higher-order multiples. But now many procedures transfer only one at a time. Many clinicians also advocate using lower doses of ovulation-stimulating hormones than in the past to avoid possible side effects.\n\nKenneth M. Johnson, a senior demographer at the University of New Hampshire, said one reason for the decline may be that a higher percentage of total births are occurring to older women.\n\nAD\n\nAD\n\n“They accounted for 20.5 percent of all births in 2014, but for 25.3 percent of all births in 2018. It is among these older women that the twin rates have diminished the most,” Johnson said.\n\nThe NCHS paper also shows that the number of twin births, which more than doubled from 68,339 in the 1980s to a peak of 138,961 in 2007, declined to 123,536 in 2018.\n\nRead more:\n\nAs U.S. fertility rates collapse, finger-pointing and blame follow\n\nTeen birthrate hits all-time low, led by 50 percent decline among Hispanics and blacks\n\n44 siblings and counting\n\nAD", "description": "", "authors": ["Ariana Eunjung Cha", "National Reporter"], "top_image": "https://www.washingtonpost.com/resizer/tkvlbJVjlPT89KWkGii63FMKZjs=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GF2INBG5GYI6TPT7JTEFAF6DN4.jpg"}