{"pub": "businessinsider", "url": "https://businessinsider.com/how-much-money-youtube-pays-creators-influencers-one-million-views-2019-7?r=rr", "downloaded_at": "2019-09-23 00:12:34.859133+00:00", "title": "YouTube star Shelby Church breaks down how much money a video with 1 million views makes her", "language": "en", "text": "Making money from YouTube can be a fickle proposition and depend on a variety of factors, but getting a million views can net a creator thousands of dollars.\n\nFor Shelby Church, a YouTuber who has 1.2 million subscribers, videos with about 1 million views have made between $2,000 and $5,000, she told Business Insider.\n\nChurch has 17 videos with over 1 million views. Her video titled \"This Is How Much YouTube Paid Me For My 1,000,000 Viewed Video (not clickbait),\" which has more than 2.7 million views, made more than $7,000 in Google AdSense revenue, Church said.\n\nThe breakdown\n\nFrom brand campaigns to in-video advertisements, there are several ways a YouTube creator can make money from a video.\n\nThe YouTube Partner Program allows creators with at least 1,000 subscribers and 4,000 watch hours in the past year to monetize their channels through ads, subscriptions, and channel memberships.\n\nAdvertisements are filtered through Google's AdSense program. How much money these ads generate depends on a video's audience and watch time, as well as which advertisers are buying, according to Petar Mandich, the chief talent officer at Addition, a talent management company focused on influencers and creators.\n\nLength\n\nCreators can place a certain number of ads in a video depending on its length. Videos over 10 minutes long will make more money because they can include more ad breaks, Church said.\n\nWatch time\n\nViewer watch time helps determine how well a video is performing on YouTube, and high-performing videos have a greater chance of being picked up by YouTube's automated algorithm, Mandich said.\n\nYouTube's automated algorithm affects how much money a video makes in two ways: It can pick up a video and suggest it, helping its overall reach, or flag and demonetize it for containing inappropriate material like copyrighted music, restricting it from making any money.\n\nDemographic\n\nA YouTube video's monetization is also affected by what part of the world viewers are watching from and their ages.\n\nNorth America and the UK are the two most important geographical regions for video views because more companies are buying ads in these regions. If 80% of a video's viewers are from somewhere else, a creator won't make as much in AdSense revenue, Mandich said.\n\nChurch said that while she has a video on her channel with over 2 million views, it didn't make her as much money as she expected because most of those views came from India.", "description": "How much money a YouTube creator can earn from advertisements is determined by more than a video's views.", "authors": ["Amanda Perelli"], "top_image": "https://amp.businessinsider.com/images/5d31e393454a390535766e4a-2732-1366.jpg", "published_at": "2019-07-22"}