{"pub": "bbc", "url": "https://bbc.com/news/technology-49660765", "downloaded_at": "2019-09-11 13:53:52.295898+00:00", "title": "Apple's iPhone 11 Pro 'triggering' fear of holes", "language": "en", "text": "Image copyright Apple\n\nPeople with a fear of small holes have claimed the design of Apple's iPhone 11 Pro is triggering their phobia.\n\nAt its unveiling on Tuesday, many found their attention drawn to its \"ultra-wide\" rear camera, with three high-powered lenses packed closely together.\n\nThe lenses sit alongside the handset's torch and \"audio zoom\" microphone.\n\nAnd hundreds of smartphone users now claim the new design has triggered their \"trypophobia\", an aversion to the sight of clusters of small holes.\n\nImage copyright Apple\n\nSkip Twitter post by @ummeetaa_x Apple did not think of us that have TRYPOPHOBIA when making the iphone 11 pro. I cant buy it and be itchy all over every damn time I look at it. — Mrs. Ummeeta Rabiu (@ummeetaa_x) September 11, 2019 Report\n\nThe term \"trypophobia\" was first coined in 2005 in online forum Reddit and it has since become widely talked about on social media.\n\nAmerican Horror Story actress Sarah Paulson and model Kendall Jenner are among those who say they have the condition.\n\nVision scientist Dr Geoff Cole, at the University of Essex, was part of the first full scientific study of trypophobia, working with his colleague, Prof Arnold Wilkins.\n\nImage caption People with trypophobia feel a sense of disgust when looking at small holes\n\n\"We have all got it, it's just a matter of degree,\" Dr Cole told BBC News earlier this year.\n\nThe response to seeing small holes can be very extreme, their study suggests.\n\nDr Cole and Prof Wilkins reported testimonies from some people who vomited and others who said they could not go to work for several days.\n\n\"It can be quite disabling,\" Prof Wilkins added.", "description": "People with \"trypophobia\" are complaining about Apple's latest handsets.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/128C6/production/_108747957__108743144_adb566c0-93a5-42a0-b07d-60624cafbdcf-1.jpg", "published_at": "2019-09-11"}