{"pub": "realclearpolitics", "url": "https://insidehook.com/daily_brief/travel/the-two-drinks-you-should-never-ask-for-on-an-airplane", "downloaded_at": "2019-09-25 04:37:22.876731+00:00", "title": "The Two Drinks You Should Never Ask for on an Airplane", "language": "en", "text": "The Two Drinks You Should Never Ask for on an Airplane\n\nIt’s more important than ever to spot yourself a hefty airport arrival time.\n\nAnd not just for beating traffic or dealing with a cranky TSA crew. According to flight attendants and public health researchers, you’ll also want to make time to pick up your coffee or tea from an airport cafe, instead of waiting to get it on the plane.\n\nA flight attendant named Jamila Hardwick, who works for Air Hollywood, recently told Inside Edition that “the pipes are rarely cleaned,” as airlines are only required to clean out their water tanks a handful of times a year. Hardwick recommends skipping the pots of coffee and tea made during a flight. Granted, she might have some outstanding, unreported gripe with the industry — she also dished on unwashed pillows and dirty tray tables — but her claims are backed up by a a study from 2015, called “Bacteria that Travel: The Quality of Aircraft Water.”\n\nThat study found 37 forms of bacteria in on-board water, some of which tested positive for E. coli, and suggested travelers refuse any water on a flight that doesn’t come from a sealed water bottle. This issue is exacerbated on long-haul flights (which are becoming more common) that have to make stops in countries with lower sanitation levels. That water is then brought across an ocean, housed in pipes that perhaps haven’t been cleaned in months, and used to make water from a coffee pot that might not get cleaned all day. It’s a disheartening system.\n\nYour best bet here? Either bring your own coffee or tea, or commit to an early morning flight, when you’re more likely to get the “cleanest” batch of the hot stuff.\n\nSubscribe here for our free daily newsletter\n\nRead the full story at Inside Edition", "description": "", "authors": ["Tanner Garrity"], "top_image": "https://www.insidehook.com/wp-content/uploads/2019/09/hero-57.jpg?fit=1200%2C750", "published_at": "2019-09-24"}