{"pub": "yahoo", "url": "https://news.yahoo.com/leading-snowboard-brand-close-stores-161610571.html", "downloaded_at": "2019-09-17 23:32:40.571628+00:00", "title": "Leading snowboard brand to close all stores in support of the Global Climate Strike – what else is the ski industry doing to combat global warming?", "language": "en", "text": "In an effort to highlight this, one of the world’s leading snow-sports brands, Burton Snowboards, has announced it will be joining millions of students and workers from around the world in support of the Global Climate Strike, which is taking place over the next two weeks on September 20 and 27.\n\nOn both days the brand will close all its offices and retail stores in America, Canada, Europe, China, Japan, South Korea and Australia, so its employees can join the strike and attend local marches, while still being paid. Its website, burton.com, will also be closed for online orders around the world on the same day. Visitors to the website will be automatically redirected to the Global Climate Strike homepage instead.\n\nThe brand’s flagship stores, which are largely based in the US, will be open to the public as a space to gather before and after the marches, where supplies will be available to make signs for the strike.\n\nThe Global Climate Strike is the latest incarnation of the #FridaysForFutures movement, which began in August 2018 when 15-year-old school girl Greta Thunberg sat in front of the Swedish parliament every school day for three weeks protesting against the lack of action being taken to combat the climate change crisis. Her efforts went viral and since then millions of students, and many adults, around the world have been protesting every Friday in support.\n\nPeople in 150 countries have organised Global Climate Strikes this September, when people are encouraged to walk out of work or school to join a local march. Organisers hope the strikes will demonstrate that people are no longer willing to continue with business as usual until a fresh approach to climate change is achieved.\n\nWalkouts are planned for every corner of the globe including the UK, US, France, Spain, Brazil, Eygpt, Ghana and Nigeria to name a few.\n\nGreta Thunberg started the #FridaysForFutures movement in 2018 Credit: REUTERS/ARND WIEGMANN More\n\n“I’ve been so inspired by Greta Thunberg and the students around the world who have used the weekly Fridays for Future protests to beg adults to pay attention to the climate crisis,” said Donna Carpenter, Co-CEO of Burton.\n\n“At Burton, we want to help preserve the winter outdoor experience for future generations, so I’m proud to have our company join Greta’s movement. As Greta said, ‘We’re all in the same boat, so everyone should be concerned about this’.”\n\nThe Burton Snowboards brand, which was founded by Jake Burton Carpenter, Donna’s husband, in 1977, has played a pivotal role in the rise of snowboarding as a professional sport. Since its beginnings in Carpenter’s barn in Vermont, the brand has grown to design and manufacture a full range of products including snowboards, boots, bindings and outerwear.\n\nSome may see it as a bandwagon-joining move by Burton, whose roster of ambassadors includes some of the world’s greatest snowboarders such as Winter Olympic champions Anna Gasser and Red Gerard, but it’s the latest in a number of efforts by the brand towards becoming a sustainable company.\n\nBy winter 2020 Burton is aiming for all its clothing and softgoods to contain only sustainable cotton, reduce chemicals and use less water. It also plans to reduce carbon emissions by 20 per cent in the production of hardgoods like snowboards and use only recyclable and compostable materials in its packaging.", "description": "In an effort to highlight this, one of the world’s leading snow-sports brands, Burton Snowboards, has announced it will be joining millions of students and workers from around the world in support of the Global Climate Strike, which is taking place over the next two weeks on September 20 and 27.", "authors": ["Lucy Aspden"], "top_image": "https://s.yimg.com/uu/api/res/1.2/sdKCjKXSNCJ4GmknBN3ZNA--~B/aD0xMjI2O3c9MTk2MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_818/b90b2b84939ea8264861b937c8aff739", "published_at": "2019-09-17"}