{"pub": "independent", "title": "Wales vs Ireland player ratings", "url": "https://independent.co.uk/sport/rugby/rugby-union/international/wales-vs-ireland-player-ratings-rugby-world-cup-2019-jack-carty-squad-announcements-a9086731.html", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:32:19.487160+00:00", "text": "Ireland ended Wales' 11-match winning streak at home with a 22-17 victory in Cardiff, banishing memories of their hammering at Twickenham last weekend.\n\nThe Irish were under pressure to deliver a big performance following the 57-15 record defeat against England, although both Joe Schmidt and Warren Gatland named heavily-changed teams ahead of their final Rugby World Cup squad announcements in the coming days.\n\nIreland took an early lead through a Jack Carty penalty in the ninth minute, only for opposite fly-half Jarrod Evans to respond and level the scores seven minutes later.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHowever, a 10-minute double from wing Jacob Stockdale gave the visitors breathing space, with Carty converting the first to give Schmidt's side a 15-3 advantage heading into the break.\n\nWales's scrum came under huge pressure shortly after the restart, costing them a penalty try as referee Romain Poite ran under the posts to put Ireland 22-3 to the good, but Wales soon spurred into life.\n\nTries from wing Owen Lane and replacement fly-half Rhys Patchell - both converted by the latter - cut the lead to just five points, but Ireland held on to get back to winning ways.\n\nSo how did the players perform? Click through the gallery above to see our ratings.", "description": "Ireland ended Wales' 11-match winning streak at home with a 22-17 victory in Cardiff, banishing memories of their hammering at Twickenham last weekend. The Irish were under pressure to deliver a big performance following the 57-15 record defeat against England, although both Joe Schmidt and Warren Gatland named heavily-changed teams ahead of their final Rugby World Cup squad", "authors": ["Samuel Lovett"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/31/16/jack-carty.jpg"}