{"pub": "guardian", "url": "https://theguardian.com/technology/2019/oct/16/oneplus-7t-review-the-new-cut-price-flagship-king", "downloaded_at": "2019-10-16 06:22:39.499238+00:00", "title": "OnePlus 7T review: the new cut-price flagship king", "language": "en", "text": "The OnePlus 7T takes the best bits of the brilliant OnePlus 7 Pro and condenses them into a smaller, cheaper package.\n\nReleased less than four months after the last version hit the shelves, the new £500 7T doesn’t mess much with the winning formula, simply adding a better camera and market-leading 90Hz screen technology.\n\nOnePlus launches new phones every six months or so, typically with improved specifications and small tweaks to the design. While the 6T to 7 transition wasn’t a particularly big step other than a new processor and faster fingerprint scanner, the 7T brings the 90Hz screen from the 7 Pro to the smaller, cheaper device.\n\nFacebook Twitter Pinterest The glacier blue back is particularly attractive. Photograph: Samuel Gibbs/The Guardian\n\nAlthough you probably couldn’t tell unless put side by side with its predecessors, the 7T is 4mm longer, with a screen that’s slightly taller, and with a smaller widow’s peak notch for the selfie camera. Some 18 months on, the design still feels fresh, particularly compared with some phones with massive notches.\n\nThe 90Hz 6.55in Fluid AMOLED screen is the star of the show. It’s very bright, smooth and a pleasure to use. At Full HD+, it’s less pixel dense than the QHD+ screen on the 7 Pro, but you’d be hard pressed to tell, and the screen is flat, not curved at the edges, which is less visually arresting, though some might prefer it in use.\n\nThe front glass meets a polished metal band at at the sides, while the curved glass back and narrow 74.4mm width make the OnePlus 7T one of the easiest large-screen smartphones to hold, particularly when compared with the 6.5in iPhone 11 Pro.\n\nThe back also has a new large circular lump containing a new triple camera system, which looks fairly attractive, though you can feel it with your fingers in normal use.\n\nSpecifications\n\nScreen: 6.55in FHD+ 90Hz Fluid AMOLED (402ppi)\n\nProcessor: Qualcomm Snapdragon 855+\n\nRAM: 8GB of RAM\n\nStorage: 128 or 256GB (UFS 3.0)\n\nOperating system: OxygenOS 10\n\nCamera: 48MP + 12MP + 16MP triple rear camera, 16MP selfie camera\n\nConnectivity: USB-C (3.1) LTE, dual sim, wifi ac, NFC, Bluetooth 5 and GPS\n\nDimensions: 160.9 x 74.4 x 8.1mm\n\nWeight: 190g\n\nCompetition-beating hardware\n\nFacebook Twitter Pinterest The phone offers speed in all things, including seriously fast charging. Photograph: Samuel Gibbs/The Guardian\n\nNew for the 7T is a bump to Qualcomm’s Snapdragon 855+ chip, which has 15% faster graphics and a slightly faster CPU, but is otherwise the same as the Snapdragon 855 in the 7, and many other smartphones this year.\n\nIn the UK, the rest of the specifications have been reduced to one option: 8GB of RAM and 128GB of UFS3.0 storage, with a 256GB version available elsewhere, effectively eliminating the cheapest 6GB RAM configuration from its predecessor.\n\nThe phone absolutely flies. Every action has a sense of immediacy that’s unrivalled in the smartphone industry. Now with the 90Hz display, everything is even smoother and more enjoyable – even mundane things such as scrolling through web pages or social media posts are pleasurable.\n\nBattery life on the 7T is slightly worse than the 34 hours of the 7. The new 7T lasts 31 hours between charges with medium to heavy usage: 200 or so emails, messages and push notifications, a couple of hours of browsing in Chrome, five hours of Spotify via Bluetooth headphones, 90 minutes of Into the Badlands from Amazon Prime Video, and about 15 photos.\n\nThat means the 7T reliably makes it from 7am on day one until 2pm on day two. There’s no wireless charging, but the improved Warp Charge 30T technology sees the 7T hit full charge in 60 minutes from flat, which is half an hour less than the previous version and one of the fastest available.\n\nOxygenOS 10\n\nFacebook Twitter Pinterest OxygenOS continues to lead the market in refinement and performance, now based on the very latest Android 10 with better gesture control and privacy features. Photograph: Samuel Gibbs/The Guardian\n\nThe OnePlus 7T ships with Oxygen OS10, which is based on the very latest Android 10, making it one of the first smartphones on sale to use it.\n\nOxygenOS continues to be one of the best implementations of Android, focusing on speed and customisation. New for version 10 is a complete theming engine, which in addition to the usual wallpaper changes, allows you to customise the colours of buttons, the background, the shape of icons and dialogue boxes, the font, the ambient clock display and even the fingerprint scanner animation.\n\nAlso new is the integration of Google’s new Android 10 gesture navigation, which eschews the traditional three-button or two-button navigation system for a new gesture bar. Swipe up on the bar to go home, up and hold for recently-used apps, or left or right to jump to a previously-used app. A swipe in from the left or right sides in the lower two-thirds of the screen is now used for going back.\n\nSome may hate the new gestures, but the back swipe in from the side makes using a large smartphone a lot easier. You can hide the bar altogether or switch to the old-style three-button navigation bar.\n\nFingerprint scanner\n\nFacebook Twitter Pinterest OnePlus’s market-leading optical in-screen fingerprint scanner is even faster, matching even the very best traditional capacitive sensors for speed and accuracy. Photograph: Samuel Gibbs/The Guardian\n\nOnePlus has made its market-leading in-display optical fingerprint scanner even quicker and more accurate than it was on the OnePlus 7 and 7 Pro. Given how many times you unlock your phone or authenticate in an app with your fingerprint, speed and accuracy make a huge difference to the overall experience.\n\nThe OnePlus 7T matches the performance of traditional capacitive sensors and puts everyone else to shame. This is how it’s done.\n\nCamera\n\nFacebook Twitter Pinterest The OnePlus camera app is simple and effective, with an improved Night Scape and new super macro mode. Photograph: Samuel Gibbs/The Guardian\n\nNew for the 7T is the triple camera system on the back. The main 48-megapixel camera has optical image stabilisation, and is joined by a 12-megapixel 2x telephoto camera and a 16-megapixel ultrawide camera.\n\nThe combination allows you to shoot photos and video at 0.6, 1 or 2x optical zoom or up to 10x digital zoom.\n\nThe results are very similar to the OnePlus 7 Pro, with the main camera capable of producing some great photos, full of detail, with solid low-light performance. The Night Scape low-light mode is improved too, although still can’t hold a candle to Google or Apple’s versions.\n\nThe 2x telephoto camera is noticeably sharper in good lighting than the 7 Pro’s 3x, but still worse than the main camera in less-than-ideal lighting. The 10x digital zoom matches the quality of competitors. The ultrawide angle camera continues to be fun and suffers from less lens distortion at the edges than others.\n\nFacebook Twitter Pinterest The circular camera lump is large and distinctive on the back. Photograph: Samuel Gibbs/The Guardian\n\nNew for the 7T is a class-leading macro mode that can focus at a minimum distance of 2.5cm from the ultrawide angle camera. That’s about a quarter of the distance of most and produces some simply astounding, highly-detailed macro shots with a bit of practice. If you’re at all into macro photography, you will absolutely love this feature.\n\nWhile generally good, the camera can be a bit unpredictable, over-exposing some scenes and often being far brighter indoors than you’d expect. A little manual adjustment is often required to get the photo just right.\n\nPortrait mode lags behind competitors, matching the performance of the top phones from a few years ago. The 16-megapixel fixed focus selfie camera is pretty good, capturing a good amount of detail in varying light conditions.\n\nVideo capture up to 4K at 60 frames per second was good, but not quite up to par with the best, while the 960fps slow motion was fun with bright lighting.\n\nObservations\n\nFacebook Twitter Pinterest The alert slider is smaller, but still good for instantly switching between ring, vibrate and completely silent. Photograph: Samuel Gibbs/The Guardian\n\nThe screen comes with a pre-installed screen protector, but it creates a sharp edge over which you have to swipe\n\nThe OnePlus alert slider on the side of the phone continues to be wonderful, if a little smaller this time around\n\nThe included TPU case is one of the best I’ve seen bundled with a phone\n\nThe “shelf” in OxygenOS continues to be not worth using, and would be better replaced by Google’s Discover feed\n\nThe first 7T tested had a fault with the screen displaying colour inconsistency manifesting as a green tint to the dark greys used in dark mode in various apps\n\nPrice\n\nThe OnePlus 7T costs £549 in glacier blue or frosted silver shipping from 17 October.\n\nFor comparison, the OnePlus 7T Pro costs £699, the Samsung Galaxy S10 costs £799, the Samsung S10e costs £669, the Honor 20 Pro costs £550, the Google Pixel 3a XL costs £469, and the iPhone XR costs £629.\n\nVerdict\n\nSimply put, the OnePlus 7T is the cut-price flagship phone to beat. It offers the same super-fast performance and silky smooth 90Hz screen experience as the bar-raising OnePlus 7 Pro, but in a smaller, lighter and cheaper package.\n\nAt 6.55in the screen is still large, bright and good-looking, squeezed into a more manageable body. The battery life is solid, if not class-leading. The camera is capable of capturing some great-looking photos but can’t match the best in the industry. You get the class-leading in-screen fingerprint scanner, excellent OxygenOS software with at least three years of updates, and seriously fast charging.\n\nIt doesn’t feel quite as luxurious in the hand as the 7 Pro, nor does it have the wow factor of the its gigantic, notchless screen, but it’s also significantly cheaper, even if it starts at £50 more than its predecessor.\n\nAt £549 the OnePlus 7T is a bargain, offering an experience that is simply unrivalled by anything remotely near it in price.\n\nPros: the fastest performance, brilliant screen, dual sim, good camera, great macro mode, Bluetooth 5, Android 10, great software, tiny notch, super-fast in-screen fingerprint sensor, alert slider Cons: glass back but no wireless charging, no IP water resistance rating, no expandable storage, no headphone socket\n\nOther reviews\n\nThis article contains affiliate links, which means we may earn a small commission if a reader clicks through and makes a purchase. All our journalism is independent and is in no way influenced by any advertiser or commercial initiative. By clicking on an affiliate link, you accept that third-party cookies will be set. More information.", "description": "Competition-beating performance, super-smooth experience and new 90Hz screen are a steal at £549", "authors": ["Samuel Gibbs"], "top_image": "https://i.guim.co.uk/img/media/17f4fcce97af5df64be4c949200cc148030007e6/335_399_4219_2533/master/4219.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTUucG5n&enable=upscale&s=ec687b22715c2551fccde68e492bdaad", "published_at": "2019-10-16"}