{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/us-authorities-analyze-bitcoin-transactions-to-shut-down-child-porn-ring", "downloaded_at": "2019-10-16 20:39:17.736839+00:00", "title": "US Authorities Analyze Bitcoin Transactions to Shut Down Child Porn Ring", "language": "en", "text": "United States law enforcement agencies analyzed Bitcoin (BTC) transactions to locate and subsequently shut down a global child pornography site.\n\nPer an Oct. 16 press release, the U.S. Department of Justice announced the shutdown of the largest-to-date child sexual exploitation market called Welcome to Video which was operated by South Korean national, Jong Woo Son. The site offered child pornography videos for sale using Bitcoin.\n\nCrypto brings authorities closer to catching criminals\n\nTo trace Bitcoin blockchain transactions and identify users, IRS-Criminal Investigations (IRS-CI), Homeland Security Investigations and other agencies applied software provided by blockchain analysis company Chainalysis. IRS-CI Chief Don Fort commented:\n\n“Through the sophisticated tracing of bitcoin transactions, IRS-CI special agents were able to determine the location of the Darknet server, identify the administrator of the website and ultimately track down the website server’s physical location in South Korea.”\n\nAn analysis of the server indicated that each user had received a unique Bitcoin address upon registration on the website, which eventually amounted to over one million Bitcoin addresses and thus not least than one million users. The release further reads:\n\n“The virtual currency accounts identified in the complaint were allegedly used by 24 individuals in five countries to fund the website and promote the exploitation of children. The forfeiture complaint seeks to recover these funds and, ultimately through the restoration process, return the illicit funds to victims of the crime.”\n\nAs a result of the investigation, authorities seized nearly eight terabytes of child pornography videos, which makes it one of the largest such confiscations. 337 people were arrested in connection with the ring. 23 of the site’s victims were rescued in the United States, Spain and the United Kingdom.\n\nBetter building trust-based relations with crypto businesses\n\nAs of July, Chainalysis suggested that the amount of Bitcoin spent on illegal transactions this year could hit a record high of $1 billion, even as the ratio of illegal to legal transactions was shrinking. Oftentimes, marketplaces were involved in the distribution of drugs and/or illegal pornography.\n\nEarlier in October, the European Union Agency for Law Enforcement Cooperation (Europol) released its 2019 Internet Organized Crime Threat Assessment report, in which it stated:", "description": "United States law enforcement agencies analyzed Bitcoin transactions to locate and subsequently shut down a global child pornography site", "authors": ["Ana Alexandre"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvOGNmMjU0MzQyN2UwMjM3MTA1YjhlMjIxOTU4MDg3OTIuanBn.jpg", "published_at": "2019-10-16"}