{"pub": "reuters", "url": "https://in.reuters.com/article/eu-alphabet-privacy/europes-top-court-to-rule-on-right-to-be-forgotten-google-case-on-september-24-idINKBN1W5224", "downloaded_at": "2019-09-21 00:04:12.621868+00:00", "title": "Europe's top court to rule on 'right to be forgotten' Google case on September 24", "language": "en", "text": "BRUSSELS (Reuters) - Europe’s top court will rule on Sept. 24 whether Alphabet Inc unit Google must remove links to sensitive personal data worldwide or in Europe only in a case that pits privacy rights against the right of free speech.\n\nFILE PHOTO: The main courtroom of the European Court of Justice is pictured in Luxembourg January 26, 2017. Picture taken January 26, 2017. REUTERS/Francois Lenoir/File Photo\n\nA second related dispute before the Luxembourg-based Court of Justice of the European Union (ECJ) is whether Google must automatically delete search results with sensitive information on a person’s sex life or criminal convictions, among others.\n\nThe cases test the region’s right to extend its laws beyond its borders and a ruling against Google may even embolden authoritarian governments to demand the removal of any topic they want, legal observers said.\n\nThe first case centres on Google’s dispute with France’s privacy watchdog CNIL, which in 2015 told U.S.-based Google to delist sensitive information from internet search results globally upon request in what is called the “right to be forgotten”.\n\nCNIL fined Google 100,000-euros ($110,200) because it refused to comply. Google challenged the ruling at France’s Council of State, which turned to the ECJ for guidance.\n\nGoogle won the backing of ECJ court adviser Maciej Szpunar earlier this year who said that the right to be forgotten should only be enforced in Europe and not globally. Judges follow such non-binding opinions in four out of five cases.\n\nThe issue is important because it affects conflicting fundamental rights, said Richard Cumbley, a partner at law firm Linklaters.\n\n“The case highlights the continuing conflict between national laws and the Internet which does not respect national boundaries,” Cumbley said.\n\n“It seems unlikely that the court would give the right to be forgotten global effect,” he said. “This would create a serious clash with US concepts of freedom of speech and other states might also try and suppress search results on a global basis reducing Google’s search engine to a list of the anodyne and inoffensive.”\n\nA Google report showed that it removed 45 percent of the 3.3 million links from 845,501 requests received in the last five years since the ECJ enshrined the right to be forgotten in Europe in 2014.\n\nThe world’s most popular internet search engine has previously warned of the dangers of over-reach by Europe. In a blog post two years ago, the company said there should be a balance between sensitive personal data and the public interest and that no one country should be able to impose its rules on citizens of another.\n\nThe second case arose when CNIL rejected requests from four people to order Google to remove links found in internet searches using their names.\n\nThese included a satirical photomontage of a female politician; an article referring to someone as a public relations officer of the Church of Scientology; the placing under investigation of a male politician; and the conviction of someone for sexual assaults against minors.\n\nCourt adviser Szpunar recommended that prohibitions on processing certain types of data should also apply to the operators of search engines.\n\nThe European Commission, Microsoft Corp, UK rights group Article 19, the Wikimedia Foundation Inc and the Reporters Committee for Freedom of the Press backed Google at a court hearing last year.\n\nThe cases are C-507/17 Google and C-136/17 G.C. e.a.\n\n($1 = 0.9076 euros)", "description": "Europe's top court will rule on Sept. 24 whether Alphabet Inc unit Google must remove links to sensitive personal data worldwide or in Europe only in a case that pits privacy rights against the right of free speech.", "authors": ["Foo Yun Chee", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190920&t=2&i=1432063546&w=1200&r=LYNXMPEF8J1SI", "published_at": "2019-09-20"}