{"pub": "thenextweb", "url": "https://thenextweb.com/hardfork/2019/10/16/facebooks-libra-cryptocurrency-is-turning-into-a-soap-opera-and-its-gonna-be-a-long-season", "downloaded_at": "2019-10-16 13:32:20.782370+00:00", "title": "Facebook’s Libra ‘cryptocurrency’ is turning into a soap opera — and it’s gonna be a long season", "language": "en", "text": "Facebook’s controversial ‘cryptocurrency’ project is turning into a bit of a soap opera, starring the tech giant and regulators as the main characters.\n\nJust yesterday, Germany’s finance minister Olaf Scholz said the departure of several high-profile partners from the project was a good sign, but unsurprisingly the Libra Association had a different take altogether.\n\nThe Association, which just this week managed to get 21 organizations to sign its membership charter, took to Twitter to defend itself.\n\nWe’ve said from the beginning that Libra shouldn’t and wouldn’t launch without the appropriate regulatory oversight and addressing legitimate concerns. Every time someone agrees with us, it doesn’t constitute a “blow” or “setback.” Innovation and regulation can live in harmony. — Libra (@Libra_) October 15, 2019\n\nIt’s not entirely clear whether the tweet, which I’m sure was supposed to read “doesn’t agree with us,” was directed at one single article or simply a message being sent to address sentiment across the entire industry.\n\nThe UK is up for it, maybe\n\nInterestingly, though, Libra seems to have found an unlikely ally in the UK.\n\nMark Carney, the governor of the Bank of England, has leapt to Facebook’s defence, warning that the UK‘s “slow and expensive” payments system was “not good enough in this day and age.”", "description": "Facebook’s controversial ‘cryptocurrency’ project is turning into a bit of a soap opera, starring the tech giant and regulators as the main characters.", "authors": ["Yessi Bello Perez", "October"], "top_image": "https://img-cdn.tnwcdn.com/image/hardfork?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2FStarring.jpg&signature=784db3d2f29e55ba132d5d3f01728b85", "published_at": "2019-10-16"}