{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/23/ap-source-kansas-receives-notice-of-allegations-fr", "downloaded_at": "2019-09-24 01:11:34.599383+00:00", "title": "KU receives notice of allegations from NCAA in men's hoops", "language": "en", "text": "LAWRENCE, Kan. (AP) - The University of Kansas received a notice of allegations from the NCAA on Monday that alleges significant violations within its storied men’s basketball program, including a responsibility charge leveled against Hall of Fame coach Bill Self.\n\nThe notice includes three Level 1 violations tied primarily to recruiting and cites a lack of institutional control. It also includes notice of a secondary violation in football tied to then-coach David Beaty that involved the use of an extra coach during practice.\n\nWhile the document does not go into detail about what the basketball program is accused of doing, Kansas was among the most prominent programs swept up in an NCAA probe into a pay-for-play scheme that began with an FBI investigation into apparel company Adidas. A former Adidas employee testified that he made payments to the family of one Kansas recruit and the guardian of a current player. Text messages presented in court revealed a close relationship between Self and the Adidas employee.\n\nThe school said in a statement that it “strongly disagrees with the assertion that it ‘lacks institutional control.’ In fact, the university believes the record will demonstrate just the opposite.”\n\n“The University of Kansas has high standards of ethical conduct for all our employees, and we take seriously any conduct that is antithetical to our values and missions,” Kansas chancellor Doug Girod said. “While we will accept responsibility for proven violations of NCAA bylaws, we will not shy from forcefully pushing back on allegations that the facts simply do not substantiate.”\n\nGirod also said that the school would “stand firmly behind coach Self,” who delivered its fifth national championship in 2008 and has a team that could contend for another title this season.\n\nThe NCAA’s Stacey Osburn declined to comment on “current, pending or ongoing investigations.”\n\n“I have always taken pride in my commitment to rules compliance and led programs that operate with integrity,” Self said, “and I am proud of the success that we have achieved at each program along the way. Every student-athlete who has ever played for me and their families know we follow the rules.\n\n“These allegations are serious and damaging to the university and to myself,” he added, “and I hate that KU has to go through this process. With our staff’s full cooperation, these allegations will be addressed within NCAA procedures with urgency and resolve.”\n\nKansas had been in the NCAA’s crosshairs since early this summer, when Vice President Stan Wilcox said at least six schools were likely to receive notices of allegations for Level 1 infractions.\n\nNorth Carolina State was the first of them, getting a notice July 10 of two violations, including a failure-to-monitor charge leveled against former coach Mark Gottfried.\n\nArizona, Auburn, Creighton, Louisville, LSU and USC have also been under the microscope.\n\nLevel 1 infractions are considered the most severe by the NCAA, and often include postseason bans, the forfeiture of wins and championships and the loss of scholarships. But the notice itself is only the beginning of a process that can often take more than a year - the school typically sends a response to the NCAA enforcement committee, setting off an exchange of information.\n\nUltimately, a hearing will be scheduled and Kansas will be allowed to present its case. The NCAA will then issue its ruling, often within several months, and the school retains the right to appeal.\n\nThe former Adidas employee, T.J. Gassnola, testified in October that he made a a $90,000 payment to the family of then-Kansas recruit Billy Preston and $2,500 to the guardian of current forward Silvio De Sousa.\n\nGassnola, who avoided prison time by cooperating with the investigation, said he also paid $20,000 to Fenny Falmagne, De Sousa’s guardian, to pry the prospect loose from an agreement with Maryland.\n\nSelf said last October that “when recruiting potential student-athletes, my staff and I have not and do not offer improper inducements to them, or their families, to influence their college decisions, nor are we aware of any third-party involvement to do so.”\n\nGassnola testified that Self was unaware of the payments, but text messages and phone records indicate a close relationship with the national championship-winning coach. And an attorney for former Adidas executive James Gatto told a jury that his client approved the payment to Falmagne only after Self and his longtime assistant, Kurtis Townsend, requested Gassnola to provide it.\n\n“The evidence, I submit, shows that Kansas’ head coach knew of and asked for a payment to be made to Silvio De Sousa’s handler,” the attorney, Michael Schachter, said at the time. “More than that, coach Self requested just the kind of help that Mr. Gassnola arranged as a condition for coach Self to permit Adidas to continue their sponsorship agreement with the University of Kansas.”\n\nIn April, the school signed a 14-year, $196 million extension of its apparel and sponsorship deal with Adidas. The deal, which is worth $14 million annually, runs through the 2030-31 school year.\n\nGatto, former Adidas consultant Merl Code and handler Chris Dawkins have been found guilty of felony charges of wire fraud and conspiracy to commit wire fraud in connection with the case. Gassnola was given probation as part of his cooperation agreement with federal prosecutors.\n\nWhile Gassnola appeared to try to shield Self from the FBI probe, their relationship came out in text messages presented by defense attorneys at his trial. In one exchange, Gassnola texted Self that “I talked to Fenny,” and the coach replied, “We good?” Gassnola said, “Always. That’s light work.”\n\nLater, Gassnola texted about keeping Self and Kansas happy with lottery picks. Self responded: “That’s how (it) works. At UNC and Duke.”\n\nDe Sousa was declared ineligible for two full seasons by the NCAA, and sat out last season before declaring for the draft. He withdrew from the draft when the NCAA approved his appeal to play this season.\n\nThe Jayhawks had their run of 14 consecutive Big 12 championships end this past season, when Kansas State and Texas Tech tied for the crown. But with several returning stars and another elite recruiting class, the Jayhawks were expected to be a top-five team in the AP preseason poll.\n\n“We strongly disagree with the allegations regarding men’s basketball,” Kansas athletic director Jeff Long said. “We fully support coach Self and his staff, and we will vigorously defend the allegations against him and our university.\n\n“As for the football violations,” Long said, “we fully met the requirements and our responsibility to the NCAA by self-reporting the violations when our compliance procedures uncovered the issues. I am confident in our process to respond to the allegations and look forward to resolving this matter.”\n\n___\n\nMore AP college basketball: https://apnews.com/Collegebasketball and https://twitter.com/AP_Top25\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The University of Kansas received a notice of allegations from the NCAA on Monday that alleges significant violations within its storied men's basketball program, including a responsibility charge leveled against Hall of Fame coach Bill Self.", "authors": ["The Washington Times Http", "Dave Skretta"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/23/kansas_ncaa_violations_basketball_64177_c0-226-5400-3374_s1770x1032.jpg?cb5c7867563b2abf97a00a102051a13af94a4d48", "published_at": "2019-09-23"}