{"pub": "arstechnica", "url": "https://arstechnica.com/gadgets/2019/10/apple-earnings-q4-2019-tim-cook-says-health-will-be-what-apple-is-remembered-for", "downloaded_at": "2019-10-30 23:51:50.863437+00:00", "title": "Apple earnings Q4 2019: Tim Cook says health will be what Apple is remembered for", "language": "en", "text": "Apple's quarterly earnings calls have fallen into a predictable pattern for the past year or two: iPhone revenues are declining year-over-year, and the Mac mostly remains stagnant, but every other one of Apple's businesses—wearables and services most notably—are ballooning.\n\nThat was the case again with Apple's Q4 2019 earnings report today; iPhones were down, but the company posted its highest revenue ever in a September quarter thanks to good performance from services like the App Store, AppleCare+, and Apple Pay, as well as strong iPad and Apple Watch sales. Total revenue was $64 billion.\n\nApple revealed during the proceedings that the iPhone 11 (sans Pro ) is now its best-selling phone, and that iPhone revenue was $33 billion—a 9% decline over the same quarter the previous fiscal year, albeit an improvement over the 15% decline the company saw in the previous three quarters this year. (That improvement is very likely accounted for by the launch of the iPhone 11 and its ilk mid-September, just before the quarter ended.)\n\nMac sales were down 5%, but Apple CEO Tim Cook was quick to point out on the earnings call with investors that the company released a major update to the MacBook Air, one of its most popular computers, around this time last year but has not done so yet this year, ostensibly explaining some of the drop.\n\nApple is expected to refresh some of its laptops in the coming months and plans to imminently launch the pricy Mac Pro. Aimed at creative professionals, the Mac Pro's price point makes it less of a mass-market device than the MacBook Air.\n\nApple boasted 18% growth in services revenue, an improvement over the previous quarter that brings the 2019 fiscal year total to $46 billion. It was $12.5 billion for this quarter on its own. Among other things, this was credited to \"all-time record revenues from payment services\" like Apple Pay. The company alluded to the recent launches of Apple Card, Apple News+, and Apple Arcade, but it did not provide individual numbers for them during the call. Apple also said today that this was the best quarter ever for AppleCare.\n\nThe iPad saw 17% growth driven by the iPad Pro, but the big positive narrative from the company was that of wearables, which include Apple Watch and AirPods. The company saw 54% growth in that category, and the quarter in question ended before AirPods Pro were announced or released.\n\nIn an answer to an investor question, Cook let it be known that he sees wearables like the Watch and its associated health functionality as the future of the company. \"There will be a day in the future that we look back and Apple's greatest contribution will be to people's health,\" he said.\n\nSome investors are understandably concerned that many of Apple's growth areas are dependent on the iPhone. Users are sticking with their existing iPhones and opting going longer between upgrades than ever before, leading to ever-slowing iPhone sales. But Apple stock rose slightly after the call regardless, indicating that the market at least believes Apple still has plenty of room to grow in services and wearables in the near term before the iPhone's slowing momentum becomes a serious problem.\n\nAnd in some cases, the numbers bear that out: a substantial portion of Apple's wearables revenue (which now stands toe-to-toe with the Mac) comes from customers making a first-time purchase in that category. And Cook again made vague allusions to major new products in the wearables category, which (not his words) could include the company's rumored augmented reality headset\n\nDespite those declining iPhone sales, Apple users probably shouldn't be too concerned about the future of the ecosystem they've invested in. The company stated earlier this year that it has an install base of 900 million iPhones globally. Whether that continues to grow is a concern for investors looking for big returns in their portfolios, but not for users; an install base that size all but ensures continued support, content, and updates for many years yet.\n\nLooking ahead to Q1 2020, Apple projects revenue between $85.5 billion and $89.5 billion—Q1 is often a big quarter for the company, as it carries holiday sales and much of the immediate post-launch revenue from the new iPhone lineup.", "description": "Huge wearables growth and strong figures for services and iPad set new records.", "authors": ["Samuel Axon"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/09/applewatchseries5_10-760x380.jpg", "published_at": "2019-10-30"}