{"pub": "afr", "url": "https://afr.com/world/north-america/what-have-the-democrats-got-against-beating-trump-20191016-p5315z", "downloaded_at": "2019-10-16 05:53:26.597935+00:00", "title": "What have the Democrats got against beating Trump?", "language": "en", "text": "That someone who might appeal to the broad swathe of middle America that put Trump into office almost three years ago remains elusive.\n\nThe front-runners are all problematic in one way or another - and their flaws were on full display over almost three hours of debate on Tuesday night.\n\nJoe Biden, the oldest candidate in the field and until recently the leader, delivered a performance that waxed and waned. His answers seemed at time to wander, giving the impression of someone unable to hold onto a line of thought. It made for uncomfortable viewing.\n\nHis chief rival Elizabeth Warren, by contrast, was sprightly and sharp as she fended off a barrage of friendly fire from moderate Democrats who slammed her hard-line plan to do away with all private health insurance.\n\nThe third real contender in the field - Bernie Sanders - who just weeks ago suffered a heart attack - delivered a forceful performance.\n\nIndeed, it was so good that it immediately earned him an endorsement from ultra-progressive leading light Alexandria Ocasio-Cortez.\n\nMere moments after the CNN-broadcast debate ended, attack ads appeared warning Americans of the vast costs associated with the \"Green New Deal\" pushed by Ocasio-Cortez, Sanders and many others in the Democrat base.\n\nIt was a timely reminder of how Republicans are prepared to take up the fight and how the thing that still unifies all the Democrat front-runners is the burning question of electability.\n\nAdvertisement\n\nAside from Biden, who is the only moderate still seemingly in the race - the rest of the field are largely generating single-digit poll ratings - the top four spots are dominated by candidates pushing what must surely be one of the more radical left-leaning agendas anywhere in the developed world.\n\nThey plan to completely scrap America's private health insurance system and replace it with higher taxes, even if only one of them, Sanders, will admit to it outright. \"I do think it is important to acknowledge that taxes will go up,\" he said early in the debate.\n\nEveryone on the stage took turns to lambast America's billionaires, including an actual billionaire - Tom Steyer, a hedge fund manager and now campaigner against the \"corporate takeover of America\".\n\nThose scenes highlighted yet again what an extraordinarily bold bet many Democrats appear ready to take in 2020. They're saying, in effect, that the American voter has drifted further to the left than their counterparts in many European countries, and further to the left than the majority of Australians last May.\n\nFormer Labor Treasurer Wayne Swan, in Washington this week, has admitted to feeling \"some queasiness\" watching the big list of policies pushed by Democrats.\n\n“The policies are all urgent and correct, but they are too many, offering attack angles beyond a Republican strategist’s wildest dreams,\" he wrote in the US journal Democracy. \"The shape is right – but the sizing is wrong.\"\n\n\"I may be worried about nothing if the Democratic primary process does its job of whittling down the agenda to something more manageable, but I fear for the consequences if the Democratic primaries become a series of purity tests on policy that saddle an eventual nominee with too broad a policy terrain to be adequately defended.\"\n\nRick Wilson, a former Republican ad maker, put it another way, while chiding Democrats for failing to take the fight up to Donald Trump with a barrage of heavy-hitting TV, radio and digital advertising. \"Seriously people, the scripts write themselves,\" he observed.\n\nAdvertisement\n\nInstead, the impression from Tuesday's debate is of a party still figuring out how hard it wants to fight for the top prize.\n\nModerates, perhaps sensing one of their last opportunities, were notably more aggressive on the night.\n\nPete Buttigieg challenged Warren's medicare plans, saying Americans are not \"wrong when they say they want a choice\".\n\nAmy Klobuchar accused Warren of \"making Republican talking points right now in this room\".\n\n\"I appreciate Elizabeth's work, but the difference between a plan and a pipedream is getting something done,\" Klobuchar said.\n\nEven Beto O'Rourke took a shot, saying Warren \"sometimes is focused on being punitive\" to the rich rather than finding solutions.\n\nThe Democrats were at their strongest when they took on Trump directly, particularly over his decision last week to withdraw troops from Syria.\n\nButtigieg said Trump was not only undermining the sacrifice of American soldiers, he was \"betraying American values\". Kamala Harris accused the President of selling out the Kurds: \"When I am Commander-in-Chief we will stop this madness.\"\n\nCory Booker said Trump was turning the \"moral leadership of this country into a dumpster fire\", while Biden said \"we have erratic crazy President who knows not a damn thing about foreign policy\".\n\nIn the end, the debate may not shift the relative standings of the leading contenders. But there was push-back from the party's \"mid-westerners\", who urged a return to art of the possible rather than big progressive pipe-dreams.\n\nTo win back the rust-belt electorates Hillary Clinton lost in 2016, the party, said Klobuchar, will \"need to build a blue Democratic wall around those states and make Donald Trump pay for it\".", "description": "After more than a year of campaigning and four prime-time TV debates in less than four months there is still no stand-out Democrat contender to take on the US President.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2395%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_87%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/1c61d6765849d3f4f5a72ebc3c8812028b9ddf98", "published_at": "2019-10-16"}