{"pub": "dailybeast", "url": "https://thedailybeast.com/this-stacking-cookware-set-from-calphalon-are-the-best-pots-and-pans-i-have-ever-used", "downloaded_at": "2019-10-10 18:22:57.562297+00:00", "title": "These Are the Best Pots and Pans I Have Ever Used and I Use Them at Least Twice a Day", "language": "en", "text": "Three things about me: I have a wife and two kids. I work from home. I love cooking. Put it all together and what do you get? Lots of cooking, that’s what. And specifically lots of cooking using my 10-piece set of Calphalon Premier Space Saving Nonstick pots and pans.\n\nThat name has a fair amount to unpack, so let’s start with the “Calphalon.” That’s just the brand name, but if you know your way around all things culinary, you’ll know they make excellent wares. Premier? Well, anyone can call anything premier, it’s not an official term like, say, “organic,” but it’s merited here, especially as we reach the “space-saving” of it all.\n\nThe six-piece Premier Space Saving set can all be stacked in the space that would usually be occupied by a single 10-inch frying pan. The 8-inch pan, saucepan, and 3.5-quart pot sit one inside the other, with a lid and strainer that fit all but the largest pan resting in the stack as well. (And if you have the 10-piece set like I do, you can also make one single stack, but it gets a bit unwieldy, so just live with 10 pots, pans, and lids occupying the space of two standard frying pans.)\n\nMoving on to the nonstick. They’re nonstick—like truly minimal spray, oil, or butter needed during the cooking. But where these things are truly better than other cookware I’ve used is in the clean up. Even fried or baked-on food gunk (yes, they’re oven safe to 450º) lifts out with gentle pressure from a sponge or paper towel. And if that’s too much work for you, you can run these pots and pans through the dishwasher, though I never do because I want them to last for years.\n\nAnd I want them to last mostly because they’re awesome and I love them, but also because they’re expensive. Worth it? Totally. Now excuse me, I have a steak to sear. It’s a New York Strip, FYI. | Get it at Bed Bath & Beyond >\n\nNEWSLETTERS The Scouted Newsletter Product recommendations that'll make your life better and tips to help you shop smarter. Subscribe By Clicking \"Subscribe\" you agree to have read the Terms of Use and Privacy Policy\n\nScouted is internet shopping with a pulse. Follow us on Twitter and sign up for our newsletter for even more recommendations and exclusive content. Don’t forget to check out our coupon site to find more tech deals from Best Buy and Newegg. Please note that if you buy something featured in one of our posts, The Daily Beast may collect a share of sales.", "description": "This set gives you a high-quality, non-stick surface in a space-saving silhouette.", "authors": ["Steven John"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1570581135/baw22_ah0nkp", "published_at": "2019-10-09"}