{"pub": "independent", "url": "https://independent.co.uk/news/world/middle-east/israel-government-netanyahu-benny-gantz-coalition-a9168626.html", "downloaded_at": "2019-10-24 00:38:16.508832+00:00", "title": "Netanyahu’s rival Benny Gantz accepts mandate to try to form Israeli government", "language": "en", "text": "Israel’s president has officially tasked ex-army chief Benny Gantz with forming the country’s next government, the first time in a decade anyone besides Benjamin Netanyahu has been given the task.\n\nPresident Reuven Rivlin formally granted the mandate to Mr Gantz on Wednesday evening, giving his centrist Blue and White Party 28 days to try to assemble a ruling coalition.\n\nMr Netanyahu and his Likud Party had been tapped first but admitted on Monday they were unable to sweep a 61-seat majority of the parliament on their own. Neither were they able to strike a unity government deal with Blue and White – who refuse to work with the incumbent premier as he faces likely indictment charges.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIt is unclear if Mr Gantz will fare any better. His only hope is to form a coalition with the Likud, who continue to stick by their leader.\n\nShortly after the ceremony Mr Gantz vowed to establish a “liberal unity government”.\n\n“The government that I will establish will serve all citizens of Israel and will benefit all citizens of Israel,” he said in a statement.\n\n“In our home, the state of Israel, there is room for all segments of Israeli society,” he added.\n\nLikud agreed to meet Blue and White negotiators shortly afterwards but, in a tweet, hinted the party would not depart from a demand for a power-sharing deal between Mr Gantz, his fellow party leaders and Mr Netanyahu.\n\nBlue and White released a flurry of requests to meet party negotiators, some of which were approved. The religious parties and the right, however, declined, saying their bloc was represented by the Likud.\n\nThe September elections, the second vote in under six months, were inconclusive with neither Blue and White nor Likud, the two biggest parties, able to win enough seats to build a majority coalition in the 120-seat Knesset.\n\nMany fear a third election is on the horizon.\n\nMr Gantz, a lifelong military man, has presented himself as a practical leader who can bridge Israel’s many divisions and address the various security threats it faces.\n\nHis low-key campaign was in sharp contrast to Mr Netanyahu’s, who promised to annex large parts of the occupied West Bank in the final days.", "description": "Israel’s president has officially tasked ex-army chief Benny Gantz with forming the country’s next government, the first time in a decade anyone besides Benjamin Netanyahu has been given the task. President Reuven Rivlin formally granted the mandate to Mr Gantz on Wednesday evening, giving his centrist Blue and White Party 28 days to try to assemble a ruling coalition.", "authors": ["Bel Trew"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/23/20/whatsapp-image-2019-10-23-at-21.13.25.jpeg", "published_at": "2019-10-23"}