{"pub": "news24", "url": "https://sport24.co.za/Rugby/RugbyWorldCup2019/japan-forced-to-make-1-change-for-springbok-qf-20191018", "downloaded_at": "2019-10-18 05:00:39.395527+00:00", "title": "Japan forced to make 1 change for Springbok QF", "language": "en", "text": "Tokyo - Japan coach Jamie Joseph made one injury-enforced change to his starting XV for Sunday's Rugby World Cup quarter-final against South Africa, a game the former All Black described as \"massive\" for the tournament hosts.\n\nRyohei Yamanaka comes in at fullback to replace William Tupou, who drops out of the 23 after failing a head injury assessment in the final pool-stage 28-21 victory over Scotland.\n\nThere are five changes overall to the Brave Blossoms side that lost to 41-7 to South Africa in a World Cup warm-up game in September.\n\nStar winger Kotaro Matsushima, Shota Horie, Luke Thompson and skipper Michael Leitch were also in the starting XV when Japan recorded a shock pool victory over the Springboks in the 2015 World Cup.\n\n\"We won't be drawing on it at all,\" insisted Joseph. \"I've been trying to forget about that for four years!\n\n\"Yes, we have some players from then. And it was an amazing achievement.\n\n\"But we're working on our own things, I won't be alluding to that.\n\n\"This is a massive game for us.\"\n\nSkipper Michael Leitch echoed his coach's words, adding: \"Four years ago there was a different mentality going into the World Cup and we won three.\n\n\"Now we go into Tests believing we can win. The one thing that is different is the mentality of the players.\"\n\nJoseph explained that his players had had some time off in their build-up to the weekend's game, \"to let them absorb what they've achieved\" in becoming the first Asian team to make the quarter-finals.\n\n\"You always know what you get when you play South Africa,\" he added.\n\n\"It's clear what South Africa are going to do. Their team selection is a clear sign that they're approaching the game with a physical forward challenge.\"\n\nTheir tactics up until now, Joseph said, have included \"giving the opposition the ball and using their forwards in defence\".\n\n\"That's what we've been preparing for all week.\"\n\nJoseph confirmed Tupou had failed the medical protocols of his HIA, saying he had drafted in Wimpie van der Walt and Amanaki Mafi onto the bench to offer a more heavyweight option later in the game.\n\nLeitch said the team would not be satisfied with just \"being among the best eight teams in the competition\".\n\n\"The first goal was to get out of pool stage to get into the quarter-finals,\" the Kiwi-born flanker said.\n\n\"Now we've had to shift the goalposts.\n\n\"Every game for us is a final, every game we treated like our last game.\n\n\"We'll play South Africa and if we win, then we'll focus on next week.\n\n\"We're not satisfied with what we've got so far, we'll go out against South Africa and try to get the win.\"\n\nKick-off is at 12:15 (SA time) on Sunday.\n\nTeams:\n\nJapan\n\n15 Ryohei Yamanaka, 14 Kotaro Matsushima, 13 Timothy Lafaele, 12 Ryoto Nakamura, 11 Kenki Fukuoka, 10 Yu Tamura, 9 Yutaka Nagare, 8 Kazuki Himeno, 7 Lappies Labuschagne, 6 Michael Leitch (captain), 5 James Moore, 4 Luke Thompson, 3 Koo Ji-won, 2 Shota Horie, 1 Keita Inagaki\n\nSubstitutes: 16 Atsushi Sakate, 17 Isileli Nakajima, 18 Asaeli Ai Valu, 19 Wimpie van der Walt, 20 Amanaki Lelei Mafi, 21 Fumiaki Tanaka, 22 Rikiya Matsuda, 23 Lomano Lava Lemeki\n\nSouth Africa\n\n15 Willie le Roux, 14 Cheslin Kolbe, 13 Lukhanyo Am, 12 Damian de Allende, 11 Makazole Mapimpi, 10 Handre Pollard, 9 Faf de Klerk, 8 Duane Vermeulen, 7 Pieter-Steph du Toit, 6 Siya Kolisi (captain), 5 Lood de Jager, 4 Eben Etzebeth, 3 Frans Malherbe, 2 Bongi Mbonambi, 1 Tendai Mtawarira\n\nSubstitutes: 16 Malcolm Marx, 17 Steven Kitshoff, 18 Vincent Koch, 19 RG Snyman, 20 Franco Mostert, 21 Francois Louw, 22 Herschel Jantjies, 23 Frans Steyn", "description": "Japan coach Jamie Joseph made one injury-enforced change to his starting XV for their Rugby World Cup quarter-final against South Africa.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/2860/781f8b47cdf24b3cb3f11dc0e57d7094.jpg", "published_at": "2019-10-18"}