{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7563461/Giulianis-arrested-associates-boasted-meeting-just-8-meeting-Trump-White-House.html", "downloaded_at": "2019-10-12 00:25:28.933067+00:00", "title": "Giuliani's arrested associates boasted about meeting just 8 meeting Trump in the White House", "language": "en", "text": "A Rudy Giuliani associate who was arrested Thursday on campaign finance charges bragged about attending an exclusive dinner at the White House with President Donald Trump along with just a small group of people.\n\nThe claim is included in a Russian language media report unearthed by the campaign finance group who helped blow the lid on the alleged scheme to fund money to a pro-Trump super PAC.\n\nThe article was published May, 15, 2018 – just days after Ukraine-born businessman Lev Parnas posted pictures online thanking President Trump and proclaiming an 'incredible dinner' with 'even better conversation' at the White House.\n\nIgor Fruman shared photos of his meeting with President Trump\n\nUkrainian-born U.S. businessman Andrey Kukushkin, one of four people indicted in New York on charges of violating campaign finance law, stands between his attorney Alan Dressler (L) and Mr. Sovio, who is helping with the bail, as Judge Jacqueline Scott Corley (top R) looks on in a courtroom sketch as he appears in San Francisco Federal Court on Friday\n\nIt claims two men who did work for Trump lawyer Rudy Giuliani – Parnas and Igor Fruman – attended the dinner. President Donald Trump said Thursday on the day the pair were arrested and indicted that he didn't know the men, and brushed off an online trail of photos that show the president posing with them.\n\nAccording to the story, posted in an FEC complaint filed by the Campaign Legal Center, describes Fruman as a 'direct channel of direct communication between the Jewish community of Kiev and the President of the United States.'\n\nThe translated article in Russian language Ukraine paper New-Times touts Fruman as 'one of the largest private sponsors of the election campaign of Donald Trump' and quotes an 'exclusive interview' with him describing the closed meeting a week before.\n\nThe meeting was held in Washington, and it was attended by only eight people. Another participant in the meeting was an American businessman Lev Parnas, who, like Fruman, is a member of the American Friends of Anatevka Board of Trustees,' a reference to a Jewish charity the two men support.\n\n'It seems Fruman and Parnas used their powerful connections as a form of currency,' said Brendan Fischer of the Campaign Legal Center.\n\nClaims about the White House are included in a translated article in Russian attached to a campaign finance complaint\n\nFruman, who was arrested Thursday, bragged about attending a Trump fundraiser at the president's Mar-a-Lago club\n\nFruman and Parnas are accused of running an illegal campaign finance scheme\n\nThe article went on to describe some of the substance of the meeting. 'According to Igor Fruman, the conversation was about preparations for the victory in the midterm elections to the US Congress in November 2018. Each of the guests had the opportunity to speak on important topics for him, and Fruman raised the topics of America's support for Israel and Ukraine. The reaction of Donald Trump on both topics was absolutely positive.'\n\nThe complaint goes on to spell out political contributions engineered by the pair, including $325,000 to the pro-Trump America First Action, Inc. Federal prosecutors accuse the men of violating campaign finance laws by obscuring the actual source of this and other contributions.\n\nThe article citing Fruman appears to be at odds with Trump's own claims to the two men, who Trump lawyer Rudy Giuliani has said assisted him in his Ukraine investigation but are also clients of his.\n\n'I don't know them,' Trump insisted as he left the White House for Minneapolis Thursday.\n\nMike Pence, Igor Fruman, Lev Parnas, President Trump, and Rudy Giuliani are pictured in an image captured by the Organized Crime and Corruption Reporting Project\n\nDining at the White House: Lev Parnas bragged that he was a guest of Donald Trump in spring 2018 -\n\nLev Parnas and Igor Fruman were arrested and charged with campaign finance crimes in an indictment unsealed Thursday\n\nThe president tried to brush off a smiling photo he took with the men and Giuliani.\n\n'I have pictures with everybody. I don’t know if there’s anybody I don’t have pictures with,' Trump said. 'I don't know them. I don't know about them. I don't know what they do.'\n\nThe pair were arrested at Dulles Airport just before getting on a plane to Vienna, Austria - and a few hours after they were seen lunching with Giuliani at the Trump Hotel in Washington D.C.\n\nIn addition to helping Trump, the same super PAC spent millions to boost former Texas GOP Rep Pete Sessions, who wrote a letter calling for the firing of former U.S. ambassador to Ukraine Marie Yovanovich, who Trump trashed on his infamous July call with the Ukrainian president and who House Democrats want to interview Friday as part of their impeachment probe.\n\nThe article, from May of 2018, features a Hebrew prayer for Trump from the chief rabbi of Ukraine. Chief Rabbi of Kiev and Ukraine Moshe Reuven Asman said the prayer was in honor of Trump recognizing Jerusalem as the capital of Israel.\n\nThe article describes 'an unspoken channel of direct communication between the Jewish community of Kiev and the President of the United States. He is personified by Igor Fruman, an American businessman from Florida.'\n\nIt calls Fruman, a Florida businessman, 'one of the largest private sponsors of the election campaign of Donald Trump.'\n\n'At the end of the conversation, Igor Fruman handed over to the US President a personal handwritten letter with blessings from Chief Rabbi of Ukraine Moshe Reuven Asman,' it continues. 'Despite some violation of the formal protocol, Donald Trump took and read this letter, and then hid the message from Kiev in his breast pocket of his jacket.'", "description": "Rudy Giuliani associates Lev Parnas and Igor Fruman, who were arrested Thursday on on campaign finance charges, attended an intimate White House dinner with Trump,  a translated article claims.", "authors": ["Geoff Earle", "Deputy U.S. Political Editor For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/23/19596476-0-image-a-14_1570834528282.jpg", "published_at": "2019-10-11"}