{"pub": "indiatimes", "url": "https://indiatimes.com/news/india/stubble-burning-is-still-happening-in-punjab-haryana-and-elections-are-partly-to-be-blamed-367289.html", "downloaded_at": "2019-10-26 11:17:48.534438+00:00", "title": "Stubble Burning Is Still Happening In Punjab, Haryana And Elections Are Partly To Be Blamed", "language": "en", "text": "Stubble Burning Is Still Happening In Punjab, Haryana And Elections Are Partly To Be Blamed\n\nStubble Burning Is Still Happening In Punjab, Haryana And Elections Are Partly To Be Blamed\n\nDelhi and it's adjoining areas have seen some improvement in the toxic air quality in the past couple of days, thanks to some summer rains. But the improved air quality may not last long and could turn toxic in a matter of days as stubble burning, one of the main contributors of pollution in Delhi NCR, is back.\n\nDespite a ban and efforts from the government to discourage farmers from burning the crop residual, the practice is happening unchecked, in parts of Punjab and Haryana.\n\nAFP\n\nFarmers who claim that there is no adequate number of machines to process the crop residual on time to sow seeds for the next season are resorting to burning them.\n\nNASA’s fire mapper, which uses satellites to map the number of active fires in a region, shows that the instances of fires in Punjab and Haryana have risen in the last week.\n\nDon't Miss 2.6 K SHARES 413 SHARES\n\nAnother reason why the farmers are still burning the stubble is the lack of officials to enforce the ban.\n\nAccording to The Indian Express, most of the officials responsible for implementing these orders are on election duty.\n\nFarmers are reportedly taking advantage of this and is burning the residual. Fine particles from the blaze then get carried to Delhi and NCR, due to the winds blowing in the direction.\n\nAFP\n\nEarlier, the National Green Tribunal (NGT) has directed the Ministry of Agriculture to furnish a status report on the remedial action to be taken for curbing air pollution that results from stubble burning in Punjab, Haryana, Delhi, and Uttar Pradesh.\n\nThe bench headed by NGT chairperson Justice Adarsh Kumar Goel noted that the Ministry had failed to comply with previous orders and ordered that the report should be furnished within two weeks.", "description": "Delhi and adjoining areas have seen some improvement in the toxic air quality in the past couple of days, thanks to some summer rains. But the improved air quality may not last long and could turn toxic in a matter of days as stubble burning, one of the main contributors of the pollution in Delhi NCR is back. Despite a ban and efforts from the government to discourage farmers from burning the cro", "authors": ["Bobins Abraham"], "top_image": "https://media.indiatimes.in/media/facebook/2019/May/stubble_burning_1557914282_800x420.jpg", "published_at": "2019-05-15"}