{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/14/bernie-sanders-millionaire-slams-elizabeth-warren-", "downloaded_at": "2019-10-14 23:17:07.571755+00:00", "title": "Bernie Sanders, millionaire, slams Elizabeth Warren as dirty 'capitalist'", "language": "en", "text": "ANALYSIS/OPINION:\n\nOh, this is Just. So. Rich.\n\nAnd sad.\n\nIt’s the brewing battle of the socialists, Bernie Sanders v. Elizabeth Warren, as they each try to distance themselves as far, far, far as possible from that dirty — gasp, sputter, spit — capitalism.\n\n“There are differences between Elizabeth and myself,” Sanders said in a televised “This Week” interview over the weekend, Fox News reported.\n\nDo tell.\n\nWell, “Elizabeth,” he said, “I think, you know, has said that she is a capitalist through her bones. I’m not.”\n\nWhat!\n\nWarren a capitalist? Warren a self-declared capitalist? Perish the thought. This is, after all, Amerika — letter “k” intended.\n\nSanders‘ statement comes after Warren admitted a year ago, “I am a capitalist to my bones” — word “admitted” intended.\n\nHow sad that this is what the country’s come to — that political candidates vying for presidential nominations feel the need to run from a capitalist label.\n\nThis is how Sanders runs: “[I’m not a capitalist because I] will not tolerate for one second the kind of greed and corruption and income and wealth inequality and so much suffering that is going on in this country, today, which is unnecessary.”\n\nOh. What of this?\n\n“How Bernie Sanders, The Socialists Senator, Amassed A $2.5 Million Fortune,” Forbes wrote in April.\n\nIgnore that.\n\n“Bernie Sanders and his wife earned $1.7 million in past two years, returns show,” The Washington Post wrote in April.\n\nIgnore that, too.\n\n“Bernie Sanders Pockets $1 Million For Second Year in a Row,” Newsweek wrote in June of 2018.\n\nThat too. Ignore all that.\n\nThose are called: Inconvenient Truths.\n\nAs in: If you’re a socialist, you can write a book, market it on the campaign-funded trail and voila, earn a cool million — and still get by with denouncing capitalism and that dang racist, discriminatory, oppressive free market.\n\nAs in: If you’re a socialist, you can turn accusing fingers at those who threaten your political career and simply denounce them as dirty capitalists — even though they’re not. Not hardly. Even though they’re cut from the same socialist cloth.\n\nEven though they hate capitalism so much they’ve run a presidential campaign on the promise of getting Big Business and Wall Street. Warren, anyone?\n\nNo word, yet, on how Warren has responded to Sanders‘ vicious attack.\n\nBut make way for the fireworks.\n\n‘Cause if there’s one thing a socialist-slash-progressive-slash-Democrat-masquerading-as-an-American hates, it’s being called a capitalist.\n\nIt’s just tragic that this is the precipice where America now stands — at a spot where capitalism, a gift that’s enriched and benefited so many, and for so long, has become a dirty word. It’s just a travesty that making money in America using personal ingenuity, creativity, hard work and dedication has become a political albatross.\n\n• Cheryl Chumley can be reached at [email protected] or on Twitter @ckchumley.\n\nSign up for Daily Opinion Newsletter Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Oh, this is Just. So. Rich. And sad. It's the brewing battle of the socialists, Bernie Sanders v. Elizabeth Warren, as they each try to distance themselves as far, far, far as possible from that dirty -- gasp, sputter, spit -- capitalism.", "authors": ["The Washington Times Http", "Cheryl K. Chumley"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/04/Election_2020_Age_27123.jpg-160c4_c0-92-2213-1382_s1200x700.jpg?a069dceebf1c31b7a15b75cd6235f7539d37d08c", "published_at": "2019-10-14"}