{"pub": "thehill", "url": "https://thehill.com/policy/healthcare/public-global-health/465716-experts-say-vaping-illnesses-dont-extend-outside-us", "downloaded_at": "2019-10-14 23:23:43.164601+00:00", "title": "Experts say vaping illnesses don't extend outside US: report", "language": "en", "text": "Experts reportedly said the vaping illness affecting more than 1,000 people and causing at least 29 deaths is so far limited to the U.S.\n\nToxicology and addiction experts said the lung injuries related to vaping are \"a U.S.-specific phenomenon\" and that there is no evidence of the illness affecting people in Britain or other countries, Reuters reported.\n\nADVERTISEMENT\n\nHealth officials have announced there may be multiple causes for the vaping lung illness but have specifically pointed to vaping oils containing THC, a marijuana ingredient.\n\n“What’s happening in the U.S. is not happening here [in Britain], nor is it happening in any other countries where vaping is common,” said John Britton, the director of the U.K. Centre for Tobacco & Alcohol Studies at Nottingham University, according to Reuters.\n\nReuters reported that Britain has an estimated 3.6 million regular e-cigarette users, but THC oils are banned in the country, and advertising is more tightly monitored there than it is in the U.S.\n\nThe number of cigarette users in Britain is decreasing faster than it is in the U.S., experts said, because of users transferring to e-cigarettes.\n\n“It would be a great shame if people were deterred from using e-cigarettes because of what’s happening in the U.S.,” Ann McNeill, a professor of tobacco addiction at the Institute of Psychiatry, Psychology & Neuroscience at King's College London, said.\n\nSeveral states have banned flavored e-cigarettes, including Michigan and New York, amid fears of the increased number of vaping illness cases.\n\nPresident Trump Donald John TrumpWHCA calls on Trump to denounce video depicting him shooting media outlets Video of fake Trump shooting members of media shown at his Miami resort: report Trump hits Fox News's Chris Wallace over Ukraine coverage MORE announced last month that his administration plans to prevent flavored e-cigarettes from being sold after the number of teenagers who reported vaping jumped.", "description": "Experts reportedly said the vaping illness affecting more than 1,000 people and causing at least 29 deaths is so far limited to the U.S.", "authors": [], "top_image": "https://thehill.com/sites/default/files/vaping.vape_.ecig_.jpg", "published_at": "2019-10-14"}