{"pub": "foxnews", "url": "https://foxnews.com/us/ohio-woman-killing-newborn-text-mom-burying-baby-prosecutors", "downloaded_at": "2019-09-05 00:07:09.466309+00:00", "published_at": "2019-09-04", "title": "Ohio woman texted mom after killing newborn saying she was happy 'my belly is back OMG,' prosecutors say", "language": "en", "text": "Hours after allegedly killing her newborn daughter and secretly burying the remains in her family’s backyard, an Ohio woman texted her mom: \"My belly is back OMG,\" prosecutors say.\n\nOpening statements in the case of Brooke Skylar Richardson, now 20, began Wednesday in a Warren County Court where she faces several charges, including aggravated murder, involuntary manslaughter, endangering a child, tampering with evidence and gross abuse of a corpse in the 2017 death.\n\nTEEN ON HOUSE ARREST ACCUSED OF KILLING BABY SPARKS ANGER AFTER SPOTTED DINING OUT\n\nAssistant prosecutor Steven Knippen told the court about texts messages Richardson allegedly sent to her mother hours after the child was buried, stating how she was “speechless” to have her body “back,” according to a court reporter for Butler County’s Journal-News.\n\n\"I am literally speechless with how happy I am my belly is back OMG ... \" the text read.\n\nProsecutors say Richardson, a high school cheerleader, was informed by her doctor in April 2017 that she was pregnant and would be giving birth in a “matter of weeks,” FOX19 reported.\n\nThe then-18-year-old became extremely upset and told her doctor that she could not have the child and asked that she not tell anyone.\n\nDays later, on May 7, she gave birth in the middle of the night. Prosecutors say she killed the baby and buried it in the backyard by a barbeque pit, disposing of all evidence.\n\nMINNESOTA MAN CHARGED WITH MURDER AFTER DROPPING INFANT SON ON HEAD FOR BEING ‘DIFFICULT’: REPORT\n\nA doctor notified police in July after Richardson returned to refill her birth control pills, unaware that this new doctor had been informed by her previous one about the pregnancy. Richardson was confronted and eventually confessed to burying the child.\n\nProsecutors said Wednesday that Richardson’s mother was obsessed with her appearance and constantly monitored her weight. They said the doctor’s office accidentally sent her an email about the woman’s pregnancy.\n\nRichardson’s defense team claims that the child was stillborn and the woman reacted appropriately when she found out so late in the pregnancy that she was expecting. Her lawyer argued she suffered from eating disorders which affected her weight and menstrual cycle - making the clues harder to detect.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe defense said that Richardson named the child, buried her and placed flowers over the grave, according to the Journal-News court reporter.\n\nOpening statements on Wednesday were followed by testimony from three witnesses.\n\nIf convicted, Richardson could face up to life in prison.", "description": "Hours after allegedly killing her newborn daughter and secretly burying the remains in her family’s backyard, prosecutors say, an Ohio woman texted her mom: \"My belly is back OMG.”", "authors": ["Paulina Dedaj", "Paulina Dedaj Is A Writer", "Reporter For Fox News. Follow Her On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/ap17216822586831.jpg"}