{"pub": "yahoo", "url": "https://news.yahoo.com/countdown-divorce-meetings-decide-brexit-103335216.html", "downloaded_at": "2019-10-13 12:25:04.228478+00:00", "title": "Countdown to divorce: Meetings that will decide Brexit", "language": "en", "text": "LONDON, Oct 13 (Reuters) - The following events will determine whether Britain exits the European Union as planned on Oct. 31 or the three-year-old Brexit saga takes another twist.\n\n\n\n\n\nOct. 13 - German Chancellor Angela Merkel and French President Emmanuel Macron meet at the Elysee Palace to prepare for upcoming summits where Brexit will top the agenda. If the EU is to make a breakthrough concession on the terms of Britain's exit from the blloc, it will require the blessing of the bloc's two most influential members.\n\n\n\n\n\nOct 13-14 - The 27 EU ambassadors are briefed by EU chief Brexit negotiator Michel Barnier after a weekend of intensive, so-called \"tunnel\" talks with Britain.\n\n\n\n\n\nOct. 14 – British parliament reconvenes, setting the stage for further attempts by lawmakers to ensure the Oct. 31 deadline for withdrawal is extended, regardless of Prime Minister Boris Johnson's promise that the UK will leave on that date, deal or no deal. Johnson's legislative agenda will be set out by the British monarch in the traditional Queen's Speech. - French President Macron meets European Council chief Donald Tusk in Paris to discuss issues including Brexit.\n\n\n\n\n\nOct. 15 - European affairs ministers from the EU27 discuss the state of play of Brexit with an update from Barnier to prepare the leaders' summit of Oct. 17-18.\n\n\n\n\n\nOct. 16 - France and Germany hold their annual summit. It is an opportunity for ministers from both countries to discuss a range of bilateral issues, but Brexit will be sure to figure prominently in these discussions.\n\n\n\n\n\nOct. 17-18 - EU government leaders meet in Brussels for a European Council summit. If a Brexit agreement is struck, it will have to be approved by the British parliament.\n\nThe summit agenda also includes the bloc's next long-term budget from 2021, its troubled relationship with Turkey, the EU membership prospects of Albania and North Macedonia, as well as ambitious climate policies.\n\n\n\n\n\nOct. 19 – The British parliament will hold a special Saturday sitting to decide what to do - or to vote on a deal.\n\nIf the stalemate is not broken at this point, a law recently passed by the parliament dictates that London must ask the EU to extend the Oct. 31 deadline to Jan. 31 – a period in which a national election may be held to try to break the Brexit deadlock.\n\nIf parliament approves a deal, then it will rush to approve additional legislation needed for Brexit to take place in an orderly way.\n\nThe last time parliament sat on a Saturday was in 1982 after Argentina invaded the Falkland Islands in the South Atlantic.\n\nOpponents of Brexit will march through central London to demand another referendum.\n\n\n\n\n\nLate October – EU diplomats and officials expect an extraordinary summit of EU leaders before Oct. 31. If there is no deadline extension and no agreed divorce, they will use such a summit to make final preparations for a rocky, no-deal split.\n\n\n\n\n\nOct 31 – Unless this deadline is extended, Britain will cease to be an EU member at 2300 GMT. (Writing by Mark Bendeich and Guy Faulconbridge Editing by Mark Heinrich)", "description": "The following events will determine whether Britain exits the European Union as planned on Oct. 31 or the three-year-old Brexit saga takes another twist.  Oct. 13 - German Chancellor Angela Merkel and French President Emmanuel Macron meet at the Elysee Palace to prepare for upcoming summits where Brexit", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-13"}