{"pub": "marketwatch", "url": "https://marketwatch.com/story/facebook-confirms-ar-glasses-reveals-new-mapping-project-2019-09-25?mod=rsswn", "downloaded_at": "2019-09-25 23:27:43.906290+00:00", "title": "Facebook confirms AR glasses, reveals new mapping project", "language": "en", "text": "Facebook Inc. confirmed on Wednesday it is developing augmented reality glasses that should be ready in a few years, and announced a project called “Live Maps” that will create 3-D maps of the world.\n\nAndrew “Boz” Bosworth, vice president of AR/VR at Facebook FB, +0.84% , described the maps project as “a shared virtual map of the world” at the Oculus Connect developer conference, a get-together that normally generates modest headlines but got a whole lot more attention after Facebook late Monday said it had acquired a startup that would let people control computers with their brains.\n\nThe proposed acquisition of CTRL-Labs, a 4-year-old company developing software and a bracelet that measures neuron activity in a subject’s arm, has raised interest in the annual AR/VR conference as well as alarms among lawmakers and privacy advocates concerned about how the social-networking giant sucks up the data of billions of people.\n\nHow Facebook folds CTRL-Labs, which is designing a hands-free pair of AR glasses of its own, into its Facebook Reality Labs division is sure to be closely scrutinized. Facebook already is the subject of a Federal Trade Commission investigation after it reached a $5 billion settlement with the FTC earlier this year over data-privacy practices.\n\nLast week, members of Congress met privately with Facebook Chief Executive Mark Zuckerberg to voice their concerns over Facebook’s economic power and its privacy issues. The company acknowledged in a blog post on Friday that it had suspended “tens of thousands” of apps for potentially improper data-collection methods.\n\nRead more: Facebook says ‘tens of thousands’ of apps suspended over privacy issues\n\nA video of Live Maps depicted “multi-layer representations of the world” such as projected holographic avatars to hang out with through traditional maps, crowdsourced data, and footage captured via AR glasses and smartphones. It’s the type of Big Brother-like technology that got Alphabet Inc.’s GOOGL, +2.27% GOOG, +2.28% Google’s Street View system into legal hot water.\n\nBosworth gave no timetable on the availability of Live Maps, which he said would “bridge the physical and digital divides.”\n\nAt the same time, rumors have swirled around Facebook’s AR glasses in recent days. One recent rumor: It is teaming with Ray-Ban to deliver a pair of specs that can live stream the world around you.", "description": "Facebook Inc. confirmed on Wednesday it is developing augmented reality glasses that should be ready in a few years, and announced a project called “Live...", "authors": ["Jon Swartz", "Senior Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS076_Facebo_ZG_20190925165920.jpg", "published_at": "2019-09-25"}