{"pub": "realclearpolitics", "url": "https://nypost.com/2019/10/06/devine-donald-trumps-lesson-for-mitt-romney", "downloaded_at": "2019-10-08 12:09:40.160027+00:00", "title": "Devine: Donald Trump’s lesson for Mitt Romney", "language": "en", "text": "Genteel Republicans like Mitt Romney complain about Donald Trump’s unpresidential behavior, but how else does he combat the dirty left?\n\nOnly a barbarian could defy the liberal establishment as he has done.\n\nImagine if Romney were president, trying to be dignified and patrician. They’d eat him alive. Unless, of course, he did nothing to block their agenda, in which case he’d be left alone like all the other cowardly roll-over Republicans.\n\nThe American people chose a barbarian for president because they knew only a barbarian could drain the Washington swamp.\n\nAnd, judging by the president’s unchanged approval ratings since House Democrats launched their impeachment inquiry, not to mention his record donation take on the back of it, Trump fans are with him for the long haul, no matter how boorishly he behaves.\n\nThey see him implementing his agenda against all odds. If the swamp gets in his way, Trump bulldozes over it. Supreme Court, tick. Taxes cut, tick. Regulations slashed, tick. Jobs up, tick. Military rebuilt, tick. ISIS stopped, tick. Globalism challenged, tick. Paris climate treaty scrapped, tick. Borders strengthened, tick. Wall built, half-tick.\n\nAll while the Washington establishment tries to sabotage his presidency and the liberal media reviles him.\n\nHe is Teflon Don, energized by a battle that would have broken a genteel Republican long ago.\n\nThat’s why the Dems are afraid and it’s why they’re projecting like crazy. This is the disease of the left.\n\nThe legendary Austrian psychoanalyst Sigmund Freud defined “projection” as a psychological defense mechanism in which people repress their own shameful thoughts and impulses by attributing them to others.\n\nAlso known as “shame-dumping,” projection is a form of denial, or “negation,” as Freud called it in a 1925 paper.\n\nExamples of Freudian projection include a rude person accusing others of being rude or an adulterer accusing his wife of cheating on him.\n\nThe psychiatric bible, the Diagnostic and Statistical Manual of Mental Disorders, says projection shifts your “own undesirable thoughts, motivations, desires, feelings onto someone else.”\n\nIt may help you deal with “unconscious feelings of shame and inadequacy,” according to a 2017 paper on “maladaptive personalities” in the journal Frontiers in Psychology.\n\nsee also Trump has snit fit over ‘ass’ Mitt Romney President Trump lashed out at Sen. Mitt Romney as a...\n\nSo, when you hear liberals constantly accuse their ideological enemies, without evidence, of such thought crimes as racism, sexism, xenophobia and bigotry, chances are they’re projecting.\n\nIn the case of Democrats, they constantly accuse Trump of sins they have themselves committed.\n\nFor example, Joe Biden wrote a weekend op-ed accusing Trump of “abusing the power of the presidency … He is using the highest office in the land to advance his personal interests.”\n\nYet Biden is in denial about allegations that he abused the power of the vice presidency to advance his son’s personal interests.\n\nAt the very least, “Quid Pro Joe,” as Twitter has dubbed him, had a conflict of interest when, in 2014, shortly after he visited Ukraine as vice president to urge increased production of natural gas, his son Hunter joined the board of a Ukrainian natural gas company, and was paid $50,000 a month despite having no discernible expertise.\n\nBut Biden was outraged when he was quizzed about the conflict of interest by reporters in Los Angeles last week: “I’m not going to respond to that. Let’s focus on the problem. Focus on this man, what he’s doing that no president has ever done.”\n\nClassic projection.\n\nOr take House Intelligence Committee Chairman Adam Schiff, caught fibbing to “Morning Joe” two weeks ago over Trump’s call to Ukrainian President Volodymyr Zelensky: “We have not spoken directly with the whistleblower.”\n\nTurns out Schiff knew about the whistleblower’s concerns days before the complaint was filed about Trump’s not-so-perfect call. One of his staffers even advised the whistleblower, according to the New York Times.\n\nYet Schiff is the guy who spent the past two years accusing Trump of “deception” and “collusion.”\n\n“When accusing others of lying, best not to misrepresent facts yourself,” he tweeted last year.\n\nClassic projection.\n\nRep. Alexandria Ocasio-Cortez on Saturday branded Trump an anti-Semite for criticizing Schiff. Yet she tosses around terms like “concentration camp” for political effect and never calls out fellow Squad sisters Rashida Tlaib and Ilhan Omar, who trade in such anti-Semitic rhetoric that they were banned from visiting Israel and even chastised by Democratic heavy Jerry Nadler.\n\nClassic projection.\n\nThen there is #MeToo. It’s hard to ignore how many high-profile perverts are liberals who bought themselves protection by mouthing liberal platitudes and funding Democratic causes.\n\nHollywood is the most liberal enclave in America, yet the Sony Pictures hack attack of 2014 exposed the racism and sexism under the politically correct facade. Here were studio executives proudly contributing to President Barack Obama’s campaigns while making racist jokes about him with colleagues.\n\nLiberals are obsessed with identity politics yet stoke racial tensions to gain power. They are obsessed with diversity yet impose a stifling intellectual conformity on our cultural institutions.\n\nIn their frenzied projection of their own flaws onto the president, their Freudian slips are showing.\n\nOutrage should’ve been swift\n\nAOC didn’t know if she was being pranked when a woman at her Queens district town hall wailed that we should be “eating babies” to avert climate catastrophe.\n\n“We only have a few months left,” the distraught audience member said in a video that has gone viral. “I love that you support the Green Deal, but it’s not going to get rid of fossil fuel … fast enough … So, I think your next campaign slogan needs to be this: ‘We’ve got to start eating babies.’”\n\nThe fringe right-wing LaRouche PAC soon declared it was a prank.\n\nBut AOC’s initial response was instructive. She didn’t dismiss the idea of infant cannibalism as repellent, but humored the woman with a neutral answer.\n\n“Well, we have more than a few months,” she said, as if it were simply timing that ruled against baby-eating.\n\n#HeToo a #MeToo victim\n\nNewspaper icon Bob Woodward did a couple of New York Times authors a favor last week by helping launch their #MeToo book, “She Said,” at a Washington, DC, literary event.\n\nHe sat onstage with Jodi Kantor and Megan Twohey and interviewed them about their investigation into sexual assault allegations against Hollywood mogul Harvey Weinstein. But, proving that no good deed goes unpunished, Woodward was heckled and shouted down by snowflakes in the audience for asking probing questions, including about Weinstein’s motivation, which you would think would be an essential part of the story.\n\nCommitting actual journalism is a fraught business these days", "description": "Genteel Republicans like Mitt Romney complain about Donald Trump’s unpresidential behavior but how else does he combat the dirty left?", "authors": ["Miranda Devine", "October"], "top_image": "https://thenypost.files.wordpress.com/2019/10/mitt-romney.jpg?quality=90&strip=all&w=1200", "published_at": "2019-10-06"}