{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/23/technology-is-remaking-how-we-see-the-ancient-art-", "downloaded_at": "2019-10-23 17:18:25.055000+00:00", "title": "Technology is remaking how we see the ancient art of theater", "language": "en", "text": "NEW YORK (AP) - When James Corden kicked off the Tony Awards this year, his opening number was a full-throated endorsement of the live theatrical experience.\n\n“It’s live, we do it live, and every single moment’s unrepeatable,” the late-night TV host sang. “There is a visceral bliss you only get in a theater seeing people do this.”\n\nTurns out he wasn’t correct.\n\nThese days, you can watch a Broadway musical from a subway train seat. You can get your stage fix at your local movie theater or hear a play while jogging.\n\nTheater just isn’t what it used to be.\n\nMedia companies armed with the latest in technology like Fathom Events, Audible Inc. and BroadwayHD are reshaping the experience, evolving it past the quaint notion of patrons filing into an arena, turning off their phones and sitting quietly in the dark.\n\nKicking yourself that you never saw the musical “Kinky Boots” or the play “Fleabag”? Relax. Cinema distributor Fathom has you covered. Can’t wait for the live-action “Cats” movie? Then watch a stage version while cuddling your own cat on th couch, thanks to digital theater streaming network BroadwayHD. Or, if you’re in a more serious mood, put on your headphones and listen to the play “True West,” co-starring Kit Harrington, via Audible.\n\n“We’re really going into a place where I hope people look at what theater is differently,” said Kate Navin, who leads the theater initiative at Audible, the world’s largest producer of audiobooks and spoken-word entertainment.\n\nThe prices can’t be beat: A Fathom screening will cost you $20, a monthly subscription to BroadwayHD runs $8.99 and an audio play costs $7.95 - all a fraction of a Broadway ticket, which can run you hundreds of dollars.\n\nBroadcasting Broadway shows on TV is nothing new, of course. PBS’s “Great Performances” has been doing it for 40 years. But BroadwayHD argues they’re using the latest technology to make their shows pop.\n\nIf rivals rely on a few cameras capturing the stage from the same couple of angles, BroadwayHD promises the “best seat in the house” for each and every scene. For “42nd Street,” it used eight different 4K cameras, shot three different performances and used extra footage to augment them.\n\nThese media companies are also changing what success means in the theater world, which usually means total tickets sold. Carey Mulligan’s short run of “Girls & Boys” at the small Minetta Lane Theatre in 2018 was well-received but its subsequent reach was much wider than what was captured at the box office.\n\nThe Audible audio version of her play has sold the equivalent of 26 sold-out weeks at Broadway’s Booth Theatre, which seats 770. “The traditional ways of evaluating whether or not a run was successful don’t really apply anymore,” said Navin.\n\nAudible has made a strong push into theater, not only recording dozens of in-studio plays but also commissioning writers and staging works at its off-Broadway venue, the 400-seat Minetta Lane Theatre. It is perfecting a form of theater without visuals.\n\nNot everything on stage can work as an audio download. Plays with big visual effects are hard. So are farces. “But really because theater is the art of language, a lot of it works,” said Navin. “We’re not trying to replace the live experience. What we really think this will do is expand the audience.”\n\nIf Audible skips the optics in favor of a private sonic drama, Fathom embraces the visual and communal parts of theater. It distributes big Broadway musicals like “Bandstand” and “Newsies” and often partners with the United Kingdom’s National Theater Live to put shows on 40-foot movie theater screens.\n\nFathom, which is owned by the cinema chains AMC, Cinemark and Regal, offers fans a place to gather and celebrate, whether it’s coming dressed as zombies to watch a season ending episode of “The Walking Dead,” getting romantic watching the latest British royal wedding live (with tea and crumpets served) or cheering diversity at a screening of “Kinky Boots.”\n\n“To see people sitting there applauding at the end of an act or at the end of a song as if they were there in that Broadway theater, that is just an awesome experience that you can’t replicate at home,” said Ray Nutt, CEO of Fathom.\n\nBroadwayHD is hoping it that it can, in fact, replicate exactly that - streaming full-length plays and musicals like “The Phantom of the Opera” and “Les Miserables” to your laptop, TV, phone or tablet. The company was the first to live broadcast a Broadway show - “She Loves Me” with Laura Benanti - and recently captured a big and bold production of “42nd Street” from London.\n\nStewart F. Lane and Bonnie Comley founded the company in 2015 with a focus on shows with limited runs - often with a celebrity or two - as well as shows that are closing imminently. They work carefully with theater producers to ensure cannibalization of tickets to the live show doesn’t happen.\n\n“We’re not in any way trying to kill the goose that lays the golden egg,” said Comley. “What we’re trying to do is make this available, make it a marketing asset, make it another way for the audiences to have a touchpoint with these brands.”\n\nBroadwayHD, which has some 300 shows, is for subscribers who can’t fly to New York, can’t afford pricey tickets or simply don’t want to navigate Times Square. It offers closed-captioning for the hearing impaired and a chance for theater lovers across the world to see a treasured title come to life.\n\n“Once the shows close, people tend to forget what it looked like, tend to forget how big the cast was, what the set looked like,” said Lane. “You actually have a reference now to actually use to see whether it would fit on their stage and whether they’d want to do the show.”\n\nSome Broadway producers love the idea and some are colder. Many are in the middle, like Mike Bosner, who has produced “Beautiful: The Carole King Musical” and the recent revival of “Sunset Boulevard” with Glenn Close.\n\n“Honestly, I’m not trying to be coy about this. I really don’t have an opinion on it. I go back and forth on it because one side of me says theater is meant to be live and it’s meant to be experienced and it’s meant to live on only in the archives,” he said.\n\n“But the plus side when they do that type of thing is you’re bringing it to many people around the world that may not get the opportunity to go see that show in any other way.”\n\nOther media companies are taking note: Nickelodeon is reforming the Broadway cast of “The SpongeBob Musical” and will film it in front of a live theater audience for a December broadcast. On Netflix, you can catch Kerry Washington in the play “American Son” and Bruce Springsteen’s Broadway show, both now closed.\n\nAll these companies are helping remake one of the most ancient of art forms, redefining it by playing with its elements - visual, communal and live. The result is something more democratic - and evolving.\n\n“I think once you get outside the New York bubble, people think that theater is very elitist, inaccessible, for the highly educated. It doesn’t mean that,” Navin said. “It means something different. Just like TV doesn’t mean one thing.”\n\n___\n\nMark Kennedy is at http://twitter.com/KennedyTwits\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "When James Corden kicked off the Tony Awards this year, his opening number was a full-throated endorsement of the live theatrical experience.", "authors": ["The Washington Times Http", "Mark Kennedy"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/23/theater_thats_not_live_29993_c0-494-6728-4418_s1200x700.jpg?8640c83ffc5776856e089da2eef1afd3b9d0a739", "published_at": "2019-10-23"}