{"pub": "reuters", "url": "https://af.reuters.com/article/sportsNews/idAFKCN1WK04A-OZASP", "downloaded_at": "2019-10-05 12:20:40.401698+00:00", "title": "Seven-try Australia rout Uruguay to inch towards quarters", "language": "en", "text": "OITA, Japan (Reuters) - Twice champions Australia overcame a sloppy start to crush Uruguay 45-10 on Saturday, forging towards the World Cup quarter-finals with some exhilarating running rugby despite their problems with high tackles resurfacing at Oita Stadium.\n\nAustralia's Will Genia scores their fifth try REUTERS/Peter Cziborra\n\nWrecking ball centre Tevita Kuridrani and Dane Haylett-Petty each crossed twice each, with teenage winger Jordan Petaia sparkling with a try on debut under the domed roof.\n\nScrumhalf Will Genia and prop James Slipper also grabbed five-pointers for the Wallabies, who shrugged off the heartbreak of their Wales defeat with flair and determination.\n\nAustralia had terrible trouble getting low enough in their tackling, with both lock Adam Coleman and loose forward Lukhan Salakaia-Loto given yellow cards for going high in an eventful opening half.\n\nBut the Wallabies were able to mitigate the damage with three tries to lead 19-3 at the break before throwing down the hammer in a dominant second half.\n\nThe result put Australia back on track for the quarter-finals, moving them top of Pool D ahead of second-placed Wales and putting pressure on the Welsh to beat Fiji at the same venue on Wednesday.\n\nIt was a tough day for Uruguay, desperate to impress the powers of global rugby, but they were rewarded with a late try to Manuel Diana in the final minutes.\n\nThe South Americans will take heart from not conceding as many points as they did in the 2015 World Cup, when they lost 65-3 to the Wallabies.\n\nAustralia, with 12 changes to the starting side that lost 29-25 to Wales, entered the game with some concern and a touch of farce.\n\nReplacement back James O’Connor was withdrawn due to a cork injury prior to the game and was replaced by Samu Kerevi on the bench.\n\nNumber eight Dempsey and Salakaia-Loto were forced to swap jersey numbers due to an “embroidery mishap” on the World Cup debut of the team’s mainly green indigenous jersey, though both played their starting positions.\n\nA stroke of fortunate created Australia’s first try, with a ricochet off the boot of Kurtley Beale taking the ball to the try-line.\n\nWith the defence scrambling, Australia whipped the ball cross-field where unmarked winger Haylett-Petty jogged over at the right corner for an easy score in the sixth minute.\n\nUruguay battled back, with Felipe Berchesi slotting a penalty when captain Michael Hooper put a high tackle on Nicolas Freitas as the winger darted toward the line.\n\nA minute later, Australia were down a man, when Coleman was given a yellow card for also going high on fullback Rodrigo Silva.\n\nThe action bypassed Petaia in the opening quarter, but he made an impact with his first touch, rumbling the ball toward the line, then linking up with Beale a moment later to sidestep two defenders and pirouette over the line for a 24th minute try.\n\nBeale escaped a yellow for a high tackle but Salakaia-Loto was not so lucky, being sent off for what seemed a less egregious offence a few minutes after Coleman had returned to the field.\n\nAgain, Australia brushed off the setback, with the powerfully built Petaia bursting through on the left wing and offloading to Kuridrani for a try on the half-hour mark.\n\nUruguay would not lie down, though, and a huge roar echoed under the domed roof when centre Tomas Inciarte charged down the right wing for a turnover try a minute before halftime.\n\nIt was to a fleeting moment of triumph for the South Americans, however, with the try cancelled by a video review which showed Diana was off-side when he plucked the ball from the ruck.\n\nAustralia came out with renewed intent and needed only six minutes to claim the bonus point, with Kuridrani waltzing through a huge hole at midfield to cross near the right corner.\n\nThe game then descended into a training run for the Wallabies as green and gold jerseys began punching holes through the Uruguayan line at will.\n\nDempsey burst through on the right wing to put Genia over in the 53rd minute, then the same pair combined near the try-line, allowing prop Slipper to rumble over from two metres out.\n\nDiana raised belated cheers for the Uruguayan sympathisers as he barrelled over after five minutes of sustained pressure on the try-line.", "description": "Twice champions Australia overcame a sloppy start to crush Uruguay 45-10 on Saturday, forging towards the World Cup quarter-finals with some exhilarating running rugby despite their problems with high tackles resurfacing at Oita Stadium.", "authors": ["Ian Ransom", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191005&t=2&i=1437319673&w=1200&r=LYNXNPEF9404Z-OZASP", "published_at": "2019-10-05"}