{"pub": "bbc", "title": "Masters of the pyramid: The dogs reclaiming their heritage", "url": "https://bbc.com/news/world-latin-america-49471593", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:14:57.806751+00:00", "text": "Image caption Hairless dogs like Sumac were once a key part of Peru's pre-Columbian culture\n\nSumac's name may mean \"pretty\" in Peru's native language, but there is no denying it: she is ugly.\n\nShe is a \"perro peruano sin pelo\", a Peruvian hairless dog with wrinkly leather skin and sparse patches of hair. She and her other hairless friend, Munay, meaning \"loved by everyone\", spend their days wandering their home: Lima's ancient pyramid of Huaca Pucllana.\n\nThat is because a few decades ago the breed was on the brink of extinction and in 2000 the Peruvian government declared the bald dogs part of the country's cultural heritage.\n\nA year later, it announced that at least one of the breed had to live in each archaeological museum site along the Peruvian coast.\n\nThe goal, said Huaca Pucllana archaeologist Mirella Ganoza, was to reclaim a piece of Peruvian culture before it faded away completely.\n\n\"What we began to realise is that to have them here was to have something of our own,\" she says. \"It's a way to show our identity.\"\n\n'Satanic creatures'\n\nThe Peruvian hairless dog was once a main part of the country's culture dating back thousands of years to pre-Columbian times.\n\nImage caption The clue is in the name, Peruvian hairless dogs are not exactly blessed with dense fur\n\nDogs like Sumac and Munay appeared frequently in the paintings, pottery and iconography of the Inca, Moche, Wari and Chimu cultures, always portrayed as a companion, and always as bald as an eagle.\n\nYou may also be interested in:\n\nBreeders call them \"primitive dogs\" because they are among a small set of breeds whose genetic characteristics have not changed over thousands of years of existence. One breeder went as far as to call them \"as important as Machu Picchu\" to Peruvian culture.\n\nThey were a common sight when the Spanish conquistadors arrived on the shores of Peru in 1532 with a lust for gold and silver and a goal to wipe out the country's indigenous culture and replace it with Catholicism.\n\nWhen they saw the hairless dogs, they said the ugly breed - with their protruding teeth and tongues naturally sticking out the side of their mouths and clusters of hairs and warts speckling black, brown and spotted skin - was something evil that must be eliminated.\n\nImage caption Sumac and Munay think they are good dogs deserving of a treat or two\n\n\"They [the Spanish] thought they were satanic, that's what Catholic worshipers called them,\" Ms Ganoza says. \"They believed that these dogs had something sinister inside them because they were so strange.\"\n\nOver the centuries, the dogs slowly died off and faded from the public consciousness. They were no longer beloved Peruvian pets, but bald street dogs that should be ignored, disassociated from the culture. Ms Ganoza remembers as a child being told they were \"perros chinos\", Chinese dogs brought over with a wave of immigrants in the 19th and 20th centuries.\n\nTurning point\n\nBut that began to shift in the 1990s when a movement slowly took hold to reclaim the dogs, and the perros peruanos sin pelo started entering the homes and hearts of Peruvians once again.\n\nImage caption Sumac has become a beloved addition to the archaeological site\n\nWhen the Peruvian government established the law requiring dogs like Sumac and Munay to live in the archaeological museum sites, it marked a turning point.\n\nToday, the breed is widely adored across Peru.\n\nThe country has established the National Committee for the Protection of the Hairless Peruvian Dog and on 12 June - the day the dog was acknowledged as an official breed - celebrates Hairless Peruvian Dog Day.\n\nIn Sumac and Munay's home, they are beloved among tourists and park workers.\n\nThe dogs wander around Huaca Pucllana - a massive clay and adobe pyramid constructed by a pre-Incan indigenous civilization around AD 500 - as if it were any old suburban home. They run along its fence, barking at dogs and people passing by.\n\nWearing T-shirts in the colours of the Peruvian flag, three-year-old Sumac bounces around park workers in a high-energy play stance while 10-year-old Munay wanders up to tourists for love, his tail nervously between his legs. They follow archaeologists as they continue to excavate the ruins and tour guides occasionally stop to explain the story of the breed.\n\nImage caption The history of Sumac and Munay's breed has become part of the guided tours\n\nThey have even adopted a \"mother\": park worker Delia Zyomee Huemon, 53, who cradles Sumac in her arms as the dog playfully chews on the sleeve of her jacket.\n\n\"In the morning I clean their beds and prepare their food. I also have to clean the other animal pens, the llamas, and they always follow me around,\" she says, looking down at the wagging dog. \"They love me a lot.\"\n\nWhile the dogs can be mischievous and have big personalities, they also embody something bigger for the park, argue Ms Ganoza and Ms Huemon.\n\n\"The idea was … to pass on this information about our culture,\" Ms Ganoza says. \"By having the dogs present here, with the simple act of people seeing them, we're passing on this story.\"\n\nYou may also like:", "description": "Peruvian hairless dogs may not be pretty but they are making a comeback at Peru's ancient sites.", "authors": ["Megan Janetsky"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/9F5F/production/_108499704_pic_28.jpg"}