{"pub": "yahoo", "url": "https://news.yahoo.com/kamala-fake-lover-jacob-wohl-202701110.html", "downloaded_at": "2019-10-12 00:43:41.440979+00:00", "title": "Kamala’s Fake Lover: Jacob Wohl Told Me It Was for a Spike TV Show", "language": "en", "text": "Inept conservative operatives Jacob Wohl and Jack Burkman held another bizarre press conference in Burkman’s driveway on Wednesday, this time to smear Sen. Kamala Harris (D-CA) with obviously fake allegations of an extramarital affair.\n\nAnd like past efforts to manufacture sexual claims against Trump foes—from Robert Mueller, to Pete Buttigieg, to Sen. Elizabeth Warren (D-MA)—the Harris charade fell apart quickly.\n\nThe pair’s bogus accuser—26-year-old Sean Newaldass—told The Daily Beast on Friday that he had no idea the event in which he alleged that he was in a romantic dalliance with the Senate was real. That’s because Newaldass had met Wohl and Burkman by replying to an ad posted on Craigslist seeking a “male actor” for “performance art.” When he showed up at Burkman’s Virginia home and delivered his lines alleging an affair, Newaldass was under the belief that the press conference was actually an audition for a Spike TV show. He said he had no idea that Harris was a politician. Indeed, he assumed she was a fictional person.\n\n“I thought I was acting for a role in a movie, like a role in a TV series,” Newaldass said. “I thought everything was staged, I’m thinking everyone is an actor.”\n\nJacob Wohl Faked Death Threats Against Himself\n\nNewaldass insists that he believed that everyone at the event, from Wohl and Burkman, to the reporters asking questions, and a heckler dressed as a corncob, were all actors. Wohl promised Newaldass $500 to appear at the event—money that Newaldass said he still has yet to receive.\n\n“I’m thinking this is going to be like The Office,” Newaldass said. “The Office has super dry humor.”\n\nNewaldass’s allegations are shocking even by Wohl and Burkman’s standards. The duo are known for hamfisted attempts to manufacture smears against political figures and for roping unwitting participants into their schemes. But they have never concocted a fake TV show in order to execute their plans before.\n\nAs Newaldass realized Wednesday afternoon that the event was real, and that he was being treated as an outright liar on social media, he said he became afraid to leave his home.\n\n“To me, it was the most hurt I’ve ever received from anything in the world,” Newaldass said.\n\nAsked over Instagram direct message whether he had tricked Newaldass, Wohl responded with only a laughing-crying emoji. Burkman, a lawyer and lobbyist whose membership in the D.C. Bar was recently suspended over unpaid dues, didn’t respond to a request for comment.\n\nJacob Wohl’s Bogus Warren Accuser Exaggerated His Military Service Record\n\nThis isn’t the first time one of Wohl and Burkman’s fake accusers has turned on them. Their Mueller accuser, Carolyne Cass, failed to show up at a much-hyped press conference and later said Wohl and Burkman had made up the claims. College student Hunter Kelly, whose name Burkman and Wohl used to accuse Buttigieg of sexual assault, turned on the pair even faster than Cass, sending out mocking tweets about their press conference announcing his claims as it happened. Their missteps don’t end there. Wohl is set to be arraigned on a felony charge for unlawful sale of securities later this month in California.\n\nNewaldass said he first entered Wohl’s orbit by replying to the Craigslist ad, which makes no mention of politics, Burkman and Wohl, or Harris. Shortly after responding, according to Newaldass, he was contacted by Burkman and Wohl. The phone number that Newaldass said Wohl used to contact him is the same as a number Wohl has used in the past to text and make phones call to a reporter at The Daily Beast.\n\nOn Tuesday night, Wohl and Burkman got Newaldass an Uber to Burkman’s home in Rosslyn, Virginia. Newaldass said he was told the house belonged to Spike TV, a network that no longer exists after parent company Viacom changed the channel’s name to the Paramount Network in 2018.\n\n“I was told, ‘This is the audition for a TV show that’s going to be on Spike,’” Newaldass said. “And I can be a personal trainer on the show, right?”\n\nNewaldass said Burkman and Wohl showed him the statement he would read on Wednesday , but described it as a “script.” Newaldass found the claims in the statement bizarre, but considered that he had seen similarly strange things in other movies and TV shows.", "description": "Inept conservative operatives Jacob Wohl and Jack Burkman held another bizarre press conference in Burkman’s driveway on Wednesday, this time to smear Sen. Kamala Harris (D-CA) with obviously fake allegations of an extramarital affair. And like past efforts to manufacture sexual claims against Trump", "authors": ["Will Sommer"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Octf2u5EuNaD4DxyzxwYbg--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/6e14ed99538138bce2ebd5fc77e796c7", "published_at": "2019-10-11"}