{"pub": "businessinsider", "url": "https://businessinsider.com/the-3-untouchable-businesses-at-citigroup-in-2019-2019-9", "downloaded_at": "2019-09-11 07:30:20.204478+00:00", "title": "Citigroup just highlighted 3 untouchable businesses, even as it embarks on job cuts and restructurings", "language": "en", "text": "Citigroup has undergone massive changes in 2019, including layoffs and multiple divisional restructurings. But as the bank chases its return-on-equity target in the back half of the year amid roiling markets and looming recession concerns, there are a few business lines it won't compromise on.\n\nCiti Chief Financial Officer Mark Mason said on Monday at a financial conference that it remained committed to its 12% target for return on tangible common equity (ROTCE), and expense reductions are on the table — especially in \"transactional expenses and incentive compensation\" — if revenues head south in the uncertain months ahead.\n\nThe bank, which has for years been dogged by critics for missing performance targets and returns that have lagged peers, has taken action early and often in 2019 to revamp business lines and craft a leaner operation. That includes overhauls to its stock-trading group and its rates and currencies trading teams, as well as the wind down of a $1 billion principal-investing unit.\n\nCiti also cut hundreds of jobs across sales and trading this summer, including roughly 10% of its equities division.\n\nRead more: Citigroup is shaking up its stock-trading group. 3 execs will be in charge of the new-look unit.\n\nSuch organizational changes, in addition reorganizations in 2018 within its investment bank and North American consumer franchise, \"have freed up and created efficiencies to either reinvest or allowed a flow-through to the bottom-line,\" Mason said.\n\nBut some of the firm's businesses are off limits to cuts — even in the pursuit of hitting its pledged goals to investors.\n\nThe three untouchable units at Citigroup, according to Mason, are Treasury and trade solutions, securities services, and branded cards, the linchpin to the firm's US retail-banking battle plan.\n\n\"One thing that I want to reiterate is that we cannot compromise investing in core parts of our franchise that allow for us to have a competitive advantage,\" Mason said.\n\n'Everything else is on the table'\n\nCiti is a sprawling enterprise, with 200,000 employees across the globe. What's so special about these particular businesses?\n\nIn the firm's Institutional Clients Group, which caters to larger companies and government entities, and accounted for more than half of the firm's $73 billion in 2018 revenues, Treasury and trade solutions and securities services are cornerstones.\n\nThese two businesses, often mentioned hand in hand in the company's public remarks, benefit most from the bank's global network and presence in nearly 100 countries — something Citi considers a key competitive advantage over peers — which it laid out in its investor-day presentation two years ago.\n\nCitigroup\n\nThey're also highly lucrative and growing at a steady clip.\n\nTreasury and trade solutions, the firm's transaction-banking unit, flies under the radar but is considered the crown jewel of the entire company by Citi execs. It has delivered 38% net margins in recent years and grew revenues 8% to $9.3 billion last year.\n\nRead more: A 'hidden asset' at Citigroup has given the bank a dominant position in the fastest-growing business on Wall Street — but challengers are knocking at the door.\n\nSecurities services, which helps companies with financing, accounting, and custody needs in dealing with financial assets, grew revenues 11% last year to $2.6 billion.\n\nOn the other side of the bank, credit cards are central to the bank's strategy in its $34 billion consumer division.\n\nCiti has a much smaller retail-bank footprint than competitors like JPMorgan Chase and Bank of America, but it has 28 million credit-card customers in North America and is No. 2 behind JPMorgan.\n\nBecause only a slim portion of the firm's card customers have a retail-banking relationship with Citi, the golden opportunity, as Mason outlined earlier this year, for growing revenues in the massive and crucial US market revolves around tapping that base of cardholders with tailored offers to sell them on other banking services.\n\nThat plan has been working so far. The North American branded-cards group grew sales 2% to $4.4 billion in the first half of 2019, and half of the $2 billion in new digital-deposit sales in the first half of this year stemmed from Citi cardholders who didn't previously have a banking relationship.\n\nRead more: A top Citigroup executive is departing as the bank winds down a secretive $1 billion business amid competition from private equity\n\nMason said on Monday he thinks Citi will hit its 12% ROTCE ambition or \"get pretty darn close,\" but he made clear that Citi wouldn't sacrifice businesses that the bank believes offer long-term strategic advantages to hit a short-term goal.\n\n\"We're going to be very thoughtful about protecting investments that need to be protected,\" Mason said. \"And otherwise, everything else is on the table.\"", "description": "Citi has undergone massive changes in 2019 as it chases a 12% return target. But a few select businesses are protected from cuts, CFO Mark Mason said.", "authors": ["Alex Morrell"], "top_image": "https://amp.businessinsider.com/images/580fbba2362ca4892e8b4803-2732-1366.jpg", "published_at": "2019-09-10"}