{"pub": "investing.com", "url": "https://ng.investing.com/analysis/chart-of-the-day-brent-fundamentals-should-propel-price-higher-19327", "downloaded_at": "2019-09-16 13:04:55.289184+00:00", "title": "Chart Of The Day: Brent Fundamentals Should Propel Price Higher", "language": "en", "text": "soared 13.6%, or $8.20, at today's open, to reach $68.50, after a series of drone attacks disabled half of Saudi’s oil production, reducing the global supply by 5%. Exacerbating the impact of the lower supply on price, a heated exchange between the U.S. and Iran has also amplified the threat of military action.\n\nHowever, the price has since trimmed its advance to 9.4%. As the fundamentals and the geopolitical risks haven't changed, the deceleration is probably due to profit-taking following the contract’s highest jump since its launch in 1988.\n\nIndeed, Brent's paring of its biggest leap on record may prove an opportune buying dip, as the retreat appears to be based purely on technical trading. Given that Saudi Arabia's oil production is expected to be well below capacity for weeks, the price is likely to return to rallies. A military escalation in the region would only quicken and sharpen such a price move.\n\nTechnical analysis supports this view, as the chart below demonstrates.\n\nBrent Oil Futures Daily Chart\n\nThe price gapped well above the downtrend line since late April, posting a new high above the July 11 peak of $67.65, from the Aug. 7 bottom, establishing a short-term uptrend.\n\nIn the medium-term, the trend remains sideways, with falling highs since October amid rising lows since December. The price temporarily crossed above the medium-term downtrend line, but then fell back below it. A new high above the April 25, $75.60 peak is required for a medium-term uptrend.\n\nNote, the price paring found support where the August highs met with the June-July lows (dotted line).\n\nTrading Strategies\n\nConservative traders would wait for the medium-term to settle a trajectory before committing to a position.\n\nModerate traders may go long in the short-term after confirmation of support.\n\nAggressive traders may enter a long position according to their account’s risk.\n\nTrade Sample\n\nEntry: $65\n\nStop-Loss: $64 – below the top of the prior ascending August resistance (dotted line).\n\nRisk: $1\n\nTarget: $68, below today’s highs\n\nReward: $3\n\nRisk:Reward Ratio: 1:3", "description": "Commodities Analysis by Investing.com (Pinchas Cohen/Investing.com) covering: Brent Oil Futures. Read Investing.com (Pinchas Cohen/Investing.com)'s latest article on Investing.com UK.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-16"}