{"pub": "foxnews", "url": "https://foxnews.com/politics/pentagon-weighing-move-to-send-more-troops-to-middle-east", "downloaded_at": "2019-09-20 02:27:01.627777+00:00", "title": "Pentagon weighing move to send more troops to Middle East to deter conflict", "language": "en", "text": "The Trump administration is currently weighing whether to send more troops, including air defense units, to the Middle East as an act of deterrence, defense officials told Fox News Thursday.\n\nGen. Kenneth Mackenzie, the head of U.S. Central Command, has requested more air defense units but the White House has not yet decided whether to approve the request, officials said. Additional Patriot air defense batteries could help shore up the holes in Saudi Arabia's air defense units following attacks on two oil sites last weekend.\n\nMore fifth-generation fighter jets could also be deployed, joining the F-22 Raptors which deployed in June to Qatar.\n\nAny addition troop deployment in the Middle East would likely number in the \"hundreds,\" one official told Fox News. There are approximately 70,000 troops currently deployed to the region.\n\nRETIRED SEAL MCRAVEN SAYS US WILL BE IN AFGHANISTAN FOR 'VERY LONG TIME'\n\nPresident Trump is expected to meet with his top national security officials at the White House Friday and could make a decision on deploying additional troops soon after.\n\nU.S. officials have blamed Iran for Saturday's attack on Saudi Aramco's Abqaiq oil processing plant and another oil field just to the south. The strike interrupted the production of about 5.7 million barrels of oil -- about five percent of the world’s supply.\n\nYemen’s Iran-backed Houthi rebels quickly claimed responsibility for the attack, but Secretary of State Mike Pompeo said it was “abundantly clear” Iran was responsible for the attack, an accusation Tehran denied. Both Pompeo and Vice President Mike Pence have said the attack was an “act of war” by Iran and U.S. officials have said Iranian cruise missiles and drones were used in the attack and were fired from inside the Islamic Republic.\n\nFIFA TELLS IRAN WOMEN 'HAVE TO BE ALLOWED INTO FOOTBALL STADIUMS' AFTER 'BLUE GIRL' DEATH\n\nHowever, Pentagon officials said Thursday the U.S. would defer to Saudi Arabia’s assessment of responsibility for the attack before making any moves.\n\n“We’re going to work through with the Saudis as they make their assessment of what took place. We’re going to let them put out the information as they go through the assessment,” Secretary of Defense for Public Affairs Jonathan Hoffman told reporters. “We're being deliberative about this, and we'll wait until the final assessment is completed with the Saudis, and they've made their declaration.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"I will acknowledge that as of this time, all indications are we have that Iran is in some way responsible for the attack on the Saudi refineries.\"\n\nJoint Staff Spokesperson Air Force Col. Patrick S. Ryder said the attacks looked more sophisticated than the Houthis have been capable of in the past.\n\n“Regardless of whether this was a proxy or direct attack [by Iranian forces], this has been a dramatic escalation of what we have seen in the past. This was a number of airborne projectiles. It was very sophisticated and coordinated,” said Ryder. “Look at the precision. Obviously, it’s not something that we’ve necessarily seen in the past from Houthi attacks.”", "description": "The Pentagon is weighing whether to send more troops, including air defense units, to the Middle East as an act of deterrence, Pentagon officials told Fox News Thursday.", "authors": ["Morgan Phillips"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/07/pentagon.jpg", "published_at": "2019-09-19"}