{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/11/scotland-japan-pressure-rescheduled-rugby-world-cup", "downloaded_at": "2019-10-11 12:45:29.929841+00:00", "title": "‘We will not be collateral damage’: Scotland to fight moves to cancel Japan match", "language": "en", "text": "The Scottish Rugby Union chief executive, Mark Dodson, says he will not allow Scotland to become the World Cup’s “collateral damage” as he promised to fight any moves to cancel Sunday’s vital match against Japan.\n\nWorld Rugby has been forced to call off two games on Saturday as Super Typhoon Hagibis prepares to wreak havoc across Japan’s eastern coast.\n\nA decision on whether the Scots’ win-or-bust final Pool A game with the hosts goes ahead will be made on the morning of the game but Dodson told BBC Radio 4’s Today Programme that the showdown should either be moved to an alternative venue or delayed until after the storm passes.\n\nJoseph aims fire at Scotland over legal threat as Japan vow to do talking on pitch Read more\n\nWorld Rugby has already said it will not budge on tournament rules that state pool matches can only be played on their scheduled dates but Murrayfield officials are understood to believe clauses relating to “force majeure” measures in the competition guidelines could allow room for manoeuvre.\n\nDodson said: “My view is that we’re not going to let Scotland be the collateral damage for a decision that was taken in haste.\n\n“I think there’s alternative [venues] around Japan. The point to me, we are talking about now is not whether the game will take place on Sunday, that will be a purely meteorological issue. The issue will be if it can’t take place then we’re really, really pressing the point that we need to have to get this game delayed 24 hours later.”\n\nAnd Dodson confirmed the SRU is exploring legal options to ensure the game goes ahead.\n\nHe said: “The first and most important is that we look after the safety of the general public. The second thing is for World Rugby to just simply state that the game has to be cancelled goes against the whole sporting integrity of the tournament.\n\n“We have been preparing for this tournament now for four years, the guys have had over 100 days in camp, we’ve played games already and the fourth game in this particular case is pivotal.\n\nQuick guide Scotland team to face Japan Show Hide Hogg; Seymour, Harris, Johnson, Graham; Russell,Laidlaw (capt); Dell, Brown, Nel, Gilchrist, Gray, Bradbury, Ritchie, Thomson. Replacements: McInally, Reid, Fagerson, Cummings, Wilson, G Horne, P Horne, Kinghorn\n\n“We’ve had consistent dialogue since the last three or four days around this with senior people at World Rugby, but World Rugby seem to be determined to stick to its plan that the match is either played on Sunday or indeed it is cancelled, and to have it cancelled and have our ability to progress from this group put at peril, we believe is absolutely unacceptable.\n\n“World Rugby is pointing us back to the participation agreement. We’ve had legal opinion – from a leading QC – that challenges World Rugby’s interpretation.\n\n“We don’t know that [it is too late] – we have to challenge it. But we should be talking about this from a rugby perspective, this is about the game and the rugby supporters across the world are absolutely astounded at this rigidity from World Rugby. The common sense approach to this is to play the game 24 hours later on perfect safety where we can make sure that the pool stages are completed, and the sporting integrity of the tournament remains intact.”", "description": "The SRU chief executive, Mark Dodson, says he will not allow Scotland to become the World Cup’s “collateral damage” as he promised to fight any moves to cancel Sunday’s vital match against Japan", "authors": ["Pa Media"], "top_image": "https://i.guim.co.uk/img/media/2750c17bbda47d1c8f80937b98c88923f0b80972/0_171_3610_2166/master/3610.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=893dd91d026b975f19f1ea4c698bd285", "published_at": "2019-10-11"}