{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/7/alex-trebek-hints-pancreatic-cancer-battle-may-end", "downloaded_at": "2019-10-07 19:59:02.242411+00:00", "title": "Alex Trebek hints pancreatic cancer battle may end his tenure on 'Jeopardy!'", "language": "en", "text": "Alex Trebek said his time on the iconic game show “Jeopardy!” may be coming to an end after battling pancreatic cancer for months.\n\nMr. Trebek said Friday his chemotherapy is causing sores in his mouth, making it difficult to enunciate words and increasing slurring.\n\n“I will keep doing [the show] as long as my skills do not diminish, and they have started to diminish,” he said in an interview with CTV.\n\nMr. Trebek, who has hosted 8,000 episodes of “Jeopardy!” over 35 years, announced in March that he had been diagnosed with stage 4 pancreatic cancer, which only has a 9% five-year survival rate. He announced he had begun another round of chemotherapy in September.\n\nMr. Trebek said he regrets making his battle with cancer so public because others in similar situations have turned to him for help and inspiration.\n\n“I don’t know if I’m strong enough or intelligent enough to help alleviate some of that despair, so it’s tough on me,” he said.\n\nDespite this, Mr. Trebek said he isn’t afraid of dying.\n\n“The thought of the pancreatic cancer does not frighten me,” he said. “I’m 79 years old. So, hey, I’ve lived a good life, a full life, and I’m nearing the end of that life. I know that.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Alex Trebek said his time on the iconic game show \"Jeopardy!\" may be coming to an end after battling pancreatic cancer for months.", "authors": ["The Washington Times Http", "Bailey Vogt"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/08/29/alex_trebek_cancer_68439_c0-0-2316-1350_s1770x1032.jpg?2224ba14f1092fe931d9eaeea287c567a0ab65f7", "published_at": "2019-10-07"}