{"pub": "news24", "url": "https://news24.com/World/News/watch-some-25-million-muslim-hajj-pilgrims-scale-mount-of-mercy-as-eid-al-adha-approaches-20190810", "downloaded_at": "2019-10-17 14:22:25.412404+00:00", "title": "WATCH | Some 2.5 million Muslim hajj pilgrims scale Mount of Mercy as Eid al-Adha approaches", "language": "en", "text": "Millions of Muslims have come together in Saudi Arabia for one of the largest gatherings in the world.\n\nNearly 2.5 million Muslim hajj pilgrims converged on Mount Arafat in Saudi Arabia on Saturday marshalled by tens of thousands of stewards in a bid to prevent any repetition of previous years' deadly stampedes.\n\nMovable crowd control barriers were erected all around the foot of the rocky hill outside Mecca, also known as Jabal al-Rahma or Mount of Mercy, where the faithful arrived on foot and in a seemingly endless line of buses.\n\nRaising their palms skywards, the pilgrims set off on the climb to the summit where they held prayers to atone for their sins in a ritual that is regarded as the high point of the annual hajj.\n\n\"Really, I am very satisfied,\" said Lassina Coulibaly, a 47-year-old Malian business employee.\n\n\"Fatigue is part of the pilgrimage,\" added the father of seven.\n\nClutching brightly coloured umbrellas, pilgrims first braved the blazing sun and then heavy downpours that many welcomed as a blessing.\n\nSome burst into tears as they chanted prayers.\n\nThousands of faithful had spent the night under the stars, sleeping on prayer rugs or pieces of cardboard.\n\nTrucks were parked at regular intervals on the route leading up to the hill, distributing bottles of water and meals.\n\nThousands of workers prepared to clear the rubbish that littered the ground.\n\nHelicopters criss-crossed overhead, part of the tight security precautions taken by the pilgrimage's Saudi hosts.\n\n'It is an honour'\n\nThe hajj is one of the five pillars of Islam which every Muslim is required to complete at least once in their lifetime if they are healthy enough and have the means to do so.\n\n\"I came last year during Ramadan, now I am there for the hajj,\" said Indonesian pilgrim Zakir Uddin.\n\n\"It is an honour, praise be to God,\" added the 27-year-old cook.\n\nLike other male pilgrims, he wears a seamless white garment that covers only one shoulder and emphasises unity regardless of social status or nationality.\n\nThe women wear loose dresses, most of them white, exposing only their faces and hands.\n\nThey are designed to help pilgrims enter a state of purity, called ihram.\n\nUddin, who works in the Saudi city of Jeddah less than 90 kilometres from Mecca, says he is happy to see so many of his compatriots among the pilgrims.\n\n\"Indonesians make up the single largest contingent, such is the will of God,\" he said.\n\nPilgrims travelling from abroad account for 1.86 million of the 2.48 million taking part in this year's hajj, according to official figures.\n\nAfter sunset prayers, pilgrims will make their way down Mount Arafat to Muzdalifah, another holy site where they will sleep under the stars to prepare for the final stage of hajj, a ritual \"stoning of the devil\".\n\nThat marks the beginning of Eid al-Adha, the festival of sacrifice, marked on Sunday.\n\nSheep are traditionally slaughtered for the three-day event, a tribute to the prophet Abraham's sacrifice of a lamb after God spared Ishmael, his son.\n\nPilgrims then return to the Grand Mosque to perform a final \"tawaf\" or walk around the Kaaba.\n\nLogistical challenge\n\nThe scale of the pilgrimage presents vast security and logistical challenges, with tens of thousands of safety officers deployed.\n\nRiyadh faced strong criticism in 2015 when some 2,300 worshippers were killed in the deadliest stampede in the gathering's history.\n\nThis year's hajj takes place to a backdrop of Gulf tensions following a series of attacks on tankers, the downing of drones and the seizure of ships.\n\nRiyadh blames regional foe Tehran for the attacks on commercial shipping, accusations Iran vehemently denies.\n\nDespite the absence of diplomatic ties between the two countries, some 88,550 Iranian pilgrims are due to take part in the hajj this year according to Iran's Tasnim news agency.\n\nAs in previous years, Saudi authorities have been at pains to stress that the hajj is a religious event and have sought to prevent its politicisation.\n\nGET THE NEWS at your fingertips and download the News24 app for Android here now. Get it for your iPhone here.\n\nKEEP UPDATED on the latest news by subscribing to our FREE newsletter.\n\n- FOLLOW News24 on Twitter", "description": "Nearly 2.5 million Muslim hajj pilgrims converged on Mount Arafat in Saudi Arabia marshalled by tens of thousands of stewards in a bid to prevent any repetition of previous years' deadly stampedes.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9098/0814a90a1abe48bca3929b8c34f07d40.jpg", "published_at": "2019-08-10"}