{"pub": "fox", "url": "https://foxnews.com/opinion/paul-batura-the-blame-game-we-see-it-in-washington-in-our-homes-and-deep-within-ourselves", "downloaded_at": "2019-09-08 23:28:51.938801+00:00", "title": "Paul Batura: How to overcome the blame game we see in Washington, at home, and within ourselves", "language": "en", "text": "The tendency to blame others rather than assume responsibility for our own misery or mess is a timeless malady that goes by many names.\n\nSocial scientists call it “psychological projection” – a subconscious defense mechanism designed to help us cope with a particular stress or personal problem.\n\nIn shirt-sleeve English, it’s called scapegoating, finger-pointing or passing the buck.\n\nIt’s always the other guy’s fault. It couldn’t possibly be mine.\n\nJESSICA PHILLIPS: A WEEK AFTER A MASS SHOOTING, WE IN WEST TEXAS RISE WITH STRENGTH AND OUR FAITH\n\nEstablishment Washington has perfected the art of blaming others, and never more exhaustively or regularly than in recent years. According to beltway liberals, President Donald Trump is responsible for nearly every bad thing of late, from a fluctuation in global temperatures and a rise in strong storms to a string of mentally ill murderers and even the deterioration of social media civility.\n\nNever mind that weather is historically cyclical, tragic gun violence is multi-factorial, and public crassness and crudeness have been on the rise for decades.\n\nWhen it comes to the blame game, facts are inconvenient things.\n\nTo be fair, the blame game is bipartisan sport, and it’s been so for generations. As a kid, I remember the seemingly indefatigable White House correspondent Sam Donaldson chastising President Ronald Reagan for his tendency to blame Democrats for our nation’s ills.\n\nFrom class action lawsuits to political parties that coddle the perpetually angry, it’s easy to blame almost somebody else for almost every and anything.\n\n“Mr. President, in talking about the continuing recession tonight, you have blamed mistakes in the past,” Donaldson pressed. “You have blamed the Congress. Does any of the blame belong to you?”\n\nThe quick-witted Reagan didn’t hesitate in his response.\n\n“Yes,” he acknowledged, “because for many years I was a Democrat!”\n\nThe room erupted in laughter.\n\nThose of us who revere the teachings of the Bible will remember that blame is baked into the creation story. After God chastises Adam for eating the forbidden fruit from the tree of the knowledge of good and evil in the Garden of Eden, the world’s first man immediately blames Eve, the earth’s first woman. And then Eve quickly blames creation’s first serpent for tempting her.\n\nThe names of the aggrieved have changed as have the circumstances, but what began in the Garden of Eden rages on and into the cities and countryside in the first part of the 21st century.\n\nI was thinking about this the other day as I attempted to talk with our 14-year-old about managing his finances and the many mistakes I made with money as a young man. We were talking about the 70-10-10-10 philosophy – living off 70 percent of your income, and then splitting the remaining 30 percent among tithing, saving and investing.\n\n“Grandma and Grandpa never taught me these things,” I began, catching myself midsentence, realizing that I was blaming my deceased parents for my own financial sloppiness and stupidity as a young man.\n\nIt might be true that my mom and dad never walked me through the finer points of saving, investing and compound interest, the eighth wonder of the world, but it was my own fault that I spent money I didn’t have, loaned my credit card to people I barely knew, and didn’t pay my bills on time in those first few years following college graduation.\n\nBack in 1996, I was friendly with a woman who was working as a nanny in New York City. Like me, Tammy was a runner. A month or two after we met she competed in the Walt Disney World Marathon. A massive January blizzard scuttled her return from Orlando and she called me in desperation, explaining her credit cards were maxed out and she was stranded. Would I loan her some money?\n\nTammy was pretty and blond and I had been hoping to date her, so I immediately obliged. I played the big spender and faxed her hotel my credit card authorization. She returned four days later and having charged all her meals and theme park tickets in addition to her room, she had racked up a bill of over $1,400.\n\nLong story short, Tammy never repaid me and didn’t return my repeated calls. I fumed over the slight for years, silently burning and blaming her for stiffing me.\n\nTruth to be told, it was my fault for trying to impress her with my seeming generosity, which was nothing more than credit I could hardly afford to repay.\n\nCulture accommodates our penchant for finger-pointing. From class action lawsuits to political parties that coddle the perpetually angry, it’s easy to blame almost somebody else for almost every and anything.\n\nIn reality, my own worst enemy is me. It’s just a matter of perspective.\n\nInstead of blaming my low wages or excessive taxation, hustling to earn more money would solve the problem.\n\nCLICK HERE TO GET THE OPINION NEWSLETTER\n\nRather than blame soda manufacturers for producing fattening, sugary soft drinks or restaurants for serving oversized portions, exercising more, drinking water and eating only until I’m satiated would be a good start to better health.\n\nAccusing my spouse for not meeting my needs when I’m not first meeting hers is downright foolishness not to mention relational suicide.\n\nAnd why should I blame my busyness for being tired when the solution is to arrange my schedule to simply allow for more sleep?\n\n“Why do you see the speck that is in your brother’s eye,” Jesus once asked, “but do not notice the log that is in your own eye?”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe evidence would seem to suggest he never lived up to the ideals of his own lyrics in the hit song, “Man in the Mirror,” but the late and now disgraced pop icon Michael Jackson’s haunting refrain provides a prescriptive pathway for those of us inclined to point fingers:\n\n“I’m starting with the man in the mirror,” he once sang. “I’m asking him to change his ways; And no message could have been any clearer; If You wanna make the world a better place, Take a look at yourself and then make a change.”\n\nIt’s just too bad Jackson never took his own advice.\n\nCLICK HERE TO READ MORE BY PAUL BATURA", "description": "It’s always the other guy’s fault. It couldn’t possibly be mine.", "authors": ["Paul Batura", "Paul J. Batura Is Vice President Of Communications At Focus On The Family", "The Author Of"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/08/27/694940094001_6077989586001_6077988827001-vs.jpg", "published_at": "2019-09-08"}