{"pub": "independent", "url": "https://independent.co.uk/sport/football/premier-league/manchester-united-team-news-paul-pogba-arsenal-ankle-injury-solskjaer-fixtures-epl-a9122701.html", "downloaded_at": "2019-09-27 11:33:36.377271+00:00", "title": "Manchester United team news: Paul Pogba a doubt to face Arsenal after suffering recurrence of ankle injury", "language": "en", "text": "Paul Pogba is a doubt for Manchester United’s meeting with Arsenal on Monday night after suffering a recurrence of his ankle injury.\n\nPogba played 90 minutes in United’s 1-1 EFL Cup draw with Rochdale in Wednesday night for the first time since twisting his right ankle against Southampton last month.\n\nThe midfielder missed a team bonding meal with other members of the squad on Thursday night and Ole Gunnar Solskjaer confirmed he may be unavailable against Arsenal.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“The situation is he finished the [Rochdale] game - 90 minutes, fantastic - but he got a knock to his ankle which is very swollen so was better not to go there with the team and he's in a race for Monday.”\n\nSolskjaer then confirmed that Pogba was a doubt for Monday. “Yes, that's the way it is,” he said.\n\nShape Created with Sketch. Manchester United player ratings vs Rochdale Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Manchester United player ratings vs Rochdale 1/11 Sergio Romero - 5 out of 10 Manchester United Getty Images 2/11 Aaron Wan-Bissaka - 6 out of 10 Manchester United Getty Images 3/11 Axel Tuanzebe - 6 out of 10 Manchester United Getty Images 4/11 Phil Jones - 4 out of 10 Manchester United Getty Images 5/11 Marcos Rojo - 5 out of 10 Manchester United Getty Images 6/11 Fred - 4 out of 10 Manchester United Getty Images 7/11 Paul Pogba - 5 out of 10 Manchester United Getty Images 8/11 Andreas Pereira - 6 out of 10 Manchester United Getty Images 9/11 Jesse Lingard - 5 out of 10 Manchester United Getty Images 10/11 Tahith Chong - 4 out of 10 Manchester United Getty Images 11/11 Mason Greenwood - 7 out of 10 Manchester United Getty Images 1/11 Sergio Romero - 5 out of 10 Manchester United Getty Images 2/11 Aaron Wan-Bissaka - 6 out of 10 Manchester United Getty Images 3/11 Axel Tuanzebe - 6 out of 10 Manchester United Getty Images 4/11 Phil Jones - 4 out of 10 Manchester United Getty Images 5/11 Marcos Rojo - 5 out of 10 Manchester United Getty Images 6/11 Fred - 4 out of 10 Manchester United Getty Images 7/11 Paul Pogba - 5 out of 10 Manchester United Getty Images 8/11 Andreas Pereira - 6 out of 10 Manchester United Getty Images 9/11 Jesse Lingard - 5 out of 10 Manchester United Getty Images 10/11 Tahith Chong - 4 out of 10 Manchester United Getty Images 11/11 Mason Greenwood - 7 out of 10 Manchester United Getty Images\n\nMarcus Rashford and Anthony Martial are not expected to recover in time to face Unai Emery’s side either, leaving United with few options up front.\n\nLuke Shaw has returned to full training after a hamstring problem but may not be deemed match fit for Monday.\n\n“I wouldn't put my life on [Rashford and Martial returning] but that's part of this game, you work with what you have and we're looking forward to this game.\n\n“Luke's back in training today so let's see how he is. He’s getting there so let's see how he reacts the next couple of days.\n\n“He’s been working really hard. We hope to see him before international break.”", "description": "Paul Pogba is a doubt for Manchester United’s meeting with Arsenal on Monday night after suffering a recurrence of his ankle injury. Pogba played 90 minutes in United’s 1-1 EFL Cup draw with Rochdale in Wednesday night for the first time since twisting his right ankle against Southampton last month.", "authors": ["Mark Critchley"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/27/10/Paul-Pogba.jpg", "published_at": "2019-09-27"}