{"pub": "yahoo", "url": "https://news.yahoo.com/haze-clearing-over-malaysia-incoming-081314265.html", "downloaded_at": "2019-09-24 13:57:51.300159+00:00", "title": "Haze clearing over Malaysia with incoming monsoon season as Indonesia declares emergency in", "language": "en", "text": "Malaysians are waking up to slightly brighter skies today, as the northeast monsoon season begins, and winds push the haze that has been blanketing the country for weeks from the peninsula. Easterly air from the South China Sea arrives in October, annually.\n\nAs of this afternoon, 11 areas have recorded unhealthy air, with most previously affected areas reporting “moderate” conditions.\n\nAreas that are still reporting high readings include the beleaguered area of Johan Setia in Selangor reporting air quality readings of 168, and Nilai in Negri Sembilan state reporting 131. Putrajaya is also reporting levels above 100, with a 122 Air Pollution Index.\n\nHowever, in neighboring Indonesia, the situation is still dire, with an emergency having been declared in the Riau area of Surabaya. Images of the blood-red skies have gone viral online, showing city streets blanketed by red-tinged smoke.\n\nhttps://twitter.com/negativiq/status/1176148240032337921\n\nTwo-hundred and eighty students in Pekanbaru and Jambi will be evacuated, with 160 returning to Malaysia, and the remaining 120 being moved temporarily to Jakarta, according to the National Disaster Management Agency (NADMA).\n\nA NADMA statement indicated that Riau governor Syamsuar had declared a state of emergency from September 23 to October 31, with the possibility that it could be extended.\n\nAs of yesterday, the visibility range in affected areas in Indonesia was 500 metres, with the Pollution Standards Index (PSI) at 600.\n\nThis article, Haze clearing over Malaysia with incoming monsoon season as Indonesia declares emergency in, originally appeared on Coconuts, Asia's leading alternative media company. Want more Coconuts? Sign up for our newsletters!", "description": "Malaysians are waking up to slightly brighter skies today, as the northeast monsoon season begins, and winds push the haze that has been blanketing the country for weeks from the peninsula. Easterly air from the South China Sea arrives in October, annually. As of this afternoon, 11 areas have recorded", "authors": ["Coconuts Kl"], "top_image": "https://s.yimg.com/uu/api/res/1.2/JumWsFRwMBty2kppTo7MuA--~B/aD0yOTA7dz00ODk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/coconuts_kl_272/0b0c54aa31b65a281fd9d380c02063a0", "published_at": "2019-09-24"}