{"pub": "breitbart", "url": "https://breitbart.com/clips/2019/10/22/rand-paul-there-are-gop-senators-whose-allegiance-is-more-to-the-deep-state-than-trump", "downloaded_at": "2019-10-22 14:04:39.178853+00:00", "title": "Rand Paul: There Are GOP Senators ‘Whose Allegiance Is More to the Deep State’ Than Trump", "language": "en", "text": "Monday on Fox News Channel’s “Tucker Carlson Tonight,” host Tucker Carlson questioned Sen. Rand Paul (R-KY) as to why Sen. Lindsey Graham (R-SC) had not been aggressive employing his subpoena power as the chairman of the Senate Judiciary Committee against various central figures involved with the effort to derail Donald Trump’s 2016 presidential campaign and his presidency.\n\nPaul explained he had urged Graham to act. However, he said there were other Republican members of the U.S. Senate that had more of an “allegiance” to the so-called Deep State than Trump.\n\nPartial transcript as follows:\n\nCARLSON: So I don’t want to single out, I don’t want to be, you know, unfair to any particular senator. But I would tell you that I hear a lot from our viewers, you know, what is the answer? How did this start? Lindsey Graham is the Committee Chairman. He claimed he would get to the bottom of it. Why hasn’t he?\n\nPAUL: Well, not just any senator can do this. So I can’t call a committee hearing and drag these people in. Senator Graham has the power. He is the Chairman of a powerful committee, the Judiciary Committee. And yes, I’ve encouraged him publicly and privately to do this.\n\nI’d like to see John Brennan come in. I want to see Brennan testify, and I would ask him very pointedly, did you talk to the British Intelligence agencies? And did you set up spying by foreign Intelligence agencies on the President or the President’s campaign? Because I think he did and I think that’s against the law.\n\nAnd I’ve talked to people who are convinced that these people while they may be deceitful, they’re sort of, you know, so officious that they probably have paperwork they filled out and those phone calls probably have a record, but I think he did call the British agent and I think he did get them involved.\n\nBut I also think it’d be interesting to know, Christopher Steele and that Steele dossier, did he talk to Russian agents? That’s been the rumor for over a year now that he was getting information from Russian agents.\n\nSo everything that Democrats have accused President Trump of doing, you know, investigating a political rival with a foreign country. All of those same questions should be asked of the Democrats. Did they do that to Trump?\n\nCARLSON: Well, that’s exactly right. And we’re being told we have no right to know the answer after two years of sitting patiently and listening to this nonsense about Russia.\n\nSo Lindsey Graham is at the center of this. You want to give him the benefit of the doubt. But the question remains, why hasn’t he done this? It’s within his power to do it. He hasn’t done it. What’s the answer? Why?\n\nPAUL: You know, I think we’ll have to wait and see. I think he does want to get to the bottom of this. But you’re right, he needs to go out and exercise his power. We’ve been waiting a long time on this.\n\nSome people and I’m not going to say Senator Graham, but there are other Republican senators up here, whose allegiance is more to the deep state than it is to the President.\n\nCARLSON: Yes.\n\nPAUL: I do think the Senator — I think that Senator Graham does like the President and wants to get to the bottom of this, but a lot of us want to see it get started. We want to see subpoenas, and we don’t want to see everything being done in secret on the House side. And then they parse out what they want to parse out.\n\nMost of those people that are testifying over there could equally be asked to testify over here. But really, I want to see Brennan come in and I want to see him under oath.\n\nCARLSON: Well, of course.\n\nPAUL: I want to see him under oath.\n\nCARLSON: So, I see a pattern here though and again, I don’t want to be mean to Senator Graham, who I’ve known for a long time and I think is smart and capable. And maybe that’s my frustrations because he is smart, he is capable.\n\nWhen he goes on cable news, not on this show, but in others, and he makes these claims, I’m going to do this. I’m going to do this. I’m going to do that. I’m fighting for you. And then he doesn’t. Here’s another example. Here is Lindsey Graham, promising us, voters in America, he is going to get to the bottom of the raid on Roger Stone’s house. Watch.\n\n(BEGIN VIDEO CLIP)\n\nGRAHAM: Our job is to provide oversight to the Department of Justice as the Judiciary Chairman. Somebody needs to watch those who watch us. Mueller, do your job, but these tactics are unacceptable, given the level of threat here. I’m sending a message to them.\n\nYou’re accountable to the Congress and we’re going to find out —\n\nUNIDENTIFIED MALE: You will get this.\n\nGRAHAM: Well, they better answer my letter. If I were them, I would.\n\n(END VIDEO CLIP)\n\nCARLSON: Okay, so he didn’t in the end, get to the bottom of the raid on Roger Stone’s house. Why shouldn’t we feel aggrieved?\n\nPAUL: Well, he needs to use this clout and the only way he can do it, sometimes they give the argument they say, well, we only want to do it if the Democrats will do it in a bipartisan way.\n\nBut it doesn’t have to be that. A simple majority can vote to do anything in the in the Judiciary Committee, and I think every one of his members will vote with him to have hearings.\n\nBut yes, I think there should be very high profile hearings on this and there’s a lot to investigate how they originally got the FISA warrant? I want to know that because I don’t want anybody else in America to be abused by government the way the President was.\n\nCARLSON: Well, of course not.\n\nPAUL: This can happen to anyone.\n\nCARLSON: So I’m wondering if this has something to do with another issue unrelated directly to these issues, which is Foreign Policy. Senator Graham as, you know, is really probably the most aggressive neocon in the Senate.\n\nHe has butted heads with the President over this. They’re currently arguing about Syria. I wonder if his disagreement with Trump on foreign policy questions has caused him to slow walk some of these investigations.\n\nPAUL: Well, there is an establishment both in foreign policy and also in the Intelligence Community and the Intelligence Committee truly is the deep state. The deep state has an enormous amount of power to look at individuals.\n\nAnd so when Senator Graham and I have fought these fights in the back, in the past, I’ve always fought for having warrants where a real judge in public has to — you have to present probable cause.\n\nLindsey has always fought for allowing these to be done secretly. These FISA warrants, even allowing Americans to end up — Americans be caught up in these.\n\nAnd so this is something that there may be a concern that if we look at the Intelligence state — the deep state — that as we find out things that some of their power may diminish, and so there might be a philosophical difference that he wants them to maintain their power. He wants to maintain the Intelligence Community’s enormous grip on things.\n\nCARLSON: Yes. It may be, and I bet you, the voters of South Carolina disagree with him on that. And —\n\nPAUL: I think voters want to know what happened, what they did to the President.\n\nCARLSON: Yes. Senator, thanks so much. Great to see you tonight. I appreciate it.\n\nPAUL: Thank you.", "description": "Monday on Fox News Channel's \"Tucker Carlson Tonight,\" host Tucker Carlson questioned Sen. Rand Paul (R-KY) as to why Sen. Lindsey Graham (R-SC) had not been aggressive employing his subpoena power as the chairman of the Senate Judiciary Committee against various central figures involved with the effort to derail Donald Trump's 2016 presidential campaign and his presidency. | Clips", "authors": ["Jeff Poor"], "top_image": "https://media.breitbart.com/media/2019/10/Paul1022-640x335.jpg", "published_at": "2019-10-22"}