{"pub": "yahoo", "url": "https://news.yahoo.com/warren-says-shell-keep-shunning-172624385.html", "downloaded_at": "2019-10-09 19:11:45.417492+00:00", "title": "Warren pledges to skip big fundraisers if she's Dem nominee", "language": "en", "text": "FILE - In this Aug. 3, 2019, file photo, Democratic presidential candidate Sen. Elizabeth Warren, D-Mass., speaks during a candidate forum on labor issues in Las Vegas. Warren is finding that her ascent in presidential primary polls means heightened scrutiny and criticism from party rivals and President Donald Trump. Her political allies and foes alike say Warren has appropriately sharp elbows and isn’t afraid to throw them _ something she’ll likely increasingly have to do. (AP Photo/John Locher, File)\n\nWASHINGTON (AP) — Democratic presidential candidate Elizabeth Warren says she will keep shunning large-dollar fundraisers if she is the nominee, changing her earlier stand that doing so would be tantamount to \"unilateral disarmament\" against President Donald Trump and Republicans.\n\nThe Massachusetts senator has ridden a steady rise in the polls to emerge as among the leading 2020 contenders as the first election-year contest in February nears. She has relied on a small-dollar donation strategy that she says gives her more time to attend large rallies and stay long afterward taking selfies with supporters, rather than soon heading off to exclusive fundraisers or spending hours on the phone asking for money.\n\nNow she is pledging more of the same for the general election.\n\n\"I'm not going to do the big-dollar fundraisers. I'm just not going to do it,\" Warren said in an interview with CBS posted Tuesday.\n\nA campaign statement followed on Wednesday: \"When Elizabeth is the Democratic nominee for president, she's not going to change a thing in how she runs her campaign. That means no PAC money. No federal lobbyist money. No special access or call time with rich donors or big dollar fundraisers to underwrite our campaign.\"\n\nIt said the campaign \"is and will continue to be a grassroots campaign — funded by working people chipping in a few bucks here and there.\"\n\nFormer Vice President Joe Biden, California Sen. Kamala Harris and other Democratic presidential rivals have frequently organized traditional fundraisers. Former Texas Rep. Beto O'Rourke has attended such events, but livestreamed the proceedings so anyone can watch.\n\nSome Democrats and top fundraisers have grumbled that Warren's stance is hypocritical, noting that she spent years attending large fundraisers as a senator and now can use that money as she runs for president.\n\nStill, Warren raised $24.6 million during the third quarter, finishing close behind the Democratic money leader, Vermont Sen. Bernie Sanders, who raked in $25.3 million in the three-month period ending in September. Both showed the strength of relying on small donations , many of which come online, but also laid bare the challenge any Democrati will face: Trump and his allies raised $125 million over the same period.\n\nThat's a money gap Warren had previously suggested that she would use traditional fundraisers to fill if she made it through the Democratic primary. In a February interview with MSNBC she said, \"I do not believe in unilateral disarmament. We got to go into these fights, and we got to be willing to win these fights.\"\n\nWednesday's statement did not acknowledge her shift. \"When she is the nominee, she will continue to raise money and attend events that are open to the press to make sure the Democratic National Committee, state and local parties, and Democratic candidates everywhere have the resources not just to beat Donald Trump but also to win back Congress and state legislatures all across the country,\" the campaign said.\n\nWarren also promised to release in coming weeks a campaign finance plan to \"permanently break the stranglehold that the money-for-influence racket has on our politics.\" Sanders, who is at home recuperating from a heart attack last week but remains Warren's top rival for the progressive wing of the Democratic Party, came out with a campaign finance plan Monday. He proposed banning corporate contributions to the Democratic National Convention.\n\n\"When Bernie is the nominee, everything will fundamentally change for corporate elites,\" said Josh Orton, Sanders' campaign's policy director. \"Bernie Sanders fights for the people, cannot be bought, and is under no obligation to fulfill any transaction with a corporation trying to corruptly buy access.\"", "description": "Democratic presidential candidate Elizabeth Warren says she will keep shunning large-dollar fundraisers if she is the nominee, changing her earlier stand that doing so would be tantamount to \"unilateral disarmament\" against President Donald Trump and Republicans.  The Massachusetts senator", "authors": ["Will Weissert"], "top_image": "https://s.yimg.com/uu/api/res/1.2/fg2Ckx1uMg4LekoKsdRLBg--~B/aD0zNjQ4O3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/705ad4f9e1562649599d61767db9cdd6", "published_at": "2019-10-09"}