{"pub": "reuters", "url": "https://reuters.com/article/us-xilinx-results/huawei-exposure-roils-xilinxs-revenue-forecast-idUSKBN1X22KV", "downloaded_at": "2019-10-23 23:33:01.232114+00:00", "title": "Huawei exposure roils Xilinx's revenue forecast", "language": "en", "text": "(Reuters) - Xilinx Inc (XLNX.O) on Wednesday forecast current-quarter and full-year revenue below Wall Street estimates, the second major chipmaker this week to flag the impact of a prolonged U.S.-China trade dispute on its business.\n\nFILE PHOTO: A Xilinx sign is seen during the China International Import Expo (CIIE), at the National Exhibition and Convention Center in Shanghai, China November 6, 2018. REUTERS/Aly Song\n\nThe company said the forecast takes into account the impact from the U.S. government’s restrictions on Huawei Technologies Co Ltd and assumes no revenue from the Chinese telecommunications firm.\n\nXilinx, which has resumed some sales to Huawei since the ban in May, said the U.S. government has not approved its license applications to permit shipping more products to Huawei.\n\nShares of Xilinx, which makes programmable chips used in data centers, were down nearly 2% in extended trading.\n\nThe bleak outlook spooked investors and analysts alike, with “Huawei” finding 35 mentions in Xilinx’s post-earnings call, as brokerages scrambled to figure out the breadth of what Xilinx Chief Executive Officer Victor Peng described as a “significant impact”.\n\n“We really hope that the governments can come to agreement and resolve this structural issue so we can continue to engage with Huawei,” Peng said.\n\nOn Tuesday, chipmaker Texas Instruments Inc’s (TXN.O) current-quarter revenue forecast also missed Wall Street targets, as it blamed the trade war.\n\nTrade uncertainty is causing some customers to exercise caution in ordering, Peng noted, echoing similar concerns from Texas Instruments a day before.\n\nXilinx said it expects third-quarter revenue of between $710 million and $740 million, well below analysts’ average estimate of $844.9 million, according to IBES data from Refinitiv.\n\n“We believe that third quarter will be our low point and we expect to see a return to sequential revenue growth in our fourth quarter,” the company said.\n\nSummit Insights Group analyst Kinngai Chan said the tepid forecast takes away any further risks related to Huawei.\n\nXilinx expects fiscal year 2020 revenue of between $3.21 billion and $3.28 billion, below estimates of $3.4 billion.\n\nThe company’s board, which on Wednesday approved a share buyback plan of up to $1 billion, is looking for a new financial chief after CFO Lorenzo Flores said last month he is stepping down to pursue another executive opportunity. On the call, the company did not provide any update on the CFO transition.\n\nExcluding items, the company earned 94 cents per share in the quarter, above estimates of 89 cents.\n\nNet revenue increased 11.7% to $833.37 million, beating estimates of $824.8 million.", "description": "Xilinx Inc on Wednesday forecast current-quarter and full-year revenue below Wall Street estimates, the second major chipmaker this week to flag the impact of a prolonged U.S.-China trade dispute on its business.", "authors": ["Munsif Vengattil", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191023&t=2&i=1444277769&w=1200&r=LYNXMPEF9M1Y7", "published_at": "2019-10-23"}