{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/4/virginia-to-develop-4-new-solar-energy-projects", "downloaded_at": "2019-10-05 00:01:41.499614+00:00", "title": "Virginia to develop 4 new solar energy projects", "language": "en", "text": "RICHMOND, Va. (AP) - Permits were issued Thursday for the construction and operation of four new solar projects that are expected to offset carbon dioxide emissions in the state by 459 million pounds - the equivalent of driving more than 44,000 cars for a year.\n\n“Virginia is adopting solar technology at record rates, and we are building an economy that is cleaner and greener as a result,” Gov. Ralph Northam stated in a press release announcing the permits, issued by the Virginia Department of Environmental Quality.\n\nThe four new solar projects will produce an additional 192 megawatts of electricity. On average, 1 megawatt of solar energy can provide 190 homes with electrical power, according to the Solar Energy Industries Association.\n\nThe newly announced solar projects will consist of the following:\n\n.Danville Farm, which is being developed in Pittsylvania County by Strata Solar Development and will generate 12 megawatts of electricity.\n\n.Dragonfly Solar, which is being developed in Campbell County by Apex Clean Energy Holdings and will generate 80 megawatts of electricity.\n\n.Grasshopper Solar Project, which is being developed in Mecklenburg County by Dominion Energy Services and will generate 80 megawatts of electricity.\n\n.Turner Solar, which is being developed in Henrico County by Cypress Creek Renewables and will generate 20 megawatts of electricity.\n\n“Over the last five years, Virginia has seen a dramatic increase in installed solar developments,” DEQ Director David Paylor stated in a press release. “As of August this year, there are nearly a dozen small projects in Virginia producing 357 megawatts, enough to power more than 86,000 homes.”\n\nLast month, Northam issued Executive Order 43, which calls for 100% of Virginia’s electricity to come from carbon-free sources by 2050. The executive order also calls for 30% of the state’s electricity to be powered by renewable energy resources by 2030. In 2018, 7% of Virginia’s electricity was generated from renewable energy sources, according to the U.S. Energy Information Administration.\n\n“This Executive Order will help ensure that Virginia remains at the forefront of clean energy innovation, meets the urgency of the challenges brought on by climate change, and captures the economic, environmental, and health benefits of this energy growth in an equitable way that benefits all Virginians,” Northam stated in a press release when the executive order was issued.\n\nSolar energy developments can save taxpayers money. Partnering with Sun Tribe Solar, a Charlottesville-based company, Libbie Mill Library in Henrico County began installation of a rooftop solar system in September. The 122-kilowatt system is projected to save Henrico taxpayers $150,000 over the next 25 years.\n\nAccording to the governor’s executive order, at least 3,000 megawatts of electricity will be generated from solar and onshore wind sources by 2022. And by 2026, up to 2,500 megawatts of electricity will be generated by offshore wind sources. Currently, the state does not generate any large-scale electricity through wind farms, according to the U.S. Energy Information Administration.\n\nDominion Energy announced last month that it is building a 220-turbine wind farm off Virginia’s coastline. The project, projected to cost $7.8 billion, will be the largest offshore wind development in the U.S. Once the wind farm is complete, Dominion claims it will power 650,000 homes at peak wind.\n\n“Governor Ralph Northam has made it clear Virginia is committed to leading the way in offshore wind,” Mark Mitchell, vice president of generation construction for Dominion Energy, said in a press release. “We are rising to this challenge with this 2,600-megawatt commercial offshore wind development.”\n\nDEQ is responsible for administering state and federal environmental policy in Virginia. The agency issues permits to regulate levels of pollution throughout the state.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Permits were issued Thursday for the construction and operation of four new solar projects that are expected to offset carbon dioxide emissions in the state by 459 million pounds - the equivalent of driving more than 44,000 cars for a year.", "authors": ["The Washington Times Http", "Jimmy O'Keefe", "Capital News Service"], "top_image": "", "published_at": "2019-10-04"}