{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201909111199/apple-undercuts-rivals-with-streaming-price-wsj", "downloaded_at": "2019-09-11 07:25:52.547350+00:00", "title": "Apple Undercuts Rivals With Streaming Price — WSJ", "language": "en", "text": "By Tripp Mickle\n\nThis article is being republished as part of our daily reproduction of WSJ.com articles that also appeared in the U.S. print edition of The Wall Street Journal (September 11, 2019).\n\nCUPERTINO, Calif. -- Apple Inc. revealed a trio of upgraded iPhones, including a lower-priced model, and detailed its plans to enter the increasingly competitive video-streaming market with an offering that is cheaper than rivals.\n\nThe announcements came Tuesday at Apple's marquee product showcase, where this year the tech giant sought to balance its penchant for premium products with an emphasis on value. Apple is looking to offset slowing hardware sales by selling newer services, such as TV streaming, videogames and news -- and it is being aggressive on pricing to gain a foothold in those cutthroat industries.\n\nApple set monthly prices for its TV+ video-streaming service and Arcade videogame-streaming service at $4.99, largely undercutting rivals. TV+ comes free for a year with the purchase of a new iPhone, iPad or Mac, a perk that could get more people to buy a new device or upgrade. Apple can afford to discount the services because of the profits it earns on hardware and its distribution edge over competitors, with more than 1.4 billion devices in use world-wide.\n\nThe company is making just a handful of shows available for the TV+ debut in November, so the service will be a tough sell against the deeper programming catalogs offered by streaming rivals Netflix Inc. and Walt Disney Co. But at $4.99 a month, TV+ is much cheaper than Netflix's $12.99 monthly standard option and Disney's $6.99 monthly fee for a service expected to arrive in November.\n\n\"Clearly, they want their customers to use it and not feel forced to choose between it and Netflix or Hulu,\" said Carolina Milanesi, an analyst with Creative Strategies. She added that Apple could offer lower prices on services without affecting its historical brand position in hardware as a luxury-device maker.\n\nNetflix doesn't see the low prices as a threat, because they make it more likely Netflix customers won't be forced into a choice if they want to add another streaming service, an executive familiar with the company's strategy said.\n\nAt Tuesday's event -- held in the Steve Jobs Theater, the on-campus auditorium named after Apple's co-founder -- Apple lavished much of its time on the flagship device that Mr. Jobs helped create a dozen years ago. The new but familiar-looking iPhones, now under the iPhone 11 brand, blended standard updates such as longer-lasting batteries and new colors with more innovative features such as a night mode for low-light photos and the ability to shoot video by holding down the camera button.\n\nApple lowered the price of its most popular model by $50, countering three consecutive years of price increases. The iPhone 11, a 6.1-inch device that updates last year's XR model, will start at $699 and include a dual-rear camera. The iPhone 11 Pro and 11 Pro Max, with triple-rear cameras, play to the premium market with prices of $999 and $1,099.\n\nApple also introduced an updated smartwatch with improved power that allows it to display time throughout the day, and cut the price of an earlier model to its lowest point yet.\n\nThe company didn't reveal any surprise new devices, delivering instead the type of incremental hardware improvements that have defined its events in recent years and stirred up questions about Apple's innovation prowess under Chief Executive Tim Cook. Mr. Jobs's successor has transformed Apple into one of the world's most profitable companies but hasn't delivered a megahit product on par with the iPhone, which arrived in 2007, or the iPad, first released in 2010, the year before Mr. Cook took over.\n\nThe Apple Watch made its debut five years ago and has largely been a success, as have the more recent AirPods wireless earbuds, but not enough to shore up falling iPhone sales. Mr. Cook has since pushed Apple to leverage its hardware success to sell more software and services.\n\nTV+ will make its debut Nov. 1 with shows such as \"The Morning Show,\" a drama about a morning talk show starring Reese Witherspoon and Jennifer Aniston. Other shows will be added in the months afterward, Mr. Cook said.\n\nThe watch and new subscription services are central to Apple's efforts to diversify its business as the iPhone falters. Its customers are holding on to current iPhones longer and bristling at prices of new models that average nearly $1,000. Those struggles are particularly acute in China, where Apple is battling increased competition, trade tensions and a decelerating economy.\n\nApple also made the Apple Watch a better value, reducing the price of the Series 3 model about 30% to $199 and maintaining a price of $399 on its newest model, the Series 5.\n\nThe smartwatch prices showed Apple is willing to eat the cost of tariffs rather than pass them on to consumers. The Apple Watch was among its first products subjected to the 15% tariffs the Trump administration introduced on $111 billion in Chinese-made goods this month.\n\nApple can absorb the extra costs of tariffs without it affecting margins because memory prices have fallen in recent years, providing a cushion, analysts said.\n\nTo sustain growth, Apple must squeeze more money out of existing customers by leveraging past hardware success to sell newer products and services. It has over 900 million iPhone users world-wide, but only a fraction own an Apple Watch or pay for the company's streaming-music service. It has rolled out several new accessories and services to deepen its reach into users' wallets, including its AirPods, a credit card and a videogame service called Arcade.\n\nThe emphasis on services and newer products has coincided with several high-profile executive departures, including design chief Jony Ive, who will leave this year to start his own design firm. It has also revived questions about the company's ability to offer the type of hardware innovations that turned the iPhone into one of the world's best-selling products.\n\n\"Apple isn't growing like they were before,\" said Mike Frazier, president of Bedell Frazier Investment Counselling, a Walnut Creek, Calif.-based firm with about $500 million under management that counted Apple as its largest holding before scaling back its investment this year. \"They're a victim of their own success.\"\n\nApple needs to encourage enough iPhone upgrades to avoid repeating the smartphone sales slump that dogged the company last year, forcing it to slash its revenue forecast in January for the first time in more than 15 years. World-wide sales of the company's smartphones fell 15% to $109.02 billion for the three quarters ended in June. Shipments have declined an estimated 17% over that period, according to analysts, outpacing the smartphone industry's projected decline of 2% this year.\n\nWall Street has already begun to look ahead to next year's models that are expected to feature 5G, a faster fifth generation of wireless technology that will result in speedier smartphones. Apple will be lagging behind rivals such as Huawei Technologies Co. and Samsung Electronics Co. in bringing that technology to market.\n\n\"They will lose market share in China in the premium space without 5G because the country is going to ensure 5G is relevant,\" said Patrick Moorhead, principal analyst at Moor Insights & Strategy. \"That will trigger adoption of Huawei, Xiaomi and others and hurt Apple.\"\n\nDow Jones & Co., publisher of The Wall Street Journal, has a commercial agreement to supply news through Apple services.\n\n--Amol Sharma contributed to this article.\n\nWrite to Tripp Mickle at Tripp.Mickle@wsj.com\n\n(END) Dow Jones Newswires\n\nSeptember 11, 2019 02:47 ET (06:47 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-09-11"}