{"pub": "news24", "url": "https://businessinsider.co.za/built-robotics-brings-self-driving-to-construction-2019-4", "downloaded_at": "2019-10-23 15:10:26.417626+00:00", "title": "This start-up construction company wants to tune-up excavators with self-driving tech", "language": "en", "text": "A tech start-up construction company wants to tune-up excavators with self-driving tech.\n\nThey’re meant to do the basic menial tasks of drivers, so humans can focus on the more complex work.\n\nAnd also meet the need for a shortage of trained drivers.\n\nFor more, go to Business Insider South Africa.\n\nA start-up construction company is taking self-driving technology and adapting them for construction.\n\nThey call themselves Built Robotics and their idea is to tune up excavators with technology that will allow them to drive themselves and do the basic jobs of moving earth, leaving more time for expert drivers to do the tasks that demand more finesse.\n\n“There is a huge issue in construction right now. We can’t find enough people who are qualified to do the work that needs to be done,” Bilt’s co-founder Noah Ready-Campbell, told Tech Crunch.\n\nA 2017 McKinsey Global Institute report found that labour productivity in construction has fallen 50% since 1970, with the industry stagnating. The report found a building today costs twice as much as it did 40 years ago to build. With increasing costs and a shortage of labour, the industry is ripe for innovation.\n\n\n\nOne doesn’t have to look too far in South Africa for its own examples of ailing construction companies with Basil Read and Group 5 both going bust.\n\nRead more: These SA highway projects have been left half-finished after two construction giants went bust\n\nOn top of Built Robotics excavators is a black boot filled with hardware like lidar, GPS and Wi-Fi. This gives it the ability to autonomously map and navigate its surroundings.\n\n\n\nBuilt wants to make this black boot work across the popular equipment already out on job site. They sell and rent the kits to companies, then charge a usage fee whenever the machine is working in its autonomous mode.\n\nThe excavators can also be operated using a game controller and comes with a remote emergency cut-off switch.\n\nRead more: A decade ago, Basil Read was SA’s top company. It has just gone bust\n\nAccording to Tech Crunch it’s still early days for Built. They have a research fleet of seven vehicles, and they’re coming up on their tenth completed construction project; all in all, their fleet has about 6,000 hours of operating time.\n\n\n\nBut they should be good to keep rolling for a whole lot longer, with the company having R1.4 billion in contracts now signed.\n\nReceive a single WhatsApp every morning with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "They’re meant to do the basic menial tasks of drivers, so humans can focus on the more complex work.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7204/a8e61e96ed4148f9a522eb38a9856d93.png", "published_at": "2019-04-29"}