{"pub": "metro", "url": "https://metro.co.uk/2019/10/25/kim-kardashians-bestie-larsa-pippen-wears-xena-style-loincloth-to-paris-hiltons-halloween-party-10983808", "downloaded_at": "2019-10-26 00:01:24.747894+00:00", "title": "Paris Hilton's Halloween do saw Kim Kardashian's BFF go full Xena", "language": "en", "text": "Larsa Pippen slinks into Paris Hilton’s Halloween party wearing Xena-style costume (Picture: Mega)\n\nJust when you thought Xena’s trademark outfit couldn’t get any more racy, Kim Kardashian’s bestie Larsa Pippen rocked up to Paris Hilton’s Halloween party to help you think otherwise.\n\nThe 45-year-old Keeping Up With The Kardashians star attended the annual Halloween bash on Thursday evening dressed in a gold bra and matching loincloth, held together with an intricate combination of black straps.\n\nAnd can we just say – she looks absolutely incredible.\n\nShe accessorised her outfit with thigh-high strappy heels, gold shoulder armour, a gold choker, and a killer medieval hairdo to match.\n\nThat is an outfit (Picture: Mega)\n\nLet’s hope she didn’t have any wardrobe malfunctions throughout the night.\n\nLarsa posted a series of videos to her Instagram story showing pal and Aussie model Shanina Shaik dropping it down on the dance floor with hostess, Paris (who got her costume from a place literally called Trashy Lingerie).\n\nOh to be a fly on the wall at *that* Halloween party (Picture: Mega)\n\nAnother video features the girls, joined by Sports Illustrated model Jasmine Sanders laughing, pouting and hugging each other while dancing.\n\nAdvertisement\n\nAdvertisement\n\nOh to be a fly on the wall at *that* Halloween party.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nLarsa Pippen is one of Kim Kardashian’s best friends, who manages her own beauty/lifestyle magazine, Life With Larsa.\n\nThe Assyrian-Lebanese model also had a stint on the Real Housewives Of Miami.\n\nHowever, she’s best known for being married to basketball player Scottie Pippen whom she has four children with.\n\nAnd more recently – for spilling the tea on Jordyn Woods and Tristan Thompson.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Jon Bernthal quit NCIS to join The Walking Dead: ‘People thought I was out of my mind’\n\nMORE: Big Momma’s House star claims he’s being punished for playing gay character and wearing dress in movies", "description": "Kim Kardashian's bestie Larsa Pippen wears a racy Xena-style loincloth to Paris Hilton's Halloween party.", "authors": ["James Besanvalle"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_92226987_1572020845.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-25"}