{"pub": "realclearpolitics", "url": "https://theatlantic.com/ideas/archive/2019/09/atheism-fastest-growing-religion-us/598843", "downloaded_at": "2019-09-26 14:54:46.377987+00:00", "title": "Three Decades Ago, America Lost Its Religion. Why?", "language": "en", "text": "The obvious question for anybody who spends at least two seconds looking at the graph above is: What the hell happened around 1990?\n\nAccording to Christian Smith, a sociology and religion professor at the University of Notre Dame, America’s nonreligious lurch has mostly been the result three historical events: the association of the Republican Party with the Christian right, the end of the Cold War, and 9/11.\n\nThis story begins with the rise of the religious right in the 1970s. Alarmed by the spread of secular culture—including but not limited to the sexual revolution, the Roe v. Wade decision, the nationalization of no-fault divorce laws, and Bob Jones University losing its tax-exempt status over its ban on interracial dating—Christians became more politically active. The GOP welcomed them with open arms. The party, which was becoming more dependent on its exurban-white base, needed a grassroots strategy and a policy platform. Within the next decade, the religious right—including Ralph Reed’s Christian Coalition, James Dobson’s Focus on the Family, and Jerry Falwell’s Moral Majority—had become the Republicans’ organizing and fundraising powerhouse. In 1980, the GOP social platform was a facsimile of conservative Christian views on sexuality, abortion, and school prayer.\n\nRead: Evangelical fear elected Trump\n\nBut the marriage between the religious and political right disgusted liberal Democrats with weak connections to the Church. It also shocked the conscience of moderates, who preferred a wide berth between their faith and their politics. Smith said it’s possible that young liberals and loosely affiliated Christians first registered their aversion to the Christian right in the early 1990s, after a decade of observing its powerful role in conservative politics.\n\nSecond, it may have felt unpatriotic to confess one’s ambivalence toward God while the U.S. was locked in a geopolitical showdown with a godless Evil Empire. In 1991, however, the Cold War ended. As the U.S.S.R. dissolved, so did atheism’s association with America’s nemesis. After that, “nones” could be forthright about their religious indifference, without worrying that it made them sound like Soviet apologists.\n\nThird, America’s next geopolitical foe wasn’t a godless state. It was a God-fearing, stateless movement: radical Islamic terrorism. A series of bombings and attempted bombings in the 1990s by fundamentalist organizations such as al-Qaeda culminated in the 9/11 attacks. It would be a terrible oversimplification to suggest that the fall of the Twin Towers encouraged millions to leave their church, Smith said. But over time, al-Qaeda became a useful referent for atheists who wanted to argue that religion was inherently destructive.\n\nMeanwhile, during George W. Bush’s presidency, Christianity’s association with unpopular Republican policies drove more young liberals and moderates away from both the party and the Church. New Atheists, such as Christopher Hitchens and Sam Harris, became intellectual celebrities; the 2006 best seller American Theocracy argued that evangelicals in the Republican coalition were staging a quiet coup that would plunge the country into disarray and financial ruin. Throughout the Bush presidency, liberal voters—especially white liberal voters— detached from organized religion in ever-higher numbers.\n\nReligion has lost its halo effect in the past three decades, not because science drove God from the public square, but rather because politics did. In the 21st century, “not religious” has become a specific American identity—one that distinguishes secular, liberal whites from the conservative, evangelical right.", "description": "“Not religious” has become a specific American identity—one that distinguishes secular, liberal whites from the conservative, evangelical right.", "authors": ["Derek Thompson", "Staff Writer At"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/GettyImages_867182236/facebook.jpg?1569449364", "published_at": "2019-09-26"}