{"pub": "guardian", "url": "https://theguardian.com/sport/2019/sep/30/samu-kerevi-all-we-want-is-consistency", "downloaded_at": "2019-09-30 10:44:05.110167+00:00", "title": "Samu Kerevi voices fear that rugby union is becoming 'soft'", "language": "en", "text": "Samu Kerevi has called on the authorities to bring in players to advise on the regulations covering the contact area, fearing that the game will cease to be a collision sport and become soft.\n\nThe World Cup has been blighted by reviews on high tackles and citing commissioners overruling referees and television match officials to the point where crowds at matches, who are not told what is going on, are venting their frustration. But a new line was drawn on Sunday when Australia centre Kerevi was penalised for leading with his arm when confronted by the Wales outside-half Rhys Patchell.\n\nMichael Cheika's flawed selection process undoes Wallabies | Bret Harris Read more\n\nAs his opponent stood tall in bracing for contact, rather than looking to tackle the midfielder around the waist or legs, Kerevi raised his left arm to the height of Patchell’s chest to prevent his head from smashing into the Welshman’s right shoulder, but was warned for dangerous play. The previous week, Australia’s wing Reece Hodge was cited and banned for a similar challenge to Patchell’s.\n\n“When the incident was reviewed, some of the boys thought it was Rhys Patchell’s challenge that was being reviewed,” said Kerevi. “I could not see why because it was not high and I felt fine. Then I realised they were looking at me and I was shocked. It was the first time I had been reviewed for running with the ball.\n\n“I just hoped I was not going to get a card. Michael Hooper [Australia’s captain] was asking how I was meant to run when I next had the ball. The referee said I could lead with my arms but not go for the neck, but that is what I had done. It just looked worse in slow motion. All I did was continue my stride. There is no way I would put my arm in someone’s face, I know the rules.\n\n“I respect the referee’s decision and I understand the pressure they are under, and not just from the media. But is there a ruling on the way we are meant to run? Players understand that rugby is a collision sport and all we want is consistency. You would think that players would be involved in drawing up these rules and you have to understand it from our point of view.\n\n“You have a split second in which to react. I want to be physical because rugby is a tough sport. We put our bodies on the line. We know there are things you cannot do and that safety is important, but I really do not know what else I could have done in that challenge on Sunday. I might just as well avoid the contact, but that is not my game and I do not want it to become soft.”\n\nKerevi said after the match that he might as well make the switch to rugby league, where thumping collisions remain a feature of the game. He is remaining in Japan after the World Cup having signed a contract with Suntory.\n\n“I was joking but being serious at the same time,” said the 26-year old, who was born in Fiji. “There are collisions in league and I enjoy that stuff. It is why you play. I do not think players from the Pacific Islands are being targeted in the World Cup: there are big boys of all nationalities out there. What is needed is consistency. I just want to get on with playing.\n\n“The pity in all this is that we should be talking about the amazing game between Japan and Ireland. I understand the media want juicy stories, but that game was what a World Cup is all about. It is the type of story that needs to be focused on.”", "description": "The Wallabies vice-captain has called on the authorities to bring in players to advise on the regulations covering the contact area", "authors": ["Paul Rees"], "top_image": "https://i.guim.co.uk/img/media/5ee38b096b1e76dddc050e2b0b9944453ced6fe3/0_85_2266_1358/master/2266.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=bc4d837eace94206a1b00d9d7c4a5e28", "published_at": "2019-09-30"}