{"pub": "investing.com", "url": "https://uk.investing.com/analysis/uk-consumer-spending-top-estimates-200433535", "downloaded_at": "2019-10-17 09:20:29.164567+00:00", "title": "UK Consumer Spending Top Estimates", "language": "en", "text": "According to the latest economic data, consumer spending once more came in better than expected last month with the figures for September topping consensus forecasts. This has been a common theme for much of the year with 7 of the 9 months seeing this data point come in better than expected reflecting a resilient level of consumer spending in the face of great uncertainty.\n\nOn the flip side this could just as well be explained by overly pessimistic economists, with the last 8 consensus forecasts predicting month-on-month drops.\n\nThis is the third UK data point in as many days but the impact they have had on the market could be described as fleeting at best, with traders’ continuing to focus on Brexit and chase the latest headlines.\n\nThe is trading a little lower on the day after news broke earlier that the DUP is not on board with the current suggestions on customs. With the EU summit beginning today, the general feeling is that the majority of a new deal has been agreed upon but there are still a couple issues that need to be ironed out before it can be brought back for a vote in the UK parliament. The chances of it passing through the house of commons also rest on a knife edge, with the ERG likely to support it while the DUP seem to be holding out.\n\nThere have been separate reports that the opposition would back an amendment to put the deal to a confirmatory referendum but as is often the case with Labour’s Brexit stance it is not clear that the whole party are singing from the same hymn sheet.\n\nOverall sterling remains close to recent highs and it is worthwhile drawing a comparison with the moves seen in the run-up to the 2016 referendum. The 6 day’s leading into the vote over 3 years ago saw rise by around 7%, and from last Thursday’s low to yesterday’s high marked a gain of 5.5%. Given the clear differences between the current environment and that back in June 2016 it would be highly surprising if we got anywhere near as large a drop should we get a major disappointment in the coming days. Having said that, there is a clear similarity in the markets with investors positioning themselves for a favourable outcome that could well not transpire, and should this play out then a swift reversal of the moves seen in the week would ensue.", "description": "Forex Analysis by XTB (David Cheetham) covering: GBP/USD. Read XTB (David Cheetham)'s latest article on Investing.com UK.", "authors": [], "top_image": "https://uk.investing.com/analysis/not found", "published_at": "2019-10-17"}