{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/blockchain-healthcare-firm-wins-us-national-science-foundation-grant", "downloaded_at": "2019-10-11 00:54:39.480474+00:00", "title": "Blockchain Healthcare Firm Wins US National Science Foundation Grant", "language": "en", "text": "New England-based blockchain firm SimplyVital Health, Inc. has received a $225,000 grant from the United States National Science Foundation (NSF) to research integration of its protocol Nexus with the Graphene protocol.\n\nThe NSF awarded the grant as part of its Small Business Programs, which contributes $200 million annually to innovative startups and small businesses, according to an Oct. 10 press release from SimplyVital Health.\n\nAiming to decrease healthcare costs\n\nSimplyVital will allocate the grant to research and development into integration of the Graphene protocol into its blockchain protocol, Nexus, which touts compatibility with the Health Insurance Portability and Accountability Act. The Graphene protocol is designed to reduce bandwidth to distribute blocks to other nodes in order to improve blockchain performance and cut its costs at the same time.\n\nSpecifically, the company is looking to find a way to reduce healthcare costs by enabling data access through blockchain technology. Commenting on the development, Andrea Belz, division director of the division of industrial innovation and partnerships at NSF, said:\n\n\"NSF is proud to support the technology of the future by funding the most creative, impactful ideas. With our support, deep technology startups can guide basic science into meaningful solutions that address tremendous needs.\"\n\nThe value of blockchain in the healthcare sector\n\nThe value of blockchain technology in the healthcare market is expected to surpass $1.6 billion by 2025 due to a number of factors like implementation of government initiatives and increasing investment in the field. Indeed, organizations around the world have been making a pivot to blockchain.\n\nJust recently, blockchain startup MediConnect completed a workflow for a Proof-of-Concept designed to track medications through the supply chain and began integration of online pharmacy UK Meds’ processes to its platform. This will purportedly enable tracking and managing of prescription medication through the supply chain.", "description": "SimplyVital Health has received a $225,000 grant from the U.S. National Science Foundation to research means of reducing healthcare costs", "authors": ["Ana Alexandre"], "top_image": "https://images.cointelegraph.com/images/740_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy8wNzExYTUyMjAxMmQ3MDhiMWFhNDVhZWRhNTM4ODI4OS5qcGc=.jpg", "published_at": "2019-10-11"}