{"pub": "investing.com", "url": "https://ca.investing.com/news/economy/outlier-bull-says-indian-traders-too-skeptical-over-deficit-1985077", "downloaded_at": "2019-10-16 05:14:02.937158+00:00", "title": "Outlier Bull Says Indian Traders Too Skeptical Over Deficit", "language": "en", "text": "(Bloomberg) -- Most Indian traders are acting like the best days of the bond market are behind it as they wait for the government to blow out the budget.\n\nBut Jayesh Mehta, a veteran trader at Bank of America Merrill Lynch (NYSE: ) is a rare bull in Mumbai’s fixed-income world. He thinks fresh gains are just around the corner.\n\nSovereign debt sold off in the past two months on fears Prime Minister Narendra Modi will expand the record 7.1 trillion rupees ($100 billion) in borrowings to support a slowing economy. The rout diminished the impact of Asia’s most aggressive monetary-policy easing and a banking system that’s flushed with liquidity.\n\n“Bond traders are pricing in fiscal slippage and higher borrowings,” but “our view is that the government will meet its deficit targets,” said Mehta, BofAML’s country treasurer. ‘Right now, market is skeptical but I reckon it will eventually change and see the 10-year yield dip below 6% by end of March.”\n\nThe yield on notes due in January 2029 was little changed at 6.66% at 9:23 a.m. in Mumbai after falling by seven basis points in the previous two sessions.\n\nBonds will benefit from as much as 75 basis points of rate cuts, ample liquidity in the banking system and a clarification from the government on extra borrowings, according to Mehta.\n\nI am “bullish on bonds,” he said, adding the RBI will focus on supporting growth even if inflation inches higher.\n\nFor Mehta, the 30-year bond veteran, going against the crowd and winning has become the norm. Early this year he correctly predicted the central bank would ease; he got the call right in 2017, too. Last August, he forecast a drop in yields.\n\nDebt Support\n\nHis forecast now for yields to drop below 6% compares with a consensus forecast of 6.45% by end of the fiscal year in March. And his estimate of as much as 75 basis points of RBI rate reductions is more aggressive than the median for 25 points in a Bloomberg survey.\n\nMehta is also predicting the RBI can take a leaf from the Federal Reserve and the European Central bank and help curtail the budget deficit by buying government debt through its open-market operations, a move that will that will also support yields.\n\nThe central bank could buy $15 billion of bonds in the next six months, according to estimates of BofAML’s India economists. The authority in August already approved a record 1.76 trillion-rupee ($24.4 billion) payout to the government.\n\n“The central bank can monetize the fiscal deficit by buying bonds,” said Mehta. “The U.S. Fed and other Central banks are doing it, so it’s likely the RBI may also do the same.”\n\n(Updates with Wednesday’s yield in fifth paragraph)", "description": "Outlier Bull Says Indian Traders Too Skeptical Over Deficit", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/content/pic0654db3183c63ff673aa72b70f156b77.jpg", "published_at": "2019-10-16"}