{"pub": "news24", "url": "https://city-press.news24.com/News/the-da-is-no-longer-what-i-signed-up-for-mashaba-on-his-resignation-20191021", "downloaded_at": "2019-10-21 10:31:02.557678+00:00", "title": "‘The DA is no longer what I signed up for’ – Mashaba on his resignation", "language": "en", "text": "News ‘The DA is no longer what I signed up for’ – Mashaba on his resignation\n\nThe election of Helen Zille as the chairperson of the federal council represents a victory for people in the DA who stand diametrically opposed to outgoing Joburg mayor Herman Mashaba’s beliefs and value system.\n\nThese were the words of Mashaba, who announced his resignation both as the mayor and as a member of the DA, on Monday morning.\n\nHis last day in office will be November 27.\n\nIn his speech, Mashaba said that following the outcome of the party’s federal council meeting which took place over the weekend in which former DA leader Zille was appointed as the federal chairperson, he said he was “gravely concerned that the DA I signed up for is no longer the DA that has emerged out of this weekend’s federal council”.\n\n“The election of Helen Zille as the chairperson of the federal council represents a victory for people in the DA who stand diametrically opposed to my beliefs and value system, and I believe those of most South Africans of all backgrounds,” he said.\n\nRead:‘I will stay in my lane’ – Zille after being elected DA federal council chair\n\nMashaba, who spoke openly about tensions within the party, alluded to certain members in the DA in Johannesburg who have suggested prioritising the needs of suburban residents “above providing dignity to those forgotten people who remain without basic services 25 years after the end of apartheid”.\n\n\n\nHe also said that since the coalition government was formed, the DA was the “most difficult coalition partner” in this arrangement.\n\n“Despite the DA only winning 36% of the vote in 2016, elements in the party have expected me to govern arrogantly as if I have an outright majority. I have had to deal with people who draw the artificial distinctions between service delivery in informal settlements and suburbs as a binary, and either-or-type-approach,” he said critically.\n\nCity Press reported on Sunday that DA leader Mmusi Maimane – who has been under scrutiny since the release of the review panel report that assessed the party’s leadership and bad electoral performance at the May 8 general elections and called for Maimane to consider stepping down – dared those threatening to form a breakaway party to take their leave if they no longer identified with the party’s “project”.\n\nThe view of Maimane stepping down was defeated at the meeting over the weekend.\n\nRead:Mmusi Maimane dares critics to leave DA now\n\nTensions within the party have increased in recent months, with a group known as the “true liberals” showing resistance towards Maimane’s leadership.\n\n", "description": "The election of Helen Zille as the chairperson of the federal council represents a victory for people in the DA who stand diametrically opposed to outgoing Joburg mayor Herman Mashaba’s beliefs and value system.", "authors": ["Staff Reporter"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/104/1384f86ebf37484b9a015a62e05fe0d0.jpg", "published_at": "2019-10-21"}