{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7617189/Woman-78-gets-22-years-attempted-murder-lawyer.html", "downloaded_at": "2019-10-28 07:37:10.443499+00:00", "title": "Woman, 78, gets 22 years for attempted murder of lawyer", "language": "en", "text": "Patricia Currie of Mandeville was 75 when she turned up at the office of Keith Couture in October 2016, wearing latex gloves, plastic grocery bags on her feet and a shotgun hidden beneath a towel\n\nA 78-year-old Louisiana woman has been sentenced to 22 years in prison for trying to kill her attorney who had represented her in a bankruptcy case days before.\n\nPatricia Currie of Mandeville was 75 when she turned up at the office of Keith Couture in October 2016, wearing latex gloves, plastic grocery bags on her feet and a shotgun hidden beneath a towel.\n\nCouture walked into the office alone to find Currie sat in the lobby with a towel placed across her lap.\n\n'When I approached her in my waiting room, I asked her what she was doing,' he told DailyMail.com days afterward. 'She said \"I'm here to kill you\"’.\n\n'She lifted up the gun, and the barrel came out from under the towel. I grabbed the end of the rifle and pushed it away, and wrestled the gun away from her.'\n\nCouture managed to wrestle the weapon away from Currie and called the Sheriff's Office. Deputies found the gun was loaded and that she had four additional shells in her undergarments, as well as a box of ammunition in her car.\n\nCouture (pictured) walked into the office alone to find Currie sat in the lobby with a towel placed across her lap. 'When I approached her in my waiting room, I asked her what she was doing,' he told DailyMail.com. 'She said \"I'm here to kill you\"’.\n\nCurrie testified that she was just trying to scare Couture. He had tried unsuccessfully a few weeks earlier to withdraw as her attorney in a bankruptcy case.\n\nCouture and Currie had 'disagreed fundamentally on the direction and the procedure to take,' according to court documents, but a judge rejected Couture's request.\n\nIn a powerful victim impact statement on Friday, Couture said he could only think of his wife and children as he fought for his life, with his wife also saying the crime continues to haunt the family still, even three-years-on.\n\nCurrie testified that she was just trying to scare Couture. He had tried unsuccessfully a few weeks earlier to withdraw as her attorney in a bankruptcy case\n\nProsecutors argued that Currie should receive the maximum sentence of 50 years for her crimes, while the defense sought the minimum of 10 years.\n\nJudge Zaunbrecher settled on a 22-year sentence, citing the violent nature of the crime, the shotgun, her lack of truthfulness, candor or remorse were mitigated by the fact that she had no prior convictions, according to the news release.\n\nLetters written by Currie were also revealed in court, in which she wrote she understands why people ‘like blowing up buildings and opening fire on anybody & everybody,’ adding, ‘That's the way I feel.’\n\nIf she serves the whole term, she'll be 100 at its end.", "description": "Patricia Currie of Mandeville was 75 when she turned up at the office of Keith Couture in October 2016, wearing latex gloves, plastic grocery bags on her feet and clutching a shotgun.", "authors": ["Luke Kenton For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/05/20268536-0-image-a-18_1572242237690.jpg", "published_at": "2019-10-26"}