{"pub": "yahoo", "url": "https://news.yahoo.com/pence-declines-share-documents-house-220935098.html", "downloaded_at": "2019-10-16 01:14:48.518516+00:00", "title": "Pence declines to share documents with House impeachment inquiry: counsel", "language": "en", "text": "U.S. Vice President Mike Pence arrives ahead of the start of the 74th session of the United Nations General Assembly at U.N. headquarters in New York City, New York, U.S.\n\nWASHINGTON (Reuters) - Vice President Mike Pence declined on Tuesday to submit documents to the House of Representative committees pursuing an impeachment inquiry of President Donald Trump, his office said, calling the probe \"self-proclaimed\" and the requests for information too broad.\n\nPence's counsel, Matthew Morgan, said in a letter to three Democratic lawmakers that the scope of documents requested included some \"which are clearly not vice-presidential records.\"\n\nMorgan said Pence's office was prepared to work with the committees if they \"wish to return to the regular order of legitimate legislative oversight requests, and the Committees have appropriate requests for information solely in the custody of the Office of the Vice President.\"\n\nThe White House considers the Democratic-led House's impeachment process to be unfair and without due process.\n\nMorgan's letter went over many of the same concerns the White House counsel outlined last week in a letter to House Speaker Nancy Pelosi. \"As detailed in the White House Counsel Letter, the House of Representatives has not authorized any 'impeachment inquiry,'\" it said.\n\nThe letter encouraged the committees to \"forgo their request to the Office of the Vice President, or hold it in abeyance, pending your discussion with the White House Counsel's Office concerning compliance with constitutionally mandated procedures.\"\n\nThe letter was addressed to Representative Elijah Cummings, who chairs the House Committee on Oversight and Reform; Representative Adam Schiff, who chairs the House Permanent Select Committee on Intelligence; and Representative Eliot Engel, who chairs the House Committee on Foreign Affairs.\n\n\n\n\n\n(Reporting by Jeff Mason; Editing by Chris Reese and Peter Cooney)", "description": "Vice President Mike Pence declined on Tuesday to submit documents to the House of Representative committees pursuing an impeachment inquiry of President Donald Trump, his office said, calling the probe \"self-proclaimed\" and the requests for information too broad.  The White House considers", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/z26SyjHYW6k9CkZk.OaEKw--~B/aD0zMDc7dz00NDk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/05487254c69c482e1a4840982b0d5793", "published_at": "2019-10-15"}