{"pub": "guardian", "url": "https://theguardian.com/food/2019/oct/19/yotam-ottolenghi-family-recipes-hoppel-poppel-cucumber-yoghurt-soup-chicken-coconut-curry", "downloaded_at": "2019-10-19 10:59:09.910764+00:00", "title": "From coconut curry to hoppel poppel: Yotam Ottolenghi’s family recipes", "language": "en", "text": "The food legacy handed down to me by my parents is probably best embodied by hoppel poppel, a leftovers dish featuring potato, onion, sausage and egg, all mixed together into a glorious hodgepodge. It’s a kind-of bubble and squeak, and comes from my mother’s German heritage but, with pork sausage at its core, it couldn’t be more distasteful to the two other cultures that dominated my early years in Israel: Jewish and Arabic.\n\nIt also didn’t work at all for my father, a proud Italian and a master of refined understatement in the kitchen. The beauty of today, though, is that I get to choose my childhood favourites from a whole range of formidable and delicious traditions.\n\nChilled cucumber and yoghurt soup (above)\n\nThis soup is a speciality of my father’s. It uses the tiniest amount of potato to thicken the base while still keeping the soup light and fresh. My dad would buy in pickles to garnish his, but I’ve made my own quick one here. You can go either way.\n\nPrep 20 min\n\nChill 1 hr-plus\n\nCook 30 min\n\nServes 4 as a light lunch\n\n2 cucumbers, 1 sliced into ¼cm-thick rounds, the other roughly chopped\n\nSalt and black pepper\n\n2½ tbsp white-wine vinegar\n\n1½ tsp caster sugar\n\n1 medium (130g) maris piper potato, peeled and cut into 1½cm cubes\n\n2 leeks, cleaned, trimmed and roughly chopped (250g net weight)\n\n350g Greek-style yoghurt\n\n80g ice cubes\n\n20g roughly chopped parsley\n\n2 garlic cloves, peeled and crushed\n\n3 tbsp olive oil\n\nIn a medium bowl, toss the sliced cucumber with a teaspoon and a half of salt, then tip into a colander and set it back over the bowl. Leave to sit for 20 minutes, to draw out as much liquid as possible, then push down gently on the cucumber and transfer to a clean bowl; discard the salty liquid. Add the vinegar and sugar, toss to mix, then leave to pickle for 30 minutes while you get on with the soup.\n\nPut the potato and 700ml water in a medium saucepan on a medium-high heat and bring to a boil. Once it’s simmering, add the leeks and cook for eight minutes, or until the vegetables have softened. Drain and leave to cool for 15 minutes.\n\nTransfer the leeks and potatoes to a blender, add the yoghurt, ice, parsley, garlic, two tablespoons of olive oil, 100ml water, all the chopped cucumber, 150g of the pickled cucumber and a tablespoon and a half of its pickling liquid, three-quarters of a teaspoon of salt and a good grind of pepper, then blend until very smooth. Transfer to the fridge to chill for about an hour, or longer if you want to get ahead.\n\nTo serve, divide between four bowls, top with the remaining pickled cucumber (discarding its liquid) and drizzle with the last tablespoon of oil.\n\nHoppel poppel\n\nMy mother made this, a Berliner dish that became very popular in the American midwest, with leftover cooked potatoes. The meat element can be sausage (any sausage, really) or bacon, and she’d serve it with a tomato and cucumber salad dressed with lemon juice, olive oil and crushed garlic.\n\nFacebook Twitter Pinterest From Berlin via Ohio: Yotam Ottolenghi’s hoppel poppel.\n\nPrep 20 min\n\nCook 30 min\n\nServes 4\n\n8 large eggs\n\n2 tbsp double cream\n\n5g chives, cut into 1cm lengths, plus 1 tbsp extra to garnish\n\nSalt and black pepper\n\n40g unsalted butter\n\n2 tbsp olive oil\n\n1 large onion, peeled, halved and cut into ¼cm-thick slices\n\n250g cooked waxy potatoes (eg, charlottes), peeled and cut into roughly 2cm cubes\n\n200g frankfurters, cut at a slight angle into ½cm-thick slices\n\n1 green pepper, stem, pith and seeds removed, cut into roughly 1½cm cubes (130g net weight)\n\n80g mozzarella block (ie, low-moisture mozzarella), roughly grated\n\nIn a bowl, beat the eggs, cream, chives, half a teaspoon of salt and plenty of pepper and set aside.\n\nMelt 30g of the butter with all the oil in a large, nonstick saute pan on a medium-high heat. Once hot, fry the onion, stirring occasionally, until softened and lightly browned – about six minutes. Add the potato and frankfurters, half a teaspoon of salt and a good grind of pepper, and fry, again stirring occasionally, until everything is starting to brown and crisp up – another five or so minutes. Stir in the green pepper and cook, shaking the pan often, until it softens and everything is nicely coloured – about seven minutes.\n\nTurn down the heat to medium, add the last 10g butter and swirl the pan to melt. Pour in the egg mix, sprinkle on the cheese and cook for about three minutes, gently folding over the mixture here and there with a spatula, though without mixing everything completely together. Sprinkle over the extra chives and serve directly from the pan.\n\nMalaysian coconut chicken curry\n\nMy mum’s favourite cookbook was Myra Waldo’s The Complete Round-The-World Cookbook from 1954. It would take her to all corners of the globe, and we were her guinea pigs. This sweet, coconutty dish became her favourite, and ours, too. It’s not one bit authentic, but it is addictive. Serve with plain or sticky rice.\n\nFacebook Twitter Pinterest Yotam Ottolenghi’s Malaysian coconut chicken curry.\n\nPrep 30 min\n\nCook 1 hr 30 min\n\nServes 4\n\n100g fresh coconut, finely grated\n\n50g piece fresh ginger, peeled and roughly chopped\n\n6 garlic cloves, peeled and roughly chopped\n\n20g fresh turmeric, peeled and roughly chopped (or ½ tsp ground turmeric)\n\n1 red chilli, roughly chopped, seeds, pith and all\n\n2 tsp ground star anise\n\n1 tbsp coriander seeds, roughly crushed in a mortar\n\n2½ tbsp sunflower oil\n\n1 onion, peeled and finely chopped (150g net weight)\n\n1kg boneless and skinless chicken thighs, each cut into 4 pieces\n\nSalt and black pepper\n\n1-2 limes – zest grated, to get 1 tbsp, and juiced, to get 1 tbsp\n\n2½ tbsp plum (or apricot) jam\n\n130ml full-fat coconut milk, plus 1 tbsp extra to serve\n\n2 tbsp coriander leaves, picked\n\nPut a large saute pan for which you have a lid on a medium heat and, once hot, dry-fry the grated coconut, stirring often, for about 20 minutes, or until golden. Tip into a bowl, and set aside one tablespoon to garnish.\n\nMeanwhile, put the ginger, garlic, turmeric, chilli, star anise, coriander seeds and three tablespoons of water in the small bowl of a food processor and blitz to a coarse paste, scraping down the sides a few times as you go.\n\nHeat the oil in the same saute pan on a medium-high flame and, once hot, fry the onion, stirring now and then, until softened and lightly browned – about seven minutes. Add the spice paste and cook for another two minutes, until fragrant. Add the chicken, a teaspoon and a quarter of salt and a good grind of pepper, and cook, stirring occasionally, until the meat is no longer pink on the outside – another seven minutes or so – then stir in the lime zest, jam, coconut milk, 120ml water and the toasted coconut. Bring the mix up to a simmer, then lower the heat to medium-low, cover the pan and leave to cook for 40 minutes. Remove the lid, turn up the heat to medium and cook, stirring now and then, for seven minutes more, or until the chicken is tender and the sauce is thick and rich. Stir in the lime juice.\n\nTransfer to a shallow serving platter and drizzle with the extra coconut milk. Sprinkle with the reserved toasted coconut and the coriander leaves, and serve warm.\n\nThis article contains affiliate links, which means we may earn a small commission if a reader clicks through and makes a purchase. All our journalism is independent and is in no way influenced by any advertiser or commercial initiative. By clicking on an affiliate link, you accept that third-party cookies will be set. More information.", "description": "A diverse heritage has led to Yotam’s eclectic toolkit of international hand-me-down recipes, from Germany via the American Midwest to Malaysia", "authors": ["Yotam Ottolenghi"], "top_image": "https://i.guim.co.uk/img/media/4068e894b0b244968c15264cfa6b14442fd9e2d8/0_486_4202_2521/master/4202.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e33eb0375e6cfbf8f04ed885fbab42c1", "published_at": "2019-10-19"}