{"pub": "businessinsider", "url": "https://businessinsider.com/trump-washington-post-reporters-banned-from-white-house-2019-9", "downloaded_at": "2019-09-07 15:26:31.814206+00:00", "title": "Trump administration goes on attack-mode against Washington Post reporters, suggesting they should be banned from the White House", "language": "en", "text": "President Donald Trump lashed out at two Washington Post reporters on Twitter Saturday for a critical story. He said they \"shouldn't even be allowed\" in the White House.\n\n\"The Washington Post's @PhilipRucker (Mr. Off the Record) & @AshleyRParker, two nasty lightweight reporters, shouldn't even be allowed on the grounds of the White House because their reporting is so DISGUSTING & FAKE,\" Trump wrote.\n\nAlongside Trump's tweet was a link to an op-ed by White House Press Secretary Stephanie Grisham and Deputy Press Secretary Hogan Gidley that objected to a Washington Post story published earlier this week that detailed \"incompetence and intolerance\" in the White House as described by sources close to the administration.\n\nThe op-ed made multiple inaccurate claims, including saying that the Washington Post didn't report stories on Trump's official activities that had been published earlier in the summer, including his being the first sitting president to walk across the DMZ into North Korea.\n\nThe tweet is the latest in the administration's moves to block reporters from the White House after Grisham led the White House in attempting to revoke Playboy reporter Brian Karem's pass for 30 days after she said he had violated standards of \"professionalism\" and \"decorum\" in a heated Rose Garden exchange with former presidential aide Sebastian Gorka in July.\n\nA district court judge ultimately blocked the decision.\n\nRead more: 'He's losing his s---': Trump's advisers are increasingly worried about his mental state following days of erratic behavior\n\nThe pushback came months after the White House revoked CNN report Jim Acosta's press pass in November 2018 after a tense moment with Trump during a live broadcast press conference. A federal judge later overturned that decision.\n\nOne day before Trump's tweet, his son Eric also took aim at the paper, tweeting a screenshot of an email by Washington Post reporter David Farenthold who was reaching out to an employee of the Trump Organization for details on the company and a possible relationship. Trump appeared to mock the \"techniques\" of the email, which appeared to be a standard approach of a report reaching out to a possible source.", "description": "This is the administration's latest attempt to aim at banning specific journalists from the White House.", "authors": ["Ellen Cranley"], "top_image": "https://amp.businessinsider.com/images/5d73b3c12e22af4a5f4310c4-1334-667.jpg", "published_at": "2019-09-07"}