{"pub": "usatoday", "url": "https://usatoday.com/story/money/cars/2019/10/24/ford-unveils-mustang-inspired-electric-sport-utility-vehicle/4085954002", "downloaded_at": "2019-10-25 00:41:21.274833+00:00", "title": "Ford hopes 'Mustang-inspired' SUV will shock Tesla, electric vehicle world", "language": "en", "text": "CLOSE Ford will release an all-electric SUV on November 17. FORD MOTORS\n\nFord Motor has made it official: it's going to unveil a \"Mustang-inspired\" electric SUV next month.\n\n\"We’ve busted the myth that electric vehicles have to be boring,\" the automaker says in a statement.\n\nIn showing a drawing of the roofline and hints as to the look of the front of the new vehicle – yeah, it sort of looks like the current Mustang – Ford appears to be taking direct aim at electric-car leader Tesla. When it made its debut in 2015, the Tesla Model X luxury electric was anything but boring – especially with its novel gullwing rear doors.\n\nA new Ford electric SUV might help the automaker try to head Tesla off at the pass as it starts production of a new, smaller, lower-priced electric SUV, the Model Y, next year.\n\nVolvo reveals its first electric car: XC40 Recharge SUV makes debut\n\nPlug it in: Ford offers access to 35,000 charging stations in advance of 'Mustang-inspired' SUV\n\nFord's electric SUV will debut Nov. 17 ahead of the Los Angeles Auto Show. But it is being billed as a reveal that will happen \"around the globe,\" an indication that there may be events in multiple cities, just as the automaker did when it unveiled the next generation of the Mustang sports car in 2015.\n\nIt's yet to be seen how Mustang's fans react to the new design, especially whether it alienates Mustang loyalists who have kept the pony-car alive and thriving for 55 years. It's also unclear whether Ford, which is killing off most of its car lines, intends to morph Mustang away from the sports car category and migrate it toward the SUV world. It wouldn't be alone, given how even super-premium brands like Rolls-Royce and Bentley have introduced SUVs that inherit the look and feel of their famous car models.\n\nRead or Share this story: https://www.usatoday.com/story/money/cars/2019/10/24/ford-unveils-mustang-inspired-electric-sport-utility-vehicle/4085954002/", "description": "Ford's electric SUV, inspired by its Mustang sports car, gets its worldwide debut on Nov. 17 ahead of the Los Angeles Auto Show", "authors": ["Chris Woodyard", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/24/USAT/f1208fee-45b4-4a58-9085-1fd828bbb874-Fords_All-Electric_Mustang-Inspired_SUV_Three_line_sketch_WITH_DATE.jpg?crop=1911,1075,x4,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-24"}