{"pub": "euronews", "url": "https://euronews.com/2019/10/17/orban-says-would-have-to-use-force-if-turkey-opens-gates-to-refugees", "downloaded_at": "2019-10-17 11:36:51.265320+00:00", "title": "Orban says would have to 'use force' if Turkey 'opens gates' to refugees", "language": "en", "text": "Hungary would \"use force\" at its southern border with Serbia to protect the European Union's frontier if Turkey follows through on its threat to open the gates to Europe to refugees, Hungary's Viktor Orban said.\n\nThe Hungarian prime minister put up a fence on the country's border with Serbia to block the Balkan route of migration, where hundreds of thousands of people marched through from the Middle East to western Europe at the peak of the crisis in 2015.\n\nThe EU is dependent on Turkey to lessen the arrival of refugees into Europe after a 2016 agreement to seal off the Aegean route was signed.\n\nTurkey — who currently hosts 3.6 million Syrian refugees — threatened to \"open the gates\" to allow those already in the country to continue their way to Europe if the EU acted against the NATO ally for its incursion into northeast Syria.\n\n\"The next weeks will decide what Turkey does with these people,\" Orban told private broadcaster HirTV in an interview late on Wednesday. \"It can steer them in two directions: take them back to Syria or set them off towards Europe.\n\n\"If Turkey chooses the latter, these people will arrive at Hungary's southern border in huge masses,\" Orban said, adding that the EU should provide more funds to Turkey to help rebuild Syrian towns.\n\n\"If Turkey sets off further hundreds of thousands on top of this, then we will need to use force to protect the Hungarian border and the Serbian-Hungarian frontier and I do not wish for anyone that we should need to resort to that,\" he said.\n\nOrban has forged close relations with Turkey as part of an eastern opening initiative.\n\nTurkish President Tayyip Erdogan is due to come to Budapest for a visit early next month.\n\nAlso on Thursday, Chancellor Angela Merkel said she had urged Turkey several times to end its military operation in northern Syria.\n\n\"In recent days I have strongly urged Turkey ... to end its military operation against the Kurdish military and I'm stressing that again now,\" Merkel told Germany's lower house of parliament.\n\n\"It's a humanitarian drama with huge geopolitical effects so Germany will not deliver any weapons to Turkey under the current conditions,\" she added.\n\nSince launching the offensive on October 9, Turkish forces have bombarded northern cities controlled by the Kurds since they defeated so-called Islamic State (IS) in Syria, with US backing.\n\nUS Vice President Mike Pence is in Ankara to try and convince Turkey to halt the offensive against Kurdish fighters.", "description": "Hungarian Prime Minister Viktor Orban said on Thursday he might have to \"use force\" if Turkey opens their gates to Europe to refugees.", "authors": [], "top_image": "https://static.euronews.com/articles/stories/04/23/45/58/1000x563_cmsv2_2f53ebc2-6feb-5529-94ac-2385b3e4c5c8-4234558.jpg", "published_at": "2019-10-17"}