{"pub": "yahoo", "url": "https://news.yahoo.com/democrats-slow-pace-impeachment-inquiry-122241944.html", "downloaded_at": "2019-10-22 13:45:51.988528+00:00", "title": "Democrats Slow Pace on Impeachment Inquiry", "language": "en", "text": "Marie Yovanovitch, the former United States ambassador to Ukraine, leaves the Capitol in Washington after a closed-door meeting, Oct. 11, 2019. (Anna Moneymaker/The New York Times)\n\nWASHINGTON — House Democrats have resigned themselves to the likelihood that impeachment proceedings against President Donald Trump will extend into the Christmas season, as they plan a series of public hearings intended to make the simplest and most devastating possible public case in favor of removing Trump.\n\nDemocratic leaders had hoped to move as soon as Thanksgiving to wrap up a narrow inquiry focused around Trump’s dealings with Ukraine, buoyed by polling data that shows that the public supports the investigation, even if voters are not yet sold on impeaching the president.\n\nBut after a complicated web of damaging revelations about the president has emerged from private depositions unfolding behind closed doors, Democratic leaders have now begun plotting a full-scale — and probably more time-consuming — effort to lay out their case in a set of high-profile public hearings on Capitol Hill.\n\nTheir goal is to convince the public — and if they can, more Republicans — that the president committed an impeachable offense when he demanded that Ukraine investigate his political rivals.\n\n“Just the facts, baby,” said Rep. Hakeem Jeffries, D-N.Y., the chairman of the House Democratic Caucus. “If we tell that story with simplicity and repetition, the American people will understand why the president must be held accountable. If we don’t, then there is great uncertainty, and in that vacuum Donald Trump may find himself escaping accountability again.”\n\nTrump, increasingly embittered by the impeachment inquiry, complained Monday that Republicans were not defending him aggressively enough.\n\n“Republicans have to get tougher and fight,” Trump said during a rambling, hourlong question-and-answer session with reporters at a Cabinet meeting. “We have some that are great fighters, but they have to get tougher and fight, because the Democrats are trying to hurt the Republican Party for the election, which is coming up, where we’re doing very well.”\n\nThe president belittled Sen. Mitt Romney, R-Utah, one of the few members of his party who has signaled he may be open to impeaching Trump, underscoring how anxious the senator’s defection has made him about possible cracks in support from his own party.\n\nLaunching into a series of attacks on Democrats, Trump said approvingly that they were “vicious and they stick together. They don’t have Mitt Romney in their midst — they don’t have people like that.”\n\n“They stick together,” Trump added. “You never see them break off.”\n\nIt was the second time in two days that he has complained about a lack of support from Republicans.\n\n“When do the Do Nothing Democrats pay a price for what they are doing to our Country, & when do the Republicans finally fight back?” Trump tweeted late Sunday night.\n\nThe president’s allies on Capitol Hill tried Monday to ramp up their defense of the president by forcing a vote in the House to censure Rep. Adam B. Schiff, D-Calif., who is leading the impeachment inquiry as the chairman of the Intelligence Committee. The vote, which failed in the Democratic-led chamber, was a display of Republican solidarity for Trump.\n\nThere are risks for Democrats in the longer timeline, which could make it more difficult for lawmakers in politically competitive districts who fear a backlash from constituents if they appear to be preoccupied with targeting Trump instead of addressing major issues such as gun safety or health care.\n\nAnd Democrats are all too aware that Trump has succeeded in the past in steering the subject away from allegations of misconduct on his part, as he did with the investigation into Russia’s interference in the 2016 presidential election conducted by special counsel Robert Mueller.\n\nThis time, Democratic leaders hope to deny him the opportunity.\n\nThey have issued subpoenas to a growing cast of characters, including Rudy Giuliani, Trump’s private lawyer who is at the center of the Ukraine pressure campaign, and have demanded documents from Vice President Mike Pence. They have invited or compelled Trump administration officials past and present to appear at the Capitol before rolling television cameras, and cloistered them behind closed doors to extract a daily drip of testimony that backs up their case.\n\nThat effort continues Tuesday when William B. Taylor Jr., the top U.S. diplomat in Ukraine, is scheduled to testify behind closed doors about text messages in which he wrote to other officials that it was “crazy to withhold security assistance for help with a political campaign.” On Wednesday, investigators will question Laura Cooper, a Pentagon official, about decisions to hold up Ukraine’s military aid.", "description": "WASHINGTON -- House Democrats have resigned themselves to the likelihood that impeachment proceedings against President Donald Trump will extend into the Christmas season, as they plan a series of public hearings intended to make the simplest and most devastating possible public case in favor of removing", "authors": ["Michael D. Shear", "Nicholas Fandos"], "top_image": "https://s.yimg.com/uu/api/res/1.2/VDi6Jw0sUkstuhO2bqyfFw--~B/aD0zMDAwO3c9NDUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/the_new_york_times_articles_158/9a2cef96d922c2eceea2848e684d9358", "published_at": "2019-10-22"}