{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/22/1933493/0/en/Media-Advisory-New-Mobile-Awareness-Campaign-by-Westcan-Bulk-Transport-and-MADD-Canada-Honours-BC-Victim-of-Impaired-Driving.html", "downloaded_at": "2019-10-22 16:04:19.041219+00:00", "title": "Media Advisory: New Mobile Awareness Campaign by Westcan Bulk Transport and MADD Canada Honours BC Victim of Impaired Driving", "language": "en", "text": "COQUITLAM, British Columbia, Oct. 22, 2019 (GLOBE NEWSWIRE) -- Jeremy Cook was just 15 years old on October 11, 2013 – the night his life was nearly ended by an impaired driver. This week, he becomes the latest face of a mobile awareness campaign that encourages motorists to help police get impaired drivers off the roads by calling 911.\n\n\n\nWestcan Bulk Transport is putting Jeremy’s photo on 40 of its truck trailers, along with a message to motorists to call 911 if they see a driver they suspect is impaired. The campaign strives to raise awareness of the impact of impaired driving, and to engage the public in helping police take those drivers off the roads. The message will be seen by thousands of motorists each day.\n\nA truck trailer with Jeremy’s photo will be unveiled on Friday at Westcan Bulk Transport’s facility in Coquitlam. Joining Jeremy and his family for this special event will be Coquitlam Mayor Richard Stewart and local police representatives.\n\nMedia are invited to attend the event and photo opportunity:\n\nDate & Time: Friday, October 25 at 11 a.m. Location: Westcan Bulk Transport Coquitlam Terminal, 1650 Hartley Ave., Coquitlam, BC Special Guests: Jeremy Cook\n\nCoquitlam Mayor Richard Stewart\n\nHoward August, Executive Vice-President, Canadian Operations, Westcan Bulk Transport\n\nDawn Regan, Chief Operating Officer, MADD Canada\n\nWestcan Bulk Transport, which operates in Ontario, Western Canada and Northwest Territories has operated this campaign since 2012. In all, 240 of Westcan’s truck trailers have photos of impaired driving victims from other parts of the country, along with the call 911 message.\n\nFor more information or to RSVP: Deb Kelly, MADD Canada Communications Manager: 1-800-665-6233, ext. 240 or Dawn Regan, MADD Canada Chief Operating Officer: 1-800-665-6233 ext. 223 / 905-330-7565 or", "description": "", "authors": ["Madd Canada"], "top_image": "http://www.globenewswire.com/Attachment/LogoDisplay/537965?filename=537965.jpg&size=1", "published_at": "2019-10-22"}