{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKBN1WW0C7-OCASP", "downloaded_at": "2019-10-17 05:18:11.120444+00:00", "title": "NHL roundup: Avs take first loss as Pens win in OT", "language": "en", "text": "Brandon Tanev scored a short-handed goal with 1:03 left in overtime Wednesday to give the host Pittsburgh Penguins a 3-2 win and hand the Colorado Avalanche their first loss of the season.\n\nOct 16, 2019; Pittsburgh, PA, USA; Pittsburgh Penguins left wing Brandon Tanev (13) reacts to being named first star of the game against the Colorado Avalanche at PPG PAINTS Arena. Pittsburgh won 3-2 in overtime. Pittsburgh won 3-2 in overtime. Mandatory Credit: Charles LeClaire-USA TODAY Sports\n\nTanev’s shot from the bottom of the left circle was inadvertently knocked across the goal line by Colorado’s Gabriel Landeskog near the far post.\n\nSidney Crosby had a goal and an assist, Jake Guentzel scored and Matt Murray made 26 saves for Pittsburgh, which won its fourth straight.\n\nMatt Calvert and Nathan MacKinnon scored for the Avalanche, who entered the game 5-0-0, the last remaining NHL team without a loss. Philipp Grubauer made 30 saves for Colorado.\n\nCapitals 4, Maple Leafs 3\n\nJohn Carlson finished with one goal and two assists and host Washington used a three-goal burst over 78 seconds in the second period to top Toronto and pick up its first home win in four tries this season.\n\nCarlson now has three goals and 11 assists to rank among the NHL scoring leaders. The defenseman assisted on Washington’s first two goals and scored the fourth one, while Nicklas Backstrom added a goal and an assist, and Jakub Vrana and Evgeny Kuznetsov also scored for the Capitals.\n\nToronto got first-period goals from Kasperi Kapanen and Ilya Mikheyev, seemingly taking charge with a 2-0 lead. But rookie Ilya Samsonov, starting in goal for Washington, recovered to make 29 saves. Michael Hutchinson made 28 saves for Toronto.\n\nBlue Jackets 3, Stars 2\n\nZach Werenski and Alexander Wennberg each had first-period goals, and host Columbus added to Dallas’ early-season misery.\n\nSonny Milano added a highlight-reel, third-period goal, and Joonas Korpisalo stopped 30 shots as the Blue Jackets posted back-to-back wins for the first time on the young season. Columbus also extended its winning streak over Dallas to eight games.\n\nThe Stars fell to 1-6-1 and continue to struggle on offense. Miro Heiskanen scored near the end of the first period, and Joe Pavelski finally got his first goal with Dallas, which has totaled just 15 goals and is a paltry 1-for-24 on the power play.\n\n—Field Level Media", "description": "Brandon Tanev scored a short-handed goal with 1:03 left in overtime Wednesday to give the host Pittsburgh Penguins a 3-2 win and hand the Colorado Avalanche their first loss of the season.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191017&t=2&i=1441733322&w=1200&r=LYNXMPEF9G08K-OCASP", "published_at": "2019-10-17"}