{"pub": "townhall", "url": "https://twitchy.com/brettt-3136/2019/10/19/even-van-jones-thinks-hillary-clinton-is-playing-a-dangerous-game-calling-tulsi-gabbard-a-russian-asset", "downloaded_at": "2019-10-19 16:17:50.246639+00:00", "title": "Even Van Jones thinks Hillary Clinton is playing a ‘dangerous game’ calling Tulsi Gabbard a Russian asset", "language": "en", "text": "As Twitchy reported this week, 2020 presidential candidate Tulsi Gabbard fired back — hard — at Hillary Clinton, “queen of warmongers, embodiment of corruption, and personification of the rot that has sickened the Democratic Party for so long,” after Clinton said in an interview that Gabbard was a Russian asset being set up to run a third-party campaign and siphon votes from the Democratic candidate.\n\nWe have our disagreements with Van Jones, but we respect him for telling CNN’s Erin Burnett that Clinton is playing “a very dangerous game” and that if she has evidence, show it.\n\nVan Jones: \"I’m telling you, Hillary Clinton is playing a very dangerous game… If you’ve got real evidence, come forward with it. But if you’re just going to smear people casually on podcasts, you are playing right into the Russians’ hands\" https://t.co/ma82IikqS7 — Saagar Enjeti (@esaagar) October 19, 2019\n\nHe’s absolutely right. Who needs the Russians to do anything if people like Clinton are going to keep the paranoia and false accusations going without their help?\n\nThis is true. True for Hillary but also very true for an irresponsible media that for nearly 3 yrs carried water for Putin in pushing the Russian collusion fairytale. Putin didn’t destabilize our democracy: the collusion mongers did because they chose to push it. https://t.co/OIbSPQS2sy — Ned Ryun (@nedryun) October 19, 2019\n\nWell said. Never mind the Mueller report — there are probably millions who honestly believe Russia somehow installed Donald Trump in the Oval Office … not through collusion, though, but through the purchase of a few Facebook memes.\n\nThis is an excellent, excellent comment… — TheThinker (@TheRewster) October 19, 2019\n\nShe had the evidence on her email server. — Bondage Dividend (@Disquietous) October 19, 2019\n\nGood one.\n\nApparently the new take on being a Russian asset is that the asset doesn’t have to be paid by Russia, or in fact even know that Russia has made them an asset, to in fact be an asset. Truly. — NH (@NomadHominem) October 19, 2019\n\nVan Jones must have been away for the last 3 years. Doesn’t he know what his beloved party has become these days? — Stan Shtramel (@sshtramel) October 19, 2019\n\nIt's hard for me to like and retweet this because Van is somehow still perpetuating the Russiagate narrative… But I will anyway because at least he's not giving Hillary her usual blank cheque. — Paxxwell (@Paxxwell) October 19, 2019\n\nSame — April Ngo (@aprilmay_n) October 19, 2019\n\n@VanJones68 is gonna get himself booted if he keeps spitting all these facts — Brandon Reyes 🧢 (@breyescu18) October 19, 2019\n\nWhere in the hell was that kind of rational thinking for the last 3 years?! — Cʜᴜᴄᴋ Fʟᴇᴛᴄʜᴇʀ (Ciucc to the nooch) (@RealGuitarDood) October 19, 2019\n\nHe was on his way to saying something truly profound and then right at the end he remembered he really loves that CNN gig. — Childless GenX LaCroix Aunt Voter (@koalatwin) October 19, 2019\n\nResistance Queen is destroying Resistance. 🎉 — Aisha Sharna (@SharnaAisha) October 19, 2019\n\nI remember when Mitt Romney was roundly criticized for claiming that Russia was our biggest threat. — Greggo (@GregGreggo) October 19, 2019\n\nWhen did real life become a reddit thread where we accuse people of being Russian bots right and left? I don’t even like Tulsi and I think this is nuts. — LetsAnthropomorphize🧢🇺🇸 (@LetsAnthrpmrphz) October 19, 2019\n\nHillary believes it, so it is nuts.\n\nRelated:", "description": "Van Jones thinks that Hillary Clinton should produce her evidence if she can find any.", "authors": ["Brett T.", "Posted At Am On October"], "top_image": "https://twitchy.com/wp-content/uploads/2017/04/tulsi-gabbard-fox-news.jpg", "published_at": "2019-10-19"}