{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/11/chess-magnus-carlsen-escapes-vishy-anand-loses-isle-of-man", "downloaded_at": "2019-10-11 19:49:33.621254+00:00", "title": "Chess: Magnus Carlsen escapes but Vishy Anand is beaten at Isle of Man", "language": "en", "text": "The first round was also a disaster for England’s players, with seven defeats in eight games, as young talents scored upsets\n\nThe world champion, Magnus Carlsen, had a narrow escape, the former champion Vishy Anand was brilliantly beaten, and several other elite grandmasters dropped half points as the 154-player $430,000 Fide/Chess.com Grand Swiss Isle of Man event got off to a combative start on Thursday.\n\nChess competition just now is stratified, with many events reserved for the top grandmasters and few where they are directly challenged by second-line GMs and rising talents. Isle of Man, which continues until 21 October at the Comis Hotel near Douglas, is a rare opportunity for ambitious players, and they seized it in the opening round, where the ranked top half of the field met the bottom half.\n\nChess: Isle of Man last chance for some of Magnus Carlsen’s potential foes Read more\n\nWith over 150 players and 11 rounds, the small group who had their eyes on a place in the 2020 candidates which will decide Magnus Carlsen’s next title challenger all expected to make a fast start against their lower-rated opposition. In the event Anand lost, top seeds Wesley So, Alex Grischuk, Levon Aronian and Hikaru Nakamura all conceded draws, and even Carlsen had a rough time in the middle game against Yuriy Kuzubov before the Ukraininan lost his advantage and tumbled into defeat in time pressure. Carlsen, Black in a Sveshnikov Sicilian, drew in round two against Alexey Sarana of Russia in 52 moves, played in a speedy three hours.\n\nAnand was absent from the World Cup and the Fide Grand Prix, so under the rules Isle of Man is his only chance to qualify for the candidates which he won in 2014. Evgeniy Najer is a former European champion and winner of Moscow Aeroflot with a reputation for beating big names, and his was the most brilliant game of the first round. Anand was level until 18…Ne4? and missed a late drawing chance by 28…Qf3+ 29 Kg1 Qf4 when White must allow perpetual check.\n\nCarlsen and his 2018 challenger, Fabiano Caruana, do not have to qualify for the 2020 candidates, so they will be potential kingmakers in the final round when the single candidates place will be settled. Carlsen has a special incentive to remain unbeaten, as his run without loss would reach 101 games after round 11, breaking the world No 3 Ding Liren’s record 100 against elite rivals. There are some longer sequences by GMs, but against weaker opponents.\n\nWhen interviewed, Carlsen was asked: “Do you feel you shouldn’t be allowed in tournaments where you can qualify for playing yourself?” He replied: “ Yeah, I think it’s pretty obvious that I shouldn’t, but I don’t have any morals, so it’s OK!” Caruana was asked a similar question about how he felt about ruining the chances of a candidates contender and said: “Well, someone has to ruin them!”\n\nCaruana won his opening round comfortably, but in a manner to appal teachers of beginners. His Chinese opponent, Zhang Zhong, began 1 d4 Nf6 2 Bf4, probably planning a solid London system, c5 3 e3 Qb6 4 Nc3 cxd4 5 Qxd4 Qxb2. After 15 moves, the world No 2 had made 10 of them with his queen and all his seven remaining pawns were still on their starting squares.\n\nThe eight English entrants had a terrible first round – seven defeats and a solitary draw by Luke McShane, who tried for hours in a K+R+N v K+R endgame. Most of the England players are lower ranked wildcards, but Gawain Jones lost with White to 14-year-old Nodibirek Abdusattorov of Uzbekistan while David Howell was out-combined by the wily Georgian Baadur Jobava. Like Zhang v Caruana, this game had an eccentric opening: 1 b3 d5 2 Bb2 Bf5 3 e3 e6 4 h3 h6.\n\nChess: Try your skill on the Levitt test. Michael Adams took five minutes Read more\n\nPrizes go down to $2,000 for 30th place, and there is a separate list for the leading women, including England’s Jovanka Houska, who were invited as wildcards. Isle of Man was already bracketed with Gibraltar as the world’s strongest open and the current event is again financed by the Chess.com website and by the Scheinberg family, who are IoM residents.\n\nPlay starts at 3pm daily and all the games are viewable live online, with move-by-move computer analysis and commentaries by Daniel King and Anna Rudolf.\n\n3640 1 Qxf6! If exf6 2 Re8, or gxf6 2 Ne6, or Rxf6 2 hxg7, or g6 2 Qh8, or Kg8 2 Qxg7, or Nc4 2 d8=Q, or Ne8 2 Qxf7. Traps include 1 Q or Bxd6? Kg8! or 1 d8=Q+? Ne8 or 1 h7? e5! or 1 d7? e5! when 2 d8=Q+?!? leaves White’s king in check (by Denys Bonner, 1960).", "description": "The first round was also a disaster for England’s players, with seven defeats in eight games, as young talents scored upsets", "authors": ["Leonard Barden"], "top_image": "https://i.guim.co.uk/img/media/fda5ebacfe681863c854eb54d41d4840ecb64c96/3_21_1114_668/master/1114.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=462d23e497d98bdb7626c1741caf4a58", "published_at": "2019-10-11"}