{"pub": "huffpost", "url": "https://huffpost.com/entry/john-brennan-cia-us-corrupt-trump_n_5d9a6309e4b0fc935edc4e27", "downloaded_at": "2019-10-07 00:08:32.229251+00:00", "title": "John Brennan: CIA Would Call U.S. 'Very Corrupt' If It Were Another Country", "language": "en", "text": "Former CIA Director John Brennan said on Sunday that if the political turmoil plaguing the White House were happening in another nation, the American intelligence community would offer a grim assessment.\n\n“We would look at it as a very corrupt government that is under the sway right now of this powerful individual who has been able to just corrupt the institutions and the laws of that country,” he told NBC News’ Chuck Todd during a “Meet the Press” appearance.\n\nBrennan, who is now a senior national security and intelligence analyst for NBC, raised alarm over Republicans’ refusal to speak out against President Donald Trump, who allegedly sought foreign interference in the 2020 election, according to a whistleblower complaint filed in August by an anonymous member of the intelligence community.\n\nPrior to Brennan’s interview, Todd spoke with Sen. Ron Johnson (R-Wisc.), who stonewalled his questions and launched into a conspiracy-laden defense of the president in which he took aim at Brennan, who is a frequent critic of Trump.\n\nHis remarks strayed so far from the topic at hand that a visibly exasperated Todd slammed the senator for peddling Fox News “propaganda” on air.\n\nBrennan, who subsequently hit back at Johnson’s remarks, cautioned that he is part of the problem.\n\n“It’s no longer a democracy if an autocrat has it in his hands, and people like Johnson and others are putty in his hands, which means that the democratic principles on which this country [was] founded are eroding right now,” Brennan said.\n\nAt the center of scandal swirling around Trump is a July phone call with Ukrainian President Volodymyr Zelensky in which he pressed Zelensky to assist both Attorney General William Barr and lawyer Rudy Giuliani with a probe of former Vice President Joe Biden and his son, based on unsubstantiated corruption accusations. At the time of the discussion, U.S. aid to Ukraine was being withheld.\n\nOn Friday, The Wall Street Journal reported that Gordon Sondland, the U.S. ambassador to the European Union, described the situation to Johnson as a quid pro quo in which the aid was contingent on an agreement to investigate the Bidens. Johnson told the Journal that he then confronted Trump about the matter, and Trump denied that was the case.\n\nAppearing uncomfortable with any suggestion of a deal, Johnson told the Journal he “winced” at the notion.\n\n“My reaction was: Oh, God. I don’t want to see those two things combined,” he said.\n\nOn Sunday, Johnson refused to further explain this concern, claiming Trump’s administration has been “sabotaged from the day after election.”", "description": "“It’s no longer a democracy if an autocrat has it in his hands,\" the former CIA director warned.", "authors": ["Trends Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d9a636e200000f2004e31ba.jpeg?cache=jhxghjfjvf&ops=1778_1000", "published_at": "2019-10-06"}