{"pub": "guardian", "title": "Meditation helped me drag myself out of self-loathing and failure", "url": "https://theguardian.com/lifeandstyle/2019/sep/02/meditation-helped-me-drag-myself-out-of-self-loathing-and-failure", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-02 09:03:20.740275+00:00", "text": "In my 20s, my career escalated pretty quickly. I started out in London as a reporter on a magazine writing about design. Before I knew it, I was living in Manhattan, working as an editor and loving it. I felt like I was living the dream. But by the time I was in my 30s and living back in the UK, things had changed. After a bullying boss crushed my confidence, I chose to try a freelance career instead.\n\nI was good at what I did. I won a few awards and gained plenty of recognition, but I couldn’t make ends meet. After 10 years of slogging away, I found myself working shifts as a driver for a supermarket just to pay the rent. I was getting up at 3.30am to deliver groceries to people all over the south of England. My self-esteem was in tatters and I was broke, bitter and confused.\n\nI couldn’t figure out how to get along in life. It was as if I had missed that day in school when they tell you the secret to making it all work. No matter how hard I tried, it always seemed to be the other guy who had the car, the house, the holidays and the happiness.\n\nNo matter how hard I worked I never seemed to get my big break. My CV was awesome, my LinkedIn profile on point, and I was applying for job after job after job. Yet it felt as if life kept passing me by. I was wallowing in self-pity. I resented everyone who had, in my head, found the secret to life and stolen it from me in the process.\n\nSeven ways to start meditating Read more\n\nMy mind constantly raced with negative thoughts. I was filled with self-loathing. I would lie awake at night cursing myself for not being as good or as clever or as capable or as qualified as the next person. I cursed my life decisions. And I blamed the world and everyone in it for my problems. I had, after all, followed all the advice and done everything I was supposed to do, and here I was, stuck in a rut. Angry. Confused. Depressed.\n\nIt was my wife who suggested I try meditation. I don’t know what persuaded me to give it a go. Perhaps it was because I’d tried everything I was supposed to do on the outside, and all that was left was to try to look inside. And so, one day I closed my eyes, focused on my breathing, and when I noticed my mind drifting into that self-loathing internal dialogue, I simply brought it back to focus on my breath.\n\nI did this over and over again. For weeks. And things began to change.\n\nWhen the chaos inside my mind began to quieten, it became apparent very quickly that it was no one’s fault but my own that I was where I was. I had allowed the things that had happened to me on the outside affect me so much on the inside that I had adopted a victim mentality and spiralled downwards.\n\nSuddenly I saw that if my failings were due to my own actions, then my successes could be, too. I began to change my perspective. I focused on my strengths, all the things that I had rather than all the things I didn’t have, and I suddenly found that I was surrounded by beauty, by wealth, by an abundance of joy. Don’t get me wrong, it didn’t happen overnight; it took a couple of years. But as my mental outlook improved, my real-world results changed, too.\n\nJob offers started to come my way, and before long I found my career back on track and my confidence along with it. Financially, things improved, and my social skills began to return. My life turned around almost completely.\n\nIt’s not all a bed of roses. I still have bills to pay and debts to clear. I still get angry on a regular basis. But these days, while depression lurks in the background and pops up occasionally, I have the tools to manage it.\n\nStaying positive is like going to the gym. For me that centres around meditation. It gives me a chance to slow down, to gain perspective and to take a break from my ego, my anxieties and my self-doubt.\n\nMeditation enables me to cut through the chatter and see the beauty in life. It allows me to choose who and what takes up space in my thinking, and to choose happiness and joy over misery and rumination. If we could all spend a couple of moments every day to concentrate on our breathing and look around at the world, we might find there is a lot less to complain about than we think.", "description": "I spent my 30s angry, confused and depressed – until my wife suggested I try listening to my breath", "authors": ["Chris Brock"], "top_image": "https://i.guim.co.uk/img/media/b4dfd4d0b3ecdc0b862a8a7b48e10a3b8f49e1ab/1802_793_5526_3316/master/5526.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4ecc311f26ae5e236486385265f31216"}