{"pub": "npr", "url": "https://npr.org/sections/goatsandsoda/2019/09/25/763456317/genius-grant-goes-to-marine-scientist-who-embraces-flash-mobs-and-comic-books", "downloaded_at": "2019-09-25 23:27:10.998649+00:00", "title": "'Genius' Grant Goes To Marine Scientist Who Embraces Flash Mobs And Comic Books", "language": "en", "text": "'Genius' Grant Goes To Marine Scientist Who Embraces Flash Mobs And Comic Books\n\nEnlarge this image toggle caption Rebecca Weeks Rebecca Weeks\n\nStacy Jupiter realized how dangerous flooding was becoming in her adopted home of Fiji in 2009 when she flew back after a vacation and landed on an island in crisis. \"Water was up to the roofs of the houses, and roads were cut off,\" says the marine scientist, who directs the Wildlife Conservation Society's Melanesia Program. Her research soon revealed that this uptick in floods — paired with human land mismanagement — was spreading waterborne diseases.\n\nJupiter's reaction: \"Wouldn't people get off their bums and do something if they thought they'd get typhoid?\" So she began collecting evidence and spreading the word, two tactics that are at the core of her role in protecting the phenomenal biodiversity of this region.\n\nEnvironmental advocacy that also boosts human health feels logical to Jupiter, a 43-year-old with degrees from Harvard University and the University of California, Santa Cruz, who has been living in Fiji for over a decade. \"Pacific peoples more than Westerners don't separate themselves from nature,\" she says. \"And in a world with limited resources, we need to be looking for win-wins. What this work is doing is putting people first.\"\n\nIt has also brought Jupiter recognition from the MacArthur Foundation, which has named her one of its 26 fellows for 2019, citing her efforts to save lives and coral reefs as well as build on traditional practices to figure out when, where and how long to close off fishing areas to best manage natural resources. The honor comes with a grant totaling $625,000. We talked to her about fish, flash mobs and comic books. The conversation has been edited for length and clarity.\n\nYou were a Peace Corps volunteer in Gabon after college. How did that prepare you for your current job?\n\nPeace Corps taught me patience and how to listen. Most importantly, nothing ever went to plan. That has served me well. You can plan to have a large engagement, and then someone in the village will die and everything is taken over by funeral planning.\n\nHow do you create messages that will resonate with the community?\n\nWe never come in with a message of \"I don't want you to fish.\" If people feel like it's imposed by outsiders, they will never agree to it. It is in their interest to look after the environment to continue their cultural practice. They say that at this time of year, we eat rabbitfish. And they want their children and grandchildren to be able to eat rabbitfish.\n\nI hear you've made comic books for kids. Why?\n\nI'm a scientist by training, and as scientists we have a specific language we use that's unintelligible to the public. But in conservation, we have to engage with the public. Children are curious, and I had the idea of comic books because it's not something kids in Fiji have access to.\n\nWhat are your comic books about?\n\nThere are certain fish called gobies and gudgeons that move through different stages of the river and encounter more threats. Their movement is influenced by every human encounter — fishing, sediment, dams. So the first was a \"Finding Nemo\" story about Joji Goby, who gets lost and teams up with an inventor scientist crab and has adventures. A wife of a colleague made puppets. The kids were so excited about it. We got them kits [to monitor risks to fish], and they were telling their teachers that their gardens were too close to the water. We did another one, \"The Search for the Groovy Grotto,\" about protecting fish during spawning season. They get together and have this frenzy and release the eggs. It's kind of like a disco. So in the comic, the fish are looking for a place to go dance.\n\nEnlarge this image toggle caption Tui Ledua Tui Ledua\n\nAnd to reach out to even more people you created a flash mob about protecting fish?\n\nAt the time, it was Fiji's largest flash mob. A local NGO focused on communication found a hip-hop version of \"Stayin' Alive,\" set it up at a festival and we had 125 people do a dance. There's a YouTube video, and I'm in my glittery silver disco shirt up front. It inspired the beginning of a campaign that got the government to make regulatory changes.\n\nWhat have you learned from Fijians about nature?\n\nThe fishermen know so much about where the fish breed and how much to take. I'm not out fishing every day. I'm humbled by the local knowledge that people have. It's always a conversation about how we can work together. I came to Fiji green — I knew what science was saying about management, but I had no experience with the culture.\n\nAny examples of how you've had to adjust your approach over the years?\n\nA lot of the science says you need to protect 30% of the habitats in an area. But when you ask local people to shut themselves off to areas that they need to access for livelihood, you need to know whether you're doing 30% just to get to 30%. If we're cutting people off, there should be tangible [conservation] benefits from that location.\n\nOne of the major areas of focus in the last few years, when designing projects, is to meet the expectations of local people. Projects don't necessarily capture local definitions of well-being. Another one I was struck by: Someone was setting up a program about food security, and they had a survey asking, \"Are there days you don't feed your children?\" It's offensive to ask these questions here, where you share food prolifically with anyone outside your door.\n\nWhat's it like to be a white Westerner in your role?\n\nI'm conscious of it every day. There's a word for white Westerner — kaivalagi. I'm a naturalized Fijian citizen, but I will always be a kaivalagi, and I'm fine with that. There are times I need to be quiet and listen. A lot of times I try to pass information through local people because of that. The local staff are the ones who speak at meetings.\n\nWhat's your next project?\n\nMy husband is a chef. He won't buy fish that's undersized, and he won't buy female lobsters with eggs. We have been talking about starting a cafe that would be a model for sustainability here in Fiji.\n\nVicky Hallett is a freelance writer who regularly contributes to NPR.", "description": "Stacy Jupiter works with the people of Fiji to protect the oceans. Two of her most important life lessons came from the Peace Corps: 1) listen and 2) nothing ever goes according to plan.", "authors": ["Vicky Hallett"], "top_image": "https://media.npr.org/assets/img/2019/09/25/stacy-1_wide-710f7451a2ed0be727a0a34b3ebe4c3a042eea1b.jpg?s=1400", "published_at": "2019-09-25"}