{"pub": "nymag", "url": "https://thecut.com/2019/09/prince-harry-breaks-royal-protocol-meghan-markle.html", "downloaded_at": "2019-09-13 00:56:31.288284+00:00", "published_at": "2019-09-12", "title": "Prince Harry Has Gone Too Far", "language": "en", "text": "Nooo! Photo: Karwai Tang/WireImage\n\nI regret to inform you that Prince Harry has gone too far. Almost a year to the day that Meghan Markle — his royal counterpart — went too far, Prince Harry has taken the trust we so delicately placed upon his shoulders and shaken it off, leaving it to fall to the ground with an ear-splitting car-door-slam sound effect. I am as disappointed as you are — less in him, and more in myself for ever trusting him to begin with. Yes, it brings me no pleasure to inform you that Prince Harry has closed his own car door.\n\nHideous!\n\nThe dreaded event, which allegedly breaks royal protocol that demands a royal never close their own door, took place while Prince Harry attended the fifth anniversary of the Invictus Games. (Meghan Markle committed the same dastardly deed while attending her first solo event at the Royal Academy of Arts.) We, and everyone else, have taken note — unhappily.\n\nWhat did we do to deserve this misery? Are we not generally good people? Do we not wake up every morning and attempt kindness; do we not do our best?\n\nDoes nothing matter? If we attempt to be moral and are rewarded only with suffering, what good is morality? Likewise is there any reason to be ethical?\n\nOh! Fans love it??????? “FANS”????? “LOVE IT”?!?!?!!? Speak for yourself!!!!!!!!!!!!!!!!!!!!!!!\n\nAnd — BREAKING OUR HEARTS!!!!!!!!!!!!!!!!!!!!!!!!!\n\nPersonal bombshell: Nothing and no one can be trusted; there is only the self; we are alone and thinking otherwise will do us no good.\n\nNO!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nNOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "description": "Almost a year after Meghan Markle broke royal protocol by closing her own car door, Prince Harry did the same thing.", "authors": ["Kelly Conaboy"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/12/12-prince-harry.w1200.h630.jpg"}