{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/michael-owen-claims-man-utd-20557242", "downloaded_at": "2019-10-11 05:10:12.531219+00:00", "title": "Michael Owen claims Man Utd players are getting worse after Newcastle defeat", "language": "en", "text": "Get the biggest Manchester United FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nMichael Owen has claimed that some Manchester United players are getting worse following last weekend's defeat by Newcastle .\n\nThe 1-0 loss to Steve Bruce's struggling Magpies was United's third of the new campaign and left Ole Gunnar Solskjaer's side 12th in the table after taking just one point from their last three games.\n\nSolskjaer was without regular starters Paul Pogba, Anthony Martial, Luke Shaw, Victor Lindelof and Aaron Wan-Bissaka on Sunday as a Matty Longstaff goal secured victory for the hosts.\n\nAnd Owen believes only a handful of the starting XI from that match, which included the likes of Fred, Axel Tuanzebe and Diego Dalot, are good enough to play for the club.\n\n(Image: AFP via Getty Images)\n\n“They haven’t got the players, they’re simply not good [enough],” Owen told Premier League Productions ( via Manchester Evening News ) .\n\n“That first XI, I’d say there are three players, maybe four, that should be Manchester United players for the future.\n\n“If you’re looking to build that club back to where it was, then there’s probably three or four in that first team.\"\n\nThe former Manchester United and Liverpool striker added: “Ole Gunnar Solskjaer in his interview afterwards, I was almost slipping down my chair, it was almost like he doesn’t know what’s going wrong, let’s say.\n\n(Image: Action Images)\n\n\"We can all speculate as to what’s going wrong. He can look over his shoulder and think ‘down the road you’ve got Jurgen Klopp, you’ve got [Pep] Guardiola - these are managers that are actually improving their players, they’re getting the best out of their squad’.\n\n“I’m looking at that [United] squad and, if anything, the players are getting worse.\n\n“They’re devaluing, as a squad they’re getting worse. Where is it all going to end?”\n\nThe Red Devils face leaders Liverpool after the international break and enter the match 15 points behind Jurgen Klopp's side.", "description": "The Red Devils suffered their third league defeat of the season against Steve Bruce's side last weekend", "authors": ["Hassan Rashed", "Image", "Afp Via Getty Images", "Action Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20067571.ece/ALTERNATES/s1200/0_FILE-PHOTO-European-Under-21-Championship-Qualifier-Group-4-England-v-Andorra.jpg", "published_at": "2019-10-11"}