{"pub": "washingtonpost", "url": "https://washingtonpost.com/entertainment/museums/first-the-new-yorker-profiled-romare-bearden-then-the-artist-and-activist-decided-to-tell-his-own-story-in-pictures/2019/10/08/7540ac2c-e622-11e9-a331-2df12d56a80b_story.html", "downloaded_at": "2019-10-09 12:43:54.741799+00:00", "title": "Romare Bearden show in Atlanta; A rare exhibition for one of the greatest black artists of the 20th century", "language": "en", "text": "Bearden belonged in their company: No black artist of the 20th century accomplished more. His rich, incident-filled and (mostly) lucky life is as absorbing to contemplate as his brilliant, manifold art. So it made sense that Bearden, in 1977, was the subject of a New Yorker profile by a master of the form, Calvin Tomkins.\n\nAD\n\nAD\n\nBearden appears to have liked the profile. But the relationship between words and pictures is perennially uneasy and writers, especially good writers, often spur artists’ competitive instincts. Having his life story narrated in a magazine prompted Bearden to try telling it himself in a series of collages and paintings that he called, with a nod to the New Yorker, “Profile.”\n\nBearden worked on the series between 1978 and 1981. He divided it into two parts. Both focused on episodes from his early years, which Tomkins’s elegant narrative had skated over. The first part concentrates on his childhood in the South and in Pittsburgh (where he went to live, intermittently, with his grandmother); the second focuses on Harlem in the 1930s. Both parts are on display at the High Museum of Art in Atlanta in a show called “Something Over Something Else.”\n\nYou could come away assuming that Bearden grew up in poverty both in the rural South and around the steel mills of Pittsburgh. In fact, although he witnessed these worlds during extended stays, the reality was more complicated. As Bearden’s friend Charles Alston said, “Romy was never a poor kid. He was straight out of the middle class, and the urban middle class at that.”\n\nAD\n\nAD\n\nThe High show’s title is taken from Bearden’s words: “I really think the art of painting is the art of putting something over something else.” The statement, which Tomkins quotes in his profile, speaks to Bearden’s favored idiom of collage — the layering of one thing over another. And it points to his specific achievement: More than any artist I can think of, Bearden pulled collage away from its associations with modernist fragmentation and precious fussiness into something loose and capacious, yoked to storytelling, pulsing and rippling with all the layers of life.\n\nBut the phrase also carries a whiff of trickery and masquerade — “putting something over on someone.” Bearden was a sophisticated storyteller — he relished the idea of the “unreliable narrator” — so he surely intended both associations.\n\nSeeing the show, reading Tomkins’s profile and poring over a new anthology, “The Romare Bearden Reader” — which includes a useful introduction by Robert O’Meally, and essays and reflections by Morrison, Ellison, August Wilson, Tomkins (the profile) and Bearden — renewed my love of this artist, who died of bone cancer complications in 1988.\n\nAD\n\nAD\n\nThe “Profile” collages have slyly suggestive captions. “The Daybreak Express” shows a bedroom with a nude woman stretched out on her stomach. Behind her is a window through which we see a train puffing steam. The inscription reads: “You could tell not only what train it was but also who the engineer was by the sound of the whistle.”\n\nOn its own, the image has an all-at-once clarity that makes verbal description feel labored. (I didn’t tell you, for instance, that the woman’s head rests in the crook of her elbow, nor that one eye looks out at the viewer, nor what kind of room it is, nor whether it is night or day outside; yet when you look at the picture, it takes just a second to register all of that.)\n\nStill, words can do things that images can’t. The inscription, with its double entendre and pungent specificity (were the horn-tooting habits of the train engineers really so distinct?) has a poetic concision that goes beyond the scope of images.\n\nThroughout the series, Bearden sets up echoes, not only visually (women, windows and trains are repeating motifs) but verbally. “The last time I saw Liza was down at the station when I left for Pittsburgh on the 5.13,” reads one inscription. Another says: “Sometimes at night I used to dream of being the one who was running the train.” And a third: “The trains in the stories she told always ran North.”\n\nBeyond this roiling interplay between visual and verbal imagery, I love Bearden’s “Profile” series (and his whole oeuvre) for the way it undermines the exhausted premises of 21st century identity politics.\n\nAD\n\nAD\n\nTo grasp how, it’s important to say first that Bearden could scarcely have been more engaged with black identity. Everything he made — most everything he did — had to do with telling the story of black life in the United States. He fought prejudice and promoted visibility for African Americans at every turn.\n\nBitter experience had taught him how cruel and arbitrary racial distinctions could be. An exceptionally talented pitcher, he had played on a professional “colored” team while studying in Boston. He was so good that, in 1932, he was invited to join the Philadelphia Athletics, a team that had won the World Series in 1929 and ’30 and the American League pennant in ’31. But accepting would have meant pretending he was white. (This was 15 years before Jackie Robinson broke baseball’s color barrier.) Bearden turned it down.\n\nLike his mother, he was an activist. He had started out in art drawing political cartoons for the Afro-American newspaper. In 1963, he helped found a collective of black artists, the Spiral Group. He spent the 1960s organizing ambitious shows devoted to African American art. With Norman Lewis and Ernest Crichlow, he even started the Cinque Gallery, dedicated to black artists.\n\nAD\n\nAD\n\nBy then, he had “made it” as an artist; he wanted to help in every way he could. (“His phone never stops ringing,” Chris Shelton, the gallery’s first director, commented to Tomkins.)\n\nBearden once said that “an artist is an art lover who finds that in all the art that he sees, he sees something missing.” For him, what was missing was the experiences, dreams and projections of his people. Today’s prominent black artists, including Kerry James Marshall, Mickalene Thomas (whose collage aesthetic was heavily influenced by Bearden), Amy Sherald and Kehinde Wiley, are similarly motivated.\n\nCorrecting this became Bearden’s life’s work. He wanted, he said in 1964, to “establish a world through art in which the validity of my Negro experience could live and make its own logic.”\n\nHe succeeded magnificently, largely because he wasn’t interested in simplifying reality. He would have loathed the idea of depleting the imprint life left on him just to make it fit the requirements of a political worldview. It would have betrayed his understanding of identity itself.\n\n“We all live in a mask,” he once said. “We all have a hundred different identities.”\n\nAD\n\nAD\n\nOne of the best (and most brightly colored) collages in Part II of “Profile” illustrates this in ways that may be hard for contemporary viewers to wrap their heads around. It shows the black vaudeville mime artist, Johnny Hudgins, outside the Lafayette Theater.\n\nHudgins, who was nicknamed the Wah-Wah Man, often performed in blackface. This was not uncommon for black vaudeville performers (for all that we rightly condemn it now, blackface has a complicated history).\n\n“He was my favorite of all the comedians,” wrote Bearden in the accompanying inscription. “What Johnny Hudgins could do through mime on an empty stage helped show me how worlds were created on an empty canvas.”\n\nAD\n\nA black man in blackface is, if nothing else, an “unreliable narrator,” which may have been part of what Bearden loved in Hudgins. In any case, one can imagine how an African American who usually passed for white might have appreciated what Hudgins was up to, and the art he brought to his popular act.\n\nAD\n\nBearden took inspiration wherever he found it: George Grosz, Stuart Davis, Chinese painting, Picasso, Matisse, the Dutch masters, African art, Homer, Derek Walcott, jazz. His broad-mindedness was not just aesthetic. From childhood, he also straddled multiple modes of social existence. He instinctively felt, as Tomkins wrote, that “the path of separatism within a culture is basically self-defeating.” He also understood that identity — everyone’s identity — is layered.\n\nThe words we use today — “black,” “white,” “Latino,” “Asian” — may be clear. And, God knows, we all crave clarity. But the reality of selfhood is cloudier, more contradictory and harder to parse than those constricting categories allow. In the end, that is not a misfortune. It is a solace (how hard it is to be one thing!).\n\nAD\n\nArt, too, is a solace. It exists to remind us that we come, all of us, in many versions.\n\n“Something Over Something Else”: Romare Bearden’s Profile Series at the High Museum of Art in Atlanta through Feb. 2. high.org\n\nRead more by Sebastian Smee:", "description": "Now Bearden, one of the greatest black artists of the 20th century, gets a rare show in Atlanta.", "authors": ["Sebastian Smee", "Art Critic"], "top_image": "https://www.washingtonpost.com/resizer/LUNOpT1p7nbskChMFudhVcl4nRs=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/LOJPO2XKA4I6THDNINVA35HTDU.jpg", "published_at": "2019-10-08"}