{"pub": "vice", "url": "https://vice.com/en_asia/article/zmjm84/candid-drag-photos-bushwig-2019", "downloaded_at": "2019-09-12 07:08:17.239521+00:00", "title": "Rare Candid Portraits of Drag Artists That Capture What’s Underneath", "language": "en", "text": "This article originally appeared on VICE US.\n\nBushwig, one of New York's biggest and best drag festivals, started eight years ago under a small tent in a park in Queens. This year, over 300 drag artists descended on the Knockdown Center for the fest, which was founded by drag artist Horrorchata, to serve looks and shows. And the stunts were outrageous: Over the course of the weekend, Gemma Bubblegum fisted a “muppet” (read: human) to a song by Jason Segel and newly crowned Miss Bushwig Serena Tea brought the house down transforming out of a literal custom car bodysuit before voguing the house down.\n\nI’ve photographed Bushwig each of the three years that I’ve attended. There’s something particularly challenging about photographing performing artists. They’re fantastic in front of the camera, serving pose after pose. At the same time, though, it can feel impossible to capture a candid moment. This year, I wanted to have more than just a seconds-long, fleeting interaction with the drag artists. While I knew that I wanted to capture the emotion and intensity of each artist’s persona, I also wanted to make photos that had a sense of spontaneity, and captured a unique moment. So, I decided to scare them.\n\nBefore the fest, I went to the costume store and bought a remote-controlled rat. (Why not meet camp with camp?) To make it more believable, I glued on extra fur and stuck it in a box with hand warmers—I wanted the performers to feel the heat of a live animal. After taking a posed portrait of each performer, I asked them to reach into the box and describe what they felt inside. That’s when they’d meet the rat—shooting them out of their seats and their refined personas.\n\nAll photographs by Justin J. Wee. You can follow more of his work here.\n\nDenime\n\nCybil War\n\nHorrorchata\n\nIsaac Miss Isaac\n\nJuku\n\nMaxxx Pleasure\n\nMerrie Cherry\n\nMiss Malice\n\nPashmina\n\nSasha Colby\n\nSherry Poppings", "description": "I wanted spontaneous portraits of Bushwig's drag performers—so I scared them with a fake rat.", "authors": [], "top_image": "https://video-images.vice.com/articles/5d77fdf632e9dd0008404050/lede/1568145445760-DICK-FINAL.jpeg?crop=0.9379xw:0.709xh;0.031xw,0.1146xh&resize=1200:*", "published_at": "2019-09-12"}