{"pub": "yahoo", "url": "https://news.yahoo.com/georgia-set-execute-man-convicted-200158870.html", "downloaded_at": "2019-10-16 21:08:59.064456+00:00", "title": "Georgia set to execute man convicted of killing store clerk", "language": "en", "text": "In this undated photo made available by the Georgia Department of Corrections, inmate Ray Jefferson Cromartie is in custody. Georgia Attorney General Chris Carr said in a news release Wednesday, Oct. 16, 2019, that 52-year-old Cromartie is scheduled to die Oct. 30. Cromartie was convicted in the April 1994 slaying of Richard Slysz at a convenience store in Thomasville, just north of the Florida border. (Georgia Department of Corrections via AP)\n\nATLANTA (AP) — A man convicted of shooting two Georgia convenience store clerks — killing one and seriously injuring the other — in separate robberies is scheduled to be executed later this month.\n\nRay Jefferson Cromartie, 52, is scheduled to be put to death Oct. 30 at the state prison in Jackson, state Attorney General Chris Carr said in a news release Wednesday. Cromartie was convicted of malice murder and sentenced to die for the April 1994 slaying of 50-year-old Richard Slysz at a convenience store in Thomasville, just north of the Florida border.\n\nHis lawyers asked a judge in December to order DNA testing on various pieces of evidence in the case. They wrote in a court filing that they anticipated the testing would show Cromartie didn't shoot the two clerks and should have a new trial.\n\nThe judge denied those requests last month. Cromartie's attorneys last week asked the state Supreme Court to let them appeal that ruling.\n\n\"An execution cannot proceed with so much doubt and uncertainty about actual culpability,\" Shawn Nolan, an attorney for Cromartie, said in an emailed statement after the execution date was announced. \"Public confidence in the justice system and the victim's family will be served best by staying Mr. Cromartie's scheduled execution and testing the available evidence.\"\n\nCromartie borrowed a handgun from his cousin on April 7, 1994, and that night walked into the Madison Street Deli and shot clerk Dan Wilson in the face, according to a Georgia Supreme Court summary of the case. He left the store after trying unsuccessfully to open the cash register, the summary says.\n\nWilson suffered a severed carotid artery but survived. He was unable to describe the person who shot him, and footage from a surveillance camera wasn't clear enough to conclusively identify Cromartie.\n\nBut Cromartie asked some friends the next day if they'd seen the news and told one that he'd shot the clerk while he was washing dishes in the back, the summary says.\n\nA few days later, on April 10, 1994, Cromartie and Corey Clark asked Thaddeus Lucas to drive them to a different store to steal beer, the summary says. Lucas parked on a nearby street and waited while the other two entered the Junior Food Store.\n\nCromartie shot Slysz twice in the head after they entered the store, the summary says. Cromartie and Clark were unable to open the cash register and fled after Cromartie grabbed two 12-packs of beer.\n\nA friend testified that when Cromartie and the others returned to an apartment complex, Cromartie bragged about shooting the clerk, the summary says.\n\nCromartie was arrested three days later. Lucas and Clark both testified against him at his trial in September 1997. A jury found Cromartie guilty of charges including malice murder, armed robbery, aggravated battery, aggravated assault and gun charges, and sentenced him to die.\n\nLucas and Clark both pleaded guilty to lesser charges, served prison time and were released.\n\nCromartie has maintained that he did not shoot either Wilson or Slysz. His convictions depended heavily on statements made by people who later recanted or had strong personal motivations to lie, his lawyers wrote in a motion filed in December.\n\nDNA testing on the evidence recovered at the scenes of the two shootings could prove he didn't shoot either man and could reveal who did, his lawyers argued.\n\nSouthern Judicial Circuit Senior Judge Frank Horkan last month denied the requests for DNA testing and for a new trial.\n\nHe wrote in his order that, given the other evidence in the case, Cromartie hadn't shown a reasonable probability the verdict in his trial would have been different if the results of DNA testing had been available at the time. The judge also wrote that Cromartie hadn't established that his motion wasn't just meant to delay his execution.\n\nCromartie would be the third prisoner executed in Georgia this year. The state says it uses an injection of the sedative pentobarbital to put inmates to death.", "description": "A man convicted of shooting two Georgia convenience store clerks — killing one and seriously injuring the other — in separate robberies is scheduled to be executed later this month.  Ray Jefferson Cromartie, 52, is scheduled to be put to death Oct. 30 at the state prison in Jackson, state Attorney General", "authors": ["Kate Brumback"], "top_image": "https://s.yimg.com/uu/api/res/1.2/B4JRjOvrwOWDHsDW.yVY4Q--~B/aD0xMjExO3c9OTk0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/ap.org/ea574f8f353db254513344f9745deec9", "published_at": "2019-10-16"}