{"pub": "cbc", "url": "https://cbc.ca/radio/q/for-inuk-director-zacharias-kunuk-filmmaking-is-a-communal-effort-1.5332133", "downloaded_at": "2019-10-25 23:56:45.216569+00:00", "title": "CBC Radio", "language": "en", "text": "In his new film One Day in the Life of Noah Piugattuk, filmmaker Zacharias Kunuk brings to life a story that was passed down to him through oral tradition. Kunuk dramatizes the real story of the leader of a nomadic Inuit band as the government is pressuring them to move into a settlement.\n\nDirected by Kunuk, One Day in the Life of Noah Piugattuk was filmed mostly in Inuktitut.\n\nKunuk has a strong personal connection to this story. He was born in Kapuivik, where the story takes place and he was part of Noah Piugattuk's band.\n\nHe joined q guest host Angeline Tetteh-Wayoe to talk about making films from oral tradition and how his childhood inspired his love of movies.\n\n\"When I first started watching movies, it was like a godsend. When you see it on the screen, it's a story and they go off into the sunset at the end. I never knew that there's a camera and so many people work behind it. I never knew that,\" said Kunuk.\n\nHis new film is called One Day in the Life of Noah Piugattuk. It opened at the imagineNATIVE Film and Media Arts Festival in Toronto which runs until Sunday. He's also participating in both the Toronto and Venice Biennial of Art.\n\n— Produced by ​Vanessa Greco\n\nDownload our podcast or click the 'Listen' link near the top of this page to hear the full conversation with Zacharias Kunuk.", "description": "Filmmaker Zacharias Kunuk is known internationally for his 2001 film, Atanarjuat: The Fast Runner, the first feature film ever to be written, directed, and acted in Inuktitut. He talks about developing a multimedia school curriculum to teach students about the Arctic from an Inuit point of view and making movies from oral tradition.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5332633.1571862710!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/zacharias-kunuk.jpg", "published_at": "2019-10-24"}