{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7591221/Ruthless-Eddie-Jones-got-call-absolutely-spot-England-demolished-Australia.html", "downloaded_at": "2019-10-19 13:37:39.739044+00:00", "title": "RWC 2019: Ruthless Eddie Jones got every call absolutely spot on as England demolished Australia", "language": "en", "text": "Eddie Jones had one more battle to win. England had just beaten Australia 40-16. They had just equalled their best ever Test victory over the Wallabies.\n\nThey had just qualified for the World Cup semi-finals for the first time in 12 years.\n\nBut with Jones, there is always one more fight to pick, one more samurai to kill. It is never over.\n\nEddie Jones got everything absolutely spot on as England thrashed Australia on Saturday\n\nThe England coach on his feet during their 40-16 victory in the World Cup quarter-finals\n\nHe was asked whether he felt vindicated by England's superb performance after making the shock decision to drop George Ford and he bristled. He smiled that smile he always smiles before he lunges.\n\n'I didn't drop him, mate,' he said. 'I changed his role. Maybe you have got to stop reporting like you did 30 years ago. Rugby's changed. Come and join us. Join us.'\n\nJoin him? Sure. Everybody is going to be doing that over the next week. Especially after he masterminded this humbling of the Aussies. Especially after he did it very much his way.\n\nEngland will play New Zealand in Yokohama on Saturday in the country's biggest match since 2007 and we will all be riding his coat-tails until then.\n\nWe believe again now, you see. That's what Saturday did. It re-established the cult of personality around Jones that had faded in the summer of 2018 when England fell to five defeats in a row. The halo's back.\n\n'There's always a better samurai around the corner,' he said, already looking forward to the semi-final, but right now England wouldn't swap him for anyone.\n\nJones was spot-on both in terms of his team selection and his game plan for the contest\n\nThis was Jones' type of victory. This was not a battle that was won on the plains, on open ground. This was a battle won in the trenches, a battle won in gullies and culverts, a battle won with heart as well as strength and ability.\n\n'Defend with brutality,' their coach had told them on the eve of the game and England obeyed him to the letter.\n\nIn one match, in one stunning victory, Jones justified his hiring four years ago as the saviour of English rugby.\n\nHe lived up to his billing as the man to repair the damage after the desperate disappointment of exiting the 2015 World Cup, our World Cup, at the pool stage. He vindicated the decision to let him restore order and confidence to an England team in shock.\n\nJones had put himself on the line before this match. Make no mistake about that. He had stood with his chest bared to the point of the bayonet.\n\nIf England had lost this game, he would have been torn to pieces for dropping Ford, for tinkering too much, for controlling too much, for trusting too much in Owen Farrell. And then, probably, he would have been sacked.\n\nBut that is why England hired Jones in the first place. Because he is ruthless. Because he does not shirk difficult decisions even when they make him vulnerable.\n\nMay scored the opening try for England against Australia during their win on Saturday\n\nMay takes out his gumshield and celebrates with his team-mates having given his side the lead\n\nHe backs his judgment and he does not care what others think. Others might fret about alienating big-name players by dropping them. Jones does not give it a second thought. He does what he needs to do to win.\n\nEvery one of his decisions was vindicated. Leaving Ford out of the starting XV was the big one and the way England stood up to the juggernaut bursts of Samu Kerevi and the callow brilliance of Jordan Petaia justified that call even before Henry Slade, effectively Ford's replacement, burst forward in the first half and played a beautifully instinctive kick into the path of Jonny May for England's second try in two minutes.\n\nFarrell, restored as the side's playmaker, was practically faultless. He kicked unerringly, he led the side with authority and he dictated the tempo perfectly.\n\nIt was his brilliant flat pass to prop Kyle Sinckler seven minutes into the second half that sent him barrelling over the line and killed Australian hopes of a comeback after they had drawn within a point of England.\n\nThat was the game's crucial attacking move. The Australians do not like Sinckler because he taunts them and mocks them and his score seemed to break their hearts.\n\nMay adds his second try of the match to increase Eddie Jones' side's advantage\n\nMay celebrates with his team-mates including George Ford (right) who was left out of the side\n\nMaybe that was why Jones seemed to take particular pleasure in it. 'He is not short of athletic ability,' he said of Sinckler's burst for the line. 'He was charging. He was like a runaway rhino.'\n\nBut this was not a game decided by England's backs. Tom Curry was a deserved man of the match at flanker. This was a game won in defence. It was a game won in Jones' mind.\n\nHe knows World Cups tend not to be won by open, expansive teams who embrace risk. He knew that Australia's best chance of victory was overpowering England in midfield and so he nullified the threat. His tactics worked perfectly.\n\nWhen his opposite number, his old mate Michael Cheika, was asked whether he felt his own tactics of playing more open rugby had failed, he said that that was just the way Australia played.\n\n'I'm not going to go to a kick-and-defend game,' he said. 'Call me naïve.' Sadly for Cheika, that's exactly what he'll be called after he played straight into Jones' hands.\n\nEngland fans celebrate in Japan as they reach World Cup semi-\n\nFarrell's kicking was spot on as he made it four from four to convert Sinckler's try\n\nSunday, in theory, will be a day off for Jones, a day on which others might reflect and bask in glory. But Jones doesn't really do days off.\n\nHis previous one was last Thursday and he spent part of his afternoon coaching a group of sixth formers at a high school in the town of Beppu, where England were staying.\n\nWhen he thought they were not working as hard as they should be, he started barking at them good-naturedly. 'You're country boys,' he said. 'You should be fit. Rugby's about running. You've got to run hard. Do you think you can do it?'\n\nLater, he taught them tackling techniques. 'Pull them towards you when you tackle them,' he said. To make his point, he demonstrated it on one of the pupils, tipping him on to his back. Jones grinned. 'Look at that,' he said, 'and I'm 60 years old.'\n\nSixty years old and never better than he was last week. Never better than he was yesterday. Still not resting. Still hunting the next samurai.", "description": "OLIVER HOLT IN OITA: With Eddie Jones there's always one more fight to pick, one more samurai to kill. And so it was again after England's masterclass of a display against Australia.", "authors": ["Oliver Holt For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/13/19922882-0-image-a-28_1571489085993.jpg", "published_at": "2019-10-19"}