{"pub": "news24", "url": "https://city-press.news24.com/Trending/dont-miss-the-edge-of-your-seat-action-drama-as-wwe-turns-20-20191003", "downloaded_at": "2019-10-05 10:24:57.364267+00:00", "title": "Don’t miss the edge-of-your-seat action, drama as WWE turns 20", "language": "en", "text": "Trending Don’t miss the edge-of-your-seat action, drama as WWE turns 20\n\nCelebrating two decades in existence, the World Wrestling Entertainment (WWE) will host various events to celebrate this milestone.\n\nAs part of these celebrations, City Press attended events associated with these celebrations including the WWE’s newest live televised events, the NXT Live on USA, on Wednesday night in Orlando, Florida, US.\n\nBut the main attraction will be SmackDown Live’s debut on the Fox Network this Friday in Los Angeles.\n\nThis new development has also been widely advertised on DStv to alert South African wrestling fans.\n\nThe WWE, a publicly traded company on the New York Stock Exchange, is an integrated media organisation and recognised leader in global entertainment.\n\nThe company consists of a portfolio of businesses that create and deliver original content 52 weeks a year to a global audience.\n\nThe WWE prides itself on being committed to family friendly entertainment on its television programming, pay-per-view, digital media and publishing platforms. WWE’s TV-PG, family-friendly programming can be seen in more than 800 million homes worldwide in 28 languages.\n\nThe WWE Network, the first-ever 24/7 over-the-top premium network that includes all live pay-per-views, scheduled programming and a massive video-on-demand library, is currently available in more than 180 countries.\n\nThe company is headquartered in Stamford, Connecticut, with offices in New York, Los Angeles, London, Mexico City, Mumbai, Shanghai, Singapore, Dubai, Munich and Tokyo.\n\nBeginning with its 20th anniversary celebration SmackDown Live will become Friday Night SmackDown and air on WWE pop-up channel on DStv’ channel 128 52 weeks a year captivating fans with a unique combination of edge-of-your-seat action, unpredictable drama and world-class athleticism.\n\nThe WWE superstars, past and present, will be on hand to celebrate the occasion among them Kurt Angle, Lita, Mick Foley, Booker T, Hulk Hogan, Trish Stratus, Goldberg, Jerry Lawler, Mark Henry, Ric Flair and Sting.\n\nOn air since 1999, SmackDown is the second-longest running weekly television show in the US prime time history, only behind Monday Night Raw.\n\nSmackDown has aired more original episodes than some of the most popular television series of all time, including The Simpsons, Gunsmoke, Lassie and Monday Night Football.\n\nIn its 20-year history, SmackDown has also helped launch the careers of pop culture icons including Dwayne “The Rock” Johnson, John Cena, Triple H, “Stone Cold” Steve Austin and The Bella Twins.", "description": "Celebrating two decades in existence, the World Wrestling Entertainment (WWE) will host various events to celebrate this milestone.", "authors": ["Msindisi Fengu"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9432/a1852b86b2c344e7b27f6fbe166b1860.jpg", "published_at": "2019-10-03"}