{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Wellness/things-jessica-simpson-100-pound-weight-loss-journey/story?id=65873654", "downloaded_at": "2019-09-26 20:59:43.118832+00:00", "title": "5 things Jessica Simpson did on her 100 pound weight-loss journey, according to her trainer", "language": "en", "text": "Jessica Simpson rocked the Internet this week when she revealed on Instagram that she was down 100 pounds six months after giving birth to her third child, Birdie Mae.\n\nDuring her pregnancy, she \"tipped the scales at 240,\" she wrote in the post.\n\n\"My first trip away from #BIRDIEMAE and emotional for many reasons, but so proud to feel like myself again,\" she wrote. \"Even when it felt impossible, I chose to work harder.\"\n\nThe 39-year-old businesswoman and singer was guided on her weight loss journey by Harley Pasternak, a celebrity trainer and author of \"The Body Reset Diet.\"\n\nPasternak has been working with Simpson on her fitness, nutritional and wellness on and off for more than a decade, the trainer told \"Good Morning America.\"\n\nTo get Simpson to where she wanted to be to keep up with her three kids and her career, Pasternak took a holistic approach, focusing on using all 168 hours in a week to optimize Simpson's wellness.\n\n\"Even if I or Sydney [Simpson's trainer, Sydney Liebes] is working out with her for 45 minutes three times a week, or four times a week, there’s still 165 of the 168 hours that she’s not working out,\" he said. \"That was the key to this transformation.\"\n\nPasternak gave Simpson five things to accomplish every day and, for accountability, had her email him every night with an update on how she did.\n\nHere are the five things he and Simpson focused on, with more specific details provided by Pasternak.\n\n1. 12,000 steps per day: \"This was a big part of losing the 100 pounds. She could do it by going for walks with her family, walking on the treadmill watching TV, just moving her body in a non-intense way.\"\n\n2. 7 hours of sleep per night: \"Sleep is such an important thing, especially for a mom with three little kids at home and a big business. [Simpson] got at least 7 hours of quality, continuous sleep every night.\"\n\n3. 1 hour away from technology daily: \"No cellphone, laptop or tablet ... That’s really important to control the hormones in our brain that are overwhelmed by the blue light on our phone, by the vibrations and alerts of our technology and the cortisol that’s released.\"\n\n4. 3 meals, 2 snacks per day: \"Meals had protein, fiber and healthy fat. Snacks had protein and fat or protein and fiber. We did not diet in a tasteless, extreme, radical way. [Simpson] loves Tex-Mex flavors so she had a lot of healthy versions of Tex-Mex foods.\"\n\n5. Circuit workouts for exercise: \"We had her doing three to four days a week of resistance exercise, a circuit of a few different body parts per day. We’d pick different body parts each of the three or four workouts a week.\"\n\nPasternak points out that the course of Simpson's dramatic weight loss included her giving birth to her 10 lbs., 13 oz daughter, Birdie Mae Johnson, and her body letting go of fluid and weight from her pregnancy.\n\nHe credits Simpson for her \"fantastic attitude\" and hard work and said that just like the singer's open-book weight journey is relatable, so too is the way she accomplished her most recent weight loss.\n\n\"There is no magic diet that is the end all and be all,\" said Pasternak, who recently launched Sweetkick, a tool to help sugar cravings. \"If you take enough steps per day, you don’t need to starve yourself food wise, and if you eat properly, you don’t need to run a marathon.\"\n\n\"It’s by doing moderate amounts of aerobic activity per day, and in this case we count them as steps, and eating a balanced, moderate diet with a low-sugar lifestyle, that’s essential,\" he said.", "description": "Celebrity trainer Harley Pasternak had Simpson email him daily for accountability.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/jessica-simpson-ht-jef-190924_hpMain_16x9_992.jpg", "published_at": "2019-09-26"}