{"pub": "reuters", "url": "https://reuters.com/article/us-saudi-nationalday/saudis-project-resolve-flash-military-might-after-aramco-attack-idUSKBN1W824G", "downloaded_at": "2019-09-23 19:14:22.683256+00:00", "title": "Saudis project resolve, flash military might after Aramco attack", "language": "en", "text": "RIYADH (Reuters) - Thousands of Saudis flocked to public celebrations across the country on Monday to mark national day, which featured a rare military parade and an air of heightened patriotism following last week’s attack on the kingdom’s energy industry.\n\nSaudi people walk past a poster depicting Saudi Arabia's King Salman bin Abdulaziz and Crown Prince of Saudi Arabia Mohammad bin Salman during the 89th annual National Day of Saudi Arabia in Riyadh, Saudi Arabia September 23, 2019. REUTERS/Ahmed Yosri\n\nAs the conservative nation looks to open up, the annual festivities have expanded to include more elaborate music and art shows, in line with a broad reform agenda that has introduced once-taboo public entertainment and granted women more rights.\n\nNationalism, already on the rise under the powerful Crown Prince Mohammed bin Salman, appeared amplified in the wake of Sept. 14 strikes on Saudi Aramco plants that knocked out more than half the oil production of the world’s top exporter.\n\nRiyadh and Washington have rejected a claim of responsibility by Yemen’s Iran-aligned Houthis and instead blamed Tehran, which denies any involvement. A Saudi-led coalition intervened in Yemen’s civil war in 2015 against the Houthis.\n\nThe military staged a parade with 2,000 troops in the southwestern city of Abha, whose civilian airport has been frequently targeted by Houthi drone and missile strikes. Saudi fighter jets and helicopters buzzed over paratroopers carrying the county’s green and white flag.\n\nIn Jeddah and the capital Riyadh, fighter jets from the air force and an acrobatics team flew in formations. The five-day schedule includes musical concerts, fireworks and light shows, and a Cirque du Soleil performance.\n\n“The celebrations today are a defeat for (our enemies). The people, the leadership and the army are all united as one,” said Ziad Alyami, a folklore performer from Najran.\n\nAfter the attacks, which the military failed to intercept despite spending billions of dollars on cutting-edge gear, Saudi officials insisted the country was capable of defending itself. The United States, its top ally, is sending troops and expediting the delivery of military equipment to bolster defenses.\n\nAt a street festival in central Riyadh, Saudis said they were unfazed by the assault and hailed this year’s celebrations as a show of resilience.\n\n“This is a very strong message from us, the Saudi people, to the enemies of Saudi Arabia that we are all together. They will not stop us,” said a woman named Basha’ir.\n\n“We’re not scared of anything,” said Hassan Mahjoub Hashem. “Thank god we are safe and sound and despite all this we are out here celebrating with our heads held high.”\n\nIn weekly prayers on Friday, state-sanctioned sermons underscored the need for citizens to “rally around the wise leadership” of the country, according to state news agency SPA.\n\nSaudi national day marks the unification of the desert kingdom in 1932 by King Abdulaziz Ibn Saud, Prince Mohammed’s grandfather.", "description": "Thousands of Saudis flocked to public celebrations across the country on Monday to mark national day, which featured a rare military parade and an air of heightened patriotism following last week's attack on the kingdom's energy industry.", "authors": ["Nael Shyoukhi", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190923&t=2&i=1433042596&w=1200&r=LYNXMPEF8M1QN", "published_at": "2019-09-23"}