{"pub": "independent", "url": "https://independent.co.uk/travel/hotels/best-hotels-paris-for-families-centre-5-star-with-eiffel-tower-view-close-attractions-reviews-a8122076.html", "downloaded_at": "2019-10-09 18:45:25.887788+00:00", "title": "Paris hotels: 15 best places for style and location", "language": "en", "text": "The City of Lights: it’s the place to stroll down boulevards, gaze at world-famous art and eat like a king – but where should you bed down when it’s time for lights out? As the capital city of the world’s most-visited country, the choice of where to stay in Paris is mind-boggling, with thousands of accommodation options, from budget hostels to luxury hotels, and B&Bs to self-catering apartments.\n\nAs a France specialist, I’ve stayed in hundreds of hotels across l’Hexagone, but nothing quite compares to the je ne sais quoi of the kind of Parisian abodes which can, in themselves, become a highlight of any stay in the French capital.\n\nBut style doesn’t have to mean breaking the bank; there are plenty of superb hotels offering great service, exquisite decor and a peaceful night’s sleep without getting into debt. It’s what we at The Independent call “real-world luxury”. So take a peek at these before your next trip to Paris.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe Independent's hotel reviews are unbiased, independent advice you can trust. On some occasions, we earn revenue if you click the links and book, but we never allow this to affect our coverage. The reviews are compiled through a mix of expert opinion and real-world testing.\n\nBest for shopping: Grands Boulevards\n\nFrom London’s Experimental Cocktail Group comes Hotel des Grands Boulevards, a chic new property located in a 300-year-old manor house close to some of Paris’ best shopping streets, which opened in December 2017. Wonderfully discreet, it’s reached via a secret corridor and has its own quiet courtyard and terraces.\n\nThe 50 rooms have been created by Parisian designer Dorothée Meilichzon, and have handmade beds from Brittany with satiny, 300-threadcount sheets, while some rooms offer bathtubs big enough for two. There’s also an Italian restaurant and a terrace cocktail bar with views of Paris. The best bit? Despite its buzzing central location, the bedrooms promise complete silence.\n\nDoubles from €200, room only\n\ngrandsboulevardshotel.com​\n\nBest for cocktails: The Hoxton Paris\n\nThe newest addition to Paris’ design hotel scene is a British export. The Hoxton Paris, which opened in summer 2017, brings with it superb Moroccan-inspired cocktails in Jacques’ Bar. Decorated in florals and velvets, with full-height windows, it makes all-day cocktails a perfectly acceptable prospect.\n\nThe hotel itself is located in an 18th-century mansion, and is the biggest of the Hoxton hotel collection (currently in London, Amsterdam and Brooklyn). Spread over three buildings, it offers 172 bedrooms in four very British-named categories – Shoebox, Cosy, Roomy and Biggy – with decor featuring parquet floors, elegant cornicing, bold feature walls and geometric-tiled bathrooms. The standout design feature is its 15 elegant staircases, two of which are more than 300 years old. Elsewhere, the decor incorporates other features of the original building, such as tiles and mosaics, and exposed timber roof beams.\n\nDoubles from €99, B&B (there’s a free light breakfast bag delivered to your room; for anything else, you have to pay)\n\nthehoxton.com​\n\nBest for classic style: Pavillon des Lettres\n\nThis soothing hotel is a must-stay for book lovers: its elegant decor is dedicated to great works of literature. Each of its 26 rooms and suites is dedicated to a different letter in the alphabet and in turn a great scribe, from Hans Christian Andersen to Emile Zola.\n\nSome rooms offer views of the Eiffel Tower, but all feature calming neutral tones and hand-stencilled texts from the writers’ great works. It’s located in the 8th arrondissement, so is a short stroll from the Champs Elysées.\n\nDoubles from €198, B&B\n\npavillondeslettres.com​\n\nBest for history: L'Hotel\n\nLiterature lovers will delight in this bijou hotel, tucked away on the Left Bank. Once upon a time, it was a flea-bitten doss house where Oscar Wilde breathed his last breath, shortly after uttering the words “This wallpaper and I are fighting a duel to the death.”\n\nNow, though, on the walls of that very same room (number 16), interiors guru Jacques Garcia has created a magnificent fresco of a gold and green peacock, while the rest of the room features historic prints and photos of Wilde, as well as the famous scribe’s desk. Elsewhere, the tiny bar makes for a wonderfully cosy spot to be served a cocktail by the velvet-waistcoated bar staff. Dita Von Teese is a fan, and so – apparently – is Johnny Depp.\n\nDoubles from €298, B&B\n\nl-hotel.com​\n\nBest for fun: Hotel 123 Sebastopol\n\nThe French love a theme and this fantastic movie-obsessed hotel is just a few metres from the famous cinema Le Grand Rex. Every detail is cleverly thought out, from its reception desk beneath an illuminated billboard to the cinema posters in the lobby.\n\nThe 63 bedrooms vary in style and have been designed by such cinematic glitterati as film-score composer Ennio Morricone and César-award-winning actress Elsa Zylberstein. The minibars are stocked with complimentary soft drinks.\n\nDoubles from €114, B&B\n\nle123sebastopol.com​\n\nBest for budget: Mama Shelter\n\nThe Mama Shelter brand launched in 2009 with this, their original hotel; since then the budget-style group has gone global, with branches in Hollywood and Rio de Janeiro as well as in key French cities. Prague and Belgrade are up next.\n\nThat’s not to say it lacks that French vibe; as the original, this was designed by Philippe Starck, who gave his quirky Midas touch to the whole place. Meanwhile, many of the dishes on the menu in the laidback restaurant were created by another French legend, Michelin-star chef Guy Savoy.\n\nThe 172 bedrooms aren’t enormous, especially the entry level ones, and they’re deliberately designed to be cocoon-like with black and grey decor. But with mod cons such as a 27-inch iMac doubling as a TV, it’s the perfect place to crash when the City of Lights has worn you out.\n\nDoubles from €79, room only\n\nmamashelter.com\n\nBest for luxury: The Saint James\n\nIf you’re going to push the boat out with something a little different, then this slightly bonkers 49-room hotel, part of the Relaix & Châteaux group, is the place. Set in the elegant 16th arrondissement on a former airfield that was used to launch hot air balloons, this theme is carried through into the hotel’s Wonderland-esque decor with rooms sporting bold toile wallpapers and lavish fabrics.\n\nElsewhere, it features a glamorous red-carpeted staircase and copious animal print. Meanwhile, two-Michelin-star chef Jean-Luc Rochas works magic in the chandelier-lit restaurant.\n\nDoubles from €380, room only\n\nsaint-james-paris.com​\n\nFans of Christian Lacroix will love this four-star boutique hotel in the Marais; the fashion designer has brought his flamboyant style to the 17 rooms. All are decorated in a unique style, including polka-dot carpets and zebra-print fabrics, giving a nod to the history, culture and art of the area. On the doorstep there are a host of hip boutiques, as well as restaurants and bars (though the hotel’s own bar is the ideal place to kick off your evening with an aperitif). Lacroix isn’t the only celebrity to be linked to the property – the building was Paris’ first bakery, and Victor Hugo used to buy his baguettes here.\n\nDoubles from €225, B&B\n\nhotelpetitmoulinparis.com​\n\nBest for romance: Le Bourg Tibourg\n\nThis bijou four-star hotel in the hip Marais District is another of Jacques Garcia’s works. This time, he’s made what is a tiny space into something of an Aladdin’s cave of decor. The place abounds with whimsical opulence: chandeliers, antique furniture, lavish fabrics and wallpapers all in deep reds, with accents of purple, green and grey.\n\nRooms are cosy, but it’s a delight to snuggle into the comfortable beds and watch a classic French film (available from reception), complete with popcorn. Staff are welcoming without being overbearing, and the hotel is a hop, skip and jump from some of the Marais’ best restaurants and bars.\n\nDoubles from €290, room only\n\nbourgtibourg.com​\n\nNot many hotels can lay claim to their own ice bar but this is the main attraction at Kube, where you can sip vodka cocktails in glasses made of ice, in -10C temperatures. The theme doesn’t end there; on arrival at the hotel you’re welcomed into the reception, set in a large glass cube in the courtyard.\n\nFrom there, everything’s designed to be modernist and fun. Its 40 open-plan, minimalist rooms offer all mod cons, including plasma TVs, CD and DVD players. The hotel is a short walk from Gare du Nord, so it’s a great location if travelling with Eurostar.\n\nDoubles from €139, room only\n\nkubehotel-paris.com​\n\nBest for nightlife: Grand Pigalle\n\nSet in the hip Pigalle district under the gaze of the Sacré-Coeur basilica, Grand Pigalle was the first Paris hotel from the Experimental Cocktail Group (which have also just opened sister Hotel des Grands Boulevards, above) and makes the perfect base for those in search of Paris’ coolest bars and restaurants. Rooms are cosy but offer swish decor from top designer Dorothée Meilichzon in muted greys and teal tones, with geometric patterns in tiles and wallpapers. I particularly love the cocktail-glass carpet on the hallways and stairs and pineapple door knockers. Breakfast is served in the bar area and offers their delicious homemade granola.\n\nDoubles from €170, room only\n\ngrandpigalle.com​\n\nBest for a local hangout: Le Pigalle\n\nOnce upon a time, the Pigalle district was a bit seedy – it’s the home of the Moulin Rouge after all – but these days it’s one of Paris’ hippest quartiers that harks back to its heyday as a boho hangout for artists and musicians. The hotel itself celebrates all that is local: breakfast features croissants from the best local bakery, the cool bar has a soundtrack curated by a local DJ, and should you find yourself alone, there are plenty of books supplied by a local bookshop to peruse. Its 40 rooms are decked out with vintage furniture with a mid-century vibe and feature edgy photography and art works.\n\nDoubles from €101, room only\n\nlepigalle.paris\n\nBest for a sweet tooth: Hotel Fauchon\n\nParis’ Fauchon boutiques are likely to inspire Willy Wonka-esque levels of mouth-watering awe, with their exquisite pastries, decadent chocolates and aromatic teas and coffees. Gourmets will be spoiled with a night or two at the new hotel, the first from the much-loved French patisserie brand, which was established in 1886. With the brand’s accent colours of fuchsia pink, black and gold tastefully carried through the décor, the comfortable rooms all have mod cons, from tablet-controlled music and movies, to Bluetooth-linked speakers in the bathroom. The pièce de la resistance is the \"gourmet bar\": a souped-up mini-bar rammed with free champers, chocolates and other goodies. There’s also a small spa and an excellent restaurant.\n\nDoubles from €650\n\nhotel-fauchon-paris.fr\n\nBest for interior décor: Brach Paris\n\nPhilippe Starck does a good hotel; the acclaimed French designer is responsible for the budget chic Mama Shelter, the palatial Le Meurice and dozens of other hotels worldwide – and his latest, Brach Paris, is a real treat. The moment you enter the glass façade, dripping with jungle-like foliage, you’re enveloped into a sumptuous space that blends Bauhaus, modernism and surrealism; warm wood panelling and plush carpets, gentle lighting and books everywhere lend an atmosphere that is hard to resist.\n\nBrach is set in the residential 16th arrondissement, and the hotel has spaces designed to welcome the well-heeled set: a sports club, swimming pool, and an enticing bar and restaurant. Ask to see the roof-top potager garden for its sensational views of the Eiffel Tower.\n\nDoubles from €410, room only\n\nbrachparis.com\n\nBest for classic luxury: Hotel Lutetia\n\nIn the early 20th century, the grand Hotel Lutetia on the Left Bank was the place to see and be seen, with stars such as Josephine Baker and Ernest Hemingway being frequent visitors. After a four-year renovation, during which architect Jean-Michel Wilmotte has sliced into the building to bring light into the once-dark areas, it has been given a new lease of life and an almost other-worldly feel. Polished walnut, white marble and a midnight blue and ‘greige’ (grey-meets-beige) colour scheme combine for an elegant yet modern effect, with occasional nods to the original art nouveau and art deco style. There is a spa, with a huge swimming pool, and the new Brasserie Lutetia – headed up by three-star Michelin chef Gerald Passedat – opens at the end of 2018.\n\nDoubles from €850, room only\n\nhotellutetia.com\n\nThis article has been updated. It was originally published in December 2017", "description": "15 of the best design hotels in Paris, from family-friendly to luxury digs. Want a view of the Eiffel Tower? Here's where to find one with style.", "authors": ["Carolyn Boyd"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/12/22/09/parishotelmain.jpg", "published_at": "2018-11-28"}