{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7576971/Kylie-Jenner-gets-Halloween-spirit-dressing-three-Italian-Greyhounds.html", "downloaded_at": "2019-10-15 23:53:17.449438+00:00", "title": "Kylie Jenner gets in the Halloween spirit by dressing up three of her Italian Greyhounds", "language": "en", "text": "It's one of her favorite holidays.\n\nAnd with 17 days to go, Kylie Jenner is making sure she's ready for Halloween.\n\nOn Monday evening, the 22-year-old make-up mogul took to her Instagram to show off three of her four Italian Greyhounds dressed in costume.\n\nThe dogs were decked out in Toy Story themed costumes - Woody, Buzz Lightyear, and Bo Peep.\n\nHalloween time! On Monday Kylie Jenner took to her Instagram to show off three of her four Italian Greyhounds dressed up in costume\n\nIt's Buzz! One of her little Greyhounds was wearing a Buzz Lightyear costume\n\nKylie's dogs, Norman and Bambi (who have their own Instagram account) were the first two she welcomed before having a litter of puppies and keeping two of them from the bunch.\n\nShe then kept a silver and a tan Greyhound in which she named Rosie and Harlie.\n\nIn the videos, the three dogs are seen scampering around in their costumes, while Norman skipped the Toy Story attire.\n\nBo Peep: Her dogs didn't seem to mind the costumes as they ran around the house without trying to rip them off; Bambi is dressed as Bo Peep\n\nThe gang's all here! Kylie tried to get a photo of her 'Toy Story children' by lining them up but the dogs just couldn't sit still\n\nThe twins: Her two youngest dogs, Harlie and Rosie strike the same pose for a photo\n\nKylie has been keeping a bit of a low profile since it was announced a couple weeks back that she and Travis Scott had split up.\n\nWhile the two haven't said what exactly caused the rift in the relationship ET sources say that they are just 'on a break' but are 'great at co-parenting' their daughter.\n\nThe two started dating back in April 2017 and welcomed their daughter Stormi just nine months later.\n\nFormer flames: Kylie poses with her now ex-boyfriend Travis Scott for apre-Grammy Gala party back in February\n\n\n\n", "description": "On Monday evening, the 22-year-old make-up mogul took to her Instagram to show off three of her four Italian Greyhounds dressed in costume.", "authors": ["Shelslaughter At Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/22/19759838-0-image-a-95_1571173432890.jpg", "published_at": "2019-10-15"}