{"pub": "dailymail", "url": "https://dailymail.co.uk/money/mortgageshome/article-7530271/Stamp-duty-half-baked-tax-time-cut.html", "downloaded_at": "2019-10-05 07:11:36.842948+00:00", "title": "Stamp duty is a half-baked tax - it's time it was cut", "language": "en", "text": "As with many of former Chancellor George Osborne’s plans, the stamp duty shake-up five years ago was half way to a good idea.\n\nUnfortunately, the other half of the idea, which involved squeezing even more out of those buying expensive homes doesn’t seem to have paid off.\n\nFigures revealed this week that the stamp duty take fell by 10 per cent last year, the biggest drop since the financial crisis, with the Government collecting £905million less, albeit a still chunky £8.4billion.\n\nThat chimed with both the removal of stamp duty for most first-time buyers but also an 8 per cent slump in transactions of homes costing more than £1million.\n\nStamp duty receipts have climbed shrunk as the property market in London and the South has suffered - and that's the part of the country picking up most of the bill\n\nOf course, you cannot draw a direct causal link between stamp duty and that fall in sales, everything from Brexit uncertainty, to less foreign buyers and the mini-boom that preceded the slide in sales needs to be chucked into the pot too.\n\nNonetheless, it seems fairly safe to say that a shaky market won’t be helped by people being hit with a £44,000 tax bill for the privilege of having to spend an awful lot of money buying a home.\n\nAnd I use the word privilege there both sarcastically and seriously.\n\nThat’s because ever since Gordon Brown started tinkering with stamp duty – tweaking it from a flat 1 per cent above £60,000, to rates rising with the purchase price - there has existed the idea that those forced by house price inflation to pay through the nose for a home are somehow benefitting and should be taxed hard.\n\nWhen you think about it that is bizarre.\n\nAnd this is not just a problem hitting £1million homebuyers, stamp duty starts to seriously bite at less than half that level.\n\nBuy a home costing £400,000 and you must hand over £10,000 of your savings in tax. That is the kind of money it would take most people years to save.\n\nHigh stamp duty also impedes the economy, as it is a drag on transactions and discourages people from moving for work, plus it encourages them to borrow more on mortgages, as the tax bill ate some of their deposit.\n\nIt is high time it is reformed, but the reform needs to be better than the last one.\n\nThe chart from the Greater London Authority's recent Housing in London report shows how Londoners have been tapped up for an increasing share of Britain's stamp duty bills - and also by how much that bill has soared since 1997\n\nGeorge Osborne’s shift from the old slab-style stamp duty, which imposed higher tax rates above thresholds on the entire price, to a progressive income tax-style system, with higher rates only levelled above the thresholds, was sensible.\n\nThe previous system had been used to milk rising house prices and created the cliff edge scenarios, such as that at the 3 per cent level at £250,000, where tax jumped from £2,500 to £7,500.\n\nHow much would stamp duty cost you? Would you pay nothing as a first-time buyers, under £10,000 or be hit with a £30,000-plus bill? Use our stamp duty calculator to see how much moving home would cost you. > Stamp duty calculator\n\nIt was a daft system and tax bills for buying a home had already reached a level at which they were deterring people from moving.\n\nYet, Mr Osborne couldn’t quite bring himself to revamp a tax that while widely seen to be a duffer was also a cash cow.\n\nHe was presumably also acutely conscious that he would face criticism of aiding the wealthier and those in London and the South East, who pay a colossal chunk of the nation’s stamp duty bill.\n\nHome moves in London account for an astonishing 40 per cent of stamp duty receipts, for example, and a large proportion of all that money raked in will come not from the well-heeled in their central London townhouses, but from ordinary families of Londoners squeezed into flats and terraced houses.\n\nFor the past two decades, Britain’s inflation-ravaged property market – particularly the bit in London and the South – has been seen by successive governments as the goose that lays the golden egg.\n\nIn future, chancellors would do well to remember the moral of that fable.", "description": "As with many of former Chancellor George Osborne's plans, the stamp duty shake-up five years ago was half way to a good idea, unfortunately the other half reveals how bad a tax it is.", "authors": ["Simon Lambert For Thisismoney.Co.Uk", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/02/18/19178200-0-Receipts_from_residential_purchases_fell_10_per_cent_or_905milli-a-6_1570036319678.jpg", "published_at": "2019-10-03"}