{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7592683/Kim-Kardashian-Winnie-Harlow-smolder-sheer-black-tops-promote-new-collaboration.html", "downloaded_at": "2019-10-20 03:40:40.457503+00:00", "title": "Kim Kardashian and Winnie Harlow smolder in sheer black tops as they promote their new collaboration", "language": "en", "text": "They have launched a joint beauty line.\n\nAnd Kim Kardashian got together with Winnie Harlow for an evocative Instagram post on Saturday promoting a deal on their product.\n\nThe 38-year-old reality TV icon and the 25-year-old model, who has vitiligo, smoldered in sheer black turtlenecks for the snapshot.\n\nWhat a bargain: Kim Kardashian got together with Winnie Harlow for an evocative Instagram post on Saturday promoting a deal on their joint beauty line\n\n'Shop my @kkwbeauty #KKWXWINNIE Collection for 20% off!! Ends tomorrow, 10.20 at 11:59pm pst at kkwbeauty.com,' captioned Kim.\n\nThey appeared to be modeling the same see-through outfits in a publicity shot for their collaboration released at the beginning of September.\n\nKim and Winnie debuted their makeup line on September 13 with a launch party at L'Avenue at Saks Fifth Avenue during New York Fashion Week.\n\nA star-studded array of friends were in attendance, including Paris Hilton, La La Anthony, Karrueche Tran and Jonathan Cheban.\n\nOuttake?: They appeared to be modeling the same see-through outfits in a publicity shot for their collaboration released at the beginning of September\n\nBig week: Kim also used her Instagram page that day to celebrate the Sunday launch of her own beauty line at Ulta Beauty shops\n\nIncoming: Kim used her Insta Stories to share an hour countdown with her fans to the launch\n\nKim tweeted this Friday at Texas Governor Greg Abbott begging him not to go through with the scheduled November 20 execution of Rodney Reed.\n\nReed was convicted of the 1996 rape and strangulation of 19-year-old Stacey Stites, whose family believes her ex-cop fiance was the real culprit.\n\nThree expert witnesses whose testimony helped secure Reed's conviction have since admitted errors in their original statements, as seen in documents obtained by the Innocence Project.\n\nKim, now an aspiring lawyer, famously visited the White House last year and successfully advocated to get Alice Marie Johnson pardoned and released.\n\nOnly the best: Kim and Winnie debuted their makeup line on September 13 with a launch party at L'Avenue at Saks Fifth Avenue during New York Fashion Week\n\nKim, who is now aspiring to become a lawyer, drew a great deal of attention last year for visiting the Trump White House and successfully advocating to secure a pardon for Alice Marie Johnson.\n\nAlice, whose work with a Memphis cocaine trafficking ring got her convicted on eight nonviolent criminal counts in 1996, was released last June.\n\nKim has since recruited Alice Marie in an ad for her shapewear line SKIMS, in which she praised 'my War Angel' Kim and said: 'This shapewear makes me feel free.'\n\nThe daughter of Kris Jenner told Vogue this year that her plan is to skip law school and go straight to taking the bar exam after apprenticing at a legal firm.", "description": "They have launched a joint beauty line. And Kim Kardashian got together with Winnie Harlow for an evocative Instagram post on Saturday promoting a deal on their product.", "authors": ["Sameer Suri For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/03/19944070-0-image-a-76_1571538156549.jpg", "published_at": "2019-10-20"}