{"pub": "usatoday", "url": "https://usatoday.com/story/travel/news/2019/10/30/hulk-hogan-plane-makes-difficult-landing-iceland/4095292002", "downloaded_at": "2019-10-30 14:20:46.084309+00:00", "title": "'Blew out the tires and brakes have melted': Hulk Hogan's plane makes difficult landing in Iceland", "language": "en", "text": "CLOSE The news comes after Hulk Hogan won a lawsuit against Gawker — the outlet had posted part of a sex tape featuring the former pro wrestler. Video provided by Newsy Newslook\n\nFormer wrestler Hulk Hogan's had a scare on his flight to Iceland when the plane he was traveling on ran into difficulties upon landing.\n\nHogan, whose real name is Terry Bollea, posted a Facebook Live video stream on Tuesday recounting the incident.\n\n\"We are here in Iceland and there's our plane that we just had a really hard landing on,\" Hogan says, panning to the plane. \"Blew out the tires and brakes have melted, and that thing's not going anywhere.\"\n\nAsk the Captain: Landing with a blown tire and coping with cold and flu season as a pilot\n\nHe added a buddy with the same type of plane had stepped in to transport him to his final destination, Saudi Arabia, for this year's WWE Crown Jewel event. Hogan did not clarify whether the stop in Iceland was a planned part of his journey.\n\nThe video has nearly 70 shares and more than 52,000 views.\n\nHogan said he would keep his followers updated and let them know when he arrived at his destination (he has since arrived). Fans have flooded the comments wishing Hogan well.\n\nHogan lost his wrestling career after the release of a sex tape in which he was heard using the N-word. He sued Gawker for publishing portions of the tape online and won, bankrupting the website.\n\nHe returned to to the WWE late last year to host its Crown Jewel pay per view event in Saudi Arabia.\n\nUSA TODAY has reached out to Hogan's reps for more information.\n\nName you know: Hulk Hogan. Birth name: Terry Gene Bollea. (Photo: Gerardo Mora, Getty Images)\n\n'We heard an explosion': Jennifer Aniston recounts emergency plane landing\n\nYikes: Post Malone's scary plane emergency landing detailed: FAA finds safety issues, significant damage\n\nRead or Share this story: https://www.usatoday.com/story/travel/news/2019/10/30/hulk-hogan-plane-makes-difficult-landing-iceland/4095292002/", "description": "Hulk Hogan's plane made a difficult landing in Iceland – so bad that it blew out the tires and melted the brakes.", "authors": ["David Oliver", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/ccbb26a53de2ef4d471dda581fdb92d9e6e1c704/c=0-555-1992-1681/local/-/media/2017/08/08/USATODAY/USATODAY/636378042442749023-Hulk-Hogan.jpg?width=1600&height=800&fit=crop", "published_at": "2019-10-30"}