{"pub": "townhall", "url": "https://townhall.com/columnists/michellemalkin/2019/10/24/laura-loomer-disrupter-for-congress-n2555193", "downloaded_at": "2019-10-25 00:39:53.887908+00:00", "title": "Malkin: 'Laura Loomer for Congress'", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nThe Beltway swamp is clogged with miserable crapweasels: smug incumbents, status quo lemmings, Constitution infringers of all flavors, Silicon Valley lackeys, jihad apologists, open borders freaks and, oh, that Trump-deranged lurker, Mitt \"Pierre Delecto\" Romney.\n\nIn a country of 325 million people, can't we just have one elected official on Capitol Hill with the guts to call out the rest of the swamp things?\n\nThis is why I support Laura Loomer for Congress. Last week, the fiery investigative journalist and activist based in Florida announced that her campaign had raised nearly $160,000 in just 60 days of fundraising. More than 2,300 donors across all 50 states, with Florida leading the way, provided their financial support in the third quarter of the year for Loomer's upstart bid. The average contribution was $66.\n\nBy comparison, Loomer's campaign points out, socialista darling Alexandria Ocasio-Cortez raised $59,000 in her first combined two quarters for her congressional campaign as a political newcomer in New York. Meanwhile, Loomer's opponent, incumbent Democrat and Pelosi pal Rep. Lois Frankel only raised $107,000 in the same time period, and just one of Loomer's GOP rivals of the five candidates in the FL-21 field raised any money (less than $20,000). As a political newcomer, her campaign noted, Loomer outraised all of her opponents combined.\n\n\"I'm humbled at the outpouring of support for my campaign,\" Loomer told me. \"This early showing puts career politician Lois Frankel and the do-nothing-Democrats in Congress on notice that no seat is safe, and that I'm running to win.\"\n\nAny way you slice it, this is news. It's especially noteworthy because Loomer is the most banned woman on all of social media. Almost a full year ago, the 26-year-old independent reporter was suspended permanently from Twitter (where she had built up a formidable following of more than 250,000 users) during the crucial midterm election season. Loomer had lambasted Twitter for curating an Ilhan Omar tweet in its coveted \"Twitter Moments\" feature. \"Ilhan is pro Sharia,\" Loomer wrote. \"Under Sharia, homosexuals are oppressed & killed. Women are abused & forced to wear the hijab. Ilhan is anti Jewish.\"\n\nOmar, of course, is the first-term Somalia-born Democratic Muslim congresswoman from Minnesota, who has since been caught giggling about al-Qaida; downplaying the 9/11 terrorist attacks; apologizing for anti-Semitic comments and then doubling down on others; calling for a United Nations takeover of American borders; reportedly engaging in purported marriage, tax, immigration and campaign finance fraud related to a bizarre marital arrangement with two different men (one of them suspected to be her own brother); and reportedly larking around with her married campaign manager. Loomer was the first to directly and publicly confront Omar about the brusband marriage scandal before she was elected.\n\nLoomer was also at the vanguard exposing what I call Silicon Valley Sharia. After being kicked off Twitter, she was ruthlessly expunged from Paypal, Instagram, TeeSpring, Facebook, Uber, Uber Eats, Lyft, Venmo, GoFundMe and Medium. She is suing Twitter and the speech-squelching grievance-mongers of the Council on American Islamic Relations to expose collusion against conservatives between the company and the unindicted co-conspirator of Islamic terrorist financing. She is also suing conservative speech-suppressing Google in the D.C. Circuit Court of Appeals, which recently rejected the social media giant's bid to have her lawsuit summarily dismissed.\n\nNow, of course, pundits and politicians are falling all over themselves to jump in front of the parade against Silicon Valley censorship. But last fall, many of those same opportunists laughed at Loomer for disrupting a dog-and-pony House Energy and Commerce hearing with Twitter CEO Jack Dorsey. When he denied that the social media site discriminated against conservatives, Loomer roared: \"You are a liar, Jack Dorsey!\" and boldly charged him with \"committing perjury.\" Instead of challenging Dorsey, Republican Rep. Billy Long mocked Loomer and drowned her out with an auctioneering chant. Virtue-signaling conservatives (even on Fox News) ridiculed Loomer instead of heeding her warnings about systematic de-platforming and partisan rigging of the social media playing field.\n\nBut here's the thing: Loomer's campaign is about far more than getting back a Twitter account. It's about giving Floridians (and the rest of us) a clarion voice against Beltway business as usual on everything from mass, uncontrolled immigration to antifa violence to political corruption enabled by Frankel's pal, Nancy Pelosi. Karen Giorno, Trump's 2016 Florida state director and chief strategist for the Loomer campaign, told me: \"Laura is proving that she is a serious candidate and committed to flipping this seat.\"\n\nPolitical analysts on both sides of the aisle should not underestimate this bellwether candidacy. Just look at the actions of those who fear Laura Loomer most: Mere hours after she announced her run in August, Twitter announced it was changing its verification policy for authenticating congressional candidates. Previously, announced candidates could receive a verified checkmark. The Loomer Rule now requires candidates to win their primaries first.\n\nThey keep throwing up obstacles, but the gonzo journalist/activist persists. She's made all the right enemies. Now, it's time for friends of the First Amendment to put their time and money where their mouths are. Help elect a one-woman Free Speech Squad to counter the anti-American congressional Brat Pack. Disruption, not deference, is the key to defeating the Democratic resistance.\n\nMichelle Malkin's email address is MichelleMalkinInvestigates@protonmail.com. To find out more about Michelle Malkin and read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate website at www.creators.com.", "description": "The Beltway swamp is clogged with miserable crapweasels: smug incumbents, .10/24/2019 20:35:22PM EST.", "authors": ["Michelle Malkin", "Matt Vespa", "Timothy Meads", "Bronson Stocking", "Sarah Lee"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/267/6052560e-cee4-4525-a99f-e978df77c28b.png", "published_at": "2019-10-24"}