{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/24/lewis-hamilton-brushes-off-enivronmental-critics", "downloaded_at": "2019-10-24 23:59:03.209035+00:00", "title": "Lewis Hamilton brushes off critics and steps up efforts to be more green", "language": "en", "text": "Lewis Hamilton has robustly defended his environmental concerns, having received strident criticism for recent posts on Instagram. The world champion made a heartfelt statement after the Japanese Grand Prix in which he expressed his despair that more was not being done to address the climate crisis. He was disparaged by some for his stance, given the environmental footprint of Formula One that travels to 21 races across the globe.\n\nHamilton can win his sixth world championship at the Mexican Grand Prix on Sunday. He is 64 points ahead of his Mercedes teammate, Valtteri Bottas. If he is 78 in front of the Finn after the race the title will be his.\n\nF1’s attempt to host grand prix in Miami hits hump in the road Read more\n\nIn the buildup , however, the focus was firmly on how he reconciled his position in F1 with his strongly held environmental views. He has been vocal about his veganism and the part agriculture plays in environmental change but after Japan he was singularly outspoken.\n\n“Extinction of our race becoming more and more likely as we overuse our resources. The world is a messed up place. World leaders either uneducated or don’t care about the environment at all,” he posted.\n\nHamilton called on everyone to try to make a difference before closing with a somewhat forlorn statement. “Honestly, I feel like giving up on everything. Shut down completely. Why bother when the world is such a mess and people don’t seem to care,” he wrote.\n\nIn Mexico he was revitalised and vigorous in the defence of his words that he said had been inspired by a documentary. “In terms of the changing of the things I’m doing in my life, I’m trying to make sure that by the end of the year I’m carbon neutral,” he said. “I don’t allow anyone in my office, but also within my household, to buy any plastics. I want everything recyclable, down to deodorant, down to toothbrush, all these kind of things. I’m trying to make as much change as I can in my personal space. I sold my plane over a year ago. I fly a lot less now. I’m trying to fly less through the year.\n\nMercedes flex muscles in Japan to leave rivals in the rear-view mirror Read more\n\n“It’s not a quick fix, it’s not something you do over a short period of time. I feel positive I’m making those changes and I’m encouraging people around me also.”\n\nHamilton said he would not be deterred by the negative response his opinions had generated. “I think it’s important to be able to be open and not hold things in. I’m always very open and transparent with my feelings, whether people like it or not.”\n\nHe was positive that F1, which has embraced hybrid technology as a fundamental part of the engine formula, could also do more to make a difference.\n\n“I still love racing and I want to continue. If you look at our sport, it’s shifted, using a third less fuel now. There is more I think F1 can do and they are putting plans together but you have to push all the industries, you have to push F1 to do more.”", "description": "The Mercedes driver, who can win his sixth F1 title at the Mexican Grand Prix, said he aims to be carbon neutral by the end of the year", "authors": ["Giles Richards"], "top_image": "https://i.guim.co.uk/img/media/42d2444a8789874301fc253a0a647e87b00742ce/0_0_4176_2507/master/4176.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6e071ebe20691701ccffa797a20e5a21", "published_at": "2019-10-24"}