{"pub": "cbs", "title": "Billionaire Jack Ma, booster of 12-hour days, now says AI will allow 12-hour weeks", "url": "https://cbsnews.com/news/billionaire-jack-ma-booster-of-12-hour-days-now-says-ai-will-allow-12-hour-weeks", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:20:03.884579+00:00", "text": "Jack Ma, the billionaire founder of Chinese ecommerce giant Alibaba, has vigorously endorsed China's grueling \"996\" culture, or working from 9 a.m. to 9 p.m. six days a week. But now he has an even bolder vision for the future of work thanks to artificial intelligence: the 12-hour workweek.\n\nIn the future, people may end up working only three days a week, with only four hours of work per day, Ma said at the World Artificial Intelligence Conference in Shanghai on Thursday, according to Bloomberg News. In Ma's view, the development of AI could free humanity to partake in activities other than work, with the entrepreneur comparing AI with the advent of electricity.\n\n\"The power of electricity is that we make people more time so that you can go to karaoke or dancing party in the evening. I think because of artificial intelligence, people will have more time enjoying being human beings,\" he said, Bloomberg reported.\n\nBut, Ma added, the emergence of AI must be paired with an overhaul of the education system to prepare new generations for a drastically changed labor market. Education reform can ensure \"our kids can find a job, a job that only requires three days a week, four hours a day. \"If we don't change the education system we are in, we will all be in trouble,\" he said.\n\nThe trouble is here\n\nMa's remark about needing to revamp education to adapt to technological shifts underscores an issue that's already affecting the labor market: job losses for workers who have been replaced by tech. One group that has felt the biggest impact is women without a college degree.\n\nAutomation could force millions of women out of their jobs\n\nDecades ago, these workers flocked to offices to work as administrative assistants and other clerical workers. While it's not an issue that's received as much attention as the struggles in manufacturing, the fallout in clerical jobs is ongoing, with the Bureau of Labor Statistics projecting a 5% decline in these workers through 2026.\n\nThat equates to a loss of almost 200,000 jobs, which are mostly filled by women who rely on this type of employment to achieve a middle-class lifestyle. Such workers aren't enjoying shortened workweeks as they are replaced by software. Instead, they're shifting to lower-paying professions, like restaurant servers and home-health aides, that often entail longer work hours.\n\n40% of jobs are at risk\n\nSo rather than free up more time for karaoke, AI and other forms of automation threaten to displace tens of millions of workers, economists and policy makers warn.\n\n\"Nearly 40 percent of current U.S. jobs are in occupational categories that could shrink between now and 2030,\" McKinsey researchers wrote in a recent report on the U.S. economy. \"No community will be immune from automation-related displacement.\"\n\nWorkers of all ages will need to retool their skills or else risk getting sidelined, in other words. And the shifting labor dynamics may explain the surge in interest for universal income. Without steady jobs, the least skilled and poorest workers may face a dismal future, even with a 12-hour workweek.", "description": "Alibaba founder predicts AI advancements will mean shorter workweeks for people — that might not be good news", "authors": ["Aimee Picchi"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2018/03/06/6b60cdbe-20d8-4a16-b09c-88e11965121e/thumbnail/1200x630/46129ac5436d485512aaba4bb7855a87/gettyimages-909611882.jpg"}