{"pub": "telegraph", "url": "https://telegraph.co.uk/films/0/zombieland-double-tap-review-gratuitous-time-killer-leastwoody", "downloaded_at": "2019-10-16 13:39:23.487007+00:00", "title": "Zombieland: Double Tap review: a gratuitous time-killer, but at least Woody Harrelson is enjoying himself", "language": "en", "text": "Dir: Ruben Fleischer. Cast: Woody Harrelson, Jesse Eisenberg, Emma Stone, Abigail Breslin, Zoey Deutch, Bill Murray, Luke Wilson, Rosario Dawson, Thomas Middleditch, Avan Jogia. 15 cert, 99 mins\n\nFans of Bill Murray’s cameo in Zombieland (2009) – he played himself during an undead apocalypse, alive but covered in mottled make-up to fit in – have a late-arriving treat in Zombieland: Double Tap as the end credits roll. Spoilerphobes beware: it’s a flashback to the moment when things got weird, which appears to have happened during Murray’s press junket for (the fictitious) Garfield 3: Flabby Tabby.\n\nThe standalone sequence – think furball cough requests in different languages – must have taken at least a full day to shoot. It’s custom-built to tickle jaded film journos, given that many of us are well-used to sitting around in office suites for whole afternoons, hoping to strike effortful gold during a seven-minute conversation with a fatigued and/or borderline-suicidal celebrity. It’s broad, it’s easy, and it hits the spot.\n\nThe only downside is wading through this nakedly gratuitous sequel, directed again by Ruben (Venom) Fleischer, to get to it. Ten years on, the reunion of the first film’s poster quartet – Harrelson, Eisenberg, Stone, Breslin – feels motivated by little but boosted star power (it helped propel all the younger actors to fame) and various agents getting a bigger cut.\n\nThe four of them – two sisters who don’t come across as related, a surrogate dad, and Jesse Eisenberg’s survival nerd – are still mooching around America’s ravaged back yard, camping out in all the biggest abandoned homes they can find (the White House, Graceland, etc) and packing enough firepower to obliterate any zombies (“zees”, they annoyingly say) who still cross their path.", "description": "Dir:", "authors": ["Tim Robey", "Film Critic", "Julie Burchill", "Simon Heffer"], "top_image": "https://www.telegraph.co.uk/content/dam/films/2019/10/16/TELEMMGLPICT000212998545-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?imwidth=1200", "published_at": "2019-10-16"}