{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/27/all-blacks-leaders-share-their-pain-after-rugby-world-cup-exit", "downloaded_at": "2019-10-27 12:07:17.303820+00:00", "title": "All Blacks and Steve Hansen share their pain after Rugby World Cup exit", "language": "en", "text": "Steve Hansen called the experience of losing to England gut-wrenching as New Zealand came to terms with their defeat\n\nThe hurt and suffering that will long linger is etched on the faces of the All Blacks as they struggle to suppress the emotional scars of their World Cup semi-final defeat to England. New Zealand, as a rugby nation, has come a long way from the widespread outcry experienced during their 24-year wait between World Cup successes from 1987 to 2011. Expectations, though, have not wavered. In fact, after securing the last two World Cup titles, those on the team have only increased.\n\nGutted but gracious: stunned New Zealanders concede 'better team won' rugby Read more\n\nThe All Blacks are expected to win every match so the brutal, comprehensive nature of their England beating is particularly difficult to take. Carrying such a weight magnifies disappointment, especially on this grand stage. That is partly why the All Blacks head coach Steve Hansen needed a moment to hold back tears as he again fronted up to dissect his side’s 19-7 loss.\n\nNot long after the final whistle Hansen was spotted on his phone, off to the side of the field. Asked who he had called, Hansen began to well up. “I rang my wife,” he said, pausing to sip water in order to prevent his emotions from bubbling over.\n\nAfter speaking to his wife, Hansen talked to the former All Blacks coach Graham Henry - nicknamed ‘Ted’ - and centre Conrad Smith. Both men were also involved with Hansen the last time New Zealand lost a World Cup match 12 years ago.\n\n“I then talked to Ted and Conrad about ’07 and we mentioned the fact it’s no different, the same gutting feeling,” Hansen said. “Then Ted and I talked about how well George Ford had played. Ted had quite a few comments and I did a bit of listening, trying to do a bit of learning, and then you just move on don’t you?\n\n“Is it hard to stomach? Course it is. It’s gut-wrenching because we wanted to win the thing but so did they. Life’s not fair so why would sport be fair. You don’t always get the thing you want. And when you don’t you’ve got to measure your character on how you deal with that.”\n\nThe All Blacks have to channel their pain into a game no one wants play – the playoff for third and fourth in Tokyo on Friday, one day before the final. “It’s unique because it’s knockout and you don’t get a second chance,” Hansen said, “so the pain isn’t alleviated by playing another Test next week.\n\n“Whoever we play won’t alleviate the pain that we haven’t achieved what we wanted to which was come here and win it. You’ve got to bank that and sit back and learn the lessons. We’ll do that when the tournament finishes, about what we could have done better.\n\n“Winning is easy. You don’t get too much poked at you. But when you lose you are gutted but at the same time you have to show humility and do it gracefully and be honest. Sometimes you just have to bite down on your gum shield and suck it up.”\n\nOther than Ford, Hansen praised the England lock Maro Itoje, the man of the match, saying he was a more complete player than when he featured for the British and Irish Lions two years ago and that he could evolve into a great of the game.\n\nPlay Video 0:35 Rugby World Cup: England stun New Zealand 19-7 to reach final – video highlights\n\n“This England team hasn’t just snuck up and poked us in the face. They won 18 games in a row – there’s only one other team over the history of the game that’s done that. That makes them a pretty formidable side.\n\n“They were a team that, coming into this tournament, and the last four years, had a massive amount of pain, having the adversity of not making the quarter-finals of their own tournament. They’ve been working their butts off probably more so than any other England team in history. We got what we expected.”\n\nEngland stride past All Blacks towards rugby’s greatest prize Read more\n\nThe All Blacks captain Kieran Read cut a shattered figure last night and with one more match left in his test career, his inner wounds may never properly heal.\n\n“It’s pretty empty,” Read said of his feelings. “It’s not what we came here for, that’s the reality of it. It’s not going to define us as a group or who we are. There’s no two ways around it that you’re really gutted but I’m sure there’s a lot of people in that same boat with us and going through those emotions. We feel for them as well.\n\n“As the leader you look at ways you could have done things differently but that’s all hindsight. It’s not going to affect your emotions right now. It’s not going to change the fact we lost. I’m proud of the effort and character.”\n\nOn his 34th birthday, Read at least found solace when he arrived back to his hotel after the game. “There were cards from my kids waiting for me,” he said. “That puts things in perspective. It’s a rugby game. People care, we care, so you enjoy moments. For me I’m a dad, and first and foremost that’s the thing I want to be remembered by.”", "description": "Steve Hansen called the experience of losing to England gut-wrenching as New Zealand came to terms with their semi-final defeat", "authors": ["Liam Napier In Tokyo"], "top_image": "https://i.guim.co.uk/img/media/bf5c30bd56e4d834013c189fb8c7806b185500ee/0_120_4256_2555/master/4256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b585423b7297abe510a38ecec99fa334", "published_at": "2019-10-27"}