{"pub": "reuters", "url": "https://reuters.com/article/us-mediaset-vivendi-lawsuits/vivendi-keeps-mediaset-stake-prepares-to-step-up-legal-fight-sources-idUSKBN1W70LZ", "downloaded_at": "2019-09-23 10:35:11.779044+00:00", "title": "Vivendi keeps Mediaset stake, prepares to step up legal fight: sources", "language": "en", "text": "MILAN (Reuters) - Vivendi (VIV.PA) has kept its stake in Mediaset (MS.MI) after a deadline to sell it expired at the weekend and is preparing to step up its legal action against the Italian broadcaster’s overhaul plan, two sources close to the matter said.\n\nFILE PHOTO: The Mediaset tower is seen in Cologno Monzese neighbourhood Milan, Italy, April 7, 2016. REUTERS/Stefano Rellandini\n\nMediaset this month won shareholder approval to create a pan-European media group in an effort to pursue continental alliances with rivals and fend off growing competition from streaming services such as Netflix (NFLX.O) or Amazon Prime Video (AMZN.O).\n\nBut Vivendi, which has plans of its own to build a European media powerhouse, opposed the reorganization saying it strengthens the hold on the group of Mediaset’s top shareholder, the family of former Italian Prime Minister Silvio Berlusconi.\n\nVivendi could have scuppered Mediaset’s plans had it decided to sell its 29% holding back to the Italian group by a deadline of midnight on Saturday.\n\nSources familiar with the matter told Reuters on Sunday Vivendi had decided to fight the corporate revamp in court, filing suits in Spain and the Netherlands, a move which signaled it would likely stay on as an investor.\n\nThe two sources on Monday confirmed Vivendi had not exercised its withdrawal right as a shareholder.\n\nMediaset and Vivendi have been locked in a legal battle since falling out over a failed pay-TV deal back in 2016.\n\nAfter the aborted deal, the French conglomerate owned by billionaire Vincent Bollore built up a 29% stake in Mediaset - a holding the Italian group deems illegitimate.\n\nVivendi could have derailed Mediaset’s revamp had it decided to liquidate its holding, which is worth more than the 180 million euros Mediaset was prepared to spend to mop up shares of investors who wanted to cash out.\n\nSelling the stake would have translated into a loss of around 320 million euros for the French group.\n\nTo hedge against this possibility, Mediaset last week struck a deal with private equity firm Peninsula, which agreed a backstop worth up to 1 billion euros, neutralizing Vivendi’s withdrawal risk.\n\nSome sources have said in the past Bollore might prefer to remain an investor in the hope that court rulings in his favor could eventually allow him to increase his sway over Mediaset.\n\nBy 0908 GMT shares in Mediaset were down 1.5% at 2.722 euros each, below the price of 2.77 euros a share at which Vivendi had the right to liquidate its stake.", "description": "Vivendi has kept its stake in Mediaset after a deadline to sell it expired at the weekend and is preparing to step up its legal action against the Italian broadcaster's overhaul plan, two sources close to the matter said.", "authors": ["Elvira Pollina", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190922&t=2&i=1432667270&w=1200&r=LYNXMPEF8L0KL", "published_at": "2019-09-23"}