{"pub": "cbs", "url": "https://cbsnews.com/news/billionaire-ken-fishers-sexist-comments-have-now-cost-him-almost-1-billion", "downloaded_at": "2019-10-19 11:15:38.100572+00:00", "title": "Billionaire Ken Fisher's sexist comments have cost him almost $1 billion", "language": "en", "text": "The city of Boston is pulling $248 million in pension assets from Fisher Investments following billionaire Ken Fisher's sexist remarks at a conference this month.\n\n\"Boston will not invest in companies led by people who treat women like commodities,\" Boston mayor Marty Walsh said in a statement.\n\n\n\nThe decision comes after Michigan and Philadelphia also voted to take their assets from the firm.\n\nKen Fisher's sexist comments have now cost his investment firm about $1 billion in lost assets under management. The city of Boston is the latest to pull its pension assets from Fisher Investments following his Oct. 8 comments that compared signing a new client to \"getting into a girl's pants.\"\n\n\"Boston will not invest in companies led by people who treat women like commodities,\" Boston Mayor Marty Walsh said in a statement emailed to CBS MoneyWatch. \"Reports of Ken Fisher's comments and poor judgement are incredibly disturbing, and I have asked our Retirement Board to take a vote to end any relationship with Fisher Investments.\"\n\nThe Boston pension board on Wednesday voted in favor of withdrawing the $248 million it had invested with Fisher Investments. That follows Michigan's decision to take back $600 million it had invested with Fisher and the city of Philadelphia's withdrawal of $54 million from his firm.\n\nTo be sure, $1 billion in assets is a fraction of Fisher Investment's $112 billion in overall assets under management, but at least two other clients with a combined $1 billion at Fisher Investments are reviewing their ties to the firm following the comments. They include money management giant Fidelity Investments, which has about $500 million at Fisher Investments, and the Los Angeles Fire and Police Pension board, with about $511 million, according to Reuters.\n\nFirms like Fisher's charge investors a fee on the total assets being managed. A management fee of 1%, for instance, would mean his firm could be facing an annual revenue loss of $10 million to $20 million.\n\nFisher made his comments at an exclusive event hosted by Tiburon Strategic Advisors that carried an entry fee of $25,000 per person. Fisher is reportedly worth $3.7 billion, making him the 195th wealthiest person in the U.S., according to Forbes.\n\nRachel Robasciotti, a principal and wealth manager at Robasciotti & Philipson who attended the conference as a speaker and heard Fisher's remarks, told CBS MoneyWatch that his comments highlight the intense sexism women often face in the investment business, which make it hard to gain a foothold in the industry.\n\nWomen represent only 4% of top executives at mutual funds, hedge funds and other investment vehicles and control just 1% to 3.5% of fund assets under management, according to the Harvard Business Review.", "description": "City of Boston is pulling $248 million in pension assets from Fisher Investments, the latest defection for the firm", "authors": ["Aimee Picchi"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/10/1815f1c1-25a9-437f-b5b9-f872c24df7c6/thumbnail/1200x630/681e494e50df58f7ba3e3108a814e4bf/rtr2ct2c.jpg", "published_at": "2019-10-18"}