{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7602085/Payne-Haas-reveals-happened-night-Broncos-played-pokies-hours-finals-thrashing.html", "downloaded_at": "2019-10-23 11:03:31.462297+00:00", "title": "Payne Haas reveals what happened on night Broncos played pokies hours before finals thrashing", "language": "en", "text": "An NRL star has lifted the lid on why he and Brisbane Broncos teammates left their hotel rooms on the eve of the worst defeat in the club's history.\n\nSix of its biggest stars were spotted playing the pokies at a Sydney pub on the night of September 14, just hours before the Broncos were thrashed 58-0 by the Parramatta Eels in a do or die elimination final.\n\nPayne Haas, Matt Gillett, Anthony Milford, Corey Oates, Andrew McCullough and David Fifita are believed to have left the team hotel without the knowledge of coach Anthony Seibold.\n\nSix players were spotted at a pub playing the pokies hours before the Brisbane Broncos were beaten 58-0 in the club's worst ever defeat in its 31-year history (players pictured afterwards)\n\nAs he prepares to make his Test debut for Australia on Friday night, Haas said the group left the team hotel looking for ice cream and briefly stopped at Harpoon Harry's Hotel near Oxford Street, a decision he now regrets.\n\n'We were there for 15 minutes or so … obviously we shouldn't be doing that. But if we won, it would not have been a problem. It's something we would take back if we could,' The Broncos forward told The Daily Telegraph.\n\nHaas said many details about the night reported in the media at the time were incorrect, including claims Fifita was still there playing pokies after midnight.\n\nHe denied any of his teammates had done anything wrong.\n\n'We had massages at 8pm so we all left [the venue] before 8 o'clock. So I'm not sure where 12am came from,' Haas said.\n\nPayne Haas says they left the team hotel looking for ice cream and briefly dropped into the pub\n\nPlayers were hauled into a crisis meeting and end of season reviews when they returned to Brisbane the day after their humiliating defeat against Parramatta.\n\n'No one intends to lose a game that way but it wasn't our day. We spoke about it, we know what we have to do and it's something that has all the boys already keen to start pre-season,' Haas said.\n\nAfter speaking to the players involved, the club confirmed at the time that a small number were playing poker machines at a venue close to the team hotel.\n\nThe players were not seen drinking any alcohol.\n\n'Given the players were about to play their biggest game of the year, they should have been more professional in their actions, a club statement at the moment.\n\nThe group briefly stopped into Harpoon Harry's Hotel (pictured) to play the pokies\n\nOne pub customer reportedly told Fox Sports that he sat next to Anthony Milford as he played pokies.\n\nHe said he asked Milford what time the game was and the star replied: 'I think it's at six, eh?' The game started at 4pm.\n\nMcCullough spoke out about the scandal several days afterwards.\n\n'You've got to be smarter with the decisions of putting yourself in those situations,' he told HIT105 radio station at the time.\n\n'If we had won, we wouldn't be talking about it but since that wasn't the case but there may be an issue there.'\n\nBroncos players were hauled into a crisis meeting in Brisbane after news of the scandal broke", "description": "NRL star Payne Haas has lifted the lid on why he and Brisbane Broncos teammates left their hotel rooms on the eve of the worst defeat in the club's history.", "authors": ["Kylie Stevens For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/21/20054096-0-image-a-4_1571777646787.jpg", "published_at": "2019-10-22"}