{"pub": "marketwatch", "url": "https://marketwatch.com/story/british-pound-falls-05-against-the-dollar-as-johnson-loses-vote-to-fast-track-brexit-plan-2019-10-22", "downloaded_at": "2019-10-23 08:56:45.729710+00:00", "title": "British pound falls 0.7% against the dollar as Johnson loses vote to fast-track Brexit plan", "language": "en", "text": "U.K. Prime Minister Boris Johnson's plan to exit from the European Union appeared less certain on Tuesday, with the British leader losing a vote to fast-track his plan to abandon the European Union by Oct. 31. Johnson lost a program vote to leave the trade bloc 308-322, but won an earlier vote \"in principle\" for his Brexit plan 329-299. Johnson is expected to go to the European Commission soon to seek an extension but didn't immediately call a snap election as had been feared by some. Johnson had also threatened to pull his plan, which threatened the U.K. crashing out of the EU. The votes on Tuesday come a day after Speaker of the House of Commons John Bercow refused to allow a \"straight up-and-down\" vote on Brexit because lawmakers voted to delay approving the the vote on Saturday, and parliamentary rules bar the same measure from being considered a second time during a session of parliament unless something has changed. Sterling fell 0.7% against the U.S. dollar, last changing hands at $1.2865 on Tuesday, according to FactSet data. Meanwhile, the FTSE 100 UKX, +0.39% finished the session before the votes up 0.7%. \"Traders pushed the sterling on the back of the first vote and then traders quickly took the profit off the table as the second vote came in,\" wrote Naeem Aslam, chief market analyst at ThinkMarkets U.K., in a Tuesday research note.", "description": "U.K. Prime Minister Boris Johnson's plan to exit from the European Union appeared less certain on Tuesday, with the British leader losing a vote to...", "authors": ["Mark Decambre"], "top_image": "https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png", "published_at": "2019-10-22"}