{"pub": "reuters", "url": "https://af.reuters.com/article/worldNews/idAFKBN1X409C", "downloaded_at": "2019-10-25 03:30:10.139543+00:00", "title": "Hong Kong set for more subdued weekend of protests", "language": "en", "text": "HONG KONG (Reuters) - Hong Kong is gearing up for what is expected to be a relatively quiet weekend of protests, although there is no sign that anti-government activists are backing down on their calls for greater democracy and other demands.\n\nAnti-government demonstrators protest in front of the UK consulate in Hong Kong, China, October 23, 2019. REUTERS/Umit Bektas?\n\nHundreds of Hong Kong protesters, some waving Catalan flags and banners urging “a fight for freedom together”, rallied in support of a separate Catalonia on Thursday, broaching an issue that is anathema to the city’s rulers in Beijing.\n\nHong Kong is now in its fifth month of protests, which have plunged it into its biggest political crisis in decades and taken a heavy toll on the economy.\n\nA rally dubbed “Medical Workers Resisting Tyranny” is planned at Chater Garden in the heart of the financial centre on Saturday evening, with another protest, “Fight Against Police Brutality, Stand with Muslims, Citizens and Journalists”, due to take place on Sunday across the harbour in Kowloon district.\n\nA police water cannon truck shot bursts of blue-dyed water at a small clutch of people on the footpath outside a mosque during protests in Kowloon on Sunday, hitting its gate and steps, drawing criticism from some in the Muslim community.\n\nPolice, already facing criticism for heavy-handed tactics, issued a statement saying the incident was “most unfortunate” and unintended, while senior officers went to meet Muslim leaders late at night to offer apologies.\n\nHong Kong was returned from British to Chinese rule in 1997 under a “one country, two systems” formula that allowed it to retain extensive freedoms not enjoyed in mainland China, including an independent judiciary and the right to protest.\n\nHowever, many Hong Kong residents are angry at what they see as a relentless march towards mainland control.\n\nU.S. Vice President Mike Pence accused China on Thursday of curtailing “rights and liberties” in Hong Kong and blasted U.S. company Nike and the National Basketball Association for falling in line with Beijing in a disagreement over free speech.\n\nThe Chinese central government has condemned the protests and accused foreign powers of fuelling unrest. The Foreign Ministry has repeatedly warned other nations against interfering in Hong Kong, reiterating that it was an “internal affair”.", "description": "Hong Kong is gearing up for what is expected to be a relatively quiet weekend of protests, although there is no sign that anti-government activists are backing down on their calls for greater democracy and other demands.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191025&t=2&i=1444715213&w=1200&r=LYNXMPEF9O05K", "published_at": "2019-10-25"}