{"pub": "guardian", "url": "https://theguardian.com/artanddesign/2019/sep/21/beyonce-vogue-indie-magazines-new-generation-black-fashion-photographers", "downloaded_at": "2019-09-23 17:27:52.329864+00:00", "title": "From Beyoncé covers to indie shoots: the new generation of black fashion photographers", "language": "en", "text": "Tyler Mitchell was only 23 when he was invited to photograph Beyoncé for American Vogue’s September 2018 issue. In one of the two covers, she smoulders at the camera, wearing barely-there makeup and balancing a halo of colourful flowers on her head. In the other, she stands outside in an Alexander McQueen tiered dress with pan-African coloured lace, lifting white material above her natural braided hair. There is a raw beauty to both, casting the almost superhuman pop star in an unusually intimate light. But that wasn’t the only noteworthy thing about the pictures: Mitchell had made history, as the first African American photographer to shoot a Vogue cover.\n\nA few months later, Nadine Ijewere became the first black woman to reach a similar milestone, when she shot the singer Dua Lipa in a Gucci gown for the January 2019 issue of Edward Enninful’s British Vogue. Both covers were widely celebrated as landmark moments, but Mitchell is quick to level an awkward question at the media gatekeepers: “Why did it happen so late? If it were up to me, it would have happened earlier,” he tells me on the phone from New York.\n\nFacebook Twitter Pinterest Model Seashell Coker photographed by Nadine Ijewere for Italian Vogue, 2017. Photograph: Nadine Ijewere\n\nMitchell and Ijewere are two of 15 photographers included in The New Black Vanguard, a book curated by US art critic Antwaun Sargent that maps out a new generation of photographers who are challenging stereotypes. For hundreds of years, images of the black body as hypersexual, aggressive, brutalised and bestial have slipped into the bloodstream of society; as Sargent points out, it matters who gets to be an image-maker, who has agency over how their community is presented and perceived.\n\nMany of these photographers didn’t wait for the old-guard titles to bestow approval, forging partnerships with brands\n\nThese photographers are spearheading a new aesthetic in fashion and art, and are currently some of the most sought-after names in the business. The work of Campbell Addy, who runs the London-based Niijournal magazine, and has his own casting agency, featured in the recent London Get Up, Stand Up Now exhibition; while Dana Scruggs’s plus-size fashion campaign for Eloquii has made waves on the New York subway. Sargent has included other names picked from across the globe – from Sheffield-based Ruth Ossai to Stephen Tayo, quickly gaining recognition for his portrayal of Lagos life, and Bronx-born Renell Medrano.\n\nFacebook Twitter Pinterest Adeline In Barrettes, 2018, by Micaiah Carter. Photograph: Micaiah Carter\n\nIt is easy to point to magazine covers as markers of changing times, but many of these photographers didn’t wait for the old-guard titles to bestow approval, forging partnerships with brands such as Nike, Apple and Tiffany & Co. Mitchell says that “almost all” his connections in the industry came about through social media; platforms such as Instagram have helped democratise the creative industries.\n\nWhen Ethiopian-American photographer Awol Erizku shot Beyoncé displaying her pregnant belly in front of a wall of flowers in 2017, the set of Botticelli-like images were released solely on her Instagram account, circumventing traditional media altogether. The maternity annoucement became the most liked image on the site that year. “I am trying to create a new vernacular,” Erizku explains in the book, “black art as universal.”\n\nFacebook Twitter Pinterest Tyler Mitchell’s Untitled (Twins II), New York, 2017, first published in Dazed. Photograph: Tyler Mitchell\n\nMitchell originally picked up a camera to make skateboarding films, before moving into music videos. By the autumn of 2017, armed with a degree in film and television from New York University’s Tisch School of the Arts, he had decided photography was his calling and bought a one-way ticket from Atlanta to London, where he tried “almost too hard to meet with every magazine and agency under the sun”.\n\nGrowing up, you’re taught you’re gonna have to work three times as hard. I love creating a world free of that pressure\n\nAll Mitchell’s work is in some way personal, starting with early photo essays such as I’m Doing Pretty Hood in My Pink Polo, a series of images taken in Flatbush, Brooklyn, where he portrayed black men as vulnerable and free. Mitchell cites predecessors such as Kerry James Marshall, who “reimagined the projects in Chicago as a place that is lush, vibrant. Even Frederick Douglass [a key 19th-century activist, social reformer and abolitionist] knew the importance, for a black man, of creating and imagining his own image.”\n\nThe coloured backdrops and dreamy lighting of Mitchell’s shoots create a fantastical world for black people to inhabit. “When you’re [black] growing up, you’re taught you’re gonna have to work three times as hard to get the same results as your white counterparts,” he says. “You know, there’s so many different ways that this is beaten into our psyche. There’s a thing said at American colleges: ‘Look left and look right, one of you is gonna end up in jail.’ I love creating a world free of that pressure.”\n\nFacebook Twitter Pinterest Untitled (New Royals II), Miami, 2018, by Tyler Mitchell. Photograph: Tyler Mitchell\n\nThe primary aim is not to cater to the white gaze but to subvert it. “We’re paving the way, so that others don’t have to be boxed into the categories we were before,” says Brooklyn-based photographer Micaiah Carter. Early on in his career, he says, the jobs given to black men tended to centre on urban life, but that didn’t always interest him. This changed when he got his start in local papers, taking people’s portraits and hearing their stories. He has since worked for the magazines Wonderland and the Fader, and corporate clients such as Nike, but says his style is influenced more by family albums than the fashion or art worlds. “My dad shot a lot in the army when he lived abroad, in Germany, Spain and Vietnam,” he says. “I also look at my grandparents’ photography from the 1940s. Everything was taken with a specific intent and I try to present that in my own work.”\n\nI suppose [my work] does something to dismantle this hyper-hyper masculine idea of what a man should be in art\n\nBut it was focusing on his own community that ultimately helped him to find his place. “My skin colour is going to define me, whatever I am doing, but at the same time I want to show my own viewpoint and my world.” An image of the singer Adeline’s plaited hair, adorned with dozens of clips and accessories, is instantly recognisable to any child of the black diaspora who has sat between their mother’s legs for hours as she creates similarly intricate decorations.\n\nFacebook Twitter Pinterest Awol Erizku’s Untitled Heads, 2013, a portrait of childhood friends published in Vice magazine. Photograph: Awol Erizku\n\nSouth African photographer, Jamal Nxedlana also kicks against stereotypical ideas of black identity. His portraits of Johannesburg’s cool kids pop with colour, and native and natural hairstyles; his gender fluid models contort their bodies in surprising ways. “There’s a lot of frustration playing out right now in South Africa,” he says. “It is an extremely violent society. I think that’s a result of our past, which stems from toxic masculinity. So I suppose [my work] does something to dismantle this hyper-hyper masculine idea of what a man should be in art.” In one image that Nxedlana shot and styled, a man stands in a tailored yellow jacket, representing convention and formality. “I then used other symbols – a brooch, lace gloves – within fashion to disrupt and challenge notions of black masculinity,” he says.\n\nAfter a brief stint in London, where he interned at Dazed magazine, Nxedlana returned to South Africa in 2011; he was earning too little to qualify for a working visa. But he had picked up an interest in subcultures; he knew about Teddy Boys, mods and rockers, and couldn’t think of anyone who was documenting South African cliques such as Izikhothane, or the “Zulu guys” from KwaZulu-Natal province, who listen to a specific type of music and wear the same cut of trousers. In 2015, he launched his youth culture platform Bubblegum Club. “It made unconventional voices – and ourselves – visible,” he says.\n\nFacebook Twitter Pinterest Johannesburg, 2017, by Jamal Nxedlana. Photograph: Jamal Nxedlana\n\nSimilarly, Nadine Ijewere describes her work as a celebration of beauty informed by her mixed Jamaican-Nigerian heritage. “Looking at fashion, I never felt I could relate. At university I started taking photos of friends who had mixed backgrounds. When I shoot people of colour, I want to highlight their beauty and not have them stereotypically presented as angry, wild, exotic or ‘the other’.” This same theme runs through Awol Erizku’s series, Untitled Heads (2013), in which he showcases the hairstyles of his male childhood friends from the Bronx. As Sargent writes of the men: “Their lives matter in his frames.”\n\nThankfully, the gates that were once closed to these photographers are finally being forced open. “Never would I have thought that I would be shooting for Vogue, let alone a cover,” Ijewere says. “I can’t quite believe it happened.”\n\n• All images appear in The New Black Vanguard: Photography Between Art And Fashion, by Antwaun Sargent, published by Aperture on 31 October, £40. To order a copy for £35.20, go to guardianbookshop.com or call 0330 333 6846\n\nIf you would like a comment on this piece to be considered for inclusion on Weekend magazine’s letters page in print, please email weekend@theguardian.com, including your name and address (not for publication).", "description": "Why Tyler Mitchell, Nadine Ijewere and others are shaking up the industry", "authors": ["Kemi Alemoru"], "top_image": "https://i.guim.co.uk/img/media/03d508ee3f5e39964168bbd1f355528f20ed1f14/70_185_2299_1379/master/2299.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=73ad21f996e337bb91beb456d72401ab", "published_at": "2019-09-21"}