{"pub": "breitbart", "url": "https://breitbart.com/local/2019/10/12/researchers-say-cancer-vaccine-shows-promise-in-early-clinical-trials", "downloaded_at": "2019-10-13 00:25:03.662948+00:00", "title": "Researchers Say Cancer Vaccine Shows Promise in Early Clinical Trials", "language": "en", "text": "A new cancer vaccine has given researchers hope after it removed cancer cells in a patient with breast cancer.\n\nDr. Saranya Chumsri, an oncologist at the Mayo Clinic, said the vaccine is “supposed to stimulate a patient’s own immune response so that the immune cells like t-cells would go in and attack the cancer.”\n\nIn March, Florida resident Lee Mercker was diagnosed with the early stages of “DCIS stage zero” breast cancer, which meant the disease had not spread.\n\n“I’m an exercise fanatic, I eat right. But it just can knock on anybody’s door,” said Mercker, who was the first person to participate in the clinical trial.\n\nShe said doctors performed a series of checks before administering the vaccine during the 12-week trial at the clinic in Jacksonville.\n\n“They always took your blood, you had a physical, they’d make your shot right there on the spot for you,” she said. “It was three shots, all in a row, alternating arms, four shots, two weeks apart.”\n\nChumsri stated the vaccine is designed to mirror other routine shots. “It’s supposed to be just off the shelf, kind of similar to when you get the flu shot or pneumonia shot,” the oncologist noted.\n\nHowever, as a part of the trial, Mercker was required to have a mastectomy.\n\n“That is the only way we know that everything was removed properly,” Chumsri said.\n\nIn April, researchers began working on another cancer vaccine that is said to harness the power of the immune system to destroy cancer cells by injecting the medicine directly into the tumor.\n\n“We’re injecting two immune stimulants right into one single tumor,” said Dr. Joshua Brody, director of the Lymphoma Immunotherapy Program at the Icahn School of Medicine at Mount Sinai in New York City. “We inject one tumor and we see all of the other tumors just melt away.”\n\nReports said that eight out of eleven lymphoma patients who participated in a clinical trial of the vaccine experienced partial or complete destruction of the tumor.\n\n“We’re trying to teach the immune system to get rid of the thing even after you’ve already got the problem,” Brody said.", "description": "A new cancer vaccine has given researchers hope after it removed cancer cells in a patient with breast cancer.", "authors": ["Amy Furr"], "top_image": "https://media.breitbart.com/media/2019/10/vaccine-640x335.jpg", "published_at": "2019-10-12"}