{"pub": "yahoo", "title": "Roku Stock Can Double in the Next 5 Years", "url": "https://finance.yahoo.com/news/roku-stock-double-next-5-141136509.html", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:14:45.776919+00:00", "text": "With its stock up more than 150% over the last 12 months, Roku (ROKU) investors are having a pretty good year -- but the next 5-6 years could be even better.\n\nAt least, that's the opinion at investment bank William Blair, where 5-star analyst Ralph Schackart issued a report comparing Roku's growth prospects in the future to Netflix's (NFLX) growth performance in the past.\n\nRoku today is a $17.1 billion company, generating about $1.1 billion in annual revenue, from its 30.5 million active monthly users. Six years from now, however, Schackart expects each of these numbers to be a lot bigger.\n\nBy 2025, the analyst predicts, Roku's market capitalization could nearly triple to anywhere from $40 billion to $50 billion, based on an estimated 82 million active accounts generating $4.5 billion in platform revenue annually. Average revenue per user (ARPU) will also shoot up alongside actual user growth, to as high as $58. And whereas today, essentially all of Roku's revenue comes from within the United States alone, six years from now, international expansion will be well underway and the analyst predicts that 11% of revenues will come from abroad.\n\nAs a result, the analyst reiterates an 'outperform' rating on ROKU stock, while saying \"we see 100%-plus stock upside potential through 2024 (five-year outlook).\" (To watch Schackart's track record, click here)\n\nWhat makes Schackart so confident in Roku's success?\n\nAnalogizing Roku's growth in three stages of international expansion, to Netflix's growth through similar stages, Schackart argues that Roku is currently transitioning from \"Phase I,\" in which service is offered primarily in the U.S., but also \"a handful of countries in North and South America,\" France, and the UK, to Phase II (in which Roku will attempt to conquer Europe). Already in Phase I, Schackart argues that \"Roku's active account growth is tracking ahead of Netflix,\" averaging 9% sequential growth from quarter to quarter, versus Netflix's 8% sequential growth at a time of similar transition from Phase I to Phase II. Phase III, if you're curious, is the end game, when the company moves on to expand its service throughout the rest of the world.\n\nOn the one hand, this is good news for Roku investors. On the other hand, it may be even better news than they suspect, because as Schackart points out, throughout Netflix's growth story, Wall Street consistently underestimated the company's ability to grow. For example, during the period running from 2015 to 2018, Street estimates on average predicted that Netflix would add 50 million net subscribers to its rolls. In fact, Netflix added 90 million net subscribers during that period.\n\nAnd Roku is growing even faster than that -- meaning there's a possibility that Wall Street may be underestimating Roku's growth by even more than it underestimated Netflix's growth. So what are the chances that Roku's value will triple over the next six years, as Schackart predicts?\n\nWell, consider: Over the period from the beginning of 2015 to the end of 2018, Netflix stock shot up more than six times in value, from $48 to $298. And that only took four years to happen. Given that Roku is growing much like Netflix, and actually faster than Netflix, if you give Roku stock six years to \"work,\" where Netflix had only four, the chances of Roku's stock price growing \"only\" three times in value (instead of the 6x Netflix grew) look pretty good.\n\nAll in all, when looking at Wall Street’s stance, Schackart is not the only bull, as TipRanks analytics showcase ROKU as a Moderate Buy. Out of 12 analysts polled in the last 3 months, 7 saying Buy, 4 suggesting Hold, while only one recommending Sell. (See ROKU's price targets and analyst ratings on TipRanks)", "description": "With its stock up more than 150% over the last 12 months, Roku (ROKU) investors are having a pretty good year -- but the next 5-6 years could be even better.At least, that's the opinion at investment bank William Blair, where 5-star analyst Ralph Schackart issued a report comparing Roku's growth", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/NFxOhAN9PJJ.iOK8glhjJw--~B/aD00ODA7dz0xNTExO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/tipranks_452/38053924a18f919c15abd58094865963"}