{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-politics-50194685", "downloaded_at": "2019-10-27 00:00:46.893635+00:00", "title": "Brexit election: Lib Dems and SNP plan to force earlier poll", "language": "en", "text": "Image copyright Getty Images/PA Media Image caption Lib Dem leader Jo Swinson and SNP Westminster leader Ian Blackford say the election will \"unlock\" the Brexit impasse\n\nThe Liberal Democrats and the Scottish National Party have joined forces in a bid to trigger a 9 December election.\n\nAnd they have written to EU Council President Donald Tusk asking him to grant the requested three-month extension of a Brexit date.\n\nThe parties say they reject Boris Johnson's election offer, which they believe would include time for him to \"ram through\" his Brexit Bill.\n\nBut they support an election on their timetable to \"unlock\" Parliament.\n\nMr Johnson proposed a slightly later date of 12 December for an election, when he made his offer on Thursday.\n\nThe prime minister said if MPs support his vote in the Commons to call an election, he will use the remaining time before Parliament is dissolved on 6 November to try to pass the legislation for his Brexit deal.\n\nLabour has rejected his election call unless a no-deal Brexit is taken off the table, while the DUP - key allies of the Conservatives until Mr Johnson announced his Brexit deal - has reserved judgment until Monday.\n\nSNP Westminster leader Ian Blackford said he and Lib Dem leader Jo Swinson have written to Mr Tusk seeking an extension until at least 31 January to \"remove the risk of a devastating no-deal Brexit\".\n\nOnce that has been secured, he said the two parties would work to bring forward an election \"on parliament's terms not on the prime minister's\".\n\n\"Opposition parties will not be bullied by a prime minister who has shown utter contempt for Parliament, and who has attempted to railroad through his damaging deal without a shred of scrutiny or due process,\" Mr Blackford said.\n\nGridlock in Parliament\n\nLiberal Democrat leader Jo Swinson said her party could not support Mr Johnson forcing through \"a bad deal\".\n\nShe said: \"Boris Johnson has missed his 'do-or-die' deadline (of 31 October) and is now asking Parliament to give him a general election and time for him to ram through his Brexit Bill through Parliament.\"\n\nThe Liberal Democrats and the Scottish National Party intend to introduce a short amendment to the Fixed Term Parliaments Act, which would specify the polling day for the next election as 9 December.\n\nIt is understood the date was chosen as one of the earliest opportunities for an election, given the time needed to pass the amendment and the required five weeks' notice before polling day.\n\nMs Swinson said: \"We need to get Boris Johnson out of office, unlock the gridlock in Parliament and give people the chance to vote to stay in the EU. \"\n\nMr Johnson's plan for an election would require the agreement of two-thirds of MPs, under the Fixed Term Parliaments Act rules for calling an early general election.\n\nThe Lib Dem and SNP amendment to the act would only need a simple majority, if they can get the Parliamentary time for it to be debated.\n\n'Move forward'\n\nThe prime minister has said his preference would be for a short extension until mid- or late-November, but opponents fear this would be used to revive the threat of no-deal to force through his Brexit bill.\n\nIn their letter to Mr Tusk, Mr Blackford and Ms Swinson urged the EU to grant a longer three-month extension to \"give Parliament the assurance that a 'no deal' exit could not take place before that point\".\n\nThey said they would \"work together to facilitate an election giving the people the chance to decide what the UK's next steps should be\".\n\n\"We believe this is the only way to unlock what has become a deadlocked Parliament and to enable the UK and the EU to move forward - whatever form that takes,\" they said.", "description": "Lib Dem leader Jo Swinson says Boris Johnson's election offer masks a bid to \"ram through\" his deal.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/7B99/production/_109414613_swinsonnblackford.jpg", "published_at": "2019-10-26"}