{"pub": "news24", "url": "https://wheels24.co.za/News/Guides_and_Lists/see-spoilers-cut-springs-undercar-lighting-5-mods-you-shouldnt-do-to-your-car-20191014-2", "downloaded_at": "2019-10-14 23:28:32.421639+00:00", "title": "SEE | Spoilers, cut springs, under-car lighting - 5 mods you should never do to your car", "language": "en", "text": "\n\n\n\nAftermarket modification is a big part of South Africa's car scene with owners always trying out new things to see what fits and what doesn't.\n\nWe look at some of the worst alterations people have done to their cars in past trends, some of which has stuck around even years after it's no longer 'cool'.\n\n\n\n1. Sky-high, massive spoilers\n\nIt comes in a range of sizes but the one in question here stands out above the rest - quite literally. Where people get it very wrong is buying these spoilers and then fitting them to an old Honda Ballade or Nissan Sentra, or anything that really does not need one of these.\n\nREAD | Buying parts, accessories, and modified cars: Guidelines for the 'Mod Squad'\n\nThey attract unwanted attention and also provides something to chuckle about in traffic. Maybe the owner is still fond of the Fast and the Furious movies or just wants to get in touch with his/her inner petrol head. The answer is a resounding no.\n\n\n\nIt also affects the aerodynamics of your vehicle, potentially making your car slower, and causing it to use more fuel. You'll also have to drill unnecessary holes into the body of your car for nuts and bolts, and trying to get your car back to standard specification might just be a problem when you're in the market to sell.\n\n\n\n\n\n\n\nWhat has been the most ridiculous car modification you have seen, or even done to your own car. Email us your pictures and tell us your story.\n\n2. Brake calipers\n\nThis type of 'mod' adds no value to any car, whatsoever. Not knowing how to spray your calipers correctly or using a non-heat-resistant spray is a recipe for disaster. After a while the paint will start peeling and it will look half-baked.\n\nImage: Autostyle.co.za\n\nI know someone who bought a set of plastic brake caliper covers to go over the original ones on his car - to give it a more 'racier' look. It fell off after a few minutes of driving and got lodged between the disc and rim.\n\n\n\nBut here's the other thing - brakes can get ridiculously hot especially when driven hard, and when you have to brake hard too. Surely plastic calipers would melt and only cause more damage to your brakes?\n\n3. All about the camber\n\nWheel offset or a negative camber is the angle at which the tyres stand relative to the road, or the offset of a wheel is what locates the tyre and wheel/rim assembly in relation to the suspension. However, some people have taken it to the extreme.\n\nAt first glance, the car looks as if its about to fall apart at any second with the entire wheel almost protruding out from under the arch. This negatively affects tyre wear and does not make it any faster either. You're also causing loads of strain on your suspension system, and before you know it your steering rack might need to be replaced too, and let's not forget the damage you might cause to your shocks, mountings and CV joints.\n\n4. 'Stickerbomb'\n\nYes, stickerbombing was a thing, and for a while, it presented itself as a lucrative business for those in the sicker printing industry. This craze involved cars being covered in random anime decals on top of one another; everything from the petrol cover to the bonnet was covered in a vast array of colour.\n\nAfter a while it became something of a sealant where you could buy it in bulk rolls and use it to cover rust spots or dings. Eventually it would fade and look like a white sheet of paper, and worse, peel away your car's paint when removed incorrectly.\n\n5. Riding on 'snybachs'\n\nLowering your car is deemed a big modification on the car scene. While you would usually purchase a lowering kit with shorter, and or tighter springs, or even pricey coilovers to lower your vehicle's ride height, some people prefer to literally cut their car's springs. Cutting your car's original springs is done by using a grinder instead of installing a proper coilver kit or air ride suspension.\n\nThe ride is extremely hard, bouncy, and uncomfortable and also causes premature wear on your CV joints and control arm links. It is also unsafe and if you are caught, traffic officials can take your license disc.", "description": "There are a host of aftermarket parts available to kit out your ride but while some of it might be eye-catching, it's not good for anything else. And, it could turn your hot car into a 'lemon' faster than you might realise.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9459/079a03a85efb4d5bbdd4ec71f8f98c07.jpg", "published_at": "2019-10-14"}