{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-england-49688459", "downloaded_at": "2019-09-13 11:11:40.724146+00:00", "title": "Byron burger menu 'reassured' allergy death Owen Carey", "language": "en", "text": "Image copyright PA Media Image caption Owen Carey was celebrating his 18th birthday when he died\n\nBurger chain Byron's menu \"reassured\" a teenager who had a fatal reaction after unwittingly eating buttermilk marinade on a chicken burger, a coroner has said.\n\nSouthwark Coroner's Court heard the menu made no mention of its contents.\n\nOwen Carey, who had a dairy allergy, died on 22 April 2017 - his 18th birthday - at the firm's O2 Arena branch.\n\nThe coroner said \"neither Owen or waiting staff were put on notice\".\n\nThe assistant coroner Briony Ballard said it was clear he had \"not been made aware of the ingredients\" in the meal.\n\nFamily 'vigilant over allergies'\n\nMs Ballard said it was not clear the restaurant chain's training over allergens at that time would have been effective for \"less diligent staff\".\n\nThe inquest heard there was a warning about allergens on the back of the menu, as was the industry norm in 2017, but the warning is now displayed in larger print.\n\nThe coroner said it was clear that the teenager and his family were very vigilant about his allergies.\n\nThe lack of information on the menu she continued meant \"neither Owen or waiting staff were put on notice\" about the presence of buttermilk in the chicken.\n\nImage copyright Getty Images Image caption The inquest heard Mr Carey ate half the chicken before he experienced symptoms\n\nThe inquest has heard Mr Carey ate half of his chicken before he felt his lips tingling and experienced stomach problems.\n\nHe collapsed 55 minutes later outside the London Eye.\n\nMr Carey, from Crowborough, Sussex, died later at St Thomas's Hospital in central London.\n\n'Robust procedures'\n\nMembers of the public, including an RAF doctor, tried to revive him but when paramedics arrived he was \"silent, not breathing and pulseless\", the hearing was told.\n\nMs Ballard is expected to make recommendations to prevent future deaths at a later date.\n\nAfter the hearing, Simon Wilkinson, the CEO of Byron Burger said: \"We take allergies extremely seriously and have robust procedures in place.\n\n\"We train our staff to respond in the right way.\"\n\nHe said the company had heard what the coroner had said about talking to customers and added: \"It's clear current rules and requirements are not enough and the industry needs to do more - more to help customers with allergies and more to raise awareness of the risks of allergies.\"", "description": "A coroner says it was clear a teenager with a dairy allergy did not know he was eating buttermilk.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/0920/production/_108763320_hi056448886.jpg", "published_at": "2019-09-13"}