{"pub": "zdnet", "url": "https://www.zdnet.com/article/microsofts-vibrating-floor-mat-could-stop-you-crashing-into-the-furniture-when-wearing-a-vr-headset", "downloaded_at": "2019-10-07 19:47:44.228435+00:00", "title": "Microsoft's vibrating floor mat could stop you crashing into the furniture when wearing a VR headset", "language": "en", "text": "Cybershoes: A new VR accessory to enhance games Cybershoes GmbH is a new VR accessory that lets users strap a device onto their shoes that allows them to literally run/walk through the VR world.\n\nMicrosoft filed a patent for an unusual innovation: a vibrating virtual reality floor mat.\n\nIf this were to turn into an actual product, it could go a long way in stopping users from bumping into household objects while wearing a headset, something that has made for great Youtube compilations but not so happy gamers.\n\nThe patent, first reported by Variety, acknowledges that VR headsets are made to completely occlude the user's view of his surrounding environment. Microsoft's floor mat would define an activity zone to play in and make sure that it could always pinpoint the user's location through various sensors.\n\nThese would include pressure sensors distributed across the mat as well as \"fiducial markers\", which are objects placed in the field of view of the headset and would appear in the image produced.\n\nWhen getting closer to the boundaries of the mat, players would be notified through visual, auditory or haptic feedback. In other words, your vibrating floor mat would vibrate to let you know you are about to run into the coffee table.\n\nWhat's more, provided you have sufficient living room space - and tolerant flatmates - Microsoft suggests that it would be possible to create a bigger playing space by fitting several mats together.\n\nTo a certain extent, the company's latest invention is only a technological improvement on the old-school method of using thicker mats to define a furniture-free zone of gaming, which is already in vogue among players.\n\nBut the vibrating floor mat patent also says that it could go one step further, and actually augment the VR experience by providing in-game haptic feedback through vibrations. This is something that could be used by developers to make VR even more immersive.\n\nMicrosoft outlines which headsets the mat could work with, and it quickly caught gamers' attention that this includes PC-based and standalone headsets but also VR systems fitted for gaming consoles. And, the illustration for the document shows the floor mat being used with a Kinect controller connected to an Xbox.\n\nThe Kinect was the precursor to Microsoft's HoloLens headset, released in 2010 as an experiment for motion-controlled gaming for Xbox 360 and Xbox One. It didn't gain much traction, though, and was discontinued in 2017.", "description": "No, Microsoft is not reinventing interior design - rather, it is looking at tackling the issue of space awareness, or lack of, when using a VR headset.", "authors": ["Daphne Leprince-Ringuet"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2018/06/10/6909dfb5-3e1b-46c3-8600-6910a2d14d27/thumbnail/770x578/691a9eaee1805b547aec37d306e4eb9a/enterprise-training.jpg", "published_at": "2019-10-07"}