{"pub": "nationalreview", "url": "https://nationalreview.com/corner/youre-supposed-to-completely-blindside-the-enemy-not-the-pentagon", "downloaded_at": "2019-10-07 20:01:49.315044+00:00", "title": "You’re Supposed to ‘Completely Blindside’ the Enemy, Not the Pentagon", "language": "en", "text": "James Mattis (Michaela Rehle/Reuters)\n\nWith the news that President Trump “completely blindsided” the Pentagon (according to Fox News) by suddenly deciding to withdraw U.S. forces from Syria and giving Turkey a green light to move across the border and attack our previous ally the Kurds, it seems like a good time to review one of the closing passages of Call Sign Chaos, the autobiography of James Mattis, our previous Secretary of Defense.\n\nMattis writes about how his time as commander of U.S. Central Command came to an end:\n\nIt was no secret in Washington that the White House was wary of my command at CENTCOM and increasingly distrusted me. While I fully endorse civilian control of the military, I would not surrender my independent judgment. In 2010, I argued strongly against pulling all our troops out of Iraq. In 2011, I urged retaliation against Iran for plotting to blow up a restaurant in our nation’s capital. In 2012, I argued for retaining a small but capable contingent of troops in Afghanistan. Each step along the way, I argued for political clarity and offered options that could give the Commander in Chief a rheostat he could dial up or down to protect our nation. While I had the right to be heard on military matters, my judgment was only advice, to be ignored or accepted. I obeyed without mental reservation our Commander in Chief and carried out every order to the best of my ability. In December 2012, I received an unauthorized phone call telling me that in an hour, the Pentagon would be announcing my relief. I was leaving a region aflame and in disarray. The lack of an integrated regional strategy had left us adrift, and our friends confused. We were offering no leadership or direction. I left my post deeply disturbed that we had shaken our friends’ confidence and created vacuums that our adversaries would exploit. I was disappointed and frustrated that policymakers all too often failed to deliver clear direction. And lacking a defined mission statement, I frequently didn’t know what I was expected to accomplish… We must mean what we say, to both allies and foes: no more false threats or failing to live up to our word.\n\nBoy, it’s a good thing we ended that old Obama era of being soft on our enemies and harsh on our friends and allies, right?", "description": "It seems like a good time to review one of the closing passages of Call Sign Chaos, the autobiography of James Mattis.", "authors": ["Jim Geraghty", "Andrew C. Mccarthy", "David French", "Matthew Continetti", "Brian Stewart", "George Will", "Kyle Smith", "Jack Crowe", "Jonah Goldberg", "Rich Lowry"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2018/12/james-mattis-defense-secretary.jpg?resize=300%2C300&ssl=1", "published_at": "2019-10-07"}