{"pub": "reuters", "url": "https://reuters.com/article/us-usa-trade-china-whoswho/whos-who-in-the-high-level-chinese-trade-delegation-in-washington-idUSKBN1WP2PV", "downloaded_at": "2019-10-11 05:10:50.241105+00:00", "title": "Who's who in the high-level Chinese trade delegation in Washington", "language": "en", "text": "WASHINGTON (Reuters) - Chinese and U.S. officials are negotiating this week in Washington to try to end a debilitating 15-month trade war, with talks set to culminate on Friday when the head of Beijing’s delegation meets U.S. President Donald Trump at the White House.\n\nChina's Vice Premier Liu He gestures as he arrives for U.S.-China trade negotiations in Washington, U.S., October 10, 2019. REUTERS/Yuri Gripas\n\nThe Chinese team includes a deep bench of economists and veteran government officials, many of them Western-educated and with decades of experience in policy-making and managing China’s vast banking, agriculture, and infrastructure-building state owned entities.\n\nThey’re meeting with U.S. Trade Representative Robert Lighthizer, U.S. Treasury Secretary Stephen Mnuchin, and their deputies. The United States is pushing for Beijing to make structural reforms to the way it manages its economy, while China wants an end to tariffs that have been slapped on billions of dollars in Chinese goods imports.\n\nHere are the key members of the Chinese delegation:\n\nVICE PREMIER LIU HE\n\nLiu, a 67-year-old Harvard-trained economist and trusted confidant of Chinese President Xi Jinping, has been leading the Chinese delegation in the trade talks. Liu speaks fluent English, is well-regarded for his deep understanding of China’s economic issues, and is often seen following Xi on regional tours and meetings with foreign leaders.\n\nPEOPLE’S BANK OF CHINA GOVERNOR YI GANG\n\nYi, 61, is a highly respected monetary policymaker with a PhD in economics from the University of Illinois. He headed the State Administration of Foreign Exchange from 2009 to 2016, and was seen as instrumental in helping to steer landmark policy shifts including the 2015 devaluation of the Chinese yuan. Yi is also a fluent English speaker.\n\nVICE FINANCE MINISTER LIAO MIN\n\nLiao, 51, is also deputy director of the general office of the Central Finance and Economic Affairs – a top decision-making body of the ruling Communist Party. Liao, a popular folk singer in the 1980s, has had a long career in China’s banking and finance sector and is seen as a rising star in its government. Liao graduated from Peking University in 1993 and studied at Cambridge University in 2006. Yi and Liao are seen as the point people handing currency and finance issues in the trade talks.\n\nVICE MINISTER OF COMMERCE WANG SHOUWEN\n\nWang, 53, is a respected Chinese trade expert who has had a long career with the trade ministry. Wang, a fluent English speaker with a PhD degree in economics from Peking University, is seen assisting Liu on trade issues.\n\nMINISTER OF COMMERCE ZHONG SHAN\n\nZhong, 64, is Wang’s boss. He served under Xi in the coastal province of Zhejiang when Xi was the Communist Party secretary and governor of the wealthy region in the mid-2000s. Zhong was present at trade talks in Beijing last year, and joined a telephone call with Lighthizer and Mnuchin in July, but he had not attended the previous rounds of talks in Washington. Zhong’s attendance this week signals Beijing regards the current round as especially important.\n\nHAN JUN, VICE MINISTER OF AGRICULTURE AND RURAL AFFAIRS\n\nHan, 55, is China’s senior agricultural representative in the talks, in which Chinese purchases of U.S. farm goods have been a key issue for both sides. Han has previously warned that the United States will struggle to regain China’s agricultural market if it is lost as a result of the trade war.\n\nNING JIZHE, VICE CHAIRMAN OF THE NATIONAL DEVELOPMENT AND REFORM COMMISSION\n\nSlideshow (4 Images)\n\nNing, 62, is a vice chairman of the NDRC, China’s top economic planning agency, as well as the head of the country’s National Bureau of Statistics. The NDRC’s vast remit stretches from approving major infrastructure projects to overseeing the energy regulator. The NDRC also drafts laws on economic restructuring and the economy’s opening to the outside world.\n\nOTHER MEMBERS OF THE DELEGATION\n\nAlso in the delegation are Vice Minister of Industry and Information Technology Wang Zhijun, 54, who has spoken out about the dangers the U.S. tariffs pose to global supply chains, and Vice Minister of Foreign Affairs Zheng Zeguang, 56.", "description": "Chinese and U.S. officials are negotiating this week in Washington to try to end a debilitating 15-month trade war, with talks set to culminate on Friday when the head of Beijing's delegation meets U.S. President Donald Trump at the White House.", "authors": ["Ryan Woo", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191011&t=2&i=1439547598&w=1200&r=LYNXMPEF9A09L", "published_at": "2019-10-11"}