{"pub": "cbc", "url": "https://cbc.ca/books/canada-reads-winner-by-chance-alone-to-be-published-in-the-u-s-1.5307411", "downloaded_at": "2019-10-03 23:30:34.238746+00:00", "published_at": "2019-10-03", "title": "Canada Reads winner By Chance Alone to be published in the U.S. | CBC Books", "language": "en", "text": "By Chance Alone by Max Eisen, the book that won Canada Reads 2019, is being published in the United States for the first time.\n\nThe memoir, about how Eisen was the only member of his immediate family to survive the Holocaust, will be available in January 2020.\n\nBy Chance Alone was successfully defended by Ziya Tong, a science journalist and author of The Reality Bubble.\n\nWhen Eisen was 15 years old, he and his family were taken from their home to Auschwitz, where Eisen worked as a slave labourer. He survived the Holocaust and emigrated to Canada in 1949.\n\nHe has dedicated more than 20 years of his life to educating others about the Holocaust and the horrors he survived during the Second World War. By Chance Alone is his only book.\n\nCanada Reads trailer for By Chance Alone by Max Eisen. 0:44\n\n\"Winning Canada Reads brought his harrowing story of survival in By Chance Alone to a much wider national audience and catapulted the book to the top of the bestseller list,\" Jim Gifford, editorial director at HarperCollins Canada said to CBC Books via email. Gifford edited By Chance Alone.\n\n\"We're all excited for Max and grateful that his important story will find an entirely new audience in these troubled times.\"\n\nBy Chance Alone was also a finalist for the 2017 RBC Taylor Prize and for the 2017 Non-Fiction Vine Award for Canadian Jewish Literature.\n\nMax Eisen talks to Shelagh Rogers about his memoir By Chance Alone. (CANADA READS SELECTION) 16:14\n\nAn audiobook version of By Chance Alone is also now available.\n\nThe audio version, read by actor and playwright Douglas E. Hughes, is only available through Audible.\n\nThe theme for Canada Reads 2019 debates was One Book to Move You.\n\nAs Tong said during the debates, By Chance Alone is a powerful reminder of what happens when society sees and experiences signs of hate, but chooses to look away.\n\n\"To fight the disease, you must be exposed to the disease. When you get a vaccine it hurts. When you read this book it hurts a bit,\" she said on the second day.", "description": "Max Eisen's memoir about surviving the Holocaust and coming to Canada will be available in the States in January 2020.", "authors": [], "top_image": "https://i.cbc.ca/1.5019562.1550167362!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/max-eisen.jpg"}