{"pub": "aljazeera", "url": "https://aljazeera.com/programmes/talktojazeera/2019/06/saudi-scholar-alaoudh-mbs-saudi-arabia-190626131438417.html", "downloaded_at": "2019-10-01 16:09:47.399315+00:00", "title": "Saudi scholar Alaoudh: 'MBS is not Saudi Arabia'", "language": "en", "text": "The son of jailed Muslim leader Salman al-Awdah on Khashoggi's murder and the erosion of rights and liberties under MBS.\n\nIt's been two years since Saudi Crown Prince Mohammed bin Salman (also known as MBS) ascended to power. Many consider him to be the kingdom's de facto ruler.\n\nA lot of people in the West had pinned their hopes on the young reformist prince and what they described as his bold vision for Saudi Arabia. But with the killing of journalist Jamal Khashoggi, the persecution of activists and feminists, and the jailing of human rights defenders, including Saudi Muslim leader Salman al-Awdah, many find his leadership decisions concerning.\n\n\"The promise was to reform the social fabric in Saudi Arabia, was to diversify the Saudi economy and to promote moderate Islam,\" says Abdullah Alaoudh, a scholar, rights advocate and the son of al-Awdah.\n\n\"What has been done is actually the opposite of all these three different aspects,\" he tells Al Jazeera.\n\nLook at the liberals, the feminists, the Shia, the Sunni, the Islamists, the different women, men. The leaders of all these segments of Saudi society all have been either put in jail, silenced, intimidated or threatened in one way or another. Abdullah Alaoudh, Saudi scholar\n\nAlaoudh, a senior fellow at Georgetown University in the US, is sceptical of what he calls MBS's \"superficial reforms\" in Saudi Arabia, including lifting a driving ban on women, because this has happened in the midst of other basic rights and liberties being taken away.\n\nHe says the reforms are akin to a \"PR campaign\" for MBS who \"took advantage of a lot of people in the West not knowing the dynamics of the Saudi society\".\n\n\"[MBS has] attacked the moderate voices of the kingdom; the voices that have been spearheading the campaign against extremism, terrorism in the kingdom,\" Alaoudh says.\n\n\"Look at the liberals, the feminists, the Shia, the Sunni, the Islamists, the different women, men. The leaders of all these segments of Saudi society all have been either put in jail, silenced, intimidated or threatened in one way or another. Even the tribal leaders in Saudi Arabia. Even his own family.\"\n\nAlaoudh calls the murder of Khashoggi \"horrible\" but says it was also a \"wake-up call\" for the Saudi public, the international community and global media.\n\n\"The case of Khashoggi is actually representative of the human rights cases in Saudi Arabia ... The same minds that treated Jamal Khashoggi with brutality, with a gruesome killing, are still torturing women human rights defenders, feminists, the moderate Muslims, and the economists in Saudi Arabia.\"\n\nAlaoudh says he remains concerned for his own safety and the safety of his father, who was arrested after sending out a tweet - an apparent call for reconciliation - at the start of the Saudi blockade on Qatar in 2017. Calling his father a \"religious democrat\" and \"an icon of enlightenment, of moderate Islam\", Alaoudh says these are the types of discourse MBS seeks to clamp down on because he fears it the most.\n\nAsked whether he believes that his father's death penalty would be executed, Alaoudh says: \"Did we ever think that those who were sent to the Saudi Consulate in Istanbul will execute that horrible, gruesome killing of my friend Jamal Khashoggi? If those who killed Jamal Khashoggi were just rogue operatives, the head of that rogue operation, is it still in force? Is it still administering and managing the situation in Saudi Arabia? So I really can't expect anything.\"\n\nAlaoudh says his larger fear is for the future of his country, where extreme voices have been empowered while those seeking to uphold basic rights and liberties are targeted or tortured or killed.\n\n\"My father is the most popular figure in the kingdom and he was treated like that. So just imagine those who are less known or even not known to the public or to the international media, what would they do? How would they treat such people?\"\n\nBut he says there is more to the country than those who control it today.\n\n\"MBS is not Saudi Arabia. MBS is not the history of Saudi Arabia. MBS is not his own royal family and MBS is not the Saudi public,\" he says.\n\n\"So if you [the West] want to really establish a real alliance with Saudi Arabia, if you want to make sure that you have a stable relationship, if you want to have a long term alliance, you have to establish that with the Saudi public who will be there forever.\"\n\nSource: Al Jazeera", "description": "The son of jailed Muslim leader Salman al-Awdah on Khashoggi's murder and the erosion of rights and liberties under MBS.", "authors": ["Abdullah Alaoudh"], "top_image": "https://www.aljazeera.com/mritems/Images/2019/6/26/80e3ac4928394a4cb6d5701f96cd4e3a_18.jpg", "published_at": "2019-06-28"}