{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7564907/Stock-markets-pound-deal-booster-savers-enjoy-record-breaking-day.html", "downloaded_at": "2019-10-12 02:12:18.418429+00:00", "title": "Stock markets and pound get 'deal' booster as savers enjoy record-breaking day", "language": "en", "text": "Savers with money tied up in the stock market yesterday enjoyed a record-breaking day amid hopes that Boris Johnson is closing in on a Brexit deal with the EU.\n\nIn a boost to the pensions and investments of millions of families, one of the major benchmarks on the London Stock Exchange jumped 4.2 per cent.\n\nThe FTSE 250 index, which is more closely linked to the UK economy than the FTSE 100, climbed 805.99 points higher to 20,041.71. It was the biggest points rise of all time and the largest percentage gain since February 2016.\n\nThe previous record points gain was a rise of 645 in September 2008.\n\nSavers with money tied up in the stock market yesterday enjoyed a record-breaking day amid hopes that Boris Johnson is closing in on a Brexit deal with the EU\n\nGains on the more internationally focused FTSE 100 were more modest, at 0.8 per cent, while the pound clocked up its biggest two-day rise since the financial crisis in 2009.\n\nStocks with close links to the British economy, including banks, housebuilders and retailers, were among the biggest risers. It is hoped that a Brexit deal will provide a much-needed boost to the economy by lifting the fog of uncertainty that has hung over Britain since the EU referendum in 2016.\n\nMike Cherry, national chairman of the Federation of Small Businesses, said: ‘After months lost in the Brexit uncertainty that has hit many of our small businesses, there finally appears to be a glimmer of hope at the end of the tunnel.’\n\nSterling also rose, adding to gains made on Thursday after the Prime Minister and his Irish counterpart Leo Varadkar indicated they could ‘see a pathway to a possible deal’.\n\nThe pound jumped another 2.1 per cent against the dollar to a high above $1.27, taking gains over the past two days to more than 4 per cent. Against the euro, sterling has risen 3.5 per cent in two days to close to €1.15.\n\nRuss Mould, investment director at savings and investment firm AJ Bell, said: ‘The huge rally in the share prices of those firms that rely on the British economy for their bread and butter – banks, house builders, retailers – shows how much damage the uncertainty over Brexit has done to large parts of the stock market.\n\n‘If a deal can be struck with Brussels – and then approved by Parliament – the stock market could rally further, with domestic-facing names leading the way.\n\n‘More fundamentally, it will allow businesses to start to plan for the future in terms of jobs and investment, because they will know what they are dealing with, from the point of view of trade and the economy.’\n\nBut Michael Hewson, an analyst at broker CMC Markets, warned that optimism ‘needs to be tempered’ and said the upbeat sentiment could be short-lived. ‘This pathway to a deal could well be a road to nowhere,’ he added.\n\nFiona Cincotta, an analyst at broker City Index, said City traders were ‘growing in confidence that a No Deal Brexit will be avoided in three weeks’ time’.\n\nA note from analysts at JP Morgan, America’s biggest bank, was even more upbeat, declaring Mr Johnson’s talks with the Irish premier had changed ‘everything’.\n\n‘The key question is whether there are substantive proposals behind it which could move the dial toward a deal,’ they told clients. ‘At this stage details are scant... But if our understanding of the situation is correct, a solution to the Irish border problem which could ultimately be acceptable to all parties has been identified.’\n\nNo Deal plan for medicines: Military ferry could be used to ship supplies to Britain as MV Hurst Point is refitted as part of contingency planning\n\nA military vessel could be used to ship emergency medicine supplies to Britain in the event of a No Deal Brexit.\n\nThe roll-on, roll-off ferry MV Hurst Point will be refitted before the October 31 deadline as part of government contingency planning.\n\nIt is one of four strategic vessels on charter to the Ministry of Defence to transport military equipment and can be easily adapted.\n\nThe roll-on, roll-off ferry MV Hurst Point will be refitted before the October 31 deadline as part of government contingency planning\n\nA defence source said: ‘If there is a shortage of medicines and we need to help, we can.’\n\nThe MoD confirmed the plan in response to a parliamentary question. It said the Department for Transport was ‘right to prepare for all eventualities’.\n\nAdmiral Lord West, former head of the Royal Navy, said: ‘If we are having to use roll-on, roll-off ships to bring medical supplies to the UK post-Brexit, things are pretty bad.’\n\nAdmiral Lord West, former head of the Royal Navy, said: ‘If we are having to use roll-on, roll-off ships to bring medical supplies to the UK post-Brexit, things are pretty bad’\n\nBut he added: ‘I see no problem with using naval vessels for national requirements.’\n\nOf the 12,300 medicines licensed for use in the UK, around 7,000 come to Britain either from or through the EU, with the vast majority being shipped across the Channel.\n\nAccording to the Government’s ‘reasonable worst case’ scenario, the flow of goods could be cut by 40 per cent on the first day of a No Deal Brexit. This would take a year to recover to something close to current levels.", "description": "Savers with money tied up in the stock market yesterday enjoyed a record-breaking day amid hopes that Boris Johnson is closing in on a Brexit deal with the EU.", "authors": ["Hugo Duncan Deputy Business Editor For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/01/19613960-0-image-a-20_1570841837388.jpg", "published_at": "2019-10-12"}