{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7537193/Florida-arm-wrestler-reveals-intense-work-needs-stay-game.html", "downloaded_at": "2019-10-09 02:18:12.697156+00:00", "title": "Florida arm wrestler reveals intense work out she needs to stay at the top of her game", "language": "en", "text": "An arm wrestler has revealed part of her explosively intense work-out to show how much dedication goes into the unique sport.\n\nSarah Bäckman, 27, can be seen repeatedly slamming a taut band down onto a table with right arm to simulate the crushing move she makes against her competitors.\n\nShe recorded the tough routine in her barn in Brooksville, Florida, near to Tampa.\n\nIn the footage, Bäckman grips tightly to a metal with one hand while she slams the exercise tool into a sponge pad.\n\nAs she continues to practice, the force of her arm slams cause the table to wobble, as if close to breaking under the powerful moves.\n\nOn top of her professional arm wrestling career, Bäckman juggles working as a realtor and also a gym trainer.\n\nThough the work-outs look tough, they are clearly necessary, as they have helped Sarah on her way to claiming eight World Arm Wrestling Championships.\n\nIn the footage, Bäckman grips tightly to a metal with one hand while she slams the exercise tool into a sponge pad\n\nBäckman says that the intense work-out is exactly what she needs in order to prepare herself for the physically demanding competitions.\n\n'Arm wrestling is an explosive sport so I work on my explosiveness and reactions,' she explained.\n\n'The workout is to improve your hit and speed in arm wrestling and to go for maximum effort in the shortest amount of time.\n\n'It's not painful, but it is tough. I feel great afterwards.'", "description": "Eight-time world champion arm wrestler Sarah Bäckman, 27, recorded the tough routine she goes through to beat fierce competition in her barn in Brooksville, Florida.", "authors": ["William Cole For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/11/19293630-0-image-a-4_1570186217159.jpg", "published_at": "2019-10-04"}