{"pub": "reuters", "url": "https://reuters.com/article/us-china-pollution-tangshan/chinas-top-steelmaking-city-tangshan-implements-anti-pollution-curbs-media-idUSKCN1VO0BJ", "downloaded_at": "2019-09-07 03:55:34.471488+00:00", "title": "China's top steelmaking city Tangshan implements anti-pollution curbs: media", "language": "en", "text": "FILE PHOTO - Smoke rises from a chimney among houses as new high-rise residential buildings are seen under construction on a hazy day in the city centre of Tangshan, Hebei province February 18, 2014. REUTERS/Petar Kujundzic/File Photo\n\nBEIJING (Reuters) - China’s biggest steelmaking city of Tangshan will carry out output restrictions on industrial firms for September and early October, to further strengthen improvement of its air quality, state media reported on Tuesday.\n\nMore than 30 steel mills in Tangshan have been asked to cut operations throughout the month. From Sept. 1 to 27, sintering operations at mills will be cut between 20% and 50% and blast furnaces by 30%, the state-backed China Metallurgical News cited a notice issued by Tangshan government. A sintering plant uses heat to process iron ore ahead of smelting into steel.\n\nDuring the second phase of Sept. 28 to Oct. 4, near to the National Day holiday starting Oct. 1, mills will have to limit both their sintering and blast furnace output by 30% to 50%, China Metallurgical News reported.\n\nThe curbs also apply for companies in the coke, cement, glass and casting industries, according to China Metallurgical News.\n\nBeijing is desperate to minimize smog across northern parts of the country, as China is going to celebrate its 70th anniversary of the establishment on Oct.1.\n\nThe county-level city of Wuan, under the administration of Handan, China’s second-biggest steelmaking city, also recently issued notices for production curbs for steel, coke and cement companies in September, the China Metallurgical News said in the report.", "description": "China's biggest steelmaking city of Tangshan will carry out output restrictions on industrial firms for September and early October, to further strengthen improvement of its air quality, state media reported on Tuesday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190903&t=2&i=1425627676&w=1200&r=LYNXNPEF8209M", "published_at": "2019-09-03"}