{"pub": "yahoo", "url": "https://news.yahoo.com/hong-kong-protesters-pray-gird-114017961.html", "downloaded_at": "2019-10-20 12:38:07.710900+00:00", "title": "Hong Kong activist stabbed as protesters gird for march", "language": "en", "text": "Protesters attend a prayer rally at Edinburgh Place in Hong Kong, Saturday, Oct. 19, 2019. Hong Kong pro-democracy protesters are set for another weekend of civil disobedience as they prepare to hold an unauthorized protest march to press their demands. (AP Photo/Mark Schiefelbein)\n\nHONG KONG (AP) — A man distributing leaflets near a wall with pro-democracy messages was stabbed and wounded, as Hong Kong anti-government protesters prepared to hold an unauthorized march Sunday to press their demands.\n\nPolice said they arrested a 22-year-old man Saturday in connection with the knife attack that wounded a 19-year-old.\n\nOn Wednesday, a leader of the nearly 5-month-old pro-democracy movement, Jimmy Sham, was attacked by assailants wielding hammers and knives as the unrest rocking semi-autonomous Hong Kong turns increasingly violent.\n\nLater Saturday, supporters waving U.S. and British flags held a prayer rally to call for outside help for their cause. The protest march is planned for Sunday, with organizers vowing to hold the event even though it failed to win approval from police, who cited risks to public order.\n\nProtesters are trying to keep the pressure on the government to respond to their demands, including full democracy and an independent inquiry into alleged police brutality. They're also using Sunday's rally to raise a more recent demand for the government to scrap a ban installed this month on face masks at public gatherings.\n\nOrganizers said demonstrators would defy the police because Hong Kong's constitution guarantees the right to protest.\n\n\"We don't think that because police haven't given their approval we shouldn't demonstrate,\" Figo Chan, vice-convener of the Civil Human Rights Front, told reporters. \"Even though they have rejected our appeal, there will surely be many residents taking to the streets.\"\n\nMeanwhile, a bipartisan group of U.S. lawmakers including Republican Sen. Ted Cruz and Democratic Rep. Alexandra Ocasio Cortez wrote to tech company Apple and video game studio Activision Blizzard to condemn what they called protest-related censorship on behalf of China.\n\nThe group urged Apple to reverse its decision to remove from its app store the crowdsourced mapping app HKMaplive that was used to report police locations so that they could be avoided.\n\nThey also wrote separately to Activision to reconsider its decision to suspend a Hong Kong gamer after he voiced support for the protesters during an interview.\n\n\"Cases like these raise real concerns about whether Apple and other large U.S. entities will bow to growing Chinese demands rather than lose access to more than a billion Chinese consumers,\" said the letter sent Friday and co-signed by Sens. Marco Rubio and Ron Wyden and Reps. Mike Gallagher and Tom Malinowski.\n\nThe lawmakers also cited China's pressure on the NBA after Houston Rockets general manager Daryl Morey's tweet in support of the protesters. On Friday night, some basketball fans held signs, wore shirts and chanted support for Hong Kong at a Brooklyn Nets preseason game.\n\nOne sign called out LeBron James and Nets owner Joe Tsai, co-founder of Chinese e-commerce giant Alibaba, who were critical of Morey's tweet. Tsai wrote a Facebook post explaining why the since-deleted tweet upset China.\n\nAlso Saturday, Hong Kong leader Carrie Lam said the murder suspect whose case inadvertently helped ignite the city's protest movement wants to surrender to authorities in Taiwan after he's released from prison later this week for a different offense.\n\nLam said on a radio show that Chan Tong-Kai's decision to surrender has led to a \"relatively relieving\" conclusion to the case.\n\nChan is wanted by Taiwanese authorities for allegedly killing his girlfriend during a trip to the self-ruled island last year but wasn't sent back to face charges because there's no extradition agreement, though he was jailed in Hong Kong on money laundering charges.\n\nLam had tried to resolve the case by proposing extradition amendments, but the bill sparked massive protests over fears they would put Hong Kong residents at risk of being sent into mainland China's Communist Party-controlled judicial system.", "description": "A man distributing leaflets near a wall with pro-democracy messages was stabbed and wounded, as Hong Kong anti-government protesters prepared to hold an unauthorized march Sunday to press their demands.  On Wednesday, a leader of the nearly 5-month-old pro-democracy movement, Jimmy Sham, was attacked", "authors": ["Kelvin Chan"], "top_image": "https://s.yimg.com/uu/api/res/1.2/xiuHHULNWNnF0IaDcZ137A--~B/aD0zMzMzO3c9NTAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/6ea4956320a8c07a04447da41a943b2c", "published_at": "2019-10-20"}