{"pub": "dailybeast", "url": "https://thedailybeast.com/rapper-riff-raff-accused-of-bedding-high-schooler", "downloaded_at": "2019-09-14 11:18:43.057275+00:00", "title": "Rapper Riff Raff Accused of Bedding High Schooler", "language": "en", "text": "Once a celebrated Vine star—“a kind of human meme,” as Rolling Stone once put it—Houston rapper Riff Raff was trending on a different video app this week.\n\nIn jumpy, 60-second videos on TikTok, college student Alyssa Regalbuto doled out stories from the four years she says she dated the recording artist. The five-part “story time” account was certainly unflattering: Regalbuto made it clear to her viewers that she felt duped and used by Riff Raff.\n\nBut the comments that streamed in revealed that many of those watching had zeroed in on a more disturbing aspect of the relationship: Regalbuto was just 17 and still in high school when she says that she first hooked up with the hip-hop star, who was almost twice her age.\n\nIt was not the first time the 37-year-old EDM, trap and hip-hop star had been accused of pursuing girls under the age of 18. At least one other woman has accused Riff Raff of making unwanted advances on her as a teenager, and two others have accused him of rape. But Regalbuto’s videos brought the issue to the surface once again.\n\n“I mainly posted my one video just to get things off my chest… but it blew up overnight,” Regalbuto told The Daily Beast.\n\n“When you hear other girls saying the same story, it’s sad but it’s also relieving, because it’s good to feel that you’re not alone in a situation like this,” she added.\n\nIn a statement, Riff Raff’s lawyer said he “categorically denies these baseless allegations of a sexual relationship with a 17-year-old.” The artist, whose real name is Horst Simco, has previously denied all other allegations of sexual misconduct.\n\nRegalbuto says she barely knew who Riff Raff was the day he approached her at the Warped Tour in 2015. In fact, she says, she was trying to sneak a peek of her favorite band, Sleeping with Sirens, when she noticed the rapper sizing her up. He eventually sent her his number through Twitter, and the two wound up spending the rest of the day on his bus.\n\nHer friend, Alex Accorsi, told The Daily Beast she recalled Regalbuto messaging with the artist that day at the Warped Tour, and remembered dropping her off at his tour bus. She says it was hours later that Regalbuto returned to the group and reported that she and Riff Raff had just hung out.\n\nRegalbuto says she told Riff Raff she was a teenager, though her fake ID listed her as 23.\n\n“It was on my Instagram bio, it was on my Twitter bio—it was very obvious that I was 17,” she said. “I mean, I was literally in high school still!”\n\nAccording to her account, the rapper told her it didn’t matter. He wanted to see her again.\n\nThat’s how the Philadelphia native found herself in New Jersey later that summer, meeting Riff Raff at another Warped Tour appearance. Weeks after that, she says, he offered to fly her out to Las Vegas. Excited and more than a little surprised by the attention, she agreed. She told her parents she was going to the Jersey Shore for the weekend, and hopped on a plane.\n\nAccorsi told The Daily Beast she remembers Regalbuto talking about the New Jersey tour stop and the trip to Las Vegas. Another friend, Rachel Hess, said she got a FaceTime call from Regalbuto and Riff Raff the day she arrived in Nevada.\n\n“I remember at first I was like, ‘That’s so cool.’ But after a while I was like, ‘Well he’s this old and she’s this old… That’s not normal,’” Hess said.\n\n“I got really worried after a while; I would text her all the time like, ‘Let me know if you’re OK,’’’ she added.\n\nIt was at the New Jersey tour stop that Regalbuto says she and Riff Raff first had sex. (The age of consent in New Jersey and Nevada is 16, and Regalbuto is not accusing Riff Raff of criminal misconduct.) She says she didn’t have much sexual experience at the time, but was swayed by his compliments and promises that she was the only woman in his life—statements she now refers to as a “constant manipulation.” Both Accorsi and Hess remember her discussing the sexual encounter when she came back.\n\n“It was really creepy,” Regalbuto said. “It was consensual, but when I look back on it, I wish I didn’t consent to it, because I was more groomed into thinking it was OK.”\n\n“I didn’t know better,” she added. “I wasn’t thinking that way. It’s easy to groom someone at a young age. And then especially when you have that kind of platform on you—it’s foolproof, to do it to a young woman.\"\n\nLast year, a second woman accused Riff Raff of making unwanted sexual advances on her at the same 2015 Warped Tour, less than a month after Regabulto says she met the rapper. That woman, Milwaukee native Kelsey Doucette, was also 17 at the time.\n\nDoucette told Jezebel that Riff Raff approached her at a meet-and-greet and offered her his number. Later, she says, a member of his crew invited her into the tour bus, where Riff Raff took her into a back room and began to kiss her and grope her, despite her protestations.\n\n“I was really freaked out at the time,” Doucette told Jezebel at the time. “When I was 17 I never really heard stories about rape or whatever but I would always hear stories of like, oh my god, this girl got with this DJ or this girl got with this famous artist or whatever and that was so cool. And I thought oh god, this is not cool right now, this is very weird. This is something I don’t want to be in, I don’t know why people talk about these things being so great. I was genuinely scared.”\n\nDoucette’s allegations followed accusations from a woman in Australia, who claimed the rapper had drugged and raped her after a concert in 2013.\n\nEliza Stafford, who was 19 at the time, said in a Facebook post that she was invited backstage during one of Riff Raff’s shows. When she arrived, she says, someone in the rapper’s entourage offered her a shot that caused her to black out. She claims that she awoke to Riff Raff “pulling out of me and getting into the shower.”\n\nRiff Raff denied these allegations in clips from a short film he called “Trial by Media,” in which he appears in aviator sunglasses and a cowboy hat and brags about his sexual exploits, while denying all allegations of impropriety.\n\n“Never once have I forced a girl to have sex,” he says in the video. “Never once have I forced a girl to do any type of drugs. I don't wanna have a girl drunk and sleepy.”\n\nIn 2014, another woman claimed the rapper sexually assaulted her. The woman—referred to in court documents as “Jane Doe”—claims Riff Raff confiscated money she’d earned working at the Bunny Ranch brothel and refused to give it back unless she slept with him, according to court filings obtained by Pitchfork.\n\nLocal police ultimately closed their criminal investigation into the woman’s complaints without bringing charges, citing a lack of evidence, conflicting witness testimony, and the accuser’s “unbelievable and ever-changing accounts.” The civil suit she filed in Nevada district court, however, is still pending.\n\nIn court filings, Riff Raff’s legal team said the artist was “being targeted because [Jane Doe] believes him to be a wealthy public figure.” In a statement to The Daily Beast, his attorney pointed to a police interview with a witness who denied anything untoward happened that night.\n\n“Mr. Simco and his representatives take allegations of sexual misconduct very seriously,” the attorney, Rob Garson, said. “The plaintiff’s false allegations in this case are unfortunate and unfairly diminish the ability of true victims to report crimes and pursue meritorious claims against actual assailants.”\n\nUnlike the other accusers, Regalbuto stayed close with Riff Raff long after their initial encounter. She says she met up with him regularly on his “Peach Panther” album tour around the East Coast in 2016, attending his concerts in Philadelphia, New York and Baltimore. She provided The Daily Beast with text messages and screenshots of her conversations with the rapper dating back to 2016.\n\nFor four years, she says, Riff Raff enticed her with promises of romantic dates and everlasting love, even while parading around with other women or ignoring her at shows. Looking back, she thinks her young age contributed to how easily she bought the lies.\n\n“When I was rewatching my videos I was thinking to myself, ‘It was so obvious that I was not the only one,’” said said. “But from the beginning, I never forgot about what he said to me at those Warped Tours [in 2015].”\n\nNow a senior in college hoping to pursue a career in international law, Regalbuto says she understands that the relationship suffered from a severe imbalance of power. She says she last spoke to the rapper two months ago, when she was in Florida and he offered to Uber her to his house. She turned him down.\n\nRegalbuto says she spoke out on Tik Tok in order to help other women avoid making her same mistakes.\n\n“I’m grateful that I was able to move on from it and be better from it and grow from it,” she said. “Some people are in these kind of situations and they’re stuck in it and it’s hard for them to get out. I just don’t want it to happen to anyone else.”", "description": "The hip-hop star denies allegations lodged by a woman in a Tik Tok video this week.", "authors": ["Emily Shugerman", "Gender Reporter"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1568434618/190913-shugerman-riff-raff-tease_upew3p", "published_at": "2019-09-14"}