{"pub": "yahoo", "url": "https://news.yahoo.com/meet-ohio-class-americas-nuclear-090000673.html", "downloaded_at": "2019-10-17 11:59:05.826373+00:00", "title": "Meet the Ohio-Class: America's Nuclear Doomsday Submarines", "language": "en", "text": "Key point: America's missile submarines are an important leg of the nuclear triad.\n\nNine years after the atomic bombings of Hiroshima and Nagasaki, Ishirō Honda’s Godzilla depicted a monster awakened from the depths of the ocean to wreak havoc on Japanese cities. A giant fire-breathing reptile, however, was less horrifying than what was to come. In less than a decade’s time, there would be dozens of real undersea beasts capable of destroying multiple cities at a time. I’m referring, of course, to ballistic-missile submarines, or “boomers” in U.S. Navy parlance.\n\nThe most deadly of the real-life kaiju prowling the oceans today are the fourteen Ohio-class ballistic-missile submarines, which carry upwards of half of the United States’ nuclear arsenal onboard.\n\nIf you do the math, the Ohio-class boats may be the most destructive weapon system created by humankind. Each of the 170-meter-long vessels can carry twenty-four Trident II submarine-launched ballistic missiles (SLBMs) which can be fired from underwater to strike at targets more than seven thousand miles away depending on the load.\n\nAs a Trident II reenters the atmosphere at speeds of up to Mach 24, it splits into up to eight independent reentry vehicles, each with a 100- or 475-kiloton nuclear warhead. In short, a full salvo from an Ohio-class submarine—which can be launched in less than one minute—could unleash up to 192 nuclear warheads to wipe twenty-four cities off the map. This is a nightmarish weapon of the apocalypse.\n\nThe closest competitor to the Ohio-class submarine is the Russia’s sole remaining Typhoon-class submarine, a larger vessel with twenty ballistic-missile launch tubes. However, China, Russia, India, England and France all operate multiple ballistic-missile submarines with varying missile armaments—and even a few such submarines would suffice to annihilate the major cities in a developed nation.\n\nWhat possible excuse is there for such monstrous, nation-destroying weaponry?\n\nRead the original article.", "description": "Watch out North Korea, Russia or China.", "authors": ["Sebastien Roblin"], "top_image": "https://s.yimg.com/uu/api/res/1.2/K8sQ7KixtUg_oyyeKdKLbw--~B/aD01OTg7dz0xMTE3O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_national_interest_705/0d2379da029efdf6bc5480fb9a9933fc", "published_at": "2019-10-16"}