{"pub": "bbc", "url": "https://bbc.com/culture/story/20191017-how-art-created-stereotypes-of-the-arab-world", "downloaded_at": "2019-10-18 08:52:36.592318+00:00", "title": "How art created stereotypes of the Arab world", "language": "en", "text": "Harems, fezes and monkeys. Long shisha pipes are entwined around the hands of beguiling pale nudes like snakes, and turbaned guards loiter uselessly nearby. If any of these images are familiar to you, it’s hardly surprising. A world-famous 19th-Century art movement was responsible for these depictions of the Arab world being imprinted on your mind.\n\nMore like this:\n\n- Is this the year’s most controversial artwork?\n\n- The riddle challenging China’s history\n\n- Is this the first time sex was depicted in art?\n\nThe Orientalist art movement – which reached its height in the 19th Century during the unravelling of the Ottoman Empire and French and British colonial ambitions in the Arabic speaking world – brought the land that was south of the Mediterranean and east of Greece into the western cultural imagination like never before. The trade, travel and invasion of that era was documented in the form of artistic masterpieces from painters such as Eugène Delacroix, Jean-Lèon Gérôme and John Frederick Lewis.\n\nTheir artworks continue to hang in museums and galleries around the world – but as a new exhibition at the British Museum shows, these were hardly objective visual records that strove to portray accurately the wider Arab world. Their visual insistence that ‘the Orient’ was a backwards, lotus-eating fairyland would validate exploitative and fetishised ideas in Europe and the US for centuries.\n\n“It’s always important to take visual culture seriously, no matter how we feel about a given work of art,” says Elisabeth Fraser, a professor of art history at the University of South Florida. “A lot of what we call Orientalism presents stereotyped images and of course these need to be examined critically. This kind of historical self-consciousness should allow us to think carefully about images of Islam that are held today.”\n\nEdward Said argued that western discourse and behaviour had systematically ‘othered’ the eastern world\n\nThe British Museum’s exhibition looks at how Islam – and by extension Islamic art – was represented in the West, and it’s clear from 19th-Century Orientalist paintings that tiles, jars, carpets and furnishings made from Islamically-informed geometric designs and art history were greatly admired for their beauty. But Islamic art had been making its way into Europe long before French and British colonialism, and the exhibition begins in the 1500s, when trade with the Ottoman and Safavid Empires hit full throttle. Even before this, Europe’s neighbouring Muslim countries were objects of curiosity. And with Palestine as the birthplace of Christianity, the Middle East was a cultural focal point, providing a constant supply of Christian envoys and pilgrims.\n\nThe Muslim Umayyads had also invaded and successfully conquered swathes of Spain from 711 AD – the Alhambra in Granada continues to be the country’s most visited tourist destination today – as well as Sicily and Malta from the 9th to 11th Centuries. European culture had, in theory, long been in contact with Islam, Islamic art and architecture. With the Christian religious movements of the Reformation and Counter-Reformation jostling for authority around this same period, it’s no surprise that translations of the Koran were sought out by European theologians to be used in their debates, and is the centre of a current European research project.\n\nA post-colonial view\n\nWhile Andalusian tiles, Turkish ceramics and Persian rugs were coveted luxury goods – and inspired facsimile craftsmanship across Europe in places like Venice – what the exhibition tries to unpick is how, in Orientalist art, many of these items were effectively props; signifiers to help denote the exoticism of the figures or buildings in the image that lay before the viewer. The term Orientalism blossomed into public scholarship when Palestinian-American academic Edward Said published his work of that name in 1978, arguing that western discourse and behaviour had systematically ‘othered’ the eastern world. In it he says: “Arabs, for example, are thought of as camel-riding, terroristic, hook-nosed, venal lechers whose undeserved wealth is an affront to real civilisation. Always there lurks the assumption that although the western consumer belongs to a numerical minority, he is entitled either to own or to expend (or both) the majority of the world resources. Why? Because he, unlike the Oriental, is a true human being.”\n\nOrientalist art, for Said, was part of this cultural tradition of stereotyping the Arab world – one that he saw extending into the present day. It makes an exhibition like the British Museum’s all the more compelling, addressing this art with a post-colonial, critical view. It analyses how objects of Islamic art were rendered in these paintings, exploring how Rudolf Ernst, a 19th-Century Austrian painter, drew inspiration from travelling in southern Spain, Turkey and North Africa; he would take photographs and make sketches on his travels and use props back in his studio to help create scenes. It was not uncommon in Orientalist art that props from different countries and time periods across the Arabic or Islamic world would be used anachronistically side by side.\n\nFrench artist Jean-Auguste-Dominique Ingres regularly painted odalisques, despite never visiting the Middle East nor North Africa\n\nBut some artists were not so full of wanderlust; Italian artist Cesare Dell’Acqua was happy to rely entirely on his imagination and ethnographic picture books to create his depictions of the Orient. Some relished the idea of ‘going native’ while maintaining their western privileges; Rudolf Ernst would, apparently, sometimes wear a fez as he painted, and in a self-portrait of British artist John Frederick Lewis he is seen sporting what he called ‘Middle Eastern’ clothes in Cairo, including a colourful sash that is cleverly exhibited next to the portrait. The sash however was completely contemporary, as well as Indian – but that didn’t stop his wife leaving it to the V&A museum in London, claiming it to be 1,000 years old and from Constantinople.\n\nWhether these artists spent time travelling or living in the Arab world or not – Lewis had spent a decade living in Cairo – popular subject material remained consistent throughout, particularly that of the armed sentinel or the harem. Several paintings in the exhibition portray guards in sumptuous costume leaning idly against walls, drinking tea or smoking; as the notes reveal: “local people were often depicted as living idle and responsibility-free lives, reinforcing a misleading stereotype”.\n\nIt is, however, the images of the harem for which Orientalist art is ultimately most notorious; and although the exhibition only dedicates a small corner to Orientalist paintings of women, it dedicates an entire room to artworks modern Arab female artists have created in response to their negative legacy. All a harem was – in theory – was a private domestic space that would only include women and their male family members. That meant no strangers, and certainly no strange foreign travellers living it up in the East; which, by the looks of all the nudes there are from this era, was insatiably tantalising to western male fantasies. A note next to one painting on display calls the invasiveness of these artists who wished to paint harem scenes “a metaphor for the Orientalist approach to the region,” and these women seem as available for public consumption as their countries were to colonial powers. Edward Said covered what he called the ‘feminisation of the East’ in Orientalism, and it’s no coincidence that a number of editions of the book feature a 19th-Century harem nude on the front cover.\n\nOne of the most famous artworks from the entire period – Women of Algiers in their Apartment by Delacroix – isn’t a harem of Muslim Algerian women at all, but of Jewish women. This is because the artist unsurprisingly wasn’t allowed access into a private, Muslim female space – but a merchant let him make a sketch of his Jewish harem instead. Odalisques, which were normally paintings of solitary nudes or nudes flanked by a servant, were also prolific; French artist Jean-Auguste-Dominique Ingres regularly painted such women despite never visiting the Middle East nor North Africa. The exhibition notes that the rich interiors seen in these paintings emphasised the voyeurism of the viewer, who peered into this private space: “placing nude women in such interiors made the images acceptable to polite European and North American society, which would otherwise have viewed them as obscene.”\n\nA cultural exchange\n\nJust as Said explored the depictions of the Middle East as passive and feminised, this one-way power dynamic has similarly diminished the cultural exchange between East and West that Europe, North Africa and Asia have long enjoyed. While it’s clear that the colonial aspects of Orientalism took far more than they ever gave from the subjects they depicted, the British Museum exhibition attempts to explain how much Islamic art and architecture have been received into European culture for hundreds of years. Elisabeth Fraser agrees that the relationship has long been passive, but now “researchers are recognising that the situation was much more complicated than that.”\n\nThe title of the exhibition, Inspired by the East, leaves out ‘Orientalism’ – perhaps it being too problematic a term – but it also leaves out how much the Middle East and North Africa have been inspired by, and indeed have reacted to, western art practice. Persian maps of London and Rome in the exhibition show how travellers from the East were just as fascinated with the cultural quirks of Europe, and images made by Ottoman photographer Pascal Sebah show how local artists took on western modes and markets to portray their cities for themselves.\n\nThe representation of our bodies and sensualities and womanhood is stolen – Yumna Al-Arashi\n\nThe final room shows four contemporary artists – Inci Eviner, Layla Essaydi, Shirin Neshat and Raeda Saadeh; and while they have all made groundbreaking work in direct response to the Orientalist movement, there are even more contemporary artists working now who are re-orienting the Orientalist gaze, such as Yumna Al-Arashi, a Yemeni-American photographer and filmmaker whose thoughtful work spans films to Vogue covers. She has earned a following on social media for her depiction of Arab women that flouts the Orientalist tradition of the colonial male gaze. “The representation of our bodies and sensualities and womanhood is stolen” she tells BBC Culture, in reference to this point. She also mentions her portrait series of Yemeni women with facial tattoos, tattoos that she saw on her own grandmother but never saw in all the paintings and photographs of reclining female nudes that crowded western art. “I took some photographs and did some interviews and made some gorgeous portraits of them, to honour them and a generation that was lost in a colonial gaze. It was a huge matriarchy that existed in these regions.”\n\nAn even more direct reference to Orientalist art is Arashi’s Shedding Skin, a re-imagining of the hammam scene – the gender-segregated baths that are culturally distinctive to North Africa and were often conflated with harem scenes as an excuse to show naked women in Orientalist art. In Shedding Skin, she depicts a hammam that is for the female, not male, gaze – and every woman posing not only knew Al-Arashi’s work but volunteered to pose. It’s a consensual, female-centric piece that is a million miles away from Delacroix’s Women of Algiers. “I wanted to recreate that Renaissance French lighting, that romantic set up,” she says. “The intention was to lure people into a film that used images we’re all used to seeing. A hammam usually doesn’t look like that, people are screaming, there’s intense lighting, in a way I wanted to use that as a play to get people to pay attention and take ownership of that image.” She mentions disunity and how difficult it has been growing up Muslim in the US: “if anything we need to be coming together as women in these spaces. I had a lovely hammam experience in the Middle East. It really touched me, these spaces in which you have conversations between total strangers.”\n\nIn the foreword of Orientalism’s 2003 edition, Edward Said wrote that “neither the term Orient nor the concept of the West has any ontological stability; each is made up of human effort, partly affirmation, partly identification of the Other.” In calling an exhibition ‘inspired by the east’, the British Museum’s title is contributing to that binary of East and West, which the objects on loan prove isn’t that effective or useful at all. As much as the Middle East and North Africa were colonial playgrounds for western powers, literature, art and architecture across Europe are testament to a long, rich tradition of Islamic art that pre-dated 19th-Century colonialism and has, gratefully, outlived it. Is western art really ‘inspired’ by the East? Or is it indebted to it?\n\nIf you would like to comment on this story or anything else you have seen on BBC Culture, head over to our Facebook page or message us on Twitter.\n\nAnd if you liked this story, sign up for the weekly bbc.com features newsletter, called The Essential List. A handpicked selection of stories from BBC Future, Culture, WorkLife and Travel, delivered to your inbox every Friday.", "description": "Inspired by the East, a new exhibition at the British Museum, reveals how a colonial art movement’s impact is still felt today, writes Sophia Smith-Galer.", "authors": ["Sophia Smith Galer"], "top_image": "https://ichef.bbci.co.uk/wwfeatures/live/624_351/images/live/p0/7r/b0/p07rb0zs.jpg", "published_at": "2019-10-17"}