{"pub": "reuters", "url": "https://reuters.com/article/us-usa-trade-china-agriculture/chinese-officials-to-visit-u-s-farmland-as-trade-talks-continue-u-s-agriculture-chief-idUSKBN1W42O2", "downloaded_at": "2019-09-20 13:04:21.140843+00:00", "title": "Chinese officials to visit U.S. farmland as trade talks continue: U.S. agriculture chief", "language": "en", "text": "FILE PHOTO: U.S. Secretary of Agriculture Sonny Perdue speaks during an event hosted by U.S. President Donald Trump with workers on \"Cutting the Red Tape, Unleashing Economic Freedom\" in the Oval Office of the White House in Washington, U.S., October 17, 2018. REUTERS/Joshua Roberts/File Photo\n\n(In September 19 story corrects to remove reference to agriculture minister, paragraph 3)\n\nWASHINGTON (Reuters) - A Chinese delegation will visit American farm regions with U.S. officials next week in an effort to build goodwill amid ongoing trade negotiations, U.S. Agriculture Secretary Sonny Perdue told reporters on Thursday.\n\n“They want to see the production of agriculture. I think they want to build goodwill,” Perdue said, adding that it was unclear where specifically they would visit.\n\nCNBC reported earlier on Thursday that the delegation would meet with agricultural producers and was planning visits to Bozeman, Montana and Omaha, Nebraska.\n\nU.S. and Chinese negotiators were meeting on Thursday for their first trade talks in nearly two months, as the United States and China seek an end to a trade war marked by tit-for-tat tariffs. The discussions are expected to focus heavily on agriculture.\n\nThe tensions in the world’s largest economies have upended supply chains worldwide and curbed global economic growth.\n\nBut last week, in an indication that the dispute may be softening, U.S. President Donald Trump delayed a planned hike on tariffs on some Chinese goods, while China postponed tariffs on U.S. cancer drugs, lubricants and animal feed ingredients.", "description": "(In September 19 story corrects to remove reference to agriculture minister, paragraph 3)", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190920&t=2&i=1431974311&w=1200&r=LYNXMPEF8I1SS", "published_at": "2019-09-20"}