{"pub": "telegraph", "url": "https://telegraph.co.uk/paralympic-sport/2019/10/23/marieke-vervoort-interview-dont-want-suffer-much-pain-done", "downloaded_at": "2019-10-23 09:03:37.961520+00:00", "title": "Marieke Vervoort interview: 'I don't want to suffer any more. I'm in so much pain. I'm done'", "language": "en", "text": "Belgian Paralympian Marieke Vervoort, a London 2012 athletics gold medallist, died by euthanasia at the age of 40 on Tuesday. This interview, originally published on December 21, 2017, was her final in-depth discussion about deciding to end her own life.\n\nMarieke Vervoort, the face of last year’s Paralympics and a marvel to millions through her stoic defiance of unremitting pain, accepts that her race is all but run. Since those sunlit days in Rio, where she won a silver medal despite agonies so acute that she has signed euthanasia papers in her native Belgium, her illness, a form of progressive tetraplegia bewildering even to her doctors, has advanced with pitiless cruelty. To step into her fifth-floor bedroom here at Brussels’ University Hospital is to face the rarest sorrow of an athlete thinking only of when to die.\n\n“I don’t want to suffer any more,” she says. “It’s too hard for me now. I get more and more depressed. I never had these feelings before. I cry a lot. Now even my eyesight is disappearing. An optician saw me and rated one eye two out of 10, and the other just one. He said there was nothing he could do, because the problem was coming from my brain. Then a neurologist stayed with me the whole night while I had one spasm after another. She said it wasn’t an epileptic seizure but just the body screaming, ‘I’m in so much pain. I’m done.’”", "description": "Belgian Paralympian Marieke Vervoort, a London 2012 athletics gold medallist, died by euthanasia at the age of 40 on Tuesday.", "authors": ["Oliver Brown", "Chief Sports Feature Writer", "Danny Care", "Sam Dean"], "top_image": "https://www.telegraph.co.uk/content/dam/paralympic-sport/2017/12/21/ss-composite-image-2017-12-21-15-13-xlarge_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwfSVWeZ_vEN7c6bHu2jJnT8.png?imwidth=1200", "published_at": "2019-10-23"}