{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/19/WS5daa4940a310cf3e35571605.html", "downloaded_at": "2019-10-19 10:40:49.438286+00:00", "title": "Li says challenges to be confronted 'head on'", "language": "en", "text": "By XU WEI | China Daily | Updated: 2019-10-19 07:22\n\nPremier Li Keqiang meets with an executive from multinational manufacturers in Beijing, on Oct 18, 2019. [Photo/Xinhua]\n\nAdvanced manufacturing seen as key for China to move up global value chain\n\nChina's economy achieved stable growth in the first three quarters, and the country can accomplish its targets for economic and social development for the year, Premier Li Keqiang said on Friday.\n\nThe premier said in a meeting with executives from multinational manufacturers that major indicators of China's macroeconomy have remained within an appropriate range in the face of a complex global landscape.\n\n\"We will shore up our confidence while confronting the difficulties head on,\" he said.\n\nThe National Bureau of Statistics said China's economy grew by 6.0 percent year-on-year in the third quarter, the slowest pace since the early 1990s. The country's GDP growth reached 6.2 percent year-on-year in the first three quarters of this year.\n\nChina has set a target of maintaining its GDP growth between 6 and 6.5 percent this year.\n\nLi said the sustained healthy growth of the economy will provide more opportunities for overseas businesses to make investments in China. Manufacturing is a fundamental sector for a country to achieve industrialization and modernization, he said.\n\nChina, as a developing country, is accelerating the development of its manufacturing sector, and it has become an inseparable part of the global value chain and a huge market for manufactured goods, he said.\n\nLi said the government considers the development of advanced manufacturing to be a strategic measure, and it has rolled out steps such as tax and fee reductions, widened market access, fairer oversight and better protection of intellectual property rights.\n\nThe goal is to create an enabling environment to move the sector to the medium-high end of the global value chain and to achieve high-quality development, he said.\n\nThe development of advanced manufacturing requires further opening-up and cooperation, and China welcomes global businesses to use opportunities from China's expanded opening-up to increase cooperation and further explore the market, he added.\n\nThe executives are part of the international consulting committee on advanced manufacturing, a panel organized by the Chinese People's Association for Friendship with Foreign Countries. They welcomed measures to cut taxes, reduce fees, streamline administration and step up the protection of intellectual property rights, according to a statement released after the meeting.\n\nThey also expressed hope for accelerating cooperation with China in promoting the upgrading and transformation of industries.", "description": "China's economy achieved stable growth in the first three quarters, and the country can accomplish its targets for economic and social development for the year, Premier Li Keqiang said on Friday.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/19/5daa4940a310cf3e97a1fa0f.jpeg", "published_at": "2019-10-19"}