{"pub": "afr", "url": "https://afr.com/world/asia/chinese-tourists-stay-home-as-hong-kong-unrest-economy-bite-20191009-p52z1o", "downloaded_at": "2019-10-09 07:09:46.106625+00:00", "title": "Chinese tourists stay home as Hong Kong unrest, economy bite", "language": "en", "text": "Shanghai | The number of Chinese tourists visiting Hong Kong plunged during one of the country's biggest weeks for overseas travel, with many preferring to stay at home and watch patriotic movies after four months of protests and rising anti-mainland sentiment.\n\nThe overall number of Chinese tourists travelling overseas also fell during \"Golden Week\", a seven-day holiday celebrating China's National Day, which is the second busiest time of the year for tourism after Lunar New Year. However, travel agents said the number of tourists visiting Australia was stable.\n\nIn contrast, the number of people crossing key border posts in southern China to Hong Kong fell by as much as 48 per cent in the first six days of last week's holiday compared with the same period last year.\n\nChinese immigration data said the average daily volume into Hong Kong at Luohu was 135,000, down 47.8 per cent from a year ago. Numbers at Shenzhen Port and Futian fell 31.2 per cent and 37.7 per cent, respectively.\n\nHong Kong, traditionally one of the most popular destinations for Chinese tourists, is no longer an attractive option after months of unrest and violence, forcing hotel operators, for example, to slash prices as occupancy rates fall.\n\nMore broadly, the number of people travelling out of China during the holiday was down 11 per cent at 10.45 million. This included 6.07 mainland Chinese citizens, 3.03 million Hong Kong, Macau and Taiwanese passport-holders, and 1.35 million foreign passport holders. The number of visitors crossing the border into the gambling enclave of Macau rose 6 per cent.", "description": "Chinese tourists are steering clear of Hong Kong after four months of protests and a backlash against mainland China.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2803%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/3de3738a31b225f1628717e8be4ad6f0e2af9c4b", "published_at": "2019-10-09"}