{"pub": "fox", "url": "https://foxnews.com/entertainment/kelly-ripa-shares-makeup-free-selfie-on-instagram", "downloaded_at": "2019-10-18 02:04:10.444198+00:00", "title": "Kelly Ripa shares makeup-free selfie on Instagram", "language": "en", "text": "Kelly Ripa is feeling incredibly confident on social media.\n\nThe “Live with Kelly and Ryan” co-host recently took to Instagram to upload a makeup-free selfie with her hairstylist.\n\nThe photo shows the famous TV host with a towel around her shoulders while her stylist strikes a pose in the background.\n\nKELLY RIPA ON THROWBACK MARK CONSUELOS POST: 'BABIES IN BLACK AND WHITE'\n\nShowing off her natural beauty, Ripa humorously captioned the picture, “Blondish. A new series maybe? Coming this fall to #abc” — a reference to the television series “Blackish,” which stars Anthony Anderson and Tracee Ellis Ross.\n\nAlthough Ripa was feeling confident about her natural beauty on Instagram, the TV veteran has jokingly expressed concerns about her body in comparison to husband Mark Consuelos'.\n\nKELLY RIPA BODY-SHAMED FOR ‘SEXY’ BIKINI PICTURE SNAPPED BY HUSBAND MARK CONSUELOS\n\nRipa said in September: “I would need a plastic surgeon [to get that] shredded and glistening [look].”\n\n“Whereas Mark just needs to not drink half-and-half for one cup of coffee,” she said. “He’s like, ‘Oh I didn’t drink half-and-half and then I took a steam shower. I think I look pretty good, what do you think?’ I’m like, ‘I can’t talk to you anymore.’ That’s a bunch of B.S. It’s nonsense.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nRipa has previously shared that she has an intense fitness routine and works out nearly every day. She takes cardio-based danced classes called AKT for two hours at least four to five times per week, as well as spin classes at SoulCyle on the weekend.", "description": "Kelly Ripa is feeling incredibly confident.", "authors": ["Andy Sahadeo"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/kellymark.jpg", "published_at": "2019-10-17"}