{"pub": "fox", "url": "https://foxnews.com/us/atatiana-jefferson-profile-fort-worth-police-shooting", "downloaded_at": "2019-10-15 23:11:48.508410+00:00", "title": "Texas police shooting victim had been assuming role of family matriarch", "language": "en", "text": "Atatiana Jefferson and her 8-year-old nephew were the only two people home early Saturday when a Fort Worth, Texas police officer fired a gunshot through a back window, killing Jefferson.\n\nAMBER GUYGER SENTENCED TO 10 YEARS IN SHOOTING THAT KILLED BOTHAM JEAN IN DALLAS\n\nThe officer, 34-year-old Aaron Dean, resigned Monday and was later charged with murder. He was released Tuesday on a $200,000 bond.\n\nBodycam video shows that Dean, who was responding to a request for a wellness check, didn't identify himself as police and fired his weapon a split-second after shouting at Jefferson to show her hands.\n\nPolice released an arrest warrant Tuesday quoting the victim's 8-year-old nephew as saying Jefferson had pulled out a gun after hearing suspicious noises behind her house. Fort Worth Interim Police Chief Ed Kraus declared there was \"absolutely no excuse\" for the killing and said Jefferson behaved as any Texas homeowner would have on hearing a prowler.\n\nJefferson had been taking over her family’s matriarch role, nurturing everyone from her nephew to her ailing mother.\n\n“Her mom had recently gotten very sick, so she was home taking care of the house and loving her life. There was no reason for her to be murdered,” said a GoFundMe page benefiting her family.\n\nJefferson's sister Ashley Carr described her to The Associated Press as “a smart, ambitious, kind person with an adventurous spirit.”\n\nJefferson grew up in the Dallas area and graduated from Xavier University of Louisiana in 2014 with a bachelor's degree of science in biology, and her family said she worked from home selling medical equipment. Merritt said Jefferson was considering going to medical school and had been studying for the Medical College Admission Test (MCAT).\n\nJefferson's family was \"relieved\" that Dean was behind bars, attorney Lee Merritt said, adding that the family \"needs to see this through to a vigorous prosecution and appropriate sentencing.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nOf the nine officer-involved shootings so far this year in Fort Worth, five targeted African Americans and six resulted in deaths, according to department data.\n\nNearly two-thirds of the department’s 1,100 officers are white, just over 20 percent are Hispanic, and about 10 percent are black. The city is about 40 percent white, 35 percent Hispanic and 19 percent black.\n\nThe Associated Press contributed to this report.", "description": "Atatiana Jefferson and her 8-year-old nephew were the only two people home early Saturday when a Fort Worth police officer fired a gunshot through a back window, killing Jefferson.", "authors": ["Frank Miles", "Frank Miles Is A Reporter", "Editor Covering Geopolitics", "Military", "Crime", "Technology", "Sports For Foxnews.Com. His Email Is Frank.Miles Foxnews.Com."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/AP-Atatiana-Jefferson.jpg", "published_at": "2019-10-15"}