{"pub": "telegraph", "url": "https://telegraph.co.uk/football/2019/10/06/uk-police-denied-request-alter-englands-euro-2020-qualifier", "downloaded_at": "2019-10-07 00:10:15.232721+00:00", "title": "UK police denied request to alter England's Euro 2020 qualifier kick-off time due to fan behaviour fears", "language": "en", "text": "The UK’s most senior police officer with responsibility for football wrote to Uefa to try to move England’s Euro 2020 qualifier against the Czech Republic from its Friday night slot in Prague over fears of fans misbehaving.\n\nDeputy Chief Constable Mark Roberts said that his request had been rejected despite police and the Football Association concerned that the “high-risk” fixture was not being played in midweek or “at a time when you are not going to encourage people with a stag-do mentality to go across and cause problems”.\n\nRoberts said: “I wrote to Uefa asking them to reconsider the Friday night [7.45pm UK time] kick-off. There are lots of games they could reschedule in exactly the same way as with the FA Cup or Premier League where there is a basket of fixtures as we can normally work it out to have the right game at the right time.\n\n“That’s not something we’ve been able to do and I am going to take it up again with Uefa to try and make sure they are conscious of, when they are making scheduling decisions, they look at which games present a particular risk and try and schedule it.”\n\nThe senior South Yorkshire officer, who oversaw policing of England fans in Russia during last year’s World Cup, added: “It’s unfortunate because you can see the risk and we’d much rather prevent a situation from developing than trying to either manage it on the night or regret it afterwards. Our position, and the FA’s, is ‘let’s have a sensible conversation with Uefa about fixtures’.”", "description": "The UK’s most senior police officer with responsibility for football wrote to Uefa to try to move England’s Euro 2020 qualifier against the Czech Republic from its Friday night slot in Prague over fears of fans misbehaving.", "authors": ["Jason Burt", "Chief Football Correspondent", "Luke Edwards", "Sam Wallace"], "top_image": "https://www.telegraph.co.uk/content/dam/football/2019/10/06/TELEMMGLPICT000199956199-xlarge_trans_NvBQzQNjv4BqGUO3hiIoo3ENbv-liualhpGzFcidJtGZ6a34nmkba5U.jpeg?imwidth=1200", "published_at": "2019-10-06"}