{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/dancing-ice-professionals-announced-fan-20739279", "downloaded_at": "2019-10-28 00:32:53.186758+00:00", "title": "with fan favourite Sylvain Longchambon 'demoted'", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThe Dancing on Ice 2020 professional skaters have been announced - and there have been some major changes.\n\nThe ITV skating show is shaking up the roster of pros for the new series, who will be partnered up with this year's cast of celebs.\n\nSeries stalwart Matt Evers, who has appeared in every series of the show since it launched in 2006, is coming back once again.\n\nBut fan favourite Sylvain Longchambon has seemingly been 'demoted' because he won't have a partner for the first time.\n\nSylvain, who met his wife - Coronation Street star Samia Longchambon - on the show, will only \"appear in select group numbers\".\n\n(Image: ITV)\n\n(Image: Matt Frost/ITV/REX)\n\nThere are lots of familiar faces returning to the ice for the brand new series in January 2020.\n\nLast years champion Alexandra Schauman, who soared to victory alongside James Jordan, will be going for the crown again.\n\nHer husband, Lukasz Rozycki, is also returning, while fellow married couple Alexander Demetriou and Carlotta Edwards are back on the ice.\n\n(Image: Dave J Hogan/Getty Images)\n\n(Image: Enterprise News and Pictures)\n\n2018 winner Vanessa Bauer, who skated to victory with Jake Quickenden, is heading back to the ice rink.\n\nSeries favourites Brianne Delcourt, Mark Hanretty, Hamish Gaman and Alex Murphy will all be joining the pro line-up in 2020.\n\nThere are a few new additions to the professional team, including Tom Naylor, who is a Doctor and Orthopaedic Surgeon.\n\n(Image: Matt Frost/ITV/REX/Shutterstock)\n\nDisney on Ice performer Brendyn Hatfield will feature, while his wife Jessica Hatfield is joining as a reserve skater.\n\nSylvain Longchambon and Patti Quinn do not have celebrity partners but will appear in select group numbers.\n\nThe pairings of all the celebrity and professional skaters will be confirmed in due course.\n\nThe celebrities this year include Love Island's Maura Higgins, Ian 'H from Steps' Watkins, cheeky chappy Joe Swash and presenter Michael Barrymore.\n\n(Image: ITV)\n\nEach couple will be seen on the ice for the first time in a festive special, Dancing on Ice at Christmas, in a one off extravaganza .\n\nThere will be a show stopping performance from Olympic champions and ice legends Jayne Torvill and Christopher Dean.\n\nThere will also be sensational routines from some of Dancing on Ice’s most popular alumni, including Ray Quinn and Jake Quickenden.\n\n*Dancing On Ice starts early next year on ITV", "description": "Dancing on Ice has confirmed the line-up of professional skaters - and there have been some major changes to the roster", "authors": ["Kyle O'Sullivan", "Image", "Itv", "Matt Frost Itv Rex", "Dave J Hogan Getty Images", "Enterprise News", "Pictures", "Matt Frost Itv Rex Shutterstock"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article13783921.ece/ALTERNATES/s1200/1_Jane-Danson-and-Sylvain-Longchambon.jpg", "published_at": "2019-10-27"}