{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/here-s-how-one-whistleblower-is-connected-to-deutsche-bank-the-sony-pictures-hack-and-an-investigation-of-president-trump-1028568906", "downloaded_at": "2019-10-02 00:39:09.925579+00:00", "title": "Here's how one whistleblower is connected to Deutsche Bank, the Sony Pictures hack, and an investigation of President Trump", "language": "en", "text": "REUTERS/Kai Pfaffenbach\n\nIn a Tuesday report, David Enrich of The New York Times profiled Val Broeksmit, a whistleblower who had access to a trove of corporate secrets related to Deutsche Bank.\n\nVal's father, Bill Broeksmit, was a senior executive at Deutsche Bank. When Bill died in 2014, Val got access to his email accounts and found thousands of documents.\n\nThose documents led to a number of stories on Deutsche Bank. Broeksmit has also been involved with the group that hacked Sony Pictures and was subpoenaed by the House Intelligence Committee.\n\nRead more on Business Insider.\n\nOne whistleblower with a treasure trove of documents is linked to Deutsche Bank, North Korea's hack of Sony Pictures, and the House Intelligence Committee's ongoing investigation into President Trump.\n\nThat would be Val Broeksmit, the son of a deceased Deutsche Bank senior executive, David Enrich of the New York Times reported Tuesday. Broeksmit has been one of Enrich's sources in his reporting over the years. Their relationship has been the \"most intense source relationship of my career,\" he wrote in the article.\n\nBroeksmit got ahold of thousands of emails that included confidential documents from his father, Bill Broeksmit, who was a senior executive at Deutsche Bank. Bill died by suicide in January 2014, and Broeksmit found his email password shortly after.\n\nWhile Enrich describes Broeksmit as an \"impatient, erratic, and abusive\" source, he also had access to a huge stockpile of corporate secrets related to Deutsche Bank. The files included corporate emails, financial materials, boardroom presentations, and legal reports — all of which are credible, according to Enrich.\n\nBroeksmit first leaked some documents to Enrich in July 2014, leading to a story detailing the New York Federal Reserve's discontent with the bank over it's accounting, according to the report.\n\nRead more: Dan Fuss is revered as 'the Warren Buffett of bonds.' He walked us through the investing approach that's delivered market-beating returns and turbocharged his 61-year career.\n\nAfter that first story, Enrich reports that Broeksmit started going after other big stories and got in touch with the North Korea-linked group that had hacked Sony Pictures. After making contact with the group, he tweeted a number of Sony corporate secrets and eventually drew the ire of the movie maker, the report said.\n\nHe went on to leak documents to a Senate investigator, a former prosecutor in the Manhattan district attorney's office, and many reporters. It's likely that documents leaked by Broeksmit led to Deutsche Bank's $41 million dollar fine from the New York Fed for violations in an American unit, which Enrich reports was overseen by Bill Broeksmit.\n\nBroeksmit also met with Rep. Adam Schiff, the chairman of the House Intelligence Committee, just after the investigation into Deutsche Bank's relationship with President Trump was opened, the report says, to discuss the secret Deutsche files. Eventually, Mr. Schiff subpoenaed Broeksmit after he tried to extract money for handing over documents, according to the report.\n\nRead more: Morgan Stanley says WeWork's failed IPO marks the end of an era for unprofitable unicorns — and explains why it leaves the market's tech kingpins vulnerable", "description": "In a Tuesday report, David Enrich of The New York Times profiled Val Broeksmit, a whistleblower who had access to a trove of corporate secrets relate...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5bf80ff6b73c2843b45b78ea-2400/rtx2c57x.jpg", "published_at": "2019-10-01"}