{"pub": "cbc", "url": "https://cbc.ca/television/from-trudeau-to-trump-how-to-be-a-politician-this-halloween-1.5324235", "downloaded_at": "2019-10-19 11:07:33.466246+00:00", "title": "From Trudeau to Trump: How to be a politician this Halloween | CBC Television", "language": "en", "text": "If you want to make an impression on Halloween, why not do an impression? As the 2019 election comes to a close, here's some expert advice from the cast of 22 Minutes for dressing up as a political figure.\n\n\"I love doing impressions,\" says 22 Minutes' Mark Critch, who has been Donald Trump, Doug Ford, Tom Mulcair, Gerald Butts, and many more politicians on the satire show.\n\n\"Doing an impression is a lot like playing music, it's not just in the notes you're hitting, it's also in the things you're not saying, it's in the silences,\" said Critch.\n\n\"You pick up on these little things about people and apply it to any situation,\" said Critch. \"It's kind of like a political cartoon drawn in a crazy exaggerated manner, a little clown-like, but there are elements of truth to it, and it's easily recognized.\"\n\n\"Fake teeth are a big thing here. Teeth and eyebrows,\" says cast member, Susan Kent, who has taken on the roles of Justin Trudeau, Sophie Trudeau, Cathrine McKenna, Melania Trump, Kelly Leitch and Kathleen Wynne.\n\nJustin Trudeau\n\n\"You've got to be very careful doing a Halloween costume, that you don't do any costume that Trudeau himself would wear. That's a very important thing,\" said Critch.\n\n\"He's a hard impression as a woman, even though I really like playing him,\" said Kent.\n\nKent has done impressions of Trudeau giving speeches, and calling Donald Trump. \"We put a bunch of false eyelashes on me, because he has those Disney prince eyes, so we need to make my eyes more feminine,\" says Kent. \"We angle my eyebrows in a single V-shape, so they go up in the middle.\"\n\nCritch says, \"He wears rolled up sleeves for no reason, unbuttons the top button, and is constantly never making any actual point, but with a smug look. So, say nothing smugly, with a few stammers.\"\n\n\"Trudeau tends to stammer when he's kind of lying or talking out of his ass,\" said Critch. \"He also pauses before he lies. You can see that when he's giving the apology for doing blackface or brownface. When he's asked if he's done it again since, he doesn't want to say that so he goes into the 'ahhh' and 'umms'.\"\n\nSophie Trudeau\n\nKent says when she met Sophie Trudeau, she told her \"I do you and your husband on our show,\" and Sophie replied, \"I don't watch your show, but you better do a good job!\"\n\n\"The trick to Sophie is being so incredibly warm and interested in everything people have to say, very forward and very earnest and flushed with love,\" said Kent. \"So you're kind of like, 'are you for real?'\"\n\nAndrew Scheer\n\n\"DIMPLES. You gotta get the dimples. He looks like a Gerber Baby blown up and put in a suit,\" said Kent.\n\n\"Kind of like a wet bag of flour, he's a plain guy, kind of looks like the Pillsbury Doughboy. He's big with dairy farmers, so you should have a big carton of milk with you,\" said Critch.\n\nJagmeet Singh\n\n\"Don't do a costume of Jagmeet Singh because Justin's probably already doing it, so you don't want to show up at the party with the same costume on,\" said Critch. \"Also maybe skip Jagmeet, unless you're also Sikh.\"\n\n\"If you do go as him, look very handsome, very well-dressed. He's probably likely to be looking over at his reflection than he is to be looking at you. Make sure you have a bicycle with you at all times,\" said Critch.\n\n\"The secret to Jagmeet is long, long hair and being super hot,\" said Kent. \"In his french language ad, his hair is all down, and it's like, 'oh boy, I'm listening.'\"\n\nElizabeth May\n\n\"She is in trouble for photo shopping a reusable cup and metal straw into her official photographs, so if you can actually get a reusable cup, that would be great,\" said Critch.\n\n\"I use two separate front teeth stuck on the front and wear a wig,\" said Kent. \"She draws out her words, so do that just pushed up too ridiculous.\"\n\nMaxime Bernier\n\n\"A great costume if you're staying home on Halloween handing out candy\" said Critch, \"because if kids come to your door, you can just scare them away and say that you don't want newcomers looking for food, in line with Bernier's policy.\"\n\n\"If you have a lantern jaw, and you're looking for a Halloween costume, go for Maxime Bernier, says Kent.\n\n\"It would be hilarious to do his Mad Max character: he calls it Mad Max, there's a photo of him crossed with Mel Gibson's character in the original '80s Mad Max movie, in futuristic metal leather guard.\"\n\nDonald Trump\n\n\"He's always reassuring himself, but pretending that other people are reassuring him,\" said Critch. \"He's always confident. He might have the wrong answer but he's committed to it.\"\n\nWhen doing a Trump impression on the 22 Minutes live show, the cast passes out Trump signs to the audience and tells them to cheer as if they were a Trump supporter. Critch says the audience gets really into it.\n\n\"People are just normal Canadians, happy, throughout, but then halfway through they're yelling 'Trump, Trump, Trump!'\" said Critch.\n\nMelania Trump\n\n\"She's not a politician, but the worst politician's wife,\" said Kent.\n\n\"I end up doing some kind of a Dracula voice. Like a Transylvanian bloodsucker. I'm not saying she is that. I just exaggerated.\"\n\nTo get Melania's \"amazing model teeth,\" Kent uses a \"flipper,\" false teeth on top two teeth. Kent calls these \"perfect Toddler and Tiara teeth.\"\n\n\"She has almond eyes but I have tall round eyes, so the trick is to put black eyeliner on edges, and then you've got to smize,\" said Kent.", "description": "The cast of 22 Minutes give their insider tips for dressing up as political figures.", "authors": [], "top_image": "https://i.cbc.ca/1.5325878.1571407604!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/combo-graphic-22-minutes-halloween.jpg", "published_at": "2019-10-18"}