{"pub": "nytimes", "url": "https://nytimes.com/2019/10/04/us/politics/white-house-subpoenas-impeachment.html", "downloaded_at": "2019-10-04 23:45:27.572382+00:00", "title": "Impeachment Investigators Subpoena White House and Ask Pence for Documents on Ukraine", "language": "en", "text": "WASHINGTON — House impeachment investigators widened the reach of their inquiry on Friday, subpoenaing the White House for a vast trove of documents and requesting more from Vice President Mike Pence in a bid to better understand President Trump’s attempts to pressure Ukraine to investigate his political rivals.\n\nThe subpoena, signed by the House Oversight and Reform Committee, is for documents and communications that are highly delicate and would typically be subject in almost any White House to claims of executive privilege. If handed over, the records could provide keys to understanding what transpired between the two countries.\n\nThe request for records from a sitting vice president is unusual in its own right, and Mr. Pence’s office quickly signaled he would not comply. In a letter to Mr. Pence, the chairmen of three House committees wrote that they were interested in “any role you may have played” in conveying Mr. Trump’s views to Ukraine. The lawmakers — Representative Adam B. Schiff of California, the Intelligence Committee chairman; Representative Eliot L. Engel of New York, the Foreign Affairs Committee chairman; and Representative Elijah E. Cummings of Maryland, the Oversight and Reform Committee chairman y asked for a lengthy list of documents detailing the administration’s dealings with Ukraine, to be produced by Oct. 15.", "description": "House Democrats sent a subpoena to the White House requesting a vast range of documents about President Trump’s dealings with Ukraine and efforts to cover up his actions.", "authors": ["Nicholas Fandos"], "top_image": "https://static01.nyt.com/images/2019/10/04/us/politics/04dc-impeach-trump/merlin_162115500_f1f0c1e1-21a1-4b50-affc-a3fc378c44aa-facebookJumbo.jpg", "published_at": "2019-10-04"}