{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/gm-uaw-strike-inspire-union-movements-southern-workers-auto-plants-2019-9", "downloaded_at": "2019-09-25 23:27:21.377958+00:00", "title": "The massive GM strike is energizing a new push among auto workers in the South that could shake up the industry", "language": "en", "text": "SPRING HILL, Tennessee — \"The tide is changing. You can feel it,\" says union activist and sheet-metal worker Adrian Mizell, as cars pass by honking their horns in support of workers here out on strike at the local General Motors facility.\n\n\"There has been so much honking, and you can just tell that thousands and thousands of the community that they feel the same as the people here standing up for this.\n\n\"This is vocal support,\" Mizell says as a driver passes by with a burst of the horn. \"These are people that feel strongly. And you can't raise that kind of attention unless you are stand up in solidarity for people's rights.\"\n\nFor decades, the United Auto Workers has struggled to unionize foreign auto plants in the South. But union activists at plants scattered across the region say that the high-profile GM strike has created new momentum for unions here.\n\nThe strike could ignite organizing that could help to improve working conditions for tens of thousands of auto workers throughout the South, where auto plants have moved in recent years to avoid UAW bastions in the Rust Belt.\n\nThe GM strike is inspiring new hope at auto plants in the South\n\nThe strike of over 49,000 GM workers entering its second week is the longest strike that the UAW has had at GM since 1970, when workers went on strike for 67 days. Workers are angry over the outsourcing of American jobs, the heavy usage of temporary workers by GM, and GM's demand that workers pay more for healthcare despite GM making $11.8 billion in profit in 2018.\n\nIn June, workers at a Volkswagen plant in Chattanooga, Tennessee, just two hours down the road from GM's Spring Hill facility, lost a union vote by a margin of 29 votes. Now, union activists in the plant say that workers who voted against the union are becoming more union-friendly as they watch the support GM strikers receive.\n\n\"Seeing the UAW workers fight back against GM, it opens their eyes a little bit because they don't realize the power you have as a labor if you withhold labor\" says Billy Quigg, a union leader at Volkswagen plant in Chattanooga, who has fought for eight years to persuade his fellow coworkers to vote for the union.\n\nQuigg says that the strike is leading to a lot of union ambivalent workers to ask questions about strikes and what unions can do there.\n\n\"One of the best things about it is to see all the anti-union points and all the points they've always made and seeing how you are able to show, point-blank, these are lies, they are all false, and they are all there to scare you,\" Quigg says. \"So all the talking points that anti-union groups use are being debunked right in front of workers' eyes by this strike.\"\n\nA long history of union suppression at Southern auto plants\n\nTo defeat the union drive, Volkswagen management repeatedly warned that the plant might close if a union was voted in, citing Volkswagen's decision to close a Westmoreland County, Pennsylvania, in 1988 after a series of strikes organized by the UAW workers there. (Full disclosure: Several members of my family worked at VW's Westmoreland County plant.)\n\nManagement also cited a recent corruption scandal that has seen five top UAW officials convicted of accepting bribes from management in exchange for concessions as evidence that the UAW wouldn't stand up for workers at Volkswagen. The company repeatedly told workers that the union would do little to help them.\n\nYet with GM already making concessions to the union, including taking away a proposal that would have forced workers to pay 15% of their healthcare premiums, instead of offering that workers pay only 4%. Many workers at the Chattanooga plant are beginning to realize that the UAW is indeed willing to fight for them.\n\nThe anti-union workers \"are going 'Oh, the workers didn't like GM's proposal, and GM changed their offer,'\" Quigg says, role-playing a conversation he's been having with his coworkers. \"Absolutely. Once you withhold that labor, a lot changes because GM's butt is on the line because cars aren't being built.\"\n\nQuigg says that the strike also demolishes anti-union talking points that say unions lead to plant closing, as GM has already offered to partially reopen two closed plants in Lordstown and Detroit as part of the talks.\n\n\"So when they tell, 'Oh, your plant is going to get shut down,' you might want to rethink to that. We have the power to bargain about plant closing,\" Quigg adds. \"The strike is really opening people's eyes about the power that we have as a community when you see 49,000 people go on strike.\"\n\nStarting to change minds\n\nQuigg says the strike is also ridding workers of ideas that the UAW wouldn't fight for them.\n\n\"They always thought when you heard about it, it was this myth or things people talked about to try to get people to sign on [to the union],\" Quigg says. \"They hadn't actually seen in action, and now they are seeing it in action and their eyes are open like they haven't seen it before.\n\n\"They're saying, 'Hey, this is a big deal. They really do care about the people. They really are fighting for the workers.'\"\n\nWorkers at other plants in the South say that the strike is leading to productive conversations about organized labor. In August 2017, the UAW lost a high-profile union election at Nissan's plant in Canton, Mississippi, by a nearly two-to-one margin.\n\nThe strike has quickly become a hot-button issue at the plant. Nissan has put anti-union messages on electronic billboards around the plant that blast the UAW for going on strike. However, much like at Volkswagen's Chattanooga plant, the strike is opening the eyes of union-ambivalent workers in Mississippi.\n\n\"In a way [the strike] is a good thing because it's sparking a lot of conversations,\" says pro-union Nissan employee Robert Hathorn, who adds that a lot of workers are supportive of the strikers' demands.\n\nWorkers at auto plants throughout the South feel sympathy with the strike, particularly with strikers' demands that GM stop the practice of hiring permanent temporary workers. Many auto plants in the South have workforces that are made up of a large percentage of temp employees working full-time at low wages without health insurance.\n\n\"Workers really realize the significance of what happens there affects us on our job in a nonunion factory,\" Nissan worker Tyler Parks says. \"What they get in their negotiations will affect what happens here indirectly, so it really got a lot of their interest up on what's really going on.\"\n\nIn Vance, Alabama, where the UAW has unsuccessfully sought to unionize the town's Mercedes-Benz plant, the strike is provoking positive conversations about the role of organized labor and how a union could eliminate temp-labor problems at the plant.\n\n\"Most of the people I spoke with support the UAW on the issue,\" Mercedes-Benz worker Kirk Garner says. \"I have not had anyone tell me that they don't support the UAW workers in their strike. Right now, all the automobile plants in the South pay them half what they pay a normal worker, so we feel their pain.\"\n\nThe strike at GM has sparked interest in organized labor among workers who previously thought the union couldn't do anything for them. It has given workers a new sense of enthusiasm to keep going in their long uphill battles to organize unions in the Deep South.\n\nIn Chattanooga's Volkswagen plant, where the union lost by 29 votes in June, the strike has given new energy to a push to try again for a union. UAW activists there say they're hoping to call another union election in a year or two. This time, they hope that the energy of the GM strike could give them the lift they need to win.\n\n\"The whole atmosphere will change,\" Quigg says. \"Chattanooga Volkswagen will one day become a union shop.\"", "description": "49,000 GM workers have joined a strike against GM to fight for better wages. It could help inspire similar pushes at auto plants in the South.", "authors": ["Mike Elk"], "top_image": "https://image.businessinsider.com/5d8b8f712e22af38c1364622?width=1200&format=jpeg", "published_at": "2019-09-25"}