{"pub": "investing.com", "url": "https://ca.investing.com/news/technology-news/sap-in-threeyear-cloud-partnership-with-microsoft-1987740", "downloaded_at": "2019-10-21 06:43:02.347802+00:00", "title": "SAP in three-year cloud partnership with Microsoft", "language": "en", "text": "BERLIN (Reuters) - Business software group SAP said on Monday it had reached a three-year deal with Microsoft (NASDAQ: ) to help its large enterprise customers move their business processes into the cloud.\n\nThe partnership, called \"Embrace\", will help clients to run operations hosted at remote servers supported by SAP's flagship S/4HANA database, new Co-Chief Executive Officer Jennifer Morgan said as SAP released its final third-quarter results in line with preliminary figures released on Oct. 11.\n\n\"We bundled SAP's cloud platform services to support customers around the extension, integration and orchestration of SAP systems,\" Morgan told reporters, adding the product would be sold through Microsoft's distribution channels.\n\nDisclosure of the partnership comes after long-time CEO Bill McDermott stepped down to make way for Morgan - the first woman to become CEO of a company in Germany's blue-chip - alongside fellow Co-CEO Christian Klein.\n\nThe deal - which helped SAP double new cloud bookings in the third quarter - addresses a complaint from many customers that it is too hard to shift from SAP's traditional on-premise model to remotely hosted services.\n\nThe partnership deepens SAP's already close relationship with Microsoft and its Azure cloud division, although the Walldorf-based company also works with Google (NASDAQ: ) and Amazon (NASDAQ: ) Web Services in the cloud.\n\nDe-emphasising its own-brand cloud offering is turning out to be one factor supporting a pickup in SAP's cloud gross margins. These picked up by 5.4 percentage points to 69% in the third quarter - compared with a 2023 target of 75%.\n\nIn the third quarter, SAP reported a 10% increase in revenue and a 15% rise in operating profit, after adjusting one-off items and currencies, helping it to achieve an expansion of 1.7% in its operating margins.\n\nThe company reiterated its forecast for the year and through to 2023. SAP is due to update investors on strategy at a capital markets' day in New York on Nov. 12.", "description": "SAP in three-year cloud partnership with Microsoft", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF9K096-OCATC_L.jpg", "published_at": "2019-10-21"}