{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/09/ivanka-and-don-jr-pull-trump-in-opposite-directions-on-guns.html", "downloaded_at": "2019-09-23 17:33:42.118194+00:00", "title": "Ivanka and Don Jr. Are Pulling Trump in Opposite Directions on Guns", "language": "en", "text": "Eric’s opinion is not important. Photo: Chip Somodevilla/Getty Images\n\nIt’s no mystery which of his children Donald Trump loves more, but whose political instincts does he trust? We may soon find out. According to Politico, Trump’s two oldest children, Ivanka and Donald Jr., are currently battling it out on opposite sides of the gun-control debate.\n\nJoined by Attorney General William Barr, Ivanka is reportedly urging her father to back new gun laws, including universal background checks. She believes such moves would give Trump a win with moderate suburban voters without endangering him with his base, which will praise anything he does as long as he does it. But Donald Jr. is less sure of that. Along with acting White House chief of staff Mick Mulvaney, the eldest Trump child is reportedly urging his father to hold his fire on gun legislation. The vast public support for new gun laws and the growing gun-violence epidemic are apparently not reason enough to act.\n\nTrump, meanwhile, is saying little as his administration sends mixed signals on the subject. Just last week, the White House began circulating a proposal for moderately expanding background checks. And almost immediately, the White House distanced itself from its own proposal. “That is not a White House document, and any suggestion to the contrary is completely false,” Deputy Press Secretary Hogan Gidley said.\n\nThe Politico report is the latest evidence of an increasingly visible rift between Trump’s oldest children. Earlier this month, The Atlantic ran a piece about the battle to be heir of the Trump dynasty. It was a spot that long seemed to belong to Ivanka, the more refined of the eldest Trump children. Along with husband Jared Kushner, she was given so much power early in the Trump administration that she was sometimes referred to as the “real first lady.” Meanwhile, Don Jr. was out building his own MAGA Jr. brand. In the process, he also built much more of a following among Trump’s base than the prim and proper Ivanka, though his drawing power is still fairly limited.\n\nStill, Don Jr. has elevated his standing in his father’s eyes. And now the son whom Trump once called “not the sharpest knife” may soon win another victory over his sister when the president inevitably punts on new gun legislation.", "description": "Ivanka Trump wants more restrictive gun laws. Donald Trump Jr. thinks not. Which child will President Trump side with?", "authors": ["Adam K. Raymond"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/09/23/23-trump-kids-photo.w1200.h630.jpg", "published_at": "2019-09-23"}