{"pub": "realclearpolitics", "url": "https://worldnews-today.com/analysis-comment/opinion-why-adam-schiff-is-the-right-man-for-the-moment", "downloaded_at": "2019-10-05 22:46:17.904515+00:00", "title": "Why Adam Schiff Is the Right Man for the Moment", "language": "en", "text": "President Trump and House Republicans are trying to cast the House Intelligence Committee chairman, Adam Schiff of California, as the lead villain in a partisan impeachment reality show. The president has road-tested some nicknames, called for Mr. Schiff’s resignation and accused him of treason, and is now trying to spin out a new conspiracy theory, suggesting that Mr. Schiff “probably helped write” the whistle-blower complaint. House Republicans have indicted that they intend to force a vote to condemn Mr. Schiff when they return from recess.\n\nBut in all the ways that matter for this particular moment, Mr. Schiff seems to be coming off as the opposite of a slick political operator bent on betraying the country.\n\nFor starters, he was thrust into this role largely by happenstance. Jerry Nadler, the House Judiciary Committee chairman, has been pursuing an impeachment investigation for some time. But his efforts have largely fallen flat with both the public and the House speaker, Nancy Pelosi.\n\nNews of a whistle-blower complaint about Mr. Trump’s July 25 phone call with President Volodymyr Zelensky of Ukraine changed all of that. The drama that ensued put Mr. Schiff in the driver’s seat — not because the call specifically addressed intelligence matters, but because the whistle-blower just happened to work in the intelligence community. A whistle-blower from the State Department with access to similar witnesses and facts could just as easily have submitted the complaint to a different committee.\n\nMr. Schiff is a stickler for process. When the whistle-blower approached him and his staff, they did precisely the right thing: They directed the whistle-blower to obtain legal counsel and file the complaint through the appropriate channels laid out in the Intelligence Community Whistleblower Protection Act.\n\nMr. Schiff went public only after receiving a letter from the intelligence community inspector general indicating the acting director of national intelligence had not followed process requirements outlined in the law. The president can concoct all the conspiracy theories he wants, and Lindsey Graham and others may pick up the tune, but Mr. Schiff played it by the book.\n\nSpeaker Pelosi tagged Mr. Schiff as the lead on gathering facts on the Ukraine issue in anticipation of an impeachment vote. For now, Mr. Nadler has stepped into the background — eventually, any articles of impeachment would go through his committee first. But Mr. Schiff is quarterbacking speedy efforts of his own staff and also two other committees, Foreign Affairs, and Oversight and Reform, that Ms. Pelosi has directed to assist in the effort.\n\nMr. Schiff is setting the tone and strategy of the inquiry, quickly setting up depositions of key witnesses and warning the administration that obstruction and delay could form the basis for a distinct article of impeachment similar to one approved by the Judiciary Committee against Richard Nixon in 1974.\n\nIn short, Mr. Schiff is the man of the moment — and, without knowing it, he has been preparing for it for the past two years. As chairman, he followed Devin Nunes of California, whose handling of the committee’s Russia investigation was specious and included cloak-and-dagger visits to the White House.\n\nMr. Schiff was vocal about his desire to tell the American people, in an open and public way, exactly what happened in the 2016 election. He also signaled he would seek to address wider issues, like the intersection of the president’s foreign policies and the Trump family’s global financial interests. Mr. Schiff has become the Democrats’ go-to articulator of the importance of core American values like the rule of law, election integrity, respect for human rights and anti-corruption — as well as broader foreign policy challenges like the rise of authoritarianism around the world.\n\nBut understand this: The role of the head of the House Intelligence Committee is not normally so high-profile. Traditionally, the chairman focuses on more mundane agency oversight topics — and does so not in front of TV cameras but in closed-door settings.\n\nThere is also an element of personality and style. Before the 2016 election, Mr. Schiff was a well-respected but relatively obscure member of Congress. In a 2018 California Sunday Magazine profile, he was described this way: “Dressed in a crisp blue suit and sensible dress shoes, he cultivates a cheerfully beleaguered demeanor. He speaks without notes and tells jokes the way a dad would if that dad had access to highly classified intelligence.”\n\nHe has been called solid, reasonable and mild-mannered. Sometimes too much so. Even awkward at times. Even now, his Democratic colleagues in the House view him as the prosecutor he once was — not a political operator clawing his way to ever-greater heights of power. But for purposes of the investigation, clinical and focused is what is called for in the face of Mr. Trump’s theatrics and distraction.\n\nBut Mr. Schiff has also shown that his patience has its limits and that he can be a very effective communicator. His characterization of President Trump’s call with Mr. Zelensky as a “classic organized crime shakedown” is easy for people to understand. His lengthier, more impassioned remarks — like his defense of his view that the Mueller report did not absolve the president of wrongdoing, after Mr. Trump and committee Republicans called for his resignation — showed a backbone that left Republicans quieted.\n\nMr. Schiff’s status as credible, effective communicator who can speak to Americans in ways that ring true may be the most important contribution he can make over the next few weeks and months.\n\nIt is becoming clearer every hour that the impeachment inquiry is not over whether Mr. Trump pressed a foreign power to investigate a political rival. He admitted to that conduct, released the call memo and even doubled down on camera on Thursday, saying of the Ukrainians, “If they were honest about it, they would start a major investigation into the Bidens” and “China should start an investigation into the Bidens.”\n\nThis is not a disagreement about facts or process. It is about whether what Mr. Trump is doing is improper and impeachable. The ultimate outcome of this process could depend on Democrats’ ability to draw a straight line between the president’s actions and the most profound concerns of the authors of the Constitution about the abuse of executive power.\n\nThis type of fight has always been Mr. Schiff’s strong suit.\n\nMargaret L. Taylor (@MargLTaylor) is a senior editor at Lawfare and a fellow at Brookings.\n\nThe Times is committed to publishing a diversity of letters to the editor. We’d like to hear what you think about this or any of our articles. Here are some tips. And here’s our email: [email protected].\n\nFollow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.\n\nSource: Read Full Article", "description": "", "authors": [], "top_image": "http://worldnews-today.com/wp-content/uploads/2019/10/cnewsfoto04taylorWeb-facebookJumbo.jpg", "published_at": "2019-10-04"}