{"pub": "breitbart", "url": "https://breitbart.com/news/footballers-wives-the-interpreters-who-are-a-lifeline-in-china", "downloaded_at": "2019-10-30 07:55:14.444665+00:00", "title": "Footballers’ ‘wives’: the interpreters who are a lifeline in China", "language": "en", "text": "Shanghai (AFP) – Rafa Benitez says his Chinese-language interpreter is always by his side and former Barcelona defender Sergi Barjuan joked that his translator was like his wife, because they were together so much.\n\nAt training, matches and press conferences in China, the interpreters are always close by — but they get scant attention and are paid far less than the coaches or players they help.\n\nBut Benitez and other foreigners in Chinese football would not be able to do their jobs without their interpreters, who also play a crucial role in everyday life.\n\nBenitez, a Champions League winner as Liverpool manager, said soon after arriving at Dalian Yifang in July that communication was his biggest challenge.\n\n“You always have an interpreter at your side shadowing you,” the 59-year-old Spaniard, who speaks good English, wrote on his blog.\n\n“Mine, Justin, is copying my gestures at training and at the matches and each day we are more in sync,” he added, highlighting just how critical the dynamic is.\n\n– Filtering out ‘sharp words’ –\n\nInterpreters are not unique to China: former Chelsea, Real Madrid and Inter Milan coach Jose Mourinho famously started out as a translator, and worked for England’s Bobby Robson when he managed Barcelona.\n\nBut the difficulty many people have learning Chinese and the lack of English in the country as a whole has spawned an industry of football interpreters, almost always young and male.\n\nOne of them is Hong Wenjie, right-hand man to coach Dragan Stojkovic at Guangzhou R&F, who like Benitez’s Dalian are in the top-tier Chinese Super League.\n\nThe 29-year-old Chinese, who can speak English and Spanish, describes his job as “a bridge”.\n\nHe has been Stojkovic’s interpreter since the Serbian, who speaks English, French and Italian, arrived at the club in August 2015.\n\n“The challenges were more at the beginning. I needed to know about the coach’s personality, habits and his football philosophy,” said Hong, who once did a stint as a tour guide.\n\nLanguage skill is one thing, Hong said, but you also need to know football jargon and have an intricate understanding of the game.\n\nBeing a “bridge” is not always a comfortable place to be, especially when feelings are running high in the changing room at half-time or after a defeat.\n\nHong said he sometimes uses his own discretion to water down some of Stojkovic’s more scathing remarks.\n\n“Everyone understands that only when you really love the team, you will have such a strong emotion,” he said.\n\n“In that case, I won’t translate the sharp words otherwise it will fuel the fire.\n\n“However, I will convey the coach’s attitude to the team in another way.”\n\nIt can also mean saving coaches from themselves, especially in China, where football authorities hand out harsh punishments for criticism of referees.\n\nInterpreters sometimes purposely omit comments by coaches in press conferences to head off trouble with the Chinese Football Association.\n\n– Memories of tragic Tiote –\n\nSergi Barjuan’s family remained in Spain while he coached Zhejiang Greentown — one reason why he called his interpreter his “wife”. He left the post in July after 20 months.\n\nInterpreters also play an important part in the daily lives of foreign players and coaches, for whom China can be a culture shock.\n\nThey help new arrivals find a place to live, open bank accounts and help set up mobile payment systems on their smart phones.\n\nEven after they get settled into life in China, foreign coaches or players lean heavily on interpreters, even taking them supermarket shopping.\n\nThey can become close friends and confidants.\n\nThat was the case for Zhao Chen, who worked at Beijing Enterprises FC and helped Cheick Tiote, the midfielder who died in 2017 after collapsing in training with the club.\n\nThe Ivory Coast international’s death aged 30 shocked the football world.\n\nThe 28-year-old Zhao, now an interpreter at Shijiazhuang Ever Bright in China’s second tier, has fond memories of getting Tiote settled in, including finding him a place to worship.\n\n“As a foreign Muslim, it’s not easy to find a mosque for their jumah (Friday prayers),” said Zhao.\n\n“I would check it first and always went there with him together.\n\n“Until now I still miss him so much.”", "description": "Shanghai (AFP) – Rafa Benitez says his Chinese-language interpreter is always by his side and former Barcelona defender Sergi Barjuan joked that his", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/29/8e896b_dragan-stojkovic-head-coach-guangzhou-relies-heavily-on-his-translator-640x335.jpg", "published_at": "2019-10-29"}