{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-4554390/Joost-van-der-Westhuizen-s-wifes-held-gunpoint.html", "downloaded_at": "2019-10-05 07:24:11.880295+00:00", "title": "Joost van der Westhuizen's wifes held up at gunpoint", "language": "en", "text": "The terrified wife of the late rugby star Joost van der Westhuizen believes he saved her life from beyond the grave after she was held up at gunpoint.\n\nSinger Amor Vittone, 45, had stopped at traffic lights in Diepsloot on the outskirts of Johannesburg, South Africa when an armed thug smashed her windscreen with a revolver and held her up.\n\nThe mother-of-two - who lost her Springbok superstar husband to Motor Neurone disease in February - screamed as she was showered in glass.\n\nHer attacker struck near a township as the celebrity drove her sponsored white Mercedes CLA 200.\n\nAmor Vittone (right), the wife of tragic rugby legend Joost van der Westhuizen (left) believes he saved her life from beyond the grave after she was held up at gunpoint\n\nSinger Amor Vittone, 45, had stopped at traffic lights in Diepsloot on the outskirts of Johannesburg, South Africa when an armed thug smashed the windscreen of her Mercedes (pictured) with a revolver and held her up\n\nThe mother-of-two - who lost her Springbok superstar husband (pictured) to Motor Neurone disease in February - screamed as she was showered in glass\n\nShe told TshishaLive that she feared being raped or murdered by the carjacker who struck as night fell and was trying to kidnap her and steal the car.\n\nVittone said: 'I am usually so careful but I had stopped at a traffic light at about 7pm when I just heard this loud bang and then I saw there was this gun.\n\n'The next minute this big man with a jacket over his head appeared next to me in the smashed window. I went into defence mode and just started driving.\n\n'All I could think about was my children and I just wanted to make sure I was safe so I could return to them and I drove off a fair distance away,' she said.\n\nIt was then that she realised that her bag had been stolen from the car.\n\nThe Afrikaans singer (left) said she felt that with her run of tragedy and bad luck she and her family are being 'tested by God' and said she does not know why\n\nVittone continued: 'This man had a gun and I could have been shot or dragged from the car. I could have been raped. I am just grateful I still have my life.\n\n'My bag and purse can be replaced but my life cannot,' she added.\n\nIn tears she told how covered in broken glass she returned home to her kids only to find when she parked a single white feather lying on the seat by her.\n\nShe said: 'I was protected by an angel, I am convinced I was protected.'\n\nThe Afrikaans singer said she felt that with her run of tragedy and bad luck she and her family are being 'tested by God' and said she does not know why.\n\nVittone said: 'I told my family I don't understand why all of these things are happening to me. I broke my ankle in January then Joost died in February.\n\nJoost van der Westhuizen was diagnosed with terminal Motor Neurone Disease in 2011 which put him in a wheelchair and saw him lose nearly all use of arms and legs\n\n'My kids have been sick and I have been fighting court cases and it has all happened in the last few months and I don't know why I am being tested.'\n\nHer mother Delse was on the phone to her daughter when the attempted car jacking occurred and said: 'I just told her \"keep going, drive, drive, drive\".\n\n'They smashed the front windscreen and took her handbag which was on the passenger seat and they held a gun to her head and I heard her screaming.\n\n'I just told her to put her foot down,' she said.\n\nHer husband was one of the greatest rugby scrum halves to play the game and lifted the 1995 Rugby World Cup at home in South Africa.\n\nThe Springboks won the final in front of their President Nelson Mandela.\n\nThe rugby legend captained them in the 1999 World Cup and was capped 89 times and scored 38 tries and was inducted in the Rugby Hall of Fame in 2007.\n\nHe was diagnosed with terminal Motor Neurone Disease in 2011 which put him in a wheelchair and saw him lose nearly all use of arms and legs and speech.\n\nHe died aged 45 at home in February surrounded by family and friends. He and his wife had been estranged but had two children together, Jordan, 13, and Kylie, 11.", "description": "Singer Amor Vittone, 45, had stopped at traffic lights in Diepsloot on the outskirts of Johannesburg, South Africa when an armed thug smashed her windscreen with a revolver and held her up.", "authors": ["Jamie Pyatt In Cape Town For Mailonline"], "top_image": "https://i.dailymail.co.uk/i/pix/2017/05/30/09/40EE68F400000578-0-image-a-8_1496132531338.jpg", "published_at": "2017-05-30"}