{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/28/dave-chappelle-defends-free-speech-first-amendment-is-first-for-a-reason", "downloaded_at": "2019-10-29 04:02:06.866904+00:00", "title": "Dave Chappelle Defends Free Speech: ‘First Amendment Is First for a Reason’", "language": "en", "text": "Stand-up comedian Dave Chappelle took a stand for free speech on Sunday, defending the First Amendment as he accepted the prestigious Mark Twain Prize for American Humor, honoring achievements in the field of comedy.\n\nDave Chappelle also defended smoking indoors, reportedly lighting up on stage as he entertained the audience gathered at the John F. Kennedy Center for the Performing Arts in Washington D.C.\n\n“The First Amendment is first for a reason. The Second Amendment is just in case the first one doesn’t work out,” Chappelle said, according to multiple reports. “The country’s getting a little tight. It doesn’t feel like it’s ever felt in my lifetime.”\n\nChappelle has come under attack from the mainstream media and leftist on social media over his Netflix special Sticks and Stones, in which he calls out “cancel culture” and performs a series of jokes about transgender individuals and politically incorrect impersonations.\n\nChappelle is the greatest living American comic\n\npic.twitter.com/g0z8BVfbDI — Ryan James Girdusky (@RyanGirdusky) August 26, 2019\n\n“We all want to live in a polite society, we just kind of have to work on the levels of coming to an agreement of what that actually looks like,” Chappelle said on the red carpet Sunday, according to The Hill.\n\n“I, personally, am not afraid of other people’s freedom of expression. I don’t use it as a weapon. It just makes me feel better. And I’m sorry if I hurt anybody,” he said, before adding, “Yada, yada, ‘everything I’m supposed to say.'”\n\nUSA Today reported that Chappelle joked about smoking indoors.\n\n“I want everyone in America right now to look at me. Look at me smoking indoors,” he said. “I didn’t ask anybody… What are they gonna do? Kick me out before I get the prize?”\n\nHe added: “It’s called leverage.”\n\nChappelle was honored at Sunday’s event by fellow comedians Sarah Silverman, Aziz Ansari, Jon Stewart, and Tiffany Haddish, according to reports.\n\nActor Bradley Cooper, who directed Chappelle in A Star is Born, was on hand to praise the comedian for appearing in his movie.\n\nHouse Speaker Nancy Pelosi and Rep. Adam Schiff (D-CA) were also in attendance.\n\nThe Mark Twain Prize is handed out annually to individuals who have made significant contributions to the field of comedy and humor. Recent recipients include Julia Louis-Dreyfus, David Letterman, Bill Murray, Eddie Murphy, and Jay Leno.\n\n“Stand-up comedy is an incredibly American genre,” Chappelle reportedly told the crowd. “I don’t think any other country could produce this many comedians.”\n\nFollow David Ng on Twitter @HeyItsDavidNg. Have a tip? Contact me at dng@breitbart.com", "description": "Stand-up comedian and actor Dave Chappelle took a stand for free speech on Sunday, defending the First Amendment as he accepted the prestigious Mark Twain Prize for American Humor, honoring achievements in the field of comedy.", "authors": ["David Ng"], "top_image": "https://media.breitbart.com/media/2019/10/Davechappelle1st1-640x335.jpg", "published_at": "2019-10-28"}