{"pub": "marketwatch", "url": "https://marketwatch.com/story/the-skyscraper-indicator-shows-were-near-a-market-top-2019-10-18", "downloaded_at": "2019-10-18 10:36:52.388515+00:00", "title": "The skyscraper indicator shows we’re near a market top", "language": "en", "text": "Christopher Furlong/Getty Images More than two dozen supertall skyscrapers are in development in New York City, potentially more than tripling the existing number.\n\nWhen stocks go to the moon, buildings head for the sky.\n\nHistorically, bull markets in stocks and real estate bubbles, especially in commercial property, go hand in hand. The same irrational exuberance that persuades mediocre stock investors that everything they touch turns to gold also infects developers who leverage themselves to the hilt with cheap money near the peak of a cycle.\n\nAnd the most visible indicator of that is the skyscraper.\n\nIn the past, the completion of record-high skyscrapers has been the proverbial bell that rings at the top of the market. Right now, massive construction of super-tall residential and commercial towers, especially in Manhattan, may be signaling the bull’s end is nigh.\n\nPeak hubris\n\nThe so-called “skyscraper indicator” isn’t perfect. Its timing can be off because of big buildings’ long development times. But it’s a stark symbol of peak hubris.\n\nThe first skyscrapers were built in the late 19th and early 20th centuries. The 1900s saw the Metropolitan Life Tower and Singer Building rise in Lower Manhattan before the Panic of 1907. The ornate Woolworth Building opened as the world’s tallest building a few years later.\n\nIt was soon eclipsed by the Chrysler Building, the Art Deco wonder that opened in 1928, followed by 40 Wall Street. The Empire State Building, which began construction before the 1929 stock market crash, finally opened in 1931 during the Great Depression.\n\nThat was just the antenna on the tip of the skyscraper, however.\n\n“New York built over 25 tall (over 70 meters high) buildings during each of the five years after 1926,” writes Harvard University economist Edward L. Glaeser in a paper on the subject. “In three of those years, New York built over 35 such buildings, a pace of new construction that the city has never repeated.” We’ll get to today’s building boom in a bit.\n\nIn 1973, the World Trade Center in Lower Manhattan supplanted the Empire State as the world’s tallest. Within months, the Sears Tower (now called the Willis Tower) in Chicago had seized that crown. The go-go bull market of the 1960s had pushed the Dow Jones Industrial Average DJIA, +0.09% to an all-time high of 1052 that January. The wrenching bear market that followed lasted almost two years and lopped off nearly half the S&P 500’s value.\n\nAsian financial crisis\n\nBy the 1990s, the skyscraper boom had moved overseas. The Petronas Towers in Kuala Lumpur, Malaysia, topped out just in time for the 1998 Asian financial crisis. Before that, Glaeser wrote, “real estate troubles preceded the full-blown crisis, and seem to have helped generate anxiety about the health of the financial sectors in [Asian] countries.”\n\nBurj Khalifa in Dubai opened at the tail end of the financial crisis. The Mount Everest of skyscrapers, it has 163 stories and rises over 2,700 feet above the ground. Just months before its early 2010 opening, the ruler of Abu Dhabi bailed out financially strapped Dubai and got his name on the building.\n\nThat brings us to today, when the animal spirits are again running wild. In San Francisco, Salesforce Inc. CRM, -0.54% , the hugely successful software company, has built the tallest skyscraper west of the Mississippi. It opened in 2018, a contrarian foreshadowing of this year’s failure of Silicon Valley unicorn IPOs like Uber UBER, +2.35% and Lyft LYFT, +2.86% and the spectacular collapse of WeWork, whose co-headquarters just happen to be in that same Salesforce Tower.\n\nMeanwhile, in Manhattan, it’s open season on empty skies.\n\nAccording to real estate site Curbed.com, 19 supertall skyscrapers have either been proposed or are under construction in Manhattan and downtown Brooklyn. Currently, there are only eight buildings in all of New York City that are tall enough to qualify as “supertall.”\n\nSome of the biggest players are involved, including Brookfield Asset Management BAM, +0.00% Vornado Realty Trust VNO, -0.49% , and privately owned Extell Development and Related Companies, controlled by Stephen Ross, the billionaire owner of the Miami Dolphins.\n\nOne of these supertall buildings is part of the massive $25 billion Hudson Yards complex on Manhattan’s West Side — maybe just in time for the next recession.\n\nSeveral of these new skyscrapers are pencil-thin towers selling multimillion-dollar apartments to the super-rich — including one three-penthouse combo that went for $91 million to a Chinese investor. The area around West 57th Street and Central Park South has been dubbed Billionaires’ Row and includes Central Park Tower, the world’s tallest residential building.\n\nUnsold luxury condos\n\nBut one-fourth of all new luxury condos built in New York since 2013 remain unsold. Uh-oh.\n\nIt’s a familiar story in real estate — splurge and purge — and although sentiment among stock investors is hardly euphoric, the massive excesses exposed by the latest skyscraper boom are setting up equities for a fall, too, after 10 years of gains and buckets of easy money offered by central banks.\n\nThis time is not different. Skyscrapers won’t fall to earth, but their values will, taking stock investors with them. The bell is ringing, my friends, and it’s tolling for thee and me.", "description": "When stocks go to the moon, buildings head for the sky.", "authors": ["Howard Gold"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT548_skyscr_ZG_20191017152355.jpg", "published_at": "2019-10-18"}