{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/18/food-scandal-fears-after-chinese-antibiotics-seized-at-uk-airport", "downloaded_at": "2019-10-19 11:09:44.263305+00:00", "title": "Food scandal fears after Chinese antibiotics seized at UK airport", "language": "en", "text": "Exclusive: drugs are suspected to have been heading for Northern Ireland poultry farm\n\nA large consignment of Chinese antibiotics suspected to be destined for unregulated use on a poultry farm in Northern Ireland has been seized at a British airport, raising fears of a new food scandal.\n\nThe Guardian has learned that medicine, believed to be the antibiotic amoxicillin, was intercepted at a British airport this week. Enforcement authorities in Northern Ireland were alerted and have begun an investigation into a large poultry farm company.\n\nThe Northern Ireland Department of Health said: “A multi-agency operation was carried out on Thursday in the County Tyrone area in pursuance of offences under the Human Medicines Regulations 2012 and the Veterinary Medicines Regulations 2013. A number of items were removed for examination. An investigation is ongoing.”\n\nThe Food Standards Agency said it had become involved in the investigation because the farm allegedly linked to the shipment reared meat.\n\nIt said: “We are aware of the operation led by the Department of Health’s medicine regulatory group and are working with the authorities involved in the investigation to ensure there is no risk to the food chain.”\n\nAmoxicillin is approved for use as a veterinary medicine in the UK. It is supposed to be administered only under veterinary supervision and only to sick animals. There are restrictions on its import.\n\nUsing antibiotics routinely as growth promoter in farm animals is illegal in the UK because it can lead to the development of germs that are resistant to even the strongest antibiotics used in human health.\n\nThe UK’s outgoing chief medical officer, Dame Sally Davies, has said antibiotic resistance is one of the biggest threats to human health. More antibiotics are used on farm animals around the world than on humans. In the UK, the poultry industry has reduced its use of antibiotics in recent years in a voluntary campaign.\n\nA source told the Guardian that the poultry farm in question was a large supplier to Moy Park, a chicken slaughtering and processing company that is the largest employer in Northern Ireland.\n\nMoy Park, which supplies most leading UK retailers with chicken, confirmed it was supplied by the facility but said it did not own it.\n\n“This matter is being investigated by the relevant authorities,” a Moy Park spokesperson said. “Any breach of the strict regulation on the use of veterinary medicine is unlawful and completely unacceptable to us.”\n\nThe company said it believed that the investigation involved “an isolated incident at an independently owned, contract supply farm”.\n\nThe incident comes at a particularly sensitive time after Brexit negotiations over health and customs checks for goods moving between Britain, Northern Ireland and Ireland. It is likely to raise fresh concern in Europe about the safety of food supplies after the UK leaves the EU.\n\nInvestigators will want to establish whether the company has previously imported unregulated medicine, and if so how it was used on the farm and whether poultry containing antibiotic residues has been entering the retail food chain for a long time.\n\nThe UK are required to notify the European commission about incidents that affect food safety so that a rapid alert can be issued across all EU countries. EU safety authorities said they were not yet aware of the incident.\n\nThe Police Service of Northern Ireland and the regional government’s agriculture department directed questions on the incident to the health department.\n\nIt is understood that steps have been taken to ensure that any poultry affected in the incident will not enter the food chain.", "description": "Exclusive: drugs are suspected to have been heading for Northern Ireland poultry farm", "authors": ["Felicity Lawrence", "Fiona Harvey"], "top_image": "https://i.guim.co.uk/img/media/7e64d5f937e8ab9c9f41ea230e33323f502efd70/0_239_5276_3166/master/5276.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f71df0f84bde7739f8e9db0bf4d5045c", "published_at": "2019-10-18"}