{"pub": "reuters", "url": "https://in.reuters.com/article/us-global-oil/oil-prices-fall-due-to-weak-economic-data-saudi-output-recovery-idINKBN1W906Q", "downloaded_at": "2019-09-24 15:21:16.376471+00:00", "title": "Oil prices fall due to weak economic data, Saudi output recovery", "language": "en", "text": "LONDON (Reuters) - Oil prices fell on Tuesday after weak manufacturing data from Europe and Japan focused market attention on a gloomy outlook for demand and as Saudi Arabia could restore oil output faster than anticipated following the attacks on its facilities.\n\nFILE PHOTO: Oil rigs are seen at Vaca Muerta shale oil and gas drilling, in the Patagonian province of Neuquen, Argentina January 21, 2019. REUTERS/Agustin Marcarian/File Photo\n\nBrent crude futures LCOc1 dropped 58 cents to $64.19 a barrel by 1339 GMT, after hitting a session low of $63.76. U.S. West Texas Intermediate futures CLc1 were at $58.15, down 49 cents.\n\n“Financial data was anything but encouraging yesterday,” said Tamas Varga of oil brokerage PVM, pointing to sluggish manufacturing numbers in leading European economies and Japan.\n\nReuters reported on Monday that Saudi Arabia had restored more than 75% of crude output lost after attacks on its oil installations and would return to full volumes by early next week.\n\nBut the Wall Street Journal said repairs at the plants could take months longer than anticipated.\n\n“There remains conflicting news coming out of Saudi Arabia, but an increasing number of reports pointing to Saudi Aramco purchasing external products and potentially also crude to meet its term commitments do not give the impression that an imminent return to full capacity is in sight,” consultancy JBC Energy said.\n\nState-run oil company Aramco has stepped up purchases of products such as naphtha, gasoline and diesel from Europe and elsewhere.\n\nStill, oil prices remain at comparatively elevated levels for the year in the wake of the Sept. 14 attack on Saudi Arabia’s largest oil-processing facility that halved output in the world’s top oil exporter.\n\nAn increase in U.S. oil exports to Asia to replace Saudi crude and a reduction in U.S. imports from Iraq meant crude inventories in the United States could be lower than expected, said Mike Tran, commodity strategist at RBC Capital Markets.\n\nEuropean powers - Britain, Germany and France - backed the United States in blaming Iran for the Saudi attack, urging Tehran to agree to new talks with world powers on its nuclear and missile programs and regional security.\n\nMeanwhile, a preliminary Reuters poll found on Monday that U.S. crude oil and distillate stockpiles were expected to have dropped last week. [EIA/S]\n\nSeven analysts estimated, on average, that crude inventories fell by 800,000 barrels in the week to Sept. 20.\n\nThe poll was conducted ahead of inventory reports from the American Petroleum Institute, an industry group, to be released on Tuesday and from the U.S. government’s Energy Information Administration on Wednesday.", "description": "Oil prices fell on Tuesday after weak manufacturing data from Europe and Japan focused market attention on a gloomy outlook for demand and as Saudi Arabia could restore oil output faster than anticipated following the attacks on its facilities.", "authors": ["Ahmad Ghaddar", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190924&t=2&i=1433163065&w=1200&r=LYNXMPEF8N053", "published_at": "2019-09-24"}