{"pub": "guardian", "url": "https://theguardian.com/lifeandstyle/2019/oct/30/jackie-middletons-midweek-recipe-hummus-bowl-with-salmon-and-avocado", "downloaded_at": "2019-10-30 02:25:08.826780+00:00", "title": "Jackie Middleton's midweek recipe: hummus bowl with salmon and avocado", "language": "en", "text": "Whichever way you want to tag it, ‘nourish’, ‘poke’ or ‘buddha’ bowls are an easy way to put bits and pieces together, fast\n\nHummus bowls are a variation of the cafe staple, that as the name suggests use hummus as the base instead of brown rice or other grains. Then all the various bits and pieces are piled artfully (or not!) on top. The hummus acts as a sauce and binding flavour to turn a collection of bits into a nutritionally considered meal. The vegetable components add extra flavours – and extra textures – to help collect up the hummus as you eat.\n\nI like to make my own hummus with chickpeas that are pre-soaked. To me the brighter, fresher flavour is totally worth the extra step.\n\nOf course, you can substitute with store-bought hummus and hot-smoked salmon if that means dinner prep is one extra activity you can strike off your to-do list on a busy day.\n\nWhat would a ‘climate diet’ look like in Australia? Read more\n\nHummus bowl with salmon, avocado, kale and zucchini\n\nPrep 20 minutes\n\nCook 30 minutes (if you’re making the hummus and salmon from scratch)\n\nServes 4\n\n2 x 320g thick fillets salmon, cooked or hot-smoked\n\n500g hummus, and some extra chickpeas to garnish\n\n1 bunch curly kale, stripped from the stalks\n\n2 medium zucchinis\n\n2 small ripe avocados\n\nDukkah, to dip the avocado in Fresh herbs; mint, coriander, parsley (or whatever you have on hand)\n\nRed chilli, thinly sliced\n\nPomegranate seeds, fresh or frozen\n\n1 lemon\n\nExtra-virgin olive oil\n\nTo make the bowls\n\nMake the hummus and salmon (see below), or buy best available options at your local store.\n\nBoil the kettle and pour boiling water over the stripped kale leaves in a large bowl, blanching them and turning them softer and bright green. Immediately remove from the hot water and cool on a clean tea towel.\n\nShave the zucchinis lengthways with a potato peeler or guillotine on a fine setting. Toss them in a bowl with sea salt, olive oil, a squeeze of lemon, herbs and the chilli. Leave to sit as the salmon cooks for 10 minutes or so.\n\nCut open the avocados and remove the seed, then dip the cut side into some dukkah sprinkled on a plate.\n\nSpread a thick pool of hummus on the base of the bowl or plate – a few good tablespoons. On one side, place a handful of blanched kale. Cut the cooked and rested fillets of salmon lengthways and lay cut-side up across the plate. Twist some strips of the zucchini, chilli and herbs to help create some texture and visual interest. Place the dukkah-dipped avocado halves.\n\nGarnish the hummus with extra chickpeas and the pomegranate seeds. Generously season the entire plate with sea salt, olive oil and lots of lemon juice. Serve with some pita bread to dip, or fill a pocket to combine all the flavours into a single bite.\n\nTo make the salmon\n\nSalmon fillets are typically too large for us to eat a whole one, so I started buying extra-large fillets to share between two.\n\nWhen picking your salmon, go for the thicker centre fillets rather than the tails – they are so much easier to cook evenly.\n\nYotam Ottolenghi’s asparagus recipes Read more\n\nHeat the oven to 200C.\n\nTear off squares of aluminium foil – one per fillet – and place each fillet, skin-side up, individually on to the square. Drizzle with olive oil and a decent pinch of sea salt. Fold the edges up, over the top of the salmon, folding them in to create a tight, cosy sealed package.\n\nRoast on a flat tray in the preheated oven – depending on the size, it will take 10-12 minutes. To check the fish, remove from the oven and listen for sizzling inside the foil – that means it’s done. If it’s not sizzling, return to the oven for another two minutes then check again. Allow to rest without opening the foil for five minutes before opening to serve.\n\nYou can keep extra serves in the unopened foil in the fridge for up to five days.\n\nTo make the hummus\n\nA little hack I’ve been doing for a few years now is to soak a kilo-or-more batch of chickpeas overnight, drain them and then store them in a ziplock bag in the freezer, for whenever I might need them. They cook from frozen in 15-20 minutes and then once they’re warm, they blend up easily into fluffier hummus.\n\nI started adding hazelnuts to my hummus as I didn’t have tahini on hand, then loved the sweet, nutty flavour so much it stuck as my go-to recipe.\n\nThis makes a large batch of hummus but it will happily sit in your fridge for at least five days for a quick snack with veggie sticks or for use in sandwiches or wraps.\n\n350g chickpeas, soaked overnight in three times the volume of water, or 700g drained tinned chickpeas\n\n2 roast garlic cloves, roast in their paper skins with the hazelnuts\n\n300ml olive oil\n\n20g sesame seeds\n\n50g hazelnuts, roast for 10 minutes then rub the skins off with a clean tea towel\n\n1 lemon, juice and zest\n\n7g sea salt\n\n200ml chickpea cooking water or just tap water\n\nCook the soaked chickpeas in rapidly boiling water for 15-20 minutes until tender. Drain and reserve 200ml of cooking water. Weigh out 700g of the warm, cooked chickpeas. Stash some chickpeas away to garnish with. Blend all ingredients, except cooking water, until very smooth. A bowl blender or a stick blender will do the job. Finish by slowly adding in the cooking water until the texture is thick and full.\n\nFor later in the week ...\n\nCook an extra portion or two of salmon in the foil parcels, leave undisturbed in the foil and refrigerate. Then:", "description": "Whichever way you want to tag it, ‘nourish’, ‘poke’ or ‘buddha’ bowls are an easy way to put bits and pieces together, fast", "authors": ["Jackie Middleton"], "top_image": "https://i.guim.co.uk/img/media/6db877219de10c7a9a48beb31686b380741608d2/1_0_2309_1386/master/2309.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2bc9bbc37125d9b9d980fe75429e21e5", "published_at": "2019-10-30"}