{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/dc-politics/in-wealthy-dc-areas-praise-and-pans-for-mayors-call-to-increase-affordable-housing/2019/10/15/3ed6f384-ef5b-11e9-b648-76bcf86eb67e_story.html", "downloaded_at": "2019-10-15 23:08:56.450348+00:00", "title": "In wealthy D.C. areas, praise and pans for mayor’s call to increase affordable housing", "language": "en", "text": "But they cautioned it’s easier to support the Democratic mayor’s plan in principle than specific projects, programs or zoning changes that would make it a reality.\n\nBowser on Tuesday formally announced a plan to build 12,000 new affordable housing units by 2025, with specific targets for different areas aimed at spreading subsidized housing more evenly across a city that is largely divided by class.\n\nAD\n\nAD\n\nOne of the most affluent sections of the city, a swath officials call Rock Creek West, now home to fewer than 500 units, would get the largest number of new units, about 2,000. Meanwhile, one of the poorest parts of D.C., a section city officials call Far Northeast and Southeast, now has 15,760 units and would get an additional 490 under the mayor’s plan.\n\nOfficials did not detail how they would meet those goals, including what kind of housing would be needed, how it would be created and what it would cost taxpayers.\n\n“It’s all about where you are putting it,” said Council member Mary M. Cheh (D-Ward 3), whose Northwest district would see some of the sharpest increases in affordable housing under the mayor’s plan. “If we decided to do what’s sensible to have this largely around transit and it doesn’t threaten the single-family homes, then I think you’ll have support. But if on the other hand it overcomes single-family residences, you’ll get a lot of pushback.”\n\nAD\n\nAD\n\nSome advocates have urged eliminating single-family zoning in American cities as a way to increase housing supply. But critics say that would change the character of neighborhoods, drive out some residents and harm real estate values and the related tax base.\n\nThe Bowser administration also released changes to the city’s 1,600-page comprehensive plan — a blueprint for development and how the city uses land — that would affects what kind of housing can be built in different neighborhoods.\n\nChristopher B. Leinberger, professor and chair of the Center for Real Estate and Urban Analysis at George Washington University School of Business, said opposition from residents resisting change in their neighborhoods posed the biggest challenge to the mayor’s proposal.\n\nAD\n\n“These are people who are in the top 10 percent of income earners and wealth in our society who are saying, ‘We got it, you can’t share it,’ ” said Leinberger.\n\nAD\n\nSome residents said they resent being labeled as bigots for resisting an influx of affordable housing that could transform their communities.\n\n“I would love to live in Beverly Hills, but I haven’t earned enough money to do so and I’m not asking anyone to give me a voucher or a way in,” said Santiago, a 39-year-old homeowner in Chevy Chase who asked that his last name not be published because of fear of professional repercussions.\n\nHe saved money to buy his house after spending five years in Shaw, in part to escape violence in the gentrifying neighborhood. And he resented the mayor’s recent comments that she would try to make opponents feel “shameful.” Concerns that new housing would bring traffic and crowding in schools are valid, he said.\n\nAD\n\n“It’s easy to say, ‘I don’t want these people, they bring crime, they bring drugs, they bring troubles,’ and it’s not necessarily true,” he said. “But it’s also equally easy to say, ‘You are just a NIMBY’ [not in my backyard] or ‘You are a veiled racist or socioeconomic elitist.’ The truth is somewhere in the middle.”\n\nAD\n\nBowser took a softer tone Tuesday at a news conference.\n\n“This is not a way to attack one group of people over the other,” said Bowser. “Will there be tough conversations? For sure. But will we have a fairer and more just city at the end? For sure.”\n\nResidents interviewed Tuesday in neighborhoods west of Rock Creek Park were largely supportive.\n\nAD\n\n“We are a very isolated, privileged area,” E. Laura Golberg said while strolling through her Friendship Heights neighborhood, where she has lived since 1983.\n\nThe 71-year-old thinks it’s a matter of “simple fairness” for affordable housing to be available in wealthy neighborhoods, especially given a legacy of racism that shut out generations of African Americans and concentrated subsidized housing east of the Anacostia River.\n\nJohn Dinges moved from Mount Pleasant to American University Park in the early ’90s in pursuit of better schools and a bigger house. He said others deserve the same opportunity.\n\nAD\n\n“I grew up in the Midwest and everyone from the poorest to the well-off saw each other all the time, went to church together and sent their kids to the same schools,” said Dinges, a 77-year-old retired journalist, in an interview on his front lawn. “That’s the formula for a successful society.”\n\nAD\n\nThe city defines “affordable” housing as costing less than 30 percent of a household’s income, for households earning no more than 80 percent of the Washington area’s median family income. That translates to maximum monthly rent of $2,460 for a three-bedroom unit for a family of four with annual income of less than $97,050, and maximum $1,640 for a studio for a single person earning less than $67,950.\n\nThat said, a large majority of households in subsidized housing earn no more than 60 percent of the region’s median family income. For those households, “affordable” means maximum rent of $1,840 a month for three bedrooms for a family of four earning less than $72,787 a year, and a maximum of $1,230 a month for a studio for a person earning less than $50,962 annually.\n\nAD\n\nDavid Bowers, vice president of Enterprise Community Partners, a national affordable housing organization, described the mayor’s plan as “fair and reasonable” but “difficult to implement” because of political opposition and cost.\n\nAD\n\n“This will be a gut check for our city,” said Bowers, who also is one of the co-conveners of the Housing Leaders Group of Greater Washington, a coalition of affordable housing groups. “The rubber is going to hit the road in how neighbors respond, how government officials encourage them. The other piece is going to be that dollar amount. How much is this going to cost? At the end of the day, there are going to have to be subsidy dollars.”\n\nThe District’s primary tool for subsidizing affordable housing is the Housing Production Trust Fund, which provides loans and grants to developers to create low-cost housing for eligible residents. The city also issues housing vouchers to help low-income residents pay rent in market-rate housing.\n\nAD\n\nSome areas of the city lack the space for additional development.\n\nAD\n\nThe Capitol Hill area, for example, is slated for 1,400 new units, nearly doubling the existing 1,820 units, under the mayor’s plan. But the area has a large historic district where zoning restrictions make it difficult to add units to buildings. Large-scale projects have also been contentious in an area known for small rowhouses.\n\n“We’ve had enough high-rise condo buildings go up in last couple of years, and they are always controversial,” said Kirsten Oldenburg, an elected neighborhood commissioner in the area who supports the mayor’s targets. “I don’t know how you get 1,400 units without building multiple story buildings … and we don’t have a lot of land available on Capitol Hill.”", "description": "D.C. Mayor Muriel Bowser wants new affordable units spread out across the city", "authors": ["Fenit Nirappil", "Reporter Covering D.C. Government", "Robert Mccartney", "Senior Regional Correspondent Covering Government"], "top_image": "https://www.washingtonpost.com/resizer/tsLKZz-Ifcapk8bsiN2jHIGg2AQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3CCYKLEUQQI6TFLKRDBJDK24HA.jpg", "published_at": "2019-10-15"}