{"pub": "fox", "url": "https://foxnews.com/politics/dianne-feinstein-endorses-joe-biden-presidential-kamala-harris", "downloaded_at": "2019-10-09 00:55:22.669141+00:00", "title": "Dianne Feinstein endorses Joe Biden's presidential bid in snub to Kamala Harris", "language": "en", "text": "Sen. Dianne Feinstein, D-Calif., announced Tuesday she is endorsing former Vice President Joe Biden in the 2020 Democratic presidential primary -- choosing her former longtime Senate colleague over Kamala Harris, her fellow California Democratic senator.\n\nFeinstein’s endorsement, the first major Democratic endorsement by a top legislator this campaign season, comes as Biden has been losing ground in the polls in the wake of the impeachment inquiry into President Trump and a series of high-profile gaffes while on the stump. But the longtime California senator praised the former vice president for his long tenure in Washington and his work on gun control.\n\n“I’ve worked closely with Vice President Biden and I’ve seen firsthand his legislative ability, his statesmanship, and most importantly his moral fortitude,” Feinstein said in a statement. “During his time in Congress and in the White House, Joe Biden has been a tireless fighter for hard-working American families.”\n\nSTAGE IS SET FOR RECORD-BREAKING DEMOCRATIC 2020 DEBATE\n\nShe added: “By making gun reform one of the pillars of his campaign and policy platform, Joe Biden demonstrates that he clearly recognizes what is needed to keep Americans safe. And I know, as president, he will continue the fight to restore the soul of the nation from the Oval Office.”\n\nFeinstein’s endorsement of Biden may seem like a snub to Harris – a first-term senator and former California attorney general – but it hardly comes out of left field, as just last week she held a fundraiser for the former vice president in her home in San Francisco. Also back in January – following Biden’s campaign launch – Feinstein said that “he brings a level of experience and seniority which I think is really important,\" according to the San Francisco Chronicle.\n\nThe endorsement from Feinstein – a longtime liberal lawmaker who was first elected in 1992 – comes as Biden is struggling to hold on to his role as Democratic frontrunner. An average of recent polls compiled by Real Clear Politics has Biden and Massachusetts Sen. Elizabeth Warren virtually tied at the top of the Democratic race.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nWarren, however, has surged in recent months in the polls, while Biden has dropped, and far surpassed him during the most recent quarter of fundraising.\n\nHarris, meanwhile, sits in a distant fifth in the Real Clear Politics average, behind Vermont Sen. Bernie Sanders and South Bend, Ind. Mayor Pete Buttigieg.", "description": "Sen. Dianne Feinstein, D-Calif., announced Tuesday she is endorsing former Vice President Joe Biden in the 2020 Democratic presidential primary -- choosing her former longtime Senate colleague over Kamala Harris, her fellow California Democratic senator.", "authors": ["Andrew O'Reilly"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2018/09/30/694940094001_5842530459001_5842529669001-vs.jpg", "published_at": "2019-10-08"}