{"pub": "theverge", "url": "https://theverge.com/2019/9/16/20868511/microsoft-mixer-first-ads-revenue-share-creators", "downloaded_at": "2019-10-05 13:16:28.252819+00:00", "title": "Twitch competitor Mixer adds ads, but it might be keeping the revenue for itself", "language": "en", "text": "Mixer, Microsoft’s answer to Twitch, has just rolled out its first ads, but it appears the only entity earning money from the ads will be Mixer itself. Some of the ads will show up on channels run by Microsoft itself — but other partnered channels, like Ninja’s, will now see ads appear in front of their content that don’t support them financially.\n\nMixer announced the move last Friday on its “Level Up Cast,” a weekly show about what’s happening on the platform. Ads were always part of the plan, said Mixer community manager Andy Salisbury and guest host Ethan Rothamel. People who have Mixer’s premium monthly subscription offering Pro won’t see the ads, they said, and neither will people who have subscribed to a partnered channel.\n\nI get it: ads are not the most fun thing in the world to deal with\n\nFor now, only Mixer is making ad revenue — at least according to Rothamel — although he did take pains to say that ads are ultimately meant to support creators, too. (It seems that the company is still figuring out how to integrate earned ad revenue with its partnered accounts.) “I get it: ads are not the most fun thing in the world to deal with, but it’s super important to remember what you’re doing on the site,” said Rothamel. “The site is free, you’re watching content for free, and you’re supporting partners.”\n\nWhen reached for comment, a Microsoft spokesperson provided a statement: “We are always testing and exploring new features and monetization options for Mixer creators, but have nothing more to share at this time.” Microsoft wouldn’t confirm whether its creators will receive any revenue from the ads it runs on their channels. Later, a spokesperson for company clarified that they planned to introduce a formal revenue share with Mixer creators when the program is rolled out more broadly. “For now, the revenue we are receiving during our pilot advertising test is funding other programs that benefit creators directly,” writes a Microsoft spokesperson.\n\nTwitch, Mixer’s bigger competitor, also has ads that support the company and its partners, but there’s a disclosure on each ad that says exactly where any revenue is going. If Mixer chooses to do the same, they’ll become even more similar to their larger competitor — which is not itself a bad thing. If both platforms explain where the money goes, it will create and reinforce a set of payment norms in live-streaming; which is important, because companies and the streamers they host are still working out the boundaries of what’s acceptable to broadcast.\n\nUpdate September 18th, 11:45AM ET: Added a new comment from a Microsoft spokesperson.", "description": "Mixer, Microsoft’s answer to Twitch, has just rolled out its first ads. They’ll run on the channels the company owns, and channels that have partnered with Mixer. For now, it appears the only entity getting money from the ads is Mixer itself.", "authors": ["Bijan Stephen", "Sep", "Illustration Alex Castro"], "top_image": "https://cdn.vox-cdn.com/thumbor/yZNsaA4S3qAI_6ZXu5zoNtmVXcY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19205194/acastro_190916_1777_mixer_0001.jpg", "published_at": "2019-09-16"}