{"pub": "indiatimes", "url": "https://indiatimes.com/news/india/over-2100-people-have-died-in-floods-so-far-this-year-in-india-and-toll-may-still-rise-377484.html", "downloaded_at": "2019-10-10 06:17:47.835120+00:00", "title": "floods in india:More Than 2100 People Have Died In Floods This Year Already In India And The Toll Is Still Increasing", "language": "en", "text": "More Than 2100 People Have Died In Floods This Year Already In India And The Toll Is Still Increasing\n\nMore Than 2100 People Have Died In Floods This Year Already In India And The Toll Is Still Increasing\n\nReports of devastating floods striking different parts of the country have been rising at an alarming rate in the recent past. From Maharashtra to Bihar and West Bengal to Kerala, life and economy had been crippled down as water-levels rose to unexpected heights due to incessant rain.\n\nNow, as per the information disclosed by the Union Home Ministry, more than 2,100 people have died and 46 are missing after heavy rain this monsoon season.\n\nThe maximum number of people--399--died in Maharashtra, followed by West Bengal where 277 people have died in floods.\n\nAccording to the officials, 738 people were injured and nearly 20,000 animals were lost. The heavy rains and floods fully damaged 1.09 lakh houses, partially damaged 2.05 lakh houses and destroyed 14.14 lakh hectares of crops.\n\nDon't Miss 151 SHARES 1.5 K SHARES 115 SHARES 15.9 K SHARES\n\nDuring the four-month monsoon period, India recorded the highest rainfall since 1994, according to the India Meteorological Department.\n\nIn Maharashtra, where 22 districts were hit by floods, 399 people died, 369 were injured and 7.19 lakh people were forced to seek shelter in 305 relief camps.\n\nThe monsoon rains and floods hit 22 districts in West Bengal, where 227 people lost their lives, 37 received injuries, four were reported missing and 43,433 took shelter in 280 relief camps.\n\nIn Bihar, 166 people died and nearly 1.96 lakh were moved to relief camps following the deluge that hit 28 districts in the state.\n\nA total of 182 people were killed, 38 were injured and seven have gone missing in Madhya Pradesh, where 32,996 people took shelter in 98 relief camps set up in 38 districts.\n\nIn Kerala, heavy rains and floods claimed 181 lives and injured 72. Fifteen people were reported missing in 13 districts. As many as 4.46 lakh people in the state took shelter in 2,227 relief camps.\n\nTwenty-two districts in Gujarat were hit during the monsoon season where 169 people died , 17 received injuries while 17,783 people took shelter in 102 relief camps.\n\nIn Karnataka, 106 people lost their lives, 14 received injuries and six were missing due to rains and floods in 13 districts. As many as 2.48 lakh people took shelter in 3,233 relief camps.\n\nThe rains and floods claimed 97 lives in Assam, where 32 districts were hit by the deluge that resulted in 5.35 lakh people taking shelter in 1,357 relief camps.\n\nThese statistics paint a grim picture of the existing realities and points out that India has a national emergency which it must tackle on a long-term basis rather than temporary solutions which have yielded little results over the past decades.\n\n(With PTI Inputs)\n\nFEATURED IMAGE CREDIT: AFP", "description": "Reports of devastating floods striking different parts of the country have been rising at an alarming rate in the recent past. From Maharashtra to Bihar and West Bengal to Kerala, life and economy had been crippled down as water-levels rose to unexpected heights due to incessant rain.", "authors": ["Saket Suman"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/flood_1570686530_800x420.jpg", "published_at": "2019-10-10"}