{"pub": "huffpost", "url": "https://huffpost.com/entry/alexandria-ocasio-cortez-life-in-spotlight-meghan-markle_n_5db06fb4e4b0d5b789447f54", "downloaded_at": "2019-10-23 16:35:39.147182+00:00", "title": "Alexandria Ocasio-Cortez On Fame: ‘Sometimes I Just Want To Be A Human Being’", "language": "en", "text": "MANDEL NGAN/Getty Images Rep. Alexandria Ocasio-Cortez (D-N.Y.) listens as Facebook CEO Mark Zuckerberg testifies in the House on Tuesday. An upset primary win in June 2018 made her a sudden star.\n\nFew U.S. politicians have been thrust into the spotlight as suddenly as Rep. Alexandria Ocasio-Cortez (D-N.Y.). She went from a little-known 28-year-old bartender running against a well-connected incumbent to a national powerhouse whose every move is scrutinized.\n\nAnd it hasn’t always been easy.\n\n“Sometimes I just want to be a human being. And you don’t get to be a human any more,” she told HuffPost in an interview Tuesday. “Everything you do from wearing sweatpants to the bodega to getting a haircut ― every personal decision you make for yourself is never going to be yours any more.”\n\nOcasio-Cortez tweeted about dealing with fame on Friday, in response to an emotional interview Meghan Markle gave on British television. The American-born duchess of Sussex revealed the toll that being in the public eye has taken on her in the immediate aftermath of her pregnancy, prompting Ocasio-Cortez to share something unrelated to politics with her 5.5 million Twitter followers.\n\n“Sudden prominence is a very dehumanizing experience. There’s a part of your life that you lose, & it later dawns on you that you’ll never get it back,” she tweeted. “The people who treat you like a human make all the difference.”\n\nOcasio-Cortez told HuffPost that she spoke up about Markle’s challenges because she’s made her own traumatic leap into the media limelight.\n\n“I feel an enormous amount of empathy for her, because it requires an enormous amount of tools to be resilient ― and also to stay human in that.”\n\n“There’s a lot of people that are going to say ‘oh, boo-hoo,’ but I feel for her,” she said. “I really feel for her.”\n\nOcasio-Cortez said that the experience of rocketing into stardom after her June 2018 primary win was “right up there with my family almost getting foreclosed on ― one of the most stressful experiences ever,” comparing the experience to her family’s trouble holding onto their home after her father died when she was 18.\n\nOcasio-Cortez thought that the constant media attention ― and recognition on the streets that has accompanied it ― would die down after the 2018 primary, or the general election, or after she was sworn in. But she’s since accepted that she won’t be able to enjoy the privacy she previously had, both because of the scrutiny she is under and the potential security threats she faces.\n\n“You kind of grieve for that. It has its highs and it has its lows,” she said. “A lot of people look at the highs, but sometimes it feels like you got a tattoo on your face that you didn’t ask for. It’s hard. It’s very hard. Sometimes you just want to get a drink or eat a hamburger.”\n\nAt the same time, Ocasio-Cortez said she has to balance the need to protect herself with the need to be present for her constituents.\n\n“I can’t afford to be hidden away. In order for me to do my job, I need to be connected to people,” she said. “My job is to love people. And that’s very difficult sometimes given the amount of barriers.”\n\nOf course, Ocasio-Cortez’s particular experience is atypical for new members of Congress. She was a server and bartender in Manhattan when she beat Joseph Crowley, who had held the seat for two decades and was chairman of the House Democratic Caucus. She went on to become the youngest-ever woman elected to Congress. Thanks to the circumstances of her victory and her gift for communication, Ocasio-Cortez has become a media superstar — adored by many liberals and obsessively, negatively covered by Fox News.\n\nOcasio-Cortez told HuffPost that her family and friends, particularly those who knew her before she was famous, help her stay “grounded.”\n\nIn particular, her friends from the restaurant industry “are the people that I enjoy spending time with, because they knew me when no one cared who I was,” she said. “They let me know if they think I’m wrong or if they want to ask me a question.”", "description": "A supportive tweet about Meghan Markle reflected Ocasio-Cortez's deep sense of empathy about life in the spotlight.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5db070dc200000b422506913.jpeg?ops=1778_1000", "published_at": "2019-10-23"}