{"pub": "afr", "url": "https://afr.com/companies/financial-services/asic-investigating-saadat-s-leap-to-afterpay-20191023-p533nw", "downloaded_at": "2019-10-23 14:57:44.122379+00:00", "title": "ASIC investigating Saadat's leap to Afterpay", "language": "en", "text": "The ASIC chairman said he was worried that his comments could \"potentially prejudice the impartial adjudication of a matter that is currently under review\".\n\nWhen Senator McAllister insisted, he spoke about the matter in broad terms.\n\n\"We are reviewing engagements internally, we are also looking at expectations expressed by our rules, guidelines and legislation, and we're trying to marry up our internal guidelines and those imposed upon us by legislation with the facts as we know them,\" Mr Shipton said.\n\n\"That process is still under way. We are still in the process of adjudicating and determining and, if I may, I'd like to leave it at that but with an assurance ... that the facts and circumstances have triggered an inquiry and an inquiry is under way.\n\n\"We are conducting it in the appropriate manner and it is being handled and coordinated by, amongst others, our general counsel, our people and development team and I am also involved.\"\n\nSenator McAllister asked Mr Shipton to take three further questions on notice, including whether Mr Saadat had had access to sensitive regulatory information.\n\n\"Mr Saadat was involved in high-level decision-making about regulatory policy and I wish to understand the protections that were in place during his employment in relation to his obligations to keep that information confidential,\" she said.\n\nSenator McAllister also wanted to know about Mr Saadat's access to commercially sensitive information.\n\n\"Mr Saadat was helping lay the development of the position on the buy now, pay later sector and there were industry consultations as part of that process,\" she said.\n\n\"I'd like to understand whether Mr Saadat would have been given access to commercially sensitive information about buy now, pay later sector competitors.\"\n\nThe third question was about whether Mr Saadat was engaged in conversations about employment with Afterpay when he previously gave evidence to the Senate committee about the buy now, pay later sector.", "description": "The corporate regulator is investigating the circumstances surrounding the move by one of its former executives, Michael Saadat, to buy now, pay later provider Afterpay.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.6255%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_1053%2C$y_129/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/cf395362882c22287f0acb4dd1f83daee132435d", "published_at": "2019-10-23"}