{"pub": "breitbart", "url": "https://breitbart.com/news/indian-tiger-poacher-with-bear-penis-fetish-arrested", "downloaded_at": "2019-10-22 13:34:50.124085+00:00", "title": "Indian tiger poacher with ‘bear penis fetish’ arrested", "language": "en", "text": "New Delhi (AFP) – One of India’s most wanted tiger poachers, who also had a fetish for eating the penis of sloth bears, has been arrested after being on the run for six years, officials said.\n\nWildlife officials in the central state of Madhya Pradesh formed a special task force in 2013 after several sloth carcasses were found with their reproductive organs missing.\n\nThe man arrested, named as Yarlen, belongs to a community that believes the penis of a sloth bear — listed as “vulnerable” on the IUCN Red list — can cure ills including impotency.\n\nAccording to the Times of India, he admitted to police killing several tigers, many sloth bears, hundreds of wild boar and peacocks.\n\nAn official from the forest department in Madhya Pradesh told AFP that he would sell the gall bladders of the bears, which are also believed to have special properties, on orders of businessmen across India.\n\n“He’s jumped bail earlier and fudged documents. Over the years, he has taken on several names as well, the latest being Jasrat,” the official said.\n\nHe is also being investigated for the killing of a tigress that went missing in the Pench Reserve in Madhya Pradesh in 2012, the official told AFP.\n\nA year later, the animal’s hide was found 1,500 kilometres (1,000 miles) away in Nepal.\n\nIndia is home to almost 75 percent of the world’s tigers and has at present 2,967 of the big cats. According to government data, Madhya Pradesh tops the list with more than 500 of them.\n\nIndia is also among the 12 countries that committed to doubling the tiger population by 2022, according to the World Wildlife Foundation’s TX2 programme.\n\nPrime Minister Narendra Modi, while releasing the 2018 tiger census earlier this year, said India had achieved its target four years in advance.", "description": "New Delhi (AFP) – One of India’s most wanted tiger poachers, who also had a fetish for eating the penis of sloth bears, has been arrested", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/22/ed7bea_india-is-home-75-percent-world-tigers-has-present-967-big-cats-indian-tiger-640x335.jpg", "published_at": "2019-10-22"}