{"pub": "yahoo", "url": "https://news.yahoo.com/here-are-the-markets-where-the-average-wage-earner-cant-afford-housing-184218571.html", "downloaded_at": "2019-10-06 11:33:47.812891+00:00", "title": "Here are the markets where the average wage earner can't afford housing", "language": "en", "text": "If you’re an average wage earning worker shopping for a new home, then you may not find one in your price range. That’s according to the latest U.S. Home Affordability Report from ATTOM Data Solutions. The report found that in 74% of the country's housing markets, the average worker could not afford a median-priced home in the third quarter of 2019.\n\nThe most populated counties where a median-priced home was unaffordable for average wage earners included Los Angeles County, CA; Cook County (Chicago), IL; Maricopa County (Phoenix), AZ; San Diego County, CA and Orange County, CA. Those same counties were in the top five in Q2 2019.\n\n“The last three and a half years, we've seen this same story, really,” chief product officer Todd Teta told Yahoo Finance’s The Final Round. “Just one quarter where affordability got better, and so largely just getting worse.”\n\nThe report determined affordability by calculating the amount of income needed to make monthly house payments — including mortgage, property taxes and insurance — on a median-priced home, assuming a 3% down payment and a 28% maximum “front-end” debt-to-income ratio. That required income was then compared to annualized average weekly wage data from the Bureau of Labor Statistics.\n\nMore affordable markets\n\nThere are some markets in the country with more affordable housing. The 127 counties (26 percent of the 498 counties analyzed in the report) where a median-priced home in the third quarter of 2019 was still affordable for average wage earners included Harris County (Houston), TX; Wayne County (Detroit), MI; Philadelphia County, PA; Cuyahoga County (Cleveland), OH; and Allegheny County (Pittsburgh), PA.\n\nTeta also noted that mortgage rates remain low compared to last year. “That really held affordability in check, whereas just looking at prices going up so much would have really been less affordable,” he said.\n\nWhile there are many factors that contribute housing affordability, Teta noted longer-term mortgages could make home ownership more tangible for some. “One thing we're starting to see and track a little bit more is the lengthening of a mortgage product, not necessarily a 30-year product, but maybe a 40-year product. That's been talked about for decades, but you're starting to see that come back in the mix. And obviously, that creates some affordability. If you think about a five-year car loan becoming a seven-year car loan, it's the same dynamic. You're spreading the payments on the one year, making it more affordable.”\n\nMarabia Smith is a producer for Yahoo Finance The Final Round. Follow her on Twitter @MarabianNights\n\nRead the latest financial and business news from Yahoo Finance\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.\n\nMore from Marabia:\n\nFor Hispanic American Heritage Month, LATV is celebrating LatinX content 'of the now'\n\nNothing 'has dented Republican resolve to create a firewall in the Senate': Eurasia Group", "description": "The latest Q3 U.S. Home Affordability Report shows how unaffordable median-priced housing is in some parts of the country.", "authors": ["Marabia Smith"], "top_image": "https://s.yimg.com/uu/api/res/1.2/gB7brYrQe5zo_6Utx_WJtA--~B/aD0zNDA1O3c9NTEwODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/552493f0-e630-11e9-bf53-143e7190ddb8", "published_at": "2019-10-04"}