{"pub": "theverge", "url": "https://theverge.com/2019/10/16/20917268/apple-arcade-tangle-tower-localization-translation", "downloaded_at": "2019-10-16 20:48:42.762863+00:00", "title": "How Apple Arcade mystery Tangle Tower was translated into more than a dozen languages", "language": "en", "text": "When Apple Arcade launched last month, it included a lineup of more than 70 games, with a number of standout hits like Card of Darkness and Sayonara Wild Hearts. For players, it was a great deal: $4.99 a month for interesting new releases from some of the most exciting game developers around. But there’s another notable aspect of Apple Arcade beyond the scale and quality of the games. One of Apple’s requirements is that titles on Arcade must be available in more than 14 languages, which opens up these experiences to often-ignored markets and languages. It might just have been the biggest launch in terms of supported languages in video game history.\n\nThe process of localizing for so many languages isn’t necessarily a big deal for games that have minimal text, like a simple puzzle game, but it turned out to be a huge undertaking for the two-person team behind the charming detective game Tangle Tower. The game, developed by a four-person team led by brothers Tom and Adam Vian, has more than 40,000 words of in-game text, from character descriptions to the copious dialogue. The brothers had originally planned to localize the game into only a handful of languages — including English, French, Italian, German, Spanish, and Japanese — but, due to Apple’s requirements, Tangle Tower ended up launching in 17 languages. The pair says it was worth the effort. “It’s definitely worth the time and money if you can afford it,” Adam tells The Verge.\n\nDevelopment on Tangle Tower actually started years ago, but it was put on pause when the small studio partnered with Nintendo on Snipperclips, an adorable puzzle game that was one of a small number of Switch launch titles. (“When Nintendo says ‘Come make a game with us,’ you drop everything and do that,” Tom says.) But once that game and its expansion launched, the pair turned their attention back to their detective game concept. The first steps into localizing were fairly rudimentary. “I literally took Adam’s [UK] English script, turned my Excel language to US English, and said ‘Okay, tell me where there are spelling mistakes,’” Tom explains. But when they eventually got in touch with Apple about the possibility of bringing Tangle Tower to Arcade, the studio realized they needed some help.\n\nLuckily, Tom had received a cold email from a company called Universally Speaking, which specializes in video game localization. It’s the kind of message he’d typically ignore, but it happened to come at just the right time. “It was a very good cold email,” he says.\n\n“It is critical that the translation is seen in context.”\n\nThe localization process at Universally Speaking is split into two parts: localization and testing. First, someone translates the script. Then, a native speaker actually plays through the translated version of the game to make sure everything worked in context. This was an especially important aspect for a game like Tangle Tower where a mistranslated clue could leave players completely stuck. “This game is hard to localize because a) it’s got a million words in it, and b) all of the words are really important to the story, which is also the gameplay, which is a mystery, which is delicate,” Adam explains.\n\n“It is critical that the translation is seen in context, and this is where linguistic quality assurance comes into place,” says Idalina Taylor, head of localization and audio at Universally Speaking. “Post-translation, the localized content is implemented in the build, and we then have another set of eyes to go through the translation to make sure that it is actually accurate when playing the game… All these sanity checks, together with contextualisation allow for the translation to flourish and help engaging further the players into the game, increasing player experience.”\n\nThe process was then repeated for each included language. For the most part, the brothers weren’t involved in the process at all, though there was an anonymous spreadsheet where localizers could ask any specific questions. This was reassuring in a way: when someone asked a very specific question, it meant they were at least paying close attention. In most cases, individual translators were able to come up with creative solutions for problems. For instance, at one point in the game, a detective comes across a giant dragonfly and says it’s either one big dragonfly or a very small dragon. But in the French version, that joke didn’t make sense because the French word for dragonfly, libellule, doesn’t contain the word dragon. So the French localizer had to come up with a brand-new pun using the similar-sounding French word ombellule.\n\n“I had no idea what the Russian script actually says.”\n\nThis structure also meant that the game’s developers were putting a lot of faith in the localizers. In fact, the brothers say they weren’t entirely sure the translations were good until Tangle Tower actually launched. “I’ve been reading hundreds of reviews in Korean and Russian and German. I’ve just been throwing them into Google Translate,” says Adam. “It’s been a way to find out for sure that, say, the Russian script for the game is actually pretty good because some Russian guy is saying, ‘Oh my god, I love the story!’ I had no idea what the Russian script actually says.”\n\nTangle Tower’s developers also had to make some changes to the game itself to accommodate the new languages. The text boxes had to accommodate right-to-left languages like Arabic, and the team had to track down fonts for different alphabets, including thousands of Chinese characters, that weren’t prohibitively expensive. In fact, they needed two different fonts for each alphabet, which meant a lot of searching. There were also graphic elements that used English text that had to be changed; for instance, an early version of a treasure map featured a compass with NEWS, indicating the four cardinal directions. Those four letters wouldn’t make sense for many users. “You really have to not lean into illustrated text or graphic text, or text that requires a shape of a letter to be part of a puzzle,” Adam says.\n\nOne of the biggest problems was the important scenes in which the detectives use clues to construct sentences to determine what has happened. (See the above screenshot.) These are the moments when Tangle Tower really makes you feel like someone solving a mystery. “The trouble is a lot of languages do not share the same basic sentence structure that English uses,” Taylor explains. “They’ll put verbs at the end, or the subject needs to come after the object, where we would need to put it before, and things like that.” Certain languages, including Korean, German, and Turkish, required the developers to reformat the text boxes to better suit their sentence structures.\n\nDespite the extensive time and effort that went into the localization, the brothers say that the process wasn’t really that different from translating into a smaller number of languages — it was just a lot more expensive. (The pair wasn’t able to discuss specifics on funding for the game, though it seems likely Apple contributed in some form.) That said, it has opened up a whole new audience for the game, one that will only grow larger when Tangle Tower launches on the Nintendo Switch and Steam next week. Those versions will support all of the same languages as the Apple Arcade release. It was something that was forced on the team as an Apple Arcade requirement, but the brothers also say that the experience will inform their future games, which are more likely to be available in a wider range of languages.\n\n“We know what it takes from start to finish,” Tom says of the process, “which isn’t something we knew before.”", "description": "Tangle Tower is a detective game for Apple Arcade with lots of text, which was translated into more than a dozen languages including Russian, German, and Arabic.", "authors": ["Andrew Webster", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/ON1qKcDkUGpCWDLH6rkuHgjz8M8=/0x38:1920x1043/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19292326/ss_71f91f6608d659261243390fccb8bbf9e5e08f34.jpg", "published_at": "2019-10-16"}