{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/09/20/trump-finally-realizes-being-president-is-hard", "downloaded_at": "2019-09-20 22:55:47.881188+00:00", "title": "Trump finally realizes being president is hard", "language": "en", "text": "Yet when Trump talks about what’s going on around the world, he begins to sound almost wistful, focusing on what he could do but hasn’t and won’t. For example, here’s what he said Friday on the subject of bombing Iran:\n\nThe easiest thing I could do, in fact I could do it while you’re here, would say, “Go ahead fellas, go do it.” And that would be a very bad day for Iran. That’s the easiest thing I could do, it’s so easy.\n\nWhat’s so strange about this is that the reason he hasn’t gone to war against Iran is precisely because it wouldn’t be easy, and Trump knows it. One of his few worthwhile impulses is his reluctance to get into another war in the Middle East, because he has no taste for getting trapped in a quagmire like Iraq.\n\nSo why keep insisting that it would be “easy”? Let’s look at something else he said Friday:\n\nWe’ve been very effective in Afghanistan, and if we wanted to do a certain method of war, we would win that very quickly, but many, many, really, tens of millions of people would be killed, and we think it’s unnecessary.\n\nCommitting the worst genocide in human history is “unnecessary.” Good to know.\n\nYou might think this idea — that we could quickly end the war in Afghanistan by killing everyone in the country — would never even occur to a sane person. But Trump keeps bringing it up. Back in July, he said, “If we wanted to fight a war in Afghanistan and win it, I could win that war in a week. I just don’t want to kill 10 million people.” The point is always how easy it could be, compared with what he has to do now.\n\nI think what underlies these repeated statements is a genuine frustration on his part with how complicated being president has turned out to be. This was something Trump was plainly unprepared for. A few months in, he told Reuters, “This is more work than in my previous life. I thought it would be easier.”\n\nYes, Trump actually believed that being president of the United States, the most important job on the planet, would be easier than running a midsize brand-licensing firm.\n\nThis was probably because he figured that being president was mostly giving speeches and throwing out a few ceremonial first pitches (though he is the first president since William Howard Taft not to do the latter, most likely because he’s afraid of being booed). How hard could it be? He saw presidents on TV and thought they were all idiots; obviously he could run circles around them.\n\nThen he got to the White House and learned that everything was more complicated than he thought, especially legislating. You’ll remember him lamenting, “Nobody knew that health care could be so complicated,” when in fact everyone except for him was quite aware. Which is why the only major piece of legislation he passed was a tax cut, and it isn’t exactly hard to get a Republican Congress to cut taxes for the wealthy and corporations.\n\nIn foreign policy, Trump figured his matchless skills as a negotiator would enable him to solve any problem. I don’t need to know anything about nuclear deterrence and uranium enrichment and throw weights — just get me in a room with Kim Jong Un, and we’ll make a deal!\n\nWe saw how that worked out: A bunch of meetings and “beautiful letters” and … nothing. We’re in the same place we were with North Korea before he took office.\n\nAs he looks at Iran, all Trump sees is complications. He walked away from the nuclear agreement because it was Barack Obama’s, and now tensions have skyrocketed. He imposed sanctions on Iran, and instead of knuckling under it is being more provocative. He loves the Saudis but doesn’t have a taste to get into a regional war against Iran on their behalf. A direct strike on Iran would create all kinds of unintended consequences.\n\nAt last, Trump understands that it isn’t as easy as he thought. So he can’t stop talking about some other imagined course he could take, the one that would be easy. The one that will remain forever out of his reach.\n\nRead more:\n\nDavid Ignatius: The escalating crisis with Iran is Trump’s self-inflicted wound\n\nFareed Zakaria: The central mistake of Trump’s Iran policy\n\nThe Post’s View: Trump has dug himself into a hole with Iran\n\nMax Boot: In his showdown with Iran, Trump blinks\n\nDavid Ignatius: Trump has a chance to reset the table in Afghanistan", "description": "And he's not happy about it.", "authors": ["Paul Waldman", "Opinion Writer Covering Politics", "Opinion Writer"], "top_image": "https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QLXQU6W3EQI6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-20"}