{"pub": "guardian", "url": "https://theguardian.com/news/2019/oct/07/nazanin-zaghari-ratcliffe-pressure-grows-on-uk-after-australians-release", "downloaded_at": "2019-10-07 07:39:41.626949+00:00", "title": "Nazanin Zaghari-Ratcliffe: pressure grows on UK after Australians' release", "language": "en", "text": "Nazanin Zaghari-Ratcliffe has questioned why she remains incarcerated in Iran for more than three years after Australia secured the release of two citizens from the country, her husband has disclosed.\n\nJolie King, a British-Australian building designer, and her boyfriend, Mark Firkin, a construction manager, were allowed to return home last week, three months after being arrested.\n\nThe couple, who had been blogging on their travels across Asia, were arrested on spying charges after flying a drone near a military base, Iranian officials said.\n\nZaghari-Ratcliffe, a dual British-Iranian national, who was arrested in Iran in 2016 and given a five-year sentence for allegedly plotting against the Iranian government, befriended King after the two were housed in the same area of Tehran’s Evin prison.\n\nKing and Firkin’s release, which came before the pair faced a court hearing, was secured as Australia returned the scientist Reza Dehbashi to Iran having been detained for 13 months over the purchase of a defence system from the US.\n\nWhile pleased to hear of the couple’s return to Australia, Zaghari-Ratcliffe, 41, has questioned why British officials have not yet secured her release, according to her husband Richard Ratcliffe.\n\n“I told Nazanin and she was very pleased that Jolie was released,” he told the Times. “Obviously for Nazanin it is also bittersweet. While there is no queue for cases like this, she did ask how come the Australians can solve their hostage cases in a couple of months while the UK has taken over three and a half years. I had no answer.”\n\nMarise Payne, the Australian foreign affairs minister, said the release of King and Firkin had come after “very sensitive” negotiations between the two countries’ governments.\n\nIran’s foreign minister, Mohammad Javad Zarif, said last month that Zaghari-Ratcliffe’s fate was connected to a historic debt Britain owed Iran over a decades-old weapons deal.\n\nZaghari-Ratcliffe and her husband decided last week their five-year-old daughter, Gabrielle, would be returned to the UK, having been in Tehran since her mother’s arrest in 2016. In a letter, she said the separation from her child would leave her a “desolate mother ready to burn like a desert dune”.\n\nMeanwhile, another British-Australian woman, Kylie Moore-Gilbert, remained in Evin prison, where she has been for almost a year. Moore-Gilbert, a Cambridge-educated, Melbourne-based academic specialising in Islamic and Middle East studies, has reportedly been handed a 10-year sentence, also on a charge of espionage.\n\nAustralian officials are still working to secure her release.", "description": "British-Iranian national questions UK’s failure to secure her freedom, says husband", "authors": ["Nadeem Badshah"], "top_image": "https://i.guim.co.uk/img/media/4ea44d0b979b4cbaedadc26add84e5d1a689f266/53_0_3308_1985/master/3308.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b8b6c781a5fa8fb09a54ef7cc8565fc6", "published_at": "2019-10-07"}