{"pub": "marketwatch", "url": "https://marketwatch.com/story/hearing-on-online-extremism-amid-gun-violence-crisis-shows-congresss-absurdity-says-democratic-senator-2019-09-18", "downloaded_at": "2019-09-18 23:24:42.556710+00:00", "title": "Hearing on online extremism amid ‘gun-violence crisis’ shows Congress’s ‘absurdity,’ says Democratic senator", "language": "en", "text": "‘Nothing highlights the absurdity of Congress’s inability to solve the gun-violence crisis then seeing 318 mass shootings in 260 days, and then holding a hearing on extremism in social media.’ Illinois Democratic Sen. Tammy Duckworth\n\nThat line came from Democratic Sen. Tammy Duckworth during a Wednesday hearing of the Senate Commerce Committee titled “Mass Violence, Extremism and Digital Responsibility.”\n\nThe panel’s chairman, Mississippi Republican Sen. Roger Wicker, noted in his opening remarks that gunmen in some mass shootings have posted manifestos online before launching their attacks. Wicker also stressed that President Donald Trump has asked social media companies to develop tools that can detect would-be shooters before they strike.\n\nBut Duckworth wasn’t having it.\n\n“Here we are not focused on ways to stop gun violence, but instead the scourge of social media,” the lawmaker from Illinois said. “I’m not going to say there’s no connection, but every other country on the planet has social media, video games, online harassment, hate groups, crime and mental health issues, but they don’t have mass shootings like we do.”\n\nShe displayed a large chart showing how the U.S. is “somewhere in the middle of the pack” in terms of use of social media, with the Philippines having the heaviest usage and Japan the least. Wicker later asked her to get the big charts that she displayed into a smaller format so they could be entered into the record, and she thanked him for that.\n\nThe hearing, which aimed to look at how social media giants are handling violent or threatening content on their platforms, featured testimony from Facebook Inc.’s FB, +0.03% head of global policy management, Monika Bickert, as well as Twitter Inc.’s TWTR, +0.00% public policy director, Nick Pickles, and Derek Slater, the global director of information at Alphabet Inc.’s GOOG, +0.27% GOOGL, +0.23% Google.\n\nRelated: Senator doesn’t believe Google official who says company doesn’t aim to persuade users\n\nEarlier in the hearing, Florida Republican Sen. Rick Scott — who was that state’s governor at the time of its Parkland shooting — emphasized that confessed shooter Nikolas Cruz had posted threatening comments on Google’s YouTube and other online platforms, but that didn’t lead the FBI or Google to take steps to prevent Cruz’s attack on his former school.\n\n“Are you comfortable that if another Nikolas Cruz put something up, you have the process now that you’ll contact somebody and there’ll be a follow-up process?” Scott asked Google’s Slater.\n\nSlater responded as follows: “Our processes are getting better all the time. They are robust. I think this is an area where it’s an evolving challenge, both because technology evolves, because people’s tactics evolve. They might use code words and so on.”\n\nThe hearing is another example of the increased scrutiny that Silicon Valley is facing in Washington, as regulators and lawmakers blast tech giants for how they have handled their users’ personal data, while also raising antitrust concerns and other worries.\n\nRelated: News cycle is daily reminder of Big Tech’s antitrust vulnerabilities\n\nAnd see: Senate panel grills DOJ, FTC chiefs over their antitrust probes into Big Tech", "description": "The remarks from Sen. Tammy Duckworth of Illinois come during a hearing of the Senate Commerce Committee that aims to look at how social media giants are...", "authors": ["Victor Reklaitis", "Money", "Politics Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR554_duckwo_ZG_20190918134954.jpg", "published_at": "2019-09-18"}