{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-soccer-euro-nor-esp-preview/fati-an-option-for-euro-2020-says-spain-coach-moreno-idUKKBN1WQ2GJ", "downloaded_at": "2019-10-11 20:24:57.592947+00:00", "title": "Fati an option for Euro 2020, says Spain coach Moreno", "language": "en", "text": "OSLO (Reuters) - Sixteen-year-old forward Ansu Fati could figure in Spain’s Euro 2020 squad, national coach Robert Moreno said on Friday.\n\nFILE PHOTO: Soccer Football - Champions League - Group F - Borussia Dortmund v FC Barcelona - Signal Iduna Park, Dortmund, Germany - September 17, 2019 Barcelona's Anssumane Fati during the match REUTERS/Thilo Schmuelgen/File Photo\n\nFati, who became Barcelona’s youngest ever goalscorer in August and has been one of the La Liga champions’ key players in their stop-start campaign, was born in Guinea-Bissau but was awarded Spanish nationality last month.\n\nHe was not included in the squad for the under-17 World Cup but was called into Spain’s under-21 side for the first time on Friday due to injury to his club mate Carles Perez.\n\n“It can’t be ruled out that Ansu Fati plays at Euro 2020 with us; it would be stupid to say he will not go if he keeps causing a stir,” Moreno told a news conference ahead of Spain’s Euro 2020 qualifier away to Norway on Saturday.\n\n“I’m glad he is in the under-21 team, he has broken down the usual barriers of age groups and we had him in our long list of players.\n\n“When the moment comes we’ll have to think about it carefully and decide which age group he should be competing with but all good players are welcome in the first team.”\n\nSpain have won all six of their qualifiers to lead Group F with 18 points and victory in Oslo will take them to the brink of sealing their spot at Euro 2020.\n\nThey could even clinch their place at the tournament with a win in the unlikely scenario that third-placed Romania fail to beat the Faroe Islands, who have yet to pick up a point.\n\nThe game with Norway will be a landmark occasion for captain Sergio Ramos, who is set to overtake Iker Casillas and become Spain’s record appearance-maker on 167 games.\n\nAccording to reports in Spanish media, Ramos wants to be part of Spain’s squad for the 2020 Olympic Games in addition to the European Championship.\n\nMoreno praised Ramos ahead of Saturday’s game but said he had not discussed the Olympics with the 33-year-old.\n\n“I haven’t spoken to him about that, he is a very ambitious player and he is always motivated. It’s very difficult to maintain your performance level at his age but he keeps doing that,” added Moreno.\n\n“But (under-21 coach) Luis de la Fuente is the one who has to decide whether or not Ramos goes to the Olympics.”", "description": "Sixteen-year-old forward Ansu Fati could figure in Spain's Euro 2020 squad, national coach Robert Moreno said on Friday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191011&t=2&i=1439798303&w=1200&r=LYNXMPEF9A1VI", "published_at": "2019-10-11"}