{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/boris-johnson-insists-not-delay-20463848", "downloaded_at": "2019-10-05 10:15:22.265475+00:00", "title": "Boris Johnson insists he will not delay Brexit - despite law requiring extension", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nBoris Johnson insisted that he will not delay Brexit - despite his lawyers saying he will comply with a law and ask the EU for an extension.\n\nThe Prime Minister accepted he must send a letter requesting a delay to Brexit beyond the Halloween deadline if no deal is agreed with Parliament by October 19, Scotland's highest civil court heard.\n\nBut Mr Johnson later said the options facing the country were his proposed new Brexit deal or leaving without an agreement, \"but no delay.\"\n\nHowever, the chances of his new proposals succeeding were dealt a heavy blow by Brussels, as EU member states agreed they \"do not provide a basis for concluding an agreement\".\n\nA European Commission spokesman said discussions between the two sides would not take place this weekend but the UK will be given \"another opportunity to present its proposals in detail\" on Monday.\n\n(Image: PA)\n\n(Image: REUTERS)\n\n\"Michel Barnier debriefed COREPER (The Permanent Representatives Committee) yesterday, where member states agreed that the UK proposals do not provide a basis for concluding an agreement,\" the spokesman added.\n\nThe Prime Minister has previously said \"we will obey the law\" but will also leave on October 31 in any circumstance, without specifying how he would achieve the apparently contradictory goals - fuelling speculation that he had identified a loophole to get around the Benn Act.\n\nHe has also declared he would rather be \"dead in a ditch\" than ask for a delay.\n\nAny extension to the Article 50 process - the mechanism by which the UK leaves the European Union - would have to be agreed by all 27 other EU leaders.\n\nThe legal action - led by businessman Vince Dale, SNP MP Joanna Cherry QC and Jolyon Maugham QC - asked the court to require Mr Johnson to seek an extension to avoid leaving the EU without a deal.\n\nAndrew Webster QC, representing the UK Government, said the documents it has submitted to the court are a \"clear statement\" as to what the Prime Minister will do.\n\n(Image: AFP/Getty Images)\n\nHe argued there is no need for an order to be made forcing a letter requesting an Article 50 extension to be sent under the terms of the Benn Act, because the court has it on record it will be sent.\n\nJudge Lord Pentland is to announce his decision on Monday.\n\nMr Maugham told the PA news agency the Prime Minister's submission said \"he would send the letter mandated by the Benn Act\" and would not \"frustrate\" attempts to get an extension.\n\nHe added: \"We want to see the courts tell him that 'unless you send the letter, no later than October 19, unless you cease trying to frustrate Parliament's intention, there will be personal consequences for you, you could go to prison'.\"\n\nIf Mr Johnson - who wants an early election - did request a delay it could play into the hands of the Brexit Party.\n\nThe party's leader, Nigel Farage, said: \"Boris said we would leave by October 31 'do or die'.\n\n\"Why does he keep saying things that are not true?\"\n\nIreland's premier Leo Varadkar said he would agree to an extension if Mr Johnson requested it.\n\n\"I've always said that Brexit doesn't end with the UK leaving, it's just the next phase of negotiations, but if the UK were to request an extension, we would consider it, most EU countries would only consider it for good reason, but an extension would be better than no deal,\" he said.\n\nMeanwhile, Brexit talks with Brussels on Mr Johnson's plan to replace the backstop could continue over the weekend.\n\nBrussels said that \"every day counts\" as the clock ticks down to a crunch summit of EU leaders on October 17-18 and Downing Street said \"we are ready to talk at any point, including over the weekend\".\n\nThe Prime Minister is expected to embark on a tour of European capitals for face-to-face talks next week as well as continuing to speak by phone to counterparts.\n\nEuropean Commission spokeswoman Natasha Bertaud said: \"What we have always said is that every day counts, especially as we near the end of October.\"\n\nThe Prime Minister's Europe adviser, David Frost, has been in Brussels for technical talks with officials.\n\nDowning Street also indicated the Government would consider publishing the full legal text of Mr Johnson's proposals, which have so far only been shared confidentially with Brussels.\n\nMr Johnson's plans would see Northern Ireland apply EU rules on goods, but stay in a customs territory with the UK.\n\nThis would create a regulatory barrier for goods crossing the Irish Sea and create a customs border between Northern Ireland and the Republic of Ireland - but Mr Johnson has insisted there would be no need for checks or infrastructure at the frontier.\n\nIrish deputy prime minister Simon Coveney said: \"We don't see how the proposal to have two different customs territories on the island of Ireland can avoid customs checks between those territories.\"", "description": "The Prime Minister previously declared he would rather be \"dead in a ditch\" than ask for a delay", "authors": ["David Hughes", "Neil Murphy", "Harriet Line", "Image", "Pa Wire Pa Images", "Pa", "Reuters", "Afp Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20445795.ece/ALTERNATES/s1200/0_Brexit.jpg", "published_at": "2019-10-04"}