{"pub": "reuters", "url": "https://reuters.com/article/us-britain-eu/brexit-in-the-balance-as-johnson-faces-crunch-votes-idUSKBN1X10JZ", "downloaded_at": "2019-10-22 13:39:45.851919+00:00", "title": "Brexit in the balance as Johnson faces crunch votes", "language": "en", "text": "LONDON (Reuters) - Prime Minister Boris Johnson faces two pivotal votes in parliament on Tuesday that will decide whether he can deliver on his promise to lead the United Kingdom out of the European Union in nine days’ time.\n\nFILE PHOTO: A man passes an electronic billboard displaying a British government Brexit information awareness campaign advertisement in London, Britain, September 11, 2019. REUTERS/Toby Melville/File Photo\n\nAs the clock ticks down to the latest Oct. 31 deadline for Britain’s departure, Brexit is hanging in the balance as a divided parliament debates when, how and even whether it should happen.\n\nAfter he was forced by opponents into the humiliation of asking the EU for a delay that he had vowed he would never seek, Johnson is battling to ram legislation through the House of Commons that will enact his last-minute Brexit deal.\n\nIn yet another day of high drama, lawmakers vote at around 1800 GMT on the 115-page Withdrawal Agreement Bill and then vote on the government’s extremely tight timetable for approving the legislation.\n\n“I hope parliament today votes to take back control for itself,” said Johnson, the face of the successful 2016 referendum campaign to leave the EU.\n\n“The public doesn’t want any more delays, neither do other European leaders and neither do I. Let’s get Brexit done on 31 October and move on.”\n\nDefeat in either vote would scupper Johnson’s plans to leave the EU with or without a divorce deal on Oct. 31. He would have to decide whether to abide by a law that demands he accept any Brexit delay offered by the EU or somehow leave without a deal.\n\nVictory, an imperfect indicator of support for Johnson’s deal, would give opponents in parliament another chance to ambush the government with amendments that could wreck Johnson’s plans by demanding a much closer post-Brexit relationship with the EU.\n\nThe pound was flat at $1.2946 in London trading. Foreign exchange markets now price in Britain either leaving with a deal or delaying Brexit, or possibly both.\n\nJohnson’s spokesman said that if parliament voted down the legislative timetable, then it would make no-deal Brexit more likely.\n\n“Voting down the program motion risks handing control over the situation to the European Union and therefore making no deal more likely,” he said.\n\nBREXIT IN PLAY\n\nMore than three years since the United Kingdom voted 52% to 48% to leave the European Union, the Brexit crisis is straining Britain’s political and constitution system to the breaking point.\n\nJohnson confounded his opponents by winning a Brexit deal from the EU on Thursday, though he was forced by his opponents - reluctantly and with a mere unsigned photocopy - to ask for a Brexit delay on Saturday. House of Commons speaker John Bercow refused a vote on his deal on Monday.\n\nIf Johnson is defeated on Tuesday, much will depend on how the EU plays yet another Brexit quandary.\n\nEuropean Council President Donald Tusk said he was discussing the request for a Brexit delay with the leaders of the other 27 member states and would make a decision “in the coming days”.\n\n“I have no doubt that we should treat the British request for an extension in all seriousness,” Tusk told lawmakers in the Strasbourg assembly of the European Union parliament. “A no-deal Brexit will never be our decision”, he said to applause from lawmakers.\n\nIn a sign of the frustration in Brussels, European Commission President Jean-Claude Juncker said Brexit was a waste of time and energy and that the European Parliament could only approve Johnson’s deal after the British parliament.\n\nBrexit Party leader Nigel Farage told the EU parliament that another delay was on the cards.\n\nBehind the daily Brexit combat in parliament, the courts and at late-night EU summits, a much bigger game is being played over whether Brexit will happen at all.\n\nJohnson faces legislative booby traps at every juncture, but the opponents of Brexit are also deeply divided - one of the main reasons their campaign to “Remain” failed in the 2016 referendum.\n\nStill, Johnson is asking a divided parliament where he has no majority to approve in just three days one of the most important pieces of legislation in recent British history.\n\nFILE PHOTO: Britain's Prime Minister Boris Johnson speaks ahead of a vote on his renegotiated Brexit deal, on what has been dubbed \"Super Saturday\", in the House of Commons in London, Britain October 19, 2019. ©UK Parliament/Jessica Taylor/Handout via REUTERS\n\nThe so-called WAB (Withdrawal Agreement Bill) will have less time for debate in the House of Commons than a law to ban the use of wild animals in circuses, according to the Institute for Government.\n\nPrevious bills to implement major European treaties have taken 10 to 40 days to get through parliament. Government ministers said parliament has enough time to discuss every intricacy of Brexit.\n\nThe opposition Labour Party will vote against both WAB and the timetable, The Times’s political editor said. The Northern Irish Democratic Unionist Party are also likely oppose both, a UTV reporter said.", "description": "Prime Minister Boris Johnson faces two pivotal votes in parliament on Tuesday that will decide whether he can deliver on his promise to lead the United Kingdom out of the European Union in nine days' time.", "authors": ["Kylie Maclellan", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191022&t=2&i=1443684183&w=1200&r=LYNXMPEF9L0TO", "published_at": "2019-10-22"}