{"pub": "yahoo", "url": "https://news.yahoo.com/xi-military-parade-showcase-china-210000060.html", "downloaded_at": "2019-09-30 05:32:27.059355+00:00", "title": "Xi Military Parade to Showcase China Missiles Spooking the U.S.", "language": "en", "text": "(Bloomberg) -- In Beijing, President Xi Jinping’s grand military parade through the capital will be cheered as a display of national pride after 70 years of Communist Party rule. In Washington, many will see a growing threat to American dominance in the Western Pacific.\n\nAlongside the tanks, troop carriers and columns of goose-stepping soldiers, the 80-minute procession past Tiananmen Square on Tuesday is expected to showcase a set of missiles that have prompted the U.S. in recent years to try and put more firepower in East Asia. China has poured money into building what former Pacific Commander Harry Harris called “the largest and most diverse missile force in the world.”\n\nThe parade -- Xi’s second such event in four years -- will feature the fruits of that labor, according to analysis of photos of equipment staged in advance of the holiday. One intercontinental ballistic missile -- the Dongfeng-41, one of the world’s longest range rockets -- will be publicly displayed for the first time, researchers Antoine Bondaz and Stéphane Delory of the Foundation for Strategic Research in Paris wrote.\n\n“In terms of pure political communication, the missiles are going to be what everyone is going to talk about, because it’s a powerful demonstration of force and strength from the Chinese,” Bondaz said Friday.\n\nAmong the most immediate concerns of the U.S. and its Asian allies is the People’s Liberation Army’s arsenal of shorter-range, non-nuclear missiles. Over the past 15 years, China has doubled its supply of launchers and built an array of weapons that have extended the reach of its conventional warheads to cover most of America’s Western Pacific bases.\n\nSuch mid-range, land-based missiles, which the U.S. was banned from possessing from under its Intermediate Range Nuclear Forces Treaty with Russia, were among the reasons why some supported the Trump administration’s withdrawal from the Cold War-era pact this year. The PLA’s dedicated Rocket Force has tested advanced “hypersonic” missiles that are almost impossible to intercept, according to a Japanese defense white paper released Friday.\n\n“The medium- and intermediate-range ballistic missiles that the Chinese have developed, and which will be on display on the 1st of October, are a critical component” of Beijing’s strategy, said Sam Roggeveen, director of the Sydney-based Lowy Institute’s international security program. “What it’s meant to do is to make it extremely risky and extremely expensive to conduct any military operations in North Asia.”\n\nU.S. officials have estimated that around 95% of China’s arsenal would’ve run afoul of the INF treaty, which the U.S. has also accused Moscow of violating. The PLA’s missiles could allow China to “quickly use limited force to achieve a fait accompli victory” before the U.S. could respond, according to one recent report from the University of Sydney’s United States Studies Centre.\n\nWhile pulling out of the treaty lets the U.S reintroduce its own missiles, the world’s most powerful military is playing catch-up with China. The Pentagon conducted its first flight test of a land-based cruise missile last month and new Defense Secretary Mark Esper said during his first visit to the region that he was looking for sites in Asia to base such weapons.\n\nEsper’s suggestion exposed the hurdles facing any Washington-led effort to counter China’s threat. Australian Prime Minister Scott Morrison ruled out hosting U.S. missiles and Japanese Prime Minister Shinzo Abe has run into stiff opposition against his efforts to deploy an American missile-defense system, let alone offensive rockets.\n\nMoreover, any move to introduce such missiles would face resistance from China, which subjected South Korea to an economic embargo after it agreed in 2016 to introduce a U.S. missile shield in 2017. During Esper’s trip, China’s foreign ministry warned that Australia, Japan and South Korea would suffer countermeasures if they deployed the weapons.\n\n“The hosting of INF-range missiles in the Indo-Pacific theater will be a challenging endeavor,” said J. Berkshire Miller, a senior fellow at the Japan Institute of International Affairs. “China will surely look to place intense political and economic pressure on any U.S. ally that looks to potentially host such INF-range missiles.”", "description": "(Bloomberg) -- In Beijing, President Xi Jinping’s grand military parade through the capital will be cheered as a display of national pride after 70 years of Communist Party rule. In Washington, many will see a growing threat to American dominance in the Western Pacific.Alongside the tanks, troop carriers", "authors": ["Iain Marlow"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ocohzJIGwir2VPolRImrZw--~B/aD0xMTcwO3c9MTI5NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/83deec7206ab57b2b6419c48f3b20381", "published_at": "2019-09-29"}