{"pub": "axios", "url": "https://theverge.com/2016/7/4/12092768/ap-robot-journalists-automated-insights-minor-league-baseball", "downloaded_at": "2019-10-15 14:56:22.557418+00:00", "title": "AP's 'robot journalists' are writing about Minor League Baseball now", "language": "en", "text": "The Associated Press has already used its automated reporting platform Wordsmith to generate things that its human writers also cover, like quarterly earnings and college sports, but now its \"robot journalists\" are branching out to a new sector — Minor League Baseball. The publisher will now cover the US minor leagues, feeding data from MLB Advanced Media into the the same software it has used to produce automatic stories for the last two years.\n\nHuman reporters were used by the AP to cover some Minor League games in 2006, but couldn't cover the full slate of teams and leagues. By using Automated Insights' software and MLBAM's data, the AP can now report on games it previously couldn't without a staff of hundreds of dedicated journalists, the Wordsmith platform covering 142 MLB-affiliated teams across 13 leagues.\n\nThe AP tried covering Minor League Baseball in 2006 but couldn't report on as many games\n\nAutomated Insights' software has proved itself accurate in its reporting on other topics so far, but AP's sports division spent a year testing the software to make sure the Minor League write-ups it spat out made sense for fans. The results were obviously pleasing — Barry Bedlan, the AP's deputy director of sports products, told TechCrunch that the trial only took a full year largely because between trips to games, assignments, and other duties, it was often hard to pin down sports writers to critique the automatically generated stories.\n\nThe automated technology could be used for other sports in the future, but Bedlan says the speed MLBAM can provide game data — with detailed information available to the AP minutes after the final score is settled — makes it a particularly convenient partner. \"If a sports organization cannot give us 100% stamp of approval on accuracy for hours or even days, that does not work, it has lost its news value for a newspaper, broadcaster or website,\" Bedlan told TechCrunch.", "description": "The Associated Press has already used its automated reporting platform Wordsmith to generate things that its human writers also cover, like quarterly earnings and college sports, but now its \"robot...", "authors": ["Rich Mccormick", "Jul"], "top_image": "https://cdn.vox-cdn.com/thumbor/q1J7XJj1ELpeMWMVzgAl411IXbc=/0x294:3684x2366/1600x900/cdn.vox-cdn.com/uploads/chorus_image/image/50015963/GettyImages-172521491.0.jpg", "published_at": "2016-07-04"}