{"pub": "yahoo", "url": "https://news.yahoo.com/america-stop-china-dominating-south-120000806.html", "downloaded_at": "2019-10-28 00:25:32.181320+00:00", "title": "This Is How America Can Stop China From Dominating the South China Sea", "language": "en", "text": "Key Point: The Philippines have a role to play.\n\nThe United States and the Philippines have been discussing whether the Filipino military should buy the High-Mobility Artillery Rocket System (HIMARS), a multiple rocket launcher used by the United States and other nations, according to the South China Morning Post.\n\n“If deployed, the long-range, precision-guided rockets fired by the system would be able to strike Chinese man-made islands on reefs in the Spratly chain,” the newspaper said. HIMARS is a lighter, more mobile six-barreled version of the U.S. Army’s M270 multiple rocket launch system (MLRS). It can shoot rockets out to 70 kilometers (43 miles) and GPS-guided ballistic missiles out to 300 kilometers (186 miles).\n\nHowever, funding from the cash-strapped Philippines is a hurdle. “The two sides have been unable to reach a deal because HIMARS could be too expensive for Manila given its tight defense budget,” said the newspaper.\n\nExactly how much does HIMARS cost? Manufacturer Lockheed Martin refused to give cost estimates, instead referring queries to the U.S. Army’s Aviation and Missile Command, which didn’t respond to questions from TNI. The cost of HIMARS is split between the launcher itself and separate contracts for various munitions including guided and unguided rockets, the longer-range Army Tactical Missile System (ATACMS) missiles, and weapons under development such as extended-range rockets and the Precision Strike Missile.\n\nSome estimates put the cost of a HIMARS guided rocket at $100,000 to $200,000 apiece, or an ATACMS at more than $700,000 apiece. Another clue is that Poland recently signed a $414 million contract for eighteen launchers plus support and training. With the 2019 Philippines defense budget at only $3.4 billion, a big HIMARS purchase would be a strain.\n\nRead the original article.", "description": "America can't do it alone.", "authors": ["Michael Peck"], "top_image": "https://s.yimg.com/uu/api/res/1.2/7QmR8Ty38IOm3Dzpb8mNQg--~B/aD04MDQ7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_national_interest_705/273a7d89b17b70c87ad23cea8514723d", "published_at": "2019-10-27"}