{"pub": "yahoo", "url": "https://sg.sports.yahoo.com/italian-gt-apos-restoration-apos-102000803.html", "downloaded_at": "2019-10-25 16:27:03.880541+00:00", "title": "Italian GT 'Restoration of the Year' belongs to Coldplay bassist", "language": "en", "text": "The restored Bizzarrini 5300 GT Strada belongs to Guy Berryman.\n\nConcours restoration experts Thornley Kelham have been awarded the accolade of 'Restoration of the Year' for their work on a rare Bizzarrini 5300 GT Strada.\n\nOther fine restorations\n\nThe Italian GT car was mostly complete prior to its restoration, but being one of only around 100 built – and among several near-perfect replicas also complicating things – finding the right reference material was a tough task and the car's owner, Guy Berryman of Coldplay, was keen to keep the car perfectly original.\n\nNevertheless, Thornley Kelham cracked on, consulting with a number of Bizzarrini specialists, including Jack Koobs de Hartog, a globally-recognised authority on the cars built by the short-lived Italian manufacturer.\n\nThornley Kelham claims 'Restoration of the Year' gong for work on rare Italian GT More\n\nThe whole restoration began with a complete disassembly of the car where individual components were meticulously catalogued.\n\nFrom then the full restoration began. The car has an alloy skin over a steel frame construction and cars built this way tend to take around 4000 to 4500 hours to restore over a period of 18-24 months. Thornley Kelham opted to outsource the metalwork this time, with it being handled by Gary Pitney at GP Panelcraft.\n\nThornley Kelham does have an excellent reputation for paintwork, however, so that challenge was kept in house. From bare metal, the paintwork took 800 hours to complete, with an impeccable attention to detail being applied throughout.\n\nThornley Kelham claims 'Restoration of the Year' gong for work on rare Italian GT More\n\nSadly not everything could remain original. The brakes were swapped out for Dunlop-style ones that will better suit the car's regular use, but that would be the only major change. Even the original welding, some of which was described as 'terrible' by Thornley Kelham, remained.\n\nThe car's restoration was eventually completed in time for the 2018 Concours of Elegance at Hampton Court Palace.\n\nThornley Kelham claims 'Restoration of the Year' gong for work on rare Italian GT More\n\n\"This restoration was the result of a huge outpouring of research, skill, dedication and passion by the whole Thornley Kelham team, and we’e delighted to see it receiving such acclaim,\" said Thornley Kelham co-founder Simon Thornley. \"This prestigious award follows much praise not only from this car’s fastidious owner but also from the world’s pre-eminent Bizzarrini expert, Jack Koobs de Hartogs. We’re delighted to have been given the opportunity to maintain such an important piece of automotive history.”\n\n\n\n", "description": "The restored Bizzarrini 5300 GT Strada belongs to Guy Berryman.", "authors": ["Feedback", "Dominik Wilde"], "top_image": "https://s.yimg.com/uu/api/res/1.2/6OGhN1emT.0yt2RKfp8kSQ--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-GB/homerun/motor1_uk_340/ce065e1b519b1dd67f077b0c3707d7e1", "published_at": "2019-10-25"}