{"pub": "afr", "url": "https://afr.com/politics/federal/woman-deported-for-failing-to-declare-pork-products-20191015-p530r3", "downloaded_at": "2019-10-15 04:25:00.854984+00:00", "title": "Woman deported for failing to declare pork products", "language": "en", "text": "Biosecurity experts and vets have also travelled to Timor-Leste after the disease was found there in the past two weeks.\n\nDirect flights from Dili to Darwin are being scanned every day.\n\nSince August, 27 tonnes of cooked pork product have been detected coming into Australia.\n\nSeptember figures showed about 48 per cent has been contaminated with African swine fever, up from 15 per cent in February.\n\n\"If you are travelling from an African swine fever country, we are watching you,\" Senator McKenzie said.\n\n\"Biosecurity officers at international airports across the country are profiling people, making sure that we ask the right questions of those high-risk individuals.\n\n\"We need to keep our pest- and disease-free status, as a country, strong.\"\n\nShe said some experts believed African swine flu represented \"potentially the worst animal health disease the world will ever see\" and every passenger arrival in Australia carried a measure of risk.\n\nAdvertisement\n\nAustralia has about 2700 pig producers, with the $5.3 billion industry employing nearly 36,000 people.\n\nRich Lister Anthony Pratt this week predicted swine fever in pigs would \"cause shortages [and] raising demand for all proteins, driving Australian and American food exports\".\n\nAustralian pork products safe\n\nSenator McKenzie said pork products, including bacon and Christmas hams, remained safe for consumption.\n\nAustralian Pork CEO Margo Andrae said the disease transferred to animals but not humans.\n\nShe said there had been some increases in demand for Australian pork products in the wake of a 10 billion tonne of protein deficit caused by the disease.\n\n\"We're calling on all Australians to help on this. This is Australian agriculture you should be proud of, it's amazing work we've done to keep it clean and green.\n\n\"We've kept out the top 10 zoonotic diseases. We've maintained that.\"\n\nAdvertisement\n\nChina's agriculture ministry said on Monday the country's pig herd had declined by 41 per cent in the year to September, with the number of sows also falling by 38.9 per cent.\n\nAfrican swine fever has spread to all of China's provinces. Senator McKenzie said pork prices had increased by about 50 per cent in recent months.\n\nA simulation will take place next month to test the ability of Australia's biosecurity systems to prevent a major crisis. It will involve state and local governments, industry, stock feed operators and quarantine experts.", "description": "The federal government is working to stop African swine fever, which has already wiped out as much as 25 per cent of the world's pig population, from reaching Australian shores.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2289%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/5e849518fd02877022657b2aee28172f4e0ba4ee", "published_at": "2019-10-15"}