{"pub": "realclearpolitics", "url": "https://realclearinvestigations.com/articles/2019/08/28/top_us_intel_office_dragging_feet_on_russiagate_files_for_trump_insiders_say_120135.html", "downloaded_at": "2019-09-04 00:30:59.116868+00:00", "title": "U.S. Intel Gatekeeper Dragging Feet on Trump-Russia Files, Insiders Say", "language": "en", "published_at": "2019-08-28", "text": "Above, the Office of the Director of National Intelligence in Tysons Corner, Va. (Intelligence.gov)\n\nBy Paul Sperry, RealClearInvestigations\n\nAugust 28, 2019\n\nMore than three months after President Trump granted his attorney general unprecedented power to declassify intelligence files, key U.S. intelligence agencies are still withholding documents related to the Trump-Russia affair, say people with direct knowledge of White House discussions on the subject.\n\nThe source of the logjam: the Office of the Director of National Intelligence, which Trump is in the process of shaking up after the resignations last month of its director, Dan Coats, and principal deputy, Sue Gordon. “Establishment” officials in that agency are still dragging their feet, say the sources, who spoke on condition that they not be further identified.\n\nSources who have seen the documents generally described their contents to RealClearInvestigations. They said the material still under wraps includes:\n\nEvidence that President Obama’s CIA, FBI, and Justice Department illegally eavesdropped on the Trump campaign --- cases separate from the FBI’s disputed FISA court-approved surveillance of Trump campaign adviser Carter Page.\n\nPresident Obama and CIA chief John Brennan: key briefing still under wraps.\n\nAn August 2016 briefing CIA Director John Brennan hand-delivered in a sealed envelope to Obama, containing information from what Brennan claimed was \"a critical informant close to Putin.\" The informant is believed to have actually been a Russian source recycled from the largely debunked dossier compiled by ex-British agent Christopher Steele for the Hillary Clinton campaign.\n\nAn email exchange from December 2016 between Brennan and FBI Director James Comey, in which Brennan is said to have argued for using the dossier in early drafts of the task force’s much-hyped January 2017 intelligence assessment. That spread the narrative that Russian President Vladimir Putin ordered the alleged Clinton campaign hacking to steal the election for Trump.\n\nCopies of all FBI, CIA and State Department records related to Joseph Mifsud, the mysterious Maltese professor whose statements regarding Papadopoulos allegedly triggered the original Russia-collusion probe.\n\nTranscripts of 53 closed-door interviews of FBI and Justice Department officials and other witnesses conducted by the House Intelligence Committee. The files were sent to the agency last November.\n\nThe transcripts “demonstrate who was lying and expose the bias that existed against Trump before and after his election,” said Rep. Matt Gaetz (R-Fla.) of the House Judiciary Committee. They also reportedly contain evidence of a Democratic National Committee attorney maintaining Russia-related contacts with the CIA during the 2016 campaign.\n\nThe agency did not immediately respond to requests for comment. James Clapper, its head under Obama, has argued that it is concerned about protecting “sources and methods” from unauthorized disclosure.\n\nThe Office of the Director of National Intelligence, with its sprawling headquarters in Tysons Corner, Va., became the gatekeeper of virtually all classified information in the federal government after its creation in 2005 in response to 9/11 intelligence failures. It has the authority to declassify and publicly release such records.\n\nAttorney General William Barr: facing a \"huge impasse.\"\n\nBut Trump transferred that authority to Attorney General William Barr in late May to remove a bottleneck in the release of classified information sought by Republican lawmakers investigating the origins of the Russia “collusion” investigation launched by the FBI.\n\nBefore stepping down, Coats resisted the president's declassification order after getting pushback from the intelligence bureaucracy; sources say it is protective of its turf from Justice Department encroachment, and concerned about being implicated in the attorney general’s ongoing investigation of “political surveillance” that he says was aimed at the Trump campaign and presidential transition.\n\n\"There's been a huge impasse in getting key documents to Congress and declassified during the Russia investigation,” said a source close to the situation. “Several House members, especially Devin Nunes [of House Intelligence] and Mark Meadows [of House Oversight)] were upset that Coats refused to cooperate in releasing this explosive material to Congress.”\n\nThe source said, “It was clear Coats was not acting on the president’s behalf and had been co-opted by the intelligence bureaucracy.\"\n\nDan Coats: Director of National Intelligence resisted Congress and now is gone.\n\nIntelligence officials don’t appear to be in legal trouble – yet. Barr has requested but not demanded the documents, hoping for their cooperation, the sources say.\n\nBut in response to such resistance, Trump is orchestrating a broad shake-up of senior leadership in the intelligence community after the departures of Coats and Gordon, the latter a close ally of Brennan.\n\nEarlier this month, Trump withdrew his nomination of Republican Rep. John Ratcliffe of Texas, a newly seated member of the House Intelligence Committee, as Coats’s replacement after the nominee got a chilly reception from Senate Republicans who questioned his intelligence experience. Ratcliffe has been an outspoken critic of the FBI’s Russian collusion investigation.\n\nInstead, Coats has been temporarily replaced by former Navy Vice Adm. Joseph Maguire, who moved over from his post as head of the National Counterterrorism Center, giving Trump another intelligence-related position to fill.\n\nThe president isn’t expected to make a decision on a permanent replacement for Coats until the Senate returns from recess on Sept. 9. The head of ODNI is a Cabinet-level position that has to be confirmed by the upper chamber.\n\n“A new director might help break the logjam in declassifying documents for Barr’s investigation,” said Christopher C. Hull, a national security consultant and former senior congressional aide, adding it’s now “toweringly obvious that some portion of U.S. intelligence worked to undermine Trump.\"\n\nPeter Hoekstra: former head of the House intelligence panel is now U.S. ambassador to the Netherlands.\n\nThe president has as many as eight candidates under consideration. But his short list includes Peter Hoekstra, the current U.S. ambassador to the Netherlands and the former chairman of the House Intelligence Committee; and Fred Fleitz, a 20-year veteran of the CIA who also worked for Hoekstra on the House intelligence panel as staff director and, most recently, for Trump in the White House as an adviser on national security.\n\nHoekstra declined comment – \"I’m going to pass on this, thanks for asking\" – but sources say the president recently interviewed him for the top ODNI job. Hoekstra, who worked on Trump’s 2016 campaign, appears to be the front-runner. “He’s great,” Trump said of the former GOP congressman.\n\nHoekstra has questioned the Obama administration’s decision not to brief candidate Trump about alleged Russian election interference during the 2016 campaign, suggesting “politics” overrode any national security concerns. He has also said he would like to see an investigation of \"actions taken by the Obama administration,” including the \"increase in surveillance and the unmasking of Americans,” including Trump campaign figures, in foreign intercepts during the election.\n\nSources say Fleitz met with the president Aug. 5, and has been interviewed for the position by White House Chief of Staff Mick Mulvaney. In fact, he has been under consideration for the powerful post since February.\n\nThe insider sources said Trump and Fleitz have discussed in more than one meeting foreign policy regarding Iran and North Korea, as well as concerns about determined “resistance\" from deeply entrenched bureaucrats and Obama holdovers in the intelligence community — along with the need to “streamline” and “reform\" ODNI.\n\nFleitz would not confirm he is in the running for the position, but also did not deny it.\n\n“I can’t comment on those reports,” Fleitz told RealClearInvestigations.\n\n“I will say it was a great honor to serve President Trump as a member of his NSC [National Security Council] staff,” he added. \"I have told the president that if he needs me to return to the administration, I would be happy to do so.”\n\nAnother name mentioned as a candidate for the top intelligence post is Gen. Joseph Dunford, the outgoing chairman of the Joint Chiefs of Staff.\n\nThe White House did not respond to requests for comment.\n\nFred Fleitz: has support of GOP lawmakers fed up with \"stonewalling.\"\n\nFleitz, who currently serves as president of the Center for Security Policy, a conservative Washington think tank, has long questioned the credibility of a January 2017 intelligence assessment on Russian election interference. Fleitz called the report “rigged” and a “politicized analysis.”\n\nThe sources, who are familiar with Trump’s thinking on ODNI, say he wants a director who is not part of the “entrenched intelligence bureaucracy.” They say he’s suspicious of the intelligence establishment and believes it spied on him during and after the 2016 election, and is now withholding documents from investigators that could prove foreign intelligence was weaponized against him.\n\nIndeed, the dossier that was used as a basis to spy on his campaign proved to be false intelligence, possibly \"Russian disinformation,” as the New York Times recently acknowledged.\n\nThe president’s skepticism about the intelligence community goes beyond the 2016 election. He frequently reminds West Wing staff of what he calls the “fake intelligence” regarding Iraqi weapons of mass destruction that justified the 2003 U.S. invasion of Iraq. The stockpiles of WMD alleged in national intelligence reports were never found.\n\nSources say Hoekstra and Fleitz are less inclined to protect the CIA from investigation over the \"political surveillance” aimed at Trump and his campaign in 2016, as Barr recently described it. Both have the support of key Republican lawmakers, including Nunes and Sen. Chuck Grassley, who are fed up with ODNI \"stonewalling.”\n\n“They know they'd be more cooperative with classified document production concerning the investigations,” said a second source familiar with the nomination process.\n\nGrassley of the Senate Judiciary Committee was so furious with Coats for refusing to share information he sought for his investigation of the origins of the Russia “collusion” probe that he put a confirmation hold on an intelligence community nominee. He accused the intelligence czar of attempting to “hide documents” — including ones related to Justice Department official Bruce Ohr, who operated as a conduit between Steele and the FBI -- and he complained about it in a letter to Trump earlier this year.\n\nTrump also wants a reform-minded director unopposed to his goal of downsizing the ODNI, which has exploded in size with thousands of employees and a budget topping $60 billion. The relatively young agency now ranks among the largest bureaucracies in the 17-agency intelligence community.\n\nTrump originally told aides he wanted to altogether eliminate the agency, which he believes is an unnecessary layer of bureaucracy, but he cannot because it was set up by legislation.\n\nFleitz, who has the support of National Security Adviser John Bolton, has proposed restructuring ODNI, including slashing its “bloated” budget and jettisoning “redundant units.”\n\nIn recent opinion articles he’s written, Fleitz has indicated he would not only ensure more transparency of records revealing suspected politicization of intelligence during the 2016 presidential race, but protect whistleblowers at the CIA and other agencies who were pressured to “cook\" intelligence to support Obama administration foreign policies and objectives.\n\nThe CIA was run by Brennan from 2013 to 2017, and ODNI was run by Clapper from 2010 to 2017.\n\nA House intelligence report found that Clapper leaked dossier information to CNN just before Trump was inaugurated. He is now a CNN contributor and constant Trump critic. It was an attitude, some Langley veterans say, that preceded the 2016 election. Former CIA field operations officer Gene Coyle said that Brennan broke with his predecessors, who stayed out of elections. Several weeks before the vote, he made it very clear he was pulling for Hillary Clinton in published reports and interviews. His deputy Mike Morell publicly endorsed Clinton in the New York Times, claiming even then that Trump was an “unwitting agent” of Moscow.\n\n“The real question is why we are not hearing from more whistleblowers,” Fleitz wrote in National Review during Clapper’s and Brennan's tenures heading the intelligence community. \"We must find better avenues for intelligence whistleblowers so they can raise their concerns without fear of retaliation.\"", "description": "Above, the Office of the Director of National Intelligence in Tysons Corner, Va. (Intelligence.gov)\nBy Paul Sperry, RealClearInvestigationsAugust 28, 2019\nMore than three months after President Trump...", "authors": ["Ap Photo Charles Dharapak", "Vernon Bryant Dallas Morning News Via Ap", "Ap Photo Evan Vucci", "Ap Photo Peter Dejong", "Fredfleitz.Com Wikimedia"], "top_image": "https://assets.realclear.com/images/48/487258_5_.png"}