{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7621449/Oil-rig-workers-battle-rough-seas-30-minutes-free-17ft-whale-shark-fishing-rope.html", "downloaded_at": "2019-10-28 13:42:55.553304+00:00", "title": "Oil rig workers battle rough seas for 30 minutes to free a 17ft whale shark from a fishing rope", "language": "en", "text": "A stranded whale shark has been saved by oil rig workers after they noticed that its tail had been trapped in fishing rope.\n\nThe 17-foot-long marine creature was seen flapping violently in the water next to the structure in the Gulf of Thailand on October 19.\n\nDrillers on the Chevron platform rushed over to see what had happened and noticed a rope tied around the whale shark's tail.\n\nFishermen from a nearby trawler are believed to have lassoed the rope onto the creature either to catch it, or to drag it out of their net.\n\nThe marine animal then made its way towards the oil rig, perhaps as a cry for help knowing that humans there could save it.\n\nSupervisor Worawith Sirisuwan said he recognised the whale shark as he had previously seen it swimming by the rig, around 140 kilometres off the shore of Nakhon Si Thammarat province.\n\nDrillers on the Chevron platform in the Gulf of Thailand rushed over to see what had happened and noticed a rope tied around the whale shark's tail\n\nFootage shows how several members of the rig fought against the wave and the strength of the whale shark to pull it near so they could cut it loose\n\nHe gathered a team to help the whale shark after he was granted a permission by the manager. They spent 30 minutes freeing the animal.\n\nFootage shows how several members of the rig fought against the wave and the strength of the whale shark to pull it near so they could cut it loose.\n\nAfter freeing the animal, video footage shows it waving a fin at the workers.\n\nWorawith said he was relieved to have saved the whale shark from further suffering.\n\nHe said: 'The hardest part of this mission was pulling the whale shark close as it was so strong. We steadied him then cut him loose.\n\n'The waves were also so strong, which made it twice as hard to but we were able to do it and could free him eventually.\n\nWorawith said he was relieved to have saved the whale shark from further suffering. 'The hardest part of this mission was pulling the whale shark close as it was so strong. We steadied him then cut him loose'\n\n'The whale sharks always swim by our platform, especially when the storm is coming. We notice them and know it's a sign the weather is about to change.\n\n'When I was told about the whale shark stuck in a rope, the first thought popped up in my head was to help him because the employees here were familiar with him.\n\n'Everybody including me was so happy that we could help release him but we have to admit that it was quite hard work.'\n\nAnother worker who was involved in the rescue, Pitak Jiaknguluem, said the whale shark could have been the same fish that was seen earlier in the day near the offshore rig before disappearing. It reappeared later with the rope around its trail, he said.", "description": "Drillers on a Chevron platform in the Gulf of Thailand rushed to help when they discovered the 17-foot-long whale shark struggling after it became caught in fishing rope.", "authors": ["William Cole For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/10/20274964-0-image-a-6_1572259117784.jpg", "published_at": "2019-10-28"}