{"pub": "guardian", "url": "https://theguardian.com/cities/2019/oct/17/flickering-out-fans-fight-to-preserve-the-last-vintage-electrified-signs", "downloaded_at": "2019-10-17 10:31:52.316998+00:00", "title": "Flickering out: fans fight to preserve the last vintage electrified signs", "language": "en", "text": "Enthusiasts are pushing to have classic 20th century roadside signs across the US recognised as valuable parts of urban architectural history\n\nFlickering out: fans fight to preserve the last vintage electrified signs\n\nThey are garish, faded relics of a time gone by: the towering electrified signs signalling motels, diners, stores and bowling alleys that sprang up across the US in the 20th century.\n\nAs car culture boomed, brightly lit signs became the advertising method of choice for roadside businesses, with bold colours and cartoon-like graphics competing to grab the attention of passing drivers.\n\nMany are now under threat, either too expensive to maintain, destroyed by bad weather or torn down for new developments. However, a passionate following of vintage sign enthusiasts has evolved, with thousands of photos on Instagram using hashtags such as #signhunters, #signmongers and #signspotters. Popular accounts include @everything_signage, whose team of curators shares its favourites with 16,000 followers.\n\nMeet the ghost-sign hunters Read more\n\nThe first commercial electric signs used incandescent bulbs, before neon became popular in the 1940s and 50s, and their potential demise has prompted local movements to fight to preserve them as valuable parts of urban architectural history. The San Jose Signs Project, for example, aims to “get the city to acknowledge vintage signs as significant historic resources”. And Debra Jane Seltzer, who has spent 20 years documenting vintage signs in an extensive collection of more than 60,000 photographs on her website Roadside Architecture, says some cities are building sign parks, as a way of conserving them.\n\nBelow is a selection shared by Instagram’s #signhunters.\n\nGuardian Cities brings together the best in urban photography on Instagram at @guardiancities. Share your shots with us on Instagram with the hashtag #guardiancities", "description": "Enthusiasts are pushing to have classic 20th century roadside signs across the US recognised as valuable parts of urban architectural history", "authors": ["Claire Burke"], "top_image": "https://i.guim.co.uk/img/media/3df6bedd412911aba37d8bdaf335719d5f78eeb2/0_308_3442_2065/master/3442.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5776632dc2fe94dfb6aee30234c1f327", "published_at": "2019-10-17"}