{"pub": "zdnet", "url": "https://www.zdnet.com/article/want-1-5tb-of-ram-in-your-pc-it-will-cost-you", "downloaded_at": "2019-09-08 11:39:49.035985+00:00", "title": "Want 1.5TB of RAM in your PC? It will cost you!", "language": "en", "text": "2018 Mac mini RAM upgrade: step by messy, fiddly step Here's the verdict: yes, it's doable. But it's not easy and it's not for the faint of heart. In this video, David Gewirtz cracks open his brand new 2018 Mac mini and upgrades from 8GB to 32GB of RAM. It worked!\n\nApple's new Mac Pro can be kitted out with a whopping 1.5TB of RAM. But you don't need to have a Mac Pro to have that amount of RAM because there are many server and workstation boards available that can accommodate that amount of RAM.\n\nSee also Latest computer news at CNET\n\nBut how much does that amount of RAM cost?\n\nShort answer -- a lot!\n\nMust read: Apple has let down every iPhone user\n\nMotherboards now available that can be loaded out with 1.5TB of RAM have 12 slots for RAM stick, so to get to the 1.5TB mark you will need a dozen 128GB DDR4 ECC RAM sticks.\n\nAnd as you can imagine, this isn't the normal run-of-the-mill RAM that you can pick up from anywhere.\n\nAnd they're not cheap.\n\nI've done some shopping around, and the best pricing I can find puts these 128GB RAM sticks at about $1,500.\n\nEach. Yes, each.\n\nSome back of the envelope math -- or math in your head if you are good at that sort of thing -- put the price of 1.5TB of RAM at a cool $18,000.\n\nFor that, you could get a dozen 512BG iPhone XS Max handsets.\n\nIf you want a more modest amount of RAM, say 768GB, then the price comes down significantly, as a 64GB DDR4 ECC RAM stick is only -- only! -- $370. That means a dozen sticks come in at a more reasonable $4,440.\n\nYes, RAM is expensive.\n\nRead more: How much RAM does your Windows PC really need?\n\nWhat do you think? Let me know below!", "description": "It might seem insane, but there are certain situations where having 1.5TB of RAM might be useful (and no, it isn't so you can have a few Google Chrome tabs open!).", "authors": ["Adrian Kingsley-Hughes"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2019/07/05/e66a3e63-8f1c-4c91-85ef-cdca395ad20e/thumbnail/770x578/f76c6a1df500576890460633ebed66af/2019-07-05-12-28-04.jpg", "published_at": "2019-09-08"}