{"pub": "marketwatch", "url": "https://mansionglobal.com/articles/boyhood-home-of-polar-explorer-edward-wilson-hits-the-market-in-the-cotswolds-207997", "downloaded_at": "2019-10-09 00:39:41.358451+00:00", "title": "Boyhood Home of Polar Explorer Edward Wilson For Sale in the Cotswolds", "language": "en", "text": "A verdant Tudor-revival estate, where the ill-fated English adventurer Dr. Edward Wilson honed his skills as a naturalist, is selling in the Cotswolds for £985,000 (US$1.2 million).\n\n\n\nBuilt in the late 19th century, Hillcrest, as it’s now known, stands at the end of a narrow rural road by Cheltenham, England. Today, the estate comprises a four-bedroom main house, which is painted in white and black to imitate a timber-frame construction, as well as a garage and a half acre of formal gardens, according to the listing.\n\n\n\nMore: There are Two Homes Inside a Single Building in This Historic Victorian Estate Near London\n\nThe home hit the market last Friday with local estate agent Charles Lear, who did not return a request for comment. It last traded hands in 2003 for £425,500, according to property records.\n\n\n\nWhile the estate measures less than an acre today, there was a time when the property at the end of Crippetts Lane encompassed land enough for a future explorer to spend his days sketching nature and his nights sleeping under the stars.\n\n\n\nWilson, a famed polar explorer who froze to death alongside Capt. Robert Scott in 1912, spent his adolescence at the Cheltenham farm, according to historical accounts, including a 2011 biography by Isobel E. Williams.\n\n\n\nThe Wilson family moved to Crippetts Lane in 1885, when the future explorer was 13 years old. While his family raised chickens and cattle, a teenage Wilson was more interested in observing wildlife around their farm, according to the biography, “With Scott in the Antarctic: Edward Wilson.”\n\n\n\n“He made notes on birdsong, cloud formation, indeed anything that appealed to the naturalist and artist,” Ms. Williams wrote, adding that he would even sleep on the bare ground at night to “toughen his body.”\n\n\n\nHe also taught himself to memorize and reproduce colorful scenes from the sloping pastures around the farm, including a sketch of the house that sold at auction in London in 2012 for £1,125. His ability to paint from memory was critical in recreating harrowing images of wind-swept tundra after a day’s trek in the Antarctic.\n\n\n\nA Sunset from Hut Point in Antarctica, painted by Edward Wilson, on April 2, 1911, while on a fatal expedition to the South Pole. The Print Collector / Getty Images\n\nFrom Penta: Successful Welsh Wine Estate Asks £15 Million\n\nWilson eventually perished with the rest of Scott’s team in 1912, at the age of 39.\n\n\n\nToday, the four-bedroom house is being sold with plans already approved for an extension, according to the listing. The interiors feature mosaic tile floors, a large open kitchen and a great room with coffered ceilings.\n\n\n\nA plaque on the outside of the house commemorates his legacy. It reads the explorer “resided and explored here: his ‘little piece of heaven.’”\n\n\n\nThe current owners could not be reached for comment.\n\n", "description": "", "authors": ["Beckie Strum"], "top_image": "https://images.mansionglobal.com/im-114948?size=1.8311874105865522&width=1280", "published_at": "2019-10-08"}