{"pub": "rt", "url": "https://rt.com/usa/471168-g7-trump-golf-resort-putin", "downloaded_at": "2019-10-18 01:09:06.371995+00:00", "title": "White House announces G-7 summit in 2020 will be held at Trump Doral resort", "language": "en", "text": "Next year’s gathering of the G-7 will be held at the Trump Doral resort in Florida, the White House announced, despite objections from Democrats that using a property owned by the president violates emoluments prohibitions.\n\nTrump National Doral Miami was chosen as the site of the June 2020 summit, acting White House chief of staff Mick Mulvaney told reporters on Thursday. Three other sites were considered, including two in Utah and one in Hawaii.\n\nG-7 meeting for next year will be June 10-12, 2020 at the Trump National Hotel in Doral, Miami Florida. Media’s head explosion in 3,2,1.... @realDonaldTrump — Scottie Nell Hughes (@scottienhughes) October 17, 2019\n\nPresident Donald Trump had brought up Doral as the possible venue at the August G-7 summit in Biarritz, France, to a chorus of objections from media and Democrats. Any events at Trump hotels and properties in the US have been under intense scrutiny since the day he took office, as Democrats have argued that profiting from foreign guests would qualify as “emoluments” prohibited under the US Constitution. Multiple lawsuits on those grounds are still pending.\n\nMulvaney said Trump will not profit from the event “in any way, shape or form.”\n\nAsked if there was precedent for holding such a summit at a property owned by a president, Mulvaney said that no previous president has owned a venue that would qualify.\n\nAlso on rt.com Trump would ‘certainly’ invite Putin to next G7 summit\n\nHe also mentioned that Trump could invite Russian President Vladimir Putin as a guest of the summit, but said it “has not come up” whether he will. Russia was suspended from G-7 in 2014 at the Obama administration’s insistence, and Moscow has said it did not care to be invited back, preferring the G-20 as an international forum.\n\nThe Doral resort was built in the 1960s, but had fallen on hard times by 2012, when Trump – a billionaire real-estate developer before he ran for office – bought it out of bankruptcy for $150 million. He reportedly invested another $250 million into renovating the resort by 2016.\n\nto RT newsletter to get stories the mainstream media won’t tell you.", "description": "Next year’s gathering of the G-7 will be held at the Trump Doral resort in Florida, the White House announced, despite objections from Democrats that using a property owned by the president violates emoluments prohibitions.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5da8af9f85f540208b4e94ca.JPG", "published_at": "2019-10-18"}