{"pub": "metro", "url": "https://metro.co.uk/2019/10/12/sex-slavery-gang-sold-girl-outside-primark-found-guilty-human-trafficking-10905211", "downloaded_at": "2019-10-12 09:18:54.037060+00:00", "title": "Sex slavery gang who sold girl outside Primark found guilty of human trafficking", "language": "en", "text": "Vojtech Gombar led a trafficking gang (Pictures: PA/Universal)\n\nA sex-trafficking gang has been convicted of bringing women to the UK from Eastern Europe and forcing them into slavery and prostitution.\n\nOne victim was sold for £10,000 outside a branch of Primark, the High Court in Glasgow was told.\n\nVojtech Gombar, 61, Anil Raj Wagle, 37, Jana Sandorova, 28, and Ratislav Adam, 31, had all denied trafficking women from Slovakia into Glasgow.\n\nBut they were found guilty yesterday of forcing women into prostitution and servitude between November 2011 and February 2017.\n\nVojtech Gombar who was described as the ringleader of the gang (Picture: Universal)\n\nThe gang had arranged for eight women to be brought to Glasgow, where they were kept in flats in the city’s Govanhill area.\n\nFive of them were brought for arranged marriages with Pakistani men while the others were forced into prostitution.\n\nDuring the trial, one woman giving evidence via videolink from Slovakia said she had been offered a well-paid job in England picking potatoes.\n\nAdvertisement\n\nAdvertisement\n\nBut she arrived in Glasgow ‘afraid’ and then was sent to Ireland to marry a Pakistani man she did not know.\n\nShe told police that Gombar would receive 4,000 euros (£3,631) for the wedding.\n\nThe women were trafficked from the town of Trebisov, Slovakia (Picture: Universal)\n\nAnother woman told the court she was brought to the UK when she was four or five months pregnant, ‘for a better life’.\n\nShe was handed over to a Nepalese man outside Primark in Argyle Street, Glasgow, in 2014 for £10,000.\n\nThe woman also claimed that prior to being sold, she was made to sleep with Pakistani men for money.\n\nGombar was found guilty of 13 charges involving eight women, while Wagle was convicted of four charges, mainly involving one of the victims.\n\nSandorova was found guilty of six charges against two women and Adam was convicted of seven charges involving three of them.\n\nSandorova is Gombar’s step-daughter and Adam is her partner. All three are Slovakian, from the eastern town of Trebisov, from where most of the women were trafficked.\n\nWagle, who is from Nepal, became involved with the gang initially because he wanted to buy a bride.\n\nVojtech Gombar, one of four people who have been convicted for bringing women from Eastern Europe to Scotland to be exploited (Picture: PA)\n\nAnil Raj Wagle became involved as he wanted a bride (Picture: PA)\n\nProsecutor Kath Harper said: ‘Vojtech Gombar shows a clear, compelling and powerful pattern of behaviour in recruiting, transporting and exploiting women.\n\n‘He exploited them by forcing them into marriage with virtual strangers from which he benefited financially, and/or forcing them into prostitution, from which he and associates benefited.’\n\nAdvertisement\n\nAdvertisement\n\nOne of the victims was forced to have sex with two or three men a day for at least eight months.\n\nMs Harper told the court: ‘Her autonomy was completely stripped from her and her body became nothing but a vehicle for Gombar and others to make money.\n\n‘It is perhaps hard to imagine a more callous and uncaring way to treat another human being.’\n\nJana Sandorova is the step-daughter of Gombar (Picture: PA)\n\nRatislav Adam is one of four people who have been convicted for bringing women from Eastern Europe to Scotland to be exploited (Picture: PA)\n\nPolice said the women were ‘bought and sold like commodities.’\n\nThey became aware of the trafficking and exploitation in 2014 but it took a three-year operation before around 70 officers raided four flats and made their arrests.\n\nThe gang will be sentenced at a later date.\n\nPolice Scotland Detective Superintendent Fil Capaldi said: ‘Human trafficking is an insidious crime, often unseen, often unrecognised and has no respect for international borders.\n\n‘It has a devastating impact on the victims.\n\n‘In this case the crime group exploited vulnerable women using violence, threats and false promises to trade them and advertise in effect human beings to be bought and sold like commodities.\n\n‘This was all for the purposes of greed and financial gain without a single thought for the suffering and terror these women had to endure.’\n\nThe Judge, Lord Beckett, remanded all four in custody and praised the Slovakian authorities.\n\nHe said: ‘Without the invaluable international co-operation, this trial could not have taken place.\n\n‘Their efforts have allowed justice to be done in relation to very serious and damaging criminal conduct.’", "description": "A sex-trafficking gang has been convicted of bringing women to the UK from Eastern Europe and forcing them into slavery and prostitution. One victim was sold for £10,000 outside a...", "authors": ["Jane Wharton"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89532627_1570865902.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-12"}