{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/13/editorial-dc-push-for-indigenous-peoples-day-is-ba", "downloaded_at": "2019-10-13 23:36:12.713318+00:00", "title": "Renaming Columbus Day", "language": "en", "text": "ANALYSIS/OPINION:\n\nIn its latest spasm of virtue-signaling last week, the D.C. Council further burnished its far-left credentials by adopting “Indigenous Peoples’ Day” as a legal holiday, replacing Columbus Day, to be observed Monday, Oct. 14.\n\nIt was only a matter of time before the District followed the lead of about 130 other towns and cities across the country with liberal mayors and city councils that have jettisoned Christopher Columbus, who they characterize as racist and genocidal.\n\n“Christopher Columbus enslaved, colonized, mutilated, and massacred thousands of indigenous people in the Americas,” asserts the resolution (without any documentation) introduced by D.C. Council member David Grosso. It would be quite a mean feat for a single man to do all that, if it were true. But it’s little more than character assassination and historical revisionism at their worst.\n\nHistory records that Columbus was a deeply religious man, a devout Catholic often seen wearing the Franciscan habit. As Ben Broussard wrote in an August 2012 article for a Catholic group, the American Society for the Defense of Tradition, Family and Property about Columbus’ missionary zeal: “Upon his first encounter with the natives of San Salvador [an island now part of the Bahamas, where he first landed], Columbus concludes, ‘I recognized that they were people who would be better converted to our Holy Faith by love than by force.’” Columbus’ records also show he characterized the natives as “sweet and gentle.”\n\nAs to the claim the explorer “enslaved” the indigenous peoples he met, Mr. Broussard first notes that “slavery was already widespread among the native Indians when Columbus arrived.”\n\n“Columbus was insistent on the fair treatment of the Indians, a policy which gained him many enemies as governor of Hispaniola [the island now shared by Haiti and the Dominican Republic],” Mr. Broussard wrote, adding that “a Spanish friar who worked for the protection of the Indians [was] quick to excoriate the Spaniards in their grave abuses, but [was] filled with nothing but respect and admiration for Columbus.”\n\nDoes that sound even remotely like the kind of monster the left has morphed Columbus into? But then again, the left has never let facts stand in the way of its narratives.\n\n“Columbus Day is in reverence to a divisive figure whose actions against indigenous people run counter to the values of equality, diversity, and inclusion — values that the District of Columbia has long embodied — and serves only to perpetuate hate and oppression,” Mr. Grosso’s resolution harrumphs.\n\nThe repudiating of Columbus Day — a federal holiday since 1937 — in favor of Indigenous Peoples’ Day, dates back to 1992, when it was first adopted in Berkeley, California, the epicenter of far-left lunacy. That was Berkeley’s backhanded way of marking the 500th anniversary of the Italian explorer’s arrival in the New World in 1492.\n\nApart from asking why it took the District so long to climb aboard the anti-Columbus crazy train, the move raises another question: Is there no “progressive” policy or program, no matter how misbegotten, that the city won’t embrace?\n\nApparently not, because hot on the heels of this exercise in historical revisionism, the D.C. Council is now considering a measure that would make it the first jurisdiction in the country to extend full voting rights to prison inmates — while they’re still behind bars and regardless of how heinous their crimes were. (Paying their debt to society first? What a novel concept.)\n\nAll of this is what D.C. “home rule” has wrought, and it goes a long way toward explaining why the District’s decades-long bid to become the nation’s 51st state is deservedly going nowhere fast.\n\nBut we digress. There’s nothing wrong with official recognition of Native American peoples — akin to Black History Month or Hispanic Heritage Month — but it could have been done without slapping Americans of Italian heritage in the face by excommunicating Christoforo Colombo. In fact, a handful of the jurisdictions that adopted Indigenous Peoples’ Day observe it concurrently with Columbus Day.\n\nCuriously, the measure to rename the holiday was introduced as an “emergency” to fast-track it with “the Indigenous Peoples’ Day Emergency Declaration Resolution of 2019,” because, well, the forward-thinking D.C. Council couldn’t possibly have foreseen the second Monday in October was coming and acted sooner and in a more methodical fashion.\n\nUnder Congress’ constitutional oversight of the District, the measure requires congressional approval to become permanent. Unless Congress approves — and if the adults are in charge, it won’t — the name of the holiday will revert to Columbus Day next year. As it should.\n\nSign up for Daily Opinion Newsletter Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "In its latest spasm of virtue-signaling last week, the D.C. Council further burnished its far-left credentials by adopting \"Indigenous Peoples' Day\" as a legal holiday, replacing Columbus Day, to be observed Monday, Oct. 14.", "authors": ["The Washington Times Http", "The Washington Times"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2017/10/08/108_2017_hurt8201_c0-0-2237-1304_s1200x700.jpg?98ad83c8bedb2262feb1ec58688e29a04b97750b", "published_at": "2019-10-13"}