{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7626671/Michelle-Heaton-husband-Hugh-Hanley-discuss-plans-10-year-wedding-anniversary.html", "downloaded_at": "2019-10-30 00:13:27.914561+00:00", "title": "Michelle Heaton may renew vows for 10-year wedding anniversary", "language": "en", "text": "She's been happily married to husband Hugh Hanley since July 2010.\n\nAnd in an exclusive interview with MailOnline, Michelle Heaton, 40, admitted they haven't finalised plans for their upcoming 10 year wedding anniversary, but are considering renewing their vows as part of the celebrations.\n\nWhile teaming up with McDonald's to celebrate its first ever Halloween and limited edition pumpkin Happy Meal® box, the former Liberty X star insisted that whatever happens, they'll involve daughter Faith, seven, and son Aaron, five.\n\nEXCLUSIVE: Michelle Heaton, 40, revealed she and husband Hugh Hanley are considering renewing their vows to mark their upcoming 10 year wedding anniversary\n\nWhen quizzed about whether plans for their milestone wedding anniversary have been decided upon, the mum-of-two admitted they were still in discussion stages.\n\nShe said: 'Not yet. However, I think maybe we'll renew our vows but I don't wanna make it a massive thing. We'll definitely do something with the kids.'\n\nAsked what the secret is to such a successful, Michelle admitted: 'I suppose honesty, being really open and trust.\n\n'I couldn't handle not being trusted. He works away a lot with different people and we trust each other implicitly. Also, we never go to bed on an argument.'\n\nFamily matters: While teaming up with McDonald's Halloween campaign, the former Liberty X star insisted that whatever happens, they'll involve daughter Faith, seven, and son Aaron, five\n\nThrowback! Michelle has been happily married to husband Hugh since July 2010\n\nMichelle turned 40 in July, and revealed how her understanding of confidence has changed.\n\n'I think now that I am 40, I think that body confidence isn't necessarily how skinny you are, how ripped you are.\n\n'It's how happy you feel in that moment, and I know how important exercise is and sleeping well. You have to take each day as it comes, and today is a good day so far.'\n\nStill undecided: When quizzed about whether plans for their milestone wedding anniversary have been decided upon, the mum-of-two admitted they were still in discussion stages\n\nPossibilities: She said: 'Not yet. However, I think maybe we'll renew our vows but I don't wanna make it a massive thing. We'll definitely do something with the kids'\n\nAdmittedly, the television personality struggles with insecurities, but credits her children for needing her to power through.\n\nShe said: 'It's difficult because I have two young kids and I'm in menopause and I struggle hormonally. Sometimes I can't sleep and that effects my energy levels.\n\n'But whether I like it or not I have to get up, I have to do the school runs otherwise my kids are gonna jump on my head. So, before you know it you have to get up.\n\n'So even if I wanna stay in bed all day and have a bit of a cry, I've got my family and that's what keeps me going. I'm thankful for them.'\n\nChange: She revealed how her understanding of confidence has changed, saying: 'Now that I am 40, I think that body confidence isn't necessarily how skinny you are, how ripped you are'\n\nGrateful: Admittedly, the television personality struggles with insecurities, but credits her children for needing her to power through\n\nAnd does trolling have an impact? Michelle explains how she has suffered significantly less online abuse since revealing that she had undergone a double mastectomy, breast reconstruction and a hysterectomy.\n\nShe said: 'I think that now, it's less because I think, unfortunately, with what I've been through health-wise it makes people more aware to not troll me.\n\n'That shouldn't be the reason, I shouldn't need to have had life altering situations for people to be more sympathetic. People shouldn't troll in general.\n\nThankful: 'Even if I wanna stay in bed all day and have a bit of a cry, I've got my family and that's what keeps me going. I'm thankful for them' said Michelle\n\n'But the way I look at it is: You don't know who saying these comments, you don't know how tough their lives are.\n\n'So, it's very difficult to be mean back because you don't know who's sat there and may be suffering in some way.\n\n'Sometimes I want to scream down the phone and be horrible, because it's really upset my day.\n\n'But, if I do answer, I've learned to go: 'I'm sorry you feel so horrid towards me. Maybe unfollow me or I'm gonna block you – and leave it at that.'\n\n'I don't know who these people are or what they're going through.'\n\nTrolling: Michelle explains how she has suffered significantly less online abuse since revealing that she had undergone a double mastectomy, breast reconstruction and a hysterectomy\n\nSpeaking out: 'That shouldn't be the reason, I shouldn't need to have had life altering situations for people to be more sympathetic. People shouldn't troll in general' she said\n\nMichelle Heaton has teamed up with McDonald's to celebrate its first ever Halloween - until 31st October, families can enjoy the limited edition pumpkin Happy Meal® box and will be treated to spooky activity packs in restaurants and drive-thrus.\n\nSpeaking about her involvement, the television star said: 'It's really exciting. It's their first Halloween celebration, so I'm delighted to help launch it because Halloween is such a big deal!'\n\nPressed about how she balanced her love of fitness with McDonalds, Michelle insisted: 'You choose what you wanna choose. For me it's all about moderation.\n\n'McDonalds is a life saviour. As a mum of two, when you're struggling and you've had football pick-ups, gymnastics pick-ups and you're running late because you're stuck in traffic and you know they're not going to sit until you make them their evening meal, trust me, for me it's just part of my life.\n\nHonest: Michelle hasn't always had a healthy relationship with food, explaining: ' It comes in waves' and asserting: 'now I'm mature enough to know that it can be everything in moderation'\n\n'I believe everything in moderation and there should not be a reason for anything that you don't eat. And trust me, I love a Big Mac!'\n\nMichelle admitted that she hasn't always had a healthy relationship with food, explaining: 'It comes in waves.\n\n'I'm 40 now, and it depends what place I am in life. When I'm pregnant, everything's in moderation because I'm pregnant.\n\n'It depends on where you are in life and what you want out of life. But I do believe that now I'm mature enough to know that it can be everything in moderation.'", "description": "The former Liberty X star, 40, admitted they haven't yet finalised plans for the milestone wedding anniversary, but are considering renewing their vows", "authors": ["Ellie Phillips For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/16/20334392-0-image-a-145_1572365811502.jpg", "published_at": "2019-10-29"}