{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201704/03/WS59bb4625a310d4d9ab7e2204.html", "downloaded_at": "2019-10-05 13:41:11.954628+00:00", "title": "Chinese take to ice and snow", "language": "en", "text": "Xinniang continues to build winter sports infrastructure, with projects to construct venues for ski jumping, cross-country skiing and freestyle skiing. The autonomous region in Northwest China has seen an increase in people spending their spare time doing winter sports. [Photo by Xu Cong/China Daily]\n\nFor 76-year-old Zhang Baohua, skiing has been a daily routine during the snowy season in Northwest China's Xinjiang Uygur autonomous region for six years.\n\nFor Zhang, who lives in Changji, it is a 90-minute drive to the Xinjiang Silk Road ski resort, where he has become something of an icon to all of the resort staff and his fellow skiers.\n\nZhang took up skiing after his son bought him a new set of equipment. Skiing has since become the favorite outing for him and his family at weekends.\n\nThey are among the many beginning to spend more of their spare time on winter sports in the northwestern region. Xinjiang, which boasts areas of both ice and snow, has stepped into the fast lane in terms of developing its winter sports.\n\nIn an echo of China's overarching ambition to encourage 300 million people in the country to participate in winter sports ahead of the 2022 Winter Olympics, the Xinjiang Sports Administration has taken measures to provide a better environment for people in the region to partake in winter sports.\n\nDuring the 2017 Spring Festival, tourist visits to the Silk Road Resort reached 42,000－a year-on-year increase of 30 percent.\n\nXinjiang has also been making efforts in winter sports infrastructure construction, with projects to build venues for ski jumping, cross-country skiing and freestyle skiing. The region also plans to host a winter sports meeting for teenagers, called Stars of the Future, in a bid to stimulate young people's interest in winter sports.\n\nAs the main venue for the 2017 edition of Stars of the Future, the northeastern province of Heilongjiang has always been one of the main forces behind winter sports in the country. Stars of the Future attracted 37 delegations from different provinces and regions in China this year.\n\n\"I have never seen such heavy snow before. It is freezing here, but it is so much fun,\" said Zhang Yang, a youth from Wenzhou in the eastern Zhejiang province.\n\nSports officials have high hopes for competitions like Stars of the Future.\n\n\"Stars of the Future is a great platform to encourage children to take up winter sports,\" said Liu Fumin, director for youth sports at China's State General Administration of Sports.\n\nMore winter sports programs are to be introduced into schools in Beijing, with the Chinese capital set to host the 2022 Winter Olympics along with the nearby city of Zhangjiakou.\n\n\"Winter sports in schools had their day years ago in Beijing, but by 2022 we will bring it back to schools,\" said Wang Jun, an official with the Beijing Municipal Education Commission.\n\nChina plans to have more than 2,000 schools that feature winter sports prominently by the year 2020, and more than 5,000 by 2025. This blueprint is not only meant to be carried out in developed areas, but also to plant seeds in underdeveloped and remote areas.\n\nKangle is a little-known village in the northwestern Qinghai province. Locals often ski at local resorts, as was the case during the Chinese lunar new year holiday in February.\n\nA group of cousins enjoyed the slopes together, with the eldest brother continually slipping on the ground, much to the amusement of his family members. One of the six cousins, 19-year-old Guo Nina, has been skiing for three years. She is quite agile on the snow, and is always happy to show off her skills.\n\n\"There are more winter sports places popping up in recent years, which has provided us with new places to go for our family gatherings,\" said Guo.\n\nYoung people are not the only ones who enjoy winter sports in China's rural areas. Li Ruyong, 45, from Gansu province in the northwest, took his family on a vacation to Kangle, and said it recalled some great childhood memories.\n\n\"When I was a child, we had nothing to do during winter－the only thing that we could do for fun was to ski on a shovel. Now that I am skiing again, this deja vu makes me feel much younger,\" said Li.\n\nKangle has become a place for people from Gansu, Sichuan, Ningxia and other nearby provinces to take to the slopes and create their own memories. \"We had about 2,600 visitors every day during the Spring Festival, 1,000 more visitors than last year,\" said Liu Pingli, vice-general manager of Kangle ski resort.\n\nChina's sports governing bodies said they aim to get more people taking part in winter sports.\n\n\"We will work hard to carry out the five-year plan (2016-2020) on public fitness, and pledge efforts to introduce winter sports to the public,\" said Liu Guoyong, director for public sports at the country's sport governing body.\n\nNorth China's Inner Mongolia autonomous region has mapped out a detailed plan to consolidate a mass base of support for winter sports. More skating rinks and ski resorts will be built, more winter sports schools will be established and more courses will be opened.\n\nThe push for development of winter sports infrastructure is not only limited to China's colder provinces. Guizhou in the southwest will also build more indoor skating rinks and outdoor ski resorts, according to Song Guoqiang, deputy director of the Guizhou Sports Bureau.\n\nAbove all, more people taking part in winter sports means more talent at the professional level.\n\nSpeed skater Yang Yang, a member of the International Olympic Committee and the first Chinese Winter Olympic champion, believes that mass participation will help spread Olympic values and help China become competitive in international competitions.\n\n\"We made a commitment to bring 300 million people into the fold of winter sports in our bid for the 2022 Winter Olympics. We are now on the right path, but the task will take patience, hard work and require the whole society to collaborate,\" said Yang.", "description": "", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201709/15/59bb4625a310d4d95c4ba25f.jpg", "published_at": "2017-04-03"}