{"pub": "cbs", "title": "Trump administration plans to ease rules on methane, a major contributor to climate change", "url": "https://cbsnews.com/news/trump-methane-rollback-energy-industry-may-get-looser-oversight-from-trump-proposal-to-ease-methane-rules", "language": "en", "published_at": "2019-08-29", "downloaded_at": "2019-09-02 07:28:26.815377+00:00", "text": "Oil and gas companies may face far looser oversight of emissions of potent climate-changing methane gas under a proposal expected from the Trump administration as soon as Thursday, oil industry and environmental groups said.\n\nThe government's plan would ease requirements on oil and gas sites to monitor for methane leaks and plug them. But not all energy companies are in support of the plan, with Shell U.S. President Gretchen Watkins telling the Washington Post on Thursday that it supports national limits on methane.\n\nThe Environmental Protection Agency's move would be the latest in a series by the administration easing Obama-era emissions controls on the oil, gas and coal industries, including for methane.\n\nMethane is a component of natural gas that's frequently wasted through leaks or intentional releases during drilling operations. The gas is considered a more potent contributor to climate change than carbon dioxide, although it occurs in smaller volumes.\n\nUnder President Trump, both the Interior Department and the EPA have proposed a series of rules — some blocked by courts — to loosen regulations of methane emissions.\n\nEnvironmental concerns\n\nEnvironmental advocates expected the new methane plan to go further than previous proposals, with a goal of exempting companies from requirements to detect and stop methane leaks at existing oil and gas sites.\n\nFor the EPA, part of the goal is \"they want to get rid of direct regulation of methane,\" said Matt Watson, a vice president of the energy program at the Environmental Defense Fund, an advocacy group.\n\nOther environmental activists expressed their concerns with the proposal, such as environmentalist and 350.org founder Bill McKibben, who wrote on Twitter, \"The fracking boom is spewing clouds of methane, it's a huge driver of climate change, and now we're going to drop the (minimal) regulation we've had in place.\"\n\nThis is literally insane. The fracking boom is spewing clouds of methane, it's a huge driver of climate change, and now we're going to drop the (minimal) regulation we've had in place. Trump and his buddies are pure nihilists. https://t.co/pi9GmEfoHf — Bill McKibben (@billmckibben) August 29, 2019\n\nThe oil and gas industry is the nation's primary source of methane emissions, according to the EPA, accounting for nearly one-third in 2016.\n\nOil industry is split\n\nThe administration rollbacks on emissions from oilfields, storage sites and pipelines have split the oil industry, worrying some in the industry about growing blowback in a world increasingly mindful of climate change.\n\nShell U.S. told the Washington Post it would continue to work toward its goal of reducing its methane leaks to less than 0.2 percent by 2025.\n\n\"We believe sound environmental policies are foundational to the vital role natural gas can play in the energy transition and have made clear our support of 2016 law to regulate methane from new and modified onshore sources,\" Shell's Watkins told the publication. \"Despite the administration's proposal to no longer regulate methane, Shell's U.S. assets will continue to contribute to that global target.\"\n\nRoyal Dutch Shell this year urged the administration to crack down — not ease up — on the emissions. Many others in the oil and industry have welcomed the easing, however.\n\nThe latest rollback \"highlights the Trump administration's complete contempt for our climate,\" Kassie Siegel of the Center for Biological Diversity, an environmental group, said in a statement. \"The EPA is now so determined to actually increase greenhouse pollution that it's even shrugging off concerns from oil and gas companies about gutting these protections.\"", "description": "The Trump administration's proposal would ease requirements on energy companies to monitor for methane leaks", "authors": [], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2018/01/10/794dc389-dc87-4fcd-b455-37f37cc11d4d/thumbnail/1200x630/7e347d5d2c3362a1f08b481e34d06fe4/0110-social-methane-1479217-640x360.jpg"}