{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/08/good-now-china-south-park-apologises-banned-communist-party", "downloaded_at": "2019-10-08 10:01:12.491402+00:00", "title": "'We good now, China? South Park 'apologises' after being banned by Communist Party", "language": "en", "text": "The creators of South Park have issued an irreverent mock apology to the Chinese government after reports that the show has been censored on Chinese streaming services and social media.\n\nThe statement from Trey Parker and Matt Stone made fun of censorship of comparisons of Xi Jinping, the Chinese President, with Winnie the Pooh, and called out the National Basketball Association (NBA) for apologising over the support expressed by one of its officials for the Hong Kong protest movement.\n\n“Like the NBA, we welcome the Chinese censors into our homes and into our hearts. We too love money more than freedom and democracy. Xi doesn’t look just like Winnie the Pooh at all,” read a statement issued by the South Park Twitter account.\n\n“Tune into our 300th episode this Wednesday at 10! Long live the Great Communist Party of China! May this autumn’s sorghum harvest be bountiful! We good now China?”\n\nThe American satirical animation series, famed for taking swipes at global events and society without fear or favour, reportedly incurred the wrath of China’s fierce censors over a recent episode “Band in China” which critiques the way Hollywood allegedly tries to mould its content to avoid offending Beijing.", "description": "The creators of South Park have issued an irreverent mock apology to the Chinese government after reports that the show has been censored on Chinese streaming services and social media.", "authors": ["Nicola Smith", "Macer Gifford", "Madeline Grant"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/08/TELEMMGLPICT000212389871-xlarge_trans_NvBQzQNjv4BqNJjoeBT78QIaYdkJdEY4CnGTJFJS74MYhNY6w3GNbO8.jpeg?imwidth=1200", "published_at": "2019-10-08"}