{"pub": "yahoo", "url": "https://news.yahoo.com/beyond-meat-hamburgers-at-mc-donalds-wont-be-a-big-deal-top-strategist-144457156.html", "downloaded_at": "2019-09-27 00:03:53.129350+00:00", "title": "Beyond Meat hamburgers at McDonald's won't be a big deal: top strategist", "language": "en", "text": "Bullish Beyond Meat (BYND) investors craving a tie up with fast-food behemoth McDonald’s (MCD) may want to temper that hunger, says one top Wall Street analyst.\n\n“I don’t doubt the potential of it [a tie up], but I do think it will be interesting to see if it will happen. I would just call out two caveats to the bullish view. One if it’s a straight supply agreement, I don’t think that’s advantageous to Beyond Meat long-term — that creates volatility in their customer base because it probably implies that McDonald’s down the road might be more inclined to make their purchasing decisions on economics than brand affinity,” explained D.A. Davidson food analyst Brian Holland.\n\nMERTHYR TYDFIL, UNITED KINGDOM - AUGUST 06: McDonald's Golden Arches sign seen on August 6, 2018 in Merthyr Tydfil, United Kingdom. (Photo by Matthew Horwood/Getty Images) More\n\nHolland, who initiated coverage on Beyond Meat’s stock with a Sell rating several weeks ago due to concerns on the adoption of plant-based food by consumers, added “Nestle makes a vegan sandwich for McDonald’s in Germany and Israel as well. They are bringing a plant-based burger to the U.S. this fall. I just think there are other solutions out there.”\n\nBeyond Meat without question has wracked up several big partnership deals this year in the fast-food space. From one with Dunkin’ Brands (DNKN) for a sausage breakfast sandwich to faux chicken at Yum! Brands-owned Kentucky Fried Chicken (YUM) , Beyond Meat has shown it’s moving aggressively to expand distribution.\n\nThat’s part of the reason for the stock’s explosive 136% move higher since the May 2 initial public offering.\n\nCredit: David Foster/Yahoo Finance More\n\nBut despite the major wins, Wall Street continues to eagerly await for Beyond Meat to land McDonald’s as an account. All signs suggest that a deal happening at some point.\n\nBeyond Meat counts former McDonald’s CEO Don Thompson as a board member. Meanwhile, consumer interest in plant-based foods continues to surge — so it’s bizarre McDonald’s hasn’t at least tested something with Beyond Meat or rival Impossible Foods in the U.S.\n\nNonetheless, Holland advises caution, should Beyond Meat land McDonald’s. Holland only estimates $90 million in gross sales long-term from a deal between the two companies.\n\nIf Holland’s math is correct, that may let down the Beyond Meat bulls.\n\nBrian Sozzi is an editor-at-large and co-anchor of The First Trade at Yahoo Finance. Follow him on Twitter @BrianSozzi\n\nYahoo Finance's live morning show. More\n\nRead the latest financial and business news from Yahoo Finance\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.", "description": "Beyond Meat Big Macs may not be a big deal for the stock, argues one top Wall Street analyst.", "authors": ["Brian Sozzi"], "top_image": "https://s.yimg.com/uu/api/res/1.2/GlPgQtOzNxkgx4xpMq.pvA--~B/aD0zNDU2O3c9NTE4NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/60a0eb10-dae7-11e9-85f7-fae11e07aa3a", "published_at": "2019-09-19"}