{"pub": "cnbc", "url": "https://cnbc.com/2019/10/17/how-a-28-year-old-making-80000-dollars-a-year-in-washington-dc-spends-her-money.html", "downloaded_at": "2019-10-18 01:08:18.539488+00:00", "title": "How a 28-year-old homeowner making $80,000 a year in DC spends her money", "language": "en", "text": "This story is part of CNBC Make It's Millennial Money series, which profiles people across the U.S. and details how they earn, spend and save their money. Angel Thompson, 28, lounges in a comfortable chair in her teal living room. She gazes out the back window at the brand-new iron security gate that separates her backyard from the alley. Thompson and her sisters recently painted it baby blue. That gate cost $10,000, which she put on a credit card. But for Thompson, that's the price of being a homeowner.\n\nAngel Thompson outside her home in Washington, D.C. CNBC Make It\n\nThere used to be a wooden gate in the backyard of her two-bedroom home in Washington, D.C.'s Shaw neighborhood, but it was old and frequently blew open. One day, her neighbor called to let her know it had happened again — but this time the gate had completely detached from the fence. Thompson came home to find it lying in the street behind her house. That's when she decided to purchase a heavy-duty iron version, which came with two matching security doors. Although the expensive purchase drove up her credit card balance, it was worth it: \"It's not a typical driveway gate,\" Thompson tells CNBC Make It. \"It's an investment. It adds security to my home and increases my home's value.\" Despite the sometimes expensive challenges of maintaining a house, it's important to Thompson to be a homeowner in the place where she grew up. \"I always knew I wanted to own in the city,\" she says. \"Renting never made sense to me.\"\n\nI always knew I wanted to own in the city. Renting never made sense to me. Angel Thompson\n\nThompson purchased her house in 2017 with the help of D.C.'s Home Purchase Assistance Program, which helps residents with low-to-moderate incomes afford homes in the city. Thompson was making $45,000 at the time, which qualified her for the program. She received a $64,000 loan from HPAP, and if she lives in the home for at least 15 years, she doesn't have to pay the money back, she says. That's just fine with Thompson — she never wants to leave D.C. \"I'm a native Washingtonian,\" she says. \"I don't see myself living anywhere else.\"\n\nWhat she earns\n\nThompson earns $80,000 a year as a project manager of cultural resources at the National Park Foundation. She helps lead the foundation's efforts to digitally preserve and share African-American history, culture and community stories through America's national parks. The position combines Thompson's passion for African-American history and culture with her interest in improving the visitor experience at museums. Plus, she gets to travel all over the country to visit the sites of the projects she works on, including the Martin Luther King, Jr. National Historical Park in Atlanta, Georgia, and the Harriet Tubman National Historical Park in Auburn, New York. Her favorite site to date is the Fort Monroe National Monument in Virginia, she says: \"That is the site where, in 1619, the first African Americans were brought to American soil. But it's also the site where African Americans liberated themselves during the Civil War.\"\n\nAngel Thompson types at her desk. She is a project manager for the National Park Foundation, where she helps lead the foundation's efforts to digitally preserve and share African American history, culture and community stories through America's national parks. CNBC Make It\n\nThis is still a relatively new gig for Thompson: She was unemployed for six months after losing her previous job during the federal government shutdown earlier this year. But her new role came with a big salary bump. \"Prior to being at the National Park Foundation, I was earning $45,000 a year working for the federal government,\" she says. \"Making $80,000 a year with one job definitely gives me the work-life balance I didn't know that I needed,\" she adds. And although the higher salary is appreciated, it's not necessary for Thompson to live a full life in the nation's capital. \"I've lived comfortably in D.C. making half of this salary,\" she says. \"My lifestyle has not changed that much — I still do the same amount of shopping and splurging, and I still take the same number of trips, but I'm able to save more.\"\n\nHow she budgets\n\nHere's a breakdown of how Thompson saves and spends in a typical month. Thompson keeps a close eye on her finances and checks the budgeting app Mint at least once a day. \"Whenever I swipe my card, I check to see if the money has been categorized correctly or just to get a glimpse of what my finances look like for the day,\" she says. It gives her a sense of control over her money and helps her keep track of where it goes.\n\nDebt repayment: $1,839\n\nDebt repayment makes up the largest portion of Thompson's monthly budget. While she has five credit cards, she only carries a balance on one. Thompson puts around $1,500 toward the $9,000 balance each month so she can pay off the debt as quickly as possible and avoid racking up additional interest.\n\nAngel Thompson and her boyfriend in Washington, D.C. Source: Angel Thompson\n\nThompson got her undergraduate degree at Tufts University. She earned so many scholarships and received so much financial aid, she jokes that she got paid to go to college. But graduate school was a different story: She took out about $100,000 in loans to earn her master's degree in museum studies and historic preservation from Morgan State University in Baltimore and pays $339 toward the debt each month. Thompson hopes to take advantage of the public student loan forgiveness program offered by the federal government, which she's eligible for through work. If the program works out for her, Thompson will have the majority of her loans forgiven after making 10 years of consecutive payments, which means she'll end up paying around $27,000 on her loans, rather than the full $100,000.\n\nSavings: $1,280\n\nThompson nearly drained her savings when she was unemployed, but now that she's working again, she's building it back up. She currently has around $1,000 in savings and aims to add between $800 to $1,200 each month to her account. She expects to be able to contribute more once she eliminates her credit card debt. Thompson also puts $200 into her employer-sponsored 403(b) plan and $80 into a flexible spending account. After a year at her job, she'll be eligible for a 5% match on her 403(b) and plans to bump up her contributions to take full advantage of it.\n\nHousing: $886\n\nThompson's mortgage runs her $878 per month. She also pays an additional $100 per year for zone permits to park in the city, which comes out to around $8 per month. Despite owning her own place, Thompson's housing costs are low, thanks in part to finding a great deal on her property. \"The market value for my house is around $800,000, but they sold it to me for $250,000,\" she says. In addition to the $64,000 HPAP loan, she contributed another $13,000 of her own savings to the down payment, bringing her initial mortgage costs to roughly $175,000 total. When she can, she pays an additional $500 a month toward her mortgage in order to pay down the balance faster, and she expects to pay it off in full within eight to nine years.\n\nAngel Thompson holds the keys to her home. She purchased her house in 2017 with the help of D.C.'s Home Purchase Assistance Program (HPAP), which helps residents with low-to-moderate incomes afford homes in the city. CNBC Make It\n\nThompson had started saving up for her own home well before discovering the government assistance program. After graduating from college, she moved back to D.C., where she simultaneously worked two jobs and an internship while going to grad school full-time. \"I had no time to actually spend the money that I was earning,\" she says. Thompson also commuted to Baltimore for her graduate program — which could take up to three hours each way when traffic was heavy — so that she could save more money. During that time, she lived with her sister, who only charged her $500 per month in rent.\n\nSelf-care: $640\n\n\"I am a firm believer in self-care,\" Thompson says. For her, that's \"everything that pampers me,\" including spending $100 to get her hair done each month, $10 for her eyebrows and bi-monthly mani-pedis for $60 each. She also spends $100 for a subscription to The Red Door, a salon and spa, which allows her to indulge in a monthly massage or facial. Exercise is also a top priority for Thompson. She pays $190 a month for a membership at Orange Theory, a fitness boutique that mixes cardio with strength training exercises, and another $120 a month at Election Cycle, a local spin studio.\n\nFood: $550\n\nThompson spends around $100 a month at her local grocery store. She also makes monthly trips to Costco — her family members share their memberships — where she stocks up on $200 to $300 worth of groceries. Thompson cooks breakfast at home most mornings, but tends to eat out fairly often for lunch and dinner. \"My boyfriend and I go out almost every other day,\" she says, adding that he generously picks up the tab the majority of the time. Between date night dinners, happy hours and weekday lunches, Thompson spends around $250 a month dining out.\n\nAngel Thompson and her boyfriend. Source: Angel Thompson\n\nHowever, she refuses to spend money on coffee, despite drinking it daily. \"I hate the fact that you can buy a bag of coffee for five bucks, but if you go to Starbucks or any other coffee store, you're spending $6 a cup.\"\n\nTransportation: $120\n\nTo get around D.C., Thompson primarily walks or drives. Her car, a 2012 Nissan Juke, is paid off, but she spends around $60 on gas each month. She bought the car pre-owned in 2013 for around $24,000. Because she doesn't drive often, her maintenance costs are negligible. Thompson also uses Lyft from time to time, which runs her about $60 per month.\n\nEverything else:\n\nInsurance: $333 (Includes health, car and home)\n\nUtilities and Wi-Fi: $210\n\nEntertainment: $150\n\nDonations: $100 (She donates money and clothing to a local women's shelter)\n\nPhone: $90\n\nBook club: $25\n\nDry cleaning: $20\n\nApple Music: $10\n\nNetflix: $4 (Shares an account with her sisters)\n\nWhat the experts say\n\nCNBC Make It asked Pamela Capalad, a certified financial planner and founder of Brunch & Budget, to share where Thompson is doing well and how she could manage her money better.\n\nPamela Capalad, certified financial planner and founder of Brunch & Budget Source: Pamela Capalad\n\nOverall, she thinks Thompson is doing great. \"She's in a place where she's working toward financial stability coming back from this period of unemployment, but she has all the right tools to be able to get there pretty quickly,\" Capalad says.\n\nIt's great that she prioritizes saving\n\nThompson's ability to save stands out to Capalad. When Thompson was unemployed, she was able to rely on her savings to get through, which is exactly what an emergency fund is for. Now, it's smart that Thompson is taking steps to replenish what she spent. \"She has a lot of her priorities in a good place, especially when it comes to understanding the need to rebuild her savings,\" Capalad says.\n\nShe could maximize her savings with a high-yield account\n\nWhile it's commendable that Thompson is able to save about $1,000 every month, she could be making her money work harder for her by putting it into a high-yield savings account. \"A lot of people don't think about their savings as a place where you could earn money with your money in a safe way,\" Capalad says.\n\nA lot of people don't think about their savings as a place where you could earn money with your money in a safe way. Pamela Capalad certified financial planner and founder of Brunch & Budget\n\nJust by transferring her savings to an online bank like Ally, Marcus or a host of others, Thompson can earn more than 20 times the amount of interest she's getting from a traditional account. \"It really makes a difference getting 2% interest on your money versus 0.1% interest, which is what most big banks are paying,\" Capalad says.\n\nIt's OK that she has credit card debt\n\nFinancial experts rarely condone debt, but Capalad points out that in this case, Thompson used her credit card as a means to be able to maintain her home while unemployed, and there's nothing wrong with that. \"With credit cards, it's never black and white,\" she explains. \"The reason we have access to this as a tool is for situations like this.\"\n\nStill, it's important to understand the reality of credit card debt and focus on paying it down as quickly as possible, which Thompson is doing. \"She had a plan and is implementing the debt paydown side of it,\" Capalad says.\n\nIt would be helpful to create a savings plan\n\nCapalad gives Thompson a lot of credit for saving so much cash, but she recommends she develop a clear plan for her savings. A good place to start would be deciding how much she wants to save in her emergency fund. The general rule of thumb is to build up three to six months' worth of savings. Once Thompson hits that milestone, she can reevaluate where her money is going and decide if she wants to contribute more to her 403(b) or begin investing through a brokerage account, Capalad says.\n\nAngel Thompson reads a book at home. She hosts a monthly book club with her friends. CNBC Make It\n\nBut for now, she's doing fine. \"She has all of these other expenses that she's currently juggling, plus rebuilding her savings,\" Capalad says. \"I think those are the priorities that she should focus on.\"\n\nShe bought a home for the right reasons\n\nCapalad is impressed that Thompson successfully navigated the Home Purchase Assistance Program, as well as used her own savings to buy a home. \"If you can't see yourself in a place for longer than five years, it might not make sense to put all that money into a home, try to maintain it and then have to sell in five years,\" Capalad says, noting that Thompson purchased her house for all the right reasons. She cautions against simply thinking of a home as an investment. If you do that, then \"you're counting on the home to appreciate in value by the time you're ready to sell it,\" which doesn't always happen. Before buying, Capalad recommends asking yourself why you want to. If the answer is to eventually make a profit or stop \"throwing money away\" by renting, it might not be the right choice for you.\n\nAngel Thompson's living room. CNBC Make It", "description": "Angel Thompson, a 28-year-old project manager for the National Park Foundation, earns $80,000 a year and owns her own home in Washington, D.C. Here's how she spends her money.", "authors": ["Emmie Martin"], "top_image": "https://image.cnbcfm.com/api/v1/image/106185831-1571262547134mmangelthompson3.jpg?v=1571262619", "published_at": "2019-10-17"}