{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3069332&cloc=joongangdaily|home|newslist1", "downloaded_at": "2019-10-22 13:20:06.148736+00:00", "title": "Euisun Chung talks Hyundai’s flying car future", "language": "en", "text": "Hyundai Motor Group Executive Vice Chairman Euisun Chung, second from left in the front row, poses with employees at the group’s Yangjae office in southern Seoul on Tuesday. [HYUNDAI MOTOR GROUP]\n\nHyundai Motor Group Executive Vice Chairman Euisun Chung said he expects flying cars and robotics to take up half of the group’s business in the future during a meeting with employees Tuesday.While Hyundai Motor has been holding so-called town hall meetings with employees since the start of this year, this is the first time Chung has attended to share his vision and answer questions.“I’m expecting [our business to consist of] 50 percent cars, 30 percent private air vehicles and 20 percent robotics,” Chung said. “We will keep making cars for sure … [but] we will transform into a company that offers mobility services through diverse transport media.”This isn’t the first time Chung has mentioned flying cars. Last month, the group established an urban air mobility division and hired an expert from the U.S. National Aeronautics and Space Administration, Shin Jai-won, to head the business. The group said in a statement that the division will be establishing a road map to enter the global air mobility market and develop airborne travel systems.When asked by an employee how he intends to overcome difficulties in the slow growing auto industry, Chung said the company needs to make industry-leading services and solutions on top of manufacturing cars.“Globally there are about 25 million cars oversupplied … and there will be a lot of companies disappearing in the future auto industry,” Chung said. “Securing competitiveness is the most important thing … and customers will choose our cars when we can offer good services and solutions.”He also discussed corporate culture.“I think when employees are satisfied, that is [an ideal organization].”BY KIM JEE-HEE [kim.jeehee@joongang.co.kr]", "description": "", "authors": [], "top_image": "https://pds.joins.com/jmnet/koreajoongangdaily/_data/photo/2019/10/22195301.jpg", "published_at": "2019-10-22"}