{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7630341/Last-night-shocked-John-McDonnell-sends-Labour-members-Twitter-tizz.html", "downloaded_at": "2019-10-30 16:11:12.327100+00:00", "title": "'Last night you shocked me': John McDonnell sends Labour members into a Twitter tizz", "language": "en", "text": "John McDonnell's bizarre blanket email to Labour Party supporters has sent Twitter into mocking meltdown.\n\nThis morning, the shadow chancellor emailed everyone on the party's address book with the subject line 'last night you shocked me', followed by their name.\n\nJeremy Corbyn's right-hand man was hailing the £190,000-worth of donations raised by activists in the wake of the December 12 general election announcement.\n\nBut many recipients made a rather more seedy interpretation and flooded social media with hilarious reactions and made-up stories about what they got up to last night with the politician.\n\nSocial media exploded with mockery earlier today after an email sent by John McDonnell with the subject like: 'Last night you shocked me'\n\nThe shadow chancellor was actually hailing the £190,000-worth of donations raised by activists in the wake of a December 12 general election announcement\n\nPaul McManus tweeted: 'Why is John McDonnell messaging me like I just gave him the ride of his life?'\n\nAndy Cumella wrote: 'Last night I took my cat to the vet, cooked dinner and watched Bake Off. I'm not too sure what John McDonnell finds shocking about that.'\n\nJournalist John Crace sarcastically posted: 'Disappointed that some many others also managed to shock John McDonnell last night. I really thought we had something special.\n\nThe email - presumably sent by Labour's press team on behalf of the Opposition frontbencher - ramped up the party's fundraising drive ahead of the crunch election campaign.\n\nMany recipients made showcased their wit and flooded social media with hilarious reactions to the email\n\nIt read: 'As soon as Parliament voted to hold the election, supporters like you dashed to kickstart our campaign, with over £190k raised just last night!\n\n'Will you consider making a donation to support our ambitious campaign?'\n\nBut the fundraising strategy was seen as a flop by many, who poured scorn on the email.\n\nAlthough most recipients made light-hearted jokes, some appeared genuinely frustrated that the gaffe had been signed off.\n\nJournalists also piled in with the ridicule and invented fictional scenarios about what they did with the shadow chancellor last night\n\nLabour member Martin Warne tweeted: 'What kind of despicable, spammy marketing s*** is that? Please Labour, don't stoop to this. It's horrible.'\n\nThe barrage of ridicule comes after Mr Corbyn filmed a toe-curling video to kick off the campaign.\n\nIn a cringey Instagram post, the Labour leader awkwardly clapped his hands as he declared the party is 'back'.\n\nThe Labour Party did not want to provide comment.", "description": "This morning, the shadow chancellor emailed everyone on the party's address book with the subject line 'last night you shocked me', followed by their name.", "authors": ["Jack Elsom For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/12/20374404-0-image-a-51_1572438779374.jpg", "published_at": "2019-10-30"}