{"pub": "townhall", "url": "https://townhall.com/tipsheet/cortneyobrien/2019/10/01/former-dem-senator-im-friends-with-joe-but-this-is-inexplicable-n2553975", "downloaded_at": "2019-10-02 00:33:09.050510+00:00", "title": "Former Dem Senator: I'm Friends With Joe, But 'This Is Inexplicable'", "language": "en", "text": "Former New Jersey Democratic Sen. Robert Torricelli is torn. On the one hand, he's friends with former Vice President Joe Biden. On the other, Biden's Ukrainian scandal is \"inexplicable.\" He tried to sort out his mixed feelings during a Fox News panel discussion on Tuesday.\n\n\"This is a painful thing because I like Joe,\" Torricelli said. \"And I think he’s a very fine man. I think he’s served his country admirably. But some of this is inexplicable.\"\n\nBiden's son Hunter served on the board of Burisma Holdings and reportedly earned hundreds of thousands of dollars while the company was under investigation. Related reports suggested that Biden, who was vice president at the time, tried to get the Ukrainian prosecutor involved in the investigation fired. Biden recently told Fox News that he \"never\" talked to Hunter about his overseas business dealings. But on Monday Fox News host Tucker Carlson revealed a photo of Biden golfing with Burisma executive Devon Archer, shooting a hole through the 2020 candidate's story.\n\nIt's not exactly what Democratic voters want to hear for the next year. They'd prefer a candidate who can talk about the issues, not their issues.\n\n\"It is hard to imagine a Democratic primary electorate witnessing this spectacle,\" Torricelli reasoned.\n\nIt's all rather \"unseemly\" and it is \"almost certain to accelerate\" Biden's decline in the polls and provide a clear path for Sen. Elizabeth Warren, Torricelli predicted.\n\n\"I’m a Joe Biden friend,\" the senator said. \"Would I have voted for him in the primaries? Probably not.\"", "description": ".10/01/2019 20:29:05PM EST.", "authors": ["Cortney O'Brien", "Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/images/2019/274/e7a93ab2-dd63-44d4-9bb0-3396dc162bb2.png", "published_at": "2019-10-01"}