{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/oct/28/jair-bolsonaro-brazil-paramilitaries-corruption-david-miranda", "downloaded_at": "2019-10-28 13:23:33.554091+00:00", "title": "Bolsonaro says he's fighting corruption. So why is he surrounded by scandal? | David Miranda", "language": "en", "text": "There is a towering paradox at the heart of Brazilian politics: the country’s far-right president, Jair Bolsonaro, was elected on an anti-corruption platform – music to the ears of a population that has been victimised for decades by systemic corruption.\n\nWho ordered Marielle Franco's murder? | David Miranda Read more\n\nBut the “anti-corruption” president and his family are now subsumed by multiple corruption scandals suggesting serious criminality.\n\nAll three of Bolsonaro’s politically active sons, along with his wife Michelle, have been implicated in corruption scandals. But the most serious and menacing scandal features Bolsonaro’s eldest son, Flávio, who is a federal senator.\n\nAt the end of 2018, the media reported that one of Flávio’s aides, the former military police officer Fabrício Queiroz, had for years been depositing sums of money into Flávio’s personal bank account. The Intercept (co-founded by my husband Glenn Greenwald) subsequently published secret chats showing that Brazilian prosecutors agreed that there was “no doubt” that the deposits were part of a common racket in which lawmakers employ “ghost” employees who do no work and kick back part of their salaries.\n\nBut this scandal transformed into something far darker and more grave: Queiroz, investigators have said, has ties to the violent and dangerous paramilitary gangs which now rule much of Rio de Janeiro.\n\nThat Bolsonaro's eldest son allegedly has such close ties to this paramilitary gang was terrifying but not surprising\n\nWorse, for more than a decade, Flávio employed both the wife and the mother of Adriano Magalhães da Nóbrega, the alleged leader of Rio’s most powerful and violent paramilitary gang – the same gang investigators have concluded carried out the brutal assassination in 2018 of Rio de Janeiro’s black, LGBT, favela-raised city councilwoman Marielle Franco. (Franco, a close friend of my family, served alongside me in the city council as a member of my party, the leftwing socialist PSOL, until she was murdered.) Flávio defended himself by claiming that the hiring had been “at the indication of former aide Fabricio Queiroz”.\n\nThat the president’s eldest son allegedly has such close ties to this paramilitary gang was terrifying but not entirely surprising. These “militias”, as they are known in Brazil, are largely composed of former and current members of the military police and military.\n\nBolsonaro, a former army officer, has a history of praising these militias as well-intentioned vigilante groups dedicated to fighting crime. All three of his politician-sons – including his youngest political son, Eduardo, a former member of the federal police – have also praised these militias. Along with an anti-corruption persona and a demonisation campaign against LGBT people, Bolsonaro has made pledges to unleash the police and military to kill more suspected criminals central to his political platform.\n\nStill, the fact that Bolsonaro’s son – a member of the most powerful political dynasty in Brazil – would be employing family members of this particular Rio militia shocked the nation. And those ties were even more disturbing when it became clear that Queiroz, the aide that Flávio claimed was responsible for hiring the family members of that militia, is linked to Bolsonaro and his wife, too.\n\nOne of the unexplained deposits made by Queiroz includes one made to the personal bank account of Bolsonaro’s wife, Michelle. And photos revealed that Queiroz, aside from being Flávio’s close aide for a full decade, seemed to enjoy a close friendship with Bolsonaro himself.\n\nWorse still, a photo surfaced in March showing Bolsonaro grinning and draping his arm around one of the former police officers who is suspected of murdering Marielle Franco. That same week, Brazil learned that Bolsonaro’s youngest son, Renan, had dated the daughter of the other police officer arrested for Marielle’s murder.\n\nAs the investigation into Flávio unfolded, the police attempted to interrogate Queiroz about how he could have come into possession of sums of money far in excess of his income as a political aide and former police officer. But after a bizarre television interview in which he vaguely claimed that he had become rich by virtue of his love for “buying and selling” used cars, Queiroz disappeared completely: hidden in a neighborhood controlled by the same militia that murdered Marielle.\n\nBolsonaro has repeatedly used – or abused – his powers as president to block the investigation\n\nThe phrase “Where is Queiroz?” has become a taunting internet meme used to symbolise the criminality at the heart of the Bolsonaro family as well as a protest against the stalled, and perhaps deliberately impeded, police investigation, which to date has arrested no one. Brazil’s largest news magazine, Veja, recently published a cover story announcing that, unlike the Rio police, it had succeeded in “finding Queiroz”: living in a wealthy neighborhood near Brazil’s most expensive private hospital, where he regularly goes for treatment.\n\nBolsonaro has repeatedly used – or abused – his powers as president to block the investigation into the still-mysterious deposits made into the bank account of his eldest son and his wife. The president has all but relinquished his reputation as an anti-corruption crusader with his now-obvious fixation on ensuring that no investigation is permitted to proceed.\n\nBolsonaro has removed officials from the branch of the federal police investigating Flávio and Queiroz. He is threatening to change the leadership of the Rio branch of the federal police and replace them with loyalists to his family. He has stripped the agency that discovered Flávio’s suspicious financial movements of virtually all of its authorities. He appointed as chief prosecutor a man who is openly critical of the anti-corruption investigation that Sérgio Moro led. And just last month it was reported that Bolsonaro had a meeting in the presidential palace with the lawyer representing Flávio in the corruption investigation.\n\nMeanwhile, Bolsonaro’s other son, the city councilman Carlos Bolsonaro, is under investigation for the same kickback scheme of which his older brother is suspected. And Bolsonaro’s attempt to appoint his son Eduardo as Brazil’s ambassador to the US has been widely viewed as corrupt if not an illegal act of nepotism.\n\nBolsonaro’s carefully cultivated image as a political outsider vehemently opposed to corruption was always an obvious myth. He is the opposite of an outsider: before his election as president, he had been a congressman for almost 30 years, closely connected to the Rio de Janeiro political machine.\n\nBrazilians rally to clean beaches amid outrage at Bolsonaro's oil spill inaction Read more\n\nBut Bolsonaro’s extremist ideology and his propensity for garnering attention through outlandish statements (such as proclaiming that he would rather learn his son was dead than gay, and explicitly praising the torturers of Brazil’s military dictatorship) did relegate him to the fringes of political power in Brasília. That is what allowed him to claim the mantle of outsider and frame himself as an adversary of systemic corruption rather than what he seems to be: a direct beneficiary.\n\nAny lingering doubts about the legitimacy of this anti-corruption image are being quickly dispelled by his personal involvement in these corruption scandals and his devoted obstruction of all investigations involving himself and his key family members. Just nine months after being inaugurated, polls now show that he is plagued by historic levels of unpopularity for a first-year president.\n\nAs has happened in so many other countries in the democratic world, including in the US, an “outsider” president elected on promises to “clean up” rampant political corruption has proven even more corrupt than those he denounced.\n\nBrazilians have always known that Bolsonaro is a demagogue and extremist. But these scandals and his attempts to keep them concealed are now making it clear to all but his most devoted followers that he is at least as corrupt and friendly to criminal elements, if not himself a criminal, as the scoundrels who have dominated the country’s politics for decades.", "description": "Brazil’s president and his family are subsumed by multiple corruption scandals suggesting serious criminality", "authors": ["David Miranda"], "top_image": "https://i.guim.co.uk/img/media/a3572c605085030aa4c9a578cd94963f6ce836fe/0_118_3500_2101/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=ae09bf1d8b987db437bf29e2f76f011b", "published_at": "2019-10-28"}