{"pub": "atlantic", "url": "https://theatlantic.com/ideas/archive/2019/09/government-accountability-needs-come-courts/598477", "downloaded_at": "2019-09-25 23:26:34.549354+00:00", "title": "Federal Officials Should Be Accountable for Their Wrongdoing", "language": "en", "text": "Harlan understood that the Constitution’s system of separated powers gave the federal courts an important role to play in righting government wrongs, including relative to other branches of the federal government. The Constitution sought to restrain the impulses of the majority—impulses that are often reflected in the branches that are most subject to majority will, and particularly the presidency. The Constitution therefore gave to the federal courts, the branch of government that is less subject to majority will, the power to restrain the excesses of the majority when those excesses hurt people.\n\nBut in the past few decades, the Court’s understanding of the judicial power has changed. Instead of recognizing that federal courts have the power to remedy constitutional wrongs committed by rogue executive officers, the Court has come to believe that it is up to Congress or the executive branch to decide whether rogue executive officers will ever be accountable to people they harm. The Court has reasoned that in the absence of a statute authorizing victims to sue the officers who wronged them, the courts lack the power to afford the victims any relief.\n\nThese more recent decisions fail to appreciate the special role of the courts within the system of separated powers that Harlan, Marshall, and Story recognized are part of the Constitution. The Constitution is an instrument that restrains the popular will and majoritarian impulses. But as an institution, Congress is supposed to represent the popular will, at least relative to the federal courts. It is not up to Congress, and it should not be up to Congress, whether constitutional guarantees are enforceable. That falls to the federal courts.\n\nRead: A major victory for the right to record police\n\nThe expansion of officials’ immunity is significant not just because of what it says about America’s constitutional structure, but because of its effect on underlying constitutional rights such as the Fourth and Fifth Amendments, and, consequently, the people whose lives are shaped by these rights. The Fourth Amendment prevents unreasonable searches and seizures, and the Fifth Amendment prevents government officials from depriving persons of life or liberty without due process of law—or, at least, they are supposed to prevent those things. But if there are no remedies for violations of constitutional rights, then it’s not clear that there are constitutional rights either.\n\nThis term, the Supreme Court is set to decide another case about federal courts’ authority to right government wrongs. Hernandez v. Mesa involves a Customs and Border Patrol officer who shot and killed a 15-year old Mexican national, Sergio Hernandez. (I am one of the lawyers representing the Hernandez family.) At the time of the shooting, the officer was policing the border at the culvert that separates El Paso, Texas, from Juarez, Mexico, while the 15-year-old boy and his friends were playing a game in which one of them would run up to and touch the United States side of the border fence. After the officer grabbed one of the boys, Hernandez fled and tried to hide under the bridge that spans the border. The CBP officer pointed his weapon, fired, and killed Hernandez.", "description": "And judges need to be the ones to make them pay.", "authors": ["Leah Litman", "Assistant Professor Of Law At The University Of Michigan"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/GettyImages_515204440/facebook.jpg?1569341402", "published_at": "2019-09-25"}