{"pub": "nytimes", "url": "https://nytimes.com/interactive/2019/09/20/science/chandrayaan-2-moon-india.html", "downloaded_at": "2019-09-20 22:43:55.574701+00:00", "title": "India’s Chandrayaan-2 Marks 60 Years of Moon Crashes and Hard Landings", "language": "en", "text": "India’s Chandrayaan-2 moon lander made a hard landing on Sept. 7, less than five months after Israel’s Beresheet lander crashed into the moon.\n\nA composite image of the Beresheet crash site, highlighting recent surface changes. NASA; Goddard Space Flight Center; Arizona State Univ.\n\nThe two impacts were the latest in a 60-year series of crashes, belly flops and hard landings — some intentional, others unplanned — since a Soviet probe first hit the moon on Sept. 13, 1959.\n\nFinding Vikram\n\nIndia lost communication with Chandrayaan-2’s lander, named Vikram, as it descended toward a planned landing site near the moon’s south pole.\n\nNASA’s Lunar Reconnaissance Orbiter flew over the area this week, but the sun was low in the sky and long shadows might have hidden Vikram from view. NASA is still working to process the images, which could be released next week.\n\nLocation of NASA images taken earlier this week 5 MILES Location of NASA images taken earlier this week 5 MILES Location of NASA images taken earlier this week 5 MILES Location of NASA images taken earlier this week 5 MILES NASA; Goddard Space Flight Center; Arizona State Univ.\n\nVikram was designed to operate for 14 Earth days, until the sun set and lunar night froze its instruments. That deadline has now arrived, and attempts to contact Vikram have been unsuccessful.\n\nCurtius Manzinus Moretus Vikram lander Boguslawsky South Pole Path of the Lunar Reconnaissance Orbiter on Tuesday Curtius Manzinus Moretus Vikram lander Boguslawsky South Pole Path of the Lunar Reconnaissance Orbiter on Tuesday Curtius Manzinus Moretus Vikram lander Boguslawsky South Pole Path of the Lunar Reconnaissance Orbiter on Tuesday Curtius Manzinus Moretus Vikram lander Path of the Lunar Reconnaissance Orbiter on Tuesday South Pole A composite map of the moon’s south polar region, showing terrain and elevation (in color). NASA; Goddard Space Flight Center; Arizona State Univ.\n\nThe First Moon Crash\n\nThe first spacecraft designed to hit the moon was the Soviet Union’s Lunik, or Luna 1. It launched in early 1959 and missed the moon, but was still a propaganda victory for Moscow. It’s still out there somewhere, orbiting the sun between the Earth and Mars.\n\nEight months later — and 60 years ago last week — Luna 2 smashed into the moon and became “the first object sent by man from one cosmic body to another,” as described in the Times.\n\nLunar Hard Landings\n\nSeven countries or organizations have made hard landings on the moon: the ◼ Soviet Union, ◼ United States, ◼ Japan, ◼ European Space Agency, ◼ India, ◼ China and ◼ Israel.\n\nSome crashes were setbacks and others were intentional, or made at the end of a successful mission. But whatever the cause, space agencies have learned a great deal from each collision.\n\nSome types of crashes (rocket engines, Apollo lunar modules) are not shown on the map, and some crash locations are unknown.\n\nApollo Impacts\n\nMonths before Neil Armstrong and Buzz Aldrin first set foot on the moon, the Apollo 10 dress rehearsal dropped half of the lunar module “Snoopy” to crash into the moon.\n\nThe Apollo 10 lunar module “Snoopy” returns to orbit after discarding its descent stage. NASA; Project Apollo Archive\n\nThe famous “Eagle” lunar module from Apollo 11 fell back to the moon a few months after the astronauts returned to Earth. Later Apollo missions used the impacts from spent rockets and abandoned lunar modules to test seismic experiments placed on the moon.\n\nThe crash of Apollo 13’s third-stage rocket, as measured by Apollo 12’s seismometer. Arizona State Univ.; Highlights of Astronomy, I.A.U.\n\nCrashing Into Mars\n\nThe moon is not the only world littered with the remains of crushed spacecraft. Landing on Mars is one of the most challenging tasks faced by spacecraft designers.\n\nThe first spacecraft to touch the red planet was the Soviet Union’s Mars 2, which crashed during a landing attempt in 1971.\n\nA low-resolution image of Mars by the doomed Mars Climate Orbiter. NASA\n\nIn 1999, NASA’s Mars Climate Orbiter was lost and may have burned up in the Martian atmosphere after an embarrassing mixup between English and metric units of thrust. Later that year, the Mars Polar Lander smashed into Mars after its engine cut off early.\n\nOne intentional crash was the sky crane that successfully lowered the Curiosity rover to the Martian surface in 2012. Its impact left a dark patch that was visible from orbit.\n\nNASA\n\nMore recently, the European-Russian Schiaparelli lander crashed during descent in 2016, leaving a dark splotch on a smooth Martian plain.\n\nThe Schiaparelli crash site. NASA; Jet Propulsion Laboratory; Univ. of Arizona\n\nInto the Clouds of Venus\n\nThree space agencies have made hard landings on Venus.\n\nThe Soviet Union sent many missions to Venus in the 1960s, 70s and 80s, and its Venera 3 spacecraft made the first crash landing on another planet in 1966.\n\nA composite image of Venus using data from Magellan and other spacecraft. NASA; Jet Propulsion Laboratory\n\nThe United States sent four probes to crash onto the planet’s surface in 1978, and NASA’s Magellan spacecraft burned into the thick Venusian atmosphere in 1994.\n\nTwenty years later, the European Space Agency sent their Venus Express spacecraft into the planet’s atmosphere at the end of a successful mission.\n\nAn artist’s concept of Venus Express skimming the Venusian atmosphere. ESA; C. Carreau\n\nHitting Mercury\n\nElsewhere in the solar system, NASA’s Messenger spacecraft ran out of fuel and crashed into Mercury in 2015.\n\nNorth Pole Messenger’s first orbit in 2011 Final orbit April 2015 2013 2012 North Pole Messenger’s first orbit in 2011 Final orbit April 2015 2013 2012 Messenger’s first orbit in 2011 North Pole Final orbit April 2015 2013 2012\n\nMessenger’s last image before impact showed a patch of the surface near Mercury’s north pole.\n\nNASA; Johns Hopkins Univ. Applied Physics Laboratory\n\nTouching an Asteroid\n\nNASA’s NEAR Shoemaker spacecraft became the first craft to land on an asteroid when it survived an improvised landing on asteroid 433 Eros in 2001.\n\nThe spacecraft touched down near the middle of asteroid Eros, which is about 21 miles long. NASA; Jet Propulsion Laboratory; Johns Hopkins Univ. Applied Physics Laboratory\n\nIts final image of Eros was interrupted when the spacecraft made contact with the surface.\n\nA final, incomplete image by NEAR Shoemaker. NASA; Jet Propulsion Laboratory; Johns Hopkins Univ. Applied Physics Laboratory\n\nTwo Comets\n\nIn 2005, NASA’s Deep Impact spacecraft made a more dramatic crash when it intentionally slammed into a comet.\n\nA bright flash from the impact on Comet 9P/Tempel 1. NASA; Jet Propulsion Laboratory; University of Maryland\n\nA camera on the impactor captured the final moments before impact.\n\nNASA; Jet Propulsion Laboratory; University of Maryland\n\nMore recently, the European Space Agency’s Rosetta spacecraft released its Philae lander to touch down on comet 67P in 2014.\n\nArea of detail below Area of detail below Area of detail below Area of detail below An image of Comet 67P/Churyumov–Gerasimenko by the Rosetta spacecraft. ESA\n\nPhilae bounced across the surface and was lost for two years before it was finally found wedged in a dark crevice.\n\nAn orange box shows the location of the lost Philae lander. ESA\n\nSeveral weeks after Philae was found, Rosetta ended its mission and slowly belly-flopped onto the comet. Its final image before impact showed a fuzzy patch of the surface about 3 feet wide.\n\nESA\n\nThe Outer Solar System\n\nAt least three spacecraft have burned up in the planets of the outer solar system.\n\nNASA’s Galileo spacecraft released a probe to burn into Jupiter’s atmosphere in 1995, and Galileo later disintegrated itself in 2003.\n\nThe Cassini spacecraft flew into Saturn in 2017 after returning more than a decade of images from the ringed planet.\n\n\n\n\n\n\n\nSubscribe to the Science Times newsletter and sync your calendar with the solar system.\n\nMap data from NASA and the U.S. Geological Survey's Astrogeology Science Center.", "description": "The solar system is littered with the remains of crushed spacecraft.", "authors": ["Jonathan Corum"], "top_image": "https://static01.nyt.com/images/2019/09/21/science/21moon/21moon-facebookJumbo.png", "published_at": "2019-09-20"}