{"pub": "wsj", "url": "https://barrons.com/articles/chipotle-doubles-down-on-steak-as-it-takes-a-new-dish-national-51568721602?mod=rsswn", "downloaded_at": "2019-09-17 13:10:25.696625+00:00", "title": "Chipotle Stock Has Nearly Doubled This Year. Now Its Doubling Down on Steak", "language": "en", "text": "Text size\n\nChipotle Mexican Grill stock rocketed this year as the restaurant chain has revived its brand without remaking the menu. The burrito maker will change that Tuesday, launching its first major national menu addition under its current management team.\n\nChipotle stock (ticker: CMG) has risen 86% this year through Monday’s close at $799.87. The company is adding carne asada, a sliced steak flavored with squeezes of lime and chopped cilantro, to its menu—though it will be available only to loyalty program members ordering online until Thursday. The Dow Jones Industrial Average has risen 16%, while the S&P 500 has gained 20%.\n\nThat makes the new steak, an alternative to its traditional chopped steak (which remains on the menu), Chipotle’s first significant new menu addition under CEO Brian Niccol, who started in early 2018 after joining from Yum Brands ’ (YUM) Taco Bell. (Chorizo, which was served up last year, was a callback to a previous offer from 2016.)\n\nEditor's Choice\n\nRather than shake up the menu, Chipotle has focused on strengthening the brand, boosting digital effectiveness, and store-level operations. That has helped boost same-store sales substantially in recent quarters: They rose 10% in the second quarter, ahead of the Street’s consensus expectation.\n\nIt’s also helped Chipotle stock recover, in dramatic fashion, from the depths to which they sunk after food safety concerns made diners loathe to line up for tacos or burrito bowls. (Barron’s took a long look at the company’s comeback in July.)\n\n\n\nMeanwhile, most of the new food options the company has considered—including nachos and quesadillas—have yet to emerge from testing, with the company stressing that any national launch needs to appeal to diners, make financial sense, and not cause fumbles on the assembly line. (A white version of Chipotle’s queso dip is also in tests.)\n\nThe carne asada is considered a limited-time offer, though executives at a media event Monday afternoon didn’t specify a set end time. Instead, they said, the company will determine the length of the offer based on demand—and its supply of the beef it uses in the recipe.\n\n“We’re just not able to secure the quantity of the raw material” needed to run the offer indefinitely, Nevielle Panthaky, Chipotle’s vice president of culinary and menu development, told Barron’s at the Monday event.\n\nCarne asada could give the stock another lift, some analysts believe, since steak costs more than chicken, potentially boosting check sizes. Currently, steak represents about a fifth of the protein the chain sells.\n\nThe new dish “performed incredibly well” in the company's Cincinnati and Fresno test markets, said Chris Brandt, Chipotle’s chief marketing officer, in a statement.\n\nEmail David Marino-Nachison at david.marino-nachison@barrons.com. Follow him at @marinonachison and follow Barron’s Next at @barronsnext.", "description": "Chipotle Mexican Grill stock rocketed this year as the restaurant chain has revived its brand without remaking the menu. The burrito maker will change that Tuesday, launching its first major national menu addition under its current management team.", "authors": ["David Marino-Nachison"], "top_image": "https://images.barrons.com/im-107400/social", "published_at": "2019-09-17"}