{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/09/the-right-way-to-respond-when-kids-talk-back", "downloaded_at": "2019-09-19 06:04:48.819511+00:00", "title": "The Right Way To Respond When Kids Talk Back", "language": "en", "text": "Photo: Getty Images\n\nA friend of mine once went on a tirade about how she would not raise a disrespectful kid. “That’s just not happening,” she said. “He will not talk back. Respect is way too important to me, and I won’t put up with him being rude.” Her son was about a year old at the time. Mine was a few years older. So, I laughed.\n\n“Yeah, sounds great,” I told her. “If you figure out the secret, pass it along to me, ok?”\n\nWhat she hadn’t experienced yet was the very real dilemma between 1) wanting to lay down the law because I will NOT raise a kid who speaks to me that way and 2) wanting to model a better way to communicate because they’re more likely to do as we do, not do as we say.\n\nKids, they talk back. And developmentally, they should. Parent Coach Meghan Leahy writes for the Washington Post that when the back-talk ramps up, it may actually mean the child is ready for more independence and control.\n\nSeemingly overnight, your child is ready to walk alone to a friend’s house, organise their own homework, choose all of their own clothing and have opinions about their meals. Though this can feel challenging, it is best to see your child’s opinions and pushback as an invitation to change, rather than just straight-up misbehavior. It is useful to see back talk as a form of communication that needs to be better understood.\n\nStill, it’s annoying at best and infuriating at worst. Luckily, there are some things we can do to minimise the back-talk and de-escalate the situation.\n\nLoosen the reins\n\nAll day long, kids are bossed around. From their morning routine, to their class schedule at school, to putting their shoes away and doing their homework and feeding the dog, they are constantly directed. So when we tell them it’s time to go upstairs and take a shower and they let out a big harumph! and go stomping up the stairs, yelling, “I. Hate. Taking. SHOWERS! Showers. Are. So. STUPID!” we shouldn’t be totally surprised.\n\nThe same way we try to give our toddlers choices to avoid tantrums (do you want to wear the orange shirt or the purple shirt today, honey?), we can find ways for our older kids to make decisions and take over some of the control of their daily lives. Do you want to take a shower tonight or tomorrow morning? Do you want a snack before or after homework? The less we smother and dictate, the more they might relax.\n\nPick your battles\n\nNot all back-talk is created equal, so draw your lines in the sand. What can you live with, and what really is unacceptable? Rachel Simmons, author of “The Curse of the Good Girl: Raising Authentic Girls With Courage and Confidence,” gives this advice to the New York Times:\n\nDecide when to let something slide — a throwaway remark, shrug or eye-roll — and when to push back, Ms. Simmons said. Push back should happen when something goes against the moral values of the home, such as insulting a parent’s appearance or refusing to do chores.\n\nI was the Queen of the Eye Roll in my day, but my parents didn’t seem to care much. In fact, they found it mildly amusing, and nothing kills a good eye roll like your parents enjoying it. Shrug off the little stuff, but be ready to (calmly) stand your ground on the bigger stuff.\n\nRemain unimpressed\n\nThis is my favourite advice, from Amy McCready, founder of Positive Parenting Solutions: “While your children are putting on a drama performance worthy of a Tony award, your job is to be an unimpressed attendee.”\n\nMcCready is speaking my language here. This is where we can really model for them how to react to conflict: By being calm, firm and kind.\n\nSimply say, “I feel hurt by the way you’re talking to me. When I hear that tone of voice, I’m going to walk away. We can talk again when you can speak respectfully to me.” Then walk away. Next time it happens, there’s no need for even a warning — simply leave the room. You’re sending the message that you refuse to participate in a power struggle. And when there’s no one to fight with, there’s no fight!\n\nIf you struggle with that in the moment, try to channel your inner Michelle Obama. When they go low, we go high. When they talk back, we stay calm.", "description": "A friend of mine once went on a tirade about how she would not raise a disrespectful kid. “That’s just not happening,” she said. “He will not talk back. Respect is way too important to me, and I won’t put up with him being rude.” Her son was about a year old at the time. Mine was a few years older. So, I...", "authors": ["Tooran Alizadeh", "Edward Helderop", "Tony Grubesic", "David Murphy"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/wadcsoctqhjgdczvjoxy.jpg", "published_at": "2019-09-19"}