{"pub": "cbc", "url": "https://cbc.ca/news/canada/ottawa/apple-cinnamon-cupcakes-the-great-canadian-baking-show-1.5314811", "downloaded_at": "2019-10-13 08:44:05.812841+00:00", "title": "Make your own Thanksgiving 'showstopper' dessert | CBC News", "language": "en", "text": "If you're a fan of CBC TV's The Great Canadian Baking Show, you're sure to know Jay Smidt.\n\nBut did you know the second season contestant — who was recently eliminated from the show — is a public servant with Global Affairs Canada and lives in Cantley, Que.?\n\nBefore his elimination, he and his fellow bakers faced the pressure of pulling off dishes in three different categories: the signature, the technical, and finally the showstopper.\n\nLast week on CBC Radio's All In A Day, host Alan Neal challenged Smidt to come up with a simple showstopper for Thanksgiving.\n\nHe shared a recipe for apple cinnamon cupcakes with maple butter cream icing that you can make with your kids.\n\nJay Smidt's 'simple' showstoppers, just in time for Thanksgiving. (Submitted/Jay Smidt)\n\nApple Cinnamon Cupcakes with Maple Butter Cream Icing\n\nMakes 12-15 cupcakes\n\nIngredients (cupcakes)\n\n½ cup unsalted butter, melted and slightly cooled\n\n⅔ cup packed light or dark brown sugar\n\n⅓ cup granulated sugar\n\n2 large eggs, at room temperature\n\n½ cup buttermilk\n\n2 tsp. pure vanilla extract\n\n1½ cups all-purpose flour\n\n½ cup quick oats\n\n¼ tsp. baking soda\n\n1 tsp. baking powder\n\n½ tsp. salt\n\n1 tsp. ground cinnamon (can substitute cardamom)\n\n¼ tsp. ground nutmeg\n\n2 cups of peeled, finely chopped baking apples like Granny Smith (roughly two apples)\n\nIngredients (buttercream):\n\n1 cup unsalted butter at room temperature\n\n4 cups powdered (icing) sugar\n\n½ tsp. salt\n\n4 tbsp. maple syrup\n\n1 tsp. vanilla extract\n\n12-15 maple leaf cookies (you can buy these at most grocery stores)\n\nStill trying to figure out what to serve for dessert at this weekend's Thanksgiving Dinner? We've got a showstopper made especially for you, courtesy of a local contestant on CBC's Great Canadian Baking Show. 11:29\n\nDirections:\n\nPreheat the oven to 350 F. Line one 12-cup muffin pan with cupcake liners and a second pan with three more. Whisk the melted butter, brown sugar, and granulated sugar together in a medium-sized bowl until combined. Whisk in the eggs, one at a time, until the mixture is smooth. Whisk in the vanilla extract and milk. Set aside. In a large bowl, whisk together the flour, baking soda, baking powder, salt, cinnamon, and nutmeg. Slowly add the wet ingredients to the dry ingredients and stir gently until combined. The batter will have a few lumps and seem thin but will thicken. Fold in the apples. Fill the cupcake liners three-quarters of the way with batter. Bake for 21–23 minutes, rotating the pan halfway through. Remove from the oven when done; a toothpick inserted in the centre will come out clean when they're ready. Allow the cupcakes to cool in the pan for about 10 minutes, then remove to a rack to cool completely before frosting. While the cupcakes are cooling, place the butter in a large bowl and using an electric hand mixer (a wooden spoon will work too) whip the butter until it is light and airy. Add in the powdered sugar one cup at a time, mixing in each cup until it is incorporated before adding the next one. Once all the sugar is added, add the salt, vanilla and maple syrup and continue to beat or stir until it is really light and fluffy. Spoon all of the frosting in to a pastry bag or large zipper storage bag and cut the tip or corner off so you'll have an opening about the size of a quarter. Squeeze a large dollop of icing onto each cupcake, so that it almost comes to the edge of the cupcake wrapper. Using one of the cookies, push down on the dollop so that the cookie rests flat as a topper.\n\nThe Great Canadian Baking Show airs Wednesdays at 8 p.m. on CBC and the free CBC Gem streaming service. Previously aired episodes can also be watched online at CBC Gem.", "description": "Jay Smidt, a local contestant on the second season of CBC's The Great Canadian Baking Show, has an apple cinnamon cupcake recipe you can make for Thanksgiving.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5315093.1570809550!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_620/apple-cinnamon-cupcakes.jpeg", "published_at": "2019-10-13"}