{"pub": "telegraph", "url": "https://telegraph.co.uk/football/2019/10/07/ryan-christies-form-not-question-celtic-midfielder-closes-twitter", "downloaded_at": "2019-10-07 23:33:00.742253+00:00", "title": "Ryan Christie's form not in question as Celtic midfielder closes Twitter account due to abuse after red card at Livingston", "language": "en", "text": "Ryan Christie’s contribution to the Scotland squad for the Euro 2020 qualifying double-header away to Russia and at home to San Marino will not be affected by the deluge of vile abuse which forced the Celtic midfielder to close his Twitter account having been sent off during Sunday’s 2-0 defeat at Livingston, according to Steven Reid, the Scots’ assistant coach.\n\nSocial media threats and diatribes – usually delivered under cover of anonymity – are tediously predictable hazards for anyone in public life and Reid revealed that he, too, had reduced his online presence while playing for West Bromwich Albion in 2014, when he became a target.\n\n“I was in a relegation dogfight with West Brom at the time,” said the former full-back, who made 23 appearances for the Republic of Ireland. “I came off it because of the abuse, the negative messages you get at times.\n\n“I use it sparingly. I try to stay off it as much as I can, although it is useful for news. It is one of those debates at the minute with the amount of abuse directed at players, whether it is really worth being on it, especially when you are in a hard-fought season. It is tough going.”", "description": "Ryan Christie’s contribution to the Scotland squad for the Euro 2020 qualifying double-header away to Russia and at home to San Marino will not be affected by the deluge of vile abuse which forced the Celtic midfielder to close his Twitter account having been sent off during Sunday’s 2-0 defeat at Livingston, according to Steven Reid, the Scots’ assistant coach.", "authors": ["Roddy Forsyth", "Scottish Football Correspondent", "Jim White", "Alan Tyers"], "top_image": "https://www.telegraph.co.uk/content/dam/football/2019/10/07/TELEMMGLPICT000212194311-xlarge_trans_NvBQzQNjv4BqM37qcIWR9CtrqmiMdQVx7KFawDiuoYxzdPhccsI57PY.jpeg?imwidth=1200", "published_at": "2019-10-07"}