{"pub": "guardian", "title": "Terry Gilliam says he disagrees with John Cleese's worldview", "url": "https://theguardian.com/film/2019/sep/03/terry-gilliam-disagrees-john-cleese-worldview-monty-python-brexit", "language": "en", "published_at": "2019-09-03", "downloaded_at": "2019-09-03 00:55:57.889226+00:00", "text": "Terry Gilliam has said he disagrees with the way his friend and fellow Monty Python member John Cleese sees the world, following comments from the latter endorsing Brexit and criticising the makeup of London.\n\nThe Python animator and Hollywood director despairs of Donald Trump and Brexit, both of which make him “terminally depressed”. Cleese has previously faced a backlash for voicing support for the UK leaving the EU, and for saying London was no longer an English city.\n\nGilliam told Radio Times that the only public figure he could trust in the current political climate was Sir David Attenborough. He also criticised the political correctness of contemporary comedy, but stopped short of supporting his friend’s view of the world.\n\nHe said: “I’m the instinctive, monosyllabic American and he’s the tall, very suave one. I love John enormously but I just disagree with the way he perceives the world.”\n\nFacebook Twitter Pinterest John Cleese has previously faced a backlash for expressing support for Brexit. Photograph: Public Address/action press/REX/Shutterstock\n\nGilliam said his friend, no matter his views, had always been funny. “John has never changed, he’s just got fat, that’s all.”\n\nThe director, who achieved critical recognition for his work on Brazil, Time Bandits and 12 Monkeys, does not approve of controls on comedy and has criticised attempts to diversify writing rooms and to police material.\n\n“It doesn’t have anything to do with gender, sex or anything. Good writing is what it’s about, and that’s why you hire people, not because they’re this colour or that gender,” he said. “‘Is it funny?’ is the only thing that should be asked. Comedians are treading carefully and this is terrible. I really want some comedians to really go for it again, but people are frightened of saying the wrong thing, of causing offence.”\n\nTerry Jones: ‘I’ve got dementia. My frontal lobe has absconded’ Read more\n\nGilliam, who renounced his US citizenship, said that although talents in Monty Python had an Oxbridge background, their material pushed diversity, and attacked the established order.\n\nRadio Times also interviewed Sir Michael Palin, another member of the comedy troupe, who said there was still a “sparkle” left in his friend and fellow Python Terry Jones despite his diagnosis in 2015 with a form of dementia that affected his ability to communicate.\n\nThe pair met at Oxford before collaborating together in Monty Python, said there are still traces of Jones left despite the effects of his illness.\n\nPalin said: “He’s still around, he’s not disappeared, quite apart from the wonderful work that he left behind, the work he’s done. There’s still a bit of Terry there, the sparkle in the eye. He can’t communicate, that’s the problem, which is so ironic for someone who loved words and debate and jokes and opinions and ideas.\n\n“There’s enough of Terry there to make me feel grateful that I can still go and see him.”", "description": "Director says Brexit makes him ‘terminally depressed’ while fellow Python Cleese backs it", "authors": ["Pa Media"], "top_image": "https://i.guim.co.uk/img/media/bbd709cbf3c3a534aca2c34a318c16eb6f39f823/0_69_2408_1445/master/2408.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a709e7bae7fd3f14c06338ef29e9159b"}