{"pub": "zdnet", "url": "https://www.zdnet.com/article/microsoft-launches-911-on-demand-service-for-emergency-security-threats", "downloaded_at": "2019-10-29 00:18:15.539006+00:00", "title": "Microsoft launches ‘911’ on-demand service for emergency security threats", "language": "en", "text": "Microsoft and NIST are working on an industry-wide standard for security patches A NIST guide was needed as the patch testing process for some companies involved asking questions on internet forums.\n\nMicrosoft has introduced a new service offering enterprise customers a direct line to the company's top security experts when a threat is so bad it can't be solved alone.\n\nThe managed threat hunting service called Threat Experts on Demand has now reached 'general availability' and is part of the Microsoft Defender Advanced Threat Protection (ATP) service for customers with subscriptions such as Windows 10 Enterprise E5 and the Microsoft 365 bundle.\n\nIt's specifically targeted at large organizations that do have advanced security capabilities but may be in a sticky situation, such as handling the next NotPetya outbreak, responding to a barrage of Emotet spam, insider threats and cyber-espionage threats from state-sponsored hackers.\n\nSEE: 10 tips for new cybersecurity pros (free PDF)\n\nThe on-demand human service compliments the targeted attack notifications that Microsoft launched in April. The company announced Threat Experts on Demand alongside its Azure Sentinel cloud-SIEM service in February. Sentinel became generally available in September.\n\nThreat Experts on Demand is accessible from the Microsoft Defender Security Center app. If the security operations team receives an alert about a dangerous attack, say, on a device's kernel, they now have an option to \"consult a threat expert\" in the drop down menu on the Actions list.\n\nKremlin-backed hackers Fancy Bear were recently caught exploiting the Windows kernel in novel firmware attacks earlier this year. Attacks like this also prompted Microsoft to launch \"Secured-core\" for high-end PCs from HP, Dell and Microsoft's Surface business.\n\nMicrosoft promises its threat experts will provide technical consultation on relevant detections and adversaries. Once clicking the button, the security team can escalate the issue to Microsoft's incident response services.\n\n\"This is our managed threat hunting capability. It combines expert human hunters with our own artificial intelligence and automation to help our enterprise customers deal with those critical threats,\" Brian Hooper, senior research lead at the Microsoft Defender research group, told ZDNet.\n\n\"We help them become aware of those threats in their environment, reduce dwell time, and give them visibility into those critical threats so they can prioritize and respond with confidence.\"\n\nMicrosoft\n\nThe service is a response to security teams in large enterprises who may be overwhelmed by the volume of security alerts. Microsoft's threat experts can help them cut through the noise and focus on alerts that matter.\n\n\"Customers do what they can to deal with these threats but sometimes they need additional help,\" said Hooper. \"Sometimes they just want a trusted partner. Microsoft has visibility of over a billion machines worldwide and we're able to use that to bring out and deeply understand the threats that enterprises face.\"\n\nSEE: Microsoft and NIST are working on an industry-wide standard for security patches\n\nSo who exactly is available to help when a customer, say in Europe, is experiencing a critical security issue when Microsoft's security experts in its Redmond headquarters are asleep?\n\nMicrosoft isn't disclosing where its experts are located but Hooper said that Threat Hunters on Demand does allow enterprise customers to \"tap into the 3,500-plus security professionals Microsoft has globally\".\n\nAfter receiving a notification about a new threat, customers who think they can't address the threat alone can click a button to contact Threat Experts. Microsoft told ZDNet there will be a full-time Microsoft employee who handles each request for help to address a situation that demands a full incident response.\n\nExperts on Demand human element includes:", "description": "Top cybersecurity experts are now part of Microsoft's Advanced Threat Protection service.", "authors": ["Liam Tung"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2019/10/01/9f8c01e8-635d-403e-8cd3-0c0eb92946cf/thumbnail/770x578/3a05aed7740fb2affaf4c723092af7e2/istock-883160280.jpg", "published_at": "2019-10-28"}