{"pub": "cbc", "url": "https://cbc.ca/arts/inthemaking/in-the-making-launched-a-shadowing-program-for-bipoc-directors-hear-from-one-of-the-participants-1.5324990", "downloaded_at": "2019-10-18 01:10:15.297267+00:00", "title": "CBC Arts", "language": "en", "text": "While prepping the second season of CBC Arts docuseries In the Making, director Amar Wala approached producers Michelle Mama and Sean O'Neill with a proposal: could the show be used as a springboard for BIPOC filmmakers to shadow directors? In short order, with the full support of CBC, DOC (Documentary Organization of Canada) and White Pine Pictures, the BIPOC Director Shadowing Program was born.\n\nAfter a submission and interview process, the jury selected two filmmakers — Isa Benn and Sherien Barsoum — to be the inaugural candidates. The program offers paid experience working in episodic television for 5-7 weeks, shadowing a director from research/writing through shooting and into post-production.\n\nCBC Arts talked to filmmaker Sherien Barsoum about what it was like to shadow Amar Wala for this season's episode on artist Deanna Bowen, streaming now on CBC Gem and airing on CBC TV ths Friday October 18th at 8:30 p.m. (9:30 p.m. NT).\n\nHow did you hear about the BIPOC mentorship program and what made you feel like it was the right opportunity for you?\n\nI saw the opportunity on Facebook and Amar Wala (the director I shadowed) encouraged me to apply. I felt it was the right opportunity for me because although I have been making independent films for the last number of years, it has been difficult to maintain a financially sustainable career. Episodic directing can be a viable path to sustainability, and this was an opportunity that could lead me in that direction.\n\nDid you know Deanna Bowen's work before you were selected to shadow the director, of her episode of In the Making? What is your impression of it/her?\n\nI didn't know about Deanna's work! I can't believe I didn't know! Her voice is prolific and her art challenges us to look squarely at the fact that we need to have many more conversations about identity, belonging, history and racism in Canada.\n\nHow important was it to you to be working with a BIPOC director (Amar Wala) in telling the story of a BIPOC artist?\n\nWorking with Amar, as well as with a crew made up of several BIPOC folks, was incredibly important. There was a baseline of understanding and sensitivity to Deanna's work that was integrated from the start. From research to post-production, it was revealing to see how, as a BIPOC director, Amar's editorial and creative decisions impacted the storytelling.\n\nWas there a highlight of the process for you — one moment that stood out?\n\nWhile Deanna's work speaks to national issues, it is grounded in personal history. The exhibit we were covering was especially meaningful because Deanna's mother was going to have a chance to see and respond to her work — something that hasn't really happened in the past. We filmed a conversation between Deanna and her mother and captured some really beautiful moments. It felt like our team was part of creating those moments, and that was special.\n\nWhat do you see as the most tangible value of an experience like this for a director?\n\nFor me the most valuable part of this experience was being able to witness process from beginning to end. While I have production/storytelling experience, it was insightful to see how a series director serves a wider mandate alongside the producers, host, broadcasters and executive team. Witnessing these conversations and interactions will serve me well as I move into this space.\n\nDeanna Bowen (White Pine Pictures)\n\nDeanna Bowen is an archivist of Black experience and making a documentary is like the process of archiving. Did that make the process of profiling her easier or harder?\n\nDocumenting Deanna's work was challenging because her process often involves the discovery of material (newspapers, archives, music, video) and then the reflection of it in various ways. So in some ways, her process is less visual, making it challenging to document. Amar and the team addressed this creatively, and I think the episode is visually and aurally rich!\n\nWould you recommend this program to others? Any tips for future candidates to get the most out of it?\n\nI was warmly welcomed and my voice was valued. I would certainly recommend this program to anyone interested in factual episodic directing. As with any opportunity, you get out of it what you put into it. I would encourage future candidates to step into the shadowing role as though you're about to direct the next episode. Yes, you're there to learn and grow, but speak up and contribute as well!\n\nAmar Wala is working with the Documentary Organization of Canada to take the experience from Season 2 of In the Making and build it into an ongoing shadowing program.\n\nIn the Making takes you on an immersive journey inside the lives and work of Canada's leading artists. Stream the whole season now on CBC Gem, or watch it on CBC-TV Friday nights at 8:30 p.m. (9 p.m. NT).", "description": "Sherien Barsoum's advice for future candidates of the program? \"Step into the shadowing role as though you're about to direct the next episode.\"", "authors": ["Cbc Arts"], "top_image": "https://i.cbc.ca/1.5325010.1571344683!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/in-the-making-amar-wala-and-sherien-baroum.jpg", "published_at": "2019-10-17"}