{"pub": "washingtonpost", "url": "https://washingtonpost.com/technology/2019/10/11/amazon-policy-manifesto-responds-environmental-workplace-data-privacy-critics", "downloaded_at": "2019-10-11 02:27:22.738365+00:00", "title": "Amazon policy manifesto responds to environmental, workplace and data-privacy critics", "language": "en", "text": "“While our positions are carefully considered and deeply held, there is much room for healthy debate and differing opinions,” the company wrote.\n\nAD\n\nAD\n\n(Amazon founder and CEO Jeff Bezos owns The Washington Post.)\n\nSeveral presidential candidates have regularly criticized the company for not paying taxes, a claim Amazon disputes. In its policy manifesto, Amazon doesn’t address that criticism, but calls on governments to “incentivize investment in the economy and job creation.”\n\nAmazon recently came under fire by its own employees for its climate policies and practices. The group, Amazon Employees for Climate Justice, called on the company to, among other things, end contracts with its cloud-computing business that help energy companies accelerate oil and gas extraction. The new position statement says Amazon won’t do that.\n\nAD\n\n“We will continue to provide cloud services to companies in the energy industry to make their legacy businesses less carbon intensive and help them accelerate development of renewable energy businesses,” Amazon wrote.\n\nAD\n\nThe employee group shot back, citing marketing materials from Amazon Web Services that note its technology is helping fossil fuel companies find new oil reserves much more quickly. Amazon is pushing a false narrative that aiding oil and gas companies means transitioning to clean energy, the group said.\n\n“Amazon’s position is based on false premises and distracts from the fact that Amazon wants to profit in businesses that are directly contributing to climate catastrophe,” the group said in a statement it attributed to Jamie Kowalski, an Amazon software development engineer, and Maren Costa, a principal user-experience designer.\n\nAD\n\nFor years, Amazon has wrestled with stopping the sale of counterfeit goods, even as it generates revenue from customers purchasing fake products from its site. It announced an initiative earlier this year to give brands tools to take down counterfeit listings. The statement suggests stronger U.S. federal penalties for counterfeiters, as well as for law enforcement to prosecute the crimes via appropriate resources.\n\nAD\n\nAnd privacy critics have ripped Amazon for selling its artificial-intelligence tool Rekognition to law-enforcement over concerns that it could lead to the wrongful arrest of innocent people who bear only a resemblance to a video image. Amazon’s policy statement lays out its call for regulating the emerging technology, saying governments “should work quickly to put in place a regulatory framework for facial recognition technology.”\n\nAD", "description": "The e-commerce giant posted a nearly 1,300-word document offering its position on a smorgasbord of issues for which it has come under fire.", "authors": ["Jay Greene", "Reporter Focused On Technology Coverage In The Pacific Northwest"], "top_image": "https://www.washingtonpost.com/resizer/YQuGU6srrvKkQlapw04YaVcE8P8=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VLEWPWG4BMI6TINFCYVYVHE4UI.jpg", "published_at": "2019-10-11"}