{"pub": "abcnews", "url": "https://abcnews.go.com/International/wireStory/ugandan-official-bill-target-homosexuals-66203528", "downloaded_at": "2019-10-11 12:43:10.780328+00:00", "title": "Ugandan official says new bill will target homosexuals", "language": "en", "text": "A bill proposing harsh penalties against gay sex is set to be introduced in Uganda's national assembly, according to a senior official who has expressed regret over the failure of an attempt years ago to punish homosexuals.\n\nInterested in Pride Month? Add Pride Month as an interest to stay up to date on the latest Pride Month news, video, and analysis from ABC News. Add Interest\n\nLawmakers supporting anti-gay legislation have \"remobilized\" so that a draft new bill gets strong support when it is put to a vote, the state minister for ethics, Simon Lokodo, told local broadcaster NTV on Thursday.\n\nWhile Uganda's penal code \"only criminalizes the act,\" the East African country needs legislation against \"recruitment, promotion, exhibition\" activities related to gay rights, he said.\n\n\"With the standard of proof, when do you get people doing it in their houses? You only have to imagine,\" Lokodo said.\n\nGay rights leader Frank Mugisha told The Associated Press that activists will fight any effort to introduce legislation that violates the rights of LGBT people.\n\n\"Once they bring the bill we will fight it the same way we fought the other one,\" he said Friday. \"Ugandans are really tired. This is not an issue for Ugandans now.\"\n\nLokodo, who has been accused of breaking up LGBT events, has long called for the introduction of tough new legislation after a panel of judges nullified an anti-gay law enacted by President Yoweri Museveni in 2014 amid international condemnation.\n\nThat law, invalidated because it had been passed by lawmakers during a session that lacked a quorum, prescribed punishments of up to life in prison for those convicted of engaging in gay sex. It also prescribed lengthy terms for those convicted of \"attempted homosexuality\" and \"promotion of homosexuality.\"\n\nThe original version of that bill, first introduced in 2009, included the death penalty for what it called aggravated acts of homosexuality.\n\nIt is not clear if the new draft bill includes similar penalties.\n\nGays face discrimination in many parts of sub-Saharan Africa, where homosexuality is often seen as imported from the West.\n\nAccording to Human Rights Watch, 32 African nations have varying laws criminalizing homosexuality. In many cases anti-gay laws are left over from the colonial era, one reason gay rights activists have fought vigorously to have the laws jettisoned.\n\n———\n\nFollow Africa news at https://twitter.com/AP—Africa", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "", "published_at": "2019-10-11"}