{"pub": "fox", "url": "https://foxnews.com/world/turkey-syria-kurdish-troops-military-assault", "downloaded_at": "2019-10-09 12:46:05.649075+00:00", "title": "Syrian Kurdish forces call for all hands on deck as Turkish troops reportedly cross border", "language": "en", "text": "Syrian Kurdish forces were calling on their people Wednesday to move toward the border with Turkey and “carry out acts of resistance,” as reports emerged that the first Turkish troops have entered the country as part of a planned military assault.\n\nTurkey has long threatened an attack on the Kurdish fighters in Syria, whom Ankara considers terrorists allied with a Kurdish insurgency within Turkey. A small group of its forces entered Syria Wednesday morning near the towns of Tal Abyad and Ras al-Ayn, a Turkish official told Bloomberg.\n\n\"We call upon our people, of all ethnic groups, to move toward areas close to the border with Turkey to carry out acts of resistance during this sensitive historical time,\" read a statement from the local civilian Kurdish authority known as the Autonomous Administration of North and East Syria.\n\nTURKISH INCURSION INTO SYRIA WOULD FORCE KURDS TO FLEE, FREEING CAPTURED ISIS MEMBERS, GEN. KEANE SAYS\n\nIn its call for “general mobilization,” the Kurds also urged the international community to live up to its responsibilities as \"a humanitarian catastrophe might befall our people\" in the region.\n\nThe stark message was in contrast to what is being said Wednesday from north of the border.\n\nFahrettin Altun, the Turkish presidency's communications director, called on the international community in a Washington Post op-ed \"to rally\" behind Ankara, which he said would also take over the fight against the Islamic State terrorists.\n\nTurkey also is aiming to \"neutralize\" Syrian Kurdish militants in northeast Syria and to \"liberate the local population from the yoke of the armed thugs,\" Altun added.\n\nSEN. MCSALLY SAYS US SHOULD STAND WITH KURDS\n\nA Syrian war monitoring group, the Britain-based Syrian Observatory for Human Rights, reported Wednesday that people were already fleeing Tal Abyad as the Turkish troops are closing in.\n\nTurkish officials who spoke to Bloomberg on condition of anonymity say the offensive will target Syrian border towns first to minimize any chance of a Kurdish state growing near its territory.\n\nExpectations of a Turkish invasion rose after President Trump on Sunday abruptly announced that American troops would step aside ahead of the Turkish push — a shift in U.S. policy that essentially abandoned the Syrian Kurds, longtime U.S. allies in the fight against ISIS in Syria.\n\nBut Trump also threatened to \"totally destroy and obliterate\" Turkey's economy if the Turkish push into Syria went too far, and cast his decision to pull back U.S. troops as fulfilling a campaign promise to withdraw from the \"endless war\" in the Middle East.\n\nFRENCH OFFICIALS CRITICIZE US OVER ANNOUNCED MILITARY PULLBACK\n\nThe moves have been met with criticism from politicians on both sides of the aisle.\n\nRepublican critics included Sen. Martha McSally of Arizona, who said she hopes the president's plan is \"reconsidered.\"\n\n\"I agree with President Trump's objective to not be bogged down in the Middle East, to bring our men and women home, and we really need to be looking at the rising threat of China,\" McSally said on \"The Story with Martha MacCallum\" Tuesday.\n\n\"However, we have a generational struggle and fight against Islamic terrorism,” she added.\n\nMeanwhile, Russian Foreign Minister Sergey Lavrov accused Washington of playing \"very dangerous games\" with the Syrian Kurds saying that the U.S. first propped up the Syrian Kurdish \"quasi-state\" in northeastern Syria and is now withdrawing its support.\n\n\"Such reckless attitude to this highly sensitive subject can set fire to the entire region, and we have to avoid it at any cost,\" he said during a visit to Kazakhstan.\n\nEarlier on Wednesday, ISIS militants targeted a post of the Kurdish-led Syrian Democratic Forces in the northern Syrian city of Raqqa, which was once the de facto ISIS capital at the height of the militants' power in the region.\n\nThe Kurdish-led SDF, which is holding thousands of ISIS fighters in several detention facilities in northeastern Syria, has warned that a Turkish incursion might lead to the resurgence of the extremists. The U.S. allied Kurdish-led force captured the last ISIS area controlled by the militants in eastern Syria in March.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nIn Wednesday's attack, ISIS launched three suicide bombings against Kurdish positions in Raqqa. There was no immediate word on casualties.\n\nAlso Wednesday, Iranian state television reported a surprise military drill with special operations forces near the country's border with Turkey, in Iran's Western Azerbaijan province. The TV didn't mention the expected Turkish offensive into Syria or elaborate on the reasons for the drill.\n\nFox News’ Victor Garcia, Dom Calicchio and the Associated Press contributed to this report.", "description": "Syrian Kurdish forces were calling on their people Wednesday to move toward the border with Turkey and “carry out acts of resistance,” as reports emerged that the first Turkish troops have entered the country as part of a planned military assault.", "authors": ["Greg Norman"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/turkey-tank.jpg", "published_at": "2019-10-09"}