{"pub": "nymag", "url": "https://vulture.com/2019/09/art-shows-fall-2019.html", "downloaded_at": "2019-09-11 13:53:45.519791+00:00", "title": "The Best and Biggest Art Shows to See to This Fall", "language": "en", "text": "Impress Your Feelings With Your Fingerprint, by Sérgio Sister (1970). Photo: Courtesy of the artist and Galeria Nara Roesler\n\nThe once-mighty Drawing Center reawakens this fall under new director Laura Hoptman, who has mounted a virtuoso exhibition of over 140 drawings, “The Pencil Is a Key: Drawings by Incarcerated Artists.” The selections are beautiful, rage-inspiring, tragic — a testament to the power of drawing as tool, survival skill, memory theater, and weapon to fight for justice, gain agency, and allow the imagination to soar. The artists range from those imprisoned during the Terror of the French Revolution, to Native Americans confined in horrible conditions working for slave wages and selling drawings for pennies to soldiers’ wives and white tourists, to so-called outsider visionaries who spent the bulk of their lives in mental institutions producing some of the most powerful art of the 20th century. There are also works by Japanese-Americans the U.S. government interned as “enemy aliens” and by numerous political prisoners who taught themselves to draw while locked up in Brazil, Argentina, Chile, South Africa, Sudan, Assad’s Syria, Nazi Germany, and post-9/11 Guantánamo Bay — where even top-priority “confirmed” terrorists have been cleared for release after more than 15 years of torture and privation. “In this moment in our country and around the world,” Hoptman says, “when all kinds of freedoms are being called into question, this show is about the ability of drawing to articulate our humanity and express our determination to be free even in the most dire circumstances.” She’s right. This work will make your heart soar, your stomach retch, and your fists clench.\n\n“The Pencil Is a Key: Drawings by Incarcerated Artists,” on view at The Drawing Center, October 11 to January 5.\n\nWhat Else We Think Will Be Great\n\nBy Jerry Saltz\n\nSeptember\n\nPope.L, Thunderbird. Photo: Courtesy of Artist\n\nPope.L (Public Art Fund, “Conquest”; 9/21. Whitney, “Choir”; 10/10–winter 2020. MoMA, “member”; 10/21–2/1/2020)\n\nAfter winning the Whitney’s $100,000 Bucksbaum Award in 2017, Pope.L hits the New York institutional trifecta with an extravaganza of three upcoming shows. The Museum of Modern Art will mount a retrospective of the activist-sculptor-painter-provocateur’s work from 1978 to 2001 — including videos of the epic crawls he did on his belly through the streets of New York City dressed as an African-American superhero. Also stay tuned for a mass performance of over 100 volunteers of all races crawling together through the Washington Square arch to Union Square.\n\nAmy Sherald, SOMETIMES THE KING IS A WOMAN VIEW. Photo: Timothy Doyon/courtesy of Hauser & Wirth\n\nAmy Sherald: “the heart of the matter …” (Hauser & Wirth; 9/10–10/26)\n\nThis will be the first big New York solo show of Sherald’s haunted, ashen, poised, yet once-removed African-American figures rendered in flat fields of alternating bright and muted colors with simple forms and uninflected surfaces. Sherald, 46, is the artist who created the portrait of former First Lady Michelle Obama.\n\nCorbaz, from “Memory Palaces.” Photo: Collection of Audrey B. Heckler © L’association Aloïse\n\n“Memory Palaces: Inside the Collection of Audrey B. Heckler” (The American Folk Art Museum; 9/17–1/26/2020)\n\nThe American Folk Art Museum is the most underrated cultural resource in Manhattan. Show after show, mounted with grit, intelligence, and love in the museum’s difficult lobby space, luxuriates in the glories of self-taught visionary artists. This fall, see a deep dive into Heckler’s magnificent collection of their work.\n\nOctober\n\nNicolas Moufarrege, Untitled. Photo: Courtesy Nabil Moufarrej and Gulnar “Nouna” Mufarrij\n\nNicolas Moufarrege: “Recognize My Sign” (The Queens Museum; 10/6–2/16/2020)\n\nThe great, now-almost-unknown Egyptian-Lebanese New York–based artist-writer Moufarrege died too young, of AIDS, in 1985 at age 37. Moufarrege made gorgeous embroidered paintings to address issues of migration, queerness, and homophobia. He was also among the sharper critics of his day and a fabulous dandy.\n\nJacob Lawrence, This is Harlem. Photo: Courtesy Nabil Moufarrej and Gulnar “Nouna” Mufarrij (moufarrege); 5. ©The Jacob and Gwendolyn Knight Lawrence Foundation, Seattle / Artists Rights Society (ARS)\n\n“Edith Halpert and the Rise of American Art” (The Jewish Museum; 10/18–2/9/2020)\n\nHalpert (1900–1970), born in Odessa (then a part of Russia), was the first significant woman gallerist in the United States. She helped propel American art, seen everywhere else as hopelessly provincial and out of it, to center stage. From 1926 on, she showed artists like Stuart Davis, Charles Sheeler, Ben Shahn, Georgia O’Keeffe, Jacob Lawrence, Horace Pippin, and Yasuo Kuniyoshi, who was classified as an enemy alien during World War II. This American hero deserves her due.\n\nWhat We Think Will Be Big\n\nBy Carl Swanson\n\nSeptember\n\nMemento mori, from “Tokyo Pop Underground.” Photo: Courtesy of Jeffrey Deitch Gallery\n\nLoie Hollowell: “Plumb Line” (Pace; 9/14–10/19)\n\nThe popular young mystical feminist abstractionist — she might just remind you of Agnes Pelton, Georgia O’Keeffe, or Judy Chicago — helps inaugurate the new neo-brutalist Pace megagallery in west Chelsea with what she calls her self-portraits.\n\n“Tokyo Pop Underground” (Jeffrey Deitch; 9/14–11/2)\n\nThis could be the Ur–Deitch show, a manga-and-more candyland, curated by Tokyo gallerist Shinji Nanzuka, that will once more underscore that the Japanese can’t help but be cooler than you.\n\nOctober\n\nJacolby Satterwhite: “You’re at Home” (Pioneer Works; 10/4–11/24) Promises a millennial-nostalgia house of horrors, or at least submerged longings. He’s building an immersive installation of video projections, virtual reality, and “a retail store styled to resemble a defunct Tower Records” to lose yourself in once you’ve made it all the way to Red Hook.\n\n“JR: Chronicles” (Brooklyn Museum; 10/4–5/3/2020)\n\nLiterally big: The onetime street artist creates one of his digitally collaged murals, The Chronicles of New York City, for the Brooklyn. Look closely: Maybe you’ll see someone you know!\n\n“Hans Haacke: All Connected” (The New Museum; 10/24–1/26/2020)\n\nA retrospective centered on his all-too-timely bronze horse-skeleton sculpture, Gift Horse (2014), “adorned with an LED ribbon streaming stock prices in real time.”\n\nNovember\n\n“Theater of Operations: The Gulf Wars 1991–2011” (MoMA PS1; 11/3–3/1/2020)\n\n﻿A show of more than 50 artists (Afifa Aleiby, Paul Chan, Guerrilla Girls — but no paintings by W.) whose work was inspired by America’s late-empire military adventures.\n\n*This article appears in the September 2, 2019, issue of New York Magazine. Subscribe Now!", "description": "Here are the art shows to see this fall: “The Pencil Is a Key: Drawings by Incarcerated Artists,” Pope.L, Amy Sherald, “Tokyo Pop Underground” at Jeffrey Deitch, “JR: Chronicles” at Brooklyn Museum, Hans Haacke at New Museum, and more.", "authors": ["Jerry Saltz", "Carl Swanson"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/08/29/magazine/art/29-art-drawing-center-sergio-sister.w1200.h630.jpg", "published_at": "2019-09-11"}