{"pub": "theverge", "url": "https://theverge.com/2019/7/16/20696199/sony-a7r-iv-mirrorless-camera-full-frame-announced-features-specs-pricing", "downloaded_at": "2019-10-05 14:32:13.860252+00:00", "title": "Sony’s new A7R IV full-frame mirrorless camera has a monstrous 61-megapixel sensor", "language": "en", "text": "Sony clearly doesn’t want Canon and Nikon encroaching on its territory. Having seen what its competitors have offered up with the EOS R and Z6 / Z7 respectively, today Sony announced the A7R IV, its latest and most advanced full-frame mirrorless camera yet. Sony says it delivers “medium-format image quality” with the help of a new 61-megapixel sensor.\n\nThis camera’s predecessor, the A7R III, features a 42.4-megapixel sensor, so you can see that Sony has made some strides in how far it can push resolution. Naturally, Sony says the new sensor enables an extraordinary level of detail even when you zoom far into your images. The A7R Mark IV will be released in September for $3,500.\n\nFor comparison’s sake, here’s where the A7R IV’s also-very-expensive competitors slot in on megapixel count with their full-frame mirrorless cameras:\n\nPanasonic S1R: 47.3MP\n\nNikon Z7: 45.7MP\n\nCanon EOS R: 30.3MP (in fairness, the EOS R isn’t exactly targeting the same market)\n\nDo most people need 61 megapixels worth of image data? No. Definitely not. But the pro users who crave more and more resolution to work with will be drawn to Sony’s new camera. Going any higher basically requires buying into a medium-format system. The A7R IV has 15 stops of dynamic range, five-axis image stabilization, and burst shooting at 10 fps (with continuous AF / AE for every shot), according to Sony. Even when you drop it into an APS-C crop mode, it’ll capture 26 megapixels, on par in pixel density with something like the Fujifilm X-T3.\n\nThe autofocus system utilizes 567 phase-detect points and Sony’s signature eye tracking for both humans and animals. For the first time ever in one of its cameras, Sony is applying that real-time eye AF to video recording. The A7R IV is capable of 4K movie recording with S-Log 2/3 for professional editing. Below is Sony’s overview of specs, and if you want to dig in deeper — I’m looking at you, video people — here’s a more thorough look.\n\nSony is also upgrading the audio recording capabilities in the A7R IV with a new system that captures a digital audio signal. The company is introducing two accessories that take advantage of the new system, a $350 shotgun mic and $600 XLR mic adapter kit.\n\nOther improvements include a 5.76-million-dot electronic viewfinder, redesigned grip, enhanced resistance against dust and moisture, dual UHS-II SD card slots, and wireless tethering. Sony’s latest camera comes as more and more consumers shift away from DSLR-style cameras to mirrorless bodies, which are often more compact and efficient. That trend has led camera giants Canon and Nikon to follow Sony’s path into full-frame mirrorless. But with the A7R IV, Sony is trying to demonstrate that its existing lead (both technological and in market share) might be insurmountable.", "description": "Sony has announced the A7R Mark IV, its latest full-frame mirrorless camera. It features a 61-megapixel sensor and can capture up to 15 stops of dynamic range.", "authors": ["Chris Welch", "Jul"], "top_image": "https://cdn.vox-cdn.com/thumbor/0qT5fO_Nx-8SDknXNGhh44MoYfY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18313420/DSCF2158.jpg", "published_at": "2019-07-16"}