{"pub": "guardian", "url": "https://theguardian.com/politics/2019/oct/06/macron-gives-boris-johnson-end-week-overhaul-brexit-plan", "downloaded_at": "2019-10-07 00:16:57.359864+00:00", "title": "Macron gives Johnson until end of week to overhaul Brexit plan", "language": "en", "text": "The French president has given Boris Johnson until the end of the week to fundamentally revise his Brexit plan, in a move that increases the chances of the negotiations imploding within days.\n\nThe UK proposals tabled last week are not regarded in Brussels as being a basis for a deal and Emmanuel Macron emphasised it was up to the UK to think again before an upcoming EU summit.\n\nAfter declining to meet with the prime minister in person, Macron further insisted during a phone call on Sunday that the talks would only be advanced through Michel Barnier, the EU’s chief negotiator.\n\n“Boris Johnson presented his latest proposals,” an official at the Élysée Palace said of the conversation. “The president told him that the negotiations should continue swiftly with Michel Barnier’s team in coming days, in order to evaluate at the end of the week whether a deal is possible that respects European Union principles.”\n\nBarnier has already said he does not have a mandate from the EU27 to agree a deal on the terms so far presented by Downing Street.\n\nThe prime minister’s chief negotiator, David Frost, has also been repeatedly told there will no last-minute negotiations with leaders at the summit on 17 October.\n\nThe British proposals involve the return of a customs border on the island of Ireland and a Democratic Unionist party veto on Northern Ireland staying in the EU’s single market for goods, an arrangement designed to avoid checks on the border.\n\nQuick guide Why is the Irish border a stumbling block for Brexit? Show Hide Counties and customs Inside the EU, both Ireland and Northern Ireland are part of the single market and customs union so share the same regulations and standards, allowing a soft or invisible border between the two.\n\nBritain’s exit from the EU – taking Northern Ireland with it – risks a return to a hard or policed border. The only way to avoid this post-Brexit is for regulations on both sides to remain more or less the same in key areas including food, animal welfare, medicines and product safety. The 'backstop' in Theresa May's Withdrawal Agreement was intended to address this - stating that if no future trade agreement could be reached between the EU and the UK, then rules and regulations would stay as they are. This has been rejected by Brexit supporters as a 'trap' to keep the UK in the EU's customs union, which would prevent the UK striking its own independent trade deals. There are an estimated 72m road vehicle crossings a year between Northern Ireland and the Republic of Ireland, and about 14% of those crossings are consignments of goods, some of which may cross the border several times before they reach a consumer. Brexit supporters say this can be managed by doing checks on goods away from the border, but critics say it will be difficult to police this without any physical infrastructure like border posts of cameras, which could raise tensions in the divided communities of Ireland. Interactive: A typical hour in the life of the Irish border Photograph: Design Pics Inc/Design Pics RF\n\nMacron’s message to Johnson echoed the words of the Dutch prime minister, Mark Rutte, who reportedly told the prime minister in a call on Saturday that the EU27 would not accept an agreement that created a customs border in Ireland. “Important questions remain about the British proposals,” Rutte later tweeted.\n\nOpposition MPs are expected on Monday to push for a vote demanding publication of the full 40-page legal text of the alternative backstop plan presented to the EU by the UK. So far only a seven-page explanatory note has been published.\n\nThe shadow Brexit secretary, Keir Starmer, said it was important to see the legal detail “because we suspect it will confirm that the government’s proposals unavoidably mean the introduction of infrastructure in Northern Ireland, and that this will contradict the assurances that Johnson gave in the house on Thursday [that no new infrastructure would be required]”. Starmer also said the legal text would clarify whether or not workers’ rights were being protected.\n\nOpposition MPs have been able in the past to use the Commons standing order 24 to trigger an emergency debate on a binding “humble address” motion demanding the release of government papers, but such a debate would only go ahead with the approval of the Speaker.\n\nWith just a few days remaining for the UK to backtrack on key aspects of its proposals, officials in Brussels described the talks as a “farce”.\n\nMichel Barnier: blame Boris Johnson for a no-deal Brexit Read more\n\nThe two sides appear locked in an impasse. Frost told European commission officials on Friday the UK would not move on its negotiating position until Brussels accepted its main proposals as a basis for the talks.\n\nJohnson’s most senior adviser, Dominic Cummings, has told Conservative aides that the government will not fundamentally change its proposals.\n\nMeanwhile Latvia’s prime minister, Krišjānis Kariņš, told the BBC the onus was on Johnson to make a move. He said: “If the offer from the UK turns out to be a take-it-or-leave-it, it’s going to be very difficult I see in agreeing. It’s fully dependent on the will of Mr Johnson because from the European side, we’re always open and looking towards a deal.”\n\nGiven the gap in positions, senior EU sources said Brussels had all but written off the chance of a deal being struck and that the onus was now on avoiding blame.\n\n“Increasingly capitals have the impression the legal text was tabled to be rejected and never meant to a basis for discussion,” said one EU diplomat.\n\nDowning Street said that when Johnson spoke to Macron, the prime minister said: “We have to push forward.” He told the French president that the EU should not be lulled into the mistaken belief that the UK would stay in the EU beyond 31 October in the event of no deal, No 10 said.\n\nStressing that his plan now had more support from MPs than any previous proposal, Johnson told Macron that it was now up to the EU to compromise.\n\nA senior No 10 source said: “The UK has made a big, important offer but it’s time for the commission to show a willingness to compromise too. If not, the UK will leave with no deal.\n\n“If EU leaders are betting that [the Benn act] will prevent no deal, that would be a historic misunderstanding.”\n\nJohnson, who also spoke to the Portuguese prime minister, António Costa, at the weekend, is scheduled to have further talks with EU leaders on Monday. Frost is continuing talks with commission officials, and Stephen Barclay, the Brexit secretary, is visiting EU capitals.\n\nThe Labour leader, Jeremy Corbyn, will host another meeting of opposition party leaders at Westminster on Monday, the first since the PM’s plan was published. “The cross-party meeting will decide what next steps we can take together to hold the government to account, and to ensure the prime minister adheres to the law in seeking an extension if no deal is reached by 19 October,” Corbyn said.\n\nUnder the Benn act, Johnson will have to request an extension to the UK’s EU membership by 19 October if a deal has not been agreed.\n\nIn response to claims in the Sunday Telegraph that Johnson would seek to provoke the EU to veto an extension by threatening to be an obstructive member state, one EU official described the government as “beyond pathetic”.\n\nClaims that the government could veto the EU’s budget or impose Nigel Farage as the British commissioner were said to be “nonsense”.\n\nThe budget is unlikely to be finalised and put to a vote until June next year. The commission president, Ursula von der Leyen, or the European parliament can reject a member state’s nomination for a commissioner portfolio.", "description": "French president’s insistence that UK should give way raises chances of talks imploding", "authors": ["Daniel Boffey", "Andrew Sparrow"], "top_image": "https://i.guim.co.uk/img/media/369f0a7cb1cbac87ff3351b2a1b5a6d81c737f6e/0_197_2011_1207/master/2011.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f3b8a3a5bb7d60bcc9db770799a2a8e5", "published_at": "2019-10-06"}