{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7538345/Priyanka-Chopra-dons-floral-trouser-suit-steps-Mumbai-promote-Sky-Pink.html", "downloaded_at": "2019-10-05 06:11:22.472596+00:00", "title": "Priyanka Chopra dons a floral trouser suit as she steps out in Mumbai to promote The Sky Is Pink", "language": "en", "text": "She's spent the past week in her native country of India without her husband, Nick Jonas, to promote her latest Bollywood flick, The Sky Is Pink.\n\nAnd, Priyanka Chopra, 37, looked sensational as she stepped out in a floral trouser suit while continuing her promotional tour in Mumbai on Friday.\n\nThe actress oozed confidence in her eye-catching silky co-rd, which boasted a black tie belt that she wrapped around her waist.\n\nGorgeous: Priyanka Chopra, 37, looked sensational as she stepped out in a floral trouser suit while continuing her promotional tour in Mumbai on Friday\n\nPriyanka boosted her height with a classic pair of pointed black heels as she strolled along with her co-star Rohit Saraf.\n\nKeeping cool, the star swept her raven tresses up into a chic bun atop her head, and accessorised with statement earrings.\n\nHer flawless visage was adorned with a light dusting of make-up complete with a pink lip, and she shielded her eyes with a pair of sunglasses.\n\nSensational: The actress oozed confidence in her eye-catching silky co-rd, which boasted a black tie belt that she wrapped around her waist\n\nStylish: Keeping cool, the star swept her raven tresses up into a chic bun atop her head, and accessorised with statement earrings\n\nStriding out: Priyanka boosted her height with a classic pair of pointed black heels as she strolled along with her co-star Rohit Saraf\n\nOn Thursday evening, Priyanka looked pretty in baby pink as she posed on the red carpet at a welcome party on the eve of NBA's India debut in Mumbai city.\n\nThe Quantico star confidently opted to go braless beneath the sleek satin power suit from MUNTHE.\n\nPriyanka oozed sophistication as she arrived clad in an oversized blazer and coordinating trousers, with bow-adorned stilettos boosting her height.\n\nThe fashionista styled her raven tresses into a chic up-do, with her side fringe styled into effortless waves, and added a pink lipstick to her flawless make-up look.\n\nWorking hard: She's spent the past week in her native country of India without her husband, Nick Jonas, to promote her latest Bollywood flick, The Sky Is Pink\n\nChic: On Thursday, Priyanka looked pretty in baby pink as she posed on the red carpet at a welcome party on the eve of NBA's India debut in Mumbai city\n\nGorgeous: The Quantico star confidently opted to go braless beneath the sleek satin power suit from MUNTHE\n\nThe Indiana Pacers and Sacramento Kings will play two preseason games, kick-starting NBA's venture in India.\n\nThe games will be played on Oct. 4 and Oct. 5 at the Dome, SVP, NSCI Stadium in Mumbai\n\nSpeaking about her upcoming film, The Sky Is Pink, Priyanka recently told the Times of India that viewers should bring both their 'brain and heart' when watching the movie.\n\n'This is a very special film based on a special real-life couple who thrive through extraordinary circumstances,' she began.\n\nCelebrations! The Indiana Pacers and Sacramento Kings will play two preseason games, kick-starting NBA's venture in India\n\n'I feel like in a cynical world today where we live our own lives, this film shows you what it can do when you have a family, family support.'\n\nShe continued: 'I feel like when I read the movie (script), that's when you know.. jumped out at me so much because my parents were like that.\n\n'They were extremely supportive and that gave me the ability to be who I am and where I am today. You will need your brain and your heart.'\n\nThe Sky Is Pink will be released on October 11 in the USA.", "description": "The actress oozed confidence in her eye-catching silky co-rd, while continuing her promotional tour in Mumbai on Friday", "authors": ["Ellie Phillips For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/16/19302692-0-image-a-35_1570201625015.jpg", "published_at": "2019-10-04"}