{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/klm-ceo-on-when-the-first-electric-airplane-will-arrive-2019-10", "downloaded_at": "2019-10-11 12:51:13.631502+00:00", "title": "The CEO of KLM predicts that the first commercial electric airplane will arrive in 15 to 20 years", "language": "en", "text": "Today, the sight of an electric vehicle is pretty unremarkable, which shows how much the sector has progressed.\n\nCEO of KLM Royal Dutch Airlines Pieter Elbers thinks we should see electric airplanes on commercial flights within the next 15 to 20 years.\n\nVisit Business Insider's homepage for more stories.\n\nWhen the first electric cars came on the scene, people scoffed. Today, no one would bat an eyelid at the sight of an electric vehicle.\n\nBusiness Insider Polska asked Pieter Elbers, CEO of KLM Royal Dutch Airlines, when we might see electric planes used commercially.\n\n\"It's clear to see how far this sector has progressed,\" Elbers said, speaking to journalists on the 100th anniversary of the founding of KLM. \"I don't believe, however, that the first electric planes will appear within the next five or six years.\"\n\nBritish airline EasyJet announced in 2017 that it plans to use electric airplanes that it will develop in partnership with Wright Electric, Reuters reported. Last year, the airline was reportedly eyeing its Amsterdam-London route as one of the first to use the planes, with a target date of 2027.\n\nFor Elbers, that might be ambitious.\n\nRead more: Electric planes could be a reality 'within 15 years', according to former Air France CEO\n\nPieter Elbers, CEO of KLM Royal Dutch Airlines. KLM \"I think a realistic projection for an electric plane is somewhere between 15 and 20 years,\" Elbers said, echoing the comments made earlier this year by former Air France CEO Alexandre de Juniac.\n\nOn that timeline, the date for the arrival of commercial electric airplanes would be between the years 2034 and 2039.\n\n\"However, I appreciate the ambitious plans,\" he said. \"I think we should all make much greater efforts to broaden our knowledge and develop in this area.\"", "description": "Pieter Elbers, the CEO of KLM Royal Dutch Airlines, echoed statements made earlier this year by former Air France CEO Alexandre de Juniac.", "authors": ["Ruqayyah Moynihan", "Marcin Walków", "Business Insider Polska"], "top_image": "https://image.businessinsider.com/5d9f2590122bd576555e8245?width=1200&format=jpeg", "published_at": "2019-10-11"}