{"pub": "investing.com", "url": "https://ph.investing.com/news/forex-news/forextrade-optimism-supports-dollar-vs-yen-fed-awaited-74217", "downloaded_at": "2019-10-29 01:50:31.298813+00:00", "title": "FOREX-Trade optimism supports dollar vs yen; Fed awaited", "language": "en", "text": "© Reuters. FOREX-Trade optimism supports dollar vs yen; Fed awaited\n\n* Optimism on trade as investors hope for Sino-U.S. progress\n\n* Dollar holds overnight gains on yen, Aussie supported\n\n* Fed cut expected, rhetoric to set tone\n\n* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh\n\n\n\nBy Tom Westbrook\n\nHONG KONG, Oct 29 (Reuters) - Both the dollar and riskier\n\nAsian currencies held on to modest overnight gains on Tuesday,\n\namid hopes for an easing in Sino-U.S. trade tensions and as\n\ninvestors waited for direction from this week's Federal Reserve\n\nmeeting.\n\nU.S. President Donald Trump said a trade agreement looked to\n\nbe ahead of schedule on Monday, without detailing the timing,\n\nwhile the U.S. also said it was studying whether to extend\n\ntariff suspensions due to expire in December. That followed remarks late last week from both U.S. and\n\nChinese officials saying they were \"close to finalising\" a deal\n\nthat lifted trade-exposed currencies such as the Australian\n\ndollar, while weighing on safe-havens such as the Japanese yen.\n\nThe mood cautiously held on Tuesday.\n\nThe Aussie AUD=D3 kept its gains to stand just under a\n\nfive-day peak at $0.6842, while the greenback held on to its\n\nprogress against the yen to stand at 108.96 yen per\n\ndollar, just below a three-month high hit overnight.\n\n\"So far the soundings coming from both the U.S. and China\n\npoint to the likelihood of significant progress,\" said Rodrigo\n\nCatril, National Australia Bank's senior FX strategist.\n\nHe added, though, that China's demand for a pullback on U.S.\n\ntariffs remained unresolved and warned talks could easily fail\n\nagain if a compromise cannot be reached.\n\nThe dollar was steady against the euro at $1.1096 and\n\nflat against a basket of currencies at 97.755.\n\nThe New Zealand dollar was 0.2% higher at $0.6361.\n\nChina's yuan, CNH= which hit a six-week high in offshore trade\n\non Monday, before retreating, was steady at 7.0617 per dollar.\n\nBeyond the trade headlines, the major focus this week is the\n\nFed meeting.\n\nThe U.S. central bank is expected to cut rates for a third\n\ntime in a row when it concludes its two-day meeting on\n\nWednesday.\n\nInvestors are watching for any indication that further cuts\n\nare likely, with futures pricing suggesting an expectation for\n\nfurther easing in 2020.\n\n\"The forward guidance will be the thing,\" said Westpac\n\nanalyst Imre Speizer in Auckland.\n\n\"It still looks like a done deal that they will cut, but\n\nthen the risk is that they might characterise that as just one\n\nmore insurance move ... the market will have to take out the\n\npricing it's got for future dates.\"\n\nThe British pound, meanwhile, nudged lower to\n\n$1.2857, with Brexit hanging in the balance.\n\nThe European Union has agreed to delay Britain's exit for up\n\nto three months, but the country is politically paralysed and\n\novernight parliament rejected Prime Minister Boris Johnson's\n\nthird attempt to schedule a Dec. 12 election. Johnson has said he would try again, by a different\n\nlegislative route that would only require a simple majority,\n\nrather than a two-thirds majority.\n\n\n\n", "description": "FOREX-Trade optimism supports dollar vs yen; Fed awaited", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEE1F13X_L.jpg", "published_at": "2019-10-29"}