{"pub": "guardian", "url": "https://theguardian.com/business/nils-pratley-on-finance/2019/sep/18/cobham-sale-is-a-bad-deal-but-not-a-national-security-threat", "downloaded_at": "2019-09-19 09:40:15.681321+00:00", "title": "Sale of defence firm Cobham is a bad deal but not a security threat | Nils Pratley", "language": "en", "text": "Andrea Leadsom to the rescue? The business secretary has ordered a formal review, on national security grounds, into the proposed £4bn purchase of Cobham, the Dorset-based defence firm, by a US private equity house. So one might imagine an uplifting twist to this depressing takeover tale – an 11th-hour escape.\n\nIt’s a very long shot, sadly. An intervention would require Leadsom to identify what national security interest is threatened by allowing Advent International to buy Cobham. Since the target itself says only 8% of its revenues are earned in the UK, it is hard to spot any objection big enough to kill the deal.\n\nWithin the UK portion, one can point to a contract to train Royal Navy pilots for “special missions”. Sandy Morris, an analyst at Jefferies, reckons that operation could indeed be considered sensitive – but adds that it could be separated or sold. It doesn’t look a deal-blocker.\n\nIt is possible there are capabilities within Cobham that are kept from outside eyes but the high-profile kit, such as air-to-air refuelling systems, does not obviously have to be UK-owned for security reasons. Our fighter jets are the product of multinational cooperation, so why would parts for conical drogues be a special case?\n\nNone of the above changes the view here that the takeover of Cobham is rotten on purely commercial grounds. A timid board rolled over too easily and weak shareholders voted by a 93% majority for the sugar rush of a 34% takeover premium.\n\nA well-run Cobham, which is only halfway through a self-help programme, could surely have done better over the long term by keeping its independence. Short-termism won and may continue to do so – Advent will probably make a bumper profit by selling Cobham in pieces within five years.\n\nThat is a reason to deplore the UK’s free-and-easy takeover regime but it’s not an objection on grounds of security. Leadsom can still oblige Advent to give binding guarantees about UK jobs, investment and patents. She should push as hard as possible on that front, just as the US would in reverse. But national security? It’s hard to play that card here.\n\nBreakup of Kingfisher just won’t fly\n\nThe cheap shot to aim at Kingfisher, the owner of B&Q and Screwfix in the UK and Castorama and Brico Dépôt in France, is that the company exists in a state of perpetual restructuring. The observation is roughly correct, of course.\n\nVéronique Laury, the departing chief executive, has obsessed about her “ONE Kingfisher” unification programme almost from the day she started in 2016, just as her predecessor was a simplifier.\n\nYears of internal fussing around haven’t helped the share price, nor even the profit line in recent years. Laury, having promised a five-year £500m boost to profits, didn’t deliver. Weak markets haven’t helped but Kingfisher has seemed to baffle itself at times as it tried to impose the same product ranges on all corners of its fiefdom.\n\nWednesday’s sluggish half-year numbers suggest the full-year outcome will arrive at 2016 levels, about £640m. Thus a frustrated City has started to imagine the reverse strategy – a breakup of the retailing conglomerate.\n\nReally? It does not sound like a quick route to improve a share price that is close to 10-year lows. Where is the hidden value supposed to be? If Castorama and B&Q now have a single IT system, a single buying team, and sell mostly the same products, surely separation would add costs.\n\nThe first task for the incoming boss, Thierry Garnier, is to answer this question: is a breakup, for practical purposes, now impossible? One suspects the answer may be yes.", "description": "Andrea Leadsom’s 11th-hour review of US private equity takeover looks doomed to fail", "authors": ["Nils Pratley"], "top_image": "https://i.guim.co.uk/img/media/7c4895eee69cf5dde3d4f4889251d0fea42b544a/0_155_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=24c42153a42720b057c6adbf57edb645", "published_at": "2019-09-18"}