{"pub": "theverge", "url": "https://theverge.com/2019/9/12/20861085/sega-genesis-console-retro-mini-review-launch-games", "downloaded_at": "2019-10-05 14:08:55.887404+00:00", "title": "Sega Genesis Mini review: the best tiny console yet", "language": "en", "text": "We’re now at a point where there are multiple companies trading on nostalgia with high-end micro consoles. It’s a trend Nintendo started with the NES Classic, and one that has continued with the SNES Classic and last year’s PlayStation Classic. Each device offers the same basic thing: a selection of games from a particular retro console, all bundled in a tiny device that looks just like the original, only smaller.\n\nSega is coming in a little bit late to this trend that kicked off back in 2016. But to make up for its tardiness, the company has created what is the best iteration of a miniature console to date. The $79.99 Sega Genesis Mini nails all of the basics, with great, adorable hardware and a varied selection of classic games. But it also goes a step further, with an attention to detail that makes it more than just a fun plastic box: it’s a celebration of the most important years of Sega’s long history.\n\nFirst, there’s the hardware itself. At a glance, the Genesis Mini looks just like its competitors: a shrunken version of a console that came out decades ago. It’s plastic and toy-like, and Sega says it’s 55 percent the size of the original console. It weighs next to nothing. The top features the familiar “16 BIT” logo in raised silver letters, along with the premature “high definition graphics” boast printed right on the casing.\n\nLook a bit further, though, and the Genesis Mini is actually a surprisingly faithful recreation of the original hardware, including elements that aren’t even functional. The cartridge flaps open up, and there’s a useless volume dial you can slide around. There’s even a removable expansion port on the bottom with no actual expansion options. These elements are silly and superfluous, but they’re also indicative of the Genesis Mini as a whole, and the attention to detail that makes it feel all the more authentic. Playing with the cartridge slot, you can feel the love the Mini’s creators had for the original console.\n\nFunctionally, the Genesis Mini is dead simple. There are only two ports on the back, one for power, one for HDMI. You can plug it in and start playing immediately, without the constant need for online updates that plague most modern devices. It’s refreshing, as is the pleasingly straightforward controller. Like the console itself, the three-button gamepad feels authentic. It’s a big plastic shell, with a solid D-pad and comically huge face buttons. It’s so simple that it’s a nice break from modern gamepads; there’s no transforming your hand into a claw to hit multiple buttons simultaneously. The only real downside is that the controller is wired, and it has a relatively short six-foot-long wire. I spent most of my time playing sat on the floor in front of my television, as if it was 1993. (For more on the controller options, see the “Do you need a six-button controller?” sidebar.)\n\nDo you need a six-button controller? For the most part, the three-button controllers that come bundled with the Genesis Mini do the job well enough. But if you plan on spending a lot of time with the console, I’d recommend buying the optional six-button gamepads for a few different reasons. The most obvious is the added buttons. You won’t miss them in most games, but playing something like Street Fighter II is a nightmare on Genesis without the extra buttons; you actually have to hit start to toggle between punches and kicks, which means you can’t actually pause the game. But there are also some quality-of-life improvements that are very welcome. The cord is several feet longer, which makes playing much more comfortable, and there’s a new shoulder button specifically for accessing the main system menu, a much more intuitive option compared to holding start for several seconds. These upgrades aren’t strictly necessary, but they are definite improvements, and as a bonus the USB controller works with other platforms like PC and the Switch. A single six-button gamepad will set you back $20.\n\nSoftware-wise, the Genesis Mini includes most of the expected features. Each game has multiple save files, so you can hop in and out of games easily, bypassing the often restrictive nature of retro game saves. You can display games in widescreen or standard view, with multiple wallpaper options to fill in the gaps, and titles can be organized by a range of factors like release date or number of players supported. You can even flip the box art around and view games by their spine, as if they were on a bookshelf.\n\nBut again, there are some nice touches that make this feel a step above other offerings. For one, the Genesis Mini features brand-new menu music. And not just any music: it’s a new tune from famed Streets of Rage composer Yuzo Koshiro, and it rocks. It was even composed using the same sound chip found in the original Genesis. Perhaps most important: if you hold the start button in the middle of a game, it’ll bring up a menu option where you can save and head back to the main game selection screen. It may sound small, but previous mini offerings from Nintendo had no home button functionality at all, forcing you to get up and hit the reset button on the console itself.\n\nMy favorite feature, though, sounds like the most boring: the language options. What’s great is that this changes more than just the menu text. Switch from English to Japanese and the UI design will switch as well, reflecting the Japanese version of the console, the Mega Drive. You can scroll through the vastly superior Japanese box art, and — most exciting — the lineup of games will actually change slightly. There’s no version of the colorful puzzle game Puyo Puyo in English, but you can play it in Japanese via a simple menu option.\n\nOf course, the most important part of the device is the game library itself. Since they come preloaded and there’s no way to change or update them outside of hacking, the library is crucial. The Sega Genesis Mini features 42 different games, a big jump from Nintendo and Sony’s offerings, and they do an amazing job of showcasing the console’s eclectic history. There are the obvious inclusions, like the first two Sonic the Hedgehog games and Sega mainstays Columns, Golden Axe, and Ecco the Dolphin. But there are also some great third-party titles, including Castlevania: Bloodlines and Contra: Hard Corps. The Genesis Mini also includes less-heralded — but no less important — Sega titles like the Mickey Mouse adventure Castle of Illusion and its sequel, alongside ambitious oddities like the fantasy adventure game Beyond Oasis (which has yet another amazing Yuzo Koshiro soundtrack).\n\nNot every game is good. Eternal Champions is a mostly forgettable fighting game, and some of the later Genesis titles felt more like technical showcases than flagship games, including the visually stunning Vectorman and a technically impressive but not especially fun port of Virtua Fighter 2. There are some great two-player games, like Streets of Rage 2, and lengthy single-player titles you can get lost in, like Phantasy Star IV. There are even two bonus games that didn’t actually appear on the Genesis: a dead-simple port of Tetris and Taito’s 1986 arcade shooter Darius.\n\nThe games play just like you remember them, thanks to the technical handiwork of retro game studio M2, which has a storied history of porting classic Sega titles. What’s fascinating is how the games not only span play styles and genres, but also history. If you play 1989’s Alex Kidd in the Enchanted Castle, one of the earliest Genesis games, and then explore the colorful adventure of Monster World IV, which came out five years later, it’s hard to believe they were developed for the same hardware. You can follow the trajectory of Genesis games from souped up 8-bit games to experiences that were really pushing the limits of what the console was capable of. It’s a wonderfully approachable and tactile way of exploring gaming history.\n\nThe real question for anyone looking to pick up the Genesis Mini is how long all of those appealing elements will keep you interested. Plug-and-play retro consoles are a great idea on the surface, a simple and inexpensive way of exploring classic games on a modern TV, without the hassle that comes from dealing with old hardware or cartridges. But with their sometimes obtuse nature and unforgiving difficulty, older games won’t necessarily have much lasting appeal for everyone. There are plenty of tiny retro Nintendo consoles that were eagerly anticipated and now sit collecting dust.\n\nBut if you’re the kind of person who is ready to sink dozens of hours into Phantasy Star, and invite people over so you can tag-team ToeJam and Earl, you can’t really go wrong with the Genesis Mini. It has exactly what you’ve come to expect from a tiny retro console — cute hardware, a well-constructed library of games, and modern features like multiple save files — but also goes a step further with the smaller details, like the menu music, moving bits of hardware, and access to games from multiple regions.\n\nThe PlayStation Classic felt like a slapped-together product meant to capitalize on a trend. The Genesis Mini feels like the opposite: it’s a tiny box meant to preserve and honor a beloved console.\n\nThe Sega Genesis Mini launches on September 19th.", "description": "Following in the footsteps of Nintendo’s NES and SNES Classic, Sega has built the Genesis Mini, a tiny retro console packed with 42 classic games that launches on September 19th.", "authors": ["Andrew Webster", "Sep"], "top_image": "https://cdn.vox-cdn.com/thumbor/JV5XOgjjTH7y8sLEyCVTQOje7UE=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18969959/cwelch_190813_3600_0001.jpg", "published_at": "2019-09-12"}