{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-soccer-england-liv-new-preview/ankle-injury-rules-newcastles-longstaff-out-of-liverpool-clash-idUKKCN1VY0WQ", "downloaded_at": "2019-09-13 11:12:03.978842+00:00", "title": "Ankle injury rules Newcastle's Longstaff out of Liverpool clash", "language": "en", "text": "FILE PHOTO: Soccer Football - Premier League - Newcastle United v Arsenal - St James' Park, Newcastle, Britain - August 11, 2019 Newcastle United's Sean Longstaff during the match Action Images via Reuters/Carl Recine\n\n(Reuters) - Newcastle United midfielder Sean Longstaff will miss Saturday’s Premier League clash with leaders Liverpool due to a freak ankle injury in training, manager Steve Bruce said on Friday.\n\nLongstaff, who British media reported was a transfer target for Manchester United in the summer, broke into the first team at Newcastle last season and has played all four games of the current campaign.\n\n“Unfortunately, Sean Longstaff turned an ankle yesterday in training. He won’t make tomorrow... we won’t know how severe it is until the next couple of days,” Bruce told reporters.\n\n“It’s one of those freak ones which unfortunately happen. We were disappointed for him that we’ve lost a player to a freak accident. That’s what happens in football unfortunately.”\n\nAndy Carroll has not played for Newcastle since rejoining them on transfer deadline day due to a niggling ankle injury, although Bruce said the striker was back in training.\n\n“I think for everybody to see him joining in with training was good for him, good for the group... we need now positive news from his specialist,” Bruce added.\n\n“It’s always difficult to put a timescale on someone like Andy, he’s fit when he’s fit... when you’ve got an ankle like he’s got, it’s always the reaction to the work put in. At the moment it’s all very good.”\n\nMatt Ritchie is ahead of schedule in his recovery after the winger suffered ankle ligament damage in a League Cup defeat by Leicester City last month.\n\n“We weren’t expecting to see him for at least a couple of months... but the way he trained yesterday and the day before, as long as he doesn’t have a reaction I don’t think he’s very far away... still a couple of weeks.”", "description": "Newcastle United midfielder Sean Longstaff will miss Saturday's Premier League clash with leaders Liverpool due to a freak ankle injury in training, manager Steve Bruce said on Friday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190913&t=2&i=1429392879&w=1200&r=LYNXNPEF8C0R4", "published_at": "2019-09-13"}