{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201910242346/whats-news-business-finance-wsj", "downloaded_at": "2019-10-24 06:55:44.683104+00:00", "title": "What's News: Business & Finance — WSJ", "language": "en", "text": "This article is being republished as part of our daily reproduction of WSJ.com articles that also appeared in the U.S. print edition of The Wall Street Journal (October 24, 2019).\n\nBoeing's profit was slashed in half in the latest quarter and the company is facing a cash squeeze as airlines stop payments, but it still hopes to secure regulatory approval this year for the return of its 737 MAX.\n\nA former senior Boeing pilot complained that he felt pressure from management to ensure MAX jets wouldn't require expensive pilot training, former colleagues say.\n\nAmazon offers a steady stream of clothing from dozens of Bangladeshi factories that are shunned by other leading retailers.\n\nTesla posted a surprise profit for the third quarter, aided by record deliveries. The company's shares rose 20% in after-hours trading.\n\nMicrosoft said continued strength in its cloud-computing business helped deliver strong earnings growth for its fiscal first quarter.\n\nFacebook's Zuckerberg vowed at a House hearing to move ahead with plans to create a cryptocurrency-based payments network.\n\nJeffrey Vinik said he is closing his stock-picking hedge fund less than eight months after he started it.\n\nU.S. stocks inched higher. The S&P 500 rose 0.3%, while the Dow and Nasdaq both gained 0.2%.\n\nFord's operating profit rose 7.5% in the third quarter, but the auto maker lowered its target for the full year.\n\nCaterpillar cut its profit forecast for this year, citing customer caution amid global economic uncertainty.\n\n(END) Dow Jones Newswires\n\nOctober 24, 2019 02:47 ET (06:47 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-24"}