{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7604625/EU-leaders-split-Brexit-delay-Germany-France-short-extension.html", "downloaded_at": "2019-10-23 12:25:23.992626+00:00", "title": "EU leaders split over Brexit delay as Germany and France back a short extension", "language": "en", "text": "brexit countdown_bg Created with Sketch.\n\nClear splits erupted between EU leaders today over how long Brexit should be delayed for.\n\nBoris Johnson was handed a Brexit boost this morning after Berlin signalled it could approve a Brexit extension of just two weeks to get a deal approved.\n\nBut Irish premier Leo Varadkar later came out in support of a rival push by European Council president Donald Tusk to grant the full three-month extension humiliatingly asked for by Boris Johnson at the weekend.\n\nIt means that a final decision on the length of the 'Brextension' may not be made until an emergency summit expected early next week.\n\nGerman foreign minister Heiko Maas joined French president Emmanuel Macron in suggesting any further extension to UK membership did not have to stretch into the new year.\n\n'We need to know: What will be the reason for this?' Maas told private news channel n-tv on Wednesday.\n\n'If it will be about pushing back the date by two or three weeks to allow lawmakers in London to implement the ratification of the exit bill in a reasonable way, I think this will rather not be a problem.'\n\nA French diplomatic source said on Tuesday France is ready to grant an additional few days in order to facilitate the vote but rules out any extension beyond that.\n\n'We'll see at the end of the week whether a purely technical extension of a few days is necessary to complete this parliamentary procedure,' the source said.\n\nThis could work in Mr Johnson's favour, as he could use a short delay to force a full vote on his deal, with the threat of No Deal hanging over them.\n\nEU Brexit negotiation Michel Barnier told Sky this morning: 'We need some clarification on the UK side, what will be the next step for them?'\n\nGerman Foreign minister Heiko Maas (left, with Angela Merkel in Berlin today) said in an interview on Wednesday that Germany would be open to a short-term Brexit delay\n\nMr Macron has been the most outspoken and impatient among the 27's leaders on the issue and favours a short Brextension\n\nBoris Johnson (pictured today) will push for a general election if Brussels follows Donald Tusk's advice to grant another Brexit delay, a No 10 source revealed last night after MPs rejected the Prime Minister's three-day timetable for his Brexit bill\n\nMr Macron has been the most outspoken and impatient among the 27's leaders on the issue.\n\nIt is thought EU leaders will make a decision by Monday. Theoretically, if they were to refuse, Britain could still leave without a deal next Thursday, on October 31.\n\nHowever, in the wake of the vote last night, Donald Tusk, the President of the European Council, said he would recommend an extension to EU leaders. He had said earlier in the day that a 'No Deal' Brexit would never be the EU's choice.\n\nAnd this morning Irish premier Leo Varadkar affirmed his support for President Tusk's idea, after they spoke.\n\n'They noted that it would still be possible for the UK to leave before January 31st 2020 if the Withdrawal Agreement has been ratified in advance of that date,' a Dublin spokesman said.\n\n'The matter is likely to be discussed further at tonight's meeting of the Committee of Permanent Representatives in Brussels.'\n\nDonald Tusk, the President of the European Council, said he would recommend an extension to EU leaders. He had said earlier in the day that a 'No Deal' Brexit would never be the EU's choice\n\nChancellor Merkel has previously indicated she would agree to a longer extension of Article 50 to avoid a No Deal Brexit\n\nAccording to EU sources, member states may now grant a so-called flextension of three months until January 31, meaning the delay could come to an end early if the Commons has ratified the deal. However, three months could also allow time for a general election.\n\nMr Johnson was mandated by Parliament to formally request an extension until January 31 at the weekend by the Benn Act, which came into effect on Saturday night when MPs failed to pass a deal.\n\nHe ended up sending two letters – the one that he was forced to by the legislation, and another saying he believed a delay would be a mistake. In a pointed reference to that January 31 date, an EU Commission spokesman said after last night's vote: 'The European Commission takes note of tonight's result and expects the UK government to inform us about the next steps.\n\n'Donald Tusk is consulting leaders on the UK's request for an extension until January 31, 2020.' Last night Mr Tusk said he would recommend to the EU's 27 remaining leaders that they approve the UK's request for an extension – under a 'written procedure'.\n\nA 'written procedure' means EU leaders – who have to agree a delay unanimously – will make their choice remotely and not at a summit next week.\n\nThe European Parliament's Brexit negotiator, Guy Verhofstadt, reacted to the vote last night by suggesting an extension would be granted, but also having a dig at Brexit Party leader Nigel Farage.\n\nHe tweeted: 'You're all thinking: another extension. I am thinking: another three weeks listening to Farage.'\n\nAccording to EU sources, any extension will likely involve the option of an early cut-off point.\n\nOne EU source said: 'I think any extension can be a flextension.' This could throw a lifeline to Mr Johnson because it would allow him to claim that the UK can still leave the EU only a few days or weeks after the October 31 deadline, which he pledged the UK would leave by 'do or die'.\n\nThe flextension would allow Britain to leave in November, December or early January – however long it takes the deal to be passed by MPs, sources confirmed.\n\nHowever, the bloc is still waiting to hear what Mr Johnson plans to do next. Last night Mr Tusk continued to call round EU leaders to ask their feelings on an extension.\n\nImmediately after the vote Irish premier Leo Varadkar tweeted: 'It's welcome that the House of Commons voted by a clear majority in favour of legislation needed to enact the Withdrawal Agreement.\n\n'We will now await further developments from London and Brussels about next steps.'\n\nDonald Tusk's tweet suggests that he will recommend accepting the proposed delay set out by the UK in a letter submitted to the bloc at the weekend which asked for Brexit to be pushed back to January 31, 2020 (pictured: in Strasbourg on Tuesday)\n\nDonald Tusk tweeted this evening that he would recommend to European leaders to grant the UK a Brexit delay in order to avopid a No Deal split\n\nMPs have thrown the fate of Britain's ability to leave with a deal into the hands of EU leaders, who could refuse to grant an extension. Countries such as France have suggested they could veto another delay.\n\nYesterday, before the Commons votes, French foreign minister Jean-Yves Le Drian said he saw 'no justification at this stage' for an additional delay.\n\nHowever, member state diplomats say an extension will almost certainly be granted because they do not want to be blamed for No Deal, which could cripple Ireland.\n\nSpeaking in the European Parliament in Strasbourg yesterday, Mr Tusk told MEPs he would respond to the UK's request for a third delay beyond October 31 'in the coming days', but that a No Deal will 'never be our decision' – effectively confirming another extension.\n\nFollowing a three-hour debate in which the majority of MEPs said they believed Britain should be granted an extension, Mr Tusk added: 'Through this you show common sense and the sense of dignity. After what I have heard in this chamber, I have no doubt that we should treat the British request for extension in all seriousness.'\n\nThe advantage of a flextension would be that it would allow for a 'technical' extension of just a few days or weeks if Mr Johnson decides to continue with getting the legislation through Parliament.\n\nYesterday EU Commission chief Jean-Claude Juncker said he regretted the amount of time devoted to Brexit during his five-year presidency.\n\nHe said: 'It's been a waste of time and a waste of energy.'", "description": "German foreign minister Heiko Maas joined French president Emmanuel Macron in suggesting any further Brexit extension did not have to stretch into the new year.", "authors": ["David Wilcock", "Whitehall Correspondent For Mailonline", "David Churchill Brussels Correspondent For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/12/20078758-0-image-a-20_1571829035256.jpg", "published_at": "2019-10-23"}