{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7622273/Former-Boston-College-student-charged-involuntary-manslaughter-boyfriend-suicide.html", "downloaded_at": "2019-10-28 23:43:12.555186+00:00", "title": "Former Boston College student charged with involuntary manslaughter in boyfriend suicide", "language": "en", "text": "A former Boston College student has been charged with involuntary manslaughter for allegedly driving her depressed and suicidal boyfriend to jump to his death from a parking garage, 90 minutes before he was set to receive his diploma.\n\nSuffolk District Attorney Rachael Rollins held a press conference on Monday to announce the indictment of 21-year-old Inyoung You in connection to the death of Alexander Urtula, 22.\n\nThe couple, who had been dating for around 18 months, were both students at Boston College at the time Urtula's death on May 20. You later dropped out of the university.\n\nYou is currently in South Korea. Rollins said she is cautiously optimistic the woman would voluntarily return to Massachusetts to face the charge against her. If she fails to do so, prosecutors will seek to have her extradited back to the US.\n\nScroll down for video\n\nAlexander Urtula, 22 (left), a senior at Boston College, took his own life on graduation day in May 20. Now, his girlfriend, Inyoung You, 21 (right) has been indicted in his death\n\nUrtula, a biology major, jumped to his death from a parking garage 90 minutes before the commencement ceremony\n\nDuring the news conference, Rollins said that Urtula's family, who are from New Jersey, were in town to see him walk in the commencement ceremony at Boston College, where he had been a biology major.\n\nHis LinkedIn profile indicates that Urtula worked as a research assistant at Brigham and Women’s Hospital in Boston since 2017.\n\nAccording to an article in the Boston College student newspaper The Heights, Urtula graduated with a bachelor's degree in biology in December 2018, but he was planning to take part in the festivities on May 20.\n\nSuffolk District Attorney Rachael Rollins said prosecutors are prepared to have You extradited from South Korea, where she is currently staying, if she refuses to return to Massachusetts voluntarily\n\nInstead of accepting his diploma in front of his parents and friends, Urtula headed to the Renaissance parking garage in Roxbury at 8.35am and leaped to his death.\n\nRollins said his girlfriend, You, had been tracking his movements through his cellphone that morning and was on the roof of the garage at the time of his suicide.\n\n'What appeared to be a self-inflicted, horrific tragedy ended up being much more than that,' said MBTA Transit Police Superintendent Richard Sullivan, who responded to the scene in Roxbury that morning.\n\nA search of Urtula's phone later revealed that You was 'physically, verbally and psychologically abusive' during their relationship, according to the district attorney.\n\nRollins said the abuse became 'more powerful and more demeaning' in the days and hours leading up to Urtula's death.\n\nShe also said that the victim's friends and family witnessed the way You had been treating him, and that the abuse was well-documented in tens of thousands of text messages and Urtula's journal entries.\n\nAccording to Rollins, investigators found that Urtula and You had exchanged some 75,000 texts during the two months before the boyfriend's death, of which 47,000 had been sent by the girlfriend.\n\nIn many of the missives, according to the DA, You made demands and threats of self-harm as a way to manipulate her boyfriend.\n\nIndictment against You alleges that she knew of Urtula's depression and 'overwhelmed his will to live'\n\nIn hundreds, if not thousands, of messages, You told Urtula to kill himself, Rollins told reporters.\n\n'She had complete and total control, both mentally and emotionally,' said Rollins, adding that You was aware of Urtula's spiraling depression and suicidal thoughts caused by her abusive conduct, yet she persisted in encouraging him to take his own life.\n\nThe indictment alleges You's behavior was 'wanton and reckless,' and that she overwhelmed her boyfriend's will to live.\n\n'We have a barrage and a complete and utter attack on this man’s very will and consciousness and psyche by an individual,' Rollins said.\n\nYou's indictment comes two years after Michelle Carter (pictured) was convicted of involuntary manslaughter in the death of her 18-year-old boyfriend\n\nIf convicted, You could face up to 20 years in prison.\n\nYou's indictment comes two years after Michelle Carter, also from Massachusetts, was convicted of involuntary manslaughter in the death of her 18-year-old boyfriend Conrad Roy III, in July 2014.\n\nDuring Carter's bench trial, a judge found her guilty of causing Roy's death by encouraging him to get back in his truck filled with carbon monoxide after the troubled teen's resolve to commit suicide wavered.\n\nCarter, then aged 17, was on the phone with Roy and listened as he inhaled the toxic fumes.\n\nCarter, 22, is currently serving a 15-month jail term. Her request for parole was rejected last month.", "description": "Inyoung You, 21, has been indicted in absentia for the May 20 death of her boyfriend of 18 months, Alexander Urtula, 22, who jumped to his death from a parking garage 90 minutes before his graduation.", "authors": ["Snejana Farberov For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/16/20287948-0-image-a-54_1572280665899.jpg", "published_at": "2019-10-28"}