{"pub": "businessinsider", "url": "https://businessinsider.com/mcdreamy-scented-candle-inspired-by-greys-anatomy-for-sale-etsy-2019-9", "downloaded_at": "2019-09-18 12:50:39.218876+00:00", "title": "You can now buy a 'McDreamy' scented candle inspired by 'Grey's Anatomy'", "language": "en", "text": "We love scented candles. They have the power to change the vibe of a room in an instant. Buttercream. Salted caramel. Fresh-cut roses. Cottage breeze.\n\nAnd now, there's a new candle that will fill your home with the scent of a fresh Seattle breeze and your favorite gone-but-never-forgotten TV doctor.\n\nThe \"McDreamy\" candle, named for the fictional neurosurgeon on \"Grey's Anatomy,\" can be yours for $20. The label even has an image of the beloved Dr. Derek Shepherd in his scrubs, showing off his life-saving smile.\n\nThe candle, sold by iheartpopcandles on Etsy, is rated an average of 5 out of 5 stars by the more than 100 people who purchased it. Clicking \"add to cart\" now!\n\nWhat a great gift idea for fans of the show.\n\nReviewers say the candle smells amazing. The description on the Etsy page says the scent is a mix of \"sea and salt.\"\n\nThe candle's label gives us an even better idea of the aroma: \"Smells like a fresh Seattle breeze off the ferry boat on a beautiful day to save lives.\"\n\nYum. Take us into McDreamy's arms with this candle!\n\nCustomers who take it one step further and buy a full gift box will get even more \"Grey's Anatomy\" items, including pencils with popular lines from the show. \"Dance it out,\" one of the pencils advises. Another reads, \"You're my person.\"\n\nThe kit also includes a box of matches emblazoned with the words, \"It's a match.\" So cute!\n\nPatrick Dempsey played McDreamy for 11 seasons of \"Grey's Anatomy,\" which will soon launch into Season 16 on ABC. The season premiere will air at 8 p.m. EST on September 26.\n\nRead more: THEN AND NOW: The original cast of 'Grey's Anatomy'\n\n\"Grey's\" showrunner Shonda Rhimes told \"E!\" in an interview in 2015 that Dempsey's exit from the show was difficult. They planned the character's death in such a way that the strong feelings of love he held for the show's main character, Dr. Meredith Grey, would remain \"frozen in time.\"\n\nLet your own memories of McDreamy linger in your home with these brilliant candles.\n\nAnd if you're a true die-hard fan of \"Grey's,\" you may want to nab a Meredith Grey candle as well. That's right — you didn't think McDreamy would be the only Grey Sloan Memorial doctor to get his own candle, did you?\n\nAccording to the description, Meredith's candle \"smells like a dark and twisty, Harper Avery winning, chief of general surgery, who was married on a post-it-note. \"\n\nThe seller also adds, \"Lemon and Clove Scented Candle for this survivor who ALWAYS makes Lemonade out of lemons.\"\n\nLike the McDreamy option, the Meredith candle sells for $20 for just the candle by itself and $34.95 for the gift box upgrade, which includes the pencils and match.\n\nWill you be buying one of these \"Grey's Anatomy\"-themed candles?\n\nRead more:\n\n26 surprising facts you didn't know about 'Grey's Anatomy'\n\n22 shows to watch if you're already caught up on 'Grey's Anatomy'\n\nEllen Pompeo said she almost quit 'Grey's Anatomy' after learning Patrick Dempsey was paid double what she was", "description": "\"Smells like a fresh Seattle breeze off the ferry boat on a beautiful day to save lives,\" the description says.", "authors": ["Mandy Gambrell"], "top_image": "https://amp.businessinsider.com/images/5d82107bf4fc24242b082217-1920-960.jpg", "published_at": "2019-09-18"}