{"pub": "foxnews", "url": "https://foxnews.com/entertainment/homicide-hunter-joe-kenda-final-season", "downloaded_at": "2019-09-12 11:33:28.119373+00:00", "title": "‘Homicide Hunter’ star Lt. Joe Kenda reveals the one case that haunts him the most", "language": "en", "text": "For Joe Kenda, the case is finally closed.\n\nOn Aug. 21, “Homicide Hunter: Lt. Joe Kenda” began its ninth and final season on Investigation Discovery (ID).\n\n‘DEADLY WOMEN’ HOST CANDICE DELONG SAYS FEW ARE ‘BORN EVIL,’ BELIEVES THERE ARE MORE UNDISCOVERED FEMALE KILLERS\n\nThe true-crime series, which originally launched in 2011, features the 73-year-old reflecting on his many shocking cases from his 23 years with the Colorado Springs Police Department. The veteran lawman is revered for having a 92 percent solve rate on the more 350 murder cases he’s investigated.\n\nThe no-nonsense veteran lawman told Fox News he’s eager to move on.\n\n“I am more than ready to say goodbye because it was my idea,” explained Kenda. “I ended this program and I informed Discovery that I would be stopping after season nine. The reason was rather simple. I had run out of cases, I ran out of bullets. What I have remaining are either too simple or too disgusting. Children, babies — I won’t do those. The network won’t do those either. So [I don’t] have enough reasonable… presentable stories to tell on television. So it’s better to go out at the top of your game than to be the athlete who played one season too long.”\n\nKenda spent 21 years catching killers in the violent crimes unit and 19 of them were served as a homicide detective. During his tenure, Kenda and his team solved 356 of his 387 homicide cases, one of the highest closure rates in the country. However, Kenda admitted it wasn’t always easy to relive chilling memories of brutal slayings that still haunt him in front of cameras. Still, he said the experience was therapeutic over the years.\n\nRELATIVES OF SHARON TATE, JAY SEBRING SPEAK OUT ON HORRIFYING MANSON MURDERS 50 YEARS LATER\n\n“It allows me to release some of the emotions I’ve felt and discuss things,” he said. “It becomes therapeutic for me for that reason. I’ve said more to that camera than I’ve ever said to my wife. It makes me feel better having done so, to talk about it. It doesn’t go away, but it makes you feel better.”\n\nThe Post-Gazette previously reported Kenda joined the local police department in Colorado Springs, Colo., in 1973 and retired after more than two decades as a detective in 1996. He revealed that out of all the cases he’s worked on and featured on the show, there’s one horrific story that still shakes him to his core.\n\n“There’s one particular case that haunts me the most because it reminded me of the fragility of life in my own children,” he said. “Very long story short, I saw a child murdered by his own father. Shot twice in the head, age five in bed clutching a stuffed animal. The bed was a downward angle so the kid bled out. He’s in a river of blood and he’s wearing Mickey Mouse pajamas. My son had those pajamas. Now at the time I saw that child, my son was 19 years old, but at that moment that was my son laying in that bed.”\n\nAs for the cases he couldn’t solve, Kenda said there’s still hope.\n\nRON GOLDMAN’S SISTER SPEAKS OUT 25 YEARS AFTER HIS HORRIFYING MURDER IN ‘CONFRONTING O.J. SIMPSON’ PODCAST\n\n“Three of them already have,” said Kenda. “Out of 31, I’m down to 28. I didn’t resolve those three but they’ve been resolved through advances in DNA technology… Cold cases are effective to work for a number of reasons. People lose their fear of a suspect, they fall out of love with a suspect, they are overcome by guilt because they have knowledge of this crime and have never told anyone. All sorts of things can happen.”\n\nKenda said that out of all the killers he’s encountered, it was the sociopath who’s undoubtedly the most dangerous. According to Kenda, the only emotion they’re capable of is rage. And while sociopaths are rare, they do exist.\n\n“When you encounter one, you have to put him in a cage,” said Kenda. “Because he kills [and] likes it.”\n\n“I met a guy, the first guy I ever encountered who killed multiple victims, was devoid of all emotion — just devoid,” continued Kenda. “He is under arrest for three counts of murder in another jurisdiction. I have him brought to my location because I want to talk to him about my killing. Now you would think he’d be pretty distressed having come into another police department about another murder. He’s sitting in an interview room in handcuffs and belly chains and County Jail coveralls and he’s asleep on his forearm because he’s bored.”\n\nNANCY GRACE RECALLS FIANCÉ KEITH GRIFFIN’S HORRIFIC MURDER, RETURNING TO TV WITH ‘INJUSTICE’: ‘I WAS LOST’\n\nAnd in all his years catching bad guys, Kenda said there are three key motives that would drive someone to kill.\n\n“When people get involved in violence, they have a reason,” he said. “It might be a completely insane reason but it's a reason. And they fall into three general headline categories — money first, sex next, and revenge last. There are many, many subheadings under each of those headlines.\n\n“Money for nonpayment, money for believed debt on and on and on. It goes on and on. Sex, the triangle, the sexual assault candidate who likes to kill his victims, huge list there. Revenge, over what? Over lost love, lost money, lost property, something. People have that reason. Five percent of murders are committed by people who just like to kill people and those are the serial killers, there're very few of those. The rest all fall into those general headline categories.”\n\nWhile “Homicide Hunter” may be coming to an end, don’t expect Kenda to sit back and enjoy retirement. He said there’s a new series in development slated for the fall of 2020. But if there’s one thing Kenda hopes longtime fans of the series, as well as curious viewers, will get from the final season it's the secret behind his success in delivering closure to grieving families.\n\nDEADLY LOVE TRIANGLE INVOLVING TEXAS OILMAN, 71, AND HEIRESS, 35, EXPLORED IN SHOCKING TRUE CRIME DOC\n\n“Determination,” said Kenda. “That’s all you need. You need an undying sense of curiosity. How did this happen? Somebody made this happen. You have to turn that show in the night into somebody with a first, middle and last [name]. It’s great fun. Very frustrating, but great fun.”\n\n\"Homicide Hunter\" airs Wednesdays at 9 p.m. on ID.", "description": "For Joe Kenda, the case is finally closed.", "authors": ["Stephanie Nolasco"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/08/29/694940094001_6079335390001_6079327211001-vs.jpg", "published_at": "2019-08-29"}