{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7632071/Some-strains-HPV-help-prevent-skin-cancer-study-suggests.html", "downloaded_at": "2019-10-30 23:30:08.621746+00:00", "title": "Some strains of HPV may help prevent skin cancer, study suggests", "language": "en", "text": "Some strains of the HPV virus may inadvertently help to protect us against skin cancer, according to surprising new research.\n\nThe much-maligned family of viruses also causes STIs and cancers of the cervix, head and neck and more.\n\nSome scientists have wondered if HPV could cause skin cancer, too - but the new Massachusetts General Hospital research suggests exactly the opposite.\n\nThe scientists found that the presence of these viruses living on some people's skin actually activates the immune system in such a way that indirectly helps to protect against skin cancer, too.\n\nWhen harmless HPV colonizes skin cancer in its early stages (pictured), the immune system thinks the combination is a wart and sends T-cells to fight it, but in fact ends up inadvertently helping to fight scquamouscell carcinoma (red)\n\nOver 100 strains of HPV - short for human papillomavirus - exist and can affect humans.\n\nNearly everyone who is sexually active will contract one or more strains of the virus at some point over the course of their lives.\n\nIn the US, some 79 million American have the virus, and about 14 million people are expected to contract it each year.\n\nIn most symptomatic cases, it causes genital warts which can be removed or treated, but may recur.\n\nHPV was once considered nearly inevitable collateral damage to sexual activity, rarely tested for unless someone had warts and was thought fairly innocuous.\n\nBut in the 1950s and 1960s, scientists began to notice links between HPV and cervical cancer.\n\nBy the 1980s, a German scientists who studied viruses had proven the link between three strains of HPV and cervical cancer. He was awarded a Nobel Prize for his work.\n\nSince then, scientists have discovered that about 12 strains out of 100 or so cause cervical cancer and, as of more recent discoveries, likely cause head, neck, vulva, penis, anus and throat cancers.\n\nNow, the HPV vaccine, Gardasil, protects against four strains of HPV, including HPV-16 and -18, which together cause about 70 percent of all cervical cancers.\n\nOn the heels of the latest discovery, and in a biological irony, people may soon be given other strains of the virus itself as a vaccine against other cancers.\n\nUnsurprisingly, people with suppressed immune systems from are more vulnerable to viral infections - like HPV - as well as skin cancer, so scientists thought that perhaps there was a link between the two, but have been unable to find one.\n\nWhile dangerous sexually transmitted forms of the virus hide out in the genitals, many low-risk varieties can camp out harmlessly on the human skin.\n\nUsing 'experimental models,' samples of human skin cancer and mice, the Massachusetts General team found that when harmless HPV was present, it activated the immune system.\n\nThe immune system recognized the virus - even though it wasn't causing any negative effects - and sent T cells to defend against it.\n\nBy happenstance those T cells also have anti-cancer effects, protecting against the common disease, squamous cell carcinoma.\n\n'This is the first evidence that these commmensal' - or symbiotic - 'viruses could have beneficial health effects both in experimental models and also in humans, and it turns out that this beneficial effect has to do with cancer protection,' said study co-author Dr Shawn Dmehri.\n\n'The role of these commensal viruses, in this case papillomaviruses, is to induce immunity that then is protecting patients from skin cancers.'\n\nFrom that finding tested how mice with the virus on heir skin developed skin cancer at different rates from their counterparts without.\n\nTheir findings suggested that the virus could be used to boost T cell activity and thereby help prevent skin cancer.", "description": "Massachusetts General Hospital researchers found that innoccuous HPV that lives on the skin activates T-cells which in turn fight DNA mutations that can lead to skin cancer, suggesting a viral vaccine.", "authors": ["Natalie Rahhal Deputy Health Editor For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/19/20392998-0-image-a-4_1572464889057.jpg", "published_at": "2019-10-30"}