{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nfl/2019/10/21/4th-monday-cowboys-snap-out-skid-statement-win/4048196002", "downloaded_at": "2019-10-21 15:04:00.687381+00:00", "title": "Cowboys snap out of skid with statement win; Aaron Rodgers vaults into MVP race", "language": "en", "text": "CLOSE\n\nA week after being on the wrong end of the biggest upset of the season so far, the Dallas Cowboys administered an embarrassment to a division rival on national television.\n\nThe Cowboys snapped a three-game losing streak by throttling the Philadelphia Eagles. The win pushes Dallas atop the NFC East.\n\nDallas' three-game losing streak, however, still keeps them behind the other division leaders in the NFC — the San Francisco 49ers (6-0), New Orleans Saints (6-1) and Green Bay Packers (6-1) — all of whom won Sunday.\n\nOn Monday night, the New England Patriots will look to keep the NFL's roster of unbeatens at two. Standing in the way will be the New York Jets.\n\nEzekiel Elliott signals first down after a run against the Eagles. (Photo: Matthew Emmons, USA TODAY Sports)\n\nQuick hits: Catch up on Sunday's best\n\n- PHOTOS: Best of Week 7 | Cheerleaders | NFL at 100\n\nInside the action\n\nKirk Cousins has thrown for 10 touchdowns in the Vikings' three-game winning streak. (Photo: Raj Mehta, USA TODAY Sports)\n\nWeek 7 rundown\n\nEyes on the (fantasy) prize\n\nTakeaways from a fantasy perspective for Week 7:\n\nWith David Johnson active, but only in an emergency sense, the Arizona Cardinals gave second-year RB Chase Edmonds a full workload. He responded with the week’s top fantasy performance at the position — 150 total yards and three touchdowns. If Edmonds is still available in your fantasy league, he’ll be this week’s top waiver pickup.\n\nactive, but only in an emergency sense, the Arizona Cardinals gave second-year RB a full workload. He responded with the week’s top fantasy performance at the position — 150 total yards and three touchdowns. If Edmonds is still available in your fantasy league, he’ll be this week’s top waiver pickup. The surprise performance of the week goes to Colts WR Zach Pascal , who had six catches for 106 yards and a pair of touchdowns. He hasn’t been very consistent, but the upside for Pascal is worth a small wager from your free agent budget.\n\n, who had six catches for 106 yards and a pair of touchdowns. He hasn’t been very consistent, but the upside for Pascal is worth a small wager from your free agent budget. The Bengals had a pass-heavy approach vs. the Jaguars — giving wideout Alex Erickson nearly as many targets (14) as he previously had all season (15). He caught eight of them for 137 yards and also had a pair of rushing attempts. Erickson may only be a one-week fix with A.J. Green hoping to return after the Bengals’ Week 9 bye.\n\nnearly as many targets (14) as he previously had all season (15). He caught eight of them for 137 yards and also had a pair of rushing attempts. Erickson may only be a one-week fix with hoping to return after the Bengals’ Week 9 bye. While the Lions’ Marvin Jones (4 TDs) was lighting up the scoreboard, teammate Danny Amendola quietly saw 11 targets, catching eight for 105 yards. Even the No. 3 wide receiver in Detroit can be fantasy-relevant.\n\n(4 TDs) was lighting up the scoreboard, teammate quietly saw 11 targets, catching eight for 105 yards. Even the No. 3 wide receiver in Detroit can be fantasy-relevant. Adam Thielen injured his hamstring making a touchdown catch and the Vikings have a quick turnaround this week to play on Thursday. If Thielen isn’t 100%, backup wideout Bisi Johnson could be a short-term fix. He caught four of his eight targets against the Lions for 40 yards and scored a touchdown.\n\n- Fantasy football: Valuable advice to help your team dominate\n\nChase Edmonds will be a popular waiver-wire pickup this week. (Photo: Noah K. Murray, USA TODAY Sports)\n\nComing this week\n\nMonday:Week 7 wraps up with an AFC East rivalry game between the New England Patriots and New York Jets at MetLife Stadium (8:15 p.m. ET, ESPN). While the Jets are coming off their first win of the season, the Patriots are looking to go to 7-0 for the third time since 2007.\n\nTuesday: USA TODAY Sports' NFL experts offer their power rankings for all 32 NFL teams after Week 7.\n\nThursday: The Minnesota Vikings look to keep pace with the division-leading Green Bay Packers when they host the Washington Redskins (8:25 p.m. ET, FOX and NFL Network). Before the game, make sure to check out USA TODAY Sports for expert picks for every Week 8 game.\n\nNFL Facebook group: Join now!\n\nIf you're into football, we have the perfect spot for you. Join our Facebook Group, The Ruling Off the Field, to engage in friendly debate and conversation with football enthusiasts and our NFL insiders.\n\nThe Ruling Off the Field - USA TODAY Sports NFL Facebook group logo (Photo: USA TODAY)\n\nWant to keep this NFL conversation going? Head to Facebook, and/or give a Twitter follow to your friendly neighborhood football guy who put together this newsletter, @jimreineking.", "description": "The Cowboys throttled the Eagles, Aaron Rodgers vaults into the MVP race and there were 32 things we learned from the Week 7 action. Let's dive in ...", "authors": ["Usa Today", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/21/USAT/dd709a32-8e40-4a4f-a3f6-ddbdf6090de4-USATSI_13547577.jpg?crop=1994,1122,x1130,y171&width=3200&height=1680&fit=bounds", "published_at": "2019-10-21"}