{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/10/charles-barkley-applauds-nbas-china-stance-rips-ja", "downloaded_at": "2019-10-10 18:23:06.844998+00:00", "title": "Charles Barkley applauds NBA's China stance, rips 'jackasses,' 'idiots' for criticism", "language": "en", "text": "Sportscaster Charles Barkley says the NBA should ignore “jackasses” and “idiots” who are criticizing its decision to mute criticism of China’s human rights record.\n\nThe NBA Hall of Famer’s defense of the league came during a Thursday appearance on the “Dan Patrick Show.”\n\n“They have billions of dollars at stake,” he said. “It’s a business decision. I understand the NBA. The players and the owners both got billions of dollars at stake.”\n\nAt issue is Houston Rockets general manager Daryl Morey’s recent “Fight for Freedom” tweet regarding protests in Hong Kong, which prompted an apology from the league.\n\nPlayers and coaches who have been open about their political activism for years have refused to comment on the matter.\n\n“You know, I think it’s really funny,” Mr. Barkley said. “All these idiots and jackasses and fools on radio and television telling these players to [speak up]. There are the same people who’ve been hating on [former NFL player] Colin Kaepernick [and his national anthem protests] for the last three years. … You all want to control what happens in a foreign country? Give me a break.”\n\nThe NBA released a statement on Monday saying Mr. Morey’s commentary on Hong Kong “does not represent the Rockets or the NBA.”\n\n“We have great respect for the history and culture of China and hope that sports and the NBA can be used as a unifying force to bridge cultural divides and bring people together,” NBA Chief Communications Officer Mike Bass said.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Sportscaster Charles Barkley says the NBA should ignore \"jackasses\" and \"idiots\" who are criticizing its decision to mute criticism of China's human rights record.", "authors": ["The Washington Times Http", "Douglas"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2017/02/24/barkley_swears_33082_c0-305-3963-2615_s1770x1032.jpg?0201ce0ff426d033a71894ad5d4a6d55d803a07a", "published_at": "2019-10-10"}