{"pub": "yahoo", "url": "https://sports.yahoo.com/eliud-kipchoge-is-first-marathon-runner-to-break-twohour-barrier-130043213.html", "downloaded_at": "2019-10-12 17:49:29.712655+00:00", "title": "Eliud Kipchoge is first marathon runner to break two-hour barrier", "language": "en", "text": "Kenya’s Eliud Kipchoge became the first marathon runner to break the two-hour barrier, running 26.2 miles in 1 hour, 59 minutes, 40.2 seconds early on Saturday morning in Vienna, Austria.\n\nThe event, the INEOS 1:59 Challenge, was specifically designed for Kipchoge’s record-breaking feat. The course was designed to maximize speed and Kipchoge had the help of 41 pacesetters.\n\nKenya's Eliud Kipchoge, the marathon world record holder, crosses the finish line during his attempt to run a marathon in under two hours in Vienna, Austria, October 12, 2019. (REUTERS/Leonhard Foeger)\n\nScroll to continue with content Ad\n\nEliud Kipchoge has just ran a full marathon (26.2 miles) in under 2 hours... 🐐🐐\n\n\n\nThat's an average of 100m every 17 seconds, 422 times in a row... 😲😲 pic.twitter.com/fDSSA1t5sb — SPORTbible (@sportbible) October 12, 2019\n\nPeople gathered in Kipchoge’s hometown of Eldoret, Kenya to watch him break the record, and they went crazy in the streets.\n\nLook at that 😍\n\n\n\nHow Eldoret, Kenya celebrated their countryman - Eliud Kipchoge - becoming the first ever to run a marathon in under two hours 🔥\n\n\n\n(📹: @OlympicsKe) pic.twitter.com/c3IXVylm5X — ESPN India (@ESPNIndia) October 12, 2019\n\n‘No one is limited’\n\n“This shows no one is limited,” Kipchoge said to the BBC. “Now I've done it, I am expecting more people to do it after me.”\n\nKipchoge added that it was the best moment of his life, with a lot of pressure on his shoulders. He received a call from Kenyan president Uhuru Kenyatta afterwards.\n\nStory continues\n\n“Hearty congratulations, Eliud Kipchoge,” Kenyatta said in a statement. “You've done it, you've made history and made Kenya proud. Your win today will inspire future generations to dream big and aspire to greatness. We celebrate you and wish you God's blessings.”\n\nNot an official record for Eliud Kipchoge\n\nThe feat, though, won’t count as an official world record by the International Association of Athletics Federations (IAAF) because of the conditions and the help of pacesetters. This event, though, seemed to exist more for the purpose of breaking the two-hour mark than setting the world record — which Kipchoge already holds, by the way. The 34-year-old ran the Berlin Marathon in 2:01:39 last year and then ran it in 2:02:37 in April, the two fastest official marathon runs in history.\n\nKipchoge and his team had a goal to run the marathon in 1:59:50. They shattered that by 10 seconds. It was Kipchoge’s second attempt at the two-hour barrier; he had unsuccessfully tried to break it in Monza, Italy in 2017.\n\nThe two-hour mark, considered the “last great barrier” in running after Roger Bannister ran a mile in under four minutes in 1954, requires a 4:34 mile pace or better. Kipchoge came in at 4:33.5 minutes per mile. Kipchoge compared the feat to going to the moon.\n\n“I am feeling good. After Roger Bannister it took another 65 years to make history,” he said. “Now I’ve gone under two hours to inspire other people and show the world nobody is limited.”\n\nMore from Yahoo Sports:", "description": "“This shows no one is limited,\" Kipchoge said.", "authors": ["Eric He"], "top_image": "https://s.yimg.com/ny/api/res/1.2/OJEt6LVue1i8sMF1RKeVzg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MTkuMg--/https://s.yimg.com/uu/api/res/1.2/X6xjZPYJHm6exoE8hpKjEg--~B/aD0xNzUyO3c9MjczNztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/73818ad0-eceb-11e9-996b-b3ecd6a9e64c", "published_at": "2019-10-12"}