{"pub": "cryptocoin", "url": "https://cryptocoin.news/cryptocurrency/smart-contracts-who-will-suceed-eos-or-ethereum-17548", "downloaded_at": "2019-10-05 13:17:20.286083+00:00", "title": "Smart Contracts, Who Will Succeed, EOS, Ethereum Or Something Else?", "language": "en", "text": "EOS and Ethereum are kissing cousins. Both revolve around the idea of smart contracts, and both aim to be operating systems, of a kind, for decentralized applications.\n\nAs such, both EOS and Ethereum occupy the same spot in the cryptocurrency food chain. Is it possible for both coins to survive, or will a clear winner emerge over time? We’re going to do a short compare/contrast of these competing platform coins to give you a better view of the struggle for supremacy now underway.\n\nEthereum\n\nEthereum has tenure and name recognition in its corner, above all. Ethereum is number two in the cryptocurrency world, second only to Bitcoin, and is popular with developers and laypeople alike.\n\nHowever, Ethereum’s drawbacks are significant. It uses a proof-of-work consensus model, restricting mining to those with enough cash to buy application specific integrated circuits (ASICs) – and lots of them, consuming gobs of electricity. Transaction costs are relatively high, scalability is relatively low, and very few transactions on the Ethereum network are actually made by decentralized applications. In fact, less than 10 percent of the transactions on the ostensibly application-driven Ethereum network are actually performed by applications – the remainder is payments and initial coin offering traffic.\n\nEOS\n\nEOS may be a relative newcomer to the cryptocurrency scene, but it’s got the benefit of hindsight over its older, bigger, richer cousin.\n\nThe EOS team boasts scalability of up to 6,000 transactions per second. In designing the EOS network, the developers built with commercial decentralized applications in mind, so scalability was one of the very first hurdles they attempted to jump.\n\nEOS is also fee-less. There is no such thing as a free lunch, however, so EOS pays for the cost of maintaining its network via a 5 percent yearly inflation rate. Every year, the project pays 1 percent of the yearly inflation back to block producers, and EOS holders “pay” for their network usage by holding coins with a steadily increasing total supply. This ultimately means that decentralized applications need to hold a given number of EOS tokens to ensure their stability because the brunt of costs is born by the applications themselves instead of the end user.\n\nWho will win?\n\nPicking winners and losers in the cryptocurrency sphere is very often a futile exercise. After all, the entire cryptocurrency sphere itself is a bit of an underdog, competing against the highly centralized giants of Silicon Valley and Wall Street, combined. Nor are EOS and Ethereum the only players in the platform game – even Tron has thrown its hat into the ring.\n\nWith all that said, Ethereum is already out in front of the pack, but it also has the biggest target on its back. Blockchains that can innovate faster and harder than Ethereum have a great chance of poaching decentralized application developers, and it really only takes one blockbuster dApp to put EOS – or another platform – over the top.", "description": "", "authors": ["Julia Beyers", "Acquiring A Wealth Of Experience In Writing Articles On Trends", "Prospects For The Development Of The Game Industry In The World I I'Ve Found Myself As A Freelance Journalist. I Am Writing Now About Blockchain", "Cryptocurrencies Trends", "Sometimes Covering Importance Of Bitcoin For Various Other Industries."], "top_image": "https://cryptocoin.news/wp-content/uploads/2018/07/maxresdefault-95.jpg", "published_at": "2018-07-19"}