{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7561287/NASA-launches-satellite-explore-air-meets-space.html", "downloaded_at": "2019-10-11 05:58:41.303743+00:00", "title": "NASA launches satellite to explore where air meets space", "language": "en", "text": "NASA launched a satellite on Thursday night to explore the mysterious, dynamic region where air meets space.\n\nThe satellite - called Icon, short for Ionospheric Connection Explorer - rocketed into orbit following a two-year delay. It was dropped from a plane flying over the Atlantic off the Florida coast.\n\nFive seconds after the satellite's release, the attached Pegasus rocket ignited, sending Icon on its way.\n\nThe ionosphere is the charged part of the upper atmosphere extending several hundred miles up.\n\nThe Pegasus rocket which carries the Icon satellite is seen before it is dropped from an airplane flying over the Atlantic Ocean off the Florida coast on Thursday\n\nThe image above the Pegasus XL rocket being released from an aircraft before it jets off into the outer reaches of the atmosphere on Thursday\n\nThe rocket was dropped from a Northrop Grumman L-1011 Stargazer aircraft (like the one seen in the above stock image)\n\nIt's in constant flux as space weather bombards it from above and Earth weather from below, sometimes disrupting radio communications.\n\n'This protected layer, it's the top of our atmosphere. It's our frontier with space,' said NASA's heliophysics division director, Nicola Fox.\n\nFox said there's too much going on in this region to be caused by just the sun.\n\nHurricanes, tornadoes and other extreme weather conditions on Earth are also adding energy, she noted.\n\nNASA's ICON satellite (pictured above) will collect data about space weather from the Earth's upper atmosphere.\n\nThe ICON satellite (pictured above) was originally planned for launch in 2017 but was delayed due to mechanical problems.\n\nThe more scientists know, the better spacecraft and astronauts can be protected in orbit through improved forecasting.\n\nThe refrigerator-size Icon satellite will study the airglow formed from gases in the ionosphere and also measure the charged environment right around the 360-mile-high spacecraft.\n\nWHAT IS ‘SPACE WEATHER?’ Space weather described a number of different phenomena that occur as a result of charged particles sent out into space from the surface of the sun. Some examples include the polar lights, coronal mass ejections, and geomagnetic storms. A number of space weather events occur when charged particles from the sun enter the upper most region’s of the Earth’s atmosphere.\n\n'It's a remarkable physics laboratory,' said principal scientist Thomas Immel of the University of California, Berkeley, which is overseeing the two-year mission.\n\nHe added: 'Icon goes where the action is.'\n\nA NASA satellite launched last year, Gold, is also studying the upper atmosphere, but from much higher up.\n\nMore missions are planned in coming years to study the ionosphere, including from the International Space Station.\n\nIcon should have soared in 2017, but problems with Northrop Grumman's air-launched Pegasus rocket interfered.\n\nDespite the long delay, NASA said the $252million mission did not exceed its price cap. Northrop Grumman also built the satellite.\n\nDuring a news conference earlier this week, NASA launch director Omar Baez apologized for the delay.\n\n'We wanted to get things right on this rocket,' Baez said.\n\n'We have no second chances on these type of missions.'\n\nHe called the launch 'an awesome and great one; this one's been a long time in coming.'\n\nBaez said in the end, everything went well. 'This is about as good as it gets,' he said.", "description": "The satellite Icon, short for Ionospheric Connection Explorer, rocketed into orbit following a two-year delay. It was dropped from a plane flying over the Atlantic off the Florida coast on Thursday.", "authors": ["Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/06/19573262-0-image-a-28_1570771755560.jpg", "published_at": "2019-10-11"}