{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201909/26/WS5d8c689ea310cf3e3556da76.html", "downloaded_at": "2019-10-05 13:49:20.942095+00:00", "title": "Over 100 overseas firms to attend Light of the Internet Expo", "language": "en", "text": "By Ma Zhenhuan in Hangzhou | chinadaily.com.cn | Updated: 2019-09-26 15:28\n\n[Photo/IC]\n\nMore than 100 overseas internet enterprises will attend the Light of the Internet Expo to showcase their latest products and achievements at the sixth World Internet Conference in Wuzhen, Zhejiang province, said the event's organizer on Wednesday.\n\nThe expo, to be held Oct 18-22, \"will focus on enhancing the visitors' and users' experiences by introducing technologies and products that integrate 5G, AI and VR with people's daily lives,\" said Wu Junqing, deputy head of the Department of Economy and Information Technology of Zhejiang.\n\nOver 600 internet and innovative enterprises from home and abroad have so far registered to display their 5G, AI, cloud-computing, big data and cybersecurity products and technologies at this year's expo.\n\nOrganizers will also host sideline events such as a job fair and internet project matchmaking events to boost collaboration and industrialization in the industry.\n\nVR and sports-tech businesses will also launch augmented reality booths to allow visitors have a firsthand experience of smart living.\n\nMore than 1,500 guests will attend the sixth World Internet Conference on Oct 20-22 in Wuzhen, the nation's top internet affairs regulator said earlier this month.\n\nAmong them will be internet experts, scholars, government officials, international organizations and entrepreneurs.\n\nThe theme of this year's conference is Intelligent Interconnection for Openness and Cooperation: Building a Community with a Shared Future in Cyberspace.", "description": "More than 100 internet overseas enterprises will attend the Light of the Internet Expo to showcase their latest products and achievements at the sixth World Internet Conference in Wuzhen, Zhejiang province, said the event's organizer on Wednesday.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201909/26/5d8c689ea310cf3e979e2b60.jpeg", "published_at": "2019-09-26"}