{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7590193/Prue-Leith-79-reveals-daughter-Li-Da-adopted-child.html", "downloaded_at": "2019-10-19 12:13:28.893992+00:00", "title": "Prue Leith, 79, reveals daughter Li-Da has adopted her own child", "language": "en", "text": "Great British Bake Off judge Prue Leith has revealed that her adopted daughter Li-Da Kruger has herself adopted a baby boy.\n\nThe Great British Bake Off judge, 79, who adopted Li-Da from a Cambodian orphanage when she was just 16-months-old, said her daughter adopted the child seven months ago.\n\nPrue said Li-Da made the move because she felt her own adoption had been 'so successful', prompting the famous cook to feel 'proud'.\n\nFamily: Great British Bake Off judge Prue Leith has revealed that her adopted daughter Li-Da Kruger has herself adopted a baby boy (pictured in 2018)\n\nShe told the Mirror: 'Li-Da has enhanced our life in so many ways.\n\n'Now she has adopted a child because she felt her own adoption was so successful and that's just another way she makes me feel proud.'\n\nThe little boy is now the same age as Li-Da was the first time Prue saw her and decided to adopt her.\n\nOpening up about the decision, the Bake Off judge said she found Li-Da after the then little girl's parents were victims of Cambodia's killing fields, in which more than a million people were killed by the Khmer Rouge regime between 1975 and 1979.\n\nMoving: Prue, who adopted Li-Da from a Cambodian orphanage when she was 16-months-old, said her daughter adopted the child seven months ago (pictured in 2017)\n\nPrue already had one-year-old son Daniel with her late husband Rayne, who tragically passed away in 2002, when she decided she wanted another child.\n\nThe food critic married Rayne after first knowing him as the husband of her mother's best friend.\n\nPrue said that, when she revealed how 'desperate' she was for another child, Rayne suggested the couple adopt.\n\nA good experience: The chef, 79, said Li-Da made the move because she felt her own adoption had been 'so successful', prompting Prue to feel 'proud' (pictured in 2015)\n\nLi-Da was six-months-old when she was rescued by an American pilot from the city of Phnom Penh, just three days before it was taken over by the Khmer Rouge.\n\nHer mother had died in a rocket attack while her father, a soldier, had vanished, orphanage staff said.\n\nPrue said before she met the little girl she was 'tormented' by the prospect that she would not love her as much as her son.\n\nTraumatic: The Bake Off judge said she found Li-Da after the then little girl's parents were victims of Cambodia's killing fields (pictured in August)\n\n'But as soon as I met her, those thoughts vanished,' the 79-year-old sweetly said.\n\nPrue married her second husband John Playfair in 2016 after Rayne died in 2002.\n\nShe added that Li-Da had enriched her life 'amazingly' and that her adopted daughter was 'kind and generous' with 'an instinct to do good'.\n\nLi-Da's own journey through the adoption process was a bumpier one than her mother's, she revealed.\n\nFamily: Prue already had one-year-old son Daniel with late husband Rayne, when she decided she wanted another child (Prue pictured with Li-Da, left, and Daniel, right, in 2010)\n\nAfter being diagnosed with breast cancer, the new mother endured IVF and a miscarriage with her husband Matt, leaving her emotionally shaken.\n\nOverall, the adoption process took four years, and the couple said they felt 'immediate' love for their son when they met him.\n\nIt comes after Prue admitted she is a stone overweight thanks to her work on Bake Off, as well as being wheelchair-bound after an accident.\n\nTough job: It comes after Prue admitted she is a stone overweight thanks to her work on Bake Off, as well as being wheelchair-bound after an accident (pictured on the show with co-judge Paul Hollywood)\n\nThe cook injured herself while filming this year’s series, snapping her Achilles tendon.\n\nSpeaking at the Henley Literary Festival, Miss Leith said that while she hopes to lose the weight, she doesn’t want to ‘fret’ about calories.\n\n‘I’m a stone overweight at the moment, and actually I’ve been a stone overweight all my life’, she said.\n\n‘However, I’m particularly a stone overweight at the moment because I’ve spent the last ten weeks in a wheelchair, so no exercise and it didn’t stop me eating cake and doing the job. I’ve been eating cake a lot. But I hope I’ll start to lose it now.’\n\nThe star said she gets ‘upset’ that so many young people are ‘obsessed with diets and magic potions’.", "description": "Prue said Li-Da made the move because she felt her own adoption had been 'so successful', prompting the famous cook to feel 'proud'.", "authors": ["Harry Howard For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/09/19914134-0-image-a-2_1571472469625.jpg", "published_at": "2019-10-19"}