{"pub": "guardian", "url": "https://theguardian.com/uk-news/2019/oct/29/amelia-bambridge-three-questioned-as-cambodia-search-for-uk-backpacker-widens", "downloaded_at": "2019-10-29 07:46:15.988438+00:00", "title": "Amelia Bambridge: three questioned as Cambodia search for UK backpacker widens", "language": "en", "text": "Men are thought to be locals but no arrests made, as sniffer dogs and extra boats brought in\n\nCambodian officials looking for Amelia Bambridge, the British woman missing on Koh Rong island since Thursday, are focusing their search on fishing boats and have interviewed three men about her disappearance.\n\nBambridge, 21, from Sussex, was last seen at around 3am on Thursday at a beach party. Nearly 150 Cambodian officials plus seven volunteers have been searching the island and surrounding areas since Saturday.\n\nThree men, believed to be Cambodians, were placed in handcuffs by police on the island on Monday and taken for questioning.\n\nFather of UK woman missing in Cambodia says he is losing hope Read more\n\nVolunteer search party organisers said it was common for local police to handcuff people without arresting them. A Koh Rong official working with police told the Guardian that there had been no arrests related to the search.\n\nOfficers told Ben Warner, who is leading the volunteer search team, that the three men had not been linked to the party Bambridge was believed to have gone missing from. CCTV showed that she arrived at the event at around 2am, but she was not filmed leaving.\n\nThe Guardian understands that at least one of the three men worked at a hostel on Koh Rong. On Monday Harry Bambridge, Amelia’s brother, was accompanied by police as he searched the man’s possessions in the hostel.\n\nHarry has complained about a lack of support from the British government regarding the search but said he the family met with police in the HQ in Sihanoukville this morning, writing on social media: “Everyone’s [Cambodian officials] said that they’re not going to stop until she’s found, so I feel a little bit more positive.”\n\nOn Monday, Amelia’s father, Phil, had said he was losing hope she would be found alive.\n\nSniffer dogs from Phnom Penh are expected to arrive on Koh Rong on Tuesday to help with the search, and extra boats are being dispatched from Sihanoukville for the ocean search.\n\nFacebook Twitter Pinterest Sihanoukville provincial governor Kuoch Chamroeun (C) looks at a map of Koh Rong where Amelia Bambridge went missing. Photograph: Sihanoukville Province Authority Police/AP\n\nOfficials and volunteers have placed added focus on checking fishing boats that may have recently been near Police Beach, where Bambridge went missing. Her backpack, containing items including her bank cards and phone, was found on rocks by the beach on Thursday morning.\n\nWarner said: “We’re running out of areas where we can look on land, so we’re trying to look at ways that she could have got off the island.”\n\nLaura Link, volunteer search team co-leader, appealed for anyone with photos showing boats around Police Beach to contact her.\n\nA police spokesperson said: “At this point it’s still an all-area search. They’re searching under the rocks in the ocean and on top of the ocean, but now they want to get in the jungle. All departments are here today: police, navy, military.”\n\nRyan Harris, 18, from Worcester, travelled to Koh Rong with Amelia Bambridge on 19 October after befriending her in Phnom Penh. He spent Monday with her family on the island, and appealed to anyone with information to contact him.\n\n“We’re appealing for information from anyone who was at the party then [Wednesday night] or in the last few months, anyone who might have seen anything sketchy or suspicious,” Harris said.\n\n“The family are doing well considering the circumstances. They just want to know what happened, same as everyone else.”", "description": "Men are thought to be locals but no arrests made, as sniffer dogs and extra boats brought in", "authors": ["Jamie Fullerton"], "top_image": "https://i.guim.co.uk/img/media/073b8b9892498cda1d1596202b45af81fa97d10a/0_197_1091_655/master/1091.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3df48eaba4adde9a091787de0e6d158a", "published_at": "2019-10-29"}