{"pub": "reuters", "url": "https://reuters.com/article/us-turkey-economy-forecasts/turkey-sees-ambitious-return-to-5-growth-next-year-idUSKBN1WF140", "downloaded_at": "2019-09-30 11:32:48.665833+00:00", "title": "Turkey sees ambitious return to 5% growth next year", "language": "en", "text": "ANKARA (Reuters) - Turkey raised its economic growth forecast on Monday to an ambitious 5% for next year, and lowered its inflation outlook to 8.5%, as the government sketched out a relatively quick rebound from recession that manages not to stretch the budget.\n\nA presentation by Treasury and Finance Minister Berat Albayrak showed the major emerging market economy was expected to grow by 0.5% in 2019 and 5% in 2020, compared to last year’s forecast of 2.3% growth for this year and 3.5% for next.\n\n“We have achieved a soft landing,” said Albayrak, adding that leading indicators pointed to a recovery in the current third quarter, following three straight quarters of year-on-year contraction after last year’s currency crisis.\n\nThe gross domestic product (GDP) growth forecast for 2021 was unchanged at 5%, with 2022 also seen at that level, which would return Turkey’s economy to its average growth rate in recent years in which it was driven by cheap credit and a construction boom.\n\nBut analysts said the government’s forecast for a modest rise in the current account deficit - to 1.2% and 0.8% in 2020 and 2021, respectively - raised questions about its ambitious GDP goals.\n\nThe growth and deficit numbers “don’t seem consistent (or) coherent” without for example an unexpected drop in the price of oil, which Turkey imports, said Timothy Ash of BlueBay Asset Management.\n\nLast year’s crisis chopped nearly 30% off the value of the lira and sent Turkish inflation soaring above 25%, leaving construction and other companies with large foreign currency loans deeply in debt.\n\nAs a result, the central bank aggressively hiked rates as the economy tipped into recession and unemployment shot higher.\n\nInflation has since dipped to 15%, and the bank has slashed rates 750 basis points in the last two months to encourage a recovery in domestic demand, with analysts expecting a bit more monetary easing before year end.\n\n(Turkey sees 5% growth next year: here)\n\nINFLATION HEADED LOWER\n\nAlbayrak said the “coordination” between monetary and fiscal policies would continue, adding the government strongly supports the central bank’s fight against inflation.\n\nTurkey also trimmed its 2019 and 2020 inflation forecasts to 12.0% and 8.5% respectively, from last year’s predictions of 15.9% and 9.8% respectively. The 2021 forecast was unchanged at 6.0%, according to Ankara’s annual medium-term programme.\n\nInflation is expected to fall briefly to single digits in October before rising toward year-end.\n\nThat, along with a shift to more accommodation among the world’s major central banks, has stemmed further losses in the lira this year and opened the door to a faster recovery in the Middle East’s largest economy.\n\nA Reuters poll last month pointed to zero growth in 2019.\n\nThe International Monetary Fund last week predicted Turkey would log slight growth this year, but said a 1.5% rate over the next couple of years “would help stabilize the debt burden around the current, commendably low, levels.”\n\nAlbayrak, who is Turkish President Tayyip Erdogan’s son-in-law, said the budget will be used to finance what he called a production-based transformation of the economy.\n\nBut analysts and investors have been frustrated by what they see as a lack of progress with reforms that would make Turkey’s economy less reliant on foreign capital.\n\n“Turkey can grow at 5% if government pushes stimulus,” said Jason Tuvey, senior emerging markets economist at Capital Economics.\n\n“The concern is the government pushing more stimulus to achieve 5% is just a recipe of fresh imbalances in economy.”", "description": "Turkey raised its economic growth forecast on Monday to an ambitious 5% for next year, and lowered its inflation outlook to 8.5%, as the government sketched out a relatively quick rebound from recession that manages not to stretch the budget.", "authors": ["Nevzat Devranoglu", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-30"}