{"pub": "guardian", "url": "https://theguardian.com/film/2019/oct/25/harvey-weinstein-women-confront-producer-new-york-actors-hour", "downloaded_at": "2019-10-25 16:18:18.681560+00:00", "title": "'Freddy Krueger in the room': women confront Harvey Weinstein at New York event", "language": "en", "text": "Several women heckled after raising questions about producer’s attendance at talent show\n\n'Freddy Krueger in the room': women confront Harvey Weinstein at New York event\n\nSeveral women were booed, heckled and asked to leave after confronting Harvey Weinstein at a New York showcase for emerging talent.\n\nComedian Kelly Bachman told the Guardian she “felt like the air was sucked out of the room” when she called out Weinstein during a set she performed at the event.\n\nShe embraced the silence, she said. “I was okay with the fact that there was silence. In a situation like this, I don’t want people to feel comfortable.”\n\nBachman, along with fellow comedian Amber Rollo and actor Zoe Stuckless, confronted the disgraced producer, who has been accused by more than 80 women of rape, sexual assault and harassment, at an event called Actors Hour on Wednesday night.\n\n#MeToo two years on: Weinstein allegations 'tip of iceberg', say accusers Read more\n\nWeinstein was in attendance, sitting at a table along with several young women and two body guards.\n\n“I’m a comic, and it’s our job to name the elephant in the room,” she said, in a video posted on her social media accounts. “It’s a Freddy Krueger in the room, if you will. I didn’t realize I needed to bring my own mace and rape whistle to Actors Hour.”\n\nMembers of the audience booed her, and shouted “shut up”, to which Bachman responded, “Sorry, that killed at group therapy for rape survivors”.\n\nAt intermission, Struckless and Rollo approached Weinstein at his table. “Nobody’s going to say anything? Nobody’s really going to say anything?” Struckless screamed, in a video posted on their Facebook page.\n\n“His bodyguards herded me out,” Struckless said in a post. “When I left the building, crying out of fury and frustration I was quickly surrounded by a group of mostly women who expressed the same fear to raise their voice that I had. They thanked me for speaking up.”\n\nPlay Video 0:27 Harvey Weinstein confronted by actor at New York event – video\n\nRollo tweeted that afterward, she “went in and called [Weinstein] a fucking monster and told him he should disappear.”\n\nWeinstein, who posted $1m bail after being arrested on rape charges, has appeared in public only a few times in recent months.\n\nIn a statement to Business Insider, the producer’s publicist Juda Engelmayer said: “Harvey Weinstein was out with friends enjoying the music and trying to find some solace in his life that has been turned upside down. This scene was uncalled for, downright rude and an example of how due process today is being squashed by the public, trying to take it away in the courtroom too.”\n\nWeinstein has denied all accusations of non-consensual sex.\n\nEngelmayer did not immediately respond to The Guardian’s request for comment.\n\nBachman said she had been overwhelmed by support from strangers online and fellow comedians since she confronted Weinstein, though things had “been a little crazy”. A rape survivor herself, Bachman recently produced a show called ‘Rape Jokes: By Survivors’.\n\n“I was really feeling triggered and in a state of flight or fight,” she said of her experience at Actors Hour. “But I felt like I had to say something.”\n\n“We shouldn’t be accepting that this monster can just come attend an industry showcase,” she said. “I wanted to make people feel uncomfortable about it. And I just hope people stay uncomfortable.”", "description": "Several women heckled after raising questions about producer’s attendance at talent show", "authors": ["Maanvi Singh"], "top_image": "https://i.guim.co.uk/img/media/08ebb9e300e2ab3b2e90762be4be6cf1c83d0d9a/0_199_3000_1800/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5f399fe7aade794a74a5db84841cf4d8", "published_at": "2019-10-25"}