{"pub": "atlantic", "url": "https://theatlantic.com/ideas/archive/2019/09/germany-has-no-nazi-memorials/597937", "downloaded_at": "2019-09-14 11:16:19.014683+00:00", "title": "There Are No Nazi Memorials", "language": "en", "text": "The deliberate national penance that most Germans now take for granted offers a striking contrast with the ways Americans have confronted our own national crimes.\n\nMy great-uncle wasn’t a racist, he just fought to defend his home. My grandfather died for the homeland he loved; what’s wrong with that? Sentiments along these lines will sound familiar if you’ve followed the long-simmering debates over the removal of Confederate flags and monuments across the United States—debates that intensified after nine black churchgoers were massacred in Charleston, South Carolina, in 2015. Some of those remarks were made by white supremacists who, plainly enraged by the presence of a black man in the White House, knew exactly why they wanted to keep Confederate flags flying. Others who are less malicious, if perhaps less honest, make such claims with vague references to family tradition.\n\nBut you’ll probably be surprised to learn that descendants of the Nazi armed forces—the Wehrmacht—once made exactly the same claims as the descendants of the Confederate Army, and not just in the dark, shell-shocked days that followed the unconditional surrender outside Berlin in 1945. Remarks exculpating German soldiers continued to be made in public through the end of the 20th century. With 18 million members, the Wehrmacht had included a broader scope of German society than any other organization. Even Germans who did not serve in it had fathers, sons, cousins, or brothers who did. Until the now-famous Wehrmacht Exhibit traveled through Germany from 1995 to 1999, showing photographic evidence of war crimes committed by average troops, many still believed the myth that the Wehrmacht was clean, even gallant. Those brave men who defended their homeland against the Bolshevik menace were no better or worse than millions of soldiers before or after them.\n\nIn American life, the symbolic importance of the Nazis stands in inverse relation to what we know about them. Nazi just means: the black hole at the heart of history, the apex of evil, the sin for which no condemnation is sufficient, no expiation possible. There is, of course, a wealth of scholarship about the Nazi period produced by English-language historians. More problematic is public memory: what every half-educated member of a culture knows in her sinews, for it seeped into them before she can remember. Things like your country’s geography: few Americans must pause to consider whether Michigan is north of Arizona, or Connecticut east of California. If you’ve forgotten everything else from your schooldays, you’re likely to remember that. For most Americans, Nazi is condensed into one genocidal moment that marked the outer limit of Third Reich crimes: the transport of civilians, in cattle cars, to death camps where they were murdered by poison gas. By focusing on that moment, without a glance at what happened before or after it, we lose the opportunity to learn anything useful from the Holocaust whose lessons we are told to remember. We still know too little about how Germany reached the point of committing those crimes. We are also ignorant of how German society slowly and fitfully came to terms with its violent, racist history—a process from which other nations, including the United States, can learn.", "description": "Americans could learn from how drastically German society has moved away from the nadir of its history.", "authors": ["Susan Neiman"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/RTXP6F3/facebook.jpg?1568302044", "published_at": "2019-09-14"}