{"pub": "npr", "url": "https://npr.org/2019/09/19/759840338/public-libraries-may-turn-the-page-for-colorado-citys-news-desert", "downloaded_at": "2019-09-19 09:38:59.224686+00:00", "title": "Public Libraries May Turn The Page For Colorado City's News Desert", "language": "en", "text": "Public Libraries May Turn The Page For Colorado City's News Desert\n\nEnlarge this image toggle caption Rae Ellen Bichell/Mountain West News Bureau Rae Ellen Bichell/Mountain West News Bureau\n\nAfter 25 years of running Ellen's Bed and Breakfast in Longmont, Colo., Ellen Ranson got tired of cooking breakfast.\n\n\"So we decided to change the name to Ellen's Bed, Bath & Begone,\" she says.\n\nThat left her more time for sleeping in or reading the paper. But that prospect wasn't too exciting, because the local paper had been thinning out for a while, though Ranson says it used to be relevant.\n\n\"And now there's news about Frederick or Erie or Fort Collins or something,\" she says. All are cities she lives near, but not Longmont.\n\n\"This is a city of 92,000 people,\" says Ranson, and a lot is going on.\n\nMore than 170 counties across the country have no local newspaper, and half of all counties only have one — according to a recent report from the University of North Carolina School of Media and Journalism. Other studies suggest these growing \"news deserts\" contribute to low voter turnout, increasing partisanship and even makes local government more expensive to taxpayers.\n\nIn Longmont, Ranson wasn't the only one who could feel the news desert closing in. Scott Converse could, too, especially once the local paper announced it was closing its offices and moving to Boulder.\n\n\"All of Longmont's news left Longmont, effectively,\" Converse says.\n\nSo, he and another Longmont resident started their own publication — the Longmont Observer. From the get-go, though, funding was a problem. It's run by a small team of reporters and editors, all of them volunteers. Converse jokes their editor-in-chief is doing really well.\n\n\"She has gotten at least a dozen raises from zero, to two times zero, to four times zero to eight times zero,\" he says. \"We're proof that news is not profitable. We get enough donations to pay our rent and our Internet here and that's it. That's literally it.\"\n\nSearch for a solution\n\nSo lately, Converse has been looking for new ideas for how to fund local journalism. That's when he came across an article titled, \"Journalism is a public service. Why don't we fund it like one?\"\n\nSimon Galperin, founding director of a New Jersey-based nonprofit called the Community Information Cooperative, wrote the piece.\n\n\"People feel it in a visceral way when they don't have the sort of information they need to get about their day,\" Galperin says. We need a way to publicly fund news that's independent from the local government, and he says the way to do this is through a common technique — starting something called a special improvement district. These already exist in communities across the country for a bunch of purposes: parks, sewers, airports, highways.\n\n\"Fire safety, mosquito abatement,\" Galperin adds. \"So, it kind of just made sense to say, 'OK, let's create one for local news and information.'\"\n\nResearch News Local Newspaper Closures Come With Hefty Price Tag For Residents Local Newspaper Closures Come With Hefty Price Tag For Residents Listen · 6:33 6:33\n\n\"The info district idea is an opportunity for people to do this themselves without relying on benevolent billionaires or wealth to come in and prop up a news organization,\" he says. \"This is a way for the public to have a say in how their local news and information needs are met.\"\n\nGalperin, who just published a how-to guide on starting a special district, says funding through a special district might allow a community to spread information in a bunch of different ways, including by hiring journalists — maybe even full newsrooms. Back in Longmont, that idea was a light bulb moment for Scott Converse.\n\n\"I thought, 'That's brilliant. What a great idea,'\" he says.\n\nNews and public libraries: A perfect pairing?\n\nHe learned that there's a type of special district that's actually really common in Colorado. They're for libraries. And what are libraries, he says, if not nonpartisan, nonprofit sources of trusted information chock full of some of the nation's best information ninjas?\n\n\"Librarians are badasses. You do not mess with the librarian,\" he says. Try to ban a book, says Converse, and you'll run into serious trouble.\n\n\"And that's because they believe in the freedom of information,\" Converse says. \"They have more legal protections than just about any other entity on the planet for protecting information.\"\n\nThey're also nonpartisan, nonprofit and community-driven, he adds, \"What better place to put a newsroom?\"\n\nConverse dreams of the library housing not just a staff of local journalists, but also tools for citizen journalists to cover their community, like a makerspace for news.\n\n\"Never shushed anyone in a library in my life, don't plan to start,\" says Longmont Library director Nancy Kerr, as she walks through the lobby on a weekday morning. The library is gently bustling with residents looking through books on display and kids picking up prizes for summer reading.\n\n\"You expect libraries now [to] have at least a low hum of conversation going on. It's not your parents' or grandparents' library,\" she says.\n\nWe really believe in people's rights to read anything and everything.\n\nThe city is doing a feasibility study right now about how to better fund the Longmont library, including the possibility of starting a special district. Kerr says they're asking stakeholders \"a sea of questions\" about the future of the library, and its role in creating local news content is among them.\n\n\"We really believe in people's rights to read anything and everything and support that,\" she says, so she was intrigued to hear the idea Scott Converse had hit on.\n\nLibraries are changing, Kerr said. This library has an old card catalog full of seeds for people to plant in their gardens. Kerr says librarians help people with resumes and job applications all the time. And they just started a library of things, where people can check out everything from ukeleles and telescopes to wifi hotspots.\n\n\"We're always looking at new opportunities to connect people with information.\" she says. \"There have been some arguments out there that libraries are not content creators, but more and more libraries are content creators.\"\n\nIn the most literal sense of content creation, a growing number of libraries host equipment for physically producing new material, like 3-D printers and machinery for self-publishing actual books. In a broader sense, Kerr adds, they're already starting to share more characteristics with news organizations — like the libraries that have podcasting equipment and green screens available, or even the ones with plans to house a public TV channel in the same building.\n\n\"Nothing is an impossibility for libraries,\" Kerr says. \"I can't see immediately that libraries would necessarily be able to do this on their own and be the producer — the creator — of the news. But as far as disseminating news from a library, I don't see that as a strange thing. That's what we do.\"\n\n\"Government-funded news\" and other worries\n\nScott Converse says he's getting some pushback on the idea of a government funded news service. But he's got an answer for that.\n\n\"It's not government-run news. It's news run by the people, for the people and funded by the people,\" he says, just like the BBC in the U.K., CBC in Canada or, at least in part, public radio here.\n\nAnd technically speaking, special districts aren't part of the local government. They're independent entities with their own funding and their own governing board.\n\nStill, there are skeptics, including some who know a lot about special districts. People like Chris Hoene, executive director of California Budget & Policy Center, a nonpartisan policy think tank. He says special districts can be a creative way to solve a problem. For example, what if a neighborhood doesn't have streetlights?\n\n\"Your particular neighborhood doesn't have adequate street lighting and the local government that you might normally think would provide it doesn't have the resources to do that,\" Hoene says. \"So you get your neighbors in the area together and you decide that you're willing to be charged fees, in order to put in place the street lighting that the neighborhood or the community wants.\"\n\nNow, the street is well lit. Problem solved. But, Hoene says, that sort of pay-to-play model doesn't work for every community. Maybe the unlit neighborhood a couple miles away has residents that can't afford additional fees or taxes.\n\n\"And so basically only those communities with the ability to pay end up receiving the service, and that means we end up with a lot more inequity in terms of who is receiving needed infrastructure,\" Hoene says.\n\nHe worries it could perpetuate inequality in a similar way that school districts tend to. But maybe a special district could revegetate the news desert in Longmont.\n\nEllen Ranson, of Bed, Bath and Begone, misses the era when new businesses would get a write-up in the paper. She and her husband learn about local candidates from political parties now, rather than journalists. And there are mysteries going unanswered — like that new building they sometimes drive past.\n\n\"That's a huge building and nobody knows what it is,\" she says.\n\nShe wishes someone — maybe a journalist — would look into it.\n\nThis story was reported through the the Mountain West News Bureau, a collaboration between Wyoming Public Media, Boise State Public Radio in Idaho, KUER in Utah, KUNR in Nevada and KRCC and KUNC in Colorado.", "description": "Scores of counties across the U.S. have no local newspaper, and some that do say they're not being well-served by them. Longmont, Colo., is considering one possible solution: newsrooms in libraries.", "authors": ["Rae Ellen Bichell", "Longmont", "Colo. Library Director Nancy Kerr"], "top_image": "https://media.npr.org/assets/img/2019/09/11/longmont-co-librarian_wide-39e747ef498708ebde7ea383dbeea1b46ff5e267.jpg?s=1400", "published_at": "2019-09-19"}