{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/kanye-wests-conversion-could-be-a-cultural-wrecking-ball", "downloaded_at": "2019-10-29 00:17:40.000238+00:00", "title": "Kanye West, ‘Jesus Is King’: Album Could Be a Cultural Wrecking Ball", "language": "en", "text": "Kanye West at Paris Fashion Week in 2015 (Charles Platiau/Reuters)\n\nHe’s just the figure to bring a needed message that our society should reconsider what it deems praiseworthy.\n\nOn Friday, anyone with a pulse would have seen the news of the release of Kanye West’s newest album, Jesus Is King. It comes after months of news stories about West’s very public conversion to Christianity, a Christianity that bears no resemblance to the vague spiritualism of Moral Therapeutic Deism that is often associated with celebrity conversions.\n\nAdvertisement\n\nAdvertisement\n\nThe lyrics to each song in Jesus Is King are shockingly Christian. It is not an album of feel-good Christian spirituality aimed primarily as a message of uplift. West co-wrote and sang the hit “Jesus Walks” on his debut album The College Dropout (2004), but Jesus Is King is different. Throughout the whole of the new album, West is in many respects deeply critical of modernity and cultural progressivism. There are calls for a focus more on the family than on individual glory. He seems to applaud Chick-fil-A, which in our age is tantamount to endorsing bigotry. Social-media obsession should be exchanged for family prayer. Fatherhood is characterized as a virtue. Materialism is pilloried. Calls for worshiping Christ redound to such effect that West’s first Christian album is arguably more Christian than what most contemporary Christian artists could similarly muster.\n\nBut in the media rollout of West’s album, it’s worth paying attention to other statements he’s made. He’s criticized abortion and believes that the African-American community is getting played by Democrats. He remains defiant in the face of political correctness. A man of evolving identities who has struggled with mental illness in his past, he told Zane Lowe during a two-hour long Beats 1 interview that during the planning of the album, he insisted that those around him fast and abstain from premarital sex. In the interview with Lowe, West has the anthropology of C. S. Lewis, the economics of Wilhelm Röpke, the cultural mood of Wendell Berry, and the defiance of Francis Schaeffer. In Jesus Is King and in interviews, we see a Kanye West upholding what Russell Kirk referred to as the Permanent Things.\n\nAdvertisement\n\nHe’s rejecting the hyper-sexualization of culture that he admitted he helped create. In an ode to the Niebuhrian Christ-and-culture typology, he said he’s now living his life for Christ and ostensibly against culture.\n\nIn a word, Kanye West is now a cultural reactionary by the standards of our society, and could be, in time, a cultural wrecking ball that dislodges so much of the assumed, comfortable, and unchecked cultural liberalism that dominates the most elite sectors of our country and mocks anything resembling traditionalism and social conservatism. In an age of libertarian sentiment, when the currency of American society appear to be glamorization and the notion that consent is the only reasonable moral standard, West is calling for restraint and limits.\n\nAdvertisement\n\nAdvertisement\n\nTo that end, I wish him success. He’s just the figure, given his massive iconic cultural status, to bring a needed message that our society should reconsider what it deems praiseworthy. To that end, his religious conversion could spark a revolution in morals, similar to what the conversion of 19th-century abolitionist William Wilberforce helped foster in England.\n\nIf I were a cultural progressive, West would now be on my enemies list. He’s daring to name the forces that eat away at human happiness, and, given his unpredictable nature, there’s no telling what he will not be willing to confront. He’s a figure with just enough audacity and celebrity to get people to reconsider their lives.\n\nTime will only tell of what will come from his radical conversion to Christianity. But in the wake of this news, I have one message of warning to my fellow Christians about West: There will be a temptation by well-meaning Christians to make him a champion of Christianity. Christians could easily impute their own cultural insecurities onto West, who is the very definition of a cultural icon. Let’s not do that.\n\nAdvertisement\n\nThe Apostle Paul warns in the New Testament about vesting too much hope and confidence in new converts, fearing they would be puffed up with pride (something, let’s be honest, Kanye has no problem exuding). We need to let Kanye be a Christian Kanye without making him into a Christian celebrity.", "description": "Kanye West is just the figure to bring a needed message that our society should reconsider what it deems praiseworthy.", "authors": ["Andrew T. Walker", "Andrew C. Mccarthy", "Matthew Continetti", "Ramesh Ponnuru", "Rich Lowry", "Dan Mclaughlin", "Tobias Hoonhout", "Michael Brendan Dougherty", "Read More", "The American Conservative"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2018/08/kanye-west-paris-fashion-week-2015.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-28"}