{"pub": "dailybeast", "url": "https://thedailybeast.com/rachel-maddow-tells-colbert-senate-gop-may-just-find-its-conscience-and-impeach-trump", "downloaded_at": "2019-10-02 12:47:03.788170+00:00", "published_at": "2019-10-02", "title": "Rachel Maddow Tells Colbert Senate GOP May Just Find Its ‘Conscience’ and Impeach Trump", "language": "en", "text": "After MSNBC’s Rachel Maddow used crutches to hobble on stage for her interview with Stephen Colbert on Tuesday night’s Late Show, the host asked her, “What gives? Did Hannity try to kneecap you?”\n\nIn response, Maddow joked that “you oughta see the other guy” before revealing the real answer: “I just fell down, that’s all it is. I’m an old person now and when you fall down you break three ligaments and an avulsion fracture.”\n\nOf course, before they could get to Blowout, her latest book about the oil and gas industry, Colbert had to ask his guest for her take on the Trump impeachment story. As “America’s premiere explainer,” he wanted to know if she was “at all frustrated that the present scandal is so damn simple.”\n\n“You can’t even sleuth your way through it,” Maddow said. “Because in order to find out that Trump called Ukraine, what we had to do was ask Trump, ‘Did you call Ukraine?’ And he said, ‘Yes, here’s the evidence.’” She added, “In terms of ‘whodunit,’ he did it and he admits it and now he’s going to be impeached for it.”\n\nIf Maddow is correct, Trump would be the fourth president to be impeached by the House, but as she also noted, no president has been removed from office by the Senate.\n\n“I think part of what is important now and what I’m enthused about in terms of people being so into it, is we really know nothing about what’s going to happen once he gets impeached,” she said. “I do think he’s going to be impeached, but what is the result of that politically? What does it do to the two parties? What does it do for the next election? We have no idea.”\n\nDespite the fact that Senate Majority Leader Mitch McConnell “has been perfectly willing to say, ‘Senate? What Senate?’ whenever there is something he doesn’t want them to engage with”—like Merrick Garland’s nomination to the Supreme Court—Maddow was oddly hopeful that this could all end with Trump being removed from office.\n\n“I do think that this behavior by the president is so simple and it’s so indefensible—you can’t go to another country and ask them for help against your likely opponent in the next election, you just can’t,” Maddow said, “it may be that Republicans decide, either to save their own skins or because of their conscience or their patriotism, that they want to be on the right side of history on this.”\n\n“And I don't think they’re deciding now,” she added. “I think they’ll decide as it plays out.”", "description": "The MSNBC host was oddly hopeful about Republicans in the Senate wanting to be “on the right side of history.”", "authors": ["Matt Wilstein", "Senior Writer"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_154/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1569991802/115849_0214_fxd6s2"}