{"pub": "cbc", "url": "https://cbc.ca/parents/food/view/your-new-favourite-chicken-finger-recipe", "downloaded_at": "2019-09-29 23:31:32.400740+00:00", "title": "Your New Favourite Chicken Finger Recipe", "language": "en", "text": "Chicken fingers, strips or nuggets — battered and baked fried chunks of chicken — are perhaps the quintessential kid food. But the truth is, I love them just as much as a grownup!\n\nYou'll Also Love: 5 Half-Homemade Meals That Are A Cinch To Make\n\nHere are two formulas to try — one rolled in crumbs and baked or cooked in a hot skillet, the other shallow-fried in a pot with about an inch of oil.\n\nBaked or Pan-fried Chicken Fingers, Strips or Nuggets\n\nThis is a fantastically versatile recipe, beyond the chicken — you can rummage through the cupboards for some form of crunchy crumb to coat it with. If you can find Panko — extra crunchy Japanese crumbs that create a wonderful crust — perfect! Otherwise bashed crackers, dry breadcrumbs or even cereal will do. If you don’t want to turn on the oven, cook them in a skillet with a generous drizzle of oil. To dip, pick up some bottled plum sauce, or mix honey and yellow mustard in equal amounts.\n\n3 skinless, boneless chicken breast halves or 4 – 6 thighs, cut into strips or chunks\n\n1 large egg or 1/2 cup buttermilk\n\n1 – 2 cups Panko (Japanese breadcrumbs), corn flake crumbs, dry breadcrumbs or finely crushed crackers\n\n1/4 cup grated Parmesan cheese\n\nsalt and pepper to taste\n\noil, for cooking (optional)\n\nPreheat oven to 375˚F, if you want to bake your strips.\n\nIf you’re using an egg, break it into a shallow dish and beat it a little with a fork. If you’re using buttermilk, pour it over the chicken and refrigerate for an hour. Combine crumbs, any additions you like, and salt and pepper in another shallow dish.\n\nDip chicken strips into egg (or remove from the buttermilk) and roll in crumbs to coat well. Place about an inch apart on a parchment-lined baking sheet. Bake for 15-20 minutes, until golden and cooked through. Alternatively, cook them in a drizzle of oil in a large, heavy skillet set over medium-high heat. Serves 4-6.\n\nFried Chicken Fingers, Strips or Nuggets\n\n3 skinless, boneless chicken breasts\n\n1/2-1 cup buttermilk or thin plain yogurt\n\n4 tsp paprika, divided\n\n1 tsp fresh or dried thyme (optional)\n\nsalt and pepper\n\n1 cup all-purpose flour\n\n1/2 cup cornstarch\n\nSlice the chicken into strips and place in a ziplock bag with the buttermilk or yogurt, 2 tsp of the paprika, thyme, and a generous amount of salt and pepper (it won’t all make it into the chicken). Refrigerate for an hour, or overnight.\n\nWhen you’re ready to make your chicken fingers, put the flour and cornstarch into a shallow dish or pie plate with the remaining 2 tsp paprika and some salt and pepper and stir it together well. Get out a baking sheet and if you have one, place a wire rack on top of it.\n\nPull each strip of chicken out of the marinade and douse in the flour mixture to coat; place on the pan or wire rack. Once they’re all done and have dried out a bit, dip them again into both the leftover buttermilk marinade and again in the flour mixture, pressing on any moist bits — this will add crunch. Heat about an inch of canola oil in a shallow pot until it’s hot, but not smoking — a scrap of bread should sizzle when dipped in. Gently lower a few strips at a time into the oil and cook for 4-5 minutes, turning with tongs, until golden and cooked through. Transfer to a paper towel-lined plate and sprinkle with a little salt. Serve warm. Serves 4-6.", "description": "Does your family love chicken fingers or nuggets? Here are two formulas to try — one rolled in crumbs and baked or cooked in a hot skillet, the other shallow-fried in a pot with about an inch of oil.", "authors": [], "top_image": "https://www.cbc.ca/parents/content/imgs/_8col/chicken-fingers-LEAD.jpg", "published_at": "2018-08-01"}