{"pub": "breitbart", "url": "https://breitbart.com/border/2019/10/11/mexican-cartel-gunmen-attack-tourist-city-mayors-home", "downloaded_at": "2019-10-12 00:22:11.673753+00:00", "title": "Mexican Cartel Gunmen Attack Tourist City Mayor’s Home", "language": "en", "text": "A team of cartel gunmen attacked the home of the mayor for the tourist port city of Guaymas, Sonora. The Thursday night incident occurred at approximately 7:00pm and resulted in no injuries.\n\nThe home of Sara Valle Dessens was attacked by cartel gunmen who sprayed her residence with more than 100 rounds Thursday, local reports note. According to representatives of the state attorney general’s office, the team arrived in a Jeep Patriot. Witnesses say the shooters then fled in the same vehicle.\n\nAuthorities were not able to locate the shooters.\n\nGuaymas is approximately 240 miles south of the Mexican border with Arizona and features the popular tourist destinations San Carlos Bay and Empalme. The area is experiencing a wave of cartel violence, which has resulted in at least 11 officers killed since October 2018.\n\nAt least 20 police officers have been murdered statewide in 2019. Most recently, Francisco Carlos Lechuga Bastidas, a Sonora state police officer, was wounded in late September along with a second officer. Lechuga Bastidas died last week in a local hospital from gunshot wounds.\n\nDue to the ongoing cartel violence in the once peaceful state, the federal government deployed a total of 1,800 Mexican National Guard personnel to quell the turf wars.\n\nRobert Arce is a retired Phoenix Police detective with extensive experience working Mexican organized crime and street gangs. Arce completed work assignments in the Balkans, Iraq, Haiti, and recently completed a three-year tour in Monterrey, Mexico, for the U.S. Department of State, International Narcotics and Law Enforcement Program. As the Regional Program Manager for Northeast Mexico in charge of the Mexican states of Coahuila, Tamaulipas, Nuevo Leon, Durango, San Luis Potosi, Zacatecas) You can follow him on Twitter or reach him at robertrarce@gmail.com.", "description": "A team of cartel gunmen attacked the home of the mayor for the tourist port city of Guaymas, Sonora.", "authors": ["Robert Arce"], "top_image": "https://media.breitbart.com/media/2018/08/Guaymas-Sonora.jpg", "published_at": "2019-10-11"}