{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/09/six-deals-you-need-to-know-about-in-australia-today-213", "downloaded_at": "2019-09-17 00:56:10.474919+00:00", "title": "Six Deals You Need To Know About In Australia Today", "language": "en", "text": "Image: eBay\n\nG'day! Here are some cracking online deals for Lifehacker readers, including: $100 off Nintendo Switch Lite, 61% off Portable Pizza Ovens, three free months of Optus home wireless, 90% off Borderlands OC game bundles and more!\n\n1. Cheap Optus home wireless: Optus is running a pretty sweet deal on home wireless broadband right now. For a limited time, you can score three months for free when you sign up to a 500GB plan on a 24-month contract. The plan costs $85 per month, so that's a saving of $255.\n\nHere are the inclusions for the fixed modem plan (click on the table below to learn more):\n\nOr you can go with a portable modem instead (ditto):\n\n2. Catch 80% off Spring Cleaning sale: You knew it was only a matter of time before Catch starting flogging 'spring cleaning' deals, and here they are. For a limited time, you can get 50-80% off select products ranging from electronica to sporting goods. Click here!\n\n3. 61% off Portable Pizza Ovens: eBay is selling the gas-powered EuroGrille Portable Pizza Oven for $229, which is a massive $370 off the RRP. If you love pizza, take the plunge and buy one! Then invite me around for some perfectly baked pie. (Hold the pineapple, natch.) Click here!\n\n4. Nintendo Switch Lite for $229: eBay is selling the Nintendo Switch Lite in yellow, grey or turquoise for just $229 – a saving of $100! There's a catch though. You need to be an eBay Plus member - which thankfully has a free trial - and quantities will be released in batches between 12pm and 5pm. (On the plus side, at least you get a few chances each time it sells out.) Click here!\n\n5. Nintendo Switch Lite for $288: If the above sounds like too much trouble, Amazon Australia has it for $288 with a Prime Membership. Yes you need to be a Prime member, but there's none of the hourly goose-chase malarkey. Click here!\n\n6. 90% off Borderlands Handsome Collection: With Borderlands 3 currently storming up the game-sale charts, now is as good a time as any to get into the originals. Fanatical is selling the Handsome Collection on PC - which contains all available downloadable content for Borderlands 2 and Borderlands: The Pre-Sequel - for just $8.77. (RRP: $89.95.) Click here!\n\nFind more great bargains at Lifehacker Coupons.\n\nAs Lifehacker editors we write about stuff we like and think you'll like too. Lifehacker often has affiliate partnerships, so we may get a share of the revenue from your purchase.", "description": "G'day! Here are some cracking online deals for Lifehacker readers, including: $100 off Nintendo Switch Lite, 61% off Portable Pizza Ovens, three free months of Optus home wireless, 90% off Borderlands OC game bundles and more!...", "authors": ["Spandas Lui", "Chris Jager"], "top_image": "https://edge.alluremedia.com.au/m/l/2019/09/s-l1600.jpg", "published_at": "2019-09-17"}