{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7575759/Casey-Batchelor-cradles-blossoming-baby-bump-blue-striped-bikini-Dubai-getaway.html", "downloaded_at": "2019-10-15 16:35:16.949297+00:00", "title": "Casey Batchelor cradles her blossoming baby bump in a blue striped bikini during Dubai getaway", "language": "en", "text": "She is eagerly expecting a baby girl with her fiancé Dane Goodson.\n\nAnd Casey Batchelor showed off her burgeoning baby bump in a blue striped bikini as she enjoyed a sun-soaked break in Dubai on Tuesday.\n\nCradling her bump, the television personality, 34, couldn't help but smile as she strolled along in the crystal blue ocean.\n\nDelighted: Casey Batchelor smiled as she cradled her blossoming baby bump in a blue striped bikini during Dubai getaway on Tuesday\n\nCasey's pregnancy curves and ample cleavage were on full display in the halterneck bikini which featured a navy-inspired pattern and tie-side bottoms.\n\nShe wore her raven locks in glamorous curls and accentuated her maternity glow with a bronzed make-up look.\n\nThe beauty kept her look natural by brusing on a light palette of make-up, and also protected her eyes with a pair of stylish thick-rimmed shades.\n\nBumping along nicely: Casey's pregnancy curves and ample cleavage were on full display in the halterneck bikini which featured a navy-inspired pattern and tie-side bottoms\n\nThe glamour model and her partner are already proud parents to daughter Florence, 16 months, and have said it will be 'nice' for her girls to be close in age.\n\nCasey recently told The Sun: 'It's a girl. Yeah, I'm having another girl which is so lovely because I never had a sister, I had two older brothers and they always had each other. So it will be nice for Florence to have a little sister.'\n\nThe news the couple are expecting a girl came as a surprise to Casey who had been convinced by friends and family that she would have a boy.\n\nDoting mother: On Friday, Casey celebrated reaching 25 weeks into her pregnancy by sharing a snap in the blue swimwear\n\nThe glamour model admitted she and Dane will continue trying for a son once their little girl has been born in early 2020.\n\nShe said: 'I was adamant I was having a boy, everyone convinced me. [They said] 'You’re carrying differently, and you’re all at the front, with a girl it’s at the back.'\n\n'Dane's so happy that he’s having a little girl, but he would like a little boy obviously. If we had a boy this time, we would have the choice if we wanted to go again, but because we’re having a girl we’ll definitely try again.'\n\nStunning: Casey wore her raven locks in glamorous curls and accentuated her maternity glow with a bronzed make-up look\n\nCasey announced the couple were expecting their second child in Closer magazine, saying: 'I'm going to have two babies 20 months apart… I can' t quite believe it!\n\n'It’ll be tough, but I’m going to ride the storm – we’re just so thrilled we’re having another baby!\n\n'Dane and I wanted more children – we’re both turning 35 and we got engaged in January, so we didn’t want to wait much longer, as time is ticking on. We decided to start trying, and I got pregnant straight away. I do feel very lucky.'", "description": "The television personality, 34, showed off her burgeoning baby bump in a blue striped bikini as she enjoyed a sun-soaked break in Dubai on Tuesday.", "authors": ["Roxy Simons For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/16/19745918-0-image-a-73_1571152874265.jpg", "published_at": "2019-10-15"}