{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/16/the-latest-england-drops-ford-moves-farrell-to-10-", "downloaded_at": "2019-10-17 05:17:22.188490+00:00", "title": "The Latest: Ireland draft in Herring to replace Cronin", "language": "en", "text": "TOKYO (AP) - The Latest on Thursday at the Rugby World Cup in Japan (all times local):\n\n12:45 p.m.\n\nIreland has announced it won’t appeal the three-man ban for Bundee Aki and will draft Rob Herring into the 31-man squad to replace injured hooker Sean Cronin for the remainder of the Rugby World Cup.\n\nIreland faces the defending champion New Zealand All Blacks in the quarterfinals on Saturday.\n\n“Unfortunately for Sean Cronin a pre-existing neck muscle complaint flared up this week and although he is expected to recover fully in a couple of weeks the time-frame means he is ruled out of the tournament.,” Irish rugby said. Cronin went on as a replacement in Ireland’s upset loss to Japan and in the win over Russia.\n\nAki was banned for three weeks after being red-carded for a high tackle in Ireland’s win over Samoa last weekend. His bid to have the red card was overturned by a judicial committee on Monday, but he has remained with the squad as a training partner.\n\n“The Ireland management will not appeal the sanction handed down to Bundee,” the team said in a statement. “We are disappointed with the outcome and believe that Bundee’s time will be best served helping prepare the squad for its remaining fixtures.”\n\n____\n\n11:35 a.m.\n\nJack Goodhue and Anton Lienert-Brown will combine in midfield in the most vexed selection in the All Blacks starting lineup which will play Ireland Saturday in a Rugby World Cup quarterfinal.\n\nNew Zealand had four strong options for two midfield positions, choosing Goodhue after only 11 tests and Lienert-Brown who has been among its best players at the tournament. Sonny Bill Williams is on the bench to add off-loading ability late in the game and veteran Ryan Crotty has been omitted.\n\nRichie Mo’unga starts at flyhalf and Beauden Barrett is at fullback as head coach Steve Hansen continues with his tandem playmaker strategy.\n\nNew Zealand has gambled on the fitness of lock Brodie Retallick, who has played one match in three months after a shoulder injury.\n\nFullback Ben Smith has been displaced from the reserves bench by utility Jordie Barrett, meaning all three Barrett brothers are in the match 23.\n\nLineup Beauden Barrett, Sevu Reece, Jack Goodhue, Anton Lienert-Brown, George Bridge, Richie Mo’unga, Aaron Smith; Kieran Read (captain), Sam Cane, Ardie Savea, Sam Whitelock, Brodie Retallick, Nepo Laulala, Codie Taylor, Joe Moody. Reserves: Dane Coles, Ofa Tuungafasi, Angus Ta’avao, Scott Barrett, Matt Todd, TJ Perenara, Sonny Bill Williams, Jordie Barrett.\n\n____\n\n11:15 a.m.\n\nOwen Farrell has moved to flyhalf to replace George Ford and Henry Slade has been drafted into a new midfield combination with Manu Tuilangi in changes to England’s starting XV to play Australia in the Rugby World Cup quarterfinals at Oita.\n\nJonny May has been picked on the left wing and will make his 50th appearance. No. 8 Billy Vunipola has recovered from injury and will form a backrow with Tom Curry and Sam Underhill.\n\nEngland coach Eddie Jones said the lineup was picked with Australia in mind.\n\n“Once you get to the quarterfinals it’s about having the right mindset. We know how well we can play, it’s about us playing to our strengths and trying to take away from what Australia want,” he said. Tuilagi’s shift from outside to inside center will bolster the defense.\n\n“We need to defend with brutality and when we have the ball we need play on top of them.”\n\nLineup: Elliot Daly, Anthony Watson, Henry Slade, Manu Tuilagi, Jonny May, Owen Farrell (captain), Ben Youngs; Billy Vunipola, Sam Underhill, Tom Curry, Courtney Lawes, Maro Itoje, Kyle Sinckler, Jamie George, Mako Vunipola. Reserves: Luke Cowan-Dickie, Joe Marler, Dan Cole, George Kruis, Lewis Ludlam, Willi Heinz, George Ford, Jonathan Joseph.\n\n____\n\n11:00 a.m.\n\nAnd then there were eight. The Rugby World Cup gets down the quarterfinals on the weekend, and four of those teams are expected to name their 23-man squads on Thursday.\n\nOne of the most anticipated matches is the first on Saturday when England plays Australia at Oita, about 800 kilometers (500 miles) west of Tokyo. Australia has lost its last six matches to England.\n\nNew Zealand plays Ireland in the other Saturday quarterfinal at Tokyo. On Sunday, Wales plays France at Oita and Japan takes on South Africa at Tokyo.\n\nJapan has delighted the host country with a 4-0 record in pool play, including a win over an Irish team that was ranked No. 1 before the tournament and a 28-21 win over Scotland.\n\nThe semifinals are scheduled for Yokohama on Oct. 26 and 27, with the final at the same stadium on Nov. 2.\n\n___\n\nMore AP Rugby World Cup: https://www.apnews.com/RugbyWorldCup and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Latest on Thursday at the Rugby World Cup in Japan (all times local):", "authors": ["The Washington Times Http"], "top_image": "", "published_at": "2019-10-16"}