{"pub": "investing.com", "url": "https://investing.com/analysis/accsys-technologies-solid-progress-from-solid-wood-200473041", "downloaded_at": "2019-10-14 11:32:20.515738+00:00", "title": "Accsys Technologies: Solid Progress From Solid Wood", "language": "en", "text": "Accoya Revenue\n\nAccsys (LON: ) Update - Accoya wood progress in FY20 to date continues to validate the business model and expansion undertaken last year. The new Tricoya project is also progressing albeit with commissioning slipping by some months into H2 calendar 2020. Our existing model accommodates these effects and we have made no changes save for adding FY22 estimates for the first time. For now, on our unchanged estimates, we continue to contend that the current valuation is underpinned by Accoya.\n\nAccoya ahead, Tricoya build slips\n\nAll of the commercial markers of progress in developing Accoya have been ticked in FY20 to date with improvements in volume, pricing and gross margins all noted in the first five months of the year. Moreover, demand in each of the end markets currently served is said to be strong and the expanded Arnhem facility is being fully utilised. The new Tricoya facility timescale slippage does take the near-term gloss off Accoya’s progress but management reiterated that long-term profit expectations for the Tricoya business stream are unchanged. There is scope for rebalancing our FY21 expectations more towards Accoya at the expense of Tricoya; however, our current modelling remains within achievable ranges for both in our view so we have made no estimate revisions at this stage. For the record, this note also includes commentary on the FY19 results, including FY22 estimates for the first time.\n\nFull expansion agenda\n\nAs previously announced, CEO Paul Clegg is to step down when a replacement is appointed and this process is ongoing. The new person’s brief will include managing the Hull facility commissioning process, likely further expansion at Arnhem as well as progressing active discussions with partners for new overseas plants in North America (Accoya) and Malaysia (Tricoya). These are all live work streams now and each will require funding, with the European investments likely to be quantified during this financial year. Our model will be adjusted to incorporate expected costs and benefits of these projects as they are announced.\n\nValuation: Accoya underpins valuation\n\nAs before, our DCF approach generates the current share price from the Arnhem Accoya operations alone (5% inflation assumed and carrying the end FY19 group debt position). We will revisit the valuation impact of the new Tricoya facility once the operational ramp-up and all associated costs are clarified. The prospective new international manufacturing partnerships represent further valuation upside but are likely to take longer to crystallise.\n\nShare price performance\n\nShare Price Performance\n\nBusiness description\n\nAccsys Technologies is a chemical technology company focused on the development and commercialisation of a range of transformational technologies based on the acetylation of solid wood and wood elements for use as high performance, environmentally sustainable construction materials.\n\nAGM update\n\nFurther volume growth at Arnhem\n\nAccsys grew Accoya sales volumes by 33% in the first five months of FY20 to 22,916m3 with an associated 43% uplift in wood revenues to €32.6m. In addition to increased volume, improved underlying pricing from previously announced January increases and some favourable mix effects contributed to this headline performance. There has been growth in all customer sub-categories – and managing the balance of customer demand is an ongoing challenge – but implicitly ‘open market’ segment sales were relatively firmer and such mix effects are usually favourable for gross margin development also. Given annual capacity now of 60,000m3 and allowing for the scheduled two-week maintenance shut down during this period, this suggests that the expanded Arnhem facility is running pretty well at its full run rate on a pro-rated basis. This is a confirmation of the successfully executed and stable capacity expansion first demonstrated in H219. In parallel, preparation and planning for the fourth Arnhem reactor (a further 20,000m3 capacity addition) appears to be advancing and we note the more definitive language being used here (eg ‘once operational… will provide’). The timescale and funding route for advancing this project are to be clarified; the next update is expected during FY20 and the build programme to operational status could be a further 18 to 24 months after that.\n\nLastly, discussions with a potential partner for a new Accoya plant in the US are said to be ongoing. No partner names have been disclosed yet, so we assume that the scoping process is still at relatively early stages. Given that North America can be considered a larger-scale homogeneous market, project investment is therefore likely to be a significant undertaking even allowing for potential modular capacity development.\n\nBirthing pains for Tricoya facility, business model intact\n\nAccording to management, end market demand for the Tricoya panels currently being manufactured by Medite from chipped Accoya wood has remained strong. We would expect to see some revenue growth in this segment for Accsys, albeit constrained by Arnhem capacity until the dedicated Tricoya newbuild facility comes online. It is under construction at the Saltend Chemicals Park near Hull and we are now informed that it is expected to be operational ‘in the second half of calendar 2020’. This represents slippage from ‘mid 2020’ guidance previously, though it is unclear as to how many months difference this equates to. As before, we understand that the wood handling capability is well advanced and the acetylation tower is being rebuilt progressively adding process equipment at the same time. As a result of the delay, ‘significant’ additional capital costs have been incurred; these are still to be quantified externally as is the expected split between partners. Given likely negotiations around contractual terms, a lack of clarity here is not surprising. There are clear commercial considerations for Accsys with a trade-off between time and cost to complete. The most important message from management is that there is no change to the business model or expected long-term profitability of the facility.\n\nThe previously announced feasibility study for a prospective new Malaysian Tricoya facility with partner PETRONAS Chemicals is said to be progressing and, as one would expect, is being informed by the Hull construction process. Consequently, the decision point is now not likely before H2 calendar 2020.\n\nFY19 results overview\n\nAttaining a small positive EBITDA outturn (€0.9m) was a significant milestone for Accsys in FY19 with a strong increase in Accoya profitability following capacity expansion exceeding other group development and corporate costs. As well as expanding Arnhem, construction of the new Tricoya facility at Hull commenced during the year and this was reflected in a rising group net debt position.\n\nAccoya: Volume ramps up and converts to material profit uplift\n\nExhibit 1\n\nThe successful commissioning of the third acetylation reactor at Arnhem was the key event in FY19, raising processing capacity there by 50% to 60,000m3 per annum. It came onstream around the middle of the fiscal year and the enlarged facility was running at full utilisation by the year end, facilitating a c 22% revenue uplift for this reporting division. Sales derived directly from acetylated wood increased by 18.8% and we note that sales grew in all three disclosed segments, as follows:\n\nacetylated wood (Medite and FINSA partnership agreements; producers of panels from chipped Accoya wood) +52% and to just over 17% of total wood sales (+400bp y-o-y),\n\nsolid wood supply (partnership agreement for with Cerdia, formerly Rhodia Acetow) + c 14% (and c 20% of total wood sales), and\n\nother third-party solid wood sales +c 13% y-o-y (c 63% of total shipments, -300bp vs FY18).\n\nUnderlying sales volumes rose by 16.5% in the year (to 49,716m3). Inferred price inflation of c 2% then was the product of higher pricing to all three of the customer groups above, including an uplift in January 2019. Average unit pricing per cubic metre is lower in the partnership agreements so the faster growth delivered here – most notably with Medite and FINSA – will have served to temper average selling price development at divisional level. (Note that capacity constraints throughout the year meant that all customer segments were on allocation, a situation that clearly needs to be managed sensitively.) This development mix also has a dilutive impact on the manufacturing gross margin though higher volumes drove an overall uplift here, which was supplemented by c €1m of licence revenue received and an increase in other Accoya-related income (including acetic acid by-product sales).\n\nLooking at the H1/H2 split, there are a couple of points to make. Firstly, the annual maintenance shutdown occurred in H1 in both years and H118 financial performance was additionally influenced by Arnhem expansion preparation. The benefit of increased capacity is clear in H219 with significant uplifts in Accoya wood revenue and profitability evident in Exhibit 1.\n\nOutlook: FY20 is set to be an important year in affirming the potential of Accoya. Most obviously, there is an opportunity to sell an additional c 10,000m3 of processed wood from the full year availability of the third reactor. With existing customers on volume allocation to date, there should be a natural uptake here and, in H120, volume growth to Medite and FINSA will be keenly watched. These two customers produce Tricoya panels and represent the anchor market outlets for Tricoya volumes expected to be produced at Hull when it comes on stream. At the same time, third-party customer demand pull-through will be required for absorbing additional capacity in the year and, more crucially, provide an indication of the ability to do so when the current Medite/FINSA volumes migrate across to the Hull facility. Having flagged that planning for a fourth reactor at Arnhem is underway, management is demonstrating confidence that underlying demand is good and growing. From a strategic perspective, aspirations to establish manufacturing facilities in the US and Asia have been flagged by management and discussions with potential partners are underway.\n\nWe note that Nasdaq First North, Copenhagen-listed Cleantech Building Materials (CBM) has recently undertaken a debt-for-equity-swap and secured third-party financing via a further equity issue to construct an Accoya production JV facility with Nantong Acetic Acid Chemical Company with an initial 160,000m3 design capacity. CBM currently owns an exclusive licence to distribute Accoya wood in China and establishing local production was one of the licence conditions. This is a significant undertaking, which we assume would require significant input from Accsys, but no timetable has been assigned to this project as far as we are aware. Asia-Pacific overall represented c 8% of Accsys group revenue in FY19 and China is believed to represent only a portion of this. Other markets in the region remain directly accessible to Accsys; it remains to be seen how CBM’s intentions play out and how this influences Accsys’s discussions and strategy there.\n\nTricoya: Developing markets, building capacity\n\nThis section refers to Tricoya performance as reported divisionally. As a reminder, Tricoya is acetylated wood in chipped form; all of the solid wood sales originate from the Arnhem facility and are sold as Accoya, but partners Mediate and FINSA currently chip this material for use in their licenced panel products. Of the €1.2m divisional FY19 revenue recorded, broadly half came from Tricoya finished wood panel sales sourced from these partners and re-sold by Accsys to further develop markets and applications. The remaining c €0.6m was licence income (and the FY18 €0.2m divisional revenue comparator was all licence income). Increased licence income, which mostly drops straight through, together with product sales net of cost of goods sold, lifted the gross profit contribution by almost €0.5m. This was partly offset by higher opex in the year, including average headcount increasing to 12 (from four in the prior year) leading to a reduced overall divisional operating loss for the year versus FY18 to c €2.1m (a c €0.3m improvement).\n\nConstruction progress with the new purpose-built Tricoya facility at Hull was well underway at the fiscal year end. Civil engineering project delays relating to site structure reinforcement (but not processing plant performance) were flagged previously with the year-end update. Management confirmed that the project has been ‘substantially progressed’; the front-end wood handling section has been constructed and most of the other plant is already onsite though there was no specific site rectification update. At that time, the plant was expected to be fully constructed and operational by mid calendar 2020.\n\nNet assets associated with the Tricoya segment reduced modestly from €49.0m to €47.6m; we believe that a tax credit meant that the loss after tax was smaller than its pre-tax equivalent. More importantly, consistent with the construction programme, the composition of year end net assets changed significantly. Tangible fixed assets (ie property, plant and equipment) increased by c €28m to €49.9m, largely assets under construction, with a comparable reduction in cash and equivalents on hand (to €6.9m within the TTL entity1) at the balance sheet date. By virtue of the supply of lower priced Accoya to Medite to facilitate market development, Accsys’s ownership of TTL rose to 76% (from 75.1% at the last year end).\n\nThe other notable development during FY19 was the agreement with Petronas (announced on 9 January) to undertake a feasibility study for prospective joint funding for the design, build and operation of a Tricoya production plant and an integrated, closed-loop acetic anhydride facility in Malaysia. The scoping period is expected to take at least 18 months and will include market intelligence gathering and input from the construction process underway at Hull. No figures on scale have been indicated at this stage and it will clearly depend on the perceived market opportunity.\n\nOutlook: Clearly, completing the physical construction phase of the new Hull facility will be the key strategic focus of this year. In FY20, immediate Tricoya volume requirements and market development activity will continue to be met from Accoya wood processed at the Arnhem facility. At the same time, costs associated with a rising employee base and the Malaysian feasibility study are likely to result in an increased operating loss in the current year. For example, an operational labour force of 31 people has been indicated to run the Hull plant, so we would expect to see a material increase in numbers by the end of FY20, probably back-end loaded. Beyond this, we have assumed that the facility becomes operational during FY21; for the record, our model currently incorporates the solid wood production equivalent of c 14,000m3 in FY21 and c 20,000m3 from the Hull facility.\n\nOther cost categories see a modest overall increase\n\nFor completeness, in the other reported operating profit categories shown in Exhibit 1, Corporate costs rose by €0.6m to €5.3m (reducing to 7.0% of revenue from 7.7% in the prior year) while expensed R&D costs came in c €0.3m lower year-on-year at €1.1m. The latter movement most likely reflected a prior year peak in Tricoya development and/or additional IP costs capitalised in FY19.\n\nHigher debt follows capacity expansion investment\n\nOver the course of FY19, Accsys increased its net debt position by c €46m to slightly above €50m at the year end. We view the delivery of €0.9m positive EBITDA as a significant development but the current investment phase was clearly the material driver behind the headline net debt movement.\n\nOperating cash flow was marginally improved (with a €1.4m outflow compared to €1.8m in the prior year) but the composition was very different to that seen in FY18. Most obviously, a year-on-year improvement in EBITDA in excess of €4m and from a loss to a €0.9m positive contribution was notable, driven by Accoya expansion. As discussed earlier and shown in Exhibit 1, this increase was second-half weighted and the corollary of this is the receivables-led €2.6m net working capital outflow (compared to a payables-led €2.8m inflow in the prior year). Both years included a small absorption by inventory. In FY18, executive bonuses were subject to a one-off prior-year catch up which did not recur in FY19 so also appears as a favourable comparator in the latest reported year.\n\nContinuing down the cash flow statement a tax receipt from the Dutch tax authorities more than offset cash interest costs in the year. Group capex totalled c €49m of which c €35m was spent in H1 (just over half at Hull with the acquisition of previously leased land and buildings at Arnhem and investment in the third reactor there being the notable items). The c €14m spend in H2 was dominated by progressing the new Hull facility; while the level was lower than seen in H1, it was in line with our reset expectations from when the need for site rectification actions were announced. At a much lower level, capitalised costs associated with both tangible and intangible asset development were just over €0.7m for the year.\n\nAfter the above effects, the FY19 group free cash outflow came to c €50m. Just under €1m share issue proceeds (subscribed by BP (LON: ) Chemicals for TVUK funding) were received in H2 and, added to the previously reported €5.7m subscription by VP Participaties BV in H1, brought the net cash outflow for the year down to c €43m. Additional finance leases relating to Arnhem infrastructure and FX movements explained the remaining movement in headline net debt referred to above.\n\nCash flow outlook: Ahead of definitive expansion project announcements, we expect free cash flow to improve in each of our estimate years, with declining outflows in the first two years before achieving a small inflow in FY22. In the near term, completion and commissioning of the Hull facility will continue to be a significant cash flow line item and we have factored in €11m of capex for this purpose in FY20. Otherwise, rising profitability and EBITDA will be partly offset by rising interest and tax payments and we currently project that capex for existing and under construction operations will settle at c €9m in FY21 and FY22. These projections do not include further spending for capacity expansion at Arnhem. As referenced earlier, management has unsurprisingly flagged that it is actively considering the addition of a fourth Accoya reactor (the capacity of each of the preceding three has been 20,000m3 per annum). We will incorporate this in our earnings model when it is announced.\n\nGrowing demand, estimates unchanged and positive FY22 PBT\n\nVolume growth with named partners (specifically Cerdia, Medite and FINSA), other third-party customers and in international markets as well as the UK is further affirmation of the acceptance of Accoya and Tricoya products. A rapid uptake in utilisation of new capacity and reference to customers remaining on allocation were also indicators of strengthening demand in FY19 and in FY20 to date. With the increased capacity available, repeating these characteristics throughout FY20 would put Accsys in a strong position to transition Tricoya volumes away from Arnhem to Hull when the latter facility becomes operational during FY21. At the same time, this will represent a good litmus test of Accoya demand as processing capacity is freed up to address that market.\n\nWe made no substantive changes to our model following the FY19 results, but net debt expectations for FY20 and FY21 were modestly higher reflecting a slightly higher than anticipated FY19 base year. Hull is now expected to come on stream slightly later; subject to definitive timing, this may not be inconsistent with our existing FY21 estimates (ie c 50% of annual, total capacity volume and a c 37% gross margin). Hence, we leave these assumptions unchanged for now. We have also added FY22 projections and they contain the expected attainment of a positive PBT outcome for the first time.\n\nExhibit 2", "description": "Stocks Analysis by Edison  covering: BP PLC, Accsys Technologies. Read Edison 's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-14"}