{"pub": "yahoo", "url": "https://news.yahoo.com/eu-set-resume-expansion-push-094911610.html", "downloaded_at": "2019-09-29 23:46:17.992367+00:00", "title": "EU Set to Resume Expansion Push With Balkan Accession Talks", "language": "en", "text": "(Bloomberg) -- The European Union will probably authorize the start of formal accession negotiations with Albania and North Macedonia next month, betting that the prospect of membership in the club will help further anchor the continent’s troubled Balkan region to the West.\n\n“In light of the progress achieved on reforms,” EU ministers meeting in Luxembourg on Oct. 15 will decide to “to open accession negotiations” with the governments in Tirana and Skopje, according to a draft of their communique circulated on Friday and seen by Bloomberg. While the wording could still change, a previous draft, also seen by Bloomberg, didn’t include the recommendation to begin talks.\n\nA similar push to open accession negotiations faltered in June, as countries such as France, the Netherlands, Germany and Denmark resisted. Western EU governments are exasperated by the failure of some eastern nations that joined the bloc from 2004 to uphold the rule of law and fight corruption. They are thus wary of admitting new members to the world’s largest trading club, where people, goods and services can move freely.\n\nCountries including Poland, Hungary and Romania -- among the largest recipients of EU structural funds and agricultural aid -- are at loggerheads with the European Commission over their democratic standards, and the bloc’s executive arm has so far failed to force them to fall in line. In its June communique on enlargement, the EU said that admission of new members should take into account the bloc’s “capacity to integrate” them.\n\nEven though accession negotiations last for years -- or even decades, as in the case of Turkey -- and their conclusion isn’t guaranteed, the launch of the process is a victory for the government of North Macedonia. It had invested most of its political capital in a deal with Greece to change the former Yugoslav republic’s constitutional name, hoping that this would pave the way for EU membership.\n\nThe new Greek government has said it disagrees with the deal struck between North Macedonia and its predecessor, but won’t seek to annul it due to the need to preserve continuity in international agreements. Still, the wording in the draft communique seen by Bloomberg, which “strongly welcomes the historic Prespa Agreement,” could trigger a backlash in Athens, as most of the governing party’s voters oppose the pact.\n\nTo contact the reporter on this story: Nikos Chrysoloras in Brussels at nchrysoloras@bloomberg.net\n\nTo contact the editors responsible for this story: Chad Thomas at cthomas16@bloomberg.net, Keith Campbell, Bruce Stanley\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- The European Union will probably authorize the start of formal accession negotiations with Albania and North Macedonia next month, betting that the prospect of membership in the club will help further anchor the continent’s troubled Balkan region to the West.“In light of the progress achieved", "authors": ["Nikos Chrysoloras"], "top_image": "https://s.yimg.com/uu/api/res/1.2/bE7zgim7QFIWM9Lym_AHyA--~B/aD0xMzM1O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/dc296d3edc2a7be5c809fc1f32b9c408", "published_at": "2019-09-29"}