{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7619895/The-Crown-recreates-Princess-Margarets-racy-bathtub-pose.html", "downloaded_at": "2019-10-28 00:37:20.607098+00:00", "title": "The Crown recreates Princess Margaret's racy bathtub pose", "language": "en", "text": "Even now, at a distance of nearly 60 years, it has lost none of its capacity to amuse. A picture that combines vulgarity and irreverence while still managing to be strangely hypnotic.\n\nWearing nothing more than a smile and the fabulous Poltimore tiara, Princess Margaret gazes coquettishly from her Kensington Palace bath into the camera.\n\nWhile behind the lens, her man-about-town photographer husband, Antony Armstrong-Jones, is just out of shot, his bare foot pokes tantalisingly into the edge of the frame.\n\nA publicity still for the hotly anticipated third TV series of The Crown, released last week, shows a reimagining of this most intimate of royal portraits with actress Helena Bonham Carter playing the troubled Princess, who was then fourth in line to the throne.\n\nWearing nothing more than a smile and the fabulous Poltimore tiara, Princess Margaret gazes coquettishly from her Kensington Palace bath into the camera\n\nIt isn't quite right of course, there were no bubbles in that 1962 bathtub, no hotel-style monogrammed towels and no faux-antique shower attachment.\n\nSadly, we are not allowed to publish the original photograph which was released by Snowdon only in 2006, four years after his ex-wife's death. But it was withdrawn from public view by the family after he died in 2017, though it is easily viewed online.\n\nThe Netflix trailer also hints at the dark side of their relationship by including a scene where Ben Daniels, playing the Earl of Snowdon, grabs the Princess's chin and pins her against the wall.\n\nCertainly, these two episodes book-ended what was unquestionably the most turbulent and darkest of royal marriages.\n\nThe glamorous union descended rapidly into acrimony after the glorious wedding day in 1960 when crowds cheered as the first commoner to wed a king's daughter for 450 years waved from the Buckingham Palace balcony. During those early years of marriage, the couple's love was passionate and unmistakable.\n\nCertainly, these two episodes book-ended what was unquestionably the most turbulent and darkest of royal marriages (pictured in 1960)\n\nAt one charity reception, Snowdon arrived with his hair tinted an odd shade of apricot — apparently the result of the pair attempting to match their hair colour as a visible expression of their devotion.\n\nThey were both highly-sexed and they found it hard to keep their hands off one other. 'Each was a person of extraordinary sexual magnetism,' wrote Anne de Courcy in her biography of Snowdon, a book to which he contributed hours of interviews, including much about his love-life.\n\nWhen the couple announced their engagement, romantic novelist Barbara Cartland gushed: 'No two people have ever been so much in love.' But in reality the two lovebirds both harboured doubts.\n\nSome say Margaret only married Tony after receiving a 'thunderbolt' letter from the older man she had loved for many years but could not marry in those conservative times because he was divorced — Battle of Britain fighter ace Group Captain Peter Townsend.\n\nFour years had passed since they had formally ended their relationship and Townsend's letter informed the Princess he was about to announce his engagement to a young Belgian, Marie-Luce Jamagne. Margaret, who was then 29, wrote back persuading him to delay his announcement, thus ensuring Buckingham Palace got in with hers first.\n\nThe Netflix trailer also hints at the dark side of their relationship by including a scene where Ben Daniels, playing the Earl of Snowdon, grabs the Princess's chin and pins her against the wall\n\nAs for Snowdon, another of his girlfriends confided to a former lover that at the prospect of marriage to the Queen's sister, Tony had wept onto her bare breasts. The public, of course, were none the wiser.\n\nDuring the early years of the marriage, Margaret and Tony were the nation's golden couple and their parties in Apartment 1A, Kensington Palace, were gatherings of the beautiful and famous: Dudley Moore at the piano, Cleo Laine singing and Peter Sellers playing the fool.\n\nThe Beatles and the Rolling Stones were guests, so, too, were Margot Fonteyn and Rudolf Nureyev, along with fashion trendsetters Vidal Sassoon and Mary Quant.\n\nThe Snowdons were at the epicentre of the 'Swinging Sixties', going to rock concerts and mingling with movie stars while bringing a modernising feel to royalty (Harry and Meghan take note!).\n\nAt first, Tony had adapted to royal protocol. He was a dutiful consort, keeping a step behind his wife on official occasions when Margaret was representing the Queen and always saying the right thing.\n\nThe Snowdons were at the epicentre of the 'Swinging Sixties', going to rock concerts and mingling with movie stars while bringing a modernising feel to royalty (pictured in 1962)\n\n'He was the master of small-talk,' recalls a friend from those days.\n\nBut beneath the glossy royal patina, cracks were slowly emerging.\n\nWhile holidaying with Stavros Niarchos, a Greek shipping tycoon, in 1963, the Princess asked her husband what she should wear to a barbecue party being thrown to mark her birthday. He suggested a ballgown.\n\nShe arrived to find all the other guests in jeans and sandals. Was it deliberate? Almost certainly. For behind closed doors the two quarrelled and bickered constantly.\n\nThe truth was that both were used to being the centre of attention and they became competitive.\n\nTony did not like walking behind any woman. He took to belittling her or uttering put-downs that began as jokes at her expense, and as time went on these became more frequent and more cruel.\n\nAt times, it made the later break-up of the Prince and Princess of Wales's marriage look like an almost amicable parting.\n\nOften they didn't care who heard or witnessed their rows. Francis Leigh, the Princess's comptroller and a courtier of the old school, was incredulous of their behaviour on one occasion, remarking: 'They were shouting and screaming at each other up the stairs in front of the butler.'\n\nThe relationship degenerated into open warfare, with Snowdon's quickness of wit and slyness giving him the edge. He took to leaving nasty notes on her desk and elsewhere, including one headed: '24 Reasons Why I Hate You.' Others were strategically placed in the book she was reading, or under her pillow.\n\nAt first, Tony had adapted to royal protocol. He was a dutiful consort, keeping a step behind his wife on official occasions when Margaret was representing the Queen and always saying the right thing (pictured in 1963)\n\nThe most infamous, which he left in her glovebox read: 'You look like a Jewish manicurist.'\n\nAnother note tucked between the pages of her bedside book said simply: 'I Hate You.'\n\nIf she was singing at the piano with friends, he would stand behind her and mimic her, make faces or perform a mock curtsey.\n\nHe was invariably very funny when he did this, but it was embarrassing for their guests, as was his habit of asking everyone except Margaret what they would like to drink.\n\nInterior designer and socialite Nicky Haslam recalled a party at the home of screenwriter Ivan Moffat, whose wife Kate was a close friend of Margaret. 'The growing distance between Margaret and Tony was all too evident,' Haslam remembered.\n\n'Bored Tony played with a box of matches, flicking them, lit, at his wife. 'Oh do stop,' she said. 'You'll set fire to my dress.'\n\n'Tony glowered. 'Good thing, too. I hate that material.' '\n\nHe was invariably very funny when he did this, but it was embarrassing for their guests, as was his habit of asking everyone except Margaret what they would like to drink (pictured in 1960)\n\nOne of his favourite tricks when they were en-route to official occasions was to roll down the window of the Rolls-Royce so her carefully coiffed hair blew all over the place.\n\nOne of her chief complaints was that he would reduce her to bouts of weeping on the day of an important public engagement, so that she appeared puffy-faced and red-eyed.\n\nIf she was chatting to their friends, he would tell her sharply: 'Shut up and let someone intelligent talk.'\n\nThey even fought in front of the Queen Mother, shouting at each other across the drawing room at Clarence House. One row was so ferocious the Queen Mother said to her page, William Tallon: 'Come on, William, we're going into the pantry. We're not being privy to this.'\n\nMost of the rows were about trivia, a constant battling to show who was 'No 1'. Margaret's upbringing had convinced her she was always the most important person in the room but Snowdon was determined not be bossed around.\n\nHe went out of his way to avoid her. Staying with friends in Rome, he climbed out of a window and on to the roof explaining: 'It's the only place I can get away from her.'\n\nWhen she insisted on joining him on a skiing trip during the winter of 1965, he complained: 'She's f***** up my holiday!' To get his revenge and knowing how much his wife hated being kept waiting, he was deliberately late for lunch leaving her furious at the discourtesy.\n\nMost of the rows were about trivia, a constant battling to show who was 'No 1'. Margaret's upbringing had convinced her she was always the most important person in the room (pictured in 1960)\n\nDiarist Cecil Beaton recorded an incident where Tony was discussing the lighting for a garden sculpture when Margaret, drawing on her long cigarette holder, began: 'Don't you think it would be better if . . .'\n\nSnowdon responded by telling her to 'p*** off'.\n\nOccasionally, Margaret managed the odd riposte of her own.\n\nOnce, when their children, David and Sarah complained that at school the other children jeered 'here come the royals', their mother said: 'But darlings you're not royal,' before adding cuttingly: 'Papa's certainly not royal.'\n\nBut as a friend of the family said: 'You have to remember that for all the private difficulties in their relationship, all their children ever saw was two loving parents giving them the best possible childhood.\n\n'Both David and Sarah have grown up into notably hard-working and happily married members of the Royal Family which speaks for itself. They are very protective of their parents' reputation — and rightly so. It may not make for compelling TV drama, but it's an important part of their parents' story that too often goes overlooked.'\n\nYet the tensions were always there beneath the surface. Snowdon frequently shut himself away in his basement studio, telling Margaret: 'Never come in here without knocking.' Eventually, they took to communicating by letter. In one, Snowdon complained about her habit of drinking into the early hours and then sleeping late.\n\nIn fact, this was just another symptom of her unhappiness.\n\nHis absences, particularly when working as a photographer for the Sunday Times, also upset her.\n\nThe overriding reason for this possessiveness was her assumption that when Tony was away from her, he would stray. And she was right, his sexual appetite was constant. Snowdon saw nothing wrong with discreet casual affairs.\n\nAt a party given by theatre critic Kenneth Tynan, the host related how Margaret telephoned to inquire if her husband was there. Tony with a black model on his lap made silent signs in the negative.\n\nUnhappy and bored, Princess Margaret was unfaithful, too.\n\nOne, albeit reluctant, lover was Tony's university friend Anthony Barton. The affair began when Snowdon was away in India in 1966. Barton always felt revenge was a motivating factor for the Princess going to bed with him.\n\nAnother liaison was with cocktail bar pianist Robin Douglas-Home. When he found out, Tony was jealous and left orders that Douglas-Home, who later took his own life, should never be admitted to Kensington Palace again.\n\nMargaret had already by then ended the dalliance, having pointedly told Tony: 'He wasn't nearly as good a lover as you, darling.'\n\nRemarkably, despite all the dramas and betrayals, the couple still slept together. On the surface, the marriage seemed intact but increasingly each was feeling isolated and miserable.\n\nPartly because of her faith and partly because it was anathema to the Royal Family, divorce was the last thing Margaret wanted — but by the mid-Seventies the couple were largely estranged.\n\nBoth were having affairs, he with divorcee Lucy Lindsay-Hogg, who later became his second wife, and she with landscape gardener Roddy Llewellyn.\n\nThe relationship had reached the point of no return.\n\nWhen her private secretary Lord (Nigel) Napier telephoned her in the Caribbean with the news that Snowdon was leaving her, she responded: 'Thank you, Nigel. I think that's the best news you've ever given me.'", "description": "Wearing nothing more than a smile and the fabulous Poltimore tiara, Princess Margaret gazes coquettishly from her Kensington Palace bath into the camera.", "authors": ["Richard Kay", "Editor At Large For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/22/20257220-0-image-a-12_1572214796947.jpg", "published_at": "2019-10-27"}