{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7538965/Michelle-Pfeiffer-61-looks-sensational-arrives-Maleficent-Mistress-Evil-premiere.html", "downloaded_at": "2019-10-05 06:57:02.431227+00:00", "title": "Michelle Pfeiffer, 61, looks sensational as she arrives at the Maleficent: Mistress of Evil premiere", "language": "en", "text": "She's set to star alongside Angelina Jolie in Maleficent: Mistress of Evil.\n\nAnd Michelle Pfeiffer was on hand to support the Disney film's premiere at the Karo 11 Oktyabr cinema in Moscow on Friday.\n\nThe Hollywood icon, 61, put on an androgynous chic display as she stepped out in a dazzling sequined jacket which she wore over a black turtleneck top.\n\nWow! Michelle Pfeiffer, 61, looked sensational in an androgynous chic ensemble as she arrived in style at the Maleficent: Mistress of Evil premiere in Moscow on Friday\n\nEnhancing her edgy look, Michelle completed her outfit in a pair of flared trousers and boosted her height in a pair of black heels.\n\nHer blonde locks were brushed into glamorous waves that fell elegantly over her shoulders, and she wore a light palette of make-up to accentuate her pretty features.\n\nMichelle kept her accessories simple for the red carpet, as she wore a pair of black hoop earrings to complement her attire.\n\nGorgeous: The Hollywood icon dazzled in a sequined jacket which she wore over a black turtleneck top\n\nStylish: Enhancing her edgy look, Michelle completed her outfit in a pair of flared trousers and boosted her height in a pair of black heels\n\nDrama: In the film, Maleficent has competition from the neighbouring Queen Ingrith (Michelle) who causes a rift between her and Aurora\n\nDisney beginners may not recall that Maleficent is the evil fairy in the classic 1959 animation Sleeping Beauty, and that Angelina played her in a 2014 live-action film.\n\nJust five years on, Jolie is playing her again in Mistress Of Evil, still wearing black horns, fighting fairies and sorting out her conflicted maternal feelings towards sweet Princess Aurora (Elle Fanning).\n\nThis time she has competition from the neighbouring Queen Ingrith (Michelle) who causes a rift between our anti-heroine and Aurora, when her son Prince Phillip returns to the kingdom and proposes to the Princess.\n\nUnbeknown to Aurora, Ingrith is plotting to use their marriage to divide humans and fairies forever, and it is up to Maleficent to try and stop the impending war.\n\nTaking care: Michelle wore a black arm brace on her arm after breaking it when she slipped on wet marble floor during her press tour for the film\n\nPretty: Michelle's blonde locks were brushed into glamorous waves that fell elegantly over her shoulders, and she wore a light palette of make-up to accentuate her pretty features\n\nA vision: Michelle gave a sultry look to the camera as she posed for photos\n\nChiwetel Ejiofor joins the cast as the leader of an army of fairies just like Maleficent, while Harris will replace Brenton Thwaites as Prince Phillip.\n\nThe original 2014 film grossed a whopping $758million worldwide, and brought another success addition to Disney's series of dark fairy tales.\n\nThe premiere comes after a source told UsWeekly last week that the actress felt 'pressured' into marrying her estranged husband Brad Pitt. 'She felt that Brad pressured her,' said the source.\n\nIntense storyline: Unbeknown to Aurora, Ingrith is plotting to use their marriage to divide humans and fairies forever, and it is up to Maleficent to try and stop the impending war\n\nClassic: Disney beginners may not recall that Maleficent is the evil fairy in the classic 1959 animation Sleeping Beauty, and that Angelina played her in a 2014 live-action film\n\nSensational: Poland's Next Top Model star Olga Kleczkowska looked stunning in a black sequinned minidress\n\nPosing up a storm: Olga showed off her modelling prowess in front of a striking backdrop\n\nTheir wedding was small and intimate with only their six kids in attendance, though the photos were shared with the world through People.\n\nTheir split in 2016 was not amicable with the FBI involved over an alleged physical fight on a private jet. They resolved their custody issues this year.\n\nThe Oscar-winning actress has been married a total of three times: To Jonny Lee Miller (1996 until 1999), Billy Bob Thornton (2000 until 2003), then Pitt (2014 to 2016).\n\nMaleficent: Mistress Of Evil will be released on October 18.", "description": "The Hollywood icon, 61, was on hand to support the Disney film's premiere at the Karo 11 Oktyabr cinema in Moscow on Friday.", "authors": ["Roxy Simons For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/18/19309014-0-image-a-69_1570210991319.jpg", "published_at": "2019-10-04"}