{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7540107/Kate-Beckinsale-jazzes-casual-workout-gear-stiletto-boots-indulging-retail-therapy.html", "downloaded_at": "2019-10-05 08:47:57.574919+00:00", "title": "Kate Beckinsale jazzes up casual workout gear with stiletto boots while indulging in retail therapy", "language": "en", "text": "She is known for her ultra-chic street style.\n\nAnd Kate Beckinsale made sure to jazz up even her casual workout gear when she stepped out for a bit of shopping in Los Angeles this Friday.\n\nThe 46-year-old Love And Friendship star pulled a pair of black knee-high stiletto boots over her leggings before heading out on the town.\n\nMover and shaker: Kate Beckinsale made sure to jazz up even her casual workout gear when she stepped out for a bit of shopping in Los Angeles this Friday\n\nKate swept her dark hair into a ponytail and threw a flowing white sweater over her Nike tank top, accessorizing with butterfly shades.\n\nEventually, she pulled her boots off and began carrying them, slipping her feet into a comfortable-looking pair of flip flops.\n\nThe Chiswick-born bombshell shares a 20-year-old daughter called Lily with her ex Michael Sheen, who just became a father again at 50.\n\nMichael and his girlfriend Anna welcomed a daughter called Lyra on September 23, he revealed on Twitter over the weekend.\n\nFab: Eventually, she pulled her boots off and began carrying them, slipping her feet into a comfortable-looking pair of flip flops\n\n'On behalf of Anna and myself thanks to everyone for your lovely messages of congratulations,' he wrote graciously.\n\nThe Welsh hunk added: 'It’s been a wonderful, bleary-eyed week full of love and kindness and extraordinary poo. #NotReferringToMyself'.\n\nKate hit the headlines earlier this year for her now-ended romance with 25-year-old Saturday Night Live funnyman Pete Davidson.\n\nGlam: Kate swept her dark hair into a ponytail and threw a flowing white sweater over her Nike tank top, accessorizing with butterfly shades\n\nPete was hot on the heels of his high-profile broken engagement to pop star Ariana Grande, who recently released the smash hit breakup album Thank U, Next.\n\nKate and Pete's relationship went public when they were spotted kissing in the stands at a hockey game in New York City on March 2.\n\nThe big revelation occurred one day after the first season of Kate's new drama show The Widow dropped on Amazon Prime.", "description": "She is known for her ultra-chic street style. And Kate Beckinsale made sure to jazz up even her casual workout gear when she stepped out for a bit of shopping in Los Angeles this Friday.", "authors": ["Sameer Suri For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/03/19322510-0-image-a-77_1570243182709.jpg", "published_at": "2019-10-05"}