{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/make-your-kids-think-your-favorite-treat-is-gross", "downloaded_at": "2019-10-29 15:14:55.472518+00:00", "title": "Make Your Kids Think Your Favourite Treat Is Gross", "language": "en", "text": "Photo: Shutterstock\n\nSure, you could sneak around, hiding your favourite treats in the box of the blandest cereal in your pantry, devouring them in secret once the kids are safely in bed for the night. But why do that when you can brazenly enjoy it right in front of them because they believe that piece of chocolatey goodness is actually really gross?\n\nRather than go through all the explanations about why you are allowed to have this treat while they are deprived, just make them think they don’t want it anyway. By lying about how it tastes.\n\nIt’s spicy\n\n“Oh, sorry, this is pretty spicy,” is a favourite lie among the parents in our Offspring Facebook Group. There are a LOT of you out there telling your kids that your favourite ice cream or candy bar is spicy (and we applaud you for it). If your kid doesn’t know what “spicy” means yet, find a way to introduce a little spiciness now so that you can use the excuse later. Many kids find mint to be “spicy,” so that might be a good place to start.\n\nIt has alcohol in it\n\nLook, kid, I don’t make the laws. This milkshake is spiked with alcohol and I’m not allowed to share it with you. You can’t have this until you’re a grown up.\n\nIf you don’t want your kids to think you’re drinking booze all the time, though, you could also go the “caffeinated” route, like Mitzy, who says, “If I get a fancy sweet drink at a coffee shop, I’ll tell them there’s too much caffeine in it for their little bodies. It’ll make them stop growing.”\n\nThe added threat of stunted growth really polishes that trick off nicely.\n\nIt tastes like coffee\n\nIf the thought of caffeine doesn’t scare them enough, just tell them it tastes like coffee. Let them try a sip of (cooled off) black coffee sometime or a coffee-flavored treat. They’re probably not going to like it and you’ve got the perfect trick for the next few years. (If they do like it and now they ask for coffee all the time, whoops, sorry, it was worth a shot.)\n\nIt’s too hot\n\nIf your child is sensitive to temperature, make a big show of blowing on that hot chocolate. “It’s still really hot; you could burn your tongue,” you can say, over and over until you’ve drained the cup entirely.\n\nIt’s licorice-flavored\n\nThis one wouldn’t work on my own son because despite his natural pickiness, the kid strangely LOVES licorice flavour. But I have to imagine that most of your kids don’t (black jelly beans are an abomination and should be banned). The licorice lie will work extra well with dark chocolate, thanks to its rich colour.\n\nIt kind of tastes like...\n\n... whatever flavour they hate the most. Hm, this kind of tastes like broccoli. Or lima beans. Or tuna fish. Or feta cheese. You know what flavours will most make your kids recoil—that’s what your next treat should taste like.", "description": "Sure, you could sneak around, hiding your favourite treats in the box of the blandest cereal in your pantry, devouring them in secret once the kids are safely in bed for the night. But why do that when you can brazenly enjoy it right in front of them because they believe that piece of chocolatey goodness is actually...", "authors": ["Chris Jager", "Ronelle Welton", "Bill Nimorakiotakis"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/jmnlko6uxorpxwnur52z.jpg", "published_at": "2019-10-29"}