{"pub": "reuters", "url": "https://in.reuters.com/article/soccer-england-whu-mun-report/dismal-manchester-united-overpowered-by-west-ham-idINKBN1W70NI", "downloaded_at": "2019-09-22 23:15:29.331869+00:00", "title": "Dismal Manchester United overpowered by West Ham", "language": "en", "text": "LONDON (Reuters) - West Ham United beat a toothless Manchester United 2-0 at home on Sunday to move into fourth place in the Premier League as Ole Gunnar Solskjaer’s side ended the game without an established striker after Marcus Rashford came off injured.\n\nSoccer Football - Premier League - West Ham United v Manchester United - London Stadium, London, Britain - September 22, 2019 Manchester United's Jesse Lingard looks dejected after West Ham United's second goal REUTERS/David Klein\n\nUkrainian forward Andriy Yarmolenko put West Ham ahead at the end of a drab first half with a confident first-time finish into the bottom corner and Aaron Cresswell sealed victory with an outstanding free kick in the 84th minute.\n\nThe visitors, who were missing Paul Pogba, Anthony Martial and Luke Shaw through injury and lost teenage striker Mason Greenwood to illness, looked sluggish throughout the game and lacked spark and creativity.\n\nUnited created no chances of note before the interval but Juan Mata missed a glorious opportunity early in the second half when he missed the target from close range, while Harry Maguire was later thwarted by West Ham keeper Lukasz Fabianski.\n\nTheir slim hopes of getting back into the game were rocked when Rashford came off with a groin injury, leaving winger Daniel James to operate as a lone striker for the final half an hour.\n\nWest Ham, meanwhile, were happy to soak up the pressure for most of the second half although Felipe Anderson had a chance to double their lead but was denied by a trademark save with the legs from David de Gea.\n\nThe visiting keeper was powerless to stop Cresswell’s sizzling free kick, however, which confirmed a second defeat of the season for Manchester United, who were also beaten on their last visit to West Ham when Jose Mourinho was in charge.\n\nWest Ham have 11 points after six games, the same as third-placed Leicester City, while Manchester United are eighth on eight points.\n\nKEY MOMENTS\n\nSolskjaer defended his side’s display, saying the match hinged on key moments.\n\n“When you lose a game you’re always disappointed but it’s a game that can go both ways. This is always a difficult ground to go to and we just didn’t take the chances we made,” he told a news conference.\n\n“We didn’t create enough chances but we created big moments that we didn’t make the most of. It’s a good group to work with, they are determined although sometimes along the road you’ll hit some bumps.\n\n“They want to do what we’re working on in training, but today key moments tipped the game in West Ham’s favour. We made some bad final passes and lacked quality in decision making, execution.”\n\nThe Norwegian coach added that he expected Rashford to be “out for a while” with the groin injury he sustained, but said Martial and Greenwood should return in time for next Monday’s game at home to Arsenal.\n\nIn contrast to Manchester United’s nosedive in form since beating Chelsea 4-0 on the opening day of the season, West Ham have made considerable progress since they were hammered 5-0 by Manchester City in their first game.\n\nSlideshow (4 Images)\n\n“I think we deserved the three points today, I’m happy with everything we did, we should aim to play like this every week,” said coach Manuel Pellegrini.\n\n“We played consistently throughout the game, we didn’t allow them to create chances. It’s always important when you beat a team like Manchester United, and it’s what we deserve for how hard everyone is working from the coaching staff to the players.\n\n“We’ll see how far we can go but we think we’ll have the chance to achieve something big.”", "description": "West Ham United beat a toothless Manchester United 2-0 at home on Sunday to move into fourth place in the Premier League as Ole Gunnar Solskjaer's side ended the game without an established striker after Marcus Rashford came off injured.", "authors": ["Richard Martin", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190922&t=2&i=1432681638&w=1200&r=LYNXMPEF8L0LG", "published_at": "2019-09-22"}