{"pub": "euronews", "url": "https://euronews.com/2019/10/15/donald-trump-imposes-sanctions-on-turkey-over-its-military-operation-in-syria", "downloaded_at": "2019-10-15 08:06:16.100676+00:00", "title": "Donald Trump imposes sanctions on Turkey over its military operation in Syria", "language": "en", "text": "US President Donald Trump imposed sanctions on Turkey on Monday and demanded that it stop its military operation in northeast Syria. He requested the ceasefire in a call with President Tayyip Erdogan.\n\nTrump sustained widespread criticism over his decision to withdraw US troops from Syria.\n\nThe president said he would sign an executive order authorising sanctions \"against current and former officials\" in Turkey's government \"and any persons contributing to Turkey's destabilizing actions in northeast Syria.\"\n\n\"This Order will enable the United States to impose powerful additional sanctions on those who may be involved in serious human rights abuses, obstructing a ceasefire, preventing displaced persons from returning home, forcibly repatriating refugees, or threatening the peace, security, or stability in Syria,\" Trump added in a statement posted to Twitter.\n\n\"The United States of America simply is not going to tolerate Turkey's invasion in Syria any further. We are calling on Turkey to stand down, end the violence and come to the negotiating table,\" Vice President Mike Pence told reporters.\n\nTrump also said he would hike tariffs on Turkish steel up to 50% and \"immediately\" halt trade negotiations with the country.\n\nThe move was criticised as too little, too late by the top Democrat in Congress.\n\n\"His announcement of a package of sanctions against Turkey falls very short of reversing that humanitarian disaster,\" said U.S. House of Representatives Speaker Nancy Pelosi.\n\nTrump's move to withdraw US troops from northern Syria prompted widespread international criticism and fears of a resurgence of the Islamic State. It also prompted humanitarian concerns for those displaced by the offensive.", "description": "US President Donald Trump has imposed sanctions on Turkey over its military operation in Syria — a move Democrats are calling \"too little, too late\".", "authors": [], "top_image": "https://static.euronews.com/articles/stories/04/23/25/66/1000x563_cmsv2_81351cd3-4858-5596-ad2f-dc02da9f5626-4232566.jpg", "published_at": "2019-10-15"}