{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/2019102915081/communications-services-down-after-alphabet-earnings-communications-services-roundup", "downloaded_at": "2019-10-29 23:56:40.261218+00:00", "title": "Communications Services Down after Alphabet Earnings — Communications Services Roundup", "language": "en", "text": "Communications services companies fell after disappointing earnings from Google parent Alphabet.\n\nShares of Alphabet fell after third-quarter earnings lagged some investors' expectations. \"Bigger picture, [Alphabet's] third-quarter growth highlights the power of its robust innovation pipeline,\" said analysts at brokerage Morgan Stanley, in a research note. The Morgan Stanley analysts forecast billions of dollars of a new annual revenue stream in the coming years from a handful of services, including Maps and eCommerce.\n\nT-Mobile-US attracted a higher number of premium cellphone subscribers in the third quarter than Verizon and AT&T combined even as the fate of its Sprint deal remained in limbo, as reported earlier. Facing investor pressure to justify its investment in content production, AT&T is preparing to unveil its answer to Netflix, a multibillion-dollar gamble that the media and telecom giant can sell a premium streaming-video service when rivals are flooding the market with cheaper alternatives.\n\nAT&T is targeting an audience of 50 million subscribers within five years of the 2020 launch of a streaming service called HBO Max, which will air content from the cable channel, Warner Bros. movies and TV series such as \"Friends.\" AT&T will enter the \"streaming wars\" raging between Netflix, Amazon.com's Prime and, soon, Walt Disney's Disney+.\n\nWrite to Rob Curran at rob.curran@dowjones.com\n\n(END) Dow Jones Newswires\n\nOctober 29, 2019 17:20 ET (21:20 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-29"}