{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/hurricane-dorian-latest-woman-evicted-home-maria-cazanes-miami-florida-a9089816.html", "downloaded_at": "2019-09-03 23:40:30.062138+00:00", "title": "Hurricane Dorian: Elderly woman evicted as devastating storm bears down on Florida", "language": "en", "published_at": "2019-09-03", "text": "A 75-year-old woman has been evicted from the Miami apartment where she has lived for 28 years – just as other residents are boarding up homes ahead of Hurricane Dorian.\n\nMaria Cazanes had her belongings tossed from her second-floor condo in the US city after her landlord claimed she was violating rules by keeping cats.\n\nPolice, who were there to serve the eviction notice, are understood to have watched on as the landlord's associates threw her belongings from the second-floor South Beach flat onto the street below.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe timing of the incident – an old lady effectively being made homeless as the city goes into lockdown – caused disgust across the country when a neighbour posted pictures online of Ms Cazanes’ belongings left in the street.\n\n“The hurricane is coming, and they just threw everything away,” one witness told the Miami New Times newspaper. “She’s a good lady. She never had a problem with anyone. And to take her out like that when a hurricane is coming? This is supposed to be a country of justice and compassion.”\n\nShape Created with Sketch. \"Huge damage\" as record Hurricane Dorian hits Bahamas: In pictures Show all 15 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. \"Huge damage\" as record Hurricane Dorian hits Bahamas: In pictures 1/15 A road is flooded during the passing of Hurricane Dorian in Freeport, Grand Bahama. AP 2/15 Hurricane Dorian's eye taken by Nasa astronaut Nick Hague, from aboard the International Space Station. The station orbits more than 200 miles above the Earth. Hurricane Dorian, which made landfall on the Bahamas as category 5 and now reclassified as category 4, is expected to continue on its projected path towards the Florida coast. Nasa/EPA 3/15 Buildings damaged by Hurricane Dorian are swept by deep floodwater in the Abaco Islands in The Bahamas. Latrae Rahming 4/15 Tropical Storm Dorian as it approached the Bahamas. NOAA/AFP/Getty 5/15 Strong winds blow the tops of trees while whisking up water from the surface of a canal that leads to the sea in Freeport, Grand Bahama AP 6/15 A woman walks in a flooded street after the effects of Hurricane Dorian arrived in Nassau, Bahamas. REUTERS 7/15 Uprooted trees, fallen power lines and debris scatter a road as Hurricane Dorian sweeps through Marsh Harbour in The Bahamas Ramond A King via Reuters 8/15 Buildings damaged by Hurricane Dorian are swept by deep floodwater in the Abaco Islands in The Bahamas Latrae Rahming 9/15 A building is strewn with debris after its roof was torn off by Hurricane Dorian in the Abaco Islands in The Bahamas Latrae Rahming 10/15 Uprooted trees, fallen power lines and debris scatter a road as Hurricane Dorian sweeps through Marsh Harbour in The Bahamas Ramond A King via Reuters 11/15 Hurricane Dorian is pictured from a plane flying inside the eye of the storm Garrett Black/US Air Force 12/15 Inmates from a Florida jail fill sandbags to hand out to residents ahead of Hurricane Dorian in Cocoa, Florida on September 1 EPA 13/15 Residents stock up at Wal-Mart in preparation for Hurricane Dorian in Orlando, Florida Getty 14/15 A shop is boarded-up ahead of Hurricane Dorian in Cocoa, Florida on September 1 Reuters 15/15 Waves batter a pier in Marsh Harbour in The Bahamas on September 1e Mark Hall vie Reuters 1/15 A road is flooded during the passing of Hurricane Dorian in Freeport, Grand Bahama. AP 2/15 Hurricane Dorian's eye taken by Nasa astronaut Nick Hague, from aboard the International Space Station. The station orbits more than 200 miles above the Earth. Hurricane Dorian, which made landfall on the Bahamas as category 5 and now reclassified as category 4, is expected to continue on its projected path towards the Florida coast. Nasa/EPA 3/15 Buildings damaged by Hurricane Dorian are swept by deep floodwater in the Abaco Islands in The Bahamas. Latrae Rahming 4/15 Tropical Storm Dorian as it approached the Bahamas. NOAA/AFP/Getty 5/15 Strong winds blow the tops of trees while whisking up water from the surface of a canal that leads to the sea in Freeport, Grand Bahama AP 6/15 A woman walks in a flooded street after the effects of Hurricane Dorian arrived in Nassau, Bahamas. REUTERS 7/15 Uprooted trees, fallen power lines and debris scatter a road as Hurricane Dorian sweeps through Marsh Harbour in The Bahamas Ramond A King via Reuters 8/15 Buildings damaged by Hurricane Dorian are swept by deep floodwater in the Abaco Islands in The Bahamas Latrae Rahming 9/15 A building is strewn with debris after its roof was torn off by Hurricane Dorian in the Abaco Islands in The Bahamas Latrae Rahming 10/15 Uprooted trees, fallen power lines and debris scatter a road as Hurricane Dorian sweeps through Marsh Harbour in The Bahamas Ramond A King via Reuters 11/15 Hurricane Dorian is pictured from a plane flying inside the eye of the storm Garrett Black/US Air Force 12/15 Inmates from a Florida jail fill sandbags to hand out to residents ahead of Hurricane Dorian in Cocoa, Florida on September 1 EPA 13/15 Residents stock up at Wal-Mart in preparation for Hurricane Dorian in Orlando, Florida Getty 14/15 A shop is boarded-up ahead of Hurricane Dorian in Cocoa, Florida on September 1 Reuters 15/15 Waves batter a pier in Marsh Harbour in The Bahamas on September 1e Mark Hall vie Reuters\n\nMs Cazanes, along with her 81-year-old brother and disabled son, are currently staying at a local Salvation Army following the incident on Friday evening.\n\nBut, after the national outcry, authorities now say they will stop eviction notices being served in times of crisis.\n\nMayor Carlos Giménez of Miami-Dade County said that police will no longer be allowed to serve such papers during storm emergencies\n\n“The Miami-Dade Police Department will not be evicting anybody during a time of emergency,” he said. “We’re going to be stopping that.”\n\nHurricane Dorian is currently tearing through the Bahamas, where latest reports suggest at least five people have been killed and 13,000 properties damaged or destroyed.\n\nIt is expected to sweep up the US east coast after smashing into Florida, although, on Tuesday morning, it remained unclear when it would make landfall.", "description": "A 75-year-old woman has been evicted from the Miami apartment where she has lived for 28 years – just as other residents are boarding up homes ahead of Hurricane Dorian. Maria Cazanes had her belongings tossed from her second-floor condo in the US city after her landlord claimed she was violating rules by keeping cats.", "authors": ["Colin Drury"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/03/11/mcm.jpg"}