{"pub": "dailymail", "url": "https://dailymail.co.uk/debate/article-7617769/DAN-HODGES-Boris-whisperers-No10-house-divided.html", "downloaded_at": "2019-10-27 04:08:51.137080+00:00", "title": "DAN HODGES: The Boris whisperers: How No10 is a house divided", "language": "en", "text": "On Wednesday Dominic Cummings took a break from the Brexit crisis to attend the memorial service for historian Norman Stone in St-Martin-in-the-Fields, just off Whitehall.\n\n'Dom arrived late and left early,' said an attendee. 'I got the impression he was looking for some form of divine inspiration.'\n\nHe didn't find it. Cummings, the Government and the country are again up to our collective necks in the Westminster quicksand.\n\nIronically, just as his No10 operation has descended into dysfunctionality, Boris has begun to hit his stride. He has developed a new assurance in the Commons. 'He's really performing at the Despatch Box,' a senior backbencher said\n\nThe momentum generated by Boris Johnson's diplomatic coup de main at the EU summit has been squandered.\n\nYet again, Jeremy Corbyn is poised to run away from the Election he's been demanding every day for the past two years.\n\nAngela Merkel is preparing to browbeat Emmanuel Macron into accepting yet another three-month extension.\n\nA major portion of the blame for this ongoing purgatory can be ascribed to what may be termed Lisa Nandy Syndrome.\n\nFor the past year the Labour MP for the strong Leave constituency of Wigan has been touring TV studios explaining the importance of her and her parliamentary colleagues setting aside their differences and securing Brexit.\n\nYet, strangely, she can't ever find a form of Brexit she likes. Ms Nandy longs for a Brexit deal. Just never this particular Brexit deal.\n\nCummings was described to me by one Tory MP as 'the real Prime Minister'. But then he lost his grip. There was the macho attempt to force through the Withdrawal Bill in just three days\n\nSo it has been this week. Last Saturday, Parliament stated it quite liked the look of Boris's settlement.\n\nBut it couldn't bring itself to back it unless the Letwin Amendment – which gave MPs the opportunity to string the whole process out until January 31 – was passed.\n\nOn Tuesday they did the same again. The Bill was finally granted a second reading by the significant margin of 30 votes, including 19 Labour rebels.\n\nThen a few minutes later the Programme Motion – the timetable to deliver the Bill – was thrown out, as MPs said they needed longer to insert amendments on one or two minor issues, such as forcing 30-odd million voters to go through the living nightmare of a second referendum.\n\n'They're just playing a game,' one Minister told me. 'They don't want to get this through.'\n\nThey are. But the balls, equipment, goal and referee for this game are inadvertently being supplied by Downing Street. This morning No10 is a house divided.\n\nOn one side are the Vote Leave Gang, led by Cummings and the team of aides he imported lock stock and barrel from their 2016 referendum triumph.\n\nThey are wedded to the People vs Parliament strategy. This holds any upcoming Election must be a straight fight between those who want the voice of the people to be honoured (by leaving the EU) and those who want to silence them (by scuppering Brexit).\n\nThey have at their backs the doughty yeomen (and women) of the ERG and some of the Cabinet's Brexit true believers such as Andrea Leadsom and Liz Truss.\n\nFor the past year the Labour MP for the strong Leave constituency of Wigan has been touring TV studios explaining the importance of her and her parliamentary colleagues setting aside their differences and securing Brexit. Yet, strangely, she can't ever find a form of Brexit she likes\n\nOn the other side is The City Hall Crew, marshalled by Boris's former mayoral chief-of-staff Sir Edward Lister.\n\nThey are urging the PM to try to unite Parliament behind his deal, then unite the country in the Election that follows.\n\nThis approach has the backing of a large number of Tory backbenchers and Cabinet pragmatists such as Julian Smith, Matt Hancock and Nicky Morgan.\n\nUp until the last seven days, there's no doubt which faction was in the ascendency. Cummings was described to me by one Tory MP as 'the real Prime Minister'. But then he lost his grip. There was the macho attempt to force through the Withdrawal Bill in just three days.\n\nFriends of his partner Carrie Symonds have let it be know she also believes the next Election campaign needs to be fought around his strengths, and on a clean message of delivery of Brexit and the NHS\n\nThen the threat to scrap the Bill altogether if the Programme Motion was defeated.\n\nAnd finally the ludicrous assertion the Government was 'going on strike' if MPs refused to grant an Election.\n\n'They've gone mad,' one Minister declared. 'Cummings is out of control. Labour MPs were saying to me 'why is he doing this? You've won by 30 votes. You're going to get the bill through now'.'\n\nIn the middle of all this is the actual PM. Ironically, just as his No10 operation has descended into dysfunctionality, Boris has begun to hit his stride. He has developed a new assurance in the Commons.\n\n'He's really performing at the Despatch Box,' a senior backbencher said. 'It's so good to see after having to sit behind Theresa wincing.'\n\nHe has also found his feet on the world stage. The body language at the EU summit, in which he was photographed in the midst of a back-slapping huddle with his fellow leaders, told a story. 'We've been impressed,' one diplomat admits.\n\nBut now he is back home. And he faces a choice. Does he want to be true to himself? Or become a creation of his brilliant but increasingly unbalanced adviser Cummings?\n\nBoris was elected by Tory MPs to do two jobs – deliver Brexit then win an Election. In that order.\n\nThat was also supposed to be what Cummings was hired for. But it's as if these have become secondary considerations.\n\nCummings appears to view an Election as the World Cup final of his own Brexit culture war. With People v Parliament no longer a means to will Brexit, but an end in itself.\n\nBoris is no culture warrior. His success in defying the political odds twice in London was due to his ability to reach out to those beyond his political tribe. Not pummel them into submission with an iron fist.\n\nThe body language at the EU summit, in which he was photographed in the midst of a back-slapping huddle with his fellow leaders, told a story. 'We've been impressed,' one diplomat admits\n\nThere are signs those closest to him recognise this. Friends of his partner Carrie Symonds have let it be know she also believes the next Election campaign needs to be fought around his strengths, and on a clean message of delivery of Brexit and the NHS.\n\nOne Minister claims she was an influential ally in the battle to convince Boris to give Parliament at least until November 12 to try to get the Withdrawal Agreement through.\n\n'That was important,' another Minister says. 'If Boris hadn't agreed to that the Cabinet would have got very sticky.'\n\nThere are more sticky moments to come. MPs may forever be in the grip of Nandy Syndrome. Boris's deal could be amended to mush.\n\nBut after three years of Brexit agony, he owes it to the country to have one last go at delivering it. He also owes it to himself.\n\nAt PMQs on Wednesday he responded to a crass question by Labour MP Rupa Huq with the words: 'I receive excellent advice from a wide range of advisers and officials. It is the role of advisers to advise and the role of the Government to decide.'\n\nThis is the moment to decide. Does he want to be a Cummings tribute act. Or is it time to let Boris be Boris.\n\nBercow's farewell gift...Brexit\n\nWestminster is awash with rumours that Remainers are planning to mount a new ambush of the parliamentary timetable in an attempt to sabotage the Withdrawal Agreement and force through a second referendum.\n\nBut one Minister believes the plotters have overlooked one very important factor. 'They're not going to have [John] Bercow do to their dirty work for them any more,' he said.\n\n'So many of the problems we've had have been caused by the Speaker working with Remain MPs. But after next week, he's gone. That's going to make it much harder for them to sabotage us.'\n\nIt's an analysis that's shared by some senior MPs on the Labour side. 'I think we're going to have to get this [a deal] done now,' one Shadow Minister told me.\n\n'The MPs in the Northern seats are under too much pressure. We're going to have to sit down with Boris and sort this.' Could John Bercow be the man who delivers Brexit after all?\n\nWestminster Whispers\n\nTensions are mounting between Defence Secretary Ben Wallace and Veterans' Affairs Minister Johnny Mercer.\n\nAt last week's Cabinet, Wallace praised Paymaster General Oliver Dowden for work on the Forces Covenant, the pledge to treat Britain's military fairly, saying: 'It's good to see you doing a good job alongside that boy from the soap ads,' a reference to Mercer's appearance in a shower-gel TV advert in the USA.\n\nDuring his time in Afghanistan, former commando Mercer earned the nickname 'the 105mm sniper' for his liberal use of artillery. Expect to see him firing back.", "description": "DAN HODGES: Cummings was described to me by one Tory MP as 'the real Prime Minister'. But then he lost his grip. There was the macho attempt to force through the Withdrawal Bill in just three days.", "authors": ["Dan Hodges For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/01/20230524-0-image-a-18_1572135342191.jpg", "published_at": "2019-10-27"}