{"pub": "news24", "url": "https://traveller24.com/Explore/Green/airbnb-launches-animal-experiences-but-what-are-the-animal-welfare-guidelines-20191007-2", "downloaded_at": "2019-10-07 12:04:32.937640+00:00", "title": "Airbnb launches 'Animal Experiences' - but what are the animal welfare guidelines?", "language": "en", "text": "House-sharing giant, Airbnb started in 2008. And it's been growing from strength to strength ever since - despite some countries banning it all together. In 2016, it launched 'Airbnb Experiences', which are unique activities designed by local hosts, like surfing with a Capetonian in Muizenberg or wine tasting with students in Stellenbosch.\n\nRecently, Airbnb expanded its offering even further, adding 'Animal Experiences' to its portfolio. Airbnb is now hoping to launch north of 40 000 animal experiences, in over 1 000 cities across the world.\n\nMeet the world's most intriguing animals, basically.\n\nBut when you hear 'Animal Experiences' for profit, you tend to approach with caution. How can this be ethical? Airbnb says that its new offering will allow people to \"better understand animals through caring, expert hosts and set a new standard for animal tourism.\"\n\nThis is not lions in a cages, zoos or close interactions with wild animals, like lion cub petting.\n\nREAD: This family found a hidden camera live-streaming inside their Airbnb - how to identify cameras in yours\n\n\"With 1 000 Experiences co-hosted by over 300 species and their human advocates, guests can now paddleboard with corgis, kayak with conservationists, learn alongside urban beekeepers or skateboard with a world record-winning bulldog!\" says Airbnb.\n\nYou will have the opportunity to see animals in places that allow for \"gentle observation and bring a sense of connection far beyond animal selfies or performances. For those seeking more adventure, guests can discover arctic foxes or even help rescue puppies lost within the Chernobyl Exclusion Zone.\"\n\nGuidelines were created in consultation with World Animal Protection, an organisation committed to improving the lives of animals. Underpinned by a new, industry-leading animal welfare policy, any experience that hampers the welfare and/or conservation of wild or domesticated animals will be removed from Airbnb.\n\nThat means no animal selfies, no elephant interactions, no wild animals for direct interactions with travellers, or in performances or shows to list a few. But within this shared economy, we can't help but wonder: How will this be monitored and how can we be 100% sure, as travellers wanting to buy these experiences, that standards are upheld in terms of the animal's welfare?\n\nHow do we know that the adorable corgi on that paddleboard isn't pimped out just for profit?\n\nWhat does Twitter say?\n\nFind Your Escape by signing up for the Traveller24 Weekly Newsletter – Subscribe here. Or download the News24 App here, to receive expertly curated travel ideas and deals directly to your mobile.", "description": "Is ethical animal experiences ever possible when it's provided for profit?", "authors": ["- Marisa Crous"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/5433/ada7257933a84fc2ac19c8f1f12354c5.jpg", "published_at": "2019-10-07"}