{"pub": "politico", "url": "https://politico.com/story/2019/09/18/trump-dummy-beto-orourke-gun-control-1501808", "downloaded_at": "2019-09-18 23:21:34.334402+00:00", "title": "Trump blames 'Dummy Beto' for endangering deal on gun reform", "language": "en", "text": "Beto O'Rourke called for a mandatory federal buyback of assault weapons at last week's debate. | Damian Dovarganes/AP Photo white house Trump blames 'Dummy Beto' for endangering deal on gun reform\n\nPresident Donald Trump on Wednesday admonished “Dummy Beto” O’Rourke for impassioned remarks on gun reform he made at last week's primary debate, charging that they complicated the path toward a bipartisan agreement.\n\n“Dummy Beto made it much harder to make a deal,” Trump tweeted. “Convinced many that Dems just want to take your guns away. Will continue forward!”\n\nStory Continued Below\n\nThe president was presumably referencing O’Rourke’s call at last week’s Democratic debate for a mandatory federal buyback of assault weapons.\n\n“Hell yes, we’re going to take your AR-15, your AK-47,” the former Texas congressman declared at the forum in Houston. “We’re not going to allow it to be used against our fellow Americans any more.”\n\nposter=\"http://v.politico.com/images/1155968404/201909/2561/1155968404_6085821670001_6085821761001-vs.jpg?pubId=1155968404\" true\n\nThose comments by O’Rourke — who has advocated more aggressive proposals aimed at curbing firearm violence following a mass shooting last month in his hometown of El Paso, Texas — elicited what appeared to be a death threat from a Republican state representative in Texas, and have even been criticized by some Democrats.\n\n“I frankly think that that clip will be played for years at Second Amendment rallies with organizations that try to scare people by saying Democrats are coming for your guns,” Sen. Chris Coons (D-Del.) told CNN on Friday.\n\nRep. David Cicilline (D-R.I.) similarly asserted on “Fox News Sunday” that O’Rourke’s “message doesn’t help.” And asked Sunday by CNN whether O’Rourke said something “that’s playing into the hands of Republicans,” Mayor Pete Buttigieg of South Bend, Ind., replied: “Yes.”\n\nO’Rourke and Buttigieg, a fellow Democratic presidential contender, have sparred in recent days over the issue on the campaign trail.\n\nO’Rourke responded to Trump's tweet later Wednesday morning, outlining his gun platform and encouraging the White House to take action.\n\n\"To be clear: We will buy back every single assault weapon. We‘ll also license every gun & do a background check on every buyer. That’s what the American people want—and deserve,\" he wrote online. \"The only thing stopping us from ending this epidemic is you & your cowardice. Do the right thing.\"\n\nTrump has vacillated in his support for various gun reform measures following a spate of mass shootings over the summer in California, Texas and Ohio, and POLITICO reported Monday that he will not consider a bill passed by the Democratic-controlled House instituting universal background checks for firearm purchases.\n\nThe president met with aides Monday to discuss potential solutions to address gun violence, and the White House expects to release a package of proposals this week.", "description": "O'Rourke has has advocated for aggressive proposals aimed at curbing firearm violence.", "authors": ["Quint Forgey"], "top_image": "https://static.politico.com/ea/a5/e68103a64319bd858f8815aaf208/190918-beto-orourke-ap-773.jpg", "published_at": "2019-09-18"}