{"pub": "yahoo", "url": "https://news.yahoo.com/tesla-game-changer-comes-windshield-160000207.html", "downloaded_at": "2019-09-22 15:33:59.394761+00:00", "title": "Tesla’s a Game Changer When It Comes to Windshield Wipers", "language": "en", "text": "From Road & Track\n\nThe last car part you'd ever think would change is being revolutionized by Tesla, which has filed a patent for a new windshield-wiper design. The basic windshield wiper hasn't changed in a long time. It's just a small gear set that rotates back and forth to move the wiper blade across the windshield. Sure, wiper blades have gotten more advanced as manufacturers have learned how to make better contact with the windshield and keep the view out less streaky, but Tesla shows in this patent application that it's looking at the problem in a fresh way.\n\nPublished on September 5, Tesla's patent filing describes an \"electromagnetic wiper system for the windshield of a vehicle.\" This single-blade design is supposed to be more efficient and better-looking, according to Tesla's description, although from the drawings it appears it could also be adapted to a dual-blade setup. It works using electromagnets and guide rails. Picture high-speed maglev trains, named for the magnetic levitation they use to move quickly and efficiently from place to place; it's like that on a smaller scale.\n\nPhoto credit: U.S. Patent and Trademark Office More\n\nPhoto credit: U.S. Patent and Trademark Office More\n\nTesla's design involves a block attached to the wiper arm and blade. The arm is connected to two guide rails to keep the system in place and to ensure that the blade makes contact with the windshield. The block is how the entire arm-and-blade assembly moves, since the block moves on a set of magnets surrounded by electromagnetic coil. When a current passes through the magnet and coil, the block will move across the windshield and take the arm and blade along with it.\n\nIt's no small point on an EV that, with this system, the wiper needs to draw less power from the car's battery. Tesla mentions that the mechanical components of the traditional wiper blade create a lot of friction, which requires more power to the motor that moves the arm back and forth. Electromagnets are essentially frictionless, so the only friction in Tesla's wiper system is from the guide rails on which the arm slides. This reduction in power being drawn could increase the already astonishing 370-mile driving range of a Long Range Tesla Model S, but we'll have to wait and see for ourselves to know how much of a difference this makes.\n\nTesla was also thinking about its Autopilot system when conceptualizing the patent for the wiper system. The argument is that traditional wiper systems aren't as robust as this new electromagnetic system; time and weather can lead to corrosion, making the traditional setup less effective over time. The resulting lack of visibility could hamper Autopilot and other autonomous-driving aids that use cameras to track lanes and objects around the car. Better visibility is better for the cameras and, of course, for the driver.\n\nAt the end of the day, Tesla is doing what it does best: revolutionizing. Having vastly expanded the idea of what an electric vehicle can be, the company appears to be taking that same mindset to the details, like windshield wipers.\n\nYou Might Also Like", "description": "Electromagnetic blades are typical Tesla weirdness and innovation right in front of your face.", "authors": ["Mihir Maddireddy"], "top_image": "https://s.yimg.com/uu/api/res/1.2/fkZm_PTSh6V8rD21p92u9g--~B/aD03MTg7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/road_track_223/0c7c65d0bd5830d3adea432c7bfd22d3", "published_at": "2019-09-21"}