{"pub": "nytimes", "url": "https://nytimes.com/2019/09/05/style/millennials-are-taking-over-fashion-too.html", "downloaded_at": "2019-09-05 10:29:24.328708+00:00", "title": "Millennials Are Taking Over Fashion Too", "language": "en", "text": "“The way they think, they way they operate in their personal lives, there is less resistance to the way of communicating on social networks,” he said. “You don’t need to train them or teach them or force them — it’s natural, and customers can feel that.”\n\nIt’s no accident that Olivier Rousteing of Balmain was among the first major designers to have a public personal Instagram profile , or that Daniel Roseberry staged his first show for Schiaparelli by plunking himself down in the middle of his runway, sketching, instead of hiding mysteriously backstage. People were wondering who the new guy they had never heard of was? Well, there he was! Check him out.\n\n“For many candidates, the number of followers is a key part of their résumé,” said Michael Boroian, the founder of the executive search firm Sterling International, which specializes in the luxury industry.\n\nAlso, of course, relatively young, untested designers tend to be cheaper, at a time when geopolitics and the possibility of a recession are sending tremors through the industry.\n\n“The existing creative directors have been making a ton of money,” Mr. Boroian said. “One of the people I know was on an eight million euro package. The new crew tends to go from 500,000 euros to two million, though the latter would have to have a following, so from the very beginning their name would be a mover of product. But the compensation structure is less onerous for the brand. And in return, they get loyalty.”\n\nIn fact, a brand gets more than that: It also gets a name that will not overshadow the brand name, because most of these designers were second in command, working behind the scenes before being elevated. And, said Mr. Hecquet: “They don’t have any bad or comfortable habits. They are not used to having a huge team.”", "description": "A generational shift is happening in the corridors of power. What does it mean?", "authors": ["Vanessa Friedman"], "top_image": "https://static01.nyt.com/images/2019/09/05/fashion/05GENERATIONS-COMBO/05GENERATIONS-COMBO-facebookJumbo.jpg", "published_at": "2019-09-05"}