{"pub": "yahoo", "url": "https://news.yahoo.com/trump-wanted-put-best-show-135420616.html", "downloaded_at": "2019-10-21 00:20:47.054685+00:00", "title": "Trump Wanted to Put on ‘Best Show’ at Doral, Mulvaney Says", "language": "en", "text": "(Bloomberg) -- Donald Trump still sees himself as being in the hospitality business, said Mick Mulvaney, the acting White House chief of staff, adding that the president made the “right decision” to reverse course and not hold next year’s G-7 summit at his Florida golf resort.\n\nMulvaney said he and Trump talked “at great length” on Saturday about the situation. Trump had been taken aback at the level of criticism about holding the event at one of his properties, which critics said might violate federal conflict of interest and procurement laws and the U.S. Constitution’s Emoluments Clause.\n\n“He was honestly surprised at the level of pushback. At the end of the day, he still considers himself to be in the hospitality business,” Mulvaney said of the president. “He wanted to put on absolutely the best show, the best visit that he possibly could.”\n\nThe decision to allocate the summit, and the millions of dollars in hotel revenue it was likely to generate, caused an outcry among Democrats, ethics groups and some Republicans, who said Trump was using a major government event and taxpayer money for personal gain.\n\nTrump in tweets late Saturday night first defended the decision and then abruptly pulled the plug on the White House plan to stage the 2020 Group of Seven meeting at the Trump National Doral golf resort in Miami, which Mulvaney announced at a press conference two days earlier.\n\nCriticism came quickly after Mulvaney announced the Doral move on Thursday. Holding the summit at the resort would have brought the leaders of Canada, France, Germany, Italy, Japan, the United Kingdom and the European Union, to the property, forcing those delegations to pay the Trump Organization.\n\nTrump returned to Twitter on Sunday to say that he had offered the Doral resort “FREE, if legally permissible!”\n\nThree Democratic senators wrote to Trump on Thursday, requesting a copy of any “negotiated contract” with Trump National Doral, as well as documentation on the selection process, including a list of other cities and venues that had been under consideration.\n\nA handful of Republican lawmakers also spoke out, including Senator Lisa Murkowski of Alaska and Representative Mike Simpson of Idaho. Some defended Trump: Senator Kevin Cramer of North Dakota said Trump showed “tremendous integrity in his boldness and his transparency.”\n\nAsked Sunday on MSNBC whether Trump made a good decision not to use Doral, Senator Cory Booker of New Jersey, a 2020 Democratic presidential candidate, said it was extraordinary even to have that conversation.\n\n“I’m so through in terms of even just trying to react to what is insanity,” Booker said. “And I feel like sometimes I wake up in a bizarro world and hearing the questions that actually are being put to me. This president should not profit off the presidency. It’s just insane.”\n\nChris Christie, the former Republican governor of New Jersey, said on ABC’s “This Week” that Trump and his team had committed an “unforced error.” Rahm Emanuel, former Democratic mayor of Chicago, questioned the decision-making behind the move.\n\n“There is no process,” said Emanuel, who served as chief of staff to President Barack Obama. “There’s nobody to tell him no. And I don’t care how much he loves his properties. You cannot do what he just did.”\n\n(Updates with Trump tweet in seventh paragraph.)\n\n--With assistance from Mark Niquette.\n\nTo contact the reporters on this story: Billy House in Washington at bhouse5@bloomberg.net;Bill Allison in Washington at ballison14@bloomberg.net\n\nTo contact the editors responsible for this story: Kevin Whitelaw at kwhitelaw@bloomberg.net, Ros Krasny, Kevin Miller\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Donald Trump still sees himself as being in the hospitality business, said Mick Mulvaney, the acting White House chief of staff, adding that the president made the “right decision” to reverse course and not hold next year’s G-7 summit at his Florida golf resort.Mulvaney said he and Trump", "authors": ["Billy House", "Bill Allison"], "top_image": "https://s.yimg.com/uu/api/res/1.2/MEjr0TeBwFp.RYbUFlpVuA--~B/aD0xMzMzO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/c6288935e08990d687b8418ffd4c7285", "published_at": "2019-10-20"}