{"pub": "news.com.au", "url": "https://news.com.au/national/nsw-act/news/corrective-services-nsw-officer-charged-under-new-legislation-with-having-relationship-with-inmate/news-story/8d1d748dc288d127e17a3e752f56212a", "downloaded_at": "2019-10-15 23:04:51.047765+00:00", "title": "NSW Corrections officer charged over allegedly inappropriate relationship with guard", "language": "en", "text": "A young male guard has been charged under new laws with having an inappropriate relationship with an inmate. CREDIT: 7 News\n\nA young male prison guard will face court next month after he was charged with having an inappropriate relationship with an inmate.\n\nThe 20-year-old corrections officer was charged under the newly legislated offence.\n\nDetectives from the Corrective Services Investigation Unit began an investigation following reports the guard and an inmate had been in an inappropriate relationship at a prison in western Sydney.\n\nPolice allege the young man was involved in a romantic relationship with a 30-year-old inmate, “which compromised his position as a correctional officer”, NSW Police said.\n\nFollowing investigations, the 20-year-old man was arrested at Burwood Police Station on Monday morning.\n\nHe was issued a Court Attendance Notice for the offence of engage in relationship with inmate cause safety risk to correctional centre.\n\nThe man was granted strict conditional bail to appear at Burwood Local Court on November 25.\n\nNSW Police took over investigating relationships between inmates and guards after the legislation was introduced.\n\n“Any inappropriate relationships identified at correctional facilities across the state will be brought to the attention of police and charges will be laid,” Detective Inspector Robert Hollows from the Corrective Services Investigation Unit said.\n\nThe new legislation regarding guards and inmates was passed in November last year and came after a number of female guards allegedly had sexual relationships with prisoners.\n\nIf convicted of the crime, public and private correctional officers can be sent to prison for up to two years and/or receive a fine of up to $2200.\n\nPrior to the passing of the bill, such relationships were against prison codes but weren’t illegal, let alone a crime.\n\nMinister for Corrections David Elliot told radio host Ray Hadley in July he was going to “fix” the issue.\n\n“It’s an insult to the victims of crime, which is why I’ve started the process to increase the penalties for any officer found having a sexual relationship with an inmate,” Mr Elliot said.\n\n“As far I’m concerned, if I can’t pull that off I’ve got no business being in cabinet.\n\n“I have made it very, very clear to all and sundry in the last 24 hours that this is non-negotiable as far as I’m concerned.\n\n“If I have some smart lawyer or bureaucrat tell me otherwise, well then, there’s going to be a stand down.”", "description": "A young male prison guard will face court next month after he was charged with having an inappropriate relationship with an inmate.", "authors": ["Natalie Wolfe"], "top_image": "https://cdn.newsapi.com.au/image/v1/c480726460dff68081d388a4022f60d1?width=650", "published_at": "2019-10-15"}