{"pub": "thehill", "url": "https://thehill.com/policy/international/466599-uks-boris-johnson-reverses-requests-extension-of-brexit-deadline", "downloaded_at": "2019-10-20 00:15:51.012825+00:00", "title": "U.K.'s Boris Johnson reverses, requests extension of Brexit deadline", "language": "en", "text": "British Prime Minister Boris Johnson formally applied for an extension to the country's October 31 deadline to leave the European Union (EU) on Saturday after parliament handed him a defeat and voted to delay approval of his agreement to leave the EU.\n\nThe New York Times reported that Johnson submitted a formal request for an extension to EU officials even after declaring just last month that he rather be \"dead in a ditch\" than do so.\n\nADVERTISEMENT\n\nHis letter comes just hours after members of parliament, led by an ex-member of Johnson's Conservative Party who was expelled by the prime minister, voted to delay approval of Johnson's Brexit plan until parliament passes legislation to enact it. It also required Johnson under the law to request an extension from EU officials.\n\n\"The Government must ask for an extension of Article 50 under the Benn Act and set out how it intends to proceed,\" tweeted the House of Commons on Saturday.\n\nThe House of Commons has approved the amended motion on the new Brexit deal agreed between the UK Government and the EU.\n\n\n\nThe Government must ask for an extension of Article 50 under the Benn Act and set out how it intends to proceed.\n\n\n\nAmended motion: pic.twitter.com/6gMpUOSiBz — UK House of Commons (@HouseofCommons) October 19, 2019\n\nHow that negotiation will proceed is unclear, as Johnson said immediately following the vote, according to CNN: \"I will not negotiate a delay with the EU, and neither does the law compel me to do so.\"\n\n\"Further delay will be bad for this country,\" Johnson added Saturday.\n\nBritish politics have been mired in Brexit negotiations for months following a referendum on the issue which passed more than 2 years ago. Former Prime Minister Theresa May Theresa Mary May Boris Johnson says Brexit deal between UK, EU reached UK's Johnson sends EU 'final offer' on Brexit Saagar Enjeti warns 2020 Democrats against embracing Hillary Clinton MORE, Johnson's predecessor and fellow Conservative, resigned earlier this year after her own plan for Britain to leave the EU was defeated by parliament.\n\nThe U.K. is currently set to leave the European Union (EU) on October 31, even if a deal addressing issues such as a customs union and the U.K.-Ireland border is not passed.", "description": "British Prime Minister Boris Johnson formally applied for an extension to the country's October 31 deadline to leave the European Union (EU) on Saturday after parliament handed him a defeat and voted to delay approval of his agreement to leave the", "authors": [], "top_image": "https://thehill.com/sites/default/files/johnsonboris_092919getty.jpg", "published_at": "2019-10-19"}