{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7581647/RHOCs-Tamra-Judge-says-absolutely-quit-reality-estranged-daughter.html", "downloaded_at": "2019-10-17 01:50:08.264870+00:00", "title": "RHOC's Tamra Judge says she would 'absolutely' quit the reality show for her estranged daughter", "language": "en", "text": "Tamra Judge has been estranged from her daughter Sidney, now 20, for years.\n\nTensions arose after the Real Housewives of Orange County star divorced her ex, and daughter's father, Simon Barney.\n\nDuring a visit to Watch What Happens Live, the 52-year-old revealed she would give up her career in reality TV if it meant connecting with her daughter.\n\nI'd give anything: During a Tuesday visit to Watch What Happens Live, Tamra Judge revealed she would give up her career in reality TV if it meant connecting with her estranged daughter\n\nThe blonde beauty made the revelation when asked 'If your daughter asked you to quit the show to have a relationship with her would you do it?' by host Andy Cohen.\n\n'Yes,' she said. 'Absolutely yes.'\n\nIt's unknown when the last time Tamra saw her eldest daughter last, the last meeting made public was in 2017 at Sidney's graduation. Though it was the first time since 2014.\n\nSpeaking after the meeting in 2017 she was 'very hopeful' that they would reunite soon.\n\nLoaded question: The blonde beauty made the revelation when asked 'If your daughter asked you to quit the show to have a relationship with her would you do it?' by host Andy Cohen\n\nLast known: It's unknown when the last time Tamra saw her eldest daughter last, the last meeting made public was in 2017 at Sidney's graduation. Though it was the first time since 2014\n\nThere's hope: Speaking after the meeting in 2017 she was 'very hopeful' that they would reunite soon\n\n‘I am very hopeful, because I feel like if she is removed from [home] – she is [at college] out of state – she is on the East Coast, so just the fact that she is living on her own and thinking on her own, I think it will be really good for her. I really do,’ Tamra explained to Entertainment Tonight.\n\nSidney, does not enjoy the public eye and has asked her mother to not mention her online. She has lived with her father since 2011, though her siblings, Spencer, 19, and Sophia, 14, continued to live with their mom.\n\nIn her one public statement in August 2017, she wrote on Facebook, after Tamra attended her gradation, and voiced her disapproval of her mom's continued appearance on the Bravo reality show since season 3 in 2007.\n\n'I want to start by clearing some things up as my mother continues to talk about me despite me requesting her to stop speaking of me publically [sic] as I don’t want to be associated with her or the show,' Sidney wrote.\n\nNo spotlight for me: In her one public statement Sidney asked to be kept out of the spotlight and voiced disapproval of her mom's appearance on RHOC, which she has been on since 2007\n\nAllegations: 'The reasons I left my mothers house are that she was neglectful (leaving us at home with no food or simply ignoring us entirely), she constantly put herself first and the biggest reason was that she was mentally and emotionally abusive. She was no mother to me,' Sidney detailed\n\n'The reasons I left my mothers house are that she was neglectful (leaving us at home with no food or simply ignoring us entirely), she constantly put herself first and the biggest reason was that she was mentally and emotionally abusive. She was no mother to me,' Sidney detailed.\n\nSidney recalled asking her mother not to post any pictures of the high school graduation and then finding some online.\n\n'The one thing I asked and have been asking for 4 years now has been to not talk about me because I don’t want to be in the spotlight,' the teenager continued.\n\n'But Again breaking her promises as per usual, she puts herself, her fame, her reputation, and her bank account before me. If she really wanted a relationship she would keep her promises and recognize that it is no one elses fault but hers that I do not want her in my life.'", "description": "Tamra Judge has been estranged from her daughter Sidney, now 20, for years. During a visit to Watch What Happens Live, the 52-year-old revealed she would give up her career in reality TV.", "authors": ["Kellie Chudzinski For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/23/19811372-0-image-a-29_1571266534433.jpg", "published_at": "2019-10-17"}