{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/banks-see-partners-as-best-path-to-digital-transformation-2019-10", "downloaded_at": "2019-10-02 15:36:11.785250+00:00", "published_at": "2019-10-02", "title": "81% of banking executives see working with partners as the best path to digital transformation", "language": "en", "text": "This story was delivered to Business Insider Intelligence Banking subscribers earlier this morning.\n\nTo receive the full story plus other insights each morning, click here.\n\nAmong banking executives, working with partners is seen as far and away the best strategy for achieving digital transformation goals, cited by 81% of those surveyed by Finextra in association with the EBA. Other options didn't even come close, as only 8% said building a new operating layer of their own, 6% cited outsourcing processes, and 5% said creating a new bank on the side were the best strategies. Business Insider Intelligence\n\nFor context, when asked to describe digital transformation, 55% said it means fully changing an institution's fabric, 20% said it's offering more innovative products while reducing costs, 13% thought it meant replacing and renewing the core banking operating system, and 12% said offering digital channels like mobile.\n\nThis collaborative attitude underscores how the rise of digital banking may not need to be an all-out competition between incumbents and startups and may even tilt the scales in the direction of collaboration.And banks seem to be coming to grips with this idea, as around half (48%) of financial services companies surveyed by Lloyds said they have completed deals to acquire fintech firms or take a minority or majority stake in them.\n\nIn September alone, there were prominent examples of this, including JPMorgan and Wells Fargo (both of which joined a $54 million Series B funding round for children-focused PFM startup Greenlight) and Nationwide Building Society (which recently made an undisclosed investment in business banking technology provider BankiFi).\n\nFintechs and incumbents have very different approaches to their businesses, which can be both a benefit and a drawback for partnerships. While fintechs thrive on being fast-growing, agile, and innovative with new technology, major banks tend to have more rigid structures and be slower to change, per a report from Virtusa and Finextra.\n\nWhile this contrast means that fintechs have a lot to offer banks — like the ability to rapidly design new services to test, or expertise managing digital data — it can also create friction. That's evidenced by the fact that banks frequently cite moving fintech solutions from test to deployment as a challenge. This may be why, when asked about strategic fintech partnerships they entered into in 2018, 30% of financial institution senior managers said the collaborations have still yielded no services or solutions that have been put into production.\n\nWant to read more stories like this one? Here's how to get access:", "description": "Among banking executives, working with partners is seen as far and away the best strategy for achieving digital transformation goals.", "authors": ["Gregory Magana"], "top_image": "https://image.businessinsider.com/5d306f2e9e07554dec35bf06?width=1200&format=jpeg"}