{"pub": "metro", "url": "https://metro.co.uk/2019/10/08/lindsay-lohan-wont-returning-masked-singer-australia-season-2-10880083", "downloaded_at": "2019-10-08 09:39:08.036709+00:00", "title": "Lindsay Lohan 'won't return for Masked Singer Australia season 2'", "language": "en", "text": "Lindsay Lohan is reportedly stepping down from The Masked Singer Australia (Picture: Ten)\n\nLindsay Lohan is being axed from The Masked Singer Australia after becoming ‘tricky with demands’, according to new reports.\n\nThe actress has been appearing on the loved show – where viewers have to guess which famous faces are showing off their singing talent behind elaborate costumes – for the past season.\n\nLindsay appears on the show alongside Dannii Minogue, Dave Hughes and Jackie O, competing against each other as they try and figure out who’s behind the masks thanks to subtle hints.\n\nHowever, while the format has proven to be a hit with Australian audiences, unfortunately behind-the-scenes sources are reporting that they’re looking to let Lindsay go.\n\n‘She was tricky with demands and had a complete lack of respect for time schedules,’ sources told New Idea.\n\nMetro.co.uk has contacted Lindsay’s reps for comment.\n\nLindsay is reportedly not returning for The Masked Singer Australia season 2 (Picture: Ten)\n\nWhile the report claims Lindsay’s on the out, it appears she’s made a tight bond with co-star Dannii, who revealed that they connected thanks to their history as child stars.\n\nAdvertisement\n\nAdvertisement\n\n‘I said to her, “I want you to know that I read that you started when you were five and I started at seven. Not many other people will have done that or know what you’ve been through,” ‘ Dannii explained to Daily Telegraph.\n\n‘I just wanted her to know, “Hey, I totally get it and I’m not going to judge what’s out there because I wouldn’t want people to do that to me either”.\n\nLindsay has since called Dannii her big sister as she adjusted to life in Australia filming the series.\n\nThe Masked Singer Australia airs on Network Ten in Australia and is yet to get a UK release date.\n\nMore: Lindsay Lohan When did Mean Girls come out and what does 'so fetch' actually mean? Mean Girls Day: what is it, when is it and what are the best movie quotes to celebrate? Lindsay Lohan reveals video for comeback single Xanax and it’s about ‘moving forward'\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Muhammad Ali’s daughter Laila reveals amazing voice as she shows off her pipes on The Masked Singer\n\nMORE: Ninja introduced as ‘Twitch superstar’ on The Masked Singer after Mixer move as fans cringe", "description": "Actress Lindsay Lohan was reportedly 'tricky with demands' for Masked Singer Australia and so has been ditched for future series", "authors": ["Tilly Pearce"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_86670741_1570518623.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-08"}