{"pub": "investing.com", "url": "https://au.investing.com/news/stock-market-news/markets-wrong-on-boj-china-global-drag-us-recession-eco-day-1972355", "downloaded_at": "2019-10-15 04:25:15.419764+00:00", "title": "Markets Wrong on BOJ, China Global Drag, U.S. Recession: Eco Day", "language": "en", "text": "Markets Wrong on BOJ, China Global Drag, U.S. Recession: Eco Day\n\nStock Markets 12 minutes ago (Oct 15, 2019 15:13)\n\n© Reuters. Markets Wrong on BOJ, China Global Drag, U.S. Recession: Eco Day (Bloomberg) -- Welcome to Tuesday, Asia. Here’s the latest news and analysis from Bloomberg Economics to help get your day started: China wants to hold more talks this month to hammer out the details of the “phase one” trade deal touted by Donald Trump before Xi Jinping agrees to sign it, say people familiar with the matter\n\nMarkets are wrong to assume the Bank of Japan will deepen its negative rate because the Federal Reserve is cutting interest rates and the European Central Bank has expanded its stimulus, says a former executive director at Japan’s central bank\n\nThree economists from the Massachusetts Institute of Technology and Harvard University were awarded this year’s Nobel prize for their research into how to move people out of poverty\n\nWe created a model to determine America’s recession odds. Right now, the indicator estimates the chance of a U.S. recession at some point in the next year is 27%\n\nChina is buying less from the rest of the world, pushing its trade surplus higher and dragging on global economic growth\n\nGlobal steel demand outside of China is now expected to almost stall in 2019 on shrinking consumption in Europe and a slowdown in the U.S., according to an industry group\n\nMarkets Wrong on BOJ, China Global Drag, U.S. Recession: Eco Day", "description": "Markets Wrong on BOJ, China Global Drag, U.S. Recession: Eco Day", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB810CQ_L.jpg", "published_at": "2019-10-14"}