{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/rats-van-woman-adoption-san-diego-california-a9161931.html", "downloaded_at": "2019-10-19 10:50:35.131709+00:00", "title": "Woman living in van with 320 rats agrees to give them up", "language": "en", "text": "A woman who lived in a van with more than 300 rats has agreed to give them up after the situation “got out of control”.\n\nThe unnamed owner, who lives in San Diego, California, started with just two pet rats for company in the vehicle she calls home.\n\nBut the rodents quickly multiplied to 320 and soon clawed through the van’s upholstery and chewed through the engine’s wiring, the San Diego Union-Tribune reports.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nAnd as people began to notice them coming and going from the vehicle, they began to complain.\n\nThe woman eventually contacted San Diego Humane Society to ask for help and subsequently agreed to give them up.\n\nShape Created with Sketch. Woman living in van with 320 rats agrees to give them up Show all 7 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Woman living in van with 320 rats agrees to give them up 1/7 A woman who lived in a van in San Diego, California, with 320 pet rats has agreed to give them up for adoption after the situation “got out of control”. The unnamed owner, who only started out with two rats, called San Diego Humane Society asking for help on 8 October 2019. San Diego Humane Society 2/7 San Diego Humane Society 3/7 San Diego Humane Society 4/7 San Diego Humane Society 5/7 San Diego Humane Society 6/7 San Diego Humane Society 7/7 San Diego Humane Society 1/7 A woman who lived in a van in San Diego, California, with 320 pet rats has agreed to give them up for adoption after the situation “got out of control”. The unnamed owner, who only started out with two rats, called San Diego Humane Society asking for help on 8 October 2019. San Diego Humane Society 2/7 San Diego Humane Society 3/7 San Diego Humane Society 4/7 San Diego Humane Society 5/7 San Diego Humane Society 6/7 San Diego Humane Society 7/7 San Diego Humane Society\n\nDanee Cook, from the society’s law enforcement department, told the Tribune: “This was not a cruelty case, this was a relinquishment, an owner asking for help.\n\n“She was feeding all of them, had water for all of them. This didn’t meet the standards of hoarding.”\n\nIt took officers two days to round up all of the rats, which they found in “every crevice”.\n\nMost of the rodents were young, and many of them where pregnant.\n\nAbout 140 of them are already up for adoption in same-gender pairs.\n\nRats can give birth every few weeks and have usually have litters of 10 to 12 babies.\n\nThey are said to make good pets as they are social animals and enjoy interacting with humans.\n\nThe woman’s vehicle was not salvageable and she has since found somewhere else to live.", "description": "A woman who lived in a van with more than 300 rats has agreed to give them up after the situation “got out of control”. The unnamed owner, who lives in San Diego, California, started with just two pet rats for company in the vehicle she calls home.", "authors": ["Chiara Giordano"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/18/15/rats12.jpg", "published_at": "2019-10-18"}