{"pub": "yahoo", "url": "https://news.yahoo.com/salma-hayek-bikini-no-makeup-122646597.html", "downloaded_at": "2019-10-30 14:33:46.250643+00:00", "title": "Salma Hayek, 53, shows off her curves in makeup-free bikini pic", "language": "en", "text": "Salma Hayek’s turtle appreciation post just got upstaged — by the Oscar-nominated star’s bikini.\n\nThe 53-year-old actress — who triumphantly celebrated her most recent birthday with a jaw-dropping bikini photo — took to Instagram on Tuesday to gush about her love for “turtles on the beach.”\n\nShe shared a pair of images with her 12.4 million followers on the platform.\n\nHer smitten followers, however, couldn’t get past her curve-hugging, colour-block bikini in pink and red or her natural beauty.\n\nREAD MORE: Salma Hayek celebrates 53rd birthday with bikini selfie\n\nRocking beachy waves and posing seemingly makeup-free, Hayek was showered with praise from her loyal followers.\n\n“You are and always will be one of the most beautiful woman on the planet!” raved a fan.\n\n“Do you age?” wrote a commenter. “Been a fan since ‘Desperado.’ Saw you in ‘The Hitman’s Bodyguard,’ you haven't aged a day.”\n\n“How do you keep looking so young??” asked another fan.\n\nREAD MORE: Salma Hayek stuns in sexy bathing suit as she floats in the ocean\n\n“Stunning!!!! Your light is undeniably bright!” gushed one commenter.\n\nHowever, there was some confusion over whether the original picture didn’t actually feature a turtle.\n\n“Post a turtle then,” wrote the Instagram user.\n\nHayek later posted a second, more revealing shot — this time with an actual turtle.\n\nMeanwhile, Hayek’s follower count continues to rise.\n\nREAD MORE: Salma Hayek is embracing ageing with a jaw-dropping bikini snap\n\nEarlier this month, she posted a photo of her getting acupuncture in the nude to celebrate reaching 12 million followers – she had a dozen needles in her back, saying to represent each of the millions.\n\nFor those looking to emulate Hayek’s youthful look, she has previously revealed she uses rose water in order to wash her face – on the advice of her grandmother – rather than cleansing with tap water in the morning.", "description": "\"Beautiful women like Salma may make guys reconsider building the wall,\" one fan said of the Mexican star's stunning shoot.", "authors": ["Erin Donnelly"], "top_image": "https://s.yimg.com/uu/api/res/1.2/NnnA_j3dPKdhsakRj7DtDg--~B/aD05ODg7dz0xMTEyO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/96bcdbd0-fa83-11e9-9f5e-63590fea26e9", "published_at": "2019-10-30"}