{"pub": "yahoo", "url": "https://news.yahoo.com/legal-fight-over-forest-rights-093706632.html", "downloaded_at": "2019-10-04 12:37:03.068854+00:00", "title": "REFILE-As legal fight over India forest rights drags, millions more risk eviction", "language": "en", "text": "(Adds dropped word in headline)\n\nBy Rina Chandran\n\nUDAIPUR, India, Oct 4 (Thomson Reuters Foundation) - M illions of indigenous people face eviction in India after states stopped processing new land claims under a law that is being challenged in the country's highest court, land and human rights advocates warned on Friday.\n\nEarlier this year, India's Supreme Court stayed its ruling that ordered the eviction of millions of indigenous people whose land claims were rejected, and directed 21 states to file affidavits with details on how they had processed claims.\n\nSince then, many of these states had become bogged down with the legal challenge to the Forest Rights Act (FRA), and now lacked the resources to process fresh land claims, said Tushar Dash, a forest rights activist.\n\n\"With these states fully engaged in re-examining the claims, no new claims are being processed, and nor are states training local and district officials to ensure claims are processed in the right manner,\" Dash told the Thomson Reuters Foundation.\n\n\"The ongoing case is a big risk to the implementation of FRA, with the fate of millions hanging in the balance,\" he said.\n\nIndia's 104 million tribal people - also known as Adivasis, or \"original inhabitants\" - make up less than 10% of the country's population, and are among its most impoverished.\n\nThe FRA, passed in 2006, aimed to improve their lives by recognising the right of at least 150 million people to inhabit and live off about 40 million hectares of forest land.\n\nBut states have been slow to implement the law, and more than half the land claims were rejected, often on flimsy grounds, indigenous activists said.\n\nSeventeen states have filed affidavits with the Supreme Court on how they processed FRA claims, with several stating that local officials did not follow due process in rejecting claims, according to land rights campaigners who asked not to be named as they were not authorised to see the affidavits.\n\n\"Claims were wrongly rejected, claimants were not told why they were rejected or given time to appeal, as required by the law,\" said Dash, speaking on the sidelines of a land forum in Udaipur city in Rajasthan state.\n\nIn Rajasthan, one of 21 states named in the court order, authorities were following due process, said Qummer Choudhary, chief of Udaipur city's district council.\n\n\"If the law is not being implemented, I urge you to go to the local official or the district official and demand implementation because it is your right,\" he told indigenous representatives at the forum.\n\nThe case against the FRA was brought by a group of conservationists and wildlife organisations who said it had led to fragmentation of forests, threatening biodiversity and wildlife, and causing deforestation.\n\nMeanwhile, the government's draft National Forest Policy 2018 proposes to give forest officials more power against encroachers, and earmarks more land for reforestation, making forest dwellers vulnerable to evictions, according to land rights groups.\n\nIf enacted, the policy would make the FRA largely ineffective, land activists said.\n\nA nationwide rally is planned for Nov. 17, ahead of the next FRA court hearing on Nov. 26, against the proposed forest policy and to demand the government supports the FRA, according to human rights group Campaign for Survival and Dignity (CSD).\n\nWhile the top court stayed evictions until Nov. 26, there is no guarantee for indigenous people, Dash said.\n\n\"The threat is not over,\" he said. (Reporting by Rina Chandran @rinachandran; Editing by Michael Taylor. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's and LGBT+ rights, human trafficking, property rights, and climate change. Visit http://news.trust.org)", "description": "M illions of indigenous people face eviction in India after states stopped processing new land claims under a law that is being challenged in the country's highest court, land and human rights advocates warned on Friday.  Earlier this year, India's Supreme Court stayed its ruling that ordered", "authors": ["Rina Chandran", "Thomson Reuters Foundation"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-04"}