{"pub": "yahoo", "url": "https://news.yahoo.com/robert-mugabe-brutally-squandered-jewel-101633096.html", "downloaded_at": "2019-09-07 15:29:21.185948+00:00", "title": "Robert Mugabe brutally squandered the ‘jewel’ of Zimbabwe – his rule was a bitter lesson for South Africa", "language": "en", "text": "When Robert Mugabe was elected president of the newly liberated, independent Zimbabwe in 1980, his friend and long-term supporter president Julius Nyerere of Tanzania congratulated him, but added this advice: “You have inherited a jewel. Keep it that way.”\n\nMugabe had indeed inherited a jewel, but both his nation and he himself had some fatal flaws. The former white-run, self-governing colony of Rhodesia took its name from the Victorian imperialist Cecil Rhodes, and it was the last outpost of racist “European” minority rule on the continent, apart from the apartheid regime in South Africa. Despite years of civil war and UN sanctions, the country was, at least for its settler class, prosperous, with a stable economy exporting foodstuffs, tobacco and raw materials across the world.\n\nIt was the “bread basket” of Africa. By the time Mugabe had done with it, Zimbabwe was a basket case, wracked by hyperinflation and industrial collapse, no longer able to keep the lights on.\n\nThe flaw in the jewel was the legacy of a century of white rule. While less explicitly and viciously racist than its southern neighbour, Rhodesia was a police state run by and for a white population comprising about 5 per cent of the total, led by the stubborn and wily Ian Smith: the other 95 per cent were, at best, patronised, denied human rights, kept out of power and refused a share of their nation’s wealth.\n\nAlthough the white landowners who were later to be expropriated by Mugabe owned their farms and businesses with perfectly legal title, it cannot in all fairness be said that their country “belonged” to them. It belonged to all Zimbabweans, and the failure to hand over power peacefully gave rise to the armed liberation struggle, and the fight for economic freedoms and justice.\n\nIt was that which gave Mugabe the rationale, the excuse, for what came later: the ugly and sometimes murderous scenes of liberation “veterans” (not all of whom were born when the war had ended) and the transfer of white farmers’ land to cronies. When Mugabe’s socialistic and kleptocratic economic policies failed, he had nothing else to give to his people than other people’s property, and to print money and debase the currency.\n\nThe bloody faces of the white farmers and their workers were the emblems of the fall of Zimbabwe that grabbed the most attention in Britain, but they were far from Mugabe’s only victims, and it is wrong to view him and his country through the prism of the white minority, albeit they were usually the “kith and kin” of the British, as one prime minister once remarked.\n\nThe flaw in Mugabe’s personality was not an unusual one for someone who desired power and became paranoid about holding on to it. Within four years of independence, Mugabe was dismantling the democratic constitution the British left behind, and turning himself into a dictator. He turned on his one-time allies in the liberation struggle, notably Joshua Nkomo, his deputy, who had to flee for his life.\n\nSensing, rightly or wrongly, some plot, Mugabe set about a massacre of the Ndebele people (Mugabe was Shona) and the persecution of its leaders. He used a virtual private army of his own to do so, armed and trained by the North Koreans, of all people, who knew a thing or two about brutality. The exercise had the codename “gukurahundi”, which means a rain that cleanses away the chaff; it said everything about how Mugabe had begun to view his fellow countrymen.\n\nMugabe also made free use of the draconian “emergency powers” legislation passed by his white predecessors, and for the same end – to silence and demoralise political opposition.\n\nThe key to understanding Mugabe’s character is that he was a Jesuit by education, a Marxist in belief, and an absolute ruler by inclination.\n\nhttp://players.brightcove.net/624246174001/default_default/index.html?videoId=5837728067001\n\nSupport free-thinking journalism and subscribe to Independent Minds\n\nEventually he was successfully challenged, first by Morgan Tsvangirai through rigged elections, and then via the palace coup executed by his successor, Emmerson Mnangagwa.\n\nMnangagwa, “the crocodile”, had to wait a long time for his chance, as Mugabe’s remarkable longevity, guile and residual public support always managed to frustrate his enemies. Mugabe squandered his gifts of high intelligence, a personally charming nature and a certain undeniable charisma.", "description": "When Robert Mugabe was elected president of the newly liberated, independent Zimbabwe in 1980, his friend and long-term supporter president Julius Nyerere of Tanzania congratulated him, but added this advice: “You have inherited a jewel. Keep it that way.”Mugabe had indeed inherited a jewel, but both", "authors": ["Sean O'Grady"], "top_image": "https://s.yimg.com/uu/api/res/1.2/mWUxfKrwBCpm3b9iJ10kQA--~B/aD0zNTE7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/5326094244b36731854385787c01679e", "published_at": "2019-09-06"}