{"pub": "theverge", "url": "https://theverge.com/2018/10/23/18011306/apple-iphone-xr-review-camera-screen-battery-price", "downloaded_at": "2019-10-05 13:33:17.300975+00:00", "title": "Apple iPhone XR review: better than good enough", "language": "en", "text": "Here’s a question: how much do you care about the display on your phone? Take a moment and really consider it. If you were to put a dollar amount on it, how much would having a perfect display be worth to you?\n\nApple has an answer, and it’s $250.\n\nThat’s the price difference between the new iPhone XR and Apple’s top-of-the-line iPhone XS. It’s the price difference between the XR’s 6.1-inch “Liquid Retina” LCD screen and the 5.8-inch OLED screen on the XS. Apart from the display, the XR and XS are far more similar than not: they share the same A12 Bionic processors, main cameras with Smart HDR, iOS 12, gesture controls, wireless charging capabilities, and even the forthcoming dual-SIM support.\n\nThere are some other subtle differences as well: the XR has a single rear camera, while the XS has a second telephoto lens. The XR is offered in just one somewhat large size, while the XS comes in smaller and larger variants. And the XR is made of aluminum instead of stainless steel, which allows it to come in a wide variety of colors, ranging from white, black, blue, coral, yellow, and red.\n\nThose differences are interesting and worth pulling apart, but really, the simplest way to think about the iPhone XR is that it offers virtually the same experience as the iPhone XS for $250 less, but you’ll be looking at a slightly worse display.\n\nSo, how much do you care about the display on your phone?\n\nOur review of Apple iPhone XR Verge Score 8 out of 10 Good Stuff Fun colors\n\nCompetitive price for Apple’s latest processor and cameras\n\nGreat battery life Bad Stuff Good but not great display\n\nOnly one size option\n\nCamera does strange things sometimes Buy for $599.00 from Apple\n\nLook. The display on the iPhone XR is… fine. It’s fine! It has a lower-resolution and pixel density than the OLEDs in new flagship phones like the iPhone XS, Galaxy S9, and Pixel 3, but it’s the same 326 pixels per inch as Apple’s previous non-Plus LCD iPhones. Anyone coming to this phone from any iPhone, save the iPhone X, will not notice a huge discrepancy in resolution. I suspect most people will find it totally acceptable.\n\nThat’s not to say it matches the quality of previous iPhone LCDs. The iPhone XR LCD definitely shifts a little pink and drops brightness quickly when you look at it off-axis, which often leads to a bit of a shimmery effect when you move the phone around. I noticed that shimmer right away, but I had to point it out to other people for them to see it. (It’s one of those things you might not notice at first, but you can’t un-see it.) Apple told me the XR display should match previous iPhone LCDs in terms of performance, but side by side with an iPhone 8 Plus, the off-axis shifts are definitely more pronounced.\n\nYou will also definitely notice the huge bezel around the entire display, which flows into the notch. As with Apple’s other X-series phones, the notch houses the Face ID system and the front-facing camera and generally fades from notice after just a few hours of regular use. But the bezel... well, you’re going to notice that bezel every time you see an iPhone X or XS anywhere near an XR. It’s very large, and it definitely makes the iPhone XR seem less premium than the iPhone XS.\n\nTo be clear, the bezel is there for a reason: it houses the LCD backlight. Apple did a lot of custom engineering to pack a dense array of LED backlights into that bezel, and it tucked the display controller up under the display to eliminate the need for an unsightly chin, which virtually no other phone manufacturer has been able to avoid. The trade-off? Well, the bezel, and a Lightning port that’s vertically off-center on the bottom.\n\nApple’s also done some extremely detailed work to make the rounded corners of the LCD perfectly match the corners of the phone itself, which is work I desperately wish other companies would do. (Most other phones with rounded corners have mismatched radii, and the Pixel 3 XL has different corner radii at the top and bottom, which, to me, looks far worse than any chunky bezel.)\n\nThe iPhone XR doesn’t have a chin, but the trade-off is that bezel\n\nIt’s somewhat easier to round the corners of an OLED panel: each pixel is its own light source, so you can turn them off individually around the curve to smooth it out. You can’t do that with an LCD panel because there’s just one single backlight for the entire display, which will shine through the black pixels along the edge. So Apple built little apertures for the pixels around the corners of the XR display to mask some of the light coming through, on top of antialiasing the curve in software. It’s a neat example of Apple’s attention to detail.\n\nAll of that backlight engineering means that Apple had to remove 3D Touch, which worked by sensing pressure on the backlight on previous LCD iPhones. Instead, there’s something Apple calls Haptic Touch, which is really just a fancy name for “long press with haptic feedback.” Apple’s Taptic Engine haptic system is the best in the industry, and the effect is pretty convincing, especially on the lock screen shortcuts for the camera and flashlight. I use 3D Touch to scroll around text fields by pressing down on the XS keyboard quite often, and while that doesn’t work on the XR, it’s just as easy to long-press on the space bar to invoke the cursor control feature.\n\nHaptic Touch does not have equivalents to everything 3D Touch can do, however. I missed previewing links in Safari and Twitter quite a bit. Apple told me it’s working to bring it to more places in iOS over time, but it’s going slow to make sure the implementation is right. 3D Touch is one of those Apple technologies that never really went beyond the initial rollout, so I think it’s a toss-up as to whether the company sticks with it or moves to an extended Haptic Touch system across the board.\n\nThe XR display is very much an Apple LCD, but it’s not as good as Apple’s OLEDs\n\nAll that said, I’ve always been a fan of how accurate and balanced Apple’s LCDs are compared to the OLEDs on most Android phones, and the XR is definitely another Apple LCD. If you’re coming from an iPhone 6, 7, or 8, it will look very familiar. But it’s simply not as good as Apple’s OLEDs. It doesn’t have the deep black levels or infinite contrast of the iPhone XS, it doesn’t support HDR or Dolby Vision video playback, and, in general, you can always see the border between the bezel and the edge of the display, even with a dark background. Even with Apple’s True Tone color calibration turned on, it’s always a little warmer than my XS. And there’s that off-axis color shift and shimmer.\n\nBut again: it’s basically just fine. You have to really care about displays to notice some of these things, and even then, you might have to go looking. If it really bothers you, you can spend $250 more on an iPhone XS.\n\nThe other major consideration with the XR is size: it’s a strange new size of iPhone.\n\nThe XR sits right between the old iPhone 6-sized phones and the bigger Plus models. I have big hands, so this feels like a nice size compromise, but if you’ve had one of the smaller phones, the XR is definitely going to feel much bigger. If you’re a small phone person, you’re basically going to be stuck with a last year’s iPhone 8 or paying more for an iPhone XS, which is a bummer. If you’ve been using a Plus phone, you’ll notice that you get some of the Plus interface features like side-by-side list views in apps like Messages, which is nice.\n\nThe XR also comes in a bunch of colors. Our all-black review unit looks extremely sleek, but I’ve gotten a chance to play with all the other colors, and they’re all very pretty. I like the blue and the coral the best, and the Product Red model is striking.\n\nApple hasn’t made any cases for the iPhone XR yet\n\nThe XR also has the same redesigned wireless charging coil as the XS, which offers faster charging on the same pads compared to older iPhones. It also has IP67 water resistance, which is a little worse than the IP68 rating of the iPhone XS, but it’s fine for the occasional splash. And it has Apple’s new “wide stereo” speaker system, which uses the earpiece speaker and bottom speaker as a matched pair. It’s a little less loud than the iPhone XS Max, but it’s still quite a bit of volume for a phone.\n\nThe XR screen has the same improved glass Apple uses on both sides of the iPhone XS, which the company claims is “the most durable ever,” but the glass back is the older formulation used on the iPhone X. So it’s slightly less durable than the front, by definition. You might want a case, but be aware that Apple doesn’t have any of its own cases yet. There will be third-party XR cases in Apple stores at launch, but it’s a little strange for the company to miss out on such an easy moneymaker.\n\nIn fact, the entire accessory ecosystem for the iPhone X and now the XR is a little thin. There’s never been a battery case for the X, which I’m told is related to Apple protecting antenna performance, so we’ll see if any appear for the XR. There are vanishingly few Lightning accessories in general, and somewhat infamously, there are no third-party competitors to Apple’s failure-prone Lightning headphone dongle, which is no longer included in the box. (I think we’re in for another round of headphone annoyance here, as there are far more iPhone 6S units in the world than people expect, and the XR seems like the logical upgrade from that phone.)\n\nIf the XR is as popular as it seems like it will be, the accessory market will grow very quickly, but if you’re rushing to buy one at launch, just be aware that not everything is there yet.\n\nApart from the lack of a second telephoto lens on the back of the XR, the cameras are the same as the main cameras on the iPhone XS. There’s a 7-megapixel f/2.2 selfie camera on the front, and a 12-megapixel f/1.8 camera on the back, which all use Apple’s new Smart HDR system that rivals Google’s HDR+ on the Pixel 3. Apple insists that the XR’s cameras and software are exactly the same as the XS, so there shouldn’t be any differences in how they perform.\n\nApple’s Smart HDR system is more aggressive than any other smartphone camera I’ve used\n\nThis is actually our third time looking critically at these cameras and Smart HDR, after the iPhone XS review and the Pixel 3 review, and it’s clear that Apple is chasing a very different look than Google and Samsung. Like the XS, iPhone XR photos look incredibly even and preserve highlight and shadow detail more aggressively than any camera I’ve ever used before, at the expense of contrast. It’s a conscious aesthetic decision, according to Apple. The company knows Smart HDR photos look different from traditional photos that have lots of contrast, but the bet is that people will get used to it and eventually prefer this look. And in some cases, I prefer it to the Pixel 3.\n\nIn practice, Smart HDR flattens highlights and lifts shadows to make everything look evenly lit, and that process can reduce detail and make photos look a little bit artificial. Look at this photo I casually took with the iPhone XS Max while we were shooting our review video. This was just taken under some skylights in a bar, but Smart HDR has lifted the shadows so much that it looks like we were in a photo studio with professional lights. That’s wild.\n\nHere’s the selfie Verge video producer Mariya Abdulkaf is taking in that photo: compared to the Pixel 3, Smart HDR on the iPhone XR has lifted the shadows so much that it looks like we had a fill flash, and there’s a ton of missing detail. (Apple told me that the forthcoming iOS 12.1 update, currently in public beta, will address the issue of the front camera appearing to smooth out skin by picking a sharper base frame for Smart HDR, but I wasn’t able to test it yet.)\n\nSmart HDR can also be stymied by challenging lighting conditions. Shooting subjects in the shadows against bright backgrounds tends to result in strange exposures, loss of detail, and lots of noise. And shooting in low light can sometimes generate a usable photo that deviates from what a scene actually looks like.\n\nI think most people would prefer the iPhone photo above, but it also doesn’t actually look like reality: the iPhone found Mariya’s face, exposed it correctly with the right skin tone, and then flattened all the highlights and lifted all the shadows to make the scene look bright and even. Again, it kind of looks like we brought studio lights to the bar and properly lit the photo.\n\nThe Pixel 3, on the other hand, does a much better job of capturing the strange red light and shadows in the room, even if the photo is a lot darker and arguably worse. Do you want a nicer photo or a more accurate representation of reality? Only you can look into your heart and decide.\n\nI rarely take zoom photos, so I didn’t miss the telephoto lens from the iPhone XS at all — especially since the iPhone XR can still take portrait photos with its single lens. In fact, I preferred the XR’s portrait mode to the one on the XS because the XR’s brighter f/1.8 lens and larger image sensor are much better in low light than the telephoto camera the XS uses for portrait shots. The quality of XS portrait mode shots tends to drop fairly quickly in low light, but the XR is actually pretty respectable. And the XR also takes wider angle portrait shots than the iPhone XS or the Pixel 3, which I find tremendously useful.\n\nThe XR’s portrait mode also has Apple’s nice fall-off blur, which looks far more like real bokeh than the sort of bad cut-out blur you see from the Pixel 3. I don’t ever really use portrait mode on any of these cameras, and I don’t think any of it looks terrific or perfectly convincing, but the XR’s portrait mode is by far the most flexible and useful of the bunch.\n\nThe XR’s portrait mode is more flexible and useful than the XS’s\n\nThe iPhone XR shares the same industry-leading video features as the XS: it can shoot in 4K60, and it records stereo audio. When you record in 24 or 30 fps, it captures interframes for greater dynamic range. If you’re the sort of person who wants to take a lot of video with a smartphone, an iPhone is the way to go.\n\nOverall, I think most people who are in the market for an iPhone XR will be happy with its camera. It’s a significant update from previous iPhone cameras, and, like the XS, it makes the iPhone X look downright bad. But the Pixel 3 still produces winners more consistently, and I prefer the more contrasty, natural look of its photos. And I’d much rather have the Pixel 3’s wide angle selfie lens than the telephoto lens on the XS. We’ll have to see if Apple’s aggressively flattened photos take over Instagram and push everyone else to change their looks.\n\nThe iPhone XR offered basically identical performance to the XS as I used it day-to-day, and even hit basically the same benchmark numbers in some quick tests. It has slightly less RAM than the XS at 3GB instead of 4GB, but it’s pushing far fewer pixels, so it didn’t seem to matter. The biggest performance jump you’ll notice is web rendering times; the A12 is lightning-fast at JavaScript, and it’s due to get even faster with a Safari update. Overall, Apple’s chips are so far ahead of the industry that it’s clear the A12 Bionic has tons of headroom to spare; this phone should feel fast for a few years.\n\nThe XR also has a larger battery than the X and XS, and it ran for about 13 hours in my everyday use of browsing, email, Slack, and various apps, with about 6 hours of screen on time, which is about the same as the XS Max and slightly more than the 8 Plus from last year.\n\nThe battery lasted 13 hours under normal use\n\nThe only major performance difference between the XR and XS is LTE: the XS supports Gigabit LTE speeds, and the XR does not. Gigabit LTE can provide faster network speeds if your carrier supports it, but even if it doesn’t, phones with gigabit are traditionally better at holding onto a connection in weak signal areas. I’m not equipped to test this head-to-head, but if network performance is a concern to you at all, it might be worth spending more for the XS.\n\nI also couldn’t test dual-SIM support, since it’s not available yet, but Apple did show me an XR that was running on both Verizon and AT&T’s networks. We’ll have to test this out much more thoroughly when that feature ultimately ships.\n\nIf one thing is clear about the iPhone XR, it’s that Apple is going to sell tons of these. They’re huge upgrades from the iPhone 6 era of Apple phones, with the latest processors and cameras, a big screen in an updated design, and a competitive opening price of $750 for the 64GB model. That’s $50 less than the smaller Pixel 3. It’s priced to move.\n\nWhen I first picked up the iPhone XR, it felt like the big questions would be about what the XR was missing compared to the XS. But now that I’ve used this thing for a while, that seems like the wrong way to think about it. The real question for iPhone buyers is whether the high-res OLED display on the XS is worth $250 more than the XR. Because otherwise, the XR offers almost everything you’d want in a 2018 phone.\n\nMost people can probably find a better way to spend $250 than on infinite black levels\n\nIf you do care about screens, you can spend $50 more on a Google Pixel 3 and get a better camera and better, smaller display. You can often find the Samsung Galaxy S9 with a high-res OLED screen for less than $700, if you’re willing to compromise slightly on camera quality. And, of course, you can upgrade to the iPhone XS for an extra $250, and get a host of smaller improvements in addition to one of the industry’s best displays.\n\nPersonally, I would pay the extra money for a better OLED screen in a heartbeat because I am extremely picky about displays. But I think most people can find way better ways to spend $250 than on things like infinite black levels and 60 percent wider dynamic range when viewing photos. And in that case, the iPhone XR is a no-brainer upgrade.", "description": "The iPhone XR offers almost the same experience as the iPhone XS with a slightly worse display, for $250 less.", "authors": ["Nilay Patel", "Oct", "Photography Amelia Holowaty Krales", "Video Phil Esposito", "Becca Farsace"], "top_image": "https://cdn.vox-cdn.com/thumbor/8at3jP8VXtGiPPVSjsCgxQbbmWM=/0x50:1280x720/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13318165/maxresdefault__1_.jpg", "published_at": "2018-10-23"}