{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-banks/uk-banks-sign-up-to-u-n-backed-responsible-banking-code-idUKKBN1W32QE", "downloaded_at": "2019-09-18 23:32:16.656152+00:00", "title": "UK banks sign up to U.N.-backed responsible banking code", "language": "en", "text": "LONDON (Reuters) - Britain’s banks will implement U.N.-backed “responsible banking” principles being launched next week that will influence lending and company behaviour, British banking trade body UK Finance said on Wednesday.\n\nFILE PHOTO: British five pound banknotes are seen in this picture illustration taken November 14, 2017. REUTERS/ Benoit Tessier/Illustration/File Photo\n\nThe principles seek to make banking more attuned to the needs of society and the environment. High bonuses and taxpayer bailouts in the financial crisis a decade ago led to a loss of public trust in banking that has yet to be fully regained.\n\n“Environmental risk and opportunity is beginning to reshape the way we look at business planning and economic growth,” UK Finance Chief Executive Stephen Jones will tell the trade body’s annual dinner.\n\n“A broad base of stakeholder interests, from regulators, to investors, employees and customers are increasingly challenging the banking and finance to find more innovative and sustainable ways in which to operate,” he will say, according to prepared remarks.\n\nThe United Nations Environment Programme Finance Initiative principles will be launched during the annual U.N. General Assembly in New York next week.\n\nApplying the principles will shape how financial products are designed and bring environmental and other “sustainability” factors into lending decisions and even the frequency of corporate travel, Jones said.\n\nBritain’s financial sector is facing uncertainty over future access to the European Union, its biggest customer, as the UK readies to leave the bloc next month.\n\nBankers should not take the UK’s leading position as a global financial centre for granted, added UK Finance Chair Bob Wigley.\n\nUK Finance has asked Britain’s government to phase out a levy on bank balance sheets that was introduced after the financial crisis, Wigley said.\n\n“It’s clear that many in our country still need persuading that the measures we seek to maintain and enhance the industry’s future competitiveness are worth it,” Jones will say.\n\n“Our industry takes a lot of abuse. And sometimes – just sometimes – some of us deserve some of it – but at least we are collectively responsible for putting it right when that happens.”", "description": "Britain's banks will implement U.N.-backed \"responsible banking\" principles being launched next week that will influence lending and company behaviour, British banking trade body UK Finance said on Wednesday.", "authors": ["Huw Jones", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190918&t=2&i=1431351795&w=1200&r=LYNXMPEF8H1T2", "published_at": "2019-09-18"}