{"pub": "news.com.au", "url": "https://kidspot.com.au/news/woman-leaves-hairdressing-salon-halfway-through-appointment/news-story/a69add6989f2c7d889d24631fdddfc8d", "downloaded_at": "2019-10-23 16:36:12.615005+00:00", "title": "Woman leaves hairdresser halfway through appointment without paying", "language": "en", "text": "\"Today, we have had a first in our four years as a hair salon.\"\n\nWhen Stephanie decided to use a home hair dye kit, she did not expect the results that followed. Stephanie later discovered her hair was snapping at the ends as she brushed it. Stephanie says she was warned many times that her hair would eventually fall out from over exposure to harsh chemicals, but she never listened. It’s safe to say she probably won’t be dying her hair at home for a long time. Credit: Stephanie Aird via Storyful\n\nIt’s not uncommon to go for walk to grab some food halfway through a hair appointment while the colour is developing.\n\nUnless you’re lucky enough like moi to have a hairdresser who gets whatever you need – including a glass of red from the pub across the road…\n\nBut for James Clarke, who owns No 23 Hair and Beauty Studio in Plymouth, UK, he experienced the most brazen incident in four years of being in business.\n\nAfter a stylist had finished putting in the foils for a woman, booked under the name Helen Lee, said she was \"popping to the shop opposite for some food\".\n\nShe added that she would bring it back to eat at the salon while the colour developed.\n\nHowever, the woman never returned, and proceeded to ignore multiple phone calls when the salon tried to contact her, according to Plymouth Live.\n\nWant to join the family? Sign up to our Kidspot newsletter for more stories like this\n\nThis woman walked out halfway through her colour to \"get some food\" only to never return. Source: No23 Hair and Beauty Studio\n\n\"She booked under the name 'Helen Lee'\"\n\nIn a post on Facebook - which also included a “before” shot of the woman's hair – the salon wrote: \"Today we have had a first in our four years as a hair salon.\"\n\n\"A lady who booked under the name 'Helen Lee' came in for her appointment for a Full Head Tint and Foils and during the development time, after we had applied the tint and foils, she decided to leave saying she was just popping to the shop opposite for some food and would come straight back,” the post said.\n\n\"As we are not in the business of expecting our clients to be dishonest we thought nothing of it. Sadly, she did not return and then proceeded to ignore our calls.”\n\nThe salon then went onto point out how much the heartless act has impacted on the business with the woman dodging to pay for the full-head tint and foils worth £70 ($AUD130).\n\n\"Our stylists are self-employed and when someone receives a service from them they deserve to be paid for it. Incidents like this have a big impact on small independent businesses like ours.”\n\n\"Maybe there was an emergency for her leaving and if so we are sure we will understand.\" Source: Facebook\n\n\"This is beyond shocking, I had to read it twice\"\n\nHowever, they are trying to see that there may be a reasonable explanation for the woman’s mysterious disappearance.\n\n\"We have decided to share this story in the hope that she may read this and decide to contact us to explain her actions. Maybe there was an emergency or some other reason for her leaving and if so we are sure we will understand.\"\n\nNaturally, other clients were shell-shocked that someone could do such a callous thing.\n\nCommenting on the warning, one woman wrote: \"I hope this lady now does the decent thing and pays up.\"\n\n“I can't believe it. If she can't afford she should have just been honest,\" another said.\n\n\"This is beyond shocking, I had to read it twice as couldn’t comprehend why she would do this,\" A third added.\n\nThe appalling incident led the salon calling the police who are now warning other hairdressers in the area to watch out for similar shifty behaviour.", "description": "\"Today, we have had a first in our four years as a hair salon.\"", "authors": ["Leesa Smith"], "top_image": "https://content.api.news/v3/images/bin/9068dd9a834df4a4b2c94787dae8b655", "published_at": "2019-10-22"}