{"pub": "yahoo", "url": "https://news.yahoo.com/solid-gold-toilet-stolen-english-stately-home-003620720.html", "downloaded_at": "2019-09-15 07:47:24.071268+00:00", "title": "Solid gold toilet stolen from English stately home", "language": "en", "text": "It was once displayed at New York's Guggenheim museum and offered on loan to US President Donald Trump (AFP Photo/William EDWARDS)\n\nLondon (AFP) - A gang of thieves on Saturday stole an 18-carat gold toilet from Britain's Blenheim Palace, police said, causing flooding that damaged the world-famous stately home.\n\nThe fully-functioning toilet, dubbed \"America\", was created by Italian artist Maurizio Cattelan and estimated to be worth around £1 million.\n\nA 66-year-old man was arrested following the burglary, which took place before dawn at the 18th-century estate near Oxford, southern England.\n\nThe toilet was one of the star attractions in an exhibition of Cattelan's works that opened on Thursday at the palace, a UNESCO World Heritage Site.\n\nVisitors were able to book time slots to use it -- but only for three minutes each, to limit the queues.\n\nMore than 100,000 people used the loo during the year it was on display at New York's Guggenheim Museum.\n\n\"The offenders broke into the palace overnight and left the scene at about 4.50am (0350 GMT). No-one was injured during the burglary,\" police said in a statement.\n\nDetective Inspector Jess Milne of Thames Valley Police said she believed \"a group of offenders used at least two vehicles\" -- and left a mess behind them.\n\n\"The piece of art that has been stolen is a high-value toilet made out of gold that was on display at the palace,\" she said.\n\n\"Due to the toilet being plumbed into the building, this has caused significant damage and flooding.\"\n\nBlenheim Palace said it was \"saddened by this extraordinary event, but also relieved no-one was hurt\".\n\nIt closed on Saturday but said it would reopen on Sunday.\n\n- No guards -\n\nThe palace is home to the 12th duke of Marlborough and his family, and was also the birthplace of British wartime leader Winston Churchill.\n\nThe duke's brother, Edward Spencer-Churchill, who founded the Blenheim Art Foundation, said last month he was relaxed about security around the gold toilet.\n\n\"It's not going to be the easiest thing to nick,\" he told The Times newspaper.\n\n\"Firstly, it's plumbed in and secondly, a potential thief will have no idea who last used the toilet or what they ate. So no, I don't plan to be guarding it.\"\n\nHe added: \"Despite being born with a silver spoon in my mouth I have never had a shit on a golden toilet, so I look forward to it.\"\n\nCattelan, who is known for his provocative art, has previously described the golden toilet as \"one-percent art for the 99 percent\".\n\nThe Guggenheim had offered the loo on loan to US President Donald Trump, but he declined.\n\nThe Italian artist's exhibition at Blenheim runs until October 27 and includes a taxidermied horse hoisted onto the ceiling of an ornate reception room.\n\nBlenheim has previously hosted exhibitions of work by Ai WeiWei, Yves Klein, Jenny Holzer, Michelangelo Pistoletto and Lawrence Weiner.\n\nPolice said they were looking at CCTV footage to help them in the search for the gold toilet, adding that nothing else was believed to have been stolen.", "description": "A gang of thieves on Saturday stole an 18-carat gold toilet from Britain's Blenheim Palace, police said, causing flooding that damaged the world-famous stately home.  The fully-functioning toilet, dubbed \"America\", was created by Italian artist Maurizio Cattelan and estimated to be worth", "authors": ["Alice Ritchie"], "top_image": "https://s.yimg.com/uu/api/res/1.2/WQCn8exOqfv_icfG0GwNMQ--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/832b3f1fb20f066b49717cd2366e36bbabb7f4c8.jpg", "published_at": "2019-09-14"}