{"pub": "townhall", "title": "Texans looking for property tax relief won’t find much in .09/02/2019 3:17:52AM EST.", "url": "https://townhall.com/watchdog/texas/2017/03/22/texas-property-taxes-sb2-n10499", "language": "en", "published_at": "2017-03-22", "downloaded_at": "2019-09-02 07:17:53.598574+00:00", "text": "Texans looking for property tax relief won’t find much in Senate Bill 2 because lawmakers half-stepped the process.\n\nHomeowners in just 10 of 34 cities and counties would realize any savings under the bill passed by the Senate Tuesday.\n\nThe annual reduction on an average homesteaded property was calculated to range from $12.77 in San Antonio to $81.25 in Bryan, according to an analysis obtained by Watchdog.org.\n\nHomeowners in several metro areas — including Tarrant [Fort Worth] and Nueces [Corpus Christi] — would see no change.\n\nState Sen. Paul Bettencourt, R-Houston, hailed SB 2’s passage, saying his measure would “help slow the growth of future property tax bill increases.”\n\nBut Galveston County Tax Assessor-Collector Cheryl Johnson said promises of reform and relief are exaggerated.\n\n“There is no tax relief in this bill. SB2 is a waste of time for individual homeowners,” declared Johnson, who compiled the study.\n\n“Twenty-one million homeowners will see no relief from SB 2,” she told Watchdog in an interview.\n\nIf Johnson’s assessment is correct, SB 2 could haunt state Republicans, including Gov. Greg Abbott and Lt. Gov. Dan Patrick, for again failing to deliver substantive property-tax relief.\n\nAmid much fanfare, the 2015 Legislature raised the homestead exemption with promises of lower levies, but property tax bills continue to soar.\n\nJohnson said the Republican-dominated Legislature’s piecemeal approach is doomed to fail.\n\n“SB 2 is only one piece of the puzzle, and the GOP will lose elections because of this,” predicted Johnson, a Republican.\n\nUntil appraisals are capped, Johnson said tax bills will keep climbing. So she recommends a complete overhaul.\n\nLawmakers should “freeze everything and rewrite the [tax] code,” said Johnson, who favors a “price-paid” appraisal system to effectively freeze residential taxes while transferring commercial/industrial appraisal responsibilities to the state comptroller.\n\n“That would spread the wealth across the state and equalize education funding. Then we’re done,” she said.\n\n“If we don’t get a cap bill, do [legislators] want to come back in two years and do it all over again? It’s time to man up,” Johnson said.\n\nLawmakers appear more interested in nibbling around the margins, however.\n\nJust before the clock struck midnight, the Senate Finance Committee lifted the lid on tax revenue increases from 4 percent to 5 percent to conform to a softer bill in the House — further eroding whatever small savings taxpayers might receive.\n\nKenric Ward writes for the Texas Bureau of Watchdog.org. Contact him at kward@watchdog.org and follow him on Twitter @Kenricward", "description": "Texans looking for property tax relief won’t find much in .09/02/2019 3:17:52AM EST.", "authors": ["Kenric Ward", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/http://watchdog.org/wp-content/blogs.dir/1/files/2016/01/bettencourt-283x300.jpg"}