{"pub": "euronews", "url": "https://euronews.com/2019/10/25/lebanon-protests-are-bots-fuelling-counter-demonstrations", "downloaded_at": "2019-10-25 21:58:58.007681+00:00", "title": "Lebanon protests: are bots fuelling counter demonstrations?", "language": "en", "text": "A new national identity is being forged in Lebanon. Experts say social media is awash with protesters across the country disregarding allegiances usually vowed to the sect, the leader, the party, or area, in favour of a common cause.\n\nThe country has been rocked by days of anti-government demonstrations, fuelled by worsening economic conditions.\n\n\"This is a country that has been ruled by the same political establishment for decades, that really relies on dividing Lebanese into different sects,\" Omar Al-Ghazzi, an expert on Lebanon from the London School of Economics, told Euronews.\n\n\"And now we see people unite on an anti-corruption message, refusing the political establishment and wanting to change it. It’s not just in the capital, it’s not just a middle-class movement, everyone is using the same hashtags against local leaders.\"\n\nDr Al-Ghazzi added the demonstrations were \"unprecedented in their scope and the extent at which they are unfolding\"/\n\nThe hashtag \"Lebanon rising\" has been widely shared and Chatham House’s Yossi Meckelberg spoke to Euronews about why it had been so popular.\n\n\"what protesters are trying to say is look at the potential for Lebanon, it’s about time we look out for our own country,\" said Professor Meckelberg.\n\nIn the past week a pro-government hashtag has emerged, ‘In Nasrallah We Trust’ employed by supporters of Hezbollah as a counter to the protests.\n\n\"If you look at the hashtags, they are for and against the government but not necessarily across Christian, Shia, Sunni Muslim lines,\" he said.\n\nSo, to what extent can we rely on these hashtags as a true gauge of public sentiment?\n\nTrending hashtags - are they genuine?\n\nAs the counter hashtag continued to trend, some Twitter users in Lebanon began to suspect some accounts tweeting \"In Nasrallah We Trust\" #السيد_نصرالله_ثقتنا may not all be authentic, citing the involvement of bots.\n\nBots are widely used on Twitter; many users extensively follow automated friendly bots across the platform. There’s @TateBot, which randomly Tweets objects from the Tate collection of art, and @netflix_bot which keep users up to up to date on new releases.\n\nHowever, there are more sinister examples of bots used for more malicious purposes. Bots have been infecting political discourse around the world. They have been spotted trying to influence elections in the United Kingdom, Mexico and more recently, the US.\n\nWhat are bots?\n\n\"It’s hard to detect bots, first we don’t have a good definition, it runs the whole spectrum; from completely automated accounts, which is rare, to accounts that are inauthentic,\" Fil Menczer, of the Observatory on Social Media at Indiana University, told Euronews.\n\n\"Where one entity, person or organisation controls many of these accounts, to create the appearance that there are many people supporting or countering an idea or a person.\n\n\"So it’s very easy to use the software of the social media platforms, the APIs, to programmatically control the accounts, but the content itself may sometimes be generated by the humans…’’\n\nMenczer is a co-founder of machine learning tool, Botometer. \"It looks at a Twitter account and tries to determine the likelihood that it uses automation,\" he said.\n\n\"We extract thousands of different features, language, sentiment, the profile name and bio, account age, posting rate, natural mentions, and respecting of circadian rhythms.\"\n\nThis information is then compared to a large number of 10,000 bots, labelled as inauthentic by hand.\n\n\"A high score shows there is a good likelihood the account is automated, a low score, shows it is an organic account.\"\n\nIs the popularity of Lebanon's protest hashtags inflated by bots?\n\nEuronews found numerous accounts tweeting the same hashtag in an identical pattern at similar intervals. We took a sample of accounts tweeting both pro- and anti-government hashtags and ran them through Botometer.\n\nhttps://botometer.iuni.iu.edu Skinner, Helena\n\nOverwhelmingly accounts tweeting \"In Nasrallah We Trust\" had a higher likelihood of displaying automated behaviour.\n\nEuronews showed these suspect Twitter handles to Mike Kearney, an assistant professor at the University of Missouri Informatics Institute. Kearney is developing his own machine learning bot detector.\n\n\"I would say these accounts are likely, or at least they have several indicators that are consistent with accounts that are considered bots or automated,\" he said.\n\n\"In general bot accounts tend to retweet more, and quote and favourite tweets less. They also tend to be younger, less likely to mention others in their profile bio statements,\n\n\"They tend to follow a lot more accounts compared to accounts that follow them, all of those seem to suggest similar numbers to known bot accounts.\"\n\nHowever as Menczer notes: \"But it’s almost impossible to be certain because we don’t know who is behind an account.\"\n\nShould social media companies be doing more to combat bots?\n\n\"It’s relatively easy to set up a new account, Twitter maybe prevents you from doing that with 100 accounts from one computer, but there are ways around that,\" Kearney tells Euronews.\n\n\"There is not really much of a market for finding bot accounts.\n\n\"Bot activities do tend to inflate their activity numbers, which in anything helps their stock price, so the economic interests are not there for it, they do just enough to appear like a responsible company.’’\n\nIn a statement, Twitter told Euronews: \"Coordinated activity and other forms of platform manipulation have no place on our service. We will take robust enforcement action on any accounts that are displaying these behaviors [sic]’’.\n\nAs social movements become increasingly reliant on social media traction, bots are becoming more prevalent and sophisticated.\n\n\"It’s a good rule of thumb not to trust social media as a barometer of public opinion,\" Kearney said.\n\n\"Social media tends to check people that are both technologically inclined and have an opinion on a subject, even if they are real, they generally don't represent public opinion.\"", "description": "As the protests in Lebanon continue, we break down the signs of bot-like activity and explore the difficulty in identifying inauthentic behaviour online.", "authors": ["Helena Skinner"], "top_image": "https://static.euronews.com/articles/stories/04/25/22/12/1000x563_cmsv2_79123a63-0844-5398-a6b7-0830b8a84d05-4252212.jpg", "published_at": "2019-10-25"}