{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7614179/Hilarious-moment-two-middle-aged-motorists-locked-pathetic-road-rage-fight.html", "downloaded_at": "2019-10-25 22:44:01.552300+00:00", "title": "Hilarious moment two middle-aged motorists are locked in 'pathetic' road rage fight", "language": "en", "text": "Two middle-aged motorists have been ridiculed over a 'pathetic' road rage fight - where they both spend several minutes grappling in the street.\n\nThe two drivers had pulled up in front of a traffic light in Bristol on Wednesday afternoon after reportedly being involved in a crash at a roundabout.\n\nIn video of the tussle, the pair start throwing punches at each other - and at one point one of the men falls to his knees and is pushed backwards.\n\nThe two men throw punches at each other after pulling up at a traffic lights in Bristol, following a reported crash\n\nThey continue to grapple with one another along the road - shouting 'come on' and 'let's finish this' - before a pensioner and his dog emerge from a house to intervene.\n\nAn eyewitness said: 'It's just such a pathetic fight. They start getting to grips with one another but it's all very anti-climactic.\n\n'They had been swearing at one another in their cars. I think one of them must have clipped the other at the roundabout.\n\n'They drove down the road still f-ing and blinding then the traffic light turned red and they got out.'\n\nThey continue to grapple with one another along the road - shouting 'come on' and 'let's finish this' - before a pensioner and his dog emerge from a house to intervene\n\nThe pensioner shouts at the pair to 'pack it in' as they continue to grapple on the pavement. The pair are said to have eventually got back into their vehicles and driven off\n\nThe pair are said to have continued fighting for another minute before jumping back into their vehicles and driving off.\n\nThe eyewitness said: 'I got my phone out because it's one of those things that people just wouldn't believe unless they saw it.\n\n'Then when the old man gets out of his house - it's just so funny.\n\n'I think they only decided to call it a day because the traffic was really building up along the road.\n\n'Hopefully they managed to get whatever it was off their chest. It's just the most Bristol thing.'", "description": "The altercation began after the two drivers pulled up in front of a traffic light in Bristol on Wednesday afternoon after reportedly being involved in a crash at a roundabout.", "authors": ["James Wood For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/16/20187538-0-image-a-120_1572018723421.jpg", "published_at": "2019-10-25"}