{"pub": "thehill", "url": "https://thehill.com/blogs/blog-briefing-room/news/467883-native-american-team-sees-huge-turnout-for-game-after-crowd", "downloaded_at": "2019-10-29 15:04:11.655294+00:00", "title": "Native American team sees huge turnout for game after crowd mocked them with war cries", "language": "en", "text": "A Native American high school volleyball team in Arizona saw a huge turnout for a match after it was rescheduled following a crowd mocking them with war cries.\n\nThe Salt River High School Eagles, comprised of all Native American players, attempted to play the Catholic charter school Caurus Academy last week outside of Phoenix, but their coach called off the game for safety reasons after taunts from the crowd.\n\nADVERTISEMENT\n\nThe rescheduled match on Friday gathered a “big turnout,” including security guards who monitored the area, The Arizona Republic\n\nreported\n\n.\n\n“I’ve never had such a big turnout for one game,” Salt River captain Sialik King told The Arizona Republic. “It was very nice to see that us, as indigenous people, could come together for this game.”\n\nThe Eagles lost the match 15-9, which had been moved to the neutral site of Desert Heights Prep Academy.\n\nIn the initially scheduled contest, a Salt River player missed the ball, which prompted a group of boys to taunt the team with tribal war cries, dances and rituals and by yelling “Savages.” Parents reported to the league, the Canyon Athletic Association, that the Caurus fans were carrying out “tomahawk chops,” along with the high school’s cheerleading team, according to The Washington Post.\n\nA witness told the Republic that the referee’s response was, “Boys will be boys.” The Canyon Athletic Association held meetings after the game’s postponement, but no action or decision was made, according to the Republic.\n\nWendy Davison, the assistant principal and athletic director at Caurus, said “something” occurred at the game, but it was not recorded on tape or seen by administrators.\n\n“Those are the facts and we apologize for the fact that there was a disruption or the fact that anybody felt that they could not move forward with the game,” the Republic reported she said.\n\nTaté Walker, a spokesperson for Salt River Schools, said in a statement obtained by the Republic that the incident reflects a wider problem on how Native American students are treated.\n\n“Tuesday’s events go beyond one volleyball game and are indicative of systemic discrimination problems that are difficult for many to acknowledge across the education landscape,” Walker said, “especially when it’s so much easier to claim ignorance. ... There are more conversations to be had.\"", "description": "A Native American high school volleyball team in Arizona saw a huge turnout for a match after it was rescheduled following a crowd mocking them with war cries.", "authors": [], "top_image": "https://thehill.com/sites/default/files/michhighschool_082219_wzzm.jpg", "published_at": "2019-10-29"}