{"pub": "investing.com", "url": "https://ng.investing.com/news/economy/china-ties-agriculture-binge-to-trump-reducing-us-tariffs-65969", "downloaded_at": "2019-10-15 12:32:08.838954+00:00", "title": "China Ties Agriculture Binge to Trump Reducing U.S. Tariffs", "language": "en", "text": "© Reuters. China Ties Agriculture Binge to Trump Reducing U.S. Tariffs\n\n(Bloomberg) -- China will struggle to buy $50 billion of U.S. farm goods annually unless it removes retaliatory tariffs on American products, and doing so would require reciprocal action by President Donald Trump, people familiar with the matter said.\n\nBeijing is willing to start purchasing more U.S. agricultural products as part of the “phase one” trade deal, but it is not likely to reach the $40 billion to $50 billion touted by Trump under current circumstances, the people said. The people asked not to be identified discussing the private negotiations.\n\nThe condition highlights how far apart Washington and Beijing remain, even after reaching the handshake accord touted by the U.S. last week. Washington had said China, which imported about $20 billion of U.S. farm goods in 2017, agreed to make large agricultural purchases in exchange for relief on upcoming tariffs. Beijing’s position makes a deal more complex than initially described.\n\nU.S. equity futures pared gains on the news and the yen extended an advance, as investor optimism waned about prospects for a trade deal between the world’s two largest economies.\n\nUnder the terms of the partial trade arrangement, Chinese spending on U.S. farm goods will scale to an annual figure of $40 billion to $50 billion over two years, Treasury Secretary Steven Mnuchin said earlier. Beijing has in the past granted waivers so that its companies can buy U.S. farm goods without paying Chinese tariffs. It could do that again to get purchases started, the people said. However, waivers are seen as being impractical for volumes as large as $50 billion a year, one of the people said.\n\nChinese firms have bought U.S. agricultural products including 20 million tons of soybeans and 700,000 tons of pork so far this year and will accelerate its purchases, Chinese Foreign Ministry Spokesman Geng Shuang told reporters on Tuesday. Asked about the “phase one” trade deal, he said that what the U.S. said is “accurate” and that the U.S. and China have the same understanding of the situation.\n\nThe two sides are working toward a deal that can be signed at the Asia-Pacific Economic Cooperation summit next month in Chile. China wants further talks as soon as the end of October to hammer out the details, people familiar said separately earlier. Mnuchin also told CNBC he expects officials to work in coming weeks to get the first stage ready for both sides to sign. If that doesn’t happen, new U.S. import levies on Chinese products will be imposed starting Dec. 15, he said.\n\nChina is considering buying a wide array items to boost imports, including soybeans, cereals, cotton, ethanol, fertilizer, juice, coffee and meat, the people said, and it could also lift barriers on distillers dried grains and remove a ban on chicken imports. Machinery, lumber and pesticides could also be added, they said. The people said these purchases would be worth more than $40 billion but said China hasn’t decided on specific values for the items.\n\nChina’s Ministry of Commerce did not immediately respond to a fax seeking comment on potential U.S. farm purchases.\n\nBeijing adopted hefty anti-dumping and anti-subsidy tariffs on U.S. distillers dried grains, a by-product of corn ethanol production that’s used in animal feed, in 2017. Axing the distillers dried grains tariffs would allow China, the world’s biggest buyer, to resume purchases from the top supplier in a trade once worth $2 billion before falling to almost zero. It also still has retaliatory tariffs on products including U.S. soybeans, corn and pork.\n\n(Adds markets in fourth paragraph.)", "description": "China Ties Agriculture Binge to Trump Reducing U.S. Tariffs", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEE5A1SE_L.jpg", "published_at": "2019-10-15"}