{"pub": "washingtontimes", "title": "Labor Day: The start of 2020 'crazy season'", "url": "https://washingtontimes.com/news/2019/sep/1/inside-the-beltway-labor-day-the-start-of-2020-cra", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:31:56.017341+00:00", "text": "Happy Labor Day, and welcome to a pivotal political transition — plus melodrama.\n\n“Labor Day has historically been a reset point for presidential campaigns as the end of summer marks the end of vacations and always means more voters paying attention to the race,” writes Nate Ashworth, founder of Election Central, a political news site that currently has promising news for one Democrat in particular.\n\n“Joe Biden’s demise is greatly exaggerated. Biden’s still in charge for now,” Mr. Ashworth says, noting that his own analysis of assorted polls finds the former vice president still has 30% voter support, particularly from black voters.\n\nNow comes a moment of truth.\n\nThe nation is due for a “Labor Day campaign reset,” Mr. Ashworth predicts.\n\n“After Labor Day, more Americans will be paying much closer attention to the 2020 presidential campaign. The Sept. 12 debate will, for some viewers, be the first time they take a serious look at the Democratic field and begin to form stronger opinions. The prior debates were watched by millions of viewers, sure, but being so early in the process, many voters were still keeping their minds open.”\n\nThe Democratic National Committee has winnowed down a list of 10 candidates who will take to the stage when the third prime-time debate airs on ABC.\n\n“It’s the smallest qualifying roster yet for a debate with 20 candidates still in the running,” the network noted.\n\nMr. Ashworth predicts that the three-way race between Mr. Biden, plus Sens. Elizabeth Warren and Bernard Sanders will tighten, while melodrama erupts among the rest of the rivals.\n\n“We’re entering campaign crazy season when the low-digit candidates must pull out the stops and give it one last-ditch effort to make an impact on the race before their fundraising runs out,” Mr. Ashworth concludes.\n\nPONDERING THE LABOR SHORTAGE\n\nOur old friend “Deep Woods” — a longtime Washington Times reader who indeed lives in the far woods of the Northeast — offers a Labor Day observation on two seemingly unrelated issues: abortion and the U.S. work force. There’s a correlation, he says.\n\n“As the summer winds down here in the north country, I have been reading of and listening to the lamentations of the open border, Chamber of Commerce types — who are wishing for more workers to show up and claim all the unfilled jobs around the nation. Wouldn’t it be great if we had an additional 15,000,000 educated, tax paying, English speaking U.S. citizens? That’s what they say,” Mr. Woods tells Inside the Beltway.\n\n“It occurred to me that we did — and we killed them,” he declares.\n\n“In the 50 years since Roe v. Wade we aborted the lives of 50 million babies. Today about 30,000,000 would be working age, and with a labor participation rate of 60%, about 15,000,000 could have been productive taxpayers in our economy. The unintended — or intended — consequences of abortion on demand. Just saying,” Mr. Woods observes.\n\nPATRICK PIZZELLA’S SUMMATION\n\nOn the nation’s 125th Labor Day, acting Labor Secretary Patrick Pizzella has positive numbers that counter endless news coverage that masks economic gains made by the Trump administration.\n\n“On this Labor Day, more than 157 million Americans are working — the highest number of Americans working ever recorded. 5.7 million jobs have been created since January 2017. Unemployment is at 3.7%, near a 50-year low, and has been at or below 4% for 17 months in a row. This is the lowest unemployment going into a Labor Day since 1969. Year-over-year earnings growth has been at or above 3% for a year straight and is currently 3.2%. There are 7.3 million open jobs and there have been more open jobs than job seekers for 16 straight months,” says Mr. Pizzella.\n\nWHAT THE EMPLOYEES SAY\n\nA nationwide survey of 2,000 U.S. workers reveals they’re feeling better about their jobs than they have in years. So says The Conference Board, which conducted the poll. It found that 54% of workers are satisfied with their employment — up 3 percentage points from similar research conducted in 2018.\n\n“That marks a near-record increase in the survey’s history. Workers also report being much more at ease about their job security. Millennials have experienced a surge in confidence regarding their wages,” the polls analysis said.\n\n“The results, however, include some cautionary signs for management. Amid a strong jobs market where individuals can more easily find new work, survey participants gave weak marks to the most important driver of job satisfaction: their current job’s potential for future growth. In addition, over 60% feel dissatisfied with their organization’s recognition practices, performance review process, and communication channels. Also noteworthy, men generally feel better than women about multiple financial components of their work, including wages and bonus plans.”\n\nLABOR DAY LIBATION\n\nA cocktail, perhaps, for those reluctant to bid goodbye to summer. Behold, the Grilled Peach Cocktail. The recipe is courtesy of Wishfulchef.com.\n\nIngredients: 4 peach wedges, a small amount of olive oil, 2 teaspoons sugar, 2 sprigs fresh thyme, 2 dashes of Angostura bitters, 2 teaspoons Meyer lemon juice, 2 ounces bourbon.\n\nLightly brush olive oil on the cut sides of the peach wedges. Grill all the peach wedges on their sides until charred. Muddle two grilled peach wedges, sugar, thyme, Angostura bitters, Meyer lemon juice and bourbon in a cocktail shaker. Pour into cold, ice-filled glasses. Garnish with remaining peach wedges and thyme sprigs. Yield: two servings.\n\nPOLL DU JOUR\n\n• 10% of full- and part-time U.S. workers belong to a union.\n\n• Of that percentage, 37% of government workers belong to a union.\n\n• 14% of workers with an annual income of $100,000 or more are members of a union.\n\n• 11% of Republicans, 8% of independents and 15% of Democrats are union members.\n\n• 6% of private sector employees are union, as are 3% of those earning under $40,000 per year.\n\nSource: A Gallup poll of 1,294 employed U.S. adults conducted Aug. 1-14 and released Friday.\n\n• Have a productive Labor Day, and thanks for reading Inside the Beltway.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Happy Labor Day, and welcome to a pivotal political transition — plus melodrama.", "authors": ["The Washington Times Http", "Jennifer Harper"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/01/9_1_2019_election-2020-sanders-98201_c0-169-4046-2528_s1770x1032.jpg?d83cb3412166b2df497606b38382c41fde145303"}