{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-global-markets/wall-street-gains-u-s-treasury-yields-fall-after-remarks-by-feds-powell-idUKKBN1X901G", "downloaded_at": "2019-10-30 23:24:36.278929+00:00", "title": "Wall Street gains, U.S. Treasury yields fall after remarks by Fed's Powell", "language": "en", "text": "NEW YORK (Reuters) - Wall Street gained ground and U.S. Treasury yields fell on Wednesday after the Federal Reserve signaled a pause in the current easing cycle following the expected announcement of a rate cut.\n\nA trader works on the floor at the New York Stock Exchange (NYSE) in New York, U.S., October 30, 2019. REUTERS/Brendan McDermid\n\nAt the conclusion of its two-day monetary policy meeting, the Fed cut key interest rates for the third time this year. “We believe that monetary policy is in a good place,” Fed Chair Jerome Powell said in a news conference.\n\nThe Fed’s “description of the economy was a little stronger than I would have thought,” said Kathy Jones, chief fixed income strategist at the Schwab Center for Financial Research in New York. “The labor market is strong, job gains solid, household spending rising at a solid pace – all that would indicate that they’re emphasizing that everything is good right now.”\n\nRick Meckler, partner at Cherry Lane Investments, a family investment office in New Vernon, New Jersey, agreed the Fed seemed unlikely to cut rates again soon.\n\n“The market wants to see slow steady progress in the expansion of the economy,” Meckler said. “That’s the picture (Powell) painted.”\n\n“There isn’t a sense of panic in what (the Fed’s) doing,” Meckler added. “That’s encouraging for the market.”\n\nStocks retraced losses from earlier, when a spate of mixed corporate earnings and a decline in the U.S. GDP growth rate kept investors cautious.\n\nThe Commerce Department’s advance reading of third-quarter GDP USGDPA=ECI showed the U.S. economy expanded at a 1.9% annual rate, down from 2% in the second quarter but beating the 1.6% growth rate analysts expected.\n\nThe Dow Jones Industrial Average .DJI rose 115.27 points, or 0.43%, to 27,186.69, the S&P 500 .SPX gained 9.88 points, or 0.33%, to 3,046.77 and the Nasdaq Composite .IXIC added 27.12 points, or 0.33%, to 8,303.98.\n\nThe pan-European STOXX 600 index rose 0.08% and MSCI’s gauge of stocks across the globe .MIWD00000PUS gained 0.23%.\n\nHowever, emerging market stocks lost 0.10%. MSCI's broadest index of Asia-Pacific shares outside Japan .MIAPJ0000PUS closed 0.11% lower, while Japan's Nikkei .N225 lost 0.57%.\n\nThe U.S. Treasury yields dropped following the Fed’s announcement.\n\nBenchmark 10-year notes US10YT=RR last rose 18/32 in price to yield 1.7715%, from 1.835% late Tuesday.\n\nThe 30-year bond US30YT=RR last rose 53/32 in price to yield 2.2535%, from 2.331% late Tuesday.\n\nThe dollar inched lower against a basket of major world currencies.\n\nThe dollar index .DXY fell 0.18%, with the euro EUR= up 0.3% to $1.1143.\n\nThe Japanese yen strengthened 0.04% versus the greenback at 108.85 per dollar, while Sterling GBP= was last trading at $1.2896, up 0.24% on the day.\n\nOil prices fell on worries about a possible delay in resolving the U.S.-China trade war, which has hurt global oil demand.\n\nU.S. crude oil futures settled at $55.06 per barrel, a 0.86% drop, while Brent crude oil futures fell 1.59% to settle at $60.61 per barrel.\n\nSlideshow (6 Images)\n\nGold prices rose, overcoming earlier losses.\n\nSpot gold XAU= added 0.6% to $1,495.60 an ounce.\n\nCopper CMCU3 lost 0.68% to $5,887.00 a tonne.", "description": "Wall Street gained ground and U.S. Treasury yields fell on Wednesday after the Federal Reserve signaled a pause in the current easing cycle following the expected announcement of a rate cut.", "authors": ["Stephen Culp", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191030&t=2&i=1446587505&w=1200&r=LYNXMPEF9T1H3", "published_at": "2019-10-30"}