{"pub": "politico", "url": "https://politico.com/news/2019/10/25/tulsi-gabbard-wont-run-congress-reelection-2020-057222", "downloaded_at": "2019-10-25 16:05:30.407430+00:00", "title": "Gabbard says she won't run for reelection to Congress in 2020", "language": "en", "text": "Gabbard, who has represented Hawaii's 2nd Congressional District since 2013, handily defeated her Republican opponent in last year’s midterm elections by a margin of more than 50 percent.\n\nBut her path to winning a fifth term in 2020 was complicated by a formidable primary challenge from state Sen. Kai Kahele, as well as her thorny relationships with other Aloha State politicians.\n\nA trio of former Hawaii governors have backed Kahele’s bid to unseat Gabbard, and she ignited a feud with Sen. Mazie Hirono after authoring an op-ed in January accusing Democrats on the Senate Judiciary Committee of “religious bigotry” in their questioning of a nominee for a district judgeship.\n\nHirono, a member of that panel who previously held Gabbard’s House seat, criticized the congresswoman and called her assertions “totally unfounded” during an interview in March.\n\nGabbard’s decision is also likely to stoke speculation that she is considering mounting a third-party presidential campaign, especially amid her high-profile clash over the past week with 2016 Democratic nominee Hillary Clinton.\n\nThe former secretary of State has controversially suggested that Russian operatives are “grooming her to be the third-party candidate,” remarks which provoked a fierce rebuke from Gabbard and a defense of the Democratic candidate by President Donald Trump.\n\nSeveral of Gabbard’s former rivals in the Democratic nominating contest have returned to their day jobs on Capitol Hill since exiting the race, including New York Sen. Kirsten Gillibrand, Massachusetts Rep. Seth Moulton, Ohio Rep. Tim Ryan and California Rep. Eric Swalwell.\n\nGillibrand is not up for reelection until 2024, and the three congressmen have all said they will seek another term in next year’s election.", "description": "", "authors": [], "top_image": "https://static.politico.com/cc/42/ce0d05e649158f6ff7c631f0479c/190924-tulsi-gabbard-gty-773.jpg", "published_at": "2019-10-25"}