{"pub": "yahoo", "url": "https://investors.com/market-trend/stock-market-today/dow-jones-futures-apple-earnings-facebook-earnings-fed-rate-cut-stock-market-rally/?src=A00220&yptr=yahoo", "downloaded_at": "2019-10-30 23:30:40.786001+00:00", "title": "Dow Jones Futures: Apple Earnings, Facebook Earnings Strong After Fed Rate Cut Fuels Stock Market Rally", "language": "en", "text": "Dow Jones futures rose modestly late Wednesday, along with S&P 500 futures and Nasdaq futures, as Apple stock and Facebook stock rallied on earnings. The stock market rally had modestly positive gains Wednesday even after policymakers signaled no more Fed rate cuts. In addition to Apple (AAPL) and Facebook (FB), Starbucks (SBUX), Twilio (TWLO) and Universal Display (OLED) reported earnings after the close.\n\nX\n\nApple stock and Starbucks stock were modestly higher in late trading. Facebook stock jumped, signaling a move above an aggressive buy point. Universal Display stock spiked. Twilio stock plunged.\n\nDow Jones Futures Today\n\nDow Jones futures rose 0.1% vs. fair value. S&P 500 futures climbed 0.15% and Nasdaq 100 futures 0.4%. Apple is the world's most valuable company and a member of the Dow Jones, S&P 500 index and Nasdaq composite, while Facebook stock is an S&P 500 and Nasdaq megacap.\n\nRemember that overnight action in Dow futures and elsewhere doesn't necessarily translate into actual trading in the next regular stock market session.\n\nCurrent Stock Market Rally\n\nThe current stock market rally erased slim losses and turned modestly positive following the latest Fed meeting. Policymakers voted for a third straight Fed rate cut, but signaled that they would likely be on hold . And Fed chief Jerome Powell said inflation would have to surge to spur a Fed rate hike.\n\nThe Dow Jones Industrial Average rose 0.4%, while the S&P 500 index and the Nasdaq composite advanced 0.3%.\n\nAmong the best ETFs, the Innovator IBD 50 ETF (FFTY) rose 0.2%. The iShares Expanded Tech-Software Sector ETF (IGV) rallied 1.7%. The VanEck Vectors Semiconductor ETF (SMH) edged up 0.1% amid mixed chip earnings.\n\nThe S&P 500 index hit a record high Wednesday. The Nasdaq and Dow Jones today are within 1% of their July all-time bests. Dow Jones futures and Nasdaq futures suggest that those indexes are going to continue their march.\n\nApple Earnings\n\nApple earnings rose 4% to $3.03 a share as revenue edged up nearly 2% to $64.04 billion. Analysts expect Apple earnings to fall 2% to $2.84 a share, with revenue edging down 0.7% to $62.45 billion.\n\nApple guided higher on revenue for the holiday quarter.\n\nOn Friday, Apple will launch its Apple TV+ streaming service.\n\nApple stock advanced almost 2% late. Shares closed down 3 cents to 243.26. Apple stock hit a record 249.75 intraday Tuesday. Apple stock is extended from its 221.47 flat-base buy point.\n\nThe relative strength line for Apple stock hit a record high this week.\n\nFacebook Earnings\n\nFacebook earnings rose 20% to $2.12 a share. Revenue climbed 29% to $17.65 billion, with growth accelerating slightly for a second straight quarter. That follows two quarters of Facebook earnings declines, though that reflected big legal charges. Analysts expected Facebook earnings of $1.91 a share on revenue of $17.36 billion.\n\nFacebook daily active users rose to 1.62 billion.\n\nFacebook stock rose 4.4% to 196.55. Shares closed down 0.6% to 188.25. Facebook stock is working on a 208.76 buy point from a consolidation. But aggressive investors could treat 193.20 as an early entry for Facebook stock.\n\nThe RS line for Facebook stock has been sliding during most of its recent consolidation and is well off its July 2018 peak.\n\nUniversal Display Earnings\n\nUniversal Display earnings leapt 62.5% to 78 cents a share. Revenue shot up 26% to $97.5 million. Analysts expected Universal Display earnings of 57 cents a share on sales of $85 million.\n\nUniversal Display also guided higher.\n\nUniversal Display stock spiked 15% late. Shares closed down 0.8% to 173.65. Universal Display stock is signaling a gap above its 50-day line, but is a long way from a potential buy point of 230.42.\n\nTwilio Earnings\n\nTwilio earnings came in at 3 cents a share as revenue soared 75% to $295.1 million. Analysts expected Twilio earnings of 1 cent on sales of $287.8 million\n\nBut Twilio guided low on the current Q4, including EPS of 1-2 cents. Wall Street was looking for Twilio earnings of 7 cents a share.\n\nTwilio stock fell 6.9% late after initially suffering a double-digit loss. Shares had closed up 2.5% to 107.70, as many beaten-down software stocks had a strong day. Twilio stock is signaling an open at its lowest level since January.\n\nStarbucks Earnings\n\nStarbucks earnings rose 13% to 70 cents a share in its fiscal Q4. Revenue grew 7% to $6.75 billion. Global same-store sales rose 5%, with comps up 6% in the Americas\n\nWall Street expected Starbucks earnings per share of 70 cents on revenue of $6.658 billion. Comps were seen up 4%, with Americas comps up 4.5%.\n\nStarbucks gave solid guidance on 2020 comps, though its EPS outlook was a little light.\n\nStarbucks stock rallied 2.7% late. Shares closed up 0.1% to 84.19, stuck between their 50-day and 200-day lines.\n\nPlease follow Ed Carson on Twitter at @IBD_ECarson for stock market updates and more.\n\nYOU ALSO MIGHT LIKE:\n\nThe Big Picture: Stock Market Cheers Another Fed Rate Cut\n\nFed Signals No More Rate Cuts, But Dow Rallies On This\n\nThese Economic Bellwether Stocks Dive As Earnings Raise Red Flags\n\nBest Growth Stocks To Buy And Watch: See Updates To IBD Stock Lists\n\nIBD Digital: Unlock IBD's Premium Stock Lists, Tools And Analysis Today", "description": "Dow Jones futures: Apple earnings and Facebook earnings beat after a Fed-fueled stock market rally. Apple stock rose. Facebook stock moved over a buy point.", "authors": ["Investor'S Business Daily", "Ed Carson"], "top_image": "https://www.investors.com/wp-content/uploads/2019/09/STOCK-apple-092019-shutter.jpg", "published_at": "2019-10-30"}