{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7631227/Canadas-Trudeau-change-survive-parliamentary-minority.html", "downloaded_at": "2019-10-30 16:13:47.570415+00:00", "title": "Canada's Trudeau must change to survive with...", "language": "en", "text": "By David Ljunggren and Steve Scherer\n\nOTTAWA, Oct 30 (Reuters) - Canada's Liberal Prime Minister Justin Trudeau, who only narrowly won last week's national election, must overhaul his approach to governing to guarantee the support of other parties to stay in power, officials and experts say.\n\nBattered by a corporate corruption scandal and the emergence of pictures of him wearing blackface, Trudeau came up 13 seats shy of a majority though he won more than any other party. Afterward, he said he would govern by seeking opposition support on a case-by-case basis.\n\n\"We need to draw the lessons from the election and take a conciliatory tone. And we will do that,\" said a Liberal strategist who requested anonymity.\n\nDuring his first term, Liberal insiders complained Trudeau was aloof and handed off some day-to-day government work to a small group of loyal advisers. The corruption scandal showed him to be out of touch even with some of his own ministers.\n\nTo fulfill the Liberal agenda - which Trudeau has said will include a middle-class tax cut, action against climate change and measures to make Canadian life more affordable - he will have to play nice with rival parties so that they do not gang up to bring him down, while maintaining a tight grip on his own.\n\n\"(Trudeau) should be able to cobble together a working majority for any particular agenda item,\" said Peter Van Loan, who was house leader for a Conservative minority government.\n\nA government source said the prime minister \"is reflecting on the results and on the path forward\" but declined to comment when asked whether Trudeau would take a new approach.\n\nHistorical evidence suggests Trudeau's task will not be easy. There were three consecutive minority governments from 2004 to 2011 - one Liberal and two Conservative - and none lasted more than 2-1/2 years.\n\n\"(Liberals) need to change how they do their business. If they continue as usual, it's sending a signal that they haven't really been listening to anybody,\" said Libby Davies, who was house leader for the smaller left-leaning New Democratic Party (NDP) for all three of those governments.\n\n\"Not only the leaders, but the key people around them have got to look at this different political environment,\" she said in an interview.\n\nThe most obvious partner for Trudeau is the NDP, which won 24 seats, because it shares much of the Liberals' agenda and is so cash-strapped it cannot afford to fight another election soon.\n\nTrudeau said he will unveil his cabinet on Nov. 20. His first task will be to present his priorities for the new legislature in the so-called Speech from the Throne, which is followed by a confidence vote.\n\nOne key indicator of potential change will be who Trudeau appoints as house leader, the person in charge of maintaining ties with other parties. In a minority, this is a crucial job and can be the secret to staying in power.\n\nAnother critical position is that of caucus chair. Backbench Liberal legislators, who long complained privately they had little one-on-one access to Trudeau, now have more influence.\n\n\"You will see caucus meetings that are more robust, that are more frank. He needs to be glued to that caucus,\" said Peter Donolo, a former Liberal chief of staff from 2009 to 2011.\n\nBy coincidence Trudeau's father, Liberal Prime Minister Pierre Trudeau, found himself in almost the same position in 1972 when he won a minority and had to rely on the NDP for two years.\n\n\"He brought in some old professionals to run his office and he actually engaged with people and became a much more proficient political leader,\" said Donolo, now vice chair of public relations firm Hill and Knowlton.\n\nPart of the skill in keeping a minority alive is knowing when to make concessions.\n\nFormer NDP leader Ed Broadbent, who was caucus chair from 1972 to 1974, said his party threatened to bring down the government unless it introduced legislation to set up state-owned oil firm Petro-Canada.\n\nPierre Trudeau relented and then went on to win a majority in 1974, remaining in power for almost another decade.\n\n\"He (Justin Trudeau) has got to learn to listen more,\" Broadbent said in an interview, adding: \"He has to very much have a more hands-on approach than he has had.\"\n\n(Reporting by David Ljunggren and Steve Scherer; Editing by Lisa Shumaker)", "description": "By David Ljunggren and Steve SchererOTTAWA, Oct 30 (Reuters) - Canada's Liberal Prime Minister  Justin Trudeau, who only narrowly won last week's national ...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-30"}