{"pub": "dailybeast", "url": "https://theintercept.com/2017/04/21/portland-executive-covertly-donates-1-million-to-inauguration-after-being-shamed-over-trump-support", "downloaded_at": "2019-10-08 15:01:46.131685+00:00", "title": "Portland Executive Covertly Donates $1 Million to Inauguration After Being Shamed Over Trump Support", "language": "en", "text": "As soon as word got out that prominent Portland hotel executive Gordon Sondland’s name was on the list of hosts for a Donald Trump fundraiser last year, Sondland withdrew from the event, citing through his spokesperson irreconcilable differences between Trump’s anti-Muslim nativist politics, the Sondland family history of fleeing persecution in Nazi Germany, and the experience of his hotel company president Bashar Wali, “a Muslim American who emigrated to this country from Syria.”\n\n“Historically, Mr. Sondland has been supportive of the Republican party’s nominees for President,” Kate Buska, the spokesperson for Sondland’s Provenance Hotels, told Willamette Week at the time. “However, in light of Mr. Trump’s treatment of the [Khizr and Ghazala] Khan family and the fact his constantly evolving positions diverge from their personal beliefs and values on so many levels, neither Mr. Sondland or Mr. Wali can support his candidacy.”\n\nSo when Sondland decided to give a million dollars to the Trump inaugural committee, he didn’t use his own name.\n\nHe used four limited liability companies instead.\n\nThe donations were made through BV-2 LLC, Dunson Cornerstone LLC, Buena Vista Investments LLC, and Dunson Investments LLC — all companies registered to Sondland, according to public records. The address of the LLCs matches the address of a home owned by Sondland, which he has used in the past to host a Republican fundraiser.\n\nA man who answered Sondland’s cell phone hung up when asked to explain the donation and apparent reversal. Buska, Sondland’s spokesperson, said, “I have no comment.”\n\nThe contributions were first flagged by the Center for Responsive Politics and a Twitter-crowdsourced investigation of Trump’s inauguration donors maintained by Huffington Post reporter Christina Wilkie.", "description": "Gordon Sondland distanced himself from a Trump fundraiser he was listed as hosting last year. When he gave $1 million to Trump's inaugural, he didn't use his name.", "authors": [], "top_image": "https://theintercept.imgix.net/wp-uploads/sites/1/2017/04/portland-donation-trump-inauguration-1492806504.jpg?auto=compress%2Cformat&q=90&fit=crop&w=1200&h=800", "published_at": "2017-04-21"}