{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7592917/Ripped-Australians-rippling-muscles-bodybuilding-championships-Melbourne.html", "downloaded_at": "2019-10-20 12:38:12.339247+00:00", "title": "Ripped Australians show off their rippling muscles at bodybuilding championships in Melbourne", "language": "en", "text": "Advertisement\n\nAustralia's leading bodybuilders have slapped on the oil and slipped into their Speedos and bikinis to strut their stuff at the IFBB Australian Bodybuilding Championships.\n\nThe national championships were held at the Plenary in the Melbourne Convention and Exhibition Centre on Sunday and showcased rippling muscles.\n\nCompetitors were judged on their symmetry, mass, size and all important stage presence before winners were crowned in each category.\n\nCompetitors pose in the Wellness Novice section during the IFBB Australian Bodybuilding Championships at the Plenary in Melbourne\n\nMale competitors pose in tight underwear during the IFBB Australian National Championships\n\nMuscular competitors going head-to-head during the IFBB Australian National Championships\n\nEager bodybuilders can be seen preparing backstage, lifting more weights to make sure their muscles really pop.\n\nWomen flaunted their sculpted bodies in sequined, bright bikinis as they strutted their stuff on stage, hoping to impress the judges.\n\nTattooed former champion Belinda Cracknell, 49, showed off her biceps during her backstage workout.\n\nBelinda Cracknell (pictured) prepares backstage for the Women's Physique section during the IFBB Australian Bodybuilding Championships\n\nBelinda Cracknell (pictured) lifts weights while preparing backstage for the Women's Physique section\n\nFemale competitors work out backstage\n\nBodybuilders can be seen getting doused in fake tan prior to the competition.\n\nFemale contestants competed in a range of categories, including physique, bikini, and wellness.\n\nMale competitors went head to head in a series of weight and age-based categories.\n\nMale competitors prepare backstage. One bodybuilder can be seen getting doused in fake tan prior to the competition\n\nMale competitors work out in preparation for the competition backstage\n\nBodybuilders flex their muscles backstage before the competition\n\nOne female bodybuilder walking around backstage before the competition\n\nA woman in a sparkly bikini liftf weights backstage\n\nWoman work out in preparation for the bodybuilding championships\n\nDuring showtime, all competitors stepped out on stage an flexed their strength for the judges, letting their muscles shine.\n\nMen were judged in different outfits, depending on the category.\n\nSome wore tight black underwear, while others wore bright metallic undergarments.\n\nMuscly men posing during the bodybuilding competition\n\nMen in sparkly underwear posing for the judges on stage\n\nMale bodybuilders flexing their biceps in black undergarments\n\nMale bodybuilders posing for the judges on stage during the compeition\n\nThe judges are seen during the IFBB Australian Bodybuilding Championships", "description": "Australia's leading bodybuilders have slapped on the oil and slipped into their Speedos and bikinis to strut their stuff at the IFBB Australian Bodybuilding Championships.", "authors": ["Lauren Ferri", "Charlotte Karp For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/06/19947856-0-image-a-48_1571550182724.jpg", "published_at": "2019-10-20"}