{"pub": "indiatimes", "url": "https://indiatimes.com/entertainment/science-says-bella-hadid-is-world-s-most-beautiful-woman-her-features-are-close-to-perfection-378023.html", "downloaded_at": "2019-10-17 11:59:05.826373+00:00", "title": "Science Says Bella Hadid Is World’s Most Beautiful Woman & Her Features Are Close To Perfection", "language": "en", "text": "Science Says Bella Hadid Is World’s Most Beautiful Woman & Her Features Are Close To Perfection\n\nScience Says Bella Hadid Is World’s Most Beautiful Woman & Her Features Are Close To Perfection\n\nHow do you evaluate beauty? We all have learnt that it lies in the eye of beholder and that there’s no science behind that, right? Wrong!\n\nvia GIPHY\n\nApparently, one can calculate beauty and there are standards to calculate the same. Like Jesse Pinkman said in Breaking Bad, it’s science, bi**ch!\n\nvia GIPHY\n\nGoing by the Golden Ratio of Beauty Phi Standards, scientist evaluated as to who is the most beautiful woman on the planet and they came up with one name – supermodel Bella Hadid.\n\nTwitter\n\nHer face, scientists say is close to perfection. Her face is 94.35 per cent perfect, according to Golden Ratio of Beauty Phi parameters, which define beauty in accordance with the Greek calculations.\n\ndailymail.co.uk\n\nHow are the measurements performed? Measurements of facial proportions are done on the basis of the standards that Greek scholars applied while they were trying to define beauty.\n\nWho is second on the spot?\n\nwikimedia.org\n\nDon't Miss 31.3 K SHARES 3.2 K SHARES 280 SHARES 258 SHARES 3.8 K SHARES\n\nPop icon Beyonce is at the second spot with 92.44 percent perfection.\n\nTwitter\n\nActress Amber Heard is at number three with a ratio of 91.85. Ariana Grande is placed at fourth spot with 91.81 per cent.\n\nThe measurements were conducted by Dr Julian De Silva, an eminent facial cosmetic surgeon at London's famous Harley Street. \"Bella Hadid was the clear winner when all elements of the face were measured for physical perfection. She had the highest overall reading for her chin which, with a score of 99.7 per cent, is only 0.3 per cent away from being the perfect shape, \"Dr Julian told The Daily Mail.", "description": "Going by the Golden Ratio of Beauty Phi Standards, scientist evaluated as to who is the most beautiful woman on the planet and they came up with one name – supermodel Bella Hadid. Her face, scientists say is close to perfection. Her face is 94.35 per cent perfect, according to Golden Ratio of Beauty Phi parameters, which define beauty in accordance with the Greek calculations.", "authors": ["Garima Satija"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/science_says_bella_hadid_is_worlds_most_beautiful_woman__her_features_are_close_to_perfection_1571309563_800x420.png", "published_at": "2019-10-17"}