{"pub": "yahoo", "url": "https://investopedia.com/articles/markets/121515/3-best-stocks-buy-and-hold-and-never-let-go-wmt-jnj-aapl.asp?utm_campaign=quote-yahoo&utm_source=yahoo&utm_medium=referral&yptr=yahoo", "downloaded_at": "2019-10-25 16:44:05.712824+00:00", "title": "The 3 Best Stocks to Buy and Hold (Forever)", "language": "en", "text": "Buy and hold has been an investment strategy used for centuries. Unfortunately, the rise of high-frequency trading (HFT), greater volatility in the markets and the recession of 2008 seem to have stripped buy and hold of its allure. While the market’s new normal does not favor those who do not keep close tabs on their investments, strategic buy and hold is still a viable strategy that can be used with success.\n\nInvestors looking for buy-and-hold-forever stocks should be looking at large- and mega-cap stocks, rather than the smaller, more speculative market caps. Large-cap stocks tend to have lower betas, which is a measurement of volatility as compared to the overall market. A beta below 1 means the stock is less volatile than the overall market, and a beta over 1 means the stock is more volatile than the overall market. For the purposes of buying and holding, low beta is key – as are dividend distributions.\n\nKey Takeaways For most investors, buying and holding a diversified portfolio of stocks has been sound advice.\n\nThose who have a buy-and-hold mentality but want a bit more control over their particular investments may want to consider selecting individual stocks that can proxy for large swaths of the market.\n\nThese mega-cap companies include Wal-Mart in retail, Johnson & Johnson in consumer products and healthcare, and Apple in technology and internet.\n\nWal-Mart Stores, Inc.\n\nWal-Mart Stores, Inc. (NYSE: WMT) is a retail powerhouse and a leader in the big box retailer space. In 2015, it had one of its worst years in decades, as its stock fell over 35% on Amazon's exceptional returns and the cost of raising minimum wage.\n\nAt the beginning of 2015, Wal-Mart announced it would raise the minimum wage for its workers to $9 earlier in the year and $10 in 2016. For 2015, the minimum wage hike will cost Wal-Mart $1.2 billion. Aside from wage hikes, Wal-Mart is continuing to spend vast amounts of money on its e-commerce presence to counter Amazon.com and its online retailer dominance. Wal-Mart also hinted at starting and expanding a drone delivery service, similar to what Amazon has stated it is going to use. As of October 2018, Wal-Mart has an exceptional beta of 0.26 and a dividend yield of 2.05%\n\nWal-Mart went through a period of overexpansion in a bid to contest with Amazon, whose stock price rose an astonishing 465% since 2013. Wal-Mart's 35% rise during the same time period looks paltry in comparison, but the consistent dividends – and massive market share – has the company retaining their edge. The retailer is going through a rough patch but will no doubt be able to regain its footing. If you had invested $100 in Wal-Mart back on Jan. 13, 1978, you would have seen a massive 1,610x return on your investment. Their stability in the marketplace makes Wal-Mart a good buy almost any time.\n\nJohnson & Johnson\n\nJohnson & Johnson (NYSE: JNJ) is the next buy-and-hold forever candidate because health care is not going anywhere, and investors love the dividend reinvestment levels they achieve JNJ. Additionally, with health costs continuing to rise year after year, the health care sector is certainly a good candidate for allocation into a buy-and-hold-forever portfolio. JNJ operates a consumer segment, a pharmaceutical segment and a medical device segment. One enticing aspect of JNJ is the fact that the company’s consumer segment is sort of a diversification away from traditional healthcare, albeit a profitable one.\n\nWithin the consumer segment, JNJ sells brands such as Aveeno, Clean & Clear, Dabao, Johnson’s, Neutrogena, Listerine, Lubriderm, Band-Aid, Benadryl, Sudafed, Tylenol and Pepcid. It is a provider of many popular over-the-counter (OTC) medications in addition to skin care products and feminine hygiene products. These products help Johnson & Johnson remain a leader in the healthcare field. Additionally, JNJ continues to develop its pharmaceutical and medical device segments to entice hospitals and surgery centers with new equipment. As of October 2018, Johnson & Johnson has a beta of 0.53 and a dividend yield of 2.56%.\n\nOverall, Johnson & Johnson is an excellent candidate for the buy-and-hold portfolio because of its diverse businesses. The company’s medical device and pharmaceutical segments provide more traditional healthcare exposure, while the consumer segment provides it with a hedge. Johnson & Johnson shares swung heavily in 2018 and in November are hovering at their January hi. Buy and hold forever pundits of JNJ in their early years in Jan. 13, 1978, who held through 2015, would have seen a 20,230% return on their initial investment.\n\nApple, Inc.\n\nApple, Inc. (NASDAQ: AAPL) is one of the world’s leading consumer electronics companies and one of the largest corporations overall, with a market cap over $1 trillion. Apple’s story and past are widely known and respected by technology lovers and investors. Apple’s product lineup of the Apple Watch, MacBooks, iMacs, iPhone, iPads, iPods and Apple TV has captivated the world, as it seems mile-long lines form for new product releases even when those products are on their 7th, 8th, or 10th model. As of October 2018, Apple had a period of instability with a beta of 1.27 and a dividend yield of 1.31%.", "description": "There are certain characteristics and reasonings behind stocks that are suitable for investors to buy – and hold – throughout the life of their portfolios.", "authors": ["Matt Rego"], "top_image": "https://www.investopedia.com/thmb/9nCdHziC2lGLD77-K_Low0R_NmA=/1535x1952/filters:fill(auto,1)/GettyImages-932632466-c078331d45ac4ef398b4959e7cb7bead.jpg", "published_at": "2019-10-25"}