{"pub": "politico", "url": "https://politico.eu/article/brexit-britain-politics-doesnt-have-to-be-hostile", "downloaded_at": "2019-09-29 05:03:21.390346+00:00", "title": "Brexit Britain politics doesn’t have to be this hostile", "language": "en", "text": "Brexit rhetoric is too hostile, says MP Tracy Brabin | Isabel Infantes/AFP via Getty Images Opinion Brexit Britain politics doesn’t have to be this hostile Tracy Brabin, who took over Jo Cox’s seat after the Labour MP was murdered, appeals to Boris Johnson to tone down his rhetoric.\n\nBATLEY, England — My life journey jumped track on October 20, 2016, when I went from freelance writer and actor to the new MP of my hometown of Batley and Spen.\n\nIt wasn’t a career change I had imagined, even as a long-standing member of the Labour Party and a regular campaigner, spending time on the trail with my predecessor Jo Cox during her election campaign in 2015.\n\nI never expected that, when tragedy struck and Jo was shot and stabbed while working in the constituency just before the U.K.'s 2016 referendum, I would be the one to step forward and try to pick up the pieces left by my friend’s horrific murder.\n\nDuring my acting career I developed a thick skin. I grew able to brush off being told I wasn’t good enough. But even this didn’t prepare me for the levels of hate and abuse directed at me and my colleagues on a daily basis after I was voted in as MP.\n\nSince he became prime minister, Boris Johnson has fanned the flames of an already overheated debate, with his repeated use of callous phrases such as “traitor,” “Surrender Bill” — in reference to the Benn Act, a new law designed to block a no-deal Brexit — and “betrayal.”\n\nHis rhetoric has rubbed off on the public, with MPs getting death threats and ever-increasing torrents of abuse. Although this has happened since I first took office, the frequency and tone of these threats has intensified under Johnson's leadership. It will only get worse while the prime minister continues to behave in this way.\n\nIn the age of social media, certain sections of society feel increasingly entitled to be relentlessly abusive. People call me a traitor, a b*tch, a failed actress. Abusive messages have increased four-fold in recent days, and police officers recently spent hours in my constituency office after I was sent threatening messages.\n\nHow the prime minister behaves rubs off on the public. Calling Dewsbury MP Paula Sherriff’s heartfelt concerns about her safety “humbug,” and consistently calling the Benn Act a “Surrender Bill” has consequences.\n\nIn Batley and Spen, we know the impact using dangerous language can have.\n\nI have always aimed to be an open and accessible MP. I held meetings for constituents in libraries around Batley and Spen to make it easy for people to get in touch. I have never shied away from bookings which, on the face of it, are like walking into the lion’s den.\n\nBut due to the deteriorating atmosphere, these open meetings had to stop under stern security advice. My sessions for constituents are now by appointment only, behind closed doors. I hold more on evenings and weekends, but it’s not the same.\n\nStill, I remain optimistic. If the prime minister and his supporters change their tune, things can get better. The lovely messages of support and solidarity still far outweigh the abuse.\n\nAll I ask of him is to moderate his language and make politics a less hostile environment. This will have an impact on the wider public, too.\n\nMPs from the north of England are not traitors. We just want the best for our constituents.\n\nBatley and Spen voted to leave the European Union, but a lot of people also voted Remain. A no-deal Brexit would be incredibly damaging for our communities, and however you voted, you didn’t vote to be poorer.\n\nWe Brits pride ourselves on the global stage for our manners, politeness and courtesy. My hope is that by leading by example the prime minister can bring these values back to British politics. That way we can all work together to give Britain the best future possible.\n\nTracy Brabin is the member of parliament for Batley and Spen.", "description": "Tracy Brabin, who took over Jo Cox’s seat after the Labour MP was murdered, appeals to Boris Johnson to tone down his rhetoric.", "authors": ["Tracy Brabin", "Emilio Casalicchio", "Charlie Cooper", "Paul Dallison"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/09/GettyImages-1167024527-1200x628.jpg", "published_at": "2019-09-27"}