{"pub": "investing.com", "url": "https://ph.investing.com/news/commodities-news/us-keeping-eye-on-iran-oil-buyers-as-sanctions-squeeze-flows-75155", "downloaded_at": "2019-10-30 06:05:11.188069+00:00", "title": "U.S. Keeping Eye on Iran Oil Buyers as Sanctions Squeeze Flows", "language": "en", "text": "(Bloomberg) -- The U.S. has a message for buyers of sanctioned Iranian crude: we’re watching you.\n\nThe Trump administration routinely examines the effectiveness of its sanctions and is monitoring nations buying oil from Iran, said Kurt Donnelly, deputy assistant secretary for energy diplomacy from the Bureau of Energy Resources at the U.S. Department of State, without elaborating. While South Korea and India have halted purchases, customs data show that China is still regularly taking crude from the Persian Gulf nation, albeit at much smaller quantities.\n\n“Maximum pressure is our policy and our policy is to bring Iranian oil exports to zero,” Donnelly said in an interview in Singapore. “Sanctions are biting.”\n\nIran has continued to transport oil to customers despite U.S. sanctions, utilizing a fleet of tankers consisting of ships owned by the Persian Gulf nation and other entities. The U.S. recently slapped penalties on companies that continue to facilitate this flow, imposing trade restrictions on Chinese oil-importers and shippers such as Zhuhai Zhenrong Co. and a unit of COSCO Shipping Corp.\n\nSee also: Millions of Barrels of Iran Oil Are Sitting in China’s Ports\n\nVessels can avoid detection by employing tactics that include vanishing from tracking screens and clandestine transfers on the high seas in order to hide their activities. Chinese imports from ship-to-ship transfers surged last month to about 910,000 tons of crude, three times as much as in August, although it’s unclear where the oil originated.\n\nAmple Supplies\n\nGlobal markets remain well supplied, despite sanctions on Iran, restrictions on U.S. trades with Venezuela’s state-owned oil company Petróleos de Venezuela SA, and a recent attack on Saudi oil facilities, Donnelly said.\n\n“Looking at the global oil market, there hasn’t been shortages even when we had the attack on Saudi facilities,” said Donnelly. While sanctions on Iran and Venezuela have taken some supplies off the market, the U.S. has so much capacity that it can fill some of those supply gaps. The reduction of supplies “hasn’t disrupted oil markets, oil prices aren’t skyrocketing,” he added.\n\nLast month, about half of Saudi Arabia’s output was hit by one of the worst disruptions in history, although production was fully restored within two weeks of the incident. In the weeks following the attack, exports of expanded to just shy of the nation’s highest-ever record outflows of oil set in June this year.", "description": "U.S. Keeping Eye on Iran Oil Buyers as Sanctions Squeeze Flows", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/content/pic2f0e30358aa0cfe19009b1dc313a8ba3.jpg", "published_at": "2019-10-30"}