{"pub": "cbs", "url": "https://cbsnews.com/news/trump-impeachment-schiff-says-expanding-inquiry-will-determine-whether-impeachment-is-warranted", "downloaded_at": "2019-09-15 23:10:49.176174+00:00", "title": "Schiff says expanding inquiry into Trump will determine whether impeachment is warranted", "language": "en", "text": "Representative Adam Schiff of California said a recent effort by congressional Democrats in their expanding probe into President Trump will help them reach a conclusion into whether the commander-in-chief should be impeached.\n\n\"Yes, we're doing an investigation that will ultimately determine whether the president should be impeached,\" Schiff, the top Democrat on the House Intelligence Committee, told \"Face the Nation\" Sunday. Schiff was asked if an impeachment inquiry was underway.\n\nLast week, the Democratic-led House Judiciary Committee approved a resolution that authorized and outlined a set of procedures for the panel to follow as it continues its months-long investigation into whether Mr. Trump committed high crimes and misdemeanors — the standard enshrined in the Constitution for drafting articles of impeachment against a president or federal official.\n\nSome Democrats are still divided over the scope of the probe and the practicality of seeking Mr. Trump's impeachment given Republican control of the Senate. Those lawmakers portrayed the resolution as an important step to show the country that they are still investigating potential obstruction of justice and corruption by the president beyond the evidence and behavior outlined in special counsel Robert Mueller's report.\n\nSchiff, a key member of the Democratic leadership team in the House, said the move will also allow lawmakers to make more compelling arguments in federal court to request grand jury material.\n\nHe acknowledged that his party is splintered on the issue. According to Schiff, some Democrats are ready to \"vote to impeach and remove the president tomorrow.\" Others don't believe it is worthwhile because it would be a \"failed exercise\" in the Senate.\n\nBut Schiff said most of his colleagues do share one belief: \"The vast majority of our caucus, including our leadership, is of the view that we should do the investigation before we determine whether the president should be impeached,\" he said. \"That's the category that I fit in and that's the work that we're doing.\"", "description": "\"We're doing an investigation that will ultimately determine whether the president should be impeached,\" Schiff said on \"Face the Nation\" Sunday", "authors": ["Camilo Montoya-Galvez"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/09/15/0c28b5e4-b541-4e7d-9492-eb714ad9e8a9/thumbnail/1200x630/016f8e3611b15ee2ff1b66fc1cdc9a82/0916-ftn-still2.jpg", "published_at": "2019-09-15"}