{"pub": "huffpost", "url": "https://huffpost.com/entry/san-francisco-trump-homeless-needles-syringes_n_5d83b699e4b0849d47259f44", "downloaded_at": "2019-09-19 23:05:29.355774+00:00", "title": "San Francisco Throws Cold Water On Trump's Needle-Infested Ocean Claim", "language": "en", "text": "San Francisco officials are scoffing at President Donald Trump’s claim that the city’s homeless population is polluting the Pacific Ocean with needles and other waste.\n\nMayor London Breed and an official with the San Francisco Public Utilities Commission both said Thursday that the supposed problem, which Trump said he plans to address with an Environmental Protection Agency notice within the week, simply does not exist.\n\n“To be clear, San Francisco has a combined sewer system, one of the best and most effective in the country, that ensures that all debris that flow into storm drains are filtered out at the city’s wastewater treatment plants,” Breed said in a statement to HuffPost. “No debris flow out into the Bay or the Ocean.”\n\n“We haven’t had any (recent) problems with syringes,” Public Utilities Commission spokesman Tyler Gamble told the San Francisco Chronicle.\n\nSpeaking to reporters aboard Air Force One on Wednesday, Trump had claimed that the city’s homelessness crisis was creating a “terrible situation” with needles and other trash in the ocean.\n\n“They have to clean it up,” he said. “We can’t have our cities going to hell.”\n\nThough San Francisco is among the many cities hit hard by the opioid crisis, especially among its homeless population, needles associated with drug use that find their way into the city’s combined sewer-stormwater pipe network would be caught at one of two treatment facilities, which discharge clean water back into the bay or ocean.\n\nIf the President wants to talk about homelessness, we are committed to working with our state and federal partners on actual solutions. San Francisco Mayor London Breed\n\nHeal the Bay, an environmental group based in California, applauded San Francisco this year for its water quality during summer months, with 92% of its beaches earning an A or B grade from the group. Nearly all of Ocean Beach, the city’s largest beach, had A or A+ ratings.\n\nBreed challenged Trump to show up for a real conversation about people experiencing homelessness in San Francisco.\n\n“If the President wants to talk about homelessness, we are committed to working with our state and federal partners on actual solutions,” she said, pointing to the 1,000 shelter beds she plans to add by next year.\n\nThe city is also home to a needle exchange and safe injection program ― something that research has shown not only reduces HIV transmissions but also cuts the number of improperly disposed needles.\n\nIt’s easy to question the sincerity of Trump’s concern for the environmental health of California’s coastal areas. The same day he lambasted San Francisco, he announced he was revoking a federal waiver that allows the state to set its own auto emissions standards and move away from traditional oil-powered vehicles. Air pollution from those vehicles often ends up settling in waterways and oceans.\n\nState Sen. Scott Wiener, a Democrat who represents San Francisco in the California legislature, slammed Trump for overlooking real issues linked to manmade climate change ― a crisis that Trump has dismissed as a farce throughout his presidency.\n\n“I wish Trump would have his EPA enforce against actual environmental problems,” Wiener tweeted, “but I guess that would be too much to ask.”", "description": "“No debris flow out into the Bay or the Ocean,” Mayor London Breed said in response to the president.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d83dd7923000058055848d7.jpeg?cache=3nmetdekrh&ops=1778_1000", "published_at": "2019-09-19"}