{"pub": "reuters", "url": "https://in.reuters.com/article/pope-madagascar-homeless/pope-celebrates-madagascars-living-saint-champion-of-the-poor-idINKCN1VT0MZ", "downloaded_at": "2019-09-08 23:28:44.882890+00:00", "title": "Pope celebrates Madagascar's 'living saint', champion of the poor", "language": "en", "text": "ANTANANARIVO (Reuters) - Pope Francis on Sunday celebrated a former student of his who is now sometimes called Madagascar’s “living saint” for having changed the lives of thousands of poor people who once lived in garbage dumps.\n\nPope Francis meets with father Pedro Opeka at the Akamasoa community in Antananarivo, Madagascar, September 8, 2019.REUTERS/Yara Nardi\n\nThousands of former slum dwellers, many of them children, gave the pope an ecstatic welcome, leaving him seemingly overwhelmed by the experience, who only hours earlier defended the poor in the homily of a huge open-air Mass..\n\nFrancis taught Father Pedro Opeka theology at the Colegio Máximo de San Miguel in Buenos Aires in 1968 while Francis was completing his own studies for the priesthood.\n\nOver the last 30 years, an organisation founded by Opeka, whose parents emigrated to Argentina from Slovenia, has built homes for 25,000 people, 100 schools, six clinics and two football stadiums across the island nation. Next year, he plans to build a college for paramedics.\n\nThe white-bearded, jovial Opeka, 71, has been called a “living saint” along the lines of Mother Teresa of Calcutta by many in Madagascar because of his work in one of Africa’s poorest countries. He has been nominated for the Nobel Peace Prize.\n\nThe pope met families living in Akamasoa, one of the first villages built by Opeka on the hills above Madagascar’s capital Antananarivo to re-house people living on the municipal dump in the valley below.\n\n“Here in Akamasoa we have shown that poverty is not an inevitable destiny but something that stems from the lack of social responsibility of politicians who have forgotten and turned their backs on the people who have elected them,” Opeka told the pope in the presence of the country’s president.\n\nAs children sang and danced, Francis, clearly moved by the experience, said the community of neat candy-coloured houses showed it was possible to: “see life in a place that spoke only of death and destruction”.\n\nResidents earn around 50,000 ariary ($13) per week in exchange for breaking rocks by hand or assisting in other construction projects. Children often help on their days off from school.\n\nAll are given a house which they rent at a negligible rate, depending on their circumstances.\n\n“Every corner of these neighbourhoods, every school or dispensary, is a song of hope that refutes and silences any suggestion that some things are ‘inevitable’,” Francis said.\n\nMuch of the stone for the buildings is dug from a huge granite quarry where Opeka says Mass three times a year. Opeka, the son of a mason, refers to the pit as “my cathedral”.\n\nFrancis later visited the quarry and read a prayer for manual workers around the world.", "description": "Pope Francis on Sunday celebrated a former student of his who is now sometimes called Madagascar's \"living saint\" for having changed the lives of thousands of poor people who once lived in garbage dumps.", "authors": ["Philip Pullella", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190908&t=2&i=1427665611&w=1200&r=LYNXNPEF870VE", "published_at": "2019-09-08"}