{"pub": "cbc", "url": "https://cbc.ca/news/canada/nova-scotia/will-watson-kristin-watson-family-bus-1.5256930", "downloaded_at": "2019-09-24 13:43:42.696322+00:00", "title": "Why this family sold everything to make an old bus their new home | CBC News", "language": "en", "text": "An American couple traversing North America in a 1992 U.S. Air Force bus says Nova Scotia is one of their favourite places they've ever visited.\n\nBut this bus is more than just a set of wheels — it's their home.\n\nWill Watson said the vehicle has taken him, his wife, their baby daughter, and their dog from their hometown of Jacksonville Beach, Fla., to the rugged coastline of Cape Breton Island.\n\nBefore that, he said they spent more than a year lovingly converting the 27-year-old bus, which they bought in Utah in 2017.\n\n\"We've kind of been on the road ever since,\" said Will, 31.\n\nThe family stayed in Nova Scotia for most of August, and explored the Cabot Trail. (Instagram/@numberjuanbus)\n\nThe Watsons left for Nova Scotia about six months ago, though they made several stops along the way in various U.S. states, including a detour to Michigan, where Will has family, for a few weeks.\n\nBut Nova Scotia was the ultimate goal for the summer, he said.\n\n\"Our plan was to hit pretty much [the] four corners of North America,\" said Will. \"So, we hit the [Florida] Keys first, and then slowly just made our way.\"\n\nThe young family has been documenting the journey through Instagram and YouTube.\n\n'We want this for the long haul'\n\nKristin, Will's wife, said the idea to create a mobile home occurred to her during a road trip to California a few years ago.\n\n\"We rented a car, and we slept out of our car the whole time. And I just loved it so much that after that, I was obsessive — 'We should sell all our stuff and live out of a van!'\" said Kristin, 29.\n\nAs she and Will began travelling for work and found they weren't spending much time at home anyway, they decided to make that dream a reality.\n\nIn the almost 194-square-foot space, the Watsons managed to fit a full kitchen, a bathroom, an office space, a living area, a crib for their daughter (who is aptly named Roam) and a queen-size bed.\n\nWill and Kristin Watson, along with their daughter, Roam, and their dog, Rush, recently left Nova Scotia after spending six months on the road. (Instagram/@numberjuanbus)\n\nThe couple also installed a deck on the roof, and there's a space on the back of the bus to keep a motorcycle in case they need to run errands and don't want to bring the bus along.\n\nWill owns a creative marketing company and Kristin is a communications manager, so their jobs allow them to work remotely from the road.\n\nIn total, the project cost nearly $40,000 Cdn — though Kristin notes that similar projects can be done for much cheaper.\n\n\"We wanted to live in it full-time. We want this for the long haul, so we didn't cut any corners,\" she said.\n\nWill added that it is expensive, \"but think about how much you have to put down on a down payment to buy a house. Technically, that's what we did.\"\n\nThe couple says their jobs allow them to work from anywhere, including when parked near Chester, N.S. (Instagram/@numberjuanbus)\n\nLiving in a small space with a dog and a baby is less chaotic than you might think, said Kristin.\n\n\"It doesn't feel that small, oddly enough. And maybe it's because we got rid of so much stuff, and so everything has a place, and we try to keep everything in its place,\" she said.\n\n\"It just it feels a lot bigger than it is.\"\n\nWill also said the family doesn't actually spend that much time on the bus.\n\n\"We built this to go adventure and spend time outside, so that's mainly where we spend a lot of our time,\" he said.\n\nThey said Roam, who's 11 months old, is adapting well to the nomad life. The biggest challenge with her, said Will, is staying on a routine.\n\n\"If we drive really late or keep her up too late, she'll get fussy, so we kind of got to accommodate her for naps and making sure that she's on a schedule,\" he said.\n\nThe Watsons say their baby, Roam, doesn't mind being on the move. (Instagram/@numberjuanbus)\n\nNow that they've left Nova Scotia, the Watsons plan on heading back down south, then travelling to the western United States for the fall.\n\nThen, they'll head back to Florida for the colder months — \"we're not big winter people,\" said Will — before leaving for Alaska, with the hopes of hitting their northern corner next summer.\n\nOnce they've accomplished their goal of reaching the four corners of the continent, they say they'll reevaluate what they'll do when Roam gets old enough to start school.\n\n'We're definitely coming back'\n\nThe three weeks spent in Nova Scotia was one of the highlights of their trip, said Will.\n\n\"We loved it. It's like a whole different world out there,\" he said.\n\n\"For example, in Cape Breton, being able to wake up to that awesome view out the window is just insane.\"\n\nWhile they were in Nova Scotia, they explored downtown Halifax, Kejimkujik National Park and the Cabot Trail in Cape Breton, taking in the sights and befriending locals — including a friendly stranger in Cape Breton who taught them how to fly-fish.\n\nThey say while they're sad they're gone, they plan to return someday.\n\n\"We're definitely coming back, without a doubt,\" said Will.\n\nMORE TOP STORIES", "description": "A couple, their baby daughter, and the family dog who have been travelling for six months in a converted 1992 U.S. Air Force bus recently made their way to Nova Scotia. They say living in a small space is less stressful than you might think.", "authors": ["Reporter Editor", "Alex Is A Reporter Living In Halifax. Send Her Story Ideas At Alex.Cooke Cbc.Ca"], "top_image": "https://i.cbc.ca/1.5256901.1566510452!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/bus3.jpg", "published_at": "2019-09-02"}