{"pub": "cnbc", "title": "Millennials are making travel a priority more than previous generations—that's not a bad thing", "url": "https://cnbc.com/2019/08/30/millennials-making-travel-a-priority-more-than-previous-generations.html", "language": "", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:07:11.458564+00:00", "text": "Brad Pettiford, 32, tells CNBC Make It that when it comes to travel expenses, he and his wife, Jami, focus less on specifically saving up for an individual trip and more on keeping costs low overall. \"Traveling is something that we made the decision to prioritize in our lives, so we don't necessarily view it from a financial standpoint of 'can we afford to do it or not.' Rather, our focus is on finding great deals so we can visit all the cities on our bucket list as affordably as possible,\" he says.\n\nPettiford, a Detroit-based public relations professional, says he typically spends over $4,000 a year traveling, but most of the trips are three-day long weekend getaways as opposed to full-fledged vacations. \"Obviously the money spent traveling and on food and entertainment while we're away can add up, but because our trips are mostly three-day getaways, our overall expenses never really reach astronomical levels,\" he says.\n\nTo further minimize expenses, he and his wife will stay at cost-effective Airbnb residences instead of pricier hotels. When that's not an option, they try to find properties where they can use hotel points. \"Because our trips are mostly three-day getaways, our overall expenses never really reach astronomical levels,\" Pettiford says.\n\nPettiford and his wife manage to afford all this travel while juggling about $40,000 of debts that include car payments, student loans and financing for home renovation projects. \"We feel like those shared experiences are more meaningful than tangible items we could spend our money on,\" he says, adding they live modestly so they can have money to spend on travel while taking care of the debts and monthly expenses.", "description": "Millennials are traveling more than Gen X or Baby Boomers, and many are making it a priority to get out and explore as much of the world as they can. And despite the hype, they're not irresponsible about it.", "authors": ["Megan Leonhardt", "Viktoryia Vinnikava", "Source", "Brad Pettiford", "Emma Tiernon", "-Tiffany Aliche", "Founder Of The Budgetnista Financial Blog"], "top_image": "https://fm.cnbc.com/applications/cnbc.com/resources/img/editorial/2019/08/22/106091966-1566485921586meditation-at-the-sunrise-at-the-top-of-mount-batur-in-bali-indonesia_t20_wkymrv.1910x1000.jpg"}