{"pub": "reuters", "url": "https://af.reuters.com/article/worldNews/idAFKBN1WO0ZU", "downloaded_at": "2019-10-09 10:51:59.447643+00:00", "title": "France to ban demo in Paris police attacker's community", "language": "en", "text": "FILE PHOTO: French Interior Minister Christophe Castaner delivers a speech during a debate on migration at the National Assembly in Paris, France, October 7, 2019. REUTERS/Benoit Tessier\n\nPARIS (Reuters) - France is banning a planned demonstration that triggered outrage from politicians who saw it as honouring the attacker who killed four people in the Paris police headquarters last week.\n\nThe demonstration, in the Paris suburb of Gonesse where attacker Mickael H lived, had been planned for Thursday by Hadama Traore, who is looking to build up a profile on social media as the “political candidate of the suburbs”.\n\nTraore condemned last week’s attack on Facebook, but added he wanted the demonstration to take place as a mark of solidarity for the Gonesse community and to avoid the attack being used to discriminate against Muslim or ethnic communities.\n\n“The demonstration planned in Gonesse in support of the Paris police murderer is an act of infamy and an insult to the memory of our police force,” Interior Minister Christophe Castaner wrote on Twitter on Wednesday, in announcing the ban.\n\nThe attacker, who was shot dead by police, was born on the French island of Martinique and had worked at the police headquarters for several years. He converted to Islam about 10 years ago.\n\nTraore did not say if he would go ahead with the event despite the ban, but said in a Facebook post on Wednesday that he was free as a French citizen to hold such demonstrations.\n\n“In France, we have the freedom to demonstrate. In France, the police are there to protect the whole of the population,” he wrote.", "description": "France is banning a planned demonstration that triggered outrage from politicians who saw it as honouring the attacker who killed four people in the Paris police headquarters last week.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191009&t=2&i=1438780310&w=1200&r=LYNXMPEF980Q9", "published_at": "2019-10-09"}