{"pub": "metro", "url": "https://metro.co.uk/2019/10/29/paul-daley-brands-nate-diaz-vs-jorge-masvidal-bmf-ufc-title-wwe-silly-10999315", "downloaded_at": "2019-10-29 14:00:23.652024+00:00", "title": "Paul Daley brands Nate Diaz vs Jorge Masvidal BMF UFC title ‘WWE silly’", "language": "en", "text": "Diaz takes on Masvidal this weekend (Picture: Getty)\n\nPaul Daley thinks the UFC are doing a disservice to Nate Diaz and Jorge Masvidal by creating an actual belt for their clash at UFC 244.\n\nDiaz’s epic call-out of Masvidal after his win over Sergio Pettis last September has taken on a life on its own, with Dana White deciding to create an actual belt for the fan-favourite match-up.\n\nThe ‘Baddest Motherf***** in the Game’ title, nicknamed the BMF belt, will be presented to the winner of the headline fight at UFC 244, with Diaz claiming to be the defending champion.\n\nDaley has a win on his record over Masvidal and ridiculed the creation of a physical belt for what is already a fascinating fight.\n\n‘I’ve beat Jorge Masvidal, so he’s not the baddest motherf***** out there, that’s for sure,’ Daley told Metro.co.uk.\n\nDaley thinks the creation of an actual belt is silly (Picture: Getty)\n\n‘It’s interesting marketing, I guess. I like Nate Diaz’s character. I’m a fan of Nate.\n\nAdvertisement\n\nAdvertisement\n\n‘I’ll be watching that fight and Nate always brings it.\n\n‘The fact they’re making a belt for it is strange, almost WWE wrestling silliness.\n\n‘It is what it is. If we can just make our own belts, I’d be fighting for a title in my next fight.’\n\nThe BMF title has received a mixed reception from the MMA world, while Diaz’s old rival Conor McGregor has taken credit for the creation of the belt.\n\nEither Masvidal or Diaz will take home a belt after their fight (Picture: Getty)\n\n‘I designed that ‘Bad Motherf*****’ belt,’ McGregor said. ‘I actually designed that. I signed off on the design of how they (UFC) are creating that belt.’\n\nThe BMF title was almost scrapped last week when Diaz revealed on social media he had allegedly tested positive for a banned substance.\n\nDiaz, a vocal critic of doping, threatened to pull out of UFC 244 if his name was not cleared.\n\nThe UFC and US Anti-Doping Agency declared publicly Diaz’s positive test was due to a contaminated vegan multivitamin he had taken and that the American was not guilty of any doping offence or facing a ban.\n\nMORE: Dana White says he ‘100% knew’ Nate Diaz was clean as he’s cleared to fight Jorge Masvidal\n\nMORE: Nate Diaz ‘out of UFC 244 fight with Jorge Masvidal due to elevated levels’", "description": "Paul Daley has ridiculed the UFC's creation of a 'Bad Motherf*****' title for Nate Diaz's showdown with Jorge Masvidal.", "authors": ["Coral Barry"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1175801674_1572281885.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-29"}