{"pub": "metro", "url": "https://metro.co.uk/2019/10/07/charmed-sisters-alyssa-milano-holly-marie-combs-reunion-greys-anatomy-everything-10872934", "downloaded_at": "2019-10-07 01:09:14.416104+00:00", "title": "Charmed sisters reunion in Grey's Anatomy is everything", "language": "en", "text": "I’m not crying, you’re crying (Picture: Getty)\n\nHolly Marie Combs and Alyssa Milano have once again shared a heartfelt hug on our screens as sisters, but with the backdrop of a hospital in Grey’s Anatomy rather than at the Halliwell manor of Charmed.\n\nHolly and Alyssa guest star in an upcoming episode of the medical drama as sisters who arrived at Pac North to check on their other sibling, who is apparently not played by Shannen Doherty nor Rose McGowan – rude.\n\n‘We’re sisters’, the pair say to each other in a sneak peek of the episode released by ABC in which they attempt to figure out the circumstances that led to their sister Heather Peterson’s injury at a construction site.\n\nHolly who played Piper and Alyssa who played Phoebe in the hit nineties supernatural series are reuniting as part of ABC’s Cast From the Past, a special week of episodes that reunites the casts of beloved TV shows.\n\nSisters forever (Picture: ABC)\n\nThe episode, which airs on Thursday, also sees the two sisters reunited with former Charmed executive producers Krista Vernoff and Andy Reaser.\n\nAdvertisement\n\nAdvertisement\n\nOther reunions that will happen on Grey’s include the cast of Cheers on The Goldbergs, the cast of The Drew Carey Show on American Housewife and the cast of Girlfriends on black-ish.\n\nGimme!\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Aaron Carter reveals he is moving to Canada for a ‘change of scenery’ while bizarrely hitting out at Americans\n\nMORE: The Circle’s Jack and Beth given second chance as 62-year-old Joyce after shock double dumping", "description": "Holly Marie Combs and Alyssa Milano have once again shared a heartfelt hug on our screens as sisters, but with the backdrop of a hospital in Grey's Anatomy rather than at the Halliwell manor of Charmed.", "authors": ["Eliza Berlage"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_88732938_1570409443.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-07"}