{"pub": "cbc", "url": "https://cbc.ca/radio/asithappens/ontario-woman-spends-hundreds-for-son-to-meet-youtube-star-blippi-who-won-t-be-there-1.5318139", "downloaded_at": "2019-10-12 00:25:38.997322+00:00", "title": "CBC Radio", "language": "en", "text": "Dana Oliver was overjoyed when she snagged tickets to take her two-year-old son to see Blippi, the YouTube sensation for preschoolers, in Toronto.\n\n\"Trying to be mom of the year, I jumped right away to get those tickets,\" Oliver told As It Happens host Carol Off. \"It was something that we thought was, for sure, a once-in-a-lifetime experience for him.\"\n\nNow, the Kitchener, Ont., mother of three is outraged.\n\nThat's because the man who will be playing Blippi on tour won't be Stevin John, who regularly dons orange glasses, suspenders and a bow tie to teach children about firefighters, zoo animals and more, in a series of online videos.\n\nInstead, Blippi will be played by an actor. But that's something Oliver, and many other parents, didn't learn until they had already dished out hundreds of dollars on tickets.\n\n'I started crying'\n\nIn a statement on the Blippi Facebook page, John apologized for the \"confusion\" over his presence in the live show and clarified his role.\n\n\"I will be the creative force behind the live show, as a producer, a writer, and also I am personally casting the live theater performer to play the character on stage,\" he wrote. \"I have no doubt that the show is going to be amazing!\"\n\nBut Oliver said that's not what she signed up for, and was devastated when she learned that her son Avery would not be able to meet the man he spends hours watching on TV.\n\n\"I actually sat at my desk and I started crying because it's a huge disappointment to me because I was literally, like, I could just see the face that he would make if he got to meet this guy,\" she said.\n\nAvery, 2, 'adores' Blippi and could spend hours watching him on YouTube, says his mother Dana Oliver. (Submitted by Dana Oliver)\n\nWith nearly six million subscribers and millions of views on each Blippi video, it's estimated John earns between $100,000 US and $1.6 million US a month from YouTube advertising. The live North American tour, which includes a stop in Toronto, was announced on Blippi's Facebook page on Tuesday.\n\nSpent hundreds on tickets\n\nOliver said her husband sent her a screenshot of the announcement with a bunch of exclamation points, and she decided to get three tickets — one for her, her husband and her son.\n\nShe also picked up two tickets for a special meet-and-greet with Blippi, spending nearly $400 in total, through the site Eventbrite.\n\nEven though the meet-and-greet pushed the cost a little over her budget, Oliver said it was worth it because Avery \"adores\" Blippi.\n\n\"He really enjoys every minute of his videos ... and I can thank Blippi a lot for what he's taught my son,\" she said.\n\nIt wasn't until after she finished her transaction and posted on the Blippi Facebook page that she learned the truth about the live tour.\n\n\"I said, you know, 'Thank you so much. My son is going to be the happiest boy in the entire world,'\" she said.\n\nThen, someone replied telling her that Blippi would not actually be portrayed by John.\n\n\"I had to look a little bit further into it and it was 100 per cent true. In the Frequently Asked Questions it posted that he, Blippi, Stevin John, would not be there,\" Oliver said.\n\n\"Why would I even look in the Frequently Asked Questions to begin with?\"\n\nThis FAQ page on the Blippi Live website explains that John, or Blippi, will not be performing in the live show. (blippilive.com)\n\nThe Eventbrite page for the tour specifies that John is the \"creator of Blippi\" and \"now that Blippi has evolved as a character he is excited that a dynamic stage performer has been cast as Blippi.\"\n\nBut Oliver said that disclaimer was not there when she purchased the tickets.\n\nBlippi isn't a character, says Oliver\n\nIn an interview with Billboard, John explained that he didn't have time to go on the road for months at a time because \"YouTube is a monster and all of these platforms are really crazy.\"\n\nHe also reiterated that Blippi is a character, something Oliver does not agree with.\n\n\"In my opinion, and I'm sure I'm not alone, there can never be another Blippi,\" she said.\n\n\"It's not the way it is in my eyes and it's not going to be the same way in my [nearly] three-year-old's eyes when he goes up to do that meet-and-greet.\"\n\nBecause of this, Oliver has decided not to take Avery to the Blippi Live show. Instead, she's working to get her money back through her credit card company and plans to take Avery to a Monster Jam event.\n\nWritten by Sarah Jackson. Produced by Morgan Passi.", "description": "Dana Oliver was overjoyed when she snagged tickets to take her two-year-old son to see Blippi, the YouTube sensation for preschoolers, in Toronto. Now, she's outraged to find out Blippi will be played by someone else.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5318276.1570829523!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/blippi.jpg", "published_at": "2019-10-11"}