{"pub": "marketwatch", "url": "https://marketwatch.com/story/netflix-to-sell-another-2-billion-of-junk-bonds-as-it-braces-for-onslaught-of-competition-2019-10-21", "downloaded_at": "2019-10-22 13:33:47.566965+00:00", "title": "Netflix to sell another $2 billion of junk bonds as it braces for onslaught of competition", "language": "en", "text": "Netflix Inc. is planning to raise another $2 billion in debt as it moves to gain the financing needed for new content as the battle for streaming customers heats up with a slate of offerings on tap.\n\nNetflix NFLX, -1.66% said it plans to issue junk-rated bonds denominated in dollars and euros. It did not specify maturities but said it would use the proceeds for a range of purposes, including content, production and development and potential acquisitions.\n\nThe company is facing highly competitive offerings from deep-pocketed rivals Walt Disney Co. DIS, +2.14% and Apple Inc. AAPL, +0.28% that will launch in November. Disney-plus is priced at just $6.99 a month compared with the $8.99 Netflix charges for its basic plan, and will include its entire library of films and TV shows, including the Marvel and Star Wars franchises. Comcast Corp.’s CMCSA, -0.33% NBCUniversal will also pull some of its existing content from Netflix once licensing agreements expire, including “Friends” and “The Office,” which have proved popular with a millennial audience.\n\nSee: Martin Scorsese says for cinema, streaming is ‘an even bigger revolution than sound’\n\nAlso: Netflix’s stock jumps — but not all analysts are subscribing to the hype\n\nThe Apple TV+ offering is priced at $4.99 a month and will be free for one year with the purchase of a new Apple device. For now, the content slate looks slim compared with Netflix, but the iPhone maker is expected to grow through acquisition.\n\nSee now: As Netflix earnings loom, here comes an onslaught of competition — and content\n\nThose services will be followed by offerings from Comcast’s Peacock service and AT&T Inc.’s T, -1.40% HBO Max are due in spring 2020. Netflix is already competing with services from Amazon.com AMZN, +0.14% and Hulu.\n\nJust last week, Netflix acknowledged that the coming slew of competition may hurt new-subscriber growth. The company said it expects that subscriber growth will decline year-over-year in the usually strong fourth quarter and for the entire year, even with a strong slate of new shows.\n\n“The launch of these new services will be noisy,” Netflix executives said in their quarterly letter to shareholders. “There may be some modest headwind to our near-term growth, and we have tried to factor that into our guidance.”\n\nFor more, read: Netflix finally admits the obvious: Competition from Apple and Disney will hurt\n\nNetflix has mostly funded its content acquisition and production by issuing junk bonds, putting its long-term debt at about $12.5 billion. The company’s most active bonds, the 5.875% notes that mature in November of 2028, were last quoted at a yield spread of 271 basis points over comparable Treasurys, according to bond trading platform MarketAxess.\n\nSee also: AMC Theatres launches streaming service in latest blow to Netflix\n\nRelated: Why no streaming company will be able to dethrone Netflix\n\nShares were up 0.7% Monday, and have gained 3.6% in 2019, while the S&P 500 SPX, +0.19% has gained about 20% and the Dow Jones Industrial Average DJIA, +0.03% has gained 15%.\n\nSee now: Netflix thinks ‘Fortnite’ is a bigger competitor than other streaming services", "description": "Netflix Inc. is planning to raise another $2 billion in debt as it moves to raise the financing needed for new content as the battle for streaming customers...", "authors": ["Ciara Linnane", "Corporate News Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT272_Netfli_ZG_20191014153615.jpg", "published_at": "2019-10-21"}