{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/8/ap-women-facing-restrictions-seek-abortions-out-of", "downloaded_at": "2019-09-08 11:54:18.546678+00:00", "title": "AP: Women facing restrictions seek abortions out of state", "language": "en", "text": "ATLANTA (AP) - Thousands of women in the U.S. have crossed state lines for an abortion in recent years as states have passed ever stricter laws and the number of clinics has declined.\n\nAlthough abortion opponents say the laws are intended to reduce abortions and not send people to other states, at least 276,000 women terminated their pregnancies outside their home state between 2012 and 2017, according to an Associated Press analysis of data collected from state reports and the U.S. Centers for Disease Control and Prevention.\n\nIn New Mexico, the number of women from out of state who had abortions more than doubled in that period, while Missouri women received nearly half the abortions performed in neighboring Kansas.\n\nWhile abortions across the U.S. are down, the share of women who had abortions out of state rose slightly, by half a percentage point, and certain states had notable increases over the six-year period, according to AP’s analysis.\n\nIn pockets of the Midwest, South and Mountain West, the number of women terminating a pregnancy in another state rose considerably, particularly where a lack of clinics means the closest provider is in another state or where less restrictive policies in a neighboring state make it easier and quicker to terminate a pregnancy there.\n\n“In many places, the right to abortion exists on paper, but the ability to access it is almost impossible,” said Amy Hagstrom Miller, CEO of Whole Women’s Health, which operates seven abortion clinics in Maryland, Indiana, Texas, Virginia and Minnesota. “We see people’s access to care depend on their ZIP code.”\n\nThirteen states saw a rise in the number of out-of-state women having abortions between 2012 and 2017, according to the analysis of data from 41 states. Counts from nine states, including highly populated California and Florida, and the District Columbia were not included either because they were not collected or reported across the full six-year period.\n\nNew Mexico’s share of abortions performed on women from out of state more than doubled from 11% to roughly 25%. One likely reason is that a clinic in Albuquerque is one of only a few independent facilities in the country that performs abortions close to the third trimester without conditions.\n\nIn Illinois, the percentage of abortions performed on non-residents more than doubled to 16.5% of all reported abortions in 2017. That is being driven in large part by women from Missouri, one of six states with only a single abortion provider.\n\nEven that provider, in St. Louis, has been under threat of closing after the state health department refused to renew its license. Missouri lawmakers also passed a law this year that would ban almost all abortions past eight weeks of a pregnancy, although it faces a legal challenge.\n\nIt was one of 58 abortion restrictions passed by lawmakers this year primarily in the Midwest, Plains and South - almost half of which would ban all, most or some abortions, according to the Guttmacher Institute, a research organization that supports abortion rights.\n\nAbortion opponents say the intent of laws limiting the procedure is not to push women to another state but to build more time for them to consider their options and reduce the overall number of abortions.\n\n“I have been insistent in telling my pro-life colleagues that’s all well and good if the last abortion clinic shuts down, but it’s no victory if women end up driving 10 minutes across the river to Granite City, Illinois, or to Fairview Heights,” said Sam Lee, director of Campaign Life Missouri and a longtime anti-abortion lobbyist.\n\nBefore the recent wave of legislation focused on limiting when an abortion can be performed, opponents largely worked to regulate clinics. Critics say these regulations contributed to more clinics closing in recent years, reducing access to abortion in parts of the country and pushing women farther for care.\n\nNationwide, 168 independent abortion clinics have closed since 2012, and just a handful opened over that time, according to the Abortion Care Network, a clinic advocacy group. But not all closures are tied to restrictive laws. Some result from provider retirements and an overall decline in unplanned pregnancies.\n\nAdvocates say that if the U.S. Supreme Court upholds the latest restrictive laws, it will become more common for women to seek an abortion in another state.\n\n“The intent of these lawmakers is to completely outlaw abortion and force people not to have abortions. But in reality, it pushes people farther and wider to access the care they want and need,” said Quita Tinsley, deputy director of Access Reproductive Care Southeast, a group that supports women seeking abortions in six states.\n\nA third of women calling the group’s hotline for assistance end up traveling out of state for abortions, Tinsley said.\n\nGeorgia’s share of abortions involving out-of-state women rose from 11.5% to 15%, while North Carolina saw its share increase from 16.6% to 18.5%. North Carolina had one of the highest shares of out-of-state abortions in 2017. While both states have passed restrictive laws, experts and advocates say they are slightly more accessible than some of their surrounding states.\n\nHevan Lunsford, a nurse in Alabama, was five months pregnant when a doctor told her that her fetus was severely underdeveloped and had only half of a heart. She was told the boy, whom she and her husband decided to name Sebastian, would need care to ease his pain and several surgeries. He may not live long, they were told.\n\nLunsford, devastated, asked about ending the pregnancy. But the doctor said Alabama law prohibits abortions after five months. He handed Lunsford a piece of paper with information for a clinic in Atlanta, a roughly 180-mile (290-kilometer) drive east.\n\n“The procedure itself was probably the least traumatic part of it,” Lunsford said. “Most of the laws I navigated, there was no reason for them. None of them prevented my abortion. It just made it where I had to travel out of state.”\n\n___\n\nAssociated Press Data Editor Meghan Hoyer contributed to this report. Also contributing were AP writers John D. Hanna in Topeka, Kansas, and Susan Montoya Bryan in Albuquerque, New Mexico.\n\n___\n\nFollow Christina Almeida Cassidy on Twitter at http://twitter.com/AP_Christina\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Thousands of women in the U.S. have crossed state lines for an abortion in recent years as states have passed ever stricter laws and the number of clinics has declined.", "authors": ["The Washington Times Http", "Christina A. Cassidy"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/08/abortion_across_state_lines_91556_c0-204-4889-3054_s1770x1032.jpg?45d0af3c6ad2eb40a34177e6c98920ed23cb8819", "published_at": "2019-09-08"}