{"pub": "wsj", "url": "https://wsj.com/articles/draghi-leaves-with-no-exit-11568326860?mod=rsswn", "downloaded_at": "2019-09-12 23:37:57.362647+00:00", "title": "Draghi Leaves With No Exit", "language": "en", "text": "Mario Draghi is a learned man, and we wonder if the European Central Bank President is fond of French existential literature—specifically “No Exit” by Jean-Paul Sartre. He had thought that as he finished his historic eight-year term this fall he’d be unwinding negative rates and quantitative easing. Yet here is back at the same monetary stand.\n\nMr. Draghi announced Thursday that to prevent a European recession the ECB is reviving QE asset purchases to the tune of €20 billion per month indefinitely. The negative interest rate the ECB charges banks for reserve deposits will also fall again—to minus-0.5% from minus-0.4%. And the ECB will rejigger some of its subsidies for bank lending to companies.\n\nIt’s a measure of Europe's economic despond that some are grousing that even this isn’t enough. In QE’s first iteration, monthly purchases hit €80 billion for a spell. Other central banks such as Switzerland’s have pushed rates as low as minus-0.75%.\n\nWe recall not too long ago when extraordinary monetary policies were reserved for recessions or financial panics, and the eurozone isn’t there yet. No less a monetary authority than President Trump seemed to get at this when he kvetched on Twitter about how “quickly” the ECB is acting relative to the Federal Reserve because the euro will now fall against the dollar.\n\nBut in Europe these days monetary policy is the only economic resort. The ECB on Thursday also announced it will “tier” interest on bank reserves, exempting a portion of reserves from the negative-rate tax the ECB charges for parking cash at the central bank. This should satisfy complaints from Germans and other northern Europeans that their reserve-larded banks pay the lion’s share of the roughly €7.5 billion the ECB’s negative rate extracts from banks each year, and is a necessary political condition for future rate cuts.\n\nThis should help Mr. Draghi’s successor, Christine Lagarde, if she wants to go even further when she takes over in November. She is not a monetary technocrat and faces a steep learning curve. Mr. Draghi has deployed his considerable talents to spare her the challenge of crafting new monetary stimulus for a eurozone nearing recession in her first weeks on the job.\n\nThe catch is that this might not be Ms. Lagarde’s biggest challenge. Mr. Draghi on Thursday primed investors to expect more deeply negative rates in the future, at the precise moment economists are starting to question this policy’s merits.\n\nThe ECB’s negative rate has probably contributed only 0.1% or so to eurozone inflation per year, ECB Chief Economist Philip Lane admitted in a recent speech. Banks complain this tax on reserves makes it harder to attract investment compared to their American peers, and negative rates haven’t done much for Japan. Unless Europe grows again, how will Ms. Lagarde return to positive rates?\n\nThe other looming problem is that as QE grinds on, seemingly forever, the ECB will acquire larger and larger proportions of the debts of the governments whose bonds it buys. Mr. Draghi claimed Thursday that the central bank has considerable headroom before it hits its self-imposed limit of 33% of the debt issued by any one borrower.\n\nBut he’s punting on the question of how the ECB might behave if it one day finds itself embroiled in a sovereign default, and Ms. Lagarde should fervently hope she never has to navigate that minefield.\n\nMr. Draghi’s most important legacy is that the eurozone is still intact. It’s a remarkable achievement considering the stresses the currency and its members have faced. Ms. Lagarde has a tough act to follow, but at least she can read Sartre in her native tongue.", "description": "His legacy is a eurozone intact—and policies his successor can’t quit.", "authors": ["The Editorial Board"], "top_image": "https://images.wsj.net/im-106736/social", "published_at": "2019-09-12"}