{"pub": "usatoday", "url": "https://usatoday.com/story/news/politics/elections/2019/06/22/pete-buttigieg-asked-black-lives-matter-during-heated-protest-racism-racist-2020-presidential-race/1535958001", "downloaded_at": "2019-10-06 13:18:41.054844+00:00", "title": "Protesters ask Pete Buttigieg about black lives matter movement during heated confrontation", "language": "en", "text": "CLOSE Buttigieg back in South Bend after police shooting AP, AP\n\n2020 Democratic hopeful Pete Buttigieg is facing a crisis at home.\n\nThe South Bend, Indiana, mayor cancelled several campaign events this week following a police-involved shooting that left a black man dead, and on Friday he returned to the city to address emotional protesters, with video of the confrontation going viral.\n\nThe visibly angry crowd shouted at Buttigieg and questioned whether he believed \"black lives matter.\" One protester asked if Buttigieg was \"a racist.\"\n\nANALYSIS: Buttigieg's campaign faces test after fatal South Bend police shooting of a black man\n\nWhen Buttigieg told the crowd he did \"not have evidence that there has been discipline for racist behavior\" a protestor responded “You running for president and you expect black people to vote for you?”\n\nButtigieg told her, “I’m not asking for your vote,\" to which she replied, \"you ain’t gonna get it either.”\n\nMayor Pete Buttigieg: “I do not have evidence that there has been discipline for racist behavior...”\n\n\n\nProtester: “You running for president and you expect black people to vote for you?”\n\n\n\nButtigieg: “I’m not asking for your vote.”\n\n\n\nProtester: “You ain’t gonna get it either.” pic.twitter.com/tK1Ys0Yvfc — Keith Boykin (@keithboykin) June 22, 2019\n\nSouth Bend resident Eric Logan was shot early Sunday after police responded to a report that a suspicious person was going through cars, the St. Joseph County prosecutor’s office said.\n\nLogan was confronted by South Bend Police Sergeant Ryan O'Neill, who is white, while he was in a vehicle at an apartment building parking lot. The prosecutor's office said Logan exited the vehicle and approached the officer with a knife raised and the officer opened fire.\n\nAuthorities say no police video exists of the confrontation. St. Joseph County Prosecutor Ken Cotter said O’Neill's dash and body cameras weren’t activated because he was driving slowly without his emergency lights on while looking for a person possibly breaking into cars about 3:30 a.m. Sunday.\n\nLogan, 54, died at a hospital.\n\nPete Buttigieg shares a moment with Shirley Newbill during a gun violence memorial in South Bend, Indiana. (Photo: Michael Caterina, AP)\n\nButtigieg has been criticized by black community leaders in South Bend in the past. During his first term in office, he fired the city's first black police chief, according to the AP. He also was criticized for his handling of past shootings that involved police officers and the lack of diversity in the city's police department. Forty percent of South Bend residents are black or Hispanic, but the police department is almost 90% white, the AP reported.\n\nYou may also be interested in:\n\nContributing: Rebecca Morin, USA TODAY; The Associated Press\n\nRead or Share this story: https://www.usatoday.com/story/news/politics/elections/2019/06/22/pete-buttigieg-asked-black-lives-matter-during-heated-protest-racism-racist-2020-presidential-race/1535958001/", "description": "Indiana Mayor Pete Buttigieg cancelled several 2020 campaign events this week following a police-involved shooting that left a black man dead.", "authors": ["Alia E. Dastagir", "Published P.M. Et June"], "top_image": "https://www.gannett-cdn.com/presto/2019/06/20/USAT/4c2df5ec-7bdc-484f-bed1-db9db9a63252-butti.JPG?crop=4384,2452,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-06-22"}