{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/celebrities/2019/10/29/chris-pratt-arnold-schwarzenegger-praises-son-law/2493710001", "downloaded_at": "2019-10-29 14:14:23.114485+00:00", "title": "Arnold Schwarzenegger gushes over new son-in-law Chris Pratt, jokes he felt intimidated", "language": "en", "text": "CLOSE Chris Pratt sarcastically praised Katherine Schwarzenegger for her burnt cooking, and urged his wife to channel Rocky Balboa and \"keep moving forward\" Bang Showbiz\n\nArnold Schwarzenegger has only nice things to say about his new son-in-law, Chris Pratt.\n\nSpeaking Monday night to Jimmy Kimmel, the action icon and former Governor of California, 72, gushed over Pratt, who married his daughter Katherine in June.\n\n\"First of all, I'm really happy that he is such a great guy,\" Schwarzenegger said. \"Not only a very talented guy and a great actor and a great star and all this stuff, but a really kind man and kind to my daughter, which is the most important thing for me.\"\n\nForty-year-old Pratt, the goofy \"Parks and Recreation\" supporting actor-turned-\"Guardians of the Galaxy\" and \"Jurassic World\" franchises' leading man, won his future father-in-law over right away – so much so, that Arnold joked he felt intimidated by the actor's many accomplishments.\n\n\"I was blown away when my daughter was telling me that she was going out with him,\" he said. \"I was just like, 'Do you have to be so competitive? I mean, do you have to have a guy that is taller than me, that is bigger than me, that is doing bigger movies than me ... makes more money than me and all this kind of stuff? What is going on here?' \"\n\n'Did it go well? No.': Chris Pratt teases wife Katherine Schwarzenegger's cooking fail\n\nArnold Schwarzenegger gushed over Chris Pratt, who married his daughter Katherine over the summer. (Photo: Rich Polk, Getty Images for Disney)\n\nPratt proposed to Katherine, 29, in January, months after the pair had people guessing if they were an item when they were spotted together in June 2018. Arnold said Pratt asked his permission beforehand in a \"very traditional way,\" and the couple later tied the knot June 7 in Montecito, California, with Arnold and Katherine's mother, Maria Shriver, in attendance.\n\nHow did Pratt first win over the \"Terminator\" star? In the gym, of course.\n\n\"Of course the first thing when we met, he said, 'Can we have a workout together? I need to have the inside scoop to the pumping iron,' \" Schwarzenegger recalled.\n\n\"Pumping iron was the decision-making factor, absolutely,\" he joked after Kimmel asked how he decided Pratt could be a part of the Schwarzenegger clan. \"We were in the gym, that was it ... He's a strong guy, there's no two ways about it. I'm very proud of him. When I watched him make his moves in the gym, the incline press specifically did it. That's why I wanted him to become my son-in-law.\"\n\nContributing: Andrea Mandell and Erin Jensen, USA TODAY\n\nKatherine Schwarzenegger praises 'strong family' after funeral of Saoirse Kennedy Hill\n\nDisney Pixar releases new 'Onward' trailer featuring Chris Pratt, Tom Holland\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/celebrities/2019/10/29/chris-pratt-arnold-schwarzenegger-praises-son-law/2493710001/", "description": "Arnold Schwarzenegger joked he felt intimidated meeting his new son-in-law Chris Pratt, who married Katherine Schwarzenegger over the summer.", "authors": ["Hannah Yasharoff", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/06/15/USAT/d96cd00c-78bd-46bf-ba60-fd6c869ad11b-19043.jpg?crop=4367,2446,x0,y202&width=3200&height=1680&fit=bounds", "published_at": "2019-10-29"}