{"pub": "reuters", "url": "https://in.reuters.com/article/uk-daimler-results/daimler-reports-third-quarter-operating-profit-rose-8-idINKBN1X30FW", "downloaded_at": "2019-10-24 06:45:46.498836+00:00", "title": "Daimler reports third-quarter operating profit rose 8%", "language": "en", "text": "FILE PHOTO: An employee of German car manufacturer Mercedes Benz prepares the company's logo prior to its installation at the A-class production line at the Daimler factory in Rastatt, Germany, February 4, 2019. REUTERS/Kai Pfaffenbach/File Photo\n\nFRANKFURT (Reuters) - Daimler (DAIGn.DE) reported a slight rise in third-quarter operating profit on Thursday, boosted by higher sales of Mercedes-Benz cars but announced cost cuts and warned that legal provisions tied to diesel litigation could rise.\n\nGroup earnings before interest and taxes (EBIT) rose 8% to 2.69 billion euros, up from 2.49 billion euros in the year-earlier period boosted by an 8% rise in sales of luxury cars.\n\n“In order to master the transformation in the next few years, we need to increase our efforts considerably: we have to significantly reduce our costs and consistently strengthen our cash flow,” Chief Executive Ola Kaellenius said, without elaborating.\n\nDaimler is due to give a detailed presentation on strategy and costs on November 14.\n\nThe return on sales at Mercedes-Benz Cars fell to 6%, down from 6.3% in the year-earlier period, despite an 8% rise in passenger car sales during the quarter, Daimler said.\n\nDaimler reiterated that it expected group earnings before interest and taxes to be significantly lower than last year, and warned it now sees revenue at the trucks division to be at the year-earlier level instead of expecting slight revenue growth.\n\nDaimler said current legal proceedings tied to diesel emissions may result in additional expenditures which may hit profits at Mercedes-Benz Cars and Mercedes-Benz Vans.", "description": "Daimler reported a slight rise in third-quarter operating profit on Thursday, boosted by higher sales of Mercedes-Benz cars but announced cost cuts and warned that legal provisions tied to diesel litigation could rise.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191024&t=2&i=1444374383&w=1200&r=LYNXMPEF9N0B4", "published_at": "2019-10-24"}