{"pub": "cnbc", "url": "https://cnbc.com/2019/10/11/appeals-court-rejects-trump-appeal-of-subpoena-for-tax-returns.html", "downloaded_at": "2019-10-11 19:38:57.682530+00:00", "title": "Federal appeals court upholds House subpoena for Trump's financial records", "language": "en", "text": "President Donald Trump speaks to reporters as he departs for travel to Minnesota from the South Lawn of the White House in Washington, U.S. October 10, 2019.\n\nA federal appeals court on Friday upheld a subpoena for President Donald Trump's financial records from the Democrat-controlled House Committee on Oversight and Reform.\n\nThe 2-1 ruling by the U.S. Circuit Court of Appeals for the District of Columbia Circuit rejected Trump's bid to block the committee from getting eight years' worth of his financial records from the accounting firm Mazars USA.\n\nThe committee on April 15 issued Mazars a subpoena for various financial statements related to the Trump Organization, the Trump Corporation and the Trump Old Post Office in Washington.\n\n\"Contrary to the President's arguments, the Committee possesses authority under both the House Rules and the Constitution to issue the subpoena, and Mazars must comply,\" Judge David Tatel wrote in the majority opinion.\n\n\"We conclude that in issuing the challenged subpoena, the Committee was engaged in a 'legitimate legislative investigation,' \" wrote Tatel, who was joined by Judge Patricia Millett in the majority decision.\n\nTatel was appointed to the bench by President Bill Clinton; Millett was appointed by President Barack Obama.\n\nThe dissenting opinion came from Judge Neomi Rao, who was appointed by Trump.\n\nTrump's financial records will not be released immediately to the committee.\n\nThe appeals panel ordered that the effect of the ruling be put on hold to give Trump time to either seek a rehearing of the case by either the same panel, or by the entire D.C. Circuit judges.\n\nTrump also can ask the U.S. Supreme Court to take his appeal.\n\n\"We are reviewing the opinion and evaluating all appellate options,\" Trump lawyer Jay Sekulow said.\n\n\"While we are reviewing the court's lengthy decision, as well as Judge Rao's dissent, we continue to believe that this subpoena is not a legitimate exercise of Congress's legislative authority,\" Sekulow said.\n\nHouse Oversight Committee Chairman Rep. Elijah Cummings, D-Maryland, said, \"Today's ruling is a fundamental and resounding victory for Congressional oversight, our Constitutional system of checks and balances, and the rule of law.\"\n\n\"For far too long, the President has placed his personal interests over the interests of the American people,\" Cummings said.\n\n\"After months of delay, it is time for the President to stop blocking Mazars from complying with the Committee's lawful subpoena. We must fulfill our stated legislative and oversight objectives and permit the American people to obtain answers about some of the deeply troubling questions regarding the President's adherence to Constitutional and statutory requirements to avoid conflicts of interest.\"\n\nA spokesman for Rep. Jim Jordan, an Ohio Republican who is a member of the Oversight Committee, noted Friday that Jordan and other GOP members of the committee had strongly objected to the issuance of the subpoena.\n\nIn a letter to Cummings in April, Jordan had written that the subpoena is \"an unprecedented abused of the Committee's subpoena authority to target and expose the private financial information of the President of the United States.\" Jordan also said in that letter that Cummings was violating a promise \"to debate and vote on Committee subpoenas.\"\n\nNeal Katyal, a former acting U.S. solicitor general — the lawyer who argues for the federal government at the Supreme Court — said on Twitter that Trump could have a tough time getting the high court to overturn the decision given the fact that a federal judge and a highly respected appeals court have both ruled for the House.\n\nIn her dissent, Rao said: \"Investigations of impeachable offenses simply are not, and never have been, within Congress's legislative power.\"\n\n\"Throughout our history, Congress, the President, and the courts have insisted upon maintaining the separation between the legislative and impeachment powers of the House and recognized the gravity and accountability that follow impeachment,\" Rao wrote.\n\n\"Allowing the Committee to issue this subpoena for legislative purposes would turn Congress into a roving inquisition over a co-equal branch of government.\"", "description": "The subpoena was issued earlier this year to Trump's accountants at Mazars USA by the House Committee on Oversight and Reform.", "authors": ["Dan Mangan"], "top_image": "https://image.cnbcfm.com/api/v1/image/106175581-15707423724992019-10-10t211752z_1580940259_rc18a09912a0_rtrmadp_3_usa-trump.jpg?v=1570742419", "published_at": "2019-10-11"}