{"pub": "businessinsider", "url": "https://businesstimes.com.sg/stocks/hot-stock-mapletree-industrial-trust-jumps-43-after-s400m-placement ", "downloaded_at": "2019-09-18 07:26:04.302109+00:00", "title": "Hot stock: Mapletree Industrial Trust jumps 4.3% after S$400m placement", "language": "en", "text": "UNITS in Mapletree Industrial Trust (MIT) rose by about 4.3 per cent in afternoon trade on Wednesday after news the trust had priced an upsized S$400 million overnight placement of units at S$2.265 each to cover the rich end of initial indications.\n\nAt 1.53pm, the counter was trading at S$2.43 on a cum-dividend basis, up 4.3 per cent or 10 Singapore cents. About 15.3 million units changed hands, making it one of the most actively traded stocks on the Singapore bourse.\n\nIn a regulatory filing on Wednesday, MIT's manager said it had raised S$400 million via an oversubscribed private placement of 176.6 million new units. An upsize option was exercised, with 18.3 million new units issued from it, out of a maximum of 22.6 million new units.\n\nThe private placement was about 6.3 times covered, with strong participation from new and existing institutional investors, the manager added.\n\nsentifi.com Market voices on:\n\nPrice talk was at a range of S$2.211 to S$2.265 for the deal, which was launched on Tuesday.\n\nThe issue price represents about a 2.7 per cent discount to the counter's S$2.3278 volume-weighted average price on Monday, before the placement agreement was signed.\n\nThe mainboard-listed real estate investment trust (Reit) will use about S$393.6 million of the proceeds to partially fund its joint purchase of a North American data centre portfolio worth some US$1.37 billion, which MIT said would cost it about S$965 million.\n\nThe remaining S$6.4 million of the proceeds will be used to pay placement-related expenses.", "description": ": THE BUSINESS TIMES Stocks - UNITS in Mapletree Industrial Trust (MIT) rose by about 4.3 per cent in afternoon trade on Wednesday after news the trust had priced an upsized S$400 million overnight placement of units at S$2.265 each to cover the rich end of initial indications. . Read more at The Business Times.", "authors": ["Rachel Mui"], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-09-18"}