{"pub": "investing.com", "url": "https://investing.com/analysis/japans-shrinking-exports-raises-odds-that-boj-could-ease-200475520", "downloaded_at": "2019-10-21 07:38:22.831233+00:00", "title": "Japan’s Shrinking Exports Raises Odds That BoJ Could Ease", "language": "en", "text": "Japan’s Shrinking Exports Raises Odds That BoJ Could Ease\n\nCity Index (Matt Simpson) Forex 1 hour ago (Oct 21, 2019 01:42AM ET) By\n\nwww.investing.com/analysis/japans-shrinking-exports-raises-odds-that-boj-could-ease-200475520 Japan’s Shrinking Exports Raises Odds That BoJ Could Ease By (Matt Simpson) | 1 hour ago (Oct 21, 2019 01:42AM ET) By City Index | 1 hour ago (Oct 21, 2019 01:42AM ET)\n\nFollow Daily % Candles From Asia Open FX Brief: Japan’s exports contracted for a 10th consecutive month, seeing further calls for BOJ to ease at next week’s meeting. At -5.2% YoY, it missed expectation of -4% although an improvement over -8.2% prior. A report in the UK Times suggests that the EU are prepared to extend Brexit through to February 2020. Incoming ECB President Christine Lagarde says “everyone will be a little less well off as a result” of Brexit and that the US-China trade war is “certainly going to give a big hair cut to the global economy”. Goldman Sachs (NYSE: ) have lowered their probability of a no deal Brexit from 10% to 5%. They also think the Fed have likely prevented a recession. NZD is the strongest major, seeing NZD/IUSD tough a 1-month high and hit a 6-day high ahead of Canada’s election. is on the verge of breaking above September’s high, remains within a potential bull-flag formation on the 4-hour chart around 108.50. GBP pairs are treading water as they await the next bout of Brexit headlines. Although implied volatility for cable remains at its highest level since June 2016 (following the vote for Brexit). Asian Cash Indices % Change Equity Brief: It’s been a mixed session on the ASX200 which saw the index close essentially flat, although it leaves room for a bullish hammer on the daily chart. Australian tech firms remain under pressure following RBA’s announcement of their probe on buy-now-pay-later firms on Thursday. Afterpay was one of the wort performers, closing -3.9% lower, yet at one point had fallen over -8% since Friday’s close. Consumer staples and energy also weighed on the index, with real estate investment trusts, industrial and consumer discretionary leading the way higher. Wisetech Global requested a trading halt following allegations within a research report and was the biggest loser having shed -12.3% on the session. Stockland Corporation enjoyed its best session in 5-months following an upbeat outlook and was today’s strongest gainer on the ASX200, closing +6.2% higher. The STI (Singapore’s Straight Times Index) was the biggest mover among the indices we track and touched a 3-day high and is on track for a bullish outside candle. Economic Calendar Original Post\n\nJapan’s Shrinking Exports Raises Odds That BoJ Could Ease", "description": "Forex Analysis by City Index (Matt Simpson) covering: USD/JPY, AUD/JPY, NZD/CAD, Goldman Sachs Group Inc. Read City Index (Matt Simpson)'s latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-21"}