{"pub": "nationalreview", "url": "https://nationalreview.com/magazine/2019/10/28/looking-hard-at-the-afghan-war", "downloaded_at": "2019-10-10 15:02:46.275682+00:00", "title": "Looking Hard at the Afghan War", "language": "en", "text": "U.S. soldiers in Afghanistan, June 6 (Thomas Watkins/AFP/Getty Images)\n\nA U.S. withdrawal from Afghanistan seems around the corner. President Trump invited the Taliban to Camp David, for the purpose of consummating the negotiations that had been going on between the two parties (us and the Taliban). He rescinded the invitation at the last minute, however. Reason: The Taliban killed an American, along with eleven others, in one of their bombings. Yet, as Ryan Crocker points out, they had been killing Americans all along — all through the negotiations.\n\nAdvertisement\n\nAdvertisement\n\nPersonally, I was revolted by the thought of the Taliban at Camp David. All that blood on their hands, including a lot of American blood. But then I thought, “Well, Arafat was at Camp David. Maybe I am being too pure.” Crocker, too, was revolted. And there is a big difference, he says, between Arafat and the PLO, on one hand, and the Taliban on the other. We required Arafat to renounce terrorism and recognize the right of Israel to exist, without qualification. (His sincerity is another question.) From the Taliban, we did not even demand a cease-fire.\n\nRyan Crocker was our man in the Middle East — one of our main people — for many years. He is now a diplomat-in-residence at Princeton University. He served as ambassador to Lebanon, Kuwait, Syria, Pakistan, Iraq, and Afghanistan. Garden spots were not for him: no Luxembourg, no Barbados. Three of his ambassadorships were under Republican presidents, and three under Democratic ones.\n\nAdvertisement\n\nHow did he get mixed up with the Middle East (broadly defined)?\n\nHis father was a career Air Force officer. The family lived in several countries, including Turkey, where Crocker graduated from high school. Between his junior and senior years of college, he “had a chance to hitchhike from Amsterdam to Calcutta,” as he says. That was in 1970. “It took the whole summer and it nearly killed me,” but it was a wonderful experience. He found the Middle Eastern lands the most alluring. And when he joined the Foreign Service, that’s where he wanted to go.\n\nAdvertisement\n\nIn January 2009, in the last days of his presidency, George W. Bush hung the Presidential Medal of Freedom around Crocker’s neck. Bush quoted General David Petraeus, who had said, “It was a great honor for me to be his military wingman” — meaning Crocker’s. In 2012, after Crocker had stepped down as ambassador to Afghanistan, the U.S. Marine Corps made him an honorary Marine.\n\nAdvertisement\n\nCrocker is deeply worried about a U.S. withdrawal from Afghanistan and the return of the Taliban to power. This is putting it mildly.\n\nHe takes me back to 2001 — to 9/11 itself. Al-Qaeda had gathered under the wing of the Taliban, who were the Afghan government. Eventually, al-Qaeda attacked us, spectacularly, on that September day. We did not invade Afghanistan automatically. We gave the government, the Taliban, a choice: hand over al-Qaeda and we will leave you alone; otherwise, we will invade and overthrow you. The Taliban chose the latter course. Rather than surrender al-Qaeda, Crocker says, the Taliban chose defeat and exile. That tells you something about the degree of attachment between the two groups.\n\nAdvertisement\n\nRecently, the Afghan president, Ashraf Ghani, commented on loyalty oaths between the Taliban and al-Qaeda. These groups have pledged allegiance to each other.\n\nAdvertisement\n\nAt the table with the United States, Taliban leaders have said they will not afford a haven to terrorists. Sure, says Crocker: They want us to leave and will say anything to get us out — because they know that once we leave, we’re not coming back.\n\nI tell him something I heard from a Trump official: “As the president says, al-Qaeda and the rest don’t have to be in Afghanistan, under the Taliban, to operate against us. They can be anywhere — like a house in Yemen.” Crocker responds, “There is a difference between al-Qaeda finding some little corner of Yemen where things might be quiet enough that they don’t have to switch beds every night, and having a country controlled by a government that embraces you.”\n\nWe have been in Afghanistan since 2001. Eighteen years. This is our longest war by far. How much longer can the American people be expected to stick with it? Crocker says, in essence, that the American interest is not determined by a calendar. Would that it were that easy. The American interest does not have an expiration date.\n\nAdvertisement\n\nWhen he left Afghanistan as ambassador in 2012, he says, we had about 100,000 troops in the country. Today, that number is 14,000 — and things are holding steady in Afghanistan. “We are still taking casualties, and every one is one too many, but those casualties are nowhere near what they were before.”\n\nAdvertisement\n\nPeople point out that the Taliban already holds big chunks of the country — this percentage or that percentage. Yes, says Crocker, but you have to consider: The Taliban does not hold a single provincial capital. Not one. “So, what are they holding? Open desert? That really doesn’t count.” Also, what they hold by night, they may not hold by day.\n\n“The fight is being carried out by the Afghans now,” says Crocker — by the country’s military — “and they are doing it with real determination. They suffer some horrific losses, but they stay in the field, and one reason for that is, we’re there too: not on the front lines but as advisers. We’ve got their backs.”\n\nAdvertisement\n\nAfter rescinding the invitation to Camp David, President Trump called off talks between the U.S. and the Taliban altogether. Of course, they might resume at any time. These talks have always disgusted Crocker. For one thing, we cut the Afghan government out of the process, because the Taliban called the government our stooge. Our cutting them out gives the appearance of confirming the charge. President Ghani had 20 minutes to look at the draft agreement between us and the Taliban — an agreement that would determine his country’s fate.\n\nAll of this reminds Crocker, and not a few others, of the Paris peace talks during the Vietnam War. We were acknowledging defeat, merely negotiating the terms of our surrender — and leaving our allies in the lurch.\n\nWhat do we owe our allies? Anything? This is a hotly controversial issue. U.S. security — the hard American interest — is paramount, as Crocker says. But he is also worried about “a betrayal of our values.” When he arrived in Kabul in January 2002, to open our embassy there — he was serving as chargé d’affaires — there were about 900,000 Afghan kids in school. Not one of them was a girl. Not a single one. Today, there are about 9 million students, and more than a third of them are girls. Women participate in business, in the military, and elsewhere. A quarter of the parliament is composed of women.\n\n“We’ve worked very hard to give girls and women opportunities in Afghanistan,” says Crocker. “Implicit in it is: You women step forward, we Americans have your back.” Now, “what do you think is going to happen to them if we walk out and the Taliban walks back in? The Taliban hasn’t gotten any kinder or gentler during their years in exile.”\n\nEarlier this year, I interviewed Laila Haidari, a businesswoman and civil-society leader in Afghanistan. (She runs drug-rehabilitation programs, for which there is a great need.) She stressed over and over that if the Taliban return, people like her are finished. Absolutely finished. Out of any public role, of course, but maybe dead, too.\n\nOnline, there are comments — reader comments — underneath the article I wrote about Haidari. The first of them is directed to the woman herself. “Sucks to be you,” says the reader. “And don’t blame the USA for anything.” (She does not, and never has.) “Afghanistan was a hell hole when Alexander blew through there 2500 years ago. Fix you[r] own problems.”\n\nThis is a widespread sentiment — understandable, too — though most would probably not express it so obnoxiously. Yet even if you believe we have no obligation whatsoever to the Afghan people, remember: It sucked to be us on 9/11, and we should be wary of letting our guard down, and having to repeat the work we have done at such pain and cost over these nearly 20 years.\n\nRyan Crocker talks about the importance of staying power. Our foes have gotten used to waiting us out; our friends, or potential friends, are wary of our commitment. “The impression has grown,” says Crocker, “that the Americans will come, the Americans will kick butts around the block a few times, and then the Americans will get tired of it all and the Americans will go home.” It would be better if friend and foe alike knew that we would remain as long as necessary — as long as necessary for our interest.\n\nIn Afghanistan, says Crocker, we are spending less and less in blood and treasure. Fewer troops — almost a tenth the number we had when he was ambassador. Fewer casualties. A relatively manageable situation on the ground. “While our involvement is still expensive,” says Crocker, “I think it’s a pretty good insurance policy against another 9/11.”\n\nAdvertisement\n\nA lot of us are thinking about Vietnam, as I’ve mentioned — Afghanistan has been smelling more and more like Vietnam. But we don’t have to go that far back: What about Iraq? In an op-ed column for the Washington Post — published at the beginning of this year — Crocker wrote, “President Barack Obama proved in Iraq that the United States cannot end a war by withdrawing its forces — the battle space is simply left to our adversaries.” We departed in 2011; ISIS arose, and we had to return. “In Afghanistan,” Crocker continued, “President Trump has a choice. He can follow Obama’s example and leave the country to the Taliban, or he can make clear that the United States has interests, values, and allies, and will stand behind them.”\n\nI have no answers concerning the Afghan War. I don’t envy those — starting with the president — who have to decide. Maybe our withdrawal from Afghanistan would — will, I should probably say — leave us no less safe. But Ryan Crocker has made me think hard. To be honest, I had sort of given up on the Afghan War. Eighteen years, you know? And if you can’t get it done in that time (whatever “it” is) . . . But Crocker has reminded me of some basics, and I suspect — fear — he is right.", "description": "A conversation with former ambassador Ryan Crocker.", "authors": ["Jay Nordlinger", "Ramesh Ponnuru", "Robert Verbruggen", "Katherine Timpf", "Douglas Murray", "John Mccormack", "William Voegeli", "Rachel Lu", "Robert D. Atkinson", "Nr Editors"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/Afganistan-soldiers.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-10"}