{"pub": "politico", "url": "https://politico.com/states/new-york/city-hall/story/2019/10/02/max-rose-voices-support-for-trump-impeachment-inquiry-1217362", "downloaded_at": "2019-10-03 07:18:51.102682+00:00", "published_at": "2019-10-02", "title": "Max Rose throws his support behind Trump impeachment inquiry", "language": "en", "text": "\"I intend to fully support this impeachment inquiry and follow the facts,\" Rep. Max Rose told constituents at a Staten Island town hall. | POLITICO Screengrab Max Rose throws his support behind Trump impeachment inquiry\n\nRep. Max Rose, the last New York City member of Congress to hold out against backing an impeachment inquiry against President Donald Trump, threw his support behind the effort Wednesday night.\n\n“I intend to fully support this impeachment inquiry and follow the facts,” Rose told constituents at a Staten Island town hall meeting.\n\nStory Continued Below\n\nThe freshman Democrat from Staten Island had been one of just a handful of House Democrats nationwide to decline support for the inquiry, and had been fending off criticism from both sides on his stance since the proceedings formally kicked off last week.\n\nStaten Island was the only borough in the city to vote for Trump, backing him by a 17 point margin in the 2016 election.\n\n“I have opposed a rush to judgment to date because the American people deserve to know that when this country is in crisis, we’re going to react responsibly and deliberately,” Rose said Wednesday. \"If the president is right and he has nothing to hide, then all we ask today is that he proves it ... I'm going to follow these facts wherever they lead, no matter the consequences.\"\n\nBefore revelations about Trump’s phone call to the president of Ukraine that sparked the current investigation, Rose wrote an op-ed forcefully denouncing the possibility of impeachment, saying it would “only tear our country further apart.”\n\nBut as the inquiry kicked off, he said he was alarmed by the allegations and “all options must be on the table.”\n\nAt the town hall, Rose said he was now ready to get on board.\n\n“While the president of the United States may be willing to violate the constitution to get reelected, I will not,” he said. “I will not shirk my duty, and I will not violate my oath.”\n\n“The American people have the right to know if our president used the power of his office to get a foreign power to interfere in our election,” he added.\n\nRose now faces a primary challenger on his left, as well as a general election challenge Republican Assemblywoman Nicole Malliotakis.\n\nAfter the congressman announced his support for impeachment, Malliotakis released a statement accusing him of caving to pressure on his left.\n\n\"Just one day after finding out he had a challenger in the Democrat primary, Congressman Max Rose caved to socialists Reps. Alexandria Ocasio-Cortez, Ilhan Omar and Nancy Pelosi in the rush to impeach President Donald Trump,\" she said. \"It just shows that when pressure is applied, Max Rose stands with the radical left instead of Staten Island.\"\n\nRose said he was “absolutely not” concerned his flip would cost him his reelection, saying of Republicans trying to defeat him: “They already tried once and we kicked their ass.”\n\n“They have been absolute jokes. They will continue to be jokes. And I look forward to beating them by an incredible margin,” he added.\n\nRichard-Olivier Marius, a member of the Democratic Socialists of America challenging Rose in the primary, had attacked his impeachment stance but said Wednesday he was pleased with Rose’s shift.\n\n“That’s all I wanted,” he said, adding it shows the power of critics to “put pressure on legislators to do the right thing.”\n\nRose meanwhile said he was thrilled with the primary challenge as well.\n\n“I had been trying my hardest to get a socialist to primary me, and I cannot tell you how happy I am that he is doing so,” he said.\n\nConstituents at the forum at a Jewish Community Center on Staten Island mostly peppered Rose with questions about transit, not impeachment.\n\n“I thought he was right on,” said Bob Zuckerberg, 70, of the impeachment comments. “He’s taking a very careful and deliberate look, and I absolutely believe the fact that he wants the inquiry to show what actually happened.”", "description": "The freshman Democrat had been the only New York City Democrat, and one of just a handful nationwide, to decline to support the impeachment inquiry.", "authors": ["Erin Durkin"], "top_image": "https://static.politico.com/bc/43/976ff83d4056b284be7aa3a7674d/29171923-max-rose-screenshot-1160.jpg"}