{"pub": "arynews", "url": "https://arynews.tv/en/curfew-continues-70th-consecutive-day-iok", "downloaded_at": "2019-10-13 00:14:44.023921+00:00", "title": "Curfew continues for 70th consecutive day in Indian occupied Kashmir", "language": "en", "text": "In occupied Kashmir, the people of Kashmir Valley continue to suffer immensely as the strict military lockdown imposed by the Indian government remained intact on the 70th running day, today.\n\nAmid the suspension of mobile and internet services and the absence of public transport, the residents are facing an acute shortage of basic items of daily use including food and medicines.\n\nThere have been certain cases when families came to know about the death of their relatives after a week or so. Reports have also come out that some people died because they could not be taken to hospitals on time due to the lockdown.\n\nMeanwhile, Indian troops continued the cordon and search operation in Ganderbal district on the 17th consecutive day, today. The operation, which was launched by the troops in Naranag, Trumkhal Gangbal and other areas of the district on September 27, has turned out to be the longest operation in the last 15 months.\n\nThe Indian government has admitted that there were over 330 incidents of protests in occupied Kashmir in last two months after Article 370, which granted special status to the territory, was revoked. The report said that 67 percent of these protests were held in Srinagar, Badgam and Pulwama.\n\nRead More: Million of Kashmiris to take to streets after curfew lifted: PM Imran\n\nOn the other hand, American Senator, Maggie Hassan, has called for finding ways to de-escalate tensions between India and Pakistan. She is currently on a visit to the region. She said this in a tweet after her visit to Azad Jammu and Kashmir.\n\nComments\n\ncomments", "description": "", "authors": ["Web Desk"], "top_image": "https://arynews.tv/wp-content/uploads/2019/09/curfew-Kashmir.jpg", "published_at": "2019-10-12"}