{"pub": "independent", "url": "https://independent.co.uk/sport/football/premier-league/man-city-v-watford-8-0-score-goals-highlights-result-bernardo-de-bruyne-a9114881.html", "downloaded_at": "2019-09-22 00:31:42.732705+00:00", "title": "Manchester City vs Watford: Five things we learned as champions hit eight in record-breaking win", "language": "en", "text": "City smash Watford to return to winning ways\n\nThe first setback of Manchester City’s Premier League title defence may only have come a week ago, but it is a distant memory after this emphatic return to domestic form with basement-dwelling Watford hit for eight without reply\n\nIn a reprise of May’s FA Cup final at Wembley, City mercilessly ran up the score without a second thought for their opponents.The champions scored their first five goals in only 18 minutes, the fastest any Premier League side has ever gone 5-0 ahead.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nBernardo Silva took home the match ball and almost appeared embarrassed to score his third. David Silva, Sergio Aguero, Riyad Mahrez, Nicolas Otamendi and Kevin de Bruyne shared the rest of the spoils.\n\nCity were brilliant, irrepressible and dominant from the first whistle, but if you ever needed a reminder of the aching gulf in class between the top and the bottom of the Premier League table, here it was.\n\nUnplayable De Bruyne is division's best\n\nThere were too many goals to break each down individually, but watch back the first and you will see City’s most effective weapon used to devastating effect.\n\nDe Bruyne has perfected the art of taking up space in the inside-right channel, arcing the ball across the face of a retreating defence for a far post finish. So he did with here after just 53 seconds, with Silva tapping in to establish City’s lead.\n\nThe sheer precision of these passes make them almost unplayable. Any touch by a defender risks scoring an own goal, but allow the ball to pass through and you are just as likely to concede.\n\nNo other player in the Premier League has such a menacing delivery. No other player in this country is on his level.\n\nFoulquier’s afternoon to forget\n\nFor defeats this heavy, there has to be someone to blame and at Watford, this day will forever be associated with Dimitri Foulquier.\n\nHaving signed from Granada in the summer of 2017 and spent the time since on loan, the right-back has waited two years to make his Premier League debut. It lasted 33 minutes.\n\nFoulquier was no more at fault for City’s goals than the rest of his team-mates. Flores could have hauled any one of them off, but managers need to be seen to be doing something after shipping five in the first half. Poor Foulquier was the fall guy.", "description": "City smash Watford to return to winning ways The first setback of Manchester City’s Premier League title defence may only have come a week ago, but it is a distant memory after this emphatic return to domestic form with basement-dwelling Watford hit for eight without reply In a reprise of May’s FA Cup final at Wembley, City mercilessly ran up the score without a second thought", "authors": ["Mark Critchley"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/21/16/manchester-city.jpg", "published_at": "2019-09-21"}