{"pub": "fox", "url": "https://foxnews.com/media/democrat-debate-msnbc-sexual-abuse-scandal", "downloaded_at": "2019-10-16 20:58:01.611429+00:00", "title": "Women’s group calls for Dems to pull MSNBC debate amid ‘culture of sexual abuse’ at NBC News", "language": "en", "text": "A prominent women’s group has called on the Democratic National Committee to pull its upcoming debate from MSNBC unless NBC News “cleans house” and launches an independent investigation into “allegations of a culture of sexual abuse” at the network.\n\nUltraViolet Action, a leading national women’s organization, thinks the fifth Democratic presidential debate – which is currently scheduled to air on MSNBC next month – shouldn’t happen if NBC keeps its beleaguered leadership in place.\n\nNBC NEWS BOSS ANDY LACK’S LEADERSHIP SCRUTINIZED AS RONAN FARROW TELL-ALL APPROACHES\n\n“The DNC needs to make it clear that they support survivors of sexual abuse and cancel the upcoming 2020 Democratic presidential primary debate on MSNBC until Comcast and NBC News take clear steps to clean up the toxic culture that exists across their networks,” UltraViolet co-founder Shaunna Thomas said in a statement.\n\n“The DNC needs to make it clear that they support survivors of sexual abuse and cancel the upcoming 2020 Democratic presidential primary debate on MSNBC until Comcast and NBC News take clear steps to clean up the toxic culture that exists across their networks.\" — UltraViolet co-founder Shaunna Thomas\n\nThe DNC did not immediately respond to a request for comment.\n\nRonan Farrow’s book, “Catch and Kill,” hit stores this week and details allegations that NBC refused to expose Harvey Weinstein as a sexual predator. The book also suggests the Peacock Network wasn’t truthful regarding knowledge of alleged sexual misconduct by former “Today” co-host Matt Lauer.\n\nFarrow reported that Weinstein leveraged information regarding Lauer to keep NBC off his back. Farrow’s former NBC News producer Rich McHugh, who is a key figure of the book, also penned a recent Vanity Fair column that said NBC News Chairman Andy Lack, and his top deputy Noah Oppenheim, breached “journalistic integrity” when they put the kibosh on the Weinstein story.\n\n“Mounting reports show that NBC News executives – namely Noah Oppenheim – failed to hold sexual abusers accountable, failed to combat a toxic culture across newsrooms, and that the network’s so-called investigation into its culture was little more than a sham to provide cover for executives,” Thomas said.\n\nMIKA BRZEZINSKI PUBLICLY SUPPORTED NEWS VET BROKAW AMID MISCONDUCT CLAIMS, PRIVATELY APOLOGIZED\n\nNBC famously told Farrow that his reporting on Weinstein wasn’t fit to print, so he took it to The New Yorker where it won the Pulitzer Prize and helped launch the #MeToo movement. “Catch and Kill” details Farrow’s side of the story and features additional accusations against NBC News bigwigs.\n\n“Additional reports that MSNBC executive Phil Griffin showed staff graphic images of Access Hollywood personality Maria Menounos prove that this toxic culture is an epidemic that extends across nearly all newsrooms and networks at the company,” Thomas said. “Taken together, these initial reports demonstrate that NBC’s current leadership is either unable or unwilling to take appropriate steps to combat the culture of sexual abuse at the networks.”\n\nAfter the Weinstein and Lauer bombshells were reported in 2017, NBC refused to hire an outside investigator to determine who knew about Lauer’s sexual misconduct and whether NBC executives looked the other way. NBC relied on in-house general counsel Kim Harris despite widespread calls for an outside law firm to conduct the review.\n\nNBC eventually declared that management was completely oblivious to Lauer’s behavior and Harris’ high-powered colleagues were cleared by the network. Lack and Oppenheim remain atop NBC News.\n\n“The DNC must stand with survivors and pull the upcoming democratic presidential primary debate from MSNBC until Comcast takes clear steps to clean house at NBC News.\" — UltraViolet co-founder Shaunna Thomas\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe UltraViolet founder said the ongoing issues “can only be solved by significant structural and cultural changes at MSNBC, NBC News and its parent company, Comcast,” and called on the DNC to stand with women and force necessary changes.\n\n“The DNC must stand with survivors and pull the upcoming democratic presidential primary debate from MSNBC until Comcast takes clear steps to clean house at NBC News,” Thomas said.\n\nMSNBC and NBC News did not immediately respond to a request for comment.\n\nUltraViolet bills itself as “a powerful and rapidly growing community of people mobilized to fight sexism and create a more inclusive world that accurately represents all women, from politics and government to media and pop culture.”", "description": "A prominent women’s group has called on the DNC to pull its upcoming debate from MSNBC unless NBC News “cleans house” and launches an independent investigation into “allegations of a culture of sexual abuse” at the network.", "authors": ["Brian Flood", "Ultraviolet Co-Founder Shaunna Thomas", "Brian Flood Covers The Media For Fox News. Follow Him On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/LauerLackOppenheimSplit.jpg", "published_at": "2019-10-16"}