{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/30/max-scherzers-approach-his-last-pitches-explains-everything-about-him", "downloaded_at": "2019-10-01 00:09:12.754026+00:00", "title": "Max Scherzer’s approach to his last 15 pitches explains everything about him", "language": "en", "text": "“It’s the most competitive inning,” Scherzer said of going deep, his voice calm and eyes intense. “You got to absolutely bring it.”\n\nThe Washington Nationals need their ace at his best in the playoffs, which starts Tuesday night at home with the National League wild-card game against the Milwaukee Brewers. Scherzer has never pitched in the wild-card round, but he is treating this like any other elimination game. It might seem unlikely the right-hander would even get to those last 15 pitches — he typically starts on them with a pitch count around 100 — because do-or-die games usually mean quick hooks. But Manager Dave Martinez intimated Sunday that he wouldn’t lift him at the first sign of trouble.\n\nAD\n\nAD\n\nMax Scherzer feels as strong as ever for wild-card start\n\nThe manager waved off any concern that his star pitcher felt any lingering effects from the back injuries that forced him to miss six weeks of the second half. He reiterated Scherzer’s last five outings of the season — less than six innings per start, a 5.16 ERA — did not represent his actual ability. He blamed the team for limiting Scherzer and assured everyone “he’s going to be better than fine.”\n\nLast week, Scherzer told Martinez he’s ready to throw 120 pitches Tuesday. The veteran right-hander’s tone alone showed the manager how “jacked up” his starter is.\n\n“And rightfully so,” Martinez said. “We’ve got to play a one-game series. For me, who better to start that game than Max? We talked about [Stephen Strasburg], but if this all works out, now all of a sudden you’ve got Stras and [Patrick] Corbin for the next [series].”\n\nAD\n\nAD\n\nThe Post analyzed, pitch by pitch, each of Scherzer’s final innings this season and found that, if Scherzer gets deep into the game Tuesday, if he nears his unload inning, the numbers indicate Martinez should not hesitate to leave his starter in. Scherzer has been at full strength for 17 final frames since May and, while his strikeout rate dips slightly, his hit rate, walk rate and ERA do, too. He has allowed four runs in 22⅔ innings, though all four came within his past three starts.\n\nThe analysis revealed that, in a last inning, Scherzer doesn’t look tired. He pitches just as strong as he does in the first — sometimes stronger. He throws strikes at nearly the same rate (67 percent) and his fastball just as hard, if not harder. He consistently touches 97 and 98 mph on his last pitches of the game and rises to the situation. He’s allowed three leadoff doubles in his last inning of a game since May and allowed none of those runners to score.\n\nScherzer navigates the end of his outings using almost the same arsenal he starts with. He depends on the fastball (45 percent), change-up (14), curveball (8) and cutter (7) at about the same rate as he does in any other inning. His slider, though, jumps from about 20 percent to 27. Scherzer asserts there’s no special reason he relies on the slider late, it’s not easier to control when he’s tired or more effective against hitters who have seen him a few times by then. Scherzer chooses, moment by moment, whether to pitch by the scouting report or by what he’s feeling good about that day.\n\nAD\n\nAD\n\n“That's instincts,” he said. “You do the same thing over and over again, they'll beat you. You got to be able to change it up.”\n\nBoswell: Sharks are chomping at Nats Park, and I think we’re going to need a bigger bandwagon\n\nScherzer started thinking about his last 15 pitches when he got to college. The kid had, in high school, gotten by even when his velocity fell from the low 90s at the start of the game to the mid-80s when he finished. He realized at Missouri he couldn’t survive on fire and struggled to finish starts. He started throwing more and, in the weight room, strengthened his legs and chest and back, building his body to withstand more innings.\n\n“[That’s] when I finally had to start getting my man strength,” Scherzer said.\n\nMissouri’s pitching coach, Tony Vitello, matched Scherzer’s energy and pushed his young starter to stay stronger later. Vitello preached getting ahead of hitters, and Scherzer found over time that he could do it with swings and misses on his fastball deeper and deeper into games. The Mizzou pitching staff used to compete by throwing at targets on a tarp called the “Control Master,” and catcher J.C. Field watched from behind the plate as Scherzer became one of the best at putting a fastball at the knees, inside or out. What he saw then, at practice and late in games, became the coda to Scherzer’s starts.\n\nAD\n\nAD\n\n“Between the ears, he was stronger than anyone I ever knew,” Field said, adding, “He would be really hard on himself every time he missed a spot in a bullpen. It was that consistent competitiveness on a pitch-to-pitch basis.”\n\nScherzer has reached heights few could have seen coming in those early days at Missouri. Yet he’s never captured the elusive World Series title. He returned to Detroit earlier this season for the first time since he signed with the Nationals in 2015, and he sat in the Comerica Park visitors’ dugout, expressing disbelief that those Tigers teams never won one. He has had promising chances in Washington, too, but none ever panned out. He’s 35 now and running out of time, closing in on the last 15 pitches of his career.\n\nHe knows it. This team, after the year it’s had, seems to give him as good a chance as any. The Nationals need him in top form Tuesday, first pitch to last. He knows it’ll be a challenge.\n\nAD\n\nAD\n\n“I don’t win ‘em all. I don’t,” he said recently in the Nationals’ clubhouse. “I’ve been beat in those situations plenty of times. But you got to want the ball in that situation no matter what.”\n\nHe was talking about his mind-set in a final frame, but it seemed bigger.\n\nAD\n\nAD\n\nRead more on the Washington Nationals:\n\nNew York to new life: How a humbling sweep set the Nationals straight\n\nCharting the wildest season in Nationals history\n\nThe 12 best moments from the Nationals’ wild 2019 season\n\nSvrluga: Ryan Zimmerman is at the end of his deal, and it’s hard to imagine the Nats without him\n\nBaseball according to Gerardo Parra\n\nAD", "description": "In his starts, the Nationals ace cares most about emptying the tank.", "authors": ["Sam Fortier", "Sports Reporter"], "top_image": "https://www.washingtonpost.com/resizer/fiTY37FJrSuzKAXUuOYOm8EzyrY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3NMVLVHANMI6TPT7JTEFAF6DN4.jpg", "published_at": "2019-09-30"}