{"pub": "cbc", "url": "https://cbc.ca/sports/hockey/nhl/nhl-off-season-calgary-flames-1.5239908", "downloaded_at": "2019-09-22 23:11:44.397223+00:00", "title": "Sports-no-CBC", "language": "en", "text": "To prepare you for the opening of NHL training camps in mid-September, CBC Sports will do a deep dive on each of the seven Canadian-based clubs every Thursday. Today, we examine the Calgary Flames.\n\nThe Calgary Flames already have experienced an eventful off-season. There was the approval of a new home, a downtown $550-million arena. They cut ties with veteran goalie Mike Smith, allowing him to reunite with his old coach Dave Tippett up the highway with the Edmonton Oilers.\n\nA disappointing James Neal was dealt to the Oilers for an equal disaster in Milan Lucic.\n\nThey almost traded defenceman T.J. Brodie to the Toronto Maple Leafs for Nazem Kadri, who nixed the deal. They made 26-year-old Czech David Rittich their undisputed No. 1 goalie with a new two-year contract worth $2.75-million a season.\n\nThe Flames also bought out defenceman Michael Stone and brought in a backup goalie Cam Talbot as well as capable depth players for the organization in Calgary-area residents Brandon Davidson and Byron Froese.\n\nBut the biggest headline grabber has yet to occur. Flames restricted free agent Matthew Tkachuk remains unsigned.\n\nCalgary general manager Brad Treliving, in charge of the Flames since April 2014, is not alone at this point in the summer. Several high-profile RFAs have yet to be signed. See Brock Boeser (Vancouver), Mitch Marner (Toronto), Colin White (Ottawa), Kyle Connor and Patrik Laine (Winnipeg), Jesse Puljujarvi (Edmonton), Charlie McAvoy (Boston), Travis Konecny (Philadelphia), Mikko Rantanen (Colorado) and others.\n\nCap crunch hits Calgary\n\nThe Stone buyout helped clear some salary-cap space. But Treliving only has about $7.757-million of room to sign Tkachuk and fourth-liner Andrew Mangiapane.\n\nThat's why Treliving still may move a defenceman like Brodie or Travis Hamonic. The Flames have plenty of critical pieces in place upfront with Johnny Gaudreau, Sean Monahan, Mikael Backlund, Elias Lindholm and Tkachuk. But they have a bountiful blue line with Norris Trophy-winning Mark Giordano, Noah Hanifan, Brodie, Hamonic, Juuso Valimaki and the emerging Rasmus Andersson.\n\nWATCH | Flames bow out of playoffs in first round:\n\nColorado beat Calgary 5-1 in Game 5 to wrap up a 4-1 series win and eliminate the Flames from the NHL Playoffs. 2:05\n\nIn the first regular season under new head coach Bill Peters, the Flames enjoyed a 23-point improvement to finish first in the Western Conference.\n\nBut they wound up being the first team eliminated in the playoffs in the West. The Flames didn't have an answer for Colorado's Nathan MacKinnon, a beastly forward who scored three goals and eight points in the five-game series.\n\nCalgary picked up where it left off from the regular season with a 26-save shutout win from Smith. MacKinnon was held pointless in the series opener.\n\nSearching for sandpaper\n\nBut overtime losses in Games 2 and 4, and one-sided defeats in Games 3 and 5 doused the Flames' hopes of winning the franchise's second playoff series since its trip to the 2003-04 Stanley Cup final against the Tampa Bay Lightning.\n\nThe Flames weren't the only contending team that made an early playoff exit from the playoffs last spring. We saw the Presidents' Trophy-winning Lightning swept in the first round. Alex Ovechkin and the defending Stanley Cup-champion Washington Capitals also were ousted in the first round, as were the Nashville Predators and Winnipeg Jets.\n\nThe Flames were missing grit in the postseason. That's why Treliving went after a trade for Kadri. Maybe a Brodie or Hamonic yields some sandpaper in a trade.\n\nBut Tkachuk remains an essential part of the Flames roster. He has toughness. He has skill as evident from his increase in goal totals in his first three seasons from 13 to 24 to 34 goals last season. He added two more goals in his five-game playoff appearance.\n\nThe 21-year-old left wing is such a dynamic player to the Flames cause. His signature on a contract before the season commences needs to be the biggest news of the off-season in Calgary.", "description": "The Calgary Flames already have experienced an eventful off-season. There was the approval of a new home, they cut ties with Mike Smith and James Neal and nearly traded T.J. Brodie. But the biggest headline grabber has yet to occur — restricted free agent Matthew Tkachuk remains unsigned.", "authors": ["Tim Has Covered The Hockey Landscape", "Other Sports In Canada For More Than Years For Cbc Sports", "The Globe", "Mail", "Toronto Sun. He Has Been To Three Winter Olympics", "Stanley Cups", "A World Championship As Well As World Junior Championships", "Memorial Cups", "University Cups. The Native Of Waterloo", "Ont."], "top_image": "https://i.cbc.ca/1.5239944.1565270586!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/tkachuk-matthew-080819.jpg", "published_at": "2019-08-08"}