{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7614915/Woman-gives-birth-twins-conceived-15-year-old-boy-sexually-assaulting-years.html", "downloaded_at": "2019-10-26 02:15:41.708387+00:00", "title": "Woman 'gives birth to twins conceived by 15-year-old boy she was sexually assaulting for years'", "language": "en", "text": "Spring Turner, 40 (pictured), from Deland, Florida, was arrested on Thursday after deputies received a tip that Turner had been sexually assaulting a teenage boy starting at age 15\n\nA Florida woman has been arrested after allegedly sexually abusing a teenage boy for years and then giving birth to twins that he fathered.\n\nAccording to the Volusia County Sheriff's Office, deputies received a trip in April that Spring Turner, 40, had been abusing the teen from the age of 15.\n\nThey learned that she had gotten pregnant by him when he was 17 years old, reported News 6.\n\nWhen officers interview the victim, he told them that Turner, of Deland, would get him on high on marijuana before having intercourse with them.\n\nNews 6 reported that the boy said the abuse occurred while they were living in the same home.\n\nDetails weren't clear as to how or when the boy met Turner and why they were living in the same house.\n\nThe teenager, in records viewed by TKTK, told deputies that the sexual abuse occurred at least 20 times from ages 15 to 17.\n\nHe alleged it would occur either when he came home from school or at night, and that he didn't want to have sex with Turner.\n\nAccording to records, the victim said the last incident of abuse took place on Fourth of July in 2018.\n\nTurner allegedly threatened to kick the boy out unless he had sex with her, which resulted in her pregnancy.\n\nOn social media accounts, viewed by DailyMail.com, Turner posted several photos and videos of the twins - one boy and one girl - gushing about them.\n\nWhen police interviewed Turner, she said she didn't know who the father of her twins was, the affidavit stated, reported News 6.\n\nAuthorities say she claimed she was told by people that she had sex with the boy when she was drunk but that she couldn't recall it happening.\n\nThe boy said Turner (pictured) would get him high on marijuana and that they lived in the same house and she threatened to kick him out unless they had sex\n\nWhen he was 17, Turner (left and right) became pregnant by him and gave birth to twins, a boy and a girl. She was charged with sexual battery of a minor older than 12 and younger than 18\n\nTurner also allegedly stated that she felt compelled to do whatever the teen wanted for fear of being 'punished'.\n\nHowever, it wasn't immediately clear what 'punishments' Turner claimed would be dolled out.\n\nAccording to the affidavit, a DNA test was performed, which determined that the teenager was the father of the twins, News 6 reported.\n\nOn Thursday, Turner was arrested and charged with sexual battery of a minor older than 12 and younger than 18.\n\nThe first-degree felony is punishable in Florida with a fine, up to 30 years in prison, or both.\n\nIt wasn't clear what happened to the twins upon Turner's arrest.\n\nThe Volusia County Sheriff's Office did not immediately return DailyMail.com's request for comment.", "description": "Spring Turner, 40, from Deland, Florida, was arrested on Thursday after she gave birth to twins that police say were fathered by a 17-year-old boy she was sexually assaulting for at least two years.", "authors": ["Mary Kekatos For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/21/20194774-0-image-a-67_1572035376235.jpg", "published_at": "2019-10-25"}