{"pub": "fox", "url": "https://foxnews.com/us/charleston-west-virginia-christmas-parade-name-change", "downloaded_at": "2019-10-11 00:17:49.273295+00:00", "title": "West Virginia mayor restores city's 'Christmas Parade' after protests over name change", "language": "en", "text": "The mayor of West Virginia's capital city has reversed her earlier decision to rename the annual \"Charleston Christmas Parade\" the \"Charleston Winter Parade\" after protests.\n\nMayor Amy Goodwin announced the original name change Monday, saying it would encourage inclusivity. However, the parade's theme was to remain \"Twas The Night Before Christmas.\"\n\nWEST VIRGINIA LAWMAKER CALLS OUT TRUMP FOR 'USING LORD'S NAME IN VAIN' DURING RALLY\n\n“The City of Charleston is an inclusive community. We want everyone to participate in this parade,” Goodwin said in a video posted to Facebook.\n\nThe decision prompted a backlash, with Republican State Senate President Mitch Carmichael urging constituents to plead with Goodwin to reverse the name change. Officials from several churches quickly criticized the decision and said they wouldn't attend.\n\nOn Thursday, Goodwin reversed her original decision \"after much consideration and conversation with religious leaders from all faiths and community members.\"\n\n\"We understand the history and tradition of the parade and we want to continue that for years to come,\" she said in a statement posted to Facebook.\n\n\"I truly appreciate all the calls, emails and feedback we have received regarding the Charleston parade. However, the kind of vitriol that has come forth since announcing the change in the name of the parade has been truly disappointing and hurtful. But I do respect those individuals’ freedom to deliver that message to my doorstep,\" she said.\n\nGoodwin still kept to her message of inclusivity, saying: \"To be sure, this city needs everyone included. We need to be kind. We need to work together, and this administration will continue to work every day for a more inclusive community where everyone is welcome to celebrate and come together.\"\n\nCLICK HERE FOR THE FOX NEWS APP\n\nCarmichael praised Goodwin's change of heart, saying in a statement: \"Christmas celebrates the birth of our Lord and Savior Jesus Christ. It is a central holiday for thousands of Christians in our Capitol City and throughout West Virginia.\n\n“I am thankful Mayor Goodwin listened to her constituents and decided to cancel her plans to rename the parade ... People of all faiths, Christian, Judaism, Islam and all other faiths, should never feel as though the government is prohibiting their ability to worship and celebrate their religion. That is what inclusion looks like and that is what West Virginia should look like.\"\n\nThe Associated Press contributed to this report.", "description": "The mayor of West Virginia reversed a decision to rename the capital city's annual \"Charleston Christmas Parade\" to the \"Winter Parade\" after religious leaders in the community decried the name change.", "authors": ["Vandana Rambaran", "Vandana Rambaran Is A Reporter Covering News", "Politics At Foxnews.Com. She Can Be Found On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/07/ContentBroker_contentid-9ff1589207394a7cbf06aa387bb449a5.png", "published_at": "2019-10-10"}