{"pub": "marketwatch", "url": "https://marketwatch.com/story/demand-for-climate-proofed-portfolios-was-a-key-proxy-season-theme-this-year-2019-09-10", "downloaded_at": "2019-09-11 13:58:49.476245+00:00", "title": "Demand for climate-proofed portfolios was a key proxy-season theme this year", "language": "en", "text": "Shareholders want Amazon.com AMZN, -0.33% to come clean on the amount of fossil fuels it burns and reveal how it plans to buffer profits from environmental risk as it zooms packages around the world.\n\nTheir own stakeholders insist that oil-industry stronghold Chevron CVX, +0.60% cut its carbon footprint and that Michael Kors, a unit of Capri Holdings CPRI, +1.05% , reveal how much energy it uses to stitch and ship its designer clothes.\n\nThese investors, including some of the fund firms acting on investors’ behalf, are squawking loudly enough on climate-risk disclosure to impact recently released results from the 2019 proxy season: Shareholder support for climate-related resolutions at the companies they invest in hit an all-time high of 30% in the latest filing round, Morningstar’s Jon Hale and Jackie Cook confirmed.\n\nThe analysts, part of the Chicago-based fund research and data firm’s environmental, social and governance team, stressed that even as the percentage of shareholder support per climate issue is rising, the number of shareholder resolutions coming to a company vote has dropped sharply.\n\nThat’s not necessarily because of a lack of environmental and social concern, Cook told MarketWatch in an interview. Instead, sensing the groundswell of interest, more companies are heading off environmental-risk and social-capital issues raised by shareholders long before votes are forced. It’s roughly the stock market’s equivalent of settling out of court.\n\nMorningstar The trend toward demanding more climate-risk disclosures from stock holdings, tracked by the yellow line, is rising.\n\nTrillium Asset Management, for example, filed a resolution at EOG Resources EOG, +2.00% requesting that the oil-and-gas explorer set and disclose goals for methane-emission reduction. After some back-and-forth, the company committed to reduce its methane emissions and set longer-term emissions goals, and the shareholder resolution was withdrawn.\n\nRead: Regulation rollback expected for climate-changing methane releases from oilfields\n\nIn 2016, 57 resolutions asking companies to report on their business risks and strategy with respect to climate change were put to shareholder votes. By comparison, in 2019, there were more withdrawals of climate-risk disclosure resolutions than the 17 that actually faced votes.\n\nThirty-percent support is the level at which many boards take note of a proposal topic; at 50% support, if the board is deemed to take insufficient action in response, many investors will consider voting against incumbent directors at the next annual meeting. Since 2004, shareholders have voted on over 400 resolutions asking companies to report on the business risks of climate change and to disclose strategies for addressing these risks.\n\nMorningstar Shareholders put the most ‘climate minded’ pressure on these firms this proxy season.\n\nSEC’s ‘ordinary business’ pass on emissions\n\nThere’s a notable factor that is dissuading company responses to shareholder climate requests, however. The regulatory atmosphere eased at the Securities and Exchange Commission by way of “no-action” letters between July 2018 and June 2019.\n\nIn a particular 2018 case, the SEC broke with years of precedent, according to Morningstar, by granting EOG Resources no-action relief for omitting from its ballot a shareholder resolution asking the company to “adopt company-wide, quantitative, timebound targets for reducing greenhouse gas emissions and issue a report discussing its plans and progress toward achieving these targets.”\n\nOther companies could then play the same card, and they did in 2019. At least five resolutions were omitted this year on the basis that the request for greenhouse-gas-emission goals interfered with the regular operation of business, according to SEC filings, and possibly more were deterred from being filed in the first place.\n\nThe regulatory shift appears in contrast to the fact that “shareholders increasingly want companies to provide decision-useful information, including measurable, timebound greenhouse gas emission reduction goals, and plans for how they will adjust their operations and products to compete in the transition to a low-carbon economy,” said Morningstar’s Hale, in a report.\n\nThe broader interpretation at the SEC “has had a damping effect on the willingness of shareholders to file and defend these types of disclosure requests,” agreed Heidi Welsh, executive director of the Sustainable Investments Institute.\n\nYet companies have to embrace the broader movement, and are. Fully 63% of Fortune 100 companies that disclose engaging with investors over the past year say environmental and social factors were among the topics of focus, according to EY, the global organization of Ernst & Young, in a proxy-season report. Outside of climate issues, shareholders in this proxy round intensified their attention on corporate lobbying spending and executive diversity, as well as opioids and gun issues.\n\n“Many investors have also told us they are further integrating ESG considerations into their stewardship programs and broader approach, and want to see boards prioritize oversight of company-relevant environmental and social issues and human-capital management,” the EY report said.\n\nWith this in mind, the Climate Action 100+ Coalition, launched in December 2017, is the largest-ever coalition of investors, representing $33 trillion in assets under management. Among the members, the California Public Employees’ Retirement System, known as Calpers, joins other major pensions and investment groups from Japan, Australia and elsewhere. Many of the resolutions in the U.S. proxy process ask companies to use a reporting framework developed by the Taskforce on Climate Related Financial Disclosures.\n\nRead: Maximizing shareholder value can no longer be a company’s main purpose: top CEOs\n\nThe funds going to bat on climate\n\nMorningstar’s Cook also pointed to a shifting mood among funds acting on behalf of investors’ concerns for environmental factors. Of the funds provided by the “Big Three” asset managers, State Street’s support for environmental and social shareholder resolutions is markedly higher than either BlackRock BLK, +0.38% or Vanguard, which tend to rely on engagement initiatives over proxy voting, said Cook.\n\nVanguard, in a 2018 report on stewardship, made clear that its role is sometimes sizing up a company’s public commitments compared with a particular investor proposal. In one instance, the fund family engaged with two unnamed U.S. consumer companies that received similar shareholder proposals for enhanced sustainability reporting.\n\nThe first company’s existing sustainability disclosure was limited, and Vanguard backed its investors’ push for more reporting, Vanguard senior strategist Marc Lindsay detailed in the report. But Vanguard voted against the proposal at the second, already more open, company, believing that the shareholder action was misdirected given the company’s already “leading sustainability disclosures and approach.”\n\nAs for other fund groups, State Street and Geode, spun off from Fidelity in the early 2000s, have considerably increased their support for environmental and social shareholder resolutions, said Cook. And among the smaller firms, strong support lately for climate-focused corporate initiatives from funds offered by DWS, Natixis and Nuveen is consistent with track records of support for environmental and social issues, she added.\n\nInvestors who care about the climate-focused makeup of their funds are advised to track the efforts of the fund families they invest with as well as corporate actions, or lack thereof, around such issues.\n\nIn just a sampling from the latest proxy season: JP Morgan JPM, -0.36% funds voted across the board against investor actions directed at the handful of companies at which resolutions made it to the voting stage — mostly centered on greenhouse-gas-emission reduction or methane measuring.\n\nThe fund group under Goldman Sachs GS, +0.34% voted in favor of all; BNY Mellon voted against most resolutions that called out energy firms but agreed with its investors that Amazon should be more forthcoming on its climate-change resilience and fossil-fuel use.\n\nVanguard, for its part, had a mixed response this proxy season. It voted against investors’ urging of energy firm Fluor FLR, +1.16% to pledge a specific greenhouse-gas-emissions reduction and similarly let Michael Kors and Ross Stores ROST, +0.00% off the hook for now. But it backed shareholder demands that Duke Energy DUK, -0.26% be more accountable for mitigating health and climate risks and agreed to step up pressure on greenhouse-gas emissions at aerospace company TransDigm TDG, +0.22% . BlackRock voted down all investor climate initiatives except for the emissions directive for Ross Stores.\n\n“When your largest investors stress the need to diversify your board, or more actively address climate change or develop new governance practices, it adds considerable credibility to the debate around climate or diversity and registers in company boardrooms,” said Timothy Smith, director of ESG shareowner engagement at Walden Asset Management.\n\n“We are not close to the end but more in the middle of this story. BlackRock [whose CEO, Larry Fink, has made ripples with a letter on ESG issues to company CEOs] and Vanguard have a long way to go, but seeing the impact of their first two climate votes ... at Exxon XOM, +0.85% and Occidental Petroleum OXY, +0.13% [during earlier proxy seasons] may motivate them to leverage their proxy votes at more companies.”\n\nRead: Why are green housing bonds not getting more love from ESG investors?", "description": "Shareholder support for climate-related resolutions climbed to an all-time high of 30% in the latest proxy round.", "authors": ["Rachel Koning Beals", "News Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ937_amazon_ZG_20190909114830.jpg", "published_at": "2019-09-10"}