{"pub": "thehill", "url": "https://thehill.com/blogs/congress-blog/civil-rights/465844-difficult-issues-involving-human-sexuality-require-dialogue", "downloaded_at": "2019-10-15 16:25:29.154759+00:00", "title": "Difficult issues involving human sexuality require dialogue, not scorn, misinformation", "language": "en", "text": "On Oct. 8, I had the privilege of representing Harris Funeral Homes at the U.S. Supreme Court in my role with Alliance Defending Freedom. I participated in the oral argument and the rally that followed. Yet I do not recognize the description of each that some in the media have described.\n\nHarris is a straightforward case. It’s not about “transgender equality.” It’s about whether businesses and everyday Americans have the right to rely on the law the way it is written. It involves a fifth-generation funeral home that has served grieving families in the Detroit area with distinction for more than 100 years. In 2007, the funeral home hired a male employee as a funeral director—a position that serves as the face of the funeral home and works closely with grieving families.\n\nThe employee agreed to follow all company policies, including the sex-specific dress code, which is proper under federal law. But after nearly six years of employment, the employee announced a plan to begin presenting and dressing as a woman at work while interacting with grieving families. Tom Rost, the employer, took two weeks to think about the impact this would have on all his employees and grieving clients. He decided he couldn’t agree.\n\nThe Equal Employment Opportunity Commission used Tom and the employee as pawns in a strategy to change the law without going to Congress. Specifically, the EEOC asked the federal courts to redefine the word “sex” in sex discrimination to mean “transgender status.” A federal court of appeals panel did exactly that. And though the federal government has changed position and supports the funeral home, the American Civil Liberties Union now represents the employee and continues to push for a judicial rewrite of the statute.\n\nBut some, preferring not to see the case in this light, are coming up with highly inaccurate observations. For example, columnist Dana Millbank believes that Justice Neil Gorsuch Neil GorsuchSupreme Court can prove its independence — or its partisan capture Harris says Trump should be in 'timeout' from appointing a Supreme Court justice Supreme Court grapples with LGBTQ rights in the workplace MORE is in a box, because he supposedly wants to rule against the LGBT community but can’t because of his stated commitment to “textualism,” the judicial philosophy that statutes must be interpreted according to their original public meaning at the time of enactment.\n\nThis is wrong in two crucial respects. First, “textualism” is not unique to Justice Gorsuch. All nine justices endorse the principle; multiple so-called “liberal” justices have famously stated that “we’re all textualists now.”\n\nSecond, this view ignores the original public meaning of the actual statute. Title VII prohibits “discrimination” “because of” “sex,” words that the Supreme Court has interpreted for decades to mean treating women worse than similarly situated men, or vice versa. It is impossible to say that the funeral home is treating men worse than women; if a female funeral director asked to violate the dress code by dressing as a man, the funeral home would say no to her request, too.\n\nWhile the law requires women and men to be treated equally, nowhere does it say that men must be treated as women. That’s why Justice Gorsuch asked the ACLU’s lawyer if the court could judicially rewrite the statute. It should concern all Americans when judges legislate from the bench in such a manner.\n\nWhy would some pundits not be honest about all this? Perhaps because, if Justice Gorsuch follows the rules that bind him, those who don’t like the outcome can claim that his decision (and that of the other conservative justices) was illegitimate and need not be followed. It lays the foundation for “court packing,” a concept endorsed by nearly every current Democratic candidate for president.\n\nThe justices also asked many questions about how redefining “sex” in federal law would impact women’s rights and bodily privacy. Far from being a “parade of horribles,” these effects are happening right now.\n\nIn Alaska, local officials redefined “sex” to try and force a women’s overnight shelter to allow a man identifying as a woman to sleep mere feet away from women who have been raped, trafficked and abused. A federal court enjoined that bureaucratic effort.\n\nIn Connecticut, local officials redefined sex to allow two boys identifying as girls to take 15 state track-and-field championships in the past two years, titles that would have gone to nine different girls. When asked about the situation, an official said that girls have the right to participate, but not the right to win.\n\nAnd as I explained to the Supreme Court, if the ACLU prevails, every sex-specific shower, restroom, locker room, overnight facility, dress code, and sports team in the country will almost certainly have to go. The ACLU argues that it is sex discrimination to apply any sex-specific policy to someone who claims one of the more than 70+ gender identities, because “sex” itself is a stereotype. If true, such policies can’t be applied to anyone, because it would also be sex discrimination to apply the policies to no one but those who identify with their biological sex.\n\nFinally, there’s this description of the rally outside the court: “A large group of LGBTQ-rights activities dominated a small contingent bearing signs saying ‘GOD HATES PRIDE.’” I spoke at the rally and did not happen to see this “small contingent” or its sign. What I did witness were many women and girls, all respectfully asking that their rights to equal opportunity and bodily privacy be respected. They were brave, courageous and full of compassion.\n\nAnd “dominated” must refer to the LGBT activists who used bullhorns to scream in people’s faces, the LGBT protestors who shouted and swore at children, and the males identifying as females who bellowed that their (presumably surgically added) female body parts made them women, just without ovaries.\n\nThere’s no question that people experiencing gender dysphoria deserve compassion and respect. There are, however, many unresolved questions and ongoing conversations about the best ways to respect all Americans’ dignity and privacy. Such dialogue, and not misinformation, is what Americans need.\n\nJohn Bursch is vice president of appellate advocacy and senior counsel for Alliance Defending Freedom, (@AllianceDefends). The former solicitor general of Michigan, Bursch represented Harris Funeral Homes before the U.S. Supreme Court.", "description": "On Oct. 8, I had the privilege of representing Harris Funeral Homes at the U.S. Supreme Court in my role with Alliance Defending Freedom. I participated in the oral argument and the rally that followed.", "authors": [], "top_image": "https://thehill.com/sites/default/files/harris_funeral_homes_scotus_100819.jpg", "published_at": "2019-10-15"}