{"pub": "nymag", "url": "https://thecut.com/2019/09/reviews-armani-beauty-lip-maestro-matte-nature-lipsticks.html", "downloaded_at": "2019-09-26 20:59:11.169109+00:00", "title": "Do These Fancy Nude Lipsticks Really Look Good on Everyone?", "language": "en", "text": "Photo: Armani\n\nArmani Beauty’s Lip Maestro is one of the best-reviewed luxury lipsticks, with over 130,000 likes on Sephora. Its shade range has always been on the dramatic side, with lots of vivid reds and pinks, but now the brand has created an array of allegedly nude shades of pink and brown called the Matte Nature collection. New York Magazine staff members tried a few of the ten new shades. Read on to find out if they really do look like our lips, but better.\n\nAmanda Arnold, Staff Writer\n\nI’m going to get right to it: this liquid color is the best I’ve ever worn, and I’ve painted a lot of colors on my lips. For the past few years, when I’ve opted to wear a color on my lip, I’ve turned to bright reds — Fenty’s Stunna Lip Paint in “Uncensored” and Stila Stay All Day in “Beso” are my current staples. But this Armani lip stain, which I’m wearing in Granite (101), may just convince me to return to the nude-lip-only aesthetic that dominated my early 20s. The matte color, which is warm and peachy against my fair olive complexion, doesn’t go on too heavy, and therefore doesn’t wash me out. The doe-foot applicator has some flexibility, which I love.\n\nIt also passes what I believe to be the true test of a good lipstick: As I go throughout the day wearing it, my lips don’t become uncomfortably sticky or dry. While I do have to reapply after eating, I can get away for an hour or so with it being a little faded — it doesn’t require multiple trips to the bathroom throughout the day to ensure that the color hasn’t awkwardly worn off town the inside of my lip. I would absolutely recommend this lipstick to my lip-color-wearing friends.\n\nSarah Spellings, Fashion Writer\n\nI LOVE this formula but I chose the wrong color — I prefer a bluer-red. There’s nothing wrong with it, the color is just a bit too muddy for me. We live and learn. But the more important part is the formula, at least in terms of considering whether this is worth your money.\n\nIt goes on really velvety, as kind of a non-sticky gloss. It’s hydrating (or at least not drying) and is almost a bit slippery when you first apply it. The color application is hard to control, but once it’s on you, pretty much forget about it. I had this in a brighter red color and I’m genuinely sad I lost it.\n\nBrittany Brown, Copy Editor\n\nThe Armani lipstick goes on smoothly and feels velvety on your lips. I wear Anastasia lip primer under all of my lipsticks and it worked well with it. The one issue I had during application is the watery formula doesn’t dry quickly. However, I do love that my lips felt well-moisturized all day.\n\nThis doesn’t have the staying power of my go-to Fenty or Anastasia branded liquid lipsticks. If you want a strong color you’ll need to reapply after eating and drinking. But it wore off evenly throughout the day and I didn’t mind the hint of color it left behind. It was perfect for a chaotic day where I didn’t check myself in the mirror till late afternoon and found my lips looking like I had a tinted balm on. I’d definitely recommend it to a friend.\n\nErica Smith, Beauty Writer\n\nIf lips wore clothes, Lip Maestro would be the leggings you could technically work out in if you really had to, but mainly just wear so you don’t have to put on actual pants. It’s very comfortable. The formula is soft, silky, and non-sticky as promised. It has a mousse texture that glides on and consistently feels velvety; it was hard to stop rubbing my lips together because it felt so nice. I loved the color (206) because it was bright enough to make me look more alive, without going into bold statement lip territory which often carries commitment (like wearing real pants.)\n\nThe formula transferred onto cups and napkins throughout the day, but I was left with a true lip stain finish that’s almost as pretty as the original application. If you’re okay with sacrificing the staying power of a true matte liquid lipstick for comfort, then I’d give this a go.\n\nJane Larkworthy, Beauty-Editor-at-Large\n\nThis has a super smooth glide that goes on like butter and leaves as much coverage as a full-on opaque lipstick. I like the carefree application, comfortable feel, and I might be imagining things, but it felt somewhat cooling when it first went on.\n\nIt also lasted through a few hours of (paper) straw sipping, then quietly disappeared, but that’s fine by me. I’m not a huge lipstick fan, so I don’t mind transitory.\n\nWhat I’m not 100 percent sure of is the shade I chose. I’ve been a staunch “nude” girl my whole life, and shade 100, described as “sand - beige,” comes pretty close to my own lip color (maybe a little peachier). Maybe that’s why it fell a little flat on me. I’d be curious to try something with a little berry in it, but in a quiet, muted form. Say, more along the lines of a dusty goji over a ripe raspberry.\n\nIf you buy something through our links, New York may earn an affiliate commission.", "description": "Multiple reviews of Armani Beauty’s new range of nude lipsticks, Matte Nature Lip Maestro, which includes ten shades.", "authors": ["Kathleen Hou"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/26/armani/26-armani-lede.w1200.h630.jpg", "published_at": "2019-09-26"}