{"pub": "breitbart", "url": "https://breitbart.com/national-security/2019/10/01/police-shoot-teen-protester-as-hong-kong-turns-chinas-national-day-into-day-of-mourning", "downloaded_at": "2019-10-05 05:51:15.579535+00:00", "title": "Hong Kong Turns China’s National Day into ‘Day of Mourning’", "language": "en", "text": "A teenage activist in Hong Kong was hospitalized after being shot by a police officer at close range on Tuesday as demonstrations gripped the city on “National Day,” the 70th anniversary of the founding of the Communist People’s Republic of China.\n\nThe protesters sought to reframe the day as a “Day of Mourning” for freedoms lost.\n\nTuesday’s demonstrations were gigantic despite police insistence that many of the marches were illegal. The rallying cry shouted by many on the streets was, “There is no National Day celebration, only a national tragedy.”\n\nOpposition politician Lee Cheuk-yan said the Day of Mourning protests were a condemnation of “70 years of suppression” by the Chinese Communist Party and a solemn remembrance of “those who sacrificed for democracy in China,” including the victims of the 1989 Tiananmen Square massacre, an event Beijing has sought to erase from the history books.\n\n“We also condemn the fact that the Hong Kong government, together with the Chinese government, deny the people of Hong Kong the right to democracy,” Lee said, as quoted by the Hong Kong Free Press.\n\nThe HKFP quoted a demonstrator who said Chinese Communist Party ruler Xi Jinping “wants the world to think everyone in China loves him,” but “a lot of people here feel the opposite.”\n\nThis particular protester was wearing a Guy Fawkes mask, portrayed as a sign of resistance against tyranny in the 1980s comic book V for Vendetta and the more recent movie based on it. Others brandished every symbol of resistance or freedom they could find, from dressing like Captain America to lugging around giant Winnie-the-Pooh dolls covered with protest slogans. Winnie-the-Pooh is banned and aggressively censored in China because Xi Jinping has been mockingly compared to Pooh and his honey-infused rotund physique.\n\nXi gave a morning speech in Beijing in which he pledged to respect the limited autonomy granted to Hong Kong and Macau under the “one country, two systems” arrangement and promised to keep Hong Kong prosperous and stable.\n\nXi then rolled out a gigantic military parade bristling with advanced Communist weapons that started in Tiananmen Square. Among the dignitaries gathered at the site of the 1989 massacre to salute the marching troops was Hong Kong chief executive Carrie Lam, whose absence from her own city was duly noted and mocked by the protesters.\n\nThe police moved aggressively against rallies that were deemed illegal, and the protesters responded with everything from songs and chants to bricks and firebombs. They scrawled graffiti on buildings, trampled on photos of Xi, and tore down National Day banners. Protest leaders denounced Hong Kong’s MTR railway system, a frequent target of criticism, for trying to impose a de facto curfew on the city by shuttering many of its stations.\n\nProtesters scuffled with some pro-China counter-demonstrators, including some who described themselves as “flag protection squads” determined to prevent acts of vandalism against the People’s Republic of China flag. The main flag-raising ceremony in Hong Kong was essentially sealed off from the public and broadcast by television to avoid the possibility of protest disruptions.\n\nThe police shooting occurred in the Tsuen Wan district and was filmed by University of Hong Kong students. Live rounds were reportedly fired in the air as warning shots in several other locations, but the 17-year-old at Tsuen Wan became the first person to be shot by police with lethal ammunition during the current protest movement:\n\nVideo shows a protester in Hong Kong being shot at close range. The protester was shot by an officer who opened fire with his revolver, a police official was quoted as saying. pic.twitter.com/e9Oo3arH1G — NBC News World (@NBCNewsWorld) October 1, 2019\n\nThe injured protester was treated by paramedics at the scene and then taken to a hospital. He was filmed saying “My chest really hurts” before he lost consciousness. He was said to be in critical condition at the time of this writing.\n\n“A large group of rioters was attacking police officers in Tsuen Wan. Police officers warned them, but they were still attacking police. A police officer’s life was seriously endangered. In order to save his and other officers’ lives, they fired at the attacker,” a statement from the police department claimed. Footage of the shooting showed the young man swinging a baton at riot police.\n\nBritish Foreign Secretary Dominic Raab said the shooting was a “disproportionate” use of force that “risks inflaming the situation.” He called for a “constructive dialogue to address the legitimate concerns” of Hong Kong citizens.", "description": "A teenage protester becomes the first person shot by police with live ammo during the Hong Kong protests on China's National Day.", "authors": ["John Hayward"], "top_image": "https://media.breitbart.com/media/2019/10/protester-shot-in-hong-kong-640x335.jpg", "published_at": "2019-10-01"}