{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Style/hispanic-heritage-month-celebrate-latinx-owned-beauty-fashion/story?id=65724779", "downloaded_at": "2019-09-20 12:58:07.253745+00:00", "title": "Hispanic Heritage Month: Celebrate with Latinx-owned beauty and fashion brands", "language": "en", "text": "It's Hispanic Heritage Month, and an amazing way to celebrate is by supporting Latinx-owned brands.\n\nFrom amazing body products to stylish fashion lines, there are a variety of brands that embrace Hispanic culture in a beautiful way.\n\nOne specific platform, Stitch Lab, is constantly connecting and showcasing emerging Latinx designers worldwide.\n\nDuring September and October, this talent incubator has partnered with Macy's to bring these designer lines to select stores.\n\nThese brands will be part of The Market @ Macy’s, a full-service marketplace that offers shoppers the chance to discover new products, services and activations each month in a boutique setting.\n\nA few stand-out labels that will be featured include Petra and Quote Me.\n\nBelow, we have highlighted a few other amazing brands to get familiar with. Make sure to check back as we continue to update.\n\nPetra\n\nThis Colombian brand features a wide variety of beautifully designed white blouses, dresses and more.\n\nBonika Beauty\n\nFounded by Afro-Latina lifestyle influencer Ada Rojas, this beauty and hair care line offers everything from hairstyling gel to a curl-enhancing mousse.\n\nPeralta Project\n\nThis Manhattan-based store with uniquely designed apparel allows customers to choose specifically what style layout they want, then delivers it on the spot.\n\nAlamar Cosmetics\n\nThis collection owned and operated by Gabriella (aka Gaby) Trujillo has gorgeous, high-pigmented eye shadow palettes, color blush palettes, and her recently launched nude lip gloss and liner.\n\nQuote Me\n\nThis Colombian brand has awesome basics that often feature empowering messages. Plus, items are made with sustainable materials and are environmentally friendly.", "description": "Celebrate Hispanic Heritage Month with amazing Latinx-owned beauty and fashion brands people love.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/StichLab-1-ht-er-190919_hpMain_16x9_992.jpg", "published_at": "2019-09-20"}