{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7614813/Texas-woman-surprises-baseball-loving-grandfather-World-Series-tickets.html", "downloaded_at": "2019-10-26 00:00:19.445206+00:00", "title": "Texas woman surprises her baseball-loving grandfather with World Series tickets", "language": "en", "text": "A Texas grandfather became the envy of baseball fans everywhere after his granddaughter took him to a World Series game after she won tickets.\n\nThe adorable story began when Courtney King, aged 31, entered a giveaway by Summer's Abbey Flooring Center to win the coveted World Series tickets for Wednesday's game.\n\nTo enter, hopefuls had to like the page, tag a few friends and explain why they deserved the tickets.\n\nNaturally, Courtney wanted to win the tickets for her baseball-loving grandfather Jack King.\n\nCourtney said: 'So I wrote in my story, that next month is my grandpa’s birthday. He’ll be 88 and how special it’d be to share this moment with him.'\n\nIn her post she wrote: 'I don’t know another man who loves the Astros more than him in my life. I think it would be the most memorable experience of his lifetime and it would absolutely bless my heart to share it with him.'\n\nJack King (left) and Courtney King (right) were able to attend the second game of the World Series in Houston after she won tickets on Facebook\n\n'At his age, we make every moment count and this would be the most special experience I’d ever get to have only with him. And...I’d absolutely love to see his reaction presenting him with a Crawford box seat!'\n\nKing is a hospice worker and knows how important spending time with family is.\n\n'I work for hospice and so part of my everyday job is to meet people in very vulnerable moments. And I’m constantly reminded of how fragile life is,' she told KHOU News 11.\n\nLuckily, Courtney would get the chance to record his reaction because Summer's Abbey Flooring Center announced she was the winner on Wednesday morning.\n\nIn video posted to Facebook, Courtney captured the sweet moment Jack, or 'Paw Paw', learned he'd be attending his first World Series game.\n\nJack, a retired welder, doesn't leave his home very often at the age of 87 and watches his baseball games on TV with Courtney's grandmother, 'Maw Maw.'\n\nCourtney's sets up the surprise by handing Jack a plastic bag that is revealed to have an official World Series ball cap inside.\n\n'What do you think that means?' Courtney asks as Jack examines the cap.\n\nShe said: 'I won tickets to the World Series, to tonight's game, and I want you to come with me.'\n\nOf course, Jack said yes.\n\n'Yeah. 'I'll have to check with Maw Maw and see if I can go,' he jokes.\n\nCourtney recorded surprising Jack (pictured) about the World Series game by gifting him with an official World Series baseball cap\n\nJack (pictured) is excited to go and jokes: 'I'll have to check with Maw Maw and see if I can go'\n\nCourtney wrote a caption with the video post, saying she's grateful to spend time with her grandfather and create memories.\n\n'My Paw-Paw and I share a birthday month. On November 11th he’ll be blowing out 88 birthday candles. It’s truly a dream come true to share this gift with him early- surprise tickets to the World Series,' Courtney said.\n\n'In all of my life I’ve never known more consistent, sacrificial, and abundant love than what I’ve received from this man.'\n\n'I will be forever grateful to share this experience with him and make memories that we’ll never forget.'\n\nThe trip turned out to be one of adventures.\n\nIn addition to Paw Paw attending his first World Series game, it would also be his first time back in Houston in 45 years.\n\nCourtney shared some highlights of attending the game with her grandfather on Facebook (pictured), like Jack traveling to Houston for the first time in 45 years\n\n'The drive in was really unique,' Courtney said.\n\nThe two eventually rolled into Minute Maid Park and took their seats in the infamous Crawford Boxes.\n\nThe area is known as a hot spot for 'out of the park' balls to land.\n\nWhile sitting in the stands, Jack and Courtney had to dodge a fly ball in a true major league baseball experience.\n\n'Well, I hope they win,' Jack told KHOU during the game.\n\nAlthough the Astros lost 12 to three, Courtney left the stadium feeling like a winner.\n\nShe said: 'It's about quality of time that you have left. It's about living out best life and last night I know Paw Paw was living his best life at the game.'", "description": "Jack King, 87, was able to attend his first World Series baseball game in Houston, Texas, after his granddaughter, Courtney King, won the coveted tickets in a giveaway on Facebook", "authors": ["Lauren Edmonds For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/21/20196728-0-image-a-84_1572034398109.jpg", "published_at": "2019-10-25"}