{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7565153/Alli-Simpson-confirms-brother-Codys-brand-new-relationship-Miley-Cyrus.html", "downloaded_at": "2019-10-12 07:02:03.433328+00:00", "title": "Alli Simpson confirms brother Cody is in a relationship with Miley Cyrus", "language": "en", "text": "Alli Simpson has officially confirmed her older brother Cody Simpson is in a brand-new relationship with Miley Cyrus.\n\nSpeaking to Daily Mail Australia at the Moet & Chandon Spring Champion Stakes Day on Saturday, she said: 'They're very happy and very in love.'\n\n'It's very new, but they have history and they're posting about each other a lot,' commented the 21-year-old singer-songwriter.\n\n'They're very happy and very in love': Alli Simpson (pictured) has confirmed her older brother Cody's brand new relationship with Miley Cyrus\n\nThe blonde beauty even revealed she and her boyfriend, actor Mitchell Bourke, have had FaceTime chats with the lovebirds who both live in Los Angeles.\n\nWhile Alli said she has met Miley a couple of times in the past, she admitted she did not know how the Slide Away singer's romance with her brother came about.\n\n'I honestly don't know the full story... I heard about it only recently and it seems like they're very happy and very in love,' she said.\n\nLooking loved up: Speaking of her brother's blossoming new romance, the 21-year-old singer said, 'it's very new, but they've had history...'\n\n'Miley is posting a lot [on social media] and so is Cody so it seems serious.'\n\nWhen asked if the Simpson family were happy with Cody's new flame, Alli said: 'We're happy if Cody is happy, that's all that matters to us.'\n\nMiley and Cody were first snapped together when they shared a kiss on a lunch date at health food restaurant Backyard Bowls in Los Angeles earlier this month.\n\nMoving on: Miley's new relationship with Cody comes after her ex husband Liam Hemsworth was seen out on a date with Australian actress Maddison Brown\n\nMeanwhile, Miley's ex husband Liam Hemsworth appears to have moved on too - with Australian actress and Dynasty star Maddison Brown.\n\nOn Thursday, the two looked smitten while out and about in New York City.\n\nLiam filed for divorce from Miley back in August after marrying the singer in December at her lavish mansion in Franklin, Tennessee.", "description": "Alli Simpson has officially confirmed her older brother Cody Simpson's brand-new relationship with Miley Cyrus.", "authors": ["Alisha Buaya", "Jade Watkins For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/05/19617202-0-image-a-35_1570855071325.jpg", "published_at": "2019-10-12"}