{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7573089/The-rules-food-critics-follow-ordering.html", "downloaded_at": "2019-10-15 00:48:12.310275+00:00", "title": "The rules all food critics follow when ordering", "language": "en", "text": "A group of Australia's top rated restaurant reviewers have revealed the 'rules' they follow when ordering at a fine dining establishment - and the worst food they've ever been served.\n\nWhether it's ordering glasses instead of bottles of wine or making time to check out the toilets, the critics at food publication Delicious stick to specific rules in order to review a restaurant fairly.\n\nThe first? Never ordering steak off the menu unless it is a steak restaurant as there is too much room for error when it's not a speciality.\n\nSome of Australia's top rated restaurant reviewers have shared the 'rules' they follow when ordering at a fine dining establishment - and the worst food they've ever been served\n\nWhat rules do food critics follow? 1. Only order steak at a steak restaurant 2. Choose the most interesting and technical dish on the menu 3. Order the signature dish 4. Order a glass of wine to see if it is poured at the table or not 5. Assess the toilets - they can tell you a lot about kitchen hygiene\n\nThey also ensure that they choose the 'most interesting, innovative and technically challenging dish' on the menu because this will be the best way for a chef to show off their skills.\n\nAnd if the eatery prides itself on a specific signature dish then this should be ordered as part of the meal. It will 'need to be good' in order to receive a positive review.\n\nAdditionally, critics will always order a glass of wine to see if it is poured at the table or in the kitchen. If it's the latter there is no way for the customer to know that is what they ordered.\n\nThere are so many ways for the meat product to be made subpar, including being under- or overcooked, so it's best to leave this dish to the professionals\n\nWhat are the critics' best tips for top food? * Cheese is the best dessert to order. * Never order fish on a Monday because it has likely been in the restaurant for four to five days. * Don't eat the the 'view table' at night. After a certain time it's just a black sheet of glass in front of you. * Don't bother dining out on Hallmark holidays like Mother's Day and Valentine's Day. * The second cheapest bottle on the wine menu can sometimes be unreasonably marked up - take note. Source: GoodFood\n\nThey will also use the bathroom during their visit because the state of the toilet is a good indication of what the kitchen looks like.\n\nThe critics also revealed some of their best and worst dining experiences of the year to date.\n\nDelicious.100 reviewer Dan Stock is perpetually afraid of food poisoning - one of the most common problems with eating out all the time - but said full-blown disasters are uncommon in his work.\n\nThis year alone he has enjoyed sardines cooked over hot coals and served with chips in Lisbon - a highlight - but also had to endure Greek dish taramasalata that had split and looked like 'a plate of dog sick'.\n\nPerhaps most surprisingly they will also use the bathroom during their visit to a restaurant because the state of the toilet is a good indication of what the kitchen looks like\n\nFor fellow Delicious.100 critic Anthony Huckstep it was Alberto's, Ester and Momofuku, all in New South Wales, that made his top tier choices this year.\n\nBut he also visited a high-end restaurant and reported chipped glassware, dirty cutlery, forgotten dishes and poorly cooked food at the overwhelming price of $350 for two.\n\nMeanwhile reviewer Samantha Jones agreed that Alberto's was a must see and in Victoria she liked the Carlton Wine Room for its 'uncomplicated' dining experience.", "description": "Some of Australia's top rated restaurant reviewers have shared the 'rules' they follow when ordering at a fine dining establishment - and the worst food they've ever been served.", "authors": ["Matilda Rudd For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/01/19717146-0-image-a-2_1571098395387.jpg", "published_at": "2019-10-15"}