{"pub": "guardian", "url": "https://theguardian.com/environment/2019/sep/27/greta-thunberg-justin-trudeau-meeting-climate-strikes", "downloaded_at": "2019-09-28 01:03:58.441140+00:00", "title": "Greta Thunberg meets Justin Trudeau amid climate strikes: 'He is not doing enough'", "language": "en", "text": "Teen has private meeting with Canadian prime minister, who later says he ‘agrees with her completely’\n\nGreta Thunberg meets Justin Trudeau amid climate strikes: 'He is not doing enough'\n\nThe teen activist Greta Thunberg has urged Justin Trudeau and other world leaders to do more for the environment as she led half a million protesters in Montreal as part of a global wave of “climate strikes.”\n\nThe 16-year-old Swede met privately with the Canadian prime minister but later told a news conference with local indigenous leaders that he was “not doing enough” to curb greenhouse gases responsible for global warming.\n\n“My message to all the politicians around the world is the same. Just listen and act on the current best available science,” she said.\n\nThunberg generated headlines around the world earlier this week with her viral so-called “How Dare You?” speech at the UN climate summit, accusing world leaders of betraying her generation.\n\nThe teen has inspired millions of youths, drawn to her cause by her passion and a mature, committed rhetorical style that belies her young age.\n\nGreta Thunberg turns tables on Trump and quotes his mockery in new Twitter bio Read more\n\nShe has also drawn mockery from some, including Donald Trump, who tweeted sarcastically that “she seems like a very happy young girl looking forward to a bright and wonderful future”.\n\nWithout naming the US president, Thunberg said she didn’t “understand why grown-ups would choose to mock children and teenagers for just communicating and acting on the science when they could do something good instead”.\n\n“We’ve become too loud for people to handle so people want to silence us … We should also take that as a compliment.”\n\nTrudeau and other Canadian party leaders took a breather from a tight election campaign to join Thunberg at the Montreal rally – along with around 500,000 protesters, according to organizers.\n\nWalking with his wife and children, Trudeau mingled with a boisterous crowd that brandished placards reading “Respect Mother Earth” and “Make America Greta Again” – a riff on a campaign slogan popularized by Trump, a noted climate change skeptic.\n\nOne man was tackled by security when he appeared to lunge at the prime minister, while 13-year-old Annabelle Vellend broke out in tears when she spotted Thunberg, telling AFP: “I really believe in Greta’s movement.”\n\n“She is doing amazing things and it’s great that she’s able to press politicians to act on climate change, during an election,” she said.\n\nPlay Video 2:06 Greta Thunberg: the speeches that helped spark a climate movement – video\n\nIn his first term, Trudeau cast himself as a champion in the fight against global warming, but his green image was tarnished by his nationalization of an oil pipeline to salvage the construction project after years of delay.\n\nThe prime minister said after meeting Thunberg and pledging to fund the planting of 2bn trees: “I agree with her entirely. We need to do more.”\n\nTrudeau's environmental record on the line in Canada election year Read more\n\nEarlier this week, the Liberal leader vowed that Canada would reach net-zero carbon dioxide emissions by 2050, joining 66 other countries that have already signed on to the pledge.\n\nLast Friday, more than 4 million youths – and adults – rallied in “climate strikes” around the world.\n\nTurnout at events a week on was smaller, but still vocal. In Italy, hundreds of thousands of young people took to the streets while an estimated 40,000 protested outside New Zealand’s parliament.\n\nIn Canada, events also attracted huge crowds in the capital, Ottawa; in Toronto; and in several other cities.\n\nIn the heart of the giant Montreal march, made up mostly of children and a few adults, Alexanne Lessard stood out in her tree costume.\n\n“I’m here for our future, to show our government that we the majority want to do something and that they can take big steps that will an impact,” she said.\n\nDaphnee Choquette said she came out for her baby girl, whom she carried with her.\n\n“It’s too late for us [older people], but not for them. We need to bring about change now,” she said.", "description": "Teen has private meeting with Canadian prime minister, who later says he ‘agrees with her completely’", "authors": ["Guardian Staff", "Agencies In Montreal"], "top_image": "https://i.guim.co.uk/img/media/fc233eef393186bfceb1dd0fa3e654b767d02058/0_0_3500_2099/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ed30f2ef6f82449931e5f1d90ae81a18", "published_at": "2019-09-27"}