{"pub": "breitbart", "url": "https://breitbart.com/sports/2019/10/04/watch-fans-erupt-after-terrible-roughing-the-passer-call-on-clay-matthews", "downloaded_at": "2019-10-05 05:49:53.117675+00:00", "title": "WATCH: Fans Erupt After Terrible Roughing the Passer Call on Clay Matthews", "language": "en", "text": "The NFL may have issued its most ridiculous roughing the passer penalty yet, and that’s saying something.\n\nDuring the Thursday Night Football game between the Rams and the Seahawks, Rams linebacker Clay Matthews was called for an illegal hit on Seattle quarterback Russell Wilson. If you watch closely, you will see that there was nothing illegal about the hit whatsoever.\n\nWatch:\n\nNot only is the hit shoulder-to-shoulder, not helmet-to-helmet, which is what the NFL allegedly wants its players to do, the ball is also in Wilson’s hand all the way up until the very last moment before Matthews hits him.\n\nIf we were to take the NFL at their word (we should not) this hit would be a textbook example of what they want their players to do. Instead, they flag Matthews for the hit because in reality the NFL just doesn’t want anyone to touch their quarterbacks, ever.\n\nTwitter was quick to respond to the atrocious call:\n\nClay Matthews was ejected for looking at Russell Wilson too intensely pic.twitter.com/PWeWFA2d5D — Mike Hock (@SirSports23) October 4, 2019\n\nOfficial NFL rulebook on roughing the passer: “If Clay Matthews did it then it’s a penalty.” — Tyler Brooke (@TylerDBrooke) October 4, 2019\n\nClay Matthews: *exists* Ref: Personal foul, Number 52 defense. — Faux John Madden (@FauxJohnMadden) October 4, 2019\n\nClay Matthews called for roughing the passer here for touching the QB while failing to pull the quarterback’s flag #LARvsSEA pic.twitter.com/a4vDP6jFMx — NOTSportsCenter (@NOTSportsCenter) October 4, 2019\n\nHas Tom Brady tweeted about that roughing the passer call on Clay Matthews? — Peter Della Penna (@PeterDellaPenna) October 4, 2019\n\nWhile some will say the flag was thrown for hitting the quarterback “high,” it’s important to note that the point of contact where Matthews hits Wilson is actually below his shoulder, that cannot be considered high. The point of outlawing high hits is to protect the head, Matthews was nowhere near Wilson’s head.\n\nIf what Clay Matthews did is a high hit, then a new and correct definition of “high” is needed.\n\nOn top of everything else, the call gave the Seahawks a first down at a critical point in the game and may have very well proved to be the difference in the ballgame.\n\nThe Seahawks won, 30-29.\n\nFollow Dylan Gwinn on Twitter @themightygwinn", "description": "The NFL may have issued its most ridiculous roughing the passer penalty yet, and that's saying something.", "authors": ["Dylan Gwinn"], "top_image": "https://media.breitbart.com/media/2019/10/Getty-Images-5-640x335.jpg", "published_at": "2019-10-04"}