{"pub": "mirror", "url": "https://mirror.co.uk/news/weird-news/woman-praised-reaction-after-passenger-20565503", "downloaded_at": "2019-10-12 16:06:46.518835+00:00", "title": "Woman praised for reaction after passenger vomits in her hair on nightmare flight", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nYou would think an 8am flight full of sleep-deprived passengers would be fairly uneventful.\n\nHowever, people flying with Spirit Airlines earlier this week found it was anything but - and one passenger in particular was on the receiving end of the worst of it.\n\nThe poor woman's journey from hell began with an unexpected wake up call when a man on board threw up in her hair.\n\nThat alone probably trumps anything we've experienced but it only got worse as another passenger, Cassidy Smith, live tweeted the whole thing from the Chicago to Baltimore service.\n\n(Image: @Cassidy44 / Twitter)\n\nHer first video from the plane shows a flight attendant attempting to help the visibly upset passenger to clean the vomit off her head, before turning to show Cassidy's highly-relatable reaction.\n\nIt's followed by a closer picture which clearly shows chunks of red sick matted into her hair with the caption 'I. Would. Die.'\n\nIt then appears the sick-producing passenger is taken off the aircraft but before everyone else on board can celebrate too much, they're asked to get off themselves so the necessary cleaning can take place.\n\nBack in the airport terminal, the victim of sick-gate is shown fresh and clean having washed her hair in the bathroom sink, with Cassidy saying she's handled it all like an 'absolute champ'.\n\n(Image: @Cassidy44 / Twitter)\n\nEveryone then gets back on and they can finally head off to complete the journey which should take just over two hours.\n\nBut nope. As they begin taxing for take-off, two other passengers lock themselves in one of the toilets and flood the back of the plane.\n\nCassidy finishes her running commentary by saying the crew and pilot handled the whole fiasco brilliantly and deserve a big raise.\n\nShe also suggests the passenger who put up with the worst of it 'deserves free flights or fresh hair or something'.\n\nPeople replying to the thread on Twitter were full of praise for how graciously she had handled the situation.\n\n\"Yeah, somebody would have gotten slapped if that happened to me,\" said one.\n\nAnother wrote: \"Hopefully something develops from her great attitude in handling it. She should be and I think will be rewarded in line with her positive disposition.\"", "description": "A fellow traveller suggested the woman should be given free flights for the way she handled the situation", "authors": ["Luke Matthews", "Image", "Twitter"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20566135.ece/ALTERNATES/s1200/0_THP_CHP_121019Slug_10717JPG.jpg", "published_at": "2019-10-12"}