{"pub": "afr", "url": "https://afr.com/wealth/superannuation/smsf-cost-debate-are-they-really-that-expensive-20191023-p533el", "downloaded_at": "2019-10-25 23:53:40.469103+00:00", "title": "SMSF cost debate: are they really that expensive?", "language": "en", "text": "It was an amendment to super laws in 1999 that brought SMSFs into existence. And boy, did the idea take off.\n\nAustralian Taxation Office figures reveal that as of June 30 this year, there were 599,678 SMSFs holding nearly $748 billion in assets, making total assets held in SMSFs larger than those in either industry ($719 billion) or retail ($626 billion) funds.\n\nNo doubt, the approach to managing SMSFs varies widely from trustee to trustee – from full-service accounting and investment management to truly DIY with no professional assistance whatsoever.\n\nMichael and Marika Coghill with George, 1, and Indiana, 3.\n\nA key motivator for many trustees is that they can hold property in an SMSF.\n\nASIC commissioner Danielle Press told a parliamentary committee this month that the $13,900 figure for average costs was from Tax Office claims data. “The 100 hours is an average,” she also said. “Some will spend more, others will spend less.”\n\nRainmaker Information director of research Alex Dunnin is a big believer in the concept that fees should not exceed 1 per cent of fund balance, whether it's an SMSF or any other type of fund.\n\nRainmaker research shows that the SMSF sector is, on average, the lowest-cost segment of the market with an expense ratio of 0.80 per cent compared with all products at 1.11 per cent.\n\nDunnin says he has looked closely at the ATO figures and cannot figure out how ASIC came up with the $13,900 figure for the average annual expenses associated with an SMSF. \"ASIC’s SMSF cost estimate seems over the top by a wide margin.\"\n\nHe says ATO data shows that total SMSF costs averaged $8986 in 2017, a number that includes average administration ($2725), investment ($5753) and audit fees ($508).\n\nAdvertisement\n\n\"Putting all this together means ASIC's SMSF cost estimate is wrong by 50 per cent,\" he says. \"It’s not nearly $14,000 per SMSF but more likely around $9000.\"\n\nOf course, averages can be misleading.\n\nThe average SMSF balance is about $1.1 million, for example, but the median is about half that at $661,000.\n\nThis means the typical SMSF is much smaller than the average figures suggest, the averages being distorted by the relatively few funds with mega balances running into the millions and even tens of millions of dollars.\n\nThe SMSF sector needs to do a much better job at demonstrating value for money. — Alex Dunnin, Rainmaker Information\n\nMost SMSFs are an amalgam of two people's retirement savings.\n\n\"SMSF trustees can get their fund administered by any of the administration majors for about $2000\", Dunnin says. \"Add another $1000 or $2000 for investment and audit fees and that's $4000 a year.\"\n\nFees are only one part of the equation. Returns are the other, and in this regard, Dunnin says ASIC has a very good point.\n\n\"There is much evidence that many SMSFs underperform MySuper benchmarks,\" he says. MySuper products are the no-frills default options offered by retail and industry funds.\n\nAdvertisement\n\n\"But in defence of SMSFs, about half are in pension phase and are invested more conservatively,\" he says. \"So rather than comparing them against balanced or growth benchmarks, we should probably compare them against capital stable benchmarks. The trouble is, even with this lower benchmark, many SMSFs would still fall short.\"\n\nThe bar chart shows returns over one, three and five years for SMSFs compared with the different investment options in ordinary funds (let's call them funds regulated by the Australian Prudential Regulation Authority).\n\nAn APRA-regulated fund labelled \"growth\" or \"balanced\" will typically have about 70 per cent of assets invested in growth assets such as shares. Funds called capital stable or capital guaranteed will be more heavily weighted to defensive assets such as bonds and cash.\n\nAs shown in the bar chart, SMSFs with less than $200,000 struggled to break even in the three years to June 2016. And even those with balances of $2 million-plus found it hard to beat other retirement investment options with high-growth asset allocations, although data from more than three years would be required to make more meaningful comparisons.\n\nThere are also significant incompatibilities between the data produced by APRA and that produced by the ATO, which is the agency responsible for regulating SMSFs. Even the Productivity Commission has acknowledged that there are big difficulties in comparing the sectors.\n\n\"At the very least, the real take-out is that the ATO needs to tighten up the data it gets from SMSFs,\" Dunnin says. \"There are a lot of tax subsidies held within the SMSF sector and under-performance reverberates back to general taxpayers by way of higher age pension costs being imposed on the Commonwealth budget.\"\n\nThat is, super contributions attract significant tax breaks and if any funds generate low returns, people are more likely to have to rely on the age pension.\n\n\"The SMSF sector needs to do a much better job at demonstrating value for money,\" Dunnin says.\n\nASIC and the ATO have expressed concerns about the vulnerability of some consumers to property spruikers and scammers.\n\nAdvertisement\n\nThe ATO says it has already seen examples where SMSF balances have been heavily eroded by losses associated with cryptocurrencies.\n\nJust last week, a 51-year-old man was jailed for three years for using an SMSF to arrange the illegal early release of $700,000 on behalf of 25 people.\n\nASIC has also prosecuted a string of advisers for manipulating SMSF clients for their own gain and has issued warnings about SMSFs having too much money concentrated in one asset class, namely residential property.\n\nWhen the Coghills established their SMSF in 2014, they used a professional accounting service.\n\n\"That was costing circa $3000 to $4000 a year in accounting, plus $700 or so in audit fees and the ASIC levy,\" Michael Coghill says.\n\nCloud-based accounting software\n\n\"This meant our overall management fees were averaging around 3 per cent to 4 per cent of our fund's value. This was unacceptable as it was clear we would find it difficult to earn a competitive return after paying out those kinds of overheads, especially when these costs are compounded over the longer term.\"\n\nThey now use cloud-based accounting software offered by Mclowd and say compliance and administration costs are down to 0.40 per cent of assets.\n\n\"I estimate I spend on average two to three hours per quarter to keep our accounts and administration up to date and I check my smartphone on a regular basis to follow the markets and manage our investments,\" Michael Coghill says.\n\n\"Every quarter my wife and I sit down together as a family and update the accounts and review the performance of our SMSF.\"\n\nThat's not to say he thinks an SMSF is for everybody. \"One important thing I have learnt is that the transition from a conventional fund to managing your SMSF yourself can be a lot of work,\" he says.", "description": "Specialists are questioning ASIC's estimate that average DIY super fees are $13,900. But that doesn't mean all SMSF trustees are getting value for money – or good returns.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.7062%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_96/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/15db394ca4d14f12310f4900920026fc1afefe80", "published_at": "2019-10-23"}