{"pub": "foxbusiness", "url": "https://foxbusiness.com/media/disney-cruise-line-defends-abandoning-97-workers-in-path-of-dorian", "downloaded_at": "2019-09-03 23:42:15.189855+00:00", "title": "Disney Cruise Line responds to claims it abandoned 97 workers in path of Dorian", "language": "en", "published_at": "2019-09-03", "text": "Disney Cruise Line issued a statement this week after getting slammed on social media for seemingly abandoning workers in the path of Hurricane Dorian.\n\nContinue Reading Below\n\n“Some of our Crew remained on the island and their care and safety is our highest priority,” reads the September 2nd statement by Disney Cruise Line confirming the decision to leave behind workers on appropriately named Castaway Cay in the Bahamas.\n\nDOCKED CRUISE SHIP, CASTAWAY CAY, BAHAMAS - SEPTEMBER 25, 2012: This is a satellite image of a docked cruise ship in Castaway Cay, Bahamas, a private island exclusive port. Collected on September 25, 2012. (Photo DigitalGlobe via Getty Images via Get Expand\n\nMeg Green confirmed to SunOnline that her sister was among several who weren't evacuated. Disney told the media outlet that staff members were “being taken care of” in a storm shelter, which was stocked with food and water.\n\nOn Sunday, the worried Green tweeted: \"Remember that time Disney Cruise left 97 employees on a tiny island in a Category 5 hurricane? I do. They took shelter around 3pm.\"\n\nAdvertisement\n\n“As forecasted, sustained winds on the island did not extend beyond tropical force strength and our Crew has returned to their living quarters after spending a few hours in our storm shelter yesterday. Our thoughts continue to be with the people in areas of The Bahamas that are being impacted by this storm and we stand ready to contribute to recovery efforts,” Disney said in its statement.\n\nIn the same statement, Disney said \"we have had to change our plans given the inherently unpredictable nature of tropical storms and hurricanes. After careful review of the currently forecasted path, and conversations with port officials in Florida, we have decided to cancel the sailing completely.\"\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nHurricane Dorian is expected to last for the next few days as Florida, Georgia, the Carolinas, Virgina and the Bahamas remain on different levels of evacuation or states of emergency.\n\nDisney did not respond to Fox Business' request for further comment at the time of publication.", "description": "Disney defends itself after being accused of ditching 97 employees in the Bahamas near Hurricane Dorian.", "authors": ["Mike Cherico"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/Disney-Cruise-Castaway-Cay-2.jpg?ve=1&tl=1"}