{"pub": "yahoo", "url": "https://news.yahoo.com/nobody-died-sandy-hook-conspiracy-191240942.html", "downloaded_at": "2019-10-17 06:07:19.419638+00:00", "title": "\"Nobody Died at Sandy Hook\" Conspiracy Theorist Will Pay $450K", "language": "en", "text": "For some reason, two guys named James Fetzer and Mike Palacek decided it was a good idea to publish a book through a small press called Nobody Died at Sandy Hook. The book basically floated the crazy notion that for a variety of nutso reasons, the tragic shootings in 2012 at Sandy Hook Elementary School, were a hoax. This summer, a judge ruled that even publishing such utter nonsense was considering an act of defamation, and now, one of those co-authors, James Fetzer has been fined $450,000 dollars.\n\nFetzer has been instructed to pay this amount to Leonard Pozner, father of Noah, a boy who was 6-years-old when he was killed in the Sandy Hook massacre.\n\nDespite the fact that most rational people don’t believe in conspiracy theories like this, Ponzer said that the reasons for the lawsuit were connected to protecting the truth of the tragedy. “It causes people to believe that I lied about my son’s death, that my son didn’t die and that I’m somehow doing that for some other reasons.”\n\nAny parent can obviously emphasize with the utter horror of not only losing a child but then, being told that you’re lying about it. Preserving the memory of his son makes sense, and, most people would probably agree that at $450,000 Fetzer is getting off easy.\n\nStill, for reasons that literally cannot be explained, Fetzer claims the lawsuit is “absurd” and will appeal. While there’s certainly a case to be made for free speech, it seems like people who accuse grieving parents of being liars in order to sell some crappy books are the absurd ones.\n\nRelated Articles:\n\nThe post “Nobody Died at Sandy Hook” Conspiracy Theorist Will Pay $450K appeared first on Fatherly.", "description": "It doesn't seem like enough.", "authors": ["Ryan Britt"], "top_image": "https://s.yimg.com/uu/api/res/1.2/eY6lo9bo0a1bLOn2Mm3Jmg--~B/aD02MzA7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/fatherly_721/74d19d69ef5f05d1e809ecc437de2347", "published_at": "2019-10-16"}