{"pub": "businessinsider", "url": "https://businessinsider.com/elizabeth-warren-is-slowly-but-surely-eating-kamala-harris-base-2019-10", "downloaded_at": "2019-10-09 18:46:42.343116+00:00", "title": "Elizabeth Warren has been slowly but surely eating away at Kamala Harris' base", "language": "en", "text": "Back in February, Sen. Kamala Harris was in a strong position to be one of the Democratic frontrunners after a successful campaign rollout while Sen. Elizabeth Warren's campaign was off to a rocky start.\n\nBut Harris has seen her poll numbers take a sharp nosedive over the past few months — in no small part due to Warren experiencing a meteoric rise in the polls and taking many of Harris' would-be supporters along for the ride.\n\nIn Morning Consult's weekly survey of Democratic primary voters, Harris and Warren were virtually tied at 14% and 13%, respectively. Warren's support has soared to 21% in the October 6 survey, but Harris' has been cut in half to just 6%.\n\nThe percentage of Harris supporters who would be satisfied with Warren as the nominee has increased a whopping 29 percentage points from 49% in mid-February to 78% in Insider's most recent survey.\n\nWarren is now the most-liked candidate among Harris' supporters by a long shot, with 56% of Harris supporters also liking Biden, 54% liking Mayor Pete Buttigieg, and 53% being satisfied with Sen. Bernie Sanders.\n\nVisit Business Insider's homepage for more stories.\n\nIn February and March of this year, Sen. Kamala Harris was riding high. The first-term California Senator had just launched an extremely successful presidential campaign rollout, which included a huge rally of around 20,000 people in her hometown of Oakland and fawning press coverage.\n\nMeanwhile, Sen. Elizabeth Warren's campaign was off to a rocky start. The progressive Senator faced heavy criticism over her decision to take a DNA test after President Donald Trump spent months accusing her of lying about her Native American heritage.\n\nWarren also faced serious doubts about her ability to compete financially when she decided early on to forgo all private, closed-door fundraisers, prompting her first finance director to quit.\n\nSince then, the candidates have completely switched positions in the race.\n\nWarren is now on track to overtake former Vice President Joe Biden, who she outraised by nearly $10 million in the last fundraising quarter, as the 2020 Democratic primary frontrunner.\n\nBut Harris has seen her poll numbers take a sharp nosedive over the past few months — in no small part due to Warren experiencing a meteoric rise in the polls and taking many of Harris' would-be supporters along for the ride.\n\nTo help make sense of where all the 2020 Democratic candidates stand, Insider has been conducting a recurring SurveyMonkey Audience national poll since December 2018. You can download every poll here, down to the individual respondent data.\n\nRead more about how the Insider 2020 Democratic primary tracker works.\n\nAt this point in the race where we're likely to see more candidates running out of money and dropping out, we're interested in using our polling to figure out who a given candidate's supporters would flock to if their first choice quit the race.\n\nOver the past few months, Insider polling and multiple other surveys have shown a drastic convergence in Warren and Harris' topline support and satisfaction.\n\nShortly after Harris entered the Democratic primary field in late January, our February 15 poll showed Harris with a net satisfaction of 49 percentage points, with 60% satisfied with her as the nominee and 11% unsatisfied.\n\nNow, Harris' net satisfaction is down to +16 points, with 40% satisfied and 24% unsatisfied. Meanwhile, Warren's net satisfaction has increased from +8 percentage points in February to +48 percentage points in late September.\n\nIn Morning Consult's weekly survey of Democratic primary voters, Harris and Warren were virtually tied at 14% and 13%, respectively three months ago in mid-July. While Warren's support has soared to 21% in the October 6 survey, Harris' has been cut in half to just 6%.\n\nRead more: 3 big reasons Biden is no longer the definitive 2020 Democratic primary frontrunner\n\nMorning Consult\n\nIn Real Clear Politics' average of Democratic 2020 polls, too, Harris was leading Warren by one percentage point on average, 15% to 14% in mid-July.\n\nNow, Warren beats Harris by a whopping 21 percentage points, holding 26% support on average compared to just 4.8% for Harris — and there's a good amount of evidence that Warren is directly poaching away Harris' support.\n\nIn Insider polling, Warren's name recognition and awareness has remained stable since February.\n\nBut the percentage of Harris supporters who would be satisfied with Warren as the nominee has increased a whopping 29 percentage points from 49% in mid-February to 78% in Insider's most recent survey.\n\nWarren is now the most-liked candidate among Harris' supporters by a long shot, with 56% of Harris supporters also liking Biden, 54% liking Mayor Pete Buttigieg, and 53% being satisfied with Sen. Bernie Sanders.\n\nSenator Kamala Harris speaks during the 2020 Democratic U.S. presidential debate in Houston Reuters\n\nUnlike Warren, Harris has failed to articulate a clear rationale for running\n\nAfter entering the race from a position of weakness, Warren turned things around by articulating a crystal-clear message centered around reducing the economic and political power of the rich and powerful, and putting it in the hands of middle and working-class Americans.\n\nWarren proved her initial detractors wrong by fully embracing the role of the policy wonk. She's released a unique and detailed policy plan to address almost every imaginable issue from the cost of college to the opioid crisis, rolling out so many policies that \"I've got a plan for that\" has become her unofficial slogan.\n\nIn a field with 17 major candidates, Warren's incessant release of policy plans to execute for her vision of America into reality has made her stand out from the rest of the pack.\n\nMeanwhile, Harris has tried to position herself as a compromise candidate who can appeal to voters who want a middle ground between Biden's moderate pragmatism and Warren's economic populism. But instead of winning over those middle-ground voters, Harris' strategy of trying to make everyone happy has backfired.\n\nThroughout 2019, Harris consistently flip-flopped on her position on healthcare. After indicating that she wanted to ban private health insurance in January, she backtracked in May and said she did not support eliminating private insurance.\n\nRead more: Elizabeth Warren and Bernie Sanders both out-raised Joe Biden by around $10 million in 2019's third fundraising quarter — here's where all the candidates stand\n\nBut in the first Democratic debate in June, Harris raised her hand when the moderators asked who would support getting rid of private insurance — later saying she misunderstood the question.\n\nBy the time Harris finally released her healthcare plan, which would implement a government-run Medicare for All healthcare system over a 10-year timeline with a role for private insurers to compete in it, she had thoroughly muddied the waters about where she stands.\n\nAnd unlike Warren, who experienced a more steady rise over a period of several months, Harris hasn't been able to carve out an obvious rationale for her candidacy and has had trouble creating and sustaining such a similar rise, as FiveThirtyEight's Perry Bacon Jr. recently argued.\n\nHarris experienced a surge in the polls after her strong performance in the first June debate, where she took Biden to task over his record on racial issues and school busing, but didn't capitalize it on that surge with, for example, a school desegregation plan of her own.\n\nHarris still has a few months to make up lost ground before the first primary contests in Iowa and New Hampshire. But as of now, Warren is eating her lunch and poaching away her base.\n\nRead more:\n\nMore immigrants are moving into Trump states instead of expensive cities in blue states. Here's how the shift could reshape the 2020 election and beyond.\n\nHere are the 2020 Democratic presidential candidates who have qualified for the November debate\n\nEvery Democrat running for president falls into 1 of these 5 groups based on who supports them", "description": "Warren is experiencing a meteoric rise in 2020 primary polls, and taking many of Harris' would-be supporters along for the ride.", "authors": ["Grace Panetta"], "top_image": "https://image.businessinsider.com/5d9ca9bb591bb74c812a45de?width=1200&format=jpeg", "published_at": "2019-10-09"}