{"pub": "breitbart", "url": "https://breitbart.com/news/exxon-mobil-faces-suit-that-says-it-misled-investors-on-climate-change", "downloaded_at": "2019-10-22 14:03:38.024175+00:00", "title": "Exxon Mobil faces suit that says it misled investors on climate change", "language": "en", "text": "Oct. 22 (UPI) — Exxon Mobil faces trial in New York City civil court Tuesday, and charges that say the energy conglomerate deceived investors about the impact of climate change on business.\n\nThe New York attorney general’s office filed the suit last year after a lengthy investigation. It accuses the oil and gas giant of intentionally misleading investors by giving internal documents that propped up Exxon investments in Canadian tar sands explorations while downplaying profitability of clean energies.\n\nThe 97-page lawsuit said then-Exxon CEO and future Secretary of State Rex Tillerson enabled the deceptive information.\n\n“Exxon in effect erected a Potemkin village to create the illusion that it had fully considered the risks of future climate change regulation and had factored those risks into its business operations,” then-New York Attorney General Barbara Underwood said in the lawsuit.\n\n“As a result of Exxon’s fraud, the company was exposed to far greater risk from climate change regulations than investors were led to believe.”\n\nExxon Mobil has dismissed the suit, insisting that it made proper projections and never misled investors.\n\n“Since it launched this groundless investigation nearly three years ago, [the attorney general’s office] has publicly pursued an ever-shifting array of failed investigative theories in search of one that will stick,” Exxon Mobil attorneys said in a response to the suit.\n\nThe company said in one filing it has provided 4 million pages of documents that prove there was never wrongdoing. In August, New York State Supreme Court Justice Barry Ostrager recommended Exxon Mobil “rethink” the large amounts of paperwork it has presented.\n\nDV.load(“https://www.documentcloud.org/documents/6508679-ExxonMobil-vs-New-York.js”, {\n\nresponsive: true,\n\ncontainer: “#DV-viewer-6508679-ExxonMobil-vs-New-York”\n\n});\n\nExxonMobil vs New York (PDF)\n\nExxonMobil vs New York (Text)\n\nDV.load(“https://www.documentcloud.org/documents/6508679-ExxonMobil-vs-New-York.js”, {\n\nresponsive: true,\n\ncontainer: “#DV-viewer-6508679-ExxonMobil-vs-New-York”\n\n});\n\nExxonMobil vs New York (PDF)\n\nExxonMobil vs New York (Text)", "description": "Oct. 22 (UPI) — Exxon Mobil faces trial in New York City civil court Tuesday, and charges that say the energy conglomerate deceived investors about", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-22"}