{"pub": "fox", "url": "https://foxnews.com/entertainment/john-witherspoon-dies-77-actor-comedian-ice-cube", "downloaded_at": "2019-10-30 10:09:11.910862+00:00", "title": "John Witherspoon, comedian and actor in 'Friday' films, dies at 77", "language": "en", "text": "Actor and comedian John Witherspoon, who is best known for his role as Ice Cube’s father in the “Friday” films, has died at age 77, his family said in a statement Tuesday.\n\nHis manager Alex Goodman told The Associated Press that Witherspoon died in his Los Angeles home late Tuesday. No cause of death was released. The family said in a statement to Deadline that Witherspoon, who was born Jan. 27, 1942, is survived by his wife, Angela, and sons JD and Alexander and a large extended family.\n\nICE CUBE EXPLAINS WHY LAMAR ODOM, OTHER EX-NBA PLAYERS WERE REMOVED FROM BIG3\n\n“We are all in shock, please give us a minute for a moment in privacy and we will celebrate his life and his work together. John used to say ‘I’m no big deal’, but he was huge deal to us,” the statement said. The family also announced Witherspoon's death in a tweet from his official Twitter account early Wednesday.\n\n“He was a Legend in the entertainment industry, and a father figure to all who watched him over the years. We love you “POPS” always & forever,” they said.\n\nWitherspoon began his career appearing in 1970s TV shows, such as \"Barnaby Jones\" and \"The Richard Pryor Show,\" NPR reported. He also performed on \"The Wayans Bros.\" television series and voiced the grandfather in \"The Boondocks\" animated series.\n\nHis most recognizable role was \"Pops,\" Ice Cube's father in the stoner comedy \"Friday\" and its two sequels. He played a crude but affectionate father trying to guide his son to be better. Witherspoon’s film roles also included \"Vampire in Brooklyn\" and \"Boomerang,\" and he was a frequent guest on \"Late Show with David Letterman.\"\n\n“I’m devastated over the passing of John Witherspoon. Life won’t be as funny without him,” Ice Cube said on Twitter late Tuesday.\n\nRegina King, who appeared as Witherspoon's daughter in \"Friday\" and also voiced both of his grandsons in \"The Boondocks,\" called him her \"comedic inspiration\" on Twitter.\n\n“My dad, my grandpa, my comedic inspiration! I love you Spoons! Rest In Paradise, King,” she wrote early Wednesday.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nJD Witherspoon, the actor’s son, tweeted that he was happy for all the great times he and his dad had together.\n\n\"We'd roast each other like homies more than Father & Son, and I really liked that. He was my best friend & my idol,\" JD Witherspoon posted. \"Love U Dad...I'll miss u.\"\n\nThe Associated Press contributed to this report.", "description": "Actor and comedian John Witherspoon, who is best known for his role as Ice Cube’s father in the “Friday” films, has died at age 77, his family said in a statement Tuesday.", "authors": ["Danielle Wallace"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/AP19303203029609.jpg", "published_at": "2019-10-30"}