{"pub": "reuters", "url": "https://in.reuters.com/article/uk-soccer-england-liv-leic-report/last-gasp-milner-keeps-liverpool-flying-spurs-crash-again-idINKCN1WK0FH", "downloaded_at": "2019-10-05 23:02:35.034928+00:00", "title": "Last-gasp Milner keeps Liverpool flying; Spurs crash again", "language": "en", "text": "LONDON (Reuters) - A stoppage-time James Milner penalty sparked huge celebrations at Anfield as Liverpool beat Leicester City 2-1 on Saturday for an eighth successive Premier League win that moved them eight points clear at the top of the table.\n\nSoccer Football - Premier League - Liverpool v Leicester City - Anfield, Liverpool, Britain - October 5, 2019 Liverpool's James Milner celebrates scoring their second goal with Andrew Robertson and team mates Action Images via Reuters/Carl Recine\n\nThe contrast with Tottenham Hotspur, whom they beat in last season’s Champions League final, could not be more marked as Mauricio Pochettino’s side continued to ship goals in a 3-0 loss at Brighton & Hove Albion. Aston Villa thumped Norwich City 5-1, Burnley edged Everton 1-0 and Crystal Palace won 2-1 at West Ham United.\n\nWith Manchester City not playing until Sunday, Liverpool looked determined to lay down their marker and were well in control when Sadio Mane scored the opener — his 50th league goal for the club — after getting on the end of a superb through ball from Milner.\n\nBut Leicester were always a threat on the break and looked to have secured a point when James Maddison equalised 10 minutes from time before a rash Mark Albrighton challenge on Mane set up Milner’s penalty chance.\n\n“We had to dig deep and find the points,” said Milner, who said he just had to concentrate and stay calm to convert his 16th spot-kick in 18 attempts for Liverpool.\n\n“The boys have done it time and time again. There was a few tired legs and it was about getting the result.”\n\nThe game ended with several players from both sides confronting each other as passions threatened to boil over.\n\nTottenham’s defeat at the Amex stadium was compounded by a horror injury to keeper Hugo Lloris, who was taken to hospital after injuring his arm in trying to keep out Neal Maupay’s opener on three minutes.\n\nThe French keeper, who made a howler against Southampton last week and conceded seven against Bayern Munich, was badly at fault in parrying the ball straight into Maupay’s path.\n\nBut recriminations were soon forgotten as the severity of his injury became clear and Lloris was treated on the pitch for six minutes before leaving on a stretcher. Spurs later confirmed he had dislocated his elbow.\n\nSUBSTANDARD PERFORMANCE\n\nPochettino said the injury so early in the game affected the rest of the team although questions remain about another substandard Spurs performance so soon after their mauling by Bayern.\n\nBrighton’s other goals were scored by 19-year-old Irish striker Aaron Connolly in his first Premier League start.\n\n“I’ve been watching the Premier League since I was four or five, so to be playing in it now, and then to score and to win 3-0, it really is a dream come true,” Connolly said.\n\nBrazilian striker Wesley scored twice for Aston Villa in the 5-1 win over Norwich although he spurned the chance of a first-half hat-trick by missing a penalty.\n\nThat hardly mattered as Villa recorded their highest away Premier League win in 11 years against a side who had conquered Manchester City in their previous home game.\n\nEverton sit one point above Norwich after their fourth successive league defeat, a result that will pile more pressure on manager Marco Silva. Jeff Hendrick scored Burnley’s winner and Everton will rue the dismissal of Seamus Coleman for two yellow cards.\n\nSlideshow (11 Images)\n\nJordan Ayew scored a VAR-assisted 88th-minute goal to complete Crystal Palace’s comeback victory at West Ham which moved Roy Hodgson’s side into the top four.\n\nWest Ham had taken the lead on 54 minutes through Sebastien Haller but Patrick van Aanholt’s cool penalty brought the visitors level before Ayew’s late winner.\n\nBottom side Watford remained without a Premier League win this season after being held to a goalless draw by Sheffield United at Vicarage Road.", "description": "A stoppage-time James Milner penalty sparked huge celebrations at Anfield as Liverpool beat Leicester City 2-1 on Saturday for an eighth successive Premier League win that moved them eight points clear at the top of the table.", "authors": ["Neil Robinson", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191005&t=2&i=1437478003&w=1200&r=LYNXNPEF940FI", "published_at": "2019-10-05"}