{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/2019/10/10/trumps-blood-your-hands-problem-with-turkey-syria", "downloaded_at": "2019-10-10 15:11:19.854305+00:00", "title": "Trump’s ‘blood on your hands’ problem with Turkey, Syria", "language": "en", "text": "Trump’s intraparty critics have often been criticized for halfheartedly announcing their disapproval of the things Trump does. And that’s certainly still the case here. Rather than directly calling Trump out for his decision to pull troops from northern Syria — a move that is apparently paving the way for Turkey to target the United States’ Kurdish allies who led the fight against the Islamic State in Syria, and that some worry could revitalize it — they’ll often cite the “administration” or broadly express concern about the Kurds.\n\nAD\n\nAD\n\nBut even the things they are saying strongly suggest that the president they support will soon have blood on his hands. They’ll never say it in so many words, perhaps, but that’s really what they’re saying, for all intents and purposes.\n\n“President Trump’s decision to withdraw U.S. forces from northern Syria is having sickening and predictable consequences,” Rep. Liz Cheney (Wyo.), the No. 3-ranking House Republican, said Wednesday. She added: “The U.S. is abandoning our ally the Kurds, who fought ISIS on the ground and helped protect the U.S. homeland. This decision aids America’s adversaries, Russia, Iran, and Turkey, and paves the way for a resurgence of ISIS.”\n\nThe derision extends to Trump’s most devoted base, evangelical Christians. The Rev. Franklin Graham echoed what many evangelicals have been saying Wednesday: “The Kurds are the ones who have been leading the fight against ISIS in Syria. Also pray for the Christians who the Kurds have been protecting. They could be annihilated. Would you pray w/me that Pres. ⁦‪@realDonaldTrump‬⁩ will reconsider? Thousands of lives hang in the balance.”\n\nAD\n\nAD\n\nThe Kurds are the ones who have been leading the fight against ISIS in Syria. Also pray for the Christians who the Kurds have been protecting. They could be annihilated. Would you pray w/me that Pres. @realDonaldTrump will reconsider? Thousands of lives hang in the balance. 2/2 — Franklin Graham (@Franklin_Graham) October 9, 2019\n\nSen. Ben Sasse (R-Neb.) warned Monday, “If the President sticks with this retreat, he needs to know that this bad decision will likely result in the slaughter of allies who fought with us, including women and children.”\n\nSen. Marco Rubio (R-Fla.) said via Twitter that the “administration” had “cut [a] deal with Erdogan allowing him to wipe [the Kurds] out.” He added that “this is not a matter of if many ISIS fighters break out, it’s a matter of when.”\n\nAt request of this administration the Kurds served as the primary ground fighters against ISIS in Syria so U.S. troops wouldn’t have to.\n\n\n\nThen cut deal with Erdogan allowing him to wipe them out.\n\n\n\nDamage to our reputation & national interest will be extraordinary & long lasting. — Marco Rubio (@marcorubio) October 9, 2019\n\nAs I pointed out two days ago in the attached R/T this is not a matter of if many ISIS fighters break out, its a matter of when. https://t.co/3OM7USrf7p pic.twitter.com/xSVhcWBcpP — Marco Rubio (@marcorubio) October 9, 2019\n\nSo Trump cut a deal that will lead to mass death, and terrorists will be freed, at which point they can target the West. Rubio didn’t say Trump, but he said a lot.\n\nSome of these politicians might dress it up, but what they’re saying, strictly speaking, is that Trump has made a decision that could well lead to a mass slaughter of U.S. allies and also increase the threat from the most dangerous terrorist organization in the world. They’re saying that people will die, perhaps en masse, and that Trump’s decision increases the danger to the Western world and Americans.\n\nAD\n\nAD\n\nEven Trump seemed to concede the latter point Wednesday, suggesting that Islamic State fighters might go to Europe.\n\n“Well, they’re going to be escaping to Europe; that’s where they want to go,” he said. “They want to go back to their homes, but Europe didn’t want them from us.”\n\nIf it happens — or if the dire predictions about the Kurds come true — how can Republicans then turn around and say Trump is the steady leader this country needs? How can they argue that “socialism” is worse than an increased terrorist threat and/or the mass death of U.S. allies whom they said Trump, practically speaking, sent to their own slaughter? Most of them still probably would, almost certainly, but that argument would carry significant cognitive dissonance. The quotes above would certainly loom large in Democratic arguments that Trump has proved to be genuinely dangerous.\n\nTo this point in his presidency, despite his many controversies, Trump has avoided a true catastrophe involving massive loss of life that can be directly chalked up to the federal government. Whatever you think of this decision, he has walked into a scenario in which that could well be the case — and even his allies are predicting it pretty unmistakably.\n\nAD", "description": "Trump has made one of the riskiest decisions of his presidency. Top allies are already talking about it as if it's a tragic mistake that will tarnish his entire legacy.", "authors": ["Aaron Blake", "Senior Political Reporter", "Writing For The Fix"], "top_image": "https://www.washingtonpost.com/resizer/5ydt2A2t69sgrOjwZr8P-k-90H4=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QL3ECTXLEAI6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-10"}