{"pub": "businessinsider", "url": "https://businesstimes.com.sg/stocks/australia-shares-follow-wall-street-higher-on-a-quiet-day", "downloaded_at": "2019-10-07 07:41:15.434563+00:00", "title": "Australia shares follow Wall Street higher on a quiet day", "language": "en", "text": "[BENGALURU] Australian shares closed higher in light trade on Monday, tracking Wall Street gains after US employment data on Friday reduced concerns over a possible recession in the world's largest economy.\n\nThe S&P/ASX 200 index rose 0.7 per cent to end at 6563.60.\n\nTrading was subdued owing to public holidays across a number of Australian states, including New South Wales and Queensland. Volumes were just a little above one-third of their 30-day average.\n\nAustralian stocks were also recovering from their worst week in 11 months, losing about 3 per cent, as signs of weak business activity globally saw investors pulling out of risky assets.\n\nsentifi.com Market voices on:\n\nThe jobs data from the United States and the drop in the unemployment rate to the lowest in 50 years led major indices to rise more than 1 per cent on Friday.\n\n\"The US economy, having had some pretty poor data points earlier in the week, seemed to be fairly robust - the equity markets liked it,\" said Damian Rooney, director of equity sales at Argonaut.\n\nHowever, it could be \"more of a mark-up than real conviction,\" he added, noting that there were still a number of \"speedbumps\" in store for markets from uncertainty over slowing economic growth and political ructions in the United States and Europe.\n\nMining stocks were among Monday's key drivers for the ASX 200 index, bolstered by gold stocks.\n\nThe ASX Gold Index finished 1.6 per cent higher on firmer bullion, with Aurelia Metals and Ramelius Resources ending more than 8 per cent and 6 per cent higher, respectively.\n\nInvestment conglomerate Washington H Soul Pattinson was the top gainer by percentage. It rose more than 7 per cent, which domestic media attributed to a target price hike by brokerage Shaw and Partners.\n\nFinancial stocks tracked their Wall Street peers higher, with the country's Big Four banks posting gains between 0.3 per cent and 0.7 per cent.\n\nTechnology stocks, the best performing sector on the ASX 200 this year, closed the session about 1.4 per cent higher, led by software firm WiseTech Global, which finished up over 4 per cent and was among the top percentage gainers on the benchmark.\n\nNew Zealand stocks closed 0.8 per cent or 82.8 points higher at 10,975.62.\n\nFonterra, the world's largest dairy producer, was the top percentage gainer on the benchmark, finishing 5.8 per cent higher.\n\nREUTERS", "description": ": THE BUSINESS TIMES Stocks - [BENGALURU] Australian shares closed higher in light trade on Monday, tracking Wall Street gains after US employment data on Friday reduced concerns over a possible recession in the world's largest economy. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/07/file76jitodddblinhy0da6_0.jpg?itok=NjgghUnk", "published_at": "2019-10-07"}