{"pub": "npr", "url": "https://npr.org/2019/10/01/765987523/advocates-say-trump-s-immigration-plan-creates-nightmarish-situations", "downloaded_at": "2019-10-02 00:34:11.858333+00:00", "title": "Advocates Say President Trump's Immigration Policy Is 'A Tool Of Cruelty'", "language": "en", "text": "Advocates Say President Trump's Immigration Policy Is 'A Tool Of Cruelty'\n\ntoggle caption Fernando Llano/AP\n\nUpdated 6 p.m. ET\n\nImmigrant advocates asked a federal appeals court on Tuesday to block the Migrant Protection Protocols (MPP), a key part of President Trump's immigration policy. The policy forces asylum seekers to wait for their immigration court hearings in Mexico.\n\n\"Our chief concern right now, and it's urgent, is to prevent the suffering that is happening as a result of this policy,\" said attorney Judy Rabinovitz, a lawyer with the American Civil Liberties Union, during a hearing before a three-judge panel of the Ninth Circuit Court of Appeals in San Francisco.\n\nGovernment lawyers argue that the policy is a crucial part of the administration's \"efforts to combat a massive and growing crisis at our southern border,\" as they wrote in their briefing, and urged the Ninth Circuit court to leave it in place.\n\nThe Migrant Protection Protocols is the Trump administration's answer to what the president calls \"catch and release\" — the practice of letting asylum seekers live in the U.S. while their cases wind through immigration court.\n\nThe policy, originally known as Remain In Mexico, began January in the San Diego area, and has since expanded to the rest of the border. It was designed by the Trump administration to stop the historic influx of migrants, particularly families and children fleeing from Central America.\n\n\"This is to assure a safe and orderly flow\" of migrants, said then-Homeland Security Secretary Kirstjen Nielsen in a hearing before Congress in March, \"and to ensure that their humanitarian rights are protected.\"\n\nBut immigrant advocates say that's not happening.\n\nThey argue that the program violates U.S. law because it forces migrants to wait in places where they're not safe and can't get lawyers. Advocates say the human toll is enormous, with vulnerable migrants targeted in dangerous Mexican border towns.\n\n\"I'm a migrant. In Juarez, a migrant is money. For bad people here, I represent money to them,\" said Gabi, a Honduran migrant who was returned to Ciudad Juarez, Mexico, more than six months ago.\n\nShortly afterwards, Gabi says she and her 5-year-old daughter Sofia were kidnapped by a cab driver in Juarez. Her family in Honduras had to send money to get them released.\n\nGabi asked that we only use her first name because the family is still in immigration proceedings. One night in March, they crossed the Rio Grande into El Paso, Texas, where Border Patrol agents took them into custody.\n\n\"They told my kids to stop crying, they were going to a safe place were they'd have food and be treated well,\" she said in Spanish through an interpreter. But Gabi and her family spent the next three nights sleeping on the ground under a bridge where U.S. immigration detained hundreds of people.\n\nImages of those migrants in a parking lot under mylar blankets were big news in the spring, when migrants were being taken into custody at a rate of more than 100,000 per month. Kevin McAleenan, who was then the commissioner of U.S. Customs and Border Protection, went to El Paso to sound the alarm.\n\n\"We are doing everything we can to simply avoid a tragedy in a CBP facility,\" McAleenan said. \"But with these numbers, with the types of illnesses we're seeing at the border, it's just a matter of time.\"\n\nGabi's daughter did get sick. The 5-year-old suffered from severe stomach problems that required a lot of medical attention. Gabi blames the food and the stress of being detained.\n\nThen her family was separated by immigration authorities. She thinks it's because she and her husband don't have an official marriage license. Without explanation, her husband and son were released to join relatives in the U.S. — while Gabi and her daughter were sent back to Mexico.\n\nShe's still struggling to understand why.\n\n\"Everyone has asked me that question,\" she said. \"Why were you sent back with a child who was sick?\"\n\nGabi and her family arrived in El Paso just as MPP was expanding beyond California and Arizona to Texas for the first time. It's since expanded to the Rio Grande Valley as well.\n\nImmigration officials have downplayed reports of kidnapping, robbery and other crimes against migrants who were forcibly returned to Mexico.\n\nInstead, they say the program is a game-changer because it's helped curbed the influx of migrants. And its allowed immigration authorities to fulfill a central campaign promise of President Trump: the end of \"catch and release.\"\n\nKevin McAleenan, now the acting Homeland Security Secretary, announced last week that most migrant families will no longer be allowed to live in the U.S. while they wait for their day before immigration judge. The administration argues that's created an incentive for migrants to make the dangerous journey to the U.S., because they know it may take years before their asylum case is heard because of a backlog of more than one million immigration cases.\n\n\"DHS will no longer be releasing family units from Border Patrol stations into the interior,\" McAleenan said. \"This is a vital step in restoring the rule of law and integrity to our immigration system.\"\n\ntoggle caption Christian Chavez/AP\n\nFor the most part, those migrants are now being sent back to Mexico. More than 48,000 have been returned so far, according to CBP.\n\nGabi and her daughter were among the first to be returned to Juarez. They've been going back and forth to immigration court in El Paso for months, arguing that they deserve political asylum in the U.S.\n\nIn Honduras, which is rife with corruption and violence, Gabi says her family was threatened by a local gang for supporting the wrong political party.\n\n\"I feel she has a decent asylum claim,\" said her attorney, Linda Rivas, the executive director of the Las Americas Immigrant Advocacy Center, and one of the few lawyers in El Paso who's been willing to take on cases of migrants in Juarez.\n\n\"But the reality is we are in an incredibly difficult jurisdiction. And I can't guarantee her a victory in an El Paso court. I just can't,\" Rivas said.\n\nThat's left Gabi facing a harrowing choice between doing what's best for her daughter, or what's best for her son. Her daughter Sofia has dropped from 40 pounds to just 26 pounds — approximately what a 3-year-old should weigh.\n\n\"It's still her stomach, she's really sick from her stomach since we got here,\" Gabi said.\n\n\"Sofia hardly eats anything. She just watches TV. There are days that she doesn't want to talk to me... She doesn't want anything.\"\n\nGabi's 7-year-old son, meanwhile, is growing up without her, thousands of miles away with his father and other relatives in Connecticut.\n\n\"He says 'mommy, I'm praying every day to God for you to come here.' He pleads with me not to give up and tells me that he's waiting for me,\" Gabi said. \"It's really hard because it's the first time we've been separated and he tells me he misses me and doing homework together. It's really hard.\"\n\nGabi's lawyer, Linda Rivas, says this is what happens to migrants under the Migrant Protection Protocols.\n\n\"It is a tool of cruelty by this administration,\" Rivas said. \"And this young mother — this young but strong and brave mother — is living this every single day.\"\n\nGabi was scheduled for her final asylum hearing on Monday, but she didn't go. Gabi and her daughter took a bus back home to Honduras. She thinks it's the best place for her daughter to get healthy.\n\nShe doesn't know when she'll see her son or her husband again.", "description": "The Trump administration has ended \"catch and release\" by sending migrants to Mexico while their asylum cases are pending in the U.S. Opponents argued in court Tuesday that the program is illegal.", "authors": ["Joel Rose"], "top_image": "https://media.npr.org/assets/img/2019/10/01/ap_19260476946990_wide-5a459678107751dd6df70ce5ab13fe1fc1316ed5.jpg?s=1400", "published_at": "2019-10-01"}