{"pub": "cbc", "url": "https://cbc.ca/sports/football/nfl/nick-foles-myles-jack-jaguars-opener-1.5275413", "downloaded_at": "2019-09-08 23:26:31.573164+00:00", "title": "Sports-no-CBC", "language": "en", "text": "Patrick Mahomes was every bit as good as he was during his MVP campaign. Sammy Watkins was better than ever.\n\nMahomes and Watkins — along with new teammate LeSean McCoy — helped the Kansas City Chiefs open the season much like they finished last year: as legitimate Super Bowl contenders.\n\nDespite losing star receiver Tyreek Hill early, Mahomes threw for 378 yards and three touchdowns while leading the Chiefs to a testy and tactful 40-26 victory over the injury-riddled Jacksonville Jaguars on Sunday.\n\n\"They've done that to a lot of football teams,\" Jaguars coach Doug Marrone said.\n\nJags lose QB Foles\n\nJacksonville had major issues on both sides of the ball, none more concerning than the health of quarterback Nick Foles. Foles broke his left clavicle in the first quarter and will have surgery Monday. Chris Jones hit Foles as he released a 35-yard TD pass to DJ Chark. Jones landed on top of Foles, but did not draw a flag.\n\nFoles is expected to be put on injured reserve and won't be eligible to play again until Week 11.\n\n\"It's not the way you want to start your time here,\" said Foles, who signed a four-year, $88 million contract in March. \"Sometimes things don't happen like we expect them to, but we just have to have faith that it's for a reason.\"\n\nThe injury leaves rookie Gardner Minshew in line to start a significant chunk of Jacksonville's season. Minshew was one of the team's few bright spots. He completed 22 of 25 passes for 275 yards, with two touchdowns and an interception.\n\nChark caught four passes for 146 yards, and Chris Conley added six receptions for 97 yards and a score against his former team.\n\nMahomes completed passes to nine receivers. Watkins had most of the highlights.\n\nWatkins had nine receptions for a career-high 198 yards and three TDs. He slipped through the middle of Jacksonville's defense for a 68-yard score on the third play of the season and added a 49-yard TD reception late in the opening quarter. He made defenders Ronnie Harrison, Jalen Ramsey and Miles Jack look silly while strolling into the end zone twice. He beat Ramsey again for a short TD in the fourth quarter.\n\nMahomes took a beating even though he wasn't sacked and even had to leave the game to get his left ankle taped in the second quarter.\n\nIt barely slowed him and the Chiefs down; they scored on their first seven possessions.\n\nMcCoy carried 10 times for 81 yards despite barely knowing the offense.\n\n\"We have a mindset throughout the season of taking care of certain goals and this was one of them,\" Chiefs All-Pro tight end Travis Kelce said. \"Just come out blazing, on fire, like we were last year. ... I think we're on the right track and we're going to keep working to get where we want to be.\"\n\nHill taken to hospital\n\nChiefs star Tyreek Hill was transported to a hospital after sustaining a shoulder injury.\n\nThe team's head athletic trainer, Rick Burkholder, said Hill had a \"sternoclavicular joint injury\" and was taken to Baptist Medical Center in Jacksonville. His care was turned over to an ortho-trauma physician.\n\nBurkholder said Hill was being treated to \"reduce the dislocation or the injury.\"\n\nJack ejected\n\nJaguars linebacker Jack was ejected in the second quarter after taking a swing at Chiefs receiver Demarcus Robinson. Jack had to be restrained by team officials and essentially pulled off the field.\n\nJack and Watkins got into a shoving match after a fumble, and then Robinson came in and shoved Jack in the back. Ramsey and others joined in, prompting officials to throw five flags and a hat onto the ground. Jack eventually got the boot after a lengthy discussion.\n\nJack, a team captain who recently signed a $57 million extension, apologized in the locker room after the game.\n\n\"It will not happen again,\" he said.\n\nClark's debut\n\nFrank Clark, who recorded 35 sacks the last four years with Seattle, made his Chiefs debut and had an interception off a tipped pass. Clark signed a five-year, $104 million deal to join Kansas City in free agency.\n\n\"I've got more picks than Jalen Ramsey right now so that's a highlight,\" Clark said.\n\nRare fumble\n\nJacksonville's Leonard Fournette gained 66 yards on 13 carries and fumbled for the first time in his three NFL seasons. Damien Wilson stripped the ball out of Fournette's hands after a catch in the flat.\n\nIt was Fournette's first lost fumble since Nov. 12, 2016, during his junior year at LSU.", "description": "Despite losing star receiver Tyreek Hill early, Patrick Mahomes threw for 378 yards and three touchdowns while leading the Kansas City Chiefs to a testy and tactful 40-26 victory over the injury-riddled Jacksonville Jaguars on Sunday.", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5275473.1567974600!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1173163125.jpg", "published_at": "2019-09-08"}