{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7624189/Evelyn-Cotter-94-forced-fit-undergo-life-saving-bowel-surgery-two-years-ago.html", "downloaded_at": "2019-10-29 06:16:06.574487+00:00", "title": "Evelyn Cotter, 94, forced herself to get fit to undergo life-saving bowel surgery two years ago", "language": "en", "text": "Evelyn Cotter was 92 when she was told she had bowel cancer and needed life-saving surgery\n\nEvelyn Cotter was 92 when she was told she had bowel cancer and needed life-saving surgery.\n\nHowever, it looked as though the operation would not go ahead when the former teacher failed a pre-operative fitness test, including being able to pedal for ten minutes on a stationary bike. ‘I became breathless after four minutes,’ says Evelyn, 94, from Llanishen, near Cardiff. The anaesthetist was adamant it wasn’t safe to proceed with the surgery.\n\nBut Evelyn was ready to fight back. At home, with the support of her daughter, Mairiona, 69, she began to walk round her garden while the kettle was boiling, increasing the circuit to four times a day. She also began to breathe more deeply, holding each breath for 25 seconds.\n\nAfter just eight weeks, she returned to the University Hospital of Wales in Cardiff and passed the fitness test with flying colours. She then had the surgery in 2017, recovering with improved health all-round. ‘I’ve picked up my amateur painting again and have just won a prize for my embroidery,’ says Evelyn. ‘I’m still driving and love gardening.’\n\nWhile our population is ageing, the age of the ten million patients who undergo surgery in the NHS annually is rising faster. The average age in England is 40, but for surgical patients it’s 54, the British Journal of Surgery reported in May. Eight in 100 Britons are now over 75, but they account for one in four operations. Yet making a decision about surgery for older people can be complicated.\n\nThe more birthdays you’ve had, the riskier surgery can be.\n\nCommon health problems related to ageing, such as high blood pressure, clogged arteries, and heart and lung disease, leave older people with an increased risk of dangerous and potentially fatal complications such as bleeding or infection during or after surgery.\n\nNow researchers in Canada have identified a new risk. As The Lancet reported in August, one in 14 surgery patients aged over 65 is at risk of a ‘covert’ or ‘silent’ stroke — where a clot reduces blood flow briefly to a part of the brain that doesn’t control any obvious functions and therefore may not cause any symptoms immediately.\n\nYet the impact — detectable on an MRI scan — can lead to measurable cognitive decline a year later, frequently involving depression as well as memory and concentration problems and an increased risk of dementia and having a major stroke.\n\n‘Surgeons are now able to operate on older and sicker patients and, despite the benefits it brings, we need to understand the risks,’ said Marko Mrkobrada, a professor of medicine at the University of Western Ontario, Canada.\n\nMeanwhile, up to one in 200 patients aged over 65 suffers a stroke perioperatively — during or immediately after an operation — if it causes, or worsens, a weakness in a blood vessel supplying the brain.\n\nAt home, with the support of her daughter, Mairiona, 69, she began to walk round her garden while the kettle was boiling, increasing the circuit to four times a day. Pictured: Evelyn with her daughter Mairiona in 2016\n\nA major study involving 2,000 older patients undergoing surgery, published in the British Journal of Anaesthesia last month, suggests that exposure to anaesthesia after the age of 70 causes ‘long-term changes in brain function including a subtle decline in memory and thinking skills’, as the lead researcher, Dr Juraj Sprung, an anaesthesiologist from the Mayo Clinic in the U.S., explained. But the jury is still out as to what’s behind this.\n\n‘The exact mechanism causing this change in cognition is not well understood,’ says James Pickett, head of research at the charity Alzheimer’s Society. ‘Some research suggests this is as a result of the surgery, while other studies point to the anaesthesia.’\n\nThere is some evidence concentration and memory problems can result from disorientation of being hospitalised. The American Society of Anesthesiologists last year advised relatives they could help patients’ rehabilitation by bringing in family photos, a clock and calendar to help patients readjust to normal life.\n\nBut how can the UK best ensure that older people get safe surgery when they need it?\n\nFive years ago, the NHS spoke out against age discrimination following evidence that up to 14,000 older patients were dying every year because they were denied surgery. ‘Age should never stop you having an operation,’ says Dr Jonathan Hewitt, a stroke specialist at the Aneurin Bevan University Health Board in Cardiff.\n\nA key priority for successful surgery in older age is the involvement of a range of health professionals — notably specialists in this age group — rather than care simply being provided by surgeons with anaesthetic and nursing support. Dr Hewitt is a member of Older Persons Surgical Outcomes Collaboration (OPSOC), a newly established international group of surgeons, geriatricians and statisticians whose aim is to bring different health professionals together to improve the surgical care of older people.\n\nIt is also recognised that older patients must have a voice, explains Dr Mike Swart, a consultant in anaesthesia and critical care medicine at Torbay Hospital and the Royal College of Anaesthetists’ clinical lead for perioperative medicine, as they often focus on something that may not be a real risk. ‘If you have had a stroke before, that can be the biggest worry, even if there’s not much risk statistically,’ he says.\n\nAfter just eight weeks, Evelyn returned to the University Hospital of Wales in Cardiff and passed the fitness test with flying colours\n\nDiagnosed with bowel cancer two years ago at the age of 63, Simon Pillinger needed an urgent operation, but he felt that the first surgeon he saw had little interest in what mattered to him.\n\nHe felt the surgeon was ‘railroading’ him into surgery that could damage his sex life and leave him with a permanent colostomy bag. ‘He wanted to do the operation his way, regardless of its impact on me,’ says the former policeman from Weston-super-Mare.\n\nHe asked for a second opinion and was referred to Kathryn McCarthy. The consultant colorectal surgeon at North Bristol NHS Trust took a very different approach. They talked through Simon’s choices and decided to go for nerve-sparing surgery that would avoid incontinence and loss of sexual function, and with a temporary colostomy bag.\n\nIn a pioneering perioperative clinic at Torbay Hospital in Devon, high-risk older patients receive an hour-long, one-to-one consultation with senior clinicians, who help to provide support in the patient’s decision-making.\n\nMoving forward, a major new study will investigate the impact on older patients of a decision not to carry out an operation deemed necessary for whatever reason.\n\nCurrently, how fitness for surgery is defined varies, and that needs to change, says Susan Moug, a consultant colorectal surgeon and clinical associate professor at the University of Glasgow.\n\nNew evidence confirms, unsurprisingly, that it’s not age itself but how frail a person is that det-ermines the response to surgery.\n\nIn a study, published in the journal Age and Ageing in February, UK researchers monitored 2,279 surgical emergency cases in those aged under 40 to over 80. They reported that the more frail the patient, the more likely they were to die, independent of age.\n\nBut surgery is not for every older person, including those with early signs of dementia whose disease may be worsened by the anaesthesia or the surgery itself.\n\n‘It may be that someone with a moderately painful hip who is referred for surgery with early dementia should consider whether they can manage without the operation if the pain is manageable by other means,’ says Dr Swart.\n\nAbove all, adds surgeon Kathryn McCarthy, ‘we need to raise awareness among patients about what’s involved in surgery so they can make an informed decision about the risks versus the benefits’.\n\nUNDER THE WEATHER\n\nThe health concerns worsened by cold weather. This week: Mood\n\nAround one in 15 people in the UK says their mood is severely affected between the months of September and April, as the days get shorter and darker.\n\nLack of light is thought to be a major contributor to winter mood. ‘Specifically, the lack of morning light in winter can affect our mood, alertness and how long it takes the groggy feeling we have upon waking (so-called sleep inertia) to dissipate,’ says Victoria Revel, a chronobiologist at the University of Surrey.\n\n‘Getting bright light upon awakening and during the daytime hours in winter is therefore very important. Light upon waking will keep your body clock in check. Using a light box at your desk during the day can help keep up your energy, mood and alertness during the day; as can getting outside into natural daylight.’\n\nMILITARY MEDICINE\n\nMedical breakthroughs that began on the battlefield. This week: Chemotherapy (stock image)\n\nMedical breakthroughs that began on the battlefield. This week: Chemotherapy\n\nIt’s been the mainstay of cancer treatment since the 1950s, but the first form of chemotherapy was based on deadly mustard gas.\n\nIn the trenches of World War I, this chemical weapon killed tens of thousands of soldiers through asphyxiation brought on by blisters the gas caused in their throat and lungs.\n\nScientists at Yale University in the U.S. later discovered that mustard gas also appeared to kill white blood cells, infection-fighting cells produced in bone marrow.\n\nScientists wondered if it could do the same to cancer cells and, in 1942, tested it on a man riddled with lymphomas.\n\nHe was given nitrogen mustard, the compound used to make mustard gas and the tumours shrank.\n\nScientists later developed safer, more effective chemotherapy drugs, although they still have unpleasant side-effects.", "description": "Evelyn initially failed a pre-operative fitness test. But after just eight weeks of training, she returned to the University Hospital of Wales in Cardiff and passed.", "authors": ["Jane Feinmann For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/00/20305388-0-image-a-66_1572308216237.jpg", "published_at": "2019-10-29"}