{"pub": "axios", "url": "https://axios.com/chernin-group-meateater-netflix-steven-rinella-512552ae-cb1a-48c4-978e-f925550d0e96.html", "downloaded_at": "2019-10-08 15:10:50.512949+00:00", "title": "Exclusive: The Chernin Group pours $50 million into MeatEater", "language": "en", "text": "Over the summer, TCG poured $50 million of additional capital into the franchise, of which it's a majority stakeholder. That money was used, in part, to make MeatEater's first acquisition. The company acquired First Lite over the summer, a technical apparel brand that it has partnered with for years.\n\nDriving the news: Leading up to the launch of MeatEater's 8th season on Netflix this month, the brand is going all in on commerce. The majority of the revenue from the company at this point comes from selling stuff, not licensing its show to Netflix.\n\nWhiskey: On Friday, MeatEater launched MeatEater Straight Bourbon Whiskey. According to Kevin Sloan, CEO of MeatEater, the company sold over 60% of its first batch of whiskey in its first three days of sales.\n\nOn Friday, MeatEater launched MeatEater Straight Bourbon Whiskey. According to Kevin Sloan, CEO of MeatEater, the company sold over 60% of its first batch of whiskey in its first three days of sales. Cookbooks: The MeatEater Fish & Game Cookbook reached the #10 most-sold book in the nonfiction category on Amazon Charts and remained there for a week.\n\nThe MeatEater Fish & Game Cookbook reached the #10 most-sold book in the nonfiction category on Amazon Charts and remained there for a week. Apparel: According to Sloan, First Lite brought in more than $2 million in just 2 days after MeatEater ran its first promotion across its podcasts and digital channels.\n\nYes, but: The company still makes money from media and live events. Overall, Sloan says, revenue is up 300% year-over-year, due in part to the growth of the company's podcast, sponsorships, licensing and live events businesses.\n\nMeatEater sold more than 10,000 live tickets last year.\n\nIt's launched two new YouTube shows on fishing and hunting, as well as five new podcasts.\n\nThe big picture: The outdoor/adventure content category seems small, but a farm-to-table health trend country-wide is pushing some of its content mainstream, especially on the food and beverage side.\n\n\"The Meat Eater brand and content rally cuts across the whole country,\" says Kerns. \"The podcast performance for the brand is actually strongest in big DMAs like the Bay Area, Southern California, the Northwest as well as MidWest.\"\n\nThe bottom line: For Chernin, the investment follows a similar pattern of investing in niche content businesses that don't rely on advertising. The company took a majority stake last week in Food52, a home goods and food site, for $83 million.", "description": "There's several billion dollars a year spent just from Americans.\"", "authors": [], "top_image": "https://images.axios.com/_bq2oQi-L0TmgiIU7IEInf5vihQ=/0x204:6000x3579/1920x1080/2019/10/08/1570529379450.jpg", "published_at": "2019-10-08"}