{"pub": "cnbc", "url": "https://cnbc.com/2019/10/30/asia-markets-october-30-fed-rate-decision-us-china-trade-currencies.html", "downloaded_at": "2019-10-29 23:58:11.536640+00:00", "title": "Asia stocks set to dip ahead of Fed interest rate decision", "language": "en", "text": "Meanwhile, Australian shares slipped in early trade as the S&P/ASX 200 slipped about 0.3%. Investors will watch for the release of the Consumer Price Index for the third quarter, set to be out at around 8:30 a.m. HK/SIN.\n\nFutures pointed to a lower open for Japanese stocks. The Nikkei futures contract in Chicago was at 22,930, while its counterpart in Osaka was at 22,920. That compared against the Nikkei 225's last close at 22,974.13. Japanese retail sales data for September is expected at 7:50 a.m. HK/SIN.\n\nStocks in Asia were set to dip at the open on Wednesday ahead of the U.S. Federal Reserve's interest rate decision, set to be announced later on Wednesday stateside.\n\nThe Fed is largely expected to slash interest rates by 25 basis points later this week. That would mark its third rate cut for this year.\n\nAhead of the Fed decision, the U.S. dollar index which tracks the greenback against a basket of its peers was last at 97.690 after scaling highs above 97.8 yesterday.\n\n\"With Fed fund futures showing a 94% chance of a cut, the performance of the dollar confirms that investors expect this to be the central bank's last move of the year,\" Kathy Lien, managing director of foreign exchange strategy at BK Asset Management, wrote in an overnight note.\n\nDevelopments on the U.S.-China trade front will also be monitored. Reuters reported Tuesday that the phase one trade deal may not be signed at a November summit in Chile. The report, however, cited a U.S. administration official who said: \"If it's not signed in Chile, that doesn't mean that it falls apart. It just means that it's not ready.\"\n\nOvernight on Wall Street, the S&P 500 touched a fresh record high before ending the session 0.1% lower at 3,036.89. Meanwhile, the Dow Jones Industrial Average closed 19.30 points lower at 27,071.42 while the Nasdaq Composite shed 0.6% to end its trading day at 8,276.85.\n\nThe Japanese yen traded at 108.87 against the dollar after strengthening from levels above 108.9 yesterday. The Australian dollar was at $0.6857 after rising from levels around $0.684 in the previous session.\n\nWhat's on tap:\n\nJapan: Retail sales data for September at 7:50 a.m. HK/SIN\n\nAustralia: Consumer Price Index for the third quarter at 8:30 a.m. HK/SIN\n\nSouth Korea earnings: Samsung Electronics, LG Electronics\n\nHong Kong earnings: Standard Chartered\n\n— CNBC's Fred Imbert contributed to this report.", "description": "The Fed is largely expected to slash interest rates by 25 basis points later this week. That would mark its third rate cut for this year.", "authors": ["Eustance Huang"], "top_image": "https://image.cnbcfm.com/api/v1/image/105429996-1536015814871gettyimages-1025189456.jpeg?v=1572391524", "published_at": "2019-10-29"}