{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/advice/carolyn-hax-bringing-j-peterman-home-to-meet-the-folks/2019/10/21/47217a96-f131-11e9-89eb-ec56cd414732_story.html", "downloaded_at": "2019-10-23 08:44:56.218221+00:00", "title": "Carolyn Hax: Bringing J. Peterman home to meet the folks", "language": "en", "text": "Advice columnist\n\nDear Carolyn: My boyfriend is the smartest, most cultured man I've ever known. One of his great abilities is his appreciation for nuance. I love how, when we are out at museums, he can infer things that I can't and capture his observations in a subtle and clear way.\n\nHe comes from great education: top private school, multiple Ivy League degrees, and success along the way. But my family came from nearly nothing and, to put it diplomatically, is wary of those who come from elite backgrounds and who speak like it.\n\nWhen my boyfriend meets my parents, is it okay to ask him to tone down his vocabulary when speaking with them? It would be better if he used \"secret\" instead of \"surreptitious\" or \"talkative\" instead of \"loquacious.\" He'll use idioms, from \"in point of fact\" to \"a hale fellow well met.\" He does it both because it's the way he was raised but also because he believes that a literary phrase better describes what he's thinking. It's not pompous, it's subtle and nuanced.\n\nStill, I'm afraid my parents will be distrustful of him when they realize his highbrow, East Coast roots. He has no intention of putting them down, and he's eager to meet them. He is as egalitarian as they come.\n\nIf I ask him to speak plainly and without complicated vocabulary when he's with my parents, is that a strike against his own identity? I somehow feel, in this case, that I have to do it or my parents won't ever accept him. Whose identity should take preference here when they can't both coexist?\n\n— C.\n\nC.: Coaching people to be who they aren’t just doesn’t work. Not for long.\n\nBesides, if your parents aren’t too biased and narrow-minded to see a good person through big words, then things will turn out okay.\n\nAnd if your boyfriend isn’t too pompous and self-absorbed to find ways to communicate with your parents, then things will turn out okay.\n\nIf your parents prove narrow-minded, though, and/or your boyfriend is self-absorbed, then there won’t be much you could have done to make things turn out okay.\n\nSo if you find their two identities genuinely and demonstrably can’t coexist in peace, then align yourself with the identity that isn’t being obnoxious.\n\nPlease also note: Whenever you start to behave as a director in charge of a scene instead of letting people figure each other out, the judgment you don’t trust is your own.\n\nThat’s where your coaching impulses can do you some good: Admit to yourself you’re afraid of the one thing that will work here, which is to let them all meet and figure things out for themselves.\n\nCaring so much about the outcome means it will feel suspenseful and awkward for you at times to say nothing, and you’ll be tempted to jump in and sell each of them on the other’s many strengths, but do resist. You can’t make them like each other.\n\nYou also can’t get any better emotional intel than when you leave people to their own devices:\n\nEither you chose yourself a good man hale fellow well met — apologies to those attempting breakfast — or you didn’t.\n\nEither your parents are reliable judges of character, or they aren’t.\n\nGodspeed to kith and kin.", "description": "Her parents are plainspoken people, her boyfriend’s erudite — and she’s worried.", "authors": ["Carolyn Hax", "Advice Columnist", "October At Pm", "Carolyn Hax Started Her Advice Column In", "After Five Years As A Copy Editor", "News Editor In Style", "None As A Therapist. The Column Includes Cartoons", "Relationship Cartoonist", "Nick Galifianakis", "Carolyn'S Ex-Husband"], "top_image": "https://www.washingtonpost.com/resizer/iRiRSpUygyHLu9-XW3L7dcvUHFY=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/M2U7MXHPTYI6TO362IBG5YGBTE.jpg", "published_at": "2019-10-21"}