{"pub": "yahoo", "url": "https://news.yahoo.com/fox-news-tucker-carlson-turns-081704264.html", "downloaded_at": "2019-10-06 00:27:02.005389+00:00", "title": "Fox News’ Tucker Carlson turns on Trump for asking Ukraine to investigate his rival Joe Biden: ‘There’s no way to spin this’", "language": "en", "text": "Tucker Carlson has criticised Donald Trump for encouraging Ukraine to investigate his 2020 rival Joe Biden in a rare break from his staunch support for the president.\n\nMr Carlson, who is one of Fox News’ leading presenters, fell short of backing impeachment in an op-ed on Friday but admitted that Mr Trump should not have raised the prospect of an investigation into Mr Biden and his son Hunter.\n\n“Donald Trump should not have been on the phone with a foreign head of state encouraging another country to investigate his political opponent, Joe Biden,” he said.\n\n“Some Republicans are trying, but there’s no way to spin this as a good idea.”\n\nMr Trump is accused of using the call with Volodymyr Zelensky, Ukraine’s president, as part of a wider campaign to force Ukraine into investigating the Bidens that may have included withholding a White House visit and financial aid to the country.\n\nThe Fox News host co-wrote the op-ed for The Daily Caller, the right-wing website he helped set up, with fellow co-founder Neil Patel.\n\nMr Carlson added: “Our leaders’ official actions should not be about politics…\n\n“Once those in control of our government use it to advance their political goals, we become just another of the world’s many corrupt countries.”\n\nRead more\n\nWhite House subpoenaed as Trump impeachment pressure mounts\n\nHowever, Carlson insisted that the president’s actions did not rise to the level of an impeachable offence and claimed it was “hard to argue” that Mr Trump should be removed from office.\n\nSome political commentators have suggested Mr Carlson’s criticism of Mr Trump showed a pivot in conservative strategy for defending the president.\n\n“This is a pretty transparent effort to provide a roadmap for Republicans looking for a way to publicly condemn Trump’s actions but still oppose impeachment,” Abby D Phillip, a political correspondent for CNN, said.\n\nMr Carlson has previously criticised the president and complained in 2018 that Mr Trump had not fulfilled his campaign promises.\n\n“His chief promises were that he would build the wall, defund Planned Parenthood and repeal Obamacare, and he hasn’t done any of those things,” the right-wing host said.\n\n“It’s mostly his fault that he hasn’t achieved those things.\"\n\nNevertheless, Mr Carlson’s primetime Fox News show has been consistent in its support for Mr Trump.\n\nAs a prominent conservative political commentator for more than two decades, Mr Carlson has been accused of racism, climate change denial and spreading conspiracy theories.\n\nIn August, advertisers deserted his Fox News show after he called white supremacy “a hoax” in the wake of the El Paso mass shooting.\n\nRead more\n\nRead more White House subpoenaed as Trump impeachment pressure mounts", "description": "Tucker Carlson has criticised Donald Trump for encouraging Ukraine to investigate his 2020 rival Joe Biden in a rare break from his staunch support for the president.Mr Carlson, who is one of Fox News’ leading presenters, fell short of backing impeachment in an op-ed on Friday but admitted that Mr Trump", "authors": ["Conrad Duncan"], "top_image": "https://s.yimg.com/uu/api/res/1.2/5S29Ud0GmZK.tNA.esRJSA--~B/aD0zOTU7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/8b82a1d2626bdd68b5d249b28c0ae3ed", "published_at": "2019-10-05"}