{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/15/australian-left-thirsty-on-emirates-flight-loses-i", "downloaded_at": "2019-10-15 08:01:29.868281+00:00", "title": "Australian left thirsty on Emirates flight loses injury case", "language": "en", "text": "CANBERRA, Australia (AP) - A passenger who said she was left thirsty by an Emirates cabin crew and broke her ankle when she fainted on the flight lost her case in an Australian court on Tuesday for compensation.\n\nLina Di Falco, 54, sued the United Arab Emirates-based airline in the Victoria state Supreme Court for damages over a broken ankle sustained on the flight from Melbourne to Dubai in 2015.\n\nDi Falco testified she felt nauseous after her first meal in the economy cabin and fainted because of dehydration while walking to a toilet.\n\nShe had asked cabin crew for water four times and said she only received a small amount in a cup with her meal. She didn’t notice a drinking fountain in a galley area five rows behind her.\n\nJustice Jacinta Forbes found Di Falco’s requests for water “were not refused, merely deferred to later.”\n\nThe judge found that the airline was not liable under the Montreal Convention, which sets out compensation rules for victims of air disasters, because “nothing unusual or unexpected” occurred during the flight that would meet the definition of an “accident.”\n\nEmirates did not immediately respond to The Associated Press’ request for comment on Tuesday.\n\nCabin crew supervisor Leon van der Plas testified during the trial that passengers faint two or three times a week. Two weeks rarely passed without at least one passenger fainting, he said.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "A passenger who said she was left thirsty by an Emirates cabin crew and broke her ankle when she fainted on the flight lost her case in an Australian court on Tuesday for compensation.", "authors": ["The Washington Times Http", "Rod Mcguirk"], "top_image": "", "published_at": "2019-10-15"}