{"pub": "yahoo", "url": "https://news.yahoo.com/fox-host-david-asman-fawns-180010577.html", "downloaded_at": "2019-10-03 10:52:36.172550+00:00", "published_at": "2019-10-02", "title": "Fox Host David Asman Fawns Over Trump for Attacking Wrong Paper for NYT’s Border Moat Story", "language": "en", "text": "Minutes after President Donald Trump unleashed a lengthy and vicious attack against the wrong newspaper for reporting on his desire for snake-filled moats and the ability to shoot migrants at the border, Fox Business Network host David Asman gushed over the president’s unhinged and false remarks.\n\nServing Wednesday as the “One Lucky Guy” on Fox’s daytime talk show Outnumbered, Asman immediately applauded Trump for railing against the media and Democrats while speaking to reporters at the White House.\n\n“I think that there is a phrase he will hear a lot of from the president,” Asman declared. “Who are you going to believe, you know that phrase, who are you going to believe? The fake media or me? Are you going to believe the Democrats, or are you going to believe me? Are you going to believe the rumor mill, the Beltway, or me in the transcripts?”\n\nAsman went on to say it is a good strategy for Trump to go after the Washington Post because they “have been caught several times with the news that did not turn out to be true.” During his White House remarks, the president blasted the Post for first reporting that he pressed aides and officials to place a moat at the border “stocked with snakes and alligators” and that he told his staff to order soldiers to shoot migrants in the legs.\n\n“That is the Trumpian way right now,” the Fox Business host said.\n\nThat story, however, first appeared in The New York Times, and is excerpted from an upcoming book by two of the paper’s reporters.\n\n“I think he feels he is winning,” Asman noted later.\n\nHe added: “The sense is that he feels like he is winning. He thinks he has a jump on the media, that he has a jump on the Democrats by releasing the information that he has to show discrepancies and so forth, that is just my sense here. We were talking about his speech at the U.N., which was very low-key, and then he gave a presser after that Wednesday, and he did seem to be down. I think that he has regained his energy somewhat.”\n\nAs for the president’s claim that the report is “fake news,” Fox News—along with several other outlets—confirmed key aspects of the Times story.\n\n“A source who was in the room at the time confirmed the conversation about shooting migrants in the legs to Fox News late Tuesday,” the network noted in its report.\n\nRead more at The Daily Beast.\n\nGot a tip? Send it to The Daily Beast here\n\nGet our top stories in your inbox every day. Sign up now!\n\nDaily Beast Membership: Beast Inside goes deeper on the stories that matter to you. Learn more.", "description": "Minutes after President Donald Trump unleashed a lengthy and vicious attack against the wrong newspaper for reporting on his desire for snake-filled moats and the ability to shoot migrants at the border, Fox Business Network host David Asman gushed over the president’s unhinged and false remarks.Serving", "authors": ["Justin Baragona"], "top_image": "https://s.yimg.com/uu/api/res/1.2/xYW4S7Y.8IHRJ7VBFUffbQ--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/0b5a5d6a3d6ccf908ef09fe66a211ef9"}