{"pub": "businessinsider", "url": "https://businessinsider.com/tropical-storm-humberto-bahamas-florida-forecast-updates-cyclone-9-2019-9", "downloaded_at": "2019-09-14 01:48:11.161865+00:00", "title": "Another storm is threatening to hit the Bahamas and Florida with tropical storm-force winds and heavy rain", "language": "en", "text": "Mere weeks after being pummeled by Hurricane Dorian, another tropical storm is headed for the Bahamas and the east coast of Florida.\n\nA storm warning has been issued for the northwestern Bahamas, and a storm watch is in effect in Florida for Jupiter Inlet to the Flagler Volusia County Line.\n\nA tropical storm warning means that storm conditions are expected within the area within 36 hours. A storm watch means the conditions will possibly arrive in the next 48 hours.\n\nThe \"disturbance\", currently called potential Tropical Cyclone 9, could produce 2 to 4 inches of rain in the Bahamas, with isolated isolated areas seeing up to 6 inches.\n\nThe southeast coast of the US from central Florida into South Carolina could see 2 to 4 inches of rain. Heavy rainfall or flash flooding is possible for the coastal areas of Florida, Georgia, and South Carolina this weekend. North Carolina could get some rain from the storm early next week, too, but the likelihood is diminishing, according to the NHC.\n\nA view of devastated houses after Hurricane Dorian hit the Abaco Islands in Spring City, Bahamas, on September 11, 2019. REUTERS/Marco Bello\n\nThe storm's maximum sustained winds were about 30 mph Friday evening, but expected to strengthen some overnight.\n\nSignificant storm surge is currently not expected in the Bahamas at this time.\n\nConditions are favorable for the disturbance to become a tropical depression or storm by Friday evening or Saturday morning, according to the NHC. In this case, the storm would be called Tropical Storm Humberto, according to CBS News.\n\nRead more: Hurricane categories tell only part of the story — here's the real damage tropical storms can do\n\nGov. Ron DeSantis tweeted a warning to Floridians to start preparations and prepare for heavy rainfall and potential flooding.\n\n\"We are closely monitoring a Tropical Depression with [the Florida Division of Emergency Management]. Regardless of the exact track or development, Floridians along the East Coast should be prepared for heavy rain and potential flooding, have supplies ready and follow local media for updates.\" he tweeted Friday afternoon.\n\nThe Bahamas and the southeastern US are just starting recovery after Dorian — a hurricane that killed at least 50 and left 1,300 people missing in the Bahamas earlier this month, with winds gusts as high as 220 mph and insurance losses of more than $25 billion.", "description": "A tropical cyclone is headed for the Bahamas and Florida, tracing a similar pattern that Hurricane Dorian just took.", "authors": ["Sara Kiley Watson"], "top_image": "https://amp.businessinsider.com/images/5d7c133ef4fc24285f0ad838-750-375.jpg", "published_at": "2019-09-13"}