{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2018/jul/1/us-really-did-have-manchurian-candidate-white-hous", "downloaded_at": "2019-09-23 00:13:02.990079+00:00", "title": "America really did have a Manchurian Candidate in the White House", "language": "en", "text": "ANALYSIS/OPINION:\n\nAfter returning from a tour of some of the war zones in the Middle East — which ended with the Free Iran Gathering 2018 in Paris — I am struck by the realization that America really did have a Manchurian Candidate in The White House for eight years. If you look at the evidence, there really is no other conclusion. The calamitous consequences of the Obama presidency will be felt for the foreseeable future.\n\nIn the short year and a half that President Trump has been in office, he has put in place policy that has mitigated the damage that President Obama inflicted on our national security and on our allies. The speed with which Trump has been able to turn things around points to the diabolical depths the Obama administration went to in order to undermine our national strength and way of life. All Trump had to do was stop doing things that hurt America; America could then take care of itself. The results are plain as day. However, it will take decades for the Obama damage to be completely undone. The deviousness of the Obama sedition runs deep.\n\nThink about it for a moment. If you wanted peace in the Middle East, why would you throw away the trillions of dollars spent, as well as the lives of thousands of American souls, by irresponsibly pulling out ALL American troops from Iraq? No matter your thoughts on starting the war, pulling out was an irresponsible thing to do. We still have troops in Germany, Korea and Japan, for God’s sake. Why? For stability, that’s why. As Colin Powell said, we broke it, now we own it. It was a given that instability would follow the force withdrawal. When you combine this act with the reality that Obama never really did try to defeat the Islamic State, what conclusion can you come up with? Trump defeated them in a few months. The conclusion is obvious: Obama really didn’t want to destroy them.\n\nWhy did Obama and Hillary take down Moammar Gadhafi, who had already given up his nuclear weapons? Was it to destabilize Libya, where ISIS could gain another foothold? Why did Obama help install the Muslim Brotherhood in Egypt? What was the agenda behind the so-called Arab Spring?\n\nHowever, the coup-de-grace of anti-American activity was the JCPOA, or, to say it another way, the agreement to give Iran everything it wanted, including nuclear weapons and money — lots of money — which it immediately used to further destabilize the region, and existentially threaten the only democracy in the Middle East, Israel. To take it a step further, why didn’t Obama support the opposition against the Mullahs in 2009 when there was an obvious chance for regime change in Iran? Why didn’t Obama confront Bashar Assad’s chemical weapons use? One of the main unanswered questions is what ties did Valerie Jarrett really have to the Iranian regime?\n\nI won’t go into why Obama ran up more debt for the United States than all previous presidents combined. I won’t ask why he weakened our armed forces. I won’t ask why he used tyrannical policies, like using the agencies of the federal government to go after his political opposition. I won’t ask why he politicized our security apparatus in an attempt to frame President Trump.\n\nWhat I will say is that there was a big fox in the hen house for eight long years. Eight long years for people like Brennan, Hillary, Kerry, Clapper, Comey and Jarrett to really hurt us regarding our safety and security.\n\nTrump has a lot of house cleaning to do. Thank goodness he’s being quick about it.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "After returning from a tour of some of the war zones in the Middle East -- which ended with the Free Iran Gathering 2018 in Paris -- I am struck by the realization that America really did have a Manchurian Candidate in The White House for eight years.", "authors": ["The Washington Times Http", "L. Todd Wood"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2018/07/01/AP_258997970703_c0-867-3408-2854_s1770x1032.jpg?7f98e24202bd66a01dc936cf894680387d0bb6b1", "published_at": "2018-07-01"}