{"pub": "yahoo", "url": "https://finance.yahoo.com/news/top-ranked-income-stocks-buy-112511719.html", "downloaded_at": "2019-09-10 07:45:25.660489+00:00", "title": "Top Ranked Income Stocks to Buy for September 9th", "language": "en", "text": "Here are four stocks with buy rank and strong income characteristics for investors to consider today, September 9th:\n\nThe Buckle, Inc. (BKE): This retailer of apparel, accessories and footwear has witnessed the Zacks Consensus Estimate for its current year earnings increasing 2.9% over the last 60 days.\n\nBuckle, Inc. (The) Price and Consensus\n\nBuckle, Inc. (The) Price and Consensus More\n\nBuckle, Inc. (The) price-consensus-chart | Buckle, Inc. (The) Quote\n\nThis Zacks Rank #1 (Strong Buy) company has a dividend yield of 5.02%, compared with the industry average of 0.00%. Its five-year average dividend yield is 3.95%.\n\nBuckle, Inc. (The) Dividend Yield (TTM)\n\nBuckle, Inc. (The) Dividend Yield (TTM) More\n\nBuckle, Inc. (The) dividend-yield-ttm | Buckle, Inc. (The) Quote\n\nBristol-Myers Squibb Company (BMY): This biopharmaceutical company has witnessed the Zacks Consensus Estimate for its current year earnings increasing 1.9% over the last 60 days.\n\nBristol-Myers Squibb Company Price and Consensus\n\nBristol-Myers Squibb Company Price and Consensus More\n\nBristol-Myers Squibb Company price-consensus-chart | Bristol-Myers Squibb Company Quote\n\nThis Zacks Rank #2 (Buy) company has a dividend yield of 3.40%, compared with the industry average of 2.84%. Its five-year average dividend yield is 2.67%.\n\nBristol-Myers Squibb Company Dividend Yield (TTM)\n\nBristol-Myers Squibb Company Dividend Yield (TTM) More\n\nBristol-Myers Squibb Company dividend-yield-ttm | Bristol-Myers Squibb Company Quote\n\nArbor Realty Trust, Inc. (ABR): This real estate investment trust and national direct lender has witnessed the Zacks Consensus Estimate for its current year earnings increasing 8.1% over the last 60 days.\n\nArbor Realty Trust Price and Consensus\n\nArbor Realty Trust Price and Consensus More\n\nArbor Realty Trust price-consensus-chart | Arbor Realty Trust Quote\n\nThis Zacks Rank #1 (Strong Buy) company has a dividend yield of 9.39%, compared with the industry average of 4.34%. Its five-year average dividend yield is 8.61%.\n\nArbor Realty Trust Dividend Yield (TTM)\n\nArbor Realty Trust Dividend Yield (TTM) More\n\nArbor Realty Trust dividend-yield-ttm | Arbor Realty Trust Quote\n\nThe AES Corporation (AES): This diversified power generation and utility company has witnessed the Zacks Consensus Estimate for its current year earnings increasing 0.8% over the last 60 days.\n\nThe AES Corporation Price and Consensus\n\nThe AES Corporation Price and Consensus More\n\nThe AES Corporation price-consensus-chart | The AES Corporation Quote\n\nThis Zacks Rank #2 (Buy) company has a dividend yield of 3.57%, compared with the industry average of 2.92%. Its five-year average dividend yield is 3.58%.\n\nThe AES Corporation Dividend Yield (TTM)\n\nThe AES Corporation Dividend Yield (TTM) More", "description": "Top Ranked Income Stocks to Buy for September 9th", "authors": ["Zacks Equity Research"], "top_image": "https://s.yimg.com/uu/api/res/1.2/n.UxVn6.FtRxg9WabgowfA--~B/aD00MDA7dz02MzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/9792182dd331d7c4372d7f2f2da5d94e", "published_at": "2019-09-09"}