{"pub": "cbs", "url": "https://cbsnews.com/news/court-hears-arguments-in-sheriff-joe-arpaios-bid-to-erase-conviction-pardoned-by-trump", "downloaded_at": "2019-10-23 14:56:36.970855+00:00", "title": "Court hears arguments in Sheriff Joe Arpaio's bid to erase conviction pardoned by Trump", "language": "en", "text": "An appeals court in San Francisco will hear arguments Wednesday in former Sheriff Joe Arpaio's bid to erase his contempt of court conviction from his record after he was pardoned by President Donald Trump.\n\nThe former six-term sheriff of metro Phoenix had appealed a lower-court ruling that refused to expunge his conviction for disobeying a 2011 court order barring his traffic patrols that targeted immigrants.\n\nThe judge who made the ruling explained pardons don't erase convictions or the facts of cases and that Arpaio's clemency only mooted his possible punishments.\n\nArpaio's lawyers had previously told the 9th U.S. Circuit Court of Appeals that the lawman was deprived of his opportunity to appeal his conviction because the pardon came before he was sentenced and final judgment was entered, so the conviction must be erased.\n\nSpecial prosecutor Christopher Caldwell argues Arpaio gave up his right to appeal the conviction when he accepted the August 2017 pardon — and that if the former sheriff wanted to challenge the conviction, he should have rejected the clemency and taken his chances in the appeals court.\n\nCaldwell, an attorney in private practice in Los Angeles who worked in the Justice Department in the 1980s, was appointed by the appeals court to defend the ruling over the pardon after the Justice Department refused to handle the appeal.\n\nLawyers for the Justice Department won the conviction against Arpaio, but once the pardon was issued, the agency sided with Arpaio in arguing that the conviction should be expunged because he was pardoned before the conviction became final.\n\nArpaio, who will not attend Wednesday's hearing, has acknowledged continuing his immigration patrols but insisted his disobedience wasn't intentional.\n\nHe was accused of prolonging his immigration patrols for 17 months to boost his successful 2012 re-election campaign.\n\nHis defiance of the court order is believed to have contributed to his 2016 election loss as Maricopa County's top law enforcer.\n\nThe 87-year-old lawman is now seeking the Republican nomination in the 2020 sheriff's race.\n\nHis first political comeback attempt ended with Arpaio placing third in the 2018 U.S. Senate primary.\n\nEven if the pardon hadn't been issued, the misdemeanor conviction wouldn't have prevented him from running for office again.", "description": "The former six-term sheriff appealed a lower-court ruling that refused to expunge his conviction​ for disobeying a 2011 court order barring his traffic patrols that targeted immigrants", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2017/04/05/3b797a5e-eca6-45f6-9c0a-11e1634dc4c9/thumbnail/1200x630g6/ad7b981b1fb55c4fe604688129b9dce3/ap-16221625791896.jpg", "published_at": "2019-10-23"}