{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/21/documentary-prince-andrew-took-part-jeffrey-epsteins-orgy-nine-underage-girls", "downloaded_at": "2019-10-22 13:34:06.740534+00:00", "title": "Film: Prince Andrew Joined Jeffrey Epstein’s Orgy with Underaged Girls", "language": "en", "text": "A documentary that aired in the United Kingdom on Monday includes claims that Prince Andrew and the now-dead sexual predator Jeffrey Epstein took part in an orgy with nine underage girls on Epstein’s private-island estate.\n\nThe New York Post reported on the latest Epstein-related scandal to hit the royal family:\n\nWhile the royal long dubbed “Randy Andy” has strenuously denied being involved in his friend’s sex ring, the salacious details already leaking from “The Prince and the Pedophile” have only intensified the spotlight on the friendship that Andrew has admitted was a “mistake and an error.” The special by Channel 4’s “Dispatches” is taking a deep dive into the pair’s close ties — including the claims in 2015 court papers that they had group sex on Epstein’s so-called “orgy island” of Little St James, according to the Times of London. “The third time I had sex with Andy was in an orgy on Epstein’s private island in the US Virgin Islands. I was around 18 at the time,” longtime accuser Virginia Roberts Giuffre wrote in the Florida court docs.\n\n“Epstein, Andy, approximately eight other young girls and I had sex together,” Giuffre said in the Post article. “The other girls all seemed and appeared to be under the age of 18 and didn’t really speak English.”\n\n“Epstein laughed about the fact they couldn’t really communicate, saying that they are the ‘easiest’ girls to get along with,” Giuffre said.\n\n“‘Dispatches’ will prove Andrew met Epstein at least 10 times during their 12-year friendship and the royal sometimes stayed with him for several days, according to the Times,” the Post reported.\n\nEpstein, who committed suicide last summer in a Manhattan jail cell, saw Prince Andrew as his most valuable “trophy” of the high-profile people he liked “collecting,” socialite Lady Victoria Hervey said in the documentary titled, “The Prince and the Pedophile.”\n\nThe Times is cited as the source in the Post report on “Dispatches” obtaining Giuffre’s medical records that confirm her abuse claims, including vaginal bleeding that lasted for weeks.\n\n“Without going into the details of the sexual activities I was forced to endure, there were times when I was physically abused to the point that I remember fearfully thinking that I didn’t know whether I was going to survive,” Giuffre wrote in a legal statement from 2015, according to the Times.\n\n“At no stage during the limited time I spent with him did I see, witness or suspect any behavior of the sort that subsequently led to his arrest and conviction,” Prince Andrew has said.\n\n“Buckingham Palace has also said that ‘any suggestion of impropriety with underage minors is categorically untrue,’” the Post reported.\n\nFollow Penny Starr on Twitter", "description": "A documentary aired in the UK on Monday includes claims that Prince Andrew took part in one of Jeffrey Epstein's orgies with underage girls.", "authors": ["Penny Starr"], "top_image": "https://media.breitbart.com/media/2019/08/GettyImages-1161385208-640x335.png", "published_at": "2019-10-21"}