{"pub": "yahoo", "url": "https://news.yahoo.com/ex-trump-lawyer-used-comic-131227150.html", "downloaded_at": "2019-10-12 09:24:15.652332+00:00", "title": "Ex-Trump lawyer used Comic Sans font in a impeachment inquiry letter. The internet had thoughts", "language": "en", "text": "Once you see it, you never forget it.\n\nComic Sans, the whimsical, chalkboard-like typeface that often appears in school projects and memes, has been divisive for years. And now, it's in the middle of the Trump impeachment inquiry.\n\nJohn Dowd, a former attorney for President Donald Trump, wrote that his clients who were asked to appear before House committees were given too little notice to appear. He also said they couldn't meet a Monday deadline for documents and communications because the men were also represented by Rudy Giuliani and the material might be protected by attorney-client privilege.\n\nThat letter – Dowd's formal response to the House Intelligence Committee on Oct. 3 – was written in Comic Sans.\n\n\"Your request for documents and communications is overly broad and unduly burdensome,\" Dowd typed in Comic Sans. \"The subject matter of your requests is well beyond the scope of your inquiry. This, in combination with requiring immediate responses, leads me to the inescapable conclusion that the Democratic Committee members’ intent is to harass, intimidate and embarrass my clients.\"\n\nHere's the letter (yes it's Comic Sans) indicating that Rudy Giuliani's associates will not be appearing or providing documents this week.\n\n\n\nAttorney John Dowd (Trump's former lawyer) argues the timeframe is too short and info could be attorney-client privileged. pic.twitter.com/3ytCecrPHv\n\n\n\n— Kyle Cheney (@kyledcheney) October 7, 2019\n\nDowd says clients won't meed demands: Two Rudy Giuliani associates who once dined with Trump and Trump Jr. enter fray of impeachment inquiry\n\nDowd's clients, Lev Parnas and Igor Fruman, are two Ukrainian-born business partners, who showered Republican campaign committees with nearly $500,000 and dined with Trump at the White House. They also helped Giuliani meet a key Ukrainian prosecutor as the president's personal lawyer sought to discredit Trump's political rival, former Vice President Joe Biden. Parnas and Fruman were arrested Wednesday on campaign finances charges, federal authorities said Thursday.\n\nStill, social media couldn't stop talking about the font choice, some even joking Dowd should be disbarred.\n\nIs this written in Comic Sans??? https://t.co/x7h6FHVIF5 — Zach Basu (@zacharybasu) October 7, 2019\n\nLadies and gentlemen, the presidents free lawyer uses comic sans. Maybe trump can get his money back? https://t.co/7dXPaZwBd6 — Molly Jong-Fast (@MollyJongFast) October 7, 2019\n\nIt's a little-known fact that a lawyer who emails the scan of a signed printout of a legal letter originally typed out in Comic Sans is automatically disbarred pursuant to Judiciary Law § 90(2) https://t.co/Rwakta4Gk3 — Letters of Note (@LettersOfNote) October 7, 2019\n\nThe Constitution is in Comic Sans now. — Dan Telfer (@dantelfer) October 8, 2019\n\nHating on Comic Sans is nothing new.\n\nThe font's creator, Vincent Connare, told The New York Times, \"If you love Comic Sans, you don't know much about typography. And if you hate Comic Sans, you need a new hobby.\"\n\nConnare told the newspaper he thinks Dowd was aware he was using the font and the effect it would have.\n\nIn an email to The Washington Post, written in Comic Sans, Dowd expressed disbelief.\n\n\"I am laughing,\" Dowd wrote to the newspaper. \"Folks don't have enough to do. I love the font. It is easy on the eye. In 30 years of use, NO ONE has ever questioned it even in the most serious matters.\"\n\nContributing: Bart Jansen. Follow USA TODAY's Ryan Miller on Twitter @RyanW_Miller\n\nThis article originally appeared on USA TODAY: Comic Sans: Lawyer John Dowd uses font replying to impeachment letter", "description": "Comic Sans, the whimsical, chalkboard-like typeface, has been divisive for years. And now, it's in the middle of the Trump impeachment inquiry.", "authors": ["Ryan W. Miller", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/hiBXrsLuRbLppQa34zuiRw--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/1009217/3d2d625d-7d0a-4a68-aa12-9a968876c97f/af4ce2e8-364a-5d58-87df-2fb43504adf0/data_3_0.jpg?s=45087324d9620cf837449b35465922d4&c=3b48a4cb932686165d9aa5cf205b83c2&a=tripleplay4us&mr=0", "published_at": "2019-10-10"}