{"pub": "wsj", "url": "https://barrons.com/articles/british-american-tobacco-rises-on-restructuring-plan-despite-u-s-vaping-ban-51568286772?mod=rsswn", "downloaded_at": "2019-09-12 11:37:25.524552+00:00", "title": "British American Tobacco Rises on Restructuring Plan Despite U.S. Vaping Ban", "language": "en", "text": "Text size\n\nBritish American Tobacco will cut 2,300 roles to invest savings in cigarette alternatives\n\nBritish American Tobacco ’s stock climbed on Thursday as the company announced plans to cut 2,300 jobs and invest more in cigarette alternatives.\n\nThe world’s second largest tobacco firm, behind Philip Morris International , said the savings would be invested in new categories, including vaping, heated tobacco and oral tobacco.\n\nJust hours before BAT’s restructuring plan was announced, the Trump administration revealed plans to ban flavored e-cigarettes following a number of vaping-related deaths.\n\nThe back story.\n\nThe world’s major tobacco companies have turned to cigarette alternatives in recent years to offset falling demand for traditional cigarettes.\n\nBritish American Tobacco, which makes Lucky Strike and Dunhill cigarettes, has fallen behind its rivals when it comes to e-cigarettes.\n\nIn June the company warned of steeper declines in cigarette sales after losing market share for the first time in years.\n\nLast month it reported a 27% rise in revenue to £531m for new products, including Vuse and Vype e-cigarettes in the first half of the year and pledged to ramp up investment.\n\nWhat’s new.\n\nBritish American Tobacco announced plans to cut 2,300 jobs in a bid to simplify the business and invest in alternatives to smoking.\n\nThe company said the savings would be reinvested to grow its portfolio of new categories, including vaping, heated tobacco and oral tobacco.\n\nThe changes, to be completed by January 2020, will focus on removing management layers, with more than 20% of the company’s senior employees being axed.\n\nBAT’s bold restructuring announcement was overshadowed by U.S. plans to ban flavored e-cigarettes following a number of vaping-related deaths.\n\nDespite the ramped up regulatory pressures, British American Tobacco’s stock climbed 1.6% in early trading.\n\nMoving forward.\n\nThe bold move by new chief executive Jack Bowles - less than six months into his CEO role - has been welcomed by investors.\n\nHowever, tighter regulation in the U.S. couldn’t have come at a worse time for the company.\n\nWhile the ban may extinguish the threat posed by U.S. e-cigarette maker Juul, it could see BAT’s growth plans go up in smoke.", "description": "British American Tobacco stock climbed on Thursday as the company announced plans to cut 2,300 jobs in a bid to shift towards cigarette alternatives.", "authors": ["Callum Keown"], "top_image": "https://asset.barrons.com/public/resources/images/ON-DF237_BATvap_SOC_20190912060717.jpg", "published_at": "2019-09-12"}