{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/5/nukes-the-latest-distraction-as-erdogan-clings-to-", "downloaded_at": "2019-09-06 12:12:06.431394+00:00", "title": "Nukes the latest distraction as Erdogan clings to power", "language": "en", "text": "ANALYSIS/OPINION:\n\nIstanbul — Dictators throughout history have played the same games in order to stay in power. One stratagem is as old as Rome itself, after the republic became corrupt and gave way to an empire run by one man, rather than the Senate.\n\nI’m speaking of the distraction of “bread and circuses,” keeping the masses entertained while those in power steal more and more and secure more and more control over their subjects’ lives.\n\nIn Turkey, the seat of the old Ottoman Empire, President Recep Tayyip Erdogan is doing just that, bribing the masses with grandiose infrastructure projects and war games on the Iraqi border, in a blatant attempt to retain the power he has amassed over the last decade by undermining the political opposition and defusing the threat from senior military officers.\n\nMy sense after a 10-day stay here is that Mr. Erdogan was able to appease the average Turk for a while by saying, “See — you have this new bridge and this new highway. What else could you want?” But with the economy weakening and the currency losing value, this new wannabe sultan may not be able to fall back on his economic accomplishments for long.\n\nSo what’s next? Why, nuclear weapons, of course!\n\n“Some countries have missiles with nuclear warheads, not one or two. But [they tell us] we can’t have them. This, I cannot accept,” the president told members of his ruling party, the AKP, in the eastern city of Sivas. “There is no developed nation in the world that doesn’t have them.”\n\nNo matter that Turkey signed the Nuclear Nonproliferation Treaty in 1980, and has also signed the 1996 Comprehensive Nuclear Test Ban Treaty.\n\nThe gambit is nothing more than a bit of bait-and-switch, an attempt to take the voter’s eye off his worsening economic problems while giving him a reason to beat his chest. Meanwhile, Mr. Erdogan will continue the same failed fiscal and political policies which have brought Turkey to its present straits.\n\nThere also seems to be a bit of jealousy involved regarding a certain rival to the south.\n\n“We have Israel nearby, as almost neighbors. They scare [other nations] by possessing these [weapons]. No one can touch them,” Mr. Erdogan was also quoted as saying.\n\nThere’s just one problem: Turkey lacks the financial resources and technical expertise for such an expensive and high-tech project.\n\n“The government-friendly media often exaggerates the strength of the military to increase morale in Turkey,” said Turkish expert Aykan Erdemir of the Washington-based think tank, the Foundation for Defense of Democracies, in 2017.\n\nThat may be changing.\n\nThe Islamist president has also signaled many times his desire to move Turkey away from the NATO alliance and toward Russia, and even Japan. The purchase of the Russian S-400 missile defense system in defiance of the Trump administration and the continuing bar to membership in the European Union are further signs of a split between Turkey and its Western allies that could have dramatic security ramifications for both Europe and the Middle East.\n\nThe Trump administration’s response to all of this seems to be a charm operation to build up Mr. Erdogan’s ego and hope for his eventual replacement, who could be more receptive to Western security interests.\n\nAfter my time here, it seems the average Turk on the street believes Mr. Erdogan’s time is limited. The only question is how long he can cling to power and how much damage he can do before he goes.\n\n• L. Todd Wood is a former special operations helicopter pilot and Wall Street debt trader, and has contributed to Fox Business, The Moscow Times, National Review, The New York Post and many other publications. He can be reached at, LToddWood.com.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Dictators throughout history have played the same games in order to stay in power. One stratagem is as old as Rome itself, after the republic became corrupt and gave way to an empire run by one man, rather than the Senate.", "authors": ["The Washington Times Http", "L. Todd Wood"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/05/turkey_migrants_38151_c0-93-2072-1301_s1770x1032.jpg?7554a8c2bb9b34c3ce3b088b13cd35e7c8dfa654", "published_at": "2019-09-05"}