{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7542279/Victoria-Beckham-axes-YouTube-channel-bringing-just-25-day.html", "downloaded_at": "2019-10-06 03:19:58.117645+00:00", "title": "Victoria Beckham axes YouTube channel because it was bringing in just £25 per day", "language": "en", "text": "Victoria Beckham has ditched the YouTube channel she launched to show off her enviable lifestyle after it brought in just £25 a day.\n\nThe Mail on Sunday can reveal that she has stopped releasing the fly-on-the-wall episodes, as the high cost of making them has led to five-figure losses.\n\nMrs Beckham, 45, tried to launch the channel as a major destination for fashion fans earlier this year, promising to ‘show the real me’ – including candid family scenes – as well as promoting her fashion range.\n\nVictoria Beckham has decided to ditch her YouTube channel which she launched as a major destination for fashion fans earlier this year. Here she is captured lining her lips and showing off her enviable lifestyle\n\nBut with a relatively modest 109,000 subscribers, she has struggled to make money from the channel – so has decided to concentrate on trying to turn around other parts of her ailing business instead.\n\nThe MoS can disclose that her flagship shop in London’s Mayfair is struggling, leaving staff fearful that more redundancies will be made. Last year she axed 60 staff, about a third of the workforce, following pressure from investors.\n\nHer team are anticipating ‘horrendous’ financial results this year too.\n\nDespite the luxury and aspirational content, the channel has a modest 109,000 subscribers\n\nShe has struggled to make money from the channel and a source says it has been 'impossible to monetise' and very time-consuming. Here she chats to her followers in a sleek ensemble\n\nA source close to the mother- of-four said: ‘The YouTube channel has been impossible to monetise, and it was very time-consuming so the decision was that it would be pulled.\n\n‘While Victoria enjoyed the filming and had lots of fun doing it, there were production costs that were not being covered by its income. The decision was made to concentrate everyone’s time and efforts on something that is going to benefit her business.’\n\nOn the channel she provided fans a glimpse, within a laboratory, of how Victoria Beckham beauty products are made. The former Spice Girl is making cuts as her flagship shop in London’s Mayfair is struggling, leaving staff fearful that more redundancies will be made\n\nIn one of her online programmes, the former Spice Girl showed off a messy hotel room and joked that it would give her husband David ‘a panic attack’. She has also shared make-up tips and promoted brands such as £120-a-bottle Don Julio tequila, saying she took it with her everywhere.\n\nThe final scenes for YouTube were filmed at her London Fashion Week show three weeks ago.\n\nVictoria gets up close and personal behind-the-scenes of her AW19 Fashion Show, revealing how she had to 'literally' give her bra to one of the girls\n\nThe latest financial results for Victoria Beckham Ltd are due to be published in the coming months, but those close to her fear that they will not be good.\n\nIn her last accounts, she posted an operating loss of £10.2 million in 2017, up from £8.2 million a year earlier.\n\nSince setting up the brand 11 years ago, the former Posh Spice has expanded her range from just dresses to shoes, bags and, most recently, make-up.\n\nA source close to Mrs Beckham last night said there was a plan to get the business into profitability.\n\nLast month, she launched an Andy Warhol exhibition at her shop, which she hoped would encourage footfall and sales.", "description": "Victoria Beckham's ditched her YouTube channel as the cost of making them has led to five-figure losses. It had a modest 109,000 subscribers and was 'impossible to monetise'.", "authors": ["Katie Hind Showbusiness Editor"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/01/19348218-0-image-a-28_1570322962819.jpg", "published_at": "2019-10-06"}