{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7616091/Jessica-Mauboy-reacts-new-record-Hilda-debuts-Number-One-ARIA-charts.html", "downloaded_at": "2019-10-26 08:46:00.500358+00:00", "title": "Jessica Mauboy reacts as her new record Hilda debuts at Number One on the ARIA charts", "language": "en", "text": "Jessica Mauboy has topped the Australian music charts with her new album, Hilda.\n\nThe 30-year-old debuted at the number one position on the ARIA charts this week - and it is the first time she has done so with an album of all new songs.\n\nSpeaking to The Daily Telegraph, Jessica said that reaching the top slot is 'a dream' for her.\n\n'It's always been the dream for this album': On Saturday, Jessica Mauboy (pictured) reacted happily as her new record Hilda debuts at Number One on the ARIA charts\n\n'It's always been the dream for this album to connect with people, and for Hilda to be at the top of the charts is so special to me,' she told the publication.\n\nShe said of her inspiration for the album: 'This record is a dedication to all the women in my family, to my grandmother and mother for being fierce and strong and how they have helped me to pursue this life and become a woman.'\n\nIt comes after Jessica revealed her family plans with fiancé Themeli Magripilis, saying she hasn't ruled out the idea of adopting children.\n\nWow! Jessica has topped the Australian music charts with her new album, Hilda. The 30-year-old debuted at the number one position on the ARIA charts this week - and it is the first time she has done so with an album of all new songs\n\nThe Little Things star told The Kyle and Jackie O Show that she wants a family 'in the future' but 'it's not something [she is] focused on.'\n\nWhen radio host Kyle Sandilands asked Jessica if she wanted to adopt instead of conceiving naturally, she responded by saying that she doesn't even know if she is able to have children.\n\n'Definitely, hands down,' Jessica said, when asked about adoption.\n\nSpeaking to The Daily Telegraph , Jessica said that reaching the top slot is 'a dream' for her. 'It's always been the dream for this album to connect with people, and for Hilda to be at the top of the charts is so special to me,' she told the publication\n\nFamily! It comes after Jessica revealed her family plans with fiancé Themeli Magripilis (left), saying she hasn't ruled out the idea of adopting children\n\n'I've had this [thought] before, I've had that moment of, 'Well, if I couldn't have children'... I don't know if I can even have children,' she added.\n\nJessica went on to say that she is still in a place of 'discovering things' about her body but had not had any 'close calls' with pregnancy in the past.\n\nTurning to the subject of her upcoming wedding, Jessica said she would 'like a smaller ceremony, just quiet and with my immediate family.'", "description": "Jessica Mauboy has topped the Australian music charts with her new album, Hilda.", "authors": ["Marta Jary For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/08/20209770-0-image-a-4_1572075849558.jpg", "published_at": "2019-10-26"}