{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7581145/Rugby-World-Cup-team-week-Japan-dominate-EIGHT-players.html", "downloaded_at": "2019-10-17 11:36:46.461211+00:00", "title": "Rugby World Cup team of the week: Japan dominate with EIGHT players", "language": "en", "text": "The final week of the Rugby World Cup pool stage was shorn of three matches owing to the destruciton caused by Typhoon Hagibis, but there was still plenty of drama on the pitch.\n\nEngland v France, New Zealand v Italy and Canada v Namibia were all called off but we witnessed the match of the tournament so far as hosts Japan saw off a Scotland comeback to finish top of their pool with four wins from four.\n\nJapan celebrate at the final whistle after beating Japan in the best match of week four\n\nElsewhere, Ireland returned to form with an emphatic win over Samoa despite being down to 14 men for most of the match, while Wales maintained their 100 per cent record with an untidy win over Uruguay.\n\nAustralia were also unconvincing in victory over Georgia and Tonga ended their tournament on a high, beating the United States.\n\nHere, Sportsmail picks its team of week four from the Rugby World Cup...\n\n15 William Tupou (Japan)\n\nFull-back Ayumu Goromaru was the hero of Japan's 2015 World Cup and Tupou is proving a worthy successor. Dangerous with the ball in hand and solid under the high ball, Tupou helped make one of Japan's four tries with a break.\n\nWilliam Tupou was a standout performer for Japan at full-back against Scotland\n\n14 Josh Adams (Wales)\n\nEmerging as Wales' premier wing, Adams was very unlucky not to make our team of week three after a hat-trick but gets in this week after taking his tally to five tries against Uruguay, making him joint-top try scorer with Kotaro Matsushima.\n\nJosh Adams is the World Cup's joint-leading try-scorer with five to his name so far\n\n13 Timothy Lafaele (Japan)\n\nShowed great vision and execution to grubber through for one of Japan's tries when no one was at home for Scotland. Elegant Samoan-born performer who has played all of his rugby in Japan after attending university there.\n\nTimothy Lafaele sets up a Kenki Fukuoka try with a clever grubber kick in behind Scotland\n\n12 Ryoto Nakamura (Japan)\n\nIf Lafaele provides the flair in midfield then Nakamura provides the ballast, not missing a single tackle or making a single handling error. They have formed a formidable partnership which should be a real test for Springboks duo Damian de Allende and Lukhanyo Am.\n\nRyoto Nakamura did not put a foot wrong for Japan alongside Lafaele in midfield\n\n11 Kenki Fukuoka (Japan)\n\nWhat a performance. Two inventive tries demonstrating his opportunism and blistering pace and one sublime break and offload to create a score for his opposite wing Matsushima. Undisputed man of the match.\n\nKenki Fukuoka produced an electric performance on the wing to earn man of the match\n\n10 Johnny Sexton (Ireland)\n\nLooks to be coming into form at just the right time after pulling the strings beautifully against Samoa, orchestrating a backline a man down and helping himself to two tries. Replaced on 50 minutes to keep him fresh for New Zealand.\n\nIreland will need Johnny Sexton to be at his very best if they are to beat New Zealand\n\n9 Conor Murray (Ireland)\n\nLinked superbly with Sexton, their partnership back in full swing in time for the knockout stages. Didn't kick as much as usual but his passing was crisp.\n\nConor Murray's partnership with Sexton has been key to Ireland's success over the years\n\n1 Scott Sio (Australia)\n\nThat Australia more than stood up to a proud scrummaging nation in Georgia shows how far they have come in that area. Loosehead Sio should prove a stern test for England alongside hooker Tolu Latu and tighthead Sekope Kepu.\n\nScott Sio is part of a much-improved Australia front row who will take on England next\n\n2 Shota Horie (Japan)\n\nBecoming one of the faces of the World Cup as his busy performances epitomise a tireless Japan side. Solid at the set-piece and dynamic in the loose.\n\nJapan hooker Shota Horie has been one of the stars of the World Cup so far\n\n3 Isileli Nakajima (Japan)\n\nIncredible to think he was only on the pitch for 24 minutes because his bleach-blond hair was everywhere as Japan repelled the Scottish comeback. Made the ninth-most metres of any Japanese player and chipped in with six tackles. Nakajima moved to Japan from Tonga as a teenager and has taken his wife's surname.\n\nIsileli Nakajima exploded into life off the bench for Japan in the closing stages v Scotland\n\n4 Luke Thompson (Japan)\n\nA second appearance for the 38-year-old in our team of the week. Thompson topped the Japanese tackle count with 16 and made second carries. Keeps out his second-row partner James Moore, who was also exceptional.\n\nLuke Thompson (left) defied his 38 years to top the tackle count for Japan in Yokohama\n\n5 Jonny Gray (Scotland)\n\nMade a monumental match-high 28 tackles, four more than any other player and 10 more than any Japanese player, not missing a single one. Smart offload for Zander Fagerson's try, the World Cup will be poorer without one of the best locks around.\n\nJonny Gray made an incredible 28 tackles without missing a single one\n\n6 Michael Leitch (Japan)\n\nAnother to be making his second appearance in our team of the week, the Japan captain made 12 tackles and led by example with a fearless display. Hard to think he couldn't make the starting XV against Ireland.\n\nMichael Leitch is back to his best after being left out of the Japan XV early in the tournament\n\n8 Aaron Wainwright (Wales)\n\nOne of only a few regulars to start against Uruguay and helped dig Wales out of a hole, despite playing out of position at No 8. Two from Wainwright, Josh Navidi and Ross Moriarty will join Justin Tipuric in the back row against France and the 22-year-old is making it very hard for Warren Gatland to leave him out.\n\nAaron Wainwright has emerged as a key man for Wales despite only just turning 22\n\n7 Jamie Ritchie (Scotland)\n\nLike Gray, Ritchie did not deserve to be on the losing team. Made 20 tackles and won a remarkable three turnovers, which could so easily have swung the result Scotland's way. Took the Japanese on single-handedly at times.", "description": "The final week of the Rugby World Cup pool stage was shorn of three matches owing to the destruciton caused by Typhoon Hagibis, but there was still plenty of drama on the pitch.", "authors": ["Joe Ridge For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/22/19808086-0-image-a-4_1571260457693.jpg", "published_at": "2019-10-17"}