{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7564973/Victorias-Secret-model-Kelly-Gale-stuns-flaunts-incredible-figure-racy-bikini.html", "downloaded_at": "2019-10-12 02:07:01.628388+00:00", "title": "Victoria's Secret model Kelly Gale stuns as she flaunts her incredible figure in a racy bikini", "language": "en", "text": "She's not shy in flaunting her incredible figure, being a Victoria's Secret model.\n\nAnd on Saturday, Swedish-Australian stunner Kelly Gale did what she does best and stripped off into a racy bikini.\n\nTaking to Instagram, the 24-year-old thrilled fans as she posed on set for a steamy mirror selfie, wearing a gold and glittering two piece.\n\nGolden girl! Victoria's Secret model Kelly Gale stunned on Saturday as she flaunted her incredible figure in a racy bikini while on set\n\nShowing off a deep golden tan, the brunette beauty put her washboard abs and ample assets on display.\n\nShe wore a robe on top of her bikini, which featured a clasp at the bust and a nude border, and had her long dark locks out and over her shoulders.\n\nHer look was completed with natural-looking makeup and a soft pink lip.\n\nKelly appeared to be on set, with a chair, a clothes rack and a heater behind her.\n\nIf you've got it! She's not shy in flaunting her incredible figure, being a Victoria's Secret model (pictured walking for the lingerie giant last year)\n\nShe joked in the Instagram caption: 'Shoutout to the heater in the back, I love you.'\n\nJust last month, Kelly thrilled fans when she posed on a balcony in Atlanta wearing a tangerine G-string bikini.\n\nSharing snaps online, she cheekily wrote: 'It was a bootyful (sic) sunset in Atlanta yesterday.'\n\nSun's out, bun's out! Just last month, Kelly thrilled fans when she posed on a balcony in Atlanta wearing a tangerine G-string bikin\n\nKelly is very much dedicated to health and fitness, and last year revealed her gruelling workout regimen ahead of the Victoria's Secret Fashion Show.\n\nShe told her followers that she was exercising non-stop for four hours at a time.\n\nLast year, she told Vogue that she works out six days a week to maintain her figure all year round, not just ahead of the coveted parade.", "description": "She's not shy in flaunting her incredible figure, being a Victoria's Secret model.", "authors": ["Chloe-Lee Longhetti For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/02/19614210-0-image-a-25_1570842320878.jpg", "published_at": "2019-10-12"}