{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/ap/article-7542589/James-Neal-Connor-McDavid-help-Oilers-outlast-Kings-6-5.html", "downloaded_at": "2019-10-06 05:31:39.392603+00:00", "title": "James Neal, Connor McDavid help Oilers outlast Kings 6-5", "language": "en", "text": "EDMONTON, Alberta (AP) - James Neal scored twice, Connor McDavid had a goal and three assists and the Edmonton Oilers won their second in a row to start the season, beating the Los Angeles Kings 6-5 in an offensive slugfest Saturday night.\n\nZack Kassian, Joakim Nygard and Darnell Nurse also scored for the Oilers. Dustin Brown, Trevor Lewis, Anze Kopitar, Michael Amadio and Drew Doughty countered for the Kings.\n\nEdmonton tied it 5 minutes into the third when Gaetan Haas banked a pass off the side of the net to Nygard for his first NHL goal.\n\nThe Kings surged back in front on a power play when Doughty's point shot ticked off an Oilers' skate and past goalie Mike Smith.\n\nThe Oilers tied it up once again on Nurse's goal, and capped the scoring on Neal's power-play goal with 6:32 to go.\n\nUP NEXT\n\nLos Angeles Kings goalie Jonathan Quick (32) looks on as Edmonton Oilers' Zack Kassian (44) and Connor McDavid (97) celebrate a goal during the second period of an NHL hockey game in Edmonton, Canada, Saturday, Oct. 5, 2019. (Jason Franson/The Canadian Press via AP)\n\nKings: At Calgary on Tuesday night.\n\nOilers: At New York Rangers on Tuesday night.\n\nLos Angeles Kings ' Blake Lizotte (46) and Edmonton Oilers' Matt Benning (83) battle for the puck during the first period of an NHL hockey game in Edmonton, Canada, Saturday, Oct. 5, 2019. (Jason Franson/The Canadian Press via AP)\n\nLos Angeles Kings' Tobias Bjornfot (33) chases Edmonton Oilers' Connor McDavid (97) during the second period of an NHL hockey game in Edmonton, Canada, Saturday, Oct. 5, 2019. (Jason Franson/The Canadian Press via AP)\n\nEdmonton Oilers celebrate a goal during the first period of an NHL hockey game against Los Angeles Kings, in Edmonton, Canada, Saturday, Oct. 5, 2019. (Jason Franson/The Canadian Press via AP)", "description": "EDMONTON, Alberta (AP) - James Neal scored twice, Connor McDavid had a goal and three assists and the Edmonton Oilers won their second in a row to start the...", "authors": ["Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/06/wire-19352268-1570338229-150_636x382.jpg", "published_at": "2019-10-06"}