{"pub": "news24", "url": "https://news24.com/World/News/israeli-president-to-meet-netanyahu-gantz-in-bid-to-break-deadlock-20190923", "downloaded_at": "2019-10-22 13:26:12.820252+00:00", "title": "Israeli president to meet Netanyahu, Gantz in bid to break deadlock", "language": "en", "text": "Israel's president will meet Prime Minister Benjamin Netanyahu and his main opponent Benny Gantz together on Monday as he pressures their two parties to form a unity government after last week's election.\n\nThe key meeting comes as the deadlocked vote results threaten Netanyahu's long tenure in office, but he has shown no sign of willingly giving up his post.\n\nPresident Reuven Rivlin announced in a statement he had invited the two to a meeting together in the evening as he considers whom to task with trying to form a government.\n\nRivlin made the announcement after he wrapped up consultations with political parties elected to parliament to hear their recommendations for who should form the next government.\n\nGantz's centrist Blue and White alliance finished with 33 seats out of 120 in the September 17 elections, while Netanyahu's right-wing Likud won 31.\n\nDespite Gantz's slim lead, neither has a clear path to a majority coalition.\n\nBoth Netanyahu and Gantz have also called for a unity government.\n\nGantz however says he should lead it since his party is the largest, and a compromise seems a long way off.\n\nThe standoff has even raised the possibility of yet another election - which would be the third in a year after April polls also ended inconclusively.\n\nRivlin has said he will do all he can to avoid another election, and Monday's meeting may see him seek to play a mediator role.\n\nNetanyahu on Monday reiterated his call for Gantz to join him in a unity government, again acknowledging he was unable to form the right-wing coalition he hoped for.\n\n\"The only government that can be formed in these conditions is a united and large one between us,\" Netanyahu said at a meeting of Likud lawmakers.\n\n\"The only way to reach it is to sit down and talk.\"\n\n'Stable' coalition wanted\n\nRivlin has said clearly he wants both Likud and Blue and White in a unity government to form a \"stable\" coalition, but how to reach such an accord remains unclear.\n\nThe end of the Netanyahu era would be an extraordinary moment in Israeli politics.\n\nHe has been prime minister for a record-breaking total of more than 13 years, but he also faces potential corruption charges in the weeks ahead, pending a hearing set for early October.\n\nThe meeting will follow a dramatic day on Sunday, when Israeli Arab parties broke with longstanding precedent and said they were endorsing Gantz for prime minister.\n\nIn announcing the move, the mainly Arab Joint List alliance said its decision was not meant as an endorsement of the policies of the ex-military chief, but as a way of helping oust Netanyahu.\n\nNetanyahu has repeatedly been accused of political rhetoric and actions amounting to racism toward Israel's Arab population.\n\nThe Joint List won 13 seats in the election, making it the third-largest force in parliament.\n\nRivlin is expected to designate a candidate to try to form a government on Wednesday, when final official election results are delivered to him.\n\nThat person would then have 28 days to do so, with a possible two-week extension.\n\nIf all attempts fail, Rivlin can then assign the task to someone else.\n\nIn Rivlin's consultations, Gantz received the endorsements of 54 parliament seats, while Netanyahu received 55.\n\nThose totals do not include ex-defence minister Avigdor Lieberman's nationalist Yisrael Beitenu party, which has endorsed neither candidate for now and could emerge as a kingmaker.\n\nIt also does not include three seats for one of the Arab parties that did not agree to endorse Gantz like the rest of the Joint List alliance.", "description": "Israel's president will meet Prime Minister Benjamin Netanyahu and his main opponent Benny Gantz together on Monday as he pressures their two parties to form a unity government after last week's election.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7817/8f0dac75d2b84aaf918420dffcff6373.jpg", "published_at": "2019-09-23"}