{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/10/22/impeachment-diary-words-that-could-end-presidency", "downloaded_at": "2019-10-23 08:49:11.039220+00:00", "title": "Impeachment Diary: The words that could end a presidency", "language": "en", "text": "But once inside, he delivered words that could end a presidency.\n\n“In August and September of this year, I became increasingly concerned that our relationship with Ukraine was being fundamentally undermined by an irregular informal channel of U.S. policy-making and by the withholding of vital security assistance for domestic political reasons,” Taylor testified, according to a copy of his remarks obtained by The Post. Taylor said President Trump himself made the release of military aid to Ukraine contingent on a public declaration by Ukraine’s president that the country would investigate Joe and Hunter Biden and the 2016 election.\n\nAD\n\nAD\n\nIn an instant, the impeachment inquiry no longer rested on the credibility or motives of a whistleblower, nor arguments about the meaning of quid pro quo. Here, spelling out Trump’s wrongdoing in extensive detail, was the diplomat Trump’s team brought out of retirement to be the ambassador to Ukraine — replacing the woman Trump ousted from that position at the request of Trump’s personal lawyer Rudy Giuliani. Taylor, an Army veteran and a respected diplomat who obviously kept detailed notes, will not be easy to discredit.\n\nTrump, more than anybody, must have known how damaging Taylor’s testimony would be. Ninety minutes before Taylor was slated to arrive, Trump created a diversion. He tweeted to his 66 million followers: “All Republicans must remember what they are witnessing here — a lynching.”\n\nIt was a grotesque provocation, clearly aimed at fomenting racial division — and it worked, for a bit. Reporters momentarily stopped asking about Taylor and started asking about lynching. Democrats reacted with outrage. And Trump’s boosters in the House defended him. “This,” Sen. Lindsey Graham (R-S.C.) concurred, “is a lynching in every sense.”\n\nAD\n\nAD\n\nBut ultimately no amount of distraction could counter what was happening in HVC-304, three floors beneath ground level in a secure room in the Capitol Visitor Center. As the day wore on, and reports of the deposition leaked out, there was a palpable change above ground.\n\nWhen Senate Republican leaders gave their weekly news conference after lunch, Fox News’s Chad Pergram observed that Republicans “criticize the process and don’t defend the president outright.” Pergram asked Senate Majority Leader Mitch McConnell (R-Ky.) directly: “Are you willing to defend the president in this matter?”\n\n“I’m willing to talk about the process,” McConnell replied.\n\nAD\n\nMcConnell also said Trump’s “lynching” claim “was an unfortunate choice of words.” Asked about Trump’s claim that McConnell told Trump the call with the Ukrainian president was “innocent,” McConnell contradicted Trump: “We’ve not had any conversations on that subject.”\n\nAD\n\nMcConnell isn’t yet where Republican Sen. Howard Baker was during Watergate when he asked: “What did the president know and when did he know it?” Republican support for Trump has not yet crumbled.\n\nBut now Trump’s handpicked ambassador, with specific and detailed allegations but no obvious anti-Trump motive, has blown up the many denials offered by the president. With growing evidence of Trump’s wrongdoing, and Trump’s aberrant behavior (“lynching”!) in response, Republicans continued to cling to the last plausible defense: Complaining about the “process.”\n\nAD\n\n“It’s an unfair process,” Rep. Mark Meadows (N.C.), a Trump loyalist, said as Taylor testified.\n\nRep. Jim Jordan (Ohio), another Trump defender, stood nearby and said how “unfair the process is.”\n\nTwo of the nine Republicans on the intelligence committee skipped Taylor’s early testimony, instead joining a news conference with GOP leaders to complain some more about the process.\n\nAD\n\n“Unfair and unprecedented process,” protested Rep. Elise Stefanik (N.Y.).\n\n“An unbelievable abuse of process,” Rep. Mike Turner (Ohio) added.\n\n“A mockery of the process,” contributed Minority Whip Steve Scalise (La.).\n\n“It’s not fair in the process,” chimed in Minority Leader Kevin McCarthy (Calif.).\n\nAD\n\n“They have concocted a process in secret,” GOP caucus leader Liz Cheney (Wyo.) lamented.\n\nCombined, the leaders complained about the “process” 31 times — but uttered the names “Taylor” and “Ukraine” not once.\n\nNow, Republicans object to the impeachment depositions being taken behind closed doors, even though Republicans did much the same in the past. But will they really be happier when proceedings become public? How can they defend a man publicly implicated by his own subordinates?\n\nYou might call it a work in “process.”\n\nAD", "description": "Republicans object to the impeachment depositions being taken behind closed doors. But will they really be happier when proceedings become public?", "authors": ["Dana Milbank", "Op-Ed Columnist Covering National Politics"], "top_image": "https://www.washingtonpost.com/resizer/u4PUsiaYPc5My0_suPZo7PJbQO4=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/C7DVY2URYNBE7GBRNT57BXOPAY.jpg", "published_at": "2019-10-22"}