{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-metals-lmeweek-rio-tinto/rio-tinto-says-miners-need-to-leverage-technology-as-scrutiny-of-the-industry-rises-idUKKBN1X70RQ", "downloaded_at": "2019-10-28 09:51:24.568864+00:00", "title": "Rio Tinto says miners need to leverage technology as scrutiny of the industry rises", "language": "en", "text": "LONDON (Reuters) - Mining companies should make more use of technology to respond to increasing demands from investors and communities for responsible mining practices, Rio Tinto (RIO.AX)(RIO.L) CEO Jean-Sébastien Jacques said on Monday.\n\nJean-Sebastien Jacques, CEO of Rio TInto Group stands for a portrait ahead of the publication of the company 2018 full year results in London, Britain, February 27, 2019. REUTERS/Toby Melville/Files\n\nTechnologies such as autonomous rail-cars and increased automation can lower the impact of the industry on the environment as well as raise profit margins, he said, adding that blockchain can be deployed to track if the supply chain met ethical standards.\n\n“There is absolutely no doubt in my mind we will face greater regulation and scrutiny,” Jacques said in a keynote speech marking the beginning of London Metal Exchange (LME) Week in London. “Society expects more of our industry which in turn brings with it a sea-change in shareholder expectations and more and more questions on our business model.”\n\nPressure from investors with an environmental, social and governance, or ESG, agenda has forced miners to focus on their climate and community credentials as part of efforts to repair an image tarnished by environmental disasters and overspending.\n\nRio makes aluminium and produces coal, both of which are high emitters of carbon. The company is collaborating with Apple (AAPL.O) and Alcoa (AA.N) to slash its carbon footprint by developing ways to make carbon-free aluminium.\n\n“The only way we can truly tackle climate change is through partnerships across the value chain,” said Jacques.\n\nRio has pledged substantial decarbonisation by 2050 while larger rival BHP (BHP.AX)(BHPB.L) said in July it would invest $400 million over five years to reduce emissions.\n\nRio is also looking into generating battery-grade lithium carbonate from waste rock in California and testing new approaches at its Winu copper project in Australia, he said.\n\nHe added that the approach to doing business in a more environmentally-friendly way needs to be “based on a pragmatic kind of sustainability. With profitability at its heart.”\n\n“Only a profitable business can provide sustainable benefits to shareholders, to communities, and governments.”\n\nIn August, Rio announced its highest margins in a decade and a record dividend payout, part of an industry-wide recovery from the commodities crash of 2015-16.\n\nThe LME, the world’s oldest and largest metals trading hub, has said it could ban metal tainted by child labour, money-laundering and corruption by 2023.", "description": "Mining companies should make more use of technology to respond to increasing demands from investors and communities for responsible mining practices, Rio Tinto CEO Jean-Sébastien Jacques said on Monday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191028&t=2&i=1445781191&w=1200&r=LYNXMPEF9R0J2", "published_at": "2019-10-28"}