{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7504321/Roma-0-2-Atalanta-Chris-Smalling-tastes-defeat-debut.html", "downloaded_at": "2019-10-05 07:30:45.631534+00:00", "title": "Roma 0-2 Atalanta: Chris Smalling tastes defeat on debut", "language": "en", "text": "Chris Smalling has tasted defeat on his Roma debut as Atalanta walked away with all three points at the Stadio Olimpico on Wednesday night.\n\nEdin Dzeko had the first real chance of the game after the Bosnian created space before firing a shot at goal but Pierluigi Gollini was on hand to make a superb stop.\n\nMinutes later, the visitors came close to scoring with a chance of their own but Josip Ilicic's half-volley flashed just wide of the near post with the score remaining goalless at the interval.\n\nMarten de Roon heads in a second goal for Atalanta to wrap up all three points on Wednesday\n\nDe Roon is congratulated by his team-mates as he doubles Atalanta's lead in the 90th minute\n\nDuvan Zapata (left) comes off the bench to rifle home the first goal for Atalanta\n\nThe Atalanta striker celebrates with his team-mates after breaking the deadlock\n\nChris Smalling got his loan spell at Roma off to a disappointing start as he tasted defeat\n\nMATCH FACTS ROMA: (4-2-3-1) Lopez; Spinazzola (Jesus 56), Smalling, Fazio (Kalinic 76), Kolarov; Cristante, Veretout; Zaniolo (Mkhitaryan 65), Pellegrini, Florenzi; Dzeko SUBS NOT USED: Fuzato (GK), Mirante (GK); Antonucci, Diawara, Kluviert, Pastore, Santon GOALS: None BOOKINGS: Zaniolo (40), Jesus (89) COACH: Paulo Fonseca ATALANTA: (3-4-1-2) Gollini; Toloi, Kjaer, Palomino; Hateboer, de Roon, Freuler, Castagne; Malinovsky (Gosens 79); Ilicic (Zapata 60), Gomez SUBS NOT USED: Rossi (GK), Sportiello (GK); Arana, Barrow, Djimsiti, Ibanez, Masiello, Pasalic GOALS: Zapata (71), de Roon (90) BOOKINGS: Kjaer (25) COACH: Gian Piero Gasperini REFEREE: Massimiliano Irrati VENUE: Stadio Olimpico\n\nNicolo Zaniolo had a glorious chance to break the deadlock in the second half but took too long to get his shot away after rounding the goalkeeper inside the area.\n\nAtalanta then squandered the best chance of the game when Jose Palomino put wide with a header but the centre-back's blushes were spared when Duvan Zapata rifled in the opener just moments later.\n\nRoma then had another brilliant opportunity to score denied after Nikola Kalinic's shot was superbly blocked in a last-ditch effort. Zapata was denied his brace with four minutes of normal time left when his shot struck the outside of the post.\n\nMarten de Roon then doubled the lead in the 90th minute to wrap up all three points as he headed in a second.\n\nNicolo Zaniolo skips past the challenge of Palomino before going on through to shoot at goal\n\nHowever, the promising Italian squandered the chance after he did well to round the keeper\n\nSmalling, who is on loan from Manchester United, tracks his man during the first half", "description": "Chris Smalling has tasted defeat on his Roma debut  as Atalanta walked away with all three points at the Stadio Olimpico on Wednesday night.", "authors": ["Sam Mcevoy For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/25/21/18933634-0-image-a-3_1569441602574.jpg", "published_at": "2019-09-25"}