{"pub": "cnn", "url": "https://cnn.com/2019/10/10/media/joe-biden-new-york-times-reliable-sources/index.html", "downloaded_at": "2019-10-10 06:16:10.878215+00:00", "title": "Biden campaign blasts New York Times coverage in letter to executive editor", "language": "en", "text": "New York (CNN Business) A version of this article first appeared in the \"Reliable Sources\" newsletter. You can sign up for free right here.\n\nIn a Wednesday evening letter addressed to Dean Baquet, the Biden campaign excoriated The New York Times for its recent coverage of Joe Biden, his son Hunter Biden, and Ukraine. The letter was written by deputy campaign manager and comms director Kate Bedingfield. She expressed extreme displeasure with how The Times has covered the debunked notion Biden abused his office to benefit his son.\n\nBedingfield wrote that The Times, which published a widely panned story in May by reporter Ken Vogel and then-freelancer Iuliia Mendel, \"had an outsized hand in the spread\" of the \"baseless conspiracy theory.\"\n\nIn Bedingfield's words, \"What was especially troubling about the Times's active participation in this smear campaign is that prior to its reporting on the subject by Ken Vogel, this conspiracy had been relegated to the likes of Breitbart, Russian propaganda, and another conspiracy theorist, regular Hannity guest John Solomon.\"\n\nInfuriated by publication of Schweizer op-ed\n\nThe letter came after The Times on Wednesday published an op-ed from Peter Schweizer, who the Biden campaign referred to as a \"discredited right-wing polemicist.\" Schweizer, an author, has been one of the top people pushing the claim that Biden abused his office. Previously, Schweizer pushed the debunked Hillary Clinton / Uranium One scandal, which was given life in a now-infamous 2015 story in The Times.\n\nIn Wednesday's op-ed Schweizer, whose representative did not immediately reply to a request for comment, conceded Hunter Biden's business dealings were legal, but suggested they shouldn't have been. The Biden campaign said in its letter that publishing the op-ed shows \"how little\" The Times \"has internalized the sobering lessons of 2016.\"\n\n\"Despite voluminous work done by the independent press and fact-checkers -- including some by The Times -- to refute the heinous conspiracy theory that Donald Trump attempted to bully Ukraine into propping-up for him, the paper ran an op-ed by none other than Peter Schweizer, making more malicious claims about the Biden family,\" Bedingfield wrote. \"This leaves us with a critical question: are you truly blind to what you got wrong in 2016, or are you deliberately continuing policies that distort reality for the sake of controversy and the clicks that accompany it?\"\n\nNYT: Our coverage \"has been fair and accurate\"\n\nIn a statement, a spokesperson for The Times pushed back strongly against the Biden campaign's letter. \"Our coverage of the Biden campaign and Hunter Biden has been fair and accurate,\" the spokesperson said, noting that the Biden campaign \"obviously disagrees.\" The spokesperson said The Times \"will continue to cover Joe Biden with the same tough and fair standards we apply to every candidate in the race and we're happy to sit down with Biden advisers anytime to discuss news coverage.\"\n\nIn response to the publishing of the Schweizer op-ed, the spokesperson noted it was published by Opinion \"where their mission is to invite intelligent discussion on a range of opinions and ideas.\" The spokesperson added, \"The op-ed makes an argument that nonpartisan government watchdogs would make, arguing in favor of a law that would prohibit self-dealing by those with government connections.\"\n\nBiden camp also sent letters to Facebook and Twitter\n\nThe Biden campaign on Wednesday also sent letters to both Facebook and Twitter, imploring the companies not to run an ad that spread the debunked theory about Biden and Ukraine. Twitter did not respond to a request for comment. Facebook denied the Biden campaign's request.\n\nIn a statement, Biden press secretary TJ Ducklo said the spread of false info \"poisons the public discourse.\" Ducklo added, \"Whether it originates from the Kremlin or Trump Tower, these lies and conspiracy theories threaten to undermine the integrity of our elections in America. It is unacceptable for any social media company to knowingly allow deliberately misleading material to corrupt its platform.\"\n\n>> On a related note: Remember last week when I wrote that MSNBC said the controversial Trump campaign ad was \"under review\"? I checked in with a spokesperson on Wednesday to see at what conclusion the network ultimately arrived. The MSNBC spokesperson told me that, days later, the Trump ad remains \"under review.\" Hopefully it doesn't take this long for MSNBC's standards department to review stories...\n\nBottom line\n\nThe Biden campaign is making it clear that it will call out tech and media platforms for the spread of misinformation related to Biden. As a campaign source told me, it's \"part of a larger strategy not to let the same coverage that corrupted the 2016 election happen this time around.\"", "description": "In a Wednesday evening letter addressed to Dean Baquet, the Biden campaign excoriated The New York Times for its recent coverage of Joe Biden, his son Hunter Biden, and Ukraine.", "authors": ["Oliver Darcy", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191009235409-joe-biden-campaign-1009-super-tease.jpg", "published_at": "2019-10-10"}