{"pub": "indiatimes", "url": "https://indiatimes.com/trending/human-interest/kolkata-couple-meet-each-other-for-the-first-time-marry-same-day-377612.html", "downloaded_at": "2019-10-11 12:50:17.535547+00:00", "title": "Kolkata Couple Who Met For The First Time During Durga Puja Get Married The Same Day", "language": "en", "text": "Kolkata Couple Who Met For The First Time During Durga Puja Get Married The Same Day\n\nKolkata Couple Who Met For The First Time During Durga Puja Get Married The Same Day\n\nFor Sudip Ghosal and Pritama Banerjee of Bengal, a visit to a puja pandal in Kolkata was life changing.\n\nThe two met on social media a couple of months ago and expressed feelings for each other but they had never met in person.\n\nAs fate would have it, they bumped into each other at a pandal and Sudip Ghosal didn't wait for anything before popping the question and the 'I do' came in instantly.\n\nSource\n\nAccording to TOI, the two met at Santosh Mitra Square puja pandal around 8 on Astami evening.\n\nSudip, a pharmaceutical executive, went down on his knees and proposed to Pritama even as hundreds of pandal hoppers cheered for them.\n\nDon't Miss 1.5 K SHARES 16.1 K SHARES 13.9 K SHARES 5.5 K SHARES 4.5 K SHARES\n\nOn Astami, when Sudip learnt Pritama was in Kolkata with her friends, he asked her to meet him. They never planned on the Pandal as the venue, it was all a beautiful coincidence.\n\n'After I proposed, we decided to return to Hind Motor. On the way, while we were talking, we decided to get married right away. All Pritama wanted was ‘sindoor’ on her forehead. I had no issues because I don’t really believe in rituals.'\n\nFacebook\n\n“I have deep faith in Devi (Goddess) Durga. So, getting married before her in a puja pandal without any ritual was enough for me. Now we are planning a social marriage,” HT quoted Pritama as saying.\n\nAfter getting married in the pandal, the couple are now planning a social wedding. Pritama has said that even though her parents are conservative, they have accepted the marriage.", "description": "For Sudip Ghosal and Pritama Banerjee of Bengal, a visit to the Puja Pandal in Kolkata was life changing. The two met on social media a couple of months ago and expressed feelings for each other but they had never met in person. As fate would have it, they bumped into each other at a Pandal and Sudip Ghosal didn't wait for anything before popping the question and the 'I do' came in instantly.", "authors": ["Kc Archana"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/kolkata_pandal_1570785936_800x420.jpg", "published_at": "2019-10-11"}