{"pub": "metro", "url": "https://metro.co.uk/2019/10/19/who-won-the-circle-last-night-10945863", "downloaded_at": "2019-10-19 11:21:13.683298+00:00", "title": "Who won The Circle last night?", "language": "en", "text": "Bubbly time for Paddy Smyth (left) and Tim Wilson (right), the winners of The Circle’s lucrative prizes (picture: Peter Powell/PA Wire)\n\nIn a dramatic finale to hit Channel 4 show The Circle last night, the five finalists finally met each other at the end of the 40-episode series.\n\nTim, Woody, Georgina, Sammie and Paddy ranked each other in order of their favourites after almost a month of drama, with Paddy finishing the winner.\n\nThe 31-year-old sales account manager from Dublin, who joined The Circle as a late arrival earlier this month, was overwhelmed by his victory.\n\nHe had joined the show in the hope of being able to bond with his other contestants and raise awareness of issues around disability, having suffered from cerebral palsy in his legs because his mother had womb cancer while pregnant with him.\n\nWoody, who revealed to his fellow contestants that he is Norman Cook and Zoe Ball’s son, finished fifth, with Tim and catfish Sammie sharing third, behind Georgina in second.\n\nAdvertisement\n\nAdvertisement\n\nWho won the People’s Champion vote on The Circle 2019?\n\nTim won an extra £30,000 after the professor and former monk won a public vote to decide the bonus prize.\n\nHost Emma Willis ramped up the tension as the show, in which the holed-up participants communicate only via a social media platform, learned their fate.\n\nWith the exception of Paddy, the finalists had spent the entire series in different rooms of the same apartment block.\n\nIrishman Paddy wore a pink suit when he was crowned the winner and confessed he had not expected to be in the complex for a prolonged period.\n\nThe latecomer admitted: ‘I’m in complete shock. To come in as a late player, with such insecurities about myself, and to know that The Circle and you guys accepted me is just insane.\n\n‘I didn’t think I’d even get here.’\n\nMORE: The Circle fans fume as Paddy Smyth wins show over favourites Tim and Woody\n\nMORE: The Circle’s Sammie finally revealed as catfish James in tense meet-up and Tim is shook\n\nMORE: The Circle’s Emma Willis mistakes show for Big Brother in hilarious slip-up", "description": "Want to know who won The Circle 2019 on Channel 4? Read on to discover the fate of finalists Tim, Woody, Georgina, Sammie and Paddy.", "authors": ["Ben Miller"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_90544268_1571474960.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-19"}