{"pub": "politico", "url": "https://politico.eu/article/boris-johnson-loses-control-brexit", "downloaded_at": "2019-09-04 03:46:29.934901+00:00", "title": "Boris Johnson loses control", "language": "en", "published_at": "2019-09-03", "text": "Boris Johnson loses control More than 20 of the British prime minister’s own MPs voted against him in a bid to prevent a no-deal Brexit.\n\nLONDON — Boris Johnson is still in power, but not in control.\n\nFacing his first House of Commons vote on the first day of the new parliamentary term, Johnson fell to a heavy defeat, as 21 of his own Conservative MPs joined forces with opposition parties to back the first stage of legislation that will delay Brexit — again — from its current date of October 31, if no deal with the EU is in sight.\n\nLike his predecessor Theresa May, Johnson faced a hostile parliament with a slim majority. Unlike her, he gambled the unity of his party in order to push Brexit through and paid a heavy price. While he remains in office, still determined, he says, to secure a better deal and take the U.K. out of the European Union by the end of October, his authority is shattered.\n\nHardline tactics, including a threat to kick rebels out of the Tory party, barring them from standing for the Conservatives in the next election, failed to deliver the numbers for Johnson, as he lost by 328 to 301 votes in a late-night sitting in the House of Commons.\n\nInstead he now finds himself at the command of a minority government 22 MPs short of a majority, having effectively sacked some of his own most eminent MPs.\n\nJohnson, determined to take the U.K. out of the EU with or without a deal on October 31, will now roll the dice on a snap general election aimed at changing the parliamentary arithmetic and gaining authority in the House of Commons — something many believe he has wanted all along.\n\nBut in an unforeseen complication, opposition parties indicated they would not vote for an election to take place until their proposed legal change — aimed at stopping a no-deal Brexit — has completed its fast-track journey to becoming law. Without their support and assuming the MPs' plan clears the House of Lords, Johnson could find himself stranded, forced to ask Brussels for a Brexit delay he repeatedly said he would never seek and unable to use a snap election to override his opponents.\n\nThis could happen within days, but — with Johnson having controversially suspended parliament from sitting from next week until mid-October — the clock is ticking and the road ahead more uncertain than ever.\n\n\"I don’t want an election. The public don’t want an election. But if the House votes for this bill tomorrow, the public will have to choose who goes to Brussels on October 17 to sort this out and take this country forward,\" Johnson told MPs after the vote, referring to next month’s crucial European Council summit.\n\nLabour opposition leader Jeremy Corbyn hailed the vote as a victory for the House of Commons over what opposition MPs consider to be a government determined to ride roughshod over parliamentary democracy in order to deliver Brexit.\n\n\"We do not have a presidency but a prime minister,\" Corbyn said. \"Prime ministers govern with the consent of the House of Commons representing the people in whom the sovereignty rests. There is no consent in this House to leave the EU without a deal.\"\n\nAnother MP put it more succinctly as the result of the vote was read out: \"You've got a good start Boris.\"\n\n'What has happened to the Conservative Party?'\n\nIn a meeting with Conservative rebels on Tuesday morning, the prime minister had told MPs that to delay Brexit again would represent an \"extinction-level event\" for all politicians, according to one Downing Street official present.\n\nJohnson said faith in democracy was at stake. His ruthless approach to the Conservative rebels — who included parliament's most experienced MP Ken Clarke, seven other former Cabinet ministers including former Chancellor Philip Hammond, and Winston Churchill's grandson Nicholas Soames — suggest a prime minister who has taken the view that delivering on the 2016 referendum result is more important than any party, including his own.\n\nTobias Ellwood, a former minister who has spoken out against no deal but stopped short of voting against the government, said: \"It is a sad day indeed when the grandson of Churchill is threatened with deselection. We shouldn’t lose sight of the party we used to be — an open, center-right, one nation, progressive party.\"\n\nOne parliamentary official working with the group of MPs who had the whip removed asked simply: \"What has happened to the Conservative Party?\"\n\nOne senior minister defended the decision to kick so many MPs out, but hinted the decision might not be final.\n\n“There is always a road to redemption. These things are at the choice of the prime minister in consultation with the chief whip,\" the minister said after the vote. \"There is always a road to redemption, but the point being is we have slipped into some weird habits. If you vote to take authority away from the Conservative government that is a de-facto vote of no confidence in your government.”\n\nThe debate in the House of Commons, presided over by the Leader of the House of Commons Jacob Rees-Mogg, played out as a battle between those who believed parliament had a solemn duty to intervene to prevent a no-deal Brexit and those who believed parliament had a solemn duty to ensure Brexit took place without further delay.\n\nBoth invoked the will of the people and cast themselves as their protecters.\n\n“We stand as a nation ... at a moment which will have a profound effect on the welfare of our people and the sovereign parliament of this country clearly deserves an opportunity to be able to decide whether it will accept a policy of no-deal exit or not,\" said Oliver Letwin, the former Cameron-era Cabinet fixer who was one of the chief architects of the MPs' anti-no-deal bill.\n\nRees-Mogg, in an uncharacteristically heated response, accused Letwin of \"stunning arrogance\" and of an \"unconstitutional\" flouting of House of Commons rules.\n\n“Sovereignty in this House comes from the British people and the idea that we can overrule 17.4 million people [who voted for Brexit in 2016] is preposterous,\" he said. \"The idea that our rules do not exist to protect the people from arrogant power grabs is mistaken.\"\n\nThe House of Commons' grandstanding speaker, John Bercow, who has himself been accused by Rees-Mogg of undermining the impartiality of his office, defended his decision to allow MPs to set the agenda Tuesday — something normally controlled by the government — in simple terms.\n\n“My attitude is simply to seek to facilitate the House … I have done it, I am doing it and I will do it to the best of my ability without fear or favor, to coin a phrase, come what may, do or die,\" he said, the latter term borrowed from Boris Johnson.\n\nWhat next?\n\nMPs will return on Wednesday to continue the debate on the plan to force a delay to Brexit until January 31, 2020 if no deal is in sight by October 19, after next month's European Council summit.\n\nTuesday night's preliminary vote makes the bill's success in the House of Commons highly likely, and in response to the vote Johnson put forward a motion calling for an early election on an unspecified date.\n\nUnder U.K. law, this must be backed by two-thirds of MPs to take place, but opposition parties refused to commit to voting for it without a watertight guarantee that Johnson will be unable to set a date for polling day after Brexit has already taken place. Downing Street insists any vote would happen before the European Council, which takes place on October 17 and 18.\n\nCorbyn has repeatedly called for an election, but now fears that without legislation in place to postpone the Brexit date, the prime minister could promise one polling date but then ask the queen for another. Shadow Foreign Secretary Emily Thornberry declared in an interview with ITV that Labour would not be voting for the motion Wednesday and would wait for the bill to be passed.\n\n\"There won’t be a general election [called] tomorrow, because we're not going to vote for it, because we have to make sure this legislation has been embedded [and] signed off by the queen,\" Thornberry said. \"We want a general election but we want to get this legislation done first.\"\n\nBefore it can become law, the no-deal blocking legislation must also pass through parliament's second chamber, the House of Lords, a process expected to take place on Thursday and Friday, with late-night sittings if necessary. While there is a large majority against a no-deal Brexit in the Lords, the government is reportedly considering filibuster tactics to delay the bill’s passage.\n\nThe government, though, now wants its election — even if it's still insisting Johnson has had it forced upon him.\n\nSpeaking ahead of last night's vote, a No. 10 spokesman said: “The prime minister has been very clear that should MPs tonight vote to trash the U.K.’s negotiating position, hand power over to the opposition, then the next logical step for the prime minister — which he doesn’t want — would be via the Fixed Term Parliaments Act [to call] for an election and then the British public will decide who goes to Brussels to make that decision.\"\n\nAnother senior official summed up the plan succinctly: \"Election. Get Corbyn out of the way. Leave [the EU.]\"", "description": "More than 20 of the British prime minister’s own MPs voted against him in a bid to prevent a no-deal Brexit.", "authors": ["Charlie Cooper", "Annabelle Dickson", "Emilio Casalicchio"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/09/GettyImages-1156174479-1-1200x628.jpg"}