{"pub": "yahoo", "url": "https://finance.yahoo.com/news/capital-flight-killing-us-shale-210000178.html", "downloaded_at": "2019-10-07 04:41:53.039153+00:00", "title": "Capital Flight Is Killing The US Shale Boom", "language": "en", "text": "The growth in U.S. shale production is grinding to a halt as low prices put drillers in a financial vice.\n\nThe slowdown has been unfolding for much of 2019, but the latest slide in oil prices is another blow to cash-strapped companies. Share prices for many E&Ps are down sharply. For instance, Devon Energy’s stock is down 20 percent since mid-September; EOG Resources is off by 17 percent and Pioneer Natural Resources is down by more than 13 percent. Many other companies have seen similar declines.\n\nRig counts have fallen by 20 percent since last year, drilling is down, hotel rates are down, and employment is in decline. “If you can’t wring out any costs savings then you’ve got to buy less stuff if you want to get your costs down, and that’s the phase we’re entering into,” Jesse Thompson, senior business economist at the Houston branch of the Federal Reserve Bank of Dallas, told Bloomberg.\n\nAs Bloomberg noted, annualized employment grew only 0.7 percent through August, compared to 11.4 percent for the same period in 2018. The unemployment rate has ticked up from 2 to 2.3 percent. The number of fracking crews has fallen to its lowest level in 30 months.\n\nFor embattled shale drillers, there is another imminent hurdle that they must clear. For the first time since 2016, Permian shale drillers could see their access to borrowing slashed. Lenders periodically reassess the borrowing base that they offer to oil and gas producers, a so-called “credit redetermination” period.\n\nRelated: Oil Prices Tank On Global Recession Fears\n\nAccording to a survey of financial institutions as well as oil and gas firms by law firm Haynes and Boone, the industry is set to see “a decrease in credit availability for producers and a strong interest in alternative sources of capital.”\n\nIn other words, lenders are turning off the spigots.\n\nInterestingly, when respondents were asked when equity markets might reopen for upstream oil and gas companies, only 25 percent said 2020, while 47 percent said 2021. A further 14 percent said 2022 and 13 percent said sometime after 2022. That suggests that the vast majority of industry and financial players see several years of restricted access to credit for the shale industry.\n\nWithout capital, shale drillers have to take an axe to their spending budgets, which means less drilling and ultimately lower-than-expected U.S. oil production. It also means that bankruptcies are likely to continue to pile up. Through the end of September, there have been 199 oil and gas bankruptcies in North America since 2015, according to Haynes and Boone, and the number of companies folding this year is at the highest since 2016.\n\n“I think that you’re going to have a big problem when it comes to that redetermination,” Mark Rossano, founder and CEO of C6 Capital Holdings, said on Bloomberg TV. He added that the oil majors can “weather” the storm, but the smaller drillers are going to have a tough time. “The market has told them, ‘don’t come to us for money, because it’s not gonna be there.’”\n\nRelated: What Would Greta Thunberg's Dream World Look Like?\n\nIn just the past week, there were signs of trouble at the company level. Small shale driller Abraxas Petroleum announced that it would suspend drilling operations in the Delaware basin.\n\nAlso, American Energy-Permian Basin LLC managed to convince its creditors to restructure $2 billion worth of debt that the company could not pay. The company, backed by private equity and originally founded by the late Aubrey McClendon in 2014, has been struggling financially for a long time. Having already missed an interest payment in May, American Energy told creditors that if they did not agree to a restructuring, the company would file for bankruptcy. This is actually the second time that American energy restructured its debt – the first time was in 2016.\n\nWith WTI in the low-$50s, some companies are hovering right around their breakeven levels, or are in negative territory. Even those with lower breakeven prices will feel the effects. Because of the rapid decline in output from shale wells, drillers need to pump capital into the ground on a constant basis, so the fact that investors are souring on the sector is a problem.\n\nWith Wall Street cutting off struggling drillers, and oil prices languishing in the low-$50s, the U.S. shale industry is already slowing down and might even be heading for a contraction.\n\nBy Nick Cunningham of Oilprice.com\n\nMore Top Reads From Oilprice.com:\n\nRead this article on OilPrice.com", "description": "As if the recent drop in oil prices wasn’t bad enough, shale drillers are now facing the negative impact of credit re-determinations", "authors": ["Nick Cunningham"], "top_image": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "published_at": "2019-10-06"}