{"pub": "yahoo", "url": "https://yahoo.com/gma/sen-amy-klobuchar-says-she-still-opposes-kavanaugh-132004467--abc-news-topstories.html", "downloaded_at": "2019-09-15 14:27:53.733577+00:00", "title": "Sen. Amy Klobuchar says she still opposes Kavanaugh", "language": "en", "text": "Sen. Amy Klobuchar says she still opposes Kavanaugh originally appeared on abcnews.go.com\n\nSen. Amy Klobuchar, D-Minn., said she still opposes Brett Kavanaugh's confirmation to the Supreme Court and recent reporting by the New York Times raises questions about the vetting process.\n\nThe reporting by the newspaper indicates there was a lack of an FBI investigation into the sexual assault allegations against the Supreme Court justice when he was a nominee.\n\nABC News Chief Anchor George Stephanopoulos asked Klobuchar on \"This Week\" Sunday if she thinks the latest updates on the Brett Kavanaugh assault allegations are grounds for impeachment of the now-Supreme Court Justice, Klobuchar said she has opposed his confirmation since September 2018 when she was praised for having one of her most poignant moments from her service on the Senate Judiciary Committee.\n\n\"I strongly oppose him, based on his views on the executive power which will continue to haunt our country, as well as how he behaved, including the allegations that we are hearing more about today,\" Klobuchar said. \"My concern here is that the process was a sham.\"\n\nShe went on to say she believes the Department of Justice should be investigated by Congress for shielding of relevant documents by Attorney General William Barr.\n\n\"I don't think you can look at impeachment hearings without getting the documents, the House would have to get the documents, and the attorney general is shielding documents,\" Klobuchar said before adding that in order for any of this to happen, the country needs new leadership. \"You need a new president, you need a new attorney general that respects the law.\"\n\n(MORE: 3rd Democratic debate: Candidates clashed on health care, immigration and more)\n\nOn her Thursday night ABC News Democratic debate performance and the current divide between moderate and progressives in the race, Klobuchar repeated her lines that she thinks it’s a \"bad idea\" to pursue proposals like \"Medicare for All\" which eliminates private health care options.\n\n\"I don't think that's what people want. I don't think it's a bold idea, I think it's a bad idea,\" Klobuchar said.\n\nShe added that if voters do want to see \"149 million off of their insurance\" in four years, \"well, then I'm not your candidate because I don't think you should be throwing people off their current insurance in four years.\"\n\n(MORE: Amy Klobuchar, Pete Buttigieg end up on same flight to 3rd Democratic debate)\n\nAnother topic Klobuchar has struck a middle-of-the-road approach: gun control. During Thursday night’s debate, the Minnesota senator said that while she supports a ban on assault-style weapons, she does not support a mandatory buyback program, such as the one former Democratic Texas Congressman Beto O’Rourke has been pushing for since the mass shooting in his hometown of El Paso, Texas. Instead, Klobuchar called for a \"voluntary buyback program\" on Thursday night.\n\nAsked by Stephanopoulos on \"This Week\" if she thinks the proposals being floated around would hurt the Democratic Party’s chances of winning the general election, Klobuchar said policies like this would best be approached in Congress.\n\n\"I want to make clear, I want to see an assault weapon ban,\" Klobuchar said on Sunday. \"I think the smartest thing to do is, one, right now push Mitch McConnell to allow for votes on universal background checks and my bill to not allow domestic abusers to get guns. Then when I’m president, I will get that assault weapon ban passed as well as a limit on magazines.\"\n\n(MORE: Amy Klobuchar: Everything you need to know about the 2020 presidential candidate)\n\nIn terms of her campaign moving forward and her breakout strategy going into the busy Fall season, Klobuchar noted that while it’s important for her to win the presidency, she also think it’s important to win seats in the Senate and stick to her moderate approach.\n\n\"We don't just need to win the presidency, we also have to win the Senate, and that means winning in states like Colorado and Arizona and Alabama and how important that is to get things done,\" Klobuchar said. \"My argument is I’m from the middle of the country, I was one of only three women up on that stage, and also I’m someone that has a history of getting things done and bringing people together, which is what we need in this country.\"", "description": "Sen. Amy Klobuchar, D-Minn., said she still opposes Brett Kavanaugh's confirmation to the Supreme Court and recent reporting by the New York Times raises questions about the vetting process.  The reporting by the newspaper indicates there was a lack of an FBI investigation into the sexual assault", "authors": ["Lissette Rodriguez"], "top_image": "https://s.yimg.com/uu/api/res/1.2/RGJvRpwx9s_IQ0kFvNvz8Q--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.gma.com/amy-klobuchar-ss-jt-190914_hpMain_16x9_992.jpg", "published_at": "2019-09-15"}