{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/afp/article-7578793/Parents-UK-crash-victim-meet-Trump-White-House.html", "downloaded_at": "2019-10-16 08:31:06.115470+00:00", "title": "Parents of UK crash victim meet Trump at White House", "language": "en", "text": "Charlotte Charles and Tim Dunn (pictured in London) said Trump seemed sympathetic in their surprise meeting at the White House\n\nThe parents of a British teen killed in a road crash involving an American diplomat's wife met with President Donald Trump at the White House Tuesday to urge that she be returned to Britain to face justice.\n\nTrump met with Tim Dunn and Charlotte Charles and dropped a \"bombshell\" that the woman at the wheel, Anne Sacoolas, was in the building and willing to meet them.\n\nThe couple said they refused.\n\n\"We made it very clear that, as we've said all along, we will meet with her... and we would still love to meet with her, but it has to be on our terms and on UK soil,\" Charles told reporters after the meeting, which lasted about 15 minutes.\n\n\"She needs to come back and face the justice system,\" she said.\n\nHarry Dunn, aged 19, died on August 27 in a head-on collision between his motorcycle and a car being driven on the wrong side of the road in Northamptonshire in central England.\n\nSacoolas was interviewed by police but flew back to the United States after claiming diplomatic immunity.\n\nShe has not been charged with criminal wrongdoing, but her claim of immunity and return to the US have provoked an uproar in Britain.\n\nIn his surprise meeting with Dunn's parents, Trump indicated Sacoolas would not be returning to Britain but was sympathetic.\n\n\"When we first got there, he extended his condolences to us, which did feel sincere. I don't suppose we would have expected anything else. Many of his staff also did the same,\" Charles said.\n\nTrump \"was quite respondent\", she said.\n\nAt end of their meeting \"I asked him again, I said, 'If it was your 19-year-old son, or your son no matter what age, you would be doing the same as me.' And he was holding my hand at the time and he said, 'Yes, I would' and he said 'Maybe we'll try and push this from a different angle',\" Charles said.\n\nDunn said the president \"was very gracious and spoke very well to us\".\n\n\"He was understanding and I think he genuinely will look to try to resolve this in a way to help us,\" he said.\n\nPrime Minister Johnson has said Sacoolas should return to Britain, saying: \"I do not think that it can be right to use the process of diplomatic immunity for this type of purpose.\"\n\nBut a Washington Post photograph of briefing notes held by Trump in an October 9 news event indicated that \"the spouse of the US Government employee will not return to the United Kingdom.\"\n\n\"We still want justice for Harry and we will take it as far as we possibly can to ensure that's done,\" Charles said.", "description": "The parents of a British teen killed in a road crash involving an American diplomat's wife met with President Donald Trump at the White House Tuesday to urge...", "authors": [], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/09/wire-19777424-1571213570-304_636x382.jpg", "published_at": "2019-10-16"}