{"pub": "dailymail", "url": "https://dailymail.co.uk/debate/article-7566535/Australian-election-king-Sir-Lynton-Crosby-loses-running-Johnsons-General-Election-campaign.html", "downloaded_at": "2019-10-13 00:33:44.958163+00:00", "title": "Australian election king Sir Lynton Crosby loses out on running Johnson's General Election campaign", "language": "en", "text": "Australian election king Sir Lynton Crosby and his sidekick Mark Fullbrook may have masterminded Boris Johnson’s successful bids for City Hall and helped to put him in No 10, but I hear they will not be running his General Election campaign.\n\nThe architect of David Cameron’s unexpected 2015 majority, Crosby – nicknamed the ‘Wizard of Oz’ – was retained by Conservative HQ for Theresa May’s 2017 campaign, but relations soured after bitter recriminations about the result.\n\nFullbrook also sparked internal ire for his poor running of Zac Goldsmith’s attempt to replace Johnson as Mayor of London.\n\nAustralian election king Sir Lynton Crosby will not be running Boris Johnson's General Election campaign, I hear, following bitter recriminations about the 2017 result\n\nCrosby kept up a close relationship with the future PM, and his firm continues to provide polling for the party. But despite Crosby being on ‘speed dial’ to Johnson during his successful leadership campaign, which was managed by Fullbrook, relations with the one-time gurus have ‘distinctly cooled’ after a series of negative briefings about the PM’s new team found their way into the tabloids.\n\nA source whispers: ‘Lots of people seem to be struggling to come to terms with the new regime and are lashing out, looking for people to blame.’\n\nOfficially, it’s all sweetness and light, but senior Tories confirm neither man will play ‘a leading role’ in the coming campaign.\n\nOlly well done, old boy!\n\nChampagne all round at the National Liberal Club, the ornate Thames-side private members’ townhouse beloved by well-heeled Liberal Democrats.\n\nMy spy snapped this congratulations on the club noticeboard to newly honoured Sir Oliver Robbins – Theresa May’s controversial pro- EU Brexit negotiator, loathed and distrusted by Leavers and made a knight after quitting in failure.\n\nThe Government’s loss is Goldman Sachs’ gain...\n\nChampagne all round at the National Liberal Club, the ornate Thames-side private members’ townhouse beloved by well-heeled Liberal Democrats\n\nIs Jo planning to score at Twickers?\n\nI hear private polling numbers in Liberal Democrat leader Jo Swinson’s East Dunbartonshire seat are dire, with party insiders hinting she could perform a ‘chicken run’ to Twickenham to avoid a humiliating defeat to the SNP.\n\nHowever, the Libs have already selected a candidate to replace the retiring Sir Vince Cable.\n\nGiven the south-west London seat is a jewel in their crown, having been yellow for all but two years since 1997, there was some surprise when relative unknown Munira Wilson was selected for the plum constituency.\n\nThe party denies she is just keeping the seat warm, but it’s one to watch...\n\n‘Saudi Arabia should be held to account, not embraced,’ said Jeremy Corbyn in one of his regular tirades against the Government’s ties to the controversial Gulf kingdom.\n\nSo the Labour leader may wish to have a quiet word with his MP Imran Hussain, who last week declared a luxury junket there including ‘flights, internal travel, accommodation, food and documentation’.\n\nThe Royal Embassy of Saudi Arabia picked up the whopping £20,000 bill for him and a guest less than ten months after the brutal murder of Saudi journalist Jamal Khashoggi horrified the world.\n\nSecurity guards were startled by the Prime Minister loudly yelling ‘No Deal’ in the Downing Street garden very early in the morning.\n\nRather than rehearsing bellicose threats for next week’s crunch EU Brexit showdown, Boris assured those concerned who had run to the scene that he was trying to get his puppy Dilyn, now known as ‘Dil’, to behave.\n\nWestminster's self-appointed Head Girl, Amber Rudd, stepped up her ongoing war on violent political rhetoric last week, accusing Downing Street of sounding ‘angry and desperate’ with words ‘that I do not believe should be the language of a UK Government’.\n\nRegular readers will remember her own rather aggressive resignation letter last month.\n\nBut now I hear the version that made it on to the Prime Minister’s desk was actually toned down.\n\nThe original draft passed to me talked of ‘reckless political arson’, ‘wanton culling’ and Rudd refusing to be ‘an innocent bystander any longer while our party is vandalised’. Angry and desperate?\n\nWhatever could the Brexit Party’s Ann Widdecombe have meant with her astonishing blast at fellow female Brexiteer Andrea Leadsom and her choice of ‘awful’ clothes? ‘That micro skirt and plunging neckline,’ she raged at the Business Secretary last week. ‘I won’t say what I thought you looked like because it really would not be terribly polite.’ Surely the devout Catholic is not suggesting that yet another Tory Cabinet Minister has ‘something of the night’ about them?", "description": "HARRY COLE: Sir Lynton Crosby may have masterminded Boris Johnson's successful bids for City Hall and helped to put him in No 10, but I hear he will not be running his Election campaign.", "authors": ["Harry Cole Deputy Political Editor For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/21/19636614-0-image-a-7_1570913871016.jpg", "published_at": "2019-10-12"}