{"pub": "nationalreview", "url": "https://nationalreview.com/news/china-suspends-business-dealings-with-nba-after-rockets-gm-cheers-hong-kong-protesters", "downloaded_at": "2019-10-09 00:22:58.317008+00:00", "title": "China Suspends Business Dealings with NBA after Rockets GM Cheers Hong Kong Protesters", "language": "en", "text": "(Troy Taormina/USA TODAY Sports)\n\nThe National Basketball Association is facing heavy backlash from Chinese supporters after Daryl Morey, general manager of the Houston Rockets, tweeted his support for the pro-democracy protests in Hong Kong.\n\nChina’s official basketball association, headed by Rockets legend Yao Ming, promptly suspended cooperation with the team, calling Morey’s opinion “inappropriate” on social-media platform Weibo. Chinese streaming service Tencent — which drew 500 million NBA viewers last year — also has said it will not be showing Rockets games this year. On Sunday, the Chinese Consulate in Houston released a statement on Morey’s “erroneous comments” and said it had contacted the franchise.\n\n“We have lodged representations and expressed strong dissatisfaction with the Houston Rockets, and urged the latter to correct the error and take immediate concrete measures to eliminate the adverse impact,” the statement reads.\n\nMorey has since deleted the tweet, which read “Fight for Freedom. Stand with Hong Kong,” and issued a statement on Sunday saying he did not intend for the tweet to offend. “I was merely voicing one thought, based on one interpretation, of one complicated event,” he wrote. In the immediate aftermath of the tweet, Rockets owner Tilman Fertitta attempted to assuage the tension by distancing the organization from Morey’s tweet.\n\nListen….@dmorey does NOT speak for the @HoustonRockets. Our presence in Tokyo is all about the promotion of the @NBA internationally and we are NOT a political organization. @espn https://t.co/yNyQFtwTTi — Tilman Fertitta (@TilmanJFertitta) October 5, 2019\n\nThe NBA, which has taken an active business interest in promoting the league in China in recent years, responded to the situation on Sunday night.\n\n“We recognize that the views expressed by Houston Rockets general manager Daryl Morey have deeply offended many of our friends and fans in China, which is regrettable,” the NBA said in a statement. “While Daryl has made it clear that his tweet does not represent the Rockets or the NBA, the values of the league support individuals’ educating themselves and sharing their views on matters important to them.”\n\nBrooklyn Nets owner Joseph Tsai, the co-founder of Chinese e-commerce firm Alibaba, took to Facebook to voice his displeasure at Morey’s comments, saying “supporting a separatist movement in a Chinese territory is one of those third-rail issues” and that “the hurt that this incident has caused will take a long time to repair.”\n\nThe NBA’s response has drawn bipartisan criticism, as Senator Ted Cruz (R., Texas) condemned the league for “shamefully retreating” and “assisting Chinese communist censorship.” Democratic presidential candidate Julián Castro urged the NBA to recognize that “China is using economic power to silence critics,” and called for the league to “not allow American citizens to be bullied by an authoritarian government.”\n\nOn Monday, Senator Ben Sasse (R., Neb.) blasted the NBA’s decision making. “The NBA wants money, and the Communist Party of China is asking them to deny the most basic of human rights. In response, the NBA issued a statement saying money is the most important thing,” Sasse’s statement read.", "description": "A tweet from Daryl Morey, general manager of the Houston Rockets, offered support for the pro-democracy protests in Hong Kong.", "authors": ["Tobias Hoonhout", "Andrew C. Mccarthy", "Kevin D. Williamson", "Rich Lowry", "John Fund", "George Will", "Jim Geraghty", "The Editors", "Brian Stewart", "Read More"], "top_image": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2018/06/nba-free-agents-26.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-07"}