{"pub": "abcnews", "url": "https://abcnews.go.com/US/man-honored-white-house-heroic-actions-el-paso/story?id=65535973", "downloaded_at": "2019-09-12 07:14:31.859396+00:00", "title": "Man honored by White House for heroic actions during El Paso shooting made up his story: Police", "language": "en", "text": "Chris Grant was supposed to receive an honor this week from the White House for heroically distracting the gunman during last month's shooting at an El Paso, Texas, Walmart and possibly saving lives.\n\nInterested in El Paso Shooting? Add El Paso Shooting as an interest to stay up to date on the latest El Paso Shooting news, video, and analysis from ABC News. Add Interest\n\nInstead, he was detained by the Secret Service in Washington ahead of the visit and his story has been called into question.\n\nGrant, a 50-year-old Texas resident whose full name is Earnest Christopher Grant, was one of 11 people who was to be honored Monday by President Donald Trump for bravery during back-to-back mass shootings in the El Paso and Dayton, Ohio.\n\nGrant, who sustained bullet wounds during the shooting, gave an interview from his hospital bed in which he said he threw soda bottles at the gunman to distract him from shooting others, prompting the gunman to turn his weapon on Grant.\n\nThe White House event went ahead as planned. Grant's mother, who was in attendance, was given a certificate of commendation on her son's behalf, and Trump praised Grant's actions.\n\nStefani Reynolds/DPA/AP\n\n“Chris grabbed -- listen to this -- soda bottles, and anything else in front of him, and began hurling them at the gunman, distracting him from the other shoppers and causing the shooter to turn towards Chris and fire at him,” Trump said in his speech. “Chris suffered two very serious gunshot wounds but he is recovering well and we wish him the best.”\n\nEl Paso police have reviewed video surveillance, which they say contradicts Grant's story. But they declined to describe what action, if any, Grant took, or comment on any interaction he might have had with the gunman.\n\n“[His actions] were basically human instincts, survival instincts but they were not heroic or as he described,\" police spokesman Enrique Carillo told ABC News on Wednesday, though he declined to answer specific questions.\n\nNumerous calls to Grant were not returned.\n\nReuters, FILE\n\nSecret Service confirmed to ABC News that a man with an active arrest warrant was temporarily detained, but would not identify him by name. A police spokeswoman confirmed to ABC News that Grant was the man in question.\n\nGrant was later released from custody and it is unclear where the case stands.\n\nA list of honorees from the White House event, obtained by ABC News, did not include Grant.\n\nABC News' Jack Date and Jordyn Phelps contributed to this report.", "description": "Christopher Grant was detained Monday before he was supposed to be honored for his heroic actions in the El Paso shooting, however now police say he lied.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/el-paso-rt-01-jpo-190803_hpMain_2_16x9_992.jpg", "published_at": "2019-09-11"}