{"pub": "thenextweb", "url": "https://thenextweb.com/gaming/2019/10/02/someone-got-doom-running-on-a-mcdonalds-cash-register", "downloaded_at": "2019-10-05 13:10:24.146969+00:00", "title": "Someone got Doom running on a McDonald’s cash register", "language": "en", "text": "Just when I think I’ve seen everything, some gaming weirdness comes along and smacks me back down to humility. And it’s usually something related to that most ubiquitous of games, Doom.\n\nThis time, a clever soul named Ryan Edgar has managed to get Doom to run on, of all things, a McDonald’s cash register. He revealed his results on Twitter, and it’s kind of beautiful:\n\nLadies and Gentlemen I give you DOOM … …. ….. Running on a McDonald’s cash register. pic.twitter.com/kQhrkZ1ScV — Ry (@Raio_Ken) September 29, 2019\n\nAccording to Kotaku, Ryan managed to get the game to work by using a USB stick and ZDOOM, a modernized port of Doom that works on modern computers. Using a USB splitter, he was able to hook up a keyboard and mouse, and voila: one Doomguy with extra demons. Want fries with that?\n\nMy favorite part of the Twitter thread where Ryan revealed his wicked work was when someone asked him where he’d gotten a McDonald’s cash register and his response was (perhaps unintentionally) evasive:\n\nmcdonalds — Ry (@Raio_Ken) September 29, 2019\n\nHe obtained it through legal means, he assures Kotaku, but that doesn’t make his stating of the obvious any less funny.\n\nA cash register running Doom is not necessarily as big a contrivance as, say a thermostat or a digital camera. Point-of-sale machines are basically just computers, albeit ones designed with a very specific purpose in mind. But it’s always fun to see a new addition to the “It runs Doom” subcategory of technology. Thanks to developers id Software releasing the game‘s source code to the public in 1997, gamers everywhere have made it their mission to get Doom running on anything that has a screen or can potentially support a screen.\n\nIf you want to see what else can run Doom, check out the It Runs Doom! Tumblr, where they keep a record of the kinds of things that run Doom (as the name would imply). There seems to be a competition amongst hardware enthusiasts as to what the most ancient and primitive piece of tech that can be made to run Doom is — I fully expect to see “Doom running on the Baghdad Battery” at some point in the future. And despite the fact that “it runs Doom” should be old hat by now, I never get tired of seeing it in action.\n\nBy the way, if you’re curious, there’s an inverse of the “It can run Doom” kneejerk reaction to seeing old tech. It’s fallen a bit out of fashion now, but when gamers see powerful or innovative new tech, it was practically law to ask “Can it run Crysis?” once the most graphically-demanding game of its age.\n\nActually, I say it’s fallen out of fashion, but, well…\n\nBut does it run Crysis? — Carl Paulsen (@carl_paulsen) September 30, 2019\n\nGuy Gets Doom Running On A McDonald's Cash Register on Kotaku\n\nRead next: Spoiler alert: Here's how The Milky Way dies", "description": "", "authors": ["Rachel Kaser"], "top_image": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F05%2FDoom-Sigil.jpg&signature=7303731b9ca0946ca6acf87240fc0a67", "published_at": "2019-10-02"}