{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/mackenzie-dern-explains-how-motherhood-has-helped-with-weight-cut-for-ufc-on-espn-19", "downloaded_at": "2019-10-10 15:29:41.401049+00:00", "title": "Mackenzie Dern explains how motherhood has helped with UFC on ESPN+ 19 weight cut", "language": "en", "text": "TAMPA, Fla. – Mackenzie Dern says her body is holding up strong ahead of her octagon return at UFC on ESPN+ 19, which comes just over four months after having her first child.\n\nDern (7-0 MMA, 2-0 UFC), who meets Amanda Ribas (7-1 MMA, 1-0 UFC) on Saturday in a strawweight bout, said it didn’t take long to rebuild her body into fighting shape after having her daughter earlier this year. More than that, it’s been beneficial to her weight cut, which has historically been rough.\n\nDern badly missed weight in her previous fight, but reported on Wednesday that she’s 118 pounds and well ahead of schedule for Friday’s weigh-in.\n\n“It’s just keeping me focused and her smiles are keeping me happy and focused,” Dern told reporters, including MMA Junkie, at the UFC on ESPN+ 19 open workouts. “The weight cut is going great. I think the breast-feeding helps with the weight cut breastfeeding all the time it’s keeping my weight down. It’s the best weight cut ever so I was surprised.”\n\nTypically female fighters do not come back so quickly after having a child. In this instance, though, Dern said the timing was perfect, especially because she hasn’t competed since May 2018.\n\n“I knew I’d be back fast,” Dern said. “I knew I’d be back but didn’t know if the labor would be a sea section but the labor, even though it was long, it was OK. I got back to training and the two weeks after I got back to training I told my manager, ‘When is my next fight?'”\n\nDern returns to action at UFC on ESPN+ 19, which takes place at Amalie Arena and streams on ESPN+. She doesn’t get a pushover in Ribas, who has just one blemish on her record and has a well rounded skillset including a jiu-jitsu black belt.\n\nRibas has said she doesn’t fear a grappling fight. Dern is about as high-level as it gets on the mat, and while she thinks she will ultimately best her opponent, she thinks Ribas is her toughest MMA foe when it comes to jiu-jitsu skills.\n\n“I definitely think grappling is probably like the worst change because that’s my best part,” Dern said. “She’s going to have to train a lot of years to get to my experience of grappling, but she is a black belt and I thought of all the girls I fight she would be the only least concerned because she does have that black belt and judo black belt background too. I think of all the girls I fight she’s probably the one who feels the most comfortable if we go to the ground.”\n\nFor more from Dern, click on the video linked above.", "description": "Mackenzie Dern says her body is holding up strong ahead of her octagon return at UFC on ESPN+ 19.", "authors": ["Mike Bohn", "Mma Junkie Staff", "Farah Hannoun", "John Morgan"], "top_image": "https://usatmmajunkie.files.wordpress.com/2019/10/mackenzie-dern-ufc-tampa-open-workouts.jpg?w=1000&h=576&crop=1", "published_at": "2019-10-10"}