{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/the-legend-of-zelda-links-awakening-the-kotaku-review", "downloaded_at": "2019-09-19 23:18:53.709274+00:00", "title": "The Legend Of Zelda: Link's Awakening: The Kotaku Review", "language": "en", "text": "The best feeling you can possibly feel while playing a video game is the act of swinging a sword in Zelda. I came to this conclusion recently, while playing the new remake of Link’s Awakening and trying to pinpoint exactly what it is that makes me love Zelda games so much. The answer, I think, is the way Link swings his sword.\n\nJust look:\n\nIs there anything more delightful, more palpably satisfying? The developers at Nintendo have always understood that a video game is only as good as its verbs—its actions—and they’ve always endeavoured to make those actions induce as much joy as possible. Over the course of this playthrough of Link’s Awakening, I swung that sword thousands of times, and it never failed to bring me a jolt of happiness as it connected. Look at the way the blade cuts through the air, leaving an arc that almost looks like lightning.\n\nWatch how that poor Moblin staggers and flashes a satisfying shade of red. You can’t hear it in a gif, but it sounds delicious, too—an empty whiff when you miss, but a satisfying crunch when you hit. If you told me I could only perform one video game action for the rest of my life, Link’s sword swinging would at least be in the top three.\n\nLink’s jumping — not common in Zelda games, but brilliant in Link’s Awakening — might be up there, too.\n\nYou know what? Everything you can do in this game feels pretty damn good.\n\nThe Legend of Zelda: Link's Awakening BACK OF THE BOX QUOTE 'Wake up, Link. LINK???' TYPE OF GAME Action/adventure/trade sim LIKED One of the best Zelda games... a beautiful remake that feels great and is as polished as a Mirror Shield DISLIKED Chamber Dungeons, frame rate drops DEVELOPER Nintendo, Grezzo PLATFORM Nintendo Switch RELEASE DATE September 20, 2019 PLAYED Finished the game in about eight hours, spent a couple more wandering and doing Chamber Dungeons\n\nThis remake of The Legend of Zelda: Link’s Awakening, out for Switch on Friday, is a near 1:1 recreation of the 1993 Game Boy game. At the time of its original release, Link’s Awakening was just the fourth game in the Zelda series, a line of games in which you, as a floppy-capped, pointy-eared boy named Link, solve puzzles, fight monsters, and save princesses.\n\nLink’s Awakening was a strange game but a wonderful one, and people still rank it among the best entries in a series full of excellent games. Its music, dungeon design, and light but melancholy story have always made it stand out.\n\nMany people coming to this remake will know of it already and want to know how it’s different. Its structure has not changed, but its aesthetics and the conveniences it affords players have.\n\nFor the remake, the developers at Grezzo and Nintendo have re-designed every screen in the world, replacing the old sprites with beautiful painted 3D tableaus that make it feel like you’re looking down on a toy set. The old MIDI soundtrack has transformed into a flowing orchestra, full of woodwinds and choruses. The characters and puzzles remain untouched, but they look very different.\n\nThere are a few other key differences between the original and this remake. First and foremost, you no longer have to waste time juggling items. Every Zelda game gives you a stable of go-to gadgets for fighting monsters and solving puzzles, so it’s helpful when you can access as many as possible at once.\n\nThe Game Boy version of Link’s Awakening was limited by the system’s two action buttons, A and B, and you had to go into the menu and assign an item to one of those buttons every time you wanted to use it. This included the sword, shield, and even the Power Bracelet, an item that let you pick up rocks, bottles, and other heavy objects.\n\nIf you wanted to, say, lift a rock and throw it at an enemy, you’d need to open your inventory, select the Power Bracelet, swap it in with one of your equipped items, and then press that button next to the rock. It wasn’t hard to get used to this system, but it was tedious.\n\nFortunately, the Switch has a lot more buttons than the Game Boy, and the designers of the Link’s Awakening remake have taken advantage. Your sword and shield now have dedicated buttons, as do the Pegasus Boots, an item you’ll get early in the game that lets Link dash at super-speed. You no longer have to equip the Power Bracelet to pick up rocks. You just have to own it. These changes might sound minor, but they make a huge difference, and this version of Link’s Awakening feels like it belongs in 2019.\n\nThe other big difference is the addition of a side feature—Chamber Dungeons—which is boring and tedious. It’s an optional mode in which you can take rooms from dungeons you’ve already beaten and rearrange them using layouts provided by the Zelda stalwart Dampé the gravedigger. Unless you enjoy playing through the same rooms over and over again, it’s just a big waste of time. (Read more about Chamber Dungeons here.)\n\nThere are a handful of smaller tweaks, too. You can save and then re-load the game from anywhere. You can catch fairies in bottles. The fast travel warp points are more frequent and easier to use. Unlike the Game Boy version, Link’s Awakening on Switch has a few notable framerate issues. While walking around the overworld — which, rather than a grid of single-screen rooms, is now a continuous map — I ran into some choppiness. (I played the game entirely in handheld mode.)\n\nWhat hasn’t changed is everything that made Link’s Awakening work so well in 1993, all of which holds up today: the locations, the puzzles, and most importantly, the moment-to-moment satisfaction of smacking slimes in the face with a boomerang.\n\nSome quick history. Back in 1987, The Legend of Zelda blew people away with its promise of what an open-world video game could look like. It encouraged exploration and instilled a feeling of adventure unlike anything we’d seen on the NES before, but it was very shallow, like a blueprint for what Zelda could look like in the future.\n\nIts sequel, the black sheep Zelda II: Adventure of Link, experimented with sidescrolling action to mixed results. It wasn’t until 1991 that the Zelda formula first emerged with The Legend of Zelda: A Link to the Past, the game that established conventions that would be used for many years to come.\n\nLike the original Zelda, Link to the Past dropped you into an open world with little but your wits and the sword in your hand, but unlike the first game’s flat layouts and simple topography, Link to the Past was dense. Different areas of the world had different themes, almost personalities, like the swampy Misery Mire and the chilly Kakariko Village.\n\nRather than ask you to walk through a series of indistinguishable flat maps as the NES game did, Link to the Past was full of elaborate mazes and tangled designs. The world bulged with secrets, and around every corner you’d find a hidden chest or cracked wall to blow up. Your options would be limited to a few areas at first, and over time, as you acquired more items—the Power Gloves, the flippers, the hookshot—you’d be able to access more and more of the world. Backtracking to old areas would reward you with cool stuff, like item upgrades and pieces of heart.\n\nLink’s Awakening started off as an experiment to remake the Link to the Past on the Game Boy, according to an interview with the game’s original developers. Soon it had evolved into something much weirder. Taking influences from sources ranging from Mario to Twin Peaks, the developers filled their world with quirky characters and a variety of locations: magically enhanced forests, cactus-infested deserts, mazes full of bushes and deadly holes.\n\nThe game starts off at some indeterminate point in Link’s life. Our hero is sailing through a nasty storm when suddenly everything goes dark. He winds up on a beach, where he’s rescued and taken to safety by a girl named Marin who has a beautiful voice and a magnetic appeal to cute animals, like a chibi Disney princess.\n\nTurns out that Link is on a mysterious island called Koholint that’s full of strange people, talking animals, and a whole lot of references to Nintendo’s Super Mario series. A talking owl sends Link on a mission to go wake up the Wind Fish, a godlike creature who lives in a giant egg in the centre of the island. Soon he’s off on a journey to go find eight instruments in eight dungeons across the world.\n\nLike Link to the Past’s Hyrule, the world of Link’s Awakening is dense and full of mysteries. It starts off feeling constrained, limiting you to a handful of areas thanks to obstacles like heavy rocks and bottomless pits. The more you play, the more you’ll break down those barriers.\n\nBy the time you’ve hit your stride and explored enough of the map to see how it all fits together, you may appreciate its intricacy, as if you’ve just cracked open a mechanical watch and learned what makes it tick. In the Game Boy version, the world map was broken up into 256 screens, most of which had their own gimmicks or secrets. The Switch version links them together in one large world map. Both styles are appealing, but the latter is easier to get around, and it’s a delight to see how it all weaves together.\n\nLink’s Awakening’s eight dungeons each follow a traditional pattern, blending puzzles with navigational challenges and obstacles that you’ll need that dungeon’s item to overcome. One puzzle might task you with killing three enemies in the right order; another might involve manoeuvring a floating block until it fills every gap in the floor. None of these challenges or puzzles are particularly complicated. Usually they’re just subversive enough to stymie the first solution you think of, but the second will work.\n\nStill, completing them is usually satisfying, and the themes grow more interesting as you go. The seventh, Eagle’s Tower, has one of the more memorable gimmicks of any Zelda dungeon to date. The optional ninth Colour Dungeon, added for the Game Boy Colour version of the game in 1998 and retained for this Switch remake, is actually the weakest of them all, which may come as a disappointment to anyone who played the original and was hoping for something brand new.\n\nAnd there is nothing brand new to the main adventure here. Link’s Awakening is a beautiful recreation of a legendary game, but it doesn’t have much to offer to players who already know the ins and outs of Koholint Island.\n\nFor newcomers, or people who played Link’s Awakening two decades ago and can’t remember exactly how to finish the trading quest or track down that damn singing frog, this is a worthy remake and a must-play Zelda game.\n\nYou may recall that two years ago, Nintendo released The Legend of Zelda: Breath of the Wild, an all-time great that revitalised the iconic series. The company’s latest Zelda game is so radically different that they basically feel like different genres, but when taken together, they help explain what makes The Legend of Zelda so special.\n\nOn one end of the spectrum, there’s the vastness of a polished, beautiful open world full of strange places to explore; on the other, there’s the density of an island packed with secrets. If the two games have one thing in common, and offer one reason to keep playing Zelda all these years later, it’s this: they both make it feel pretty damn incredible to swing a sword.", "description": "The best feeling you can possibly feel while playing a video game is the act of swinging a sword in Zelda. I came to this conclusion recently, while playing the new remake of Link’s Awakening and trying to pinpoint exactly what it is that makes me love Zelda games so much. The answer, I think, is the way Link swings...", "authors": ["Cecilia D'Anastasio", "Kotaku Australia"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/g78ab03pusd5yyzx90eo.jpg", "published_at": "2019-09-19"}