{"pub": "guardian", "url": "https://theguardian.com/film/2019/oct/15/when-they-see-us-ava-duvernay-netflix-lawsuit-reid", "downloaded_at": "2019-10-16 05:53:40.691859+00:00", "title": "'It breaks down innocent people': the interrogation method at center of Ava DuVernay lawsuit", "language": "en", "text": "Police consulting firm behind widely criticized ‘Reid technique’ claims Netflix drama When They See US misrepresents method\n\nThe director Ava DuVernay and Netflix are facing a lawsuit from the police consulting firm behind a widely criticized interrogation technique referenced in the miniseries When They See Us.\n\nJohn E Reid and Associates, a US company that trains law enforcement on interrogations, filed a defamation suit on Monday, challenging DuVernay’s critically acclaimed Netflix drama based on the case known as the Central Park Five. When They See Us is a four-part dramatization of the true story of five black and brown teenage boys from Harlem who were wrongfully convicted of the rape of a white woman in Central Park in the spring of 1989.\n\nThe case is now known as one of the most notorious examples of police coercing people into giving false confessions, and the show powerfully depicts the harrowing interrogations the young boys faced and the racist prosecution that followed. The five teens went to prison and were eventually exonerated by DNA evidence.\n\nSince the 1970s, John E Reid and Associates has taught an interrogation method known as “the Reid technique”, which was directly discussed in DuVernay’s series.\n\nThe complaint cited a quote from a prosecutor character in the series who questions a police detective’s interrogations of the boys, saying: “You squeezed statements out of them after 42 hours of questioning and coercing … The Reid technique has been universally rejected.” The detective responds: “I don’t even know what the fucking Reid Technique is.”\n\nWhen They See Us: behind the harrowing Netflix drama about the Central Park Five Read more\n\nThe firm’s lawsuit accuses Netflix of making false and defamatory statements, seeks damages and demands an injunction blocking Netflix from streaming the series, unless they “delete the defamatory references”. The suit alleges that the show misrepresents the nature of the Reid technique by suggesting that “coercing” statements from juveniles after “long hours of questioning without food, bathroom breaks or parental supervision” is “synonymous” with this method.\n\nIt’s unclear exactly how defamation laws might cover this fictionalized dialogue. The complaint is, however, bringing renewed attention to the Reid technique, the company’s trainings, and related interrogation techniques and controversies.\n\nThe technique, which was devised by a former police officer and polygraph expert, has increasingly been the subject of scrutiny by scholars and lawyers, who say that research and ongoing exonerations have shown it leads to false confessions. Critics charge that the method and similar practices involve interrogators pressuring and intimidating suspects, making it seem as if the police have proof of guilt, “minimizing” the seriousness of crime and potential consequences and presenting confession as the easiest way out of the situation.\n\nIn 2017, Wicklander-Zulawski and Associates, a large consulting group that has worked with the majority of police departments across the US, announced it would stop using the Reid technique, specifically due to concerns about false confessions.\n\nAlan Hirsch, the chair of the justice and law studies program at Williams College, has testified in roughly 30 cases about the Reid technique.\n\n“It’s an interrogation method designed to create anxiety, stress and eventually desperation,” he told the Guardian. “The suspect concludes that confessing is the best or even the only way out … It breaks down innocent people as well as guilty people. It’s too effective.”\n\nThe “overwhelming majority of PhD social scientists who research and write about the Reid method of interrogation believe that it can be and sometimes is psychologically coercive” and increases the risk of false confessions, added Richard Leo, a law and psychology professor at the University of San Francisco and leading expert on the subject.\n\nKeren Goldenberg, a criminal defense lawyer in Massachusetts, said the depictions of interrogations in When They See Us rang true to her.\n\n“The Reid technique really capitalizes on the fear and the weaknesses of the person who is sitting in front of the interrogator,” she said.\n\nJohn E Reid and Associates was “grasping at straws and fiercely protecting their brand”, added Hayley Cleary, an associate professor of criminal justice at Virginia Commonwealth University and an expert on police interrogations. She noted that other countries had largely moved away from the practice.\n\nCleary said she was grateful to When They See Us for potentially helping future jurors understand that people can be pressured to confess to crimes they did not commit: “Normalizing the idea that false confessions can happen is really, really important.”\n\nRepresentatives for DuVernay and Netflix did not respond to requests for comment. John E Reid and Associates and their attorneys in the case, Jack Carriglio and Corey Hickman, also did not respond to interview requests.\n\nThe company’s lawsuit includes the defense it has repeatedly offered – that false confessions don’t come from the application of the Reid technique, “but rather they are usually caused by interrogators engaging in improper behavior that is outside of the parameters … behaviors which the courts have found to be coercive – threats, promises, denial of rights”.\n\nThe technique does not involve assaulting suspects, denying them rights, conducting excessively long interrogations and some of the other particularly brutal tactics depicted in the series, the lawsuit also said.\n\nGoldenberg predicted the company’s suit would only escalate scrutiny of its methods and make its PR problem even worse: “The more attention drawn to the technique, the less police departments are going to want to use it, because there’s this negative association.”", "description": "Police consulting firm behind widely criticized ‘Reid technique’ claims Netflix drama When They See US misrepresents method", "authors": ["Sam Levin"], "top_image": "https://i.guim.co.uk/img/media/ad9498c3e364bda02306af1e2f1377af35f3eef8/0_240_3600_2160/master/3600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=954536da126c8f4fe6724215bac981ec", "published_at": "2019-10-15"}