{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/jeremy-mcconnell-gets-baby-bag-20713483", "downloaded_at": "2019-10-24 14:14:58.717032+00:00", "title": "Jeremy McConnell gets baby bag ready for his 'Princess' after insisting he's there for Caben", "language": "en", "text": "Get the biggest daily Celebrity Big Brother stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nJeremy McConnell has been busy packing his hospital bag ahead of the arrival of his baby girl.\n\nHe's expecting a little 'Princess' with girlfriend Katie McCreath, who is due to give birth in December.\n\nAnd the former model and Celebrity Big Brother star is doing everything he can to become a doting dad.\n\nHe already has a son, Caben-Albi, who he shares with ex-girlfriend Stephanie Davis.\n\nIt's believed he hasn't seen Caben, two, for a long time, but Jeremy recently hit back at claims he was \"neglecting\" the youngster.\n\nHe told MailOnline : \"Anyone that has half a brain cell needs to understand the reason I am not part of Caben's life is because not every situation can be fixed.\"\n\n(Image: Instagram)\n\n(Image: Instagram)\n\nHe added: \"I protect my son as much as I can. It's not neglecting, it's protecting. I'm a very loving father. This is better for Caben.\n\n\"My priority is my baby girl because it's in my control – I have rights over that. My main focus is my girl.\"\n\nHe's been praised by his pregnant other half Katie, who says he's more organised than she is when it comes to preparing for the arrival of their baby.\n\nShe took to Instagram to share a snap of the drawers in her nursery packed to the brim with baby clothes and towels.\n\n(Image: Instagram)\n\n(Image: Instagram)\n\nOn top, lies an overnight bag ready to be packed.\n\nShe wrote: \"Time to pack the hospital bag Mr Organised @jeremymcconnellcooke is on it tonight with the list .... I’m Mrs Last minute so it will be strange been so on schedule\n\n\"I’ve got big pants and some comfy slippers for me spritz for bitz on order ... and all the basics for her ! Less than 7 weeks to go\n\n\"Thanks for the tips I’ve already had and to @hfreckles1983 for my super organisation list! Which has been a bible so far!\n\n(Image: Instagram)\n\n\"I don’t want to take things out of my @babeek_official organised draws\"\n\nJeremy also shared a snap of the bag on his Instagram Story, writing: \"Getting the baby bag ready\"\n\nWhen Jeremy announced his baby news, he said he'd always wanted to be a dad.\n\nHe wrote: \"Alot of things out there are not always how they are portrayed. I have wanted nothing more than to be a dad in life and I thank the people who have used their initiative to understand that. All I want is a happy family life away from any negativity.\"\n\nDo you have a story to sell? Get in touch with us at webcelebs@trinitymirror.com or call us direct 0207 29 33033", "description": "The former model and Celebrity Big Brother star is expecting a little girl with his girlfriend Katie McCreath", "authors": ["Vicki Newman", "Image", "Instagram"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article17508415.ece/ALTERNATES/s1200/1_JEREMY-McConnell-is-expecting-a-baby-with-girlfriend-Katie-McCreath.jpg", "published_at": "2019-10-24"}