{"pub": "americanconservative", "url": "https://theamericanconservative.com/larison/remembering-the-dahyan-school-bus-massacre-in-yemen", "downloaded_at": "2019-10-05 13:11:50.025873+00:00", "title": "Remembering the Dahyan School Bus Massacre in Yemen", "language": "en", "text": "Orla Guerin reports from Dahyan, the site of the Aug. 9 school bus massacre that killed more than 50 people, including over 40 young boys:\n\n#Watch. We investigate the killing of 42 school boys in an #airstrike in #Yemen by the #Saudi led coalition. UK still a major arms supplier to the Saudis. These children should be alive today. Thanks to incredible colleagues @NicolaCareem @LeeDuranthttps://t.co/jm6l0otngP — Orla Guerin (@OrlaGuerin) October 19, 2018\n\nThe massacre was just a little over two months ago. At the time, it was one of the few stories of Saudi coalition atrocities that had captured the attention of the wider world, but that quickly faded. The coalition conducted one of their sham “investigations” and outrageously never apologized for killing the children on the bus. Instead, the coalition maintained that the bus had been a “legitimate” target all along, but they said it should not have been targeted in the market. They went so far as to say that there were no children on the bus. Contrary to Saudi coalition lies, the boys were out on a field trip and had nothing to do with the war. Their bus is one of the dozens of civilian vehicles that the coalition has attacked this year alone. There is no possible justification for targeting a bus filled with children at any time.\n\nThe school bus massacre is just one of thousands of war crimes that the Saudi coalition has committed against Yemeni civilians, but it stands out as one of the cruelest and most senseless of all of them. These were the boys murdered for no reason:\n\nHeartbreaking picture by my colleague ⁦@NicolaCareem⁩ of young victims of airstrike in #Yemen. No apologies for reposting. Every boy had a family and a future until it was taken away – by an #airstrike in broad daylight on a busy street full of shops, and civilians pic.twitter.com/oeOnwgsBnc — Orla Guerin (@OrlaGuerin) October 19, 2018\n\nWhile the rest of the world has moved on from the massacre, their families are of course still mourning their terrible loss:\n\n#YemenBusAttack Mohammed al Haraji could only identify his son Yehiya by his teeth. He told us parents were arguing over body parts so they had something to bury. pic.twitter.com/SQCU5wdVvj — Orla Guerin (@OrlaGuerin) October 19, 2018\n\nThe schoolmates and friends killed on the bus are buried alongside one another:\n\nA cemetery for the young victims of #YemenBusAttack. They call it the ‘Dahyan Children’s Garden’. #Yemen pic.twitter.com/FUpMq9LaBA — Orla Guerin (@OrlaGuerin) October 19, 2018\n\nSome of the victims’ bodies were damaged so much that their remains still cannot be identified:\n\n#YemenBusAttack – the empty graves are for children whose bodies have not been identified yet – Victims of #airstrike by #Saudi-led coalition. pic.twitter.com/paKHqXbG2E — Orla Guerin (@OrlaGuerin) October 19, 2018\n\nThe survivors of the attack have been deeply traumatized by the experience:\n\n“There’s no beauty in life now, and no future” 13-year-old Mohammed, a survivor of the Yemen school-bus attack, tells @OrlaGuerin #ChildenUnderAttack https://t.co/55uWOgdjkt pic.twitter.com/WHTFt368Sr — Joe English (@JoeEEnglish) October 19, 2018\n\nA U.S.-made weapon killed these children, and it was a U.S.-backed Saudi coalition pilot who targeted them. Our government continues to arm and refuel the planes that regularly carry out attacks on civilian targets in Yemen, and that support makes attacks like this one possible. If the U.S. pulled the plug on military assistance to the coalition, it would be practically impossible for them to continue their bombing campaign, and that could give Yemen a chance at the peace that has been denied to Yemenis for years. Congress must halt all U.S. support for the war on Yemen as quickly as possible before there are any more Dahyans.", "description": "", "authors": ["Daniel Larison"], "top_image": "https://www.theamericanconservative.com/wp-content/uploads/2015/06/shutterstock_103067756.jpg", "published_at": "2018-10-19"}