{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-election/democratic-debate-live-time-tonight-watch-polls-biden-warren-sanders-trump-who-won-lost-a9157531.html", "downloaded_at": "2019-10-15 23:07:18.993130+00:00", "title": "Democratic debate live: Time, channel, candidates and all the latest updates", "language": "en", "text": "Elizabeth Warren and Bernie Sanders have both unveiled ambitious anti-establishment plans ahead of the debate tonight in Ohio.\n\nWarren is taking aim at the influence of \"big money\" in politics in her latest plan , which sees her turning down donations from powerful PACs and large corporations. She is already refusing contributions of larger than $200 (£157) from Big Pharma and fossil fuel firms and will now extend that rule to apply to the tech giants of Silicon Valley.\n\n“Money slithers through every part of our political system, corrupting democracy and taking power away from the people. Big companies and billionaires spend millions to push Congress to adopt or block legislation. If they fail, they turn to lobbying federal agencies that are issuing regulations,” said Warren. “I’m proud to be running a grassroots-funded campaign for president, and I hope my fellow candidates for the Democratic nomination will do the same.”\n\nHer plan would make it illegal for PACs to contribute to federal candidates, close a loophole allowing foreign-owned or funded companies to donate to campaigns and ban donations and political spending from being considered in the selection of an ambassador (a dig at men like Portland hotelier Gordon Sondland, who gave $1m - or £785,000 - to Trump's inauguartion push before being made US envoy to the EU).\n\n\n\nTo boost transparency, Warren would order presidential campaigns to disclose all donors and fundraisers who are given official titles, including national or regional finance committees and bundlers, modernise campaign finance laws to reveal funding behind political advertisements online and require every organisation that makes an election-related expenditure to disclose their large donors.\n\nSanders is meanwhile coming after corporate America with a new tax plan.\n\n“For more than 40 years, the largest and most profitable corporations in America have rigged the tax code and our economy to redistribute wealth and income to the richest and most powerful people in this country,” Sanders said in a statement. “The American people are saying enough is enough.”\n\nHe called for the restoring of the tax rate to a pre-Trump 35 per cent from the current 21 per cent, blocking tax havens and a new measure requiring corporations to give their employees stock until the businesses are at least one-fifth employee-owned with 45 per cent of board members elected.", "description": "Twelve Democrats hoping to take on Donald Trump in the 2020 presidential election will appear onstage tonight for the largest primary debate in American history -- just as the candidates are finally taking off their gloves.", "authors": ["Lily Puckett", "Chris Riotta", "Lucy Anna Gray", "Joe Sommerlad"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/15/20/democratic-debate.jpg", "published_at": "2019-10-15"}