{"pub": "marketwatch", "url": "https://marketwatch.com/story/trump-administration-targets-vaping-unveiling-plan-to-clear-flavored-e-cigarettes-from-the-market-2019-09-11", "downloaded_at": "2019-09-12 07:16:46.926834+00:00", "title": "Trump administration targets vaping, unveiling plan to ‘clear flavored e-cigarettes from the market’", "language": "en", "text": "The Trump administration on Wednesday announced a crackdown on electronic cigarettes in an effort to combat the youth vaping epidemic, with Health and Human Services Secretary Alex Azar tweeting that the goal was to “clear flavored e-cigarettes from the market.”\n\n“The Food and Drug Administration intends to finalize enforcement guidance which will require that any flavored e-cigarette products, not including tobacco flavor, be removed from the market until they apply for and secure approval under the pre-marketing tobacco authority at the Food and Drug Administration,” Azar said, speaking outside the White House.\n\nShares in tobacco giant Altria Group Inc. MO, +1.08% — which owns 35% of e-cigarettes heavyweight Juul Labs Inc. — lost ground following the news on Wednesday afternoon that the Trump administration was stepping up its efforts to address youth vaping. But the stock then recovered, and it was recently up 0.6%, after trading lower by more than 1%.\n\nThe FDA plans to share more specifics about its plan soon, the Department of Health and Human Services said in a news release. Azar stressed that tobacco-flavored e-cigarettes also could end up being targeted.\n\n“We want the tobacco-flavored e-cigarettes to remain available for adults who may be using e-cigarettes to be off of combustible tobacco. But if we find that children start surging into tobacco-flavored e-cigarettes, or if we find marketing practices that target children… we’ll engage in enforcement actions there also,” the HHS chief said.\n\nI just announced with @POTUS and @FDACommissioner that we will be finalizing policies that will clear flavored e-cigarettes from the market. New provisional data show that youth use continues to rise rapidly, and we will not stand idly by. — Secretary Alex Azar (@SecAzar) September 11, 2019\n\nJust before Azar’s remarks, President Donald Trump voiced support on Wednesday for cracking down on youth vaping. He said “very, very strong action” may be needed on vaping to protect “innocent children.”\n\nRelated: Juul’s billionaire co-founder plays defense as House Democrats question company’s moves on youth vaping\n\nAnd see: Makers of flavored e-cigarettes face ‘a make-or-break year’ in Washington\n\nThe Trump administration’s latest move comes a day after the FDA issued a warning letter to Juul for selling its e-cigarettes as “modified risk tobacco products” without permission from the agency. The FDA and the Centers for Disease Control and Prevention also recently said they were looking into hundreds of cases of severe respiratory disease possibly associated with e-cigarette use. In addition, Michigan this month took steps to become the first U.S. state to ban flavored e-cigarettes, after San Francisco in June became the first major American city to ban the sale of all e-cigarettes.\n\nAs federal regulators and members of Congress take aim at Juul, the San Francisco-based company — which is the dominant e-cigarettes player in the U.S. with an estimated market share of about 70% — has ramped up its lobbying efforts in Washington, D.C. It disclosed lobbying spending of $1.01 million in this year’s second quarter after shelling out $940,000 in the first quarter, meaning it already has topped last year’s outlay of $1.64 million.\n\nThe Campaign for Tobacco-Free Kids said the Trump administration’s planned action on flavored e-cigarettes was “a necessary and long-overdue step,” adding that it “must be comprehensive, immediate and long-lasting.”\n\n“It has taken far too long to stop Juul and other e-cigarettes companies from targeting our nation’s kids with sweet-flavored, nicotine-loaded products that are addicting a new generation and threaten decades of progress in reducing youth tobacco use,” the prominent advocacy group also said in a statement. “We will work to support a comprehensive prohibition on flavored e-cigarettes, and we urge the administration not to back down in the face of the inevitable pressure from Juul and other manufacturers.”\n\nJuul didn’t immediately respond to a request for comment.", "description": "The Trump administration announces a crackdown on electronic cigarettes in an effort to combat the youth vaping epidemic, with Health and Human Services...", "authors": ["Victor Reklaitis", "Money", "Politics Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GX420_juul_1_ZG_20181031135507.jpg", "published_at": "2019-09-11"}