{"pub": "marketwatch", "title": "The No. 1 most expensive state to buy a home in — it’s not New York or California", "url": "https://marketwatch.com/story/the-no-1-most-expensive-state-to-buy-a-home-in-its-not-new-york-or-california-2019-08-29?mod=MW_video_top_stories", "language": "en", "published_at": "2019-08-29", "downloaded_at": "2019-09-02 07:10:49.792662+00:00", "text": "Prospective home buyers may want to steer clear of the Bay State if they don’t want their purchase to break the bank.\n\nMassachusetts ranked as the most expensive state to buy a home in, according to a report from personal-finance website SmartAsset. The analysis assessed 48 states and Washington, D.C., based on the following metrics (Delaware and Louisiana were not included due to insufficient data):\n\nEffective property tax rate, based on U.S. Census Bureau data\n\nMedian listing price and price per square foot, according to Zillow ZG, +1.27%\n\nMedian value for homes in the bottom third of the market\n\nAverage closing costs, according to SmartAsset’s own closing cost calculator\n\nAll the states were ranked for each of these metrics, and then researchers calculated their average ranking. This then determined the index value they were assigned on a scale from 0 to 100, with 100 being the cheapest. Massachusetts’ index came in at zero, while West Virginia was the most affordable state with a value of 100.\n\nDon’t miss: Mortgage rates increase slightly, pumping the brakes on the refinance boom\n\nHome prices were actually lower in Massachusetts than other notoriously expensive states such as California and Hawaii. The median listing price in Massachusetts was $479,900, versus $550,000 for California and a whopping $632,500 for Hawaii.\n\nHowever, Massachusetts had a relatively higher effective property tax rate (1.18%) than both of those states. Even then, the Bay State had far from the highest tax rate in the country — that honor went to New Jersey, whose property tax rate of 2.43% contributed to it ranking as the second most expensive state nationwide.\n\nWest Virginia, meanwhile, is a haven for house hunters looking for a bargain. The state not only had lowest median listing price in the country at $169,900, but also one of the lowest property tax rates at just 0.57%.\n\nOverall, the South and Midwest were the cheapest places to be a homeowner, with states from these regions, such as Arkansas and Indiana, ranking among the most affordable.", "description": "The combination of high home prices and property tax rates can making buying a home a costly proposition in some states.", "authors": ["Jacob Passy"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ399_salem0_ZG_20190829113907.jpg"}