{"pub": "independent", "url": "https://independent.co.uk/sport/football/premier-league/paul-pogba-manchester-united-problem-child-peter-schmeichel-a9128056.html", "downloaded_at": "2019-10-01 15:30:00.277124+00:00", "title": "Paul Pogba is Manchester United’s ‘problem child’, says Peter Schmeichel", "language": "en", "text": "Peter Schmeichel has labelled Paul Pogba a “problem child” for Manchester United and said he does not know what the midfielder’s role is.\n\nThe World Cup winner overcame an ankle problem to start for United in their 1-1 draw with Arsenal on Monday night but was unable to stamp his authority on the game.\n\nFormer United keeper Schmeichel was watching the game as a TV pundit, and was less than impressed with Pogba in particular.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHe told Stadium Astro: “It was a really weird performance. Sitting in the stands looking at the team and the shape, it was difficult to understand what was going on, what the plan for the game was.\n\n“And one thing that Ole Gunnar (Solskjaer) mentioned, when United had the ball he said it was very slow, I can only agree with that. The way the ball is being moved around when Pogba is in the team is different to the pace the ball is being moved around when he’s not in the team.\n\nShape Created with Sketch. Player ratings: Man United vs Arsenal Show all 22 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Player ratings: Man United vs Arsenal 1/22 David De Gea - 6 Action Images via Reuters 2/22 Axel Tuanzebe - 5 EPA 3/22 Harry Maguire - 6 Action Images via Reuters 4/22 Victor Lindelof - 6 Manchester United via Getty Imag 5/22 Ashley Young - 6 AFP/Getty Images 6/22 Scott McTominay - 8 Action Images via Reuters 7/22 Paul Pogba - 6 Getty Images 8/22 Andreas Pereira - 6 Getty Images 9/22 Daniel James - 7 Manchester United via Getty Imag 10/22 Marcus Rashford - 6 REUTERS 11/22 Jesse Lingard - 5 AFP/Getty Images 12/22 Bernd Leno - 6 REUTERS 13/22 Calum Chambers - 5 Action Images via Reuters 14/22 David Luiz - 6 Getty Images 15/22 Sokratis - 6 Getty Images 16/22 Sead Kolasinac - 6 EPA 17/22 Granit Xhaka - 5 PA 18/22 Matteo Guendouzi - 7 Getty Images 19/22 Lucas Torreira - 5 REUTERS 20/22 Nicolas Pepe - 4 REUTERS 21/22 Pierre-Emerick Aubameyang - 7 EPA 22/22 Bukayo Saka - 6 REUTERS 1/22 David De Gea - 6 Action Images via Reuters 2/22 Axel Tuanzebe - 5 EPA 3/22 Harry Maguire - 6 Action Images via Reuters 4/22 Victor Lindelof - 6 Manchester United via Getty Imag 5/22 Ashley Young - 6 AFP/Getty Images 6/22 Scott McTominay - 8 Action Images via Reuters 7/22 Paul Pogba - 6 Getty Images 8/22 Andreas Pereira - 6 Getty Images 9/22 Daniel James - 7 Manchester United via Getty Imag 10/22 Marcus Rashford - 6 REUTERS 11/22 Jesse Lingard - 5 AFP/Getty Images 12/22 Bernd Leno - 6 REUTERS 13/22 Calum Chambers - 5 Action Images via Reuters 14/22 David Luiz - 6 Getty Images 15/22 Sokratis - 6 Getty Images 16/22 Sead Kolasinac - 6 EPA 17/22 Granit Xhaka - 5 PA 18/22 Matteo Guendouzi - 7 Getty Images 19/22 Lucas Torreira - 5 REUTERS 20/22 Nicolas Pepe - 4 REUTERS 21/22 Pierre-Emerick Aubameyang - 7 EPA 22/22 Bukayo Saka - 6 REUTERS\n\n“That is something I think they need to work on. If Pogba is playing in this team, he needs to speed it up a bit.\n\n“He was seriously slowing it down, in the first 25 minutes just basically playing the ball backwards. For a player of his calibre that was disappointing. I don’t understand what his role in this team is.\n\n“Even when Ole made the substitutions and put Pogba further forward, not a lot happened. There were two very good passes in the game from Pogba but it’s two, it’s not 15.\n\n“And I see that as a problem. He takes up so much attention. It kind of feels like he’s a problem child in this team.”\n\nScott McTominay opened the scoring for United, who have failed to reach double figures after seven games for the first time in 30 years, but Pierre-Emerick Aubameyang equalised with a goal awarded by VAR.\n\nMcTominay was happy to score his first senior goal at Old Trafford but was disappointed to miss a glorious chance to put United back in front with a free header in the second half and feels United must be more ruthless.\n\n“I probably should have scored that header and that was disappointing,” he told MUTV.\n\n“There were a lot of different chances we had in the game and it is about us being more ruthless in front of goal now.\n\n“I thought we were good value for three points. It is little mistakes that we have to start cutting out because they cost you games, and points in this respect. Everyone in the dressing room knows it is a tough one to take because we were on top.”", "description": "Peter Schmeichel has labelled Paul Pogba a “problem child” for Manchester United and said he does not know what the midfielder’s role is. The World Cup winner overcame an ankle problem to start for United in their 1-1 draw with Arsenal on Monday night but was unable to stamp his authority on the game. Former United keeper Schmeichel was watching the game as a TV pundit, and", "authors": ["Adam Hamdani"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/01/14/paul-pogba-45.jpg", "published_at": "2019-10-01"}