{"pub": "theverge", "url": "https://theverge.com/2019/7/4/20682087/instagram-twitter-celebrity-30000-followers-advertising-standards-authority-uk", "downloaded_at": "2019-10-05 14:16:53.162564+00:00", "title": "Having 30,000 followers makes you a celebrity, UK advertising watchdog rules", "language": "en", "text": "The UK’s Advertising Standards Authority has ruled that 30,000 is the magic number of followers that makes you a celebrity. The decision means that if you have such a following then you have to obey the same advertising rules as traditional celebrities like David Beckham or Stephen Fry, particularly when it comes to product endorsements.\n\nThe regulator came to the decision after an Instagram user with 32,000 followers, ThisMamaLife, posted an ad for Phenergan Night Time sleeping tablets. Although they disclosed that the post was an ad at the beginning of its description, the ASA ruled that their follower count made them a celebrity, and thus banned from drug endorsements in the UK.\n\nCelebrities aren’t allowed to endorse medication under UK law\n\nInitially Sanofi, the drug company that had paid for the ad, argued that ThisMamaLife had a comparatively small following compared to more established celebrities. However, the ASA said that the rules apply to anyone with over 30,000 followers. For the ASA, anyone with 32 thousand followers or 32 million followers will be treated the same.\n\n“We noted Sanofi’s argument regarding the comparatively low number of followers ThisMamaLife had in contrast to notable celebrities,” the ASA said in its ruling, “However, we considered that over 30,000 followers indicated that she had the attention of a significant number of people. Given that she was popular with, and had the attention of a large audience, we considered that ThisMamaLife was a celebrity for the purposes of the CAP Code.”\n\nThe UK’s rules are a lot stricter than the US, where celebrities are freely allowed to endorse drugs. The main thing the FTC is concerned about is that people, regardless of whether they’re a celebrity or not, disclose when a post has been paid for by an advertiser. In 2017, it sent out letters to more than 90 “influencers and marketers” warning them about this requirement. However, these warnings don’t appear to have translated into action. In October last year, Morning Consult reported that despite only around a quarter of influencers following its rules, the FTC had not taken any public actions against those who weren’t compliant.", "description": "The one time it might be ok to obsess over your follower count", "authors": ["Jon Porter", "Jul"], "top_image": "https://cdn.vox-cdn.com/thumbor/2t5hA24z25gLqJXsGMvkpty7IlE=/0x144:2040x1212/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/8135981/akrales_170126_1421_A_0062.0.jpg", "published_at": "2019-07-04"}