{"pub": "reuters", "url": "https://ca.reuters.com/article/topNews/idCAKBN1W818C-OCATP", "downloaded_at": "2019-09-23 17:31:42.684526+00:00", "title": "TSX dips as growth worries weigh; First Quantum slumps", "language": "en", "text": "(Reuters) - Canada’s main stock index fell from record highs on Monday as fresh signs of weakness in the euro zone and worries about a U.S.-China trade deal kept investors on the sidelines, while shares in First Quantum Minerals Ltd (FM.TO) slumped 10% after the miner denied takeover talks.\n\nFILE PHOTO: A TMX Group sign, the company that runs the Toronto Stock Exchange (TSX), is seen in Toronto, June 23, 2014. REUTERS/Mark Blinch\n\n* First Quantum was the biggest decliner on the main index after it said it had no knowledge of any potential takeover bids but confirmed it was in talks with Jiangxi Copper (600362.SS) for a potential sale of a minority interest in its Zambian copper assets.\n\n* Shares of Osisko Gold Royalties Ltd (OR.TO) followed with a 7.2% fall after the miner said it would buy Barkerville Gold Mines (BGM.V) for C$338 million.\n\n* The weakness came despite domestic data showing an unexpected jump in July wholesale trade on stronger sales in the personal and household goods subsector, as well as motor vehicles and parts.\n\n* Stocks globally took a hit from a survey that showed euro zone business growth stalled this month, raising fears of a global slowdown. Canadian financial stocks were down .SPTTFS 0.5%.\n\n* Price of oil, one of Canada’s major exports, dropped due to the prospect of a faster-than-expected full restoration of Saudi oil output, dragging the energy sector .SPTTEN lower by 0.14%.\n\n* At 10:26 a.m. ET (1426 GMT), the Toronto Stock Exchange’s S&P/TSX composite index .GSPTSE was down 25.22 points, or 0.15%, at 16,874.47.\n\n* The materials sector .GSPTTMT, which includes precious and base metals miners and fertilizer companies, added 0.3% as gold futures GCc1 rose to over a one-week high.\n\n* With spot silver price XAG= up over 3%, top gainers on the TSX were MAG Silver Corp (MAG.TO) and First Majestic Silver Corp (FR.TO), both gaining about 5%.\n\n* The most heavily traded shares by volume were Black Iron Inc (BKI.TO), First Quantum and Aurora Cannabis (ACB.TO).\n\n* On the TSX, 116 issues were higher, while 118 issues declined for a 1.02-to-1 ratio to the downside, with 26.85 million shares traded.\n\n* The TSX posted five new 52-week highs and no new lows.\n\n* Across all Canadian issues, there were 22 new 52-week highs and five new lows, with total volume of 50.29 million shares.", "description": "Canada's main stock index fell from record highs on Monday as fresh signs of weakness in the euro zone and worries about a U.S.-China trade deal kept investors on the sidelines, while shares in First Quantum Minerals Ltd slumped 10% after the miner denied takeover talks.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190923&t=2&i=1432933410&w=1200&r=LYNXMPEF8M0V1-OCATP", "published_at": "2019-09-23"}