{"pub": "yahoo", "url": "https://finance.yahoo.com/news/4-reasons-delay-retirement-long-093500962.html", "downloaded_at": "2019-09-07 02:32:17.138822+00:00", "title": "4 Reasons to Delay Retirement as Long as You Can", "language": "en", "text": "When do you want to retire? If you've had a tough day at work or are sick of your job, your answer might be ASAP. But while retiring early and spending your days lounging around may seem like a dream life, there are a lot of reasons waiting to leave the workforce may make a whole lot of sense.\n\nIn fact, here are four ways that delaying retirement as long as possible could leave you better off mentally and financially.\n\nOlder woman in a green apron working at grocery store stocking shelves. More\n\nImage source: Getty Images.\n\n1. You can boost your Social Security benefits\n\nSocial Security benefits are an important source of income for many retirees, with half of married couples and 70% of unmarried persons getting at least half their retirement income from them. But you can make your benefits larger by delaying when you claim them.\n\nWaiting to claim Social Security benefits can make your monthly checks higher because you won't be subject to early filing penalties for retiring prior to full retirement age (FRA). You can also earn delayed retirement credits between full retirement age and age 70, which boost your monthly retirement benefit. FRA is between 65 and 67, depending on when you were born.\n\nYou can also boost your Social Security benefit if you wait because of the way it's calculated. The Social Security Administration looks at average inflation-adjusted wages in the 35 years your earnings were highest. If you don't have a work history spanning at least 35 years, some zeros are factored in. And if you earned little in the beginning of your career, you'll have some years included when your salary was very low.\n\nWorking longer allows you to remove years of $0 wages or to replace years of low earnings with much higher ones. This can provide a surprisingly big increase in monthly checks.\n\n2. You'll have more time to save\n\nWhen you're working and earning income, you can make tax-advantaged contributions to retirement accounts including IRAs and workplace 401(K) plans, if your employer offers one. This means the government helps you to boost your retirement savings by subsidizing your contributions.\n\nThere are annual limits to the tax-deductible contributions you can make, but those limits go up once you turn 50. The more years you work after hitting 50, the more you can contribute and the bigger the retirement nest egg you can build.\n\nEven if you're not maxing out retirement-account contributions every year, working just a few years longer could help you increase investments by tens of thousands of dollars, depending on how much you're able to invest annually. This can make a big difference in the amount you end up with when you leave the workforce.\n\n3. You won't need to rely on your savings for as long\n\nNot only can you contribute more to retirement accounts if you work a few extra years, but you can also delay the time when withdrawals start. Since you don't have to rely on your savings for as long, you'll need less money. And the longer you wait to start making withdrawals, the more time you have for your balance to grow.\n\n4. Work can help you stay active and engaged\n\nWorking helps people to maintain social connections, provides structure to their days, and presents mental challenges. For some people, early retirement can actually result in an increase in both physical and mental health issues, including depression, because of the resulting loss of structure and lifestyle changes.\n\nStory continues", "description": "Is early retirement really all its cracked up to be?", "authors": ["Christy Bieber", "The Motley Fool"], "top_image": "https://s.yimg.com/uu/api/res/1.2/d9nPPEdcB1SUZPYExrYRzA--~B/aD00NjY7dz03MDA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-US/homerun/motleyfool.com/5c1b5fb621ef94a8b7525f25a6856f96", "published_at": "2019-09-06"}