{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7548857/The-Fijian-resort-named-BEST-Australia-South-Pacific-region.html", "downloaded_at": "2019-10-09 01:25:22.196945+00:00", "title": "The Fijian resort named BEST in the Australia and South Pacific region", "language": "en", "text": "An exotic Fijian hotel has been named the number one resort in Australia and the South Pacific.\n\nNanuku, Auberge Resorts Collection was recognised as best in the region in Condé Nast Traveler's 2019 Readers' Choice Awards.\n\nSet on the coastline of Fiji's main island Viti Levu, Nanuku offers guests two miles of pristine white-sand beaches, genuine local experiences and adventure activities including jungle treks and a traditional tribal ceremony.\n\nPrices for a Beachfront Villa at Nanuku start at $918 AUD per night.\n\nThe Fijian resort of Nanuku, Auberge Resorts Collection (pictured) has been named the best in the Australia-Pacific region Condé Nast Traveler's 2019 Readers' Choice Awards\n\nNanuku boasts 37 intimate suites and residences, including 13 ultra-modern luxury beach villas, each with their own private plunge pool and outdoor terrace facing onto the beach.\n\nAs part of Fiji's 'adventure capital', Nanuku provides guests with a choice of more than 50 experiences.\n\nVisitors in search of romance can spend the night on the resort's private island, while more intrepid travellers can trek through lush jungle to swim in a three-pool waterfall.\n\nNanuku boasts 37 suites and residence, including 13 luxury villas, each with their own plunge pool and outdoor terrace facing onto the beach\n\nNanuku stretches across two miles of white-sand beaches and turquoise water along the coastline of Fiji's main island, Viti Levu\n\nTravellers are also given the chance to participate in a traditional Kava ceremony with a local tribe.\n\nKava ceremonies are an important aspect of Fijian village life and involve the guest presenting a gift of Yaqona - Kava root - to the head of the community, before sharing a drink together from a ceremonial wooden bowl.\n\nGuests can also do their part for the native Fijian ecosystem by planting coral with Nanuku's resident Marine Biologist and Environmental Guardian.\n\nThrill seekers can enjoy adrenaline-boosting sports like zip lining, white water rafting, kayaking and world-class surfing.\n\nGuests at Nanuku can avail of more than 50 experiences, including jungle treks to waterfalls and traditional tribal ceremonies\n\nChris Gabaldon, Chief Operating Officer at Auberge Resorts Collection, said it's an exciting time for Nanuku.\n\n'We are so honoured that Nanuku has been voted the number one resort in the Australia and Pacific region by Condé Nast Traveler's knowledgeable and well-travelled readers,' he said.\n\n'Authentic and dynamic Fijian adventures are what set Nanuku apart from the others in Fiji.\n\n'Our gracious staff treat every guest like family and we look forward to continuing to provide the exceptional service and one-of-a-kind experiences that leave visitors with a strong bond to Nanuku's people and blissful setting.'", "description": "The Fijian resort of Nanuku, Auberge Resorts Collection has been number one in the Australia and South Pacific region in the Condé Nast Traveler's 2019 Reader's Choice Awards.", "authors": ["Alice Murphy For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/06/19428266-0-image-a-24_1570512960851.jpg", "published_at": "2019-10-08"}