{"pub": "realclearpolitics", "url": "https://washingtonexaminer.com/opinion/dems-lost-in-n-c-just-weeks-after-decapitating-the-entire-dccc-leadership-because-it-was-too-white", "downloaded_at": "2019-09-12 07:12:26.809205+00:00", "title": "Democrats lost in NC just weeks after decapitating the DCCC's top staff for being too white", "language": "en", "text": "Last night, Democrats lost a very close House special election in North Carolina's 9th Congressional District.\n\nDan McCready, a top-shelf Democratic candidate and a Marine officer veteran who had nearly wrested the seat from Republicans in 2018, had been given a second bite at the apple thanks to a Republican consultant's illegal ballot harvesting during the 2018 election.\n\nWith that scandal still hanging in the air locally, and with Republicans nominating the author of the state's controversial ban on local gender ordinances (the so-called \"bathroom bill\"), the conditions seemed right for Democrats to pull off the victory.\n\nUnfortunately for them, however, the Democratic organization responsible for this race, the Democratic Congressional Campaign Committee, had its eye off the ball. Less than six weeks ago, after a nasty little fight between Democratic members of Congress, the DCCC's entire senior staff was abruptly purged for no reason other than it was perceived to be too white. And no, that's not a figure of speech or an exaggeration — the senior staff chosen by DCCC Chairwoman Cheri Bustos, D-Illinois, was forced out because they had been born as part of the wrong race.\n\nWe noted at the time it happened:\n\nIt appears that no one had anything against these particular staffers ... except for the color of their skin. Although roughly half the committee’s full-time staff (13 of 27) were nonwhite, this was not enough for some Democratic members of Congress. They complained DCCC Chairwoman Cheri Bustos of Illinois had brought in too many white staffers when she won the position. And they put enough pressure on her that she sacrificed her loyal staffers to the god of diversity.\n\nIf Democrats want to blame someone for the outcome of this congressional race, they should look in the mirror. Even if the beneficiaries of this racial purge are perfectly competent professionals, you can't just throw out the DCCC's top staff a month before an election and expect things to go off without a hitch.\n\nAfter a heartbreakingly close two-point loss last night in a low-turnout race that Democrats rightly believed they could win, they would be crazy to think this isn't a direct result of their own stupid decision to throw everyone out of a window just a few weeks before election day. This is where an ideological obsession with identity politics, at the expense of all practical considerations, is going to get you every time.\n\nTo reiterate: Democrats probably just lost a House seat thanks to their stupid, one-track-minded preoccupation with \"intersectionality\" and \"white privilege\" — the latter being a fancy term used by academics to lend respectability to judging other people based solely on racial stereotypes.\n\nWhen it comes to race, the Democratic Party has only a hammer, and as a result, everything looks like a nail to them. And as long as they keep along this path, the nation can only benefit from their obsessions continuing to cost them political power.", "description": "Last night, Democrats lost a very close House special election in North Carolina's 9th Congressional District.", "authors": [], "top_image": "https://mediadc.brightspotcdn.com/dims4/default/e9a7f39/2147483647/strip/true/crop/2290x1202+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2Fe6%2Fed%2F44c388a54b408366e0c74f64920d%2Fap-19254131514516.jpg", "published_at": "2019-09-11"}