{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/03/two-decades-later-nfl-peers-view-daniel-snyders-redskins-tenure-with-mix-worry-optimism", "downloaded_at": "2019-09-08 11:48:34.435279+00:00", "title": "Daniel Snyder dreamed of owning the Redskins. Two decades in, success remains elusive.", "language": "en", "text": "\n\nRedskins owner Daniel Snyder walks the sideline before a preseason game against the Falcons in Atlanta. (Jonathan Newton/The Washington Post)\n\nAs a boy attending Washington Redskins games with his family at RFK Stadium, a short distance from his home in Maryland’s Montgomery County, Dan Snyder would gaze across the field and peer into the owner’s box. Other kids daydreamed about playing on an NFL field. Snyder envisioned himself lording over one.\n\n“I’d just watch,” Snyder once said, “and imagine what was happening in there.”\n\nSince 1999, when he was 34 years old, Daniel M. Snyder has watched the Redskins from the seat of power about which he once fantasized. He might have the trappings of NFL ownership, but success remains no closer to him than when he sat in the stands.\n\nThe upcoming NFL season marks the start of Snyder’s third decade as Washington’s owner, an occasion to take stock of his impact on the franchise and examine the state of his stewardship. The Redskins have morphed under Snyder from one of the NFL’s crown jewels to a success-starved organization in persistent unrest, a franchise lacking in on-field accomplishment and seeking its first playoff win since January 2006, rife with off-field issues and facing the monumental task of building a new stadium — Snyder’s best opportunity to reenergize Washington’s fan base and revitalize his franchise.\n\n[A visual guide to 20 seasons of Daniel Snyder's Redskins ownership]\n\nInterviews with current NFL power players, former league executives and former Redskins employees, most of whom spoke on the condition of anonymity to offer a more frank assessment, depicted Snyder as a competitive businessman who remains driven to return the Redskins to the championship level of his childhood, but one no closer to understanding how to do so than in his younger, more imperious ownership seasons. They showed an owner who has receded from the NFL’s inner circle, whose insular personality has reduced his influence and willingness to fully engage on league matters.\n\nSome worried about the direction of a historic franchise in a crucial market, while others expressed optimism despite Snyder’s track record.\n\nThrough a spokesman, Snyder declined to be interviewed. In response to a request, the spokesman and a member of an outside public relations firm offered the possibility of speaking to Snyder, but on the condition the interview ran in full, in place of this story — an arrangement The Washington Post declined. Snyder rarely speaks in public and hardly ever grants interviews to media organizations.\n\nThe skeletal details of Snyder’s life would make many in his position a sympathetic figure: a local kid who made himself wealthy before middle age and devoted himself to restoring his beloved hometown team to greatness, only to find that the harder he tried to seize success, the more it slipped through his grasp.\n\nInstead, Snyder’s tenure helming the Redskins has cast him, to many fans, as an antagonist. The way the NFL views him and his franchise, like any relationship that lasts 20 years, is more complicated.\n\n\n\n“As long as Dan’s there, they don’t have a chance,” one former high-ranking Redskins official said. (Toni L. Sandys/The Washington Post)\n\n‘It’s just not being run properly’\n\nThis summer, as the Redskins sweated through training camp in the Richmond heat, John Kent Cooke steered his boat, Bernadette, off the rocky coast of Maine. He took a break from his relaxed seafaring and pulled out his cell to respond to a reporter’s message.\n\n“Unlike Snyder,” Cooke said, “I return phone calls.”\n\nCooke, 77, grew up loving the franchise more intimately than most anyone. He is the son of Jack Kent Cooke, the owner who led the Redskins to three Super Bowl titles over a quarter century. It was Cooke whom Snyder watched in the owner’s box, and it was Cooke’s estate from which Snyder purchased the Redskins for $800 million in 1999. His group beat out bidders that included Cooke’s son.\n\n“What’s happened over the 20-year period is that he has taken a franchise that has been universally respected in sports, not just the NFL, and proceeded to drag it down to mediocrity,” Cooke said. “It’s no longer one of the premier sports franchises in the United States.”\n\nRecent seasons have brought troubling external indicators — flagging ticket sales, opposing fans regularly invading FedEx Field, extensive personnel turnover on the franchise’s business side. The Redskins ranked 27th in the NFL in attendance last season and struggled to fill seats even after years of removing them, shrinking the stadium’s capacity.\n\n[A once-proud franchise, the Redskins are showing signs of foundational cracks]\n\nThe Redskins’ on-field performance places them near the bottom of the league. Their record under Snyder is 139-180-1, a .436 winning percentage. They won a playoff game in 1999, Snyder’s first season, and have only replicated the modest feat once, during the 2005 season. Since the NFL introduced its current divisional format in 2002, the Redskins have won two NFC East titles and finished last eight times.\n\n\n\nSnyder smokes a cigar and speaks with then-coach Norv Turner in July 2000. (Joel Richardson/The Washington Post)\n\nIn the eyes of some within the league, Snyder can turn the franchise around with a few tweaks and breaks. Those bullish on the Redskins pointed to the capricious nature of success. The Los Angeles Rams, multiple executives pointed out, were languishing in St. Louis four seasons ago, and now they are defending NFC champions on the verge of opening a transformative new stadium. Washington drafted quarterback Dwayne Haskins, an Ohio State star who attended Bullis School in the D.C. suburbs, in the first round this April, providing the team’s latest emblem of source.\n\n“You hit rough patches in your franchise’s tenure where things don’t go your way,” Dallas Cowboys chief operating officer Stephen Jones said. “But it just takes the right quarterback and coach and leadership. You look up, and you’ve got a great situation on your hands. … I’ve got nothing but respect for Dan and what he can get done there in Washington. He’s a visionary.”\n\nIn the view of many others, Snyder is the impediment to solving problems he created. League insiders described Snyder as an owner who has dialed back his involvement with football decisions, but one who still struggles to trust and listen to the people he hires, particularly when their opinions conflict with his.\n\n“As long as Dan’s there, they don’t have a chance,” one former high-ranking Redskins official said. “Even though the players are much better than they were … at the end of the day, everybody has to be beating on the same drum. If you’re not on your game [in the NFL], you’re going to get exposed very quickly. And that’s what’s happened to him.”\n\nThe totality of Washington’s decline under Snyder has gained the attention of many within the league. The Washington market, ripe with history and rich in political connections, has unique meaning. For years, Redskins tickets were scarce, a sign of prestige and pride. Last year the team finally acknowledged that for the first time in decades it no longer had a waiting list for season tickets.\n\n“If you’d have told me that the Redskins would have been an afterthought in the D.C. market, I would have told you you were crazy,” one NFL power broker said. “But you’re starting to see that. And it’s a concern.”\n\n\n\nSnyder shows off new video scoreboards and other upgrades to FedEx Field in 2010. (Marvin Joseph/The Washington Post)\n\nThe worry lies more in optics than finances. NFL teams make so much money from television rights fees — roughly $255 million per team, regardless of performance — that no one team’s financial performance can significantly affect another’s bottom line. Most owners shrug off the erosion of Washington’s fan base as another owner’s problem.\n\nTelevision money has also prevented Washington’s performance from affecting its franchise value. Last year, Forbes ranked the Redskins as the fifth-most valuable NFL franchise, valuing it at $3.1 billion. NFL insiders estimate the franchise would theoretically sell for closer to $3.5 billion to $4 billion.\n\n“It doesn’t really affect our revenue sharing these days,” one NFL owner said. “But it’s an important market. It’s a market we need to have a successful franchise.”\n\nThe Redskins’ performance under Snyder does rankle some fellow owners. Images of partially full stands can disappoint networks. Some peers worry the Redskins are not providing local fans an experience that builds good faith and future customers.\n\n“It’s more the perception of it,” the NFL power broker said. “You have a top-flight franchise that should be doing very, very well. But they’re not. … It’s just not being run properly.”\n\n\n\nNFL owners approved the sale of the Redskins to Snyder on May 25, 1999. (John McDonnell/The Washington Post)\n\n‘He’s a tough personality’\n\nCarmen Policy, a longtime NFL team executive and a member of the league’s finance committee in 1999, remembers watching Snyder walk into the room. Snyder was 34, and he came before the committee to end an arduous process. Snyder had stepped forward to lead a group of business executives who had the highest bid. Some of the NFL’s most powerful figures needed to meet and approve him.\n\n“He seemed like a kid,” Policy recalled.\n\nSnyder struck Policy as pleasant, far from arrogant. The vote to approve Snyder did not feel momentous. After the NFL’s owners welcomed Snyder, the league’s old guard tried to guide him.\n\n“The reason they paid attention to him — because normally they wouldn’t give him that much attention as a new owner, and especially a young new owner — is because the franchise is important,” Policy said. “It’s part of that Eastern gravitas that’s brought to the media with significant, significant rating impacts. It wasn’t so much Dan was that important. It was the Redskins are that important.”\n\n['Bethesda man to make bid for Redskins': How Daniel Snyder became an NFL owner 20 years ago]\n\nTwo decades later, Snyder is increasingly viewed as an outsider within the cushy confines of NFL ownership. He still participates at owners meetings, and when he does his input is seen as valuable, multiple people familiar with those meetings said. But he is less active on league matters than he used to be, those owners said, and less active than most owners.\n\nAn NFL spokesman did not make any officials from the league office available for an interview.\n\n“The league office doesn’t want to touch that guy with a 10-foot pole,” the NFL power broker said. “They know he’s just going to scream and yell and get mad. It’s like, what’s the point?”\n\nEven NFL peers who want to defend him, who view him as a committed business partner and a doting father of his two daughters and son, have difficulty overcoming his temperament. More than one person familiar with him described — or agreed with the description of — Snyder as someone who behaves the way a little kid imagines a rich person acts.\n\n\n\n“He just doesn't like a lot of the other owners, and he's a tough personality,” one high-ranking member of an NFL organization said of Snyder, shown here before a game in December. “I do know he cares about the Redskins and wants to win, and I think he's frustrated he doesn't know how to.” (Jonathan Newton/The Washington Post)\n\nA former executive of the league office said Snyder has tried to mold himself after one of his allies: Cowboys owner Jerry Jones. In 2017, Snyder’s affinity for Jones and his style came to the fore during the league’s national anthem controversy. The former league executive recalled Jones yelling at NFL officials who argued players should not be disciplined for kneeling during the national anthem, and who believed the league should not accede to President Trump’s rhetoric.\n\n“Dan would repeat what Jerry was yelling,” the former executive said. “Literally, he’d sit there yelling, ‘Yeah, that’s right!’ … He wants to be Jerry when he grows up. I think he looks at the swashbuckling Jerry Jones in Dallas and says, ‘Hey, I can do that, too.’ He watches what Jerry does and mimics it in a way that just doesn’t fit.”\n\nSnyder has alienated many around the league, and some former employees described him as an overly demanding boss, quick to lash out at minor miscues. A former administrative assistant described his life after working for Snyder as being comparable to having post-traumatic stress disorder. “If a day went by where he said thank you for something and didn’t yell at you, that was a pretty good day,” the former assistant said.\n\nBut others, in three interviews facilitated by the Redskins after The Post requested to interview Snyder, described him as a caring man who has been mislabeled. Rams Coach Sean McVay, who was previously Washington’s offensive coordinator, said Snyder recommended his hiring to Rams owner Stan Kroenke, a gesture he felt grateful for in a league in which many owners strive to keep their best coaches at any cost. Pedro Taylor, the father of Sean Taylor, the safety who in 2007 died from injuries sustained after he was shot in his home during a break-in, said Snyder still calls him multiple times a year “to check in and see how you are,” and that he counts on his support during holidays.\n\nJane Rodgers worked for Snyder and his wife, Tanya, for the past seven years, running the Washington Redskins Charitable Foundation. She grew emotional discussing how Snyder and Tanya, after learning that Rodgers’ 25-year old son, Sam, had been diagnosed with a brain tumor, helped Rodgers find a surgeon, arranged flights to Chicago and allowed Rodgers to continue working on her schedule.\n\n“It’s always been very hard for me to see things that are said about them,” Rodgers, who left the organization this summer to move closer to Sam, said through tears. “Because I just know a different side.”\n\nEven those who scorn Snyder do not doubt his business acumen, his intellect, his drive or his willingness to build a championship team.\n\n“He just doesn't like a lot of the other owners, and he's a tough personality,” one high-ranking member of an NFL organization said. “I do know he cares about the Redskins and wants to win, and I think he's frustrated he doesn't know how to.”\n\n\n\nSnyder stands on the field before a game against the Titans in Nashville in December. (John McDonnell/The Washington Post)\n\n‘You can’t get lucky’\n\nBy some measures, the Redskins have reached their most stable point under Snyder. Jay Gruden, entering his sixth season, is the longest-tenured head coach of the seven to hold the position full-time under Snyder. Bruce Allen has been Washington’s top executive, filling several roles and responsibilities, since 2009.\n\nAnd yet, personnel turnover has remained constant during Snyder’s 20 years. Last year, the Redskins lured marketing executive Brian Lafemina from the league office. Peers viewed it as a coup. One called Lafemina “a top-10 executive in sports.”\n\n\n\nBrian Lafemina, right, did not work for Snyder for long. (Ricky Carioti/The Washington Post)\n\nLafemina publicly acknowledged that the Redskins, as had long become obvious, no longer had a waiting list for season tickets. Regular season attendance at FedEx Field last season was down by nearly 24 percent as of December. Snyder fired Lafemina after eight months, effectively blaming him for Washington’s attendance drop. Following his departure, more than 40 business-side employees left.\n\nOne person close to Lafemina called his ouster “a perfect example” of Snyder’s refusal to hear uncomfortable truths. Multiple people familiar with the dynamic said Allen undermined Lafemina, treating him as a threat rather than an ally. Lafemina, now the chief business operator of the 2028 Los Angeles Olympics organizing committee, did not return messages seeking comment.\n\nWhile Allen has supporters across the league, several executives expressed confusion that Snyder has chosen him as the primary voice he’ll listen to. Under Allen’s leadership, the Redskins have gone 59-84-1, and last season fans launched a widespread social media campaign — #FireBruceAllen — calling for his ouster.\n\nIt is a relationship seemingly built on personal connection as much as professional. Multiple former Redskins employees said Allen and Snyder sometimes talk late into the night at Redskins Park over drinks, typically Coors Light for Allen and Crown Royal XR for Snyder.\n\n\n\nSnyder and Bruce Allen talk with actor Matthew McConaughey before a preseason game vs. Baltimore last month. (Patrick McDermott/Getty Images)\n\nThe rapid dismissal of Lafemina drew attention around the NFL for another reason: He had worked for years as a liaison between the league office and teams going through the process of building a new stadium, and many viewed him as an ideal executive to spearhead the search for the Redskins’ new home.\n\nThe task instead falls to Allen. The Redskins have contracted architecture firm Bjarke Ingels Group, but they have not hired outside help to navigate the political and financial issues pertaining to a new stadium. Their lease obligates them to play at FedEx Field through 2027, and the franchise prefers to open a new stadium the next season. The Redskins have had talks with D.C., Maryland and Virginia regarding a potential location, and they believe putting a stadium in Washington would be the optimal outcome.\n\nFor both the franchise and the NFL, the stadium pursuit is of vital importance.\n\n“We are competing with home entertainment, which is getting more attractive all the time,” said Steelers owner Art Rooney II, who chairs the NFL’s stadium committee. “Having a state-of-the-art stadium is critical for every franchise. Washington is a great market, but their fans expect the same treatment other fans are getting around the country. I think it’s definitely time to do something there.”\n\n[Bruce Allen says Redskins' stadium announcement could come 'within a year']\n\nRooney said he believes Allen’s connections, built over a life in football, put him in position to land a stadium. The Redskins have yet to inform the league of any specific plans, according to multiple people familiar with the situation, but that timing is not a concern. Teams typically go before the NFL to figure out financing four years before a stadium opens.\n\n“They can absolutely pull it off,” one high-ranking NFC executive said. “The fact they’re taking their time and being patient is a positive.”\n\n\n\nThe Redskins have contracted architecture firm Bjarke Ingels Group for their proposed stadium, but they have not hired outside help to navigate the political and financial issues pertaining to a new stadium. (CBS News/60 Minutes)\n\nNot everyone in the league shares the enthusiasm. One league insider familiar with the process expressed doubts Allen and Snyder possess the expertise to execute the complicated maneuvers needed to acquire an 180-acre tract of land and build a state-of-the-art structure that can compete with new stadiums that cost more than $1 billion. The NFL power broker worried Snyder doesn’t understand the complexity of the task.\n\n“I think there’s a zero percent chance they have a building by 2028,” the NFL power broker said. “With all of his past performances and past behavior, I just don’t see him saying: ‘You know what? I need to take a step back and hire an expert.’\n\n“You can get lucky and Dwayne Haskins can be the next Peyton Manning,” he continued. “It’s not likely, but it can certainly happen. You can’t get lucky and just get a stadium built in a major metropolitan area in the United States of America with having no background for how to build it and what to do.”\n\nStill, others are confident the Redskins can build a stadium that boosts Washington’s fortunes.\n\n“Dan is an NFL owner; he’s a marketer,” said Stephen Jones, who is on the stadium committee. “He understands business and how to generate revenue. We couldn’t have a better guy at the helm to lead the charge here.”\n\nSnyder’s visions now include another owner’s box, rising in the center of a swanky, futuristic arena. If those dreams come true, too, he could be nearing his 30th season as Washington’s owner. By then he would be into his 60s, and Snyder may have finally found what he has been looking for. Or he could still be where he is today, trying to make reality match his imagination.\n\nRead more:\n\nBrewer: Trent Williams’s relationship with Redskins is fractured, and there’s no going back\n\nSvrluga: Redskins fans are furious with Bruce Allen, and that’s just how Dan Snyder likes it", "description": "Since Snyder took over as owner in 1999, the franchise has seen declines in key areas, and his peers around the NFL view his tenure with a mix of worry and optimism.", "authors": ["Adam Kilgore", "Reporter Covering National Sports", "Adam Kilgore Covers National Sports For The Washington Post. Previously", "He Served As The Post'S Washington Nationals Beat Writer To"], "top_image": "https://www.washingtonpost.com/resizer/5rlu3DexyYsyHZK6AA-xSeBKby8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/OHHQ32PAKBDFLMT6JYYTYAJG74", "published_at": "2019-09-03"}