{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/granddad-75-breaks-both-arms-20746838", "downloaded_at": "2019-10-29 08:03:08.980355+00:00", "title": "Granddad, 75, breaks both arms on Mauritius holiday then dies on journey home", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA grandfather broke both his arms on holiday, then tragically died on the journey home.\n\nLouis 'Reg' Belcourt fell on May 28 this year shortly after arriving in Mauritius.\n\nThe 75-year-old was taken to a local clinic and treated for the double arm break, Kent Live reported.\n\nOn June 1 he had a second surgery on his shoulders which led to him developing complications.\n\nThree days later his stepdaughter Sephanie Belcourt spoke to him on the phone and realised he was suffering from post-op delerium.\n\nMr Belcourt, who was well known in Hythe, Kent as a former town councillor, took a turn for the worse when breathing problems put him on a ventilator.\n\n(Image: Getty Images)\n\nAn intubation tube was also placed into his windpipe to keep his airways open.\n\nRealising his condition was increasingly serious, family members flew out to be with the pensioner and began work on having him repatriated.\n\nThe process was slow and disrupted by a last minute change that required them to board a different plane.\n\nMr Belcourt was finally flown out of the country on June 15 amidst fears from doctors at the Mauritius hospital that prolonged intubation could lead to infections or complications.\n\n“They said the longer he was left there, the more liable he is for infection,\" Ms Belcourt told an inquest at Archbishop's Place in Maidstone, Kent.\n\nShe added: “What they feared would happen did happen.”\n\nAs the plane descended towards its planned stopover destination of Nuremberg, Mr Belcourt began to experience breathing difficulties.\n\nHis tidal volume - the amount of air displaced between normal inhalation and exhalation - was plummeting.\n\n(Image: KentLive/ WS)\n\nThose by Mr Belcourt's side sprung into action and started trying to resuscitate him while the plane neared the runway.\n\nAn ambulance and paramedics were waiting for him on the tarmac when the plane came to a halt.\n\nFurther attempts to resuscitate him proved unsuccessful however, and Mr Belcourt was declared dead.\n\nA post-mortem examination found the cause of death to be cardiomegaly - an abnormal enlargement of the heart which may have prevented it from pumping properly - and sepsis.\n\nThe fractures he sustained and the subsequent ventilation were recorded as a secondary cause of death.\n\nAssistant Coroner Jill Wood said: “He died as a consequence of prolonged ventilation following surgery for fractures from a fall.”\n\nDuring the October 23 inquest the court also heard that Mr Belcourt was also a skilled mariner and had been a sea captain.\n\nHe was married to Keren Belcourt, a councillor who also served as Hythe mayor. She died in 2014.\n\nThey had five children and thirteen grand-children between them.", "description": "Louis Belcourt from Hythe, Kent slipped and broke his arms while on holiday on the Indian Ocean island", "authors": ["Stela Gineva", "Milo Boyd", "Image", "Kentlive", "Ws", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20746870.ece/ALTERNATES/s1200/0_Dad-of-five-died-after-breaking-both-his-arms-in-a-fall-on-holiday-in-MauritiusEx-Hythe-town-counci.jpg", "published_at": "2019-10-29"}