{"pub": "usatoday", "url": "https://reviewed.com/home-outdoors/features/heres-the-best-place-to-put-your-thermostat-in-your-house?utm_source=usat&utm_medium=referral&utm_campaign=collab", "downloaded_at": "2019-10-30 04:15:45.467964+00:00", "title": "Your thermostat is probably in the wrong spot in your house", "language": "en", "text": "By clicking one of our links you're supporting our labs and our independence, as we may earn a small share of revenue. Recommendations are separate from any business incentives.\n\nIf there's one thing I pay attention to the most in my house, it's my thermostat. And I don't just pay attention to it—I'm obsessed with it. No one else is allowed to touch it and if it's accidentally set one degree higher or lower than what I deem acceptable, I (literally) won't be able to sleep.\n\nBut there's one thing I haven't considered when it comes to my thermostat: where it is in my house. And according to Consumer Reports and our own experts, that can make a big difference in how well (or how poorly) your thermostat works. Here's where you should be putting your thermostat, along with some of our favorite products to help you save on your energy bill.\n\nThe right place to put your thermostat\n\nFirst things first: Always put it on an interior wall for the most accurate reading. Choose a room that's commonly used (like the living room or main hallway) rather than an empty, drafty one (like the basement, which tends to be cooler) or a room on the very top floor (which may be hotter). Avoid placing your thermostat near windows or doors. Our senior scientist, Julia MacDougall, also cautions, \"It helps if your thermostat is not immediately next to a source of heat or cold, like an air vent or the oven, since that spot isn't necessarily going to be what the rest of the room experiences.\"\n\nADVERTISEMENT\n\nOne other thing to consider: how high you mount your thermostat on the wall matters. Since heat rises, it can impact your reading. A good rule of thumb is to mount it 52 to 60 inches off of the floor.\n\nHow to choose a thermostat for your home\n\nCredit: Sensi You can even control the Sensi when you're outside of your home's Wi-Fi network.\n\nSmart thermostats are all the rage right now—and for good reason. You can control many of them via your phone or your smart home speaker. They have a range of capabilities from scheduling to geofencing (setting location boundaries for the heating and cooling). There are a lot of things to consider when shopping for a thermostat, according to Julia. You'll need to know if you have the right internet requirements for a smart thermostat, how much functionality you want/need, and if you have a C wire (the \"common\" wire that is needed to install most smart thermostats).\n\nNot sure which model or brand is best? When we tested smart thermostats, our favorite was the Emerson Sensi Touch Wi-fi Thermostat. \"It hits the sweet spot of being easy to use and install, and having plenty of smart features that are incredibly useful,\" Julia explains. For instance, it connects easily to Amazon Alexa or Google Home and has an intuitive app that you can use to adjust your thermostat settings from anywhere.\n\nADVERTISEMENT\n\nGet the Emerson Sensi Touch Wi-fi Thermostat from Amazon for $146.71\n\nOther easy ways to save money on your energy bill\n\nCredit: Duck Brand Make your home more energy-efficient with these products.\n\nIt isn't all about your thermostat—there are other ways to cut your energy spending, too. Julia tried out some of the most popular products that claim to make your heating/cooling system more efficient and found a few that worked surprisingly well.\n\nHer top picks included the Duck Brand Window Kit, which is essentially cling film that seals your windows, and the Great Stuff Pro Foam Insulating Kit, which uses spray foam to close up cracks and holes so air doesn't get in (or out).\n\nGet the Duck Brand Shrink Film Insulator Kit from Amazon for $7.78\n\nGet the Great Stuff Pro Foam Insulating Kit from Amazon for $94.79\n\nThe product experts at Reviewed have all your shopping needs covered. Follow Reviewed on Facebook, Twitter, and Instagram for the latest deals, product reviews, and more.\n\nADVERTISEMENT\n\nPrices were accurate at the time this article was published but may change over time.", "description": "The placement of your thermostat in your home can impact how accurate your reading is and how well your thermostat works at heating your home.", "authors": ["October"], "top_image": "https://reviewed-com-res.cloudinary.com/image/fetch/s--nHOQGLYk--/b_white,c_limit,cs_srgb,f_auto,fl_progressive.strip_profile,g_center,q_auto,w_1200/https://reviewed-production.s3.amazonaws.com/1572377495620/Thermostat.png", "published_at": "2019-10-29"}