{"pub": "vice", "url": "https://vice.com/en_us/article/qvge3v/tiktok-the-app-without-time-is-testing-a-timestamp-feature", "downloaded_at": "2019-10-08 14:59:59.870340+00:00", "title": "TikTok, the App Without Time, Is Testing a Timestamp Feature", "language": "en", "text": "TikTok, an app for sharing 15 or 60-second videos, exists outside of time, as reported by Wired last week. Unlike Twitter, Facebook, or the roughly-analogous video platform Vine, users can’t tell exactly when videos were uploaded.\n\nOn one hand, as reported by Wired, the lack of a timestamp means that evergreen humor flourishes on the app. But also, this means news-of-the-day and time-sensitive content about protests doesn’t have much of a place on TikTok. The lack of timestamp also makes it easier for people to steal content from other users, as it can be hard to tell who actually published their content first.\n\nNow, TikTok is testing a time stamp feature for select users, Motherboard has learned. The time stamp, which was confirmed by TikTok, is available in the “Following” tab, meaning it only gives a publishing time to content from users people follow. It’s unclear if the report from Wired motivated the testing of the timestamp feature, as we don’t know precisely when testing began.\n\nImage: Screenshot taken by Motherboard, showing the time stamp in the Following tab.\n\nTikTok did not confirm whether TikTok is also testing a time stamp feature for content on the “For You” page, an algorithmic discovery feed with driven by an opaque recommendation algorithm. The For You page, and the unknown nature of how it works, drives both conspiracy theories and a unique set of memes to succeed on the app.\n\nA TikTok spokesperson said, \"We're always experimenting with new ways to improve the app experience for our users.”", "description": "TikTok, the explosively popular video app, is testing a time stamp feature in the “Following” tab of select users.", "authors": [], "top_image": "https://video-images.vice.com/articles/5d9bac7239335f000a940865/lede/1570483332868-tiktok-time.png?crop=0.9524xw:0.9991xh;0xw,0.0009xh&resize=1200:*", "published_at": "2019-10-08"}