{"pub": "news24", "url": "https://news24.com/Africa/Zimbabwe/zimbabwean-doctor-who-survived-suspected-kidnapping-leaves-for-south-africa-20190927", "downloaded_at": "2019-10-05 11:00:36.967191+00:00", "title": "Zimbabwean doctor who survived suspected kidnapping leaves for South Africa", "language": "en", "text": "A Zimbabwe doctor who survived a suspected kidnapping by state authorities last week has left the country for medical treatment in South Africa, a rights group said on Thursday.\n\nPeter Magombeyi, a doctor's union leader, was found 30km (18 miles) from his house in Zimbabwe's capital Harare last week. He was in a dazed state and had been missing for five days.\n\nDoctors accuse security forces of kidnapping Magombeyi for his role in organising strikes to demand better pay and working conditions.\n\nHundreds took to the streets last week to demand the authorities investigate their colleague's disappearance.\n\nMagombeyi - who has been recovering in a Harare hospital until now - was confined to his room by police officers despite a court ruling allowing him to seek treatment abroad.\n\nBut the court rejected an appeal by the police on Wednesday, granting Magombeyi freedom to leave the country.\n\nHuman Rights Watch (HRW) told AFP Magombeyi was on his way to neighbouring South Africa on Thursday.\n\n\"The plan was to quietly sneak out given the pressure,\" said HRW southern Africa director Dewa Mavhinga.\n\nAmnesty International had previously condemned the \"cruel denial of travel\" putting Magombeyi's \"health at risk\".\n\nRights groups say around 50 political opponents and unionists have been abducted in Zimbabwe this year.\n\nThe southern African country is still struggling with high inflation and fuel and food shortages after decades of economic crisis under former president Robert Mugabe, who died on September 6.\n\nstr-sch/har", "description": "A Zimbabwe doctor who survived a suspected kidnapping by state authorities last week has left the country for medical treatment in South Africa, a rights group said on Thursday.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9136/6ebffede585c4a0e8757a555ec1ba8a3.jpg", "published_at": "2019-09-27"}