{"pub": "yahoo", "url": "https://sg.style.yahoo.com/steven-cheung-paid-off-debt-032500457.html", "downloaded_at": "2019-10-24 04:32:37.539649+00:00", "title": "Steven Cheung has paid off debt to ex-girlfriend", "language": "en", "text": "24 Oct – Singer Steven Cheung recently confirmed that he has paid all his debts to ex-girlfriend and stage actress, April Leung.\n\nAs reported on On CC, the BOY'Z member, who accepted a phone interview from the media, shared that he used his own method to pay back what he owed the actress, after leaving her blind-sided over news of\n\nhis engagement and subsequent marriage to the mother of his baby, Au Man Man.\n\n\"I would always feel regret over the bad things that I have done. I sincerely apologise and would repent,\" he added.\n\nSteven also admitted that he still has to pay his debts to many others aside April, including his duo partner Kenny Kwan, and fellow EEG artistes Joey Yung and Charlene Choi.\n\n\"I had done so many wrong things in the past and had never admitted it. But now I will face everything. I will continue to move forward and take care of my family. I want to be a better person,\" he added.\n\nWhen mentioned that April recently admitted that she could not give him her blessings for his marriage and fatherhood for now due to what had happened between them, Steven responded, \"That's understandable.\"\n\nIt was back in July this year that Steven's cheating scandal made the headlines, following his decision to announce that he is engaged to be married to the mother of his child. The announcement shocked many, including April, who then revealed that the two of them were still together two days before he made the announcement.\n\n(Photo Source: Steven Cheung Instagram)", "description": "The singer says he has his own method in paying back what he owed April Leung", "authors": ["Heidi Hsia"], "top_image": "https://s.yimg.com/uu/api/res/1.2/GjeluGn2y7RfYEc0X9Kqfw--~B/aD03Njg7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/ybrand.cinema.com.my/06c9680e091bc3b975005068bda10782", "published_at": "2019-10-24"}