{"pub": "fox", "url": "https://foxnews.com/media/dave-rubin-trudeau-should-be-held-accountable-consistent-with-lefts-rules", "downloaded_at": "2019-09-20 05:10:46.990628+00:00", "title": "Dave Rubin: Trudeau should be held accountable, consistent with left's rules", "language": "en", "text": "Talk show host Dave Rubin said Thursday night on \"Tucker Carlson Tonight.\" that the left set up fake rules that are now haunting Canadian Prime Minister Justin Trudeau amid his blackface scandal.\n\nTrudeau came under fire Thursday after images emerged of him in blackface at a costume party. Trudeau apologized Thursday, but stopped short of saying whether there were more pictures or videos of him dressed up in skin-darkening makeup.\n\nOn \"Tucker Carlson Tonight\", Rubin defended the Canadian leader from claims he is racist -- but said he is being judged by harsh standards established by those on his side of the political aisle.\n\n“No one really thinks at this very moment that Justin Trudeau is a racist,” Rubin said.\n\nCNN'S DON LEMON KNOCKS TRUMP WHILE PRAISING JUSTIN TRUDEAU'S APOLOGY OVER BROWNFACE PHOTO\n\nBut, he added, \"he must now be taken down. … His own people have to take him down. … These are the rules that they have set.”\n\nTrudeau gave no sign that he might resign, and there were no immediate calls from any leading figures in his Liberal Party to step down. Instead, many Liberals, some of them people of color, rallied around him, even as two more instances of him wearing brown- or blackface decades ago came to light.\n\nAsked how many times he has worn blackface, Trudeau said, “I am wary of being definitive about this because the recent pictures that came out I had not remembered.”\n\nHe said that he has dedicated himself as a politician to “counter intolerance and racism everywhere I can,” and he confessed to letting people down.\n\n“I stand here today to reflect on that and ask for forgiveness.\"\n\nTime magazine published the first photo on Wednesday, saying it was taken from the yearbook from a private school in British Columbia where Trudeau worked as a teacher before going into politics.\n\nThe image is of Trudeau, then 29, at an “Arabian Nights” party in a turban and robe with dark makeup on his hands, face and neck. Trudeau said he was dressed as a character from “Aladdin.”\n\nRubin said if something similar emerged concerning someone on the right, the knives would be out.\n\nEarlier this year, Virginia Gov. Ralph Northam faced intense pressure to resign after a racist picture surfaced from his 1984 medical school yearbook page. At first, he denied being in the picture but then admitted to wearing blackface to portray Michael Jackson at a dance party in the 1980s. Since then, Virginia Attorney General Mark Herring has acknowledged wearing blackface in college, and Alabama Gov. Kay Ivey has publicly apologized for wearing blackface during a college skit more than a half-century ago.\n\nCLICK HERE FOR THE FOX NEWS APP\n\nTrudeau has long championed multiculturalism and immigration, with Canada, population 37 million, accepting more refugees than the U.S. under the Trump administration. Half of Trudeau’s Cabinet is made up of women, four are Sikhs, and his immigration minister is a Somali-born refugee.\n\n“Do we let him slide?” Rubin asked, questioning the moral authority of modern liberalism.", "description": "Talk show host Dave Rubin said Thursday night on \"Tucker Carlson Tonight.\" that the left set up fake rules that are now haunting Canadian Prime Minister Justin Trudeau amid his blackface scandal.", "authors": ["Frank Miles", "Frank Miles Is A Reporter", "Editor Covering Geopolitics", "Military", "Crime", "Technology", "Sports For Foxnews.Com. His Email Is Frank.Miles Foxnews.Com."], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/20/694940094001_6087865021001_6087858002001-vs.jpg", "published_at": "2019-09-20"}