{"pub": "zdnet", "url": "https://www.zdnet.com/article/with-nvidia-in-tow-laptop-makers-target-creative-pros-ai-developers", "downloaded_at": "2019-09-04 23:48:14.774186+00:00", "published_at": "2019-09-04", "title": "With Nvidia in tow, laptop makers target creative pros, AI developers", "language": "en", "text": "Nvidia's Quadro Virtual Workstation on GCP: Why it matters Edward Richards, director of solution architecture at Nvidia, explains how global teams can now leverage Nvidia's Turing architecture and RTX technology\n\nWorkstations typically designed for creative pros are increasingly being pitched to machine learning and artificial intelligence developers and data scientists.\n\nAcer and Asus launched new laptops and workstations designed for creative pros working with 3D and augmented reality as well as data scientists and AI developers.\n\nPrimers: What is AI? | What is machine learning? | What is deep learning? | What is artificial general intelligence?\n\nThe systems, announced at IFA in Berlin, highlight how Nvidia's Quadro GPUs are being used to move upstream for everything from video editing to data science.\n\nAcer rolled out new ConceptD Pro laptops running on Quadro RTX 5000 GPUs. The rundown includes:\n\nConceptD 9 Pro and ConceptD 7 Pro, which are designed for engineering simulation as well as video editing.\n\nConceptD 5 Pro, which is focused on computer assisted design and 3D content.\n\nConceptD 5, which has up to a GeForce RTX 2060 GPU.\n\nAsus launched the ProArt StudioBook One, which is another Quadro RTX based workstation that on the surface is for creative pros, but does give a nod to data scientists working on models and visualization of datasets.\n\nThese high-end systems are likely to get more play as more developers begin to target data science, machine learning and AI applications. The creative pro market is lucrative--for instance Acer's ConceptD 9 Pro will start at $5,799 in November--but the data intensive computing market will be bigger.\n\nThese high-end systems are going to pair Intel and Nvidia processors and offer plenty of horsepower. For a company like Acer, these pricey systems also can balance out the lower-end of the market. Acer also rolled out Chromebooks at IFA as did Lenovo. For its part, Intel also has its Project Athena effort, which is aimed at creating laptops that have better battery life and can compete with Qualcomm based systems.", "description": "The workstation market for creative pros and data scientists and AI developers is starting to merge.", "authors": ["Larry Dignan"], "top_image": "https://zdnet3.cbsistatic.com/hub/i/r/2019/09/04/8be5019a-1e8d-4000-87d7-ec2b40acf8af/thumbnail/770x578/6ad28f7177b7ebe2deb6f5f2b36ea14b/acer-nvidia-intc.png"}