{"pub": "indiatimes", "url": "https://indiatimes.com/sports/what-a-throw-shot-putter-tajinder-pal-singh-toor-breaks-his-own-national-record-at-athletics-championships-377706.html", "downloaded_at": "2019-10-13 08:48:01.658611+00:00", "title": "What A Throw! Shot Putter Tajinder Pal Singh Toor Breaks His Own National Record At Athletics Championships", "language": "en", "text": "Shot Putter Tajinder Pal Singh Toor bettered his own national record in the 59th National Open Athletics Championships on Saturday.\n\nThe 24-year-old Toor created a new national record with a throw of 20.92m in the men's hot put event in Ranchi. In doing so, he broke his own previous record of 20.75m which he created at the Asian Games in Jakarta last year. His farthest throw came in his third attempt.\n\nAfter a half-hour delay caused by heavy rain, Toor warmed up with a put of 20.41m, just 2cm short of his season's best that he managed during the World Championships in Doha on October 3.\n\nPhoto: AFI\n\nHe followed that up with a 20.29m effort before uncorking the biggest throw yet by an Indian and raising his arms in triumph as soon as he knew he had got a new national mark.\n\nDon't Miss 129 SHARES 1.5 K SHARES 1.1 K SHARES 525 SHARES\n\nOn his subsequent attempts, he egged himself on to try and get 21.10m - the Olympic Games qualifying standard, but without any success.\n\nPhoto: AFI\n\n\"I was in good rhythm today. I was aiming 21.30 to 21.40 and I think it crossed that in the last throw but unfortunately it was a foul. I will try again to qualify for Olympics at the World Military Games in Wuhan, China later this month. It will be a good competition at Wuhan,\" Toor told PTI.\n\nThe shot putter, who hails from Moga, Punjab will now be in action at the Military Games in Wuhan, China, and he will look to breach the 21m mark.\n\n(With Inputs From PTI)", "description": "Shot Putter Tajinder Pal Singh Toor bettered his own national record in the 59th National Open Athletics Championships on Saturday. The 24 year-old Toor created a new national record with a throw of 20.92m in the men's hot put event in Ranchi. In doing so, he broke his own previous record of 20.75m which he created at the Asian Games in Jakarta last year.", "authors": ["Basit Aijaz"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/tajinder_pal_singh_toor_1570944008_800x420.jpg", "published_at": "2019-10-13"}