{"pub": "cryptonews", "url": "https://cryptonews.com/exclusives/this-is-how-brexit-might-affect-bitcoin-4892.htm", "downloaded_at": "2019-10-19 10:47:35.644547+00:00", "title": "This is How Brexit Might Affect Bitcoin", "language": "en", "text": "Source: Ross Papas on Unsplash\n\nDepending on who you ask, Brexit will affect every aspect of British life. But how will the UK leaving the EU affect the bitcoin market? And in particular, how will it affect the BTC/GBP market?\n\nWell, the answers to these questions depend largely on whether or not the UK will crash out of the EU without a deal on October 31. If it does, it's likely that the value of the British pound will decline significantly on currency markets. Will the Brits and other holders of GBP flock towards bitcoin as a safer haven? No one knows, as bitcoin still lacks strong proofs that it might act as a hedge, especially in developed markets.\n\nHowever, if a deal is approved by the UK parliament at the eleventh hour, then it's equally likely that sterling could rally. As such, there will be even less impetus for traders to convert their pounds to bitcoin, and less of a speculative 'Brexit bounce' for crypto more generally.\n\nNo-Deal Brexit\n\n\"A no-deal Brexit would shake confidence in the pound and send investors into a panicky search for safe-haven assets,\" explains cryptocurrency expert and author Glen Goodman, speaking to Cryptonews.com.\n\nAs of writing, the UK government has secured a new withdrawal agreement with the EU, but the chances of a no-deal Brexit are still high. The agreement has to be voted for by a majority in Parliament today (debates start at 08:30 UTC, you can watch it here) which is unlikely to happen, given the Conservative government's minority status. (Check the Brexit guide by BBC on possible voting scenarios).\n\nIn either case, markets reacted to the new agreement positively and GBP rallied against USD, reaching the level last seen in May 2019.\n\nGBP/USD chart:\n\nSource: Google\n\nHowever, Goodman explains that the U.S. dollar would most likely be the major beneficiary of any panic caused by a no-deal Brexit. Still, gold and bitcoin would also likely witness price gains in the event of a GBP dive.\n\n\"For investors, the problem with no-deal is it makes the future for Britain much more uncertain, and of course markets hate uncertainty,\" Goodman adds.\n\n\"This doesn't mean nobody will want to invest in the UK anymore, but it does mean that investors will be looking to hedge their sterling risk with non-correlated assets such as Bitcoin, because it's an asset that doesn't depend on the future of the British economy.\"\n\n__________\n\nGBP/BTC daily average flow, in millions USD:\n\nJuly: 55\n\nAugust: 52\n\nSeptember: 46\n\nOctober: 36\n\nSource: Coinlib.io, Cryptonews.com\n\n________\n\nOther analysts and experts are in agreement with Goodman on this. CommerceBlock CEO Nicholas Gregory said in August, \"Bitcoin has rediscovered its mojo this year with multiple mini surges but a no-deal Brexit could see a massive and unprecedented breakout.\"\n\nImportantly, Gregory points out that a no-deal Brexit would likely impact confidence in the euro as well as the pound, meaning that the bitcoin market would witness increased demand from two separate sources.\n\n\"Not only will a no-deal departure from the EU create turmoil and volatility across two major fiat currencies, it will also trigger an identity crisis for the global system as the contingency and vulnerability of major global fiat currencies is laid bare.”\n\nIdentity Crisis\n\nThis last point is important, because aside from increasing short-term demand for bitcoin, a no-deal (or badly managed) Brexit would likely have the longer term impact of weakening public faith in fiat currencies, which are strongly associated with the fortunes of national governments and economies.\n\nAnd in concert with inflationary monetary policy in general, Glen Goodman suggests that the overall effect of Brexit might be a strengthening of the view that fiat currencies are inherently unreliable, and that bitcoin (or other cryptocurrencies) are the best way to go.\n\n\"Brexit has hammered home the realization that most major governments don't care about having a 'strong' currency anymore,\" he says.\n\n\"Indeed, they see having a weak currency as an opportunity to boost their export industries. This nonchalance is leading to a race-to-the-bottom, with loose monetary policy used as a way to devalue national currencies and compete in the ongoing currency war.\"\n\nSignificantly, Goodman believes this situation will only get worse with each additional global or regional recession, which will have the cumulative effect of shaking investors' faith in national currencies.\n\n\"If all national currencies continue to fall together, alternatives like bitcoin will look more and more attractive. Bitcoin can't be endlessly printed, there is a finite supply hard-coded into the network. This rule might as well be inscribed on tablets of stone. No national currency can boast such a guarantee of fixed supply, and I think Bitcoin's guarantee will look more and more impressive in the future, compared to incontinent national currency printing.\"\n\nDeal-Based Brexit or Remain\n\nOf course, given that a (superficially) new exit deal has just been negotiated by the UK and the EU, there's still a chance that a no-deal Brexit could be averted. At the same time, the weakened, minority status of the UK government also creates scope for Parliament to vote for a second referendum, which might result in a Remain vote.\n\nAnd in either of these cases, Glen Goodman expects the pound to rally, although in the case of a deal Brexit, the pound still might slip if the market believes the deal to be a bad one.\n\n\"In a deal-based Brexit or a Remain scenario, we can expect confidence in the pound to rise, as it has done every time hopes of a deal have risen,\" he explains.\n\n\"The cancellation of Brexit altogether would probably cause the pound to rise significantly. All of these moves in the pound would, of course, have a negative impact on BTC/GBP.\"\n\nBut in the end, even if markets approve of Brexit's outcome, recent global history would indicate that the next crisis is only just around the corner. And with it, bitcoin is likely to rise even further.", "description": "No-deal Brexit would shake confidence in the pound, deal or remain would strengthen the pound.\r The overall effect of Brexit might be a strengthening of the view that fiat currencies are inherently unreliable.", "authors": ["Simon Chandler"], "top_image": "https://cimg.co/w/articles/0/5da/ab85a90445.jpg", "published_at": "2019-10-19"}