{"pub": "wsj", "url": "https://wsj.com/articles/bird-populations-plummet-in-north-america-11568930443?mod=rsswn", "downloaded_at": "2019-09-19 23:06:17.924127+00:00", "title": "Bird Populations Plummet in North America", "language": "en", "text": "Bird populations across North America—from common sparrows to threatened species—have plummeted over the last five decades, according to an expansive new study sending shock waves through the research community.\n\nNorth America’s overall bird population has dropped 29% since 1970, with about 3 billion fewer birds now than nearly 50 years ago, according to a study published Thursday in Science.\n\nDescribed as unprecedented by researchers and scientists, the findings display a new and unexpected assessment of the bird population across the continent. The research also is a grim indicator of the overall health of the environment and reflects what may be occurring in other less closely observed animals, said Ken Rosenberg, a conservation scientist at the Cornell Lab of Ornithology who was the study’s lead author.\n\n“Birds are literally the canary in the coal mine,” he said.\n\nThe loss was particularly profound for grassland birds—which include more common species like sparrows and finches—with its population falling 53%. The decline of these birds, known for their adaptability to human landscapes, in particular surprised researchers.\n\nRelated Stories Manhattan’s Hawk Population Is Soaring\n\nSystematic Estimates of Bird Populations Prove Challenging\n\nFlying High: Research Unveils Birds’ Learning Power\n\n“If we can’t keep those populations healthy, then something’s really wrong,” Dr. Rosenberg said. “It puts a punctuation mark on it.”\n\nThe reasons for the decline are hard to pinpoint because there may be many and the causes differ from one species to another, researchers have said. “There is no Holy Grail,” said Nicole Michel, senior quantitative ecologist at the National Audubon Society, a nonprofit conservation group.\n\nBut generally speaking, researchers attribute the decline to the broader impact of climate change, deforestation and shifts in agricultural practices. Habitat loss and the use of pesticides had an impact on grassland birds in North America and their decline, the study says.\n\nA sparrow perches in a tree in New York's Central Park. Photo: Lucas Jackson/Reuters\n\nIn North America, researchers had a hunch the bird population may be steadily declining due to anecdotes from bird watchers and guesses among scientists, said Dr. Rosenberg. But, before now, they didn’t have the numbers to prove it.\n\nResearchers tracked population changes for 529 bird species—or, about 76% of breeding species—in the continental U.S. and Canada using data that spanned up to nearly five decades. Of those species, 419 experienced population loss, while 100 showed small increases. To track these birds, researchers used several bird-monitoring data sets and, separately, 143 weather radars used to track their migrations.\n\nWhen they first discovered the net population loss through this process, “it took a lot of work from that point on to make sure we could justify our numbers,” Dr. Rosenberg said.\n\nThe findings in North America reflect similar declines in bird populations globally, like those of farmland birds in Europe, the study said.\n\nPopulations for waterfowl and raptors instead saw increases over this nearly 50-year-period, likely due to changes in policy in hunting and for insecticides like DDT, the study said. The National Audubon Society is calling for the implementation of restoration acts and environmental protections in an effort to see similar rebounds among the rest of these bird populations.\n\nNow, researchers are shifting their focus on the specifics: where, how and why these bird species are declining—and what can be done about it.\n\n“It’s really waking up the research community,” Dr. Rosenberg said.\n\nWrite to Jennifer Calfas at Jennifer.Calfas@wsj.com", "description": "North American’s bird population has dropped by about 3 billion since 1970, says new study, a grim indicator of environmental health", "authors": ["Jennifer Calfas", "Jennifer.Calfas Wsj.Com"], "top_image": "https://images.wsj.net/im-108892/social", "published_at": "2019-09-19"}