{"pub": "breitbart", "url": "https://breitbart.com/radio/2019/10/24/exclusive-louie-gohmert-shocked-to-discover-witnesses-in-schiffs-super-secret-scif-are-told-their-testimony-is-unclassified", "downloaded_at": "2019-10-24 23:49:36.714635+00:00", "title": "Exclusive – Gohmert Reveals: Schiff's Super-Secret SCIF Unclassified", "language": "en", "text": "Despite being held in a sensitive compartmented information facility (SCIF), Rep. Adam Schiff’s (D-CA) “impeachment inquiry” targeting President Donald Trump is actually unclassified, revealed Rep. Louie Gohmert (R-TX) in a Wednesday interview on SiriusXM’s Breitbart News Tonight with hosts Rebecca Mansour and Joel Pollak.\n\nSchiff, who chairs the House Intelligence Committee which is conducting the “impeachment inquiry,” is instructing ostensible witnesses their testimony is unclassified.\n\n“I thought they were pretending to hear classified information, and that’s why they had to do it in this super-secret SCIF,” Gohmert said. “It turns out that every person who has testified as part of this bogus against-the-rules impeachment inquiry [has been] instructed as they begin their testimony — I didn’t find this out until I got in the room and started to talk to some of the members in there about what had gone on without us — [that their testimony is unclassified].”\n\nGohmert continued, “[Adam Schiff] always tells the witness before they start to testify, ‘Look, we’re in a SCIF, but this hearing — this testimony you’re going to give — is unclassified. So it’s unclassified, if somebody asks you something the answer to which you think might be classified, then you can just tell us you can’t answer it [because] it might be classified,’ which, to me, sounds like [Adam Schiff] telling them, ‘Hey, anything that makes you uncomfortable, just say it’s classified and you don’t have to answer it.'”\n\nLISTEN:\n\nThe Schiff-run “impeachment inquiry” should be transparent, Gohmert determined.\n\n“But I was shocked to find out they were conducting this as an unclassified testimony, in which case there is absolutely no reason not to allow every member of Congress to hear it, not to allow it on C-SPAN,” Gohmert stated. “It is outrageous.”\n\nLikening the secretive nature of the “impeachment inquiry” to a grand jury is a “bad metaphor,” explained Gohmert.\n\n“I heard our majority leader, Steny Hoyer, on the floor of the House tonight, say that this was like a grand jury,” Gohmert recalled. “Well, let me tell you, I have impaneled many grand juries. I’ve been before grand juries as a prosecutor, and I’m telling you, a grand jury has to allow every single voting member of the grand jury to hear all the testimony. I think it’s a bad metaphor,”\n\nGrand jurors “hear everything,” noted Gohmert, contrasting grand jury standards in the context of criminal justice to the majority of elected representatives being denied access to the Schiff-run “impeachment inquiry” in the context of an impeachment vote in the House of Representatives.\n\n“Grand juries hear things in secret, and then they have their vote, and then we find out what happened,” Gohmert remarked. “Every grand jury that’s going to vote gets to hear everything. If that doesn’t happen, then we’ll just get rid of that panel and get another grand jury. Every single member of Congress has a right to vote on whether or not to approve the charges. … But everybody gets to vote, and everybody that votes gets to hear every word. This is a sham.”\n\nActing U.S. Ambassador to Ukraine William Taylor‘s testimony during the “impeachment inquiry” amounts to unreliable hearsay, Gohmert explained, drawing on Taylor’s military service.\n\n“I don’t know any commander worth his or her salt that would accept a witness coming in and saying, ‘Ma’am, this person told me that — although he was speculating — he thinks this other person may have said this,’ Gohmert said. “The commander would throw him out of the office, throw him out of the tent. They would never allow that kind of thing. You don’t allow that to be what gets somebody indicted or charged, either.”\n\nGohmert went on, “If you look at Taylor, even in his opening statement, he admits he had no firsthand knowledge, [and] that he got this from somebody else who said, ‘Look, I’m just speculating on this.’ My word. You’re going to destroy a country, create a civil war, throw a man who was duly elected out of office, because some guy that at one time was honorable — served the country — has now shown he has no honor in coming before a body and saying, ‘Well, I heard this from somebody that heard something that they think might have been this.’? Are you kidding me?”\n\n“This once honorable soldier certainly wasn’t honorable yesterday when he came in and testified,” added Gohmert.\n\nSchiff’s “impeachment inquiry” is predicated on hearsay, Gohmert said.\n\n“The people that have testified, like Taylor, that they heard something from somebody that heard something from somebody else, then they went and told others,” Gohmert stated. “I’m sure that [Adam Schiff] is going to want to bring in everybody they told what they heard somebody else heard, and we’re going to keep going ’til we get tenth-, or eleventh-, or twelfth-hand hearsay.”\n\nThe “so-called whistleblowers” used by Schiff and his news media allies are “gossip-mongers” who are “[putting] the country on the brink of [destruction] based on multiple layers of hearsay,” added Gohmert.\n\n“This guy doesn’t know anything first-hand,” said Gohmert of Taylor. “It’s all speculation from others who are speculating. That’s no way to do justice. [It’s] even Orwellian. My chief of staff [said] it’s Kafkaesque. … It’s so Kafka-esque.”\n\nBreitbart News Tonight broadcasts live on SiriusXM Patriot channel 125 weeknights from 9:00 p.m. to midnight Eastern or 6:00 p.m. to 9:00 p.m. Pacific.\n\nFollow Robert Kraychik on Twitter @rkraychik.", "description": "Despite being run in a SCIF, Adam Schiff's impeachment inquiry is actually unclassified, revealed Louie Gohmert.", "authors": ["Robert Kraychik"], "top_image": "https://media.breitbart.com/media/2019/10/schiff-entering-640x335.jpg", "published_at": "2019-10-24"}