{"pub": "politico", "url": "https://politico.com/story/2019/09/03/ruth-bader-ginsburg-court-1479994", "downloaded_at": "2019-09-04 03:45:29.065611+00:00", "title": "RBG recalls ‘lonely’ days on bench", "language": "en", "published_at": "2019-09-03", "text": "Supreme Court Justice Ruth Bader Ginsburg. | Manuel Balce Ceneta/AP Photo Legal RBG recalls ‘lonely’ days on bench\n\nFor almost three years, Justice Ruth Bader Ginsburg was the only woman on the U.S. Supreme Court, and “it was a lonely position,” she said on Tuesday.\n\nJustice Sandra Day O’Connor, the first female justice, retired in 2006. After that, the makeup of the court felt off, Ginsburg told a crowd in North Little Rock, Ark.\n\nStory Continued Below\n\n“There was something wrong with the picture,” she continued. “The public would see these eight rather well-fed men coming on the bench ...”\n\nGinsburg was cut off by loud laughter and applause that lasted several seconds before she could speak again: “and then there was this rather small woman.”\n\nAt an event Tuesday night hosted by the Clinton Foundation and Clinton School of Public Service, Ginsburg recalled sometimes feeling overlooked — from her time as a law faculty member to her time as the sole female justice.\n\nShe would make a comment. No reaction. Then one of her male colleagues would say the same thing, Ginsburg said, and people would respond, “That’s a good idea. Let’s discuss it.”\n\n“You don't expect very much from women, so you kind of tune out when she speaks. But you listen when a man speaks,” she said. “Now that I have two sisters in law, it doesn't happen.”\n\nPOLITICO Playbook newsletter Sign up today to receive the #1-rated newsletter in politics Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nThe appointments of Justices Sonia Sotomayor and Elena Kagan, in 2009 and 2010 respectively, changed things. They were the opposite of “shrinking violets,” Ginsburg said, and some of the challenges she and O’Connor experienced began to ease. That made her optimistic for the future, she added.\n\nGinsburg was one of nine women in her class at Harvard Law School, co-founded the Women’s Rights Project of the American Civil Liberties Union in 1971 and argued several gender discrimination cases, one of which was the focus of the biographical legal drama “On the Basis of Sex.”\n\nThe justice spent the night sharing anecdotes of her historic career. She talked about her camaraderie with O’Connor and her decades-long friendship with late Justice Antonin Scalia.\n\nShe touched on her first meeting with former President Bill Clinton, who introduced her at the Tuesday event: “I've had the experience with some men that they have certain discomfort talking to a woman. That was not that way with President Clinton.”\n\nAnd she again reaffirmed her health after finishing radiation therapy less than two weeks ago for pancreatic cancer. Ginsburg, who has battled various illnesses over the years, said following a standing ovation: “I am feeling very good tonight.”", "description": "Ruth Bader Ginsburg looks back on years of working with “eight rather well-fed men.”", "authors": ["Rishika Dugyala"], "top_image": "https://static.politico.com/f5/44/4b34ddf4461da0d4bd31a58a6525/20190903-rbg-sits-ap-773.jpg"}