{"pub": "news24", "url": "https://news24.com/Analysis/friday-briefing-how-the-da-lost-its-way-20191010", "downloaded_at": "2019-10-11 03:59:16.042423+00:00", "title": "Friday Briefing: How the DA lost its way", "language": "en", "text": "The unravelling DA\n\nThey say hindsight is 20/20 vision. Never has it been better illustrated than after the DA's general election performance this year. All its chickens of the previous 18 months came home to roost and have now spilt over into a full public blow-out.\n\nRecent developments have exposed deep seated divisions in the party on which direction it should take ideologically to renew its legitimacy as an opposition party capable of winning elections. The clash between racial nationalists and democratic liberals in the party has now prompted former party leader Helen Zille to throw her hat back into the ring for the position of federal party chairperson. As Zille said in an interview with News24 this week, \"The DA has been through a tumultuous and difficult period. We need to go through sincere introspection and reconnect with our voters… There is an enormous amount of background work to be done in order to re-establish this platform.\"\n\nThe differences between the two schools of thought in the party are big and only one will likely survive. In this week's Friday Briefing Pieter du Toit traces the party's roots all the way back to the first election it participated in and sets out where and how these divisions set in. Mpumelelo Mkhabela diagnoses the party's biggest problems and DA Youth Leader Luyolo Mphithi argues that the DA is not in crisis, but rather experiencing normal growing pains.\n\nAlet Janse van Rensburg\n\nOpinions editor\n\nRace, redress and liberalism: How the DA lost its way\n\nPieter du Toit\n\nHelen Zille's return to DA politics is an unabashed challenge to the Mmusi Maimane doctrine. There are stark differences between two prevailing schools of thought in the party. Only one will survive.\n\nREAD MORE", "description": "", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8774/f345e0f94c8d4f93a1ac3429b4b227c2.jpg", "published_at": "2019-10-10"}