{"pub": "metro", "url": "https://metro.co.uk/2019/10/10/dani-ceballos-u-turn-arsenal-future-wants-real-madrid-return-10897892", "downloaded_at": "2019-10-10 18:46:12.331571+00:00", "title": "Dani Ceballos in U-turn over Arsenal future and wants Real Madrid return", "language": "en", "text": "The Spaniard has clarified that he still intends to prove himself at the Bernabeu (Picture: Getty)\n\nDani Ceballos says he is not considering leaving Real Madrid permanently and remains determined to establish himself with the Spanish giants once his Arsenal loan is over.\n\nThe 23-year-old has impressed since moving to north London and recently said he was ‘very happy’ with the Gunners after a difficult spell at Real, hinting at the possibility of staying beyond his season-long loan.\n\nCeballos was given few opportunities by Zinedine Zidane, whereas he has played eight times in the Premier League already and quickly earned Unai Emery’s trust.\n\nCeballos was far from happy with his lack of game time at Real (Picture: Getty)\n\nWhile Ceballos is thrilled to be getting more consistent game time ahead of next summer’s European Championships, it may not be enough to keep him at Arsenal.\n\nAsked about not enjoying his time at Real, Ceballos clarified to Radio MARCA: ‘My words were misunderstood. When I do not play, I don’t enjoy myself.\n\nAdvertisement\n\nAdvertisement\n\n‘I have learnt a lot in these two years at Real Madrid, but now I am enjoying [my football].\n\n‘I knew that it was an important year, the coach [for Spain, Robert Moreno] has doubts and the one who doesn’t play isn’t going to be called up; it was a good time to go out on loan. With [Unai] Emery’s confidence, I may have a chance of going to the Euros.’\n\nOn whether he wants to return to Real, he stated firmly: ‘I never thought of leaving permanently. My goal is to succeed at Real Madrid. I’m going to fight to fulfil my dream.’\n\nCeballos was full of praise for Emery and Arsenal but still wants to return to Real (Picture: Getty)\n\nHe continued: ‘A player is not happy if he doesn’t play, but when he feels important and does, then he is happy.\n\n‘Obviously I have been at Real Madrid, I have learnt from the best and I have won trophies, but it is easier when you play matches. I’m happy and I feel important [at Arsenal], with room for improvement to play at the Euros next year.’", "description": "Dani Ceballos says he is not considering leaving Real Madrid permanently and remains determined to establish himself with the Spanish giants once his Arsenal loan is over. The 23-year-old has...", "authors": ["Metro Sport Reporter"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1168593739_1570726647.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-10"}