{"pub": "yahoo", "url": "https://news.yahoo.com/1-key-u-diplomat-underscores-141550154.html", "downloaded_at": "2019-10-18 01:20:40.037880+00:00", "title": "UPDATE 7-White House acknowledges strings attached in Trump withholding Ukraine aid", "language": "en", "text": "* Trump had denied \"quid pro quo\" in U.S. aid to Ukraine\n\n* U.S. EU envoy testifies in House impeachment inquiry\n\n* Envoy says Trump had Giuliani coordinate Ukraine policy (Adds Mulvaney statement walking back remarks, Cooper testimony next week, Perry resignation plan)\n\nBy Jeff Mason and Karen Freifeld\n\nWASHINGTON, Oct 17 (Reuters) - President Donald Trump's withholding of $391 million in military aid to Ukraine was linked to his request that the Ukrainians look into a claim - debunked as a conspiracy theory - about the 2016 U.S. election, a senior presidential aide said on Thursday, the first time the White House acknowledged such a connection.\n\nTrump and administration officials had denied for weeks that they had demanded a \"quid pro quo\" - a Latin phrase meaning a favor for a favor - for delivering the U.S. aid, a key part of a controversy that has triggered an impeachment inquiry in the House of Representatives against the Republican president.\n\nBut Mick Mulvaney, acting White House chief of staff, acknowledged in a briefing with reporters that the U.S. aid - already approved by Congress - was held up partly over Trump's concerns about a Democratic National Committee (DNC) computer server alleged to be in Ukraine.\n\n\"I have news for everybody: Get over it. There is going to be political influence in foreign policy,\" Mulvaney said.\n\nHe later contradicted himself, ruling out a quid pro quo in a statement from the White House.\n\nIn a July 25 call, Trump asked Ukrainian President Volodymyr Zelenskiy for \"a favor\" to look into the server as well as the California-based cybersecurity firm CrowdStrike, which was hired by the DNC in 2016 to investigate hacking of Democratic emails that it later determined was done by Russia.\n\nTrump also asked Zelenskiy to investigate a domestic political opponent, Joe Biden, and Biden's son Hunter Biden, who had served as a director for a Ukrainian energy company. Zelenskiy agreed during the call to carry out the investigation that Trump sought. The U.S. aid was later provided to Ukraine.\n\nThe DNC server issue is a discredited claim that Ukraine and not Russia interfered in the 2016 U.S. election and that a Democratic Party computer server was being held somewhere in Ukraine. U.S. intelligence agencies and a special counsel investigation concluded that Russia used a campaign of hacking and propaganda to boost Trump's 2016 candidacy.\n\nBiden is a leading contender for the Democratic nomination to face Trump in the 2020 presidential election.\n\nMulvaney said Trump did not like foreign aid, thought Ukraine was corrupt and was annoyed at how little \"lethal aid\" European nations provided to Ukraine as it combated Russia-backed separatists in the eastern part of the country.\n\n\"Did he also mention to me in the past, the corruption related to the DNC server? Absolutely. No question,\" Mulvaney said, referring to Trump. \"But that's it. That's why we held up the money.\"\n\n\"The look-back to what happened in 2016 certainly was part of the things that he was worried about in corruption in that nation,\" Mulvaney said, referring to Trump.\n\nA reporter told Mulvaney that what he just described was a quid pro quo. \"We do that all the time with foreign policy,\" Mulvaney responded.\n\nIn his later statement, Mulvaney offered a different account, saying: \"There was absolutely no quid pro quo.\"\n\n\"There never was any condition on the flow of the aid related to the matter of the DNC server,\" Mulvaney said.\n\nTrump said he had a lot of confidence in Mulvaney.\n\nDemocratic members of the three House committees leading the impeachment inquiry pounced on Mulvaney's earlier remarks.\n\nRepresentative Gerald Connolly said: \"I guess having failed at discrediting the facts of this case, they've decided on a new tactic, which is to admit them and basically say: 'So what'?\n\n\"The answer to that is, well the 'so what' is you're going to be impeached because that's abuse of office. And extortion, the last time I checked, is still a crime,\" he said.\n\n\n\n\n\nU.S. DIPLOMAT TESTIFIES\n\nMulvaney's comments came after the U.S. ambassador to the European Union said in written testimony in the impeachment inquiry that Trump told senior U.S. officials to talk directly to his personal lawyer, Rudy Giuliani, about U.S. policy in Ukraine, raising concern that the president was outsourcing American foreign policy to a private citizen.", "description": "President Donald Trump's withholding of $391 million in military aid to Ukraine was linked to his request that the Ukrainians look into a claim - debunked as a conspiracy theory - about the 2016 U.S. election, a senior presidential aide said on Thursday, the first time the White House acknowledged", "authors": ["Jeff Mason", "Karen Freifeld"], "top_image": "https://s.yimg.com/uu/api/res/1.2/wukvlyLHRNf9hLA4pdZMyA--~B/aD0zMDAwO3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://s.yimg.com/os/creatr-images/2019-10/3ef7de70-f120-11e9-afe7-fed474a6b197", "published_at": "2019-10-17"}