{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/22/the-latest-stars-begin-arriving-at-sweltering-emmy", "downloaded_at": "2019-09-22 23:13:01.685750+00:00", "title": "The Latest: Emmys allows 'Veep' stars to reunite for a night", "language": "en", "text": "LOS ANGELES (AP) - The Latest on the 71st annual Emmy Awards, being presented at the Microsoft Theater (all times local):\n\n3:45 p.m.\n\n“Veep” has come to an end, but the Emmys represent one last bash for the cast led by Julia Louis-Dreyfus.\n\nHer co-star Sam Richardson says the actors and crew would normally be going back to work on a new season by now, but the show has already filmed its finale.\n\nHe says the Emmys offer a chance for the cast to see each other and “be a family again for at least one more night.”\n\nUnlike some other shows ending their runs whose finales fans have grumbled about, Richardson believes “Veep” ”really stuck the landing at the end.”\n\nIt’s nominated for comedy series and Louis-Dreyfus is again vying for lead comedy actress, a category she has dominated over the years.\n\nRichardson brightened at the suggestion of a possible “Veep” movie.\n\nHe laughed and said, “Let’s all work together to make that happen.”\n\n- Beth Harris, @bethharrisap, Michael Cidoni Lennox, @CindoniLennox\n\n___\n\n3:28 p.m.\n\nThe Emmys purple carpet lit up early Sunday with the child stars from “This is Us,” including Eris Baker in striking gray and a stunning head piece to match.\n\nThe 14-year-old who plays teen Tess Pearson walked in Tadashi Shoji, while her screen little sister Annie, played by 10-year-old Faithe Herman, walked in a very grown-up yellow gown.\n\nEris called the inspiration for her look a “futuristic princess,” and that’s how it made her feel.\n\nLonnie Chavis, 11, the kid Randall on the NBC hit, opted for red lapels on his tuxedo. Papa Jack Pearson, otherwise known as Milo Ventimiglia, walked in a taupe jacket.\n\nOthers in the cast also slayed as the fashion march got under way. They include Chris Sullivan, who walked on the carpet in plaid.\n\n- Leanne Italie\n\n___\n\n2:15 p.m.\n\nIt’s 92 degrees on the purple carpet leading into the Emmys.\n\nLarge fans are whirring overhead along the carpet and host network Fox has added water elements to the scene, perhaps instilling a sense of coolness even while the last day of summer is unbearably hot in Los Angeles.\n\nEarly arrivals included Jenny McCarthy and drama actor nominees Sterling K. Brown and Bob Odenkirk. Also early were Sharon and Kelly Osbourne, who is hosting Fox’s Emmy pre-show.\n\n“Access Hollywood” host Mario Lopez arrived with an additional accessory, a sling for his recently injured arm.\n\n- Beth Harris (@bethharrisap on Twitter)\n\n___\n\n10 a.m.\n\nRecords could be broken at the 2019 Emmy Awards by “Game of Thrones” and “Veep” star Julia Louis-Dreyfus.\n\nThe HBO fantasy saga already has the most awards for a show in one season, 12, and it’s competing Sunday in seven categories.\n\nIf Louis-Dreyfus wins top comedy actress honors for “Veep,” she’ll have a total of nine Emmys, the most ever for a performer.\n\nOther contenders to keep an eye on include Sandra Oh of “Killing Eve” and Billy Porter of “Pose,” both vying for top drama series acting awards.\n\nOh could become the actress of Asian descent to win in the category, and Porter could be the first openly gay actor to nab a trophy.\n\nThe 71st annual Emmy Awards airs at 8 p.m. EDT Sunday on Fox.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Latest on the 71st annual Emmy Awards, being presented at the Microsoft Theater (all times local):", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/22/2019_primetime_emmy_awards_-_arrivals_85647_c0-223-3099-2029_s1770x1032.jpg?cdf0f9f7876eee496c0f994cc62812faec726cc4", "published_at": "2019-09-22"}