{"pub": "fox", "url": "https://foxnews.com/entertainment/felicity-huffman-prison-sentence-college-admissions-scandal-california", "downloaded_at": "2019-10-17 05:15:51.941313+00:00", "title": "Felicity Huffman will serve 13 days of 14-day jail sentence: report", "language": "en", "text": "Felicity Huffman will not serve her entire federal prison sentence this month, according to a new report.\n\nThe Emmy winner surrendered to authorities on Tuesday to do her time, but she'll only be in the Federal Correctional Institution in Dublin, Calif. for 13 days rather than 14, according to a Federal Bureau of Prisons spokesperson who spoke with Entertainment Tonight.\n\nFELICITY HUFFMAN'S ALLEGED 'ACCOMPLICE' PLEAD GUILTY IN COLLEGE SCANDAL\n\nHuffman, 56, received her sentence last month after pleading guilty in May for her role in the college admissions scandal. The sentence also included 250 hours of community service and a $30,000 fine.\n\nThe spokesperson said Huffman was given credit for the remaining day to account for the time she spent in custody following her arrest in March.\n\nFELICITY HUFFMAN'S CO-STAR RICARDO CHAVIRA CHALKS UP HER 2-WEEK PRISON SENTENCE TO 'WHITE PRIVILEGE'\n\n\"Any part of a day spent in official detention equals one day for credit purposes,\" the spokesperson explained. \"Credit is given for time spent in official detention as a direct result of the federal offense for which the federal sentence was imposed.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nHuffman pleaded guilty to one count of conspiracy to commit mail fraud and honest services mail fraud. She confessed to paying an admissions consultant $15,000 to have a proctor correct her older daughter's answers on the SAT.\n\nHer projected release date is Oct. 27.", "description": "Felicity Huffman will not serve her entire federal prison sentence this month, according to a new report.", "authors": ["Nate Day"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/huffmanjail.jpg", "published_at": "2019-10-17"}