{"pub": "metro", "url": "https://metro.co.uk/2019/10/25/eastenders-spoilers-martin-fowler-left-dead-ben-mitchell-takes-revenge-10980739", "downloaded_at": "2019-10-25 15:59:38.570425+00:00", "title": "EastEnders spoilers: Martin left for dead as Ben takes revenge tonight", "language": "en", "text": "Martin Fowler (James Bye) reckons that he has the upper hand with Ben Mitchell (Max Bowden) and that the nightmare of his hold over him is finally over in EastEnders – but he couldn’t be more wrong. When you mess with Ben, you play with fire and Martin is set to be left for dead in shocking violence.\n\nSick of Martin blackmailing him into debt collection jobs, Martin laid a trap for him and when Ben turned up for the job, he was arrested on the scene. With insufficient evidence to put Ben away, Martin thinks that it’s enough that the police are watching him. Ben has reminded him about the footage of him handling a stolen car but Martin is confident that Ben won’t implicate himself by using it.\n\nBut Ben has a different plan in mind. Martin couldn’t help but get his own back on Ben by gloating to him that he is just a boy living in his mum’s house – before then reminding him of his terror when he was dangled over a railway bridge years ago. And many Ben faces ago.\n\nAdvertisement\n\nAdvertisement\n\nTelling Ben that he was a coward, Martin swaggered out and was ready to tell Stacey (Lacey Turner) that she is safe to come home now. But Ben isn’t going to let the matter drop. Seething at Martin’s actions and words, Ben will up the ante tonight and Martin will find himself in a terrifying situation.\n\nWith his life on the line, can Martin get out of this mess? Or will Ben’s revenge be an extremely deadly reminder that he is the one in control?\n\nWhatever happens, it seems likely that Stacey won’t be coming home any time soon but Lacey has filmed some one off scenes to fill the gap.\n\nEastEnders continues on Friday 25th October at 8:30pm on BBC One.\n\nAdvertisement Advertisement", "description": "Ben strikes back.", "authors": ["Duncan Lindsay"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/18685203-high_res-eastenders-october-december-2019-ccb3_1571991679.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-25"}