{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/lucky-southampton-fc-fans-fly-20538036", "downloaded_at": "2019-10-08 15:49:22.396264+00:00", "title": "Lucky Southampton FC fans to fly to Man City game on private flight 'Le Tiss Air'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA lucky selection of Southampton FC fans will swap their train tickets for seats on a private flight nicknamed 'Le Tiss Air' after club legend Matt Le Tissier.\n\nThe Premier League club has chartered a private jet to transport 12 lucky competition winners to their away game against Manchester City on November 2.\n\nThey will also be joined by a club legend, yet to be announced, throughout the flight.\n\nThe trip is being laid on as a thank-you to loyal fans of the Hampshire-based club after new research revealed they are among the most-travelled fans in the league.\n\nExperts from eToro used data from KPMG's Football Benchmark unit to calculate that Saints fans typically clock up 12 per cent more miles than the average fan.\n\nSouthampton season ticket holders will also rack up an average spend of £1,266 on travel alone to see their team play away.\n\n(Image: Jamie McPhilimey/SWNS)\n\nSouthampton FC and England football legend Matt Le Tissier, said: \"Saints fans are an incredibly passionate bunch, and this is a fantastic initiative to make their away trip extra special.\n\n\"I had the privilege of playing in front of Southampton fans throughout my entire career and I know first-hand how vital their support is.\n\n\"This is even more so when you know they've made the trip to see you in opposition territory. I hope the fans enjoy the moment and get behind the boys against City.\"\n\nThe winners of seats on Le Tiss Air will be announced on Monday 14th October at the close of the competition.\n\nThe eToro football fandom report, completed in partnership with KPMG, looks at the costs associated with being a dedicated match-going football fan, including delving into the average distance and costs of travel for fans of each Premier League club.\n\nFigures show that football fans are forecast to spend up to £39 million on travel to away matches by train this Premier League season alone, travelling an average of 5,328 miles.\n\n(Image: Getty Images)\n\nIqbal V. Gandham, UK managing director at eToro, said: \"eToro chose to partner with six Premier League teams in order to reach and support the fans who are at the heart of these clubs.\n\n\"We know that Saints fans will follow their team anywhere, but over the course of the season it does come at a cost.\n\n\"Le Tiss Air is a unique way to reward those fans for their devotion to their team.\n\n\"What better time to do this than what is set to be an exciting match versus Manchester City in November.\"\n\nSouthampton newspaper, the Southern Daily Echo, is also offering fans an extra chance to win seats and tickets via a competition for its readers.\n\neToro has paid to offset carbon emissions from the flight, with the money going towards climate protection projects that directly reduce the impact of greenhouse gases.\n\nFor more information and competition details see eToro & Southampton FC's official Twitter and Facebook media channels.", "description": "The private flight has been named after Southampton FC legend Matt Le Tissier and 12 competition winners could fly to the Premier League game against Manchester City on November 2", "authors": ["Grant Bailey", "Joseph Wilkes", "Image", "Jamie Mcphilimey Swns", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20538243.ece/ALTERNATES/s1200/1_SWNS_TISSIER_JET_02.jpg", "published_at": "2019-10-08"}