{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-hongkong-protests/hong-kong-protesters-police-in-chaotic-clashes-as-metro-shops-targeted-idUKKBN1WS024", "downloaded_at": "2019-10-13 11:39:09.612934+00:00", "title": "Hong Kong protesters, police in chaotic clashes, as metro, shops targeted", "language": "en", "text": "HONG KONG (Reuters) - Hong Kong pro-democracy activists and riot police clashed in chaotic scenes around the city on Sunday with police in full riot gear chasing protesters through crowds of horrified lunchtime shoppers.\n\nRiot police officers detain an anti-government protester in Tsuen Wan, near the site where police shot a protester with live ammunition on China's National Day in Hong Kong, China October 13, 2019. REUTERS/Susana Vera\n\nSeveral rallies in shopping mall started peacefully around midday with a few hundred people at each chanting slogans such as “Free Hong Kong”, but by late afternoon hardcore black-clad activists trashed shops and metro stations and erected road blocks around the city.\n\nPolice made numerous arrests and deployed tear gas to disperse protesters, saying they used “minimum force”. Television footage showed shoppers screaming and some injured when police charged inside a mall.\n\nThe young protesters, many wearing face masks to shield their identity, were often supported by shoppers.\n\nIn one mall a group of riot police, shields out front and pepper spray canisters in, hand were forced to retreat backwards by chanting shoppers until they were outside of the mall.\n\nIn another incident, a group of 50 shoppers inside a mall faced off against riot police outside, chanting “Hong Kong police mafia”. The shoppers cheered when police drove off.\n\nHong Kong’s police, once praised as “Asia’s finest”, have been accused of using excessive force in dealing with protesters and have lost the confidence and respect of many Hong Kongers.\n\n“Hong Kong used to be a prosperous city and now she has become a police state. Hong Kong is my home. We should protect her. We should resist,” said a 70-year-old who only gave his last name, Hui.\n\nHe was part of a group of 60- to 70-year-olds on Nathan Road, Kowloon, cheering the protesters, urging them to block the road and warning them when police were returning.\n\nHong Kong has been battered by four months of often massive and violent protests against what is seen as Beijing’s tightening grip on the Chinese-ruled city.\n\nThe protests started in opposition to a now-abandoned extradition bill but have widened into a pro-democracy movement and an outlet for anger at social inequality in the city, which boasts some of the world’s most expensive real estate.\n\nThe unrest has plunged the city into its worst crisis since Britain handed it back to China in 1997 and poses the biggest popular challenge to Chinese President Xi Jinping since he came to power in 2012.\n\nHong Kong is facing its first recession in a decade due to the protests, with tourism and retail hardest hit.\n\n‘POLICE STATE’\n\nHong Kong’s protests have also taken on an element of civil disobedience by residents angry at what they see as excessive force by riot police and a heavy-hand by the government which introduced colonial-era emergency laws to quell unrest.\n\nSporadic small protest rallies often now consist of face-mask wearing school children, office workers, shoppers and the elderly. Hardcore activists who clash with police tend to emerge later in the day.\n\n“I think the police have been using their power to suppress the citizens,” said resident Mary Lam, 26.\n\n“That’s why more and more young children come out and protest against the government and the police. Those being arrested don’t have human rights. This is not fair.”\n\nThe Hong Kong government introduced emergency laws to ban the wearing of face masks at public rallies, a move that sparked some of the worst violence since the unrest started in June.\n\nThe violence has seen police trade tear gas and rubber bullets with protesters throwing petrol bombs and bricks. Two people have been shot and wounded during protests.\n\nPolice have arrested more than 2,300 people since June. Hong Kong leader Carrie Lam has said that since September, nearly 40% of those arrested were under the age of 18 and 10% under 15, without giving the total number of arrests.\n\nProtesters have targeted Chinese banks and shops with links to mainland China. A group wielding hammers damaged a Huawei [HWT.UL] store on Sunday.\n\nDemonstrators believe China has been eroding Hong Kong’s freedoms, guaranteed under the “one country, two systems” formula introduced with the 1997 handover.\n\nThe now-withdrawn extradition bill, under which residents would have been sent to Communist-controlled mainland courts, was seen as the latest move to tighten control.\n\nChina denies the accusation and says foreign countries, including Britain and the United States, are fomenting unrest.\n\nLADY LIBERTY\n\nProtesters scaled the city’s Lion Rock peak and hoisted a large statue they called “Lady Liberty” early on Sunday to rally anti-government activists.\n\nThe three-metre (9-feet) statue, wearing a gas mask, helmet and protective goggles, was carried up the 500-metre (1,500-feet) peak in the dead of night by several dozen protesters, some wearing head lamps, during an overnight thunderstorm.\n\nSlideshow (15 Images)\n\nIt held a black banner that read “Revolution of our time, Liberate Hong Kong” and could be seen from the city below.\n\nThe statue represented an injured woman protester believed by activists to have been shot in the eye by a police projectile. One of the protesters told Reuters he hoped it would inspire Hong Kong people to keep fighting.\n\n“We are telling people that you mustn’t give up. All problems can be resolved with Hong Kong people’s persistence and hard work to reach our aims,” he said.", "description": "Hong Kong pro-democracy activists and riot police clashed in chaotic scenes around the city on Sunday with police in full riot gear chasing protesters through crowds of horrified lunchtime shoppers.", "authors": ["Jessie Pang", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191013&t=2&i=1440315016&w=1200&r=LYNXMPEF9C08A", "published_at": "2019-10-13"}