{"pub": "marketwatch", "url": "https://marketwatch.com/story/alibabas-jack-ma-calls-the-996-chinas-72-hour-work-week-a-huge-blessing-2019-04-15", "downloaded_at": "2019-09-11 13:57:24.366119+00:00", "title": "Alibaba’s Jack Ma calls the ‘996’ — China’s 72-hour workweek — a ‘huge blessing’", "language": "en", "text": "Working 12 hours a day, six days a week is a gift “beyond monetary gains,” according to China’s richest man.\n\nBillionaire Jack Ma, co-founder of the Alibaba Group Holding Ltd. BABA, +0.21% has repeatedly endorsed the 72-hour “996” schedule — or working 9 a.m. to 9 p.m. six days a week. And as many Chinese tech employees have begun calling for more work-life balance, Ma has doubled-down on extolling the extreme overtime in a series of posts shared on Alibaba’s WeChat account.\n\n“If we find things we like, 996 is not a problem,” Ma, 54, wrote in a lengthy blog post Sunday on Chinese social media site Weibo. “If you don’t like [your work], every minute is torture.”\n\n‘I personally think that being able to work 996 is a huge blessing ... How do you achieve the success you want without paying extra effort and time?’ Jack Ma\n\nMa, worth a cool $39.3 billion, according to Forbes, also wrote in a message to employees last Thursday that read, “I personally think that being able to work 996 is a huge blessing,” especially for the young. “How do you achieve the success you want without paying extra effort and time?”\n\nAnd those unwilling to put in 12-hour days at Alibaba need not apply. “Or why bother joining?” he wrote. “We don’t lack those who work eight hours comfortably.”\n\n‘Those who can stick to a 996 schedule are those who have found their passion beyond monetary gains.’ Jack Ma\n\nHis remarks have spurred criticism from Chinese social media users, including one Weibo user who commented, “Did you ever think about the elderly at home who need care, (or) the children who need company?” as reported by CNN. “If all enterprises enforce a 996 schedule, no one will have children” because there won’t be time to start or raise a family.\n\nChinese state media weighed in with a piece published in the state-run People’s Daily newspaper on Sunday, although it did not name Ma: “Advocating hard work and commitment does not mean forcing overtime. The mandatory enforcement of 996 overtime culture not only reflects the arrogance of business managers, but also is unfair and impractical.”\n\nAnd last month, activists on Microsoft’s MSFT, -0.39% code-sharing site GitHub started a “996.ICU” discussion group that has suggested that workers clocking in those 72-hour weeks could suffer burnout and require medical attention, CNBC reported. Indeed, the Organization for Economic Cooperation and Development has found that productivity is highest when people work fewer hours, and worker output actually drops once people clock in more than 48 hours per week.\n\nThe CDC has also linked putting in overtime with increased rates of illness, injury and death, not to mention weight gain and more alcohol use and smoking. And when a New Zealand firm switched to a four-day workweek program, it found that it’s employees were 20% more productive.\n\nSee: Here’s proof that the four-day workweek makes us better employees\n\nOf course, Chinese tech companies are not the only businesses that celebrate putting in long working hours. Tesla TSLA, +1.56% co-founder Elon Musk said that he puts in 120 hours per week, tweeting last November that, “There are way easier places to work, but nobody ever changed the world on 40 hours a week.” And Marissa Mayer has described working 130-hour weeks at Google GOOGL, +0.52%.", "description": "The extreme overtime culture at many Chinese tech companies has drawn backlash.", "authors": ["Nicole Lyn Pesce"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HH614_JackMa_ZG_20190415114951.jpg", "published_at": "2019-04-15"}