{"pub": "reuters", "url": "https://reuters.com/article/us-usa-trump-whistleblower-schiff/u-s-house-defeats-republican-bid-to-censure-schiff-in-impeachment-probe-idUSKBN1X02EM", "downloaded_at": "2019-10-22 13:44:52.732079+00:00", "title": "U.S. House defeats Republican bid to censure Schiff in impeachment probe", "language": "en", "text": "FILE PHOTO: House Intelligence Committee Chairman Adam Schiff (D-CA) delivers remarks on Capitol Hill, in Washington, U.S., October 17, 2019. REUTERS/Tom Brenner\n\nWASHINGTON (Reuters) - Democrats in the U.S. House of Representatives on Monday blocked a Republican effort to censure House Intelligence Committee Chairman Adam Schiff over statements he has made related to an impeachment investigation of President Donald Trump.\n\nAs expected, the Democratic-controlled House voted 218-185 to block consideration of the Republican measure, thus shelving it.\n\nRepublicans accused Schiff of misleading the public by, among other things, saying he did not know the identity of a whistleblower who reported that Trump pressured Ukraine’s newly elected president to investigate a U.S. political rival, Democrat Joe Biden who is running for president.\n\nA vote to censure a House member registers the chamber’s deep disapproval of misconduct that falls short of expulsion.\n\nSince 1832, 23 House members have been censured, which requires them to stand before their fellow legislators while the House speaker or presiding officer reads aloud the censure resolution as a form of public rebuke.\n\nSchiff is one of a handful of House Democrats leading an investigation into whether Trump may have committed an impeachable offense surrounding his dealings with Ukraine.\n\nPart of the investigation centers on whether Trump temporarily cut off congressionally approved aid to Ukraine earlier this year to pressure President Volodymyr Zelenskiy to investigate Biden and a debunked theory that it was Ukraine and not Russia that meddled in the 2016 U.S. presidential election.\n\nIn coming weeks, Democrats are expected to decide whether to hold a full House vote on lodging formal charges against Trump. A House vote in favor of impeachment would trigger a Senate trial to determine if the Republican president is guilty of any of the charges and thus should be removed from office.", "description": "Democrats in the U.S. House of Representatives on Monday blocked a Republican effort to censure House Intelligence Committee Chairman Adam Schiff over statements he has made related to an impeachment investigation of President Donald Trump.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191021&t=2&i=1443522064&w=1200&r=LYNXMPEF9K1UR", "published_at": "2019-10-21"}