{"pub": "reuters", "url": "https://reuters.com/article/us-lebanon-protests/thousands-take-to-lebanons-streets-in-third-day-of-anti-government-protests-idUSKBN1WY0AC", "downloaded_at": "2019-10-19 19:10:35.922579+00:00", "title": "Thousands take to Lebanon's streets in third day of anti-government protests", "language": "en", "text": "BEIRUT (Reuters) - Tens of thousands took to the streets of Lebanon on Saturday for a third day of anti-government protests, directing growing rage at a political elite they blame for entrenched cronyism and driving the country to the economic brink.\n\nIn central Beirut, the mood was fiery and festive, with protesters of all ages waving flags and chanting for revolution outside upmarket retailers and banks that had their store fronts smashed in by rioters the night before.\n\nFrom the south to the east and north of Lebanon, protesters marched and blocked roads to keep the momentum going despite gunmen loyal to the Shi’ite Muslim Amal movement appearing with firearms to scare them away.\n\nThe latest unrest was sparked by anger over the rising cost of living and new tax plans, including a fee on WhatsApp calls, which was quickly retracted after protests - the biggest in decades - broke out.\n\nIn an attempt to appease demonstrators, Lebanon’s finance minister announced following a meeting with Prime Minister Saad al-Hariri that they had agreed on a final budget that did not include any additional taxes or fees.\n\nLebanese President Michel Aoun said in a tweet there would be a “reassuring solution” to the economic crisis.\n\nThe protests followed a build-up in grievances over perceived government corruption, mismanagement of funds and a failure to address high unemployment.\n\nNO LEADER SPARED\n\nNo leader, Christian or Muslim, was spared protesters’ ire, creating a rare unity in a country riven by sectarianism.\n\nAt night, patriotic songs blared from loudspeakers in Beirut and fireworks exploded over a sea of people dancing and singing, holding banners reading “unite against corrupt politicians”.\n\n“This country is moving towards total collapse. This regime has failed to lead Lebanon and it must be toppled and replaced,” said Mohammad Awada, 32, who is unemployed.\n\nPrime minister Hariri gave his government partners a 72-hour deadline on Friday to agree on reforms that could ward off economic crisis, hinting he may otherwise resign.\n\nIn a televised speech addressing the protests on Saturday, Hezbollah leader Sayyed Hassan Nasrallah said the group was against the government resigning, and the country did not have enough time for such a move given the acute financial crisis.\n\n“Everyone should take responsibility rather than being preoccupied with settling political scores while leaving the fate of the country unknown,” he said.\n\n“All of us have to shoulder the responsibility of the current situation that we arrived at,” added Nasrallah, whose Iranian-backed Shi’ite group is Lebanon’s most influential.\n\nDemonstrators carry national flags during an anti-government protest in the port city of Sidon, Lebanon October 19, 2019. REUTERS/Ali Hashisho\n\nRISK OF ‘COLLAPSE’\n\nThe protests that swept villages and towns across Lebanon recall the 2011 Arab revolts that toppled four presidents.\n\nThe Hezbollah leader said he recognized the protests were “honest and spontaneous” but warned that his heavily-armed and powerful group, which backed the president’s rise to power, would not permit his downfall.\n\nIn southern Lebanon, Amal militiamen loyal to parliamentary speaker Nabih Berri attacked peaceful demonstrators who tore his posters and chanted slogans denouncing him as corrupt. They prevented TV crews from filming the protests.\n\nIn the speech, Nasrallah predicted that imposing more taxes would lead to an “explosion” of unrest.\n\n“If we don’t work towards a solution we’re heading towards a collapse of the country, it will be bankrupt and our currency will not have any value,” he said.\n\n“The second danger is a popular explosion as a result of wrong handling of the situation.”\n\nProtesters from across the political spectrum filled the streets.\n\n“I am taking part because over the last 30 years warlords have been ruling us. I am about to be 30 and my parents still tell me tomorrow will be better. I am not seeing better days ahead,” said Sylvia Yaqoub, 29, a laboratory manager.\n\n“We want back the money they stole because 30 families are ruling five million people. We won’t accept this any longer.”\n\nSlideshow (12 Images)\n\nFadi Dhaher, 21, a university student, said his generation felt they had no future. “We are protesting because we don’t want to emigrate ... they are pushing us to leave our country.”\n\nGovernment sources said the cabinet might hold an emergency meeting on Sunday to discuss a way out of the crisis.\n\nThe budget could help it unlock billions of dollars pledged by international donors who have made their support conditional on long-delayed reforms to curb waste and corruption.", "description": "Tens of thousands took to the streets of Lebanon on Saturday for a third day of anti-government protests, directing growing rage at a political elite they blame for entrenched cronyism and driving the country to the economic brink.", "authors": ["Laila Bassam", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191019&t=2&i=1442691680&w=1200&r=LYNXMPEF9I0DU", "published_at": "2019-10-19"}