{"pub": "cbs", "title": "Kamala Harris releases \"Medicare for All\" proposal ahead of second Democratic debate", "url": "https://cbsnews.com/news/kamala-harris-releases-medicare-for-all-proposal-ahead-of-second-democratic-debate", "language": "en", "published_at": "2019-07-29", "downloaded_at": "2019-09-02 07:28:33.465951+00:00", "text": "Sen. Kamala Harris, who has spent some time clarifying her stance on \"Medicare for All,\" is now proposing her own version of the single-payer insurance plan. She'll remain a co-sponsor of the bill introduced by Sen. Bernie Sanders, a campaign spokesperson said.\n\nBut there are key differences between Harris' plan and that of the Vermont senator: Harris has proposed to double the transition period from the current health care system to the single-payer system, to reduce Sanders' proposed tax on middle-class families to pay for the plan, and she would allow private insurance companies to offer Medicare options.\n\nHarris' plan would immediately give Americans the option of buying into a Medicare system. It would allow for Medicare for All to cover services like emergency room visits, hearing aids and substance abuse treatment. The plan would also be expanded to cover telehealth, which is defined by the World Health Organization as the \"use of telecommunications and virtual technology to deliver health care outside of traditional health-care facilities.\"\n\nThe plan also calls for an audit of prescription drug costs. Harris is proposing a 10-year phase-in period, as opposed to Sanders' plan, which called for a four-year transition. Her plan would automatically enroll newborns and uninsured individuals.\n\nThe Harris campaign said that extending the transition period would decrease the overall cost of Medicare for All, but it did not specify what that new estimated cost would be. Sanders estimates that his plan could cost up to $40 trillion over a decade.\n\nIn another departure from Sanders' plan, Harris would allow private insurance to offer Medicare plans. The Harris campaign said those plans would follow strict requirements in an effort to lower costs and expand coverage. Though Harris said she wants her version to clear certain \"benchmarks,\" she did not immediately identify what those benchmarks would be.\n\nThe California senator has publicly pushed back at the proposed middle-class tax hike to help fund Sanders' plan. Harris would exempt households making below $100,000 and include a higher income threshold for middle class families living in high-cost areas.\n\n\"I look at this issue through a fairly simple prism: each night, millions of Americans wake up at 3 o'clock in the morning worried about some aspect of their health care,\" said Harris, \"How am I going to afford a $5,000 deductible just for walking my child into the emergency room because their fever won't go down?\"\n\nIn place of that middle-class tax hike, Harris is proposing a Wall Street tax that would include taxing stock trades at 0.2% and derivative transactions at .002%. The Harris campaign also said the senator would tax \"offshore corporate income at the same rate as domestic corporate income.\" She believes this would bring in more than $2 trillion over 10 years.\n\nSanders' plan also includes taxing off-shore profits and taxing capital gains. His plan calls for taxing capital gains and dividends at the same levels as employment income. However, his proposal only exempts families of four making less than $29,000 a year from paying proposed middle-class taxes.\n\nBut Sanders argues that while the middle class would be taxed, average families of four making $50,000 a year would save over $4,400 a year.\n\nThe Harris campaign says former Health and Human Services Secretary Kathleen Sebelius, who served in the Obama administration when the current health care law was passed, supports her plan.\n\n\"This plan builds on the progress we made in the Affordable Care Act and expands upon its promise of universal coverage through a sensible expansion of the popular Medicare system,\" Sebelius said. \"To get all Americans covered by health insurance, where cost is not a barrier, we need innovative ideas like this. Senator Harris' plan is a smart way to get to Medicare for All where all individuals and employers can transition smoothly into a system that covers everyone.\"\n\nHarris' proposal comes as former Vice President Joe Biden is expected to defend his proposal to expand the Affordable Care Act when he takes the debate stage against her and eight other presidential hopefuls on Wednesday in Detroit.", "description": "The health care plan Harris is proposing would immediately give Americans the option to buy into a \"Medicare for All\" system", "authors": ["Stephanie Ramirez"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/07/29/3b5b0b49-6365-4579-bed0-9a70a285a4fc/thumbnail/1200x630/0f16d57be4be370104bb6d3558894bed/gettyimages-1157600481.jpg"}