{"pub": "investing.com", "title": "ECB Is In An Unenviable Position With Confusing Communication", "url": "https://za.investing.com/analysis/ecb-is-in-an-unenviable-position-with-confusing-communication-200431038", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 08:00:23.346049+00:00", "text": "The below is the weekly chart of the EURUSD. We note that the EMAs are in a bearish stack with the green 5-week EMA below the orange 13-week EMA, and the orange 13-week EMA below the black 34-week EMA. The RSI is on the negative side of 50 and confirms the bearish momentum. The big day for the single currency is 12 September.\n\nPast performance is not an indicator of future results.\n\nCHART SOURCE: FXCM MARKETSCOPE 2.0\n\nEURUSD Weekly\n\nThis is the day that the ECB will release its main refinancing rate and policy statement and, of course, when ECB President Mario Draghi will hold his press conference. The question is if another round of QE will be announced? Over the past 24 hours or so we have had a number of very interesting news releases:\n\n1. Yesterday, ECB governing council member Nowotny said “central banks…must…sometimes disappoint markets.”\n\n2. Today, ECB executive board member Lautenschlaeger suggested that it is much too early for a huge stimulus package.\n\n3. Today, ECB governing council member Rehn said that it is important for the ECB to maintain a strong monetary stimulus.\n\nBeside the conflicting communication it seems like a lot of chin wagging as monetary policy in the Euro Area is now largely toothless. Firms are effectively being paid to borrow money yet lending levels are muted. Moreover, the European model is complex. Whilst the monetary union exists, a fiscal union does not. This is asymmetrical in terms of economic policy decision making. The EU is in dire need of expansionary policies, but monetary policy, which is currently ineffective, is the only game in town.\n\nThere has been rumours of Germany embarking on Fiscal stimulus. With a budget surplus of 1.7% of GDP it is incredible that this has not happened already. Truth be told, the regulation here is impinging on any hope of help from the Fiscal authorities, at least, in the short to medium term.\n\nGiven this, the ECB is in an unenviable position. Perhaps Nowotny and Lautenschlager are playing for the shock factor come 12 September. Either this or they are keeping their powder dry for Brexit – but stimulus is required – and this means that the weekly technicals may be entrenched for the foreseeable future", "description": "Forex Analysis by Russell Shor covering: . Read Russell Shor's latest article on Investing.com South Africa.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg"}