{"pub": "euronews", "url": "https://euronews.com/2019/10/26/fears-california-wildfires-will-turn-deadly-as-strong-winds-forecast", "downloaded_at": "2019-10-27 00:50:13.414024+00:00", "title": "Fears California wildfires will turn deadly as strong winds forecast", "language": "en", "text": "California firefighters aided by subsiding winds have taken the offensive against two major wildfires at opposite ends of the state, one displacing 50,000 suburban Los Angeles residents and another roaring through Sonoma County's famed wine country.\n\nBut prolonged strong winds were forecast to start late on Saturday which could fan the flames and turn the fires deadly.\n\nGovernor Gavin Newsom declared an emergency for both blazes, which erupted hours apart amid fierce winds this week.\n\nEmergency services are now on high alert and energy companies are planning widescale power outages to curtail wildfire risks.\n\nNo injuries have been reported so far from either the Kincade fire in Sonoma County, about 130 kilometres north of San Francisco or the Tick fire in the Santa Clarita Valley about 65 km north of Los Angeles.\n\nBut the two blazes, the worst of several large wildfires across the state this week, have destroyed dozens of homes and other structures while prompting air-quality alerts in parts of Los Angeles and the San Francisco Bay area.\n\nPower companies, led by the state's largest investor-owned utility, Pacific Gas and Electric Co., were planning massive power cuts.\n\n\"Any spark, from any source, can lead to catastrophic results. We do not want to be one of those sources,\" Andrew Vesey, Pacific Gas & Electric's CEO said.\n\n\"That's why public safety power shut-offs have become so frequent. It's also why they're becoming so widespread and affecting so many people throughout the state.\"\n\nPG&E's precautionary blackouts are expected to leave 850,000 customers without power across 36 counties in northern and central California.\n\nThe utility cited weather data showing the expected windstorm \"could be the most powerful in California in decades\".\n\nAdding to PG&E's difficulties, the utility acknowledged on Thursday that the Kincade fire, which forced the evacuation of 2,000 people in Sonoma County after erupting on Wednesday night, began near the base of a damaged high-voltage transmission tower the utility owns.\n\nA power shutdown of that scale, affecting millions of people, would surpass even the record outage imposed by PG&E on some 730,000 of its customers in anticipation of a previous windstorm two weeks ago.", "description": "Emergency services are on high alert and energy companies are planning wide-scale power outages to miminise the risk of sparking more fires.", "authors": ["Daniel Bellamy"], "top_image": "https://static.euronews.com/articles/stories/04/26/00/96/1000x563_cmsv2_04cf649a-a592-5d4e-a7ee-ecd78436367d-4260096.jpg", "published_at": "2019-10-26"}