{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/09/1927621/0/en/Triumph-Gold-Comments-on-Recent-Promotional-Activity.html", "downloaded_at": "2019-10-09 22:01:28.302560+00:00", "title": "Triumph Gold Comments on Recent Promotional Activity", "language": "en", "text": "VANCOUVER, British Columbia, Oct. 09, 2019 (GLOBE NEWSWIRE) -- Triumph Gold Corp. (TSX.V: “TIG”, OTCQB: “TIGCF”) (“Triumph” or the “Company”) announces that the OTC Markets Group Inc. has requested that the Company comment on recent activity concerning its common shares.\n\n\n\nOn October 7, 2019, the OTC Markets Group provided the Company with copies of three articles contained in emails dated October 7, 2019 by Portfolio Wealth Global, Crush the Street and FutureMoney Trends. The Company engaged Gold Standard Media LLC by agreement dated September 16, 2019 for digital marketing. Following the inquiry from OTC Markets Group the Company contacted Gold Standard Media and was informed that they utilized the foregoing services in connection with their services.\n\nAfter inquiry of management, none of the Company’s officers, directors and 10% shareholders, were involved, directly or indirectly, with the creation or distribution of promotional materials, other than management provided information on the Company to Gold Standard Media in connection with the services to be provided by them under the agreement. The Company did not provide editorial input into the articles prior to their release.\n\nThe Company does not believe the statements in the articles regarding the Company’s Freegold Mountain project provided any materially false or misleading information on the Company. Other commentary in the articles, including forward looking statements, appears to express the personal opinions of the authors. The Company notes that its Freegold Mountain project is at the exploration stage, and that mineral resources on the property are not mineral reserves and do not have demonstrated economic viability.\n\nThe Company believes the release of the articles may have been a factor with respect to an increased price and trading volume concerning the Company’s common shares that occurred on October 7, 2019. However, other activity of the Company management, including any meetings with members of the investment community during early October, including October 7, in regards to raising awareness of the Company, which may also have been a factor with respect to such increased price and trading volume.\n\nAfter inquiry of Company management, none of the Company’s officers, directors or controlling shareholders nor third-party service providers, have sold or purchased Company securities in the past 90 days.\n\nThe Company completed a private placement in accordance with the policies of the TSX Venture Exchange that closed in five tranches during the months of May, June and July 2019 for gross proceeds of $5,122,913 pursuant to which it issued 6,041,460 flow-through units at 49 cents per flow-through unit and 6,178,851 non-flow-through units at 35 cents per unit. Each unit consists of a share and a half share purchase warrant, with each whole warrant being exercisable for a further share at a price of $0.60 for a period of two years. The Company has not issued convertible instruments allowing conversion to equity securities at prices constituting a discount to the market price at the time of the issuance.\n\nIn the last 12 months, the Company has engaged Gold Standard Media and Dig Media dba Investing News Network to provide digital marketing services. The Company has also engaged IR Pro Communications Inc. of Vancouver, BC to provide ongoing investor relations services.\n\nAbout Triumph Gold Corp.\n\nTriumph Gold Corp. is a growth oriented Canadian-based precious metals exploration and development company. Triumph Gold Corp. is focused on creating value through the advancement of the district scale Freegold Mountain project in Yukon. For maps and more information, please visit our website www.triumphgoldcorp.com .\n\nOn behalf of the Board of Directors\n\nSigned \"John Anderson\"\n\nExecutive Chairman\n\nFor further information please contact:\n\nJohn Anderson, Executive Chairman\n\nTriumph Gold Corp.\n\n+1 (604) 218-7400\n\njanderson@triumphgoldcorp.com\n\nNancy Massicotte\n\nIR Pro Communications Inc.\n\n(604)-507-3377\n\nnancy@irprocommunications.com\n\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\n\nCertain information contained herein constitutes “forward-looking information” under Canadian securities legislation. Generally, forward-looking information can be identified by the use of forward-looking terminology such as “will”, or variations of such words and phrases or statements that certain actions, events or results “will” occur. Forward-looking statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of the Company to be materially different from those expressed or implied by such forward-looking statements or forward-looking information, including results of exploration, capital expenditures, natural resource prices and other costs. There can be no assurance that such statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking statements and forward-looking information. Triumph will not update any forward-looking statements or forward-looking information that are incorporated by reference herein, except as required by applicable securities laws.", "description": "", "authors": ["Triumph Gold Corp."], "top_image": "http://www.globenewswire.com/Attachment/LogoDisplay/555363?filename=555363.png&size=1", "published_at": "2019-10-09"}