{"pub": "fox", "url": "https://foxnews.com/media/kilmeade-2020-dems-anxious-hillary-clinton-run", "downloaded_at": "2019-10-23 14:57:14.880135+00:00", "title": "Kilmeade on Dems getting anxious about far-left 2020 field: They're saying 'What planet are you on?!'", "language": "en", "text": "Many Democrats are reportedly getting anxious about the chances of the current set of 2020 presidential contenders due to their far-left policy proposals on health care, climate change and immigration, fueling speculation that Hillary Clinton could jump into the race.\n\n\"Their policies are so out there, they're getting traditional Democrats like Rahm Emanuel freaked out,\" host Brian Kilmeade said on \"Fox & Friends.\"\n\nClinton in recent weeks has privately stated she would enter the race if she were certain she could win, The New York Times reported Tuesday.\n\nHILLARY CLINTON BACKS OUT OF DC EVENT ALSO SET TO INCLUDE TULSI GABBARD, KIRSTJEN NIELSEN: REPORT\n\nThe story -- titled “Anxious Democratic Establishment Asks, ‘Is There Anybody Else?’” -- said about a half-dozen Democratic donors gathered in New York City questioned whether former front-runner Joe Biden could stand strong against President Trump, citing Biden’s lackluster debate performance in Ohio last week.\n\nThey also raised concerns about the former vice president's fundraising struggles and his need to defend his family’s business dealings in Ukraine amid the ongoing Trump impeachment inquiry.\n\nHOUSE IMPEACHMENT INQUIRY IS 'POLITICAL REVENGE,' 'SHOULD BE DISMISSED QUICKLY' IN SENATE, LINDSEY GRAHAM SAYS\n\nThey also said Sens. Elizabeth Warren of Massachusetts and Bernie Sanders of Vermont were likely too liberal to win the general election.\n\nMeanwhile, The Washington Post, citing unnamed sources, reported that Clinton was considering a 2020 rematch against Trump after the State Department concluded this week there was \"no persuasive evidence of systemic, deliberate mishandling of classified information\" regarding Clinton's use of a private email server during her tenure as secretary of state.\n\nHost Ainsley Earhardt said people like retired Navy Adm. William McRaven and Sen. Sherrod Brown, D-Ohio, are being urged to run due to the \"weakness\" in the field. Other Democrats have urged former first lady Michelle Obama to run, though she said over the summer there is \"zero chance\" she will do so.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nKilmeade said traditional Democrats are concerned that proposing free health care for illegal immigrants, potentially taking away private insurance in favor of a \"Medicare-for-all system\" and imposing a Green New Deal on the energy industry will not appeal to voters in the middle.\n\n\"They're saying, 'You want to give a Green New Deal that would destroy the energy industry? You want to give free health care to illegal immigrants? What planet are you on that you want to take down ObamaCare?' ... That's what everyone is saying on these stages,\" he said.\n\nFox News' Danielle Wallace contributed to this report.", "description": "Many Democrats are reportedly getting anxious about the chances of the current set of 2020 presidential contenders due to their far-left policy proposals on health care, climate change and immigration.", "authors": ["David Montanaro", "David Montanaro Is A Senior Editor With Fox News."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/5947ec2f-kilmeade.jpg", "published_at": "2019-10-23"}