{"pub": "thehill", "url": "https://thehill.com/blogs/blog-briefing-room/news/465965-maine-high-school-suspends-three-girls-for-rape-awareness-note", "downloaded_at": "2019-10-15 23:52:51.984437+00:00", "title": "Maine high school suspends three girls for rape-awareness note posted in bathroom, saying it was bullying", "language": "en", "text": "Three girls were reportedly suspended from their high school in Maine for posting a note in the bathroom notifying fellow students that they believed one of their classmates was sexually assaulting others.\n\nThe Associated Press reports the three girls were suspended by Cape Elizabeth High School, which said the note constituted bullying.\n\nOne of the students, 15-year-old sophomore Aela Mansmann, is taking legal action with the backing of the American Civil Liberties Union (ACLU) of Maine.\n\nADVERTISEMENT\n\nThe Maine chapter of the ACLU filed a motion in federal court Sunday asking for a temporary restraining order against the district.\n\nThe high school has agreed to delay Mansmann's suspension until a hearing is held on October 21.\n\nMansmann’s message, displayed in the girl’s restroom on a sticky-note, alerted students that “there’s a rapist in our school and you know who it is.”\n\nShe and two other students left similar messages and alleged the school district did not take the accusations of sexual assault seriously enough.\n\nThe ACLU’s filing states that Mansmann has taken a “public stance as an ally for victims and survivors of sexual violence.”\n\nShe told the AP in an interview that she would continue to be a voice for raising awareness to sexual assault.\n\n“I think anyone that has experienced any sort of sexual violence or harassment is especially vulnerable when they are going through their healing process, and to have an ally who is willing to advocate for that, I think is crucial and beneficial,” Mansmann told the news outlet.\n\nJeffrey Shedd, the high school’s principal, sent a letter to the community last week saying that a male student who believed the note was directed towards him said he felt unsafe at school after the messages were posted.\n\nSuperintendent Donna Wolfrom declined to comment to the AP Tuesday. The Hill has reached out to the school district for comment on the matter.\n\nNone of Mansmann’s or the other students’ notes alleged they were victims of sexual assault. None of the notes mentioned students by name.\n\nThe two other students who were suspended have not been publicly identified.\n\nThe suspension at the high school just outside Portland led to a walkout consisting of roughly 50 students one day this month, the AP noted.", "description": "Three girls were reportedly suspended from their high school in Maine for posting a note in the bathroom notifying fellow students that they believed one of their classmates was sexually assaulting others.", "authors": [], "top_image": "https://thehill.com/sites/default/files/mainehighschool_101519_wgme.jpg", "published_at": "2019-10-15"}