{"pub": "independent", "title": "Westminster is used to manufactured outrage, but this was something else entirely", "url": "https://independent.co.uk/voices/editors-letter/brexit-prorogation-resigns-young-westminster-media-a9083776.html", "language": "en", "published_at": "2019-08-29", "downloaded_at": "2019-09-02 07:51:43.856345+00:00", "text": "Working at Westminster, you get used to the fact that there are some people who are quick to reach for the hyperbole and routinely brand their opponents’ actions an “outrage” or an “affront to democracy”.\n\nBut the response to Boris Johnson’s decision to suspend parliament for five weeks in the run-up to Brexit was an entirely different matter.\n\nNot only was the anger expressed in the strongest possible terms, it stretched across wide swathes of the political spectrum and included figures who would in normal times be the last you’d expect to mount the metaphorical barricades.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nWhen an urbane and unexcitable Westminster veteran like Lord Young, who has navigated 45 years in parliament without ever straying into rebellion, resigns with a warning that he is “very unhappy” with the course of events, it resonates in a way that a more hot-headed parliamentarian’s warnings of a “coup” might not.\n\nWhatever else Johnson may have achieved, prompting sober-minded figures like Philip Hammond to brand his course of action “profoundly undemocratic” while David Gauke condemned it as “a dangerous precedent” and Kenneth Clarke “plainly unconstitutional” is a mark of the deep unease he has sparked even in the traditional Tory mainstream.\n\nAnd when the speaker of the House of Commons describes advice given to the Queen by her prime minister as a “constitutional outrage” – as John Bercow did on Wednesday – you realise that we are venturing into entirely unprecedented territory.\n\nBercow’s comments were described by Jacob Rees-Mogg as the most unconstitutional thing that happened on Wednesday, and they are certain to be used against him by Brexit supporters who believed he stepped outside the neutrality of his role with the assistance he has given to MPs seeking to restrain the march towards Brexit.\n\nBut if he believes that a prime minister’s actions represent an “offence against the democratic process” preventing parliament from doing its duty, as he said, then many would argue that the speaker of all people has a responsibility to defend the Commons.\n\nWhat he will do remains to be seen. The fact that he appears to feel obliged to act is an indication of the depth of the constitutional crisis which the Brexit process has led the UK into.\n\nYours,\n\nAndrew Woodcock\n\nPolitical editor", "description": "Working at Westminster, you get used to the fact that there are some people who are quick to reach for the hyperbole and routinely brand their opponents’ actions an “outrage” or an “affront to democracy”. But the response to Boris Johnson’s decision to suspend parliament for five weeks in the run-up to Brexit was an entirely different matter.", "authors": ["Andrew Woodcock"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/07/29/14/rees-mogg.jpg"}