{"pub": "cnn", "url": "https://cnn.com/travel/article/best-museums-fashion-new-york/index.html", "downloaded_at": "2019-09-11 13:56:38.835264+00:00", "title": "The best NYC museums for fashion lovers", "language": "en", "text": "New York (CNN) — Fashion lovers, put on your walking shoes: It's time to see the best of the catwalk and beyond with a whirlwind tour of New York's museums.\n\nWhether you're interested in French couture, cutting-edge fashion, contemporary street style or some serious bling, there's something for you to feast your eyes upon in the exhibitions now when you travel to Manhattan and Brooklyn.\n\nStop into these New York City museums to see the wearable art on display -- and maybe even take some home with you.\n\nMuseum at FIT\n\nl e v a r t\n\nAs a first stop for fashion historians, it's only natural to go to the source: The Museum at FIT (Fashion Institute of Technology), a few blocks south of New York's Fashion District.\n\nThe latest exhibition, \"Paris: Capital of Fashion\" (on view through January 4, 2020), looks at the \"mythic glamour\" of the city, according to museum director Valerie Steele, and its centuries-old influence on designers of every nationality.\n\nHigh-fashion aficionados will thrill at seeing pieces such as the original Christian Dior dress from Richard Avedon's photo \" Dovima with Elephants ,\" Marie Antoinette-inspired confections from John Galliano, Chanel works from both Coco herself and Karl Lagerfeld, and more.\n\nThe Museum at FIT , 227 W 27th St., New York NY, 10001, +1 (212) 217-4558\n\nBrooklyn Museum\n\nVisitors travel through Star Trek-esque showrooms via \"Pierre Cardin: Future Fashion\" at the Brooklyn Museum. Jonathan Dorado/Brooklyn Museum\n\nThe cavernous halls of the Brooklyn Museum always lend themselves to big ideas, and it's a trip to experience shows such as \"Pierre Cardin: Future Fashion\" (on view through January 5, 2020).\n\nIn the exhibition, visitors travel through Star Trek-esque showrooms and space-age disco environments populated with Cardin's designs for clothing, accessories, runway presentations and other eye-pleasing delights.\n\nThough at first glance much of it can seem like a throwback, it's illuminating to consider how the still-living designer's visions of gender-fluid fashion and his savvy shift from French couture into the world of mass merchandising seem all the more relevant in today's design landscape.\n\nBrooklyn Museum , 200 Eastern Parkway, Brooklyn NY, 11238, +1 (718) 638-5000\n\nCooper Hewitt, Smithsonian Design Museum\n\nAt Cooper Hewitt on the Upper East Side, \"Nature\" looks at ways technology can enhance or modify fashion. Matt Flynn\n\nEven if you're not a designer yourself, it's illuminating to consider how a garment is made and the physical challenges of creating fashion. And when it comes to celebrating the process of design, the Cooper Hewitt is always the place to go.\n\nThe design triennial \"Nature\" (on view through January 20, 2020) looks at ways technology can enhance or modify fashion, from glowing silk dresses woven from genetically modified silkworms to Adidas shoes made from marine plastic waste and biofabricated alternatives to leather.\n\nThe companion exhibition \"Nature by Design\" follows the path of patterns such as paisley, as seen on traditional Kashmir shawls and contemporary designs by fashion house Etro and Bill Blass as well as the humble red bandana.\n\nCooper Hewitt , 2 East 91st St., New York, NY 10128, +1 (212) 849-8400\n\nRelated content What $34,000 can buy you at the Louvre in Paris\n\nMuseum of Arts and Design\n\nThe vibrantly painted scarves designed by 20th-century artist and entrepreneur Vera Neumann are evoked in the \"Vera Paints a Scarf\" exhibition at the Museum of Arts and Design. Jenna Bascom\n\nThe act of making is as much craft as it is art, and the Museum of Arts and Design brings this concept to the forefront. From the traditional to the technological, it showcases the techniques used in the creative process in its wide-ranging shows.\n\nIts newest exhibition, \"The World of Anna Sui\" (opening September 12, 2019, through February 23, 2020), looks at the imaginative pop culture approach of the designer and her myriad points of inspiration throughout her nearly 30-year career, including Victoriana, punk and American midcentury kitsch.\n\nAmong Sui's influences are the vibrantly painted scarves designed by 20th-century artist and entrepreneur Vera Neumann, which, conveniently, can be seen on the same visit in the colorful retrospective \"Vera Paints a Scarf\" (on view through January 26, 2020).\n\nRelated content A local's guide to Times Square\n\nMetropolitan Museum of Art\n\nThe venerable institution is a treasure trove of inspiration for the fashion-minded. Shutterstock\n\nEven when the Anna Wintour Costume Institute isn't stomping the halls of the Met with its annual summer blockbuster exhibitions, the venerable institution is a treasure trove of inspiration for the fashion-minded.\n\n\"Jewelry for America\" (on view through April 5, 2020) features more than 100 pieces from the Met's collection, including Cartier diamond and platinum lorgnettes, turn-of-the-century Tiffany necklaces, and even John Singer Sargent paintings, to trace the evolution of jewelry's status in America since the country's founding.\n\nFor the more textile-minded, \"Frank Lloyd Wright Textiles: The Taliesin Line, 1955-60\" (on view through April 5, 2020) shows a softer side of the famed architect through the commercial textile and wallpaper patterns he produced at the close of his career.\n\nWhitney Museum of American Art\n\nThe collaborative spirit of art and fashion intensified with the Whitney's move to the Meatpacking district in 2015. Shutterstock\n\nThe relationship between fashion and art has always been a strong one at the Whitney, and the collaborative spirit has become even more whimsical and wearable since the museum's move from the Upper East Side to the Meatpacking District in 2015.\n\nExclusive shop items tied to the museum's changing exhibitions (such as Hillflint sweaters and varsity jackets in honor of the latest Biennial) share shelf space with items by American designers that pay homage to the Whitney's permanent collections and institutional history.\n\nStop in the Whitney's museum shop and purchase a Thakoon tie in the same floral printed silk as the dress first lady Michelle Obama wore to the building's dedication ceremony. Kevin Hagen/Getty Images\n\nWhere else can you get an authentic Bollman Hat fedora inspired by the one worn by Edward Hopper, or a Thakoon tie in same floral printed silk as the dress first lady Michelle Obama wore at the new building's dedication ceremony?\n\nMuseum of Modern Art (MoMA)\n\nUntil the new MoMA building reopens to the public on October 21, design and fashion fiends can get their fix at the flagship MoMA Design Store across the street from the museum. Shutterstock\n\nUntil the new MoMA building reopens to the public on October 21, design and fashion fiends can get their fix at the flagship MoMA Design Store across the street from the museum.\n\nMoMA's design department champions the inherent value of good design in its permanent collection, and you'll find that democratization in the Design Store's inclusion of iconic streetwear such as New Era Yankees caps and Champion sweatshirts alongside Comme des Garcons wallets.\n\nFor a little art history with your casual wear, grab a MoMA version of the Armor Lux marinière, the traditional blue-and-white striped Breton shirt worn by Pablo Picasso and now available in variations such as rainbow Pride stripes.\n\nMuseum of Modern Art (reopening October 21, 2019), 11 W 53rd St., New York, NY, 10019, +1 (212) 708-9400", "description": "New York's museums hold more than famous paintings -- they are also a treasure trove for fashion lovers. Check out the best museums in Manhattan and Brooklyn if fashion is what you crave.", "authors": [], "top_image": "https://dynaimage.cdn.cnn.com/cnn/w_1200/http%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F190909124419-15-nyc-fashion-museum-photos-whitney-super-tease.jpg", "published_at": "2019-09-10"}