{"pub": "metro", "url": "https://metro.co.uk/2019/10/21/wales-star-josh-navidi-ruled-out-of-rugby-world-cup-after-sustaining-hamstring-injury-10955313", "downloaded_at": "2019-10-21 10:31:05.681912+00:00", "title": "Wales star Josh Navidi ruled out of Rugby World Cup with hamstring injury", "language": "en", "text": "Navidi left the field gutted to have suffered a hamstring injury (Picture: Getty)\n\nJosh Navidi will play no further part in Wales’ Rugby World Cup campaign after suffering a hamstring injury during the victory over France.\n\nNavidi was replaced by Ross Moriarty inside the first half-hour of Wales’ dramatic 20-19 victory and was immediately given ice and treatment on his left hamstring.\n\nMoriarty soon joined him on the bench due to a yellow card but claimed a late try to win the game and will be an automatic replacement in the starting XV for fellow No 8 Navidi.\n\nNavidi could only watch as his team-mates edged past France (Picture: Getty)\n\nHowever, the loss of Navidi, 28, will be keenly felt by the Wales squad who are currently preparing for a semi-final clash with South Africa on Sunday.\n\nWarren Gatland confirmed the injury in a press conference on Monday, revealing that Navidi had suffered a grade two hamstring tear.\n\nAdvertisement\n\nAdvertisement\n\nWhile Moriarty is the obvious choice to replace the Cardiff Blue at the base of the scrum, Wales will also fly out a squad replacement for the last two weeks of the tournament.\n\nBut Navidi is understood to be remaining with the squad because he is a crucial character in the dressing room.\n\nWales also have injury concerns over Hadleigh Parkes and Jonathan Davies ahead of Sunday’s semi-final and Gatland is thought to be considering flying out extra cover in midfield rather than another back-row forward.", "description": "Josh Navidi will play no further part in Wales' Rugby World Cup campaign after suffering a hamstring injury during the victory over France.", "authors": ["James Gray"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1182198755_1571653702.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-21"}