{"pub": "reuters", "url": "https://af.reuters.com/article/investingNews/idAFKBN1WT1SE-OZABS", "downloaded_at": "2019-10-14 23:27:19.553374+00:00", "title": "Zimbabwe aims to more than triple diamond production by 2023", "language": "en", "text": "HARARE (Reuters) - Zimbabwe expects to increase diamond production to 11 million carats by 2023 from 3.2 million carats last year, the mines minister said on Monday, part of an ambitious plan to raise mining output and earn the country $12 billion a year.\n\nZimbabwe's Minister of Mines Winston Chitando speaks at a mining investment conference in Harare, Zimbabwe, February 28, 2018.REUTERS/Philimon Bulawayo/File Photo\n\nThe mineral-rich southern African nation sees the mining sector as the main driver for reviving an economy crippled by triple-digit inflation and high unemployment.\n\nStill, many investors fret about whether they can take money out because of acute dollar shortages.\n\nZimbabwe’s government has previously set ambitious targets on mining production but output has rarely met those goals because investors often cite archaic investment regulations and uncertainty over the safety of their investment.\n\nUnder President Emmerson Mnangagwa’s Zimbabwe is “open for business” mantra, the government has promised more favourable terms for those investing in the country, but big investors are still staying away for now.\n\nWinston Chitando said production by four companies - including Alrosa and Chinese-owned Anjin - would help drive up diamond output, mostly from the eastern Chiadzwa area.\n\nAnjin plans to restart mining after being kicked out from Chiadzwa for refusing to merge with the state diamond firm in 2016, while Alrosa has plans to start prospecting and mining diamonds in the area. UK-listed Vast Resources is expected to sign a deal this week to search for diamonds.\n\nChitando also said gold, the single biggest mineral export, would generate $4 billion in four years time while platinum would bring in another $3 billion as a raft of projects come on stream.\n\nAnglo Platinum and Impala Platinum Holdings have platinum mines in Zimbabwe.\n\nKaro Resources, partly owned by South Africa’s Tharisa Holdings is building an integrated platinum mine and refinery while a Russian consortium and Zimbabwean investors are developing a platinum project near Harare.", "description": "Zimbabwe expects to increase diamond production to 11 million carats by 2023 from 3.2 million carats last year, the mines minister said on Monday, part of an ambitious plan to raise mining output and earn the country $12 billion a year.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191014&t=2&i=1440744137&w=1200&r=LYNXMPEF9D16N-OZABS", "published_at": "2019-10-14"}