{"pub": "cnn", "url": "https://cnn.com/2019/10/29/asia/china-xinjiang-united-nations-intl-hnk/index.html", "downloaded_at": "2019-10-30 04:15:51.345111+00:00", "title": "Xinjiang camps: UN members issue dueling statements over China's treatment of Uyghurs", "language": "en", "text": "Hong Kong (CNN) Two groups of United Nations member states issued dueling statements over China's treatment of the predominantly Muslim Uyghur minority in Xinjiang, highlighting a global divide on Beijing's human rights record.\n\nSpeaking at the UN General Assembly on Tuesday, a representative for the UK issued a statement on behalf of 23 countries raising concerns over alleged human rights abuses in Xinjiang\n\n\"(There are) credible reports of mass detention, efforts to restrict cultural and religious practices, mass surveillance disproportionately targeting ethnic Uyghurs, and other human rights violations and abuses in the region,\" Karen Pierce said.\n\nThe 23 countries, including the United States, Canada, Japan and Australia, all called on China to \"uphold its national and international obligations and commitments to respect human rights,\" as well as to provide access to Xinjiang for international monitors.\n\nJUST WATCHED US blacklists 28 Chinese organizations and companies Replay More Videos ... MUST WATCH US blacklists 28 Chinese organizations and companies 00:45\n\nShortly after the UK's statement however, Beijing's ally Belarus made its own statement on behalf of 54 countries voicing approval of China's \"counter-terrorism\" program in Xinjiang. Signatories included Russia, Egypt, Bolivia and Serbia.\n\nRead More", "description": "Two groups of United Nations member states issued dueling statements over China's treatment of the predominantly Muslim Uyghur minority in Xinjiang, highlighting a global divide on Beijing's human rights record.", "authors": ["Ben Westcott", "Richard Roth"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191006213839-china-leaked-video-rivers-pkgyoutube-war-on-fear-super-tease.jpg", "published_at": "2019-10-29"}