{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/21/beto-orourke-ridiculous-gun-grab-plan-blasted-by-p", "downloaded_at": "2019-10-22 13:34:40.907502+00:00", "title": "Beto's 'ridiculous' gun-grab plan blasted by police groups: 'Many sheriffs would not comply'", "language": "en", "text": "Presidential hopeful Beto O’Rourke’s gun control plans are being blasted as “ridiculous” and “asinine” by police groups representing hundreds of thousands of officers.\n\nGun expert Stephen Gutowski of The Washington Free Beacon interviewed influential members of the National Fraternal Order of Police, the National Sheriffs’ Association, the National Association of Police Organizations and others to see how law enforcement would respond to the Democrat’s mandatory buyback plans if they were ever realized.\n\nIn short: the former Texas congressman would face widespread dissent among law enforcement personnel in addition to various legal battles.\n\n“Mr. O’Rourke may not be aware that state and local police officers (who comprise more than 90% of all police in the U.S.) receive their orders from their local jurisdictions — not from the federal government,” Jim Pasco, executive director of the National Fraternal Order of Police, told the website for an interview published Monday.\n\n“I think he’s seriously misjudging the law enforcement response to what he wants to do,” added AJ Louderback, sheriff of Jackson County, Texas. “Many sheriffs would not comply with his plan. … This guy’s plan is ridiculous. Everyone is looking for solutions to violent crime but this isn’t one of them. I’m not going to harass my citizens for owning guns.”\n\nMr. Louderback also represents over 3,000 sheriffs as part of the National Sheriffs’ Association’s immigration and government affairs committees.\n\nAnother representative of a national law enforcement group asked to remain anonymous while noting: “I find it really telling now that someone who attacked law enforcement, even calling them Jim Crow, for his convenience is perfectly fine with sending them off into harm’s way to collect AR-15s.”\n\n“It’s just asinine,” the Free Beacon’s source added.\n\nMr. O’Rourke’s campaign captured national headlines last month during a Houston debate in which he empathically supported gun confiscation across the U.S.\n\n“Hell, yes, we’re going to take your AR-15, your AK-47,” he said when asked about his legislative endgame. “We’re not going to allow it to be used against our fellow Americans anymore.”\n\n\n\nThe Democrat also started selling “HELL YES WE’RE GOING TO TAKE YOUR AR-15” apparel on his campaign website for $30 in multiple styles for men and women.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Presidential hopeful Beto O'Rourke's gun control plans are being blasted as \"ridiculous\" and \"asinine\" by police groups representing hundreds of thousands of officers.", "authors": ["The Washington Times Http", "Douglas"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/15/Election_2020_Debate_17042.jpg-66294_c0-0-3649-2128_s1200x700.jpg?0d792cc76991f51587962c8553a3c7811f32dd7f", "published_at": "2019-10-21"}