{"pub": "yahoo", "url": "https://news.yahoo.com/tucker-carlson-mocks-fox-colleague-015520592.html", "downloaded_at": "2019-09-26 07:52:37.103346+00:00", "title": "Tucker Carlson Mocks Fox Colleague Shep Smith for Defending Fox News Analyst", "language": "en", "text": "Hours after Fox News anchor Shepard Smith blasted frequent network guest and Trump ally Joe diGenova for calling Fox News senior judicial analyst Judge Andrew Napolitano a “fool” during Tucker Carlson’s show, Carlson devoted a Wednesday night segment to mocking Smith’s outrage and defense of their mutual colleague.\n\nInviting diGenova back on his program on Wednesday night, Carlson noted that the Trump-boosting lawyer’s insult of Napolitano caused “quite a firestorm,” reminding viewers that diGenova was responding to Napolitano’s assertion that Trump committed a crime with his phone call to the Ukrainian president. Carlson then took aim at Smith.\n\n“Apparently our daytime host who hosted Judge Napolitano was watching last night and was outraged by what you said and, quite ironically, called you partisan,” Carlson exclaimed in a rather jovial manner.\n\nThe Fox News star went on to air a clip of Smith not-so-subtly calling out Carlson for letting a “partisan guest” attack Napolitano without being challenged. “Attacking our colleague, who is here to offer legal assessments on our air in our work home, is repugnant,” Smith added.\n\n“Repugnant!” Carlson mockingly shouted. “Not clear if that was you or me, but someone was repugnant!”\n\nPlaying another clip of Napolitano reiterating his view that Trump broke the law by seeking election assistance from a foreign leader, the primetime Fox star insisted that “unlike maybe some dayside hosts, I’m not very partisan.”\n\nAfter accusing Smith of being partisan, the conservative talk show host opened the floor for diGenova to continue to rail against Napolitano’s analysis. “I was very truthful last night,” diGenova said.\n\n“So that’s why it doesn’t seem honest to me when a host, any host on any channel, including this one, pretends that the answer is obvious,” Carlson stated. “That there is ironclad consensus about what the answer is when there, in fact, isn’t, when it’s a subjective question. That’s not news, is it? That’s opinion.”\n\ndiGenova, meanwhile, insisted he was absolutely right to claim Trump has not committed any crimes because he’s a former U.S. attorney before taking some additional shots at Napolitano.\n\n“He is entitled to feel that way,” the Trump-supporting lawyer declared. “He is a disappointed office seeker. He didn’t get the seat on the Supreme Court that he desperately wanted and he has been mad about it ever since. He showed it yesterday and he showed it so many times over the last year it’s pretty embarrassing actually for me. You know, I love the guy. God bless him.”\n\n“I do too,” Carlson replied. “We invited him on tonight by the way. It makes people cynical when you dress up news coverage, when you dress up partisanship as news coverage and pretend that your angry political opinions are news. You know, people tune out.”\n\nThis wasn't the only time we saw friendly fire on Carlson's show Wednesday night. Earlier in the program, Fox News reporter Trace Gallagher said “most legal analysts, even on the liberal media outlets, acknowledge it would be very difficult to make a case that President Trump broke the law.” This would, however, contradict Napolitano's assessment, as well as a number of lawyers and legal analysts Smith also cited on Wednesday to show Trump broke the law.\n\nRead more at The Daily Beast.\n\nGet our top stories in your inbox every day. Sign up now!\n\nDaily Beast Membership: Beast Inside goes deeper on the stories that matter to you. Learn more.", "description": "Hours after Fox News anchor Shepard Smith blasted frequent network guest and Trump ally Joe diGenova for calling Fox News senior judicial analyst Judge Andrew Napolitano a “fool” during Tucker Carlson’s show, Carlson devoted a Wednesday night segment to mocking Smith’s outrage and defense of their mutual", "authors": ["Justin Baragona"], "top_image": "https://s.yimg.com/uu/api/res/1.2/T4KN2KWgUSzZIoo3SHBXhQ--~B/aD0zNjA7dz02NDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/thedailybeast.com/4e0bd33275b7898d0965dda2171fe564", "published_at": "2019-09-26"}