{"pub": "cnn", "url": "https://cnn.com/2019/09/25/tech/stockx-detroit-sneaker-startup/index.html", "downloaded_at": "2019-09-26 05:23:23.570932+00:00", "title": "StockX: Detroit's first unicorn wants to be a 'stock market of things'", "language": "en", "text": "Hong Kong (CNN Business) Detroit finally has its first unicorn: a hip, very millennial sneaker trading platform that wants to create a so-called \"stock market of things.\"\n\nStockX, an online marketplace for rare kicks including Jordans and Yeezys, allows users to track shoe collections like asset portfolios and brands to hold \"IPOs\" for new products.\n\nIn June, the startup hit a new milestone, notching a billion-dollar valuation after raising the largest round of venture capital funding in Michigan history, according to data provider PitchBook.\n\nNow the company is sharing more on its strategy to ride the booming sneaker craze and its effort to eliminate retail pricing, not just for limited-edition items.\n\nStockX's website looks more like trading platform Fidelity than it does Adidas. If you click on a pair of cream white Yeezys, you'll see how much its sale price has fluctuated over the last 12 months, a \"ticker,\" a 52-week high and a gauge for price volatility.\n\n\"Demand has always been a guess, a forecast, an estimate, a projection off of last year — except in the stock market,\" Josh Luber, StockX's co-founder and former CEO told CNN Business in a recent interview in Hong Kong. Luber currently serves on the leadership team and board of directors.\n\n\"If you're buying a share of Nike stock on the New York Stock Exchange, there's one ticker symbol for Nike and there's one price for Nike ... It is standardized. And that is literally the rule for us, is to take a consumer good and make it functional in a stock market.\"\n\nThe site, which started off in footwear and went live in 2016, has resonated with sneaker fans. It has expanded rapidly over the years, branched out into new categories, racked up hundreds of thousands of sellers and gained customers in nearly 200 countries.\n\nResetting retail\n\nThe idea was first born about nine years ago, when Luber, a former IBM consultant who'd been collecting shoes since he was eight, found a way to track auction data for sneakers on eBay. He decided to turn it into a price guide called Campless, \"a play off the fact that people camp out for shoes,\" he said. \"No more — camp less.\"\n\n\"I have a pretty reasonable collection in the sneaker world,\" says StockX co-founder Josh Luber. \"It's around 400 pairs.\"\n\nIn hopes of monetizing the project, Luber requested meetings with \"everybody,\" he said. \"Nike, eBay, Foot Locker, Complex, you name it.\"\n\nNothing stuck until 2015, when a representative for Dan Gilbert, the billionaire founder of mortgage lender Quicken Loans and owner of the NBA's Cleveland Cavaliers, got wind of the concept — and reached out.\n\nLuber couldn't believe his luck. \"There was maybe one guy in the whole world who had this exact same idea at the exact same time, and it happens to be one of the most successful business people in the world,\" he said. They agreed to team up.\n\nThe sneaker business\n\nStockX makes money through transaction fees, and sees millions of dollars in activity on its platform each day, according to a spokesperson. As of June, the most recent month for which the company made its figures available, revenue had doubled over the past year — and a representative said it's projecting similar growth this year.\n\nExperts chalk up the company's ascent to two trends: The rise of streetwear culture, which has exploded around the world, and the need for a trusted resale outlet with modern-day conveniences.\n\nSneakers and streetwear are \"very hot now,\" said Sucharita Kodali, an e-commerce and retail analyst at Forrester.\n\nAs much as 85% of growth in the global luxury goods market in 2017 came from millennials and younger consumers, which has led more brands to embrace streetwear, according to a Bain report . At the same time, some customers said they were getting tired of buying sneakers on eBay or on random Facebook groups, where there was constant worry about getting duped.\n\n\"The resale platforms give buyers and sellers a secure and convenient way to trade sneakers,\" said Matt Powell, a sports business analyst at the NPD Group. \"Prior to the platforms, sales were much more complicated and risky.\"\n\nA StockX employee processing a pair of sneakers. The company started with six employees and has since grown to a headcount of 800.\n\nStockX isn't the only player in this space. GOAT Group, another sneaker resale startup based in Los Angeles, is a major competitor and won a $100 million investment from Foot Locker earlier this year.\n\nTo alleviate concerns, both companies enlist armies of people to sift through and authenticate the shoes and other designer goods sold on their platforms. That has helped them win trust with customers.\n\n\"Fakes are becoming better and better by the day,\" said Billy Woodward, a StockX user who has collected about 250 pairs of sneakers and is based in San Antonio, Texas. \"The authentication process is a big deal for me.\"\n\nNike NKE Adidas ADDDF The practice could catch on with traditional retailers, too. One day,andwill likely also get in the game of verifying used merchandise, predicts Kodali.\n\n\"They can capture the profit from the secondary market, or they can choose to destroy or save the shoes that come back to them to increase the value of what continues to be in circulation,\" she explained. \"Frankly, I'm surprised it hasn't happened yet.\"\n\nTrading sneakers like stocks\n\nSome customers say the platform has made them rethink how they view consumer goods.\n\n\"I absolutely believe that StockX has changed the game,\" said Woodward, who uses the company's app to check the latest price fluctuations on shoes he's coveting. \"I will use them to see if a sneaker that I don't necessarily want to own for my personal collection is going to generate a profit for me and how much that profit could be.\"\n\nA pair of shoes listed on StockX.\n\nOthers are more skeptical.\n\n\"I generally don't believe in and am not interested in treating the sneakers I've bought and collected purely as an investment,\" said Brendan Dunne, a deputy editor at Complex and co-host of \"Full Size Run,\" a weekly online sneaker talk show. Dunne owns about 700 pairs of sneakers, dozens of which he has bought and sold on StockX.\n\n\"To turn them into a number would be to strip them of their true value, which is sentimental,\" he added.\n\n'IPO' for shoes\n\nStockX doesn't plan to stop there. Someday, users will also be able to exchange goods without ever taking possession of them, said Luber. \"You can literally have day trading. This is like oil futures.\"\n\nOne of the startup's most important plans for growth also happens to rest on perhaps its loftiest idea: getting retailers to treat its platform as a full-fledged distribution channel. That means putting out new products through a process called a \"blind Dutch auction,\" which lets users bid what they want while setting a winning price based on the amount of merchandise available.\n\n\"We literally talk about it as IPOing products into existence,\" said Luber.\n\nStockX employees examining shoes at a company facility. The startup is based in Detroit, where it recently raised the largest round of venture capital funding ever seen in Michigan.\n\nThe company tested out the concept in January, hosting an \"initial public offering\" for a pair of slides designed by Ben Baller, a celebrity jeweler.\n\nCustomers showed up: Over three days, more than 10,000 bids were placed on 800 pairs of shoes, and users who made the highest offers won, according to StockX. But because of the way the auction was set up, they all paid the same amount.\n\nThe way the company sees it, it's a win-win. \"If the [goods] were released in stores, you might have seen campouts and crowd control issues. If released online, sites would've crashed or bots would've gotten them all,\" it said in a blog post . \"We think this [is] a fundamentally better way to release and price hyped products.\"\n\nGoing global\n\nWorking with brands is just one of three ways that StockX hopes to grow over the next year. The team of 800 has ambitious expansion plans that are bankrolled by a roster of high-profile investors, including Silicon Valley heavyweights GGV Capital, GV (formerly known as Google Ventures) and Marc Benioff. Even celebrities such as Eminem, Steve Aoki, Karlie Kloss and Mark Wahlberg have jumped onboard.\n\nA big part of the pitch to investors has been international growth, which Luber described as the company's \"highest priority.\"\n\n\"In the US, we started to see that, 'Hey, street culture is becoming a lot more vibrant.' And streetwear captured that,\" said Hans Tung, a managing partner at GGV Capital and StockX board member.\n\n\"In China, we noticed the same thing ... And when you see that happening in the two biggest markets in the world, it doesn't take a rocket scientist to see that other parts of the world are following as well, and be like, 'We gotta be in this market.\"\n\nA StockX worker authenticating a Louis Vuitton handbag in Detroit. Verifying designer merchandise has helped the company build trust with users, who often worry about getting duped online.\n\nAbout a quarter of StockX's business comes from outside the United States, particularly from countries such as China and Japan. The company declined to share specific projection numbers, but said it aims to become a household name over the next three years by adding more teams overseas and rolling out its service in different languages.\n\nThe company also plans to capitalize on its existing user base by adding more products, such as watches, handbags and collectibles.\n\nAlthough StockX's core approach is unique for retail, Luber said it's a tried-and-true tactic; one \"we didn't make up.\"\n\n\"The stock market has been the most efficient form of commerce for 200 years,\" Luber said. \"All we did was copy that, and point it from old commodities, like stocks and bonds and oil and gas, to new commodities, like streetwear and watches and handbags.\"", "description": "Helping people buy and sell Jordans and Yeezys has turned into a billion-dollar business for one startup.", "authors": ["Michelle Toh", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190731105052-josh-luber-stockx-sneakers-super-tease.jpeg", "published_at": "2019-09-25"}