{"pub": "zdnet", "url": "https://www.zdnet.com/article/hey-google-what-we-search-for-most-in-cybersecurity", "downloaded_at": "2019-09-13 00:57:26.562628+00:00", "published_at": "2019-09-12", "title": "Hey Google: What we search for most in cybersecurity .. cyber security?", "language": "en", "text": "A scanner app with 100 million downloads starts to deliver malware An Android Google play app, available since 2010, has recently started installing malware.\n\nIn recent years, cybersecurity -- or cyber security, depending on your preferred usage -- has become a frequent topic.\n\nEscalating cases of fraud, cybercrime, and data breaches have ensured that terms relating to cybersecurity, whether it be phishing or account compromise, have entered the consumer space and are no longer just known by professionals in the industry.\n\nGoogle, as the provider of one of the most popular search engines in the world, can provide an interesting resource to find out what areas of cybersecurity we are interested in, how threats are evolving -- alongside our knowledge of them -- and which vulnerabilities and attacks have gained the most widespread attention.\n\nThis week, incident response platform Redscan published the results of research (.PDF) into Google cybersecurity-related search trends and their popularity based on Google Trends data from 2004 - 2019.\n\nThe most-searched-for public figure in the industry is Robert Herjavec, investor and CEO of IT security firm Herjavec Group. Searches for Herjavec take place four times as often as those for Kevin Mitnick, dubbed the \"world's most famous hacker\" and now an active security consultant.\n\nIn addition to Herjavec and Mitnick, John McAfee, Bruce Schneier, and Troy Hunt are in the top five most searched-for security professionals.\n\nThe cybersecurity companies that most commonly feature on general Google searches are Norton, Avast, AVG, Kaspersky, and ESET. When it comes to enterprise-related queries, Symantec, Fortinet, Akamai, Mimecast, and FireEye are the most popular, according to Redscan.\n\nSee also: Google discloses vulnerability in Chrome OS 'built-in security key' feature\n\nIf you receive a strange call from an unknown number, you may take to a search engine to see if the number has been connected to scams by other people. In the same manner, phishing emails pretending to be legitimate brands are also continually searched for, and the report shows that Apple is a name continually abused by fraudsters.\n\nThe iPad and iPhone maker snagged the top spot as the most-searched-for brand in relation to phishing scams, followed by PayPal, HMRC, Amazon, and NatWest.\n\nTo date, Equifax has the dubious honor of being the company most commonly connected to searches related to data breaches. The credit monitoring agency was compromised in 2017, leading to the exposure of sensitive data belonging to almost 150 million people.\n\nGiven the mammoth data breach's reach and impact, it is not surprising that Equifax is the most-searched-for data breach. While the majority of queries were made at the time of disclosure, there has been a recent uptick likely owing to a settlement reached between the company and the US Federal Trade Commission (FTC).\n\n\"The fact that Equifax disclosed the breach late and communicated details poorly may also have had an impact on search behavior, driving people to find out whether their details had been stolen,\" Redscan says. \"Indeed, interest in the Equifax data breach is so high that it skews all historical searches for the term 'data breach.'\"\n\nRedscan\n\nCNET: Spotify wants to know where you live, and will be checking in\n\nOther data breaches of note that have been commonly searched for are Ashley Maddison, TalkTalk, the Sony PlayStation Network, Yahoo, and Anthem.\n\nThe vulnerabilities sometimes responsible for high-impact data breaches or those that may invade the nightmares of IT professionals are also searched for on a regular basis. Over the last decade, Heartbleed -- a security flaw disclosed in 2014 which impacted servers making use of OpenSSL's 1.0.1 and 1.0.2-beta release -- remains the most-searched-for security threat.\n\nTechRepublic: How to enable DNS-over-HTTPS in Firefox\n\nIndeed, despite the worldwide disruption caused by the WannaCry ransomware outbreak and another severe hardware-based vulnerability called Meltdown also reaching global news, neither is as popular as search queries.\n\nIt also seems that traditional security terms are on the decline, with searches for terms including 'keylogger' and 'antivirus' reducing in popularity. Instead, Google Trends data suggests that endpoint and cloud-based security is on the up, with a gradual increase in the search for terms such as cloud security, SIEM, Mobile Device Management (MDM), bring your own device (BYOD), and IoT security.\n\nAs a final point of interest, it seems we are yet to decide on whether we prefer cybersecurity or cyber security. Cyber security is more popular in worldwide searches, but in the US, cybersecurity remains the preferred option.\n\nPrevious and related coverage\n\nHave a tip? Get in touch securely via WhatsApp | Signal at +447713 025 499, or over at Keybase: charlie0", "description": "Google search data reveals the most popular hacker in the world, alongside the cybersecurity topics we care most about.", "authors": ["Charlie Osborne"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2019/09/12/cba13830-f8c9-4cc3-a4ba-c44f69e95aa5/thumbnail/770x578/f60307e7f165347c4a8164f80b707d8f/screenshot-2019-09-12-at-14-09-12.png"}