{"pub": "metro", "url": "https://metro.co.uk/2019/10/25/call-duty-modern-warfare-campaign-review-moral-combat-10981575", "downloaded_at": "2019-10-25 15:57:45.629940+00:00", "title": "Call Of Duty: Modern Warfare campaign review – moral combat", "language": "en", "text": "Call Of Duty: Modern Warfare (PS4) – Captain Price is not one to worry about collateral damage\n\nThe story campaign for the new Call Of Duty is the most violent and disturbing so far, but what does it have to say about modern warfare?\n\nCall Of Duty has been through all this before. Not just the idea that this year’s game is going to be the one that rejuvenates the series, following the encroachment of Fortnite and others (which has been going on since 2017’s WWII) but the concept of having a purposefully shocking story campaign that rips scenarios from news headlines and presents its violence and excess as an attempt to portray the realities of modern warfare.\n\nIt certainly worked for the original Modern Warfare back in 2007, of which this is a loose reboot, but reached the pinnacle of its shamelessness with 2009’s Modern Warfare 2 and its infamous No Russian mission – where you got to take part in a civilian massacre at an airport. The inclusion of that scene was always indefensible, but it certainly did its job in terms of causing controversy and getting the game talked about.\n\nAdvertisement\n\nAdvertisement\n\nThis new Modern Warfare has one eye on that same ploy but rather than pure exploitation tries to wrap it in a story that does have something intelligent to say about modern soldiery. The idea that there’s some kind of thoughtful anti-war message going on at the game’s heart, as suggested before the game’s release, is debatable, but while the campaign remains bombastic and exciting Modern Warfare has finally shaken off the ghost of Michael Bay and is now something that can be taken a lot more seriously.\n\nAs usual (except for last year’s Black Ops 4, which had a Battle Royale mode instead of a story campaign) Call Of Duty is a game of three parts: the campaign, the multiplayer, and a co-op mode. We’ll deal with the latter two at a later date, not least so we can play it on live servers, so this review will consider only the single-player campaign.\n\nThe campaign works along the same principles as the earlier games, in that you control multiple different characters which are switched in and out as the story demands. None of them, no matter how important they seem to be, is safe from a scripted death if the game deems it necessary, to the point where you even worry about the seemingly invincible Captain Price. Although this time you also get to play as a rebel fighter called Farah, who’s from a fictional Middle East country and easily the game’s most interesting and sympathetic character.\n\nAdvertisement\n\nAdvertisement\n\nThe plot has similar ingredients to the original, with Russians and an Al-Qaeda like terrorist group your main opponents. But while they are still the obvious go-to villains for a game like this, they’re not really the focus of the narrative. Instead, the game is interested in portraying not just the horrors of war but the very modern problem of civilian involvement and where the lines blur between innocent people and legitimate combatants.\n\nModern Warfare absolutely earns its 18-rating, not so much in terms of the gore but the genuinely disturbing scenarios that are brought up, including torture, purposeful civilian deaths, and chemical warfare. For example, the already infamous flashback sequence with Farah as a child, which was teased before the game’s release, involves a chemical attack on a town and her having to knife to death a full-grown Russian soldier while she’s just a child.\n\nIt’s all deeply upsetting stuff, as is another scene which, like No Russian, you don’t even have to get involved in if you don’t want to – and yet, unlike No Russian, there is a clear point being made by it. In each case the protagonist feels they’re doing the right thing, and often the end result is beneficial, but the cost is always perilously high. It’s also interesting that the three main groups of protagonists all have a different approach, with Farah being the moral centre and Price far more willing to perform questionable acts for the supposed greater good.\n\nCall Of Duty: Modern Warfare (PS4) – COD with a conscience\n\nThe disappointment with the story campaign though is that it doesn’t quite have the courage to follow through entirely. While you’re playing, you’re constantly questioning what you’re doing and the motivations of the characters, but by the end the story lets them all off the hook and meekly decides that since they all meant well there’s no need to question things further. You as player will, but it’s a shame the game cops out from doing so.\n\nAdvertisement\n\nThe campaign also could have been a little braver in terms of breaking past the established Call Of Duty gameplay conceit of listening to the instructions of a commanding officer and essentially just doing what you’re told. This has been at the heart of series’ single-player gameplay for a decade now and even with the amazing visuals of this new game the spell is often broken and you realise you’re just carrying out stage directions that are very difficult to get wrong and where there’s little to no punishment if you do.\n\nModern Warfare is aware of how familiar its tricks will be to veteran players though and it does manage to subvert itself on a few occasions, most notably when you’re directing someone yourself using security cameras to help them escape from an embassy.\n\nOf course, that’s not an issue in more action-oriented sections, which rely on the series’ always excellent gunplay, but that’s never really been what the campaigns are about – since if you wanted all-out action you’d just go and play the multiplayer. Not that those sequences aren’t entertaining but the ones you’ll remember are usually those where Price is whispering instructions to you over your earpiece and the tone is closer to that of a stealth game than a multiplayer shooter. (And, yes, of course there’s a version of All Ghillied Up, although it’s not a just a straight rehash, which is appreciated.)\n\nAdvertisement\n\nCall Of Duty: Modern Warfare campaign review summary\n\nDespite its issues this new Modern Warfare is an impressive achievement and deserves to be taken seriously. Or at least it would be if not for the fact that despite all its careful consideration of the civilian cost of war and acceptable modern tactics it then goes and throw white phosphorous into the multiplayer mode, which seems to contradict everything the campaign is about. The Call Of Duty campaigns have often felt like their own separate games and this more than ever feels like it probably should have been.\n\nIt’s not only of a high enough quality to stand on its own but it wouldn’t have to mix its messages by being just one third of a larger package. Whether that will ever happen we don’t know but as disturbing as it is it’s good to have the campaign back and it’s impressive to see it take itself so seriously.\n\nScore: 7/10\n\nFormats: PlayStation 4 (reviewed), Xbox One, and PC\n\nPrice: £59.99\n\nPublisher: Activision\n\nDeveloper: Infinity Ward\n\nRelease Date: 25th October 2019\n\nAge Rating: 18\n\nEmail gamecentral@ukmetro.co.uk, leave a comment below, and follow us on Twitter\n\nMORE: Call Of Duty: Modern Warfare has leaked and people are already playing it\n\nMORE: Call Of Duty: Modern Warfare will not have loot boxes at launch says Infinity Ward\n\nMORE: Fans angry at Call Of Duty: Modern Warfare Survival mode PS4 exclusivity", "description": "The story campaign for the new Call Of Duty is the most violent and disturbing so far, but what does it have to say about modern warfare?", "authors": [], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/05/Screenshot_4-46c3_1571998275.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-25"}