{"pub": "yahoo", "url": "https://news.yahoo.com/cody-simpson-just-said-relationship-081600214.html", "downloaded_at": "2019-10-14 11:48:00.665091+00:00", "title": "Cody Simpson just said that his relationship with Miley Cyrus isn't a \"sudden thing\"", "language": "en", "text": "From Cosmopolitan\n\nCody Simpson just talked about his relationship with Miley Cyrus, saying that they're \"very, very happy.\"\n\nThe two were spotted making out just ten days ago, and have been Instagramming about their romance ever since.\n\nI bet you thought that after the last ten days of Miley Cyrus and Cody Simpson being very public about their new romance that it might calm down a bit, but you'd be wrong because Cody is now out here sharing even more details about their relationship.\n\nPeople reports that Cody opened up about dating Miley at an event on Friday, saying:\n\nI’m very happy. We are very, very happy. She’s creative. She’s very passionate about what she does, and I’m very similar in that sense. That’s why we get along so well. We just have a ball, yeah, and that’s the most important part of a relationship, you know? The reason why it hasn’t been a really crazy sudden thing is just because we’ve been friends for so long...[we] found each other again in a space where we’re both not partying, working real hard, and it just keeps things healthy and it’s good.\n\nHe also adds that this relationship with Miley is unlike anything he's had before, saying, \"Any girlfriends I’ve had in the past has always been immediate romance and so it’s a different experience having been friends with somebody before and it developing naturally into something more.\"\n\nAnd if \"developing naturally\" means Cody writing a poem about \"making love\" to Miley, Miley going on a major rant about people judging her love life, and Cody having a \"huge\" crush on Miley for the past seven years, then sure! This all seems very natural and normal!!!\n\nYou Might Also Like", "description": "Um, what is he trying to say here?!?", "authors": ["Alanna Lauren Greco"], "top_image": "https://s.yimg.com/uu/api/res/1.2/YPRifnw7cMAVIdtHpC3upQ--~B/aD0zNzc7dz03NDg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/cosmo_633/fa7decfab2702809865995d023a196b1", "published_at": "2019-10-14"}