{"pub": "npr", "title": "'Succession': Back To The Pit Of Vipers For Another Season Of Discontent", "url": "https://npr.org/2019/08/12/750189331/succession-back-to-the-pit-of-vipers-for-another-season-of-discontent", "language": "en", "published_at": "2019-08-12", "downloaded_at": "2019-09-02 07:24:19.429408+00:00", "text": "'Succession': Back To The Pit Of Vipers For Another Season Of Discontent\n\nEnlarge this image toggle caption Craig Blankenhorn/HBO Craig Blankenhorn/HBO\n\nHow audacious do you have to be — how direct, how unafraid of accusations that what you're doing is a little on-the-nose — to just go ahead and name a ruthless character \"Shiv\"?\n\nYou have to be as audacious as Jesse Armstrong, the creator of Succession, the Emmy-nominated drama that returned to HBO for its second season on Sunday night.\n\nShiv, in addition to being a word commonly associated with the stabbing of one criminal by another, is a nickname here for Siobhan. She's one of the four children of Logan Roy, the media megamogul played by Brian Cox. Not only is Cox playing a King Lear type, but he is known among other things for actually playing King Lear, so here we are again with Armstrong's delicious refusal to be coy.\n\nPart corporate thriller, part black comedy and part grand family tragedy, Succession follows the Roys as Logan toys with his awful, spoiled, conniving children, and they scheme behind his back to gain his favor or undermine him, depending on the needs of the moment.\n\nShiv, played by Sarah Snook, is Logan's only daughter. She's smart and ruthless and, like a lot of women in organizations that are in trouble, she's not often called upon to lead even though she seems eminently qualified. Roman (Kieran Culkin) is a quick-tongued, profane, heedlessly cruel smart-ass; Connor (Alan Ruck) is a superficially dignified aspirant to politics who fancies himself above the shenanigans of his family and might be the most dangerous of all of them; and Kendall is the most earnestly determined to somehow both supplant his father and earn his approval, once and for all.\n\nPortrayed by Jeremy Strong as a sweaty, nervous wretch, Kendall is Succession's most obviously tragic figure. The first season traced his disappointment at not being named his father's successor, then tracked his attempt — attempts, actually — to overthrow Logan and take over. (It's a clever touch that the family business, Waystar Royco, is an empire that includes not only news and entertainment, but amusement parks and resorts, too. That offers Armstrong the opportunity to transport various Roys from time to time to the most grimy and proletariat of environments: the American family vacation.) The particulars of the corporate maneuvering weren't important in the first 10 episodes; what mattered was that by the time the season finale came around, Kendall was ready to break from his father for good by ousting Logan from his own company with the help of some of his worst enemies. Kendall had, in fact, already come to his father, on the weekend of Shiv's wedding, to both confess to Logan and threaten him. \"We're asking you to come to the table,\" he said, almost managing to keep his voice steady.\n\nBut then, with (a sort of) victory and (a sort of) freedom within reach, Kendall screwed up so badly, so criminally, so ineptly, that it all fell to pieces. He took a waiter from the wedding on a jaunt to get drugs and, in a scene with clearly intentional echoes of Chappaquiddick, drove off a bridge and into the water — water from which he escaped, but the waiter did not. In a panic, Kendall chose humiliation over prison, and he accepted his father's protection in exchange for abandoning the takeover effort.\n\nDown went Kendall's rebellion, down went his desire to prove he was his own man, down went his belief that he wasn't, at heart, a rich kid reliant on his daddy. Logan took his son in his arms and made it clear: I will protect you, I will embrace you, and now I own you, forever, even more than I did before.\n\nThis is where we find Kendall at the beginning of the second season. When we first see him, he's so close to drowning, metaphorically, that his mouth is submerged, literally, in the water of the restorative spa bath where he's \"recuperating.\" He's nearly catatonic from the combination of the tragedy he caused and his transformation into a halting, haunted sycophant who can only repeat meaningless phrases — \"I saw their [takeover] plan. Dad's plan is better.\" — like he's making a hostage video.\n\nElsewhere, not only are the other three children still trying to figure out the best play as their father scraps with powerful enemies, but so are two other members of the family who are perhaps even more unpredictable than Logan's kids: Tom (Matthew Macfadyen), Shiv's husband; and Greg (Nicholas Braun), a cousin who first showed up as a hapless dummy puking out of the eye holes of an amusement park costume and has gradually been drawn into the family business and, unavoidably, the family scandals. Greg is considering how to leverage valuable information he has about a corporate scandal, and Tom is, as always, staring goggle-eyed at the family antics and trying to figure out how to stick close to Shiv and maybe wiggle through a door she wedges open.\n\nIt is a usually reliable television axiom that to follow a story through multiple seasons and arcs, you have to care about the characters. Usually, this involves giving them some measurable humanity. Succession is about as close as you can get to making a very good show where humanity is glimpsed very rarely if at all. Shiv is a little funny, Roman is a little funny, Greg is entertaining, Kendall is pitiable — but the entire show is a camera trained on a pit of vipers.\n\nYou can look for a rooting interest, but you probably won't find one. There's no one to save; they're all awful. The same might have been said about Veep, but that was pure comedy. It's a harder lift in a serial family story that's only funny some of the time.\n\nMoney is a monkey's paw in the Roys' world: You obtain it, you fight to keep it, you guard it so jealously that everything else in your life is sacrificed, and it still brings you no pleasure. No sooner did Greg come to his cousins' family looking for financial help than his own devious, ambitious streak began to emerge. This money — this much money — is radioactive in this story. It's a poison.\n\nIt's notable that the Roys are very, very rarely shown doing any of the many enjoyable things that having money makes possible. They don't travel, they don't vacation, they don't have parties that don't turn into emotional torture chambers. And they aren't people who love their work, either. Operating their company never seems to bring them any pleasure or satisfaction — the minute any of them starts to pursue anything they might care about, it becomes part of this much larger game of power and money that blocks out the sun.\n\nNor are they people who find solace in their home lives — they're all struggling with romantic relationships. Shiv and Tom have a bond that involves dependence but no respect and, for most of the first season, no honesty; Kendall is estranged from his family in part because of his history of addiction; Roman has a girlfriend but doesn't have sex with her; and Connor is trying to make a traditional coupled life out of a relationship with its origins in sex work.\n\nThe easy read on Succession's ethos is that it's anti-extreme-wealth in that all these people are rich, but at least they're miserable. Thus, for everyone else, it's some good old schadenfreude watching them torture each other. (This is one of the theories about why The Real Housewives became a popular franchise.) And taken together with the often very funny writing (Armstrong has worked in the Armando Iannucci world that produced The Thick Of It, In The Loop and Veep), Succession's vision of its wealthy horribles is certainly a satisfying black comedy about the ugliness of the rich.\n\nBut what makes Succession feel particularly rich and rounded — and very sad — is the depravity, rarely played for laughs, of every moment in which this family touches normal people. The first episode of the first season includes a scene in which Roman — who can at times almost pass himself off as a charming ne'er-do-well — offers a kid he doesn't know a check for a million dollars if he can hit a home run in the Roy family softball game and convinces the kid and his parents that he means it. When the kid gets a hit but is out at third, Roman revels in taunting him, apparently driven by absolutely nothing except amusement. And while Roman finds the scene funny, it's staged and shot like a monstrous act, like a man committing a grave sin. Roman, in this moment, demonstrates something you see from the Roys again and again: When you sense that you're losing control of a situation, you can always just stomp on somebody with less power than you have. At least it will remind you that you're not helpless. This approach posits that cruelty is how the powerful get out their frustration with the very powerful.\n\nWhile Kendall's intent was very different, rooted less in viciousness than recklessness, the same tonal note applies to the somber treatment of his car accident. He still looks dead-eyed long after he's gotten out of the water and dried off. Even on Succession, killing an innocent is not funny, darkly or otherwise. When the Roys spar with each other or spite the people in their circle, that's treated like comedy. But when they reach out and touch the rest of the world — as their profound power makes it easy for them to do — that's generally not.\n\nTelevision, particularly in its antihero age, has mastered the art of taking charismatic actors and using them to make characters of dubious morality appealing: Tony Soprano, Walter White, Stringer Bell, and so forth. But very often, there's been some empathy at the root of those portrayals — a thesis that Tony and Walter at least loved their families, or that Stringer would have been a very different kind of businessman if he'd had a different set of choices. Succession powers through on entirely the performances. While perhaps all the Roy children can be pitied because they were raised by a monster, none of them seem like they're particularly good at anything. None of them are good to the people close to them. None of them are loyal; none of them are decent; none of them draw lines they won't cross.\n\nThat's why this cast might be the strongest on TV. To a person, they make the venality of their characters so specific and their charms so personal — without compromising the fundamentally awful role they all play in the world — that the show works when, really, it should not. This much nihilism should not be affecting, but in its way, it is.\n\nIn fact, because of the performances and the spark that some of these actors give to odious characters, the ethos of the show may very well not be strictly that wealth is bad and at least rich people don't get to be happy. It's that your character is, for instance, your participation in an abusive, immoral system from which you willingly benefit, and not whether you have a fun personality. Several of these people are probably very entertaining dinner guests. (Not Kendall. But several of them.) Several of them seem amusing, sharp-witted, observant, and energetic.\n\nBut they're at the controls of a machine that destroys other people, including each other, so maybe whether you'd want to have a drink with them is beside the point.", "description": "Succession should be too bleak to work, but the combination of strong writing and especially excellent performances across the board keep it going strong as it enters its second season on HBO.", "authors": ["Linda Holmes"], "top_image": "https://media.npr.org/assets/img/2019/08/10/7b3c277ab26500ecd273ce8f6891f2162cb6fde14248c6e6f5377634ca711ca60a3d1815ef19ddda52d452be8291a0aa_wide-ecda7fef3c77cd119745bafcd522209c335e1246.jpg?s=1400"}