{"pub": "hotair", "url": "https://hotair.com/headlines/archives/2019/10/think-young-people-hostile-capitalism-now-just-wait-next-recession", "downloaded_at": "2019-10-18 02:03:57.344174+00:00", "title": "Think young people are hostile to capitalism now? Just wait for the next recession.", "language": "en", "text": "Coming of age in the midst of the financial crisis and entering the workforce during the rise of the gig economy has given millennials an intuitive understanding of the deep instability and unfairness of our economic (and political) system. A recent survey from Quinnipiac revealed just how divided older and younger Democrats are on capitalism. Forty-four percent of those aged 18-34 supported the “democratic socialist” Bernie Sanders, compared to 22 percent for Elizabeth Warren (who is progressive but “capitalist to her bones”) and 9 percent for Joe Biden. On the other hand, 41 percent of those over 65 supported Biden, compared to 26 percent for Warren and an incredible 2 percent for Sanders. The socialist platform of Sanders repels older voters who grew up in the so-called “golden age” of capitalism, while it naturally appeals to younger voters who grew up in the age of neoliberalism and economic crisis. Of course, it’s not just about one’s personal income or wealth, but the impact that capitalism is having on the future of the planet as well. The 16-year old Greta Thunberg captured well in her UN speech last month: “We are in the beginning of a mass extinction, and all you can talk about is money and fairy tales of eternal economic growth.”\n\nWhen the next recession comes, young people and the working class will no doubt be impacted the hardest, and this will only further radicalize their politics. The more they feel that the system is rigged against them, the more they will demand the system itself be overthrown. After the 2008 recession, President Obama and the Democrats effectively saved capitalism from itself; a more radical leadership would fight to replace it with a better system. This time around there may be far more pressure from below to do just that, especially with a more organized left and more class conscious young people.", "description": "", "authors": ["Conor Lynch", "Theweek.Com Articles Think-Young-People-Are-Hostile-Capitalism-Now-Just-Wait-Next-Recession"], "top_image": "", "published_at": "2019-10-18"}