{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7542751/British-pensioner-jailed-smuggling-1m-cocaine-cruise-rats-big-rabbits-cell.html", "downloaded_at": "2019-10-06 11:41:51.555767+00:00", "title": "British pensioner jailed for smuggling £1m of cocaine on cruise has 'rats as big as rabbits' in cell", "language": "en", "text": "A 72-year-old drug smuggler who had £1million of cocaine on a cruise has revealed he shares a Portuguese cell with 'rats as big as rabbits'.\n\nRoger Clarke has pleaded with Prime Minister Boris Johnson to help secure his release from the notorious EP Lisboa jail.\n\nThree judges convicted retired chef Clarke and his ex-secretary wife Sue, 71, of drugs trafficking on a Caribbean liner after a one-day trial last month.\n\nThey were told they will serve their eight-year sentences in Portugal instead of being kicked out of the country and sent back to Britain.\n\nNow Clarke has complained for the first time about the harsh conditions in the jail, and claimed he lost six-stone and had a suspected heart attack.\n\nScroll for video\n\nRoger Clarke (pictured with wife Sue) has pleaded with Prime Minister Boris Johnson to help secure his release from the notorious EP Lisboa jail\n\nThe officers headed straight for cabin 469, waking its occupants, pensioners Roger and Sue Clarke (pictured)\n\nPolice pictures (right and left) show the Clarke's suitcases being taken apart to show the hidden cocaine in the couple's cabin on the cruise ship\n\nNow Clarke has complained for the first time about the harsh conditions in EP Lisboa jail (pictured), and claimed he lost six-stone and had a suspected heart attack\n\nHe also said he and his wife were 'innocent' and he has sent a letter to Mr Johnson begging him to look into the couple's case.\n\nClarke told the Sunday Mirror: 'The conditions here are really disgusting, no air conditioning, no heating and in many cells not even any lighting.\n\n'I've been a little lucky as I'm now on F wing which has single cells with a shower and toilet, mind you it's pot luck if and when you get hot water.\n\n'Rats are a menace, some are as large as rabbits, cockroaches by the millions and all sorts of other horrible bugs.'\n\nHe added: 'F wing is where anyone from another country, such as embassy people, are shown which is why it's kept a lot cleaner than other wings.'\n\nCocaine worth around £1million was discovered by police in the lining (pictured above) of suitcases Mr Clarke had taken on a luxury cruise from the Caribbean\n\nPortuguese police acting on a tip-off from Britain's NCA discovered 9lbs of cocaine hidden inside the lining of four suitcases Clarke had taken from the island of St Lucia\n\nClarke wants to be moved to the mixed-sex Funchal Prison on the island of Madeira with Sue, who is currently in Lisbon’s Tires Women’s Prison.\n\nThe pair, originally from Kent but who lived in Guardamar, Spain, were arrested on board cruise liner Marco Polo on December 4, 2018.\n\nPortuguese police acted on a tip-off from Britain's National Crime Agency and found 9lbs of cocaine hidden inside the lining of four suitcases Clarke had been handed at St Lucia.\n\nSue is currently serving her eight-year sentence in Lisbon’s Tires Women’s Prison (pictured)\n\nBut Clarke wants them to both be moved to the mixed-sex Funchal Prison on the island of Madeira (pictured)\n\nSue and Roger Clarke's Villa in Guardamar, Spain, where they were the life and soul of local bars and members of a golf club before their arrest and conviction for drug trafficking\n\nClarke, from Bromley, Kent, claimed after his arrest a mysterious UK-based Jamaican businessman called Lee had asked him to negotiate the exotic fruit sales during cruise ship stopovers in the Caribbean and bring back the suitcases 'as a sideline' [File photo]\n\nFreed pensioner reveals 'concerns' for fellow British inmate on drug charges at Portuguese jail Peter Hambrook, who was finally acquitted after drug runners planted 3kg of heroin into his case, said in August fellow prisoner Roger Clarke could have been tricked into trafficking drugs by ruthless criminals just like he was. Retired cook Roger Clarke 72, insisted he and wife Sue, 71, were innocent and were just doing a favour for friends who wanted Christmas gifts taken back from the Caribbean to London. Peter and Roger spent two months in the same prison wing at EP Lisboa, which the accountant-turned-IT consultant described as the 'worst' jail in Europe. Peter said of Roger: 'That jail is not a good place to be if you're not in good health and Roger isn't. I do have concerns about his wellbeing.' He added: 'I think he was a bit shellshocked. He said to me that he knew the people who had given him the cases. They were supposedly meant to contain Christmas presents and he was doing them a favour taking them. 'He said he had met them before during a wedding in St Lucia. I think they were meant for people back in Britain.'\n\nidea the cocaine was hidden in the bags.\n\nAfter being sentenced, Clark held hands with his wife and whispered: 'Jesus Christ, I was not expecting more than four years. I'll be 80 when all this is over.'\n\nClarke told the court last month he was taking the suitcases back to the UK for a friend called Lee who had promised to pay him £800 and bragged he could sell them for a massive profit at upmarket stores such as Harrods.\n\nHe said UK-based Jamaican businessman 'Lee' and another associate called Dee, who he named in court as George Wilmot, had asked him to help negotiate the import of exotic fruit during Caribbean cruise stopovers and he brought the suitcases back for them as a sideline.\n\nState prosecutor Manuela Brito rubbished his court claim he had been 'betrayed' by people he trusted and insisted the Brits were drug mules who used the four cruises they took to South America in two years as a front for their crimes.\n\nAnd she questioned how they could pay for the cruises costing around £18,000 when they survived on a joint monthly pension of £1,150 from which the couple had to pay rent of £445.\n\nClarke said he fears for his health in jail after having stents fitted in his heart in 2010.\n\nHe said he had been taken to hospital with a suspected heart attack while in lock up, but it was just to do with his chest muscles caused by weight loss.\n\nIt is understood Sue works as a seamstress in Lisbon's Tires Prison, making toys.\n\nShe is believed to be sharing a cell with four other convicts.", "description": "Roger Clarke (pictured with wife Sue) has pleaded with Prime Minister Boris Johnson to help secure his release from the notorious EP Lisboa jail.", "authors": ["James Gant For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/09/19355516-0-image-a-2_1570349565264.jpg", "published_at": "2019-10-06"}