{"pub": "usatoday", "url": "https://usatoday.com/story/money/2019/10/14/late-credit-card-payment-can-really-hurt-you/40290235", "downloaded_at": "2019-10-14 23:16:15.223222+00:00", "title": "5 ways a late credit card payment can really hurt you", "language": "en", "text": "CLOSE The higher standard deduction in the tax law signed by Donald Trump last year may require a few new moves for you to lessen your tax burden this year. USA TODAY\n\nEveryone knows that making a late credit card payment is not good, and most people can probably tell you a few reasons why. But few people understand just how many consequences can result from that one costly mistake.\n\nHopefully this list motivates you to keep up with your credit card payments. If you struggle to remember to pay on time, try setting up automatic payments or leaving reminders for yourself so you don't forget.\n\nBelow are the five possible effects of a late credit card payment. You might already know about some of them, but a few might surprise you.\n\nHow often should you check your credit reports? Here are the 5 times when you should\n\nRetirement savings: 3 mistakes even smart savers make\n\n1. A lower credit score\n\nLate payments are one of the most damaging marks you can have on your credit report. A single late payment could lower an excellent credit score by more than 100 points, according to FICO data. The effect is less severe for those with fair or poor credit simply because their score doesn't have as far to fall, but regardless, late payments make it more difficult to secure future loans and lines of credit.\n\nThe effect depends in part on how many late payments you have on your report across how many different accounts and how late the payments were. A 90-day late payment will hurt you much more than a 30-day late payment. Late payments stay on your credit report for seven years, but their effect diminishes with time.\n\n2. Late payment fee\n\nCredit card issuers typically add a late fee to your balance if you fail to make a payment on the due date or during the card's grace period. A grace period is the time between the end of your billing cycle and the payment due date and is usually about three weeks, depending on your card issuer.\n\nThe Consumer Financial Protection Bureau (CFPB) limits how much card issuers can charge for late payment fees and it adjusts this amount periodically. As of 2019, card issuers can charge up to $28 for a first-time late payment. Subsequent violations can cost you as much as $39 each.\n\nYour card issuer might not charge you quite this much. Find out how much a late payment will cost you by checking your cardholder agreement. There's a table at the top of it that lists all fees, including late payment fees.\n\n3. Interest on your balance\n\nAny amount left on your credit card balance at the end of the grace period begins to accrue interest. How quickly it grows depends on your card's APR and whether you're under a penalty APR (see below), both of which you can find in the cardholder agreement\n\nInterest charges just cost you money, and you don't get anything in return. They also cause your balance to swell, and this can make it more difficult to pay off. Many people struggle to get out of credit card debt for years once they slip into this cycle, and this can lead to falling behind on other bills in the future.\n\n4. Penalty APR\n\nSome card issuers enact a penalty APR if you make a late payment. This is a higher APR that applies to all of your new purchases and any existing balance on your credit card. If you pay on time going forward, the card issuer can legally only charge you the penalty APR for up to six months. But any debt that you incurred during the time the penalty APR was enacted will continue to grow according to the penalty rate for as long as it takes you to pay it off. This means it can continue to haunt you for months or years afterward.\n\nIf you have multiple cards with the same issuer, the issuer can also charge you a penalty APR on your other cards, even if you've never made a late payment on them. Not all card issuers do this, and you can find out if yours does by contacting the company or reading your cardholder agreement.\n\n5. Lost rewards\n\nIf taking more of your money isn't bad enough, many card issuers also come after your rewards points when you make a late payment. Most don't pounce the second the grace period ends though. You usually won't lose your rewards unless you've made multiple late payments or one extremely late (60+ days) payment, although the exact rules depend on the card issuer.\n\nIn many cases, once the rewards are gone, there's no getting them back. But some card issuers will let you reclaim your points by paying a reinstatement fee. This typically ranges from $15 to $30. Check your card issuer's rules on point or mile forfeiture so you understand how a late payment could affect your reward balance.\n\nThe Motley Fool owns and recommends MasterCard and Visa, and recommends American Express. We’re firm believers in the Golden Rule. If we wouldn’t recommend an offer to a close family member, we wouldn’t recommend it on The Ascent either. Our number one goal is helping people find the best offers to improve their finances. That is why editorial opinions are ours alone and have not been previously reviewed, approved, or endorsed by included advertisers. Editorial content from The Ascent is separate from The Motley Fool editorial content and is created by a different analyst team.\n\nThe Motley Fool is a USA TODAY content partner offering financial news, analysis and commentary designed to help people take control of their financial lives. Its content is produced independently of USA TODAY.\n\nOur #1 cash back pick has a surprise bonus\n\nOffer from the Motley Fool: This may be the perfect cash back card! That's because it packs in $1,148 of value. Cardholders can earn up to 5% cash back, double rewards in the first year, and avoid interest well into 2020. With such a deep bench of perks you'll wonder how this card packs in a $0 annual fee. Best yet, you can apply and get a decision in two minutes. Learn more with our in-depth review.\n\nRead or Share this story: https://www.usatoday.com/story/money/2019/10/14/late-credit-card-payment-can-really-hurt-you/40290235/", "description": "The consequences are more severe than you probably realize.", "authors": ["Kailey Hagen", "The Motley Fool", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/07/USAT/f778f3c2-9766-4d67-aac1-8af63cd518b2-GettyImages-1137376687.jpg?crop=2120,1193,x0,y107&width=3200&height=1680&fit=bounds", "published_at": "2019-10-14"}