{"pub": "theverge", "url": "https://theverge.com/2019/10/2/20895746/google-pixel-4-leak-marketing-videos-assistant-soli-motion-sense", "downloaded_at": "2019-10-05 14:31:58.131243+00:00", "title": "Leaked Pixel 4 marketing videos show new Assistant and Motion Sense features", "language": "en", "text": "Some of Google’s internal Pixel 4 marketing videos appear to have leaked, showcasing demos for two neat features for the company’s flagship Android handset: a revamped Google Assistance experience and the new Motion Sense gesture control system.\n\nGoogle previously confirmed both features publicly, but it stopped short of showing detailed demonstrations working on the Pixel 4. Thankfully, like virtually everything else about the upcoming phone, detailed videos have surfaced on the internet, this time courtesy of 9to5Google.\n\nGoogle says Assistant will be faster and more capable on the Pixel 4, and, indeed, the leaked footage appears to show some of those visual and performance-based changes that were not seen in today’s version of the voice assistant. One of the clips shows Assistant displaying transit directions within Google Assistant slide-up window that opens when you summon it.\n\nNotably, the map view displayed on the Pixel 4’s screen is zoomed in, like you’d expect it to be if you’re traversing a city on foot — something that Assistant currently cannot do. Also, the version of Assistant shown on this device no longer takes over the full screen to show query results, which should let you easily minimize it to get back to whatever you were doing.\n\nMoving on to Motion Sense. 9to5Google also published a leaked marketing video that shows off what you’ll be able to do with the Pixel 4 by waving your hand over it. Normally, leaks come with at least a dash of skepticism, but what’s shown in this leak are features that Google has already confirmed, including the ability to skip songs, snooze alarms, and silence phone calls.\n\nThe system is powered by Project Soli, a gesture control system built into a tiny chip that Google’s experimental ATAP division has been working on as far back as 2016. Motion Sense would appear to be the first real commercial fruits of that investment.\n\nGoogle has shown off what it looks like to switch songs with Motion Sense, which involves simply sliding your hand across the phone (assuming your music streaming service supports it), and the other commands will work similarly, it seems. Snoozing requires a swipe of the hand over the phone, as does silencing phone calls.\n\nThese leaks don’t add much to what we already knew. Google’s Assistant is getting a big upgrade for the Pixel 4, and it’s said to bring features that only the latest Google phone can take advantage of. Here’s hoping we see a few more impressive demos that show off these features at the company’s Pixel event on October 15th — or perhaps earlier if the leakers get to them first.", "description": "The latest Google Pixel 4 leak includes marketing materials that claim to show off what the new Google Assistant is capable of. It also shows what the Soli-powered Motion Sense gestures will look like in action.", "authors": ["Cameron Faulkner", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/os7PAAetMSOeX-AdPPCZU3TEEjc=/0x20:1024x556/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19231399/google_pixel_4_xl_closer_look_5_1024x576.jpg", "published_at": "2019-10-02"}