{"pub": "thehill", "url": "https://thehill.com/opinion/technology/466612-combatting-fake-news-on-social-media-will-take-a-village", "downloaded_at": "2019-10-20 16:57:08.540299+00:00", "title": "Combatting fake news on social media will take a village", "language": "en", "text": "On Oct. 11, Sen. Elizabeth Warren Elizabeth Ann WarrenTrump says his Doral resort will no longer host G-7 after backlash Ocasio-Cortez: Sanders' heart attack was a 'gut check' moment Ocasio-Cortez tweets endorsement of Sanders MORE’s (D-Mass.) campaign issued a series of Facebook ads claiming that Mark Zuckerberg Mark Elliot ZuckerbergOn The Money: Supreme Court takes up challenge to CFPB | Warren's surge brings scrutiny to wealth tax | Senators eye curbs on Trump emergency powers Warren warns Facebook may help reelect Trump 'and profit off of it' Martin Luther King Jr.'s daughter knocks Zuckerberg for invoking her father while defending Facebook MORE had just endorsed Donald Trump for re-election. “You’re probably shocked,” the ad said; “thinking ‘how could this possibly be true?’ Well it’s not. (Sorry.)” The ad then explains that Zuckerberg has “given Donald Trump free rein to lie on his platform — and then to pay Facebook gobs of money to push out their lies to American voters.”\n\nWarren’s Facebook ads were soon displaced in the news by the impeachment inquiry and Rudy Giuliani Rudy GiulianiGiuliani asked State Dept. to grant visa for ex-Ukraine official at center of Biden allegations: report Overnight Energy: Trump taps deputy energy secretary to replace Perry | Praises pick Dan Brouillette as 'total professional' | Perry denies quid pro quo over Ukraine Ex-Watergate prosecutor says evidence in impeachment inquiry 'clearly' points to Trump MORE ’ s machinations in Ukraine. But the ads exposed a deeper problem that goes back to the birth of the internet: the Telecommunications Act of 1996 (specifically Title V — also known as the Communications Decency Act) gave internet companies and social media platforms — in the name of freedom of speech — license to host untruthful information as long as they did not endorse it. This could range from simple misinformation, to bots, to fully-synthetic “ deep fakes , ” videos constructed with artificial intelligence to make real people seem to be doing or saying things they never would in real life.\n\nIn 2016 para-campaign organizations — such as Cambridge Analytica and agents of the Russian government — conducted misinformation campaigns that may have put Donald Trump in the White House.\n\nADVERTISEMENT\n\nAs polarization and the media revolution have advanced, the relationship between political beliefs and party identification has been reversed. According to political scientists Alan Abramowitz and Steven Webster , rather than ideas empowering partisanship, partisan commitments encourage support for political ideas — no matter how deceptive, false, or bonkers they seem to more neutral observers.\n\nNot every Trump supporter would go as far as Mark Lee , who declared on CNN in 2017 that “If Jesus Christ gets down off the cross and told me Trump is with Russia, I would tell him, ‘Hold on a second. I need to check with the president if it’s true’.” But many members of the president’s base fervently believe that Barack Obama Barack Hussein ObamaEven with likely Trump impeachment, Democrats face uphill climb to win presidency Clinton suggests Russia grooming Gabbard to run as third-party 2020 candidate The Hill's 12:30 Report: Washington mourns loss of Elijah Cummings MORE is a Muslim ; that Hillary Clinton Hillary Diane Rodham ClintonJill Stein: 'I am not a Russian spy' Trump criticizes Clinton for suggesting Jill Stein was Russian asset Graham: I'm seeking to make Trump successful 'but not at all costs' MORE ran a child pornography ring out of a pizza parlor in Washington, D.C.; and that President Trump Donald John TrumpPelosi arrives in Jordan with bipartisan congressional delegation Trump says his Doral resort will no longer host G-7 after backlash CNN's Anderson Cooper mocks WH press secretary over Fox News interview MORE did not mention the Bidens in his telephone call with the leader of Ukraine.\n\nThese days, more than 90 percent of Americans receive their news online; about 50 percent of them rely on social media sites.\n\nWith trust in “establishment” newspapers, network and cable TV stations at an all-time low — especially among Republicans — people are getting their news from systems that offer up information customized to past personal preferences. This gives para-party groups, white nationalists, and hackers out for a thrill a platform on which to spread lies, fake news or deep fakes.\n\nSurveys indicate that Americans have a tough time distinguishing fake news from real news. Fake news headlines, researchers have found, fool adults about three-quarters (75 percent) of the time. And the more sensational and negative the headlines, the more likely they are to go viral.\n\nADVERTISEMENT\n\nCombatting fake news and disinformation on social media without restricting freedom of speech or diluting journalistic content will take a village.\n\nHere are a few steps (many of them recommended by the Brookings Institution in 2017 ) that can — and should — be taken now:\n\nSocial media platforms should identify automated “bots” and identify them as such to online readers. They should rigorously enforce “real name” registration of accounts. They should invest in technology that combines meta-data with text and language patterns to flag and rank hoaxes, disinformation and disputed assertions.\n\nReputable news organizations should call out fake news stories, place “corrections” in prominent places, and provide links with additional information. According to one study , labelling a post as “disputed” reduces by about 10 percent the readers who believe it to be true. Users should also be urged to consult non-profit organizations ( PolitiFact , Factcheck , and Snopes ) and other sources that track websites that routinely disseminate “distorted headlines and decontextualized or dubious information.”\n\nAnother approach, used with considerable success by The Guardian, involves the creation of a crowdsource-website inviting readers to assess claims for themselves. Crowdsourcing might well have the additional benefit of involving more young people in American politics. The Democratic National Committee, in fact, has established a “Geek Squad ” tasked with ferreting out “disinformation and discourse manipulation” and encouraging each presidential candidate to report “inauthentic or suspicious activity.”\n\nIf left to their own devices, social media platforms may well decide the presidential election of 2020. All Americans should be encouraged to expose themselves to a variety of perspectives, to resist “clickbait,” and to think twice — or thrice — before hitting “like” or “share.”\n\nThey should then send this op-ed to everyone they know.\n\nAfter all, the breadth and depth of distrust and polarization makes the task immensely difficult, and it may not be an exaggeration to predict that democracy hangs in the balance.\n\nGlenn C. Altschuler is the Thomas and Dorothy Litwin Professor of American Studies at Cornell University. He is the co-author (with Stuart Blumin) of Rude Republic: Americans and Their Politics in the Nineteenth Century. Sidney Tarrow is the Maxwell Upson Emeritus Professor of Government at Cornell University. He is author of Power in Movement (2011) and the co-editor (with David S. Meyer) of \"The Resistance: The Dawn of the Anti-Trump Opposition Movement.\"", "description": "Fake news headlines, researchers have found, fool American adults about three-quarters of the time.", "authors": [], "top_image": "https://thehill.com/sites/default/files/2020socialmediarefs_100219hillillustration.jpg", "published_at": "2019-10-20"}