{"pub": "cbc", "url": "https://cbc.ca/news/canada/ottawa/tiny-frogs-threaten-huge-gatineau-developments-1.5296732", "downloaded_at": "2019-09-30 10:44:45.068322+00:00", "title": "Tiny frogs posing big problem for Gatineau developers | CBC News", "language": "en", "text": "Tiny frogs could cause big problems for a Gatineau developer who's hoping to get started on a major construction project worth up to half a billion dollars.\n\nThe western chorus frog, which is no bigger than a loonie, is considered a threatened species in Quebec. The tiny amphibians were found living in green space behind La Maison de la Culture de Gatineau in the de la Cité neighbourhood.\n\nPart of that land was purchased in 2011 by developer Alain Adam, who plans to build over 1,000 residential units and a major office and retail complex. It's a project valued between $400 million and $500 million.\n\nBut before construction can begin, Adam will need Quebec's Environment Ministry to issue a certificate of authorization, required under the province's Environment Quality Act to bring in infrastructure.\n\nAdam hasn't yet applied for the authorization because he's hoping city and provincial officials will be able to work out an agreement to grant him the green light sooner.\n\nThis is a portion of the land that Alain Adam wants to develop. (Robyn Miller/CBC)\n\nUrban intensification\n\nAdam points out his company has already donated land with even greater biodiversity to the city.\n\n\"The land that we offered in compensation is much bigger, has higher environmental value and will now be preserved and protected from any development indefinitely,\" he said.\n\nAdam said the best way to promote sustainability and stem urban sprawl is to build on available land in the city centre.\n\n\"This is exactly what we are proposing with our project at de la Cité, which is the second-most important urban core of the City of Gatineau,\" he said.\n\nAn ongoing issue\n\nCoun. Daniel Champagne, who represents the area, said the city is working with three developers, including Adam, who are encountering the same problem.\n\n\"What I want to do as the delegated elected official for that area is to try once and for all to resolve that whole situation for the whole territory,\" Champagne said.\n\nVance Trudeau, with the University of Ottawa's biology department, said the Western chorus frog plays an important role in its environment. 1:16\n\nThe presence of the little frogs has been an ongoing issue for the City of Gatineau, and at one point drove up construction costs of the new Robert Guertin Arena, which is being built nearby.\n\n\"It's the same problem in the same area,\" Champagne said. \"It's an important point because in the Guertin situation we resolved that situation to where we were able to build the arena.\"\n\nIn that case, the province's approval for the arena came in January 2018, nearly a year after the city signed off on the project. As part of the deal, the city had to sign an agreement promising to work with the province to protect western chorus frogs in the future.\n\nNader Dormani is hoping to start construction on his land next year, but is waiting for approval from Quebec's Environment Ministry. (Robyn Miller/CBC)\n\n'We're paying taxes'\n\nIn a French statement, a spokesperson for the province's Ministry of Sustainable Development, Environment, and Fight Against Climate Change said that work is continuing.\n\nChampagne pointed out Gatineau already has nine established habitats for western chorus frogs.\n\nNader Dormani, another developer with plans for a major residential and retail project in the area, said he's confident he'll eventually get the approvals he needs, but would like the province to pick up the pace.\n\n\"We're paying taxes on this land, we bought it to develop. We didn't buy it to leave it the way it is,\" Dormani said.\n\nVance Trudeau, a biology professor at the University of Ottawa, says the western chorus frog is a key food source for other animals, and should be protected. (Robyn Miller/CBC)\n\nFrogs key prey for birds, fish\n\nVance Trudeau, who studies hormones of reproduction in fish and frogs at the University of Ottawa's biology department, said western chorus frogs are key food source for fish and birds in the region.\n\n\"When they start declining there is less food, and so there is less of the other species and then things start declining, sometimes gradually, sometimes very rapidly,\" Trudeau said.\n\nTrudeau said it's important to find the right balance between development and environmental protection.\n\n\"What is going to be the compensation if we lose that green space, and we lose the species?\" he asked.", "description": "Tiny frogs could cause big problems for a Gatineau developer who's hoping to get started on a major construction project worth up to half a billion dollars.", "authors": [], "top_image": "https://i.cbc.ca/1.4513828.1517491428!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/western-chorus-frog.jpg", "published_at": "2019-09-30"}