{"pub": "cbs", "url": "https://cbsnews.com/news/when-life-gives-you-pears-jim-gaffigan-and-jeannie-gaffigan-on-her-brain-tumor", "downloaded_at": "2019-09-29 23:31:22.826702+00:00", "title": "Jeannie's story: Jim Gaffigan on his wife's brain tumor", "language": "en", "text": "Over the past couple years, I've had the opportunity to do humorous commentaries here on \"CBS Sunday Morning.\" They have all been universally adored! Okay, not universally adored. Through these commentaries I think you've learned something about me. I like food; I have too many children; and I married a woman way out of my league.\n\nToday I'd like to talk about that woman, that special woman who has horrible taste in men.\n\nMy wife Jeannie is a force of nature. She is not only my life partner and the mother of my five young children; she is also my co-writer of seven comedy specials and two New York Times bestsellers, and was even the executive producer of \"The Jim Gaffigan Show.\" To summarize, Jeannie does everything. She is the executive producer of our family.\n\nAnd until April 2017, her life was pretty much perfect.\n\nJeannie Gaffigan. CBS News\n\n\"Well, I was at a pediatric visit for my kids,\" Jeannie said. \"And when my doctor was speaking to me, I turned my head and I asked her to repeat what she was saying. And she was like, 'What's wrong with your ear?' And I'm like, 'Oh, I can't hear out of it.' So, she sent me to an ear, nose and throat doctor, and that's when the MRI revealed that I had, you know, like 30 seconds to live!\"\n\nThe doctors told us one of those things that people pray they never have to hear: Jeannie had a brain tumor.\n\nJim asked her, \"What was your first reaction? Where you were, like, 'Game over'?\"\n\n\"No,\" she said. \"I mean, I don't think I was like, 'Game over.' Something just happened where I just was, like, 'Okay, let's figure out how to get this outta my head.'\"\n\nAnd in what felt like moments, Jeannie and I found ourselves in the office of Dr. Joshua Bederson, head of neurosurgery at Mount Sinai Hospital in New York City.\n\n\"This instantly became clear this was a very high-stakes situation for you,\" said Dr. Bederson. \"Because this is what I first saw, which is a huge, huge tumor. There's just no other descriptor. And really was stunning to me, because you were functioning at an extraordinary level.\"\n\nJeannie and Jim Gaffigan with Dr Joshua Bederson and an MRI of Jeannie's tumor. CBS News\n\nJim asked, \"And so what causes these brain tumors? It wouldn't be like an annoying husband that would cause these brain tumors?\"\n\n\"A little bit,\" Jeannie interjected. \"That's a part of it, right?\"\n\n\"Yeah, it's a major part, right,\" Dr. Bederson agreed.\n\n\"You're saying, it's not my fault, right?\" asked Jim.\n\n\"That would be hard to totally conclude,\" Dr. Bederson replied.\n\nOkay, so, Dr. Bederson doesn't know the origin of the pear-shaped tumor, but thankfully he did know how to get it out. The surgery took 10 hours. It was a success. The tumor was benign.\n\nJim Gaffigan's better half, Jeannie. Jim Gaffigan\n\nStill, Jeannie wasn't out of the dark yet.\n\nFirst, she suffered from a life-threatening pneumonia, and because of the tumor's location, some cranial nerves had been compromised, inhibiting her ability to breath on her own or swallow. She couldn't eat or drink anything for an indefinite period.\n\nJeannie said, \"Every time I would wake up and I would see that machine with the yellow gunk going into my nose, I was like, 'I can't believe I'm here.' It was just like, it was really difficult for me. But if I could just, when I would tap into my faith, I would see the big picture, that I knew that there was a reason for this to happen to me. But when I didn't — wasn't in touch with my faith — it was, like, too much for me to bear.\"\n\nAfter weeks in the intensive care unit, Jeannie finally came home — still unable to eat or drink. The kids and I attempted to make the harsh reality of Jeannie's feeding tube bearable, making a video of \"America's favorite feeding tube show, which is tube-tacular!\"\n\nJim Gaffigan loading up his wife Jeannie's feeding tube. Jim Gaffigan\n\nJim asked her, \"Was there a moment when you're going through this process where you look at me and you're like, 'I gotta live just because this guy is, he can write some good jokes, but I don't know if he can be a single dad'?\"\n\n\"There was a little bit of the feeling of, because I had taken on the role of being, like, 'Oh, don't worry. I'll do the schedule and i'll do the whatever,' I felt like when they were wheeling me into surgery I was like, 'My password on my computer is this. And FreshDirect, this is how you order the groceries.' I was like, 'Oh my gosh. He doesn't know any of this stuff!'\"\n\nI still don't know most of that stuff. And thankfully, I don't have to.\n\nWhen asked to summarize her experienced, Jeannie replied, \"Mom interrupted. No, I would summarize it by saying that sometimes you need like a big reminder to realize how grateful you are to be alive, and for your life. And just for me, it happened to be a massive, pear-sized brain tumor on my cranial nerves. So …\"\n\nSo, what does a mother of five young children who survived a pear-shaped brain tumor do when she finally gets back on her feet and finally can actually eat?\n\nGrand Central Publishing\n\nWell, my Jeannie wrote a book about that experience, \"When Life Gives You Pears\" (Grand Central).\n\nShe also started a youth group organization, the Imagine Society, that combines youth groups throughout the city.\n\n[Frankly, it seems like she's kind of showing off now.]\n\nOccasionally I'll get a text from Jeannie that will simply say, \"I love you.\" It's nice to receive it, but I'm also reminded of how grateful I am that she's still here, and that my children still have a mother, and that our family still has an executive producer.\n\n'Cause if you've watched this show, you could tell I would a horrible single father.\n\n\n\nFor more info:\n\n\n\nStory produced by Sara Kugel.\n\n\n\nCommentaries from Jim Gaffigan:", "description": "The comedian and his better half (also his co-writer and the co-creator of their five children) talk about how their lives changed in the face of a frightening medical emergency, and how humor helped get them through it", "authors": ["Jim Gaffigan"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/09/28/96daf85a-ea7c-47be-8d4a-7fef25ba87d2/thumbnail/1200x630/e607c3653fa8a765e2f991b7f7141521/jeannie-and-jim-gaffigan-and-an-mri-of-jeannies-tumor-promo.jpg", "published_at": "2019-09-29"}