{"pub": "investing.com", "url": "https://investing.com/analysis/usdcad-lower-ahead-of-boc-and-fomc-next-week-200478774", "downloaded_at": "2019-10-27 12:36:53.999901+00:00", "title": "USD/CAD Lower Ahead Of BOC And FOMC Next Week", "language": "en", "text": "Next week on October 30th, the Bank of Canada will meet and will decide if the Canadian economy is in need of a rate cut. (Coincidentally, this is the same date of the next FOMC meeting). The BOC will also provide it’s outlook for growth and inflation. Expectations are high for the BOC to leave unchanged at 1.75%, whereas the FOMC is likely to cut rates another 25bps. The BOC is still one of the few major economies that is not in easing mode. As such, the fx market has been pricing in a stronger Canadian Dollar vs the US Dollar over the last few weeks.\n\nUSD/CAD Weekly Chart\n\nRecall that we have been looking at the long-term weekly chart, in which price has been coiling inside a symmetrical triangle and we were looking for price to breaking out either above the downward sloping trendline or below the upward sloping trendline. The market has decided! Price broke below the rising trendline, which dates back all the way to 2012. Price put in a 3-candlestick reversal formation known as “Three Crows”, which is 3 consecutive black candles that close at or near their lows.\n\nUSD/CAD Daily Chart\n\nAlthough prices have broken the upward sloping trendline, on a daily time-frame this appears to be a make or break area. put in a lower low yesterday, however it formed a doji candle, a sign of indecision. Price is currently trading just above a support zone of prior lows from July, near 1.3030/1.3000. USD/CAD is also trading at the 38.2% Fibonacci retracement level from the lows of August 2017 (not shown) to the highs of December 2018 at 1.3057. In addition, USD/CAD is trading just below the 127.2% Fibonacci extension from the lows of September 10th to the double top highs in October, at 1.3082. The RSI is also skirting the oversold level (below 30 is considered oversold).\n\nOn a 240-minute timeframe, USD/CAD is putting in a falling wedge and is diverging with the RSI. In the short-term, bulls will likely be buyers near 1.3060, looking for an opportunity to trade back to the longer-term trendline, roughly 1.3100, the top of the descending wedge, roughly 1.3120, or the horizontal resistance near 1.3180. Stops may likely have been placed above here. Bears are salivating right how hoping for a bounce to enter a short position at those levels, if they have not done so already. Support is just below near the lows of July at 1.3015 and the psychological level of 1.3000.\n\nUSD/CAD 240 Min Chart\n\nWatch for profit taking from USD/CAD shorts ahead of the BOC meeting next week. This may also give a bounce to the pair in the short-term.\n\nOriginal Post", "description": "Forex Analysis by Joe Perry covering: USD/CAD. Read Joe Perry's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-27"}