{"pub": "marketwatch", "url": "https://marketwatch.com/story/watch-out-for-these-hidden-financing-traps-when-buying-a-car-2019-10-14", "downloaded_at": "2019-10-14 10:13:41.742491+00:00", "title": "Watch out for these hidden financing traps when buying a car", "language": "en", "text": "While many shoppers think battling with the car salesperson is the best way to get a low price, it’s actually the dealership’s finance manager who can make or break a good deal.\n\n“The finance office is where the dealership makes its money,” says Tony Chapman, a former general manager at several Southern California dealerships.\n\nBuyers often spend hours haggling over just $200 on the price of the car with the salesperson, says Jesse Toprak, founder and president of CarHub.com, a car shopping and ownership management site. Then they walk into the finance office and buy an overpriced extended warranty for $2,000, no questions asked.\n\nAlso see: How to sell your car and make it shine\n\nShrewdly navigating the finance office means knowing what to expect and planning ahead. Here are five mistakes these industry veterans reveal and how you can avoid them.\n\n1. Letting the dealer mark up your interest rate\n\nReviewing your credit history, a finance manager looks for any small problem, such as a late payment from three years ago, and circles it with a big red pen. “Now the person is scared he or she won’t qualify for a loan,” says Chapman. Meanwhile, the finance manager marks up the interest rate by 2-3 percentage points, costing the car buyer hundreds of extra dollars over the life of the loan.\n\nThe best defense? Get preapproved for a car loan from your credit union, bank or an online lender. Then use your loan as a bargaining chip to unlock the low rates dealers can provide.\n\nDon’t miss: Expect good deals on any of these discontinued cars\n\n“The number one mistake I saw consumers making was to not arrange their own financing ahead of time,” Toprak says. “Then, they’re walking in blind.”\n\n2. Negotiating your monthly payments\n\nIn a tactic called “packing payments,” dealers get buyers to agree to an inflated monthly payment and then pad the contract with products they claim are either discounted or free. Common add-ons are extended warranties, antitheft devices and paint protection packages.\n\n“It’s illegal to pack payments,” says Chapman. “But dealers do it all the time anyway.”\n\nIf you’re asked what monthly payment you’re looking for, tell the dealer you’re a cash buyer, and only negotiate on the price of the car. Check pricing guides such as Kelley Blue Book or Edmunds before going to the dealership to learn the current market value of the car you want to buy.\n\n3. Buying overpriced extras\n\nBefore setting up the sales contract, the finance manager pitches a dizzying array of products and services — many of which are rip-offs, says Chapman.\n\nFor example, the prepaid maintenance plan, which promises to save money on oil changes, makes people overpay for maintenance they often don’t fully use. One dealership Chapman worked at received an $8,000 check each month for unused service.\n\nYou might like: The 10 best new cars for dog owners\n\nAnother popular offer is the extended warranty, which Chapman says is overpriced, sometimes by hundreds of dollars. “All insurance and warranties are just legalized gambling,” he says, and the chances of something going seriously wrong with your car are slim.\n\n“Taking delivery of a car is an emotional experience, and many people let their guard down,” Toprak adds. An easy way to say “no” to the finance manager is to say, “‘Thanks, but I won’t keep the car long enough to need the warranty, so let’s just carry on with the paperwork.’ There’s no comeback to that.”\n\n4. Extending the loan\n\nTo make cars seem more affordable, dealers offer 72- and 84-month car loans. While this lowers the monthly payment, you’ll pay much more in interest over the life of the loan. And since you’re repaying less each month, you’ll probably be upside down on the loan, owing more than the car is worth, for a longer time.\n\nThe only time to consider such a loan is when it comes with a very low interest rate and you’re absolutely sure you want to keep the car to the end of the loan, says Toprak.\n\n5. Paying bogus fees\n\nWhen you buy a car you should only have to pay the price of the vehicle plus sales tax, registration costs and a documentation fee or “doc fee.” But dealerships in many states charge extra fees to pad their profit.\n\nThe doc fee, in particular, can be an unpleasant shock. While a few states cap the fee at from $75 to $300, many states allow dealers to charge unlimited amounts. For example, Edmunds.com found that the average documentation fee in Florida is $799, and in Virginia it is $599.\n\nFind out about these fees before you agree to a deal. Ask your salesperson for a breakdown of fees and an “out-the-door” price. Question fees in the contract that look excessive or are redundant.\n\nMore from NerdWallet:", "description": "Here are five mistakes and how you can avoid them, according to auto industry veterans.", "authors": ["Philip Reed"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT097_nerd_f_ZG_20191010154323.jpg", "published_at": "2019-10-14"}