{"pub": "thehill", "url": "https://thehill.com/opinion/white-house/461599-weve-lost-sight-of-the-real-scandal", "downloaded_at": "2019-09-19 23:07:22.149112+00:00", "title": "We've lost sight of the real scandal", "language": "en", "text": "What will Department of Justice Inspector General Michael Horowitz’s latest investigation reveal? Will Congress hold hearings about it? Will former acting FBI Director Andrew McCabe Andrew George McCabeMcCabe says he would 'absolutely not' cut a deal with prosecutors We've lost sight of the real scandal Former Obama officials willing to testify on McCabe's behalf: report MORE actually get indicted? After all, it’s said that a motivated prosecutor can “indict a ham sandwich” if he really wants to.\n\nWe’re so wrapped up in the daily tick-tock, we could be losing sight of a big picture that’s come into focus over the past two years. For the first time in our nation’s history, an inspector general — one appointed by President Obama — has determined that at least two men who sat in the top spot at the FBI committed multiple violations that warrant possible prosecution. That in itself is a scandal with national implications deserving of headlines, congressional hearings and promises to overhaul a broken system.\n\nOf course, the complicating factor in the whole mess is that the government entities responsible for addressing any wrongdoing are the same ones inextricably tied to the alleged wrongdoing.\n\nADVERTISEMENT\n\nThe Department of Justice (DOJ) and the FBI employ enough people to populate a mid-sized city — more than 113,000. Both agencies are much more than the top men or women in charge. Even as certain personalities are divested, tentacles run deep; ties cross administrations and party lines. The recent past provides little reason to think this behemoth can always be neutral when it comes to its own. The machine has proven it can move swiftly when it comes to criminal cases against certain politically connected figures for relatively small infractions — but it has shown less commitment when it comes to others.\n\nBy way of a few examples, we can start with the scathing 2016 election-year ruling by the Foreign Intelligence Surveillance Court (FISC). It found the National Security Agency (NSA) guilty of “institutional lack of candor” in its spying on U.S. citizens. The court also said the NSA’s practices raised serious constitutional issues. It sounds pretty serious but, as far as we know, the FBI pursued no investigation into any responsible officials. And after years of surveillance abuses well-documented by the FISC and others, FBI Director Christopher Wray testified to Congress that there have never been any.\n\nAlso during the 2016 election year, administration officials conducted rampant “unmaskings,” revealing protected names of incidentally surveilled U.S. citizens. But after President Obama’s United Nations ambassador, Samantha Power Samantha Jane PowerWe've lost sight of the real scandal Congress should defy Dan Coats' last request on phone surveillance Sunday shows preview: Democratic candidates make the rounds after debate MORE, testified that someone else made unmasking requests using her name, there seemed to be a conspicuous lack of curiosity. As far as we know, the FBI did not move to expose who was responsible for any possible violations of national security and privacy protections.\n\nWhen the FBI lost thousands of text messages, sought by the inspector general, between FBI official Peter Strzok and bureau attorney Lisa Page, it was chalked up to a technical snafu and the case was closed. There was no announcement at the FBI about steps being taken to ensure such a major blunder won’t happen in the future; there was only what amounted to a symbolic shrug. The chaser to that debacle was Strzok and Page’s text messages from their time working for special counsel Robert Mueller Robert (Bob) Swan MuellerLewandowski says Mueller report was 'very clear' in proving 'there was no obstruction,' despite having 'never' read it Fox's Cavuto roasts Trump over criticism of network Mueller report fades from political conversation MORE also ended up somehow deleted.\n\nThere’s been no swift, public action that we know of on eight criminal referrals that two House Intelligence Committee Republicans, Reps. Devin Nunes Devin Gerald NunesWe've lost sight of the real scandal Twitter won't disclose who's running parody accounts being sued by Devin Nunes Nunes campaign drops lawsuit against constituents who accused him of being a 'fake farmer' MORE of California and John Ratcliffe John Lee RatcliffeWe've lost sight of the real scandal US attorney recommends moving forward with charges against McCabe after DOJ rejects his appeal Hillicon Valley: Google to pay 0M to settle child privacy charges against YouTube | Tech giants huddle with intel officials on election security | Top IT official names China main cyber threat MORE of Texas, sent to the Department of Justice more than five months ago. There’s no word of any action more than eight months after Sens. Lindsey Graham Lindsey Olin GrahamGOP signals unease with Barr's gun plan Overnight Defense: Trump says he has 'many options' on Iran | Hostage negotiator chosen for national security adviser | Senate Dems block funding bill | Documents show Pentagon spent at least 4K at Trump's Scotland resort GOP's Kennedy sends warning shot to Trump nominee Menashi MORE (R-S.C.) and Chuck Grassley Charles (Chuck) Ernest GrassleyGOP signals unease with Barr's gun plan NRA says Trump administration memo a 'non-starter' Barr fails to persuade Cruz on expanded background checks MORE (R-Iowa) sent a criminal referral to the DOJ against Christopher Steele, author of the anti-Trump political opposition research “dossier.”\n\nADVERTISEMENT\n\nThe Department of Justice took a pass on filing charges against ex-FBI Director James Comey James Brien ComeyNadler's House committee holds a faux hearing in search of a false crime We've lost sight of the real scandal Former Obama officials willing to testify on McCabe's behalf: report MORE for alleged violations that the inspector general documented with precision in more than 70 pages of a report last month.\n\nFinally, there have been no FBI apologies offered to former Trump campaign volunteer Carter Page after the FBI wiretapped him for more than a year. No post-mortem launched into how the FBI could have been so wildly wrong when swearing to the court, over and over, that Page was a Russian spy.\n\nSo, as Americans wait to see if a shoe is about to drop in McCabe’s case, the adage about indicting a sandwich is true. But the calculus may be different when those in charge of indicting the sandwich are the same ones making it.\n\nSharyl Attkisson (@SharylAttkisson) is an Emmy Award-winning investigative journalist, author of The New York Times best-sellers “The Smear” and “Stonewalled,” and host of Sinclair’s Sunday TV program, “Full Measure.”", "description": "At least two men who sat in the top spot at the FBI committed multiple violations that warrant possible prosecution.", "authors": [], "top_image": "https://thehill.com/sites/default/files/mccabeandrew_comeyjames_041818gn.jpg", "published_at": "2019-09-17"}