{"pub": "fox", "url": "https://foxnews.com/us/soldier-hailed-as-hero-after-el-paso-texas-shooting-arrested-on-suspicion-of-going-awol", "downloaded_at": "2019-10-04 23:54:20.645636+00:00", "title": "Soldier hailed as hero after El Paso shooting arrested on suspicion of going AWOL", "language": "en", "text": "The Army soldier praised as a hero for guiding a group of children to safety during the Aug. 3 mass shooting in El Paso, Texas, that left 22 people dead has been arrested for alleged desertion.\n\nPfc. Glendon Oakley Jr. was arrested Thursday by Harker Heights police on a military warrant for allegedly being absent without leave, police spokesman Lt. Stephen Miller told Fox News. Harker Heights is ln the vicinity of Fort Hood, near where Oakley grew up in Killeen. It's approximately 600 miles east of Fort Bliss, where he is stationed.\n\nMiller said Oakley was found in his car and taken into custody without incident. He was taken to the Bell County Jail. Jail records indicate he was not at the facility Friday, suggesting he might have been taken into military custody for extradition to Ft. Bliss, Miller said.\n\nSUSPECT IN SHOOTING AT TEXAS WALMART INDICTED ON CAPITAL MURDER CHARGE\n\n\"The chain of command is prepared to receive the soldier and address the issue according to applicable laws, regulation and the Uniform Code of Military Justice,\" Fort Bliss spokesman Master Sgt. Vin Stevens said in a statement on Friday.\n\nOakley, an automated logistics specialist assigned to the 504th Composite Supply Company of the 1st Armored Division Sustainment Brigade at Fort Bliss, was praised for his actions during the shooting at an El Paso Walmart, one of several shooting sprees that have renewed the debate over firearms regulations.\n\nHe told reporters he was purchasing a jersey in the nearby Cielo Vista Mall and was in a Foot Locker store when a child ran in and said a shooting was taking place. Gunfire soon followed in a nearby Walmart.\n\n“I saw a whole bunch of kids running around without their parents. … I tried to pick up as many as I could and bring them with me,” Oakley told local media after the attack. \"I'm in the military and I also have my license to carry. ... Being in the military, you just instantly think fast ... take cover, get whoever you can.\"\n\nOakley said he and another man began grabbing children and leading them to a safe area. He was awarded the Army Commendation Medal for his actions. However, his reported actions were questioned last month after El Paso police officials cast doubt on his account after reviewing surveillance footage of the shooting.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\n“We have no independent confirmation of that,\" the department said We have no independent reports of anyone’s actions at the mall.”\n\n\"We are genuinely concerned about the well-being of all soldiers in our unit,\" Col. Ronnie D. Anderson Jr., 1st Armored Division Sustainment Brigade commander, said in a statement to Fox News.", "description": "The Army soldier praised as a hero for guiding a group of children to safety during the Aug. 3 mass shooting in El Paso, Texas, that left 22 people dead has been arrested for alleged desertion.", "authors": ["Louis Casiano"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/GO.jpg", "published_at": "2019-10-04"}