{"pub": "foxnews", "url": "https://foxnews.com/politics/hillary-clinton-mocks-rudy-giuliani-yes-i-am-famously-under-scrutinized", "downloaded_at": "2019-10-02 12:49:48.822085+00:00", "published_at": "2019-10-02", "title": "Hillary Clinton mocks Rudy Giuliani accusation: 'Yes, I am famously under-scrutinized'", "language": "en", "text": "Former Democratic presidential nominee Hillary Clinton shot back at Rudy Giuliani, President Trump’s personal attorney, on Twitter on Tuesday after he accused her of being “protected and immune” to media scrutiny.\n\n“(The Washington Post), NBC, and CNN are going after me because I’m the messenger, and covering up the message, Dem corruption,” Giuliani tweeted about questions over his involvement in trying to get Ukraine to investigate Joe Biden and his son Hunter Biden. “Meanwhile, they have yet to ask Biden difficult questions because he is protected and immune like the Clintons and crooked Clinton Foundation!”\n\nSTATE DEPARTMENT STEPPED UP HILLARY CLINTON EMAIL PROBE BEGINNING IN AUGUST: REPORT\n\n“Yes, I am famously under-scrutinized,” Clinton sarcastically tweeted in response, alluding to the investigation into her use of a private email server as secretary of state that dominated the 2016 presidential campaign, the Benghazi investigation while she was secretary of state as well as others going back to her time as first lady.\n\nThe State Department expanded its investigation into Clinton’s private server in August.\n\nThe House of Representatives is launching an impeachment inquiry into Trump’s July phone call with Ukrainian President Volodymyr Zelensky in which he asked Zelensky to investigate alleged wrongdoing by Joe Biden and his son Hunter Biden in the country.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nClinton is scheduled to appear on both “The View” and “The Rachel Maddow Show” on Wednesday as she promotes “The Book of Gutsy Women,” which she co-wrote with her daughter Chelsea Clinton.", "description": "Former Democratic presidential nominee Hillary Clinton shot back at Rudy Giuliani, President Trump’s personal attorney, on Twitter on Tuesday after he accused her of being “protected and immune” to media scrutiny.", "authors": ["Brie Stimson"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/hilary-clinton.jpg"}