{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-50155813", "downloaded_at": "2019-10-30 02:26:44.710491+00:00", "title": "Can the Queen vote, and other election questions", "language": "en", "text": "Media playback is unsupported on your device Media caption Don't get left outside on polling day - here's how to register to vote\n\nIt is looking increasingly likely that the UK will have a general election on 12 December. So what do you need to know?\n\nWho is eligible to vote?\n\nTo vote in a general election you must be registered to vote and 18 or above on polling day.\n\nYou must be a British citizen, a citizen of the Republic of Ireland, or a Commonwealth citizen who meets certain eligibility criteria. You must live in the UK, or be a British citizen abroad who has been registered to vote in the last 15 years.\n\nSome people are excluded from voting, including members of the House of Lords, convicted prisoners, anybody found guilty of electoral fraud within the past five years, and people with any \"legal incapacity\" that impairs their judgement.\n\nThe electorate is slightly different in a general election than in the Brexit referendum, which included those registered to vote in Gibraltar.\n\nHow do I register to vote?\n\nIt takes about five minutes to register on the government's website, or you can register by post. You will need your National Insurance number, date of birth and address.\n\nStudents can vote using their university or home address. It is legal to be registered in two areas, but a criminal offence to vote in both.\n\nPeople who are away for work or a holiday on election day can vote by post or proxy, which means nominating someone to cast a ballot for you. Your proxy must be a registered voter over the age of 18.\n\nCan the Queen vote in a general election?\n\nThe Queen does not vote. She \"has to remain strictly neutral with respect to political matters\" and is \"unable to vote or stand for election\", according to Buckingham Palace.\n\nImage copyright Getty Images Image caption Each incoming prime minister is formally asked by the Queen to form a government\n\nHowever, the monarch is legally allowed to cast a ballot in general elections.\n\nThe Queen does not vote \"by convention... rather than because of a legal impediment\", the Electoral Commission has said.\n\nWho runs the country during an election period?\n\nParliament is dissolved 25 working days before a general election. This means every seat in the House of Commons becomes vacant and MPs stop representing their constituencies. They even stop being able to use MP in their name.\n\nHowever, government ministers remain in office and in charge of their departments until a new government is formed.\n\nBy convention, after Parliament is dissolved, a period called \"purdah\" begins, when ministers' activities and the use of official resources are restricted.\n\nWhy is a pencil used for voting?\n\nThe Electoral Commission says that pencils are usually used in polling booths for practical reasons. The ink from a pen could leave a mark when a ballot paper is folded, or run or spill.\n\nImage copyright Getty Images Image caption Dogs are sometimes allowed in polling stations, if they're on a lead\n\nBut there's nothing in law that says you have to use a pencil. If voters want to, they can take their own pen.\n\nDo I need my polling card to vote?\n\nAfter registering to vote, your council will send you a polling card. That includes details of your polling station and when you can vote.\n\nYou don't need to take this polling card with you to vote. Tell the polling clerks your name and address, and they will issue your ballot paper.\n\nIn England, Scotland and Wales, you don't need to take photo ID either, despite recent government proposals.\n\nBut that's not the case in Northern Ireland, where identification is needed.\n\nIs it illegal to take photos in a voting booth?\n\nThere are no laws against taking photos in a polling booth but it is strongly discouraged. That's because laws to make sure votes stay secret are very complex.\n\nFor example, it's illegal to reveal how somebody else has voted - and taking of photos could break that rule.\n\nWho will be the first to declare results?\n\nFor 25 years, Sunderland South - latterly Houghton and Sunderland South - was the country's first to declare their results.\n\nBut in the 2017 general election, Newcastle upon Tyne Central beat them by seven minutes - delivering their results at 23:00, an hour after polling stations closed.\n\nSunderland City Council says being organised is the key to efficient counts. It uses local sixth-formers to pass ballot boxes down the line and council staff and bank tellers to count the votes.\n\nWhat happens to voting slips?\n\nOnce the votes have been counted and the winners declared, all the ballot papers are put in sealed bags and stored securely for one year.\n\nThey have to be kept separately - sorted by counted papers, postal votes, rejected papers or unused ones.\n\nImage copyright Getty Images\n\nThat's in case the result of the election is challenged legally, for example if someone thinks a candidate broke the law, or votes weren't counted correctly.\n\nAfterwards, the council is responsible for their disposal. Some shred the papers and recycle them, but they don't have to.\n\nWho organises an election?\n\nAs soon as Parliament is dissolved, there is a lot to do.\n\nBefore election day, jobs include delivering nomination papers, making sure postal and proxy votes are sent out and new voters are registered.\n\nThe people in charge of this are called returning officers. There's one for each constituency.\n\nThey're also responsible for finding presiding officers to oversee each polling station, poll clerks to staff the stations and counting assistants to finalise the result.\n\nDo you have any other questions about elections?\n\nIn some cases your question will be published, displaying your name and location as you provide it, unless you state otherwise. Your contact details will never be published. Please ensure you have read the terms and conditions.\n\nUse this form to ask your question:", "description": "It's looking likely the UK will have a general election.", "authors": [], "top_image": "https://ichef.bbci.co.uk/images/ic/1024x576/p07sf8xm.jpg", "published_at": "2019-10-29"}