{"pub": "huffpost", "url": "https://huffpost.com/entry/amara-la-negra-colorism-latinx-love-hip-hop_n_5d796125e4b0a938a42d887c", "downloaded_at": "2019-09-16 23:12:39.836153+00:00", "title": "‘Love & Hip Hop’ Star Amara La Negra On Why The Latinx Community Must Address Colorism", "language": "en", "text": "“Love & Hip Hop” regular Amara La Negra is no stranger to the side glances and microaggressions that come with having dark skin. The singer, entertainer and Afro-Latina is proud of her heritage — that is, except for the racism that’s still present within the Latinx community.\n\nA deep-rooted history of colorism and slavery contributed to a culture in which Latinx people are still discriminated against by members of their own community, even as they are made up of many different colors, shapes and sizes.\n\n“Growing up, my mom used to always tell me that, because of the color of my skin, I would always have to work twice as hard to be recognized for my work,” Amara told HuffPost in an interview. “It wasn’t until I got older that I realized and understood what she meant by it.”\n\nThe singer’s mother is from the Dominican Republic and immigrated through the Mexican border to the United States in search of a better life. Inspired by the journey her mother took to get here, Amara, born Diana Danelys De Los Santos, has spent her career fighting for Black and Latinx representation.\n\nMaria Alejandra Cardona for HuffPost Amara La Negra, a Dominican-American hip-hop artist stands and poses in Miami, Florida on Aug. 29, 2019.\n\nAs she broke into the entertainment scene in Miami through television appearances on VH1′s “Love & Hip Hop,” Amara wore her culture like a badge of honor. She incorporated soca, dancehall and Afro-beats into her music and performance, inspired by the sounds of her ancestors. But her success came with backlash — against her Black skin.\n\n“Here’s a classic one — people consider me to be physically attractive, and I get the, ‘Oh my god, you’re a pretty Black girl,’ or ‘For being Black, you’re really pretty,’” Amara said. “I went to do an audition for a soap opera, and they told me, ‘You’re probably not going to get the role because they want someone who looks more Latina.’”\n\n“La Negra” from her stage name translates to “the Black one,” which is how she said people referred to her during her time in the girl group Amara when they didn’t remember her name. She uses that distinction as her stage name to celebrate her Blackness.\n\nMaria Alejandra Cardona for HuffPost\n\nInspired by the dismissive comments against her skin and look — her big hair is as powerful as her voice — Amara became an outspoken advocate against racial discrimination and colorism in the entertainment industry. She started performing on Sábado Gigante at a young age, which prepared her for stardom, but it was her role in “Love & Hip Hop” that helped fully expand her audience, influence and platform.\n\nRacism within the Latinx community is rooted in the Spanish, French and Portugese colonization of Latin America and the Caribbean, according to Dr. Melissa M. Valle, an African American Studies professor at Rutgers University.\n\nThe majority of Africans brought to the Americas by the transatlantic slave trade were enslaved in colonies throughout Latin America and forced to work on sugar, tobacco and rice fields. Indigenous people were also enslaved on these plantations. From Cuba to Brazil, slaves were a major part of agricultural growth throughout the region.\n\nA social hierarchy based on skin color was established by European imperialists in which white Europeans put themselves on top. Mestizos and mulattos — those of mixed race, part African or part Native — were below them. At the bottom were the African and indigenous enslaved people.\n\nMaria Alejandra Cardona for HuffPost\n\n“Those become the central beginnings of a very long history of racial hierarchy in these spaces and they carry over to the U.S. community,” Valle said.\n\nDuring Valle’s visits to Latin America, she witnessed the harsh realities many people still face there because of their skin color, including verbal, physical and political attacks on Black people. In Latin media, the most prominent figures are light-skinned or white-passing.\n\n“Colorism plays out in a lot of different ways — marriage, education, prison sentences, income, occupational status,” Valle said. “There’s nothing inherently better about light eyes, straight hair — it’s something that comes from outside. It’s interesting because people attempt to capture that and ‘improve the race.’”\n\n“Mejorar la raza,” a common phrase in the community, reinforces the idea that white or lighter skin is better and amplifies the idea that producing light-skinned children should be the goal for many families and relationships.\n\nBut there’s no one way that a Latina should look, Amara said.\n\n“I’ve been discriminated against so many times and that’s why I’ve decided to be an activist,” she said. “I want to say the day that I die, my life mattered.”\n\nAfter coping with her own challenges of overcoming prejudice, the reality TV star doesn’t want Black and brown children to feel discouraged, underrepresented or looked down upon for their skin color.\n\n“They are the future. It’s hard out here. It’s been a hard journey for myself,” she said. “In my case, I get the best of both worlds. I’m Black and Latina and we already know how it feels in the United States.”\n\nShe’s referring to attacks from President Donald Trump who has called immigrants like her mother “animals,” “rapists” and “criminals.”\n\nMaria Alejandra Cardona for HuffPost\n\nDespite this rhetoric, Amara wants young people of color who are looking for Hispanic and Latinx role models to leave behind the colorism and racism of their communities and lift each other up. She wants to see them thrive.\n\n“With what we’re seeing with our president and everything that’s happening right now, it’s only getting harder, but nothing is forever,” Amara said. “I want to make sure that the youth knows not to lose hope, nothing is impossible. Our ancestors didn’t lose hope.”\n\nFor Amara, the best way to make a change is to create.\n\n“People feel as if, if you don’t have a big platform, then what are you supposed to do? Use your voice to make a difference,” she said. “Unite people around your community to feel the same way that you do. Come up with ideas, concepts, reach out. There are so many things you can do.”\n\nNuestras Voces Unidas (Our Voices United) is a HuffPost series created to honor Hispanic Heritage Month and amplify the diverse voices within the community. Find all of our coverage here.", "description": "“I went to do an audition ... and they told me, ‘You’re probably not going to get the role because they want someone who looks more Latina,’” the enterta...", "authors": ["Associate Producer"], "top_image": "https://img.huffingtonpost.com/asset/5d7ba2d02400002e2a796c92.jpeg?ops=1778_1000", "published_at": "2019-09-16"}