{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/09/the-best-tools-for-conquering-your-massive-read-later-list", "downloaded_at": "2019-09-14 01:43:57.251130+00:00", "title": "The Best Tools For Conquering Your Massive 'Read Later' List", "language": "en", "text": "Photo: Getty Images\n\nA “read later” list is an essential productivity tool. Sending articles to a separate app for later reading keeps you focused when you’re at work, and gives you something productive to do on your phone during downtime. But it’s easier to save an article than to read it, so stories on “read later” lists (like in the apps Instapaper and Pocket) tend to pile up. Here are three different strategies for getting through your reading list, and the tools to execute them.\n\nReading Queue: Force yourself to read\n\nImage: Reading Queue\n\nIf you have to hunt through your reading list app for the items you really want to read, you have too much clutter in your list. It’s time to either read those articles you skip every time, or let them go.\n\nIf you have decent self-control, you can go through your reading list like you’d go through a neglected inbox, and archive everything that isn’t immediately interesting. Go through ruthlessly— if you regret archiving an article, you can always dig it up later. (More likely, you’ll forget about it forever and you’ll be fine.)\n\nIf you don’t have that self-control, you need an app like Reading Queue, which will only show you one item at a time. You can only skip an item three times before the app deletes it. This way you spend more time reading, and less time hunting for something to read.\n\nMailist: Turn your reading list into an email newsletter\n\nIf the problem is that you never open your reading list app, then try sending articles to your email inbox instead. The Mailist extension for Chrome and Firefox works like Instapaper or Pocket, but instead of saving articles to an app, it compiles them into an email newsletter just for you.\n\nIf you have the reverse problem—a cluttered inbox with newsletters you’ve been meaning to read—then use these instructions to send those newsletters to Instapaper.\n\nTricks like this might not work forever, as your brain starts to ignore the reading-list emails just like it ignored the reading-list app. But if they even work for a few weeks, they’ll help you put a dent in your list. (I’m a big believer in “the tool that works right now.”)\n\nAccelerator: Speed-read\n\nImage: Accelerator\n\nInstapaper can force you to speed-read your articles with the “Speed” tool. While viewing an article, hit the share button on the right end of the bottom menu. In the row of grey share options, hit the speedometer icon.\n\nPocket has no speed reader. But it’s supported by the third-party speed reading app for iOS, Accelerator.\n\nThere are weirder options for getting through your reading list. Pocket and Instapaper have read-aloud features, so you can listen to a Siri-style automated voice read articles like a robotic podcast. You could even adopt some of the techniques from our “how to read more books” posts, and read articles aloud with a friend or partner. We personally wouldn’t go this far, but it works for someone out there.\n\nIt’s fun to go into “super-efficient” mode and skim, archive, and delete unwanted articles. But one session usually isn’t enough to clean out your reading list forever. Pick a part of your day that regularly lends itself to breezing through your phone—on the toilet, on the train, in lines—and put yourself in that headspace each time. (Set a daily reminder if you have to.) The rest of the time, you can sit back and relax with a full article. But for those few minutes, you’re in terminator mode: seek and destroy.", "description": "A “read later” list is an essential productivity tool. Sending articles to a separate app for later reading keeps you focused when you’re at work, and gives you something productive to do on your phone during downtime. But it’s easier to save an article than to read it, so stories on “read later” lists...", "authors": ["Chris Jager"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/kwltterznk9jpmwufdoo.jpg", "published_at": "2019-09-14"}