{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/13/nascar-appears-have-banned-gun-ads-leaving-fans-qu", "downloaded_at": "2019-09-13 19:25:20.358552+00:00", "title": "NASCAR rejects advertising from gun companies, leaving fans to question its 2nd Amendment stance", "language": "en", "text": "NASCAR has reportedly been denying firearm companies the ability to advertise on their programming this summer as part of a “gradual shift” in their position on guns.\n\n“They’ve got the drivers shooting off blanks in the winner’s circle. It doesn’t make any sense,” said David Dolbee, general manager of K-Var Corp., whose company was denied an advertisement featuring multiple gun-related products, including an AK-47.\n\nFans told CNN that gun enthusiasts and NASCAR fans typically overlap, and now that the company appears to have denied ads with little direct explanation, many are questioning whether the stock-car racing organization still supports the Second Amendment.\n\nThe Washington Free Beacon first reported that after companies submitted their advertisements, they were told third-party advertising vendor, National Event Publications, because their ads showed “assault-style rifles/sniper rifles.”\n\n“We just heard from NASCAR on a number of gun-related ads and unfortunately, due to a gradual shift in NASCAR’s position on guns, these ads must be edited/changed — especially those that are depicted as assault-style rifles/sniper rifles. NASCAR is still open to some of the less controversial gun accessories, concealed carry, or classes.”\n\n“This is a colossal mistake,” Mr. Dolbee said. “Do they not understand their own base? They are a sporting organization trying to take sides on a political issue. That never goes well for any company.”\n\nEd Newman, a founder of firearms manufacturer Dark Storm Industries in New York, said they also received a similar rejection that seemed “like a pretty rapid and dramatic shift.”\n\n“We have seen a significant response on social media with the majority of NASCAR fans expressing their disapproval of this shift in policy,” he said.\n\nIn an online post, the National Rifle Association slammed NASCAR for banning “America’s Rifle” from their programming.\n\n“It is not clear if NASCAR is now taking an official position in opposition to semi-automatic rifles —with the AR-15 variants often referred to as America’s Rifle — and bolt action rifles,” they said.\n\n“What does seem clear, however, is that NASCAR doesn’t want to see such things advertised in its official publication in the future: a decision that could easily alienate a great many of its most ardent fans,” the NRA added.\n\nNASCAR is still accepting advertising with Gander Outdoors and Bass Pro Shops, two sporting goods chains which also sell guns.\n\nThe organization’s decision comes as multiple businesses have re-evaluated their stance on firearms as calls for gun control continue to get louder.\n\nCEOs from 145 businesses wrote a joint letter Thursday calling for Congress to take action on gun violence for the safety of their customers and employees.\n\nAfter a mass shooting in one of their El Paso stores left 22 people dead, Walmart announced they would stop selling handguns and restocking ammunition. They also requested customers discontinue open carrying in their store regardless of state laws.\n\nIn February 2018, Dick’s Sporting Goods discontinued their sales of semi-automatic rifles and high-capacity magazines in response to the Parkland school shooting and are considering a full ban on all firearms.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "NASCAR has reportedly been denying firearm companies the ability to advertise on their programming this summer as part of a \"gradual shift\" in their position on guns.", "authors": ["The Washington Times Http", "Bailey Vogt"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/08/NASCAR_Indianapolis_Auto_Racing_52416.jpg-355ae_c0-171-4093-2557_s1770x1032.jpg?6ec86bd6273752003714760ca1c44a74a932b9ca", "published_at": "2019-09-13"}