{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/towies-chloe-lewis-shares-first-20651778", "downloaded_at": "2019-10-19 11:27:29.114192+00:00", "title": "TOWIE's Chloe Lewis shares her first photo with her adorable newborn baby boy", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nFormer TOWIE star Chloe Lewis has shared her first picture of her newborn son.\n\nThe 28-year-old and her banker boyfriend Danny Flasher became parents for the first time this week.\n\nThey enjoyed a day out shopping and having lunch with their son, whose name has not be revealed, who was wrapped up in an adorable outfit complete with cute bunny ears.\n\nChloe uploaded the image to her Instagram page saying: \"My little bundle of joy... I still can’t believe you're mine (shopping trip & lunch today with daddy).\"\n\n(Image: Instagram)\n\nThe new mum is looking down adoringly at her baby in the sweet photo which has attracted thousands of comments including many from her TOWIE pals.\n\nChloe announced the arrival of her son on Instgram on Sunday with an image of his feet that attracted more than 221,000 likes.\n\nShe said: \"Earlier this week our baby boy arrived. We are completely besotted & so so in LOVE.\"\n\nTOWIE stars who commented included Lydia Bright, who is pregnant herself.\n\n(Image: Instagram)\n\nShe said: \"Oh Chloe, I can't wait for a cuddle.\"\n\nWhile former JLS member Marvin Humes commented: \"Can’t wait to meet him! Congrats you two x\"\n\nChloe announced she and boyfriend were expecting their first child back in May.\n\nThe couple decided to not find out the sex of the baby because they wanted it to be a surprise.\n\n(Image: Instagram)\n\nLast month she revealed she had been expecting twins but tragically lost one baby eight weeks into her pregnancy.\n\nShe discovered the tragedy when she began bleeding and a scan showed two fetuses in the womb, but the doctor warned that only one was visible.\n\nChloe told OK! magazine: \"I told her about the bleeding and she said that I probably had lost it.\n\n\"The doctor did confirm the twins had been identical. That was so sad for me to hear.\n\n\"I kept thinking this one is going to come out and they would have looked exactly the same.\"\n\nChloe, a former model, and Danny have been in a relationship for two years.\n\nShe rose to fame on the ITVBe's reality TV programme in 2015 and according to Mail Online she recently revealed she left the series as she felt she had outgrown it.\n\n", "description": "The 28-year-old and her banker boyfriend Danny Flasher became parents for the first time this week", "authors": ["Lorraine King", "Image", "Instagram"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20651808.ece/ALTERNATES/s1200/1_chloelewis91_71681849_242378226736838_8558928532877740014_nAJPG.jpg", "published_at": "2019-10-19"}