{"pub": "breitbart", "url": "https://breitbart.com/news/trump-g7-summit-wont-take-place-at-his-florida-resort", "downloaded_at": "2019-10-20 05:14:13.030239+00:00", "title": "Trump: G7 summit won’t take place at his Florida resort", "language": "en", "text": "Oct. 19 (UPI) — President Donald Trump on Saturday night announced that next year’s G7 economic conference won’t take place next summer at Trump National Doral Golf Course near Miami, reversing a decision two days ago.\n\nAfter criticism from Democrats and some Republican, Trump posted on Twitter a change in plans for the summit involving the seven nations.\n\n“Therefore, based on both Media & Democrat Crazed and Irrational Hostility, we will no longer consider Trump National Doral, Miami, as the Host Site for the G-7 in 2020,” he tweeted around 10 p.m. “We will begin the search for another site, including the possibility of Camp David, immediately. Thank you!”\n\nOne hour before, he defended the original decision on Twitter but hadn’t announced plans would change.\n\n“I thought I was doing something very good for our Country by using Trump National Doral, in Miami, for hosting the G-7 Leaders,” Trump tweeted. “It is big, grand, on hundreds of acres, next to MIAMI INTERNATIONAL AIRPORT, has tremendous ballrooms & meeting rooms, and each delegation would have its own 50 to 70 unit building. Would set up better than other alternatives. I announced that I would be willing to do it at NO PROFIT or, if legally permissible, at ZERO COST to the USA. But, as usual, the Hostile Media & their Democrat Partners went CRAZY!”\n\nOn Thursday, acting White House Chief of Staff Mick Mulvaney told reporters the resort in South Florida had been chosen over other choices because it is “the best place.”\n\nTrump National Doral Golf Course near Miami opened in 1962 and consists of 800 acres. Trump purchased the property in 2012.\n\nThe White House had said the event would be run “at cost,” or without profit by the Trump Organization because of the emoluments clause of the Constitution that prohibits the president from accepting gifts and money from foreign governments.\n\nBut member of Congress suggested there was value because of the publicity of conducting the summit at the property.\n\n“I read the emoluments clause again yesterday,” U.S. Rep. Adam, a Republican from Illinois told CNN on Friday, “and it talks about titles and nobility and all this. I don’t know if it’s a direct violation, but I don’t understand why at this moment they had to do it.”\n\nOther Republicans had defended the decision of the president, who is facing an impeachment in the House by Democrats.\n\n“The American people are much more concerned about not where it happens, but what happens at the event,” GOP Rep. Jim Jordan told CNN.\n\nOn Friday, House Speaker Nancy Pelosi told CNN that conducting the G7 at one of Trump’s property was “completely out of the question.”\n\nFormer White House press Secretary Ari Fleischer tweeted: “Good call.”\n\nTony Schwartz, who ghost wrote Trump’s The Art of the Deal, noted the quick reversal.\n\n“Trump never admits being wrong on anything,” he tweeted. Now, after fierce criticism for clear self-dealing, he says he won’t hold G-7 at his own hotel after all. One more sign that he is feeling threatened and running scared.”\n\nThe White House advance team scouted locations in California, Colorado, Hawaii, Michigan, North Carolina, Tennessee and Utah.\n\nMulvaney said the Trump administration ruled out Camp David, the presidential retreat in Maryland, where the G7 took place in 2012.\n\nThe next G-7 is scheduled for June 10-12. This year’s event was held Aug. 24-26 in the resort town of Biarritz, France, from where he first suggested his Doral property would be an ideal location.\n\nThe G-7 consists of the the United States, Italy, Japan, France, Great Britain, Canada and Germany. Russia was voted out in 2014 though Trump wants the nation back in.", "description": "Oct. 19 (UPI) — President Donald Trump on Saturday night announced that next year’s G7 economic conference won’t take place next summer", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-19"}