{"pub": "reuters", "url": "https://reuters.com/article/us-autos-hydrogen-southkorea-insight/hydrogen-hurdles-a-deadly-blast-hampers-south-koreas-big-fuel-cell-car-bet-idUSKBN1W936A", "downloaded_at": "2019-09-25 04:45:49.974541+00:00", "title": "Hydrogen hurdles: a deadly blast hampers South Korea's big fuel cell car bet", "language": "en", "text": "SEOUL (Reuters) - Aiming to cash in on a major push by South Korea to promote fuel cell vehicles, Sung Won-young opened a hydrogen refueling station in the city of Ulsan last September. Just one year on, he’s thinking about closing it down.\n\nPeople attend a protest against hydrogen fuel cells power plant in Incheon, South Korea, August 8, 2019. Picture taken August 8, 2019. REUTERS/Jin Hyunjoo\n\nSung’s new hydrogen station is one of five in Ulsan, home to Hyundai Motor Co’s (005380.KS) main plants and roughly 1,100 fuel cell cars - the most of any South Korean city.\n\nThe government paid the 3 billion won ($2.5 million) cost - six times more than fast charging equipment for battery electric cars - and the two pumps, located next to Sung’s gasoline stand, see a steady flow of Hyundai Nexo SUVs daily.\n\nEven so, Sung hasn’t been able to turn a profit, hamstrung as the equipment can only refuel a limited number of cars each day and by the government’s decision to set retail hydrogen prices low to bring consumers on board.\n\n“All hydrogen stations will have no choice but to shut down unless the government subsidizes operating costs,” Sung, 32, told Reuters. “Otherwise, this place will just become a 3 billion won chunk of steel.”\n\nIf those impediments to commercial viability were not enough, a fatal hydrogen storage tank explosion this year has spurred protests against the government and Hyundai’s ambitious campaign to promote the zero-emissions fuel.\n\nCalling hydrogen power the “future bread and butter” of Asia’s No. 4 economy, President Moon Jae-in has declared himself an ambassador for the technology and targeted 850,000 fuel cell vehicles (FCVs) on South Korean roads by 2030.\n\nThat’s no mean feat given fewer than 3,000 have been sold so far. Japan, also a big proponent of FCVs and with an auto market three times larger, plans 800,000 in the same timeframe.\n\nThe challenges of building out refueling infrastructure in South Korea underscore the long and uphill battle FCVs face to widespread adoption at a time when electric cars are stealing much of the green car limelight.\n\nAnd for the government and Hyundai, the only automaker selling a fuel cell car in the country, it is an expensive project with no guarantee of success.\n\nMoon is set to spend $1.8 billion in central government funds to subsidize car sales and to build refueling stations for the five years to 2022 at current subsidy levels, Reuters calculations show.\n\nSubsidies cut Nexo’s price by half to about 35 million won ($29,300) and sales of the model, launched in March 2018, have surged this year. In contrast, Japanese subsidies fund one third of Toyota Motor Corp’s (7203.T) Mirai FCV, bringing its price to around $46,200.\n\nSome critics argue Hyundai is the main beneficiary of the government’s ardent backing, but the automaker also has much at stake. With its suppliers, it plans to invest $6.5 billion by 2030 on hydrogen R&D and facilities.\n\n“There are risks that come with the need to make large-scale investments in building (hydrogen car) production facilities, securing supply channels and establishing sales networks,” Hyundai said in an e-mailed statement.\n\n(GRAPHIC: South Korea's push for a hydrogen economy - here)\n\nHIGH PRESSURE\n\nIn May, a hydrogen storage tank at a government research project in the rural city of Gangneung exploded. It destroyed a complex about half the size of a soccer field, killing two and injuring six. A preliminary investigation found the blast was caused by a spark after oxygen found its way into the tank.\n\n“One victim was blown away by pressure and then killed after being hit by rock,” said Kong Gikwang, a lawyer who represents the family of one of the two who died in a lawsuit against the research complex.\n\nOne month later, there was an explosion at a hydrogen refueling station in Norway. This week, a hydrogen gas leak and subsequent fire at a South Korean chemical plant caused three workers to suffer burns.\n\nSuch safety concerns have fueled protests by South Korean resident groups worried about hydrogen facilities being built in their areas.\n\nKim Jong-ho, who began a month-long hunger strike against a planned fuel cell power plant in the port city of Incheon two days before the Gangneung blast, said the explosion refocused attention from pollution risks of hydrogen production to safety. Incheon has since agreed to review the safety and environmental impact of the plant.\n\nPotential station operators have also gotten cold feet since the explosions.\n\nPyeongtaek city in April picked two gasoline stand operators to run hydrogen stands but within three months, both decided to bow out, forcing the city to restart its search.\n\n“At first, I had great interest. But once I looked closely, I realized the government was pushing for something that can’t make profits,” one of the prospective operators said, asking not to be identified.\n\n“And I couldn’t live worrying about whether there would be an explosion.”\n\nTo counter such fears, the government is holding briefings for residents, while Hyundai said it is working to convince consumers of hydrogen’s safety with information promoted through Youtube and social media.\n\n‘VALLEY OF DEATH’\n\nDespite government plans for 114 hydrogen stations - key for the widespread adoption of FCVs - to be built by end-2019, only 29 have been completed. Difficulties in gaining funds from local governments or businesses meant to help shoulder half the costs, delays in finding sites and opposition from residents have also hobbled efforts.\n\nThose constructing the stations know they are in for a slog.\n\n“There will be a period of going through the valley of death,” Yoo Jong-soo, CEO of a consortium which has been tasked with building 100 stations but which does not expect to make money until 2025, said in a June presentation.\n\nThe consortium, which includes Hyundai, has also called on the government to subsidize operating costs for hydrogen stands. Such a move is under consideration, an industry ministry official told Reuters, declining to be identified as the plan has not been finalised.\n\n“This will only increase the burden for taxpayers who have to pay for the government’s hydrogen society splurge,” said Ryu Yen-hwa, a former Hyundai Motor engineer and auto analyst who believes FCVs do not make commercial sense.\n\nJust last month, Moon’s administration announced it would more than double spending on the ‘hydrogen economy’ to over 500 billion won next year.\n\nThat includes 359 billion won on FCVs and refueling stations, up 52% from this year and a huge leap from the 29.8 billion won spent in 2018.\n\nDRIVER FRUSTRATIONS\n\nHyundai, which touts the Nexo as an “air purifier on the road”, is banking on Seoul’s aggressive targets to help it achieve economies of scale and bring down costs.\n\nIt aims to cut the cost of a hydrogen car before subsidies to 50 million won once annual FCV production reaches 35,000. It hopes to make 40,000 per year by 2022, compared with plans for 11,000 next year.\n\nIn the meantime, however, the constraints around refueling and the limited number of stations are causing much frustration.\n\nHydrogen stand operator Sung said while refueling itself takes about 5-7 minutes, the next driver must wait another 20 minutes before sufficient pressure builds in the storage tank to supply the hydrogen or the car’s tank will not be full.\n\nThat means he can only service about 100 fuel cell cars a day, compared to up to 1,000 at his gasoline stand. Many drivers can also not be bothered to wait 20 minutes and leave without a full tank.\n\nChoi Gyu-ho, who bought his Nexo to take advantage of low fuel prices, also noted that a lack of stations elsewhere made it hard to leave Ulsan.\n\n“It is very inconvenient. I feel anxious when I drive out of the city,” he said.\n\n($1 = 1,194 won)\n\n<^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n\nEXPLAINER-Why Asia’s biggest economies are backing hydrogen fuel cell cars\n\nFOCUS-Toyota banks on Olympic halo for the humble bus to keep hydrogen dream alive\n\nGRAPHIC-South Korea's push for a hydrogen economy tmsnrt.rs/306wC2h\n\nSlideshow (6 Images)\n\nGRAPHIC-South Korea's push for a hydrogen economy (interactive) tmsnrt.rs/308ntX2\n\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^>", "description": "Aiming to cash in on a major push by South Korea to promote fuel cell vehicles, Sung Won-young opened a hydrogen refueling station in the city of Ulsan last September. Just one year on, he's thinking about closing it down.", "authors": ["Hyunjoo Jin", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190924&t=2&i=1433528353&w=1200&r=LYNXMPEF8N2D7", "published_at": "2019-09-24"}