{"pub": "usatoday", "url": "https://usatoday.com/story/opinion/2019/10/14/debate-2020-challengers-trump-change-impeachment-headlines-column/3963429002", "downloaded_at": "2019-10-14 10:12:42.726785+00:00", "title": "President Trump should debate his 2020 Republican challengers to distract from impeachment", "language": "en", "text": "Donald Trump should break with tradition and debate his Republican primary challengers. He needs to make new headlines that aren't about impeachment.\n\nAs polls show public support for impeachment escalating, President Donald Trump must change the narrative. I'm a communications strategist, and that's what I'd tell him if he were my client.\n\nLast month, Trump said he would not debate his 2020 primary challengers, adding that \"I'm not looking to give them any credibility.” Even though I’m not a Trump supporter, I would argue the exact opposite: Trump needs to boost his own credibility, and debating his “laughingstock” Republican rivals, as he describes them, gives him that opportunity.\n\nOver 45% of independents now back impeachment or an impeachment inquiry, up from 33.7% on April 18 when the Mueller report was made public, according to FiveThirtyEight’s polling average. Republican support is also slowly rising. This erosion should alarm Trump and his party as Democrats move ahead quickly on their impeachment inquiry.\n\nImpeachment questions won't faze Trump\n\nWhile a debate stage is not the White House press corps, it is a national stage with pointed questions that would allow Trump to be commanding. Moderators would certainly ask Trump and his challengers — former Massachusetts Gov. Bill Weld, former South Carolina Gov. Mark Sanford and former Illinois congressman Joe Walsh — about impeachment, but Trump has shown time and time again that he can deflect any serious criticism with snark and smirk.\n\nTrump's challengers shouldn't exclusively discuss impeachment in a debate, because it won’t give voters an optimistic reason to vote for them. But even if they wanted to and tried to, moderators would inevitably drive the discussion toward conservative red meat issues like immigration, Obamacare and taxes. Following any debate, Trump would command the cable TV networks and print headlines while discussing something other than impeachment. Moderators can ask Trump about anything other than impeachment, and Trump will have already won.\n\nGOP primary debate in Miami, Florida, on March 10, 2016. (Photo: Edward M. Pio Roda/epa/CNN)\n\nIn addition, debates would allow Trump to:\n\n►Normalize the political landscape. A primary debate is a normal political occurrence. And while it’s not common for a sitting president to debate primary challengers during a reelection campaign, it is much more normal to see any political candidate debate rivals before an election than it is to defend an impeachment inquiry day after day. Americans would welcome (or ignore) the return of electoral politics to their TV screens, rather than unfettered impeachment chatter.\n\n►Harden and possibly expand Trump's support. Primary debates give the president a chance to sell his vision for a second term to the GOP faithful. While his core supporters will vote for him either way, wavering moderate Republicans would hear a president who rallies them on key issues like immigration reform, tax cuts and health care. He could win back soft Republican voters whom he might have lost over the course of a tumultuous first term. Endless talk of impeachment will only drive moderate voters further away.\n\nChange the subject, command the headlines\n\n►Show radical confidence. The Republican National Committee and some state parties have taken steps to cauterize any potential challenge to Trump. Several state GOP committees have outright canceled their party primaries or caucuses. This strategy makes Trump look afraid and weak. Primary debates would let Trump give Americans the feeling that he’s unafraid of rivals and welcomes dissent. It’s a boon to his political image and would only make him stronger.\n\nGive us options: We need an active, robust Republican primary with choices that aren't Donald Trump\n\n►Define the competition. Think of primary debates as a test run for general election debates. If Trump is given a few evenings to define his competition, they’d likely dread ever agreeing to be on the same stage with him. Just ask “low-energy” Jeb Bush, “Lyin’ ” Ted Cruz, or “Little” Marco Rubio about how they felt standing next to him in 2016. Trump would also have a stage to deploy silly nicknames for his Democratic rivals, garner a few laughs and critically define his competition.\n\nKeep it substantive: Dear news media, don't turn the 2020 Democratic debates into Trump-like Twitter fodder\n\nConventional political wisdom dictates that incumbents should avoid debates like Sen. Elizabeth Warren avoids Manhattan’s Upper West Side cocktail party circuit. And while I would advise any other incumbent to heed that advice, as a student of politics, I believe primary debates would be a boon for Trump. Since the Ukraine whistleblower and impeachment inquiry have dominated the news, Trump has been unable to pivot to friendlier territory. Debating GOP has-beens gives him the opportunity to speak directly to Republican voters in front of a largely supportive audience.\n\nThe latest RealClearPolitics average of 2020 GOP presidential nomination polls has Trump sitting comfortably at 85.8%, while his nearest rivals feed from the bottom at 2.5%. Intraparty debates are not going to greatly change any of these candidates’ poll numbers within the Republican primary. But debates are an opportunity for Trump to command the stage, command the headlines and distract from a much more serious problem that could end his presidency without any Americans voting — impeachment and removal from office.\n\nJames G. Lynch is president of James Lynch Communications. He worked on John McCain’s 2008 presidential campaign and was on the team helping former Starbucks CEO Howard Schultz explore a potential run for president.\n\nYou can read diverse opinions from our Board of Contributors and other writers on the Opinion front page, on Twitter @usatodayopinion and in our daily Opinion newsletter. To respond to a column, submit a comment to letters@usatoday.com.\n\nRead or Share this story: https://www.usatoday.com/story/opinion/2019/10/14/debate-2020-challengers-trump-change-impeachment-headlines-column/3963429002/", "description": "Donald Trump should break with tradition and debate his Republican primary challengers. He needs to make new headlines that aren't about impeachment.", "authors": ["James G. Lynch", "Opinion Contributor", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/13/USAT/43df2c68-7399-4511-bdac-e4d84c300bad-EPA_USA_ELECTIONS_FLORIDA_REPUBLICAN_DEBATE.JPG?crop=4040,2273,x0,y117&width=3200&height=1680&fit=bounds", "published_at": "2019-10-14"}