{"pub": "vice", "url": "https://news.vice.com/en_us/article/gyz3zx/mourning-turns-to-terror-as-bullets-fly-at-vigil-for-texas-homecoming-party-shooting-victim", "downloaded_at": "2019-10-29 00:18:15.601495+00:00", "title": "Bullets Started Flying at a Vigil for Man Shot and Killed at Homecoming Party the Night Before", "language": "en", "text": "Want the best of VICE News straight to your inbox? Sign up here.\n\nLess than 24 hours after a deadly shooting at a Texas college homecoming party, people attending a Sunday-night vigil for one of the victims were dodging more bullets.\n\nNo one was injured, but several vehicles were struck by bullets at the Dallas event to commemorate a victim of the previous night’s shooting at a huge party in Greenville, Texas, which left two dead and 12 injured. The shooter is still at large.\n\nThe Dallas Police Department said they got a call around 9 p.m. Sunday that a disturbance at a local park, where a vigil for 23-year-old shooting victim Kevin Berry Jr. was taking place, had escalated and gunfire broke out, according to the Dallas Morning News. Little is known so far about what exactly went down, or how the shooting at the vigil might be related to the shooting at the party the night before.\n\nPolice have yet to identify a suspect in the Sunday shooting or the Saturday night shooting, of which video posted to social media showed badly injured people and people screaming.\n\nAround midnight Saturday, at a party billed as part of homecoming celebrations for Texas A&M University-Commerce — a “Twerk or Treat” party, at a Greenville event space called The Party Venue — a gunman armed with a handgun shot what the sheriff believes to be a targeted victim and then opened fire on the over-capacity crowd.\n\nWith more than 750 people at the party, the scene quickly turned to chaos. Partygoers broke windows to get out of the venue, which is only supposed to be able to accommodate 500 people, according to the Dallas Morning News. In the aftermath, hats, abandoned single shoes, and Halloween masks littered the ground outside the venue.\n\nEveryone fled, including the shooter. He’s still at large, and authorities say they don’t have much information to go on, despite there having been hundreds of witnesses. They’ve identified him only as a lone male shooter. And the witnesses have so far been reluctant to talk to the cops.\n\n“I was told there's 750 people here approximately at the time that the shooting happened, but nobody wants to speak with us,” Hunt County Sheriff Chief Deputy Buddy Oxford told NBC News. ”We don't even have a vehicle description, we don't have a name, a nickname, we don't have nothing to go on to try to locate the shooter.”\n\nCover: Police officer on two-way radio. Credit: Getty Images", "description": "Police still don't have a suspect for either shooting.", "authors": [], "top_image": "https://video-images.vice.com/articles/5db705985038ed008c5f5406/lede/1572277255033-GettyImages-464415914.jpeg?crop=1xw:0.8467828900071891xh;center,center&resize=1200:*", "published_at": "2019-10-28"}