{"pub": "businessinsider", "url": "https://businessinsider.com/peter-borish-compares-investing-to-baseball-shares-top-trade-2019-10", "downloaded_at": "2019-10-19 11:39:44.160045+00:00", "title": "Legendary investor Peter Borish describes how effective investing is like being a successful baseball manager — and shares his top trade for an economy racked with record debt", "language": "en", "text": "Peter Borish, the chief strategist at Quad Group and cofounder of Tudor Investment Corporation, likens investing to managing a game of baseball. You have to know when you take your pitcher — or investment — out before something catastrophic happens.\n\nHe also thinks the megacap elite consisting of Amazon, Apple, Netflix, Alphabet, and Microsoft — which have led markets higher since the financial crisis — will not be the drivers of tomorrow's market.\n\nBorish also shares an \"interesting\" trade idea he sees developing because of the ever-growing issuance of government debt.\n\nClick here for more BI Prime stories.\n\nPeter Borish, the chief strategist at Quad Group, is an investor that generally flies under the radar.\n\nHe's probably most famous for cofounding Tudor Investment Corp. with the legendary investor Paul Tudor Jones in the 1980s. It was there that he played an integral role in minting Tudor a billionaire.\n\nBut his career stretches much further. He has also spent time at the Federal Reserve Bank of New York and was able to build a name for himself by calling the stock-market crash of 1987.\n\nBorish thinks about markets differently than most. He's inherently a contrarian. But the foundation for which he builds his strategy on is applicable to any investor.\n\n\"Investing, to a large extent, is a lot like being a baseball manager,\" he said on \"The Contrarian Investor Podcast.\" \"The art of managing is not that complicated in theory, which is: Just don't leave your pitcher in there one pitch too many.\"\n\nHe continued: \"You can't sit there and say, 'Just because this worked, it's going to continue to work.'\"\n\nBorish notes that investors are inherently susceptible to this fallacy. Just look at Japanese equities in the 1980s, tech stocks of the 1990s, or the housing market in the 2000s.\n\nInvestors extrapolated too far into the future, thinking these trends were going to continue indefinitely. As a result, they were destroyed when the exuberance wore off. After all, who wants to get out of a trade that's been ripping higher?\n\nRead more: Wall Street's biggest firms pay Raoul Pal $40,000 a year for his research. He explains why the market is heading for a negative-rate situation that could crush banks and roil pension funds.\n\nThat's why he thinks the likes of Google, Amazon, Microsoft, Apple, Netflix — stocks that have been leading markets higher since the financial crisis a decade ago — aren't going to be tomorrow's big winners.\n\n\"These stocks are mathematically impossible to compound at the same rate of speed over the next 10 years that they have over the prior 10 years,\" he said. \"Otherwise, they'd be the only stocks in the world.\"\n\nHe uses another sports analogy to shore up his thesis.\n\n\"If you're building a basketball team for the next 10 years, your first pick isn't LeBron James,\" he said. \"He was the best guy for the last 10 years.\"\n\nIt's Borish's contrarian way of thinking and foresight that leads him to believe an \"interesting\" trade is primed to deliver. And the genesis behind the allure lies within the record amounts of debt piling up in the US.\n\n\"For me, when I see this from a macro point of view, I think an interesting trade would be a bear steepening of the yield curve — where you buy the 10-year and sell the 30-year,\" he said. \"Particularly now that the administration is thinking of adding to the supply of longer dated bonds to fund this perpetual deficit.\"", "description": "Peter Borish thinks you have to manage your investments like you'd manage a baseball game: Know when to take out your best pitcher.", "authors": ["Christopher Competiello"], "top_image": "https://image.businessinsider.com/5da8a92d4af9097748213e33?width=1200&format=jpeg", "published_at": "2019-10-18"}