{"pub": "news24", "url": "https://sport24.co.za/Cricket/Proteas/maharaj-overcomes-pain-barrier-to-hit-maiden-50-20191012", "downloaded_at": "2019-10-12 15:12:32.162114+00:00", "title": "Maharaj overcomes pain barrier to hit maiden 50", "language": "en", "text": "Pune - South Africa's Keshav Maharaj battled through pain and held back from hitting out as he resisted India's drive for a decisive win in the second Test on Saturday.\n\nSCORECARD: SA v India, second Test\n\nThe tourists were eventually dismissed for 275, 127 runs away from avoiding the follow-on, but Maharaj earned praise for his courageous stand with Vernon Philander that held up India's march towards a victory that would seal the three match series.\n\nMaharaj, who made 72 with an injured shoulder, and Philander, unbeaten on 44, put on 109 for the ninth wicket to frustrate the Indian bowlers for 43.1 overs in Pune.\n\n\"It's (shoulder) very sore. Yesterday I dived on it so lot of bruising. But hopefully I'll be fine for the rest of the series,\" Maharaj, primarily a left-arm spinner, said.\n\n\"Vernon and I said to ourselves that we'll just get through to tea and see after that. Being a lower order batsman your fingers do itch to play a big shot but Vernon kept me in a good mind space.\n\n\"After a few pulls I felt normal (in the shoulder). It's better to be positive, because if you go into your shell a ball with your name will come along sooner or later.\"\n\nRavichandran Ashwin broke the stand by taking number 10 Maharaj in the final overs and then claimed last man Kagiso Rabada, for two, to wrap up the innings with figures of 4-69.\n\nIndia, who scored 601-5 declared, have until the start of play on Sunday to decide whether to enforce the follow-on. South Africa still trail India by 326 runs.\n\nThe Proteas, who resumed on 36-3, slipped to 162-8 after skipper Faf du Plessis fell for 64 to Ashwin's off spin.\n\nMaharaj, who injured his shoulder while fielding on Friday and went off the pitch for scans, came out to join Philander to make a last stand.\n\nMaharaj passed his previous Test best of 45 with a boundary off Ashwin and completed his fifty to an ovation from the crowd.\n\n\"I wanted to stay outside off stump to spin, I tried to stay leg side of the ball for (Ravindra) Jadeja,\" said Maharaj, who claimed his 100th Test wicket in the Indian innings.\n\n\"We saw (Mohammed) Shami got the ball to reverse, and the wicket is deteriorating, but the longer you bat, the easier it is.\"\n\nPhilander, a pace-bowling all-rounder, also played a patient innings. He stayed on for 192 balls before running out of partners.\n\nFast bowler Mohammed Shami struck early to remove night-watchman Anrich Nortje for three when he edged a delivery to Virat Kohli at fourth slip.\n\nTheunis de Bruyn was caught behind off Yadav for 30 as the tourists slipped to 53 for five.\n\nWicketkeeper-batsman Quinton de Kock put on a 75-run fourth wicket stand with du Plessis to offer some resistance before Ashwin's off spin bowled him for 31.\n\nKohli hit a career-best 254 not out to surpass Don Bradman's Test tally of 6,996 runs on Friday as India tightened the screws on the tourists.\n\nA victory for India, already one up in the three Tests, will see them beat the record of 10 straight home series wins they share with Australia.", "description": "South Africa's Keshav Maharaj battled through pain and held back from hitting out as he resisted India's drive for a decisive win.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7916/4f99509e1cbb43bf9ffa049765576ba8.jpg", "published_at": "2019-10-12"}