{"pub": "businessinsider", "url": "https://businessinsider.sg/i-tried-pizzas-hut-newest-crust-at-their-latest-open-kitchen-outlet-at-paya-lebar-heres-what-it-is-like", "downloaded_at": "2019-10-01 11:45:33.351015+00:00", "title": "I tried Pizza’s Hut newest crust at their latest open-kitchen outlet at Paya Lebar – here’s what it is like", "language": "en", "text": "Pizza Hut’s new open-kitchen concept at Paya Lebar and its brand new “Light x Airy” sourdough crust. Business Insider/Lamont Mark Smith\n\nIt has been 25 years after the stuffed crust. Pizza Hut has officially launched its latest crust innovation – “Light x Airy” – as well as its new fast-casual dining concept store at the Paya Lebar Quarter Mall.\n\nThe new sourdough crust will be available across all 24 outlets islandwide from Oct 7, and is priced like Pizza Hut’s normal crust. A regular will be priced at S$23.50, while the large will cost S$29.50. However, the crust will only be available to dine-in customers.\n\nAdditionally, there will be two new toppings available – the “Alfredo Prawn” and “Truffle Shuffle”, which both feature the “Light x Airy” crust and an alfredo base.\n\ncaption The new Alfredo Prawn (left) and the Truffle Shuffle (right) pizzas, with the new crust. source Business Insider/Lamont Mark Smith\n\nI thought that the new sourdough crust was not particularly sour, nor particularly special – but it was distinctively lighter and thinner than normal pizza crusts. The truffle was also not too overpowering.\n\nAside from its brand new crust, Pizza Hut also showed off its newest concept store – a fast-casual dining restaurant with an open kitchen – at Paya Lebar Quarter Mall.\n\ncaption The middle of the kitchen does not have a glass partition separating it from the dining area. source Business Insider/Lamont Mark Smith\n\nIt also featured a really nice view, overlooking the square below and the main road.\n\ncaption You can see quite far as the restaurant is located on the fourth floor of the mall. source Business Insider/Lamont Mark Smith\n\nA Pizza Hut statement revealed that this outlet in Paya Lebar Quarter Mall will be the first Pizza Hut store globally, to provide a bring-your-own-device feature in-store.\n\nThis means that diners will be able to order from their personal devices after scanning a QR code that is located at the side of each table.\n\ncaption Menu booklets and wait staff are still available should a customer prefer the traditional method instead. Psst, the spicy drumlets are still my favourite. source Business Insider/Lamont Mark Smith\n\nOnce you scan the QR code, you will be prompted to open the online menu on your device’s browser.\n\ncaption The online menu will display your table number, and you can select which category to order from. source Business Insider/Lamont Mark Smith\n\nPizza Hut is also launching an Express Lunch option – which costs $9.90 for a main course, soup, and drink – from Mondays to Fridays between 11am and 3pm.\n\nThe restaurant claims that its express lunch orders will be served within 15 minutes. This is in response to a 2017 study by DBS which showed that an average Singaporean in the Central-Business District spent 24 minutes daily queueing for lunch.\n\nJoyce Tan, senior director of marketing and food innovation at Pizza Hut, told Business Insider that this is a way for Pizza Hut to cater to the people who want a quick bite for lunch, but also do not want to perspire in a hawker centre.\n\nAll future outlets of Pizza Hut in Singapore will also feature this fast-casual dining concept with an open kitchen.\n\nRead Also:", "description": "Business Insider - Pizza Hut has a new open-kitchen concept at Paya Lebar and a brand new \"Light x Airy\" sourdough crust.. Read more at businessinsider.sg", "authors": ["Lamont Mark Smith"], "top_image": "https://static.businessinsider.sg/sites/2/2019/10/PH-testheader4.jpg", "published_at": "2019-10-01"}