{"pub": "yahoo", "url": "https://finance.yahoo.com/news/week-cannabis-vaping-crisis-q3-213520399.html", "downloaded_at": "2019-10-07 06:18:20.882529+00:00", "title": "The Week In Cannabis: The Vaping Crisis, Q3 Earnings On The Horizon & More", "language": "en", "text": "The cannabis industry continues to be affected by the vaping crisis, with the CDC reporting the number of deaths from a vaping-related illness increased to 18. The number of people affected by the illnesses increased to 1,080 in 48 states and the U.S. Virgin Islands.\n\nAmid the outbreak, more than 800 cannabis companies signed a letter to Congress, asking it to deschedule marijuana. The letter suggests that the vaping crisis can be addressed through strict federal regulations that are possible once cannabis is descheduled.\n\n“The cannabis sector has been in a terrible bear market for months and the vape crisis seems to have flushed out the last of the sellers. As we get data showing vape sales are beginning to slightly recover, we may have turned the corner on all the selling,” Debra Borchardt, CEO of Green Market Report, told Benzinga.\n\nWith third-quarter earnings season on the horizon, MKM Partners analyst William Kirk issued a note on outlining his expectations for Canadian cannabis producers. The analyst suggests that there won’t be a significant sales growth and profitability is also likely to disappoint.\n\nMKM expects Canopy Growth Corp (NYSE: CGC) to turn positive EBITDA by the first quarter of 2022 and sees Aurora Cannabis reporting positive figures in the first quarter of 2021. By comparison, the consensus is for Aurora and Canopy Growth to report positive EBITDA in the third quarter of 2020 and first quarter of 2021. On the other hand, Kirk aligns with the Street regarding Hexo Corp (NYSE: HEXO), expecting the company to turn to positive EBITDA by the second quarter of 2020.\n\nIf you want to get this news recap in your email inbox every week, please subscribe to https://tinyletter.com/javierhasse\n\nCannabis ETFs delivered moderate losses. Over the last five trading days:\n\n• The Horizons Marijuana Life Sciences Index ETF (OTC: HMLSF) (TSE:HMMJ) increased by 1.12%.\n\n• The ETFMG Alternative Harvest ETF (NYSE: MJ) lost 2.84%.\n\n• The AdvisorShares Pure Cannabis ETF (NYSE: YOLO) declined by 2.49%\n\n• The Cannabis ETF (NYSE: THCX) inched down by 1.06%.\n\n• The Amplify Seymour Cannabis ETF (NYSE: CNBS) edged up by 0.22%.\n\n• The SPDR S&P 500 ETF Trust (NYSE: SPY) fell by 0.55%\n\nMore News From The Week\n\nSeedo Corp. (OTC: SEDO), an Israeli agritech company providing fully automated cannabis growing technologies for home and commercial use, announced that it had appointed Jakob Ripshtein, the Former President of Aphria, to its Advisory Board.\n\nPLUS Products (CSE: PLUS) (OTCQX: PLPRF), a top edibles brand in California, announced the kick-off of a nationwide marketing campaign featuring the Company’s new 100% hemp CBD product. The new product line was recently launched in partnership with Casper, a leading direct-to-consumer sleep company, along with additional help from John Legend who will advocate for CBD on behalf of PLUS.\n\nCannabiniers, the premiere developer of global cannabis brands revolutionizing the industry with safe, smoke-free cannabis product, announced a partnership with Origin House’s Continuum, the company’s major California distribution division. This partnership grants Continuum sole rights to distribute Cannabiniers’ vastly popular product to over 500 dispensaries across the state of California, the world’s largest cannabis market.\n\n“The timing of this partnership couldn’t be better, and the state of the market couldn’t be stronger! For the past three years, we've tirelessly developed and build a portfolio of innovative products and brands that transcend the beverage market across dispensary and conventional retail environments. With an increased demand for socially acceptable cannabis products, our patent-pending portfolio of fast-onset and rapid dissipation beverages and transdermal topicals provide consumer and patients a range of smoke-free consumption options that will bring convenience and optionality to users seeking a safer and healthier cannabis experience,” Michael Hayford, Founder & CEO of Lighthouse Strategies (Parent co. of Cannabiniers) told Benzinga.\n\nNeptune Wellness Solutions announced it's partnering with International Flavors & Fragrances Inc. to co-develop hemp derived CBD products for the U.S. market. This move further expand Neptune’s efforts to accelerate its presence in the U.S. CBD market.\n\nStory continues", "description": "The cannabis industry continues to be affected by the vaping crisis, with the CDC reporting the number of deaths from a vaping-related illness increased to 18.  “The cannabis sector has been in a terrible bear market for months and the vape crisis seems to have flushed out the last of the sellers.  As", "authors": ["Alex Oleinic"], "top_image": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "published_at": "2019-10-06"}