{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/27/hospital-uses-music-therapy-to-reduce-sedation-for", "downloaded_at": "2019-10-27 11:58:51.345849+00:00", "title": "Hospital uses music therapy to reduce sedation for kids", "language": "en", "text": "MIAMI (AP) - It was early afternoon on the first day of October at the Holtz Children’s Hospital in Miami, and Elizabeth Foley’s room was quiet.\n\nAmy Foley, Elizabeth’s mom, leaned over her 2-year-old daughter’s crib-like hospital bed.\n\n“We’re gonna do some music,” she said. “And then you’re going to be in a great mood.”\n\nThe prospect of a “great mood” seemed unlikely at the time for the Foleys. Elizabeth suffers from a genetic condition called Alagille Syndrome that, in part, affects the functioning of the bile ducts in the liver. She was just waking up from anesthesia after a stress test on her heart for a potential liver transplant.\n\nBut Stephanie Epstein, the music therapist at the hospital has her methods, starting with songs from toddler-fan-favorite-films like “Frozen” and “Moana.” And then there’s the ocean drum, filled with small metallic beads that whoosh across the material to create soothing waves of sound.\n\nWithin a few minutes, Elizabeth was clinging to a toy maraca with one hand while using the other to pluck at the strings of Epstein’s three-quarter-sized guitar.\n\nEpstein, who started the music therapy program five years ago at Holtz - part of the UM Jackson Memorial Medical Center - chose the instrument, smaller than a standard guitar, because it is easier to hold while weaving between nurses, doctors and the type of droning and beeping machinery that surrounded Elizabeth’s bed.\n\nThat’s crucial for Epstein because she doesn’t just play to relax patients before and after treatment, as many music therapists do. Research has shown that music can reduce pain and anxiety in children during medical procedures, so Epstein also plays when it counts most.\n\nThat sometimes means doctors can use smaller doses of sedatives or even forego the drugs, which can be especially harsh on younger patients.\n\nNot having to sedate a child, Epstein says, also means saving time and money. The children don’t have to fast for 12 hours. There’s no need for an anesthesiologist. There are no drug side effects, and no need for intubation, when a plastic pipe is placed into the windpipe to make sure airways remain open.\n\n“It’s better for the patients and the staff,” Epstein said. “Just the overall mood of the room relaxes.”\n\nThe administration at Holtz Children’s Hospital is sold on the concept. Hamilton Clark, chief executive officer, said the music therapy program there is “an integral part of our care team.”\n\n“Children need specialized healthcare in every way, and we know that music therapy plays a big role in the healing process for our patients,” Clark said.\n\nFor Epstein, it’s more than just a job. She views being a music therapist as a privilege: developing real, personal relationships in the process. Epstein is in the room when pediatric patients might need encouragement to sit up or stand for the first time in weeks. She uses music to help push them through physical therapy and rehab.\n\n“I get to give them something positive to latch onto, to be able to help them express themselves, and give them a positive coping skill,” Epstein said. “I get to be the person that helps them feel like a kid again.”\n\nHalfway through the first song Epstein played in Elizabeth Foley’s room - “Let it Go” from the Disney film, “Frozen” - she paused, walking to the door to make sure a nurse didn’t need to come in and check on them. When she returned to Foley’s bedside and started playing again, the little girl smiled her first smile of the day.\n\nAfter Epstein left the room, Amy Foley, Elizabeth’s mom, said she’d been impressed by the staff at Holtz, but especially impressed by Epstein.\n\n“I’ve seen other music therapists at other hospitals,” said Foley, who traveled from Tampa in an ambulance with her daughter seeking treatment at Holtz. “I’ll just say she sets a very high bar.”\n\nThen, Foley added: “She soothes me, too.”\n\nThat’s by design. One of the benefits of music therapy, beyond reducing the need for sedation, is that it calms everyone in the room: patients, family members and even staff members.\n\nOne example was when Elizabeth Foley needed a “PICC line,” or a soft catheter tube that is inserted through a vein in the child’s arm, leg, or neck, and run to another vein to deliver medicine and nutrition.\n\nThe nurse warned Amy Foley that Elizabeth would likely scream during the procedure, Foley said, but then Epstein showed up with her guitar. Elizabeth was so quiet, Foley said, that other nurses were coming in to meet the girl who didn’t cry during the procedure.\n\nFor the Foley family, and the nurses and doctors in the room, the focus on music helped. People were even singing along as Epstein played, Foley said.\n\n“We know she’s going to have more surgeries in the future,” Foley said. “To limit the amount of anesthesia, that’s a big blessing for us.”\n\nMusic has long been a blessing for Epstein. At 32, she traces music back to her early childhood: starting with piano lessons, then voice lessons and eventually learning how to play the flute. Epstein said she always knew she wanted to do something with music, but she wasn’t sure what.\n\n“I knew I was very interested in psychology and counseling, so I started researching music and psychology and I found music therapy, which was really a perfect marriage between my two passions,” Epstein said.\n\nThat combination was once again the right mix when Epstein met 15-year-old Sophia Treadwell, who was admitted to Holtz in May after a diagnosis of leukemia.\n\nSophia, who plays piano, violin and guitar, said her first days in the hospital felt like living in a haze. All she could think about was what was happening with her health. But then the sophomore at Coral Reef Senior High School met Epstein, and the two started talking about music.\n\n“It brought my mood up,” Sophia said. “It took my mind off all the bad things that were happening.”\n\nHaving a music therapy program at Holtz has other benefits, too, that aren’t as easily quantified.\n\nToward the end of Sophia’s stay at the hospital, she and Epstein played a concert in front of the nurses’ station to celebrate her last round of chemotherapy.\n\nTy Treadwell, Sophia’s dad, said the music therapy program doesn’t just help the patients. It’s also a boon to the staff. He said he saw doctors, nurses and the hospital’s top administrators, including Clark, the CEO, with tears in their eyes during Sophia’s concert.\n\n“I think they were seeing, ‘Hey, we helped this child. This is what we did. This is how happy she is right now, that she’s performing for us,’” Treadwell said. “So she was kind of giving them the ‘treatment’ in that case.”\n\nEpstein, who lives in Cooper City, said her job is emotionally demanding - sometimes uplifting, other times, exhausting and sad. The hospital cares for some very sick children, she said. But Epstein says that being able to help others is a healing process for her, too.\n\n“If I’m having a rough day, sometimes I just want to just sit in my office and seclude myself,” Epstein said. “But the second that I get up and I get out there and I work with these incredible patients and families, automatically my day is better.”\n\nKnowing that patients and their families invite Epstein into their lives at a very vulnerable time, she said, puts things into perspective for her.\n\n“They open up their hearts and they let you in,” Epstein said. “You see the good, the bad and the ugly. And for someone to allow you into that space is something that I don’t take lightly at all.”\n\n___\n\nInformation from: The Miami Herald, http://www.herald.com\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "It was early afternoon on the first day of October at the Holtz Children's Hospital in Miami, and Elizabeth Foley's room was quiet.", "authors": ["The Washington Times Http", "Ben Conarck"], "top_image": "", "published_at": "2019-10-27"}