{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7529665/Beauty-expert-reveals-answers-nations-searched-skincare-questions.html", "downloaded_at": "2019-10-06 07:54:25.422274+00:00", "title": "Beauty expert reveals the answers to the nation's most searched-for skincare questions", "language": "en", "text": "A beauty expert has answered some of the country's most commonly ‘Googled’ skincare questions.\n\nDr Tiina Meder, from the UK, who is a dermatologist, cardiologist, and founder of Meder Beauty Science, has discussed the most popular topics that have left the nation switching on their laptops in search of answers.\n\nThese include whether Sudocrem really helps to clear acne, how you use a derma roller and how to get rid of stretch marks.\n\nSpeaking to FEMAIL, the expert has revealed all you need to know about the skincare questions you may have spent a lifetime pondering...\n\nDr Tiina Meder, from the UK, has given detailed answers to the nation's most Googled skincare questions. Pictured, stock image\n\nHOW TO GET RID OF STRETCH MARKS\n\nStretch marks happen when your body grows quickly, for example through growth spurts, pregnancy or weight gain.\n\nWhen the skin is quickly stretched, fractures in the collagen occur deep within the connected tissue of the dermis, resulting in the long, thin, rippled marks we have a love-hate relationship with.\n\nSometimes called stria, stretchmarks can be red and first, before turning in to a less noticeable silvery appearance.\n\nAlthough the underlying problem of the fractured collagen cannot be corrected by a cream, using one when the stretch marks are still red will help to speed up this colour change making them less noticeable.\n\nIf you have got residual stretch marks that aren't improving and the redness remains, you can consider a treatment such as IPL (intense pulse light) that will promote collagen and reduce redness.\n\nHOW TO MINIMISE PORES\n\nFirst of all, don’t try to minimise pores excessively, they are a part of the skin structure and we need them to function.\n\n“Pore-minimising” is mostly for customers with oily or at least combination skin. The excess of sebum, stress, smoking, and environmental pollution all contribute to expansion and deformation of the skin pores.\n\nWHAT ARE FRECKLES? Freckles are small brown spots on the skin, often in areas that receive high volumes of sun exposure. They form as a result of overproduction of melanin, the pigment that gives skin its colour. Freckles can appear on anyone that doesn’t protect themselves with SPF from UV rays. Protecting the skin from sunlight will not reduce the appearance of existing freckles, but it can prevent new freckles from forming. Freckles (ephelides) are always harmless, it’s inherited and unpreventable condition especially common in fair-skinned Celtic children. People with many ephelides have at least one copy of a variant MC1R gene, which is the same variant that causes red hair. Freckles in non-Caucasians are associated with a different variant of the gene. The pigment cells, melanocytes, produce more pigment than usual in ephelides. The pigment is packaged as melanosomes and distributed to surrounding keratinocytes. Ephelides increase in number following exposure to ultraviolet radiation in sunlight. Fair skin is prone to larger, sun-damage freckles called lentigines, as well as other signs of skin ageing including skin cancer.\n\nWhen pores get clogged, it creates a pile-up of oil and dead skin cells in the follicle.\n\nSoon, bacteria make their way to the blockage, and the growth in bacteria causes inflammation.\n\nOily skin is excessively shiny and may have large, dilated pores. So, the first step is a regular exfoliation using either enzyme peels, dermabrasion, or salicylic, glycolic or lactic acid-based peels, based on the skin type.\n\nThe second step is to control the sebum production by using cosmeceuticals based on salicylic acid or retinol.\n\nIt is also possible to use retinol alternatives, such as Avocutine-based products or toners and moisturisers rich in vitamin B3 (Niacinamide), Green Tea, Chamomille, Calendula officinalis, and other plants extracts.\n\nThe third and final step is pore reduction. Use astringent agents that have the ability to reduce pores, such as Agaric acid.\n\nIt is quite a rare ingredient as it is difficult to obtain, however it is very effective and helps to protect the skin from the air-pollution.\n\nMachine treatments can provide good results: d’Arsonval and microcurrents therapy have been successfully used for many years, but new treatments, such as RF-therapy or Fraxel non-ablative laser therapy, are very beneficial too.\n\nWHAT IS ACNE AND EFFECTIVE TREATMENT?\n\nThe gold standard of acne treatment is now a dermatological guideline based on severity of the acne condition.\n\nIt starts with acids-based skin care, then intensifies with retinol and derivatives, until the systemic use of retinol or/and antibiotics if needed. Nowadays a new concept of acne treatment is developing based on research into the skin microbiome.\n\nMachine-based therapy is also effective at treating acne as is largely used. IPL, photodynamic and laser therapy, and light (LED)-therapy help to obtain results easier and quicker.\n\nWHAT IS HYDROCORTISONE?\n\nHydrocortisone creams, ointments and lotions contain a type of medicine known as a corticosteroid or 'steroid' – that’s powerful hormones, produced by the human body (to be precise, by adrenal glands) on the daily basis.\n\nDr Tiina Meder (pictured), from the UK, is a dermatologist, cardiologist, and founder of Meder Beauty Science\n\nTypically used to treat swelling, itching and irritation, products containing hydrocortisone come in different strengths and can help with skin problems such as eczema, psoriasis and contact dermatitis.\n\nIf you buy hydrocortisone cream from a pharmacy or shop, don't use it for longer than a week and never put hydrocortisone skin creams on your face without your doctor’s approval as it can make some skin conditions such as impetigo, rosacea and acne worse.\n\nHOW TO GET RID OF WRINKLES?\n\nFine lines are natural part of growing older but if your skin is prematurely aging and your confidence is being affected, you can take steps to lessen their appearance.\n\nYour options – topicals, injectables or lasers- but it depends on your budget, patience and pain tolerance.\n\nHOW TO USE A DERMA ROLLER\n\nDerma-rolling, a form of micro-needling, involves using a mini wheel covered with hundreds of tiny needles to gently prick the face.\n\nWHAT IS ROSACEA? Rosacea is a widespread but misunderstood condition relating to the hyper-responsiveness of blood vessels on the face. It tends to affect the cheeks, forehead, chin and nose, and is characterised by persistent redness caused by dilated blood vessels, small bumps and pus-filled spots similar to acne. There are a variety of triggers that may make rosacea worse - including alcohol, exercise, high and low temperatures, hot drinks, spicy foods and sun exposure. A combination of oral antibiotics and skincare with anti-inflammatory properties will help treat the condition.\n\nA professional treatment delivered by an experienced aesthetician can help promote collagen synthesis to improve skin texture.\n\nHowever, the depth of needle required to create the micro pathways that stimulate this type of wound healing response isn’t possible with an at-home derma roller. Indeed, the risks far outweigh any perceived benefit.\n\nThey can spread bacteria if not cleaned carefully, and aggravate eczema, psoriasis and acne.\n\nDerma-rolling doesn’t mix well with a retinol regime and people with darker skin tones may experience more hyper-pigmentation after derma-rolling.\n\nThe evidence that at-home derma-rolling allows for better absorption of other products is questionable.\n\nIt’s safer and simpler to use a physical or chemical exfoliant once or twice a week and leave the tools to the pros.\n\nIS SUDOCREM GOOD FOR ACNE?\n\nNot at all! There are many effective acne treatments and Sudocrem is not one of them. It is a great product for other reasons; however, it is not a registered anti-acne product.\n\nHOW TO SOOTHE CHICKEN POX\n\nChickenpox (known medically as varicella) is caused by a virus called the varicella-zoster virus.\n\nIt's spread quickly and easily from someone who is infected but is a mild, common illness that most children catch at some point.\n\nOver 90% of adults are immune to the condition because they've had it before. It causes a rash of red, itchy spots that turn into fluid-filled blisters which can appear all over the face and body.\n\nThere is no specific treatment for chickenpox, but there are pharmacy remedies that can alleviate symptoms. These include paracetamol to relieve fever, and calamine lotion and cooling gels to ease the itching.\n\nHOW TO CURE SUNBURN\n\nYou can’t \"cure\" sunburn, but if you recognise the signs of excessive sun exposure you can minimise the discomfort associated with it.\n\nIf you’ve neglected the SPF and accidentally burned your skin in the sun, cover up the affected areas and stay in the shade.\n\nDr Tiina Meder also told how recognising the signs of excessive sun exposure can minimise the discomfort associated with it. Pictured, stock image\n\nCool your skin with a tepid shower or damp towel and apply an after-sun cream to soothe and reduce inflamed skin.\n\nLook out for ingredients such as aloe vera, which is packed with the amino acids essential for helping skin repair itself, and niacinamide - a relatively new beauty ingredient responsible for repairing cellular damage caused by sun exposure.\n\nLastly, drink plenty of water to prevent dehydration and take paracetamol or ibuprofen for any pain.\n\nCAN YOU TAN THROUGH FAKE TAN?\n\nIf you apply \"fake\", self-tan products, it's important to remember that they don’t offer any protection from the sun, therefore you will naturally tan in the same way you would normally.\n\nTo reduce the risk of sun damage it is essential that to apply sunscreen over the top of any fake tan, with the correct level of SPF for your skin type.\n\nExcessive exposure to UVA and UVB rays can lead to skin pigmentation, premature aging and wrinkling (photoaging), and suppression of the immune system.\n\nIt is also important to note that self-tanning lotions based on DHA (dihydroxyacetone) can make a skin more sensitive to sun exposure. So, it is better to avoid self-tan products in the week leading up to sun exposure.", "description": "Dr Tiina Meder, from the UK, has answered the most commonly 'Googled' skincare questions. These include how to get rid of stretch marks and how to minimise pours.", "authors": ["Chloe Morgan For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/02/15/19210610-0-image-a-26_1570027858668.jpg", "published_at": "2019-10-06"}