{"pub": "guardian", "url": "https://theguardian.com/politics/live/2019/oct/30/lords-to-debate-boris-johnsons-early-election-bill-after-brexit-deadlock-live", "downloaded_at": "2019-10-30 06:54:04.795504+00:00", "title": "Lords to debate Boris Johnson's early election bill after Brexit deadlock – live", "language": "en", "text": "06:41\n\nConservatives’ manifesto being written by fracking lobbyist\n\nThe Conservatives’ election manifesto is being written by a lobbyist for the fracking company Cuadrilla and major internet companies such as Amazon and Facebook, raising concerns about whether her paying clients could influence the party’s policies.\n\nRachel Wolf is drawing up the Conservatives’ platform for the general election while continuing to work as a partner at Public First, a business which lobbies ministers on behalf of the shale gas industry. Cuadrilla is facing a battle to keep its fracking projects on track in the UK at a time when public opinion is moving against the extraction of shale gas, with the Labour party threatening to ban the practice altogether.\n\nHer company also represents the Internet Association, the trade body for major tech companies including Uber, Twitter, Facebook, Google, Airbnb, Microsoft and Amazon. The organisation is attempting to influence the government’s policies on online harms, the regulation of social media and taxes on digital companies – all of which are likely to feature in some form in the Conservative manifesto.\n\nThere is no suggestion Wolf is breaking any rules by writing the Conservative manifesto while running a lobbying company representing major businesses, given her company makes regular declarations of its clients to the public lobbying registrar in line with current legal requirements.\n\nHowever, Francis Ingham, of the Public Relations and Communications Association, which represents many leading PR and lobbying agencies, but not Public First, said: “Communications professionals have a duty to avoid conflicts of interests. There is never an excuse. The PRCA code – to which all members are bound – is explicit in this regard.”\n\nJon Trickett, the shadow cabinet minister with responsibility for the lobbying industry, said it was an “outrage to democracy that the frackers, the tax avoiders and the zero-hour exploiters will have the biggest say when it comes to Tory policy”. He pledged that a Labour government would strengthen lobbying regulations if it won the next general election.\n\nFull story is here:", "description": "Prime minister was able to secure support for early election on fourth attempt, which would see country head to polls on 12 December", "authors": ["Kate Lyons", "Jim Waterson"], "top_image": "https://i.guim.co.uk/img/media/7938781c558f20447f8c70b5f2c41c3f41624134/0_108_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=dcea0f7deca8eb4c6d29e2363d16c857", "published_at": "2019-10-30"}