{"pub": "nymag", "url": "https://thecut.com/2019/09/i-think-about-this-a-lot-ryan-and-rachel-making-out.html", "downloaded_at": "2019-10-01 00:19:53.267551+00:00", "title": "I Think About This a Lot: Ryan Gosling and Rachel McAdams Kissing at a Diner", "language": "en", "text": "Photo: Getty Images\n\nI Think About This a Lot is a series dedicated to private memes: images, videos, and other random trivia we are doomed to play forever on a loop in our minds.﻿\n\nIn the summer of 2008, well after the first of their many breakups and amidst an on-again period, rumors began to circulate that Rachel McAdams and Ryan Gosling were on! the! rocks! The pair had appeared on so many grocery-store tabloid covers that this information had to be taken for gospel.\n\nBut then, in one of the hottest weeks of the year in Toronto, the pair were photographed outside a since-closed restaurant near McAdams’s home, doing something that, for what is possibly the first time in history, could accurately be described as “canoodling.”\n\nHe was wearing a black tee and dark pants; she a hastily tucked white button-down, one shoulder gently snaking downward to reveal a Jane Austen–level peek of collarbone. Both appeared … rumpled. In other words, they were sexily disheveled and a little bit dirty. In other words, they had clearly wandered over to the diner after a few days off spent fucking.\n\nGazing at these photos feels like walking into my college apartment and smelling the specific humidity of fresh sex, knowing my roommate just hooked up with her stoner boyfriend on the couch. The images capture a moment that is brazen in its carefree, candid nature.\n\nThere they are, interrupting their own meal to lean closer and closer, grinning in each other’s faces with the kind of intensity that reads as sheer romance. Then there’s another shot of them, sipping their straws in unison, rarely breaking eye contact, like an audition for a live-action, uncensored Lady and the Tramp.\n\nAnd yet another burst of photos reveals that Rachel spent much of the breakfast in Ryan’s lap, shoes off, bare feet dangling in the summer air, his hand comfortably resting below her waist, both slathering each other’s faces in equal amounts of feathery-light pecks, lip-chews, and smacks. It feels obvious to me from these photos that Ryan likely used Rachel’s toothbrush before they left for their outing, if they even bothered to brush at all.\n\nBut then, then, the moment that almost makes me feel like I should cover my eyes: Rachel hand-feeding Ryan a pastry of some kind, both chewing in harmony, their hunger ceaseless. The two of them smooch away each other’s worries. Her brow is unfurrowed, her hairband is loosened. They look like the rest of the world doesn’t exist to them and, frankly, I wish I had pearls I could clutch!\n\nHad I simply been in too long a dry spell, or was this actually the hottest PDA session ever captured by the paparazzi? It felt so intimate, and it made me believe in true love and great sex like no Nicholas Sparks film had before or since. This wasn’t just some random candid moment between a couple, but a page from a real-life notebook of love.\n\nIt is a truth firmly established that Ryan and Rachel were and continued to be after this errant moment one of the more private couples in Hollywood, further enchanting this memory. It was unclear when they were together and when they weren’t. Except for this literally steamy weekend, so entrenched in love and lust were they that the rest of the world and its cameras were all but forgotten.", "description": "I think about these pictures of Ryan Gosling and Rachel McAdams a lot. They are pure unalloyed romance.", "authors": ["Sadaf Ahsan"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/25/ITATAL-rya-gosling-rachel-mcadams.w1200.h630.jpg", "published_at": "2019-09-30"}