{"pub": "businessinsider", "url": "https://businessinsider.com/insurtechs-ai-data-insurance-coverage-vc-funding-ai-data-risk-2019-9", "downloaded_at": "2019-09-23 11:55:13.434104+00:00", "title": "Buzzy insurtechs have raised $3 billion already this year thanks to their use of AI and big data. But the tech could eventually change how insurance policies are written, pricing out the riskiest cust", "language": "en", "text": "Innovation can lead to efficiencies that benefit the masses. But some worry the implementation of new tech in the insurance space may end up meaning those most in need of help get left behind.\n\nStartups blending insurance and technology have been boasting that their use of a wider range of data and artificial intelligence-based tools is changing the way the entire industry works, with many hinting it could eventually lead to better underwriting and pricing.\n\nAnd while that may help the expansion of insurance products into more niche areas, some are sounding the alarm about the possibility that pricing will become too sophisticated. Coverage that is more tailored to customers' needs could result in those carrying the highest risk being unable to afford what would be extremely high premiums, some people worry.\n\nIsabelle Santenac, global insurance leader for consultant EY, told Business Insider that understanding how riskier customers might get priced out of coverage as insurance providers push for more customized policies is one of her top concerns.\n\nUsing data and AI to generate more precise risk assessments of customers is a double-edged sword, said Santenac, who leads a team of more than 12,000 people working with insurers on improving how they run their business.\n\n\"There is a benefit to really tailor the product for the clients, but then the counterpart is that you pool less and less. So how do you cope with that?\" Santenac said. \"How can you propose the right pricing, the right product to avoid that a lot of people can't pay anymore at the hospital when they are 75 years old, because nobody will protect them anymore?\"\n\nRead more: An exec at $771 billion life insurance giant MassMutual explains how it's teaming up with digital upstarts to disrupt itself\n\nIn our conversations with industry insiders, either at insurtechs, consultancies or AI-based companies, they all agreed that how AI and big data could be used to underwrite and price insurance policies is a critical question for the space.\n\nInsurtech use of data and AI is attracting VC attention\n\nInsurance may have a reputation as a relatively staid industry, and different kinds of insurers can be subject to hefty regulations. But the field of blending insurance with new technology has exploded in recent years thanks to an influx of startups and venture funding into the space. Legacy insurers are also making their own investments or partnerships.\n\nIn the first half of 2019, VCs poured $2.9 billion into startups that are looking to put a tech spin on the insurance industry, according to data from CB Insights. That's nearly 20% of the total for all VC-backed fintech deals tracked by the data over the same period. CB Insights counts companies selling insurance digitally as well as those selling data analytics and software for insurers and reinsurers under the insurtech umbrella.\n\nSoftbank led the three biggest insurtech deals in the second quarter: $300 million in Series D funding for Lemonade, $205 million in Series E funding for Collective Health, and a $152 million Series F round for Policy Bazaar.\n\nLemonade and Hippo, which are focused on homeowners and, for the former, renters insurance, both recently reached unicorn status after their latest fundraising rounds.\n\nCurrently, most startups use artificial intelligence to manage claims, handle customer interactions and analyze marketing efforts. But they have their sights set on using AI in more underwriting and pricing.\n\n\"The world of insurance is of big numbers, which means it is averages,\" Assaf Wand, Hippo CEO and cofounder, told Business Insider. \"It will move to big data, which is basically pricing risk more correctly.\"\n\nIn a blog post in May, John Peters, Lemonade's chief underwriting officer, hinted at the firm looking to use more of the data it is collecting when it comes to pricing.\n\n\"Interacting with our customers directly and digitally means we know them really well, even if we've never met them face-to-face,\" Peters wrote. \"That knowledge is translated to a 'risk score' that accurately predicts future loss ratios, and can be used across the organization, from marketing to acquisition to policy management and claims. It has not yet impacted our pricing sophistication, but that day will come.\"\n\nAnd a report by Juniper Research in August found that AI-underwritten insurance premiums will surpass $20 billion by 2024, up from just $1.3 billion in 2019.\n\n\"Client wants to have a tailored product with the right pricing,\" EY's Santenac said. \"That will be more and more possible because of your personal data, and so the carrier will know exactly your behavior, et cetera. But the more you do that, the less you collectively price.\"\n\nAuto insurance is one area that has already seen the introduction of more customized pricing policies. Metromile, which has raised $293 million to date, offers pay-per-mile coverage.\n\nBecause auto insurance is so competitive and relatively less regulated than other areas, such as health insurance, it makes for a good use case to see the impact data and AI has on the underwriting process, Dan Preston, Metromile's chief executive, told Business Insider.\n\nStill, Preston said there remains a good deal of uncertainty regarding regulators' comfort level with the use of more sophisticated data science in underwriting.\n\n\"This question of morally what is an acceptable thing to price on, I think, will have to be an ongoing question,\" Preston said. \"I don't think it's necessarily about AI, but about the type of data we use.\"\n\nOther see a path for more AI and data in underwriting\n\nNot everyone, however, is concerned about the increased use of data science when it comes to how policies are written and priced. Junta Nakai, global industry leader at AI company Databricks, told Business Insider that the space needs to evolve.\n\nNakai pointed to the fact health insurance providers essentially haven't changed over the past few decades from the handful of questions they typically ask customers, such as \"Are you a smoker?\"\n\n\"They're using a giant hammer to sculpt policies that are very nuanced and unique in nature,\" he said. \"I think underwriting policies better and understanding risks better benefit everybody.\"\n\nHippos' Wand cited insuring houses impacted by the California wildfires as an example of the benefits that come from more data science in underwriting and pricing.\n\nWhile many carriers resisted offering coverage to homes in high-risk areas impacted by wild fires, Wand and Mike Gulla, Hippo's director of underwriting, told Business Insider the startup used data like satellite imagery to understand the risks the area posed and price accordingly.\n\nAs opposed to labeling all the homes in one region with the same amount of risk, as is typically the case, taking into consideration the fact a property might be close to a lake, and therefore a bit safer, was possible.\n\nWand and Gulla said the rates were still high, but pointed to the fact that they were still able to offer options to customers as opposed avoiding them completely like others. Wand said Hippo also declined to take a commission on those policies beyond what was being charged by their reinsurer in an effort to reduce the price further.\n\n\"Let's go at this with a scalpel approach instead of a sledgehammer approach where we're not going to renew 20,000 policy holders,\" Gulla said. \"While it may be at a higher cost, it is still at least offering them the ability to insure their property where it is not pushing all of the burden away from insurance, but it is also not putting all of the insurance burden there as well.\"\n\nRegulators play a key role\n\nOne critical piece that still needs to be fully understood is how accepting regulators will be of all these new techniques. Insurance providers still need to file and get approval from regulators for any plans they have to price customers differently using AI and big data.\n\n\"The fact I can do something doesn't necessarily mean I can use it for anything in insurance,\" Wand said.\n\nRule makers have started taking a look at how AI could impact their space. This summer, the National Association of Insurance Commissioners formed a working group to look at the tech and issues around consumer privacy and market dynamics.\n\n\"AI technology can transform how the insurance industry operates and it's our job to help ensure consumers remain protected while allowing carriers, producers and other industry vendors to utilize cutting edge technology like AI to create and sell better products that consumers want to purchase to limit their risk,\" said Iowa Insurance Commissioner Doug Ommen in a recent panel discussion on AI's impact on insurance.\n\nThe fact that insurance companies are regulated at the state, not federal, level complicates things. While the NAIC can offer support and help set standards, differences can still exist in individual states approaches to what is and isn't acceptable.\n\nA spokesperson for the NAIC declined to comment beyond citing the brief the organization had published on AI.\n\nIn the meantime, policy providers will continue to consider the boundaries they are willing to push in order to get the most accurate risk assessment of those looking for coverage.\n\n\"You could technically look at what rare disease support group [potential customers] belong to on Facebook,\" Databricks' Nakai said. \"Is that legal? Maybe. Is that ethical? Probably not. These are decisions that all these insurance companies have to make.\"", "description": "We talked to Hippo and Metromile execs. Startups are eyeing customizing policies via data and AI —that some worry could be costly for risky customers.", "authors": ["Dan Defrancesco"], "top_image": "https://amp.businessinsider.com/images/5d8247812e22af6fd927c192-1536-768.jpg", "published_at": "2019-09-23"}