{"pub": "reuters", "url": "https://reuters.com/article/us-usa-election-sanders-taxes/bernie-sanders-calls-for-higher-taxes-on-companies-with-wide-pay-gaps-idUSKBN1WF1D3", "downloaded_at": "2019-10-01 00:22:13.216144+00:00", "title": "Bernie Sanders calls for higher taxes on companies with wide pay gaps", "language": "en", "text": "FILE PHOTO: Democratic Presidential candidate U.S. Senator Bernie Sanders addresses attendees during the AFL-CIO Workers Presidential Summit in Philadelphia, Pennsylvania, U.S., September 17, 2019. REUTERS/Mark Makela/File Photo\n\n(Reuters) - U.S. presidential candidate Bernie Sanders on Monday laid out a plan to hike taxes on big companies with wide pay gaps between executives and rank-and-file workers.\n\nSanders’ plan would raise tax rates on companies where the chief executive officer or highest-paid employee earns more than 50 times the median worker salary. The independent U.S. Senator from Vermont is competing for the Democratic nomination to challenge Republican President Donald Trump in the November 2020 election.\n\nThe proposal comes amid increased scrutiny of income inequality and top executives’ pay as a contributing factor. A Securities and Exchange Commission rule adopted in 2015 now requires companies disclose CEO pay ratios.\n\n“The American people are sick and tired of corporate CEOs who now make 300 times more than their average employees, while they give themselves huge bonuses and cut back on the healthcare and pension benefits of their employees,” Sanders said in a statement.\n\nIf Sanders’ plan had been in place last year, JPMorganChase (JPM.N) would have paid up to $991.6 million more in taxes, Sanders’ campaign said in the statement. Walmart Inc (WMT.N) would have paid up to $793.8 million more and McDonald’s Corp (MCD.N) would have paid up to $110.9 million more.\n\nThe proposal would apply to corporations with annual revenues above $100 million and would hike taxes on companies in increments based on the company’s compensation ratio. A ratio above 50 but not more than 100 would increase a company’s corporate taxes by 0.5 percentage points. A company with a ratio above 500 would see its tax rate rise by 5 percentage points.\n\nThe campaign estimated the plan would raise $150 billion over the next decade, and said the funds would be used to write off medical debt owed by Americans.\n\nSanders is one of 19 candidates running for the Democratic nomination. Most polls rank him among the strongest contenders, along with former Vice President Joe Biden and U.S. Senator Elizabeth Warren of Massachusetts.", "description": "U.S. presidential candidate Bernie Sanders on Monday laid out a plan to hike taxes on big companies with wide pay gaps between executives and rank-and-file workers.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190930&t=2&i=1435526088&w=1200&r=LYNXMPEF8T0T7", "published_at": "2019-09-30"}