{"pub": "cbs", "url": "https://cbsnews.com/news/dive-boat-fire-ntsb-preliminary-report-all-crewmembers-sleeping-during-deadly-fire-southern-california-2019-09-12", "downloaded_at": "2019-09-13 00:57:28.067774+00:00", "published_at": "2019-09-12", "title": "NTSB preliminary report says all crewmembers were asleep during deadly California boat fire", "language": "en", "text": "All six crewmembers were asleep aboard a scuba diving boat off the Southern California coast when a fire broke out in the middle of the night, killing 34 people who were trapped in a bunkroom below the main deck, federal investigators announced Thursday. Boats like the Conception, which caught fire around 3 a.m. on September 2 and subsequently sank, are required to have a crewmember keep watch at night.\n\nThis comes as the 75-foot vessel's charred remains were raised from the ocean floor Thursday and will be taken to a hangar where investigators will carefully examine what's left of it.\n\nThe remains of Conception was lifted onto a salvage barge Thursday, September 12, 2019. The remains of the vessel will be examined by federal authorities in hopes of learning more about the boat fire which broke out September 2. CBS Los Angeles\n\nThe National Transportation Safety Board (NTSB) has been investigating the tragedy and released a two-page preliminary report that said five crew members were sleeping in their quarters on the second deck and another below deck when the fire broke out. The NTSB said the Coast Guard declared the accident a major marine casualty.\n\n\"Initial interviews of three crewmembers revealed that no mechanical or electrical issues were reported,\" according to the NTSB report. \"At the time of the fire, five crewmembers were asleep in berths behind the wheelhouse, and one crewmember was asleep in the bunkroom.\"\n\nNTSB's report said \"a crewmember sleeping in the wheelhouse berths was awakened by a noise and got up to investigate.\" That crewmember alerted the other crew and that's when the captain radioed a distress message to the Coast Guard.\n\nThe crew also described their efforts to get to the passengers below, as flames engulfed the boat. The report recounts a harrowing scene: \"Unable to use the aft ladder, which was on fire, the crewmembers jumped down to the main deck (one crewmember broke his leg in the process) and tried to access the salon and galley compartment, which was fully engulfed by fire at the aft end and by thick smoke in the forward end, through a forward window. Unable to open the window and overwhelmed by smoke, the crew jumped overboard.\"\n\nOfficials said Thursday that all victims have been identified and their families notified.\n\nThe NTSB report comes as investigators seek to determine the cause and try to recover the wreckage of the Conception from the bottom of the sea amid an ongoing criminal probe conducted by the FBI, Coast Guard and the U.S. Attorney's Office. Any findings by NTSB are not law enforcement findings and the criminal probe may impact NTSB's ability to interview the remaining survivors.\n\nA diving vessel burns off the coast of Southern California on September 2, 2019. Santa Barbara County Fire Department\n\nDivers on Wednesday recovered the remains of the last victim — one of dozens who died of smoke inhalation as they were trapped below a raging fire.\n\nThe Coast Guard issued additional safety recommendations in the wake of the tragedy, such as limiting the unsupervised charging of lithium-ion batteries and the use of power strips and extension cords.\n\nThe recommendations also suggest owners and operators of vessels review emergency duties with the crew, identify emergency escapes, check all firefighting and lifesaving equipment onboard and look at the condition of passenger accommodation spaces for \"unsafe practices or other hazardous arrangements.\"\n\nCoast Guard records show the Conception passed its two most recent inspections with no safety violations. Previous customers said the company that owns the vessel, Truth Aquatics, and the captains of its three boats, were very safety conscious.\n\nJames Hall, a former NTSB chairman, told The Associated Press a preliminary report is generally a summary of the early findings that relies on interviews, inspection documents and other records and a review of current maritime rules and regulations.\n\nJonathon Vigliotti and Kris Van Cleave contributed to this report.", "description": "The two-page preliminary report​ said five crew members were sleeping in their quarters on the second deck and another below deck when a fire broke out on a scuba diving boat", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/09/05/8fb30de8-a2ec-49ea-9bae-c3d51e45365d/thumbnail/1200x630/906a6a172b3ee7fd9f348ca8ff8a968f/0905-caboatfire-kvc-1927657-640x360.jpg"}