{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/24/payton-leutner-slender-man-stabbing-victim-breaks-", "downloaded_at": "2019-10-24 23:53:13.565363+00:00", "title": "'Slender Man' victim breaks silence on 'unforgivable' attack", "language": "en", "text": "MILWAUKEE — A Wisconsin girl who was lured into the woods by two friends and stabbed 19 times in an effort to please a fictional horror character called Slender Man said she’s come to terms with aspects of the attack but still sleeps with broken scissors “just in case.”\n\nIn her first interview about the 2014 attack, which is set to air Friday, Payton Leutner told ABC News that despite her lingering trauma, she has “come to accept all of the scars that I have.”\n\n“It’s just a part of me,” she said.\n\nLeutner was 12 when two of her 12-year-old friends, Morgan Geyser and Anissa Weier, lured her from a sleepover to a nearby wooded park in the Milwaukee suburb of Waukesha, investigators said. In the ABC interview, Leutner recalled how, before the stabbing, Weier told her to lay down on the ground and cover herself with sticks and leaves to hide, as part of what Leutner believed to be a game of hide-and-seek.\n\n“But it was really just a trick to get me down there,” Leutner said.\n\nWith Leutner on the ground, Geyser stabbed her 19 times before she and Weier left Leutner for dead. Leutner said she eventually got up, grabbed trees for support, and made her way to a nearby road where a bicyclist found her and called for help.\n\nThe case drew widespread attention because of how young the girls were, how vicious the attack was and because the two attackers said they did it because they believed Slender Man would otherwise hurt them and their families.\n\nGeyser and Weier were charged as adults and eventually pleaded guilty, with Geyser receiving a harsher sentence because she was the one who did the actual stabbing, according to prosecutors. Geyser was ordered to spend 40 years in a mental institution. Weier was committed to a mental health facility for 25 years.\n\nLeutner told ABC News that charging her attackers as adults was the right decision.\n\n“If they had stolen a candy bar, sure that’s a child. But you tried to kill somebody. That’s an adult crime,” she said.\n\nLeutner said she doesn’t want to see or talk to Geyser and Weier again, and that what Geyser did was “probably unforgivable.”\n\nShe said she wasn’t surprised when she heard about Geyser’s motive “because she believed so hard in this thing that she would do anything for it.” Still, she said “it was a little shocking to me to see that they had this big, huge plan that they had been working on for months.”\n\nEven though she doesn’t want to talk to her attackers again, Leutner surprised herself when asked what she would say to Geyser if she did speak to her.\n\n“I would probably, initially thank her,” Leutner said. “I would say, ‘Just because of what she did, I have the life I have now. I really, really like it and I have a plan. I didn’t have a plan when I was 12, and now I do because of everything that I went through.’”\n\nLeutner, now 17, is a high school senior and plans to attend college in 2020. She wants to pursue a medical career, which she said is a goal inspired by what happened to her.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Payton Leutner, a Wisconsin girl who was lured into the woods by two friends and stabbed 19 times in an effort to please a fictional horror character called Slender Man said she's come to terms with aspects of the attack but still sleeps with broken scissors \"just in case.\"", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/24/Girls_Stabbing_Plot_Survivor_Speaks_86022.jpg-830c2_c0-0-1928-1125_s1200x700.jpg?8a28e7e211b0516aef14600c691b5f02536759ce", "published_at": "2019-10-24"}