{"pub": "fox", "url": "https://foxnews.com/media/andy-biggs-schiff-censure-republicans-defense", "downloaded_at": "2019-10-22 13:29:35.654915+00:00", "title": "Rep. Andy Biggs defends now-curbed motion to censure Adam Schiff", "language": "en", "text": "The American people need to know congressional Republicans will continue to defend President Trump against Democrats' actions, according to Rep. Andy Biggs, R-Ariz.\n\nBiggs said Monday on \"The Ingraham Angle\" the now-tabled motion to censure House Intelligence Committee Chairman Adam Schiff, D-Calif., was a key way to show that.\n\n\"I happen to know that there's already an ethics referral out there for Mr. Schiff,\" Biggs said.\n\n\"That's kind of a closed-door thing. The American people need to know that we're fighting for the president.\n\nLAWMAKER LEADING CHARGE TO CENSURE ADAM SCHIFF SAYS HE'S ENGINEERING A 'TOTAL POLITICAL HIT JOB' ON TRUMP\n\n\"The president needs to see that, the American people need to see that, and the Republicans need to see that.\"\n\nThe Democratic-led House voted to table, or set aside, the resolution to censure Schiff for his handling of the impeachment inquiry into President Trump on Monday evening. The vote was 218 to 185 to table the resolution. All Democrats voted to table the censure resolution, with all Republicans voting against tabling.\n\nIn addition, Rep. Justin Amash, I-Mich., who left the Republican Party earlier this year, voted to table the resolution.\n\nOn \"The Ingraham Angle,\" Rep. Lee Zeldin, R-N.Y. echoed Biggs' defense of the motion.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"When Adam Schiff is cherry-picking leaks, when he's withholding facts, when he's outright lying -- let the American ppl know that,\" he said.\n\nAnother Republican who co-sponsored the motion, Rep. Debbie Lesko of Arizona, said Schiff needs to be held accountable for what she considered to be the Democratic lawmaker working to engineer a \"political hit job\" Trump.\n\n\"I imagine that the Democrats are going to kill the bill to censure Adam Schiff because this whole thing is a political hit job against the president,\" she said.\n\n\"Adam Schiff... has for two years said he had proof that the president colluded with Russians -- that turned out to be false in the Mueller report. Then, made up... what President Trump said to the Ukrainian president, trying to deceive the American public.\"\n\nFox News' Gregg Re contributed to this report.", "description": "The American people need to know congressional Republicans will continue to defend President Trump against Democrats' actions, according to Rep. Andy Biggs, R-Ariz.", "authors": ["Charles Creitz"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/05/Adam-Schiff-AP.jpg", "published_at": "2019-10-22"}