{"pub": "fox", "url": "https://foxbusiness.com/markets/opioid-settlement-talks-between-drug-makers-and-u-s-counties-falter", "downloaded_at": "2019-10-19 11:01:35.218507+00:00", "title": "Opioid settlement talks falter; trial is set to begin Monday", "language": "en", "text": "A landmark trial regarding the opioid epidemic is set to begin on Monday after eleventh-hour talks between drug makers and distributors and a coalition of U.S. towns and counties hit a snag on Friday, according to multiple reports from Reuters, the New York Times and Washington Post.\n\nContinue Reading Below\n\nPaul Hanly, an attorney involved with the case, said: \"we are fully prepared to open before the jury at 9 a.m. on Monday.”\n\nCities, towns, counties and Native American tribes that had sued the makers and distributors of opioid painkillers could not come to an agreement after revealing they were ``not on the same page'' as the state attorneys general, who are also suing the drug companies stated Hanley.\n\nAccording to The New York Times, \"Under discussion was a deal worth nearly $50 billion in cash and addiction treatment medicine and services. It would require the three distributors to pay $18 billion over 18 years.\" The defendant distributors in the case are AmerisourceBergen Corp, Cardinal Health Inc and McKesson Corp.\n\nThe three-drug giants are accused of supplying the majority of opiate painkillers that have led to an estimated 400,000 deaths in the United States from 1999 to 2017 according to U.S.government statistics.\n\nExecutives from smaller drug companies and distributors such as Henry Schein Inc. and the pharmacy chain Walgreen Boots Aliance Inc. were also in attendance during Friday’s contentious talks.\n\nThe companies will now be forced to defend their actions during Monday’s trial amidst accusations of fueling the opioid crisis that left countless Americans addicted or dead.\n\nMeanwhile, OxyContin maker Purdue Pharma is no longer part of the Ohio trial after declaring bankruptcy last month.\n\nIf a settlement cannot be reached, a “test trial” will be held in Ohio on Monday would proceed as scheduled, which gives both parties an opportunity to gauge a jury's reaction to the accusations in an effort to better shape a settlement based off of all the available litigation.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "Trial is set to begin in Ohio on Monday after last-ditch talks to reach and resolve a potential multibillion-dollar settlement faltered on Friday.", "authors": ["Matthew Mcnulty"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/08/0/0/iStock-1004659870.jpg?ve=1&tl=1", "published_at": "2019-10-19"}