{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/boris-johnsons-brexit-deal-hangs-20644318", "downloaded_at": "2019-10-18 01:05:00.658033+00:00", "title": "Boris Johnson's Brexit deal hangs on a dozen votes in dramatic Saturday showdown", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nBoris Johnson’s Brexit deal will hang on less than a dozen votes in a dramatic Commons showdown on Saturday.\n\nThe Prime Minister faces an uphill struggle to get his last-minute pact with Brussels past rebellious MPs.\n\nHe will spend the next 24 hours desperately trying to persuade ex-Tory rebels, hardline Brexiteers and wavering Labour Leave MPs to help him finally get Brexit over the line.\n\nMr Johnson pleaded: “We’ve been at this now, as I say, for three and a half years. It hasn’t always been an easy experience for the UK. It’s been long, it’s been painful, it’s been divisive.\n\n“And now is the moment for us as a country to come together. Now is the moment for our parliamentarians to come together and get this thing done.”\n\nBut his deal was slammed by Shadow Brexit Secretary Keir Starmer who claimed it was worse than Theresa May ’s thrice-defeated plan.\n\nHe warned it paved the way for a decade of deregulation, gave the PM licence to slash workers’ rights, environmental standards and consumer protections.\n\n(Image: OLIVIER HOSLET/EPA-EFE/REX)\n\n“The Johnson deal makes it easier for a Tory government to cut rights and standards. Labour will not support a flawed Brexit deal that harms jobs, rights and living standards. This deal will unquestionably do that,” he blasted.\n\nMr Johnson flew home from Brussels last night after defying expectation and finally securing an 11th hour agreement with the EU at a crunch summit.\n\nBut as the PM sent up white smoke the hardline Northern Irish DUP dramatically scuppered his hopes, announcing they would vote against the deal “as it stands”.\n\nWestminster leader Nigel Dodds turned his guns on the PM, saying he was “too eager by far to get a deal at any cost” and his plan “drives a coach and horses” through the Good Friday Agreement.\n\nDUP insiders insisted they would stand firm despite speculation that they could be holding out for a massive cash bung for the province to secure their votes.\n\nIt leaves the PM facing a high stakes gamble at the Super Saturday clash - the first time the Commons has sat at a weekend in 37 years - by trying to get his plan through on the back of the votes of Tory Brexiteers and Labour Leave MPs.\n\n(Image: AFP via Getty Images)\n\nHe will offer MPs two votes - on the Government’s Brexit plan and on leaving without a deal - in a bid to force their hands.\n\nBut before he pleads with Parliament to support him he will launch a frantic round of calls to cross-party MPs and hold one-on-one meetings in his Commons office.\n\nMr Johnson already has around 260 votes in the bag, and needs up to 60 more to get his deal over the line, depending on abstentions.\n\nHe will be hoping to keep all the MPs who voted for Theresa May’s deal last time on board, as well many of the 28 so-called “Spartan” Brexiteers who rejected the email last time round.\n\nSeveral - including hardliners such as Priti Patel and Theresa Villiers - are expected to back it having been promoted to the Cabinet and other ministerial jobs.\n\nBut Tory Bernard Jenkin warned that the DUP were the “canary in the mine” for the ERG of Tory MPs - although around ten have privately admitted they want a ladder to climb down.\n\n(Image: WILL OLIVER/EPA-EFE/REX)\n\nLeading Brexiteer rebels including Steve Baker, Owen Paterson and Andrew Bridgen were among those who did not immediately rule out backing the plan - saying they wanted to examine the legal text before making their minds up.\n\nThe group, who have previously followed the lead of the DUP, will meet tomorrow morning in Parliament to decide whether to support the PM’s plan.\n\nBut Mr Johnson will also have to win over a handful of Labour MPs who represent Leave areas, many of whom are facing the biggest decision of their political career.\n\nThere are 19 who have indicated to the EU that they could be willing to vote for a deal if it contained sufficient assurances on protecting workers’ rights, environmental standards and giving Parliament a say on the future relationship.\n\nFour Labour MPs, plus outgoing Labour backbencher John Mann, voted for the deal last time.\n\n(Image: AFP/Getty Images)\n\nSeveral others have privately told the Mirror they are still undecided and want to spend the next 24 hours reading the deal on offer and talking with colleagues.\n\nAlthough many of the MPs originally backed Remain, they are currently wrestling with their consciences over whether to vote for their party - including local Labour supporters - or their constituencies as a whole that voted to Leave.\n\nOne Labour source told the Mirror: “We think it will definitely go through even without Arlene Foster. We think we’ve got enough votes. We need it resolved before an election”.\n\nBut another MP admitted: “I’m really struggling with this. I just don’t trust Boris Johnson to deliver on his promises on workers’ rights, despite what he says publicly and No 10 is telling us privately. I’m not sure my colleagues will go for it”.\n\nThey remain worried about losing the Labour whip, despite private assurances from Jeremy Corbyn that that’s “not the way we do things” in the party, but also about losing the election.\n\nA further group of 21 expelled Tory rebels - kicked out of the party for trying to block a no deal Brexit - are currently split on whether to back an agreement.\n\n(Image: REUTERS)\n\nMr Johnson hinted in Brussels that he would be making “further announcements on that in due course” amid suggestions some could be persuaded if they had the whip restored.\n\nThey were meeting with Tory whips and No 10 officials yesterday to discuss their support.\n\nOf the original group, Sam Gyimah has since defected to the Lib Dems while three others - Justine Greening, Dominic Grieve and Guto Bebb - will vote against because they want a second referendum.\n\nMost of the rest would probably back a deal to avoid crashing out, but several - including ex-Cabinet ministers Philip Hammond and David Gauke - fear the deal is harder than they might want.\n\nBut with former minister Amber Rudd, who quit in solidarity with her colleagues, and independent Nick Boles, Mr Johnson could pick up 19 votes from ex-Tory MPs.\n\nThe PM will also have to win over his younger brother Jo, who quit his Cabinet saying he was “torn between family and national interest”.\n\nThe SNP and Lib Dems also confirmed their 54 MPs would vote against the deal - while the Brexit Party’s Nigel Farage said the UK would “never be able to properly break free” from the EU if it signed up to the deal - and he would rather have an extension and election instead.\n\n(Image: OLIVIER HOSLET/EPA-EFE/REX)\n\nMr Johnson - who dined on scallops with pumpkin mousse, sauerkraut soup, roast veal and figs in puff pastry with other EU leaders before jetting home from Brussels last night - insisted he was “confident” his deal would get through Parliament.\n\nHe asked EU leaders to take any extension off the table to focus MPs’ minds with a stark choice between his deal or no deal - even though under the Benn Act he would be forced to ask for an extension.\n\nEuropean Commission chief Jean-Claude Juncker ruled out any delay - but only in the event the deal passes. “We have a deal so why should we have a prolongation?”\n\nEU insiders confirmed that the other 27 nations would be prepared to delay Brexit further if MP reject the PM’s plans tomorrow.\n\nLater, Mr Juncker added that he believed the 48% of Brits who voted Remain were right, while European Council president Donald Tusk expressed his “sadness” at the UK’s exit and said “our door will always be open” if it wants to return to the bloc.", "description": "The PM faces a frantic 24 hours trying to persuade rebels, Brexiteers and Labour leavers to back his plan", "authors": ["Pippa Crerar", "Image", "Olivier Hoslet Epa-Efe Rex", "Afp Via Getty Images", "Will Oliver Epa-Efe Rex", "Afp Getty Images", "Reuters"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20644291.ece/ALTERNATES/s1200/0_EU-Brexit-summit-Brussels-Belgium-17-Oct-2019.jpg", "published_at": "2019-10-17"}