{"pub": "cbs", "url": "https://cbsnews.com/news/bronx-subway-accident-commuters-save-girl-dad-jumps-with-her-in-front-of-subway-train-nyc-2019-09-24", "downloaded_at": "2019-09-25 04:35:23.803155+00:00", "title": "Dramatic video shows 5-year-old girl being rescued after father jumps with her in front of NYC subway", "language": "en", "text": "A 5-year-old girl was rescued after her father dragged her with him and jumped in front of New York City subway train Monday, CBS New York reports. Video shows good Samaritans reaching for the child and pulling her out safely.\n\nAccording to the NYPD, the 45-year-old man was holding his daughter and leaped onto the tracks as the train pulled into a station in the Bronx. The man was killed and the girl was injured.\n\nThanks to some alert commuters, the girl was saved from underneath the train. Jairo Torres grabbed the little girl by the wrist and pulled her out of the tracks.\n\n\"I never think about anything,\" Torres told CBS New York. \"I just care about saving the life of the baby.\"\n\nCell phone video shows the child emerging from under the train scraped and bruised, but alive.\n\nTorres says the girl's father was talking on the phone when he suddenly jumped onto the tracks with the child. While most everybody else watched in horror, Torres jumped down to the tracks and saw the man was killed instantly. But then he saw the little girl was moving.\n\n\"She says 'What happened to my daddy?'\" he said. \"I said 'Don't look at your daddy. Come to me. Crawl like a puppy.'\"\n\nThe girl was saved because she fell flat in between the tracks and stayed there. Torres then placed her safely on the platform.\n\nWitnesses are calling Torres a hero, but he says he just had to help get the little girl to safety. \"I didn't do it because people call me a hero. I do it because of the baby. Because in my heart, I feel the baby is still alive. And the I'm all right. The baby is still alive,\" he said.\n\nThe Metropolitan Transit Authority, which runs New York City's transit system, called the incident a \"tragedy,\" adding that their thoughts are with the family members.\n\nThe girl's mother, Niurka Caraballo, met the child at the hospital. The girl returned home Monday evening, suffering some scrapes and bruises.\n\n\"My little girl is in perfect condition thanks to God and the angels that protected her,\" Caraballo said. \"Those living angels with my little girl. Thank you, thank you.\"", "description": "\"I just care about saving the life of the baby\" said a good Samaritan who saved the child", "authors": ["Christopher Brito"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/09/24/98c17dcb-0ef1-4736-a6ca-51be3c259b52/thumbnail/1200x630/8056fdad741ef5eefb06c3a052325dda/screen-shot-2019-09-24-at-9-02-23-am.png", "published_at": "2019-09-24"}