{"pub": "vice", "url": "https://vice.com/en_asia/article/mbmbjv/people-are-baring-their-souls-to-this-vr-therapist-because-it-feels-safer-than-real-life", "downloaded_at": "2019-09-10 07:43:08.293409+00:00", "title": "People Are Baring Their Souls to This VR Therapist Because It Feels Safer Than Real Life", "language": "en", "text": "This article originally appeared on VICE News.\n\nImagine Dr. Phil, but in virtual reality, and with the constant risk of being harassed by a mob of Thomas the Tank Engines with Nic Cage faces. That'll give you some idea of what it’s like to be Syrmor.\n\nThe Toronto native has become sort of an in-house talk therapist on VR Chat, a free game where you log in, choose an avatar, and drop into a virtual world to chat with people across the globe. It’s almost completely unmoderated, which can make for some interesting, and occasionally terrifying, interactions.\n\nSyrmor picked up VR Chat in early 2018 out of curiosity and started recording the things he saw and uploading the results to YouTube. At first, his videos were focused on the bizarre, and he had a hand in propelling the viral (and arguably racist) “Ugandan Knuckles” meme into the mainstream.\n\nBut one day, Syrmor stumbled into a VR conversation with a drunk man (who was using an anime girl avatar) who started crying about how wonderful life is.\n\n“It was like it was the most human and … memorable conversation I had in VR chat up until that point,” Syrmor said in an interview with VICE News.\n\nSince then, Syrmor’s channel has been a surreal peek into the deepest and darkest thoughts of complete strangers, spoken through avatars: A cute bird talking about being in the Korean military and mourning his brother’s death, a Kermit talking about being bullied at school, a tall mushroom talking about what he wants his funeral to be like when he dies of ALS.\n\nThe comment section of his YouTube channel, now at over half a million subscribers, is overflowing with people who are surprised at how much Syrmor’s videos are able to show them about other people’s lives.\n\nVICE News took a tour through virtual reality with Syrmor to see what it’s like to have cartoon pigs tell you their darkest secrets.", "description": "The \"Dr. Phil\" of Virtual Reality helps cartoon mushrooms talk about dying", "authors": [], "top_image": "https://video-images.vice.com/articles/5d72997dd412b700085a3bea/lede/1567791633687-PKG_SEG4569_DR_PHIL_OF_VR_090619_1230_CD_MASTER-COLOR01_00_19_21Still008.jpeg?crop=1xw:1xh;center,center&resize=1200:*", "published_at": "2019-09-10"}