{"pub": "yahoo", "title": "British police urged to assist New York investigators with Epstein case", "url": "https://news.yahoo.com/british-police-urged-assist-york-163635528.html", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:15:54.575235+00:00", "text": "Protestors outside court in New York on July 8, when Jeffrey Epstein was arraigned. He died a month later. - Getty Images\n\nBritish police should assist the New York investigators with their inquiry into Jeffrey Epstein’s sex trafficking network, a source close to one of his victims has said.\n\nNew York authorities have repeatedly said that they will continue investigating whether he had co-conspirators, and will not let the case die with the disgraced financier.\n\nEpstein, 66, died on August 10 from what a coroner ruled was suicide, while awaiting trial in a Manhattan jail.\n\nNew York prosecutors are now turning their attention to any co-conspirators – among them Ghislaine Maxwell, the British heiress, and Sarah Kellen, another Epstein employee.\n\nTwo sources close to the investigation told The New York Times on Friday they were looking into the activities of Haley Robson, now 33, who told police in a 2009 deposition how she was paid to bring young girls to Epstein in Florida.\n\nHaley Robson, now 33, said in a 2009 deposition that she had been paid to recruit girls for Epstein More\n\nAsked if the British police should assist the New York prosecutors, the source replied: \"They should\".\n\nEpstein owned homes in New York, Paris and New Mexico, and spent much of his time on the island he owned in the Caribbean.\n\nBut his globe-trotting extended to the United Kingdom, where in June 2000 he was among 600 guests at Windsor Castle to celebrate four Royal birthdays, with “the dance of the decades”.\n\nIn December 2000 he joined Prince Andrew and Miss Maxwell at the Queen’s Sandringham estate, and in early 2001 he was in London for a night out with Prince Andrew, Miss Maxwell and Virginia Roberts-Giuffre.\n\nJeffrey Epstein and Ghislaine Maxwell, photographed at Sandringham in December 2000 More\n\nMrs Roberts-Giuffre claims that she was forced to have sex with the prince after their night out. He has vehemently denied her claims.\n\nAll the allegations against the Duke were struck from the court record in 2015 after being described as \"immaterial and impertinent\" by a judge.\n\nNow British police are being asked whether they intend to assist the New York prosecutors with their case. New York police refused to comment on their ongoing investigation.\n\nLast week detectives at the Metropolitan Police revealed they have “revisited” the decision not to investigate Epstein’s London links, but said their choice \"remains entirely appropriate\".\n\nThe Met has previously received an allegation of non-recent trafficking for sexual exploitation but had closed the matter after deciding that the case would not progress to a full investigation.", "description": "British police should assist the New York investigators with their inquiry into Jeffrey Epstein’s sex trafficking network, a source close to one of his victims has said. New York authorities have repeatedly said that they will continue investigating whether he had co-conspirators, and will not let the", "authors": ["Harriet Alexander"], "top_image": "https://s.yimg.com/uu/api/res/1.2/VE_mQVPDiQosWcDV13cyVg--~B/aD0xNTYzO3c9MjUwMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_258/bd30c5682fd35fed17ad4af2493f31ed"}