{"pub": "yahoo", "url": "https://news.yahoo.com/trump-reportedly-asking-suggestions-might-235700562.html", "downloaded_at": "2019-10-22 14:08:13.091550+00:00", "title": "Trump reportedly asking for suggestions on who might replace Mick Mulvaney", "language": "en", "text": "President Trump may soon have a brand new acting chief of staff.\n\nOver the last few days, Trump has been chatting with allies about who might be able to replace current acting Chief of Staff Mick Mulvaney, two people close to the White House told Reuters. Mulvaney stepped in to the job in January, after John Kelly resigned.\n\nTrump isn't happy with how Mulvaney dealt with the fallout from his now-reversed decision to host next year's G7 at his own Miami resort, Reuters says, or how Mulvaney publicly admitted last week that Trump withheld military aid from Ukraine in order to get Kyiv to investigate a conspiracy theory about the 2016 presidential election. He's also reportedly angry that Mulvaney pushed to bring former Rep. Trey Gowdy (R-S.C.) onto Trump's outside legal team, despite the fact that lobbying rules prevent Gowdy from joining until January.\n\n\"The president expressed some concern after Mick's difficult week,\" one person told Reuters. Two people who have been suggested to take Mulvaney's place have previously turned down the position: Trump's son-in-law and senior adviser Jared Kushner and White House counselor Kellyanne Conway. Another name being floated around is Matthew Whitaker; a Trump supporter, he served as acting attorney general before William Barr's confirmation.", "description": "President Trump may soon have a brand new acting chief of staff.Over the last few days, Trump has been chatting with allies about who might be able to replace current acting Chief of Staff Mick Mulvaney, two people close to the White House told Reuters. Mulvaney stepped in to the job in January, after", "authors": ["Catherine Garcia"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-21"}