{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/im-celebrity-star-harry-redknapp-20565872", "downloaded_at": "2019-10-16 23:15:21.636816+00:00", "title": "I'm A Celebrity star Harry Redknapp says WAGatha Christie is publicity stunt", "language": "en", "text": "Get the biggest I'm a Celebrity stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nKing of the I'm A Celebrity jungle and football-world legend Harry Redknapp has claimed that Coleen Rooney and Rebekah Vardy's ongoing feud has given them the publicity \"they like.\"\n\nHarry, 72, commented on the current WAGatha Christie case that has seen Coleen and Rebekah lock horns over the former's allegation that the latter has been leaking her stories to the press.\n\nColeen, wife of Wayne Rooney, slammed Rebekah for allegedly telling journalists about the stories she posted on her private Instagram page.\n\nNow Harry claims that the resulting publicity is something they both enjoy.\n\nHarry told The Mirror Online: \"They seem to be getting plenty of publicity. I suppose that's what they like, really.\"\n\n(Image: PA)\n\n(Image: PA)\n\nEarlier he slammed the scandal as something that wouldn't have mattered in his day.\n\nHe said: \"When I was in football, it was only the footballers we used to read about.\n\n\"We played football and it was the footballers. We didn't have WAGs or whatever they're called now. They weren't around in my day.\"\n\nHarry added that it's still just the players who draw his attention.\n\n(Image: ITV/REX/Shutterstock)\n\n\"I'm only interested in reading about Jamie Vardy or Wayne Rooney,\" he revealed, \"I'm not interested in what their wives are doing, to be truthful.\"\n\nHarry won the hearts of I'm A Celeb fans last year - and was crowned King of the Jungle.\n\nHe also formed a close bond with runner-up Emily Atack.\n\nFans swooned over his cute relationship with wife Sandra, who he missed dearly during his time in the Aussie jungle.\n\nHe laid bare to camp mates: \"She's my life, you know?\n\n\"We just get on so well. I can never wait to see her.\"\n\nDuring his football career, he played for Tottenham and West Ham in the late 50s and 60s. When he became a manager, he took on roles at West Ham, Tottenham, Southampton, Birmingham City and Portsmouth, who he led to victory in the 2008 FA cup.\n\nHarry Redknapp was speaking at a McDonald's Fun Football Session where he helped deliver the 2,000,000th hour of the Fun Football programme. To sign up for a free session near you head to mcdonalds.co.uk/funfootball.", "description": "EXCLUSIVE: Harry said that Coleen Rooney and Rebekah Vardy's feud has given them both the publicity that they wanted", "authors": ["Will Twigger", "Image", "Pa Wire", "Pa", "Itv Rex Shutterstock"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20565914.ece/ALTERNATES/s1200/2_AFC-Bournemouth-v-Manchester-City-Premier-League-Vitality-Stadium.jpg", "published_at": "2019-10-16"}