{"pub": "bbc", "url": "https://bbc.co.uk/news/world-us-canada-49587881", "downloaded_at": "2019-09-07 13:37:52.839377+00:00", "title": "Demi Lovato posts 'biggest fear' image of cellulite", "language": "en", "text": "Image copyright Demi Lovato/Instagram Image caption Demi Lovato told her followers in the Instagram post that she is proud of her body\n\nPop singer Demi Lovato has posted an unedited image of herself showing off her cellulite, telling her millions of followers it was her \"biggest fear\".\n\nThe 27-year-old said the image was \"cellulit\" adding she was tired of \"being ashamed\" of her body and admitting that previous pictures had been edited.\n\n\"I want this new chapter in my life to be about being authentic to who I am rather than trying to meet someone else's standards.\n\n\"So here's me, unashamed, unafraid and proud to own a body that has fought through so much and will continue to amaze me when I hopefully give birth one day.\"\n\nThe unedited image appears to have been taken at the same time as similar ones Lovato posted in May this year while on holiday in Bora Bora, French Polynesia.\n\nThe popularity of the new picture has already far surpassed the 4.1 million likes the image of her in the same location wearing the same bikini garnered, with more than 7.1 million fans so far showing their support.\n\nHer photo prompted her fans to share their images of cellulite with her too - which she also included in her Instagram story.\n\nMari, 20, who posts as @lovatolight, was one of those who responded.\n\nShe told the BBC: \"When I saw she posted my picture and said she was proud of me, all I did was cry. She is such a strong person and that meant a lot. I had that picture but I had never posted it before because I was really insecure about my body. When Demi posted hers I felt really inspired by her courage and decided to post mine too.\"\n\nCellulite is a condition where the skin has a dimpled and lumpy appearance. It affects 90% of all women at some point in their lives yet is often airbrushed from pictures or not shown at all.\n\nImage copyright Demi Lovato Image caption Demi Lovato updated her Instagram story with a response to the reaction her initial picture had\n\nFellow celebrities have expressed support for Lovato's post too.\n\nComedian Amy Schumer added Demi's photo to her own Instagram story stating \"@ddlovato is the truth\" while model Ashley Graham wrote: \"I love Demi\".\n\nThe singer took a short break from the platform in July this year after facing abuse.\n\nAs well as working on new tracks in the studio and appearing as a recurring character in the television show Will and Grace, the star is also working on a film for Netflix called Eurovision.\n\nProduced by Dhruti Shah, BBC UGC", "description": "The pop singer and actress told fans she was tired of being \"ashamed\" of her body.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/2E44/production/_108644811_d_grab.jpg", "published_at": "2019-09-06"}