{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/23/gop-diplomats-claim-trump-leveraged-ukraine-aid-collapsed-destroyed-at-hearing", "downloaded_at": "2019-10-24 02:28:40.929988+00:00", "title": "GOP: Diplomat's Claim Trump Leveraged Ukraine Aid 'Destroyed'", "language": "en", "text": "Some Republican lawmakers revealed that a top U.S. diplomat’s claim that President Donald Trump conditioned aid to Ukraine on the country investigating Joe Biden “collapsed” and were ultimately “destroyed” when he was questioned during his closed-door deposition Tuesday.\n\nGOP lawmakers are demanding Rep. Adam Schiff (D-CA), the leader of the impeachment probe, release the full transcripts of all depositions, including the one given by Bill Taylor, the acting ambassador to Ukraine, on Tuesday.\n\nIn his opening remarks, Taylor claimed that Trump made U.S. aid to Ukraine contingent upon the president of the Eastern European country publicly announcing an investigation into Biden.\n\nHouse Minority Leader Kevin McCarthy (R-CA), however, told Fox News his fellow Republica Rep. John Ratcliffe from Texas “destroyed” Taylor’s claim when he questioned the ambassador during his deposition.\n\nRatcliffe is a member of the House Intelligence Committee. The Democrat-led House Committees on Oversight and Reform, Intelligence, and Foreign Affairs are conducting the impeachment inquiry.\n\n“In 90 seconds, we had John Ratcliffe destroy Taylor’s whole argument,” McCarthy declared.\n\nRatcliffe told Fox News nothing “worthy of impeachment” came to light during Taylor’s deposition.\n\nEchoing McCarthy’s assertion that Taylor’s claims fell apart during the hearing, Rep. Lee Zeldin, a member of the House Foreign Affairs Committee who witnessed the ambassador’s testimony, wrote on Twitter:\n\nSpent another entire day in Schiff’s super-secret bunker in the Capitol basement for [Amb.] Taylor’s [deposition]. This transcript should be released ASAP along [with] all of the other transcripts. Much of his leaked opening statement collapsed, but Schiff keeps the public in the dark on that!\n\nSpent another entire day in Schiff’s super secret bunker in the Capitol basement for Amb Taylor’s depo. This transcript should be released ASAP along w ALL of the other transcripts. Much of his leaked opening statement collapsed, but Schiff keeps the public in the dark on that!👎 — Lee Zeldin (@RepLeeZeldin) October 23, 2019\n\nRep. Mark Meadows (R-NC), a member of the House Committee on Oversight and Reform who also witnessed Taylor’s testimony, added:\n\nThe leaks out of today’s witness [Taylor] interview have been laughably overblown and don’t tell the full story Still no evidence of quid pro quo. Much of the statement and hearsay allegations didn’t hold up against any real scrutiny. The full transcript should be released immediately.\n\nThe leaks out of today’s witness interview have been laughably overblown and don’t tell the full story Still no evidence of quid pro quo. Much of the statement and hearsay allegations didn’t hold up against any real scrutiny. The FULL transcript should be released immediately — Mark Meadows (@RepMarkMeadows) October 23, 2019\n\nDespite Republican assertions that Taylor’s claims “collapsed” during the hearing, Democrat lawmakers have called Taylor’s opening statement “damning,” “devastating,” “explosive,” and “disturbing.”\n\nRatcliffe’s questioning “was an important moment in the hearing,” McCarthy indicated but stressed that Schiff is not allowing lawmakers to speak about the proceedings.\n\n“Schiff won’t let us talk about what happened,” the House minority leader proclaimed, referring to Taylor’s deposition behind-closed-doors. “There is no quid pro quo.”\n\nRepublicans have blasted the House Democrats pursuing the impeachment inquiry for cherry-picking and mischaracterizing testimony. Schiff’s refusal to open the depositions to the public is forcing reporters to produce stories based on second-hand information.\n\nDemocrats have been releasing bits and pieces of testimony to fuel their impeachment agenda. Some written remarks prepared for impeachment probe depositions have made their way to the public.\n\nSchiff vowed to hold public hearings on the impeachment inquiry and release all the transcripts but refused to say when.", "description": "Republican lawmakers said a top U.S. diplomat's claim that Trump conditioned aid to Ukraine on the country investigating Joe Biden collapsed.", "authors": ["Edwin Mora"], "top_image": "https://media.breitbart.com/media/2019/10/Ambassador-Bill-Taylor-640x335.jpg", "published_at": "2019-10-23"}