{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-hongkong-protests-shooting-reax/this-means-war-anger-and-division-at-school-of-student-shot-by-hong-kong-police-idUKKBN1WH140", "downloaded_at": "2019-10-02 12:52:53.770798+00:00", "published_at": "2019-10-02", "title": "'This means war': anger and division at school of student shot by Hong Kong police", "language": "en", "text": "HONG KONG (Reuters) - Before he was battling police on the front lines of Hong Kong’s democracy movement, Tony Tsang, 18, was best known to his peers as a school vice-captain, organising events for fellow students, friends said on Wednesday.\n\nRiot police clash with anti-government protesters during a demonstration in Sha Tin district, on China's National Day in Hong Kong, China October 1, 2019. Picture taken October 1, 2019. REUTERS/Jorge Silva\n\nThey were speaking a day after the teenager was shot in the chest at point-blank range as he fought an officer with a metal pipe in Tsuen Wan district during some of the most violent clashes in Hong Kong since protests escalated in mid-June.\n\nTsang is stable in hospital where he is under arrest.\n\nWhat started as protests over a now-withdrawn extradition bill that would have allowed people to be sent to mainland China for trial have evolved into calls for greater democracy, among other demands.\n\nSpeaking at a news conference held under the shade of a tree at the school where Tsang studies, current and former students, wearing masks to disguise their identities, described him as a gifted student and said his shooting had only fuelled their determination.\n\n“Tony has always been a role model to the junior school students,” said one student who gave his name only as Wong.\n\n“The anti-extradition movement that has started this year gave him renewed purpose ... He often said he would rather die than be arrested.”\n\nAnother student urged the government to fulfil the five demands of the movement, which include an independent investigation into alleged police brutality.\n\n“If you do not hear our voices now, we will ensure the new government that succeeds you will avenge every single atrocity you have committed against us,” the student said.\n\n“This means war.”\n\nThe shooting has shocked residents of the leafy neighbourhood in the north of the city and exposed how young many of those on the front lines of the protests are.\n\nFormer Hong Kong leader Leung Chun-ying, in a letter to the school, demanded it expel Tsang and that the principal resign.\n\nThe student representatives said they had met the principal of the school who had promised the teenager would not be expelled but declined to take a stance on what they described as escalating police brutality.\n\nSELF-DEFENCE\n\nPolice have said the officer who fired the live shot was under serious threat and acted in self-defence in accordance with official guidelines.\n\nRepresentatives of the school could not be immediately reached for comment.\n\n“We didn’t get a good response from them,” said Alan, a former student in his twenties, who said he was in the meeting with school authorities.\n\n“They are trying to say something which is irrelevant to our questions: ‘Violence is not correct. China is our mother even if she did something wrong’.”\n\nAs the students spoke, dozens of primary schoolchildren shouted slogans of the pro-democracy movement: “Revive Hong Kong” and “Revolution of our time”.\n\nBut later, the group and members of the media were pelted with eggs by residents as a drone hovered overhead.\n\nOther residents said they supported the students, despite the violence.\n\n“I am heart-broken,” said Cheung, 30, a mother of young children.\n\n“The kids are just expressing their demands. Even if they take out a stick they are just trying to protect themselves, they are not aiming to hurt anyone. But the police is trying to take his life away.”\n\nStanding outside the school gates, two former students, also masked, said many of those actively involved in the protests were teenagers, and some as young as 12.\n\nOne of Tsang’s classmates, 17-year-old Cheung, said they would not be deterred by the shooting.\n\n“Our generation is fighting for the next generation’s future, so we are forced to risk our lives to fight for Hong Kong,” he said.", "description": "Before he was battling police on the front lines of Hong Kong's democracy movement, Tony Tsang, 18, was best known to his peers as a school vice-captain, organising events for fellow students, friends said on Wednesday.", "authors": ["Jessie Pang", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191002&t=2&i=1436215173&w=1200&r=LYNXMPEF910UC"}