{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/4/republican-female-minority-candidates-help-gop-she", "downloaded_at": "2019-09-05 02:17:26.914027+00:00", "title": "'Grand Opportunity Party': Female, minority candidates helping GOP shed 'old, white' image", "language": "en", "published_at": "2019-09-04", "text": "Young Kim is exactly the kind of candidate Republicans are counting on as they try to convince voters that they are more than a party of whites and older Americans.\n\nMs. Kim is running for a House seat in Orange County, California, looking for a rematch of the race she narrowly lost last year amid questions of Democratic ballot harvesting.\n\nIf she wins next year, she will become the first Korean American Republican in Congress and will be a valuable voice as the party seeks to reclaim territory in the suburbs, which last year helped usher them into the minority in the House.\n\n“GOP used to be known as ‘Grand Old Party’ — you know, old, white male dominant,” she told The Washington Times. “But that’s not the case. Look at me and look at other females from other ethnic groups, other demographics. I think it’s important to redefine what GOP stands for. And I like to say this is a Grand Opportunity Party.”\n\nRepublicans are desperate to shed the white image, particularly after Democrats fielded a stunningly diverse set of candidates last year that proved to be an antidote to the Trump-fueled GOP. Republicans had a number of female and minority candidates, but they, like Ms. Kim, were defeated.\n\nCombined with retirements, those election losses left House Republicans with a whiter, more male caucus, while Democrats seated more women and ethnic minorities.\n\nThis year hasn’t been much better for Republicans.\n\nThe last remaining black House Republican, Rep. Will Hurd of Texas, announced his retirement, and even the House Republican recruitment chair, Rep. Susan Brooks of Indiana, said she will leave Congress next year.\n\nDemocrats found Ms. Brooks’ retirement particularly striking. Rep. Cheri Bustos, the House Democrats’ campaign chair, said Ms. Brooks’ departure was to be expected in a party that “continually marginalizes women’s voices.”\n\nThe National Republican Congressional Committee, the House Republicans’ campaign arm, says it won’t be deterred as it tries to expand its candidate pool.\n\n“Chairman Tom Emmer has made it his priority to ensure that our new Republican majority in 2020 will better reflect the makeup of our country. We’re off to a great start with 101 women, 78 veterans and 73 minority candidates already filed to run,” said Chris Pack, communications director at the NRCC.\n\nHe said Republicans have at least 17 minority candidates in 55 districts they are particularly targeting.\n\nThat includes Ms. Kim and her second run in California. In Florida, Republicans are expecting another rematch with journalist Maria Elvira Salazar, who plans to face off again against Rep. Donna Shalala, a Cabinet official under President Clinton who won her House seat in November.\n\nIn Kansas, Sara Hart Weir, a former president of the National Down Syndrome Society, is looking to challenge Democratic Rep. Sharice Davids, an American Indian.\n\nOther candidates Republicans are looking to boost include Tina Ramirez, a single mother in Virginia who is set to take on Rep. Abigail Spanberger; Wesley Hunt, who is running in Texas; Mike Garcia in California; and Charles Narravo, who is seeking the Republican nomination for a seat from Nevada. Another Republican in Nevada’s 4th District race is Lisa Song Sutton, a former Miss Nevada USA, whose mother is a Korean immigrant.\n\nRepublican strategist Jim McLaughlin said women make particularly good candidates for Republicans because they are often outsiders who don’t match the party’s “good old boys in Washington.”\n\n“They’re looking for people that don’t have voting records. That don’t have a lot of government experience. Folks that don’t look and sound like the status quo,” he told The Times.\n\nMr. McLaughlin said one of Republicans’ best tools to ramp up recruitment is their fight against socialism, which they say Democrats will usher in if they succeed in the 2020 elections.\n\nRNC Chairwoman Ronna McDaniel told reporters that a fight against socialism is helping Republicans win over college-educated women, particularly in suburban districts. Weighing the risk of losing private health care and the potential effects on the economy, Ms. McDaniel argued, is helping “move them back” to supporting Republican candidates.\n\nRep. Tom Emmer, NRCC chairman, explained in a Fox News op-ed in June that the Republican strategy would be to explain to voters why socialism is bad, not just framing it as a fight against a vague “Other.”\n\n“Unless we make it clear to voters why these policies are a bad deal for them, we are at risk of losing even more Republican seats in 2020,” he wrote.\n\nMs. Salazar plans to do just that in her Florida race.\n\nShe told The Times that her family’s story — fleeing from Cuba after the rise of communist dictator Fidel Castro — has given her a personal understanding about the impacts of socialist policies.\n\n“I think that as Cuban Americans we can attest and explain to the rest of the country what socialism means and that there’s nothing pretty about democratic socialism,” she said. “That’s just a pretty word in front of an ugly one.”\n\nShe and Ms. Kim will likely face questions about Mr. Trump’s immigration rhetoric, which his critics say is anti-immigrant and anti-Hispanic.\n\n“Trump has not picked the right words in many occasions, but he has picked the right policies,” Ms. Salazar said.\n\n“There’s just been a miscommunication at the GOP we need to do a better job in sending that message or communicating that we are just like the Latino community. That’s why they came here as immigrants: to work hard, to pay taxes and to love the country,” she added.\n\nThe Republican focus on identity politics is perhaps an odd fit for a party that has traditionally criticized the practice.\n\nKyle Kondik, an analyst at Sabato’s Crystal Ball, an elections forecasting operation, wasn’t sure how much Republican voters will respond.\n\n“That doesn’t mean Republican voters are sexist or racists; it just may mean that voting for someone based on their demographic attributes isn’t something that they value. Or they don’t value it as much as Democrats might,” he said.\n\nHe said one way to gauge Republicans’ optimism about their chances to win back the House is to look at former members considering another run. One of them is David Valadao, who held his California seat for three terms before losing last year but is eyeing a comeback.\n\n“Sometimes retirements can sometimes give us a sense as to how confident those members may be about retaking the majority,” he said. “But at the same time, if you look at the retirements as a pessimistic sign, you also have to look at the former members running as a more optimistic argument.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Young Kim is exactly the kind of candidate Republicans are counting on as they try to convince voters that they are more than a party of whites and older Americans.", "authors": ["The Washington Times Http", "Gabriella Muñoz"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/04/AP_18310821338401_c0-205-4200-2653_s1770x1032.jpg?c3ddb93a6e60e75e21ab62248dc21f33b45aa5e8"}