{"pub": "news24", "url": "https://traveller24.com/TravelPlanning/having-your-passport-information-stolen-is-as-bad-as-credit-card-fraud-20191028", "downloaded_at": "2019-10-29 07:46:38.968983+00:00", "title": "Having your passport information stolen is as bad as credit card fraud", "language": "en", "text": "Most people guard their credit card details like a government secret, but when it comes to passport information they tend to be a little laxer.\n\nOnline hackers and the dark web market only need your full name, birthday, nationality and passport number to steal your identity and even impersonate you at borders.\n\nREAD: Passport safety 101: 6 ways to safeguard your identity during travel\n\nBut how do these shady characters access your information? Last year, multi-national hotel chain Marriott had a massive data breach where 500 million guests had their information compromised, including their passport information. It highlighted the sensitive information held by those in the tourism industry and the need for spruced-up cybersecurity.\n\nHow your passport information is used\n\nThere are three ways that passport information is sold on the dark web, according to CNBC - as digital scans, templates for creating a passport and, the most coveted one, physical passports which can be sold for over R72 000.\n\nPeople use these to cross borders, open accounts at places like banks and gain entry into tightly-controlled places like embassies.\n\nThere are varying degrees of quality passport forgeries - lower-end ones just need to look real at a glance while the high-end ones can be passed off as the real deal at ports. However, most airports have scanners that can pick up the smallest inconsistencies.\n\nAnd it's not that easy to know if someone is using your identity fraudulently, unless you're wrongfully arrested for crimes committed by your passport twin.\n\nWATCH: 32-year-old man disguises himself as senior citizen to travel on fake passport\n\nWhat to do to keep your passport data safe\n\nIf your passport is lost or stolen, you need to report it to the police immediately so that there's a record of the physical breach.\n\nOnline, whenever you have to enter your passport information, ensure that the website is secure and is a reputable organisation. Unfortunately, as the Marriott breach has proven, nothing is 100% failsafe.\n\nHowever, the easiest and quickest way to secure your identity is to get a new passport as soon as you suspect your data has been compromised.\n\nREAD: What to do when your SA passport gets stolen\n\n*Compiled by Gabi Zietsman\n\nFind Your Escape by signing up for the Traveller24 Weekly Newsletter – Subscribe here. Or download the News24 App here, to receive expertly curated travel ideas and deals directly to your mobile.", "description": "Online hackers can use the data from your passport to create fake ones, as well as steal your identity with just your full name, birthday, nationality and passport number.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7131/67bb621b89c145669f134456eaf5431c.jpg", "published_at": "2019-10-29"}