{"pub": "businessinsider", "url": "https://pedestrian.tv/pets/melbourne-peregrine-falcons-hatchlings-are-illegally-fluffy", "downloaded_at": "2019-09-30 02:21:02.651235+00:00", "title": "Everyone Shut The Fuck Up, The Melbourne Peregrine Falcons Are Starting To Hatch", "language": "en", "text": "Spring has well and truly sprung my friends, and Melbourne’s beloved peregrine falcons have begun to hatch out of their eggs. This is not a drill! The little babies are beginning to show up! It’s happening!!!\n\nThe peregrine falcon live cam is essentially Australia’s version of the annual Bear Cam – my other favourite nature Livestream. It keeps an eye on the two peregrine falcons that make Melbourne’s 367 Collins St home, and a bunch of us seasonal bird-watchers keep a keen eye on the couple’s eggs until they eventually hatch.\n\nTrust me, you can lose a real bunch of time watching the precious birds. I love them and they must be protected at all costs.\n\nThis year the city’s two falcons produced four (!!) eggs in their nest on the top of the skyscraper, and I’ve noticed this morning that two of them have now hatched. Two bebbies! Two tiny little beepers opening their eyes to the world.\n\nJust as an aside, that tiny beb’s face is 100% me waking up on Sunday morning after two full days of drinking involving both the AFL grand final and my footy club’s annual end-of-season piss-up. That’s me yesterday morning wondering who had hexed me.\n\nThe first of the wee hatchlings looked to have hatched out of their eggs just after 10am this morning, so those are some fresh chickies. At the moment Mum’s sitting on them to keep them warm (and to incubate the other two eggs) so fingers crossed we might have four bebbies alive and cheeping by the end of the day.\n\nMum’s already been out hunting for the two new fluffballs, and in the time I was watching the feed she came back with a headless bird to chew up and vom into her babies mouths. Sounds…yum.\n\nThe tiny peregrine falcons– are at their most vulnerable when they’re fresh-hatched and can’t see shit, so I’m crossing all my fingers and toes that these two hatched fuzzy-butts and the two yet to peck through their shells survive the first while of their tiny lives.\n\nWe’ll keep you updated on the progress of the tiny falcons, but until then take a hot five minutes (or more) to watch Mum tear apart some kind of prey to feed her new chicklets.", "description": "Melbourne's favourite couple – the Collins St peregrine falcons – have hatched two of their four eggs, and they're illegally fluffy and adorable.", "authors": ["Courtney Fry"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/09/peregrine-falcons-babies-2019-site.jpg", "published_at": "2019-09-30"}