{"pub": "huffpost", "url": "https://huffpost.com/entry/rikers-island-jail-closing-new-york-city_n_5da8def0e4b01246c9b29f2b", "downloaded_at": "2019-10-18 01:04:52.097557+00:00", "title": "New York City To Close Rikers Island Jail Complex By 2026", "language": "en", "text": "NEW YORK (AP) — The Latest on New York City’s plan to close the notorious Rikers Island jail complex (all times local):\n\n5:35 p.m.\n\nNew York City lawmakers have approved a plan to close the notorious Rikers Island jail complex and replace it with four smaller jails.\n\nThe City Council voted Thursday to build the new jails and close Rikers by 2026.\n\nCity Council Speaker Corey Johnson called Rikers Island “a symbol of brutality and inhumanity.” He said the city must move away from “The failed policies of mass incarceration.”\n\nMayor Bill de Blasio and other Democrats support the plan. They say falling crime rates and criminal justice reforms mean the city will only need cells for about 3,300 prisoners per day by 2026.\n\nThat’s less than half the 7,000 prisoners now housed daily in city jails, and way down from the 22,000 incarcerated in 1991.\n\n____\n\n1 a.m.\n\nNew York City lawmakers are considering a plan to close the notorious Rikers Island jail complex and replace it with four smaller jails.\n\nThe City Council is set to vote Thursday on a plan to build replacement jails in time to close Rikers Island by 2026.\n\nMayor Bill de Blasio and other Democrats support the proposal.\n\nThey say falling crime rates and criminal justice reforms mean the city will only need cells for about 3,300 prisoners per day by 2026.\n\nThat’s less than half the 7,000 prisoners now housed daily in city jails, and way down from the 22,000 incarcerated in 1991.\n\nSkeptics say shrinking the city’s jail population that low could turn violent criminals loose on the streets.", "description": "The city council voted Thursday to close the notorious complex and replace it with four smaller jails.", "authors": [], "top_image": "https://img.huffingtonpost.com/asset/5da8e3182000009a11506066.jpeg?cache=v0mxuoz2eh&ops=1778_1000", "published_at": "2019-10-17"}