{"pub": "scmp", "url": "https://yp.scmp.com/go-to-gurus/personal-development/blog/105562/surfing-kayaking-indoor-skydiving-going-hurt-tomorrow", "downloaded_at": "2019-10-05 22:15:49.850569+00:00", "title": "Surfing! Kayaking! Indoor skydiving! This is going to hurt tomorrow morning... (Feb 12)", "language": "en", "text": "Today was a toasty 37°c, and a beautiful day, with, again, not a cloud in the sky, and we had a jam-packed schedule ahead.\n\nIn the morning, to avoid the hottest part of the day, a surf lesson at Spit Beach, which is at the end of the Seaworld Drive Main Beach, with Get Wet Surf School teaching the students the fundamentals of surfing. After a few dry practice runs on the sand, we headed into the water.\n\nWith only two hours at the beach, it's quite impressive that a couple of students managed to ride a wave in on their feet towards the end!\n\n\"This bunch did an awesome job today,\" said Zhang Chen, one of the instructors at Get Wet, \"at the beginning, they may have started slowly, but by the end, most of them were trying to stand up.\"\n\nChen is a 24-year-old student at Griffith University at Gold Coast. Originally from Hubei, China, the exercise science student never surfed until he came to Australia but quickly fell in love with the sport. Now, as an instructor for Get Wet, Chen is quickly called upon around spring festival time when more Chinese tourists come to town and his Putonghua comes in handy.\n\nZhang Chen, from Hubei, studies at Griffith University and teaches surfing with Get Wet. Photo: Heidi Yeung/SCMP\n\n\"I think it's a great opportunity for Hong Kong students to come and learn to surf, especially here at Gold Coast,\" Chen said, \"I also think it helps their confidence. Many students from Hong Kong are scared of sports and this can help them build their confidence and make friends.\"\n\nThe owner of Get Wet, Andrew Jekyll, agrees that Hong Kong students can be timid at first.\n\n\"Students from Hong Kong are borderline scared of the ocean, so we don't rush them,\" Jekyll explained.\n\nAll too soon, it was time to pick up our surf boards, rinse off the sand - of which there was a lot - and grab a quick fish and chips lunch at Seaworld before our next activity of the day: kayaking.\n\nAustralian Kayaking Adventure's Steve quickly taught us how to kayak properly, but it turns out you need to have a knack for it. It's not just dipping your paddles into the water and pushing, there's a lot of coordination involved. Muscular coordination, and coordination with your partner if you're rowing a two-person kayak.\n\nWhat my partner - Johnson Keung Kwan-shun, 18, Y.C.H. Lan Chi Pat Memorial Secondary School - and I lacked in coordination we made up for with enthusiasm and sheer stubbornness not to be left behind. Let me tell you, not being able to balance each other out, which results in a lot of zig zagging on the water instead of rowing in a straight line and correcting for direction constantly, is extremely tiring.\n\nYou'd think we'd call it a day after two physically challenging activities in the sun, but no. A rushed stop back at the Watermark Hotel & Spa Gold Coast and it was off to iFLY for indoor skydiving lessons. Another activity that requires total muscular coordination.\n\nIndoor skydiving requires divers (flyers?) to be suited up in one of those outfits you see racecar drivers wear around the track. Let's just say some of us don't look as dashing in them as others did. Nevermind.\n\nOkay, you're just showing off now... Photo: Heidi Yeung/SCMP\n\nStudents who were able to participate filed into the waiting room around the wind tunnel, which is basically one big glass tube. Students who'd had a shoulder dislocated before, or aren't keen, sat outside to watch the show.\n\nOne by one, the students, following a brief lesson from their instruction, jumped into the tunnel Superman-style and attempted to stay afloat.\n\nYes, there were funny wind tunnel faces. Yes, there was a lot of flailing about. Yes, people crashed into the glass. And, yes, we laughed.\n\nThose who got the hang of skydiving, on their second turn, got to fly up higher into the tunnel with their instructor. Their wind tunnel face of a few moments ago now beamed with pride and excitement as they exited to the applause of their friends.\n\nI guess you could say our second day in Queensland ended on a high note.\n\nVideo of Day 2: Hong Kong Airlines take students to learn surfing, kayaking and skydiving all in one day", "description": "Three physically demanding activities made for a fun but exhausting day on the Hong Kong Airlines Embrace the World Student Sponsorship Programme 2016/17.", "authors": [], "top_image": "https://yp.scmp.com/sites/default/files/styles/900x506/public/images/img_5300.png", "published_at": "2019-10-05"}