{"pub": "thehill", "url": "https://thehill.com/opinion/international/466454-boris-johnson-cannot-afford-defeat-on-the-new-brexit-deal-with-europe", "downloaded_at": "2019-10-19 10:57:19.215186+00:00", "title": "Boris Johnson cannot afford defeat on the new Brexit deal with Europe", "language": "en", "text": "There was an inescapable sense of déjà vu in Brussels this week as European Union leaders fleshed out the details of a new withdrawal agreement on the long delayed British exit from the largest trading bloc in the world. Is it a good deal and better deal or a worse deal? An answer to this question largely depends on where one sits in the great Brexit debate. Essentially, the new deal is only an ever so slightly repackaged version of the withdrawal agreement painstakingly negotiated by the government of Therea May, that same agreement Boris Johnson and his allies, most of whom are now in his cabinet, vehemently rejected months ago.\n\nYet there are some crucial differences especially relating to Northern Ireland and the diverging trading relationship within the United Kingdom after Britain leaves. The new agreement avoids a hard physical border between the Republic and Northern Ireland, crucially leaving the latter aligned to European Union single market rules for certain goods while at the same time remaining part of the United Kingdom customs territory. The Northern Ireland Assembly would then vote on whether to maintain that European Union relationship going forward by a simple majority and thereby keeping Northern Ireland as the only part of the United Kingdom in two regulatory systems. The Northern Ireland Democratic Unionist Party, which has been propping up the conservative government for two years, has rejected the latest deal with the European Union.\n\nThe changes negotiated by Johnson to the Northern Ireland part of the deal are major concessions from the man who one year ago staunchly rejected. Indeed, Johnson, speaking at the Democratic Unionist Party annual conference last year argued that the deal under May would result in Northern Ireland becoming a “semi-colony of the European Union” and would be damaging “with regulatory checks and even customs controls between Great Britain and Northern Ireland, on top of those extra regulatory checks down the Irish Sea that are already envisaged in the withdrawal agreement.” He exclaimed, “No British conservative government could or should sign up to any such arrangement.”\n\nADVERTISEMENT\n\nThe deal under Johnson goes further than what May had previously agreed to. In his latest version, a customs border will exist down the Irish Sea, effectively cutting Northern Ireland off from the rest of the United Kingdom. Northern Ireland will then, bizarrely, be part of two customs arrangements, that of the European Union and the United Kingdom, which despite the obvious additional administrative complexity that this gives rise to, may well provide the region with a major economic boost to companies wishing to have a foot in both customs regimes.\n\nNevertheless, the agreement, if passed, will lead to the birth of an asymmetrical customs system from the outset between England, Wales, Scotland, and Northern Ireland. Unsurprisingly, Scottish nationalists who have long pushed for the whole of the United Kingdom to remain within the European Union customs market, are fuming at what they view as preferential treatment for one part of the United Kingdom.\n\nThe question left unanswered after the European Union approved the text of the deal is whether Johnson has the numbers in Parliament to seal the deal. Having inherited a minority administration from May, Johnson expelled 21 members from the party in early September after they voted with the opposition to pass legislation forcing the prime minister to legally ask the European Union for an extension should no deal be agreed by October 31, the official deadline for leaving the European Union.\n\nLuckily for Johnson, the majority of these 21 party exiles are likely to support the deal during the House of Commons vote this weekend. The two dozen or so hardline members of Parliament on the right of the party, collectively called the European Research Group, who frequently voted down the deal under May and attacked her negotiating position, are also likely to toe the party line and vote in favor of the new agreement.\n\nFor many in the European Research Group, accepting the repackaged deal under Johnson is far better than being responsible for a defeat which could potentially lead to a second referendum on whether to accept the agreement or remain in the European Union. Ironically, most of these diehard Brexiters have stressed that they would only back a withdrawal agreement that had the support of the Democratic Unionist Party. Yet assuming Johnson can whip his party into joining the government in support of the deal, he still falls short of a majority in Parliament.\n\nADVERTISEMENT\n\nThe 10 members at Westminster have not only rejected the agreement, they will vote against it leaving the prime minister in a familiar position faced by his predecessor, short of a House of Commons majority. But Brexit fatigue might well sway a number of rebel members from the opposition Labour Party to break party ranks and support Johnson simply to get a deal approved and move on from an issue that has paralyzed British politics for three years. Just exactly how many members of Parliament will cross the aisle is the great unknown with many of the undecideds deciding which way to vote at the last moment. However even the most optimistic forecasters still conclude that the new deal will be defeated by a number of votes barring some miracle.\n\nWill Britain finally leave the European Union on October 31? It is highly unlikely if this new deal under Johnson suffers the same fate as the deal under May. For the prime minister who famously said he would “rather be dead in a ditch” than ask the European Union for an extension, a defeat in the House of Commons will almost certainly mean an embarrassing climbdown and a lengthy extension of negotiations into 2020.\n\nMichael J. Geary is a global fellow at the Woodrow Wilson International Center for Scholars in Washington. He is also an associate professor of European history at the Norwegian University of Science and Technology.", "description": "His numbers for the vote on this agreement could define his legacy as prime minister.", "authors": [], "top_image": "https://thehill.com/sites/default/files/borisjohnson_11062015.jpg", "published_at": "2019-10-18"}