{"pub": "businessinsider", "url": "https://businessinsider.co.za/sasol-coal-to-fuel-production-south-africa-fuel-price-2019-10", "downloaded_at": "2019-10-28 09:50:37.867971+00:00", "title": "Sasol could sell cheaper fuel if the petrol price were deregulated – at current oil prices, anyway", "language": "en", "text": "Sasol can produce fuel from coal cheaper the cost of oil.\n\nBut South Africa's regulated fuel price is based on the price of oil, and the value of the rand.\n\nThat means if the petrol price was to be deregulated – as is occasionally proposed – Sasol could, in theory, sell fuel cheap.\n\nFor more stories, go to the Business Insider SA homepage.\n\nAt current prices Sasol is producing petrol at below the cost of Brent Crude oil – and in theory it could sell fuel at less than the current regulated petrol price, if it were ever allowed to do so.\n\nSasol supplies roughly 20% of South Africa’s liquid fuel.\n\nThe exact relationship between the oil price and the cost at which Sasol makes fuel from coal is complex, Sasol spokesperson Alex Anderson told Business Insider South Africa.\n\n“While coal is a cheaper feedstock relative to oil, the conversion of coal-to-liquids is a highly energy-intensive, costly and complex process,” Anderson said.\n\nSouth Africa’s official fuel price is set monthly by the department of energy in a calculation heavily influenced by the price of Brent Crude and the rand/dollar exchange rate.\n\nA recent policy proposal by the national treasury, however, could see the the fuel price deregulated.\n\n\n\nThe department of energy did not answer direct questions about the extent to which the current fuel price structure benefits Sasol.\n\nThe apartheid government created Sasol in the 1950s to use technology developed by scientists in Nazi Germany to turn coal into liquid fuel.\n\nThis was particularly important as the country faced escalating international sanctions which placed pressure on its oil imports, and therefore the country’s energy security.\n\nThe now listed public company is today one of the world’s largest producers of synthetic fuels out of coal, Anderson said.\n\nSince 2017 Sasol no longer invests in fuel refining capacity, instead focussing on chemicals.\n\n“Creating additional fuel production capacity using our existing processes is highly capital intensive, and would be challenging to justify economically and from an emissions/environmental perspective,” Anderson said.", "description": "The apartheid government founded Sasol in the 1950s as a means to use the country’s large coal reserves as a source of fuel using technology developed by scientists in Nazi Germany.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9490/37473ae0f4234e29a4b4821eeb335851.png", "published_at": "2019-10-28"}