{"pub": "cbc", "url": "https://cbc.ca/sports/baseball/mlb/grichuk-zeuch-blue-jays-yankees-recap-1.5284581", "downloaded_at": "2019-09-15 23:10:23.265210+00:00", "title": "Sports-no-CBC", "language": "en", "text": "Randal Grichuck has struggled to find consistency in his first season with the Toronto Blue Jays by his admission. But that hasn't hindered his power numbers this summer.\n\nThe 28-year-old Texan swatted two more homers, including a three-run blast in the fifth inning to put the Blue Jays ahead for good, in a 6-4 win against the New York Yankees on Sunday.\n\nGrichuk's two home runs pushed his total to a career-high and team-leading 28 with 12 games remaining. The right fielder also enters the final two weeks of the season riding an eight-game hit streak that has produced three doubles, a triple, four homers, nine RBIs and a .313 average (10 for 32).\n\n\"Even in a down year the power is still there, that's a positive,\" Grichuk said. \"I'm not feeling for it or getting out of my swing to take away power even when I'm struggling. I'd like to be more consistent, but the power is still there.\"\n\nWATCH | Grichuk's two homers power Blue Jays past Yankees:\n\nRandal Grichuk smack a pair of home runs as the Toronto Blue Jays beat the New York Yankees 6-4 on Sunday at the Rogers Centre. 1:30\n\nGrichuk didn't have an explanation for his struggles, particularly in the first half. But he made some tweaks to his swing after the all-star break and has been more productive.\n\n\"I've been searching for the feeling or searching for that feeling of comfort in the box,\" he said. \"I've felt it at times, but not long enough.\n\n\"I still have a chance to finish strong.\"\n\nThe victory pushed Toronto (59-91) to a 2-1 series victory against the Yankees (98-53), who came to town with the best record in MLB.\n\nThe Blue Jays enter the final two weeks on a high after taking four games at home in the three-game sets against the American League East rival Boston Red Sox and Yankees.\n\nEven though the Blue Jays have been out of the playoff race for months, their manager Charlie Montoyo was biting his nails in the dugout as closer Ken Giles worked a 1-2-3 ninth, including a game-ending strikeout of Aaron Judge, for his 20th save in 2019.\n\n\"Today, in the ninth inning, was the most nervous I've been all year just because it was a chance to win two out of three from Boston and two out of three from the Yankees,\" he said.\n\nGrinding out the win\n\nBesides Grichuk's hitting, a strong pitching performance from T.J. Zeuch played a brilliant role in the Blue Jays concluding the six-game homestand with a victory.\n\nZeuch took over for opener Wilmer Font to begin the second inning. After some struggles in the third inning, when he yielded two runs after allowing a single, double, walk and another single to the first four Yankees, Zeuch settled down.\n\nIn his third appearance of the season, Zeuch (1-0) pitched a personal-high 5 1/3 innings and struck out a career-high five to record his first career win.\n\n\"I thought I made a lot more competitive pitches,\" the 24-year-old Zeuch said. \"I stayed out of the heart of the plate. I was in the zone a lot more, and when I really needed to make a pitch, I was able to make a competitive pitch and give my defence a chance to make a play.\"\n\nGrichuk's solo blast to right centre-field in the third inning off Yankees left-handed hurler Jordan Montgomery, making his first appearance in 16 months after Tommy John surgery, tied the game at 3-3.\n\nGrichuk then snapped the tie with a three-run blast in the fifth inning. After Toronto shortstop Bo Bichette pushed a bunt single past the left side of the mound with one out in the fifth, Cavan Biggio walked. Grichuk then crushed an 0-2 four-seam fastball from reliever Nestor Cortes Jr. (5-1) into the second deck in left field.\n\nThe Yankees could have clinched a playoff berth with a win and a Cleveland Indians loss at home to the Minnesota Twins.", "description": "Randal Grichuk snapped a tie with a three-run blast in the fifth inning for his second homer of the game to give the Blue Jays a 6-4 win over the visiting New York Yankees on Sunday. That was enough support for T.J. Zeuch to post his first major league win.", "authors": [], "top_image": "https://i.cbc.ca/1.5284588.1568578167!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/grichuk-randal-190915-1180.jpg", "published_at": "2019-09-15"}