{"pub": "usatoday", "url": "https://usatoday.com/story/news/politics/2019/10/28/kay-hagan-former-senator-north-carolina-dies/2490448001", "downloaded_at": "2019-10-28 23:35:34.444657+00:00", "title": "Former North Carolina US Sen. Kay Hagan dies at age 66", "language": "en", "text": "Martha Waggoner\n\nAssociated Press\n\nRALEIGH, N.C. — Former U.S. Sen. Kay Hagan, who stepped away from a banking career to be a stay-at-home mom and then ventured into politics, died Monday after a prolonged illness. She was 66.\n\nHagan died at her home in Greensboro of encephalitis, or brain inflammation, caused by a rare virus spread from ticks to humans, said her former Senate spokeswoman, Sadie Weiner. Hagan contracted Powassan virus in late 2016, and the subsequent brain inflammation made speaking and walking difficult for her.\n\n\"We already miss her humor and spirit as the hub of our family, a role she loved more than anything. Nobody could light up a room and make people feel welcome like Kay,\" her family said in a statement.\n\nFormer President Barack Obama remembered Hagan as someone who worked with him to pass the Affordable Care Act and who had a \"reasoned, pragmatic voice.\"\n\n\"She was, quite simply, a terrific public servant — eager to find common ground, willing to rise above the partisan fray, and always focused on making progress for the people she served,\" he said in a statement.\n\nFormer Vice President Joe Biden, who is seeking the Democratic nomination for president, said he saw Hagan in person when he visited Durham on Sunday.\n\n\"She was a champion for North Carolina and a fierce defender of all its citizens,\" Biden said. \"She stood for women's rights and marriage equality, not because it was politically popular, but because it was right.\"\n\nShe was crucial to passing the 2009 Recovery Act, an economic stimulus package, and the Affordable Care Act, he said.\n\n\"Her political courage helped pull our country out of recession and made life better for millions of her fellow Americans,\" Biden said.\n\nHagan defeated North Carolina's first female Republican U.S. senator, Elizabeth Dole, to become the state's first female Democratic senator. She served a single term in the Senate and lost her 2014 reelection bid to Republican North Carolina House Speaker Thom Tillis.\n\nTillis, who is seeking reelection next year, said in a statement that Hagan had a \"dedicated and distinguished record of public service to our state and nation.\"\n\nGov. Roy Cooper ordered all U.S. and North Carolina flags at state buildings, facilities and grounds to be lowered to half-staff through sunset Tuesday.\n\n\"Kay was a fierce advocate for North Carolina, and she represented our state with courage and grace her entire career,\" Cooper said. \"She made it a mission to inspire young people — especially young girls — to enter public service, and she served as a role model to so many. North Carolina is mourning one of our best today.\"\n\nHagan was born in Shelby, North Carolina, on May 26, 1953. She spent most of her childhood in Lakeland, Florida, where she worked on the mayoral campaigns of her father, Joe Ruthven. She also helped campaign for her maternal uncle, former Florida governor and U.S. Sen. Lawton Chiles. She earned her undergraduate degree from Florida State University in 1975, then earned a law degree from Wake Forest University three years later.\n\nFor 10 years, Hagan worked for NationsBank, which was to become Bank of America, where she became a vice president in the estates and trust division. After being a stay-at-home mother, Hagan launched her own political career and won a seat as a Democrat in the North Carolina state Senate in 1998.\n\nTen years later, the still largely unknown state legislator sought and won the U.S. Senate seat held by Dole.\n\nThough initially reluctant, Hagan backed the Affordable Care Act pushed by Obama. She also worked to limit payday lending, continuing the effort she began as a state senator.\n\nRepublican U.S. Sen. Richard Burr or North Carolina said Hagan worked diligently for the state and the people she loved.\n\n\"In our time as Senate colleagues, we worked across the aisle together frequently on issues that we both knew would determine what type of country our children would inherit, from conservation to our common defense. She tackled everything she did with a passion and a sense of humor that will be missed,\" Burr said in a statement.\n\nOther former Senate colleagues also mourned her passing.\n\nU.S. Sen. Amy Klobuchar, who's seeking the Democratic nomination for president, tweeted that Hagan \"was one bright yellow ray of sunshine for everyone she touched — the Senate, her beloved state of NC, her friends.\"\n\nIn March 2011, Hagan sat on a congressional panel that questioned Army Secretary John McHugh regarding the unexplained deaths of 12 infants at Fort Bragg dating back to 2007. She also pushed for the release of documents pertaining to contaminated water at Camp Lejeune.\n\nIn June, Hagan made a rare public appearance at a groundbreaking ceremony for Piedmont Triad International Airport's new air traffic control tower, for which she helped gain funding.\n\nIn addition to her father, Hagan is survived by her husband, Charles \"Chip\" Hagan, and three children: Jeanette Hagan, Tilden Hagan and Carrie Hagan Stewart. She's also survived by two siblings and five grandchildren.", "description": "The former senator died at her home of encephalitis caused by a rare virus spread from ticks to humans, said her former Senate spokeswoman, Sadie Weiner.", "authors": [], "top_image": "https://www.gannett-cdn.com/-mm-/529609352bb467db87464765cc2b623f98e8002c/c=0-264-3744-2370/local/-/media/2016/03/10/USATODAY/usatsports/kay-hagan_001.jpg?width=3200&height=1800&fit=crop&format=pjpg&auto=webp", "published_at": "2019-10-28"}