{"pub": "politico", "url": "https://politico.com/magazine/story/2019/09/03/why-america-needs-to-break-its-addiction-to-long-prison-sentences-227999", "downloaded_at": "2019-09-03 23:41:16.090477+00:00", "title": "Why America Needs to Break Its Addiction to Long Prison Sentences", "language": "en", "published_at": "2019-09-03", "text": "Ben Miller is a senior legal counsel at the Justice Collaborative, a nonprofit organization working to reform the criminal legal system. Daniel S. Harawa is an Assistant Professor of Practice and Director of the Appellate Clinic at Washington University in St. Louis School of Law.\n\nLamar Johnson has been in prison for 24 years—more than half his life—serving a sentence of life without parole. The office responsible for prosecuting him now is “convinced” he is innocent. But the law might not provide a mechanism for his release.\n\nLast week, a St. Louis judge denied the motion to reverse the conviction because she said the time to have filed it had passed—24 years ago when he was originally sentenced. The judge insisted she had no authority under Missouri law to grant the motion for a new trial. Johnson’s attorney contends judges have the discretion to waive the time limit in “extraordinary circumstances” and Missouri courts will have to decide whether that is correct or not, as Johnson has appealed the judge’s ruling.\n\nStory Continued Below\n\nBut Johnson’s case highlights a pressing related problem in our criminal legal system: The lack of meaningful mechanisms in place to allow people in prison to obtain release once they have proven to no longer pose a danger to our communities, or as in Johnson’s case, proven to be actually innocent. We have forgotten that our justice system is supposed to rehabilitate people, not just punish them.\n\nMissouri is far from the only state to place strict limitations on a person’s ability to seek a new trial or reduced sentence in order to be released from prison, especially if the argument is not based on DNA evidence. Though some may point to parole as an option, the potential for release on parole has proven slim, with the federal government and 14 states having eliminated it completely.\n\nFor decades, while we made it increasingly difficult to obtain release, we have sent people to prison for longer and longer. We became reliant on extreme sentences, including mandatory minimums, “three-strike” laws, and so-called truth-in-sentencing requirements that limit opportunities for people to earn time off their sentences for good behavior. As a result, the United States laps the world in the number of people it incarcerates, with 2.2 million people behind bars, representing a 500 percent increase over the past four decades, with 1 in 9 people in prison serving a life sentence.\n\nA desire to break our incarceration addiction has helped usher in progressive prosecutors across the country seeking a new way to conduct our criminal legal system. It has also led to an increase in the number of politicians issuing criminal justice reform plans. Recently, both Bernie Sanders and Elizabeth Warren announced plans that have been praised as “the most decarceral criminal justice platforms to enter presidential politics.”\n\nYet what Johnson’s case highlights is that no matter how visionary the plan in place, and even if a prosecutor is the one advocating for a person to receive a reduced sentence, without the procedural mechanism in place to permit a court to consider the case, there may be no legal solution.\n\nThat is why if we want to significantly reduce the number of people this country incarcerates, legislation is needed at the federal level and in every state to allow everyone after a certain period in prison the opportunity to seek sentence reductions. Sentence review legislation recognizes that as we have increased the length of prison sentences and limited the ability to obtain release, our prisons have become overwhelmed with people whose current conduct proves further incarceration is not in the public interest.\n\nWe increased sentence lengths and made it more difficult for people to be released because we were told it was needed for public safety. But sending people to prison for long periods does not reduce crime. In fact, longer sentences, if anything, create crime. David Roodman, a senior adviser for Open Philanthropy, reviewed numerous studies on the impact of incarceration and concluded that “in the aftermath of a prison sentence, especially a long one, someone is made more likely to commit a crime than he would have been otherwise.”\n\nNot only are lengthy prison sentences ineffective at reducing crime, but they have devastated low-income and minority communities. As the Vera Institute aptly put it: “We have lost generations of young men and women, particularly young men of color, to long and brutal prison terms.” While black people are just 13-percent of the country’s population, they account for 40 percent of the people we incarcerate.\n\nIf the ineffectiveness of long prison terms or the impact on poor communities of color is not reason enough to revisit lengthy prison sentences, the financial drain of long prison terms is staggering. For example, U.S. prisons spend $16 billion per year on elder care alone. Billions of dollars are diverted to prisons to care for the elderly who would pose no real risk if released when that money could be going to our schools, hospitals, and communities.\n\nGiven this reality, we need to pursue every option that would safely reduce our prison population. One proposal by the American Law Institute recommends reviewing all sentences after a person has served 15 years in prison. Another example is the bill Sen. Cory Booker (D-N.J.) and Rep. Karen Bass (D-Calif.) introduced that would provide sentence review for anyone who has served more than 10 years in prison or who is over 50 years old. Notably, neither proposal is restricted by the type of offense, which is critical, because to combat mass incarceration, to echo the Prison Policy Initiative, reform has “to go further than the ‘low hanging fruit’ of nonviolent drug offenses.”\n\nThe opposition to any sentence review policy is predictable. Opponents will decry the danger of releasing “violent” people into the community. This criticism is straight out of the failed tough-on-crime playbook that created the country’s mass-incarceration crisis in the first place. It was this same message that pushed legislators and prosecutors for years to enact and seek extreme sentences that have overburdened prisons across the country. This criticism rings hollow.\n\nMeasures that promote sentence review would not automatically release anyone. Instead, people would be given a chance to show a court that they are no longer a danger to public safety. A judge—after weighing all relevant circumstances, including hearing from any victims and their families—would then decide whether a person should be released.\n\nAnd numerous studies have shown that decreasing sentences does not increase crime. A recent Brennan Center for Justice report documented 34 states that reduced both their prison population and their crime rates, the Sentencing Project concluded that “[u]nduly long prison terms are counterproductive for public safety,” and the Justice Policy Institute found “little to no correlation between time spent in prison and recidivism rates.”\n\nRobust sentence review legislation that would help reduce both our prison population and the strain on government budgets must be part of every discussion about criminal justice reform. Sister Helen Prejean has often said, “People are worth more than the worst thing they've ever done.” Our policies should reflect the ability of people to change over the course of years—or decades—of incarceration.\n\nThis article tagged under: Law And Order", "description": "Shorter sentences will end prison crowding and even reduce crime.", "authors": ["Shawna Chen", "Michael Grunwald", "Ben Miller", "Daniel S. Harawa"], "top_image": "https://static.politico.com/04/6a/19f8147c45638ff7095fd3a25563/gettyimages-589987296-1.jpg"}