{"pub": "independent", "url": "https://independent.co.uk/life-style/gadgets-and-tech/news/twitter-down-tweetdeck-not-working-latest-loading-login-problem-fix-a9129096.html", "downloaded_at": "2019-10-02 12:51:39.013041+00:00", "published_at": "2019-10-02", "title": "Twitter and Tweetdeck down: Tweets not working as website refuses to let people log in", "language": "en", "text": "Twitter has stopped working, refusing to show tweets and allow people to log in.\n\nBoth the main Twitter service as well as its Tweetdeck client have been caught in the outage, which has gone on for hours.\n\nA vast number of users are being hit by the issues, according to tracking website Downdetector.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nProblems were happening across the world, the website showed.\n\nBut some are able to log in as normal. It is not clear how the site is working for some specific users, or whether there is a fix for those affected.\n\nShape Created with Sketch. 11 useful Twitter features you might not know about Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. 11 useful Twitter features you might not know about 1/11 Turn on Night Mode Twitter’s dark blue Night Mode is a lot easier on your eyes than its regular, vibrant theme. On the site, you can enable it by clicking your profile photo (on the right-hand side of the bar at the top of the screen) and selecting Night Mode. On Android and iOS, you need to tap your profile picture at the top of the screen and select Night Mode. 2/11 Lengthen your tweets A “small group” of users are no longer restricted by Twitter’s 140-character tweet limit. Even if you’re not a chosen one, you can double your limit to 280 characters on desktop by downloading the Tampermonkey plugin, going to https://gist.github.com/Prof9/c16fc4997e0ef5b22a15c43edd7f5f49, clicking Raw and then Install. 3/11 Improve search Twitter’s regular search tool can be a little messy, but Advanced Search makes it much easier for you to find specific things. Go to https://twitter.com/search-advanced and filter your search by word, hashtag, exact phrase, location, date and account. 4/11 Disable read receipts Like WhatsApp and Facebook Messenger, Twitter’s direct messaging service shows you when your messages have been seen by the person you sent them to. You can disable read receipts though. On Android, iOS and the site, go to Settings and Privacy, click on Privacy and Safety and disable read receipts. 5/11 Monitor your tweets Retweets and Likes only form part of the story, as far as tweet engagement is concerned. You can view a lot more information about how people have reacted to your updates, including the number of times they’ve been seen and the number of times people have interacted with them. Just open your tweets and hit the View Tweet Activity button. 6/11 Trim the fat If you feel like you’re drowning in push notifications, you can cut down the number you receive from Twitter by going to Settings, Notifications, Push Notifications and deselecting the types of notifications you wouldn’t like to receive. You can also enable sleep settings, which allow you to switch off all mobile updates during certain hours of the day. On the site, go to Settings, Mobile and select your hours. 7/11 Save data You can stop videos from playing automatically on desktop and the Twitter app. On the site, you can do this by going to Settings, Account, Video Tweets and unchecking Video Autoplay. On both the Android and iOS versions of the app, go to Settings, General, Data Usage, Video Autoplay, and choose between Mobile data & Wi-Fi, Wi-Fi Only, and Never. 8/11 Save even more data You can save even more data and completely transform your timeline in the process by disabling images. Just go to Settings, Data Usage and uncheck the Image Previews box. 9/11 Customise your profile Editing your Twitter profile is really straightforward, just go to your profile and click the large Edit Profile button. However, there’s one customisation option that’s easy to miss. As well as your name, bio and profile photos, you can change your colour scheme. The option is only available on the Twitter site, and is sandwiched between the Website and Birthday sections. 10/11 Browse properly One of the Twitter app’s most annoying features is its in-app browser, which links automatically open up in. You can sacrifice it for your favourite mobile browser by going to Settings, Display and Sound and unchecking the Use In-App Browser box. 11/11 Subscribe to tweets You can set up alerts that let you know whenever a certain account tweets, but it’s a two-stage process. First, on the app, go to Settings, Notifications, Push Notifications, Tweets and turn the toggle button on. Then open the profile page of the account you want to receive notifications from, tap the Bell icon next to the Following button and choose between All Tweets, Only Live Video and Off. 1/11 Turn on Night Mode Twitter’s dark blue Night Mode is a lot easier on your eyes than its regular, vibrant theme. On the site, you can enable it by clicking your profile photo (on the right-hand side of the bar at the top of the screen) and selecting Night Mode. On Android and iOS, you need to tap your profile picture at the top of the screen and select Night Mode. 2/11 Lengthen your tweets A “small group” of users are no longer restricted by Twitter’s 140-character tweet limit. Even if you’re not a chosen one, you can double your limit to 280 characters on desktop by downloading the Tampermonkey plugin, going to https://gist.github.com/Prof9/c16fc4997e0ef5b22a15c43edd7f5f49, clicking Raw and then Install. 3/11 Improve search Twitter’s regular search tool can be a little messy, but Advanced Search makes it much easier for you to find specific things. Go to https://twitter.com/search-advanced and filter your search by word, hashtag, exact phrase, location, date and account. 4/11 Disable read receipts Like WhatsApp and Facebook Messenger, Twitter’s direct messaging service shows you when your messages have been seen by the person you sent them to. You can disable read receipts though. On Android, iOS and the site, go to Settings and Privacy, click on Privacy and Safety and disable read receipts. 5/11 Monitor your tweets Retweets and Likes only form part of the story, as far as tweet engagement is concerned. You can view a lot more information about how people have reacted to your updates, including the number of times they’ve been seen and the number of times people have interacted with them. Just open your tweets and hit the View Tweet Activity button. 6/11 Trim the fat If you feel like you’re drowning in push notifications, you can cut down the number you receive from Twitter by going to Settings, Notifications, Push Notifications and deselecting the types of notifications you wouldn’t like to receive. You can also enable sleep settings, which allow you to switch off all mobile updates during certain hours of the day. On the site, go to Settings, Mobile and select your hours. 7/11 Save data You can stop videos from playing automatically on desktop and the Twitter app. On the site, you can do this by going to Settings, Account, Video Tweets and unchecking Video Autoplay. On both the Android and iOS versions of the app, go to Settings, General, Data Usage, Video Autoplay, and choose between Mobile data & Wi-Fi, Wi-Fi Only, and Never. 8/11 Save even more data You can save even more data and completely transform your timeline in the process by disabling images. Just go to Settings, Data Usage and uncheck the Image Previews box. 9/11 Customise your profile Editing your Twitter profile is really straightforward, just go to your profile and click the large Edit Profile button. However, there’s one customisation option that’s easy to miss. As well as your name, bio and profile photos, you can change your colour scheme. The option is only available on the Twitter site, and is sandwiched between the Website and Birthday sections. 10/11 Browse properly One of the Twitter app’s most annoying features is its in-app browser, which links automatically open up in. You can sacrifice it for your favourite mobile browser by going to Settings, Display and Sound and unchecking the Use In-App Browser box. 11/11 Subscribe to tweets You can set up alerts that let you know whenever a certain account tweets, but it’s a two-stage process. First, on the app, go to Settings, Notifications, Push Notifications, Tweets and turn the toggle button on. Then open the profile page of the account you want to receive notifications from, tap the Bell icon next to the Following button and choose between All Tweets, Only Live Video and Off.\n\nSome users report that clearing the cache – either by doing so through the browser settings, or using an incognito window – could fix some of the issues, and allow people to log in.\n\n\"You might have had trouble Tweeting, getting notifications, or viewing DMs. We're currently working on a fix, and should be back to normal soon\", the company said in a tweet.\n\nHours after the post, the website was still not working properly for a huge number of users.", "description": "Twitter has stopped working, refusing to show tweets and allow people to log in. Both the main Twitter service as well as its Tweetdeck client have been caught in the outage, which has gone on for hours. A vast number of users are being hit by the issues, according to tracking website Downdetector. Problems were happening across the world, the website showed.", "authors": ["Andrew Griffin"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/07/01/20/twitter.jpg"}