{"pub": "afr", "url": "https://afr.com/companies/professional-services/asic-pushes-to-expand-digital-reporting-20191018-p5324e", "downloaded_at": "2019-10-22 13:32:31.416724+00:00", "title": "ASIC pushes to expand digital reporting", "language": "en", "text": "It also noted that many Australian companies may need to produce digital reports to compete in global markets as other countries were increasingly requiring them.\n\nAustralian companies with securities listed in the US already have to lodge digital reports with the US Securities and Exchange Commission and the European Union will require them from all companies listed on its members' exchanges from 2020.\n\nBut Professor Wells said despite the benefits of digital reporting, ASIC had failed to proactively explore its adoption.\n\n'A soft launch'\n\n\"ASIC allowed sometime ago for the voluntary use of digital reports, trying for what you could call 'a soft launch', but this didn't work,\" he said.\n\n\"If nothing has happened after nine years of trying an approach, then that has been a failure and ASIC should have been thinking of alternative ways.\"\n\nThe US undertook a \"graduated launch\", beginning with voluntary digital reporting before. It began as voluntary before becoming compulsory for large companies then all companies.\n\nProfessor Wells questioned why ASIC did not look to this example.\n\nAdvertisement\n\nHe said ASIC's justification of why its voluntary position had not worked was \"circular\".\n\n\"Companies do not lodge the reports because analysts have not updated their systems to use the reports, and analysts are not updating their systems because no entities produce the reports,\" the regulator's submission said.\n\n\"Consideration on how to best encourage the adoption of digital financial reporting may be warranted.\"\n\nMr Wells noted the ASX also had the power to impose digital reporting in its listing rules, but had been \"conspicuously silent\" on the issue.\n\nThe cost of change\n\nThe cost associated with changing to a digital reporting system is often cited in arguments against its adoption.\n\nBut Professor Wells said this concern was \"totally misstated\".\n\n\"It would be a cost-saving overall if it was done once and done properly,\" he said, as reports are currently sent overseas for analysis in the Philippines at cost to companies.\n\nMost of the businesses that would be impacted by the change were \"very big\", he noted, so it would not be \"the smaller mum and dad-run companies\" having to foot the bill.", "description": "The corporate watchdog has called on the inquiry to look into digital reports, after its own attempt to introduce them on a voluntary basis failed.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.223%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_37/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/7f40dc1f2599f9fdd37e8095e1bc383e672a0b47", "published_at": "2019-10-18"}