{"pub": "afr", "url": "https://afr.com/young-rich/2018-young-rich-list-steve-smith-debuts-even-after-a-horror-year-20181024-h171dp", "downloaded_at": "2019-10-05 06:02:35.929595+00:00", "title": "2018 Young Rich List: Steve Smith debuts even after a horror year", "language": "en", "text": "Year of redemption\n\nThey join a collection of athletes continuing to enjoy success in their chosen fields – former NBA star turned Sydney Kings recruit Andrew Bogut, golfers Adam Scott and Jason Day and Socceroo Tim Cahill.\n\nNone of them have had to face a year of redemption like Smith.\n\nFormer Australian cricketer Shane Warne on Monday told ABC's 7.30 that while Australians were disappointed and embarrassed by the scandal, Smith made \"a silly mistake and an error in judgment\" and the country was too quick to \"hang people and just nail them\".\n\n\"He's a wonderful captain, he's a great player. He just made a silly mistake and I don't think the punishment fits the crime. Twelve-month ban for that? Equate to about an $8 [million], $10 million fine.\n\nSteve Smith debuts even after a horror year Atlassian duo supercharge a record year of wealth The fitness star and the Millennial bank Atlassian co-founders Australia’s richest young entrepreneurs Targeting Uber drivers a splendid move for Chris King Where are the women? Inside Afterpay, Prospa and the fintech boom The billionaire brothers from Bundaberg How Young Rich Lister Jimmy Spithill invests The first Young Rich Listers - where are they now?\n\n\"So I thought they were very, very hard done by and it was a very harsh penalty. But having said that, we hated it and we didn't like it and they have to earn our respect back.\"\n\nThis week Smith was at Parramatta Marist High School in Sydney's west, talking to young boys about what he went through in the fallout from the ball-tampering incident and how important it was to have supportive people around him during that time.\n\nAdvertisement\n\nGood shape\n\nThe talks are part of a program run by Gotcha4Life, a foundation started by Triple M radio personality Gus Worland and backed by Hollywood star Hugh Jackman, that aims to save lives by improving the mental health of men and boys. Smith is now an ambassador.\n\nHe also donated his $100,000 contract fee (minus tax obligations) from Canada's T20 tournament to grassroots cricket organisations.\n\nYet off the field, his investments have put him in relatively good shape.\n\nHe owns six homes across Sydney, bought between 2011 and May 2017, stretching from Sydney's beachside Coogee to Marrickville in the inner west. Property prices began falling in mid-last year but over the past five years prices have risen about 70 per cent.\n\nSmith also owns a 10 per cent stake in Koala, an online furniture business he invested in about three years ago as he searched for start-ups to back. The company, which he has acted as an adviser to, promises to deliver its Brisbane-made Koala foam mattresses or sofas to consumers within four hours.\n\nThe ban cost Smith his place as the world's best test batsman, a position now held by India's Virat Kohll.", "description": "It's been the worst year of Steve Smith's life. But despite the career hardship, a series of off-field investments has left him in good shape.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_1%2C$multiply_0.4065%2C$ratio_1.777778%2C$width_1968%2C$x_32%2C$y_24/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/a3d9a6328534cd4e1c71dbb3d8ee1f6da7c0b898", "published_at": "2018-10-24"}