{"pub": "yahoo", "url": "https://news.yahoo.com/german-police-investigate-bitcoin-transfer-141217852.html", "downloaded_at": "2019-10-13 18:41:11.923514+00:00", "title": "German police investigate bitcoin transfer to synagogue killer", "language": "en", "text": "Stephan Balliet in a white overall is escorted by Police officers as he arrives at the federal prosecutor's office in Karlsruhe - AP\n\nGerman police are investigating a bitcoin transfer made to the far-Right extremist behind Wednesday’s terror attack in Halle to determine if the man possessed a broader support network.\n\nGerman media outlet Spiegel reports that a transfer of 0.1 bitcoin – approximately €750 (£660) – was made to alleged attacker Stephan Balliet in the lead up to the attack. Police said the transfer came from an unknown source.\n\nBalliet told police interrogators that he had received the money from someone whom he had communicated with on the internet, but that he did not know who they were.\n\nQuestions were raised as to how Balliet, who had been unemployed for a significant period of time in the lead up to the attack, was able to fund the attack, including buying the materials for his home-made weapons.\n\nAs reported by Spiegel, the man told investigators that the weapons were cheap to manufacture, primarily as he constructed them from basic raw materials.\n\nHe told police he bought steel worth €50, cartridge cases for €25 and a telescope for €20 to manufacture the weapons, which he based on designs released online by British pro-gun activist Philip Luty\n\n\"The further investigations will deal in particular with the question of whether other persons were involved in the act or its preparation alongside Stephan Balliet\", said a spokesman for the Federal Criminal Police Office.\n\nThe 27-year-old Balliet was active in far-Right chatrooms, with police suspecting he was radicalised online.\n\nBalliet uploaded a manifesto outlining his motives, details of his weapons and indications as to the nature of his plans in the lead up to the attack.", "description": "German police are investigating a bitcoin transfer made to the far-Right extremist behind Wednesday’s terror attack in Halle to determine if the man possessed a broader support network. German media outlet Spiegel reports that a transfer of 0.1 bitcoin – approximately €750 (£660) – was made to alleged", "authors": ["Daniel Wighton"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ATVtM6UdTNF4tMQoT6t6bA--~B/aD0xNTYzO3c9MjUwMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_258/f66a76cf79e039e79ed691799ac428ec", "published_at": "2019-10-13"}