{"pub": "yahoo", "url": "https://news.yahoo.com/thousands-march-independence-scottish-capital-160923027.html", "downloaded_at": "2019-10-05 22:59:50.634899+00:00", "title": "Tens of thousands march for independence in Scottish capital", "language": "en", "text": "The march set off from Holyrood Park and marched up the Royal Mile in the heart of the Scottish capital (AFP Photo/Andy Buchanan)\n\nEdinburgh (AFP) - Tens of thousands of Scottish independence supporters marched in Edinburgh on Saturday, as calls grow for a fresh vote on Scotland breaking away from the United Kingdom with Brexit scheduled for within weeks.\n\nThe demonstrators, many carrying Scottish flags, some wearings kilts and a few playing musical instruments -- including bagpipes -- set off from Holyrood Park in the heart of the Scottish capital.\n\nSome chanted \"What do we want? Independence\" as the throng of people made its way up the city's famous Royal Mile.\n\n\"Scotland is second class in this union,\" said Peter Johnston, 22, one of the organisers of the march.\n\n\"As an independent nation it will be world leading in many ways. In the United Kingdom we don't reach our full potential.\"\n\nAmong those present was lawyer and Scottish Nationalist (SNP) lawmaker Joanna Cherry, who was behind one of the successful legal challenges to Prime Minister Boris Johnson's decision to suspend parliament.\n\nShe was also one of the main backers of a law passed last month forcing Johnson to ask the European Union for more time to avoid crashing out of the EU without a deal.\n\n\"I'm sick of the Tory rule,\" said attendee Donna Barkley, 47, a bus driver. \"I'm sick of being told what to do... We need independence today.\"\n\nThe group organising Saturday's march, All Under One Banner, claimed more than 200,000 people turned out for the rally -- far exceeding their predictions.\n\nPolice Scotland did not give an estimate of the crowd's size.\n\nScotland voted against independence in a 2014 referendum by 55 percent.\n\nBut nationalists argue that the 2016 British referendum in favour of Brexit means another independence referendum is necessary -- because Scotland voted by 62 percent to stay in the European Union.\n\nScotland's First Minister Nicola Sturgeon, leader of the SNP, has argued that Brexit will devastate the economy.\n\nNationalists also argue that some people voted against independence thinking it would guarantee their place inside the EU.\n\n\"Scotland in particular has a lot of people coming from all over (the world) and everybody is pretty much unhappy with this situation,\" said Serena Micalizzi-Coyle, a 50-year-old tour operator on the march, referring to Britain's impending departure from the EU.\n\n\"This is a good day to demonstrate that we are united,\" she added.\n\nSturgeon, who wants a second independence referendum in 2021, was unable to attend the march, but tweeted a message of support.\n\n\"Be in no doubt - independence is coming,\" she said in the message.\n\nA small number of pro-Union protesters carrying Union Jack flags staged a counter-demonstration in central Edinburgh.", "description": "Tens of thousands of Scottish independence supporters marched in Edinburgh on Saturday, as calls grow for a fresh vote on Scotland breaking away from the United Kingdom with Brexit scheduled for within weeks.  Independence\" as the throng of people made its way up the city's famous Royal Mile", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/hW7Vae2n25s2bcYG1kBOZA--~B/aD01MTE7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/b50a27f0a0f6bf1ddb4204aaf335d539ff15d4a6.jpg", "published_at": "2019-10-05"}