{"pub": "yahoo", "url": "https://sports.yahoo.com/former-ufc-champ-luke-rockhold-132842638.html", "downloaded_at": "2019-10-20 16:59:52.118579+00:00", "title": "Former UFC champ Luke Rockhold might never fight again", "language": "en", "text": "Luke Rockhold - UFC fighter\n\nLuke Rockhold once stood at the pinnacle of mixed martial arts as the UFC middleweight champion. He now says there is the distinct possibility that he might never fight again.\n\nNearly four months removed from his last bout, Rockhold recently told ESPN, \"I have no interest in fighting right now,\" adding the chances of him never fighting again are very good.\n\nScroll to continue with content Ad\n\nRockhold first rose to prominence as the Strikeforce middleweight champion. He defeated Ronaldo \"Jacare\" Souza to earn the belt and then defended it against Keith Jardine and Tim Kennedy before making the move to the UFC.\n\nHe lost his first bout in the Octagon to Vitor Belfort. Rockhold rebounded with a five-fight winning streak that culminated in taking the UFC middleweight title from Chris Weidman.\n\nHis reign didn't last long as Michael Bisping knocked Rockhold out in his first title defense. That was the first fight in a three-year stretch that saw Rockhold lost three out of four bouts, including a July 2019 loss to Jan Blachowicz, Rockhold's light heavyweight debut.\n\nTRENDING > UFC on ESPN 6: Dominick Reyes vs. Chris Weidman recap video\n\nAdd to the rough patch the fact that Blachowicz broke his jaw in their UFC 239 bout, and Rockhold can't really be faulted for focusing his attention elsewhere.\n\nWith a modeling career that includes campaigns for the like of Polo Ralph Lauren, a movie role on tap, offers to compete in grappling matches, and other business endeavors, Rockhold isn't overly tempted to return to the Octagon any time soon... if ever.", "description": "Luke Rockhold once stood at the pinnacle of mixed martial arts as the UFC middleweight champion. He now says there is the distinct possibility that he might never fight again.Nearly four months removed from his last bout, Rockhold recently told ESPN, \"I have no interest in fighting right now,\"", "authors": ["Mmaweekly.Com Staff"], "top_image": "https://s.yimg.com/ny/api/res/1.2/238J3w4a2FPna7qgtSmXtQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD02MzEuNDY2NjY2NjY2NjY2Nw--/https://s.yimg.com/uu/api/res/1.2/8v9pxsEE9Xvt08EVw8MMYw--~B/aD0zNzA7dz03NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/mmaweekly.com/8c770c477817339cd33b70b2abe14ea9", "published_at": "2019-10-20"}