{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/20/schmidt-leaves-irish-in-good-place-despite-quarter", "downloaded_at": "2019-10-20 08:17:50.760565+00:00", "title": "Schmidt leaves Irish in good place despite quarterfinal exit", "language": "en", "text": "The pause in play is an ideal time for fresh rapid-fire instructions from the coaches’ box.\n\nJoe Schmidt had nothing to say.\n\nComing up to halftime in the Rugby World Cup quarterfinal, Schmidt the taskmaster, the meticulous planner, the man who can easily rattle off a 500-word answer to a five-word question, had a thousand-yard stare going on from high up in Tokyo Stadium on Saturday night.\n\nHe was shocked and speechless at the sight of four years of planning being shredded by defending champion New Zealand 46-14.\n\nSchmidt sent out his most experienced Ireland lineup. A dozen of the starters beat the All Blacks less than a year ago. The preparation week was one of the best, and had the players buzzing. “I wouldn’t change anything,” lock James Ryan said.\n\nBut they hadn’t counted on change by the All Blacks, who invariably raise the bar in response to infrequent defeat.\n\nFailing a second time to lead Ireland to a first Rugby World Cup semifinal will haunt Schmidt, who steps down as coach following six transformative years.\n\nBut the New Zealander’s legacy from a decade in Ireland is a far greater parting gift. His impact has been cultural, not just technical.\n\nHired after guiding Leinster province to consecutive European club crowns, Schmidt’s biggest achievement was to turn the Irish back into believers and winners. No longer do they go into tournaments thinking they might win. They believe they will, and they have.\n\nFullback Rob Kearney spoke for the team when he said, “Deep down in the back of your mind there’s always this little voice that’s chatting away to you if you haven’t achieved something. We’d been saying for the best part of 10 years that as an Ireland team we could beat the All Blacks, but until you actually achieve it, you never 100% believe it.”\n\nOn Schmidt’s watch, Ireland climbed that Everest in 2016, ending 111 years of failure. Just to prove it was no fluke, they beat the All Blacks again in 2018. Other milestones included a first win over the Springboks in South Africa, and a first series win in Australia since 1979. At home, Ireland won three Six Nations, including a third ever Grand Slam, in their best run since the early 1980s. They rose to No. 1 in the rankings for the first time.\n\nBut those were the achievements on TV. Schmidt was tireless behind the scenes. He took his job title literally by accepting invites to clubs and schools all over the island. Always dignified, he gave inspiring talks and left positive impressions on people, even those who didn’t follow rugby.\n\nHe would turn up without fanfare at age-grade and club games. He offered detailed advice to players who weren’t even in the national squad, and generally demanded improvement from everyone.\n\nHis style is heavily structured. Every player is drilled to fit into a micro-managed game plan. Mistakes aren’t tolerated.\n\n“He can talk your head off, he’s generous with time, but in the dressing room is absolutely ruthless,” retired captain Brian O’Driscoll said. “The smile comes in different forms. In one of my first trainings, a player passed at my ankles and I dropped it. And Joe said, ‘Good players take them.’ The boys thought that was brilliant, so they used to fire passes down at my ankles all the time.”\n\nSchmidt’s style isn’t for everyone’s taste, but his record makes him one of the modern coaching greats. And it was all an accident, to his way of thinking.\n\nWhile teaching at Palmerston North Boys’ High School in New Zealand, Schmidt wanted to coach basketball. The head of a school which has produced 14 All Blacks liked the idea. But the rector said basketball was on Friday nights, which freed Schmidt on Saturdays to coach rugby.\n\n“I’m my own worst enemy when it comes to working,” Schmidt said when he announced last November his intention to step down as coach after this Rugby World Cup.\n\n“I tend to be a little bit of a workaholic and so if there’s a competitive advantage that I can find that I can help players attain then I’m going to be looking as hard as I possibly can. And that means that I’m out of the house a fair bit, or even at home I’m plugging away, looking at things with a microscope. So that’s probably a character flaw. If you probably talk to some of the people on the staff, it’s one of many I have.”\n\nBeside an intense attention to detail, Schmidt is renowned for concocting set-play moves, and Jacob Stockdale’s winning try against New Zealand in 2018 made even the All Blacks admit they were outfoxed.\n\nBut the All Blacks also warned Schmidt after that win capped the greatest year in Irish rugby history, that it was harder to be the hunted than the hunter. England coach Eddie Jones piled on the warnings by saying, “Praise makes you weak,” and Ireland was weak all of this year, struggling to score and plagued by injuries.\n\nTypically, Schmidt engineered a seamless transition for the coaching reins. Andy Farrell, his defense coach since 2016, will take over.\n\nSchmidt said after the quarterfinal defeat, “All I can do is work as hard as I can and try to help the players develop as best they can, and try to build the collective as strong as it can be. So it is disappointing to finish on a note that doesn’t represent how, I believe, how far we’ve come. We’ve scaled a number of challenges, this is the only one we haven’t. Andy Farrell, at least he’ll have something to aim up for in four years’ time and I’m sure he’ll do a super job.”\n\nSchmidt, who added Irish citizenship in 2015 to his Kiwi one, said he will remain in Ireland and spend time on family projects while he takes a 12-month break from coaching, although his wife, Kellie, quipped he would probably last 12 days.\n\n“I’ve had an incredibly planned life for so many years,” the 54-year-old Schmidt said. “So I’m kind of looking forward to having 12 months where I can just invest that energy in one direction and also not have a daily itinerary or a weekly plan.”\n\n___\n\nMore AP Rugby World Cup: https://www.apnews.com/RugbyWorldCup and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The pause in play is an ideal time for fresh rapid-fire instructions from the coaches' box.", "authors": ["The Washington Times Http", "Foster Niumata"], "top_image": "", "published_at": "2019-10-20"}