{"pub": "yahoo", "url": "https://news.yahoo.com/will-killing-al-baghdadi-boost-trump-in-2020-150258571.html", "downloaded_at": "2019-10-28 23:35:48.378882+00:00", "title": "Will killing al-Baghdadi boost Trump in 2020?", "language": "en", "text": "Welcome to 2020 Vision, the Yahoo News column covering the presidential race with one key takeaway every weekday and a wrap-up each weekend. Reminder: There are 98 days until the Iowa caucuses and 372 days until the 2020 election.\n\nIt’s a tale as old as time. Struggling in the polls, a president seizes on an overseas triumph to change the subject and improve his political fortunes.\n\nBy the end of April 2011, Barack Obama’s approval rating had fallen to the lowest level of his presidency: 43 percent, according to Gallup, with 48 percent disapproving. Unemployment was at 9 percent. Gas prices were soaring. Seventy percent of Americans were saying the country was on the wrong track. A battle over debt and deficits was looming. And Republican presidential hopefuls were attacking him as “an indecisive leader, incapable of handling rapidly evolving events around the world.”\n\nThen, on May 2, Obama announced that after a decade-long manhunt, Navy SEALs had killed al-Qaida leader and 9/11 mastermind Osama bin Laden during a daring raid on his fortified compound in Abbottabad, Pakistan.\n\nObama’s approval rating immediately shot up above 50 percent for the first time in 14 months. His disapproval rating fell to 40 percent, its lowest level since the first year of his presidency. Even Republicans praised him.\n\n“I admire the courage of the president,” said former New York Mayor and GOP presidential candidate Rudy Giuliani.\n\n“I want to personally congratulate President Obama,” added “Apprentice” star Donald Trump, then flirting with a presidential run of his own.\n\nWith his announcement Sunday that an elite Special Ops team had killed Islamic State leader Abu Bakr al-Baghdadi, President Trump is clearly hoping for a similar boost — a reprieve from the impeachment inquiry and the bipartisan assault on his Middle East policy that have been bedeviling him at home.\n\nPresident Trump; Abu Bakr al-Baghdadi. (Photos: Manuel Balce Ceneta/AP, Islamic State Group/Al Furqan Media Network/Reuters TV via Reuters) More\n\nBut Trump is not Obama, and his uniquely polarized standing with the American public — not to mention his own, very Trumpian handling of the al-Baghdadi incident — could complicate hopes for a political payoff.\n\nThe former was on vivid display Sunday night during Game 5 of the World Series at National Park in Washington, D.C. Just hours after Trump told the nation about al-Baghdadi’s death, he stood and waved to the crowd from his lower-tier box to the left of home plate. As the Jumbotron cut from a feed of U.S. service members to an image of the president, the stadium stopped cheering and started booing. Some chanted, “Lock him up!” Cheering resumed as soon the military men and women reappeared onscreen.\n\nThe harsh welcome reflects a larger pattern: No matter what happens, whether it’s good or bad for Trump, his approval rarely budges. Look at historical graphs of presidential approval and disapproval; the lines are all over the place, rising and falling in concert with events. Not Trump’s. Since May 2018, his disapproval has never slipped below 51 percent and never topped 56 percent; his approval has been stuck between 39 and 43 percent. Americans know how they feel about the president, and nothing seems to change their minds.\n\nTrump’s unique approach to the presidency has a lot to do with this. Unlike any of his modern predecessors, Trump seems uninterested in capitalizing on shared national moments to unite Americans; he’d rather use them to aggrandize himself. This impulse was also on display Sunday during his televised address — teased the night before with a tweet that “Something very big has just happened!” — as the president quickly deviated from his prepared remarks to suggest that al-Baghdadi’s killing was bigger than bin Laden’s and to complain (falsely) that “nobody listened” when he warned America about the al-Qaida leader in 2000. Trump went on to describe al-Baghdadi as “screaming, crying and whimpering” when he “died like a dog,” prompting questions about whether he was exaggerating, given that there was no live audio of the raid.", "description": "It’s a tale as old as time. Struggling in the polls, a president seizes on an overseas triumph to improve his political fortunes. Will it work for Trump?", "authors": ["Andrew Romano", "West Coast Correspondent"], "top_image": "https://s.yimg.com/uu/api/res/1.2/CiSY60CZdBR2s9DaoXN7AA--~B/aD03NTY7dz0xNDA0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/27cf9340-f991-11e9-bddb-714cea5a477e", "published_at": "2019-10-28"}