{"pub": "independent", "url": "https://independent.co.uk/news/uk/home-news/ivory-trade-law-antiques-dealers-elephants-court-case-a9152836.html", "downloaded_at": "2019-10-12 11:19:17.276818+00:00", "title": "Antiques dealers fight to reverse UK’s new ban on ivory trade in defence of ‘freedom to enjoy personal property’", "language": "en", "text": "Antiques dealers are attempting to overturn the UK’s new ban on trading in ivory in a legal case being seen as a critical battle for African elephants.\n\nA group of dealers and collectors say the crackdown breaches their “fundamental rights and freedom” to enjoy their personal property.\n\nBut critics say if their legal challenge succeeds, it will gift a loophole to illegal traffickers to exploit – giving a green light to poachers.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nInvestigators have long said that gangs disguise tusks from newly killed elephants as antique to get around trading bans, so the exemption for older artefacts still effectively supports hunting.\n\nUnder the new law, trading in all worked ivory is being halted including items that pre-dated 1947, which previously could be legally bought and sold.\n\nShape Created with Sketch. Protesters demand a UK ban on imports of 'trophy hunt' animal parts Show all 15 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Protesters demand a UK ban on imports of 'trophy hunt' animal parts 1/15 Lobbying for a ban on imports of hunted wildlife parts It's estimated an elephant is killed every 20 or 25 minutes on average in Africa Paul Nicholls 2/15 Lobbying for a ban on imports of hunted wildlife parts Broadcaster Nicky Campbell spoke passionately against trophy hunting and legal imports of animal parts Paul Nicholls 3/15 Lobbying for a ban on imports of hunted wildlife parts Protesters at the fifth annual Global March for Elephants and Rhinos in London marched through central London Paul Nicholls 4/15 Lobbying for a ban on imports of hunted wildlife parts Thousands of people joined the fifth annual Global March for Elephants and Rhinos in London Paul Nicholls 5/15 Lobbying for a ban on imports of hunted wildlife parts Stanley Johnson, father of Boris Johnson, is a passionate supporter of the campaign to save elephants and rhinos from extinction Paul Nicholls 6/15 Lobbying for a ban on imports of hunted wildlife parts Protesters at the fifth annual Global March for Elephants and Rhinos in London called for a UK ban on trophy imports Paul Nicholls 7/15 Lobbying for a ban on imports of hunted wildlife parts Thousands of protesters at the Global March for Elephants and Rhinos marched to Downing Street Paul Nicholls 8/15 Lobbying for a ban on imports of hunted wildlife parts Some protesters in London against trophy hunting dressed in wildlife costumes Paul Nicholls 9/15 Lobbying for a ban on imports of hunted wildlife parts Campaigners fear elephants, rhinos and lions will become extinct if trophy hunting continues Paul Nicholls 10/15 Lobbying for a ban on imports of hunted wildlife parts Protesters at the fifth annual Global March for Elephants and Rhinos in London against trophy hunting marched through central London Paul Nicholls 11/15 Lobbying for a ban on imports of hunted wildlife parts Some protesters in London against trophy hunting dressed in wildlife costumes Paul Nicholls 12/15 Lobbying for a ban on imports of hunted wildlife parts Protesters at the fifth annual Global March for Elephants and Rhinos in London called for a UK ban on trophy imports Paul Nicholls 13/15 Lobbying for a ban on imports of hunted wildlife parts Protesters stopped traffic as they marched through London Paul Nicholls 14/15 Lobbying for a ban on imports of hunted wildlife parts Campaigners fear elephants, rhinos and lions will become extinct if trophy hunting continues Paul Nicholls 15/15 Lobbying for a ban on imports of hunted wildlife parts Palmerston the cat joined Denise Dresner, of Action for Elephants, John Stevenson, of Stop Ivory, actor Peter Egan, Cordelia Britton, of Four Paws, Mark Jones, of Born Free and Eduardo Goncalves, of the Campaign to Ban Trophy Hunting, as they delivered a letter to Downing Street Paul Nicholls 1/15 Lobbying for a ban on imports of hunted wildlife parts It's estimated an elephant is killed every 20 or 25 minutes on average in Africa Paul Nicholls 2/15 Lobbying for a ban on imports of hunted wildlife parts Broadcaster Nicky Campbell spoke passionately against trophy hunting and legal imports of animal parts Paul Nicholls 3/15 Lobbying for a ban on imports of hunted wildlife parts Protesters at the fifth annual Global March for Elephants and Rhinos in London marched through central London Paul Nicholls 4/15 Lobbying for a ban on imports of hunted wildlife parts Thousands of people joined the fifth annual Global March for Elephants and Rhinos in London Paul Nicholls 5/15 Lobbying for a ban on imports of hunted wildlife parts Stanley Johnson, father of Boris Johnson, is a passionate supporter of the campaign to save elephants and rhinos from extinction Paul Nicholls 6/15 Lobbying for a ban on imports of hunted wildlife parts Protesters at the fifth annual Global March for Elephants and Rhinos in London called for a UK ban on trophy imports Paul Nicholls 7/15 Lobbying for a ban on imports of hunted wildlife parts Thousands of protesters at the Global March for Elephants and Rhinos marched to Downing Street Paul Nicholls 8/15 Lobbying for a ban on imports of hunted wildlife parts Some protesters in London against trophy hunting dressed in wildlife costumes Paul Nicholls 9/15 Lobbying for a ban on imports of hunted wildlife parts Campaigners fear elephants, rhinos and lions will become extinct if trophy hunting continues Paul Nicholls 10/15 Lobbying for a ban on imports of hunted wildlife parts Protesters at the fifth annual Global March for Elephants and Rhinos in London against trophy hunting marched through central London Paul Nicholls 11/15 Lobbying for a ban on imports of hunted wildlife parts Some protesters in London against trophy hunting dressed in wildlife costumes Paul Nicholls 12/15 Lobbying for a ban on imports of hunted wildlife parts Protesters at the fifth annual Global March for Elephants and Rhinos in London called for a UK ban on trophy imports Paul Nicholls 13/15 Lobbying for a ban on imports of hunted wildlife parts Protesters stopped traffic as they marched through London Paul Nicholls 14/15 Lobbying for a ban on imports of hunted wildlife parts Campaigners fear elephants, rhinos and lions will become extinct if trophy hunting continues Paul Nicholls 15/15 Lobbying for a ban on imports of hunted wildlife parts Palmerston the cat joined Denise Dresner, of Action for Elephants, John Stevenson, of Stop Ivory, actor Peter Egan, Cordelia Britton, of Four Paws, Mark Jones, of Born Free and Eduardo Goncalves, of the Campaign to Ban Trophy Hunting, as they delivered a letter to Downing Street Paul Nicholls\n\nAntiques lobbyists who want to continue dealing in pre-1947 ivory are challenging the ban in a judicial review in the High Court next week, arguing it is incompatible with EU law.\n\nThe Friends of Antique Cultural Treasures company (Fact) says the ban takes away the level playing field as the rest of the EU still permits an ivory trade, although the European Commission is considering a ban in line with the UK’s.\n\nThe group also says the ban amounts to “severe interference with fundamental rights and freedom” to enjoy their personal property.\n\nThe UK is the world’s largest exporter of legal ivory, in particular, selling to the hot spots of Hong Kong and China, according to the Environmental Investigation Agency.\n\nBut the Ivory Act, seen as one of the world’s toughest clampdowns on ivory sales, was passed in December and is due to take effect later this year.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nThe bill was passed with an overwhelming cross-party majority after more than 88 per cent of respondents to a government consultation backed greater curbs.\n\nActivists from the UK-based Action for Elephants (AfE) group say the antiques dealers are flying in the face of huge public and political support for the ban.\n\n“This degree of support for an ivory ban sent the message loud and clear that saving elephants is what matters to the British public, not a tainted trade in ivory ornaments. But to this day, the antiques dealers haven’t got this message,” said Denise Dresner of AfE.\n\n“Unfortunately, elephants don’t have any rights that are recognised in law – not even the right to not be killed and have their tusks hacked off – but they have a moral right to life and to survival.\n\n“It’s taken years of unrelenting pressure, campaigning and public activism to achieve an ivory ban in the UK, and a very robust one at that.”\n\nNo cultural treasures would be harmed by the law, she added.\n\nThe activists will protest outside the High Court before Wednesday’s hearing.\n\n“The decision of a single judge could potentially undo years of campaigning and reject the overwhelming public demand for this ivory ban,” Ms Dresner added.\n\nIn 1989 Convention on International Trade in Endangered Species granted elephants the highest level of protection, banning international ivory trade.\n\nAs a result, poaching subsided and ivory prices tumbled.\n\nBut the ban allowed trade in pre-1947 antique ivory to continue, along with domestic ivory markets.", "description": "Antiques dealers are attempting to overturn the UK’s new ban on trading in ivory in a legal case being seen as a critical battle for African elephants. A group of dealers and collectors say the crackdown breaches their “fundamental rights and freedom” to enjoy their personal property. But critics say if their legal challenge succeeds, it will gift a loophole to illegal", "authors": ["Jane Dalton"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/11/20/ivory.jpg", "published_at": "2019-10-12"}