{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/26/adam-silver-nbas-stricter-tampering-rules-fans-were-losing-confidence-our-system", "downloaded_at": "2019-09-26 23:46:37.615508+00:00", "title": "Adam Silver on NBA’s stricter tampering rules: Fans ‘were losing confidence in our system’", "language": "en", "text": "\n\nNBA Commissioner Adam Silver and Ted Leonsis of the Wizards, pictured in 2018, sat on a panel with union chief Michele Roberts on Thursday. (Toni L. Sandys/The Washington Post)\n\nTed Leonsis was in the room last week when the NBA Board of Governors unanimously approved stricter financial penalties for tampering. Though he would like to see the rules enforced, the Washington Wizards managing partner wouldn’t mind being a target of rivals.\n\n“I think the rules are in place so that if you’re doing the right things in the right way and you’re trying to build a program and build your team as a destination, if someone’s cheating, going on the side, I’d like there to be compliance. Because we’re working really, really hard to do that for the Washington Wizards,” Leonsis said Thursday.\n\nThen, he smirked.\n\n“At the same time, I’d like to be good enough to be tampered with,” he said, generating laughter inside the packed auditorium of the Harman Center for the Arts in Washington. Leonsis was speaking on an Atlantic Festival panel alongside NBA Commissioner Adam Silver and Michele Roberts, the executive director of the National Basketball Players Association.\n\n[Wizards head into training camp with injuries, but see opportunity]\n\nThe trio addressed myriad topics affecting the league, but on tampering, which Silver and the Board of Governors took on during a Sept. 20 meeting, the three expressed contrasting opinions on whether the issue has gotten out of hand. They agreed on at least one thing: rules should be followed.\n\n“What we were hearing back from our fans was that to a certain extent, they were losing confidence in our system and at the end of the day, that’s part of what we’re selling. It’s a competition but along a set of rules,” Silver said. “There was a sense in fans from many markets that if you weren’t violating the rules, you were at a disadvantage in terms of signing players.”\n\nThis summer, the issue reached a tipping point ahead of the free agency period. Per league rules, teams, agents and players were barred from negotiating until free agency officially opened at 6 p.m. Eastern time on June 30, yet many deals were reported before the clock started. About $3 billion in contracts were agreed upon on the first day, and the reported early agreements signaled that many teams, players and their representatives had engaged in discussions in violation of the rules.\n\nUnder the recently adopted guidelines, the NBA league office has the power to suspend executives, void contracts, take away draft picks and fine a team up to $10 million if it is caught violating the league’s tampering rules. The maximum fine amount was raised from $5 million.\n\nSilver used a speed limit metaphor to reiterate his stance about the fans’ perception of unfairness.\n\n“We now saw some activity over this past summer that was well into the 70s, if it was a 55-mph speed limit. And where was the league?” said Silver, who also expressed that tampering hurts those free agents who play by the rules only to discover that some salary cap money has dried up before before the legitimate negotiating period had begun.\n\nWhile Roberts agrees with the “culture of compliance” that Silver seeks to push, she doesn’t believe the league should have a rule in place limiting when contract discussions can start.\n\n“I do agree that, I think, it’s gotten a little bit more out of control in only the four years, five years that I’ve been there,” said Roberts, who became head of the NBPA in 2014. “There should be rules against tampering if there is a rule restricting when teams and players can begin contract negotiations. I understand the reason for why we restrict when contract negotiations can commence. I disagree with the rule. But if the rule is there … then I completely, completely agree it should be enforced.”\n\nRead more:\n\nNew GM Tommy Sheppard seeks players who will follow ‘The Wizards Way’\n\nScott Brooks and 4 other NBA coaches who could soon be on the hot seat\n\nNBA fines Bucks for tampering with Giannis Antetokounmpo, who is on the Bucks\n\nTrump teases that he’d like to visit India to watch an NBA game next month\n\nAfter free agency free-for-all, NBA implements stiffer tampering rules", "description": "The NBA commissioner discussed tampering on a panel alongside Wizards owner Ted Leonsis and Michele Roberts, the executive director of the National Basketball Players Association, on Thursday.", "authors": ["Candace Buckner", "National Basketball Association With An Emphasis In Covering The Washington Wizards.", "September At Pm", "Candace Buckner Covers The Washington Wizards. Before Joining The Post In", "Buckner Was A Sports Reporter At The Indianapolis Star."], "top_image": "https://www.washingtonpost.com/resizer/5WNUirFcQ9GF_m0No85X0Ubdssw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NMITDBG7Y4I6RC5MX7QB7TODUY.jpg", "published_at": "2019-09-26"}