{"pub": "businessinsider", "url": "https://businessinsider.com/trump-turnberry-airport-glasgow-prestwick-air-force-2019-9", "downloaded_at": "2019-09-10 07:44:06.101714+00:00", "title": "Trump's ties to Scotland airport are getting a closer look after military personnel stayed at Turnberry golf resort", "language": "en", "text": "President Donald Trump and the Trump Organization's ties to a local airport in Scotland began resurfacing three days after Air Force service members were discovered to have stayed at the Trump Turnberry resort during international trips.\n\nScottish government records first reviewed by The Scotsman investigative reporter Martyn McLaughlin and later The New York Times, showed that the Trump Organization lobbied airport officials to have Trump Turnberry — the scenic golf resort purchased and renovated for an estimated total of $200 million in 2014 — a destination target for travelers who flew into the publicly-owned Glasgow Prestwick Airport. (The airport was put up for sale by the government earlier this year.)\n\nA partnership between the Trump Organization and Glasgow Prestwick was later struck in 2014 to increase air traffic in the area. The Trump Organization lobbied to get its resort on a list of hotels that the airport would refer its aircrews to — despite it being a little over 20 miles away and with pricier rates, according to The Times.\n\nAt a press conference at the airport in 2014, Trump boasted \"hundreds\" of flights to pass through after his resort's purchase.\n\n\"We are going to make this really successful,\" Trump said at the time. \"You are going to get a lot of business.\"\n\nThe documents bring a renewed light on the extent of the relationship between the airport and the Trump Organization.\n\nRead more: Trump reportedly wanted to show off his negotiation skills by inviting the Taliban to Camp David\n\n\"As a list of hotels that we use for our business, being honest, Turnberry was always last on the list, based on price,\" Glasgow Prestwick manager Jules Matteoni wrote in an email to Trump Turnberry executives in 2015. \"Yesterday's proposal places Turnberry in a favorable position and gives us food for thought in our placement of crews moving forward.\"\n\n\"We will be working with them over the coming weeks to explore where their considerable influence may assist opportunities for mutual benefit,\" former Glasgow Prestwick Airport CEO Iain Cochrane said in another email in 2014.\n\nThe Defense Department and Glasgow Prestwick executives said the airport had a separate deal with the Air Force, one in which the airport would refuel US military planes and assist in obtaining lodging for its crew members.\n\nThe airport provided incentives at Turnberry for civilian travelers and US service members, including free rounds of golf, according to a previous Guardian report.\n\nTrump Turnberry is under scrutiny after Politico first reported that Air Force National Guard crew members were discovered to have made stops during their trips to the Middle East in 2018. Additional Politico reporting revealed that Air Force service members made two additional trips to the resort, bringing the total to at least four.\n\nThe House Oversight Committee reportedly launched an investigation into the matter, which is part of a broader look into the military's spending near the president's resort. Democratic Rep. Elijah Cummings of Maryland, the committee's chairman, probed the Pentagon on \"potential conflicts of interests,\" according to a June letter addressed to then-acting Defense Secretary Patrick Shanahan.\n\nThe Air Force said in a statement to The Times that a contractor informed at least one crew that \"there wasn't a room available closer\" to the airport. In a separate statement, the Air Force claimed that the crew members were lodged at the \"least expensive accommodations ... within the crews' allowable hotel rates.\"\n\n\"While we are still reviewing the trip records, we have found nothing that falls outside the guidelines associated with selecting stopover airports on travel routes and hotel accommodations for crew rest,\" the Air Force said in a statement to Politico.\n\nMcLaughlin, the investigative reporter, also noted that the US military had a presence at Glasgow Prestwick for decades, before Trump was in office. But he added that fuel sales jumped from roughly $1.48 million in 2016 to $3.57 million the next year.\n\nA spokesman for Glasgow Prestwick downplayed any significance stemming from Trump Turnberry's association with the airport.\n\n\"Like all airports, we provide a full handling service for customers and routinely arrange overnight accommodation for visiting aircrew when requested,\" he said in Politico. \"We use over a dozen local hotels, including Trump Turnberry, which accounts for a small percentage of the total hotel bookings we make.\"\n\nTrump denied any knowledge of Air Force crew members who landed at Glasgow Prestwick and stayed at Trump Turnberry: \"I know nothing about an Air Force plane landing at an airport (which I do not own and have nothing to do with) near Turnberry Resort (which I do own) in Scotland, and filling up with fuel, with the crew staying overnight at Turnberry (they have good taste!),\" Trump tweeted Monday morning.", "description": "\"We are going to make this really successful,\" Trump said in 2014. \"You are going to get a lot of business.\"", "authors": ["David Choi"], "top_image": "https://amp.businessinsider.com/images/5cb6732ff599b613ff636704-1536-768.jpg", "published_at": "2019-09-10"}