{"pub": "businessinsider", "title": "Oil tumbles into a bear market as recession fears rage (WTI)", "url": "https://markets.businessinsider.com/commodities/news/oil-price-slides-into-bear-market-global-slowdown-recession-concerns-2019-8-1028428222", "language": "en", "published_at": "2019-08-10", "downloaded_at": "2019-09-02 07:34:48.659172+00:00", "text": "Reuters\n\nA surprise increase in American oil stockpiles added fuel to fears of a global recession.\n\nFutures fell as much as 5.8% to a seven-month low on Wednesday, pushing the resource into bear market territory.\n\nUS-China trade tensions have overtaken threats of supply disruption in the Persian Gulf as the biggest headwind to oil.\n\nWatch oil trade live on Markets Insider.\n\nTrade tensions and fear of a global recession has been a drag on oil prices, even during peak season for demand.\n\nFutures fell as much as 5.8% Wednesday to seven-month lows after American crude stockpiles posted a surprise increase. The loss sent the resource tumbling into bear market territory. Having extra supply dilutes prices, while fears of a global recession added to worries that demand may slow.\n\nGlobal recession fears were sparked Wednesday when New Zealand, India, and Thailand all cut rates following the US's own rate cut in July. Global stocks and commodities slid in early trading while bonds and other safe-haven assets such as gold rallied. Even bitcoin rose over $12,000 briefly Wednesday, breaching the level for a second time in three days.\n\nMarkets Insider is looking for a panel of millennial investors. If you're active in the markets, CLICK HERE to sign up.\n\nUS domestic crude inventories grew by 2.39 million barrels last week, ending a seven-week long stretch of declines, Bloomberg reported. Gasoline stockpiles also grew by 4.4 million barrels, which surprised the industry as it is currently peak demand season — which usually means there isn't extra gasoline to stockpile.\n\nBrent crude October futures lost as much as 5.2% to $55.88 a barrel, and prices have decreased more than 20% since their year-to-date peak in April. Meanwhile, US West Texas Intermediate crude futures also slid as much as 5.8% to $50.52 a barrel.\n\nOil has plunged this month as trade tensions between the US and China escalated, overshadowing fears that disruptions in the Persian Gulf would be the biggest negative impact. There's increased speculation that China will start avoiding American oil as trade tension escalates, according to Bloomberg.\n\nMarkets Insider", "description": "A surprise increase in American oil stockpiles added fuel to fears of a global recession.  Futures fell as much as 5.8% to a seven-month low on Wednesday,...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d4810cb100a244343660302-2384/2019-08-05t111647z3lynxnpef7402wrtroptp4global-oil.jpg"}