{"pub": "cbc", "url": "https://cbc.ca/news/business/small-town-tech-1.5288205", "downloaded_at": "2019-09-22 15:24:12.067772+00:00", "title": "Why small-town tech firms may have an advantage when it comes to attracting talent | CBC News", "language": "en", "text": "Greg Malpass grew up in picturesque Nelson, B.C., a town of around 10,000 nestled in the Selkirk Mountains along Kootenay Lake.\n\nKnown for its skiing and hiking, as well as its vibrant arts scene and eclectic array of cafés, stores and microbreweries, it's the kind of small town where city-weary people dream of living — if only they could find a job.\n\nOriginally settled during a gold and silver mining boom, Nelson has suffered at times from the ups and downs of its resource-dependent local economy. It became a place that lost its younger folk to bigger cities with more opportunity, Malpass among them.\n\n\"Just like any other ambitious kid, I kind of needed to get out of there to follow my career hopes and aspirations,\" he said.\n\nMalpass went to Simon Fraser University in the Vancouver area, intending to return when he graduated. \"But it became obvious that unless I was going to be a doctor, lawyer or accountant, there wasn't a lot of professional career opportunities for me back there.\"\n\nInstead he worked in Toronto for a few years, then Vancouver, where he eventually started a consultancy that has since grown into tech company Traction on Demand. It employs more than 750 people supplying cloud-based applications for use with the popular customer relations platform Salesforce.\n\nBut this year, Malpass was able to fulfil his dream of returning to his hometown, establishing a satellite office in Nelson that will eventually be home to 45 employees.\n\nHe's one of a growing number of tech founders choosing to locate offices in smaller Canadian towns and cities, addressing the desire of employees to find work in communities they can afford.\n\nAlong with the local governments, colleges and universities with whom they partner, these companies are taking steps to spread the wealth, countering what economists say is part of Canada's digital divide — the chasm between those who have access to big-city tech jobs and those who do not.\n\nMaking a tech-friendly town\n\nAs executive director of Community Futures Central Kootenay, a local non-profit economic development organization, Andrea Wilkey helps nurture Nelson's community of tech and knowledge workers.\n\nMonthly tech meetups bring people together, and free or low-cost courses at the library and community centre ensure kids get a chance to learn to code. Developers who wish to build new housing in the area have to guarantee high speed internet access.\n\nIt's all part of ensuring the town isn't too dependent on natural resources, and instead can provide access to jobs in the digital economy — along with a good lifestyle. In addition to Traction, the Kootenays are now home to a number of other tech companies and their satellites, including Retreat Guru, Smrt1 Technologies, Thought Exchange and CoreLogic.\n\nElsewhere in B.C., tech companies are thriving in places like Kelowna and Vernon in the Okanagan, and in small centres on Vancouver Island, including Qualicum Beach, Courtenay and Duncan.\n\n\"Now's a great time to be growing the tech sector in rural B.C.,\" said Wilkey. \"As the cost of living and housing in major centres becomes increasingly prohibitive, … rural communities have an opportunity to bring new jobs to their region and residents to have a great place to work and live.\"\n\nMalpass purchased this large historic building in Nelson, B.C., as the local Legion was struggling to maintain it. Traction is refurbishing some of the space for their new local office and will give the Legion an indefinite lease. (Traction on Demand)\n\nAnother upside for Malpass and other tech leaders setting up shop in smaller centres: being able to retain workers who might otherwise be driven away by high housing costs.\n\nAs Traction employees entered their 30s and started to think about putting down roots, Malpass said the company started to see \"capable, great employees that have grown up with us start moving.\"\n\nSome went to Vancouver Island, others to the B.C. Interior. All told, 15 people left Vancouver in a short time.\n\nMalpass said that got him thinking: \"Why can't we bring great jobs to these great livable communities?\"\n\nTraction program architect Emily Beach raised her hand right away when Malpass first started talking about a Nelson office.\n\n\"One of the things I love most in life is being outdoors,\" said Beach. \"I've always looked at people who live in places like Nelson or Pemberton and thought, 'What do you do here? What is allowing you to live in a place like this that you have everything that I want around you — tight-knit community, as well as being in this beautiful environment?'\"\n\nTraction on Demand employees from the Nelson office enjoy a hike and beer. From left to right: Emily Beach, Liam Maley, Todd Cutler and Chris Shinnimin. (Traction on Demand)\n\nEverything started falling into place when Malpass learned that Nelson's local Legion was having a difficult time maintaining its large historic building. He purchased the building, gave the Legion an indefinite lease, and is now renovating the space that will be Traction on Demand's future hometown office.\n\nBeach moved to Nelson in April and is leading a team of seven in a temporary space. Some of the new staffers are locals who previously worked in other tech jobs, and some have no background in technology, including one who worked as a project manager for a paving company.\n\nOn the other side of the country, Mike Johnston's company, REDspace, also has its origins in him wanting to return to home turf. Born and raised in Truro, N.S., Johnson studied sciences at Harvard, then worked in tech in the Boston area until the dot-com bubble burst in 2000.\n\nBy then, he was married to his high school sweetheart, who'd recently given birth to their first child; the two decided to try their hand at launching a business north of the border.\n\nMike Johnston, founder and CEO of REDspace, a company that builds video-streaming technology in the Halifax suburb of Bedford, said being located there has turned out to be an asset. (Chris Toms)\n\nThings have come along way since Johnston first installed a satellite dish on the roof of their home in Hammonds Plains, on the outskirts of Halifax, in order to get the internet connection he'd need to do some IT consulting from the spare bedroom.\n\nNow headquartered in the Halifax suburb of Bedford, REDspace employs about 200 people who build streaming video technology for television networks.\n\n\"We're finding an increasing interest in people who are looking for a change from the city grind. They're interested in being able to afford a house or have a kayak and go hiking.\"\n\nImporting young people\n\nOnce known for exporting its young people to other parts of Canada, he said the region is doing a much better job of giving locals and students from the area's colleges and universities a reason to stay after graduation.\n\n\"We're actually hanging onto people and bringing young people to the region, partly because the companies here are doing interesting things.\"\n\nREDspace has added more than 50 staff so far this calendar year \"and probably three-quarters of those are from away,\" said Johnston.\n\nEverybody thought we were crazy for leaving the tech ecosystem of the world. - Jordan Boesch, CEO at 7shifts\n\nSaskatoon is also home to a burgeoning new tech scene — and Jordan Boesch's company 7shifts is a part of that.\n\nHe got the idea to build a scheduling platform for the restaurant industry because his dad struggled with co-ordinating staff at the Quiznos locations he ran in Regina.\n\n\"I taught myself to code and built something rudimentary to get the job done,\" he said.\n\nBoesch, his wife and co-founder moved to San Francisco after their idea was accepted into a tech accelerator there. But when they secured some venture capital, they decided to take it back to Canada to make it go further.\n\n\"Everybody thought we were crazy for leaving the tech ecosystem of the world,\" he said.\n\nBut being in Saskatoon has allowed them to recruit staff who are among the University of Saskatchewan's computer science graduates. The company now employs 140 people.\n\nBoesch said he feels good about being part of spreading the wealth of tech jobs to places outside of Canada's biggest cities.\n\n\"I don't know if it's just because of the farm background we have here in Saskatchewan, but we have a lot of hard-working people. Being able to take that hard-working grittiness and channel it into growing a tech company is really exciting.\"", "description": "Economists say Canada now has a digital divide between those who have access to big-city tech jobs and those who do not. Here are some of the smaller towns and cities working to spread opportunity around.", "authors": ["Cbc News", "Brandie Weikle Is A Senior Writer For Cbc News Based In Toronto. She'S A Long-Time Magazine", "Newspaper Editor", "Podcast Host With Specialities In Family Life", "Health", "The Workplace. You Can Reach Her At Brandie.Weikle Cbc.Ca."], "top_image": "https://i.cbc.ca/1.5289137.1569029804!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/greg-malpass-traction-on-demand.jpg", "published_at": "2019-09-22"}