{"pub": "businessinsider", "url": "https://businessinsider.co.za/best-outfits-mister-global-national-costume-show-2019-9", "downloaded_at": "2019-10-02 12:53:11.502445+00:00", "published_at": "2019-10-02", "title": "A male beauty pageant had some wild national costumes – and South Africa’s is not the worst", "language": "en", "text": "Courtesy of Mister Global\n\nThe Mister Global male beauty pageant was held on September 26 in Thailand .\n\nLike Miss Universe, Mister Global contestants participate in a National Costume Show, an event that showcases clothing meant to represent each contestant's home country.\n\nOut of the 36 participants, South Africa's costume was not the worst.\n\nMyanmar took home the prize for this year's National Costume Show, whilst Mister Korea won Mr Global.\n\nFor more stories go to www.BusinessInsider.co.za.\n\nAs any beauty pageant fan knows, the best part of the competition is the National Costume Show - a segment designed to showcase clothing that honours and celebrates contestants' home countries.\n\nEvery year, outfits seem to get increasingly complicated, ornate, or simply engineered to go viral.\n\nThis year's Mister Global, an annual male beauty pageant founded in 2014, was no exception. South Africa was represented by Marcus Max Karsten, whose ambiguous tribal-inspired chest piece left locals scratching their heads.\n\nWhile many took to Twitter to express their confusion at his outfit, which one user labelled as a 'left-over Afropunk outfit...\n\nWhen will we stop being embarrassed as county? Who is this man, why is he wearing a left over afropunk outfit. He looks like he’s from Benoni https://t.co/vpav2yEQeQ — Lily van der Woodsen (@tutuzondo) September 29, 2019\n\n... it was not the worst of the 36 participants.\n\nSouth Africans are forever scamming the world. ?? https://t.co/dg0UXzT6Os — The Nunukins Account (@tanyajunghans) September 29, 2019\n\nKeep scrolling to see our 25 favourite costumes from this year's entrants.\n\nOn September 26, the international male beauty pageant, Mister Global, took place.\n\nThe US was represented by Branden Cruz.\n\nMuch like Miss Universe, Mister Global has a national costume portion of the show.\n\nMister Nepal this year is Aryan Sitaula.\n\nIt's a time for each contestant, or \"Inspiring Gentleman,\" to showcase clothing that honours and celebrates their home country.\n\nManuel Duarte's costume was inspired by the ancient Mayan civilisation.\n\nOr to rock the colours of their country's flag.\n\nMister Cuba 2019 is Rubert Manuel Arias Solozábal. This was the first year Cuba was represented in the pageant.\n\nThe costumes range from simple...\n\nMister Sweden 2019 is Sebastian Jonsson.\n\n... To extremely ornate, like Guam's entry this year.\n\nAccording to Facebook, Jonny Onedera's look was inspired by the Guam kingfisher, a type of bird native to the island.\n\nJapan's contestant used a traditional parasol as part of his outfit.\n\nKodai Hata represented Japan this year at Mister Global.\n\nThe Swiss outfit looks like the robes that professional boxers wear before a fight, but featuring the Swiss flag.\n\nKenan Murseli, aka Mister Switzerland, was the third runner-up at the 2019 pageant.\n\nThis year's overall winner was South Korea's representative, 23-year-old Jong Woo Kim.\n\nKim is a police administration student and model, according to Missosology.\n\nAccording to the pageant's spokesperson, this year's pageant raised money for an organisation that takes care of elephants in Thailand, where Mister Global was held this year.\n\n\"We are true on our advocacy on Environmental Awareness and charity cause,\" spokesperson Kitti Kamjunsa told Bored Panda.\n\nThailand's costume was incredibly ornate.\n\nThailand is represented this year by Jeerawat Vatchasakol.\n\n\"The aim of Mister Global is to promote environmental awareness, and we have been promoting this cause ever since we started in 2014,\" said spokesperson Kitti Kamjunsa.\n\nThe winner automatically becomes a Global Goodwill Ambassador.\n\nMister Haiti 2019 is Tcholo Medastin. His costume is \"a fantasy that pays tribute to the ancient African empire known as Nubia, a town of high artistic sensibility, wealth and culture\".\n\nWhile Mister Korea won Mister Global, the winner of the costume portion was Mister Myanmar.\n\nMister Myanmar, Thiha Kyaw, wore a costume designed by Phyo Pyae.\n\nIndonesia's dragon-inspired outfit was nothing short of eye-catching.\n\nHerman Yosef was crowned Mister Global Indonesia back in April.\n\nAs was South Africa's tribal-inspired chest-piece.\n\nSouth Africa was represented this year by Marcus Max Karsten.\n\nMister Portugal's costume probably wouldn't turn too many heads in a crowd of hipsters.\n\nHis hat ties it all together.\n\nUnlike the Dominican Republic's outfit — he looks ready for battle.\n\nBraulio Encarnación, Mister Dominican Republic, was the fourth runner-up.\n\nEgypt's competitor looks like he belongs among the pharaohs of ancient Egypt.\n\nThis year's Mister Egypt, Adam Hussein, tied his look together with an ankh-adorned headpiece. The ankh is an ancient Egyptian symbol for life.\n\nMister Sri Lanka's giant golden headpiece is making us envious.\n\nMaduranga Dilshan represented Sri Lanka.\n\nMister Global is one of 10 \"Global Beauties Grand Slam\" pageants, alongside Miss Universe, Miss World, and Mr. World.\n\nHere's a complete list of the Grand Slam pageants.\n\nThe pageant first took place in 2014, making it a newer competition. Compare that to Miss America, which started in 1921.\n\nTogo was represented by Kwassy Adjamah this year.\n\nEven though it's new, the contestants don't come to play — these costumes take time and money to create, and can be quite heavy.\n\nChace Cheng was named Mister Hong Kong 2019. His costume was another dragon-inspired ensemble.\n\nJust ask Mister Peru.\n\nMister Peru seems to be channeling the ancient Inca people, who lived in Peru through the late 1500s.\n\nThough some countries take a more laid-back approach, like Tunisia.\n\nHoussem Saïdi, Mister Tunisia, was close to taking home the Mister Global title. He was the first runner-up.\n\nPoland's representative is wearing traditional Polish folk clothing.\n\nMichal Grudzien was named Mister Poland 2019.\n\n*Bombi Mavundza contributed to this story.", "description": "Just like Miss Universe, Mister Global has a National Costume Show, and the contestants go all out to try to impress the judges.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7879/5322a351472e4c64baa0906c85c85a7a.jpg"}