{"pub": "townhall", "url": "https://townhall.com/tipsheet/katiepavlich/2019/09/13/joe-biden-comes-out-against-dc-v-heller-n2553088", "downloaded_at": "2019-09-14 01:40:18.190453+00:00", "title": "Joe Biden Comes Out Against Heller Ruling - The Individual Right to Keep and Bear Arms", "language": "en", "text": "During a town hall style interview with WMUR 9 Friday, former Vice President and 2020 Democrat Presidential Candidate Joe Biden came out against the Supreme Court's ruling on District of Columbia v. Heller.\n\n“Do you agree with the DC vs Heller decision in regards to protecting the individual right to bear arms that are in common use and which are utilized for lawful purposes?” Biden was asked.\n\n\n\n“The answer is,\" Biden said. \"If I were on the Court I wouldn’t make the same ruling. Okay?\"\n\nThe Heller ruling, which was decided 5-4, confirmed the individual right to keep and bear arms is protected by the Second Amendment.\n\n\"The Second Amendment protects an individual right to possess a firearm unconnected with service in a militia, and to use that arm for traditionally lawful purposes, such as self-defense within the home,\" the 2008 Supreme Court ruling states.\n\n\"It has always been widely under­stood that the Second Amendment, like the First and Fourth Amendments, codified a pre-existing right. The very text of the Second Amendment implicitly recognizes the pre-existence of the right and declares only that it 'shall not be infringed,'\" the late Justice Antonin Scalia stated in his majority opinion. \"There seems to us no doubt, on the basis of both text and history, that the Second Amendment conferred an individual right to keep and bear arms.\"\n\nBiden's comments come at a time when Democrats are vowing to confiscate lawfully owned firearms through government force.", "description": ".09/13/2019 21:39:21PM EST.", "authors": ["Katie Pavlich", "Timothy Meads", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/255/a4770fca-5d4e-4f5b-803d-b612eb4a9712.png", "published_at": "2019-09-13"}