{"pub": "investing.com", "url": "https://uk.investing.com/news/economy/top-5-things-to-know-in-the-market-on-thursday-1977310", "downloaded_at": "2019-10-10 15:32:02.952189+00:00", "title": "Top 5 Things to Know in the Market on Thursday", "language": "en", "text": "© Reuters.\n\nInvesting.com -- Trade talks between the U.S. and China resume, while Turkey sends its troops into northern Syria to purge its border of Kurdish fighters. Elsewhere, OPEC has its say on the outlook for the oil market and the U.K. economy looks set to avoid recession as a \"Hard Brexit\" looms. Here's what you need to know in financial markets on Thursday, 10th October.\n\n1. Trade talks resume\n\nTop-level trade negotiations between China and the U.S. are due to resume in Washington after a two-month hiatus.\n\nWith both sides having ramped up the pressure earlier this week with measures against the NBA on the one side and Chinese makers of surveillance equipment on the other, the chance of a comprehensive rapprochement is close to zero, meaning that the next two days will principally be an exercise in damage limitation.\n\nBackground briefings from both sides have created a confusing backdrop, with Bloomberg talking up the chance of an interim deal that could lead to a scheduled increase in U.S. tariffs being pushed back again. However, the South China Morning Post and Fox have both played down the chance of agreement, citing officials as saying that the talks may be broken off after one day.\n\n2. Turkey ground troops enter Syria\n\nTurkey sent its ground troops into northern Syria to establish a 20-mile buffer zone along its southern border, from which it hopes to drive out Kurdish militia who were instrumental in defeating ISIS and who now hold a large number of ISIS fighters in prison.\n\nIt then intends to resettle some of the Syrian refugees currently in Turkey in the safe zone. Turkey has accepted nearly 2 million refugees from Syria since the start of the latter’s civil war.\n\nTurkish airstrikes which began on Thursday are reported to have inflicted numerous civilian casualties. Kurdish forces have responded by shelling points in Turkey. The fell to a four-month low against the dollar.\n\n3. Stocks set to open flat\n\nU.S. stock markets are set to open flat ahead of the trade talks with China, with few willing to bet heavily on an outcome one way or the other.\n\nBy 6:15 AM ET, were up 3 points, effectively unchanged. and were up less than 0.1%.\n\nOn the earnings front, Delta Air Lines (NYSE: ) will report its third-quarter figures. Boeing (NYSE: ) will also be in focus after reports that cracks had been found in the wings of some of its older planes.\n\nEarlier Thursday, Dutch medical goods maker Koninklijke Philips (AS: ) warned that its third-quarter profit margins would be badly hit by the impact of U.S. tariffs on the equipment that it makes in China, a pattern that may affect many more companies in the forthcoming earnings season.\n\n4. CPI, Jobless claims due as Europe weakens further\n\nThe market can update its outlook for further rate cuts from the Federal Reserve at 8:30 AM ET (1230 GMT), when figures for September are announced, along with the latest weekly jobless claims numbers. The consensus forecast is for the annual inflation rate to rise to 1.8%.\n\nAccording to Investing.com’s , investors see an 86% chance of the Fed cutting rates by another 25 basis points at its Oct. 30 meeting.\n\nIn a speech late on Wednesday, Fed Chairman Jerome Powell highlighted the risks to the global economy from the current uncertainties over U.S.-China trade and Brexit.\n\nNews out of Europe this morning won’t have cheered him up much: in France fell by a sharper-than-expected 0.9%, and also weakened further, although the appeared on course to avoid recession in the third quarter, as GDP rose 0.3% in the three months through August.\n\n5. OPEC to update on oil market\n\nThe oil market also gets a regular reality check at 7 AM ET (1100 GMT) with the publication of OPEC’s monthly report.\n\nThe cartel’s latest estimates for global supply and demand will come a day after the U.S. government said output hit a record high of 12.6 million barrels a day last month.\n\nBy 6:15 AM ET, , the U.S. benchmark, were down 0.4% at $52.36 a barrel, while international benchmark was down 0.5% at $58.02.", "description": "Top 5 Things to Know in the Market on Thursday", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEA6M0LI_L.jpg", "published_at": "2019-10-10"}