{"pub": "nymag", "url": "https://vulture.com/2016/02/downton-abbey-lady-edith-crawley-every-miserable-thing-to-befall-her.html", "downloaded_at": "2019-09-20 12:53:41.984507+00:00", "title": "Every Awful Thing to Befall Downton’s Lady Edith", "language": "en", "text": "Give her a break! Photo: Nick Briggs/Carnival Film & Television Limited\n\nIt’s hard out there for Lady Edith Crawley. Over six seasons of Downton Abbey, she has faced an unusually high number of heartbreaks and obstacles for a woman of aristocratic means, despite her genuinely good heart and amiable personality. A well-worn pattern drove the series: Just as she seemed to be approaching some level of happiness — see her relationship with boo Bertie Pelham — “Poor Edith” would be knocked back down and forced to start from square one.\n\nIn Downton’s big-screen debut [light spoilers ahead], we finally see Edith get her happy ending, albeit one that falls short of the absolute satisfaction some true Edith stans might be craving. She’s now married to Herbert Pelham (a.k.a. Bertie), making her a marchioness and the most titled member of her family. They’re expecting their first child together. (At this point, everybody in the family knows about Marigold, Edith’s daughter from her relationship with the late Michael Gregson.) Sure, Bertie heads out of town for a multi-month stretch, missing his child’s birth. (Julian Fellowes was not going to let an opportunity to toy with Edith’s emotions pass him by entirely.) But eventually the, uh, queen of England sorts it all out!\n\nAhead of Downton’s big-screen debut, here’s every awful thing that has happened to our favorite overlooked middle child during the course of the show.\n\nEdith loves Patrick Crawley, the heir presumptive of the estate, but he gets engaged to Mary.\n\nHe then dies on the Titanic, and it’s revealed that Mary didn’t really love Patrick and was only engaged to him to keep the Crawley money in the family.\n\nShe shows romantic interest in Matthew Crawley, which is not reciprocated.\n\nDuring their “date” to explore local churches, he only has eyes on the churches. He and Mary later become engaged and married before he dies in a car crash.\n\nSir Anthony Strallan leaves her after it’s revealed he’s going to propose.\n\nAfter Mary discovers it was Edith who alerted the Turkish ambassador of what really happened on the fateful night of Mr. Pamuk’s death (sexy times!), Mary manipulates Strallan into thinking Edith doesn’t actually love him and was leading him on for the fun of it.\n\nShe and Mr. Drake, a local farmer, kiss and express interest in each other, but his wife finds out.\n\nAnd then Mrs. Drake hires an additional farmhand for their farm, so they don’t need Edith’s help anymore, just when she was beginning to find purpose in farming.\n\nPatrick Crawley returns to Downton and declares his love for Edith, but nobody believes his identity except for her.\n\nA Canadian World War I officer claiming to be Patrick requests to stay at Downton’s convalescent home to recover from severe burn injuries. After some investigating by Lord Grantham that casts doubt on his story, Patrick leaves, but not before he and Edith grow a strong attachment to each other. His true identity is never revealed.\n\nShe gets back together with Strallan and they get engaged, but he leaves her at the altar on their wedding day.\n\nBecause he believes he’s “too old” for Edith and doesn’t want her to waste her life caring for him. The Crawleys don’t disagree.\n\nHer family initially doesn’t support her writing a newspaper column.\n\nDespite Edith finally finding a career that she enjoys and is good at.\n\nMichael Gregson, Edith’s new lover, travels to Munich to get a divorce from his current asylum-confined wife to marry her.\n\nHe never returns, under very mysterious circumstances. It is later revealed he was killed during the Beer Hall Putsch. But …\n\nEdith gives birth to her and Gregson’s daughter, Marigold, rendering the child a bastard and subject to scandal.\n\nAlthough she originally intended the girl to be adopted in Switzerland (with the help of her Aunt Rosamund), Edith decides to keep Marigold as close in proximity to her as possible, and arranges for the Drewe family, local tenant farmers, to take her in at Yew Tree Farm.\n\nShe accidentally sets fire to her bedroom after throwing one of Gregson’s books into her fireplace.\n\nWhich nearly spreads to the entire upstairs wing of the estate. Although no severe damage is done, Edith was almost seriously injured.\n\nMrs. Drewe, initially unaware of who Marigold’s birth mother is, strongly dislikes Edith and her frequent visits.\n\nIt escalates when Mr. Drewe tells Edith to stay away from the child temporarily, which prompts Edith to remove Marigold from their care and flee to London. So …\n\nOut of spite, Mrs. Drewe tells Cora about Marigold’s true identity.\n\nCora is surprisingly level-headed and accepting of the whole situation when the dust settles, and hatches a plan for Downton to take in Marigold under the guise of her being Edith’s “ward.” But not all the family members are happy about this new arrangement.\n\nMrs. Drewe kidnaps Marigold during a local fair.\n\nShe’s retrieved shortly thereafter, but not before Lord Grantham politely demands that the Drewes move away to prevent future disturbance.\n\nEdith becomes engaged to Bertie Pelham, setting her up to become a marchioness, until Mary maliciously reveals the truth about Marigold to him.\n\nWhich causes Bertie to end the engagement, saying he can never trust her again.", "description": "Poor Edith.", "authors": [], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2016/02/22/22-lady-edith.w1200.h630.jpg", "published_at": "2019-09-20"}