{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nba/knicks/2019/10/08/knicks-marcus-morris-ejected-hitting-justin-anderson-ball/3906030002", "downloaded_at": "2019-10-08 12:10:28.089883+00:00", "title": "Knicks forward Marcus Morris ejected in first preseason game: 'We're not taking any (expletive)'", "language": "en", "text": "CLOSE\n\nIt didn’t take long for Knicks forward Marcus Morris to make his presence felt with his new team.\n\nAnd now, after one preseason game, he could be facing a suspension.\n\nMorris got ejected in Monday night’s game against the Washington Wizards after he knocked Justin Anderson in the face with the ball and swung his elbows at him. He was hit with a Flagrant 2 foul and automatic ejection, and now could be receiving a one-game suspension from the NBA.\n\nA Flagrant 2 foul is given for \"unnecessary and excessive contact committed by a player against an opponent,\" and the rulebook states a player could face a maximum $50,000 fine and/or suspension.\n\n\"Am I concerned (about a suspension)? ... I would be concerned if it was regular season,” Morris said, per ESPN. “I wouldn't want to miss any regular-season games. If that was regular season I wouldn't have done that. My team needs me. I've got to be smart, set a better example.\n\n\"But like I said at the beginning, we're not taking any (expletive). So it is what it is.\"\n\nMorris, who signed a one-year deal with New York in the offseason, finished the game with 17 points and seven rebounds in 19 minutes. He said there were “some things said” by Anderson that led to the incident.\n\n\"You can't be surprised with nothing that the twins do,\" said Wizards star Bradley Beal, who was a teammate of Marcus’ brother Markief. \"They play hard and they compete, and they're going to talk their fair share of trash, too. Whatever happened is between him and JA. .... But you can expect that from the twins. Crazy in the preseason, though.\"\n\nThe Knicks, who won 104-99, finished with the worst record in the NBA last season — at 17-65.", "description": "Marcus Morris got ejected in Knicks' first preseason game Monday night after he bopped an opponent in the face with ball and swung elbows at him.", "authors": ["Jimmy Hascup", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/08/USAT/5bc5a87a-da9a-4634-a934-67eab0a22b96-USP_NBA__New_York_Knicks-Media_Day.JPG?crop=1495,841,x2507,y139&width=3200&height=1680&fit=bounds", "published_at": "2019-10-08"}