{"pub": "cbc", "url": "https://cbc.ca/news/canada/ottawa/ottawa-gatineau-traffic-september-17-1.5284849", "downloaded_at": "2019-09-17 13:10:20.614109+00:00", "title": "1 issue the city needs to discourage once LRT transition is done | CBC News", "language": "en", "text": "Good morning commuters!\n\nThe eastbound Highway 417 is closed at Hunt Club Road this morning — probably for a few hours — after an overnight fatal collision.\n\nThis also affects the ramp from Hunt Club to the eastbound 417.\n\nMeanwhile, this is Day 2 of commuting using Ottawa's new LRT system.\n\nTraffic on the major routes was still very heavy yesterday — in fact, quite a bit heavier than even usual.\n\nSeems as though some commuters are taking a break from public transit during the three-week transition phase from Transitway buses to trains.\n\nThat's when we'll start seeing some of the temporary Transitway lanes come back into use for regular traffic. Perhaps then we'll see some congestion relief.\n\nThe only problem with that, is some people might see an ease in volume as an enticing invitation to drive their own vehicles again.\n\nThe city needs to keep that from happening (somehow) so the Stage 2 expansion will bring an even greater improvement for the folks causing the greatest commuter jams: those coming into the core from the suburbs.\n\nGood luck with that.\n\nBefore I go, it's Tuesday, so that means I get to pick a Traffic Tuesday song on Ottawa Morning.\n\nSomething to keep you entertained during the busiest commute of the week. I've chosen Toronto's Zeus and their song Are You Gonna Waste My Time?\n\nI highly suggest you watch the video, especially if you like edible puppets and dogs.\n\n\n\nHave a great day!\n\nIf you have a traffic or commuter gripe about driving, cycling or being a pedestrian commuter — anything from problem intersections, to parking, to inefficient routes — send it to doug.hempstead@cbc.ca.\n\nAnd remember, you can share what you see on the roads with me on Twitter at @cbcotttraffic. Or give me a ring at 613-288-6900.", "description": "Hopefully ending all the LRT lane and road closures won't encourage people to drive.", "authors": ["Cbc Ottawa'S Traffic Specialist", "Doug Hempstead Is Cbc Ottawa'S Traffic Specialist", "Can Be Heard On Cbc Radio'S Ottawa Morning", "All In A Day. Sometimes", "He Even Sleeps. Originally The Ottawa Valley", "He Is A Musician", "Family Man - Married With Two Daughters. Doug Is An Award-Winning Journalist With More Than Years Experience In The Region Covering All Types Of News. He Welcomes Your Input On Traffic Issues", "Can Be Called Directly While The Shows Are Airing At Tweet Him At", "Cbcotttraffic Or", "Doughempstead. His E-Mail Is Doug.Hempstead Cbc.Ca."], "top_image": "https://i.cbc.ca/1.5284900.1568637006!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/transitway-ottawa-lrt-light-rail-traffic-buses-slater.jpg", "published_at": "2019-09-17"}