{"pub": "fox", "url": "https://foxnews.com/us/chinese-woman-caught-at-mar-a-lago-with-malware-apparently-was-asked-to-target-clintons-docs-show", "downloaded_at": "2019-10-03 23:31:09.411309+00:00", "published_at": "2019-10-03", "title": "Chinese woman caught at Mar-a-Lago with malware was apparently asked to target Clintons: docs", "language": "en", "text": "A Chinese businesswoman who was convicted of trespassing at President Trump's Mar-a-Lago resort in Florida earlier this year had been urged by her handler to target other famous figures including the Clintons and billionaire businessman Warren Buffett, court documents say.\n\nYujing Zhang, 33, who is scheduled to be sentenced on Nov. 22, was caught by Secret Service agents with troves of technology embedded with malware and thousands of dollars in cash after she claimed that she was at Trump's prestigious club to attend a “United Nations friendship event” that had apparently been canceled. Her bizarre behavior and backstory led to suspicions that she was a Chinese government spy, but she was not charged with espionage or related crimes.\n\nCHINESE WOMAN FOUND GUILTY OF TRESPASSING AT MAR-A-LAGO\n\nZhang apparently purchased a $20,000 travel package from Li Weitian, also known as Charles Lee, who advertised tickets on the Chinese social media site WeChat promising access to events across the U.S. to meet prominent political and business figures.\n\nLee ran the United Nations Chinese Friendship Association, which is not affiliated with the U.N., and was photographed at least twice with Cindy Yang, a Republican donor and former Florida massage parlor owner who organized events at Mar-a-Lago.\n\nUpon learning that the event at Mar-a-Lago had been canceled, Lee tried to convince Zhang to attend another event on Wall Street in New York City, text messages between the pair released by the South Florida court Thursday revealed. Bill and HIllary Clinton were scheduled to be there.\n\n\"Regarding the event at the Trump's estate, it's been put on hold for now. We can forget about it. We have two other activities now. I sent them to you already,\" Lee texted Zhang on March 26, four days before she was arrested on the Trump property.\n\nAt the time of her arrest, Zhang told federal agents that she did not know that the event had been canceled, a claim contradicted by her messages.\n\nLee urged Zhang to go to \"Clinton's event, Clinton and his wife Hillary,\" he said, offering her a ticket for $60,000. \"There are politicians and the finance people that you talked about wanting to meet in this event. You can meet with these two famous people in one setting. Hillary was the former Secretary of State, equivalent to the Prime Minister. That is very extraordinary. Er... you can stand in between them and have a photo taken.\"\n\nIn the same message, Lee also says, \"You can also go to Buffett's event which is particularly for investment and finance,\" referring to business mogul Warren Buffett.\n\nLee also explained to her why the previously scheduled Trump event was allegedly canceled.\n\n\"Regarding the Trump's event, this is what happened. It's because the Democratic Party has all along been fighting with the Republican Party. He is from the Republican Party. They accused Trump of colluding with Russia. Recently the investigation said Trump did not. He's not guilty. The media is controlled by the Republic Party-- eh, the Democratic Party. That's why they are in trouble. Trump takes the revenge. So they now join together and attack Trump. ... In order to minimize the nonsense, they canceled his events for the time being.\"\n\nCLICK HERE FOR THE FOX NEWS APP\n\nIn subsequent messages, Zhang asked Lee for her money back after hearing of the cancellation but ended up traveling from Shanghai to Florida anyway. Her motives for going to the property and lying to Secret Service agents at Mar-a-Lago remain unclear.", "description": "A Chinese businesswoman who was convicted of trespassing at President Trump's Mar-a-Lago Club earlier this year and lying to Secret Service agents about the intrusion was urged by her handler to target other famous figures including the Clintons' and Warren Buffet.", "authors": ["Vandana Rambaran", "Vandana Rambaran Is A Reporter Covering News", "Politics At Foxnews.Com. She Can Be Found On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/clintons-zhang-trump.jpg"}