{"pub": "wsj", "url": "https://wsj.com/articles/belgium-has-no-government-anheuser-busch-thought-it-could-help-11568211659?mod=rsswn", "downloaded_at": "2019-09-12 07:21:39.502825+00:00", "title": "Can Beer Help Bridge a Divided Nation? Anheuser-Busch Gave It a Try.", "language": "en", "text": "WARSAGE, Belgium—For months, a deeply polarized Belgium has been without a government. This, after the country had already achieved a spot in Guinness World Records for the longest time without a government in peacetime, after elections in 2010 (541 days).\n\nA giant brewer thought beer might help.\n\nWhat the maker of Budweiser, Stella Artois and Corona learned was that people will sit down and drink free beer even if it's nonalcoholic—then steal the table.\n\nBelgium, home of Anheuser-Busch InBev NV, in May held a national election that failed to produce a parliamentary majority. Politicians from the leading parties in Belgium’s two big regions—Dutch-speaking Flanders and French-speaking Wallonia—refused to cooperate.\n\nFor the third time in 12 years, Belgium was left with a caretaker government because of disagreements between Walloon and Flemish politicians. The outgoing prime minister will leave Dec. 1 to take up another job, adding further pressure to come to an agreement.\n\nExecutives at AB InBev, whose products lubricate political discourse on bar stools world-wide, decided to try getting Belgians talking across the divide last month. Their approach was a weeklong political-science experiment entailing hundreds of yellow folding tables and chairs set up in fields, forests and on lake shores along the 250-mile language barrier.\n\nThe bait was free glasses of an alcohol-free version of a brew named Leffe. “Nearly three months after the elections,” AB InBev intoned in ads encouraging participation, “we still don’t have a federal government. Are Flemings and Walloons so different?”\n\nBoth sides were equally bemused to find that Leffe, a brand known for its strong beer varieties once brewed by monks, even had a nonalcoholic version; AB InBev introduced Leffe Blonde 0.0% in January. Some wrote on social media that they were disappointed to discover the beer was alcohol-free, intended to keep conversations civil and comply with a ban on serving free alcohol in public.\n\nCompany officials call it marketing for a good cause. “Our role as beer maker is to get people together,” said Alexis Meeus, Leffe’s senior brand manager. “We want to show politicians that a compromise between the Flemish and the Walloons is possible.”\n\n‘Are Flemings and Walloons so different?’ Participants considered the question over alcohol-free Leffe beer. Photo: Valentina Pop/The Wall Street Journal\n\nFlemish nationalists want independence, or at least greater autonomy within Belgium, often depicting the poorer Wallonia as lazy and living off welfare. Walloons worry that Flanders is veering too far right and that the nationalist movement will destroy the Belgian state.\n\nAB InBev’s attendees were inclined to compromise, because two things Belgians generally agree on is a taste for beer and distaste for politicians.\n\n“It’s a bit of a shame it had to be a multinational to come up with this idea,” said Cindy Pirard, a Walloon participant who talked politics for over an hour under a scorching sun along a dirt road surrounded by farmland.\n\nIn Belgium, simply talking can be tough. French speakers for generations ran the country, which Dutch speakers still resent. Many Flemings refuse to speak French, even if they can. Few Walloons speak Dutch.\n\nMs. Pirard and her Flemish table partner, both bilingual, discussed topics other than Belgium, including Brexit. Arriving to find warm beer with no alcohol didn’t bother them. An hour later, a van arrived with cold refills.\n\nShare Your Thoughts What would you do for free beer? Join the conversation below.\n\nFrom the campaign’s start, its inclusiveness fell short for some. Many complained on Facebook that Belgium’s bilingual capital, Brussels, wasn’t included in the online sign-up menu for participants to indicate their home region. Others griped that organizers omitted Belgium’s tiny German-speaking region.\n\nThe pop-up conversations occurred at a different spot each day, with GPS coordinates emailed to participants.\n\nOn each table was a link to an online questionnaire prepared by a political scientist. “Say hello to your debate partner. Take your smartphone. Find your debate topics,” the instructions stated. “Have a good debate and cheers!”\n\nAB InBev installed hundreds of tables on the Flemish-Walloon border to spur intra-Belgian debate. Some got filched. Photo: Valentina Pop/The Wall Street Journal\n\nAnswers to the questions, on issues from taxation to retirement age, had to be jointly agreed before submitting. Among them: “How different are Flemings and Walloons—very different, partly different, not very different, we are all Belgians.”\n\n“The questions are a bit meh,” said Jos Stevens, a Flemish pig farmer who nearly missed the event because he couldn’t find the table along a forest road near the village of Warsage, where medieval monks brewed strong beer, much like the original Leffe.\n\nFinding spots along the invisible language border to commandeer proved challenging, Mr. Meeus said. One idea—installing a table on a raft in a picturesque lake—was vetoed by a local yachting club that owned the lake. The tables were placed on the shore.\n\nElsewhere, the border crossed private farmland, so organizers retreated to nearby pathways. Some locations changed last-minute, leaving would-be participants heading to outdated GPS coordinates, some complained on Facebook.\n\nFlemish pig farmer Jos Stevens, left, and his Walloon debate partner nearly missed this table tucked away in a forest. Photo: Valentina Pop/The Wall Street Journal\n\nOthers arrived to find no debate partner from the other side. Many drank and left. “If the organizers wanted to illustrate that the Belgian model doesn’t work, they’re succeeding,” wrote one jilted participant in a social-media post.\n\nA group session near a church, where participants pulled three tables together, concluded that they were all preaching to the choir. They agreed Belgium’s problem is more with people in deep Flanders and Wallonia and with politicians who refuse to talk to each other, not residents near the border.\n\n“The people who participate are not representative,” said Dave Sinardet, the political scientist who compiled the 10 questions.\n\nMr. Sinardet, who teaches university students about Belgian federalism and nationalism, said he initially balked at working with a multinational but figured it would proceed anyway and that good questions would improve discussions.\n\n“In the beginning, I hesitated,” he said. “It’s a good initiative—people talk a lot about each other, but not with each other. But it’s a publicity stunt.”\n\nAt a group debate near a church, participants concluded they were preaching to the choir. Photo: Valentina Pop/The Wall Street Journal\n\nThe campaign’s target was 2,000 attendees. It drew 800 sign-ups, and people at 243 tables submitted replies. Some with no partner joined other tables, complicating the count, said AB InBev spokeswoman Laure Stuyck.\n\nThe company was pleased some 1,500 beers were consumed, she said, meaning people liked alcohol-free Leffe.\n\nMany also liked the yellow tables and chairs. More than half of them disappeared, AB InBev said. One van driver spoke of his “personal nightmare at Waterloo,” where tables were stolen within minutes of his setting them up.\n\n“If people liked them so much, and on the table there is a big sticker that says ‘National Debate,’ ” Ms. Stuyck said. “Somehow we’re happy they took the tables.”\n\nWrite to Valentina Pop at valentina.pop@wsj.com", "description": "The giant brewer, maker of Budweiser, set up yellow tables with non-alcoholic suds to spur “National Debate” along Belgium’s Flanders-Wallonia border. Some drank up, continued to argue and stole the furniture.", "authors": ["Valentina Pop", "Valentina.Pop Wsj.Com"], "top_image": "https://images.wsj.net/im-105641/social", "published_at": "2019-09-11"}