{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7627391/Chris-Hughes-reveals-lost-weight-awaiting-blood-test-results.html", "downloaded_at": "2019-10-30 00:13:07.538348+00:00", "title": "Chris Hughes reveals he has lost weight and is awaiting blood test results", "language": "en", "text": "Chris Hughes has revealed that he has lost weight and is awaiting blood test results after losing his appetite nine weeks ago.\n\nThe Love Island star, 26, spoke candidly about his slimmed-down frame and admitted he thinks it is due to 'stress' at Monday's Pride of Britain Awards.\n\nChris, who is loved-up with his Little Mix girlfriend Jesy Nelson, admitted that he used to have a 'huge appetite' and would even eat 'two burgers a day' when filming with friend Kem Cetinay.\n\nWorrying: Chris Hughes has revealed that he has lost weight and is awaiting blood test results after losing his appetite nine weeks ago\n\nWith the star adding that he has been 'force-feeding' himself and he has been feeling 'constantly tired' with headaches.\n\nHe told The Sun: 'I could eat and eat and eat. It's been my hobby my whole life... sleeping and eating are my two favourite things.\n\n'But the last nine weeks I haven't been doing either.\n\n'Stress': The Love Island star, 26, spoke candidly about his slimmed-down frame and admitted he thinks it is due to 'stress' at Monday's Pride of Britain Awards (pictured, left, at the event, and right, in January)\n\nPals: Chris, who is loved-up with his Little Mix girlfriend Jesy Nelson, admitted that he used to have a 'huge appetite' and would even eat 'two burgers a day' when filming with friend Kem Cetinay (pictured together in January)\n\n'I haven't got the blood tests back yet, I'm waiting to find out the results.'\n\nAlso during the event, Chris admitted that it was 'love at first sight' when he first laid eyes on his girlfriend Jesy.\n\nSpeaking on the red carpet at the Pride of Britain Awards in London on Monday, the former Love Island star, 26, was full of kind words for the Little Mix star, 26.\n\nGushing over his stunning girlfriend, Chris confessed: 'I've always been one for love and I'm very loved up. It's the happiest I've ever been. I'm loving it, I love life.'\n\nMeant to be: Also during the event, Chris admitted that it was 'love at first sight' when he first laid eyes on his girlfriend Jesy (pictured)\n\nBack in January, the couple hit headlines when they were snapped packing on the PDA in a kebab shop, which the pair later confirmed was their first date.\n\nDiscussing their intimate first encounter, Chris explained: 'I didn't really know much about her, I just thought she was so beautiful.\n\n'I need 10 mins with you to try and describe how great that date was - the kebab date - we went for cocktails before and that's where the spark started. It was love at first sight!\n\n'I was about three minutes late for the date so she was in the queue and I came up the stairs and she was there in my face. I thought \"woah, oh jeez\" and I started getting a bit nervous.'\n\nSmitten: Gushing over his stunning girlfriend, Chris confessed: 'I've always been one for love and I'm very loved up. It's the happiest I've ever been. I'm loving it, I love life.' (pictured in February)\n\nDiscussing how he's been welcomed into the Nelson fold, Chris continued: 'Jesy's family is amazing, I love them to pieces. And they love the Cotswolds [Chris' home town] so we're always between each other's houses!'\n\nChris then turned his attention to Jesy's recent BBC documentary Odd One Out, in which she discussed her experiences with trolling that ultimately resulted in a suicide attempt.\n\nHeaping praise on his 'strong' partner, the reality star gushed: 'It's phenomenal, it was unbelievable. She's the strongest woman I've ever met and shes come so far.\n\n'She's never had it easy from day one and you got to tip your hat to her. Shes an unbelievable woman.'\n\nSweet: Discussing how he's been welcomed into the Nelson fold, Chris continued: 'Jesy's family is amazing, I love them to pieces. And they love the Cotswolds [Chris' home town] so we're always between each other's houses!' (pictured together in September)\n\nChris has made no secret of the fact that he wants to settle down with Jesy, with the pair openly discussing their plans for marriage and children.\n\nHowever, it seems the pair won't be walking down the aisle any time in the immediate future, as when pressed on when is the ring coming, a blushing Chris laughed nervously as he coyly responded, 'one day!'\n\nJesy began dating Chris two months after she split from musician Harry James, following a 16-month romance.\n\nMeanwhile, Chris was previously in a high-profile romance with fellow Love Island star Olivia Attwood, 27, with the pair going their separate ways in March 2018.\n\nHe was then linked to Made In Chelsea star Emily Blackwell and Coronation Street star, Georgia May Foote.", "description": "The Love Island star, 26, spoke candidly about his slimmed-down frame and admitted he thinks it is due to 'stress' at Monday's Pride of Britain Awards.", "authors": ["Olivia Wheeler", "Rebecca Lawrence For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/18/20342198-0-image-a-4_1572375469254.jpg", "published_at": "2019-10-29"}