{"pub": "breitbart", "url": "https://breitbart.com/news/dont-arm-wrestle-the-boks-wilkinson-warns-england", "downloaded_at": "2019-10-29 08:03:00.060577+00:00", "title": "Don’t ‘arm-wrestle’ the Boks, Wilkinson warns England", "language": "en", "text": "Tokyo (AFP) – England’s legendary World Cup-winner Jonny Wilkinson has warned against getting embroiled in a tight “arm-wrestle” against a “smothering” South Africa side in Saturday’s Rugby World Cup final.\n\nThe Springboks employed a tight game plan against Wales in the semi-final, using box kicks from scrum-half Faf de Klerk and keeping the ball in the forward pack as much as possible, squeezing the life out of the Welsh side.\n\nWilkinson, England’s fly-half last time they won the Webb Ellis Cup in 2003, stressed that once teams are sucked into playing that way, it is difficult to switch to a more expansive running game.\n\n“You don’t want to get into an arm-wrestle with those guys because it’s very difficult when you’re in a tight game to branch out and start getting into a wider game. When you’re in a wider game, you can always bring it in,” Wilkinson told reporters.\n\nThe Springboks are “a very smothering team. They can really get around you and make you feel like the pitch is tiny. Make you feel like there’s about 20 of them”, he said.\n\nAt the same time, they are “enormously explosive” and capitalise very quickly on any errors, so England will have to cut out mistakes, advised Wilkinson.\n\nIn South Africa’s 19-16 win against Wales, fly-half Handre Pollard had a flawless goal-kicking record, scoring 14 of the points including a nerve-shredding penalty with only five minutes to go.\n\n“They need to maintain their discipline hugely because there is a goal-kicker in their team who punishes,” said Wilkinson, who holds the record for most points scored in World Cups.\n\n– ‘Very, very close’ –\n\nAnother member of that 2003 World Cup-winning side, Lawrence Dallaglio, said England’s 19-7 win against the All Blacks in the semi-final was “one of the great Rugby World Cup performances. Full stop”.\n\nIf England win the World Cup, they will have beaten the three major southern hemisphere teams — Australia, New Zealand and South Africa — on consecutive weekends, which Dallaglio said would be the “ultimate” achievement.\n\n“Obviously, given what England did to New Zealand, they will be favourites… but it’s going to be difficult,” predicted Dallaglio, the only person in the 2003 team who played every minute of that World Cup campaign.\n\nHowever, he pointed to the Springboks’ impressive defensive record — they have conceded only four tries, and two of those were within the space of five minutes against the All Blacks.\n\n“South Africa have proved that they are a very difficult side to beat. They are a tough nut to crack and they are pretty determined as well,” said Dallaglio.\n\nAnother person who has lifted the Webb Ellis Cup, South Africa’s Bryan Habana, predicted an “epic” final that would be decided by “very small margins”.\n\n“My heart would definitely be with South Africa,” said Habana, the star of South Africa’s win in 2007, when asked to predict who will come out on top.\n\n“My head says that if South Africa can utilise their opportunities — potentially like the first 20 minutes they played against New Zealand at the beginning of the tournament — they realistically stand a chance of winning the game.”\n\nWilkinson, Dallaglio and Habana had joined other former rugby greats such as Australia’s George Gregan and England’s Will Greenwood to coach Japanese children — part of World Rugby’s efforts to spread the game during Asia’s first World Cup.\n\nAnd the great fly-half had a simple answer when asked how Saturday’s final would go.\n\n“What’s my prediction? I am English, I work with the England team. England will win but I think it will be very, very close.”", "description": "Tokyo (AFP) – England’s legendary World Cup-winner Jonny Wilkinson has warned against getting embroiled in a tight “arm-wrestle”", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/29/ae9bb9_jonny-wilkinson-warned-an-arm-wrestle-south-africans-don-arm-wrestle-boks-640x335.jpg", "published_at": "2019-10-29"}