{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/2019/07/31/our-entertainment-newsletter-help-you-stay-top-your-trending-game/1866796001", "downloaded_at": "2019-10-05 14:05:19.857909+00:00", "title": "No time to keep up with celebrities? Don't worry, our entertainment newsletter does it for you.", "language": "en", "text": "CLOSE Celine Dion, Billy Porter, Lena Waithe and more celebrities take over the Met Gala red carpet and explore the theme, \"Notes on Fashion.\" Josmar Taveras, USA TODAY\n\nDo you struggle putting together a Kardashian family tree? Don't know who got the final rose on the \"Bachelorette\" last night? Can't name which movies scored Oscar nominations?\n\nLook no further, because USA TODAY's Entertainment newsletter will have you talking like a pop-culture junkie in no time (maybe even more than you hoped.)\n\nThink of it as your perfect mid-day snack. When the afternoon rolls around, check your inbox for an easily digestible roundup of entertainment news.\n\nSubscribe to USA TODAY's Entertainment newsletter here.\n\nWhat can you expect in your inbox? Breaking news and gossip on the hottest celebrities, TV, movies, music and book reviews, and answers to all the latest gossip.\n\nExclusive interviews with some of your favorite stars and photo galleries from Hollywood's top events can also be found in the roundup.\n\nLooking to impress your co-workers even more? We recommend subscribing to these other newsletters (after you've hit subscribe to the Entertainment newsletter) from USA TODAY:\n\nThe Daily Briefing : Start the day smarter. This morning news roundup was made for you. Sign up here.\n\n: Start the day smarter. This morning news roundup was made for you. Sign up here. The Short List : A snappy (and moderately sassy) guide to the day’s news — every day, in short. Sign up here.\n\n: A snappy (and moderately sassy) guide to the day’s news — every day, in short. Sign up here. The Daily Money : Money on your mind? This newsletter offers stories on how to make manage your finances like a pro. Sign up here.\n\n: Money on your mind? This newsletter offers stories on how to make manage your finances like a pro. Sign up here. For the Love of the Game(s) : The people, plays and sports stories that made our week. Sign up here.\n\n: The people, plays and sports stories that made our week. Sign up here. The Morning Win : USA TODAY’s irreverent and incisive recap of daily sports news. Sign up here.\n\n: USA TODAY’s irreverent and incisive recap of daily sports news. Sign up here. With all this knowledge, prepare to be the most popular person around the water cooler.\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/2019/07/31/our-entertainment-newsletter-help-you-stay-top-your-trending-game/1866796001/", "description": "Why feel left out of the know when our entertainment newsletter can drop all the top headlines in your inbox?", "authors": ["Georgia Slater", "Published A.M. Et July"], "top_image": "https://www.gannett-cdn.com/presto/2019/07/14/USAT/528168d1-beef-43d4-b909-69b4cb615d40-1161990987.JPG?crop=3999,2249,x0,y215&width=3200&height=1680&fit=bounds", "published_at": "2019-07-31"}