{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/sportsnews/article-7545609/Football-agent-James-Featherstone-charged-nasty-attack-pub-toilet.html", "downloaded_at": "2019-10-07 12:32:01.992334+00:00", "title": "Football agent James Featherstone charged for 'nasty' attack in pub toilet", "language": "en", "text": "A leading football agent has been charged with wounding with intent following a ‘nasty’ attack in a pub toilet which put a man in his 50s in hospital.\n\nOfficers from Greater Manchester Police (GMP) released images of two men following the incident, appealing to the general public for their help to identify those responsible.\n\nOne of the men in the images was James Featherstone, whose company represents a number of well-known names including Sheffield Wednesday manager Garry Monk and Manchester United defender Chris Smalling.\n\nJames Featherstone (pictured above, left with his client Garry Monk) has been charged by police over an attack inside a pub toilet. Monk was not involved in the incident\n\nIt is understood that Featherstone, 39, subsequently attended a voluntary interview with officers investigating the case in July. And he has now been charged with section 18 wounding with intent along with another man, Benjamin Cowgill, 38. Both are due to appear at Manchester and Salford Magistrates Court on November 5.\n\nWhen previously contacted by Sportsmail about the incident, Featherstone, whose OmniSports agency client list also includes Cardiff City pair Joe Bennett and Neil Etheridge, said he had already spoken to officers. ‘I replied to the appeal for information instantly,’ he explained. ‘I have spoken with the police and obviously am more than happy to assist them in any way I can with their enquiry.’\n\nThe attack happened at the Stamford Arms in the leafy village of Bowdon, near Altrincham, at around 9pm on March 8. The victim, who was left with lacerations to the left side of his scalp and eyebrow which required hospital treatment, was assaulted after he entered the gents’ toilets.\n\nManchester United's Chris Smalling, who is currently on loan at Roma, is among his clients\n\nWhen launching the appeal for information which included the images - before Featherstone, of Altrincham, contacted the police - Detective Constable Gareth Richards said: ‘This was a nasty assault that left a man needing hospital treatment.\n\n'He has since recovered from his injuries and we’re determined to find the people who have attacked him.’\n\nA spokesperson for GMP said: ‘Two men have been charged after a man was attacked in Trafford. James Featherstone and Benjamin Cowgill have both been charged with section 18 wounding with intent.\n\n'The men will appear at Manchester & Salford Magistrates Court on Tuesday 5 November 2019. At around 9pm on Friday 8 March 2019 a man in his 50s was attacked after entering the gents’ toilets at the Stamford Arms in Bowdon.’", "description": "Leading football agent James Featherstone has been charged for the attack which happened in the Stamford Arms in the leafy village of Bowdon, near Altrincham on March 8 this year.", "authors": ["Mike Keegan For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/09/19386482-0-image-a-11_1570438036150.jpg", "published_at": "2019-10-07"}