{"pub": "hotair", "url": "https://hotair.com/archives/allahpundit/2019/09/05/fox-friends-trump-never-said-mexico-will-pay-wall", "downloaded_at": "2019-09-06 12:14:59.576745+00:00", "title": "“Fox & Friends”: Trump never should have said that Mexico will pay for the wall", "language": "en", "text": "Via the Daily Beast, a clip that’s surprising in lots of ways — starting with the fact that F&F is famously one of the most pro-Trump shows on Fox. This isn’t Shep’s midday Hour of Glower. This is the program that used to have Citizen Trump call in every week before he became a candidate and riff for 45 minutes on the news du jour.\n\nIt’s surprising in that the subject matter is bad for POTUS no matter how happy a spin the hosts might try to put on it. “School construction among projects being cut to pay for Trump’s border wall” is a poisonous headline even when it comes with the footnote that the Pentagon plans to fund those projects eventually. Ainsley Earhardt does her best in the clip to bail Trump out, noting that if House Democrats are so bothered by military schools not being funded they can just pony up the dough to do so. But that would be tantamount to funding the wall directly: If Trump reprograms X number of defense dollars for the wall and Dems then replace that money in the defense budget, they’ve effectively cut Trump a check for the wall itself with the Pentagon as a middleman. They’d have rewarded him for his hardball tactic of reappropriating money for the wall unilaterally on national-emergency grounds over Democratic objections.\n\nIt’s surprising too that Brian Kilmeade and Steve Doocy are so skeptical of the “Mexico will pay for it” nonsense given that, at last check, it remains Trump’s official position. He’s spent two years backing away from the idea of the president of Mexico presenting him with a six-foot-long sweepstakes check for $25 billion or whatever, but his desperation to be seen as having kept a core promise to fans has led him to claim that Mexico will pay for the wall — either through fairer trade via the USMCA, through taxes on remittances, or what have you. To have “Fox & Friends,” of all shows, openly scoffing at the idea in front of an audience of Trump fans is shocking. The president hasn’t given friendly media permission to tell the truth about this!\n\nMaybe most surprising is that Fox hosts who usually enjoy his favor are willing to risk his wrath at a moment when tensions between Trump and the network are higher than they’ve been since the start of the GOP primary debates in 2015. It was Kilmeade, in fact, who pressed Trump about that in a radio interview last week, asking him why he had a problem with Fox airing diverse viewpoints. Trump dodged the question and Kilmeade didn’t pursue it, but if F&F is now willing to call BS on the idea of Mexico paying for the wall, maybe the word has gone out to Fox hosts that they have a freer hand than they used to in questioning Trump dogma. For the moment, I mean: It’ll be high treason for them to reiterate this point on air a year from now, when the political stakes will be as high as they can get.", "description": "\"As we know, that did not work.”", "authors": ["Ed Morrissey", "Karen Townsend", "John Sexton"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/a-2.jpg", "published_at": "2019-09-05"}