{"pub": "hotair", "url": "https://hotair.com/archives/allahpundit/2019/10/25/good-news-rudy-now-butt-dialing-reporters-overheard-talking-bidens-needing-cash", "downloaded_at": "2019-10-25 21:55:18.413118+00:00", "title": "Good news: Rudy now butt-dialing reporters, overheard talking about the Bidens and needing cash", "language": "en", "text": "Per Orin Kerr, doesn’t Rudy hold himself out as some sort of security expert?\n\nThe best part of this story about the president’s lawyer butt-dialing reporters in the middle of an impeachment inquiry into his client and a criminal inquiry into his own activities is that … there were two separate butt-dials. One happened in the afternoon on September 28, the other late at night on October 16. This dude is leaving audio records of his private conversations inadvertently in journalists’ mailboxes at a moment when he could conceivably bring down a president and/or land himself in prison.\n\nWhich raises the question: How many other reporters are sitting on voicemails of Rudy’s butt-dials (no pun intended)? It can’t have happened twice to one guy at NBC News and to no one else in the Washington press corps. It’s more likely that it’s become an industry rite of passage now. You’re nobody in political journalism until Time’s 2001 Man of the Year has left you an accidental message in which he’s heard rambling about Hunter Biden and needing several hundred thousand dollars.\n\nYou’ll need to read all of this to get the full flavor as I can only excerpt so much. The good news is that there’s no clear evidence of a crime in the transcript, or something even more disastrous like Rudy admitting that the CrowdStrike stuff is kooky nonsense that they’re feeding to the Fox News audience. It’s mostly just him rambling about stuff that sounds crime-y — unknown business he has in Bahrain and Turkey\n\nThe bad news is that the writers of the “President Trump” reality show we now inhabit have apparently decided to take the show in a more comic direction.\n\n“Is Robert around?” Giuliani asks. “He’s in Turkey,” the man responds. Giuliani replies instantly. “The problem is we need some money.” The two men then go silent. Nine seconds pass. No word is spoken. Then Giuliani chimes in again. “We need a few hundred thousand,” he says. It’s unclear what the two men were talking about. But Giuliani is known to have worked closely with a Robert who has ties to Turkey. His name is Robert Mangas, and he’s a lawyer at the firm Greenberg Traurig LLP, as well as a registered agent of the Turkish government. Giuliani himself was employed by Greenberg Traurig until about May 2018. Mangas’ name appears in court documents related to the case of Reza Zarrab, a Turkish gold trader charged in the United States with laundering Iranian money in a scheme to evade American sanctions.\n\nZarrab is the same person whom Rudy reportedly lobbied Trump and Rex Tillerson about in 2017, trying to get him released as part of a prisoner swap with Turkey, which Tillerson recognized instantly as improper.\n\nGod only knows what he needs a few hundred thousand for now and how “Robert” — or Turkey — might fit into it. Maybe we’ll find out from the DOJ in a few months. Although their plate is already pretty full with Rudy stuff:\n\nThe scrutiny isn’t coming just from the previously known probes by FBI agents and the U.S. attorney’s office based out of Manhattan, according to two people familiar with the investigation. The criminal division of the Justice Department in Washington has taken an interest in the former New York mayor, too, meaning an expansion of resources that indicates the politically sensitive probe into the president’s personal attorney is both broader and moving at a faster pace than previously understood… “He appears to be a subject, if not a target of an active investigation. So to have him be a part of the legal team would be troublesome to say the least,” said Greg Brower, who served as the FBI’s top liaison to Congress until 2018. “At best, it’s a messy situation and more likely it’s just completely dysfunctional.”\n\nThe president’s lawyer is now shopping around for his own lawyer, and it’s unclear at the moment what sort of legal responsibilities he may still have towards Trump. Politico notes that he wasn’t included in the latest strategy session held by Trump’s legal team on impeachment and he hasn’t been on television much lately to plead Trump’s case. Republicans on the Hill have complained loudly and often about him, in particular his wild ranting during TV interviews, which you would think might be all the encouragement Trump needs to toss Rudy under the bus.\n\nThe problem is, Rudy knows things. He was the point man on the president’s irregular diplomacy towards Ukraine about the Biden and CrowdStrike matters and he may be privy to God knows what other damaging information about Trump. He could potentially do tremendous damage to the president as an enemy. So Trump has been nothing but complimentary towards him, including as recently as this morning, saying, “I think Rudy is a great gentleman… He’s been a great crime fighter. He looks for corruption wherever he goes.”\n\nWhich, technically, does appear to be true. Rudy does look for corruption wherever he goes.\n\nAnyway, it may be that the weirder Giuliani gets on TV and the more undisciplined he becomes in butt-dialing reporters, paradoxically the more tightly Trump needs to cling to him. The only thing more dangerous than turning your back on a confidant who knows your secrets is turning your back on a confidant who knows your secrets and who’s behaving erratically. Give him any reason to believe he’s being abandoned and who knows what he’ll do? If Rudy were to end up in front of a House committee in a hostile mood towards Trump, he really could say things that would leave Senate Republicans with little choice but to vote to remove.\n\nAnd that’s why, I think, the Trump/Giuliani saga can only end with a pardon, probably sooner than everyone expects. That would be risky insofar as a pardon would also eliminate Rudy’s right to refuse to testify on Fifth Amendment grounds, but from Trump’s standpoint it’s better to have Giuliani forced to speak feeling that he owes you than Giuliani potentially willing to speak while bearing you a grudge. Stay tuned.", "description": "“We need a few hundred thousand.”", "authors": ["Ed Morrissey", "John Sexton", "Karen Townsend", "Jazz Shaw"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/10/r-7.jpg", "published_at": "2019-10-25"}