{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKBN1X502U-OCASP", "downloaded_at": "2019-10-26 06:48:26.632838+00:00", "title": "NHL roundup: Avs carve up Golden Knights", "language": "en", "text": "Nazem Kadri and Matt Calvert each scored two goals, Pierre-Edouard Bellemare had a goal and two assists and Nathan MacKinnon extended his points streak as the Colorado Avalanche cruised to a 6-1 victory over the Vegas Golden Knights on Friday afternoon in Las Vegas.\n\nOct 25, 2019; Las Vegas, NV, USA; Colorado Avalanche left wing Pierre-Edouard Bellemare (41) passed the puck away from Vegas Golden Knights center William Karlsson (71) during the third period at T-Mobile Arena. Mandatory Credit: Stephen R. Sylvanie-USA TODAY Sports\n\nMacKinnon, who had two assists, became the fifth player in franchise history to open the season with a point streak of at least 10 games.\n\nCale Makar scored his first regular-season NHL goal for Colorado, which finished its season-long six-game road trip with a 4-1-1 mark. Philipp Grubauer finished with 25 saves to improve to 6-1-1 this season.\n\nWilliam Karlsson scored the lone goal for Vegas. Marc-Andre Fleury made 22 saves on 26 shots before being pulled with 7:24 left in the second period. Garret Sparks, making his Golden Knights debut, finished up and had 12 saves on 14 shots.\n\nMaple Leafs 4, Sharks 1\n\nMorgan Rielly scored with just over five minutes to play in the third period to snap a tie and Toronto went on to defeat visiting San Jose.\n\nJake Muzzin, Ilya Mikheyev and Auston Matthews also scored for the Maple Leafs, who had 15 saves from goaltender Frederik Andersen.\n\nKevin Labanc scored for the Sharks, who were playing the third game of a five-game road trip. Martin Jones stopped 25 shots for San Jose.\n\nSabres 2, Red Wings 0\n\nSam Reinhart had a goal and an assist as Linus Ullmark made 41 saves as visiting Buffalo handed punchless Detroit its seventh straight loss.\n\nReinhart notched his fifth goal of the season and Jake McCabe also scored for Buffalo, which bounced back from a 6-2 loss to the New York Rangers on Thursday. Jack Eichel assisted on both goals.\n\nJimmy Howard made 23 saves for the Red Wings, who were blanked for the first time this season and have scored only nine goals in their current slide.\n\nCoyotes 5, Devils 3\n\nBarrett Hayton scored the go-ahead, third-period goal — getting the best of rival teenager Jack Hughes in the process — as Arizona defeated New Jersey in Newark, N.J.\n\nIt was the first career goal for the 19-year-old Hayton, the fifth overall pick in 2018 playing in his first season in the NHL. Arizona also got goals from Nick Schmaltz, Michael Grabner, Oliver Ekman-Larsson and Clayton Keller (empty-netter). Goaltender Antti Raanta made 32 saves.\n\nHughes, the NHL’s No. 1 overall pick this summer, had the best game of his young career, scoring one goal and adding two assists. After going without a goal or assist in his first six NHL games, Hughes is now on a three-game points streak.\n\nIslanders 4, Senators 2\n\nNick Leddy converted a penalty shot to record the second two-goal game of his career, and also added an assist as visiting New York won its sixth straight game with a victory over Ottawa.\n\nMatt Martin had a goal with an assist, and Derick Brassard scored in his second straight game for New York, which is undefeated since losing three of its first four. Tyler Ennis scored his first two goals of the season for Ottawa, which went 1-for-6 on the power play and is 2-for-33 on the season.\n\nThomas Greiss stopped 30 shots for his third straight victory in net for the Islanders. Anders Nilsson made his third straight start for the Senators, but was pulled in the second period after allowing all four goals, including two in 70 seconds.\n\n—Field Level Media", "description": "Nazem Kadri and Matt Calvert each scored two goals, Pierre-Edouard Bellemare had a goal and two assists and Nathan MacKinnon extended his points streak as the Colorado Avalanche cruised to a 6-1 victory over the Vegas Golden Knights on Friday afternoon in Las Vegas.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191026&t=2&i=1445103072&w=1200&r=LYNXMPEF9P04S-OCASP", "published_at": "2019-10-26"}