{"pub": "yahoo", "url": "https://news.yahoo.com/treasury-promises-transparency-humanitarian-aid-210137698.html", "downloaded_at": "2019-10-26 00:59:17.998806+00:00", "title": "Treasury Promises \"Transparency\" For Humanitarian Aid To Iran", "language": "en", "text": "The U.S. Treasury Department on Oct. 25 said it has established a new \"mechanism\" to ensure that financial transactions and commercial exports to Iran involving humanitarian aid are not siphoned off to support Iranian weapons programs or terrorist groups.\n\nThe mechanism, which promises \"transparency\" for continued humanitarian trade with Iran, will be developed by Treasury's Financial Crimes Enforcement Network (FinCEN). The agency said the mechanism is necessary, since Iran has been identified as a \"jurisdiction of primary money-laundering concern\" under the 2001 USA Patriot Act.\n\n\"This new humanitarian mechanism will help international companies that seek to engage in permissible humanitarian trade with Iran to ensure that they do not run afoul of sanctions,\" said Treasury Secretary Steven Mnuchin in a statement.\n\nThe \"final rule\" for developing this new mechanism will take effect 10 days after publication in the Federal Register, Treasury said.\n\nTreasury will work with its counterparts at the State Department to establish a process to ensure that participating governments and financial institutions commit to conducting enhanced due diligence to mitigate the risks associated with Iran-related transactions.\n\n\"Through this new mechanism, no revenue or payment may flow to the Iranian regime,\" said Sigal Mandelker, Treasury undersecretary for terrorism and financial intelligence. \"This framework will provide unprecedented transparency to help ensure that humanitarian goods entering Iran actually reach the Iranian people.\"\n\nAccording to Treasury, overseas governments and banks that choose to participate in the mechanism must conduct due diligence and provide a \"substantial and unprecedented amount of information\" on a monthly basis to the department to demonstrate that they are compliant.\n\nTreasury said the mechanism will continue to prevent business from being conducted with persons and entities on the Office of Foreign Assets Control's Specially Designated Nationals and Blocked Persons (SDN) List.\n\nThe FinCen mechanism, which can be used by U.S. persons and U.S.-owned or -controlled foreign entities, as well as non-U.S. entities, will require participating overseas governments and banks to report any suspicious transactions to the Treasury.\n\nTreasury estimates that Iran provides about $700 million of Hizballah's estimated $1 billion annual budget, while Hamas receives as much as $300 million per year. The U.S. has designated both Hizballah and Hamas as terrorist groups.\n\nImage by olafpictures from Pixabay\n\nSee more from Benzinga\n\n© 2019 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "description": "The U.S. Treasury Department on Oct. 25 said it has established a new \"mechanism\" to ensure that financial transactions and commercial exports to Iran involving humanitarian aid are not siphoned off to support Iranian weapons programs or terrorist groups.  The mechanism, which promises \"", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-25"}