{"pub": "breitbart", "url": "https://breitbart.com/the-media/2019/10/16/trump-smacks-down-abc-news-for-fake-news-footage-of-syria", "downloaded_at": "2019-10-16 20:48:42.948758+00:00", "title": "Trump Smacks Down ABC News for ‘Fake News’ Footage of Syria", "language": "en", "text": "President Donald Trump rebuked ABC News’ Jonathan Karl publicly during a press conference Wednesday for the network’s claim that footage from a Kentucky gun range was in fact footage of Turkey bombing Kurds in Syria.\n\nAt the press conference, which featured the president alongside Italian President Sergio Mattarella, Karl asked Trump whether he had “any regret for giving [Turkish president Recep Tayyip] Erdogan the green light to invade?”\n\n“I didn’t give him a green light,” the president replied, going on to note that the U.S. had a very small number of soldiers near the border, and that he had written a “very powerful letter” to Erdogan opposing Turkey’s invasion of Syria.\n\n“And when you ask a question like that, that’s very deceptive, Jon, it’s almost as deceptive as you showing all of the bombings taking place in Syria, and it turned out that the bombing that you showed on television took place in Kentucky. So, you know. And I’m not even sure that ABC apologized for that. But certainly, it was a terrible thing.”\n\n“I think ABC owes an apology,” he added.\n\nTrump was referring to a story that ABC News ran on Sunday and Monday in which it claimed that t had obtained video footage showing the war in Syria. As Breitbart News noted:\n\nThe footage, which ABC News purported was of an attack on the border town of Tal Abyad, was aired Sunday on World News Tonight and Good Morning America on Monday morning. However, a comparison by Gizmodo shows the video was captured at Knob Creek Gun Range in West Point, Kentucky back in 2017.\n\nThe Washington Examiner reported that the video footage had been tweeted by a Turkish politician from Erdogan’s party, in celebration of Turkey’s offensive. That footage remains on Twitter:\n\nABD’NİN YPG’YE VERDİĞİ MÜHİMMATIN BİR SEFERDE NE KADAR’I İMHA EDİLMİŞTİR DERSİNİZ? pic.twitter.com/spDFTtS3qi — İbrahim Melih Gökçek (@06melihgokcek) October 9, 2019\n\nHowever, the footage turn out to be from Kentucky:\n\nThe Examiner noted that ABC News had taken down its video stories, and issued a correction and apology, but that it had not done so on the air as of Tuesday.\n\nAt the press conference, Karl — the network’s chief White House correspondent — continued, without acknowledging the president’s criticism: “[Senator] Lindsey Graham just said of your remarks that you made in the Oval Office that if you keep talking like that, “this will be disaster worse than Obama’s decision to leave Iraq.”\n\nTrump retorted that “Lindsey Graham would like to stay in the Middle East for the next thousand years. … I want to get out of the Middle East.” He said that Graham should focus on the Senate Judiciary Committee, which he chairs, and ought to focus on the effort by the FBI and the intelligence agencies to monitor his campaign during the 2016 election. “The people of South Carolina don’t want us to get into a war with Turkey — a NATO member — or with Syria. Let them fight their own wars.”\n\nHe added: “You should get your accounts correct. You shouldn’t be showing buildings blowing up in Kentucky and say[ing] it’s Syria, because that really is fake news.”\n\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.", "description": "Trump rebuked ABC News' Jonathan Karl during a press conference for the network's claim footage from a Kentucky gun range was from Syria.", "authors": ["Joel B. Pollak"], "top_image": "https://media.breitbart.com/media/2019/10/Donald-Trump-Jonathan-Karl-Getty-640x335.jpg", "published_at": "2019-10-16"}