{"pub": "npr", "url": "https://npr.org/sections/health-shots/2019/09/19/762306652/as-vaping-illnesses-rise-doctors-warn-of-possible-irreversible-damage-to-lungs", "downloaded_at": "2019-09-19 23:06:17.257503+00:00", "title": "As Vaping Illnesses Rise, Doctors Warn Of Possible 'Irreversible Damage' To Lungs", "language": "en", "text": "As Vaping Illnesses Rise, Doctors Warn Of Possible 'Irreversible Damage' To Lungs\n\nEnlarge this image toggle caption alvarez/Getty Images alvarez/Getty Images\n\nNationwide, people who vape continue to sicken with severe and unexplained lung illness, leaving doctors and patients concerned about both the acute and long-term effects of the injuries.\n\nThe Centers for Disease Control and Prevention announced Thursday that there are now 530 confirmed or probable cases of lung injury associated with vaping, a jump from 380 cases reported last week. Seven people have died.\n\n\"We at CDC are very concerned about the occurrence of life-threatening illness in otherwise healthy, young people,\" said Dr. Anne Schuchat, the CDC's principal deputy director, during a call with reporters.\n\nShe said this is an ongoing outbreak: \"States continue to get new cases reported.\"\n\nThe CDC has ramped up its investigation, activating its Emergency Operations Center this week in an effort to nail down the cause of the illnesses, which remains unclear. In addition, the Food and Drug Administration has enlisted the help of its office of criminal investigations, the law enforcement arm of FDA.\n\n\"We are in desperate need of facts,\" the FDA's Mitch Zeller said during a call with reporters Thursday.\n\nSo far, it appears that most patients have fallen ill after vaping THC — a psychoactive component in cannabis — nicotine or a combination of both. Symptoms include severe pneumonia, in many cases. Patients can recover from the acute problem that led them to the hospital, but long-term impacts are unknown.\n\nOne patient, Adam Hergenreder, 18, of Gurnee, Ill., who was hospitalized with a severe vaping-related respiratory sickness in August, said his doctor told him that he has the \"lungs of a 70-year-old.\"\n\nIt's \"terrifying to think about,\" Hergenreder told NPR. He was vaping THC but says he did not know it could be dangerous. He says he's feeling better since his hospitalization, but he still gets winded going up stairs.\n\nIn the hospital, he says, \"they caught an image of the bottom portion of my lungs, and that's when they realized the severity of the damage.\"\n\nHis story has garnered a lot of media attention, in part because he's part of a lawsuit against the manufacturer of the vape products he used.\n\nHis case raises an important question: Can the patients who've fallen seriously ill after vaping expect to make a full recovery? We spoke to doctors who have treated some of the patients.\n\nWakeMed Hospital in Raleigh, N.C., has treated seven patients who became ill after vaping. \"All of the patients we've seen here have improved,\" says Daniel Fox, a pulmonologist and critical care expert at WakeMed. \"All have been able to leave the hospital,\" he says.\n\nMany of the patients were diagnosed with lipoid pneumonia, which means that \"oils or fats have entered the lung that should not be there,\" Fox explains.\n\nThis is usually seen in elderly patients and related to choking or aspiration. So Fox says it was a surprise to see this in younger patients. But it adds up, given that different types of oils are used in vaping cartridges and other delivery devices.\n\nFox says it is not clear which substances or compounds in the vaping products are leading to harm. But \"when these substances enter the lungs, it can cause a profound inflammatory reaction — that makes people really sick,\" Fox says.\n\nThe patients will continue to be monitored. And Fox says that while it's unclear whether there are any long-term health effects, acute lung illnesses like these can put people at risk.\n\n\"There is probably at least some irreversible damage that is done every time you have a significant inflammatory reaction within the lung tissue,\" Fox says.\n\n\"Inflammation can cause scarring in the lungs,\" agrees Scott Schroeder, a pediatric pulmonologist at Tufts Medical Center, where two patients with vaping-related lung injuries have been treated.\n\nHe says that depending on the severity, these illnesses may increase the risk of developing a range of lung conditions down the road, including signs of asthma or chronic obstructive pulmonary disease. But he says it's too soon to say if the patients sickened in this outbreak will suffer long-term damage.\n\nPatients' outcomes will depend on how much and what they vape, combined with their other behaviors and risk factors, he says.\n\nThough it may sound scary to hear that an 18-year-old patient has been told he has the lungs of a 70-year-old, this may not mean very much, Schroeder says.\n\n\"I mean, there's very healthy 70-year-olds out there,\" he says. \"Do you have the lungs of a 70-year-old smoker or the lungs of a 70-year-old athlete?\"\n\nSchroeder says that both vaping patients treated at his hospital are doing very well and that they'll continue to monitor their progress.", "description": "With more than 500 cases of acute vaping illness reported, doctors worry about the long-term effects on patients' lungs. And federal agencies still don't know what's behind the outbreak.", "authors": ["Allison Aubrey"], "top_image": "https://media.npr.org/assets/img/2019/09/19/lungs-2_wide-3578e228f15bb2e2e0f22108a1c137c91bcf8a8e.jpg?s=1400", "published_at": "2019-09-19"}