{"pub": "breitbart", "url": "https://breitbart.com/news/patriots-move-to-7-0-by-beating-jets-on-mnf", "downloaded_at": "2019-10-22 13:19:09.589546+00:00", "title": "Patriots move to 7-0 by beating Jets on MNF", "language": "en", "text": "Oct. 22 (UPI) — The New England Patriots moved to 7-0 by shutting out the New York Jets on Monday Night Football.\n\nNew England’s top-ranked defense held New York to 154 total yards of offense and forced six turnovers in the 33-0 triumph Monday at MetLife Stadium in East Rutherford, N.J. Quarterback Sam Darnold completed 11 of 32 passes for 86 yards and had four interceptions and a fumble for the Jets (1-5).\n\n“It’s always good to win,” Patriots coach Bill Belichick told reporters. “I think we’re confident, but we’ll have to start all over again. We emptied the tank tonight. We’ll have to fill it up for next week and be ready to empty it again next week against Cleveland. That’s the way it is every week in this league.”\n\nPatriots quarterback Tom Brady completed 31 of 45 passes for 249 yards, a touchdown and an interception in the win. Running back Sony Michel scored three touchdowns for the Patriots.\n\n“Obviously, that was brutal,” Jets coach Adam Gase said. “We just didn’t do anything right. We were bad in all three phases. It was just a bad performance. Can’t play that way against these guys or else you’ll look like that. It’s just not good. We have a lot of work to do.”\n\nThis defense is ridiculous. @dharm32 | #GoPats pic.twitter.com/8VtWr6yx3w— New England Patriots (@Patriots) October 22, 2019\n\nMichel scored his first touchdown on the game’s opening drive. The Patriots star finished off a 16-play, 78-yard possession with a 3-yard rushing score to give the Patriots a 7-0 lead. Devin McCourty intercepted Darnold on the following drive. Mike Nugent then hit a 34-yard field goal to give the Patriots a 10-0 edge. Brady found Phillip Dorsett with a 26-yard touchdown pass on the Patriots’ next drive.\n\nMichel scored on a 1-yard run to give New England a 23-0 lead in the second quarter. The Patriots added a safety in the third quarter before Michel scored for a third time in the fourth frame. Neither team scored points over the final 12:36.\n\nThe Patriots host the Cleveland Browns at 4:25 p.m. EDT Sunday at Gillette Stadium in Foxborough, Mass. The Jets face the Jacksonville Jaguars at 1 p.m. EDT Sunday at TIAA Bank Field in Jacksonville.", "description": "Oct. 22 (UPI) — The New England Patriots moved to 7-0 by shutting out the New York Jets on Monday Night Football. New England’s top-ranked", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-22"}