{"pub": "atlantic", "url": "https://theatlantic.com/education/archive/2019/09/back-school-night-single-parent/598240", "downloaded_at": "2019-09-18 12:48:42.068556+00:00", "title": "Back-to-School Night Is Hard for Single Parents", "language": "en", "text": "Single parents account for a growing share of families in the United States. But they still often experience “insecurity about raising children alone without help,” as a team of education scholars and psychologists write in a 2018 book about single parenthood in the 21st century. Stereotypes about single parents abound, as do cultural messages about the importance of two-parent families. Events such as back-to-school nights can reinforce to single parents the message society often sends them that their parenting is insufficient or incomplete.\n\nRead: Why back-to-school season feels like the new year—even for adults\n\nSuch events are almost always premised on traditional notions of child-rearing as a joint endeavor, argues Maurice Elias, a psychology professor at Rutgers University who has attended and observed many back-to-school nights over his four decades of studying social-emotional learning and student success. Schools often ask parents to attend back-to-school nights without their kids, but don’t offer child-care options. This forces parents to find a way to fit the one-off occasion into their schedules—and pay for child care—or simply not come.\n\n“There’s a tremendous amount of juggling involved,” Elias told me. “If you’re a single parent for any reason—and you could be a ‘single parent’ because your husband or wife travels for business—then you have to figure out, especially if you have more than one child and the back-to-school nights aren’t coordinated, What am I going to do here?”\n\n“Nothing [in schools] accommodates single parents,” Sarah Netter, a freelance writer based in New Orleans who’s the sole caregiver, by choice, of her first-grade adopted son, told me. “The fact of the matter is I just can’t physically be in two places at once.” She notes that her coordination struggles are also felt by families with two working parents.\n\n“Schools aren’t thinking about working parents when they schedule things,” Netter says, noting that other events, such as parent-teacher conferences and bring-your-parent-to-lunch days, rest on the assumption that kids have a parent who doesn’t work or who can get time off, or that parents can find and afford child care. Netter says she’s almost always the only single parent in attendance at school functions.\n\n“I’ve rarely seen a satisfactory back-to-school night,” Elias says, “and one of the issues is that because some parents can’t or won’t come, we don’t know what they would think of back-to-school night if they were there.”\n\nA school, of course, can only do so much to ameliorate the logistical and emotional stress of being a single parent. But some tweaks to back-to-school night could help, Elias and others say—such as providing free child care, allowing parents to make up a missed orientation, or substituting the one-off event with a series of regular one-on-one check-ins between teacher and parent.\n\n“So much of what the school does is catered toward stay-at-home parents,” Netter says. “Hopefully, by attending my son’s events, I can show people what single parenthood looks like.”\n\nWe want to hear what you think about this article. Submit a letter to the editor or write to letters@theatlantic.com.", "description": "Meant to be welcoming, such events can make solo parents feel isolated.", "authors": ["Alia Wong"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/AP_17058679794273/facebook.jpg?1568753038", "published_at": "2019-09-18"}