{"pub": "independent", "url": "https://independent.co.uk/sport/football/premier-league/chelsea-news-frank-mason-mount-frank-lampard-england-vs-bulgaria-a9093946.html", "downloaded_at": "2019-09-06 12:15:52.698343+00:00", "title": "Chelsea news: No manager better to learn from than Frank Lampard, says Mason Mount", "language": "en", "text": "Chelsea midfielder Mason Mount believes he has the ideal teacher in manager Frank Lampard to help him fine-tune his burgeoning goalscoring ability, the 20-year-old has said.\n\nMount, who played under Lampard at Derby County last season before following him to Chelsea, has scored two league goals in four games for the London club and credits his strong form to the Premier League club’s record goal-scorer.\n\n“There is no better person to learn from than him,” Mount, who could earn his first senior England cap when they take on Bulgaria on Saturday, told reporters.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“After training we do finishing sometimes. I’m obviously talking to him every day, especially after the games -- what I can do better, where I can make the runs and where I can get into the box.”\n\nLampard, who made 648 appearances scoring 211 goals for Chelsea between 2001-2014, has promoted young talent in his opening few matches and Mount is thriving under the former England midfielder.\n\nShape Created with Sketch. International XI Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. International XI 1/11 Jan Oblak Slovenia Getty 2/11 Joshua Kimmich Germany Getty 3/11 Kalidou Koulibaly Senegal 4/11 Virgil van Dijk Netherlands 5/11 Andrew Robertson Scotland Action Images via Reuters 6/11 N'Golo Kante France PA 7/11 Kevin De Bruyne Belgium EPA 8/11 Luka Modric Croatia AFP/Getty 9/11 Moahamed Salah Egypt Liverpool FC via Getty Images 10/11 Lionel Messi Argentina Getty 11/11 Cristiano Ronaldo Portugal Getty Images 1/11 Jan Oblak Slovenia Getty 2/11 Joshua Kimmich Germany Getty 3/11 Kalidou Koulibaly Senegal 4/11 Virgil van Dijk Netherlands 5/11 Andrew Robertson Scotland Action Images via Reuters 6/11 N'Golo Kante France PA 7/11 Kevin De Bruyne Belgium EPA 8/11 Luka Modric Croatia AFP/Getty 9/11 Moahamed Salah Egypt Liverpool FC via Getty Images 10/11 Lionel Messi Argentina Getty 11/11 Cristiano Ronaldo Portugal Getty Images\n\nHis goals against Leicester City and Norwich City caught the eye of England boss Gareth Southgate who called him up for their Euro 2020 qualifiers against Bulgaria and Kosovo.\n\nMount is hoping he can get lucky this time around after missing out on a maiden cap in October last year.\n\n“When I got called up first last year, he [Lampard] sat me down in his office and said I was called up,” Mount said.\n\n“It was a massive moment ... this time, he just spoke to me and said, ‘you’ve been called up again, go into it working hard like you’ve been doing at Chelsea’.\n\n“It’s such an exciting time for English football. He said just go there and enjoy playing football.”\n\nReuters", "description": "Chelsea midfielder Mason Mount believes he has the ideal teacher in manager Frank Lampard to help him fine-tune his burgeoning goalscoring ability, the 20-year-old has said. Mount, who played under Lampard at Derby County last season before following him to Chelsea, has scored two league goals in four games for the London club and credits his strong form to the Premier League", "authors": ["Shrivathsa Sridhar"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/06/08/Mason-Mount.jpg", "published_at": "2019-09-06"}