{"pub": "metro", "url": "https://metro.co.uk/2019/10/17/three-network-outage-leaves-thousands-unable-make-calls-use-data-10933022", "downloaded_at": "2019-10-17 08:06:31.581313+00:00", "title": "Three network outage leaves thousands unable to make calls or use data", "language": "en", "text": "Three customers are furious at the outage (Three)\n\nMobile network Three has suffered a huge outage across parts of the UK leaving customers unable to use their phones.\n\nThose affected weren’t able to make calls or use roaming data as the blackout descended.\n\nThousands of customers have taken to social media to confirm the problems, which appeared to have started during the night. Many reports started coming in at around 6am on Thursday, October 17.\n\nDown Detector, the independent website which measures outages on popular platforms and networks around the globe, registered a peak of over 3,000 Three customers experiencing problems.\n\nCustomers in Manchester, Leeds, Newcastle have all reported problems with one user writing: ‘Not working in Newcastle – had issues since 11pm last night. Keeps saying no service. No 3G/4G.’\n\nOthers vented their frustrations on Twitter.\n\n@ThreeUK @ThreeUKSupport so my network and mobile usage I'm paying for has been down for at least 3 hours now with issues earlier today as well. When will it be back up and what compensation will we be receiving? #ThreeUK #Three #ThreeMobileDown — Jared Greenall (@Jared_Greenall) October 17, 2019\n\nWhen you relly on your mobile data for work and it was down for 4 and a half hours😒😒 thanks Three network — Chii (@RhiiTv) October 17, 2019\n\nWe’re in 2019. How is there still such thing as a phone network being down? Oh wait, it’s three! #ThreeUK #threedown #threemobile — Steph Reid (@stephtwittorXX) October 17, 2019\n\nAdvertisement\n\nAdvertisement\n\nThree has responded to the affected users saying it is aware of the problem and is updating its systems to try and cope.\n\nThree seems to be aware of the outage (Three)\n\nOne user received the following message from the company:\n\n‘I’m sorry we have a system outage and our systems are being updated right now. We are not able to pull up the relevant details and will not be able to help you right now.\n\n‘We would request you kindly chat back after 2-3 hours. We really appreciate your patience and understanding.’\n\nTheir system is down, just got this info from their online chat pic.twitter.com/vRRZtCxy2d — Fábio Rodrigues (@rodriguesfhs) October 16, 2019\n\nThis map shows the Three outage across the UK (Downdetector)\n\nMetro.co.uk has contacted Three for a comment on this issue and we’ll update this story when we have further information.", "description": "The mobile network went down on Thursday morning", "authors": ["Jeff Parsons"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/maidenheadstore-display-hi-9656_1571294937.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-17"}