{"pub": "nymag", "url": "https://vulture.com/2019/09/felicity-huffman-faces-one-month-in-prison-over-college-scam.html", "downloaded_at": "2019-09-07 02:17:15.321808+00:00", "title": "Felicity Huffman Faces One Month In Prison Over College Scam", "language": "en", "text": "Photo: JOSEPH PREZIOSO/AFP/Getty Images\n\nAlmost five months after pleading guilty to conspiracy to commit mail fraud and honest services mail fraud, Felicity Huffman could be facing a month in prison for her role in this spring’s explosive college admissions cheating scandal. According to TMZ, while the actress could legally be sentenced to upwards of twenty years for her involvement in the scam, federal prosecutors submitted a filing Friday asking that Huffman serve one month in prison and pay $20,000 in fines. Her attorneys, meanwhile, are requesting the actress receive probation and community service. Huffman is set to be sentenced on September 13.\n\nAs you might recall, the Desperate Housewives star was identified by Operation Varsity Blues alongside fellow actress Lori Loughlin and dozens of other affluent parents of college-age children, many of whom pleaded guilty to various related charges. Huffman admitted to paying $15,000 to Key Worldwide Foundation, a fake charity run by William Rick Singer, with the express purpose of elevating her daughter’s SAT score. Singer had helped other parents get their children into the colleges of their choosing by falsifying documentation claiming them to be recruited athletes.\n\n“I have betrayed her,” Huffman said in a statement in April ahead of her guilty plea (she claims her daughter had no knowledge of the scheme). “This transgression toward her and the public I will carry for the rest of my life. My desire to help my daughter is no excuse to break the law or engage in dishonesty.”", "description": "Felicity Huffman is reportedly facing one month in prison for her involvement in the college-admissions scam investigated in Operation Varsity Blues, per prosecutors’ suggestion.", "authors": ["Halle Kiefer"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/08/26/6-Felicity-Huffman.w1200.h630.jpg", "published_at": "2019-09-06"}