{"pub": "fox", "url": "https://foxnews.com/media/a-recent-campaign-ad-could-take-one-democrat-to-the-top-of-the-primary-frank-luntz-says", "downloaded_at": "2019-10-30 02:26:45.882079+00:00", "title": "One Democrat could surge to front of primary pack thanks to new ad campaign, Frank Luntz says", "language": "en", "text": "Many of the 2020 candidates have put out positive campaign ads, but one Democrat's ad could lead straight to the top of the primary heap, according to Frank Luntz.\n\nThat candidate? Elizabeth Warren.\n\nA good campaign ad is credible, memorable and thought-provoking, Luntz told Bret Baier on Tuesday on \"Special Report.\"\n\n\"You've got to be credible,\" he said. \"You have to be able to believe it -- the information, what it communicates, the data behind it. ... It has to make you think so it sticks with you.\"\n\nBaier played several recent campaign ads from top 2020 contenders.\n\nTRUMP IMPEACHMENT INQUIRY CONTINUES TO BE 'THREE-RING CIRCUS,' RICK SCOTT SAYS\n\nAn ad from President Trump highlighted how he continues to satisfy 2016 campaign promises despite the Russia investigation and Ukraine-related impeachment inquiry.\n\n\"Mister Nice Guy won't cut it,\" the male narrator says. \"It takes a tough guy to change Washington.\"\n\nIn response, Luntz said the \"Mister Nice Guy\" phrase is key to the ad, because it is memorable.\n\n\"He looks tough. He looks strong. One of the reasons why he won is because he's tough as nails,\" the pollster said of the president.\n\nIn another ad, Sen. Elizabeth Warren, D-Mass., narrates her policy platform, promising to \"stand up to Wall Street,\" reminding voters how she defeated \"popular Republican\" Sen. Scott Brown, R-Mass., in 2012 -- and claiming to voters the \"wealthy and well connected have rigged the system for themselves.\"\n\nBut, Luntz said it was a visual from the advertisement that made her spot very powerful.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nIn the ad, Treasury Secretary Steve Mnuchin can be seen holding up a table-size stack of uncut dollar bill prints fresh off the printer.\n\n\"That's the sign that people remember,\" Luntz said, \"That ad, I think, and the language Elizabeth Warren is using is one of the reasons she has surged in the polls over the last 60 days.\"\n\nLuntz predicted continued \"tough talk\" and ads like that could be powerful enough to propel her to the top of the primary contest.\n\nHe claimed former Vice President Joe Biden faces an uphill climb in the first four primary and caucus states -- Iowa, New Hampshire, Nevada and South Carolina, while Warren has a chance to win many of those contests.\n\nLuntz added Biden's ad was not as strong as Warren's, saying the video doesn't match the narration, in that pictures of the Delaware Democrat shaking hands with voters doesn't match tough talk about his ability to beat Trump.", "description": "Many of the 2020 candidates have put out positive campaign ads, but one Democrat's ad could lead them to the top of the primary heap, according to Frank Luntz", "authors": ["Charles Creitz"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/baier-luntz.jpg", "published_at": "2019-10-29"}