{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/08/donald-trump-blocks-ambassador-from-testifying-to-democrat-led-kangaroo-court", "downloaded_at": "2019-10-08 16:22:11.476286+00:00", "title": "Donald Trump Blocks Ambassador from Testifying to 'Kangaroo Court'", "language": "en", "text": "President Donald Trump blocked a key ambassador on Monday from testifying to Congress, as Democrats continue their impeachment inquiry based on the president’s phone call with Ukranian President Volodymyr Zelensky.\n\nThe State Department directed Ambassador to the European Union (E.U.) Gordon Sondland not to appear Tuesday for interviews with Democrat-led investigative committees.\n\n“I would love to send Ambassador Sondland, a really good man and great American, to testify, but unfortunately he would be testifying before a totally compromised kangaroo court, where Republican’s rights have been taken away, and true facts are not allowed out for the public to see,” Trump wrote on Twitter.\n\nSondland’s texts about organizing a call between President Trump and the Ukranian president were featured in the investigative committee interviews with Kurt Volker, an American diplomat working in Ukraine.\n\nTrump referred to Sondland’s text admonishing Volker for suggesting that Trump was trying to extort Ukraine into investigating the Bidens before making the call.\n\n“I believe you are incorrect about President Trump’s intentions,” he wrote. “The President has been crystal clear: no quid pro quo’s of any kind.”\n\n“That says it all!” Trump wrote on Twitter.\n\nI would love to send Ambassador Sondland, a really good man and great American, to testify, but unfortunately he would be testifying before a totally compromised kangaroo court, where Republican’s rights have been taken away, and true facts are not allowed out for the public…. — Donald J. Trump (@realDonaldTrump) October 8, 2019", "description": "President Donald Trump blocked a key ambassador on Monday from testifying to Congress, as Democrats continue their impeachment inquiry.", "authors": ["Charlie Spiering"], "top_image": "https://media.breitbart.com/media/2019/10/Gordon-Sondland-640x335.jpg", "published_at": "2019-10-08"}