{"pub": "cnn", "url": "https://amnesty.org.uk/press-releases/iran-horrific-death-football-fan-sahar-khodayari-must-mean-end-women-stadium-ban", "downloaded_at": "2019-09-13 00:05:38.465105+00:00", "title": "Iran: 'horrific' death of football fan Sahar Khodayari must mean end of women stadium ban", "language": "en", "text": "Iran is the only country in the world that stops and punishes women seeking to enter football stadiums\n\n29-year-old poured petrol over herself last week after being charged with ‘appearing in public without a hijab’\n\n‘Her death must not be in vain’ - Philip Luther\n\nResponding to reports that Sahar Khodayari - a woman in Iran who set herself on fire after being summoned to court for trying to enter a football stadium in Tehran - has died from her horrific injuries, Philip Luther, Amnesty International’s Middle East Research and Advocacy Director, said:\n\n“What happened to Sahar Khodayari is heartbreaking. “Her only ‘crime’ was being a woman in a country where women face discrimination that is entrenched in law and plays out in the most horrific ways imaginable in every area of their lives, even sports. “To our knowledge, Iran is the only country in the world that stops and punishes women seeking to enter football stadiums. “This discriminatory ban must end immediately and the international community - including football’s world governing body, FIFA, and the Asian Football Confederation - must take urgent action to end the ban and to ensure that women are allowed access to all sports stadiums without discrimination or risk of prosecution or punishment. “While the Iranian authorities have allowed small numbers of women to enter football stadiums on a handful of occasions, these have amounted to nothing more than publicity stunts, rather than meaningful steps to lifting the ban on women altogether. “Amnesty International believes that Sahar Khodayari would still be alive if it were not for this draconian ban and the subsequent trauma of her arrest, detention and prosecution for attempting to circumvent it. Her death must not be in vain. It must spur change in Iran if further tragedies are to be avoided in the future.”\n\nFavourite football team\n\nIn March, 29-year-old Sahar Khodayari dressed as a man and attempted to enter Iran’s national football stadium in Tehran to watch a match between her favourite football team, Esteghlal of Iran, and Al-Ain of the United Arab Emirates, during the AFC Asian Cup. She was stopped from entering when security guards discovered she was a woman and then detained for two days in Shahr-e Rey prison (also known as Gharchak), a disused chicken farm holding hundreds of women convicted of violent offences in overcrowded and unhygienic conditions. She was released on bail two days later.\n\nAmnesty understands that Khodayari - who had been released on bail - was summoned to a Revolutionary Court in Tehran last week (2 September) to face charges over the stadium incident. She was charged with “openly committing a sinful act by … appearing in public without a hijab” and “insulting officials”. The case was adjourned and, after she left the court, she poured petrol over herself and set herself on fire outside the courthouse. According to hospital officials, she received burns on 90% of her body and died yesterday.\n\nCompulsory veiling laws\n\nAmnesty has repeatedly raised concerns about Iran’s compulsory veiling laws, which have violated women’s rights for decades - including their rights to non-discrimination, freedom of belief and religion, freedom of expression, and protection from arbitrary arrests and detention. Almost 60,000 have supported Amnesty’s current campaign on behalf of three women given long jail sentences for opposing the veiling laws.\n\n", "description": "Iran is the only country in the world that stops and punishes women seeking to enter football stadiums\n29-year-old poured petrol over herself last week after being charged with ‘appearing in public without a hijab’\n‘Her death must not be in vain’ - Philip Luther", "authors": [], "top_image": "https://www.amnesty.org.uk/files/2019-09/Iran_1.jpg?U65eW6HffELvfi.TGZDx9Wj79ApzBb0i", "published_at": "2019-09-13"}