{"pub": "reuters", "url": "https://af.reuters.com/article/worldNews/idAFKBN1X92R9", "downloaded_at": "2019-10-30 23:30:25.338464+00:00", "title": "German coalition needs to prove its worth - Finance Minister Scholz", "language": "en", "text": "BERLIN (Reuters) - Germany’s ruling grand coalition needs to show it is in step with the times and can deliver in the next two years, Finance Minister and Social Democrat (SPD) leadership candidate Olaf Scholz told the Sueddeutsche Zeitung newspaper.\n\nGerman Finance Minister Olaf Scholz holds a news conference on tax revenues in Berlin, Germany, October 30, 2019. REUTERS/Fabrizio Bensch\n\nScholz, who also serves as vice chancellor in the coalition, came first in a vote to elect a new SPD leader, the party said on Saturday, but he fell short of a majority.\n\nThe result triggered a run-off set to fuel debate over whether to stay in government with Chancellor Angela Merkel’s Christian Democrats (CDU) and their Bavarian CSU allies. The SPD is due to review its role in government by the end of the year.\n\n“The coalition must show that it is in tune with the times and has ideas about what to do in the next two years to be legitimate,” Scholz said, adding that the SPD wanted to pass reforms to workers’ rights, old-age provision, and taxes.\n\nThe existing parliament is due to run until 2021.\n\nScholz ruled out a repeat of the so-called grand coalition.\n\n“Germany needs a government, without CDU and CSU,” he said in an interview to run in the Sueddeutsche’s Thursday edition.\n\nThe run-off vote for the SPD leadership will take place next month and a party conference in December must then formally approve the vote.\n\nThe SPD, Germany’s oldest party, is in crisis. Polling at around 14%, it is barely off all-time lows and has been leaderless since June when Andrea Nahles quit after scoring its worst ever result in an election for the European parliament.\n\nMany members want the SPD to ditch the alliance with Merkel and reinvent itself in opposition. As Merkel’s junior partner in 10 of the 14 years she has led Europe’s biggest economy, they say the SPD has had to compromise too much on policy.\n\nTurning to Germany’s public finances, Scholz said he opposed an idea - floated by the CSU - of issuing so-called ‘green bonds’ with higher coupons to attract investment from citizens.\n\nBut he added that from next year, the government planned to issue standard rate-paying bonds, the proceeds of which would be invested exclusively in sustainable projects.\n\n“The interest they pay will be the same as the classic government bonds, but they will be green,” he said.\n\nScholz added that a financial transaction tax would be introduced from Jan. 1, 2021. Asked if this would be implemented nationally or across Europe, he replied: “Everything speaks in favour of a European solution.”\n\nPlans for an EU financial transaction tax have stumbled in recent years. After an initial proposal in 2011 was blocked by member governments, a group of states pressed ahead, while the majority of the 28 EU states backed down.", "description": "Germany's ruling grand coalition needs to show it is in step with the times and can deliver in the next two years, Finance Minister and Social Democrat (SPD) leadership candidate Olaf Scholz told the Sueddeutsche Zeitung newspaper.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191030&t=2&i=1446710497&w=1200&r=LYNXMPEF9T22S", "published_at": "2019-10-30"}