{"pub": "yahoo", "url": "https://news.yahoo.com/fund-managers-dont-think-trumps-trade-war-will-ever-be-resolved-survey-122500959.html", "downloaded_at": "2019-10-15 15:06:46.115877+00:00", "title": "Fund managers don’t think Trump’s trade war will ever be resolved: survey", "language": "en", "text": "U.S. President Donald Trump speaks during a meeting with China's Vice Premier Liu He in the Oval Office at the White House after two days of trade negotiations in Washington, U.S., October 11, 2019. REUTERS/Yuri Gripas\n\nBank of America Merrill Lynch’s monthly fund manager survey revealed some shocking insights about how the investor community views President Trump’s trade war with China.\n\nSome 43% of respondents don’t think the trade war will be resolved and view the situation as the “new normal.” Only 36% of respondents expect a solution prior to the 2020 presidential election.\n\nMore broadly, some 40% of respondents view trade as the biggest “tail risk” for the markets.\n\nAn ‘end’ to the trade war?\n\nTrade tensions, which have persisted for roughly 18 months, have finally started to show signs of easing, with the U.S. and China agreeing to a phase 1 trade deal last Friday, which sent the broader stock market back within a stone’s throw away from record highs. Though the deal isn’t yet signed in writing.\n\nThe aforementioned fund manager survey was conducted on Oct. 4-10, prior to the phase 1 trade deal reached on Oct. 11. Still, 75% of respondents say “an end to the trade war would be the most bullish catalyst for stocks in the next six months.”\n\n“Investors remain bearish but we are seeing signs of green shoots,” said Michael Hartnett, chief investment strategist at Bank of America Merrill Lynch. “If concerns about the trade war and Brexit are unrealized, sentiment is likely to improve, validating our bullish tactical views.”\n\nThe bearish sentiment Hartnett references is seen in the increased cash levels that fund managers maintained, rising to 5%, compared to 4.7% in September. That’s still below June’s record high of 5.7%.\n\nThe survey included 230 respondents with a total $620 billion in assets under management.\n\nScott Gamm is a reporter at Yahoo Finance. Follow him on Twitter @ScottGamm.\n\nMore from Scott:", "description": "Bank of America Merrill Lynch’s monthly fund manager survey revealed some shocking insights about President Trump’s trade war with China. Some 43% of respondents don’t think the trade war will be resolved and view the situation as the “new normal.”", "authors": ["Scott Gamm"], "top_image": "https://s.yimg.com/uu/api/res/1.2/s7_1DUp8zqpquldEmtfG0A--~B/aD0zNjYzO3c9NTQ5NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/9bf2bff0-ef45-11e9-9eaa-d06cf12de4d7", "published_at": "2019-10-15"}