{"pub": "nymag", "url": "https://vulture.com/2019/10/succession-power-rankings-season-2-episode-9-dc.html", "downloaded_at": "2019-10-07 04:08:34.346016+00:00", "title": "Succession Power Rankings: Let’s Break Some Greggs", "language": "en", "text": "Photo: Zach Dilgard/HBO\n\n“Ten bad minutes on camera in D.C., that could be it,” Logan Roy tells his youngest son, Roman. “The end.” The family is going to Washington this weekend to sit through questions from Congress about all the freaky stuff — “Mo” Lester McClintock, guests being thrown overboard, sexual harassment and abuse, unexplained deaths — that went down on Brightstar Cruises. The government inquiry will certainly spook shareholders and also give them a flurry of bad press before their final showdown with Sandy and Stewy.\n\nWhile Shiv and Kendall help Logan hold things down in D.C., Roman, flanked by Karl and Laird, takes a trip to Turkey to secure foreign money as a last effort at avoiding the takeover bid. Roman’s trip goes about as badly as the D.C. trip: They both get, to borrow a phrase, “a B+, meaning bad plus terrible.” Here’s where the Roys stand after the events of “D.C.”\n\nShiv Roy\n\nShiv sashayed around D.C. this week and took one for the team. It was deeply uncomfortable to watch her pull off her heels on a children’s playground, as she tried to talk the cruises victim out of testifying. But somehow, she pulled it off? She was very earnest and convincing: Her dad is a serial liar, and no one should trust him, and he’ll do or say whatever he has to to keep control of his company. Shiv’s motives aren’t entirely clean — she is manipulating this woman’s silence — but she’s making the pitch she’s always made: She wants to clean up the company and run it properly.\n\nKendall Roy\n\nKendall almost made it to the top this week, and very narrowly missed out. He did exactly what Publicist Fisher Stevens® (I’m not sure why Fisher Stevens being on this show tickles me to no end, but it does) advised: Chew up all their time so they can’t really make a case against you. “I’d say go ahead. Hit us as hard as you can,” he told Senator Eavis. “We can take it. We have nothing to hide.”\n\nLogan didn’t exactly flounder during the hearing, but he certainly slouched, directing all questions to Kendall — and the son outperformed the father. He was great! All bluster, no protein, and won the family another day at the helm. But this is a shorter victory than Shiv’s: She dodged a meteor, he just won one day of the news cycle. I love that Kendall, who looks like he’s one puff of Nasonex from the grave, still has the capacity to surprise us. But I have an acknowledged Shiv bias, so no top spot for him this week.\n\n“You can’t make a Tomelette without breaking some Greggs.”\n\n“You sent the same email to him 67 times in one evening,” Senator Eavis tells Tom, before he asks if he’s ever used another human being as furniture and after he asks if Tom knows Gregory Hirsh. I love that Succession never actually showed us a scene of Tom emailing Greg five dozen times in one night. Instead we get to hear about it here, when it’s most humiliating, read aloud to everyone else in the Roy family and everyone else in the world.\n\nLogan Roy\n\nThe Roy family is like a traveling circus these days, fools everywhere they go! This week they’ve landed in D.C. and Logan knows their display was enough to keep them breathing, but not nearly enough to win. Logan has two star pupils in Kendall and Shiv, who really outdid themselves this week, another star pupil who happens to maybe be held captive in Turkey (albeit with a big bounty), and Rhea played right into Shiv’s plan and decamped quickly once the shit hit the fan. Logan seems more alone now than ever, and also more insecure. After he read his statement about feeling so sorry for all the dirty dealings in cruises, he shut down and pushed the questions to Kendall. It’s a betrayal that we’ve come to expect from him, but I expected him to put up a better — or at least louder — show of strength.\n\nGerri Killman\n\nContrary to popular belief, the phrase “GOAT” doesn’t stand for Greatest of All Time, it stands for Gerri Over All The-rest! Gerri’s right about their tactic when it comes to dealing with the cruises drama: Say the family didn’t know, and say the buck stops with Bill. Is anyone else on this show as cool as a cucumber like Gerri? She’s a sniper! Now I need her to get on the phone with the Turkish government about freeing Roman.\n\nRoman Roy\n\nAll of the Roy kids put on great displays this episode: Shiv earned the cruise victim’s confidence, Kendall held court during the Senate hearing, and Roman’s trip to Turkey looks like it will get the family enough cash to take the company private. (I really have so little idea of what that means in reality, but at least it sounded promising when Logan said it.) Better yet for Roman, he managed to bond a little bit with Karl and Laird, and he needs two more people to take him seriously. Yes, Roman’s field trip to secure foreign billions was a great success — soccer-team pep talk aside — until it turned into a … hostage situation? Well, you win some, you lose some.\n\nMarcia Roy\n\nWhere! Is! Marcia! I’m surprised that she wasn’t at least in the D.C. conference room to support Logan, but maybe it’s time he misses her for a change. I have complicated feelings about Marcia, but I will say it: Leave him, sis!\n\nCousin Greg\n\nPoor Cousin Greg and his paltry $5 million! That’s not enough money to do anything with, according to Connor and Tom, two men with more money than me. Last week he decided to side with Uncle Fun over Grandpa Grumps, and now Congress can’t keep his name out of their mouths. Maybe he’ll go rogue and whistle-blow himself, but probably not. Meanwhile, I’m still curious about that junior-executive uprising it looked like he was organizing two weeks ago …\n\nBill Lockhart\n\nThe D.C. agenda was to kill Bill, but Bill showed up to remind the family that he’s still got tricks up his sleeve. He didn’t threaten Logan when he reminded him about the shadow logs and the paper trail, but he certainly made his position clear: He’s very nice, but he might not go down as easy as Gerri & Co. would like to think.\n\nTom Wambsgans\n\nI wish I could bottle up my screech when Tom — lovely, idiotic Tom — was asked about Lester being nicknamed “Mo,” and he replied, “He just seemed … a bit … like one. Maybe. But we didn’t know anything!” Tom’s Senate testimony goes from bad to very bad to Interstellar-bad to absolutely horrific. Tom is just as ruthless as any of the Roys, which I think is often overlooked, but he really can be twice as hapless. Of all the Waystar speakers this week, he gave the worst showing by far, and I don’t expect Logan to forget it.\n\nConnor Roy\n\nConnor didn’t fuck anything up on this episode — not the family fortune or Broadway or the United States — but that’s not to say I didn’t fully appreciate his contributions this week. That little “oh yeah,” he pulled after Kendall’s testimony? A chef’s kiss!\n\nRhea Jarrell\n\nWhen Rhea showed up to Logan’s apartment after that whistle-blower interview, she looked like she had one stiletto in the grave. “It’s fun to be the new bride,” she told Logan. “Rearranging the bachelor’s apartment, putting flowers out. It’s just not nice to think you’ll find a corpse in the freezer.” Girl — do you hear yourself? C’est dramatique! When push comes to shove — and by “push comes to shove” I mean the shitshow at the fuck factory we know as “Congress” — Rhea really doesn’t have it in her. She can spritz perfume over the shit, but she can’t shovel it! She pitches her aversion to confronting the cruises victim as more noble, but really she’s looking out for herself yet again.\n\nThe “Con-heads”\n\nI’m sorry but anyone legitimately voting for Connor Roy belongs at the very bottom of any and every power ranking. Excuse me while I hyper-decant my wine and also give myself a lobotomy.", "description": "The Roy family is like a traveling circus these days, fools everywhere they go! Here’s where the Roy family, and their friends and enemies, stand after “DC.”", "authors": ["Hunter Harris"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/05/6-succession-power-rankings.w1200.h630.jpg", "published_at": "2019-10-07"}