{"pub": "nytimes", "url": "https://nytimes.com/2019/10/09/opinion/bernie-sanders-single-payer.html", "downloaded_at": "2019-10-09 18:36:52.900831+00:00", "title": "Opinion | This Is the Strongest Argument Against Medicare for All", "language": "en", "text": "Yet by 2014, Mr. Shumlin’s own estimates found that employers would have to pay taxes equal to about 11.5 percent of payroll, while families would have to pay as much as 9.5 percent of their annual income to make the financing work. The plan would have nearly doubled the size of the state’s budget. For both political and economic reasons, the cost was deemed too high.\n\nThere were other complications: Public outreach was weak. And in 2013, the state started an online insurance exchange under the Affordable Care Act that was plagued by technical failures, which the state struggled to fix. As the Cornell Policy Review noted in a 2017 post-mortem, the mix of higher-than-expected costs and administrative problems “fostered an atmosphere of uncertainty and distrust in the state government, turning a politically steep climb into a politically insurmountable one.”\n\nAnd so, at the end of 2014, Mr. Shumlin admitted defeat. “I have learned that the limitations of state-based financing, the limitations of federal law, the limitations of our tax capacity and the sensitivity of our economy” make single-payer “unwise and untenable at this time,” he said. “The risk of economic shock is too high.”\n\nThe Vermont plan was done in by high taxes, distrust of government and lack of political support. Any effort by a Sanders administration to enact a single-payer system at a national level would probably be doomed by similar problems.\n\nLike Mr. Shumlin, Mr. Sanders is a devout single-payer supporter who has campaigned aggressively on the idea. And like Mr. Shumlin, Mr. Sanders has so far declined to lay out a plan for fully financing his Medicare for All system.\n\nBut while some polls show majority public support for single-payer, that support declines substantially when faced with trade-offs like the elimination of most private coverage or higher taxes — two components of Mr. Sanders’s plan.\n\nSimilarly, Medicare for All supporters argue that single-payer would reduce the nation’s overall health spending. But savings are heavily predicated on the assumption that the new government-run system could pay Medicare rates, which are typically lower than those of private insurance, to providers across the board.", "description": "A deep-blue state’s failure to enact a single-payer system shows why a national version is unlikely to succeed.", "authors": ["Peter Suderman"], "top_image": "https://static01.nyt.com/images/2019/10/09/opinion/09Suderman1/09Suderman1-facebookJumbo.jpg", "published_at": "2019-10-09"}