{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7541425/Liverpool-Leicester-players-brawl-time-whistle-Robertson-shoves-Perez.html", "downloaded_at": "2019-10-05 23:12:38.777774+00:00", "title": "Liverpool and Leicester players in brawl at the full-time whistle after Robertson shoves Perez", "language": "en", "text": "Brendan Rodgers has claimed the post-match brawl after Liverpool's 2-1 win over Leicester City was sparked by Andrew Robertson shoving Ayoze Perez.\n\nJames Milner scored an injury-time penalty to give Liverpool victory after James Maddison's 80th minute equaliser had cancelled out Sadio Mane's first half goal.\n\nLeicester players were incensed by the decision to award the penalty, which was given after Mane went down under pressure from Marc Albrighton.\n\nLeicester City's Ayoze Perez was involved in a brawl with Liverpool players after full-time\n\nLeicester City boss Brendan Rodgers says Perez reacted to being shoved by Andy Robertson\n\nBoth sets of players became involved as tensions rose at Anfield following Liverpool's 2-1 win\n\nLeicester players were incensed at the decision to award Liverpool an injury-time penalty\n\nWhen the final whistle blew, a fracas ensued between both sets of players, with Milner, Robertson and Perez involved in much of the pushing and shoving.\n\nEventually the brawl was brought to a halt as officials and coaches from both sides intervened and after the game Klopp revealed the source of the conflict.\n\nWhen asked about the incident and Liverpool's late penalty in his post-match press conference, Rodgers said: 'According to the guys, Andy Robertson celebrated and pushed him at the final whistle which he probably didn’t expect.\n\n'He was obviously annoyed at that and it leads to a melee. But it was nothing.'\n\nJames Milner definitely told Ayoze Perez that Yorkshire Tea was better than his preferred tea brand.\n\n\n\nIt is. #LFC pic.twitter.com/imtsqhuNTG — Nic Mason (@MrNickMason) October 5, 2019\n\nRodgers felt referee Chris Kavanagh was wrong to award Liverpool's late penalty, which Milner converted.\n\n'To concede a 95th minute penalty was difficult to take,' he said. 'We probably deserved a point from the game. We showed our qualities to come from a goal behind.\n\n'We looked like we could go on and win the game. Thought it was a very soft penalty, certainly not clear and obvious.'\n\nLiverpool's win continues their incredible run of 17 consecutive victories and leaves them just one away from equalling Manchester City's record of 18.\n\nThe Reds are now eight points clear of City ahead of Pep Guardiola's clash with Wolves on Sunday, while Leicester remain in third place on 12 points.", "description": "Brendan Rodgers has claimed the post-match brawl after Liverpool's 2-1 win over Leicester City was sparked by Andrew Robertson shoving Ayoze Perez.", "authors": ["Alec Fenn For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/19/19339544-0-image-a-9_1570299808469.jpg", "published_at": "2019-10-05"}