{"pub": "businessinsider", "url": "https://insider.com/amazon-ceo-jeff-bezos-colonize-moon-2019-6", "downloaded_at": "2019-10-08 04:09:53.539436+00:00", "title": "Jeff Bezos explains why he's trying to colonize the moon: 'We need to go to the moon to save the Earth'", "language": "en", "text": "Jeff Bezos is best known as the billionaire founder of Amazon — but his passion project is working on reusable space rockets for Blue Origin, his other company.\n\nOn Thursday, Bezos explained why Blue Origin is working on a lunar lander to transport goods between Earth, the moon, and outer space: He wants heavy industry to move beyond our atmosphere.\n\nBezos said the lander is part of his vision for saving humanity and Earth while also paying it forward for other space entrepreneurs.\n\nVisit Business Insider's homepage for more stories.\n\nAmazon CEO Jeff Bezos says there's a very simple reason his other company, Blue Origin, is working on a giant lunar lander to make moon travel as easy as an airplane flight: Humanity's very survival relies on colonizing space, starting with the moon.\n\nSo he told attendees during his time on stage Thursday at Amazon's inaugural Re:Mars tech conference taking place this week in Las Vegas. He was interviewed by Jenny Freshwater, the director of Amazon forecasting and capacity planning.\n\nLast month, Bezos unveiled the lunar-lander vehicle, called Blue Moon, designed to deliver a variety of payloads to the moon with the ultimate goal of helping humans establish a \"sustained human presence\" there.\n\nBezos said that using the moon is all part of his plan to save humanity by helping build the infrastructure necessary for space colonization.\n\n\"The reason we've got to go to space, in my view, is to save the Earth,\" he said on Thursday. \"If we're going to continue to grow this civilization, we need to move — and I'm talking about something our grandchildren will work on and their grandchildren and so on. This isn't something just this generation is going to accomplish.\"\n\nAnd the moon turns out to be the perfect landing spot for our eventual space needs for a variety of reason, Bezos said. It has water in the form of ice. It's close to Earth — a three-day ride, he said. It has access to solar energy. And its lighter gravity means that it takes \"24 times less energy to lift a pound off the moon than it does Earth.\"\n\n\"To do big things in space, we need to use in-space resources. So the moon is great,\" Bezos said.\n\nZoning the Earth for light industry\n\nAnd what about the Earth, in this plan? Bezos said it would no longer need to be home to our planet-killing factories.\n\n\"We need to move heavy industry off the Earth. It will be way better done in space anyway,\" he said. \"And Earth will be rezoned residential and light industry.\"\n\nIf human civilization is to keep growing, we have no choice but to move our production needs off Earth as a way to protect it, he said.\n\n\"We've sent probes to every planet in the solar system. This is the good one. It's not close,\" he said.\n\nMore seriously, he sees this as his way of paying it back and paying it forward. It's like his space version of the Pony Express.\n\n\"Amazon was easy to start in 1994 with a small amount of capital because the transportation system already existed, it was called the US Postal Service and Deutsche Post and Royal Mail,\" he said. There was already a financial system, credit cards, and a communication system, the internet.\n\nIf one company had to build all that from scratch, it would have cost billions of dollars.\n\nRead more: Jeff Bezos says the true secret to business success is to focus on the things that won't change, not the things that will\n\nBut with those infrastructure pieces in place, not only could Amazon launch, but a company like Facebook could also be birthed in a dorm room, he said.\n\n\"You cannot start an interesting space company today from your dorm room,\" he said.\n\nBlue Origin is attempting to fix at least part of the infrastructure piece by creating reusable rockets similar to today's airplanes. That means rockets that don't need to be inspected and rebuilt after each trip, he said.\n\n\"My mission with Blue Origin is to help build that infrastructure, to do that heavy lifting, so others can stand on top of it the same way I stood on top of the US postal service,\" he said.\n\nWhen Freshwater jokingly asked Bezos if, after colonizing the moon, he would build an Amazon warehouse there, Bezos laughed and joked right back at her: \"We'll start out delivering liquid hydrogen and liquid oxygen. It's going to be a small selection [stocked in that warehouse]. But a very important one.\"", "description": "Amazon CEO Jeff Bezos believes that to save the planet, we'll need to move manufacturing off the earth and onto the moon.", "authors": ["Julie Bort"], "top_image": "https://image.insider.com/5cf98bbdf2f479656b3aabba?width=1200&format=jpeg", "published_at": "2019-06-06"}