{"pub": "bbc", "url": "https://bbc.com/news/business-49632627", "downloaded_at": "2019-09-09 10:26:08.200958+00:00", "title": "UK growth rebound eases recession fears", "language": "en", "text": "Image copyright Getty Images Image caption The service sector helped to boost growth in July\n\nThe UK's economy grew faster than expected in July, easing fears that it could fall into recession.\n\nThe economy grew 0.3% in July, the UK's official statistics body said, helped by the dominant services sector.\n\nGrowth was flat over the three months to July, but this was an improvement on the 0.2% contraction seen in the April-to-June quarter.\n\nThis contraction, coupled with some weak business surveys, raised concerns the UK was heading for recession.\n\nAn economy is generally deemed to be in recession if it contracts for two quarters in a row.\n\nHowever, while growth in the services sector - which accounts for about 80% of the UK economy - helped to drive July's stronger-than-expected growth figure, the Office for National Statistics (ONS) warned that the sector remained weak.\n\n\"While the largest part of the economy, the services sector, returned to growth in the month of July, the underlying picture shows services growth weakening through 2019,\" the ONS said.\n\nThe British Chambers of Commerce (BCC) also said that concerns remained.\n\n\"Although there was a rise in GDP between June and July, the zero growth recorded on the underlying three-month measure points to an economy under pressure from uncertainty over Brexit and weakening global economic conditions,\" said Suren Thiru, head of economics at the BCC.\n\n\"The manufacturing sector remains an area of concern, with tightening cash-flow, concerns over disrupted supply chains and weakening demand in key markets weighing on activity in the sector.\"\n\nLast week, a series of downbeat surveys of various sectors of the economy had raised fears that the UK was at risk of slipping into recession.\n\nHowever, analysts said the latest GDP figures appeared to have dampened these concerns.\n\n\"The pick-up in GDP in July is a reassuring sign that the economy is on course to grow at a solid - perhaps even above-trend - rate in Q3,\" said Samuel Tombs, chief UK economist at Pantheon Macroeconomics, adding that figures \"substantially\" weakened the case for any cuts in UK interest rates \"before Britain's Brexit path is known\".\n\n\"The upside surprise came from the services sector, which displayed broad-based strength and did not seemingly benefit from any one-off stimuli,\" Mr Tombs said.\n\nAnalysts also noted that August's growth figure should be boosted by car manufacturers, which were operating last month, contrary to normal practice. Many carmakers had brought their annual shutdown forward for the original Brexit date in March.\n\n\"GDP will get a further boost of about 0.2% in August, when car manufacturers will be at work when they are usually on holiday,\" said Paul Dales, chief UK economist at Capital Economics.\n\n\"Overall, the economy is still fairly weak - we estimate that the underlying pace of growth is around +0.2% quarter-on-quarter - but it's not in recession. Political chaos, yes. Economic chaos, no.\"", "description": "The economy grew by a stronger-than-expected 0.3% in July, official figures show.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/16414/production/_108665119_officeworkers_getty.jpg", "published_at": "2019-09-09"}