{"pub": "indiatimes", "url": "https://indiatimes.com/trending/social-relevance/the-iconic-empire-state-building-turns-orange-378830.html", "downloaded_at": "2019-10-29 13:59:29.730826+00:00", "title": "The Iconic Empire State Building Lights Up In Orange, As Indians In New York Celebrate Diwali", "language": "en", "text": "The Iconic Empire State Building Lights Up In Orange, As Indians In New York Celebrate Diwali\n\nThe Iconic Empire State Building Lights Up In Orange, As Indians In New York Celebrate Diwali\n\nDiwali is a festival that is not only celebrated in India, but also by Indians who live abroad. Recently, the iconic Empire State Building in New York was lit up in orange colour, in a ceremony to celebrate Diwali. It was led by an organisation for Indian diaspora.\n\nThe structure turned orange as Indians in New York celebrated Diwali. You might be wondering who lit up the monument. Well, it was the Federation of Indian Associations (FIA) - the largest non-profit umbrella organisation of Indian community in the tri-state area of New York, New Jersey and Connecticut.\n\nThe Empire State Building lit up in its full glory this weekend in celebration of Diwali pic.twitter.com/Q4VJk5wqsb — Sid Nag 🇺🇸☁️🏃🏻‍♂️🎤🎸⛷🏌🏾‍♂️ (@sidnewyork) October 27, 2019\n\nThe special ceremony was organised by FIA with the Empire State Realty Trust. The ceremony was attended by FIA Chairman Ramesh Patel, President Alok Kumar, Trustee Ankur Vaidya, and Past President Srujal Parikh and singer and songwriter Arjun Coomaraswamy.\n\nThere were dance and music performances too. \"The tower lit up with millions of festive lights in Orange, the colour of the Diya or the lamp and cast a beautiful hue across the night sky of New York City spreading the message of oneness in celebrating the victory of good over evil,\" FIA said.\n\nDon't Miss 1.4 K SHARES 411 SHARES 338 SHARES\n\nTwitter\n\nLast year also, the iconic building was lit up in orange to celebrate Diwali. The building is also illuminated in tri-colour (Saffron, White and Green) every August to celebrate the Indian Independence Day!", "description": "Diwali is a festival that is not only celebrated in India, but also people living outside India, celebrate the festival with enthusiasm. Recently, the iconic Empire State Building in New York was lit in Orange in a ceremony to celebrate Diwali. It was led by a leading Indian diaspora organisation.", "authors": ["Priyanshi Mathur"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/empire_state_building_1572354254_800x420.jpg", "published_at": "2019-10-29"}