{"pub": "thehill", "url": "https://thehill.com/homenews/campaign/465110-support-for-impeachment-reaches-highest-level-in-fox-news-poll", "downloaded_at": "2019-10-10 00:04:04.949430+00:00", "title": "Support for impeachment reaches highest level in Fox News poll", "language": "en", "text": "A record of respondents in a Fox News Poll said they wanted President Trump Donald John TrumpPelosi hits back at Trump over letter: 'Only the latest attempt to cover up his betrayal of our democracy' Trump directed Perry, State Dept. officials to talk to Giuliani on Ukraine: report Murkowski warns against rushing to conclusions on Trump impeachment MORE impeached and removed from office.\n\nThe poll released Wednesday found 51 percent of respondents supported Trump's impeachment and removal from office. Four percent of participants said the president should be impeached but not removed, and 40 percent are completely against impeachment.\n\nADVERTISEMENT\n\nSupport for impeachment and removal has risen 9 points since July, increasing 11 points among Democrats, 5 points among Republicans and 3 points among independents.\n\nVoters in swing counties, defined as where Hillary Clinton Hillary Diane Rodham ClintonMurkowski warns against rushing to conclusions on Trump impeachment Clinton jokes she could 'obviously' beat Trump in 2020 'rematch' Gowdy in talks to join Trump's impeachment defense team MORE and Trump were within 10 points in the 2016 election, supported impeachment at a rate of 52 percent, 10 points above a comparable population in July.\n\nSome demographics that typically back the president also had increased support for impeachment, with a 5 point increase among white evangelical Christians, an 8 point increase among white men without a college degree and a 10 point increase among rural whites.\n\nAmong the 40 percent against impeachment, respondents cited as reasons: 21 percent thought Trump did nothing wrong, 20 percent said the inquiry is politically motivated and 15 percent didn't believe the allegations.\n\nA total of 66 percent of respondents said it was not appropriate for Trump to ask foreign leaders to investigate political rivals, compared to a quarter who said it is appropriate. While 43 percent say the Ukraine call was impeachable, 27 percent say it was inappropriate but not impeachable.\n\nThe House has opened an impeachment inquiry on the president after a whistleblower report revealed Trump asked the Ukrainian president to look into former Vice President Joe Biden Joe BidenPelosi hits back at Trump over letter: 'Only the latest attempt to cover up his betrayal of our democracy' Clinton jokes she could 'obviously' beat Trump in 2020 'rematch' Gowdy in talks to join Trump's impeachment defense team MORE and his son.\n\nPolls have been showing growing support in public opinion for impeachment.\n\nThe Fox News poll surveyed 1,003 registered voters between Oct. 6 and 8 and has a margin of error of 3 percentage points.", "description": "A record of respondents in a Fox News Poll said they wanted President Trump impeached and removed from office.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_100819getty.jpg", "published_at": "2019-10-09"}