{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7599725/Christine-Lampard-gifted-pair-sweet-knitted-BOOTIES-daughter-Patricia.html", "downloaded_at": "2019-10-22 13:40:05.060718+00:00", "title": "Christine Lampard is gifted a pair of sweet knitted BOOTIES for her daughter Patricia", "language": "en", "text": "She's standing in for Lorraine Kelly over the half-term break.\n\nAnd Christine Lampard received a sweet surprise as she presented the daytime chat show on Tuesday after being a gifted a pair of pink knitted booties for her daughter Patricia, 12 months.\n\nThe Irish presenter, 40, cut a chic figure in a blue tartan inspired midi dress as she received the present from Andi Peters following his trip to Mongolia.\n\nScroll down for video\n\nLooking good: Christine Lampard, 40, cut a chic figure in a blue tartan midi dress as she stood in for Lorraine Kelly as the host of her morning chat show on Tuesday\n\nChristine proudly displayed her slender physique in the stylish dark blue dress as she once again hosted Lorraine's chat show.\n\nThe star looked sensational in the dress which sported a flattering roll neck and tartan-inspired print as she took part in various interviews.\n\nChristine completed the look with dark blue navy pointed-toe heels with her dark raven tresses styled into loose curls as she prepared to host the show.\n\nLovely: The Irish presenter once again showed off her signature sense of style as she was gifted a sweet pair of pink knitted booties for her daughter Patricia\n\nFlawless: Christine cut a stylish figure in the dark blue printed dress which boasted a flattering roll neck and a black belt to cinch in her slender waist\n\nA vision: The star teamed her look with matching blue suede heels as she exited Television Centre after her hosting stint\n\nJovial: Christine is standing in for Lorraine as the host of her show during the half-term break\n\nDuring the show, Christine couldn't contain her delight as she received a present for her adorable daughter.\n\nAndi had returned from his trip to Mongolia with gifts galore for his morning TV colleagues.\n\nAfter chatting to the host about his Mongolia travels, Christine eagerly opened her gift, and squealed: 'Oh my god they're little booties!'\n\nExciting: She couldn't contain her delight after receiving a surprise gift for her daughter, who turned one last month\n\nSo sweet! Christine was gifted a pair of pink cashmere knitted booties from Andi Peters following his trip to Mongolia\n\nOff she goes! Later she was spotted leaving the TV studios in her incredibly stylish ensemble\n\nLooking good: Christine welcomed her baby daughter Patricia with husband Frank in September last year. The couple married in 2015\n\nClearly a present for her baby daughter, Christine was clearly thrilled with the present, and reference Good Morning Britain star Ben Shephard's present of a sheep's head from hours earlier she said: 'Oh my gosh that's much better than pigs or whatever it is you're all eating.'\n\nAndi added that the booties were real cashmere, which is a hugely popular material in the country.\n\nChristine welcomed her baby daughter Patricia with husband Frank in September last year. The couple married in 2015.\n\nShe is also stepmother to Frank's daughters Luna and Isla from his former relationship with Elen Rivas.", "description": "The Irish presenter, 40, cut a chic figure in a blue tartan inspired midi dress to host Lorraine on Tuesday as she received the present from Andi Peters following his trip to Mongolia.", "authors": ["Laura Fox For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/10/20028692-0-image-a-44_1571737061107.jpg", "published_at": "2019-10-22"}