{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201909271269/imperial-warns-on-impact-of-vaping-crackdown-wsj", "downloaded_at": "2019-09-27 07:15:39.145150+00:00", "title": "Imperial Warns on Impact of Vaping Crackdown — WSJ", "language": "en", "text": "By Saabira Chaudhuri\n\nThis article is being republished as part of our daily reproduction of WSJ.com articles that also appeared in the U.S. print edition of The Wall Street Journal (September 27, 2019).\n\nImperial Brands PLC became the first global tobacco company to lay out the financial impact of the U.S. crackdown on vaping products, as the maker of Blu e-cigarettes warned its sales and profit would be lower than expected this year.\n\nThe disclosure from Imperial, whose traditional cigarette brands include Davidoff and Winston, shows how the Trump administration's plans, announced earlier this month, to ban most vaping products in the U.S. are already affecting the tobacco industry's fortunes.\n\nShares of Imperial fell 13% Thursday. The U.K.-based company's approach to next-generation nicotine products is far more focused on e-cigarettes than that of its major rivals.\n\nThe U.S. vaping market -- valued at $5.6 billion last year, according to data provider Euromonitor -- is dominated by products from e-cigarette startup Juul Labs Inc. However, big tobacco companies have pushed into the category to offset the decline in traditional cigarette sales.\n\nImperial bought the Blu e-cigarette brand in 2015 from Reynolds American Inc., a deal that allowed Reynolds to clear its $25 billion purchase of Lorillard Inc. British American Tobacco PLC,, which now owns Reynolds, sells a rival device called Vuse.\n\nUntil recently, vaping was seen as an opportunity for the industry, but now its future looks uncertain in the U.S. and elsewhere. India said last week it was banning the sale of all e-cigarettes, while China has stopped online sales of Juul's products.\n\nImperial expects full-year sales growth of 2%. It previously pegged growth at the upper end of a range of 1% to 4%. Earnings per share are expected to be flat, compared with the company's prior forecast of 4% to 8% growth.\n\nThe company singled out the recent developments in the U.S., saying the vaping environment had \"deteriorated considerably over the last quarter with increased regulatory uncertainty, including individual U.S. state actions.\"\n\nImperial said the U.S. market for prefilled e-cigarettes, which was growing at about 13% in May, slowed to 2% growth in August and was now negative. It said an increasing number of wholesalers and retailers have stopped ordering or promoting vaping products\n\nCiting a surge in underage vaping, the Trump administration said in September it planned to ban all e-cigarettes except those formulated to taste like tobacco. The move comes amid not only a rise in teenage vaping but also hundreds of potential cases of pulmonary illness -- and even some deaths -- linked to vaping products, many containing marijuana.\n\nU.S. health officials had viewed e-cigarettes as a safer alternative to smoking, and vaping products were allowed to remain on the market pending review by the Food and Drug Administration. E-cigarette makers now face a May deadline to apply for a FDA review of vaping products they want to continue selling.\n\nMeanwhile, the FDA has asked consumers to avoid buying vaping devices on the street and not to add substances to products bought in stores.\n\nFor Imperial there is a lot at stake. Unlike BAT and Philip Morris International Inc., which have rolled out tobacco-heating devices they say are safer than conventional cigarettes, Imperial has focused on vaping products, a more-developed next-generation category it says has greater sales potential.\n\nThe company said it believed next-generation products still offered a \"significant opportunity.\" It estimated net revenue for the business globally would grow about 50% this year, compared with growth of 245% for the first six months of the year.\n\nNext-generation products accounted for 5.4% of Imperial's revenue in the Americas for the six months to March 31 at GBP61 million ($75.3 million).\n\nRBC analyst James Edwardes Jones said Imperial's announcement should concern investors.\n\n\"To the extent that it calls Imperial Brands' and the tobacco industry's longer-term business model into question, we believe that the implications should not be underestimated,\" he said.\n\nImperial's warning comes a day after Philip Morris and tobacco giant Altria Group Inc., which owns a stake in Juul, called off merger talks in part because of regulatory uncertainty. Also on Wednesday, Juul's chief executive stepped down.\n\nAltria CEO Howard Willard said the proposed U.S. ban on e-cigarette flavors would hurt Juul's business and the sale of vaping products next year, though it was unclear exactly what restrictions the FDA was preparing.\n\nAltria and Philip Morris have said they would now focus on launching their joint cigarette alternative in the U.S. Unlike Juul, their product -- a heat-not-burn tobacco device called IQOS -- has been reviewed and authorized by the FDA.\n\nBAT, which sells Camel and Newport, plans to file in the coming weeks for an FDA review of Vuse, whose sales have been dwarfed by Juul.\n\nBAT's head of scientific research, David O'Reilly, said that as far as he knew, no product developed or made by his company has been involved in the illnesses reported in the U.S. He said governments should pass regulation to improve product standards, especially around testing and reporting of the ingredients used in vaping liquids.\n\nJapan Tobacco Inc., which sells its Logic e-cigarette brand in the U.S., said it isn't aware of any its products being linked to the U.S. illnesses and that it supports increased regulation.\n\nImperial has said all of its vaping products and ingredients undergo thorough scientific assessment before manufacture and sale.\n\nWrite to Saabira Chaudhuri at saabira.chaudhuri@wsj.com\n\n(END) Dow Jones Newswires\n\nSeptember 27, 2019 02:47 ET (06:47 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-09-27"}