{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7526949/Adults-chronic-diseases-sleep-6-hours-risk-early-death.html", "downloaded_at": "2019-10-05 06:23:42.552534+00:00", "title": "Adults with chronic diseases who sleep less than 6 hours at risk of early death", "language": "en", "text": "Getting less than six hours of sleep could double - or even triple - your risk of dying from heart disease or cancer, especially if you have chronic diseases, a new study finds.\n\nResearchers found that adults with high blood pressure or type 2 diabetes were twice as likely to die from heart disease or stroke.\n\nAnd, for adults who had a history of heart disease, not getting enough sleep tripled their risk of dying from cancer.\n\nCurrently, 45 percent of the US population has stage 2 high blood pressure and/or Type 2 diabetes and about 14 percent has heart disease.\n\nThe team, from Pennsylvania State College of Medicine, says that doctors should also recommend a sleep routine for their patients who are suffering from chronic diseases.\n\nA new study from Pennsylvania State College of Medicine has found that adults with heart disease who don't get enough sleep triple their risk of dying from cancer (file image)\n\nThe National Sleep Foundation recommends that adults get between seven and nine hours of sleep every night.\n\nHowever, a 2015 study from the Centers for Disease Control and Prevention found that about 50 percent of US adults sleep fewer than the recommended hours.\n\nInsufficient sleep has been shown to raise the risk of several health issues including obesity, diabetes and heart disease.\n\n'Our study suggests that achieving normal sleep may be protective for some people with these health conditions and risks,' said lead author Dr Julio Fernandez-Mendoza, an associate professor in the department of psychiatry at Pennsylvania State College of Medicine.\n\n'However, further research is needed to examine whether improving and increasing sleep through medical or behavioral therapies can reduce risk of early death.'\n\nFor the study, published in the Journal of the American Heart Association, the team looked at the data of more than 1,600 adults between ages 20 and 74.\n\nParticipants were broken into groups: one group had stage 2 high blood pressure or Type 2 diabetes and the other group had a history of heart disease or stroke.\n\nThe adults were studied in the sleep laboratory in the 1990s and their causes of death were tracked up to the end of 2016.\n\nResearchers found that adults with hypertension or diabetes doubled their risk of dying from heart disease or stroke if they slept less than six hours a night.\n\nThose with heart disease or a history of strokes, who got fewer than than six hours of shut-eye, were at three times the risk of dying from cancer.\n\n'I'd like to see policy changes so that sleep consultations and sleep studies become a more integral part of our healthcare systems,' said Dr Fernandez-Mendoza.\n\n'Better identification of people with specific sleep issues would potentially lead to improved prevention, more complete treatment approaches, better long-term outcomes and less healthcare usage.'", "description": "A new study from Pennsylvania State College of Medicine has found that adults with heart disease who don't get enough sleep triple their risk of dying from cancer.", "authors": ["Mary Kekatos Health Reporter For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/02/13/19178418-0-image-a-4_1570020856725.jpg", "published_at": "2019-10-02"}