{"pub": "nytimes", "url": "https://nytimes.com/2019/10/07/travel/russia-kamchatka-bears-volcanoes.html", "downloaded_at": "2019-10-07 23:32:18.885589+00:00", "title": "Forged by Volcanoes, Kamchatka Offers Majestic, Magnetic Wilds", "language": "en", "text": "Our flight back included two stops: a brief visit to a crater lake and a longer stay at the Khodutka mineral hot springs. Heading down the wooden steps for a dip, we encountered a traffic jam as people hesitated before entering the water, scalding at more than 110 degrees.\n\nGiven its mesmerizing beauty, it is little wonder that Kamchatka attracts visitors, but the number that it can support is now the focus of an intense debate because a Russian tycoon wants to erect a tourist village.\n\nSold as an “Eco-park,” it would offer summer and winter sports, including walks on wooden viewing paths near the Mutnovsky, Gorely and Vilyuchinsky volcanoes. The proposed 1,000 rooms would accommodate some 400,000 visitors annually, two to three times the current number.\n\nKamchatkans are divided. Businessmen say it would provide jobs and kick start a halting tourism industry.\n\nMr. Ozerov, the volcanologist, endorsed the tourist village, too. The park would expose people to his beloved volcanoes, he said, plus it is more ecologically friendly than industrial development projects.\n\nKamchatka is rich in deposits of minerals and metals including platinum, gold, silver, nickel and copper. Gas and coal are being exploited as well. Some locals said the mines represent a greater threat than more tourists, especially since environmental inspectors rarely access mining areas.\n\nThe investors want to own the land for the hotel project, however, which would require removing it from a locally protected nature preserve. Conservationist organizations call that a dangerous precedent.", "description": "Roaming bears hunt wild Pacific salmon among alpine meadows on this Russian peninsula, a compact, volcanic Eden.", "authors": ["Eva Sohlman", "Neil Macfarquhar"], "top_image": "https://static01.nyt.com/images/2019/10/07/travel/07kamchatka-russia-fader/07kamchatka-russia-facebookJumbo.jpg", "published_at": "2019-10-07"}