{"pub": "independent", "url": "https://independent.co.uk/independentpremium/long-reads/brexit-boris-johnson-nigel-farage-baby-boomers-vote-leave-a9150416.html", "downloaded_at": "2019-10-13 00:21:38.722017+00:00", "title": "Exposing the myth that our oldest living generation supports Brexit", "language": "en", "text": "The perceived wisdom is that Brexit is a war fought on generational lines, with younger people broadly in favour of remaining in Europe, and older people generally pro-Leave.\n\nAnd the data would back that up. Under-25s were more than twice as likely in the 2016 Referendum to vote Remain, at 71 per cent, than leave (29 per cent). With the over-65s, however, 64 per cent voted to Leave with 36 per cent voting Remain.\n\nHowever, there’s a problem here with lumping the “over-65s” into one category, because that combines two distinct generational cohorts here, those known colloquially as the Baby Boomers, and those who lived through the Second World War.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe war being a salient point here, because many Brexiters of a certain age seem to regard the years of the Second World War as some kind of golden age that must be embraced again as Britain barrels towards a no-deal departure from the European Union.\n\nWhat they used to call Project Fear now seems a certainty if we crash out of Europe with no deal, with talk of reduced food availability, increased prices, disruption of medicine supplies and job losses. The government has even given its contingency plans a name seemed designed to appeal to a certain demographic; Operation Yellowhammer could be a rousing behind-enemy-lines cinematic mission led by Telly Savalas and Clint Eastwood.\n\nWhich demographic? Well, speak to anyone aged between 60 and 80 with strong pro-Brexit feelings and it won’t be long before they go all misty-eyed and start to invoke the Blitz Spirit that got us through, the grit of the British people that allowed them to endure the years of hardship, the pluck and bravery in the face of overwhelming odds that was Dunkirk. You can almost hear the swell of Vera Lynn on the warm breeze and see the blue skies above the white cliffs of Dover reflected in their shining eyes.\n\nThere’s only one problem. None of them were actually there.\n\nBy far the most vociferously pro-Leave camp during the 2016 Referendum were the Boomers, those born from around 1945 to the early 1960s. As their very name suggests, they were indeed the product of the Second World War, the results of a huge spike in conception as soldiers returned home and families could once more look to the future with optimism and relief.\n\nThe Leave campaign, and arch-Brexiteer Nigel Farage in general, have invoked the war since day one. In early June 2016, campaigning for the referendum vote, Farage rolled into London in his double-decker bus, speakers blaring out the theme tune from the classic war movie The Great Escape.\n\nAfter coming out for the Leave campaign, the now prime minister Boris Johnson controversially argued that Hitler and the EU were part of the same history of attempts to dominate Europe. In July this year when Farage took to the stage at a rally in Birmingham, he did so in a full blackout accompanied by the eerie wail of Second World War-style air-raid sirens. And, of course, the Leave.EU campaign found itself in hot water this week after tweeting out a picture of German chancellor Angela Merkel with the slogan, “We didn’t win two world wars to be pushed around by a Kraut.”\n\nThe curious thing is, the people who actually lived through the war are actually more likely to be anti-Brexit than those born after it. The statistics often lump the “over-65s” as a single category, yet research published by the London School of Economics showed that those who came of age in the war years had similar feelings about Europe to those who reached adulthood in the 1980s and 1990s – they are largely Remain-leaning.\n\nWhy would older generations, likely to have experienced the impact of the war firsthand, seek to remove Britain from an institution that has helped maintain peace in Europe for more than seven decades? Kieran Devine, LSE\n\nIn March this year, Kieran Devine published that research with the LSE. He wrote: “In the wake of the Brexit referendum result, it was oft repeated that the older generations were more likely to have voted for Britain to leave the European Union. This presents something of a puzzle; why would older generations, likely to have experienced the impact of the war firsthand, seek to remove Britain from an institution that has helped maintain peace in Europe for more than seven decades? Might it be that the “over 65s” category, containing individuals several decades apart in age, conceals distinct generational differences amongst this group?”\n\nSo Devine crunched the numbers from the referendum, and concluded: “The results of this analysis confirm that this is the case: the older generations are more likely to associate the EU with bringing peace, and when mediating for these attitudes, the generational effects in the initial models are reduced by around 20 per cent. The war generation is more likely to associate the EU with peace, and thus have more positive attitudes towards integration.”\n\nThe war generation had seen firsthand what could happen in a disunited Europe. They had seen that within just a few years of the Second World War ending – while the first Boomers were barely out of nappies – France and Germany were again at loggerheads, this time over coal and steel production. The Treaty of Paris, signed in 1951, created a “common market” for the products… and avoided another war.\n\nWith the onset of the Second World War 80 years ago this year, those who fought in the conflict are, of course, a dying breed. But there are many who grew up during the war years who, as Devine points out, have a lot of disquiet about Brexit.\n\nAmong them is Marigold Lankester, who was staying on a farm in Droitwich in the Midlands, recovering from measles and whooping cough, when war was declared in 1939. She lived in Birmingham but because of the munitions work carried out in the city it was deemed to be a target – indeed, her family home was hit by an oil bomb, which fell on a pile of linen her mother had just laid out on Marigold’s bed. Her father, a special constable, saw the fire and managed to throw the flaming mattress outside. Marigold, now 85, recalls: “Like most homes, our bath was always full of water just in case.”\n\nContrary to the flag-waving patriotism employed by today’s Brexiters who demand we buckle down and emulate the Blitz Spirit to get through Brexit, those returning from the war were rarely shouting about what they’d seen… and if they did talk about the war, it was to try to come to terms with the horror, not to boast about their triumph.\n\n“I think people did want to put the war behind them and get on with peacetime,” says Lankester. “It was a difficult time for men coming home and having to take up where they’d left off before the war. The women had often been doing their jobs while they were away. Some people needed to speak about their experiences to process the trauma. Where I was staying, the farmer often spoke about his experiences of the First World War and having to take care, smoking his Woodbines, in the trench, that the light from his matches did not guide a German sniper.”\n\nI spoke to another couple who preferred not to be named – he is 87, she 83. Both grew up in Durham before moving to a town just outside of Peterborough, and lived out in Oman for a spell in the 1970s.\n\n“My father came home from the war and didn’t want to talk about it at all,” the woman recalls. “He didn’t want to discuss it. He wasn’t in a prisoner of war camp or anything like that but he was at Dunkirk, my dad. He was shot at Dunkirk but he didn’t talk about it really. My mum used to tell him to shut up when he did start to talk about it, she didn’t want to hear anything about it.”\n\nAll three of them voted Remain in the 2016 Referendum. Our 87-year-old jokes he did that purely out of selfish reasons: “I didn’t want us to leave during the last few years of my life, for all the trouble it might cause.” And how prescient that turned out to be.\n\nHis wife says, “I voted to stay because I thought we’d been in 43 years and we were too entwined to separate. Also, deep down, truthfully I felt like it wasn’t a decision for all of us old oldies because we won’t be around to deal with it, all of my adult grandchildren voted Remain and that certainly influenced me.”\n\nAlso, deep down, truthfully I felt like it wasn’t a decision for all of us old oldies because we won’t be around to deal with it Woman, 83\n\nLankester, conceding that her own feelings on the matter are perhaps not what she says are typically British, says: “I don’t want to remain an island with all the narrow-mindedness this implies. Today, we are more involved with foreigners but we weren’t then. I think that has been a very good thing for us. It has introduced new ideas. A personal spin-off for me was the opportunity to go on schoolgirl exchange visits to stay with French families and as a teenager, learn something of the way the French lived. They weren’t just Frogs to me. It saddens me that my grandchildren won’t have the opportunity to live and work freely across Europe, which has been the case until now.\n\n“I do think we are better in a larger group of nations. We have given the world so much, not just football. But that doesn’t mean we shouldn’t go on giving, and receiving. I want to maintain the ties that exist for us now and not give the impression that we’ll do our own thing while the rest of Europe does its own thing. I don’t like that idea.”\n\nHaving lived through the war and seen what it did to countries and to people, the over-80s we speak with seem to be more appreciative of the peace that a united Europe brought. The gentleman says: “Yes, I think its made it safer since the last war. We’re all on the same team now.”\n\nLankester notes: “I think the men who fought in the war, who didn’t have any choice at the time, might wonder today what it was all about. I despair of the bully-boy tactics I now see. I don’t like being unwittingly the laughing stock of the world. I feel like saying, please stop the world, I want to get off.”\n\nI think the men who fought in the war, who didn’t have any choice at the time, might wonder today what it was all about Marigold Lankester\n\nInterestingly, it was the Boomer generation, remember, that wanted to take us into the European Union in the first place. They were furious when France’s general Charles de Gaulle repeatedly blocked Britain’s entrance to the EU, most famously with a single “Non” to the TV cameras in 1963, over fears that Britain’s special relationship with the US would allow American interests back-door access to Europe.\n\nWhen Tory leader Ted Heath finally got us into Europe in 1973 and the Labour government that got in under Harold Wilson held a referendum two years later to decide if we wanted to stay, more than two-thirds of voters opted to remain – about the same proportion of that generation who voted to leave in 2016.\n\nMany who voted in favour of Europe then will tell you that they changed their mind in 2016 because they’d been sold membership to an economic club and got what they perceived as constitutional meddling. They hadn’t seen a banana since they were 10, remember, and now Europe was telling them they couldn’t have bent ones, to reference one particularly compelling Euromyth.\n\nBack in 2016, Nigel Farage predicted that European countries would “fall like dominoes” to leave the EU once Britain had gone. It’s doubtful, after the mess that Britain has been in for the last three years, that anyone else will be rushing to leave immediately. But with the rise of the right and populist leaders in Europe, could the unthinkable happen?\n\nThis year, Koert Debeuf, senior associate researcher at the Free University of Brussels and visiting research fellow at Oxford University, published a book called Tribalization: Why War Is Coming. In it, he argues that the closing of borders, the withdrawing into tribalism, the reduction in democracy and a sense of being part of a global community, means that conflict is inevitable.\n\n“Tribalisation is collective psychology, it interrupts globalisation when communities react to collective trauma by returning to their mythical, tribal past,” writes Debeuf. Nationalism and authoritarianism are on the rise, he says, pointing to the similarities with Germany in the 1930s that led to global war.\n\nLast word, then, as the UK prepares, or does not, to leave, or leave not, on October 31, to Marigold Lankester: “I’ve always enjoyed meeting people from other countries in Europe and further afield. This is not necessarily one-way traffic. People are usually happy to talk and ask questions about our lives, and may now wonder what’s gone wrong with Britain.”", "description": "The perceived wisdom is that Brexit is a war fought on generational lines, with younger people broadly in favour of remaining in Europe, and older people generally pro-Leave. And the data would back that up. Under-25s were more than twice as likely in the 2016 Referendum to vote Remain, at 71 per cent, than leave (29 per cent). With the over-65s, however, 64 per cent voted to", "authors": ["David Barnett"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/10/13/world-on-fire-2.jpg", "published_at": "2019-10-12"}