{"pub": "telegraph", "url": "https://telegraph.co.uk/travel/cruises/articles/the-amazing-islands-you-can-only-visit-on-a-cruise", "downloaded_at": "2019-10-15 12:54:36.453448+00:00", "title": "The amazing islands you can only visit on a cruise", "language": "en", "text": "If you’re not Sir Richard Branson, then a private paradise island might be out of your reach – unless you’re happy to share it with other passengers on a sunshine voyage. Cruise lines, including Sir Richard’s own Virgin Voyages, are snapping up and redeveloping sites around the Caribbean and other parts of the world to ensure their guests can enjoy a day as a very well-pampered Robinson Crusoe.\n\nHere we take a look at the existing island resorts and what’s in the pipeline…\n\nOcean Cay\n\nWhere is it?\n\nIn the Bimini islands, 65 miles east of Miami.\n\nThe low down\n\n\n\nOpening in November this year, Ocean Cay Marine Reserve will be used by five MSC Cruises ships. The development on a former sand extraction site covers 95 acres with two miles of beach, surrounded by 64 sq miles of protected waters, including a shipwreck. Ships dock at the island so passengers can come and go as they please, using electric carts to get around the seven beaches. To create the reserve, MSC is restoring natural coral and planting 75,000 native shrubs and plants.\n\nWhat can I do there?\n\n\n\nSnorkelling, kayaking, paddle boarding, diving and beach volleyball. A family explorer club will offer activities for children. Food options include a buffet, snack carts, an ice-cream parlour and bars. The ship stays docked into the evening when guests can watch a movie under the stars, catch some live music or take a sunset catamaran tour.\n\nParadise rating: With ice cream, this is truly a dessert island. 8/10\n\nA seven-night cruise on MSC Seaside leaving Miami on January 4, 2020, costs from £579pp, excluding flights (020 3426 3010; msccruises.co.uk).\n\nYou can enjoy the reserve waters on MSC from this November\n\nHarvest Caye\n\nWhere is it? Southern Belize\n\nThe low-down\n\nOpened in 2016 by Norwegian Cruise Line, the 75-acre site offers locally owned restaurants and shops, employs Belizean staff and uses the local currency (not dollars). The port, which has its own dock, has a large pool area with swim-up bar and waterfall, plus cabanas that include concierge food and drink service. More than 10,000 mangroves were planted to create a habitat for birds, fish and other marine species.\n\nWhat can I do there?\n\nThrill seekers can take a 3,000ft-long zip line, try parasailing or go kayaking, paddle boarding and canoeing on the salt water lagoon. Excursions are offered to a Mayan temple, a wildlife centre and river tubing in the rainforest, or guests can simply relax in villas along the seven-acre beach. There are no less than five food and drink spots.\n\nParadise rating: Fun with a conscience: 8/10\n\nA seven-night Western Caribbean cruise from Miami on Norwegian Getaway this winter costs from £739pp, excluding flights (0333 241 2319, ncl.co.uk).\n\nDJ sets will help everyone get into the holiday mood at Virgin Voyages' beach club\n\nThe Beach Club at Bimini\n\nWhere is it? The Bimini islands in the Bahamas.\n\nThe low down\n\nVirgin Voyages’ private resort will open for the adults-only cruise line’s first sailing on April 1, 2020. Sir Richard Branson promises it will rival the best beach clubs in Ibiza and Saint-Tropez. He’s even persuaded superstar DJ Mark Ronson to play four gigs there.\n\nWhat can I do there?\n\nVirgin Voyages says the club will ‘overlook the ocean and cascade down to the sea with an expansive lagoon-style pool’. Mornings will begin with yoga and meditation followed by DJ-led pool and flotilla parties in the afternoon. The day will end with a beach bonfire and an acoustic musical performance. Complimentary food will include conch and mango salad, banana leaf-wrapped queen snapper and Bahamian rum cake, while drinks will be available at six bars.\n\nParadise rating: a child-free and chilled 7/10\n\nA four-night Havana After Dark cruise leaving Miami on September 9, 2020, costs from £1,609pp including return flights from Heathrow (0344 488 3084; virginvoyages.com).\n\nWhile there are plenty of high-octane activities on CocoCay, there's also room to relax\n\nCocoCay\n\nWhere is it?\n\nCocoCay – or Little Stirrup Cay – is one of the Berry Islands, 55 miles north of the Bahamian capital Nassau.\n\nThe low down\n\nUnveiled this month after a £155m transformation, Royal Caribbean’s resort will be the first of five “Perfect Day” islands, with others due to open in Asia, Australia and the Caribbean.\n\nWhat can I do there?\n\nNon-stop fun with 13 water slides, including the tallest in North America – the 135ft-high Daredevil’s Peak – plus a 1,600ft-long zip line, a helium balloon floating 450ft above the ground and even Zorbing on the beach. CocoCay will also feature the Caribbean’s largest freshwater pool with a swim-up bar. The Coco Beach Club will offer the first overwater cabanas in the Bahamas and from 2021 there will even a chance to stay in a suite overnight.\n\nParadise rating: a thrills-and-spills-inducing 8/10\n\nA four-day Bahamas and Perfect Day cruise on Navigator of the Seas, leaving Miami on December 2, 2019, starts from £361pp, excluding flights (0844 493 4005; royalcaribbean.co.uk).\n\nGrab a margarita or two in Great Stirrup Cay\n\nGreat Stirrup Cay\n\nWhere is it?\n\n\n\nIn the Berry Islands, bang next door to Royal Caribbean’s CocoCay\n\nThe low down\n\n\n\nThe 250-acre oasis was opened by Norwegian Cruise Line in 1977. Ships anchor off shore and guests are transferred to the island.\n\nWhat can I do there?\n\n\n\nSnorkelling through an underwater sculpture garden, jet skiing, paragliding, kayaking, paddle boarding or simply relaxing in a hammock or cabana. Guests can also try the stingray encounter experience, buy local goods at the market, or experience the zipline that’s opening soon. There’s a complimentary beach buffet and Taco Bar, plus three places to grab a mojito or margarita as the sun goes down.\n\nParadise rating: a high-octane 7/10.\n\nA four-night Cuba and Bahamas cruise from Miami on Norwegian Sky in April or May costs from £599pp, excluding flights (0333 241 2319; ncl.co.uk).\n\nFind an island paradise in Motu Mahana with Paul Gaugin cruises in French Polynesia\n\nMotu Mahana\n\nWhere is it?\n\n\n\nOff the coast of Taha'a in French Polynesia.\n\n\n\nThe low down\n\n\n\nAfter a 20-minute boat ride cruise passengers are given a melodic Polynesian welcome.\n\nWhat can I do there?\n\n\n\nSnorkelling, badminton, kayaking, Polynesian activities, volleyball. Islanders will demonstrate how to open a coconut, weave a basket or tie a pareo (type of sarong). Guests can also enjoy an overwater massage and sip tropical drinks from a coconut husk at the floating lagoon bar. Plus there’s time for shopping (for pearl jewellery and handicrafts).\n\nParadise rating: this slice of South Pacific heaven earns a 9/10.\n\n\n\nA seven-night Tahiti and Society Islands cruise on the Paul Gauguin leaving Papeete on December 7, 2019, costs from 4,550pp including flights (020 7399 7691, pgcruises.com).\n\nFind tranquility off the southwest coast of Abu Dhabi\n\nSir Bani Yas\n\nWhere is it?\n\n\n\nOff the southwest coast of Abu Dhabi\n\nThe low-down\n\n\n\nUnusually, this beach resort opened by MSC Cruises also offers the chance to go on a wildlife safari. Guests can take a 4x4 expedition to see some of the 13,000 indigenous and endangered animals including giraffes, hyenas and cheetahs in their natural habitat. Tours also run to the ruins of an early Christian (sixth-century) monastery.\n\nWhat can I do there?\n\n\n\nSnorkelling, jeep safari, paddle boarding, mangrove kayaking, mountain bike rides, beach tennis, volleyball, football, horse-riding and a tour around the island by dhow. Private gazebos cost extra. For children there is an inflatable water park and play area. Light snacks and beach barbecue food is are on the menu and drinks and cocktails are served at six bars. Visitors can also buy local arts and crafts from a Bedouin tent or listen to live music.\n\nParadise rating: a roaring 8/10.\n\n\n\nA seven-night voyage on the new MSC Bellissima leaving Dubai on December 14, 2019, starts from £1,029pp including flights (020 3426 3010; msccruises.co.uk).\n\nGet active or spot wildlife around Half Moon Cay\n\nHalf Moon Cay\n\nWhere is it?\n\nThe 2,400-acre private island is in the Bahamas, 100 miles southeast of Nassau between Eleuthera and Cat Island.\n\nThe low-down\n\nHalf Moon Cay – previously Little San Salvador Island – is shared between Holland America Line and sister company Carnival. Less than three per cent is developed – the 700-acre saltwater lagoon in the centre of the island is a breeding area for groundfish and turtles.\n\nWhat can I do there?\n\nHorse riding, kayaking, paddle boarding, scuba diving, deep-sea fishing, parasailing, swimming with stingrays. There’s even an island chapel for weddings or vow renewals. Fresh-grilled lobster is served Caribbean style and children have their own water park.\n\nParadise rating: an up-close-to-nature 9/10.\n\nA seven-day Eastern Caribbean cruise on Nieuw Statendam, leaving Fort Lauderdale on November 10, 2019, costs from £661pp, excluding flights (0344 338 8605; hollandamerica.com).\n\n\n\nOther cruise line islands include Princess Cays, Disney Cruise Line’s Castaway Cay and Royal Caribbean’s Labadee resort on Haiti.", "description": "", "authors": ["Dave"], "top_image": "https://www.telegraph.co.uk/content/dam/Travel/Cruise/Ocean/CROP-1556563375_RCI-PDC-04272019-PerfectDayAerial-RET-xlarge.jpg?imwidth=1200", "published_at": "2019-05-15"}