{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7576981/Horror-Uluru-girl-12-plunges-30-METRES-slipping-climbing-sacred-rock.html", "downloaded_at": "2019-10-15 23:16:59.198677+00:00", "title": "Horror at Uluru as girl, 12, plunges 30 METRES after slipping while climbing the sacred rock", "language": "en", "text": "A young girl has been rushed to hospital after slipping 30 metres while climbing Uluru with her family.\n\nIsabella Schiller, 12, was climbing the rock in the Northern Territory with her parents and younger brother on Monday when she lost her footing.\n\nHer mother Tonia was left to helplessly watch on as her daughter tumbled down the steep rock.\n\nIsabella was bloodied and bruised and had to be carried down by other climbers.\n\nShe suffered a compound finger fracture, an ankle injury, and cuts and abrasions from the fall.\n\nIsabella Schiller, 12, (pictured) was climbing the sacred rock in the Northern Territory with her parents and younger brother on Monday when she lost her footing\n\nHer mother Tonia was left to helplessly watch on in horror as her daughter tumbled down the steep rock (pictured)\n\nShe was flown by the Royal Flying Doctors Service to Yulara Medical Service.\n\nParamedics feared her injuries would be critical given the distance she fell.\n\nMs Schiller shared on Facebook how her birthday spent with family 'kicking items off the bucket list' turned into a horror movie.\n\n'Very lucky little girl to be here and we are grateful beyond words,' the Facebook post read.\n\n'To watch your child fall from that height and not be able to reach her and then Telstra had an outage. No words - you really have no idea how isolated you are.\n\n'Issy is awake now and with more surgery this morning we know with time and help and rehab my precious little girl will be fine.'\n\nTroy Dicks, a flight nurse with the Royal Flying Doctor Service (RFDS), told ABC Isabella was lucky she was not more seriously injured.\n\nShe sustained a 'nasty finger injury'.\n\nUluru will be closed off to climbers in October 26 after a decision was made to prevent future scaling of the sacred site\n\n'It was a compound fracture. So there was bone showing.\n\n'She was covered in grazes because she had rolled down Uluru quite a lot and [that] took a lot of skin off.\n\n'She also had an ankle injury. I'm not sure whether it was broken or not but it was certainly swollen and deformed.'\n\nThe incident comes just days before a ban to climb the rock comes into effect on October 26.\n\nThe Uluru-Kata Tjuta National Park board decided unanimously they would forbid people from climbing the sacred rock in 2017.\n\nFears have been raised in the past few months over tourists flocking to climb the rock before the closure.", "description": "Isabella Schiller, 12, was climbing the sacred rock in the Northern Territory with her parents and younger brother on Monday when she lost her footing.", "authors": ["Kelsey Wilkie For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/23/19762318-0-image-a-2_1571178471457.jpg", "published_at": "2019-10-15"}