{"pub": "telegraph", "url": "https://telegraph.co.uk/art/reviews/george-stubbs-done-nature-review-mk-gallery-revelatory-tribute", "downloaded_at": "2019-10-09 12:06:07.063226+00:00", "title": "George Stubbs: 'all done from Nature' review, MK gallery - a revelatory tribute to the missing link between the Renaissance and Damien Hirst", "language": "en", "text": "For an 18th century squire, having George Stubbs paint your prize thoroughbred was the greatest of honours. As Gainsborough was raising landscape to a sublime level, Stubbs gave to horse painting the gravitas of high art.\n\nBut, while the elite recognised Stubbs’ gift for capturing the creature’s nobility, they missed the point that he had more sympathy for the animals than he did for their owners. His disapproval of the way horses were treated is conveyed through the their frantic, exhausted expressions as they struggle under the authority of groom or rider; the tenderness between two retired racehorses communing in a landscape and in Stubbs’ reported lack of deference to his wealthy patrons.\n\nIt is a combination of this humane appreciation to the personality of each individual horse with Stubbs’ diagnostic analysis of anatomy that makes this exhibition so fascinating. It brings together more than 80 pieces for the first significant overview of Stubbs’ work for more than 30 years. It follows his gallop from largely self-taught portraitist to so-called “Liverpudlian Leonardo”.\n\nGet past the gruesome human foetus illustrations – based on Stubbs’ own (probably illegal) dissections – and you encounter the breath-taking outcome of 18 months spent dissecting horses and drawing their insides. The clean precision of the illustrations belies what must have been a pungent experience executing them.", "description": "For an 18th century squire, having George Stubbs paint your prize thoroughbred was the greatest of honours.", "authors": ["Ellis Woodman", "Cal Revely-Calder", "Alastair Sooke"], "top_image": "https://www.telegraph.co.uk/content/dam/art/2019/10/09/TELEMMGLPICT000211851191-xlarge_trans_NvBQzQNjv4BqYBEWvMdcMFfUabU60-4H7zIixqCG2EnNqYeRFcwKrXw.jpeg?imwidth=1200", "published_at": "2019-10-09"}