{"pub": "npr", "url": "https://npr.org/2019/10/04/767210633/progressives-sanders-and-warren-lead-democrats-in-fundraising-biden-lags", "downloaded_at": "2019-10-04 23:47:15.645606+00:00", "title": "Progressives Sanders And Warren Lead Democrats In Fundraising, Biden Lags", "language": "en", "text": "Progressives Sanders And Warren Lead Democrats In Fundraising, Biden Lags\n\nEnlarge this image toggle caption Justin Sullivan/Getty Images Justin Sullivan/Getty Images\n\nA clearer picture is emerging of the Democratic primary field's third-quarter fundraising with the first votes to be cast in four months.\n\nThe standouts are Sen. Bernie Sanders of Vermont, who raised $25.3 million and Sen. Elizabeth Warren of Massachusetts, whose campaign revealed she brought in $24.6 million between July and September.\n\n(These numbers are released by the campaigns. Full figures with details of where the money is coming from and if there are any loans to their campaigns are required to be be available through the Federal Election Commission officially by Oct. 15.)\n\ntoggle caption Domenico Montanaro/NPR/Campaign releases\n\nThere has been a narrative that Warren is on the rise and passing by Sanders, so Sanders' number was important in showing he retains a strong grassroots coalition behind him — and that he's not going anywhere anytime soon.\n\nWarren's number also shows that her campaign is going strong, as she gears up for the fall and the first votes being cast in Iowa. National polls have shown her catching up to former Vice President Joe Biden and leading him narrowly in Iowa.\n\nBiden lagged further behind, raising $15.2 million.\n\nSouth Bend, Ind., Mayor Pete Buttigieg again showed fundraising strength, bringing in $19.1 million. It's a healthy sum but short of what he took in during the second quarter.\n\nButtigieg has been incredibly popular with the donor base, but he has failed to break through in a meaningful way in the polls as of yet.\n\nMeanwhile, President Trump is outpacing the Democratic field, raking in a whopping $125 million for his campaign, political action committees and the Republican National Committee.\n\nThe Democratic candidates are not yet able to coordinate with the Democratic National Committee to raise money. The PACs, party and joint fundraising committees can take in above the $2,800 contribution limit set out by the Federal Election Commission for campaigns.\n\nWhile that makes it difficult to compare to what the Democrats are raising, it is a reminder of one of the advantages an incumbent president has.", "description": "Sens. Bernie Sanders and Elizabeth Warren are showing they will have the money to be around for some time. Former Vice President Biden lagged behind with $15.2 million.", "authors": ["Domenico Montanaro"], "top_image": "https://media.npr.org/assets/img/2019/10/04/gettyimages-1165237011_wide-af5bdb9bd6d3fe4de10c723efff59ae3213bb936.jpg?s=1400", "published_at": "2019-10-04"}