{"pub": "guardian", "url": "https://theguardian.com/books/2019/oct/15/the-triumph-injustice-emmanuel-saez-gabriel-zucman-review", "downloaded_at": "2019-10-15 08:02:39.709834+00:00", "title": "The Triumph of Injustice review – how to wrest control from multinationals", "language": "en", "text": "The global economy crashed more than a decade ago and the world’s progressives are still grasping for an answer. Thinkers from the political left should have been at the forefront of the debate about reforming the world’s financial system, but instead have spent much of the last 10 years struggling to tame the more vigorous response to the crisis from the right.\n\nThere have been imaginative initiatives, particularly with regard to the exchange of financial information between countries, but these have hardly set the public imagination alight. Too much of the answer to this global system failure has come from policy rather than politics.\n\nAnd this has allowed frauds, fools and fanatics to dominate the debate, claiming to speak for globalisation’s victims, but acting instead in the interests of its biggest winners. Whatever the question, their answers are the same: fewer taxes, fewer regulations and smaller budgets.\n\nIn this, the left is partly a victim of its own previous successes. The era of Tony Blair and Bill Clinton promised downside-free government: economic growth for the good of everyone; intense relaxation about the filthy rich; light touch regulation of the banks and social spending with the proceeds. The apparent success of this approach ensured both the Labour party and the Democrats lacked new ideas once the economy collapsed, there was no money left and it became apparent that their political houses had been built on sand.\n\nSince then, a small group of economists has been analysing the structure of the globalised economy to build the foundations for a new approach to organising our societies; doing for our world what John Maynard Keynes did 80 years ago. Foremost among them is Thomas Piketty, whose monumental Capital in the Twenty-First Century was a sensation when published in 2014. But his fellow travellers have been doing equally valuable work (and in mercifully shorter books), such as this latest study, The Triumph of Injustice.\n\nWritten by Emmanuel Saez and Gabriel Zucman, who, like Piketty, are French but who work at the University of California, it analyses how the super-rich dodge taxes, what this means and what to do about it. In an age when the primary instinct of many left-leaning people is to yearn for a time machine, it is a bracing and brave formulation of a radical new approach to public funding.\n\nThey not only argue that the wealthy should pay higher taxes, but dismiss the whole logic of the third way. Theirs is a cogent, reasoned and practical argument against the “tax competition” that has sent so many corporate profits to Ireland or Bermuda and they give clear and compelling policy solutions to change the direction of society itself.\n\nThe authors’ core argument is that decisions on tax are the most important that a democratic society makes\n\nIt is a hope-inspiring book that should inform the manifesto of anyone keen to defend liberal democracy from the twin threats of inequality and multinational corporate power. Their recommendations would take back control, but for real, this time.\n\n“Wealth is power. An extreme concentration of wealth means an extreme concentration of power,” they write. “We could have chosen to coordinate and we’ve chosen not to. We could have chosen to prevent multinationals from booking profits in low-tax places, but we let them do it. We can make other choices, starting today.”\n\nThe primary focus of The Triumph of Injustice is the US, which has gone further than other western countries in allowing the very wealthy to opt out of the obligations of citizens altogether: for the first time in modern history, income from capital is now taxed more lightly than income from labour, so rich Americans pay a lower rate of tax than schoolteachers.\n\nBut the lessons are relevant for Britain too, which has also slashed spending on tax enforcement, cut corporate tax rates, which are, in effect, the rates paid by the richest in society, and introduced exotic loopholes to lure multinationals to our cities.\n\nThe proposals put forward by Zucman and Saez deserve to be read in full, but are elegantly explained and well formulated. They would both de-globalise tax policy and re-democratise it, cutting through the fiction that multinational companies such as Apple owns its most valuable assets in small islands with low tax rates, rather than in the western countries where it has its headquarters. If implemented, these companies – and, thus, their owners – would be forced to pay a fair price for their access to our markets.\n\nThe authors’ core argument is that decisions on tax are the most important that a democratic society makes, since they shape everything else. Taxes are the price we pay for civilisation and civilisation cannot afford free-riders. When the liberal order is under greater attack than it has been for decades, that is a lesson we all need to learn – and quickly.\n\nThis review is from the Observer\n\n• The Triumph of Injustice: How the Rich Dodge Taxes and How to Make Them Pay by Emmanuel Saez and Gabriel Zucman is published by WW Norton (£21.99). To order a copy go to guardianbookshop.com or call 020-3176 3837. Free UK p&p over £15, online orders only. Phone orders min p&p of £1.99", "description": "Two economists advocate a radical approach to reducing inequality", "authors": ["Oliver Bullough"], "top_image": "https://i.guim.co.uk/img/media/5162677b3621cad19140ea45064069c3941bc41b/0_37_4512_2708/master/4512.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=90427016c5b27308668a5a46e3c718a2", "published_at": "2019-10-15"}