{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7627731/Fury-UEFAs-joke-ban-Bulgaria-racist-abuse-England-players.html", "downloaded_at": "2019-10-30 14:39:09.273125+00:00", "title": "Fury over UEFA's 'joke' ban for Bulgaria after racist abuse of England players", "language": "en", "text": "UEFA on Tuesday faced calls from Kick It Out to overhaul their disciplinary process after handing Bulgaria a punishment that included playing just one guaranteed game behind closed doors following their fans’ racial abuse of England’s players.\n\nEuropean football’s governing body made a mockery of their president Aleksander Ceferin’s claims they are ‘committed’ to eliminating the ‘disease’ of racism with their ruling following the incidents that marred England’s Euro 2020 qualifier in Sofia earlier this month.\n\nMonkey chants were directed at England’s black players including Tyrone Mings, Raheem Sterling and Marcus Rashford by Bulgaria fans, whose behaviour also included Nazi salutes, forcing the game to be stopped twice and almost leading to an unprecedented walk off.\n\nEngland's black players, including Tyrone Mings (centre), were racially abused in Bulgaria\n\nThe shameful scenes placed UEFA under huge pressure to finally get tough on racism.\n\nBut Bulgaria were ordered to play just two games behind closed doors - the second suspended for two years - and fined £65,000 for their supporters’ racist behaviour and throwing objects.\n\nThe announcement was swiftly greeted with dismay with UEFA accused of letting Bulgaria off lightly by not chucking them out of Euro 2020 qualifying while England under-21 coach Michael Johnson, labelled the decision ‘a joke.’\n\nAnti-discrimination organisation Kick It Out led the condemnation, saying they were ‘disheartened, but not surprised’ and claimed UEFA ‘missed an opportunity to send an uncompromising message on racism and discrimination.’\n\nTheir statement added: ‘The current sanctions, however ‘tough’ UEFA think they may be, are clearly not working and leave victims with little faith in their ability to prevent abusive behaviour.\n\nA number of the home supporters were pictured performing the Nazi salute on October 14\n\n‘We feel UEFA's entire disciplinary process in response to racial discrimination should be overhauled, and urge them to explain the decision-making process behind their sanctions for incidents of discrimination.’\n\nJohnson, a member of Aidy Boothroyd’s Young Lions set up England’s under-21 coaching staff this season as part of the FA’s drive to improve the under-representation of BAME coaches, said: ‘If you only knew what this would of (sic) meant to the watching world. Again lack of diversity means lack of understanding and empathy. The punishment is a joke.’\n\nThe Group A clash against England was played in a partially-closed Vasil Levski Stadium, due to a two-game punishment they were previously handed for racist behaviour.\n\nThe second of those games, against Czech Republic on November 17 will now be played in an empty ground following Bulgaria’s third offence this year.\n\nAfter the abuse of Raheem Sterling and Co, UEFA's punishment was met with fury and dismay\n\nAnti-discrimination Fare added: ‘We are disappointed that Bulgaria will not be expelled from the Euro 2020 qualifying competition given their previous record and obvious inability to deal with the problems they face.’ “The evidence and circumstances of this match would have justified European football being given a stronger signal on the need to tackle racism.’\n\nAn FA spokesperson described the behaviour of Bulgaria’s fans as ‘disgraceful’ and ‘deplorable’ but were keen to stress the need for education programmes to help solve a problem that is the scourge of the game.\n\n‘That has to be the way forward to help address the root cause of such disgusting behaviour,’ the spokesperson added.\n\nBulgaria were also ordered to display a ‘NO TO RACISM’ banner with the UEFA logo and fined £8,633 for whistling during England’s national anthem.\n\nThe FA were also fined £4,317 for doing the same during the Bulgarian anthem.", "description": "UEFA on Tuesday faced calls from Kick It Out to overhaul their disciplinary process after handing Bulgaria a punishment that included playing just one guaranteed game behind closed doors.", "authors": ["Adrian Kajumba For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/20/20344968-0-image-a-13_1572381107313.jpg", "published_at": "2019-10-29"}