{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/cheap-nokia-220-4g-6-2-australian-price-specs-release-date", "downloaded_at": "2019-10-15 02:17:08.285002+00:00", "title": "Nokia Just Announced A $79 Phone That's Definitely Not For Dealers", "language": "en", "text": "Apparently three Nokia phones in as many weeks wasn't enough for HMD Global.\n\nAfter dropping the 7.2, 2720 Flip and 800 Tough, the brand is bringing out two more Nokia phones this week cause sure, why not?\n\nOne of them only costs $79, which is great news for your nan and Not Drug Dealers.\n\nNokia Just Announced A New Flip Phone So We Can Party Like Its 2004 Nokia just announced two brand new phones for the Aussie market - the Nokia 7.2 and the Nokia 2720 Flip. The latter is a throwback to the mid 2000s when flip phones were all the rage. Now its back, and real cheap. Read more\n\nBut first, the mid-range phone.\n\nThe Nokia 7.2 comes with a 6.3-inch 1080p+ display, triple rear cameras (16MP primary, 8MP wide-angle and 5MP depth sensor) and a 3,500mAh battery. It comes in either 'black' or 'ice'.\n\nUnder the hood you'll find a Snapdragon 636 processor, 4GB RAM and 64GB storage.\n\nOn the software side it runs Android One.\n\nThe Nokia 6.2 will hit select stores on October 17 and will have an RRP of $399.\n\nImage: Nokia\n\nNokia also has an incredibly basic $79 phone for those of us who want a simple device and definitely don't have any nefarious purposes in mind.\n\nThe Nokia 220 4G can make calls, send texts, tune into radio stations, browse the web, access social media most importantly of all - it runs Snake.\n\nThe press release didn't even include specs because frankly, if you're after this phone you probably don't care that much about the guts or what the photos are going to look like.\n\nBut hey, it comes with a free 16GB microSD card so that's something.\n\nThe Nokia 220 4G will come in 'black' and 'blue' and will be available on October 17. It will have an RRP of $79.", "description": "Apparently three Nokia phones in as many weeks wasn't enough for HMD Global. After dropping the 7.2, 2720 Flip and 800 Tough, the brand is bringing out two more Nokia phones this week cause sure, why not? One of them only costs $79, which is great news for your nan and Not Drug Dealers....", "authors": ["James Whitbrook", "Tegan Jones"], "top_image": "https://edge.alluremedia.com.au/m/g/2019/10/saul.png", "published_at": "2019-10-15"}