{"pub": "nytimes", "url": "https://nytimes.com/2019/10/20/opinion/brexit-boris-johnson.html", "downloaded_at": "2019-10-20 23:22:14.111643+00:00", "title": "Opinion | Will the U.K. Ever Get Closure on Brexit?", "language": "en", "text": "“Super Saturday” was to have been the decisive moment for Brexit, the first Parliament session to be held on a Saturday since the Falklands War. Members of Parliament were to cast a “meaningful vote” on the surprise deal Prime Minister Boris Johnson brought back from Brussels last week. Proponents of Brexit sensed closure, while opponents took to the streets outside Westminster by the hundreds of thousands to demand a new referendum.\n\nAfter hours of raucous debate, the speaker of the House of Commons, John Bercow, announced that the votes were in — for another delay. As with so many earlier “pivotal” moments gone awry in the convoluted saga of Britain’s attempt to quit the European Union, this one only introduced a new array of unknowns.\n\nUnder earlier legislation adopted by Parliament to prevent a no-deal Brexit, the vote compelled Mr. Johnson to ask the European Union for another extension of the deadline for the divorce, which is now Oct. 31 — something he has said he’d rather be “dead in a ditch” than do. He made his reluctance abundantly clear by attaching the formal request for a prolongation to a letter urging the bloc not to grant his request.\n\nBut then the entire Brexit deal that Mr. Johnson unexpectedly brought back on Thursday was largely the same as the one he had strenuously opposed as a leading Brexit hawk when his hapless predecessor, Theresa May, tried to pass it through Parliament. The major difference was a new solution to the vexing problem of maintaining an open border between Ireland and the British province of Northern Ireland once Britain dropped out of the European Union’s joint market. Mr. Johnson’s solution was essentially to install customs controls at the Northern Ireland border. The loyal Mrs. May strongly endorsed Mr. Johnson’s version.", "description": "A lack of trust in Boris Johnson has delayed proceedings, once again.", "authors": ["The Editorial Board"], "top_image": "https://static01.nyt.com/images/2019/10/20/opinion/20brexitWeb/20brexitWeb-facebookJumbo.jpg", "published_at": "2019-10-20"}