{"pub": "thehill", "url": "https://thehill.com/policy/transportation/467192-aviation-chairmen-cite-safety-new-tech-among-concerns-for-the-future", "downloaded_at": "2019-10-24 00:34:01.709829+00:00", "title": "Aviation chairmen cite safety, new tech among concerns for the future", "language": "en", "text": "The chairmen of the House and Senate aviation subcommittees spoke Wednesday about the challenges facing by American air travel in an age of lightning-fast technological innovation.\n\nSen. Ted Cruz Rafael (Ted) Edward CruzPartisan squabbles endanger congressional response to Trump's course on Syria Trump urged to hire chief strategist for impeachment fight The Hill's Morning Report - Presented by Better Medicare Alliance - Trump's impeachment plea to Republicans MORE (R-Texas) and Rep. Rick Larsen Richard (Rick) Ray LarsenThe Hill's Morning Report - Presented by Better Medicare Alliance - Trump's impeachment plea to Republicans The Hill's Morning Report - Presented by Better Medicare Alliance - Trump has had a rough October The Hill's Morning Report — Trump's impeachment jeopardy deepens MORE (D-Wash.) discussed regulations, drones, commercial spaceflight and decaying infrastructure at an event on the future of U.S. aviation hosted by Delta Airlines and The Hill.\n\nLarsen told The Hill Editor-in-Chief Bob Cusack Robert (Bob) CusackHill editor-in-chief: 'Hard to imagine' House leadership without Cummings The Hill's Editor in Chief Bob Cusack: Warren must have an answer on medicare for all, why impeachment is dangerous for Dems The Hill's Morning Report — Trump's impeachment jeopardy deepens MORE that safety remains the most important aspect of aviation.\n\n\"The priority is safety. If people don't feel comfortable flying on airplanes and they don't feel safe, they won't fly. And if they don't fly, there's no reason for airlines to buy airplanes, and if you don't build them, you don't get the jobs,\" said Larsen, whose Washington district is home to 23,000 Boeing employees.\n\nLarsen added that keeping the United States competitive in international aviation, keeping up with technological innovation and improving the airline customer experience are also priorities.\n\n\"Aviation is fundamental to commerce in this country, it's fundamental to life in this country,\" Cruz told The Hill editor-at-large Steve Clemons.\n\n\"But you've got to have the flying public comfortable to get on a plane and believing that they're going to be safe. It's still the case that getting in a plane is much safer than getting in a car, but [in] the 737 MAX, 346 people were killed, and those were preventable deaths\" said Cruz.\n\nBoth the House and Senate aviation subcommittees have held hearings to investigate the regulatory and engineering failures that led to two Boeing 737 MAX crashes in Ethiopia and Indonesia in 2018 and 2019.\n\nLarsen said Boeing has faced criticism of how it handled the accidents, which were attributed in part to a flight control software system, but \"a lot of it is a criticism of the public relations side of things.\"\n\nBut Larsen said the committee's investigation has to focus on whether Boeing and the Federal Aviation Administration (FAA) appropriately followed laws on how aircraft systems are implemented, tested and approved for commercial use.\n\nLarsen added the committee's work will be \"pretty interesting\" over the next five to 10 years, given the pace of technological advances.\n\n\"When you talked about 'new entrants,' you talked about new airlines coming in to use the airspace. Today's new entrants, you have to think about new users of the airspace,\" said Larsen.\n\nCruz said the rising use of new technologies such as drones and air taxis will face resistance from users and legislators alike.\n\n\"When the automobile was introduced, the horse and buggy producers weren't very happy about it. At every stage, whether it's new energy sources, new transportation sources, there's always disruption,\" Cruz said.\n\n\"We are certainly on a path to more and more driverless transportation,\" he added.\n\n\"As with any technology, there will be a time period before people are comfortable with it and satisfied with it.\"\n\nBut deteriorating infrastructure is limiting the consumer benefits of existing American aviation technology, according to industry experts at the event.\n\n\"We're all for new innovation and technology, but look, we have an airline industry that needs an updated air traffic control system, general aviation needs it — we need to figure out a way to get it done,\" said Ed Mortimer, the vice president of transportation and travel at the U.S. Chamber of Commerce.\n\n\"We're looking at increased cargo, we're looking at increased passengers — almost double in the next 15, 20 years — and so utilizing the airspace more efficiently is the only way we're going to be able to handle those types of increased cargo and passengers,\" Mortimer added.\n\nEmily Feenstra, managing director of government relations and infrastructure initiatives at the American Society of Civil Engineers, said the focus on fixing existing infrastructure should not take away from an eye on the future of air and space travel.\n\n\"We've got to think long-term about that “Jetsons”-like future and believe that's possible, but also just address some of these short-term issues,\" said Feenstra.", "description": "The chairmen of the House and Senate aviation subcommittees spoke Wednesday about the challenges facing by American air travel in an age of lightning-fast technological innovation.", "authors": [], "top_image": "https://thehill.com/sites/default/files/cruzted_10232019kt.jpg", "published_at": "2019-10-23"}