{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/goldman-sachs-took-80-million-hit-from-wework-ipo-disaster-2019-10-1028601054", "downloaded_at": "2019-10-15 23:11:05.720492+00:00", "title": "Goldman Sachs says it absorbed a $80 million write-down after WeWork's IPO disaster (GS)", "language": "en", "text": "REUTERS/Danny Moloshok\n\nGoldman Sachs recorded an $80 million hit from its investment in WeWork, the bank's CFO said on an earnings call.\n\nThe third-quarter hit was less severe than anticipated. Analysts at Morgan Stanley had projected a $264 million loss for Goldman related to its private WeWork shares.\n\nFor context, in late September, the investment bank Jefferies in its earnings report announced a $146 million hit to earnings stemming from WeWork.\n\nGoldman shares fell as much as 3.5% in Tuesday trading after its third-quarter report missed analysts' earnings expectations and showed a decline in investment-banking revenue.\n\nWatch Goldman Sachs trade live here.\n\nGoldman Sachs took an $80 million hit from its investment in WeWork as the coworking giant's valuation plummeted, the bank's CFO, Stephen Scherr, said in an earnings call.\n\nThough the bank was forced to reconsider the valuation of its private WeWork shares, Goldman might still profit from its investment, Scherr said.\n\n\"Our carry value there is approximately $70 million, which is meaningfully higher than where our embedded cost is in that particular name,\" Scherr said. \"So if there was further downdraft, there's still embedded profit in the name itself.\"\n\nThe executive called out WeWork during the call \"because it obviously got quite a bit of notoriety in the press,\" he added.\n\nThe write-down is smaller than some Wall Street analysts anticipated. Morgan Stanley analysts projected a $264 million third-quarter hit to Goldman's shares in The We Company.\n\nFurther, during its late-September earnings report, the investment bank Jefferies announced a much bigger $146 million hit to earnings stemming from WeWork.\n\nRead more: An expert who studies venture capital says the WeWork 'smackdown' won't change the way the industry works — but he's telling investors how they can avoid the same mistake\n\nGoldman fell as much as 3.5% on Tuesday after releasing its third-quarter report. The bank posted a decline in investment-banking revenue and missed analysts estimates for quarterly earnings per share. Goldman's profits were dragged down by numerous poorly performing investments apart from its stake in WeWork, including bets on Uber and Tradeweb.\n\nAt the same time, WeWork bonds tumbled to record lows as the firm is reportedly eyeing a risky refinancing package from JPMorgan. Though the deal would secure cash that WeWork was previously expecting to take in from its initial public offering, the firm still faces murky financial prospects following its slashed valuation.\n\nGoldman Sachs traded at $205.29 a share as of 12:30 p.m. ET on Tuesday, up roughly 23% year-to-date.\n\nThe investment bank has 11 \"buy\" ratings, 12 \"hold\" ratings, and two \"sell\" ratings from analysts, with a consensus price target of $235.76, according to Bloomberg data.\n\nNow read more markets coverage from Markets Insider and Business Insider:\n\nWells Fargo posts earnings miss driven by $1.6 billion expense linked to scandals\n\nCitigroup posts strong trading results amid layoffs, beats profit estimates\n\nElite law firm Irell & Manella — where partners make more than $3 million a year — is seeing turbulence and departures after merger talks with a rival firm fell apart\n\nMarkets Insider", "description": "Goldman Sachs recorded an $80 million hit from its investment in WeWork, the bank's CFO said on an earnings call. The third-quarter hit came in under expe...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d9da589122bd5650f682cc6-2400/rtr2d8bu.jpg", "published_at": "2019-10-10"}