{"pub": "yahoo", "url": "https://news.yahoo.com/erdogan-soon-unveil-review-turkey-162540850.html", "downloaded_at": "2019-09-08 13:23:04.432346+00:00", "title": "Erdogan to ‘Soon’ Unveil Review of Turkey Executive Presidency", "language": "en", "text": "(Bloomberg) -- President Recep Tayyip Erdogan will “soon” announce the results of a review of Turkey’s new political system, which he dominates, according to a top official.\n\nErdogan ordered a study of the executive presidency at the height of opposition criticism that the set-up was inefficient and put too much power in a single office.\n\nVice President Fuat Oktay said in an interview on Friday that the review found some “issues” in how Turkey implemented its switch from a parliamentary system.\n\nTurkey watchers will be on the look-out for any signs of a cabinet reshuffle to accompany what’s likely to be limited revisions to the political framework.\n\nOktay didn’t elaborate on when Erdogan would announce the findings.\n\n“We did a thorough study of what works and what doesn’t,” Oktay said on the sidelines of the Ambrosetti Forum in Cernobbio, Italy. Most problems identified are due to issues with implementation, he said.\n\n--With assistance from Francine Lacqua.\n\nTo contact the reporters on this story: Onur Ant in Istanbul at oant@bloomberg.net;Cagan Koc in Istanbul at ckoc2@bloomberg.net\n\nTo contact the editors responsible for this story: Alaa Shahine at asalha@bloomberg.net, Mark Williams\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- President Recep Tayyip Erdogan will “soon” announce the results of a review of Turkey’s new political system, which he dominates, according to a top official.Erdogan ordered a study of the executive presidency at the height of opposition criticism that the set-up was inefficient and put", "authors": ["Onur Ant", "Cagan Koc"], "top_image": "https://s.yimg.com/uu/api/res/1.2/atCx7ynzfclGJ.eR8U8mkQ--~B/aD0xMzM0O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/eccf2bc225487ae942e61fcb164e8cee", "published_at": "2019-09-06"}