{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-climate-change-strike-portugal/police-remove-hundreds-of-climate-activists-from-lisbon-street-idUKKBN1WC2GC", "downloaded_at": "2019-09-28 01:16:52.875424+00:00", "title": "Police remove hundreds of climate activists from Lisbon street", "language": "en", "text": "Extinction Rebellion activists attend a protest to demand action on climate change in Lisbon, Portugal, September 27, 2019. REUTERS/Rafael Marchante\n\nLISBON (Reuters) - Portuguese police removed hundreds of climate change activists, mainly from the Extinction Rebellion group, from one of Lisbon’s main streets on Friday evening after a peaceful demonstration earlier in the day.\n\nThroughout the afternoon, thousands of young protesters took over Lisbon’s streets in a climate strike inspired by teenage activist Greta Thunberg.\n\nBut, later on, a group of hundreds of protesters holding Extinction Rebellion flags blocked one of the city’s main arteries. Protesters put up tents and sat outside the Bank of Portugal building before being removed by authorities.\n\n“There’s no planet B,” the protesters said.\n\nA Reuters witness saw some of the protesters being dragged away by police. As officers removed them from the middle of the Almirante Reis avenue, some protesters shouted: “This is not what democracy looks like.”\n\nExtinction Rebellion activists disrupted London with 11 days of protests in April that the group cast as the biggest act of civil disobedience in recent British history.\n\nOn their Facebook page, the Portuguese branch of Extinction Rebellion said they demand, among other things, a climate emergency to be declared and carbon neutrality by 2030.", "description": "Portuguese police removed hundreds of climate change activists, mainly from the Extinction Rebellion group, from one of Lisbon's main streets on Friday evening after a peaceful demonstration earlier in the day.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190927&t=2&i=1434685743&w=1200&r=LYNXMPEF8Q1UX", "published_at": "2019-09-27"}