{"pub": "axios", "url": "https://axios.com/fast-delivery-climate-change-amazon-walmart-target-40d0b733-ad06-4b88-9a07-5ac9b6a5c03b.html", "downloaded_at": "2019-10-18 10:34:34.649930+00:00", "title": "The climate change stakes of speedy delivery from Amazon, Walmart and Target", "language": "en", "text": "The big picture: Consumers have gotten hooked on speed — and the efficiencies that e-commerce injected into retail are getting erased because now there are more deliveries of smaller numbers of packages.\n\nWith this trend, emissions have grown:\n\nThe annual sustainability report from UPS, one of the biggest enablers of the e-commerce boom, says it emitted 13.8 million metric tons of CO2 while delivering 5.1 billion packages in 2017, by ground and air.\n\nfrom UPS, one of the biggest enablers of the e-commerce boom, says it emitted 13.8 million metric tons of CO2 while delivering 5.1 billion packages in 2017, by ground and air. Emissions from FedEx, the other major shipper, were 15.1 million metric tons in 2017. The U.S. Postal Service emitted about 4.3 million metric tons of CO2 in 2016. (Numbers from both include all mail, including e-commerce and personal packages and letters.)\n\nTogether, that's equivalent to the annual greenhouse gas emissions of just over 7 million cars, per an EPA calculator. It's almost the combined total number of cars in the states of Illinois and Tennessee. It's also about 0.5% of the total 6 billion metric tons of U.S. CO2 emissions per year. That's \"not huge, but it's big. And it's growing,\" says Costa Samaras of Carnegie Mellon University.\n\nOn top of UPS, USPS and FedEx, many other players in parcel delivery — including Amazon itself — are adding to the total impact.\n\n\"Nobody is looking at the environmental footprint of being consumers with all of this convenience\"\n\n— Beth Davis-Sramek, professor of logistics, Auburn University\n\nThe backdrop: In theory, e-commerce is good for the environment, says Don Mackenzie, who leads the University of Washington's Sustainable Transportation Lab. Instead of a neighborhood worth of people driving to stores in their personal cars to shop, one truck can deliver everything. But that calculus is changing.\n\n\"There are climate benefits to e-commerce, but those disappear as delivery gets faster and faster,\" says Miguel Jaller, a professor at UC Davis. \"It goes against everything they have been achieving in terms of efficiency.\"\n\nNow, flashy memberships that offer free, fast shipping regardless of the size of a cart have eliminated shoppers' incentive and the shippers' ability to bundle goods. They're instead ordering a steady stream of packages to their doorsteps, pushing e-commerce and logistics companies to keep up by adding trucks, jets and even air hubs.\n\nAmazon started it with Prime, which offers free shipping on 100 million products, whether you order a cartful of things or just one box of tissues. Amazon's retail rivals, Target and Walmart, have done the same:\n\nWalmart has come out with free next-day delivery for orders of $35 or more.\n\nwith free next-day delivery for orders of $35 or more. Target has long had a $99 membership program that offers free same-day delivery, and it has just announced same-day for non-members who are willing to pay a flat fee of $9.99.\n\nThe increasing warehouse space required to support the barrage of orders also has an impact.\n\nE-commerce companies are building more and more warehouses, particularly on the outskirts of cities, so they can cut delivery times to a few hours. About 255 million square feet of warehouse space is under construction in the U.S., per a new CBRE report — and all of it needs light, heat and air conditioning, notes CMU's Samaras.\n\nAnd there's more: The packing material that goes into delivery boxes is a major driver of the global plastics crisis, says Axios energy columnist Amy Harder.\n\nBut, but, but: There are ways to curb e-commerce's hit to the environment.\n\nDrone delivery uses less energy than vehicles, Samaras tells Axios. \"They're super-light and charged by electricity, and electricity is getting cleaner.\" Both Amazon and Walmart have filed a slew of drone patents.\n\nuses less energy than vehicles, Samaras tells Axios. \"They're super-light and charged by electricity, and electricity is getting cleaner.\" Both Amazon and Walmart have filed a slew of drone patents. Electrifying truck fleets can also make a dent, and many shippers, like Amazon and UPS, are adding EVs to cut emissions, but drones are still the cleanest delivery method, Samaras says.\n\nIn a statement to Axios, Amazon said it is committed to bring down its contributions to climate change:\n\n\"We’ve eliminated more than 244,000 tons of packaging materials and avoided 500 million shipping boxes, and with anticipated and continued progress in electric vehicles, aviation bio fuels, and renewable energy we have set an ambitious goal to reach 50% of all Amazon shipments with net zero carbon by 2030.\"\n\nTarget said it aims to reduce its carbon footprint by 30% by 2030.\n\nWalmart did not respond to an email. Its 2018 report on sustainability set a goal to reduce emissions 18% from 2015 to 2025.", "description": "Flying, trucking and delivering millions of packages a day comes with a cost.", "authors": [], "top_image": "https://images.axios.com/-SJ3axDltvBZGu8Cp2ha4l87XjU=/0x0:1920x1080/1920x1080/2019/06/20/1561048080483.jpg", "published_at": "2019-06-21"}