{"pub": "cbc", "url": "https://cbc.ca/news/canada/toronto/doug-ford-schedule-federal-election-1.5321867", "downloaded_at": "2019-10-29 08:42:12.123742+00:00", "title": "Here's what Doug Ford was actually doing during the election campaign | CBC News", "language": "en", "text": "Ontario Premier Doug Ford had no events or meetings scheduled on at least five weekdays during the federal election campaign, according to information obtained by CBC News.\n\nFord stayed mostly out of sight from Ontarians from the start of the election campaign on Sept. 11 until the Legislature resumed sitting on Monday, one week after election day.\n\nDuring the two news conferences he has held in the past two months — both in northern Ontario — the Progressive Conservative premier said he wasn't involved in the federal campaign because he was \"busy governing\" and said his staff were working him \"like a rented mule.\"\n\nIn response to queries from CBC News about Ford's schedule, the premier's office provided a day-by-day list of his activities from his attendance at the International Plowing Match on Sept. 17 until the final week of the election campaign.\n\nThe list shows no events on Thursday, Sept. 19; Tuesday, Oct. 1; Wednesday, Oct. 2; Thursday, Oct. 10 and Friday, Oct. 11. His only event listed on Oct. 3 was in the evening, a $600 per plate fundraiser in Sudbury for his Ontario PC Party.\n\nOn five other weekdays — Sept. 18, 24, 26, 27 and 30 — the list simply says either \"briefings,\" \"meetings,\" or \"briefings and meetings\" with no further detail.\n\nFord also presided over cabinet meetings every other week during the campaign: Sept. 12, Sept. 25 and Oct. 9. The full list appears below.\n\nFord's near-disappearance during the campaign was part of a deliberate strategy by his handlers to keep him out of the media spotlight , according to provincial and federal Conservative sources who spoke on condition of anonymity. They say the strategy was motivated by two factors: trying to reverse Ford's sharp slide in public opinion and trying to limit the damage-by-association to Conservative Leader Andrew Scheer.\n\nWith the exception of advising the media of his occasional news conferences and photo opportunities, Ford's office does not publish his public itinerary in advance, unlike past premiers. Over the past year, CBC News has used Ontario's freedom of information law to obtain copies of his appointment calendar after the fact, typically with a lag time of one to two months. CBC has filed a request for Ford's full calendar through the federal election campaign period.\n\nDuring the campaign, Ford's officials advised reporters in advance of his Sept. 20 trip to Ohio along with Alberta Premier Jason Kenney to meet Gov. Mike DeWine and to attend a roundtable of an organization called North American Strategy for Competitiveness. Advance notice was also given of Ford's attendance at an Oct. 6 memorial ceremony for firefighters and his Oct. 16-18 trip to Kenora and Thunder Bay.\n\nOther events on the list provided show Ford attending charity events, weekend community barbecues and just two media interviews: Oct. 15 with CIRV 88.9 RedFM, a multicultural radio station in Brampton; and Oct. 8 with TCN TV, an online-only outlet catering to the Caribbean community in the Toronto area.\n\nSince shuffling his cabinet on June 20, more than four months ago, Ford has held just one full-fledged news conference in the provincial capital.\n\n\"The premier was obviously trying to stay out of trouble by just staying away,\" said Ontario NDP Leader Andrea Horwath in an interview Monday. \"For that number of weeks to go by and Ontarians not hear 'boo' from their premier, I think it's pretty clear that was on purpose and he was just trying to avoid any kind of communication that would have put the spotlight on him.\"\n\nInterim Ontario Liberal leader John Fraser criticized Ford's recent schedule and his decision to extend the legislature's summer recess. \"I've worked for one premier and I've worked with one premier, and I know what their schedules were like, and they were never like that,\" Fraser said Monday. \"There's a lot of stuff that needs to be dealt with and for us to be not here dealing with that, it's just simply wrong.\"\n\nOn Oct. 16, Ford kicked off a three-day tour of northwestern Ontario with this news conference in Kenora. It was one of only two news conferences Ford has held in the past two months. (The Canadian Press)\n\nMike Schreiner, leader of Ontario's Green Party, said Ford should make his schedule public.\n\n\"He said during the [provincial] campaign he would be transparent and accountable to people,\" Schreiner said at the legislature. \"But if you're going to hide your schedule and essentially hide from the media, then you're essentially hiding from the people of Ontario.\"\n\nFord has travelled to more than 80 communities and attended nearly 200 events in the past few months, said his press secretary Ivana Yelich.\n\n\"He spends every day talking and listening to people from across the province about what our government can do to make life easier and more affordable for all Ontarians,\" said Yelich in a statement emailed to CBC News.\n\nTwitter provides further evidence of Ford's whereabouts during the campaign. On Tuesday Oct. 8, he was in the Credit River and toured the construction site of the Eglinton Crosstown rapid transit in Toronto.\n\nNice to have Ontario’s Premier and Minister of Natural Resources assisting fisheries work in the Credit River yesterday. They helped Ministry staff collect Chinook salmon eggs that will be raised at the Ministry’s fish hatchery over the winter, and stocked in 2020. <a href=\"https://t.co/ViIMsbTsLS\">pic.twitter.com/ViIMsbTsLS</a> —@PCSalmon_Trout I had a great tour of Eglinton <a href=\"https://twitter.com/CrosstownTO?ref_src=twsrc%5Etfw\">@CrosstownTO</a> facilities with <a href=\"https://twitter.com/Metrolinx?ref_src=twsrc%5Etfw\">@Metrolinx</a>, joined by <a href=\"https://twitter.com/C_Mulroney?ref_src=twsrc%5Etfw\">@C_Mulroney</a> and <a href=\"https://twitter.com/KingaSurmaMPP?ref_src=twsrc%5Etfw\">@KingaSurmaMPP</a>. We're supporting the largest transit expansion in Toronto’s history as part of our plan to create a truly regional transit system that gets Ontario moving! <a href=\"https://t.co/AM3GXJVVhf\">pic.twitter.com/AM3GXJVVhf</a> —@fordnation\n\nOn Oct. 7, Ford met RoseAnne Archibald, leader of the Chiefs of Ontario, the advocacy group for 133 First Nations in the province.\n\nThank you <a href=\"https://twitter.com/ORCRoseAnne?ref_src=twsrc%5Etfw\">@ORCRoseAnne</a> and <a href=\"https://twitter.com/ChiefsofOntario?ref_src=twsrc%5Etfw\">@ChiefsofOntario</a> for joining us at Queen's Park today to discuss priorities that matter to our First Nations communities. <a href=\"https://t.co/EdHoa1xXwI\">pic.twitter.com/EdHoa1xXwI</a> —@fordnation\n\nIn late September, Ford made a few unannounced appearances at events with fellow Progressive Conservative MPPs.\n\nGreat to meet so many wonderful people in Scarborough today at the <a href=\"https://twitter.com/Christina_Mitas?ref_src=twsrc%5Etfw\">@Christina_Mitas</a> MPP community BBQ! <a href=\"https://t.co/RJZmIGnRq8\">pic.twitter.com/RJZmIGnRq8</a> —@fordnation Thrilled to be in Mississauga today with <a href=\"https://twitter.com/RodPhillips01?ref_src=twsrc%5Etfw\">@RodPhillips01</a> and <a href=\"https://twitter.com/stcrawford2?ref_src=twsrc%5Etfw\">@stcrawford2</a> for <a href=\"https://twitter.com/krasheedmpp?ref_src=twsrc%5Etfw\">@krasheedmpp</a>'s community BBQ! <a href=\"https://t.co/rUYSb99wvS\">pic.twitter.com/rUYSb99wvS</a> —@fordnation\n\nOn Sept. 23, a CBC reporter and cameraperson crossed paths with Ford at a bakery in Toronto, a day that Ford also had a meeting with Big Brothers and Big Sisters in Etobicoke.\n\nPremier <a href=\"https://twitter.com/fordnation?ref_src=twsrc%5Etfw\">@fordnation</a> office does not issue a daily itinerary so unless they put out an advisory for an event, media don’t know what he’s up to...unless you happen to run into him like I did today at <a href=\"https://twitter.com/UnitedBakersTO?ref_src=twsrc%5Etfw\">@UnitedBakersTO</a> where I was talking to voters <a href=\"https://twitter.com/hashtag/elxn43?src=hash&ref_src=twsrc%5Etfw\">#elxn43</a> <a href=\"https://t.co/FP1uDmsxNe\">pic.twitter.com/FP1uDmsxNe</a> —@fitz_meagan\n\nHere is a list of Premier Doug Ford's events from Sept. 17 to Oct. 18, as provided to CBC News by his press secretary:", "description": "Ontario Premier Doug Ford had no events or meetings scheduled on at least five weekdays during the federal election campaign, according to information obtained by CBC News.", "authors": ["Provincial Affairs Reporter", "Mike Crawley Is Provincial Affairs Reporter In Ontario For Cbc News. He Has Won Awards For His Reporting On The Ehealth Spending Scandal", "Flaws In Ontario'S Welfare-Payment Computer System. Before Joining The Cbc In", "Mike Filed Stories Countries In Africa As A Freelance Journalist", "Worked As A Newspaper Reporter In B.C.", "Twitter"], "top_image": "https://i.cbc.ca/1.5338413.1572288893!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/ont-house-resumes-20191028.jpg", "published_at": "2019-10-29"}