{"pub": "theverge", "url": "https://theverge.com/2019/10/25/20932953/microsoft-windows-10x-leaked-document-laptop-clamshell-support-modern-file-explorer-details", "downloaded_at": "2019-10-25 23:40:15.859733+00:00", "title": "Microsoft leak reveals Windows 10X will be coming to laptops", "language": "en", "text": "Microsoft has accidentally published an internal design document for its upcoming Windows 10X operating system. Spotted by WalkingCat, the document was briefly available online today and provides some more detail about Microsoft’s plans with Windows 10X. The software giant originally unveiled Windows 10X as the operating system powering the company’s new Surface Neo hardware, but it will also run on similar dual-screen devices.\n\nMicrosoft has so far only officially confirmed Windows 10X will be available on foldables and dual-screen devices, with tweaks to both the Start Menu and taskbar, but it’s clear the company now has ambitions to bring those changes to traditional clamshell laptop hardware. “For both clamshells and foldables, the taskbar will be the same base model with a series of ‘levers’ which can be pulled to create some alternatives in the model,” explains the document.\n\nIn Windows 10X, Microsoft now refers to the Start Menu as the Launcher, which has a stronger emphasis on local search: “Search is seamlessly integrated with web results, available apps, and specific files on your device,” reveals the document. “Recommended content is dynamically updated based on your most frequently and recently used apps, files, and websites.”\n\nWindows 10X will also improve the Windows Hello facial recognition authentication experience. “When the screen turns on you are immediately brought to a state of authentication; unlike Windows 10 where you first need to dismiss the lock curtain before authenticating,” reveals the Windows 10X document. “Upon waking the device, Windows Hello Face instantly recognizes the user and will immediately transition to their desktop.”\n\nElsewhere in the leaked document, Microsoft also mentions a “Modern File Explorer.” The company has long been working on a more modern Universal Windows App (UWP) version of the traditional File Explorer, and it appears this will finally debut with Windows 10X. It will likely be touch-friendly, and simplified for access to documents stored in Office 365, OneDrive, and other cloud services.\n\nMicrosoft is also simplifying the Action Center (notification center) and quick settings in Windows 10X. This will make it quicker to access critical device settings, and prioritize showing important ones like battery life. Windows 10X will also support customization here, but Wi-Fi, cell data, Bluetooth, airplane mode, rotation lock, and projection are all default quick settings.\n\nOn the Office side, it appears Microsoft is prioritizing traditional Win32 versions of Office and the PWA web versions from Office.com for Windows 10X over UWP. Microsoft does have UWP versions of its Office Mobile apps, but the company put the development of those on hold last year. We’ll likely see a significant investment in the web versions of Office over the coming year before Windows 10X ships on the Surface Neo for holiday 2020.\n\nMicrosoft pulled its Windows 10X documentation offline before we were able to see all the details. We’ve reached out to the company for comment on the leak, and we’ll update you accordingly.", "description": "Microsoft has accidentally published an internal Windows 10X document online. It reveals design choices for its new dual-screen and foldables operating system — and that Windows 10X may soon be coming to traditional clamshell laptops as well.", "authors": ["Tom Warren", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/q2D2jWO_C0ymYqg4yLgq9uczIYs=/0x69:960x572/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19320185/Windows10X_01_e1570127842202_960x640.jpg", "published_at": "2019-10-25"}