{"pub": "reuters", "url": "https://reuters.com/article/us-usa-election-debate-factbox/factbox-six-things-to-watch-at-the-democratic-debate-in-ohio-idUSKBN1WT188", "downloaded_at": "2019-10-14 11:31:20.389328+00:00", "title": "Factbox: Six things to watch at the Democratic debate in Ohio", "language": "en", "text": "WASHINGTON (Reuters) - Twelve Democratic presidential candidates will take the stage in Westerville, Ohio, on Tuesday in the party’s fourth debate of the nominating contest for the November 2020 U.S. election.\n\nDemocratic 2020 U.S. presidential candidate and former Vice President Joe Biden speaks at a campaign town hall meeting in Manchester, New Hampshire, U.S., October 9, 2019. REUTERS/Mary Schwalm\n\nIt will be the largest scrum on a debate stage yet for the Democrats, as they try to find a nominee to take on President Donald Trump, a Republican.\n\nMost notably, it will be the first debate held since the U.S. House of Representatives launched an impeachment inquiry into Trump’s attempts to encourage the government of Ukraine to interfere in the election. The probe likely will be recurring subject throughout the evening.\n\nHere are some moments to watch for during the debate:\n\nBIDEN ON BIDEN\n\nIn the now-documented phone call between Trump and Ukrainian President Volodymyr Zelenskiy that lies at the heart of the impeachment probe, Trump suggested that Zelenskiy should investigate Joe Biden and his son, Hunter. The younger Biden sat on the board of a Ukrainian gas company, Burisma, while his father was vice president under President Barack Obama.\n\nTrump has repeatedly suggested, without offering evidence, that Joe Biden pressed Ukraine to back off from a corruption investigation of the company.\n\nBiden has tried to use Trump’s allegations to his political advantage, arguing Trump’s persistent focus on him means Trump fears a face-off in the general election next year.\n\nThe debate will mark the first time that Biden will be on stage with his Democratic rivals since the call came to light. The topic likely will come up, one way or the other. And Biden will likely be pressed on his son’s business activities in front of millions of Democratic voters.\n\nBiden must continue to use Trump’s attacks to contend that he is the candidate most likely to beat Trump, said John Geer, a political science professor at Vanderbilt University.\n\n“Biden should be more aggressive right now, in light of the Ukraine scandal and feed the narrative he can win,” Geer said.\n\nBIDEN VS. WARREN\n\nThe bigger question is whether any other contender will seek to press Biden on the matter or assert that there were ethical issues with Hunter Biden’s arrangement.\n\nThe candidate to watch will be U.S. Senator Elizabeth Warren, who has made combating Washington cronyism a hallmark of her presidential campaign.\n\nWarren has risen in the polls to the point where she is now considered a front-runner for the nomination along with Biden. She has largely stayed away from criticizing her fellow Democrats. Is this where she twists the knife?\n\nFor his part, Biden vowed at a fundraiser in Los Angeles last week that he would be more pugilistic in this debate, even as he lamented that the number of candidates on stage would make it more difficult for his message to punch through.\n\n“One of the problems I’m finding, I’ve got to be more aggressive,” Biden said, later adding, “I’ve had some difficulties on knowing to counterattack.”\n\nBERNIE’S BACK\n\nThe debate will mark the first official public appearance for U.S. Senator Bernie Sanders since he suffered a heart attack at a campaign stop in Las Vegas on Oct. 1.\n\nSanders, 78, is the oldest of the 19 candidates seeking the Democratic nomination, and the incident has raised questions about his age and his capacity to serve as president.\n\nSanders maintains he is ready to resume his campaign and will continue full-bore.\n\nCampaign manager Faiz Shakir said he and other aides who have joined Sanders at his home in Burlington, Vermont, in recent days for debate preparation were struck by the senator’s energy levels, which Shakir believes have risen since Sanders had an artery propped open with stents.\n\n“It will be important for him to relay that and to show it, not only with his words but with his actions, that he is feeling great,” he said.\n\nIt’s a precarious time for the Democratic socialist. He notched a $25 million haul in the third fundraising quarter of the year, suggesting fervent support for his grassroots movement persists. But he has been losing ground in the polls to Warren.\n\nHis energy level on Tuesday will be closely watched.\n\n“My guess is that Sanders’ heart situation may matter more for Biden,” Geer said. “Warren could pick up some real support if Sanders has an enduring problem.”\n\nA NEW URGENCY\n\nAs a topic, U.S. foreign policy has largely been regulated to the second half of previous debates, behind such flashpoints as healthcare and immigration.\n\nNot so this time, predicted Brad Bannon, a longtime Democratic pollster in Washington who works with labor unions and Democratic issue groups.\n\n“The Turkish attack on the Kurds in Syria will prompt a discussion of foreign policy that has got little attention in the previous debates,” Bannon said.\n\nThe crisis in Syria - unfolding after Trump’s decision to withdraw U.S. troops who had been fighting alongside Kurdish forces against Islamic State militants - likely will spark an examination of Trump’s track record on the world stage.\n\nThat could benefit Biden, a seasoned foreign policy hand. It may also lead to awkward moments for candidates such as Warren and Sanders, whose non-interventionist policies often resemble Trump’s in substance if not in style.\n\nTHE NEW GUY\n\nTuesday’s debate will be the first for California billionaire Tom Steyer, who entered the presidential race this summer.\n\nSteyer was ahead of the curve on Trump’s impeachment, having invested millions advocating for it since Trump took office. With every Democrat on stage now supporting impeachment, Steyer has lost his differentiating issue.\n\nHe will use his first debate to focus on his message of campaign finance reform and climate change activism, said his spokesman Alberto Lammers.\n\n“He’s not going to shy away from hitting Trump, but that’s just not his only platform,” Lammers said.\n\nSteyer does not plan to attack other candidates, Lammers added. The other Democrats on the stage likely will be kind to Steyer, too. Whoever the nominee is next year will want his war chest backing him or her.\n\nWHAT ABOUT ME?\n\nFor the remainder of the Democratic field behind Biden, Warren and Sanders, impeachment has come at an inopportune time.\n\nSlideshow (2 Images)\n\nThe constant media coverage of the probe has effectively wiped the lesser presidential hopefuls right off of the TV screen and out of news stories.\n\nThat has largely frozen the race for the moment, just as Pete Buttigieg, the mayor of South Bend, Indiana, and U.S. Senator Kamala Harris of California, were trying to mount a charge to crack into the top three.\n\nFor the rest of the still-sprawling field polling in the low single digits, impeachment could serve as knockout blow as they struggle to gain attention ahead of the nominating contests that begin in February. Those who qualified for Tuesday’s debate will get a chance to create a moment they cannot let pass.", "description": "Twelve Democratic presidential candidates will take the stage in Westerville, Ohio, on Tuesday in the party’s fourth debate of the nominating contest for the November 2020 U.S. election.", "authors": ["James Oliphant", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191014&t=2&i=1440676462&w=1200&r=LYNXMPEF9D0RS", "published_at": "2019-10-14"}