{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/childrens-halloween-cake-topper-looks-much-ruder-planned-11008886", "downloaded_at": "2019-10-30 07:54:58.619752+00:00", "title": "Children’s Halloween cake topper looks much ruder than planned", "language": "en", "text": "A lovely cake with a not-so-lovely message (Picture: Facebook)\n\nDon’t you just love a cake fail?\n\nWhether it’s a peacock wedding cake that looks ‘like a turkey with leprosy’ or one that’s leaning to the side and covered with inedible glitter, there’s a (slightly mean) part of us that just loves when someone’s adventures in baking and decorating go horribly wrong.\n\nMaybe that’s because it helps us feel better about our own kitchen disasters.\n\nThis particular mishap isn’t down to a lack of culinary skills, however.\n\nInstead it’s all due to a cake topper that looks like it says something rather rude.\n\nA photo of a Halloween themed cake, complete with dripping frosting and some happy ghosts, was shared to an Australian cake-shaming Facebook group (yes, there really is a shaming group for everything).\n\nWhile the cake itself looks pretty lovely, the person who posted it explained that the words on top are supposed to say ‘trick or treat’… but they look quite a bit like they say ‘f*** off’ instead. Blame how close the r is to the T.\n\nCan you see it? (Picture: Facebook)\n\nDon’t worry, you’re not imagining things – thousands of people on social media see the swear word, too.\n\nAdvertisement\n\nAdvertisement\n\nBut the good news is that most of those who’ve seen it far prefer the idea of a ‘f*** off’ cake. Look at those rude little ghosts.\n\n‘Absolutely love it, the f-word makes it better,’ said one commenter.\n\nAnother said: ’10/10 I love this cake for all the reasons it is a fail.’\n\nThe good news for the baker (whoever they may be): there’s no need to start from scratch. Either play the insult off as a deliberate trick or sneakily ditch the topper entirely. Easy.\n\nMORE: An easy guide to non-sexy Halloween costumes\n\nMORE: Gory daddy daughter zombie photoshoot wins Halloween\n\nMORE: Ordinary terraced house transformed into horror display for Halloween\n\nAdvertisement Advertisement", "description": "A 'trick or treat' cake topper doesn't look like it says 'trick or treat' on first glance.", "authors": ["Ellen Scott"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/halloween-cake-topper-featured-image-crop-5a84_1572421542.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-30"}