{"pub": "euronews", "url": "https://euronews.com/2019/10/03/the-bulgarian-government-wants-to-end-scrutiny-of-its-human-rights-abuses-we-can-t-let-the", "downloaded_at": "2019-10-05 10:52:24.115932+00:00", "title": "The Bulgarian government wants to end scrutiny of its human rights abuses. We can't let them ǀ View", "language": "en", "text": "“Why don’t they defend those who get robbed? Why are they only defending those that have trouble with the police? Why are they defending minorities? Do you know how many policemen are being investigated because of them?”\n\nThis is what you hear when the Bulgarian Deputy Prime Minister, Krasimir Karakachanov and others speak about the human rights organisation, The Bulgarian Helsinki Committee. It is the largest and oldest human rights organisation in Bulgaria.\n\nAnd now it is facing the threat of closure after the deputy prime minister - who is also Bulgaria’s Minister of Defense - called this week for the shutdown of the NGO. Members of his party, the Bulgarian National Movement (IMRO) - a Far-Right party participating in the ruling coalition - have filed a request with the Bulgarian Prosecutor General for a review of the activities of the human rights NGO, asking for it to be closed down.\n\nMake no bones about it. This is an attack on our freedom.\n\nThis is why I have notified the relevant authorities at the United Nations about what is taking place in Bulgaria. Activities of this type directed against human rights defenders have no place in a rule of law state, let alone an EU state. As a prominent government official, Krasimir Karakachanov has a particular obligation to respect human rights defenders.\n\nThe concept of human rights – by its very definition – protects citizens against the State and its organs, including policemen. That is one of the issues for Karakachanov. Well, welcome to the 21st century, Minister. Iveta Cherneva Human rights author\n\nAmnesty International and Human Rights Watch criticised his and his party’s actions this week. Over 70 Bulgarian NGOs stood by the Helsinki Committee, having sent a public letter of support condemning the attack on the NGO.\n\nWhile my signal to the UN is currently being looked at, it is worth discussing why the deputy prime minister and others have such a huge problem with the Bulgarian Helsinki Committee, and organisations of this type.\n\nThe concept of human rights – by its very definition – protects citizens against the State and its organs, including policemen. That is one of the issues for Karakachanov. Well, welcome to the 21st century, Minister.\n\nPolicemen being investigated for misconduct is something we have to applaud, not something which shows how far things have gone. Bulgaria, with its post-communist baggage, has had a police system which traditionally has gone over and beyond what is allowed by law. Things of course are changing but you’ll always have policemen who abuse their legal limits. It happens in virtually every country. That’s why we need human rights organisations to watch for these things. And that’s a good thing.\n\nWhen policemen catch an alleged criminal, they don’t get to beat them up or lock them up indefinitely. Period. These are the kind of cases that human rights NGOs like the Bulgarian Helsinki Committee look into. And they, by definition, will be focused on the actions of policemen and the State. That’s the name of the game; that’s what human rights are about. This is a concept that Karakachanov is not comfortable with; why should anyone be allowed to criticise the police forces? This to him is rather unpatriotic.\n\n“Why don’t they instead look at and help the victims of more convenient crimes, such as robbery?” Well, human rights are not about the victims of robbery. They protect citizens from their own state when that state violates their rights. Policemen do not get investigated for no reason, without any evidence of wrongdoing. Defending human rights is a very uncomfortable task because – by definition – the NGO has to go against the State. And for some, like Karakachanov, that shouldn’t be done because it leads to punishments for policemen when they step over.\n\nWorking for the UN High Commissioner for Human Rights where I reviewed human rights complaints from around the world, I learnt that every country violates human rights – only the scale and extent differ. This is why it is crucial to have human rights defenders like the Bulgarian Helsinki Committee who can help victims on the ground. Having international organisations like the UN is not enough.\n\nLet us turn now to the request to the Prosecutor General to look into the activities of the human rights NGO, with a view to closing it down for allegedly “interfering in the judicial system.” Interference with the judicial system is what lawyers and prosecutors both do, by definition. By presenting facts to push their own case, the judicial system is a place of interference. Justice is not static. Of course, human rights defenders advocate for, interfere, push for and defend their clients. This is their job. Karakachanov’s Far-Right party is uncomfortable with such a strong voice for human rights in the process. Prosecution is prosecution; human rights defense is, well, interference.\n\nLiving in Bulgaria, I don’t want to see the country follow the example of Hungary where human rights NGOs and universities are pushed so hard by the authorities that they have to close and move. That is not the right path to follow. Iveta Cherneva Human rights author\n\nNext, we should discuss the role of the Prosecutor General who would have to opine on the request for the close down of the NGO. Euronews readers should be told at this point that Bulgaria is facing a scandal with the selection of the next Prosecutor General. Ivan Geshev, who is currently the number two in the Prosecutor’s Office, is nominated to become Bulgaria’s next chief prosecutor. The capital Sofia witnessed protests by thousands of people marching on the streets against Geshev’s selection as chief prosecutor, because among other things, he is the only candidate in the process. That is never a good sign. Questions are also raised about which oligarchic power circles Geshev would be serving.\n\nGeshev, the deputy in the Prosecutor’s Office, is important in this case because his attitude towards this human rights NGO is well known. When he receives the annual report about the human rights situation in Bulgaria penned by the Bulgarian Helsinki Committee, he famously sends back literary works about the Bulgarian struggle for independence, in my view trying to educate the NGO about being pro-Bulgarian. Of course, criticising the system does not make an NGO anti-Bulgarian. The job of patriots is not to shut up.\n\nA similar reaction has been noted by the current Prosecutor General who will be looking at the case. When he receives the human rights report about the situation in Bulgaria, he simply sends it back. The message by both is clear: they see no value in a report that reviews the shortcomings of the system. And they are the people who will be deciding whether this human rights organisation is closed or not.\n\nHuman rights violations are uncomfortable. They push officials to take a look at themselves and their colleagues, often loudly pointing out the injustices. Human rights are not about robberies; if only it was that convenient. Human rights are about what is wrong with the system. And the current top prosecuting duo are not interested in that.\n\nLiving in Bulgaria, I don’t want to see the country follow the example of Hungary where human rights NGOs and universities are pushed so hard by the authorities that they have to close and move. That is not the right path to follow.\n\nThe closing down of the Bulgarian Helsinki Committee would be a blow to Bulgarian leadership and its human rights record. This will be not only a test for the Prosecutor’s office, but for all Bulgarians and the EU.\n\nIveta Cherneva\n\nIveta Cherneva is a Bulgarian human rights author who previously served at the Office of the UN High Commissioner for Human Rights.\n\n____________\n\nAre you a recognised expert in your field? At Euronews, we believe all views matter. Contact us at view@euronews.com to send pitches or submissions and be part of the conversation.", "description": "I have notified the relevant authorities at the United Nations about what is taking place in Bulgaria. Activities of this type directed against human rights defenders have no place in a rule of law state, let alone an EU state.", "authors": ["Iveta Cherneva", "Human Rights Author"], "top_image": "https://static.euronews.com/articles/stories/04/20/51/80/1000x563_cmsv2_a61f9ebc-5d91-5ded-b286-0335ab9465d6-4205180.jpg", "published_at": "2019-10-03"}