{"pub": "investing.com", "url": "https://za.investing.com/analysis/pound--south-african-rand-outlook-attempting-to-break-above-key-trendline-200431433", "downloaded_at": "2019-10-22 14:04:18.337079+00:00", "title": "Pound / South African Rand Outlook: Attempting to Break Above Key Trendline", "language": "en", "text": "- poised to break above key trendline\n\n- If successful uptrend could stretch to 20.00\n\n- to be driven by geopolitics, inflation numbers\n\nSouth African Rand\n\nThe Pound-to-Rand exchange rate is trading at around 19.07 after declining 0.80% already so far this week. Studies of the charts show the pair trading in a sideways range at the level of a key trendline, with an overall upside bias.\n\nFour hour GBPZAR\n\nThe 4hr chart - used to determine the short-term outlook which includes the next 5 days - shows the pair trading sideways around the point of a long-term trendline.\n\nIt looks like it may have formed a triangle pattern the potential to break either to the upside or downside, although there is a slight preference for the former.\n\nThis is because prior to the triangle the short-term trend has been bullish and given the axiom ‘the trend is your friend’ it is predisposed to rise further.\n\nA break above the triangle highs at 19.27 would provide confirmation a continuation higher to a target at 19.50.\n\nAlternatively, a break below 18.95 would negate the upside bias temporarily and suggest a retracement back down to support at the 18.70-75 level.\n\nThe daily chart is showing the probable formation of a bull flag continuation pattern in the ongoing uptrend.\n\nDaily GBPZAR\n\nAccording to this interpretation, a break above the 19.27 would trigger the next leg of the bull flag higher.\n\nThis will be the same length as the ‘flag pole’ extrapolated higher, which gives an eventual upside target at 19.75.\n\nThe daily chart is used to give us an indication of the outlook for the medium-term, defined as the next week to a month ahead.\n\nThe weekly chart shows how the pair continues to trade within a large pattern which looks like a wedge.\n\nWeekly GBPZAR\n\nA breakout higher would suggest a probable continuation up to a target at 20.10 and the key September 2018 highs.\n\nA break clearly above 19.27 would provide initial confirmation, followed by a further break above 19.50.\n\nThe weekly chart is used to give us an indication of the outlook for the long-term, defined as the next few months.\n\nThe South African : What to Watch\n\nThe main drivers of the South African in the near-term are likely to be global risk trends, the value of the U.S. Dollar - to which the Rand is negatively correlated - and SA inflation data.\n\nAs trade tensions, ease and risk assets recover the SA has also found support along with most other emerging market currencies.\n\n“The vibe around US-China trade relations is better. Trump’s economic advisor Kudlow said that he saw the possibility of taking the December tariff increases off the table, as China requested if trade talks go well,” says Jason Wong, an analyst at BNZ Bank.\n\nWhilst there is always a risk of ‘a slip twixt cup and lip’ and the deal isn’t done until both parties sign on the dotted line, the mood music has undoubtedly changed for the better, suggesting a positive back draught for the in the short-term.\n\nThe outlook for has also improved and although parliament is stymying the progress of Johnson’s Brexit deal, most analysts think there is a wafer-thin majority of MPs in favour of the deal which could see it finally gain approval.\n\nIf it fails to win approval or gets altered beyond recognition by too many amendments then the next most likely outcome is a general election or a referendum so the people can have the final say.\n\nThe key thing for currency markets is that both these secondary outcomes would be relatively benign and the worst-case scenario of a ‘no-deal’ Brexit now appears to be well and truly off the table.\n\n“The prospect of a Brexit agreement and the possibility that the worst is over in terms of the trade war continue to see improvement in risk appetite, with our index moving above the 60% mark to a risk-loving setting,” says Wong.\n\nThe U.S. Dollar has been weakening in this new more diplomatic environment due to a reduction in safe-haven flows as well as the newfound strength of the Euro and Sterling from easing Brexit risks.\n\nIt is a little strange the U.S. Dollar is weakening because another key driver of the current interest rates are rising and this would normally be expected to support the greenback.\n\nU.S. 10 year yields are back up at 1.8%, and the yield curve - the chart of interest rates of loans of differing lengths - has gone from inverting to steepening which is another positive sign, both for the Dollar and the economy.\n\n“Global rates continue to probe higher, with 10-year rates across Europe and the US up about 4bps, seeing the US 10-year trade at 1.80%, its highest level in a month and up some 30bps in two weeks. Curve steepening remains evident with the US 2s10s spread up through 19bps, its highest level since July,” says Wong.\n\nThis suggests politics is overshadowing interest rates as the Dollar’s main fundamental driver. This state of affairs could pass, however, presenting the risk of a recovery for the greenback which would be negative for the because of its negative correlation with USD.\n\nOn the domestic data front, there is only one main release of importance to the and that is September inflation ( ), which is forecast to show a 4.2% yearly gain from 4.3% in August, both in core and headline.\n\nPrice growth is expected to be muted in September, however, due to data already showing a fall in average rental inflation.\n\nThe broader gauge of inflation may also suffer due to an expected fall in food inflation.\n\n“Easing food and core CPI are likely to trim the headline CPI print slightly. Owners' equivalent rent and actual rentals for housing inflation are likely to remain subdued and thus pull down core CPI,” says Peter Worthington, an economist at ABSA (JO: ).\n\nThe result will only likely impact on the if the actual data differs markedly from expectations.\n\nStrangely, though inflation is generally seen as an economic ill from a currency perspective it is often a boon. This is because it pressures central banks to raise interest rates, which attract greater inflows of foreign capital, increasing local currency demand.\n\nOriginal post", "description": "Forex Analysis by Joaquin Monfort covering: USD/ZAR, GBP/ZAR, Absa Group Ltd. Read Joaquin Monfort's latest article on Investing.com South Africa.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-22"}