{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/10/ap-fact-check-trump-overstates-his-influence-on-dr", "downloaded_at": "2019-09-10 23:32:15.673633+00:00", "title": "AP FACT CHECK: Trump overstates his influence on drug prices", "language": "en", "text": "WASHINGTON (AP) - President Donald Trump is off the mark in taking credit for a drop in drug prices that he calls unprecedented in half a century.\n\nTRUMP: “Our ambitious campaign to reduce the price of prescription drugs has produced the largest decline in drug prices in more than 51 years.” - remarks at North Carolina rally Monday night.\n\nTHE FACTS: He’s exaggerating his influence on drug prices, which haven’t fallen for brand-name drugs, the area that worries consumers the most.\n\nMost of the Trump administration’s “ambitious campaign” to reduce drug prices has yet to be completed. Major regulations are still in the works and legislation has yet to be passed by Congress. A rule requiring drug makers to disclose prices in TV ads has been blocked for now by the courts.\n\nHarsh criticism of the industry - from Trump and lawmakers of both parties in Congress - may be having some effect, however.\n\nThe Commerce Department’s inflation index for prescription drug prices has declined in seven of the last eight months, which is highly unusual. That index includes lower-cost generic drugs, which account for 90% of prescriptions filled in the U.S. Prices for generics have been declining under pressure from big drug distributors.\n\nFor brand-name drugs, though, a recent analysis by The Associated Press shows that on average prices are still going up, but at a slower pace. The cost of brand-name drugs is what’s most concerning to consumers, with insured patients facing steep copays for some medications.\n\nThe AP analysis found that in the first seven months of 2019, drugmakers raised list prices for brand-name medicines by a median, or midpoint, of 5%.\n\nThat does reflect a slowing in price increases. They were going up 9% or 10% over those months the prior four years.\n\nBut it’s not a decrease in actual prices. There were 37 price increases for every decrease in the first seven months of 2019. Pricing data for the AP analysis came from the health information firm Elsevier.\n\nWhile several drugmakers skipped their usual mid-year increases this year, some doubled prices - or even went for more.\n\nFor example, drugmaker Ajinomoto Cambrooke raised prices by more than 3,000% for five nutritional supplements needed by people with certain genetic conditions. The company declined to talk about it.\n\n___\n\nAssociated Press writer Hope Yen contributed to this report.\n\n___\n\nFind AP Fact Checks at http://apne.ws/2kbx8bd\n\nFollow @APFactCheck on Twitter: https://twitter.com/APFactCheck\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "President Donald Trump is off the mark in taking credit for a drop in drug prices that he calls unprecedented in half a century.", "authors": ["The Washington Times Http", "Ricardo Alonso-Zaldivar"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/10/trump_54867_c0-229-5472-3419_s1770x1032.jpg?6f9ce78ee1a3a25672569ab4bf84dc3559d8855e", "published_at": "2019-09-10"}