{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/20/backlund-propels-flames-to-2-1-victory-over-ducks", "downloaded_at": "2019-10-21 04:09:06.762803+00:00", "title": "Backlund propels Flames to 2-1 victory over Ducks", "language": "en", "text": "ANAHEIM, Calif. (AP) - Mikael Backlund scored with 11:03 left, Cam Talbot made 29 saves and the Calgary Flames rallied for a 2-1 victory over the Anaheim Ducks on Sunday night.\n\nBacklund got a pass from Matthew Tkachuk on a 2-on-1 rush after a neutral zone turnover and beat goaltender John Gibson with a snap shot from the right faceoff circle. It was his second goal in two games.\n\nTalbot made his second start of the season and got his first win as he stopped a flurry of one-timers in the third period. Michael Stone also scored for the Flames, who snapped a three-game road losing streak.\n\nJakob Silfverberg scored for Anaheim, which lost for the first time in five home games. Gibson made 27 saves.\n\nSilfverberg opened the scoring 12 seconds into the second when he beat Talbot top shelf from the left faceoff circle after taking the pass from Hampus Lindholm. Silfverberg - who has five goals this season - has scored in three straight games.\n\nStone tied it at 15:32 of the second with a one-timer from near the blueline for his first point. Gibson didn’t get a clear look as Calgary’s Sean Monahan and Anaheim’s Michael Del Zotto were battling in front of the net when Stone’s slap shot got through.\n\nUP NEXT\n\nFlames: Return home to face Washington on Tuesday.\n\nDucks: Hit the road for four games starting Tuesday at Nashville.\n\n___\n\nMore AP NHL: https://apnews.com/NHL and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Mikael Backlund scored with 11:03 left, Cam Talbot made 29 saves and the Calgary Flames rallied for a 2-1 victory over the Anaheim Ducks on Sunday night.", "authors": ["The Washington Times Http", "Joe Reedy"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/20/flames_ducks_hockey_48506_c0-139-3348-2092_s1200x700.jpg?8350ddc25dffeb13c00cdb13cf3e370371126f2e", "published_at": "2019-10-20"}