{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/ap/article-7615771/Flood-mudslides-strong-rain-Japan-kill-7.html", "downloaded_at": "2019-10-26 02:16:43.281214+00:00", "title": "Flood, mudslides from strong rain in Japan kill at least 7", "language": "en", "text": "TOKYO (AP) - Torrential rain that caused flooding and mudslides in towns east of Tokyo has left seven people dead and added damage in areas still recovering from recent typhoons.\n\nRescue workers in Chiba prefecture are looking for two more people missing on Saturday.\n\nWhile rains have passed and floodwater subsided, parts of the region are still inundated. Thousands of homes are out of running water and some train services delayed or suspended.\n\nRain also washed out Friday's second round of the PGA Tour's first tournament held in Japan.\n\nParts of Chiba are still recovering from two typhoons since last month. Typhoon Hagibis two weeks ago caused widespread flooding and left more than 80 people dead or presumed dead across Japan.\n\nA street is flooded by heavy rain Friday, Oct. 25, 2019, in Narita, east of Tokyo. Torrential rain dumped from a low-pressure system hovering above Japan's main island has triggered flooding in towns east of Tokyo, prompting fears of more damage to areas already hit by typhoons earlier this month. (AP Photo/Lee Jin-man)\n\nMen look at a swollen river due to heavy rain Friday, Oct. 25, 2019, in Narita, east of Tokyo. Torrential rain dumped from a low-pressure system hovering above Japan's main island triggered flooding in towns east of Tokyo, prompting fears of more damage to areas already hit by typhoons earlier this month. (AP Photo/Lee Jin-man)\n\nA toll gate of an expressway near Narita International Airport is closed due to heavy rain Japan, Friday, Oct. 25, 2019. Torrential rain from a low-pressure system hovering above Japan's main island has triggered flooding in towns east of Tokyo, prompting fresh concerns in areas still recovering from recent typhoons. (AP Photo/Lee Jin-man)\n\nA street is flooded by heavy rain Friday, Oct. 25, 2019, in Narita, east of Tokyo. Torrential rain dumped from a low-pressure system hovering above Japan's main island triggered flooding in towns east of Tokyo, prompting fears of more damage to areas already hit by typhoons earlier this month. (AP Photo/Lee Jin-man)\n\nA street is flooded by heavy rain Friday, Oct. 25, 2019, in Narita, east of Tokyo. Torrential rain dumped from a low-pressure system hovering above Japan's main island has triggered flooding in towns east of Tokyo, prompting fears of more damage to areas already hit by typhoons earlier this month. (AP Photo/Lee Jin-man)", "description": "TOKYO (AP) - Torrential rain that caused flooding and mudslides in towns east of Tokyo has left seven people dead and added damage in areas still recovering...", "authors": ["Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/03/wire-20205132-1572055727-305_636x382.jpg", "published_at": "2019-10-26"}