{"pub": "nationalreview", "url": "https://nationalreview.com/corner/dont-subsidize-neighborhoods-because-they-were-redlined-in-the-1930s", "downloaded_at": "2019-10-15 14:58:05.347479+00:00", "title": "Don’t Subsidize Neighborhoods Because They Were Redlined in the 1930s", "language": "en", "text": "Since Ta-Nehisi Coates’s “Case for Reparations,” redlining has loomed large in the debate over race in America — larger than you might expect for a real-estate practice that has been illegal for half a century. Three different presidential candidates have proposed plans to help neighborhoods today on the basis of their having been redlined in the past, such as by subsidizing down payments there.\n\nAndre M. Perry and David Harshbarger of the Brookings Institution now point out a rather salient fact: When they cross-referenced old redlining maps with modern demographics, they found that these neighborhoods are only 28 percent black today. They are disproportionately black relative to the country as a whole — and disproportionately disadvantaged in other ways as well — but only 8 percent of American blacks live there.\n\nThey add:\n\nRedlined neighborhoods are generally located near the center of urban areas, where Black people were concentrated when the government generated the maps used today for the Harris, Warren, and Buttigieg proposals. But since then, transformational demographic shifts have spread different populations throughout metropolitan areas and increased the size of those areas overall.\n\nWhoops.\n\nObviously, this says little about how big of an impact redlining had on the broad racial gaps we see today. If redlining harmed the finances and social capital of black families, those disadvantages could have been passed down to new generations even if those generations moved to different neighborhoods. It pretty definitively shows, however, that if you want to counteract the legacy of redlining or close black-white gaps more generally, you shouldn’t start with maps from the 1930s.", "description": "Their current population is only 28 percent black.", "authors": ["Robert Verbruggen", "Katherine Timpf", "John Hirschauer", "Andrew C. Mccarthy", "John Mccormack", "Kathryn Jean Lopez", "Alexandra Desanctis", "Victor Davis Hanson", "The Editors", "Read More"], "top_image": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2019/06/new-york-city-skyline-2.jpg?resize=300%2C300&ssl=1", "published_at": "2019-10-15"}