{"pub": "zdnet", "url": "https://www.zdnet.com/article/datadog-to-raise-nearly-650-million-in-ipo", "downloaded_at": "2019-09-19 23:05:14.858180+00:00", "title": "Datadog to raise nearly $650 million in IPO", "language": "en", "text": "Cloud monitoring firm Datadog is expected to start trading Thursday on the Nasdaq exchange with the ticker symbol DDOG. The New York-based company priced 24 million shares at $27, which would raise roughly $648 million at a market valuation of around $7.8 billion. Datadog initially set a range of $19 to $22, but the latest projections indicate an opening price of $43.25 a share.\n\nDatadog provides metrics for cloud providers across services, apps, and systems, offering software-as-a-service (SaaS) which can integrate with platforms including Amazon Web Services (AWS), Microsoft Windows Azure, Google's cloud platform, and Java. The firm's partners include AWS, Slack, MongoDB, and Fastly.\n\nThe company indicated in its S1 filing that it has more than 8,000 customers. The company's revenue has increased from $100.8 million in 2017 to $198.1 million in 2018. Its revenue came to $153.3 million for the first half of 2019, with an operating loss of $13.7 million.\n\n\"Our platform provides comprehensive visibility and insights into IT infrastructure, application performance and the real time events impacting this performance,\" the company said in its IPO filing. \"Our proprietary platform combines the power of metrics, traces and logs to provide a unified view of infrastructure and application performance and the real-time events impacting this performance.\"\n\nThe lead underwriters for the Datadog IPO are Morgan Stanley, Goldman Sachs and JPMorgan.\n\nRELATED COVERAGE:", "description": "New York-based company priced 24 million shares at $27​, which would raise roughly $648 million at a market valuation of around $7.8 billion.", "authors": ["Natalie Gagliordi"], "top_image": "https://zdnet3.cbsistatic.com/hub/i/r/2019/09/19/396940dc-ab26-4d80-a78b-df4a522a1070/thumbnail/770x578/ed827955e7490d3ec6d9e95b975f8a5f/istock-11326602681.jpg", "published_at": "2019-09-19"}