{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/boris-johnson-suspend-parliament-prorogue-queens-speech-brexit-a9133381.html", "downloaded_at": "2019-10-03 07:42:00.461419+00:00", "published_at": "2019-10-02", "title": "Boris Johnson to suspend parliament again next week", "language": "en", "text": "Boris Johnson will seek to suspend parliament again next week ahead of a new Queen’s Speech, in a move that risks infuriating MPs.\n\nOnly days after the Supreme Court ordered MPs to return to work, the prime minister will ask the Queen to prorogue parliament on Tuesday for several days to allow him to prepare his new legislative programme.\n\nThe move would allow for a Queen’s Speech to take place on 14 October, ahead of the crucial EU summit on 17-18 October.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIt comes after the UK’s highest court ruled the prime minister’s decision to prorogue parliament for five weeks was unlawful, forcing Mr Johnson to fly back early from a diplomatic mission to face angry MPs.\n\nThe Supreme Court justices ruled the long suspension as void because they found it prevented parliament from carrying out its duties.\n\nParliament was reopened on 25 September and ministers have been forced to shuttle back and forth from Manchester after opposition MPs refused to approve the traditional short recess for their annual conference.\n\nDowning Street said the new suspension was “shortest time possible” to enable logistical preparations for the pomp of a state opening, where the Queen comes to the House of Lords to read the government’s legislative programme.\n\nIf a new Brexit deal is agreed, it would form the central point of this new agenda, No 10 said.\n\nThe prime minister said: “I want to deliver on the people’s priorities.\n\n“Through a Queen’s Speech, the government will set out its plans for the NHS, schools, tackling crime, investing in infrastructure and building a strong economy.\n\nShape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty\n\n“We will get Brexit done on 31 October and continue delivering on these vital issues.”\n\nMr Johnson is unlikely to gain support for his plans due to his lack of a Commons majority – but No 10 will undoubtedly be hoping the Queen’s Speech serves as a platform for a looming general election.\n\nThe prime minister’s official spokesman said the government was “looking at the precise implications” of the Supreme Court judgment when asked about a new Queen’s Speech.", "description": "Boris Johnson will seek to suspend parliament again next week ahead of a new Queen’s Speech, in a move that risks infuriating MPs. Only days after the Supreme Court ordered MPs to return to work, the prime minister will ask the Queen to prorogue parliament on Tuesday for several days to allow him to prepare his new legislative programme. The move would allow for a Queen’s", "authors": ["Lizzy Buchan"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/02/16/boris-0.jpg"}