{"pub": "nationalreview", "url": "https://nationalreview.com/corner/the-nbas-adam-silver-on-china-we-have-no-choice-but-to-engage", "downloaded_at": "2019-10-22 15:34:11.415911+00:00", "title": "NBA’s Adam Silver China Comments: ‘We Have No Choice but to Engage’", "language": "en", "text": "NBA commissioner Adam Silver (Bob Donnan/USA TODAY Sports)\n\nIn today’s Wall Street Journal, NBA Commissioner Adam Silver declares in an interview that he “respectfully disagrees” with those who believe the NBA should disengage with China. “My personal belief is that isolationism doesn’t make sense in this highly interconnected world. We have no choice but to engage and to attempt to have better understanding of other cultures and try to work through issues. What better way than through sports?”\n\nAdvertisement\n\nAdvertisement\n\nSilver’s attempt to reframe the discussion in terms of “isolationism” term is an inartful dodge. No one’s complaining about the NBA’s programs in Senegal, the Philippines, the Czech Republic, Argentina, Bahrain, or Canada. (The Portland Trail Blazers did end their sponsorship with a rifle scope manufacturer who has contracts with the Israeli military, but the team insists it has nothing to do with anti-Israel protests.) The current controversy has nothing to do with NBA exhibition games in Japan, or Vancouver, or Mumbai, or foreign players on NBA rosters. This isn’t about abstract “isolationism,” this is about how the NBA, its coaches, and players instantly went quiet about Chinese human-rights abuses as soon as it became clear that speaking out would jeopardize the league’s lucrative deals in that country.\n\nNor is Silver’s description of “attempt a better understanding of other cultures” particularly accurate. This isn’t a divide over cultures, this is a divide over government policy. The Chinese government is currently cracking down on protesters in Hong Kong through violent means, and Houston Rockets general manager Daryl Morey wrote one tweet about it. The Chinese government responded with full-spectrum outrage. The Chinese government believes that no one in the NBA should criticize their policies, and the NBA players, coaches, and league officials appear to agree. When Laura Ingraham tells the players to “shut up and dribble” in response to criticism of Trump, the league and its players are defiant. When Xi Jinping effectively says the same through policy choices and state media, the league and its players meekly acquiesce.\n\nAdvertisement\n\nSilver told the Journal that the league does not have “official relationships again yet with our counterparts in China,” but that “I’m hoping that as two weeks have now gone by, and there seem to be further signals of de-escalation, that we can begin renewing those relationships.” He also characterized the NBA as “collateral damage” from the ongoing trade war between the United States and China.\n\nWhat would Silver have to see to conclude that the NBA’s partnerships in China are no longer worth pursuing?\n\nAdvertisement\n\nAdvertisement\n\nDo you notice how in a lot of our discussion of public policy, the ratchet only turns in one direction? Problems that stem from engagement with China can only be solved by more engagement with China.\n\nThe problems that big government programs have failed to solve can only be addressed by bigger government programs. Government efforts to pay for higher education have driven up costs, so the only answer is bigger and more expensive government efforts to pay for higher education.\n\nWe never seem to reach the point where advocates say, “oh, no, wait, we were wrong, this approach isn’t working at all.”", "description": "NBA Commissioner Adam Silver declares in an interview that he “respectfully disagrees” with those who believe the NBA should disengage with China. “", "authors": ["Jim Geraghty", "Robert Verbruggen", "Andrew C. Mccarthy", "Scot Bertram", "William Z. Nardi", "George Will", "Katherine Timpf", "Rich Lowry", "Read More", "The American Conservative"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/adam-silver-nba.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-22"}