{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/remembering-william-bradford-reynolds-stalwart-for-equality-rule-of-law", "downloaded_at": "2019-10-16 13:36:24.786469+00:00", "title": "Remembering William Bradford Reynolds: A Stalwart for Equality and Rule of Law", "language": "en", "text": "William Bradford Reynolds testifies on his nomination to be associate attorney general on Capitol Hill in 1985. (via C-SPAN)\n\nA gentleman and a stalwart for equality and the rule of law.\n\nA stalwart of the Reagan administration passed away last month. Wearing the modest title of assistant attorney general for the Civil Rights Division, William Bradford Reynolds punched far above his weight and left one of the administration’s most enduring legacies.\n\nI worked as a deputy for Brad in 1982–83. He was not only a principled public servant, but a kind and considerate boss. Not once did I see him throw a subordinate under the bus.\n\nAdvertisement\n\nAdvertisement\n\nPresident Reagan’s civil-rights program was deeply controversial. It sought to curtail the busing of school children as an element of school-desegregation decrees. And it sought to limit the use of racial set-asides as a tool of public policy.\n\nAs the president’s civil-rights chief, Brad took much of the heat. He was pilloried as someone who would turn back the clock. Objections were, if anything, more intense within the Justice Department itself, as staff attorneys protested in good faith that any relaxation of pressure on school districts and employers would allow racial bias to rear its ugly head. The protesters had blue-and-white Justice Dissidents T-shirts made, to which Brad responded by donning one of the T-shirts himself.\n\nAnd he stuck to his guns. He believed in a quality education for all and that busing young students far from home was not a productive use of a child’s day. He sought to stress the human commonalities that bind us, not the racial differences that divide us. Due in part to Brad’s efforts, dispensations based on race or ethnicity will be less of a standard feature of our multicultural future.\n\nAdvertisement\n\nAdvertisement\n\nI greatly respect those who see these issues differently. But I hope they will in turn respect Brad’s belief that all civil-rights perspectives must be at bottom deeply humane. I never once heard Brad use racially poisonous rhetoric or treat with anything other than the utmost courtesy those who did not share his views. Civil-rights issues, in Brad’s view, should be open to dialogue, not closed shut by uncontrovertible conventional wisdom.\n\nHe was a force within the Justice Department of those years, admired by attorneys general as different as the mild-mannered William French Smith and the more assertive Edwin Meese. He took an active role in the Reagan administration’s effort to place conservative academics on the federal bench, Robert Bork, Antonin Scalia, Richard Posner, Frank Easterbrook, and Ralph Winter among them. He was the more adventurous foil to the more cautious Solicitor General Rex Lee; Brad at times wished to push the Supreme Court faster than Rex was willing to go. The occasional tension between the two ironically obscured the fact that each saw the Justice Department less as a political institution and more as a guardian of the inviolate rule of law.\n\nIn the end, Brad paid dearly for his beliefs. He was never confirmed for a higher post in the Justice Department, and he was thought to be too toxic for a judgeship, in which position he would have served with distinction. Yet the unfairness of it all bothered his friends more than it did him; he was content to know that length of public tenure does not always coincide with the extent of lasting influence.\n\nAdvertisement\n\nAdvertisement\n\nI remember disagreeing with Brad on what now seems an inconsequential matter. But I argued heatedly and insistently at the time until Brad chuckled and scribbled something on a nearby napkin.\n\n“What’s that you’re writing, Brad?” It was a pyramid with the letters AAG (Assistant Attorney General) at the pinnacle and the letters DAAG (Deputy Assistant Attorney General) at the base. Argument over.\n\nI saved my future disagreements for our daily runs on the Mall, where Brad didn’t have any napkins. I miss those runs, and the remarkable man with whom I took them.", "description": "The late William Bradford Reynolds did an outstanding job of upholding the law as assistant attorney general for the Civil Rights Division under Reagan.", "authors": ["J. Harvie Wilkinson Iii", "Kevin D. Williamson", "Katherine Timpf", "Lee Edwards", "David French", "Kathryn Jean Lopez", "John Hirschauer", "Madeleine Kearns", "Alexandra Desanctis", "Zachary Evans"], "top_image": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/william-bradford-reynolds.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-16"}