{"pub": "guardian", "url": "https://theguardian.com/books/2019/oct/23/truth-is-the-best-story-inside-gene-weingartens-extraordinary-new-book", "downloaded_at": "2019-10-23 08:33:15.304817+00:00", "title": "'Truth is the best story': inside Gene Weingarten's extraordinary new book", "language": "en", "text": "On New Year’s Day 2013, at an oyster house in Washington DC, longtime Washington Post columnist Gene Weingarten and his editor, Tom Shroder, outsourced the fate of their next book project to three strangers. Using scraps of paper and a hat, one patron picked the day, one picked the month, and their waitress picked the year. Their choices would determine Weingarten and Shroder’s research, but little did they know that they’d be locked into the date – Sunday 28 December 1986 – for the next six years.\n\n'Oh man, she's back': Elizabeth Strout on the return of Olive Kitteridge Read more\n\nThe conceit of One Day, the resulting book by Weingarten, out this week, is both straightforward and unspooling: what stories can be found in an “ordinary” day in America? And is there even such a thing as an ordinary day in life? For Weingarten, a two-time Pulitzer prize winner for feature writing, the date-from-a-hat gimmick – mining a random, seemingly ordinary day for its complexities, tracing its refractions into the present – tested a central conceit in his career as a journalist: “If you have the patience to find it and the skill to tell it, there’s a story behind everyone and everything,” he writes. “That although great matters make for strong narratives, power can also lurk in the latent and mundane.”\n\nHumble yet profound, One Day is “the culmination of too many years of work”, Weingarten, 68, joked to the Guardian – the project ballooned four years past its deadline as Weingarten re-reported stories, chased leads, dead-ended and restarted, and conducted over 500 interviews. A report of a deadly house fire in Nebraska on The Day led to its embers in 2010s Colorado; a well-reported and remarkably successful heart transplant in Virginia held a grisly secret from the day before. Several stories Weingarten re-reported from that date didn’t hold enough water to make the book. “There’s a term that ‘journalism is the first rough draft of history’,” said Weingarten, a self-described “old-time” journalist. “I would really emphasize ‘rough’.”\n\nYet the ones that did work attest that 28 December 1986 was many things – a beginning, an end, a prominent pin on the timeline of someone’s life, a recently unearthed memory – but not ordinary. One Day chronicles how 28 December 1986 marks the first day of a rollercoaster marriage, a character-defining journal entry from famed mommy blogger Heather Armstrong, a police murder on a desolate highway in southern California, and a transcendent performance by the recently un-comatose Grateful Dead frontman Jerry Garcia, among other stories.\n\nFacebook Twitter Pinterest Gene Weingarten, Washington Post columnist and author of One Day. Photograph: Courtesy of Washington Post\n\nWeingarten himself can’t recall exactly what he was doing on 28 December 1986, but he does, as a professional writer, know what he published that day: an essay in the Sunday edition of the Miami Herald on the shimmering wonder that is life after a serious accident, which weaves into the final chapter of the book.\n\nStill, despite the bounty of material, Weingarten doubted his central conceit “constantly” throughout the process. “It was sort of a biblical sense of doubt from the very beginning,” he said, starting even with the random selection of the date, which he and Shroder initially took as a bad omen. “Journalists will tell you that Sunday is the worst news day of the week, and the week between Christmas and New Years is the worst week of the year, in terms of having anything happen,” he said (also, “What happened in 1986?”). “So we basically started with this depressing date, and as it turns out, that worked in our favor.” If the concept at hand was that there’s no such thing as an uninteresting day, then their luck of 28 December 1986 certainly put it to the test. “If either Tom or I ever considered suggesting a mulligan to each other and choosing another day,” said Weingarten, “we never told the other one because it would have been ethically impossible.\n\n“You’re stuck with that day, and your job is to find whatever happened,” he said. “On the one hand, I think we got lucky. But on the other hand, I think any day would’ve been lucky.”\n\nBack in 2013, Weingarten cast doubt aside and started his research, naturally, on Google. A surface-level search revealed that prolific crime novelist John D MacDonald died that day – an author who, as luck would have it, knew Shroder in his youth. What did it mean that a renowned author who died on The Day knew one of the selectors of that day? “Nothing but coincidence, obviously,” Weingarten writes in the book, “except in the way it speaks to degrees of separation, and our common suspicion that the deeper you drill into anything, the more eerily intertwined things become.”\n\nThat was often, though not always, his experience as Weingarten dug deeper into research, from legal databases (for lawsuits filed on The Day) to newspaper archives to crowdsourcing for stories on Sirius radio shows to, eventually and often, interviews. Weingarten said it was occasionally a hard sell to have someone turn back their memory three decades, though personally, the selection of the year worked in his favor. He was 36 in 1986, “already a fully formed person”, with a pre-existing perspective on that time in the Reagan era. Yet even though he knew the year, the research process demanded that he look at 1986 “at a depth that stunned me”.\n\nStunned, as in “I was going through my life and I didn’t realize that on that particular day, which didn’t mean much to me at the time, lives were changed, altered, destroyed, made better, love was happening, and hate was happening.”\n\nThat “eye-opening” revelation dovetailed with an experience-tested conviction, one that happens to also be his advice to young journalists: “Truth is always the best story. It just always is.” Over the course of his over four decades in journalism, Weingarten said, he’s learned that “you just have to allow yourself to discover a truth that you didn’t expect”. With the book, “time and again, I expected each of these stories to be a different kind of story, and it wound up being so much better because it was real. It’s what really happened.”", "description": "The two-time Pulitzer-winner picked a date out of a hat, and his book, One Day, chronicles the incredible events of that day", "authors": ["Adrian Horton"], "top_image": "https://i.guim.co.uk/img/media/cfbe46f00d8cc42efe3ac29e77e450fa6562f50d/101_902_1631_978/master/1631.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=49aba3cdfcba885f77d200e7145ff5ce", "published_at": "2019-10-23"}