{"pub": "marketwatch", "url": "https://marketwatch.com/story/fox-news-host-laura-ingraham-is-called-out-for-monstrous-behavior-by-her-own-brother-after-she-mocked-greta-thunberg-2019-09-24", "downloaded_at": "2019-09-25 13:49:00.350504+00:00", "title": "Laura Ingraham is called out for ‘monstrous behavior’ by her own brother after she mocked Greta Thunberg", "language": "en", "text": "Fox News apologized Monday for airing what it described as a “disgraceful” segment in which Daily Wire host Michael Knowles called 16-year-old climate activist Greta Thunberg, who has Asperger’s syndrome, a “mentally ill Swedish child” after she delivered a moving speech at the United Nations.\n\nBut that didn’t stop Fox New’s Laura Ingraham from mocking Thunberg on her show, “The Ingraham Angle,” later that same day:\n\nThe president’s Twitter account also got in, with apparent sarcasm, on the act:\n\nShe seems like a very happy young girl looking forward to a bright and wonderful future. So nice to see! https://t.co/1tQG6QcVKO — Donald J. Trump (@realDonaldTrump) September 24, 2019\n\nIngraham’s brother was not OK with any of it.\n\n“Clearly my sister’s paycheck is more important than the world her three adopted kids will inherit. I can no longer apologize for a sibling who I no longer recognize,” Curtis Ingraham reportedly wrote on Twitter TWTR, +0.27% following the segment. “I can and will continue to call out the monstrous behavior and the bully commentary born out of anger.”\n\nThis dynamic is nothing new. Curtis Ingraham has referred to his sister — the two have been described as estranged — as a monster before, following her comments about Parkland survivor David Hogg, who’d called for an advertiser boycott of the Ingraham show on Fox. Curtis Ingraham also issued an apology to LeBron James after Laura Ingraham told the NBA star to “shut up and dribble.”\n\nIn an interview with the Daily Beast last year about the thoughts he shares toward his sister on social media, Curtis opened up about his feelings.\n\n“She’s very smart, she’s well spoken, but her emotional heart is just kind of dead,” he said. “And you see it in her face when you see her on TV. She’s ready to destroy. She does not listen to understand — she listens to respond. And her response is always an attack.”\n\nThrough the day Tuesday, Twitter TWTR, +0.27% in particular was abuzz:", "description": "Fox News apologized Monday for airing what it described as a “disgraceful” segment in which Michael Knowles called Greta Thunberg, who has Asperger’s...", "authors": ["Shawn Langlois", "Social-Media Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR877_thunbe_ZG_20190923123449.jpg", "published_at": "2019-09-24"}