{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/trump-picked-self-help-illuminati-book-author-federal-education-board-2019-10", "downloaded_at": "2019-10-18 01:11:05.660461+00:00", "title": "Trump picked the author of more than 60 self-help Illuminati books for a federal education board that honors top high school seniors", "language": "en", "text": "President Donald Trump appointed the author of more than 60 self-help Illuminati books to join a federal education board that honors the smartest high school seniors in the nation.\n\nThe Denver Post reported that Trump nominated George Mentz to the Commission on Presidential Scholars last week.\n\nIt's a board tasked with selecting 161 high school scholars who \"demonstrate exceptional accomplishment sin academics, the arts, career, and technical education and an outstanding commitment to public service.\"\n\n\"If you conceive of your desire, you can then imagine that your goal will take place with belief, and then you will be able (to) retrieve the opportunity from the world's storehouse of riches,\" Mentz wrote in \"Abundance Bible & the Secret Powers of Manifesting Wealth Health and Peace of Mind.\"\n\nVisit Business Insider's homepage for more stories.\n\nPresident Donald Trump has appointed the author of self-help Illuminati books to join a federal education board that honors the smartest high school seniors in the nation.\n\nThe Denver Post reported that Trump nominated George Mentz to the Commission on Presidential Scholars last week. It's a board tasked with selecting 161 scholars who \"demonstrate exceptional accomplishment sin academics, the arts, career, and technical education and an outstanding commitment to public service.\n\nMentz also writes a financial column for Newsmax, a conservative news outlet. And his Amazon author page indicates he's written more than 60 books. Some of Mentz's books include:\n\nSuccess Magic — The Prosperity Secret to Win with Magical Spiritual Power: How to Grow Rich, Influence People, Protect Your Mindset and Love Yourself Like a Warrior Using Timeless Abundance Secrets\n\nThe Illuminati Secret Laws of Money\n\nThe Abundance Bible & the Secret Powers of Manifesting Wealth Health and Peace of Mind\n\nThe Illuminati Handbook\n\n100 Secrets and Habits of the Illuminati for Life Success\n\n\"If you conceive of your desire, you can then imagine that your goal will take place with belief, and then you will be able (to) retrieve the opportunity from the world's storehouse of riches,\" Mentz wrote in \"Abundance Bible & the Secret Powers of Manifesting Wealth Health and Peace of Mind.\"\n\nRead more: 15% of registered voters say they believe the Illuminati exists\n\nThe Colorado Springs-based author told the newspaper he's only using Illuminati in book titles for marketing and branding purposes.\n\n\"Just because I use the word Illuminati, don't let that get you too excited,\" Mentz told the Post.\"If you look the word up, it means 'illumination.' How to be more aware, conscious, a better person.\"\n\nMentz owns the Global Academy of Finance and Management, which awards certifications to people who can then list titles that sound legitimate next to their names. The company has been accused of giving certifications to undeserving applicants, the Denver Post reported.", "description": "\"When a person stops struggling and initiates ALCHEMY OR MAGIC, SOMETHING HAPPENS,” Illuminati author George Mentz wrote in 2013.", "authors": ["Joseph Zeballos-Roig"], "top_image": "https://image.businessinsider.com/5da8d0254af909319359c566?width=1200&format=jpeg", "published_at": "2019-10-17"}