{"pub": "businessinsider", "url": "https://businessinsider.com/samsung-galaxy-fold-screen-repair-costs-600-without-warranty-2019-9", "downloaded_at": "2019-09-24 15:21:21.660450+00:00", "title": "It costs up to $600 to repair the new Galaxy Fold's screen out of warranty", "language": "en", "text": "If you break the Galaxy Fold's foldable display after the one-year warranty expires, it could cost you $600 to fix it, Samsung confirmed to Business Insider.\n\nThat's a big cost to repair the Galaxy Fold's screen. It's almost a quarter of the cost of the $2,000 Galaxy Fold. It's also almost twice as much as the $330 cost to repair the iPhone 11 Pro Max's screen out of warranty.\n\nBut if you're facing a $600 bill to replace the Galaxy Fold's foldable screen, it would mean that you've already broken the screen at least once before.\n\nWith the Galaxy Fold, you get one free screen repair under the one-year warranty. After the one-year warranty expires, Samsung offers Galaxy Fold owners a one-time $150 screen repair. After that, it's $600.\n\nSamsung made some big changes to the Galaxy Fold's display since it was first released in April. The company added a layer of metal underneath the display to make it stronger. It also extended the protective screen layer so that there's no visible lip that's begging to be picked at and removed.\n\nWhen the Galaxy Fold was first handled by reviewers in April, some reviewers removed the protective layer, which admittedly looked a lot like a screen protector. Removing that protective layer proved fatal for the Galaxy Fold, as some review unit screens malfunctioned after the layer was removed.\n\nThe second iteration of the Galaxy Fold launched in France, Germany, Singapore, and the UK on September 18, and launches Friday, September 27 in the United States.", "description": "Samsung is offering a one-time $150 screen repair out of warranty. After that, you'd be facing a $600 bill to fix the screen.", "authors": ["Antonio Villas-Boas"], "top_image": "https://amp.businessinsider.com/images/5d8a244a2e22af03b14135b5-1920-960.jpg", "published_at": "2019-09-24"}