{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/1/volodymyr-zelensky-ukraines-president-says-hes-had", "downloaded_at": "2019-10-02 00:36:31.942267+00:00", "title": "Ukraine's president says he's had no contact with Rudy Giuliani", "language": "en", "text": "Ukraine President Volodymyr Zelensky said Tuesday he’s had no interactions with President Trump’s personal attorney Rudolph W. Giuliani.\n\n“I never met Rudy Giuliani — never. And never had any phone calls with him,” Mr. Zelensky said at a news conference in Kyiv, according to CNN.\n\nDuring the controversial July 25 phone call between the two presidents, Mr. Trump suggested his Ukrainian counterpart get in touch with Mr. Giuliani and Attorney General William P. Barr. Mr. Trump pressed the Ukrainian president to speak with them about investigating former Vice President Joseph R. Biden and his son Hunter.\n\nMr. Zelensky also insisted he will not be pressured to probe the 2020 Democratic presidential front-runner or his son.\n\n“I don’t feel pressure,” he said at the press conference. “I have lots of people who’d like to put pressure on me here and abroad. I’m the president of an independent Ukraine — no one can put pressure on me.\n\nAt a press conference on Monday, Mr. Zelensky said he was “open” to investigating the Bidens, but he said he would not do so at the request of the United States.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Ukraine President Volodymyr Zelensky said Tuesday he's had no interactions with President Trump's personal attorney Rudolph W. Giuliani.", "authors": ["The Washington Times Http", "Jeff Mordock"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/26/Ukraine_President_Ground_Zero_75645.jpg-f1fe0_c0-0-3978-2319_s1770x1032.jpg?21031c75c4fe24b065a12b32401e97ef65332a59", "published_at": "2019-10-01"}