{"pub": "fox", "title": "Orlando man who lost 25 percent of skin to flesh-eating bacteria has died", "url": "https://foxnews.com/health/orlando-man-25-percent-skin-flesh-eating-bacteria-dead", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:02:11.625787+00:00", "text": "A man in Florida who had undergone four operations which removed over 25 percent of his skin after he contracted flesh-eating bacteria, died last week.\n\nAccording to his obituary, David Ireland, 50, of Orlando, died on Thursday.\n\nThe navy veteran started having flu-like symptoms, including aches and fever, on August 16, his wife, Jody Ireland, told Fox News last week.\n\nFLORIDA MAN LOSES 25 PERCENT OF SKIN TO FLESH-EATING BACTERIA, WIFE SAYS\n\nShe said five days later, when the symptoms got worse and her husband complained of extreme pain in his groin and leg, she rushed him to the emergency room.\n\n“It was unexpected,” she told Fox News. “He was fine one minute and sick the next.”\n\nAfter Ireland, a father of two girls ages seven and five, was admitted to the hospital, doctors had to remove over 25 percent of the skin from his body, and his kidneys failed, his wife said.\n\nJody said her husband was diagnosed with necrotizing fasciitis, a rare bacterial infection that could spread quickly in the body and could turn deadly, according to the Centers for Disease Control and Prevention (CDC). Symptoms could include fever, dizziness, or nausea soon after an injury or surgery.\n\nFLORIDA WOMAN WHO SURVIVED FLESH-EATING BACTERIA SAYS IT LOOKED LIKE LEG 'WAS ROTTING OFF'\n\nThe bacteria most commonly enter the body through a break in the skin, according to the CDC.\n\nJody told Fox News doctors told her the bacteria entered her husband’s body through an open wound on his leg and “because he is diabetic, the bacteria turned into strep and started eating his flesh.”\n\nOn a GoFundMe page created by his brother to help with the unexpected medical costs, Daniel Ireland posted that his brother had died last Thursday.\n\n“He fought very hard against this disease and all of us will miss him dearly,” the brother wrote. “Your prayers and financial support is greatly appreciated. He meant the world to all of us.”\n\nBOY INFECTED WITH FLESH-EATING BACTERIA DURING TRIP TO MARYLAND BEACH, MOM SAYS\n\nDaniel said the money raised, over $15,000, also would help cover funeral costs.\n\nDavid Ireland had worked at Universal Studios in Orlando.\n\n“He loved his job as attractions trainer at Universal Orlando and always provided a calm peaceful fun atmosphere for his coworkers,” Ireland’s obit said.\n\nHe is survived by his parents, wife, children including two 25-year-olds, and a granddaughter.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nDavid Ireland’s visitation service is scheduled for this coming Saturday morning at an Orlando church. The burial is set for Sept. 9.", "description": "A man in Florida who had undergone four operations which removed about 25 percent of his skin after he contracted flesh-eating bacteria, died last week.", "authors": ["Talia Kaplan", "Talia Kaplan Is A Reporter For Foxnews.Com. Follow Her On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/David-Ireland-family.jpg"}