{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/17/white-house-flies-american-flag-at-half-staff-to-honor-cummings-death", "downloaded_at": "2019-10-18 01:06:49.384272+00:00", "title": "White House Flies American Flag at Half-Staff to Honor Cummings’ Death", "language": "en", "text": "The White House ordered the American flag to be flown at half-staff on Thursday to honor the late Rep. Elijah Cummings (D-MD).\n\nPresident Donald Trump issued a proclamation Thursday ordering that the American flag be flown at half-staff “at the White House” and at other government facilities throughout the U.S.:\n\nBY THE PRESIDENT OF THE UNITED STATES OF AMERICA\n\nA PROCLAMATION As a mark of respect for the memory and longstanding public service of Representative Elijah E. Cummings, of Maryland, I hereby order, by the authority vested in me by the Constitution and the laws of the United States of America, that the flag of the United States shall be flown at half-staff at the White House and upon all public buildings and grounds, at all military posts and naval stations, and on all naval vessels of the Federal Government in the District of Columbia and throughout the United States and its Territories and possessions through October 18, 2019. I also direct that the flag shall be flown at half‑staff for the same period at all United States embassies, legations, consular offices, and other facilities abroad, including all military facilities and naval vessels and stations. IN WITNESS WHEREOF, I have hereunto set my hand this seventeenth day of October, in the year of our Lord two thousand nineteen, and of the Independence of the United States of America the two hundred and forty-fourth.\n\nTrump also expressed his condolences to Cummings’ family and friends in a Thursday tweet.\n\n“My warmest condolences to the family and many friends of Congressman Elijah Cummings,” Trump wrote on Twitter. “I got to see first hand the strength, passion and wisdom of this highly respected political leader. His work and voice on so many fronts will be very hard, if not impossible, to replace!”\n\nCummings died at the age of 68 from health complications and had not returned to work after having a medical procedure he said would only keep him out of the office for a week.\n\nThe procedure caused Cummings to miss a hearing on Washington, DC, statehood. Cummings served as a congressman for Maryland’s 7th Congressional District since 1996.", "description": "The White House ordered the American flag to be flown at half-staff on Thursday to honor the late Rep. Elijah Cummings (D-MD).", "authors": ["Katherine Rodriguez"], "top_image": "https://media.breitbart.com/media/2019/10/Elijah-Cummings-death-640x335.jpg", "published_at": "2019-10-17"}