{"pub": "news24", "url": "https://fin24.com/Companies/ICT/us-company-buys-900-cellphone-towers-in-south-africa-for-r2bn-20191029", "downloaded_at": "2019-10-29 06:26:13.580073+00:00", "title": "US company buys 900 cellphone towers in South Africa for R2bn", "language": "en", "text": "Atlas Tower is selling its South African cellphone tower portfolio to another US group, SBA Communications, for R2bn.\n\nThe US company will dispose of more than 900 towers in South Africa to SBA, Atlas Chief Executive Officer Nathan Foster said in an interview in Johannesburg. The agreed price takes account of previous investments made by the buyer into Atlas’s business, he said.\n\n\"This will be the first African-focused sale for Atlas Towers,” the CEO said.\n\nSBA, which is headquartered in Florida in the US, owns towers throughout North and South America.\n\n“We believe South Africa represents a fantastic growth opportunity,” SBA CEO Jeffrey A. Stoops told RCR Wireless News recently. “We look forward to incremental growth opportunities throughout South Africa over the coming years as the wireless carriers in this market continue to invest meaningfully in 4G and, at some point, 5G deployments.”\n\nRising demand for high-speed internet across Africa has made the tower industry a hotbed for deal making, with wireless carriers looking to sell out to specialist providers. South Africa is seen as a particularly attractive market, as the country is looking to start 5G services over the next two years.\n\nHelios Towers raised $364 million in a London share sale earlier this month as investors looked to capitalize on the growth of tower services in countries such as Tanzania, Ghana and South Africa. American Tower Corp. agreed to buy Eaton Towers Ltd. for about $1.85 billion in May to combine resources on the continent.", "description": "“We believe South Africa represents a fantastic growth opportunity.\"", "authors": ["Loni Prinsloo"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/2661/e97bb0b96e224dcc9ce945464fe1b2f9.jpg", "published_at": "2019-10-29"}