{"pub": "townhall", "url": "https://townhall.com/tipsheet/bethbaumann/2019/10/26/john-kelly-i-warned-trump-he-would-be-impeached-if-he-hired-a-yes-man-n2555400", "downloaded_at": "2019-10-27 00:01:51.304841+00:00", "title": "John Kelly: I Knew Trump Would Be Impeached If...", "language": "en", "text": "Former White House Chief of Staff John Kelly on Saturday said he privately warned President Donald Trump he would be impeached if he surrounded himself with \"yes men,\" the former White House staffer explained at the the Washington Examiner's Sea Island Summit.\n\n“I said, whatever you do — and we were still in the process of trying to find someone to take my place — I said whatever you do, don’t hire a ‘yes man,’ someone who won’t tell you the truth — don’t do that. Because if you do, I believe you will be impeached,” Kelly explained.\n\nLooking back in retrospect, Kelly said he regrets resigning when he did. He believes that if he would have stayed, Democrats would not have launched an impeachment inquiry into the president.\n\n“That was almost 11 months ago, and I have an awful lot of, to say the least, second thoughts about leaving,” Kelly said, clearly referencing his replacement, Mike Mulvaney. “It pains me to see what’s going on because I believe if I was still there or someone like me was there, he would not be kind of, all over the place.”\n\nAccording to Kelly, the Democrats' impeachment into Trump's call with Ukrainian President Volodymyr Zelensky could have been avoided if someone kept Trump in check.\n\n“Someone has got to be a guide that tells [the president] that you either have the authority or you don’t, or Mr. President, don’t do it,” the former White House official said. “Don’t hire someone that will just nod and say, ‘That’s a great idea Mr. President.’ Because you will be impeached.”\n\n“The system that should be in place, clearly — the system of advising, bringing in experts in, having these discussions with the president so he can make an informed decision, that clearly is not in place. And I feel bad that I left.”", "description": "Yikes..10/26/2019 20:01:32PM EST.", "authors": ["Beth Baumann", "Bronson Stocking"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/116/b354c2a2-3199-43d4-88e4-17413211b524.jpg", "published_at": "2019-10-26"}