{"pub": "npr", "url": "https://npr.org/2019/09/07/758659735/dorians-floodwaters-trapped-hundreds-in-the-outer-banks-until-boat-rescuers-arri", "downloaded_at": "2019-09-08 11:40:49.678162+00:00", "title": "Dorian's Floodwaters Trapped Hundreds In The Outer Banks Until Boat Rescuers Arrived", "language": "en", "text": "Dorian's Floodwaters Trapped Hundreds In The Outer Banks Until Boat Rescuers Arrived\n\nEnlarge this image toggle caption Courtesy of Theresa Ray Courtesy of Theresa Ray\n\nTheresa Ray lives in a small house on 4-foot stilts in the low-lying marshlands of Ocracoke Island, what many consider the gem of North Carolina's Outer Banks.\n\nOn Friday, as she was making ramen noodles in her kitchen, Ray heard what sounded like a fleet of trucks barreling straight toward her.\n\n\"I'm looking out my window and you just see this 3-foot wall of water, and it's only 3 feet, but it still like keeps rushing in more and more,\" she said. \"It keeps coming.\"\n\nIt was Hurricane Dorian making landfall in the Outer Banks, bringing galloping winds that pushed water surging through Ocracoke Island.\n\n\"I got my dog and some jugs of water and some Pop-Tarts and we headed upstairs,\" she said.\n\nRay and hundreds of other islanders were stuck in their attics as several feet of water continually rose.\n\n\"It was like being in Mad Max Beyond Thunderdome mixed with The Wizard of Oz,\" she said. \"I mean, it was just, the noise, the intensity was just outrageous.\"\n\nOn other parts of Ocracoke, longtime residents like Anne Warner, who has become hurricane-hardened after living on the island for 30 years, said the amount of flooding was unlike anything she'd seen before.\n\n\"Suddenly there were whitecaps, waves crashing in the front yard, water in the house, skylight ripped off, rain coming in. It was relentless. It wasn't so much the wind, it was the storm surge,\" Warner said.\n\nAs the storm pummeled the island, Ray, who is a commercial fisherman and volunteer firefighter, called her friend, Jessie Spencer.\n\n\"I called him about 30 times in 20 minutes. I was starting to freak out,\" she said.\n\nWhen she finally got through to him, she begged him to boat over to her place to rescue her.\n\n\"And then sure enough, here comes Jessie,\" she said. \"He was like, 'grab your dog,' and I was like, 'all right,' so we hopped in the boat and when I saw him, when I heard that boat motor, I was very, very grateful,\" Ray said.\n\nEnlarge this image toggle caption Courtesy of Theresa Ray Courtesy of Theresa Ray\n\nThe water has now subsided after swelling to more than 6 feet above ground in some parts of Ocracoke, where the ferry service was not operational because of the storm. And so, the only way to rescue some residents was by boat or helicopter.\n\nRay herself jumped in a boat and saved four stranded islanders after she was rescued. \"Some people were saying they were just lying in their beds, and next thing you know, they are floating around their rooms with them on their beds.\"\n\nNow back at home and assessing the storm's toll, Ray has a busted out wall and other water damage. She said she's going to ask her landlord to elevate the stilts on her home in hopes she will fare better ahead of the next big storm.\n\nAt a briefing on Saturday, North Carolina Gov. Roy Cooper said nobody in the state died in the hurricane.\n\n\"Overall this could have been much worse for our state,\" said Cooper after he toured Ocracoke Island. \"The people who did get flooded, and who did get significant wind damage, this is a bad situation for them,\" Cooper said. \"But in North Carolina, we're gonna pull together. And we're gonna work to begin cleanup. And try to get back to normal as soon as possible.\"\n\nMeanwhile, in Charleston, S.C., workers have been combing across the storm-tossed city and clearing roads of hundreds of fallen trees. Utility company workers pulled long hours trying to keep up with a deluge of calls from residents who had lost power as a result of Dorian.\n\n\"The rural areas were hit very hard,\" said Charlene Green, customer service representative with Dominion Energy. \"One customer told me a tree went through their house,\" she said.\n\nFor Charleston resident Leo Chiagkouris, calling the power company does not help him get through a storm. But something else does.\n\n\"Faith,\" he said. \"And belief in God. And I'm not a holy roller, but I always say my prayers.\"\n\nEnlarge this image toggle caption Bobby Allyn/Bobby Allyn Bobby Allyn/Bobby Allyn\n\nDorian was the fifth hurricane for Chiagkouris, so he knows the drill well: put up some walls, get out the water pumps, get the kids ready, take out the generator.\n\n\"We live in a beautiful area where that's the only drawback,\" he said. \"So we just say, 'OK, come on hurricane, we'll take care of ya.' \"\n\nAs the recovery continues, Charleston Mayor John Tecklenburg said the city is lucky the hurricane was not worse.\n\nHurricane management has in recent years been a major part of his job. And every time, it puts him in the spotlight, not the kind of attention he welcomes.\n\n\"Ya'll seem to come to town only to see the bad news or the bad weather,\" Tecklenburg said. \"And it's such a beautiful, vibrant city, we welcome you back to come in a time when you can just enjoy yourself.\"\n\nBut first, he said, \"we gotta take care of all the downed trees.\"\n\nNPR's Joel Rose contributed to this report.", "description": "One islander who was saved described Dorian this way: \"It was like being in Mad Max Beyond Thunderdome mixed with The Wizard of Oz,\" she said. \"The noise, the intensity was just outrageous.\"", "authors": [], "top_image": "https://media.npr.org/assets/img/2019/09/07/pic3_wide-6076f1088e2fa3b38f82fe41687fc3b7fbe2b0b4.jpg?s=1400", "published_at": "2019-09-07"}