{"pub": "investing.com", "url": "https://za.investing.com/news/stock-market-news/update-1ftse-250-up-ahead-of-brexit-deal-vote-miners-hit-by-dismal-china-gdp-1967744", "downloaded_at": "2019-10-18 08:53:36.746378+00:00", "title": "UPDATE 1-FTSE 250 up ahead of Brexit deal vote; miners hit by dismal China GDP", "language": "en", "text": "© Reuters. UPDATE 1-FTSE 250 up ahead of Brexit deal vote; miners hit by dismal China GDP\n\n* FTSE 100 down 0.3%, FTSE 250 up 0.3%\n\n* China GDP disappoints, Brexit vote on deck\n\n* Unilever , Diageo down after results from French rivals\n\n* IHG slips after quarterly revenue drops\n\n* Elegant Hotels hits >3-yr high on buyout by Marriott (Adds news items, analyst comments, updates share prices)\n\nBy Shashwat Awasthi\n\nOct 18 (Reuters) - London's mid-cap index was higher on Friday ahead of a parliamentary vote on the new Brexit deal, but miners slipped after data showed China's economic growth dropped to a near 30-year low.\n\nThe FTSE 250 , up more than 4% since last week as a flurry of Brexit updates fuelled optimism, added another 0.4% by 0800 GMT. Cybersecurity firm Avast rose 6% after its results and helped the index outperform the European benchmark .\n\nThe FTSE 100 edged 0.1% lower, as Brexit-sensitive stocks such as housebuilder Persimmon and domestic bank RBS rose 3%, respectively, offsetting weakness in miners .\n\nWorries over how the protracted dispute between Washington and Beijing has damaged economic growth were rekindled after China's third-quarter GDP slowed more-than-expected. country is clearly continuing to feel the trade war squeeze, putting all the more pressure on the so-far insubstantial... 'partial trade deal' announced last weekend,\" Spreadex analyst Connor Campbell said.\n\nAt home, traders eyed Saturday's vote on the new Brexit accord between Brussels and London, although analysts warned that progress made so far could be undone if lawmakers vote down the deal and that further volatility was likely.\n\n\"It is by no means guaranteed the necessary votes would be forthcoming at this stage, and it is just as likely it will be defeated, sending us back to Brexit square one,\" said Jeffrey Halley, Senior Market Analyst, Asia Pacific at OANDA.\n\nShares in London Stock Exchange , whose shareholders are due to vote on its purchase of data analytics platform Refinitiv next month, outperformed the main index with a 2.4% rise on higher-than-expected third-quarter income. consumer goods giants Unilever and Diageo lost 1% each after downbeat earnings and forecast from their respective French peers Danone and Remy Cointreau .\n\nThe blue-chips were also hurt by a 2% dip in InterContinental Hotels after the Holiday Inn-owner blamed lower business bookings in China and protests in Hong Kong for a drop in revenue. Elegant Hotels , which operates hotels and restaurants in Barbados, soared almost 56% to hover slightly below the 110 pence per share price offered by Marriott to buy the company.", "description": "UPDATE 1-FTSE 250 up ahead of Brexit deal vote; miners hit by dismal China GDP", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEB1Q06W_L.jpg", "published_at": "2019-10-18"}