{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/public-safety/virginia-man-charged-with-rape-in-montgomery-county/2019/09/03/251b671c-ce87-11e9-a404-e15db72a7921_story.html", "downloaded_at": "2019-09-04 03:45:40.655294+00:00", "title": "Virginia man charged with rape in Montgomery County", "language": "en", "published_at": "2019-09-03", "text": "A ride-share driver was charged with rape in Montgomery County after sexually assaulting a woman and refusing to let her leave his car, officials said Monday.\n\nPolice said the woman was not the man’s customer at the time of the alleged rape.\n\nOn Aug. 24 at around 11:45 p.m., officers responded to the 6900 block of Clarendon Road in Bethesda after a woman was reported crying in the road, Montgomery County Police said in a statement.\n\nThey found a 28-year-old woman who said she was at a bar in Silver Spring when she began to feel nauseous, and a man who was a friend of her friend offered to let her sleep in his Toyota sedan parked outside, the statement said.\n\nThe woman accepted the man’s offer, fell asleep in his car and said she awoke later when he entered the car and raped her, according to the statement.\n\nAfter the rape, the man drove out of the area with the woman still in the car, refusing to let her out, police said. She eventually exited the vehicle on Clarendon Road and screamed for help as the man drove away, according to police.\n\n\n\nOluwakayode Adewole Adebusuyi (Montgomery County Police)\n\nOn Saturday, Oluwakayode Adewole Adebusuyi, 26, of Fairfax was charged with rape, assault and false imprisonment in the incident, police said. He is incarcerated in Fairfax awaiting extradition to Montgomery County.\n\nAdebusuyi worked for ride-share companies in the region, according to police, who asked anyone with additional information about possible victims to contact them at 240-773-5050.\n\nRead more:\n\nLocal newsletters: Local headlines (8 a.m.) | Afternoon Buzz (4 p.m.)\n\nLike PostLocal on Facebook | Follow @postlocal on Twitter | Latest local news", "description": "The suspect sexually assaulted a woman in his vehicle, police said.", "authors": ["Justin Wm. Moyer", "Reporter Covering Breaking News", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/1AuiJyyn_wAKbmcHDPp0KezXaSs=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/P6BP7OVHAII6RLLPBADXBXG5YI.jpg"}