{"pub": "cnbc", "url": "https://cnbc.com/2019/10/08/china-surveillance-firms-defend-themselves-after-us-blacklisting.html", "downloaded_at": "2019-10-08 11:39:08.945508+00:00", "title": "China's surveillance firms defend themselves after US blacklisting and claims of human rights abuses", "language": "en", "text": "Surveillance cameras are mounted on a post as the Hangzhou Hikvision Digital Technology Co. logo is displayed atop the company's headquarters in Hangzhou, China, on Tuesday, May 28, 2019. Hikvision, which is controlled by the Chinese government, is one of the leaders in the market for surveillance technology.\n\nWashington alleged that \"these entities have been implicated in human rights violations and abuses in the implementation of China's campaign of repression, mass arbitrary detention, and high-technology surveillance against Uighurs, Kazakhs, and other members of Muslim minority groups\" in China's Xinjiang region.\n\nThe U.S. will add the Xinjiang Public Security Bureau, and 19 \"subordinate\" institutes to the list as well as some of China's most valuable surveillance AI firms. These include Megvii, SenseTime, Hikvision and IFLYTEK.\n\nJust days before the next round of trade talks between the U.S. and China, Washington put 28 Chinese entities on the government's so-called Entity List , which restricts these organizations from doing business with American firms. It is the same blacklist Chinese smartphone maker Huawei was placed on earlier this year.\n\nSome of China's biggest surveillance and artificial intelligence (AI) firms have defended themselves after being put on a U.S. blacklist and being accused of human rights abuses related to minority Muslims in northwest China.\n\nThe territory has made headlines for its detention and \"re-education\" camps that hold an estimated 1.5 million Muslims, many of them for violating what Amnesty International describes as a \"highly restrictive and discriminatory\" law that China says is designed to combat extremism.\n\nBut the Chinese technology firms have defended their activities.\n\nSenseTime, a company reportedly valued at over $7 billion, is one of China's top AI firms. It also has a number of American investors including Qualcomm Ventures, Silver Lake Partners and Fidelity.\n\nA company spokesperson told CNBC it was \"deeply disappointed\" by the U.S. government's decision to put it on the Entity List.\n\n\"We abide by all relevant laws and regulations of the jurisdictions in which we operate. We have been actively developing our AI code of ethics to ensure our technologies are used in a responsible way. In the meantime we remain focused on protecting the interests of our customers, partners, investors and employees,\" SenseTime said in a statement.\n\nThe company added that it does \"not have any business in, nor are we aware of our technology being used in the Xinjiang region.\"\n\nMegvii is a Chinese firm, well-known for its facial recognition technology and reportedly valued over $4 billion. It counts Alibaba among its high-profile investors and the company is gearing up for an initial public offering.\n\nA spokesperson told CNBC that the company \"strongly objects\" to being placed on the Entity List, adding that it derived no revenue from Xinjiang in the first half of 2019.\n\n\"We are committed to making sure our technology has a positive impact on society and we are in compliance with all laws and regulations in jurisdictions where we operate. We require our clients not to weaponize our technology or solutions or use them for illegal purposes,\" Megvii said in a statement.\n\n\"Any direct business impact from this designation is expected to be minimal. As of now, there are no changes to Megvii's ongoing plans.\"\n\nIFLYTEK is another of China's AI unicorns and sells voice recognition software and translation tools. The company said that the blacklisting \"will not bring significant impact\" on its daily operations.\n\n\"We've been working on plans for this situation and will continue to provide our customers with good products and services,\" IFLYTEK said in a Chinese statement, translated by CNBC.\n\n\"IFLYTEK advocates positive and healthy corporate values, complies with laws and regulations, and our technologies are widely used in social areas such as education and medical care. We will actively appeal to the relevant departments of American government.\"\n\nHikvision, a maker of various surveillance products including cameras, said it \"strongly opposes\" the U.S. government's decision.\n\n\"Hikvision, as the security industry's global leader, respects human rights and takes our responsibility to protect people in the U.S. and the world seriously,\" the company told CNBC in a statement.\n\nCNBC has reached out to IFLYTEK and Hikvision asking them to clarify the extent of their operations, if any, in Xinjiang.\n\n- CNBC's Lilian Wu contributed to this report.", "description": "The U.S. put 28 Chinese entities on the government's so-called Entity List, which restricts these organizations from doing business with American firms.", "authors": ["Arjun Kharpal"], "top_image": "https://image.cnbcfm.com/api/v1/image/106169552-1570527213723gettyimages-1147205602.jpeg?v=1570527292", "published_at": "2019-10-08"}