{"pub": "foxnews", "title": "New Zealand banning tourists from swimming with dolphins, claims visitors are 'loving them too much'", "url": "https://foxnews.com/travel/new-zealand-banning-tourists-swimming-dolphins", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:02:00.878319+00:00", "text": "Humans have bonded with dolphins in many fascinating — and sometimes controversial — ways, but conservationists say our curiosity for the highly intelligent marine mammal is putting them at serious risk.\n\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\nThat’s why New Zealand officials are banning tourism services that offer swims with dolphins, saying tourists are “loving them too much.”\n\nThe Bay of Islands region — off the western coast of the country’s north island — has suffered a 66% decline in their bottle-nose dolphin population and a 65% increase in calf mortality rate, according to New Zealand’s Department of Conservation.\n\nAt this point, only 19 bottle-nose dolphins are now regularly visiting the region.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nEnvironmental authorities say they are shutting down all tourist-dolphin swimming operations in the region for three years, and restricting boat tours for dolphin watching to morning and early afternoon only — for just 20 minutes per trip, down from half an hour.\n\n“Research shows that interactions with the bottle-nose dolphins is having a significant impact on the populations resting and feeding behavior and that people are ‘loving the dolphins too much,'” a spokesperson told Euronews in a statement.\n\nWhile conservationists did not elaborate on how people are “loving” them, their statement suggests that human presence may be scaring dolphins away from the islands, and disrupting their natural activity.\n\nAs these new regulations only cover commercial tourism, the government is also considering turning the Bay of Islands into a marine mammal sanctuary to also prevent private boats from disturbing the few dolphins left.\n\nFOLLOW US ON FACEBOOK FOR MORE FOX LIFESTYLE NEWS\n\n“The Bay of Islands bottle-nose dolphin population can only be protected if everyone plays their part,” the statement read.\n\nNew Zealand isn’t the only tourist hub putting the squeeze on dolphin swimming. Hawaii has also considered plans to ban the practice over concerns for their rare spinner dolphin populations, blaming tourists for interrupting their mating patterns.\n\nThis article originally appeared on the New York Post.", "description": "Conservationists say our curiosity for the highly intelligent marine mammal is putting them at serious risk.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/02/Dolphin-Calf.jpg"}