{"pub": "breitbart", "url": "https://breitbart.com/2020-election/2019/10/27/julian-castro-leaves-trump-out-of-congratulations-for-raid-on-isis-leader-al-baghdadi", "downloaded_at": "2019-10-28 00:31:09.351791+00:00", "title": "Julian Castro Leaves Trump out of Congratulations for Raid on ISIS Leader Al-Baghdadi", "language": "en", "text": "Former Housing and Urban Development Secretary Julián Castro left President Donald Trump out of his congratulatory statement upon news Sunday that U.S. forces had killed Abu Bakr al-Baghdadi, the leader of the so-called “Islamic State,” or ISIS.\n\nCastro joined former Vice President Joe Biden and Sen. Bernie Sanders (I-VT) in pointedly excluding Trump:\n\nA ruthless murderer has been brought to justice. I’m grateful to our military and intelligence community. Their courage and dedication inspire us all. Abandoning our Syrian and Kurdish partners remains a disastrous decision that will make the fight against ISIS harder. — Julián Castro (@JulianCastro) October 27, 2019\n\nI congratulate our special forces, our intelligence community, and all our brave military professionals on delivering justice to the terrorist Abu Bakr al-Baghdadi. The world is better and safer without him in it. pic.twitter.com/miLSVWBT9l — Joe Biden (@JoeBiden) October 27, 2019\n\nAbu Bakr al Baghdadi was a murderer and terrorist responsible for terrible suffering and death. The fight against ISIS would not be possible without the brave efforts of the Kurds and other U.S. allies. — Bernie Sanders (@SenSanders) October 27, 2019\n\nBoth Biden and Castro used their statements to criticize President Trump’s recent decision to withdraw U.S. troops from the Turkey-Syria border, and from Syria more generally. Castro’s language was even more passive.\n\nOther candidates were slow to acknowledge the successful raid, in which no American soldiers were killed or injured, aside from a K-9 dog involved in the operation.\n\nTrump told reporters that he had excluded certain congressional leaders from being briefed in advance of the raid for fear that leaks in Washington might tip off the terrorists, endanger U.S. forces, and undermine the success of the operation.\n\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.", "description": "Like Joe Biden, Julián Castro left left President Donald Trump out of his congratulatory statement for the successful raid on al-Baghdadi.", "authors": ["Joel B. Pollak"], "top_image": "https://media.breitbart.com/media/2019/10/julian-castro-squint-getty-640x335.jpg", "published_at": "2019-10-27"}