{"pub": "businessinsider", "url": "https://businessinsider.sg/databricks-appoints-dave-conte-as-chief-financial-officer", "downloaded_at": "2019-10-23 10:03:19.631912+00:00", "title": "Databricks Appoints Dave Conte as Chief Financial Officer", "language": "en", "text": "Former Splunk Executive Brings 30+ Years’ Experience to Unified Data Analytics Market Leader\n\nSYDNEY, AUSTRALIA – Media OutReach – October 23, 2019 – Databricks, the leader in unified data analytics, today announced the appointment of Dave Conte as Chief Financial Officer, effective immediately. In his role, Conte will report directly to co-founder and Chief Executive Officer Ali Ghodsi and lead all of the financial and operational functions at the company. Conte brings extensive experience most recently from Splunk and Opsware after starting his career at Ernst & Young.\n\n\n\n\n\n“We’re honored to have Dave join the leadership team. His experience leading and scaling global financial and operational functions at high-growth enterprise software companies is impressive,” Ghodsi said. “Dave brings a breadth of knowledge and proven track record to support our continued growth.”\n\nConte has 30 years of finance and administration experience in multi-national public and private companies within the technology industry. Conte was Splunk’s CFO for the last eight years, where he took the company public and helped it grow from $100 million in annual revenue to more than $2 billion annually as the market leader in operational intelligence and security information management. Prior to Splunk, he was the CFO at Opsware, an IT automation software company that was acquired by HP for $1.65 billion. Conte has also served as a member of the board of directors at Anaplan since 2016.\n\nDatabricks has grown annual recurring revenue (ARR) well over 2.5x over the past year and has gone from almost no revenue to a $200 million revenue run rate in less than four years. The company has thousands of customers and is valued at $6.2 billion.\n\n“I’m honored to join such a high caliber team that has driven really impressive growth,” said Conte. “Enterprises continue to seek solutions that enable data-driven decision making and Databricks is well positioned to support organizations in their data journey. I look forward to adding my experience to the team and contributing to the company’s continued growth.”", "description": "Business Insider - Former Splunk Executive Brings 30+ Years’ Experience to Unified Data Analytics Market Leader SYDNEY, AUSTRALIA - Media OutReach - October 23, 2019 - Databricks, the leader in unified data analytics, today announced the…. Read more at businessinsider.sg", "authors": ["Media Outreach"], "top_image": "https://static.businessinsider.sg/sites/2/2017/11/logo.jpg", "published_at": "2019-10-22"}