{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/09/six-deals-you-need-to-know-about-in-australia-today-212", "downloaded_at": "2019-09-16 02:16:56.756904+00:00", "title": "Six Deals You Need To Know About In Australia Today", "language": "en", "text": "Image: Supplied\n\nG'day! Here are some cracking online deals for Lifehacker readers, including: $7 fitness trackers from Catch, 22% off Aberlour Scotch whisky, save over $1000 on Bang & Olufsen A9 speakers and more!\n\n1. $1011 off Bang & Olufsen A9 speakers: Amazon has knocked 27% off Bang & Olufsen's ultra-deluxe Beoplay A9 Wireless Speakers - a saving of over $1000! If that's still a bit exy, you can also grab 40% off Soniq's Delta speaker range with prices starting at just $99. Click here!\n\n2. Catch '$7 & Under' sale: Sometimes you just want to snap up a bargain without spending much of anything. Daily deals site Catch has you covered with hundreds of products slashed to $7 and under. It's not all crap either, with torches, batteries, PowerCubes, fitness tracker and other tech goodies in the mix. Save up to 80%! Click here.\n\n3. Up to 50% off big-brand headphones: In addition to the above, Catch is also having a big clearance sale on popular headphones. Participating brands include Apple, Audio-Technica, Bang & Olufsen, Beats, JBL, Sennheiser, Sony and heaps more. Score up to 50% off! Click here!\n\n4. 20% off tech at eBay: eBay is having another tech sale with 20% off select laptops, cameras, TVs, drones, external storage and PC components. To get the deals, use the discount code 'PLAN20' at checkout. Click here to see the deals!\n\n5. Cheap whisky: First Choice Liquor's eBay store is selling 700mL bottles of Aberlour 12YO Scotch Whisky for $76.50 - that's a tasty 22% off the RRP. Click here!\n\n6. Cheap NBN plans: Aussie Broadband is bringing back one of its best NBN deals, with contract-free, unlimited data plans starting at $69. All plans are contract free and there are no set-up fees. Here are the inclusions:\n\nNBN 25 / Everyday Plan (Unlimited Data, $69 per month)\n\nNBN 50 / Family Plan (Unlimited Data, $79 per month)\n\nNBN 100 / Power User Plan (Unlimited Data, $99 per month)\n\nFind more great bargains at Lifehacker Coupons.\n\nAs Lifehacker editors we write about stuff we like and think you'll like too. Lifehacker often has affiliate partnerships, so we may get a share of the revenue from your purchase.", "description": "G'day! Here are some cracking online deals for Lifehacker readers, including: $7 fitness trackers from Catch, 22% off Aberlour Scotch whisky, save over $1000 on Bang & Olufsen A9 speakers and more!...", "authors": ["Aimée Lutkin", "Anthony Caruana"], "top_image": "https://edge.alluremedia.com.au/m/l/2019/09/Beoplay-A9.jpg", "published_at": "2019-09-16"}