{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/kids-feel-poor-if-they-dont-buy-custom-fortnite-skins-2019-10", "downloaded_at": "2019-10-22 15:14:26.117539+00:00", "title": "Kids who play Fortnite say they get bullied and shamed if they can't afford paid skins, according to a damning report on gaming habits", "language": "en", "text": "Children who play the hit game Fortnite say that paid skins are a major status symbol inside the game, and that they are scorned and seen as \"poor\" if they stick to the free, default skin, according to a report by the Children's Commission, a public body in the UK.\n\nFortnite is free to play, but people can buy equipment and costumes for their in-game avatars to wear during battles, known as skins. Buying skins isn't compulsory, but it can show players have money to splash on their character.\n\nOne child is quoted in the report as saying people who stick to the free, default skin are seen as \"trash.\"\n\nFortnite is estimated to have 250 million players globally.\n\nVisit Business Insider's homepage for more stories.\n\nKids who play the massively popular free game Fortnite say that paid skins are a major status symbol, and that they get \"scorned\" and feel \"poor\" if they stick with the default free skin.\n\nThat's according to a wide-ranging study into the preferences and experiences of British children who play video games by the Children's Commission, a non-government public body focused on kids' wellbeing in the UK. The report was released on Tuesday.\n\nThe researchers behind the UK study spoke to twenty-nine children aged between 10 and 16 who play video games.\n\nOne 10-year-old girl is quoted in the report as saying: \"If you're a default skin, people think you're trash.\"\n\nAnother is quoted as saying: \"Sometimes if you are wearing the default skin you can get bullied.\"\n\nFortnite is a wildly popular online shooter in which players battle on a large, multi-terrained island to remain the last one standing. As of March 2019, 250 million people are thought to play Fortnite worldwide.\n\nThe game, created by Epic, is free to play but players can purchase stylized weapons and outfits for their in-game avatars, known as skins. These paid skins aren't compulsory for people to progress in the game, but they do distinguish players from the default \"look\" in Fortnite and show that you have money to spend. Paid skins are often themed, with Fortnite introducing a Batman-themed skin last month.\n\nFortnite's Batman-themed skins. \"Fortnite\"/Epic Games\n\nThe skins cost around $20 to buy. Players first have to buy Fortnite's in-game currency, \"V-Bucks\", in order to then purchase skins. Business Insider reported last December that teens were putting V-Bucks top of their Christmas gift wishlists.\n\nFortnite's maker Epic declined to comment.\n\nThe researchers behind Tuesday's report didn't just focus on Fortnite, but looked into a range of popular games including Call of Duty and FIFA. They found children sometimes felt bullied while gaming, subjected to aggressive behaviour, and at risk of scams or deceptions.\n\nRead more: Apple and Google are going to war over the future of gaming as the entire industry goes through a radical transformation\n\nThe report also focused on elements in video games that could be construed as gambling, saying that kids needed protection around mechanisms that involve spending money in-game.\n\nLoot boxes in games like Overwatch were banned in Belgium in 2018. \"Overwatch\"/Blizzard Entertainment\n\nThe study points to wider, ongoing concerns in the UK and farther afield around the potential impact of video games on children.\n\nIn September, UK lawmakers said that \"loot boxes\" – a form of randomized transaction found in popular games such as \"Overwatch\" and \"Apex Legends\" – should carry a gambling warning and video game companies should take more responsibility for players' health.\n\nLast year, the Belgian government went one step further, banning loot boxes in video games entirely on the grounds they constitute gambling.\n\nOn the positive side, the study identified a number of social and psychological benefits felt by children who play video games. Notably, it concluded that gaming is \"a digital extension of play,\" allowing children to spend free time with their friends and develop relationships, while also building strategic, teamwork and creative skills.", "description": "A study into British children's gaming preferences claims children feel 'scorned' if their 'Fortnite' in-game avatars wear the game's 'default' skins.", "authors": ["Charlie Wood"], "top_image": "https://image.businessinsider.com/5daee0e04af9094ecf399777?width=1200&format=jpeg", "published_at": "2019-10-22"}