{"pub": "reuters", "url": "https://reuters.com/article/us-usa-fed-powell/powell-feds-significant-political-protection-makes-public-outreach-an-obligation-idUSKBN1WO20T", "downloaded_at": "2019-10-09 18:38:50.668563+00:00", "title": "Powell: Fed's 'significant' political protection makes public outreach an 'obligation'", "language": "en", "text": "FILE PHOTO: Federal Reserve Chairman Jerome Powell holds a news conference following a closed two-day Federal Open Market Committee meeting in Washington, U.S., September 18, 2019. REUTERS/Sarah Silbiger\n\nKANSAS CITY, Mo. (Reuters) - The “significant” protection the U.S. Federal Reserve has from short-term political pressures also gives it an obligation to “clearly explain” monetary policy, Federal Reserve chairman Jerome Powell said on Wednesday.\n\n“Because Congress has granted the Federal Reserve significant protections from short-term political pressures, we have an obligation to clearly explain what we are doing and why. And we have an obligation to actively engage the people we serve so that they and their elected representatives can hold us accountable,” Powell said.\n\nSpeaking at a community listening event, Powell tied the Fed’s year-long series of such events to its standing as a politically independent organization - a status it has fought to ensure in the face of steady criticism from President Donald Trump. The ability to make interest rate decisions free from how that may impact a political leaders’ poll standings is considered important for effective central banking.\n\nThe guards against political pressure on the Fed include 14-year terms for members of its Washington-based Board of Governors, which means in theory that only a two-term president can appoint a majority of board members. It also includes protections for the Fed chair, who, once appointed by a president and confirmed by the Senate, cannot be removed over disagreements about policy.\n\nPowell was appointed by Trump and took office for a four- year term in early 2018.\n\nPowell has not taken the Fed’s independent status for granted, however, and has kept both a steady presence on Capitol Hill in meetings with members of Congress, and boosted the Fed’s public presence through events like the one in Kansas City. It is the 13th “Fed Listens” event the Fed has held this year, where regional bank presidents and visiting board members have heard from businesses and community groups about how they see the local economy and the Fed’s impact on it.\n\nPowell repeated in brief opening remarks that the economy was “in a good place,” but told the group of business people and community group representatives here that the Fed’s job “is to keep it there as long as possible.”", "description": "The \"significant\" protection the U.S. Federal Reserve has from short-term political pressures also gives it an obligation to \"clearly explain\" monetary policy, Federal Reserve chairman Jerome Powell said on Wednesday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191009&t=2&i=1438887150&w=1200&r=LYNXMPEF981IB", "published_at": "2019-10-09"}