{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/the-wicked-the-divines-creators-look-back-at-5-years-of-excellence-and-exhaustion", "downloaded_at": "2019-09-11 14:08:52.995700+00:00", "title": "The Wicked & The Divine's Creators Look Back At 5 Years Of Excellence And Exhaustion", "language": "en", "text": "Characters from The Wicked & The Divine react to one of Kieron Gillen’s infamous puns. (Image: Jamie McKelvie, Matt Wilson, Image Comics)\n\nOne of the best comics series in the last decade came to an end last week. As you’d expect, writer Kieron Gillen and artist Jamie McKelvie have a lot of thoughts about saying goodbye to The Wicked & The Divine.\n\nWay back in January 2014, hot off a well-regarded Young Avengers run, Gillen and McKelvie announced they’d be reuniting with colorist Matt Wilson on an all-new title: The Wicked + The Divine, a killer contemporary fantasy about the pop-punk world of reincarnated gods doomed to a ticking timebomb of fate.\n\nThe creative core of Gillen/McKelvie/Wilson was joined by letterer Clayton Cowles and editor Chrissy Williams when the series launched in June 2014. Garnering praise, awards, and a cohort of devoted fans along the way, The Wicked & The Divine became that rarest of things: an end-to-end longform work that kept its creative team together for the whole endeavour.\n\nMain character Laura, as she appeared on the cover for The Wicked & The Divine #1. (Image: Jamie McKelvie, Matt Wilson, Image Comics)\n\nAs Gillen and McKelvie told me on the phone last week, the journey has been a deeply personal experience for all involved. (Matt Wilson was kind enough to answer questions over email.) The three creators spoke about the nuts and bolts of their long collaboration and detailed the hopes, fears, and changes they’ve undergone over the WicDiv cycle.\n\nNarcisse: When The Wicked and The Divine started, you two were coming off Young Avengers. Did you have specific goals for The Wicked + The Divine at the outset of the series? You’d worked together before, obviously.\n\nDid you want to differentiate it from Phongoram or Young Avengers in a specific way? Was there a certain feeling you were trying to capture? Or did you just want to do a cool story about sexy people who dress well?\n\nKieron Gillen: Do you want to go first on your artistic goals, Jamie? Because you know me, when I start talking about this, it’s usually 40 minutes.\n\nJamie McKelvie: I mean, one thing we both wanted to do was to create something that encompassed everything that we love. And so, that includes all the superhero stuff and the Phonogram stuff, and everything from comics and music and film and TV and everything that was a statement about us, in that respect.\n\nThe other thing we really wanted to do was sustain a big book for several years. We were aware it’s very rare for a team to do. There’s like, Saga and Walking Dead and other things but, generally speaking, there’s not many of them. Even on something like Sandman, there were a bunch of different artists involved. And we wanted this to be our signature book. We did it — nine volumes, as it turns out — and so that was great.\n\nMatt Wilson: The only goal from the outset, that I can recall, was that we had just got done doing a year of superhero comics together and that Kieron and Jamie wanted our gods’ powers to look different than the normal superhero powers that you might see in a mainstream comic book. So, that was my one overarching mandate for the colours.\n\nThe colours for the powers had to be inventive, and reflect elements associated with the nature of that god, as well as the kind of pop star each particular character was. Then that rule dictated what I did with most of the rest of the colours in the book.\n\nI was really conscious of when and where the god’s powers and performances showed up in an issue, and then I made sure to construct all the palettes around those powers with maximum visual impact in mind. So, if I knew Luci’s red fire was coming up, I’d be sure to keep away from reds before, and be sure that most colours were pretty muted. Then when you turn a page and her powers are in full force, the contrast between hues and saturations made the powers seem that much more vibrant.\n\nGillen: On the one hand, there’s the artistic goals, “What does the book do?” And then there’s actually the creator goals, which are what you want from it yourself. I wanted to have a big, signature work that actually sold [well]. Of all my hero figures, most of them are writers, people like the 90s Vertigo crowd, and only some of them have that.\n\nI was thinking that I don’t have what [Garth] Ennis has [with Preacher], a big work you can put in the middle of my name. “Kieron ‘The Wicked & The Divine’ Gillen.” I wanted that by the time I was 40.\n\nI was like, “No, I want to take a big swing at something.” And so WicDiv was that. For the first time in our career, we knew we had some audience attention so we have a chance. If you launch at a certain number, it’s possible to work out where you’ll roughly be at by issue 40.\n\nThat’s how sales works. We knew it was a once-in-a-career chance. So we were definitely aiming big. I said to Jamie, “Let’s pour everything we love into it.” And for me, I was like five years older than Jamie and I was explicitly setting fire to my youth. “I’m 38. By the time this is over I’ll be 43.”\n\n“We’re all going to die. We’re all going to die. We’re all going to die. But not yet.” (Image: Jamie McKelvie, Matt Wilson, Clayton Cowles, Image Comics)\n\nNarcisse: Were you thinking about getting ready for a midlife crisis, then?\n\nGillen: Kind of? It’s about me turning 40 and thinking about me being dead. What if my youth wasn’t definitely over now? What mistakes did I make? I was here, these were the mistakes I made. Please, don’t do that. Make different mistakes. That was the intellectual part. But, as far as goals, I knew the final panel from the start. The last issue, I knew what happened to most of the characters. That large-scale structure, I knew. So, the idea was, “This is how we see a 50-issue series working.” I’ve studied the other ones. And I was like, “We can do this.”\n\nGillen, McKelvie, and Wilson first teamed up on Young Avengers in 2013. (Image: Jamie McKelvie, Matt Wilson, Marvel Comics)\n\nWith Young Avengers, we’d always have, like, things that were a commentary on comics, that standout page when, you know, we just went for it? So it was a bit like “OK, what can you do with an ongoing series?” It was like, “Do you remember that issue when this Bat-comic did this?” And we did a lot of that. Yeah, we’ve got an audience. Part of the experiment is being playful. If we do an entire issue as a magazine or that’s cut up from another issue, we can do that. Partially because we want to excite the readers, and partially to show it can be done.\n\nThere’s so much about WicDiv that’s about breaking out of systems and forced limitations. The invisible cages around you. Not that I’m saying invisible cages aren’t real. Some limitations are self-imposed. And as a creator, you’re doing a monthly comic, you can go for it. And telling others, “you can do it, too, if you want to.” So that was the expected goal, I guess. And that’s it. I had to get over my sorry arse. I was in a really bad place in 2013-2014. Trying to work out my relationship to death and sexuality, and lots of other things. It was kind of like, “Come on, Kieron, let’s pull it together.”\n\nNarcisse: Do you feel like you did?\n\nGillen: I don’t. I think I’m in a better place than I was then. It’s always a process. I’m thinking about the place I was then, and I fuck up all the time. But, I think — I’m not at peace or anything like that, but I’m definitely in a better place. To some degree, it’s quite worked.\n\nNarcisse: You did a magical working. That’s my Grant Morrison reference for the day. So, it’s funny, you were talking about the explicit goals in terms of career and the awareness that you had an audience coming off this. One thing I always admired was you guys were very transparent if something was going to be late, or taking extra time. Tell me about your engagement with the audience and how that informed the work as it went on.\n\nMcKelvie: We’ve always acknowledged them. I think it’s a mistake to sort of, like, change what you’re doing because of your audience, necessarily. Like, nobody got that last issue. I have to tweak a line to make it clearer. The internet is great for that kind of feedback. But yeah...we set up the hashtag early on. We seeded a lot of stuff like that, knowing that would be a space for readers.\n\nGillen: It wasn’t like Phonogram. Phonogram is explicitly about us as fanzine kids. So it’s very much like trying to remove the stage, and say “we’re all in this together.” With this, we tried to be respectful of fan spaces, whilst encouraging fan spaces to fall. We wanted to encourage discussion and a lot of it was about reading. I don’t want to say, “It teaches you how to read.” But it’s explicitly asking you, “What did you just read?” And then when you re-read it, you see something else. So that was such a big part of the book. And also trusting the readers to make sense of it.\n\nMcKelvie: Like Kieron said, we wanted a little bit of distance. We didn’t delve into the conversations, unless it was specifically addressed to us. I think that can get a bit unhealthy. So, it was great seeing the fan community coming up around it, and doing that interpretive stuff on their own.\n\nGillen: We definitely encouraged people to throw down with it, a bit. The thing about WicDiv is that it says you can be a creator. I was inspired by my dad’s terminal diagnosis. My thing is, “OK, you’ve got two years to live. Why be an artist?” And that’s true if you’ve got 10 years, or 70 years. That I’m still doing it implies I must have some reason.\n\nSo it’s like showing the ups and downsides and the stakes. But also like, “You know, you can do this...” If you think you have something you want to do, it’s an option. And one which I find has been incredibly rewarding, for me. It’s the double thing of WicDiv: encouraging you to think of yourself as a god and then going “you know that’s bullshit, right?” That, in a way, is a process, for me. Some people, it will be a process for them, as well. And hopefully, become useful for them.\n\nSuper-fan Laura meets uptight documentarian Cassandra in issue #2. (Image: Jamie McKelvie, Matt Wilson, Clayton Cowles, Image Comics)\n\nOne of the best things about Phonogram was when people told me they’d go into a club and hear a record and think about it in phonomantic terms. What’s the spell here? What’s the effect? And WicDiv works a bit like that. It asks people, ‘if you can think about doing creative stuff, what’s your relationship with the text?’\n\nSo, for example, we made t-shirts that a fan wore in the comic. So you could cosplay as a fan in the comic you’ve read, to show that you’re a fan of the comic you’ve read. That kind of pretentious bullshit. Most of the readers seem to find that funny, so they’re in on the joke. We tried to encourage a fanbase I want to be part of. Dance parties. You see it in the writer’s notes.\n\nPart of it is that I just can’t stop writing but a lot of it is wanting to show craft decisions, like a director’s commentary. A lot of it is guided by what would I like me to do, if I were the reader. You know? What’s keeping the boundaries up?\n\nNarcisse: The way we think about music and commercial art has changed since this series started. Nowadays, Missy Elliot will drop an album totally unannounced and it explodes all over the internet. Was anchoring the beginning the series in the past a way of proofing it against feeling anachronistic?\n\nGillen: Good question. We set it quite close to the moment it came out, didn’t we? There’s a take you shouldn’t ground your work in a period, specifically. People always say we try to be very hip in our comics, and that’s not true, we always did period comics. Phonogram is specifically one night in 1996. And everything is about that night. I think all art is fixed in the period it’s made, full stop. If you try to avoid dating it, you date it anyway. So we kind of explicitly say something in the moment, and if a record — say, ‘67, ‘77, ‘87 — speaks to that moment, it’s still accurate and speaks its truth.\n\nMcKelvie: I totally agree with that. If you try and future-proof something or make it timeless, you just end up making it feel like almost nothing. So, I think that’s the wrong way to look at it, really. Everything just naturally dates, but that doesn’t mean it’s going to date badly.\n\nBaal hid a deep reservoir of kindness underneath all his ego and charm. (Image: Jamie McKelvie, Matt Wilson, Clayton Cowles, Image Comics)\n\nGillen: Some stuff dates badly then becomes really cool again. People were down on the Tangerine Dream soundtracks in the early 80s. They’re great now. In the 90s, there was a thing shitty Britpop bands did of hauling out orchestras to try to make their standards sound a bit better, but it always sounds like the same orchestra and nothing sounds more 90s to me than these jobbing cello players.\n\nNarcisse: Speaking of being rooted to a particular time, let’s discuss the overall plot of the whole series. Up until the present day, Ananke has centuries of success in maintaining her immortality. Yet, in the end, it feels like Ananke wasn’t able to succeed with her master plan in this cycle, at least in part, because of the advance of technology. Was this a plot element from the start?\n\nMcKelvie: Very deliberate.\n\nGillen: WicDiv, yes, it’s about cycles. People always say that nothing really changes but, at the same time, everything’s always changing. Both these things are true. And that’s the idea of having [the reincarnation cycle] be 90 years: Oh yeah, this is exactly the same sort of song. But it’s always a different song, and different people and they’re singing it in different ways. So that was always in there.\n\nBut it was always like, “OK, if you were genuinely Ananke, what’s the problem?” So we’ve already said, [up to a certain point in history] the performances don’t get recorded. So, in the 1920s cycle, she sort of got away with it. They’d still be kind of mystical to the average person. Now it’s like, no. Everyone records and shares everything about their lives.\n\nSo, Ananke is a bit freaking out, hoping to dial it back to the Stone Age, maybe. She’s very comfortable with the Bronze Age. In issue 36, we go back to her native time period and then move forward. The question was, “OK, how does someone who does this every 90 years change their style?” Well, they try different things. What if Ananke did this? Usually, the answer is she tried it once, it didn’t work.\n\nAnd there’s a wonderful bit Jamie nailed where she gets sloppy circa 729 A.D. Jamie starts drawing her, like, not even aiming correctly. And then you hit a panel where she just fucks up entirely, rolling onto the floor. This is buried in the stories.\n\nThat’s one of the reasons Ananke starts letting technology happen again. She kind of wants the world to change more than it has been. Like the Dark Ages to her are “I know the story of friends throwing bricks at me.” She’s a bit bored in that period. So, it was all about imagining her thinking across a long period of time with an intelligence that’s very perceptive.\n\nAnanke doing the thing she does, over and over through the centuries. (Image: Jamie McKelvie, Matt Wilson, Clayton Cowles, Image Comics)\n\nNarcisse: It felt like the 1920s cycle was the closest thematic analogue to the 2015 incarnation of the gods, despite the differences in structure and form of the one-shot. Was that something you intended going in? And, for you, Jamie, what was it like to be hands off in terms of actually drawing an issue like that and what kind of input did you offer?\n\nMcKelvie: I mean, I did all the character designs. But beyond that, generally speaking, I sort of sat back a bit and let other artists like Aud [Koch] do their thing, you know? I was just trying to recover for the next arc, basically. In fact, a lot of the time, we gave the guest artists more time so they’d be working on it while I was working on the last couple issues of the previous arc.\n\nSo, often there wasn’t time for me to do anything. But I wouldn’t want to anyway. I think the whole point of [those issues] was giving a platform for people we thought should have it. It wouldn’t really be in keeping with that to stick my nose in all the time. Yeah, but beyond just character design, from the beginning, I was only aware of the first four who appeared in the opening shot. The rest of those characters, the designs came for them along the time of the special.\n\nThe gods of the early 20th Century, from the Wicked & The Divine 1923 one-shot (Image: Aud Koch, Clayton Cowles, Image Comics)\n\nGillen: When I started planning it, I thought there’d be more similarities between the generations than there ended up being. So the 1920s gods you see at the beginning, they were similar to the modern-day ones. As I continued digging and researching, I wanted it to speak more to the time they’re in because that would speak more to our themes.\n\nSo, there’s a bit of an anchor in the 1923 cycle, just as that was the first to have solidified properly in my head. All the specials are just showcases for the gods. We had a whole pantheon in the 1923 one-shot, so you can’t really do it in one issue. There’s basically four issues worth of content in that one issue, just in more condensed form.\n\nNarcisse: So you knew about this specific 1920s pantheon before you knew what you were going to do in the Dark Ages? And then you kind of jumped around history?\n\nGillen: Yes, I knew what Ananke was doing in that first scene. That original scene, we come back to in issue 35, if you read those pages. Jamie started changing so much at the time, he had to re-ink them. He didn’t have to, he’s just a perfectionist.\n\nMcKelvie: [chuckles] I wasn’t going to let that happen.\n\nThe gods of the early 20th Century, as they appeared in the main WicDiv series. (Image: Jamie McKelvie, Matt Wilson, Clayton Cowles, Image Comics)\n\nGillen: I knew they had to be tricked into doing this thing. The ending of the 1920s cycle, I knew well. Some of the details I didn’t know but I knew it was in a Great Gatsby-esque mansion. I had an idea where they thought they were going to stop World War II. So, it was kind of broad shapes. I had it in my head that I could do a story that feels like this.\n\nThe process, like I said, was the idea for a story and then I researched it to death. “What’s actually really happening in this period?” “Does this fit the story?” “Or is my story nonsense?” For the Rome story, I researched the entire history of Rome. My initial interest was actually one of the falls of Rome and that is what I did in the end. I researched the entire history and realised that if you do a fall, you have to talk about the entire society up to that point. And of course “fall” in quotation marks because Rome didn’t fall the way we often think of it.\n\nSpeaking of falls... Lucifer falls into godhood. (Image: Jamie McKelvie, Matt Wilson, Clayton Cowles, Image Comics)\n\nNarcisse: On the topic of falls, was there a specific point you thought might lose readers?\n\nMcKelvie: Issue 11. Losing Laura for six issues.\n\nGillen: Remember what you said to me when issue one dropped?\n\nMcKelvie: “Are you worried we’re killing off everyone’s favourite character so early on?” And Kieron was like, “Yes, yes I am.”\n\nGillen: All the way through. There’s so many places we could have lost them. What was the point you thought, “if you’ve come with us this far, you’re probably onboard for the rest of it?” Imperial Phase, maybe?\n\nMcKelvie: Yeah, that was like, double-length. And Laura’s dealing with a lot of stuff and not necessarily being the main character. There were just a lot of things, that, if we hadn’t built up the good will of the audience, I’m not sure if we would have kept them. I don’t know. But we had built that up, and everyone seemed to go along with it. Most people, anyway.\n\nGillen: We definitely lost some people. But they mostly gave us a long leash. The Tara issue for example, which was probably the most important in the entire series. It also showed we knew what we were doing.\n\nBy which I mean, when we talked about Tara all along, we paid it off in the end. We wanted people to know we weren’t just making this shit up. We tried to signal it all the way though. Here’s the pay-off, and if you re-read it, you can see the set up. That means, hopefully, when people reach the end, they’ll know we’re doing stuff for a reason.\n\nIt might not be a good reason, but a reason. I think we started losing people in the final year because it was just so complicated. If you genuinely absorbed everything and tried to keep it in your head, you’re fine. And if you re-read it straight through, and take it slowly, you’re fine.\n\nBut on that month-to-month basis, there’s a lot to really remember. That’s why we spent a lot of time trying to remind people of shit. But at the same time, it’s a really complicated work.\n\nNarcisse: Speaking of complications — Ananke’s rules of the reincarnation game were game-like, or like a riddle. How often did you all go over that? It feels like the kind of thing you’d have to game-test.\n\nGillen: When did Chrissy say she finally understood what happened to Minerva? I think it was only in issue #42. “I finally understand it,” vocally. “Thank god it finally came together.” Which is, of course, the issue that’s supposed to explain it properly.\n\nThere’s definitely some bits where I had to — you know, you got a word wrong, or something. And now, 10 issues later, I’ve got to make sure that makes sense. But there’s definitely a kind of, like, poetic nature of it. There’s a lot about how these stories are stories.\n\nAnd it’s kind of about the symbolism — not like Die, which is really like BASIC. “10: Print “My name is Ananke, 20: Print…” It’s much more like poetry and art. so we do have a little leeway.\n\nAs long as it makes sense, we’re fine. But, if I actually made the hard rules at the start, I might have hemmed us in too much. Die is a bit more mechanical, this is very much like — “We’re feeling out these characters, it’s got to dovetail with Baal and everybody else.” So it’s a mix between, “we need hard rules, we still need a little bit of give.”\n\nNarcisse: It’s funny you mention Chrissy Williams, the series editor. It occured to me that she’s probably the unsung hero in this whole project.\n\nGillen: I sing about her all the time!\n\nNarcisse: Has she ever given you feedback that’s changed the course of an arc?\n\nGillen: The way Chrissy tends to define it, she thinks her job is to get the stuff in my head out of my head. Stuff which I, obviously, think makes perfect sense; she’s like, “I have no idea what you’re talking about.”\n\nAnd Jamie, if he thinks something is wrong, he says and I change it. Because I always agree with Jamie. I’m aware when I’m working at velocity things don’t always line up. A classic example is the Inanna one, where he’s smoking in an issue and Jamie’s like...\n\nMcKelvie: Yeah, I was just thinking, like, we shouldn’t have him smoking. I don’t want to glamorize it. It makes sense for Lucifer to smoke. It didn’t make any sense for Inanna to smoke.\n\nGillen: And the only reason I did it was Laura was outside having a cigarette, and she has to get rid of it and I’m like, “She’ll probably have to pass it to Inanna.” She’s only just lit it. I wasn’t making a meaningful character choice for Inanna, I was just thinking about hands. And then Jamie said, “She’d just throw it away.”\n\nBut with Chrissy, it’s less about the major plot structure and much more about close reading. What we do is get the script and we argue. And then when the script is lettered, we argue again. Very specifically, like, “What about this line? Does this carry meaning?”\n\nShe’s a poet, so that’s sort of her main thing. She’s so much about compressed meaning. And that’s the thing, it’s all about the execution. And I cannot overestimate how much that back-and-forth has shaped everything, especially toward the end when we want it to be perfect. The goal was making sure our meaning was clear. And more importantly, what we were saying was clear. As in, “What’s the worst possible reading of this material? How can we stop that?”\n\nAnanke and her sister lay out the rules binding the gods in a sequence of occult storytelling. (Image: Jamie McKelvie, Matt Wilson, Clayton Cowles, Image Comics)\n\nNarcisse: One of the things I think becomes clear in the last arc is that the series is very much a metaphor for life as a performance. The act of living, especially in this day and age, has become a performative act. Which can go sideways, get overindulged or under-realised. Do you think the characters we’ve journeyed with throughout the series did it for themselves, or for others? Does that boil down to specific characters?\n\nGillen: You want to talk about that first, Jamie?\n\nMcKelvie: Yeah, I’d agree with that. Do you want it by character? Hmm. I mean, you could argue Dio thinks he’s doing it for others, but that’s because there’s that thing missing in him he thinks will be filled by doing it for others.\n\nOne of the best examples of Matt Wilson’s stunning colour sense from issue #8. (Image: Jamie McKelvie, Matt Wilson, Clayton Cowles, Image Comics)\n\nGillen: I think it’s true. Dio has trouble saying no. There’s that awful duty and…the question of what that says about his relationship to masculinity? It’s one of the big themes in terms of people trying to navigate this gendered space. With Dio, when I was cooking up the characters, my default was they’re all artists but have a very different relationship to art.\n\nThe point being, you have all these twelve characters around Laura and they’re all doing it for different reasons. Laura is the heart of the book and so she takes bits from all of them, and also sees good parts of herself and bad parts of herself reflected in people, turned up.\n\nNarcisse: The Woden reveal was one of the things that really hit me in the gut, because of its layers. When you think about it even more, Ananke is literally co-opting a technopath — through a dysfunctional parental relationship — to subvert their talents and meet her end goals. I think it’s overly reductive to talk about the series as a generation gap, but that is there in that plotline.\n\nGillen: Jon’s the character who has possibly the least screen time and that makes it harder. Still, he’s one of the big characters in the book. His fingerprints are all over it, and you just don’t know him. You talk about the unseen work behind a performance.\n\nThat’s part of the way you could look at that. The generation gap is certainly a thing, and the cyclical nature of that gap over the centuries is certainly a theme. Ananke is both Ananke and Minerva. And Woden spends most of his time thinking he’s the dominant one. People tended to read Young Avengers as being young people vs. old people.\n\nAnd of course, by the end, it’s very explicitly, “No, no — this is about us.” The old people weren’t really the problem, it’s about us messing up. And WicDiv kind of has that, but it’s not really about the old people. You have your own shit going on. Trying to write those people as accurate as I could was hard, especially Woden as the idea of a father who feels aggrieved toward his children.\n\nThe relationship between Woden and Mimir in a nutshell. (Image: Jamie McKelvie, Matt Wilson, Clayton Cowles, Image Comics)\n\nPeople say being a parent changes you; being a parent is something I’ve never done, sadly. But, when you see all the stories about people being bad parents in the news, it feels like the idea just can’t be true.\n\nSome people don’t change. I often think about characters in pairs, for me, Woden is the opposite of Dio. Dio is “I will give everything for you”; there’s definitely a part of me that does that. And Woden is the owner, “I deserve this now.” Woden is all about the fact that, “I’ve worked hard. I deserve everything I want. I will treat people like things.”\n\nFor me, Woden was, “I want to try to write an emotionally repressed misogynist.” But also, if you could imagine you were this person, how would you justify it to yourself? And the way I wrote it, Woden was always horrible. What justification would you use? And Woden has read the feminist texts and used them to get laid. Even someone like Baal, in any other comic, would be one of the best people in the book. Baal’s a good guy. And his best instincts have led him to a terrible place. I just want to keep writing “sorry” to the characters.\n\nNarcisse: Jamie, with all the little details, Woden had to be horrible to draw. Talk to me about the characters that were most fun, most challenging, and the ones that unexpectedly bonded to you.\n\nMcKelvie: Hmm. Most challenging was remembering Laura’s fucking freckles every panel. And the piercings. I’ve forgot them quite a lot.\n\nNarcisse: It seems like you’ve always had fun drawing Inanna.\n\nMcKelvie: Yeah, he’s great because he really emotes. You know? That’s really fun to draw. They’ve all been really fun in different ways, because when I’m drawing a character, I like to approach them in terms of how they’re feeling and thinking. How that shows on their face, how it doesn’t. Their body language. All these kinds of things.\n\nThey were all sort of different challenges, like Inanna was all on the surface, while Baal had a lot underneath. And it’s not just a challenge of showing it or not showing it. It was more about showing something that you might not get it the first time but, when you read it back, then you see it. It’s going to be interesting watching people re-read from the beginning and notice that kind of stuff.\n\nInanna recounts the encounter that granted him godhood, in issue #6. (Image: Jamie McKelvie, Matt Wilson, Clayton Cowles, Image Comics)\n\nGillen: Talk about the re-designs, when you put everyone in black suits.\n\nMcKelvie: Yeah, that was a thing. Kieron, correct me if I’m wrong, he really likes putting characters in black. So, my issue there was to make these characters, all essentially wearing black suits, look different from each other. So, how do I take that? I took an aspect from each one of... was this part of the script?\n\nGillen: I can’t remember if it was in the script, but you definitely went to town on it.\n\nMcKelvie: Yeah, so one of the ways to differentiate them was each one takes a specific body and aspect of the Morrigan. So, like, Lucy gets the red hair from Badb, the one whose name I still don’t know how to pronounce.\n\nGillen: She’s the one we’re still not sure about!\n\nOnce again, they return, but very different this time. From issue #41. (Image: Jamie McKelvie, Matt Wilson, Clayton Cowles, Image Comics)\n\nMcKelvie: And for most of the thing, I couldn’t tell you which, because it didn’t stick in my head for some reason. And then Inanna had the torn mesh top and Jon took the green colours from the main aspect. There’s lots of things that were just really fun, like, being able to put in those little nods that don’t necessarily scream at you, but then you notice them and see them coming through. And there’s things like giving Baal a sadness beard, after Inanna died in issue #20.\n\nMatt does this stuff as well. I didn’t say what colour Baal’s suit should be. They’d been red up until that point but then Matt’s idea was to make him wear purple, because he was in mourning for Inanna.\n\nNarcisse: Matt, Jamie and Kieron talked about you changing Baal’s clothes to purple as a tribute to Inanna after that character’s death. Where did that idea come from? Were there similar instances where you were able to embed the storytelling in the colorwork?\n\nWilson: We started with him in red, which fit all his bravado. I believe in the second arc I put him in more blues, mainly because everyone had a change of clothes and also it also made sense to me that, as Laura/the reader got to know him more, you’d begin to see a different side of him.\n\nSo I wanted to reflect that change. Then, after Inanna’s death and in the fourth arc, I had him in purples. And yeah, that decision came from the emotions Kieron was describing in his scripts and the way Jamie drew him in that fourth arc. He had grown out his beard, and he just looked sadder to me.\n\nSo when I cast about for a new change of clothes, all of that pointed me toward purples. I liked the idea that the actual clothes aren’t that different. He’s still in suits and whatnot. And reds, blues, or purples can all potentially be seen as loud and confident colours.\n\nSo if you don’t really know what’s going on with Baal, you may not realise what’s going on with him. You’d still see a guy in colourful suits. Which is exactly the kind of storytelling with colour that I enjoy the most. They’re fun little details that totally give life to the story, but also may not go completely unnoticed.\n\nMatt Wilson changed the colours of Baal’s clothes to fit certain moods and storytelling goals. (Image: Jamie McKelvie, Matt Wilson, Clayton Cowles, Image Comics)\n\nAnd yeah, I did a ton of things like that throughout the series. The first big one was the Dionysus party issue (issue #8, I believe). I picked all of the colours and colour combos in that issue based on Kieron’s description of the beat of the music in each scene of the issue. At some points, it’s slowed down; at one point, there’s a drop and the crazy colours cut out completely.\n\nMy favourite page of WicDiv, from issue #8. (Image: Jamie McKelvie, Matt Wilson, Clayton Cowles, Image Comics)\n\nThen the music speeds up and I increase the intensity of colours until the story crescendos. Another example is in the Woden remix issue. We get our first glimpse of Jon/Mimir, but the reader doesn’t know who it is they’re seeing. But, if you go back and look carefully through that issue, I subtly embedded a silhouette of Jon based on a drawing of him from an earlier issue. I didn’t want to give too clear of a hint, so it’s all pretty hard to spot.\n\nMcKelvie: So, things like that I enjoy. All of us have been involved in that stuff. It was really satisfying to kill off Woden, so I don’t know if he’s one I grew attached to. But it was all of them, in different ways...\n\nGillen: I wish I wrote a couple more pages of that sequence. That murder was too quick.\n\nNarcisse: He should have suffered a bit more. With his death, Woden isn’t one of the characters who we see get old. What was it like to imagine these characters who were supposed to die in two years as older people?\n\nMcKelvie: With that last issue, that felt quite emotional to draw these characters as older. Seeing the lines in their faces and where they’ve gone in terms of how they dress. We didn’t really discuss how they were going to work. But we both had exactly the same idea, for some, as far where they wound up...\n\nGillen: You said, “I’m thinking about this” and I didn’t put that in the script, but it was kind of like, “that was how I’m seeing him, as well.”\n\nMcKelvie: Which is nice, because that shows how connected we are to those characters. That we both reached that same conclusion, without discussing it.\n\nNarcisse: One of the things I loved about the last issue a moment where I literally gasped was seeing what became of Tara.\n\nMcKelvie: That was a fun one and a real challenge, because the script called for living modern art, basically. I went through seven or eight different versions on the page to try and get something that worked. I found the less humanoid-shaped it was, the more silly it looked with a human head on top of it.\n\nIn some ways, I would have liked to have pushed it more weird. But also, it needed to be something that could move and walk and have hands and arms and things. So yeah, it was a bit of a challenge. And there’s a great scene when the colours came back from Matt, as well, I was basically seeing at all as one colour, and what he did with it was really interesting.\n\nA funeral brings the cast of WicDiv together to say goodbye in series finale issue #45. (Image: Jamie McKelvie, Matt Wilson, Clayton Cowles, Image Comics)\n\nI liked the execution of that, Jamie, because it kept in the theme of Tara always being an outsider. Four arms, motherfucker, like what.\n\nMcKelvie: That’s another thing that wasn’t in the script but Kieron was thinking. “I think I want to give her four arms.”\n\nGillen: It’s a happy ending for Tara in ways, because she gets to find herself. She was always like, “I am my art.” Tara was one of the purer artists. You can see that when she chose to not have the body back in that previous issue. I just love what Jamie did with Tara. It was a good sort of end point for her.\n\nNarcisse: Was Laura and Cassandra getting together always part of the initial design? Did you know that from the beginning?\n\nGillen: Honestly, no. There’s a lot about the final year I knew but there was also a lot of parts floating around. Solving the equation was the term I use. Because we’ve got all of this stuff to think about, there were characters I didn’t know how they ended.\n\nBaphomet, I didn’t know. Cassandra. Mimir, no, maybe not Mimir. I’d say Baphomet, Cassandra, and Lucifer were the main ones. Of course, all three of them have really big beats in the final year. I kind of realised in the final year I can’t kill Dio. The original idea was he was just going to die, but then I realised I can save him this way.\n\nAnd I realised, “Oh no, that’s also the perfect end for Baphomet.” And it’s the same with Lucifer. And also, for reasons which are far too long and complicated, I knew they were going to meet up years down the line. I did not realise why.\n\nA turning point in Laura and Cassandra’s lives from issue #33. (Image: Jamie McKelvie, Matt Wilson, Clayton Cowles, Image Comics)\n\nAnd then it was like, “Oh, I’ve foreshadowed Cassandra’s death, that means she has to die before the end of the story.” Which meant coming back through the end as a way to really ground it. It’s a really human funeral and she had a great life and so much longer than we thought it would be.\n\nOnce I knew they were going to get together toward the end, I also knew they’re not going to stay together. I love both those characters but that’s not likely, is it? The idea of Laura and Cass, the longer I wrote them, the more they became friends. You know, they start off hating each other, they have this journey, and they were actually good for each other and supportive in different ways.\n\nWhen I realised that was already there, I thought Laura was going to kiss Cassandra at one point, because I always had the line “Anybody gets close to you gets burned.” That was mine from the start! But only when sitting back and looking back at the work, “Oh yeah, this is completely a love story between these women, 100 per cent.” So, after that point, I started building in the nods, the hints. There’s bits where you can sort of more explicitly see the possibility of something in the future.\n\nNarcisse: It’s surprising to hear their relationship was something that wasn’t laid out in your mind at the outset. Because, I think of Kieron Gillen as a critic turned writer turned wonk, so part of me is thinking this is Kieron discussing the tension between fans and critics.\n\nLaura’s been a lifelong fan and she becomes a creator. Cassandra’s been a critic and a journalist, and she becomes a creator, too. And it was like, “OK, it’s them banging heads but ultimately fusing together.” So, to hear you say I didn’t have it all in mind at the beginning is...\n\nGillen: D-duhbullu-duh! [Laughs.] it was always about them! It was only towards the end that I realised, “That’s how they synthesise.” That’s why I called it solving the equation. You’ve got these two sons, and “oh, right” — that’s what happens, isn’t it? What you’re saying makes perfect sense and, to use a loaded word here, it satisfies a necessity. “Oh yeah, that’s the thing that makes sense.”\n\nNarcisse: Two big questions, and then we should be done. You’re at the end of it all. Did doing WicDiv for five years put any demons to rest? Give rise to new ones?\n\nWilson: Demons to rest? Hm. No, not really. I’ve never been a very good “fan” of anything. I have a hard time getting obsessed, or even sticking with hobbies or passions for too long. That may mean I’m a bit dull.\n\nIn terms of new demons? I’m not sure this counts, but I was surprised at how much WicDiv not being in my monthly schedule bothered me after I finished. Because in theory, things should be the same.\n\nI still have a very full workload with a lot of great projects. But having the same series month after month for five years was quite a comfort in a freelance career. That’s all compounded by the fact that another of my long-running series also ended this summer, with the conclusion of Paper Girls.\n\nMcKelvie: That’s a big question to throw at somebody. I would have to think about that a longer time, I think. One of the things we talked about the other day is, like, Kieron was processing a lot of stuff. Like, trying to get over himself. But towards the end of it for me, because of me going through pain issues, it sort of took over my entire life.\n\nSo, I’ll be thinking about it for the rest of my life. Now that it’s over, I’m thinking, “I have to deal with all this other stuff.” So, I’m kind of in a place where it’s a bit too early to answer those questions.\n\nNarcisse: I feel like your process of doing this book was being a perfectionist while dealing with these pain issues. That has to inform what you’re going to do next, right?\n\nMcKelvie: Yeah, first of all, I’ve just got to take a break and rebuild and try to figure out how to continue. Obviously, I can’t draw in that way anymore. I can’t do a lengthy book anymore, in that respect.\n\nNarcisse: But at the same time, you probably feel more creatively confident than you probably ever have.\n\nMcKelvie: Yeah, it’s something I’m constantly thinking about. Constantly reading and making notes and doing reading and getting prepared. And I’m very excited to move on to the next thing.\n\nGillen: Would you say it proves that we can do it?\n\nMcKelvie: Absolutely, because that was one of the things we wanted to prove we could do: Get this giant book done. And we did it. And I’m very, very proud of it and everything we did with it.\n\nI’m not sure we achieved every artistic goal we wanted to, but, in terms of “we want this giant story told,” we did it. And we got these trades out of it, people bought them, I’ve got them lined up on my shelves. It was a giant, physical thing we did over the last five years.\n\nIn issue #43, Laura realises the horrible truth of Ananke’s manipulations and what it says about her and the other gods. (Image: Jamie McKelvie, Matt Wilson, Clayton Cowles, Image Comics)\n\nGillen: Every time I walk past the eight trades, I see the whites-to-black fade [on the spines]. It’s a really small example of we did, but that shows that we had a plan here. And I look at it, and I see that’s a body of work. The first second I put the black trade in, that will be like Sam Gamgee going, “Well, I’m home.” That’s the moment the final thing unlocks, in some ways.\n\nMcKelvie: Honestly, anything that I work on isn’t perfect and it isn’t what I want it to be. And so, then it’s immediately like, “Well, what can I do next?” What can I do to make this closer to what I want it to be? So yeah, each one always gives rise to the next, in that respect.\n\nGillen: Like I said, I am more at peace than I was five years ago. Or at least, what I’m not at peace about is different. I’ve done a lot of serious thinking about death.\n\nDeath does not scare me the way it used to, anymore. Something I’m haunted by... pretty much what I remember the last words my dad saying was, “You know, son, I can’t help but feel it’s going to be OK.” And of course, I just wanted to scream, “No, dad, it really isn’t!” And that’s kind of how the first arc ended. The concept of “OK” has been ticking by and I’ve been interrogating it and eventually reaching this point at the end, where, it is ok.\n\nOK is not the most positive word, but it’s also not the most negative word. It’s more like, this could be borne. It’s possible to carry on living. I’m tearing up now. At least, it made sense to me. So, that’s helpful. It’s successfully put an end to my youth. I’m quite relaxed about that.\n\nI quite enjoy being an elder statesman. But at the same time, what kind of elder statesman am I going to be? And with Die and a lot of stuff I’m doing now is explicitly, “OK, what kind of writer am I going to be?” How do I want to spend the rest of my life, really? Because I’m going to live. Until I die, anyway. And that’s the big whatever-the-hell now, because I’ve done that.\n\nNarcisse: Last question. A grandchild, niece, or nephew picks up the series in five, 10, 20 years time. What do you hope they notice about the craft? What do you hope they learn about you?\n\nWilson: I would want my attention to storytelling to be noticed. I consider the last 10 years to be a real golden age of comics colouring. The bar has been raised in regards to colouring’s contribution to the storytelling in comics. So if anyone looks back at my work and thinks it contributed, even in a small way, to the advancement of the art of comics colouring, then I’d be happy.\n\nGillen: I hope they realise that weird Kieron guy, he swore a lot. He’s got a potty mouth.\n\nMcKelvie: I’m trying to think of just one thing...\n\nLaura contemplates loss in the series’ last issue. (Image: Jamie McKelvie, Matt Wilson, Clayton Cowles, Image Comics)\n\nGillen: I just never go high, on my emotional scale. I don’t go higher than bittersweet. I hope people see the work is cruel and hard in some ways, but there’s an underlying kindness.\n\nIt’s got a sort of hope in it. Even though everything goes wrong and everything’s awful, all we can hope for is each other, as well. We are both the prison and the key. I sound like a hippie. And he really liked pop music. He was really someone not afraid to love things. I kind of hope that comes across. Me and Jamie. That it wasn’t half-assed.\n\nMcKelvie: The care we put into it and the thought we put into it. The beliefs we put into it. Like I said, we started out, “here’s all these things that we love” and we wanted to do something about it. We wanted to put it into a comic. And we did that. And not just comics and stuff we love, but how we feel about people and how we look at the world. I think that comes across in there.\n\nI hope so, anyway. It seems silly to talk about how a comic has changed people’s lives, but people tell us that it has. And I think that shows how much we were putting into it.", "description": "One of the best comics series in the last decade came to an end last week. As you’d expect, writer Kieron Gillen and artist Jamie McKelvie have a lot of thoughts about saying goodbye to The Wicked & The Divine....", "authors": ["Jason Schreier", "Heather Alexandra"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/b7gyucnmyxbqdnieksp8.jpg", "published_at": "2019-09-11"}