{"pub": "afr", "url": "https://afr.com/policy/economy/think-small-to-build-a-bigger-australia-20191029-p535cs", "downloaded_at": "2019-10-29 14:08:22.164675+00:00", "title": "Think small to build a bigger Australia", "language": "en", "text": "Other factors to consider\n\nAccording to the report’s lead author, Stephen Smith, the idea of federal government spending has merit, particularly in an era of record low interest rates.\n\n“But there are a number of other factors to consider,\" he said. \"The elevated level of current activity is already generating shortages in the skilled labour and specialised equipment needed to deliver major infrastructure projects, particularly so in Sydney and Melbourne.\n\n“Infrastructure is also mostly a state responsibility, and many states are experiencing revenue write-downs.”\n\nSmith still argues there is room for governments to deliver smaller-scale projects outside the major capital cities rather than the current pipeline dominated by major road and rail projects, mainly in Sydney and Melbourne.\n\n“These are easier for contractors to co-ordinate and don’t tend to require the same amount of specialised skills and equipment to deliver. This helps to minimise labour and materials shortages and reduces the risk of delays and cost overruns,\" he said.\n\nThis argument is still unlikely to make the Morrison government abandon its commitment to its budget surplus.\n\nAdvertisement\n\nIt will participate in various “city deals” in co-operation with state and local governments to assist targeted infrastructure investment – such as the negotiations this week with the West Australian government to revitalise the Perth CBD. It is also willing to work with states to fast track smaller projects as part of $100 billion in committed federal funding over the next decade.\n\nAn increasing number of business leaders are also expressing support for this type of capital investment.\n\nBut the Prime Minister still warns that demands for a big increase in federal government spending on favoured infrastructure projects inevitably risks a repeat of the waste of overpriced school halls that were championed by the Rudd government to stimulate the economy after the global financial crisis.\n\nYet that fiscal caution won’t stop the political pressure for more federal leadership if the level of domestic activity still doesn’t respond to the combination of interest rate reductions and tax cuts and the level of infrastructure construction already under way.\n\nLittle evidence of momentum\n\nAn increasing number of business leaders are also expressing support for this type of capital investment necessary to improve long-term productive capacity and reduce congestion. Deloitte Access Economics forecasts private business investment will remain subdued this financial year although it expects to then recover and grow at a faster rate than real GDP.\n\nThe report cites the latest capital expenditure survey by the Australian Bureau of Statistics showing businesses plan to invest more than $110 billion this financial year, an 11 per cent increase from last financial year and more than $20 billion above the initial estimate for total investment.\n\nBut so far, there’s little evidence of economic momentum flowing from any increased business investment – despite the public infrastructure boom happening in the eastern states.\n\nAdvertisement\n\nAccording to Deloitte, the September quarter figures show the value of infrastructure projects under consideration or possible is now at its highest level since mid 2013, for example. The value of definite projects increased by more than $8 billion over the same three months.\n\nBut the report also puts into perspective the extraordinary change in infrastructure investment in different regions over the past six years, compounding the complications of a national approach.\n\nThis includes the shift from the mining and LNG construction that accompanied Australia’s resources boom to its more recent replacement by largely public sector spending. In essence, it says, the bulk of infrastructure investment moved from Australia’s north and west to Australia’s south and east.\n\nSo at the height of the mining boom, the report notes that some $300 billion worth of projects were either under construction or committed in Queensland, Western Australia and the Northern Territory (the north and west). This compared with $100 billion in NSW, Victoria, South Australia, Tasmania and the Australian Capital Territory (the east and south).\n\nSince then, according to Deloitte, the value of projects in Australia’s north and west has fallen by a massive $236 billion, while projects in the east and south have increased by $56 billion, mostly on transport-related infrastructure.\n\nThis imbalance is beginning to change again as mining investment picks up, particularly in WA's iron ore sector and Queensland's coal industry.\n\nActivity in the south and east will continue to be supported by public infrastructure investment, Deloitte says, although it sounds less convinced about the level of future spending.\n\n“Governments have already committed record amounts towards infrastructure and there appears to be limited scope for further investment,” Smith said.\n\nTesting that scope is where the economic debate will be most heated. But the fastest-growing populations are still on the outskirts of major cities. They won't want to wait a decade for better infrastructure. That's politics.", "description": "The calls for the Morrison government to spend more on infrastructure will only accelerate – but just what sort of investment is required?", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2119%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_108/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/e57c4afbed45ee6117342ab3436bb964b6cfb82b", "published_at": "2019-10-29"}