{"pub": "dailybeast", "url": "https://thedailybeast.com/stephen-colbert-trumps-pettiness-just-saved-us-from-warmonger-john-bolton", "downloaded_at": "2019-09-11 07:26:49.492555+00:00", "title": "Stephen Colbert: Trump’s ‘Pettiness’ Just Saved Us From ‘Warmonger’ John Bolton", "language": "en", "text": "“I have never been more grateful for the president’s pettiness and stupidity,” Stephen Colbert declared during his monologue Tuesday night. “Because today, he was stupidly petty enough to save us from a very smart warmonger.”\n\nThe Late Show host was of course referring to John Bolton, who was either fired or resigned as national security adviser, depending on who you believe.\n\nOut of nowhere on Tuesday morning, President Trump tweeted, “I informed John Bolton last night that his services are no longer needed at the White House.” Or as Colbert put it, “Trump goes through staffers like a high 17-year-old goes through Little Debbie Swiss Rolls.”\n\nColbert said “we knew this would happen eventually,” because while Trump was “very down on our Middle Eastern wars,” Bolton “had never seen a patch of sand he didn’t want to make glow.” The New York Times reported that one senior official recalled the president joking, “If it was up to John, we’d be in four wars now.”\n\n“And I can’t have that, I’m already in so many wars,” Colbert added as Trump. “I got trade war, cupcake war, I’m in a flame war with Chrissy Teigen, and ‘World War II, what if the Nazis had won?’”\n\nThe host was even more horrified by the notion that Trump believed he “tempers” Bolton, as he told reporters back in May. “So Donald Trump is the voice of reason?” Colbert asked, before breaking into his presidential impression once more: “John, John, you’re talking crazy, OK? Now can we please get back to discussing windmill cancer?”", "description": "The “Late Show” host said Trump was “stupidly petty enough to save us from a very smart warmonger.”", "authors": ["Matt Wilstein", "Senior Writer"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_14/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1568175467/SC_srbhgz", "published_at": "2019-09-11"}