{"pub": "townhall", "url": "https://townhall.com/tipsheet/mattvespa/2019/10/01/of-course-the-hunter-biden-angle-of-the-trumpukraine-story-has-been-suffocated-with-a-pillow-n2553981", "downloaded_at": "2019-10-02 00:33:29.419834+00:00", "title": "Of Course, the Hunter Biden Angle of the Trump-Ukraine Story Has Been Suffocated With a Pillow", "language": "en", "text": "House Democrats are gung-ho on impeachment. We all knew this was their end game. The feisty ones were firing signal flares since 2016, while the elders of the party waited for a legitimate reason to push the button. The problem is that the Trump-Ukraine phone call isn’t legitimate. Yeah, no kidding, I know. But we all know Russian collusion was going to be their ticket to the impeachment circus, which was undercut by the Mueller report and anyone else with cognitive function since there is zero evidence that the Trump team and the Kremlin colluded during the 2016 election. Instead, they’re going to die on the hill that the President of the United States can’t speak to foreign leaders.\n\nTrump spoke with Ukrainian President Volodymyr Zelensky in July and asked him to assist a U.S. Department of Justice investigation into the origins of the Russia investigation. That’s not out of the ordinary. Also, the original allegation, that Trump had threatened to withhold military aid in exchange for a corruption probe into Hunter Biden, was also disproven by the transcript that was released. There is no evidence to support that Hunter Biden was involved in felonious activities, but he was on the board of an energy company, making $50,000/month despite zero experience working in this sector. It appears clear why he was there: access. His father, Joe Biden, was the vice president at the time. Yet, this point is only being made by some media outlets, while the major ones, the liberal ones, have unsurprisingly placed a pillow over this story. The Media Research Center crunched the numbers. Seven hours were devoted to the shoddy phone call shakedown that never happened between Trump and Zelensky. The Hunter Biden angle, which is something that should be investigated, only got 46 minutes. Newsbusters’ Geoffrey Dickens has more:\n\n\n\n\n\nIn just ten days (September 20 through September 30) the broadcast networks overwhelmed their evening and morning shows with more than 7 hours of coverage devoted to a whistleblower’s complaint about President Donald Trump’s phone call with Ukranian president Volodymyr Zelensky and the ensuing calls for impeachment. Only 46 minutes of that coverage referenced Democratic frontrunner Joe Biden’s son Hunter Biden’s sweetheart deal with a Ukranian company. Even when networks mentioned Trump’s concern about Hunter benefiting from his father’s status as Vice President, they were quick to dismiss the allegations with the refrain: “no evidence of any wrongdoing.” But if the networks dared to look just a little bit into Hunter Biden’s history with the Ukranian energy company Burisma, they’d find plenty of evidence of questionable behavior involving the Bidens – that would be worth more than 46 minutes of coverage. Clinton Cash author Peter Schweizer reported, “Hunter Biden joined the board of Ukrainian energy company Burisma in April 2014, according to RSB bank records. Hunter Biden had little background in energy. Over a 16-month period, Burisma paid $3.1 million to a bank account associated with Hunter’s business.”\n\nAnd yes, as Dickens noted, even The New Yorker noted that at the time, the Obama administration was worried about a conflict of interest with this shady arrangement. But no because…'orange man bad.’", "description": ".10/01/2019 20:28:42PM EST.", "authors": ["Matt Vespa", "Beth Baumann", "Cortney O'Brien"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2014/289/17329344-1af8-4a1f-8631-ab65d20076a0.jpg", "published_at": "2019-10-01"}