{"pub": "americanconservative", "url": "https://ncpanow.org/news/releases-advisories/ncpa-calls-on-us-doj-to-investigate-ncaa-antitrust-violations", "downloaded_at": "2019-10-05 13:05:13.083805+00:00", "title": "NCPA Calls on US DOJ to Investigate NCAA Antitrust Violations", "language": "en", "text": "Remarks by Ramogi Huma,\n\nNational College Players Association Executive Director\n\nUS Department of Justice Antitrust Division Workshop - 9/23/2019\n\nGood afternoon, first I’d like to thank the US Department of Justice for inviting me here to discuss antitrust issues in college sports. I’m here today because NCAA sports is a predatory economic cartel that treats players like university property rather than people. The NCAA does nothing about the trail of seriously injured, abused, and dead college athletes. Instead of action, the NCAA states loudly that it has no duty to protect college athletes. In fact, it ruled that Michigan State University team doctor Larry Nassar’s multiple sexual assaults against Michigan State athletes did not break NCAA rules simply because there are no NCAA rules that prohibit the sexual or physical abuse of college athletes. But if any of those abused athletes would have dared to benefit from the economic rights afforded to everyone else, the NCAA would have spared no expense to investigate and punish them. That’s because the primary economic function of NCAA rules is price-fixing athlete pay.\n\nCollege sports is a $14 billion dollar industry produced by half a million college athletes who are denied economic rights and freedoms that would otherwise allow them to receive an equitable portion of their hard work. College athletes are workers who, to date, have been denied worker protections. Meanwhile, colleges capitalize on their athletes’ blood, sweat, and brain damage to generate multibillion dollar TV deals, hundreds of millions of dollars in apparel contracts, multimillion dollar coaches’ salaries, and invaluable marketing. However, the NCAA imposes extreme player compensation restrictions that are economically harmful to tens of thousands of college athletes, and leave over 80% of college athletes below the federal poverty line. This NCAA price-fixing is counter to America’s economic principles of free enterprise. In addition, there is a strong civil rights concern given African Americans comprise a disproportionate percentage of players in Division I revenue-generating teams, yet suffer the lowest graduation rates.\n\nThe public is well aware of these glaring injustices. A recent poll found that 84% of regular college students and 89% of college athletes feel that NCAA sports exploit college athletes. The poll also found that college athlete name, image, and likeness compensation was favored by 77% of regular students and 81% of college athletes. Additionally, a Rasmussen public opinion poll published in March found that two-thirds of Americans support allowing college athlete compensation for use of their name, image, and likeness. Economists understand this as well: 92% of those surveyed by the university of Chicago said the system generates rents for colleges at the expense of athletes.\n\nCurrent and former college athletes have stood up against the NCAA’s illegal price-fixing rules in key lawsuits. Players proved in both the O’Bannon v. NCAA and Alston v. NCAA antitrust lawsuits that the NCAA has been illegally price-fixing player compensation. However, the courts have allowed ongoing price fixing for compensation that isn’t tied to educational costs. Alston v. NCAA is a current case and has been appealed to the 9th Circuit. The NCAA is hoping to overturn the current ruling, and the plaintiffs are appealing for broader relief. We agree with the plaintiffs 100%. NCAA cartel conduct continues to flaunt antitrust laws and, unless this ruling is expanded to provide broader relief, the NCAA will continue to fix prices to the detriment of college athletes.\n\nThe NCAA has attempted to justify its mockery of antitrust law. During the O’Bannon v. NCAA trial, the NCAA’s lawyers stated the NCAA “… is a cartel that does good things, rather than a cartel that does bad things.”\n\nCollege athletes beg to differ. I started this organization after my teammate was suspended for eating food that was left on his doorstep when he was broke and hungry. The NCAA suspended him because it said he only received the food because of his athletic name and prominence, a violation of NCAA price-fixing rules. Meanwhile UCLA was fully capitalizing off of his name by selling his jersey in stores.\n\nNCAA assertions that it only imposes “well intentioned” price-fixing have been exposed as false. I’ve made handouts available to refute these NCAA arguments with facts and data. At the end of the day, our nation’s antitrust laws and principles of equal rights can’t be subject to whether or not a cartel thinks its illegal activities are “well-intentioned”.\n\nAnother antitrust issue of great concern is that the NCAA facilitates collusion to restrict players from transferring from one school to the next. The NCAA actually gives players’ current school veto power over transfers. Additionally, college athletes participating in football, basketball, baseball, and ice hockey must sit out a year after they transfer while other sports do just fine without this penalty. Essentially and with few exceptions, the NCAA imposes a national, collusive non-compete agreement against players. My organization, The National College Players Association believes that all players should be able to transfer one time, in cases of abuse, and when a head coach leaves without NCAA punishments or non-compete restrictions.\n\nIn 2015, this collusive agreement harmed University of Illinois women’s basketball players who publicly detailed various forms of abuse by holding them out for 6 games after they fled to another college. This summer, the agreement harmed University of Illinois football player Luke Ford who was denied a transfer waiver. Ford transferred from Georgia where he could have been a starter, to the University of Illinois to be closer to his ailing grandfather, but the NCAA denied his request. The NCAA has taken it upon itself to determine that his grandfather’s poor health isn’t a good enough reason to transfer since his grandfather not part of his nuclear family. The NCAA also denied the transfer waiver request from Virginia Tech football player Brock Hoffman who transferred from Coastal Carolina to help care for his ill mother. Apparently her brain tumor, impaired vision, facial paralysis, and hearing loss did not outweigh Coastal’s claim on Hoffman’s labor. Both Ford and Hoffman would have been free to participate if all athletes were allowed to transfer once without punishment.\n\nThe collusion to restrict player transfers comes at a great physical toll to college athletes. The NCAA’s own survey found 50% of Division I athletic trainers knowingly return players with concussions to the same game. This is horrific given all that we know about Chronic Traumatic Encephalopathy, also known as CTE, a brain condition linked to contact sports that can bring on memory loss, impulse control, depression and suicide. The National Athletic Trainers’ Association found that almost 60% of athletic trainers are pressured by coaches to make medical decisions that are not in players’ best interests. Six medical associations jointly published the Team Physician Consensus Statement declaring that college athletic staff have a financial conflict of interest that puts players’ health at risk. Players should not be trapped at abusive or negligent athletic programs because of NCAA transfer restrictions. This environment contributes to a lifetime of medical expenses, as 50% of former college athletes will suffer chronic sports-related injuries. All of this underscores the need to end NCAA collusion that takes away players’ freedom to transfer.\n\nIncluded among the harmful collusion in NCAA sports are rules to stifle players’ ability to secure legal representation, a.k.a. sports agents. Murderers are guaranteed the right to full legal representation in America but college athletes aren’t. The NCAA also blocks players’ ability to complete their college athletics eligibility even if those athletes reject a professional league draft offer. However, the NCAA has already demonstrated that the industry can function just fine with less restrictive alternatives. For instance, high school recruits playing baseball and ice hockey can have sports agents, and the NCAA adopted a new rule to allow men’s college basketball players to do the same. As for professional drafts, baseball and ice hockey players who are drafted out of high school are allowed to play in NCAA sports if they choose to decline their draft opportunity and play in college instead. The NCAA’s new rule also allows men’s college basketball players who enter the NBA draft and are not drafted to stay in college and complete their NCAA eligibility. The collusion that prevents players of all sports from exercising these freedoms cannot be justified when it has been demonstrated as unnecessary in various sports within the industry. If the NCAA truly wants college athletes to be treated like regular students and graduate, then it should allow them to secure legal representation and stay in college.\n\nClearly, the NCAA and its colleges have been bad actors when it comes to their treatment of college athletes. To date, college athletes have been forced into second-class citizenship – no other college student risks a group boycott by thousands of colleges for daring to earn money or transfer. This takes place in one of the most high profile industries on the planet – before our very eyes.\n\nFortunately, developments among some state legislatures may bring impactful reform in some of these areas.\n\nMy organization, The National College Players Association is a co-sponsor of California Senate Bill 206, “The Fair Pay to Play Act”.\n\nThe Fair Pay to Play Act would allow all California college athletes to secure sports agents and receive compensation for use of their name, image, and likeness without punishment from their college, conference, or the NCAA. The bill has complete bipartisan support and was approved 72-0 in the Assembly and 39-0 in the Senate. It’s now on the governor’s desk.\n\nLegislation similar to California’s Fair Pay to Play Act was introduced with bipartisan support in the state of Washington, Colorado, and the US House of Representatives. Most recently, a name, image, and likeness compensation bill was introduced in New York and state lawmakers in South Carolina announced a commitment to introduce a similar bill in the upcoming legislative cycle. My organization will do all it can to get this bill introduced in as many states possible.\n\nIn response to the California Fair Pay to Play Act, the NCAA submitted letters from its leaders essentially threatening California with an illegal, national group boycott in which all other NCAA colleges would be prohibited from competing against California colleges. You can bet that the NCAA will make the same threats to other states as well. Such action would be a violation of both federal and California antitrust laws. Neither the US Congress nor the state of California have granted the NCAA an antitrust exemption that it would need to take such action. Nor should they.\n\nThe NCAA is signaling that the Dormant Commerce Clause would render the Fair Pay to Play Act unconstitutional. It points to precedent in Miller v NCAA, a court ruling the NCAA won regarding its due process rules. However, the 1992 Miller v. NCAA ruling examined uniform NCAA due process rules and does not apply to today's non-uniform player compensation arrangements that exist throughout NCAA sports.\n\nThe first pertinent question to ask about the Dormant Commerce Clause is... Does The Fair Pay to Play Act discriminate against other states? The Answer is No.\n\nThe bill does not attempt to require out-of-state colleges to allow player compensation nor does it prevent other states and colleges from choosing to allow player compensation. It does not prohibit California entities from competing against out of state colleges or participating in NCAA sports. And it does not exempt California entities from complying with the provisions of the bill.\n\nThe second pertinent question to ask is… Does the local benefit outweigh any industry burden? The Answer is Yes.\n\nCalifornia has a vested and compelling interest in ensuring college athletes have equal rights to legal representation, economic freedoms, and antitrust protections afforded to other students and state residents.\n\nThis bill would not create an industry burden. It does not require colleges, conferences, and athletic associations to compensate players. It would reduce industry regulation by decreasing the burden of complying with and enforcing the NCAA’s compensation prohibition.\n\nAnd the third pertinent question to ask... Is there a need for uniform player compensation in NCAA sports? The answer is No.\n\nPlayer compensation in NCAA sports already varies dramatically. For example, the Ivy League, a Division I conference, prohibits athletic scholarships while other Division I colleges provide 5-year athletic scholarships. This means a player at an Ivy League college receives no money while a player on a 5-year scholarship at a private school can get over $300,000. And yet these two economic systems compete on the court every March without harming demand.\n\nThe NCAA also granted the \"Power 5 conferences\" the autonomy to make many of their own rules for player compensation while denying other Division I conferences the same autonomy.\n\nThere are also tremendous differences in player compensation amounts among players on the same team. Teammates can receive a full scholarship, partial scholarship, or no scholarship at all. And, some players are permitted to receive Olympic prize money like University of Texas swimmer Joseph Schooling who won $753,000 in 2016 from his home country of Singapore for winning a gold medal.\n\nThe NCAA does not claim that all of these differences in player compensation is a burden on its industry.\n\nIn conclusion, it is my hope, that this is the beginning of a continued dialogue with the US DOJ Antitrust Division about serious antitrust issues in NCAA sports.\n\nSpecifically, The National College Players Association would like the US DOJ to consider the following actions to protect college athletes and uphold the integrity of federal antitrust laws:\n\nFile an amicus brief in support of players in Alston v. NCAA Open an investigation into the possibility of challenging NCAA restrictions on players’ transfer freedom, their ability to secure sports agents, and their ability to decline a draft position to complete their college sports eligibility. Open an investigation into the NCAA’s public threats of an illegal group boycott against California colleges over The Fair Pay to Play Act\n\nThank you all very much for having me.\n\nHANDOUT\n\nDispelling NCAA’s Arguments for “Well-Intentioned Price-Fixing” of Athlete Pay\n\nUS Department of Justice Antitrust Division Workshop - 9/23/2019\n\nIt Would Ruin Competitive Balance and Harm Smaller Colleges - False\n\nThe 9 th Circuit upheld ruling (O’Bannon v NCAA): NCAA’s limit on compensation does NOT create competitive balance and stated that virtually all economists agree. The recent Alston v. NCAA case discarded this claim finding the NCAA had no evidence whatsoever.\n\nCircuit upheld ruling (O’Bannon v NCAA): NCAA’s limit on compensation does NOT create competitive balance and stated that virtually all economists agree. The recent Alston v. NCAA case discarded this claim finding the NCAA had no evidence whatsoever. NCAA allows Division I players receiving a $300k 5-yr scholarship to compete in championships against Division I Ivy League athletes receiving $0.\n\nEconomic study (by Andy Schwarz): 99.3% of top 100 football recruits between 2002-2011 chose teams in the power conferences Historically, over 90% of football teams that finish in the top 25 rankings and over 90% of the basketball teams that make it to the Final Four are from the power conferences. 2.6% of NCAA schools have won 60% of all men’s basketball championships.\n\nBig 12 Commissioner Bob Bowlsby”: competitive equity is largely an “illusion”\n\nCompensation Limits Are Necessary to Preserve “Nonrevenue” sports – False\n\nIf this were true, the 736 athletic programs with 263,000 athletes that operate in NCAA Divisions II & III would not exist These teams are all “nonrevenue” Subsidies from high-revenue football and basketball teams aren’t present Latest FBI investigation revealed schools use “nonrevenue” sports to generate substantial donation revenue.\n\nExploding revenue has had underwhelming/inverse impact on athlete participation in California Division I revenues increase 290% between 2003-2016 from $219 million/year to $635 million/year (participation actually decreased 11% during this time)\n\n\n\nChanging Compensation Rules Would Violate Title IX - False\n\nFemale athletes would benefit because Title IX would require it.\n\nFemale athletes currently receive matching funds for optional player stipends (since 2015).\n\nCollege Athletes Already Get Enough…\n\nHaving less than equal rights is never enough.\n\nAthletes receiving a partial or no athletic scholarship are subject to identical pay prohibitions.\n\nCollege Sports Are Amateur - False", "description": "The full text of NCPA Executive Director Ramogi Huma's speech calling for an investigation into NCAA antitrust violations at the US Department of Justice Antitrust Division on 9/23/2019.", "authors": [], "top_image": "https://www.ncpanow.org/facebook-og.png", "published_at": "2019-10-05"}