{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/deliberate-and-mischievous-da-decries-irrs-hostile-stance-20191008", "downloaded_at": "2019-10-09 00:51:28.965533+00:00", "title": "'Deliberate and mischievous' - DA decries IRR's hostile stance", "language": "en", "text": "DA leader Mmusi Maimane and former Western Cape premier Helen Zille may end up working together again. (Felix Dlangamandla)\n\nThe Democratic Alliance has hit out at the Institute of Race Relations (IRR) over what the party has described as a \"nefarious campaign\".\n\nIn a statement, national spokesperson Solly Malatsi said that the IRR had \"deliberately and mischievously chosen to take a hostile position against the DA and four of our public representatives\".\n\nThe comments come after the IRR on Monday took another step to influence the direction of the DA, launching a campaign entitled #SaveTheOpposition.\n\nNews24 reported that South Africa's second-largest party is in a tug-of-war involving those who are trying to return the party to its old, classic liberal values and those seeking to broaden its ideology by including transformation and diversity more prominently in policies.\n\nThe former, seen as the \"liberal bloc\", have been linked to former leader Helen Zille, who is now a contender for the federal council chairperson position. The latter have been linked to embattled party leader Mmusi Maimane, who has been at the centre of two recent controversies.\n\nIn its statement on Tuesday, the DA hits back hard, likening the influence of the IRR to a form of capture.\n\n\"The Democratic Alliance has not and will never outsource its decision-making functions to outside bodies – doing so would be tantamount to capture of the organisation.\n\n\"The DA is well aware that political parties are not islands, hence we regularly have constructive engagements with think tanks and advocacy groups like the Helen Suzman Foundation, the Free Market Foundation, the Institute of Security Studies, among others, but none of them have ever sought to influence leadership contests, nor have they tried to dictate party policies with the aim of advancing narrow interests,\" the statement reads.\n\nIt continues that \"the DA notes the South African Institute of Race Relations' latest nefarious campaign dubbed #SaveTheOppostion\".\n\n\"The campaign is clearly targeted at the DA and not the opposition collective. Had their campaign been a genuine gesture of ensuring strong opposition in South Africa, it would not have singled out one party. The DA is one of thirteen opposition parties represented in the National Assembly.\n\n\"The IRR has deliberately and mischievously chosen to take a hostile position against the DA and four of our public representatives, in its latest salvo. This is unacceptable. Further to this, the IRR has laid out conditions, which would in their view save the DA,\" it reads.\n\n'We will not kowtow to external influence'\n\nThe IRR recently published an opinion piece by its analyst and campaigns co-ordinator Hermann Pretorius, calling for Maimane to step down as party leader.\n\nThe article sparked much controversy and criticism over the use of the term \"white man\". It called for Western Cape premier Alan Winde to replace Maimane, claiming he was leading the \"winds of change\" for the province and would be a more suitable leader.\n\nThe IRR has been accused of getting involved in the DA's internal matters, with numerous leaders - including parliamentary chief whip John Steenhuisen, Phumzile van Damme, Luyolo Mphithi and Maimane himself - hitting out at the think tank.\n\nIn the latest statement, Pretorius took aim at Steenhuisen, Mphithi, Van Damme and Johannesburg Mayor Herman Mashaba.\n\nNews24 reported earlier that DA MP Phumzile van Damme had said she was neither surprised nor bothered by the IRR slamming her and three other party leaders.\n\nThe DA's statement continues: \"In the pursuit of building South Africa, as both a party in opposition and in government, we will not kowtow to external influence that seek to drive factional and destructive behaviour in our organisation.\"", "description": "The Democratic Alliance has hit out at the Institute of Race Relations over what the party has described as a \"nefarious campaign\".", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/5522/d4c5ed3d8f494980aa027be1abfcff76.jpg", "published_at": "2019-10-08"}