{"pub": "metro", "url": "https://metro.co.uk/2019/10/10/cassie-tied-knot-alex-fine-intimate-wedding-officiated-friday-night-lights-peter-berg-10892546", "downloaded_at": "2019-10-10 02:45:50.476969+00:00", "title": "Cassie tied the knot with Alex Fine in an intimate wedding", "language": "en", "text": "Just married (Picture: Instagram)\n\nCassie has married her beau Alex Fine in an ‘intimate backyard wedding’, in which she wore a custom dress she helped design to flatter her pregnant figure.\n\nThe singer, actress, and model Cassie Ventura, known simply as Cassie, married her wellness consultant man Alex Fine in a ceremony performed by close friend and director Peter Berg – the man behind the hit series Friday Night Lights.\n\nThe couple wrote their own vows, and recited them while standing in a lush floral semi-circle lined with candles, as the sun set on Malibu in the background, according to Vogue.\n\n‘I felt really relaxed during the ceremony’ the Me & U singer said. ‘As soon as I saw Alex, any nerves that I did have went away, and I just couldn’t stop smiling.’\n\nThe bride carried a bouquet with both of her grandmother’s rings tied into it, and walked down the aisle to Kina Grannis, Can’t Help Falling in Love.’\n\nSo sweet (Picture: Instagram)\n\nThe reception featured an elaborate centrepiece, designed by event planner Melissa Andre, which had hundreds of candles melting into one another situated atop the long dining table.\n\nAdvertisement\n\nAdvertisement\n\n‘Since we didn’t use a traditional wedding venue, she was able to create a one-of-a-kind centerpiece,’ Cassie said.\n\nMelissa also strung gorgeous lights between the trees with the goal of making the space feel like a hidden oasis.\n\n‘It was dramatic, subtle, magical, and tranquil all at the same time. She knows my style and I love her taste so I could just sit back and enjoy my wedding wonderland.’\n\nThe newlyweds did their first dance to Tennessee Whiskey and after an evening of celebrating with family and friends, they ordered a heart-shaped pizza to top it all off.\n\nSo dreamy (Picture: Instagram)\n\nCassie met her now hubby Alex Fine at the gym and apparently they got talking about marriage pretty early on before falling pregnant not long after beginning their relationship.\n\nThe 33-year-old, who is due to give birth to a baby girl in December said initially she and Alex were debating whether or not they should wed before or after the baby but settled on before.\n\nThe ceremony was an intimate one with 14 guests total—all close family.\n\n‘We wanted a simple venue with a beautiful view that felt warm and romantic,’ Cassie said. ‘We wanted the aesthetic to reflect how comfortable and content we feel with each other.’\n\nThey worked with Melissa to coordinate everything in just two weeks!\n\nCassie is seven months pregnant (Picture: Instagram)\n\nBecause Cassie was seven months pregnant and they had a very short lead up to the wedding, the singer employed the help of stylists and friends Marni Senofonte and Deonte Nash to create a custom gown with tailor Arturo and his daughter Christina from Rancho Tailors.\n\nAdvertisement\n\nAdvertisement\n\nThey spent a week and a half getting the dress made.\n\nShe wanted the dress to feel romantic but comfortable for what she describes as her ‘intimate backyard wedding.’\n\nThe team decided on a dress with billowy, off-the-shoulder sleeves for romance and a high slit for movement. ‘When it came to this moment in my life, I knew that [it was] the easier the better for me,’ she said. ‘We chose to create the lace veil to give it a touch of the classic.’\n\nShe then paired it all with Jimmy Choo shoes and simple studs.\n\nThe groom wore Musika styled by Paris Libby, while all of the male guests were in black tuxes and the women were asked to wear cream.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Selena Gomez spotted running into the home of Niall Horan in Los Angeles and we have questions\n\nMORE: Kate Wright shares snaps of wedding ‘dress of dreams’ following lavish celebration to Rio Ferdinand", "description": "Cassie has married her beau Alex Fine in an 'intimate backyard wedding', in which she wore a custom dress she helped design to flatter her pregnant figure. The singer, actress,...", "authors": ["Eliza Berlage"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/Screen-Shot-2019-10-10-at-12.18.17-pm-9bd3_1570673645.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-10"}