{"pub": "wsj", "url": "https://wsj.com/articles/putins-pitch-for-japan-and-india-to-invest-in-russias-far-east-falls-flat-11567766521?mod=rsswn", "downloaded_at": "2019-09-06 12:12:49.731594+00:00", "title": "Putin’s Pitch for Japan and India to Invest in Russia’s Far East Falls Flat", "language": "en", "text": "VLADIVOSTOK, Russia—Russian President Vladimir Putin ’s three-day investment forum meant to highlight opportunities in the country’s Far East ended without any clear victories for Moscow or the underdeveloped region that the Kremlin wants to build up as a gateway to Asia.\n\nThe lack of any landmark deal at the meeting reflects the Kremlin’s problems in integrating the far-flung region more closely with Moscow, seven time zones away. Its biggest challenge is to build out infrastructure in a territory seen as a key to unlocking more exports to fast-growing markets such as China, Japan, and India.\n\nThe biggest names at the three-day Eastern Economic Forum – Indian Prime Minister Narendra Modi and Japanese Prime Minister Shinzo Abe – left without any headline deals, save a $1 billion credit line from India for developing the Far East. Mr. Abe left without signing any major agreements.\n\nIt wasn’t for want of trying. Mr. Putin made the case clear that Russia and the Far East, which suffers from lack of transport and power infrastructure and endemic corruption, is hungry for business and investment.\n\n“There is not a single sector that could be closed for our foreign partners,” said Mr. Putin speaking at the forum. “Quite the opposite, we’re interested in attracting it, we strive for it.”\n\nThe development of the Far East, which is slightly smaller than China in territory but with a population of less than 7 million, represents not only a chance to piggyback on Asian growth, but an attempt to bring the region closer under Moscow’s control. Two provinces in the region launched a protest vote last year against incumbent pro-Kremlin governors, ousting them in elections.\n\nIn what appeared to be a protracted sales pitch, Mr. Putin told the forum that since 2015 – the first year the gathering was held – nearly $1 billion has been invested in the region, creating 39,000 jobs. He also touted opportunities to invest in some of Russia’s biggest infrastructure plans, including the $600 million Zvezda port project that will focus on exports to East and South Asia, as well as Vostochny Cosmodrome, a new site for Russian state and civilian space launches.\n\nMessrs. Modi and Abe came to Vladivostok in the hopes of building inroads with Mr. Putin and leading Russia away from China, which has seen its relations with Moscow blossom with booming trade and a planned new military agreement. Stronger ties with Russia would help give India and Japan leverage over China. For Russia, it would also help Moscow diversify its Asian partners at a time when it fears its chronic economic problems will relegate it to the role of China’s junior partner.\n\n“Russia needs a diversity of strategic partners in the region to maintain its strategic autonomy going forward,” said Thomas Graham, a former U.S. diplomat and managing director of Kissinger Associates.\n\nThe forum itself brought only a meager showing of regional deals and vague agreements. A delegation of officials and businessmen from five Indian states toured the region ahead of the forum, looking for opportunities in diamond and coal mining as well as oil and gas. The trip ended with a series of memorandums of understanding, but few, if any, publicized contracts.\n\nTo make up for the lack of foreign investment, the Russian government has promised to spend nearly $10 billion to expand the region’s roads and railroads and ease transport in the region where bottlenecks often occur at the territory’s biggest ports. But sluggish Russian economic growth has caused the state to tighten its belt, meaning the money isn’t coming in as fast as planned.\n\n“The problem is that the government doesn’t have any money and nobody as of right now is really investing in the region,” said Artyom Lukin, an expert on the Far East at the Far East Federal University, which was the site of the forum. “They can’t see making profits here.”\n\nIn the meantime, a lack of jobs and high prices for consumer goods is triggering a steady of exodus of people, usually to Moscow, St. Petersburg or Novosibirsk, Russia’s three biggest cities.\n\n“It’s great there’s a forum, agreements have been signed. But what do we see of it?” asked Alexander Shkirsky, an unemployed resident of the city. “Nothing.”\n\nWrite to Thomas Grove at thomas.grove@wsj.com", "description": "The Russian president pitched for major investments from Japan and India at Vladivostok meeting but failed to seal any landmark deals.", "authors": ["Thomas Grove", "Thomas.Grove Wsj.Com"], "top_image": "https://images.wsj.net/im-104576/social", "published_at": "2019-09-06"}