{"pub": "businessinsider", "url": "https://businessinsider.com/borrow-money-loan-0-apr-credit-card-how-it-works", "downloaded_at": "2019-10-02 00:39:58.839911+00:00", "title": "I used a 0% APR credit card to borrow the money to start my business, and I'd tell anyone to do the same", "language": "en", "text": "The author is not pictured. JKstock/Shutterstock.com\n\nI've never taken out a personal loan because I don't like paying interest. But, there have been a few times when I've had to take on some debt — namely when I started my business.\n\nI turned to 0% APR credit cards, which offer an introductory APR of 0% for a limited time, allowing you to use the money as an interest-free loan as long as you pay it back within that introductory period.\n\nI'm a big fan of 0% APR credit card offers like those on the Marriott Bonvoy Business™ American Express® Card and the Chase Freedom Unlimited, because if you have a plan, you can borrow the money you need without having to pay interest.\n\nRead more personal finance coverage.\n\nSince you need a solid credit history to take out a hefty loan, you might want to start building your credit by taking out user-friendly credit cards with no annual fees and an introductory APR of 0%.\n\nIn fact, this makes sense even if you have been building your credit for a while; these low-risk liabilities are ideal for quick lines of credit when you need them, and you're not going to be slammed with enormous interest fees if you're able to pay them off quickly. An introductory 0% APR means the card won't charge you interest on the balance for a set period of time, established upfront. That means you can carry a balance month to month without incurring the notoriously high credit card interest rates, essentially using that money as an interest-free loan.\n\nEven though 0% APR periods are great, you have to be very careful to go into it with a plan. If you don't pay off your balance in full by the end of the 0% APR period, many credit cards will actually back-charge you all of the interest you accrued during the 0% APR period. That's not a mistake you want to make!\n\nI've made use of 0% APR offers from credit cards to help fund my business start-up fees, and I've saved thousands of dollars by not having to pay credit card interest or even interest on a personal loan! I may have gotten this idea from my parents, who financed our pool on a 0% APR credit card back in the early 2000s.\n\nIf this sounds useful to you (and let's be honest — who couldn't use a low-risk line of credit every so often?) then it's definitely worth it to check out some great credit card options. The Marriott Bonvoy Business Amex is currently offering a 0% APR on purchases for six months (then a variable APR of 17.49% to 26.49%) and the Chase Freedom Unlimited offers an introductory 0% APR on purchases for 15 months (then a variable APR of 16.99% to 25.74%).\n\nI've personally used both the Chase Slate Card and the American Express EveryDay to get an interest-free loan.\n\nChase Slate\n\nIf you're leaning towards Chase Bank for your lender, then I can recommend snagging a quick line of credit with the Chase Slate. This is a great option because it comes with a suite of features that you can use to your benefit especially well if you're planning on paying off the credit quickly. This card comes with no annual fee as well as a 60-day period during which you won't pay any fees for balance transfers. This is a great benefit if you've already been paying interest on a credit card.\n\nThe most important feature of this card, in terms of quick and cheap loans, is its introductory APR of 0%. Not only does this card come with a 0% introductory APR, but that rate applies to the first 15 months after your account opens. With many cards, introductory APRs only count for the first year, so 15 months means an extra quarter of \"free\" loans. After that, the APR will vary between 14.74% to 25.74%, but that won't matter if you've already paid the loan back during the first 15 months.\n\nAmerican Express Cash Magnet® Card\n\nInterestingly, American Express comes with a few cards that could easily grant you a quick line of credit without any penalty. One of them, the American Express CashMagnet, even lets you earn some cash back during your use of the card. This card has no annual fee and, like the Chase Slate, comes with an introductory 0% APR for the first 15 months of your account opening. After that, the APR will vary between 14.74% to 25.74%.\n\nThis gives you plenty of time to pay off your balance before interest kicks in, but depending on how you use the card, you may want to keep this one around. With the American Express CashMagnet card, you'll earn unlimited 1.5% cash back on all of your purchases. As a welcome bonus, you'll earn $175 cash back after you spend $1,500 on purchases in the first three months.\n\nYou can redeem your additional cash back rewards for statement credit, or repurpose those dollars towards gift cards or merchandise. This card is great for low-risk loans with a decent earning potential, depending on how much you spend.\n\nThe Amex EveryDay® Credit Card from American Express\n\nAlternatively, you may consider the Amex EveryDay Credit Card if it's Membership Rewards Points that you're after. This card comes with a similar set of standard benefits as the American Express CashMagnet and the Chase Slate credit cards, including a $0 annual fee, fee-free balance transfers for the first 60 days of the account, and 0% APR for the first 15 months of the account with a variable APR between 14.74% and 25.74% after that. But, unlike the other two cards, the American Express EveryDay comes with a different set of rewards and earning potential.\n\nInstead of cash back, you can earn Membership Rewards Points on qualifying purchases, which can then be redeemed (or transferred) for travel benefits, gift cards, merchandise, or entertainment. Plus, you'll get a welcome bonus of 15,000 points after you spend $1,500 on purchases in the first three months. With this card, you can earn 2X Membership Rewards points at US supermarkets (up to $6,000 spent annually, then 1X) and 1X Membership Rewards points on all other purchases. On top of that, if you use your card at least 20 times within one billing period, you'll earn 20% more Membership Rewards Points than the standard baseline.\n\nThis is a good option if you need a quick, cheap line of credit but you'd also like to start stockpiling rewards points and earn some benefits with your credit.", "description": "An introductory 0% APR means the card won't charge you interest for a set period of time, so you can use that money as an interest-free loan.", "authors": ["Caroline Lupini"], "top_image": "https://image.businessinsider.com/5d9356482e22af59e93d1ee1?width=1200&format=jpeg", "published_at": "2019-10-01"}