{"pub": "yahoo", "url": "https://news.yahoo.com/syria-kurds-strike-deal-assad-194400819.html", "downloaded_at": "2019-10-14 00:07:51.263588+00:00", "title": "Syria’s Kurds strike deal with Assad after being abandoned by US", "language": "en", "text": "A Turkish army armored vehicle advances in Syrian city of Tel Abyad, as seen from the Turkish border town of Akcakale: Getty Images\n\nKurdish-led forces in Syria have struck a deal with Bashar al-Assad’s government to handover areas along the border to the Syrian army in a last ditch effort to halt a Turkish attack.\n\nThe Kurdish-led Syrian Democratic Forces, one of the west’s key allies in the fight against Isis, said the army would deploy along the border with Turkey “to repel this aggression and liberate the areas entered by the Turkish army and its hired mercenaries.”\n\nThe deal was struck in response to a wide-scale military operation launched by Turkey against the SDF last week, which has killed more than 60 civilians and sparked fears of ethnic cleansing.\n\nTurkey’s armed forces and allied Syrian rebels have made rapid gains in the past week, taking control of two cities along the border and threatening to advance further. General Mazloum Kobani Abdi, commander of the SDF, described the operation as an “existential threat” to Syria’s Kurds.\n\nThe agreement could spell the end of a years-long experiment in autonomy led by Syria’s Kurds, and marks a major shift in alliances for the embattled community.\n\nTurkey has long threatened to attack the SDF, which it considers a terror organisation for its links to a Kurdish separatist group that has fought the Turkish state for decades. Ankara said its military operation was launched to implement a “safe zone” along its border with Syria, free of SDF fighters.\n\nBut the SDF — a mostly Kurdish militia with a smaller Arab contingent — has been a key ally of the US in the fight against Isis. The presence of US troops in Syria alongside the group had acted as a deterrence for a Turkish assault. That changed quickly last week when Donald Trump made a shock announcement that the US would not stand in the way of a Turkey’s plans to enter Syria. The SDF described the abrupt shift as a “stab in the back.”\n\nThe deal will see the Syrian army deployed along a large stretch of the Turkey-Syria border, the SDF said, in an effort to deter any further Turkish incursion.\n\nThe agreement brings its own dangers, however. For decades, Kurds in Syria have faced repression and discrimination at the hands of the government. Although the civil war had caused great upheaval for the community, it has also allowed them to win new freedoms, which may now be lost again.\n\nThe SDF currently controls around a third of Syrian territory in the north and east of the country.\n\nSyria’s Kurds took over control of majority Kurdish areas from the government shortly after the outbreak of Syria’s civil war in 2011, but largely refrained from directly fighting it.\n\nIn the time since, it extended that area of control beyond Kurdish areas as it recaptured territory held by Isis.\n\nOver the past few years it has built an alternative form of governance in the areas under its control, with the eventual aim of creating an autonomous administration that would outlast the war.\n\nRead more\n\nInnocent Syrian civilians being ‘turned into the fuel of war’\n\nFemale Kurdish politician ‘executed’ by pro-Turkish militants in Syria\n\nTrump says US will not stand in way of Turkish operation against Kurds\n\nHow Erdogan became ‘the most practised populist in the world’", "description": "Kurdish-led forces in Syria have struck a deal with Bashar al-Assad’s government to handover areas along the border to the Syrian army in a last ditch effort to halt a Turkish attack.The Kurdish-led Syrian Democratic Forces, one of the west’s key allies in the fight against Isis, said the army would", "authors": ["Richard Hall"], "top_image": "https://s.yimg.com/uu/api/res/1.2/d65mIV8LYcRiQePC8bWBDA--~B/aD0zNTE7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/15569f10fa867158d497eb2a45f14d08", "published_at": "2019-10-13"}