{"pub": "yahoo", "url": "https://news.yahoo.com/does-rand-paul-think-america-212019204.html", "downloaded_at": "2019-10-12 09:46:46.282788+00:00", "title": "What Does Rand Paul Think America Owes Our Kurdish Allies?", "language": "en", "text": "In 2014, Republican senator Rand Paul of Kentucky was all over the map on what, if anything, the United States should do to stop the growing army of jihadists known as the Islamic State of Iraq and Syria.\n\nIn June 2014, after ISIS conquered Mosul, Iraq’s second largest city at the time, Paul was very skeptical of even using American air power against ISIS. Airstrikes against ISIS could turn America into “Iran’s air force,” Paul wrote in a Wall Street Journal op-ed titled, “America Shouldn’t Choose Sides in Iraq’s Civil War.”\n\nAs American public opinion changed, so did Paul’s policy toward U.S. involvement in the war against ISIS. As late as August 29, 2014, Paul still wasn’t sure if “ISIS is a threat to our national security.” But then Paul, who harbored presidential ambitions at the time, abruptly issued a statement saying that he would destroy ISIS militarily.\n\n“Some pundits are surprised that I support destroying the Islamic State in Iraq and Greater Syria (ISIS) militarily. They shouldn’t be,” Paul wrote on September 4 in Time magazine. “If I had been in President Obama’s shoes, I would have acted more decisively and strongly against ISIS.” Many of Paul’s non-interventionist allies were baffled by his change of mind. “The sudden evaporation of Paul’s doubts reeks of political desperation,” wrote Jacob Sullum, a senior editor at the libertarian magazine Reason.\n\nIn 2015, Paul settled on a plan to defeat ISIS by arming the Kurds and promising them a country: “I think they would fight like hell if we promised them a country.”\n\nThe Kurds did fight like hell: 11,000 died fighting ISIS. But this week, President Trump decided it was not worth keeping 100 or fewer U.S. troops in northern Syria to deter a Turkish attack on America’s Kurdish allies. Rand Paul loudly cheered him on.\n\nOn Wednesday, I noted Paul’s 2015 comments about promising the Kurds their own country on the Corner, and on Thursday Senator Paul responded with a statement emailed by his communications director. “I did and still do support a homeland for the Kurds — in Iraq — anyone who conflates the Kurds in Turkey, Syria, Iraq, and Iran into one simple homogenous, easily solvable problem is either naive or disingenuous,” Paul said in the statement.\n\nFor the record, I never conflated the Kurds in Turkey, Syria, Iraq, and Iran “into one simple homogenous, easily solvable problem.” My post simply pointed out that Paul had gone from promising to reward the Kurds who would fight ISIS with their own country to cheering on a decision to merely move — but not bring home — 100 or fewer U.S. troops in order to enable Turkey’s plan to slaughter America’s Kurdish allies.\n\nSenator Paul still supports a Kurdish homeland in Iraq, he says. But many of the Kurds who fought the Islamic State of Iraq and Syria live in Syria, not just Iraq. What do we owe them?\n\nDid we owe them better than abruptly pulling out 100 troops whose presence kept Turkey at bay? Does it really stand to reason that just because Turkey is a member of NATO we needed to do them a solid and abandon our battlefield allies who suffered more than 10,000 deaths in recent years in a war against one of America’s worst enemies?\n\nWon’t abandoning the Kurds make it more difficult for America to recruit allies in the future to fight our enemies, undermining a key objective of interventionists and non-interventionists alike? Wouldn’t fulfilling Paul’s promise to help stand up a Kurdish country involve a much greater American commitment than keeping 100 U.S. troops in northern Syria?\n\nThese are some of the questions I’d like to ask Senator Paul. His communications director told me Thursday she had passed along the interview request, but I haven’t heard back and doubt I will.\n\nThe Kentucky senator did find time Thursday to write on Twitter that the “bloodlust” of his fellow Americans who disagree with President Trump’s decision “knows no bounds.” But as freshman Congressman Dan Crenshaw of Texas, a veteran of the Afghanistan war, wrote: “The great irony of the ‘no more endless wars’ camp’s argument is that removing our small and cost-effective force from Northern Syria is causing more war, not less. Our presence there was not meant to engage in endless wars, it was there to deter further warfare.”\n\nMore from National Review", "description": "In 2014, Republican senator Rand Paul of Kentucky was all over the map on what, if anything, the United States should do to stop the growing army of jihadists known as the Islamic State of Iraq and Syria.In June 2014, after ISIS conquered Mosul, Iraq’s second largest city at the time, Paul was very skeptical", "authors": ["John Mccormack"], "top_image": "https://s.yimg.com/uu/api/res/1.2/zfyyMXPy2euqB65TnLuAcQ--~B/aD01OTc7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/93e07b1a961b9164f5c0cd8d92e89819", "published_at": "2019-10-11"}