{"pub": "reuters", "url": "https://in.reuters.com/article/venezuela-politics/venezuela-opposition-parties-back-guaido-as-congress-chief-in-2020-idINKCN1VR2FU", "downloaded_at": "2019-09-07 03:41:24.871332+00:00", "title": "Venezuela opposition parties back Guaido as congress chief in 2020", "language": "en", "text": "FILE PHOTO - Venezuelan opposition leader Juan Guaido, who many nations have recognized as the country's rightful interim ruler, attends a session of Venezuela's National Assembly in Caracas, Venezuela September 3, 2019. REUTERS/Manaure Quintero\n\nCARACAS (Reuters) - Venezuelan lawmakers from small opposition parties on Friday said Juan Guaido should continue as head of congress in 2020, waiving their option to lead the legislature under an informal agreement to rotate leadership between parties.\n\nThe announcement ended speculation of an opposition rift over the 2020 legislative term, which under a 2016 agreement within the opposition would have fallen to a group of 17 small parties.\n\nGuaido in January declared President Nicolas Maduro a usurper and assumed a rival interim presidency that has been recognised by more than 50 countries, and the opposition is keen for him to remain in the post.\n\n“The national interest comes first,” Carlos Berrizbeitia, a lawmaker from the small Venezuela Project party, told reporters. “Until the usurpation ends, the president of the National Assembly will be Juan Guaido.”\n\nVenezuela’s constitution says that in the event of a presidential vacancy, the presidency falls to the head of the National Assembly until a new election is held.\n\nMaduro calls Guaido a U.S. puppet seeking to oust him through a coup and has suggested he may be arrested for treason.\n\nVenezuela’s political stalemate comes against the backdrop of a hyperinflationary economic collapse that has fuelled an economic crisis.\n\nMore than 4 million citizens have left the country, fleeing shortages of food and medicine, according to the United Nations.", "description": "Venezuelan lawmakers from small opposition parties on Friday said Juan Guaido should continue as head of congress in 2020, waiving their option to lead the legislature under an informal agreement to rotate leadership between parties.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190907&t=2&i=1427106881&w=1200&r=LYNXNPEF851UC", "published_at": "2019-09-07"}