{"pub": "cbc", "url": "https://cbc.ca/natureofthings/blog/victoria-photographer-spends-years-documenting-the-life-of-a-lone-wolf-off", "downloaded_at": "2019-10-02 00:38:34.196406+00:00", "title": "Victoria photographer spends years documenting the life of a lone wolf off Vancouver Island", "language": "en", "text": "Cheryl Alexander is an environmentalist and conservation photographer based in Victoria, B.C. In 2012, she heard some rumours that a lone wolf had arrived on a small archipelago of islands just off the coast, close to the city but far from the nearest wolf pack on Vancouver Island.\n\nIntrigued, she set out to find him and document his life. Why did he travel so far from his home, through a busy city and across dangerous ocean currents? How does he survive on a small island without regular access to freshwater or large game like deer and elk? And why does he live alone? Alexander has spent seven years tracking and photographing the wolf, who she calls “Takaya,” in a search of answers.\n\nHer story is told in Takaya: The Lone Wolf, a documentary from The Nature of Things.\n\nWe have gathered a series of captivating photos of Takaya below and some of Alexander’s thoughts on the relationship she’s established with this rare and unique creature.\n\nImages and words from Cheryl Alexander. Note: quotes edited for clarity.\n\nThe first glimpse is what hooked me into thinking more about him and about his life out there and about him being alone.\n\nHe started to howl, it was this incredible long mournful sounding howl. It was incredibly moving.\n\n\n\nThe second time, he was fairly close to me and there was a moment when I looked deeply, directly into his eyes and it was indescribable — I’ve read that looking into the eyes of a wolf is a very powerful experience and I’ve got to say that for me, it was.\n\nEvery day when I go out it’s sort of a mystery, sleuthing out, where is he? And what is he doing?\n\n\n\nHe has such a small territory compared to a wolf pack, that means I can observe him more intimately than anyone probably has been able to do before.\n\nI've been really fortunate to be able to learn a lot about Takaya's life because he's come to trust me, he accepts my presence so he doesn't see me as a threat.\n\n\n\nTakaya definitely has places that he loves.\n\nWolves are crepuscular, which means they tend to be most active at dawn and at sunset so if I can get out there early, I'm much more likely to actually see him. He really likes sunrises and he often is in spots where he can see the sunrise.\n\n\n\nHe howls frequently and he really obviously is trying to communicate to someone or to some other wolf.\n\nI'd love to know why he howls because they are so impactful, emotionally. I'd like to know if he is lonely, does he really miss having his own kind around?\n\nMORE:\n\nVictoria’s lone wolf: After years of living alone, he may have a potential companion\n\nTakaya definitely had to adapt to survive in these islands. As far as I know, there are no other wolves that live almost a hundred per cent on marine mammals such as seals and river otters.\n\nI have a lot of questions around the challenges he faced not really knowing how to hunt seal or otter or gunnel fish. I think he perhaps learned it from observing other animals. Takaya saw them hunting and realized that he actually also could use this as prey.\n\n\n\nLone wolves are explorers, they're creatures that push the boundaries of their own world and they go out on their own. They’re risk-takers, they're animals who have to learn something new and that's what Takaya has done.\n\nHe's in an ecological niche that he would not normally be in so he's pushing the limit of what his species has been doing.\n\n\n\nTakaya can give us a perspective on his species where we can really admire the qualities of survival and resilience and strength and tenacity and respect this creature that we need to share the world with.\n\nHe really symbolizes hope for me. That the wilderness is alive and functioning as it should.\n\n\n\nI've just fallen in love with who he is, what his qualities are and how he lives his life out there.\n\nMy life has changed quite dramatically by developing this relationship. I feel really fortunate to have had been able to have the companionship of a wild creature.\n\nTo see more of Cheryl Alexander's adventures with Takaya, follow her on instagram.\n\nWatch Takaya: The Lone Wolf on The Nature of Things.", "description": "", "authors": [], "top_image": "https://www.cbc.ca/natureofthings/content/images/blog/takaya_photoessay.jpg", "published_at": "2019-10-02"}