{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201910081660/trade-hopes-lift-asian-shares-but-european-stocks-slip", "downloaded_at": "2019-10-08 09:57:50.847242+00:00", "title": "Trade Hopes Lift Asian Shares, but European Stocks Slip", "language": "en", "text": "By Caitlin Ostroff\n\n-- Asian equities rally\n\n-- LSE shares down after bid withdrawal\n\n-- Government bond yields rise\n\nGlobal stocks wavered Tuesday, with European shares slipping after a broadly higher session in Asia, amid hopes that U.S.-China trade talks this week could lead to progress in breaking the impasse between the countries.\n\nThe rises in Asia came despite the U.S. decision to add 28 Chinese entities to an export blacklist, citing their role in Beijing's repression of Muslim minorities in northwest China. China's top trade envoy, Liu He, will lead a delegation to resume trade talks with U.S. officials in Washington on Thursday, China's Ministry of Commerce said in a statement.\n\nThe Stoxx Europe 600 was down 0.4% in opening trade, after Japan's Nikkei climbed 1% and Korea's Kospi gained 1.2%. Stocks in Shanghai and Hong Kong rose 0.3% as Chinese markets returned from a holiday.\n\nShares in London Stock Exchange Group PLC fell 6% after Hong Kong Exchanges & Clearing Ltd. pulled a $36.6 billion bid for its London rival, a deal that would have united two major trading hubs.\n\nOn the trade front, China's recent large purchases from the U.S. soybean market signaled a potential thaw in relations. But China has also sought to narrow the scope of the trade negotiations, putting aside national-security issues.\n\n\"They will not reach an agreement at any price,\" said Ipek Ozkardeskaya, a senior analyst at London Capital Group. \"Despite the optimism we see, there's a chance this week ends with another disappointment.\"\n\nThe yield on 10-year Treasurys rose to 1.573%, from 1.553% Monday afternoon. The yield on the 10-year German bund rose to minus 0.559%, up from minus 0.572% Monday afternoon, after data showed that German industrial output grew slightly in August. Bond yields and prices move in opposite directions.\n\nThe rise in German industrial output came as a surprise after a dismal reading on Monday of manufacturing orders for the same month. Industrial output increased by 0.3% in August over July in adjusted terms, the statistical office said. Despite the better-than-expected output, the industry remains in a downturn, the Ministry of Economics said.\n\nOptimism in the U.S.-China negotiations was also visible in commodities prices. Global oil benchmark Brent crude gained 0.7% to $58.75 a barrel, and gold fell 0.5%.\n\nWrite to Caitlin Ostroff at caitlin.ostroff@wsj.com\n\n(END) Dow Jones Newswires\n\nOctober 08, 2019 04:24 ET (08:24 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-08"}