{"pub": "reuters", "url": "https://reuters.com/article/us-usa-trump-whistleblower-ads/harris-leads-u-s-democrats-in-facebook-ads-on-impeachment-biden-absent-idUSKBN1WH2KB", "downloaded_at": "2019-10-03 07:41:57.928868+00:00", "published_at": "2019-10-02", "title": "Harris leads U.S. Democrats in Facebook ads on impeachment; Biden absent", "language": "en", "text": "WASHINGTON/LONDON (Reuters) - U.S. Senator Kamala Harris is funding the most new Facebook ads calling for President Donald Trump’s impeachment among the 19 Democrats seeking their party’s nomination to face the Republican president in the November 2020 election, a Reuters review of Facebook ad data shows.\n\nFILE PHOTO: Democratic 2020 U.S. presidential candidate and U.S. Senator Kamala Harris (D-CA) takes the stage at the New Hampshire Democratic Party state convention in Manchester, New Hampshire, U.S. September 7, 2019. REUTERS/Gretchen Ertl/File Photo\n\nNoticeably absent from tallies of Democrats’ pro-impeachment ads is former Vice President Joe Biden, a leading presidential contender who is at the center of the Ukraine controversy involving a call between Trump and Ukraine’s president that led to last week’s launch of a House impeachment inquiry against the president.\n\nHarris, whose “Dude gotta go!” slogan on Trump’s presidency has become a signature chant at her rallies, ran more than 420 Facebook ads that mentioned the words “impeach” or “impeachment” in the week through Monday, according to a Reuters analysis of Facebook ad data gathered by the Online Political Ads Transparency Project.\n\nThat represents the majority of the more than 570 new ads by Democratic candidates that week that mentioned impeachment.\n\n(Graphic: Impeachment_buzz, here)\n\n“No one is above the law. He must be impeached,” according to an ad run by Harris’ Facebook page on Sept. 24.\n\nThe ads are part of an effort by Harris’ campaign, which has been struggling in opinion polls in recent weeks, to position her as a candidate who can take on Trump. In calling for impeachment, Harris, a former California attorney general, has said she is ready to “prosecute the case” against Trump.\n\nThe U.S. senator from California also sent a formal letter to Twitter this week asking the company to suspend Trump’s account. Harris’ campaign did not respond to a Reuters request for comment.\n\nBy contrast, Biden, who said last week he would support impeachment if Trump does not cooperate with Congress, has not run any ads on his Facebook page with the word “impeach” or “impeachment” in the ad data examined by Reuters, which covered ads launched between May and September, including the week after the impeachment probe opened.\n\nThe references that Biden does make to the controversy in Facebook ads focus more on the personal nature of Trump’s request in a July phone call that Ukrainian President Volodymyr Zelenskiy investigate Biden and his son Hunter - the incident that led to the impeachment inquiry.\n\nTrump has repeatedly insisted, without evidence, that Biden used his influence as vice president to kill an investigation of a Ukrainian energy company of which Hunter Biden was a board member.\n\n“Donald Trump asked a foreign leader for a ‘favor’ in an attempt to manufacture a smear campaign against me,” one Biden ad read.\n\nHarris was followed in the tally of impeachment-themed ads by U.S. Senator Cory Booker, who launched at least 99 such ads in the week through Monday. Next was U.S. Senator Bernie Sanders, who ran at least 32.\n\nThe ad data published by Facebook, which was collected by computer scientists at the Tandon School of Engineering at New York University, includes ad text but not photos or videos.\n\nSome of Harris’ ads call on supporters to sign a card thanking House of Representatives Speaker Nancy Pelosi for opening the inquiry, a tactic through which candidates can build their list of potential voters.\n\nTRUMP FUNDRAISING BLITZ\n\nThe candidates’ differing approaches reflect the fact they “each have their own messages and are likely going after different segments of the Democratic base,” said Kyle Tharp, a spokesman for ACRONYM, a progressive organization which tracks political digital spending.\n\nTrump, the top spender on Facebook ads by any presidential candidate, is also running the most ads about impeachment, launching at least 1,900 in the week through Monday that mention “impeach” or “impeachment.”\n\nThe Trump campaign has used the inquiry, which he has assailed as a fraud and hoax, to ramp up a fundraising blitz. The campaign said it raised $15 million in 72 hours after Pelosi’s impeachment inquiry announcement.\n\n“Every time Democrats think they’ve got something to take President Trump down, it just makes him and his campaign bigger, badder, and better than before,” said Erin Perrine, a Trump campaign spokeswoman.\n\nSome of Trump’s Facebook ads ask voters to donate to the ‘Official Impeachment Defense Fund.’ They describe the impeachment effort as a Democratic plan to steal next year’s election, or as a product of an “unhinged socialist mob” that includes Pelosi and Democratic Representative Alexandria Ocasio-Cortez.\n\n“Donald Trump is in full panic mode and his campaign is being forced to spend millions of dollars on impeachment,” said Kevin Mack, lead strategist of Need to Impeach, the super PAC (political action group) founded by billionaire Democratic candidate Tom Steyer.\n\nThe group on Tuesday announced a roughly $3 million push in TV and digital ads targeting Senate Republicans over impeachment.", "description": "U.S. Senator Kamala Harris is funding the most new Facebook ads calling for President Donald Trump's impeachment among the 19 Democrats seeking their party's nomination to face the Republican president in the November 2020 election, a Reuters review of Facebook ad data shows.", "authors": ["Jason Lange", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191002&t=2&i=1436413803&w=1200&r=LYNXMPEF911XA"}