{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/kik-messenger-saved-from-the-verge-of-shutdown", "downloaded_at": "2019-10-22 13:19:46.819151+00:00", "title": "Kik Messenger Saved From the Verge of Shutdown", "language": "en", "text": "On Oct. 13, Canadian social media and messaging app Kik revealed it’s “here to stay.” This was an apparent reversal from what the company's CEO, Ted Livingston, said in a blog post — that it was considering shutting down.\n\nIt became clear just five days later why it was “here to stay.” A Santa Monica-based holding company, MediaLab, had signed an agreement with Kik Interactive to buy its Kik messaging platform.\n\nFrom angel investment to $100M ICO\n\nBack in 2009, a group of students from the University of Waterloo in Canada came together to create new technologies for use on smartphones. In October 2010, Kik Interactive was launched, reaching a million users in under 15 days. The company demonstrated that Twitter could be a powerful tool to run a marketing campaign, as the social media was the chief catalyst.\n\nWhile developing the project, the students had received $4.7 million in angel investment. In just over a year, on March 7, 2011, the company raised $8 million in a Series A investment round. The expansion efforts continued, and in April 2013, the company managed to raise another $19.5 million in Series B funding, with Foundation Capital being the lead investor.\n\nThe messenger started to gain global traction, and the need for rapid expansion continued. It raised $38.3 million in a Series C round of funding. Kik got a major break in fundraising in August 2015, when it received a $50 million investment from Chinese internet giant Tencent, the parent company of Chinese messaging service WeChat. With this investment, the company gained the prestigious “unicorn” status.\n\nHowever, in 2017, Kik decided to not go through the traditional route of raising funds through venture capitalists, instead opting for an in-trend option, an initial coin offering (ICO). The company managed to raise $100 million from more than 10,000 participants in 117 countries. Alina Kiselevich, a communication analyst at Enigma Securities, told Cointelegraph:\n\n“Looking back at the crypto-world of 2017 it is impossible to say that Kik’s move wasn’t a shot worth taking, considering the financial weather for the company back then and the ‘challenges’ in late 2016 and early 2017, prior to the ICO. Only the future resolution with SEC will show the real definition of the current situation, helping the community understand if Kik had to stick to the traditional VCs in case it would turn out to be a disaster or if it was a well-thought out plan.”\n\nKik vs. the SEC\n\nHowever, due to the sheer volume of illegal ICOs taking place in 2017, the United States Securities and Exchange Commission (SEC) began to intervene in the crypto space, which meant increased scrutiny for Kik. The first subpoena was issued by the SEC in January 2018, followed by eight more in the following five months.\n\nThe primary complaint the SEC had against Kik was that the firm had been involved in the sale of unregistered securities. Ever since the subpoena was opened, Kik had been fighting an uphill battle with the SEC. The SEC painted a picture of Kik Interactive Inc. being a cash-strapped company on its last legs. The ICO, according to the regulators, was the last attempt to save the company from certain failure.\n\nKik’s ICO for the Kin (KIN) token took place over two weeks, from Sept 12 to Sept 26, 2017 and was one of the most successful ICOs ever. It raised 168,732 ETH, or around $50 million from 10,026 individuals spread across 116 countries. An additional $50 million was raised from institutional investors. However, it fell short of its fundraising target of $125 million.\n\nAccording to the SEC, Kik had potentially violated Sections 5(a) and 5(c) of the 1933 Securities Act, which prohibit the sale of securities that are not registered with the commission. Kik was aggressive in its refute to these claims, stating that \"Kin is exempt from the federal securities laws\" because it \"possesses all the characteristics of a currency like Bitcoin and Ether,\" which the commission has deemed not to be securities.\n\nPrice of Kin since the investigation began. Source: Coin360.com\n\nSince the SEC allegations in June 2018, the price of the Kin token has dropped by 71%. Many in the crypto space came out in support of Kik and Livingston. Anthony Pompliano (aka Pomp), founder of Morgan Creek Digital Assets, hosted Livingston on his “Off the Chain” podcast on May 30. Empathizing with the troubled CEO, Pomp said, \"I think that there are a lot of people who are paying attention to what you guys are doing, and frankly cheering for you guys to help get some clarity.\"\n\nRegarding Kik’s ICO, Robin Meijer, an online marketing strategist at Netherlands-based crypto brokerage firm Bitcoin Meester, alleged that Kik knew it was in a legal grey area, telling Cointelegraph:\n\n“I think KIK knew it wasn’t legal. Every country has its own legislation about ICO’s now but I think they could have foreseen that this wouldn’t end well, even if they launched it before there were any clear regulations. Since early 2018 governments and financial institutions have done their best at trying to regulate ICO's. KIK launched its ICO in 2017 when the regulations were almost non-existent. I feel like KIK is being used as an example for other ICO's.”\n\nTo raise both awareness and money, Livingston launched the Defend Crypto fund. The fund was taken over by the Blockchain Association, a collective of advocates involved with the blockchain industry. The Defend Crypto fund has raised $5 million to fight the charges brought by the SEC and an additional $1.6 million strictly allocated to non-Kik initiatives. David Pring-Mill a consultant for tech startups and the director of Hyperloop Advanced Research Partnership, told Cointelegrpah:\n\n“Kik Interactive had its back against the wall. They were competing against Facebook, a company that verges on monopoly status when it comes to digital interactions. And Kik was trying to do something similar, albeit with a more defined target market. ICOs can facilitate the same purpose as IPOs but without the paperwork, safeguards, transparency, and oversight. Kik is objecting to the SEC's framing of the matter but I think that the agency was right to go after this.”\n\nMediaLab buys Kik Messenger\n\nIt seemed that the desperate efforts to raise funds to fight off the case from the SEC were falling short, and the financial troubles put Kik at risk of losing its business and numerous employees their jobs.\n\nOn Sept. 24, the company’s CEO revealed that it would be shutting down the Kik app, reducing its staff to 19 people and focusing on the development of the Kin token. Even with an 80% reduction of its staff, Livingston was adamant about fighting tooth and nail with the SEC. He estimated that the closure of the platform would drop its burn rate by 85% and the resources would be directed to the SEC trial.\n\nRelated: KIK Closes Messenger and Lays Off Staff to Continue SEC Lawsuit Fight\n\nHowever, those austerity measures never materialized, as on Oct. 14, Kik announced that it was “here to stay” and confirmed on Oct. 18 that MediaLab will be the new owner of Kik, potentially giving hope to the platform’s userbase and employees. Santa Monica-based MediaLab, which also owns the messaging app Whisper and music sharing platform DatPiff, took up the task of maintaining and improving the Kik Messenger app.\n\nThe blog post for the announcement said that MediaLab saw “something truly special” with Kik, adding that they both are “non-conformists”. MediaLab has plans to improve the Kik messenger, starting with taking suggestions from the community. Although prior to the audience suggestions, it had some ideas on how to improve the app. It wants to make “the app faster, more reliable, & less buggy,” as well as eradicate spam bots.\n\nNow, Livingston will be running his team with a sole focus on cryptocurrencies. However, the MediaLab team will be in close partnership with Livingston’s team to further expand on Kin’s integration.\n\nEven though some of the company’s financial troubles are solved, the legal vows still continue. The new plans to fight the SEC haven’t been revealed by either of the companies. The plans for a new monetization model have not been revealed yet. Kik has struggled with traditional advertising, and even declined a potential deal because the business model of the proposed acquirer was to collect and sell data. When asked about MediaLab’s motives behind buying Kik, Alina of Enigma security told Cointelegraph:\n\n“The fact that they did not state anything or mentioned the lawsuit now, might tell us two things: either MediaLabs only buys out the app for the further development and leaves the financial problems to the ex-leadership, or they buy out everything completely, adopting each and every aspect of the company. For now it is hard to tell which route the new leadership will follow as it completely depends on the terms of the LOI between the parties, which for now have not been disclosed.”\n\nCointelegraph has reached out Livingston and his team, but they declined to comment on this matter.", "description": "Kik almost went to the verge of shutting down because of its lawsuit with the SEC. A buyout from MediaLab saved it", "authors": ["Sritanshu Sinha"], "top_image": "https://images.cointelegraph.com/images/740_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy80ZDVlYTY5ZDdmZGQzNDc3YmFmMTc3OTAzZjk0MzQwMi5qcGc=.jpg", "published_at": "2019-10-22"}