{"pub": "usatoday", "url": "https://usatoday.com/story/news/politics/2019/10/25/trump-impeachment-inquiry-why-didnt-doj-look-harder-ukraine-call/4024155002", "downloaded_at": "2019-10-25 15:58:07.938188+00:00", "title": "As Trump impeachment probe heats up, some say Congress is doing inquiry the Justice Department should've done", "language": "en", "text": "CLOSE Public opinion polling has shown noticeable shifts in attitudes towards impeachment, though every single poll has asked about impeachment differently. USA TODAY\n\nWASHINGTON – At the time, the disclosure was offered almost as a footnote to the explosive contents of a phone call in which President Donald Trump pressed his Ukrainian counterpart to investigate political rival Joe Biden.\n\nAs a summary of the call was released by the White House last month, senior Justice Department officials, who spoke on the condition that they not be identified, said prosecutors had reviewed whether the president’s solicitation of Ukraine President Volodymyr Zelensky was a potential crime.\n\nThe review, done at the request of the inspector general of the Intelligence Community, was narrow.\n\nIt was based entirely on the written summary of the call, which even the White House indicated was imperfect. Authorities conducted no interviews to learn why a whistleblower took the extraordinary step of taking his concern to the inspector general for the nation's intelligence agencies.\n\nRussia probe: DOJ inquiry into origins of Russia investigation has shifted to criminal probe\n\nAnd it took only a few weeks for prosecutors to conclude there was no violation of campaign finance law.\n\nYet in the month since that decision was made public, a fast-moving House impeachment inquiry and a separate criminal investigation raise serious questions about the Justice Department’s assessment of the president’s conduct.\n\n\"In hindsight, the decision by prosecutors was premature and ill-advised,\" Richard Ben-Veniste, one of the Watergate prosecutors, said. \"The information provided by the whistleblower cried out for further inquiry.\"\n\nJustice Department officials say Attorney General William Barr, whose assistance Trump offered to Zelensky, was not the one who decided to decline an investigation.\n\nBut lawmakers and former prosecutorssay his close relationship with Trump threatens the department'sindependence as the president faces his greatest threat yet.\n\nThose suspicions are likely to deepen after news broke Thursday night that the Justice Department has shifted an internal examination into the origins of the Russia investigation – which Trump often disparages as a \"witch hunt\" – to a criminal matter.\n\nRead the summary: President Trump's call with Ukraine president about Biden\n\nHouse Intelligence Committee Chairman Adam Schiff, D-Calif., who is leading the impeachment inquiry, said the Justice Department’s decision not to launch an investigation based on the whistleblower’s complaint effectively forced Congress to look into the matter itself.\n\nIn just four weeks, House Democrats have elicited damning testimony from current and former administration officials that bolsters their central argument for removing Trump: that the White House dangled military aid and a meeting with the president in an effort to get Ukraine to investigate Biden and his son Hunter Biden.\n\n“Unlike in past impeachment proceedings in which Congress had the benefit of an investigation conducted in secret by an independent prosecutor, we must conduct the initial investigation ourselves,\" Schiff said last week, referring to the Watergate investigators who pursued Richard Nixon and the Whitewater prosecutors who scrutinized Bill Clinton.\n\n\"This is the case,\" he said, \"because the Department of Justice under Bill Barr expressly declined to investigate this matter after a criminal referral had been made.\"\n\nChaotic scene: GOP protest temporarily halts impeachment deposition of Defense official Laura Cooper\n\n'I would like you to do us a favor'\n\nIt is illegal for a political candidate to solicit or receive anything of value from a foreign source. Justice officials said they decided not to move forward with a campaign finance inquiry because they concluded the president's request for an investigation had no quantifiable value. The conclusion, officials said, was rendered by Criminal Division chief Brian Benczkowski.\n\n\"The department's Criminal Division reviewed the official record of the call and determined, based on the facts and applicable law, that there was no campaign finance violation and no further action was warranted,\" the Justice Department said in a statement last month.\n\nThe department also concluded the whistleblower's complaint did not have to be shared with Congress, setting up a showdown between the two branches of government.\n\nSince then, the whistleblower's complaint has been corroborated by closed-door testimonysuggesting Trump and his personal attorney, Rudy Giuliani, had long worked to secure Ukraine not against Russian aggression, but as part of the president's reelection strategy.\n\nPresident Donald Trump and Ukrainian President Volodymyr Zelensky at a U.N. meeting in New York on Sept. 25, 2019. (Photo: Saul Loeb/AFP via Getty Images)\n\n\"A number of questions needed answering, and relevant people interviewed,\" Ben-Veniste, the Watergate prosecutor, said. Such as: \"Who was involved in speaking for President Trump in Ukraine prior to this call (with Zelensky), and whether the 'ask' the president was making had been considered by the State Department or our ambassador to the Ukraine.\"\n\nThree House committees are asking those questions now. The marathon sessions have produced eye-opening testimony from a string of witnesses.\n\n'Crazy' and a 'hand grenade': Here's how House impeachment witnesses describe elements of Trump's Ukraine policy\n\nLast week, Gordon Sondland, the top U.S. diplomat in Europe, conceded that Trump had delegated Ukraine policy largely to Giuliani, rather than career State Department officials.\n\nTuesday, William Taylor, Trump's top diplomat in Ukraine, told lawmakers there was an understanding that the release of hundreds of millions of dollars in military aid from the U.S. was contingent on the Ukrainian government announcing publicly that it would investigate the Bidens.\n\nNeither the former vice president nor his son have been accused of wrongdoing by the Ukrainian government.\n\nCLOSE Republicans disrupted a closed-door deposition Wednesday with a Defense Department official who was scheduled to answer questions as part of the House impeachment inquiry into President Donald Trump. (Oct. 23) AP, AP\n\nThose back-channel efforts culminated in the July 25 telephone call between Trump and Zelensky. After the Ukrainian president said he wanted to buy more military equipment from the U.S., Trump shifted the conversation with this comment: \"I would like you to do us a favor.\"\n\nThe message was clear, said Patrick Cotter, a former federal prosecutor.\n\n“Anybody over the age of 12 knows that what the president was seeking was something of great personal value; it is very valuable to get opposition research on your opponent,\" Cotter said. \"Ask any political consultant what they charge. In this case, multiply that by 1,000.\"\n\nCLOSE Impeaching a U.S. president might not be the be-all-end-all for their career. We explain why this is the case. Just the FAQs, USA TODAY\n\nRobert Ray, who served as an independent counsel in the Whitewater investigation of President Bill Clinton, defended the Justice Department's decision not to take up the inspector general's criminal referral.\n\n\"You can argue that anything the president does is potentially to his political benefit,\" Ray said. \"It would be very difficult to turn that (Zelensky call) into some in-kind political contribution. It's a ridiculous argument.\"\n\nRegardless of what the Justice Department concluded based on the phone call alone, \"the testimony and text messages that are now out there is new evidence,\" Cotter said. \"New evidence is always a valid reason to reconsider opening an investigation.\"\n\nImpeachment inquiry: Trump ambassador 'disappointed' with Rudy Giuliani's influence in Ukraine policy\n\nKey takeaways: Ukraine diplomat Bill Taylor's 'explosive' opening statement\n\nAsked whether the Justice Department is reconsidering the matter based on the new disclosures, an official referred to the department's initial statement stating that \"no further action was warranted.\"\n\nHowever, the official said the decision not to proceed with a campaign finance investigation would not prevent authorities from reviewing other Ukraine-related matters, if they warranted investigation.\n\nThe official declined to comment on whether any such reviews are underway.\n\nUkraine probe: Federal investigators have been looking into Giuliani's dealings in Ukraine since early 2019\n\n'I am also going to have Attorney General Barr call'\n\nThe moment Trump hung up with Zelensky, he probably didn't expect even a summary of the call to become public. But when it was, the president thrust the Justice Department – and Barr – into a uniquely fraught position.\n\nDuring the 30-minute conversation, Trump repeatedly offered the attorney general and Giuliani's help in launching an investigation of the Bidens. Trump invoked the attorney general by name or title four times.\n\n\"I will have Mr. Giuliani to give you a call, and I am also going to have Attorney General Barr call and we will get to the bottom of it,\" Trump said after falsely suggesting that former Vice President Biden had halted an investigation of a Ukrainian energy company while Hunter Biden served as a board member.\n\nOn the ground in Ukraine: Trump's conspiracy theories thrive in Ukraine, where a young democracy battles corruption and distrust\n\nIn the July 25 telephone call conversation with Ukraine President Zelensky, Trump refers to Attorney General William Barr and his personal lawyer Rudy Giuliani several times. Seen here, President Trump hands over the podium to Attorney General William Barr while participating in an announcement on US citizenship and the census in Washington, DC, on July 11, 2019. (Photo: MICHAEL REYNOLDS, EPA-EFE)\n\nThe Justice Department maintains Barr knew nothing about Trump's entreaties until weeks later and didn't communicate with Ukrainian officials. Yet Trump's comments have stoked fresh questions about the attorney general's independence from the White House.\n\nThose criticisms were first leveled earlier this year when Barr announced that no obstruction charges were warranted against the president based on special counsel Robert Mueller's investigation into Russian election interference.\n\nHouse Judiciary Committee Chairman Jerry Nadler, D-N.Y., immediately called for Barr to recuse himself from future consideration of any Ukraine-related matters. That didn't happen.\n\nJustice Department officials and Barr's supporters have scoffed at suggestions the attorney general is compromised. Earlier this month, federal agents arrested two Giuliani associates on campaign finance charges. The pair assisted Giuliani in his campaign to pressure Ukrainian officials to investigate Biden's family, though the charges aren't related to those efforts.\n\n'Smear campaign': Giuliani associates Parnas and Fruman plead not guilty to campaign finance charges\n\nThat investigation is being headed by Manhattan U.S. Attorney Geoffrey Berman, whose office has long enjoyed a measure of independence from Washington.\n\nA Justice Department official said Barr was briefed on the inquiry shortly after he took over as attorney general in February. He was alerted before the men were arrested at Dulles International Airport as they boarded a flight to Europe with one-way tickets.\n\n“A public official has as much a duty not to recuse himself than to recuse himself.” Michael Mukasey, a former attorney general during the George W. Bush administration\n\nMichael Mukasey, a former attorney general during the George W. Bush administration, said Barr shouldn't be penalized for not knowing Trump mentioned him in the Zelensky call. He believes the Justice Department made the right call in not launching the campaign finance inquiry.\n\n\"There is no basis for recusal,\" Mukasey, a close ally of Barr, said. \"It doesn't create an actual conflict because somebody (Trump) was hallucinating. That should be the end of it. A public official has as much a duty not to recuse himself than to recuse himself.\"\n\nBruce Udolf worked the Clinton Whitewater investigation as an associate independent counsel. He disagrees with Mukasey's conclusions.\n\n\"Justice's decision should come as no surprise,\" Udolf said. \"This administration has sought to intimidate the FBI and tried to co-opt the Justice Department. The Justice Department should be doing what the Congress is doing now. It just doesn't pass the straight-face test.\"\n\nRead or Share this story: https://www.usatoday.com/story/news/politics/2019/10/25/trump-impeachment-inquiry-why-didnt-doj-look-harder-ukraine-call/4024155002/", "description": "Testimony in the impeachment inquiry has corroborated a whistleblower's complaint and raises questions about the Justice Department's review.", "authors": ["Kevin Johnson", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/07/24/USAT/82e82b3a-e0ec-40a5-9afd-a1ceff067d94-XXX__JG_138167_Mueller_Intellig_7_24_jmg_12748.JPG?crop=5166,2906,x0,y34&width=3200&height=1680&fit=bounds", "published_at": "2019-10-25"}