{"pub": "nytimes", "url": "https://nytimes.com/interactive/2019/10/18/opinion/old-age-president-2020.html", "downloaded_at": "2019-10-18 10:35:31.267995+00:00", "title": "Opinion | Out With the Old, In With the Young", "language": "en", "text": "Back\n\nNext\n\nOpinion Out With the Old, In With the Young\n\nIt’s not just that President Trump is a well-seasoned 73 and his three top Democratic Party challengers are also septuagenarians. The average senator is now almost 63 and the average member of the House nearly 58, making them roughly 20 years older than their average constituent, and nearly a decade older than they were in 1981.\n\nOlder people today hold disproportionate power because they have the numbers and the means to do so. People 65 and older, for example, are more than three times as likely to make political donations as those under 30. As a result, their voices, amplified by money, carry farther politically than those of the young and impecunious.\n\nThere are a lot of voices in their chorus. The American electorate is the oldest it’s been since at least 1970 and is graying at a rapid clip, with the well-off living longer than ever before. By 2034, according to the Census Bureau, the population 65 and older will exceed the population under 18; by 2060 the 65-and-older crowd is projected to have almost doubled. There are some 74 million baby boomers alone, and when election time comes, they turn out in droves. During the 2018 midterms, 64 percent of citizens ages 54 to 72 cast a ballot, compared to 31 percent of eligible voters 29 and under.\n\n“Money, numbers and power have been inexorably accruing to the aging ‘baby boomer’ generation for the last few decades,” the political scientist John Seery warned in his 2011 book “Too Young to Run?” The trends show no signs of slowing. Migration to metropolitan centers by people who tend to be younger and more diverse, along with rural depopulation and aging, will only intensify age-based inequities given the geographic biases of the American electoral system. Call it the coming gerontocracy.\n\nWhile significant divisions exist within every age cohort (many older people in this country are progressive and poor, just as some young people are rich and right-wing), the divisions between older and younger generations are becoming increasingly salient. Of course, young people are not intrinsically enlightened or virtuous compared to their elders — as someone who just turned 40, I certainly hope that’s not the case — and our society desperately needs older people to participate in public life.\n\nBut our democracy is in a moment of crisis. People are, for good reason, losing faith in institutions, parties and political processes and questioning longstanding assumptions. Everything, it seems, is up for grabs. The lack of intergenerational justice, of equity between the young and old, is an underappreciated facet of the current turmoil: A hoary establishment hoards influence, curtailing young people’s ability to effect change.\n\nWhere Older and Younger Voters Differ Automatic voter registration Universal savings account Free college for all students Registering people to vote when they apply for licenses and IDs at motor vehicle offices, Medicaid offices, health care exchanges and other public agencies. Raising taxes on income in excess of $200,000 by 5% to cover tuition for all students, and capping rises in tuition at the rate of inflation for all colleges accepting such funding. Giving Americans $5,000 savings accounts at birth that they can use when they turn 18, paid for by raising taxes on estates worth $10 million. 100% Support 18-29 years old More Support 80 40-49 30-39 50-64 65+ 68% average 60 57% average Less Support 46% average 40 Greenhouse gas fees Medicare Expansion The system is stacked against people like me.” Levying pollution taxes on companies that emit high levels of greenhouse gases. Making Medicare the main health insurance provider for all Americans. People who agree with this statement. 100% Support 80 78% average 60 58% average 48% average 40 Source: YouGov Where Older and Younger Voters Differ Automatic voter registration Free college for all students Registering people to vote when they apply for licenses and IDs at motor vehicle offices, Medicaid offices, health care exchanges and other public agencies. Raising taxes on income in excess of $200,000 by 5% to cover tuition for all students, and capping rises in tuition at the rate of inflation for all colleges accepting such funding. 100% Support 18-29 years old More Support 80 40-49 30-39 50-64 65+ 68% average 60 57% average Less Support 40 Greenhouse gas fees Medicare Expansion Levying pollution taxes on companies that emit high levels of greenhouse gases. Making Medicare the main health insurance provider for all Americans. 100% Support 80 78% average 60 58% average 40 Universal savings account The system is stacked against people like me.” Giving Americans $5,000 savings accounts at birth that they can use when they turn 18, paid for by raising taxes on estates worth $10 million. People who agree with this statement. 100% Support 80 60 48% average 46% average 40 Source: YouGov Where Older and Younger Voters Differ Greenhouse gas fees Levying pollution taxes on companies that emit high levels of greenhouse gases. 100% Support 18-29 years old More Support 40-49 30-39 50-64 65+ 80 78% average 60 Less Support 40 Automatic voter registration Registering people to vote when they apply for licenses and IDs at motor vehicle offices, Medicaid offices, health care exchanges and other public agencies. 100% Support 80 68% average 60 40 Medicare Expansion Making Medicare the main health insurance provider for all Americans. 100% Support 80 60 58% average 40 Free college for all students Raising taxes on income in excess of $200,000 by 5% to cover tuition for all students, and capping rises in tuition at the rate of inflation for all colleges accepting such funding. 100% Support 80 60 57% average 40 The system is stacked against people like me.” People who agree with this statement. 100% Support 80 60 48% average 40 Universal savings account Giving Americans $5,000 savings accounts at birth that they can use when they turn 18, paid for by raising taxes on estates worth $10 million. 100% Support 80 60 46% average 40 Source: YouGov\n\nThat is not to say that the faults in America’s political system are solely the result of its biases against the young; the problems we face are myriad and addressing gerontocracy won’t solve them all. But an antiquated system that produces unrepresentative leadership is ill equipped to respond to the problems of our time. And that should concern anyone committed to democratic ideals.\n\nA profound and growing experiential divide now fuels conflicting outlooks, material interests and political priorities. Not only is the cohort of people born after 1980 much more diverse than that of Americans now entering retirement (nearly 80 percent of Americans over 65 are white, a figure that drops to around 50 percent for people between 6 and 21) they are less well-off compared to their predecessors at the same age. (Given the persistence of racial discrimination, though, diversity and precarity cannot be neatly disentangled.)\n\nContrary to stereotypes, polls show that young people across the political spectrum are deeply concerned about the state of the world. This concern has translated into rising youth voter turnout and a resurgence of protest movements. On a range of issues, including global warming, gun control, economic inequality, racism, immigration and trans rights, youth-led movements are creating a generational insurgency.\n\nBut this insurgency faces major obstacles. From age limits on voting and eligibility for office, to the way House districts are drawn, to the problem of money in politics, our modern political system is stacked against the young. These barriers need to be openly acknowledged and broken down.\n\nStudents marched from the White House to the Capitol to protest gun violence in March. Leigh Vogel for The New York Times\n\nWe the (Old) People\n\nBlack and indigenous people, white men without property, women and some religious groups were all excluded from America’s original democratic compact. So were young people, though we rarely consider this fact.\n\nIn “Too Young to Run?” Professor Seery argues that the Constitution effectively treats young people as second-class citizens by imposing minimum age requirements for elected federal office: 25 for Congress, 30 for the Senate, and 35 for president. The nation’s framers, the youngest of whom was 26, Professor Seery writes, “bequeathed an age bias unto posterity by which they themselves did not fully abide,” devising rules ensuring that the country would be governed by people more senior than themselves. (The founders no doubt knew a Latin root of the word “senator,” senex, means “old man.”)\n\nThe geographically based idiosyncrasies of American democracy that the founders put in place compound the problem. On average, ballots cast by older people hold more weight and are less frequently “wasted” than those of the young. (Wasted votes are those garnered in excess of what a candidate needs to win; in our winner-take-all systems that means anything over 50 percent.) Clustered in sparsely populated states and counties, voters who are older, whiter and wealthier get a boost: Older Americans wield disproportionate sway over the Electoral College, the Senate and a gerrymandered Congress.\n\nMigration patterns worsen these trends. A growing percentage of young people now dream of city life, but their preferences inadvertently reduce their political clout: “18 percent of rural residents are 65 or older versus 15 percent in suburban and small metro counties and 13 percent in cities,” the Pew Research Center reported last year. Millennials, concentrated in metropolitan areas, are the predominant generation of potential voters in only 86 congressional districts, while boomer voters predominate in 341. By 2040, 70 percent of Americans are expected to live in the 15 most populous states; that would mean that 70 percent of America will be represented by only 30 senators.\n\nNot Your Grandfather’s Generation Gap\n\nOn Sept. 20, millions of people around the world took to the streets as part of the youth-led Global Climate Strike, a week of protests timed with the United Nations climate summit. The movement began when the 16-year-old Swedish environmental activist Greta Thunberg stopped attending classes to protest government failure to curb greenhouse gas emissions. (Ms. Thunberg said she was inspired by the anti-gun violence walkouts led by high school students from Parkland, Fla.)\n\nOne of the young Americans who took up Ms. Thunberg’s call to action was Haven Coleman, a 13-year-old from Colorado. A co-founder of the national group U.S. Youth Climate Strike, she began skipping school every Friday to head to the steps of the State Capitol in Denver. Older people often stop to tell her they don’t understand why she’s protesting. “Because you didn’t do it,” she replies.\n\nJerome Foster II, founder and executive director of One Million of Us, an organization focused on young voter turnout, speaking outside the Capitol this month. Ting Shen for The New York Times\n\nThe environment is one of the critical lines separating the old from the young. Baby boomers may have helped organize the first Earth Day in 1970, but back then ecological disaster was a more distant threat. Today, intimate knowledge of planetary devastation, from hurricanes to forest fires, is distressingly common. When the Colorado hills burn, Ms. Coleman’s asthma flares up.\n\nThe other critical divide is the economy. The boomers who came of age in the 1950s and ’60s benefited from boom times while millennials and Generation Z have been dogged by the aftermath of the mortgage meltdown, an underwhelming recovery and Gilded Age levels of inequality. One generation enjoyed a comparatively high minimum wage, affordable college tuition and reasonable costs of living; for everyone after, stagnating wages, ballooning student debt and unaffordable housing have become the norm.\n\n“Millennials are less well off than members of earlier generations when they were young,” a 2018 report by economists from the Federal Reserve Board bluntly states. Other economists have shown that a household headed by someone born in 1970 has a quarter less income and 40 percent less wealth than one headed by a comparable person born in 1940. In contrast, between 1989 and 2013, only the cohort of families headed by people at least 62 saw an increase in median wealth. Older people are more likely to own property, stocks and other assets — and, consequently, to prefer policies that will keep the values of those assets high. No wonder so many young people have pivoted left, rejecting conventional wisdom about the virtues of unfettered capitalism.\n\nJust as affluence translates into political power, being comparatively precarious creates a disempowering feedback loop. Burdened by student loans, young people are postponing home ownership, marriage and starting families. As a result, they are less likely to feel they have a stake in the communities where they live, which means they are less likely to participate politically and thus have their interests adequately represented. This puts policies overwhelmingly favored by the young at a further disadvantage.\n\nVotes for Children\n\nSome might argue that the problem of gerontocracy isn’t really a problem at all. Even if young people do not have equal political rights as older people, it evens out eventually; young people actually do possess the same political rights as their elders, just not yet.\n\nThe limits of this “be patient and wait your turn attitude” were on display in February, when protesters associated with the youth-led Sunrise Movement clashed with Senator Dianne Feinstein of California, then 85, over the need for a Green New Deal. In a video of the encounter, a group ranging in age from 11 to 24 insist that Ms. Feinstein is duty-bound to listen to their concerns about the warning by the Intergovernmental Panel on Climate Change that we have just over a decade to avert the worst effects of global warming. “Well, you didn’t vote for me,” the senator says, dismissing a girl who says she is 16.\n\nFor any adult with half a conscience, the senator’s remarks held up a discomfiting mirror, a reminder of our complicity in the present crisis. For younger viewers, it encapsulated a growing sense that many older people, even those who are ostensibly liberals, are dangerously blasé about the future — and that their willingness to play with fire stems from their belief that they won’t live long enough to get burned.\n\nA month after the confrontation with Ms. Feinstein went viral, getting more than 10 million views, Representative Ayanna Pressley of Massachusetts introduced a proposal to lower the federal voting age to 16. Since the era of Plato’s Republic, aged-based exclusions have almost always been justified in terms of youthful immaturity and the wisdom that comes with experience. Ms. Pressley instead highlighted the fact that young people have their own distinct experiential wisdom:\n\nA 16-year-old will bring with them the 2019 fears that their father’s insulin will run out before the next paycheck.\n\nA 17-year-old will bring with them the 2019 hopes to be the first in their family to earn a college degree.\n\nA 17-year-old will bring with them a 2019 solemn vow to honor the lives of their classmates stolen by a gunman.\n\nThe proposal failed by 126 to 305, an outcome in line with the likely result if the matter was put to a popular vote: A full 75 percent of registered voters oppose enfranchising 17-year-olds; 84 percent oppose it for 16-year-olds. (Individual states, however, may lower the voting age for state and local elections.)\n\nDavid Runciman, a professor of politics at Cambridge, disagrees with mainstream public sentiment. The structural disenfranchisement of young people, he argues, must be remedied by even more drastic measures. His proposal: Enfranchise everyone over the age of 6. “What’s the worst that could happen?” he asked on a podcast last year. Given the current president of the United States, it’s not clear that letting kids vote would yield worse outcomes than what adults have delivered.\n\nFor Professor Runciman, the fundamental issue is fairness. He points to the 2016 Brexit vote, in which 73 percent of the 18-24 age group cast a ballot for Remain when more than 60 percent of 65 and older voted Leave. Hundreds of thousands of people who were too young to vote will have to spend their entire lives dealing with the repercussions of a nostalgic, ill-considered decision made by people not long for this earth.\n\nIt turns out there are plenty of pragmatic reasons to lower the voting age, if not to 6 then to 16. And not just because politicians like Senator Feinstein would have to listen to kids about global warming.\n\nEvan Hunt, 9, argued for lowering the voting age at a city council hearing in Hyattsville, Md., in 2015. Jabin Botsford/The New York Times\n\nIn 2013, Takoma Park, Md., became the first city in the United States to lower the voting age for local elections to 16. The turnout rate of 16- and 17-year-olds in the next election was nearly twice that of those 18 and older, inspiring the nearby town of Hyattsville to follow Takoma Park’s example.\n\nSomething similar happened in local elections in Norway in 2011, when 21 municipalities conducted a trial lowering the voting age from 18 to 16. A range of studies support the conclusion that 18 is not the optimal age to bestow the right to vote; people are leaving the nest and too preoccupied navigating college and work to figure out how to cast a ballot, let alone register to do so.\n\nIt is also the case that voting, though typically regarded as the paramount individual right, is actually a social affair. Research conducted in Denmark shows that having children old enough to vote at home makes their parents more likely to vote as well. And it’s habitual: Once you vote, you are more likely to do it again. A person’s first election is critical, a kind of democratic gateway drug, and it’s best to get him hooked young.\n\nSixteen seems a reasonable time to start. And lowering the voting age might also encourage more young people to run in the local and state races where the Constitution’s age restrictions do not apply.\n\nVote and Revolt\n\nIf our goal is to break the grip of the coming gerontocracy, giving more teenagers access to the ballot is a necessary but insufficient step. The inequities that result from the role of money in politics and our geographically based electoral system also need to be remedied. Otherwise, the power structure will keep pandering to older — and whiter and more affluent — voters.\n\nTo approach something resembling intergenerational justice, at least two additional transformations are required: campaign finance reform and a more proportional system of representation.\n\nStudents in New York walked out of school on the 20th anniversary of the Columbine school shooting in April. Holly Pickett for The New York Times Our government is the oldest it has ever been. From second left, Orrin Hatch, 85, Charles Grassley, 86, and Dianne Feinstein, 86, are the oldest living senators. Pablo Martinez Monsivais/Associated Press\n\nThe imbalance of financial resources between the young and the old puts a generational twist on a longstanding conundrum: The concentration of political power that flows from concentration of wealth is anathema to the principle of political equality. A teenager working for minimum wage or a young parent struggling with student debt should have the same influence over her elected representatives as a retiree who has amassed a lifetime of wealth. Publicly financing elections would go a long way toward putting people of different ages on more even political footing.\n\nAt the same time, we need a new motto. Not “one person, one vote,” but “one person, one equally meaningful vote.” The Fair Representation Act proposed in the House is a step in the right direction, pointing the way to a more proportional model of congressional representation using larger multi-member districts. (The imbalances inherent to the Senate and Electoral College would need to be fixed through other means.)\n\nUnder a proportional system, if a party wins the support of 25 percent of votes cast by a given electorate, it gets 25 percent of the seats — votes are no longer “wasted” and more people are represented. Research indicates that more proportional systems may increase youth turnout by as much as 12 percentage points while also encouraging younger candidates to run for office. Larger districts would help address the problem of gerrymandering while urban-rural polarization, and the age-based inequities that stem from it, would diminish.\n\nSome might respond that pursuing generational parity is the wrong approach. Recently, the Oxford University professor William MacAskill proposed age-weighting votes in favor of the young. By his accounting, 18- to 27- year-olds should possess six times the voting weight of someone 68 or older. Whether desirable or not, his thought experiment is provocative: Why shouldn’t those who will have to live longer with the consequences of elections have more of a say?\n\nSuch imaginative reforms are, of course, distant and unlikely prospects, which means it is incumbent on older people to find more immediate ways to express intergenerational solidarity. Just as many men stand against patriarchy, so can older people resist the gerontocracy.\n\nUnlike their boomer predecessors who rallied under the ageist motto “Don’t trust anyone over 30,” kids today are eager to find venerable allies. Consider the popularity of the 78-year-old democratic socialist Bernie Sanders (still the favored presidential candidate among college-aged voters) or the fact that the 73-year-old Senator Ed Markey (a co-sponsor, along with Representative Alexandria Ocasio-Cortez, of the Green New Deal) recently secured the endorsement of the youthful Sunrise Movement over his telegenic 39-year-old primary challenger. They may be septuagenarians but they embrace millennial priorities.\n\nThose of us who are older, if not wiser, should take another cue from young activists. We need to support forward-looking policies, and we also need to protest.\n\nClimate activists in Denver gathered to hear Greta Thunberg speak on Oct. 11. Marc Piscotty/Getty Images\n\nOn Oct. 11, several thousand people, including Ms. Thunberg, gathered near the Colorado Capitol. For once, Ms. Coleman wasn’t the only climate striker in sight. Addressing the crowd, she didn’t spend a moment pleading to be formally enfranchised (though she has told me she thinks 16-year-olds should be). Her overwhelming mission was to spur adults to join the revolt. “Our hard work does not absolve you of action,” she said. “Adults step up.”\n\nMs. Coleman’s emphasis on the power of protest is historically informed. If the past proves anything, it is that structural reforms are rarely secured through elections alone. We should see the goal of including young people in political life as part of the prolonged fight for a more robust and inclusive democracy — a system, lest we forget, based on the premise that those affected by a decision should have a say in making it. This task is all the more urgent given the concerted effort to undermine hard-won democratic gains. The generational implications of brazen attempts to shore up minority rule by shrinking and disempowering the electorate through methods such as gerrymandering, voter ID laws and dark money too often go unremarked.\n\nIn 1776, John Adams wrote that the legislature should be in miniature “an exact portrait of the people at large -- it should think, feel, reason and act like them.” Should we ever build a movement powerful enough to create a government that takes this founder at his word, the result could be astounding: a democracy in which elected officials are responsive to the full range of their constituents; universal access to college and medical care ensures an educated and healthy citizenry; and the environment protected for generations to come. Over the long term, these outcomes — and this more democratic system — would benefit the vast majority of people, young and old alike.", "description": "Our democracy today is dominated by the old, and young people are getting a bad deal.", "authors": ["Astra Taylor"], "top_image": "https://static01.nyt.com/images/2019/10/16/opinion/old-age-president-2020-1571375012955/old-age-president-2020-1571375012955-facebookJumbo.jpg", "published_at": "2019-10-18"}