{"pub": "nationalreview", "url": "https://nationalreview.com/news/us-japan-sign-trade-agreements", "downloaded_at": "2019-10-07 23:31:01.365088+00:00", "title": "Japan and U.S. Sign Trade Agreements", "language": "en", "text": "(Jim Young/Reuters)\n\nThe U.S. on Monday signed two trade deals with Japan that are intended to alleviate the hardships American farmers have encountered since President Trump imposed tariffs on U.S. agricultural exports to certain countries.\n\nThe first and third largest economies in the world signed the U.S.-Japan Trade Agreement and U.S.-Japan Digital Trade Agreement, just days before U.S. trade negotiators are set to meet with senior officials from the globe’s second largest economy, China, in Washington on Thursday.\n\nThe two somewhat restrained trade deals cut $7.2 billion worth of tariffs on U.S. agricultural exports. U.S. Trade Representative Robert Lighthizer and Japanese Ambassador to the U.S. Shinsuke J. Sugiyama signed the agreements at a ceremony at the White House.\n\n“This is a huge victory for America’s farmers, ranchers and growers. And that’s very important to me,” Trump said in remarks at the signing ceremony. “From day one my administration has worked tirelessly to achieve a level playing field for the American worker.”\n\nAmerican farmers bore the brunt of Trump’s decision to pull out of the Trans-Pacific Partnership trade agreement in 2017. One of the new deals does away with $4.3 billion in tariffs on American food products including wine, cheese, nuts, berries, and grains as well as $2.9 billion in tariffs on beef and pork products. The other agreement commits Japan and the U.S. to $40 billion worth of digital trade.\n\nRepublican Senator from Iowa Chuck Grassley called the agreement great news for Iowa farmers and said the new deal “strengthens” the administration’s negotiating position with China, which has battled with the U.S. on trade since Trump took office.\n\nNevertheless, the agreements keep U.S. tariffs on Japanese automobiles at 2.5 percent, in line with what Japanese Prime Minister Shinzo Abe said Trump promised him, that tariffs on Japan-made cars would not be hiked up.\n\nThe trade deficit between the U.S. and Japan was $58 billion last year, long a point of contention for Trump.", "description": "The U.S. on Monday signed two trade deals with Japan that are intended to alleviate the hardships American farmers have encountered since President Trump imposed tariffs on U.S. agricultural exports to certain countries.", "authors": ["Mairead Mcardle", "Andrew C. Mccarthy", "Matthew Continetti", "Brian Stewart", "David French", "George Will", "Kyle Smith", "Rich Lowry", "Jonah Goldberg", "John Mccormack"], "top_image": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2019/01/corn-farmer-illinois.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-07"}