{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/2019101510076/jpmorgan-flexes-muscle-goldman-stumbles", "downloaded_at": "2019-10-15 23:04:13.341834+00:00", "title": "JPMorgan Flexes Muscle, Goldman Stumbles", "language": "en", "text": "By Liz Hoffman and David Benoit\n\nJPMorgan Chase & Co. shares touched a record high following a strong third-quarter earnings report, underscoring the continued solid performance of the largest U.S. lenders at a time of global tensions and economic worries.\n\nThe New York banking giant was joined in Tuesday's earnings parade by Citigroup Inc., whose results also exceeded Wall Street expectations. Together, the figures confirmed that the largest U.S. banks have yet to feel the sting of recent interest-rate cuts and turbulence in the stock and money markets.\n\nJPMorgan's stock rose 3% on a day when stocks moved broadly higher. Citigroup gained 1.4%.\n\nBut executives warned that falling interest rates would eventually take a bite out of profits. And at Goldman Sachs Group Inc., a smaller bank that is more exposed to market shifts, profit fell 26% from a year ago. The firm's Wall Street businesses slowed and it continued to spend heavily on new Main Street businesses that would make it look more like larger rivals that breezed through the quarter. Goldman shares overcame an early dip to close 0.3% higher.\n\nThe Federal Reserve lowered its benchmark interest rates twice this summer, the first cuts in more than a decade. Flat wages, a slowdown in manufacturing and the effect of tariffs on imported goods implemented by the Trump administration have added to concerns that the decadelong economic expansion may be running out of steam. Falling interest rates make it hard for banks to eke out profits by lending, and executives Tuesday said a turn toward lower rates would likely hurt their businesses.\n\nBut for now U.S. consumers and the banks that serve them are doing well. \"While it's slower growth, it's still growth,\" JPMorgan Chief Executive James Dimon said. \"The U.S. consumer is incredibly strong.\"\n\nLower rates ginned up some new business, too. Citigroup and JPMorgan wrote more mortgages as people rushed to refinance, and Goldman's traders made more money on products tied to interest rates, such as swaps and mortgages.\n\nAt Citigroup, where one of its core business lines is moving money around the globe for companies and governments, executives said trade tensions were making clients more cautious about international expansion. Still, trade upheaval has benefits for banks of Citigroup's size: CEO Michael Corbat said that although China is buying fewer soybeans from the U.S, it is buying more from other countries where the bank also does business.\n\n\"Our ability as a global bank to move with our clients on both sides...to be helping them rethink what those trade routes and what that supply chain looks like, I think we've been very effective,\" Mr. Corbat said.\n\nJPMorgan posted a profit of $9.08 billion on revenue of $29.34 billion, both up 8% from the prior year. Citigroup's profit of $4.91 billion was up 6%, helped by a lower tax rate as revenue rose just 1%.\n\nGoldman's revenue of $8.32 billion was down 6% from a year ago, but profit fell more sharply because the bank is spending heavily to build new businesses.\n\nJPMorgan reported an industry-leading 15% return on equity, an important measure of bank profitability. Goldman's was 9% and Citigroup's was 10.4%.\n\nJPMorgan's consumer business added new deposits despite paying lower interest rates than some rivals. It can use those low-cost funds to write mortgages and fund the multibillion-dollar corporate loans for which it is known. The bank's net interest income -- the difference between what it collects on loans and what it pays for deposits -- rose by 2% to $14.23 billion, continuing a four-year streak of quarterly gains.\n\nGoldman is chasing the predictability of that income: Its core Wall Street businesses struggled in the third quarter, as deal making slowed and it took paper losses on its stakes in companies. A slight uptick in trading wasn't enough to compensate.\n\nGoldman has been building a consumer business that it hopes will eventually compete with giant Main Street banks. Under the brand name Marcus, it takes online deposits, makes personal loans and recently launched a credit card in partnership with Apple Inc.\n\nThe costs of those efforts were clear Tuesday: Noncompensation expenses rose 16% in the quarter, which Goldman offset by cutting the money it sets aside for employee bonuses.\n\nThe effort will likely take years, Chief Executive David Solomon acknowledged Tuesday, but there are early successes: The bank has gathered $55 billion in consumer deposits, which reduces its reliance on more expensive types of funding.\n\nMr. Solomon, Goldman CEO since last fall, is under pressure from investors to lay out his growth plans for Goldman in early 2020. The priorities he has sketched out so far include growing Goldman's private-investing business, cross-selling top corporate clients on products such as money management and cutting costs across the firm.\n\nGoldman's revenue from mergers and underwriting securities offerings fell 18% as the initial-public-offering market quieted and fewer corporate deals were completed. Goldman is the leading stock underwriter this year, according to Dealogic, but the IPO business -- worth $9 billion in fees across Wall Street last year -- looks threatened after a few disastrous debuts, most prominently the collapse of the IPO for WeWork's parent.\n\nJPMorgan touted 22% revenue growth in its equity underwriting business, and pushed aside questions about those soured deals.\n\nIn trading, the results across the banks were also mixed.\n\nAt Goldman, revenue from fixed-income trading was up 8% in the quarter, but for the year it is down from 2018. JPMorgan's fixed-income revenue was up 25%, a surge it said came despite deteriorating markets. At Citigroup, it was flat.\n\nWrite to Liz Hoffman at liz.hoffman@wsj.com and David Benoit at david.benoit@wsj.com\n\n(END) Dow Jones Newswires\n\nOctober 15, 2019 17:07 ET (21:07 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-15"}