{"pub": "cnbc", "url": "https://cnbc.com/2019/09/03/tesla-owners-in-china-ask-for-refunds-after-10percent-tax-break.html", "downloaded_at": "2019-09-04 03:46:09.721117+00:00", "title": "Tesla owners in China are asking for refunds after the company scored a 10% tax break", "language": "en", "published_at": "2019-09-03", "text": "Tesla customers in China are scrambling to figure out if they can get a refund after the electric car company scored a tax break from the government there last week.\n\nAuthorities in China exempted Tesla's cars from a 10% purchase tax, making the electric car maker the first foreign manufacturer to attain the benefit without a local joint venture partner. With Tesla stressing the increased importance of expansion in China, the exemption announcement buoyed Tesla's shares.\n\nChina's Ministry of Industry and Information Technology (MIIT) said that dozens of battery-electric and plug-in hybrid vehicle makers qualified for the tax break. That list includes Toyota and Daimler, which have local partners, along with domestic companies like Geely, Guangzhou Auto, NIO and SAIC Motor.\n\nWhile the news was a boon for Tesla, it also caused some confusion. Customers aren't sure if they are eligible for the refunds retroactively, or whether the tax break applies only to new buyers.\n\nSome customers in China complained that Tesla should have warned them that a tax exemption may be possible, so they could have delayed purchases and qualified for the deal. But Zhu Xiaotong, Tesla's China head, told the state-sponsored Global Times that Tesla China couldn't make information about its application for the exemption public.\n\nThe Global Times said that frustrated Tesla owners have taken to WeChat to discuss the issue, and customers have sent letters to Tesla offices seeking refunds.\n\n\"The MIIT announcement was written with lots of ambiguity as to who benefits from the inclusion of Tesla\" on the exempt list, wrote Junheng Li, the CEO of JL Warren Capital, in an email to CNBC. \"Consumers want clarity from the government, not from Tesla China.\"", "description": "Last week Tesla scored a 10% purchase tax exemption in China, but customers there aren't sure if it applies to them.", "authors": ["Lora Kolodny"], "top_image": "https://image.cnbcfm.com/api/v1/image/103868531-GettyImages-451889484.jpg?v=1555897064"}