{"pub": "investing.com", "url": "https://investing.com/analysis/usdchf-stays-in-a-sliding-mode-200475553", "downloaded_at": "2019-10-21 13:36:00.587715+00:00", "title": "USD/CHF Stays In A Sliding Mode", "language": "en", "text": "traded somewhat higher today, after it hit support near the 0.9840 zone, but the recovery remained limited near the 0.9865 level. Overall, the pair has been in a sliding mode since October 16th, with the fall below the upside support line drawn from the low of August 13th, as well as the break below the 0.9915 barrier, signaling a short-term reversal to the downside. Having all that in mind, we will hold a bearish stance for now.\n\nIf the bears are strong enough to recharge and push the battle below the 0.9840 level, we may initially see them targeting the 0.9820 barrier, the break of which could extend the slide towards the 0.9800 area, which is near the lows of August 28th, 29th, and September 4th. Another dip, below 0.9800 may set the stage towards the low of August 27th, at around 0.9775.\n\nLooking at our short-term oscillators, we see that the RSI already below 30, has turned down again, while the MACD lies below both its zero and trigger lines, and has just turned south as well. These indicators detect strong downside speed and support the notion for the bears to stay in the driver’s seat for a while more.\n\nIn order to start examining the case of a decent correction to the upside, we would like to see a break above Friday’s high, which is near 0.9890. Such a move could pave the way towards the 0.9915 barrier, which if broken, may see scope for more upside extensions, perhaps towards the 0.9945 territory, defined as a resistance by the inside swing low of October 14th.", "description": "Forex Analysis by JFD Team covering: USD/CHF. Read JFD Team's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-21"}