{"pub": "thehill", "url": "https://thehill.com/opinion/finance/465605-judd-gregg-shut-the-government-downmaybe", "downloaded_at": "2019-10-14 10:11:24.020539+00:00", "title": "Judd Gregg: Shut the government down...maybe", "language": "en", "text": "Congress and President Trump Donald John TrumpWHCA calls on Trump to denounce video depicting him shooting media outlets Video of fake Trump shooting members of media shown at his Miami resort: report Trump hits Fox News's Chris Wallace over Ukraine coverage MORE, in a rare moment of cooperation, passed a continuing resolution last month to operate the government until Nov. 21.\n\nWe can assume that when Nov. 21 rolls around — and members of Congress want to go somewhere to celebrate Thanksgiving — there will be another continuing resolution extension, probably into late December or, if the Congressional leadership is on its best behavior, into January 2020.\n\nWhen the government operates under a continuing resolution, it is on autopilot.\n\nADVERTISEMENT\n\nAll the various branches of the bureaucracy get money to spend from Congress, but essentially without oversight.\n\nThis is not that different from the way things go when actual appropriation bills get passed, since the bureaucracy does its own thing with or without congressional guidance.\n\nThe government is so large that congressional oversight is essentially a fantasy.\n\nCongressional input is limited to a few high visibility items of specific interest to members of the appropriations committees.\n\nIn recent decades, however, the government has come to a complete halt several times.\n\nThis has occurred when Congress and the president, being of different parties, have got wrapped around themselves and have been unable to pass either a debt ceiling extension, a continuing resolution or the actual appropriation bills.\n\nThese government shutdowns have generally led to no positive change.\n\nInstead, they have led to significant inconvenience. They have also turned into a paid vacation for the federal workers who do not have to come to work — even if the payment is always in arrears.\n\nMost significantly, the blame for the shutdowns has invariably been laid at the feet of Republicans in Congress.\n\nBut, even so, let us not pass up on trying again.\n\nHere are a couple of reasons why taking another run at a government shutdown may make sense, if you think like the president and his people in Congress.\n\nFirst is the impeachment inquiry.\n\nIf the government is shutdown, “voila” the impeachment inquiry is going to probably stall, briefly.\n\nOne of the goals of the president’s team is to push the impeachment inquiry as close to the 2020 election as possible.\n\nTheir theory, presumably, is that the idea of an elected president getting removed in an unelected way gets less and less tenable the closer to the election we get.\n\nTrump insists that from the night of his election in 2016, the Democratic leadership and its base has been attempting to remove him.\n\nOriginally the Democratic effort, assisted by their national media accomplices, built the case for removal around Russia’s activities and the Mueller investigation. But that did not turn up the kind of compelling evidence House Democrats felt would allow them to present a united front for impeachment.\n\nNow they have turned to Ukraine, and Trump’s dealings with it. Much is still to be learned here.\n\nBut in the eyes of the president and his allies, this is just a continuation of the “coup” attempt that has been prosecuted against him from the day he was sworn in.\n\nThus, the closer these efforts by the House Democrats get to the next election, the more they will be characterized as mean-spirited and unjustified.\n\nTrump and his followers are aided considerably by the fact that the lead dog for the Democrats is House Intelligence Committee Chairman Adam Schiff Adam Bennett SchiffTrump hits Fox News's Chris Wallace over Ukraine coverage Schiff: Whistleblower testimony might not be necessary A Republican Watergate veteran's perspective on a Trump impeachment MORE (Calif.), who can easily be portrayed as biased, manipulative and unsavory.\n\nIn fact, when all this over and done, there will likely be a new term in our national political nomenclature: “Schiffed.” This will describe being confronted with a dramatic abuse of power by an extremely slippery and unprincipled figure.\n\nIn addition to pushing the impeachment inquiry off into sometime next year, a closure of the government would also have the salient effect of focusing people’s attention on an important issue that has been intentionally overlooked, at least by this president and this Congress: the deficit and the debt.\n\nADVERTISEMENT\n\nIn the last exercise to keep the nation’s government open, the president and the Democratic House leadership decided that a good trade would be to add almost $2 trillion in spending.\n\nThis was on top of the earlier trading session involving keeping the government open, which also added about $2 trillion to the debt.\n\nThese two incredibly fiscally irresponsible agreements gave new meaning to the term Art of The Deal.\n\nIt seems as if, for a deal to be artful, all you need is a few trillion dollars of debt to be added to the back end of the next decade — and onto the backs of the next generation.\n\nIt looks like the next deal to keep the government open through this fiscal year may be more of the same.\n\nIt is difficult to understand the need for a deal if it is anywhere near this level in debt addition.\n\nWe already know that even without a deal to keep the government running, the deficit will hit $1 trillion this year, and in following years for as far as one can honestly project.\n\nMaybe shutting the government down would cause someone in power to address this debt and actually require that any deal be paid for.\n\nThe issues may not be complementary — delaying the impeachment proceedings and not digging the debt hole any deeper — as causes for shutting down the government. But then again, when did rationality last inform Washington thought?\n\n“Shut it Down” may be the new language that our supremely stable genius of a president should try out at his next rally. It would be more sensible than some of the other chants that occur at these events.\n\nJudd Gregg (R) is a former governor and three-term senator from New Hampshire who served as chairman and ranking member of the Senate Budget Committee, and as ranking member of the Senate Appropriations Foreign Operations subcommittee.", "description": "OPINION: Despite past adverse experiences for the GOP, there is a case to be made for a government shutdown.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald3_101119getty.jpg", "published_at": "2019-10-14"}