{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7603983/Obese-woman-shed-whopping-eight-stone-dubbed-Gemma-Collins-nights-out.html", "downloaded_at": "2019-10-23 10:07:29.933469+00:00", "title": "Obese woman shed a whopping eight stone after being dubbed 'Gemma Collins' on nights out", "language": "en", "text": "An obese woman who was dubbed 'Gemma Collins' by men on nights out has lost eight stone by ditching the takeaways she used to indulge in after going clubbing and drinking 20 vodka and Red Bulls.\n\nChrystal-Sky Dawson, 23, from Tewkesbury, Gloucestershire, was left mortified when strangers compared her to The Only Way Is Essex star due to her blonde locks, glittery makeup and size-26 figure.\n\nHer weight ballooned to 21st however after swapping greasy food for healthy meals, Chrystal-Sky lost 7st 10lbs and now weighs 13st 4lbs.\n\nChrystal-Sky, a public relations and media student, says: 'Every night out, men would jeer at me and say \"Look it's Gemma Collins\".\n\nChrystal-Sky Dawson, 23, from Tewkesbury, Gloucestershire, lost 7st 10lbs and now weighs 13st 4lbs\n\nShe was left mortified when she was compared her to The Only Way Is Essex star Gemma Collins due to her blonde locks, glittery makeup and size-26 figure\n\n'It was mortifying because I knew they were saying I was big. Other times, men called me \"fat\" or referred to me as the \"fat friend\".\n\n'They hit on my friends, who were sizes 6-12, while laughing at me.\n\n'Since I've shed the pounds, I feel sexy and beautiful for the first time in my life! And men now ask for my number.'\n\nAs a child, Chrystal-Sky was overweight, admitting: 'My classmates used to call me \"tubby\".\n\n'Thankfully by the time I was a teen, I was a healthy weight and a size 12.'\n\nAfter losing eight stone, the student insisted she feels 'sexy and beautiful' for the 'first time' in her life\n\nChrystal-Sky is pictured posing with her mother Lesley Dawson, 53, after dropping down to a slender size 12 by swapping greasy food for healthy meals\n\nIn September 2015, Chrystal-Sky started studying Spanish and French at Swansea University and her weight crept up again.\n\nChrystal-Sky, who is 5ft 9in tall, says: 'Suddenly I went from enjoying home-cooked meals every night to having the freedom to eat what I wanted.\n\n'I went clubbing five times a week, downing 20 vodka Red Bulls each night.\n\nChrystal-Sky's diet before Breakfast: Bacon and egg sandwich on thick white bread with butter and ketchup Lunch: Lasagne and chips, diet coke Dinner: Stir fry After night out: Large pizza Drinks: Wine, vodka red bull\n\nChrystal-Sky's diet now Breakfast: overnight oats made with fruit and yoghurt Lunch: Chicken and bacon salad with grapes, boiled egg Dinner: Homemade lasagne Snacks: Fruit, yoghurt Drinks: Vodka and Diet Coke\n\n'Then I gorged on Chinese, Indian and pizza takeaways afterwards, even eating a whole large pizza to myself.\n\n'Before I knew it, I'd gained three stone during my first year.'\n\nIn September 2017, Chrystal-Sky moved to Paris to study French and gained a further three stone, weighing in at 21st.\n\n'I avoided mirrors as I couldn't bear to see my reflection' after moving away to university and jetting abroad for a year, Chrystal-Sky's weight ballooned\n\nChrystal-Sky says: 'I scoffed on copious amounts of cheese and guzzled red wine. Unsurprisingly, I ballooned to a size 26.\n\n'My arms, legs and stomach were huge and I hated myself.\n\n'I avoided mirrors as I couldn't bear to see my reflection.When I came home, my friends were shocked at how big I'd gotten.'\n\nFrom then, she faced cruel taunts by men on nights out who dubbed her 'Gemma Collins'.\n\nShe says: 'I assumed because I had blonde hair and nice make up I looked like her, but the main reason was because I was overweight.\n\n'It isn't an insult to be called Gemma Collins, because she is obviously beautiful.\n\nAfter facing cruel taunts by men on nights out who dubbed her 'Gemma Collins' the student decided to take action\n\nShe now exercises everyday and continues to indulge in fresh healthy meals, like fruit, yogurt and homemade lasagna\n\n'But it still hurt my feelings because men were hinting that I was big too.It was devastating.'\n\nChrystal-Sky's weight affected her confidence and she'd avoid clothes shopping, confessing that she once 'bust into tears' in a changing room after comparing herself to her friends.\n\nShe says: 'One day I went shopping with my mates.\n\n'I wanted to fit in with my friends and try some clothes on, even though the shop only stocked up to a size 18.\n\n'When the top wouldn't fit over my head, I burst into tears and I locked myself in the changing room for two hours, sobbing.\n\nChrystal-Sky's weight affected her confidence and she'd avoid clothes shopping with hre more slender friends\n\nShe confessed that she once 'bust into tears' in a changing room after comparing herself to her friends\n\n'After that, I became a recluse and stopped seeing my mates.I refused to go out anywhere and stayed at home because I hated my body so much.'\n\nBy June 2018, Chrystal-Sky was sick of feeling depressed about her weight and begged her mum, Lesley Dawson, 53, an office manager, for help.\n\nChrystal-Sky says: 'I broke down to Mum, who knew I'd been unhappy for years.\n\n'The next day, she took me to a Slimming World group. I was determined to make a change.'\n\nChrystal-Sky ditched her takeaways for fresh fish, meats and vegetables and within six months, she'd lost 4st and exercised five days a week.Chrystal-Sky\n\nThe student says she 'went from being a couch potato to running 10k' and loves her new slender figure\n\nChrystal-Sky says she is the 'healthiest I've ever been and I feel amazing' and proclaimed that she's 'never going to look back'\n\nShe says: 'I had so much energy and felt so happy for the first time ever.'\n\nBy September this year, Chrystal-Sky lost an incredible 7st 10lbs, she now weighs 13st 4lbs and loves her size 12 figure.\n\nChrystal-Sky says: 'I'm the healthiest I've ever been and I feel amazing.I went from being a couch potato to running 10k.\n\n'It's also the best feeling being able to go into a shop and wear anything I want.When I go out with my friends, I actually get hit on by men.\n\n'All of the laughing, 'fat' and 'Gemma Collins' jibes have stopped.Men no longer abuse me, instead, they ask for my number. I'm not used to it!\n\n'My life has completely changed for the better, I'm never going to look back.'", "description": "Chrystal-Sky Dawson, 23, from Gloucestershire, lost a whopping eight stone after facing cruel jibes from men on nights out who would compare her to The Only Way Is Essex star Gemma Collins.", "authors": ["Monica Greep For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/09/20074022-0-image-a-18_1571819049636.jpg", "published_at": "2019-10-23"}