{"pub": "politico", "url": "https://politico.com/news/2019/10/07/pete-buttigieg-drug-prices-policy-036409", "downloaded_at": "2019-10-07 12:05:21.365001+00:00", "title": "How Pete Buttigieg would lower drug prices", "language": "en", "text": "“It’s time for a new era of leadership in Washington ready and eager to make drugs affordable and take on pharmaceutical companies,” his plan reads. “Pete has the courage to break with the status quo by focusing on real solutions that will lower costs and make needed — even life-saving — prescription drugs available to all Americans.”\n\nWhat would the plan do?\n\nThe government would be empowered to negotiate prices, starting with the most expensive medicines and those that are much cheaper overseas. Medicines for diabetes, asthma, arthritis, HIV and cancer would be prioritized.\n\nThe Department of Health and Human Services would use four criteria to negotiate: the benefit offered by the drug, the cost of bringing the medicine to the market, the costs of treating the disease the drug addresses, and international prices charged for similar drugs.\n\nPharmaceutical companies that refuse to negotiate or don’t reach an agreement with the government will pay a 65 percent tax on the company’s gross sales of the drug. The tax will increase by 10 percent each quarter the company is out of compliance, until it reaches 95 percent.\n\nThe federal government could revoke a company’s patent rights and let others make a drug at an affordable price if the manufacturer refuses to lower the price or in cases of a natural disaster or public health emergency.\n\nMonthly out-of-pocket drugs costs would be capped at $200 for seniors and at $250 for public option enrollees. Low-income patients in government plans would pay nothing for generics and biosimilars, copycats of complex biologic drugs.\n\nTo increase access to low-cost generic drugs, Buttigieg would ban “pay-for-delay” deals, in which a brand drug company pays a generic drug company to keep competition off the market. He also would stop brand drug companies from withholding samples that generic makers need to get a copycat medicine approved.\n\nWho would pay for it?\n\nThe plan would be funded by significantly increasing an Obamacare-mandated fee on branded prescription drug companies to at least $8 billion per year, indexed to inflation. That’s about $5 billion more annually than drugmakers pay now.\n\nThe pharmaceutical industry would also be on the hook for more of the costs of drugs when seniors with large out-of-pocket spending enter the “catastrophic” phase of the Medicare prescription drug benefit. Drugmakers would also be penalized if the cost of their branded medicines increased faster than inflation.\n\nThe federal government would help fund state-run experiments to drive down drug costs, including programs to import cheaper versions sold abroad. The plan also puts new funding toward drug research and development, including $100 million per year to the FDA to help companies develop generics of complex products like asthma inhalers.\n\nThe government would receive more funding to combat antibiotic-resistant bacteria, as well as work on medical countermeasures and other tools to fight pandemics and health threats, but the plan does not specify how much money would go towards these efforts. Companies could receive tax breaks for investing in American drug manufacturing and novel manufacturing approaches like 3D printing.\n\nWhat are the weaknesses?\n\nThe plan does not require the government to negotiate the cost of a minimum number of drugs each year, which could mean a Republican administration might choose not to negotiate at all, since conservatives typically oppose government intervention in drug prices.\n\nThere’s also no requirement for private insurers or other government programs like Medicaid to use the Medicare-negotiated prices.\n\nAmericans without health insurance also would not get the benefit of the lower costs, and the plan does not contain another mechanism to get cheaper drugs to the uninsured.\n\nWhat have other Democrats proposed?\n\nEvery Democratic candidate who has weighed in on drug pricing supports Medicare negotiations, though the details of their plans vary. Many also want to tie the prices paid in the U.S. to the cheaper prices paid in other countries like Canada, the United Kingdom and Japan — an idea that President Donald Trump has also supported.\n\nSen. Bernie Sanders has a bill that would incentivize drugmakers to offer these lower overseas prices for all Americans, regardless of where they get insurance. If the companies don’t cooperate, the federal government would intervene to allow generic companies to produce cheaper versions.\n\nSen. Elizabeth Warren would create a government-run pharmaceutical manufacturer to mass-produce generic drugs where there’s been a failure in the market; for instance, if no one is producing the drug or the price rises faster than medical inflation.\n\nWho opposes it?\n\nRepublicans have long opposed allowing the federal government to negotiate the cost of prescription drugs, which would make it hard for Buttigieg to pass such a plan without full Democratic control of Congress. Even then, it would likely face stiff opposition from the powerful pharmaceutical industry, as well as private health insurance companies who have also long opposed government intervention in drug price negotiation.", "description": "", "authors": [], "top_image": "https://static.politico.com/0f/0a/6bf4f3224b8fb0956a792fb4b22c/20191006-pete-buttigieg-gty-773.jpg", "published_at": "2019-10-07"}