{"pub": "thehill", "url": "https://thehill.com/policy/healthcare/465257-phrma-ceo-warns-pelosi-bill-to-lower-drug-prices-would-be-devastating-for", "downloaded_at": "2019-10-11 00:18:36.914938+00:00", "title": "PhRMA CEO warns Pelosi bill to lower drug prices would be 'devastating' for industry", "language": "en", "text": "The head of the main pharmaceutical industry lobbying group on Thursday warned that a bill to lower drug prices from Speaker Nancy Pelosi Nancy PelosiDemocrats request testimony from Trump's former Russia adviser Trey Gowdy joins Trump's legal team Tillis says impeachment is 'a waste of resources' MORE (D-Calif.) would have a “devastating” effect on the industry and weaken its ability to develop new treatments.\n\nThe Pharmaceutical Research and Manufacturers of America (PhRMA) is one of the most powerful groups in Washington, and its CEO, Steve Ubl, outlined on Thursday the arguments the group is making as it seeks to ward off a push from the House, Senate and Trump administration to crack down on its prices.\n\nADVERTISEMENT\n\n“If H.R. 3 becomes law, it is lights out for a lot of very small biotech companies that are pre-revenue and depend on attracting capital,” Ubl told reporters on Thursday, using the formal name for Pelosi’s bill.\n\nPelosi’s measure is expected to pass the House as soon as the end of October.\n\nBut the bill faces tough odds in the Republican-controlled Senate, where Senate Majority Leader Mitch McConnell Addison (Mitch) Mitchell McConnellDemocrats plow ahead as Trump seeks to hobble impeachment effort Congress set for showdown with Trump over Kurds Senate Intelligence report triggers new calls for action on election security MORE (R-Ky.) has vowed to block what he has called \"socialist price controls.\"\n\nPelosi hopes if President Trump Donald John TrumpDemocrats request testimony from Trump's former Russia adviser Trump adviser: 'He should stop saying things that are untrue' US moves British ISIS suspects from Syria amid Turkish invasion MORE, who has long railed against high drug prices, endorses her bill, it would push it toward the finish line, though a potential deal could be more unlikely given the House’s impeachment inquiry against Trump.\n\nUbl, though, said his group is treating Pelosi’s measure, which would allow the government to negotiate lower prices on up to 250 drugs per year, as a real threat of becoming law, and is pushing back accordingly.\n\n“I think there may be a mistaken notion in certain quarters that this is a messaging bill that won't become law and therefore it's a free vote, and we're here to say otherwise,” Ubl told reporters. “This type of policy would have a devastating effect on the industry and the patients that we serve and we're going to continue to take it very seriously and engage with policymakers accordingly.”\n\nSupporters of the measure say the industry’s arguments that cutting drug prices would reduce innovation in new drugs is always the argument that industry makes to protect their high prices.\n\n“It's not going to hurt innovation,” Pelosi said at an event earlier this week in Washington state, saying that the bill would invest in research at the National Institutes of Health.\n\n“We will have savings that we can reinvest in innovation that benefits everyone and not just the bottom line of the pharmaceutical industry,” she said.\n\nHouse Democratic lawmakers were given a memo last month from focus groups of swing voters conducted by the firm Hart Research Associates. \"Pharmaceutical companies' claims that this bill will stifle investment in R&D are met with skepticism and have a very limited impact on swing voters,” the memo states. “Many see pharma's message point as a scare tactic that drug companies have used for years to avoid reforms that will cut into their profits.”\n\nMany leading drug companies are highly profitable. PhRMA argued on Thursday that reducing its companies’ profits would reduce the incentive for investors to take a risk by investing in drug companies, whose new treatments often fail somewhere along the line in development.\n\n“We rely on capital investment to develop our R&D to produce new medicines,” said Lori Reilly, chief operating officer for PhRMA. “If you do diminish the return element, or the profitability element of that, you take away the incentive for many investors to put money in here, because there's lots of places you can invest in, lots of places that carry a lot less risk.”\n\nSens. Chuck Grassley Charles (Chuck) Ernest GrassleyGOP requests update on criminal referrals prompted by 2018 Kavanaugh probe On The Money: Judge tosses Trump lawsuit over NY tax return subpoena | US, Japan sign trade deals | Trump faces narrowing window for trade deals | NBA sparks anger with apology to China Grassley's grandson to be Iowa's next House speaker MORE (R-Iowa) and Ron Wyden Ronald (Ron) Lee WydenOn The Money: Fed officials saw rising risk of recession | Ocasio-Cortez, Cruz blast NBA for 'outrageous' response to China | Prospects dim for trade breakthrough with China Ocasio-Cortez, Ted Cruz join colleagues blasting NBA for 'outrageous' response to China Lawmakers criticize gaming company for suspending player who supported Hong Kong protests MORE (D-Ore.) have proposed a somewhat more modest drug pricing bill.\n\nBut PhRMA also opposes that measure, and many doubt McConnell will bring up even that more modest bill.\n\nUbl argued that his group is not opposed to all action on drug prices, though, and would support actions that lower what patients pay out of pocket, rather than cutting the overall sticker price of the drug.\n\n“The industry would support a balanced package,” he said. “We're not for the status quo.”", "description": "The head of the main pharmaceutical industry lobbying group on Thursday warned that a bill to lower drug prices from Speaker Nancy Pelosi (D-Calif.) would have a “devastating” effect on the industry and weaken its a", "authors": [], "top_image": "https://thehill.com/sites/default/files/blogs/drugs_1.jpg", "published_at": "2019-10-10"}