{"pub": "foxbusiness", "url": "https://foxbusiness.com/politics/brexit-latest-parliament-suspended-chlorinated-chicken", "downloaded_at": "2019-09-09 23:20:03.775124+00:00", "title": "Brexit latest: Johnson suspends Parliament as prospect of 'chlorinated chicken' from US roils Britain", "language": "en", "text": "UK Prime Minister Boris Johnson's government confirmed on Monday that Parliament will be suspended until Oct. 14.\n\nContinue Reading Below\n\nSpokesman James Slack says Parliament will be prorogued, or suspended, at the close of the day's business.\n\nJohnson has previously said he would send British lawmakers home sometime this week. The suspension limits Parliament's ability to block Johnson's plans for Brexit.\n\nThe move comes as Brexiteers have less than two months until Oct. 31, when Johnson says the UK will exit the European Union. Johnson has said the UK will leave with or without a divorce agreement to smooth the path, though a new bill banning a \"no deal\" Brexit went into effect Monday.\n\nJohnson has had plenty of trouble from his own faction in recent days. His Secretary of State for Work and Pensions Amber Rudd resigned Saturday, saying the government is not trying hard enough to get a deal to leave the EU. In addition, the prime minister's brother Jo Johnson resigned as universities minister and gave up his seat in Parliament last week over the Brexit chaos.\n\nAdvertisement\n\nBrexit skeptics have many worries, including that they will have to import food with looser safety standards after cuting ties with the EU. The EU has long refused to import poultry from the U.S. that is routinely rinsed with chemical washes to kill germs. But Brexit is putting the practice back in the spotlight, with Johnson even taunting Labor Party leader Jeremy Corbyn by calling him a \"chlorinated chicken.\"\n\nUnlike in the EU, the use of antimicrobial sprays and washes is widespread in the U.S. chicken industry. Companies apply them to kill germs at various stages during processing, such as when carcasses are de-feathered, gutted or any other point when feces could splatter and spread germs like salmonella.\n\nThe Associated Press contributed to this report.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "UK parliament will be suspended until Oct. 14, the prime minister's office confirmed Monday.", "authors": ["Evie Fordham"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/07/0/0/AP18190505364131.jpg?ve=1&tl=1", "published_at": "2019-09-09"}