{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7572809/Australians-brace-storms-bringing-massive-hailstones-flooding-TORNADOES.html", "downloaded_at": "2019-10-15 02:17:41.488358+00:00", "title": "Australians brace for storms bringing massive hailstones, flooding and TORNADOES", "language": "en", "text": "Australians have been warned to brace for 'violent and dangerous' storms this summer as well as devastating heatwaves and bushfires.\n\nLast December Sydney was hit with the worst hailstorm in 20 years and experts warned more were on the way.\n\n'We're likely to see storms that bring large hailstones, tornadoes, heavy rain, localised flash flooding and damaging winds,' NSW SES Deputy Commissioner Rob McNeill told the Sydney Morning Herald.\n\nThis was part of a long-term trend in which storms previously restricted to sub-tropical areas were falling further south than previous years, affecting major population centres.\n\nThis image was captured at Wadalba as the Central Coast was battered by storms in December 2018\n\nThis image shows damage after a tornado near Bendigo, Victoria,in July 2019 was at least EF2 intensity on the Enhanced Fujita scale (with wind gusts in excess of 200 km/h)\n\nRosslea residents Stephen Jubbs, Stacie Little and Stephen Dobbs take their boat around floodwaters in Rosslea, Townsville in February 2019\n\nFire crews undertake back burning near Railway Crescent, Belmont, Lake Macquarie, NSW in August 2019\n\nMr McNeill explained: 'What we're seeing is there's an increased risk of storms along coast of NSW.\n\n'A long-term trend that we're seeing is the risk of hail storms shifting south from more northerly areas to areas with larger populations like Newcastle, Gosford and Wollongong.'\n\nAs well as dangerous storms, parts of Australia are also bracing for severe heatwaves and bushfires this year.\n\nThis is because average daytime temperatures for the first nine months of the year were the highest on record while average rainfall levels were the lowest since 1965, according to the Bureau of Meteorology.\n\nIn Queensland experts are predicting a 'dangerous cocktail' of hot and dry weather that will bring more extreme bushfires.\n\nBureau of Meteorology State Manager Bruce Gunn said fires remained the main concern for the rest of 2019.\n\nWet weather isn't tipped to arrive until late summer and much of the state might not get the much-needed rain to turn tinder-dry paddocks green again.\n\n'The rainfall outlook is for well below normal chances of above average rainfall,' he said on Monday.\n\nTarps are seen on the roof of a house that was damaged in a hail storm in Berowra Heights, NSW, in 2018\n\nLast December Sydney was hit with the worst hailstorm in 20 years (pictured) and experts are warning more are on the way\n\nWaves crash against a garden swimming pool that was washed away from a property on the beach front after heavy rain and storms at Collaroy in Sydney's Northern Beaches in 2016\n\n'So combined with the warmer than average temperatures and the increased chance of heatwaves, on top of the last few years of rainfall deficit, it's a pretty dangerous cocktail for fire danger conditions for the rest of the year.\n\n'Continued vigilance is going to be necessary.'\n\nMr Gunn said the cyclone risk for this season is 'slightly below average', and that it was still too early to make any predictions about when and where they might cross the coastline.\n\nHowever he warned there was no place for complacency.\n\n'Parts of Queensland will undoubtedly experience major flooding or a tropical cyclone before the end of the 2019-2020 season,' he said.\n\n'But it only takes one event to make a significant impact on people's lives, and you need to be prepared ahead of that eventuality.'\n\nThe Queensland government on Monday launched its Get Ready Week, to give residents information on how to prepare for storm season.\n\nAverage rainfall levels are the lowest since 1965, according to the Bureau of Meteorology\n\nAverage daytime temperatures for the first nine months of the year are already the highest on record\n\nFirefighters were still working to contain northern NSW bushfires before temperatures rise in coming days, as Prime Minister Scott Morrison visited bushfire-ravaged communities.\n\nBusbys Flat and Drake fires continued to burn, along with several other blazes on Sunday, after a horror week in which an elderly couple died and at least 55 homes were destroyed.\n\nOn Sunday, the prime minister and NSW Premier Gladys Berejiklian visited the Northern Rivers Fire Control and Emergency Operations Centre in Casino, close to where bushfires left a trail of devastation in their wake.\n\nNSW Rural Fire Service spokesman James Morris on Saturday said rain had eased conditions significantly, but it wasn't enough to extinguish the fires.\n\nHe said crews would keep working to contain them before temperatures and winds rise again in the coming week.\n\n'We haven't had enough rain to really make a difference to the ground fuels, so they will dry out very quickly once we see some sunny and windy weather again,' Mr Morris said.\n\nHe said temperatures and winds were expected to increase from Tuesday.\n\nThe Busbys Flat fire, which authorities believe was deliberately lit, was classed as 'being controlled' on Sunday, while the Drake blaze, which was started over a month ago by a lightning strike, was under control.\n\nThe latter fire claimed the lives of Bob Lindsay, 77, and his wife Gwen Hyde, 68.\n\nTheir bodies were found in their destroyed Coongbar home on Thursday some two days after fires roared through the region.", "description": "Last December Sydney was hit with the worst hailstorm in 20 years and experts are warning more are on the way. This is part of a long-term trend in which storms having been falling further south.", "authors": ["Charlie Moore For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/01/19717808-0-image-a-2_1571099614393.jpg", "published_at": "2019-10-15"}