{"pub": "independent", "title": "No-deal Brexit: Secret government report warning of food and medicine shortages must not be ‘watered down’, Liberal Democrats demand", "url": "https://independent.co.uk/news/uk/politics/no-deal-brexit-latest-yellowhammer-food-fuel-medicine-shortages-boris-johnson-a9087666.html", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:17:45.397375+00:00", "text": "The UK’s top civil servant has been urged to ensure an internal Whitehall dossier laying bare the risks of a no-deal Brexit is published in full, amid fears the document will be “watered down”.\n\nAs rebel MPs mount a last-ditch bid to block a looming no-deal departure, reports emerged that the government will publish a neutralised version of the Operation Yellowhammer document, which warned over possible food, fuel and medicine shortages.\n\nThe Liberal Democrats have written to Sir Mark Sedwill, the cabinet secretary, to demand clarity over whether the public would be offered a “watered-down dodgy dossier that has reportedly been drafted to suit political agendas”.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIn the letter, seen by The Independent, Tom Brake, the party’s Brexit spokesperson, said Whitehall officials who compiled the document should be hauled before MPs to give evidence.\n\nHe said: “Sources familiar with the document, which I understand was compiled by the Cabinet Office, describe the version being prepared for release to the public as ‘soft soap’ and ‘neutralised’.\n\nShape Created with Sketch. Thousands protest after Boris Johnson requests to suspend parliament Show all 29 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Thousands protest after Boris Johnson requests to suspend parliament 1/29 Houses of Parliament AP 2/29 Downing Street AFP/Getty Images 3/29 Houses of Parliament AP 4/29 Houses of Parliament to Downing Street AFP/Getty Images 5/29 Downing Street AP 6/29 Houses of Parliament Getty Images 7/29 Houses of Parliament EPA 8/29 Houses of Parliament AP 9/29 Whitehall AFP/Getty Images 10/29 Houses of Parliament AP 11/29 AP 12/29 PA 13/29 AP 14/29 AP 15/29 AP 16/29 AP 17/29 AP 18/29 PA 19/29 EPA 20/29 AP 21/29 AP 22/29 AFP/Getty Images 23/29 AFP/Getty Images 24/29 Getty Images 25/29 AP 26/29 AP 27/29 Getty Images 28/29 Getty Images 29/29 Getty Images 1/29 Houses of Parliament AP 2/29 Downing Street AFP/Getty Images 3/29 Houses of Parliament AP 4/29 Houses of Parliament to Downing Street AFP/Getty Images 5/29 Downing Street AP 6/29 Houses of Parliament Getty Images 7/29 Houses of Parliament EPA 8/29 Houses of Parliament AP 9/29 Whitehall AFP/Getty Images 10/29 Houses of Parliament AP 11/29 AP 12/29 PA 13/29 AP 14/29 AP 15/29 AP 16/29 AP 17/29 AP 18/29 PA 19/29 EPA 20/29 AP 21/29 AP 22/29 AFP/Getty Images 23/29 AFP/Getty Images 24/29 Getty Images 25/29 AP 26/29 AP 27/29 Getty Images 28/29 Getty Images 29/29 Getty Images\n\n“As the Leader of the Liberal Democrats Jo Swinson said, people deserve better than a watered-down dodgy dossier that has reportedly been drafted to suit political agendas.\n\n“I am therefore writing to ask that you confirm that any ministerial demand that civil servants water down or ‘adapt the truth’ in this document would be tantamount to ministers breaking the ministerial code?”\n\nMr Brake asked for reassurances that civil servants would be protected if they refused to “sanitise” the document, and also asked for the details of those involved so they could be invited urgently to give evidence in parliament.\n\nHe added: “Given the serious threat of medicine and food shortages in the event of a no-deal Brexit, it is only right that the government is fully open and transparent about the detail of Operation Yellowhammer.”\n\nThe Operation Yellowhammer document was leaked last month, setting out warnings over shortages of supplies and chaos at borders in the event of a disorderly break from the EU.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Inside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nSources familiar with the document said it was “currently being neutralised, with all emotive language being stripped out”, according to The Sunday Times.\n\nA Westminster source added: “It’s going to be an update of the leaked version, but it is being made bland.”\n\nMichael Gove, the minister charged with no-deal planning, insisted that it was contingency planning for the most desperate scenarios.\n\nAsked about the dossier on the BBC’s Andrew Marr Show, he said: “One of the things about the Yellowhammer documents is it’s a worst-case scenario.\n\n“And you would expect governments – you know, if everything went wrong this is how we would cope.\n\n“In the same way as in my previous job as environment secretary, we planned for events like floods so we knew that in the event of the worst happening we were ready.”\n\nA No 10 source responded: “The document is changing – it is a live document.”\n\nConcern about the dossier being watered down comes ahead of the launch of the government’s new £100m publicity blitz urging the public to “Get Ready” for Brexit.\n\nA new online portal has been set up help individuals or businesses find out how they could be affected if the UK leaves the EU on 31 October.", "description": "The UK’s top civil servant has been urged to ensure an internal Whitehall dossier laying bare the risks of a no-deal Brexit is published in full, amid fears the document will be “watered down”. As rebel MPs mount a last-ditch bid to block a looming no-deal departure, reports emerged that the government will publish a neutralised version of the Operation Yellowhammer document,", "authors": ["Lizzy Buchan"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/07/26/11/boris-johnson-cummings.jpg"}