{"pub": "fox", "url": "https://foxnews.com/media/citizens-come-together-to-build-custom-homes-for-disabled-vets", "downloaded_at": "2019-09-06 12:14:03.007063+00:00", "title": "Citizens come together to build custom homes for disabled vets: 'It's our way of serving our country'", "language": "en", "text": "In an exclusive Fox Nation series, the founder of Building Homes For Heroes sat down with host Lauren Simonetti to discuss why he began the organization and the overwhelming response he received from citizens across the U.S. in their willingness to help those wounded while serving our country.\n\nCEO and founder Andy Pujol explained that it was the September 11th terrorist attacks that fueled his commitment to the cause. After watching on television as the Twin Towers fell, Pujol immediately loaded up his car with socks, T-shirts, and bandages, totaling over a thousand dollars worth of supplies. \"I don't know why but I knew that was my calling on that day,\" he said. Through the smoke and debris, he drove as close to the scene as he could get and explained to responding officers that he was there to help. The officers declined his assistance at first, he explained, but Pujol credits his \"defiance\" for convincing them to lend him gear and allow him onto the scene.\n\nTEAM PATRIOT BANDS TOGETHER WOUNDED VETS TO SERVE OTHERS THROUGH DISASTER RELIEF\n\n\"I remember sitting on the rubble looking around at these amazing heroes,\" said Pujol. \"There's a saying from the prophecy of Isaiah: 'they shall mount up with wings of an eagle and they shall run, and they shall not grow weary.' That's what I thought of those first responders and I knew there and then that I was going to serve my country. There was no doubt in my mind,\" he said.\n\nNAVY VETERAN TRAVELS US TO COLLECT STORIES OF FALLEN SERVICE MEMBERS\n\nPujol joined forces with his neighbor who had a background in construction, and they set out to achieve what seemed like an overly ambitious goal: to build one home for a severely wounded veteran. Pujol raised the necessary funds, and together with a small team, the home was completed after a year in mid-2007.\n\n\"I'm going to be honest, we had no idea what the hell we were doing, it was grassroots...we were scrambling,\" he said, explaining the many unknown issues that arose throughout the building process.\n\nAs time went on, Pujol and his team became experts and their passion soon turned one home into many more, changing the lives of one deserving veteran after another. The most moving part of the whole process said Pujol, is the \"homecoming ceremony\" that each veteran receives upon their arrival at their new home, which includes military members, police escorts, and an outpouring of community support.\n\n\"The opportunity to give back to those who have given so much to this country is amazing and each and every ceremony never gets old. Every family is different, the children, the parents, seeing their smiles,\" said Chad Gottlieb, the head contractor of the organization.\n\nDespite the many challenges that arose throughout the process -- such as a halt in donations due to the recession and a cancer diagnosis from the toxic exposure of the 9/11 site, Pujol was determined to turn Building Homes for Heroes into a large scale organization.\n\nCLICK HERE FOR THE FOX NEWS APP\n\n\"If the veterans got through this...\" Pujol explained, so would he. 15 years after it's launch, Building Homes for Heroes has built over 170 homes, changing the lives of disabled veterans across the country, with the goal of building 300 homes by 2022. Their small team, many of whom do not take a salary, said they are \"overwhelmed every day\" and excited about extending the organization to offer more services, such as psychiatric care and financial planning assistance.\n\n\"Those heroes are our veterans, those heroes are those that served at 9/11. They went and served their country. They put on those wings, and they ran straight into it and they never grew weary,\" said Pujol. \"I'm determined to keep going and press on to reach our 200th home, our 500th home...it gives all of us the ability to have that opportunity to serve our country.\"\n\nTo see more full episodes featuring heartwarming stories of veterans who received their dream homes, visit Fox Nation and watch \"Building Homes for Heroes,\" today.\n\nCLICK HERE TO SIGN UP FOR A FOX NATION FREE TRIAL\n\nFox Nation programs are viewable on-demand and from your mobile device app, but only available only for Fox Nation subscribers. Go to Fox Nation to start a free trial and watch the extensive library from Tomi Lahren, Pete Hegseth, Abby Hornacek, Laura Ingraham, Greg Gutfeld, Judge Andrew Napolitano and many more of your favorite Fox News personalities.", "description": "In an exclusive Fox Nation series, the founder of Building Homes For Heroes sat down with host Lauren Simonete to discuss why he began the organization and the overwhelming reaction he received from citizens across the U.S. in their willingness to help those wounded while serving our country.", "authors": ["Yael Halon", "Yael Halon Is A Reporter For Fox News."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Wheelchair-House-iStock.jpg", "published_at": "2019-09-05"}