{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-eu-barnier/eus-barnier-says-no-deal-brexit-risk-persists-trade-talks-to-be-difficult-idUKKBN1X91RG", "downloaded_at": "2019-10-30 23:26:17.447811+00:00", "title": "EU's Barnier says no-deal Brexit risk persists, trade talks to be 'difficult'", "language": "en", "text": "BRUSSELS (Reuters) - The European Union’s Brexit negotiator Michel Barnier said on Wednesday the risk of Britain’s chaotic departure from the bloc without a divorce agreement still existed, and that future trade talks would be “difficult and demanding”.\n\nThe European Union's Brexit negotiator Michel Barnier addresses the European Economic and Social Committee, at the EU Parliament in Brussels, Belgium October 30, 2019. REUTERS/Yves Herman\n\nBarnier spoke as Britain was headed for a Dec. 12 national election that Prime Minister Boris Johnson hopes will unlock the Brexit stalemate after his fractious parliament refused to swiftly ratify his divorce deal with the EU.\n\n“The risk of Brexit happening without a ratified deal still exists,” Barnier told a speech in Brussels. “We still need to prepare.”\n\n“In all member states, there is a big difference in preparedness between bigger companies and SMEs. It’s not time to become complacent. Work with SMEs in particular needs to continue,” he said, referring to small and medium enterprises.\n\nHe said a no-deal split could happen at the end of January, if the British parliament failed to ratify Johnson’s deal and London did not get another delay on the divorce.\n\nIt could also happen at the end of the status-quo transition period envisaged after Brexit until the end of 2020, Barnier said, if no new trade deal is agreed between the two sides by then and no extra time is given to achieve that.\n\nThe Frenchman warned there was precious little time between the Brexit day and the end of 2020 to agree a new trade deal.\n\n“It will be a difficult and demanding set of negotiations,” he said. “The time we have at hand to conclude this negotiation will be extremely short, 11 months.”\n\n“Because of our geographic closeness and our economic interdependence ... we want to have solid guarantees on the level-playing field aspects.”\n\nBarnier warned the bloc will only give Britain as much access to its single market after Brexit as is justified by London ensuring that EU rules and standards are preserved.\n\n“We will keep a close watch and be extremely vigilant on ... social rights, environmental protection, state aid and obviously on issues of taxation.”\n\n“We want zero tariffs, zero quotas and zero dumping.”\n\nNEW DEAL\n\nBarnier said Johnson’s aim of getting a trade deal with no tariffs or quotas was “insufficient” and that the first “moment of truth” to assess whether more time was needed for trade talks would come next summer.\n\n“Brexit is not a destination. It’s not an end in itself, at least not for us. It’s a staging post, it’s difficult juncture. But after Brexit... we will need to reestablish all sorts of things.”\n\nHe said those included trade in goods, services and investment, data protection, transport and energy, fisheries, judicial and police cooperation, foreign policy, security and defense.\n\nWhile he stressed the bloc was keen to keep Britain close in the all these fields, things would change.\n\n“Once the UK has left the EU, they cannot be treated as a member. They will be a third country with a special relationship, very close,” Barnier said. “Brexit does not mean business as usual. Brexit is breaking away from almost 45 years of partnership.”\n\nSlideshow (9 Images)\n\nBut Barnier also stressed the 27 EU states staying on together must draw lessons from Brexit and seek to address their population’s anger and frustrations.\n\nIn a thinly veiled reference to inaccuracies spread by campaigners during Britain’s 2016 Brexit referendum, Barnier added: “One of the lessons of Brexit is - tell the truth, quite simply.”\n\n(The story is refiled to make it “interdependence” instead of “independence” in ninth paragraph)", "description": "The European Union's Brexit negotiator Michel Barnier said on Wednesday the risk of Britain's chaotic departure from the bloc without a divorce agreement still existed, and that future trade talks would be \"difficult and demanding\".", "authors": ["Gabriela Baczynska", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191030&t=2&i=1446600757&w=1200&r=LYNXMPEF9T1AW", "published_at": "2019-10-30"}