{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7570263/Irish-funeral-bursts-laughter-pre-recorded-message-dead-man-played.html", "downloaded_at": "2019-10-14 10:17:36.203012+00:00", "title": "Irish funeral bursts into laughter after pre-recorded message of dead man is played", "language": "en", "text": "Mourners in Ireland couldn’t believe it when they heard a voice beyond the grave at a local man’s funeral.\n\nThose who attended the funeral of Irish Defence Force veteran Shay Bradley on Saturday in Kilmanagh, Leinster, couldn’t believe it when he started speaking to them from his coffin.\n\nAs they watched his coffin being buried his voice could be heard shouting: 'Hello, hello. Let me out.'\n\nThis is the moment the mourners at the grave site can be seen bursting into laughter after hearing the message Shay Bradley put into his coffin before his death\n\nThe Irish Defence Force Veteran, who died on October 8, wanted to give the mourners one last laugh in his final goodbye\n\nShay's daughter Andrea said that the message was recorded before he died and put out via a speaker on the ground\n\nAs the recording played the sound of him knocking on the wood of the coffin, he continued: 'Where the f*** am I? Let me out, let me out. It’s f - ing dark in here. Is that the priest I can hear. This is Shay I’m in the box. No in f - ing front of you. I’m dead.'\n\nShay then sings: 'Hello again hello, hello I just called to say goodbye.'\n\nMourners laughed hysterically as Shay, who passed on October 8 following a long illness, had the last laugh in saying his final goodbye.\n\nHe can be heard seemingly knocking on the wood of the coffin shouting: 'Where the f*** am I?'\n\nThe funeral attendees look down into the coffin as Shay appears to sing: 'Hello, hello I just called to say goodbye'\n\nAll of the mourners can be seen laughing at Bradley's voice calling to be freed from the coffin\n\nThe video of the service has now gone viral and yesterday was shared by Irish Defense Forces veterans' news who said: 'It is with great sadness that I was informed of the passing of our Military Brother and Veteran Colleague Shay Bradley. On behalf of the members of the IDFVA I extend our sincerest condolences and prayers to Anne and family at this sad time. May Shay Rest in Peace.'\n\nThey later added: 'Was asked a question the other day, it was what's the difference between military humour and civilian humour it's simple it's black. This video should say it all. This is the funeral of Shay Bradley on the 12 of October 2019 and it says it all......'\n\nShay's daughter Andrea explained that the message was recorded before Shay passed and was put out via a speaker on the ground. She said on Twitter: 'He would love to know how many people he made laugh!!! He was an amazing character.'", "description": "Mourners at the funeral of Irish Defence Force veteran Shay Bradley in Kilmanagh in Leinster on Saturday, couldn't believe it when they heard Bradley shouting 'let me out' from the coffin below.", "authors": ["Ryan Fahey For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/08/19681014-0-image-a-2_1571039625509.jpg", "published_at": "2019-10-14"}