{"pub": "metro", "url": "https://metro.co.uk/2019/10/11/man-bludgeoned-wife-death-crowbar-filmed-lying-police-moments-later-10904574", "downloaded_at": "2019-10-12 00:17:42.676447+00:00", "title": "David Pomphret: Guilty of bludgeoning wife to death with crowbar", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nA man who brutally bludgeoned his wife to death with a crowbar was caught on camera moments after the attack telling police he had no idea what happened to her.\n\nFootage shows David Pomphret, 51, in the back of an ambulance with his head in his hands telling officers he tried to do ‘mouth-to-mouth’ on his wife, Ann Marie, 49, who lay motionless nearby.\n\nAdvertisement\n\nAdvertisement\n\nThe dad-of-one has been found guilty of murdering his wife after striking her more than 30 times in a ‘frenzied attack’ at their horse stables near their home in Winwick, Cheshire, on November 2, last year.\n\nThe Barclays bank worker, who was described as a ‘quiet man’, claimed he had suffered a temporary loss of control and should only be found guilty of manslaughter.\n\nBut a jury at Liverpool Crown Court found him guilty of murder on Friday after a 10-day trial and faces life in prison.\n\nFollowing the attack, Pomphret dialled 999 saying he had found his wife lying in a pool of blood, ‘very dead’, adding: ‘There is brain and blood everywhere, and it looks like she has had her head beaten in.’\n\nDavid Pomphret was found guilty of his wife’s murder (Picture: PA)\n\nAnn Marie was struck more than 30 times with a crowbar (Picture: PA)\n\nPomphret denied he planned the murder and then tried to cover his tracks, before he was released on bail.\n\nBut his wife’s airborne blood was found on his socks he had forgotten to change – a ‘huge mistake’ which put him at the scene of the crime.\n\nThe jury was told how Pomphret had to change his story and later admitted to the court ‘I killed the woman I loved’.\n\nHe blamed his wife’s ‘volatile’ behaviour during their 22-year marriage and claimed he was at ‘breaking point’ but remembered nothing of the attack.\n\nGordon Cole QC, prosecuting, told the jury that if it weren’t for the socks there would be no forensic evidence linking him to the crime scene.\n\nAdvertisement\n\nAdvertisement\n\nIt was heard how he had washed the blood off his hands, thrown the crowbar into a pond and burned then discarded his bloodstained clothes.\n\nThe trial heard that the couple met on Mrs Pomphret’s 21st birthday and were ‘happily married’ with one daughter, 18-year-old Megan.\n\nPomphret dumped his weapon in a pond to cover his tracks (Picture: PA)\n\nThe pair had been seen shopping in Asda earlier that day (Picture: PA)\n\nBut over the course of their relationship, he claimed his wife’s physical and mental health deteriorated.\n\nThe mother was on the autism spectrum, suffering with Asperger syndrome, and had recently undergone treatment for cancer.\n\nIt was heard how on the day Pomphret killed his wife, it had been a normal day and the couple had gone to Asda before visiting the stables to check on their horses.\n\nPomphret said he needed to pick up tools to fix the shower at home but she shouted he was ‘f****** crazy’ and ‘just going to create more shit’, before criticising their daughter.\n\nHe told the court: ‘She ranted at me for being a bad parent, calling me f****** useless. Called me limp and useless. I was not performing very well.\n\n‘Marie was at this point raging, absolutely raging, finger pointing, screaming. She then slapped me across the face.\n\n‘Er, I remember reaching out, grabbing her hood and … I don’t remember.\n\n‘I was standing at the side of her body. There was blood on my hands and the crowbar. She was on the floor.’\n\nHe bludgeoned his wife at the stables where they kept their horses (Picture: Google Maps)\n\nDefensive injuries to his victim’s hands and arms were found as his wife covered her head to try to avoid the blows.\n\nAdvertisement\n\nDetective Inspector Adam Waller, of Cheshire Police, said: ‘This case was truly shocking and one of the biggest investigations the constabulary has seen in recent years.\n\n‘The injuries sustained by Ann Marie were horrific and all those involved in this investigation were determined to find her killer and ensure they were brought to justice for their actions.\n\n‘What Pomphret did that day ripped a family apart and he will now have to face the consequences of that behind bars.\n\n‘I hope that, whilst it won’t bring Ann Marie back, seeing justice being done will help them in some way.’\n\nJudge David Aubrey told Pomphret he would set the minimum term before the defendant is eligible for parole when he passes sentence next Tuesday.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "David Pomphret was found guilty at Liverpool Crown Court after his wife's 'airborne' blood was found on his socks.", "authors": ["Elisa Menendez"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89491319_1570827818.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-11"}