{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/28/apple-announces-airpods-pro-with-noise-cancellation", "downloaded_at": "2019-10-29 00:16:05.988626+00:00", "title": "Apple announces AirPods Pro with noise cancellation – TechCrunch", "language": "en", "text": "Apple just announced a new device today, the AirPods Pro. The company issued a press release to announce the new device. As the name suggests, the AirPods Pro are wireless earbuds with additional features compared to the AirPods.\n\nIn particular, the AirPods Pro features active noise cancellation — this feature is particularly popular in headphones designed for airplanes, such as the Bose 700 and Sony WH-1000XM3.\n\nApple has integrated two microphones in each earbud to listen to background noise and actively cancel sound around you. One of the microphones is inward-facing and listens to the sound inside your ears. The company has also integrated adaptive EQ to tune the low- and mid-fequencies in real time depending on the shape of your ears.\n\nYou can switch between active noise cancellation and something called Transparency mode in order to block background noise or let background noise go through your earbuds. You can control that from your device or squeeze the bottom of the earbuds between your fingertips.\n\nThe design of the AirPods Pro is slightly different from the AirPods. They look like in-ear earbuds with flexible silicone ear tips. You’ll be able to swap those ear tips as there are three different sizes in the box. The AirPods Pro are also sweat and water-resistant.\n\nBehind the scene, the AirPods Pro work with an Apple-designed chip called the H1. This chip handles everything from real-time noise cancellation to audio processing and the ability to respond to “Hey Siri” requests.\n\nApple says that you can expect the same battery life that you’d get with regular AirPods — four and half hours of listening time with active noise cancellation and up to 24 hours of listening time with the charging case.\n\nThe charging case also looks slightly different — it is now rectangular-shaped. It features a Lightning port and wireless charging.\n\nThe AirPods Pro will be available for $249 starting on October 30. You can order them on Apple’s website starting today. Regular AirPods remain available for the same price of $159 to $199, depending on whether you get the wireless charging case.", "description": "Apple just announced a new device today, the AirPods Pro. The company issued a press release to announce the new device. As the name suggests, the AirPods Pro are wireless earbuds with additional features compared to the AirPods. In particular, the AirPods Pro features active noise cancellation — this feature is particularly popular in headphones […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/AirPods-Pro.jpg?w=750", "published_at": "2019-10-28"}