{"pub": "arstechnica", "url": "https://arstechnica.com/gadgets/2019/09/lenovo-thinkbook-13s-review-thinkpad-influences-at-a-great-price", "downloaded_at": "2019-10-05 10:33:39.602785+00:00", "title": "Lenovo Thinkbook 13s review: ThinkPad influences at a great price", "language": "en", "text": "Lenovo's ThinkPad family has a lot of fans, but not everyone can spend ThinkPad money on a laptop. Designed for small business customers (and regular consumers who want a more privacy-focused machine), Lenovo's new Thinkbooks seem like an experiment to boil the essence of a ThinkPad down into its most important parts and put those pieces in a more affordable package.\n\nOn paper, it seems Lenovo has done just that: the new Thinkbook 13s has a stress-tested aluminum body, comfortable keyboard, webcam privacy shutter, fingerprint reader, and other things that you'd find on a ThinkPad machine. But the Thinkbook's attractive starting price of $734 truly helps it stand out as an option for anyone who wants not just a ThinkPad alternative but a relatively affordable Windows machine as well.\n\nLook and feel\n\nSpecs at a glance: Lenovo Thinkbook 13s Worst Best As reviewed Screen 13.3-inch 1920×1080p anti-glare IPS non-touch OS Windows 10 Home 64 CPU Core i5-8265U Core i7-8565U Core i5-8265U GPU Intel UHD Graphics 620 RAM 4GB 16GB 8GB Storage 128GB PCIe SSD 512GB PCIe SSD 256GB PCIe SSD Networking 802.11AC (2 x 2), Bluetooth 5.2 Ports 2 x USB-A 3.1, 1 x USB-C, 1 x HDMI, 1 x headphone jack, 1 x power port Size 12.11×8.52×0.63 inches (307.6×216.4×15.9 mm) Weight 2.95 pounds (1.34 kg) Price $734.30 $1,154.30 $832.30 Other perks Webcam shutter, fingerprint reader on power button\n\nLenovo Thinkbook 13s $734.30 from Lenovo (Ars Technica may earn compensation for sales from links on this post through affiliate programs .)\n\nLenovo tried to give a ThinkPad machine the \"modern ultrabook\" makeover, and the result is the updated Thinkbook. That's not a derogatory statement—the Thinkbook 13s is quite attractive, and I wouldn't guess that it's a notebook with a $734 starting price. It has a slate gray color scheme that uses a lighter gray color on its anodized aluminum chassis, a darker gray on its keycaps, and shiny accents on the edges of the trackpad and a few other locations. Overall, it looks most akin to an IdeaPad notebook with some design influences from the ThinkPad X lineup.\n\nSo you won't get the thin-and-light design that comes from a carbon-fiber ThinkPad X1 Carbon, but that's part of why the X1 Carbon costs $1,253 while the Thinkbook starts at $734. Nevertheless, the Thinkbook isn't painfully heavy at 2.95 pounds, nor is it too chunky with its 16mm thickness. It also makes the laptop large enough to fit one full-sized HDMI port and two USB-A ports on its sides, along with a USB-C port, headphone jack, and a power port. The only downside is that you have to charge the Thinkbook with the included power cable, as the lone USB-C port only supports audio, video, and data transfer.\n\nThe tube-like hinge allows the display panel to tilt back 180 degrees, but that's as far as it will go. The thick bezels surrounding its display, particularly the wide chin, also signal its place as a more affordable ThinkPad alternative. The panel options you have are also limited to just one, a 13.3-inch 1080p IPS non-touch panel, whereas you have FHD and 4K, touch and non-touch, and PrivacyGuard options on ThinkPad X1 laptops.\n\nAbove the display sits a webcam with its physical shutter. Simply move the textured slider to cover the webcam whenever you want extra privacy. Lenovo was one of the first OEMs to bring webcam shutters to most of its higher-end laptops and convertibles, and we're glad to see them make an appearance on the Thinkbook. Designed primarily for small business customers, the Thinkbook should have extra privacy features that regular consumer devices may lack.\n\nA fingerprint reader provides an extra layer of security as well, and it's built into the power button that sits on the top-right side of the keyboard area. The button is surrounded by a glowing ring of light that gives it a more premium feel, while also letting you know exactly where your finger should go when you're trying to sign in using biometrics. The reader-button combo also supports one-touch power and sign-on, so one press of the power button with the correct finger will turn on the device and sign you in within seconds.\n\nUltimately, the Thinkbook is designed for people who are slightly more business-minded and privacy-conscious than the average person and who want a laptop that matches those requirements with standard features that other consumer laptops have as optional add-ons. The webcam shutter and power-button fingerprint reader are paramount among those, as are FIDO authentication capabilities and a discrete TPM that encrypts data. The only additional feature I'd want is Lenovo's PrivacyGuide screen protector, and that's because I often work from places that are not my home or a secure office. Unfortunately, customers who want the same thing will have to look to the ThinkPad family instead.\n\nThe assumption is that customers like these also want an attractive yet durable laptop, and the Thinkbook 13s fits that bill. It's not MIL-spec tested like ThinkPad devices are, but its aluminum chassis is sturdy, relatively lightweight, and attractive in an unassuming, professional way.\n\nValentina Palladino\n\nValentina Palladino\n\nValentina Palladino\n\nValentina Palladino\n\nValentina Palladino\n\nValentina Palladino\n\nValentina Palladino\n\nValentina Palladino\n\nKeyboard and trackpad\n\nOne of the best things Lenovo carried over to the Thinkbook from the ThinkPad line is the keyboard. It's not exactly the same as that on the ThinkPad X1 Carbon—it doesn't use the same underlying mechanism, and the keys have 1.5mm of travel—but it's still a great keyboard to type on. The keycaps are sufficiently clicky, giving you just enough tactile feedback with little noise. The keys are backlit as well, and you can turn on or off the backlight whenever you want by pressing Fn + Spacebar. Small business customers will also appreciate the row of hotkeys at the top of the keyboard that let you quickly answer or end Skype calls, among other things.\n\nThe Precision trackpad is solid. It's an average size for a trackpad on a 13-inch notebook; it's nowhere near as big as those on MacBooks, but not everyone needs that much trackpad space. The trackpad itself clicks even though it does not have dedicated right- and left-click buttons, and sadly there's no TrackPoint ball on the Thinkbook. Admittedly, TrackPoint support today is a luxury rather than a standard feature, and those who want it will have to look, again, to a ThinkPad machine.\n\nPerformance\n\nOur Core i5 test model of the Thinkbook 13s has the same CPU, GPU, RAM, and storage that our 7th gen ThinkPad X1 Carbon review unit has (keep an eye out for that review coming soon). Both machines produced scores in the same range on our benchmark tests, although the X1 Carbon proved slightly more efficient than the Thinkbook 13s overall. You can get the Thinkbook 13s with a Core i7 processor, but we wanted to test a more affordable model to see how much power you get in a sub-$1,000 machine—and the answer to that question is \"quite a bit.\"\n\nWe've tested a few other laptops that are going after the same types of users as the Thinkbook 13s, namely the HP Envy 13 and the Dell Inspiron 13 7000 Black Edition. However, all of those review units had Core i7 processors, so unsurprisingly, the Thinkbook 13s did not score as high as the others did in most of our benchmark tests. Nevertheless, the Thinkbook 13s was a perfectly fine laptop for me to use as my daily machine during the few days I spent testing it.\n\nStill, we did not test the base model of the Thinkbook 13, which has the same CPU and GPU as our review unit, just with 4GB RAM and 128GB SSD. Those lower specs would certainly have affected the Thinkbook 13s' benchmark scores, and not in a good way. We wouldn't recommend a Windows machine with just 4GB of RAM—today, that's only suitable for Chromebooks, and even then I would recommend springing for a device with 6GB or 8GB of RAM if it's available and you can afford it.\n\nThe 128GB of storage isn't as concerning, especially if most of your activity lives online or in the cloud, but you risk filling up your SSD very quickly on a Windows machine if you download lots of apps, programs, and games. Chromebooks, on the other hand, aren't designed to hold many files and programs in local storage, which is why they can get away with just 32GB or 64GB of eMMC storage.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBattery\n\nThe Thinkbook's battery life stands up well against its competition. It lasted an average of 752 minutes, or about 12.5 hours, on our default battery test and an average of 579 minutes, or just over 9.5 hours, on our webGL test. Both of those scores are better than the ones from the HP Envy 13 and the Dell Inspiron 13 7000 Black Edition, so you shouldn't have to worry too much about the Thinkbook 13s dying on you before a long day's work is over.\n\n\n\n\n\nAffordability, without power constraints\n\nSolid and affordable don't usually go together when it comes to Windows laptops. While there are plenty of Windows machines under $500, most of them make sacrifices in power and features that make them suitable for select users only. For example, most of them rely on Intel Pentium, Celeron, or Core i3 processors to get work done, and that just won't cut it for users who are working professionals or small business owners.\n\nAnd while OEMs race to make the next amazing flagship Windows device that costs at least $1,000, that awkward space in between $500 and $1,000 often gets neglected. The Thinkbook is a great addition to that price range. Not only does it translate a lot of ThinkPad-esque features for a different customer base, but it also has the right amount of power for those who can't afford to be super-cheap when selecting a new laptop.\n\nIt also helps that the Thinkbook has a sturdy yet professional design that nods to modern flagship devices. The Thinkbook looks more akin to a Dell XPS or an HP Envy device even more so than the ThinkPad X1 Carbon, which will certainly appeal to some users. I appreciate that Lenovo didn't skimp on the small details, either—the Thinkbook doesn't have a sub-par trackpad or oddly placed keys, its default display panel is decent, and it has privacy features including a shutter-able webcam and a fingerprint sensor that other OEMs would only put on higher-end devices.\n\nThe biggest competition for the Thinkbook 13s is HP's Envy 13 laptop. Both are great machines, but you can currently get the Envy 13 with a Core i7 processor, 8GB of RAM, and 256GB SSD for $749. The Envy 13 is the device to get if you like a flashier laptop, but the Thinkbook 13s is a solid alternative for those who prefer professional, utilitarian design and privacy features above all else.\n\nThe Good\n\nModern, professional design\n\nPhysical webcam shutter\n\nFingerprint on power button\n\nStandard FIDO authentication and TPM\n\nGreat keyboard\n\nSolid performance\n\nThe Bad\n\nNo IR camera\n\nOnly one display panel option (and no touchscreen option)\n\nThe Ugly", "description": "Almost anyone can appreciate this solid Windows laptop that starts at under $750.", "authors": ["Valentina Palladino"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/08/thinkbook13_1-760x380.jpg", "published_at": "2019-09-07"}