{"pub": "mirror", "url": "https://mirror.co.uk/travel/news/best-destinations-winter-sun-holidays-13150479", "downloaded_at": "2019-10-25 16:11:56.228034+00:00", "title": "Best winter sun destinations including top holiday deals", "language": "en", "text": "Get the biggest Weekly Travel stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nEarlier this year when the summer heatwave was in full swing, most people were dreaming of the cooler autumn temperatures and cosy winter evenings.\n\nBut for those who love the summer weather, the winter's colder temperatures and dreary weather are anything but welcome.\n\nThe good news? There are some brilliant winter sun destinations you can escape to for glorious balmy weather and heaps of sunshine - and in some cases our winter is just when their summer is getting started.\n\nIt's the perfect excuse to use up the last of that annual leave, or even spend a memorable festive season ditching coats and mulled wine in favour of white sand beaches and poolside cocktails.\n\nTo give you a helping hand, we've put together a guide to some of the best winter sun holiday destinations to suit a wide array of budgets, as well as the firms offering tempting deals.\n\nCheck out our top picks below...\n\n1. Dubai\n\n(Image: EyeEm)\n\nDuring the winter months the city still boasts temperatures around 26C, perfect if you plan to make the most of the city's beaches or want to lounge by the hotel pool.\n\nHowever it's not so hot that you can't enjoy the plethora of things to see and do in Dubai , from the theme parks to epic malls and landmarks such as the Burj Khalifa.\n\nPlanning to make the most of the attractions? It's worth looking into a Dubai Pass where you could stand to save up to 50% off a host of the top must-see sights.\n\nBest places for Dubai city break packages:\n\n2. Thailand\n\n(Image: Moment RF)\n\nThe best time to visit Thailand is between November to January when it's dry season and the temperatures are delightfully balmy.\n\nThe country is filled with epic sights and attractions so to give you a helping hand we've put together a guide to the best things to see and do .\n\nFancy a city break? Head to Bangkok where glorious temples, floating markets and an incredible foodie scene await. Or of course you could spend a few days making the most of Thailand's most beautiful beaches .\n\nBest places for Thailand holidays:\n\n3. Canary Islands\n\nThe Canary Islands won't be the hottest spots during the winter but temperatures tend to be around 20C and with heaps of sunshine, making for ideal conditions if you want to go exploring more than just the beaches.\n\nFor example you could discover the incredible volcano park in Lanzarote, sample the incredible seafood in Tenerife, or go for picturesque walks along the beaches in Gran Canaria.\n\nBest places for Canary Islands breaks:\n\n4. Cape Verde\n\n(Image: Alamy)\n\nCape Verde is renowned for offering up a relaxing holiday unlike any other; and with 10 islands to explore, there's still ample opportunity to have an adventure or two.\n\nHowever if you only visit one spot, make it the beautiful Sal Island. It tends to be a hit with holidaymakers thanks to the white sand beaches and crystalline waters that make up its shores, not to mention it also offers a plethora of things to see and do .\n\nBest places for Cape Verde holidays:\n\n5. Dominican Republic\n\n(Image: iStockphoto)\n\nThose looking for adventure won't be disappointed on a visit to the Dominican Republic.\n\nExpect incredible national parks filled with waterfalls, lush greenery and lakes, not to mention its seriously beautiful beaches.\n\nOr you could even be really brave and go jumping down 27 waterfalls near Puerto Plata at the popular tourist attraction.\n\nBest places for Dominican Republic holidays:\n\n6. Cape Town\n\n(Image: iStockphoto)\n\nSummer in South Africa kicks off in November through to the end of February, meaning you can enjoy temperatures of around 25-27C - perfect for spending the day on one of Cape Town's beaches, or heading up to Table Mountain to take in the spectacular views.\n\nFor something really special make sure to head to Boulders Beach, famed for being the home of a wide array of colonies of penguins.\n\nBest places for Cape Town city breaks:\n\n7. Barbados\n\n(Image: Getty)\n\nIf the idea of a snowy Christmas break doesn't appeal, then Barbados could make for a once-in-a-lifetime festive season.\n\nDecember temperatures can be around 28C meaning you'll have heaps of hot weather and sunshine - and of course Barbados beaches are the ideal spot to enjoy them.\n\nBest places for Barbados holidays:\n\n8. Morocco\n\n(Image: Getty Images/iStockphoto)\n\nWhether you're planning to explore the hustle and bustle of Marrakech, or relax in a swish riad, Morocco offers up a wide range of holiday types.\n\nThe bustling markets are ideal for picking up souvenirs, while temperatures tend to range around the 20C mark, making for ideal conditions if you plan to go exploring.\n\nBest places for Morocco holidays:\n\n9. Caribbean\n\n(Image: Getty)\n\nThe Caribbean in general can be a great destination during the winter months whether you're visiting a host of islands on a cruise holiday, or looking to spend a week making the most of the picture-perfect islands.\n\nThere are plenty of great value Caribbean spots and while it won't be the cheapest of holidays, there are deals to be found if you are trying to stick to a budget.\n\nBest places for Caribbean holidays:\n\n10. Australia\n\n(Image: Cultura RF)\n\nWhether the Sydney Opera House has always been on your bucket list, or you've always dreamed of exploring the Outback, Australia offers everything from bustling city breaks to remote desert escapes.\n\nIt's a once-in-a-lifetime trip but one that does come with a hefty price tag, so if you're on a budget it's worth considering escorted holidays which include your accommodation and excursions to get a taste of the biggest highlights.\n\nBest places for Australia holidays:\n\nLooking for holiday deals?\n\nCheck out our Holiday Deals page which we regularly update with the latest flash sales, offers and insider tips to help you nab the best travel bargains.", "description": "Best winter sun holiday destinations that are ideal for a December holiday if you're not a fan of the colder British weather", "authors": ["Julie Delahaye", "Image", "Johner Rf", "Eyeem", "Moment Rf", "Alamy", "Istockphoto", "Getty", "Getty Images Istockphoto", "Cultura Rf"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article12374506.ece/ALTERNATES/s1200/Shirley-Heights-Antigua.jpg", "published_at": "2018-08-28"}