{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7550957/No-Abaya-no-entry-Businesses-Saudi-Arabia-choose-ignore-governments.html", "downloaded_at": "2019-10-09 19:11:17.601378+00:00", "title": "No Abaya, no entry!: Businesses in Saudi Arabia can choose to ignore the government's", "language": "en", "text": "Some business owners in Saudi Arabia are refusing to follow out the Crown Prince’s relaxation of laws, according to reports from visitors to the kingdom.\n\nA 42-year-old female teacher from Canada, who recently visited the country, told MailOnline that a security guard at Dhahran mall in Dhahran, northeast of Riyadh, stopped her friend from entering because she was not in full Islamic dress.\n\nThe guard said that he would follow his employer’s rules and not those of Saudi Crown Prince Mohammed bin Salman.\n\n‘No abaya, no entry,’ the guard was reported as saying.\n\nA recent visitor to Saudi Arabia said her friend was refused entry to the Mall of Dhahran (pictured), a four-hour drive from Riyadh. Despite the Crown Prince's recent attempts to liberalise the country and to allow foreigners to wear 'modest' clothing, it appears as though not all sections of Saudi society are on board with the plan\n\nA stock image shows women dressed in the full abaya gown at a mall in Riyadh. Malls and other private businesses are able to set their own regulations for what they consider appropriate dress\n\nSaudi human resources professional Mashael al-Jaloud, 33, walks in western clothes past women wearing niqab, an Islamic dress-code for women, at a commercial area in the Saudi capital Riyadh on September 3. Though some 'older generations' are resistant to the loosening of conservative laws in the kingdom, and to the allowances provided to tourists, there have been some big moves forward in the kingdom. Some women are beginning to challenge the ultra-religious rules after Crown Prince Mohammed bin Salman hinted that the dress code could be relaxed for them as well as foreign women\n\nMalls and other private businesses are able to set their own regulations for what they consider appropriate dress. This can include adhering to the absolute Shari'ah that was - until the end of last month - applied to both foreigners and locals in the country.\n\nThe Saudi Commisson for Tourism responded to MailOnline confirming that businesses are able to decide what is worn on their premises:\n\n‘As is the case in businesses across the world, businesses may set their own dress codes.\n\n‘The new guidelines are being issued to businesses clarifying public policy and encouraging them to provide clear information to their employees and customers,’ they said.\n\nAt the end of September, Saudi Arabia announced it would throw open its doors to foreign tourists from 49 countries, including the UK and US.\n\nVisitors can be seen photographing the new slogan for Saudi tourism outside a gala evening hosted by the Saudi Commission for Tourism and Heritage at Al Diriyah in Riyadh, Saudi Arabia. The conservative kingdom forbids sex outside of marriage so, until now, individuals had to prove they were related in order to share a room together\n\nThe introduction of the Saudi E-Visa (pictured) for 49 countries is an attempt to diversify the country's economy and to prepare it for a post-oil future. Up until recently, men and women caught mingling in public, even foreigners, faced severe punishments\n\nFurther announcements in the following days promised a series of dispensations to relax foreign women having to wear Islamic dress in public. This, paired with allowing unmarried foreign couples to sleep in the same bed in hotel rooms, hopes to attract people who may have been put off in the past.\n\nPremarital sex falls under the category of adultery according to Shari'a law and, for unmarried Saudis, having sex outside of wedlock risks imprisonment, stoning or the death penalty. Up until the recent announcements, these laws also applied to tourists.\n\nFor decades Saudi Arabia has been a closed country with visas only awarded to those on business or attending pilgrimage to the holy cities of Mecca and Medina.\n\nIn line with MBS's 2030 vision plan, the de facto ruler of the country aims to diversify Saudi's economy in preparation for a post-oil future.\n\nHe hopes to achieve 100 million annual visits by 2030. At present, the country relies on oil for 70 per cent of its export earnings.\n\nA 28-year-old IT developer from Riyadh, who has spent 10 years of his life living and studying in France and the UK, told the MailOnline that the older, more conservative generation, are those who are resisting the 'badly needed' reforms.\n\n‘People who are opposing it [the new laws] are old people who have no idea what’s happening now,’ he said.\n\n‘And they better accept the new changes and not disagree with it because it is badly needed.’\n\nThis picture taken in August shows a view of a room in a luxury hotel overlooking the Kaaba, Islam's holiest shrine, and its encompassing Grand Mosque in Saudi Arabia's holy city of Mecca. Most visitors to the conservative kingdom have been for the holy pilgrimage but Saudi Arabia is now open to tourists from 49 countries though Mecca is still off limits for non-Muslims. The country's tourism board has confirmed that foreign couples will now be able to stay together in the same room\n\nThe Saudi source added that Muslim clerics - the source of religious guidance for many Saudis - have ‘acknowledged that we were too extreme’ and are modifying their prescriptive sermons to ‘stay in power’ and keep favour with the royal family.\n\nThis has included preaching that it is okay for tourists to ignore some religious customs because they are not Muslim.\n\nTo achieve the staggering number of visits needed to move away from oil-dependence, MBS is trying to brush up Saudi's reputation to make it more appealing to the rest of the world.\n\nThe brutal extrajudicial butchering of Washington Post columnist, Jamal Khashoggi, caused international condemnation and left a bloody stain on the country which has proven difficult to wash off.\n\nSaudi Arabia's Crown Prince Mohammed bin Salman (pictured right) at a meeting with US Secretary of State Mike Pompeo in Jeddah earlier this month. Jamal Khashoggi (pictured left) was killed after entering the Saudi consulate in Istanbul on October 2, 2018\n\nAnother recent traveller to Saudi Arabia, Zach, 28, told the MailOnline: ‘I think that this image problem will probably be the most significant barrier to overcome in growing their tourism industry among Europeans and North Americans.'\n\nHe said that some people may find it difficult to square their morals with MBS's previous actions. For him, however, he said that most of the money he spent went into the hands of small businesses and local family rather than anyone in power.\n\n‘They may choose to exempt Westerners from strict religious codes, but it will probably be mainly a market for ‘adventurous’ tourists in the short term.’", "description": "A female teacher from Canada, who recently visited Saudi Arabia, told MailOnline that her friend was prevented from entering a mall as she was not wearing the abaya gown.", "authors": ["Ryan Fahey For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/14/19493518-0-image-a-26_1570628593775.jpg", "published_at": "2019-10-09"}