{"pub": "businessinsider", "url": "https://businessinsider.sg/mims-group-and-ashfield-healthcare-communications-kk-combine-operations-in-japan", "downloaded_at": "2019-10-23 10:02:55.783547+00:00", "title": "MIMS Group and Ashfield Healthcare Communications KK combine operations in Japan", "language": "en", "text": "SINGAPORE – Media OutReach – 23 October 2019 – MIMS Group, Asia’s largest multi-channel provider of drug information, medical communications, events management and marketing services, and Ashfield Healthcare Communications KK, announced they have combined operations in Japan. The newly established organisation will be operating as MIMS Japan Co. Ltd.\n\nMIMS and Ashfield Healthcare Communications formed a strategic alliance in January 2019. The synergy between MIMS and Ashfield Healthcare Communications will use local knowledge within country to execute best in class and compliant regional and global programs at the local level. It will provide clients with strengthened capabilities from both organisations including Japanese and English medical communications and publications services for the local Japan- market, APAC region wide scientific strategy and digital healthcare expertise and global solutions.\n\nMIMS Group, now under the umbrella of SMS Co. Ltd. (TYO 2175), has been offering diverse expertise for over 50 years in 17 countries and markets in Asia, Oceana and the Middle East with a focus on providing marketing support services to pharmaceutical companies, error detection system integrated in healthcare institutions as well as services to empower healthcare professionals in their daily operations. MIMS marketing platform services is spread across 10 countries mainly in South East Asia and has over 2.5 million healthcare professionals registered on the mims.com website, with drug directory services, medical communications, as well as media platform business. MIMS Japan Co. Ltd., headed by CEO Yasunobu Sakai, was established in April 2017, offering one-stop services in the Asia Pacific region to Japanese pharmaceutical manufacturers, healthcare and food manufacturing companies\n\n“The alliance with Ashfield Healthcare Communications enables us to give a distinct benefit of delivering a global standard quality to our Japanese clients, in addition to the one stop services for expanding in South East Asia being offered by MIMS Japan Co. Ltd. ” said Yasunobu Sakai, CEO of MIMS Group.\n\nAshfield Healthcare Communications, part of UDG Healthcare plc, provides global solutions for clients, adding value by connecting scientific excellence, creativity and data capabilities to flawlessly execute powerful, multichannel communication solutions. Ashfield Healthcare Communications has a global network of 1,300 employees collaborating with more than 100 pharma, biotech, device and nutraceutical companies.\n\nAshfield Healthcare Communications Executive Director Richard Lawrence said: “Ashfield Healthcare Communications already works with several Japanese pharmaceutical companies on a global basis. Further strengthening our partnership with MIMs will enhance our ability to better serve these companies regionally and in the Japan market.”\n\nVictor Wright, MIMS Chief Client Officer for pharma marketing said, “As the largest medical communications company in the APAC region outside of Japan and China, MIMS Group has the local country expertise to help Japanese companies extend their programs and communications throughout the APAC region.”\n\nFor more information on MIMS, visit http://corporate.mims.com or www.mimsmc.com for medical communications services.\n\nFor Ashfield Healthcare Communications, visit www.ashfieldhealthcare.com\n\n\n\n\n\nNOTES TO EDITOR\n\nAbout MIMS\n\nMIMS Group, now under the umbrella of SMS Co. Ltd. (TYO 2175), has been offering diverse expertise for over 50 years in 17 countries and markets in Asia, Oceana and the Middle East with a focus on providing marketing support services to pharmaceutical companies, error detection system integrated in healthcare institutions as well as services to empower healthcare professionals in their daily operations. MIMS marketing platform services is spread across 10 countries mainly in South East Asia and has over 2.5 million healthcare professionals registered on the mims.com website, with drug directory services, medical communications, as well as media platform business. MIMS Japan Co. Ltd., headed by CEO Yasunobu Sakai, was established in April 2017, offering one-stop services in the Asia Pacific region to Japanese pharmaceutical manufacturers, healthcare and food manufacturing companies\n\n\n\n\n\nMIMS has offices in the following countries & regions:\n\n\n\n\n\nSingapore (headquarters), Australia, China, Hong Kong SAR (China), Indonesia, India, Ireland, Japan, Korea, Malaysia, Myanmar, New Zealand, Philippines, Taiwan, Thailand, UAE, and Vietnam.\n\n\n\n\n\nVisit http://corporate.mims.com to learn more, and www.mimsmc.com for medical communications services.\n\n\n\n\n\nAbout Ashfield Healthcare Communications\n\nAshfield Healthcare Communications, part of UDG Healthcare plc, provides global solutions for clients, adding value through unique insights and tailored scientifically rigorous, multichannel, healthcare communications offerings. Its mission is to improve lives by helping healthcare professionals and patients get the medicines, knowledge, and support they need. Ashfield Healthcare Communications’ multichannel and specialist agencies include ACUMED, Ashfield Digital & Creative, Ashfield Healthcare Communications K.K., BlueMomentum, Cambridge BioMarketing, CircleScience, Cirrus Communications, Clinical Bridges, CodonMedical, Create NYC, FireKite, Galliard, Gardiner-Caldwell Communications, GeoMed, iMed Comms, Infusion, MicroMass, Nyxeon, Pegasus, Physicians World Europe, QXV Comms, Scientific Connexions, Seren Communications, StemScientific, Watermeadow Medical, and Zoetic Science.\n\nFor more information, please go to www.ashfieldhealthcarecommunications.com.\n\n\n\n\n\nAbout Ashfield\n\nAshfield, part of UDG Healthcare plc, is a global leader in commercialisation services for the healthcare industry. We partner with our clients across Advisory, Healthcare Communications, Commercial, Patient Solutions and Medical Affairs to build creative, scalable and tailored health solutions that are executed flawlessly, to deliver positive outcomes for patients and add value to your business. With 7,000 employees, the company operates in 25 countries, delivering services in more than 50 countries across Europe, North America, South America and Asia. It works with more than 250 businesses, including all of the world’s top 25 pharmaceutical companies.\n\n\n\n\n\nIts mission is to partner with its clients, helping to improve lives by ensuring healthcare professionals and patients get the medicines, knowledge and support they need.\n\n\n\n\n\nAshfield provides contract sales teams, customer service reps, medical science liaison officers, remote detailing, nurse educators, medical information, healthcare communications, market access, market research, training, live and virtual events, digital, creative, pharmacovigilance, audit and advisory services.\n\n\n\n\n\nFor more information, go to www.ashfieldhealthcare.com.", "description": "Business Insider - SINGAPORE - Media OutReach - 23 October 2019 - MIMS Group, Asia's largest multi-channel provider of drug information, medical communications, events management and marketing services, and Ashfield Healthcare Communications KK, announced they have combined operations…. Read more at businessinsider.sg", "authors": ["Media Outreach"], "top_image": "https://static.businessinsider.sg/sites/2/2019/10/mims-combine.jpg", "published_at": "2019-10-23"}