{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7552031/Robyn-Lawley-reveals-husband-Everest-Schmidt-followed-going-vegan.html", "downloaded_at": "2019-10-09 01:06:19.494207+00:00", "title": "Robyn Lawley reveals her husband Everest Schmidt has followed her by going vegan", "language": "en", "text": "Robyn Lawley revealed she went vegan earlier this year with the hopes curing herself from Lupus.\n\nAnd now it seems her lifestyle change has influenced her husband, lawyer Everest Schmidt.\n\nSpeaking to Marie Claire magazine, the 30-year-old gushed: 'My husband [Everest Schmidt] and I have gone vegan together, and seeing him doing that has been really sexy.'\n\n'Seeing him doing that has been really sexy!' Robyn Lawley revealed that her husband, lawyer Everest Schmidt, has followed her lead and become vegan\n\nThe Swimsuit Illustrated model and the former basketball player met at a bar in New York in 2011, and share one child, four-year-old daughter Ripley.\n\nBack in February, Robyn told The Morning Show she was already feeling better thanks to her new vegan diet.\n\n'I'm really hopeful I can cure my Lupus, apparently its incurable but I'm hoping I can change that,' she said.\n\nLoved up: The Swimsuit Illustrated model and the former basketball player met at a bar in New York in 2011\n\nSpeaking about her results, Robyn added: 'I've really changed my diet to being a lot more clean and I feel like that's actually having a good impact on my whole body.'\n\n'I'm actually starting to feel really good for once, instead of stressed out and agitated from work.'\n\nLast year, Robyn suffered from a terrifying fall during a Lupus-induced seizure, which resulted in a scar on her forehead.\n\nProud parents: Robyn and Everest share one child, four-year-old daughter Ripley\n\nThe model, who was diagnosed with the disease just after the birth of her daughter Ripley, now three, doesn't remember much about her fall.\n\nShe explained to the Sydney Morning Herald that Lupus, an autoimmune condition, is more invasive than people tend to think.\n\nBack when she was first diagnosed, the model was struggling to pick things up, walk, and talk, causing her family to take her to the hospital.", "description": "Robyn Lawley revealed she became vegan earlier this year with the hopes curing herself from Lupus.", "authors": ["Alisha Buaya For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/23/19464590-0-image-a-8_1570572262925.jpg", "published_at": "2019-10-08"}