{"pub": "fox", "url": "https://foxnews.com/tech/apples-iphone-event-what-to-expect", "downloaded_at": "2019-09-03 23:45:28.288019+00:00", "title": "Apple’s iPhone 11 event: What to expect", "language": "en", "published_at": "2019-09-03", "text": "All eyes will be on Apple’s headquarters in Cupertino, Calif., next week when the tech giant unveils its latest iPhones.\n\nThe tech giant is expected to launch three new iPhones at the event next Tuesday. It'll be held at the Steve Jobs Theater on the company's campus, according to reports.\n\n“The main event of next week's launch will be the flagship iPhone 11 Pro and the iPhone 11 Pro Max, as these smartphones represent the crux of improvements coming in this year's releases,” Wedbush Securities analysts Daniel Ives and Strecker Backe wrote in a research note. “The new triple camera lens technology in iPhone 11 Pro that will work in unison for users taking pictures, along with some next-generation AI capabilities built into this year's iPhones will be the key specs showcased, in our opinion.”\n\nIPHONE HACK ATTACK: GOOGLE SAYS HACKERS PLACED 'MONITORING IMPLANTS' IN IPHONES\n\nThe iPhone 11 Pro will also get a video upgrade involving real-time re-cropping technology, the analysts predict.\n\nWedbush expects that the base iPhone 11 will be priced at $749, with the iPhone 11 Pro priced at $999 and the iPhone 11 Pro Max priced at $1,099.\n\nAngelo Zino of CFRA Research thinks that the three phones, which are successors to Apple’s iPhone XR, XS and XS Max, will be priced at $749, $999 and $1,199. The triple-lens camera on the iPhone 11 Pro and iPhone Pro Max could provide better 3D sensing for augmented reality (AR), better optical zoom and improved performance in low-light conditions, according to Zino.\n\n10 INCREDIBLY USEFUL THINGS YOU DIDN'T KNOW YOUR IPHONE COULD DO\n\n“All phones will come with a more powerful A13 processor from Taiwan Semiconductor, which will of course bring about better performance and efficiency,” he wrote in a research note.\n\nIn addition to three new iPhones, Zino thinks that Apple will reveal an upgrade to the Apple Watch and additional details on new service offerings. “The Apple Watch Series 5 will look like the Series 4,” he wrote. “It is believed that [Apple] will look to unveil a new ceramic casing design as well as a titanium Apple Watch for the Series 5 models.”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nEarlier this month, Apple rival Samsung unveiled its new Galaxy Note 10 phones, which use Google’s Android operating system and come with a stylus.\n\nFox Business’ Jonathan Garber contributed to this article.\n\nFollow James Rogers on Twitter @jamesjrogers", "description": "All eyes will be on Apple’s headquarters in Cupertino, Calif., next week when the tech giant launches its latest iPhones.", "authors": ["James Rogers"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/02/Iphone020119.jpg"}