{"pub": "reuters", "url": "https://in.reuters.com/article/uk-hongkong-protests/hong-kong-police-get-more-powers-masks-to-be-banned-in-bid-to-end-crisis-media-idINKBN1WI02H", "downloaded_at": "2019-10-03 10:51:53.192122+00:00", "published_at": "2019-10-03", "title": "Hong Kong police get more powers, masks to be banned in bid to end crisis - media", "language": "en", "text": "HONG KONG (Reuters) - Hong Kong has loosened guidelines on the use of force by police as it struggles to stamp out anti-government protests that have rocked the Asian financial hub for nearly four months, according to documents seen by Reuters on Thursday.\n\nThe city is also expected to ban face masks under a colonial-era emergency law that has not been used in half a century, media reported.\n\nThe loosening of restrictions on the use of force came into effect shortly before some of the most violent turmoil seen in the protests on Tuesday, with police firing about 1,400 rounds of tear gas, 900 rubber bullets and six live rounds, as protesters threw petrol bombs and wielded sticks.\n\nMore than 100 people were wounded, including a teenaged secondary school student who was shot in the chest and wounded. It was the first time a demonstrator had been shot by live fire.\n\nIn the documents seen by Reuters, the police manual changed some guidelines on how officers could act when considering force. It also removed a line that stated officers should be accountable for their actions.\n\nMedia also reported on changes to the police procedure manual with effect from Sept. 30, ahead of protests on China’s National Day on Tuesday.\n\nPolice declined to comment when asked if amendments had been made.\n\n“The guidelines on the use of force involve details of operation. It may affect the normal and effective operation of the police force and work of police on crime prevention if details are made public,” police said in a statement to Reuters.\n\nPolice in the former British colony have long been admired for their professionalism compared with some forces elsewhere in Asia.\n\nBut the public has become increasingly hostile towards the police over past weeks amid accusations of heavy-handed tactics. Police say they have shown restraint.\n\nThe unrest, which began over opposition to a now-withdrawn extradition bill that would have allowed people to be sent to mainland China for trial, shows no sign of letting up.\n\nProtesters, fired up over the shooting of the young man this week, are planning more demonstrations at shopping malls across 11 districts on Thursday night and throughout the weekend.\n\n‘HEINOUS CRIMES’\n\nThe opposition to the Beijing-backed government has plunged the city into its biggest political crisis in decades and poses the gravest popular challenge to Chinese President Xi Jinping since he came to power.\n\nProtesters are angry about what they see as creeping interference by Beijing in their city’s affairs despite a promise of autonomy in the “one country, two systems” formula under which Hong Kong returned to China in 1997.\n\nChina dismisses accusations it is meddling and has accused foreign governments, including the United States and Britain, of stirring up anti-China sentiment\n\nA riot police officer fires pepper-spray projectile toward anti-government protesters demonstrating near the Legislative Council building in Hong Kong, China, September 29, 2019. Picture taken Spetember 29, 2019. REUTERS/Athit Perawongmetha\n\nMedia reports of an expected ban on face masks, which many protesters wear to conceal their identities and shield themselves from tear gas, sent Hong Kong’s stock market up to a one-week high.\n\nThe government decided to impose the ban under the law giving police sweeping emergency powers in a special meeting of the city’s Executive Council, media outlets TVB and Cable TV reported.\n\nElizabeth Quat, a lawmaker for a pro-Beijing political party, told a news conference the measure was aimed at stopping “illegal assemblies”.\n\n“This law is not targeting peaceful protesters. It is focused on targeting those rioters who have committed heinous crimes,” she said.\n\nBut pro-democracy lawmakers fear the emergency powers could be used to further curtail freedoms.\n\n“To impose an anti-mask law in the current social condition is to further infuriate the people and will definitely be met with escalating violence,” lawmaker Fernando Cheung told Reuters. “This is no different than adding fuel to fire. The result will be riots.”\n\nGoldman Sachs estimated this week that the city might have lost as much as $4 billion in deposits to rival financial hub Singapore between June and August.\n\nOn Thursday, Lam Chi-wai, chairman of Junior Police Officers Association, urged the city’s leader to impose a curfew to maintain public order.\n\n“We cannot work alone - clapping only with one hand - without appropriate measures and support from top level,” Lam said.\n\nTEENAGER CHARGED\n\nA lawyer for the teenager shot in the chest while fighting with an officer on Tuesday appeared in court on his behalf.\n\nTony Tsang, who was shot at close range as he fought an officer with what appeared to be a white pole on Tuesday, was charged with rioting, which carries a maximum 10-year sentence, and assaulting a police officer.\n\nTsang is in hospital in stable condition and was not able to attend the court session.\n\nBut about 200 supporters turned up to watch the proceedings.\n\nThe lawyer for an Indonesian journalist injured when police fired a projectile during protests on Sunday said she had been blinded in one eye.\n\nThe European Union said in a statement it was deeply troubled by the escalation of violence and the only way forward was through “restraint, de-escalation and dialogue”.\n\nSlideshow (7 Images)\n\nThe protests have also forced the cancellation of major public events.\n\nThe city’s tourism board announced a cycling tournament, the Hong Kong Cyclothon, and the Hong Kong Wine & Dine Festival, had both been called off, citing “unforeseen circumstances in the coming weeks”.", "description": "Hong Kong has loosened guidelines on the use of force by police as it struggles to stamp out anti-government protests that have rocked the Asian financial hub for nearly four months, according to documents seen by Reuters on Thursday.", "authors": ["Clare Jim", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191003&t=2&i=1436573665&w=1200&r=LYNXMPEF920LK"}