{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/2019100310151/costco-reports-strong-sales-but-tax-charge-squeezes-profit", "downloaded_at": "2019-10-03 23:26:25.530681+00:00", "published_at": "2019-10-03", "title": "Costco Reports Strong Sales, but Tax Charge Squeezes Profit", "language": "en", "text": "By Sarah Nassauer and Micah Maidenberg\n\nCostco Wholesale Corp. said Thursday sales rose in the latest quarter, as the warehouse retailer works to offset the rising costs of tariffs.\n\nComparable sales, or those from Costco stores open for more than a year as well as online sales, increased 5% in the quarter that ended Sept. 1. Online sales increased 22% in the period.\n\nThe company has been aided by strong consumer spending, which has helped boost the U.S. economy for much of the year amid worries about slowing global growth and uncertainty related to tariffs. But the economy is growing at a slower pace than last year, and consumer spending slowed slightly in August.\n\n\"We are still seeing good growth,\" said Richard Galanti, CFO of the retailer, whose members skew higher income than many big-box competitors. Costco sold a $222,000 diamond ring during the quarter, he said.\n\nCostco is working to speed shipments of products before tariffs take effect or before duties are set to rise, said Mr. Galanti on a conference call. \"We've gone to pretty much every supplier on every item to see what we can do\" to reduce costs, and in some cases Costco has cut orders, he said.\n\nThe Trump administration has imposed tariffs on the majority of goods imported from China, with some to take effect later in the year on consumer goods including toys and apparel. On Wednesday, the administration said it would impose new tariffs on some goods from the European Union.\n\nProfit during the quarter rose to almost $1.10 billion, or $2.47 a share, from $1.04 billion, or $2.36 a share a year earlier. That includes a $123 million charge related to taxes.\n\nLast week Costco learned it owes more taxes on a product sold between 2009 and 2016, said Mr. Galanti. An investor relations executive declined to specify the product, but said the charge involved a product subject to additional taxes like tobacco or alcohol. Costco is filing a protest to the additional charge, but set aside a reserve for the payment in the quarter. Without the charge, profit would have been $1.19 billion, or $2.69 a share, he said.\n\nCostco said it generated about $47.5 billion in net sales and membership fees in its fiscal fourth quarter, up from $44.41 billion a year earlier.\n\nAlong with rivals Walmart Inc. and Target Corp., Costco has shown it can draw in customers and notch higher sales in a shifting retail market. Investors have responded by bidding up shares in the Issaquah, Wash.-based company 42% so far this year. Shares of Costco fell 1.6% in postmarket trading Thursday.\n\nWrite to Sarah Nassauer at sarah.nassauer@wsj.com and Micah Maidenberg at micah.maidenberg@wsj.com\n\n(END) Dow Jones Newswires\n\nOctober 03, 2019 19:06 ET (23:06 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png"}