{"pub": "metro", "url": "https://metro.co.uk/2019/10/09/strictlys-katya-jones-celebrates-gorgeous-champ-joe-mcfaddens-birthday-two-years-won-show-10888722", "downloaded_at": "2019-10-09 12:45:22.556677+00:00", "title": "Strictly's Katya Jones celebrates 'champ' Joe McFadden's birthday", "language": "en", "text": "Strictly’s Katya Jones celebrates ‘gorgeous champ’ Joe McFadden’s birthday (Picture: Getty Images)\n\nStrictly Come Dancing’s Katya Jones has celebrated Joe McFadden’s birthday, two whole years after the duo won the show.\n\nThe stars first met on the BBC dance competition, and it looks as though they’re still in touch.\n\nTaking to Instagram, the professional shared a series of pictures of themselves on the ballroom floor as she celebrated her pal’s day.\n\nThe 30-year-old wrote in the caption: ‘Happy birthday to my gorgeous champ @mrjoemcfadden!\n\n‘This time two years ago we were learning chachacha, which didn’t go so well. And look at you now starting in the massive musical, dancing in heels on stage!!!’\n\nShe added: ‘So so proud of you!!! Lots of love!’ Followed by the hashtags: ‘#dancing #strictly #strictlycomedancing #joemcfadden.’\n\nThey won the competition two years ago (Picture: BBC)\n\nKatya then shared another post in her story with her new celebrity partner as she wished the birthday boy well.\n\nAdvertisement\n\nAdvertisement\n\nSharing her message, Joe wrote alongside the clip: ‘Thanks, you absolute stars.’\n\nSports presenter Mike Bushell is now learning from the pro and managed to make it through to next week’s episode despite Katya suffering from a number of falls.\n\nThe star was performing a raunchy dance to The Weather Girls’ It’s Raining Men with the journalist but one move went a little bit wrong.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nShe is now paired up with Mike Bushell (Picture: PA)\n\nAfter a lovely spin and following Mike across the studio, Katya dropped to the floor – with some fans assuming Mike was meant to be there to catch her.\n\nBut it turns out Katya had tripped, and the judges were not impressed.\n\n‘It wasn’t quite magic, it was nearly tragic in parts,’ Bruno Tonioli asserted.\n\nHowever, Katya stood by her student and protested: ‘It wasn’t his fault!’\n\nAdvertisement\n\nAdvertisement\n\nAfter the performance, she reassured her fans that everything was okay, and tweeted: ‘Guys! I’m totally fine! No idea what happened. So sorry. But so proud of @mikebreakfast for carrying on and delivering “the dolphin”!’\n\nStrictly Come Dancing continues Saturday at 6.40pm on BBC One.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Angelina Jolie and her brood board private jet ahead of Maleficent’s London premiere\n\nMORE: Joker’s creepy laugh edited with Seth Rogen might be even more sinister", "description": "Strictly's Katya Jones celebrates 'gorgeous champ' Joe McFadden's birthday two years after they won show.", "authors": ["Abigail Gillibrand"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-906379882-e1570622003706_1570622471.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-09"}