{"pub": "afr", "url": "https://afr.com/policy/economy/why-you-shouldn-t-always-listen-to-economists-20191013-p530b1", "downloaded_at": "2019-10-17 01:48:40.581446+00:00", "title": "Why you shouldn't always listen to economists", "language": "en", "text": "Honey-fugling, hornswaggling and skulduggery\n\nThe first section of Lemann’s elegant history conjures up the corporatist order that preceded Transaction Man’s arrival. The story is shaped around Adolf Berle, a lawyer who, with the statistician Gardiner Means, wrote The Modern Corporation and Private Property, a classic study of the concentration of power in the hands of company managers. Before the publication of that masterpiece, in 1932, other authors had drawn attention to what one of them called the “prestidigitation, double shuffling, honey-fugling, hornswaggling, and skullduggery” employed by corporate executives to dupe their supposed masters, the shareholders.\n\nBerle went further. He laid out in detail how shareholders, being so dispersed and numerous, could not hope to restrain bosses—indeed, how nobody could do so. Enormous powers to shape society belonged to company chieftains who answered to no one. Hence Berle’s prescription: The government should regulate them.\n\nBerle’s pro-regulatory stance won him an introduction to Franklin D. Roosevelt, and he became an influential New Dealer. But his vision truly triumphed after World War II, when regulation of corporate behaviour was supplemented by the rise of labour unions. In the winter of 1945–46, more than 300,000 members of the United Auto Workers union staged a successful strike at General Motors that lasted 113 days, and a few years later, in 1950, the company resolved that further confrontations would be too painful.\n\nIn what became known as “the Treaty of Detroit,” GM’s bosses granted workers regular cost-of-living pay increases, a measure of job security, health insurance, and a pension—benefits that were almost unheard-of. General Motors had “set itself up as a comprehensive welfare state for its workers,” in Lemann’s succinct formulation.\n\nBerle celebrated the Treaty of Detroit by propounding a pro-corporate liberalism. The corporation had become the “conscience-carrier of twentieth-century American society,” he marvelled. Many contemporaries agreed. “The large mass-production plant is our social reality, our representative institution, which has to carry the burden of our dreams,” the rising management theorist Peter Drucker wrote. Anticipating the “end of history” triumphalism of a later era, the sociologist Daniel Bell feted the corporatist order in a book titled The End of Ideology.\n\nOf course, corporatism proved less robust than these writers expected. Berle’s “clash of the titans” liberalism, built on checks and balances among big corporations, big government, and big labour, fell afoul of American individualism.\n\nAdvertisement\n\nConservatives railed against big government for stifling freedom. Liberals denounced big corporations for reducing employees to automatons. Both sides came to see big labour as the protector of special interests. In 1965, as Lemann reminds us, the novelist Norman Mailer had one of his characters interrupt a lovemaking session to pluck out his partner’s diaphragm—“a corporate rubbery obstruction”.\n\nYet the chief threat to Berle’s vision came not from America’s suspicion of concentrated power. It came from economics.\n\nAppelbaum opens his book with the observation that economics was not always the imperial discipline. Roosevelt was delighted to consult lawyers such as Berle, but he dismissed John Maynard Keynes as an impractical “mathematician”. Regulatory agencies were headed by lawyers, and courts dismissed economic evidence as irrelevant. In 1963, President John F. Kennedy’s Treasury secretary made a point of excluding academic economists from a review of the international monetary order, deeming their advice useless. William McChesney Martin, who presided over the Federal Reserve in the 1950s and ’60s, confined economists to the basement.\n\nSubtle revolution\n\nStarting in the 1970s, however, economists began to wield extraordinary influence. They persuaded Richard Nixon to abolish the military draft. They brought economics into the courtroom. They took over many of the top posts at regulatory agencies, and they devised cost-benefit tests to ensure that regulations were warranted.\n\nTo facilitate this testing, economists presumed to set a number on the value of life itself; some of the best passages of Appelbaum’s fine book describe this subtle revolution. Meanwhile, Fed chairmen were expected to have economic credentials. Soon the noneconomists on the Fed staff were languishing in the metaphorical basement.\n\nThe rise of economics, Appelbaum writes, “transformed the business of government, the conduct of business, and, as a result, the patterns of everyday life”. It was bound to have a marked effect on Berle’s pro-corporate liberalism. Lemann hangs this part of his story on Michael C. Jensen, an entertainingly impassioned financial economist who reframed attitudes toward the corporation in the mid-’70s.\n\nJensen agreed with Berle’s starting point: Corporate managers were unaccountable because shareholders could not restrain them. But rather than seeing a remedy in checks exerted by regulators and organised labour, Jensen proposed to overhaul the firm so that ownership and control were reunited. Executives should be rewarded more with stock and less with salary, so that they would think like shareholders and focus on the profits that shareholders wanted.\n\nAdvertisement\n\nManagers who failed to generate a good return would see their stock prices languish, which would create tempting takeover targets. A market for corporate control would redouble the pressure on bosses to behave like owners. Successful takeovers, in turn, would shift corporations into the hands of single, all-powerful proprietors, capable of overseeing management more effectively than scattered stockholders could. In sum, Jensen’s prescriptions inverted Berle’s. The market could be made to solve the problem of the firm. Government could pull back from regulation.\n\nHostile takeovers\n\nFor ideas to have influence, Lemann observes, “there has to be a confluence between the ideas themselves, the spirit of the times, and the interests of powerful players who find the ideas congenial”. Berle had been lucky that his treatise on the corporation appeared when Roosevelt was launching his run for the presidency.\n\nJensen was equally fortunate in his own way. Shortly after the publication of his research, the invention of junk bonds made hostile takeovers the rage. During the ’80s, more than a quarter of the companies on the Fortune 500 list were targeted. Jensen became the scholar who explained why this unprecedented boardroom bloodbath was good news for America.\n\nAnd to a considerable extent, the news was good. Shielded from market discipline, the old corporate heads had deployed capital carelessly. They had expanded into new markets for reasons of vanity, squandered money on fancy management dining rooms, and signed labour contracts like the Treaty of Detroit, which—however statesmanlike—stored up liabilities to retirees that would ultimately hobble their companies.\n\nFranklin D. Roosevelt dismissed John Maynard Keynes as an impractical “mathematician\" but from the 1970s economists began to wield significant influence. AP Photo\n\nFrom 1977 to 1988, Jensen calculated, American corporations had increased in value by $US500 billion as a result of the new market for corporate control. Reengineered and reinvigorated, American business staved off what might have been an existential threat from Japanese competition.\n\nYet a large cost eluded Jensen’s calculations. The social contract of the Berle era was gone: the unstated assumption of lifetime employment, the promise of retirement benefits, the sense of community and stability and shared purpose that gave millions of lives their meaning. Berle had viewed the corporation as a social and political institution as much as an economic one, and the dismembering of corporations on purely economic grounds was bound to generate fallout that had not been accounted for.\n\nAdvertisement\n\nMeanwhile, Jensen’s market-centric mind-set permeated finance, enabling opaque risks to build up in banks and other trading houses. As the collapse of Enron and other corporate darlings revealed, a good deal of non-market-related accounting fraud compounded the fragility. Even before the 2008 crash, Jensen disavowed the transactional culture he had helped to legitimise. Holy shit, Jensen remembers saying to himself. Anything can be corrupted.\n\nThe wider story of the market-centric worldview provides the meat of Appelbaum’s narrative. It is a tricky tale to tell, because many of the myths of the era fall apart on close inspection. Contrary to common presumption, the economics establishment in the 1990s and 2000s did not believe that markets were perfectly efficient. Rather, influential economists took the pragmatic view that markets would discipline financiers more effectively than regulators could.\n\nPro-market age\n\nAlan Greenspan, the Fed chairman who is often painted as the embodiment of the pro-market age, had been preoccupied with the destabilising inefficiencies in finance since the 1950s. Lawrence Summers, the Harvard economist who became Treasury secretary under Bill Clinton, had contributed to the academic literature on the limits of market efficiency. The fact that such sophisticated people presided over a dangerous buildup in financial risk suggests that something larger was at work than a naive faith in markets.\n\nAppelbaum’s strength is that he generally acknowledges these complexities. He is happy to state at the outset that market-oriented reforms have lifted billions out of poverty, and to recognise that the deregulation that helped undo Berle-ism was not some kind of right-wing plot. In the late ’70s, it was initiated by Democrats such as President Jimmy Carter and Senator Ted Kennedy.\n\nBut Appelbaum makes it his mission to highlight instances where the market mind-set went awry. Inequality has grown to unacceptable extremes in highly developed economies. From 1980 to 2010, life expectancy for poor Americans scandalously declined, even as the rich lived longer. Meanwhile, the primacy of economics has not generated faster economic growth. From 1990 until the eve of the financial crisis, US real GDP per person grew by a little under 2 per cent a year, less than the 2.5 per cent a year in the oil-shocked 1970s.\n\nAlan Greenspan, pictured, and Lawrence Summers ducked the political challenge of buffering new kinds of financial trading with regulatory safeguards. Ap\n\nAs Appelbaum shows, economists have repeatedly made excessive claims for their discipline. In the ’60s, Kennedy’s and Johnson’s advisers thought they had the business cycle tamed. They believed they could prevent recessions by “fine-tuning” tax and spending policies. When this expectation was exposed as hubris, Milton Friedman urged central banks to focus exclusively on the supply of money circulating in the economy. This too was soon discredited.\n\nAdvertisement\n\nFrom the ’90s onward, economists oversold the benefits of targeting inflation, forgetting that other perils—the human cost of unemployment, the destabilisation wrought by financial bubbles—might well be worse than rising prices. Meanwhile, Greenspan and Summers ducked the political challenge of buffering new kinds of financial trading with regulatory safeguards. To be fair, the Wall Street lobbies presented more of an obstacle to regulation than critics acknowledge. Still, Greenspan and Summers miscalculated.\n\nThe upshot was the whirlwind of the past decade: the greatest financial crash in recent memory, and a crisis of legitimacy in the world’s advanced democracies. After decades in which economists’ influence expanded rapidly, the striking thing about the Trump administration and its foreign analogues is that they have largely dispensed with economic advisers. The US has lived through the era of corporatism, the era of transactionalism, and the economists’ hour. The intellectual marketplace awaits a fresh approach to the structuring of work and the good society.\n\nTreaty of Detroit\n\nLemann and Appelbaum wisely don’t pretend there are easy solutions. The benevolent corporatism of the Treaty of Detroit reflected a world in which American industry faced little foreign competition and new technologies were generally developed by firmly established businesses. By contrast, today’s fierce international competition and disruptive innovation oblige businesses to cut costs or go under. The dilemma is that, even as they compel efficiency, globalisation and technological change exacerbate inequality and uncertainty and therefore the need for a compassionate social contract.\n\nLemann explores one response to this dilemma through the figure of Reid Hoffman, who founded the online professional network LinkedIn and is the third starring character in Lemann’s history of grand conceptions. It is an inspired piece of casting. As a stalwart of Silicon Valley, Hoffman hails from the complex of start-ups that are intent on disrupting what remains of the old-line corporate establishment. At the same time, as the creator of LinkedIn, he represents a purported antidote to the insecurity that results from the disruption.\n\nThe promise of online professional networking is that, by building a raft of cyberconnections, workers will safely navigate the rapids of the new economy. Each person’s network, not any one firm, will be the guarantor of employment. Corporations are freed to pursue efficiency as they see fit; individuals nonetheless enjoy some of the security of the old corporatist era, because they have a new tool to help them. LinkedIn thus becomes the psychological centre of the world of work—the successor to the corporation. One of Hoffman’s books is titled, rather appropriately, The Start-Up of You. Whereas Transaction Man treated workers as costs on a spreadsheet, Network Man wants to empower them.\n\nOne in four American adults says they use LinkedIn, and many recruiters go to the site regularly. But LinkedIn is not a solution to worker insecurity writ large, still less to inequality. On the contrary, a world in which people compete to gather connections may be even less equal than our current one. A few high-octane networkers will attract large followings, while a long tail of pedestrians will have only a handful of buddies. At one point in its evolution, LinkedIn published the size of each user’s network as a spur to add to the total. Later, realising the anxiety this bred, the site capped the number of connections it published at 500 per member.\n\nLemann is under no illusions that online networks are the answer to the search for security and dignity, and he concludes with a different proposal. It is a sort of anticonception conception: Rather than buy in to a single grand vision, societies should prefer a robust contest among interest groups—what Lemann calls pluralism.\n\nAdvertisement\n\nBorrowing from the forgotten early-20th-century political scientist Arthur Bentley, Lemann defines groups broadly. States and cities are “locality groups\", income categories are “wealth groups\", supporters of a particular politician constitute “personality groups”. People inevitably affiliate themselves with such groups; groups naturally compete to influence the government; and the resulting push and pull, not squabbles among intellectuals about organising concepts, constitutes the proper stuff of politics.\n\nLemann has a particular respect for the interest groups that fight for Chicago Lawn, the struggling working-class neighbourhood that appears at intervals throughout his book, mostly as the victim of some remote transaction. Organising in one’s interests, he suggests, “is the only effective way to get protection against the inevitable lacunae in somebody else’s big idea”.\n\nHeavenly chorus\n\nLemann is aware of the risks in this conclusion. He cites the obvious objection: “The flaw in the pluralist heaven is that the heavenly chorus sings with a strong upper-class accent.” In a contest of competing interest groups, the ones with the most money are likely to win. Rich seniors will protect their health benefits at the expense of public housing; the estate tax will vanish, and so will the dream of good preschools for poor children.\n\nAppelbaum notes in passing how the beer magnate Joseph Coors helped found the Heritage Foundation to promote a conservative pro-business agenda, and how another businessman, Howard Jarvis, spearheaded the California proposition that reduced property taxes. For those who regard inequality as a challenge, an interest-group free-for-all is a perilous prescription.\n\nLemann’s pluralism also prompts a deeper reservation. His vision frames politics as a zero-sum affair, dismissing as futile the quest for “a broad, objectively determined meliorist plan that will help everyone”. But this postmodernist pessimism goes too far. Some policies are better than others, and to give up on this truth is to throw away the sharpest sword in the fight against inequality.\n\nThe government should bankroll good schools because, objectively speaking, good schools will boost both economic growth and social equity. Likewise, competition is generally a force that gets the best out of people, whether they are public-school teachers or tech monopolists. America’s health-care system is ripe for reform because it is both socially unjust and scandalously costly.\n\nAt the close of his book, Appelbaum presents a series of persuasive recommendations, confirming that Lemann is wrong to despair of reasoned, technocratic argument. If policymakers want ordinary Americans to appreciate the benefits of open trade, they must ensure that displaced workers have access to training and health care. Because some interest groups are weaker than others, government should correct the double standard by which the power of labour unions is regarded with antipathy but the power of business monopolies is tolerated. Well-heeled professional cartels, such as associations of real estate agents who extract 6 per cent commissions from hapless home sellers, should be eyed with suspicion. Progressives should look for ways to be pro-competition but anti-inequality.\n\nAdvertisement\n\nYet however reasonable Appelbaum’s arguments, readers are also left with a question about the future. Although he sets out to write the story of the economists’ hour—an hour that he thinks ended in 2008—it isn’t so clear that the economists have departed. They may not have the ear of populists, but their resilience shouldn’t be underrated. Indeed, throughout Appelbaum’s narrative, many of the knights who slay the dragons of bad economic ideology are economists themselves.\n\nThe story of the past generation is more about debates among economists than about economists pitted against laypeople. Perhaps, with a bit of humility and retooling, the economists will have their day again. If they do not come up with the next set of good ideas, it is not obvious who will.\n\nThe Atlantic", "description": "Market-oriented reforms transformed the world but failed to head off the crash of 2008. With economists' role in the crisis under scrutiny, what comes next?", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.5298%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/ff9b4e30ee13b3ef737fd108e1bdaac2eceacab6", "published_at": "2019-10-13"}