{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-england-cornwall-50055165", "downloaded_at": "2019-10-16 20:59:33.582726+00:00", "title": "Thomas Cook collapse: What happened to its planes?", "language": "en", "text": "Image caption Some of the Thomas Cook planes are now at an airfield in Cornwall while their future role is decided\n\nWhen Thomas Cook went into liquidation last month its fleet of planes was stranded and not allowed to fly.\n\nWhen it ceased trading, the company had 34 planes in its fleet, 31 of which were leased, which is common practice for many airlines.\n\nSeveral of them are now with specialist companies, including in Newquay, Cornwall, while their future is decided.\n\nIt is likely they will be taken on by new airlines.\n\nIn Newquay, Apple Aviation is currently maintaining, storing and preparing four Airbus A330 and A321s ahead of their reassignment. Several more are expected to arrive in the coming days and weeks.\n\nRyan Winfield, of Apple Aviation, said flight operations companies were sent out to recover the stranded aircraft.\n\n\"At Newquay they are being put in to storage and maintained in an airworthy condition until such time the aircraft owner makes a decision on the plans for them, likely moving to new operators,\" he said.\n\nImage caption Aircraft engineer Sam Hughes has been carrying out maintenance checks on one of the former Thomas Cook planes\n\nHangar manager for the company, Richard Woolridge, said storing a plane was not the same as parking a car in a garage.\n\n\"You don't just throw a tarpaulin over and forget about it - you have to keep the aircraft airworthy,\" he said.\n\nMr Woolridge said particular maintenance checks had to be done every seven, 15 and 30 days and \"full engine runs\" were carried out every 14 days to make sure the engines were preserved properly.\n\nMr Winfield, who said the planes could be grounded at Newquay for up to a year, said the panes would be re-liveried by another company before going to its new operators.\n\nHe said the planes in Newquay would likely need painting but some liveries were made up of stickers.\n\nAircraft engineer Sam Hughes had been working for Thomas Cook but has now been taken on by Apple Aviation.\n\n\"I am one of the ones that has been quite fortunate to find work pretty much straight away,\" he said.\n\n\"There are a lot of my colleagues that are still out of work.\"\n\nAbout 150,000 British passengers were stranded abroad when Thomas Cook announced its liquidation overnight.\n\nThe timing was believed to have been a strategic decision by Thomas Cook and meant the planes would be on their way back to the UK when the announcement was made.\n\nImage copyright Robert Pothorcki Image caption Some planes are not completely de-liveried - stripped of all branding - to reduce the expense and the time of returning them back to service\n\nJoanna Bailey, editor of Simple Flying website, said: \"As soon as they announce insolvency the pilots don't work anymore, the crew don't work any more and the planes aren't allowed to be flown anymore because very few of them actually belong to Thomas Cook.\"\n\nIn recent weeks, the Thomas Cook fleet have been flown under special licences to airports and airfields in England, Ireland, France and Croatia until their future is determined.\n\nSome people took to social media to express their surprise at seeing Thomas Cook planes in Cornish skies.\n\nA decision on the Newquay planes' future could take weeks or even months but until then the engineers will continue to maintain what they say feel like \"ghost planes\".\n\nMr Woolridge added: \"They are designed to take people away on their holidays but unfortunately with what has happened to Thomas Cook we are just going to look after them until a new company wants to take them and continue that service to those people.\"", "description": "The company had a fleet of 34 planes when it went into liquidation - but where are they now?", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/3FC4/production/_109242361_tc.jpg", "published_at": "2019-10-16"}