{"pub": "independent", "url": "https://independent.co.uk/news/uk/crime/julian-assange-wikileaks-court-hearing-extradition-trump-london-westminster-magistrates-a9164781.html", "downloaded_at": "2019-10-21 13:20:34.067539+00:00", "title": "‘I can’t think properly’: Assange fights back tears and struggles to say own name as he appears in court over US extradition", "language": "en", "text": "Julian Assange appeared to fight back tears and said “I can’t think properly” as he faced court to fight extradition to the US.\n\nThe Wikileaks founder also mumbled, paused and stuttered as he confirmed his name and date of birth at the beginning of the start of a case management hearing in London on Monday.\n\nThe American government is seeking to extradite the 48-year-old to prosecute him over the leak of hundreds of thousands of classified documents.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHe faces 18 charges, including conspiracy to hack government computers and violation of espionage law, and could spend decades in prison if convicted.\n\nAssange, who sported a long, unkempt beard when he was arrested in April, appeared clean-shaven and wore a dark blue suit over pale blue sweater for the hearing at Westminster Magistrates’ Court.\n\nShape Created with Sketch. Key moments for Julian Assange Show all 9 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Key moments for Julian Assange 1/9 The situation today Assange was arrested after Metropolitan Police officers were invited into the Ecuadorian embassy on April 11 2019. How did it come to this? Ruptly TV 2/9 The break Assange shows the front page of the Guardian on July 26 2010, the day that they broke the story of the thousands of military files leaked by WikiLeaks AFP/Getty 3/9 Wanted A warrant for Assange's arrest was issued in August 2010 for counts of rape and molestation in Sweden AFP/Getty 4/9 Ruling The UK's Supreme Court ruled in 2012 that Assange should be extradited to Sweden to face trial Getty 5/9 Sanctuary Following the ruling, Assange was given asylum by the Ecuadorian governement over fears that his human rights would be violated if he were extradited, he has since remained in the embassy in London Getty 6/9 A friend in Pam Friend Pamela Anderson delivers lunch to Assange at the embassy in October 2016. She has since spoken against his arrest Getty 7/9 Arbitrarily detained A UN panel found in 2016 that Assange had been arbitrarily detained and that he had not been able to claim his full right to asylum. It urged Sweden to withdraw the charges against him Getty 8/9 The cat ultimatum Last year, the Ecuadorian embassy threatened to revoke Assange's internet access unless he stopped making political statements online and started taking better care of James, his pet cat. Assange accused Ecuador of violating his rights Reuters 9/9 Arrest Assange was arrested on April 11 2019. Ecuador revoked his asylum status and invited the Metropolitan Police in to the embassy to arrest him. Reuters 1/9 The situation today Assange was arrested after Metropolitan Police officers were invited into the Ecuadorian embassy on April 11 2019. How did it come to this? Ruptly TV 2/9 The break Assange shows the front page of the Guardian on July 26 2010, the day that they broke the story of the thousands of military files leaked by WikiLeaks AFP/Getty 3/9 Wanted A warrant for Assange's arrest was issued in August 2010 for counts of rape and molestation in Sweden AFP/Getty 4/9 Ruling The UK's Supreme Court ruled in 2012 that Assange should be extradited to Sweden to face trial Getty 5/9 Sanctuary Following the ruling, Assange was given asylum by the Ecuadorian governement over fears that his human rights would be violated if he were extradited, he has since remained in the embassy in London Getty 6/9 A friend in Pam Friend Pamela Anderson delivers lunch to Assange at the embassy in October 2016. She has since spoken against his arrest Getty 7/9 Arbitrarily detained A UN panel found in 2016 that Assange had been arbitrarily detained and that he had not been able to claim his full right to asylum. It urged Sweden to withdraw the charges against him Getty 8/9 The cat ultimatum Last year, the Ecuadorian embassy threatened to revoke Assange's internet access unless he stopped making political statements online and started taking better care of James, his pet cat. Assange accused Ecuador of violating his rights Reuters 9/9 Arrest Assange was arrested on April 11 2019. Ecuador revoked his asylum status and invited the Metropolitan Police in to the embassy to arrest him. Reuters\n\nJohn Pilger, the journalist and documentary filmmaker, and former mayor of London Ken Livingstone were among supporters seated in a packed public gallery as others protested outside court.\n\nMr Assange’s barrister, Mark Summers, described the extradition bid as “a political attempt” by Donald Trump’s administration to “signal to journalists the consequences of publishing information”.\n\n“It is legally unprecedented,” he told the court.\n\nMr Sumner said there was a “direct link” between Mr Trump’s election and the “reinvigoration” of the investigation, which had concluded under Barack Obama’s presidency without any charges against Mr Assange.\n\nThe barrister also claimed the US “has been actively engaged in intruding into privileged discussions between Assange and his lawyers” in the Ecuadorian embassy, where the WikiLeaks founder was holed up for nearly seven years after claiming asylum.\n\nThe intrusions included the “unlawful copying of their telephones and computers” and “hooded men breaking into offices,” Mr Sumner alleged.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nSuch concerns were among “multiplicitous” issues which meant Assange’s legal team should be given more time to prepare for the case, argued the lawyer, who requested a three-month delay to the full extradition hearing.\n\nBut district judge Vanessa Baraitser refused to grant defence lawyers more time to gather evidence. She told Assange his next case management hearing would take place on 19 December and the full hearing would proceed as planned in February.\n\nAs court adjourned, Assange claimed he had not understood proceedings and complained: “This is not equitable.”\n\nHe added: “I can’t research anything, I can’t access any of my writing. It’s very difficult where I am.”\n\nAssange, who is being held in high-security Belmarsh prison, told the judge he was up against a “superpower” with “unlimited resources” and appeared to be fighting back tears as he added: “I can’t think properly.”\n\nHe was jailed for 50 weeks in May for breaching his bail conditions by taking refuge in the Ecuadorian embassy in London to avoid extradition to Sweden over sex offence allegations.\n\nAssange was arrested when police raided the embassy after the South American nation withdrew its offer of asylum.\n\nHe was due to be released from Belmarsh last month, but a judge remanded him in custody because there were “substantial grounds” for believing he would abscond.\n\nFormer home secretary Sajid Javid signed an order in June allowing the US extradition request to be heard in court.\n\nIn May, WikiLeaks claimed there were “grave concerns” about Assange’s health after he was moved to a medical ward in prison. When he did not appear for a scheduled court hearing, chief magistrate Emma Arbuthnot said the Australian was “not very well”.\n\nWikiLeaks said at the time: “During the seven weeks in Belmarsh his health has continued to deteriorate and he has dramatically lost weight. The decision of the prison authorities to move him into the health ward speaks for itself.”\n\nIn a statement before the latest hearing on Monday, Amnesty International urged the UK to reject the extradition request.\n\nMassimo Moratti, the human rights group’s deputy director for Europe, said: “The British authorities must acknowledge the real risks of serious human rights violations Julian Assange would face if sent to the USA.\n\n“The UK must comply with the commitment it’s already made that he would not be sent anywhere he could face torture or other ill-treatment.”\n\nAdditional reporting by agencies", "description": "Julian Assange appeared to fight back tears and said “I can’t think properly” as he faced court to fight extradition to the US. The Wikileaks founder also mumbled, paused and stuttered as he confirmed his name and date of birth at the beginning of the start of a case management hearing in London on Monday. The American government is seeking to extradite the 48-year-old to", "authors": ["Chris Baynes"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/21/13/julian-assange.jpg", "published_at": "2019-10-21"}