{"pub": "theverge", "url": "https://theverge.com/2019/10/9/20906110/blizzard-hearthstone-ban-hong-kong-china-epic-games-fortnite-blitzchung", "downloaded_at": "2019-10-09 12:43:29.667111+00:00", "title": "Unlike Blizzard, Epic Games says it won’t ban players for political speech", "language": "en", "text": "Fortnite developer Epic Games said in a statement that it will not ban players or content creators for political speech. The message comes after Blizzard caught fire this week for banning a professional Hearthstone player for shouting a statement associated with Hong Kong protesters.\n\n“Epic supports everyone’s right to express their views on politics and human rights. We wouldn’t ban or punish a Fortnite player or content creator for speaking on these topics,” an Epic Games spokesperson told The Verge.\n\nOver the weekend, Blizzard banned Hearthstone player Ng “Blitzchung” Wai Chung from participating in tournaments after he voiced support for the protesters in Hong Kong. In a post-game interview on Sunday, Blitzchung said, “Liberate Hong Kong. Revolution of our age!” Now, he cannot participate in any tournaments for an entire year (effective October 5th), and Blizzard is withholding any prize money he would have received in the Grandmasters tournament over the weekend. Those forfeited winnings have been reported to total around $10,000.\n\nIn an interview with AFP, Blitzchung said, “I don’t regret saying that stuff. And even now, I don’t regret it at all.”\n\nBlizzard responded to the criticism saying in a statement that it stands “by one’s right to express individual thoughts and opinions,” but Blitzchung violated a competition rule that prohibits players from doing anything that would bring “[them] into public disrepute,” offend “a portion or group of the public,” or damage Blizzard’s image.\n\nFollowing Blizzard’s decision, the company’s own forums and subreddits dedicated to its games ballooned with messages from angry fans condemning the ban. The r/Blizzard subreddit went down for a few hours on Tuesday after the board was overrun with memes and posts calling for players to boycott Blizzard and its games like World of Warcraft, Overwatch, and Hearthstone.\n\nSenators on both sides of the aisle have also taken notice, tweeting out statements criticizing Blizzard’s move. Sen. Ron Wyden (D-OR) said, “Blizzard shows it is willing to humiliate itself to please the Chinese Communist Party.” He continued, “No American company should censor calls for freedom to make a quick buck.”", "description": "Blizzard banned Hearthstone player Ng \"Blitzchung\" Wai Chung from participating in tournaments after he voiced support for the protesters in Hong Kong. Now, he cannot participate in any tournaments for an entire year.", "authors": ["Makena Kelly", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/Xdy9yBMLXg6Uk0NGlFAKPo5RUVU=/0x337:4748x2823/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19272130/1053729894.jpg.jpg", "published_at": "2019-10-09"}