{"pub": "cryptocoin", "url": "https://cryptocoin.news/token-news/october-7-2019-chainlink-link-up-3-18-unusual-moves-in-transfers-added-30933", "downloaded_at": "2019-10-07 12:11:11.292262+00:00", "title": "October 7, 2019: Chainlink (LINK): Up 3.18%; Unusual Moves In Transfers Added", "language": "en", "text": "How Did Chainlink’s Price Fare Yesterday?\n\nAt the time of this writing, Chainlink has a price of $2.236 USD, which puts it up by approximately 3.18% from yesterday. Chainlink enters the day 20.43% above its 20 day moving average, and is experiencing its the 2nd day in a row up. In terms of an expected trading range, the Bollinger bands on Chainlink suggest price may bounce between $1.486155 and $2.227345 based on its momentum and volatility over the past 14 days. Price’s current proximity to the top of the range may make selling an attractive opportunity to traders interested in trading the range.\n\nTrade Chainlink (LINK) and over 500 other cryptos across ten different exchanges — all from one app. Try Quadency.\n\nAs for Chainlink’s market cap, it is currently at about $767M US dollars.\n\nUnusual Developments\n\nYesterday, the metrics transfers added saw a daily change well outside what is usually experienced. An exploration as to what caused this may be worthwhile.\n\nUpdate on Transactions and Holders\n\nOver the past 24 hours, 14,168 transfers have been added to the blockchain recording transactions amongst holders of Chainlink. In terms of estimating the number of holders, over the past day the total number of wallets holding Chainlink has gone up by approximately 216. Our engagement rank, which combines weekly percentage growth in number of holders and number of transfers, has Chainlink ranked 1 out of the 32 Ethereum tokens we’re tracking.\n\nHow are the Strong Holders of Chainlink Faring?\n\nIn terms of wealth concentration, the richest 1,000 wallets own 91.96% of the coin’s total money supply. If we focus on exchanges, which may be an correlated with liquidity and greater confidence in the currency, the exchange wallets that are in the top 1,000 wallets own 1.11% of the currency’s total money supply. The week over week growth rate in the share of the total supply of the top 1,000 wallets has changed by 0.17%; as for the share of the total supply owned by exchange wallets within the top 1,000 wallets, that has changed by 0.17%.\n\nHow Active are the Software Developers?\n\nIn terms of how active the software development team working on Chainlink is, it may be worth observing that the last time any work pertaining to code was done on their GitHub code repository was on October 06, 2019, or approximately 1 days before. To understand how code development is progressing, we can observe growth rates over the past 30 days in the number of open issues and the number of watchers: open issuers have been growing at about -0.3 per day, while the number of followers watching Chainlink’s repositories is growing by -0.2.\n\nWhat’s Going on Social Media?\n\nIn terms of social media presence, Chainlink saw its Twitter followers and Reddit subscribers go up by 166 and 55 over the past 24 hours. Twitter appears to be the most popular place to follow the company, and thus may be worth monitoring. Here is the Twitter page for Chainlink.\n\nWhere to Buy\n\nYou can trade Chainlink, listed under the symbol LINK, through the following exchanges: Gate, Yobit, Binance, DDEX.\n\nArticle by SixJupiter", "description": "", "authors": [], "top_image": "https://cryptocoin.news/wp-content/uploads/2019/04/chainlink.jpg", "published_at": "2019-10-07"}