{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7614735/Amanda-Knox-claps-Lady-Gagas-fame-prison-tweet-declaring-prison-prison.html", "downloaded_at": "2019-10-25 22:37:28.145022+00:00", "title": "Amanda Knox claps back at Lady Gaga's 'fame is prison' tweet by declaring 'prison is prison'", "language": "en", "text": "Amanda Knox took to her Twitter to share the blunt reality of jail with Lady Gaga after the singer tweeted that 'fame is prison.'\n\n'I hear you, but... prison is prison,' Knox said in a Friday morning tweet, retweeting Gaga's Thursday tweet.\n\nThe tweet has been liked more than 31,000 times since it was posted just this morning. It has just over 3,400 retweets.\n\nIt is not exactly known what Gaga was referencing in her tweet.\n\nAmanda Knox took to her Twitter to share a blunt reality with Lady Gaga after the singer tweeted that 'fame is prison'\n\n'I hear you, but...prison is prison,' Knox said in a Friday morning tweet, retweeting Gaga's Thursday tweet\n\nEarlier this month, Knox appeared on NBC Nightly News with Lester Holt to discuss her recent and first trip back to Italy after being accused of murdering her British roommate Meredith Kercher.\n\n'I was genuinely afraid,' explains Knox, prompting Holt to ask what it was that made her so 'fearful' about the trip.\n\n'The fact that I had been invited by the Italy Innocence Project and welcomed to take part in their event was tremendously important to me,' says Knox.\n\nIt is not exactly known what Gaga was referencing in her tweet\n\n'But that didn't change the fact I still have people who send me messages describing how they're going to murder me.'\n\nAmerica's most infamous foreign exchange student had not been back to the country since she was acquitted in 2011, four years after Kercher's death.\n\nShe spoke during a Trial By Media panel, and told those in attendance that she was depicted 'on the global scene as cunning, psychopath, drugged, whore, guilty.'\n\nThis all culminated with Knox breaking down as she recounted the 'false and baseless story, which fueled people’s fantasies.'\n\nIt was actually not until 2015 that she was fully cleared in the case, which spent four years in appeals court after her acquittal.\n\nAmerica's most infamous foreign exchange student had not been back to the country since she was acquitted in 2011, four years after Meredith Kercher's death. Pictured in 2008\n\nItaly's highest overturned the 2009 conviction in the brutal murder and sexual assault of Kercher against Knox and her former boyfriend, Raffaelle Sollecito, in 2011.\n\nThe court did however uphold Knox's slander conviction for wrongly accusing Congolese-born bar owner Diya Lumumba in the murder.\n\nIt reduced the slander sentence to three years.\n\nKnox spent nearly four years in jail after being convicted, and had been sentenced to 26 years following her initial conviction.\n\nThe court battle went on for seven and a half years, with flip-flop decisions that saw her return to the United States after being acquitted only to face another trial after the acquittal was thrown out.", "description": "Amanda Knox took to her Twitter to share a blunt reality with Lady Gaga after the singer tweeted that 'fame is prison.' 'I hear you, but...prison is prison,' Knox said in a Friday morning tweet.", "authors": ["Matthew Wright For Dailymail.Com", "Chris Spargo For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/19/20194076-0-image-a-15_1572029894856.jpg", "published_at": "2019-10-25"}