{"pub": "thinkprogress", "url": "https://thinkprogress.org/trumps-relationship-with-fox-news-is-quickly-fraying-591ebf75d1af/", "downloaded_at": "2019-09-04 03:47:40.003827+00:00", "title": "Trump’s relationship with Fox News is quickly fraying", "language": "en", "published_at": "2019-08-29", "text": "Donald Trump had a presidential pivot this week, shifting aim from his usual enemies in the press to what has long been his favorite network, Fox News.\n\n“HOPELESS & CLUELESS! [Fox News] should go all the way LEFT and I will still find a way,” Trump said in a series of tweets on Wednesday. “The New @FoxNews is letting millions of GREAT people down! We have to start looking for a new News Outlet. FOX isn’t working for us anymore!”\n\nDespite his regular cheerleading of the network, and continued support from reliable Fox acolytes like the hosts of Fox & Friends, as well as Sean Hannity and Jeanine Pirro, President Donald Trump has noticeably soured on Fox News as of late.\n\n“Fox is a lot different than it used to be,” he noted last week. “There’s something going on at Fox, I’ll tell you right now, and I’m not happy about it.”\n\nAdvertisement\n\nHe added that he didn’t understand why there were negative polls about him on Fox News, or why the network was “pivoting” to the Democrats by hiring former DNC Chair Donna Brazile and broadcasting town halls featuring Democratic presidential candidates.\n\n“I think they’re making a big mistake because Fox was treated very badly by the Democrats. Very, very badly. Having to do with the debates and other things,” Trump went on. “I think Fox is making a big mistake because, you know, I’m the one who calls the shots on that — on the really big debates.”\n\nTrump has insulted specific Fox News anchors, including “low ratings Shep Smith” and the “pathetic” Juan Williams who is also “nasty and wrong.”\n\nJuan Williams at @FoxNews is so pathetic, and yet when he met me in the Fox Building lobby, he couldn’t have been nicer as he asked me to take a picture of him and me for his family. Yet he is always nasty and wrong! — Donald J. Trump (@realDonaldTrump) August 18, 2019\n\nBut Trump isn’t the only one irate about his deteriorating relationship with Fox. On Wednesday, Carl Cameron, who was Fox’s chief political correspondent until 2017, told CNN that Trump’s conflation of Fox’s opinion section with its news section made him and other reporters at Fox “sick to their stomachs.”\n\nAdvertisement\n\n“What he really means is, ‘I need to have more opinion people who espouse more opinions,'” said Cameron, now a correspondent for a progressive site, Front Page Live. (Joe Romm, the founder and editor-in-chief of Front Page Live, is also a reporter at ThinkProgress.) “[Trump’s tweets are] the kind of thing that makes the news department at Fox News, where I worked for a number of years, sick to their stomachs.”\n\n“News people don’t like to hear that stuff,” Cameron continued. “The entertainment side, one the other hand, is vastly different and it’s a threat to them. And Trump is basically challenging the Sean Hannitys of Fox News to beat up on their journalists. That’s not going to work either.”\n\nBut Trump needs to be careful with his attacks on Fox News. The president is performing poorly in polls that match him up against potential Democratic challengers in the 2020 election, and that could become more problematic if the U.S. creeps into a recession.\n\nAs a USA Today and Suffolk University poll shows, in a mock 2020 matchup Trump earns more than half his support from those who trust Fox more than any other network. Among those who “strongly approve” of Trump, 60% prefer Fox to any other outlet.\n\nAll of that means that there’s a significant overlap between Trump supporters and Fox News viewers, and no other conservative network comes close to matching the reach that Fox has. So, for Trump to marshal his base to win reelection, he’s going to need all the help from Fox that he can get.", "description": "", "authors": [], "top_image": "https://thinkprogress.org/wp-content/uploads/2019/08/GettyImages-825587596.jpg?w=1920&h=1080&crop=1"}