{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7590947/Police-hunt-Brighton-sex-attacker-speaking-broken-English.html", "downloaded_at": "2019-10-19 12:33:58.978172+00:00", "title": "Police hunt Brighton sex attacker 'speaking broken English'", "language": "en", "text": "Police in Brighton are hunting a man in his 30s suspected of attacking three women since July.\n\nOfficers have released CCTV images of the suspect taken from two of the attacks, which they believed are linked.\n\nThe suspect, aged in his late 30s and tall with flat black Afro-style hair, has targeted women in Brighton, East Sussex and tried to engage them in conversation before sexually assaulting them. He kiss one of his victims on the lips.\n\nSussex Police are searching for this man who they wish to interview in connection with a series of sexual assaults in Brighton since July. The man is seen here at 5.30am on Sunday October 6 at the junction of Seymour Street in Brighton\n\nThe man, pictured in a blue jacket here in Pavilion Gardens on October 5 where he is suspected of attacking an 18-year-old woman outside All Bar One\n\nThe three attacks took place within a short distance of each other in Brighton city centre\n\nThe victims told officers that the suspect spoke with 'broken English'.\n\nThe first attack took place on Wednesday, July 24. The man, who is described as mixed race, approached a 22-year-old woman on Ditchling Road, Brighton as she reached the junction with Princess Street at 1.35am.\n\nThe man tried to speak with the woman before sexually assaulting her and escaping along London Road.\n\nThe second victim, an 18-year-old woman, was sitting outside All Bar One in the Pavillion Buildings area outside Pavillion Gardens at 6.25pm on Saturday, October 5.\n\nThe suspect tried to speak with the woman before grabbing her and kissing her on the lips. The victim pushed the man off before he ran away.\n\nThe third attack happened on Marine Parade at 5.30am on Sunday, October 6. Again, the suspect tried to engage the victim, this time a 19-year-old woman, in conversation.\n\nHe attacked the woman at the junction of Seymour Street before running off.\n\nA spokesman for Sussex Police said today: 'Officers in Brighton believe the same man may be responsible for three sexual assaults on women in the city.\n\n'We have published CCTV images obtained from near to two of the incidents, hoping that people may recognise him.\n\nThe first victim was attacked at the junction of Ditchling Road and Princess Crescent at 1.35am on July 22\n\nThe next attack happened on October 5 at 6.25pm on a bench outside All Bar One, pictured\n\n'The most recent incident took place when the 19-year-old victim was walking east along the north pavement in Marine Parade, Brighton, at about 5.30am when she was approached by the man who first tried to engage her in conversation and then attacked her at the junction of Seymour Street.\n\n'She resisted and after some moments she managed to struggle free and ran off. The man was described as of mixed race and wearing square-rimmed glasses. One image shows the suspect walking away immediately after the attack.\n\n'Barely 24 hours before that attack, shortly after 6.25pm on Saturday October 5, an 18-year-old woman was sitting on a bench outside All Bar One in the Pavilion Buildings area just outside Pavilion Gardens in the city centre, when she was approached by a man. He first engaged her in conversation then grabbed her and kissed her on the lips. She pushed him away and ran off, very shaken but unhurt.\n\n'The man was described as black, slim, about 6ft tall, wearing a black tracksuit possibly with white stripes down the arms. An image published by police shows the suspect walking in Pavilion Buildings immediately before this attack.\n\nThe third attack happened on Marine Parade in Brighton, pictured, at 5.30am on October 6\n\nDetective Inspector Duncan Elliott, heading Operation Downgate, said: 'These were very frightening experiences for the women, who have been receiving support and assistance from specialist officers.\n\n'We have issued these two images in the hope someone may recognise or identify the man in either of the images and will be able to assist with the ongoing intensive investigation which began in July.\n\n'If you were in the areas at those times and saw anything of the incidents, even without perhaps realising what was happening at the time, or if you saw any other suspicious activity or can help us identify this man, please contact us.\n\n'We have been carrying out very thorough and detailed inquiries into these attacks including visits to all addresses nearby and the victims have also been receiving support from specialist officers, but so far the assailant has not been traced.\n\n'From several similarities in the descriptions in each case and the circumstances of the attacks, including other information, we believe they may well be linked.'.", "description": "Sussex Police are searching for this man who they wish to interview in connection with a series of sexual assaults in Brighton since July.", "authors": ["Darren Boyle For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/12/19921406-0-image-a-14_1571486092739.jpg", "published_at": "2019-10-19"}