{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/1/us-mexico-canada-agreement-deal-backers-say-pact-v", "downloaded_at": "2019-10-02 00:39:04.206643+00:00", "title": "U.S.-Mexico-Canada Agreement deal backers say pact vital to future of economy, Trump agenda", "language": "en", "text": "It’s not clear how many victims — if any — the House Democratic impeachment probe into President Trump will claim, but supporters of Mr. Trump’s signature revamped North American free trade pact with Canada and Mexico said Tuesday they are determined the U.S.-Mexico-Canada Agreement will not be one of them.\n\nWith even Mr. Trump speculating the updated NAFTA pact may fall victim to partisanship over impeachment, the nation’s biggest business lobby insists Congress can multitask, especially on a deal seen as vital to the future of the U.S. economy and to Mr. Trump’s larger trade agenda.\n\nNeil Bradley, the executive vice president and chief policy officer of U.S. Chamber of Commerce, told reporters in a briefing that he does “not believe that impeachment is going to delay or diminish the prospects for the USMCA getting enacted.”\n\n“That said,” he added, “we’re not going to leave anything to chance. This is so important for the economy.”\n\nWith the Republican-led Senate seen as likely to approve the trade deal, the fight centers on the House. House Speaker Nancy Pelosi and fellow Democrats say they would like to see changes in the deal but have been careful not to close the door to eventual ratification.\n\nEven as House Democrats were consumed this week with gearing up the impeachment inquiry, Mrs. Pelosi in a Sept. 30 letter wrote to her Democratic caucus that talks with the Trump administration on a USMCA vote were continuing. Mexico has already approved the deal and Canadian approval is also expected — so long as the U.S. in on board.\n\nMrs. Pelosi said this week that House Ways and Means Committee Chairman Richard Neal, Massachusetts Democrat, and a USMCA “working group” were still in talks with U.S. Trade Representative Robert E. Lighthizer “to secure key improvements” to the accord.\n\n“We hope to continue further down the path to yes, but insist that any trade agreement strengthen America’s working families,” Mrs. Pelosi wrote.\n\nMr. Lighthizer has said he also remains optimistic of passage.\n\nBut the impeachment dynamic has introduced a real note of uncertainty into the talks. President Trump himself speculated last week that the updated NAFTA deal could be in trouble.\n\n“I don’t think Nancy Pelosi will have time,” Mr. Trump told reporters. “She’s wasting her time on a — you know, let’s use a word that they used to use a lot: a ‘manufactured crisis.’”\n\nThe Hill’s two top Republicans — Senate Majority Leader Mitch McConnell and House Minority Leader Kevin McCarthy, said in a joint Wall Street Journal op-ed piece Tuesday they feared Democrats were trying to run out the clock on the USMCA to deny Mr. Trump a victory.\n\n“It’s time for Mrs. Pelosi’s delay tactics to end,” they wrote. “House Democrats need to put the country first and stop blocking this significant victory for the American people.”\n\nApproval of the deal would also provide the Trump White House with a useful weapon in the even more contentious battle to strike a trade deal with China, a battle that shows few sings of ending quickly or quietly.\n\n“If anybody in either party were trying to jeopardize USMCA as a result of, or as collateral damage because of their differences over the current investigations and current movements towards the impeachment, the entirety of the business community would rise up and challenge them on that,” the Chamber’s Mr. Bradley said.\n\nMr. Trump last November joined leaders of Mexico and Canada in signing a new three-way trade pact to replace NAFTA, following through on a key campaign promise to overhaul the 1994 agreement that he repeatedly described as the “worst deal ever made,” one that hastened the hollowing out of U.S. manufacturing.\n\nThe new agreement sets updated rules on agriculture, technology and auto imports, protects autoworkers’ jobs in the U.S. and opens Canada to American dairy products.\n\nThe Chamber has set a Thanksgiving deadline for Congress to pass the updated NAFTA accord.\n\n“We just didn’t pick that day because we liked Thanksgiving turkey and pecan pie,” Mr. Bradley said. “We picked that based off where we thought the progress is and the negotiations and the timeline for approval.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "It's not clear how many victims — if any — the House Democratic impeachment probe into President Trump will claim, but supporters of Mr. Trump's signature revamped North American free trade pact with Canada and Mexico said Tuesday they are determined the U.S.-Mexico-Canada Agreement will not be one of them.", "authors": ["The Washington Times Http", "Lauren Meier"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/01/101_2019_trump-298201_c0-229-5472-3419_s1770x1032.jpg?6f9ce78ee1a3a25672569ab4bf84dc3559d8855e", "published_at": "2019-10-01"}