{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7596649/Trippier-reveals-Diego-Costas-nickname-following-summer-transfer-Atletico-Madrid.html", "downloaded_at": "2019-10-21 15:11:48.378426+00:00", "title": "Trippier reveals Diego Costa's nickname for him following his summer transfer to Atletico Madrid", "language": "en", "text": "Atletico Madrid new boy Kieran Trippier has given the inside track on his relationship with teammate Diego Costa, revealing the ex-Chelsea striker calls him 'Rooney'.\n\nThe former Tottenham defender made the switch to the Wanda Metropolitano this summer for £20million after becoming surplus to requirements under Mauricio Pochettino.\n\nTrippier has made a positive start to life at the La Liga giants so far and has fitted in well in Diego Simeone's squad - striking up a great connection with Costa, who he knows from his Premier League days.\n\nKieran Trippier has struck up a friendship with Diego Costa at the Wanda Metropolitano\n\nThe right-back hailed the positive vibe among the players at the club, but said the Brazilian forward was one of the biggest characters, and that he had started referring to him as ex-England captain Wayne Rooney.\n\n'He calls me Rooney 10 times a day,' Trippier told Marca. 'He does it all the time, just for a laugh. But it's Diego, I don't care. We all find it funny and I like that he always makes jokes.\n\nCosta enjoys a joke and often refers to Trippier as former England captain Wayne Rooney\n\nTrippier has impressed many with his start for Atletico this season and proven doubters wrong\n\n'I knew him from the Premier League and he's the funniest player I've ever played with. There's a great atmosphere here and everyone makes jokes, but Costa is the funniest.'\n\nMoving to a new country isn't easy, with a new language and culture to learn and an unfamiliar climate, but Trippier thinks his transition could not have gone smoother.\n\n'The adaptation has been perfect,' he added. 'The weather is very pleasant, the food is incredible - better than in England.\n\n'People are welcoming to me and my family and when they see me in Madrid; they tell me that I'm doing well.\n\n'We can only thank everyone for making me feel at home so quickly, for making my family smile and making life easier.'\n\nThe England star has put in some solid defensive displays this season against the likes of Eden Hazard, making eight appearances and chipping in with two assists.\n\nHis confident start to the season has also seen him regain favour with Gareth Southgate, being picked over the likes of Kyle Walker and Trent Alexander-Arnold to start the last three Euro 2020 qualifiers for the Three Lions.", "description": "Trippier has made a positive start to life at the La Liga giants so far and has fitted in well in Diego Simeone's squad - striking up a great connection with Costa, who he knows from his Premier League days.", "authors": ["Oli Gamp For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/14/19991334-0-image-a-100_1571663626123.jpg", "published_at": "2019-10-21"}