{"pub": "guardian", "url": "https://theguardian.com/stage/2019/sep/17/jez-butterworth-writer-guardian-best-play-since-2000-jerusalem", "downloaded_at": "2019-09-17 23:25:04.119709+00:00", "title": "Jez Butterworth: quicksilver sage behind the 21st century's best play", "language": "en", "text": "Jez Butterworth is one of only two writers – the other is Lucy Kirkwood – to have a double entry in our list of the century’s best plays. That seems only fair: Jerusalem and The Ferryman, which have packed out theatres in London and New York and scooped up countless awards, are, by any standard, big plays. Pinning down the 50-year-old Butterworth is difficult. He moves easily between theatre and cinema. His plays switch between the intimate and the epic. They have no single overarching theme. Yet Butterworth’s work can be defined in several ways: by its fascination with national identity and personal betrayal, its three-dimensional characterisation, its richly textured language.\n\nMuch of that was evident in Butterworth’s first big success, Mojo, which burst on the scene like a fireball in 1995. At first, most of us were hypnotised by the virtuosic patter. The setting is a tacky club in 1950s Soho and one of the minor mobsters goes into a sustained riff about a gangland boss’s awesome shoes, which he describes as “baby fuckin’ buckskin hand-stitched by elves”. Instantly one knew one was in the presence of a real writer. But beneath the coruscating language and the dark comedy lay a play about a patriarchal world in which damaged men talked big to conceal their loneliness, panic and fear of emotional contact.\n\nFacebook Twitter Pinterest Mercurial … Mark Rylance as Rooster with Charlotte Mills and Jessica Barden in Jerusalem at the Apollo, London, in 2010. Photograph: Tristram Kenton/The Guardian\n\nButterworth kept us waiting impatiently for his next two plays – The Night Heron (2002) and Winterling (2006) – but they left many bothered and bewildered rather than bewitched. Both had a rural setting – the Fens and Dartmoor, respectively – and both confirmed Butterworth had a gift for cracking dialogue. But what were they about? The former, dealing with two sacked Cambridge college gardeners, appeared to be about victimisation of the outsider. The latter, involving a power-battle between a gangland fugitive and his former partner, was too close to Pinter for comfort. But Butterworth’s most passionate advocate, the Royal Court’s Ian Rickson, stuck loyally with him. Tucked inside my copy of The Night Heron I found a letter from Rickson arguing that “it was the first truly metaphysical play I have read for a long time” and that it explored the soul, the spirit and what it meant to be human.\n\nIf the jury was still out on Butterworth’s true weight as a writer, it received a decisive answer in 2009. First in March came a fine play, Parlour Song, at the Almeida. Set on a new housing estate on London’s outer fringe – maybe a nod to Butterworth’s own childhood upbringing in St Albans – it offered a vivid portrait of the lust, longing and treachery that stalk many a comforting suburban prison. In May came an even bigger shock when Jerusalem opened at the Royal Court and, although it called forth superlatives, I’m not sure that even now we have fully grasped its significance.\n\nLike many people, I initially assumed it was a hymn to a lost England and to the disappearance of a pagan, primitive culture. But the more I see and read it, the more I become convinced that its hero is a sad anachronism as well as a mercurial tale-spinner and that Butterworth is writing about a country torn between a romanticised nostalgia for its past and a deep uncertainty about its future: at the April 23rd Fair these Wiltshire villagers are recreating George and the Dragon rituals while also paying tribute to Hollywood movies such as Men in Black II. I hate to invoke the B-word but, long before Brexit became part of our vocabulary, Butterworth was writing about a country – and it is specifically England – hankering after national myths that turn out to be entirely fabricated.\n\nFacebook Twitter Pinterest Unspoken love … Laura Donnelly and Paddy Considine in The Ferryman at the Royal Court, London, in 2017. Photograph: Johan Persson\n\nAfter the cryptic, little-seen The River (2012), Butterworth hit the bullseye again with The Ferryman (2019). And once more Butterworth is asking searching questions about personal and national identity such as “Who are we?” and “Where do our ultimate loyalties lie?” Although Butterworth was attacked in some quarters for deploying theatrical stereotypes of Irishness, to most spectators the story rang thrillingly true. In tracing the unspoken love between a County Armagh farmer and his sister-in-law, it explored the corrosive nature of self-denial. But, since the play was set in 1981 at a time when 10 prisoners died in the Maze prison after a hunger strike, it was also clearly a play about a family torn between its unequivocal commitment to the cause of a united Ireland and its awareness of the brutal means often deployed to achieve that end. Butterworth was an Englishman, albeit one from a Catholic family, daring to confront Irish identity. The fact that he did so says a lot not just about his chutzpah but about his ability to write plays, almost novelistic in the richness of their detail, that confront the big issue of who we really are as individuals and nations.", "description": "In Jerusalem, the playwright laid bare a country’s phoney myths and confronted who we really are as individuals and nations", "authors": ["Michael Billington"], "top_image": "https://i.guim.co.uk/img/media/a3537d0825edc7f87b423983e7e5a251767bd6f8/0_242_4904_2942/master/4904.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=7a7e723a314398ca06252e04f9a004fe", "published_at": "2019-09-17"}