{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3069404&cloc=joongangdaily|home|online", "downloaded_at": "2019-10-24 16:28:40.508977+00:00", "title": "Minjee Lee leads at BMW Ladies", "language": "en", "text": "Minjee Lee of Australia hits her tee shot during the first round of the BMW Ladies Championship at the LPGA International Busan in Busan on Thursday. [NEWS1]\n\nBUSAN - In rainy and windy weather, Minjee Lee of Australia took the sole lead on the first day of the inaugural BMW Ladies Championship at the LPGA International Busan on Thursday.Lee shot a bogey-free round of six under par, 66, to take a one-shot lead. Lee, who started on the 10th hole, got off to a great start by starting her round with a birdie on the par-4 10th. Then, she added two more in the front nine on the par-4 12th and the par-4 14th.Lee continued her streak by adding back-to-back birdies on the par-3 third and the par-5 fourth, before finishing her first round strong with a birdie on the par-5 ninth.“I think I had a really nice start,” Lee said after the round. “Started on the back nine and made a few early birdies. Whenever I had to make an up-and-down, I was able to get an up-and-down. So I think that really helped with the momentum.”Once Lee finished her round, she was tied for the lead with Lee Seung-yeon at six under par, but as Lee Seung-yeon added a bogey on the par-4 eighth, Minjee Lee took a sole lead.Lee Seung-yeon is a KLPGA Tour player, and this is only her second LPGA Tour event. Along with Lee Seung-yeon, three more players - world No. 1 Ko Jin-young, 2019 Rookie of the Year Lee Jeong-eun and Danielle Kang, who won the Buick LPGA Shanghai last weekend - are all tied for second at five under par, 67.Despite the weather, Ko’s group had drew a big crowd as she played her first round with Kang and Choi Hye-jin, who is the leading player on the KLGPA Tour this season. Both Kang and Choi are from Busan. Choi shot two under par, 70, to be tied for 22nd after the first round.“I think I was surprised to see so many fans out there because of the weather, because it’s just the first round,” Ko said after the round. “But the people of Busan tend to be a little more dynamic, so I had a lot of fun out there today. As you know, Danielle Kang and Choi Hye-jin have ties to Busan, so I really tried to match them in terms of getting some of the support.”Ko will play her second round with Kang and Na Hee-won at 10:02 a.m. today, starting from the first hole. Following this group, Minjee Lee will be in the last group in the field and will play her second round with Lee Seung-yeon and Lee Jeong-eun at 10:13 a.m., starting from the first hole.This is the inaugural edition of the tournament. Until last year, the LPGA KEB Hana Bank Championship was the only Tour event in Korea. However, as the KEB Hana Bank Championship is now a KLPGA event, the BMW Ladies Championship became the LPGA Tour’s new Korean stop.Just like the LPGA KEB Hana Bank Championship, if a non-LPGA Tour member wins the tournament, she will be given a full-time status card on the Tour for the 2020 season.BY KANG YOO-RIM [kang.yoorim@joongang.co.kr]", "description": "", "authors": [], "top_image": "https://pds.joins.com/jmnet/koreajoongangdaily/_data/photo/2019/10/24203213.jpg", "published_at": "2019-10-24"}