{"pub": "nytimes", "url": "https://nytimes.com/2019/10/15/opinion/trump-ukraine.html", "downloaded_at": "2019-10-15 23:52:59.888829+00:00", "title": "Opinion | It’s Not Trump vs. the Dems. It’s Trump vs. the Country’s True Defenders.", "language": "en", "text": "Last Thursday and Friday, two important Americans bore witness to the state of our nation. One was President Trump, addressing political rallies. The other was Marie Yovanovitch, the U.S. ambassador to Ukraine until suddenly told to get “on the next plane” — because Trump wanted her removed — without explanation.\n\nEvery American should contemplate their remarks, which I excerpt later, and then ask two questions: Whose speech would you want to read to your children’s civics class and which speaker do you think represents the America you want to see evolve and leave to your kids?\n\nThis exercise is vital because this impeachment process was not set in motion by the Democratic Party. It was set in motion by civil servants — whistle-blowers from the intelligence community, now supported by National Security Council staffers and diplomats. These public servants also took an oath to serve the country and protect the Constitution, and they have shown remarkable courage to risk their careers, and maybe more, to call out the president for violating his oath.\n\nThey are like antibodies fighting the cancer in our political system. John Bolton spoke for all of them when, while national security adviser, he reportedly instructed Fiona Hill, the N.S.C. Russia expert, to tell White House lawyers that he wanted no part “of whatever drug deal” the president’s cronies were cooking up as part of an off-the-books diplomatic effort being led by Rudy Giuliani to get Ukraine to dig up dirt on Joe Biden.", "description": "Public servants who swore to protect the Constitution also set the impeachment process in motion.", "authors": ["Thomas L. Friedman"], "top_image": "https://static01.nyt.com/images/2019/10/15/opinion/15friedman1/15friedman1-facebookJumbo.jpg", "published_at": "2019-10-15"}