{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/senator-wyden-warns-facebooks-targeted-ads-a-sophisticated-threat-to-us-elections", "downloaded_at": "2019-10-09 18:32:30.960462+00:00", "title": "U.S. Senator Warns Facebook's Targeted Ads A 'Sophisticated' Threat To U.S. Elections", "language": "en", "text": "Sen. Ron Wyden (D-OR) questions a witness during hearing on March 28, 2019 in Washington, DC. (Photo: Zach Gibson / Getty)\n\nThe U.S. Senate’s top privacy hawk is once again calling on Facebook to voluntarily suspend the use of micro-targeting to push political and issue-based advertisements, warning that foreign governments could take advantage of the tool to influence American elections.\n\nU.S. Senator Ron Wyden, Democrat of Oregon, previously called on Facebook and Google to suspend micro-targeting for political ads in August, saying such tools may be used to dissuade minority groups from voting, CNN reported. Wyden renewed his call in remarks attached to a bipartisan report, released Wednesday by the Senate Intelligence Committee, related to the electoral interference by Russian operatives in 2016. Wyden warned that Facebook’s ad-targeting tools allow for custom-tailored manipulation of U.S. voters.\n\nThe 84-page report speaks to the scope and scale of the Russian campaign to spread disinformation and sow division among American voters carried out by the St. Petersburg-based Internet Research Agency (IRA). “Masquerading as Americans, these operatives used targeted advertisements, intentionally falsified news articles, self-generated content, and social media platform tools to interact with and attempt to deceive tens of millions of social media users in the United States,” the report states.\n\nThe IRA targeted swing states with “socially incendiary and divisive subjects,” it says, noting that a certain Facebook ad micro-targeting tool — had it actually been employed by the IRA — would have allowed the operatives to target specific American voters with even greater efficiency.\n\nAccording to Facebook’s own estimates, 11.4 million people in the United States saw at least one of the ads placed by the IRA. Facebook pages run by the IRA are also said to have generated some 76.5 million user interactions, including 30.4 million shares and 37.6 million likes. Around 126 million Americans are estimated to have come in contact with IRA-generated content, which was also unwittingly shared by a number of high-profile figures, such as Fox News host Sean Hannity and former U.S. ambassador Michael McFaul.\n\n“By flooding social media with false reports, conspiracy theories, and trolls, and by exploiting existing divisions, Russia is trying to breed distrust of our democratic institutions and our fellow Americans,” Sen. Richard Burr, the committee’s chairman, said in a statement. “While Russia may have been the first to hone the modern disinformation tactics outlined in this report, other adversaries, including China, North Korea, and Iran, are following suit.”\n\nIn a section of the report authored by Wyden, the senator paints targeted ads as a far more sophisticated threat than the blanket propaganda largely relied upon by the IRA in 2016. Foreign actors could potentially “weaponise” hacked databases comprised of Americans’ personal information, he says, and use that information to target voters with tailored content, “not just to manipulate how, or whether they vote, but to identify and use real individuals to amplify content and influence like-minded followers.”\n\n“While the Committee”s description of Russia’s 2016 influence campaign is deeply troubling, even more sophisticated and effective options are available to adversaries who buy, steal, or otherwise obtain information about the Americans they are seeking to influence,” Wyden wrote. “This threat is increased due to the available of ad micro-targeting services offered by social media and online advertising companies, particularly those that deliver ads to specific Americans based on a list of email addresses or telephone numbers provided by an advertiser.”\n\nWyden specifically refers to Facebook’s “custom audience” tool, which allows advertisers to upload their own lists of emails, phone numbers or Facebook User IDs to target its users with ads. Facebook stated last year that it does not keep track of the custom data used to direct the ads and that it deletes it “as soon as we complete the match.”\n\nFacebook told a separate Senate committee that Cambridge Analytica — the data-mining firm that worked for the Trump campaign and illegally accessed data of millions of Facebook users — utilised its “custom audiences” tool by generating “contact lists and other identifiers” that were uploaded to Facebook.\n\n“In the wake of the 2016 influence campaign by Russia, the social media companies announced transparency measures that allow the recipients of target ads to understand how they were selected to see the ads,” Wyden continued. “However, these transparency measures only apply when the tech companies are doing the targeting on behalf of the advertiser, for example when an advertiser asks Facebook to deliver its ads to a particular age and gender demographic.”\n\n“The companies’ ad transparency systems do not apply to services like Custom Audiences through which the platform merely serves as a messenger for ads directed according to a list of targets obtained by the malign influence from a data broker or a hacked database,” he adds.\n\nFacebook did not respond to Gizmodo’s request for comment. The company has previously said that while Russian operatives did use its “custom audiences” tool, they did not upload their own identifiers and relied instead on Facebook’s own ad-targeting system. The report states that uploading outside data would have “permitted more advanced micro-targeting of their advertisements.”\n\nIn August, Wyden asked both Facebook and Google to suspend the use of micro-targeting, saying it posed a unique threat to American voters and that he’d “rather have them do it voluntarily than requiring a law.”\n\nFacebook has come under fire in recent weeks over its decision not to fact check or remove content posted by politicians, even if the posts contain flagrantly false information or violate the company’s rules.\n\n“We have a responsibility to protect the platform from outside interference, and to make sure that when people pay us for political ads we make it as transparent as possible,” Nick Clegg, Facebook’s vice president of global affairs and communications, wrote in September, adding: “But it is not our role to intervene when politicians speak.”\n\nIn a series of tweets Tuesday, presidential candidate Senator Elizabeth Warren demanded to know if Facebook CEO Mark Zuckerberg altered its policies on political ads in response to pressure from the White House.\n\n“Facebook has incredible power to affect elections and our national debate. Mark Zuckerberg is telling employees that he views a Warren administration as an ‘existential’ threat to Facebook,” the Democrat of Massachusetts tweeted, referencing comments made by Zuckerberg during an internal meeting, audio of which recently leaked. “The public deserves to know how Facebook intends to use their influence in this election.”\n\n“For instance, Trump and Zuckerberg met at the White House two weeks ago. What did they talk about?” she added.", "description": "The U.S. Senate’s top privacy hawk is once again calling on Facebook to voluntarily suspend the use of micro-targeting to push political and issue-based advertisements, warning that foreign governments could take advantage of the tool to influence American elections....", "authors": ["Alex Cranz", "Tegan Jones"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/fzobvuppwo8svhn5s2kl.jpg", "published_at": "2019-10-09"}