{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7548827/Nick-Jonas-tells-Ellen-hes-excited-getting-seat-Voice-18th-season.html", "downloaded_at": "2019-10-08 06:32:12.195022+00:00", "title": "Nick Jonas tells Ellen he's 'so excited about' getting a seat on The Voice for its 18th season", "language": "en", "text": "Nick Jonas is headed to The Voice.\n\nJonas, 27, broke the news appearing on Ellen Monday, as he said he was headed to be a coach on the NBC musical variety show next spring.\n\nThe Dallas native, who is married to actress Priyanka Chopra, 37, will work alongside fellow musicians Kelly Clarkson, 37, John Legend, 40, and Blake Shelton, 43, on the network show.\n\nLooking forward: Nick Jonas, 27, broke the news that he was headed to The Voice while appearing on Ellen Monday with brothers Joe, 30, and Kevin, 31\n\nEllen had clips of Clarkson, Legend and Shelton greeting their new co-worker, who appeared alongside his brothers Joe, 30, (who's past been a judge on The Voice Australia) and Kevin, 31.\n\nSaid Shelton: 'Nick Jonas! How you doing, buddy? I heard that you're going to be a new coach on The Voice and I wanted to, first of all, say congratulations, I guess.'\n\nThe 43-year-old crooner, an original coach on the show, noted he 'voice some concerns,' adding, 'I'm going to have to look through the rules because this is my TV show.\n\n'I'm not even sure if you're old enough to be a coach on The Voice, but I'm certain that you're going to get your butt kicked buddy.'\n\nFast reaction: Ellen had clips of Clarkson, Legend and Shelton greeting their new co-worker\n\nGetting a kick: Nick laughed at a bit directed at his new gig on the NBC show\n\nClarkson noted their Lone Star common bonds in her welcome.\n\n'I do definitely feel like the two Texans should maybe team up and form an alliance - I'm just saying,' said Clarkson.\n\nLegend said that their 'mission is to destroy Blake Shelton' in the oncoming season.\n\n'We have to form an alliance - me, you, Kelly,' said the All of Me singer. 'We team up, we beat Blake, nothing else matters. Deal? See you soon.'\n\nWinning team: The Dallas native will work alongside fellow musicians Kelly Clarkson, John Legend and Blake Shelton on the network show next spring\n\nUp for the challenge: Nick seemed ready to embrace the new gig with enthusiasm\n\nDynamic duo? The Voice's John Legend said in a clip that their 'mission is to destroy Blake Shelton' in the oncoming season\n\nNick said that he was 'so excited about' his latest endeavor, which comes after original coach Adam Levine left the show in May.\n\n'You're basically the first people I've told, so thank you for being a part of this special moment for me,' Nick said on the show, before addressing his new colleagues. 'Just to be clear, Blake, I'm going to kick your a**.\n\n'I think Kelly's point about joining an alliance might make sense, and John, I love you, but we need a side conversation, to figure some things out.'\n\nThree of a kind: The brothers took the stage in San Antonio last month for a show on their Happiness Begins tour\n\nOut and about: The entertainer was snapped with wife Priyanka Chopra in NYC last month\n\nJonas said in a statement issued Monday: 'I'm so excited to be a part of The Voice family. It's such an awesome group of individuals, and I can't wait to help these artists really build and hone in to find their unique voices.'\n\nMeredith Ahr, NBC Entertainment's Alternative and Reality Group president, said in a statement that the network was 'so impressed by his innate musicality, technical aptitude and passion' in his appearances on the network's series Songland.\n\nThe show's 17th season, featuring Clarkson, Legend, Shelton, and Gwen Stefani is airing on NBC Mondays and Tuesdays at 8/7c.\n\nAll together now: Kevin, Nick and Joe were spotted later that day walking in a single-file line into Craig's in the West Hollywood neighborhood of Los Angeles\n\nStylish: Nick wore a denim jacket with zippered accents while Kevin wore a white jacket with black stripes on the shoulders", "description": "The Dallas native, who is married to actress Priyanka Chopra, 37, will work alongside fellow musicians Kelly Clarkson, 37, John Legend, 40, and Blake Shelton, 43, on the network show.", "authors": ["Adam S. Levy For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/06/19427810-0-image-a-64_1570511560156.jpg", "published_at": "2019-10-08"}