{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/doctors-warned-football-chiefs-1966-20702219", "downloaded_at": "2019-10-23 08:59:43.368924+00:00", "title": "Doctors warned football chiefs in 1966 that heading ball can cause brain injuries", "language": "en", "text": "Get the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nDoctors warned football authorities in 1966 that frequently heading the ball can cause brain injuries.\n\nIt fuels concerns of families of former players who have been struck down by dementia that the game has turned a blind eye to the dangers for decades.\n\nClub medics told football chiefs about the problem months after England won the World Cup in 1966.\n\nThree of the 11 England heroes who played in the final – Nobby Stiles, Martin Peters and Ray Wilson – were later diagnosed with dementia.\n\nAn article entitled “Danger in heading the ball”, in the Football League Review magazine of October 1966, quoted a club medic who said the “continual jarring of the brain tissue could and does affect players”.\n\n(Image: Popperfoto/Getty Images)\n\nThe article added all-time great Dixie Dean, who sprang to fame in the 1920s, always carried aspirin with him to ease the crippling headaches he suffered after years of heading the ball.\n\nWhile fellow England star Tommy Lawton could not shake off headaches he blamed on his playing career between the 1930s and 1950s.\n\nNorthern Ireland international Derek Dougan, who played in the 1950s, 60s and 70s, told the magazine: “Time and again after a game I suffer from headaches, obviously from all the heading I do.”\n\nAnd Leeds centre-back turned ­journalist Tom Holley, who began his career in the 1930s, said: “I never had headaches before I started playing, and I’ve never really got rid of them.”\n\nA few years later Jimmy Hill, who chaired the Professional Footballers’ Association in the 1960s and died in 2015 after suffering from Alzheimer’s, tried to raise the dangers of heading footballs.\n\n(Image: Getty)\n\nHis widow Bryony said: “I met Jimmy when I was his ­secretary in the 70s. I remember him having correspondence from a doctor or professor who was trying to link footballers with dementia and mental problems. Jimmy was very concerned.”\n\nIn fact records of doctors blaming brain injuries on heading the ball can be traced back at least 80 years.\n\nIn 1939, former Man United captain Charlie Roberts told the Mirror he was having surgery to remove “a growth at the back of my skull which has developed as a result of heading heavy balls so often over 20 years ago”.\n\nHe added: “I have been almost like the living dead for the last two years.”\n\nCharlie never recovered from the operation and died days later, aged 56.\n\nThe former player’s death certificate listed the tumour and the brain surgery as the causes of his death.\n\nThis week research revealed footballers are three-and-a-half times more likely to die of dementia and are at greater risk of other conditions such as motor neurone disease.\n\nThe research, funded by the PFA and the FA, looked at pro footballers who were born between 1900 and 1976.\n\nThe study was set up two years ago after a campaign by the Mirror and families of former footballers.", "description": "EXCLUSIVE: Three of England's World Cup-winning squad - Nobby Stiles, Martin Peters and Ray Wilson – were later diagnosed with dementia", "authors": ["Warren Manger", "Image", "Getty", "Popperfoto Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20699704.ece/ALTERNATES/s1200/0_BallsMAIN.jpg", "published_at": "2019-10-22"}