{"pub": "time", "url": "https://time.com/5665392/10-most-urgent-press-freedom-september", "downloaded_at": "2019-09-03 23:39:19.049104+00:00", "title": "10 'Most Urgent' Threats to Press Freedom Around the World", "language": "en", "published_at": "2019-09-04", "text": "Journalists imprisoned, harassed and threatened for doing their work in countries spanning from Colombia to India to Iran are included on September’s list of cases that make up the most serious threats to press freedom.\n\nThe list—released each month by the One Free Press Coalition, which was founded by a dozen news organizations, including TIME, with the goal of defending journalists under attack—identifies 10 of the most urgent examples of threats to press freedom around the world.\n\nLast year, TIME named The Guardians the 2018 Person of the Year, recognizing four journalists and one news organization for their work in the face of threats to press freedom. Jamal Khashoggi, one of the journalists recognized in the issue, remains on top of this month’s 10 Most Urgent list, as the one-year anniversary of his killing and dismemberment inside the Saudi consulate in Istanbul on Oct. 2, 2018 approaches.\n\nKhashoggi’s death remains controversial, particularly following a United Nations special report released in June that found “credible evidence” calling for further investigation into Saudi Crown Prince Mohammed bin Salman’s role in the killing. The report was the result of a five-month investigation into what U.N. Special Rapporteur Agnes Callamard called a “deliberate, premeditated execution” of Khashoggi, a Washington Post columnist and an outspoken critic of bin Salman.\n\nThe Brief Newsletter Sign up to receive the top stories you need to know right now. View Sample Sign Up Now\n\nThe Trump Administration has been criticized for maintaining a close relationship with Saudi Arabia, even after U.S. intelligence officials concluded that bin Salman ordered Khashoggi’s killing.\n\nSee the 10 journalists on September’s list here:\n\n1. Jamal Khashoggi (Saudi Arabia): No independent investigation into killing, despite conclusions from intelligence reports\n\nAs the one-year anniversary of Khashoggi’s death approaches on Oct. 2, officials have not yet opened an independent criminal investigation into his death. No one has been held responsible for Khashoggi’s killing, even as the United Nations and U.S. intelligence officials have concluded that the Saudi crown prince was involved in the journalist’s death. Calls for the White House to release intelligence reports on the killing have been ignored, as was a February deadline for Trump to reply to Congress under the U.S. Global Magnitsky Act.\n\n2. Lydia Cacho (Mexico): Mexican investigative reporter targeted with attacks and death threats for her freelance work\n\nAlthough she’s had government-provided protection for about a decade, Cacho continues to face threats and attacks for her freelance reporting and promotion of the freedom of expression, including a raid on her home in July in which burglars killed her pets and stole devices that contained information about sexual abuse cases she was investigating.\n\n3. Erick Kabendera (Tanzania): Detained under a number of charges in retaliation for critical reporting\n\nKabendera was charged in early August with money laundering, tax evasion and assisting an organized crime racket as part of what appears to be an aim to justify the government detaining him over his critical reporting. Most recently, his journalism focused on alleged divisions in Tanzania’s ruling party. Because he has been charged with money laundering, Kabendera does not qualify for bail.\n\n4. Claudia Duque (Colombia): Colombian investigative journalist could face 10 years in prison\n\nAfter facing numerous threats through a 26-year career in journalism, including kidnapping, illegal surveillance and psychological torture, Duque could potentially face a 10-year prison sentence for talking about the impunity surrounding a case regarding her perpetrators. In July, the court overseeing the trial ordered an injunction banning Duque from questioning the court, facing her perpetrators or sharing her opinions about the case.\n\n5. Azory Gwanda (Tanzania): Tanzanian government claims missing journalist died—but later backtracked\n\nGwanda, a freelance journalist covering mysterious killings in rural Tanzania, went missing in November 2017. Since then, the Tanzanian government has neglected to fully investigate or give clear answers about what happened to him. In July, a Tanzanian government official said Gwanda had “disappeared and died,” but later backtracked that statement.\n\n6. Roberto Jesús Quiñones (Cuba): Journalist sentenced to prison on “resistance” and “disobedience” charges\n\nIn August, Quiñones was sentenced to one year in prison following his arrest in April as he was covering a trial for CubaNet. Cuban authorities said Quiñones’s behavior during his detention constituted “resistance” and “disobedience,” and charged and imposed a fine on him for his conduct. Quiñones was sentenced to a year in prison for refusing to pay the fine. The U.S. has criticized Cuba for imprisoning Quiñones, with Secretary of State Mike Pompeo calling out the country’s “flagrant disregard for legal norms.”\n\n7. Aasif Sultan (India): Imprisoned in Kashmir for more than a year\n\nSultan, a reporter for Kashmir Narrator, has been imprisoned in Kashmir for more than a year following his arrest in August 2018 during a raid on his home. He has been charged with “complicity” in “harboring known terrorists” and repeatedly been asked to reveal his sources. Sultan’s case is highlighted as citizens in Kashmir contend with a communications blackout imposed by the Indian government in early August.\n\n8. Azimjon Askarov (Kyrgyzstan): Kyrgyz court upholds life sentence for journalist who reported on human rights violations\n\nDespite international calls for Askarov’s release from prison, a Kyrgyz court in July upheld the journalist’s life sentence. Askarov has been imprisoned for nine years on charges for reporting on human rights violations.\n\n9. Khadija Ismayilova (Azerbaijan): Faces rampant harassment and impediments to reporting for her investigative work\n\nAfter being released from prison in 2016 for writing about the money flows and property holdings used by the Azerbaijani president and his family in 2014, Ismayilova again faces harassment. This year, courts upheld tax evasion charges against Ismayilova that date back to her role as bureau chief for Radio Free Europe/Radio Libery a decade ago. She also faces a travel ban, financial penalties, frozen assets and an inability to report.\n\n10. Masoud Kazemi (Iran): Imprisoned journalist sentenced to more than four years in prison\n\nKazemi, the editor-in-chief of the political magazine Sedaye Parsi, was sentenced to four and a half years in prison on charges that he spread anti-state propaganda and insulted Iran’s supreme leader and other government officials. The charges are based on tweets Kazemi wrote in November 2018 about his reporting on corruption in Iran’s Ministry of Industry. Kazemi will be banned from working as a journalist for two years following his release.\n\nContact us at editors@time.com.", "description": "Journalists imprisoned or threatened for their work from Colombia to India to Iran are included on September's list.", "authors": ["Time Staff"], "top_image": "https://timedotcom.files.wordpress.com/2018/10/ap18295429854488.jpg?quality=85&w=1200&h=628&crop=1"}