{"pub": "cbc", "url": "https://cbc.ca/radio/costofliving/shopping-for-candy-and-cell-phones-and-will-you-even-be-able-to-buy-them-at-the-bay-in-ten-years-1.5332657/why-the-solution-to-your-high-cellphone-bill-could-be-a-move-to-saskatchewan-1.5335478", "downloaded_at": "2019-10-28 09:50:06.547194+00:00", "title": "CBC Radio", "language": "en", "text": "Monthly prices for cellphone services have remained stubbornly high in Canada, prompting the national telecommunications regulator to review wireless policies and federal politicians to promise to slash rates as part of their federal election platforms.\n\nBut those high prices are not consistent across Canada.\n\nCBC Radio's new business and economics show, Cost of Living, airs on CBC Radio One every Saturday at 11:30 a.m. (12 p.m. NT) or online anytime at CBC Listen.\n\nRight now, one of the only ways to guarantee a lower cellphone rate — without promotions or intense bargaining — may be to move to specific provinces in Canada, like Saskatchewan or Quebec, where consumers shopping for plans can often find lower prices.\n\nIt's a discrepancy easily demonstrated online, by choosing different provincial locations on the major provider's websites.\n\nCBC Radio's Cost of Living spoke to one person who managed to save money using a time-honoured secret Prairie trick: keeping your Saskatchewan phone number when you move to Alberta.\n\n\"There's lots of options here in Alberta, but none of them were as cost-effective as what is offered in Saskatchewan,\" said Olds, Alta., resident Austin Webb, who moved from Saskatchewan 10 years ago.\n\nFor example, entry-level smartphone plans advertised on Bell Mobility's website on Oct. 25 showed prices that were often $10 to $15 higher for equivalent — or less — service in Alberta, as opposed to Saskatchewan or Quebec.\n\nIn this composite screenshot, the first two prices are offered by Bell to customers in Alberta, while the third and fourth prices — which are lower — are offered to customers in Quebec in late October 2019. (Bell.ca)\n\nOn that same date, Bell offered a plan with unlimited Canada-wide calling and 10 GB of data in Quebec for $105 monthly. The company offered the same plan in Alberta for $115. Meanwhile, a plan with unlimited calling and 6 GB of data would have cost $75 a month in Quebec, while a plan with unlimited calling and just 5 GB of data would have cost $100 in Alberta.\n\nWhy are bills cheaper in Quebec and Saskatchewan?\n\nQuebec and Saskatchewan both have strong fourth wireless providers who operate independently of Canada's three major telecom companies — Rogers, Bell and Telus.\n\nIn Quebec, Quebecor's subsidiary Videotron provides cell services. In Saskatchewan, Crown corporation SaskTel runs a province-wide network. Neither company operates widely outside their respective home province.\n\n\"What those new entrants have brought to the market is increased competition,\" said Eric Smith, senior vice-president of the Canadian Wireless Telecommunications Association.\n\n[Competitors] want to take 10,000 customers away from Bell … how are [they] going to do that? They're going to drive down prices. - Greg O'Brien, editor and publisher of Cartt.ca\n\nThe presence of competition is a major driving force when it comes to lower prices in those markets, according to Greg O'Brien, editor and publisher of industry news site Cartt.ca.\n\n\"So when you go to Montreal and Videotron is like, we want to take 10,000 customers away from Bell this quarter, how are we going to do that? They're going to drive down prices,\" said O'Brien.\n\nThe competitive pressures that result in lower prices in those markets aren't promotional or temporary, and that is at least partly because the presence of those provincial competitors isn't temporary.\n\nSince that same competition doesn't exist elsewhere in Canada, prices are unlikely to drop in other places.\n\n\"Bell isn't going to respond with driving down prices all across the country,\" O'Brien said. \"They'll drive down prices to combat that competitive pressure in [only] that market.\"\n\nWhat about Freedom Mobile?\n\nFreedom Mobile, formerly known as Wind Mobile, operates as a fourth carrier in markets including B.C., Alberta and Ontario.\n\nThe company faces higher costs because it has to build infrastructure in more places across the country than provincial providers, and it didn't have the head start that many of the established national players had.\n\n\"The idea [is] that if you want to enter the marketplace to compete against Bell, Telus, and Rogers, you have to build your own network across all of Canada,\" said Laura Tribe, executive director of consumer advocacy group OpenMedia. \"But those companies have had decades of head start and lots of government subsidies to help them along the way.\"\n\nWhile Freedom is now owned by Shaw Communications, their initial, independent incarnation of Wind Mobile had to compete with these entrenched providers, who also had an existing customer base.\n\nCompetition has worked at times\n\nDespite that, Freedom has managed to bring prices down since entering the market.\n\nRemember the long wait times and high demand for plans that offered 10 GB for $60 a month?\n\n\"People stayed at home for hours now [and] they waited in line for hours in the mall in the middle of the holiday shopping season just to try and get a cheaper cellphone plan,\" said Tribe.\n\n\"What actually spurred that on was Freedom lowering their rates.\"\n\nLaura Tribe is executive director of OpenMedia. (CBC )\n\nAccording to Tribe, this behaviour is also a factor in why a fourth cellphone service provider has had trouble taking root nationally.\n\n\"I think it's very clear to see that the incumbents don't want any sort of other providers in the marketplace,\" said Tribe. \"Every time that different types of plans, proposals, competitive circumstances have come up, they've been very quick to try and offer those plans themselves to prove that they can do it without bringing in more providers.\"\n\nSo what's next?\n\nThe Canadian Wireless Telecommunications Association says major service providers believe prices have dropped in the past year, though independent data from the CRTC is not yet available.\n\n\"In the past year, prices have gone down approximately 30 per cent from 2016 to 2018,\" said Smith, with the association. \"Then fast forward to this summer where you saw the national operators introduce unlimited data plans.\"\n\nHowever, telecom research firm tefficient recently noted that even with those recent price drops, it could take Freedom Mobile around three decades to catch up to Canada's major cellphone service providers.\n\nCanada: The big 3 copied Freedom's USP (the no-overage 'unlimited' plan) but Freedom still takes market share. With the current pace, Freedom will have closed the gap in postpaid subscriptions in 30 years. <a href=\"https://t.co/Lqs128pk2n\">pic.twitter.com/Lqs128pk2n</a> —@tefficient\n\nCellphone bills have also been a talking point for politicians looking to appeal to voters' pocketbooks in the federal election.\n\nLiberal Party Leader Justin Trudeau promised a 25 per cent rate cut to wireless prices, along with increased support for mobile virtual network operators — companies that resell services they've purchased wholesale from the three major telecom providers.\n\nNDP Leader Jagmeet Singh has called for a price cap on cellphone bills.\n\nBut outside of the political sphere, decisions about whether regulations should be changed to encourage more network operators, or about whether to introduce price controls, involve the CRTC.\n\nThe regulator has started what it calls a comprehensive review of wireless services, which the CRTC has hearings scheduled for in early 2020.\n\nWritten and produced by Anis Heydari.", "description": "Millions of Canadians in Quebec and Saskatchewan are getting sweet deals on their cellphone plans compared to prices in other provinces. So aren't why those lower fees standard across the country?", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5046890.1572030420!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/cell-phones.jpg", "published_at": "2019-10-26"}