{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/27/the-latest-foley-back-at-10-genia-to-start-for-wal", "downloaded_at": "2019-09-27 05:39:26.233407+00:00", "title": "The Latest: Georgia makes 12 changes to starting lineup", "language": "en", "text": "TOKYO (AP) - The Latest on Day 8 of the Rugby World Cup in Japan (all times local):\n\n1:45 p.m.\n\nGeorgia coach Milton Haig has made 12 changes to his starting XV to take on Uruguay in a Pool D game at Kumagaya on Sunday.\n\nWinger Giorgi Kveseladze, flyhalf Tedo Abzhandadze and lock Konstantine Mikautadze are the only players retained from the Georgia starting lineup that lost to Wales last Monday.\n\nVeteran hooker Jaba Bregvadze, who was yellow-carded after going on as a replacement against Wales, will lead Georgia against a Uruguay squad that opened the tournament with an upset 30-27 win over Fiji.\n\nGeorgia lineup: Lasha Khmaladze, Zura Dzneladze, Giorgi Kveseladze, Lasha Malaguradze, Alexander Todua, Tedo Abzhandadze, Gela Aprasidze; Otari Giorgadze, Beka Saginadze, Shalva Sutiashvili, Konstantine Mikautadze, Lasha Lomidze, Levan Chilachava, Jaba Bregvadze (captain), Guram Gogichashvili. Reserves: Vano Karkadze, Beka Gigashvili, Giorgi Melikidze, Mamuka Gorgodze, Beka Gorgadze, Vasil Lobzhanidze, Merab Sharikadze, Soso Matiashvili.\n\n___\n\n1:15 p.m.\n\nWales head coach Warren Gatland will start with the same XV for the crucial Pool D game against Australia as he did for the opening win over Georgia.\n\nVeteran lock Alun Wyn Jones will lead the team in what will be his record 130th test cap for Wales, breaking a mark he shares with Gethin Jenkins.\n\nThe Six Nations champions opened with a 43-13 win over Georgia on Monday, two days after Australia opened with a 39-21 win over Fiji.\n\nThe winner of Sunday’s game at Tokyo Stadium is likely to top the group.\n\nWales lineup: Liam Williams, George North, Jonathan Davies, Hadleigh Parkes, Josh Adams, Dan Biggar, Gareth Davies; Josh Navidi, Justin Tipuric, Aaron Wainwright, Alun Wyn Jones (captain) Jake Ball, Tom Francis, Ken Owens, Wyn Jones. Reserves: Elliot Dee, Nicky Smith, Dillon Lewis, Aaron Shingler, Ross Moriarty, Tomos Williams, Rhys Patchell, Owen Watkin\n\n___\n\n1 p.m.\n\nBernard Foley has been recalled to start at flyhalf for Australia in its crucial Pool D game against Wales.Foley kicked all of Australia’s points in a 15-6 win over Wales in the 2015 World Cup, and is one of five players retained from the squad that played in that group-stage match four years ago.\n\nFoley and Will Genia will reunite in the halves after Christian Leali’ifano was cut from the 23-man match squad and scrumhalf Nic White was relegated to the bench.\n\nFoley missed Australia’s opening 39-21 win over Fiji, when Leali’ifano started at 10. Genia’s entry as a second-half replacement helped swing momentum back to Australia against the Fijians.\n\nHead coach Michael Chekia made two other changes to the starting XV, with Adam Ashley-Cooper set to start in his fourth World Cup as a replacement on the wing for the suspended Reece Hodge, and Dane Haylett-Petty starting at fullback at Kurtley Beale’s expense.\n\nCheika has stuck with the same backrow combination that started against Fiji, with David Pocock remaining on the blindside flank.\n\nAustralia lineup: Dane Haylett-Petty, Adam Ashley-Cooper, James O’Connor, Samu Kerevi, Marika Koroibete, Bernard Foley, Will Genia; Isi Naisarani, Michael Hooper (captain), David Pocock, Rory Arnold, Izack Rodda, Allan Alaalatoa, Tolu Latu, Scott Sio. Reserves: Jordan Uelese, James Slipper, Sekope Kepu, Adam Coleman, Lukhan Salakaia-Loto, Nicholas White, Matt Toomua, Kurtley Beale.\n\n___\n\n12:30 p.m.\n\nAll 20 teams have had a taste of Rugby World Cup action and now there’s a one-day pause in the tournament for some rest and relaxation.\n\nThere were 12 games in the opening seven days, starting with Japan’s win over Russia and also including defending champion New Zealand’s win over South Africa and France’s win against Argentina.\n\nThis weekend will feature three games on Saturday and two on Sunday, with Argentina kicking things off against Tonga in Osaka.\n\nJapan faces Ireland and South Africa and Namibia meet later Saturday. Australia and Wales go head-to-head on Sunday.\n\n___\n\nMore AP Rugby World Cup: https://www.apnews.com/RugbyWorldCup and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Latest on Day 8 of the Rugby World Cup in Japan (all times local):", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/26/the_week_that_was_in_asia_photo_gallery_09097_c0-119-2845-1777_s1770x1032.jpg?c82f4e07d3aa8328cb6c7927b1360aa084910645", "published_at": "2019-09-27"}