{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/protecting-us-government-leaders-security-analysis/story?id=66258938", "downloaded_at": "2019-10-18 10:34:47.526504+00:00", "title": "Protecting US government leaders: Who gets security and why: ANALYSIS", "language": "en", "text": "Secretary of Education Betsy DeVos has a protective detail provided by the U.S. Marshals Service, and it's been questioned by some members of the public who don’t understand its threat basis and consider it unnecessary since it seemed to be started due to politics and its cost has increased.\n\nThose questions are answered by some basic information about the U.S. government agencies that provide personal protection and why they provide it.\n\nPeronsal or executive protection is typically based on three factors: position, threats and risk. The president of the United States, for instance, triggers all three -- it is an important position that typically receives many threats, and the risk of something happening to them would have enormous consequences.\n\nIn the United States, executive protection is provided by an array of federal entities whose mission is to ensure their charges are kept free from harm. Often, though, the overlapping federal gamut becomes confusing as different agencies perform what many perceive as a similar function but for different people.\n\nHere's a rundown of how protective services are managed:\n\nSecret Service:\n\nThe Secret Service is often thought of -- and sometimes confused -- as the only agency within the federal government that protects people. While the Secret Service does protect a large array of individuals, the scope of that protection can be dwarfed by other federal agencies.\n\nJonathan Ernst/Reuters\n\nBy law, 18 USC 3056, under the direction of the secretary of Homeland Security, the United States Secret Service is authorized to protect:\n\n- The president and vice president (or other officer next in the order of succession to the office of president)\n\n- The president-elect and vice president-elect\n\n- The immediate families of those individuals\n\n- Former presidents and their spouses for their lifetimes, except that protection of a spouse shall terminate in the event of remarriage\n\n- Children of a former president who are under 16 years of age.\n\n- Visiting heads of foreign states or foreign governments including the pope\n\n- Other distinguished foreign visitors to the United States and official representatives of the United States performing special missions abroad when the president directs that such protection be provided, such as the U.S. trade representative\n\n- Major presidential and vice presidential candidates and, within 120 days of the general presidential election, the spouses of such candidates\n\n- Former vice presidents, their spouses and their children who are under 16 years of age, for a period of not more than six months after the date the former vice president leaves office\n\nUnder the law, each of the above list of individuals may decline protection except for the sitting president, vice president and president- and vice president-elect. Former President Richard Nixon waived protection during the latter years of his life.\n\nAdditionally, the Secret Service has been directed to protect certain Cabinet-level officials -- including the secretary of Homeland Security and secretary of treasury -- and senior White House staff often considered critical to national security, including the White House chief of staff and national security adviser.\n\nCurrently, the Secret Service provides protection to over 40 individuals on a full time bases and can provide temporary protection of almost 200 individuals -- as happens every September during the United Nations General Assembly in New York City.\n\nDiplomatic Security Service (DSS):\n\nWithin the State Department, the Diplomatic Security Service (DSS) has a high-profile personal protective function as well, highlighted whenever the secretary of state travels overseas. The secretary of state detail is DSS's largest permanent dignitary protective detail.\n\nDSS also has an ongoing protection detail on the United States ambassador to the United Nations and operates protective assignments on visiting foreign dignitaries and diplomats, which is highlighted during the United Nations General Assembly.\n\nBettmann Archive/Getty Images\n\nTypically, foreign and defense ministers from important nations as well as others with high threats are typically covered by DSS. These have included Prince William, Prince Harry, the Dalai Lama, Palestinian Authority President Mahmoud Abbas and Princess Diana. The DSS is also tasked with providing protection to the U.S. Olympic team and ensuring they remain safe at Olympic venues.\n\nIntelligence community:\n\nThe CIA director and some of their deputies, as well as the director of national intelligence, are also provided personal protection due to the nature of what they do and threats.\n\nThis executive protection is provided by the Security Protective Service and Protective Agents, who -- despite Hollywood depictions -- are actually federal law enforcement officers with police powers rather than agents from the ranks of the CIA's intelligence personnel. This is due in large part to the necessity of these officers to be able to arrest people, an authority intelligence officers lack.\n\nThe risk of one of those high-ranking individuals being captured is a tremendous risk to our national security and drives the reasons for the personal protective details.\n\nU.S. Capitol Police:\n\nEvery single individual in Congress that holds leadership positions, including the speaker of the House, House minority leader, Senate president pro tempore, Senate majority and minority leaders as well as the whips in those chambers, receives personal protection from the U.S. Capitol Police.\n\nThe Capitol Police also conduct risk assessments of every member of Congress and may, from time to time, establish a protective detail on a member if the threat matrix against them becomes pronounced.\n\nFBI and U.S. Marshals Service (USMS):\n\nWithin the Department of Justice (DOJ), both the FBI and U.S. Marshals Service have delineated personal protective functions focused on individuals within the DOJ framework.\n\nThe FBI operates the protective detail for the attorney general of the United States and also others as requested by DOJ. The attorney general is the FBI's only permanent personal protective mission. In some limited ways, the FBI may also perform personal protection on high-profile witnesses or victims.\n\nMark Makela/Getty Images\n\nThe Marshals Service has broad legal authority to provide protection for almost anyone not given specific protection by law, hence their ability to provide protection for the secretary of education.\n\nAdditionally, the Marshals Service has the authority to protect federal judges, including judges on the Supreme Court, U.S. attorneys and in rare cases, high-profile criminals and witnesses who may testify against dangerous criminals.\n\nFormer Iraq President Saddam Hussein, for example, received protection from the Marshals Service prior to his death sentence and the Marshals Service ran the court process in Afghanistan for several high-profile terrorist cases.\n\nDepartment of Defense:\n\nPerhaps the largest and broadest personal protective role in the federal government is the Department of Defense (DOD) and its component military branches that operate protective details on a wide range of DOD personnel and officers.\n\nTom Brenner/Reuters\n\nThe highest profile is, of course, the secretary of defense, who receives their protection via the U.S. Army Protective Services Battalion (CID), who also cover the deputy secretary of defense, the chairman and vice chairman, joint chiefs, the secretary of the Army, the chief of staff of the Army, the vice chief of staff of the Army, their foreign counterparts on official visits to the United States and other Department of Defense High Risk Personnel as directed.\n\nThey can also provide executive level protection for senior U.S. Army commanders during war-time and contingency operations as directed, most recently in Iraq and Afghanistan.\n\nOther Cabinet-level officials in the federal government also receive different levels of personal protection from law enforcement components within their department. These personal protective details take different forms and are often authorized via an official directive vs definitive legal authority.\n\nThus, there has been a move to have the U.S. Marshals Service take over all personal protective details not specifically delineated in law. In the 2020 budget, the administration asked Congress for $1 million in funding to study whether it makes sense for the U.S. Marshals Service to take over protection of civilian Cabinet- and sub-Cabinet-level officials across the federal government.\n\nPersonal protection is a risk-based tool used to ensure that an individual is kept safe from a myriad of potential threats. The art of protection dates back centuries but its function has remained the same: to keep someone safe.\n\nDonald J. Mihalek is an ABC News contributor, retired senior Secret Service agent who served on the Presidents Detail and participated in coordinating several National Special Security Events who also served as a regional field training instructor and is currently the executive Director of the Federal Law Enforcement Officers Association.\n\nRichard Frankel is an ABC News contributor and retired FBI special agent who was the special agent in charge of the FBI's Newark Division and prior to that, the FBI's NY Joint Terrorism TASK force. He is currently the Vice President of Investigation for T&M Protection Resources.", "description": "An explanation of which U.S. government leaders get protective services, who provides it, and why.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/econ_trump_main_190819_hpMain_20190819-024357_16x9_992.jpg", "published_at": "2019-10-18"}