{"pub": "bbc", "url": "https://bbc.com/news/world-africa-49887553", "downloaded_at": "2019-10-01 04:33:06.892315+00:00", "title": "Moroccan journalist Hajar Raissouni jailed on abortion charges", "language": "en", "text": "Image copyright Reuters Image caption Activists with posters of the journalist held a protest outside the tribunal last month\n\nA Moroccan journalist has been sentenced to a year in prison for premarital sex and having an abortion, in a case activists say is part of a crackdown on critical reporters.\n\nHajar Raissouni was arrested with her fiancé as they left a gynaecologist's clinic in the capital Rabat in August.\n\nThe 28-year-old denied the charges, saying she had sought treatment for internal bleeding.\n\nMs Raissouni works for an independent newspaper critical of the authorities.\n\nA journalist at the Akhbar Al-Yaoum daily, she denounced the case against her as a \"political trial\", saying she had been questioned by police about her family and her writing.\n\nWearing a black veil covering her head, Ms Raissouni appeared calm on arrival at the courtroom in Rabat. She and her fiancé, a Sudanese national, denied that an abortion had taken place.\n\n\"We're shocked by this verdict,\" her lawyer, Abdelmoula El Marouri, told the Reuters news agency, saying that all the medical and legal evidence should have led to an acquittal. He said he would appeal against the verdict.\n\nThe prosecutor in the case said the circumstances of the journalist's arrest had nothing to do with her work as a journalist, and that the clinic she had visited was under police surveillance on suspicion of carrying out illegal abortions.\n\nThe court sentenced her fiancé to a year in prison and her doctor to two years. The doctor's assistant and a nurse at the clinic were also found guilty but were given suspended sentences.\n\nAhmed Benchemsi, regional director for Human Rights Watch, described the verdict as a \"black day for freedom in Morocco\", calling it \"a blatant injustice, a flagrant violation of human rights, and a frontal attack on individual freedoms.\"", "description": "Activists say the charges against Hajar Raissouni are part of a crackdown on critical reporters.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/B24B/production/_109034654_ee458cf8-49e7-4dcd-9a3c-40a3027e9db2.jpg", "published_at": "2019-10-01"}