{"pub": "blastingnews", "url": "https://us.blastingnews.com/gaming/2019/10/d2-glitch-through-the-pyramid-ship-the-towers-secret-room-and-a-real-life-easter-egg-002993793.html", "downloaded_at": "2019-10-05 05:54:07.913047+00:00", "title": "‘D2:’ Glitch through the pyramid ship, the Tower’s secret room, and a real-life Easter egg", "language": "en", "text": "“Destiny 2: Shadowkeep” is just a few days old, and its community of Guardians has already stumbled upon some interesting finds/glitches in the game. One of the most recent was the secret room within the Tower where the new Exotic bow – Leviathan’s Breath is on display. With that in mind, another neat trick has been discovered where players can glitch through to the pyramid ships that remain a mystery among the “D2” community.\n\nReddit user u/DragonWarriorz8 recently took r/raidsecrets claiming that it is possible to glitch inside of the pyramid ship on the moon. The OP even uploaded a short clip over on his YouTube channel where he showed how to get inside.\n\nGetting inside\n\nAccording to him, players need to be on the Titan class equipped with the Lion Rampant Leg Armor and the Striker middle-class ability along with the Catapult Lift.\n\nIn the video, he initially used the Ballistic Slam in an area on the Moon to somewhat breakthrough on what he calls an “initial barrier.”\n\nNext is to do the so-called jump sword glitch to reach the small opening of the ship. Once the small chamber has been reached, players need to constantly stay in the middle of it. Otherwise, Guardians will be eliminated by what the OP calls “kill barrier.” He further explained that the jumping mechanic is quite difficult and would take a bit of practice to master.\n\nDon’t miss the latest news! Click on the topic you interest most. We'll keep you updated with all the news you shouldn't miss. Video Game\n\nOnce inside, the OP did a bit of exploring as one of the notable things that were spotted in the video was a huge statue that has a striking similarity to Bungie’s concept art.\n\nAn Exotic and a secret room\n\nMeanwhile, as for the above-mentioned secret room in the Tower, players need to activate the high jump mini-game where they need to reach the glowing light without touching the ground. If successful, they will now have the ability to jump pretty high and this will be used to reach that hidden area within the Guardian’s social space. YouTuber Papa Console’s (MoreConsole) recent upload has a walkthrough on how to get there.\n\nReal-life Easter egg\n\nAnother discovery was also discovered a few days ago where players can interact with real-life Easter egg in-game. Arizona State University’s space probe dubbed the Lunar Polar Hydrogen Mapper (a.k.a. LunaH-Map) was added into the game as this (according to MoreConsole) is said to be a collaboration between Bungie and folks over at ASU.\n\nSome players have already figured out the coordinates of the space probe’s crash site in the game as it can be found at the Lost Sector K1 Logistics (near Archer’s Line).\n\nOnce found, players need to interact with it and they will be rewarded with an emblem known as the Orbital Cartographer which is based on the space probe’s logo.\n\nIn 2021, ASU’s LunaH-Map probe will be sent to the Moon to look for water-ice on its “permanently shadowed regions.” When its mission is completed, it will be sent crashing down to the Lunar surface and will stay there for good.", "description": "A 'Destiny 2' player discovered a glitch that allowed him to get inside one of these mysterious ships.", "authors": ["Zeegee Cecilio", "Ramon Sanchez", "Read More On The Same Topic E. Cross", "'Fortnite' Players Express Their Ire Towards The Game S Cross-Platform Matchmaking", "' Huckleberry Exotic Getting Significant Buffs", "Eriana'S Vow Perks", "Ornament Spotted", "'Fortnite ' Kid'S Tender Defender Skin Makes It To Guinness Book Of World Records"], "top_image": "https://staticr1.blastingcdn.com/media/photogallery/2019/10/4/os/b_1200x630/bungies-concept-art-featuring-the-nacho-shaped-ships-image-source-unknown-playeryoutube_2334095.jpg", "published_at": "2019-10-04"}