{"pub": "reuters", "url": "https://ca.reuters.com/article/topNews/idCAKBN1WZ0ND-OCATP", "downloaded_at": "2019-10-20 23:26:48.501174+00:00", "title": "Canada's frontrunners slam Quebec sovereignty comment on final day of election campaign", "language": "en", "text": "VANCOUVER (Reuters) - The two frontrunners in Canada’s election campaign attacked the leader of the Bloc Quebecois, Yves-Francois Blanchet, on Sunday, the final day before the vote, for again raising the prospect of a sovereign Quebec.\n\nThe Leader of Canada's Conservatives Andrew Scheer campaigns for the upcoming election in Vancouver, British Columbia Canada October 20, 2019. REUTERS/Carlos Osorio\n\nThe Bloc, which fields candidates only in the French-speaking province, has surged during the six-week official campaign, partly thanks to Blanchet’s convincing performance in the debates, where he promised to stick up for Quebec.\n\nThat has eaten into both Liberal Prime Minister Justin Trudeau and Conservative opposition leader Andrew Scheer’s support in the province, which is a key battleground in a very tight race.\n\nIn a speech on Saturday in Saint-Jean-sur-Richelieu, a town to the southeast of Montreal, Blanchet said the Bloc’s position was that the Quebec nation “will have to once again consider giving itself all the attributes of sovereignty.”\n\nThat was enough for both Trudeau and Scheer to respond that Blanchet would take the province once again down a path toward separation from the rest of Canada, a prospect most Quebecers have not embraced in recent years.\n\n“Canadians need to come together and we got a very clear reminder of that last night in Quebec when the Bloc Québécois came out and said its number one priority is separation, dividing the country once again,” Trudeau said at a bakery in the Vancouver suburb of Port Moody.\n\nScheer said the Bloc would seek another referendum over whether Quebec should proclaim sovereignty after the two previous ones failed. The last one, in 1995, ended with 50.6% saying “no” and 49.4% saying “yes.”\n\n“A vote the bloc is a vote for the referendum,” Scheer said in Vancouver.\n\nThe provincial party that triggered both referenda was the Parti Quebecois, which got hammered in last year’s provincial election by the nationalist Coalition Avenir Quebec.\n\nBlanchet himself responded to Trudeau and Scheer on Sunday on Twitter, saying ambiguously: “We understand the limits of the mandate of Quebecers and we respect all of Quebec.”", "description": "The two frontrunners in Canada's election campaign attacked the leader of the Bloc Quebecois, Yves-Francois Blanchet, on Sunday, the final day before the vote, for again raising the prospect of a sovereign Quebec.", "authors": ["David Ljunggren", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191020&t=2&i=1443092059&w=1200&r=LYNXMPEF9J0NB-OCATP", "published_at": "2019-10-20"}