{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/afp/article-7557455/Jews-demand-action-Germany-deadly-anti-Semitic-attack.html", "downloaded_at": "2019-10-10 06:19:09.602441+00:00", "title": "Jews demand action from Germany after deadly...", "language": "en", "text": "People leave candles and flowers at a vigil at the Marktplatz in Halle, eastern Germany\n\nJewish leaders demanded action from Germany Thursday to protect the community and face down resurgent right-wing extremism, as a deadly anti-Semitic gun attack on the holy day of Yom Kippur underscored the rising threat of neo-Nazi violence.\n\nAt least two people were shot dead in the eastern German city of Halle on Wednesday, with a synagogue among the targets. The suspect, identified by German media as 27-year-old German Stephan Balliet, filmed the assault and posted the video online.\n\nThe rampage was streamed live for 35 minutes on Twitch, and eventually seen by some 2,200 people, the online platform said, in a chilling reminder of the mosque attack in Christchurch, New Zealand last March which was also online in real-time.\n\nPolice subsequently captured the Halle suspect after a gun battle that left him injured.\n\nChancellor Angela Merkel joined a solidarity vigil at Berlin's main synagogue on Wednesday, and firmly condemned the anti-Semitic rampage.\n\nAttack in Germany\n\nBut Jewish leaders said that words were not enough, with Israeli Prime Minister Benjamin Netanyahu joining calls for German authorities to \"act resolutely against the phenomenon of anti-Semitism\".\n\nThe head of the Central Council of Jews in Germany ripped into the authorities for failing to provide adequate security on such a key day.\n\n\"It is scandalous that the synagogue in Halle is not protected by police on a holiday like Yom Kippur,\" said Josef Schuster.\n\n\"This negligence has now been bitterly repaid.\"\n\nRonald Lauder, who heads the World Jewish Congress, also stressed: \"We need action not words\" as he called for round the clock security for Jewish sites.\n\n\"We also need immediately to launch a unified front against neo-Nazi and other extremist groups, which threaten our well-being.\n\n\"The fact that, 75 years after the Holocaust, such groups are gaining influence in Germany speaks volumes.\"\n\n- 'We made it out' -\n\nIn a copy of a 35-minute video obtained by AFP the gunman filmed himself launching into a diatribe against women and Jews, before carrying out the attack.\n\nThe video's authenticity has been confirmed by the SITE monitoring group but not by police.\n\nThe gunman also published an anti-Semitic \"manifesto\" online more than a week ago, according to SITE director Rita Katz, who said the document showed pictures of the weapons and ammunition he used.\n\nAt least two people were shot dead in the eastern German city of Halle, with a synagogue among the targets\n\nIn the video, he was seen trying to force open the synagogue door before shooting dead a female passer-by. He then tried unsuccessfully to blast open the gate of the Jewish cemetery with explosives.\n\nThe man was later seen shooting at a patron of a kebab shop about 600 metres (yards) away from the synagogue.\n\nJewish community leader Max Privorotzki, who was in the Halle synagogue, told the Stuttgarter Zeitung of the harrowing minutes as the site came under assault.\n\n\"We saw through the camera of our synagogue that a heavily armed perpetrator wearing a steel helmet and rifle was trying to shoot open our door.\"\n\nBetween 70 and 80 people were in the synagogue then, Privorotzki said.\n\n\"We barricaded our doors from inside and waited for the police,\" he said, adding that \"in between, we carried on with our service.\"\n\nPolice captured the suspect after a gun battle that left him injured\n\nAmong those in the synagogue were 10 Americans, as well as several Israelis, who had turned up in Halle especially to join the small local population in celebrating Yom Kippur.\n\n\"We've made it out with our lives, in health and amazing spirits,\" wrote Rebecca Blady, a Jewish American community leader, who was in the synagogue.\n\nThe owner of the kebab shop, Rifat Tekin, meanwhile described the gunman as \"calm like a professional\".\n\n\"Maybe he has done this many times. Like me making a kebab, he's doing this -- like a professional.\"\n\n- 'Like a professional' -\n\nAnti-terrorist prosecutors confirmed that they were taking over the probe given \"the particular importance of the case\" which involved \"violent acts that affect the domestic security of the Federal Republic of Germany\".\n\nWednesday's shootings came three months after the shocking assassination-style murder of local pro-migrant politician Walter Luebcke in the western city of Kassel, allegedly by a known neo-Nazi.\n\nLuebcke's killing has deeply shaken Germany, raising questions about whether it has failed to take seriously a rising threat from right-wing extremists.\n\nInvestigators have been probing the extent of suspect Stephan Ernst's neo-Nazi ties and whether he had links to the far-right militant cell National Socialist Underground (NSU).\n\nInterior Minister Horst Seehofer last month warned of the rising danger of the militant far right, calling it \"as big a threat as radical Islamism\".", "description": "Jewish leaders demanded action from Germany Thursday to protect the community and face down resurgent right-wing extremism, as a deadly anti-Semitic gun...", "authors": [], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/07/wire-19526164-1570687669-38_636x382.jpg", "published_at": "2019-10-10"}