{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7584919/Tennessee-woman-says-got-staph-infection-left-foot-nail-salon.html", "downloaded_at": "2019-10-18 01:19:07.165841+00:00", "title": "Tennessee woman says she got staph infection on left foot from nail salon", "language": "en", "text": "A Tennessee woman claims she got a bacterial infection in her left foot after getting a pedicure at a nail salon.\n\nChelsea Lloyd, of Murfreesboro, said she visited Vogue Nail Bar on September 16 to get a gel pedicure.\n\nHowever, just four hours later, she said a rash broke out on her left foot. Within two days, large and painful blisters appeared, reported WZTV.\n\nLoyd visited her doctor, who told her she had contracted a staph infection and that she would need antibiotics, foot cream and a steroid shot to treat it.\n\nShe has since racked up nearly $500 in medical bills - only half of which the nail salon says it's willing to pay for.\n\nChelsea Loyd (pictured), of Murfreesboro, Tennessee, says she visited Vogue Nail Bar for a gel pedicure on September 16\n\nFour hours later, a rash broke out on Loyd's left foot, and oozing blisters appeared two days later. Her doctors diagnosed her with bacterial infection, likely staph, which can be life-threatening. Pictured, left and right: Loyd's foot with blisters\n\nStaph infections are caused by staphylococcus bacteria, which are commonly found on the skin and in the nose of healthy people.\n\nIn most cases, the bacteria causes nothing more than a minor skin infection.\n\nHowever, if the bacteria penetrate deeper into the body - such as the bloodstream, joints and bones - the infection can be life-threatening.\n\n'It's not pretty. It's awful,' Loyd told WZTV of her foot, which is still healing.\n\n'Now I have medical bills that I'm now responsible for, for something that happened to me by going to get a pedicure.'\n\nAfter the diagnosis, Loyd said she went to the nail salon and, after she showed staff the blister, the owner wrote her a check for $307 to cover the cost of her pedicure and medical bills.\n\nWZTV reported that the antibiotics Loyd was prescribed caused an allergic reaction, costing another $200.\n\nShe went back to Vogue Nail Bar but the owner said he wouldn't be writing her another check.\n\n'And he said: \"We already paid you\",' Loyd said.\n\nManager Susan Nguyen told the station that management offered to pay the second medical bill if Loyd agreed to sign a liability form that stated this would be the last time she brought a medical bill to them - which she refused to do.\n\nLoyd visited the nail salon after her diagnosis and the manager wrote a $307 check for the cost of her pedicure and her medical bills. Pictured: Loyd with her husband\n\nLoyd suffered an allergic reaction from the antibiotics she was prescribed, costing $200 in medical bills. She asked the nail salon to cover the cost, but management refused. Pictured: Loyd's foot with blisters, left, and her foot after the blisters popped, right\n\nNguyen added that despite Vogue Nail Bar covering the cost of the first medical bill, she insists the infection wasn't contracted at the salon.\n\nLoyd says she's not going to take the matter to small claims court as she originally intended because she can't afford to pay for an attorney.\n\nHowever, she said she wants to share what happened to her with others so they don't contract the same infection.\n\n'I want to bring awareness that they need to have a different standard of cleanliness in their salon,' Loyd told the station\n\n'I think that that's important for them to know that someone got infection, so that way they can take precautions so it doesn't happen to someone else.'\n\nWZTV reported that Vogue Nail Bar was inspected by the Tennessee Department of Commerce and Insurance, on June 19, 2019 and received a score of 95 out of a possible 100.\n\nKevin Walters, spokesman for the TDIC, provided a statement to DailyMail.com that read: 'The Board of Cosmetology currently has an open complaint received on 9/28 alleging that a patron contracted a staph infection during a visit to this location. The results from a new inspection are pending.'", "description": "Chelsea Lloyd, of Murfreesboro, Tennessee, claims she contracted a staph infection on her foot from a visit to Vogue Nail Bar on September 16 that she's had to treat with antibiotics and steroids.", "authors": ["Mary Kekatos Health Reporter For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/18/19849924-0-image-a-37_1571333348324.jpg", "published_at": "2019-10-17"}