{"pub": "businessinsider", "url": "https://businessinsider.com/prime-minister-justin-trudeau-brownface-arabian-nights-themed-party-2001-2019-9", "downloaded_at": "2019-09-19 06:03:51.273765+00:00", "title": "Canadian Prime Minister Justin Trudeau wore brownface and a turban during an 'Arabian Nights' themed party in 2001", "language": "en", "text": "Canadian Prime Minister Justin Trudeau wore brownface and a turban during an \"Arabian Nights\" themed party hosted at a private school where he taught in 2001, TIME uncovered from a 2000-2001 yearbook.\n\nThe prime minister, then 29, was photographed dressed as Aladdin for the 2001 themed gala held at West Point Grey Academy, a private day school, according to Zita Astravas, a spokeswoman of the Liberal Party of Canada confirmed to TIME that he was in the photo. Trudeau is the head of the Liberal Party of Canada.\n\n\"It was a photo taken while he was teaching in Vancouver, at the school's annual dinner which had a costume theme of 'Arabian Nights,'\" Astravas told TIME. \"He attended with friends and colleagues dressed as a character from Aladdin.\"\n\nRead more: Canadian Prime Minister Justin Trudeau is facing his first major scandal since taking office\n\nBusinessman Michael Adamson shared a copy of the West Point Grey Academy yearbook, titled \"The View,\" with TIME. He saw the photograph back in July and thought it should be made public. Adamson told TIME that he did not attend the party himself.\n\nWhen asked by a reporter during a media conference on Wednesday if he thought the photo was racist, Trudeau simply replied, \"Yes.\" He acknowledged how he did not think that it was racist at the time, but he said he now knows better. He admits that he made a mistake and asked Canadians for forgiveness.\n\nThe controversial photo surfaced a week after Trudeau embarked on his re-election campaign. His campaign has been clouded by public accusations that he interfered with a corruption investigation into a Canadian engineering firm, one of the first major scandals of his political career.\n\nDespite being deemed an internet favorite due to his charm and charisma, Trudeau has received a fair share of criticism in the past. During a visit to India in 2018, the Trudeau family faced backlash for wearing cultural garb.", "description": "The photo surfaced a week after Trudeau embarked on his re-election campaign. He has also been accused of having a role in a corruption investigation.", "authors": ["Lauren Frias"], "top_image": "https://amp.businessinsider.com/images/59308d9ab74af4bc158b5bdc-1920-960.jpg", "published_at": "2019-09-18"}