{"pub": "huffpost", "title": "Arizona Republic Editor Warns Staff To 'Carefully Consider The Consequences' Of Unionizing", "url": "https://huffpost.com/entry/arizona-republic-editor-staff-consequences-union-surveillance_n_5d6965dee4b09bbc9eee89b7", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:08:42.761890+00:00", "text": "Subject: Surveillance of your coworkers\n\nAll: It has come to my attention that several employees, in pursuit of their goal of unionizing our newsroom, are tracking the comings and goings of a number of their co-workers (reporters, editors, producers and photographers) who do not support unionization.\n\nThis is an affront to our newsroom. It’s the antithesis of courage in the pursuit of journalism. It undermines relationships we’ve nurtured. It’s an attack on our flexible workplace, where we have freely permitted the adjustment of employee schedules to meet their needs – for a child at school or a spouse who is home sick, a parent who requires help or a medical appointment.\n\nWe have been told that one union supporter threatened that things will get “even messier” in the weeks to come. If organized surveillance and spying are already occurring in the face of a divisive unionization effort, I hope you carefully consider the consequences of bringing the Guild into our workplace.\n\nLet me tell you about surveillance at my home because I refused to kill a story about police shootings in California. A former detective who had shot two people – including an innocent bystander – got into my house, turned on a video camera and made a recording of my dining room, my front door, my living room and my son, then 17, who didn’t know enough to turn him away.\n\nI reference this incident to underscore the fact that journalists are targets of political haymakers and troublemakers, of operatives and would-be intimidators, of crackpots and criminals. We are targets on social media. We are targets when we stand firm on a story that unmasks a murderer running for office, a teacher who molests children, an appointee who bulldozes indigenous artifacts or stockpiles weapons, a mobster who doesn’t much like being called a scam artist or a dirty trickster intent on DOXing a critic.\n\nThese are the types who surveil journalists.\n\nJournalists don’t surveil other journalists.\n\nColleagues who have produced award-winning work together as a team do not surveil one another.\n\nStanding together to fight on behalf of the public is a surmountable task for the very reason that our newsroom is a sanctified space. It’s a place where we defend one another, where a supervisor can flex a reporter’s schedule – because they know and trust each other.\n\nLet me make this clear: surveillance activities or any type of harassment or intimidation of employees in this newsroom will not be tolerated to any degree. Any such conduct will be addressed through disciplinary channels. I expect every employee to conduct herself or himself and treat co-workers and managers with respect and professionalism.\n\nIf you have any questions or concerns or want to discuss this, please reach out to me and/or Amber Anderson in HR.\n\nGB\n\nGreg Burton\n\nExecutive Editor/West Regional Editor", "description": "Greg Burton accused union sympathizers of \"surveilling\" other journalists, saying that's something he'd expect of a murderer or child molester.", "authors": ["Labor Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d6966972500003200751fe9.jpeg?ops=1778_1000"}