{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/twitch-watch-parties-let-me-stream-movies-to-the-viewers-i-dont-have", "downloaded_at": "2019-10-21 08:54:59.611546+00:00", "title": "Twitch \"Watch Parties\" Let Me Stream Movies To The Viewers I Don't Have", "language": "en", "text": "Photo: Marco Verch, Flickr\n\nEver since Amazon bought Twitch for a cool $1.42 billion back in 2014, it seemed inevitable that eventually its catalogue of movies and shows would make their way onto the streaming platform for live viewing get-togethers. It may have taken a hot minute, but Twitch finally began testing a “Watch Parties” feature this week, albeit among a few select streamers.\n\nTwitch streamers like Brandon Nance and Travis Shreffler tweeted screenshots Thursday of emails inviting them to try out the new feature. Now, Twitch has organised events for viewers to binge flicks like Star Wars or Disney movies together in the past, but they were exclusively hosted through the company’s official channel, Twitch Presents. According to these invitations, streamers will be able to host selections from Amazon Prime Video’s library directly on their channels so they can watch and chat with their viewers.\n\nThe amount of times I've ptched this to twitch is... unfathomable. We're here. Finally. IM SO EXCITED. pic.twitter.com/4MtvGcHCXK — Brandon? (@juiceDiem) October 19, 2019\n\nTwitch is testing out Watch Parties, which allows streamers to stream Amazon Prime Video content that will be viewable only to viewers who have Amazon Prime This email is going out to select streamers now. What do you think? pic.twitter.com/uaKYmu1MnU — Travis Shreffler (@TravisShreffler) October 18, 2019\n\nSo long as those viewers have Twitch Prime, that is. While streaming and watching most content on Twitch is free, users who link their Amazon Prime and Twitch accounts get access to perks like a free channel subscription every month or exclusive emotes. And now, it seems, a seat in its online movie theatre.\n\nOnly a small portion of Prime Video’s full collection of movies and shows are currently available, the invitation continues, such as Tom Clancy’s Jack Ryan series, Mission: Impossible - Fallout, and Pokémon (which I’m hoping means both the franchise’s movies and shows, but it doesn’t specify. Just... Pokémon).\n\nThe company plans to add more offerings eventually, and I’m sure Amazon is chomping at the bit to include some of its original series like Good Omens and The Marvellous Mrs. Maisel among them. Though Prime’s library also has plenty of popular bread-and-butter exclusives too. For example, my mum’s never watched a minute of Twitch in her life, but if channels started hosting Downton Abbey marathons, hell she’d be spamming “F” in chat with the best of them.\n\nNo word yet on when “Watch Parties” will roll out to the masses, though we’ve asked Twitch as much and will update this article with their response. However, you can let Twitch know what Prime Video titles you’d like to see added to the list by emailing [email protected]\n\nWith other rapidly growing platforms like Mixer and Facebook Gaming finally making a dent in Twitch’s stronghold on the streaming industry, Amazon’s smart to fold in as many exclusive features as it can while Twitch continues to outmatch its competitors in cultural clout. Though I’d hate to see what kind of movies our dear president, who joined Twitch earlier this month, might choose to stream. My money’s on The Birth of a Nation.", "description": "Ever since Amazon bought Twitch for a cool $1.42 billion back in 2014, it seemed inevitable that eventually its catalogue of movies and shows would make their way onto the streaming platform for live viewing get-togethers. It may have taken a hot minute, but Twitch finally began testing a “Watch Parties” feature...", "authors": ["Tegan Jones", "Julie Muncy"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/vljkbcbl0l9yvesthaxr.jpg", "published_at": "2019-10-21"}