{"pub": "yahoo", "url": "https://news.yahoo.com/groom-charged-sexually-assaulting-bridesmaid-171713752.html", "downloaded_at": "2019-10-07 20:23:52.830566+00:00", "title": "Groom charged with sexually assaulting bridesmaid two days before wedding", "language": "en", "text": "A Pennsylvania man was charged with sexually assaulting a bridesmaid two days before he got married last month.\n\nDaniel J. Carney, 28, was charged with one felony count of involuntary deviate sexual intercourse with an unconscious person, one misdemeanor count of simple assault and another misdemeanor of indecent assault without consent of other, according to court records.\n\nPennsylvania state police said that on Sept. 2, they began investigating a sexual assault at the Shawnee Inn and Golf Resort in Monroe County, Pennsylvania, three days earlier. Carney is accused of assaulting a 29-year-old Oregon woman, who was in town for his wedding, in the men's locker room of the inn.\n\nRelated Video: AP Top Stories\n\nThe woman, who was a bridesmaid in the wedding, told police that after a day of drinking and paddle boarding with Carney's wedding party, she returned to the hotel Aug. 30, according to a criminal complaint obtained by news outlet the Morning Call.\n\nGroom-to-be allegedly robs bank: Texas man robbed bank day before wedding to pay for ring, venue, sheriff says\n\nShe recalled being heavily intoxicated and waking up in the locker room with Carney on top of her and her bikini bottoms pulled off, the complaint says. She told police the bride-to-be walked into the locker room and yelled at Carney while another bridesmaid helped her leave the shower.\n\nCarney allegedly called to apologize the next morning. He texted the woman on the day of wedding, asking her to take the morning after pill to prevent a pregnancy and to \"be as happy as possible\" for the bride, according to records obtained by The Washington Post.\n\nFriends of the couple told WNEP-TV that the wedding occurred as planned.\n\nThe day after the wedding, the woman went to a hospital to report that she had been sexually assaulted, according to the Post. Carney initially told police he was very drunk and felt the bridesmaid had \"taken advantage\" of him, but surveillance footage shows him pulling the woman into the locker room, according to the police report.\n\nPolice got permission from the district attorney's office to listen in on a phone call between Carney and the woman during which he apologized and confessed to assaulting her, the Morning Call reported. When police interviewed him later that day, Carney allegedly admitted leading the woman into the locker room.\n\n\n\n\n\nThis article originally appeared on USA TODAY: Pennsylvania man sexually assaulted bridesmaid before wedding, police say\n\n\n\n", "description": "A Pennsylvania man was charged with sexually assaulting a bridesmaid at a Monroe County resort two days before getting married.", "authors": ["N'Dea Yancey-Bragg", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/z1TcvSjf1EtA8oR63CVhUQ--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/1009217/b7668b42-fc43-49d7-bb8b-65e035814415/dee0bdfd-745f-5349-bed0-9075d50c5226/data_3_0.jpg?s=f231dc04c7ec8fe49a4e001df387a01a&c=95548f5f55a5eb208ec65b72e1de3e9d&a=tripleplay4us&mr=0", "published_at": "2019-10-07"}