{"pub": "yahoo", "url": "https://finance.yahoo.com/news/gm-ceo-barra-takes-hand-191424636.html", "downloaded_at": "2019-10-11 08:15:27.511479+00:00", "title": "GM, UAW clash over how to reach deal to end lengthy strike", "language": "en", "text": "FILE PHOTO: General Motors Chief Executive Officer Mary Barra announces a major investment focused on the development of GM future technologies at the GM Orion Assembly Plant in Lake Orion,\n\nBy David Shepardson and Ben Klayman\n\nWASHINGTON/DETROIT (Reuters) - General Motors <GM.N> and the United Auto Workers (UAW) union clashed late Thursday over how to end a 25-day strike that has cost the company over $1 billion, according to letters seen by Reuters.\n\nGM urged the UAW to agree to around-the-clock negotiations to try reach a deal, while the union insisted on dealing with five specific issues first before it responded to a broader proposal from the company.\n\nThe UAW began strike action on Sept. 16, with the union's 48,000 members seeking higher pay, greater job security, a bigger share of the automaker's profit and protection of healthcare benefits.\n\nApart from costing GM more than $1 billion, the work stoppage has forced it to idle U.S. operations along with nearly 10,000 workers in Canada and Mexico.\n\nA day after senior union officials met with GM Chief Executive Mary Barra for the first time, the company late Thursday evening sent a letter expressing its frustration with the union's lack of response to an offer it made on Monday.\n\nDetails of that offer have not been made public. GM said the day before the strike began that it had offered to make $7 billion in new U.S. investments in eight facilities in four states, but did not specify timing, location or products with the exception of a planned electric truck. Since then, it has offered additional concessions, but has not disclosed any details.\n\n\"As we have urged repeatedly, we should engage in bargaining over all issues around-the-clock to get an agreement,\" Scott Sandefur, GM vice president of North American labor relations, wrote in the letter sent to the UAW.\n\n\"Your members and our employees lives are being disrupted and they deserve our commitment to getting any remaining issues resolved as quickly as possible,\" Sandefur added. \"We object to having bargining placed on hold pending a resolution of these five areas.\"\n\nUAW Vice President Terry Dittes, who heads the union's GM department, said in a letter earlier on Thursday evening to GM that the union would not reply to GM's latest proposal until committees discussing five specific issues had completed their work.\n\nThose committees are discussing issues including the fate of four U.S. factories that GM has indicated could close, cutting 15,000 jobs in North America, and future technological changes to production.\n\nDittes said he did not know when the five issues would be resolved, suggesting a final deal may not be close.\n\nUAW workers are concerned that as GM shifts to more electric vehicles it will require fewer workers, and battery production may result in workers getting paid less than at existing transmission plants.\n\nReuters previously reported GM told the UAW it could build a new battery plant near the now-shuttered Lordstown, Ohio, factory, and build the electric truck at its Detroit Hamtramck plant.\n\nU.S. President Donald Trump and many lawmakers have also waded in, urging GM to build more vehicles in the United States and shift work from Mexico. The UAW's membership is largely in the Midwest, in states that could be critical to both sides in the 2020 presidential election.\n\nGM declined to comment on the talks between Barra, Dittes and UAW President at GM's headquarters on Wednesday. The UAW said both sides continued to meet at all levels.\n\nBarra's goal was to get the talks moving again, sources briefed on the matter said. UAW officials had previously urged Barra to involve herself in the negotiations.\n\nOn Sunday, the UAW said the talks took a \"turn for the worse\" and on Tuesday urged GM to boost U.S. vehicle production. GM's production of trucks and sport-utility vehicles in Mexico has drawn anger among union workers.\n\nGM shares closed up 1.5% in Thursday trading.\n\n\n\n\n\n(Reporting by David Shepardson in Washington and Ben Klayman in Detroit; Editing by Nick Zieminski and Jane Wardell)", "description": "WASHINGTON/DETROIT (Reuters) - General Motors  and the United Auto Workers (UAW) union clashed late Thursday over how to end a 25-day strike that has cost the company over $1 billion, according to letters seen by Reuters.  GM urged the UAW to agree to around-the-clock negotiations to try reach a deal", "authors": ["David Shepardson", "Ben Klayman"], "top_image": "https://s.yimg.com/uu/api/res/1.2/npGWEj6nIlqp8EbXlaOYlA--~B/aD0zMTI7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/reuters.com/2cf8a7d72b95ab7a125cc29bc2b4e8fd", "published_at": "2019-10-10"}