{"pub": "foxnews", "url": "https://foxnews.com/entertainment/former-reality-star-joe-giudice-in-ice-custody-training-to-be-mma-fighter-report", "downloaded_at": "2019-09-19 06:01:09.457164+00:00", "title": "Joe Giudice, convicted reality star in ICE custody, training to be MMA fighter: report", "language": "en", "text": "Former “Real Housewives of New Jersey” star Joe Giudice apparently decided to make the most of his time behind bars after being convicted of tax fraud in 2014.\n\nGiudice – the 47-year-old husband of Teresa Giudice – spent a lot of time working out and now plans to become a mixed martial arts fighter if a judge OKs his release from ICE custody, according to a report.\n\nHe’s now at 165 pounds after entering prison at 215 pounds, the New York Post reported.\n\nJON GOSSELIN ALLEGES EX-WIFE KATE MENTALLY ABUSED THEIR SON, 'SENT HIM AWAY' TO SPECIAL NEEDS INSTITUTION\n\n“According to him, he’s been doing a lot of the exercises and a lot of the routines that he learned when he got his black belt,” a source told the newspaper. “He’s been eating right, exercising, staying in shape, getting his body right and he feels like, as far as his condition, he feels stronger than he did when he was in his 20s.”\n\n“He’s been eating right, exercising, staying in shape, ... he feels stronger than he did when he was in his 20s.” — Source speaking about Joe Giudice\n\nWhile Giudice was in prison, a judge ruled that he should be deported to his native Italy, but Giudice appealed the ruling so he remains in the custody of U.S. Immigration and Customs Enforcement until his case is finalized, the Post reported.\n\nBoth Giudice and his wife were convicted of using $5 million in fraudulent mortgage and construction loans to finance their lifestyle. While Joe Giudice was sentenced to 41 months, Teresa Giudice received a 15-month sentence, according to the New York Daily News.\n\nIn April, daughter Milania Giudice, 14, made a pitch to President Trump on Instragram to try to halt her father's deportation.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nTeresa Giudice has also taken up bodybuilding in recent years, according to the Post.\n\nThe couple have four children. They appeared on “The Real Housewives of New Jersey” beginning in 2009. They later starred on the spinoff series “Teresa Checks In.”", "description": "Former “Real Housewives of New Jersey” star Joe Giudice apparently decided to make the most of his time behind bars after being convicted of tax fraud in 2014.", "authors": ["Dom Calicchio", "Source Speaking About Joe Giudice"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/03/14/694940094001_6013921054001_6013909848001-vs.jpg", "published_at": "2019-09-19"}