{"pub": "independent", "title": "Netanyahu calls for boycott of ‘antisemitic’ HBO series for depicting brutal murder of Palestinian", "url": "https://independent.co.uk/news/world/middle-east/netanyahu-boycott-series-palestinian-muder-antisemitic-hbo-our-boys-a9088506.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:09:37.705785+00:00", "text": "Benjamin Netanyahu is calling for Israelis to boycott one of his country’s most popular television channels for producing what he has termed an “antisemitic” TV series.\n\nThe Israeli prime minister made the call in a Facebook post late on Friday, hours after a bid to stop the station, Channel 12, from airing leaked material associated with the criminal investigations into his alleged wrongdoings.\n\nMr Netanyahu is facing an indictment pending a hearing in three criminal cases that centre on fraud, bribery and breach of trust. He is also in the midst of a re-election campaign, fighting to maintain a tenuous lead in the polls as Israelis head to their second general election September 17.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nChannel 12’s owner, Keshet, is the same company that has co-produced an HBO series called Our Boys, the first show entirely in Hebrew and Arabic to air on the cable network.\n\nThe 10-part series, which began 12 August, focuses on the kidnapping and murder of a Palestinian teenager, Muhammad Abu Khdeir, by three Jewish extremists in the summer of 2014.\n\nThree Israeli teenagers were also kidnapped and murdered that summer by members of a cell belonging to the militant Islamist group Hamas.\n\nThe discovery of the bodies of Naftali Fraenkel, 16, Gilad Shaar, 16, and Eyal Yifrach, 19, in a field near the Palestinian city of Hebron after an intensive two-and-a-half week search was the impetus for Abu Khdeir’s murder.\n\nThe show’s Israeli creators – Hagai Levi, Joseph Cedar and Tewfiq Abu Wael – have already received online death threats from right-wing Israelis.\n\n“The propaganda Channel 12 has produced an antisemitic series called Our Boys, that is distributed internationally and besmirches the good name of Israel,” Mr Netanyahu wrote on Facebook, posting Channel 12’s logo and a banner reading “Fake News”.\n\n“I am not surprised that Channel 12 slanders Israel, I am used to them blackmailing me on a daily basis,” he wrote.\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nThroughout this week, Channel 12’s legal reporter, Guy Peleg, has aired excerpts from one of the graft cases against Mr Netanyahu.\n\nTestimony from a former official turned state’s witness, according to Mr Peleg, alleges the prime minister intervened in Communications Ministry regulatory decisions that financially benefited one of his tycoon friends.\n\nIn a letter to the Central Election’s Committee, Mr Netanyahu’s ruling Likud party requested to bar news outlets from further publishing leaked material relating to the investigations ahead of next month’s elections. Their request was rejected on Friday.\n\nA statement from the Likud party earlier in the week had called Mr Peleg’s reports “a false blood libel” and the state witness account “lies”.\n\nOn Friday, local media said increasing personal attacks against Mr Peleg, including by the prime minister’s own son, Yair, had prompted the journalist to hire a bodyguard.\n\nIn his Facebook call to boycott Our Boys, Mr Netanyahu said he had been approached by a group of Israeli families whose loved ones were killed in Palestinians terrorist attacks who found the show objectionable.\n\nHe said they pointed out that “Israel has worked with determination to apprehend and punish Abu Khdeir’s murderers. In contrast, the Palestinian Authority rewards and glorifies Jewish murderers”.\n\n“Since the series aired last month, many of you have contacted me and asked what could be done. I have made my recommendation clear: Do not watch Keshet or its shows,” Mr Netanyahu wrote.\n\n“This is the real answer in democracy, freedom of choice to watch and freedom of choice not to watch.”\n\nThere was no immediate comment from HBO or Channel 12.\n\nIn a recent interview with The Washington Post, Hagai Levi, who with Cedar and Abu Wael wrote, directed and produced Our Boys, said he expected a backlash from right-wing Israelis upset an Arab victim was spotlighted over a Jewish one.\n\n“For me, I already knew about Arab terror, but the murder of Muhammad Abu Khdeir created more questions than answers. I just couldn’t believe that Jews could do this, and I wanted to know why they did,” said Mr Levi.\n\nThe Washington Post", "description": "Benjamin Netanyahu is calling for Israelis to boycott one of his country’s most popular television channels for producing what he has termed an “antisemitic” TV series.", "authors": ["Ruth Eglash"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/02/12/Benjamin-Netanyahu.jpg"}