{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/one-switch-lite-user-is-already-having-joycon-drift-issues", "downloaded_at": "2019-09-24 00:56:51.684254+00:00", "title": "One Switch Lite User Is Already Having JoyCon Drift Issues", "language": "en", "text": "GIF: Youtube (Alexis Javier)\n\nThe Switch might be the most beloved console of today, but it's got one major flaw: the reliability of the JoyCons. It was the biggest concern hovering around the launch of the Switch Lite, and only a week after the console has landed in gamers' hands, it looks like the dreaded drift is back.\n\nA question hovering around the Switch Lite has been whether its JoyCons would suffer from a similar problem, which is obviously a huge concern since you can't swap out the JoyCons for fresh ones. And a new video shared by Alexis Javier on YouTube showcases the dreaded problem in Breath of the Wild. After nudging the right stick to rotate the camera around, the camera keeps panning slowly, an all-too-obvious indication of the same problem that has sent Switch owners around the bend.\n\nWith the original JoyCons, users could at least rely on some DIY remedies by taking apart the JoyCon and using some contact cleaner. That's not an option with the Switch Lite, even though Spawn Wave found the whole rear of the Lite's chassis could be removed and accessed a little more cleanly than the original. (That's not to say it's impossible, but it's a lot easier when the JoyCons can be detached from the entire console.)\n\nIt's not the only issue that has cropped up with the Switch Lite. Fighting game fans have raised issues with the design of the D-pad. Because the internal contacts of the Switch Lite uses the same layout for the D-Pad as the original Switch, the distance between the contacts makes it difficult for moves where you roll from one directional input to the other (like in Mortal Kombat or Street Fighter).\n\nImage: Spawn Wave (YouTube)\n\nNintendo's standard warranty agreement says they'll cover any manufacturing faults or defects within 12 months, with all repairs turned around within 10 working days.\n\nWe'll have to wait and see if more user reports come in about JoyCon drift with the new console. Fingers crossed it doesn't — it's the worst possible scenario, especially if you just forked out around $300 or more to grab a console that could potentially suffer from the same problem as the Switch you already owned.", "description": "The Switch might be the most beloved console of today, but it's got one major flaw: the reliability of the JoyCons. It was the biggest concern hovering around the launch of the Switch Lite, and only a week after the console has landed in gamers' hands, it looks like the dreaded drift is back....", "authors": ["Stephen Totilo", "Mike Fahey"], "top_image": "https://edge.alluremedia.com.au/m/k/2019/09/switch-lite-joycon-drift.gif", "published_at": "2019-09-24"}