{"pub": "axios", "url": "https://axios.com/twitter-suspends-carpe-donktum-pro-trump-ac61245a-0aa5-41e2-b032-2623fe1715c8.html", "downloaded_at": "2019-10-14 23:24:07.627606+00:00", "title": "Pro-Trump meme maker “Carpe Donktum\" suspended by Twitter", "language": "en", "text": "After his account was reactivated, Carpe Donktum said in a Persicope video that Twitter banned his account due to copyright infringement of a Super Bowl commercial from February 2018. He claims he has never reposted videos he has previously complied to take down.\n\nThe big picture: Carpe Donktum's video is an example of how the movements of online trolls and meme-makers who support Trump have \"reshaped mainstream politics and the media,\" the Washington Post reports.\n\nPresident Trump's accusation that tech companies are biased against conservatives is one of the hottest subjects among the Republican Party’s online base this year.\n\nMore than a year ago, Twitter CEO Jack Dorsey was pressed by Republicans in Congress and ridiculed by Trump over allegations of anti-conservative bias.\n\nBackground: The violent parody, which the White House condemns, aired during a conference at President Trump’s Miami-area golf resort.\n\nOn Monday before the account was suspended, Carpe Donktum stood by the meme video in a statement and blamed the original New York Times report for sensationalizing a parody.\n\nThe Washington Post reported Monday that the video's creator is TheGeekzTeam, which often contributes to MemeWorld, owned by Carpe Donktum.\n\n\"The Kingsman video is CLEARLY satirical and the violence depicted is metaphoric. No reasonable person would believe that this video was a call to action, or an endorsement of violence towards the media. The only person that could potentially be “incited” by this video is Donald Trump himself, as the main character of the video is him. THERE IS NO CALL TO ACTION.\"\n\n— From Carpe Donktum", "description": "The video, and others similar, sparked a movement among online trolls.", "authors": [], "top_image": "https://images.axios.com/xdgu08gT8B28pchyzpVd7BhM-OY=/0x0:1280x720/1920x1080/2019/10/14/1571084423888.png", "published_at": "2019-10-14"}