{"pub": "investingcom", "url": "https://investing.com/news/stock-market-news/us-states-kick-off-antitrust-probe-expected-to-focus-on-google-1973257", "downloaded_at": "2019-09-09 10:32:16.503459+00:00", "title": "U.S. states kick off antitrust probe expected to focus on Google", "language": "en", "text": "By Diane Bartz\n\nWASHINGTON (Reuters) - Texas Attorney General Ken Paxton on Monday will detail a multi-state antitrust probe of potentially anticompetitive practices at major U.S. technology companies, which is expected to focus on Alphabet's Google (NASDAQ: ).\n\nOnce lauded as engines of economic growth, the social media, search and e-commerce giants have sparked anger amid allegations of abusing outsized market power and lapses such as privacy breaches. President Donald Trump, progressive Democratic presidential candidate Elizabeth Warren, consumers and other firms have criticized that power.\n\nPaxton's office said on Friday that he was leading an investigation of large tech companies without naming them and promised a formal launch of the probe with a news conference in Washington, D.C., on Monday afternoon.\n\nThat probe, likely to include more than 40 state attorneys general, is expected to focus on Google, sources familiar with the matter told Reuters. A source previously told Reuters the Google investigation would look at the intersection of privacy and antitrust.\n\nThe focus during Paxton's news conference will be on learning the identity of the company or companies being investigated, which activities are under scrutiny, and the other states that are joining the investigation.\n\nGoogle has faced accusations that its web search service, which has become so dominant that it is now a verb, leads consumers to its own products at the cost of competitors.\n\nOn the federal level, the Justice Department and Federal Trade Commission are probing Facebook (NASDAQ: ), Google, Apple (NASDAQ: ) and Amazon (NASDAQ: ), also for potential violations of antitrust law. Another states attorney general probe announced on Friday focuses on Facebook.\n\nLate Friday, Google said in a government filing that it had received a civil investigative demand, essentially a subpoena, from the Justice Department on Aug. 30.\n\n\"We expect to receive in the future similar investigative demands from state attorneys general. We continue to cooperate with the (Justice Department), federal and state regulators in the United States, and other regulators around the world,\" the company said in the filing on Friday.", "description": "U.S. states kick off antitrust probe expected to focus on Google", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXNPEF880WF_L.jpg", "published_at": "2019-09-09"}