{"pub": "metro", "url": "https://metro.co.uk/2019/10/21/kanye-west-finally-confirms-jesus-king-release-date-returns-twitter-first-time-nine-months-10953737", "downloaded_at": "2019-10-21 06:42:22.119730+00:00", "title": "Kanye West confirms Jesus Is King release date as he returns to Twitter", "language": "en", "text": "Jesus Is King arrives this week (Picture: Splash, Imax)\n\nKanye West has made a grand return to Twitter to announce the release date for his long-awaited next album, Jesus Is King.\n\nThe Can’t Tell Me Nothing rapper posted a tweet in the early hours of Monday morning to reveal that his anticipated ninth studio album will arrive on Friday (25 October).\n\nAlongside the tweet, Kanye shared the Jesus Is King album artwork and it’s simplicity at its best, featuring an image of a blue vinyl with the album title, Kanye’s name and ‘new songs’ written in gold.\n\nFans are delighted with the announcement after the album was delayed in September followed by radio silence on when it would actually arrive.\n\nIt comes hot on the heels of a promotional weekend for Kanye, 42, who flew over to Jamaica to host a Sunday Service on, well, Saturday.\n\nTo mark his special visit to the Caribbean island, Kanye had launched new Jamaican-inspired merchandise on his official online store featuring the country’s flag and seal.\n\nAdvertisement\n\nAdvertisement\n\nHowever, it emerged that the rapper may not have asked for permission to sell the merch.\n\nJamaica’s minister of culture, gender, entertainment and sport, Honorable Olivia ‘Babsy’ Grange said in a statement: ‘It has come to my attention that items of clothing printed with national symbols and emblems are being offered for sale online.\n\n‘I noticed Kanye West and members of his choir wearing similarly emblazoned items during their special performance in Kingston last night, but I was not aware at the time that the costumes were being sold online.\n\n‘We neither received a request for nor did we give permission for our national symbols and emblems to be used for a commercial manner or otherwise. I have since requested that the items be withdrawn and the vendor has agreed to do so.’\n\nThis Friday, fans can also expect the release of the Jesus Is King documentary, which is expected to feature Sunday Service performances and a behind-the-scenes look at the making of the album.\n\nKanye recently revealed his plans to only record gospel music going forward, so it’s possible his rap career may be a thing of the past.\n\nKanye West’s new album, Jesus Is King, is out on Friday (25 October).\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Kanye West blocked from selling Jesus Is King merchandise in Jamaica after ‘using flag without permission’\n\nMORE: Kim Kardashian’s picture of Kanye West asleep with North has melted our hearts", "description": "Kanye West has returned to Twitter to announce the release date for his anticipated ninth album Jesus Is King.", "authors": ["Alicia Adejobi"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_90842471_1571637686.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-21"}