{"pub": "cnbc", "url": "https://cnbc.com/2019/10/21/gold-markets-brexit-in-focus.html", "downloaded_at": "2019-10-21 05:37:13.662879+00:00", "title": "Gold flat as markets look for trade talk cues, Brexit deal", "language": "en", "text": "Canadian maple leafs sit on the faces of one ounce gold coins in London, the United Kingdom, on July 15, 2014.\n\nGold prices were unchanged on Monday, as investors stayed on the sidelines awaiting more clarity on U.S.-China trade negotiations and a delay to a crucial vote on a deal on Britain's exit from the European Union.\n\nSpot gold was flat at $1,489.77 per ounce as of 0428 GMT. U.S. gold futures dipped slightly to $1,493.20.\n\nAsian shares edged higher, limiting bullion's gains, with MSCI's broadest index of Asia-Pacific shares outside Japan up 0.2%.\n\n\"The markets are quite long, and people are worried about the trade war. Investors are waiting for pull backs in gold to step in again,\" AxiTrader market strategist Stephen Innes said.\n\n\"What has been supportive for gold are recessionary fears, and provided that remains in the headlines, it is a significant reason to stay long gold. Right now, there is no major catalyst to drive it any direction.\"\n\nThe long-standing U.S.-China trade war has taken a toll on economies around the world with Japan's exports down for a 10th straight month, and South Korean exports plunging 19.5% over the first 20 days of October.\n\nIn China, new home prices grew at a steady pace in September, a relief for policymakers who remain wary of high debt and bubble risk, and are refraining from stimulating the sector as the economy cools.\n\nProviding little comfort to market sentiment, British Lawmakers on Saturday voted to withhold a decision on Prime Minister Boris Johnson's deal, a move that forced him to seek from the EU a third postponement of Britain's departure from the bloc.\n\nThe vote for an extension dealt a blow to optimism that a deal agreed last week would ensure Brexit happens with little economic disruption.\n\nAmong other precious metals, silver rose 0.1% to $17.56 per ounce, and platinum dipped 0.2% to $887.40.\n\nMeanwhile, palladium gained 0.7% to $1,767.00 an ounce, slightly lower than a high of $1,783.21 it struck on Thursday.\n\n\"Sell rates for palladium reached the highest level since January. This suggests the recent rally has been driven by fundamentals, rather than speculative interest,\" ANZ Bank said in a note.\n\n\"And with the market likely to remain tight for the foreseeable future, we believe there is plenty more upside for (palladium) prices.\"", "description": "Gold prices were unchanged on Monday, as investors stayed on the sidelines awaiting more clarity on U.S.-China trade negotiations and a delay to a crucial vote on a deal on Britain's exit from the European Union.", "authors": [], "top_image": "https://image.cnbcfm.com/api/v1/image/105598733-1543468357889gettyimages-452183766.jpeg?v=1571626153", "published_at": "2019-10-21"}