{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/hoerskool-hendrik-verwoerd-is-no-more-20190823", "downloaded_at": "2019-10-23 10:07:17.892368+00:00", "title": "Hoërskool Hendrik Verwoerd is no more", "language": "en", "text": "The renaming of Hoërskool Hendrik Verwoerd is not about hate, but about the restoration of dignity, Gauteng Education MEC Panyaza Lesufi has said.\n\nLesufi was part of the official unveiling of what is now Rietondale High School in Pretoria on Friday. The school was formerly named after Verwoerd, the architect of apartheid.\n\n\"We don't hate HF Verwoerd, we don't hate the name of this particular school, we are only here to restore and reclaim our dignity,\" Lesufi said.\n\nHe emphasised that no one wanted to have to remember apartheid.\n\nLesufi also hit out at critics who have called him anti-Afrikaans.\n\n\"We are not here to hate anyone, we are not here to destroy any language, we are not here to embarrass any culture. We are here to build an all inclusive South Africa that can make our children proud.\"\n\nLesufi said he did not hate Afrikaans or mother-tongue education, but that he was anti-discrimination.\n\n\"There will be no school for a single grouping or single tribe alone, at the expense of other groupings or languages.\n\n\"At one school, you can have children doing Afrikaans, other children doing English, other children doing Sepedi or isiZulu, and they can be part of one cricket or rugby team that represents that school.\"\n\nLesufi said there must be no misinterpretation that people's cultures were being destroyed by name changes, adding that the building of a non-racial South Africa had to be inclusive of everyone.\n\n\"We are better off together, rather than divided. We will acknowledge the past, but we will take each other’s hands and take the South Africa we love forward.\"\n\nThe process to change the school's name began in 2016 and the name Rietondale High School was chosen by school parents.\n\nGET THE NEWS at your fingertips and download the News24 app for Android here now. Get it for your iPhone here.\n\nKEEP UPDATED on the latest news by subscribing to our FREE newsletter.\n\n- FOLLOW News24 on Twitter", "description": "The renaming of Hoërskool Hendrik Verwoerd in Pretoria is not about hate, but about the restoration of dignity, Gauteng Education MEC Panyaza Lesufi has said at the official unveiling of what is now Rietondale High School.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/3803/a9b2980d4e3f4edca066f147a71e1ec8.jpg", "published_at": "2019-08-23"}