{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/repeat-halo-labs-announces-closing-of-second-tranche-for-completion-of-aggregate-cad-4-million-private-placement", "downloaded_at": "2019-10-17 11:59:37.469384+00:00", "title": "REPEAT/Halo Labs Announces Closing of Second Tranche For Completion Of Aggregate CAD $4 Million Private Placement", "language": "en", "text": "Not for Distribution to U.S. Newswire Servicers or For Dissemination in the United States\n\nTORONTO — Halo Labs Inc. (“Halo” or the “Company“) (NEO: HALO, OTCQX: AGEEF, Germany: A9KN) is pleased to announce that, further to the Company’s press releases of October 7, 2019 and October 11, 2019, Halo has closed a second tranche of the previously announced non-brokered increased private placement of Halo common shares (the “Offering”) at a price of CAD $0.31 per share for additional gross proceeds of approximately CAD $1 million (the “Second Tranche”). The Company previously closed a first tranche of the Offering for gross proceeds of CAD $3 million. The Company is also increasing the size of the Offering by an additional CAD $1 million for new investors.\n\nThe Second Tranche\n\nIn connection with the Second Tranche, Halo issued an aggregate of 3,115,622 common shares at a price of CAD $0.31 per share for aggregate gross proceeds of CAD $965,842.82. The Halo common shares issued in connection with the Second Tranche are subject to a four month and one day statutory hold period pursuant to applicable securities laws. None of the subscribers in the Offering were related-parties to the Company.\n\nAs previously announced by the Company, Halo intends to use the proceeds of the Offering to complete the development and deployment of Dispensary Track and continue its expansion efforts in California, including the increase of its direct sales force and product offerings and the growth of its manufacturing capacity in Cathedral City.\n\nABOUT HALO\n\nHalo is a cannabis extraction company that develops and manufactures quality cannabis oils and concentrates, which are the fastest growing segments in the cannabis industry. Halo is a global leader in cannabis oil and concentrates, having produced over 4.5 million grams of oils and concentrates since inception. The Company has expertise across all major cannabis manufacturing processes, leveraging a variety of proprietary processes and products. The forward-thinking company is led by a strong management team with deep industry knowledge and blue-chip experience. The Company is currently operating in California and Oregon, as well as in Nevada with our partner Just Quality, LLC, and in Lesotho with the Bophelo strategic partnership. With a consumer-centric focus, Halo will continue to market innovative, branded, and private label products across multiple product categories. Halo recently acquired Dispensary Track platform which will alleviate customer flow constraints experienced by dispensaries and enable direct consumer interaction.\n\nCautionary Note Regarding Forward-Looking Information and Statements\n\nThis press release contains certain “forward-looking information” within the meaning of applicable Canadian securities legislation and may also contain statements that may constitute “forward-looking statements” within the meaning of the safe harbor provisions of the United States Private Securities Litigation Reform Act of 1995. Such forward-looking information and forward-looking statements are not representative of historical facts or information or current condition, but instead represent only Halo’s beliefs regarding future events, plans or objectives, many of which, by their nature, are inherently uncertain and outside of Halo’s control. Generally, such forward-looking information or forward-looking statements can be identified by the use of forward-looking terminology such as “plans”, “expects” or “does not expect”, “is expected”, “budget”, “scheduled”, “estimates”, “forecasts”, “intends”, “anticipates” or “does not anticipate”, or “believes”, or variations of such words and phrases or may contain statements that certain actions, events or results “may”, “could”, “would”, “might” or “will be taken”, “will continue”, “will occur” or “will be achieved”. The forward-looking information and forward-looking statements contained herein include, but is not limited to, statements made in relation to the use of proceeds of the private placement.\n\nBy identifying such information and statements in this manner, Halo is alerting the reader that such information and statements are subject to known and unknown risks, uncertainties and other factors that may cause the actual results, level of activity, performance or achievements of Halo to be materially different from those expressed or implied by such information and statements. In addition, in connection with the forward-looking information and forward-looking statements contained in this press release, Halo has made certain assumptions.\n\nAmong others, the key factors that could cause actual results to differ materially from those projected in the forward-looking information and statements are the following: unexpected delays or expenses in connection with Halo’s operations, adverse changes to the CBD market, adverse changes in applicable laws; changes in general economic, business and political conditions, including changes in the financial markets and the other any other risks not disclosed in the AIF disclosed under the heading “Risk Factors” in Halo’s annual information form for its fiscal year ended December 31, 2018. Should one or more of these risks, uncertainties or other factors materialize, or should assumptions underlying the forward-looking information or statements prove incorrect, actual results may vary materially from those described herein as intended, planned, anticipated, believed, estimated or expected.\n\nAlthough Halo believes that the assumptions and factors used in preparing, and the expectations contained in, the forward-looking information and statements are reasonable, undue reliance should not be placed on such information and statements, and no assurance or guarantee can be given that such forward-looking information and statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such information and statements. Key assumptions used herein include, without limitation, that there will be no unexpected delays or costs in connection with the Company’s Cathedral City build out, the Company will be able to identify and negotiate agreements with suitable distribution partners, management’s expectations regarding sales of new products will be realized, the introduction of an ERP system and the securing of raw materials will deliver improved margins, an increased sales force in Nevada that will be able to increase distribution effectively, the Company will not encounter any unexpected costs or delays in the completion of a CBD manufacturing facility, the Company’s intended CBD manufacturing facility will be able to achieve production levels currently estimated by management and the Company will be able to identify a suitable location for a CBD manufacturing facility in the Emerald Triangle. The forward-looking information and forward-looking statements contained in this press release are made as of the date of this press release, and Halo does not undertake to update any forward-looking information and/or forward-looking statements that are contained or referenced herein, except in accordance with applicable securities laws. All subsequent written and oral forward-looking information and statements attributable to Halo or persons acting on its behalf is expressly qualified in its entirety by this notice.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191017005106/en/\n\nContacts\n\nHalo Labs\n\nInvestor Relations\n\ninfo@halocanna.com", "description": "Not for Distribution to U.S. Newswire Servicers or For Dissemination in the United StatesTORONTO — Halo Labs Inc. (“Halo” or the “Company“) (NEO: HALO, OTCQX: AGEEF, Germany: A9KN) is pleased to announce that, further to the Company’s press releases of October 7,...", "authors": [], "top_image": "https://mms.businesswire.com/media/20191017005106/en/710810/3/Halo_Logo_Zoom_-_Business_Wire_PR.jpg", "published_at": "2019-10-17"}