{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/livongo-lands-biggest-contract-yet-2019-10", "downloaded_at": "2019-10-08 15:01:44.305731+00:00", "title": "Livongo announced its largest contract yet with a 5 million-member Federal Employees Health Benefits Program", "language": "en", "text": "This story was delivered to Business Insider Intelligence Digital Health Pro subscribers earlier this morning.\n\nTo get this story plus others to your inbox each day, hours before they're published on Business Insider, click here.\n\nNewly public digital chronic disease therapy company Livongo struck a two-year deal to embed its diabetes management platform into the Federal Employees Health Benefits Program (FEHBP) — which CEO Zane Burke lauded as Livongo's \"largest agreement\" to date. Business Insider Intelligence\n\nLaunching at the start of 2020, the tool will be available to 5 million federal employees and their families — and Livongo is optimistic that the partnership will afford it 45,000 new members and a revenue boost of up to $60 million through 2021. That's a significant lift given that Livongo brought in a total of $68 million in revenue in 2018, it reported in its S-1 filing.\n\nLivongo has launched into a period of speedy expansion over the last several months — kicking membership growth efforts into high gear.\n\nLivongo linked up with the CMS in May to incorporate its solutions into a Medicare Advantage (MA) plan serving 2 million seniors. Digging into the MA space was a big win for Livongo since seniors could be prime targets for its chronic disease management products: 80% of seniors live with at least one chronic condition compared with 40% of the US' general population, per the National Health Council. And since chronic diseases vacuum up 90% of healthcare spending, payers will continue to look for ways to offset their share of those costs. We'll likely see Livongo ink more tie-ups with MA insurers in the near future.\n\nLivongo's June debut on the public market likely afforded the company a greater amount of consumer and payer mindshare. As one of the first digital health companies to break a three-year IPO dry spell, Burke compared Livongo's IPO with a \"branding event\" that would get its product into more hands in an interview with Fortune. Livongo's diabetes platform — the company's first and most popular offering — boasts 192,000 patients, which represents a sliver of its addressable market: More than 30 million US adults have diabetes, for context. And it's likely that its larger presence post-IPO will have a bigger swath of payer clients flocking to tie up with the company: It tallied 720 clients in Q2 2019 — a 92% year-over-year uptick.\n\nLivongo's flurry of recent activity is representative of a maturing digital therapeutics market — and its recent tie-ups reveal an approach digital therapeutics firms can take to wrangle in business. It makes sense that Livongo's been focusing on going in on big deals, with programs like the FEHBP, since striking deals with large insurers has proven to pay off: Half of Livongo's revenue was made through sales via its five largest partners — three of which were health insurance companies — in 2018.\n\nAnd we've seen other players in the sector zeroing in on selling to insurers as a surefire way to capture a larger chunk of the market and rake in more cash: Diabetes management company DarioHealth saidthat honing its budget in on its enterprise-facing channel — over its direct-to-consumer model — will drive revenue growth.\n\nThe digital therapeutics market is on the road to tripling its valuation from 2018 to reach $9 billion by 2025, and we think that growth will largely be driven by increased payer appetite for products that improve health outcomes and reduce costs. So, it's likely that companies in the space will continue to focus more heavily on big-scale payer partnerships like this.\n\nWant to read more stories like this one? Here's how to get access:", "description": "Livongo struck a deal to embed its diabetes management platform into the Federal Employees Health Benefits Program — its \"largest agreement\" to date.", "authors": ["Zoë Larock"], "top_image": "https://image.businessinsider.com/5d39cf8ba209d3508d7deb0c?width=1200&format=jpeg", "published_at": "2019-10-08"}