{"pub": "cbc", "url": "https://cbc.ca/radio/day6/how-a-toronto-rock-festival-led-john-lennon-to-his-first-solo-performance-and-away-from-the-beatles-1.5281112", "downloaded_at": "2019-09-15 00:15:00.267897+00:00", "title": "CBC Radio", "language": "en", "text": "It was September 1969, days before the Toronto Rock and Roll Revival Festival was supposed to start, and concert producer John Brower was in trouble.\n\nThe festival featured stars such as Chuck Berry, Little Richard and Jerry Lee Lewis, but tickets weren't selling. Brower's financial backers were threatening to pull out and cancel the show.\n\nSo his colleague told him to call John Lennon.\n\nIt \"sounded like a Hail Mary,\" Brower told Day 6. \"Which it was.\"\n\n\"It was bold. Nobody thought it would work,\" said Piers Hemmingsen, historian and author of The Beatles in Canada.\n\nBut it did.\n\nConcert producer John Brower, who had produced several other concerts that summer, was in trouble days before his Rock and Roll Revival Festival was supposed to start in September 1969. (CBC News/CBC Archives)\n\n'John Lennon was on the phone'\n\nBrower's strategy was simple — call up the headquarters of The Beatles' record label in London, U.K, tell the receptionist who was playing at the festival and invite Lennon and Yoko Ono to MC.\n\n\"The next thing I knew, John Lennon was on the phone,\" said Brower.\n\nHe says Lennon told him he would only come if he could play.\n\n\"I said, 'You mean the Beatles?' And he goes, 'No, me and Yoko and we'll put a little band together.'\"\n\n\"I was quite struck, quite frankly. This was not what I was expecting,\" Brower said.\n\nPutting together a band that's not the Beatles\n\nPulling together a band overnight was no simple thing.\n\n\"John's immediate reaction was to suggest that George Harrison help him to pull together a band to play in Canada tomorrow,\" said Hemmingsen. \"Of course, there's laughter on that one because the idea of pulling together a band within 24 hours or less ... is insane.\"\n\nHemmingsen knows there's laughter because he has a recording of the conversation that followed just after Brower called.\n\nIn the recording, which Hemmingsen shared with Day 6, Lennon is trying to work out the details of this festival. There's talk about immigration officers, first class plane tickets and a castle.\n\n\"This sounds great if we could get George [Harrison] and Eric [Clapton] and a few people,\" Lennon says in the tape. \"It sounds quite good, this Canadian thing.\" Ono responds, \"Yes, it does.\"\n\n\"I think it's clear in Lennon's head that ... it will not be a Beatles concert, of course. It will be what he wants it to be,\" said Hemmingsen.\n\nJournalist Ritchie Yorke, who is heard in the recorded conversation Piers Hemmingsen has from 1969, also interviewed John Lennon and Yoko Ono at the King Edward Hotel in Toronto in 1969. (Ritchie Yorke Project Archives)\n\nTrying to sell tickets — when few believe who's coming\n\n\"Nobody believed John Brower when he told them that he had John Lennon and Yoko Ono and this Plastic Ono Band with Eric Clapton lined up to play on the Saturday at Varsity Stadium,\" said Hemmingsen.\n\nBrower recalls that it wasn't until Lennon and Ono were at Heathrow Airport and told local media where they were going that Toronto locals really started to believe him.\n\n\"Of course, that caused people to flood down to the stadium,\" said Brower. \"The balance of the tickets were sold out.\"\n\nJohn Brower produced the Rock and Roll Revival Festival in Toronto in 1969 and says it might have contributed to the Beatles breaking up. (Janelle Barash)\n\n'The show was saved'\n\nLennon, Ono, Clapton and the rest of the Plastic Ono Band arrived in Toronto to a motorcycle escort and a Rolls Royce.\n\nHemmingsen says Lennon was \"so nervous,\" and that when Brower asked him if he needed anything, Lennon said coke.\n\n\"John Brower assumes he wants Coca-Cola — incorrectly.\"\n\nBut once he walked out on stage, \"he was John Lennon,\" said Hemmingsen.\n\n\"John was so excited to be performing,\" said Brower, who got to be up on stage with Lennon.\n\nBefore September 1969, John Lennon had only played with the Beatles. (Photo by Les Lee/Express/Getty Images)\n\n'John actually had an epiphany'\n\nBrower says this was the moment that John Lennon realized he \"was able to go out as a solo artist.\"\n\n\"Apparently he told his manager on the plane back to London 'this is what I want to do, I want to play my own songs with my own band,'\" Brower said.\n\n\"John Lennon, remember, had never played with anybody else other than the Beatles from the age [of] 17,\" said Hemmingsen.\n\nSo did a rock festival break up the Beatles? Brower says the answer might be yes.\n\nHemmingsen, however, says that Lennon seemed content to pursue side projects and remain with the Beatles, but he says this moment was still significant.\n\n\"This was a major, major step for a Beatle to partner with other musicians ... and perform in concert,\" said Hemmingsen.\n\nTo hear the full segment, download our podcast or click Listen above.", "description": "Fifty years ago, John Lennon debuted the Plastic Ono Band in Toronto with a concert that helped usher in the end of an era.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5283012.1568400113!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/john-and-yoko-1969.jpg", "published_at": "2019-09-13"}