{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-afghanistan-usa/u-s-ambassador-rebukes-afghan-president-over-aid-agency-criticism-idUKKBN1WC0YK", "downloaded_at": "2019-09-27 11:33:38.574700+00:00", "title": "U.S. ambassador rebukes Afghan president over aid agency criticism", "language": "en", "text": "KABUL (Reuters) - The U.S. ambassador to Afghanistan rebuked the country’s president on Friday for labelling Washington’s aid agency “incompetent”, escalating tensions between the countries over financial support on the eve of elections.\n\nFILE PHOTO: Afghan presidential candidate Ashraf Ghani gestures during his election campaign rally in Kabul, Afghanistan September 13, 2019. REUTERS/Omar Sobhani/File Photo\n\nForeign aid still accounts for more than half of Afghanistan’s budget, but donors are questioning the efficacy of programs and most funding pledges run only to 2020.\n\nAfghan President Ashraf Ghani’s comments could undermine goodwill as he seeks re-election on Saturday on an agenda of more Afghan self-reliance and criticism of the United States and Pakistan.\n\nRelations are also complicated by U.S. President Donald Trump’s abrupt decision to call off talks with the Taliban aimed at ending the 18-year old war in the country.\n\nGhani had blasted the U.S. Agency for International Development (USAID) for not getting aid money to the country’s people and dodging regulations, comments made in an interview with domestic station Radio Azadi on Wednesday.\n\n“From each American dollar, the people of Afghanistan don’t get more than 10 cents of it,” Ghani said. “USAID is one of the incompetent donors.”\n\nThe comments triggered a backlash on Friday from the U.S. ambassador, John Bass.\n\n“We are disappointed that President @ashrafghani has overlooked the excellent work of @USAID,” wrote Bass on his official Twitter account.\n\nBass then listed a series of U.S.-funded projects, including empowering women to start businesses, training midwives and improving Afghanistan’s power grid. USAID has worked in the country since 2002.\n\nLast week, the United States said it would withdraw about $100 million (£81.4 million) earmarked for an energy infrastructure project in Afghanistan and withhold a further $60 million in planned assistance, blaming corruption and a lack of transparency in the country.\n\nIt was not clear whether Ghani’s comments were related to the withdrawal.\n\nAfghanistan’s fourth presidential elections since U.S.-led forces toppled the Taliban regime in 2001 will be held on Saturday.\n\nTo fund the vote, the Afghan government allocated $90 million and international donors gave $59 million - the first time Afghanistan has committed the greater portion of election financing.\n\nGhani, a former World Bank official, has repeatedly questioned the intent of international aid, especially from the United States, and criticised agencies for meddling in Afghanistan’s domestic affairs.", "description": "The U.S. ambassador to Afghanistan rebuked the country's president on Friday for labelling Washington's aid agency \"incompetent\", escalating tensions between the countries over financial support on the eve of elections.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190927&t=2&i=1434480321&w=1200&r=LYNXMPEF8Q0MQ", "published_at": "2019-09-27"}