{"pub": "cnn", "url": "https://us.cnn.com/travel/article/worlds-busiest-airports-2018/index.html", "downloaded_at": "2019-09-22 07:19:10.674617+00:00", "title": "This is the world's busiest airport", "language": "en", "text": "Atlanta, Georgia (CNN) — Once again, Atlanta rules the world.\n\nAt least its airport does.\n\nMore than 107 million passengers flew through Hartsfield-Jackson Atlanta International Airport last year, making it the busiest passenger airport in the world for the 21st year in a row.\n\nAtlanta also saw a 3.3% increase in passenger traffic, according to Airports Council International's world traffic report , which was released on September 16.\n\nGlobally, passenger traffic increased to 8.8 billion last year, a 6.4% increase, while air cargo shipments increased by 3.4%.\n\n\"The World Airport Traffic Report shows that even as smaller airports around the world continue to make strong gains, the largest hub airports continue to grow,\" said ACI World Director General Angela Gittens in a news release.\n\n\"There were 16 airports handling more than 40 million passengers per annum in 2008 and there are now 54.\"\n\nBut Gittens warned of the impact of protectionist policies around the world.\n\n\"Protectionist rhetoric -- fueled by isolationist policies -- has swept several major economies in recent times and this has translated into a dismantling of established open trade relationships and regimes,\" Gittens said in the news release.\n\nAir transport relies on open markets to grow, she said.\n\n\"Despite this, passenger traffic has remained resilient, posting annual growth rates above historical averages with the cost of travel decreasing in many markets and middle-class populations burgeoning in emerging markets,\" she said, adding that persistent isolationist policies could stifle growth in many countries.\n\nMajor connecting hub\n\nl e v a r t\n\nAtlanta continues to dominate the passenger market because of its location as a major connecting hub and port of entry into North America. It's within a two-hour flight of 80% of the United States population of more than 300 million people.\n\nThere was no change from 2017 in the rankings of the top three passenger airports.\n\nComing in second place, Beijing Capital International Airport passed the 100 million passengers mark in 2018, hitting nearly 101 million passengers and growing by 5.4%. Third place Dubai Airport handled 89 million passengers, increasing by only 1%. (Dubai was also the top-ranked airport for international passenger traffic, followed by London's Heathrow Airport and Hong Kong International Airport.)\n\nChicago tops Atlanta here\n\nUnited Airlines is headquartered in Illinois, and has a large presence at O'Hare International Airport in Chicago Scott Olson/Getty Images North America/Getty Images\n\nChicago's O'Hare International Airport knocked Atlanta out of the No. 1 spot for most aircraft movements, which is airport language for takeoffs and landings. O'Hare handled nearly 904,000 movements in 2018. Atlanta handled more than 895,000 movements, and Los Angeles International Airport handled nearly 708,000 movements.\n\nOverall, 2018 aircraft movements totaled 99.9 million, a 3.1% increase.\n\nRelated content Pan Am time machine: This elaborate dinner theater recreates air travel from the 1970s\n\nHong Kong remains the largest air cargo airport, handling more than 5.1 million metric tonnes of cargo in 2018, a 1.5% increase over the previous year, followed by the Memphis International Airport (Tennessee, US) and China's Shanghai Pudong International Airport.\n\nRapid growth\n\nIndira Gandhi International Airport in New Delhi is part of India's growth as an aviation market. Courtesy David Brossard/Creative Commons/Flickr\n\nAs many as a dozen of the world's top 30 fastest-growing airports are located in China or India. The airport in Bangalore, India, is the No. 1 fastest-growing airport, with 32.3 million passengers in 2018 -- a whopping 29% increase.\n\nThe world's busiest airports 2018\n\n1. Hartsfield-Jackson Atlanta International Airport (Georgia, US) -- 107.4 million passengers\n\n2. Beijing Capital International Airport (China) -- 101 million\n\n3. Dubai International Airport (United Arab Emirates) -- 89.1 million\n\n4. Los Angeles International Airport (California, US) -- 87.5 million\n\n5. Tokyo's Haneda Airport (Japan) -- 86.9 million\n\n6. Chicago's O'Hare International Airport (Illinois, US) -- 83.2 million\n\n7. London's Heathrow Airport (United Kingdom) -- 80.1 million\n\n8. Hong Kong International Airport (China) -- 74.5 million\n\n9. Shanghai Pudong International Airport (China) -- 74 million\n\n10. Paris Charles de Gaulle Airport (France) -- 72.2 million\n\n11. Amsterdam Airport Schiphol (Netherlands) -- 71 million\n\n12. New Delhi's Indira Gandhi International Airport (India) -- 69.9 million\n\n13. Guangzhou Baiyun International Airport (China) -- 69.7 million\n\n14. Frankfurt Airport (Germany) -- 69.5 million\n\n15. Dallas/Fort Worth International Airport (Texas, US) -- 69.1 million\n\n16. Istanbul's Atatürk International Airport (Turkey) -- 68.4 million\n\n17. Seoul's Incheon International Airport (South Korea) -- 68.4 million\n\n18. Jakarta's Soekarno-Hatta International Airport (Indonesia) -- 65.7 million\n\n19. Singapore Changi Airport (Singapore) -- 65.6 million", "description": "More than 107 million passengers traveled through the world's busiest airport in 2018, according to Airports Council International. Check out which airports are the world's busiest.", "authors": [], "top_image": "https://dynaimage.cdn.cnn.com/cnn/w_1200/http%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F190916210434-worlds-busiest-airports-atlanta-super-tease.jpg", "published_at": "2019-09-16"}