{"pub": "yahoo", "url": "https://news.yahoo.com/3-infants-die-bacteria-pennsylvania-hospital-183100489--abc-news-topstories.html", "downloaded_at": "2019-10-08 12:11:57.788527+00:00", "title": "3 infants die from bacteria at Pennsylvania hospital", "language": "en", "text": "3 infants die from bacteria at Pennsylvania hospital originally appeared on abcnews.go.com\n\nEight premature infants were infected with a waterborne bacteria while in a neonatal intensive care unit. Three of the infants have died.\n\nThe babies were in the NICU at Geisinger Medical Center in Danville, Pennsylvania.\n\n(MORE: Special antimicrobial soap used to fight antibiotic-resistant superbugs in hospitals and nursing homes)\n\nOut of \"an abundance of caution,\" the medical center will temporarily direct mothers who are delivering prematurely -- before 32 weeks gestation -- to other area facilities, the center reported.\n\nThe infants had contracted a pseudomonas infection caused by pseudomonas bacteria. This waterborne bacteria causes one of the most common hospital-acquired infections and can create severe symptoms in those with compromised immune systems.\n\nThe center found no evidence of the bacteria throughout the hospital, said Dr. Mark Shelley, director of infection prevention at Geisinger.\n\nInstead, hospital officials believe that the bacteria was limited to the intensive care unit.\n\n(MORE: Premature Babies Face Future Blood Sugar, Blood Pressure Problems)\n\n\"It's really too soon to say exactly where the organism is coming from,\" Shelley said. He said that the center has done extra cleaning, put filters on taps and changed its medical center processes. The facility is also working closely with the state health department and the Centers for Disease Control and Prevention to eliminate the bacteria and prevent additional cases.\n\nThe hospital is dedicated to finding out why the infections occurred and not letting it happen again, Shelly said.", "description": "Eight premature infants were infected with a waterborne bacteria while in a neonatal intensive care unit.  The babies were in the NICU at Geisinger Medical Center in Danville, Pennsylvania.  Out of \"an abundance of caution,\" the medical center will temporarily direct mothers who are delivering", "authors": ["Erin Schumaker"], "top_image": "https://s.yimg.com/uu/api/res/1.2/YZl2xI0f2dRY9xtZAuce9Q--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.gma.com/geisinger-medical-center-file-gty-jef-191007_hpMain_16x9_992.jpg", "published_at": "2019-10-07"}