{"pub": "yahoo", "url": "https://yahoo.com/entertainment/justin-bieber-reenacts-taylor-swifts-154529997.html", "downloaded_at": "2019-10-07 20:11:23.449320+00:00", "title": "Justin Bieber Reenacts Taylor Swift's Banana Freakout as Hailey Baldwin Responds to Backlash", "language": "en", "text": "Justin Bieber and Hailey Baldwin were criticized over a video reenactment of Taylor Swift’s post-surgery banana freakout.\n\nDays after host Jimmy Fallon aired the hilarious video of the star getting very distraught over not picking out the banana she wanted following her LASIK eye surgery, the Canadian pop star, 26, put his own spin on the clip.\n\nIn an Instagram Live story filmed over the weekend by Baldwin, 22, Bieber can be seen in the pair’s kitchen playfully calling out, “it’s not the banana that I wanted.”\n\n“That was so funny,” Baldwin replied with a laugh, as her husband continued the reenactment, adding, “It’s not the right banana — it has no head!”\n\nRELATED: Taylor Swift’s Mom Shares Hilarious Video of Singer Post-Surgery — and She Freaks Out Over a Banana!\n\nView photos James Devaney/GC Images More\n\nThe clip was quickly criticized by fans of Swift, who accused Bieber and Baldwin of making fun of Swift’s reaction.\n\nBaldwin went on to respond to one of her critics, who tweeted numerous times about her distaste for the pair — specifically Baldwin.\n\nReplying to one of the posts, which included a video of another woman telling Baldwin to “shut up” and “stay out of people’s business,” Baldwin wrote, “I never knew I could make somebody so upset.”\n\n“Truly I’m so sorry you’re THIS upset?!” she added. “Lord have mercy I hope I’m never this upset about someone I don’t know!!”\n\n“Listen. I think it’s awesome how passionate you are and how hard you ride for someone you’re a fan of, it’s beautiful how dedicated you are,” Baldwin continued. “If there’s something I did to personally hurt you or offend you I’m sorry, it’s not my intention to upset you by any means but being angry at someone you don’t know does nothing for you. I know cause I been there.. all it’s gonna do is make you miserable. Don’t let ME of all people get you feeling that way. Trust me, I’m not worth the energy, nobody should be worth that energy.”\n\n@myyylover listen. I think it’s awesome how passionate you are and how hard you ride for someone you’re a fan of, it’s beautiful how dedicated you are. If there’s something I did to personally hurt you or offend you I’m sorry, it’s not my intention to upset you by any means. — Hailey Bieber (@haileybieber) October 7, 2019\n\n@myyylover but being angry at someone you don’t know does nothing for you. I know cause I been there.. all it’s gonna do is make you miserable. Don’t let ME of all people get you feeling that way. Trust me, I’m not worth the energy, nobody should be worth that energy! — Hailey Bieber (@haileybieber) October 7, 2019\n\nAs many of Swift’s fans pointed out, Bieber and Swift haven’t always seen eye-to-eye in the past.\n\nUpon learning in June that Bieber’s manager Scooter Braun had acquired Swift’s music catalogue, the singer expressed disdain for Braun, claiming that he used Bieber and on-and-off client Kanye West to bully her on social media.\n\nTo illustrate her point, Swift also shared a screenshot from Bieber’s Instagram account of an August 2016 post, in which he shared a FaceTime call between himself and Braun — who can be seen with West. “Taylor swift what up,” Bieber captioned the post.\n\nIn response, Bieber apologized for his “distasteful and insensitive” post, writing that “at the time I thought it was funny.”\n\n“As the years have passed we haven’t crossed paths and gotten to communicate our differences, hurts or frustrations,” Bieber wrote. “So for you to take it to social media and get people to hate on Scooter isn’t fair. What were you trying to accomplish by posting that blog? seems to me like it was to get sympathy u also knew that in posting that your fans would go and bully scooter.”", "description": "Justin Bieber Reenacts Taylor Swift’s Banana Freakout", "authors": ["Maria Pasquini"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Umrwy2qEDwIC5qbIt4zzfw--~B/aD02MzA7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/people_218/d689094c09b54e45d647bd7b5a2dda30", "published_at": "2019-10-07"}