{"pub": "independent", "url": "https://independent.co.uk/voices/supreme-court-brexit-prorogation-unlawful-boris-johnson-new-york-jeremy-corbyn-john-bercow-labour-a9118321.html", "downloaded_at": "2019-09-24 14:00:11.156148+00:00", "title": "On the distorted TV feed, The Supreme Court president spoke like a Dalek, but she only needed to say one word: exterminate, exterminate, exterminate", "language": "en", "text": "London was under the dying throes of Hurricane Humberto when the Supreme Court rose. The wind and rain almost broke the TV feed, distorting the crisp, certain voice of Lady Hale to that of a Dalek.\n\nIt was fitting in its way. She spoke for 11 electrifying minutes but three words would have done. Exterminate. Exterminate. Exterminate.\n\nGame. Set. Match. Caught. Bowled. The Chequered Flag. The White Flag. The Towel. The Lot.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nOn every single aspect, in every single way, the government was defenestrated with explosive force. It had been a unanimous verdict. All 11 supreme court judges were in agreement. No one expected that. And in every single element of the case, the government had been found entirely wanting.\n\nThree specific slam dunks punctuated the judgement, and each spread to fill a bizarre blast radius. The prime minister is in New York. Most of the rest of British politics is in Brighton, for the annual sacramental chanting at the Cult of Corbyn.\n\nThe technical issues had been resolved by the time the first one came. Even if they had not, visual clues of where Lady Hale might be heading were available.\n\nThe subject of her ladyship's penchant for elaborate brooches has been noted before in legal circles. Her “twelve best” have even been the subject of a recent blog post on a law website.\n\nIt intimates that this morning’s selection, which does not feature, had been purchased especially for the occasion – a giant sparkling black widow spider. It is one of many arachnids in which the function of the man in the circle of life is to be eaten alive by the woman.\n\nAs Kipling noted, the female of the species is more deadly than the male.\n\n“The first question is whether the lawfulness of the prime minister’s advice to Her Majesty is justiciable,” Lady Hale paused. “This Court holds that it is.”\n\nIf the Brighton Centre had gasped in any more perfect unison it would have sucked the sea through its own front door.\n\nWas this whole prorogation thing actually any of the court’s business? Wasn’t it just up to the government? That was the first question the court has been to asked to consider. It had made its decision. Supreme court 1. Government 0.\n\nShe carried on.\n\n“This was not a normal prorogation ... No justification for taking action with such an extreme effect has been put before the court.”\n\nMore deep breaths.\n\n“The Court is bound to conclude that the decision to advise Her Majesty to prorogue parliament was unlawful because it had the effect of frustrating or preventing the ability of parliament to carry out its constitutional functions without reasonable justification.”\n\nJaws dropped. Eyes widened. The TV pictures were crisp and immaculate now. Had Humberto himself stopped to listen in?\n\nOn she went. “This means that the Order in Council to which it led was also unlawful, void and of no effect and should be quashed. This means that when the Royal Commissioners walked into the House of Lords it was as if they walked in with a blank sheet of paper. The prorogation was also void and of no effect. Parliament has not been prorogued. This is the unanimous judgment of all 11 Justices.”\n\nShape Created with Sketch. ‘Brexit is like...’ The Top 20 Twitter analogies Show all 20 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. ‘Brexit is like...’ The Top 20 Twitter analogies 1/20 The Beatles \"Brexit is like Liverpool trashing all its links to The Beatles and spending all its time and energy building Esther McVey World.\" Shutterstock / terry bouch 2/20 The number seven \"Trying to understand Brexit is like trying to figure out what colour the letter seven smells like.\" Shutterstock / jgl247 3/20 Pilots \"Brexit is like being in a plane hurtling towards the ground with the pilot and co-pilot arguing over who would crash it better.\" Shutterstock / View Apart 4/20 Operation \"Brexit is like going to the doctor, being told you need an operation, agreeing to it, then finding out they are going to cut off your cock & sew it to your forhead... ...but refusing to get a 2nd opinion.\" Shutterstock / Dmytro Zinkevych 5/20 Wall \"My mentions have taught me that Brexit is like Trump’s wall. For its devoted fans it has a symbolic value totally unrelated to its workability, its true cost or the glaring self-interest of its proposers, whereas non-believers see nothing but a deranged and costly vanity project.\" Shutterstock / Tony Craddock 6/20 Skydive \"brexit is like a sitcom where at the start of the episode the main character tells a casual lie about being able to skydive to impress someone and now they're at the end of the episode in a plane about to jump\" Shutterstock / Mauricio Graiki 7/20 Crumble \"Brexit is like if Farage & Johnson said “May we make you an *amazing* apple crumble?” & then 18 months later handed you a leaking bag of maggots & offal. You shouldn’t have to eat it.\" Shutterstock / CKP1001 8/20 Punch \"‘Asking me to support Brexit is like asking me to punch my constituents in the face,’ said Anna Turley, the Labour MP for Redcar, which voted 66:34 to leave. ‘It doesn’t make it easier if you tell me my constituents want to be punched.’\" Shutterstock / ZoneCreative 9/20 Fire \"Watching this government deal with Brexit is like being locked outside your house while you can see people inside setting fire to the furniture as the law’s telling you you can’t go in and stop them.\" Shutterstock / Gorb Andrii 10/20 Villains \"Brexit is like living in a superhero movie that has no heroes, just loads of incompetent villains fighting over who is more evil.\" Shutterstock / Aisyaqilumaranas 11/20 Book \"Brexit is like a bad novel. You are so far into it you just want to skip to the end to see if it ended as badly as it had begun. (You throw the book at the wall when you realise it is the first book in a trilogy).\" Shutterstock / Stokkete 12/20 Cricket \"Watching Brexit is like trying to reverse engineer the rules of cricket by listening to the radio. I have absolutely no idea what is going on.\" Shutterstock / ChrisVanLennepPhoto 13/20 Car \"Brexit is like the UK took a motorway exit, then found the road turning into a rutted grassy track, and now the car's stuck in a muddy field, there's no help in sight, it's getting dark, everyone's shouting at the driver, and the passengers are beginning to worry about food.\" Shutterstock / Kolbakova Olga 14/20 Cable \"Watching Brexit is like watching someone try and plug a coaxial aerial cable into a HDMI port. There is a lot of anger, a lot of swearing, and a lot of remarks about how this used to work before.\" Shutterstock / Elnur 15/20 Windows \"#Brexit is like going back to Windows 3.1\" 16/20 Liars \"I'm sure most people remember a kid at school who just lied constantly? Who refused to back down, however outlandish the lie, and however it was disproven? Brexit is like all of those kids from every school have got together, and are now running the country.\" Shutterstock / chairavee laphom 17/20 Donors \"Trying to extricate ourselves from the EU, and Brexit, is like a multiple transplant patient attempting to give all the donated organs back.\" Shutterstock / Luuuusa 18/20 Electricity \"Paying my taxes to pay for Brexit is like asking a guy on death row if he has any change to put in the meter for the electric chair.\" Shutterstock / Fer Gregory 19/20 Bandersnatch \"Brexit is like watching Bandersnatch with your bae where bae is 70,000 Conservative party members hogging the PlayStation controller & choosing the most WTF option every time.! Shutterstock / George Dolgikh 20/20 Constipation \"Brexit is like the shit that never comes. Total constitutional constipation. Ironically Brexit also sounds like a constipation relief medicine.\" Shutterstock / sasha2109 1/20 The Beatles \"Brexit is like Liverpool trashing all its links to The Beatles and spending all its time and energy building Esther McVey World.\" Shutterstock / terry bouch 2/20 The number seven \"Trying to understand Brexit is like trying to figure out what colour the letter seven smells like.\" Shutterstock / jgl247 3/20 Pilots \"Brexit is like being in a plane hurtling towards the ground with the pilot and co-pilot arguing over who would crash it better.\" Shutterstock / View Apart 4/20 Operation \"Brexit is like going to the doctor, being told you need an operation, agreeing to it, then finding out they are going to cut off your cock & sew it to your forhead... ...but refusing to get a 2nd opinion.\" Shutterstock / Dmytro Zinkevych 5/20 Wall \"My mentions have taught me that Brexit is like Trump’s wall. For its devoted fans it has a symbolic value totally unrelated to its workability, its true cost or the glaring self-interest of its proposers, whereas non-believers see nothing but a deranged and costly vanity project.\" Shutterstock / Tony Craddock 6/20 Skydive \"brexit is like a sitcom where at the start of the episode the main character tells a casual lie about being able to skydive to impress someone and now they're at the end of the episode in a plane about to jump\" Shutterstock / Mauricio Graiki 7/20 Crumble \"Brexit is like if Farage & Johnson said “May we make you an *amazing* apple crumble?” & then 18 months later handed you a leaking bag of maggots & offal. You shouldn’t have to eat it.\" Shutterstock / CKP1001 8/20 Punch \"‘Asking me to support Brexit is like asking me to punch my constituents in the face,’ said Anna Turley, the Labour MP for Redcar, which voted 66:34 to leave. ‘It doesn’t make it easier if you tell me my constituents want to be punched.’\" Shutterstock / ZoneCreative 9/20 Fire \"Watching this government deal with Brexit is like being locked outside your house while you can see people inside setting fire to the furniture as the law’s telling you you can’t go in and stop them.\" Shutterstock / Gorb Andrii 10/20 Villains \"Brexit is like living in a superhero movie that has no heroes, just loads of incompetent villains fighting over who is more evil.\" Shutterstock / Aisyaqilumaranas 11/20 Book \"Brexit is like a bad novel. You are so far into it you just want to skip to the end to see if it ended as badly as it had begun. (You throw the book at the wall when you realise it is the first book in a trilogy).\" Shutterstock / Stokkete 12/20 Cricket \"Watching Brexit is like trying to reverse engineer the rules of cricket by listening to the radio. I have absolutely no idea what is going on.\" Shutterstock / ChrisVanLennepPhoto 13/20 Car \"Brexit is like the UK took a motorway exit, then found the road turning into a rutted grassy track, and now the car's stuck in a muddy field, there's no help in sight, it's getting dark, everyone's shouting at the driver, and the passengers are beginning to worry about food.\" Shutterstock / Kolbakova Olga 14/20 Cable \"Watching Brexit is like watching someone try and plug a coaxial aerial cable into a HDMI port. There is a lot of anger, a lot of swearing, and a lot of remarks about how this used to work before.\" Shutterstock / Elnur 15/20 Windows \"#Brexit is like going back to Windows 3.1\" 16/20 Liars \"I'm sure most people remember a kid at school who just lied constantly? Who refused to back down, however outlandish the lie, and however it was disproven? Brexit is like all of those kids from every school have got together, and are now running the country.\" Shutterstock / chairavee laphom 17/20 Donors \"Trying to extricate ourselves from the EU, and Brexit, is like a multiple transplant patient attempting to give all the donated organs back.\" Shutterstock / Luuuusa 18/20 Electricity \"Paying my taxes to pay for Brexit is like asking a guy on death row if he has any change to put in the meter for the electric chair.\" Shutterstock / Fer Gregory 19/20 Bandersnatch \"Brexit is like watching Bandersnatch with your bae where bae is 70,000 Conservative party members hogging the PlayStation controller & choosing the most WTF option every time.! Shutterstock / George Dolgikh 20/20 Constipation \"Brexit is like the shit that never comes. Total constitutional constipation. Ironically Brexit also sounds like a constipation relief medicine.\" Shutterstock / sasha2109\n\nThe ocean went out again. At time of writing, it was far beyond the horizon. Its spokesperson cannot be reached for comment. It is not expected to return.\n\nIn the conference hall, Jeremy Corbyn rushed on to the stage. He reached for his usual staccato, to exalt somebody else’s triumph.\n\n“This demonstrates a contempt for democracy and an abuse of power by Boris Johnson,” he thundered, standing in the exact same spot where his own party has shown contempt for its own democracy 15 hours before.\n\n“And I invite Boris Johnson to consider his position!”\n\nThe crowd went wild. As it happens, outside the Supreme Court, the SNP MP Joanna Cherry was addressing the media. It was her who had brought the ultimately victorious case. The response of the Labour Party, Her Majesty’s Opposition no less, had been to share some #OccupyParliament hashtags on Twitter and stage a late night sit in in the House of Commons.\n\nAll this as dawn broke over Manhattan. In his wilderness years, between winning the EU referendum and accidentally bringing down his own government, Dominic Cummings used to write lengthy blogs about “alternative branches of histories.” It’s not your fault if things go wrong, there are other, imagined worlds where things went right. It’s just that, the branches are really very long now, the distance between them very wide indeed. The happy place is far, far away.\n\nMeanwhile, John Bercow strode out on to College Green, in front of the House of Commons.\n\n“I have instructed the house authorities to prepare not for the recall – the prorogation was unlawful and is void – but to prepare for the resumption of the business of the House of Commons,” he said.\n\n“The House of Commons sits tomorrow at 11.30am.”\n\nEventually, Johnson emerged, to stand on a Manhattan balcony and, even at this impossible hour, lie, lie and lie again.\n\n“I disagree with this judgement in the strongest possible way.\n\n\"We need to have a Queen’s speech, that’s what we want to do,” he said, his hair blowing in the breeze, his face, as ever unable to fully de-smirk itself.\n\n“But there are a lot of people who want to frustrate Brexit.”\n\nSo it’s not about Brexit. But it is about Brexit. It was always about Brexit prime minister. You know it, we know it, the Supreme Court certainly knows it. Now, even The Queen knows it.\n\nAnd so, with his final flourish, Corbyn brought his leader’s speech forward by a day. His deputy leader, Tom Watson, the man whose job he had tried to abolish three days previously, was bumped for the purpose.\n\nA fittingly premature end to an conference that should have been aborted before it began.\n\nIt had been a triumphant morning for the cause of truth and justice.\n\nYet there remains simply no occasion the Labour leadership cannot seek to lower to its level.", "description": "London was under the dying throes of Hurricane Humberto when the Supreme Court rose. The wind and rain almost broke the TV feed, distorting the crisp, certain voice of Lady Hale to that of a Dalek. It was fitting in its way. She spoke for 11 electrifying minutes but three words would have done. Exterminate. Exterminate. Exterminate. Game. Set. Match. Caught. Bowled. The", "authors": ["Tom Peck"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/24/12/lady-hale.jpg", "published_at": "2019-09-24"}