{"pub": "hotair", "url": "https://hotair.com/archives/karen-townsend/2019/10/09/hepatitis-scare-flight-attendant-linked-passenger-exposure", "downloaded_at": "2019-10-10 03:14:02.255726+00:00", "title": "Hepatitis A scare: flight attendant linked to passenger exposure", "language": "en", "text": "How about a little Hep A with that tiny bag of pretzels on your flight from San Francisco to Charlotte? That probably wasn’t a question posed to ticketholders on a recent flight as they boarded, but maybe it should have been.\n\nAn American Airlines flight on September 21 included a flight attendant infected with acute Hepatitis A and suffering from symptoms of the disease. He was considered to have been infectious. Eighteen passengers were contacted about possible exposure and have been vaccinated. The disease is highly contagious.\n\nA spokesperson for the Centers for Disease Control and Prevention (CDC) told Fox News in a statement on Tuesday that a flight attendant was linked to the virus. “For [HIPAA] privacy act related reasons, we cannot disclose specific information about the team member involved in this matter. However, once informed by the CDC of a team member potentially carrying infectious disease, American Airlines policy is to immediately remove the individual from service until all necessary health measures have been completed in accordance with CDC guidance,” the airline said in a statement to WSOC.\n\nNot to be confused with Hepatitis B or C, patients with Hepatitis A can fully recover. It is preventable with a vaccine. While it is rare to die from Hepatitis A, it can cause liver failure or death, mostly in people 50 years of age and older. Symptoms of the disease include fever, fatigue, dark urine, vomiting, joint pain, and jaundice. In this case, the attendant had diarrhea. (My apologies if you are eating while reading this.)\n\nThe flight attendant “had diarrhea on several flights within the infectious period,” prompting investigators to contact all passengers and other crew, CDC officials said in the release. The CDC did not identify the other flights where the attendant worked.\n\nWhat is disturbing to me as I read about this story is that the Center for Disease Control (CDC) wasn’t contacted with this information until October 1. Why was there a delay in reporting a possible situation of multiple people exposed to a highly contagious disease by the airline carrier? Also, several flights are alleged to be involved yet only this one flight is in the news. CDC says the agency is contacting people who may be involved.\n\nPassengers becoming ill after airline flights isn’t unusual, of course, but usually, it is a cold or respiratory problem that develops from the recycled air in the cabin. This disease is a different matter altogether. This has to do with the hygiene practices of airline personnel and frankly, some common sense. If a flight attendant has diarrhea, why is he/she working on a flight that day? Maybe this isn’t such a surprise. With airlines squeezing more and more people into flights as cost reduction is the name of the game to increase profits, perhaps sanitary standards have lessened. Infection control is bound to suffer if proper time, training, and supplies aren’t available. This isn’t an area to cheap out on. I know flight attendants are often over-worked on crowded flights but surely they can take the time to properly wash their hands.\n\nThis reporter has a thread of interesting tweets as he tried to get to the bottom of the story as it developed. He now is working on the story of the other flights that may have been involved.", "description": "San Francisco to Charlotte flight.", "authors": ["Karen Townsend", "John Sexton", "Jazz Shaw", "Ed Morrissey"], "top_image": "https://hotair.com/wp/wp-content/uploads/2017/09/AmericanAirlines.jpg", "published_at": "2019-10-09"}