{"pub": "businessinsider", "url": "https://businessinsider.com/huawei-mate-30-doesnt-have-any-google-apps-2019-9", "downloaded_at": "2019-09-19 23:06:42.817548+00:00", "title": "Huawei's new Mate 30 flagship phone doesn't come with any Google apps, and it's the first big tech casualty of the US-China trade war", "language": "en", "text": "Huawei unveiled its new glitzy 5G flagship phone, the Mate 30, in Munich, Germany, on Thursday.\n\nThe Chinese phone maker touted the Mate 30's new souped-up circular camera array, its narrower notch, and the option to get models bound in vegan leather.\n\nBut the firm tried to gloss over the phone's biggest problem: It doesn't come with any Google apps.\n\nThe Mate 30 will run EMUI 10, an operating system based on Android 10. But it will look quite different from other flagship Huawei phones, with no Google apps preloaded on the device.\n\nThat's thanks to the US's blacklisting of Huawei in May, meaning the Chinese firm couldn't furnish its new phone with the licensed version of Android with Google services including the Google search app, Gmail, and, crucially, the Google Play Store, the primary way Android users download apps on their phones.\n\nInstead, the Mate 30 will feature Huawei's own app package, called Huawei Mobile Services. It includes a photo gallery, a web browser, and Huawei's AppGallery app store.\n\nDuring the Mate 30 launch event, Richard Yu, Huawei's consumer chief, appealed to developers to create apps for the ecosystem.\n\nRepresentatives for Google and Huawei confirmed to Business Insider on Thursday that the phone would not run the licensed version of Android.\n\nThe Mate 30 comes in two editions bound in vegan leather. Huawei\n\nThe Mate 30 starts at €799 ($884), while the beefed-up Mate 30 Pro starts at €1,099 ($1,216).\n\nThe Forrester analyst Thomas Husson said the lack of Google services would deal a big blow to Huawei's European business; Huawei is already effectively locked out of the US market.\n\n\"While the new devices will help Huawei compete in China — still the largest smartphone market in the world — the firm will struggle in Europe due to the lack of the Google Play Store,\" Husson said.\n\n\"If consumers can't easily access their favorite apps such as Facebook, WhatsApp, Instagram, Snapchat, YouTube, Google Maps and many more, retailers in some European countries may even be skeptical on the opportunity to distribute the devices.\"\n\nHe added that \"this direct consequence of the US-Chinese trade war demonstrates the significant geopolitical impact of technology ecosystems.\"\n\nHuawei has taken a battering from the US government's blacklisting and accusations that it helps spy on people for the Chinese government, which the company has always denied. But this is the first time the consequences of the trade war have become visible to people buying Huawei devices.\n\nRead more: Huawei is trying to sell all its 5G patents to a Western buyer in a bid to placate Trump and dodge national security concerns\n\nHuawei is the second-biggest smartphone manufacturer globally, ahead of Apple. It has been locked out of the US smartphone market for years but gained popularity in Europe for its high-end, well-made phones that rival Apple's iPhone, Google's Pixel, and Samsung's Galaxy range in quality and price.\n\nThat position could be at risk if consumers are put off by the lack of access to Google's services and a weird, non-licensed version of Android.\n\nThe Financial Times reported in June that Google was lobbying the Trump administration to either lift the ban or grant Google an exception, but evidently these efforts have thus far been unsuccessful.\n\nYu said at the unveiling event that the Mate 30 would still support the Android 10 operating system. Huawei is able to use the Android OS because Google open-sources a watered-down version of the software.\n\nFollowing the US ban, Huawei announced that it was readying a bespoke OS called Harmony. Vincent Yang, a Huawei senior vice president, said last month that Harmony was being kept as a last resort and that the company would work with Android as long as it could.", "description": "The US ban on Huawei dealt its first big blow to the company, as it was forced to release its flagship Mate 30 without Google apps.", "authors": ["Isobel Asher Hamilton"], "top_image": "https://amp.businessinsider.com/images/5d8386da2e22af193d140ba6-2732-1366.jpg", "published_at": "2019-09-19"}