{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/29/uscis-agency-rejects-more-h-1b-visa-workers", "downloaded_at": "2019-10-30 00:08:12.477444+00:00", "title": "USCIS Agency Rejects More H-1B Visa Workers", "language": "en", "text": "Agency officials have reduced the approval rate for foreign H-1B outsourcing workers, so helping American graduates who are being squeezed by the one-two punch of 800,000 H-1B visa workers and Indian discrimination.\n\n“With these denials, it’s great news because it opens up jobs for citizens [and] increases the wage rate,” said Kevin Lynn, founder of Progressives for Immigration Reform. The cut also “reduces the population density [and housing prices] in these areas that have brought in a huge influx of cheaper foreign workers in large numbers,” he told Breitbart News.\n\n“There were many American workers who were qualified and doing these jobs until they were displaced by these H-1B visa workers,” he added.\n\nBut business leaders — including a former official in President Barack Obama’s administration — are denouncing the glimmer of good news for millions of Americans whose careers are threatened by the government’s many visa-worker programs.\n\nThe U.S. Citizenship and Immigration Services (USCIS) agency “has raised the legal standard they use to decide whether enough evidence has been presented with [H-1B] petitions to approve them, without any legal authority to do so and without any notice to the public,” William Stock, of Klasko Immigration Law Partners, told Forbes.\n\nRoughly 12 percent of requests for H-1B visas renewals were rejected by the government in 2019, according to a Forbes-published analysis of government data.\n\nThat modest rejection rate is a gain for American professionals because the H-1B workers who are denied renewals are forced to go home — unless their company quickly wins another visa for them, perhaps the L-1 or B1 categories.\n\nThe rejection rate has grown from just five percent in 2017 to 12 percent in 2019. That means 88 percent of renewals were approved in 2019, slightly down from the 95 percent approval rate in 2017.\n\nMass immigration ensures mass discrimination against American employees, both blue-collar and white-collar, says panel. But D.C. people don't care because they want mass migration. https://t.co/8kqHk86XTB — Neil Munro (@NeilMunroDC) October 29, 2019\n\nThe number of H-1B workers in the United States has never been publicly released. But the number is likely around 5oo,000 foreign graduates who are working on three-year H-1B visas, plus roughly 300,000 foreign graduates who are extending their H-1Bs while waiting for green cards.\n\nEach year, roughly 100,000 foreign graduates get new H-1Bs visas, allowing them to work in the United States for three years. The visas can be renewed once, giving a total of six years. But H-1B workers also can be nominated by their employers for green cards, so allowing them to stay permanently in the United States.\n\nThis army of roughly 800,000 H-1B foreign workers is supplemented by other visa programs, including the L-1, TN, OPT, CPT, and J-1 programs. The total population of foreign graduates in U.S. jobs is roughly 1.5 million.\n\nThis population takes jobs from Americans — and it also helps to export many additional jobs. So the 800,000 H-1Bs likely represent a loss of two million well-paid professional jobs, nearly all of which have gone to Indian H-1B workers. This hidden economy is dubbed the U.S.-India Outsourcing Economy.\n\nCensus data shows how huge numbers of American software graduates have been replaced by Indian & Chinese visa-workers in N.J., California, N.C., Georgia, N.Y., Texas, Virginia, Florida, and other states. Next: Healthcare professionals. @S386 https://t.co/qH9p4Ynd34 — Neil Munro (@NeilMunroDC) October 3, 2019\n\nThere are so many Indian-born graduates in the United States that many have been promoted into management positions, from where they routinely favor Indian candidates above American graduates. This workplace discrimination is so widespread that many technology companies have outsized shares of Indian graduates in U.S. jobs.\n\nMoreover, Indian workers in the United States have created their own political groups to demand faster delivery of benefits promised by their employers. For example, Sen. Mike Lee (R-UT) is pushing his S.386 bill, which would put the Indian H-1B workers on a fast-track to citizenship, regardless of the impacts on his own constituents or on graduates throughout the United States.\n\nBusiness advocates are alarmed by the decline in H-1B approvals.\n\nThe USCIS agency’s minor adjustments have caused rejections to reach “historically high rates,” reported Stuart Anderson, head of a pro-migration advocacy group, the National Foundation for American Policy. “Analysis indicates this change has little to do with any relaxation in the Trump administration’s restrictive immigration policies,” he wrote October 28 in Forbes.\n\nAnderson worked for President George W. Bush and Sen. Spencer Abraham (R-MI), both of whom strongly supported the importation of foreign workers to take jobs worked by Americans. For example, in 2001, Bush pushed the “any willing worker” plan to allow companies to import foreign workers whenever Americans would refuse to accept low-ball wage offers.\n\nAnderson wrote:\n\nThe evidence indicates the Trump administration remains committed to making it more difficult for foreign-born scientists and engineers to work in America. In the coming months, one should expect additional measures to make the process more challenging for employers and the foreign-born individuals they seek to hire.\n\nAnderson pumped up the apparent loss to companies by touting the rejection rate for first-time H-1Bs, which rose from ten percent in 2017 to 24 percent in 2018.\n\nBut most of these rejections were for low-skilled H-1B candidates pushed by Indian companies that lease their imported workers to American companies. The rejection rate for U.S. firms, such as Google, Microsoft, Apple, and Amazon, was much lower.\n\nMoreover, even a 24 percent rejection rate for first-time visas offers no benefit to American professionals. That is because the companies ask for many more workers than their U.S. customers need.\n\nAlso, non-profits, such as universities and hospitals, are allowed to import as many H-1B workers as they wish, after passing the rubber-stamp review by the Department of Labor.\n\nThroughout the process, President Donald Trump has zig-zagged between voters’ demands for less outsourcing and investors’ demands for more outsourcing. He needs the donors’ money for the 2020 election, but he also needs the votes from swing-voting college graduates, and from their parents, who live in the swing-voting suburbs.\n\nThe improvements at USCIS have prompted a legal counter-offensive by the business groups.\n\nThese lawyers have forced agency officials to hand over planning documents to the business lawyers, said an op-ed article at Bloomberg Law by lawyers Leon Rodriguez and Angelo Paparelliare:\n\nThe recently unveiled memoranda and emails will likely accelerate the spate of recent federal lawsuits against USCIS brought by immigration attorneys and their clients. These cases have successfully challenged the tougher H-1B standards (founded on the agency’s newly invented grounds) under the Administrative Procedure Act as arbitrary and unlawful. … The bundles of evidence submitted with new H-1B petitions will now surely include the slew of newly unearthed USCIS communiques revealing that the eligibility standards are higher for no good reason. A far greater problem, however, is that agency breaches beyond their assigned areas of authority and expertise cause unforeseen and decidedly harmful consequences. In the case of USCIS’s overstepping into the DOL’s jurisdiction, American companies and their employees are unjustly deprived of the expertise and creativity of bright noncitizens who help our nation compete in the global economy.\n\nThe two authors are partners at Seyfarth Shaw LLP. Rodriguez served as director of Obama’s USCIS from U.S. Citizenship from 2014 to 2017. Paparelli is the founder and former president of the Alliance of Business Immigration Lawyers.\n\nThe onshore/offshore process in the U.S.-Indian Outsourcing Economy is described in a discrimination lawsuit against one of the Indian-owned outsourcing firms, Larson & Toubro Infotech.\n\nThe firm won a technology support contract from Iconix Brand Group Inc. in New York. The support was managed by one American employee of Larson & Toubro, according to the lawsuit filed by the D.C. firm of Kotchen & Low. The single American ran a New York team, which consisted of roughly eight Indians who likely arrived with H-1B work visas, the lawsuit says.\n\nBut the single American also ran a team of 20 Indians in India, and he reported to two Indian managers in India. So the visa programs allowed the Indian company to take roughly 30 good jobs from U.S. white-collar workers with just eight visas, according to the lawsuit.\n\nThe lawsuit noted that “from 2013 to 2018, LTI received 9,785 H-1B visas … and almost 200 new L-1 visas … — far more positions than could actually exist given that LTI only employs about 7,500 employees in the U.S.” The surplus of visa workers allows the company to ignore American graduates and instead hire lower-wage Indian visa workers.\n\nJournalists in the establishment media almost entirely miss the scale of job losses inflicted on their white-collar peers. For example, the journalists tend to follow lobbyists’ cue and to describe the H-1B program as bringing 85,000 “high-skilled immigrants” each year.", "description": "Agency officials have nudged down the renewal rate for H-1B outsourcing workers, giving some economic relief to American graduates.", "authors": ["Neil Munro"], "top_image": "https://media.breitbart.com/media/2019/10/India-visa-work-640x335.jpg", "published_at": "2019-10-29"}