{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/paper-phone-google-digital-wellbeing-app", "downloaded_at": "2019-10-28 00:34:40.567769+00:00", "title": "Google Releases Experimental Paper Phone And I Kinda Love It", "language": "en", "text": "Image: Google\n\nLast week Google announced five open-sourced digital wellbeing experiments to \"help people find a better balance with technology.\"\n\nAs it turns out, there's a sixth experiment called Paper Phone. While my natural reaction was to scoff at the idea, I found myself nodding along to the video alarmingly fast.\n\nGoogle Releases Five 'Digital Wellbeing' Experiments To Curb Your Smartphone Addiction Smartphones are a modern day necessity, but for all that they enable, they’re also a fount of crippling anxiety. To help combat that, Google is launching five “digital wellbeing” experiments to “help people find a better balance with technology.” Read more\n\nGoogle describes the device as \"A printable paper phone which helps you take a break from your digital world.\"\n\nI watched the YouTube pitch with amusement at first.\n\n\"Seriously? A piece of paper with some basic info printed on it that you fold to look like a phone? Please.\"\n\nBut the more I watched, I kinda got into the idea.\n\n\"Actually, I do like physically ticking off tasks once they're completed. And there really are only a few key contacts I need for phone calls... which I rarely make anyway. Oh and I do hate it when website recipe pages constantly reload... print outs don't do that.\"\n\nAnd when my mind leaped to paying for public transport (which I do with my phone), the video had an answer for that too.\n\nThe print out has a dedicated area for a card to be slipped in... and it would probably make the process a little faster than clicking the side button to toggle Apple Pay, which then requires Face ID to implement.\n\nJust make sure you don't accidentally misplace your Paper Phone with the card inside.\n\nAs a person who loves tech and whose job it is to write about it everyday, I was surprised at how quickly my pessimism dissipated.\n\nOn the other hand, perhaps its because I am so permanently connected that I fell a little bit in love with the idea.\n\nWhile I certainly can't see myself committing to printing out a faux phone all that regularly, I have to admit that I can see it benefiting my state of mind on days where I'm in need of a digital detox.\n\nThere's an admirable amount of practicality around Paper Phone, despite it seeming like a mere gimmick at face value.\n\nPaper Phone is open source and the app available now on the Play Store. Oh, and you'll need a printer of course.", "description": "Last week Google announced five open-sourced digital wellbeing experiments to \"help people find a better balance with technology.\" As it turns out, there's a sixth experiment called Paper Phone. While my natural reaction was to scoff at the idea, I found myself nodding along to the video alarmingly fast....", "authors": ["Tegan Jones"], "top_image": "https://edge.alluremedia.com.au/m/g/2019/10/paper-phone.jpg", "published_at": "2019-10-28"}