{"pub": "metro", "url": "https://metro.co.uk/2019/10/07/joaquin-phoenix-surprises-fans-joker-screening-10873185", "downloaded_at": "2019-10-07 06:54:47.193860+00:00", "title": "Joaquin Phoenix surprises fans at Joker screening", "language": "en", "text": "The Joker has been a box office smash (Picture: PA Images)\n\nThe Joker movie has been surrounded in controversy but when Joaquin Phoenix crashed a screening he added a bit of comic relief to the mix.\n\nJoaquin, the Joker himself, appeared at a movie house in the San Fernando Valley greeting ticketholders after the credits rolled.\n\nThe actor was making the rounds at different theatres in Los Angeles, apparently posing with fans and shaking hands but at this one he got a little stage fright when asked to do his tormented Joker laugh from the film, according to TMZ.\n\nJoaquin seemed to almost half-attempt it but pulled back saying he just couldn’t do it.\n\nJoaquin played Arthur Fleck in Joker (Picture: Warner Bros)\n\nHe then asked the audience member to do his own version but the guy couldn’t do it either.\n\nGood on them for having a go though.\n\nJoker, starring Joaquin Phoenix as Batman’s enemy this time round, was released worldwide earlier this month and already it has become a huge global hit.\n\nAccording to Reuters, Joker raked in an impressive £93.5million (£75,849,000) on its debut – smashing box office records to become the highest October launch of all time.\n\nThe record was previously held by 2018 thriller Venom that brought in $80million (£64,898,800).\n\nJoker acts as an origins story for Joker set in 1981 and it follows failed stand-up comedian Arthur Fleck, who turns to a life of crime in Gotham City.\n\nJoaquin has reportedly been tipped for an Oscar for his portrayal of Joker, but the movie hasn’t been without scrutiny and it’s faced criticism over its dark and violent scenes.\n\nFamilies involved in the Aurora shooting complained to Warner Bros and Joker has been accused of glamourising gun violence.\n\nDirector Todd Phillips defended the movie’s inclusion of violence and Warner Bros, the studio behind the film, insisted ‘neither the fictional character Joker, nor the film, is an endorsement of real-world violence of any kind’.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Priyanka Chopra wants James Bond role as she calls for female 007 and we’re so down for this\n\nMORE: Beyonce admits ‘crying’ at Tyler Perry movie studio launch as she celebrates historic opening", "description": "The Joker movie has been surrounded in controversy but when Joaquin Phoenix crashed a screening he added a bit of comic relief to the mix.", "authors": ["Eliza Berlage"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/09/PRI_85956006_1570428718.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-07"}