{"pub": "bbc", "url": "https://bbc.com/news/science-environment-49664409", "downloaded_at": "2019-09-12 07:19:45.766138+00:00", "title": "Project Oberon: UK eyes cluster of military radar satellites", "language": "en", "text": "Image copyright AIRBUS Image caption Artwork: The satellites would fly in formation to geo-locate radio transmissions\n\nThe UK government is pushing ahead with its plans for a cluster of military radar satellites, placing a design study with Airbus.\n\nProject Oberon, as it's known, has been in discussion for a while.\n\nIt envisages a network of small spacecraft capable of seeing the Earth's surface in all weathers and at night, and at very high resolution.\n\nThe satellites would also have sensors to locate the use of radio transmissions.\n\nThis is information that can be used in tandem with the radar pictures to better identify targets on the ground and interpret their behaviour.\n\nCurrently, British forces do not have the benefit of a sovereign Earth observation system. They must rely on commercial imagery or data supplied by allies.\n\nRadar satellites have traditionally been big, expensive beasts, but technology developments are shrinking the size and cost of these platforms.\n\nThe Airbus study anticipates a demonstrator spacecraft being launched in 2022 with an operational capability in orbit possibly as early as 2025.\n\n\"Project Oberon builds on Airbus' expertise in space radar technology developed over 40 years,\" said Colin Paynter, the managing director of Airbus Defence and Space UK.\n\n\"I look forward to seeing this study leading to a new world-class surveillance capability for the UK Ministry of Defence (MoD), helping to protect our armed forces across the world.\"\n\nNews of the study was announced by Gary Aitkenhead, the chief executive of the UK's Defence Science and Technology Laboratory (Dstl), an executive agency of the MoD.\n\nHe was speaking at the Defence and Security Equipment International (DSEi) trade show at London's ExCel conference centre.\n\n\"This addition to our capability is a valuable part of the future of Defence Space. Partnership between Dstl and Airbus on this project secures UK jobs as well as continuing to exploit advances in the UK space sector.\"\n\nImage copyright SSTL Image caption Artwork: NovaSar was launched in September last year\n\nThe armed forces have been testing data gathered by the NovaSar satellite, which was launched a year ago.\n\nThis first all-British radar spacecraft was developed by Airbus and its subsidiary Surrey Satellite Technology Ltd.\n\nAt 430kg, it is small by historic comparison, but still large when set against the very latest platforms now being built by commercial operators, such as the Finnish Iceye company and the US start-up Capella. Their satellites weigh well under 100kg.\n\nAirbus says it too can achieve similar compactness whilst also delivering very high performance.\n\nImage copyright OSS Image caption The OSS looks something like a parasol when deployed\n\nThe new satellites would likely use the innovate antennas from Oxford Space Systems (OSS).\n\nThese carbon-fibre structures stow away in very small volumes for launch but then spring into shape once in orbit.\n\nThe \"wrapped rib\" design would transmit (via a smaller inner-structure) and receive the radar pulses that are used to map the surface of the Earth.\n\nThe MoD is already funding R&D work at OSS.\n\nSensing and geo-locating the source of radio frequency (RF) transmissions is an emerging Earth observation technique.\n\nA good example where this can be useful is in maritime patrol.\n\nPirates and illegal fishers will often switch off their GPS trackers to try to hide from the authorities, but they will still be visible to satellite-borne RF sensors if they are using radios and other equipment to coordinate their illegal activities.\n\nThe tender for the Project Oberon study was issued at the end of last year.\n\nImage copyright Getty Images Image caption British forces' communications are tied into a secure satellite system\n\nThe DSEi event on Wednesday also saw the MoD announce the competition to run its next-generation Skynet telecommunications network.\n\nThe current Skynet-5 system was procured as a complete service (satellites and operations) from Airbus under a Private Finance Initiative (PFI) in 2003.\n\nFor Skynet-6, the MoD will be moving to a model where it retains ownership of the satellites but brings in a commercial partner to manage the secure communications these spacecraft enable.\n\nAt the moment, just one geostationary satellite, Skynet-6a, has been ordered (from Airbus) for the new network.\n\nSkynet-5 has four spacecraft in orbit providing global connectivity for British armed forces.\n\nJonathan.Amos-INTERNET@bbc.co.uk and follow me on Twitter: @BBCAmos", "description": "Defence chiefs want a batch of small spacecraft able to see the Earth's surface in all weathers.", "authors": ["Jonathan Amos", "Bbc Science Correspondent"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/BD79/production/_108750584_artist's-impression-2-of-an-oberon-project-spacecraft-cluster-high-res-copyright-airbus.jpg", "published_at": "2019-09-11"}