{"pub": "yahoo", "url": "https://sports.yahoo.com/report-antonio-brown-accuser-had-133239067.html", "downloaded_at": "2019-09-15 14:27:13.103821+00:00", "title": "Report: Antonio Brown, accuser had settlement talks “for months”", "language": "en", "text": "The Patriots and the NFL didn’t know that Antonio Brown would be sued for sexual assault and rape before he signed with New England. But Brown definitely did.\n\nIan Rapoport of the NFL reports that Brown and his accuser, Britney Taylor, “engaged in settlement talks for months” before the lawsuit was filed.\n\nIt’s not a surprise. Most civil lawsuits are preceded by an effort to resolve them before the legal process begins.\n\nScroll to continue with content Ad\n\nIn a case like this, including inflammatory allegations of a shocking nature against a high-profile athlete, a potential settlement has greater monetary value before the case is filed, because the defendant is buying not just a resolution of the claims but a guarantee that no one will ever know about it (like former Panthers owner Jerry Richardson did, before one or more of the persons who had settled their claims against him violated confidentiality agreements for which they had received fair and proper compensation). For an NFL player subject to the league’s P.R.-driven Personal Conduct Policy, which polices a player’s private life even in cases where the police never get involved, there’s even greater value in preventing knowledge of the allegations from ever coming to light. There’s even more value in securing a promise from the accuser to never talk to anyone about it, including the NFL — especially when the NFL has the power to suspend Brown or, if the allegation of rape is true, banish him for life.\n\nStory continues\n\nThe demands made by the accuser’s lawyers during settlement talks aren’t known; the clunky statement issued by Brown’s lawyer in the immediate aftermath of the filing of the lawsuit hinted at $1.6 million as the asking price. If that’s the opener, it quite likely could have been negotiated down to half of that or less. If that’s the bottom line, Brown may eventually wish he’d paid it.\n\nWhile it may seem crass to consider allegations of sexual assault and rape in these terms, Brown’s accuser chose to make those allegations exclusively via a process that dispenses judgment through the transfer of money. The fact that settlement talks occurred for “months” before the lawsuit was filed underscores the reality that she decided to exercise her absolute right to attempt to obtain justice through the pursuit of financial compensation.\n\nThat said, once the lawsuit is filed, the value of the case drops, because a large portion of that value comes from never filing the lawsuit in the first place. If, however, Brown’s lawyers were to somehow reach a deal before Britney Taylor meets with the NFL on Monday, they would be doing much more than helping Brown avoid an adverse verdict in a court of law. They could be helping him avoid paid leave and, ultimately, a suspension.", "description": "The Patriots and the NFL didn't know that Antonio Brown would be sued for sexual assault and rape before he signed with New England. But Brown definitely did. Ian Rapoport of the NFL reports that Brown and his accuser, Britney Taylor, \"engaged in settlement talks for months\" before the", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/ymuJ1spQNEQOQWw2GOfQ0A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjEuMDY2NjY2NjY2NjY2Nw--/https://s.yimg.com/uu/api/res/1.2/a3zRygVo4SKeFxgBiZkt7Q--~B/aD0xMDgwO3c9MTkxODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/profootballtalk.nbcsports.com/1911500591af99568df46136d273aaff", "published_at": "2019-09-15"}