{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/17/WS5da7c632a310cf3e35570fb1.html", "downloaded_at": "2019-10-17 05:15:26.302087+00:00", "title": "PGA now offering instant incentive", "language": "en", "text": "A player hits his tee shot, file photo. [Photo/VCG]\n\nThree wins and you're in.\n\nThe PGA Tour on Wednesday announced that beginning next season its international tours-PGA Tour Series-China, Mackenzie Tour-PGA Tour Canada and PGA Tour Latinoamerica-will reward instant promotion and membership on the Korn Ferry Tour to any player who records three victories on one tour in a season.\n\nThe move reflects the tradition established by the Korn Ferry Tour, which launched the original three-win promotion in 1997.\n\nIt sends three-time winners directly to the PGA Tour proper, and since its inception 12 players have made the jump.\n\n\"This is one more incentive for the players who play high-level golf on our three tours,\" said Rob Ohno, the PGA Tour's senior vice-president.\n\n\"Players have shown they are ready to compete and contend once they get to the Korn Ferry Tour. Giving them an immediate track to that tour is an exciting addition.\"\n\nPGA Tour Latinoamerica began in 2012, with the Mackenzie Tour following a year later and PGA Tour Series-China starting in 2014.\n\nEight different players have won at least three times in a year, with China's \"Marty\" Dou Zecheng still the only international tour player to capture four titles in a season, on the Chinese circuit in 2016.\n\n\"The talent level on these international tours is so high that players who get hot can win tournaments in bunches; we look forward to when that happens,\" Ohno said.\n\n\"The tours provide a pathway to the PGA Tour and the players' next stop is the Korn Ferry Tour. If a player plays well and wins three times, we want to send him on his way right then.\"\n\nHomegrown ace Li Haotong was the first to accomplish a three-win season on the PGA Tour Series-China in 2014.\n\nHe's since been joined by New Zealanders Josh Geary and Nick Voke, and compatriot Dou.\n\nIn 2015, Mexico's Rodolfo Cazaubon became the first PGA Tour Latinoamerica player to win three tournaments in a season.\n\nCurrent PGA Tour player Nate Lashley followed Cazaubon in 2016, while Dan McCarthy was the first Mackenzie Tour player to accomplish the feat.", "description": "", "authors": [], "top_image": "http://img2.chinadaily.com.cn/images/201910/17/5da7c632a310cf3e97a19e91.jpeg", "published_at": "2019-10-17"}