{"pub": "thinkprogress", "url": "https://thinkprogress.org/hurricane-dorian-slow-stall-land-rains-bahamas-florence-climate-harvey-6c007b626632/", "downloaded_at": "2019-09-04 23:39:50.479050+00:00", "title": "Hurricane Dorian’s nightmarishly slow pace is linked to climate change", "language": "en", "published_at": "2019-09-04", "text": "Hurricane Dorian’s historic destruction in the Bahamas earlier this week is already emerging as the latest example of a disconcerting trend. The storm hit the islands with Category 5 wind speeds and then stalled over land for hours before inching towards the United States.\n\nAccording to some estimates, Dorian may be the slowest-moving Category 5 hurricane in the Atlantic Ocean in history.\n\nDorian’s slow crawl is similar to other major hurricanes in recent years, and seems to be an increasingly common trend for these devastating storms. Scientists worry climate change is playing a role, allowing hurricanes to become more destructive as they slow down due to warming temperatures. When they stall, hurricanes are able to do far more damage than when they move quickly.\n\nAs of Wednesday morning, Dorian was moving towards the Southeastern United States after decimating several Bahamian islands. Forecasts indicate that Florida and Georgia could largely be spared the worst of the storm, even as images of mass-destruction in the Bahamas begin to emerge.\n\nAdvertisement\n\nThe storm has weakened from a Category 5 to a Category 2, lowering its deadly windspeed but expanding in size, thereby widening the area in its path.\n\nThe National Hurricane Center (NHC) issued a warning in advance of the storm, forecasting “very heavy rainfall totals of up 15 inches” in parts of the Carolinas, with flash flooding also a significant possibility. The wider Southeast is bracing for impacts into the end of the week, including storm surges and high winds.\n\nIt is likely, however, that the worst of Dorian’s damages have already happened in the Bahamas. After destroying much of Great Abaco, a 10-mile-wide island, on Sunday, for eight and a half hours, Dorian headed toward Grand Bahama. There, the storm sat for 40 hours, moving at a snail’s pace of just over one mile per hour, sometimes becoming completely stationary.\n\nAdvertisement\n\nDuring that time, the storm did unprecedented damage. The death toll in the islands now stands at seven, but officials have said many people remain unaccounted for, and they expect the number of casualties to rise. Around 70% of homes in impacted areas are also reportedly underwater.\n\nPrime Minister Hubert Minnis called the event “one of the greatest national crises in our country’s history” and said that more would be known in coming days as the country seeks to recover.\n\nHurricanes are naturally occurring phenomena, and it is common for them to stall, especially over land. But they typically move at a much faster pace, which can help mitigate the colossal damage they cause.\n\nBut that hasn’t been the case with Dorian, or with other recent memorable hurricanes.\n\nIn 2017, Hurricane Harvey slammed into the Texas Gulf Coast, hovering over Houston for days and unleashing a mountain of water, claiming dozens of lives and racking up over $100 billion in damages. One year later, Hurricane Florence similarly devastated the Carolinas as it stalled over land, dumping so much rain it turned one town into a temporary island. Florence was only a Category 1 storm when it made landfall in the United States, but due to its glacial pace and its heavy rains, the hurricane’s damages were catastrophic.\n\nAdvertisement\n\nA study published in June by federal scientists found that hurricane speed in the North Atlantic Ocean decreased 17% between 1944 and 2017. While it is hard to connect any one disaster to climate change, scientists have linked the stalling pace of hurricanes to slowing global winds, which in turn seem to be impacted by ice melt in the Arctic.\n\nThat trend means that there could be more storms like Dorian in the future, and occurring more often, especially if recent years are an indicator. There have only been 35 Atlantic hurricanes with Category 5 speed winds in reordered history. Of those, five have been in the last four years.", "description": "", "authors": [], "top_image": "https://thinkprogress.org/wp-content/uploads/2019/09/GettyImages-1165944765.jpg?w=1920&h=1080&crop=1"}