{"pub": "heritage", "url": "https://heritage.org/press/heritage-vp-comments-federal-clerkship-training-academy", "downloaded_at": "2019-09-04 04:13:50.801243+00:00", "published_at": "2019-09-04", "title": "Heritage VP Comments on Federal Clerkship Training Academy", "language": "en", "text": "WASHINGTON, D.C. — The Heritage Foundation’s John Malcolm made the following statement about the Federal Clerkship Training Academy in response to a letter from six U.S. senators to the Administrative Office of the U.S. Courts. Malcolm is the vice president for Heritage’s Institute for Constitutional Government, director of the Meese Center for Legal and Judicial Studies, and Ed Gilbertson and Sherry Lindberg Gilbertson senior legal fellow.\n\n“The Heritage Foundation offered this training academy as a service to the judiciary. Our goal was to give incoming law clerks some of the tools that they are unlikely to learn in law school and that will enable them to hit the ground running and excel.\n\n“There were no restrictions on who could apply and the Federal Clerkship Training Academy was funded out of general operating expenses. We made admissions decisions based on space restrictions and merit. We accepted individuals who were going to be clerking for judges appointed by presidents of either party, and we also had self-professed liberals among the attendees and the faculty.\n\n“We published the curriculum, which was completely educational and non-partisan in nature. Attendees were and are free to talk about what was covered during the Federal Clerkship Training Academy, and were and are free to share any material—all of which had previously been made publicly available anyway—they received, without restrictions of any kind.\n\n“Consistent with its educational mission, Heritage holds public events and publishes non-partisan and rigorous analysis on all manner of public policy issues all the time. Neither the event nor the report mentioned in the letter was discussed, alluded to, or disseminated to any of the attendees.\n\n“The academy was well-received by the attendees and the faculty, and we have every intention of doing it again next year and in subsequent years.”", "description": "WASHINGTON, D.C. — The Heritage Foundation’s John Malcolm made the following statement about the Federal Clerkship Training Academy in response to a letter from six U.S. senators to the Administrative Office of the U.S. Courts.", "authors": [], "top_image": "https://www.heritage.org/themes/heritage/src/images/bell.png"}