{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/10/17/multicultural-malmo-police-disarm-multiple-explosive-devices", "downloaded_at": "2019-10-17 14:34:35.861577+00:00", "title": "Multicultural Malmö: Police Disarm Multiple Explosive Devices", "language": "en", "text": "Police in Malmö disarmed several devices in the southern Swedish city that were later confirmed to be explosives.\n\nThe officers were made aware of the first device at around 10 am on Tuesday outside the entrance of a building in Fosie, not far from the notorious “vulnerable” no-go area of Rosengård, Swedish broadcaster SVT reports.\n\nEvelina Olsson, a local police spokeswoman, said that the object was found “at the entrance to a company located in an industrial area in Malmö”.\n\n“We have blocked off a fairly large area and the National Bomb Protection unit is in place together with several police patrols and is working on the case. We have asked people in nearby buildings to stay indoors,” Olsson added.\n\nShortly after 2 pm, the residents and workers in the area were allowed to come outdoors as the situation was deemed safe.\n\nMulticultural Malmo Police Tell Public to Watch Out for Bombs https://t.co/Ugm2hxkyhs — Breitbart London (@BreitbartLondon) September 19, 2019\n\nAn employee of a business in the area claimed that there had been multiple explosive devices found, a fact Olsson later confirmed. “We have found that there were several objects with explosive substances. National Bomb Protection has disarmed the objects in place and now forensic technology has taken over,” she said.\n\nAnother witness told Swedish newspaper Sydsvenskan that each object, of which there were allegedly five in total, looked like a thermos with white sticks taped to them.\n\nThe paper claims that criminal gangs in the city had previously used thermos containers as homemade bombs.\n\nSweden has seen a surge in explosions and bombings across the country in 2019, up 45 per cent according to some estimates.\n\nTargets for the explosions have varied from residential buildings to police stations. The most recent suspected attack occurred at a police station in Staffanstorp earlier this week and saw the doorway of the station damaged in what was described as a powerful blast.", "description": "Police in Malmö disarmed several devices in the southern Swedish city that were later confirmed to be explosives.", "authors": ["Chris Tomlinson"], "top_image": "https://media.breitbart.com/media/2019/06/Malmo-police-640x335.png", "published_at": "2019-10-17"}