{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/8/rays-chase-verlander-early-beat-astros-4-1-to-even", "downloaded_at": "2019-10-09 04:35:08.609103+00:00", "title": "Rays chase Verlander early, beat Astros 4-1 to even ALDS", "language": "en", "text": "ST. PETERSBURG, Fla. (AP) - Willy Adames homered and made a sensational relay throw from shortstop, and the Tampa Bay Rays chased Justin Verlander early in beating the Houston Astros 4-1 Tuesday night to even their AL Division Series at two games apiece.\n\nTommy Pham also went deep and Ryan Yarbrough combined with five other pitchers on a six-hitter for Tampa Bay. Cy Young Award winner Blake Snell came out of the bullpen for his first career relief appearance, holding off Houston in the ninth inning to earn the save.\n\nVerlander, starting on short rest after dominating the wild-card Rays in Game 1, looked uncomfortable on the mound at Tropicana Field and was pulled in the fourth after giving up four runs.\n\nThe series shifts back to Houston for a deciding Game 5 on Thursday night. Astros star Gerrit Cole is scheduled to pitch for the heavily favored AL West champs, who led the majors with 107 wins this season and have one more chance to close out the feisty Rays.\n\nThe winner plays the New York Yankees in the AL Championship Series.\n\nVerlander, whose eight career ALDS victories are a major league record, yielded three runs in the first. Adames homered leading off the fourth to make it 4-0, and the Houston ace didn’t make it through the inning.\n\n“A good approach for those guys in the first, and then honestly, I need those infield singles to be caught. When you don’t have it, you need the balls that are put in play to go your way, and they didn’t,” Verlander said.\n\n“Obviously, not the way you would script it. You know, it sucks.”\n\nThe Rays helped themselves by playing stellar defense, especially with the Astros threatening to cut into their three-run deficit in the fourth.\n\nWith speedy Jose Altuve on first base, Yordan Alvarez hit a long double that short-hopped the center field wall. Two-time Gold Glove winner Kevin Kiermaier quickly grabbed the ball and fired to his cutoff man, Adames. He turned and executed a perfect relay home just in time to nail Altuve trying to score.\n\n“That was probably the most incredible relay throw from an infielder I’ve ever seen,” Kiermaier said. “That was such a huge moment for us, huge momentum shift, and it just doesn’t get any better than.”\n\nRays opener Diego Castillo struck out the first three batters and went 1 2/3 innings. He was followed by Yarbrough, who worked two scoreless innings to get the win. Nick Anderson handed off to Colin Poche, who gave up an eighth-inning homer to Robinson Chirinos.\n\nEmilio Pagan and Snell finished up for the Rays, who have rebounded from losing the first two games of the series on the road to Verlander and Houston’s other headliner, Cole.\n\nAltuve drew a one-out walk and Alex Bregman singled to enable the Astros to bring the potential tying run to the plate in the ninth.\n\nSnell, the reigning AL Cy Young Award winner who started Game 2, entered and struck out Alvarez before retiring Yuli Gurriel on a sharp grounder up the middle - exactly where the Rays were playing him - to end the game.\n\nCharlie Morton, who helped Houston win the World Series two years ago, began the Rays’ comeback by beating his former team 10-3 on Monday.\n\nNeeding one victory to advance to the AL Championship Series for the third straight year, the Astros opted to start Verlander on just three days of rest in hopes of closing out the Rays, who have won three elimination games in a week to stay in the running for their first trip to the ALCS since 2008.\n\nManager AJ Hinch said it was an easy decision to go with Verlander, who was 8-0 in 12 ALDS appearances, including 11 starts, before Tuesday night.\n\nVerlander limited the Rays to one hit over seven scoreless innings in Game 1, and it looked as though Tampa Bay might be in for another long night when he fanned Austin Meadows to begin the bottom of the first.\n\nWhat transpired over the next six batters - beginning with Pham’s 408-foot shot to left-center that got a yellow flag-waving, boisterous crowd of 32,178 into it - could fuel some second-guessing of Hinch if Houston doesn’t win Game 5 at home.\n\nFour of the next five Rays also reached base, building the lead to 3-0. Travis d’Arnaud hit a sharp grounder through the hole between third base and shortstop for an RBI single, and Joey Wendle lined a double into the right-field corner to drive in another run.\n\nPACKED HOUSE\n\nSeating capacity at Tropicana Field was reduced to 25,025 this year, but the Rays removed the tarps covering a portion of the upper deck to allow more fans an opportunity to buy tickets for Games 3 and 4. After drawing 32,251 - more than twice the club’s AL-worst season average of 14,734 per game - on Monday, attendance was announced as 32,178 on Tuesday night.\n\nTampa Bay manager Kevin Cash said the team, which routinely ranks near or at the bottom of the majors in attendance, appreciated the support.\n\n“Certainly, players like to play in front of a lot of fans. Everybody recognizes that,” Cash said. “But when it mattered, when it counted … they showed up.”\n\nCROWDED AISLE\n\nAstros SS Carlos Correa returned to the lineup for the ALDS after missing the final seven games of the regular season due to back tightness that flared up during a flight to Seattle. He said Tuesday that he’s 100 percent healthy and he’s not placing any limitations on himself in the playoffs. He also revealed what he’s doing to try to avoid his back tightening up again during a plane ride.\n\n“I’m laying on the aisle,” Correa said, adding he “felt awesome” when he arrived in Florida before Game 3.\n\n“Got my sleep, got my rest,” he added. “Just happy to be back with the team and on the field once again.”\n\nHinch doesn’t have any objection to the new routine.\n\n“I’m a ‘yes’ on any of that that makes him feel better,” Hinch said. “I’ve not gone to the part of the plane where he’s sprawled out, but he can do whatever he wants, as long as he’s healthy.”\n\nUP NEXT\n\nGame 5 in Houston on Thursday.\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Willy Adames homered and made a sensational relay throw from shortstop, and the Tampa Bay Rays chased Justin Verlander early in beating the Houston Astros 4-1 Tuesday night to even their AL Division Series at two games apiece.", "authors": ["The Washington Times Http", "Fred Goodall"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/08/alds_astros_rays_baseball_26502_c0-150-3592-2244_s1770x1032.jpg?4265a61bee677353d19ee38b4fcb17527803a842", "published_at": "2019-10-08"}