{"pub": "reuters", "url": "https://reuters.com/article/us-global-forex/dollar-softens-as-dealers-await-trade-news-eye-political-turmoil-idUSKBN1WC046", "downloaded_at": "2019-09-27 05:41:33.470965+00:00", "title": "Dollar softens as dealers await trade news, eye political turmoil", "language": "en", "text": "SINGAPORE (Reuters) - The dollar softened on Friday, drifting from multi-week highs against most major currencies as investors cautiously weighed fresh political turmoil in the United States and waited for the next turn in trade negotiations with China.\n\nFILE PHOTO: Euro, Hong Kong dollar, U.S. dollar, Japanese yen, British pound and Chinese yuan banknotes are seen in this picture illustration, January 21, 2016. REUTERS/Jason Lee/Illustration/File Photo\n\nThe greenback was marginally weaker against the safe-haven yen JPY=, which traded at 107.70 per dollar, and retreated from a two-year peak touched in Asian morning trade against the euro to steady around $1.0921 EUR=.\n\nIt fell against the trade-sensitive Australian and New Zealand dollars, which gently rallied on hopes that next month’s U.S.-China trade talks will bring progress. Moves were slight, though and neither strayed far from two-week troughs against the greenback.\n\n“A one word description of currency markets trading today: moribund,” said markets strategist Michael McCarthy on the phone from brokerage CMC Markets in Sydney.\n\n“I think what some traders are responding to is the lack of news. It’s becoming apparent that if a (U.S.-China trade) deal is to be done here, it’s going to be done behind closed doors. It won’t be done over Twitter or in the headlines. We’re looking to next week.”\n\nChina’s top diplomat said China was willing to buy more U.S. products. CNBC reported that trade war talks were on track and scheduled for Oct. 10-11 in Washington, citing people familiar with the arrangements.\n\nThe pound edged higher to $1.2330, having hit a two-week low on Thursday after the European Union’s Brexit negotiator said Britain had yet to provide “legal and operational” proposals for an agreement on exiting the bloc.\n\nMarkets are also digesting the impeachment probe launched into U.S. President Donald Trump.\n\nA whistleblower report released on Thursday said Trump not only abused his office in attempting to solicit Ukraine’s interference in the 2020 U.S. election, but the White House tried to “lock down” evidence about it.\n\nTrump went on the offensive, branding the probe “another witch hunt”.\n\n“The positive U.S. dollar trend, with lots of noise in between it, remains intact,” said Westpac analyst Imre Speizer in Auckland.\n\nThe dollar index .DXY, which measures the greenback against a basket of other currencies, is on track for its best week in a month. It was flat near a three-week high on Friday at 99.146.\n\nThe Chinese yuan CNY= eased to 7.1327 per dollar as weak domestic demand and the trade war pushed industrial profits lower.\n\nThe Australian dollar AUD=D3 rose to $0.6758, but gains were capped as traders wait for a central bank meeting next Tuesday where the Reserve Bank of Australia is widely expected to cut interest rates.\n\n“It seems that when push comes to shove, the USD remains the safest place to be at the moment,” said Rodrigo Catril, senior FX analyst at National Australia Bank in Sydney.\n\n“In addition to its prime reserve currency status, the greenback is still benefiting from a yield supremacy and a U.S. economy that is still performing relatively well.”", "description": "The dollar softened on Friday, drifting from multi-week highs against most major currencies as investors cautiously weighed fresh political turmoil in the United States and waited for the next turn in trade negotiations with China.", "authors": ["Tom Westbrook", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190927&t=2&i=1434357191&w=1200&r=LYNXMPEF8Q04E", "published_at": "2019-09-27"}