{"pub": "reuters", "url": "https://reuters.com/article/us-india-china/indias-modi-and-chinas-xi-eye-new-border-security-steps-in-summit-talks-idUSKBN1WP2U0", "downloaded_at": "2019-10-11 00:26:53.318681+00:00", "title": "India's Modi and China's Xi eye new border security steps in summit talks", "language": "en", "text": "NEW DELHI (Reuters) - Chinese President Xi Jinping and India’s Prime Minister Narendra Modi are expected to agree new security measures along their unsettled border during a summit on Friday, officials said, in an effort to smooth ties ruffled by differences over Kashmir.\n\nFILE PHOTO: Chinese President Xi Jinping and Indian Prime Minister Narendra Modi shake hands as they visit the Hubei Provincial Museum in Wuhan, Hubei province, China April 27, 2018. China Daily via REUTERS/File Photo\n\nThe two are meeting in a seaside resort in southern India after weeks of jousting over India’s decision to revoke the special status of its part of the disputed Himalayan territory of Kashmir, angering arch-rival Pakistan and its ally China.\n\nIndia said on Wednesday any change to Kashmir’s status was an internal affair and there was no place for a third country to be involved, after Xi said he was watching the situation closely and assured Pakistan of Chinese support for its core interests.\n\nChina has longstanding military ties with Pakistan, which has twice fought a war with India over Muslim-majority Kashmir.\n\nModi and Xi will be aiming to prevent a further deterioration in relations during the informal summit in Mamallapuram, and the expectation is the two sides will move forward on a set of confidence-building measures, an Indian source briefed on the discussions said.\n\nIndia and China share a 3,500 km (2,200 mile) border, over which they went to war in 1962 and which remains unresolved despite more than 20 rounds of talks.\n\nThe border has been largely peaceful, but there have been occasional stand-offs between soldiers from the two Asian giants, who have overlapping territorial claims. The measures on the table include more border trade, tourism and even joint military patrols to boost trust, said the source.\n\n“Priority will be given to enhancing confidence-building measures and people-to-people exchanges,” a second government source said.\n\nTEMPLE TOUR\n\nModi will take Xi on a tour of the Shore Temple, dating back to the seventh and eighth centuries, and will have several hours of one-to-one talks designed for a free exchange of ideas on issues ranging from territorial disputes to India’s ballooning trade deficit with China and the question of allowing Chinese telecoms equipment maker Huawei into India’s 5G network.\n\n“Xi will have an in-depth communication with Modi on issues that have overall, long-term and strategic significance on bilateral relations, set the tune and guide the direction for future development of the ties,” Chinese state media quoted Vice Foreign Minister Luo Zhaohui as saying.\n\nXi will be accompanied by top diplomat Wang Yi, while Modi’s team includes Foreign Minister Subrahmanyam Jaishankar and National Security Adviser Ajit Doval.\n\nThe two sides are hoping that Xi and Modi - both powerful nationalist leaders - will build further their personal rapport established at the first such informal summit in the Chinese city of Wuhan last year.\n\n“Since the Wuhan summit, we’ve seen some movement - the restoration of a number of dialogues (military, border, economic), China giving India a little more market access, India toning down its rhetoric,” said Tanvi Madan, senior fellow at Brookings Institution.\n\n“But we’ve also seen enough evidence that key differences remain,” she said, referring to China’s position on Kashmir.\n\nFor China, a top concern has been the presence of Tibet’s spiritual leader the Dalai Lama and the so-called Tibetan government in exile, which has been based in the northern Indian hill town of Dharamsala ever since he fled Tibet following a failed uprising in 1959.\n\nAhead of the summit, police in southern India detained nine Tibetan activists who planned protests during Xi’s visit to Mamallapuram, the local Hindu newspaper said.", "description": "Chinese President Xi Jinping and India's Prime Minister Narendra Modi are expected to agree new security measures along their unsettled border during a summit on Friday, officials said, in an effort to smooth ties ruffled by differences over Kashmir.", "authors": ["Sanjeev Miglani", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439389392&w=1200&r=LYNXMPEF9920I", "published_at": "2019-10-10"}