{"pub": "independent", "url": "https://independent.co.uk/extras/indybest/outdoor-activity/best-womens-running-shorts-pockets-jogging-marathon-exercise-a9089711.html", "downloaded_at": "2019-09-03 23:48:25.108640+00:00", "title": "8 best women's running shorts that are breathable and anti-chafe", "language": "en", "published_at": "2019-09-03", "text": "It wasn’t that long ago when running shorts all looked the same.\n\nBut now there are styles to suit your every need, from streamlined shorts to help you beat that PB to moisture-wicking technology to keep you cool on long runs and with so much on the market, how do you know what to buy?\n\nThe first thing to consider is what you’re training for.\n\nIf you’re marathon training, with the bulk of your sessions carried out at an easy-ish pace, you’ll need a comfortable pair that help regulate your temperature – and crucially don’t chafe.\n\nYou should also look for shorts with a pocket to help you store fuel and a phone without the need for a running belt.\n\nIf a sprint session or a fast 5km is more your style, you may be more inclined to go for a tighter, form-fitting style that helps with compression.\n\nThere are also 2-in-1 shorts, which combine both styles and offer runners the best of both worlds.\n\nTo help you make your decision, we’ve tested shorts from across the market during marathon training sessions, judging them on their style, comfort and, crucially, anti-chafing abilities.\n\nAll the pairs have been put through their paces, from 17-mile training runs, to midweek tempo sessions and sweaty sprints on the treadmill, so, whatever your style, we can guarantee there’s a pair for you.\n\nYou can trust our independent reviews. We may earn commission from some of the retailers, but we never allow this to influence selections, which are formed from real-world testing and expert advice. This revenue helps to fund journalism across The Independent.\n\nKalenji dry+ 2 in 1 women’s running shorts: £14.99, Decathlon\n\nIt is always a risk testing a new piece of kit on a long training run. But halfway through our 17-miler in these 2-in-1 Kalenji running shorts and we’d all but forgotten there was anything to worry about. They are by far the comfiest pair of shorts we tried, with a soft – but crucially seamless – inner short, which prevents any rubbing, and a lightweight outer layer made from breathable material, which helped keep us cool. We liked the addition of two fluorescent strips on the side, giving us that extra bit of confidence on our late-night run commutes home, while the zipped pocket in the waistband is 15cm x 7cm, easily fitting our phone, keys and debit card. We did need to use the drawstring when these shorts first arrived to ensure they fitted perfectly, but once we had done that we found they stayed in place throughout our runs. Plus, these are the cheapest pair we tried. We're sure you'll be racing to get a pair in no time.\n\nBuy now\n\nSweaty Betty challenge running shorts: £50, Sweaty Betty\n\nIt may be better known for its yoga gear, but the brand’s challenge running shorts are a fantastic addition to any runner’s wardrobe. Made predominantly from polyester, the 2-in-1 style keeps you cool and comfortable, as the lightweight fabric of the outer layer wicks away sweat and dries fast, while the form-fitting inner short adds extra coverage and support. The wide waistband is flattering and ensures the shorts don’t ride up mid-run. Certainly, the design seems to work; while some other shorts led to chafing in the hot weather, these prevented any discomfort (even during a heatwave). We tested a pair in black, which looked super stylish, but they are also available in beetle blue and a green camouflage pattern. Sizing ranges from XS to XL, with a small fitting a UK size 10 comfortably. Plus, Sweaty Betty’s keen to be green campaign to reduce plastic waste and landfill means that they don’t arrive in loads of plastic packaging. What’s not to like?\n\nBuy now\n\nLululemon fast and free short: £58, Lululemon\n\nYou may be mistaken for thinking that these shorts belong in the wardrobe of a cyclist and not a runner. Certainly, their form-fitting design and long leg wouldn't look out of place in the peloton. But we urge any runner keen to beat their PB to give these fast and free shorts a go. Described by the brand – which is well known for its high-quality kit and punchy designs – as \"barely-there-feeling shorts\", we found them extremely comfortable and surprisingly flattering. Unlike a lot of similar styles on the market, these shorts have a high waistband and a 6-inch inseam, so you feel well covered throughout, and they retain their shape, even after multiple washes. The brand's specialist fabric is lightweight and sweat-wicking, staying dry even at the end of a tough 10km in the sun. There's also plenty of storage including side drop-in pockets and a waistband pocket for nutrition. Available in five sizes, we found the shorts fitted comfortably round the waist and thigh (plus, there's always a drawcord if you want to adjust them). These are one of the most expensive pairs we tried – but when you get a PB in them, it's worth it, right?\n\nBuy now\n\nAdidas run it shorts: £21.95, Adidas\n\nThese slim-fit run it shorts by Adidas are one of the cheapest pairs we tried – but don't let that put you off. In fact, they boast many of the same advantages as the other – more expensive – pairs, including technology to help keep your body dry by drawing sweat away from the skin and a draw-cord adjustable waist. As an added bonus, the reflective material also increases visibility in low light conditions, helping to keep you safe on those mid-week evening runs. With a leg length of four inches, they are a tad shorter than some of the other pairs, but still keep you covered. Plus, they are also available in pink and black. The only thing we found they are missing is a pocket so we'd recommend these for anyone who loves a shorter distance and who doesn't need to worry about storing fuel.\n\nBuy now\n\nOn running shorts: £65, On\n\nSwiss brand On wanted to go back to basics with these shorts, bringing together modern-day technology with an old-school racing design – and what a result. These running shorts are ultralight, weighing just over 80g, and extremely fast-drying due to their stretchy polyamide and elastane material. They also offer good coverage due to their slightly longer leg while, at the rear of the shorts, there is a moisture-sealed pocket to hold your essentials and stop them bouncing around. On recommends these shorts for fast training, racing and warm weather running, but they were also our go-to pair for cross-training sessions in the gym. A tad more expensive than most of the other pairs, these were a close second for us – but we’re sure we'll keep returning to them.\n\nBuy now\n\nRunderwear women’s running long shorts: £23, Runderwear\n\nRunderwear promises its shorts are \"chafe free, guaranteed\". It is a brave claim – but the brand knows what it’s doing. Perhaps better known for its specialist underwear, its women’s running long shorts provide high-levels of comfort and can be worn on their own or underneath another of your favourite pairs. The 360-degree seamless technology means you don’t get any random rubbing on the lower back or thigh, while the moisture-wicking fabric removes sweat quickly and helped to regulate our body temperature (a crucial benefit when training in the heat). The longer length helps to protect the thighs and they offered a supportive fit. Predominantly made from polyamide, they also dry quickly and are easy to wash and care for. At just £23, you can’t go wrong.\n\nBuy now\n\nBam bamboo enduro shorts: £14, BAM\n\nLaunched in 2006, Bam specialises in bamboo clothing. The crop is highly sustainable, so it's a good choice for any eco-friendly runners out there, while the benefits of bamboo fabric include a luxurious feel, moisture-wicking qualities and UV protection (perfect for those long summer days). It is perhaps unsurprising then that we loved the feel of the brand's bamboo enduro shorts, which are more like a second skin than a piece of gym kit. They were not only super soft to touch but stretchy and supportive, with a flattering cocktail print that garnered many a compliment in the gym changing room. We did find these shorts had a tendency to ride up a bit during runs, and the short style means they are perhaps for the braver runners out there, but we loved them, particularly for our yoga and strength and conditioning sessions. They are also great if you have sensitive skin, with the anti-static material keeping you fresh, dry and comfortable. Available in a UK size 8 to a size 16, we guarantee these will brighten up any runner's wardrobe.\n\nBuy now\n\nReebok meet you there shorts: £22.95, Reebok\n\nReleased as part of Reebok's new autumn/winter campaign, the brand describes these meet you there shorts as being for \"individuals who break the standard\". We're not quite sure whether we fit that description – but we loved the \"go faster\" style design and were pleasantly surprised with the fit and comfort levels. We certainly didn't experience any rubbing, despite the shorter length, and found the shorts stayed dry even during the toughest of sprint sessions. Made from polyester, we also loved the fact they are available in extended-sizing, from XXS to XXL, as part of Reebok's desire to inspire everyone, everywhere.\n\nBuy now\n\nThe verdict: Women's running shorts\n\nShorts are a key part of any runner's kit. Get it wrong and you'll end up uncomfortable and sweaty, with chafed inner thighs. Find the right pair and you'll stay cool and dry, leaving you to concentrate on topping that Strava leaderboard or finishing that marathon. We loved the comfort and design of the Kalenji dry+ 2 in 1 women’s running shorts, even on long runs, but there are plenty of other great contenders to choose from. From On's sleek and stylish pair to Runderwear's chafe free long short, there really is a style to suit every runner.\n\nIndyBest product reviews are unbiased, independent advice you can trust. On some occasions, we earn revenue if you click the links and buy the products, but we never allow this to bias our coverage. The reviews are compiled through a mix of expert opinion and real-world testing.", "description": "Whether you're training for a marathon or just enjoy an evening jog, these shorts from Sweaty Betty, Lululemon and Kalenji will keep you cool and comfortable", "authors": ["Lydia Willgress"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/02/13/best-womens-running-shorts-indybest.jpg"}