{"pub": "abcnews", "url": "https://abcnews.go.com/Sports/wireStory/tokyo-olympic-organizers-6900-tickets-bought-fraud-65949321", "downloaded_at": "2019-09-30 10:46:29.506621+00:00", "published_at": "2019-09-30", "title": "Tokyo Olympic organizers: 6,900 tickets bought through fraud", "language": "en", "text": "Tokyo Olympic organizers are investigating the fraudulent purchase of 6,900 tickets worth 180 million yen ($1.67 million) that were obtained in an online lottery for Japan residents.\n\nInterested in Olympics? Add Olympics as an interest to stay up to date on the latest Olympics news, video, and analysis from ABC News. Add Interest\n\n\"We are consulting with the police on this matter, and if there are other cases where unauthorized purchases are suspected, we will deal with those as needed,\" Tokyo organizers said in a statement Monday.\n\nOrganizers were in the process of voiding the tickets but did not suggest who was involved. They said they were bought using fraudulent IDs.\n\nTicket interest in next year's Tokyo Olympic is unprecedented with demand at least 10 times above supply, and probably much greater.\n\nEarlier this year Japan passed a law that prohibits ticket scalping, with a 1 million yen ($9,100) fine and a one-year jail term — or both.\n\nHowever, the law has large loopholes and does not apply to tickets distributed for free or given away as gifts, or tickets without a purchaser's name. This applies to many tickets coming from the International Olympic Committee, the 206 national Olympic committees, or major sponsors.\n\nIn a separate matter, organizers have announced the results of their latest ticket lottery for Japan residents.\n\nThe outcome is much like the first lottery in May: tickets are very tough to get, and many in Japan will be left out.\n\nOrganizers say 1.4 million people applied in the August phase, and only 120,000 were successful landing 350,000 tickets.\n\nTokyo organizers say they have now sold 3.57 million tickets to Japan residents in both lotteries. The Japanese general public is slated to get between 70-80% of the estimated 7.8 million tickets that are listed as available.\n\nThe rest are for sale outside Japan through Authorized Ticket Resellers — the Olympic agents contracted to sell tickets outside Japan — or go to sponsors, national Olympic committees, sports federations, and dignitaries.\n\nOrganizers are planning another lottery this fall for Japan residents but have declined to say how many tickets will be available.\n\nTokyo is a reversal from recent Olympics in Rio de Janeiro and Pyeongchang, South Korea, when tickets were unsold and many events were poorly attended. That won't be the case with 35 million people in Greater Tokyo looking to attend.\n\nThe demand is widely reported to be driving up hotel prices.\n\nTickets sales are projected to raise about $800 million for the organizing committee's operating budget of $5.6 billion.\n\n———\n\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP—Sports\n\n———\n\nStephen Wade on Twitter: http://twitter.com/StephenWadeAP", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Sports/WireAP_5511bad372c54f79a99611baabb770fa_16x9_992.jpg"}