{"pub": "businessinsider", "url": "https://businessinsider.com/lawmakers-activists-remember-rep-elijah-cummings-who-died-at-68-2019-10", "downloaded_at": "2019-10-17 14:39:43.092414+00:00", "title": "Lawmakers and activists pay tribute to powerful Rep. Elijah Cummings, who suddenly died Thursday at 68", "language": "en", "text": "On Thursday, lawmakers and activists paid tribute to the life and legacy of Rep. Elijah Cummings of Maryland, who died suddenly at age 68 from health complications.\n\nBorn the son of sharecroppers in 1951, Cummings became an attorney and was elected to the Maryland House of Representatives in 1983, and won his seat in Congress in 1996.\n\nBefore his death, he was one of three committee chairmen pursuing the ongoing impeachment inquiry into President Donald Trump as chair of the powerful House Oversight Committee.\n\nCummings' long and storied career on Capitol Hill was defined not by his fights with Trump, but by his fierce pursuit of justice, and his dedication and advocacy for his home city of Baltimore.\n\nVisit Business Insider's homepage for more stories.\n\nOn Thursday, lawmakers and activists paid tribute to the life and legacy of Rep. Elijah Cummings of Maryland, the chairman of the powerful House Committee on Oversight & Government Reform, who died suddenly at age 68 from health complications.\n\nBorn the son of sharecroppers in 1951, Cummings became an attorney and was elected to the Maryland House of Representatives in 1983, where he served as the first African-American speaker, according to the Associated Press, and won his seat in Congress in 1996.\n\nIn recent months, Cummings was best-known for using his committees' oversight power to aggressively investigate President Donald Trump.\n\nBefore his death, he was one of three committee chairmen pursuing the ongoing impeachment inquiry into Trump, who over the summer, attacked Cummings as a \"brutal bully\" and insulted his home city of Baltimore as \"rat-infested.\"\n\nTrump markedly changed tone on Thursday, paying tribute to Cummings as a \"highly respected\" leader.\n\nRead more: Rep. Elijah Cummings, one of the key Democrats leading the impeachment inquiry, has died unexpectedly aged 68\n\n\"I got to see first hand the strength, passion and wisdom of this highly respected political leader,\" Trump tweeted. \"His work and voice on so many fronts will be very hard, if not impossible, to replace!\"\n\nCummings' long and storied career on Capitol Hill was defined not only by his fights with Trump, but by his fierce pursuit of justice, and his dedication and advocacy for the city of Baltimore, which he represented in Congress for 22 years.\n\nCummings received an outpouring of tributes and remembrances from lawmakers on both sides of the aisle, political activists, and journalists who were touched by his leadership, his personal kindness, and the example he set for his fellow members of Congress and all Americans.\n\n—yvette nicole brown (@YNB) October 17, 2019\n\n—Rep. Doug Collins (@RepDougCollins) October 17, 2019", "description": "\"Elijah Cummings was the heart and soul of our caucus, a dignified leader with a voice that could move mountains,\" wrote Rep. Adam Schiff.", "authors": ["Grace Panetta"], "top_image": "https://image.businessinsider.com/5da86fe44af909136a66a497?width=1200&format=jpeg", "published_at": "2019-10-17"}