{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7621519/Granit-Xhaka-visited-home-three-concerned-Arsenal-stars-telling-fans-f-off.html", "downloaded_at": "2019-10-28 13:40:14.494308+00:00", "title": "Granit Xhaka 'visited at home by three concerned Arsenal stars' after telling fans to 'f*** off'", "language": "en", "text": "Arsenal captain Granit Xhaka was visited at home by three senior Arsenal players after he was booed by his own team's supporters when he was substituted in the 2-2 draw at home to Crystal Palace on Sunday.\n\nSome supporters cheered when it was announced that Xhaka, who has struggled for consistency during his time at the club, was to be replaced by Bukayo Saka in the 61st minute.\n\nFans expressed frustration at Xhaka taking a long time to leave the pitch, with boos ringing out across the stadium, and the Swiss midfielder responded by cupping his hand to his ear, while he also appeared to tell supporters to 'f*** off' before storming down the tunnel.\n\nThree Arsenal players visited Granit Xhaka's house after he was booed by his own supporters\n\nThe Arsenal skipper cupped his hand to his ear as he was hauled off in the second half\n\nXhaka appeared to tell fans to 'f*** off' before taking off his shirt and going down the tunnel\n\nNot a great afternoon for Granit Xhaka...\n\n\n\nThe Arsenal captain was jeered by his own fans as he was substituted, before reportedly swearing at the crowd and rejecting a handshake from Unai Emery! 😳\n\n\n\nRead the Arsenal manager's response here: https://t.co/i0Jq3l1qJN pic.twitter.com/DRb3JXrXm9 — Sky Sports Premier League (@SkySportsPL) October 28, 2019\n\nAs reported by The Athletic, Xhaka's team-mates were concerned about him following the incident, with three of them visiting his house.\n\nLucas Torreira, who was warming up when the incident occurred, was moved to tears and had to be consoled by Hector Bellerin. Torreira turned to the crowd and asked why they had acted in such a way.\n\nXhaka was only officially confirmed as Arsenal's club captain just over a month ago, but there have been suggestions that the the 27-year-old could now be stripped of the armband.\n\nWhen directly asked in his press conference whether Xhaka would remain captain, Arsenal head coach Unai Emery replied: 'It's not the moment to speak about that because first I want to speak with him and the club.\n\n'We need to stay calm but, really, he was wrong.'\n\nEmery insisted that Xhaka should have dealt with the situation in a better manner.\n\n'We are working, me and the club to manage playing under pressure, when under pressure to have our minds clear,' said the Arsenal boss.\n\nArsenal midfielder Lucas Torreira was left visibly upset following the incident involving Xhaka\n\nTorreira was warming up on the sidelines when the dramatic incident with Xhaka occurred\n\nThe Uruguayan midfielder was consoled by fellow substitute Hector Bellerin in north London\n\nDidn't want to post these pictures but felt I had to. This is Lucas Torreira's emotional reaction to the abuse Granit Xhaka received after his substitution, in tears and inconsolable. Absolute love and respect for his captain. pic.twitter.com/ijKOvwkYx2 — Stuart MacFarlane (@Stuart_PhotoAFC) October 28, 2019\n\n'In a difficult moment our heart can be hot, but our minds can be clever. We are going to speak about that because the reaction was wrong.\n\n'We are going to speak (about that) inside, with the players and the club.\n\n'We are here because we have supporters. We are the workers inside the club but we play for them.\n\n'We need to have a lot of respect for them when they are applauding us but also when they are criticising us.'\n\nArsenal legend Ian Wright was quick to criticise the club's skipper after his relationship with the fans plummeted to new lows.\n\nWright insisted the Switzerland international must apologise immediately for his outburst.\n\n'I don't like any players getting booed,' Wright said on Match of the Day. 'But this is the captain. Now I think that they're frustrated with the fact that he's not run off.\n\n'He's now goading them. We're talking about fans that have watched him in the four years he's been there have a handful of good games and he's treating the fans like that.\n\nAlexandre Lacazette had liked an Instagram post calling for Unai Emery to be sacked\n\nHector Bellerin, who many fans argue should be club captain, called for unity on Monday\n\n'He should apologise – that's the captain. He should be apologising. He should have apologised already. That's the guy they chose as the captain. That's not captain's behaviour.\n\n'Arsenal fans have showed a lot of patience to him and the performances he's put in. He owes them a lot more and he's acted like that.\n\n'He's the captain and he's got the responsibility to take that on board. He can't go and do that. I can understand the Ozil situation but he's the captain – the manager's got faith in him!'\n\nMoments after the final whistle in north London, Alexandre Lacazette got himself embroiled in the drama after liking an explicit Instagram post calling for Emery to be sacked and slamming Xhaka for his actions.\n\n'Troopz', who is known for his appearances on Youtube channel AFTV, slammed on Instagram: 'I'm sorry, I'm done with this now. You can't be 2-0 up at home to Palace and draw.\n\n'Emery I've back you but bro, enough is enough. Xhaka can f*** himself as well. Never wanna see him in an Arsenal top again!!'\n\nThe French striker, who just returned from an ankle injury, has since appeared to have unliked the social media post.\n\nBellerin, who many Arsenal fans hoped may get the captain's armband instead of Xhaka, called for unity as he became the first player to speak out following the dramatic events in north London.\n\nBellerin, making reference to the Xhaka incident, said: 'We are all humans, we all have emotions, and sometimes it's not easy dealing with them. It's time to lift each other up, not to push each other away. We only win when we are together.'\n\nThe pressure has massively intensified on Emery following the draw to Crystal Palace\n\nArsenal currently sit down in fifth, four points behind Chelsea and Leicester after 10 matches\n\nAfter conceding a two-goal lead, the mood inside the Emirates became fractious on the weekend and many fans also voiced their support for out-of-favour Mesut Ozil.\n\nThe German playmaker, the Gunners' most creative player, has been frozen out by Emery so far this season and supporters made their feelings clear by singing the popular 'We've got Ozil' chant in the stands.\n\nThere were boos at the final whistle inside the Emirates as Arsenal dropped even more points in the Premier League.\n\nDespite an encouraging and hopeful summer transfer window, the club currently sit four points off fourth-place as they desperately seek a way back into the Champions League after three years out of the competition.\n\nEmery has come under intense scrutiny in recent times and if performances fail to pick up in north London, then his position would come under huge threat.\n\nAfter missing out on Champions League football in his first season in charge following a woeful end to last term's Premier League and their 4-1 thrashing against Chelsea in the Europa League final, a top-four finish is now a must for Emery.\n\nIt is reported that the Gunners will give Emery time, most probably until the end of the season, before deciding whether he will manage the club in the final year of his deal.", "description": "Arsenal captain Granit Xhaka was visited at home by three senior Arsenal players after he was booed by his own supporters when he was substituted in the draw at home to Crystal Palace.", "authors": ["Jeorge Bird For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/11/20275842-0-image-a-50_1572260955434.jpg", "published_at": "2019-10-28"}