{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/middle_east/are-arab-israelis-having-their-political-moment/2019/09/24/8d88bdb4-de3a-11e9-be7f-4cc85017c36f_story.html", "downloaded_at": "2019-09-24 13:45:26.596850+00:00", "title": "Are Arab Israelis having their political moment?", "language": "en", "text": "Members of the Joint List Ayman Odeh, left, and Ahmad Tibi during a meeting with Israeli President Reuven Rivlin in Jerusalem, Sunday, Sept. 22, 2019. (Menahem Kahana/Pool via AP)\n\nIsrael is still weeks away frombreaking the deadlock produced by last week’s general election, but one result is already clear: The country’s minority Arab population is ready to be heard.\n\nA surge of Arab voters proved decisive in denying Prime Minister Benjamin Netanyahu the parliamentary seats he needed to extend his decade in power as Israel’s longest-serving leader. Turnout among Israel’s 1.8 million Arabs spiked 10 percent over the previous election, nearing 60 percent, following a campaign in which Netanyahu relentlessly demonized Arab citizens as enemies of the state and a threat to security.\n\nA slate of four Arab parties picked up 13 seats in the Knesset, Israel’s parliament. And this week, most of those parties bucked a three-decade tradition of sitting out the country’s messy post-election haggling by formally recommending that Netanyahu’s chief rival, former army chief Benny Gantz, get the right to form a governing coalition.\n\n“We are forcing ourselves into the political system,” said Ayman Odeh, head of the Hadash party and leader of the successful Arab slate, known as the Joint List. “No one will give us the equality that we deserve, so we are going to take it for ourselves.”\n\nIt is Odeh, a Hebrew-speaking, New Testament-quoting Muslim, who could get credit for sparking this Arab moment. A member of parliament since 2015, he was able to corral a fractious Arab political spectrum — from communists to Islamists — into the Joint List, which won the third-largest number of Knesset seats after Gantz’s Blue and White party and Netanyahu’s Likud.\n\nAs negotiators from the two largest parties entered a second day of talks on the possibility of a unity government that could determine how much influence the Arab faction would wield, Odeh sat in a beachside cafe here and reflected on his success so far.\n\n\n\nAyman Odeh, head of the Arab Joint List alliance, gives out election pamphlets during a campaign rally in the Arab Israeli city of Tira, north of Tel Aviv, on Sept. 5, 2019. (Ahmad Gharabli/AFP/Getty Images)\n\nHe credits Netanyahu’s polarizing rule for motivating not only frustrated Arabs but sympathetic Jews as well. Odeh recorded a direct appeal to Jewish voters, in Hebrew, that went viral the day before the election. Some 20,000 Jewish citizens voted for him, Odeh said, clasping his hands in gratitude.\n\n“I don’t agree that all the Arabs are against all the Jews,” Odeh said. “I see another equation, that Arabs and democratic Jews are against the occupation and discrimination.”\n\nNot all Arabs share Odeh’s rosy, humanitarian view. His appeal for Arab lawmakers to play a more active role is viewed by many in his community as appeasement. His decision for the parties to formally recommend Gantz — who as army chief oversaw a bloody 2014 campaign against Hamas and other militants in the Gaza Strip that killed some 2,000 Palestinians — lasted only hours before one of the Arab factions, Balad, backed out, with one of its members labeling Gantz a war criminal.\n\n“The time is not right for this type of involvement with Israeli politics,” said Balad founder Jamal Zalhalka.\n\nIn recent decades, Arab politicians have stood outside the government structure, taking office as Israeli parliamentarians but keeping their distance as a protest against official policies toward the Palestinians in the occupied territories.\n\n\n\nThis file combo image created on April 2, 2019, shows Israeli Prime Minister Benjamin Netanyahu (left) and retired Israeli Lt. Gen. Benny Gantz (right), one of the leaders of the Blue and White political alliance. (Photos by Oded Balilty and Jack Guez/AFP/Getty Images)\n\nBut many have grown more interested in demanding equality inside Israel than in adhering to a wider ideology, willing to engage in governing in hopes of reducing rampant crime, stopping home demolitions and fixing roads and sewers in their own neighborhoods.\n\nA post-election poll found that three out of four Arabs approved of Odeh’s push for a more active role in governing.\n\n“These elections were a first very significant step in the normalization of Arab Israelis in wider Israeli society,” said Dan Avnon, chairman of Hebrew University’s Political Science Department. “They showed they are part of the system and want to reap its benefit, too.”\n\nBut that same recent poll showed the resistance they are likely to face: Nearly half the country’s Jewish population oppose greater Arab participation in government.\n\nWhen the Joint List parties swung their support to Gantz, Nenayahu immediately sent an I-told-you-so tweet. “As we warned, the Arab parties that oppose Israel as a Jewish and democratic state and glorify terrorists recommended Gantz as prime minister,” he said.\n\nAvigdor Liberman, the nationalist party leader who played a decisive role in denying Netanyahu the seats he needed to form a government after April’s election, refused to recommend either candidate for prime minister. His party could not support a coalition with either Netanyahu’s ultra-Orthodox partners or Gantz’s potential Arab supporters, he said.\n\nOdeh, for his part, is waiting for the always-shifting process of forming a government to play itself out, confident that the movement he has helped set in motion can gain momentum regardless of the outcome. His hope, he said, comes largely from his experience growing up in Haifa, a cosmopolitan port city where Israel’s many factions live side-by-side.\n\n“In Haifa, it’s better,” he said. “It’s not equality, but it’s better.”\n\nOdeh remembers neighborhood soccer games with Arab and Jewish boys playing together and then arguing over who really won the 1973 Arab-Israeli war. When Odeh was 14, his father, a builder, sent him to a Christian school, where he became a reciter of Bible verses. On Sunday, when he presented the Joint List recommendation to President Reuven Rivlin, he quoted Psalm 118: “The rock that the builders cast aside has become the cornerstone.”\n\n“I’ve also read the Torah several times,” he said. “I’m still deeply rooted in my own religion, but everything that is beautiful in Jewish culture I’m willing to accept.”\n\nOdeh is willing to push even deeper into the governing structure. Under one of the many scenarios under negotiation — a unity government combining Likud and Blue and White — Odeh’s Joint List would rank as the second-largest bloc in the Knesset. That would put Odeh in line to be the country’s first Arab opposition leader, a role that includes a security detail and intelligence briefings.\n\nHe knows that would likely be a step too far many, Jews and Arabs alike.\n\n“I would do it,” he said. “But this, they might not let happen.”\n\nRead more\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "description": "Led by a Bible-quoting Muslim, Arabs helped deny Netanyahu the victory he sought.", "authors": ["Steve Hendrix", "Feature Writer Without Portfolio Based On Local Enterprise But Filing For National", "Foreign", "Magazine", "Other Sections", "Ruth Eglash", "Reporter Covering Israel", "The Palestinian Territories", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/KKP0Af-YDgxTuDSgDzDRKB5v8Bo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JYVJETG6HYI6TDOIJGHKXQJJUA.jpg", "published_at": "2019-09-24"}