{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/18/WS5da8f97fa310cf3e3557127e.html", "downloaded_at": "2019-10-18 01:09:31.700448+00:00", "title": "Good that Tokyo, Seoul still willing to talk", "language": "en", "text": "China Daily | Updated: 2019-10-18 07:30\n\nEditor's Note: Japan and the Republic of Korea recently held talks at the World Trade Organization headquarters in Switzerland, but as expected they failed to reach an agreement on easing Japan's tightened controls on exports of semiconductor materials to the ROK. 21st Century Business Herald comments:\n\nSeoul accuses Tokyo of violating WTO regulations by imposing an export ban on semiconductor materials to the ROK, saying it is politically motivated, while Japan insists that the ban is only a modification of its trade system without any political motive and it does not violate WTO regulations. However, as revealed by the Japanese media, when Japan decided to impose such sanctions, its minister of economy, trade and industry said that the ROK did not give Japan a satisfactory answer on the issue of forced labor compensation, which he said harms the trust between the two countries. No wonder not only the ROK but also the Japanese business circle does not buy the Japanese government's excuses for the tightened controls on exports of semiconductor materials to the ROK.\n\nIf the Japanese government insists on cutting off the supply of materials to ROK semiconductor enterprises, it will cause a crisis for ROK enterprises' production and endanger the ROK's economy. However, supply cuts could also bring difficulties for Japanese companies that make these materials. That's because since the semiconductor production in Japan was replaced by ROK companies after 2000, Japanese and ROK companies have formed a close supply chain relationship. That means stopping such supplies would also harm Japanese companies.\n\nThe Japanese government has not fully implemented sanction measures but such an apparent threat has prompted ROK companies to actively seek substitutes for Japanese products. The ROK is Japan's third-largest trading partner, thus Japan's trade sanctions against the ROK will surely reduce the trade volume between them, which may further expand Japan's trade deficit.\n\nNo matter what the motives are for the export controls, Japan's threat of sanctions has fueled public anger in the ROK and also produced a tough response from the ROK government, which has not only tightened trade controls on Japan but also prompted it to terminate the General Security of Military Information Agreement it signed with Japan. Trade sanctions cannot solve the problems between Japan and the ROK, they will only give rise to more economic problems. Finding solutions to the differences between the two requires them to demonstrate their political wisdom. Such trade dispute talks are usually held at the WTO headquarters only once, but Tokyo has accepted Seoul's proposal to talk about the issue again, which offers a glimmer of hope that they will be able to come to an agreement.", "description": "Editor's Note: Japan and the Republic of Korea recently held talks at the World Trade Organization headquarters in Switzerland, but as expected they failed to reach an agreement on easing Japan's tightened controls on exports of semiconductor materials to the ROK. 21st Century Business Herald comments:", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/18/5da8f97fa310cf3e97a1c918.jpeg", "published_at": "2019-10-18"}