{"pub": "indiatimes", "url": "https://indiatimes.com/news/world/people-occupy-mall-in-paris-protest-against-govt-s-ignorance-on-climate-change-environment-377202.html", "downloaded_at": "2019-10-06 07:28:12.060667+00:00", "title": "People Occupy Mall In Paris, Protest Against Govt's Ignorance On Climate Change & Environment", "language": "en", "text": "A shopping centre in Paris turned into a protest hub when hundreds of climate activists barricaded themselves inside the complex 5 as security forces tried to remove them.\n\nThe protest is a part of a planned series of protests around the world by the Extinction Rebellion movement.\n\nFrench climate protesters joined '#Yellow Vest' activists to occupy the entrance of a shopping mall in Paris to attract attention to climate issues. pic.twitter.com/e6jP4YeqUh — ANews (@anewscomtr) October 5, 2019\n\nCampaigners faced off against police and some inconvenienced shoppers as they occupied part of the Italie 2 mall in southeast Paris.\n\nThey unfurled banners with slogans like \"Burn capitalism not petrol\" above restaurants and the window displays fashion boutiques.\n\nAP\n\nAccording to a report by AFP, the protest comes ahead of planned disruption to 60 cities around the world from Monday in a fortnight of civil disobedience, from Extinction Rebellion (XR), which is warning of an environmental \"apocalypse\".\n\nDon't Miss 253 SHARES 1.6 K SHARES 11.1 K SHARES\n\nActivists were told by the security forces to leave the area.\n\nAccording to images shared on social networks, police then tried to enter the building, while protesters blocked entrances with tables and chairs.\n\nSome members of the “Yellow Vest”, an anti-government protest group also joined in with the Paris shopping centre demonstration, including other groups.\n\nAn entire shopping mall in Paris, France (over 100 shops) occupied by #ExtinctionRebellion + #YellowVests and the French MSM TV, always ready to \"go direct\" to film a burning dumpster, decide to zap instead this non-violent protest. #Italie2 #Italie2occupé https://t.co/cy4FBWmMBM — Glenn #ExtinctionRebellion (@Ecoanthro) October 5, 2019\n\nActivists from climate protection group Extinction Rebellion have joined \"yellow vest\" protesters to protest climate inaction and capitalism inside a Paris mall. pic.twitter.com/oa9akOuDGF — mohammad ahmady (@mohamma18368019) October 5, 2019\n\nVOA - Climate Activists Occupy Paris Mall as Global Extinction Rebellion Protests Begin https://t.co/HNWWGj9K42 pic.twitter.com/FyrX6fY7K3 — Afropages (@AfropagesEn) October 6, 2019\n\nNon-violent protests are chiefly planned by XR from Monday in Europe, North America, Australia, but events are also set to take place in India, Buenos Aires, Cape Town and Wellington.\n\n\"To governments of the world: we declared a climate and ecological emergency. You did not do enough. To everybody else: rebel,\" XR said on its website ahead of its International Rebellion wave of activism.\n\n\"You can't count on us or Greta to do this for you,\" it said, referring to teenage Swedish climate activist Greta Thunberg. \"Look inside yourself and rebel.\"", "description": "A shopping centre in Paris turned into a protest hub when hundreds of climate activists barricaded themselves inside the complex on October 5 as security forces tried to remove them. The protest is a part of a planned series of protests around the world by the Extinction Rebellion movement.", "authors": ["Shweta Sengar"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/paris_1570341221_800x420.jpg", "published_at": "2019-10-06"}