{"pub": "hotair", "url": "https://hotair.com/archives/jazz-shaw/2019/10/02/judge-tosses-new-york-tax-cap-lawsuit", "downloaded_at": "2019-10-03 07:27:38.397239+00:00", "published_at": "2019-10-02", "title": "Judge tosses New York tax cap lawsuit", "language": "en", "text": "One of the many sore spots for Democrats in the 2017 tax law was the limit placed on how much of your state and local taxes (SALT) could be deducted when filing your federal taxes. The SALT cap was set at $10,000 dollars and blue states with a lot of high earners objected, saying that the rule imposed an unfair burden on them. With that in mind, they began cooking up schemes to allow people to “donate” extra money in the amount they would have paid in excess state taxes to state-controlled “charitable” funds. This would have allowed the taxpayer to then deduct the same amount.\n\nWell, the IRS shut that plan down back in June, so it was back to the drawing board. In New York, Governor Andrew Cuomo announced that he would be going to court to challenge the SALT cap as a politically motivated scheme. All we can say for Mr. Cuomo is that it really doesn’t seem to be his year. A federal judge just threw the suit out, declaring it to be essentially without merit. (NY Post)\n\nA federal judge’s decision Monday to toss Gov. Andrew Cuomo’s lawsuit over the federal cap on the state and local-tax deduction had to be — as the Empire Center’s E.J. McMahon put it — “among the least surprising” rulings of the year. The suit, after all, was patently bogus from the start. “The cap, like any federal tax provision, will affect . . . some states more than others,” noted Judge Paul Oetken. States make their tax decisions within the context of federal law. That is, state taxes are up to the states themselves, and they have no right to expect federal law to accommodate them — with a full federal deduction — just because they opt for high taxes.\n\nThat’s going to leave a mark, at least rhetorically. Expecting every change in the tax code to impact each state equally when there are such wild variations in incomes and tax rates would be an impossibly high bar for the federal government to meet. And as the Post goes on to point out, the reason this is an issue at all is that New York’s taxes are so high.\n\nCuomo ran campaigns complaining about the state’s high taxes, but after almost nine years in office, he’s done nothing about it. As an example, he only recently extended the supposedly “temporary” millionaire’s tax in the Empire State for another five years. If he’s worried about high earners blowing far past the SALT cap, perhaps he should tax them less.\n\nI’ve brought this up before in the context of this story, but it’s worth asking again. Why is Cuomo, a Democrat, fighting so hard to make sure the wealthiest people don’t pay more in taxes? Don’t the Democrats want to tax the rich for all they’re worth? Or is that only at the federal level where they won’t feel the backlash so much?\n\nIn any event, the SALT caps aren’t a loser for Trump and the Republicans. It was one of the few avenues available to balance out some of the lost revenue for the federal government. And in order to lose out on any serious amount of deductions from your state and local taxes in New York, you would need to be making well over $225K per year. Rank and file voters aren’t losing much sleep over that, I assure you.", "description": "So much for that", "authors": ["Jazz Shaw", "Karen Townsend", "Ed Morrissey", "John Sexton"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/01/AndrewCuomo.jpg"}