{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7606715/How-39-desperate-stowaway-migrants-locked-metal-coffin-left-die.html", "downloaded_at": "2019-10-24 02:39:47.283972+00:00", "title": "How 39 desperate stowaway migrants were locked in their metal coffin and left to die", "language": "en", "text": "Advertisement\n\nThe 39 migrants, locked inside a bitterly cold and airless shipping container, never stood a chance – their cries for help fading away with no one to hear them.\n\nThe stowaways – 38 adults and one teenager – slowly froze to death in 'absolutely horrendous' conditions after they tried to reach the UK on a cargo ferry from Belgium, it is feared.\n\nExperts yesterday said the temperature inside the refrigerated trailer unit, which is said to usually carry biscuits, might have been as low as -25C (-13F).\n\nThe migrants were huddled inside for at least 15 hours by the time the door was opened on an industrial estate in Essex at 1.40am yesterday.\n\nIn reality, they could have been inside their metal coffin for much longer.\n\nAlthough paramedics reached the scene minutes after being called out, all they found was a pile of bodies.\n\nThe 39 desperate stowaway migrants were locked up in the trailer (above). It is unclear how long they had been in there for\n\nMo Robinson is the truck driver arrested after 39 people were found dead in the back of a lorry he was driving\n\nRobinson was pictured posing in front of a truck wearing a cowboy hat and a drink in hand (left), and also previously larking with police (right)\n\nForensic officers (pictured above) were pictured doing a full sweep of the vehicle after the discovery was made in Essex\n\nEssex police began a murder inquiry yesterday as they attempted to establish who the migrants were and which country they had travelled from.\n\nLike thousands of others before them, the group are thought to have sneaked inside the container at the busy Belgian shipping port of Zeebrugge, where row after row of rectangular metal containers are lined up ready to be transported to the UK.\n\nPolice are trying to establish when the group got inside and if smugglers found the container for them and then locked the door behind them.\n\nThe container was placed on a cargo ship on Tuesday, which then set sail around 2pm. The choppy Channel crossing took around ten hours before the ship docked at the Essex port of Purfleet on the Thames at 12.30am yesterday.\n\nFinal journey: How the 39 tragic migrants ended up in Purfleet, Essex, dead in the back of a refrigerated biscuit lorry\n\nThe lorry was captured at around 1.24am driving down Motherwell Way and a murder investigation has now been launched\n\nRobinson arrived in the UK at the weekend. He picked up the trailer, which had been shipped from Zeebrugge to Purfleet, yesterday evening. Minutes later, he pulled into the Essex industrial estate and the alarm was raised\n\nPolice officers bowed their heads as the truck passed. Detectives have begun the process of trying to identify 39 bodies found in a lorry on an industrial estate in Essex\n\nPolice officers were shown to be lined up next to the lorry today and bowed their head in respect for those who had died in the tragedy\n\nToday officers were pictured bowing their heads after the discovery. As locals claimed there had been reports of people climbing out of lorries\n\nA border force lorry arrives at the Port of Tilbury in Essex where the lorry that 39 bodies were found inside has been moved to\n\nRichard Burnett, chief executive of the Road Haulage Association, said those inside would have frozen to death in horrendous conditions if the refrigeration had been switched on.\n\nWere warnings ignored? Police told ministers three years ago about Purfleet risks by Mario Ledwith for the Daily Mail Ministers were warned three years ago about the port where 39 bodies were found in a lorry yesterday. The National Crime Agency said people-smugglers were switching to Purfleet because it was 'less busy' than other UK entry points. The bodies were found in a refrigerated shipping container that came through the Essex port. It was picked up by a lorry and was parked on an industrial estate when police and paramedics arrived in the early hours to find a scene of horror. Police and the NCA have started a massive hunt for the people smugglers behind the tragedy. Robinson, 25, from County Armagh in Northern Ireland, was being questioned by officers. The incident raises questions about border checks and whether the authorities have done enough to tackle trafficking gangs. The NCA had warned in 2016 that smugglers were turning their attention to 'less busy' ports in Britain. Its report even named Purfleet as a target. It said gangs were being 'displaced' from northern France because of tighter security there. This May the NCA warned that Belgian ports such as Zeebrugge were becoming people-smuggling hotspots. An earlier report from the Border Force also said Zeebrugge was a key concern. Tim Loughton, a Tory MP who sits on the Commons home affairs committee, said: 'We need the authorities in Britain and Belgium to urgently step up security measures to ensure that people traffickers are not going to profit from human misery. This is a human tragedy on a massive scale which raises serious questions about how human trafficking may have moved north from France.'\n\n'It's going to be dark and if the fridge is running it's going to be incredibly cold,' he said.\n\n'The only place to go to the toilet is inside the container. You can imagine if they've been in there for days it would be pretty grim.'\n\nOn Tuesday night trucker Maurice 'Mo' Robinson, 25, was waiting inside his purple lorry cab at Purfleet docks for the container to be unloaded from the ship.\n\nThe self-employed haulier, who lives in the Northern Irish village of Laurelvale in County Armagh, drove out of the port 35 minutes later with it attached to his lorry.\n\nHe drove his Scania truck one mile to an industrial estate in Grays, Essex, where he arrived at 1.10am yesterday.\n\nCCTV footage has emerged of the lorry driving towards the Waterglade Industrial Park minutes before the shocking discovery inside the container.\n\nAn ambulance control room then received a 999 call informing them of the bodies in the container. Last night police would not reveal if this call was made by Mr Robinson. The East of England Ambulance Service were the first to arrive. Five ambulances, hazardous area response teams and a car from the Essex and Herts Air Ambulance were all dispatched. Essex Police were then called. Minutes later, they arrested Mr Robinson on suspicion of murder.\n\nHe remained in police custody last night. Officers are trying to establish if he knew whether the migrants were inside.\n\nThe container was removed from the scene yesterday afternoon, with the 39 victims still inside. As it was driven away to a secure location with a police escort, other officers bowed their heads. Last night Mr Robinson's shaken brother said the family had not heard from him and 'don't know what is going on'.\n\nMr Robinson, who is pictured on social media with a Loyalist flag, is understood to have left the £300,000 home he shares with his pregnant girlfriend – who is said to be expecting twins – on Saturday morning.\n\nHe is thought to have driven his lorry cab to Dublin where he drove on to a ferry bound for Holyhead in Wales. Police yesterday confirmed that his lorry arrived on the mainland on Saturday.\n\nHauliers who exploit the Bulgaria connection By Mario Ledwith for the Daily Mail Haulage operators in the UK and Ireland are setting up their companies in Bulgaria to take advantage of tax breaks. It was initially feared that the lorry involved in yesterday’s tragedy had travelled from the eastern European country. But Bulgaria’s prime minister Boyko Borissov yesterday insisted it had simply been registered in the country by an Irish woman in 2017 and had not returned since then. The practice of setting up haulage companies in Bulgaria has become increasingly popular, with legal firms and online message boards filled with advice about how to do so. EU rules allow British and Irish firms to register there while operating across the bloc, with companies attracted by the country’s 10 per cent corporation tax. Haulage firms can also take advantage of a quick registration process with low administration fees, while costs to run a company are significantly cheaper. New companies require a Bulgarian-registered haulage manager to oversee the firm in order to become established, but legal organisations online claim they can provide such people. Drivers can then operate across the EU using a ‘community licence’ for international road haulage. Bulgaria’s land border with Turkey made it one of the main gateways into Europe from Africa and the Middle East during the migration crisis. But a number of measures, including the creation of a razor-wire fence on the border, increased patrols and the signing of an accord with Turkey, have significantly limited the number of migrants using it as a gateway since 2015. Since the start of the year, 1,742 people have applied for asylum in Bulgaria, compared to 19,480 in 2016. The staunch anti-immigration stance of Bulgaria’s government and reinforced border security has further limited accessibility, although it remains difficult to determine exact figures for illegal entry. Once inside Bulgaria, migrants often make contact with smuggling gangs and are shipped towards western Europe. n In the wake of the Essex tragedy, Channel 4 has postponed a new show in which Britons without passports try to smuggle themselves into the UK. The first episode of Smuggled was due to be broadcast next Monday night but will now be replaced.\n\nIt is not known what Mr Robinson did on Sunday, Monday and Tuesday before picking up the container at Purfleet in the early hours of yesterday but at some point he drove the 300 miles to Essex before collecting the container.\n\nHis lorry cab is adorned with Celtic harps and the world 'Ireland' on the windscreen. Beneath it the phrase 'the ultimate dream' has been attached, with a dream catcher hanging inside the cab.\n\nHe regularly writes messages on Facebook and Instagram about his truck, referring to it as 'the Scandinavian Express' and 'the Polar Express'.\n\nHe is thought to rent it, rather than own it. The lorry carries Bulgarian number plates and is a left-hand drive.\n\nBulgarian public broadcaster BNR said the lorry was registered in that country on June 19, 2017, by an unnamed Irish woman. It left the Balkan country the next day and has not returned since, according to the Bulgarian authorities.\n\nLast night DUP councillor Paul Berry said Robinson's family have not been officially told that he has been arrested. 'I've spoken to the family a couple of times,' he said. 'At this stage they haven't been informed of anything – and the police don't have to in these circumstances. Obviously they [the family] are very distraught. His mother is incredibly distraught as well as his partner.\n\n'They are just waiting for news. People keep ringing them up and asking 'is it true?' but they just don't know.\n\n'They contacted police themselves but a sergeant said he couldn't tell them anything. It does seem unfair. The family at least should know that he has been arrested.'\n\nThe container in which the migrants died was rented by an Irish haulage firm called GTR on October 15 from its site in County Monaghan. It was rented for a week for £240.\n\nThe company said it was co-operating fully with the UK police. A spokesman said it was 'gutted' the trailer had been used in this way. There is no suggestion that GTR has any connection to the deaths of the migrants.\n\nThe industrial estate where the lorry was found today is close to the Dartford Crossing and is used as a stopping point for lorries travelling south to the Port of Dover and the Channel Tunnel.\n\nLithuanian lorry driver Tadas Cesnavicius, who works in the area, said: 'You see a lot of lorries coming in and out the area, but whether they have people inside who knows? It is terrible to hear it happened right in the next road.'\n\nAdditional reporting by Jim Norton and George Olding for the Daily Mail.\n\nWas Irish smuggling ring behind lorry deaths of 39 migrants? Police raid homes in Ulster as detectives quiz 25-year-old driver over frozen stowaway horror\n\nBy Terri-Ann Williams for MailOnline\n\nPolice in Northern Ireland raided two properties as detectives continue to quiz a 25-year-old driver following the discovery of 39 frozen migrants in the back of his lorry.\n\nSeveral officers were pictured outside two properties in the area of Co Armagh, after arresting lorry driver Mo Robinson, 25, from Portadown.\n\nDetectives are now looking into an Irish smuggling ring which has links to the Bulgarian city of Varna, where the truck is registered to.\n\nThe two searches are thought to be in relation to Robinson, however sources have now claimed that it is 'unlikely' that Robinson was aware of plans to smuggle people across the border.\n\nWith his help, detectives are now starting to piece together the fundamentals of the journey, in which the migrants ended up frozen in the back of a lorry coming into the UK.\n\nCCTV shows Robinson's truck driving into the industrial estate in Essex at 1.10am on Wednesday and police arrived around half an hour later. Neither the nationality of the victims, nor the origin of the container is currently known.\n\nThe truck was removed from the scene yesterday afternoon, with the 39 victims still believed to be inside, as police begin the process of identifying them.\n\nInvestigations are ongoing and the latest pictures showed two properties in Northern Ireland being raided by police.\n\nPolice are pictured outside a property in the Laurelvale area of Co Armagh in Northern Ireland after a murder investigation was launched\n\nOfficers were also seen outside this property in the Markethill area (above) as they continue to investigate those thought to be involved\n\nTwo officers were seen outside the property in Markethill after the arrest of local man Mo Robinson, 25\n\nWhile several officers raided a property in Laurelvale, others were also seen outside a property in the Markethill area, where a van had been parked outside.\n\nOther shots show the officers entering one of the properties and going inside.\n\nDetectives now say the refrigerated trailer containing the victims arrived at Purfleet from Zeebrugge in Belgium at around 12.30am on Wednesday while the front section known as the tractor came from Northern Ireland.\n\nThe lorry and trailer left the port shortly after 1.05am and officers were called around 30 minutes later after ambulance staff made the grim discovery at Waterglade Industrial Park in Eastern Avenue in nearby Grays.\n\nThe vehicle driver, named in reports as 25-year-old Mo Robinson from Portadown in Co Armagh, Northern Ireland, is being held by Essex police on suspicion of murder.\n\nThe city of Varna in Bulgaria where it has been reported that the lorry where 39 victims froze to death at Grays in Essex\n\nIt is believed that the driver may have alerted the authorities himself and sources close to the investigation last night told The Telegraph that it was 'unlikely' he had known about any plans to smuggle people.\n\nThis is while it was also discovered that the cab of the truck was registered in Bulgaria in 2017, by an Irish woman.\n\nBulgarian officials stated that the cab had not been back to the town of Varna for two years.\n\nThe area is prolific for its fuel and cigarette smuggling route with links to Irish republican gangs.\n\nThis is while the container has been linked to an Irish firm which is headquartered in Dublin, yet is registered in Northern Ireland.\n\nThe trailer is understood to be refrigerated, meaning temperatures inside could have been as low as -25C.\n\nDescribing the conditions inside, Road Haulage Association chief executive Richard Burnett said, if the was refrigerated was switched on, conditions inside would have been 'absolutely horrendous' and would kill anyone inside 'pretty quickly'.\n\nMr Burnett added: 'It's going to be dark. If the fridge is running it's going to be incredibly cold.\n\n'The only place to go to the toilet is on board the back of the trailer. You can imagine if they've been in there for days then there will be faeces, there will be urine.'\n\nThe deaths will lead to renewed calls for added checks on vehicles entering Britain through so-called 'soft spot' ports, with Border Force resources currently focused on Dover.\n\nSpeaking on Wednesday afternoon, Deputy Chief Constable Pippa Mills said: 'In order to ensure we maintain the dignity of the people who sadly lost their lives, we will be moving the lorry and the trailer shortly.'\n\nShe said they were being moved to nearby Tilbury Docks so the bodies can be recovered while preserving the dignity of the victims.\n\n'We are yet to identify them and must manage this sensitively with their families,' she added.\n\nHer comments come after politicians from all sides of the spectrum pledged to tackle the issues which had risen to the forefront of Prime Minister's Question's yesterday.\n\nJeremy Corbyn (pictured above) also reflected on the tragedy, branding it 'unbelievable' during Prime Minister's Questions\n\nPriti Patel (above) said she would be happy to engage in discussions with the Ministry of Justice following the tragedy\n\nBoris Johnson has said that people traffickers 'should be hunted down and brought to justice'. As Home Secretary Priti Patel has also pledged for tougher sentences for human traffickers.\n\nSpeaking at Prime Minister's Questions Mr Johnson said the situation was an 'unimaginable tragedy and truly heartbreaking'.\n\nPutting the Brexit crisis aside, he said the 'full force of the law' would come down on those responsible.\n\nHe added: 'I know that the thoughts and prayers of all members will be with those who lost their lives and their loved ones.\n\n'I'm receiving regular updates. The Home Office will work closely with Essex Police as we establish exactly what has happened.'\n\nLabour leader Jeremy Corbyn also reflected on the tragedy, branding it 'unbelievable'.\n\nHe said: 'Can we just think for a moment of what it must have been like for those 39 people, obviously in a desperate and dangerous situation, for their lives to end, suffocated to death in a container?'\n\nMs Patel also highlighted that she would be happy to engage in discussions with the Ministry of Justice in order to see what could be done about the situation.\n\nShe said that 'Home Office immigration officials will be working closely alongside them to establish how this horrific event came to happen.'\n\nAlp Mehmet, the chairman of the group Migration Watch UK, called on the government to better patrol Britain's borders to ensure such tragedies were not repeated.\n\nHe said: 'People-trafficking is a sickening business. It continues not only because the traffickers make huge amounts of money from it but are also often able to get away with it.\n\n'The risk is that more such tragedies will occur for so long as the UK fails to properly resource the border and return those who have no right to be here, which all but encourages traffickers to ply their trade by exploiting people who put their lives in their evil hands.'\n\nDespite the investigation being at an early stage and it being unclear where the victims died, the Joint Council for the Welfare of Immigrants has already blamed the British government.\n\nThe charity's chief executive Satbir Singh said: 'Nobody should be in any doubt that the ultimate responsibility for these deaths lies with government policy which has deliberately closed down safe and legal routes into Britain.'\n\nBulgarian foreign ministry spokesman Tsvetana Krasteva said: 'We are in contact with our embassy in London and with British authorities.'\n\nThe National Crime Agency (NCA) said: 'We are aware of this tragic incident which is now the subject of a murder investigation being led by Essex Police and we have deployed NCA officers to assist.\n\n'We are working with partners including Essex Police and Immigration Enforcement to provide specialist support to urgently identify and take action against any organised crime groups who might have played a role in causing these deaths.'\n\nIn 2015, 71 migrants, including eight women and four children, were found dead in the back of a Slovakian meat lorry which was abandoned truck on an Austrian motorway.\n\nThe industrial estate where the lorry was found on Wednesday is next to the Dartford Crossing and is used as a stopping point for lorries travelling south to the Port of Dover and the Channel Tunnel, although the planned route of the lorry involved is unknown.\n\nIt is the biggest disaster of its kind since 2000, when 58 Chinese stowaways died on a ferry from Belgium to Britain.", "description": "In May the National Crime Agency said gangs had turned their attention to Belgian ports after security was stepped up in France.", "authors": ["Arthur Martin And Mario Ledwith For The Daily Mail", "Terri-Ann Williams For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/22/20104592-0-image-a-24_1571866449748.jpg", "published_at": "2019-10-23"}