{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/29/home-office-failing-to-erase-gay-men-unfair-convictions-critics-say", "downloaded_at": "2019-09-29 23:32:08.890178+00:00", "title": "Home Office failing to erase gay men's unfair convictions, critics say", "language": "en", "text": "A Home Office scheme designed to wipe historical convictions for consensual gay sex from people’s records is failing to right past wrongs, critics have said, as it was revealed that fewer than 200 crimes have been deleted since it was introduced seven years ago.\n\nAlthough sex in private between two men aged over 21 was legalised in 1967, thousands of gay men continued to be convicted under laws against acts such as “buggery” and “soliciting”, which remained on the statute books until 2004.\n\nThe convictions have left many men feeling stigmatised and unable to get jobs that require a criminal record check, including work with children or vulnerable people. Even spent convictions for most sex offences show up in the checks system, known as the disclosure and barring service (DBS).\n\nA 2012 scheme, described by the government as an opportunity to “right a historic wrong”, enabled men with such convictions in England and Wales to apply to the Home Office to have their records permanently deleted. However, the scheme has been criticised for only including a limited number of offences.\n\n\n\nFigures released to the Guardian under freedom of information show the Home Office has so far only disregarded 189 convictions out of 663 submitted to the scheme, a success rate of 29%.\n\nCampaigners said the figures revealed an astonishingly low number of overall applications, as well as a “very depressing” success rate. They called on the government to widen the scope of the scheme to include more offences and to better publicise it.\n\nThe human rights campaigner Peter Tatchell said: “An estimated 100,000 men were convicted under anti-gay laws from 1885 to 2003, when homosexuality was finally fully decriminalised in England and Wales. Around 15,000 of these men are still alive.\n\n“Many of these men had their lives ruined. Not only did they carry the stigma of a criminal conviction but many were jailed and beaten. Some lost their homes, jobs, marriages and children. These men deserve compensation for their suffering but so far the government is refusing them recompense.\n\n“These statistics are very depressing. Only a tiny proportion of eligible men have applied and 71% of the convictions and cautions they applied to have disregarded have been rejected.”\n\nHe said the low application rate was probably also due to the government’s poor advertising of the disregard scheme, the limited number of offences covered by it and the fact that many older gay men who suffered at the hands of the state are still wary of engaging with it.\n\nUnder the Protection of Freedoms Act 2012, the home secretary was able to disregard convictions or cautions for an offence under a limited number of laws, including section 12 of the Sexual Offences Act 1956 (buggery) and section 13 of that act (gross indecency between men).\n\nOffences that were excluded include some for procuring under the 1967 sexual offences act, which criminalised aiding, abetting, inviting or facilitating homosexual acts, and soliciting and importing under the 1956 act, which criminalised meeting or chatting up men in a public place with the intent of seeking a sexual liaison.\n\nSex between women has never been specifically outlawed in the UK, though some gay women were victims of homophobic prosecutions for offences such as indecent assault.\n\nTerry Stewart, a 66-year-old living in London, was arrested after police followed him into a public toilet in 1981. It was 10.30am and Stewart says he had gone to wash oil from his broken bicycle chain off his hands. He was convicted of soliciting or importuning in a public place for an immoral purpose – an offence that was abolished in 2004 – and required to pay a £20 fine. The offence is among those that not eligible to be disregarded.\n\nStewart, who has worked as a community campaigner, said it was clear at the time that police were using such offences to persecute gay men. “During the course of the trial my defence barrister asked how many arrests the police had made of a similar nature and they said about 500,” he said.\n\nThe conviction meant he was unable to pursue a career in social work. “It’s had a hell of a strain on my health and wellbeing over the years, but I consider myself one of the lucky ones,” he said. “Lots of people who were faced with those convictions may have been married and in a family. Many committed suicide. It destroyed people’s lives.”\n\nFigures show that the Home Office found 474 convictions out of 663 submitted to the scheme were not eligible for deletion. Of those, 335 were described as “offences outside of the scope” of the act. Seventy-three of those were for sexual offences and 249 for non-sexual offences. The Home Office said these included deletion applications for convictions such as shoplifting and theft.\n\nOf the rejected applications, 92 were for sex in a public lavatory, which is still illegal. Paul Johnson, a professor of sociology at the University of York, said many men were convicted of offences in a public lavatory because that was where police went to catch gay men.\n\nHe said the Home Office should work to include additional offences within the disregard scheme, such as importuning, and deal with applications on a case-by-case basis. “Some of the cases are absolutely clear. They involve a man going up to an [undercover] police officer and asking if he wanted to go for a drink. Clearly on that basis you could grant that person a disregard,” he said.\n\nMichael Cashman, a founder of the LGBT rights charity Stonewall, said government ministers had promised in 2017 to look at expanding the scheme to include other offences, but the preoccupation with Brexit meant there was not the civil service capacity to do so.\n\n“I’ve given [the government] numerous examples of people who are currently being prevented from changing their occupation or going for the occupation they want because their criminal record prevents them from doing so,” Lord Cashman said.\n\nStephen Close, a 58-year-old from Salford, has successfully had a historical offence disregarded. He was convicted of gross indecency in 1983 aged 20 after having a sexual relationship with another man in the army.\n\nClose was court martialled, discharged with disgrace and sentenced to six months in jail. He said the conviction had followed him all his life. “I’ve been sacked from jobs because I haven’t disclosed [my conviction],” he said. “So I just tended to look for jobs where I thought they weren’t going to do a criminal record check on me. I was just looking at cleaning and bar work and things like that.”\n\nHis conviction was deleted in 2013 and he now works for a housing association, a job he could not have got with the conviction still on his record.\n\nA Home Office spokesperson said: “The government made it possible for men with eligible historical convictions for decriminalised behaviours to apply to have their convictions disregarded. Those who have their convictions disregarded are also automatically pardoned for the offence.”", "description": "Scheme introduced in 2012 has wiped fewer than 200 historical offences from criminal records", "authors": ["Frances Perraudin", "Hannah Jane Parkinson", "Amelia Abraham"], "top_image": "https://i.guim.co.uk/img/media/e2a9108f2a730953fe8342069e5ea445292e84f7/292_706_6290_3774/master/6290.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=36d2787b304a6ada5ac134b8b130d308", "published_at": "2019-09-29"}