{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/11/1928768/0/en/Canoe-EIT-Income-Fund-Announces-2019-Voluntary-Cash-Redemption.html", "downloaded_at": "2019-10-11 19:36:24.498035+00:00", "title": "Canoe EIT Income Fund Announces 2019 Voluntary Cash Redemption", "language": "en", "text": "CALGARY, Alberta, Oct. 11, 2019 (GLOBE NEWSWIRE) -- Canoe EIT Income Fund (“Canoe” or the “Fund”)(TSX - EIT.UN) today announced the 2019 voluntary cash redemption.\n\n\n\nVoluntary Annual Cash Redemption\n\nThe redemption date for the Fund’s annual voluntary cash redemption will be December 9, 2019. Unitholders are entitled to redeem units of the Fund at a price equal to 95% of the Average Net Asset Value (NAV) of the three trading days preceding the December 9, 2019 redemption date, less direct costs. Direct costs are expected to be less than 1%. If all redemption requests exceed 10% of the aggregate outstanding units of the Fund on November 15, 2019, the final day to submit units for redemption, the Fund will process redemptions to this maximum on a pro-rata basis based on the total number of units tendered. Payment for units that have been tendered and accepted for redemption will be made on or before January 2, 2020.\n\nUnitholders wishing to redeem their units must provide notice of their intent to do so with their investment advisor or brokerage office no later than November 15, 2019. Please note that investment firms may impose an earlier deadline in order to facilitate the processing of redemption requests. Unitholders are strongly urged to consult their investment advisor or brokerage office directly to confirm their internal deadlines. Registered unitholders (those who hold a physical share certificate in their name) should contact the Fund’s transfer agent, Alliance Trust Company, at 403-237-6111 to redeem their units. Units that have been submitted for redemption will remain eligible for the October 2019 and November 2019 distributions, which are paid in November 2019 and December 2019, respectively.\n\nPlease note that any redemption requests made by non-resident unitholders may be subject to withholding tax.\n\nKey Dates:\n\nOctober 11 - November 15, 2019 Unitholders may tender units for redemption December 4, 5 & 6, 2019 Redemption price determined based on average NAV of these trading days December 9, 2019 Redemption date January 2, 2020 Payment of redemption proceeds on or before this date\n\nAbout Canoe EIT Income Fund\n\nOne of Canada’s largest closed-end investment funds, designed to maximize monthly distributions and capital appreciation by investing in a broadly diversified portfolio of high quality securities. The Fund is listed on the TSX under the symbol EIT.UN and is actively managed by Robert Taylor, Senior Vice President and Portfolio Manager of Canoe Financial.\n\nAbout Canoe Financial\n\nCanoe is one of Canada’s fastest growing independent mutual fund companies managing over $5.8 billion in assets across a diversified range of award-winning mutual funds and private energy equity products. Founded in 2008, Canoe Financial LP is an employee-owned investment management firm focused on building financial wealth for Canadians. Canoe has offices in Calgary, Toronto, Vancouver, Winnipeg, Ottawa and Montreal.\n\nFor further information, please contact:\n\nInvestor Relations\n\n1–877–434–2796\n\nwww.canoefinancial.com\n\ninfo@canoefinancial.com", "description": "", "authors": ["Canoe Eit Income Fund"], "top_image": "http://www.globenewswire.com/Attachment/LogoDisplay/485442?filename=485442.jpg&size=1", "published_at": "2019-10-11"}