{"pub": "yahoo", "url": "https://news.yahoo.com/u-online-brokers-still-profiting-152615301.html", "downloaded_at": "2019-10-09 00:43:10.929823+00:00", "title": "U.S. online brokers still profiting from 'dumb money'", "language": "en", "text": "FILE PHOTO: U.S. one hundred dollar notes are seen in this picture illustration taken in Seoul\n\nBy John McCrank\n\nNEW YORK (Reuters) - People who trade stocks online cheered last week when several large retail brokers slashed stock-trading commissions to zero, a move made possible, in part, by a controversial source of broker revenue that has drawn regulatory scrutiny.\n\nCharles Schwab Corp, TD Ameritrade Holding Corp and E*Trade Financial Corp followed the lead of Interactive Brokers in eliminating stock and exchange-traded fund trading commissions, sending their share prices tumbling on the revenue they were giving up.\n\nBut the brokers have other ways of profiting from retail trading, including interest earned on customer cash balances and margin lending.\n\nThere is also payment for order flow, in which wholesale market makers, like Citadel Securities or Virtu Financial pay for the first crack at executing a stock order. They then execute the transaction, either internally, in other off-exchange trading venues, or on an exchange.\n\nThe practice has drawn scrutiny from regulators globally because it creates an incentive for brokers to send orders to whoever pays the most, rather than the place that might get the best outcome for customers.\n\nStill, the practice is common among retail brokerages where \"mom-and-pop\" investors place their orders, making up around 20 percent of all U.S. trading activity. Very few of their stock orders ever go directly to an exchange like Intercontinental Exchange Inc's New York Stock Exchange or Nasdaq Inc.\n\nCanada has banned the practice. The United Kingdom recently put it under review and said in September that nearly all UK-based brokerages acting in an agency capacity had stopped accepting payment for order flow.\n\nFor their part, market makers say they give, on average, a better price than the market is offering, usually a fraction of a penny per share. Retail brokers say they use the additional revenue to improve technology and lower customer costs.\n\nWhen market makers execute orders, they collect the spread between the bid and the offer, which they divide between payment for order flow for the broker, price improvement for the retail trader, and profit, said Richard Repetto, an analyst at Sandler O'Neill + Partners.\n\nProfessional traders covet retail orders because unlike large institutional investors with large portfolios and orders that are big enough to move the market, retail investors tend to be less informed as to which way a stock is likely to be moving and their orders are generally smaller. In trading circles, this is known as \"dumb money.\"\n\nPrior to launching its free trading service, IBKR Lite, last Monday, Interactive Brokers did not accept payment for order flow. Users of the company's IBKR Pro service will still pay to trade and their orders will routed to the market where they will get the best execution, instead of being sold.\n\nThomas Peterffy, chairman of Greenwich, Connecticut-based Interactive Brokers, said he thought the conflict in payment for order flow is not so much between broker and customers as between the market makers who buy the order flow and the prices at which they execute the orders.\n\n\"The better the execution price the less money the market maker earns,\" he said in an email. \"But this has been the story forever on Wall Street. This is how the large investment banks make about $250 billion per year. They call it 'trading profits.'\"\n\nOnline brokers have U.S. Securities and Exchange Commission-mandated \"best execution committees\" to ensure that all of their trades are executed inside the national best bid and offer and that the market makers that provide the most price improvement get majority of the order flow, he added.\n\nSchwab and TD Ameritrade also said in statements that getting customers the best execution possible is a top priority.\n\nVirtu and Citadel Securities declined to comment.\n\nFor its part, the SEC adopted rules last November that will force brokers to disclose more about any payment for order flow or profit-sharing relationships in quarterly public disclosures. But the SEC delayed the compliance date twice after brokers said they needed more time to make changes to their electronic order routing systems to track the orders. The disclosure rules are now set to take effect in 2020.\n\nBrett Redfearn, the SEC's director of trading and markets, said in March that enhanced disclosures would \"enable greater transparency into any potential trade-offs being made between payment for order flow and execution quality.\"", "description": "People who trade stocks online cheered last week when several large retail brokers slashed stock-trading commissions to zero, a move made possible, in part, by a controversial source of broker revenue that has drawn regulatory scrutiny.  Charles Schwab Corp, TD Ameritrade Holding Corp and E*Trade Financial", "authors": ["John Mccrank"], "top_image": "https://s.yimg.com/uu/api/res/1.2/yFWFg5Okr8y7yrtAMwoOQA--~B/aD0yNzc7dz00NDk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/9e734d3b6e1875d18b3631b7c6ed0523", "published_at": "2019-10-08"}