{"pub": "businessinsider", "url": "https://businessinsider.com/which-states-have-the-worst-roads-in-the-united-states-2019-9", "downloaded_at": "2019-09-26 20:55:07.964252+00:00", "title": "Rhode Island has the United States' worst roads — here's how other states rank", "language": "en", "text": "The United States' infrastructure isn't in great shape.\n\nNot all states are created equal, though: Rhode Island, Oklahoma, and West Virginia rank the top three worst when it comes to maintenance.\n\nQuoteWizard analyzed federal highway data to determine where infrastructure was fairing the worst — and at what cost to taxpayers.\n\nVisit Business Insider's homepage for more stories.\n\nIt's no secret that America's roads and bridges are crumbling.\n\nIn its most recent \"infrastructure report card,\" the American Society of Civil Engineers graded the United States' physical infrastructure — everything from tunnels, roads, bridges, electrical grid, and more — as a D+.\n\nIn other words, the country's physical underpinning could barely pass high school.\n\nOf course, with so much of that network's maintenance spread out over 50 constituent states of the republic, not all areas are created equal. QuoteWizard, an auto insurance tool created by Lending Tree, combed through the Federal Highway Administration's data to rank the states on three categories: the fraction of roads that were in poor condition, the number of bridges that were deemed \"structurally deficient\", and how much the state spends on road repairs.\n\n\"Taxpayer funded highway capital delegated for states to maintain roads isn't enough to cover necessary repairs,\" the team behind the analysis said.\n\n\"Many states are spending the majority of their highway capital on expansion instead of maintenance of roads. At this rate, it becomes a never ending game of maintenance catch up. On top of taxpayer dollars, it's estimated that driving on roads in poor condition costs motorists $120 billion in vehicle repairs and operating costs. That's $533 per driver.\"\n\nHere's where they found the state of repairs to be the worst:", "description": "Oklahoma, West Virginia, and Mississippi aren't faring much better, a study of Federal highways data shows.", "authors": ["Graham Rapier"], "top_image": "https://image.businessinsider.com/5d8d1a102e22af0bc83c9bf0?width=1200&format=jpeg", "published_at": "2019-09-26"}