{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/18/sean-hannity-lashes-out-at-idiotic-mick-mulvaney-o", "downloaded_at": "2019-10-19 11:07:36.549479+00:00", "title": "Sean Hannity lashes out at 'idiotic' Mick Mulvaney over Ukraine remarks", "language": "en", "text": "Fox News host Sean Hannity slammed Mick Mulvaney, President Trump’s acting chief of staff, after he admitted the administration conditionally withheld military aid from Ukraine.\n\n“What is Mulvaney even talking about? I just think he’s dumb, I really do. I don’t even think he knows what he’s talking about. That’s my take on it,” the conservative commentator said Thursday.\n\nMr. Hannity lodged the criticism on his syndicated radio program on the heels of Mr. Mulvaney discussing the administration’s dealing with Ukraine during a White House briefing.\n\nSpeaker to reporters earlier Thursday, Mr. Mulvaney suggested the White House withheld aid from Ukraine in connection with Mr. Trump requesting that Kyiv investigate the Democratic National Committee and the 2016 U.S. presidential race, giving credence to claims of a quid pro quo at the heart of impeachment proceedings underway on Capitol Hill.\n\nDemocrats launched an impeachment inquiry into Mr. Trump last month after his administration tried to keep Congress from viewing a whistleblower complaint filed by a member of the U.S. intelligence community. The White House later released a rough transcript of a July phone call that sparked the complaint, and it showed that Mr. Trump asked his Ukrainian counterpart to investigate 2020 presidential candidate Joseph R. Biden and Crowdstrike, a cybersecurity firm hired by the DNC after Democrats were hacked by Russians in 2016.\n\n“The look back to what happened in 2016 certainly was part of the things that he was worried about in corruption with that nation. And that is absolutely appropriate,” Mr. Mulvaney told reporters.\n\nDemocrats leading the impeachment push were quick to pounce on the comments as evidence of a quid pro quo, resulting in Mr. Mulvany trying to walk back his remarks later Thursday.\n\n“I think, some of these people are so stupid,” Mr. Hannity said in the interim. “Read the transcript. We don’t need a non-whistleblower whistleblower. You don’t need a chief of staff’s idiotic interpretation of things, when the president and the president of Ukraine and everybody else can read it all themselves. That’s what’s amazing.”\n\nMr. Hannity, 57, has previously claimed to be the president’s strongest supporter at Fox News. Mr. Trump, on his part, has previously linked Mr. Hannity’s glowing coverage of his administration to high ratings, meanwhile.\n\nMr. Hannity’s remarks about Mr. Mulvaney was first reported by Media Matters for America.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Fox News host Sean Hannity slammed Mick Mulvaney, President Trump's acting chief of staff, after he admitted the administration conditionally withheld military aid from Ukraine.", "authors": ["The Washington Times Http", "Andrew Blake"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2018/12/26/AP_18360512439215_c0-0-4130-2409_s1200x700.jpg?af8c3ca95384744bfd6de9a1d91dc27fc50865cd", "published_at": "2019-10-18"}