{"pub": "cnn", "url": "https://cnn.com/2019/10/08/investing/dow-stock-market-trade-today/index.html", "downloaded_at": "2019-10-08 14:59:00.023503+00:00", "title": "Dow falls 300 points as trade worries resurface", "language": "en", "text": "New York (CNN Business) The Dow and broader stock market fell on Tuesday as worries about trade tensions between the United States and China are weighing on the market.\n\nAmerican and Chinese officials are returning to the negotiating table this week in Washington, but investors are pessimistic about their chances of reaching a deal.\n\nOvershadowing the get-together in Washington is a blacklist of 28 Chinese organizations . America has effectively barred those blacklisted companies from importing US technology because of their alleged roles in facilitating human right abuses in China's Xinjiang region.\n\nInvestors are awaiting potential retaliation from Beijing.\n\nThedropped about 300 points, or 1.1%, while thefell 1.3%. Not a single Dow stock was in the green mid-morning.\n\nNasdaq Composite COMP The tech-heavytraded 1.5% lower.\n\nStocks closed lower on Monday, following a rather uneventful trading day. It was the market's first down day in three session.\n\nThe 10-year Treasury yield is lower at 1.5153%, as the demand for safe-haven bonds is on the rise thanks to the trade uncertainty. Yields and prices move opposite one another.\n\nTrade is keeping investors on their toes. Not even 24 hours after President Donald Trump signed a trade deal with Japan, and a week after the United States slapped import tariffs on the European Union over subsidies for Airbus, there is little indication how it will all play out.\n\nThis uncertainty is weighing on business sentiment.\n\nThe NFIB small business survey showed optimism fell for a second month in a row in September, though remaining relatively high on the whole. The uncertainty index in the survey also rose.\n\nIn economic data, the producer price index for September slipped to 1.4% year-over-year, compared with 1.8% expected. Stripping out the volatile food and energy component, the core PPI fell to 2% year-over-year, versus 2.3% expected. That inflation rate is roughly in the target range for the Federal Reserve.\n\n\"The decline in core producer prices in September was driven mainly by the volatile trade, trasnport and warehousing services components, but the big picture is that domestically-generated inflationary pressures remain fairly subdued,\" wrote Andrew Hunter, senior US economitst at Capital Economics.\n\nAll this comes ahead of the consumer price inflation read on Thursday, which is expected at 1.8%, according to economists polled by Refinitiv.", "description": "The Dow and broader stock market fell on Tuesday as worries about trade tensions between the United States and China are weighing on the market.", "authors": ["Anneken Tappe", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191008080706-01-nyse-1003-super-tease.jpg", "published_at": "2019-10-08"}