{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/3/nancy-pelosi-impeachment-inquiry-faces-legal-chall", "downloaded_at": "2019-10-04 01:22:12.049882+00:00", "published_at": "2019-10-03", "title": "Pelosi faces serious legal challenges to 'casual' impeachment inquiry", "language": "en", "text": "House Speaker Nancy Pelosi’s declaration of an impeachment inquiry is barely a week old, and it’s already running into serious challenges on the legal front.\n\nA top Republican told a federal judge Thursday that Mrs. Pelosi’s move is only words and carries no real weight. It can’t for example, unlock secret grand jury information, said Rep. Doug Collins, the ranking Republican on the House Judiciary Committee.\n\nWorse yet, said House Minority Leader Kevin McCarthy, Mrs. Pelosi has yet to lay out any of the ground rules for impeachment.\n\nHe said until Democrats come up with a plan for calling witnesses, allowing access to evidence and giving President Trump’s lawyers the ability to be part of the proceedings, there can’t be a fair impeachment inquiry.\n\nEven Congress’s own legal team at the Congressional Research Service said Mrs. Pelosi is trodding new ground in pursuing an impeachment path without getting the entire House on record and laying out clear rules of the road.\n\n“If the House takes no new action on authorizing the investigation, the speaker’s statement that the House is launching an ‘official impeachment inquiry’ is unlikely to put to rest the debate,” CRS analysts said in a legal memo this week.\n\nMrs. Pelosi last week reversed her longstanding reluctance to pursue impeachment and unilaterally declared that six House committees were now engaged in an inquiry that could lead to articles of impeachment.\n\nThe trigger, she said, was Mr. Trump’s revelation that he asked Ukraine to investigate one of his political opponents, former Vice President Joseph R. Biden.\n\nOn Thursday, Mrs. Pelosi rejected the suggestion that she needs to ask the full House to vote, saying her word is good enough.\n\n“The existing rules of the House provide House committees with full authority to conduct investigations for all matters under their jurisdiction, including impeachment investigations,” she said in a letter to Mr. McCarthy.\n\n“There is no requirement under the Constitution, under House rules, or House precedent that the whole House vote before proceeding with an impeachment inquiry,” she said.\n\nLaw professors said she may be right.\n\nThe Constitution says little about how impeachment takes place, only that the actual act of impeaching requires a vote. But there is no guidance on how to get to that point, and the Constitution gives both chambers the power to set their own rules.\n\nJonathan Turley, a law professor at George Washington University who was on the legal team during a 2010 impeachment trial of a federal judge, said courts may not appreciate Mrs. Pelosi’s approach, which he said was “casual to the point of being conversational.”\n\nBut he also said a judge is not likely to want to peer too deeply into House procedures.\n\n“A court will make this inquiry and I expect the court is going to ask what determines that a formal impeachment investigation has begun,” he said. “I don’t think the court’s going to be delighted with the informality of the process thus far by the Democratic majority. But that does not mean they’re going to lose.\n\n“Courts have historically avoided dictating the procedures of the House,” he added.\n\nIt turns out that quite a bit is riding on the question of whether an impeachment process is underway or not.\n\nThe Congressional Research Service said committees’ ability to compel evidence is stronger if impeachment is at stake.\n\nPast presidents have voluntarily turned over confidential communications, and an impeachment inquiry could even pierce the veil of secrecy that usually protects grand jury information from release.\n\nThat’s the issue in the case Mr. Collins, the top Judiciary Committee Republican, weighed in on Thursday.\n\nJudiciary Chairman Jerrold Nadler has demanded the courts let him see grand jury information gathered by special counsel Robert Mueller’s investigation into Russian election meddling and Mr. Trump’s behavior surrounding the 2016 election.\n\nHe’s been arguing for months to the court that he has been engaged in an impeachment inquiry.\n\nThe government had responded by pointing to Mrs. Pelosi’s own words that the House wasn’t pursuing impeachment.\n\nMr. Turley said Mrs. Pelosi’s reversal last week may have been an effort to fix that problem and give new legal heft to Mr. Nadler’s argument.\n\nMr. Collins, in his brief to the federal district court in Washington, said that’s not good enough.\n\n“An impeachment inquiry was authorized, in explicit terms, by the full House in the two previous cases where presidents were impeached,” Mr. Collins wrote in his brief. “Indeed, in the [Judiciary] Committee’s 206-year history, the committee has never reported articles of impeachment against a president without first conducting an impeachment proceeding authorized by a full House vote.”\n\nMr. McCarthy, in his letter to Mrs. Pelosi, went further.\n\nHe said those impeachment inquiries had rules to make them fair for the president as well as Congress, including giving the president’s lawyers the right to offer evidence and the right to cross-examine witnesses; to give subpoena powers to the minority party as well as the chairman; and to hold a specific vote authorizing the process.\n\n“If you are indeed sincere about overseeing a fair and objective process, meet the standards of your predecessors by establishing the procedures outlined above. Otherwise, I must again insist that you suspend all efforts surrounding your impeachment inquiry,” the California Republican wrote.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "House Speaker Nancy Pelosi's declaration of an impeachment inquiry is barely a week old, and it's already running into serious challenges on the legal front.", "authors": ["The Washington Times Http", "Stephen Dinan"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/03/Nancy_Pelosi_Florida_14002.jpg-3244e_c0-0-5472-3190_s1770x1032.jpg?84283544d3cc688d49296344fdb2455c1a0f271f"}