{"pub": "yahoo", "url": "https://sports.yahoo.com/book-throws-5-tds-no-7-notre-dame-222321420--ncaaf.html", "downloaded_at": "2019-09-15 00:22:01.181116+00:00", "title": "Book throws for 5 TDs as No. 7 Notre Dame routs New Mexico", "language": "en", "text": "Book throws for 5 TDs as No. 7 Notre Dame routs New Mexico Notre Dame quarterback Ian Book throws in the first half of an NCAA college football game against New Mexico in South Bend, Ind., Saturday, Sept. 14, 2019. (AP Photo/Paul Sancya)\n\nSOUTH BEND, Ind. (AP) -- Ian Book and No. 7 Notre Dame got some kinks out Saturday against New Mexico and now have No. 3 Georgia on their minds.\n\n''It felt good to get in a rhythm at Louisville . and in this game,'' Book said after throwing a career-high five touchdown passes and adding another rushing TD in a 66-14 rout of the Lobos in the home opener.\n\nThe senior quarterback rebounded from a lackluster opening performance in a 35-17 victory at Louisville to complete 15 of 24 passes for 360 yards against New Mexico. Book finished with another 46 yards rushing yards before sitting the final 1 1/2 quarters.\n\nScroll to continue with content Ad\n\n''To come in here and get the win that we wanted felt really good,'' Book said. ''We'll enjoy it tonight and once tomorrow hits it's Georgia week and everyone knows that.''\n\nNotre Dame coach Brian Kelly couldn't agree more.\n\n''To get this game under our belts going into Georgia was really big for us,'' Kelly said.\n\nThe Fighting Irish (2-0) had their way with the Lobos (1-1), who were without head coach Bob Davie. Saga Tuitele acted as head coach for Davie, the former Irish head coach from 1997-2001 who was hospitalized following New Mexico's opening victory Aug. 31 against Sam Houston State and did not make the trip.\n\n''When you turn the ball over and give anybody a chance, it's going to be a tough uphill swing,'' Tuitele said. ''Against a good team like that, it could've gotten uglier, but our kids fought our tails off. They didn't give in.''\n\nThe Irish had three first-half interceptions, including one returned for a touchdown by freshman Kyle Hamilton.\n\nNotre Dame finished with 591 total yards to 363 by New Mexico, which got touchdown runs by Bryson Carroll (47 yards) and Bobby Cole (37). The Lobos outrushed the Irish 212-157.\n\nStory continues\n\n''I think we needed this game to find some of the right pieces that are going to be needed to make explosive plays,'' Kelly said. ''You're not going to beat Georgia by just 3 yards here, 4 yards. You're going to have to make some explosive plays. We needed to see that happen today.''\n\nThree of Book's ''long'' scoring passes were short throws that receivers turned into big plays. Avery Davis went 59 yards, Javon McKinley went 65 and Chris Finke had a 54-yarder. The touchdowns by Davis and Finke came on shovel passes while McKinley turned a 3-yard cross into his score.\n\nMcKinley added another TD on a 20-yard scoring reception in the third quarter after Chase Claypool had a 37-yard TD reception in Notre Dame's 31-point second quarter.\n\n''We were able to make the big play when we needed it,'' Book said. ''I thought we might have started a little slow in the beginning, but you saw we were able to pick it up as the game went on.''\n\nTHE TAKEAWAY\n\nNew Mexico: The Lobos struggled offensively in the first half, gaining just 80 yards on 35 plays in their seven possessions before going 75 yards on five plays, three of them rushes, the last being Carroll's 47-yard TD run. Starting quarterback Sheriron Jones, who was 4-of-15 passing for 19 yards with three interceptions in the first half, was replaced by sophomore Tevaka Tuioti at the start of the second half.\n\nTuioti completed 6-of-13 passes for 132 yards before being relieved by freshman Trae Hall late. Tuitele wasn't going to say if Tuioti's performance was enough to get him the starting nod next week against New Mexico State.\n\nNotre Dame: The Irish were outgained 136-54 on the ground in the first half. Book threw for 251 yards and three touchdowns as offensive coordinator Chip Long had the Irish senior throwing from the start to build his confidence for next Saturday night's rumble between the hedges in Athens.\n\n''From an offensive line standpoint, could we have done better today?'' Kelly said. ''Yeah, probably. But they weren't going to let us run the ball up inside so we had to move on to some other things we do. That's the nature of college football today. You've got to be able to do both.''\n\nGAME BALL FOR DAVIS\n\nAfter an ineffective 2018, Notre Dame moved Avery Davis from running back to cornerback during the spring and he was battling for playing time there until Jafar Armstrong's injury at Louisville. Upon their return to South Bend, Kelly and his staff moved Davis back to offense, and on his first touch of the season he scored.\n\nBecause of his willingness to make another move to benefit the team, Kelly awarded the junior the game ball in the locker room.\n\n''For him being so humble as a player,'' Kelly said, ''and unselfish to flip from quarterback to running back to defense and back to the offensive side of the ball and come up big with an electric run. That really got the entire team and stadium into it.''\n\nKelly was also impressed again with the play of Hamilton. ''That kid 14 (Hamilton), he just has a great nose for the football,'' Kelly said. ''The interception for a touchdown got us great momentum. We were able to feed off that.''\n\nUP NEXT\n\nNew Mexico: The Lobos return home next Saturday afternoon to play New Mexico State in the Rio Grande Rivalry for the 110th time.\n\nNotre Dame: The Fighting Irish play Georgia for the third time, looking for their first victory.\n\n---\n\nMore AP college football: https://apnews.com/tag/Collegefootball and http://www.twitter.com/AP-Top25", "description": "Ian Book and No. 7 Notre Dame got some kinks out Saturday against New Mexico and now have No. 3 Georgia on their minds.  ''It felt good to get in a rhythm at Louisville .  The senior quarterback rebounded from a lackluster opening performance in a 35-17 victory at Louisville to complete 15 of", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/.P75ckNXtUC3C1LgZqpA5w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwMjQ7aD02ODI-/https://s.yimg.com/uu/api/res/1.2/c78dHjmIkTWU0R1GO8xdiA--~B/aD0zNDE7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201909141552571560687", "published_at": "2019-09-15"}