{"pub": "townhall", "url": "https://townhall.com/columnists/toddstarnes/2019/10/03/aclu-targets-teen-cheerleaders-over-protrump-football-banner-n2554031", "downloaded_at": "2019-10-03 07:23:52.627306+00:00", "published_at": "2019-10-03", "title": "ACLU Targets Teen Cheerleaders Over Pro-Trump Football Banner", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nThe American Civil Liberties Union, which is neither American nor civil, has decided to bully a bunch of patriotic teenagers at a Kentucky High School.\n\nIt was \"America Out\" night during Homecoming at Anderson County High School and many football fans showed up wearing patriotic colors.\n\nThe high school's cheerleading squad put together a run-through banner that was in keeping with the night's theme. The banner read, \"Make America Great Again, Trump Those Patriots.\"\n\nAnderson County's homecoming opponent on the gridiron was the Lincoln County Patriots.\n\nIt was a clever play on words that unfortunately triggered a good many anti-Trump snowflakes across the Bluegrass State.\n\nThe Lexington Herald Leader reports people were outraged. Critics called the banner disrespectful and disgusting.\"\n\nTelevision station WKYT reports the ACLU \"is now looking into why the Trump-centered celebration occurred during a school sponsored event. They also said the problem is both political sides weren't represented in the expression.\"\n\n\"Schools and officials representing a school, however, cannot endorse a political view or allow some students to express an opinion without allowing students of differing views the same opportunity,\" the ACLU of Kentucky wrote on its Facebook page.\n\nThe school district said no one was punished because no one did anything wrong. And based on the response I've seen, a majority of right-thinking people are siding with the kids.\n\n\"So many crying over a word,\" one person wrote on Facebook. \"Trump the Patriots, great play on the other teams name. It's pretty sad that adults are so soft nowadays that you get so tore up over something like this, something that absolutely has no effect on your life.\"\n\n\"Please quit bashing the kids who did nothing to be ridiculed for and know that there was no political agenda,\" wrote another.\n\nAs I documented in my new book, \"Culture Jihad,\" this is not the first time a group of high school kids has been bullied and badgered by leftist thugs.\n\nA few weeks ago the North Carolina High School Athletic Association placed the North Stanly High School cheerleaders on probation because they posed in a photograph with a Trump 2020 MAGA banner.\n\nAnd a group of Arkansas cheerleaders drew controversy when they created a Trump-themed run-through banner for the football team.\n\nIn all three instances the kids were just being kids. They were having fun. They were not making a political statement. They were not intentionally trying to trigger a sensitive snowflake.\n\nYet the left seems to believe they have a right to silence anyone who displays a measure of support for the president or patriotism for the nation.\n\nRemember what the Democrats and Mainstream Media and Never Trumpers did to Nicholas Sandmann and the Covington Catholic High School boys.\n\nTheir hatred of the president is so vile, the left will stop at nothing to silence his supporters -- even if they are school children.", "description": "The American Civil Liberties Union, which is neither American nor .10/03/2019 3:20:46AM EST.", "authors": ["Todd Starnes", "Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/252/74c68734-8bbe-432b-872c-f478258b9d32.png"}