{"pub": "wsj", "url": "https://wsj.com/articles/democrats-defend-private-interviews-in-impeachment-probe-11571942427?mod=rsswn", "downloaded_at": "2019-10-24 23:58:25.695532+00:00", "title": "Democrats Defend Private Interviews in Impeachment Probe", "language": "en", "text": "WASHINGTON—House Democrats plan to move ahead with more closed-door interviews in their impeachment inquiry, scheduling current and former White House officials for private depositions despite stepped-up demands from Republicans to conduct the investigation in public.\n\nThe plans come at the close of a week in which a witness tied President Trump to an alleged quid pro quo regarding Ukraine aid and Republicans staged a protest over the secretive nature of the proceedings.\n\nRep. David Cicilline (D., R.I.) said Democrats would move the investigation into a public setting “as soon as we have completed the gathering of evidence and that we are ready to make a presentation.” He said he expected that within weeks, not months—and before the introduction of any articles of impeachment—already given testimony would be made public or that witnesses would openly testify.\n\nNearly all of the witnesses in the impeachment inquiry that started last month have testified in front of three House committees behind closed doors in the basement of the U.S. Capitol building. Democrats describe the interviews as part of the investigation’s early, fact-finding stage. Republicans on the committees are invited to participate and can ask as many questions as they like, according to members of both parties.\n\nRepublicans argue the process isn’t fair to Mr. Trump and say the interviews should be open to all lawmakers. On Wednesday, several dozen Republicans stormed into a secure meeting room and delayed by several hours the testimony of a Pentagon witness. The protest drew praise from the White House.\n\n“Dems have been doing everything behind closed doors and in secret, and so it’s about time somebody made a very bold stand,” Stephanie Grisham, the White House press secretary, said Thursday on Fox News.\n\nRelated Video President Trump's efforts to persuade Ukraine to investigate his political rival, former Vice President Joe Biden, have set off an impeachment inquiry by House Democrats. WSJ's Shelby Holliday lays out a timeline of interactions between the president's inner circle and Ukrainian officials. Photo Composite: Laura Kammermann/The Wall Street Journal\n\nSenate Republicans went to the White House on Thursday for lunch with the president, according to a person familiar with the matter.\n\nSenate Judiciary Committee Chairman Lindsey Graham (R., S.C.) said Thursday he planned to introduce a Senate resolution condemning the House’s closed-door investigation, which he called illegitimate.\n\nDemocrats argue closed-door interviews are needed to prevent witnesses from coordinating their testimony.\n\n“I’m a former prosecutor. We would never do witness interviews in public. And so, what the Republicans are asking for is insane,” said Rep. Ted Lieu (D., Calif.), who sits on the intelligence committee, one of the panels conducting the inquiry. He said public hearings would take place once the three committees finish their investigation.\n\nIndependent counsel Ken Starr conducted his probe of President Clinton using a grand jury, which by law conducts all its business behind closed doors. In Watergate, special counsel Leon Jaworski also used a grand jury to collect evidence that he eventually transmitted to Congress during its impeachment inquiry. Much of the legal work analyzing the evidence collected by Mr. Jaworski’s prosecutors was done behind closed doors by congressional lawyers.\n\nSeveral of the key players in Watergate did end up testifying publicly in front of the Senate Watergate committee, but that was a separate investigation from the House impeachment inquiry.\n\nConducting witness interviews behind closed doors was a common tactic in recent high-profile investigations run by Republicans.\n\nUnder GOP leadership, the Senate and House intelligence committees conducted separate reviews of Russian meddling in the 2016 election, largely interviewing witnesses behind closed doors. The GOP-run House also conducted an inquiry into the 2012 terrorist attacks in Benghazi, Libya, largely behind closed doors.\n\nThe GOP protest this week came the day after Bill Taylor, a top U.S. diplomat in Kyiv, said in his prepared testimony that Mr. Trump made nearly $400 million in aid contingent on the Ukrainian president investigating Democratic presidential candidate Joe Biden and alleged Ukrainian interference in the 2016 U.S. election. The issue of why the Ukraine aid was held up is a central focus on the impeachment inquiry.\n\nDemocrats called Mr. Taylor’s testimony damning and said the GOP protest was intended as a distraction from it. Mr. Trump has denied any quid pro quo and has called the impeachment inquiry a witch hunt.\n\nOn Saturday, Philip Thomas Reeker, the Acting Assistant Secretary of State in the Bureau of European and Eurasian Affairs, is scheduled to appear. Mr. Reeker is expected to be asked about what other witnesses have described as dual foreign policy channels regarding Ukraine, and about the ouster of former Ukraine Ambassador Marie Yovanovitch.\n\nLate Wednesday, Democrats also announced two new witnesses for next week. Former deputy national security adviser Charles Kupperman is expected on Monday. Mr. Kupperman was on the July 25 call between Messrs. Trump and Ukrainian President Volodymyr Zelensky, The Wall Street Journal has reported, and he would be the first witness with firsthand knowledge of the call to testify in the impeachment inquiry.\n\nCurrent White House official Timothy Morrison, a special assistant to the president and senior director for Europe and Russia on the National Security Council, is scheduled for Thursday.\n\nMr. Morrison was described in testimony by Mr. Taylor as a person who informed Mr. Taylor of a conversation between Mr. Trump and Gordon Sondland, the ambassador to the European Union. In that conversation, Mr. Taylor said he was told that Mr.,. Trump insisted that Mr. Zelensky publicly say he was opening investigations of Mr. Biden and his son, as well as 2016 election interference.\n\nCommittee staff is in ongoing discussions with witnesses to schedule more testimony, according to an aide working on the investigation.\n\nIf the House, controlled by the Democrats, impeaches Mr. Trump, the matter then would move to the Republican-led Senate for a trial, but the two chambers haven’t set any agreement on timing. Republican senators, including Senate Majority Leader Mitch McConnell (R., Ky.), have speculated a trial could happen between the Thanksgiving and Christmas holidays. But House Speaker Nancy Pelosi (D., Calif.) hasn’t committed to a time frame, She has said she would like the probe conducted expeditiously, but that the calendar would depend on what the investigation finds.\n\nMany lawmakers have indicated they would like to finish the process before the presidential election season moves into full swing. Asked if he sees the impeachment inquiry wrapping up before the end of the year, House Majority Leader Steny Hoyer (D., Md.) said: “That would be my hope.\"\n\n—Jesse Naranjo and Dustin Volz contributed to this article.\n\nWrite to Natalie Andrews at Natalie.Andrews@wsj.com", "description": "House Democrats plan to move ahead with more closed-door interviews in their impeachment inquiry despite stepped-up demands from Republicans to conduct the investigation in public.", "authors": ["Natalie Andrews", "Natalie.Andrews Wsj.Com"], "top_image": "https://images.wsj.net/im-120409/social", "published_at": "2019-10-24"}