{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/3/letters-to-the-editor-the-sharply-rising-cost-of-l", "downloaded_at": "2019-09-03 23:46:04.111941+00:00", "title": "The sharply rising cost of living", "language": "en", "published_at": "2019-09-03", "text": "ANALYSIS/OPINION:\n\nI’m old enough to remember when professional baseball ballplayers spent their entire careers with the same team. These days, only money buys loyalty. I don’t know what the average salary was for MLB players during the ‘30s and ‘40s, but I do recall that Babe Ruth earned the astronomical salary of $80,000 per season.\n\nI suppose it is all relevant. During Ruth’s time, gasoline probably cost 12 cents a gallon. I remember a loaf of Victor Bread at the American Stores costing a nickel and Wonder Bread everywhere costing 10 cents at around the same time. My father bought a two-story, three-bedroom house in Hyattsville, Maryand, for $5,700. I consulted the current occupants about a year ago and was advised that the house had been appraised a short time earlier at $425,000. It seems likely that every average family will be living in a $1 million house in the not-too-distant future.\n\nI marvel at the changes I’ve witnessed in my lifetime. We’ve gone from four radio stations for home entertainment to nearly 2,000 TV channels. The world population has grown from 117 million to more than 320 million since I was born. I wonder what changes my grandchildren will see over the course of their lifetimes.\n\nGLENN BRAUNER\n\nAnnapolis\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "I'm old enough to remember when professional baseball ballplayers spent their entire careers with the same team. These days, only money buys loyalty. I don't know what the average salary was for MLB players during the '30s and '40s, but I do recall that Babe Ruth earned the astronomical salary of $80,000 per season.", "authors": ["The Washington Times Http", "The Washington Times"], "top_image": ""}