{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-6343263/Pornhub-noticed-Red-Dead-Redemption-2-spike-games-release.html", "downloaded_at": "2019-10-05 06:21:52.856221+00:00", "title": "Pornhub noticed a Red Dead Redemption 2 spike before game’s release", "language": "en", "text": "Rockstar Games' Red Dead Redemption 2 is so big it’s even coming up in Pornhub searches.\n\nAfter a long, eight-year wait, the sequel to 2010 Red Dead Redemption was released at the end of October.\n\nThe game is set 12 years prior to the original and follows Arthur Morgan, an outlaw who is part of the notorious Dutch van der Linde gang, as he tries to survive and thrive in the unforgiving West.\n\nRed Dead Redemption 2 immediately made a huge impact, receiving rave reviews and making over $725 million in its opening weekend, becoming the most pre-ordered full game ever on PlayStation Network in the process.\n\nThe highly anticipated Rockstar game Red Dead Redemption 2 came out on Friday October 26\n\nThe game even came up as a term in the searches over at Pornhub, where the adult site’s statisticians started to notice mentions of the game days before its October 26 release.\n\nA graph of October shows searches for Red Dead Redemption remain low until October 18, when the first spike occurred after the release of the final trailer and last few details.\n\nAround October 25, searches for Red Dead Redemption skyrocketed faster than Arthur Morgan fleeing from marshals on horseback. Searches increased by a maximum of 731 per cent by Sunday, October 28.\n\nWhere it gets really interesting is the knock-on effect the Western videogame had on other Pornhub searches.\n\n‘RDR2’s western setting and subject matter seems to have gotten players all hot and bothered,’ the site wrote in a blog post.\n\nSearch terms such as ‘western’, ‘cowboy’ and ‘wild west’ all saw huge spikes over the weekend of the game’s release.\n\n‘Wild West’ saw the biggest spike, jumping by a staggering 745 per cent; ‘Western’ searches rose by 489 per cent; ‘Cowboy’ increased by a comparatively mild 189 per cent.\n\nAlong the male-female divide, the game appeared to be much more popular with men.\n\n‘Our statisticians found that men were proportionately 1165 per cent more likely to search for “red dead” when compared to women.’\n\nUnsurprisingly, searches for Red Dead Redemption appear to be a young man’s game as millennials between the ages of 18 and 34 were 93 per cent more likely to search for Red Dead Redemption than those over the age of 35.", "description": "After a long, eight-year wait, the sequel to 2010 Red Dead Redemption was released at the end of October. The Rockstar game is so big it even came up as a search term on Pornhub", "authors": ["Ben Rabinovich"], "top_image": "https://i.dailymail.co.uk/i/newpix/2018/11/01/17/51E1A63B00000578-0-image-a-30_1541093211486.jpg", "published_at": "2018-11-01"}