{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7570395/Tziporah-Malkah-unveils-final-makeover-skimpy-blue-bikini.html", "downloaded_at": "2019-10-14 10:18:35.391404+00:00", "title": "Tziporah Malkah unveils her 'final makeover' in a skimpy blue bikini", "language": "en", "text": "Tziporah Malkah unveiled her 'final makeover' on Monday night's A Current Affair.\n\nThe '90s model, formerly known as Kate Fischer, stripped down to a skimpy blue and pink floral bikini on the beach to show off her incredible 50 kilogram weight loss.\n\nHaving also undergone liposuction and a Brazilian butt lift, the 45-year-old told hypnotist Mark Stephens that she's 'incredibly vain', proud and loves herself.\n\n'I'm proud but also incredibly vain and love myself right now': Tziporah Malkah, 45, unveiled her 'final makeover' on Monday's A Current Affair (left), after previously weighing 120kg (right)\n\nThe beginning of the segment saw Tziporah speaking about her previous 'mental anguish' before breaking down in tears.\n\nShe told A Current Affair reporter Brady Halls: '[The] mental anguish from all the stresses of life are just not there anymore... And I think that's probably the greatest gift.'\n\nTziporah broke down in tears, clearly overwhelmed by how far she has come.\n\nJourney: During the A Current Affair segment, the former '90s model spoke about letting go of past mental anguish and undergoing a mini lipo tuck and Brazilian butt lift\n\nThe scene changed to a new and improved Tziporah, with the ex-fiancée of billionaire James Packer showing off her 50kg weight loss in a white maxi-dress.\n\nTziporah, who previously weighed 120 kg, twirled around in the outdoors and drew attention to her usually brunette hair now a bright orange.\n\nReflecting on shedding the weight, she told Brady Halls: 'The most frustrating thing that I've come across in my life is that I lose it and then I put straight back on again. It's been this vicious cycle.\n\nNew look: Tziporah told A Current Affair reporter Brady Halls (right) on the beach: 'I've got on a bikini and not everyone around me is throwing up! I'm proud but I'm also incredibly vain'\n\n'[However] I just keep it off now,' Tziporah continued. 'I can do other stuff, it's great. It's absolutely great.'\n\nTziporah then underwent a mini lipo tuck to improve her sagging skin across her mid-section, and a re-shaping of her hips with a Brazilian butt lift.\n\nAfter a four-week recovery period, the former aged care worker stripped down to a blue and floral print bikini, and unveiled her final makeover.\n\nThe former model admitted earlier this year: 'I've gone from a size 24 to a 12. I'm about half my size now'. Pictured on I'm a Celebrity... Get Me Out Of Here! in 2017\n\nSlim down: Reflecting on her journey, the model said she had lost over 50 kilos\n\nThe beauty previously told New Idea magazine: 'I [used to be] in a bad shape, mentally and physically... But now I no longer hate myself, I actually really like me!' Pictured in 2018\n\nHealthy: She attributed her weight loss to 'clean eating', meditation, regular exercise sessions and hypnosis therapy\n\nTziporah told Brady Halls: 'I've got on a bikini and not everyone around me is throwing up!'\n\nAsked as to how the Brazilian butt lift went, she said: 'I haven't had a bottom in a long time. It was sort of sliding down the back of my knees.'\n\n'I'm proud but I'm also incredibly vain,' the Sirens star declared at the end of the segment. 'I love myself right now.'", "description": "Tziporah Malkah unveiled her 'final makeover' on Monday night's A Current Affair.", "authors": ["Kristy Johnson For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/10/19684026-0-image-a-15_1571044577143.jpg", "published_at": "2019-10-14"}