{"pub": "huffpost", "url": "https://huffpost.com/entry/warren-hurst-tennessee-white-men-rights_n_5daf2189e4b0f34e3a7d4b9d", "downloaded_at": "2019-10-22 20:40:10.424997+00:00", "title": "County Official Rants About A 'Queer' Running For President, Loss Of White Men's Rights", "language": "en", "text": "A county commissioner in Tennessee launched a tirade against the Democratic presidential field and the general state of white men in America on Monday during a debate about guns.\n\nWarren Hurst, who sits on the Sevier County Commission, spoke up during a discussion on an upcoming vote to become a gun sanctuary city. He told the crowd, many of whom were holding little American flags, that it was time to “wake up people.”\n\n“We got a queer running for president if that ain’t about as ugly as you can get,” he said, in comments captured by Knoxville-based station WVLT. “Look what we got running for president in the Democratic Party. We can go over here to Hoss’ jail [the Sevier County sheriff] and get better people out of there than those running for [the] Democratic [nomination] to be president of the United States.”\n\nPete Buttigieg, the mayor of South Bend, Indiana, is running in the Democratic primary. If elected, he would be the first openly gay president. His campaign didn’t immediately return a request for comment.\n\nAt least one woman objected to Hurst’s remarks and stormed out, but others applauded and agreed with him.\n\n“I’m not prejudiced, but by golly, a white male in this country has very few rights and they’re getting took more every day,” the commissioner added.\n\nIn a follow-up interview with WVLT, he stood by his comments and noted that he has some Black friends. HuffPost repeatedly attempted to contact Hurst, but his line was busy.\n\n“Sevier County Commissioner Warren Hurst is using his position of power to publicly spew bigotry against LGBTQ people ― people who are very likely his own constituents. A group of people having rights doesn’t take away those of another,” said Nick Morrow, a spokesman with the LGBTQ equality group Human Rights Campaign. Morrow grew up one county over from Sevier. “But with LGBTQ people running for office at every level of government and more and more people voting for candidates who support equality, he should be more worried about losing his seat than losing his rights.”", "description": "“I’m not prejudiced, but by golly, a white male in this country has very few rights and they’re getting took more every day.”", "authors": ["Washington Bureau Chief"], "top_image": "https://img.huffingtonpost.com/asset/5daf2249210000ab21ad391d.png?cache=dtd69hc0tj&ops=1778_1000", "published_at": "2019-10-22"}