{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7557505/Czech-Republic--Factors-To-Watch-Oct-10.html", "downloaded_at": "2019-10-10 06:55:41.200325+00:00", "title": "Czech Republic - Factors To Watch on Oct 10", "language": "en", "text": "PRAGUE, Oct 10 (Reuters) - Here are news stories, press reports and events to watch which may affect Czech financial markets on Thursday. ALL TIMES GMT (Czech Republic: GMT + 2 hours) =========================ECONOMIC DATA========================== Real-time economic data releases.................... Summary of economic data and forecasts........... Recently released economic data.................. Previous stories on Czech data............. **For a schedule of corporate and economic events: http://emea1.apps.cp.thomsonreuters.com/Apps/CountryWeb/#/2E/events-overview ============================NEWS/EVENTS======================== BEIJING: China hit back on Wednesday at a decision by the Prague city council to cancel a partnership agreement with Beijing that would have required it to commit to the \"one China\" principle affirming that Taiwan is a part of China. CEE MARKETS: Central European currencies dipped on Wednesday, with the Hungarian forint and Czech crown extending falls into a fourth straight session as worries over U.S.-China trade talks and Britain's exit from the European Union hung over markets. EUROPE POWER: European spot power prices dropped for the third day running on Wednesday following higher German wind output forecasts while demand remained flat and thermal capacity availability in the region improved. ---------------------- MARKET SNAPSHOT ------------------------ Index/Crown Currency Latest Prev Pct change Pct change close on day in 2019 vs Euro 25.797 25.793 -0.02 -0.39 vs Dollar 23.485 23.519 0.14 -4.77 Czech Equities 996.62 996.62 0.26 1.02 U.S. Equities 26,346.01 26,164.04 0.7 12.94 Pvs close or current levels vs prior domestic close at 1500 GMT ===========================PRESS DIGEST========================= SOLAR: State-controlled CEZ is planning to build solar power plants with the capacity of around 500 megawatts, four-times more than all its current solar plants combined. The overall installed capacity of solar plants in the country could grow to 7 gigawatts in 10 years from the current 2 gigawatts of installed capacity, according to estimates from the Chamber of renewable sources (Komora OZE). Hospodarske Noviny, page 1 (Reuters has not verified the stories, nor does it vouch for their accuracy.) Prague Newsroom: +420 224 190 477 E-mail: prague.newsroom@thomsonreuters.com (Reporting by Prague Newsroom)", "description": "PRAGUE, Oct 10 (Reuters) - Here are news stories, press  reports and events to watch which may affect Czech financial  markets on Thursday.                  ...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-10"}