{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-zimbabwe-mugabe-journalist/covering-mugabe-for-reuters-youre-the-one-who-says-im-dying-idUKKCN1VR2DU", "downloaded_at": "2019-09-07 03:48:22.695399+00:00", "title": "Covering Mugabe for Reuters - 'You're the one who says I'm dying?'", "language": "en", "text": "HARARE (Reuters) - Retired correspondent Cris Chinaka worked for Reuters in Harare from 1990 to 2015. Before that he reported on Zimbabwe for the ZIANA news agency and MOTO, a weekly newspaper.\n\nZimbabwean President Emmerson Mnangagwa addresses the media after the death of former President Robert Mugabe at State House in Harare, Zimbabwe September 6, 2019. REUTERS/Philimon Bulawayo\n\nThe country’s former leader, Robert Mugage, died on Friday aged 95. On Nov. 24, 2017, Reuters published this report in which Chinaka reflected on a third of a century of covering “Uncle Bob”.\n\nThere are two images of Robert Gabriel Mugabe that jump out of my memory to illustrate the contrasting sides of the man who led Zimbabwe for 37 years.\n\nThe first is of a combative and ebullient 57-year-old, dressed in an olive green military-type suit in the dying days of what was then white-run Rhodesia.\n\nWaving a clenched fist in the air, he was scolding his opponents and rallying his supporters as they marched confidently towards the birth of a new nation: Zimbabwe.\n\nThe second is of a shrunken 93-year-old slumped in a cushioned seat, snoozing. His wife Grace, more than 40 years his junior, whispers in his ear while placing a colourful cowboy hat on his head as thousands of fawning ZANU-PF party faithful applauded.\n\nIn the nearly four decades that separated those two episodes, Zimbabwe had, in the eyes of its critics, declined into the same state as its leader: hollowed out, impotent and for some an object of ridicule.\n\nThat first image is from my first meeting with Mugabe, in February 1980, at a ZANU-PF rally in the southeastern province of Masvingo, ahead of the vote that would mark independence from Britain.\n\nAs Mugabe was ushered off the stage by his security guards, I introduced myself, shook his hand and asked for an interview.\n\nHe was warm and attentive at this approach from a junior reporter and said my newspaper, the MOTO weekly, was one of his favourite publications.\n\nAside from its nationalist editorial line, the paper may also have appealed to the Jesuit-educated Mugabe as it was published by the Catholic Church to which he belonged.\n\nShortly after our conversation, Mugabe survived what would be one of many assassination attempts when a land mine exploded, narrowly missed his vehicle in the motorcade heading back to the capital, Harare.\n\nTHE ROMAN CATHOLIC MAN\n\nI had a longer one-on-one meeting three years later in March 1983 in India, where I was on a Commonwealth scholarship studying for a postgraduate degree in journalism.\n\nMugabe prided himself on his elephantine and encyclopaedic memory, but he must have been briefed on the backgrounds of the students at the Zimbabwean mission function in Delhi. When I introduced myself, he remarked, “Oh, you are our Roman Catholic man, right?”\n\nFive years later, when I was covering an official visit to Brussels for Zimbabwe’s national news agency, Mugabe’s chief of protocol told him: “Your Excellency, that young Roman Catholic man is now a father.”\n\nOn the return journey, Mugabe came through from the presidential section of the plane into economy class, as he frequently did on such trips, to chat with members of the delegation. This time he sat next to me.\n\nHe asked about my wife and our new baby daughter. We also discussed my job and current affairs.\n\nAs he got up to leave after a 30-minute conversation, Mugabe said: “You sound like an intelligent young man. Why did you go into journalism?”\n\nWas he just joking, or was this a rare insight into what Mugabe - a man who would later be accused of gagging free speech and individual rights - really thought about the news business?\n\n‘YOU’RE THE ONE WHO SAYS I’M DYING?’\n\nMugabe knew the name of my daughter, Tariro, and for many years he would ask after her. I sometimes thought he remembered because she was born around the same time as his own daughter, Bona.\n\nOn other foreign trips around Africa and Europe, I had opportunities for discussions with Mugabe, invariably about the subject of his mission, but I always got a sense that he was only giving away glimpses of his real thoughts and feelings.\n\nEven as his years advanced and his ability to recall distant facts and figures deserted him, he retained a sense of humour - especially at suggestions that he was on his way out.\n\nIn 2010, having secured an interview for Reuters, I was ushered into his office and greeted him as he sat behind his desk.\n\nIn return, he remarked with a smile: “Aargh, so you are the man who has been reporting that I am dying?”\n\nThe interview lasted 90 minutes, and covered everything from his health, the desperate state of the economy and the Western sanctions that his ZANU-PF government blamed for the ills that had befallen the nation.\n\nMy story focused on his denial that he was suffering from cancer and featured, for the first time, a line that he would repeat many times over the following years.\n\n“Jesus died once, and resurrected only once - and poor Mugabe several times,” he said, clapping his hands in glee.", "description": "Retired correspondent Cris Chinaka worked for Reuters in Harare from 1990 to 2015. Before that he reported on Zimbabwe for the ZIANA news agency and MOTO, a weekly newspaper.", "authors": ["Chris Chinaka", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190906&t=2&i=1427016610&w=1200&r=LYNXNPEF851R8", "published_at": "2019-09-06"}