{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/great-british-boris-brexit-happen-191017004448134.html", "downloaded_at": "2019-10-17 05:15:40.803306+00:00", "title": "Can the Great British Boris Brexit still happen?", "language": "en", "text": "London, United Kingdom - As the final few grains of sand spiral towards the neck of the grand Brexit deadline egg-timer, excitement is bubbling in the corridors of power and the court of public opinion.\n\nA Brexit deal, whispers the rumour on the wind, is near at hand.\n\nCan this possibly be true? After three years of endless photo opportunities and vacuous media soundbites, could there finally be progress towards an agreement between the European Union and the United Kingdom that could see the country withdraw from the world's largest trading bloc in an orderly and sensible manner?\n\nDon't hold your breath, get your hopes up or count your chickens, but it does appear - according to a growing consensus of hushed leaks and anonymous off-the-record chats percolating through Brexitland's media world - that some of the main obstacles to a deal have been successfully hurdled.\n\nThat said, in the words of Leo Varadkar, Ireland's taoiseach, there's many a slip between the cup and the lip.\n\nThe proposed deal, if the rumours filtering out of various EU capitals are correct, would see Northern Ireland largely remain in regulatory alignment with the EU, with the rest of the UK dropping the \"level playing field\" - the principle which sees countries adopt largely similar taxation and regulatory arrangements to facilitate smooth trade deals.\n\nThis opportunity to turn Britain into a low-tax, low-regulation, \"Singapore-on-Thames\" has been a driving force of Conservative Eurosceptics for many years.\n\nThe fact it leaves Belfast politically closer to Dublin than to London will be of little interest to those on the English hard-right of the party, who see European-guaranteed workers' rights, safety standards and environmental protection as \"red tape\" and barriers to free enterprise.\n\nDUP: Kingmakers no more?\n\nThe DUP, the formerly paramilitary-linked conservative unionists who propped up Theresa May's government in exchange for a billion-pound investment in Northern Ireland, will not be happy at the idea of leaving the island of Ireland one step closer to reunification.\n\nSuch a deal would have UK Prime Minister Boris Johnson \"dumping the DUP and putting lipstick on a pig of a deal that would deliver 'Brexit-lite' - no voice, no vote and no veto\", said Mark Shanahan, head of the politics department at the University of Reading.\n\n\"It may well be enough to get the Tories through a general election, if Johnson can fend off any push for a confirmatory referendum voted through on Saturday,\" he told Al Jazeera.\n\nIrish Prime Minister Leo Varadkar (left) and British Prime Minister Boris Johnson (right) at a meeting earlier this month. [Noel Mullen/EPA]\n\nThe DUP want the Northern Ireland Assembly to have a veto over the terms of any deal.\n\nThe Irish are dead set against that idea. The NI Assembly hasn't sat in nearly three years, but the DUP want it reinstated next week, and ideally before Westminster-created law supersedes Belfast-created law on October 21 and legalises women's safe access to abortion in Northern Ireland.\n\nThe DUP has often said it doesn't want to lose alignment with Westminster, but it has been happy to maintain regulatory divergence over abortion for decades - since the rest of the UK legalised it in 1967.\n\nAnd if Northern Ireland essentially gets to stay in the EU, we can be sure that calls for Scottish independence will only grow louder.\n\n\"If Boris Johnson gets through Saturday, he sets in motion a car crash that most likely reverses the 1707 Acts of Union [between England and Scotland],\" Shanahan told Al Jazeera. \"But it puts a populist, right-wing libertarian Tory wing in power. If he loses on Super Saturday, all bets on any kind of Brexit are off.\"\n\nThe Benn Act\n\nIf we are seeing movement towards a conclusion of sorts at this stage of the Brexit process, it is because of - not despite - Parliament passing legislation mandating the prime minister to seek a delay if no deal were found by Saturday 19 October, says Scott Lucas, professor of political science at the University of Birmingham.\n\n\"The Benn Act has been essential to this process because it prevented Johnson, pushed by advisers such as Dominic Cummings as well as hardline ministers, from pursuing the 'no-deal' Brexit option,\" he told Al Jazeera.\n\n\"Without the Benn Act, Johnson - happy with 'no-deal' - makes no concessions and says 'take it or leave it' to the EU. With the Benn Act, the EU could ensure there were genuine negotiations.\"\n\nWill the EU go for it?\n\nBut what about the EU countries?\n\nThere are 27 of them, and each has a veto over any divorce deal with the UK.\n\n\"The level playing field concept was from the Theresa May era; from Boris Johnson, this is on brand for him,\" said Michele Chang, professor of European political and governance studies at the College of Europe in Bruges.\n\n\"But it is hard to imagine Germany agreeing to a UK-as-Singapore solution. I'm not convinced Northern Ireland staying in the single market would be sufficient [in exchange]. But it is a good starting point, as the EU will not abandon Ireland.\n\n\"On the other hand, it is difficult to talk about things being definitely unacceptable as no-deal Brexit looms. The issue of UK financial contributions could make things more interesting as the member states deal with managing the budget as the EU-27.\"\n\nLucas says the EU would approve of this - it has to be noted still largely speculative - scenario.\n\n\"If the Johnson government fully U-turns to a Northern Ireland-only 'customs union' backstop, the EU will agree,\" he told Al Jazeera.\n\n\"But this has to be locked down in detail, not just a statement of intention from the UK. So my expectation is that we may have a statement in principle but technical negotiations will be needed after 31 October. Thus an extension will be needed.\n\nGetting through Parliament\n\n\"Here's the wild card,\" says Lucas. \"Theresa May's government had rejected the Northern Ireland backstop because of the ERG [Eurosceptic hardliners] and the DUP. Will both now swallow their objections in some magical formulation that this not really a backstop?\"\n\nShanahan says Johnson knows the parliamentary arithmetic is tight.\n\n\"He can't please all quarters and will be calculating who he can jettison to actually win most votes,\" he said.\n\n\"It may be that junking the DUP - if they won't sell their souls for a few more billion pounds - and casting adrift some ERG hardliners will be the necessary calculation to give this a chance of crawling over the parliamentary line.\"\n\nIf Johnson loses the votes of the DUP and a few ERG members, he will be relying on support from independents, any rebel Labour Party Brexiteers - and many of the \"rebel alliance\" of former Tories who voted against the government over the Benn Act and were subsequently sacked from the party.\n\nIn the debacle over Brexit, Johnson tried to suspend parliament for weeks severely reducing the amount of time for debate over the terms of Britain's departure from the EU. The Supreme Court ruled the move illegal. [Crown Copyright via EPA]\n\nThere are of course, technicalities at play.\n\nThe idea of putting a border down the Irish Sea would appear to contravene the Taxation (Cross-border Trade) Act 2018, which states: \"It shall be unlawful for Her Majesty's Government to enter into arrangements under which Northern Ireland forms part of a separate customs territory to Great Britain.\"\n\nIt's one example of the sort of constitutional issue that will need considering or repealing before Brexit kicks in. And there are other practicalities. Boris Johnson's administration left it too late to make this proposal.\n\nEven if it had passed smoothly through \"the tunnel\" and emerged as a negotiated agreement after Tuesday night's marathon talks - there would simply not have been enough time to get the text translated into all languages of the EU for leaders' detailed consideration ahead of Thursday's European Council summit. An emergency summit to be held next next week has been suggested.\n\nWith no agreement finalised, the Benn Act comes into operation on October 19, and Johnson's administration has agreed to abide by the law and request a delay.\n\nWith apparent progress over negotiations, the EU is likely to agree to such a delay. The question remains: for how long will this Sword of Damocles hang over this land?", "description": "Boris Johnson has left it to the last minute to get a deal on Brexit, but agreement may not take much longer.", "authors": ["James Brownsell", "About The Author", "James Brownsell Is Al Jazeera Online'S Europe News Editor. He Was Previously The Managing Editor Of The New Arab."], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/17/c7cb7ff42e164893ae11453d006e548a_18.jpg", "published_at": "2019-10-17"}