{"pub": "vice", "url": "https://i-d.vice.com/en_us/article/d3ae3y/meet-4-young-activists-revolutionizing-mental-health-services?ref=vice", "downloaded_at": "2019-10-29 00:16:03.692291+00:00", "title": "meet 4 young activists revolutionizing mental health services", "language": "en", "text": "Image courtesy of Hannah and Charlie Lucas.\n\nOver the past decade, the suicide rate for 10 to 24-year-olds has increased by 56 percent, according to a recent report from the CDC. While the exact reasons for this drastic uptick are still being researched, the data reveals a growing mental health crisis amongst young people.\n\nIn an effort to improve access to help and support for mental health, many teens are turning to technology. Inspired by their personal experiences, youth are developing apps that can easily connect their peers to the services they need, whether they are looking to talk about their problems or seeking encouragement.\n\nWhile screen time and social media have been attributed to increased anxiety and depression in young people, these apps show how tech can be used for good.\n\n\"Everyone is using technology — especially youth. So, why not leverage it?” Dr. Neha Chaudhary, a child psychiatrist and cofounder of Brainstorm, Stanford's Lab for Mental Health Innovation, said. \"Youth especially love it because it's easy and something over which they can feel a sense of ownership.\"\n\nBelow are four young activists who are using technology to revolutionize the mental health space.\n\n\n\nAmanda Southworth, 17, California\n\nAs a student in middle and high school, Amanda struggled with her mental health — experiencing depression, anxiety, and suicidal ideation. In sixth grade, she found an escape through her robotics club, where she learned technological skills like coding, programming, and designing. Compelled by her own personal struggles, she felt inspired to create a guidebook for others with mental illness.\n\n“Being someone who works both extensively with technology, and needs intense mental health care and treatment, I’ve seen what it can do and how it can transform the space,\" Amanda said.\n\nIn 2015, she launched AnxietyHelper, a mobile app that offers coping mechanisms and information about a variety of mental illnesses including, but not limited to schizophrenia, psychosis, and eating disorders. Now, Amanda is working full-time with Astra Labs, her software nonprofit, to add crisis plans and a free meditation library to the app.\n\n\"There’s a lack of tech companies actually working to make the mental healthcare accessible to youth. It’s my job to step in and make sure that technology does what I know it can do: help save countless lives,” she added.\n\nSatvik Sethi, 21, New York\n\nSatvik's mental health advocacy started in high school. After reaching out to someone on social media who was in the midst of a mental health crisis, he realized the impact he could have on people's lives. Now, he has helped over 180 people from around the world find support — all through the facilitation of conversation about life, problems, and passions.\n\n“My goal is to inspire those in need of support to share their stories and take control of themselves in a positive manner. I am looking forward to achieve this through Runaway,” Satvik said.\n\nRunaway allows users to engage in anonymous conversations with a trained volunteer or highly-killed AI chat bot. While it's not a professional counseling service, it offers an outlet for people to share their problems, find positivity, and connect with someone ready to listen.\n\nHannah and Charlie Lucas, 17 and 14, Georgia\n\nWhen Hannah was 15 years old she was diagnosed with POTS — a circulation condition that causes her to faint. As a result, she felt lonely and isolated and experienced depression and anxiety. During this time, her brother Charlie helped her by providing emotional and physical support, which motivated her to come up with an idea to help others in distress.\n\nTogether they launched the notOK app, which allows users to gain immediate support by notifying their friends, family, or peer network about a mental health crisis — all with the tap of a button. Now, the brother-sister duo are diligently working to spread awareness of mental healthcare by getting the notOK app into many hands as possible.\n\n“Working on the notOk app has given me a sense of purpose. I used to barely be able to walk some days and now I am traveling and even driving to school.It’s really inspiring that this app has helped me and many other lives.”", "description": "While screen time and social media could be contributing to the mental health crisis, these young people show us how tech can help.", "authors": [], "top_image": "https://video-images.vice.com/articles/5db0917886c00a00925b39fb/lede/1572277202585-Hannah-and-Charlie.jpeg?crop=1xw:0.8432xh;0xw,0.0855xh&resize=1200:*", "published_at": "2019-10-28"}