{"pub": "hotair", "url": "https://hotair.com/archives/ed-morrissey/2019/09/25/iran-trump-lets-make-deal", "downloaded_at": "2019-09-25 13:37:24.277731+00:00", "title": "Iran to Trump: Let’s make a deal?", "language": "en", "text": "Iran appeared to offer a key concession overnight in its standoff with the West, but just how meaningful is anyone’s guess. A day or so after France, Germany, and the UK all publicly agreed that Iran launched the missile attack on Saudi Arabia, a government spokesperson said that the regime is now willing to renegotiate terms of the 2015 nuclear deal that Donald Trump scotched. Iran was willing to accept “small changes” in the original JCPOA to satisfy the US, as long as sanctions were dropped during the negotiations — a significant change in their posture.\n\nOne key point — this time Iran wants an actual deal:\n\nIran is prepared to accept changes to the 2015 nuclear agreement and not seek nuclear weapons if the United States agrees to the deal and lifts sanctions, a spokesman for Iran said Wednesday. “If the sanctions are ended and there is a return to the (nuclear) accord, there is room for giving reassurances toward breaking the deadlock and the President has even a proposal for small changes in the accord,” Ali Rabiei said on state TV, according to Reuters. The news service added that Iran’s state-run Press TV said on Wednesday that Tehran would be willing to re-enter the deal on the conditions of “early approval of an additional protocol by Iran’s parliament, nuclear deal approval by U.S. Congress, lifting of all sanctions by Washington.”\n\nThat refers to the terms of the 2015 JCPOA, which not only never got ratified by the Senate but was never formally signed by the leaders involved. That made it a lot easier to dump when Trump took office, although Trump waited through a few renewal cycles before finally pulling the plug on the Iran deal over issues with verification and the Iranian missile program. This time, Tehran wants a deal with legal force in the US to ensure that it sticks.\n\nHow likely is it that Tehran will negotiate on the key sticking points for the US, however? At the same time Rabiei was offering a little sweetness and light, the Iranian defense minister was taking a hard line on Iran’s ballistic missile program:\n\nThe official IRNA news agency on Wednesday quoted Gen. Amir Hatami as saying any deal with the United States over Iran’s “missile power” would damage the country’s capabilities. He said Iran’s leaders all support improving their missile program. Tehran long has insisted its ballistic missile program was nonnegotiable. President Donald Trump, however, cited it as a reason for unilaterally withdrawing America from the nuclear deal over a year ago.\n\nEven on just the nuclear-weapons proscriptions, it’s tough to imagine Iran offering enough concessions to make a deal worthwhile. The JCPOA had several holes when it came to inspections and verification, especially the latter, and Iran refused to budge or renegotiate on those points as well. Inspectors never got into some suspected nuclear-weapons development sites, while indications from the outside showed evidence that uranium continued to be developed. Israel laid out a stunning intelligence case about the extent of Iranian deception in April 2018 that exposed the gaps in the JCPOA and the amateurish negotiation on the part of the West that helped create it.\n\nStill, the concession in their rhetoric indicates that either the diplomatic, economic, or military pressure has had an effect — and perhaps all three. Firing a missile at Saudi Arabia might have been a step too far for even France and Germany, who had been somewhat more sympathetic to Iran (and desirous of their trade, too). Tehran might have been surprised to get isolated so quickly after the attack and saw a need to make some amends. It’s an opening of some sort, but don’t bet on it being real.\n\nThe next question will be whether Trump lowers sanctions to encourage more movement. He’s played fast and loose rhetorically on sanctions involving others, but he’s not been inclined to tinker with them much in reality. Given his consistent hard line on Iran and his contempt for Barack Obama’s negotiating track record on the JCPOA, I’d be surprised if Trump suspended sanctions ahead of significant and substantive concessions by Iran. Surprised … but maybe not shocked.", "description": "Defense minister singing another tune?", "authors": ["Ed Morrissey", "John Sexton", "Karen Townsend", "Jazz Shaw"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/rouhani-dw.png", "published_at": "2019-09-25"}