{"pub": "fox", "url": "https://foxnews.com/media/donald-trump-syria-lindsey-graham-obama", "downloaded_at": "2019-10-07 20:08:38.558440+00:00", "title": "Sen. Graham warns Syria withdrawal would be 'big win for ISIS,' compares Trump's strategy to Obama", "language": "en", "text": "President Trump's desire to withdraw troops from northern Syria and pull back from the Middle East is reminiscent of Barack Obama's Iraq strategy and represents a \"win for ISIS,\" said Sen. Lindsey Graham, R-S.C., Monday on \"Fox & Friends.\"\n\nTrump unleashed several tweets on Monday saying his administration has \"held off\" on the issue of troop withdrawal for three years, and must finally put the burden of maintaining stability in the region on other nations. He also said America should extricate itself from \"ridiculous, endless wars\" and cited Turkey's Kurdish conflict as a prime example.\n\n\"If I didn’t see Donald Trump’s name on the tweet I thought it would be Obama’s rationale for getting out of Iraq,\" Graham told Fox News.\n\nTRUMP'S DECISION TO MAKE WAY FOR TURKEY IN SYRIA SEEN BY CRITICS AS A KURDS BETRAYAL\n\n\"This is going to lead to ISIS' reemergence. [There's] nothing better for ISIS than to create a conflict between the Kurds and Turkey. The Kurds will now align with [Bashir al] Assad because they have nobody to count on because we abandoned them. So this is a big win for Iran and Assad -- a big win for ISIS.\"\n\nGraham said Trump had a valid point about European nations having to do more and carry their weight in the fight against ISIS, but claimed Iran will benefit most from a policy of withdrawal. He also said Trump's proposed strategy will only lead to further destabilization and be to the detriment of the United States.\n\n\"When... Obama was told what would happen in Iraq, it did,\" he said. \"And I’m here to say that this is going to lead to the reemergence of ISIS and the biggest winner of all this will be the Iranians and that’s too bad.\"\n\nGraham also criticized the Trump administration for claiming ISIS is defeated and said there are still thousands of active fighters looking to destroy the West through terrorism.\n\nTURKEY ANNOUNCES INCURSION OF NORTHEAST SYRIA, US-BACKED KURDS HAVE VOWED 'ALL-OUT' WAR\n\n\"ISIS is not defeated,\" he said. \"The biggest lie being told by the administration [is] that ISIS is defeated. The caliphate's destroyed, but there's thousands of fighters over there. And no, the caliphate would not have been destroyed without the Kurds, and I applaud the president for getting the Kurds and the Arabs to do most of the fighting. The casualties destroying the caliphate was very low. We've got less than 1000 troops now in Syria.\n\n\"But this impulsive decision by the president has undone all the gains we’ve made, thrown the region into further chaos,\" Graham continued. \"Iran is licking their chops. And if I’m an ISIS fighter I've got a second lease on life. So to those who think ISIS has been defeated you will soon see.\"\n\nISIS fighters and other terrorists comprising the more than 10,000 Islamic militants jailed in northeast Syria could launch a mass prison break as U.S. troops withdraw from the region in response to Turkey's impending incursion, Syrian Kurdish fighters warned Monday.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe imminent cross-border military operation pitting Turkey against the Syrian Kurds -- a group Turkish President Recep Tayyip Erdogan views as terrorists amid a bloody Kurdish insurgency plaguing his country -- has already led Kurds there to accuse the U.S. of abandoning them.\n\nU.S. troops have fought alongside the Syrian Kurdish fighters for years in the successful effort to topple ISIS' so-called caliphate that put the terror group in control of huge swaths of Syria and Iraq. But now, the 1,000 or so American troops left in the northern part of the country will begin pulling back as Turkish forces push ahead.\n\nFox News' Greg Norman contributed to this report.", "description": "President Trump's desire to withdraw troops and pull back from the Middle East is reminiscent of Barack Obama's Iraq strategy and represents a \"win for ISIS,\" said Sen. Lindsey Graham, R-S.C., on \"Fox & Friends\" Monday.", "authors": ["Nick Givas", "Nick Givas Is A Reporter With Fox News. You Can Find Him On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/10/AP18271551659344.jpg", "published_at": "2019-10-07"}