{"pub": "fox", "title": "Andy Puzder: US economy is going strong – Bad news for Dems, good news for Trump and America", "url": "https://foxnews.com/opinion/andy-puzder-us-economy-is-going-strong-despite-predictions-of-doom-and-gloom", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-03 01:03:32.243457+00:00", "text": "I\n\nIt’s been just a couple of weeks since the so-called experts were warning of an imminent recession citing the much-hyped “yield curve inversion” as if it were a crystal ball for predicting our economic future. It isn’t.\n\nIn fact, the U.S. economy continues to exceed expectations as consumers remain as confident as ever. Could it be that the growing chorus of progressives cheering for an economic downturn is more focused on defeating President Trump in 2020 than on economic reality today? Clearly, that is the case.\n\nThe generally accepted definition of a recession is two consecutive quarters of negative economic growth. So far this year, our gross domestic product (GDP) grew at 3.1 percent in the first quarter and 2 percent in the second, for an average of about 2.6 percent year to date – nowhere near negative territory.\n\nTRUMP BRUSHES OFF CONCERNS OF RECESSION, TOUTS STRONG ECONOMY\n\nLet’s look at some data that’s come out in the past week to see where the economy is headed.\n\nFor the third quarter, which ends Sept. 30, the Federal Reserve Bank of Atlanta has a GDP forecasting model called GDPNow.\n\nOn Aug. 14 – the day the yield curve inverted and stocks plunged – the third-quarter forecast stood at 1.8 percent. On Friday, it stood at 2 percent.\n\nThat’s right, despite all the recession hubbub, an independent nonpartisan estimate for third-quarter economic growth has improved by over 10 percent in just the last two weeks.\n\nAs new data come in, the GDPNow forecast varies over the quarter. I expect that the final number for the third quarter of this year will be higher than GDPNow is forecasting.\n\nFirst, GDPNow’s final estimates so far this year have been decidedly on the conservative side (2.7 percent for the first quarter and 1.3 percent for the second quarter). Second, the prospects for continued strength in consumer spending – which drives our economic engine – are strong.\n\nThe threat that Democrats face is that voters will remember how President Trump spent every day in office fighting to grow our economy, successfully increasing their job opportunities and earnings, while his opponents were rooting for an economic collapse.\n\nLast year consumer spending accounted for 68 percent of GDP. As a result, how consumers feel about the economy matters. And buoyed by a very healthy jobs market and accelerating wage growth, they’re feeling pretty darn good.\n\nIn the second quarter of this year, consumer spending increased 4.7 percent, the biggest gain since the end of 2014 and the second-biggest gain since 2003.\n\nIt certainly looks like this positive trend should continue in the third quarter.\n\nThe Commerce Department announced Friday that consumer spending in July surged – up a strong 0.6 percent – indicating that American shoppers are continuing to drive the economy forward. It shouldn’t come as a surprise.\n\nThe Conference Board, a business research organization, released its highly regarded monthly Consumer Confidence Index on Tuesday. The August index found that Americans’ assessment of current economic conditions had climbed to its “highest level” since November of 2000. The share of Americans “who say jobs are currently plentiful jumped to 51.2%, the highest since September 2000.”\n\nAs stated by Lynn Franco, the Conference Board’s senior director of economic indicators, despite the doom and gloom headlines about our economic future, “consumers have remained confident and willing to spend.”\n\nWhile American consumers are driving growth, a global economic slowdown, a strong dollar and concerns over a trade war with China are creating economic headwinds for business investment, making President Trump’s 3 percent growth goal difficult to achieve.\n\nNonetheless, a slowdown is not the same as a recession. And there has been some good news even on this front.\n\nThe Commerce Department announced Monday that orders for non-defense capital goods excluding aircraft, a measure widely considered a proxy for business investment, unexpectedly increased 0.4 percent in July, driven by strong demand for electrical equipment, appliances and components.\n\nThe Commerce Department also announced a 2.1 percent increase in new orders for U.S. manufactured durable goods for the second straight month, buoyed by a continued rebound in sales of American planes.\n\nThe Commerce Department announced Thursday that our trade deficit declined by $1.8 billion in July, as exports rebounded. When exports exceed imports, it increases GDP.\n\nIn another good sign, the Commerce Department also reported that inventories of retail goods, excluding motor vehicles and parts – a component of the GDP calculation – rebounded 0.3 percent.\n\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\n\nThe prospects for continued positive growth appear strong. Perhaps this explains why interest in the recession narrative – as measured by Google search traffic – and predictions of a coming recession have both declined since recession fears spiked earlier this month.\n\nClearly, the economic sky isn’t falling and our economy is not headed for a recession anytime soon, despite progressives’ economic scare tactics designed to discourage consumer spending, damage our economy, defeat President Trump, and advance the far-left political agenda -- the economic interests of American families be damned.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe threat that Democrats face is that voters will remember how President Trump spent every day in office fighting to grow our economy, successfully increasing their job opportunities and earnings, while his opponents were rooting for an economic collapse.\n\nWhen Election Day comes, Democrats may well learn that what’s in voters’ wallets is really more important than what’s on Twitter.\n\nCLICK HERE TO READ MORE BY ANDY PUZDER", "description": "The U.S. economy continues to exceed expectations as consumers remain as confident as ever.", "authors": ["Andy Puzder", "Andy Puzder Was Chief Executive Officer Of"], "top_image": "http://media.foxbusiness.com/BrightCove/854081161001/201908/3366/854081161001_6080764331001_6080802484001-vs.jpg"}