{"pub": "yahoo", "url": "https://news.yahoo.com/astronauts-could-grow-own-meat-194749272.html", "downloaded_at": "2019-10-09 19:07:23.449144+00:00", "title": "Astronauts could grow own meat in space after successful test on the International Space Station", "language": "en", "text": "Meat has been cultivated in the International Space Station for the first time - Nasa\n\nTwo hundred and forty-eight miles away from Earth and without a cow in sight, the first piece of beef has been grown in space.\n\nMeat has been cultivated for the first time in space, in the Russian segment of the International Space Station by Aleph Farms, an Israeli food technology company.\n\nThe process began back on Earth, where cells were taken from cows.\n\nNext, the small-scale muscle-tissue was placed under zero-gravity conditions and assembled in a 3D bioprinter. The technique could be used to feed astronauts in the space station in the future.\n\nAleph Farms' aim is to produce non-genetically modified food, which means using natural processes to grow meat to mimic the way it would develop in a cow.\n\nHaving produced the world's first \"test tube steak\" in 2018, they partnered with Russian technology company 3D Bioprinting Solutions to help its first trip into space.\n\nReducing the amount of meat humans eat is vital to combatting global warming, according to recent scientific studies.\n\nCows and other grazing animals produce large quantities of methane, a greenhouse gas that traps heat.\n\n“We are working on a new method to produce the same meat, but in a way that uses less than half of the greenhouse gases,” said Didier Toubia, CEO of Aleph Farms.\n\nIt may also help to produce food in remote or desolate regions on earth and even further afield.\n\n\"In space, we don’t have 10,000 or 15,000 litres of water available to produce 1kg of beef,\" said Mr Toubia. “We are proving that cultivated meat can be produced anytime, anywhere, in any condition.” The meat will not be on general sale for at least another three years.", "description": "Two hundred and forty-eight miles away from Earth and without a cow in sight, the first piece of beef has been grown in space.  Meat has been cultivated for the first time in space, in the Russian segment of the International Space Station by Aleph Farms, an Israeli food technology company. The process", "authors": ["Charlie Filmer-Court"], "top_image": "https://s.yimg.com/uu/api/res/1.2/CnFlknD.sHWlfDh6hIcyUA--~B/aD0xNTYzO3c9MjUwMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_258/82ad19c1961c43f57b3fd5fc25205178", "published_at": "2019-10-07"}