{"pub": "investing.com", "url": "https://investing.com/news/politics/keep-a-conservative-democrat-governor-or-go-republican-louisiana-voters-decide-1995506", "downloaded_at": "2019-10-13 00:16:36.741522+00:00", "title": "Keep a conservative Democrat governor or go Republican? Louisiana voters decide", "language": "en", "text": "By Alexandra Alper and Jonathan Allen\n\nLAKE CHARLES, Louisiana (Reuters) - Louisiana voters were casting ballots on Saturday in the governor's race, with U.S. President Donald Trump urging people to choose one of two Republicans in the race to force a run-off election against incumbent John Bel Edwards, a conservative Democrat.\n\nTrump, a Republican, led a rally with thousands of cheering supporters on Friday night in Lake Charles in the hope of ousting the only Democratic governor of a Deep South state.\n\nEdwards has criticized what he called efforts to nationalize the state race but also promised to work closely with Trump should he win a second term.\n\n\"I don't think Louisiana should be taking its inspiration from the partisanship of D.C.,\" he told reporters at a news conference in Lake Charles on Friday. \"I think Washington, instead, should take inspiration from the bipartisanship of Louisiana.\"\n\nEdwards holds more socially conservative views than many in his party, which he touts to voters as making him able to work well with people from different political stripes, running ads that include praise for his tenure from Republican state senators and business leaders.\n\nAn observant Roman Catholic, he opposes abortion, and this year signed a law banning the procedure after 15 weeks.\n\nTrump is urging voters to pick either Eddie Rispone, a little-known construction entrepreneur, or U.S. Representative Ralph Abraham.\n\nUnder Louisiana's unusual primary election system, all candidates appear on the same ballot regardless of party affiliation. If no candidate wins an outright majority in Saturday's vote, a run-off election between the top two will be held on Nov. 16.\n\n\"I need you to send the radical Democrat establishment a loud and clear message,\" Trump said at his Friday rally. \"You are going to fire your Democrat governor who is doing a lousy job.\"\n\nEdwards was a U.S. Army captain and a lawyer before being elected to the Louisiana House of Representatives in 2008. He became governor after winning 56 percent of the vote against David Vitter, a Republican, in 2015.\n\nHe has generally avoided criticizing Trump, saying the two have worked well together on criminal justice reform.\n\nEdwards spent election day encouraging people to vote in New Orleans and Baton Rouge, pausing in the morning to meet with city officials and first responders after a construction site in New Orleans collapsed, killing at least one person.", "description": "Keep a conservative Democrat governor or go Republican? Louisiana voters decide", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF9B0NU_L.jpg", "published_at": "2019-10-12"}