{"pub": "fox", "url": "https://foxnews.com/media/cia-bryan-dean-wright-whistleblower-ukraine-impeachment", "downloaded_at": "2019-10-07 20:19:51.984045+00:00", "title": "Former CIA officer questions whether second whistleblower also has political bias", "language": "en", "text": "After a second whistleblower claimed to have information regarding President Trump’s controversial phone call with the Ukrainian president, former CIA officer Bryan Dean Wright said on Monday that an impeachment inquiry based on two anonymous whistleblowers is “absurd.”\n\n“We know that the [first] whistleblower has some political bias toward the Democratic Party, does the second whistleblower as well?” Wright, a Democrat, asked on “Fox & Friends.”\n\n“I’d like to know that but, unfortunately, we’re not supposed to ask that question. We’re just supposed to impeach the president based on this limited understanding of these whistleblowers.\"\n\nATTORNEYS FOR WHISTLEBLOWER CONFIRM NEW INDIVIDUAL WITH FIRSTHAND KNOWLEDGE OF TRUMP UKRAINE CALL HAS COME FORWARD\n\nWright said that there are “only a handful of people” in the senior level of the intelligence community looking at the Ukrainian issue.\n\n“It is almost a certainty that the second whistleblower is connected to the first,” he said.\n\nAttorney Mark Zaid, who represents both whistleblowers, first told ABC News that the second individual is – like the first whistleblower – an intelligence official, and has firsthand knowledge of certain allegations contained in the first whistleblower complaint, which was not based on any firsthand knowledge.\n\nAndrew Bakaj, a managing partner of the firm handling the case, verified the existence of the new whistleblower Sunday morning.\n\nHOUSE MINORITY LEADER MCCARTHY PUSHES BACK ON DEMOCRATS' IMPEACHMENT AGENDA AND CALLS OUT ADAM SCHIFF\n\nThe first whistleblower was subjected to criticism from President Trump and his supporters based on the lack of direct knowledge of the president’s conversation with Ukrainian President Volodymyr Zelensky, as well as what Trump has called an inaccurate description of the call.\n\nThat complaint alleged that Trump pressured the Ukrainian leader into investigating former Vice President Joe Biden's son Hunter's involvement with Ukrainian energy company Burisma Holdings, as well as Joe Biden's involvement in the termination of the prosecutor who was investigating the firm. Both Trump and Zelensky claim that no such pressuring took place.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nWright stressed that the transcript of the call has been released and Americans can determine whether Trump went too far before the 2020 election.\n\n“I don’t think he did and I don’t think most people do,” Wright said.\n\nFox News' Ronn Blitzer contributed to this report.", "description": "After a second whistleblower claimed to have information regarding President Trump’s controversial phone call with Ukrainian President Volodymyr Zelensky, former CIA officer Bryan Dean Wright said on Monday that an impeachment inquiry based on two anonymous whistleblowers is “absurd.”", "authors": ["Joshua Nelson", "Joshua Nelson Is A Freelance Reporter For Fox News."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Screen-Shot-2019-10-07-at-12.12.44-PM.png", "published_at": "2019-10-07"}