{"pub": "newrepublic", "url": "https://newrepublic.com/article/155168/real-costs-war-afghanistan", "downloaded_at": "2019-09-27 11:31:36.338797+00:00", "title": "The Real Costs of the War in Afghanistan", "language": "en", "text": "Now in its 19th year, the Afghanistan war just won’t end. Negotiations between the U.S. and the Taliban are now dead, according to President Donald Trump. The president, who once clamored for an end to the war, has instead overseen an increase in bombing. Last week, citing rampant corruption in the country, Secretary of State Mike Pompeo cancelled $100 million in aid intended to fund infrastructure projects in Afghanistan, a reminder that the Afghan government stood up by U.S. forces in 2002 still struggles to provide security and stability. The U.S. is staring at the prospect of an even longer presence in Afghanistan—so long that nine former senior U.S. senior envoys to Afghanistan made a case earlier this month that the war actually isn’t that costly and that a significant long-term American troop presence, perhaps even for decades, is feasible.\n\n“U.S. fatalities are tragic, but the number of those killed in combat make up less than 20 percent of the U.S. troops who died in non-combat training incidents last year,” those officials—who include Bush-era appointee John Negroponte and Bush-Obama veteran Ryan Crocker—wrote in their plea not to pull troops out of Afghanistan prematurely. “U.S. direct military expenditures in Afghanistan are approximately 3 percent of annual US military spending, down by about 90 percent from the high point of the war.” These facts were apparently cause to be sanguine about continued occupation: “The lives and money being expended are serious, but the costs are ones we can sustain for negotiations to result in a sustainable peace.”\n\nThe modern American way of war has obscured many of the traditionally visible costs of waging war.\n\nThere are many ways to measure the costs of something as complicated as war. The ambassadors’ cherry-picking method—to focus solely on deaths of service members and line-item budget costs—is to ignore the considerable indirect costs of war, costs that can’t be wished away. The modern American way of war, with an all-volunteer force and financing raised via debt instead of taxes, has obscured many of the traditionally visible costs of waging war that have often led to popular resistance. Before the American populace—especially the portion asked to serve in this multi-generational war—is involuntarily committed to another 20 years, it’s worth asking what a real, honest cost-benefit analysis of the war might look like.\n\nA baseline annual cost for the United States to continue its war in Afghanistan is approximately 10 to 15 U.S. service member fatalities each year. (With 17 fatalities thus far in 2019, this year has been the deadliest year for the U.S. since 2014.) Additionally, the war costs approximately $50 billion per year; the U.S. Department of Defense estimates $45 billion, while others place it at $52 billion.", "description": "As America's longest war drags on, some Beltway denizens argue that it can be sustained for decades more.", "authors": ["Adam Wunische"], "top_image": "https://images.newrepublic.com/024f705e359ceed3f200cfda242d2253ec4863d7.jpeg?w=1109&h=577&crop=faces&fit=crop&fm=jpg", "published_at": "2019-09-27"}