{"pub": "reuters", "url": "https://reuters.com/article/us-thomascookgrp-investment-turkey/thomas-cook-owes-turkeys-tourism-sector-381-million-council-idUSKBN1WG3DQ", "downloaded_at": "2019-10-01 09:28:00.581340+00:00", "title": "Thomas Cook owes Turkey's tourism sector $381 million - council", "language": "en", "text": "FILE PHOTO: A note that warns Thomas Cook holiday makers is seen at a reception of a hotel after Thomas Cook, the world's oldest travel firm, collapsed stranding hundreds of thousands of holidaymakers around the globe and sparking the largest peacetime repatriation effort in British history, in Fethiye, Turkey, September 24, 2019. REUTERS/Umit Bektas/File Photo\n\nISTANBUL (Reuters) - Turkey’s Tourism Advisory Council said on Tuesday it estimates that Thomas Cook owes the local sector more than 350 million euros ($381.08 million), adding that it was impossible for the amount to be re-paid in the short- and medium-term.\n\nThomas Cook, the world’s oldest travel agency, collapsed last week leaving more than half a million people stranded around the globe. Turkey’s Tourism Ministry had said it was working with the Finance Ministry to extend a loan package to businesses affected by the collapse.\n\nThe Advisory Council, including members of Turkey’s tourism associations, said businesses should be offered a much bigger loan package than the government’s planned 50 million euros - and that it should have long maturity terms, low interest rates and a grace period of three years.\n\nSmaller businesses should be prioritized while giving out loans, the council added.", "description": "Turkey's Tourism Advisory Council said on Tuesday it estimates that Thomas Cook owes the local sector more than 350 million euros ($381.08 million), adding that it was impossible for the amount to be re-paid in the short- and medium-term.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191001&t=2&i=1435824091&w=1200&r=LYNXMPEF902CS", "published_at": "2019-10-01"}