{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7605763/Centenarian-celebrates-birthday-dancing-night-away.html", "downloaded_at": "2019-10-24 02:43:07.613194+00:00", "title": "Centenarian celebrates his birthday by dancing the night away", "language": "en", "text": "A centenarian spent his milestone birthday dancing through the night.\n\nWar veteran Owen Filer celebrated his 100th birthday last Saturday with his family and friends in Cwmbran, South Wales.\n\nHe was caught on camera wowing guests with dance moves to his favourite tunes including In The Mood, Rock Around The Clock and Wake Up Little Susie.\n\nIn the video, Owen can be seen on the dance floor dressed in a black suit, white shirt and a purple tie.\n\nHe is joined by guests who groove with him as the DJ stands behind on a raised platform.\n\nOther guests watch on in admiration and record his performance on their mobile phones.\n\nWar veteran Owen Filer celebrated his 100th birthday last Saturday with his family and friends in Cwmbran, South Wales\n\nHe wowed his guests with his dance moves to his favourite tunes including In The Mood, Rock Around The Clock and Wake Up Little Susie. Other guests watched on in admiration and recorded his performance on their mobile phones\n\nOwen puts on an impressive display as he bops to the beat and twirls around, aided by his walking stick.\n\nHe takes centre stage with a young dance companion before kissing her on the cheek, which is where the video ends.\n\nThe now 100-year-old still lives alone and looks after himself including cooking and cleaning.\n\nThe former Royal Military Policeman said he keeps in shape by taking long walks and believes his nightly ritual of a small glass of whisky and a single piece of dark chocolate is to thank for his longevity.\n\nThe now 100-year-old (pictured with his wife and children) still lives alone and looks after himself including cooking and cleaning\n\nThe widower (far left) is a father-of-four and has ten grandchildren and fourteen great-grandchildren. In total, 80 people joined him at his birthday bash\n\nThe widowed great-grandfather-of-fourteen said: 'I feel very lucky and very grateful to have come this far. Clearly someone upstairs is looking after me.\n\n'Celebrating with my family was beautiful. It was wonderful.\n\nOwan was driven to his party in a luxury car that his son Barry, 70, had specially booked for him\n\n'I love music and even though I've got arthritis in one of my knees as soon as In the Mood came on I decided to get up and give it a go.\n\n'I thought it's my birthday party so I can do what I like.'\n\nOwen, who was married to his wife Elunyd till her death in 2004, served in India during the Second World War and worked for British Rail from the age of 15.\n\nThe couple went on to have four children and Owen now has ten grandchildren and fourteen great-grandchildren.\n\nHe was driven to his party in a luxury car that his son Barry, 70, had specially booked for him.\n\nBarry said: 'He was a little apprehensive about the party beforehand because he wasn't sure who would come. In the end 80 people came along.\n\n'As soon as the music started he got going and didn't stop till 11pm.\n\n'I'm sure he'll keep on dancing away. He lives totally independently and does all his own cooking, washing and ironing.\n\n'He goes out every morning to get a loaf of bread and some milk and writes to his grandchildren and great-grandchildren.'\n\nOwen received a card from the Queen to mark his milestone birthday\n\nInside it read: 'I am so pleased to know that you are celebrating your one hundredth birthday on 19th October, 2019. I send my congratulations and best wishes on such a special occasion'\n\nLooking back on his long and eventful life, Owen said he has some top tips for people.\n\nHe said: 'Look after your body and live healthily.\n\n'I was born just after the end of the First World War and lived through the Great Depression. My father was unemployed and times were tough\n\n'Work hard at school. Live properly. Everything these days is fast and furious, you can get everything done in minutes. Take time to appreciate the small things.'", "description": "Owen Filer celebrated his 100th birthday last Saturday with his family and friends in Cwmbran, South Wales, by dancing to hits including Rock Around The Clock and Wake Up Little Susie.", "authors": ["Raven Saunt For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/19/20095630-0-image-a-40_1571854954533.jpg", "published_at": "2019-10-23"}