{"pub": "bbc", "url": "https://bbc.com/news/world-europe-49833914", "downloaded_at": "2019-09-25 23:30:55.671063+00:00", "title": "World postal rates overhauled after US quit threat", "language": "en", "text": "Image copyright Bloomberg Image caption Under the new deal, countries delivering high volumes of imported mail will be able to set their own postal rates\n\nThe UN's postal agency has voted unanimously to reform its fees, potentially averting a US withdrawal.\n\nThe compromise deal was agreed after two days of emergency talks by the Universal Postal Union (UPU) in Geneva.\n\nThe agreement means the US and other high volume importers can set their own rates for delivering mail from abroad.\n\nThe US had earlier threatened to pull out, arguing that discount rates for countries such as China were putting the US at a massive disadvantage.\n\nIt said that it had become cheaper for US consumers to ship items from China rather than buying domestically. As a result, it argued this was unfair to US manufacturers and was costing the US Postal Service up to $500m ($404m) a year.\n\nThe UPU is a 145-year-old agency that sets the prices of international mail, with the mandate of ensuring that global postage is affordable to all.\n\nIts 193 members are categorised into different postal rates based on their economic and postal development.\n\nWhat reaction has there been?\n\nUPU Director-General Bishar Hussein called the new agreement an \"historical moment\", but conceded that higher rates would mean more costs for some people.\n\nWhite House trade advisor Peter Navarro, who led the US delegation, also hailed the decision during a press conference on Wednesday.\n\n\"We will begin our self-declared rates at the end of June next year. This is exactly what we wanted and planned for,\" he told reporters.\n\nWhat will change under the new deal?\n\nFrom January 2021, high-volume importers will be able to impose \"self-declared rates\" for delivering foreign mail and packages.\n\nCountries that import more than 75,000 tonnes (75m kgs) of post every year can apply their own rates by July 2020.\n\nA five-year period for phasing in new fees has also been agreed upon to help with the transition.\n\nImage copyright AFP Image caption UPU director general Bishar Abdirahman Hussein had called Wednesday's vote a \"very tense\" moment\n\nWhite House trade advisor Mr Navarro said that, under the renewed arrangement, \"China is certainly going to pay more for the privilege of shipping to our market\".\n\nChina's delegation supported the deal, and said during talks that it had been \"actively working... to find a positive solution and compromise\".\n\nWhy is the current system controversial?\n\nUnder the UPU's remuneration system, national postal operators are compensated for delivering mail from abroad.\n\nIn theory, higher rates are applied to highly developed countries, and lower rates to those that are least developed.\n\nImage copyright AFP Image caption White House trade adviser Peter Navarro (left) has called the current mailing system \"broken\"\n\nBut several members complain that advanced economies like China have been miscategorised and are paying lower rates than they should be.\n\nThe UPU had previously pledged to discuss changes to the system, which is already reviewed by members every four years.\n\nBut the US signalled last October that it would leave unless the system was changed, and members voted earlier this year to hold emergency talks.\n\nHad America withdrawn, it would have been the first country to do so in UPU history.", "description": "The UN's postal agency hailed the agreement but said it would mean higher costs for some people.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/15F78/production/_108967998_gettyimages-1074553844-594x594.jpg", "published_at": "2019-09-25"}