{"pub": "businessinsider", "url": "https://businessinsider.com/paypal-tech-data-innovation-stripe-square-2019-9", "downloaded_at": "2019-09-13 00:57:31.640738+00:00", "title": "PayPal's CTO says data is the secret sauce to help it tailor payments for customers and beat out competitors like Stripe and Square", "language": "en", "text": "Sri Shivananda, PayPal's chief technology officer, explained to Business Insider how critical data is to ensuring the online payment processor stays ahead of competitors like Square and Stripe.\n\nWhile data plays a key role in PayPal's cybersecurity and fraud detection, Shivananda wants to use the information to offer more customized experiences to users.\n\nClick here for more BI Prime stories.\n\nThe head of technology at one of the largest online payment processors sees data as key to keeping his company ahead of the curve in an increasingly competitive field.\n\nSri Shivananda, PayPal's chief technology officer, told Business Insider data is \"the new oil\" and understanding how to use it in the most effective ways is one of his top priorities as he works to fend off upstart competitors in the space such as Square and Stripe.\n\n\"Data is the fuel based on which there is so much differentiation that can be done,\" Shivananda said. \"Data can be converted into information and the information can be converted into insights. When the insights are aggregated that becomes knowledge, and that knowledge becomes a differentiator for us to do so many different things.\"\n\nRead more: Here's how PayPal turned over 40 rivals into partners to become the go-to payments provider after splitting from eBay\n\nDifferentiation has become increasingly important for the payments provider, as the launch of both Square and Stripe over the past decade have introduced a new, agile type of competitor. PayPal has managed to partner in recent years with many of the larger companies in the payments space it previously considered competitors, but the newer entrants still represent a threat.\n\nTo be sure, PayPal remains a monster in the space. In 2018, its total payment volume was $578 billion, a 27% increase from the previous year. Square, in comparison had a gross payment volume of $23 billion, during the same period.\n\nBut competition is fierce. Stripe raised $245 million in September 2018, valuing the company at $20 billion and making it one of the highest-valued fintechs in the world. It also recently announced plans to get into lending.\n\nGetting hyper personal\n\nThe most obvious use cases for PayPal's data amounts to developing strong protections against cyber attacks and identifying fraudulent purchases. Jim Magats, PayPal's senior vice president of payments, product, and engineering, previously told Business Insider the firm recently began sharing its internal risk score, which is akin to a FICO score, with partners such as Visa and Mastercard in an effort to increase the number of transactions approved between them.\n\nHowever, Shivananda sees data being useful for PayPal beyond just keeping it secure. It's also about delivering catered experiences to customers. Part of that includes going beyond a one-size-fits-all product for every PayPal user.\n\nFor example, studying a user's transaction history could lead to a better understanding of the way he or she prefer to pay for things, leading to a more seamless process when shopping.\n\n\"It will get to a place where we don't build a single, vanilla experience for every customer that we have,\" he said. Being able to segment and eventually being able to personalize for each individual, that's a big place where we can leverage data.\"\n\nOffering a hyper-personalized experience means a person will face less friction when trying to buy something. For example, moving away from multifactor authentication — getting a one-time password to confirm your identity — and instead using device- or location-related data that would allow for approval of transactions without bothering the customer.\n\nCustomer support is another area the tech head said PayPal can look to use data. Beyond answering customers' questions quickly, Shivananda said it's about getting to the source of the issue and addressing it so others don't face similar problems.\n\nPayPal's CFO, John Rainey, previously told Business Insider he believes the company can save roughly $25 million a year by applying artificial intelligence to areas of customer service.\n\nData also serves as the means to measure how PayPal handles all of these topics, whether it is responses to cyber attacks, the reliability of systems, or just how information flows throughout the company. All of it can be measured and analyzed, Shivananda said.\n\nSee more: PayPal's CFO believes AI can save the company $25 million a year by automating one area of customer service\n\nThat being said, Shivananda acknowledged the fine line businesses need to walk when it comes to using customer data.\n\n\"Personalization will take a greater hold on the shopping experience, but will also present challenges to businesses as they find a balance between personalizing their offerings and ensuring consumers feel their privacy is being respected,\" he said.\n\nAll of that comes from a strong foundation of how a firm stores, moves, processes, manages and creates data. That's not such an easy task with so much data sitting across the entire organization that has 267 million accounts and handled just shy of 10 billion payment transactions in 2018.\n\nAs a result, Shivananda said PayPal developed a data development life cycle. The goal is to make it simple for employees throughout PayPal to pull the data they need at any time.\n\n\"Make it equally easy for engineers across every different business unit to be able to leverage data, start to experiment and generate insights and eventually convert them into experiences for customers,\" he said.", "description": "Sri Shivananda, PayPal's chief technology officer, told Business Insider about the payment provider's approach to", "authors": ["Dan Defrancesco"], "top_image": "https://image.businessinsider.com/5d77bdce2e22af53826c4989?width=1200&format=jpeg", "published_at": "2019-09-12"}