{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/chris-packham-hits-back-boris-20566858", "downloaded_at": "2019-10-13 00:26:03.486772+00:00", "title": "Chris Packham hits back at Boris Johnson and says 'I'd get arrested to save planet'", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nChris Packham has hit back at Boris Johnson’s jibe about Extinction Rebellion activists saying: “History will not look favourably on him.”\n\nThe TV wildlife guru was stunned when the PM dismissed the protesters in a speech this week as “crusties” who live in “hemp-smelling bivouacs”.\n\nMore than 1,290 people, including Belgium’s Princess Esmeralda, 63, have been arrested in London since Monday as more than a million people took to the streets around the world.\n\nProtesters in the capital included a bishop, an ex-police chief, a Paralympic gold medallist, and a former banker.\n\nSpringwatch star Chris warned: “The lack of attention to the climate emergency will come back to bite people.\n\n(Image: PA)\n\n(Image: AFP via Getty Images)\n\n“This is about the health of our planet. History will not look favourably on anyone who calls us ‘uncooperative crusties’. We have to put them in a ­position where they have to listen.”\n\nChris, 58, indicated he is expecting a long-fought battle – saying he was prepared to get himself arrested, but “much later” when the time was right.\n\nHe added: “The emotion I feel most of the time is frustration and anger. The best thing is to channel it into activism.”\n\nExtinction Rebellion set up camp in Trafalgar Square for the week’s protests. Supporters glued themselves to ­buildings, barricaded the BBC and tried to halt flights at London City Airport.\n\n(Image: Sonja Horsman)\n\nParalympic cycling gold medallist James Brown was yesterday banned from going near any UK airport after denying causing a public nuisance by gluing himself to the top of a plane.\n\nBrown, 55, was bailed by Westminster magistrates to appear at crown court next month.\n\nThere were more arrests today at a blockade of Billingsgate fish market.\n\n(Image: Sonja Horsman)\n\n(Image: Sonja Horsman)\n\nRob Cooper, an ex Devon and Cornwall Chief Superintendent, was also at the protests.\n\nRob, 60, said: “I joined for the same reasons I joined the police – to protect my community. I’m concerned for everybody, but especially for my five-year-old granddaughter.”\n\nDr Deepa Shah, 36, a GP in Hackney, East London, said she felt obliged to protest as climate change “is a massive risk to the health of future patients”.\n\n(Image: Sonja Horsman)\n\nMethodist minister Jo Rand, 42, from Cumbria – locked up for 24 hours – said: “As a community leader I have to do something. I read a Bible and prayed. I thought, what a gift.”\n\nBishop of Liverpool Paul Bayes, 65, also protested.\n\nHe said: “I’m a grandfather of three, I’d like them to grow up. It’s a non-violent group who want to make a difference – the church should be with them.”\n\nFormer banker Andrew Medhurst, 53, of Wandsworth, south-west London, said: “I was in a pension company encouraging people to save for the next 30 years. It felt fraudulent.”", "description": "EXCLUSIVE: TV wildlife expert Packham says 'history will not look favourably' on Johnson after Extinction Rebellion 'crusties' jibe", "authors": ["Halina Watts", "Image", "Tim Merry", "Pa", "Afp Via Getty Images", "Sonja Horsman"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20566403.ece/ALTERNATES/s1200/1_PROD-HS2.jpg", "published_at": "2019-10-12"}