{"pub": "foxbusiness", "url": "https://foxbusiness.com/politics/trump-administration-still-considering-tariff-on-french-wine-report", "downloaded_at": "2019-09-08 11:46:33.444758+00:00", "title": "Trump administration still considering tariff on French wine: report", "language": "en", "text": "The White House plans to continue examining the effects of a French digital tax on U.S. companies -- an investigation that could lead to tariffs on French wine and other goods, according to a report from Bloomberg News.\n\nContinue Reading Below\n\nThe probe is reportedly being conducted under the same statute used by the U.S. to impose more than $350 billion of tariffs on China and could clear the way for the Trump administration to target French exports, according to Bloomberg.\n\nThe news comes almost two weeks after a face-to-face meeting between President Trump and French President Emmanuel Macron in Biarritz, France, at the G-7 summit. Macron told reporters at the time that he and Trump “have reached a very good agreement.”\n\nAt the end of July, France began imposing a 3 percent tax that targets companies worth at least 750 million euros ($834 million) globally and 25 million euros in France. The tax is temporary until the Organization for Economic Cooperation and Development determines how to tax digital companies.\n\nStill, the tax angered Trump, who threatened to reciprocate with a tariff on French wine.\n\nAdvertisement\n\n“France just put a digital tax on our great American technology companies,” Trump wrote in a tweet in July. “If anybody taxes them, it should be their home Country, the USA. We will announce a substantial reciprocal action on Macron’s foolishness shortly. I’ve always said American wine is better than French wine!”\n\nDuring the G-7, France agreed to refund any difference between the digital tax and what taxes come out of the OECD, Bloomberg reported.\n\nIf Trump levies tariffs on France, the European Union vowed to “respond in kind.”\n\nSpeaking at a press conference during the G-7 summit, the president of the European Council, Donald Tusk, said the 28-member body is prepared to stand by France if Trump moves forward with his threat to slap an import duty on French wines.\n\n“I will protect French wine with genuine determination for many reasons,” Tusk said, adding, “The EU stands by France. If the U.S. imposes tariffs on France, the EU will respond in kind.”\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "The news comes almost two weeks after a face-to-face meeting between President Trump and French President Emmanuel Macron.", "authors": ["Megan Henney"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/08/0/0/Trump-Macron.jpg?ve=1&tl=1", "published_at": "2019-09-07"}