{"pub": "breitbart", "url": "https://breitbart.com/news/de-gea-says-sorry-after-man-utds-latest-flop", "downloaded_at": "2019-10-07 00:18:34.109653+00:00", "title": "De Gea says sorry after Man Utd’s latest flop", "language": "en", "text": "Newcastle (United Kingdom) (AFP) – David de Gea apologised to Manchester United supporters after his troubled side slumped to a dismal 1-0 defeat at Newcastle on Sunday.\n\nOle Gunnar Solskjaer’s side sit just two points above the relegation zone and have not won away since March after Matty Longstaff’s second-half winner for Newcastle.\n\nUnited goalkeeper De Gea admitted this is the toughest time he has experienced since moving to Old Trafford in 2011.\n\nThe Spaniard was at a loss to explain exactly why United are off to their worst start since 1989.\n\n“Yes, it probably is the most difficult time since I’ve been here,” De Gea told Sky Sports.\n\n“I don’t know. I don’t know what is happening, we cannot score even one goal in two games.\n\n“It’s difficult to say something, sorry to the fans, we will keep fighting for sure. We will come back but at the moment we are in a difficult situation.\n\n“The whole season has been not good, so keep going, keep fighting, and let’s see what happens in the next games.”\n\nMeanwhile, former United defender Gary Neville blamed the club’s transfer policy for their current struggles.\n\n“Away from home, they’re not set up to win in a sense of the mentality. They let games drift, I think they play OK in games, but they’re not ruthless, they’re not clinical,” Neville told Sky Sports.\n\n“The quality is not right, the depth of their squad is not good enough and they have taken a step back.\n\n“Their recruitment has been bad now and woeful. They need five or six top players into that squad, and are going to cost a lot.\n\n“They (club board) have cocked this up over many years. They cocked it up, they are responsible for this, with poor recruitment and selection of managers.”", "description": "Newcastle (United Kingdom) (AFP) – David de Gea apologised to Manchester United supporters after his troubled side slumped to a dismal 1-0 defeat at", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/06/cc82a2_manchester-united-goalkeeper-david-de-gea-apologised-loss-newcastle-de-640x335.jpg", "published_at": "2019-10-06"}