{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/2019/09/04/trump-admits-his-trade-war-is-hurting-stock-market", "downloaded_at": "2019-09-04 23:48:13.008984+00:00", "published_at": "2019-09-04", "title": "Trump admits his trade war is hurting the stock market", "language": "en", "text": "The comment came in the same appearance in which Trump held up a doctored chart showing Hurricane Dorian’s potential path. And it represented a subtle but notable shift from what he’s been saying as signals of a potential economic slowdown have increased. The latest came Tuesday with a report that U.S. manufacturing contracted last month for the first time in three years.\n\nAD\n\nAfter touting the benefits of his trade war for months, Trump has made three key concessions in the past few weeks on matters he had earlier denied or deflected: American companies pay the tariffs on the goods they import; those costs can be passed on to consumers; and those increased costs can lead to an economic slowdown.\n\nAD\n\nBut Trump’s acknowledging that the U.S. stock market is likely to have taken a hit from his trade war is perhaps his most telling trade war concession. Trump has tethered his job performance as president to the stock market and regularly criticized his predecessors when stock market performance was poor.\n\nThe Trump vs. Obama economy — in 15 charts\n\nFor months, Trump blamed the Federal Reserve for the slowing of U.S. economic growth and for the volatility in U.S. markets.\n\nAD\n\n“If [the Fed] would have not done the quantitative tightening, our market would have been up another 10,000 points,” Trump said in June.\n\n“If [interest rates] weren’t raised so fast, you would see another, probably, 10,000 points on the Dow,” Trump said in July.\n\nNow, as Trump’s own economic policies undermine his stated economic goals, he is pivoting from touting immediate benefits of a trade war to talking up long-term benefits of a trade war, while painting himself as willing to take political risks to achieve them.\n\nThe question for Trump is whether voters will see it that way, too.\n\nAD", "description": "“If I wanted to do nothing with China, my stock market — our stock market — would be 10,000 points higher than it is right now,” President Trump said on Wednesday.", "authors": ["Jm Rieger", "Video Editor For The Fix"], "top_image": "https://www.washingtonpost.com/resizer/folDzJ4h5S3bl1Zh3WrS088x980=/1440x0/smart/d1i4t8bqe7zgj6.cloudfront.net/09-04-2019/t_c9d4ee0ac0944858a85d6f4bf891d68d_name_3e491ed6_cf50_11e9_a620_0a91656d7db6_scaled.jpg"}