{"pub": "businessinsider", "url": "https://businessinsider.com/katrina-lake-harvard-business-school-shark-tank-stitch-fix-2019-9?r=rr", "downloaded_at": "2019-09-29 05:05:42.759521+00:00", "title": "The newest 'Shark Tank' judge explains how a Harvard MBA fit into her decision to become an entrepreneur — and how she founded a personal-styling company worth $1.9 billion", "language": "en", "text": "Katrina Lake knew she would spend more time pursuing her goals outside class than in it. She applied to Harvard Business School anyway.\n\nThe idea, Lake told Business Insider correspondent Shana Lebowitz, was to make sure she had a fallback plan just in case her big idea for a company didn't work. In this case, her plan B would be most people's unattainable plan A.\n\n\"I went to school thinking I can be a mediocre student and just get by in school, but spend as much as my free time as I can on getting this company off the ground,\" Lake said. \"I wanted to get the company off the ground and pay back my salary, pay down my student loans the day I graduate. And if I wasn't able to do that, then the risk profile of entrepreneurship wasn't going to be for me.\"\n\nLake went on to found Stitch Fix, a personalized-clothing service that continues to grow exponentially. The company went public in 2017. The service passed $1 billion in net revenue for fiscal year 2018, and based on its most recent quarterly report, it has raised its revenue expectations for fiscal year 2019. It sits at a $1.89 billion market cap as of this writing.\n\nWhen Lake was considering business school, however, she didn't know Stitch Fix would succeed as spectacularly as it did. Lake has previously said she was risk-averse growing up and even thought about applying to medical school. That perspective on risk should be interesting to watch, as Lake is going to be a guest judge on the newest season of \"Shark Tank.\"\n\nLake ultimately decided against medicine. She majored in economics at Stanford and got her MBA at Harvard.\n\nThe idea for a company in the retail space had already taken root by the time she applied to business school, but she didn't outright admit in her essays that she wanted to start a company.\n\n\"I think I said that I'm going to lead a company that is transforming apparel retail and I talked about the space and why I was interested in it, but even in my application essay I wasn't bold enough to say, I'm going to start a company,\" Lake said.\n\nWhen she got to campus, though, she did everything around entrepreneurship that she could, in classes and clubs and everything in between.\n\n\"I was able to set goals and to have a plan where I could pursue entrepreneurship, but in a way that didn't feel like crazy, scary, disruptive to me in my life,\" Lake said.\n\nThe key, she said, is understanding the potential of your idea when you have it and then structuring a plan so that you navigate entrepreneurship in the best way for you. Lake's approach stands in contrast to the stereotype of the Silicon Valley dropout, and that's because she matched her path to the level of risk she would face along it.\n\n\"That was the way that I could find entrepreneurship tenable given my risk profile,\" she said.", "description": "The Stitch Fix founder and \"Shark Tank\" judge reveals how she started her company — and how going for an MBA mitigated the risks of entrepreneurship.", "authors": ["Sherin Shibu", "Shana Lebowitz"], "top_image": "https://amp.businessinsider.com/images/5d8b8b722e22af36690898e3-2732-1366.jpg", "published_at": "2019-09-27"}