{"pub": "yahoo", "url": "https://news.yahoo.com/florida-teen-died-protecting-5-202128614.html", "downloaded_at": "2019-10-03 10:53:22.764914+00:00", "published_at": "2019-10-01", "title": "Florida teen died protecting his 5-year-old sister during a burglary, police say", "language": "en", "text": "A 15-year-old boy in Florida died while protecting his younger sister during a burglary, police said.\n\nKhyler Edman was found dead in his home in Port Charlotte, Florida, Thursday, according to the Charlotte County Sheriff’s Office. Police initially responded to reports of an injured person acting strangely in Edman's neighborhood around 4 p.m.\n\nA man fled as police arrived in the neighborhood. Shortly after, a neighbor called 911 to report that there was a burglar in his home. Police apprehended the man, identified as Ryan Clayton Cole, 27, who had several stab wounds on his hands and side.\n\nRelated Video: AP Top News Stories\n\nAuthorities canvassed the area and discovered a second home had signs of forced entry. Inside, they found Edman's body and his sister, who was unharmed.\n\n“The suspect had broken into this residence, a violent encounter ensued where we believe that teenager was trying to protect the home and protect their younger sibling,” Charlotte County Sheriff Bill Prummell said at a press conference held Friday.\n\n'He knew he was going to die': Purple Heart veteran dies after saving granddaughter from house explosion\n\nPolice believe Cole suffered his injuries during the \"violent encounter\" in Edman's home. Cole is charged with burglary and petit theft, and additional charges may be filed after further investigation into Edman's death.\n\n\"It was a senseless crime and we're doing our best to make sure that justice is served,\" Prummell said.\n\nA GoFundMe campaign set up to raise money for Edman's funeral costs has raised more than $50,000. Crystal Stone, one of the campaign's organizers, thanked donors and called Edman a \"hero\" in an update on the page.\n\n\"The outpouring of compassion and love everyone is showing this family has me at a loss for words,\" Stone wrote in an email to USA TODAY.\n\nFollow N'dea Yancey-Bragg on Twitter: @NdeaYanceyBragg\n\n\n\n\n\nThis article originally appeared on USA TODAY: Florida teen dies protecting his sister during a burglary: Police\n\n\n\n", "description": "A 15-year-old boy in Florida died Thursday while protecting his younger sister during \"a violent encounter\" with a burglar.", "authors": ["N'Dea Yancey-Bragg", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/OO4mLX6WilRcqrcKReq5Mw--~B/dz0wO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-us/usa_today_news_641/7b599a2d915c88f770796e5555fb383f"}