{"pub": "washingtonpost", "url": "https://washingtonpost.com/arts-entertainment/2019/10/10/masked-singer-patti-labelle-wayne-brady-sherri-shepherd-our-best-guesses-celebrities-disguise", "downloaded_at": "2019-10-10 18:44:01.901046+00:00", "title": "‘The Masked Singer’: Patti LaBelle? Wayne Brady? Sherri Shepherd? Our best guesses on the celebrities in disguise.", "language": "en", "text": "Here are our best guesses on the famous faces behind the Penguin, Fox and Flower masks.\n\n(Spoiler alert: We’ll update this post as the other celebrities are revealed.)\n\nFlower\n\nWhat we know about them: We would consider Flower a “legend” even if she hadn’t declared herself one because wow. Her performance of Dolly Parton’s “9 to 5” earned a standing ovation, and Flower beamed as she took it all in. Her intro package alluded to a love of cooking and an empire (which, on this show and — ahem — network, usually means “Empire”). This is a confident celebrity: When host Nick Cannon asked why she picked the Flower as her costume, she replied: “Because I’m beautiful and I smell so good.”\n\nAD\n\nAD\n\nWhat the judges thought: Flower’s references to “What’s Love Got to Do With It” and “Vision of Love” made the panel think of two very famous singers: Tina Turner and Mariah Carey, the latter of whom inspired some jokes at the expense of her ex-husband, Cannon. Judge Jenny McCarthy zeroed in on the “Empire” reference, and guessed Taraji P. Henson.\n\nFellow judge Robin Thicke suggested a few other names: Jennifer Hudson and Jessie J, among them. Judge Ken Jeong, naturally, went with Bjork.\n\nBut that voice could only be one celebrity, and judge Nicole Scherzinger was cautious as she tossed out her name: “I thought I heard Patti LaBelle’s voice in there.”\n\nAD\n\nPrevailing social media theories: LaBelle\n\nOur guess: This is Ms. Patti LaBelle, folks. (If that seems implausible, remember that Gladys Knight appeared on the first season.) The voice is the giveaway, but the cooking and empire (“Empire”) references support our hypothesis. Also, did you catch the mock degree from “Temple U”? LaBelle got an honorary degree from Temple University in 2010.\n\nAD\n\nPenguin\n\nWhat we know about them: Penguin referenced her avatar’s “very expressive” nature in her intro package, which found her repeating a frigid critique: “Clearly this bird did not get the word that her career is over.” Ouch. The video also included a prominent “I’m not your secretary” sign. Penguin assured us that she was ready to “bring the heat” despite being “cold as ice.” She also reminded us that “everything is not as black and white as it seems.”\n\nAD\n\nAhead of her performance of “The Middle” by Maren Morris and Zedd, she vowed to “sing for those of us who dare to be different.”\n\nWhat the judges thought: This one seemed to stump the panel. “That penguin is teeny tiny teeny,” volunteered McCarthy, who candidly confessed that the references to Penguin’s career being “over” made her think of Kathy Griffin. But Penguin’s voice made her think of a celebrity she suspected of being on the show in its first season: Sherri Shepherd. Thicke disagreed. He said he thought the Penguin “moved like” McCarthy’s Oscar-nominated cousin, Melissa.\n\nAD\n\nAD\n\nScherzinger, parsing the secretary reference, guessed Megan Mullally, whose “Will & Grace” character is technically a secretary to Debra Messing’s Grace.\n\nPrevailing social media theories: Singer-songwriter (and “Pitch Perfect” star) Ester Dean, Shepherd, Raven-Symoné and, uh, Tonya Harding.\n\nOur guess: We’re more confident about who this isn’t since we declared Raven-Symoné the Black Widow last week. And Penguin isn’t as powerful a singer as Dean, which leaves us to consider Shepherd (we’re disregarding the Harding suggestion because we just don’t hear it). Turns out Shepherd worked for years as a legal secretary before making her foray into showbiz.\n\nAD\n\nFox\n\nWhat we know about them: Like his nocturnal avatar, Fox told us he’s done his “best work at night.” He mentioned having two distinct “identities” — including an “on-air superhero.” When Cannon asked what made him the Fox he noted: “I’m quick, I refuse to be caged in and I’m crafty.”\n\nAD\n\nWhat the judges thought: Fox performed Maroon 5′s “This Love” but the judges thought he moved like Jagger. Nicole noted his “dancer’s stance.” “He moved like a professional performer,” Thicke agreed.\n\nThe panel fixated on certain clues in the Fox’s intro package — including his references to “Doogie” and “Doubtfire,” concluding these were probably references to Neil Patrick Harris and the late Robin Williams. McCarthy guessed the Fox had Broadway roots, and tossed out Tony Award-winning “Hamilton” star Leslie Odom Jr.\n\nAD\n\n“I think you’re an accomplished actor who many people don’t know sings,” said Jeong, who declared the Fox was his “Fast and Furious” co-star Tyrese Gibson. (The comedian may have missed the memo on Gibson’s early career.)\n\n“That ain’t Tyrese,” countered Thicke. Scherzinger, meanwhile, suggested actor Anthony Mackie, whose “Captain America” role fit with the Fox’s superhero reference.\n\nAD\n\nPrevailing social media theories: Wayne Brady\n\nOur guess: Brady, who worked with NPH on “How I Met Your Mother,” and with Williams on “Whose Line Is It Anyway.” He has also performed on Broadway and in Vegas. Plus, his acting career has run the gamut from soaps to sci-fi.\n\nRead more:\n\nAD", "description": "Is Ms. Patti LaBelle really on \"The Masked Singer\"? We think so.", "authors": ["Bethonie Butler", "Reporter Covering Television", "Pop Culture"], "top_image": "https://www.washingtonpost.com/resizer/qY5j64Zbx79Owx-0sjLzdOI-9Ec=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/R4LLRPNGNVF7DA6FO4MQRZLUP4.jpg", "published_at": "2019-10-10"}