{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/11/with-socialism-on-2020-ballot-republicans-need-fig", "downloaded_at": "2019-09-12 07:30:44.812688+00:00", "title": "With socialism on 2020 ballot, Republicans need fighters, not quitters", "language": "en", "text": "ANALYSIS/OPINION:\n\nWe are about to witness the dirtiest and bloodiest presidential campaign in living memory. And the stakes in the 2020 election could not be higher.\n\nConsider what is on the line: At least two Supreme Court seats could be filled in the next term, either locking in the conservative majority or turning it back. And redistricting for Congress and state legislatures will begin in January 2021, leading to maps that will remain in place for 10 years.\n\nThese two factors alone would make for a hugely consequential presidential election.\n\nBut the differences between President Trump and the ultimate Democratic nominee will also be sharp and meaningful.\n\nOn taxes, every Democratic presidential candidate is promising to rate hikes, some as high as 70% on individuals. Conversely, Mr. Trump passed the first major tax cut in a generation. His administration is considering additional tax cuts now.\n\nOn health care, the Democrats are either outright promising “Medicare for All,” which would make employer-based health care plans enjoyed by more than 180 million American illegal, or they are promising making Medicare available to everyone, which would crowd out private health plans and lead to single payer. Republicans want to improve access and affordability for private health care by allowing patients to choose what type of plan they want.\n\nOn energy, Democrats are pledging to end the fossil fuel industry, with Massachusetts Sen. Elizabeth Warren pledging to end fracking on her first day in office. Mr. Trump and the Republicans have overseen America improbably becoming an energy exporter, all while reducing carbon emissions through innovation.\n\nTuesday’s encouraging GOP victory in a special election in North Carolina’s 9th Congressional District should buck up worried Republicans.\n\nThis is a time to fight, not retire.\n\nSocialism will be on the ballot in November 2020.\n\nMost Democrats will deny they are socialists, but their urgent desire to limit the freedom of the private sector by growing the scope of government is socialism.\n\nDemocrats are promising historic levels of spending and they have no way to pay for their proposals. Taxing the rich will only go so far. Ultimately, Democrats will have to tax the middle class.\n\nRepublicans have an opportunity to run on a strong economy, with historically low unemployment, wages rising for the first time in over a decade and strong consumer spending. Mr. Trump has overseen the return of more than 500,000 manufacturing jobs. At a time when a global slowdown is occurring, America’s economy is growing.\n\nCombine that with the historic pace of conservative judicial confirmations, increases in border security, passage of criminal justice reform legislation, the rebuilding of our military and the defeat of the Islamic State and its caliphate, and Republicans have accomplishments to run on next year.\n\nWe have seen some Republicans choose to retire rather than seek reelection. That is their right. These jobs are not easy.\n\nBut this will be a crucial election and we need volunteers, not hostages.\n\nAny Republicans who ran for office with the goal of passing on a country of greater opportunity to the next generation needs to be willing to fight for it now.\n\nDemocrats and their media allies will again attempt to personally destroy the president. Republicans cannot let that happen.\n\nIf you didn’t enjoy the Obama years, you will hate the next Democratic administration.\n\nCan American survive four years of socialism?\n\nWe have seen how difficult it is to unwind Obamacare once the public is fed the free candy.\n\nJust imagine once they are fed free college, reparations, a carbon tax, and tax increases on “the wealthy.”\n\nRepublicans must prevent Democrats from taking this nation in the direction of Europe, which is manifestly failing. This will require focus, determination, hard work and a willingness to fight.\n\nI hope every Republican looks in the mirror and completely recommits to this battle. It will require nothing less.\n\n• Matt Mackowiak is president of Austin, Texas, and Washington, D.C.-based Potomac Strategy Group. He’s a Republican consultant, a Bush administration and Bush-Cheney reelection campaign veteran and former press secretary to two U.S. senators.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "We are about to witness the dirtiest and bloodiest presidential campaign in living memory. And the stakes in the 2020 election could not be higher.", "authors": ["The Washington Times Http", "Matt Mackowiak"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/09/Election_2020_Bernie_Sanders_23781.jpg-0a762_c0-229-5472-3419_s1770x1032.jpg?6f9ce78ee1a3a25672569ab4bf84dc3559d8855e", "published_at": "2019-09-11"}