{"pub": "reuters", "url": "https://af.reuters.com/article/sportsNews/idAFKCN1VS08T-OZASP", "downloaded_at": "2019-09-07 13:48:04.418185+00:00", "title": "Williams to battle 'street fighter' Andreescu in U.S. Open final", "language": "en", "text": "NEW YORK (Reuters) - The U.S. Open final on Saturday will have the feel of a street fight when two of the most powerful players in the women’s game exchange blows on the sport’s biggest stage with Grand Slam glory on the line.\n\nSerena Williams of the United States hits a volley against Elina Svitolina of Ukraine (not pictured) in a semifinal match on day eleven of the 2019 US Open tennis tournament at USTA Billie Jean King National Tennis Center. Mandatory Credit: Geoff Burke-USA TODAY Sports\n\nWhile the 37-year-old Serena Williams and her opponent, the upstart Canadian teenager Bianca Andreescu, could hardly be more different in terms of the depth of their experience, their styles are a near mirror image.\n\nWilliams, who is seeking an elusive record-equalling 24th Grand Slam singles title, has looked as good as ever during her stay at Flushing Meadows — crushing serves and pounding groundstrokes to reach her second major final of the year.\n\nStanding in her way is 19-year-old Andreescu, a fellow big-hitter and excellent mover, who took the tennis world by storm this year when she came out of nowhere to claim titles at Indian Wells and Toronto.\n\nOn the eve of the biggest match of her life, Andreescu’s coach Sylvain Bruneau told reporters she would not be intimidated by Williams or the moment.\n\n“Tomorrow is a tough task, for sure the toughest task she’s had this year in her young career,” he said.\n\n“But she’s a warrior and she’s a street fighter. She strives to compete.\n\n“I’m pretty confident she’s going to step in the arena tomorrow, both feet in, and go at it,” he said of the contest, which will play out before a raucous, Williams-supporting crowd at 23,771-seat Arthur Ashe Stadium.\n\n“She’s as tough as it gets as a competitor. She’s not scared. She goes for it ... the bigger the occasion, the bigger she hits.”\n\nWILLIAMS ON A MISSION\n\nWilliams will look to avoid the sort of dip in form she suffered in last year’s U.S. Open final and in the last two Wimbledon finals.\n\nThose defeats have kept her just shy of Margaret Court’s Grand Slam record since returning to the sport last year following childbirth.\n\nHer wealth of experience and excellent fitness, not to mention the laser-like focus she has brought to each of her first six matches in New York, could be enough to finally carry Williams to the Promised Land.\n\nHer coach, Patrick Mouratoglou, also believes her familiarity with the big stage could give her an edge.\n\n“It’s called pressure, and I think Serena had to experience a bit of pressure in her life,” he said of the 37-year-old, who learned tennis as a child from her father on courts in crime-ridden Compton, California.\n\n“And you can’t think that she’s not good at dealing with pressure.”\n\nWilliams appears fully recovered from the knee injury that forced her to pull out of the Miami and Rome tournaments earlier this year after just one match, giving her already lethal game an added dimension.\n\n“If you feel weak or not as strong as you wish you were, it’s more difficult to beat the pressure,” Mouratoglou said.\n\n“I think it’s a totally different situation now, because now she can move.\n\n“If she needs to play the rally, she can play the rally. We have seen that I think a few times during the tournament.\n\n“So there is no panic if she misses a bit more than usual. No problem. There are other options of play.”", "description": "The U.S. Open final on Saturday will have the feel of a street fight when two of the most powerful players in the women's game exchange blows on the sport's biggest stage with Grand Slam glory on the line.", "authors": ["Rory Carroll", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190907&t=2&i=1427206382&w=1200&r=LYNXNPEF860CB-OZASP", "published_at": "2019-09-07"}