{"pub": "yahoo", "url": "https://sports.yahoo.com/nfl-fines-ben-roethlisberger-for-wearing-a-watch-on-the-sideline-when-he-wasnt-playing-155044665.html", "downloaded_at": "2019-10-07 20:00:28.224330+00:00", "title": "NFL fines Ben Roethlisberger for wearing a watch. On the sideline. When he wasn't playing.", "language": "en", "text": "The NFL is on a roll these days with seemingly excessive player fines.\n\nBut really, do we expect anything different from the league?\n\nBen Roethlisberger ‘livid’\n\nScroll to continue with content Ad\n\nOn Sunday, ESPN’s Adam Schefter reported that Pittsburgh Steelers quarterback Ben Roethlisberger was fined $5,000 by the NFL for wearing an Apple watch on the sideline on Monday night — in a game he didn’t play in.\n\nCiting sources, Schefter writes that Roethlisberger was “livid” about the fine and is appealing it. Roethlisberger is bothered that he didn’t receive advance warning that he had violated a rule, just got the letter stating he’d been fined.\n\nInjured Pittsburgh Steelers quarterback Ben Roethlisberger, and his Apple watch (left wrist). (AP)\n\nThe NFL bans all electronic devices that transmit messages.\n\nIt was the first game back on the sideline for the 37-year-old after season-ending elbow surgery. Since he isn’t able to dress himself, his wife dressed him before the game and strapped the watch to his left wrist.\n\nEarlier in the week, New Orleans Saints linebacker Demario Davis revealed that the NFL had fined him over $7,000 for a uniform violation for wearing a headband under his helmet that reads “Man of God.”\n\nMore from Yahoo Sports:\n\n\n\n\n\n\n\n", "description": "Roethlisberger isn't happy with the penalty.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/xw2X8j8rWxFKXU_s2zLwwA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/ociVzFoh3aSxGCJawJtpEQ--~B/aD0xNzgxO3c9MjY3MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/dd1ca320-e850-11e9-b79b-139bcdba28e5", "published_at": "2019-10-06"}