{"pub": "abcnews", "url": "https://abcnews.go.com/Technology/wireStory/researchers-find-warship-wwii-battle-midway-66405366", "downloaded_at": "2019-10-20 23:22:03.239205+00:00", "title": "Researchers find second warship from WWII Battle of Midway", "language": "en", "text": "A crew of deep-sea explorers and historians looking for lost World War II warships have found a second Japanese aircraft carrier that went down in the historic Battle of Midway.\n\nVulcan Inc. director of undersea operations Rob Kraft said a review of sonar data captured Sunday shows what could be either the Japanese carrier Akagi or the Soryu resting in nearly 18,000 feet (5,490 meters) of water in the Pacific Ocean more than 1,300 miles (2,090 kilometers) northwest of Pearl Harbor.\n\nThe researchers used an autonomous underwater vehicle, or AUV, equipped with sonar to find the ship. The vehicle had been out overnight collecting data, and the image of a warship appeared in the first set of readings Sunday morning.\n\nTo confirm exactly which ship they've found the crew will deploy the AUV for another eight-hour mission where it will capture high-resolution sonar images of the site. The initial readings were captures using lower resolution sonar. The high-resolution scans will allow the crew to measure the ship and confirm its identity.\n\nThe find comes on the heels of the discovery of another Japanese carrier, the Kaga, last week.\n\n\"We read about the battles, we know what happened. But when you see these wrecks on the bottom of the ocean and everything, you kind of get a feel for what the real price is for war,\" said Frank Thompson, a historian with the Naval History and Heritage Command in Washington, D.C., who is onboard the Petrel. \"You see the damage these things took, and it's humbling to watch some of the video of these vessels because they're war graves.\"\n\nSonar images of the Kaga show the bow of the heavy carrier hit the seafloor at a high rate of speed, scattering debris and leaving an impact crater that looks as if an explosion occurred in the ocean. The front of the vessel is buried in mud and sediment after nose-diving about 3 miles (4.8 kilometers) to the bottom.\n\nThe U.S. bombs that struck the Kaga caused a massive fire that left it charred, but the ship stayed mostly together. Its guns, some still intact, stick out the side.\n\nUntil now, only one of the seven ships that went down in the June 1942 air and sea battle — five Japanese vessels and two American — had been located.\n\nThe crew of the research vessel Petrel is hoping to find and survey all lost ships from the 1942 Battle of Midway, which historians consider a pivotal fight for the U.S. in the Pacific during WWII.\n\nThe battle was fought between American and Japanese aircraft carriers and warplanes about 200 miles (320 kilometers) off Midway Atoll, a former military installation that the Japanese hoped to capture in a surprise attack.\n\nThe U.S., however, intercepted Japanese communications about the strike and were waiting when they arrived. More than 2,000 Japanese and 300 Americans died.\n\nThe expedition is an effort started by the late Paul Allen, the billionaire co-founder of Microsoft. For years, the crew of the 250-foot (76-meter) Petrel has worked with the U.S. Navy and other officials around the world to locate and document sunken ships. It has found more than 30 vessels so far.\n\nKraft says the crew's mission started with Allen's desire to honor his father's military service. Allen died last year.\n\n\"It really extends beyond that at this time,\" Kraft said. \"We're honoring today's service members, it's about education and, you know, bringing history back to life for future generations.\"\n\n———\n\nFollow Associated Press Hawaii correspondent Caleb Jones on Instagram and Twitter as he joins the crew of the Petrel on its expedition.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Lifestyle/WireAP_490d8d222cdd43778840fc069b1510c8_16x9_992.jpg", "published_at": "2019-10-20"}