{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7573573/Marisa-Tomei-Isabelle-Huppert-look-stylish-black-screening-film-Frankie.html", "downloaded_at": "2019-10-15 08:05:22.918277+00:00", "title": "Marisa Tomei and Isabelle Huppert look stylish in all-black at a screening of their film Frankie", "language": "en", "text": "They're among the star-studded cast of the upcoming American–French drama Frankie.\n\nMarisa Tomei, 54, and Isabelle Huppert, 66, showed off their classic style Monday night at a New York City screening of their upcoming film.\n\nThe actresses showed off dueling all-black looks, with Isabelle favoring a classy reserved style while Marisa opted for a more revealing outfit.\n\nLeading ladies: Marisa Tomei, 54, and Isabelle Huppert, 66, showed off their classic style Monday night at a New York City screening of their upcoming film Frankie\n\nMarisa sizzled in a black bustier-style top featuring embroidered floral patterns decorated with gleaming sequins that showcased her cleavage and her fit arms.\n\nThe 5ft5in beauty paired her top with a pair of wide black slacks that covered up her pointy black heels.\n\nShe had her lustrous brunette locks styled straight and swept gracefully over one shoulder, and she wore a splash of crimson on her lips.\n\nBack in black: Marisa sizzled in a black bustier-style top featuring embroidered floral patterns decorated with gleaming sequins\n\nShowing her assets: Her revealing look highlighted her cleavage and her fit arms. She also had on a wide pair of black slacks\n\nFierce: The Spider-Man: Far From Home star completed her outfit with a pair of pointy black heels.\n\nLong hair, don't care: Marisa had her lustrous brunette locks styled straight and swept gracefully over one shoulder\n\nIsabelle matched her co-star with her all-black outfit, though she covered up a bit more with a relaxed black jacket featuring prominent pearl fasteners.\n\nThe age-defying French screen legend paired her covering with a simple black top and a striking black fur-lined scarf tied around her throat.\n\nShe completed her outfit with a pair of silver and black shoes, and her fiery red locks framed a pair of heart-shaped medallion earrings.\n\nTwinning: Isabelle matched her co-star with her all-black outfit, though she covered up a bit more with a relaxed black jacket featuring prominent pearl fasteners\n\nYouthful: The age-defying French screen legend paired her covering with a simple black top and a striking black fur-lined scarf tied around her throat\n\nIsabelle stars in Frankie as the title character, a famous French film star not too dissimilar from herself.\n\nThe intimate film, which also stars Brendan Gleeson, Greg Kinear and Jérémie Renier, revolves around an outing over a single day.\n\nFrankie, who's suffering from a terminal illness, invites a film makeup artist she's gotten close to (Tomei) to set her up with her son (Renier).\n\nBut the Spider-Man: Far From Home actress arrives with her boyfriend (Kinear), creating plenty of tension for the whole group.\n\nArt film: Isabelle stars in Frankie as the title character, a French actress with a terminal illness who tries to settle her affairs with her family\n\nDirector Ira Sachs posed with his leading ladies at the premiere while mixing casual and classy with a royal blue suit and a plain black T-shirt.\n\nFashion designer Donna Karan arrived bundled up in a black coat and a pair of sunglasses with a prominent bridge.\n\nMad Men's Bryan Batt looked dapper in a charcoal blazer which he mixed with a gray V-neck shirt and black plaid trousers.\n\nThe auteur: Director Ira Sachs posed with his leading ladies at the premiere while mixing casual and classy with a royal blue suit and a plain black T-shirt\n\nFashion legend: Designer Donna Karan arrived bundled up in a black coat and a pair of sunglasses with a prominent bridge\n\nDapper: Mad Men's Bryan Batt looked classy in a charcoal blazer which he mixed with a gray V-neck shirt and black plaid trousers\n\nActress Tyne Daly stayed on theme with a black sweater, though she added an intriguing pocket vest and wore what looked like a little plant sprout on her head.\n\nFellow actress and Oscar-nominee Brenda Vaccaro was covered up in a black coat, and she wore a dark shirt with black designs and a string of diamonds around her neck.\n\nDesigner Tory Burch wore a classy double-breasted black jacket with peaked lapels.\n\nShe added a splash of color to the dark ensemble with a lacy black and white cravat.\n\nMatching: Actress Tyne Daly kept it simple with a black sweater, while fellow actress Brenda Vaccaro covered up in a black coat", "description": "Marisa Tomei and Isabelle Huppert stunned in complementary all-black outfits at a New York screening of their newest French-American art film Frankie, directed by Ira Sachs.", "authors": ["Brian Marks For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/03/19720334-0-image-a-123_1571107256364.jpg", "published_at": "2019-10-15"}