{"pub": "arynews", "url": "https://arynews.tv/en/previous-govts-neglected-south-punjab-usman-buzdar", "downloaded_at": "2019-10-05 12:28:03.516380+00:00", "title": "Previous govts deliberately neglected South Punjab: Usman Buzdar", "language": "en", "text": "MULTAN: Punjab Chief Minister Usman Buzdar Saturday said that South Punjab was deliberately neglected in the tenures of the previous governments.\n\nHe was talking to media after inaugurating and laying foundation stones of several development projects in Multan.\n\nAs per details, the CM inaugurated the Hepatitis prevention centre in the Nishtar hospital and also laid foundation stones of building a pharmacy and store block in the hospital and construction of the Punjab Public Service Commission project.\n\nBuzdar also visited the anti-dengue desk in the Nishtar Hospital, working to create awareness among the masses. He said the government is working hard to control over increasing cases of dengue fever in the province. “The whole government machinery is on its toes to thwarter this lethal virus from Punjab.”\n\nTaking on the past governments, Punjab’s chief executive said funds were spent on the basis of favoritism in the past tenures of the governments.\n\nRead more: CM Buzdar reviews progress on development schemes of South Punjab\n\nHe said the PTI government is paying special attention to uplift the backward areas of South Punjab.\n\nBack in the month of July, Usman Buzdar had directed officials to complete ongoing projects in the stipulated time period.\n\nHe had passed these directives, while presided over a meeting at the Civil Secretariat to review progress on development schemes of South Punjab.\n\nComments\n\ncomments", "description": "Punjab Chief Minister Usman Buzdar Saturday said that South Punjab was deliberately neglected in the tenures of the previous governments.", "authors": ["Web Desk"], "top_image": "https://arynews.tv/wp-content/uploads/2019/04/Usman-Buzdar.jpg", "published_at": "2019-10-05"}