{"pub": "guardian", "url": "https://theguardian.com/football/2019/oct/14/england-euro-2020-qualifier-in-sofia-halted-twice-over-racist-abuse", "downloaded_at": "2019-10-14 23:23:42.867796+00:00", "title": "England Euro 2020 qualifier in Sofia halted twice over racist abuse", "language": "en", "text": "England’s Euro 2020 qualifier against Bulgaria in Sofia came close to being abandoned on Monday night after home fans repeatedly racially abused Tyrone Mings and other black players on what the Football Association chairman, Greg Clarke, described as “one of the most appalling nights I’ve seen in football”.\n\nThe referee, Ivan Bebek, first stopped play at the Vasil Levski stadium in the 27th minute when the visitors were already 2-0 up, after Gareth Southgate alerted Uefa officials to what appeared to be monkey chants coming from the far side of the ground. Aston Villa defender Mings appeared to be the main target but there was also consistent booing of Raheem Sterling and Marcus Rashford.\n\nMings was heard telling the assistant referee: “Hey, did you hear that?”, prompting manager Gareth Southgate to speak to the fourth official. As part of Uefa’s strict anti-racism protocols, an announcement was then read out over the speaker system which urged home fans to cease or face the match being abandoned.\n\nThe message initially seemed to make little difference, with the chants clearly audible every time Mings touched the ball. Play was again halted just before half-time, although after consulting with his fourth official Bebek decided not to suspend play as dictated by the second stage of Uefa’s protocols. At half-time the Bulgaria captain, Ivelin Popov, approached an area of the stands where the chants were coming from to plead for his supporters to stop. Many Bulgarian fans then chose to leave the stadium with their team already 4-0 down, although some of the chanting continued.\n\nEngland trounce Bulgaria 6-0 but forced into stoppages by racist chanting Read more\n\nTelevision pictures shown by broadcaster ITV at half-time showed some fans making Nazi salutes and wearing jumpers with the message “Uefa Mafia: No Respect”. England officials are understood to have discussed the possibility of abandoning the game at the break with their Uefa counterparts, and were given permission to walk off if any more instances occurred. England went on to win the match 6-0.\n\n“I was up in the stands with some of the FA staff. We were watching the game and heard some sounds that sounded like monkey chanting,” said Clarke.\n\n“I came down and heard more at the side of the pitch and I saw some activity from some people dressed in black that was appalling. We were told by the officials that 50 people had been thrown out at half-time. Some of the staff were visibly upset at the amount of abuse the squad were suffering.”\n\nHe added: “I would like to see a very stringent review by Uefa because I know they take racism very seriously. If we say ‘we’ve got zero tolerance for racism’, one person making monkey chanting noises is the same as 100. Zero tolerance is zero tolerance.”\n\nThe buildup to the match had been dominated by the prospect of racism at a ground where England players were also abused during a qualifier in 2011. The Bulgarian football union president, Borislav Mihaylov, had urged Uefa to take action against England after Chelsea striker Tammy Abraham claimed that Southgate’s side would walk off the pitch if they were on the receiving end of racist chanting, while manager Krasimir Balakov insisted English football has more of a problem with racism than Bulgaria in his pre-match press conference.\n\nUefa had already imposed sanctions after incidents during Bulgaria’s matches against Kosovo and the Czech Republic in June, with 5,000 of the 46,340 seats at the stadium closed off as a punishment and instead covered with “Equal Game” banners. Yet despite only around 20,000 supporters – including an estimated 3,400 from England – inside the ground, it became the latest match featuring Southgate’s side to be marred by racism after a similar incident in March when Montenegro was ordered to play their game against Kosovo in June behind closed doors.\n\n“We know it is an unacceptable situation,” said the England manager. “I think we have managed to make two statements by winning the game but also we have raised the awareness of everyone to this situation. The game was stopped twice and I know for some people that won’t be enough but I think as a group we were on board with that process.”\n\nMings was making his international debut but insisted he had not been put off by the constant barracking he received from the stands, including during the warm-up.\n\n“It didn’t affect my feelings,” he said. “I think I’m quite lucky in that way because I don’t feel like it is a personal assault. I feel sorry for the people who have those views. But I also have a duty to represent people that don’t have a voice. It was important that it was bigger than me, bigger than what I felt.”\n\nRashford was among several England players to express their disappointment on social media. The Manchester United forward also praised the away supporters for their reaction that included a song featuring the words: “Who put the ball in the racists’ net? Raheem Sterling”.\n\n“Thankful to the brilliant England support,” he wrote on Twitter. “You got behind us in the most meaningful way possible tonight and we are all very grateful. Also been told what the Bulgaria captain did at half-time. To stand alone and do the right thing takes courage and acts like that shouldn’t go unnoticed.”\n\nLabour leader Jeremy Corbyn added: “Solidarity with the England players who faced appalling racism tonight. Uefa needs to do far more to tackle this kind of abuse.”", "description": "England manager Gareth Southgate alerts Uefa officials to chanting by Bulgaria’s home fans", "authors": ["Ed Aarons", "Dario Brentin"], "top_image": "https://i.guim.co.uk/img/media/ac4a372df782c697f390c2d8a287823f9a926b87/122_29_2658_1594/master/2658.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=99bb90ad2ddeffefb092f9daea31fcbf", "published_at": "2019-10-14"}