{"pub": "rt", "url": "https://rt.com/news/471843-asteroid-flyby-visible-halloween/ ", "downloaded_at": "2019-10-25 22:51:58.141040+00:00", "title": "Potentially hazardous asteroid flying past Earth right now visible with even small telescopes", "language": "en", "text": "A potentially hazardous asteroid (PHA) that’s taller than Dubai’s Burj Khalifa tower will speed past the Earth at 25,000 miles per hour, but stargazers have plenty of time to enjoy nature’s firecracker.\n\nKnown as 162082 (1998 HL1), the PHA or a Near-Earth Object (NEO), will make its way past our planet over the coming days at roughly 16.2 lunar distances from Earth (about 6.2 million kilometers or 4 million miles).\n\nWhat's special about this particular asteroid fly-by is that, relatively speaking, it's happening in slow motion: Its angle of approach respective to the Earth means that die-hard stargazers can observe 162082 through to Halloween night, as it goes from magnitude 13.1 to 12.5 on October 26 before dipping to magnitude 14.0 and heading off into the solar system once more.\n\nItalian astronomer Gianluca Masi will be live-streaming the entire flyby via his Virtual Telescope Project website, thanks to several robotic telescopes that are remotely accessible.\n\n“Having a potentially hazardous asteroid visible with small scopes is not frequent,\" Masi told Newsweek. “[In] the past 12 months, we had only two similar size—actually a bit larger—objects coming closer. So this is a unique opportunity to see it with personal, small telescopes.”\n\nAlso on rt.com Aste-RISK! NASA warns space rock twice the size of Eiffel Tower is bearing down on Earth\n\nMasi also produced a handy star map (no, not the kind that shows where Hollywood celebrities live) for those who want to dust off their home telescopes and see for themselves.\n\nIf you can’t make it out over the next few nights to catch a glimpse, the asteroid will be back again… in October 2140.\n\nThink your friends would be interested? Share this story!", "description": "A potentially hazardous asteroid (PHA) that’s taller than Dubai’s Burj Khalifa tower will speed past the Earth at 25,000 miles per hour, but stargazers have plenty of time to enjoy nature’s firecracker.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5db3012820302732e969b932.jpg", "published_at": "2019-10-25"}