{"pub": "businessinsider", "url": "https://businessinsider.sg/barack-and-michelle-obama-are-coming-to-singapore-this-december-and-tickets-cost-up-to-s1295", "downloaded_at": "2019-10-09 10:50:40.467718+00:00", "title": "Barack and Michelle Obama are coming to Singapore this December – and tickets cost up to S$1,295", "language": "en", "text": "Barack and Michelle Obama are coming to Singapore. Photo taken on August 3 2016, before a state dinner at The White House. The Straits Times\n\nFormer US president Barack Obama and former first lady Michelle Obama will speak at events in Singapore this coming December.\n\nThe Obamas will be speaking at two separate events held by The Growth Faculty, a business events provider, at the Singapore Expo.\n\n58-year-old Barack Obama will share about his time in the Oval Office, as well as his thoughts on leadership around the world on December 16. This will be his first public business event in Singapore.\n\nThe 1.5-hour event will be an “interview-style” discussion with a moderator, according to The Growth Faculty’s website. Tickets cost between S$345 to S$1,295 for non-members, and S$295 to S$1,195 for members.\n\nAs for Michelle Obama, she will speak about the experiences that shaped her in her public and private life, as well as reflections from her memoir, “Becoming”.\n\nThe 55-year-old lawyer’s 1.5-hour talk will take place in the evening of December 14, and will also be an interview-style discussion with a moderator. Tickets cost between S$345 to S$895 for non-members, and S$295 to S$795 for members.\n\nPeople who buy the most expensive tickets for both events will have access to VIP packages. For VIP ticket holders to Mr Obama’s event, this includes priority seating in the front rows, a panel discussion with “high level Singapore leaders”, and a three-course sit-down lunch. The VIP package attached to Mrs Obama’s event also includes priority seating, a pre-event VIP cocktail party, and a copy of her book “Becoming”.\n\nBarack Obama last visited Singapore in March 2018, where he had a closed-door meeting with some young leaders from ASEAN. Earlier this year, Barack and Michelle Obama were also ranked as Singapore’s most admired people, for the second year running.\n\nPrevious events organised by The Growth Faculty included speakers like Hillary Clinton, Simon Sinek and George Clooney.\n\nRead Also:", "description": "Business Insider - Tickets for the public will cost S$345 at the lowest category.. Read more at businessinsider.sg", "authors": ["Lamont Mark Smith"], "top_image": "https://static.businessinsider.sg/sites/2/2019/10/0910-Obama-Header-1.jpg", "published_at": "2019-10-09"}