{"pub": "yahoo", "url": "https://sports.yahoo.com/nfl-owners-reportedly-now-will-push-for-17-game-schedule-not-18-155112557.html", "downloaded_at": "2019-09-26 21:05:33.634309+00:00", "title": "NFL owners reportedly now will push for 17-game schedule, not 18", "language": "en", "text": "Adding to the NFL regular season is an issue that won’t go away easily.\n\nEarlier this year, the buzz was that owners would push the union to move to an 18-game regular season. Daniel Kaplan of The Athletic, citing ownership sources, said the plan is now to ask for an expansion to 17 games instead.\n\n[Watch live NFL games on the Yahoo Sports app, here's how]\n\nScroll to continue with content Ad\n\nKaplan said his source said there wasn’t enough support for an 18-game schedule from the owners and “players would not go for it either.” The physical toll of a 16-game season is brutal on players, and more games would be a clear detriment to player safety.\n\nCould NFL go to 17 games?\n\nThe next collective-bargaining agreement talks could be difficult and drawn out. Before anything is settled there are sure to be plenty of negotiating ploys floated through the media. The expansion of the regular season could be a ploy, or perhaps it’s an issue the owners will dig in on.\n\nThere was a report earlier in the offseason that an 18-game schedule, with each player taking two games off, could happen. At least a 17-game schedule is better than that ill-fated idea.\n\nExpanding the regular season would presumably include a reduction of the preseason. Kaplan wrote that if the NFL goes to 17 regular-season games, the preseason would be cut from four games to two or three. That’s an idea everyone can get behind.\n\nWould each team get a neutral-site game?\n\nThe issue with an odd number of games would be that half of the teams would get nine home games, while the rest play only eight. The solution could be that each team plays one neutral-site game.\n\nThere are a lot of issues to be worked out, and due to the safety issues there’s no guarantee the NFLPA will be excited for more regular-season games. The NFL has been at 16 games since 1978.\n\nStory continues\n\nMore football sounds like a good thing, but it might not be a great benefit to the NFL’s product on the field.\n\nNFL owners reportedly want an expansion to 17 regular-season games. (Getty Images)\n\n– – – – – – –\n\nFrank Schwab is a writer for Yahoo Sports. Have a tip? Email him at shutdown.corner@yahoo.com or follow him on Twitter! Follow @YahooSchwab\n\nMore from Yahoo Sports:", "description": "NFL owners have reportedly given up on their plan for an 18-game season.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/aae9dtNe9au7QLD0M1qNKw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04ODcuNDY2NjY2NjY2NjY2Nw--/https://s.yimg.com/uu/api/res/1.2/AO621_MzLorJoAf7kALkEA--~B/aD0yNzAzO3c9Mzg5NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/facba8f0-e074-11e9-bfb9-29afdb957940", "published_at": "2019-09-26"}