{"pub": "investingcom", "url": "https://livebitcoinnews.com/the-hard-week-thats-been-hitting-litecoin", "downloaded_at": "2019-09-29 00:21:27.544529+00:00", "title": "The Hard Week That’s Been Hitting Litecoin", "language": "en", "text": "Litecoin, the sixth-largest cryptocurrency by market cap, has had something of a rough week, and is experiencing up-and-down behavior like nobody’s business.\n\nLitecoin Is Attached to Bitcoin’s Hip\n\nTo be fair, Litecoin isn’t alone in its present dilemma. Bitcoin, for example, is currently trading in the $8,100 range – roughly $2,000 less than where it was when last week ended. Ethereum is also down for the count, trading at around $168 at press time from last week’s “high” of $190.\n\nLitecoin, however, seems to be getting hit harder. According to Joe DiPasquale, the CEO of crypto hedge fund Bit Bull Capital:\n\nLitecoin has been under pressure since the halving of the block reward failed to boost price and it wasn’t helped by concerns surrounding funding for future development. The current price drop is simply the result of these fundamental issues and the fact that Litecoin closely follows bitcoin.\n\nIn the long run, bitcoin and Litecoin seem to share a very “unique” relationship, to say the least. Whenever bitcoin goes up, so does Litecoin. If bitcoin falls, Litecoin is sure to follow. The two seem to be tied together and work together regardless of what other cryptocurrencies might do. Thus, as it stands, since bitcoin is traversing through the doldrums, Litecoin is “duty bound” to engage in the same behavior.\n\nAkbar Thobhani, the CEO and founder of SFOX, believes that the halving of last month likely has the most to do with Litecoin’s present dilemma. He comments:\n\nHalvenings of any major cryptocurrency, historically, have correlated with increased volatility as traders are uncertain about the effect that the change in the rate of new coin supply will have on the coin’s price. SFOX previously suggested that the Litecoin halving could correspond with more LTC volatility, and we appear to be observing that trend. As with any asset class, lasting value comes from fundamentals such as number of users and transactions, and these are the metrics to watch as Litecoin and other cryptocurrencies continue to grow.\n\nAt the same time, the currency has shown a relatively active level of resilience, and at press time, Litecoin has jumped up by roughly three percent in the last 24 hours, spiking from its new low of $54 to about $55 at press time.\n\nMoving Up, Moving Down\n\nUnfortunately, what’s not great is that the currency was hitting highs of roughly $145 during the summer of 2019, and just last week, was trading in the $70 range, which is still considerably better than its present position. Still, though, its market cap has reached an impressive $4.6 billion and it’s one of the few top ten cryptocurrencies that have expanded in price during this time.\n\nThat’s not to say, however, that there’s not a lot of catching up to do (the same can be said for many coins).", "description": "Litecoin is tied to bitcoin, and since the two coins share a unique relationship, the former will always copy the behavior of the latter.", "authors": ["Nick Marinoff"], "top_image": "https://www.livebitcoinnews.com/https://s3.amazonaws.com/lbn-s3/2018/08/Litecoin-Charlie-Lee.jpg", "published_at": "2019-09-28"}