{"pub": "blastingnews", "url": "https://us.blastingnews.com/sports/2019/10/pat-riley-comments-on-the-miami-heat-and-chris-paul-situation-says-hes-happy-with-butler-002995587.html", "downloaded_at": "2019-10-08 09:57:50.878513+00:00", "title": "Pat Riley comments on the Miami Heat and Chris Paul situation, says he's happy with Butler", "language": "en", "text": "The Miami Heat had a great offseason as they improved the team and are now looking to compete in the Eastern Conference. While the Western Conference is still superior, the East is mostly wide open and many teams could qualify for the playoffs and reach the NBA Finals. The Heat are far from strong championship contenders, but with a few more roster moves, they could surprise rest of the league with a deep playoff run.\n\nThe team acquired Jimmy Butler in a sign-and-trade deal with the Philadelphia 76ers. While they lost Josh Richardson, who was one of their best players last season, the addition of Butler makes the team much more dangerous. His work ethic also motivates other players to get better. There has been talk about Miami adding another star player, Chris Paul, and team president Pat Riley recently spoke about this.\n\nPat Riley is satisfied\n\nJimmy Butler is finally in Miami and on the team that he's wanted to play for. This may be the first time in his career that he's on the team he likes. Butler was drafted by the Chicago Bulls, where he spent six seasons. In what turned out to be his final season in Chicago, the Bulls traded him to the Minnesota Timberwolves. In November 2018, the superstar was traded to the Philadelphia 76ers, where he played 55 regular-season and 12 playoff games.\n\nDon’t miss the latest news! Click on the topic you interest most. We'll keep you updated with all the news you shouldn't miss. NBA\n\nButler is a great defender and his offensive arsenal is versatile. He's a 34.1 percent career three-point shooter and his work ethic is unmatched. However, it is questionable if the Miami Heat can make a deep playoff run with him as the only superstar on the roster. There have been some rumors about Chris Paul joining the Heat, but it appears that Pat Riley may not be interested in the aging point guard.\n\n“I’m happy right now,” Pat Riley said. “The fact that Jimmy Butler wanted to come play in Miami, that’s a start. As far as getting somebody else, we’re going to go to training camp with the team [we have], and I think we showed restraint as much as we can, and as much discipline as we can with our roster. But if something presents itself, then we’ll always take a look at it.”\n\nPaul's contract\n\nChris Paul is 34 and he has three more years left on his contract.\n\nIn the upcoming season, the Oklahoma City Thunder are going to pay him $38.5 million and his salary will be $41.3 million in the season after. In the final year of his contract, the 36-year-old Chris Paul will be paid $44.2 million, which is simply too much.\n\nBy trading for him, the Miami Heat would have no flexibility in the next three years. Additionally, the Thunder would want either draft picks or young players from the Heat, which would put Miami at a big disadvantage.", "description": "The Miami Heat may be the next destination for Chris Paul and the team president recently talked about it.", "authors": ["Zeegee Cecilio", "Read More On The Same Topic Asmir Pekmic", "'Fortnite' Theory Suggests How The New Map Will Be Revealed For Season", "Epic Games Facing Lawsuit For Making 'Fortnite' Too Addictive", "'Fortnite' Season X Ending Event Release Date Has Been Revealed With The Countdown"], "top_image": "https://staticr1.blastingcdn.com/media/photogallery/2019/10/8/os/b_1200x630/pat-riley-comments-about-chris-paul-and-the-miami-heat-image-credit-photoshop-edit-by-clutchpoints_2335675.jpg", "published_at": "2019-10-08"}