{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/11/adam-schiff-impeachment-probe-has-made-substantial", "downloaded_at": "2019-10-12 00:12:41.429512+00:00", "title": "Impeachment probe has made 'substantial progress,' House Intel chairman Schiff says", "language": "en", "text": "House Intelligence Chairman Adam Schiff claims his investigation into potentially impeachable conduct by President Trump has made “substantial progress” over the past two weeks, despite the administration’s attempts to resist.\n\nIn a “Dear Colleague” letter updating the rest of the Democratic caucus, Mr. Schiff touted the committee’s success in getting former Ambassador to Ukraine Marie Yovanovitch and former Envoy to Ukraine Kurt Volker, who turned over key text messages, to come testify behind closed doors.\n\nEarlier this week the White House sent a letter to House Speaker Nancy Pelosi warning her that they wouldn’t cooperate with the impeachment probe until she successfully obtains a vote by the full House that officially authorizes an inquiry and that gives Republicans equal weight with Democrats in the investigative process.\n\nIn his letter, Mr. Schiff said that complaint lacked any merit.\n\n“We have anticipated from the outset of this investigation that the White House would fall back on political attacks or nonsensical legal arguments to distract from the President’s misconduct,” Mr. Schiff wrote. “The White House’s letter made no meaningful legal arguments for its position, and instead conveyed little more than a stream of political invective.”\n\nOn Tuesday, the administration blocked Gordon Sondland, the U.S. Ambassador to the European Union, another key figure in the Ukraine incident, from meeting with lawmakers.\n\nHis counsel announced Friday morning that Mr. Sondland would be testifying before lawmakers “notwithstanding the State Department’s current direction to not testify.”\n\nAlong with Mr. Sondland’s upcoming deposition, lawmakers are set to hear from Dr. Fiona Hill, former Senior Director on the National Security Council for European and Russian Affairs, Deputy Assistant Secretary George Kent, and State Department Counselor T. Ulrich Brechbuhl.\n\nThe House Intelligence, Oversight, and Foreign Affairs Committees have also sent out a number of subpoenas as their parts of the impeachment probe expand.\n\nMost recently they targeted Energy Secretary Rick Perry, as well as Lev Parnas and Igor Fruman — two associates of the president’s personal lawyer Rudolph W. Giuliani that were involved in his efforts to open an Ukrainian investigation into the Biden family.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "House Intelligence Chairman Adam Schiff claims his investigation into potentially impeachable conduct by President Trump has made \"substantial progress\" over the past two weeks, despite the administration's attempts to resist.", "authors": ["The Washington Times Http", "Gabriella Muñoz"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/11/Trump_Impeachment_38379.jpg-bf9e4_c0-0-4068-2373_s1200x700.jpg?bd17b2b97f94fbd0ff0cd31483daf38f87ed346f", "published_at": "2019-10-11"}