{"pub": "marketwatch", "url": "https://marketwatch.com/story/the-stock-markets-halloween-indicator-is-more-trick-than-treat-2019-10-30", "downloaded_at": "2019-10-30 09:57:13.690512+00:00", "title": "The stock market’s ‘Halloween Indicator’ is more trick than treat", "language": "en", "text": "Those counting on the so-called Halloween Indicator to boost the U.S. stock market over the next six months may be in more for of a trick than a treat.\n\nI am referring to the famous six-months-on, six-months-off, seasonal pattern that also goes by the advice to “Sell In May and Go Away.” That pattern is based on the historical tendency for the stock market to produce the bulk of its gains between Halloween and the following May Day.\n\nIn fact, however, this tendency traces almost exclusively to the third years of the U.S. presidential four-year cycle. In the other three years of that cycle, there is no statistically significant difference between the returns in the Halloween-to-May Day period (the “winter” months) than in the other half of the year (the “summer” months).\n\nBecause we’re entering the final year of President Donald Trump’s term, therefore, this seasonal pattern will be of no help to the stock market over the coming six months.\n\nRead: Another stock market worry: The year leading up to a presidential election tends to be below average\n\nCredit for discovering that the presidential third year is the source of the Halloween Indicator goes to Kam Fong Chan, a professor at the University of Western Australia, and Terry Marsh, an emeritus finance professor at the University of California, Berkeley, and CEO of Quantal International, an investment management firm based in San Francisco. (Click here to read their study.)\n\nThe relevant data are summarized in the table below, based on the Dow Jones Industrial Average DJIA, -0.07% going back to its creation in the late 1800s.\n\nAverage “winter” return Average “summer” return Difference in winter and summer returns is significant at the 95% confidence level All years 5.3% 1.61% Yes Third year of presidential cycle 10.7% -0.0% Yes First, second, and fourth years of presidential cycle 3.5% 2.1% No\n\nAs you can see, but for the third years of the presidential cycle, the Halloween Indicator does not exist.\n\nWhy is this seasonal pattern so pronounced in just the third year of the cycle? Chan and Marsh speculate that it traces to the unusual level of economic policy uncertainty that exists prior to the midterm elections. That uncertainty holds the stock market back prior to those elections, resulting in an upsurge immediately after as that uncertainty is resolved.\n\nTo be sure, you probably wouldn’t have otherwise thought that uncertainty would be highest immediately prior to midterm elections. Wouldn’t that uncertainty be even higher prior to presidential elections? While acknowledging these questions, the researchers report that, at least according to one objective measure, uncertainty on average is indeed highest prior to midterm elections. That measure is the Economic Policy Uncertainty index created by Scott Baker of Northwestern University, Nick Bloom of Stanford University, and Steven Davis of The University of Chicago.\n\nNote carefully that the absence of this seasonal pattern over the coming year doesn’t mean the U.S. stock market won’t perform better over the next six months than it has over the past six. But if it does perform better, it won’t be because of the Halloween Indicator.\n\nFurthermore, you might even be able to use the research from Chan and Marsh to beat the Halloween Indicator at its own game. The key is to focus on fluctuations in economic policy uncertainty rather than mechanically following the calendar.\n\nFor example, if you believe economic policy uncertainty is going to grow over the next months, you might want to reduce your equity exposure. Only if you think uncertainty will diminish would you want to maintain or increase that exposure.\n\nMark Hulbert is a regular contributor to MarketWatch. His Hulbert Ratings tracks investment newsletters that pay a flat fee to be audited. He can be reached at mark@hulbertratings.com\n\nRead: Can the stock market march higher without the promise of more Fed cuts?\n\nMore: The U.S. is like a banana republic and a depression could be on the way, warns money manager", "description": "Six more months of upside for stocks supposedly starts at the end of October, writes Mark Hulbert.", "authors": ["Mark Hulbert"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GS528_hallow_ZG_20181026163209.jpg", "published_at": "2019-10-30"}