{"pub": "yahoo", "url": "https://finance.yahoo.com/news/bitcoin-leads-momentum-top-cryptos-013008135.html", "downloaded_at": "2019-10-28 02:46:01.449313+00:00", "title": "Bitcoin Leads Momentum as Top Cryptos Trade Below Key Price Average", "language": "en", "text": "Bitcoin (BTC) and Bitcoin SV (BSV) are the only cryptocurrencies within the top 10 by market capitalization to have jumped back above their long-term moving averages.\n\nThe 200-day moving average (MA) is often regarded as a marker for bullish long-term health when prices are above and bearish long-term market health when prices reside below.\n\n\n\nBitcoin’s (BTC) 30 percent jump to 5-week highs from $7,393 to $10,350 over a 2-day period pulled prices back above the long-term moving average, marking a change in both momentum and sentiment for the world’s premiere crypto.\n\nBitcoin SV (BSV) already led the charge a day earlier, closing above the 200-day MA on Oct. 25.\n\nRelated: Bitcoin Price Hits Five-Week High Above $10,000\n\nStill, those moves are yet to be reflected in the remaining top 10 cryptos as the bulls struggle for supremacy from the consistent 4-month downward slide that began towards the end of June, 2019.\n\nBTC and BSV – Daily chart\n\nAs seen above, BTC and BSV both managed to rise above the 200-day MA with conviction, leading to expectations for further appreciation in price as it heads toward the monthly close for October.\n\nStill, significant leg work for the remaining eight cryptos out of the top 10 is required to convince traders of a major change in trend for altcoins, which could encourage further investment in projects such as Ether and XRP as optimism begins to build off China’s positive pivot towards crypto.\n\nAltcoins – Daily chart\n\nRelated: PODCAST: Nic Carter on Bitcoin’s Evolution as a Safe-Haven Asset\n\nXRP, Ether, Litecoin, bitcoin cash, EOS, Binance coin and Stellar still reside beneath the 200-day MA despite gaining between 11.45 and 22 percent in a single period on Oct. 26.\n\nThe weekend move caught many traders off-guard as BTC broke out on its third-best single-day price gain in its history, as noted by Yassine Elmandjra.\n\nStill, more is required from buyers looking to drive alternative crypto’s performances higher, which is currently mired by BTC’s near 70 percent market dominance.\n\nShould the rest of the top 10 cryptocurrencies follow suit by rising above their respective 200-day moving averages, that would add credence to further price gains as the markets head toward the BTC halving event in May 2020.\n\nConfidence in BTC has been restored for now, but how long that will last and to what effect it has on the rest of the top 10 remains to be seen.\n\nDisclosure: The author holds no cryptocurrency assets at the time of writing.\n\nChart image via Shutterstock; charts by Trading View\n\nRelated Stories", "description": "Bitcoin and Bitcoin SV are the only cryptocurrencies within the top 10 to have jumped back above their long-term moving averages.", "authors": ["Sebastian Sinclair"], "top_image": "https://s.yimg.com/uu/api/res/1.2/j1gDzWbAsNxw3MD7KNgO7w--~B/aD02Njc7dz0xMDAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/coindesk_75/6278af4c2218e7f455a8bffa175fddeb", "published_at": "2019-10-28"}