{"pub": "npr", "url": "https://npr.org/2019/10/11/769609684/safety-experts-slam-boeing-and-faa-for-design-and-approval-of-737-max-jets", "downloaded_at": "2019-10-12 00:58:17.776384+00:00", "title": "Safety Experts Slam Boeing And FAA For Design And Approval Of 737 Max Jets", "language": "en", "text": "Safety Experts Slam Boeing And FAA For Design And Approval Of 737 Max Jets\n\nEnlarge this image toggle caption Lindsey Wasson/Reuters Lindsey Wasson/Reuters\n\nA new report from a group of international aviation safety experts sharply criticizes both Boeing and the Federal Aviation Administration for the way the 737 Max airplane was developed and certified to fly.\n\nAll 737 Max jets around the world remain grounded and under orders to not fly passengers following crashes in Indonesia last October and Ethiopia in March that together killed 346 people.\n\nInvestigators link both crashes to a new automated flight control system on the plane known as MCAS, which acted on faulty data from a single angle of attack sensor and repeatedly forced the planes into uncontrollable nose dives.\n\nIn its report, commissioned by the FAA, the Joint Authorities Technical Review panel finds that Boeing withheld critical details about MCAS from the FAA, saying MCAS \"was not evaluated as a complete and integrated function in the certification documents that (Boeing) submitted to the FAA.\"\n\nThe panel finds that Boeing told the FAA the MCAS system existed in a broad framework, but the company did not fully explain what the MCAS systems would do nor how forcefully it would push the nose of the plane down.\n\nThe FAA appointed the JATR in April to independently evaluate the design and certification processes for the 737 Max. The group includes technical experts from the FAA who were not involved in the certification of the 737 Max and from NASA, as well as representatives from the civil aviation authorities in Australia, Brazil, Canada, China, the European Union, Japan, Indonesia, Singapore and the United Arab Emirates.\n\nFormer National Transportation Safety Board chairman Christopher Hart headed up the review, and in a conference call with reporters Friday afternoon, he said that as the MAX was being reviewed for FAA certification, MCAS changed \"from a relatively benign system to a not-so-benign system without adequate knowledge by the FAA.\"\n\nHart says the review did not find any evidence of a deliberate effort by Boeing to mislead regulators; instead, he blamed poor communication.\n\n\"The information and discussions about MCAS were so fragmented and were delivered to disconnected groups,\" the JATR report says, so it it \"was difficult (for the FAA) to recognize the impacts and implications of this system.\"\n\nThe report goes on to criticize the FAA for lacking sufficient personnel with the expertise needed to fully evaluate such complex systems. An FAA program designates some oversight functions in the certification process to employees of the manufacturer, but the report is calling for significant changes in that program as the review finds that the employees charged with doing significant parts of the certification work faced \"undue pressure\" from management to remain on schedule and keep costs down.\n\nBoeing designed the Max to be a more fuel-efficient version of its previous version of the 737, called the NG, for next generation. The airplane manufacturer was under pressure to develop the plane quickly to compete with a new fuel efficient jet being offered by its main competitor, Airbus.\n\nThe report also raises questions about the increased use of automation in airplanes and pilots' abilities to step in and take over if automation fails.\n\n\"This is not just an airplane problem, but an airplane-slash-pilot problem,\" said Hart in the conference call, adding that the FAA and regulators around the world need to better recognize \"this new reality of super-complex automation and pilots not necessarily understanding how to operate it.\"\n\n\"As automation becomes more and more complex, pilots are less likely to fully understand it and more likely to have problems and more likely to encounter scenarios in real operations that they haven't seen even in a simulator,\" he said.\n\nIn a statement, FAA Administrator Stephen Dickson said the agency will review the 12 recommendations from the JATR, and while he did not commit to implementing all of them, some changes within the FAA and its certification process are already underway.\n\n\"We welcome this scrutiny and are confident our openness to these efforts will further bolster aviation safety worldwide,\" Dickson said.\n\nBoeing said in a statement it will work with the FAA to review the panel's recommendations and that the company is working to \"continuously improve the process and approach used to validate and certify airplanes going forward.\"", "description": "Two of the planes crashed, killing hundreds. The review panel finds that Boeing withheld critical details about a flawed new automated system, and the regulators lacked expertise to find the problem.", "authors": ["David Schaper"], "top_image": "https://media.npr.org/assets/img/2019/10/11/rtx739yj_wide-7464a399a17ed8d91a403d4e4358208e9f768f3d.jpg?s=1400", "published_at": "2019-10-11"}