{"pub": "townhall", "url": "https://townhall.com/columnists/jamesgottry/2019/10/09/what-the-supreme-court-and-a-funeral-home-can-teach-us-about-civics-n2554428", "downloaded_at": "2019-10-09 18:41:48.826785+00:00", "title": "What the Supreme Court and a Funeral Home Can Teach Us About Civics", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nOn Tuesday, the U.S. Supreme Court heard oral arguments in R.G. & G.R. Harris Funeral Homes, Inc. v. Equal Employment Opportunity Commission. The case arose when Harris Funeral Homes, a fifth generation family business, was sued by the EEOC because of its sex-specific dress code. The question before the Court is whether the word “sex” in Title VII and other civil rights laws includes “transgender status.”\n\nThere is much at stake. A change in the law could force organizations to open women’s shelters to biological men. It could throw open the doors of locker rooms, restrooms and showers to the opposite sex. And it could erode equal opportunities for women by allowing more biological men to compete in women’s sports, depriving girls like Selina Soule a fair opportunity to compete.\n\nSuffice it to say, the issues presented in Harris Funeral Homes are serious. But the question before the Court is simple.\n\nIt is simple because we have three branches of government with three distinct roles. The legislative branch asks what the law should be, and makes the law. The executive branch asks what the law is, and enforces the law. The judicial branch asks what the law means, and applies the law. Notwithstanding the apparent confusion in our current political workings, those are the designated roles. (And kudos to Ben Sasse and others who have attempted to educate the public on this simple but profoundly wise distribution of powers.)\n\nUnderstanding this separation of powers, the Supreme Court’s constitutionally-designated role in this case is one of interpretation: does “sex” include transgender status? Its role is not to determine whether such inclusion would be preferable, advisable, or beneficial. Such philosophical questions belong to our elected representatives rather than to an unelected super legislature.\n\nJustice Breyer acknowledged as much during oral arguments, stating that “we are deciding simply whether [transgender status] falls within the words ‘sex discrimination.’” Unfortunately, it may be that not every justice is prepared to accept this delineation of authority. Justice Sotomayor posed the following question to David Cole (emphasis added):\n\n\"You have a transgender person who rightly is identifying as a woman and wants to use the women's bedroom . . . . But there are other women who are made uncomfortable, and not merely uncomfortable, but who would feel intruded upon if someone who still had male characteristics walked into their bathroom. That's why we have different bathrooms. So the hard question is how do we deal with that?\"\n\nThe Constitution provides the answer. That’s the job of Congress. And thus far, they have chosen not to modify Title VII and similar civil rights laws. As John Bursch, my former colleague at Alliance Defending Freedom, noted during oral arguments, “though Congress has added classifications to cover transgender status in other statutes, it has rejected more than a dozen proposals here.”\n\nDespite his earlier clarity on the Court’s role, Justice Breyer later expressed anxiousness about leaving such an important matter in the hands of the people and their representatives. He asked Solicitor General Noel Francisco (who argued for the government on behalf of Harris Funeral Homes) whether it might be advisable for the Court to read into the statute an interpretation that included transgender status. Appropriately, General Francisco explained that such an approach “deprives the people of the ability to struggle with these issues democratically.”\n\nJustice Sotomayor pressed the issue, asking “at what point does a court…have to step in?”\n\nGeneral Francisco’s answer: “[W]hen Congress actually addresses the issue.”\n\nHe’s right. Let me say it again. The nine men and women on the Supreme Court are presented with a very simple task of interpreting a law, and not the too-weighty responsibility of setting the course for an entire nation. That responsibility falls to the members of Congress, as they carry out the will of the citizens they represent. To a certain segment of the population, this is not an acceptable answer, though it is a constitutional one. ACLU attorney David Cole suggested the Court is empowered to read into the statute a definition that was not originally intended by Congress and, “if the democratic process disagrees…it can change it.”\n\nSuch a view grants the Court with power it was never intended to possess. The Court is not an agent of change… that role belongs to you and me, acting through our representatives.\n\nOurs is a constitutional republic. Our government is of the people, by the people, and for the people. We are tasked with electing representatives who will advance the laws and policies that are best for our nation. Let’s not forget our role. And, as appropriate, let’s remind our government officials of theirs.\n\n\n\nJames Gottry is an attorney and Vice President of Public Policy for the Dr. James Dobson Family Institute.", "description": "On Tuesday, the U.S. Supreme Court heard oral arguments in .10/09/2019 14:40:23PM EST.", "authors": ["James", "Cortney O'Brien", "Julio Rosas", "Timothy Meads", "Guy Benson"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/townhall/reu/o/2018/337/f88820d5-2187-4a45-b6a7-3aa49830a7d4.png", "published_at": "2019-10-09"}