{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7624199/California-fires-wont-destroy-Getty-Museum-art-fire-resistant-fortress.html", "downloaded_at": "2019-10-29 06:15:01.720203+00:00", "title": "California fires won't destroy Getty Museum and its art as it's a fire resistant fortress", "language": "en", "text": "Advertisement\n\nPrized works of art in a museum in the path of California wildfires will be safe from flames because the building was built with fire-resistance in mind - including a own million-gallon water tank under its garage.\n\nAuthorities in Northern California ordered 180,000 residents to flee their homes on Sunday as historic winds fueled a wildfire in the wine country.\n\nFlames were seen raging along 405 Freeway near the Getty Center, which displays pre-20th century works of art by artists including Rembrandt and Van Gogh.\n\nHowever fire resistance was built into the billion-dollar complex, Ron Hartwig, vice president of communications for the J. Paul Getty Trust said previously.\n\nOn Monday, flames were seen raging along 405 Freeway near the museum which displays pre-20th century works of art by artists including Rembrandt and Van Gogh\n\nThe Getty Center Museum (left) is seen above on Monday shrouded in smoke from the wildfire that started nearby at the Sepulveda Pass\n\nThe immediate zone around the building is kept green with fire-resistant plants, and the expansive area surrounding the campus is rigorously kept clear of grasses\n\nThe buildings also have strong concrete walls and automatic fire doors that can trap fires in sealed-off areas, The New York Times reported when previous fires ravaged the area in 2017.\n\nThere is also a carbon-filtered air conditioning system which is designed to get rid of smoke and internal sprinklers are ready in the case of a natural or deliberate incident.\n\n'Should any fire move within one of those compartmentalized areas, it can’t get anywhere,' Michael G. Rogers, director of facilities at the Getty previously told The New York Times.\n\nThe Getty also has a one million-gallon water tank buried under the parking garage, giving it the highest level of fire resistance.\n\nThe $1 billion home of the J. Paul Getty Museum sits in the Santa Monica Mountains and has been closed to prevent harm to its works from smoke from several wildfires.\n\nIts collections range from pre-20th century European paintings to Roman and Greek antiquities, tapestries, photographs and manuscripts, all protected by extensive anti-fire systems outside and in.\n\nThe immediate zone around the building is kept green with fire-resistant plants, and the expansive area surrounding the campus is rigorously kept clear of grasses.\n\nCanopies of oak trees also serve to suppress the growth of vegetation that could feed a blaze.\n\nA small brush fire burns in the hills near the Getty Center in Los Angeles on Monday. Fire fighting aircraft quickly contained the Santa Ana wind driven fire.\n\nA small fire erupts at the entrance of The Getty Center in Los Angeles, California. The Getty fire started along the 405 Freeway near the Getty Center in Los Angeles on October 28\n\nThe Getty Center is covered in smoke as the Getty fire burns Monday. However fire resistance was built into the billion-dollar complex, Ron Hartwig, vice president of communications for the J. Paul Getty Trust confirmed\n\nThe state of California has been plagued by at least nine wildfires in the last two weeks with the latest blaze to break out on Sunday near the Getty Center.\n\nMeanwhile Los Angeles Mayor Eric Garcetti says the Getty wildfire in the city's western neighborhoods has scorched more than 600 acres but its growth has slowed.\n\nDramatic footage showed smoke and flames surrounding the Getty Center with houses historic artwork by Rembrandt and Van Gogh.\n\nCelebrities have been fleeing their homes and dramatic footage showed flames rapidly spreading towards the eight-bedroom Brentwood mansion of actor Josh Duhamel Monday.\n\nHe bought the 8,232 sq ft sprawling property with then-wife Fergie for $5.2million in 2007.\n\nHudson was seen getting into her vehicle in the upscale Pacific Palisades neighborhood to evacuate early Monday morning as the threat of fire loomed large.\n\nDramatic images showed airplanes flying at low altitude while dropping fire retardant on the area surrounding Schwarzenegger's home.\n\nThe $1 billion home of the J. Paul Getty Museum sits in the Santa Monica Mountains and has been closed to prevent harm to its works from smoke from several wildfires\n\nThe Getty Fire burns near the Getty Center along the 405 freeway north of Los Angeles, California, U.S. on Monday\n\nLos Angeles Mayor Eric Garcetti says the Getty wildfire in the city's western neighborhoods has scorched more than 600 acres but its growth has slowed\n\nAirplanes dropping water and fire retardant joined the battle against the destructive wildfire burning on the western side of Los Angeles.\n\nNight-flying helicopters made water drops during predawn hours Monday and large aircraft started flying the area after the sun rose.\n\nTwo so-called 'Super Scooper' turboprop airplanes that scoop up water from lakes and reservoirs have begun making drops, along with converted jets unleashing loads of bright pink retardant.\n\nSchwarzenegger, the movie star and former California governor, also tweeted that he evacuated his Brentwood home at 3:30am.\n\nMonday night's red carpet premiere in Los Angeles of 'Terminator: Dark Fate,' starring Schwarzenegger and Linda Hamilton, was canceled because of the fire.\n\n'We will be donating food intended for the after-party to the American Red Cross, which is serving those affected by the fires,' Paramount said in a statement.\n\nThe ex-governor's former wife, Maria Shriver, tweeted: 'So grateful to our firefighters putting their lives on the line for all of us.\n\n'We have evacuated, but we’re safe. Praying for our neighbors.'\n\nShriver also tweeted: 'Praying for everyone in the path of this terrifying destruction. Thank you again to our firefighters for keeping us safe.\n\nHomes have burned since the fire erupted around 1:30 a.m. and was swept by Santa Ana winds into canyons and ridgetop neighborhoods. But there's still no exact count of how many were destroyed.\n\nLos Angeles Fire Chief Ralph Terrazas says his firefighters had to make tough choices about which homes could be saved.\n\nGarcetti says the cause of the fire is under investigation.\n\nThe dry offshore gusts are expected to be replaced by a return of moist ocean air in the afternoon. But Santa Ana winds are forecast to return Tuesday night.", "description": "The Getty Center art complex in Los Angeles made sure it could protect its priceless artwork and antiquities from flames by building fire-resistant walls and a water tank on its sprawling lands.", "authors": ["Leah Mcdonald For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/02/20307958-0-image-a-2_1572314623628.jpg", "published_at": "2019-10-29"}