{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/jiba-mrwebi-were-bragging-that-nothing-would-happen-to-them-state-capture-inquiry-hears-20190902", "downloaded_at": "2019-10-19 11:17:17.183802+00:00", "title": "Jiba, Mrwebi 'were bragging' that nothing would happen to them, state capture inquiry hears", "language": "en", "text": "Former National Director of Public Prosecutions Mxolisi Nxasana says he received reports that fired senior prosecutors, Nomgcobo Jiba and Lawrence Mrwebi, \"bragged\" that nothing would happen to them.\n\nNxasana was testifying for a second time at the state capture commission of inquiry on Monday.\n\nDuring his testimony, he referred to judgments in which Jiba and Mrwebi were criticised for their conduct in the decision to withdraw charges against former Crime Intelligence boss Richard Mdluli.\n\nNxasana said on July 18, 2014, he made recommendations to the Minister of Justice to ask the president to institute disciplinary action against Jiba and Mrwerbi and to place them on suspension pending the hearing.\n\nHe also told the commission about a \"fact-finding commission\", which retired Constitutional Court Justice Zak Yacoob chaired.\n\nNxasana said he gave instructions to everyone to co-operate with the commission, however, Jiba and Mrwebi failed to do so.\n\nHe said Yacoob made recommendations that criminal charges be instituted against certain members of the NPA. He also recommended a full judicial commission of inquiry to investigate the rot at the organisation.\n\nBut former President Jacob Zuma did not act on the recommendations, Nxasana said.\n\n\"[The] situation is that he (Zuma) acted against me instead of acting against them. The unfortunate part is that advocates Jiba and Mrwebi, well I heard it from corridor talks, they were bragging that nothing is going to happen and when the president did not take any action against them, it came as no surprise. It just confirmed the rumour,\" he said.\n\n\"But ultimately, it is a fact the president did not take any action.\"\n\nNxasana earlier told the commission that his view was that Zuma was on a \"fishing expedition\" to establish an inquiry into his fitness to hold office, although the former president did not have \"solid ground\" to establish it.\n\nNxasana's appointment was announced on August 30, 2013, effective from October 1, 2013. However, it was later reported that he had allegedly not disclosed that he had been acquitted of murder in 1985.\n\nHe had also reportedly not received his security clearance yet.\n\nAt the time, Zuma appointed the inquiry in terms of Section 12(6) of the National Prosecuting Authority Act of 1998.\n\nAccording to the terms, the matters the inquiry were tasked with probing were:\n\n- his two previous separate convictions of assault;\n\n- his arrest and detention for criminal charges;\n\nNxasana told the commission that Zuma's complaints had \"unintended consequences\" because his children now knew he had some \"brushes with the law\".\n\n\"I am a family man and I have kids. It was a humiliation more than anything for me,\" he said, adding that he was approached for the job while he was \"happily\" practising in Durban.\n\nNxasana added that he was under no obligation to disclose to the president that he was acquitted for murder.\n\nGET THE NEWS at your fingertips and download the News24 app for Android or iPhone.\n\nKEEP UPDATED on the latest news by subscribing to our FREE newsletter.\n\n- FOLLOW News24 on Twitter", "description": "Former National Director of Public Prosecutions Mxolisi Nxasana has told the state capture commission of inquiry that he received reports that fired senior prosecutors, Nomgcobo Jiba and Lawrence Mrwebi, \"bragged\" that nothing would happen to them.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8453/5ffffb0500b94ccab3e005a89e5569e0.jpg", "published_at": "2019-09-02"}