{"pub": "politico", "url": "https://politico.eu/article/meet-the-commissioners-president-ursula-von-der-leyen-team-european-commission-members", "downloaded_at": "2019-09-10 07:43:04.060027+00:00", "title": "Meet the commissioners", "language": "en", "text": "Ursula von der Leyen has unveiled her picks for the next European Commission. Here's POLITICO's guide to the nominees, whose portfolios will be announced on Tuesday.\n\nAll will need approval from the European Parliament before they can take up their posts — except von der Leyen, who won confirmation from MEPs in July.\n\nUrsula von der Leyen (Germany), president\n\n\n\nWill be the first female Commission president. Born in Brussels. Attended the European School in the suburb of Uccle, graduating two years before Boris Johnson joined the same establishment. Mother of seven children. Entered politics only after she had finished her medical studies. Survived plagiarism accusations in connection with her thesis. Daughter of Ernst Albrecht, former leader of the state of Lower Saxony. Appeared on TV show \"Die aktuelle Schaubude\" singing with her family. Die Albrecht Familie also released a single in 1978 called \"Wohlauf in Gottes schöne Welt\" (\"Well in God's beautiful world\"). Enrolled at the London School of Economics using the pseudonym Rose Ladson after her father was informed that his family could be a potential target for the Red Army Faction terrorist group. Joined the Christian Democratic Union in 1990, on the same day her father stepped down as state premier. For more than a decade, met with Wolfgang Schäuble for breakfast once a week. Longest-serving minister in Angela Merkel's governments.\n\nFrans Timmermans (the Netherlands), vice president\n\nNot thrilled to have missed out on the job von der Leyen now has. Wears hipster glasses. Feminist. Former Dutch foreign minister. Polyglot. Jean-Claude Juncker’s right-hand man/plumber. Both grandfathers were coal miners, as he may have mentioned. Four children. Defender of the single-use plastic ban. Refuses to go on a Dutch TV talk show after the host in 2014 pressured him into sharing an undisclosed detail about the attack on the MH17 flight. Not popular with Polish or Hungarian leaders. Has a lookalike called Hans Brusselmans. Vocal supporter of second-division football team Roda JC.\n\nMargrethe Vestager (Denmark), vice president\n\nDeputy queen of Europe (after Merkel). Failed in her bid to become Commission president but instead expected to get a super-charged portfolio. Donald Trump called her the “tax lady” who “hates the U.S.” because of her battle against tech giants. Former Danish Cabinet minister and main inspiration for the TV series “Borgen.” Known in Denmark for being a tough-minded, kickass finance minister. Knits small elephants to release post-College of Commissioners tension. Speaks French to express enthusiasm (“Mais c’est magnifique la Vivatech!” she told French radio in reference to the annual worldwide gathering of startups in Paris).\n\nAustria — Johannes Hahn\n\n\n\nFormer minister for science accused of plagiarizing his Ph.D. (what does he think he is, German?) but allowed to keep his doctorate after an inquiry. Set up national “Award of Excellence” for the best doctoral thesis in Austria. Likes launching prizes. Also likes saving money, trying to pull Austria out of the renowned physics laboratory CERN in 2009 in a decision that was quickly overruled. Strong hand to win any future gambling commissioner portfolio as former CEO of betting company Novomatic. Criticized during Austrian student protests, who chanted “Hahn heißt er, uns bescheißt er” (“His name is Hahn, and he’s screwing us,” but ruder than that).\n\nBelgium — Didier Reynders\n\nSoftly spoken lawyer from Belgium’s Francophone liberal party, the Reformist Movement (MR). Served as minister for finance (1999-2011), and for foreign affairs (2011-2019). In 2014 was in the running to become commissioner and prime minister but missed out on both. Loss of Reynders and Charles Michel (the incoming Council chief) leaves MR without its two big beasts. As finance minister, he devised a system granting major tax breaks to multinational companies, which was ruled illegal state aid by one Margrethe Vestager. Criticized for appearing in blackface.\n\nBulgaria — Mariya Gabriel\n\nResponsible for digital economy and society in outgoing Commission. Gave up the European Parliament seat she won in May to remain at the Commission. Was an MEP from 2009 to 2017 — and won the MEP of the year prize twice during that time. Was a teacher and a researcher at Sciences Po Bordeaux. Loves bees. Wants to close the digital gender gap. Was cleared by Bulgaria's anti-corruption commission of a potential conflict of interest case involving an apartment. Focuses on fake news, digital skills and the promotion of the European audiovisual sector. Does her own tweeting.\n\nCroatia — Dubravka Šuica\n\nWas mayor of Dubrovnik but left the post before the city gained even greater fame as King’s Landing in \"Game of Thrones.\" Taught German in Croatia, which could come in handy considering who the new boss is. Spent the last six years as an MEP, and rising through the ranks to become first vice chair of the European People’s Party in July. Apparently wasn’t crazy about the prospect of moving to the Berlaymont: insiders say she had to be begged to take the job.\n\nCyprus — Stella Kyriakides\n\nBorn under British rule, she trained in Britain as a child psychologist. As vice president of the Democratic Rally party since 2013, she’s President Nicos Anastasiades’ right arm. Career politician. Local press describes her as a “Mother Theresa” figure who tries to help others but doesn’t express strong opinions. Also dressed up as a nun at Nicosia’s carnival parade last year. Pushed for a law in 2018 decriminalizing abortion. This would be her first Brussels gig, but she’s known in Europe for her stint as president of the Council of Europe’s Parliamentary Assembly (a rather powerless body tasked with holding 47 European governments to account on human rights and rule of law issues).\n\nCzech Republic — Věra Jourová\n\nResponsible for justice, consumers and gender equality in the outgoing Commission (but was “shocked” not to get the regional development portfolio). Studied cultural anthropology. Was a minister and an MP in her home country in the early 2010s. Spent 33 days in a Czech prison in 2006 after being falsely accused of corruption. Deleted her Facebook account over hate speech. Wants fish fingers, coffee and other types of food and beverages to have the same quality in Eastern and Western Europe. Made Airbnb change their terms of service. Her life story has been compared to a “dark version of 'Borgen.'”\n\nEstonia — Kadri Simson\n\nDescribed as \"always prepared\" and \"smiley.\" But also no technocrat, according to one diplomat. Known in Tallinn for being very loyal to her Center Party. Unsuccessfully challenged for leadership of her party in 2015. Brought up in the university town of Tartu, which Estonians say “carries a spirit” that you’ll only understand if you visit (they may get kickbacks from the tourist board).\n\nFinland — Jutta Urpilainen\n\nFormer finance minister and ex-leader of the Social Democrats. Veteran breaker of glass ceilings — she was the first woman to hold either of those jobs. Also Finland’s first female commissioner. Studied to become a school principal, but decided politics was a better fit. Known for her tough line demanding collateral in exchange for bailouts during the eurozone crisis. Crowned Europe’s “fourth best finance minister” in 2012. Will join the Commission straight from parental leave, as she recently adopted a second child from Colombia. Recorded a Christmas album called “Christmassy thoughts” featuring versions of “Winter Wonderland” and “Jingle Bells.” Here she is singing \"We Will Rock You.\"\n\nFrance — Sylvie Goulard\n\nMarseillaise with a soft spot for Europe, Germany and anything eurozone-related. Short-lived defense minister. Part of the French team that negotiated on the reunification of Germany. Designer of the Macron brand in Brussels. Very plugged-in EU integrationist who speaks German and Italian. Author of books such as “Europe: love or separate beds?” and “Goodbye Europe!\" Stood for the European Parliament presidency in 2016. Worked for Romano Prodi when he was Commission president. Currently deputy governor of the French central bank. Once said there shouldn't be a Commission full of \"old white men.” MEPs will grill her over alleged misuse of EU funds by her party during her time in the European Parliament and highly paid side gig as a consultant to a U.S. think tank.\n\nGreece — Margaritis Schinas\n\nUntil recently European Commission chief spokesperson. Sometimes known as “senior Commission official.” Now becomes, well, a more senior Commission official. A member of the European Parliament for Greece's center-right New Democracy between 2007 and 2009. Married to Mercedes Alvargonzález, a top European Parliament official. Has quoted the Spice Girls from the podium. Not a fan of being called a \"bureaucrat.\" Once told a Belgian reporter the Commission had “no intention to ban Belgian fries and another kind of fries,” and added: “Les frites, c’est chic!” Has a reputation for taking calls and answering messages; even his enemies say that he replies to them. But not a press room favorite.\n\nHungary — László Trócsányi\n\nMEP who served as Hungary’s justice minister from 2014 until 2019. Was a member of the country’s Constitutional Court and had stints as ambassador to Belgium and France. Not a member of the country’s ruling Fidesz party, but led the party’s list in the European Parliament election. Perceived as loyal to Prime Minister Viktor Orbán. Candidacy faced questions as he served as justice minister at a time when critics say the Hungarian government worked to undermine checks and balances.\n\nIreland — Phil Hogan\n\nFixer, bruiser, wily operator. As EU farm chief, steered the bloc through a milk overproduction crisis and proposed his own Common Agricultural Policy. Took flak in Ireland from farmers over the Mercosur trade agreement. Fine Gael government views him as a shrewd deal-maker who helps Ireland punch above its weight. Has been brutally critical of Brexit and Boris Johnson. Reputation at home sullied after introducing an unpopular water charge at the height of the financial crisis. Stands 1.95 meters tall. Renowned for his hearty Irish diet of meat and potatoes. Has been known to greet reporters with an affectionate “this little f**ker!”\n\nItaly — Paolo Gentiloni\n\nDescendant of Count Gentiloni Silveri. Former prime minister. Aristocratic far-left activist in his twenties, turned president of the Democratic Party. Polyglot and former journalist. Former minister for foreign affairs and communications. Known for his elegance, manners and diplomatic skills. One of the most vehement opponents of his party's new governing alliance with the populist 5Stars. A move to Brussels is the perfect way for him to pull out of national politics. Known as \"er moviola\" (\"slow-mover\" in Rome's local dialect).\n\nLatvia — Valdis Dombrovskis\n\nWas prime minister for almost half a decade, as the government was forced to slash salaries and spending under an international bailout. Stepped down after 54 people died when a shopping center collapsed. Worked as a lab assistant in Germany. Ex-MEP. Arriving in Brussels, he was made vice president for the euro and social dialogue, albeit with a public-speaking style more disciplined than chatty (except perhaps while sharing a few drinks with the press). Mid-term, he picked up the pieces of the financial services file, after Britain’s Jonathan Hill quit.\n\nLithuania — Virginijus Sinkevičius\n\nDoesn’t seem to be big on climate change or gender equality (in Lithuania at least), which could cause trouble with his new boss. Member of the Farmers and Greens Union party, which is not green enough for other Greens. Youngest Commission nominee, at 28. Entered politics in 2016. Known for keeping a Donald Trump \"Make America Great Again\" hat in his office. Studied in the U.K. and the Netherlands. Worked for the Lithuania Tribune news portal. Once won an award for \"Best Solution for Better Business Environment of the Year,\" whatever that means.\n\nLuxembourg — Nicolas Schmit\n\nBorn in Luxembourg’s steel heartlands. Polyglot. Socialist with international ambitions. Long-serving labor minister under coalition governments led by Jean-Claude Juncker and Xavier Bettel. Formerly von der Leyen’s opposite number when she was labor minister in Germany. No stranger to Brussels. Served as Luxembourg’s ambassador and permanent representative to the EU for six years. In a 2011 scandal, he denied attempting to pressure police officers to drop charges against his son. The 18th most popular Luxembourg politician, according to a survey. Won the nod for EU commissioner as part of horse-trading for coalition posts following Luxembourg’s 2018 election.\n\nMalta — Helena Dalli\n\nFirst Maltese woman nominated for the Commission. Would be first movie star and beauty pageant contestant to be a commissioner. An MP for the Labour Party. Later became minister for social dialogue and EU affairs. Introduced the marriage equality bill in Malta. According to the Times of Malta, Dalli (formerly Abela) won the Miss Malta contest 40 years ago and represented Malta in the Miss World contest in London. Starred in an action film called \"Final Justice.\" Told POLITICO that in the European Parliament \"there is a very good move for [gender] parity, but I am sorry to say not in the Commission.\" Will hopefully be less trouble than the last person called Dalli to be a commissioner.\n\nPoland — Janusz Wojciechowski\n\nHas had one of Poland’s more limber political careers. Former judge and member of an agrarian satellite party to the ruling communists. Was a member, then leader of the farmers’ Polish People’s Party (PSL). In Europe, has been a member of the European People's Party, Europe of Nations and Freedom, and European Conservatives and Reformists. Replaced Krzysztof Szczerski who withdrew himself from consideration after von der Leyen proposed that the country get the agriculture portfolio. Polish member of the European Court of Auditors. Columnist for Poland’s hard-right, ultra-Catholic Radio Maryja network. Has a habit of writing biting poems about his long list of political enemies. Under investigation by the EU's anti-fraud agency, OLAF, for alleged irregularities in the reimbursement of travel expenses.\n\nPortugal — Elisa Ferreira\n\nEconomist. Deputy governor of the Bank of Portugal. Held ministerial posts under former Prime Minister António Guterres. Served three terms as an MEP for the Socialists & Democrats (S&D). Led the European Parliament’s work on one of the main elements of banking union. Has said “the banking system is European in life and national in death.” Chosen ahead of former Infrastructure Minister Pedro Marques. First Portuguese woman to be put forward as commissioner. Part of the S&D's “alternative troika” sent to Greece to look at ways to stimulate the economy.\n\nRomania — Rovana Plumb\n\nRomanian MEP from the ruling PSD party. Loyal to former PSD leader Liviu Dragnea, who’s now in jail over a case involving fake jobs for party workers. Doesn't get along with current Romanian commissioner Corina Crețu. Former EU funds minister. Was a suspect in 2017 in a case by Romania’s anti-corruption agency but avoided investigation because MPs voted to keep her immunity. Vice chair of the Socialists and Democrats group.\n\nSlovakia — Maroš Šefčovič\n\nHas lost campaigns to be president of Slovakia and center-left candidate for the European Commission presidency this year. Gearing up for a decade in the College of Commissioners. Career diplomat. Šef, as he's often called, spent the past five years trying to mediate a standoff over gas supply between Russia and Ukraine. Big into space and expanding EU battery production. Fits it all in between workouts at Basic Fit. Big \"Star Trek\" fan, he once told POLITICO to “live long and prosper.”\n\nSlovenia — Janez Lenarčič\n\nCareer diplomat. Degree in international law. Has served as ambassador to the OSCE, director of the OSCE's Office for Democratic Institutions and Human Rights, secretary of Slovenia's permanent U.N. mission, and the PM's diplomatic adviser. Was politically unaffiliated when nominated, as Prime Minister Marjan Šarec said he didn't want to pick anyone from the main coalition parties (although as a former satirist, Šarec may have been joking). But will belong to the liberal ALDE camp. Ex-Prime Minister Janez Drnovšek 's right-hand man in the field of international relations.\n\nSpain — Josep Borrell\n\nSon of a baker from a village of 3,000 people in the Pyrenees. Former aeronautics engineer and Stanford student. Has a reputation for speaking his mind and challenging authority. A 72-year-old veteran of the Socialist takeover in Spain in 1982. Represented Spain in the (failed) European Convention on the future of Europe in 2002. Former European Parliament president at a time when Parliament presidents were not very visible. Catalan, but an outspoken opponent of Catalan independence. One of the first to recognize Juan Guaidó as Venezuela’s interim president. Reckons you should \"leave God\" out of politics. Was president of the European University Institute based in Florence, but quit amid controversy over an alleged conflict of interest.\n\nSweden — Ylva Johansson\n\nMinister of employment since 2014. Entered politics as a communist then defected to the Social Democrats. Worked as a minister in five different governments under three prime ministers. Has been described as the “left wing of the Social Democrats.” Former math, physics and chemistry teacher. Fell in love with her husband Erik Åsbrink when they were both ministers in the 1990s. Member of Sweden’s backup government in case of war. Huge fan and honorary member of Hammarby football club. Very strong Instagram game.\n\nBy Lili Bayer, Hannah Brenton, Jan Cienski, Paul Dallison, Maïa de La Baume, Laura Greenhalgh, Anca Gurzu, Melissa Heikkilä, Laura Kayali, Ivo Oliveira, Kalina Oroschakoff, Joshua Posaner, John Rega, Silvia Sciorilli Borrelli, Eline Schaart, Bjarke Smith-Meyer, Paola Tamma, Simon Van Dorpe, Eddy Wax.\n\nThis article is from POLITICO Pro: POLITICO’s premium policy service. To discover why thousands of professionals rely on Pro every day, email pro@politico.eu for a complimentary trial.", "description": "All you need to know about Ursula von der Leyen’s team.", "authors": [], "top_image": "https://www.politico.eu/wp-content/uploads/2019/09/vdlteam-1200x628.jpg", "published_at": "2019-09-09"}