{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/10/shingy-reflects-on-his-time-at-aol-and-whats-next.html", "downloaded_at": "2019-10-03 23:43:29.639388+00:00", "published_at": "2019-10-03", "title": "Shingy Reflects on His Time at AOL and What’s Next", "language": "en", "text": "Photo: John Lamparski/Getty Images\n\nEarlier this year, the tech world was rocked by the exit of Shingy. Yes, the rumors were true: Shingy was leaving AOL. Shingy (a play on his legal name, David Shing) made headlines in 2014 when he appeared on TV, touted as AOL’s “Digital Prophet.” To people who experienced Shingy from the TV appearance, he seemed to represent the stumbles of AOL as a whole: a grown man with wild hair and nail polish referring to himself as a mystic on cable TV, a desperate attempt at cool. A withering New Yorker piece later that year cemented the perception.\n\nIn reality, the “digital prophet” moniker was a funny name slapped on Shingy’s fairly standard role in marketing AOL’s brand to advertisers. Now Shingy says he’s done with that role. “We inhabit a pivotal time at which much is at stake in how we practice media and marketing,” he wrote in his goodbye letter. The man who, to some, became an avatar of AOL’s (and then Verizon Media’s) uncertainty and aimlessness is now in the wilderness himself, taking a break. He spoke with Intelligencer about his experiences so far, and what might be next.\n\nThe reason I got in touch was your recent announcement that you’d left AOL. I was interested in that, plus you’ve been a point of fascination within certain tech circles for a while.\n\nIt’s interesting because I’m taking some time off, but when I meet with people, the first thing they ask me is “Shingy, why’d it take so long?” And I’m kind of bewildered by that because I’ve been so nose down, bum up. I travel a lot. I’ve been a constant output machine for years now. I get it, man, I’m pretty self aware of people — they love me or they hate me, one or the other, and that’s okay. And most of them see the persona; they don’t actually get a sense of the person. It’s all been by design.\n\nSo I guess I’d like to start at square one. What was your childhood like? How did you get to where you are now?\n\nIt was pretty basic. I’m one of ten kids from Australia, six miles north of Sydney, and because I’m one of ten (I’m number eight), it was a very active country lifestyle. I studied arts; that was really my favorite. For me, it was fine art. I was fascinated with Jackson Pollock and Picasso and all the standards you’d expect. And then art in general, sculpting, and then painting and drawing was the thing I was really drawn to, woodwork. I mean, all the usual things that sort of ground you in hands and heart. I’m not massively fascinated by science or biology or chemistry or any of that stuff.\n\nWhen I was about 17, I left school and went to Sydney, studied graphic design. And that was great. It just gave the grounding about what did it mean to go from art to graphic art? And then what does commercial graphic art look like? What does it mean to hand-kern fonts? And what does that mean to come up with concepts and ideas? And what’s this idea of advertising, which I grew up with but I didn’t really find fascinating until my early 20s.\n\nI worked for a little company, and then I went full time at a corporate software company — can’t remember the name. Then from there, I joined a team to do some software, which was fascinating. Like, to be an interface designer for software for the internet.\n\nSo you were doing UI design? Was this at a time when UI design wasn’t standardized, and everyone was still figuring it out?\n\nOh yeah. It was beveled buttons and having to create a GIF out of those things. And the idea of 256-color web palettes, 640 by 480 screens, 800 by 600 screens; 1,024 by 768 was probably brand-new back then. But UI was … oh no, Dreamweaver wasn’t even a thing, I don’t think. I think I was designing in Photoshop. When I came out of design school, which, fascinatingly, people would say, “You’re going to get in trouble; the industry is going to implode.” What do you mean? “You’re the last of the old-fashioned graphic designers.” Because what comes next are computers, and I hadn’t trained on computers. And along came computers, and it did it hurt the industry because now everybody who had a computer was basically a designer and had access to millions of colors and tens of thousands of fonts. Like any industry, when that happens, it kind of democratizes it. Everyone’s a designer. That’s great. But very quickly after that, I realized that not everybody has taste. And that’s what craft’s about.\n\nWhen you load up an old Geocities site —\n\nBeautiful, beautiful analogy.\n\nI love it, but it’s a real mess.\n\nIt’s a real mess. You know, it’s so funny you should bring that up, because one of the things I’ve been thinking about recently is that the internet needs to be punk. It needs to have more rock and roll in it. If you look at the internet, everything is homogenized; it really does look the same, particularly the places you hang out. So I was a designer, a GUI designer by default, since it was coming around the corner, and I got a chance to move to New York, late ’90s, with a start-up that was doing website design, like software to build websites. If you think of Squarespace now, take it back to 1999; it was really chunky and hard to do. But there was some interesting technology in there.\n\nThen I ended up going to London, and a friend of mine who used to work for me in New York had joined AOL.\n\nWhat year was this?\n\nI went to London a couple of times, the second time was in 2007, 2008, or something like that. 2007. And then I came on as a contractor for him. And then we helped launch a bunch of territories.\n\nTerritories for …\n\nAOL.\n\nAt that point, AOL is this enormous —\n\nNot true. In the U.S. it was, and it was in the U.K. and Germany.\n\nSo is it like launching AOL —\n\nDot E S, for Spain.\n\nIs it launching the web portal? Is it the dial-up service?\n\nOh, I see the dynamics of business.\n\nI’m trying to figure out which part of AOL.\n\nThe ISP bit that you talked about, that wasn’t part of the business model for a very long time. So when I came on board, it was to launch, you know, AOL.es, AOL.nl, AOL.pl, so launch countries, really, right? And it was an interesting strategy but not one that had longevity.\n\nWithin these regional launches, what were you tasked with?\n\nLaunching them as head of marketing. And that helped to build a relationship with people who would sell the site in the territory, because we didn’t have salespeople on the ground. So we had resellers that would go out and sell for us. I didn’t have to schmooze the locals, but my job was to bring someone in who could actually build the relationship. My job was to stand up the site, launch it, and then do it again in a bunch of other countries.\n\nDoes that involve a lot of travel or just a lot of phone calls?\n\nA lot of travel. You gotta be local. I mean, otherwise they’re not going to care about you. Particularly in places like Italy and Spain and all of them. Poland, the Nordics generally, I mean, they’re all just fascinating. We managed it from London, but you have to sort of set it up and make sure you nurture it. This virtuality we think of is not necessarily where it’s all headed, because we want to have human relationships in business.\n\nOkay, so you launch all these territories. How do you go from doing that to your final role as the “digital prophet”?\n\nLet me bridge you on this whole thing, so we’re caught up. So Tim Armstrong comes onboard, and he is the new CEO, as you know, may not know. So he came onboard to rebirth AOL as a company, and he did a tour of all the territories; we met on one of those tours, and through that relationship of meeting, we were quite kindred immediately. One of the things I whispered to him is “I don’t know if all the territories I just launched is the best strategy forward. You might want to get it right first before you do global domination.” And he asked me to come on full time and help the European organization. The person I was working for at the time was Kate Burns. She became the managing director of AOL Europe — fantastic lady, incredible operator — and I was thrilled working for her. She’s a sort of vivacious, empowered operator; she really got shit done. In that tenure, we closed down all the stuff I launched, receded, and decided, you know, we should probably just be in the U.K., France, Germany. My job was media and marketing: sit with the sales team, figure out really what people wanted, what propositions they wanted to advertise on, and then either build them or take the ones we already had and extend them. That was kind of the gig. Pretty cool.\n\nThe “prophet” piece came from when I helped rebirth AOL’s brand. I was hand-chosen to launch the mission statement for AOL in this period. Tim decided to launch a new mission, and in his first massive town hall, in front of probably 10,000 people, we launched the mission statement. I went onstage and announced it. I flew in from Europe, snuck in one night, turned up onstage, announced the mission statement, threw a bunch of hats into the crowd, and pissed off. And then, like, we’re going to also rebirth the logo, identity, the whole strategy around it. I’m like, “Great. That’s my flywheel. Let’s talk about that and try to steer that in the right direction.”\n\nYeah, I have to imagine AOL’s brand identity was not exactly a nimble ship to steer.\n\nIt has so many tentacles into so many different places that, you know, to say you’re going to reboot the brand is incredibly difficult to prepare. So we invented this idea of this AOL, the idea that anything could be an A or a logo or part of an identity. So a photograph of this sugar [holds up sugar bowl] could have an AOL logo on it because it’s part of culture. It’s sweetener. This was a while ago now, but that was the concept. Take this thing that seemed like a pointed arrow and soften the shoulders superfast. So it was that principle, and then we ended up launching that.\n\nBut what happens in a company, particularly when you try and get a strategy right, is when one division performs poorly, everyone suffers. It’s just the nature of the big business. Instead of dealing with that one problem, spreading the pain is a challenge. And when you’re in a territory that isn’t headquarters, that pain can feel like it’s not much to headquarters, but it affects you intimately. So around 2010, after that happened, I decided to talk about AOL just in the marketplace differently. I didn’t have the budget to really do consumer marketing aggressively, like I wanted to. And then we ended up —\n\nWait, let’s just pretend like I’m 5. Like if it’s not consumer marketing, do you mean marketing to other —\n\nThe media community. So to advertising agencies, to brands, people who actually help us pay rent, people who are going to place ads on websites.\n\nSo like going to conferences.\n\nJust the market itself. Not giving a spiel. Like sit on panels and talk about stuff because I’m the AOL guy. And it was less about amplifying the marketing to you, Brian, who doesn’t know nothing about what we are. We didn’t have the budget to do that much. We could do some, but not enormous. So it was really just to kind of make sure advertisers knew we were still around, people knew, you know, that it mattered. Then Tim asked me to come on full time and do it in New York. He wanted to call me an evangelist, and we all said, “No, that sounds too much like Google.” There’s evangelists at Google and Microsoft and a bunch of others; I’m not that interested in that. So I decided to come up with a title overnight. Couple bottles of wine and boom, I had a laugh to myself and called myself the prophet.\n\nWould you say “digital prophet” is like a synonym for “evangelist”?\n\nYeah, it’s not different. I mean, the whole idea is, in the creative marketplace, I feel like it needed some fun, some levity. So I came up with something that’s not serious. It was designed to have levity to it. A lot of people couldn’t reconcile it — weird hair, nail polish, dude calls himself the digital prophet and walks around with an AOL business card, what gives? It’s awesome. So much fun with that. If you read the New Yorker piece, you understand what happens. They did a profile on me, and it’s just a total tear-up. Good luck. You spent an entire day with me, all you want to write about is the stuff that makes me look like a skylark. Like you don’t see the value that happened behind the curtain.\n\nWhat did that piece leave out?\n\nMeetings I had that were actually business-development-style meetings. Or the fact that I spent the morning presenting, interviewing Gavin DeGraw onstage and Jason Momoa. I mean, you know, stuff that actually was real work. It was just a total stitch-up. And it was a joke. But thank God, they did. It just made me more interesting and more famous, so God bless.\n\nThat piece came out after a screenshot of you on TV started floating around.\n\nYeah, yeah, on The Cycle. What happened was that we had a bad week, news-cycle-wise. Tim went on TV and talked about the stress babies, and this terrible article came out. It was just taken out of context. If you know him, he’s an incredible, incredibly compassionate — but anyway, taken out of context. I think the next day or that week, I was booked to do The Cycle, and I called the head of comms — I didn’t book it — and said, “Hey, I’m on this TV show thing. Shall I sit out?” They’re like, “No no, Shingy, business as usual. Let’s get on with it.” So now I’m on MSNBC — The Cycle is pretty meat-and-potatoes America — and I’m talking about concepts like defriend, unfollow, and there’s the nail polish and the hair and the leather jacket and the glasses and the title “prophet.”\n\nThey had the chyron.\n\nYeah, yeah, yeah. And then, you know, Gawker, I think, took a screen grab. The rest, as they say, is history. Hell of a thing, man.\n\nPhoto: Valleywag\n\nI guess I’m hearing that you think the reaction was overblown. But as someone who was looking at it from the outside, I think it looked like AOL — a company that, at that point, had a sort of stodgy reputation — was just trying and failing to be cool somehow.\n\nI don’t think it was overblown. I just think it was if you’re inside media or you’re inside brands or you’re an executive in the media, you kind of get the context because there is context. When somebody comes on for three minutes or something, it just seems like the context is completely off. That’s why my comms team probably should’ve said no to it. And it ended up being what it was. It wasn’t overblown; I just think it was current and ripe for the picking. I just happened to be picked.\n\nAt AOL around that time, do you recall any internal reaction?\n\nPeople thought it was fantastic. Kept them in the news cycle, made us seem far more interesting, meant we had interesting people that just didn’t — it wasn’t stodgy, it’s just a lot of people didn’t know that. I think I represented more of the “not stodgy,” if that makes sense. It’s this historical, 25-year-old brand. It wasn’t like, “Oh my God, now what?” 2014, 2015 is an interesting time anyway. Everyone’s trying to create the app of the century, iPad strategies, everyone’s having a crack at it, trying to be culturally relevant. I was just agnostic, talking about stuff that’s going on, whatever.\n\nThat fills in a lot of gaps\n\nReally? I thought that stuff had been written about.\n\nI guess maybe. Maybe I want to preserve the mystery.\n\nI’m vibin’ this, like, “Treat me like a 5-year-old. I don’t quite get why this works. Why is this relevant?” I’m feeling that from you, which I get. I mean, I respect that. But what I never tried to tell the marketplace — which, frankly, I don’t really want to tell them now — is why it really worked and how it really worked. And, you know, that’s kind of the mystery. But I can tell you that having that title and doing that work that I did, first it demonstrated that there was a hunger for it, so I did it for a while; second, there’s value in it because it got people meetings they could never get before; and third, people in the industry still respect and know what I do, which is a separate piece from all of that shit.\n\nThere’s a picture of me on a wrecking ball that made the rounds too. That was not a late-night party at South by Southwest. People thought I’d orchestrated this incredible PR thing. I’m on the wrecking-ball thing at 10:30 in the morning, and there’s nobody in that room. And the publisher of Mashable at the time asked me to walk around their execution as a technical thing and give feedback. People thought it was like a 3 a.m. party. I probably shouldn’t have corrected it. That’s awesome to think I have the audacity to do that.\n\nDid the idea that anything you do can be taken out of context freak you out? Did you start second-guessing yourself?\n\nI definitely was cautious about it because when you get trolled several times, you’re kind of like, “I’m good. I’ll just put my head down and keep working and doing the work I need to do,” which is not to be invisible. Don’t get me wrong, oh my God, I’m in the market more than ever before. It’s just that the context was awesome. I just didn’t think it was that important; I didn’t think it was that interesting.\n\nI think it all sort of happened around the time Valleywag was very popular and was highlighting tech companies that were perceived to be pissing away money.\n\nNo, you’re right. That calmed down, I guess, in the last five or six years.\n\nYeah, it’s now that everyone’s just mad at tech companies.\n\nAbsolutely, it’s everybody’s turn now. It’s actually Facebook’s turn. Everyone cycles, mate, you go through this. Look at Microsoft, they went through a period where they were the heroes, and they couldn’t do anything wrong. They end up in the capitol, talking about why they shouldn’t be split off and blah, blah, blah, blah, blah. And then 10 years later, it’s Google’s turn. They spent all this time down there. And then, well, guess what: Ten years later, it’s Facebook’s turn. Yeah, just everyone has a turn. And then they get superconservative. They can’t do anything, because they become massive and bloated. So their innovation cycle’s upset. That’s popularity. It was always in the background — we held on to an audience that’s just kind of … stayed. It’s been interesting. So the idea of MSN, AOL, and Yahoo all coming together, it’s no surprise, somebody had to do it. I’m just surprised we did it.\n\nDo you think they’ve gotten stronger together?\n\nNo, but thank God, there’s focus. Can you bring down the best of those three into one thing? Awesome. Everything else that’s independent, they hopefully get a lifeline to continue doing that. TechCrunch, Engadget, HuffPost, it’s just the brands inside there that are independent, hopefully have the fuel to continue their independence. I love TechCrunch, and I love HuffPost — they’re the rags I read. So, you know, I respect that. I don’t often visit the homepage of Yahoo. I don’t need to. But there are plenty of people that do.\n\nI feel like Yahoo and dinosaurs like that, for lack of a better word, are often coasting a lot of the time — at least, that’s my read from the outside.\n\nNo, no, no disrespect there. What I think is interesting is there’s two sides of the business. There are the media brands that are trying to continue creating contagion. Some of them have a bigger audience; they seem like they can’t pivot quickly, so they stay true to the audience they have. Yahoo, AOL, MSN, etc. And then on the other side, you got these other brands trying to create really interesting contagion, changing. I mean, when we acquired HuffPost it was about that story you wrote will be published on that site and, if it became popular, could end up on the home page of the category you give a shit about. That’s an interesting premise. Yeah, so it’s kind of UGC [user-generated content] with both. The flip side of that was now it’s changed to being paid editorial. And it’s hard hitting, and it’s fantastic. But that’s kind of one side of the business, which is media. The other side of the business, which is really powerful for them, is the platform side, the ability to actually rep a whole bunch of third-party brands and give scale. And that’s the programmatic side.\n\nSo the company is actually balanced between those two things, not just one thing, which is selling only their relationships with their audience, like everyone else’s — Google, Facebook, etc. It’s kind of like a portfolio over here and a bigger portfolio over here. It’s this tech company that has media chops and advertising chops. You know, it’s hard, man, to create new, compelling propositions, no matter how innovative they seem, with a masthead that may not seem as glossy to an audience.They don’t rest on their laurels; they’re constantly trying to change.\n\nWhat does Verizon get out of this?\n\nIncredible ad tech, owned-and-operated media. Think about all the households they have; they could go out and do relationships with third parties like YouTube, etc. They’ve got their own now. If they can push that content directly, have more of a relationship with the consumer, they get closer to the consumer. It’s not just about “Hey, I’ve got this fat funnel. Do you want to bring your content along for the ride, so I can hold people’s attention?” That’s really the power behind having the media side of this. The programmatic side is just about how to deliver some sort of compelling advertising opportunities, hopefully in a format that feels like it’s innovative. It’s not there yet, it’s miles away from being there, but that’s really the promise.\n\nIn your role as this evangelizing VP, how do you evaluate your own success? What would you accomplish that demonstrates you’re good at your job?\n\nHundreds of meetings a year, outside of doing conferences.\n\nWhat’s the goal of those meetings?\n\nThink about the brand differently and hopefully have a relationship that says, “Hey, if you want an editorial voice, TechCrunch might be the one to show you how to get there,” or “If you want to meet mass consumers, AOL can help you get there as well.” That’s different than just social, different than just search. And that was really my role.\n\nDo you think you were successful in that role?\n\nYeah.\n\nSo you’re not with Verizon Media anymore. What’s next?\n\nI don’t know. I’m in limbo. I just decided to take some time off. I had an incredible July. I just came off Cannes, educating the young market, young creatives, and a bunch of good meetings while I was in Europe. And I just came off the road and thought, Let me look inwardly as an organization. We’re part media, part technology: What does that mean for somebody who feels like they’re a creative who wants to still build stuff, not just talk about building stuff or the potential of building stuff? And how do I do that? Could I construct something inside there that allowed me to do that but had a higher purpose? I ultimately decided, “No, I don’t think I could.” I mean, I love my job, but I just wanted to do things that help better the world, just have a different type of legacy. I would rather speak about things that don’t promote, for instance, not using plastic straws that are killing turtles. But what about the fact that the ocean’s boiling? What can I do as as somebody who has creative, media, and technology experience and understanding how to orchestrate that.\n\nIt sounds like you just want some distance from it to do something a little bit new.\n\nAlso I’m more of a polymath. People think I just do that; there are many other things I’m interested in and have opinions and experiences. But I can’t do it under the guise of a guy who touts the power of the internet.\n\nWould you say you’ve become disillusioned with the internet?\n\nNo, I think the frequency of it is just slightly too high. We’re in a space right now where [gesturing around the restaurant] your phone’s on the table —\n\nFor the record, my phone’s out for recording this, just to be clear.\n\nTheir laptop’s on the table, two phones there, two phones there, two phones over there with one person. What’s remarkable is that there’s only one person looking at their device right now. If we give it another ten minutes, probably 70 percent of this room is going to be on their phones. But what gives me faith, in this room right now, people are actually talking to each other. That’s amazing. The more and more I travel, and a lot of the time I’m traveling by myself, I look around and, like, people just aren’t into it, man. They’re just into not being present. And this technology is amazing, but it’s not necessarily healthy. More frequently, I’ve been talking about digital detoxing. How can you lower your vibration by being further away? [Points at phone] This thing is meant to be a productivity tool; it’s not necessarily making you more productive if you haven’t looked up. I’m just concerned about some of those human traits, because it’s changed our behavior but it hasn’t changed our need: Our need for connection is still real. I just question whether that connection is any better. Which is kind of why I still think the internet needs to be punk a bit. It’s a bit too homogenized.\n\nYeah, everything happens on like three sites right now that are all owned by Facebook.\n\nAnd you’re told to be expressive in a place that’s 716 pixels wide and there’s blue bar across the top. And then the the format of it feels very linear.\n\nIs there anything coming down the pipeline that excites you?\n\nNot that I can really, really speak to, but I’m intrigued by things like — I thought the New York Times was hitting something interesting when they did “Snow Fall.” I thought it was great. And that was before everything was parallaxed.\n\nEveryone went all in on parallax.\n\nOh boy, probably a little bit too over overconfident there, but that was a really interesting, intriguing moment to say, well, it feels like things are a bit too noisy. How about a visual that still has depth but isn’t video? And it really makes you sort of sit up and look forward because you have to roll through it. I thought that was amazing. And then, you know, I think Medium’s an interesting site too, just because some people have an outlet for long thought, sort of formatted a bit differently. It’s all closing. You use WhatsApp, I assume?\n\nI mean, I use iMessage mostly, but with WhatsApp, all my friends are in the U.S., so it’s not a go-to.\n\nIf I think about the things that are super contagious, they’re WhatsApp, WeChat, Line —\n\nMessaging.\n\nSnapchat, Messenger, texting. I mean, that’s all kind of wonderful. It’s going back to one-to-one. It’s not about broadcast, so it’s going back to narrowcast. The format’s very unsexy. If you look at the GUI around WhatsApp, it looks like bloody Myspace — I mean, it’s not very sexy. But it has the ability to feel like you’re actually part of something because you’re not broadcasting. I do think the broadcast medium has been very homogenized. There’s a particular way to shoot photos to make sure you look like you’re part of Instagram. Here’s your persona outwardly, and here’s your intimacy. Do the two come together? Maybe not.\n\nI feel it’s more of a problem for people like my age or older, people who just like —\n\nCare?\n\nOr who remember a point when you were advised to, like, “be careful what you do on the internet,” you know. But now I feel like — and I have nothing to back this up — but, like, younger people just know how to reconcile those different spaces.\n\nYeah, absolutely. But that’s also their culture. My time was TV, which is passive, and radio, just passive. So these passive behaviors are now part of the vernacular. It’s common. I mentor these young kids, presented to a bunch of these kids last week — I have more time to do stuff I really couldn’t justify doing and giving back. This was at a place in Detroit, and I sat and listened; I actually spent the whole day. Normally, I come in, present, and leave as quickly as possible for the next thing. But I learned a lot from them. A lot of them were concerned, saying, “I’ve closed down my Instagram, and now it’s private,” or “Everything’s private now because I don’t want people to judge my own social footprint when I’m getting a job.” My feedback to them was if they judge your social footprint about getting a job, then you don’t want to work for them, because it’s the tool of your culture and your people, your time. So if people don’t get that, then they’re out of step with you anyway. That was kind of fascinating.\n\nIn this interim period for you, what do you do with your free time?\n\nI’m looking to help advise the companies that I think are just interesting, in the spaces I don’t normally play around in. Why not? And then I’m taking real time off, phones off. I’m watching the sunset on the beach every night.\n\nIn your good-bye letter, you said you have a daughter.\n\nYeah, a 2-and-a-half-year-old daughter. If I knew it was this good, I would have done it earlier.\n\nI assume you worry about all this stuff on a much more severe level now.\n\nI do. Oh, it’s a heightened state of awareness, my friend. And that came from parenthood. Up until then, I was Peter Pan and happy for it to be jolly and happy for this whole thing that was maybe work, maybe not work. Now? I’m very, very, very concerned about the attention economy, which I believed in.\n\nIs there any time when you’re like, “Oh, she’s not touching that until she’s 7” or whatever?\n\nYeah, I mean, my daughter is screen free until I have to introduce it. And there’s a time when she’ll have to be introduced. Anytime she gets to see a screen, it’s the seatback on the airplane. She doesn’t really have a context for that. So other than that, we’re trying to be screen free. It’s real tough. I’m also trying to, you know, I don’t have my phone out. I consciously don’t pull it out. Trying to be in the popular culture means you’re going to dig around your phone 1,000 times a day. I stop short of getting a flip phone. A little too radical, but I like the idea.", "description": "AOL’s Digital Prophet speaks out.", "authors": ["Brian Feldman"], "top_image": "https://pixel.nymag.com/imgs/daily/grub/2019/10/03/03-shingy.w1200.h630.jpg"}