{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/eight-tips-for-using-the-new-steam-library", "downloaded_at": "2019-09-19 06:02:43.330039+00:00", "title": "Eight Tips For Using The New Steam Library", "language": "en", "text": "Yesterday, Steam’s first big library overhaul in eons entered open beta. The fresh coat of paint and (virtual) new shelves make for welcome additions, but it’s going to take some getting used to. Then there’s the new community-centric game page display, which somewhat ironically has the community divided. Here are some tips to help you deal with all of that and more.\n\nAccessing the new library\n\nFor now, the new Steam library is still in beta, so by default, you’re stuck with the old digs for a little longer. Savour these more innocent times, because when change comes, it strikes like an arrow. That’s tip number one, and it also doubles as life advice.\n\nTip number two (but the first tip that exclusively applies to Steam): If you want to access the new library now, click the “Steam” drop-down menu in the upper-left corner of Steam, select “settings,” and click over to the “account” tab. You should see a section labelled “beta participation.”\n\nFrom there, select “change,” because ultimately, you are the arbiter of change in your own life, not some mindless tumbleweed being blown whichever way the wind takes you (turns out the second tip was also life advice after all, surprise). Doing that should make a pop-up appear. Select “Steam beta update,” restart Steam, and you’ll be good to go.\n\nHiding those pesky community features\n\nThe new Steam library is heavily community oriented, which isn’t everybody’s cup of tea. As far as I can tell, this is the most complained-about element of the overhaul at the time of writing. In particular, folks seem to take issue with the way that individual games’ pages put the game activity of your friends and, regrettably, a whole bunch of randos front and centre. Fun fact: The Steam community likes to post porn! Not all of that porn gets moderated right away! Fortunately, your friends get prime real estate at the top of the activity feed, but even then, their achievements and screenshots can still spoil major portions of games you might be playing.\n\nCurrently, there’s no option to entirely disable this, but there is a workaround. First, open up the same settings menu you used to enable the new library. This time, select the “library” tab. In there, you should see an option called “low bandwidth mode.” Select it. This will, among other things, disable community content by default. This doesn’t remove your friends’ accomplishments from the activity feed, so you’ll still have to watch out for that, but it renders broader community content entirely optional.\n\nImproving performance\n\nIf you activated low bandwidth mode, you’re already part of the way to shrinking the Goliath-like footprint of new Steam. Part two is just as easy. Simply go to the same too-tucked-away menu and select “low performance mode.” You’ll lose out on a few graphical effects, but everything will load much faster. It’s a worthwhile trade-off if you’re running Steam on an older machine, or even if you’ve got a snarling hotrod of a PC and just want to play your dang games already.\n\nDragging and dropping\n\nThe new Steam library places a big emphasis on “collections,” which allow you to organise games according to Steam-generated tags or whatever arbitrary criteria you please.\n\nIf you want to add a new game to a collection, you can right click on that game and scroll down to “add to,” but that’s a pain. Instead, just drag that game’s icon or title to whichever collection you please and drop it there. This works whether you’re in the sub-menu for a particular collection or viewing your Steam library as a whole.\n\nStopping games before they start\n\nYou know the nightmare lurking in the heart of man, for you have lived it: You’re scrolling through your Steam library, looking to play a particular game, but you’re only half-thinking about the task at hand, and before you know it, you’ve launched the wrong game.\n\nNow you have to watch a bunch of splash screens and other obligatory nonsense that you don’t and will never under any condition give even a single shit about. Then, and only then, can you quit to desktop.\n\nIf, however, you look near a game’s title in its new detail page after you’ve launched it, you should see a big “STOP” button. Hit that, and Steam will abort the launch. Thank god.\n\nViewing games by size on your hard drive\n\nIf you’re anything like me, your hard drive is constantly on the brink of heaving its girth into an increasingly tantalising grave because you’re terrible at efficiently managing space. However, eventually, something has to give, such as when it’s time to install a new game.\n\nThe new Steam library makes it easy. In every category (or “shelf,” as Steam now calls them), there’s a range of “sort by” options, one of which is “size on disk.” You can do this for your entire library, or just in particular categories. Now go ask yourself if you’re really ever going to finish Assassin’s Creed: Odyssey, or if it’s time to say goodbye.\n\nYou have a bunch of new games now; don’t panic\n\nAfter the library update, you might find your game collection looking a little more voluminous than before. This is because Steam now displays free-to-play games you’ve played in your library, even if you don’t “own” them or they’ve been removed from the Steam store.\n\nSome Steam users may choose to wear this bigger, buffer game number as a badge of pride. However, if you don’t want your library cluttered up by games that you may never play again, you can just create a collection dedicated to free-to-play games and then, in the library’s list view, shift-click all of those games, right click, go to the “manage” tab, and click on “hide selected games.”\n\nSorting your pile of shame\n\nIf you really enjoy feeling bad about yourself, why not formalise the list of games that you feel ashamed you haven’t gotten around to playing? When creating a new collection, there’s now a category for “play state.” This includes an “unplayed” option, which will group together every game you’ve never laid a finger on, you constantly overwhelmed, guilt-ridden game goblin.\n\nToday I learned that I have exactly 666 unplayed games on Steam. “See you in hell,” I’ll tell my game collection when I’m on my deathbed. “You tell them who sent you,” it’ll reply.", "description": "Yesterday, Steam’s first big library overhaul in eons entered open beta. The fresh coat of paint and (virtual) new shelves make for welcome additions, but it’s going to take some getting used to. Then there’s the new community-centric game page display, which somewhat ironically has the community divided. Here...", "authors": ["Cecilia D'Anastasio", "Kotaku Australia"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/yi7uczivhwifxcmeolh1.jpg", "published_at": "2019-09-19"}