{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/8/lindsey-graham-warns-turkey-sanctions-hell-if-kurd", "downloaded_at": "2019-10-09 00:54:06.556588+00:00", "title": "Sen. Lindsey Graham warns Turkey of 'sanctions from hell' if Kurds attacked after U.S. pullout", "language": "en", "text": "Sen. Lindsey Graham on Tuesday vowed to impose “sanctions from hell” on Turkey if Ankara invades Syria following President Trump’s announcement that he would pull U.S. forces out of a crucial buffer zone along the border between the two nations.\n\n“If Turkey moves into northern Syria, sanctions from hell – by Congress – will follow,” the South Carolina Republican said in a tweet. “Wide, deep, and devastating sanctions,” he added.\n\nTurkey appeared to be ramping up for a sweeping military offensive against U.S.-backed Kurdish fighters in northern Syria after Mr. Trump’s surprise announcement Sunday night.\n\nMr. Graham, long a leading defender of Mr. Trump on Capitol Hill, immediately condemned the move calling it a “disaster in the making” and that it would be a “stain on America’s honor for abandoning the Kurds.”\n\nHe was joined by fellow Republicans as well as Democratic lawmakers on Capitol Hill who called on the president to reverse the decision.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Sen. Lindsey Graham on Tuesday vowed to impose \"sanctions from hell\" on Turkey if Ankara invades Syria following President Trump's announcement that he would pull U.S. forces out of a crucial buffer zone along the border between the two nations.", "authors": ["The Washington Times Http", "Lauren Meier"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/25/US_Iran_01382.jpg-17fc5_c0-0-4000-2332_s1770x1032.jpg?6fa6f1358e32f79a7430670803768e97648eaf7e", "published_at": "2019-10-08"}