{"pub": "businessinsider", "url": "https://businesstimes.com.sg/stocks/singapore-shares-drop-02-despite-positive-china-factory-data", "downloaded_at": "2019-09-30 10:50:15.138633+00:00", "title": "Singapore shares drop 0.2% despite positive China factory data", "language": "en", "text": "INVESTORS took heart to a better-than-expected August reading for China's manufacturing sector but worries over US President Donald Trump's latest trade threat meant it was a mixed start to the week for Asian equities.\n\nSingapore's Straits Times Index (STI) dropped 0.3 per cent at the open, hovering in that region for most of the session before closing 5.64 points or 0.2 per cent lower at 3,119.99 on Monday. The blue-chip index managed to eke out a 0.4 per cent gain during a turbulent September.\n\nElsewhere in the Asia-Pacific, Hong Kong and South Korea notched up gains. But Australia, China and Japan posted losses. Malaysia closed flat.\n\nWith Mr Trump's latest threat, perhaps unsurprisingly, the Shanghai Composite Index was the worst performer among the region's key benchmarks. On Monday, it ended close to a month low at 2,905.19, shedding 26.98 points or 0.9 per cent.\n\nsentifi.com Market voices on:\n\nIn Singapore, trading volume clocked in at 934.64 million securities, 78 per cent of the daily average in the first eight months of 2019. Total turnover came to S$818.34 million, 76 per cent of the January-to-August daily average.\n\nAcross the market, decliners beat advancers 239 to 160. The blue-chip index had 20 of its 30 counters in the red.\n\nWith 27.8 million shares changing hands, Singtel was the STI's most active counter. The telco's stock lost two Singapore cents or 0.6 per cent to S$3.10.\n\nThe local banks were mixed. DBS Group Holdings added S$0.10 or 0.4 per cent to S$25.00, OCBC Bank gained four Singapore cents or 0.4 per cent to S$10.86 while United Overseas Bank finished at S$25.66, down two Singapore cents or 0.1 per cent.\n\nAmong real estate investment trusts (Reits), Mapletree Commercial Trust (MCT), which was added to the STI on Sept 23, fell five Singapore cents or 2.1 per cent to S$2.29. In its first week as a benchmark constituent, MCT acquired a business park in Pasir Panjang from its sponsor for S$1.55 billion.\n\nMarket watchers noted that the deal, which increases the Reit's assets under management by 21 per cent, was widely anticipated.", "description": ": THE BUSINESS TIMES Stocks - INVESTORS took heart to a better-than-expected August reading for China's manufacturing sector but worries over US President Donald Trump's latest trade threat meant it was a mixed start to the week for Asian equities. . Read more at The Business Times.", "authors": ["Navin Sregantan"], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-09-30"}