{"pub": "news.com.au", "url": "https://news.com.au/finance/man-wins-200000-lottery-prize-on-way-to-last-cancer-treatment/news-story/c24342797334664d126f50ded8ba3c88", "downloaded_at": "2019-10-28 07:35:16.516880+00:00", "title": "US man wins lottery prize on way to final round of cancer treatment", "language": "en", "text": "Many dream of winning the lottery, but there are several methods that individuals have used in order to win. Is it coincidence or a method to the madness?\n\nThe Tricks and Hacks to Winning the Lottery\n\nA man has won a staggering $US200,000 ($A293144) lottery prize on his way to his last chemotherapy treatment.\n\nRonnie Foster, from Pink Hill, North Carolina, initially purchased a $1 ticket but only won $5. It was then when he decided to try his luck and spend his winnings on two more tickets, CNN reports.\n\nWhen he scratched the first ticket, he won nothing. But then he moved on to the next ticket.\n\n“I saw all these zeros and I froze,” Mr Foster told the North Carolina Education Lottery.\n\n“I didn’t believe it until I gave it to the clerk at the counter to scan. When it showed, ‘Go to lottery headquarters,’ I started shaking. I couldn’t believe it.”\n\nRELATED: Sydney dad wins lottery twice by ‘accident’\n\nRELATED: Conman’s epic $4.6m lottery scam\n\nRELATED: $50m Lotto winner walks off the job\n\nThe retired Department of Transportation worker is nearing the end of his treatment for colon cancer. Part of the winnings will go towards paying off some of his treatment that weren’t covered by his insurance policy. The rest of the cash will be saved “for the future”.\n\n“I was already happy because it was my last round of chemo,” said Mr Fraser. “Winning this made my lucky day.”\n\nClaiming his prize on Friday, Mr Foster took home $US141,501 ($A201,399.78) after tax.\n\nOnly last week a Sydney dad became an instant millionaire after accidentally winning two lottery jackpots with just one ticket.\n\nThe father, from Parramatta in western Sydney, took home a total prize of $1,333,333.34 from Monday and Wednesday Lotto draw 3914, which was drawn on Monday night.\n\nIn a bizarre twist, it was revealed he had scored a double division win after accidentally marking two games with the exact same winning numbers — meaning he had managed to win twice with the same ticket.\n\n“You have no idea how this has helped my family,” the man, who has chosen to stay anonymous, told a NSW Lotteries official.\n\n“I’ll be able to pay off my mortgage and I’m able to help my kids. It’s already been spent mate, but all wisely I can assure you.\n\n“It’s so much appreciated.”", "description": "A man has won a staggering $US200,000 ($A293144) lottery prize on his way to his last chemotherapy treatment.", "authors": ["Imogen Reid"], "top_image": "https://cdn.newsapi.com.au/image/v1/8b2755a49f4f1dfe3b3dbddfaa5929bb?width=650", "published_at": "2019-10-27"}