{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/man-wanted-for-allegedly-raping-child-murdering-another-finally-gets-day-in-court-20191007", "downloaded_at": "2019-10-07 20:26:24.194163+00:00", "title": "Man wanted for allegedly raping child, murdering another finally gets day in court", "language": "en", "text": "An alleged child rapist and murderer appeared in a Limpopo court on Monday after being on the run since December 2018. (iStock)\n\nAn alleged child rapist and murderer appeared briefly in the Groblersdal Magistrate's Court on Monday after being on the run since December 2018.\n\n\n\nCharles Motswathupa, 34, is facing charges of kidnapping, rape and murder.\n\nPolice spokesperson Colonel Moatshe Ngoepe said Motswathupa was denied bail and would appear again in court on October 14 for his formal bail application.\n\nThe accused had been on the run from the police after allegedly committing the offences in the Marble Hall policing area in 2018.\n\n\"On December 7, 2018, the body of Samson Sithole, 2, was found in the bushes near Koteng village with head injuries. The toddler was reported missing the previous day.\n\n\"Motswathupa was later identified as the suspect. But he disappeared after realising that the police were looking for him,\" said Ngoepe.\n\nHe was arrested on October 3 after being discharged from hospital.\n\nMotswathupa was hospitalised after he was attack by residents who had accused him of the attempted murder, kidnapping and rape of a seven-year-old girl.\n\nThe incident took place between September 30 and October 1, 2019, in the Nebo policing area outside Groblersdal.\n\n\"The suspect will also appear in the Nebo Magistrate's Court on kidnapping, rape and attempted murder charges on October 17. However, the police are also investigating if he could be linked to other cases,\" Ngoepe said.\n\n\n\n", "description": "An alleged child rapist and murderer has appeared briefly in the Groblersdal Magistrate's Court after being on the run since December 2018.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9419/a51dd3a9f7ed49b98a89484b34114a34.jpg", "published_at": "2019-10-07"}