{"pub": "yahoo", "url": "https://news.yahoo.com/jeff-bezos-elon-musk-sergey-145229132.html", "downloaded_at": "2019-09-12 11:41:11.913037+00:00", "title": "Jeff Bezos, Elon Musk, Sergey Brin, and Marissa Mayer reportedly attended an elite private dinner with Jeffrey Epstein just 2 years after he served a prison sentence for soliciting sex from a 14-year-", "language": "en", "text": "FILE PHOTO: U.S. financier Jeffrey Epstein appears in a photograph taken for the New York State Division of Criminal Justice Services' sex offender registry March 28, 2017 and obtained by Reuters July 10, 2019. New York State Division of Criminal Justice Services/Handout/File Photo via REUTERS\n\nReuters\n\n\n\n\n\nIn 2011, an elite dinner party was held during the TED Conference in Long Beach, California.\n\nAt the dinner were Amazon CEO Jeff Bezos, Tesla CEO Elon Musk, former Yahoo CEO Marissa Mayer, Google cofounder Sergey Brin, and Jeffrey Epstein, a registered sex offender.\n\nAt the time, Epstein had been out of jail for less than two years; he was convicted in 2008 of soliciting sex from a 14-year-old girl.\n\nVisit Business Insider's homepage for more stories.\n\nAmazon CEO Jeff Bezos, Google cofounder Sergey Brin, Yahoo CEO Marissa Mayer, Tesla CEO Elon Musk, and several other high-profile tech execs and celebrities reportedly attended a small, private dinner in March 2011 during the annual TED Conference in Long Beach, California.\n\nThe event, known informally as the \"billionaires' dinner,\" was also attended by the financier and registered sex offender Jeffrey Epstein, according to a new report by BuzzFeed News.\n\nIn March 2011, Epstein was less than two years out from serving a 13-month prison sentence for soliciting sex from a 14-year-old girl.\n\nFILE- In this July 30, 2008 file photo, Jeffrey Epstein appears in court in West Palm Beach, Fla. Epstein has died by suicide while awaiting trial on sex-trafficking charges, says person briefed on the matter, Saturday, Aug. 10, 2019. (AP Photo/Palm Beach Post, Uma Sanghvi, File) More\n\nAssociated Press\n\nThough photos of the 2011 dinner are still available online, Epstein isn't featured in any, nor does his name appear on the event page — but he does appear in the background of a photo of Zack Bogue, the head of Montara Capital Partners.\n\nThe dinner is held annually by the New York literary agent John Brockman and his Edge group.\n\nBrockman describes his group as representative of \"the third culture,\" which \"consists of those scientists and other thinkers in the empirical world who, through their work and expository writing, are taking the place of the traditional intellectual in rendering visible the deeper meanings of our lives, redefining who and what we are.\"\n\nAccording to the BuzzFeed News report, Brockman was a proponent of Epstein's reintroduction to elite circles following his arrest and conviction for soliciting sex from a minor.\n\nFILE PHOTO: U.S. financier Jeffrey Epstein looks on near his lawyer Martin Weinberg and Judge Richard Berman during a status hearing in his sex trafficking case, in this court sketch in New York, U.S., July 31, 2019. REUTERS/Jane Rosenberg More\n\nReuters\n\nEpstein was arrested on July 6 on suspicion of sex-trafficking minors. He was held without bail, awaiting trial on charges of sex trafficking and conspiracy to commit sex trafficking. On August 10, Epstein died by suicide at Manhattan's Metropolitan Correctional Center.\n\nIn his career as a financier, Epstein met and developed ties to some of the world's most famous names, like Bill Gates, as well as people like MIT's Marvin Minsky and LinkedIn's Reid Hoffman. In a New Yorker report published over the weekend, Gates was connected to Epstein through a donation to MIT.\n\nBut Epstein's arrest in July wasn't his first encounter with law enforcement. In 2008, Epstein was convicted of soliciting sex from a 14-year-old girl, and federal agents originally sought to connect him to the sexual abuse of nearly 40 girls. He served 13 months in a Florida jail before being released on probation.", "description": "The private dinners, known informally as the \"billionaires' dinners,\" are held by the New York literary agent John Brockman.", "authors": ["Ben Gilbert"], "top_image": "https://s.yimg.com/uu/api/res/1.2/.cOAOkmkKMHaqXduWQ4WBg--~B/aD0xNjAwO3c9MjQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/business_insider_articles_888/4eb5023ca0bcba8554be362420c6de60", "published_at": "2019-09-10"}