{"pub": "yahoo", "url": "https://finance.yahoo.com/news/producer-price-index-levi-strauss-earnings-what-to-know-in-markets-tuesday-215420404.html", "downloaded_at": "2019-10-07 23:33:58.650490+00:00", "title": "Producer price index, Levi Strauss earnings – What to know in markets Tuesday", "language": "en", "text": "Investors on Tuesday will receive a print on producer prices changes and quarterly results from two familiar consumer-facing companies.\n\nConsensus economists expect producer prices rose 0.1% from August to September, matching the pace from the month prior, according to Bloomberg-compiled estimates. Over last year, the Bureau of Labor Statistics’s producer price index (PPI) is expected to have risen 1.8%, also matching August’s pace.\n\nThe “core” PPI, which excludes typically more volatile food and energy prices, is anticipated to have risen 0.2% on a monthly basis, with price increases decelerating slightly from August’s 0.3% pace. Over last year, core PPI is expected to have risen 2.3%.\n\nThe September PPI comes two days before the release of the consumer price index (CPI), which tracks changes in prices of consumer goods. While the PPI has not always been a perfect indicator of CPI results, over the course of this year, producer price fluctuations on both the headline and core prints have closely mirrored those in consumer price changes. The core CPI and PPI each rose by 0.3% on a monthly basis August, and headline CPI and PPI each rose by 0.1% for the month.\n\nThe report on changes in producer prices also follows the Institute of Supply Management’s report last week that found U.S. manufacturing activity fell to the weakest level in a decade in September. The report presages a potentially weaker-than-expected increase in producer prices, which are apt to be influenced by trade uncertainty and other macroeconomic factors that have also weighed on the manufacturing sector as a whole.\n\n“Producer prices are more sensitive to swings in the business cycle ... particularly in manufacturing and construction,” Wells Fargo Securities analysts wrote in a note Friday. “The trade war has influenced the data, as prices for materials and inputs that compete with imports have been pulled higher. We suspect that the weakness in the manufacturing sector may cause producer prices to come in slightly below expectations.”\n\nNeither headline nor core PPI serves as the Federal Reserve’s preferred measure of underlying inflation in the U.S. economy, with that designation reserved for the core personal consumptions expenditures (PCE) price index. However, the PPI – and especially the core PPI stripped of more variable categories – provides another snapshot of price trends in the domestic economy, against a backdrop of still-muted inflation signals.\n\nDomino’s, Levi Strauss report results\n\nMeanwhile, Domino’s Pizza (DPZ) and retailer Levi Strauss (LEVI) will each report quarterly earnings results Tuesday.\n\nDomino’s is expected to report adjusted earnings of $2.07 per share on revenue of $823.1 million, according to Bloomberg consensus data. Earnings are expected before market open Tuesday.\n\nThe pizza chain has struggled to meet the Street’s sales expectations amid rising competitive pressure in the fast food space, and especially as delivery aggregators including Doordash, UberEats (UBER), Postmates and Grubhub (GRUB) flood consumers with a bevy of on-demand options. Domino’s domestic same-store sales, a closely watched metric for restaurants, have decelerated for the past five consecutive quarters.\n\nShares of Domino’s have fallen more than 2% during the year-to-date, underperforming against a 17.2% gain in the S&P 500.\n\nDenim-maker Levi Strauss is also set to report earnings results Tuesday after market close, in its third quarterly report since returning to the public markets in March.\n\nThe San Francisco, California-based retailer is expected to report adjusted earnings of 28 cents on revenue of $1.44 billion for its fiscal third quarter, according to Bloomberg-compiled estimates.\n\nLevi Strauss has progressively been branching out of its legacy business of selling jeans into other clothing categories including tops, a category which grew by 37% during the last full fiscal year.\n\nJeans trousers are displayed at a Levi Strauss store in New York, U.S., March 19, 2019. REUTERS/Shannon Stapleton More", "description": "Investors on Tuesday will receive a print tracking changes in producer prices, and quarterly results from two familiar consumer brands as third-quarter earnings season picks up.", "authors": ["Emily Mccormick"], "top_image": "https://s.yimg.com/uu/api/res/1.2/wxlXza_qo.S0LinpF6Uetw--~B/aD0zOTU4O3c9NTkzNztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/48b2a630-e94a-11e9-8fbf-bc52832ad5f3", "published_at": "2019-10-07"}