{"pub": "yahoo", "url": "https://finance.yahoo.com/news/think-blue-financial-communication-bit-083928283.html", "downloaded_at": "2019-09-15 23:15:33.568769+00:00", "title": "We Think Blue Financial Communication (BIT:BLUE) Is Taking Some Risk With Its Debt", "language": "en", "text": "David Iben put it well when he said, 'Volatility is not a risk we care about. What we care about is avoiding the permanent loss of capital.' When we think about how risky a company is, we always like to look at its use of debt, since debt overload can lead to ruin. We note that Blue Financial Communication S.p.A. (BIT:BLUE) does have debt on its balance sheet. But is this debt a concern to shareholders?\n\nWhy Does Debt Bring Risk?\n\nDebt is a tool to help businesses grow, but if a business is incapable of paying off its lenders, then it exists at their mercy. In the worst case scenario, a company can go bankrupt if it cannot pay its creditors. However, a more frequent (but still costly) occurrence is where a company must issue shares at bargain-basement prices, permanently diluting shareholders, just to shore up its balance sheet. Of course, the upside of debt is that it often represents cheap capital, especially when it replaces dilution in a company with the ability to reinvest at high rates of return. The first step when considering a company's debt levels is to consider its cash and debt together.\n\nView our latest analysis for Blue Financial Communication\n\nHow Much Debt Does Blue Financial Communication Carry?\n\nYou can click the graphic below for the historical numbers, but it shows that as of December 2018 Blue Financial Communication had €1.10m of debt, an increase on €775.8k, over one year. However, because it has a cash reserve of €755.7k, its net debt is less, at about €344.3k.\n\nBIT:BLUE Historical Debt, September 15th 2019 More\n\nHow Strong Is Blue Financial Communication's Balance Sheet?\n\nAccording to the last reported balance sheet, Blue Financial Communication had liabilities of €1.34m due within 12 months, and liabilities of €1.14m due beyond 12 months. Offsetting these obligations, it had cash of €755.7k as well as receivables valued at €1.54m due within 12 months. So its liabilities outweigh the sum of its cash and (near-term) receivables by €189.6k.\n\nGiven Blue Financial Communication has a market capitalization of €3.56m, it's hard to believe these liabilities pose much threat. But there are sufficient liabilities that we would certainly recommend shareholders continue to monitor the balance sheet, going forward.\n\nWe use two main ratios to inform us about debt levels relative to earnings. The first is net debt divided by earnings before interest, tax, depreciation, and amortization (EBITDA), while the second is how many times its earnings before interest and tax (EBIT) covers its interest expense (or its interest cover, for short). The advantage of this approach is that we take into account both the absolute quantum of debt (with net debt to EBITDA) and the actual interest expenses associated with that debt (with its interest cover ratio).\n\nLooking at its net debt to EBITDA of 0.54 and interest cover of 4.7 times, it seems to us that Blue Financial Communication is probably using debt in a pretty reasonable way. But the interest payments are certainly sufficient to have us thinking about how affordable its debt is. Notably, Blue Financial Communication made a loss at the EBIT level, last year, but improved that to positive EBIT of €103k in the last twelve months. The balance sheet is clearly the area to focus on when you are analysing debt. But ultimately the future profitability of the business will decide if Blue Financial Communication can strengthen its balance sheet over time. So if you want to see what the professionals think, you might find this free report on analyst profit forecasts to be interesting.\n\nStory continues", "description": "David Iben put it well when he said, 'Volatility is not a risk we care about. What we care about is avoiding the...", "authors": ["Simply Wall St"], "top_image": "https://s.yimg.com/uu/api/res/1.2/0VvE.goZPNdoRRqwLWITlA--~B/aD00MzI7dz0xMTk0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/simply_wall_st__316/bd67ee3dd0698e90aea0348dd5cf039e", "published_at": "2019-09-15"}