{"pub": "japantoday", "url": "https://japantoday.com/category/features/kuchikomi/tokyo-olympic-ticket-scalpers-raking-in-big-profits", "downloaded_at": "2019-10-05 13:06:02.708426+00:00", "title": "Tokyo Olympic ticket scalpers raking in big profits", "language": "en", "text": "\"I've already resold all 80 of the tickets to 2020 Olympic events obtained through the first offering. I made over 10 million yen. For example, in the men's soccer final -- which is in especially high demand -- I paid 67,500 yen for a seat in the \"A\" section, and resold it for 600,000 yen. That's a good way to make money.\"\n\nThe speaker, a Chinese identified only as Mr Z, boasts to Friday (Oct 11) about his recent wheelings and dealings in the Olympic ticket market.\n\nLast May, the first round of sales of admission tickets to events offered some 3.9 million tickets to buyers inside Japan. These were promptly snatched up. The demand for high-profile events in particular proved so high that it was virtually impossible to gain access to the online application sites.\n\nBut another reason for the difficulty in obtaining desirable \"platinum tickets\" was the large presence of illegal resellers. Friday's reporter tracked down Mr Z via an SNS and the latter agreed to meet and discuss his operations.\n\n\"It wasn't difficult,\" Z told him. \"My outfit employs some 400 Chinese in Japan who work as narabiya (literally, stand-in-liners). Before the first ticket offering, I contacted them via a group chat app and told them I'd buy anything they could get their hands on. I wound up with 80 tickets.\"\n\nAccording to Z, Chinese residing in Japan were eligible for the offerings, and he paid them double the face value of each ticket. Then via SNSs, or various flea market or auction sites, he resold them for 5 to 10 times what he initially paid.\n\n\"Soccer, basketball, table tennis, volleyball and swimming were in particularly high demand,\" he relates. \"Most of the buyers were wealthy people. We've got plenty of them in China these days.\"\n\nAs a precaution, entry to the events will only be allowed to people who had registered their names when purchasing tickets. But Z figured out a loophole.\n\n\"That won't be a problem, because up to the day of any particular event, the names can be changed any number of times,\" Z explains. \"When the purchaser first transfers money to pay for the tickets, they are issued an ID and password. The purchaser can log into the sales site and easily change his name. Likewise for the registered email address and password. Once that's done, nobody else can interfere.\"\n\nAs impressive the number of narabiya working for Z may appear, he tells Friday he believes his group of 400 is only medium-sized.\n\n\"Along with groups, there are also any number of people who resell tickets as individuals,\" he tells the reporter. \"Out of the 3.9 million tickets sold at the first offering, I suppose maybe 200,000 to 300,000 were snatched up by Chinese.\"\n\nWhile resale of Olympic tickets via SNSs or commercial sites is strictly prohibited, enforcement in China is essentially nonexistent.\n\n\"Are you working for the organizers?\" the Chinese woman, who appeared to be in her 30s, asked Friday's reporter suspiciously.\n\nAfter being assured he was not, she relaxed and told him she was originally from Shanghai, had been in Japan for eight years, and in addition to her regular job for a real estate agency, moonlighted as a reseller.\n\n\"Quite a few of my friends applied for tickets. One really lucked out and got one to the opening ceremony. But several have already cleared over 1 million yen so far,\" she claimed.\n\nA 3-night, 4-day tour package from China, including air tickets, hotel accommodations and front-row seats at events like table tennis and diving, is currently said to be going for as much 45,800 Chinese yuan (690,000 Japanese yen).\n\n© Japan Today", "description": "\"I've already resold all 80 of the tickets to 2020 Olympic events obtained through the first offering. I made over 10 million yen. For example, in the men's soccer final -- which is in especially high demand -- I paid 67,500 yen for a seat in the \"A\" section, and…", "authors": ["Japan Today", "Ncis Reruns"], "top_image": "https://japantoday.com/images/japan-today-social.jpg", "published_at": "2019-10-04"}