{"pub": "marketwatch", "url": "https://marketwatch.com/story/gm-strike-talks-stall-as-union-wants-commitment-to-build-cars-in-us-2019-10-08", "downloaded_at": "2019-10-09 02:08:07.245769+00:00", "title": "GM strike talks stall as union wants commitment to build cars in U.S.", "language": "en", "text": "DETROIT — Talks between General Motors and the United Auto Workers union hit a snag Tuesday over what the union says is a lack of commitment by GM to build new vehicles in U.S. factories.\n\nIn a letter to members, union Vice President Terry Dittes wrote that the union has told GM that it doesn’t see a commitment from the company to a workforce that has helped make it billions of dollars.\n\n“We believe that the vehicles GM sells here should be built here,” Dittes wrote. “There is no job security for us when GM vehicles are made in other countries for the purpose of selling them here in the U.S.A.”\n\nGM GM, -2.50% did not immediately respond to a request for comment Tuesday night.\n\nAlthough both sides were still at the bargaining table, the union demand could be a major sticking point because GM produces pickup trucks and several SUVs in Canada, Mexico, China, South Korea and other countries, and imports them to the U.S.\n\nDittes wrote that GM’s alleged lack of commitment is one of the union’s top priorities in talks to end the strike, but little progress has been made.\n\n“Economic gains in this agreement will mean nothing without job security,” Dittes wrote, adding that the union is fighting for a middle class way of life.\n\nOn Sunday, the union voiced concerns about GM increasing production in Mexico, where it now builds pickup trucks, small cars and two SUVs. GM leads all companies in automobiles produced in Mexico at just over 833,000 last year, according to LMC and the Center for Automotive Research, a think-tank based in Ann Arbor, Michigan. Of GM vehicles sold in the U.S., 22% are produced in Mexico.\n\nThe strike by 49,000 workers, now in its 23rd day, began Sept. 16, and immediately shut down all of GM’s U.S. factories. Later two factories in Canada and Mexico were forced to close due to a lack of parts.\n\nThe strike has cost the company production of 165,000 cars and trucks and has passed the point where the GM can make up lost volume, according to auto industry analysts.\n\nThat means losses are starting to mount for the company even though its dealers have enough inventory to get by for several more weeks.\n\nTalks also were hung up on hourly wage increases versus lump-sum payments favored by the company, according to a person briefed on the talks. They’re also haggling over pensions, faster wage increases for workers hired after 2007, and guarantees of new products for U.S. factories, said the person, who didn’t want to be identified because the talks are confidential.\n\nFifteen of GM’s 18 North American assembly plants have been shut down by the strike, including everything in the U.S. and one plant each in Mexico and Canada, according to Bill Rinna, director of Americas Vehicle Forecasts for the LMC Automotive consulting firm.\n\n“Once the strike ends, it may still take up to a week to get the parts pipeline going again. So we are likely looking at a loss of well over 200,000 vehicles,” Rinna wrote in a note distributed Tuesday.\n\nMuch of that production can’t be made up, especially at factories that make popular pickup trucks and large SUVs that already were on three shifts per day before the strike, said Kristin Dziczek, vice president of the Center for Automotive Research, an industry think tank.\n\nThe strike has cost GM about $1.6 billion according to numbers from JP Morgan analyst Ryan Brinkman, who estimates that GM is losing $82 million per day.\n\nStrikers, meanwhile, are in their fourth week without earning a full paycheck from GM of around $1,200 per week before deductions. Instead they have to live on $250 per week in union strike pay.\n\nThe Anderson Economic Group, a consulting firm in East Lansing, Michigan, estimated that 75,000 workers for auto parts supply companies have either been laid off or had their wages reduced because GM factories no longer need the parts. The firm predicts that the impact will expand each day that GM’s factories are silent.\n\nThe strike also has delayed production of the new mid-engine Chevrolet Corvette sports car, which was supposed to start in December, Rinna wrote. GM’s Corvette plant in Bowling Green, Kentucky, had about 1,000 of the current-generation Corvettes left to build before the strike. Then the plant was to switch its equipment over to build the new version. Now, Rinna wrote, GM will either have to delay the new car’s launch or retool the plant faster.\n\n“Either option could cost GM dearly,” he wrote.", "description": "Talks between General Motors and the United Auto Workers union hit a snag Tuesday over what the union says is a lack of commitment by GM to build new...", "authors": ["Associated Press"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS532_gmstri_ZG_20191002191654.jpg", "published_at": "2019-10-08"}