{"pub": "news24", "url": "https://parent24.com/Pregnant/Birth/definitely-not-the-easy-way-out-one-reader-shares-how-she-came-to-respect-the-caesarian-after-a-traumatic-birth-experience-20191021", "downloaded_at": "2019-10-21 10:30:14.834489+00:00", "title": "'Definitely not the easy way out!' - One reader shares how she came to respect the Caesarian after a traumatic birth experience", "language": "en", "text": "'Definitely not the easy way out!' - One reader shares how she came to respect the Caesarian after a traumatic birth experience\n\nAt 37 weeks, I had to deliver my son via C-section! I was mortified! This was not the birthing plan I had intended to experience. I felt like a failure, a real big loser that I had not gone natural!\"\n\nIt seems society leaves no stone unturned in judging women, even when it comes to birthing options.\n\nFinding common ground with the experience of one Parent24 reader who shared that her mother had nearly died during labour if it weren't for a C-Section delivery, Yolo P wrote in to share a similar experience.\n\n\n\nHere she writes about the life-threatening birth experience that turned her from Caesarean critic to believer.\n\n'Let the baby decide!'\n\nI must ashamedly admit that I was one of those people that thought a C-Section was 'unnatural' or at least an easy way out for women that liked the idea of being pregnant but didn't want to put in the 'work'.\n\nWhat did I know considering I had never been pregnant and knew nothing about pregnancy/birth!\n\nBoy, was I wrong! When I fell pregnant with my first son in 2012, I was determined to give birth naturally!\n\nI spent hours on YouTube watching videos on natural births (unfortunately my husband did not share my enthusiasm) and knew all about the 'Ring of Fire' (the burning sensation between the vagina and rectum as the baby pushes down the birth canal).\n\nNo 'Ring of Fire' was going to stop me from going au natural with NO pain medication. I did pelvic exercises almost daily and bought a perineum massage cream to, well, stretch myself.\n\nI was thankful that my OBGYN seemed to be pro-natural as he had not brought up my birthing plan at 6.5 months and every time I would broach the subject of a C-section, he would just buff me off and say \"Let the baby decide!\"\n\nAt about 7 months, I started to display symptoms of pre-eclampsia, and I discovered my son was breech. Just great!\n\n'I felt like a failure that I had not gone natural'\n\nI was hospitalised for 2 days and after being discharged, had to start going into the maternity ward to be monitored on a weekly basis.\n\nAt 37 weeks, I had to deliver my son via C-section! I was mortified! This was not the birthing plan I had intended to experience. I felt like a failure, a real big loser that I had not gone natural! But that feeling evaporated as I soon discovered that a C-Section is no walk in the park and definitely not the easy way out!\n\nI was in excruciating pain way past the 6 week recovery period, struggled to get myself up from a lying down position and literally had to roll myself off beds/couches (the landing on the floor often not elegant).\n\nI struggled to walk upright for almost a month, bled quite heavily for 2 weeks post-birth and found the whole process of sticking suppositories up my bum traumatising.\n\n'Wanted to shove more than a suppository up her you know what'\n\nI couldn't let out a belly-gut laugh for 3 weeks and wasn't allowed to drive. The \"breast-feeding/I went natural\" mommy nazi's had quite a dig at me though...one even commented that I didn't deserve a 'push present' because I didn't push (boy, did I want to shove more than a suppository up her you know what).\n\nSomething quite strange also happened to my lower stomach- it had this numb sensation for almost 2 years after the C-section.\n\nNeedless to say, when I fell pregnant with my second son, I was determined to \"do it right\" this time! I did my research and learnt all about the V-BAC!\n\nYep, thats what I was going to do! So the whole process of pelvic exercises and the perineum massage picked up where it had left off with my first son but more intensified.\n\nI was not going to 'fail' at this giving birth naturally thing!\n\nLife and death situation\n\nWell, as fate would have it, I missed out on giving birth naturally the second time around, too. But this time, my baby and I were in a life and death situation.\n\nMy son had ruptured my uterus (pain level-think of someone putting a saw to your stomach and sawing it open) and had to be delivered at 7 months.\n\nHad I arrived at the hospital 5 minutes later and not undergone a C-Section, both our lives would have been lost.\n\n'I salute all women that have carried and delivered life into this world'\n\n'What do I think of C-sections now?'\n\nI would still prefer to go the natural route cause of the benefits that have been touted for babies immune systems as they pass through the birth canal and the shorter recovery process.\n\nAnd I am convinced women that give natural birth have a less pronounced FUPA (Fat Upper Pubic Area).\n\nBut I definitely will never judge another woman for having a C-Section nor will I ever think women have taken the easy way out.\n\nMore often than not, there is a story of a difficult pregnancy and birthing experience behind that scar on a woman's stomach.\n\nGiving birth in whatever manner is no small feat, and I salute all women that have carried and delivered life into this world.\n\nRegards,\n\nYolo P.\n\nChat back:\n\nShare your story with us, and we could publish your mail. Anonymous contributions are welcome.\n\nRead more:", "description": "At 37 weeks, I had to deliver my son via C-section! I was mortified! This was not the birthing plan I had intended to experience. I felt like a failure, a real big loser that I had not gone natural!\"", "authors": [], "top_image": "http://graph.facebook.com/61997583714/picture", "published_at": "2019-10-21"}