{"pub": "cbc", "url": "https://cbc.ca/news/world/california-wildfires-santa-ana-winds-1.5340624", "downloaded_at": "2019-10-30 23:22:36.017722+00:00", "title": "New wildfire breaks out in wind-whipped Southern California | CBC News", "language": "en", "text": "A new wildfire erupted Wednesday in wind-whipped Southern California, forcing the evacuation of the Ronald Reagan Presidential Library and nearby homes, as both ends of the state struggled with flames, dangerously gusty weather and deliberate blackouts.\n\nDriven by powerful Santa Ana winds, the brush fire — now being referred to as the Easy Fire — broke out before dawn between the cities of Simi Valley and Moorpark north of Los Angeles and exploded to more than 526 hectares, Ventura County officials said.\n\nWednesday afternoon, Sheriff Bill Ayub confirmed 7,000 homes were evacuated as a result of the new fire, putting 26,000 people out of their homes.\n\nThe extraordinarily dry and prolonged winds are predicted to gust through Wednesday, prompting strong warnings from meteorologists as residents contend with damaging wildfires.\n\nIt was a daunting forecast for firefighters battling a 240-hectare blaze consuming the shrub-covered hills near the Getty Center museum in Los Angeles that has displaced thousands of residents.\n\nThe U.S. National Weather Service issued an \"extreme red flag\" warning for wildfires in Los Angeles and Ventura counties.\n\n\"I don't know if I've ever seen us use this warning,\" said forecaster Marc Chenard. \"It's pretty bad.\"\n\nWatch: People flee fast approaching flames, some trying to save their horses\n\nThe Easy Fire was sparked early Wednesday morning in the hills of Ventura County, with crews struggling to contain the flames as ranchers tried to wrangle horses that got loose in the area. 0:51\n\nLibrary spokesperson Melissa Giller said around midmorning that the hilltop museum in Simi Valley was not damaged. She said that the flames came within about 30 metres of the property but that it was protected by aircraft dropping water and by a firebreak, or a buffer zone cleared of brush.\n\nHundreds of goats are brought in each year to eat away vegetation that could fuel wildfires on the 120-hectare grounds, Giller said. Reagan and his wife, Nancy, are buried next to each other on a hillside at the library.\n\nStatewide, the weather service issued warnings of dangerous fire weather conditions covering more than 88,000 square km, encompassing some 21 million people. Scientists have linked an increase in frequency and intensity of wildfires to climate change.\n\nThe Santa Ana winds are a regional weather phenomenon that sends gusts westward off the desert out to the Southern California coast. They are forecast to reach sustained speeds of 80 to 110 km/h on Wednesday and Thursday, raising the risk of sparks and embers being whipped into fresh wildfires in unburned areas.\n\nLos Angeles Fire Chief Ralph Terrazas said extremely high winds could also force the grounding of water-dropping helicopters, a vital component of the firefighting arsenal.\n\nFire officials are worried that strong winds will whip up embers like these in Calistoga, Calif. (Noah Berger/The Associated Press)\n\nCity arson investigators say the Getty fire was likely caused by a broken tree branch being blown into power lines during high winds on Monday morning.\n\nElectricity remained cut off to roughly half a million homes and businesses in Northern and Central California on Tuesday as a precaution by the state's largest utility.\n\nGov. Gavin Newsom has accused utilities of failing to adequately modernize and safely maintain their power systems.\n\nGaining ground\n\nAn army of some 1,100 firefighters battled the Getty fire Tuesday in a narrow window of slower winds. By early Wednesday, crews had managed to contain about 15 per cent of the blaze.\n\nIn Northern California, where firefighters struggled for a sixth day against a 30,760-hectare blaze in Sonoma County's winemaking region, high-wind forecasts prompted Pacific Gas and Electric (PG&E) to impose a new round of blackouts for nearly 600,000 homes and businesses.\n\nWATCH: See what one part of California looked like Tuesday after the Kincade fire hit\n\nThe largest of the wildfires burning in California is the Kincade Fire, which has displaced thousands of people. The National is on the ground in Northern California to view the devastation first hand with some residents. 2:16\n\nThat included about 400,000 customers blacked out in a power shutoff that PG&E instituted days earlier, the company said.\n\nEarly Wednesday, PG&E announced that it had restored about 73 per cent of the 970,000 or so customers affected in earlier shutoffs.\n\nUtilities serving Southern California's more highly urbanized areas have imposed smaller-scale outages.\n\nPG&E has been implicated in the Sonoma County blaze, dubbed the Kincade fire. The utility acknowledged last week that the Kincade fire broke out near a damaged PG&E transmission tower at about the time a live high-voltage line carried by that tower malfunctioned.\n\nCrews have made some progress in their fight to contain the Getty Fire, seen here on Monday. The fire is burning along the 405 freeway north of Los Angeles. (Gene Blevins/Reuters)\n\nThe company filed for bankruptcy in January, citing $30 billion in potential liability from a series of deadly fires sparked by its equipment in 2017 and 2018.\n\nCiting progress made against the Kincade fire, Newsom said the number of evacuees in Northern California had diminished from 190,000 at the peak of that blaze to 130,000 on Tuesday.\n\nProperty losses from the Kincade, listed at 15 per cent contained, were put at 189 homes and other structures, double Monday's tally.\n\nThe size of the Getty fire's evacuation zone was reduced by roughly 3,000 homes on Tuesday but residents of about 7,000 homes remained displaced, fire officials said. At least a dozen homes have been destroyed so far.\n\nWATCH: See some of the damage caused by the Getty Fire", "description": "Extraordinarily dry, prolonged Santa Ana winds were predicted to gust through Southern California on Wednesday, prompting strong warnings from meteorologists as residents contend with damaging wildfires.", "authors": ["Thomson Reuters"], "top_image": "https://i.cbc.ca/1.5341381.1572460372!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/california-wildfires-blackout.jpg", "published_at": "2019-10-30"}