{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/outstanding-reports-delay-sentencing-in-ekurhuleni-city-council-tender-case-20190731", "downloaded_at": "2019-10-26 00:04:10.077449+00:00", "title": "Outstanding reports delay sentencing in Ekurhuleni city council tender case", "language": "en", "text": "The completion of a pre-sentencing report in the corruption case involving two former Ekurhuleni city council officials has resulted in sentencing proceedings coming to a halt.\n\n\n\nVelero David, who owns Meropa Sechabeng Technology, former executive director of the City's ICT department, Nilesh Singh and Andrew Mphushomadi, the City's former chief IT architect, appeared in the Commercial Crimes Court in Pretoria on Wednesday.\n\nThis after they, along with two companies owned by David and Mphushomadi, were convicted in May for corruption, money laundering and defrauding the municipality of R21.8m in 2007.\n\nMphushomadi and Singh had worked for the City at the time the crimes were committed.\n\nNews24 previously reported that the Hawks had investigated the matter following the awarding of the tender which was meant to supply and maintain computers in the municipality.\n\nThe tender was issued to Meropa Sechabeng Technology CC, which had barely been in existence for 10 months with the sole member being David at the time.\n\nALSO READ: Three people including former Ekurhuleni officials convicted of defrauding municipality\n\nDuring the bidding process, David had declared that he had no relationship with people in the service of the state, or anyone who may be involved in the evaluation and adjudication of the bid.\n\nHowever, it later became known that David was related through marriage to Nilesh Singh, the Hawks said.\n\nSingh is said to have been instrumental in the awarding of the tender.\n\nMphushomadi, who is a member of Nanga Transport CC, was also involved in the specifications of the said tender.\n\nNanga Transport purchased a number of Mercedes-Benz trucks costing close to R4m, and was paid for it by Meropa Sechaba, using the money which the municipality paid for the tender.\n\nSentencing proceedings were postponed to October 25.", "description": "The completion of a pre-sentencing report in the corruption case involving two former Ekurhuleni city council officials has resulted in sentencing proceedings being delayed.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/5132/f19d3c1d0b654753831dd178dbdf0df1.jpg", "published_at": "2019-07-31"}