{"pub": "euronews", "url": "https://euronews.com/2018/10/23/khashoggi-s-killing-turkey-s-timeline-on-saudi-s-slaying", "downloaded_at": "2019-10-20 08:17:50.504713+00:00", "title": "Khashoggi's killing: Turkey's timeline on Saudi's slaying", "language": "en", "text": "This is the timeline of the murder of Saudi journalist and Riyadh critic Jamal Khashoggi, according to Turkey’s president, Recep Tayyip Erdogan.\n\nIn a speech to parliament — the highlights of which you can watch in the video player, above — he sent his condolences to Khashoggi’s family and called for those those responsible to be brought to justice.\n\nErdogan said the information and evidence suggests Khashoggi was “slain in a vicious and violent murder”.\n\n\"There are, indeed, strong signs that the incident was not a momentary result of something that broke out on site, but rather the result of a planned operation.\"\n\nThis is how Erdogan says the operation panned out:\n\nFriday, September 28 | 11h50: Khashoggi goes to the Saudi consulate in Istanbul for marriage-related reasons. Erdogan says this information was then passed to the people who planned and executed his murder.\n\nMonday, October 1 | 16h30: A team of three arrive in Istanbul on a scheduled flight and go to the city’s Saudi consulate via their hotel. In the meantime, another team goes from the consulate to Belgrade Forest on the edge of Istanbul.\n\nTuesday, October 2 | 1h45: Another team of three take a scheduled flight to Istanbul, although it is not specified where from. A third team, of nine people, including generals, arrive in the city via a private flight.\n\nTuesday, October 2 | 9h50: The three teams, totalling 15 Saudis, begin arriving at the kingdom’s consulate in Istanbul. The first thing they do is remove the hard disk of the consulate’s security camera.\n\nTuesday, October 2 | 11h50: The consulate calls Khashoggi to confirm his appointment.\n\nTuesday, October 2 | 13h08: Khashoggi enters the consulate.\n\nTuesday, October 2 | 17h15: Khashoggi’s fiancée goes to authorities and tells them he is being held against his will at the consulate. She fears something bad might have happened to him.\n\nTurkish authorities begin investigating and it becomes clear that Khashoggi did not leave the consulate building.\n\nErdogan says no concrete steps were taken at this stage because officials at the consulate “have diplomatic immunity”.\n\nNevertheless a probe begins and acting prosecutor is appointed.\n\nAt some as-yet unspecified point earlier in the day, “other staff and residents” at the consulate are told to leave.\n\nTuesday, October 2 | 18h20: Six of the team leave on a private flight (Erdogan doesn’t specify where to)\n\nTuesday, October 2 | 22h50: Another seven of the team leave on another private flight.\n\nWednesday, October 3: Another individual, disguised as Khashoggi and with an accomplice, leave in the early hours on a scheduled flight to the Saudi capital, Riyadh.\n\nOctober 4: Saudi Arabia rejects claims that Khashoggi was killed at its consulate in Istanbul.\n\nOctober 6: A correspondent from the news agency Reuters is invited inside the consulate.\n\nOctober 11: A group of special representatives from Saudi Arabia arrive in Turkey and allow the consulate to be searched.\n\nOctober 14: Erdogan speaks to Saudi Arabia’s king by telephone and they agree to set up a joint investigative group. Turkey’s president complains about the consulate’s “insufficient and incompetent” response.\n\nOctober 15: The consular general is removed from his position but may have already left the country by this point.\n\nOctober 19: Nearly three weeks after his disappearance, Saudi Arabia for the first time admits Khashoggi was murdered inside the consular building. The statement says he died after the eruption of a brawl.\n\nErdogan again speaks to Saudi Arabia’s king, who informs him 18 people have been arrested.\n\nIt is the same 15 individuals identified by Turkish authorities, plus a further three consular officials.\n\nOctober 21: Erdogan speaks to US President Donald Trump and the pair agree that clarification about what happened is needed.", "description": "This is the timeline of the murder of Saudi journalist and Riyadh critic Jamal Khashoggi, according to Turkey’s president, Tayyip Erdogan.", "authors": ["Chris Harris"], "top_image": "https://static.euronews.com/articles/stories/03/39/48/46/1000x563_cmsv2_33d79b27-df49-55b8-8209-60fe83f88b45-3394846.jpg", "published_at": "2018-10-23"}