{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7595253/Holly-Daze-Coffeys-boyfriend-holds-chest-racy-beachside-photos.html", "downloaded_at": "2019-10-21 06:43:15.907736+00:00", "title": "Holly-Daze Coffey's boyfriend holds her chest in racy beachside photos", "language": "en", "text": "There's no denying surfer Holly-Daze Coffey has a very hands-on partner.\n\nOn Monday, the Instagram model shared a series of racy beach photos with her boyfriend Jesse Weaver.\n\nJesse stood behind the 21-year-old with his hands holding Holly's chest as she posed in a barely-there neon swimsuit.\n\n'Thought you were about surfing?' Holly-Daze Coffey raises eyebrows for posing in racy beachside photos with her boyfriend groping her chest\n\nHolly left little to the imagination in the ultra high-cut swimsuit that exposed her torso's side, derriere and cleavage.\n\nHer heavily-tattooed long-term boyfriend Jesse's Instagram account is filled almost exclusively with photos of himself groping, clasping and spanking her body.\n\n'When your BF is mad insecure so your posts have to include him,' one fan wrote, as another said it was 'not very appealing'.\n\nOthers simply asked: 'Thought you were about surfing?'\n\nHe's hands on! Her heavily-tattooed long-term boyfriend Jesse's Instagram account is filled almost exclusively with photos of himself groping, clasping and spanking her body\n\nHolly is a model and surfer who got her big break in 2011 after winning the 2011 ASR Australian Junior Surfing Title.\n\nHer curvy figure and Instagram fame has resulted in some major sponsorship deals, including with Billabong and Von Zipper.\n\nThe blonde bombshell has almost one million followers on the photo-sharing app, with fans claiming she has 'the best behind' they've ever seen.\n\nWhat a charmer! Jesse isn't just Holly's boyfriend, he's also her biggest fan\n\nHolly and her sisters Ellie-Jean, 24, Ruby-Lee, 19, and Bonnie-Lou, 16, are all professional surfers and Instagram models.\n\nThey've been nicknamed 'the Australian Kardashians' in the press, a comparison the family enthusiastically welcomes.\n\nWe don't mind being called the \"Aussie Kardashians of the surfing world\" because we see the resemblance,' Ellie-Jean told The New Daily in 2017.\n\nThe family attempted to pitch their own Kardashians-inspired reality show two years ago, but it never came to fruition.", "description": "There's no denying surfer Holly-Daze Coffey has a very hands-on partner.", "authors": ["Daily Mail Australia Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/06/19977564-0-image-a-6_1571636230169.jpg", "published_at": "2019-10-21"}