{"pub": "americanconservative", "url": "https://theamericanconservative.com/articles/beware-the-global-do-gooder-democrats", "downloaded_at": "2019-10-05 13:33:49.636492+00:00", "title": "Beware the Global Do-Gooder Democrats", "language": "en", "text": "How can the United States be a force for good in the world? It’s a question that should be asked and debated in the corridors of Washington, D.C., but rarely is, at least not in any serious way. Instead, the managerial elite who run the city and its far-flung overseas holdings decided long ago that the best way to solve the world’s problems was with military intervention.\n\nThis bellicose form of humanitarianism has grown in popularity over the past two decades, as atrocities are now broadcast into the palms of our hands. Self-appointed do-gooders say the U.S. should use its military to stop bad things from happening. It’s our duty to make a difference.\n\nThey’re wrong.\n\nEarlier this month, speaking at the Council on Foreign Relations, Democratic Senator Chris Murphy described his vision of a new “progressive” foreign policy for the Democratic Party. It puts humanitarianism in the form of democracy promotion at its forefront.\n\nAdvertisement\n\n“I think we should connect our domestic progressive priorities to the fights that we have abroad. We need to understand that if you’re fighting with democracy here, if you’re fighting for human rights here, you have to be engaged globally on these issues,” the Connecticut senator said.\n\nWhile not explicitly endorsing any military interventions, Murphy advocated support for government propaganda outlets that broadcast “pro-democracy” messages to adversarial countries to sow unrest and instability. We know from experience how this easily can lead to U.S. military “assistance.”\n\n“Promoting democracy abroad is an interest,” Murphy said. “It’s not just a fuzzy value that Americans have, it’s an interest.”\n\nBut whether through force of arms or democratic evangelism, is it in the American interest to do what can’t be done? What is the evidence that the United States government can successfully create top-down democracies in alien cultures on the other side of the planet? Kosovo is now a crime syndicate built on drug money and organ trafficking. The government in Kabul hangs on for dear life to U.S. occupying forces, and its national budget isn’t big enough to pay cops on the beat. The Iraqi government remains uninterested in pursuing an inclusive administration with its Sunni and Kurd minorities, and remains at the mercy of an American-Iranian tug of war.\n\nWhat were the benefits to the American people of these do-gooder experiments? Are they any freer, richer, or safer? The opposite on all counts.\n\n“Altruistic wars” are not new for the Democratic Party. Arkansas Senator J. William Fulbright began his career as a militant internationalist and ended it as an early opponent of the Vietnam War. After his retirement, he impugned the motivations of his pro-war, humanitarian party members.\n\n“Lyndon Johnson, Hubert Humphrey, and others used to say that I was a racist, and that was why I didn’t like the war in Vietnam,” Fulbright, a lifelong segregationist, recalled. “I didn’t think ‘the little brown people’ were entitled to democracy. ‘We want to bring them the Great Society,’ Hubert would say. ‘We’re not racists. We have a great interest in those brown people.’ And all the time bombing them from five miles up.”\n\nThis strikes at the core contradiction of humanitarian intervention. Proponents invoke the welfare of foreigners and the benefits of liberalism, while advocating the same policies that bomb, starve, and oppress the people they claim to speak for.\n\nOne of the worst perpetrators of this is Samantha Power, former ambassador to the United Nations and foreign policy adviser to the Obama administration. As an early disciple of the Responsibility to Protect (RCP) concept, she won a Pulitzer prize for her 2003 book A Problem from Hell: America and the Age of Genocide. But after two terms of putting her ideas into practice, her latest book, The Education of an Idealist, was greeted with a much chillier reception.\n\nThat’s because she has the twisted wreckage of nations on her mantle now, sitting next to her prestigious award. Power was, along with Susan Rice and Hillary Clinton, one of the main voices in favor of the 2011 intervention in Libya that decapitated the Moammar Gaddafi dictatorship. The direct result has been the impoverishment of what was one of the most advanced countries in Africa, a mass migration of third-world refugees that has ruptured the European body politic, and an ongoing civil war that’s killed thousands.\n\n“We could hardly expect to have a crystal ball when it came to accurately predicting outcomes in places where the culture was not our own,” writes Samantha Power. No crystal ball? How about a memory that went back five to 10 years, that could recall the civil war in post-invasion Iraq?\n\nAnd like so much of the raison d’être that came before it, the excuses peddled by Power and company were complete fictions. The Iraqi army was not taking premature babies out of incubators in 1990. There were not hundreds of thousands of presumed dead in Kosovo in 1998. Saddam Hussein was not manufacturing weapons of mass destruction in 2003. And Gaddafi was not handing out condoms to soldiers in preparation for mass rapes in 2011.\n\nIn truth, Power’s “humanitarian” interventions are as deadly as their more selfish counterparts and are based on the same propaganda.\n\nThe American people need to make elites like Chris Murphy understand that the best way for our country to help the world (and itself) is for it to return to normal nationhood. Empire is a crown that weighs heavy on the head, and eventually the wearer falls, only for some other hapless country to pick it up. It’s time for the United States to return to a humble republic, one that doesn’t owe its neighbors any of its blood and treasure but does owe its citizens a foreign policy of peace and prosperity.\n\nHunter DeRensis is a reporter for The National Interest. Follow him on Twitter @HunterDeRensis.", "description": "", "authors": [], "top_image": "https://www.theamericanconservative.com/wp-content/uploads/2019/09/chris-murphy.jpg", "published_at": "2019-09-30"}