{"pub": "independent", "url": "https://independent.co.uk/independentpremium/long-reads/judy-garland-movie-renee-zellweger-true-story-hollywood-kill-star-mgm-a9127576.html", "downloaded_at": "2019-10-04 01:21:45.953360+00:00", "published_at": "2019-10-03", "title": "Judy: The tragic story of how Hollywood killed its greatest star", "language": "en", "text": "Some of those who went to see Judy Garland perform in London at the end of the Sixties came back marvelling. Partly, of course, they marvelled at the performance, the star still exuding charisma, the voice still full of emotion and longing, hitting the listener in the gut. But partly, too, they marvelled at what they saw in the audience. Grown men were crying.\n\nThe reason for that was that Judy Garland was not just a star of the moment. She was a memory, a memory of joy in a difficult and dangerous time. The Sixties, despite being thought of as an era in which everything was new, was still in touching distance of the Second World War. People who were middle-aged then had lived through the War. And it was during the War that the movies which featured Garland as their child star cheered up and gave hope to a generation.\n\nShe was – on screen – the epitome of innocence, exuberance, optimism, mixed with vulnerability and longing (most particularly, of course, in The Wizard of Oz in 1939) and with an incomparable voice to match. When she sang “Over the Rainbow”, one has to imagine now how that put a much-needed spring in the step of an audience also dreaming that there was a better world just over the rainbow.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe era of Garland’s final concerts is a long way off now, let alone the Second World War, and more than one generation has grown up rarely seeing her movies (apart from the statutory viewing of The Wizard of Oz with one’s parents) and knowing little about her life. Interestingly, those in the music and film industries still revere her. I once interviewed Paul McCartney, and we ended up talking about Judy Garland.\n\nThe new biopic, Judy, starring Renee Zellweger in the title role, is set in London at the time of those last concerts. It will show the contrast between Garland onstage, nervous but delivering unforgettable performances, and Garland off-stage, sweary, needy, in financial difficulties, drug-dependent. Her death in London from an accidental overdose of barbiturates just around the corner. The concerts varied, some unforgettable, some wobbly. But she made it on stage. As Zellweger says, “You have days when you would not choose to greet an audience, given what may be happening with your private life or health. But you don’t have a choice, because you made a professional promise.”\n\nWhich is somewhat to understate the torment that was afflicting Garland at this final juncture of her career and life, and still only in her forties.\n\nGarland was only 47 when she died, yet her career spanned 45 years, a bewildering statistic. Born in 1922 with the unstarry name Frances Ethel Gumm, her early years were the pure stuff of schmaltzy Hollywood legend. Her parents were vaudeville performers, and Garland performed from the age of two. Famously, at that age, during a performance of “Jingle Bells” she refused to stop singing, delivering encore after encore, until her dad pulled her off the stage.\n\nTragic child stars Famous too soon? Lena Zavaroni The Scottish singer was the youngest person in history to have an album in the UK top 10 when she herself was 10 years old. Later she starred in her own TV series. But from the age of 13 she suffered from anorexia and developed clinical depression when she was 15. Following an operation to cure her depression, she died from pneumonia aged 35 in 1999. Jack Wild He was nominated for an Oscar for his performance as the Artful Dodger at 16 in the film Oliver! By 18 he was a millionaire. By 21 he was an alcoholic. He later admitted he spent two decades in “a drunken haze”. He died of cancer aged 53 in 2006.\n\n\n\nRiver Phoenix The Eighties teen star of films such as Stand By Me (1986) died at the age of 23 in 1993 after collapsing outside the Johnny Depp-owned Hollywood club The Viper Room. Doctors were unable to revive him because of the lethal mix of illegal substances in his body.\n\n\n\nCorey Haim The teen star of a number of Eighties films including The Lost Boys died at 38 from pneumonia having battled with substance abuse when the parts dried up.\n\n\n\nNatalie Wood She began acting in films at the age of four. As a teen, she was the female lead in Rebel Without a Cause opposite James Dean. Numerous successes followed. She died in 1981 aged 43 in a still murky drowning accident. In 2018, her husband actor Robert Wagner was named a person of interest in the ongoing investigation into her death.\n\n\n\nRob Knox He played Marcus Belby in the film Harry Potter and the Half-Blood Prince. In 2009 at the age of 18 he was stabbed to death outside a bar in London as he tried to defend his brother from an attacker.\n\nHer parents recognised her potential, and her mother Ethel Marion Milne managed her career. But Garland was deeply troubled by the state of her parents’ marriage. Her father was involved in a scandal with a male usher at a theatre he owned. He adored Garland, and the adoration was mutual, but to add to the strain on the marriage caused by the scandal, Frank Avent Gumm was diagnosed with meningitis. Garland, who was already becoming a child star with MGM, was literally singing “Zing! Went the Strings of My Heart” in an MGM radio show as her father died. A few years later she and her mother became estranged. Perhaps significantly, “Zing! Went the Strings of My Heart” remained a staple in her act for the rest of her career.\n\nHer audience knew little or nothing of any of this. The war years were approaching, the depression had already ruined lives, and all they saw, and what they most needed, was a joyous, precocious prodigy on screen, and on radio a cheering, uplifting voice, with that ever-trembling vibrato suggesting a vulnerability that endeared her even more to her audience. Most of all, her singing conveyed genuine emotional intensity. Too genuine, actually. That same emotional intensity in her voice and delivery was among the factors that would lead to breakdown in her personal life.\n\nProfessionally, her career on screen was blossoming in prolific fashion. Taken on by MGM at 13, she became a teenage star often acting with fellow child prodigy Mickey Rooney in such child classics of the era as Babes in Arms. Teenage optimism always triumphed over adversity. But nothing enchanted the world as much as The Wizard of Oz, with Garland’s Dorothy.\n\nThe movie gets through to the child in all its adult viewers as well as the younger ones. The yellow brick road, the twisters, the ruby slippers and the promise of adventure. The Empire Film Guide concludes that “Garland, captured on the cusp of legend before traumas of stardom kicked in, provides the film’s devastating emotional centre, an icon for homesick kiddies everywhere”.\n\nAs a young adult, she continued to make films that captured the imagination. The best were directed by her then-husband Vincente Minnelli with Meet Me in St Louis (1944) making hits out of the title number as well as “The Trolley Song”. Later films were not so successful. Physically, she put on weight, then lost it again with ill-advised crash dieting. Mentally she became more and more unstable, had a breakdown during the making of Annie Get Your Gun and had to leave the cast. One can only speculate as to what we missed there.\n\nBut there was one exception to those variable later films. Her very last film, George Cukor’s 1954 version of A Star is Born was one of her greatest triumphs. David Thomson in his A Biographical Dictionary of Film wrote: “It is one of the greatest flawed movies ever made and shows Garland as the actress with the surest intuition of the drama in musical. Warners took evident fright at the notion of a puffy Garland playing an ingenue who finds fame in the movies. But every physical handicap could not prevent Garland from catching the scent of her own horrible greasepaint life.”\n\nSo what was it that was so “horrible” about her greasepaint life? What were those “traumas of stardom”? The death of her father and estrangement from her mother would have been enough, of course. But to add, very significantly, to that, when she entered her teens the studio, and in particular, the head of MGM, Louis B Mayer, became worried about her weight and insisted she take pep pills to suppress her appetite. Then, at the end of each day’s shooting, it also insisted that she (and other child stars) take sleeping pills. As celebrity chronicler Josh Mapes says: “Her insecurities about her weight combined with a gruelling work schedule resulted in her taking even more pills. Garland’s steady diet of amphetamines and barbiturates slimmed her physique and enabled her to get through shooting.” The Wizard of Oz may have won her a special Academy Award for outstanding juvenile performance, but it left her dependent on drugs. It was, of course, an overdose of barbiturates that finally killed her.\n\nThe Wizard of Oz may have won her a special Academy Award for outstanding juvenile performance, but it left her dependent on drugs\n\nCasing her drug dependency was not the only thing that Mayer can be blamed for. Garland’s biographer Gerald Clarke made an astonishing discovery when he was researching his book. He found an unpublished memoir by Garland herself. What it revealed was disturbing, to say the least. “Everyone knows about the Hollywood casting couches,” Clarke said in an interview with ABC News, “but nobody thought that Judy had been subjected to any sexual pressure from the higher-ups at MGM.” It started around the time Garland was playing Dorothy in The Wizard of Oz. She was 16.\n\n“Having sex with the female help was regarded as a perk of power, and few women escaped the demands of Mayer and his underlings,” Clarke wrote in his book Get Happy: The Life of Judy Garland. He went on: “Between the ages of 16 and 20, Judy herself was to be approached for sex – and approached again and again. ‘Don’t think they all didn’t try,’ she said. Whenever Mayer complimented her on her voice – she sang from the heart, he said – Mayer would invariably place his hand on her left breast to show just where her heart was. ‘I often thought I was lucky,’ observed Judy, ‘that I didn’t sing with another part of my anatomy.’”\n\nOnly when she was grown up was Garland able to say to him: “Mr Mayer, don’t you ever, ever do that again, I just will not stand for it.”\n\nMayer’s reaction, said Clarke, was bizarre. He burst into tears. “How can you say that to me, to me who loves you?” he asked Garland, who wrote in her unpublished memoir, that “it’s amazing how these big men, who had been around so many sophisticated women all their lives, could act like idiots”.\n\nIf Mayer was the most persistent, he was not the only one, not even the worst.\n\nClarke writes: “Another executive – Judy did not identify him – summoned her to his office. Eschewing any pretence of small talk, he demanded that she, too, have sex with him. ‘Yes or no, right now – that was his style,’ Judy recalled. When she refused … he began screaming. ‘Listen you – before you go, I want to tell you something. I’ll ruin you and I can do it. I’ll break you if it’s the last thing I do.’”\n\nI often thought I was lucky that I didn’t sing with another part of my anatomy\n\nShe was fired from MGM, though arguably less for rejecting predatory advances and more because of her increasing drug addiction, lateness on set and absence from the set. Her marriage to Minnelli was in crisis and Garland attempted suicide twice.\n\nAnd yet she loved the adoration of an audience and performing for them. Even at her lowest points she staged comebacks with massively successful live concerts, be they at Carnegie Hall or the London Palladium or lengthy tours.\n\nThree further marriages followed the one to Minnelli. The daughters from two of them, stars in their own right, Lorna Luft and Liza Minnelli, will have nothing to do with the upcoming movie and have vowed not to see it.\n\nPart of Garland’s complex legacy is that she long ago became a gay icon. She was very much aware of that. She knew a lot about the gay community, had many gay friends, and two gay husbands, Vincente Minnelli and Mark Herron. The phrase “friends of Dorothy”, a reference to her role in The Wizard of Oz, was long used in the gay community. And she once told daughter Liza: “When I die I have visions of fags singing ‘Over the Rainbow’ and the flag at Fire Island being flown at half-mast,” a reference to an upstate New York gay resort.\n\nHer residency at London’s Talk of the Town in 1969 just before her death showed how affecting the 47-year-old Garland could still be, and how her popularity was undimmed. Her funeral in New York drew 22,000 mourners. Frank Sinatra said of her: “She will have a mystic survival. She was the greatest. The rest of us will be forgotten, but never Judy.”\n\nPerhaps her best epitaph lies in one of her own quotes: “In the silence of night I have often wished for just a few words of love from one man, rather than the applause of thousands of people.”\n\nAnd just as telling: “I’ve always taken The Wizard of Oz very seriously, you know. I believe in the idea of the rainbow. And I’ve spent my entire life trying to get over it.”", "description": "Some of those who went to see Judy Garland perform in London at the end of the Sixties came back marvelling. Partly, of course, they marvelled at the performance, the star still exuding charisma, the voice still full of emotion and longing, hitting the listener in the gut. But partly, too, they marvelled at what they saw in the audience. Grown men were crying.", "authors": ["David Lister"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/01/13/judy-garland.jpg"}