{"pub": "guardian", "url": "https://theguardian.com/global/2019/oct/16/for-the-love-of-dog-why-canine-co-parenting-is-an-unexpected-joy", "downloaded_at": "2019-10-16 07:26:59.171733+00:00", "title": "For the love of dog! Why canine co-parenting is an unexpected joy | Arwa Mahdawi", "language": "en", "text": "Towards the tail end of our relationship, my ex, K, became obsessed with fostering dogs. A steady stream of shelter dogs (17, to be exact) passed through the apartment. Eventually, a little mutt called Rascal became what is known as a “foster fail” – we were smitten and adopted him. A few months later, we had a “relationship fail” – we hated each other’s guts and never wanted to see each other again.\n\nWe probably wouldn’t have, either, had it not been for Rascal. Neither of us could bear to give him up, so we decided to share custody.\n\nCanine co-parenting is a growing phenomenon. I don’t have official statistics to back this up, mind you, just a lot of anecdata. But it makes sense: pet ownership is growing globally and we are increasingly treating our furry friends like children. In the past few years, some US states, including California, Alaska and Illinois, have even passed legislation that means pets are treated as people – rather than property, as in the UK – in divorce proceedings. This means the judge has discretion to order shared custody if they think it is in the best interest of the animal.\n\nJoint custody isn’t always easy. I have had long chats with K about the many inadequacies of her canine parenting style; as you can imagine, these critiques did not go down very well. (I think she called me the technical term for a female dog.) I have had the occasional dark thought about taking her to canine court and claiming Rascal for myself. But, for the most part, the arrangement has been surprisingly wonderful. Taking care of Rascal gave us a bridge to go from bitter exes to best friends. Rascal now has one step-brother, two homes, four doting mothers and an infinite amount of attention – not to mention more treats than is probably good for him.\n\n•Arwa Mahdawi is a Guardian columnist", "description": "When my previous relationship broke down, we didn’t expect to see each other again. But jointly caring for our mutt, Rascal, has turned us from bitter exes into best friends, writes Arwa Mahdawi", "authors": ["Arwa Mahdawi"], "top_image": "https://i.guim.co.uk/img/media/2254138f7689ae2146ce105c0e37cf3b24453869/1174_0_4826_2896/master/4826.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=5b604c2ca5e95f817da25174e9396c1c", "published_at": "2019-10-16"}