{"pub": "breitbart", "url": "https://breitbart.com/radio/2019/10/14/rob-spalding-china-silenced-its-critics-buying-off-americas-elites", "downloaded_at": "2019-10-14 23:25:04.453139+00:00", "title": "Rob Spalding: China Silenced Its Critics by Buying Off U.S. Elites", "language": "en", "text": "China procures political compliance among American elites — including those within academia, entertainment, media, politics, and think tanks — through development of financial relationships, explained Robert Spalding, senior fellow at the Hudson Institute and author of Stealth War: How China Took Over While America’s Elite Slept, in a Friday interview on SiriusXM’s Breitbart News Tonight with host Rebecca Mansour and special guest host Rick Manning.\n\nSpalding recalled how Chinese political influence blocked a transparency initiative he was developing as a joint enterprise to examine and uncover the single-party state’s degree of control over large American corporations.\n\n“I reached out to a think tank — a major think tank — to run a program to essentially provide information so people can see all of the influence that the Chinese Communist Party had on corporate America, and we worked on this project for a year — scoping it out, trying to figure out how [many] resources this would take, how much money, how many people — and the think tank had basically agreed to do the study. It was actually going to be more than a study. It was going to be a continuing effort to portray the kind of influence that the Communist Party had over U.S. corporations, and provide that [information and data] in a way that could be accessible to the public, like a transparency initiative.”\n\nLISTEN:\n\nSpalding continued, “After about a year, I had also recruited some funders for this, and so when it got down to the very end — at the very end — the think tank basically decided not to pursue the project, and quite frankly, it was because many of their donors had relationships with the Chinese Community Party. It was not just think tanks. It was also law firms that I reached out to, very high-end top law firms in New York and in DC that essentially said, ‘We can’t help. We talked to our partners, and we don’t want to anger our Chinese clients,’ and so it was pervasive. I already knew that corporations had been influenced, and that’s why I wanted to run this transparency initiative.”\n\nCombating China’s political influence within America requires private sector cooperation, added Spalding. He warned, “The private sector had been essentially incentivized by the lure of profits from 1.4 billion Chinese and the payoffs that they were receiving … to essentially do the Communist Party’s bidding.”\n\nTariffs on Chinese exports must be made permanent in order to incentivize corporate investment in American manufacturing, determined Spalding.\n\n“We had put tariffs back on China because they clearly don’t have a market economy,” Spalding said, “[but] because those tariffs aren’t permanent … we’re not seeing manufacturing capacity return to the United States. No corporation will do the investment, because they think as soon as either [Donald Trump] is gone or we have some kind of deal [with China], the tariffs will be gone.”\n\nThe status quo of globalization facilitates capital outflows from America to China, Spalding noted. “[Globalization] created this unholy alliance between those who were getting enriched by these higher profit margins on their products and the country that had the policy that incentivizes them to do so,” he said. Predictions of China’s democratization and liberalization via its deeper integration within the global economy did not come to be, he added.\n\nChina leveraged the “elements of globalization” towards enhancing its geopolitical position, estimated Spalding, highlighting “trade, finance, investment, immigration, media, politics, the Internet, [and] academia.” Asymmetrical policies and regulations between the U.S. and China, particularly with respect to political and economic openness, facilitated China’s geopolitical ascendance, he added.\n\n\n\n“[An] uneven policy in regulation and in legal framework … was built in their system and built in our system,” Spalding stated, “and since our system wasn’t built to actually protect the American people or industry, [China’s] system became clearly dominant, and you can’t really blame American businesses, because our system says that executives and [board of directors] have a fiduciary responsibility to shareholders. Yhe Chinese Communist Party set the conditions in China, and our government set the conditions in the United States, and then you just run the clock, and if you run the clock, everybody goes to where it makes sense to make money, because that’s the business of globalization and international business, and the way you make money in this current system is to align yourself with how the Chinese Communist Party has essentially set up their rules.”\n\nMansour asked if Joe Biden and his youngest son, Hunter Biden, are illustrative of China’s procurement of political influence via development of financial relationships with politicians’ family members.\n\n“Let’s talk about the complicity, here,” said Mansour. “I can understand why our business leaders did this, because our government indicated to them — certainly from the Clinton administration on down — that this is the way we’re going to go. China’s opened up to do business, and if we go and do business with them, they will democratize, and it will be wonderful. This is what Bill Clinton preaches to high heaven. There’s also another element involving our political class … and we’re all talking about this this week because of the Hunter Biden thing. … Hunter Biden got a sweetheart deal with the state-owned Bank of China for his private equity firm, a $1.4 billion injection of cash, at the same time that Vice President Joe Biden was negotiating U.S. policy with China.”\n\n“Is this relationship that Hunter Biden had [with China], and the way his father responded, is that part of the problem, as well, that they are able to buy out our people?” asked Mansour.\n\n“Yeah, what you run into is that it’s not a quid pro quo, per se,” replied Spalding, describing China’s message to its business partners as, “Adopt Xi Jinping’s worldview, [which] is, ‘I need you to remain open for business.'”\n\nOpposition to President Donald Trump’s foreign policy towards China, particularly tariffs, is largely driven by financially compromised figures, said Spalding.\n\n“[Donald Trump] comes in and says, ‘Hey, I want to put in tariffs,’ and then you have all of these folks on the right and on the left saying,’Tariffs are bad,'” Spalding said. “If you start to really dig down deep, where did they make their money? What are their economic and financial relations that they have, and how does that impact the way they think about the world? And what you’ll find is, a lot of them, quite frankly, can tie the money that they made back to some kind of relationship with China, and so it’s not that they’re saying, ‘Hey, I’m going to betray my country for China,’ it’s that, ‘My way of looking at the world has been very successful for me. It’s enriched me. I’ve gotten very rich, and I read this book that Thomas Friedman wrote [titled] The World Is Flat, and globalization is good, and not only is it good in a profit sense, when I was out there getting very wealthy earning these millions of dollars, I was also on a crusade to democratize the world because open markets lead to wealth and wealth leads to democracy, and while I get rich, the world gets freer.'”\n\nSpalding concluded, “But in reality, the Chinese have essentially re-engineered that world after the Tiananmen Square massacre in order to ensure that while the elites got rich in the countries they were doing business with, power — geopolitical power — accrued to the Chinese Communist Party, because they had essentially gamed the system to do so.”\n\nBreitbart News Tonight broadcasts live on SiriusXM Patriot channel 125 weeknights from 9:00 p.m. to midnight Eastern or 6:00 p.m. to 9:00 p.m. Pacific.\n\nFollow Robert Kraychik on Twitter @rkraychik.", "description": "China procures political compliance among American elites through development of financial relationships, explained Robert Spalding.", "authors": ["Robert Kraychik"], "top_image": "https://media.breitbart.com/media/2019/09/wi/ap/30/d93b47_aptopix-china-70-years-04977-xi-jinping-chinese-president-xi-jinping-toast-e1570817853616-640x335.jpg", "published_at": "2019-10-14"}