{"pub": "fox", "url": "https://radio.foxnews.com/2019/09/06/dorian-leaves-congress-returns", "downloaded_at": "2019-09-07 02:09:54.504941+00:00", "title": "Dorian Leaves, Congress Returns", "language": "en", "text": "This Week:\n\nThe Bahamas has a long road of recovery following Hurricane Dorian's path of destruction. It's path also took the storm up the south east coast of the U.S. including Florida, and the Carolinas. FOX's D.C. Correspondent Rachel Sutherland spent this week in the Carolinas and joins Jared from Myrtle Beach.\n\nIn the latest setback this week for British Prime Minister Boris Johnson, the UK Parliament approved a bill that prevents Britain from leaving the European Union without an agreement. Forcing the Prime Minister Johnson to ask the EU to postpone Brexit if no agreement is made by mid-October. FOX's London-Based Correspondent Simon Owen explains.\n\nCongress returns to Washington next week after a month and a half recess. Democrats say they will reintroduce calls for comprehensive gun legislation following the mass shooting in El Paso TX, Dayton, OH and Odessa, TX. The challenge will be crafting a bill that Senate Republicans will support and President Trump will sign. Senior Capitol Hill producer Chad Pergram joins Jared to discuss the uphill battle for Democrats when they return.\n\nMarlin Fitzwater, former White House press secretary for President's Ronald Reagan and George H.W. Bush, is out with a new book 'Calm Before the Storm: Desert Storm Diaries & Other Stories.' He spoke with Jared about the book and his time as press secretary for two administrations and how President Trump has changed the role of the press secretary.\n\nListen to the latest \"From Washington\":", "description": "This Week:\r\n\r\nThe Bahamas has a long road of recovery following Hurricane Dorian’s path of destruction. It’s path also took the storm up the south east coast of the U.S. including Florida, and the Carolinas. FOX’s D.C. Correspondent Rachel Sutherland spent this week in the Carolinas and joins Jared", "authors": ["William Sanchez", "Emily Grassi"], "top_image": "https://radio.foxnews.com/wp-content/uploads/2018/11/COVER_FROM_WASHINGTON-700x700-1-700x700.jpg", "published_at": "2019-09-06"}