{"pub": "fox", "url": "https://foxbusiness.com/business-leaders/paris-hilton-hotelier-barron-hilton-funeral", "downloaded_at": "2019-10-20 16:57:02.134969+00:00", "title": "Paris Hilton remembers 'iconic' grandfather, hotel magnate Barron Hilton at funeral service", "language": "en", "text": "Paris Hilton and the rest of the Hilton family said their final goodbye to the late William Barron Hilton, a hotel magnate who also founded the Los Angeles Chargers.\n\nContinue Reading Below\n\nThe funeral service was held at the Good Shepherd Church in Beverly Hills on Saturday morning, according to a TMZ.\n\n\"Paris' sister, Nicky, was by her side as they solemnly greeted folks who were making their way inside. Eventually, the two siblings went in as well after most everyone entered,\" the report said.\n\nBarron, the second son and successor of hotelier Conrad Hilton, passed away Sept. 19 at the age of 91.\n\nParis, who is a 38-year-old heiress and jet-setting DJ, shared a series of photos and videos of the service with her followers via her Instagram story. In total, there were 25 posts documenting the event.\n\nThe stories included zoomed-in walkthroughs that showed black-and-white and color photo collages of Barron.\n\nIn one story, Paris highlighted his smiling face and said, “Miss you, papa.” In the next slide, she scanned through other photos while she noted, “So iconic… My handsome grandpa.”\n\nHer other stories included a snapshot of the businessman and philanthropist with floating text that said \"Legend,\" as well as a photo slideshow accompanied by an instrumental rendition of Elvis Presley’s \"Can't Help Falling In Love,\" and a recording of a touching eulogy by her brother Barron Hilton.\n\nThis isn’t the first time the famous blonde opened up to her followers about the Hilton family's loss.\n\nLast month, she shared a heartfelt tribute to her business-savvy grandfather on her main Instagram feed a day after the news broke.\n\n\"I am deeply saddened by the loss of my grandfather Barron Hilton. He was a Legend, a visionary, brilliant, handsome, kind and lived a life full of accomplishment and adventure. Ever since I was a little girl I have looked up to him as a businessman,\" she wrote, with a slideshow of images of the pair together, along with snapshots of her grandfather in different stages of life.\n\nTicker Security Last Change Change % HLT HILTON WORLDWIDE HOLDINGS INC. 91.15 -1.05 -1.14%\n\n“I feel so grateful to have had such an incredible mentor,\" she continued. \"I always wanted to make him proud. The last conversation we had a few days ago I told him how much of an impact he had on my life. His spirit, heart and legacy will live on in me.”\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nHilton Worldwide Holdings Inc. was founded in 1919 by Barron’s father, Conrad. The multinational hospitality company manages and franchises a broad portfolio of luxury hotels and resorts. Barron took on the mantle of chairman, president and chief executive officer of the business after his father.\n\nBarron passed from natural causes, according to a statement from the Conrad N. Hilton Foundation. He's survived by his two daughters, Hawley and Sharon, and his six sons, William Barron Jr., Steven, David, Richard, Daniel and Ronald. At the time of his pass, he had 15 grandkids and four great-grandchildren.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nAccording to the foundation’s biography, “Barron Hilton, son, patriot, entrepreneur and generous philanthropist, committed 97 percent of his wealth to the humanitarian work of the [Conrad N. Hilton] Foundation.”", "description": "Barron Hilton, the second son and successor of hotelier Conrad Hilton, passed away Sept. 19 at the age of 91.", "authors": ["Cortney Moore"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/05751444-AP5887186330885427.jpg?ve=1&tl=1", "published_at": "2019-10-20"}