{"pub": "news24", "url": "https://sport24.co.za/Cricket/zimbabwe-readmitted-as-icc-member-20191014", "downloaded_at": "2019-10-14 23:27:53.639112+00:00", "title": "Zimbabwe readmitted as ICC member", "language": "en", "text": "Dubai - Cricket chiefs readmitted Zimbabwe as an International Cricket Council member on Monday following a three-month suspension over political interference.\n\nAn ICC statement said the move followed a meeting in Dubai involving the Zimbabwe Cricket chairman Tavengwa Mukuhlani and sports minister, Kirsty Coventry.\n\n\"I would like to thank the Zimbabwe sports minister for her commitment to the reinstatement of Zimbabwe Cricket,\" said ICC chairman Shashank Manohar.\n\n\"Her desire to work in support of Zimbabwe Cricket was clear and she has unconditionally complied with the conditions set down by the ICC board.\"\n\nZimbabwe will now be able to take up their place in the men's Under-19 World Cup in January and the ICC Super League later in 2020.\n\n\"We are elated to get our membership restored and this marks the beginning of a new, exciting chapter for our cricket, with ZC's (Zimbabwe Cricket) focus now fully back on ensuring our game is thriving, sustainable and financially stable,\" said Mukuhlani.\n\n\"This would not have been possible without the steadfast support of the ICC and our colleagues from other member boards and we are very grateful to them.\"\n\nNepal has also been readmitted as an ICC member on a conditional basis following their 2016 suspension for a breach of regulations which prohibit government interference and require free and fair elections.\n\nManohar said: \"Given the progress made in Nepal, a transition plan will now be developed for the Cricket Association of Nepal to support full compliance with associate membership criteria, which will also involve controlled funding.\"\n\nZimbabwe's punishment was imposed in July after the cricket board was suspended by the government and replaced with an interim committee.\n\nPolitical turmoil within the sport and a string of humiliating performances led Zimbabwe to suspend their involvement in Test cricket in 2005, although they continued to play one-day internationals and Twenty20 (T20) internationals at the highest level.\n\nThey returned to Test cricket in 2011 but are languishing in 11th place in the rankings.\n\nThey are 12th in the ODI rankings and did not qualify for this year's World Cup in England and Wales.", "description": "Zimbabwe was readmitted as an International Cricket Council member by cricket chiefs on Monday after a three-month suspension over political interference.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8594/eddecde8962d4454939ff44427b70912.png", "published_at": "2019-10-14"}