{"pub": "nymag", "url": "https://nymag.com/strategist/article/best-beard-brush.html", "downloaded_at": "2019-09-26 23:50:27.522633+00:00", "title": "8 Best Beard Brushes 2019", "language": "en", "text": "8 items in this article Photo: HBO\n\nIt’s easy to write beard brushes off as another not-so-necessary grooming tool, because you might think you already have a comb or a brush or hands you can use to groom your facial hair. But we spoke with some very experienced beard experts — barbers and grooming gurus, many of whom sport beards themselves — and they told us that, in fact, beard brushes can make a big difference, because they are designed specifically to tame often coarser facial hair. According to them, a healthy brushing can quickly transform a messy beard into a smart and well-groomed one. “It’s an essential tool for keeping the beard looking smooth,” says Chad Beightol, the owner of men’s grooming boutique Consigliere. “If you think of beard hair like head hair, it takes a little bit of effort to keep everything in place. Beard brushes allow you to get all of the hair going in the same direction and keep flyaway strands from poking out.”\n\nIn addition to smoothing wayward beards, the experts told us that beard brushes exfoliate hard-to-reach skin beneath a beard, and they also help “spread the natural oils of your skin and facial hair,” according to Tony DeAngelis of Brooklyn’s Blue and Black barbershop. DeAngelis adds that a brush can also help evenly distribute any sort of beard oil or beard balm throughout your beard: “Using a brush daily with a few drops of a good beard oil will do wonders for a scruffy beard.” In order to find the best beard brushes, we asked Beightol, DeAngelis, and six other beard experts for their recommendations. Read on for their favorites.\n\nBest overall beard brush\n\nKent Boar Bristle Beard and Mustache Brush $48 (was $50, now 4% off) If you’re shopping for a beard brush, all of the experts recommend going for one made with boars’ hair. As Beightol explains, boars’ hair “has the right strength for facial hair, and the texture of boars’ hair will help to distribute oils in the beard.” Kent’s U.K.-made boars’ hair beard brushes came recommended by four of our experts; the brand makes them in a variety of shapes and sizes, but three of the pros specifically mentioned this smaller brush with a handle. “I really love this beard brush,” says DeAngelis, adding that the smaller brush head allows “better control and detail when styling your beard.” Barber Angelo Ruscetta is another fan of the company, and told us that “Kent makes an awesome beard brush. They’re expensive, but they’re the best.” He likes the ergonomics of this brush’s handle, and says that its angled bristles are “made to glide through the hair.” $48 at Amazon Buy $48 at Amazon Buy\n\nBest beard brush for short beards\n\nZeus Boar Hair Beard and Mustache Brush, Soft Bristle While the premium-priced Kent brushes were the most recommended by the pros, the second-most recommended beard-brush brand was Zeus, endorsed by Beightol and Xavier Rodriguez of Fellow Barber Soho. According to Beightol, “Zeus makes some of the best beard brushes around and they’re very popular with bearded guys. The quality and price are great.” When picking a beard brush, the two most popular options are smaller brushes with handles, or larger “military-style” brushes that are either rectangular or oval-shaped. You’ll also need to choose between soft or firm bristles. “Picking the right one is dependent upon the thickness and fullness of a beard,” explains Beightol, who says that a “softer-haired” brush like this one is ideal for “shorter or thinner beards.” And if you’re wondering if there’s really a need to use a brush with short beards, Gary Priore, founder of New York Beard & Company, told us it can still make a difference: “Brushing always helps, even with a short beard. It helps you take away dead skin cells and helps stimulate the follicles of hair which actually can help promote growth.” $12 at Amazon Buy $12 at Amazon Buy\n\nBest beard brushes for long beards\n\nZeus Boar Hair Military Style Beard Brush, Firm Bristle “For thick or long beards, a firm-haired brush is more effective,” says Beightol. He recommends this larger firm-haired oval brush, also made by Zeus, for taming bigger beards. Military style brushes like this generally have more surface area covered with bristles, which means they can comb through more hair at once. $30 at Amazon Buy $30 at Amazon Buy\n\nKent Boar Hair Oval Beard Brush If you’re looking for a firm bristled brush by our top-recommended brand, Ruscetta suggests this oval, military-style option. $58 at Amazon Buy $58 at Amazon Buy\n\nBest (less expensive) military-style beard brush\n\nDiane Fromm Curved 100% Boar Military Brush Soft Bristle For a very affordable military-style option, barber Allen Levenson of Epic Barbershop NYC likes this soft bristled brush made by Diane. Given what the other experts said about short bristles being better for short beards, and long bristles for long beards, this might be a good option if you’ve got a shorter beard, but would prefer to use a tool without a handle. “The soft bristles don’t hurt your face when you brush,” says Levenson, and he likes the “efficiency” of the larger brush head. $6 at Amazon Buy $6 at Amazon Buy\n\nBest synthetic bristle beard brush\n\nSuavecito Synthetic Hair Beard Brush All of the experts recommended a boars hair beard brush as the best option, but there are also brushes with synthetic bristles. So if you’re vegan or don’t like the idea of using a boars’ hair brush for whatever reason, you can still find a good one. Ruscetta likes this one from Suavecito, which still looks like a traditional, military-style beard brush with its oblong-shaped wooden base. $22 at Amazon Buy $22 at Amazon Buy\n\nBest beard brush for travel\n\nZeus Boar Hair Pocket Beard Brush, Firm Bristle Rodriguez likes this smaller “pocket beard brush” from Zeus because, as he puts it, “the best beard brush is the one you have with you.” Like all of Zeus’ beard brushes, it comes with a handy drawstring bag, and the small size means it should easily fit in a coat pocket or a Dopp kit. This one has firm boars’ hair bristles, but it’s also available in a soft-bristle version. $12 at Amazon Buy $12 at Amazon Buy\n\nBest travel-sized round beard brush\n\nBFWood Boar Hair Small and Round Beard Brush Here’s another small, travel-friendly beard brush recommended by Priore, who told us that while he also uses a more standard-sized rectangular beard brush, he loves having this “small and round” brush on hand too. “It provides a more laser-focused approach to what hairs I need to keep in check,” he explains. $8 at Amazon Buy $8 at Amazon Buy\n\nget the strategist newsletter Actually good deals, smart shopping advice, and exclusive discounts. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.\n\nThe Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.", "description": "A good beard brush can tame a messy beard and distribute beard oil and beard balm. Here are the best boar hair beard brushes,  including soft bristle, firm bristle, with handles and military style, from Kent, Zeus and more.", "authors": ["David Notis"], "top_image": "https://pixel.nymag.com/imgs/daily/strategist/2019/09/26/beard-brush/19-beard-brush-lede.w1200.h630.jpg", "published_at": "2019-09-26"}