{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/pickle-grapes-for-a-surprisingly-good-time", "downloaded_at": "2019-10-16 01:15:19.153958+00:00", "title": "Pickle Grapes For A Surprisingly Good Time", "language": "en", "text": "Photo: Claire Lower\n\nSome pickles — cucumbers, onions and even carrots — are obvious, but grapes are not an obvious pickle. Grapes are a surprising pickle, an unexpected pickle, an intriguing pickle. If you leave them whole during the fermentation process, they’re a fizzy pickle.\n\nThey’re also a very easy pickle to make. Though “lacto-fermentation” sounds kinda science-y (and potentially dairy heavy), it’s a pretty straightforward (and milk-free) process. The “lacto” refers to the bacteria Lactobacillus, a naturally occurring bacteria that converts sugars to lactic acid when placed in an aerobic (oxygen free) environment. The lactic acid gives the pickle a nice tang, and salt inhibits unwanted bacterial growth while letting our good bacteria do its thing.\n\nMade more lacto grapes for further lactogrape experimentation. Will try using fruits for chutney and juice for mustard. pic.twitter.com/DfhCEk8F2b — AJ DiGregorio (@AJDiGregorio) September 9, 2019\n\nThe most commonly lacto-fermented pickles are cabbages and carrots, but a Twitter friend suggested lacto-ing some grapes, and I am now obsessed with the savoury, tangy morsels, which are perfect for cheese plates. Though you can lacto-ferment grapes in a liquid brine, you can forgo all that by using a vacuum sealer, which creates a fantastic environment for our friendly bacteria. To make these unexpected pickles, you will need:\n\nGrapes (washed)\n\nIodine-free salt (iodine can inhibit fermentation)\n\nA vacuum sealer and vacuum bags\n\nPhoto: Claire Lower\n\nDecide how many grapes you want to pickle and weigh them. Note the mass, and weigh out an amount of salt that is two per cent of your grape mass. (For example, if you have 100 grams of grapes, you would need 2 grams of salt.).\n\nHalve the grapes if you like, and chuck them in a vacuum bag. Add the salt, mix everything together, and seal the bags. Let the grapes sit at room temperature. After a day (or maybe even sooner), they’ll start to bubble away. After about a week, the bubbles will start to die down. Once they do, your grapes are ready to be enjoyed.\n\nIf you left the grapes whole, some of those bubbles may have gotten trapped under their skin. This makes for a fizzy pickle, which is fun, but the effect will fade with time, so pop a few in your mouth straight out of the bag. Serve your tangy and slightly funky grapes with cheese and cured meats, or chop ‘em up for a salsa or a chutney, and use the brine in marinades, dressings, and sauces. Keep the pickles in the fridge, where they should last at least a few months.", "description": "Some pickles — cucumbers, onions and even carrots — are obvious, but grapes are not an obvious pickle. Grapes are a surprising pickle, an unexpected pickle, an intriguing pickle. If you leave them whole during the fermentation process, they’re a fizzy pickle....", "authors": ["Alan Henry", "Chris Jager"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/twq1yrjg6fw6mbqtyn7q.jpg", "published_at": "2019-10-16"}