{"pub": "cbc", "url": "https://cbc.ca/parents/learning/view/scheer-trudeau-singh-may-bernier-election-2019-federal-voting-dad", "downloaded_at": "2019-10-18 08:52:40.013402+00:00", "title": "You Should Bring Your Kid to the Polls on October 21 — And Here’s Why", "language": "en", "text": "“Voting is boring!”\n\nThat is what my seven-year-old daughter said when I asked her to join me and her mom on our election-day walk to our local polling station.\n\nWhen pressed as to why she didn’t want to watch us exercise our democratic right, she shouted defiantly: “Voting is boring. I’m not going! We’re skipping it!”\n\nRead another POV from the author: Be Like My Daughter — Put Down Your Phone, Pick Up a Shovel and Start Sandbagging\n\nI get it. At the time she was a little kid. The lines were long. You couldn’t make a lot of noise. You didn’t get to check any of the boxes. Without exception, we had taken our kid to every election — civic, provincial and federal. We’d made it a family ritual. Living in a society where citizens are free to choose their leaders is one of the greatest privileges of being Canadian. We didn’t take it for granted.\n\nFast forward five years and my kid is now 12. Just about everything has changed, including her attitude towards voting. Suddenly, my kid is engaged with the world. Certainly more so than I was at her age. Did our efforts have something to do with it?\n\nI’d like to think so. But more importantly, my daughter and her generation have witnessed world events that have demonstrated the power of young people when they take action to fix what previous generations could not.\n\nJust think of what my kid and her contemporaries have witnessed during their lifetime. Malala Yousafzai survived an assassination attempt to go on to champion education for girls around the world. The traumatized yet brave students of Marjory Stoneman Douglas High School took political leaders to task about guns in America.\n\nKeep yourself up to date with the latest polls using Éric Grenier's Canada Votes 2019 Poll Tracker\n\nYoung phenom Greta Thunberg began a climate strike that spread globally. They’ve seen all of this and so much more. What they have witnessed has molded their world view to the point of no return.\n\nAs our current election nears, I ask my daughter what she and her friends believe are the most important issues currently facing young people. Not surprisingly, they speak about the environmental crisis being the number one issue facing Canada and the world.\n\nAnd while the environment takes top spot, several others are close contenders for second place, such as treating all people equally and fairly and not discriminating against people based on race, religion or sexual orientation. The climbing cost of living, particularly for education and housing which they fear will be out of reach for most. And the need for young voices to be heard. Suddenly, it seems, the kids are all right.\n\nVoting is no longer “boring.” Now, as a family, we have lively discussions while sitting together watching the federal debates. We talk about the pros and cons of the party leaders, we study their platforms and meet our local candidates.\n\nKeep your kids informed before October 21 with Kids News' kid-friendly election coverage.\n\nAs a dad and a Canadian, I’m optimistic about my daughter and her generation’s growing interest in the democratic process. The decisions made by our next government will impact their future more than they can imagine. They have every right to be mad as hell about the state of the world and have every right to turn their anger into action.\n\nAction that ensures the Canada of tomorrow will reflect the values and aspirations that matter to our newest generation.\n\nVoting is exhilarating.", "description": "Because dragging my reluctant daughter to watch me vote election after election seems to have rubbed off on her in a really positive way.", "authors": [], "top_image": "https://www.cbc.ca/parents/content/imgs/_8col/kids-voting.jpg", "published_at": "2019-10-18"}