{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7615457/Rebel-MPs-plotting-defy-Boris-Johnson-seizing-control-parliament-timetable.html", "downloaded_at": "2019-10-26 00:30:02.169817+00:00", "title": "Rebel MPs are 'plotting to defy Boris Johnson by seizing control of the parliament timetable", "language": "en", "text": "brexit countdown_bg Created with Sketch.\n\nRebel alliance MPs are plotting to try and force a vote on the second referendum or customs union as early as next week rather than giving in to Boris Johnson's election demands, it has emerged.\n\nPoliticians are plotting to take control of parliament's timetable again in a similar tactic to that used to force the PM to ask for a Brexit delay with the Benn act.\n\nPlans would mean taking control of parliament's timetable and forcing a Brexit legislation vote.\n\nMPs say this is a possibility if Boris Johnson continues to halt his work on the withdrawal agreement bill until a general election is agreed.\n\nJohnson has urged Labour leader Jeremy Corbyn to 'man up' and back his plans for a pre-Christmas general election, as the Brexit process was effectively put on hold while the Labour leader makes up his mind whether to back a snap election.\n\nRebel alliance MPs are plotting to try and force a vote on the second referendum or customs union as early as next week rather than giving in to Boris Johnson's election demands, it has emerged. This comes after Johnson urged Labour leader Jeremy Corbyn to 'man up' and back his plans for a pre-Christmas general election\n\nThe PM laid down the gauntlet by demanding Mr Corbyn approves a poll on December 12, saying it is the only way to resolve the Brexit 'nightmare'.\n\nUnder rebel MPs new plans, they would take control of parliament's agenda and put forward one of the deals already forged - either by Johnson or Theresa May.\n\nMPs told The Guardian that votes on introducing a customs union and having a second referendum could also be held at that point.\n\nThe PM laid down the gauntlet by demanding Mr Corbyn approves a poll on December 12, saying it is the only way to resolve the Brexit 'nightmare'\n\nThe plans aim to show EU leaders that parliament means business about using the extension to break the deadlock.\n\nMr Johnson needs Mr Corbyn to come on board as two-thirds of MPs must vote for an early election.\n\nMeanwhile, the EU is also waiting on Mr Corbyn. Ambassadors today said leaders have agreed an extension - but revealed they will not say how long it will be until Monday as they wait to see if the UK is going to the ballot box.\n\nDespite the mounting pressure, Mr Corbyn again dodged giving straight answers on how he will respond in an appearance on ITV's This Morning - as he faces a massive revolt from his own MPs who fear being destroyed by voters.\n\nMr Corbyn insisted that Mr Johnson would have to come to Parliament and rule out the UK ever leaving the EU with No Deal. That is a higher bar than the party's previous condition that there must not be a threat of crashing out during an election campaign.\n\nThe veteran left-winger also criticised the December 12 date as 'odd for many reasons', arguing it was 'so near Christmas' and 'after universities finish their terms'.", "description": "Politicians are plotting to take control of parliament's timetable again in a similar tactic to that used to force the PM to ask for a Brexit delay with the Benn act.", "authors": ["Jemma Carr For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/23/20200630-0-image-a-33_1572043241637.jpg", "published_at": "2019-10-25"}