{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/sep/06/boris-and-donald-two-leaders-afraid-to-do-the-hard-work-of-running-a-country", "downloaded_at": "2019-09-06 12:13:39.062118+00:00", "title": "Boris and Donald: two leaders afraid to do the hard work of running a country | Richard Wolffe", "language": "en", "text": "They rose together and now they are falling together.\n\nFor three long years, the DoBo project – a scheme to spark global mayhem spearheaded by Donald and Boris, with a few critical assists from Vladimir – has afflicted most of our cultural, political and economic norms.\n\nAt the moment of their initial triumph, we could only watch in shock and awe as they undermined some of the world’s greatest diplomatic, military and commercial alliances. Not to mention any sense of social cohesion, right or wrong, day or night.\n\nWho can forget that high-water mark when the new president-elect gave his first British “interview” to one Michael Gove, the past and future Brexiter?\n\nAs he put it, so weirdly, in the third person: “Trump said Brexit is going to happen and it happened. Everybody thought I was crazy.”\n\nThey still do, Mr President. Especially when they remember your promise, in the same interview, of a quick trade deal with the UK that was “good for both sides”. It made about as much sense as your white nationalist rant about the EU forcing refugees on to a once-proud Britain.\n\nBack in 2016, the only way to explain the surprising success of the so-called populists was to assume that all assumptions were wrong: this was a global revolution that we somehow ignored until it was too late. Backed by the dark forces of digital disinformation and social media targeting, the project was surely unstoppable.\n\nUntil now. In this fourth year of our collective lunacy, the DoBos have facepalmed their way into the brick wall of reality. It’s only surprising that it took them so long.\n\nYou can fool some of the people all of the time. But you can’t really call yourself populist when a rump of hardcore nationalists is all you’ve got left.\n\nAfter three years of what passes for effort, Boris can’t deliver his beloved Brexit and Donald can’t build his wacky wall. Boris can’t force Europe into more concessions and Donald can’t force Mexico to pay.\n\nBoris lost his conservative majority in parliament while Donald lost the Republican majority in the House. It turns out both of them are better at finding imaginary enemies at home than finding new friends overseas. And no, the love letters from Kim Jong-un don’t count.\n\n“He’s a friend of mine and he’s going at it, there’s no question about it,” Trump told reporters on Wednesday. “Boris knows how to win. Don’t worry about him.”\n\nOf course Trump was speaking at almost the precise moment when his buddy was losing a House of Commons vote to stop his no-deal Brexit. If Boris knows how to win, this would be a great time to show a few of his winning ways.\n\nThis moment of reckoning is forcing us all to reassess our initial analysis of the far-right nationalism we once preferred to call populism. Boris has a 31% positive rating in the UK, while Donald can only scrape together 39% popularity across the pond. Small wonder that Trump is trailing against all the leading Democrats in national head-to-head polling in recent weeks.\n\nAt this point it is traditional to insert a few caveats. Boris’s Conservatives are still 10 points ahead of the opposition Labour party in national polls on voting intentions. Trump is tying with some Democrats in Wisconsin, even as he trails them all in Michigan. We are several weeks away from the earliest British election and more than a year away from the American general election.\n\nBut we already know this about the terrible twins of Anglo-Saxon supremacy. They are both parodies of patriotism, projecting weakness to the world while they praise their own supposed strength.\n\nBoth claim to be the world’s greatest negotiators but have truly whiffed at anything close to deal-making. Trump famously bragged that “trade wars are good, and easy to win” but 18 months after that epic tweet, American manufacturing is in sharp decline and American farmers are miserable.\n\nIn the face of all that reality, Trump continues to delude himself about his escalating trade war with China, telling reporters on Wednesday that “they want to make a deal”. But Donald’s assertions about Beijing’s desires are about as reliable as Boris’s claims about Brussels.\n\nBoth leaders are demanding ransom payments by holding themselves hostage. Trump’s anti-China tariffs are actually paid by American consumers. As a tactic, this is as brilliant as Boris threatening Brussels with the prospect of economic collapse in Britain.\n\nThis is the fundamental challenge of the DoBo project: government is so much harder than social media. At some point you have to deliver on something close to your promises or else the people – whose will is so clearly sacrosanct – will rumble you.\n\nReal conmen know they can’t stick around for too long after they sucker their victims because confidence isn’t permanent. Real fascists know they can’t tolerate democracy for too long after they seize power for the same reason.\n\nSo our former populists lose confidence in the evil geniuses who engineered their original victory – the Steve Bannons and Dominic Cummings of the dark arts. And they ditch the big narratives about national greatness for the smallest wedge issues about plastic straws or culture wars.\n\nIn the end, Donald and Boris will implode not because of their strategists or their slogans but because of themselves.\n\nThey are both crushingly lazy men who can’t be bothered to prep for questions, never mind for their real job. Donald recently congratulated Poland on getting invaded by the Nazis, while Boris recycled old jokes about his opponent as a chlorinated chicken.\n\nThere was a time, not so long ago, when pundits thought that it was a source of some great political superpower that neither Boris nor Donald had any core convictions. They were both opportunists who could turn on their own supporters if there weren’t enough of them to go around.\n\nInstead, both men have shriveled like peas into an ever-smaller political space, unable to find any popular support for their supposedly populist positions.\n\nBarack Obama used to keep a sign on his desk in the Oval Office that said: “Hard Things Are Hard.” It was an inside joke, dating back to his toughest days as he struggled to pass his landmark healthcare reforms.\n\nFor Boris and Donald, it’s the easy things – like showing up for work – that are hard. The hard things just never happen.", "description": "After years of feigned effort, neither of the so-called populist powers can deliver on any of their promises", "authors": ["Richard Wolffe"], "top_image": "https://i.guim.co.uk/img/media/53082933b9b8e9c496c5afb9eb3ac7178e5b53ef/0_0_5857_3514/master/5857.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=eabae5d0f508c50cb4dc167ce4707377", "published_at": "2019-09-06"}