{"pub": "independent", "title": "15 questions that can predict whether your relationship will last, according to psychology professor", "url": "https://independent.co.uk/life-style/love-sex/relationships-love-last-forever-questions-test-psychology-fifteen-questions-gary-lewandowski-a8243096.html", "language": "en", "published_at": "2019-08-26", "downloaded_at": "2019-09-02 07:22:53.971017+00:00", "text": "Being in love can be incredible - but it also has the habit of making us see our faulty relationships through rose-tinted glasses.\n\nIn reality, deciphering whether the relationship you are in is built to last can be difficult - so Gary W Lewandowski, a relationship scientist, professor of psychology at Monmouth University, and creator of www.ScienceOfRelationships.com, came up with a list of 15 questions for deciphering whether your romantic relationship is good for you.\n\nLewandowski told The Independent he decided to create a list because the number one question he gets is: “How do I know if I’m in the right relationship?”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“It is probably the question people have the most but are least equipped to answer themselves,” he told The Independent, “When they try to determine, they don’t always know the right questions to ask and focus on the wrong thing.”\n\nDrawing inspiration from the Keltner List, a list for considering whether a baseball player is deserving of the National Baseball Hall of Fame, Lewandowski created a list that uses gut instinct, as well as science - as both are necessary when making big decisions - or when trying to decide on the \"best of the good.\"\n\nAccording to Lewandowski, responding “yes,” honestly, to these questions, which rely on both science-backed data and intuition, means your relationship is worth staying in.\n\nThe questions are:\n\nDoes your partner make you a better person, and do you do the same for them? Are you and your partner both comfortable with sharing feelings, relying on each other, being close, and able to avoid worrying about the other person leaving? Do you and your partner accept each other for who you are, without trying to change each other? When disagreements arise, do you and your partner communicate respectfully and without contempt or negativity? Do you and your partner share decision-making, power and influence in the relationship? Is your partner your best friend, and are you theirs? Do you and your partner think more in terms of “we” and “us,” rather than “you” and “I”? Would you and your partner trust each other with the passwords to social media and bank accounts? Do you and your partner have good opinions of each other – without having an overinflated positive view? Do your close friends, as well as your partner’s, think you have a great relationship that will stand the test of time? Is your relationship free of red flags like cheating, jealousy and controlling behaviour? Do you and your partner share the same values when it comes to politics, religion, the importance of marriage, the desire to have kids (or not) and how to parent? Are you and your partner willing to sacrifice your own needs, desires and goals for each other (without being a doormat)? Do you and your partner both have agreeable and emotionally stable personalities? Are you and your partner sexually compatible?\n\nIf you answer “no,” the bad news is your relationship likely won’t stand the test of time because “just because you can find good doesn’t mean it is a good relationship,” according to Lewandowski.\n\nBut the good news is breakups can be a good thing - as “staying in a bad relationship is the worst possible thing for you,” according to Lewandowski.\n\nHe told The Independent: “Learning good stuff about relationships is no threat to good relationships\" and \"If you're in a mediocre to bad relationship, getting out frees you up to get in a great one.\"\n\nSo if you do happen to answer these questions with “no,” your relationship likely wasn’t all that great to begin with - and it may be time to break-up.\n\nYou can learn more about Professor Lewandowski's thoughts on beneficial breakups here.\n\nThis article was originally published in March 2018.\n\nThe Independent's Millennial Love group is the best place to discuss to the highs and lows of modern dating and relationships. Join the conversation here.​", "description": "Being in love can be incredible - but it also has the habit of making us see our faulty relationships through rose-tinted glasses. In reality, deciphering whether the relationship you are in is built to last can be difficult - so Gary W Lewandowski, a relationship scientist, professor of psychology at Monmouth University, and creator of www.ScienceOfRelationships.com, came up", "authors": ["Chelsea Ritschel"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/03/07/17/istock-520499510.jpg"}