{"pub": "cbs", "url": "https://cbsnews.com/news/adam-schiff-censure-vote-house-democrats-block-republican-effort-to-censure-schiff-monday", "downloaded_at": "2019-10-22 13:32:01.946007+00:00", "title": "House Democrats block vote on censuring Schiff over handling of impeachment inquiry", "language": "en", "text": "Schiff says whistleblower testimony \"might not be necessary\"\n\nSchiff says whistleblower testimony \"might not be necessary\"\n\nWashington — House Democrats on Monday blocked a vote on a Republican resolution to censure House Intelligence Committee Chairman Adam Schiff over his handling of the impeachment inquiry into President Trump.\n\nLawmakers voted to table the censure resolution, effectively killing it, by a vote of 218 to 185. The vote fell completely along party lines, with independent Representative Justin Amash, a former Republican, siding with the Democrats.\n\n\"Chairman Schiff is a great American patriot. Our country is extremely well-served by his serious, smart and strategic leadership to protect our elections, national security and democracy — which sadly stands in stark contrast to Republicans in the Congress,\" House Speaker Nancy Pelosi said in a statement after the vote. \"The House will proceed with our impeachment inquiry to find the facts and expose the truth, guided by our Constitution and the facts.\"\n\nThe censure resolution was introduced last week by GOP Representative Andy Biggs of Arizona, the chairman of the conservative House Freedom Caucus. It cited several reasons Schiff should be censured, including his recitation of an embellished account of the call between Mr. Trump and the president of Ukraine during a congressional hearing, his accusations that Mr. Trump was colluding with the Russians and contact between committee staff and the whistleblower.\n\nSchiff has defended himself by saying his embellished account of the call was \"meant to be at least part in parody.\" He has also conceded he \"should have been much more clear\" during an appearance on MSNBC in September when he said his committee had \"not spoken directly to the whistleblower.\"\n\nThe California Democrat reacted to the vote on Twitter, saying Republicans would be remembered for failing to rebuke the president.\n\nIt will be said of House Republicans, When they found they lacked the courage to confront the most dangerous and unethical president in American history, They consoled themselves by attacking those who did. — Adam Schiff (@RepAdamSchiff) October 21, 2019\n\nBiggs also reacted to the vote, accusing Schiff of having a \"reckless disregard for the truth\" and running a \"secret impeachment inquiry.\"\n\nAdam Schiff may not have been held accountable tonight, but the American people are very much aware of his reckless disregard for the truth. They will not tolerate his calculated words and actions as he continues his secret impeachment inquiry to undermine the will of Americans. pic.twitter.com/mVp5DMTy4g — Rep Andy Biggs (@RepAndyBiggsAZ) October 21, 2019\n\nRepublican leaders, including House Majority Leader Kevin McCarthy, have criticized Schiff for secrecy surrounding the impeachment proceedings. The Intelligence Committee, along with the two other congressional panels leading the inquiry, has interviewed a number of U.S. officials behind closed doors.\n\nSchiff has said the transcripts of the closed-door depositions will eventually be made public.\n\nBefore House Democrats tabled the vote, Biggs told Fox News that his resolution \"gives the Democrats an opportunity to show where they are on due process, and they get to say, 'Look, we're perfectly content with closed-door impeachment inquiry,' or they get to say, 'This isn't quite right, and we want to do it the right way.'\"\n\nMr. Trump tweeted his support for Schiff's censure earlier in the day.\n\n\"Censure (at least) Corrupt Adam Schiff! After what he got caught doing, any pol who does not so vote cannot be honest....are you listening Dems?\"\n\nBiggs used a procedural mechanism that required a vote within two legislative days. The vote should have taken place Friday, but Biggs postponed it out of respect for the death of longtime Representative Elijah Cummings last week.\n\nRebecca Kaplan contributed reporting.", "description": "Democrats tabled the Republican-sponsored resolution to censure the House Intelligence Committee chairman", "authors": ["Caroline Cournoyer"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/21/e0c49bbe-bf4b-4729-a329-0b40e3b59bab/thumbnail/1200x630g3/7367ad342df63241ab6a6cd32902a2d0/ap-19290698198870.jpg", "published_at": "2019-10-21"}