{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/body-found-derelict-building-after-20719902", "downloaded_at": "2019-10-25 01:46:03.285608+00:00", "title": "Body found in derelict building after desperate search for missing girl, 16", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA father has spoken of his devastation after a body believed to be his missing 16-year-old daughter was found dead in a derelict building.\n\nThe body of a girl, suspected to be missing Kianna Patton, was discovered in Pembroke Dock, in Pembrokeshire, north Wales, yesterday afternoon.\n\nFormal identification is yet to take place however next of kin have been made aware of the development, Dyfed-Powys Police say.\n\nKianna went missing from Pembroke Dock at around 3pm on Wednesday, according to her dad Pilgrim Paton.\n\n(Image: Getty Images/iStockphoto)\n\nMr Patton wrote on Facebook : \"This evening Thursday 24th October at 19.05hrs, Dyfed Powys Police confirmed to me that my daughter's body was found today.\n\n\"She was only 16-years-old. I have no answers as to why. I will never have answers. I don't think any of us will.\n\n\"We - I - cannot begin to even understand what they are going through. And I have no words.\"\n\nThe dad, who currently lives in Germany, said his ex-wife was due to identify Kianna's body last night.\n\nA spokeswoman for Dyfed-Powys Police said: \"A female body has been discovered at a derelict building in Pembroke Dock today (October 24).\n\n\"The discovery was made during the search for missing 16-year-old Kianna Patton.\n\n\"Formal identification is yet to take place however next of kin have been made aware of this development.\n\n\"The body was discovered at around 4.45pm on Thursday, October 24. Fire and ambulance also attended. HM Coroner has been informed.\"\n\nSeveral tributes have since been left on a Facebook post by Dyfed-Powys Police - which had originally sent out a missing person's appeal on the social media channels, Wales Online reports.\n\nCaroline Lee wrote: \"So so sad. I know there was every police available police officer in Pembrokeshire looking for this little girl today.\"", "description": "Police have found a body in their search for missing 16-year-old Kianna Patton, who disappeared in Pembrokeshire, Wales, on Wednesday", "authors": ["Robert Dalling", "Matthew Dresch", "Image", "Dyfed Powys Police", "Getty Images Istockphoto"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20719924.ece/ALTERNATES/s1200/0_Kianna-Patton.jpg", "published_at": "2019-10-25"}