{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/panic-buttons-common-hotel-workers-waiting/story?id=66298277", "downloaded_at": "2019-10-20 00:13:05.822472+00:00", "title": "As panic buttons become more common, some hotel workers say they are still waiting", "language": "en", "text": "Fatoumata Bah has worked in the hotel industry since 2001, when she immigrated to the country from Senegal. But she has not received a paycheck since early September when she and 75 colleagues walked off their jobs at a hotel in Boston and began a month-long strike.\n\nTop on the list of their demands: panic buttons.\n\n“One time a guy who was there with his wife grabbed my hand while she stepped out of the room and offered me $5 to fool around and dance,” said Bah.“I just told him that it’s not allowed, that I was just there to do my job. He asked me to not tell his wife.”\n\nOn another occasion, Bah had a dispute with a guest and called her manager, who told her to stay in the room and wait for security. But no one ever came.\n\nIn both cases, Bah said a panic button -- a GPS-enabled device that can alert security -- would have been helpful.\n\n“They do not care about us,” Bah said. “We need the panic buttons to feel safe. I have two kids and I need to be safe at work.”\n\nYasmine Mustafa, CEO of ROAR for Good, the technology company that developed the GPS device for hotel workers, was inspired to create the button after her own experience with sexual assault in the hotel industry.\n\nTed S. Warren/AP, FILE\n\nAccording to Mustafa, about 5,000 sexual harassment complains have been under-reported over the last decade in the hospitality industry.\n\nShe said that 85% of housekeepers are women, \"usually low-income women of color and immigrants,” and that 70% speak English as a second language.\n\n\"The likelihood of harassment increases based on their immigration status and they are less likely to report to avoid conflict or trouble,\" Mustafa said.\n\nMany cities including Chicago, New York City and Washington D.C. already require panic buttons for hotel employees. In June, New Jersey became the first state to mandate the devices, giving protection from sexual harassment to thousands of hotel workers.\n\nA year ago, the American Hotel & Lodging Association announced the 5-Star Promise campaign to encourage hotels to increase sexual assault training and introduce safety devices for their employees.\n\n“As an industry of people taking care of people, we have always been deeply committed to safety and security for our employees and guests. We have a responsibility to ensure they feel safe and secure,” said Chip Rogers, president and CEO of AHLA.\n\nBut hotel employees and their unions say that the progress has been too slow, leaving employees like Bah feeling vulnerable.\n\n“The panic buttons are a relatively low cost to the employers to be able to provide extremely important protection for workers in an industry where sexual harassment and sexual violence is all too prevalent,” said Carlos Aramayo, the secretary-treasurer of Unite Here Local 26, which represents Bah and her colleagues.\n\nThe Battery Wharf Hotel, where Bah works, did not respond to multiple requests for comment.", "description": "Panic button devices have been the most recent push from the #MeeToo movement, giving hotel employees protections from sexual harrasement", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/battery-wharf-hotel-boston-file-gty-jef-191015_hpMain_16x9_992.jpg", "published_at": "2019-10-19"}