{"pub": "washingtonpost", "url": "https://washingtonpost.com/news/powerpost/paloma/the-technology-202/2019/09/16/the-technology-202-facebook-and-youtube-content-pushing-steroids-raises-more-content-policing-questions/5d7e9c0688e0fa7bb93a8b69", "downloaded_at": "2019-09-16 23:12:28.047036+00:00", "title": "The Technology 202: Facebook and YouTube content pushing steroids raises more platform policing questions", "language": "en", "text": "Content moderators work at a Facebook office in Austin, Texas. (Photo by Ilana Panich-Linsman for The Washington Post)\n\nCtrl + N\n\nDrug dealers are using Facebook, YouTube and other social networks to push steroids, raising new concerns about Silicon Valley's content moderation investments as the tech industry faces increasing pressure in Washington.\n\nSteroids and other performance enhancing drugs are illegal to use without a prescription, but researchers say during the first half of the year, they found more than 100 examples of pages or posts pushing these materials. Posts and pages selling or promoting the drugs appeared across a wide range of social media platforms, including Facebook, Twitter, Instagram and YouTube, according to research by Internet safety nonprofit Digital Citizens Alliance and cyberintelligence firm GiPEC shared exclusively with me.\n\nEven as recently as this week, more than a dozen Facebook pages, YouTube videos and an Instagram account were selling or promoting prescription steroid and appearance enhancing drugs were still live on the platforms. After a Washington Post inquiry, the social media companies removed the pages and posts violating their terms of service, which prohibit illegal drug sales.\n\nLawmakers in Washington and around the world are escalating their pressure on social networks to do more to stamp out harmful content on their platforms -- from accounts illegally selling opioids to violent extremism, like the recent videos showing the Christchurch, New Zealand, massacre. Congress is this week expected to scrutinize the tech platforms' content moderation efforts as the Senate Commerce Committee hosts a hearing on \"Mass Violence, Extremism, and Digital Responsibility,\" where executives from Facebook, Twitter and Google will testify about the companies' efforts to remove violent content from their platforms.\n\nUnder pressure, the companies are making greater investments in hiring human moderators and developing artificial intelligence to detect problematic posts. But some say the persistence of accounts pushing illegal steroid sales raises questions about the efficacy of those investments.\n\n\"The model of moderation that platforms use is structurally inadequate to the task,\" Roger McNamee, a Facebook investor who has emerged as one of the most prominent critics of Big Tech, told me. \"It appears that the moderation is not actually designed to eliminate those things, it's designed to eliminate the political blowback.\"\n\nThe technology companies say they are trying to address the issue of problematic content. Facebook said it removes content that violates its policies as it finds it. “Our Community Standards make it very clear that buying, selling or trading drugs, which include steroids, is not allowed anywhere on Pages, in advertising, or anywhere else on Facebook,” said Facebook spokeswoman Crystal Davis.\n\nYouTube said it removed 90,000 videos for violating its “harmful or dangerous policy” in the second quarter of 2019, and the company works closely with experts including emergency room doctors and pediatricians to develop its policies. “We’ve been investing in the policies, resources and products needed to live up to our responsibility and protect the YouTube community from harmful content,” YouTube spokesman Farshad Shadloo said.\n\nTwitter spokeswoman Katie Rosborough pointed to the company’s existing policies, which state Twitter can’t be used for “any unlawful purpose or in furtherance of illegal activities.”\n\nPages, groups and videos pushing steroids could be found through searching for keywords like Human Growth Hormone or Humatrope. Once users land on one of those pages, dealers push using the drugs and may include a way to contact them, like an email address or WhatsApp number.\n\nIn some cases, the content surfaced to researchers as “Suggested Pages” or “Recommended Videos” they might like due to their searches. While YouTube has recently launched features attempting to reduce illicit content, it only works on English-speaking videos. The researchers found suggested steroid videos alongside videos in foreign languages like Arabic, according to screenshots reviewed by The Post.\n\nIn one example, a Facebook page called “Landmarkchem Raw steroid powders,HGH,peptides & semi-finished for sale” offered a variety of steroids via Facebook’s “shop” function, which is intended to help merchants sell products. The researchers contacted Landmark through an email address found on Facebook, and they were offered a wide range of drugs that are supposed to require a prescription, according to emails I reviewed.\n\nThe researchers purchased two vials labeled Human Growth Hormone, a substance that is often abused to enhance muscle mass or athletic performance, and three vials of an anabolic steroid known as Deca Durabolin, which is only available with a prescription due to potential side effects such as liver damage. The researcher paid $360 for the drugs via the PayPal-owned platform Venmo. (Such a transaction violates Venmo’s terms of service). Drug testing showed that the Deca Durabolin appeared to be legitimate, but the HGH was not — leaving questions about what they were sold.\n\nDigital Citizens Alliance director Tom Galvin says the continued presence of steroids on the platforms underscores that the tech companies' approach to content moderation has been too reactionary. He said the companies have been doing more work to stamp out opioid sales following research last year that showed how those drugs were being sold on platforms like Instagram, but he says there hasn't been as much public pressure in recent years for them to address steroid and other performance enhancing drug sales.\n\n\"The platforms tend to only act when faced with pressure, whether that’s advertiser pressure or regulatory pressure,\" Galvin said. \"It’s a game of Whac-a-Mole. They face pressure, they wipe it out, the pressure goes away and the folks creep back in.\"\n\nYou are reading The Technology 202, our guide to the intersection of technology and politics. Not a regular subscriber?\n\nBITS, NIBBLES AND BYTES\n\nTikTok. (Danish Siddiqui/Reuters)\n\nBITS: Researchers worry the rapid rise of app TikTok, best known in the United States for teen-friendly memes and a multi-year marketing deal with the NFL, could bring Chinese-style censorship to U.S. audiences, my colleagues Drew Harwell and Tony Romm report. ByteDance, TikTok's parent company, is based in China, which requires social media companies operating in the country to block news and content that goes against state ideology.\n\nResearchers pointed to Beijing’s use of Douyin, the Chinese-version of TikTok, to spread state propaganda about the recent Hong Kong protests as a key example of how the app is used to manipulate public perception. “They are making the commercial media repost or reproduce what has been produced by state media,\" Yaqiu Wang, a Hong Kong-based researcher for Human Rights Watch, told Drew and Tony. “And they are forcing censorship to create a narrative in the sense that this is not what happened.” On TikTok, Drew and Tony found just 11 posts with hashtags related to the protests, a significantly small amount than the thousands of posts on Facebook and Twitter.\n\nTikTok’s parent company ByteDance, told Drew and Tony it had a U.S.-specific moderation team for the app and did not apply any Chinese laws to its moderation. But researchers still find troubling the limited amount of information the company provides on the removal of U.S. content, especially given China’s recent influence campaigns on Twitter and Facebook. “If they’re willing to do this on Twitter and Facebook, of course they’re going to want to do it on their own platform,” said Elliott Zaagman, a writer and co-host of a popular podcast on the Chinese tech industry.\n\nThe FBI building. (Mandel Ngan/AFP/Getty Images)\n\nNIBBLES: The Senate Intelligence Committee is expected to release a report in the coming weeks on ways to improve U.S. defenses against disinformation in 2020, the Wall Street Journal's Dustin Volz and Deepa Seetharaman report. But a recent meeting between big tech companies and U.S. national security officials highlighted troubling divisions between the 2020 election's two lines of defense against foreign influence and disinformation.\n\nAt the core of the conflict is intelligence agencies' push for information that could put tech companies afoul of mounting government enforcement over privacy violations, they report. Both social media companies and government agencies have increased their efforts to police election disinformation since 2016. But tech companies still remain wary of cooperating with security agencies more than six years after former intelligence contractor Edward Snowden revealed the extent of the industry’s partnerships with government, Dustin and Deepa report.\n\n“This is such a complicated space,” April Doss, a former intelligence lawyer at the National Security Agency, told the Journal. “Our traditional models of public-private interaction really don’t have a template for how to handle this.”\n\nRep. David Cicilline (D-R.I.), left, chair of the House Judiciary antitrust subcommittee, speaks alongside ranking Republican Jim Sensenbrenner (R-Wis) during a House Judiciary subcommittee hearing with representatives from major tech companies in July. (Patrick Semansky/AP)\n\nBYTES: House lawmakers are surveying consumers as part of a wide-ranging investigation into the business practices of Big Tech, Bloomberg News's Spencer Soper reports. The eight-page survey, reviewed by Bloomberg, asks consumers who they consider the top providers of services “such as mobile apps and app stores, search engines, digital advertising, social media, messaging, online commerce and logistics as well as cloud computing” and what they spend with each company, Spencer reports.\n\nWhile the survey doesn’t name any tech companies, the release follows requests to Alphabet, Amazon, Facebook and Apple seeking information about their acquisitions and business. The survey could provide key insights to lawmakers in the House as they weigh how to best enforce and possibly update antitrust regulations with regard to digital competition. “If the panel finds competition is so scant that the customers of big technology companies have no viable alternatives, it justifies further scrutiny of business practices as well as mergers and acquisitions,” Spencer adds.\n\nPUBLIC CLOUD\n\n— News from the public sector:\n\nCongress Is Investigating Apple's Repair Monopoly Part of the antitrust investigation centers on \"Apple's restrictions on third-party repairs.\" Vice\n\nFrance and Germany pledge to fight Facebook’s Libra The two countries say they’ll fight the tech giant’s attempt to ‘claim monetary power.’ Politico\n\nReal-Time Surveillance Will Test the British Tolerance for Cameras Facial recognition technology is drawing scrutiny in a country more accustomed to surveillance than any other Western democracy. The New York Times\n\nAfter Backpage, U.S. Investigates Massage, Escort Websites That Now Dominate Market A year after U.S. authorities closed Backpage.com, the biggest player in the online sex-for-sale industry, investigators are focused on three websites now dominant in the American market and the Swiss businessman who they believe may control them. Wall Street Journal\n\nPRIVATE CLOUD\n\n— News from the private sector:\n\nSnapchat launches political ads library as 2020 election ramps up Snapchat launched a political ads library as the mobile app becomes a campaign tool for 2020 candidates. CNN\n\n#TRENDING\n\n— Tech news generating buzz around the Web:\n\nIt’s a Wrap: MoviePass Ends Theater Subscription Service MoviePass, which gained popularity for attempting to bring a Netflix-style subscription approach to out-of-home entertainment, offered a low price that proved to be unsustainable. Wall Street Journal\n\nCHECK-INS\n\n— Coming soon:\n\nThe Senate Judiciary Committee will host an oversight hearing on the enforcement of antitrust laws Tuesday at 2:30 p.m. Eastern time\n\nThe Senate Commerce Committee will has a hearing on \"Mass Violence, Extremism, and Digital Responsiblity\" with representatives from Facebook, Twitter, and Google on Wednesday at 10 a.m.\n\nThe Senate Judiciary Committee will host a hearing to “explore issues relating to competition in technology markets and the antitrust agencies’ efforts to root out anticompetitive conduct” on September 24.\n\nWIRED IN\n\nTrevor Noah interviews Microsoft's Brad Smith:", "description": "Washington is watching.", "authors": ["Cat Zakrzewski", "Technology Policy Reporter", "September At Am"], "top_image": "https://www.washingtonpost.com/pbox.php?url=https://palomaimages.washingtonpost.com/pr2/a13f196ca758d3862209e27c946fb3a1-3500-2333-70-8-2DJ3TFDLMYI6TO7HDR4Y7OAFGY.jpg&w=1484&op=resize&opt=1&filter=antialias&t=20170517", "published_at": "2019-09-16"}