{"pub": "reuters", "url": "https://reuters.com/article/us-usa-election-south-carolina/in-must-win-south-carolina-biden-must-seal-the-deal-with-black-voters-idUSKBN1W32MZ", "downloaded_at": "2019-09-18 23:32:23.551579+00:00", "title": "In must-win South Carolina, Biden must seal the deal with black voters", "language": "en", "text": "GALIVANTS FERRY, S.C. (Reuters) - A marching band played and several hundred people roared for former U.S. Vice President Joe Biden at a South Carolina country general store this week, a stark contrast to the respectful but less enthusiastic applause given to several of his Democratic presidential rivals.\n\nFILE PHOTO: Democratic U.S. presidential candidate and former Vice President Joe Biden waits to be introduced during the 2019 Presidential Galivants Ferry Stump Meeting in Galivants Ferry, South Carolina, U.S. September 16, 2019. REUTERS/Randall Hill/File Photo\n\nMany voters at the folksy candidate event in tiny Galivants Ferry called Biden, the Democratic front-runner, their top choice to take on Republican President Donald Trump in November 2020.\n\nSouth Carolina, where a majority of Democratic voters are black, represents an important prize for Biden and his rivals for the Democratic nomination. It is one of the first states to hold a nominating contest in the state-by-state battle for the nomination. Among the first four to hold such contests, it is the only state where black voters promise to play a leading role.\n\nBiden currently leads his closest rival in South Carolina, Bernie Sanders, by 25 percentage points, according to a RealClear Politics average of recent polls. But in a potentially worrisome sign, there are questions about the level of enthusiasm among black South Carolina voters for Biden, who served for eight years as vice president under Barack Obama, the first black U.S. president.\n\nEven as supporters defended Biden against criticism over his repeated verbal gaffes on the trail, they voiced concerns that these could hurt his chances long-term and said they were keeping an open mind with five months to go before South Carolina’s Democratic primary.\n\n“Biden struggles with trying to communicate. You can tell the man has a good heart,” said Verlene DeWitt, an African-American retired teacher who serves as a vice chairwoman of the Democratic Party in coastal Horry County. “It worries me.”\n\nBiden, 76, has been questioned by rivals, particularly black U.S. Senators Cory Booker and Kamala Harris, about his record on race. He has had to defend his work with white segregationist senators and opposition to mandatory school busing programs aimed at desegregation in the 1970s as well as his championing of criminal justice legislation in the 1990s that sent black people to prison in disproportionately high numbers.\n\nOf particular concern to some black voters was Biden’s chuckle in response to a serious question on race during a Democratic debate last Thursday and his meandering answer suggesting parents keep a record player - an obsolete technology - on at night to build children’s vocabulary.\n\nBiden remains popular with black voters nationally. A Reuters/Ipsos national poll in August showed a third of black people who identified themselves as Democrats or independents said they would vote for Biden, comfortably ahead of his rivals, with Sanders getting the next highest level of support.\n\nSouth Carolina holds its party primary election on Feb. 29, following nominating contests in Iowa, New Hampshire and Nevada. With six in 10 Democratic voters black, South Carolina is crucial to Biden’s hopes. Iowa and New Hampshire have small numbers of black voters. In Nevada, Latino voters overshadow black voters.\n\nBiden backers in South Carolina said they admire him for his time as Obama’s No. 2 as well as his long experience in Washington and ability to reach out to working-class voters. They also like his policy positions, particularly on healthcare, where he is striking a more moderate tone than candidates to his left who tout Medicare for All proposals with a bigger government role.\n\n‘THINK BEFORE HE TALKS’\n\nBut there is room for improvement, they said.\n\n“He needs to think before he talks,” said Biden supporter Linda Thomas, a 68-year-old black retired banker from Florence, South Carolina.\n\n“Vinyl is coming back now,” quipped her 75-year-old husband Eddie, who is also black, a retired railroad dispatcher and a Biden supporter, in reference to vinyl records for record players.\n\nIn Galivants Ferry, the crowd munching on peanuts and ice cream on a blistering day also heard from U.S. Senator Amy Klobuchar of Minnesota, Mayor Pete Buttigieg of South Bend, Indiana and New York City Mayor Bill de Blasio.\n\nButtigieg, who has had to fend off accusations of systemic racism in his city, spent two days in South Carolina on his latest campaign swing.\n\nAt a town hall event Tuesday in Conway, which drew a largely white audience, Buttigieg outlined his differences with both Biden and Trump. He said Democrats might be making a mistake if they think picking an establishment figure from Washington will deliver the victory over Trump they crave.\n\nSlideshow (2 Images)\n\nJay Fowler, a 36-year-old black man who works in mental-health services, asked Buttigieg about whether he supports paying cash reparations to descendants of slaves. The majority of South Carolina’s 19th century pre-Civil War population was made up of enslaved black people. The state later targeted free blacks with discriminatory laws after the abolition of slavery.\n\nButtigieg said he supports congressional legislation that proposes studying the issue, an answer that underwhelmed Fowler, who has not picked a favored candidate.\n\n“The Democratic Party,” Fowler said, “runs a risk of a lot of us not coming out to vote if these issues aren’t addressed.”", "description": "A marching band played and several hundred people roared for former U.S. Vice President Joe Biden at a South Carolina country general store this week, a stark contrast to the respectful but less enthusiastic applause given to several of his Democratic presidential rivals.", "authors": ["Trevor Hunnicutt", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190918&t=2&i=1431338387&w=1200&r=LYNXMPEF8H1R7", "published_at": "2019-09-18"}