{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7578371/Love-Islands-Vanessa-Sierras-racy-past-TOPLESS-waitress-exposed.html", "downloaded_at": "2019-10-16 06:46:52.999049+00:00", "title": "Love Island's Vanessa Sierra's racy past as a TOPLESS waitress is exposed", "language": "en", "text": "Love Island Australia star Vanessa Sierra's secret past as a topless waitress has been exposed as she competes on the reality TV show in Fiji.\n\nLeaked footage supplied to Daily Mail Australia shows the 25-year-old reality TV star performing a dance completely topless.\n\nAppearing comfortable and confident baring her assets on camera, Vanessa is seen laughing and pouting while putting on the sexy show with another woman.\n\nNaked ambition! Love Island's Vanessa Sierra's racy past as a TOPLESS waitress has been exposed as footage emerges of the brunette performing a saucy dance in just a pair of lacy knickers\n\nVanessa is currently 'coupled up' with Love Island Australia co-star Matthew Zukowski, 24.\n\nDespite using a filter that gave the raven-haired beauty the appearance of a beard, Vanessa is easily recognisable in the video.\n\nHer large distinctive sleeve of tattoos made her clearly identifiable in the clip.\n\nShe's not shy! Leaked footage supplied to Daily Mail Australia shows the 25-year-old reality TV star performing a dance topless with another woman\n\nWhat would Matt think? Vanessa is currently 'coupled up' with Love Island Australia co-star Matthew Zukowski, 24\n\nTatt's definitely Vanessa! The reality TV star's large distinctive sleeve of tattoos made her clearly identifiable in the clip\n\nMan, she feels like a woman! Vanessa chose to use a filter that gave her the appearance of a beard in the seductive clip\n\nVanessa is animated in the clip, posing up a storm in a red pair of lingerie underwear.\n\nHer G-string bottoms showed off her pert derriere, while the design sat high upon her svelte waist with criss-cross straps.\n\nThe French-Australian model, who has a Master's degree in computer science, also wears a pair of over-the-knee heeled boots as she dances with a friend.\n\nAt one point, she drops to the floor and spreads her legs while smiling for the camera.\n\nVanessa has posted numerous topless photos in the past on her Instagram feed, and many other racy bikini and lingerie uploads.\n\nThat's cheeky! Her G-string bottoms showed off her pert derriere, while the design sat high upon Vanessa's svelte waist with criss-cross straps\n\nRacy in red! At one point, Vanessa drops to the floor and spreads her legs while smiling for the camera next to a friend in a matching red ensemble\n\nEarlier this year, Vanessa split with MAFS star Jessika Power's brother Rhyce.\n\nAfter the couple's split, she was then rumoured to be dating Jessika's ex-boyfriend Dan Webb.\n\nVanessa is now searching for love on Love Island Australia, and has so far only been 'coupled up' with Matthew.", "description": "Love Island Australia star Vanessa Sierra's secret past as a topless waitress has been exposed as she competes on the reality TV show in Fiji.", "authors": ["Daily Mail Australia Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/06/19773550-0-image-a-74_1571203240577.jpg", "published_at": "2019-10-16"}