{"pub": "cnbc", "url": "https://cnbc.com/2019/09/26/nintendos-mario-kart-tour-faces-sky-high-analyst-expectations.html", "downloaded_at": "2019-09-26 03:58:18.889214+00:00", "title": "Expectations are 'sky high' for Nintendo's latest Mario mobile game, analyst says", "language": "en", "text": "Character of Nintendo's franchise Mario is seen at a promotional booth for the video game \"Mario & Sonic at the Olympic Games Tokyo 2020\" during the Tokyo Game Show in Makuhari, Chiba Prefecture on September 12, 2019.\n\nFor Nintendo's Mario Kart Tour, a mobile version of its popular racing franchise, one analyst tells CNBC that expectations for the title are \"sky high.\"\n\nOn Wednesday, the highly-anticipated game's launch was marked by server overload. The Mario Kart franchise has been around for more than two decades, consistently ranking among Nintendo's top selling games across its devices going back to at least its DS handheld, according to the latest data published by Nintendo on its investor relations site.\n\n\"For Mario Kart Tour, we think the market expects 10 (million) first-week downloads,\" analysts at Morgan Stanley MUFG Securities wrote in a note earlier in September.\n\n\"The expectations are sky high for Mario Kart Tour because it's such a big (intellectual property) and it's such a big franchise,\" said Serkan Toto, CEO and founder of industry consultancy Kantan Games.\n\nAsymmetric Advisors' Amir Anvarzadeh agreed, telling CNBC that the launch of Mario Kart Tour is \"very, very big.\"\n\n\"Mario Kart will be probably the biggest game title for Nintendo's mobile venture, if you like, ever,\" said Anvarzadeh, a market strategist at Asymmetric Advisors. \"It's always been a multiplayer title that's got everybody involved, it's always been the best-selling of all the titles that Nintendo have sold over the generations.\"\n\n\"What's interesting in this particular game as well is that, you know, you will have a lot of opportunities to spend money on in-game content sales (such as) buying different cars or different characters,\" he said.\n\nHe added that the game is likely to be \"much more profitable\" than Nintendo's past attempts at cracking the mobile gaming space. One analyst had previously described Nintendo's mobile gaming efforts as \"a bit of a mixed bag.\"\n\n\"These games tend to go on and on and on,\" the strategist said, as they have \"longevity\" through the introduction of content such as new levels that will allow developers to \"continue to milk the product.\"", "description": "Mario Kart Tour, part of Nintendo's top-selling franchise of go-kart style racing games, launched for iOS and Android on Wednesday. The series has been around for more than two decades. It has consistently ranked among Nintendo's top selling games across its devices going back to at least its DS handheld, according to the latest data published by Nintendo on its investor relations site.", "authors": ["Eustance Huang"], "top_image": "https://image.cnbcfm.com/api/v1/image/106147740-1569402311970gettyimages-1167451967.jpeg?v=1569402374", "published_at": "2019-09-26"}