{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7578421/SRU-ready-fight-corner-World-Rugby-typhoon-row.html", "downloaded_at": "2019-10-16 05:53:40.316949+00:00", "title": "SRU ready to fight corner with World Rugby over typhoon...", "language": "en", "text": "Scotland are questioning whether World Rugby has the right to charge them over their World Cup typhoon row.\n\nScottish Rugby Union chief executive Mark Dodson sparked an angry response from the governing body last week over his comments ahead of Sunday’s storm-threatened pool clash with Japan in Yokohama.\n\nHe hinted at legal action if the match was called off after revealing he had sought the advice of a top London QC in a bid to force World Rugby to postpone the clash as Typhoon Hagibis closed in.\n\nBut that did not go down well with the tournament organisers, which have now confirmed it will convene a hearing of its independent disputes committee to decide whether the SRU’s “comments and behaviours” are a breach of rules.\n\nThe SRU, however, is ready to fight its corner. A spokesperson said: “Scottish Rugby once again expresses its sincere condolences to the people of Japan and all those affected by Typhoon Hagibis which struck last weekend.\n\n“We have been able to convey our best wishes directly to the mayor of Yokohama and the chairman of the Japanese Rugby Union. We stand with the great people of Japan.\n\nScotland´s World Cup came to an end with a defeat to hosts Japan (David Davies/PA)\n\n“Following receipt of correspondence yesterday from World Rugby, Scottish Rugby confirms that it has received a notice of complaint from Rugby World Cup Ltd. Scottish Rugby is querying whether the matter is an appropriate one for the bringing of misconduct charges.\n\nREAD | RWC 2019 – Scottish Rugby statement.https://t.co/WOSfZZovIf — Scottish Rugby (@Scotlandteam) October 16, 2019\n\n“If misconduct proceedings are to proceed, Scottish Rugby looks forward to receiving a fair hearing in this matter. No further comment would be appropriate at this time.”\n\nDodson called a press conference last Friday to urge World Rugby to use “common sense” and move the game back 24 hours.\n\nAsked if further legal action could be a possible step if the game was scrapped, Dodson said: “I think our view is that we have to reflect on that matter at that time.\n\n“This is a glorious, world-class sporting occasion. We don’t want to be the people that taint that. But we also don’t want to be the collateral damage of this.\n\n“And that’s why we took the legal route. It was just to say we’ve had a different opinion, two different opinions, one from the QC, that challenges that rigidity over scheduling.”\n\nWhat a moment! Japan fans and players celebrate as history is made at #RWC2019 pic.twitter.com/ML7nj3tr3r — Rugby World Cup (@rugbyworldcup) October 13, 2019\n\nHad the game been called off, it would have been declared a draw and Scotland would have been knocked out.\n\nAs it turned out, Hagibis – which resulted in more than two dozen deaths elsewhere in Japan – did not hit Yokohama as bad as predicted and the match was able to proceed as planned.\n\nBut it turned out to be a miserable night for the Scots as they lost 28-21 to the Brave Blossoms and exited the tournament.\n\nNow World Rugby is set to heap more pain on the SRU with the misconduct charges.\n\n“We’ve referred to the independent disputes committee the comments and behaviours of the Scottish Rugby Union,” said World Rugby chief operating officer Alan Gilpin on Monday. “On that basis it’s probably inappropriate to comment any further.”", "description": "World Rugby will look into comments made by SRU chief executive Mark Dodson.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/06/wire-19774152-1571204630-865_636x382.jpg", "published_at": "2019-10-16"}