{"pub": "yahoo", "url": "https://news.yahoo.com/democrats-kick-off-fourth-debate-012015831.html", "downloaded_at": "2019-10-16 01:40:37.283558+00:00", "title": "Democrats kick off fourth debate with call for Trump impeachment", "language": "en", "text": "By Trevor Hunnicutt and Jarrett Renshaw\n\nWESTERVILLE, Ohio (Reuters) - The 12 Democrats meeting in the fourth presidential debate on Tuesday night found a unifying message right off the bat: Republican Donald Trump is a corrupt president and must be impeached.\n\nThe Democrats were unequivocal on impeachment in their first matchup since the launch of a congressional impeachment inquiry into Trump's efforts to pressure Ukraine to investigate leading rival Joe Biden.\n\nBiden, who has led the 2020 Democratic race, joined Senator Bernie Sanders in calling Trump \"the most corrupt president in modern history.\" The former vice president defended his son Hunter's role on the board of a Ukrainian gas company, which has been criticized by Trump and his supporters.\n\n\"My son did nothing wrong. I did nothing wrong,\" Biden said.\n\nSenator Elizabeth Warren, who has surged into a virtual tie with Biden in many Democratic opinion polls, said she called for Trump's impeachment after Special Counsel Robert Mueller's findings on Russia election interference.\n\nCongress did not move to impeach, she said, \"and look what happened: Donald Trump broke the law again.\"\n\nBillionaire environmentalist Tom Steyer, who has poured millions into an impeach-Trump fund since 2017, tipped his hat to his rivals in his first debate.\n\n\"Every candidate here is more decent and coherent and patriotic than that criminal in the White House,\" said Steyer, the last candidate to jump into the race.\n\nWhile all candidates supported the impeachment inquiry, a number warned that could not be Democrats' only message.\n\n\"When we're talking about him we are losing. We need to present a new vision,\" said entrepreneur Andrew Yang.\n\n\"If impeachment is driven by these hyperpartisan interests, it will only further divide an already terribly divided country,\" added Representative Tulsi Gabbard, one of the last to get on board with impeachment.\n\n\n\n\n\nA WARREN PILE-ON\n\nWarren was rewarded for pulling into first place tonight by being attacked by her fellow Democratic candidates.\n\nPete Buttigieg, the South Bend, Indiana, mayor, was the first to turn on Warren after she answered a question about whether taxes would go up under the Medicare for All government healthcare plan by saying “costs” would go up.\n\nThat was \"a yes or no question that didn't get a yes or no answer,” Buttigieg said, then went on to criticize Medicare for All in general.\n\nBernie Sanders, the Vermont senator, chimed in with, \"As somebody who wrote the damn bill ... At the end of the day the overwhelming majority of people will save money on their healthcare bills.\" But, he added \"I do think it’s appropriate to acknowledge that taxes will go up.\"\n\nThen Amy Klobuchar, the senator from Minnesota, piled on, telling Warren, \"You are making Republican talking points.” She added: “The difference between a plan and a pipedream is something that you can get done.”\n\nWithin seconds, the Trump campaign had put out a press release criticizing Warren's answer. So had Buttigieg.\n\n\n\n\n\n(Reporting by Trevor Hunnicut, Jarrett Renshaw, Sharon Bernstein, Amanda Becker, Doina Chiacu; Editing by Sonya Hepinstall)", "description": "The 12 Democrats meeting in the fourth presidential debate on Tuesday night found a unifying message right off the bat: Republican Donald Trump is a corrupt president and must be impeached.  The Democrats were unequivocal on impeachment in their first matchup since the launch of a congressional impeachment", "authors": ["Trevor Hunnicutt", "Jarrett Renshaw"], "top_image": "https://s.yimg.com/uu/api/res/1.2/SylaNKg1z9IzdxkhOVLFLA--~B/aD0yOTk7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/06e6ca1c98c81422fec7b91a019a819a", "published_at": "2019-10-16"}