{"pub": "businessinsider", "url": "https://businessinsider.com/trump-isis-al-baghdadis-death-more-significant-than-bin-ladens-2019-10", "downloaded_at": "2019-10-28 00:33:05.230803+00:00", "title": "Trump claims the killing of ISIS leader al-Baghdadi is more significant than Osama bin Laden's assassination", "language": "en", "text": "President Donald Trump claimed that the Saturday killing of ISIS leader Abu Bakr al-Baghdadi was more significant than the assassination of al-Qaeda leader Osama bin Laden under President Barack Obama.\n\n\"This is the biggest there is. This is the worst ever,\" Trump said. \"Osama bin Laden was big, but Osama bin Laden became big with the World Trade Center. This is a man who built a whole, as he would like to call it, a country.\"\n\nTrump again falsely claimed that he \"predicted\" the threat Bin Laden posed to the US before 9/11 in his 2000 book, \"The America We Deserve.\"\n\nThe president falsely suggested to reporters on Sunday that if the US government had \"listened to me\" in 2000, 9/11 wouldn't have happened.\n\nIn fact, Trump made just one passing reference in his book to Bin Laden, who was then well-known as one of the most dangerous terrorists in the world.\n\nRead more stories like this on Business Insider.\n\nPresident Donald Trump claimed that the Saturday killing of ISIS leader Abu Bakr al-Baghdadi by US forces was more significant than the US assassination of al-Qaeda leader Osama bin Laden under former President Barack Obama during a Sunday morning press conference.\n\n\"This is the biggest there is. This is the worst ever,\" Trump said. \"Osama bin Laden was very big, but Osama bin Laden became big with the World Trade Center. This is a man who built a whole, as he would like to call it, a country, a caliphate, and was trying to do it again.\"\n\nUS forces killed bin Laden, the mastermind of the 9/11 terrorist attacks, in a 2011 raid in Pakistan under Obama's watch.\n\nAnd Trump again falsely claimed that he \"predicted\" the threat Bin Laden posed to the US before 9/11 in his 2000 book, \"The America We Deserve.\" He suggested to reporters on Sunday that if the US government had \"listened to me,\" 9/11 wouldn't have happened.\n\n\"I wrote a book, a really very successful book, I said, there is somebody named Osama Bin Laden, you better kill him or take him out, something to that effect, he's big trouble,\" the president said on Sunday morning. \"And I'm saying to people, take out Osama bin Laden, that nobody ever heard of ... nobody listened to me ... let's put it this way, if they'd listened to me, a lot of things would've been different.\"\n\nThe president also tweeted that false claim last November.\n\n\"Of course we should have captured Osama Bin Laden long before we did. I pointed him out in my book just BEFORE the attack on the World Trade Center,\" the president tweeted on November 19, 2018. \"President Clinton famously missed his shot. We paid Pakistan Billions of Dollars & they never told us he was living there. Fools!\"\n\nAnd on the campaign trail in 2015, Trump also falsely claimed that he urged the US government to \"take him out, referring to Bin Laden, before he \"crawl[s] under a rock.\"\n\nIn fact, Trump made just one passing reference to Bin Laden in his book, which was more than 300 pages long. At the time, Bin Laden was well-known as one of the world's most dangerous terrorists and, as Trump wrote, had been pursued by US forces.\n\n\"One day we're all assured that Iraq is under control, the U.N. inspectors have done their work, everything's fine, not to worry. The next day the bombing begins,\" Trump wrote. \"One day we're told that a shadowy figure with no fixed address named Osama bin Laden is public enemy number one, and U.S. jet fighters lay waste to his camp in Afghanistan. He escapes back under some rock, and a few news cycles later it's on to a new enemy and new crisis.\"", "description": "Trump claimed that the killing of ISIS leader Abu Bakr al-Baghdadi was a bigger deal than the killing of Osama bin Laden.", "authors": ["Eliza Relman"], "top_image": "https://image.businessinsider.com/5db5c62ddee01953752b1f05?width=1200&format=jpeg", "published_at": "2019-10-27"}