{"pub": "breitbart", "url": "https://breitbart.com/the-media/2019/10/08/joker-faces-backlash-for-using-song-from-convicted-pedophile-gary-glitter", "downloaded_at": "2019-10-08 16:22:37.908191+00:00", "title": "‘Joker’ Faces Backlash for Using Song from Convicted Pedophile Gary Glitter", "language": "en", "text": "Some of the moviegoers who flocked to see Joker over the weekend aren’t smiling about the film’s prominent use of a song by convicted pedophile Gary Glitter on the soundtrack.\n\nThe Warner Bros. blockbuster features Glitter’s “Rock and Roll Part 2” — widely known as the “Hey Song” — in a key scene in which the title character (played by Joaquin Phoenix) dances down a flight of stairs in the fictional Gotham City.\n\nGary Glitter stands to profit from Joker through royalties and other ancillary payments that songwriters typically receive when they license their music for others to use in a movie or TV show.\n\nWhile “Rock and Roll Part 2” is frequently played at live sports events and has been featured on the soundtrack to numerous TV shows, the song’s inclusion in Joker has sparked social media outrage.\n\nThe backlash appears to have started with an article in the British tabloid The Sun, which noted that Glitter had earned an estimated £1million of royalties after Oasis sampled some of his lyrics.\n\nREALLY? convicted Pedo Gary Glitter is to recieve royalties for the Joker movie….and its a LOT of money. RETWEET if you think there should be a law against Pedos working in hollywood after conviction or benefitting from their parts.https://t.co/wJduoJKw7g — MARFOOGLE NEWS (@Marfoogle) October 7, 2019\n\nGlitter, a former glam rock super star, was sentenced to 16 years in British jail in 2015 for attempted rape, four counts of indecent assault and one count of having sex with a girl under 13. His legal woes also include a prison sentence in Vietnam stemming from sex offenses involving underage girls.\n\nJoker grossed a record-breaking $93.5 million domestically on its opening weekend and has so far brought in nearly $246 million around the world.\n\nFollow David Ng on Twitter @HeyItsDavidNg. Have a tip? Contact me at dng@breitbart.com", "description": "Some of the moviegoers who flocked to see Joker over the weekend aren't smiling about the film's prominent use of a song by convicted pedophile Gary Glitter on the soundtrack.", "authors": ["David Ng"], "top_image": "https://media.breitbart.com/media/2019/10/garyglitter1-640x335.jpg", "published_at": "2019-10-08"}