{"pub": "foxnews", "url": "https://foxnews.com/media/judge-napolitano-trump-shouldnt-divert-from-serious-ukraine-allegation", "downloaded_at": "2019-09-24 13:42:12.949633+00:00", "title": "Judge Napolitano: Trump shouldn't divert from 'serious' Ukraine allegation", "language": "en", "text": "Fox News' Judge Andrew Napolitano appeared on \"Your World with Neil Cavuto\" Monday and advised President Trump that he shouldn't dismiss the serious allegation of \"political corruption\" levied against him.\n\n\"The president should not be diverting attention from the most serious allegation made against him, far more serious than anything ... Bob Mueller did, which is an act of political corruption in the ... formulation of foreign policy,\" Napolitano told guest host Charles Payne.\n\nEarlier Monday, Napolitano told David Asman on Fox Business that the allegations against the president were the \"most serious charge\" to be levied against him.\n\nPayne asked Napolitano if the president should release a transcript of the phone call that sparked the whistleblower complaint.\n\nNEW DETAILS REPORTED ON TRUMP-UKRAINE CALL AS DEMS CLASH WITH WHITE HOUSE ON COMPLAINT\n\n\"I think it would be a great idea. It will either exonerate him or make things worse,\" Napolitano said.\n\nNapolitano also walked back analysis he made to Asman regarding former Vice President Joe Biden and his son Hunter's dealings with Ukraine.\n\nThe judge told Asman earlier that the Biden's presidential aspirations were likely done. Napolitano told Payne he was wrong.\n\n\"I since have learned that most of Europe wanted this prosecutor to go, that he was an agent of corruption. He was not rooting out corruption,\" Napolitano claimed.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Before and after this prosecutor was gone, the Ukrainian people, the Ukrainian government, for what their credibility is worth, decided there was no case. There was no 'there' there.\"", "description": "Fox News' senior judicial analyst Judge Andrew Napolitano appeared on \"Your World with Neil Cavuto\" Monday and advised President Trump to not divert attention from the serious allegation of \"political corruption.\"", "authors": ["Victor Garcia"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Trump-Nap_AP-FOX.jpg", "published_at": "2019-09-24"}