{"pub": "nymag", "url": "https://vulture.com/2019/09/gwyneth-paltrow-harvey-weinstein-investigation.html", "downloaded_at": "2019-09-09 23:18:02.928482+00:00", "title": "Gwyneth Paltrow Was Crucial to Launching the Harvey Weinstein Investigation", "language": "en", "text": "Gwyneth Paltrow. Photo: Steve Granitz/WireImage\n\nGwyneth Paltrow rose to stardom with her roles in Harvey Weinstein–backed films like Emma and Shakespeare in Love. Years later, she’d become one of the first to expose the sexual-misconduct allegations against him. Megan Twohey and Jodi Kantor, the New York Times reporters who investigated Harvey Weinstein’s alleged sexual misconduct, shared a story on the Today show about one crucial source: Paltrow herself. Their book She Said: Breaking the Sexual Harassment Story That Helped Ignite a Movement, which debuts this week, features Paltrow’s help in kicking off the investigation.\n\n“Gwyneth [Paltrow] was actually one of the first people to get on the phone and she was determined to help this investigation even when Harvey Weinstein showed up to a party at her house early and she was sort of forced to hide in the bathroom.” -@mega2e pic.twitter.com/cDizgIn3V7 — TODAY (@TODAYshow) September 9, 2019\n\n“Gwyneth Paltrow is one of Harvey’s biggest stars, and he had really kind of presented himself as kind of a godfather to her over the years,” Twohey said on Monday. “I think that many people will be surprised to discover that when so many other actresses were reluctant to get on the phone and scared to tell the truth about what they had experienced at his hands, that Gwyneth was actually one of the first people to get on the phone, and that she was determined to help this investigation — even when Harvey Weinstein showed up to a party at her house early and she was sort of forced to hide in the bathroom.” From there, she called Twohey and Kantor, asking what to do. “I think Harvey Weinstein was extremely aware and extremely scared of what the implications would be if his biggest star actually ended up going on the record,” Twohey added. Although Paltrow didn’t initially go on the record, she later revealed her own encounters with Weinstein alongside Angelina Jolie. Twohey and Kantor’s book, She Said, arrives September 10 and contains even more revelations about the investigation that took down Harvey Weinstein.", "description": "Actress Gwyneth Paltrow was one of the first to “tell the truth” about Harvey Weinstein, say NYT reporters Megan Twohey and Jodi Kantor.", "authors": ["Zoe Haylock"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/09/recaps/09-gwyneth-paltrow.w1200.h630.jpg", "published_at": "2019-09-09"}