{"pub": "abcnews", "title": "Trump points to ‘mental problem’ after Texas rampage Video", "url": "https://abcnews.go.com/WNT/video/trump-points-mental-problem-texas-rampage-65347969", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:55:52.660709+00:00", "text": "Transcript for Trump points to ‘mental problem’ after Texas rampage\n\nPresident trump monitoring the deadly mass shooting and this massive hurricane and making news with what he said about both. Our chief white house correspondent Jonathan Karl on the questions for the president after another mass shooting in America. Reporter: After the mass shootings last month in El Paso, Texas, and Dayton, Ohio, the president vowed to improve background checks required to buy a gun. There's a great appetite, and I mean a very strong appetite, for background checks. Reporter: But after another mass shooting this weekend, the president has changed his tune. Well, we're looking at a lot of different things, we're looking at a lot of different bills, ideas, concepts. It's been going on for a long while. Background checks. For the most part, as strong as you make your background checks, they would not have stopped any of it. Reporter: The president made those remarks Sunday, shortly before he received a FEMA briefing on hurricane Dorian. He marveled at the size of the hurricane. I'm not sure that I've ever I even heard of a category 5. I knew it existed and I've seen some category 4s, you don't seven' them that much, but the category 5 is something that I don't know that I've ever even heard the term. Reporter: In fact, there have been several category 5 hurricanes since he became president. He also misstated the storm's possible trajectory. And it may get a little piece of a great place it's called Alabama and Alabama could even be in for at least some very strong winds and something more. And so, for Alabama, just please be careful, also. Reporter: Not long after that, the national weather service corrected the president, saying, \"Alabama will not see anymore impacts from Dorian.\" The president, who canceled a trip to Poland in order to monitor the storm, spent much of today at his golf club in Virginia. CNN capturing these images of him playing golf. We haven't heard anything from the president about the hurricane since that FEMA briefing yesterday, but white house press secretary Stephanie Grisham says that he has been getting updates every hour all day long, presumably, David, including while he was playing golf. Jon Karl with us on this labor day. Jon, thank you.\n\nThis transcript has been automatically generated and may not be 100% accurate.", "description": "After the president received a FEMA briefing on Hurricane Dorian, he marveled at the size of the storm, saying he hadn’t “even heard of a Category 5” hurricane.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/WNT/190902_wn_karl3_644_hpMain_16x9_992.jpg"}