{"pub": "investingcom", "url": "https://investing.com/news/stock-market-news/chinas-industrial-profits-fall-2-yearonyear-in-august-1987493", "downloaded_at": "2019-09-27 02:44:17.594113+00:00", "title": "China's August industrial profits fall as headwinds hit firms", "language": "en", "text": "© Reuters. Workers are seen at a production line manufacturing tyres at a factory in Nantong, Jiangsu\n\nBy Stella Qiu and Gabriel Crossley\n\nBEIJING (Reuters) - Profits at China's industrial firms contracted in August after a brief gain the previous month, suggesting renewed pressure on corporate balance sheets as domestic demand remains weak and the trade war with the United States drags on.\n\nIndustrial profits fell 2% in August from year earlier to 517.8 billion yuan ($72.59 billion), according to data released by the National Bureau of Statistics (NBS) on Friday. That compared with a 2.6% gain in July.\n\nIndustrial profits have been slowing since the second half of 2018, despite some transitory rebounds, with falling factory-gate prices threatening to further knock profits as economic growth skidded to a near 30-year low.\n\nProducer prices, one key barometer of domestic demand and indicative of profitability, posted their sharpest fall in three years last month.\n\nFor January-August, industrial firms earned profits of 4.02 trillion yuan, down 1.7% year-on-year, same as the reading in the first seven months.\n\nThe contraction in August was mainly due to slowing sales and falling producer prices, Zhu Hong, an official with the statistics bureau, said in a statement accompanying the data.\n\nAugust's weak industrial profits was in line with grim readings on demand both at home and abroad.\n\nGrowth in China's industrial production fell to its weakest in 17-1/2 years in August while exports tumbled amid spreading pain from the trade war and softening domestic demand.\n\nAnalysts expect economic growth could cool further this quarter from a near 30-year low of 6.2% hit in April-June.\n\nTop U.S. and China trade negotiators are expected to meet in Washington in about two weeks to determine if they can chart a path out of the bruising trade war.\n\nIndustrial firms' liabilities increased 5.0% from a year earlier to 65.81 trillion yuan at end-August, compared with a 4.9% increase in July.\n\nPrivate sector profits rose 6.5% in January-August, slowing from a 7.0% growth in the first seven months.", "description": "China's August industrial profits fall as headwinds hit firms", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8Q05R_L.jpg", "published_at": "2019-09-27"}