{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7617313/Strictlys-Karen-Hauer-amuses-fans-ripping-wig-finish-samba-Chris-Ramsey.html", "downloaded_at": "2019-10-27 01:00:56.120886+00:00", "title": "Strictly's Karen Hauer amuses fans by ripping off her wig to finish a samba with Chris Ramsey", "language": "en", "text": "Strictly stars have wowed the audience with their Halloween-inspired routines during another week of the dancing show.\n\nAnd Karen Hauer made sure her dance was one to remember when she ripped off her wig as she finished a spooky samba routine with Chris Ramsey on Saturday's show.\n\nThe professional, 37, amused fans with her 'wig drop' with some praising her for managing to complete the dance with it.\n\nWig drop! Karen Hauer, 37, left fans entertained when she ripped off her wig after finishing a spooky samba routine with Chris Ramsey on Saturday night\n\nAfter finishing their dance to Backstreet's Back, for which they scored 23 points leaving them at the bottom of the leader board, Karen was span around on the floor.\n\nAs she came to a stop the dancer struck a pose and put her hands up before lifting the white wig from her head and throwing it to the side.\n\nChris appeared entertained by his dancing partner's move and seemed to smile as he fell back onto the dancefloor.\n\nSpooky samba: The pair scored 23 points leaving them at the bottom of the leader board\n\nStrictly fans were quick to laugh about the moment, with one saying 'Karen lost her wig and so did I after that dance' on twitter and another simply writing 'Karen losing her wig' with laughing emojis.\n\nSomeone else said 'THAT WIG .. been hanging off since the first beat' and another joked 'Karen drop-kicks her wig... wanting a place at the Rugby World Cup?'\n\nWhile one person said: 'What a fab samba! The wig flying off was hilarious it has done me, I'm dead.'\n\nFright night: During the dance Karen's wig, pictured, could be seen starting to slip off her head\n\nWhat an ending: Karen collected her wig from the floor before heading over to the judges\n\nDancing duo: The dancer tweeted about her unusual finish and praised partner Chris\n\nOther Strictly fans praised Karen for keeping the wig on her head for so long. One said: 'Props to @Karen_hauer for putting up with that wig for as long as she did.'\n\nAnd another agreed writing: 'Karen worked bloody miracles to make sure that wig didn’t fully come off during the dance.'\n\nKaren also mentioned the moment on her own Twitter account, saying: 'Wig drop! Proud of you Ramsey . You rock buddy @IAmChrisRamsey'\n\nHilarious: Dozens of people said they thought the moment was 'hilarious'\n\nJoke: One person praised Karen for her kicking skills after she launched the wig off the floor\n\nThe judges appeared to be quite impressed with Karen and Chris' performance on Saturday night, even with the comic moment.\n\nShirley Ballas said: There was a few mistakes here and you there and you got off the wrong foot a couple of times. You have to push yourself a little bit, but you had lots of content.'\n\nWhile Bruno Tonioli said: 'I don't think I've ever seen anything so good in a horrible way ever before.\n\nAll dressed up: Karen and Chris went for a zombie-inspired look during Halloween week\n\nImpressed: Some were impressed that Karen managed to keep the wig on while she dancing\n\n'Somehow the whole thing worked in a spooky way, you have to remain constant, timing timing timing.'\n\nHowever Craig Revel Horwood was particularly scathing, telling the pair: 'You did look like you came back from the death - I felt like your joints needed some WD40.'", "description": "Professional dancer Karen Hauer, 37, amused fans with her 'wig drop' after she finished dancing a samba to the Backstreet Boys with Chris Ramsey on Saturday night.", "authors": ["Bryony Jewell For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/21/20224926-0-image-a-81_1572121491305.jpg", "published_at": "2019-10-26"}