{"pub": "hotair", "url": "https://hotair.com/archives/ed-morrissey/2019/10/09/graham-syria-withdrawal-trumps-pre-9-11-mentality-will-return-isis-slaughter-kurds", "downloaded_at": "2019-10-10 00:45:29.497461+00:00", "title": "Graham on Syria withdrawal: Trump’s “pre-9/11 mentality” will own the return of ISIS and slaughter of the Kurds", "language": "en", "text": "Lindsey Graham won’t let the Syria withdrawal proceed without a fight — and on Donald Trump’s favorite morning-show turf. Trump’s key ally in the upcoming impeachment fight appeared earlier on Fox & Friends, telling an equally unhappy Brian Kilmeade that Trump had a “pre-9/11 mentality” similar to Barack Obama’s, and just like Obama, Trump would end up owning a resurgence of ISIS in the region following this bug-out. Graham wants Trump to reverse himself again and get back to the safe-zone operation that kept the Kurds separated from the border with Turkey:\n\n“That’s a pre-9/11 mentality that the Middle East is no concern to us,” Graham told Fox News. “I hope President Trump’s right. I hope we can turn the fight against ISIS over to Turkey. I hope that Turkey, when they go into Syria, they won’t slaughter the Kurds… If [Trump] follows through with this, it’d be the biggest mistake of his presidency.” He claimed that if Trump doesn’t continue with safe zone border patrols, ISIS will fill the void and the fault will lie squarely with the Trump administration. “I would argue for him to go back to the status quo,” Graham said. “The safe zones were working. Patrolling with Turkey and international forces to protect the Kurds and Turkey is the way to go. If we pull out, the Kurds are in a world of hurt and ISIS comes back, and President Trump will own it.”\n\nKilmeade’s comments were even more scathing. “General Rand Paul was pleased,” Kilmeade snarked, although Graham insisted that Paul wasn’t the issue. Shortly after, Kilmeade declared more seriously, “Don’t say you’re a friend of Israel and allow them to be surrounded by Iran, because that’s exactly what’s going to happen.” While Graham tried to interject, Kilmeade added, “You might as well take out of your speech that you defeated the caliphate — because it’s coming right back.”\n\nTough stuff on what has been the friendliest venue for Trump short of Hannity in prime time. Graham’s hardly alone on this, either. The Hill collected more responses from Trump’s allies on Capitol Hill, and it’s far from complimentary:\n\nTrump’s decision, seen as enabling Turkey to go after Kurds in Syria, was lambasted by Trump loyalists such as Rep. Liz Cheney (Wyo.), the third-ranking House GOP leader, and Republicans who have differed with the president on policies, such as Sen. Mitt Romney (Utah). Cheney called the decision a “catastrophic mistake” and Romney characterized it as a “betrayal” of Kurdish allies that would show “America is an unreliable ally.” Sen. Ron Johnson (R-Wis.), one of Trump’s most ardent defenders in the Senate, said he agrees with the president that the United States should not be the world’s policeman but warned that “abandoning the Kurds” would send a “terrible signal to America’s allies and adversaries” and would be “unconscionable. The broad-based backlash left some in the GOP hoping Trump would reverse himself, something Sen. Bill Cassidy (R-La.) on Tuesday raised as a possibility. “I understand he’s reconsidering. I do not think we should abandon the Kurds,” he told a reporter for Politico.\n\nEr … nope:\n\nFighting between various groups that has been going on for hundreds of years. USA should never have been in Middle East. Moved our 50 soldiers out. Turkey MUST take over captured ISIS fighters that Europe refused to have returned. The stupid endless wars, for us, are ending! https://t.co/Fbcem9i55Z — Donald J. Trump (@realDonaldTrump) October 9, 2019\n\nSenate Republicans have “found their voices” against Trump on this policy, the New York Times reported last night, even if it hasn’t yet crossed over to the impeachment fight:\n\nHe and other Republicans joined Democrats in saying that the move could potentially clear the way for a Turkish offensive against Kurdish fighters who have helped the United States root out the Islamic State. Mr. Graham also delivered what could be considered the ultimate insult to Mr. Trump: comparing his Syria policy to that of his predecessor, Barack Obama. When it comes to foreign policy, many senators have spent considerable time developing their expertise, making repeated trips to the Middle East and other hot spots and becoming deeply invested in their positions. They feel confident expressing their opinion, even when it is quite contrary to Mr. Trump’s. “Many of us have been dealing with this for a decade or two decades, and I think there are a lot of visits to the area and a lot of discussions that stand behind our views on these issues,” said Senator Roy Blunt, Republican of Missouri, who had previously counseled the White House on the necessity of maintaining forces in Syria. “This is an area where it has been a consistent concern that leaving those places would create bigger problems than staying.”\n\nAnd the damage might go even farther, into Trump’s core constituency:\n\nTruly remarkable that Trump, facing impeachment, decided this was the time to make a FP move calculated to alienate his most stalwart evangelical supporters:https://t.co/Pic3wTN8pk — Ross Douthat (@DouthatNYT) October 9, 2019\n\nNeedless to say, this was a strange time for Trump to pick a foreign policy fight with his own party, especially in the chamber that will have to handle articles of impeachment, if the House approves them. This decision alone might not be enough for Republicans to commit electoral hara kiri by going along on removal, but the arbitrary manner in which Trump made this decision and his lack of consultation with his allies on Capitol Hill might leave them less than enthusiastic about his defense, as I note in my column at The Week:\n\nIf anything, Trump chose the wrong theater of war from which to retreat. While America’s strategic interests in Afghanistan are now limited at best, this isn’t the case in Syria, where the U.S. has critical strategic interests, especially in containing Iran. The Kurds in Syria are not just the front line against ISIS, but also our partners in monitoring and frustrating Iranian-backed Shi’ite militias in the region. Iran’s partnership with Syrian President Bashar al-Assad presents a considerable threat to Sunni Arab nations including Saudi Arabia, which just suffered a missile attack that originated in Iran. Add to that the existential threat that Iranian hegemony represents to our ally Israel, and it’s easy to see why Trump’s near-whimsical decision rattled Republicans, especially in the Senate. … This decision alone won’t convince 20 Republicans to cross the aisle on a removal vote, of course. In part, that is because Trump tried this once before, and his impatience in Syria was well known. However, the seemingly capricious manner in which this decision was made and the damage it does to American credibility with needed partners in the fight against radical Islamist terrorism cannot help but raise doubts about Trump’s leadership with the very people Trump needs to help him preserve it.\n\nThis is a moment in which Trump should be shoring up his political alliances, not severing them in pursuit of a highly questionable policy that puts our regional allies under threat and our counterterrorism partners at risk of annihilation.", "description": "\"It'd be the biggest mistake of his presidency.\"", "authors": ["Ed Morrissey", "Jazz Shaw", "John Sexton"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/10/kilmeade-graham.png", "published_at": "2019-10-09"}