{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-ukraine-privatbank/ukraine-leader-seeks-settlement-with-former-privatbank-owner-paper-idUKKBN1W20HR", "downloaded_at": "2019-09-17 08:29:55.047806+00:00", "title": "Ukraine leader seeks settlement with former PrivatBank owner - paper", "language": "en", "text": "FILE PHOTO: Ukrainian President Volodymyr Zelenskiy delivers a speech during the Yalta European Strategy (YES) annual meeting in Kiev, Ukraine September 13, 2019. Ukrainian Presidential Press Service/Handout via REUTERS\n\nKIEV (Reuters) - Ukraine’s President Volodymyr Zelenskiy wanted to reach a settlement with the former owner of the country’s largest bank, PrivatBank, the Financial Times newspaper quoted Ukrainian Prime Minister Oleksiy Honcharuk as saying.\n\n“I’m completely convinced that we need to concentrate on growth now and look for joint solutions instead of spending our resources on destroying each other,” he said in an interview.\n\n“So I am very positive about any rhetoric directed towards searching for a compromise.”\n\nHoncharuk’s comments followed a statement by the former owner of PrivatBank, Ihor Kolomoisky, on Friday, saying there was room for an amicable solution now that Zelenskiy was president.\n\nPrivatBank was nationalised against Kolomoisky’s wishes in December 2016 and its fortunes are closely watched by investors, because the International Monetary Fund may freeze aid to Ukraine if the nationalisation were to be reversed.\n\nThe statements by Kolomoisky and Honcharuk come as an IMF mission is in town to discuss a new aid-for-reforms deal with Honcharuk’s government, which took charge following a snap July election.\n\nHoncharuk and his office did not immediately respond to a request for comment.", "description": "Ukraine's President Volodymyr Zelenskiy wanted to reach a settlement with the former owner of the country's largest bank, PrivatBank, the Financial Times newspaper quoted Ukrainian Prime Minister Oleksiy Honcharuk as saying.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190917&t=2&i=1430722370&w=1200&r=LYNXMPEF8G0DC", "published_at": "2019-09-17"}