{"pub": "yahoo", "url": "https://sports.yahoo.com/us-fighter-day-coma-vicious-ko-report-061309055--box.html", "downloaded_at": "2019-10-13 09:56:32.237674+00:00", "title": "US fighter Day in coma after vicious KO: report", "language": "en", "text": "Los Angeles (AFP) - American Patrick Day was in a coma after suffering a serious head injury Saturday night following a vicious knockout by unbeaten Charles Conwell during a boxing card in Chicago, US media reported.\n\nThe 27-year-old Day was unconscious when he was taken from the ring in a stretcher and loaded onto a waiting ambulance at the Wintrust Arena. Fight broadcaster DAZN said Day suffered a seizure in the ambulance and needed a breathing tube once he arrived at the hospital.\n\nUS sports broadcaster ESPN reported that Day had emergency brain surgery and went into a coma, but did not say whether he fell into the coma or it was induced by the doctors.\n\nScroll to continue with content Ad\n\nNo details of the head injury were given and the promoter, Matchroom Boxing, did not issue a statement on Saturday night other than to say Day was transported to a local hospital.\n\n\"Please pray for Pat!! Come home safe!,\" Conwell wrote on his social media Twitter account following the fight.\n\nConwell, a 2016 American Olympian, was dominating the super welterweight fight dropping Day in the fourth and eighth rounds and then landed a right hand in the 10th which caused Day to stumble.\n\nSeconds later he rocked Day with a massive left hook that resulted in Day falling backwards and his head bouncing off the canvas. Referee Celestino Ruiz called off the fight at one minute, 46 seconds of the round.\n\nDay lay on the canvas for several minutes while receiving medical treatment before being removed from the ring.\n\nDay was coming off a loss in June to Carlos Adames in New York. He has 17 wins and four losses and one draw in his pro career which began in 2013.\n\nDay was fighting on the undercard of Russian Dmitry Bivol's World Boxing Association light-heavyweight world title defence against Lenin Castillo.", "description": "American Patrick Day was in a coma after suffering a serious head injury Saturday night following a vicious knockout by unbeaten Charles Conwell during a boxing card in Chicago, US media reported.  The 27-year-old Day was unconscious when he was taken from the ring in a stretcher and loaded onto a waiting", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/6..T21PrWFAdHO8tAwxIhg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/a76IYT49FwwkiULDrFKuLg--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/c6b11ffb2678665f45cc245c530c094946b3432d.jpg", "published_at": "2019-10-13"}