{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/trump-says-immigrants-are-unwelcome-in-minnesota-whats-unwelcome-is-his-bigotry/2019/10/11/e607feba-ec62-11e9-9c6d-436a0df4f31d_story.html", "downloaded_at": "2019-10-13 00:18:20.827064+00:00", "title": "Trump says immigrants are unwelcome in Minnesota. What’s unwelcome is his bigotry.", "language": "en", "text": "Telegraphing what is certain to be among his favorite refrains in the 2020 campaign, Mr. Trump remarked on the “impact” of Minnesota’s 50,000 Somalis, who began arriving there a quarter-century ago as refugees and now represent roughly 1 percent of the state’s population. Referring to an executive order he issued recently, the president said he will prohibit refugee resettlements unless states and cities expressly consent to them.\n\n“Believe me,” he said of his policy to grant communities what amounts to a veto on refugee resettlement, “no other president would be doing that.”\n\nAD\n\nAD\n\nThe president has made no secret of his dislike generally for refugees, having slashed by 85 percent the annual cap on their admission, or specifically those from Somalia, which is among the mainly Muslim countries listed in his travel ban. Just before Election Day in 2016, he told Minnesotans they had “suffered enough,” suggesting that inadequate vetting was to blame for the influx of refugees there.\n\nIn truth, the fact that so many Somalis wound up in Minnesota — many resettled there by Lutheran and Catholic charities — owes much to the generally hospitable reception they received there, as had Hmong refugees from Southeast Asia who came to the state following the Vietnam War.\n\nAbout 23,000 Somalis arrived in Minnesota directly as refugees; many others moved there based on word of mouth about job opportunities and decent treatment. The vast majority of them are employed in the state, whose unemployment rate of 3.3 percent is below the national average.\n\nAD\n\nAD\n\nThe presence of large numbers of Somalis has caused strains in some Minnesota towns, as have other recently arrived immigrant communities in other states throughout U.S. history. Notwithstanding his boast that “no other president” would enable states and cities to bar refugees, Mr. Trump fits a long lineage of Americans who snarled at newcomers — think of the Know-Nothings of the 1840s, who derided Catholics coming from Europe; of Father Charles Coughlin, who used his radio program as a pulpit from which to attack Jews and other immigrants starting in the 1930s; or of the assortment of everyday citizens who disparaged Irish, Italian, German and other newcomers a century ago.\n\nThe story of America is a story of immigrants — not always pretty, rarely without friction. Tolerance and intolerance have jostled for advantage, as they do today even with a paragon of intolerance in the Oval Office. Fortunately, the resistance to his hatefulness remains strong. Almost immediately after Mr. Trump thundered that communities would have to grant consent before refugees could be resettled, the mayor of Minneapolis, Jacob Frey, tweeted his riposte: “Consent given. Immigrants and refugees are welcome in Minnesota.”\n\nRead more:\n\nAD", "description": "The president demands “consent.” Minneapolis’s mayor grants it.", "authors": ["Editorial Board"], "top_image": "https://www.washingtonpost.com/resizer/ej8h4eJvSv-NuultfXYIC6Svn6U=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CZVKENXMOQI6THDNINVA35HTDU.jpg", "published_at": "2019-10-11"}