{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/10/kurds-trump-evangelical-christians-syria", "downloaded_at": "2019-10-11 08:15:30.901308+00:00", "title": "Abandoning Kurds could cost Trump support of evangelical Christians", "language": "en", "text": "One of the president’s staunchest constituencies has stuck by him through many controversies but Syria may be a policy lurch too far\n\nEvangelical Christian voters have been among Donald Trump’s most enthusiastic and reliable supporters. Trump’s recent rejection of asylum seekers and cuts to domestic food assistance programs have not stopped followers of Christ from flocking to the president.\n\nA great schism, however, may finally be at hand. In drips that have become a gush, evangelical leaders this week have sharply criticized Trump’s decision to stand down US forces in northern Syria, warning that Turkey’s invasion of the region threatens America’s longstanding Kurdish allies and vulnerable Christian communities.\n\n“It is very possible that the American withdrawal from the region will lead to the extinction of Christianity from the region,” Ashty Bahro, former director of the Evangelical Alliance of Kurdistan, told the Christianity Today news outlet.\n\n'Betrayal leaves a bitter taste': spurned Kurds flee Turkish onslaught Read more\n\n“An invasion by Turkey into NE Syria would pose a grave threat to the region’s Kurds and Christians, endangering the prospects of true religious freedom in the Middle East,” tweeted the evangelical leader Tony Perkins, a Trump adviser.\n\nThe Christian Broadcasting Network (CBN) founder, Pat Robertson, described even more grave stakes in a broadcast on Monday.\n\n“I believe … the president of the United States is in danger of losing the mandate of heaven if he permits this to happen,” Robertson said.\n\nDespite warnings from domestic and international allies, Trump’s move allowed Turkey to launch a ground and air assault on Wednesday against Syria’s Kurds, who had been a crucial American ally in the fight against the Islamic State.\n\nAs Turkish planes bombed towns in north-eastern Syria, angry and terrified civilians fled, unsure of their futures. But another consequence of Trump’s decision is that losing the mandate of heaven could seriously hurt Trump’s re-election chances.\n\nWhite evangelicals made up 26% of voters in the last presidential election and they voted 81% for Trump, according to Robert P Jones, chief executive of the Public Religion Research Institute (PRRI) and author of The End of White Christian America.\n\nTrump has won the avowed love of evangelicals by appointing conservative judges, opening the way for new abortion restrictions, supporting Christian universities, moving the US embassy in Israel to Jerusalem and other measures.\n\nWith so much common ground, not all of Trump’s most high-profile evangelical allies have broken with him over Syria. The Liberty University president, Jerry Falwell Jr, who helped Trump seal the deal with evangelical voters as a 2016 campaign adviser, said Trump was “keeping his promise to keep America out of endless wars”.\n\nChristian leader Jerry Falwell urges Trump support: 'He’s a moral person' Read more\n\n“The president has got to do what’s best for the country, whether it helps him with this phony impeachment inquiry or not,” Falwell told the Associated Press.\n\nBut other extremely loyal Trump allies have split with him, warning that Roman Catholic, Armenian and Syrian Orthodox churches in northern Syrian border cities such as Ras al-Ayn, which is in the crosshairs of the Turkish invasion, are under threat. Thousands of civilians have fled Turkish shelling in the area.\n\n“Today I ask that you join me in praying for the lives affected by the White House decision to pull US troops out of northern Syria,” tweeted one evangelical pastor, Franklin Graham. “Both Democrat & Republican leaders are deeply concerned bc this would be, in essence, abandoning our closest allies there – the Kurdish people.”\n\n“Hey @SpeakerPelosi,” tweeted the evangelical radio host Erick Erickson, “maybe do a vote to initiate impeachment STAT, have the committee get out articles by tonight and over to the Senate, and perhaps we’ll still have time to save some of the Kurds.”\n\n“Pray for our Kurdish allies who have been shamelessly abandoned by the Trump Administration,” tweeted the Republican senator Lindsey Graham. “This move ensures the reemergence of ISIS.”\n\nThe Israeli prime minister, Benjamin Netanuyahu, a deeply popular figure in the American evangelical community, joined the chorus.\n\n“Israel strongly condemns the Turkish invasion of the Kurdish areas in Syria and warns against the ethnic cleansing of the Kurds by Turkey and its proxies,” Netanyahu said. “Israel is prepared to extend humanitarian assistance to the gallant Kurdish people.”\n\nBut evangelical Christians are not ready to cast Trump out entirely. Earlier this week CBN News, America’s top Christian-themed media outlet, reported that Trump would be the keynote speaker this weekend at the Value Voters Summit, a huge political convention for evangelical Christians.\n\n“Typically, when President Trump speaks to evangelical audiences, he receives multiple standing ovations,” the report said. “This Saturday will probably be more of the same because, even with the swirl of impeachment surrounding him, evangelicals have stood solidly behind the president so far.”\n\n“So far.” The report went on to note evangelical “concern” about the Syria situation and concluded:\n\n“President Trump will have an opportunity to explain his reasoning in front of this all-important voting block.”", "description": "One of the president’s staunchest constituencies has stuck by him through many controversies but Syria may be a policy lurch too far", "authors": ["Tom Mccarthy"], "top_image": "https://i.guim.co.uk/img/media/1d3e093368ec9052a5132a5919797e08b36edd46/0_182_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a788ffe2269aa0c85739e80729448082", "published_at": "2019-10-10"}