{"pub": "fox", "url": "https://foxbusiness.com/markets/californias-winds-fires-no-end-in-sight", "downloaded_at": "2019-10-25 16:38:40.295720+00:00", "title": "California's punishing winds and fires have no end in sight", "language": "en", "text": "LOS ANGELES (AP) — Punishing Santa Ana winds that pushed fires into Los Angeles-area neighborhoods, burning six homes, were expected to last through Friday and could prompt more power shutoffs to hundreds of thousands of people.\n\nContinue Reading Below\n\nThe wind-whipped blazes broke out Thursday in the Santa Clarita area and the largest remained uncontained. As many as 50,000 people were under evacuation orders.\n\nIn Northern California, a fire near the wine country town of Geyserville burned 49 buildings.\n\nImage 1 of 5\n\nThe threat of hot, dry, winds driving flames far and wide was met with fleets of aircraft and hundreds of firefighters on the ground, who tried to protect homes where backyards were surrounded by trees and brush.\n\nIn some places, they failed.\n\nAs hot embers flew, subdivision homes and rural ranch properties were damaged or destroyed in the Canyon Country area of Santa Clarita and in nearby Castaic.\n\n\"We know of at least six but that number may rise,\" Los Angeles County Supervisor Kathryn Barger said.\n\nAlejandro Corrales tearfully watched her home burn on a ridge in Canyon Country, taking with it her mother's ashes, other belongings and possibly a pen full of pet sheep.\n\n\"You start thinking about all the things you can't get back,\" she told KCBS-TV.\n\nHer daughter managed to take some small pets.\n\n\"Everything in the house is gone,\" Corrales said. \"The panels on one of the pens where we have some rescued sheep was too hot for my daughter to open and so she couldn't let them out ... so I'm probably sure that we lost them, too.\"\n\nHer three children were safe.\n\n\"I'm just a little overwhelmed and I'm literally seeing sticks and fire of what used to be our home,\" she said.\n\nSome residents tried to fight the blaze with garden hoses.\n\nIn the rural areas, where at least two ranch houses burned, people rushed to rescue dozens of horses, donkeys, goats, a pig and even an emu.\n\nNo injuries were reported but fire officials say a firefighting helicopter was struck by a bird and its windshield damage, forcing it out of the fight until Friday.\n\nSouthern California Edison, which cut power to more than 31,000 customers on Thursday, was considering additional power cuts to more than 386,000 customers.\n\nThe shutdowns were designed to prevent fierce winds from hurling branches into power lines or toppling them, sparking wildfires.\n\nBy nightfall, crews reported they had slowed the forward progress of the flames but the winds, accompanied by hot weather and bone-dry humidity, were expected to pick up overnight and possibly increase into Friday, with gusts of 45 to 60 mph (72 to 97 kmph) in places, before easing off.\n\nUnfortunately, they were forecast to increase again over the weekend in Northern California, where a fire in wine country that began Wednesday night had burned 49 buildings and prompted evacuation orders for some 2,000 people in the Geyserville area.\n\nAmong those fleeing was 81-year-old Harry Bosworth, who awoke before sunrise Thursday to find a firetruck and firefighters in his driveway. As he and his wife drove off, flames surrounded their driveway and their barn caught fire.\n\n\"I could see the fire coming, so we got the heck out of there,\" Bosworth said after escaping to his daughter's house in the neighboring town of Healdsburg.\n\nThe blaze in Sonoma County had burned 25 square miles (65 square kilometers), whipped up by the strong winds that had prompted Pacific Gas & Electric to impose sweeping blackouts in northern and central California.\n\nThe outages affected half a million people or nearly 180,000 customers in 18 counties, most of whom lost power Wednesday afternoon and had it restored by Thursday evening, PG&E official Keith Stephens said.\n\nThe blackouts were instituted after utility electrical equipment was blamed for setting several blazes in recent years that killed scores of people and burned thousands of homes.\n\nPG&E said Thursday it didn't deenergize a 230,000-volt transmission line near Geyserville that it said malfunctioned minutes before the fire erupted.\n\nThe company filed a report with the state utilities commission saying it found a \"broken jumper\" wire on a transmission tower around 9:20 p.m. Wednesday.\n\nPG&E CEO Bill Johnson said it was too soon to know if the faulty equipment started the fire. He said the tower had been inspected four times in the past two years and appeared to have been in \"excellent condition.\"\n\nMeanwhile, PG&E warned that an even larger power outage may occur as early as Saturday and could affect portions of 33 counties in the San Francisco Bay Area, wine country and Sierra foothills.\n\nForecasts for Saturday into Monday showed possible wind gusts of 40 to 60 mph in most elevated areas of Northern California, and as high as 75 mph on some peaks.\n\n\"We do think that it will be the strongest offshore wind event of the season by a large margin, and if models are correct, possibly the strongest offshore winds we've seen in years,\" PG&E chief meteorologist Scott Strenfel said.", "description": "The wind-whipped blazes broke out Thursday in the Santa Clarita area and the largest remained uncontained. As many as 50,000 people were under evacuation orders.", "authors": [], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/california-wildfire-AP-004.jpg?ve=1&tl=1", "published_at": "2019-10-25"}