{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7546701/Italian-authorities-investigate-effigy-Greta-Thunberg-hanging-NOOSE-bridge-Rome.html", "downloaded_at": "2019-10-07 20:39:39.758038+00:00", "title": "Italian authorities investigate effigy of Greta Thunberg hanging by a NOOSE from a bridge in Rome", "language": "en", "text": "Italian authorities have today opened an investigation after an effigy of teen climate activist Greta Thunberg was found hanging by a noose from a bridge in Rome.\n\nImages posted on social media showed an effigy with a poncho and long braids with a sign written in English reading 'Greta is your God'.\n\nItalian officials said an inquiry into 'aggravated threats' had been opened on Monday.\n\nPoliticians slammed the stunt with Rome's mayor Virginia Raggi expressing the city's 'solidarity' with the Thunberg family in a message on Twitter.\n\nScroll down for video.\n\nMayor of Rome Virginia Raggi slammed the effigy, saying: 'Shameful the mannequin of @GretaThunberg found hanging from a bridge in our city. To her and her family my solidarity and that of the whole @Roma. Our climate commitment does not stop.'\n\nMs Thunberg made global headlines with a blistering speech at the United Nations in New York last month\n\nLeftist PD party leader Nicola Zingaretti condemned the 'grisly violence' and said the party does not respect the values shared by those responsible for the effigy.\n\nThe 16-year-old Swedish activist hit international headlines after she launched a 'Fridays For Future' campaign last year, calling for students across the globe to protest outside their parliaments to demand climate action.\n\nLast month she made a blistering speech at the United Nations in New York where she made an emotional plea for world leaders to intervene in what she perceives is a climate emergency.\n\nMs Thunberg told the UN conference: 'This is all wrong. I shouldn't be up here. I should be back in school on the other side of the ocean yet you all come to us young people for hope. How dare you?'\n\nShe added: 'You have stolen my dreams and my childhood with your empty words.'\n\nLast week Ms Thunberg slammed her 'haters' who mocked her appearance and autism on social media as being 'threatened' by her.\n\nShe has been tipped as a possible winner of this year's Nobel Peace Prize.", "description": "Images posted on social media showed an effigy with a poncho and long braids hanging from a rope before a sign posted on the bridge in English reading 'Greta is your God.'", "authors": ["Ross Ibbetson For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/15/19399336-0-image-a-114_1570457781747.jpg", "published_at": "2019-10-07"}