{"pub": "bbc", "url": "https://bbc.co.uk/news/entertainment-arts-49562567", "downloaded_at": "2019-09-07 02:17:13.359934+00:00", "title": "Iggy Pop: 'I've finally got the voice I was supposed to have'", "language": "en", "text": "Image copyright Getty Images\n\n\"Sweeeet Caroline...\"\n\nThe broken-glass mixed with sand tones of bona fide punk rock legend Iggy Pop are crooning a cover of Neil Diamond to an audience of one.\n\nHow did this happen?\n\nAs it turns out, it's the fault of his ex father-in-law...\n\n\"You know, I finally got the voice that I was supposed to have in some senses. When I was 21, I was in love with a girl from Cleveland and we actually got married for a couple of weeks,\" he explains.\n\n\"I had just put out the first Stooges album and I met her dad, he was a big shot in business. He said, 'Well, meeting and listening to you talk I guess you probably sing like Neil Diamond right?'\n\n\"I've since learned a lot of respect for Neil but at that time, you don't tell Iggy Pop that he sounds like Neil Diamond. But on the other hand, a part of me was thinking, 'Damn, if I sang like Neil Diamond, I'd have a lot more money you know'.\"\n\nThe one-time Stooges frontman is in the UK to promote his new album Free, an album he has co-written with musician/composer Leron Thomas and film-maker/composer Sarah Lipstate, best known for her solo electric guitar project Noveller.\n\nIt's a jazz-heavy introspective musing on subjects like mortality, love and sex and even features Iggy reciting poetry from Dylan Thomas.\n\nIggy recorded the new LP after two separate tours of his previous album, the Josh Homme-produced Post Pop Depression, his best performing solo album to date and one which took him on the road with Queens of the Stone Age frontman Homme and Arctic Monkeys drummer Matt Helders, including several shows at the Royal Albert Hall in London.\n\nImage copyright Getty Images\n\n\"I felt a little drained,\" he says of the end of the tour.\n\n\"As you mature, physically, when you get past 60 if you're still active, it's a good idea to put more of your efforts into mental work and less into physical work.\"\n\nThey might sound like surprising words from Iggy, the shirtless Peter Pan of rock who has outlived most of his musical contemporaries such as David Bowie and Lou Reed.\n\n\"The PPD record was something where I showed up in the desert and lived with a bunch of guys for weeks and weeks and weeks,\" he says. \"In the studio, all together, sweaty, smelly, dusty, picking a booger, whatever, singing when it was my turn, that sort of thing for six, eight weeks. That's gruelling.\"\n\nThe new album by comparison was largely recorded, says Iggy, \"by email\".\n\n\"It was not as physically exhausting, it was emotionally a full effort, though,\" he adds.\n\nThe album opens with Free, a sparse piece of instrumentation in which Iggy intones the phrase \"I want to be free\". Free of what though? The trappings of fame? The constrictions of age? Life itself?\n\nHe won't be drawn on the specifics for fear of \"explaining it to death or personalising it so that somebody else can't get into it in their own way\".\n\n\"I can't get too personal without screwing it up for everybody.\"\n\nJazz horns and drum beats flow through the new album, from the beautiful sweeping nature of new single Sonali to the horn solos on the album's lighter moments like the tongue-in-cheek James Bond and the gloriously profane Dirty Sanchez.\n\nIggy's collaborator Thomas is an acclaimed Texas-born trumpeter, oft-praised for the way he crosses genres like hip hop, soul and funk. Iggy says his love of jazz goes back to childhood and has influenced his own career, referencing Little Doll from The Stooges' debut album - which, he claims, was an attempt to \"rewrite\" The Creator Has A Master Plan by free jazz legend Pharoah Sanders and singer Leon Thomas.\n\n\"When I was a little boy, my dad would have a Charlie Burnett record on,\" says Iggy. \"Even Dave Brubeck, when you're 16 years-old and you hear Take Five, that's pretty cool, you know, so I always liked it.\"\n\nIggy's meditations on mortality come through on tracks like the album's closing piece The Dawn and the spoken word Do Not Go Gentle Into That Good Night, a reading of Dylan Thomas's 1951 poem.\n\nWe Are The People was written by Iggy's friend, the late Velvet Underground frontman Lou Reed.\n\nThe Thomas reading was initially recorded for a British ad firm, but Iggy felt it would fit well into the new record's themes while the latter was only published for the first time last year.\n\nWe are the people without land / We are the people without tradition...\n\nWe are the people without sorrow who have moved beyond national pride and indifference to a parody of instinct / We are the people who are desperate beyond emotion because it defies thought / We are the people who conceive our destruction and carry it out lawfully\n\n\"That totally resonated with me,\" says Iggy. \"Like, 'wham', like 'pow'. It was the first poem in a book of lyrics and when I saw it, I thought, 'My God, this is the country today as I understand it, or at least one legitimate portrayal of the country today. It really spoke to me.\"\n\nWith his slender frame, all-year round golden Miami tan and shoulder length blonde locks, at the age of 72, Pop is one of music's great survivors.\n\nIt is against the odds following a life of excess, at least before he discovered the benefits of clean living. Many friends and all of his original bandmates have passed away and this year marks 50 years since the release of The Stooges' debut album.\n\nImage copyright Getty Images\n\nLoathed by critics and music fans alike, in the ensuing decades it's been re-evaluated as a milestone in American music, a precursor to punk rock and one of the most influential records of all time.\n\n\"Once you get into showbusiness, you require minions, so they all have their own ideas about what to do to mark this splendid event,\" says Iggy. \"I had a very talented and powerful minion who wanted to rent Madison Square Garden and get a bunch of bands who'd been influenced by me and hold a big party.\n\n\"I didn't want to do that because I haven't been at it 50 years alone. It's a more delicate thing. Other people will mention it, and it's true, I was the vocalist and lyricist and wrote some of the music on that album.\"\n\nInstead, Iggy has put his name to a new book of lyrics spanning his six decades in music. Delving through old photos and being asked to come up with memories for each of those decades put him in a reflective mood, which undoubtedly informed the new album.\n\nImage copyright Getty Images\n\n\"There I am looking at pictures of my whole history,\" he explains. \"They're asking me to write one set of notes for each decade and suddenly you're thinking in those terms. A lot of your colleagues and contemporaries have passed away. So there's that. And then there's constant responsibility to do what I can to resemble oneself as one gets older.\n\nThe earlier decades, he chuckles, \"were easier\".\n\n\"And then when you get to the 80s, it made me really grumpy. And by the time you get to the 2000s, it was somewhere between ironic and, 'Oh, [bleep] off'. I think I said something like, 'I crawled out of the dark hole of misery into the limelight of love and acceptance'.\"", "description": "The punk rock survivor releases jazzy new LP and recalls 50 years since his band's searing debut album.", "authors": ["Kev Geoghegan", "Arts", "Entertainment Reporter"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/3EDD/production/_108639061_iggy976_getty.jpg", "published_at": "2019-09-06"}