{"pub": "washingtonpost", "url": "https://washingtonpost.com/news/voraciously/wp/2019/10/14/dont-let-high-altitude-baking-get-you-down-heres-how-to-ensure-sweet-success", "downloaded_at": "2019-10-14 23:24:00.504276+00:00", "title": "Don’t let high-altitude baking get you down. Here’s how to ensure sweet success.", "language": "en", "text": "Even under ideal conditions, baking can be a bit of a dance — reliant on the proper amount of ingredients, the right kind of interaction among them and a specific set of conditions, whether that’s in your oven or the weather outside. Throw high altitude into the mix, and it’s a whole new set of challenges.\n\nWhen we recently launched our Baking Basics newsletter, written by cookbook author and blogger Joy Wilson (a.k.a. Joy the Baker), we anticipated getting plenty of questions. We didn’t anticipate so many about adapting the recipes to above sea level.\n\n[Get Voraciously’s Baking Basics newsletter and learn the techniques that make baking a piece of cake]\n\nThat doesn’t necessarily surprise Nicole Hampton, who grew up in Colorado, went to college in Boston and returned to a pile of baking frustrations. “When I came home, I was like, ‘Oh, cool, nothing works now,’ ” she says. Part of the impetus of her blog, Dough-Eyed, was to help her and other home cooks figure out how to work around the kinds of tricks high-altitude baking can play. Here’s a guide to understanding why they happen and what to do about it.\n\nThe science. According to the Colorado State University Extension, the lower pressure at high altitudes has two major effects that can wreak havoc on baked goods. One, liquids evaporate faster and boil at a lower temperature. Two, the gases produced by leaveners (yeast, baking soda, baking powder) expand faster. Air at higher altitudes tends to be drier as well, so problems can begin even before you start cooking. Moreover, CSU says, “food tends to taste blander at higher elevations” — see the more extreme example of terrible-tasting airline food.\n\nDon’t give up. All that being said, don’t assume your sea-level recipe will fail at a high altitude. CSU suggests trying a recipe first as written. Otherwise, how will you know what to tweak? Then you can begin manipulating one element at a time so you can keep track of what changes are causing which effects.\n\nAnother wrinkle is that even if you’ve acquired a high-altitude-friendly recipe, it might not be right for your altitude, as all the effects amplify the higher you go. King Arthur Flour says microclimates in the mountains can mean even something that worked for your friend down the road might not work for you.\n\nThe keys are patience, meticulous testing and, yes, accepting that you might not succeed at first. “It’s super frustrating. I can’t possibly count the times that I’ve made a recipe and had it fail,” Hampton says. Even now, after years blogging and writing a cookbook called “Sugar High” on the topic, “it’s tough to make the adjustment. It’s a process.” Still, the more you bake and the more recipes you perfect, the easier it will be.\n\n\n\n(Tom McCorkle for The Washington Post; food styling by Bonnie S. Benwick for The Washington Post)\n\nGeneral advice. Soon you’ll understand what types of alterations work in your recipes in your kitchen. Hampton almost always starts any recipe by slightly reducing the leavener, since overexpansion is a fairly predictable outcome. Some sources recommend increasing the oven temperature by as much as 25 degrees and then reducing the baking time, the theory being that it will help the faster-rising baked goods set before they can collapse. Hampton, though, prefers to make other adjustments, because she has found that messing with the temperature can adversely affect texture. Whether you go that route is up to you, and probably the individual recipe.\n\nCSU offers a few other universal tips. One is to consider switching to a higher-protein flour, which strengthens structure. All-purpose flours can vary, so if you’re using a brand on the lower end of the spectrum, such as Pillsbury or Gold Medal, considering switching to one with more protein, such as King Arthur Flour. Using extra-large eggs instead of large eggs can account for the drier atmosphere. You may find yourself needing to cut back fat and sugar since they become more concentrated at high altitude with the more aggressive evaporation of liquids.\n\n[How to choose the right flour for the right baking recipe]\n\nGiven all the variations I’ve discussed so far, it can be hard to rely on specific adjustments that will apply across the board. However, CSU suggests some guidelines for cakes, quick breads and muffins to keep in mind as you experiment. For all altitudes, add up to 2 tablespoons more flour per cup called for in the recipe. For each cup of sugar, cup of liquid and teaspoon of baking powder or baking soda in the recipe (keep in mind that larger/more eggs can serve as liquid, too):\n\n3,500 to 6,500 feet: Reduce sugar up to 1 tablespoon, increase liquid 1 to 2 tablespoons, reduce baking powder/soda 1/8 teaspoon.\n\n6,500 to 8,500 feet: Reduce sugar up to 2 tablespoons, increase liquid 2 to 4 tablespoons, reduce baking powder/soda 1/8 to 1/4 teaspoon.\n\n8,500 to 10,000 feet: Reduce sugar 1 to 3 tablespoons, increase liquid 3 to 4 tablespoons, reduce baking powder/soda 1/4 teaspoon.\n\nAnother option: If a recipe uses both baking soda and baking powder in conjunction with something acidic such as buttermilk or sour cream, KAF says you can try switching to just baking powder and regular milk, for a less powerful rising reaction.\n\n[Five tips to make you a better baker]\n\n\n\n(Stacy Zarin Goldberg for The Washington Post; food styling by Lisa Cherkasky for The Washington Post)\n\nSpecifics. How do you tackle different types of baked goods? Read on.\n\nCookies: Hampton says these are the least affected by high altitude. They’re small and cook quickly anyway. Often you can get away with very minor tweaks, and sometimes none at all. Consider slightly cutting the leavening. If the cookies spread too much, reduce the fat and sugar a little. If the dough seems too dry, add a bit more liquid.\n\nCakes: They’re a bigger endeavor, according to Hampton, as getting the rise and structure correct is crucial to a cake that does not sink. Try making adjustments based on the suggestions above. As an example, for a two-layer, 8-inch cake, Hampton typically starts by adding 1/4 cup more flour to help with structure and 2 tablespoons liquid to account for the extra flour and drier air. For cakes that rely on beaten eggs (such as angel food or sponge), CSU says underbeating the eggs is important for keeping the cells formed by the air incorporated in the process from collapsing.\n\nPie crusts: Not too much to worry about here. All you may have to do is add a little extra water to the dough, in which case CSU suggests baking in the lower third of the oven to prevent a soggy crust.\n\nBiscuits, muffins and quick breads: CSU says these are usually sturdy enough to hold up even in a lower-pressure environment. If your baked good tastes slightly metallic or bitter, it may be because the baking soda or powder was not fully neutralized, so you’d want to reduce the amount. For more delicate quick breads, they may have to be treated and adjusted like cake.\n\nBread: Yeasted breads are by far the hardest recipes to adapt. You’ll want to disregard time suggestions on rising time, Hampton says, because the dough will poof up much faster. The problem with dough that has been proofed too much is that it is prone to collapse in baking. She often doesn’t let it double in bulk either, assuming there will still be plenty of expansion in the oven. KAF suggests reducing the amount of yeast by 25 percent to prevent excessive rising. The problem with reducing yeast and rise time is that it can also reduce flavor. But you have a few options. Hampton likes to let dough rise in the fridge, which slows the rise but still allows for flavor development. And while many recipes call for one first rise, followed by punching down and shaping, KAF says you can do two initial rises, punching down the dough twice, so that you get flavor but not as much volume. Adding sourdough starter can help, too.\n\nOther tips. Hampton find that flavors don’t come through quite as well up high, so she tends to amp up some ingredients to make them pop — using a little more vanilla extract or Dutch-process cocoa powder instead of natural. Instant espresso powder contributes depth to chocolate baked goods (this applies at sea level as well). CSU suggests adding extra spices above 7,000 feet to fix bland-tasting food.\n\nPaying attention to visual cues in recipes is especially important since the time will likely change. Are the cookies golden? Does the cake spring back to the touch? Did a tester come out of the muffin clean? Trust what you see, as well as your instincts, and soon you’ll be living — and baking — the high-altitude life. You might as well enjoy the view, too.\n\nMore from Voraciously:\n\nHow to pick, care for and cook in your Dutch oven, the one pot every home cook should own\n\nHow do pancakes and maple syrup get more exciting? Turn them into a cake.\n\nThese are the 4 types of sugar even the most casual baker should always have on hand", "description": "Be patient, make some smart adjustments and enjoy your hard work.", "authors": ["Becky Krystal", "Reporter Covering Topics Related To Food", "October At Am", "Becky Krystal Is A Food Reporter", "The Lead Writer For Voraciously. After Several Years As A General Assignment Reporter In Virginia S Shenandoah Valley", "She Came To The Washington Post In To Work For Tv Week", "Sunday Source. Her Time At The Post Also Includes A Five-Year Stint In The Travel Section."], "top_image": "https://www.washingtonpost.com/resizer/1X39saFrVIMaGDnBlnH6XQGSByM=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ATA3W6U2ZQ6JDGMNDNVONTKF3I.jpg", "published_at": "2019-10-14"}