{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/jurgen-klopp-admits-didnt-tell-20761545", "downloaded_at": "2019-10-30 23:24:44.776930+00:00", "title": "Jurgen Klopp admits Curtis Jones wasn't supposed to take final Liverpool penalty", "language": "en", "text": "Get the biggest Liverpool FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nJurgen Klopp says Liverpool penalty hero Curtis Jones \"has no issues with self-confidence\" after an on-pitch decision for the youngster to take the Reds' final spot kick against Arsenal .\n\nAn incredible Carabao Cup fourth round tie ended 5-5 after Liverpool came from 3-1 and 4-2 down, with Divock Origi scoring a last gasp equaliser to take the game to penalties.\n\nYoung goalkeeper Caoimhin Kelleher saved from Dani Ceballos in the shootout, with Jones then stepping forward to win it.\n\nHowever, Klopp says that the teenager was initially down to take Liverpool's fourth penalty and Origi the fifth, but the pair swapped over.\n\n(Image: AFP via Getty Images)\n\n\"We made some mistakes, we played some average passes, we were too open at times,\" said Klopp when discussing the game.\n\n\"We can talk about tactics but who cares on a night like this? I hoped for the boys they would have a game to remember. What they did tonight, I lost it really.\n\n\"It's like a dream to play for the first time at Anfield, but things might not be going right and you have to stay on track. All our goals we cored were wonderful.\n\n(Image: Getty Images)\n\n\"Kelleher is an outstanding talent. The crossing from (Neco) Williams, he might not have thought he would play tonight.\n\n\"Jones, it was not my decision in the end for him to take the last penalty. When I saw the list Origi was the taker of the last one and they changed it obviously.\n\n\"If you don't win nobody remembers it in three years, if it works out the boys will remember it forever.\"\n\n(Image: AFP via Getty Images)\n\nElaborating on the penalty order later, Klopp added: \"When I saw the list, Divock was five and Curtis was four. Then I saw Divock was four.\n\n\"Curtis has no issues with self-confidence. I'm pleased for Caoimhin saving the pen, I'm pleased for Neco setting up the goal for Div.\"", "description": "The young midfielder scored the last spot kick as the Reds won an incredible game", "authors": ["Mark Jones", "Image", "Afp Via Getty Images", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20761658.ece/ALTERNATES/s1200/0_FBL-ENG-LCUP-LIVERPOOL-ARSENAL.jpg", "published_at": "2019-10-30"}