{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7618815/Goths-steampunks-seaside-town-Whitby-twice-yearly-Goth-Weekend.html", "downloaded_at": "2019-10-28 00:34:27.086563+00:00", "title": "Goths and steampunks take over the seaside town of Whitby for the twice-yearly Goth Weekend", "language": "en", "text": "Advertisement\n\nVisitors descended on the Yorkshire seaside town of Whitby today for the October edition of the Goth Festival, which sees goths and steampunks gather to enjoy live music, quirky fashion and beer tasting.\n\nThe goths are hugely popular with tourists who come to admire the impressive costumes on display when festival-goers stroll along the beach and walk through the grounds of the Whitby Abbey ruins.\n\nDuring the three-day festival there are club nights, a modeling contest and the Bizarre Bazaar – a market featuring more than 100 stalls.\n\nWhitby was traditionally seen as welcoming to goths because of its links to Bram Stoker's novel Dracula, which was inspired by the abbey there.\n\nThe festival, which has been running since 1994, is one of the largest of its kind in the world and is so popular that since 1997 it has been held twice a year, in April and October - to coincide with Halloween.\n\nAccommodation is often booked up up to two years in advance for the festivals and there are many shops and other businesses that cater for the goth and steampunk trade.\n\nLesley Scaife from Harrogate poses for pictures during Whitby Goth Weekend in Yorkshire. She placed red roses around her head and had a black mask covering her face\n\nStunned residents look on as two goths dressed in black capes with white face masks stroll around the town showing off their impressive costumes\n\nA man in purple steampunk clothing sits and has a cup of tea outside a cafe during Whitby Goth Weekend today. The festival began in 1994\n\nThis man donned a leather jacket, sunglasses and a black hat as he carried a bat cage along the seaside promenade in Whitby today\n\nA woman wearing a red gown, black jacket and detailed mask as well as headgear smiles in the sunshine as she strolls around the centre of town\n\nClive Trivett from Nottingham poses for pictures during Whitby Goth Weekend. He wore a Captain America themed jacket and hat adorned with characters from the comic books\n\nThis festival goer wore an impressive beak mask with a hat covered in feathers for the celebrations which take part in April and October every year\n\nA man with spooky skull make-up on his face and a silver jacket poses for a picture during Whitby Goth Weekend which attracts tourists every year\n\nA passer-by looks on as a person who is attending the Whitby Goth Weekend sits in a graveyard near St Mary's church in Whitby, Yorkshire\n\nA woman in a black corset with dramatic face makeup smiles as she enjoys a stroll with beautiful views of the seaside town in the background\n\nTwo men with impressive hats and suits were out and about today to show off their costumes for the three-day festival which attracts people from around the world\n\nDuring the three-day festival, there are club nights and the Bizarre Bazaar – a market featuring more than 100 stalls. Pictured: a man in a long black coat and hat takes a stroll along the sea\n\nThe festival, which has been running since 1994, is one of the largest of its kind in the world and is so popular that in 1997 is began running twice a year, in April and October. Pictured: a woman in a white dress, fur shawl and veil braves the windy conditions today\n\nTwo goths with scary face make up and even blue hair enjoy a coffee break by the seaside during the event which runs for three days overall\n\nA pumpkin carved to look like Donald Trump advertises a shop during Whitby Goth Weekend. It has a hat on it which says 'Buy British gemstones make Britain great again'\n\nA man with the skeleton of a rat attached to his hat attends Whitby Goth Weekend. The sun was shining in Yorkshire today for the much-loved event\n\nLesley Scaife from Harrogate poses for pictures during Whitby Goth Weekend. She wore a full length red gown, black jacket and gloves and a rose adorned headpiece\n\nThis couple smiled as they took a selfie showing off their outfits in the sunshine. Thousands packing out the cobbled streets this year to celebrate the event\n\nTwo festival-goers wore striking white face masks with characters drawn on the front for the event which attracted many visitors\n\nA family sit and have breakfast in a cafe decorated with Halloween ghosts during Whitby Goth Weekend which is now held twice a year", "description": "The goths are popular with tourists who come to admire the impressive costumes on display when festival-goers stroll along the beach during the three-day celebration in Whitby, Yorkshire.", "authors": ["Amelia Wynne For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/13/20245056-0-image-a-2_1572184466535.jpg", "published_at": "2019-10-27"}