{"pub": "politico", "title": "Why black voters are backing two old white guys", "url": "https://politico.com/story/2019/09/02/black-voters-sanders-biden-2020-1479234", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:07:42.278958+00:00", "text": "Former Vice President Joe Biden (right) hold hands with Tyrone Sanders, husband of a Charleston church shooting survivor, during a South Carolina town hall in July. | Meg Kinnard/AP Photo 2020 Elections Why black voters are backing two old white guys A divide among African Americans between Joe Biden and Bernie Sanders has major implications for the race heading into the fall.\n\nROCK HILL, S.C. — A generational divide among black voters is persisting in the Democratic primary — between the two old white men.\n\nJoe Biden has amassed a staggering lead among older African Americans, commanding nearly two-thirds support of black voters 65 and older in the most recent Morning Consult poll. Bernie Sanders is the favorite of black millennials, though his margin with that group is much smaller. Among all black voters, Biden is leading Sanders, 41 percent to 20 percent.\n\nStory Continued Below\n\nBiden and Sanders have maintained their edges even as other candidates — including two African American senators, Kamala Harris and Cory Booker, have courted black voters more aggressively in recent months. Though opinions could change in the runup to voting, the preferences of African Americans this deep into the campaign has major implications for the election: As black voters go, so goes the mantle of Democratic front-runner — and likely the presidential nominee.\n\nThe irony of two white septuagenarians commanding majority support among African Americans — despite running in a historically diverse Democratic field — isn’t lost on black elected officials, operatives and voters. Several of them interviewed for this story said it speaks to the belief among many black voters that Biden is both best positioned to beat Donald Trump in a general election and to the loyalty he earned after eight years as Barack Obama’s No. 2.\n\n“You go with what you know. A lot of black voters know Joe Biden,” said Michael Nutter, a former Philadelphia mayor and a current Democratic National Committee member who's endorsed Biden. “There’s power in that and there’s loyalty in that.”\n\nSen. Bernie Sanders takes the stage at a South Carolina town hall with black lawmakers in April. | Meg Kinnard/AP Photo\n\nSanders won a following among younger black voters during his 2016 run, when his progressive activism and criminal justice record fired up millennials of all races.\n\nAt least in the primary, Biden’s lead among older black Democrats is more consequential than Sanders’ edge among younger ones, because older voters typically vote in much greater numbers. That’s especially true in South Carolina, the first-in-the-South primary state where about 60 percent of the Democratic electorate is black. Polls show Biden is doing even better with African American voters there than he is nationally, giving him a potential crucial edge that he hopes to parlay into a string of victories throughout the Southeast and in big cities, where sizable chunks of the Democratic electorate are black.\n\nSimilar generational and ideological splits exist among white voters. But African American voters have coalesced to a greater degree behind Biden and Sanders — a dynamic that stands out because of their influence in the early stages of the primary and because they’re not behind Harris or Booker.\n\nWithout more black support, the path to the nomination becomes exceedingly tenuous for the African American senators, who are polling in the single digits overall.\n\nNationally, Harris is the third choice of young black voters, behind Sanders and Biden. Among young black voters in South Carolina, Elizabeth Warren is polling ahead of Sanders. Both of the female candidates have made considerable efforts to court African Americans, especially black women, who are likely to turn out at higher rates than other demographics.\n\nHarris is writing a monthly column for Essence magazine, which caters to black women and has more than 5 million monthly readers, dubbed Kamala’s Corner. To drive engagement and donor support within the black community, she's also made sure voters know she’s an alumna of Howard University, a historically black institution, and a member of a black sorority.\n\nWarren has also written for Essence and held events with black activists as she touts plans to close the racial wealth gap.\n\nBooker's polling among black voters is at under 6 percent despite his efforts to promote his work on bipartisan criminal justice reform as well as his two terms as mayor of predominantly African American Newark, N.J.\n\nAntjuan Seawright, a South Carolina Democratic strategist and former senior adviser to Hillary Clinton, cautioned that there’s still lots of time for other candidates to make inroads with black voters.\n\n“When you think about Cory Booker, when you think about Kamala Harris, when you think about Elizabeth Warren and others,” he said, “one thing I've learned is that when you count people out, they usually teach you that you don't know how to count.”\n\nSeawright said one explanation for Sanders’ African American support is, \"one could argue, he has never stopped running for president.” But while Sanders “enjoyed tremendous millennial support last election cycle,” he added, “that didn't translate to necessarily showing up at the polls. So support is one thing. Voting for a candidate is another.”\n\nBoth Biden and Sanders have held rallies at historically black Clinton College in Rock Hill, S.C. But few students attended Biden’s town hall there Thursday; instead it was mostly older people who showed up. Sanders’ event in June drew a younger crowd.\n\n“Younger voters like what Sanders is saying about free college and legalizing marijuana,” said Jatoya White, a 19-year-old biology student who attended Biden’s rally but prefers Sanders. “With the older voters and Biden, it’s Obama.”\n\nBiden on Thursday finished a two-day tour of South Carolina as part of a renewed emphasis on black voters. It included a sit-down with African American journalists in South Carolina and, before that, in Washington, where he said racism is a “white man’s problem.”\n\nSanders, meanwhile, is betting on his favorability with young black Democrats to narrow Biden’s lead. His failure to capture the black vote in 2016 crippled his chances of winning the nomination and showed, as other Democratic hopefuls have learned before, that relying too heavily on white liberal voters is not a winning strategy for any candidate.\n\nPhillip Agnew, an activist and surrogate with the Sanders campaign, cited a recent encounter between Sanders and students at the University of South Carolina as emblematic of the way some young black voters feel about him. In the middle of move-in day at the university, when a group of black students heard the senator was inside a nearby Starbucks, they rushed over to thank him for his push to erase college debt.\n\n“These are people who are about to go to college, who have the wherewithal to see Bernie as somebody whose platform, should he be elected, is going to make their lives and that dark cloud of [student loan] debt hanging over them not be there,” Agnew said.\n\nCathy Cohen, a founder of GenForward, whose research focuses on millennial voting behavior by race, emphasized that it’s still early days in the primary. South Carolina, the fourth state to vote in the Democratic race, doesn’t hold its primary until Feb. 29.\n\n“I would argue that it's anyone's game,” Cohen said.\n\nBut Biden’s team points out his numbers haven’t budged much in the four months since he entered the race. In the Morning Consult poll, black voters 65 and older back Biden over Sanders by 56 percentage points, 63 percent to 7 percent. Sanders, meanwhile, is beating Biden by 12 points among African Americans younger than 30.\n\nBlack voters who’ve already made their choice told POLITICO that getting behind a white male candidate over a black woman or man is nothing personal. This time around, black Democrats feel the stakes are too high to be concerned about optics. They are focused on supporting the candidate they feel will champion the policies they care most about — and make Trump a one-term president.\n\n“We want to win. We just want to win,” Nutter, the former Philadelphia mayor, said. “Because Donald Trump is so damaging and so frightening to many people in this country … the primary theme is, ‘I just want to be with someone who I believe can actually win.’ And that’s what people care about.”\n\nMarc Caputo contributed to this report from South Carolina.", "description": "A divide among African Americans between Joe Biden and Bernie Sanders has major implications for the race heading into the fall.", "authors": ["Maya King"], "top_image": "https://static.politico.com/05/1a/36635989444a9b552419fcae78b3/20190901-biden-sc-ap-773.jpg"}