{"pub": "cnn", "url": "https://cnn.com/2019/09/12/health/vaping-detectors-school-trnd/index.html", "downloaded_at": "2019-09-13 00:57:34.032358+00:00", "published_at": "2019-09-12", "title": "High schools embrace 'vape detectors' in fight against bathroom vaping", "language": "en", "text": "(CNN) As the numbers of middle and high school students who vape continue to rise -- the US Food and Drug Adminstration says more than 20% of highschoolers use e-cigarettes -- school districts around the country are starting to fight back.\n\nTheir tool?\n\nVape detectors.\n\nThe sensor devices, which resembled smoke or carbon monoxide detectors, can detect vaping in places such as bathrooms or closets -- the kind of places where kids have tried to smoke for decades.\n\nSome are even equipped to detect THC oil, a compound found in marijuana, and pick up sound abnormalities like shouting, which could be helpful in preventing bullying.\n\nOnce detected, a notification is sent to administrators, who can then step in and stop the culprit. One video, created by FlySense, even shows how school officials can track data related to vape detection.\n\nHere's how some schools around the United States are employing the new technology.\n\nNew Jersey\n\nTen school districts in New Jersey have already implemented vaping detectors in schools, with more sending in requests, according to CNN affilliate WLNY\n\nOne such district is the Sparta Township School District.\n\nSuperintendent Michael Rossi Jr. told CNN that it has installed two vape detectors in Sparta High School, set to be fully functional later in the month. The district is also planning on installing detectors in the middle school and are planning on using them across the school campuses, not just in bathrooms.\n\nThese aren't the only measures the district has taken to curb vaping among students. Rossi said these efforts were part of larger educational programs for both students and parents.\n\nAs far as removing bathroom stall doors, as one Alabama school has done , Rossi said they wouldn't go that far.\n\n\"This is not a gotcha-type thing,\" he said. \"It's an educational, restorative and holistic response. We're not looking to punish people.\"\n\nOhio\n\nRevere Local School District has installed 16 vape detectors at Revere High School and Revere Middle School, the district announced earlier this month.\n\nThe detectors were purchased through a state grant, and anyone caught using (or selling, or buying) vapes could be suspended.\n\nJennifer Reece, a spokeswoman for the district, told CNN she didn't think the district had any more of a problem with vaping than other schools, but they'd been discussing the issue for a while.\n\n\"We decided it was probably important to do more than just talk about it,\" she said. \"[We] thought that we need to take more action.\"\n\nOlentangy Local School District has also attempted to crack down on vaping with detectors. Though a call from CNN was not immediately returned, CNN affilliate WBNS reported that the district is hoping to install vaping detectors in high school bathrooms, a project they're hoping to complete by Thanksgiving.\n\nStudents caught will also face suspension, a sentence that could be reduced if the student meets with a certified chemical dependency counselor, WBNS reported.\n\nIllinois\n\nHigh schools in Chicago suburbs have also installed vaping detectors, including Hinsdale Central High School, Hinsdale South High Schools and Evanston Township High School, CNN affiliate WGN reported last month.\n\nOne of six US deaths from a severe lung illness possibly linked to vaping occurred in Illinois.\n\nThe US Centers for Disease Control and Prevention has reported more than 450 possible cases of lung illness associated with using e-cigarettes as of last week. Illinois has seen 42 cases of respiratory illness linked to vaping in the last 90 days.\n\nA crackdown as attention rises\n\nSix people in the US have died from lung disease related to vaping, and there have been more than 450 possible cases of lung illness related to the practice, too.\n\nLast month, an 18-year-old from Illinois was hospitalized with a serve pulmonary illness after using e-cigarettes for almost two years. His lungs were similar to those of a 70-year-old adult , his doctors said.\n\n\"A lot of people think vaping is wonderful,\" Trump said. \"It's really not wonderful. It's got big problems.\"\n\nFirst lady Melania Trump, whose \"Be Best\" platform focuses in part on children's health and combating addiction, has also spoken out more than once over her concerns over e-cigarette use by children.\n\n\"I am deeply concerned about the growing epidemic of e-cigarette use in our children. We need to do all we can to protect the public from tobacco-related disease and death, and prevent e-cigarettes from becoming an on-ramp to nicotine addiction for a generation of youth,\" she tweeted earlier this week.", "description": "The sensor devices, which resembled smoke or carbon monoxide detectors, can detect vaping in places such as bathrooms or closets -- the kind of places where kids have tried to smoke for decades.", "authors": ["Leah Asmelash"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/180406160438-high-schools-vaping-epidemic-super-tease.jpg"}