{"pub": "reuters", "url": "https://in.reuters.com/article/uk-cuba-sanctions-investment-analysis/tougher-u-s-sanctions-make-cuba-ever-more-difficult-for-western-firms-idINKBN1WO2LH", "downloaded_at": "2019-10-10 01:46:11.498873+00:00", "title": "Tougher U.S. sanctions make Cuba ever more difficult for Western firms", "language": "en", "text": "HAVANA (Reuters) - Tougher U.S. sanctions against Cuba have led international banks to avoid transactions involving the island, while prospective overseas investors put plans on hold and foreign firms operating in the country consider restructuring to lower their risk exposure.\n\nA tanker ship leaves the Havana's bay in Havana, Cuba, October 2, 2019. Picture taken on October 2, 2019. REUTERS/Alexandre Meneghini\n\nJust a few years ago, foreign businesses were rushing to take a firsthand look at Cuba’s opening economy, lured by the Communist government’s market reforms and a detente pursued by former U.S. President Barack Obama. Yet two dozen Western executives, consultants and diplomats interviewed by Reuters said President Donald Trump’s reversal of that detente and ratcheting up of the U.S. trade embargo have poisoned the business climate, in combination with Cuba’s homegrown economic woes.\n\nOn top of the decades-old embargo, the Trump administration has sanctioned nearly 200 Cuban military-run companies and hotels as well as any company or vessel involved with shipping Venezuelan oil to Cuba. In April, Trump also activated Title III of the 1996 Helms-Burton Act, which allows Americans to sue U.S. and international companies profiting from property that was nationalized or confiscated after Cuba’s 1959 Revolution.\n\nAmerican Airlines, Melia Hotels International, Amazon Inc and French lender Societe Generale are among the companies that have been slapped with lawsuits under the Helms-Burton Act, which they are contesting in court.\n\n“The situation is catastrophic, at least for Western countries. I can’t speak for Russia or say China,” a European commercial attache said, asking not to be identified due to the sensitivity of the matter.\n\nMany Western banks have long refused Cuba-related business for fear of running afoul of U.S. sanctions and facing hefty fines, as well as the country’s poor credit history.\n\nNow, the combination of Trump’s aggressive stance, the complications of new sanctions and fear of being sued under Helms-Burton are deterring the few that remained.\n\nPostFinance, the last Swiss bank to process Cuba-related transactions, informed clients last month it would no longer do so. Bank spokesman Rinaldo Tibolla said in an email PostFinance relied on a trust-based network of correspondent banks as well as access to U.S. dollar payments.\n\n“There is a risk that we will be excluded from this access if payments to Cuba, which may be subject to U.S. sanctions, are allowed to continue,” he said.\n\nPanama’s Multibank shut down numerous Cuba-related accounts this year and European banks are restricting clients associated with Cuba to their own nationals, if that. Asked about the closures, Multibank said in a statement it constantly revised its foreign accounts from the perspective of regulations and risk.\n\nBusinessmen and diplomats said large French banks, including Societe Generale, no longer want anything to do with Cuba and some are stopping payments to pensioners living on the Caribbean island. Neither Societe General nor Paribas, both of which have been sanctioned by the U.S. Treasury Department, responded to a request for comment.\n\nBut for the first time in years, the island has had problems financing the upcoming sugar harvest. Various joint venture projects, from golf resorts to alternative energy, are finding it nearly impossible to obtain private credit, the executives, diplomats and other sources consulted by Reuters said.\n\nEven Cuban embassies abroad are finding it more difficult to open accounts, Cuban Foreign Minister Bruno Rodriguez told a news conference in Havana this month as he blasted sanctions as “genocidal.”\n\n“Financial sanctions are weapons of mass destruction,” said John Kavulich, president of the U.S.-Cuba Trade and Economic Council, which closely follows U.S.-Cuban relations.\n\n“Enforcement by the Treasury Department can have a devastating impact.”\n\nNOT WORTH THE RISK\n\nEvery time a Helms-Burton suit is filed, or Washington sanctions a bank for violating the embargo, corporate compliance officers say business with Cuba is not worth it, the sources said.\n\n“It is like the old Chinese death sentence by a thousand cuts,” said a European financial services representative, who also asked to remain anonymous.\n\nClients from Canada, Europe and even China were still interested in Cuba, said Canadian lawyer Gregory Biniowsky, who lives in Havana and consults foreign businesses for the law firm Gowlings Consulting Inc.\n\n“What has changed is their calculations for the short- to medium-term, as in, let’s kind of shelve this for now and go into a holding pattern at least until November 2020,” he said, echoing the observations of other consultants.\n\nWhile recent U.S. sanctions have spooked many potential partners, Cuba’s existing 200-odd joint ventures and other agreements with foreign companies appear to be staying the course.\n\nA number of well-known corporations such as Nestle, Unilever, Imperial Cigars, Sheraton, Pernod-Ricard, Total and AB InBev have ventures in Cuba and none have fled in response to the U.S. crackdown.\n\nPeople stand at the American Airlines office at the Jose Marti International Airport in Havana, Cuba, September 25, 2019. Picture taken on September 25, 2019. REUTERS/Alexandre Meneghini\n\nThe companies did not respond to Reuters’ requests for comment. However, the sources said some were considering restructuring along the lines of British beverage giant Diageo PLC, which recently arrived in Cuba and partnered with a local firm in August to market rum.\n\nLuca Cesarano, general director of the joint venture, has said he was confident Diageo was shielded from Helms-Burton, which assumes some U.S. exposure to collect penalties, since it was operating in Cuba through a subsidiary.\n\n“Neither the subsidiary of Diageo, which is the partner, nor the venture, will interact with any Diageo entity or person that interacts with the United States,” he said in August.", "description": "Tougher U.S. sanctions against Cuba have led international banks to avoid transactions involving the island, while prospective overseas investors put plans on hold and foreign firms operating in the country consider restructuring to lower their risk exposure.", "authors": ["Marc Frank", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191009&t=2&i=1439000993&w=1200&r=LYNXMPEF9822P", "published_at": "2019-10-09"}