{"pub": "fox", "url": "https://foxbusiness.com/industrials/gm-union-expectations-employees-compensation-uaw", "downloaded_at": "2019-09-26 15:04:17.143450+00:00", "title": "Why GM can't use record profits to grant striking workers' demands", "language": "en", "text": "Talks between General Motors and striking United Auto Workers progressed to the \"Main Table\" stage this week, but union members may be disappointed with salary offers since they're already among the best compensated workers in the automotive industry.\n\nContinue Reading Below\n\nNonunionized workers in the U.S. cost foreign auto companies $13 less per hour, factoring in benefits, than GM's employees, according to the Center for Automotive Research. GM's hourly labor costs ring up to $63 per worker, compared with $61 for Ford and $55 for Fiat Chrysler.\n\n\"The automakers will be seeking to improve their competitive position vis-à-vis the international automakers in the United States during these negotiations,\" according to a report from the research center shortly before the UAW strike began on Sept. 15.\n\nPresident Trump's trade war with China, as well as the disruption of self-driving and electric cars, could also keep GM from using record profits to grant every item on the UAW's wish list, according to The Detroit News.\n\nIn talks so far, conditions for temporary workers have been a sticking point for the UAW. Temps are union members doing the same work as permanent employees, but earning half the pay and far fewer benefits.\n\nAdvertisement\n\nThe union wants those workers to get a path to permanent positions and compensation closer to that of their permanent counterparts.\n\nGM counters that employing temporary workers is good for permanent employees because they enable the full-time staff to take time off. Hiring temps also gives the company flexibility to scale up production for new models and handle absenteeism.\n\nMany striking workers say they do not begrudge GM CEO Mary Barra's hefty compensation, but the base salary for the company's top executive has remained flat since 2010 when adjusted for inflation, while some GM employees' base wages have fallen 10 percent, according to the Detroit News.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "Labor costs vary widely within the U.S. auto industry, and that could strengthen GM's bargaining position.", "authors": ["Evie Fordham"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/GM-plant-Getty.jpg?ve=1&tl=1", "published_at": "2019-09-26"}