{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/us-airline-stocks-sink-wto-approves-trump-tariffs-eu-parts-2019-10-1028572061", "downloaded_at": "2019-10-03 08:35:03.846977+00:00", "published_at": "2019-10-03", "title": "US airline stocks plummet after Trump wins WTO approval for tariffs on aircraft parts (UAL, LUV, AAL, DAL)", "language": "en", "text": "Flickr via Charman of the Joint Chiefs of Staff\n\nMajor US airlines saw their stocks tumble Wednesday after President Trump won approval from the World Trade Organization for $7.5 billion worth of tariffs on EU-based airplane parts and luxury goods.\n\nThe approval is the largest in the WTO's 24-year history, nearly doubling the previous record from 2002. The tariffs affect the decades-long conflict between US-based Boeing and EU-based Airbus, with both companies accused of illegally using government funds to compete with the other.\n\nHere are the major US airlines hit by the announcement and how much they've fallen as of 1:30 p.m. ET:\n\nAlaska Air Group (ALK): down 4.6%\n\ndown 4.6% American Airlines (AAL): down 5%\n\ndown 5% Delta Air Lines (DAL): down 6.1%\n\ndown 6.1% JetBlue Airways (JBLU): down 2.9%\n\ndown 2.9% Southwest Airlines (LUV): down 3.2%\n\ndown 3.2% Spirit Airlines (SAVE): down 4.4%\n\ndown 4.4% United Airlines (UAL): down 5.7%\n\nRead more: US factory activity unexpectedly hits 10-year low as Trump's trade war persists\n\nBoeing fell as much as 2.9% on the news, and Airbus dropped as much as 2.5%.\n\nThe tariff announcement furthers Trump's trade conflict with the EU. The President already issued a 25% duty on steel from the bloc in March 2018, and is threatening billions of dollars worth of tariffs on European cars.\n\nThe WTO ruling also permits tariffs on luxury goods from the EU including linen, cheese and swordfish. The organization is scheduled to rule on proposed tariffs from the EU early next year.\n\nNow read more markets coverage from Markets Insider and Business Insider:\n\nJohnson & Johnson climbs after settling two opioid epidemic lawsuits, allowing it to avoid an upcoming federal trial\n\nWall Street is starting to take the possibility of an Elizabeth Warren presidency seriously — and strategists warn a victory could crush certain parts of the market\n\nUber and WeWork are being thrashed for pretending to be tech companies. But the VC whose firm bet big on both startups says that argument is all wrong.", "description": "US airline stocks plummeted Wednesday after the World Trade Organization approved President Trump's $7.5 billion worth of proposed tariffs on the European...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d94c6b441753205982b7009-942/screen-shot-2013-01-24-at-102910-am.png"}