{"pub": "theverge", "url": "https://theverge.com/2019/10/3/20896819/microsoft-surface-headphones-black-leaked-video-features", "downloaded_at": "2019-10-05 14:01:05.159509+00:00", "title": "Black Microsoft Surface Headphones appear in leaked promotional video", "language": "en", "text": "Microsoft could be preparing to release its Surface Headphones in a new black color scheme, according to a new promotional video leaked on Twitter by WalkingCat. The video shows off many of the features that can already be found on the existing gray Surface Headphones, including dials that control volume and active noise cancellation, suggesting you’re not getting any new functionality alongside the new color scheme.\n\nThe new promotional video has emerged a year after Microsoft first introduced the over-ear Surface Headphones, which, until now, have only been available in gray. The same year the headphones were first announced, Microsoft introduced a matte black Surface Pro. If you’ve been holding out on buying a pair of Surface Headphones because they don’t match your black Surface Pro, then you might not have too much longer to wait.\n\nHowever, it’s not clear when Microsoft might release this new color scheme. The trailer uses the same “Anything but Ordinary” tagline that the company used for its Surface event this week, but the only audio gear the company announced at the event were the $249 Surface Earbuds, which are available in both light and dark gray color schemes. With a slick ad already produced for the black variant, it feels like Microsoft could be ready to announce its new headphones any day now.", "description": "Microsoft could be preparing to release its Surface Headphones in a new black color scheme, according to a leaked promotional video. The video shows off features that can already be found on the gray Surface Headphones.", "authors": ["Jon Porter", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/FcMpzdslwl5ER7mixKRn7dL8m24=/0x5:2559x1345/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19255998/msedge_EFRM7eT2Nc.jpg", "published_at": "2019-10-03"}