{"pub": "yahoo", "url": "https://sports.yahoo.com/after-jaguars-lost-in-carolina-jalen-ramsey-was-with-deshaun-watson-in-houston-141643260.html", "downloaded_at": "2019-10-07 19:45:21.299020+00:00", "title": "Right after Jaguars lost in Carolina, Jalen Ramsey was with Deshaun Watson in Houston", "language": "en", "text": "The Jacksonville Jaguars might not want to trade cornerback Jalen Ramsey, but he might not make it easy for them to keep him.\n\nRamsey has missed two games with a back injury. That curiously came after his trade request. Players get injured all the time in the NFL and it’s likely coincidental timing. However, it’s easy to question it. The same thing happened when Ramsey missed a couple days at the facility with the flu after requesting the trade.\n\nOn Sunday, Ramsey wasn’t with his teammates as they lost to the host Carolina Panthers. He was in Houston reportedly to visit a back specialist. He also found time to hang out with Houston Texans quarterback Deshaun Watson.\n\nScroll to continue with content Ad\n\nIt’s not the best look.\n\nRamsey hangs with Watson\n\nRamsey is a grownup and it’s not unusual for great players to be friendly, even as division rivals. Watson and Ramsey share an agent. Ramsey’s appointment with the back specialist is Monday, the Houston Chronicle said, and Ramsey passed the time Sunday by hanging out with a friend and his agent.\n\nStill, the Jaguars couldn’t have been thrilled to see this after their 34-27 loss to the Panthers ...\n\nUnless someone did a heck of an editing job, that picture is from Sunday afternoon, based on the Cowboys-Packers game behind them. That would be about two hours after the Texans won and the Jaguars lost. The players’ agent, David Mulugheta, is between the two stars.\n\nAgain, nothing Ramsey did is wrong in a vacuum. It just looks strange considering his standing trade request.\n\nJaguars don’t want to trade Ramsey\n\nStory continues\n\nRamsey requested a trade after he said disrespectful things were told to him after a Week 2 game. He said his relationship with the front office is the reason he wants to be traded. Jaguars owner Shad Khan said he doesn’t plan to trade the All-Pro cornerback.\n\nThat social-media picture of Ramsey in Houston shortly after the Jaguars’ loss, with the quarterback of Jacksonville’s division rival, isn’t necessarily a message. But it’s easy to connect dots.\n\nThe Ramsey standoff doesn’t have an end in sight yet. And we’ll probably get a little more drama along the way.\n\nJacksonville cornerback Jalen Ramsey was in Houston on Sunday. (Getty Images)\n\n– – – – – – –\n\nFrank Schwab is a writer for Yahoo Sports. Have a tip? Email him at shutdown.corner@yahoo.com or follow him on Twitter! Follow @YahooSchwab", "description": "Jalen Ramsey's teammates were in Charlotte, losing to the Panthers. Ramsey was in Houston.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/cp3tcG.zeca5BqAYSPPQRw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTIuMjY2NjY2NjY2NjY2Nw--/https://s.yimg.com/uu/api/res/1.2/RUtu3qkgMLljCo4zJmlFsA--~B/aD0yNTM5O3c9MzgxNDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/265c3fd0-e90c-11e9-bcf5-ed8467d54cfc", "published_at": "2019-10-07"}