{"pub": "independent", "url": "https://independent.co.uk/sport/football/premier-league/newcastle-jeremy-corbyn-mike-ashley-football-ownership-epl-a9148346.html", "downloaded_at": "2019-10-09 07:06:08.179021+00:00", "title": "Newcastle hit back at Jeremy Corbyn’s ‘bad owners like Mike Ashley’ comment", "language": "en", "text": "Newcastle have hit back at Labour leader Jeremy Corbyn after he launched an attack on “bad owners like Mike Ashley” as part of a plan to shake up the way football is run.\n\nThe Opposition leader, who spoke at a 2,000-strong rally in the city on Saturday night, took aim at club owners “who put their business interests ahead of everything else, marginalise supporters and even put the financial security of clubs at risk”.\n\nHis comments came at a time when thousands of Magpies fans, Sunday’s 1-0 Premier League win over Manchester United aside, are staying away from games in protest at the way the Sports Direct magnate is running the club.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHowever, Newcastle responded with a statement on Tuesday in which they accused Mr Corbyn of having “a surprising lack of knowledge” about the game.\n\nIt said: “We are disappointed by comments made by Labour leader Jeremy Corbyn at the weekend regarding football governance and club ownership, in which he specifically attacked Newcastle United.\n\nShape Created with Sketch. Player ratings: Newcastle vs Manchester United Show all 23 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Player ratings: Newcastle vs Manchester United 1/23 Martin Dubravka - 7 Getty Images 2/23 Deandre Yedlin - 7 Manchester United via Getty Imag 3/23 Fabian Schar - 7 AFP via Getty Images 4/23 Jamaal Lascelles - 6 AFP via Getty Images 5/23 Ciaran Clark - 6 Getty Images 6/23 Jetro Willems - 7 Action Images via Reuters 7/23 Matty Longstaff - 9 Getty 8/23 Sean Longstaff - 8 Getty Images 9/23 Miguel Almiron - 7 Getty Images 10/23 Allam Saint-Maximin - 7 Action Images via Reuters 11/23 Joelinton - 5 Action Images via Reuters 12/23 David De Gea - 6 Getty Images 13/23 Diogo Dalot - 6 CameraSport via Getty Images 14/23 Marcus Rojo - 5 PA 15/23 Harry Maguire - 5 Getty Images 16/23 Ashley Young - 6 Manchester United via Getty Imag 17/23 Axel Tuanzebe - 5 Manchester United via Getty Imag 18/23 Fred - 5 Action Images via Reuters 19/23 Scott McTominay - 6 Action Images via Reuters 20/23 Juan Mata - 5 AFP via Getty Images 21/23 Andreas Pereira - 5 Getty 22/23 Marucs Rashford - 5 Getty 23/23 Daniel James - 6 REUTERS 1/23 Martin Dubravka - 7 Getty Images 2/23 Deandre Yedlin - 7 Manchester United via Getty Imag 3/23 Fabian Schar - 7 AFP via Getty Images 4/23 Jamaal Lascelles - 6 AFP via Getty Images 5/23 Ciaran Clark - 6 Getty Images 6/23 Jetro Willems - 7 Action Images via Reuters 7/23 Matty Longstaff - 9 Getty 8/23 Sean Longstaff - 8 Getty Images 9/23 Miguel Almiron - 7 Getty Images 10/23 Allam Saint-Maximin - 7 Action Images via Reuters 11/23 Joelinton - 5 Action Images via Reuters 12/23 David De Gea - 6 Getty Images 13/23 Diogo Dalot - 6 CameraSport via Getty Images 14/23 Marcus Rojo - 5 PA 15/23 Harry Maguire - 5 Getty Images 16/23 Ashley Young - 6 Manchester United via Getty Imag 17/23 Axel Tuanzebe - 5 Manchester United via Getty Imag 18/23 Fred - 5 Action Images via Reuters 19/23 Scott McTominay - 6 Action Images via Reuters 20/23 Juan Mata - 5 AFP via Getty Images 21/23 Andreas Pereira - 5 Getty 22/23 Marucs Rashford - 5 Getty 23/23 Daniel James - 6 REUTERS\n\n“Amongst his comments, Mr Corbyn accused ‘billionaire owners like Mike Ashley’ of ‘ruining our national game’, claiming these ‘bad owners’ put their ‘business interests above everything else’ and risk their clubs’ financial security.\n\n“In overlooking existing governance and regulation, as well as the hugely positive impact Newcastle United and other professional clubs have in their communities, Mr Corbyn has demonstrated a surprising lack of knowledge about our national game.\n\n“We feel, therefore, it is important to address his damaging and misinformed opinions in the interests of the club and its supporters.\n\n“Financially, other than sums provided to the club on a short-term, interest-free basis and repaid to him as intended, we would like to make it clear that Mike Ashley has not taken a penny out of Newcastle United in interest, salary or dividend, as is customary at many clubs.\n\n“As stated on numerous occasions before, every penny Newcastle United has will continue to be available to it.\n\n“In this financial year, the club will use an overdraft facility to manage its cash-flow following a significant spend on talent in the summer. As a well-run, responsible club, that amount will be repaid in full and on time and our other regulatory obligations will be met.\n\n“We will not apologise for being financially sustainable, but we will push the boundaries of our budgets as far as possible to maximise the impact on the team.”\n\nMr Corbyn also said a football club was “more than just a club, it is an institution at the heart of our communities’, a sentiment with which the Magpies’ hierarchy agrees.\n\nThe statement added: “Often, Newcastle United Foundation’s projects fill in significant gaps that the public sector sadly cannot stretch to, particularly at a time when government cuts are so prevalent.\n\n“We would like to invite Mr Corbyn to visit one of these initiatives to experience at first hand the incredible work that is being undertaken by the Foundation in our local community every day.”\n\nPA", "description": "Newcastle have hit back at Labour leader Jeremy Corbyn after he launched an attack on “bad owners like Mike Ashley” as part of a plan to shake up the way football is run. The Opposition leader, who spoke at a 2,000-strong rally in the city on Saturday night, took aim at club owners “who put their business interests ahead of everything else, marginalise supporters and even put", "authors": ["Damian Spellman"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/02/20/mike-ashley.jpg", "published_at": "2019-10-09"}