{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7533373/Maisie-Williams-felt-ashamed-having-bind-chest-Game-Thrones.html", "downloaded_at": "2019-10-05 08:13:39.023409+00:00", "title": "Maisie Williams felt 'ashamed' having to bind her chest on Game Of Thrones", "language": "en", "text": "Maisie Williams has revealed that she felt 'ashamed' at the fact she had to alter her appearance on Game Of Thrones.\n\nThe actress, 22, has played Arya Stark on the series since she was 11, and began to go through puberty whilst starring in the hit HBO show.\n\nSpeaking to Vogue about the lengths production went to in order to keep her looking prepubescent, Maisie confessed she was 'ashamed' and felt 'horrible'.\n\nCandid: Maisie Williams has revealed that she felt 'ashamed' at the fact she had to alter her appearance on Game Of Thrones\n\nShe explained: 'Around season two or three my body started to mature and I started to become a woman, but Arya was still very much like trying to be disguised as a boy.\n\n'I had to have really short hair and they'd constantly cover me in dirt sand shade my nose so it looked really broad and I looked really manly...\n\n'They'd also put this strap across my chest to flatten any growth that had started and that just felt horrible for six months of the year, and I felt kind of ashamed for a while.\n\n'In this new phase of my style it's nice to look more feminine and have a real waistline, and you know embrace the body that I have'.\n\nFame: The actress, 22, has played Arya Stark on the series since she was 11, and began to go through puberty whilst starring in the hit HBO show\n\nAlthough Maisie lamented being made to look younger in Game Of Thrones, she believes her naturally youthful appearance has helped her in the acting world.\n\nShe explained: 'When you're a young actress you want to look really grown up.\n\n'I was really conscious not to do at the beginning of my career because even though I was 16/18, I was still looking like 12/14. That really powerful when you're an actor.\n\n'Playing younger is a valuable thing'.\n\nSpeaking out: Speaking to Vogue about the lengths production went to in order to keep her looking prepubescent, Maisie confessed she was 'ashamed' and felt 'horrible'\n\nYouthful: Although Maisie lamented being made to look younger in Game Of Thrones, she believes her naturally youthful appearance has helped her in the acting world\n\nElsewhere in the chat, Maisie revealed her model agent boyfriend Reuben Selby helps her with styling and she appreciates having him with her on the red carpet as she's not a natural posing for pictures.\n\nMaisie and her communications director beau Reuben first sparked romance rumours in February after they were spotted strolling around New York City holding hands, following her split from long-term boyfriend, 35-year-old Ollie Jackson.\n\nShe seemed to make the relationship official after he accompanied her to Joe Jonas and Sophie Turner's French wedding back in June, posting a photo of them together on Instagram.", "description": "The actress, 22, has played Arya Stark on the series since she was 11, and began to go through puberty whilst starring in the hit HBO show.", "authors": ["Rebecca Lawrence For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/03/12/19250214-0-image-a-31_1570102799902.jpg", "published_at": "2019-10-03"}