{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/i-hope-theres-an-age-limit-jimmy-carter-questions-whether-he-could-have-handled-the-presidency-at-80/2019/09/18/3af87eca-d9ff-11e9-bfb1-849887369476_story.html", "downloaded_at": "2019-09-18 12:49:40.387285+00:00", "title": "‘I hope there’s an age limit’: Jimmy Carter questions whether he could have handled the presidency at 80", "language": "en", "text": "Former president Jimmy Carter and former first lady Rosalynn Carter talk about the future of the Carter Center at an event in Atlanta on Tuesday night. (Branden Camp/AP)\n\nFormer president Jimmy Carter expressed doubt Tuesday night that he would have been able to handle the presidency at age 80, saying the job requires being “very flexible with your mind” and suggesting that there should be an age limit.\n\nCarter did not mention any of the current presidential candidates in his comments, but two leading Democratic contenders — former vice president Joe Biden and Sen. Bernie Sanders (I-Vt.) — would turn 80 while in office if elected.\n\nQuestion’s about Biden’s age and mental acuity, in particular, have become part of the conversation in the Democratic nominating process. He is currently 76, while Sanders is 78.\n\nCarter, who turns 95 next month, was asked during an event at the Carter Center in Atlanta what it would take for him to run for president again. The questioner noted that Grover Cleveland had served two nonconsecutive terms in the late 19th century.\n\n“I hope there’s an age limit,” Carter said with a big grin as he sat next to his wife, Rosalynn Carter.\n\n[Jimmy Carter says Trump wouldn’t be president without help from Russia]\n\n“You know, if I were just 80 years old, if I was 15 years younger, I don’t believe I could undertake the duties that I experienced when I was president,” he said. “For one thing, you have to be very flexible with your mind. You have to be able to go from one subject to another and concentrate on each one adequately and then put them all together in a comprehensive way.”\n\nCarter added that presidents “also have to adopt new ideas.”\n\n“The things I faced just in foreign affairs, I don’t think I could undertake them if I was 80 years old,” he continued. “So 95 is out of the question. I’m having a hard time walking. I think the time has passed for me to be involved actively in politics, must less run for president.”\n\nCarter, who said he voted for Sanders in Georgia’s 2016 Democratic primary, replied to a separate question by saying he is keeping “an open mind” about the current crop of Democrats.\n\n“One of the major factors I will have in my mind is who can beat Trump,” he said, referring to the current president, who is 73.\n\nEarlier Tuesday, Trump’s campaign released a video that strung together several of Biden’s recent verbal gaffes and included clips of political commentators questioning whether he remained as mentally sharp as he once was.\n\nDuring Tuesday night’s event, Rosalynn Carter also took aim at Trump.\n\n“I think we need a new president,” the former first lady said. “I am so disturbed about white power. He says he is not a racist and maybe he is not. But some of the things he says encourages racism.”", "description": "The former president didn’t mention any current White House contenders, but both Joe Biden and Bernie Sanders would reach that threshold while in office.", "authors": ["John Wagner", "National Reporter Leading The Post'S Breaking Political News Team", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/h37alJQOdfVbNOw772TtGfaIBuU=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PQZTSXG2AQI6TP5RQSMIONUUOY.jpg", "published_at": "2019-09-18"}