{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/5/villanova-escapes-with-35-28-win-over-william-mary", "downloaded_at": "2019-10-06 00:24:00.837834+00:00", "title": "Villanova escapes with 35-28 win over William & Mary", "language": "en", "text": "WILLIAMSBURG, Va. (AP) - Daniel Smith threw a 1-yard touchdown pass to Dee Wil Barlee on fourth-and-goal with 1:59 left in the game and Villanova held off William & Mary 35-28 on Saturday.\n\nVillanova (6-0, 3-0 Colonial Athletic Association), ranked No. 8 in the FCS Coaches Poll and one of six remaining undefeated teams, had its hands full with the upset-minded Tribe (2-4, 0-2).\n\nKilton Anderson staked William & Mary to a 7-0 lead with a 12-yard TD pass to Kane Everson, capping a 12-play, 77-yard game-opening drive. After forcing a Villanova punt, the Tribe turned the ball over on their first play from scrimmage when Drew Wiley forced an Everson fumble after a catch and Nowooola Awopetu returned it eight yards to the William & Mary 17-yard line. Two plays later Justin Covington scored on a 3-yard run to knot the score at 7.\n\nThe Wildcats took advantage of a 22-yard punt by Will Michael to grab a 14-7 lead, scoring on Smith’s 16-yard toss to Jaaron Hayek. Villanova stretched its lead to 21-7 on Barlee’s 15-yard TD run, but Anderson connected with Zach Burdick for a 16-yard score sandwiched around a pair of missed field goals by Villanova’s Drew Kresge and the Tribe trailed 21-14 at halftime.\n\nWilliam & Mary knotted the score at 21, using a marathon 17-play drive that covered 76 yards and took 7:36 off the clock with Bronson Yoder scoring on a 2-yard run.\n\nVillanova recaptured the lead at 28-21 when Smith hooked up with Hayek for a 37-yard score, but Anderson again pulled the Tribe even when he hit Everson for a 20-yard TD on fourth-and-1 with 9:56 remaining in the game.\n\nThe Wildcats took the lead for good with a 16-play drive that took nearly 8 minutes off the clock.\n\nThe Tribe drove to the Villanova 30-yard line before turning the ball over on downs.\n\nSmith completed 21 of 34 passes for 250 yards and three TDs for the Wildcats. Anderson finished 25-of-33 passing for 245 yards and three scores. Everson caught 11 passes for 131 yards and two touchdowns.\n\n…\n\nNo. 8 Villanova Wildcats (5-0, 2-0) at William & Mary Tribe (2-3, 0-1) Colonial Athletic Association\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Daniel Smith threw a 1-yard touchdown pass to Dee Wil Barlee on fourth-and-goal with 1:59 left in the game and Villanova held off William & Mary 35-28 on Saturday.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/05/villanova_william_mary_football_87797_c0-219-1924-1340_s1770x1032.jpg?2010d9b74db3d48b3b7733c0876101b76d185085", "published_at": "2019-10-05"}