{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7543919/Botham-Jeans-neighbor-Joshua-Brown-assassinated-lawyer-says.html", "downloaded_at": "2019-10-07 00:17:24.037069+00:00", "title": "Botham Jean's neighbor Joshua Brown was 'assassinated', lawyer says", "language": "en", "text": "Amber Guyger witness Joshua Brown was targeted for death in an 'assassination,' his family's lawyer told DailyMail.com in an exclusive interview Sunday.\n\nAnd S. Lee Merritt said he is refusing to rule out that police were somehow involved in the shooting that took Brown's life just two days after his evidence had helped convict the Dallas cop of the murder of neighbor Botham Jean in a nationally watched trial.\n\n'It is a possibility,' Merritt said. 'I don't have any evidence other than the timing, but I am not ruling anything out.\n\n'But what I do know is that Joshua was targeted. This was an assassination. He pulled into his parking lot and he was shot. The perpetrators fled. They didn't steal anything from him.\n\n'This is a kid who had no gang ties, there was no lover's quarrel. He was an AirBnB host and roofer. All the usual suspects of crime, drugs and sex are simply not there.'\n\nJoshua Brown, 28, was shot dead outside an apartment complex in Dallas, Texas on Friday and his family's attorney S. Lee Merritt has called it an 'assassination'.\n\nMerritt described Brown as 'a truly genuine soul that was loved deeply by his family and friends.'\n\n'I will work to get to the bottom of his murder,' he added.\n\nBrown, 28, was shot in the parking lot of the Atera apartment complex in Dallas's upscale Medical District around 10:30 pm on Friday. He was rushed to nearby Parkland Memorial Hospital, where he died from his injuries.\n\nWitnesses say they heard several gunshots and saw a silver sedan speeding out of the apartment complex's parking lot shortly after.\n\nMerritt said he was originally told Brown had been shot in the mouth and chest, although he now says he is waiting for confirmation of the bullet wounds from the Medical Examiner.\n\nHis Saturday tweet claiming Brown had been shot in the mouth led to dozens of online comments that he had been killed because he had given evidence against a police officer and that shooting him in the mouth was a message to others.\n\n'This has 'HIT' by 'COP' written all over it,' tweeted Twitter user DJW in reply to Merritt's message.\n\nAnd 'Maximus' wrote: 'All it takes is common sense to know what 'group' of individuals had him murdered.\n\nBrown lived in the same Dallas apartment complex where Amber Guyger (left) shot dead Botham Jean (right) last year\n\nBrown had testified last week during Guyger's murder trial before she was convicted and sentenced to 10 years in prison\n\n'They think they are above the law,' the tweeter said, adding that the Department of Justice and Dallas Police Internal Affairs should be compelled to 'root out the murderer and all those involved.'\n\nBrown lived across the hall from Jean on the fourth floor of the South Side Flats complex on Lamar Street in Dallas. He relocated to the Atera, a 10-minute drive away, following Jean's killing last year.\n\n'He moved because he didn't want to continue living in a building where there had been a murder,' said Merritt.\n\nGuyger, who had been on the Dallas Police for five years, mistakenly walked into Jean's apartment instead of her own which was one floor below — on September 6 last year, and shot him with her service revolver, thinking he was an intruder.\n\nShe had just come off a 13½-hour work shift and claimed she was tired and drove to the wrong level of the parking lot.\n\nDuring his September 24 testimony, Brown said police had knocked on both his door and Jean's on the afternoon of the shooting about a noise complaint, even though there wasn't anything loud going on in their apartments.\n\nHe said he thought it might have been because both he and Jean smoked marijuana and the smell sometimes drifted into the hallway.\n\nThat night, Brown left his apartment to go watch a football game and when he came back just before 10pm he heard two gunshots and a commotion in the hallway.\n\nActivists are calling the murder of Joshua Brown (pictured) an 'execution' and offering a $100,000 reward to find his killers as it's revealed the 28-year-old who testified against Amber Guyger predicted his own death\n\nBrown was gunned down outside an apartment complex in the city's Medical District - not the complex where he lived with Guyger and Jean\n\nThe 'Atera' apartment complex in Dallas is pictured above where Joshua Brown was murdered Friday night\n\nHe said he looked through his peep hole and saw Guyger crying on the phone in the hallway and telling whoever she was speaking to that she had gone into the wrong apartment.\n\nHe said she went back into the apartment and then came out again to meet officers arriving at the scene.\n\nBill Perkins, a Houston-based hedge fund manager, poker player and film producer, on Sunday offered a $100,000 reward to help find Brown's killers\n\nBrown started sobbing on the witness stand when he was asked about the victim. He said he'd met Jean for the first time on the day he was killed but was used to hearing the 26-year-old sing gospel music and Drake songs in the mornings.\n\nJudge Tammy Kemp — who was later heavily criticized for hugging Guyger and giving her a Bible after the trial was over — called a recess and appeared to be choking back tears as Brown left the courtroom.\n\nGuyger was off duty but still in uniform when she walked into Jean's home and shot him in the chest as he sat on his couch eating ice cream and watching TV.\n\nThe officer told investigators that she'd come home from her long shift and parked on the fourth floor of her apartment complex's garage — rather than the third floor where she'd been living for two months — and found the apartment's door ajar.\n\nBelieving she was at her own apartment and seeing a silhouette of a figure who didn't respond to verbal commands, Guyger said she fired two shots, killing him.\n\nBill Perkins, a Houston-based hedge fund manager, poker player and film producer, on Sunday offered a $100,000 reward to help find Brown's killers.\n\nPerkins tweeted: 'Every murder is sad. The particulars around this specific set of circumstances make it important that everyone learn why this happened irrespective of the outcome.\n\n'Either way a killer needs to be caught & I wish in every case these resources could be brought to bear for justice.'\n\nMerritt told DailyMail.com such rewards can often shake loose information that might otherwise not be forthcoming.\n\nFollowing Brown's death, Dallas County prosecutor Jason Hermus, who led the prosecution at Guyer's trial, paid tribute to him for agreeing to take the stand.\n\n'He bravely came forward to testify when others wouldn't. If we had more people like him, we would have a better world,' Hermus stated.\n\nPoliticians also had their say on Brown's murder. New York Congresswoman Alexandria Ocasio-Cortez tweeted: Just when we caught a glimpse of justice for Botham Jean, much of it feels stolen back with the murder of Joshua Brown, a key witness in the case.\n\n'My heart breaks for his family and for everyone touched by this tragedy. We must get to the bottom of this injustice.'\n\nAnd Democratic presidential candidate Kamala Harris added on Twitter: 'We grieve again learning of Joshua's murder. I pray for his family, his community, and all those impacted by this tragedy. We demand answers.'", "description": "Joshua Brown, 28, was shot dead outside an apartment complex in Dallas, Texas on Friday and his family's attorney S. Lee Merritt has called it an 'assassination'.", "authors": ["Martin Gould In Dallas", "Texas", "For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/21/19369816-0-image-a-81_1570392599574.jpg", "published_at": "2019-10-06"}