{"pub": "dailymail", "url": "https://dailymail.co.uk/property/article-7435763/The-green-green-grass-Sir-Tom-Jones-home.html", "downloaded_at": "2019-10-05 05:47:14.563577+00:00", "title": "The green, green grass of Sir Tom Jones' old home that's up for sale", "language": "en", "text": "When Sir Tom Jones decided to buy a home in South Wales in the Nineties he knew exactly where to look. While many parts of the Principality were in a state of decline, the Vale of Glamorgan, which locals refer to as The Vale, was a different matter.\n\nWith its quaint whitewashed villages, this slice of land to the west of Cardiff, between the M4 and the coast, is reminiscent of Devon.\n\nThe property that caught the millionaire singer's fancy was a refurbished Welsh farmhouse, Llwynddu House in Ystradowen, just outside Cowbridge, which is now back on the market.\n\nIt is for sale with estate agent Watts and Morgan, priced at £2.6million.\n\nIn 1998, Sir Tom sold Llwynddu House in Ystradowen for £700,000 and bought a mansion in Los Angeles for £2.1million\n\n'His late wife, Linda, was in charge of viewing properties in the area,' says Colwyn Jones, a retired estate agent with Watts & Morgan, who conducted the sale.\n\n'I remember she was staying at the Marriott Hotel, Cardiff, and I'd pick her up, together with her sister, to show her around.'\n\nSecurity was a priority.\n\n'They immediately wanted CCTV, which wasn't so common then,' says Mr Jones, who dealt with Sir Tom's son, Mark, who is his manager.\n\n'The footpath, which passed close to the house, had to be re-directed and Sir Tom also bought several acres of adjoining land to secure his privacy.'\n\nLinda supervised improvements on the house itself. A leisure complex was already in place, but it was Linda who installed the sunbed for Sir Tom to keep his suntan topped up.\n\nThe house has changed little over the years, except the furnishings today are a mix of creams and whites.\n\nThe downstairs rooms include a lounge, study, cinema room, kitchen, sitting room and garden room , while upstairs there are five bedrooms and four bathrooms, many with views over the huge lake.\n\nThe leisure suite, which includes a gym, snooker room and bar, is in a converted barn. Recent owners have been keen horse owners. What used to be a tennis court has been turned into a riding school.\n\nAlthough Linda, Sir Tom's childhood sweetheart, liked to spend time at Llwynddu House, Sir Tom was too busy to be a frequent visitor.\n\nNearer to home the couple had The Vale of Glamorgan to explore, with its gems of villages.\n\nColwinston featured on Penelope Keith's Village of the Year competition on Channel 4 last year, because it has such strong community spirit and St Hilary has its own listed pub, The Bush Inn.\n\nThen there is the Glamorgan Heritage Coast with its dramatic cliffs and beaches.\n\nAt the centre of the Vale is Cowbridge. Once thought of as the market town for successful retirees, today it has a youthful vibe, with Bar 44 for tapas and Arboreal, a bistro that puts on jazz nights.\n\nThe Bear in the High Street is traditionally a favourite watering-hole and this was where Sir Tom would arrange to meet friends when he was at Llwynddu House.\n\nThe locals still talk of the times the Welshman would drop in for a pint.\n\nOn arrival, he would announce: 'OK, you've got ten minutes if you want photos, autographs, then please leave me be, cos I'm going to sit and have a drink with my friends.' Locals would always respect his privacy.\n\nAlthough Linda, Sir Tom's childhood sweetheart, liked to spend time at Llwynddu House, Sir Tom was too busy to be a frequent visitor. Linda's sister and her husband took care of the house in their absence.\n\nIn 1998, Sir Tom sold it for £700,000 and bought a mansion in Los Angeles for £2.1 million. He sold this for £6.4million when Linda died, after 59 years of marriage, in 2016.\n\nThe new buyer bought everything except their photographs and some artwork. At the time, Tom said he had so many memories of Linda tied up in the house that he had to sell it all.", "description": "Llwynddu House is in Ystradowen, just outside Cowbridge in the Vale of Glamorgan and was the property that the singer bought in South Wales in the 1990s.", "authors": ["Fred Redwood For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/06/15/18156362-0-image-a-20_1567780600424.jpg", "published_at": "2019-09-07"}