{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7556457/Strictlys-Alex-Scott-Neil-Jones-cosy-display-leave-Takes-Two.html", "downloaded_at": "2019-10-10 00:07:56.631657+00:00", "title": "Strictly's Alex Scott and Neil Jones put on a cosy display as they leave It Takes Two", "language": "en", "text": "They have sent tongues wagging with their on-screen chemistry on Strictly Come Dancing.\n\nAnd Alex Scott, 34, and Neil Jones, 37, put on a cosy display as they left the It Takes Two studios in London on Wednesday.\n\nIt comes after Neil reportedly had a 'huge backstage row' with estranged wife Katya after being left 'furious' over her 'I've never been better' dig on Saturday's show.\n\nClose bond: Alex Scott, 34, and Neil Jones, 37, put on a cosy display as they left the It Takes Two studios in London on Wednesday\n\nAlex cut a stylish figure in a giraffe print shirt and skinny black jeans, which she dressed down with vibrant trainers.\n\nNeil, meanwhile, opted for a floral silk shirt, which he layered underneath a shiny blue blazer.\n\nJoining the duo on the Strictly spin-off show was Emma Barton and her partner Anton Du Beke and Amy Dowden.\n\nWalk on the wild side: Alex cut a stylish figure in a giraffe print shirt and skinny black jeans, which she dressed down with vibrant trainers\n\nDapper: Neil, meanwhile, opted for a floral silk shirt, which he layered underneath a shiny blue blazer\n\nDuring Neil and Alex's appearance on It Takes Two, host Zoe Ball said: 'You entered the Strictly record books on Saturday night.\n\n'You are now officially the only couple in Strictly history to increase your mark by one point each week from the start of the series.\n\n'You are record breakers. That is amazing.'\n\nThe duo are set to Tango to Go Your Own Way by Fleetwood Mac on Saturday.\n\nStrictly stars: Joining the duo on the Strictly spin-off show was Emma Barton and her partner Anton Du Beke and Amy Dowden\n\nChemistry: The pair have sent tongues wagging with their on-screen chemistry on Strictly Come Dancing\n\nTensions bubbling: Last Saturday Neil was said to have been irked by Katya saying: 'I've never been better' after taking a tumble during her dance with partner Mike Bushell\n\nTheir appearance comes after Neil reportedly sparked a 'huge' backstage row with his ex Katya last Saturday night.\n\nThe pro dancer was said to have been irked by Katya saying: 'I've never been better' after taking a tumble during her dance with partner Mike Bushell.\n\nNeil reportedly thought the comment was not about the fall and was instead a thinly-veiled dig at him following the demise of their marriage.\n\nDouble denim: Emma Barton was casually-clad in ripped denim jeans and a khaki jacket\n\nHeading home: The former EastEnders star lugged a suitcase out of the studios\n\nGorgeous: Professional dancer Amy Dowden looked stunning in a blue silk dress\n\nA source told The Sun: 'Just after filming finished, a huge fight broke out backstage between Katya and Neil.\n\n'He thought what she said was a dig, and didn't appreciate it.\n\n'He was really annoyed and told her so - but she denied it was anything to do with him.'\n\nMailOnline contacted Strictly's representatives for comment at the time.\n\nElegant: She complemented the look with silver hoop earrings and brown patterned heels\n\nBack to her best: Host Zoe Ball appeared in high spirits as she left the studios after recovering from her flu\n\nKatya was the talk of the show on Saturday after she fell flat on her face while dancing the Cha Cha Cha to It's Raining Men before tripping up on the stairs mere moments later.\n\nInsisting the second tumble was deliberate, The Strictly 2017 champion denied questions from viewers that she was drunk after both falls.\n\nSmart: Anton Du Beke looked dapper as he carried a suit and a large weekend bag following his appearance\n\nJubilant: The Strictly veteran flashed a smile as he left\n\nMeanwhile Neil, who announced he had split from his wife of six years and fellow Strictly pro Katya in August, admitted he and Alex had grown so close that they were now finishing each other's sentences.\n\nHe previously said: 'I grow on people. Everyone hates me at the beginning and what happens is I annoy people so much.\n\n'I'm like an annoying little brother that you've got to like anyway.'", "description": "Alex Scott, 34, and Neil Jones, 37, put on a cosy display as they left the It Takes Two studios in London on Wednesday.", "authors": ["Connie Rusk For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/23/19515674-0-image-a-24_1570661505909.jpg", "published_at": "2019-10-09"}