{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/teen-pair-jailed-shocking-cruel-20561949", "downloaded_at": "2019-10-11 20:01:57.213479+00:00", "title": "Teen pair jailed for 'shocking and cruel' knife attack on aspiring mechanic", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nTwo teenagers have been jailed for killing an aspiring mechanic in a \"shocking and cruel\" attack inside a youth centre.\n\nGlendon Spence, 23, and his friends sought refuge at the Marcus Lipton Youth Centre in Brixton, south London, when two hooded teenagers ran at them armed with large knives.\n\nMr Spence tripped and fell by a table tennis table and was set upon by one of the youths in a \"swift and merciless\" attack in front of horrified staff and youngsters.\n\nHe suffered a stab wound to his thigh, severing the femoral artery, and was pronounced dead at the scene soon after the attack on the evening of February 21.\n\nHis attackers were driven off by an accomplice in a BMW, the Old Bailey heard.\n\n(Image: PA)\n\nRishon Florant, 18, of Peterborough Road, Waltham Forest, east London, who was accused of delivering the fatal wound, denied being involved.\n\nBut his co-accused, 18-year-old Chibuzo Ukonu, of Loughton, Essex, identified Florant as the stabber.\n\nHe told jurors he was also at the scene but had no intention to cause any harm to Mr Spence, let alone an intention to kill.\n\nThe jury deliberated for 21 hours to find Florant guilty of murder and Ukonu guilty of manslaughter last month.\n\n(Image: CENTRAL NEWS)\n\n(Image: central news)\n\nJudge Mark Dennis QC ordered Florant to be detained for at least 18 years and handed Ukonu 14 years in a young offenders' institute.\n\nHe told the pair: \"The whole event had taken less than 90 seconds. Glendon Spence died at the scene from heavy bloody loss.\n\n\"The exact motive for the attack is unknown, however the attack has all the hallmarks for organised gang violence.\n\n\"This was grave offending of the utmost seriousness. The CCTV captured what was a shocking and cruel attack and one which would have horrified or caused great alarm to anyone that witnessed it.\n\n\"You are both young men attracted to and engaged in an urban culture that embraces violence.\"\n\n(Image: central news)\n\nEarlier on Friday, the victim's family described their devastation at the loss of Mr Spence, who hoped to become a motor mechanic.\n\nIn a statement, they told of their \"pity\" for his killers, taking comfort from their memories of Mr Spence.\n\nThe court heard how Florant had multiple previous convictions for carrying knives dating back to when he was aged 15.\n\nUkonu also had a conviction for carrying a 12-inch combat knife when he was aged 15.\n\nHe told police at the time: \"Not gonna lie, I got something on me. Brixton is a dangerous place.\"\n\nHe was also caught possessing cocaine and heroin with intent to supply.\n\nThe court was told how people in the area of Brixton where the murder took place had taken to wearing body vests because of the \"prevalence of knife crime\".\n\nThe fact the stabbing of Mr Spence was targeted on the leg indicated it was a focused attack, the prosecution suggested.\n\nFlorant laughed and shouted up to friends in the public gallery as he was sent down.", "description": "Glendon Spence was attacked with large knives by Rishon Florant and Chibuzo Ukonuat at the Marcus Lipton Youth Centre in Brixton", "authors": ["Emily Pennink", "Joseph Wilkes", "Image", "Central News", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article19443069.ece/ALTERNATES/s1200/0_PAY-cnl_R_Florant_X.jpg", "published_at": "2019-10-11"}