{"pub": "businessinsider", "url": "https://businessinsider.com/madden-20-nfl-best-players-ratings-99-overall-2019-7", "downloaded_at": "2019-10-05 00:04:29.151804+00:00", "title": "Patrick Mahomes has joined the exclusive '99 Club' in 'Madden 20.' Here are the other 4 best players in the NFL, according to the game.", "language": "en", "text": "Every year, \"Madden NFL\" rates the skills of nearly 3,000 professional players based on more than 50 different attributes.\n\nJust five players have managed to earn a 99 overall rating, the game's highest possible player score. Seven players made the \"99 Club\" last year.\n\nThe creators of \"Madden NFL 20\" say they want the game to feel more realistic this year, leading to lower ratings overall and larger skill gaps between players.\n\n\"Madden NFL 20\" is available now for Xbox One, PlayStation 4, and PC.\n\nVisit Business Insider's homepage for more stories.\n\n\"Madden\" has been the top football video game for more than a decade, and each year, the development team at Electronic Arts rates NFL players based on more than 50 different attributes. The game's highest possible rating is a 99 overall, but only a select few players make it into the coveted \"99 Club\" each year.\n\nOnly four players in \"Madden NFL 20\" earned a 99 overall rating when it launched on August 1, and three of them were defensive superstars. However, \"Madden\" updates its ratings every week during the season based on player performance. \"Madden NFL 20\" cover star Patrick Mahomes managed to reach a 99 overall rating during week 4 after his impressive start to the season.\n\nLast year, seven players reached the 99 Club, but only one of them managed to maintain their max rating for a second year. The creators of \"Madden NFL 20\" say they want the game to feel more realistic this year, leading to lower ratings overall and larger skill gaps between players.\n\nRead more: The creators of 'Madden' revealed their process for rating nearly 3,000 players every year, and it's a fascinating look inside one of the most popular video game franchises on the planet", "description": "Only five players managed to earn a 99 overall rating in this year's \"Madden,\" and three of them are defensive superstars.", "authors": ["Kevin Webb"], "top_image": "https://image.businessinsider.com/5d97806849e03f124452cd99?width=1200&format=jpeg", "published_at": "2019-10-04"}