{"pub": "politico", "url": "https://politico.eu/article/ruth-davidsons-problems-scottish-tories", "downloaded_at": "2019-09-04 00:40:58.304920+00:00", "title": "Ruth Davidson’s ‘heavy heart’ poses problems beyond Scottish Tories", "language": "en", "published_at": "2019-08-29", "text": "Ruth Davidson made no secret of wanting to be the next first minister of Scotland. Instead she became the most high-profile casualty of Boris Johnson’s “do or die” Brexit strategy.\n\n“So much has changed,” Davidson said as she announced “with a heavy heart” her widely trailed departure at a press conference Thursday, after eight years as leader of the Scottish Conservatives.\n\nDavidson’s decision was not forced upon her. She had overseen an unexpected electoral resurgence in the moribund Scottish Tories and was once tipped as a future leader of the U.K. party.\n\nNow her resignation raises serious questions about both the future of the Conservative Party north of the border and whether Johnson can hold on to vital Scottish seats.\n\nA pugilistic former broadcaster, Davidson led her party from the political wilderness into opposition in the Scottish National Party-controlled Edinburgh parliament. Under her watch the Scottish Conservatives had their best general election result in more than 30 years, going from one seat in 2015 to 13 two years later, winning an extra 300,000 votes in the process.\n\nThe Scottish Tories have recently found themselves squeezed to the right by the Brexit Party and struggling to gain on the SNP.\n\nBut Scotland voted heavily to stay in the European Union and Brexit is tearing at the seams of a disunited kingdom. Polls suggest a growing clamor for a rerun of the 2014 independence referendum that saw Scots vote to remain in the U.K. by 10 percentage points.\n\nAndy Maciver, a former Scottish Conservative press officer, said that Davidson’s departure was primarily personal — she had her first child in October — but it poses serious political challenges for her party.\n\n“Whoever takes over has this one fundamental decision to make: are they part of the U.K.-wide party, in which case you are a bit-part player tied to London and not in control of your own destiny; or do you say, ‘We will do something different,’” said Maciver, who has long advocated breaking away from the British Conservative Party on a model based on Canadian federal politics.\n\nThe Scottish Tory renaissance is shallower than it might appear, said Maciver. Under Davidson, the electoral offer was a strident “no” to independence, delivered by a telegenic leader with an eye for a photo opportunity (tanks featured heavily). This attracted unionist voters more than those who backed center-right policies.\n\nThe next Scottish parliament election is scheduled for 2021, many expect a British general election before then.\n\n“She didn’t de-toxify the Tories. What she did was suppress the Tories entirely and replaced it with unionism and her own personal brand. The Tory brand is in the same position it has always been. The Tories' electoral fortunes were lifted by her and by unionism. The Tory brand is still in the doldrums,” said Maciver.\n\nJames Mitchell, professor of politics at Edinburgh University, agrees.\n\n“She has good communication skills but flawed strategic vision. Her reliance on the threat to union was an odd and dangerous position for a unionist. She was handed an opportunity to rebuild the Scottish Tories by turning a unionist vote into a Conservative vote but failed to make any real effort to do this.”\n\nDavidson cited “conflict” over Brexit in her resignation speech. She has long had a frosty relationship with Johnson and was reportedly “livid” last month when the new prime minister replaced her long-term ally David Mundell as Scottish secretary with Alister Jack, who has been aligned to the hard-line pro-Brexit European Research Group of Conservative MPs.\n\nBut Davidson, who campaigned passionately for Remain in 2016, has often lacked a clear position on Brexit in the years since the referendum. She shifted from advocating membership of the single market and customs union to backing Theresa May’s Withdrawal Agreement.\n\nPartly as a result of these policy somersaults, the Scottish Tories have recently found themselves squeezed to the right by the Brexit Party — which took a seat in Scotland in May’s European election — and struggling to gain ground on a Scottish National Party that still remains popular after 12 years in power.\n\nPolitical analyst Iain Macwhirter said Davidson’s departure is a “gift” for First Minister Nicola Sturgeon who has faced pressure from her own supporters to hold a second independence referendum. In 2017, Westminster rejected the Scottish parliament’s request for another vote on leaving the U.K.\n\n“The first minister isn’t going to call that referendum next year — unless there is a sudden and dramatic increase in support for independence. She won’t call an unlawful Catalan-style unauthorized referendum. She’s a small ‘c’ conservative lawyer, not an insurgent like Alex Salmond,” said Macwhirter.\n\nThe next Scottish parliament election is scheduled for 2021. Many expect a British general election before then. Polls suggest the SNP could win back many of the 22 seats lost two years ago, with the Tories struggling, which could see the Scottish nationalists play a kingmaking role in the event of a hung parliament. Sturgeon’s price would almost certainly be an independence referendum — a move that Labour Shadow Chancellor John McDonnell has said he is amenable to.\n\nThe irony of Davidson’s career is that her success was made possible by the rise of Scottish nationalism, but her demise was facilitated by her own Conservative colleagues, particularly those in London.\n\nQuite where this leaves a party that has always been less popular than its departing leader is unclear. Behind the eye-catching electoral successes, the Scottish Conservatives appear to be as far from power as when Davidson took over in 2011. Unlike then, a Tory prime minister now depends on Scottish seats to govern.\n\n“Unless Scotland is different to every other country in Europe then we should have a center-right party capable of getting into government,” said Maciver.\n\n“But the SNP will be in power until a party comes along that can beat them and that hasn’t happened yet.”", "description": "Resignation raises serious questions for the Conservative Party north and south of the border.", "authors": ["Peter Geoghegan", "Emilio Casalicchio", "Charlie Cooper"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/08/GettyImages-1164615797-1200x628.jpg"}