{"pub": "investing.com", "url": "https://au.investing.com/news/forex-news/australia-nz-dlrs-back-to-earth-as-bulls-bail-out-1979035", "downloaded_at": "2019-10-25 02:30:07.663440+00:00", "title": "Australia, NZ dlrs back to earth as bulls bail out", "language": "en", "text": "© Reuters. Australia, NZ dlrs back to earth as bulls bail out\n\nBy Wayne Cole\n\nSYDNEY, Oct 25 (Reuters) - The Australian and New Zealand dollars nursed losses on Friday as a fresh bout of Brexit uncertainty undermined risk sentiment and bulls bailed on long positions after a failure to breach key chart barriers.\n\nThe Aussie AUD=D3 slipped to $0.6819, leaving it down 0.6% on the week, having backed away from tough resistance at the September top of $0.6895. Support now comes in at $0.6810 and $0.6774.\n\nThe dollar NZD=D3 eased to $0.6376, having also failed to clear its September high of $0.6450. Near-term support lies at $0.6354.\n\nInvestors are looking ahead to the U.S. Federal Reserve's policy meeting on Oct. 30 when it is considered almost certain to cut rates a quarter point, and may leave the door open to further easing if needed. FEDWATCH\n\nSuch a move would pile pressure on the Reserve Bank of New Zealand (RBNZ) to ease at its meeting on Nov. 13 or risk an unwelcome increase in the kiwi.\n\nFutures imply around an 85% chance of a quarter-point cut to 0.75%, with a further move to 0.5% seen likely next year. RBNZWATCH\n\nThe Reserve Bank of Australia (RBA) has already got to 0.75% following three cuts since May and is thus considered likely to sit out a move at its meeting on Nov. 5.\n\nFutures are pricing in a slim 18% chance 0#YIB: of a quarter-point cut, though that rises to round 54% for December and 86% for February next year.\n\nThose odds might shift if inflation data due next Wednesday prove as soft as many expect.\n\n\"This would ensure that rates markets maintain a reasonable risk of another RBA easing before year end, capping A$ rallies,\" said Westpac senior forex analysts, Sean Callow.\n\n\"Overall, a decent risk environment should support on dips below $0.6800,\" he added. \"But again $0.6900 has not given way and speculative short A$ positions are proving persistent.\"\n\nThe dovish outlook is helping keep bond yields not far from record lows. Three-year bond yields stand at 0.70%, compared to 1.83% at the start of this year.\n\nThe three-year bond future YTTc1 added 2.5 ticks on Friday to stand at 99.305, while the 10-year contract YTCc1 gained 3 ticks to 98.9450.\n\nNew Zealand government bonds 0#NZTSY= also rallied with yields falling almost 6 basis points at the long end of the curve. (Editing by Shri Navaratnam)", "description": "Australia, NZ dlrs back to earth as bulls bail out", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEAAB0VB_L.jpg", "published_at": "2019-10-25"}