{"pub": "cbc", "url": "https://cbc.ca/sports/basketball/nba/nba-raptors-bulls-recap-oct-26-1.5337030", "downloaded_at": "2019-10-27 04:00:03.562455+00:00", "title": "CBC Sports", "language": "en", "text": "Pascal Siakam scored 19 points, OG Anunoby added 17 and the Toronto Raptors spoiled Chicago's home opener by beating the Bulls 108-84 on Saturday night.\n\nThe defending NBA champions went on a run in the second quarter to take a 48-40 halftime lead and pulled away for their 10th straight win over the cold-shooting Bulls.\n\nAnunoby hit three 3-pointers, and Serge Ibaka added 18 points and seven rebounds. Fred VanVleet scored 16 as the Raptors shook off a loss Friday in Boston.\n\nThe Bulls see themselves as playoff contenders coming off a 22-60 season that ranked among the worst in franchise history. But they hardly looked the part, shooting just 30.2% overall and 9 of 35 on 3s.\n\nWATCH | OG Anunoby lifts Raptors past Bulls\n\nIt was all OG Anunoby in Toronto's dominant win against the Bulls. The Raptors' forward did a bit of everything including coming up with a few highlight reel worthy blocks. 1:27\n\nWendell Carter Jr. led Chicago with 12 points and 11 rebounds. Zach LaVine scored 11 after averaging 26.5 over the first two games. Lauri Markkanen struggled again, finishing with nine points for the second straight night. The 7-footer from Finland shot 3-of-10 after going4-for-15 in a loss at Memphis.\n\nIt didn't help Chicago that Otto Porter Jr. missed most of the second quarter after taking what appeared to be an inadvertent elbow to the face while drawing a charge against Stanley Johnson. Porter spent several minutes lying face down as blood poured out, leaving a puddle on the court. He went straight to the locker room with the team's medical staff to get stitches and returned to start the second half.\n\nBy then, the Raptors led by eight after outscoring Chicago 17-4 over the final six and-one-half minutes of the second quarter.\n\nMarc Gasol and Kyle Lowry hit consecutive 3s. Anunoby added another from beyond the arc to bump it to 62-46 with 7:47 left in the third, and the Raptors remained in control the rest of the way.", "description": "Pascal Siakam scored 19 points, OG Anunoby added 17 and the Toronto Raptors spoiled Chicago's home opener by beating the Bulls 108-84 on Saturday night.", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5337169.1572143617!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/raptors-bulls-102619.jpg", "published_at": "2019-10-27"}