{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/mum-who-gave-birth-niece-20525535", "downloaded_at": "2019-10-07 00:15:01.080979+00:00", "title": "Mum who gave birth to her own niece says surrogacy is an 'addiction'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA mum says she finds surrogacy as an 'addiction' and after giving birth to her own niece she wants to do it again.\n\nJenna Newell, 30, from Llanelli, recently decided to give her cousin a child of their own after they struggled to naturally conceive.\n\nJenna decided to do it while pregnant with her second child, reports Wales Online.\n\nShe gave birth to her daughter and less than six months later she was pregnant with her cousin's child.\n\nThere are two types of surrogacy; traditional and gestational. Traditional is where the surrogate's own eggs are used, and gestational is where a sperm and egg from others are used, sometimes from the Intended Parents (IP).\n\nInitially, Jenna was hoping to go down the gestational surrogacy route.\n\n(Image: Wales Online WS)\n\nJenna said: \"I signed up to surrogacy UK , and it was after I had revealed this to my family that my cousin came forward and told me they were having trouble conceiving. I had no idea.\n\n\"At first we were looking into getting an egg donated, but when we realised how much more medical intervention was involved, we decided to go for a traditional surrogacy.\n\n\"It worked out as my cousin would then have a biological link to the baby.\"\n\nTraditional surrogacy can be initiated at home with an insemination method, but Jenna and the Intended Parents opted to go to a clinic.\n\n\"The fact it was my egg didn't change my feelings about the surrogacy.\n\n\"We were done having our children after our two and I was considering egg donation anyway.\"\n\nJenna's family were initially sceptical about the idea of surrogacy.\n\nShe added: \"My husband always knew from when we met that I wanted to be a surrogate, but he never thought it would happen. When we found out my cousin wanted a baby, but was struggling, he said I just had to do it.\n\n\"He was always worried that I would be a surrogate for a couple and then they would just leave with the baby, and I would have no contact or relationship, but this way we knew I wouldn't feel used.\n\n(Image: Wales Online WS)\n\n\"My parents were initially a bit worried about the idea, but as soon as they realised it was for someone they knew they were really happy about it.\"\n\nBefore Jenna knew of her cousin's fertility issues she had been in talks with a couple who lived a seven-hour drive away.\n\nShe said: \"It didn't work out as I was worried they would have missed the birth as they were so far away, and also you have to build up that trust to know you would get updates or stay in touch.\n\n\"I'm not there to be a parent at all, but I've heard stories of surrogates who have never heard from the family again and have felt used.\"\n\nDuring the surrogacy process Jenna ran a blog called Then There Were Three and signed up to exclusively surrogate Facebook groups to try to build relationships with fellow women going through the same thing.\n\n\"Sometimes you would get someone slip through the net,\" Jenna said, adding \"two days after I gave birth to my niece I had a message asking if could be their surrogate, at that point I was like, 'erm, no'.\"\n\nThis wasn't the only message like this that Jenna received.\n\n\"I had a message from one woman which said that she had bad morning sickness in her pregnancy and could I have her next one for her, then even someone asking how much I charge which was ridiculous.\"\n\nIn the UK is it illegal to advertise for a surrogate and to pay them.\n\nSurrogacy is technically a gift, although any expenses for the surrogate are expected to be paid by the intended parents, so that the surrogate is not out of pocket by the process.\n\n(Image: Wales Online WS)\n\nThe expenses can include fuel and parking for attending appointments, loss of earnings, maternity clothing, pregnancy vitamins and food for cravings.\n\nJenna said: \"Usually, average expenses for a surrogacy in the UK can range from £7,000 to £15,000, but the only thing we needed really was for loss of earnings for my husband as he took a week off work once the baby was born for my recovery, and my cousin drove me to most appointments and bought me vitamins. I also had maternity clothes from my most recent pregnancy so that saved lots of money.\"\n\nAside from the creation of a new family, there is another aspect to surrogacy, filled with legal admin.\n\nBoth Jenna and her husband, along with the Intended Parents, had to adjust their wills so, for example, if Jenna passed away, none of her estate would be left to the new baby.\n\nLegally in the UK, Jenna and her husband had legal rights over the baby until a Parental Order was able to go through the courts, which took 6 months after the birth.\n\n\"It was scary and annoying,\" Jenna recalled.\n\n\"I had to go and register the birth, and until the baby was six weeks old, it was myself and my husband who had to go on the birth certificate, because we are married, even though we weren't the parents.\n\n\"I had to give consent to my cousin for her to register the baby at the doctors.\n\n\"It makes me grateful that I decided to do surrogacy with someone I already knew and trusted and vice versa, as legally the surrogate can have the final say and change their minds, as could the intended parents, leaving you with a baby you weren't expecting, but that is very rare.\"\n\n(Image: Wales Online WS)\n\nThe service Jenna experienced medically, she said, was incredible.\n\n\"When I was 16 weeks pregnant my midwife asked my cousin if she intended to breastfeed, which not many people know is possible. She was referred straight away to induce lactation and was eventually able to successfully breastfeed.\n\n\"Even at the hospital, after I gave birth, they had to put tags on the baby to match my own name, but they also gave tags to mum that match the baby too. It's something that is so lovely to keep and I know it meant a lot to her.\"\n\nJenna was allowed three people in the birthing room with her; her husband and the Intended Parents. The midwives allowed the IPs to make the decision of delayed cord clamping and the mother was told to remove her top so that the baby could be put straight on her skin.\n\nWhen asked if she would go through the process again, Jenna said: \"Yes. I wish I was pregnant now. I would love to have a little sibling for my neice. Towards the end of the pregnancy I had decided that I wouldn't do it again, but seeing them become a family, and how amazing they are as parents, it gave me such a buzz.\n\n\"Other surrogates I spoke to said that I would want to do it again, and I do, it's an addiction.\n\nJenna is now studying to become a midwife and is still running her blog, which can be found here .", "description": "Jenna Newell, 30, stepped forward when she discovered her cousin was having fertility issues and now wants to do it again", "authors": ["Megan Griffiths", "Image", "Wales Online Ws"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20525544.ece/ALTERNATES/s1200/0_Jenna-Newall.jpg", "published_at": "2019-10-06"}