{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/physicists-win-nobel-prize-for-finding-exoplanet-around-a-sun-like-star-and-for-helping-develop-theory-of-the-universe", "downloaded_at": "2019-10-09 02:12:07.606556+00:00", "title": "Physicists Win Nobel Prize For Finding Exoplanet Around A Sun-Like Star And For Helping Develop Theory Of The Universe", "language": "en", "text": "Jim Peebles, Didier Queloz, and Michel Mayor (Photo: Flickr User pollosaurio, M. McCaughrean, Franck Schneider, Flickr/Wikimedia Commons)\n\nThe 2019 Physics Nobel Prize will be awarded half to James Peebles of Princeton University, and half jointly to Michel Mayor and Didier Queloz of the University of Geneva in Switzerland, for theoretical work improving our understanding of the universe and for the discovery of an exoplanet orbiting a Sun-like star, respectively.\n\nThe annual award is considered among the most prestigious for physicists, and this year’s prize is devoted to “contributions to our understanding of the evolution of the universe and Earth’s place in the cosmos,” on the planetary and the universal scale, according to the Royal Swedish Academy of Sciences.\n\nToday’s model to describe the universe in the most general sense is called ΛCDM, representing a cosmological constant plus cold dark matter, and is the result of decades (or even centuries) of scientists, mathematicians and philosophers thinking about the night sky.\n\nMuch of it began with Albert Einstein’s famed theory of general relativity, in which a mathematical term called the “cosmological constant” serves almost as a tuning knob to adjust the expansion of the universe, as well as Edwin Hubble’s famous observation showing that the universe is expanding. Scientists have since realised that there are three core components that govern the universe’s behaviour and fate: the least important part (regular matter and energy); some mysterious mass that determines the universe’s structure, which we call dark matter; and an even more mysterious innate energy of space, called dark energy.\n\nMuch of the evidence that this theory correctly describes our universe comes from observations of the most distant radiation in the sky, called the cosmic microwave background, and theoretical work to understand this light.\n\nPeebles was one of the physicists whose work served to theorise the behaviour of this radiation and its tiny temperature fluctuations, to link it to the behaviour of dark matter and dark matter’s serving as the universe’s scaffolding, and to re-introduce the cosmological constant mathematics to explain dark energy. Observations of the universe have continued to verify Peebles’ and other physicists’ work.\n\nWhile Peebles helped us better understand the entire universe, Mayor and Queloz helped reveal our place in it. Scientist Otto Struve first proposed a way to look for planets around other stars based on the way they affected the starlight we see from Earth — a change to the stars’ radial velocity, inducing a shift in the colour of its light, caused by an exoplanets’ gravity.\n\nVarious groups worked to develop observational methods to hunt for these small shifts, but by 1994, scientists were only able to detect exoplanets around rotating neutron stars called pulsars, and they had found none around Sun-like stars.\n\nLate that year, Mayor and Queloz began to see small fluctuations in the light from the Sun-like star 51 Pegasi that repeated every four days. They observed this blinking using an instrument called a spectrograph attached to a relatively small telescope in France. They made their announcement in 1995: They had discovered a Jupiter-sized exoplanet orbiting close to the star. Though the findings was initially met with scepticism, astronomers have since uncovered thousands of exoplanets, proving Mayor and Queloz right.\n\nRetrospectively, the discovery sparked a new era of exoplanet hunting that continues to this day.\n\n“This was a combination ‘greatest hits’ award to Peebles for his numerous contributions to theoretical cosmology, and to Mayor and Queloz for a wonderful discovery,” Brian Keating, physics professor at the University of California, San Diego and author of Losing the Nobel Prize, told Gizmodo in an email. But he noted that these prizes are the results of decades of work from other scientists, many of whom are dead and as such cannot win the prize — something he himself has railed against.\n\nSome physicists have already noted that this year’s prize has reopened old wounds. Though Mayor and Queloz’s work is important, a team of scientists led by David Latham had discovered a large companion to the star HD 114762 back in 1989. Also influential to early exoplanet research was Geoff Marcy, who sullied the field with his long history of sexual harassment.\n\nThough Peebles produced important work, plenty of other physicists produced equally important papers in developing modern cosmology. The prize reminded some that Vera Rubin died without receiving a Nobel Prize, which many physicists believe she deserved for her observational work bolstering the presence of a dark matter-induced anomaly in the universe (work analogous to that which earned three male physicists the Nobel Prize in 2011).\n\nIn many ways, a prize that only awards three people cannot capture the collaborative reality of the field, and promotes the incorrect idea that the best physics consists of a bunch of old (typically male) Einsteins working on their own.\n\n“Any recognition that goes solely to one person or only two or three is a reflection of the politics of visibility in our discipline, which includes the way certain demographic groups have an easier time achieving scientific notability than others,” Chanda Prescod-Weinstein, assistant professor in physics and core faculty in Women’s Studies at the University of New Hampshire, told Gizmodo.\n\nIt is true that this years’ winners made indispensable contributions to physics and cosmology. Physicists continue to hunt for something to explain dark matter and dark energy, while the American astronomy community may soon recommend the United States build a telescope sensitive enough to hunt for signs of life on distant exoplanets.\n\nBut, as I do every year, I’ll remind you that maybe it’s time we rethink the Nobel Prize and who it celebrates.", "description": "The 2019 Physics Nobel Prize will be awarded half to James Peebles of Princeton University, and half jointly to Michel Mayor and Didier Queloz of the University of Geneva in Switzerland, for theoretical work improving our understanding of the universe and for the discovery of an exoplanet orbiting a Sun-like star,...", "authors": ["Tegan Jones"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/lrllezubqj8rt2dbjybz.jpg", "published_at": "2019-10-09"}