{"pub": "businessinsider", "url": "https://businesstimes.com.sg/stocks/australia-shares-eke-out-slight-gains-as-miners-drag ", "downloaded_at": "2019-10-15 08:03:52.401419+00:00", "title": "Australia shares eke out slight gains as miners drag", "language": "en", "text": "The S&P/ASX 200 index finished up 0.1 per cent at 6,652.00 for a fourth successive session of gains.\n\n[SYDNEY] Australian shares managed only modest gains on Tuesday, with sentiment hurt by concerns over a slowdown in top consumer China and declines in miners.\n\nThe S&P/ASX 200 index finished up 0.1 per cent at 6,652.00 for a fourth successive session of gains.\n\nMore evidence of weakness in the world's second-largest economy, already battered by a bruising trade dispute with the United States, curbed risk sentiment.\n\nChina's factory gate prices declined at their fastest pace in more than three years in September, data showed on Tuesday. The downbeat figures followed Chinese trade data on Monday showing a slide in exports picking up pace in September while imports contracted for a fifth straight month.\n\nsentifi.com Market voices on:\n\nAcross the Tasman Sea, the New Zealand benchmark closed up 0.2 per cent at 11,045.34, marking its third straight session of gains.\n\nRetirement village operator Arvida Group was the top percentage gainer on the New Zealand benchmark, closing 3.4 per cent higher at a record high of NZ$1.54.\n\nFisher & Paykel Healthcare Corp extended its gains to a third successive session, putting on 2.6 per cent, a day after it upgraded full-year guidance.\n\nREUTERS", "description": ": THE BUSINESS TIMES Stocks - [SYDNEY] Australian shares managed only modest gains on Tuesday, with sentiment hurt by concerns over a slowdown in top consumer China and declines in miners. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/articles/2019/10/15/doc77jiqlueaph1fgbqvm05_doc76jitoc6hfs1anfy3da6.jpg?itok=OSp5AZIR", "published_at": "2019-10-15"}