{"pub": "telegraph", "url": "https://telegraph.co.uk/science/2019/10/28/fruit-flavoured-e-cigarettes-likely-addictive-study-suggests", "downloaded_at": "2019-10-28 04:30:18.543385+00:00", "title": "Fruit-flavoured e-cigarettes more likely to be addictive, study suggests", "language": "en", "text": "Teenagers who vape fruit-flavoured e-cigarettes have a greater chance of becoming addicted, a study indicates.\n\nResearchers in California found 15 to 17-year olds who tried flavours such as vanilla, watermelon or grape, were 22 per cent more likely still to be vaping six months later than those using traditional tobacco or menthol flavour.\n\nThey also had a greater chance of vaping more frequently and taking more puffs each time they picked up an e-cigarette.\n\nPublished in the journal Pediatrics, the study comes weeks after Donald Trump promised to ban flavoured e-cigarettes due to fears over the risk to children.\n\nDame Sally Davies, who stepped down as Chief Medical Officer for England this month, has also called for a ban.\n\nThe follow a number of suspicious deaths and illnesses linked to e-cigarette use, and a spate of studies suggesting vaping may be dangerous.\n\nPublic Health England recommends smokers try vaping as a means of giving up and says the practice is, at most, just five per cent as dangerous as smoking cigarettes.\n\nHowever, critics have said officials have no way of knowing this and that the full dangers of vaping will only become apparent in the long term.\n\nFor the new research, scientists at the University of Southern California followed 478 teenagers in Los Angeles every six months for two years.\n\nNine out of 10 vaped fruit, candy and other non-traditional flavours.\n\nSixty-four were still vaping six months after first being surveyed, compared to 42.9 of those smoking traditional flavours.\n\nProfessor Adam Leventhal said: \"Teens who use e-cigarettes may be more inclined to continue vaping rather than just temporarily experiment with e-cigs.\n\n“Whether or not children continue vaping is important.\n\n“The longer and more frequently you vape, the more you're exposing yourself to toxins in e-cigarette aerosol and put yourself at risk for nicotine addiction.\"", "description": "Teenagers who vape fruit-flavoured e-cigarettes have a greater chance of becoming addicted, a study indicates.", "authors": ["Henry Bodkin", "Health Correspondent"], "top_image": "https://www.telegraph.co.uk/content/dam/business/2019/09/09/TELEMMGLPICT000208729135-xlarge_trans_NvBQzQNjv4BqqiUuvBizZT2q34Osm0tNw3X0aGPApSYsoTfgejYXeyQ.jpeg?imwidth=1200", "published_at": "2019-10-28"}