{"pub": "cnbc", "url": "https://cnbc.com/2019/10/24/analysts-surprised-by-teslas-third-quarter-earnings-report.html", "downloaded_at": "2019-10-24 13:57:30.973331+00:00", "title": "Here's what every major Wall Street analyst is saying about Tesla's surprisingly good quarter", "language": "en", "text": "SpaceX owner and Tesla CEO Elon Musk gestures during a conversation at the E3 gaming convention in Los Angeles, June 13, 2019.\n\nWall Street analysts reacted with pleasant surprise after Tesla's earnings report topped expectations on Wednesday after the bell. The company posted a third quarter profit and said it was ahead of schedule on production of its Model Y and Shanghai factory.\n\nShares of the company were up as much as 20% after Wednesday's report and opened up over 19% in early trading.\n\nHere's what the major analysts had to say about Tesla's earnings report:\n\n\"While we remain concerned on 2020 momentum / profitability, we acknowledge this was an outstanding quarter relative to lowered expectations despite mixed headwinds which we expect could increase as Model Y launches.\" analysts at Evercore ISI said.\n\nThe feeling was much the same from analysts at Bernstein.\n\n\"The +20% move in the aftermarket likely says it all, but Q3 was a good quarter for Tesla,\" analyst Toni Sacconaghi wrote to clients.\n\nBut the firm also gave a word of warning.\n\n\"We worry that Tesla's 2H 19 is currently shaping up to look a lot like the company's ebullient 2H 18, when the stock last peaked at $370. The fear, however, is that Tesla's subsequent 1H 20 may look like the disastrous 1H 19, when the stock troughed at $190,\" he said.\n\nAnother firm acknowledged the report was pretty good but was taking a wait-and-see approach.\n\n\"We expect a positive reaction in Tesla shares owing to the magnitude of 3Q beat, but are unsure that this is really the breakout quarter that is likely to be claimed by the bulls,\" analysts at J.P. Morgan said.\n\nHere's what every major analyst is saying:", "description": "Major Wall Street analysts liked Tesla's solid third quarter earnings report but want to see more from the company going forward.", "authors": ["Michael Bloom"], "top_image": "https://image.cnbcfm.com/api/v1/image/105968995-1560512715227rtx6z8xd.jpg?v=1560512743", "published_at": "2019-10-24"}