{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-rugby-union-worldcup-sco-rus/scots-still-planning-for-japan-showdown-despite-typhoon-threat-idUKKBN1WO1CD", "downloaded_at": "2019-10-09 12:51:27.430500+00:00", "title": "Scots still planning for Japan showdown despite typhoon threat", "language": "en", "text": "FUKUROI CITY, Japan (Reuters) - Scotland will continue to prepare as planned for their crucial Pool A clash with Japan in Yokohama on Sunday despite the fixture being threatened by a powerful typhoon tracking towards the Tokyo region, coach Gregor Townsend said.\n\nRugby Union - Rugby World Cup 2019 - Pool A - Scotland v Russia - Shizuoka Stadium Ecopa, Shizuoka, Japan - October 9, 2019 Scotland's Duncan Taylor, Tommy Seymour and John Barclay celebrate scoring a try REUTERS/Annegret Hilse\n\nJapan’s Meteorological Agency is monitoring Typhoon Hagibis, which is expected to lash southern Honshu over the weekend and could put matches in the area in jeopardy.\n\nScotland’s bonus-point victory over Russia at Shizuoka Stadium on Wednesday ensured that their clash with Japan will determine who qualifies for the quarter-finals.\n\n“It does look like it is heading into Tokyo this weekend,” Townsend told reporters after his team’s 61-0 victory. “It is a few days away and it could miss the Tokyo area or could still go there.”\n\nTournament rules state that any pool game which cannot be played will not be rescheduled and instead be recorded as a 0-0 draw, with bonus points unavailable. That would ensure Scotland fail to reach the quarter-finals for just the second time in the tournament’s history.\n\nTownsend said he was unsure whether World Rugby had back-up plans, with media reports suggesting they were considering shifting games to other cities or to other dates.\n\n“We will be getting updates from World Rugby over the next two days over what the contingencies are,” he said.\n\n“I am sure that alternative venues or arrangements are being looked at. Not just our game, but England and France play in the same stadium the night before.\n\n“I don’t know if that’s getting looked at for the Ireland-Samoa game (on Saturday) as well, with it being first forecast as (hitting) Fukuoka.”\n\nTownsend said he felt his players had done what was required on Wednesday to put themselves in position to dash the hopes of the tournament hosts of reaching the knock-out stages for the first time.\n\n“It was a tough game,” Townsend said. “The scoreline doesn’t suggest that, but the effort that went into getting that scoreline by putting pressure on the Russian defence to open up spaces was huge from my players.\n\n“Getting the bonus point ... we knew that if we hadn’t got that, Sunday would have been difficult, so getting that was excellent.\n\n“Getting a big score will also keep things interesting for Saturday, as well with the Ireland-Samoa game.\n\n“But also for the confidence - the players know that for two games now we haven’t conceded a point, that’s very encouraging.”", "description": "Scotland will continue to prepare as planned for their crucial Pool A clash with Japan in Yokohama on Sunday despite the fixture being threatened by a powerful typhoon tracking towards the Tokyo region, coach Gregor Townsend said.", "authors": ["Greg Stutchbury", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191009&t=2&i=1438823348&w=1200&r=LYNXMPEF98121", "published_at": "2019-10-09"}