{"pub": "indiatimes", "url": "https://indiatimes.com/trending/wtf/london-couple-plans-murder-of-adopted-son-378080.html", "downloaded_at": "2019-10-18 10:46:56.611819+00:00", "title": "UK Couple Reportedly Planned Heinous Murder Of Adopted Son In India For Rs 1 cr, Face Trial", "language": "en", "text": "A couple living in London are facing calls to be extradited to India for allegedly planning the murder of their 11-year-old adopted son for an insurance payout.\n\nIndian authorities believe that the couple arranged for their 11-year-old son to be killed for Rs 1.3 cr insurance pay out.\n\nTwitter\n\nAirport worker Arti Dhir, 55, and Kaval Raijada, 30, have however denied planning the abduction and fatal stabbing of Gopal Sejani in 2017.\n\nThe husband and wife, from Hanwell, had travelled to Keshod, a town in Gujarat, to adopt an orphan in 2015. Indian authorities say the couple placed an advert in a local newspaper, promising they would take an adopted child to live in London, reports MailOnline.\n\nDon't Miss 20.9 K SHARES 14.3 K SHARES 18.6 K SHARES 7.5 K SHARES 5.4 K SHARES\n\nDhir took out a Rs 1,36,00,00 insurance policy in Gopal's name which would pay out after 10 years - or in the event of his death.\n\nShe was alleged to have paid two premiums soon after the adoption, according to legal documents.\n\nTwitter/Mail Online\n\n\"It was a huge amount and she paid two premiums, knowing very well that in the event of Gopal's death, she would be paid 10 times the insured amount.\" Superintendent Saurab Singh of Junagadh Police, in Gujarat,\n\nAccording to reports, the boy named Gopal Sejani had been abducted by two men on motorbikes then stabbed and left on a road in Gujarat in 2017. He died of his injuries later that month.\n\nDhir and Raijada face six charges in India, including conspiracy to murder and kidnapping.\n\nThey were arrested in the UK in June 2017 after a request from the Indian government but on July 2 this year, a judge at Westminster Magistrates' Court refused their extradition on human rights grounds.", "description": "Airport worker Arti Dhir, 55, and Kaval Raijada, 30, have however denied planning the abduction and fatal stabbing of tragic orphan Gopal Sejani in 2017. According to reports, the boy named , Gopal Sejani had been abducted by two men on motorbikes before he was stabbed and left on a road in Gujarat in 2017. He died of his injuries later that month.", "authors": ["Kc Archana"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/uk_couple_1571391304_800x420.jpg", "published_at": "2019-10-18"}