{"pub": "wsj", "title": "If You Plan on Retiring Soon, Take a Test Drive", "url": "https://wsj.com/articles/if-you-plan-on-retiring-soon-take-a-test-drive-11553178996?mod=rsswn", "language": "en", "published_at": "2019-03-21", "downloaded_at": "2019-09-03 00:06:20.137570+00:00", "text": "I plan to retire in 2020. Any advice for a person a year or two out from retirement? What steps or tasks are more important than others?\n\nIf at all possible, you should put your retirement plans through a test-drive.\n\nGranted, this might sound strange. Most people, seemingly, don’t need to “practice” retiring. (After all, what’s so difficult about not working?) In truth, though, retirement probably will come as a shock to your wallet and lifestyle, and if you can test your planned budget and daily routines before walking away from the office, the transition should be easier.\n\nStart with your time—what you think a typical week might look like. Fill in your calendar with as many specifics as possible. Perhaps Mondays and Wednesdays are set aside for volunteer work. And Tuesdays for pickleball. And Thursdays for continuing-education classes. Write it all down.\n\nAsk a Question Have a question about planning for and living in retirement? Email askencore@wsj.com\n\nNext (and I realize this can be tricky for some) take a sabbatical (or, if you prefer, a “staycation”). Block out at least two (or, ideally, three) weeks of vacation—but spend the time at home, following the calendar you set up. (And, as one financial planner told us, if your boss can’t spare you for three weeks or so—then ask for a raise.)\n\nThe first goal here is to find out if you’re really meant to retire. Are you bored after just two weeks of a trial run? Or does something on your experimental calendar need to be tweaked? As we have discussed in earlier columns, many people focus solely on their finances when it comes to retirement. But trying to figure out what an average week might involve is equally important.\n\nSpeaking of money, I will assume—if you’re a year or so from retiring—that you already have a budget on paper. (We discussed last month several tools that can help with this.) Try living on your retirement budget for, say, four to six months. If your plan, for instance, calls for a monthly income in later life that amounts to 80% of your current income, then limit your monthly spending to the smaller figure.\n\nIf you find yourself going through your money at a faster rate than you anticipated, you need to revisit your retirement budget. Remember: Many retirees have told us through the years that their expenses don’t go down in retirement. Rather, they are simply replaced by new ones: travel, helping family members, entertainment, etc.\n\nThe larger point here: Retirement has enough unknowns as it is. The more you can experience before you cross the starting line, the better.\n\n***\n\nI just turned 66, my full retirement age. My wife is 63. Neither of us is collecting Social Security. We plan for my wife to apply for benefits in the next month or so—after which I will apply for just a spousal benefit. I plan to wait until I turn 70 to switch to my benefit. If I die before I reach age 70, what would my wife collect, or be able to collect, as my survivor?\n\nThis question involves, first, a “restricted application,” applying for just a spousal benefit at full retirement age (as defined by the Social Security Administration) and then switching to one’s own benefit (based on one’s earnings history) at a later point in time—say, age 70. This option is available only to people born before Jan. 2, 1954.\n\nDay by Day How surveyed retirees say they are spending their time More time with family and friends 61% Pursuing hobbies 44% Traveling 39% Volunteer work 21% Taking care of grandchildren 15% Caregiving for a loved one 9% Pursuing an encore career 4% Continuing work in same field 4% Starting a business 1% None of the above 8%\n\nSecond, this question involves “delayed retirement credits,” the larger payouts that people receive by waiting to file for Social Security beyond their full retirement age. (Note: Benefits “max out” at 70; you gain nothing by waiting to file beyond that age.)\n\nTo answer your question, let’s say you die at 68. At that point, your wife would be eligible to collect the benefit you would have received based on your work record at 68, including any delayed retirement credits you would have earned. The fact that you filed (or, rather, plan to file) a restricted application “would have no impact on any potential survivor’s benefits upon death,” notes Darren Lutz, a public affairs specialist with the Social Security Administration. “A widow’s benefit is calculated on the deceased person’s earnings record, and if he or she earns delayed retirement credits, those credits would be credited to a widow’s benefit.”\n\nOne wrinkle: Your wife becomes eligible for your full benefit at her full retirement age. If she claims a survivor’s benefit before she reaches her full retirement age, she would receive a percentage of your benefit.\n\n***\n\nAnd finally, if you plan to continue working through your mid-60s and beyond to beef up your nest egg, spend some time with two recent, sobering reports. Continuing to work beyond what might be considered a normal retirement age can help your finances, as well as your health. But keep in mind that planning to work isn’t necessarily a guarantee of work.\n\nThat point is made painfully clear in two recent studies: “How Secure Is Employment at Older Ages?” from the Urban Institute and “A Precarious Existence: How Today’s Retirees Are Financially Faring in Retirement” from the Transamerica Center for Retirement Studies.\n\nThe former found that almost half of full-time workers ages 51 to 54 “experience an employer-related involuntary job separation after age 50 that substantially reduces earnings for years or leads to long-term unemployment.” The latter found that more than half of retirees (56%) retired sooner than they had planned because of layoffs, ill health and family responsibilities, among other reasons.\n\nThe point: Yes, working longer can be a smart strategy to bridge gaps in retirement savings. But it shouldn’t be the only one.\n\nMr. Ruffenach is a former reporter and editor for The Wall Street Journal. His column examines financial issues for those thinking about, planning and living their retirement. Send questions and comments to askencore@wsj.com.", "description": "Columnist Glenn Ruffenach advises those retiring in a year or two to try out their planned budget and daily routines before walking away from the office.", "authors": ["Glenn Ruffenach", "Cheryl Winokur Munk"], "top_image": "https://si.wsj.net/public/resources/images/WE-AB820_WEENCO_SOC_20190320122953.jpg"}