{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/8/editorial-federal-budget-deficit-is-now-the-highes", "downloaded_at": "2019-10-09 00:54:27.381694+00:00", "title": "Alarming deficit numbers", "language": "en", "text": "ANALYSIS/OPINION:\n\nA single death is a tragedy; a million deaths is a statistic, Joseph Stalin is reputed to have observed. (And as one of the most prolific murderers of the 20th century, Old Joe should have known of what he spoke.) Likewise, losing 20 or even 100 bucks is deeply annoying. But losing $1 trillion? Why, that’s mere statistic — indeed, to us mere mortals, $1 trillion is an unfathomable amount.\n\nPerhaps that’s why the political class in Washington — Democrats and Republicans alike — reacted to the latest news regarding the federal deficit with a shrug. But they shouldn’t have. The gap between what the federal government takes in and what it spends is now a bona fide national emergency. Yet, the latest news on this baleful state of affairs was drowned out in a sea of hysteria over impeachment, Syria, Turkey and, believe it or not, the movie “Joker.”\n\n“The federal budget deficit for 2019 is now the highest in seven years, coming in at an estimated at $984 billion. That comes to 4.7 percent of gross domestic product,” Fox Business reported on Monday. “The deficit is $205 billion higher than it was in 2018, a jump of 26 percent. The [Congressional Budget Office] has warned that the nation’s debt is on an unsustainable path.” Indeed, the federal government’s debt load now tops $22 trillion. If $1 trillion is a mere statistic, what, one wonders, is $22 trillion?\n\nAnnual deficits have only hit $1 trillion four times before, all during the presidency of Barack Obama. Mr. Obama and his counterparts in the then-Democratic-controlled Congress, of course, loved to spend Americans’ money — they blew nearly $1 trillion on an ill-designed “stimulus” during the first year of his presidency alone. But that president at least had the excuse that the economy was sputtering during the first years of his presidency, hammering tax receipts and leading to large deficits.\n\nWhat makes the current deficit numbers so alarming is that they are occurring while the economy is in rip-roaring rude health. Gross domestic product growth is healthy at around 2 percent per year. The job market is humming, with unemployment standing at only 3.5 percent — essentially full employment. Wages are ticking up, and with it income tax takings.\n\nSo what’s going on here? Blame skyrocketing, automatic entitlement spending for the horrifying deficits and skyrocketing debt.\n\nSpending on the three big entitlement programs is routinely growing between 5 percent and 6 percent a year, with Social Security and Medicare outlays increasing by $51 billion and $36 billion, respectively, year over year, the CBO reported in September. (Both of those represented increases of 6 percent.) Medicaid outlays, meanwhile, increased $16 billion from last year to this, good for an uptick of 5 percent. Interest payments on the debt are also rising, not only because the debt pile is growing ever taller but also because interest rates have spiked.\n\nNeedless to say, while outlays on the three big entitlement programs are growing 5 percent or 6 percent, neither the economy nor tax receipts are. That creates a big problem — and $1 trillion deficits.\n\nIt’s a problem, alas, that Washington, D.C., seems reluctant to address. President Donald Trump had made it clear that he won’t touch entitlements. The Democrats, too, have shown no interest in even basic reforms, like raising the retirement age for certain classes of white-collar workers. The leading Democratic presidential candidates have even spoken fancifully of expanding entitlement spending. But this is an unsustainable situation that can’t — and won’t — go on forever.\n\nSign up for Daily Opinion Newsletter Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "A single death is a tragedy; a million deaths is a statistic, Joseph Stalin is reputed to have observed. (And as one of the most prolific murderers of the 20th century, Old Joe should have known of what he spoke.) Likewise, losing 20 or even 100 bucks is deeply annoying. But losing $1 trillion? Why, that's mere statistic — indeed, to us mere mortals, $1 trillion is an unfathomable amount.", "authors": ["The Washington Times Http", "The Washington Times"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/07/11/budget_deficit_66995_c0-195-4679-2923_s1770x1032.jpg?01f39d774687650712880b345dbc5aafa17d9ccb", "published_at": "2019-10-08"}