{"pub": "yahoo", "url": "https://news.yahoo.com/trump-asks-top-court-toss-173708749.html", "downloaded_at": "2019-10-26 07:47:55.091407+00:00", "title": "Trump Asks Top Court to Toss California Immigrant Sanctuary Law", "language": "en", "text": "(Bloomberg) -- President Donald Trump’s administration asked the U.S. Supreme Court to throw out a California immigrant-sanctuary law that restricts local police from helping federal authorities round up and deport people who are in the country illegally.\n\nIn an appeal filed this week, the administration said the 2017 measure undermines federal immigration enforcement efforts.\n\nThe law “makes it more difficult for federal officers to identify, apprehend, detain, and remove aliens under the procedures specified by Congress,” U.S. Solicitor General Noel Francisco argued. “The result is that more removable aliens -- often with criminal records -- are released into the community.”\n\nThe San Francisco-based 9th U.S. Circuit Court of Appeals upheld the measure in April, saying federal immigration law doesn’t require state authorities to actively assist with deportation efforts.\n\nThe state law bars local officials from holding an immigrant at the request of federal officials or telling those officials when an immigrant is about to be released from jail. It makes exceptions for serious criminal cases and those involving a judicial order.\n\nThe timing of the appeal gives the Supreme Court the ability to add the case to the nine-month term that runs through the end of June. The justices are already considering Trump’s bid to rescind President Barack Obama’s program of deferred deportation for hundreds of thousands of people who came into the country illegally as children. The court will hear arguments in that case next month.\n\nCalifornia and the 9th Circuit have drawn Trump’s repeated ire for thwarting his immigration policies. The state is among those challenging the president’s rescission of the deferred-deportation program.\n\nThe new case is United States v. California, 19-532.\n\nTo contact the reporter on this story: Greg Stohr in Washington at gstohr@bloomberg.net\n\nTo contact the editors responsible for this story: Joe Sobczyk at jsobczyk@bloomberg.net, Laurie Asséo\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- President Donald Trump’s administration asked the U.S. Supreme Court to throw out a California immigrant-sanctuary law that restricts local police from helping federal authorities round up and deport people who are in the country illegally.In an appeal filed this week, the administration", "authors": ["Greg Stohr"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-25"}