{"pub": "nymag", "url": "https://vulture.com/2019/10/looking-for-alaska-episode-7-recap-now-comes-the-mystery.html", "downloaded_at": "2019-10-22 13:19:34.206936+00:00", "title": "Looking for Alaska Recap: (At Least Try to) Do the Right Thing", "language": "en", "text": "Looking For Alaska “Now Comes the Mystery” Season 1 Episode 7 Editor’s Rating 5 stars * * * * * « Previous Next Photo: Alfonso Bresciani/Hulu\n\nHow do we reconcile ourselves to tragedy? What responsibilities do we have — as individuals, as members of families, friendship groups, classes, workplaces — to help others manage their grief? When do we ask “Why did this happen?” and when do we ask “What can we do now?” “Now Comes the Mystery” doesn’t fully answer any of these questions, but it starts to address them, with great care and humanity. And tears. So, so many tears.\n\nFirst, everyone needs to hear the terrible news that Alaska has died in a car wreck the night before. This announcement prompts Pudge to run for the nearest trash can to puke his guts out, but after his final heave, he brightens at the prospect that Alaska must be alive; this is the sort of over-the-top prank she would pull just to be a goofy, attention-seeking jerk. The Eagle assures Pudge that Alaska is dead: He saw Alaska’s body. Her death was instant, and because she didn’t swerve to avoid the police car that she hit at the scene of a broken-down truck, they assume her intoxication was the cause.\n\nEveryone in the gym is sobbing. Even Kevin and Holly are allowing themselves to be comforted in prayer by Dr. Hyde. Pudge collapses to the floor, sobbing now, too. Same. This is wrenching.\n\nIn the first echo of scenes from previous episodes, the Colonel shoves all of his belongings (including his pristine Do The Right Thing poster, which he rolls, then crumples hastily) into a duffel bag and marches over to the Eagle’s Nest, demanding to be kicked out. It all comes tumbling out in a big rush: The Colonel set the firecrackers to lure the Eagle out of his house the night before, and he let Alaska go because she swore she was okay to drive, and he just can’t bear not being punished for this.\n\nAt the end of this speech, the Colonel loses the last shreds of his composure, and the Eagle envelops him in a very loving, fatherly hug. I’m still in a one-way feud with the Eagle because of his handling of the Weekend Warriors’ parent demands in “We Are All Going,” but I also can’t imagine a better response to the Colonel’s present distress. The height difference between Timothy Simons and Denny Love is emphasized here for sincere sweetness and a reinforcement of the idea, previously articulated by Alaska’s mother, that big kids need their grown-ups, too.\n\nTakumi, ever the investigator, asks what happened the night before and is furious with Pudge and the Colonel for letting Alaska go: “She’s so goddamned impulsive, you have to watch her every second, she’s like a 3-year-old!” Hanging in his mind must be the bitter irony from their last conversation, when Alaska loftily declared Takumi far too young to understand the complexities of adult relationships.\n\nCampus-wide grief for Alaska has also been yielding an abundance of kindnesses: Lara checks on Pudge while he plays Mortal Kombat for hours on end. Takumi brings Pudge some food as a reconciliation gesture. He’s sorry he blamed Pudge and the Colonel, but they’d have gotten to this stage of self-recrimination anyway. Takumi sees Lara weeping quietly in her room and sits down to offer a shoulder and hug. Sara lets the Colonel know that Kevin and Longwell’s parents have dropped their complaint against him, so he won’t be expelled after all.\n\nClasses resume, and predictably, everyone is a complete wreck. At least Dr. Hyde has some philosophy that may help the kids work through their grief. The class’s attention will now turn to Alaska’s question: How will we ever get out of this labyrinth of suffering? When she handed in her paper in the previous episode, she said she must have failed the assignment because her question is impossible to answer, but Dr. Hyde believes that the best questions are the ones without definitive answers.\n\nRemember back in “Tell Them I Said Something,” when Pudge dithered over his precalc-group-study-date outfit? Now he struggles with his funeral ensemble, and in Alaska’s absence, he goes to Dr. Hyde for tie assistance. Both I and Dr. Hyde concur: This is a strong choice. Hyde has lots of good ties and lets Pudge wear the one he wore to stand outside the cemetery gates at Diego’s funeral. (Diego’s family wouldn’t permit him to attend, layering an extra indignity on top of his grief)\n\nDr. Hyde shares a piece of Buddhist philosophy that draws on the concept of suffering being an outcome of desire: “When you stop wishing things won’t fall apart, you’ll stop suffering when they do. Until then, this will hurt, but you will survive, until you don’t.” I am not fully down with this philosophy (largely because I think that perfect detachment is neither desirable nor attainable for most of us), but I appreciate what Dr. Hyde is trying to do here. It’s helpful to have alternate options for thinking through one’s experiences and sadnesses, even if you can’t use it in the moment.\n\nAfter checking off all of his students’ names as they exit the funeral bus, the Eagle remains aboard, not quite able to go into the church just yet. Longwell notices and turns back to check on him. The Eagle is wracked with regret and guilt, saying he was so focused on protecting his students and insisting that they listen to him that he failed to listen to them. He can see now that Alaska was in terrible pain, and his actions made her pain worse. Longwell responds that the entire school made it worse for her, but the Eagle won’t let himself off the hook, pointing out that it’s natural for kids to make those kinds of mistakes, but he should have done better.\n\nLongwell reminds him that “it’s not too late. We could all really use an adult right about now.” As Longwell stands up to exit the bus, I notice that his and the Eagle’s costumes — navy, light blue, and charcoal gray — rhyme with each other, as do their hairstyles. Longwell’s is a lightly mussed teen version of the Eagle’s early-period-Captain America-crossed-with-a-Kewpie-doll hair swoop. The suggestion that Longwell could grow up to be a mensch is the single most hopeful idea in the entire episode.\n\nDown at the post-burial luncheon at the American Legion hall, the Colonel is working up a righteous head of steam about what an asshole Alaska’s father is and how, ultimately, he is to blame for all the bad things that have happened this year. The Colonel jumps up, and in an echo of how he behaved toward the Weekend Warriors his first day on campus, attacks Alaska’s dad at the bar, shouting that he is to blame, he was the reason she couldn’t go home. Longwell and Kevin intercede when it looks like the Colonel might take a swing, with Dolores joining in to say you can’t attack a man who just buried his child, and apologizing for the Colonel, but Alaska’s dad de-escalates by agreeing with him. He knows that he lost Alaska years ago by holding her responsible for her mother’s death. He drove his only child away, and didn’t deserve her, and “now she’s gone, and I can never make it right.”\n\nPudge reflects on his and Alaska’s one perfect evening together and recalls suddenly that the phone was ringing as Alaska kissed him good-bye. Who would have called her that night? Turns out it was Jake, who had called to say that even though they’ve broken up, he’d always think of her on that day, because it’s the anniversary of the day they met. He has no idea why that would make her flip out and run screaming from the phone.\n\nBack at the smoking hole, the boys debate the significance of the call, with Takumi and the Colonel concluding that she must have felt bad about how she treated Jake and was driving up to his college to apologize in person. Pudge can’t accept it, but he doesn’t have an alternate explanation, either, and the argument ends where it began, in their shared grief.\n\nOh, hey, it’s the second Postal Service musical cue of the series! We’re treated to Iron & Wine’s suitably down-tempo acoustic version of “Such Great Heights” for a montage featuring the Eagle shaving off his mustache and Pudge finally calling his parents back. As ever, the Halters are so sweet and loving, offering anything to help him through this awful time, but just knowing he can call and that they’ll answer is enough to see him through for now.\n\nPudge returns to Alaska’s room to help the Colonel find and remove any contraband she might have left behind, and as they mourn the loss of so much of her Life’s Library, Pudge thinks of The General in His Labyrinth. Flipping to the page where Bolívar asks “How will I ever get out of this labyrinth?,” he sees Alaska’s marginalia: “straight and fast.” Straight and fast is how she drove into the crash. What if her death wasn’t an accident at all?\n\nFamous Last Words\n\n• If Pudge and the Colonel dig a literary grave for the most damaged titles in Alaska’s Life Library, I hope it will match the excellence of The Ultimate Book Return staged by Taystee and Poussey in Orange Is the New Black\n\n• Poetry Alert! Did you, like me, think that the passage Dr. Hyde read aloud at Alaska’s funeral was beautiful but not know what it was? I did a minor Google and learned that it was an excerpt from Wallace Stevens’s “Cy Est Pourtraicte, Madame Ste. Ursule, et Les Unze Mille Vierges,” which is, like Alaska herself, elusive and open to interpretation. I can also heartily recommend the full poem by W.H. Auden that Alaska quoted to Pudge in “The Nourishment Is Palatable,” “I Walked Out One Evening.” One doesn’t always expect to have one’s curiosity about modernist poetry piqued when sitting down to watch TV, but this medium is vast and contains multitudes.\n\n• Musical Cue of the Episode goes to Kat Cunning’s cover of “Orange Sky” for the gentle aptness of the refrain “My salvation lies in your love.”", "description": "How will we ever get out of this labyrinth of suffering? A recap of ‘Now Comes the Mystery,’ episode 7 of the Hulu miniseries Looking for Alaska, based on the novel by John Green.", "authors": ["Sophie Brookover"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/11/looking-for-alaska-recaps/looking-for-alaska-7.w1200.h630.jpg", "published_at": "2019-10-21"}