{"pub": "breitbart", "url": "https://breitbart.com/national-security/2019/09/16/al-qaedas-somali-branch-kills-17-people-over-weekend", "downloaded_at": "2019-10-05 06:09:38.334132+00:00", "title": "Al-Qaeda’s Somali Branch Kills 17 People over Weekend", "language": "en", "text": "Al-Shabaab, the al-Qaeda wing in Somalia, carried out a wave of attacks over the weekend using heavy weapons to kill at least 17 people in the East African country.\n\nOn Sunday, Voice of America (VOA) reported:\n\nLower Shabelle region officials told VOA Somali that the militants attacked the town of Qoryoley late Saturday using rocket-propelled grenades and heavy machine guns, killing nine people. The town’s Mayor Sayid Ali Ibrajim told VOA that an RPG fired by the militants caused most of the casualties. Somali government forces with support from African Union [AU] forces, who are based outside the town, repelled the attack, according to officials.\n\nSome of the residents in Qoryoley alleged that heavy weapons fired by AU troops caused some of the civilian casualties.\n\nGov. Ibrahim Adan Najah from the region that houses Qoryoley told Voice of America that authorities are probing the claims of troops targeting civilians.\n\nThe African Union Mission in Somalia (AMISOM) did not immediately respond to the allegations.\n\nOn Saturday, mortars fired by al-Shabaab (or al-Shabab) on the ancient port town of Marka during a visit by Somali Prime Minister Hassan Ai Khaire also killed two civilians.\n\nVOA noted:\n\nAl-Shabab claimed they were targeting the prime minister but … Governor Najah told VOA Somali that the incident took place outside the town. Residents and security sources said one of the mortars landed in a residential area killing two women. The prime minister was unharmed and has returned to Mogadishu safely.\n\nOn Sunday, al-Shabaab also targeted Gov. Najah’s convoy with a remote-controlled bomb, killing two bodyguards and injuring four others near the town of Shalanbod.\n\nMoreover, the al-Qaeda branch also killed four high-level regional officials, including the deputy governor for finances, and injured six others on Saturday in the nearby Middle Shabelle region.\n\nA report released on September 10 by the New York-based International Peace Institute revealed that al-Shabaab has killed “between 1,483 and 1,884” AMISOM troops between March 2007 and December 2018.\n\nBurundi, Ethiopia, Kenya, Djibouti, and Uganda also participate in the AMISOM peacekeeping mission in Somalia. The new report does not breakdown the fatalities by country of origin.\n\nU.S. President Donald Trump’s administration has increased airstrikes against al-Shabaab to unprecedented levels, a move that has led to a slight decline of attacks by the terrorist group.\n\nSomali-born Rep. Ilhan Omar (D-MN), however, complained in May that Trump has dramatically intensified American airstrikes on her native country.\n\nUnder pressure by the U.S. air campaign, the terrorist group has even resorted to executing some of its members and other civilians accused of espionage.\n\nThe U.S. military also lends assistance to AMISOM.", "description": "Al-Shabaab, the al-Qaeda wing in Somalia, carried out a wave of attacks over the weekend using heavy weapons to kill at least 17 people.", "authors": ["Edwin Mora"], "top_image": "https://media.breitbart.com/media/2019/09/file-somalia-people-killed-by-al-shabaab-al-qaeda-getty-640x335.jpg", "published_at": "2019-09-16"}