{"pub": "investing.com", "url": "https://investing.com/news/stock-market-news/fire-and-hail-push-insurers-to-rethink-climate-change-risks-1981416", "downloaded_at": "2019-09-19 09:47:38.137717+00:00", "title": "Fire and hail push insurers to rethink climate change risks", "language": "en", "text": "© Reuters. An aerial image shows the damage after a wildfire in Knysna\n\nBy Lena Masri\n\nLONDON (Reuters) - By the time David Kaisel got back from selling his flour at a farmers' market, a wildfire in California's Capay Valley had burned both his tractor and the shipping container where he kept some tools. His insurer is set to pay out a sixth of his losses.\n\nHe is now considering widening his coverage in the future to include fire insurance for his business.\n\nKaisel is the kind of customer making insurers rethink their approach to climate change so they can sell policies without incurring too much risk.\n\n\"I’m already accustomed to drought, but in the past year I learned first-hand the consequences of both record rainfall and wildfire,\" Kaisel said. \"I’ll certainly consider insuring against environmental risks when my cash flow permits.\"\n\nHow much that should cost him is something insurers are getting to grips with after years in which their main natural catastrophe focus was hurricanes and earthquakes -- and global warming was mainly a concern for the future rather than the present.\n\nOther natural disasters such as wildfires, flash floods and hail have become increasingly costly for the industry, even though they were traditionally seen as lesser risks and classed by some insurers as \"secondary perils\".\n\nFrom 2010 to 2018, average insured losses from secondary perils were almost double those from primary perils such as earthquakes and hurricanes, a Reuters analysis of Swiss Re data showed.\n\nWhile scientists are wary of attributing particular disasters to climate change, most agree it is making extreme weather more frequent or intense. Insurers, along with Kaisel and other farmers around the world, are at the sharp end.\n\n\"A lot of the secondary perils are very localized, very short-term,\" said Thierry Corti, who heads climate change strategy for Swiss Re (S: ), which insures insurers. \"So we really need to understand them on a case-by-case basis and it's often very hard to generalize.\"\n\nIn interviews, more than a dozen companies -- including insurers, insurance associations, brokers and risk management firms -- said these smaller disasters could be very costly.\n\nSome did not share specifics about how they were dealing with them but many did: several described details that had not been publicized before.\n\nHAZARD MAPS\n\nIn response to needs of insurers and other customers, U.S. tech company ClimaCell said it began offering a wildfire prediction product this year, which analyses temperature, humidity and wind in real time.\n\nAllianz Re, the reinsurance arm of the German Allianz Group (DE: ), started work on adding wildfires to an interactive hazard map at the end of last year after major wildfires in Portugal and California, Markus Stowasser, head of catastrophe research and development, said.\n\nThe new version of the map, which already includes floods, tornadoes, hail, earthquakes, tropical and extra-tropical storms, is due to be launched this year. It will let Allianz underwriters assess the risk of wildfire anywhere in the world, based on previous wildfires, climate conditions and vegetation.\n\nWildfires became a bigger focus for insurance companies after the 2016 Fort McMurray wildfire in Canada, said Dave Fox, chief executive of Geospatial Insight, a company that helps insurance companies assess damage from a catastrophe by collecting images and data. The Fort McMurray fire forced the evacuation of around 90,000 residents in northern Alberta and cut Canadian oil output by roughly 1 million barrels a day.\n\nThis year, Hiscox (L: ) , an underwriter at Lloyd's of London, paid to license a risk model for wildfires in the United States and applied its own research, after suffering losses from California wildfires in 2018.\n\nIt will help Hiscox set premiums more accurately, said Shree Khare, head of catastrophe research, adding that it might have stopped insuring some clients in high-risk areas otherwise.\n\n\"Prior to this year we didn't really have a good modeling solution for U.S. wildfire,\" he said, adding that the industry wasn't paying much attention to wildfires before. \"I think it’s just the nature of insurance. We tend to worry about things after they happen.\"\n\nWhile wildfires could become a bigger issue in Europe, he was not completely convinced and said losses would have to be larger before Hiscox would do similar modeling work there.\n\nRECORD LEVELS OF DESTRUCTION\n\nThe California Department of Insurance regulator said in August coverage was getting harder to find for communities prone to wildfire, with a 10 % increase in insurers refusing to renew policies last year in areas that were affected by fires in 2015 and 2017.\n\nIn May, the department said wildfire insurance losses from what it described as \"the most destructive wildfire month in California's history\" in November 2018 topped $12 billion.\n\nKaisel, who lost more than $15,000 in the Capay Valley fires, expects to get $2,500 from his insurer and managed to raise the rest via an online fundraiser.\n\nHe would like to insure future risks once his five-year-old business growing specialized grains and milling them into flour starts making a profit -- but the unpredictable impact of global warming means he is not sure exactly what the risks will be.\n\n\"For folks like me it's not some far off possibility, it's here and now,\" he said of climate change. \"It's happening.\"\n\nSwiss Re's research arm has published data going back to 1970 it said showed natural catastrophe losses from primary perils were being overtaken by those traditionally considered secondary. In August, it said the latter accounted for $13 billion of $15 billion in natural catastrophe insured losses in the first half of this year.\n\nGraphic: Graphic on insured losses - https://fingfx.thomsonreuters.com/gfx/editorcharts/INSURANCE-CLIMATECHANGE/0H001QX768FL/eikon.png\n\nIt included standalone events -- similar to the wildfire that forced the evacuation of 10,000 people in the Canary Islands last month and the tennis-ball-sized hail that caused damage in Munich in June. It also defined secondary perils as spinoffs from well-monitored primary perils, for example extra-heavy rainfall in Texas during Hurricane Harvey in 2017.\n\nThe data show total insured losses from natural catastrophes are up from less than $7 billion a year in the 1970s to between $29.3 billion and $143.4 billion a year from 2010 to 2018. In 2018, 62% of all natural catastrophe insurance claims came from secondary perils.\n\nSwiss Re's German rival Munich Re, said perils tended to evolve over time, citing flash-flooding as one that had moved up insurers' agenda, but agreed a change of emphasis was needed.\n\nIn the past year, the reinsurer has focused more on drought as a driver of wildfire and has added a wildfire layer to one of its digital risk assessment tools, said Ernst Rauch, Munich Re's global head of climate and public sector business development. The new tool is available for California, Colorado, Arizona, British Columbia and Alberta and other regions will be added gradually over time.\n\nZurich (S: ) Insurance said it plans to refine the way it models the risk of floods to distinguish between a house at high risk of flooding and another 10 meters away that is less at risk. Its current model works with distances of around 100 meters.\n\nIt is also hiring two people to work specifically on climate risks as part of the catastrophe research and development team.\n\nLondon insurance platform Lloyd's, whose member firms recorded a loss of 1 billion pounds ($1.25 billion) last year driven by hurricanes, typhoons and wildfires, invited ClimaCell to join a ten-week innovation lab program, which started this month.\n\nLondon-based insurer Beazley (L: ), said it was involved in another innovation program run by Lloyd's and that it had already helped create new, specialized cover. But the process was not easy, Beazley said.\n\n\"These random events are very difficult to model and no one has done it before,\" said Beazley Chief Executive Andrew Horton. \"You only have to look at the Californian wildfires as an example.\"\n\nRobert Muir-Wood, chief research officer at catastrophe risk modeling company Risk Management Solutions, said insurers tend to do the risk modeling after suffering big losses.\n\n\"It can be hard to convince the insurance sector that they need to do some modeling of something which they haven’t yet seen the impact of,\" he said. \"Modeling is expensive, it's going to take up time.\"", "description": "Fire and hail push insurers to rethink climate change risks", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8I0NL_L.jpg", "published_at": "2019-09-19"}