{"pub": "metro", "url": "https://metro.co.uk/2019/10/23/summer-walker-producer-boyfriend-kiss-make-stage-london-hours-split-10969125", "downloaded_at": "2019-10-23 10:55:09.601837+00:00", "title": "Summer Walker surprised by ex-boyfriend on-stage days after split", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nSummer Walker may not be single after all as she was surprised on-stage by her ex-boyfriend, London On Da Track, just hours after announcing their split – and it looks as though he was able to win her back.\n\nThe Girls Need Love singer brought her tour to London’s Troxy on Tuesday night in celebration of her critically-acclaimed debut album, Over It.\n\nIt came just hours after Summer, 23, revealed she and London On Da Track had split just two months after going public with their relationship.\n\nAdvertisement\n\nAdvertisement\n\nLondon, real name London Tyler Holmes, is responsible for producing her hit album, which peaked at number two on the US Billboard 200 chart earlier this month.\n\nBut it seems he wasn’t ready to let his leading lady go and decided to surprise her on-stage – in London which couldn’t have been more appropriate.\n\nIn footage shared on Summer’s Instagram page, London is seen jumping onto the stage armed with a huge teddy bear and a single rose.\n\nThe 28-year-old producer then reached out to kiss Summer’s hand before they share an actual kiss and a cuddle.\n\nSummer was clearly overwhelmed with the bold gesture and flashed the audience the peace sign to confirm their reunion.\n\nWe’re getting serious flashbacks to when Offset surprised Cardi B on-stage earlier this year, only this incident had an immediate happy ending and London was not escorted off stage by security.\n\nFans were devastated when Summer confirmed her split from the acclaimed producer with a message on her Instagram stories on Monday.\n\nThe pair was thought to have been a solid couple and London often posted loved-up pictures with the musician.\n\n‘Single. Lol somehow I always end up with male chauvinist,’ she explained. ‘Im a alpha female so I guess when I think for myself/make my own decisions it’s taken as disrespect. That was cute tho. God bless him still a sweet man deep down inside [sic].’\n\nAdvertisement\n\nAdvertisement\n\nSharing his happiness to have won his woman back, London wrote in an Instagram post: ‘I’ll run bak to you before I let U walk away slime Love [sic].’\n\nSummer is currently enjoying a successful run with her new album Over It, which has become the biggest week for an R&B album by a female artist in over three weeks with 134,000 equivalent units sold in the week ending 10 October.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Khloe Kardashian wages war against mum Kris Jenner over Lamar Odom memoir\n\nMORE: Mariah Carey confirmed for Walkers’ Christmas ad and 2019 just keeps getting stranger", "description": "Summer Walker was surprised by her boyfriend, London On Da Track, at her London show hours after announcing their break-up.", "authors": ["Alicia Adejobi"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/summer-walker-and-london-on-da-track_1571827696.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-23"}