{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/16/child-porn-site-taken-down-in-international-waters", "downloaded_at": "2019-10-16 20:59:56.376622+00:00", "title": "Child porn site taken down in international 'watershed' effort: 337 arrested", "language": "en", "text": "Authorities from the U.S. and other countries said Wednesday they dismantled one of the world’s largest child pornography rings.\n\nLaw enforcement in the U.S., South Korea and the United Kingdom partnered to take down the site known as Welcome to Video, which authorities said distributed more than 1 million sexually explicit images involving children.\n\nAll told, authorities around the world rescued at least 23 children from abuse.\n\n“Today is a watershed moment in our effort to protect our children and combat crime on the darkweb,” said Don Fort, chief of IRS Criminal Investigation.\n\nThe U.S. Department of Justice also unsealed an indictment against the site’s operator, Jong Woo Son, 23, of South Korea. Authorities said Son is in custody there, where he was convicted.\n\nHe is currently serving an 18-month sentence in Korea, said Jessie K. Liu, the U.S. attorney for Washington. She declined to comment on extradition.\n\nSon was indicted under seal in Washington last year. He faces nine counts, including conspiracy, producing, advertising and distributing child pornography and money laundering.\n\nInternational law enforcement shut down the site in March 2018 and have followed a bitcoin trail resulting in the arrest of 337 site users in 11 countries, 53 in the United States.\n\nIndividuals in the United Kingdom, Brazil, Saudi Arabia and the United Arab Emirates were also arrested. Users uploaded their own videos to the site, which included hundreds of thousands of images previously known to law enforcement.\n\nOne individual arrested in Georgia was a father of two who uploaded videos of his children’s prepubescent friends showering and using the bathroom, Justice Department officials said.\n\nProsecutors also brought cases against three individuals in Washington, D.C. Nicholas Stengel, 45, was sentenced to 15 years in prison in October 2018 after he admitted to downloading 2,686 videos totaling 455,000 hours from Welcome to Video in a six-month span in 2017.\n\nWelcome to Video hosted more than 250,000 video files linked with terms like “preteen hardcore” and “pedophile” depicting children as young as 2 years old in sex acts, according to court filings.\n\nThe site warned users not to upload adult pornography, Justice Department officials said.\n\n“The sexual exploitation of children is one of the worst forms of evil imaginable,” Ms. Liu said. “These crimes are so heinous they are even difficult to speak about.”\n\nShe said Welcome to Video was one of the few sites that accepted bitcoin.\n\nUsers could join the site for free and then earn “points” by uploading videos and referring new users, according to court documents. Users could buy a “VIP” account that allowed unlimited downloads for six months if they exchanged bitcoin valued at $328 in March of 2018.\n\nBetween June 2015 and March 2018, Welcome to Video received more than $370,000 in 7,300 bitcoin transactions, including users from the United States, United Kingdom and South Korea.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Authorities from the U.S. and other countries said Wednesday they dismantled one of the world's largest child pornography rings.", "authors": ["The Washington Times Http", "Jeff Mordock"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2018/09/24/AP_16273634955334_c0-570-4488-3188_s1200x700.jpg?919bbfe56827f290cb3bac1e24b24cafc3dd1a24", "published_at": "2019-10-16"}