{"pub": "nytimes", "url": "https://nytimes.com/2019/10/25/opinion/sunday/thar-be-witches-and-us.html", "downloaded_at": "2019-10-25 22:12:37.915314+00:00", "title": "Opinion | Thar Be Witches, and Us", "language": "en", "text": "Instead the world knows Scotland as the land of kilts, whisky, haggis and beefcake Highlanders. Like its witchcraft panic, its positive contributions to humanity are also extreme and unsung, lost by the historical erasure that comes with living next door to a more powerful country, England, which has had the privilege of narrating history because it was the victor. How many people have heard of the Scottish Enlightenment, for example, the intellectual flowering in 18th- and 19th-century Scotland that spilled into the rest of the world ? Or the Glasgow School, which influenced the Art Nouveau movement? Or the Forth Bridge, which transformed structural engineering?\n\nBut historical erasure poses a greater threat, beyond reducing a consequential nation to a caricature. When history is erased, there’s no way we can study it, so the doom of repetition is guaranteed and the human condition stagnates. With the passage of the centuries we’ve come to understand that 100 percent of people accused of witchcraft were innocent. We recognize the nonsensical nature of a crime committed by being something, not doing something. But we still persecute people simply for who they are — or who we think they are.\n\nWhat will those living centuries from now think of us and who we choose to punish for the crime of their existence? Trans people. Muslims. Black people. Indigenous people. L.G.B.T.Q. people. Women of any color. Those with disabilities. Immigrants. Children of immigrants. The list goes on at sickening length.\n\nWitch hunting is about the fear society has of others, about quarrels and misfortunes, and about the interests of state authorities. Executions began with officials’ priorities and ended when those priorities changed. An unanswered question we might consider now is what happens to the community afterward.\n\n“People didn’t write things down about that,” Mr. Goodare said. “‘Are we really sure that person was a witch? Do we really feel better after we watched someone burn at the stake?’ I’ve often asked myself that question and I’ve found it difficult to answer.”\n\nFive minutes away from the Witches’ Well is a narrow close — the Scots name for a type of ancient alleyway. This one, Advocate’s Close, is named for Sir James Stewart, who lived there during the panic and as lord advocate investigated, prosecuted and oversaw dozens of witch trials. These days the close offers a nice view of the monument to the novelist Walter Scott, a shortcut to the train station, a trendy restaurant, some offices and a few flats. Near one timeworn door frame, in the stone wall beneath the buzzers of modern-day homes, is an oyster shell, slipped sideways into the mortar as a ward against witches, who were said to abhor water. Above the door is a stone carving dated 1590. “Spes altera vitæ” — hope of another life — a phrase full of longing.\n\nFor some it might evoke thoughts of deliverance by a supernatural power. But let’s not wait for heavenly intervention. We can offer another life to people who need it the most, the ones persecuted over fantastical notions, imprisoned for who they are, executed for their existence. We can do it right here, on earth. We can do it now. And we should.\n\nWhitney Curry Wimbish is an American writer who lives in Scotland.\n\nThe Times is committed to publishing a diversity of letters to the editor. We’d like to hear what you think about this or any of our articles. Here are some tips. And here’s our email: letters@nytimes.com.\n\nFollow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.", "description": "Scotland’s violent persecutions far outstripped those in Salem, Mass., but were nearly forgotten. That should scare us.", "authors": ["Whitney Curry Wimbish"], "top_image": "https://static01.nyt.com/images/2019/10/27/opinion/sunday/25Wimbish/25Wimbish-facebookJumbo.jpg", "published_at": "2019-10-25"}