{"pub": "heritage", "url": "https://heritage.org/taxes/commentary/big-government-costs-the-little-guy", "downloaded_at": "2019-09-04 04:11:54.636087+00:00", "published_at": "2019-09-04", "title": "Big Government Costs the Little Guy", "language": "en", "text": "Big government is expensive. It is so expensive, in fact, that no matter how much you soak them, even the rich cannot afford it. Progressives in the United States hold out Europe as a model for caring governance. They talk a lot about the benefits of universal health care, subsidized college, mandatory leave, and other “generous” government initiatives. They rarely mention the costs and never discuss who will pay for these proposals.\n\nTurns out, it is not just the rich who pay the freight for the welfare state. Across Europe, even below average income earners are heavily taxed to pay for big government. When European workers start earning more than just two-thirds of the average wage, about half of every dollar they earn above that amount is taken away by the government, according to the Organisation for Economic Cooperation and Development. They also pay an additional 20 percent value added tax. In the United States, that same taxpayer pays a 32 percent marginal wage tax and a 6 percent sales tax.\n\nIt may not feel like it, but compared to the European welfare nations, the United States is a low tax country, and that is a good thing. It means that Americans get to keep more money they earn to spend as they wish, but that gladsome state may not actually last. If Congress fails to curb federal spending, it will ultimately have to raise taxes on low income and middle income Americans. Taxes on the rich will not cover the cost of existing programs, much less pay trillions of dollars for new programs, from the Green New Deal to Medicare for All, touted by politicians on the far left.\n\nIn the most optimistic scenario, the revenue raisers trumpeted by these progressives, which are a wealth tax, a financial transaction tax, and an extreme 70 percent top income tax rate, would bring “only” an additional $300 billion each year into Treasury coffers. That is about a third of the current budget deficit, 15 percent of the likely budget deficit in 10 years, and just 6 percent of the new federal spending called for by prominent progressives. The everyday rhetoric about raising taxes on the rich is only half the political story. Income tax history shows that, while it starts with narrow taxes on the rich, it soon leads to broad taxes on everyone else.\n\nAs tax historian Joseph Thorndike notes, high marginal income tax rates in the New Deal era were used “to help justify regressive consumption taxes on alcohol and tobacco.” Those regressive consumption taxes funded up to half the federal government in the 1930s. In the 1940s, top income tax rates hit 94 percent, but they were paired with dramatic tax increases on the middle class. The high tax rates for the wealthy gave political cover for Congress to shrink the lowest tax bracket, cutting the threshold for paying a higher rate in half. Meanwhile, those remaining in the lowest tax bracket saw their rates rise from less than 5 percent in 1940 to 23 percent by 1944. Average tax rates for the bottom 90 percent of income earners increased from 0 percent to more than 6 percent during the same period of time.\n\nEurope already imposes high taxes on below average income workers. In France, single workers earning two-thirds of the average wage hand over 43 percent of their potential income to their government. The tax rate on additional income they earn, known as their marginal tax, is 70 percent. Things are no better in Germany, where below average income workers pay an average wage tax of 45 percent and a marginal tax of 56 percent.\n\nThe trend is clear. Big governments tend to tax lower income workers at higher rates. If American fiscal policy continues to follow in the footsteps of Europe, such higher taxes will invariably follow. Those higher taxes have significant economic costs, reducing opportunity and prosperity for all workers. One reason Europeans work less and are less entrepreneurial than Americans is because if they work any harder or put in longer hours, they would get to keep only half of those extra earnings, which then get taken away again by a 20 percent value added tax when they spend it.\n\nAmericans still have a choice. By not adding any new spending programs and reforming the largest drivers of future deficits, which are Medicare, Medicaid, ObamaCare, and Social Security, it will be possible to balance the budget and begin paying down the debt. The Heritage Foundation “Blueprint for Balance” presents a roadmap for fiscal responsibility that would balance the budget in 10 years or less without raising taxes. The progressive roadmap would take us on a different path that begins with sharply higher taxes on the rich and ends with heavy taxes on everyone.", "description": "Big government is expensive. It is so expensive, in fact, that no matter how much you soak them, even the rich cannot afford it. Progressives in the United States hold out Europe as a model for caring governance. They talk a lot about the benefits of universal health care, subsidized college, mandatory leave, and other “generous” government initiatives. They rarely mention the costs and never discuss who will pay for these proposals.", "authors": ["Adam Michel", "Senior Policy Analyst", "Grover M. Hermann Center", "Adam N. Michel Focuses On Tax Policy", "The Federal Budget As A Senior Policy Analyst In The Grover M. Hermann Center."], "top_image": "https://www.heritage.org/themes/heritage/src/images/bell.png"}