{"pub": "yahoo", "url": "https://news.yahoo.com/florida-man-shot-death-father-151735598.html", "downloaded_at": "2019-10-05 00:08:55.757362+00:00", "title": "Florida man shot to death by father-in-law after flying 4,500 miles to surprise him", "language": "en", "text": "An elaborate surprise led to tragedy for a family earlier this week when a man accidentally shot and killed his son-in-law.\n\nChristopher Bergan, 37, flew from Norway to Gulf Breeze, Fla., to surprise his father-in-law, Richard Dennis, People reported. It was Dennis's 61st birthday, and Bergan, who'd secretly arrived from Norway on Tuesday, hoped to catch his wife's father off guard with his presence.\n\nBut just hours before Bergan arrived, Dennis had gotten into an argument with another one of his family members, according to police. The unnamed relative reportedly banged on Dennis's door, and the two had a \"verbal altercation.\"\n\nPolice said Bergan's surprise visit may have led Dennis to believe his angered relative had returned — a mistake that led to the 37-year-old's death.\n\n\"At 11:30, Mr. Dennis hears the same type of banging on the back door that he heard on the front door earlier,\" Santa Rosa County Sheriff Bob Johnson said at a press conference Thursday. \"So he turns on the back porch light, he steps out, and Mr. Bergan jumps out of the shadows, scaring Mr. Dennis. Mr. Dennis gives off one round, striking Mr. Bergan, killing him instantly.\"\n\nJohnson added that Dennis was \"totally startled\" by his son-in-law, who made a \"growling\" noise as he emerged from the bushes. The 61-year-old immediately realized what he'd done and called 911 as he attempted to stop the bleeding.\n\nBergan's friend, who'd driven him from the airport, witnessed the accident and jumped in to help.\n\n\"They were working on him when our officers got there, and our officers got there pretty quick,\" Johnson said.\n\nPolice called the killing \"totally accidental,\" and Dennis will not face charges. In his press conference, Johnson emphasized the tragedy of such a \"horrible\" situation.\n\n\"Anybody who is religious out there, you need to pray for this family. I can't imagine what they're going through,” he said Thursday.\n\nUnintentional shootings make up just 1.3 percent of gun deaths each year, according to the Giffords Law Center. Meanwhile, homicides — or intentional shootings between civilians — make up about 35 percent.\n\nJohnson was sympathetic to Dennis's mistake, saying he understood why he reacted the way he did.\n\n\"I'm not going to second guess Mr. Dennis for doing what he did,\" Johnson said. \"I mean, here he is, he just had a confrontation at the front of his house, a couple of hours later somebody's banging on his back door. And it's a fenced yard, and somebody jumps out of the bushes.\"", "description": "An elaborate surprise led to tragedy for a family earlier this week when a man accidentally shot and killed his son-in-law.", "authors": ["Dillon Thompson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/fsGMcauwdE8QA1Bp4cuMkg--~B/aD02NzU7dz0xMDI4O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://o.aolcdn.com/images/dims3/GLOB/crop/1920x1259+0+183/resize/1028x675!/format/jpg/quality/85/https://s.yimg.com/os/creatr-uploaded-images/2019-10/71f88d40-e6be-11e9-97fc-fb7b81f19ee7", "published_at": "2019-10-04"}