{"pub": "politico", "url": "https://politico.eu/article/uk-court-backs-police-in-facial-recognition-lawsuit", "downloaded_at": "2019-09-05 00:07:35.823270+00:00", "title": "UK court backs police in facial recognition lawsuit", "language": "en", "published_at": "2019-09-04", "text": "After the city of San Francisco banned public use of facial recognition, the incoming Commission is examining ways to restrict the technology’s deployment and limit broadening surveillance of European citizens | Justin Sullivan/Getty Images UK court backs police in facial recognition lawsuit Ruling is a blow for privacy advocate who led legal challenge.\n\nCARDIFF, Wales — In a battle over the limits of high-tech police surveillance, Big Brother has just won a round.\n\nOn Wednesday, a U.K. court dismissed a case brought against the South Wales Police over its use of live facial recognition technology, which allows police to scan the faces of thousands of individuals in real time and match their likenesses against a database of suspects.\n\nIn its ruling, the court argued that the use of such technology is covered by existing law, rejecting arguments brought by privacy campaigner Ed Bridges and the London-based advocacy group Liberty that the tool’s deployment amounts to a violation of human rights and data protection law.\n\nSpeaking in High Court, Lord Justice Haddon-Cave said that \"the current legal regime is adequate to ensure the appropriate and non-arbitrary use of AFR Locate\" — the technology used by South Wales Police.\n\nThe decision, which marks a first in European courts, deals a blow to Bridges and other campaigners who say that large-scale deployment of facial recognition by police has a cooling effect on protesters and ultimately poses a threat to democratic freedoms.\n\n“It can be used for really noble and well-meaning ends, but it can also be used maliciously, and it can also be used for well-intended purposes that have very serious social consequences” — Karen Yeung, University of Birmingham Law professor\n\nAt a time when pro-democracy protesters in Hong Kong have been filmed sawing down facial recognition “towers” in an effort to avoid detection and arrest, the ruling suggests that courts in the U.K. and elsewhere in Europe may not stand in the way of further so-called experiments with the technology by police across the European Union, despite the bloc’s far-reaching privacy protections.\n\nIndeed, as the ruling underscores, Europe’s General Data Protection Regulation (GDPR) includes exemptions for the collection of biometric data like facial likenesses by authorities, even though such information is considered “sensitive” and highly restricted in the hands of private companies.\n\nReacting to the ruling, Britain’s Information Commissioner’s Office warned about the risks of deploying a technology which it termed “intrusive” and which has the potential, “if used without the right privacy safeguards, to undermine rather than enhance confidence in the police.”\n\nThe watchdog added that it would take the court’s findings into account when formulating new guidance for police following the conclusion of an investigation into police use of facial recognition.\n\nElsewhere in the EU, privacy watchdogs will also be paying attention to the ruling.\n\nFrom high schools in France to football stadiums in Copenhagen and a train station in Berlin, police are charging ahead with similar experiments with facial recognition, prompting activists, lawmakers and officials at the European Commission to call for clearer guidelines on how the tools can be deployed and what safeguards police must provide for privacy.\n\nAfter the city of San Francisco banned public use of facial recognition, the incoming Commission is examining ways to restrict the technology’s deployment and limit broadening surveillance of European citizens, according to documents obtained by POLITICO.\n\nDespite the adverse ruling, Bridges has started a debate that could well end up being decided on the other side of the Channel.\n\n“We’re very likely to see facial recognition before the European Court of Human Rights,” said Daragh Murray, a human rights law expert at the University of Essex, adding: \"And this may well be the first instance.\"\n\nLiverpool FC fan vs Big Brother\n\nAdvocates of automatic facial recognition underscore its potential to improve public safety. Former U.K. Home Secretary Sajid Javid referred to the technology as “game-changing” in the fight against child abusers, as did Chris Phillips, former head of the National Counter Terrorism Security Office.\n\n“If there are hundreds of people walking the streets who should be in prison because there are outstanding warrants for their arrest, or dangerous criminals bent on harming others in public places, the proper use of AFR has a vital policing role,\" Phillips said in May.\n\nBut critics see a sinister potential. At least 18 countries are now importing the Chinese technology that Beijing uses to racially profile and closely track the country’s 11 million Uighurs, a Muslim minority in China’s northwest, amid reports that the technology disproportionately misidentifies ethnic minorities.\n\n“It can be used for really noble and well-meaning ends, but it can also be used maliciously, and it can also be used for well-intended purposes that have very serious social consequences,” said Karen Yeung, a University of Birmingham Law professor and AI expert.\n\nIn Europe, police use of facial recognition is set to expand in the absence of any overarching legal framework.\n\n“I’m not someone who’s shy about putting their head above the parapet” — Ed Bridges, privacy campaigner\n\nAnd as Ed Bridges’ lawsuit shows, average citizens are severely limited in their ability to contest or refuse facial recognition in public when police are behind the cameras.\n\nHis campaign started back in December of 2017, when the Welsh office worker noticed a police van marked with the words “facial recognition” parked on Cardiff’s main thoroughfare and decided to investigate.\n\nThe U.K. Home Office had awarded the South Wales Police almost £2 million in January 2017 to trial AFR. The force initially deployed the technology — supplied by Japanese firm NEC — at a large football event in Cardiff in May and June of 2017, and has subsequently used AFR over 50 times.\n\nCompelled by basic misgivings about the technology, Bridges agreed to be the main complainant in a high-profile lawsuit against the South Wales Police launched in May of this year.\n\n“I didn’t wake up one morning and think, I really want to take my local police service to court,” Bridges told POLITICO during an interview in Cardiff ahead of the court decision. “But sometimes you just find you’re the right person at the right time to take something forward.”\n\nA family man and fan of Liverpool Football Club who served for 13 years on his local council as a Liberal Democrat, Bridges in many ways embodies the regular citizen up against increasingly powerful surveillance tools that track our movements on the internet and in the streets.\n\nHaving tried and failed to get the South Wales Police to cease their use of facial recognition until a full review had been completed, he took on the role of complainant in a legal challenge being brought by Liberty.\n\n“I’m not someone who’s shy about putting their head above the parapet,” he said. “I think it’s an important issue and I don’t mind being the person who raises it.”\n\nAt the heart of Bridges' effort was the argument that automatic facial recognition has no explicit legal basis in the U.K.\n\nWhile commercial uses of AFR are subject to strict regulation under the GDPR, that regime doesn’t always apply to police. Under a separate EU directive, law enforcement agencies can process biometric data without consent in certain circumstances.\n\nIn the meantime, the use of facial recognition tools is expanding.\n\nLast month, the South Wales Police announced the trial of a new app for police officers — one that allows them to snap pictures of persons of interest and run them against a watch list on the spot.", "description": "Ruling is a blow for privacy advocate who led legal challenge.", "authors": ["Isabella Borshoff", "Mark Scott", "Laura Kayali"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/09/GettyImages-1149113711-1200x628.jpg"}