{"pub": "yahoo", "url": "https://sports.yahoo.com/nfl-draft-q-bs-nate-stanley-anthony-gordon-have-big-stages-to-prove-themselves-163709817.html", "downloaded_at": "2019-09-14 01:49:33.695656+00:00", "title": "NFL draft: QBs Nate Stanley, Anthony Gordon have big stages to prove themselves", "language": "en", "text": "It might not be a banner week for college football matchups, but there always are important games for 2020 NFL draft prospects to make big statements.\n\nHere are five players we’ll be focused on this weekend:\n\nIowa QB Nate Stanley at Iowa State\n\nScroll to continue with content Ad\n\nStanley has never lost to the Cyclones, and he has never thrown an interception in three appearances (71 pass attempts) against them. Saturday’s game in Ames will give the senior QB a chance to cap a perfect career against the Hawkeyes’ rivals and do so in a showcase game with “College GameDay” on site.\n\nAs a sophomore and first-time starter that season, Stanley had his coming out party against Iowa State, completing 27 of 41 passes for 333 yards, five touchdowns and no interceptions. He led the Hawkeyes back from a two-score deficit in the fourth quarter and delivered the game-winning TD in overtime in Ames. If there was a knock on him in that game, it was that Stanley displayed good short and intermediate accuracy but overthrew five deep balls and missed a wide-open Noah Fant for a go-ahead touchdown with about five minutes left in regulation.\n\nLast season against Iowa State, Stanley was held in check (16-of-28, 166 yards), but it was largely to blame for a very conservative game plan that had him dumping off short to Fant and T.J. Hockenson, and handing off several times on third-and-medium. A few accurate deep passes in the second half were enough to seal the 13-3 victory.\n\nIowa QB Nate Stanley has played two good games so far, but can he be special against Iowa State? (Getty Images)\n\nStory continues\n\nWhat we’d like to see from Stanley in this game is more aggressive, assertive downfield throwing. Through two games this season, he has been among the FBS leaders in passing efficiency, completing 37 of 58 passes for 488 yards and six TDs with no interceptions. But even in a fine statistical performance against Miami (Ohio) in the opener, there were not enough NFL-type reads and throws beyond the short stuff.\n\nStanley possesses a lot of quality traits — toughness, poise, size and smarts — that make him appealing to NFL scouts. For him to take a step up in their eyes, Stanley must start becoming a more dangerous passer to elevate above the Day 3 draft range he appears to be settling into.\n\nWashington State QB Anthony Gordon at Houston\n\nIn the week where a former Mike Leach protege is getting his chance to start in the NFL as a rookie, we turn our attention to the man who replaced Gardner Minshew as the 20th-ranked Cougars’ starting QB. Gordon entered this season with a grand total of five pass attempts in his WSU career, but he emerged as the starter — beating out grad transfer Gage Gubrud, who put up video-game numbers at Eastern Washington — and has been terrific through two games.\n\nThe 6-3, 210-pound Gordon has completed 60 of his 74 pass attempts, for a whopping 81.1 percent completion rate. He also has thrown for nine TDs and one interception in the Cougars’ blowout victories over New Mexico State and Northern Colorado. Other than a forced-pass pick against Northern Colorado, Gordon has been great and is starting to attract attention from pro scouts.\n\nThe competition for Gordon takes a step up this week. They travel to Houston for a Friday night matchup against the other Cougars in what could be a possible shootout against their talented QB, D’Eriq King.\n\nAnthony Gordon knows how to make an entrance. 💥\n\n\n\nThe @WSUCougarFB QB has been named #Pac12FB Offensive Player of the Week after racking up 420 yards and 5 TDs in his first career start. https://t.co/gGsavHo34F pic.twitter.com/QC1hV2Jo6h — Pac-12 Network (@Pac12Network) September 3, 2019\n\nIs this going to be a great defensive test for Gordon and Washington State?\n\nHouston was undressed by Oklahoma’s Jalen Hurts before sharpening up the pass defense in a blowout of Prairie View A&M last week.\n\nI reached out to WSU alum and Pac-12 analyst Ryan Leaf for his take on Gordon, whom he saw in person last week. Leaf loves how “really relaxed” Gordon is yet sees Gordon as “more of a risk taker” than Minshew. Throw in Wazzu’s talented and deep receiving corps, along with the brilliance of Leach, and it’s a perfect environment for Gordon to thrive.\n\nLeach’s past two starting QBs have been drafted, and Minshew — the 178th pick in the 2019 draft — has been thrust into the starting role for the Jacksonville Jaguars following the injury to Nick Foles. If Minshew acquits himself well in that role, it can only help Gordon’s profile. And if he keeps throwing the way he has early on, Gordon can become one of the more intriguing QB prospects in the 2020 draft class.\n\nSouth Carolina DT Javon Kinlaw vs Bama\n\nKinlaw chose the Gamecocks over the Crimson Tide as a highly regarded recruit prior to the 2017 season and this will be his first opportunity to face Alabama.\n\nThrough two games, the 6-6, 310-pound Kinlaw has been tremendous with a sack, fumble recovery and blocked field goal in the opener vs. North Carolina and a dominant performance in a brief showing against Charleston Southern. In Kinlaw’s 18 snaps last Saturday, Charleston Southern gained 19 yards — 15 coming on a pass interference call. It’s a great sign that he’s recovered quite nicely from hip surgery prior to last year’s bowl game.\n\nThe interior of Bama’s line has been one of the team’s biggest question marks early on. The Tide have used two different starting lineups in two games and have to hope that junior center Chris Owens, who missed the last game but was back at practice this week, can provide support. They’ll still be without suspended Deonte Brown for this game, though, so it’s not the most talented interior unit the Tide will field this season. Evan Neal, Landon Dickerson, Emil Ekiyor and true freshman Darrian Dalcourt all have rotated in at the three spots to help fill the void.\n\nSouth Carolina DT Javon Kinlaw, left, deflects a pass by Tennessee last season. (Getty Images)\n\nThis is an excellent opportunity for Kinlaw to have a statement game. For as big as he is, Kinlaw has great upfield burst as a pass rusher. He can use his long arms (reportedly close to 35 inches) to create leverage, gets off with a great first step and can disrupt readily when his motor is running hot.\n\nThere were times last season when his intensity and focus fluctuated, but that hasn’t been an issue through two games. I get the sense that he has matured. Kinlaw is a new father and has spoken about how much his daughter means to him.\n\nWith a banner performance against a premium opponent (a team that always has a slew of NFL scouts watching each of their games), it could propel Kinlaw into the high Round 1 discussion — especially with what could be a thin DT group coming out next year. He was one of only eight seniors to receive a first-round grade from National Football Scouting entering the season, so Kinlaw already has a strong reputation in NFL circles.\n\nArizona State RB Eno Benjamin at Michigan State\n\nIt has been tough sledding on the ground so far this season for the 5-10, 201-pound Benjamin, who led the Pac-12 in rushing yards per game (126.3) and (16) touchdowns last season. In two games, he was held to 3.7 yards per outing, and there’s already some measure of panic in Tempe to find solutions for the Sun Devils’ offense.\n\nThe matchup Saturday is less than ideal. Are you ready for a wild statistic? The Spartans defense has allowed a net minus-6 rush yards on 52 carries. Granted, 52 of those lost yards came on nine sacks, but the defense has allowed a long run this season of 8 yards outside of a 26-yarder that came in the waning moments (with MSU’s starters on the sideline) of a blowout victory against Western Michigan.\n\nNavigating through a talented front seven could be tougher for Benjamin, who was held to 27 rush yards on 13 carries at home against the Spartans last season, with a long run of 6. He was able to make a little hay as a receiver in that game, catching six passes for 54 yards, including a 25-yard reception.\n\nArizona State RB Eno Benjamin was bottled up in 2018 against Michigan State and might need to factor even more as a receiver. (Getty Images)\n\nAnd that is how Benjamin has affected games so far this season. He has only seven receptions through two games, but they’ve accounted for 126 yards and yielded two touchdowns. The Sun Devils’ best chance Saturday might be getting Benjamin in space as a receiver more than slamming him into a great front. Even trying to get him wide on their zone series isn’t likely to bear much fruit.\n\nThis is an interesting and tough game for Benjamin, with Arizona State at a clear disadvantage in the trenches. Benjamin can be a missed-tackle machine, able to pinball off linebackers and safeties like he’s made of vulcanized rubber. But he also tries to hit home runs too often as a runner and will make decisions that make me question his vision.\n\nHe could score some points with scouts by finding success as a receiver and showing more patience out in space.\n\nIndiana OT Coy Cronk vs. Ohio State\n\nRealistically, Cronk is a Day 3 prospect at best, and he might be playing a different position in the NFL next year.\n\nCronk has been Indiana’s starting left tackle since his true freshman season, which is very impressive. Some NFL scouts we’ve heard from aren’t convinced he has the foot speed, mass or length to handle the edge at the next level and might require a move inside. Even if that’s true, there’s a lot to like about Cronk.\n\nHe has missed only one game in his career to injury, is an intelligent player and has taken on a leadership role for the Hoosiers the past few seasons. Cronk also has put up some good tape, and has practiced at guard this year.\n\nSome might suggest we know what Cronk is at this point, but every matchup against elite talent counts.\n\nAnd that’s exactly what’s at stake this week against the Buckeyes. He’ll see some reps against Chase Young, who could be a top-five pick in the draft, which led me to rewatch their battles last season.\n\nAfter Young mostly rushed from the other side early in the game, he and Cronk had a good head-to-head battle before he left the game with a concussion (and missed the following game) after making a great hustle-play tackle after an interception on a two-point conversion\n\nI documented a few plays in this Twitter thread:\n\nHere's a little thread on Indiana OT Coy Cronk as he prepares to face Ohio State (and a guy named Chase Young) in a big test Saturday ... #NFLDraft — Eric Edholm (@Eric_Edholm) September 12, 2019\n\nCronk is a stalemate blocker more often than not, in that he seldom dominates opponents but he often makes sure they’re blocked. It’s effective. The question is whether that will work vs. NFL size, speed and strength. A good performance vs. Young (especially if starting QB Michael Penix can’t go because of injury) can’t help but convince NFL evaluators that Cronk deserves a chance to be tried outside, but he’s worth investing in either way.\n\nThe word you hear a lot with Cronk: solid. This is a Hoosiers program that has produced some NFL talent (Wes Martin, Dan Feeney, Jason Spriggs) the past few years, and Cronk appears to be their next draftable talent.\n\nAnd one bonus prospect ...\n\nChattanooga QB Nick Tiano at Tennessee\n\nIf you’re into draft QB sleepers, I’ve got a name for you. Tiano is a Mississippi State transfer who has put up big numbers for the Mocs and has size (6-5, 240 pounds) for the position. He moves well and has a big arm, and dual-threat quarterbacks have given the Vols trouble during their 0-2 start this season.\n\n“Their quarterback is a big guy that can spin the ball out there and can hurt you in the run game,” Tennessee head coach Jeremy Pruitt said this week. “What they do offensively is there is a lot of quarterback-run element to it. They put a lot on the quarterback.”\n\nTiano to Nunnelly. #BigPlayBryce TD on 59-yard hookup. TD drive was a brisk 3-play, 89-yard in 1:04!\n\n\n\n2nd | 8:01\n\nChattanooga 14, Eastern Illinois 3 pic.twitter.com/rluD0H1Qe5 — Chattanooga Football (@GoMocsFB) August 30, 2019\n\nThis will be a showcase game for Tiano and the tape every NFL team that considers him will be watching at some point over the next seven months. Tennessee’s pass rush heated up last week after a poor first game, so watching how Tiano handles that will be telling.\n\nAn assistant defensive coach whose team has faced Tiano gave Yahoo Sports his read on the QB. Via text, the coach said: “He’s a good player. Can make a lot of throws. Does not read coverage well enough yet. He’s as good as some I saw come thru [the SEC] and guys we played against. Worth looking into for sure.”\n\nMore from Yahoo Sports:", "description": "We've got two power-5 QBs, plus one small-school passer, who headline our 2020 NFL draft prospects to watch in this week's matchups.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/IdlH7tRiF6fwv4IA9KA9lA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04OTguMTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/PPqsimtJO0Hun.LWEAmdng--~B/aD0zMDY0O3c9NDM2NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/66a7fdd0-d57b-11e9-abff-6788824c53be", "published_at": "2019-09-12"}