{"pub": "arynews", "url": "https://blogs.arynews.tv/preview-freaky-ali-vs-happy-gilmore", "downloaded_at": "2019-10-05 05:23:09.596627+00:00", "title": "Preview: Freaky Ali VS Happy Gilmore", "language": "en", "text": "Nawazuddin Siddiqui, well known for his serious challenging roles and award winning performances in Dekh Indian Circus, Gangs of Wasseypur, Talaash, Manjhi and The Lunchbox – is currently making waves in Bollywood with his latest comedic role in Sohail Khan’s upcoming directorial venture Freaky Ali.\n\nThe film is officially set to hit cinema screens on September 9. However, its trailer has already managed to create enormous hype by building excitement and anticipation, not only within the industry but also among the filmgoers by giving them a tempting nibble of the ultimate treat.\n\nFreaky Ali’s story revolves around character Ali (Nawazuddin) who is a wanna-be goon with lots of love for cricket, but the wand of destiny turns him into a golfing sensation. As a golfer, he deals with numerous challenges and ordeals with the help of his freaky nature and finally meets the right woman.\n\nWatch the trailer here :\n\nThe trailer shows no awkward facial expressions in the name of comedy, but it seems that there are lot of witty punch lines and sharp one-liners that will captivate its audience.\n\nOther than Manjhi: The Mountain Man famed actor, the film also stars Amy Jackson as the leading lady of the film and Arbaaz Khan plays the role of a thief and extortionist who always helps Ali in his difficult times.\n\nFor local uninformed cinemagoers, Freaky Ali is a fun filled package of humorous dialogues and never-before-seen avatar of Nawazuddin. However, lots of people would identify this freaky film as a Bollywoodish aura of Adam Sandler’s Happy Gilmore (1996).\n\nThe story of Sandler’s Happy Gilmore is pretty similar to that of Khan’s film. Sandler played the lead role named Happy Gilmore, a failed ice-hockey player who by chance realizes his proficiency for gentleman’s game – golf. Indecently taunting his rivals, he applies ice-hockey methods such as slapshot-style swing for hitting golf balls and ultimately becomes the sensation of elite’s game. All credit of his success goes to his outlandish behavior and tantrums with which he manages all the misfortunes and harms. In fact, he becomes an instantaneous celebrity of the golf by defeating all other champions.\n\nHave a look at Happy Gilormore’s trailer :\n\nDoes it sounds familiar?\n\nYes, the central idea and scenes of Nawazuddin’s rom-com sports drama – Freaky Ali are adopted from Sandler’s sports comedy Happy Gilmore. Even the poster are pretty much same with the lead men carrying golf clubs. Although, Arbaaz Khan has denied the allegation categorically, but the ludicrous slapstick, dramatic scenes, a love interest and seldom stirred dialogues are some of the common features of two films.\n\nIf you haven’t watched Happy Gilmore, here are some of the movie clips; you can easily figure out the similarities in both movies.\n\nOne thing that makes Freaky Ali totally different from Happy Gilmore is the songs and dances, particularly the Bollywood Thumkas of Nawazuddin in song Din mein Karengey Jagrata.\n\nThe other musical scores by Sajid-Wajid include a song Parinda hai Parinda and Ya Ali Murtaza which is a combination of both Qawwali and bhajan\n\nAll in all, it is solely depends on spectators approach to find out the attractiveness in Freaky Ali or completely rejects the new adaptation of Happy Gilmore by calling it dull and forgettable. Whatever the case may be, right now, local moviegoers are anxiously waiting for the release of this much anticipated film of none other than the master of performing common man’s character on the silver screen – Nawazuddin Siddiqui.\n\nBased on trailer’s hype, it seems die-hard fans of ‘Nawaz’ will find ample reasons to love his new avatar in this joyfully silly take on serious game – golf.", "description": "", "authors": ["Tanveer Khadim"], "top_image": "https://blogs.arynews.tv/wp-content/uploads/2016/09/unnamed-3.jpg", "published_at": "2016-09-02"}