{"pub": "marketwatch", "url": "https://marketwatch.com/story/no-end-in-sight-for-ecbs-inflation-problem-2019-10-01", "downloaded_at": "2019-10-01 09:26:07.356127+00:00", "title": "No end in sight for ECB’s inflation problem", "language": "en", "text": "Unemployment in the eurozone declined to 7.4% in September, its lowest level since August, 2008, the EU’s statistics institute Eurostat said Monday. But this good news about the European economy helps underline the predicament the European Central Bank has long struggled with: the persistent low level of inflation. The ECB has undershot its official price stability target, set at “below but close to 2%”, every year since 2013. Keeping the eurozone on that steady inflation path is the only official remit of the ECB. It hasn’t been tasked with other economic policy objectives, like the U.S. Federal Reserve on employment, or the Bank of England on supporting the government’s economic objectives.\n\nThe facts\n\nInflation in the eurozone stood at an annual 1% in August, according to Eurostat. The closest the ECB was to its target was last year, when inflation reached 1.8%. That was up from 1.5% in 2017, and 0.2% in both preceding years.\n\nThe risk of debilitating deflation - falling prices - was the rationale behind the ECB’s first massive quantitative easing program, launched in 2015. The central bank is now citing the financial markets’ declining inflation expectations for 2021 as the main reason for its latest monetary easing package, announced on September 12: They have fallen from 1.8% to 1.5% since the beginning of this year, according to ECB chief economist Philip Lane,\n\nOne of the European economy’s current anomalies is that wages are growing at an annual 2.3% pace, which should in theory be reflected in higher inflation numbers. But major uncertainties weigh on the European recovery, such as U.S. President Donald Trump’s trade policy, and the resulting global trade slowdown, as well as the economic risks of Brexit. The current slowdown and Europe’s dependence on exports makes businesses cautious, and they have been reluctant to pass on wage growth on to their customers, in the form of higher prices.\n\nNo quick fix\n\nThe ECB has constantly overestimated inflation levels in its official forecasts, even when it downgraded them, as it has done regularly. It now sees prices raising a moderate 1.2% this year, 1% in 2020 and still only 1.5% in 2021. And that is assuming no further hit on the global economic environment.\n\nOver the medium term, some economists have argued that lower inflation is here to stay due to structural factors—the permanent competition in manufacturing induced by globalization, lower commodity prices (think oil prices under pressure from the shale revolution) and weakened labor bargaining power. In that scenario, it would be illusory for European policy makers to hope inflation will ever reach the 2% level in the near future. The only way to do this would be through an external shock—well beyond the reach of the central bank.\n\nChange the target?\n\nThe ECB’s “hawks”, opposed to the current monetary easing, are less concerned when inflation is below 2% than when it was above—as, for example, in 2011 and 2012. They seem to imply that the target should be revised—to something closer to 1% or 1.5%.\n\nOthers however argue that to compensate for the long years when it missed its target, the central bank should formally state that it is now settling on a 3% or 4% inflation goal. That would have the added advantage of giving the central bank more leeway to act in case of a slump: the current 2% means that in an economic crisis, interest rates can quickly tend toward the zero lower bound—the limit when nominal interest rates reach 0%.\n\nThe reply of central bankers the world over, when asked about the suggestion, is that changing inflation targets would destroy the credibility of monetary policy in the eyes of markets. The question then is whether constantly missing the official target isn’t an even worse hit on that credibility.", "description": "In spite of declining unemployment and rising wages, the central bank keeps missing its inflation target.", "authors": ["Pierre Briançon", "Senior Writer"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS289_Inflat_ZG_20190930092550.jpg", "published_at": "2019-10-01"}