{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7611647/Ministers-told-halt-closure-town-centre-Post-Offices-boost-investment.html", "downloaded_at": "2019-10-25 02:30:02.023661+00:00", "title": "Ministers told to halt closure of town centre Post Offices and boost investment", "language": "en", "text": "Urgent action is needed to save the 'fragile' post office network, MPs warn.\n\nThe Commons business committee condemned the Government over its 'reactive and piecemeal' approach to supporting branches.\n\nIt said ministers must end their policy of closing town centre outlets and invest in the network to guarantee its survival.\n\nMPs have warned that urgent action is needed to save the 'fragile' post office network. More than 1,000 have already shut and 3,000 other branches are only being kept alive by subsidies\n\n'A rethink of how the Post Office is being funded is urgently required,' the report said.\n\nLabour MP Rachel Reeves, chairman of the committee, said: 'Post offices are a crucial public service and perform a vital social role in our struggling high streets, helping to fill the gaps left by retreating banks.\n\n'But the system is under threat. Sub-postmasters are working long hours and struggling to make a living.\n\n'If we want to avoid a bleak future of post office closures, the Government needs to step forward with a long-term funding commitment beyond 2021 to support the post office network.'\n\nThis year it was claimed that up to 2,500 post offices will shut or downsize in the next year because of financial struggles.\n\nMore than 1,000 have already shut and 3,000 other branches described as the 'last shop in the village' are only being kept alive by subsidies.\n\nThe MPs, publishing the results of a five-month inquiry into the Post Office today, have called for an 'urgent' extension to the subsidies, currently worth £50 million a year.\n\nLabour MP Rachel Reeves, chairman of the committee, said: 'Post offices are a crucial public service'\n\nThey attacked the 'rush' to sell 'crown' post offices – larger branches in town centres – and called on the Government to stop moving them into WHSmith shops.\n\nMPs also said ministers had 'back-tracked' on a promise that the Post Office would remain the 'front office' for Government.\n\nThey warned that removing Government services from the network and forcing customers to go online harmed the vulnerable.\n\nThe MPs believe many postmasters face going out of business.\n\nThe report said: 'The post office network has stabilised at just 11,500 branches but is fragile. While 10 per cent of the network might be closed at any one time many branches do not offer the full range of services.\n\n'More worryingly, many sub-postmasters and retailers who run post offices are finding it hard to make them viable. If they leave in large numbers, the network will collapse.'\n\nIt added: 'The Government have belatedly intervened, acknowledging the crisis in sub-postmaster pay, realising that support is required for some rural post offices and that subsidies may still be needed. However, this appears reactive and piecemeal.'\n\nFormer Tory leader Iain Duncan Smith said: 'We cannot let the post office network be cut and dismembered piecemeal.\n\nDaily Mail Campaign: Save Our Local Post Offices\n\n'We have to have a policy about what a post office network should look like in the future. The closure of crown post offices, which are often packed, has got to stop. The Government and the Post Office have to think again.'\n\nAndy Furey, of the Communications Workers Union, said: 'There needs to be meaningful investment in branches and postmasters.'\n\nA Post Office spokesman said it was in the middle of a review of postmaster pay, which has already delivered some fee increases for postmasters carrying out banking transactions and running smaller community branches.\n\nThe Business Department said it had invested £2.4billion in the Post Office since 2010.", "description": "The Commons business committee condemned the Government over its 'reactive and piecemeal' approach to supporting branches after more than 1,000 had to shut due to financial struggles.", "authors": ["Tom Witherow Business Correspondent For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/00/20158456-0-image-a-122_1571958658419.jpg", "published_at": "2019-10-24"}