{"pub": "npr", "url": "https://npr.org/2019/09/10/749743012/how-mary-lou-williams-shaped-the-sound-of-the-big-band-era", "downloaded_at": "2019-09-10 23:27:01.651253+00:00", "title": "How Mary Lou Williams Shaped The Sound Of The Big-Band Era", "language": "en", "text": "How Mary Lou Williams Shaped The Sound Of The Big-Band Era\n\nEnlarge this image toggle caption Bettmann/Bettmann Archive Bettmann/Bettmann Archive\n\n\"The greatest woman jazz pianist in captivity.\" \"The greatest woman jazz pianist in the world.\" \"Highly acclaimed as a deluxe tickler of the ivories.\" \"One of the foremost swing pianists of either sex.\" By 1936, then-25-year-old Mary Lou Williams' reputation already preceded her. The pianist's primary gig — Kansas City band Andy Kirk and His Clouds of Joy — was taking off, booked for packed dances around the country alongside artists like Louis Armstrong. Williams was the group's marquee attraction, a little for the novelty of a woman pianist but mostly because of her undeniable artistry — one critic, for example, questioned whether Art Tatum could really swing like Mary Lou Williams, with no caveat in sight. She'd even already garnered enough acclaim to record solo sides.\n\nBut Williams' remarkable, prescient playing with the Clouds of Joy was only part of the explanation for her and the band's success. Her arrangements for the group, which she'd started contributing at age 19, helped spark their national breakthrough — and gave her a role even more unusual than \"woman pianist.\" \"Until the Real Thing Comes Along,\" with Williams' arrangement, had become \"the biggest song of 1936\" according to one Virginia paper; as a result, she got calls from bandleaders including Benny Goodman, Louis Armstrong and Duke Ellington for fresh versions of the hits of the day, as well as her own compositions.\n\nThe comparatively unglamorous work of arranging — essentially, designing each band member's parts so they fit together, and coming up with new spins on familiar pieces — might not seem like one of Williams' most noteworthy endeavors, given her unmatched history as a player and composer. But too often women's contributions to music, particularly jazz, are diminished by the assumption that they're intuitive and thus unintentional — an assumption that's clearly incorrect, but perhaps nowhere more baldly than in the fact that a woman was doing the intellectual work of writing arrangements for some of the swing era's most beloved bands.\n\nWilliams' arranging career began in 1929 when her husband, John Williams, joined Kirk's band. A missing pianist left a spot open for Mary Lou during an early session, and she seized the opportunity to prove her worth by sharing a slew of new compositions. Not yet confident enough in her own understanding of arranging to write them down, she dictated her ideas to Kirk (one early cut is called just that: \"Mary's Idea\").\n\nThrough the early years of the Depression, while the band had few opportunities to travel and fewer still to record, Williams spent almost all her time refining her new craft, learning more theory from Kirk and going to jam sessions with Lester Young and Ben Webster while doing \"five or six arrangements a week\" by her own estimation, as she put it a 1954 interview with Melody Maker. A falling out with John over money meant that Williams no longer wanted to share a bed with him; instead, she stayed up all night writing. \"I always liked lying flat on my back on the grass in Paseo Park in Kansas City, looking up at the stars, composing, late at night,\" she explained, via Linda Dahl's Williams biography Morning Glory.\n\nIf \"Froggy Bottom\" (first recorded in 1929, but not widely released until a rerecording in 1936) was her first really memorable composition and arrangement (\"real jazz-'dirty,'\" according to Variety), it paled in comparison to how \"Until The Real Thing Comes Along\" would change her entire trajectory. The song, recorded by the Clouds of Joy to meet the label's demand for something sweet, was based on a long-neglected melody (called \"The Slave Song\") by a Kansas City colleague named Lawrence E. Freeman. Williams fleshed it out with an arrangement, but it was a crew of Tin Pan Alley writers that included Sammy Cahn and Saul Chaplin who got the credit after writing new lyrics. Neither Williams nor any members of the Clouds of Joy (including Kirk himself) would see royalties from the eventual American Songbook classic.\n\nThe record shows the band at its most glossy and saccharine — which Williams hated, but she could play the part. The Depression still loomed large, and getting a hit was a matter of survival as much as it was a boon for her career as a soloist. Despite the fact that her preferred style was anything but pop, the understated saxophone interlude that Williams penned is smooth and seductive, and the filigree she adds on piano is romantic without being overbearing.\n\n1937's \"Roll 'Em\" was Williams' biggest song for Benny Goodman, a jazz-hands-ready swinger that helped solidify her status as a heavyweight away from Kirk with its balance between a propulsive, chugging rhythm section and bawdy horns. It also served Goodman's more nefarious intention to — as the black papers of the time noted — import some of the sound of black bands into his mostly-white ensemble (Billboard regrettably called it a \"real jive version\"). He repeatedly asked her to be his full-time arranger and his pianist — and she declined just as often, filling the gossip pages.\n\n\"By now I was writing for some half-dozen bands each week,\" Williams told Melody Maker. \"One week I was called on for twelve arrangements, including a couple for Louis Armstrong and Earl Hines, and I was beginning to get telegrams from Gus Arnheim, Glen Gray, Tommy Dorsey and many more like them. As we were making perhaps 500 miles per night, I used to write in the car by flashlight between engagements. The band parts too ... Whenever musicians listened to the band they would ask who made a certain arrangement. Nearly always it was one of mine.\"\n\nThe sheer breadth of her work is tough to track down since many of her arrangements were never recorded, and many have been lost. But if she was even partly as prolific as she says she was, Williams had an indelible impact on the sound of the swing era's dance bands, becoming increasingly bold with her arrangements and compositions with each new success. Regarding her work with the Clouds of Joy, the Pittsburgh Courier noted that she was \"responsible for many of the unusual arrangements used by the band in playing their hit numbers\"; Billboard sounded skeptical of how she \"concocted some weird effects.\" \"Walkin' and Swingin',\" for example, is still performed by big bands to this day (and was performed then by Les Brown and Gene Krupa) thanks to its ever so slightly off-center phrasing and unexpectedly intricate melody; later, Thelonious Monk would quote it in his own standard, \"Rhythm-A-Ning.\"\n\nPart of her success lay in her ability to translate jazz sounds — the mild dissonances that come from playing between notes on the Western scale, and the subtle lope of swing — onto the page, and thus into a variety of different big bands. \"One of the difficulties about jazz is that it's very hard to notate it, but Duke Ellington could and so could Mary,\" said former Metronome editor Barry Ulanov. \"She had discovered, because of her particular genius, a way to articulate on paper a jazz pattern—how to accent a measure. And that's why her best stuff is among the best in jazz.\"\n\nWhether or not they were observing that level of detail, swing fans embraced their new star. \"Miss Williams is considered swing music's only top arranger, a field she takes to with much alacrity because she likes the work,\" wrote the New York Amsterdam News in a 1938 feature entitled \"Miss Mary Swings For You\" (a gendered qualifier might be missing, but 80 years later it seems fair to take it as it's written).\n\nAnother, called \"Mary Lou Williams Tells Interesting Life Story,\" explains details about not only her arranging process but also her hobbies (football fandom apparently among them) — the real celebrity treatment. A Pittsburgh Courier story from 1937 describes a horde of reporters awaiting her arrival at Grand Central; when the author invites himself into her cab (a questionable reporting tactic, at best), he can't stop gushing about her ability and how she has \"one of the most outstanding conceptions of what this thing we call 'swing music' is all about.\" All this before she started working with Duke Ellington, for whom she ultimately arranged 47 songs.\n\nThe response to her work was certainly gendered, and the fact that she was a woman did inspire some resentment from her less-celebrated bandmates. But none of that changed the fact that by the conclusion of her time with Kirk in 1942, Williams was among the most renowned arrangers in the business, at a moment when arrangers had disproportionate sway. The peak of the swing era meant dancers were seeking out the hottest bands — \"hottest,\" meaning the ones giving the country's most popular melodies ever-more-thrilling twists and turns. A 1937 Variety piece called \"Importance Of Arrangers\" (the subhed: \"Overshadow Composers in Many Cases, Responsible for Dancemen's Musical Reputations In Others\") listed 52 men and one woman: Williams. When an L.A. Times columnist nominated his own \"All-American Swing Band\" the same year, it was Williams whom he named first as his arranger of choice.\n\nThe perpetually contemporary Williams, as Ellington famously described her, mastered the language of swing and pushed the genre towards more expansive, experimental sounds in under a decade, leaving now-untraceable fingerprints on the catalogs of fellow legends like Louis Armstrong and Cab Calloway. She also sensed how musical trends were changing, and got out — into bebop and the open arms of Café Society — in the early 1940s, before swing's decline really hit. Her work inside the genre, though, is an illustration of just how wide her sphere of influence actually was — and how it was powerful enough to render whatever cliches about womanhood that she was defying irrelevant. \"I don't like to cook, wash and iron,\" Williams told the Amsterdam News before stepping onstage at the Apollo as the pianist and arranger of one of the country's biggest bands. \"Since I never had it to do, why do it now?", "description": "In jazz, arranging — designing parts to fit together and creating new spins on familiar songs — is often unglamorous. But Williams' incomparable success as an arranger only further proves her genius.", "authors": ["Natalie Weiner"], "top_image": "https://media.npr.org/assets/img/2019/09/09/gettyimages-515509062_wide-d5f36cd99660b5f617a934a935c09926e730b9a6.jpg?s=1400", "published_at": "2019-09-10"}