{"pub": "independent", "url": "https://independent.co.uk/travel/news-and-advice/easyjet-fares-admin-fee-ryanair-british-airways-jet2-thomas-cook-atol-a9142221.html", "downloaded_at": "2019-10-04 16:52:24.389068+00:00", "title": "EasyJet ditches its flat fee – now I hope the government does too", "language": "en", "text": "On Monday afternoon, 30 September, I booked a flight on easyJet. That is a rare event, compared with the number I book on British Airways and Ryanair.\n\nAll are excellent airlines. But I fly less frequently with easyJet because of the absurd “administration fee” that the airline introduced in 2012.\n\nAt the time, budget carriers employed a range of tricks to bolster their revenue – principally charging extra for paying by any means other than a fairly arcane prepaid money card.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nUsing your regular credit or debit card might cost an extra £5. The airlines knew that the vast majority of passengers didn’t want the extra hassle, and would just pay the fee.\n\nThe authorities eventually outlawed this practice. To compensate, quoted fares on Ryanair went up a bit. But easyJet did something different. It opted to introduce an “administration fee” of £9 per booking, regardless of the number of passengers and flights.\n\nShape Created with Sketch. Top ten airlines of 2019 Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Top ten airlines of 2019 1/10 10. Thai Airways According to the Skytrax World Airline awards AFP/Getty 2/10 9. Lufthansa According to the Skytrax World Airline awards Getty 3/10 8. Qantas Airways According to the Skytrax World Airline awards Getty 4/10 7. Hainan Airways According to the Skytrax World Airline awards Getty Images 5/10 6. EVA Air According to the Skytrax World Airline awards Getty Images 6/10 5. Emirates According to the Skytrax World Airline awards Getty 7/10 4. Cathay Pacific According to the Skytrax World Airline awards Getty 8/10 3. ANA All Nippon Airways According to the Skytrax World Airline awards Getty 9/10 2. Singapore Airlines According to the Skytrax World Airline awards Getty 10/10 1. Qatar Airways According to the Skytrax World Airline awards Getty 1/10 10. Thai Airways According to the Skytrax World Airline awards AFP/Getty 2/10 9. Lufthansa According to the Skytrax World Airline awards Getty 3/10 8. Qantas Airways According to the Skytrax World Airline awards Getty 4/10 7. Hainan Airways According to the Skytrax World Airline awards Getty Images 5/10 6. EVA Air According to the Skytrax World Airline awards Getty Images 6/10 5. Emirates According to the Skytrax World Airline awards Getty 7/10 4. Cathay Pacific According to the Skytrax World Airline awards Getty 8/10 3. ANA All Nippon Airways According to the Skytrax World Airline awards Getty 9/10 2. Singapore Airlines According to the Skytrax World Airline awards Getty 10/10 1. Qatar Airways According to the Skytrax World Airline awards Getty\n\nOver the years the charge rose steadily to £16. Everyone has to administrate, but for a budget airline booking the cost is measured in pence rather than pounds.\n\nThe £16 fee became a penalty for those of us who often travel alone.\n\nFor a family of four flying a return journey, the charge represents a modest £2 per person per flight. But on a one-person, one-way trip it adds a full £16, making single fares for solo travellers relatively expensive.\n\nAdvertising rules meant that easyJet had to include the fee in quoted fares, which it wanted to look as low as possible. So the airline cited examples based on multiple travellers; on the airline’s ads prices were published as, say, £24.99*, where the asterisk meant “based on on two people travelling together”.\n\nThe majority of flights I buy are one-way sectors for solo travel. So on fare-comparison sites such as Skyscanner, easyJet was rarely cheapest. On Monday, the airline got my business because it had a particular late evening departure to Spain; any earlier, and I would have saved by booking on BA or Norwegian.\n\n“So long as the fares are clearly expressed, easyJet can price its flights however it wishes,” I recently wrote on the subject of the admin fee.\n\n“But I imagine one day soon the airline will realise it is losing out by sending travellers like me to other carriers, and abolish the charge while raising its fares slightly.”\n\nOn Tuesday, easyJet finally dropped the idea after seven years, saying: “The admin fee has been removed now as part of an ongoing review of our fees and charges.\n\n“This improves price transparency for our customers and reduces complexity.”\n\nThe abolition does not apply retrospectively. Even though I was presumably one of the last travellers to pay the anti-singles charge, I am glad the airline has changed its policy – and I look forward to flying more frequently on easyJet now that it is fee-free.\n\nOther organisations have fees on their minds. The “Operation Matterhorn” rescue for Thomas Cook passengers who were on holiday when the travel giant went bust will be underwritten by the UK taxpayer by £40m. The public finances took a rather smaller hit two years ago when Monarch failed. On both occasions, the government decided to fly everyone home for free, regardless of whether or not they had paid for Atol protection.\n\nAfter the Monarch failure, the Department for Transport (DfT) set up the Airline Insolvency Review. Five months ago, it recommended a “Flight Protection Scheme” to foot the bill in future collapses.\n\nThe idea: everyone pays a 50p levy on each flight from the UK, to build up a fund that pays for future airlifts.\n\nI imagine that pressure for the DfT to introduce such a fee will increase when the cost per passenger of the Matterhorn manoeuvres becomes apparent; my betting is that it will be close to £1,000 each.\n\nBut I hope that the idea is ditched. The vast majority of flights bought by UK travellers are with rock-solid airlines, such as British Airways, easyJet, Jet2 and Ryanair. It is preposterous that the 60 million-plus UK passengers who book on these carriers each year should contribute to a fund to bail out customers of carriers that are less well run.\n\nInstead the government should specify that Air Passenger Duty, which starts at £13 for economy passengers on European flights, includes an element to help travellers who would otherwise be stranded. And the Civil Aviation Authority should look more closely at the finances of UK travel firms that end up owing billions.\n\nOperation Matterhorn, which is now ending, has been a success; but it is far better to prevent failure.\n\nSimon Calder has been named Features Journalist of the Year – Ground Transportation at the 2019 Business Travel Journalism Awards for an article about split ticketing on the railways. Read the award-winning piece here.", "description": "On Monday afternoon, 30 September, I booked a flight on easyJet. That is a rare event, compared with the number I book on British Airways and Ryanair. All are excellent airlines. But I fly less frequently with easyJet because of the absurd “administration fee” that the airline introduced in 2012.", "authors": ["Simon Calder"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/03/20/easyjet-a320-at-bristol-2.jpg", "published_at": "2019-10-04"}