{"pub": "fox", "url": "https://foxnews.com/media/trump-impeachment-schiff-brad-blakeman", "downloaded_at": "2019-10-09 00:51:24.909849+00:00", "title": "Brad Blakeman on impeachment probe: Democratic senators would never assume the risk of convicting Trump", "language": "en", "text": "Democratic senators facing reelection in 2020 and those running for president, would have a hard time defending impeachment on the campaign trail and are unlikely to vote to convict President Trump, Brad Blakeman, claimed on Tuesday.\n\n\"The Senate, which is co-equal to the House, is holding their own hearings. More power to them. But the Democrats have not thought this completely through,\" Blakeman said during an appearance on \"Outnumbered.\"\n\n\"Be careful what you wish for. Let's say they impeach the president by the holidays. January, the Senate reconvenes. Who are the major first-tier candidates for president? U.S. senators.\"\n\nBlakeman predicted their poll numbers would take a hit in states like Iowa, New Hampshire, and South Carolina -- states where Trump either won or lost by a close margin in 2016.\n\nREP. KINZINGER: ADAM SCHIFF'S 'SELECTIVE LEAKING' HAS TURNED IMPEACHMENT PUSH INTO A 'CLOWN SHOW'\n\n\"They're going to be stuck in the Senate not being able to fundraise. Who's going to be out there on the road,\" Blakeman said. \"They're going to let Joe Biden run the tables in these primary states when they have a duty and obligation to sit there at a trial?\"\n\nThe House has yet to hold an official vote on impeachment. after several Democrats publicly claimed a vote was not required by the Constitution.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSources told Fox News earlier this week that House Democrats believe they already have the 217 votes necessary to pass articles of impeachment against Trump related to his actions toward the government of Ukraine. Democrats have accused the president of withholding military aid from that country in exchange for its government launching an investigation into former Vice President Joe Biden, his son Hunter and Hunter Biden's dealings while on the board of gas company Burisma Holdings.\n\nFox News' Leland Vittert and Melissa Leon contributed to this report", "description": "Democratic senators facing reelection in 2020 and those running for president, would have a hard time defending impeachment on the campaign trail and are unlikely to vote to convict President Trump, Brad Blakeman, claimed on Tuesday.", "authors": ["Nick Givas", "Nick Givas Is A Reporter With Fox News. You Can Find Him On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/blakeman.png", "published_at": "2019-10-08"}