{"pub": "nytimes", "url": "https://nytimes.com/2019/10/12/opinion/opera-frau-ohne-schatten-strauss.html", "downloaded_at": "2019-10-12 16:04:44.655445+00:00", "title": "Opinion | In 1919, an Opera Tried to Heal a Broken Europe", "language": "en", "text": "The Viennese writer Stefan Zweig was a political pacifist during World War I and moved to neutral Switzerland, abandoning his own country, the Hapsburg Empire of Austria-Hungary, which was fighting in alliance with Germany. In 1919, with the war over and Austria a republic, Zweig came home.\n\nOn March 24, he stepped out of the train at the Austrian border in the little medieval town of Feldkirch and saw the citizens gathered in excited anticipation of another train that was about to arrive at the station, going in the other direction, from Austria into Switzerland. “Slowly, almost majestically it seemed,” Zweig wrote, “the train rolled near, a special sort of train, not the customary, shabby, weather-beaten kind, but with spacious black cars, a train de luxe.” Zweig wondered what the fuss was all about. “Then I recognized behind the plate glass window of the car Emperor Karl, the last emperor of Austria, standing with his black-clad wife, Empress Zita. I was startled; the emperor of Austria, heir of the Hapsburg dynasty which ruled for seven hundred years, was forsaking his realm!”\n\nKarl and Zita were leaving behind them not only their palaces in Vienna but also the receding historical epoch in which emperors and empresses were politically important in Europe. Kaiser Wilhelm had left Germany for the Netherlands, and the Russian czar and czarina, with their children, had been murdered by the Bolsheviks the previous year. King George V of Britain remained emperor of India, at least formally, but there were no more emperors in Europe. By 1919 the lands of the former Hapsburg Empire were already split into a new map of national states.", "description": "“Die Frau ohne Schatten” imagined an enlightened, democratic empire.", "authors": ["Larry Wolff"], "top_image": "https://static01.nyt.com/images/2019/10/12/opinion/12Wolff1919-04/12Wolff1919-04-facebookJumbo.jpg", "published_at": "2019-10-12"}