{"pub": "scmp", "url": "https://yp.scmp.com/tertiary-education/the-hong-kong-polytechnic-university/article/113194/tips-land-your-first-job", "downloaded_at": "2019-10-05 13:49:58.634540+00:00", "title": "Tips to land your first job in the logistics industry: Choose the right programme, leverage LinkedIn, and make the most out of overseas internships", "language": "en", "text": "Choosing what to study after secondary school is a big decision for most young people. It is quite normal to be unsure about which course to take or which career to aim for. Careful consideration of the options and advice from people with experience always helps.\n\nCalvin Lai Kin-tai is now a graduate with a BBA in International Shipping and Transport Logistics from The Hong Kong Polytechnic University (PolyU), but he still remembers that deciding to take that programme was far from easy.\n\nHe sought guidance from a respected teacher who, fortunately, also had a friend working in the logistics sector. Talking about the many career opportunities opened Lai’s eyes to the importance of the industry in Hong Kong and helped him see it could be a good fit.\n\nHe currently works as a management trainee at Yusen Logistics (Hong Kong). The firm is a third-party service provider handling air and ocean freight, contract logistics, and origin cargo management.\n\nDuring the three-year trainee programme, Lai will learn the business by doing rotations with the different divisions. In addition, an experienced mentor is assigned to each trainee to offer guidance and help them navigate their way through new challenges.\n\nAt present, Lai is with the contract logistics division, which provides warehousing and cargo delivery services. It also offers value-added extras including labelling, sorting and repacking.\n\nLai often sees how his courses at PolyU have direct relevance in the world of work. For instance, he notes how the course on shipping documentation and warehouse management gave him a head start in understanding workplace methods and procedures.\n\n“The strategic management course has helped me with decision making when different solutions are possible,” he says. “And, in general, the BBA programme gave me the fundamental concepts and an overview of the logistics industry which has been a very good foundation. I felt well prepared when looking for a job, and the knowledge gained from my studies meant I could consider going into different areas of logistics.”\n\nLai had interviews with a number of companies before deciding to join Yusen. His advice to others is to prepare well for every interview and do plenty of research.\n\n“Look for background information about the company and familiarise yourself with what it does,” he says. “Also, Look for PolyU alumni on LinkedIn and, if possible ask them a few questions. They may be able to offer useful interview tips and other advice. Remember too that interviews are a way to gain experience. I had quite a few before landing this job, but the practice also helped to build my self-confidence.”\n\nHe noticed that employers were always interested to hear about his internship with a logistics company in Beijing. This was arranged by PolyU as part of the BBA programme and provided practical know-how plus hands-on experience.\n\nSo far, he says, the three best things about his job in the logistics industry/are:\n\n1. The chance to accumulate knowledge: he can study and take part in different departments’ day-to-day activities and projects in his current position.\n\n2. Improving communication skills: as a coordinator, talking and communicating with colleagues across the company is an important part of the job.\n\n3. Economic view: the current economic situation is directly reflected in the activities of a multinational logistics firm.\n\nEdited by John Cremer\n\nYou might also like:\n\nHow an internship at top logistics company DHL taught this PolyU student about the crucial role of supply chain management in the global economy\n\nHow studying Supply Chain Management helps a student manage the logistics of her studies in Hong Kong and abroad\n\nLearn how to get everything to the right place at the right time with PolyU’s undergraduate course in supply chain management", "description": "Sponsored Feature", "authors": [], "top_image": "https://yp.scmp.com/sites/default/files/styles/900x506/public/images/calvinlai.jpg", "published_at": "2019-10-05"}