{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/16/protest-moroccan-journalist-trial-hajar-raissouni", "downloaded_at": "2019-09-16 23:14:31.640523+00:00", "title": "Protest held outside trial of Moroccan journalist accused of illegal abortion", "language": "en", "text": "Hajar Raissouni says charges are fabricated and motivated by her work, which is critical of government\n\nDemonstrators have staged a protest outside a court in Rabat to coincide with the latest hearing in the trial of a Moroccan journalist accused of undergoing an illegal abortion and having sex before marriage.\n\nIn a letter written from prison, Hajar Raissouni said the charges were fabricated and motivated by her work, which had been critical of the government.\n\nRaissouni, who works for one of Morocco’s few independent media outlets, has been lauded for her coverage of mass demonstrations in the Berber-speaking Rif region in the country’s north.\n\nRaissouni is standing trial alongside her fiance and the medical staff accused of performing an abortion. It has sparked fierce criticism from a wide spectrum of Moroccan society, amid accusations that the authorities have abused the country’s laws to target women and crack down on free speech.\n\nRaissouni was stopped outside a clinic in Rabat on 31 August by six plainclothes police officers who questioned her about whether she had undergone an abortion. She and her fiance, professor Rifaat al-Amin, were detained along with the doctor accused of performing the procedure and two clinic staff members, who told investigators they had performed a routine medical procedure on Raissouni to remove a blood clot.\n\nAfter her arrest, the journalist was forced to submit to a vaginal examination against her will to determine whether she had undergone an abortion. Despite evidence to the contrary, she faces two years in prison for having an illegal abortion and sex before marriage, which is also criminalised in Morocco. Mohammed Jamal Belkeziz, the doctor accused of performing the abortion, was previously decorated by King Mohammed VI of Morocco but now faces up to a decade in prison over the charges.\n\nCampaigners described the trial as a slap in the face to claims that Morocco is making progress on women’s rights. They say that up to 800 abortions are performed daily in Morocco, where abortion is illegal except in cases where the woman’s life is threatened due to pregnancy.\n\nLaila Slassi, a Moroccan lawyer, said: “We usually say that Morocco doesn’t accept abortion and that it’s illegal, but usually the police are fairly tolerant of it.” Slassi is a founding member of the Masaktach feminist collective, whose name translates as “I am not silent”.\n\nMoroccan investigative journalist released after 10 months in jail Read more\n\nProsecutor Abdelslam Imani told the New York Times that it was not the case that the authorities had targeted Raissouni because of her journalism, and claimed that the clinic she visited was under surveillance to see if it was performing illegal abortions.\n\nBut Slassi said: “The fact that she is a journalist and from a family that has caused some trouble for the Moroccan regime is probably the real reason why they’re using some pretext against her.”\n\nShe said Raissouni’s case highlighted the failure of the Moroccan state to protect women and freedom of the press. Slass said: “But these all fall under the same bigger right, which is the respect for the rule of law.”\n\nLoubna Rais, also from Masaktach, said: “This is an attack on free speech using gendered law. Everybody has to understand that all Moroccan people can be victims of this thing if one day they perhaps have a political opinion that is contrary to national official agenda.”", "description": "Hajar Raissouni says charges are fabricated and motivated by her work, which is critical of government", "authors": ["Ruth Michaelson"], "top_image": "https://i.guim.co.uk/img/media/d214bf8b4714c8248c5cc6f332b7b85bce18276c/0_117_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=086cbd240bd97bc95029a3a400d65750", "published_at": "2019-09-16"}