{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/13/hurricane-dorian-the-mudd-haitians-inequality", "downloaded_at": "2019-09-14 06:38:33.151238+00:00", "title": "'The poor are punished': Dorian lays bare inequality in the Bahamas", "language": "en", "text": "Holidaymakers queuing at immigration at the Bahamas’ Nassau airport are still serenaded by three pink-shirted men playing jovial music. They are still sunbathing on the beaches and still swimming in the sea. It is as if nothing has changed in paradise.\n\nYet 40 minutes away by plane, on the Abaco Islands, heaven turns to hell. The Mudd, a shantytown that was home to the Bahamas’ biggest Haitian immigrant community, has been obliterated by Hurricane Dorian as if by a massive bomb.\n\n'We have to give paradise a hand': Dorian aid operation proves a huge logistical challenge Read more\n\nOn Thursday a bare, crooked tree reminiscent of a desert wasteland was one of the few things still standing. Every dwelling had been destroyed. Cars were overturned. The ground was a wasteland strewn with blankets, clothes, fridges, shoes, rusty nails, splintered plywood, toilets and toothbrushes. The size of several football pitches, the Mudd was peopleless; no one knows how many died here and how many evacuated.\n\nNatural disasters often expose the gap between the haves and have nots and Dorian was no different. While the Bahamas has a reputation as one of the most desirable tourist destinations on earth, its luxury hotels and homes depend on a life support system of fishermen, hotel workers and laborers. Once again, it is the poorest who have been hardest hit when catastrophe strikes.\n\nFacebook Twitter Pinterest People walk among debris at the Mudd neighborhood, devastated after Hurricane Dorian hit. Photograph: Marco Bello/Reuters\n\n“We’ve brought this on ourselves,” was one opinion conveyed anonymously to the Guardian. “It’s all fine when you’re living in paradise and a Haitian comes and mows your lawn. We’ve just created our own structure and there hasn’t been any attempt to integrate.”\n\nHaitians have lived in the Bahamas for centuries but face poverty and prejudice, for reasons including religious beliefs that can include voodoo. A 2008 article in the College of the Bahamas Research Journal, entitled the Stigma of Being ‘Haitian’ in the Bahamas, noted that “Bahamians have long ‘looked-down’ on Haitians as not being social equals”.\n\nThe Mudd was built by thousands of Haitian immigrants over decades in Marsh Harbour on Abaco. But it was wiped out in hours, its flimsy wooden structures standing little chance against the wrath of Dorian. American emergency workers have found five bodies in the debris and expect more to come.\n\nOthers fled and are unaccounted for. Some have evacuated by boat to Nassau. Some sought refuge in places such as the pink-walled New Haitian Mission Baptist church. At one point 210 Haitians gathered on its bare concrete floor, without electricity or running water. Now there are 45, including two children.\n\nCharles Ilfrenord, its pastor, who moved from Haiti 35 years ago but still has family there, said: “Plenty of people died in the Mudd. I think more than 1,000.”\n\nFacebook Twitter Pinterest A man rests at the Full Gospel church in Sand Banks, 9 September 2019 in Great Abaco Island, Bahamas. The Haitians that have stayed struggle to survive with little help from foreign aid agencies. Photograph: Jose Jimenez/Getty Images\n\nJean Claude Timothy, 41, a builder and electrician who lived next to the Mudd, recalled helping his wife and children into the attic of their house as water rose 25ft high. “A trailer knocked the roof right off. I had to swim to get a boat to put my family in. We pulled it slowly down the road for a half a mile.”\n\nThe family were temporarily blinded by fumes from a nearby oil and diesel plant, Timothy added, but they found shelter in a government building.\n\nTimothy’s wife, 31-year-old Kenya, and their four children were evacuated by a boat that was taking women and children only. Timothy is now sleeping rough in a roofless building and struggling for food. “We’re just waiting for jobs and for something to do,” he said.\n\n“Everybody’s been hit, the rich and the poor, but for the rich it’s less severe because they live in better buildings. The people you work for for years don’t send a private plane for you. You worked for them for years but they don’t give you any food, any vacation pay.”\n\nTourism employs about half the Bahamian workforce and accounts for around half GDP. Abaco is renowned for its marinas, golf courses and all-inclusive resorts. Even now, a leaflet at Nassau airport advertises the Abaco Beach Resort, including “a boating paradise unlike any other”. Glen Kelly, its harbour master, told the Washington Post: “I’ll put it as raw as I can. We’ve always depended on Haitian labour, legal or illegal, to maintain this place. Now it’s a question of whether they’ll be back.”\n\nParadise comes at a social, economic and moral cost. The Bahamas has the second highest economic and social inequality in the Caribbean, according to the Latin American Economic Outlook 2019 Report. An editorial in the Nassau Guardian newspaper in 2017 warned: “Economic inequality is killing the Bahamas.” As Hurricane Dorian approached, affluent people were able to get out early whereas the poor had to remain and try to ride it out.\n\nLydia Ruth Hill, 38, a vacation planner and property manager, was one of only seven people who stayed behind in a neighborhood of more than 200. She had no sleep for 48 hours as she searched for missing people in the rubble; two of her relatives are still unaccounted for. She is now setting up a recovery command center but is inundated with messages from those who left and are worried about their possessions.\n\n“The night before last I answered 400 and some emails of people requesting me to send them stuff – ‘get the guns out of my safe, get my Rolex watch’ – or empty their fridges, when mine’s got rotten stuff in it right now, or care for their pet when mine are dead because I lost my house and everything, and less than 20% supporting us to say what can we try to help you with?\n\n“They were just really inconsiderate requests when we were on survival mode here and then people mouthing off at us when we said that we don’t have time to do that. At that point I was still trying to get critical care people off the island.”\n\nNearly two weeks after Dorian made landfall, at least 50 deaths have been reported, more than 1,300 people are missing and an estimated 15,000 are without food or shelter. Many in the underclass lost everything.\n\nEarl Arthurs, the operations specialist for the Caribbean Disaster Emergency Management Agency, said: “Any disaster, the poor people will be the ones that are punished. A poor person owns a small house and it’s not insured so when the hurricane comes and it’s washed away, that’s it. A rich person owns a nice mansion and it gets totaled but he gets money to build a new one. So that’s a big difference.\n\nFacebook Twitter Pinterest A boy eats at the Full Gospel church in Sand Banks, on 9 September 2019 in Great Abaco, Bahamas. Photograph: Jose Jimenez/Getty Images\n\n“Some of these people are living from hand to mouth, weekly pay cheque, so when something like this happens and they cannot work, they will definitely be dependent on government for support.”\n\nThere are concerns that undocumented Haitian immigrants may be reluctant to seek government aid lest they be penalized and deported. Arthurs said: “In every country, including the United States, people are scared to come out and register during crisis time, because after the crisis is finished they fear that they probably have enough information on them to go and pick them up and deport them.”\n\nPaul Taylor, the operations response manager of Team Rubicon UK, an NGO working with partners to coordinate and distribute aid, added: “As ever, there are people who do the work that the rich people don’t want to do and here that’s the Haitian community. There are lot of illegals here as well.\n\n“I think the issue now is what happens to people who don’t have any status here, who might be quite concerned about that. You’ve got to evacuate people from the islands – big reconstruction job – but where do those people go?”\n\nThe government of the Bahamas denies that Haitians will be treated differently.\n\nJack Thompson, a National Emergency Management Agency representative, said: “People are people. All peoples need help, whatever their status. The prime minister was very clear in his remarks that we’re going to help all persons here, irrespective of their nationality or status. There’s no room for differentiating when you’re in disaster.”", "description": "The tourist destination relies on a life support system of fishermen, hotel workers and laborers. They’ve been hardest hit", "authors": ["David Smith"], "top_image": "https://i.guim.co.uk/img/media/12ca154ce5decb4ab1b2b20cfd69d5f2dbaee7b6/0_165_4500_2700/master/4500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8b187e300de397c0b44b5bd3bf946e2a", "published_at": "2019-09-13"}