{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/3/dnc-calls-on-facebook-to-stop-running-trump-ads-to", "downloaded_at": "2019-10-03 23:30:44.081504+00:00", "published_at": "2019-10-03", "title": "DNC calls on Facebook to stop running Trump ads touting 'false narrative' about Joe Biden, Ukraine", "language": "en", "text": "The Democratic National Committee pressed Facebook to pull an ad purchased by President Trump’s reelection campaign as it ramped up its attacks Wednesday against former Vice President Joseph R. Biden.\n\n“Yes, any false ad should be fact-checked and removed, including this one,” said Daniel Wessel, the DNC’s deputy war room director, The Hill reported. “Facebook owes that to its users.”\n\nMr. Wessel was referring to a specific ad released last week by the Trump campaign attacking Mr. Biden, the current front-runner among Democrats vying to run in 2020 against Mr. Trump, The Hill reported.\n\nThe ad claims Mr. Biden “promised Ukraine a billion dollars if they fired the prosecutor investigating his son’s company,” echoing an allegation that Mr. Trump’s defenders have asserted on the heels of the president’s own scandal involving the Eastern European country.\n\n“Trump’s ad is part of an effort to push a false narrative intended to deceive and distract from the fact that he pressured a foreign leader to investigate a political rival in order to help his reelection, while withholding critical U.S. aid to that country — and his own White House released a document that proves it,” said Mr. Wessel, The Hill reported.\n\n“His campaign relies on a shameful strategy built on outright lies to the American public about the content of his phone call with the Ukrainian president. We all have a role to play in combating these lies, and that includes Facebook,” Mr. Wessel said.\n\nFacebook did not immediately return a message requesting comment.\n\nMr. Trump’s reelection campaign released the anti-Biden ads last week after a whistleblower complaint filed by a member of the U.S. intelligence community triggered Democrats in the House of Representatives to launch an impeachment inquiry.\n\nMr. Trump asked his Ukrainian counterpart, Volodymyr Zelensky, during a July phone call to investigate Mr. Biden and his son Hunter, according to a rough transcript of the conversation released by the White House.\n\nCongress is considering whether the White House tried to suppress information about the call and if Mr. Trump abused his power of the presidency by making the request while his administration blocked the release of military aid to Ukraine.\n\nMr. Trump has denied any wrongdoing.\n\nThe Trump campaign said last week that the anti-Biden ad was part of a $10 million campaign. It subsequently released a new spot Wednesday accusing Democrats seeking impeachment of pursuing a “coup.”\n\nThe campaign has spent more than $1.6 million on Facebook ads between last Wednesday, Sept. 25, and this Tuesday, Oct. 1, according to the social network’s public Ad Archive. The campaign has bought more than $19 million worth of Facebook ads since May 2018, according to the company.\n\nNick Clegg, Facebook vice president, recently said that the platform would not be fact-checking any posts or paid ads placed on behalf of political candidates, prompting the DNC’s chief executive officer to raise concerns earlier this week.\n\n“Social media platforms have a responsibility to protect our democracy and counter disinformation online. This is a serious missed opportunity,” said Seema Nanda, the DNC’s CEO.\n\nMr. Biden has denied wrongdoing with respect to his handling of Ukraine while vice president.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The Democratic National Committee pressed Facebook to pull an ad purchased by President Trump's reelection campaign as it ramped up its attacks Wednesday against former Vice President Joseph R. Biden.", "authors": ["The Washington Times Http", "Andrew Blake"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/20/facebook_app_suspensions_38204_c0-128-2039-1316_s1770x1032.jpg?14ec3c18ffacef660c374bfc1330041f6a6f7f41"}