{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/jim-cramer/jim-cramer-faang-for-president-15086967", "downloaded_at": "2019-09-12 07:15:54.023214+00:00", "title": "Jim Cramer: If FAANG and Co. Were Running, They Would Win Big Time", "language": "en", "text": "Time to take stock in FAANG and co. -- the big capitalization stocks that seem to be under fire every day, yet, may now be at a level where they just make too much sense not to own a couple of them, maybe even for keepsake.\n\nOn day when tech finally seems to be out of the doghouse, let's take a look at FAANG, and, as an added bonus, I will throw in Microsoft (MSFT) to go with Facebook (FB) , Amazon (AMZN) , Apple (AAPL) , Netflix (NFLX) and Google (now Alphabet (GOOGL) , of course).\n\nLet's start with Apple because of Tuesday's tour de force introduction of the new phone and watch. There are people a lot better at measuring the worthiness of the camera -- seems to me like you can be a better cinematographer with it than anyone, save the Oscar-winning pros. The battery life's longer, one hour to four hours, depending upon your model. You also get AppleTV+ for free if you buy it, a $4.99 a month value.\n\nI have looked at some of what's to come in TV, and it's a must, especially when it is a quarter the cost of a ticket to the movies. You won't notice the charge. That's what's so great about the App store, something the New York Times and U.S. Sen. Elizabeth Warren are upset about -- and Senator Warren, check your twitter followers, they are almost entirely and universally against your attack of the app store. As I always say, where does it say you need to own an Apple, let alone go to the store, and it makes no sense for Apple to favor its own apps: They are usually free and they get a third of the cost of a non-Apple paid app.\n\nSilly stuff.\n\nLook, I like things like entertainment from Apple, that's a fabulous stream of revenue. I also love that one of the new watches is only $199, which I think is the price point to get worldwide adoption, which will only layer on more service revenues.\n\nThe upshot? You have a story of hardware and consumables that sells at 19-times next year's earnings. With 5G on the way, and a service revenue stream to tied you over, that's crazy. You want Coca Cola (COKE) for 25-times next year's earnings? OR Clorox (CLX) and Procter & Gamble (PG) at 24? I'll take Apple any day of the week.\n\nHow about Facebook? With all of the heat that Amazon has been taking from the Federal Trade Commission and Alphabet by all of these state attorneys general, it looks like Facebook has simply become one of many that are being blasted, instead of the sole scofflaw, and, to be sure, it's no more than a scofflaw, anyway.\n\nWhat's happened with Facebook of late? I think that the candidates for president on both sides may dislike the company, but the thing that's missing in the story is that the users never abandoned it. I wonder if you went back and looked at all of the high profile quitters, if they aren't back on now.\n\nYou can't afford not to be. When you see those terrific camera options for Apple, you know what they're for? Instagram. When you see people like Michael Rubin, the incredibly talented owner of the multi-billion dollar Fanatics, come on CNBC and say that he puts 50% of his ad dollars on Google and 50% on Instagram, you know where the world's going.\n\nI think we have seen high tide in the era of Facebook evisceration. It survived. More than that, it is thriving, and I think it is beginning to recognize how many entrepreneurs have used Instagram to create businesses. Now it just needs to help them to cement its relationship as a proponent of empowerment. Call me a size buyer.\n\nAlphabet? There are 48 state attorneys general going after these guys for monopolistic practices. News flash: Do you know FTC under President Obama spent more than two years looking into this very issue, millions of pages of documents examined, and found nothing to bring a case on?\n\nWhen I went to Harvard law, I studied with the late, great Phil Areeda. He explained that antitrust law is pretty easy: Does a company (or companies) use its power to raise prices or lower them and stifle competition or enable it? Google's lowered the price of advertising dramatically. There were no documents found by the FTC that indicated there was any attempt by Google to stifle any competition. That's quite different from the federal case successfully brought against Microsoft 20 years ago.\n\nWhat a waste of time.\n\nI bet if you polled users of Google, you would find the fast majority love it. At 25-times next year's earnings?\n\nBuy it.\n\nNetflix? This one is tough. While I don't think that there is any one straw that could break this camel's back, we are getting so many services now, including from Disney, Hulu and Apple that we may have reached a saturation level. As much as I love Netflix, as much as I binge endlessly, I am worried about this one. I just don't know how to value it, and I am uncomfortable gaming the number of sign-ups vs. the content. I have always liked Netflix, because I believe in the subscription economy, and I know I would pay more for Netflix, if asked to. I just don't know at what point people stop thinking it is a bargain. Call me baffled.\n\nAmazon's got some weirdo image problem right now. The Democratic leadership seems to have determined that this company is stifling innovation and the Republicans in the White House hates it, perhaps because of the Washington Post ownership by founder Jeff Bezos.\n\nBut more than 100 million people belong to Prime. Isn't that enough to say that the people have spoken? Not that long ago we had on Andy Jassy, the head of Amazon Web Services, and he talked about how he has brought relentless price decreases -- not increases, but decreases -- to the service that's been the source of empowerment for millions of small businesses. I know that if we use the Sen. Warren followers index there are people who truly believe this company is an innovation stifler. I say, where would we be without these guys? How about in an inflationary hell hole, because it has done more to keep prices down than any other company in history, including Walmart (WMT) . I like the stock, and I would remind you that Carolyn Boroden just last week said it's right to buy on a technical basis, and I agree with her.\n\nThen there's Microsoft. Here's a company that at one point was in the crosshairs of Justice, legitimately, for stifling. Now it's an innovator and a competitor that's done amazing things in computers, in analytics, in gaming and in the cloud. It's the dominant software company in the world and it is performing spectacularly. It's a trillion dollar bargain, even at these prices.\n\nNow let's just step back for a second and talk about innovation. Hardly a day goes by since the president was elected that we don't hear negative things about what China has done to hurt our country, whether it be because of intellectual property theft or subsidized destruction of our own manufacturing base. What keeps us in the game? What makes us so we are still the preeminent country in the world? Our great technology businesses, chiefly Alphabet, Amazon, Apple, Facebook and Microsoft.\n\nYou don't get to be that big because you are a bunch of idiots and boneheads. You get to be that big usually because you are the best at what you do, and you provide a valuable service for your customers. You don't need me to tell you that these companies are politically unpopular. You don't need a weatherman to know which way the wind blows. But I believe if you put these companies to a vote, if you had them on the ballot to as to whether they are positively or negatively viewed, I bet they would come out ahead of any politician or newspaper -- their main opponents -- hmm, maybe that's why their shares are worth owning.\n\n(Apple, Amazon, Alphabet, Facebook and Microsoft are holdings in Jim Cramer's Action Alerts PLUS member club. Want to be alerted before Jim Cramer buys or sells these stocks? Learn more now.)", "description": "While politicians, news media and government agencies take aim a tech giants, we have to see that these are the ones helping keep our nation strong and innovative, and have the love of the people....GOOGL", "authors": ["Jim Cramer", "If Faang", "Co. Were Running", "They Would Win Big Time", "While Politicians", "Media", "Government Agencies Take Aim At Tech Giants", "Understand That These Are The Ones Helping Keep Our Nation Strong", "Innovative --", "Have The Love Of The People."], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/f0e4caa5-879a-11e9-a5aa-c9a3104cf574.png", "published_at": "2019-09-11"}