{"pub": "wsj", "url": "https://barrons.com/articles/how-not-to-lose-money-when-flipping-a-house-51569589200?mod=rsswn", "downloaded_at": "2019-09-27 15:00:15.082742+00:00", "title": "How Not to Lose Money When Flipping a House", "language": "en", "text": "Text size\n\nThis Mansion Global story was first published in Penta’s September issue.\n\n\n\nIn the past six or seven years, Emil Hartoonian, managing partner and principal of The Agency’s Calabasas, Calif., office, estimates that he’s helped high-net-worth clients, including celebrities, flip 40 to 50 luxury houses in the Los Angeles area. House flipping, seen as an easy way to make a killing in the U.S. real estate market, has practically become a national pastime. Driven by popular TV shows that take a home from purchase to renovation to resale in an hour or less, a record number of flippers are flipping, even as gross profits are flopping.\n\nIllustration by Rose Wong\n\nAccording to Attom Data Solutions’ latest House Flipping report, 7.2% of U.S. home sales in the first quarter of 2019 were flipped—the highest rate since the first quarter of 2010. But the average gross sales profit was only $60,000, down from $62,000 in the previous quarter, and the lowest since the first quarter of 2016.\n\nThe figures prove that house flipping isn’t as simple as buying a property, fixing it up, and putting it back on the market at a higher price. The most successful flips—the ones that make the highest profits—take time, money, and extensive planning. But there are ways to make sure you don’t lose money.\n\n“My clients are high-profile people. They have careers that are not in real estate, and they see house flipping as an investment that creates sizable profits,” Hartoonian says, adding that fewer than half his clients are flippers. “This is not a primary income for these people.” Hartoonian advises house flippers to choose properties in “vibrant neighborhoods that have notable sales and notable residents” because “location is instrumental in the exit strategy.”\n\nThe type of renovation, he says, has a great impact on the resale. “Flippers should avoid too much custom tailoring; there’s a fine balance,” he says, adding that the buyer of the flip “should have the opportunity to make it all their own by adding their own personal touch.”\n\nA Nation of Flippers $60,000 Average gross home-sales profit in the first quarter of 2019. 7.2% Number of home sales in Q1 that were flipped. $260,000 The largest profit Kortney Wilson has made from a home sale.\n\nAs for profit, although there’s no magic number, Hartoonian says that “if you can clear 15%, plus or minus, that’s positive because at the bigger sales prices, that could add up to $3 million.”\n\nFor Kortney Wilson, the Nashville-based co-host of HGTV’s Masters of Flip, which has aired since 2015, flipping houses “is always about the numbers.” And her numbers are high—she and her co-host husband, Dave Wilson, have flipped 125 houses in the historic district of East Nashville and nearby.\n\nWilson says it isn’t as easy as Masters of Flip makes it seem because “we take 100% of the risk as well as 100% of the reward.” The couple’s first flip, 15 years ago, was “a means to an end,” she says. “Our rule used to be that we had to make $100,000. But now things are riskier, and we are doing it faster because of the show, so we made it $50,000. It still works for us.”\n\nThe Wilsons generally pay $250,000 to $300,000 for a house, spend $250,000 to $300,000 on a three- to four-month renovation, and sell the property for $700,000 to $800,000. Their biggest profit was $260,000.\n\nWilson works with the same contractor for every project. “I tell people to do due diligence when hiring a contractor and a real estate agent,” she says, adding that although she’s a real estate agent, she doesn’t broker her own properties.\n\nEven though flipping is on the upswing, Jonathan Woloshin, head of Americas real estate investment strategy at UBS Global Wealth Management, advises caution to his clients. “There was a time, just following the downturn of 2008 and 2009, when it was more attractive from a risk-adjusted-return perspective. But with the substantial increase in national house prices over the past several years, it’s more difficult to find bargains,” he says. He adds that there’s more competition from single-​family rental companies and private-equity firms, while “a proliferation of a new class of well-capitalized, data-driven industry players called iBuyers is further complicating the calculus.”\n\nWoloshin warns clients that flipping residential properties is riskier than other kinds of real estate investing—such as in commercial and multifamily properties—because, among other things, there’s no rental income, and pre-flip repairs can often cost substantially more than budgeted. He says that flippers should buy properties in strong markets and submarkets, “the ones where people are going, not the ones they are leaving.”\n\nIn the time it takes to renovate a house for flipping, the market can change drastically, he says, adding that this struck home for him when he made two trips to Las Vegas two years apart.\n\n“In 2007, I turned on the TV in the hotel, and it was the flipping channel,” he says. “In 2009, I stayed in the same hotel and when I turned on the TV, it was the foreclosure channel.”", "description": "Experts offer advice on the best way to invest in property", "authors": ["Nancy A. Ruhling"], "top_image": "https://images.barrons.com/im-99968/social", "published_at": "2019-09-27"}