{"pub": "usatoday", "url": "https://usatoday.com/story/sports/ncaaf/acc/2019/10/07/florida-state-names-james-blackman-as-starting-quarterback-for-clemson/3899857002", "downloaded_at": "2019-10-07 20:19:00.065682+00:00", "title": "Florida State football names James Blackman as starting quarterback for Clemson", "language": "en", "text": "CLOSE The Seminoles opened as 27.5-point underdogs for Saturday's game at Clemson. Curt Weiler, Tallahassee Democrat\n\nFlorida State coach Willie Taggart has elected to go with redshirt sophomore James Blackman as his starting quarterback for Saturday's game against No. 2 Clemson.\n\nHe made the announcement during his weekly press conference. The Seminoles (3-2, 2-1 ACC) take on the Tigers (5-0, 3-0 ACC) at Memorial Stadium at 3:30 p.m. Saturday.\n\nTaggart went on to say that graduate transfer quarterback Alex Hornibrook will play in the game.\n\n\"James practiced all week last week and practiced yesterday and will continue to be our starter, and they both will play,\" Taggart said.\n\nBlackman started the first four games of the season, but he suffered a sprained MCL in the third quarter of the Louisville game. He missed the rest of the second half and did not play against North Carolina State.\n\nFlorida State Seminoles quarterback James Blackman (1) throws to his teammate. The Florida State Seminoles lead the Louisiana Monroe Warhawks at the half 24-7. (Photo: Alicia Devine/Tallahassee Democrat)\n\nBlackman is completing 69.4% of his passes with 970 passing yards and nine touchdowns with two interceptions this season. He's averaging 7.8 yards per attempt.\n\nTaggart said Blackman would be the starter as long as he was healthy heading into the NC State game.\n\nHornibrook took over for Blackman in the second half against Louisville and started against North Carolina State.\n\nPOWER RANKINGS: Big 12 | Big Ten | Pac-12 | SEC\n\nRE-RANK: Ohio State takes over as the latest No. 1 in NCAA Re-Rank 1-130\n\nWINNERS AND LOSERS: Highs and lows from Week 6 in college football\n\nHornibrook has completed 73.3% of his passes for 571 yards with five touchdowns and no interceptions. He's averaging 9.5 yards per attempt.\n\n\"They've both been good at it,\" Taggart said.\n\n\"You just work them in however you see fit to help you win a ballgame. Like I say, they both, they're different, different mindsets. I think Alex is more businesslike. James is, again, he's going to inspire you to do some things out there, his teammates. But like I say, they both have executed our offense the way we need them to, and no matter who's in there we need them to continue to do that, continue to distribute the ball to our playmakers, and then more importantly, take care of the football.\"", "description": "Florida State coach Willie Taggart has named James Blackman as the startin quarterback for this weekend's road match-up at Clemson.", "authors": ["Wayne Mcgahee Iii", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/07/PTAL/252e10b3-848b-470b-be5c-0376da9c2559-FSU_v_ULM589.JPG?crop=4072,2291,x0,y105&width=3200&height=1680&fit=bounds", "published_at": "2019-10-07"}