{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7546055/Victor-Valdes-SACKED-youth-team-coach-Barcelona-falling-Patrick-Kluivert.html", "downloaded_at": "2019-10-07 12:28:58.720980+00:00", "title": "Victor Valdes is SACKED as youth team coach by Barcelona after 'falling out with Patrick Kluivert'", "language": "en", "text": "Victor Valdes has sensationally been sacked as Barcelona Under-19s coach after a fall-out with former team-mate Patrick Kluivert.\n\nThe 37-year-old, who made over 500 appearances for the club, stepped up to youth team coach in July - during the same period Kluivert took over as head of La Masia academy - but the relationship between the pair has soured to such an extent that Valdes has been booted out.\n\nA Barca statement read: 'FC Barcelona have informed Víctor Valdés on Monday that he is no longer U19A coach and no longer employed by the Club. Franc Artiga, up till now coach of the U19B and part of the youth set up at La Masia since 2010, will take over as coach of the U19A.'\n\nVictor Valdes has been sacked by Barcelona three months after joining the youth team setup\n\nReportedly, the pair - who played together at the Camp Nou from 2002-2004 - have fallen out over a number of issues but the most significant is Valdes' reluctance to adapt his formation to a rigid 4-4-2.\n\nValdes was also unhappy with Kluivert and the club's decision makers over being unable to use the Estadi Johan Cruyff as the Under-19s ground because the B team and women's team play there.\n\nSince leaving the club as a player in 2014, Valdes' career has taken on a rapid decline.\n\nAfter two failed years at Manchester United and a brief loan spell at Belgian side Standard Liege, the Spanish World Cup winner retired after playing for Middlesbrough three years ago.\n\nPatrick Kluivert took over as head of Barcelona's famous La Masia academy in July\n\nHe was rumoured to be in line to take charge of the first-team at Barca given Ernesto Valverde's seemingly precarious position.\n\nBut his stock with the club's hierarchy has dropped immeasurably, with Kluivert in particular clashing with his former team-mate.\n\nValdes' Under 19 side had won four of five league matches this season but lost both of their UEFA Youth League games against Borussia Dortmund and Inter Milan.", "description": "The relationship between the pair, who both work together within Barcelona's famous La Masia academy, is said to have soured to such an extent that Valdes has now been given the boot.", "authors": ["Kieran Jackson For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/12/19392186-0-image-a-84_1570446222653.jpg", "published_at": "2019-10-07"}