{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/the-fbi-investigation-into-brett-kavanaugh-turns-out-to-be-more-of-a-sham-than-it-seemed/2019/09/16/9fa9e6a6-d8c4-11e9-bfb1-849887369476_story.html?tid=pm_pop", "downloaded_at": "2019-09-17 00:55:47.561358+00:00", "title": "The FBI investigation into Brett Kavanaugh turns out to be more of a sham than it seemed", "language": "en", "text": "IN SEPTEMBER 2018, as the battle over the confirmation of Brett M. Kavanaugh to the Supreme Court raged, then-Sen. Jeff Flake (R-Ariz.) and Sen. Christopher A. Coons (D-Del.) struck a deal. Mr. Flake would delay confirming Mr. Kavanaugh until the FBI completed an investigation into credible allegations of sexual misconduct — but the investigation couldn’t be open-ended or last ages. Despite these caveats, both senators insisted that the inquiry must be conducted in good faith. Mr. Flake said, “It does no good to have an investigation that gives us more cover.” Mr. Coons declared that “the FBI needs to be allowed to pursue all reasonable investigatory steps.” GOP senators who subsequently voted to confirm Mr. Kavanaugh praised the resulting investigation for being thorough.\n\nNow comes additional evidence that the investigation was, in fact, far from thorough and more of a sham than it seemed at the time. Reasonable investigative steps were not pursued.\n\nIn an article adapted from their forthcoming book on the Kavanaugh controversy, two New York Times reporters revealed that the FBI interviewed practically no one regarding one of the allegations against Mr. Kavanaugh, in which one of his Yale classmates, Deborah Ramirez, said Mr. Kavanaugh drunkenly exposed himself to her. “During his Senate testimony, Mr. Kavanaugh said that if the incident Ms. Ramirez described had occurred, it would have been ‘the talk of campus.’ Our reporting suggests that it was,” the reporters wrote. They found that federal agents interviewed none of the two dozen people who Ms. Ramirez said could bolster her story and ignored an allegation of a second episode of drunken misbehavior.\n\nThis investigative shoddiness was apparently the fault not of the FBI but of Republicans looking for the cover Mr. Flake had claimed he did not want. At first, they limited the FBI to questioning only four people about two separate allegations. Agents eventually got an expansion of the number of people they could contact — they interviewed 10 — but not an extension of their deadline: a mere week. Senate Majority Leader Mitch McConnell (R-Ky.) insisted that the Senate would vote within days. Under these pressures and limitations, the FBI interviewed few and turned in its report early.\n\nThe Senate was faced with the challenge of evaluating Mr. Kavanaugh’s credibility when he insisted the allegations against him were totally baseless and that he did not ever get so drunk he blacked out. Corroborating witnesses for Ms. Ramirez, along with any accounts of Mr. Kavanaugh’s drinking they had to share, would have spoken directly to this question. Instead, the Senate got a woefully incomplete report. Republicans got their cover.\n\nOverheated calls from Democrats for Mr. Kavanaugh’s impeachment, like the chilling calls from President Trump for the Justice Department to strike back at accusers, are not productive. But the Justice Department Office of the Inspector General should investigate exactly what marching orders the FBI got and when, and how its agents responded.", "description": "The Justice Department should investigate what marching orders the FBI got, and when.", "authors": ["Editorial Board", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/SRyzSQiDBo5o6Sy7LBNjzEggu8E=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/R2I7SWETPUI6TNLQMQLO7XAIAM.jpg", "published_at": "2019-09-16"}