{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/finding-a-snake-in-your-house-the-kotaku-review", "downloaded_at": "2019-09-23 02:31:18.469622+00:00", "title": "Finding A Snake In Your House: The Kotaku Review", "language": "en", "text": "I don’t have a problem with snakes, spiders, scorpions or any other small and potentially dangerous creatures that lurk outside. That’s their territory. I get it. But when one of these things comes into my apartment, I find it annoying. It also is a terrible thing to come home to in the middle of the night.\n\nEarlier this week I attended a wonderful birthday party with friends. It was a good party, not one of those weird parties where people drink energy drinks and mix them together into gross concoctions. After hours of fun and enjoyment, my girlfriend and I headed home. We arrived, turned on the lights, said hello to the cats and began to relax. That was until suddenly I heard my girlfriend shout my name from the living room.\n\n“Zaaaaccccckkkkk? What’s this? Is this.....a SNAKE?!”\n\nHer reaction was a mixture of fear, anger, shock and a bit of confusion. All fair reactions to have when you find a snake in your house. She had walked over to the sliding glass door and discovered a coiled up black snake, about a foot and an inch long. It was resting on a small brown rug.\n\nI walked over, assuming it wasn’t a snake. Maybe it was too dark and she was confused? Maybe it was a piece of string that had been piled up by the cats? But when I rounded the corner and found her crouched over a black pile on the rug I almost immediately saw what it was. It was, in fact, a snake.\n\nComing Home To A Snake In Your House TYPE OF GAME Horror LIKED When it was gone, telling folks about the snake, watching it leave. DISLIKED The surprise, removing it, it moved too fast, it was a snake in my house. DEVELOPER Nature PLATFORMS Unfortunately my house, old mobile phones TIME PLAYED 5 minutes of finding it and removing it. Hours of fear and anxiety afterwards.\n\nA lot of things shot through my head at that moment. Too many to list here. But two key things stayed in my mind: What kind of snake is this and how do I get rid of it? I grew up in Florida. I’ve handled snakes before, even though I really shouldn’t have. Look, I watched a lot of The Crocodile Hunter and Jeff Corwin Experience on Animal Planet. I also lived in a state that is basically a tropical jungle on top of a swamp. So I spent time outside catching things a kid shouldn’t catch. As a result, I was able to identify the snake as a Garter Snake, which is non-venomous.\n\nHere’s the thing though. Looking at images of garter snakes now, after the event, I feel very confident that I identified it correctly. But at the moment, with a snake in your home and cats coming over to investigate, I was far less confident. So as my girlfriend held the cats back, I grabbed a small bowl and gently, but quickly, covered the snake. Then I slid the entire brown rug outside and as I did this the bowl shifted and out popped the head of a snake.\n\nMy hand, which was holding the bowl down, was now a few centimetres from a small snakehead which was looking at me. I calmly, but rather quickly, lifted my hand and in one motion spun the rug onto the porch and flipped the plastic bowl off the snake.\n\nI’ve not moved the rug back in and it remains where it landed after the flip. (Photo: Zack Zwiezen)\n\nAfter our snake encounter, we plugged up a small gap in the sliding glass door, which seems to be the only way it could have gotten inside. The fear of another snake coming in lingered for the rest of the night. I’m not worried about another Garter Snake sneaking in. I’m worried about a dangerous snake getting in through the same method.\n\nI’m also sorry that during this ordeal I never snapped a photo of the snake. While I was dealing with this snake, the last thing I thought about was documenting it with a camera. This is more evidence that found footage films are bullshit. Seriously, I only ran into a small snake and didn’t film it. Why would someone fighting an evil bigfoot or whatever film it for hours and hours?\n\nAfter all of this, as it slithered away into bushes that I will now fear a bit for the next few months, I felt proud that I didn’t just kill it. Snakes are amazing creatures, important parts of our local ecosystems and deserve respect.\n\nBut it absolutely sucks when they decide to slither into your house in the middle of the night. Not hoping for any sequels. This feels like a good way to start and end the Finding A Snake In Your House franchise.", "description": "I don’t have a problem with snakes, spiders, scorpions or any other small and potentially dangerous creatures that lurk outside. That’s their territory. I get it. But when one of these things comes into my apartment, I find it annoying. It also is a terrible thing to come home to in the middle of the night....", "authors": ["Nathan Grayson", "Stephen Totilo"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/eusekp0bfk8sww8qgavt.jpg", "published_at": "2019-09-23"}