{"pub": "cbs", "url": "https://secure-fly.cbsnews.com/news/the-whistleblower-complaint-whistleblower-had-prior-working-relationship-with-current-2020-democratic-candidate", "downloaded_at": "2019-10-09 22:01:27.362097+00:00", "title": "Whistleblower had \"prior working relationship\" with current 2020 Democrat, source says", "language": "en", "text": "Washington — The whistleblower who filed a complaint about President Trump's July phone call with Ukrainian President Volodymyr Zelensky is a registered Democrat who had a \"prior working relationship with a current 2020 Democratic presidential contender,\" a source familiar with the matter tells CBS News.\n\nThe person said the intelligence community inspector general, Michael Atkinson, told Congress the whistleblower's political affiliation, but would not disclose to lawmakers which 2020 candidate the whistleblower was connected to, out of fear that doing so might expose the whistleblower's identity.\n\nThe nature of the \"prior working relationship\" remains unclear, but the whistleblower's attorneys issued a statement clarifying their client's background Wednesday afternoon.\n\n\"First, our client has never worked for or advised a political candidate, campaign, or party,\" Mark Zaid and Andrew Bakaj said. \"Second, our client has spent their entire government career in apolitical, civil servant positions in the Executive Branch. Third, in these positions our client has come into contact with presidential candidates from both parties in their roles as elected officials – not as candidates.\"\n\nThe Washington Examiner first reported the whistleblower had a \"professional relationship\" with a Democratic candidate.\n\nThe president referenced reports about the whistleblower's party affiliation during an appearance at the White House Wednesday afternoon.\n\n\"The whistleblower is a Democrat — a strong Democrat — working with one of my opponents as a Democrat that I might end up running against,\" Mr. Trump said. \"The whole thing is a scam. It's a fix.\"\n\nCBS News was first to learn the full contents of the whistleblower's memo, as described to CBS News. The memo, dated July 26, a day after the Trump-Zelensky call, is based on a conversation the whistleblower had with an unnamed White House official who listened to the call.\n\nAccording to a source familiar with the matter, the memo was among the factors that led the Atkinson to determine the whistleblower's formal complaint on August 12 was credible. The inspector general testified Friday behind closed doors before the three House committee leading the impeachment inquiry.\n\nAccording to the memo, the White House official described the contents of the call as \"crazy,\" \"frightening\" and \"completely lacking in substance related to national security.\"\n\nThe whistleblower said the official was \"visibly shaken\" by what had transpired and seemed keen to inform a trusted colleague within the U.S. national security apparatus about the call.\n\nMr. Trump has spent recent days blasting the whistleblower and calling for the disclosure of the person's identity, as House Democrats move forward with their impeachment inquiry. The White House told Capitol Hill late Tuesday it will not comply with that inquiry, and will not have allow administration officials to testify or hand over documents.\n\n\"Your highly partisan and unconstitutional effort threatens grave and lasting damage to our democratic institutions, to our system of free elections, and to the American people,\" White House counsel Pat Cipollone wrote in a letter to House Speaker Nancy Pelosi and other top Democrats.", "description": "The whistleblower had a \"prior working relationship with a current 2020 Democratic presidential contender,\" a source familiar with the matter says", "authors": ["Arden Farhi", "Kathryn Watson"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/10/09/fe8efc78-d57a-4e28-b0e1-ec4ca4c6c579/thumbnail/1200x630/5d4399dddcfb8ba3f97f0e0e31d5c9aa/gettyimages-1171360421.jpg", "published_at": "2019-10-09"}