{"pub": "wsj", "url": "https://wsj.com/articles/bedding-brand-brooklinen-pulls-other-marketers-into-new-online-store-11571824801?mod=rsswn", "downloaded_at": "2019-10-23 14:57:58.022419+00:00", "title": "Bedding Brand Brooklinen Pulls Other Marketers Into New Online Store", "language": "en", "text": "In the five years since bedding brand Brooklinen Inc. was launched, the company said it has made more than $200 million in revenue by selling its bedding and associated luxury products online.\n\nNow Brooklinen wants to extend its merchandise line to offer products from other “like-minded” home-goods brands.\n\nThe Brooklyn, N.Y.-based startup is introducing “Spaces by Brooklinen,” a digital store featuring three themed rooms stocked with Brooklinen wares plus more than 100 products from 12 outside brands, including furniture maker Floyd Inc., art book publisher Taschen GmbH and boutique watch and clock retailer Newgate World.\n\nPart of the idea behind Spaces by Brooklinen is that offering complimentary products could get consumers to place more items in their shopping baskets, both from Brooklinen and other vendors.\n\nBrooklinen will get a cut of the revenue from the outside products it helps sell.\n\nSuggesting products that match Brooklinen’s aesthetic will also help shoppers complete the entire look of a room, said Rich Fulop, chief executive officer of Brooklinen. “We think of this as a home fashion brand focusing on comfort—not just a bedding brand,” Mr. Fulop said.\n\nBut rather than expanding into areas such as furniture on its own, Brooklinen is drawing other marketers into its sphere.\n\nFloyd, a Detroit-based company that sells sustainable furniture including bed frames and bookshelves, reaches similar types of consumers as Brooklinen, said Kyle Hoff, the company’s chief executive officer. Its customers are more conscious about the environmental impact of products they purchase, he said.\n\n“There’s hopefully an introduction to Floyd through Brooklinen, and vice versa,” Mr. Hoff said.\n\nSpaces will start with model bedrooms, such as “Relaxed Industrial,” “Earthy Minimalist” and “Modern Glam.” Brooklinen hopes to expand into dozens of room types, such as nurseries, bathrooms and living rooms, according to Mr. Fulop.\n\nBrooklinen is profitable, with revenue on track to approach $100 million this year, up from $60 million in 2018, Mr. Fulop said.\n\nSpaces could one day represent half of Brooklinen’s business, said Mr. Fulop. Today it makes almost all of its money from selling its own branded products to customers, but generates some revenue by selling detergents from Laundress Inc. and blankets from Pendleton Woolen Mills Inc.\n\n“Once we have a marketplace that can expand into different rooms and different brands, it adds a whole new layer of value to the company,” Mr. Fulop said.\n\nBest known for its sheet sets, Brooklinen has expanded into other luxury bedding and home products, including towels, candles and lounge wear. Today, Brooklinen offers 89 items for sale, primarily on its website but also through Amazon.com Inc. and the wedding registry website Zola Inc.\n\nThe company this year opened a pop-up retail store in Manhattan’s SoHo neighborhood, ahead of an initiative to establish 30 physical stores in the next three years.\n\nCustomers have demonstrated a willingness to buy new products through Brooklinen, Mr. Fulop said, adding that when the company has introduced new items, 60% of purchases made within the first two months were from existing customers.\n\nWrite to Sahil Patel at Sahil.Patel@wsj.com", "description": "The Brooklyn, N.Y.-based startup is introducing “Spaces by Brooklinen,” a digital store featuring three themed rooms stocked with Brooklinen wares plus more than 100 products from 12 outside brands.", "authors": ["Sahil Patel", "Sahil.Patel Wsj.Com"], "top_image": "https://images.wsj.net/im-119589/social", "published_at": "2019-10-23"}