{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/2019/10/15/fact-checking-fourth-democratic-debate", "downloaded_at": "2019-10-16 03:56:16.625104+00:00", "title": "Fact check of the 4th Democratic debate", "language": "en", "text": "— Former HUD secretary Julián Castro\n\nThis is not correct, according to the latest monthly data from the Bureau of Labor Statistics. The unemployment rate went up modestly in Ohio, from 4.0 to 4 1 percent from July to August, but remained steady in Pennsylvania at 3.9 percent and declined from 4.3 percent to 4.2 percent in Michigan. The number of jobs – the size of labor forces – increased in all three states.\n\nAD\n\nAD\n\nThe Castro campaign pointed to a March to July slippage in nonfarm employment to justify his answer, but that’s cherry-picked. The BLS data shows that year over year, nonfarm employment increased every month. Small changes in the number of jobs month by month is not nearly as significant as the year to year numbers.\n\n“You have half a million people sleeping out on the street today.”\n\n–Sen. Bernie Sanders (I-Vt.)\n\nThe way Sanders frames this is exaggerated. Sanders’s number come from a single-night survey done by the Department of Housing and Urban Development to measure the number of homeless people. For a single night in January in 2018, the estimate was 553,000 people are homeless.\n\nAD\n\nBut the report also says that two-thirds –nearly 360,000 — were in emergency shelters or transitional housing programs; the other 195,000 were “unsheltered” –i.e., on the street, as Sanders put it. The number has also been trending down over the past decade; it was 650,000 in 2007.\n\nAD\n\n“We saw the horrifying sight of a woman with the lifeless body of her child in her arms asking, ‘What the hell happened to American leadership?’”\n\n— South Bend, Ind., Mayor Pete Buttigieg\n\nButtigieg appears to referring to a video first published on Oct. 12 by the broadcast news outlet Kurdistan 24. The video depicts a woman sitting with a child in her lap. In the first frames, she is feeding the child with a bottle. Then, according to Kurdistan 24’s translation, she says, “Where can I take this daughter to? I tried to take her to a hospital, but there was none.”\n\nAD\n\nWhile the imagery is unquestionably upsetting and despite some news reports to the contrary, the child in question appears to be ill, not “lifeless.”\n\n“I get a little bit tired — I must say — of people defending a system, which is dysfunctional, which is cruel … 500,000 people going bankrupt for what reason, they came down with cancer?”\n\nAD\n\n— Sanders\n\nSanders claims 500,000 people go bankrupt every year from medical debt. That’s approximately two-thirds of the 750,000 total bankruptcies per year.\n\nSanders’s claim is based on a study published by the American Journal of Public Health in March. The researchers surveyed debtors and asked about factors that contributed to their bankruptcies. Forty-four percent said either medical bills or loss of work related to illness “very much” contributed; 22 percent said either medical bills or illness “somewhat” contributed. Combining both groups of respondents, the study estimated 530,000 bankruptcies a year.\n\nAD\n\nThe study doesn’t establish that all 530,000 bankruptcies were caused by medical bills, as Sanders describes it. It is broader than that, since it measures contributions — not causes — factors in both illness and medical bills, and respondents who said either “somewhat” and “very much.”\n\nAD\n\nA different study published in the New England Journal of Medicine looked at the same question of medical bankruptcies and found that the rate was far lower: 30,000 to 50,000 a year. However, this study was limited to non-elderly people in California who were admitted to the hospital for non-birth-related reasons, so it covers only a subset of all people facing medical debt.\n\nThe research team Sanders cited once included Sen. Elizabeth Warren (D-Mass.), who contributed to earlier versions of their study when she was a Harvard professor. Interestingly, though, Warren doesn’t appear to make the same claim about 500,000 medical bankruptcies a year.\n\nAD\n\nWe recently gave Three Pinocchios to Sanders for this claim, and his campaign sharply criticized our fact check.\n\n“And a wealth tax makes a lot of sense in principle. The problem is that it’s been tried in Germany, France, Sweden and all of those countries ended up repealing it because it had massive implementation problems and did not generate the revenue they projected.”\n\nAD\n\n—Business executive Andrew Yang\n\nYang is right about this. According to a Organization for Economic Co-operation and Development report, “while 12 countries had net wealth taxes in 1990, there were only four OECD countries that still levied recurrent taxes on individuals’ net wealth in 2017.” (And in 2018, France also replaced its net wealth tax with one focused on real estate wealth.)\n\nAD\n\n“Decisions to repeal net wealth taxes have often been justified by efficiency and administrative concerns and by the observation that net wealth taxes have frequently failed to meet their redistributive goals,” the report added. “The revenues collected from net wealth taxes have also, with a few exceptions, been very low.”\n\nBesides France, Germany and Sweden are among the countries that abandoned the wealth tax, as Yang said.\n\nAD\n\n“People haven’t had a raise — 90 percent of Americans have not had a raise for 40 years.”\n\n— Business executive Tom Steyer\n\nThis is not the case, not even when considering inflation. A study by the nonpartisan Congressional Budget Office analyzed a nearly 40-year period from 1979 to 2015, adjusting for inflation and changes in federal (but not state or local) taxes. The CBO found that wages grew for all income groups, from top to bottom, during the period. The rate of increase, however, was most dramatic for the top 1 percent, while everyone else saw relatively modest increases.\n\nAD\n\nAccording to PolitiFact, other studies show that the top earners have absorbed a growing share of all new income in the last 40 years. But the claim that wages have not increased in 40 years is unsupported by the data.\n\n“There was a point where there were more opiate prescriptions in the state of Ohio than human beings in the state of Ohio.”\n\nAD\n\n— Yang\n\nThis is accurate. Ohio had a peak of 102.4 opioid prescriptions per 100 persons in 2010, according to the National Institute on Drug Abuse. Ohio’s rate has since declined. In 2017, it was 63.5 opioid prescriptions per 100 persons, but that was still higher than the U.S. average of 58.7.\n\n“If you eliminated the entire Pentagon, every single thing — planes, ship, troop, the buildings, everything, satellites — it would pay for a total of four months [of Medicare-for-all].”\n\nAD\n\n— Former vice president Joe Biden\n\nHow to cover the cost of Medicare-for-all has dominated the Democratic debates. At an estimated $30 trillion cost over 10 years, the plan, as outlined in a bill by Sen. Bernie Sanders (I-Vt.) that is supported by Sen. Elizabeth Warren (D-Mass.), comes with a hefty price tag.\n\nTo illustrate the cost, Biden said that eliminating the U.S. defense budget would pay for four months of Medicare-for-all. The Biden camp said he took the Defense Department budget request for 2020, $718 billion, to come up with that estimate. Assuming $3 trillion in Medicare-for-all costs per year, that means he's roughly on target.\n\nAD\n\nHowever, the nonpartisan Congressional Budget Office has a 10-year estimate for total defense spending: $7 trillion from 2019 to 2028. That’s about one-fifth of the cost of Medicare-for-all over 10 years. It suggests that — all else being equal — defunding the military would cover two years, not four months, of the cost of Medicare-for-all.\n\nWith such a sweeping and intricate plan, though, it’s difficult to devise a solid estimate, and it’s unlikely that defunding the military completely would ever come to pass.\n\nSend us facts to check by filling out this form\n\nSign up for The Fact Checker weekly newsletter", "description": "Here's a roundup of eight claims from the fourth Democratic presidential debate of the 2020 campaign.", "authors": ["Glenn Kessler", "The Fact Checker", "Salvador Rizzo", "Reporter For The Fact Checker", "Meg Kelly", "Video Editor For The Fact Checker"], "top_image": "https://www.washingtonpost.com/resizer/Zq3xs0jTD3TT73q1CXS-ij8J0tM=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YH7WZUXPYQI6TO362IBG5YGBTE.jpg", "published_at": "2019-10-15"}