{"pub": "yahoo", "url": "https://investors.com/etfs-and-funds/retirement/retirement-planning-protects-1-million-savings-20-years/?src=A00220&yptr=yahoo", "downloaded_at": "2019-10-28 13:31:53.950241+00:00", "title": "Retirement Planning That Protects Your $1 Million Savings For 20 Years", "language": "en", "text": "Congratulations! Your retirement planning paid off. You built a $1 million retirement nest egg. But how long will $1 million last in retirement?\n\nX\n\nThe goal for most retirees is simple: Don't run out of money. A whopping 61% of Americans admit they are more afraid of outliving their money than they are of dying, according to an Allianz Life survey.\n\nSo if you've worked hard at retirement planning and saving, how do you keep your $1 million from expiring before you do? How fast you spend down your savings and how effectively you invest are key factors in determining how long your $1 million will last in retirement.\n\nRetirement Planning To Make Your $1 Million Last\n\nLet's say you're 65 years old and earn $115,000 a year. That's a decent annual income, but it's no king's ransom. It's enough to let you sock away good chunks of money each year. But it's not so high that it trips over income limits when it comes to saving in a retirement plan such as a 401(k).\n\nThe simple arithmetic answer to the how-long-will-it-last retirement planning question is that your savings would last less than nine years. That's how many years in a row you can subtract $115,000 from $1 million.\n\nAnd less than nine years is not very long if you're healthy and have a normal life expectancy.\n\nThe average American's life expectancy is now 78.6 years, as of 2017, according to the U.S. Centers for Disease Control (CDC). But for a 65 year old, it's closer to 20 additional years, according to CDC data. So, if you retire at age 65 and you're typical, you can expect to live to nearly 85. Nine years of money does not cut it.\n\nPut Your Retirement Nest Egg To Work\n\nBut your $1 million nest egg can last longer. Here's how.\n\nFirst, the simple arithmetic calculation of dividing $1 million by $115,000 assumes that your nest egg would not grow over time.\n\nIn fact, it certainly would grow, given enough time. The stock market has rebounded from setbacks over time.\n\nSo how have real investors fared in recent years?\n\nActual Returns By Vanguard Investors\n\nTake workers with 401(k) accounts and similar retirement savings plans run by Vanguard. Plan members whose portfolios were invested 70% in stocks and 30% in bonds had average annual returns in the five years ended Dec. 31, 2018 of 5.6%. The S&P 500 grew at an 8.5% annual pace.\n\nThat's a reasonably representative period of time. It had down markets as well as up markets.\n\nSo in beefing up your retirement planning, let's use a 5.6% average annual rate of return for forecasting how your portfolio would behave going forward.\n\nHow far forward? Let's say 20 years. That's about the latest life expectancy once the average American reaches age 65, forecast by the CDC.\n\nRetirement Planning That Grows Your Nest Egg Balance\n\nWhen we do that, after 20 years, your $1 million nest egg would balloon to $2.97 million, growing at a relatively ho-hum 5.6% average annual return.\n\nBut that's without subtracting any money for your living expenses each year. Let's plug that essential fact of life into our retirement planning here.\n\nStart by figuring out how much money you've got to withdraw.\n\nThe good news is you would not have to withdraw $115,000 each year. Part of your income would come from Social Security. The size of benefits could change in the future. Federal budget deficits and the weakening condition of Social Security's finances pose a risk to that income system.\n\nBut for now, with $115,000 income this year at age 65, you could expect to receive $27,815 in Social Security benefits starting this year, according to the Bankrate.com calculator.\n\nYour Responsibility In Addition To Social Security\n\nThat means you've got to come up with $87,185 from savings, pay from any work you do and other sources if you want to keep your same income in retirement. For simplicity and because you may not want to work while retired, let's say it all must come from your savings.\n\nAnd what about inflation? Cost-of-living increases are built into Social Security — at least for now.\n\nAnd the U.S. inflation rate is 1.7%. So let's say your savings withdrawals — which start at $87,185 — rise by that much a year.\n\nWhere does all of this leave you?\n\nMake Savings Last 15 Years?\n\nIf your retirement portfolio grows at 5.6% a year the way those Vanguard customers' accounts did, your savings will run down to zero after 15 years. That's not good retirement planning. Your savings would run out too soon if your life expectancy is 20 years from age 65.\n\nYour annual rate of return must be at least 8.75% for your savings to last 20 years.\n\nYou can get closer to that goal by investing more aggressively than is recommended for a retiree. Instead of a 70-30 stocks-bonds mix, you could boost your stock allocation to, say, 100%. Vanguard investors investing 100% in the S&P 500 earned just shy of the bogey's 8.5% average annual return.\n\nAn alternative retirement planning strategy would be to trim the amount of cash you withdraw from your retirement nest egg.\n\nYou could trim withdrawals because you cut spending in retirement. Or because you do expect to earn money from some job, part- or full-time.\n\nMake Your Portfolio Last More Than 20 Years\n\nIf you only aim to replace 90% of the non-Social Security portion of your preretirement annual income from savings, your portfolio will last more than 22 years if your rate of return averages 8%.\n\nThat's better retirement planning. And you can improve on that too.\n\nIf you replace only 85% of the non-Social Security part of your preretirement budget through withdrawals, your portfolio will last 21 years at a 7% rate of return. At a 9% return, it will last 33 years.\n\nRetirement Plan That Preserves Your Portfolio More Than 30 Years\n\nAnd if you replace only 80%, a 7% rate of return will allow your portfolio to avoid depletion for more than 24 years. An 8% return will keep your portfolio humming for 30 years.\n\nIn all of these strategy scenarios, if you invest in stocks, mutual funds and ETFs that generate dividend yield, you won't have to liquidate as much in shares to fund cash withdrawals. That also will enable your portfolio to last longer.\n\nThe answer to the question of how long will $1 million last in retirement? With smart retirement planning, you can position your portfolio to outlast you.\n\nFollow Paul Katzeff on Twitter at @IBD_PKatzeff for tips about personal finance and active mutual fund managers who outperform the market by picking top-performing growth stocks.\n\nYOU MIGHT ALSO LIKE:\n\nYou Need This Much Retirement Savings At Your Age And Income\n\nGet Free IBD Newsletters: Market Prep | Tech Report | How To Invest\n\nThe Upside Of A Sideways Stock Market: Futures\n\nWhich Stocks Are Breaking Out Or Near A Pivot Point? Check MarketSmith\n\nGet Notifications For Live IBD Videos By Subscribing On YouTube", "description": "You've built a $1 million retirement nest egg, so your retirement planning has paid off. But how long will $1 million last in retirement?", "authors": ["Investor'S Business Daily", "Paul Katzeff"], "top_image": "https://www.investors.com/wp-content/uploads/2019/10/Million-RET-102519-shutter.jpg", "published_at": "2019-10-28"}