{"pub": "cnn", "url": "https://cnn.com/2019/10/05/media/tucker-carlson-op-ed-ukraine-trump-impeachment/index.html", "downloaded_at": "2019-10-05 22:54:40.186374+00:00", "title": "Tucker Carlson says Trump's Ukraine call was inappropriate: 'There's no way to spin this'", "language": "en", "text": "New York (CNN Business) A version of this article first appeared in the \"Reliable Sources\" newsletter. You can sign up for free right here.\n\nTrump may be cracking, Fox News host Tucker Carlson In a sign that the right-wing media's relentless defense of President DonaldTrump may be cracking, Fox News host Tucker Carlson published an op-ed with Daily Caller co-founder and publisher Neil Patel zinging Trump for his call with Ukraine's president. \"Donald Trump should not have been on the phone with a foreign head of state encouraging another country to investigate his political opponent, Joe Biden,\" Carlson and Patel wrote. \"Some Republicans are trying, but there's no way to spin this as a good idea.\"\n\nCarlson and Patel added, \"Like a lot of things Trump does, it was pretty over-the-top. Our leaders' official actions should not be about politics. Those two things need to remain separate. Once those in control of our government use it to advance their political goals, we become just another of the world's many corrupt countries. America is better than that.\"\n\nNow, the two Daily Caller founders did use the same op-ed to applaud investigations into the Obama administration. And they did write that \"it's hard to argue\" that Trump's conduct rises \"to the level of an impeachable offense.\"\n\nBut I still found it astonishing to see Carlson and Patel concede that Trump's conduct on the call with Ukraine's president was wrong, and that there's no way to explain it away. That line of thinking goes against the talking points from Trump (who says it was a \"perfect\" phone call) and what the vast majority of his media allies have been saying. It's also further than most Senate Republicans have gone when asked about Trump's conduct.\n\nRead More", "description": "Fox News host Tucker Carlson published an op-ed zinging Trump for his call with Ukraine's president. \"Some Republicans are trying, but there's no way to spin this as a good idea.\"", "authors": ["Analysis Oliver Darcy", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190807174848-02-tucker-carlson-0807-super-tease.jpg", "published_at": "2019-10-05"}