{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/the-masked-singer-yeets-ninja-back-to-mixer", "downloaded_at": "2019-09-26 07:52:16.502468+00:00", "title": "The Masked Singer Yeets Ninja Back To Mixer", "language": "en", "text": "The Masked Singer is a pretty dumb show but it's admittedly fun to watch. It features a bunch of celebrities who dress up in disguise and perform songs to a panel of judges to determine who's the worst. Twitch-gone-Mixer star Ninja now apparently falls into this category of celebrity in the United States, confirming we're living in the Era of Peak Pop Culture.\n\nDancing in an ice cream bobble head while doing an attempt at the viral hit \"Old Town Road\" on the US' version of The Masked Singer was a 'mystery' celebrity. All four judges, Robin Thicke, Nicole Scherzinger, Ken Jeong and Jenny McCarthy, seemed to be enjoying it Very Much.\n\nhere is @Ninja singing Old Town Road on national television in an ice cream outfit with backup dancers and a full set on #TheMaskedSinger we are reaching peak video games and streamer culture pic.twitter.com/QvXAxivnRK — Rod Breslau (@Slasher) September 26, 2019\n\nThe reveal showed, of course, it was \"Professional Gamer, YouTuber and Fortnite Legend\" Ninja. He had been the first booted out of the competition.\n\nTWITCH SUPERSTAR NINJA pic.twitter.com/73cyyspvlI — Rod Breslau (@Slasher) September 26, 2019\n\nWhile the video made me cringe at every swivel and head-bop, it's still pretty cool a professional gamer featured on a show meant for celebrities. Ninja, whether you love or hate him, transcends the internet world and can be featured on a boomer platform; prime-time television. That's pretty neat.\n\nBut saying all that, we've reached the ceiling of pop culture and I'm still not sure I like it here.", "description": "The Masked Singer is a pretty dumb show but it's admittedly fun to watch. It features a bunch of celebrities who dress up in disguise and perform songs to a panel of judges to determine who's the worst. Twitch-gone-Mixer star Ninja now apparently falls into this category of celebrity in the United States, confirming...", "authors": ["Jason Schreier", "Luke Plunkett"], "top_image": "https://edge.alluremedia.com.au/m/k/2019/09/ninjamaskedsinger.jpg", "published_at": "2019-09-26"}