{"pub": "reuters", "url": "https://in.reuters.com/article/uk-soccer-champions-tot-bay-preview-kova/tottenham-are-proof-that-patience-is-rewarded-says-bayerns-kovac-idINKBN1WF1Z1", "downloaded_at": "2019-10-01 00:20:17.269932+00:00", "title": "Tottenham are proof that patience is rewarded, says Bayern's Kovac", "language": "en", "text": "(Reuters) - Tottenham Hotspur’s philosophy under manager Mauricio Pochettino should be held up as a beacon for clubs competing in Europe and is proof that patience is ultimately rewarded, Bayern Munich manager Niko Kovac said on Monday.\n\nSoccer Football - Champions League - Bayern Munich Press Conference - Tottenham Hotspur Stadium, London, Britain - September 30, 2019 Bayern Munich coach Niko Kovac during the press conference Action Images via Reuters/Paul Childs\n\nDespite a limited transfer budget, Spurs have qualified for the Champions League for four consecutive seasons under Pochettino and they exceeded expectations by reaching their maiden final last year, finishing runners-up to Liverpool.\n\n“Tottenham is a very positive light in European football,” Kovac told reporters ahead of Bayern’s visit to Spurs on Tuesday. “They are now able to compete with the big teams, even though it didn’t look like that six or seven years ago.\n\n“He (Pochettino) has done a great job and this is an example for others that patience is important. All the players are world class from different international teams and we know what to face tomorrow.\n\n“The football Tottenham play is very beautiful to watch and it’s innovative and creative. We have to make sure we have the mental and physical resilience to respond to their new challengers.”\n\nSpurs’ biggest threat is Harry Kane, who has scored 160 goals in all competitions in the past five seasons, and Kovac said he saw similarities in his own striker Robert Lewandowski, who has finished as Bundesliga’s top scorer four times.\n\n“His (Kane) quality in the Premier League and England squad speaks for itself. He’s sensational and he can do it all,” Kovac said. “He’s good at holding up and good with his head. There’s nothing he can’t do, he’s a very strong striker.\n\n“Him and Lewandowski are probably the top two, three or four in the world. I will see how things pan out tomorrow. Both don’t miss a lot of chances and are both very hungry.\n\n“We know that Harry Kane is very dangerous and we’ll have to do our best to not let him score.”\n\nKovac confirmed defender Lucas Hernandez, who was injured in their last Bundesliga match at Paderborn, was not involved in training while full back David Alaba and winger Ivan Perisic would be fit to play on Tuesday.", "description": "Tottenham Hotspur's philosophy under manager Mauricio Pochettino should be held up as a beacon for clubs competing in Europe and is proof that patience is ultimately rewarded, Bayern Munich manager Niko Kovac said on Monday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190930&t=2&i=1435663240&w=1200&r=LYNXMPEF8T187", "published_at": "2019-09-30"}