{"pub": "news24", "url": "https://sport24.co.za/Cricket/england-coach-silverwood-targets-ashes-success-under-root-20191010", "downloaded_at": "2019-10-10 18:27:32.011514+00:00", "title": "England coach Silverwood targets Ashes success under Root", "language": "en", "text": "London - New England coach Chris Silverwood says his priority is to help Test captain Joe Root as they target a successful Ashes campaign in Australia in two years' time.\n\nThe 44-year-old was this week promoted from fast bowling coach to replace World Cup-winning head coach Trevor Bayliss, who stepped down last month at the end of his contract.\n\nSilverwood will take charge of the tour of New Zealand, which includes a five-match Twenty20 series, starting on November 1, and two Tests.\n\n\"I think (there's a good) relationship between myself and the two captains (Root and Eoin Morgan), and I've got a strong relationship with all the players and backroom staff,\" Silverwood said at his unveiling press conference on Thursday.\n\n\"I understand how the system works, how the team works. That continuity is key.\"\n\nSilverwood said improving the fortunes of the Test team under Root's captaincy would be his top priority.\n\nEngland won the 50-over World Cup in July for the first time but failed to wrest back the Ashes from Australia, who retained the urn after a 2-2 draw.\n\nTheir next Test tour of Australia is in 2021-22.\n\n\"Job number one is helping Joe -- we've got a lot of support around Joe, but to keep moving forward so that in two years' time we can go to Australia and make a real impact,\" he said.\n\nEngland's aim is to become the most successful team in international cricket across all formats.\n\nSilverwood said the Test team would have to learn to bat for long periods, build on their bowling success and become more consistent away from home.\n\nAshley Giles, managing director of England men's cricket, explained why he labelled Silverwood \"the standout candidate\".\n\n\"His character, his values, he's a winner,\" said Giles. \"You can only prove that in the environment you're in and he's proven that in the domestic game.\"\n\nSilverwood, who played six Tests and seven one-day internationals for England between 1996 and 2002, coached Essex to the County Championship title in 2017 before joining the England set-up.\n\n\"The job he did at Essex was fantastic and we're still seeing that legacy now. I think the sign of a good coach is leaving the club better than you found it and that seems to be in evidence,\" Giles said.\n\n\"The relationship, the knowledge of what we're doing -- we've got an exceptional bloke who cares deeply about what we're doing.\"", "description": "New England coach Chris Silverwood says his priority is to help Test captain Joe Root as they target a successful Ashes campaign in Australia in two years' time.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9462/b6d6210d41eb4e08b405b4a484722374.jpg", "published_at": "2019-10-10"}