{"pub": "cbc", "url": "https://cbc.ca/arts/exhibitionists/to-make-art-gillian-king-uses-what-s-around-her-from-her-dye-garden-to-her-own-dog-s-ashes-1.5329473", "downloaded_at": "2019-10-22 20:50:45.038389+00:00", "title": "CBC Arts", "language": "en", "text": "\"When I was in grad school, I was playing around a lot with different materials,\" artist Gillian King explains. \"And at one point I was doing a series of paintings with my dog's ashes.\" Lest this seem morbid, it's all part of King's fascination with materials and their meaning. She goes on: \"I was really interested in the symbolism behind materials, and after grad school, I wanted to start to play with the canvas itself and play with dyes on the canvas.\"\n\nKing's focus on using the materials that are part of her daily life has extended to growing a garden devoted to creating dyes that stain her canvases. And in doing so, she maintains a physical relationship with the canvas that she hopes viewers feel too.\n\nWatch the video:\n\nGillian King explains how - and why - she uses (and grows) art materials very close to home. Filmmaker: Nicholas Castel 11:02\n\nThese are artworks that demand your close inspection. As King says, \"When you get closer to the painting — and I feel like I make paintings so people get close to them — you can start to notice interesting things happening with the surface of the canvas and with the materials. I have great conversations with gardeners. People who are used to working outside and working in soil and working with plants have a very particular reaction to the work that is almost as if they could have had a hand in making it, which I really love.\"\n\nIn this video by filmmaker Nicholas Castel, King takes you through her process — from visiting the dye garden to staining and then binding one of her huge canvases. It may make you look at the things around you very differently.\n\nSee the work of Gillian King as part of \"Terramatter\" at Ottawa City Hall Art Gallery, October 10-December 3. And you can follow her here.\n\n(CBC Arts)\n\n(Gillian King)\n\n(CBC Arts)\n\nThis video is part of a recent episode of Absolutely Canadian, where you get to meet four artists working with nature in and around Ottawa.\n\nStream CBC Arts: Exhibitionists or catch it on CBC Television Friday nights at 11:30pm (12am NT) and Sundays at 3:30pm (4pm NT). Watch more videos here.", "description": "The plants she grows in her \"dye garden\" become the paints that stain her canvas. She opens up about her art's close relationship with the natural world.", "authors": ["Lise Hosein Is A Producer At Cbc Arts. Before That", "She Was An Arts Reporter At Jazzfm", "An Interview Producer At George Stroumboulopoulos Tonight", "A Phd Candidate At The University Of Toronto. When She'S Not At Her Cbc Arts Desk She'S Sometimes An Instructor At Ocadu", "Is Always Quite Terrified Of Bees."], "top_image": "https://i.cbc.ca/1.5330532.1571759975!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/gillian-king.jpg", "published_at": "2019-10-22"}