{"pub": "zdnet", "url": "https://www.zdnet.com/article/richard-stallman-to-microsoft-publicly-retract-open-source-is-a-cancer-claim", "downloaded_at": "2019-10-01 00:11:16.453835+00:00", "title": "Richard Stallman to Microsoft: Publicly retract 'open source is a cancer' claim", "language": "en", "text": "Microsoft's open-source move puts Powershell on favorite programming languages list Microsoft's PowerShell open-sourced scripting language is striking a chord with more developers.\n\nMicrosoft might love Linux these days because it makes business sense. But free-software pioneer Richard Stallman thinks Microsoft still needs to make amends for the nasty things its top execs have said about open source in the past and to publicly apologize for them.\n\nFormer Microsoft CEO Steve Ballmer once described Linux and the General Public License as a \"cancer\". One-time Windows boss Jim Allchin also called open source a killer of intellectual property and un-American.\n\nStallman, a long-time critic of Microsoft and founder of the GNU project, to the surprise of some delivered a speech at Microsoft Research earlier this month. The free-software movement argues against proprietary constraints, as opposed to zero-cost software.\n\nSEE: 20 quick tips to make Linux networking easier (free PDF)\n\nAccording to attendees, Stallman told the company that Microsoft-owned code-sharing site GitHub should push users towards \"better software license hygiene\", tell hardware makers – which includes Microsoft these days – to publish their specs, and make it easier to bypass Secure Boot.\n\nA few weeks later he resigned from his role at MIT and as president of the Free Software Foundation (FSF) after an email he wrote surfaced suggesting that a victim of billionaire convicted sex offender Jeffrey Epstein was \"willing\".\n\nStallman last week published a blog explaining what he told Microsoft employees after news of his talk \"led to a certain amount of speculation and rumor\".\n\nAmong the list of 10 recommendations he has provided, Stallman notes that he told Microsoft employees to \"publicly take back Microsoft's attacks on copyleft made in the 2000s\".\n\nMicrosoft under CEO Satya Nadella has never acknowledged Ballmer's attacks on open source. However, after resigning from Microsoft, Ballmer said he now loves Linux – to the extent that it now makes money for Microsoft Azure, whereas it once threatened Windows, Office, and other Microsoft product revenues.\n\nHowever, Stallman primarily wants to counter suggestions he's somehow softened his stance on Microsoft and non-free software.\n\n\"There are those who think that Microsoft invited me to speak in the hope of seducing me away from the free software cause. Some fear that it might even have succeeded,\" wrote Stallman.\n\n\"I am sure the Microsoft staff I addressed saw that that could never happen. I resisted Steve Jobs's snow job in 1989 or 1990; I am no easy mark for those who want me to change my views.\"\n\nHe also highlights the distinction between open-source software and the free software movement, which are often mistakenly seen as interchangeable.\n\nSEE: 30 things you should never do in Microsoft Office (free PDF)\n\nAnother notable suggestion was that Microsoft should publish the hardware interface of its HoloLens headgear, so people can use it without non-free software.\n\n\"Even if our software is years behind, that will be better than not being able to use these devices at all,\" he added.\n\nAnd one that seems unimaginable: release the source code of Windows under the GNU GPL. However, according to Stallman, that recommendation isn't as fantastical as it seems.\n\n\"I know that is a stretch, but from what I heard there, it isn't totally impossible,\" he wrote.\n\nHere are Stallman's 10 suggestions to Microsoft:", "description": "If you love open source so much, say sorry for the horrible things you said, software pioneer Stallman suggests.", "authors": ["Liam Tung"], "top_image": "https://zdnet3.cbsistatic.com/hub/i/r/2019/09/30/c587bada-6f2a-4682-9b29-fee20c39605b/thumbnail/770x578/719bbcad97423fe9c25ab42e5cd29a3e/richardstallman2019.jpg", "published_at": "2019-09-30"}