{"pub": "businessinsider", "title": "Alaska was hit by a 5.0-magnitude earthquake that impacted two capital cities and left locals' beds and showers shaking", "url": "https://businessinsider.com/alaska-northern-canada-earthquake-yukon-juneau-2019-9", "language": "", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:35:54.152130+00:00", "text": "A 5.0-magnitude earthquake impacted southeast Alaska and northern Canada on Saturday night, marking the second time in just two days the region was affected by one.\n\nThe Alaska Earthquake Center, the state's earthquake monitoring agency that's based at the University of Alaska Fairbanks, tweeted the earthquake originated in Glacial Bay National Park at 8:32 pm local time. The agency said it had received reports that those in Juneau, the state capital, and Whitehorse, the capital of Canada's Yukon territory, felt it.\n\nThe National Tsunamai Warning Center, which is located in Alaska, tweeted out that a tsunami was not expected. According to the Anchorage Daily News, no damage or injuries were immediately reported.\n\nAccording to UPSeis, an education site on seismology created by Michigan Technological University, a 5- to 5.9-magnitude earthquake is considered moderate. Earthquakes of 2.5- to 5.4-magnitude are \"often felt, but only cause minor damage\" with an estimated 30,000 a year occurring.\n\nIt was the second earthquake to hit the region in the last two days. A 3.8-magnitude earthquake had originated from a nearby location, the Alaska Earthquake Center tweeted.\n\nA spokesperson for the agency said its recorded 14 small aftershocks from the earthquake, which is \"typical.\" While the area is very seismically active, the spokesperson added, it is noteworthy considering how many people felt the earthquake.\n\nLocals in Alaska and Canada took to social media either looking for confirmation that they did indeed feel an earthquake, or reporting how they were impacted.", "description": "The 5.0-magnitude earthquake, which originated in Glacial Bay National Park, was the second earthquake in the region over the last two days.", "authors": ["Dan Defrancesco"], "top_image": "https://amp.businessinsider.com/images/5d6bb6b22e22af69512b8d13-1920-960.jpg"}