{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/2019/09/13/transcript-third-democratic-debate", "downloaded_at": "2019-09-13 01:05:07.954533+00:00", "title": "Transcript: The third Democratic debate", "language": "en", "text": "All the top-tier Democratic presidential candidates will gather on one stage Thursday night in Houston for third Democratic presidential debate. Below is a transcript of the debate; we’ll update it throughout the night.\n\nFORMER HUD SECRETARY JULIÁN CASTRO: Good evening, y bienvenidos a Texas. Welcome to Texas.\n\n(APPLAUSE)\n\nIt's great to be here at TSU, home of the Tigers. You know, on January 20, 2021, at 12:01 p.m., we're going to have a Democratic president, a Democratic House, and a Democratic Senate.\n\n(APPLAUSE)\n\nThere will be life after Donald Trump. But the truth is that our problems didn't start just with Donald Trump, and we won't solve them by embracing old ideas. We need a bold vision: universal pre-K and universal health care, unleashing millions of new jobs in the clean energy economy, a tax system that rewards people who have to work for a living.\n\nBut first, we have to win. And that means exciting a young, diverse coalition of Americans who are ready for a bold future. That's what Kennedy did, it's what Carter did, it's what Clinton did, it's what Barack Obama did, and it's what I can do in this race. Get back Michigan, Wisconsin, and Pennsylvania, Florida, Georgia, and Arizona, and finally turn Texas blue and say goodbye to Donald Trump.\n\n(APPLAUSE)\n\nABC ANCHOR GEORGE STEPHANOPOULOS: Senator Klobuchar?\n\nSEN. AMY KLOBUCHAR: Good evening, Texas Southern. I believe that what unites us up here, the 10 of us, is much stronger than what divides us. And I think that’s true of our country, too.\n\nNow, I may not be the loudest person up here, but I think we've already got that in the White House.\n\n(APPLAUSE)\n\nHouston, we have a problem. This -- we have a guy there that is literally running our country like a game show. He would rather lie than lead. I think we need something different.\n\nI am someone that tells the truth. I don't make promises that I can't keep. I have people's back. And I believe that to win, you bring people with you and that is how you govern, as well.\n\nSo, you're going to hear a lot of ideas up here. Some will be great. But if you see that some of them seem a little off-track, I've got a better way. If you feel stuck in the middle of the extremes in our politics and you are tired of the noise and the nonsense, you've got a home with me, because I don't want to be the president for half of America. I want to be the president for all of America.\n\n(APPLAUSE)\n\nSTEPHANOPOULOS: Congressman Beto O'Rourke?\n\nO’ROURKE: It’s an honor to be on this debate stage. It is wonderful to be back in Texas, in Houston, back here at TSU.\n\nOn August 3, in El Paso, Texas, two things became crystal clear for me, and I think produced a turning point for this country. The first is just how dangerous Donald Trump is, the cost and the consequence of his presidency.\n\nA racism and violence that had long been a part of America was welcomed out into the open and directed to my hometown of El Paso, Texas, where 22 people were killed, dozens more grievously injured by a man carrying a weapon he should never have been able to buy in the first place, inspired to kill by our president.\n\nThe second is how insufficient our politics is to meet the threat that we have right now. The bitterness, the pettiness, the smallness of the moment, the incentives to attack one another and try to make differences without distinctions, mountains out of mole hills, we have to be bigger. We have to see clearly, we have to speak honestly, and we have to act decisively. That's what I want to do for you as president of the United States. Thank you.\n\n(APPLAUSE)\n\nSTEPHANOPOULOS: Senator Cory Booker?\n\nBOOKER: It was over 20 years ago that I was a law student and moved to inner city Newark, New Jersey, to serve as a tenants rights lawyer to try to address the challenges in my community. And I was sobered by them -- the gun violence, the substandard housing.\n\nBut it was my greatest mentor, a woman named Ms. Virginia Jones, who challenged me. She said, boy, if all you see in this neighborhood is problems, that's all there's ever going to be. But if you're stubborn and defiant and can put forth a vision that can unify people, then we can make transformative change. She was a church woman that said, without vision, the people will perish.\n\nWell, that's exactly what we did. We created extraordinary unity in our community, and we did things that other people think -- thought was impossible.\n\nThat’s the story of America. At our best, we unify, we find common cause and common purpose. The differences among us Democrats on the stage are not as great as the urgency for us to unite as a party, not just to beat Donald Trump, but to unite America in common cause and common purpose. That’s why I’m running for president, and that’s how I will lead this nation.\n\n(APPLAUSE)\n\nSTEPHANOPOULOS: Entrepreneur Andrew Yang?\n\nYANG: In America today, everything revolves around the almighty dollar -- our schools, our hospitals, our media, even our government. It’s why we don’t trust our institutions anymore. We have to get our country working for us again, instead of the other way around. We have to see ourselves as the owners and shareholders of this democracy rather than inputs into a giant machine.\n\n(APPLAUSE)\n\nWhen you donate money to a presidential campaign, what happens? The politician spends the money on TV ads and consultants and you hope it works out. It's time to trust ourselves more than our politicians.\n\nThat’s why I’m going to do something unprecedented tonight. My campaign will now give a freedom dividend of $1,000 a month for an entire year to 10 American families, someone watching this at home right now. If you believe that you can solve your own problems better than any politician, go to yang2020.com and tell us how $1,000 a month will help you do just that. This is how we will get our country working for us again, the American people.\n\n(APPLAUSE)\n\nSTEPHANOPOULOS: Mayor Pete Buttigieg?\n\nBUTTIGIEG: It’s original, I’ll give you that.\n\nThe American people are divided and doubtful at the very moment we need to rise to some of the greatest challenges we've ever seen. As a mayor of an industrial city coming back from the brink, as a veteran of the war in Afghanistan, I know what's at stake in our national leadership.\n\nWe keep sending politicians to Washington asking them to fight for us, but then when they get there, they seem more interested in the part about fighting than the part about us. Good politics is supposed to be not about the day-to-day fights of the politicians, but about the day-to-day lives of Americans.\n\nWe just marked the anniversary of 9/11. All day today, I've been thinking about September 12th, the way it felt when for a moment we came together as a country. Imagine if we had been able to sustain that unity. Imagine what would be possible right now with ideas that are bold enough to meet the challenges of our time, but big enough, as well, that they could unify the American people. That's what presidential leadership can do. That's what the presidency is for. And that is why I'm asking for your vote.\n\n(APPLAUSE)\n\nSTEPHANOPOULOS: Senator Kamala Harris?\n\nHARRIS: Thank you. It’s great to be back at TSU.\n\nSo I plan on spending tonight talking with you about my plans to address the problems that keep you up at night. But first, I have a few words for Donald Trump, who we all know is watching.\n\n(LAUGHTER)\n\nSo, President Trump, you've spent the last two-and-a-half years full-time trying to sow hate and division among us, and that is why we've gotten nothing done. You have used hate, intimidation, fear, and over 12,000 lies as a way to distract from your failed policies and your broken promises. The only reason you've not been indicted is because there was a memo in the Department of Justice that says a sitting president cannot be charged with a crime.\n\nBut here's what you don't get: What you don't get you is that the American people are so much better than this. And we know that the vast majority of us have so much more in common than what separates us, regardless of our race, where we live, or the party with which we're registered to vote. And I plan on focusing on our common issues, our common hopes and desires, and in that way, unifying our country, winning this election, and turning the page for America.\n\nAnd now, President Trump, you can go back to watching Fox News.\n\n(APPLAUSE)\n\nSTEPHANOPOULOS: Senator Bernie Sanders? Senator Sanders?\n\nSEN. BERNIE SANDERS: Let me be blunt and tell you what you don’t hear much about in Congress or in the media, and that is, it goes without saying that we must and will defeat Trump, the most dangerous president in the history of this country.\n\n(APPLAUSE)\n\nBut we must do more. We must do more. We have got to recognize that this country is moving into an oligarchic form of society where a handful of billionaires control the economic and political life of this country. And as president, I am prepared to take them on.\n\nYes, we will raise the minimum wage to a living wage. Yes, we will finally make sure that every American has health care as a human right, not a privilege. And, yes, we will address the catastrophic crisis of climate change and transform our energy system away from fossil fuel.\n\n(APPLAUSE)\n\nSTEPHANOPOULOS: Senator Elizabeth Warren?\n\nWARREN: So, I was born and raised in Oklahoma, but I'm sure glad to be in Texas tonight.\n\n(APPLAUSE)\n\nAll three of my brothers served in military bases here in Texas. That was their ticket to the middle class. Me, I got my big opportunity about a half-mile down the road from here at the University of Houston, back when it cost $50 a semester.\n\n(APPLAUSE)\n\nFor a price that I could pay for, on a part-time waitressing job, I got to finish my four-year degree and I became a special needs teacher. And after law school, my first big job was back here in Houston.", "description": "The top 10 Democrats are all sharing one stage in Houston. Here's what they are saying.", "authors": ["The Fix Team", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/cUwi_BRdX-xDFArtS5axvp6CO5E=/1484x0/d1i4t8bqe7zgj6.cloudfront.net/09-12-2019/t_63aad99c3efb49c5bf3dae6c15f15567_name_OnSite_third_debate_thumb_base_v01.png", "published_at": "2019-09-13"}