{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2017/03/30/vicious-garden-wars-british-obsession-can-learn-live-neighbours", "downloaded_at": "2019-10-05 14:45:48.613448+00:00", "title": "Vicious garden wars are a British obsession. But we can learn to live with our neighbours", "language": "en", "text": "Many of us love gardening for the peace: a spot of deadheading and a once-round with the watering can on a summer’s evening offers a particular therapeutic bliss. But for some, flowers means strife and discord. And in the green and pleasant suburb of Wimbledon, south-west London, a neighbourly dispute over a rambling rose has actually ended up in court.\n\nRosa Rahman, a 73-year-old who claims her garden is her “life’s work”, pleaded guilty to threatening a doctor, Mathiaparanam Sreetharan. She accused him of pouring weedkiller on her beloved blooms, which teetered into his patch. He accused her of pinning a death threat on his fence.\n\nHow absolutely wicked. But let’s be frank, hardly unusual. He won’t have been the first to have hacked away at a neighbour’s pride and joy after it strayed onto his own garden path. Overzealous, light-blocking conifers are such a familiar bane of British life that they’ve become plot devices in Jilly Cooper novels. Up and down the country, do we not all tut at those whose lavender bushes need a haircut, whose eucalyptus trees tower too near the wall and, of course, whose lawns cry out for a bloody good mow?\n\nWe are a nation of gardeners, blessed by considerable rainfall and, for the most part, a modest plot attached to our homes in which to potter and prune. Ever since the Victorian housing boom – planned with gardens and green squares in mind – we have used our gardens as an extension of our homes, our castles – to be defended.", "description": "Many of us love gardening for the peace:", "authors": ["Alice Vincent", "Janet Daley", "Juliet Samuel", "Michael Deacon", "Sarah Champion"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2017/03/30/1949882-GPWI07-00000267-008-xlarge_trans_NvBQzQNjv4BqK1j0pLapztdY-jwWiC44LW4lPbr8UynsfK0JwimVors.jpg", "published_at": "2017-03-30"}