{"pub": "metro", "url": "https://metro.co.uk/2019/10/21/stormont-be-on-the-right-side-of-history-trust-women-and-let-abortion-be-legalised-10954393", "downloaded_at": "2019-10-21 10:30:07.540711+00:00", "title": "Stormont, trust women and legalise abortion in Northern Ireland", "language": "en", "text": "This move from the DUP is a pathetic and cynical attempt to continue systematically abusing the human rights of women, girls, and pregnant people (Picture: WIktor Szymanowicz/NurPhoto via Getty Images)\n\nI am struggling to put into words the anger, hurt and disappointment I feel at hearing that the DUP have gained enough signatures to recall Stormont on Monday 21st October to try and block the decriminalisation of abortion in Northern Ireland.\n\nMonday is the last day before new legislation will be put into place to give the women of Northern Ireland their bodily autonomy. This move from the DUP is a pathetic and cynical attempt to continue gravely and systematically abusing the human rights of women, girls, and pregnant people.\n\nFor them to pull this stunt – because let’s face it, that’s exactly what it is – would be laughable if it wasn’t so utterly hurtful to the women and pregnant people that these Members of the Legislative Assembly are supposed to represent. It is also excruciatingly disrespectful to the men, women and children of Northern Ireland who have been unrepresented and consistently let down for over 1000 days now. (Northern Ireland has had no devolved government since relations broke down between the DUP and Sinn Fein in 2017.)\n\nAdvertisement\n\nAdvertisement\n\nDuring that time our local hospitals, schools and communities have suffered – not to mention, we have not had a balanced and representative voice in Westminster on Brexit, and the impact of a border on our country and the integrity of the Good Friday Agreement.\n\nI understand that abortion is an issue that divides people. The solution to this is simple: if you oppose abortion, don’t have one.\n\nA woman’s decision to have an abortion is nobody’s business but her own. She should be allowed to seek advice from doctors, medical professionals, her family and her partner (if appropriate), but it is no other person’s business.\n\nWomen have stood up and been counted, sharing their stories, their heartbreak and pain all to help stop the criminalisation and oppression of Irish women (Photo by WIktor Szymanowicz/NurPhoto via Getty Images)\n\nI had an abortion in 2005 and have never, ever regretted my decision. It was the right decision for me at that time in my life. The only traumatising thing that I have had to endure was travelling to England for it, finding the money to pay for it, and since then having to constantly defend my decision to strangers, politicians, and anti-choice lobbyists.\n\nI know that there will be women all over Northern Ireland who are yet again being re-traumatised over this latest stunt at Stormont by the DUP and other MLAs to further violate our human rights. I have spent most of today in tears thinking of the many people I have met during the campaigning for abortion reform that have been affected by Northern Ireland’s archaic and barbaric laws.\n\nAdvertisement\n\nAdvertisement\n\nCurrently, our abortion law breaches human rights legislation, as it is a criminal act to have one – including in instances of foetal abnormality and rape. Today I am thinking of Sarah, Ashleigh, Emma, Kellie, Sara, Shannon, Jess, Shá and Stella. Of Aisling, Sharon, Claire, Cara, Roisin, Danielle, Siobhan, Rachel, Fiona and Bernadette.\n\nI could go on listing the women I have met and shared tears and stories with; who have hugged me when I needed a hug; who offered support, advice and help when it was needed. They stood in solidarity with me and all of the other women on our island that have needed it.\n\nThey have stood up and been counted, sharing their stories, their heartbreak and pain all to help stop the criminalisation and oppression of Irish women.\n\nI am writing to implore any MLA thinking of going to Stormont on Monday to do the right thing and use their voice to oppose the appointment of a Speaker. Please do not be complicit.\n\nIf necessary, please vote against the motion, as it is the responsibility of the UK government to ensure Northern Ireland’s abortion laws are no longer in violation of human rights. Please do the right thing. Be on the right side of history. The North is Now. We demand free, safe, legal and local healthcare.\n\nAdvertisement\n\nTrust women.\n\nMORE: A change to Northern Ireland’s abortion law cannot come soon enough\n\nMORE: This week has proved that the fight for abortion rights is far from over\n\nMORE: Historic vote to legalise abortion and same-sex marriage in Northern Ireland", "description": "The DUP's move to recall Stormont to try and block the decriminalisation of abortion in Northern Ireland is an attack on our human rights.", "authors": ["Bronagh Waugh", "Northern Irish Actor"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-11431583331_1571651307.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-21"}