{"pub": "metro", "url": "https://metro.co.uk/2019/10/21/grandad-becomes-fastest-84-year-old-world-recovering-two-heart-attacks-10954321", "downloaded_at": "2019-10-21 09:47:54.208292+00:00", "title": "Grandad from Yorkshire becomes fastest 84-year-old in the world", "language": "en", "text": "Tony when he was younger and Tony now (Picture: SWNS)\n\nTony Bowman is the fastest 84-year-old in the world – despite having two heart attacks.\n\nHe represented team GB at the European Masters in Italy last month and came away with three medals after competing in the 80-84 age category – gold for hurdles, silver in the 400m relay and bronze in the decathlon.\n\nHe also came fourth in the 100m and fifth in the 200m.\n\nHe said: ‘It is the younger athletes that are beating me. There is no 84-year-old faster than me in the UK – no, the world.’\n\nWhen Tony, from Leeds, West Yorks., first entered the 80-84 age category he broke 11 British athletics records, one European and one international, for track events including the decathlon and both indoor and outdoor pentathlon.\n\nGrandad-of-one Tony said: ‘I am looking forward to doing this again next year when I get into the next age category when I turn 85.’\n\nTony still competes in the hurdles, sprints and decathlon (Picture: Alex Cousins / SWNS)\n\nTony still loves taking part even though he had two heart attacks in his 70s and he had stents fitted after heart surgery and has since been treated for abnormal heart rhythm.\n\nAdvertisement\n\nAdvertisement\n\n‘I can’t let my heart get in the way of my training. When I am sprinting I have to give it my absolute all, my heart is the last thing on my mind,’ he said.\n\nHe trains every other day, dances and plays hockey and he recently cut down on alcohol and chocolate.\n\nHe hopes his regime will mean he will run 100m at 100 and he wants to live until 120.\n\nHe said: ‘I’ve heard alcohol can lead to dementia and I don’t want that. I’ve cut down to one glass of wine every other day.\n\n‘I now have to stay as fit as I can be to keep up my lifestyle.\n\n‘I feel like a 50-year-old and life is good.\n\nTony wants to compete for as long as he can (Picture: Alex Cousins / SWNS)\n\n‘I feel very blessed I have good genes but I do work hard at keeping fit, of course it helps that I love the feeling of running and sweating – especially when I’m winning.’\n\nTony, who is married to Betty, 85, grew up in Middlesex and his love for running started when he represented Middlesex schools aged 15-16.\n\nAt 27, he gave up running but kept playing hockey and tennis, until at the age of 42, he took up athletics again in the veteran’s category (now known as Masters) which is for ages 35 and over.\n\nSince then he has never looked back.\n\nThe only problem now is he has to pay for his events from his own pension.\n\nTony pictured left running the first London marathon in 1981 aged 44 (Picture: Tony Bowman / SWNS)\n\nHe said: ‘It would be great to get sponsorship as I have to pay for everything myself, from paying for tracksuits to travel, to entry fees.\n\nAdvertisement\n\nAdvertisement\n\n‘I’m doing all of this for my country, a country that I love, and it would be nice to be able to have some help.’\n\nTony continues to compete in Masters events all over the world, with competitions in Portugal and Toronto coming up.\n\nMasters athletics is a class of the sport of athletics for older athletes in track and field, road running and cross country running.\n\nCompetitors are bracketed into five-year age groups beginning at 35 for track and field and 40 for distance-running events.\n\nMen as old as 105 and women in their 100s have competed in running, jumping and throwing events.\n\nMORE: Debenhams launches £45 beauty advent calendar worth £190\n\nMORE: Morrisons launches Trick or Treat pizza with fiery ‘roulette’ chillies\n\nAdvertisement Advertisement", "description": "Tony Bowman is the fastest 84-year-old in the world - despite having two heart attacks.", "authors": ["Laura Abernethy"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_90987540_1571650509.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-21"}