{"pub": "reuters", "url": "https://ca.reuters.com/article/domesticNews/idCAKBN1W12FE-OCADN", "downloaded_at": "2019-09-16 23:23:18.618246+00:00", "title": "Canadian right-wing party chief Bernier invited to election debates", "language": "en", "text": "FILE PHOTO: Maxime Bernier is interviewed after first results gave him first place during the Conservative Party of Canada leadership convention in Toronto, Ontario, Canada May 27, 2017. REUTERS/Mark Blinch\n\nOTTAWA (Reuters) - Canada’s Maxime Bernier, leader of the right-wing Peoples Party of Canada (PPC), will participate in two official election debates next month after initially being told he was not invited, the debate organizers said on Monday.\n\nThe body that has organized the debates for Oct. 7 and Oct. 10, the first in English and the second in French, last month said Bernier would not be invited because he could not prove his party could win more than one seat in parliament in Canada’s Oct. 21 election.\n\n“Based on recent polling data, (the PPC) has achieved a reasonable chance of success in more than one riding,” Debates Commissioner David Johnston said in a statement explaining his decision to extend Bernier an invitation.\n\nBernier, 56, created the PPC a year ago after losing a bid to become leader of the Conservative Party.\n\n“I am obviously very happy with the decision of the Debates Commission to invite us,” Bernier said in a video clip posted to Twitter. “We offer a real alternative, a different alternative, with policies based on reforms we need for a freer and richer country.”\n\nThough welcome news for Bernier, the PPC leader’s inclusion could be a blow to the Conservative Party, which draws from a similar pool of voters.\n\nThe PPC has fielded candidates across Canada, but national polls currently have it picking up less than 5% of the vote. Conservative leader Andrew Scheer is leading Liberal Prime Minister Justin Trudeau by a whisker, 34.4% to 34.0% nationally, according to a Nanos Research poll.\n\nBernier has cast the PPC as a radically different choice from most Canadian parties. He is the only leader of a national party who says climate change is not caused by human activity, and he is proposing dramatic cuts to immigration levels.", "description": "Canada's Maxime Bernier, leader of the right-wing Peoples Party of Canada (PPC), will participate in two official election debates next month after initially being told he was not invited, the debate organizers said on Monday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190916&t=2&i=1430555270&w=1200&r=LYNXMPEF8F1FQ-OCADN", "published_at": "2019-09-16"}