{"pub": "fox", "url": "https://foxbusiness.com/economy/the-worlds-most-expensive-drug-posts-strong-quarterly-sales", "downloaded_at": "2019-10-22 15:14:18.637824+00:00", "title": "World's most expensive drug boosts Novartis forecasts", "language": "en", "text": "Zolgensma beat expectations, providing a massive lift for Novartis after what was a rocky start for the one-dose gene therapy to treat spinal muscular atrophy (SMA).\n\nContinue Reading Below\n\nNovartis announced on Tuesday that sales of Zolgensma, billed as the world’s most expensive drug at the cost of $2.1 million per patient, brought in $160 million to the company in the third quarter. This helped fuel a strong three months for the pharmaceutical company, which saw core operating income grow by 18 percent as well as net income from continuing operations up by 12 percent.\n\nZolgensma treats SMA, which is “a genetic disease affecting the central nervous system, peripheral nervous system, and voluntary muscle movement.” It is one dose and designed for those under the age of two years old.\n\nAs Novartis notes, the hefty price tag over $2 million per patient is still less than other traditional treatments.\n\n“The current 10-year cost of chronic therapy, which is given over the patient's lifetime, can often exceed USD 4 million in just the first 10 years of a young child's life,” Novartis noted in the May announcement of the drug.\n\n“In addition, that therapy stops working if treatment is stopped. Zolgensma is expected to save costs in the healthcare system compared to chronic treatment for the treatment and care of SMA.”\n\nStocks in this Article NVS NOVARTIS AG $86.92 +0.36 (+0.42%)\n\nCritics railed about the price, even as those suffering from SMA said it was worthwhile. There were also concerns about the rollout and testing prior to release, with Novartis embroiled in a controversy about the “data manipulation in a specific animal testing procedure used in the development of the product.”\n\nNet sales for Novartis for the third quarter check in at $12.2 billion, up 10 percent. Zolgensma’s strong debut beat predictions of $98 million for the quarter and the growth appears likely to continue.\n\n“Zolgensma has been used to treat patients ranging in age from less than one month to two years old including all types of SMA,” the Novartis release said. “To date plans are in place covering ~90% of commercial patients and ~30% of Medicaid patients.”\n\nThe news from Novartis, which also detailed the strong clinical backing of Zolgensma, also outlined that the drug is under review in both Europe and Japan. Decisions on approval from both fronts are expected next year.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE", "description": "Zolgensma, the world's most expensive drug, beat sales expectations in the third quarter.", "authors": ["Kristian Dyer"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/05/0/0/novartis.jpg?ve=1&tl=1", "published_at": "2019-10-22"}