{"pub": "nymag", "url": "https://thecut.com/article/cheap-earrings.html", "downloaded_at": "2019-09-24 13:33:38.405004+00:00", "title": "16 Fun Pairs of Earrings Under $50", "language": "en", "text": "Photo: Amazon\n\nNow is the perfect time of year to buy fun new earrings. It’s fall, but it’s not real fall, when you can wear sweaters and boots and all those new things you’re currently browsing when you’re bored at work. But you’re also probably totally sick of your summer clothing, since you’ve been wearing it since May. If you feel the profound need to switch up your look, try one of these 16 options from Amazon. They’re all under $50, and some of them are under $15.\n\nA Floral for Fall\n\nIf You’re More of an Ear-Cuff Person\n\nIf You’re Longing for Summer Again\n\nIf You Have a Secret Punk Streak\n\nShashi Women's Vixen Earrings The diamond studs say “I’m a functioning adult,” but the little dagger whispers, “But I have a dark side.” $31 at Amazon Buy $31 at Amazon Buy\n\nIf You Like to Combine Trends\n\nShashi Women's Lola Baltic Huggie Earrings $32 (was $64, now 50% off) Pearls are having a moment, shells are having a moment. Put them together and you have this earring! $32 at Amazon Buy $32 at Amazon Buy\n\nIf You’re Attracted to Classics\n\nKate Spade New York Women's Mini Round Stud Earrings Nothing wrong with a shiny little stud. It’s even better when it’s in a bright color like magenta. $38 at Amazon Buy $38 at Amazon Buy\n\nIf You Like Hoops but Also Like Being Different\n\nIf You’re a Preppy at Heart\n\nIf You Want Something Simple but Not Too Simple\n\nIf You Love Color\n\nJinling Floral Print Acrylic Drop Dangle Earrings Summer Beach Earrings $13 (was $30, now 57% off) Wear ’em with a black turtleneck, wear ’em with a colorful, maximal rainbow outfit. Either way, they’ll add a bit of sunshine to your look. $13 at Amazon Buy $13 at Amazon Buy\n\nIf You Need a Basic\n\nIf You Need a Basic but Prefer Silver\n\nsense925 Sterling Silver Hinged Hoop Earrings Speak for themselves. Plus, unlike small, dainty hoops, these have a nice heft to them. $28 at Amazon Buy $28 at Amazon Buy\n\nIf You Haven’t Let Old Céline Go\n\nIf You Like to Buy in Bulk\n\nHolfeun 3 Pairs Big Hoop Earrings, Stainless Steel Hoop Earrings Or if you can’t decide whether gold, rose gold, or silver is really your color. $8 at Amazon Buy $8 at Amazon Buy\n\nIf You’re Into the Memphis Design Revival\n\nMOLOCH Acrylic Statement Tortoise Hoop Resin Wire Drop Dangle Earrings $8 (was $70, now 89% off) The color scheme and the nontraditional post (no earring backs!) make this feel like it’s an extension of what Ettore Sottsass & Co. have wrought. $8 at Amazon Buy $8 at Amazon Buy\n\nIf You Really Loved the ‘Lover’ Video\n\nGVUSMIL Long Acrylic Petal Drop Dangle Earrings Taylor wears a pair of sunshine-y drop earrings in her “Lover” video. If you love the look, these are a good dupe. $11 at Amazon Buy $11 at Amazon Buy\n\nIf you buy something through our links, New York may earn an affiliate commission.", "description": "16 fun earrings under $50 to add to your Amazon cart. Featuring hoop earrings, statement earrings, and more.", "authors": ["The Cut"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/23/23-earring-lede.w1200.h630.jpg", "published_at": "2019-09-24"}