{"pub": "foxbusiness", "url": "https://foxbusiness.com/features/sports-teams-athletes-military-injuries-artificial-intelligence-sparta-science", "downloaded_at": "2019-10-01 00:09:20.705235+00:00", "title": "AI helping military, athletes prevent injuries via movement patterns", "language": "en", "text": "A software company is using artificial intelligence to help sports teams and even the military to improve injury prevention.\n\nContinue Reading Below\n\nSparta Science is able to gather movement patterns from different athletes and pair it with specific injuries to reduce the outcome.\n\n“Our entire mission is to help everyone move better, whether you are an athlete or you are actually a former athlete,” Sparta Science CEO & Founder Dr. Phil Wagner said during an interview on “Mornings with Maria” Friday.\n\nSparta Science uses an evidence-based movement scan and data-driven exercise prescription that minimize injury risk and speed effective rehabilitation to physical activity. For example, the wave absorbed from an athlete jumping onto a force plate generates force production data that can predict an elbow injury, Wagner said.\n\n“We’ve been able to pair up and match these machine learning patterns with these specific injuries to the point we are making discoveries we never thought were possible.”\n\nSparta technology is used in the National Football League scouting combines where league scouts evaluate the top draft-eligible college players.\n\nWagner said the technology is mostly used in colleges because of the abundance of football programs in the National Collegiate Athletic Association. He hopes Sparta Science is able to trickle down to help youth sports organizations where most of the injuries are happening.\n\nCLICK HERE TO GET THE FOX BUSINESS APP\n\nThe Sparta software assists the military in predicting, diagnosing and prescribing personal plans to optimize health and performance.\n\n“The biggest loss of some of these assets and individuals is in the military, Wagner said. “The Marines alone lost 111 million last year due to injury.”", "description": "Sparta Science gathers movement patterns from different athletes and pair it with specific injuries to reduce the outcome.", "authors": ["Henry Fernandez"], "top_image": "https://a57.foxnews.com/media.foxbusiness.com/BrightCove/854081161001/201907/1446/0/0/854081161001_6064259874001_6064255201001-vs.jpg?ve=1&tl=1", "published_at": "2019-07-26"}