{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7602051/The-Latest-Alec-Baldwin-campaigns-Virginia-Democrats.html", "downloaded_at": "2019-10-23 09:08:21.746921+00:00", "title": "Alec Baldwin campaigns for Virginia Democrats", "language": "en", "text": "Advertisement\n\nActor Alec Baldwin knocked on doors and cracked a few jokes in a suburban Richmond neighborhood to try to drum up votes for Democratic legislative candidates in Virginia.\n\nBaldwin is known for his mocking impersonations of President Donald Trump on 'Saturday Night Live'.\n\nOn one campaign stop Tuesday, Baldwin joined Amanda Pohl, a Democrat looking to unseat incumbent Republican state Sen. Amanda Chase.\n\nBaldwin stumped just a few doors down from Chase's home and joked about leaving a roll of quarters in her mailbox after referring to a confrontation she had with a Capitol Police officer earlier this year over a parking space.\n\nActor Alec Baldwin campaigns with Amanda Pohl, a candidate for Virginia Senate District 11 in her neighborhood in Midlothian, Va. Baldwin knocked doors for several Democratic candidates around the state.\n\nActor Alec Baldwin walks with Amanda Pohl, candidate for Virginia Senate District 11, on October 22.\n\nActor Alec Baldwin holds a Josh Cole campaign sign after accidentally knocking it off a window during a visit to the Leeland Station Clubhouse in Stafford County, Va., on October 22. Cole, right, who is running for the Virginia House of Delegates 28th District, reacts to the situation\n\nActor Alec Baldwin looks at a sign made by 10-year-old Lily Tipling during his visit to the Leeland Station Clubhouse Tuesday. Baldwin encouraged the youngster to run for the White House in 25 years. The actor campaigned for Democratic legislative candidates in a Virginia election that is viewed as a warmup to the 2020 presidential contest\n\nAlec Baldwin speaks with Josh Cole, right, who is running for the Virginia House of Delegates 28th District, and Qasim Rashid, second right, running for Virginia's 28th District Senate during a daylong trip to Virginia Tuesday\n\nEarlier this year, Baldwin pleaded guilty to harassing a man in a dispute over a parking space.\n\nThe progressive advocacy group People for the American Way helped organize the trip. Baldwin is a board member of the group and has been an outspoken critic of Trump.\n\nVirginia is one of only four states holding legislative elections this year and the only one where partisan control of the legislature is up for grabs. National groups view Virginia as a warm-up to the 2020 presidential cycle and are pouring money into the state.\n\n'When you don’t have accomplishments, or a message, or enthusiasm, you call in C-list celebrities. Which is why Republicans will not be asking for celebrity help,' Garren Shipley, spokesman for House Majority Leader Todd Gilbert (R-Shenandoah), told the Washington Post.\n\nAlec Baldwin points out a throng of media as he talks to Kristin Goodlett while walking with Amanda Pohl, candidate for Virginia Senate District 11 in her neighborhood in Midlothian, Va., Baldwin lent support to several candidates around the state on October 22\n\nActor Alec Baldwin was on the campaign trail in Virginia Tuesday, including hitting the trail for Amanda Pohl, the Democratic candidate for Virginia Senate District 11\n\nActor Alec Baldwin, an outspoken critic of President Trump, gave a hand to several Democrats vying for state government in Virginia\n\nAlec Baldwin lent his voice to several Democratic candidates in Virginia Tuesday. He addressed supporters of Amanda Pohl, left, who is running for Senate District 11 in her neighborhood in Midlothian, Va.", "description": "Actor Alec Baldwin joined several Democratic candidates vying for state office in Virginia. The trip was set up by the People for the American Way, which Baldwin is a board member.", "authors": ["Associated Press", "Jerry Barmash For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/05/20067712-0-image-a-11_1571803563202.jpg", "published_at": "2019-10-22"}