{"pub": "morningstar", "url": "https://morningstar.com/articles/856269/a-checklist-for-taxable-bond-fund-investors", "downloaded_at": "2019-10-15 11:21:59.036802+00:00", "title": "A Checklist for Taxable-Bond-Fund Investors", "language": "en", "text": "A bond is a pretty simple investment. Governments and corporations issue bonds to raise money, and in return, they offer bond investors regular interest payments and a return of the principal investment at the bonds' maturity dates. Investors--especially income-seeking investors, such as retirees--like bonds for their steady stream of income and stability when compared with stocks.\n\nBut choosing a suitable taxable-bond fund is more difficult than it might seem. The considerations are multiple and can be intricate. There are credit-quality decisions, interest-rate sensitivity choices, and of course, determining whether you should invest in a single core holding or add supporting players around a core.\n\nGiven the sizable role taxable-bond funds play in investor portfolios, here's a checklist for investors to follow as they evaluate their current fixed-income allocations or consider adding taxable-bond exposure to their portfolios.\n\nCore Only or Core and Support?\n\n\"Be sure to start building your bond-fund portfolio with core, intermediate-term funds that give you a lot of diversification in a single holding,\" recommends Morningstar director of personal finance Christine Benz. Investors seeking diversification benefits for an equity-heavy portfolio can be well served by higher-quality, intermediate-term bond funds blending government bonds, mortgage-backed securities, and high-quality corporate debt. You can find these funds in Morningstar's Intermediate Governement and Intermedicate Core Bond categories.\n\nSome investors may want to go beyond these very high-quality choices, though. For instance, investors with a modest equity stake and heavy fixed-income allocation might choose to own a few bond funds, in an attempt to diversify. They can start by supplementing a core bond choice with high-yield and bank-loan funds. In addition, foreign-bond funds can provide global diversification across interest-rate and inflationary environments.\n\nInvestors looking for a little bit of all of these bond types in one package might consider more flexible bond funds. Found in Morningstar's Intermediate Core-Plus Bond and Multisector Bond categories, these funds invest in government and corporate paper, U.S. and foreign bonds, and high- and low-quality credits. These categories feature a range of strategies offering varying levels of interest-rate, credit, and currency risk.\n\nFinally, there's one bond-fund type that Benz suggests retirees specifically add to their bond portfolios, whether they are taking a core-only or core-and-support approach: inflation-protected bond funds.\n\n\"Such individuals rely on at least part of their portfolios for living expenses and, therefore, they're not receiving an inflation adjustment in that part of their 'paychecks,'\" she says. Inflation-protected bond funds can fill that role.\n\nCredit Quality\n\nYield is tough to come by. As of this writing, the yield on the 30-year Treasury dwells at 2.09% and 10-year paper hovers at 1.6%. As a result, it's tempting to buy riskier bonds--those bonds issued by corporations rather than the government, or even those bonds rated below high quality. As compensation for taking on that extra so-called credit risk, these bonds offer higher yields.\n\nWhat's the harm? For one, lower-quality bonds (such as those purchased by high-yield and bank-loan funds) can get hammered during flight-to-quality periods. During 2008's credit crisis, high-yield and bank-loan funds declined an average 29.8% and 26.4%, respectively. During that same time frame, high-quality government-bond funds notched gains.\n\nAnd as we've already discussed, lower-quality credits tend to behave more like equities than bonds. So, if you're dipping into lower-rated credits to pick up extra yield in your core, you're making your portfolio more sensitive to the equity market.\n\nFor the core of your fixed-income portfolio, focus on funds whose average credit quality (as depicted by the fixed-income Morningstar Style Box) land in the mid- to high-quality range. Relegate lower-credit-quality plays to supporting roles in your portfolio.\n\nInterest-Rate Sensitivity\n\nInvestors generally think of high-quality bond funds as \"safe\" investments. While such funds pose modest credit risk (in other words, their issuers are unlikely to default on their interest payments), they can carry significant interest-rate risk. Because most bonds pay out a fixed rate of interest until their maturity, they are susceptible to changes in interest rates (also known as interest-rate risk). When rates rise, the prices of already-issued bonds can fall because an investor can go out into the market and buy a similar-quality bond yielding more.\n\nAs a result, investors holding interest-rate-sensitive bond funds can experience huge swings in performance. For instance, the typical long-term government-bond fund lost more than 13% when yields rose in 2013, and gained 22% in 2014's Treasury rally. Meanwhile, intermediate-term government funds lost less than 3%, on average, in 2013 while gaining almost 5% in 2014.\n\nFor the core of your fixed-income portfolio, go for funds with moderate interest-rate sensitivity (as depicted by the fixed-income Morningstar Style Box); you'll end up with less volatility, year over year. Long-duration funds with extensive interest-rate sensitivity are best suited to those who want to tilt their portfolios to play a falling-interest-rate scenario.\n\nExpenses\n\nMorningstar director of manager research Russ Kinnel calls expenses \"an underrated element of a fund's performance. You ignore them at your own peril.\" In his latest research into the predictive power of fees, Kinnel found that funds carrying lower expenses enjoyed greater \"success rates\" (defined as survival and outperformance over a subsequent period) than funds levying higher expenses.\n\nPrice is an even more important consideration with core bond funds than some other fund types. That's because the range of returns among funds in these comparatively staid categories is relatively narrow. Core bond funds with higher expense ratios to clear find themselves at a return disadvantage. To stay competitive, some higher-cost funds may take on additional risks, such as delving into lower-quality credits or extending their durations. When it comes to bond funds, warns Benz, \"high expenses correlate neatly with risk-taking.\"\n\nAs a rule of thumb, focus on bond funds with low or below-average fee levels. You can find a fund's fee level on the Quote page of any fund report; view a full expense breakdown by clicking the \"Price\" link on the Quote page.\n\nConsult Analyst Ratings\n\nMorningstar Analyst Ratings are handy guides for monitoring existing holdings and finding new investments. Funds that earn Analyst Ratings of Gold, Silver, or Bronze (also known as Morningstar Medalists) are expected to outperform their categories and their benchmarks over a full market cycle.\n\nWhen assigning ratings, Morningstar analysts concentrate on the drivers that give funds long-term competitive advantages, such as repeatable and consistent investment processes, low costs, and deep manager and analyst teams. Premium Members can view a full list of analyst ratings here.\n\n\n\n", "description": "Five considerations for those investing in fixed-income funds.", "authors": [], "top_image": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blte12b6973cf85ef1b/5cf80c92a69578cb0813f2cf/FinancialLife_FourSquares_1x1.svg", "published_at": "2019-10-15"}