{"pub": "axios", "url": "https://axios.com/facebook-mark-zuckerberg-free-speech-8a594def-806c-4e24-8c6e-fdff60d242c3.html", "downloaded_at": "2019-10-29 02:13:01.883643+00:00", "title": "Mark Zuckerberg doubles down on free speech", "language": "en", "text": "\"I believe people should decide what is credible, not tech companies. ... When it's not absolutely clear what to do, we should err on the side of free expression.\"\n\n— Zuckerberg\n\nThe big picture: Facebook's scale and impact has become a flashpoint for political criticism in the U.S. and around the world, particularly since its newsfeed became a vector for targeted deceit during the 2016 election.\n\nBetween the lines: Talking about freedom of speech lets Zuckerberg stand on high moral ground — and means he doesn't have to talk about privacy violations, problems with targeted advertising, \"echo chambers\" that deepen partisan conflict, algorithmic bias, and other issues critics and policymakers have raised.\n\nFighting misinformation: Facebook has found that it's more effective to identify and boot fake accounts than to try to restrict false information, Zuckerberg said.\n\n\"Focusing on authenticity and verifying accounts is a much better solution than an ever-expanding definition of what is and is not harmful content.\"\n\nPolitical ads: After Facebook ran ads from President Trump's campaign that contained false statements about Democratic challenger Joe Biden, the company faced demands that it remove the ads — or stop running political ads altogether.\n\nZuckerberg said he's considered but rejected that move: \"From a business perspective, the controversy certainly is not worth the very small part of our business that they make up. But political ads can be an important part of voice — especially for local candidates, up-and-coming challengers and advocacy groups that the media may not cover otherwise. That way they can get their voice into the debate. Banning political ads favors incumbents and whoever the media covers.\"\n\nZuckerberg identified three threats to free expression on the horizon:\n\n1. China, which \"is building its own internet focused on very different values.\"\n\nFacebook, along with Instagram and its other services, does not operate in China.\n\n2. Platforms like Facebook: \"The reality is we make a lot of decisions that affect people's ability to speak ... but we won't always get it right.\"\n\nZuckerberg pointed to Facebook's nascent effort to create an independent, \"Supreme Court\"-like Oversight Board as one response.\n\n3. Partisan politics: \"We're seeing people across the spectrum try to define more speech as dangerous because it may lead to political outcomes they see as unacceptable. Some hold the view that since the stakes are so high, they can no longer trust their fellow citizens with the power to communicate and to decide what to believe for themselves. I personally believe this is more dangerous for democracy over the long term than almost any speech.\"\n\nThe bottom line: Zuckerberg hopes to position Facebook as the inheritor of a long liberal Western tradition of free-speech advocacy dating back to the Enlightenment.", "description": "Facebook's CEO says he and his company will prioritize giving everyone a voice.", "authors": [], "top_image": "https://images.axios.com/TpBu52pHMOqC0mECnkbbIuygllE=/0x917:5296x3896/1920x1080/2019/10/17/1571336236898.jpg", "published_at": "2019-10-17"}