{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7612519/Bella-Thorne-wears-leather-lace-pants-white-bodysuit.html", "downloaded_at": "2019-10-25 17:07:08.381988+00:00", "title": "Bella Thorne wears leather lace-up pants and a white bodysuit", "language": "en", "text": "She's known for her edgy style.\n\nAnd Bella Thorne's look on Thursday night was no exception to the rule as she appeared at an opening for the Seminole Hard Rock Hotel and Casino Guitar Hotel in a pair of lace-up leather pants and a white strapless bodysuit.\n\nThe 22-year-old actress wore a leather motorcycle jacket over her shoulders.\n\nPosh: Bella Thorne's look on Thursday night was no exception to the rule as she appeared at an opening for the Seminole Hard Rock Hotel and Casino Guitar Hotel in a pair of lace-up leather pants and a white strapless bodysuit\n\nShe accessorized with a pearl necklace along with a diamond chain - pumping up the bling with a set of diamond-encrusted rings as well as a ruby and emerald-set ring.\n\nThorne left her brunette locks wavy and her makeup minimal with just a touch of orange eyeshadow adding a pop of color to her lids.\n\nThe Famous In Love star walked the red carpet in nude pointed-toe pumps.\n\nChic: The 22-year-old actress wore a leather motorcycle jacket over her shoulders\n\nBeachy: Sofia donned a white bikini top with a cream-colored cardigan and white pants\n\nNearby were three members of the Keeping Up With the Kardshians clan - Khloe Kardashian, Scott Disick and his girlfriend Sofia Richie.\n\nSofia donned a white bikini top with a cream-colored cardigan and white pants.\n\nHer blonde tresses were shaped into blowout waves and she blew a kiss as she faced the camera.\n\nAnother string to their bow: The Seminole Hard Rock Hotel and Casino has been built in the shape of a guitar\n\nNew location: The Guitar Hotel is located on 100 acres of the Hollywood Reservation of the Seminole Tribe of Florida\n\nWow! No expense has been spared with the new complex, with fireworks being blasted off the lit-up roof at night\n\nKhloe wore a black slip dress with gold accents that showed off her toned figure.\n\nShe parted her hair in the middle and folded it into soft waves, allowing it to cascade down her shoulders.\n\nScott wore a black long-sleeved tee and medium-wash jeans. He kept his hands in his pockets as he posed for photos.\n\n\n\nGolden girl: Khloe wore a black slip dress with gold accents that showed off her toned figur\n\nThe Seminole Hard Rock Hotel and Casino has been built in the shape of a guitar\n\nIt's located on 100 acres of the Hollywood Reservation of the Seminole Tribe of Florida\n\nIt's the latest step in the Seminole Hard Rock empire, which includes naming rights on the Miami-area stadium where the 2020 Super Bowl will be played", "description": "She's known for her edgy style. And Bella Thorne's look on Thursday night was no exception to the rule as she appeared at an opening for the Seminole Hard Rock Hotel and Casino Guitar Hotel in a", "authors": ["Marisa Okano For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/07/20168202-0-image-a-52_1571984949623.jpg", "published_at": "2019-10-25"}