{"pub": "huffpost", "url": "https://huffpost.com/entry/executive-sentenced-usc-college-admissions-scandal_n_5d8a93a0e4b0c6d0cef32cd7", "downloaded_at": "2019-09-25 04:36:04.657276+00:00", "title": "Executive Sentenced To Four Months For Bribing Son's Way Into USC", "language": "en", "text": "ASSOCIATED PRESS Devin Sloane, middle, leaves federal court after his sentencing in a nationwide college admissions bribery scandal, Tuesday, Sept. 24, 2019, in Boston.\n\nBOSTON (AP) — A Los Angeles business executive was sentenced Tuesday to four months in prison for paying $250,000 to get his son admitted to the University of Southern California as a fake water polo recruit.\n\nDevin Sloane, 53, pleaded guilty in May to a single count of fraud and conspiracy. He is the second parent sentenced in a sweeping college admissions scandal that has ensnared dozens of wealthy mothers and fathers.\n\nU.S. District Judge Indira Talwani also ordered Sloane to perform 500 hours of community service over two years of supervised release and pay a fine of $95,000.\n\nAuthorities say Sloane helped fabricate documents depicting his son as an international water polo star even though he had never played the sport. He bought water polo gear online, investigators found, and staged action photos of his son in the family’s swimming pool.\n\nSloane is a graduate of USC and founder of the Los Angeles water systems company AquaTecture.\n\n“There are no words to justify my behavior nor will I offer any excuses or justification,” he said Tuesday with tears in his eyes. “The crime I committed is unacceptable. In my heart and my soul I want what’s best for my son. I realize now my actions were the antithesis of that.”\n\nHe was accused of paying $200,000 to a sham charity operated by William “Rick” Singer , an admissions consultant at the center of the scheme, and $50,000 to an account controlled by Donna Heinel, a former USC athletics official. Sloane previously said he accepts responsibility for his crime but has argued he was drawn into the scheme by Singer, who provided a year of legitimate counseling before mentioning the scheme.\n\nSinger pleaded guilty in March and agreed to work with authorities. Heinel is accused of accepting bribes to get students admitted as fake athletic recruits. She has pleaded not guilty.\n\nLast week, “Desperate Housewives” star Felicity Huffman became the first parent sentenced in the scheme after admitting to paying $15,000 to rig her daughter’s SAT score. She was sentenced to 14 days in prison, 250 hours of community service and a $30,000 fine.\n\nTalwani challenged the idea that parents would pursue the admissions or test scheme out of a desire to help their children.\n\n“The crime that’s at issue in all of these cases is not basic care-taking for your child. It’s not getting your child food or clothing. It’s not even getting your child a college education,” she said. “It’s getting your child into a college that might be called exclusive. Are they doing that for their children or are they doing it for their own status?”\n\nProsecutors said Sloane deserved prison time because he enlisted his son in the scheme, stole an admissions spot from another student, and failed to take full responsibility by blaming Singer.\n\n“Prison is necessary here as a great leveler between rich and poor,” federal prosecutor Eric Rosen said Tuesday.\n\nHe added that Sloane’s deceit is worse than Huffman’s.\n\n“Huffman kept her child out of the crime, preferring to not let her know what was going on,” he said. “The defendant, by contrast, literally threw his son into the family pool.”\n\nSeveral others paid similar sums to get their children into other elite schools, authorities said, while some paid as much as $400,000 per student .\n\nSloane’s son, Matteo, was accepted to USC in 2018. It’s unclear if he still attends the school. As of this August, USC said it had not made a decision regarding students whose families were accused in the admission scheme.\n\nFifteen parents have pleaded guilty, while 19 are fighting the charges, including “Full House” actress Lori Loughlin and her fashion designer husband, Mossimo Giannulli, who are accused of paying $500,000 to get their two daughters into USC as fake athletes.\n\nSeveral other parents are scheduled to be sentenced in coming weeks, including Stephen Semprevivo , who faces sentencing Thursday on charges that he paid $400,000 to get his son into Georgetown University.", "description": "Devin Sloane is the second parent sentenced in a sweeping college admissions scandal that has ensnared dozens of wealthy parents, including Felicity Huff...", "authors": [], "top_image": "https://img.huffingtonpost.com/asset/5d8a93e024000057007d1567.jpeg?ops=1778_1000", "published_at": "2019-09-24"}