{"pub": "yahoo", "url": "https://news.yahoo.com/prolific-british-pedophile-richard-huckle-032531827.html", "downloaded_at": "2019-10-15 09:09:47.275434+00:00", "title": "Prolific British pedophile Richard Huckle found dead in prison cell", "language": "en", "text": "His name had become synonymous in Malaysia with horror and depravity: Convicted pedophile Richard Huckle was estimated to have abused 200 children over several years working as a freelance photographer and English teacher in poor Malaysian communities.\n\nYesterday, the UK’s Ministry of Justice confirmed that he was found dead in his Full Sutton Prison cell in Yorkshire, England, where he was serving 22 life sentences following his 2016 trial. Media outlets have reported that Huckle was stabbed, but investigations are still ongoing.\n\nHis victims ranged in age from a 6-month-old baby to a 12-year-old child. He is believed to have committed the bulk of his offenses over a nine-year period in Malaysia, with the National Crime Agency also saying he committed child abuse in Cambodia.\n\nvia BBC video More\n\nOften grooming poor children from schools and orphanages in Kuala Lumpur, he later took pictures and videos of himself raping them, sharing the images in pedophile groups on the dark web.\n\nIn a blog that he kept, Huckle developed a system of “Pedopoints” that he awarded himself, noting that he had abused 191 children on his “scorecard.” Investigators uncovered images where he forced his child victims to pose with signs that advertised his “business” of abuse.\n\nHuckle had also circulated a 60-page guide he titled “Pedophiles & Poverty: Child Lover Guide.” The UK judge who presided over the case called it a “truly evil document.”\n\nvia BBC video More\n\nHis abuse began during a gap-year teaching in Southeast Asia. At his sentencing, Judge Peter Rook QC told him:\n\n“Your offending behavior became entrenched in your everyday life. Your life revolved around your sexual activities with young children. Your distorted beliefs in respect of children are deep-seated. Your self-delusion knows no bounds.”\n\nPolice finally arrested Huckle in 2014 at Gatwick Airport, after his return from Malaysia for Christmas. His capture followed a tip-off from Australian investigators who had recently shut down a website dedicated to pedophilia with over 9,000 members.\n\nRook said that Huckle’s behavior seemed to be “escalating,” with the suspect planning on creating a “pedo Wiki guide” for his depraved followers.\n\nAt the time of his arrest, 20,000 thousand images of child abuse were found on Huckle’s computer and camera, 1,000 of which were of him raping his victims. Refusing to cooperate with investigators, he declined to share passwords to encrypted files.\n\nFollowing his arrest, his family sold their home and sought anonymity. His sister-in-law was quoted by UK media outlet Sky News as saying: “None of his family will speak about him. None of us ever want to see Richard again.”\n\nThis article, Prolific British pedophile Richard Huckle found dead in prison cell, originally appeared on Coconuts, Asia's leading alternative media company. Want more Coconuts? Sign up for our newsletters!", "description": "His name had become synonymous in Malaysia with horror and depravity: Convicted pedophile Richard Huckle was estimated to have abused 200 children over several years working as a freelance photographer and English teacher in poor Malaysian communities. Yesterday, the UK’s Ministry of Justice confirmed", "authors": ["Coconuts Kl"], "top_image": "https://s.yimg.com/uu/api/res/1.2/z7eGmHpl65zaepjhyNE9OQ--~B/aD0yOTc7dz01NzQ7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/coconuts_kl_272/4b0b6ca20630428173c3cbf3d85c86b5", "published_at": "2019-10-15"}