{"pub": "news24", "url": "https://traveller24.com/Explore/SAHolidayGuide/the-ultimate-foodie-journey-through-the-west-coast-only-costs-r300-20191023-2", "downloaded_at": "2019-10-23 15:06:43.459362+00:00", "title": "The ultimate foodie journey through the West Coast only costs R300", "language": "en", "text": "(Georgia East. PHOTO: Marisa Crous) YOU MIGHT ALSO LIKE {{item.title}}\n\nI met writer and photographer, Georgia East, author of the cookbook, West Coast Wander (R300) a few months ago on a day trip to Riebeek Kasteel.\n\nWe bonded over a shared love for anchovies. And bokkom butter. Salty as can be, the thought of dried fish mixed in with real butter and spread on toast always makes me salivate.\n\nMediterranean food, is my kind of food.\n\nGeorgia's cookbook is the ultimate love letter to the West Coast, its artisans, locals and especially the seafood caught and cooked along this glorious coastline.\n\nHer recipes twist traditional dishes, tweaking them in a modern and quirky ways that has the palette perked as you page through this cookbook.\n\nDishes like spekboom tzatziki - a side I'm dying to make - gets your attention, along with the inclusion of foraged ingredients like dune sage in many dishes.\n\nShe includes the voices of local bucherettes, bakers and winemakers, taking you on a culinary journey like very few other cookbooks do. It's storytelling. The place and people create a very fine-tuned type of nostalgia which perfectly complements each dish.\n\nREAD: 3 Must-do West Coast long-weekend itineraries\n\n\"Seeking out the best place to buy bread in Hopefield, discovering what sets a Sandveld Sauvignon Blanc apart and learning how the plumpest oysters in the country are farmed in Saldanha Bay are just a few of the topics covered,\" says East.\n\nREAD: This Strandveld restaurant might just be the most unpretentious, uber-cool restaurant of the moment\n\nPerfectly fitting for the occasion, we headed out to Saldanha Bay to celebrate the launch of her book, and to eat the oysters, bokkom butter on fresh seaweed-infused sourdough bread, angelfish and mussels cultivated and naturally occurring in the area.\n\nOn this special day, she left the cooking for someone else to do.\n\n(The view from Blue Bay Lodge. PHOTO: Marisa Crous) (Oysters and Groote Post MCC. PHOTO: Marisa Crous) (The Mussel Monger preparing mussels over the open fire. PHOTO: Marisa Crous) (Mussels with vetkoek. PHOTO: Marisa Crous) (PHOTO: Marisa Crous)\n\n\n\nFind Your Escape by signing up for the Traveller24 Weekly Newsletter – Subscribe here. Or download the News24 App here, to receive expertly curated travel ideas and deals directly to your mobile.", "description": "Eat your way through the coastline of the beautiful West Coast from the comfort of your own kitchen.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9390/710bc72422ca4b7b9f900d229f37222b.jpg", "published_at": "2019-10-23"}