{"pub": "hotair", "url": "https://hotair.com/headlines/archives/2019/10/will-hillary-run", "downloaded_at": "2019-10-29 00:19:03.295390+00:00", "title": "Will Hillary run again?", "language": "en", "text": "“Biden is tarnished by the swampy Ukraine dealings his son Hunter was involved in,” one top former Hillary aide recently told me. He pointed to Olivia Nuzzi’s New York magazine profile of Joe Biden. She called Biden “the least formidable front-runner ever.” His campaign has poor fund-raising totals, he is only barely adequate in debates, and he often harkens back to the past instead of focusing on the future. As for Biden’s prospects in the primaries, Nuzzi was pessimistic: “Nobody will tell the candidate in plain terms what they think he needs to change. Not that Biden really listens anyway.”\n\nElizabeth Warren, the candidate most likely to steal the title of front-runner from Biden, has her own problems. While her panoply of “free” government programs excites the liberal base and many young voters, many in the Democratic donor class are convinced that her radicalism would be poison in a general election.\n\n“If Elizabeth Warren is elected president, in my opinion, the market drops 25 percent,” Wall Street billionaire Leon Cooperman told CNBC’s Squawk Box, adding: “Bernie Sanders, same thing.” He believes that Warren’s proposed wealth tax would boomerang against her as voters learned that taxpayers would be forced to estimate the current value of everything they own from cars to real estate to art, private-equity portfolios, and private businesses. Cooperman even used epithets to describe Warren’s program to Politico. “I believe in a progressive income tax and the rich paying more. But this is the f***ing American dream she is s***ting on.”", "description": "", "authors": ["John Fund", "Nationalreview.Com Will-Hillary-Run-Again"], "top_image": "", "published_at": "2019-10-29"}