{"pub": "breitbart", "url": "https://breitbart.com/news/brandts-quick-fire-double-gives-dortmund-german-cup-win-over-moenchengladbach", "downloaded_at": "2019-10-30 23:18:59.192549+00:00", "title": "Brandt’s quick-fire double gives Dortmund German Cup win over Moenchengladbach", "language": "en", "text": "Berlin (AFP) – Julian Brandt scored two goals in three minutes to propel Borussia Dortmund into the German Cup last 16 with a 2-1 comeback victory over Borussia Moenchengladbach on Wednesday.\n\nAfter a dour opening, the game came to life in the 71st minute when Gladbach’s Marcus Thuram headed home from close range to put the visitors 1-0 up.\n\nDiscovering a sudden urgency, Dortmund went on the attack, equalising in the 77th minute after a shot from Brandt was deflected past Gladbach keeper Yann Sommer.\n\nThe home side scored the winner just three minutes later, with Brandt heading a cross from Thorgan Hazard into the bottom left of the net.\n\nRB Leipzig demolished Wolfsburg 6-1 after a second-half exhibition featuring four goals in 13 minutes from the visiting side.\n\nLeipzig trail Wolfsburg by two points in the Bundesliga but grabbed the lead on 13 minutes in their last-32 tie courtesy of an own goal by Dutch defender Jeffrey Bruma.\n\nMarcel Sabitzer scored Leipzig’s second in the 55th minute and opened the floodgates, with goals from Emil Forsberg, Konrad Laimer and Timo Werner padding the score out to 5-0.\n\nGermany forward Werner struck again in the 88th minute before Wolfsburg got a consolation goal from Wout Weghorst.\n\nElsewhere, Werder Bremen dominated second division side Heidenheim, winning 4-1.\n\nMilot Rashica scored after just six minutes, with Leonardo Bittencourt and Davy Klaassen adding two more before the game had reached 20 minutes.\n\nAustrian defender Marco Friedl added a fourth in the 41st minute, before Heidenheim’s Marc Schnatterer converted a penalty in first-half injury time.\n\nAmateur side SC Verl continued their miraculous German Cup run, advancing to the last 16 after defeating second-division Holsten Kiel 8-7 in a penalty shootout.\n\nHome side Verl, who play in the fourth division of German football, equalised in the 45th minute through Nico Hecker after Kiel opened the scoring in the 13th minute through Janni Luca Serra.\n\nBoth sides converted each of their five penalties, with the shootout eventually going to its ninth round. Verl’s Zlatko Janjic scored from the spot, before Kiel’s Phil Neumann failed to convert to send the minnows through.\n\nVerl had defeated Bundesliga side Augsburg in their first-round fixture.\n\nIn another match decided by a penalty shootout, two-time German Cup winners Kaiserslauten won 6-5 over Nuremberg, after the score finished 2-2 following extra time.", "description": "Berlin (AFP) – Julian Brandt scored two goals in three minutes to propel Borussia Dortmund into the German Cup last 16 with a 2-1 comeback victory", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/30/cbe016_rb-leipzig-are-return-german-cup-final-finishing-as-runners-up-bayern-munich-640x335.jpg", "published_at": "2019-10-30"}