{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/quid-pro-quo-and-extortion-welcome-to-foreign-relations", "downloaded_at": "2019-10-07 20:14:10.480975+00:00", "title": "Donald Trump's Ukraine Call & Other Foreign Relations", "language": "en", "text": "Ukraine’s President Volodymyr Zelenskiy listens during a bilateral meeting with President Donald Trump on the sidelines of the 74th session of the United Nations General Assembly in New York City, September 25, 2019. (Jonathan Ernst/Reuters)\n\nA president’s management of foreign policy and his political interests naturally overlap.\n\nThe coverage of the Trump administration’s pressure on Ukraine is verging on the absurd, as to both what is alleged to have been a wrong and the degree to which we should judge it wrong. In particular, I am referring to the concepts of quid pro quo and of extorting a foreign government.\n\nAdvertisement\n\nAdvertisement\n\nTo listen to commentary, not only by anti-Trumpers but even some Trump defenders who don’t seem to understand what they’re talking about, one would think that a quid pro quo is always bad, and that it is a terrible thing to pressure a foreign government.\n\nThis is nonsense. Foreign relations typically involve quid pro quo arrangements. Governments do not ordinarily assist each other out of fondness. Nations pursue their interests in the world. Where interests align, they assist each other. Where interests are opposed, they are adverse to each other. In any event, they bargain with each other to advance their interests. It is a matter of “We want you to do this; what do we need to do – whether for you or to you – to make you do it?”\n\nThe term quid pro quo has a sinister connotation because we most often hear it in connection with political-corruption cases, often involving bribery. In truth, all exchanges involve a quid pro quo, but most are not corrupt. When they are corrupt, it is not because Country A is asking Country B for something, but because Country A is asking for something that it is wrong to ask for. If the request is not improper, there is nothing wrong with a quid pro quo.\n\nAdvertisement\n\nThere is, similarly, nothing wrong with squeezing a foreign government in furtherance of American interests. Indeed, that is exactly what we are trying to do with Iran right now. If important American interests are at stake, the president’s job is to pressure other countries. International relations and domestic law enforcement are very different. In the latter, extortion is a crime. In the former, applying inducements (including threats, and sometimes worse) is what countries do to each other. As long as what an American president is asking for advances an American interest and does not violate either American law or any international obligation we’ve taken on, there is nothing wrong with pressuring other countries.\n\nAdvertisement\n\nOf course, in the real world, things are often not tidy. Presidents are in charge of foreign relations, and they pursue policies that they’ve run on. Presidents seeking reelection need policy successes. A president’s management of foreign policy and his political interests naturally overlap.\n\nAdvertisement\n\nAt the same time, a policy that is good for the United States may have the collateral effect of politically damaging a president’s political rival. A president should not be discouraged from pursuing American interests just because doing so might help the president or harm the president’s opposition.\n\nConsider Iran again. If President Trump’s maximum-pressure campaign were to induce the Iranian regime to come to the bargaining table and agree to terms far better for the U.S. than was President Obama’s JCPOA (the Iran nuclear deal), that would redound to Trump’s political benefit; it would also be damaging to former vice president Biden’s candidacy, since it would show that the policy he and the Obama administration championed was ill-advised. The fact that Trump’s personal interests would be advanced and Biden’s damaged does not mean Trump should stop pressuring Iran. Pressuring Iran is good for America, regardless of whose political fortunes it affects.\n\nAdvertisement\n\nOn the other hand, if a president were to pressure another country to do something for the purpose of damaging a rival and without any benefit to American interests, that would be bad. That would be asking for foreign interference in an American political campaign, not foreign assistance in the advancement of American foreign-policy objectives.\n\nAdvertisement\n\nNevertheless, there is a difference between bad and impeachable. On Ukraine, I’m not even sure what we’re dealing with is all that bad, much less impeachable.\n\nI have never been impressed by the Trump defense that the whistleblower complaint was based on secondhand information. I have always assumed, for argument’s sake (and, increasingly, because it appears to be true), that the president slow-walked defense aid to pressure Ukraine both to assist the Barr investigation and to probe Biden’s activities in Ukraine. On the latter, I am referring to Biden’s extortion of Kyiv to fire a prosecutor who may have been investigating Burisma, an energy company that, under circumstances that smack of self-dealing, retained Biden’s son on its board.\n\nThat is, I have assumed that Trump was pressuring Ukraine, and that any attendant quid pro quo was mostly proper (assistance in the Barr investigation) and partially suspect.\n\nAdvertisement\n\nAdvertisement\n\nAs I have previously contended, Democrats and other Trump detractors seek to discredit the Barr investigation into the origins of the Trump-Russia investigation by claiming that Trump was only seeking Ukrainian assistance that would help him politically. To the contrary, the Barr investigation, despite media-Democrat disdain for it, is a legitimate Justice Department probe that is in America’s interests since it is exploring serious allegations of abuse of power.\n\nThe fact that the Barr investigation could advance Trump’s political interests and harm Democrats is collateral. In fact, the investigation could also harm Trump and help Biden if it uncovers that abuse-of-power claims are exaggerated or wrong. That, too, is beside the point. In terms of U.S. interests, it was perfectly appropriate for an American president to pressure Ukraine to assist an American investigation — the fact that this involved a quid pro quo and can be seen as extortionate is unremarkable.\n\nAs for asking for assistance on Biden and Burisma, that is more complicated. I stipulate that it strains credulity (to put it mildly) for President Trump to claim that he was just interested in combating corruption, not in the 2020 political ramifications. That said, I am assuming that part of the Barr investigation involves Obama-administration pressure on Ukraine to pursue an investigation of Paul Manafort that was likely to harm Trump’s campaign.\n\nAdvertisement\n\nIf that is so, then the Biden/Burisma angle is relevant to Barr’s probe. Wholly apart from Hunter Biden, if investigators are looking into whether the Obama administration influenced Ukraine to investigate a Trump-campaign official, it would be probative to show that Ukraine was so beholden to the Obama administration that Biden was able to pressure Kyiv to fire a prosecutor.\n\nWould it have been better if Trump had not included Biden (and especially Hunter Biden) in the quid pro quo? Sure. If activities in Ukraine in 2016 are part of Barr’s investigation, then Trump should have just asked for assistance to Barr’s investigation and let the Justice Department sort out what, if any, pertinence Biden has to that inquiry.\n\nBut to say the inclusion of Biden in the quid pro quo was not just inappropriate but impeachable is ridiculous.\n\nThe same people who are screaming about Biden and quid pro quo are indifferent to the undeniable fact that the Obama administration sought and obtained the assistance of foreign governments and intelligence services in the investigation of Trump’s campaign. When it comes to Trump, they would treat a comparatively minor impropriety as a hanging offense; when it comes to Obama, they want to pretend the collusion with foreign governments to interfere in the campaign didn’t happen – or excuse the whole thing because, in their minds, Trump is a monster (but don’t you dare question Good Ol’ Joe).\n\nAnd you want to talk corrupt quid pro quo? Obama traded ransom payments and billions in sanctions relief in order to get a nuclear deal that enriched Iran, the world’s leading state sponsor of anti-American terrorism, and gave that regime a straight-line path to becoming a nuclear power. He traded five Taliban commanders for a deserter while the Taliban continued to fight against and kill American and allied troops.\n\nYou want to ignore every Obama quid pro quo that patently harmed national security, but we’re supposed to find high crimes and misdemeanors because Trump, in the course of pressuring Ukraine to assist a Justice Department investigation, also pressured Ukraine to look into potential corruption by a political rival. Not, mind you, to invent an allegation against Joe Biden out of whole cloth, but to see if there is fire under what sure looks like smoke.\n\nNo way. If people are deeply offended by President Trump’s machinations, they should vote against him in November 2020. That would be a reasonable response, especially after the president doubled down on the Biden overreach by suggesting that the loathsome anti-American regime in China should investigate the Bidens, too (Trump allies plausibly say he was joking; as any Hong Konger can tell you, it’s nothing to joke about). That said, it insults the intelligence, particularly after years of trumped-up Russian-collusion hysteria, to pretend that what the president has done here is singular, unprecedented, and impeachable.", "description": "A president’s management of foreign policy and his political interests naturally overlap.", "authors": ["Andrew C. Mccarthy", "David French", "Matthew Continetti", "Brian Stewart", "George Will", "Kyle Smith", "Jack Crowe", "Rich Lowry", "Jonah Goldberg", "Read More"], "top_image": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2019/09/zelenskiy-trump.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-07"}