{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/oct/22/kirstjen-nielsen-summit-family-separation-policy", "downloaded_at": "2019-10-23 08:44:10.360498+00:00", "title": "‘I don’t regret enforcing the law’: Nielsen defends family separation at summit", "language": "en", "text": "In a heated 15-minute public interview, the former US homeland security secretary defended her decision as protests raged outside\n\nThe former US homeland security secretary, Kirstjen Nielsen, repeatedly defended her decision to separate thousands of children from their parents at the southern border, in her first public interview since she resigned in April.\n\nAt Fortune magazine’s Most Powerful Woman summit in Washington DC on Tuesday, the PBS NewsHour correspondent Amna Nawaz asked Nielsen four times if she regretted signing off on the family separation policy, before Nielsen responded: “I don’t regret enforcing the law.\n\n“What I do wish had worked better were the coordination and information flow were simply insufficient for that number of people coming,” she continued. “It’s heartbreaking that any family felt at any time that they had to cross the border illegally because it is a terrible, dangerous journey.”\n\nHomeland security chief defends Trump's plan to send troops to border Read more\n\nDuring Nielsen’s 16-month tenure, more than 2,600 children were separated from their parents after crossing the US-Mexico border, without adequate systems in place to track or reunite families after parents were released from detention.\n\nIn January, the US health department’s watchdog said thousands more children may have been separated before the Justice department issued its “zero tolerance” policy change, which allowed for mass separation of families at the border.\n\nNielsen’s appearance at the event prompted Hillary Clinton, documentarian Dream Hampton and singer-songwriter Brandi Carlile to drop out of the summit. It also inspired protests outside the conference, which was attended by people who paid a $13,500 fee to join Fortune’s Most Powerful Women membership.\n\nAt the end of the heated 15-minute interview, Nielsen said she had originally come to the event to discuss cybersecurity, her area of expertise. PBS’s Nawaz, however, was relentless in holding Nielsen to account for her role in family separation.\n\nNawaz pressed Nielsen on reports that staff in her own department and the health department, which took custody of the separated children, raised concerns about family separation.\n\nNielsen denied being told by staff that family separation could harm children and deflected a follow-up question about warnings from child welfare experts, which were made public months before zero tolerance was implemented.\n\nThe former secretary of state and 2016 presidential candidate, Clinton, said a scheduling conflict prevented her from attending the summit, though sources told reporters that Nielsen’s appearance at the event was crucial to her deciding not to attend.\n\nHampton, executive producer of the documentary Surviving R Kelly, pulled out of the event last week and said: “When every infant, toddler, child and teenager Nielsen is responsible for ripping from their families is released and reunited, when attempts at restitution are made, then perhaps she can face one of them for a public ‘interview’.”\n\nThe rebellion against Nielsen’s appearance at the forum was led by Credo Action, a progressive activist group, which organized multiple protests to target Nielsen with immigration groups Families Belong Together and Define American.\n\nAt the conference on Tuesday, Credo Action drove a van with a billboard featuring Nielsen’s face and the words: “Powerful women don’t put kids in cages”. The group also tried to hand conference attendees pamphlets explaining why they opposed Nielsen speaking at the event and encouraged people to protest with signs inside the conference.\n\nEarlier this month, Nielsen’s successor, Kevin McAleenan, walked out of an immigration conference in Washington without delivering his scheduled speech when multiple protesters, including some from Credo, chanted over him. He resigned four days letter.\n\nAlison Klooster, a Fortune spokeswoman, said they brought in Nawaz to do the interview with “the clear understanding that this would be a no-holds-barred interview”.\n\n“We believe that the most powerful women in business, who also happen to be some of the most powerful women in the world, have strong views about how the US administration has handled its immigration policy,” Klooster said in an email. “We sought out an opportunity to bring the woman who was effectively responsible for that policy to ask her tough questions publicly and on stage about that policy.”\n\nThe interview was bookended by Fortune moderators who acknowledged the controversy surrounding Nielsen’s appearance and that the interview had been “tense”.", "description": "In a heated 15-minute public interview, the former US homeland security secretary defended her decision as protests raged outside", "authors": ["Amanda Holpuch"], "top_image": "https://i.guim.co.uk/img/media/98a944d4397fce5bd516757fe044635ccf88a573/446_358_4065_2439/master/4065.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0d57356fc9de5d4b74c6c0073b3a42a0", "published_at": "2019-10-22"}