{"pub": "euronews", "url": "https://euronews.com/2019/08/16/russia-plane-emergency-landing-the-pilots-didn-t-make-a-single-mistake", "downloaded_at": "2019-10-09 01:07:31.094338+00:00", "title": "Russia plane emergency landing: 'The pilots didn't make a single mistake'", "language": "en", "text": "After the emergency landing of a passenger plane in a cornfield near Moscow, the two pilots have received top honours for courage and heroism.\n\nPresident Vladimir Putin ordered captain Damir Yusupov and co-pilot Georgy Murzin be given Russia's highest state award, the Hero of Russia, said the Kremlin on Friday. He granted the Order of Courage, another top state award, to five crew members.\n\nThe plane took from Moscow's Zhukovsky International Airport with 233 people on board, bound for Simferopol in Crimea.\n\nIt hit a flock of gulls shortly after take-off, disrupting its engines, and requiring an emergency landing in a field.\n\nMore than 70 passengers were treated for injuries.\n\nRussia's natural resources watchdog said on Thursday it had identified an illegal rubbish dump roughly two kilometres from Zhukovsky airport, which is southeast of Moscow, as being the possible home of the birds which caused the emergency landing.\n\n\"I did what I had to do,\" said Yusupov who guided the Airbus down. \"I saved the plane, the passengers, the crew. I think that was the only decision. I don't think I'm a hero.\"\n\n\"I wasn't scared,\" he told reporters in Yekaterinburg where Ural Airlines has its training centre. \"I saw the cornfield in front of me... I tried to minimise our vertical speed to ensure a soft landing.\"\n\nBut did the pilots really perform a spectacular emergency landing?\n\nAviation expert Vadim Lukashevich told Euronews that for such a stressful situation, the plane's pilots did avoid making any mistake when landing the aircraft.\n\n\"The pilots did not have any room for manoeuvre,\" he said. \"They were lucky because they landed in the field where there were no buildings. But still, they worked in an extreme situation and did not make a single mistake. At least I did not notice a single error.\"\n\nLukashevich added pilots are seldom trained on simulators for situations when the aircraft has already taken off but has to make an emergency landing because its engines have stalled.\n\nBut the pilots still managed to do everything well according to Lukashevich: \"The plane landed smoothly, did not hit anything, did not collapse, nothing fell off of it. It did not roll over despite the fact that it was completely full of kerosene.\"\n\nThe aviation expert also highlighted that the evacuation of passengers went really well for the kind of situation.\n\nAre aeroplanes protected against birds?\n\nLukashevich said that the very design of an aircraft protects it from birds: \"The cockpit glazing undergoes special tests for collisions with birds in flight. But in this case, the birds got into the engine, and the engine failed,\" he said.\n\nAccording to the expert, aeroplane engines are able to swallow small birds but since in this case, it was seagulls that got stuck, the engine could not handle the bigger species.\n\nThe main question is then why the birds appeared on the runway, said Lukashevich.\n\n\"This is the responsibility of the aerodrome. They must take certain measures to deter birds,\" he said adding this is an international problem.\n\n\"To solve it, technical means are used, birds are scared away with special signals - sound and frequency. Sometimes they even bring in birds of prey, falcons or golden eagles, which they train and disperse all other birds.\"\n\nHowever, the expert highlighted the problem here was the illegal landfill near Zhukovsky airport, which draws a lot of birds.\n\n\"They are at this airport both on the runway and in the parking lots. There it is a common occurrence and what happened today was going to happen sooner or later,\" said Lukashevich.\n\nHow dangerous are birds for an aeroplane?\n\n\"When a bird — or any other object for that matter — strikes the working engine, the engine is set to break down, so this is always an extreme situation,\" said Lukashevich.\n\nHow would you rate safety in passenger transportation in Russia?\n\n\"Last year statistics said that in general, the safety of civil air transportation in Russia, which is calculated on the number of passengers per kilometre, is much worse than in the United States, Europe and even China. The accident rate, by the number of victims, puts Russia at the very bottom world statistics,\" said Lukashevich.\n\nThe aviation expert noted there was a systemic crisis in civil aviation, adding that almost all of the recent accidents with human casualties were caused by pilot mistakes.\n\nLukashevich added that the lack of modern aircraft was also to blame.\n\n\"These are issues with supply and spare parts, questions to service on the ground,\" he said.", "description": "\"The pilots did not have any room for manoeuvre,\" said aviation expert Vadim Lukashevich. \"They were lucky because they landed in the field where there were no buildings. But still, they worked in an extreme situation and did not make a single mistake. At least I did not notice a single error.\"", "authors": [], "top_image": "https://static.euronews.com/articles/stories/04/09/31/60/1000x563_cmsv2_ffb7fd47-dc80-5aae-b451-543bb6f1b2d3-4093160.jpg", "published_at": "2019-08-16"}