{"pub": "npr", "title": "California Power Provider PG&E Files For Bankruptcy In Wake Of Fire Lawsuits", "url": "https://npr.org/2019/01/29/689591066/california-power-provider-pg-e-files-for-bankruptcy-in-wake-of-fire-lawsuits", "language": "en", "published_at": "2019-01-29", "downloaded_at": "2019-09-02 07:14:40.262594+00:00", "text": "California Power Provider PG&E Files For Bankruptcy In Wake Of Fire Lawsuits\n\nEnlarge this image toggle caption Josh Edelson/AFP/Getty Images Josh Edelson/AFP/Getty Images\n\nUpdated at 1:03 p.m. ET\n\nFaced with billions of dollars in potential liabilities from two years of devastating Northern California wildfires as well as the specter of future catastrophic blazes, California's Pacific Gas and Electric, one of the nation's largest utilities, filed for Chapter 11 bankruptcy protection on Tuesday.\n\nThe state is investigating PG&E's culpability in November's Butte County fire that killed at least 86 people and incinerated some 14,000 homes and buildings in and around the town of Paradise, Calif.\n\nThe utility says it has no choice but to file for Chapter 11 given the flood of lawsuits and wildfire liabilities it estimates could be up to $30 billion. Ratings agencies have reduced its stock to \"junk\" status.\n\n\"We are fully committed to enhancing our wildfire safety efforts, as well as helping restoration and rebuilding efforts across the communities impacted by the devastating Northern California wildfires,\" Interim CEO John Simon said in a statement. \"To be clear, we have heard the calls for change and we are determined to take action throughout this process to build the energy system our customers want and deserve.\"\n\nChapter 11 \"is really the best way to deal comprehensively with all the liabilities they have,\" says University of California, Berkeley, law professor Ken Ayotte, an expert on corporate bankruptcy.\n\nThe bankruptcy of the state's largest utility is an early test for the new governor. Gavin Newsom released a statement today, saying the bankruptcy filing does not change his focus, \"which remains protecting the best interests of the people of California. My administration will continue working to ensure that Californians have access to safe, reliable and affordable service, that victims and employees are treated fairly, and that California continues to make forward progress on our climate change goals.\"\n\nA key hurdle for the company: In California, utilities can be held liable for wildfire damages if the company sparked the blaze regardless of whether they're found negligent.\n\nEnlarge this image toggle caption Alisa Barba/NPR Alisa Barba/NPR\n\nPG&E got a rare bit of good news last week when the state's fire agency said in a report that it does not think the company's equipment started a massive 2017 fire in wine country, which killed 22 people and did an estimated $10 billion in damage.\n\nBut that report is not the final word. And company still faces scores of lawsuits from other fires that year.\n\nIn addition, the state is still investigating whether PG&E is liable for 2018's Camp Fire, the deadliest and most destructive blaze in state history.\n\nAyotte says the utility has to show Wall Street that the damages will come to an end through bankruptcy. \"It's really the only way for putting some kind of cap on the liabilities that come from these fires. It's going to continue to hang over their heads until they address it. So I think Chapter 11 makes a lot of sense here.\"\n\nBut to many fire victims, it doesn't make sense.\n\n\"When PG&E says, 'Oh safety is our most important priority.' No it's not. Their only priority is profits and more profits,\" says attorney Mike Danko, one of the many lawyers representing wildfire victims suing PG&E.\n\nDanko sees bankruptcy as a PG&E maneuver to get around paying for what he calls the company's long history of negligence and ineptitude, a history that Danko believes shows that PG&E is too big and too poorly managed to survive bankruptcy as is.\n\n\"Why do we have a for-profit company running a utility? You have to ask whether that model even works,\" he says.\n\nMeantime, Danko's clients are asking whether they'll get paid what they had hoped for if PG&E is found liable for starting the fire that destroyed their homes.\n\nBankruptcy expert Ayotte says given the pecking order of bankruptcy, fire survivors have reason to worry.\n\n\"The bankruptcy process says everyone gets paid fairly in accordance with their priority. But if you're an unsecured creditor — like a fire damage victim — it may mean that what comes out of the bankruptcy process may not mean 100 cents on the dollar in terms of full recovery.\"\n\nIt would likely then fall to the state legislature — and, by extension, taxpayers and ratepayers — to fill any gap and make fire victims whole.\n\nCalifornia State Sen. Bill Dodd called for a change in leadership and culture at PG&E.\n\n\"Given its track record of obfuscation and mismanagement, I'm not surprised PG&E claims it can no longer meet its financial obligations,\" he said in a statement. \"It's extremely disappointing and underscores the need for change at PG&E in both its leadership and culture. Wildfire victims shouldn't have to deal with the uncertainty this causes, which in many respects re-victimizes them.\"\n\nCalifornia Attorney General Xavier Becerra called the filing \"a significant and unwelcome development\" and said the state's Department of Justice is \"prepared to protect the interests of the people of this great State.\"\n\nThere is no political appetite, as yet, for the state to step in or to take over some or all of the company's functions.\n\nBut some cities appear hungry. San Francisco's mayor has asked the city's Public Utilities Commission to explore buying PG&E's electricity assets and infrastructure in the city and transitioning to a public power supply.\n\nNPR first reported that PG&E has detailed plans underway to sell off its natural gas arm and potentially key real estate assets and use the proceeds to set up a wildfire compensation fund.\n\nWhether those plans move forward will now be up to a federal bankruptcy judge.\n\nThe advocacy group The Utility Reform Network voiced concern that ratepayers will be forced to pick up some of the costs of the company's reorganization.\n\n\"The message to customers is really bad here. It's that we're more concerned with our shareholders than we are with our customers,\" said communications director Mindy Spatt.", "description": "The utility is facing billions of dollars in legal liability for fires caused by its equipment. PG&E filed for Chapter 11 bankruptcy, which would let it restructure its debts.", "authors": ["Eric Westervelt", "Matthew S. Schwartz"], "top_image": "https://media.npr.org/assets/img/2019/01/29/gettyimages-1059690148_wide-a0c8d25f382f93e6638921b169fb5791aa95b1b2.jpg?s=1400"}