{"pub": "washingtonpost", "url": "https://washingtonpost.com/outlook/five-myths/five-myths-about-mike-pence/2019/10/11/5f8adb6c-e9f8-11e9-9306-47cb0324fd44_story.html", "downloaded_at": "2019-10-13 00:21:36.373359+00:00", "title": "Five myths about Mike Pence", "language": "en", "text": "In the very unlikely event that the impeachment inquiry underway in the House leads to President Trump’s removal from office by the Senate, Vice President Pence would ascend to the Oval Office. Pence remains one of the least-understood figures of the Trump administration — even as he quietly lays the groundwork for his own future presidential bid. Pence has long been a master at stealth campaigning. Here are five myths that have helped enshroud him.\n\nMyth No. 1\n\nHe's a theocratic ideologue.\n\nPence has called himself “a Christian, a conservative and a Republican — in that order” since his radio show started to take off a quarter-century ago. That, in conjunction with his ardent and persistent focus on issues like abortion and same-sex marriage, has led some detractors to dub him a theocrat: someone who lets religion dictate his decision-making.\n\nBut his most reliable political dogma isn’t about God; it’s about winning — and the latter trumps the former. In 2011, when he returned to Indiana for his successful race for governor, he dropped his image as a Washington culture warrior and tea party ally and pitched himself as the continuation of then-Gov. Mitch Daniels, a technocratic Republican who eschewed hot-button social battles, at least in public. Four years later, when critics painted Pence as the national face of anti-gay bigotry after he signed a law allowing businesses to cite religious objections to discriminate against LGBTQ customers, he faced a decision. Moderates and business leaders wanted him to veto the bill for fear it would crush Indiana’s nascent tech economy. Pence stood firmly with his Christian-right supporters — until Republican billionaire and megadonor Paul Singer phoned Pence and threatened to withhold financial support unless he backed down. Pence’s team had been courting Singer (who would go on to bankroll Sen. Marco Rubio of Florida in the 2016 GOP presidential primaries) for five years. Faced with the prospect of losing a huge cash boost in the future, the governor turned quietly and supported a “fix” that explained that the state would not allow discrimination. The fix passed, and he signed it into law.\n\nMyth No. 2\n\nHe's the shadow president\n\n(or a glorified coat rack).\n\nSome Pence observers suspect that he secretly controls vast swaths of the administration. A Politico article this year argued that he essentially runs an entire agency, the Department of Health and Human Services, staffed to the brim with powerful Hoosiers. Newt Gingrich called Pence, early in the administration, more influential than senior aides like Jared Kushner (the president’s son-in-law) and then-economic adviser Gary Cohn. Or there’s the opposite caricature: According to Bob Woodward’s recent book, Cohn wanted Pence to oppose tariffs pushed by Trump, but the vice president largely avoided the fight. He was lampooned as an “elf on the shelf” during a White House showdown between Trump and top congressional Democrats last December.\n\nBoth depictions are exaggerations. If Pence were the secret steward, Trump would be pushing free-trade measures, limiting spending and taking a hard line on traditional U.S. adversaries like Russia. Instead, the president has sent Pence to sell a reworked version of NAFTA, left him to defend trillion-dollar budget deficits and forced him to carry messages to Ukraine’s president, apparently threatening to withhold aid meant to protect against Russia’s incursions. But Pence is not always a bystander, either: In one attempt to change Trump’s mind without angering him, Pence invited former senators Dick Lugar (R-Ind.) and Sam Nunn (D-Ga.) to his office to discuss nuclear disarmament before Trump’s 2018 trip to negotiate with North Korean dictator Kim Jong Un in Singapore, Lugar told me. (Trump listened for 20 minutes but didn’t appear to pay much attention, Lugar said.)\n\nMyth No. 3\n\nHe's ready to push Trump\n\noff the cliff.\n\nIn the heat of Robert Mueller’s investigation of Russian interference in the 2016 election, some Trump advisers believed that Pence was trying to get the president ousted. Trump himself questioned whether he could trust his vice president, according to a New York Times report. When an anonymous aide wrote an unsigned op-ed in the Times last year claiming to be part of a “resistance” in the administration, speculation turned to Pence because the author had used one of his favorite words, “lodestar,” throughout the piece. (Pence fiercely denied any involvement.)\n\nBut Pence has already faced the perfect opportunity to ditch Trump and grab the crown, and he didn’t do it. After The Washington Post published the “Access Hollywood” video in October 2016, Pence’s chief political aide, Marty Obst, was flooded with calls: The Republican National Committee was prepared to replace Trump as the nominee with Pence. Obst didn’t even need to think about it; Pence was supporting Trump no matter what. Pence and his team knew that Trump had an iron grip on the GOP base, and killing the king would not have been a good setup for 2020, when Pence planned to run against President Hillary Clinton after a Trump loss in 2016. Trump’s upset victory a month later didn’t change the Pence team’s thinking about 2024. To win, Pence needs the support of the president and his base, which is why pushing Trump off a cliff would be career suicide.\n\nMyth No. 4\n\nHe believes he's predestined\n\nto be president.\n\nThe authors of one biography argued that Pence believes God has lit a path for him that ends in the Oval Office, citing Pence’s favorite verse, Jeremiah 29:11, as evidence of his surety. “For I know the plans I have for you,” God tells the prophet. “Plans to prosper you and not to harm you, plans to give you hope and a future.” A detailed profile in the Atlantic cited the same verse to show that Pence believes God is clearing a path for his ascension to the presidency.\n\nBut the key to understanding the line in Pence’s life story came in 1999, when Karen Pence had it framed for him. They were about to uproot their family to relocate to a different House district and start living on debt so he could make a third run for Congress after two previous losses. The verse isn’t a guarantee that Pence will make it to the White House; it’s a promise that if he and his family remain faithful, keep their heads down and do the work, God will provide for them.\n\nYes, Pence talked about becoming president in grade school. But by adulthood, that dream had been tempered into something more practical: making it to Congress. His focus on the White House didn’t start until after the 2008 election, when he was brought under John Boehner’s wing in the House Republican leadership and was actively courted by movement conservatives to run in 2012. This was when Pence’s actions started taking on a more strategic and decidedly political tone, with the presidency as the end goal.\n\nMyth No. 5\n\nHe hates gay people.\n\nPence is often seen as the face of anti-gay bigotry. John Oliver parodied a children’s book about bunny rabbits by Pence’s daughter Charlotte with a version about two male bunnies in love. A gay U.S. Olympian refused to meet with Pence at the Winter Olympics last year. LGBTQ activists decried Karen Pence after she began teaching art at a conservative Christian school that bans LGBTQ people from working there. (The Pences responded by saying they were being targeted for discrimination based on their faith.)\n\nPence may indeed overlook the way his policies affect gay people — as indicated by his righteousness on the issue of religious freedom, where he decries discrimination not against LGBTQ folks but against Christian-right activists. Veteran Indiana LGBTQ activist Rick Sutton noted that Pence’s conservative Christian friends have never committed suicide because of their religion. Sutton cried as he remembered his friends who took their lives in the 1990s, a time when Mike and Karen Pence were actively fighting gay rights and supporting groups that described homosexuality as a sin. One veteran Indiana Republican who is a fellow Christian conservative described Pence’s stance on gay rights this way: “Love the sinner, hate the sin.”\n\nBut does all that mean he is personally anti-gay? His friends and advisers say no. To prove the point, the U.S. ambassador to Germany, Ric Grenell, a gay conservative Republican, said he and his partner have been warmly accepted by the Pences in person: “Mike and Karen are great people, they’re godly people, they’re followers of Christ. They don’t have hate in their heart for anyone. They know my partner. They have accepted us.” A White House spokesman argued that Pence was not “anti-gay” because of a cordial meeting he had with Irish Prime Minister Leo Varadkar and his gay partner last month.\n\nFive myths is a weekly feature challenging everything you think you know. You can check out previous myths, read more from Outlook or follow our updates on Facebook and Twitter.", "description": "He’s neither the shadow president nor a mere bystander.", "authors": ["Tom Lobianco", "Tom Lobianco Is A Political Reporter In Washington", "The Author Of"], "top_image": "https://www.washingtonpost.com/resizer/Qh_-ZGeqJ4CVYfg27fIuvAJV7h4=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PGQYKTEO4QI6TNXUAMZVMUBNZY.jpg", "published_at": "2019-10-11"}