{"pub": "yahoo", "url": "https://news.yahoo.com/supreme-models-book-honors-trailblazing-black-models-dont-081652148--abc-news-topstories.html", "downloaded_at": "2019-10-16 08:32:09.230559+00:00", "title": "'Supreme Models' book honors trailblazing black models: 'I don't know why this is the first'", "language": "en", "text": "'Supreme Models' book honors trailblazing black models: 'I don't know why this is the first' (ABC News)\n\n'Supreme Models' book honors trailblazing black models: 'I don't know why this is the first' originally appeared on goodmorningamerica.com\n\nBeing a change-maker is always in fashion, and that's what Marcellas Reynolds is.\n\nThe first-time author is behind \"Supreme Models: Iconic Black Women Who Revolutionized Fashion,\" the first photography book devoted to black models.\n\n\"I don't know why this is the first and I don't know why I'm the guy that did this,\" Reynolds told \"Good Morning America.\" \"There's tons of books out there about models, and they think that including two or three black models is enough, and it is not.\"\n\n(MORE: Leomie Anderson is a Victoria's Secret angel -- and the sixth black model to get wings)\n\n\"Supreme Models\" features photos, essays and magazine covers of fierce black females such as Naomi Campbell, Iman and Veronica Webb. Reynolds describes his work as a much overdue appreciation of black models.\n\n\"'I've always been obsessed with models. I am the ultimate fan,\" Reynolds said. \"This book is a love letter to some incredible women who inspired me when I was a child and in my teenage years. Those girls and their pictures inspire you to dream.\"\n\nReynolds -- who is a stylist, host and former model himself -- relates to these women on a completely different scale.\n\nAs a child, Reynolds dreamed of runways, fashion and the editorial lifestyle he is now living but never thought he'd be able to achieve.\n\n(MORE: Zendaya's Tommy Hilfiger show features iconic all-black model lineup)\n\n\"This book is for 10-year-old Marcellas, who was bullied and didn't have any friends because he was a gay kid,\" Reynolds said. \"He would read Ebony and Jet from cover to cover because he just wanted something more.\"\n\nReynolds' latest work may have been eight years in the making, but the stories featured in the book span more than 70.\n\n(MORE: 5 reasons why women are opting for knotless box braids)\n\n\"When I set out to write \"Supreme Models,\" it wasn't supposed to be what it turned into,\" Reynolds explained to \"GMA.\" \"It was supposed to be a beautiful book about beautiful women, and it really is the history of black models in advertising, in fashion, in America, in the world.\"\n\n\"Supreme Models\" is as historical as it is visual. From the first black supermodel to the first black model on the covers of Glamour and Life magazines, the women featured exhibit true model behavior. Here are a few highlights.\n\nGrace Bol\n\nPHOTO: Grace Bol, photographed by Kuba Ryniewicz, VoguePoland, April 2018. (Kuba Ryniewicz for VoguePolska via Abrams) More\n\nBol comes alive both on camera and off. She went from refugee to runway after fleeing South Sudan's civil war. She's best known for walking the 2017 and 2018 Victoria's Secret Fashion Show.\n\n\"Each photo has a story,\" explained Reynolds. \"What's amazing about this one for me is that when I reached out to the photographer, he was so honored to be in the book.\"\n\nRose Cordero\n\nPHOTO: Rose Cordero, photographed by John-Paul Pietrus, Arise, Spring 2011. (John-Paul Pietrus via Abrams) More\n\nReynolds writes: \"There must be something in the water in the Dominican Republic that produces so many stunning models.\"\n\nCordero made her debut walking for Burberry in 2009 and the cover above is from the African magazine Arise.\n\n\"That was something that was very important to me, to include black magazines,\" Reynolds said. \"You're going to see magazines like Vogue, you're going to see Harper's Bazaar, but you're also going to see magazines that are sort of for the culture.\"", "description": "Being a change-maker is always in fashion, and that's what Marcellas Reynolds is.  The first-time author is behind \"Supreme Models: Iconic Black Women Who Revolutionized Fashion,\" the first photography book devoted to black models.", "authors": ["Brittany Berkowitz"], "top_image": "https://s.yimg.com/uu/api/res/1.2/iOr9IuCvrkTl3SGhdCsNvw--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.gma.com/super-models-1-ht-ps-ht-ps-191010-_hpMain_16x9_992.jpg", "published_at": "2019-10-16"}