{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7547901/Dan-James-insists-handle-playing-Manchester-United-poor-form-continues.html", "downloaded_at": "2019-10-07 23:38:28.991539+00:00", "title": "Dan James insists he can handle playing for Manchester United as their poor form continues", "language": "en", "text": "Daniel James insists he is tough enough to handle the strain of top-level competition amid Manchester United's woes.\n\nThe forward has joined up with Wales ahead of Euro 2020 qualifiers with Slovakia and Croatia following a positive personal start to the campaign with his club - despite their slump to 12th in the Premier League.\n\nJames, 21, has quickly become a key player for both club and country and insists the pressure of representing both does not worry him.\n\nManchester United winger Daniel James has backed himself to perform at struggling United\n\nHe said: 'In the Premier League this season a lot of clubs have young squads showing what they can do. I've always dealt with things in exactly the same way.\n\n'It was the same when I was at Swansea and things weren't going so well.\n\n'It's important in football to react when things aren't going so well. It's alright when things are going good, but it's important to deal with things when it's bad.'\n\nThe Welshman scores his side's first goal in United's home game against Crystal Palace\n\nJames has been a bright spark in an otherwise disappointing season for the Red Devils\n\nManchester United are enduring their worst start to a Premier League season in 30 years\n\nJames has been one of the young stars of the Premier League this term and, given he was born in Beverley, near Hull, he would have been eligible for England.\n\nBut the former Swansea player, whose father was Welsh, revealed he was never chased by the country of his birth.\n\nHe added: 'He took me to a camp in north Wales when I was 12. Ever since then I've always played for Wales age groups growing up. I can't say England have ever tried to pick me.'", "description": "The forward has joined up with Wales ahead of Euro 2020 qualifiers with Slovakia and Croatia following a positive personal start to the campaign with his club.", "authors": ["Tom Collomosse For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/22/19414206-0-image-a-4_1570482503660.jpg", "published_at": "2019-10-07"}