{"pub": "yahoo", "url": "https://sports.yahoo.com/ap-source-ex-mets-manager-callaway-joining-angels-020846468--mlb.html", "downloaded_at": "2019-10-28 04:32:03.606048+00:00", "title": "AP Source: Ex-Mets manager Callaway joining Angels", "language": "en", "text": "ANAHEIM, Calif. (AP) -- Former New York Mets manager Mickey Callaway will be the Los Angeles Angels' next pitching coach, a person familiar with the decision said.\n\nThe person spoke on condition of anonymity Sunday night because the Angels haven't announced the hiring.\n\nThe person also said veteran coach John Mallee will join the staff of new Angels manager Joe Maddon.\n\nScroll to continue with content Ad\n\nCallaway was fired Oct. 3 after going 163-161 in two seasons in charge of the Mets. New York made a nine-game improvement in the standings this season to finish 86-76, but it wasn't enough to secure a playoff spot or to save Callaway's first managerial job.\n\nBefore joining New York, Callaway spent five successful seasons as the Cleveland Indians' pitching coach. Cleveland's pitchers led the AL in strikeouts in each of his final four seasons in charge, and his staffs were the backbone of five consecutive winning teams during his tenure, including the 2016 AL champions.\n\nCallaway won a World Series ring as a pitcher for the Angels in 2002, although he didn't appear in any postseason games. He was the Halos' fifth starter down the stretch of the regular season.\n\nMallee was the Cubs' hitting coach for three seasons under Maddon, including their World Series championship season in 2016.\n\nHe was Phillies manager Gabe Kapler's hitting coach for the past two seasons until Philadelphia fired him in August. Mallee also has been a hitting coach for the then-Florida Marlins and the Houston Astros.\n\n---\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP-Sports", "description": "Former New York Mets manager Mickey Callaway will be the Los Angeles Angels' next pitching coach, a person familiar with the decision said.  The person spoke on condition of anonymity Sunday night because the Angels haven't announced the hiring.  The person also said veteran coach John Mallee", "authors": ["Greg Beacham", "Ap Sports Writer"], "top_image": "https://s.yimg.com/ny/api/res/1.2/mqiWYxeGd0UXo8Zix3UeBA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwMjQ7aD02ODI-/https://s.yimg.com/uu/api/res/1.2/par.5W0KVx2P5hCtKfqKKw--~B/aD0zNDE7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201910272127772781938", "published_at": "2019-10-28"}