{"pub": "cnn", "url": "https://cnn.com/2019/10/22/health/always-period-gender-symbol-removed-transgender-nonbinary-trnd/index.html", "downloaded_at": "2019-10-22 15:10:06.401345+00:00", "title": "Always is taking the female symbol off its packaging to be inclusive of transgender and nonbinary customers", "language": "en", "text": "(CNN) Always sanitary products will remove the Venus symbol, historically used to represent the female sex, from its products to be inclusive of transgender and nonbinary customers.\n\nTransgender activists and allies had publicly urged Proctor & Gamble to redesign its pad wrapper without the gender symbol, a circle atop a cross. Among their arguments were that not all people who menstruate are women and that not all women menstruate.\n\ntw// periods\n\n\n\nhi @Always i understand that you guys love girl positivity but please understand that there are trans men that get periods, and if you could please do something about the ♀️symbol on your pad packaging, i'd be happy. i'd hate to have any trans males feel dysphoric. — jocelyn ✰ (@phiddies) October 13, 2019\n\n\"For over 35 years Always has championed girls and women, and we will continue to do so,\" Proctor & Gamble said Tuesday in a statement. \"We're also committed to diversity & inclusion and are on a continual journey to understand the needs of all of our consumers.\"\n\nGetting periods can be a dysphoric experience for transgender and nonbinary people , especially because of the way that periods are generally discussed and addressed as something that only happens to people who are assigned women at birth.\n\nRead More", "description": "The company made the decision after transgender activists and allies began asking the company why the gender symbol on its pads packaging was necessary.", "authors": ["Elizabeth Wolfe", "Michelle Krupa"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191022092553-always-pads-restricted-super-tease.jpg", "published_at": "2019-10-22"}