{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7594921/Kmart-Australia-launching-new-version-sell-foldable-beach-trolley.html", "downloaded_at": "2019-10-21 05:38:51.814634+00:00", "title": "Kmart Australia is launching a new version of sell-out foldable beach trolley", "language": "en", "text": "Delighted mums across Australia are celebrating the news that Kmart's foldable beach trolley is back - and it's bigger and better than before.\n\nA photo of the new version, priced at $89, was recently posted to a Facebook page dedicated to the store by an eagle-eyed shopper.\n\nThe updated model comes complete with a covered canopy, handles at both ends and an extra storage compartment.\n\nKmart's original version of the foldable beach trolley, priced at $49, became an instant sell-out when it hit store shelves two years ago.\n\nA bigger and better version of Kmart's foldable beach trolley, priced at $89, is set to make its debut on store shelves\n\nNews the latest model will soon be available has sent social media into overdrive with one post on Facebook generating over 5,000 reactions.\n\n'I love this idea. You always have so much crap to take down to the beach. Put the bucket and spade in along with bub and your set,' said one.\n\nAnother added: 'Kmart finally have the ones with covers now. The handle looks much sturdier than ours.'\n\n'This looks like a game-changer for when you have a tribe of grandkids to take to the beach,' a third said.\n\nNews the latest model will soon be available sent social media into overdrive with one post generating over 5,000 reactions (stock image)\n\nWhen Kmart's original beach trolley hit the market in 2017, shoppers flocked to the store to buy the $49 item.\n\nAt the time, it was described by those as being perfect for lugging towels, toys, and everything else a family needs for a nice day at the beach.\n\n'It's the best $49 I've ever spent,' mum Kristy Austin told Daily Mail Australia.\n\nKmart's original foldable beach trolley has been described as perfect for lugging towels, toys, and everything else a family needs for a nice day at the beach\n\n'We use it for everything from the farmers market to the beach to bringing the washing in from the line.'\n\nFellow mum Carly Allkin also found the trolley ideal for her family.\n\n'The beach trolley is fabulous,' she said. 'Very sturdy and great for family days out.'\n\nMany mums have discovered that the trolley is a perfect place to put their tots down for a nap\n\nAs well as being used as a way to carry essential items for a family day out, some said they'd added extras to convert the trolley to a handy sleeping space.\n\nMum-of-four Lynn Cleave said she discovered with the addition of a few towels, the trolley could into a sand-free sleeping nook for a tired five-month old.\n\n'My husband came up with the genius idea to empty the beach cart, pad it with a couple of towels and make a handy little cot for him to lay in while he napped,' she told Kidspot.", "description": "Kmart Australia has just launched an updated version of its sell-out foldable beach trolley.  While the item costs $89, $30 more than the original, it comes with a covered canopy and extra storage.", "authors": ["Emilia Mazza For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/04/19974318-0-image-a-98_1571627326579.jpg", "published_at": "2019-10-21"}