{"pub": "townhall", "title": "‘Who Killed Garrett Phillips’ Review: HBO Doc Sheds Light On Small-Town Mystery", "url": "https://townhall.com/entertainment/johnhanlon/2019/08/01/who-killed-garrett-phillips-review--hbo-doc-sheds-light-on-smalltown-mystery-n2551037", "language": "en", "published_at": "2019-08-01", "downloaded_at": "2019-09-02 07:19:48.586897+00:00", "text": "The new HBO documentary Who Killed Garrett Phillips is more complicated than the title suggests. It’s true that the murder of an innocent 12-year old boy sets the two-episode tale in motion but the show isn’t about simply finding Phillip’s killer.\n\nIt’s about exploring justice, race and the prosecution of a man who the police fingered early on.\n\nThe crime itself was committed in a small New York community in October of 2011. Garrett Phillips, a young man who had arrived home moments earlier, was brutally strangled. Neighbors heard a commotion coming from the apartment but when the police and the landlord finally entered the apartment, the perpetrator had vanished. Because one of the window blinds was facing outward (and there was a crack in the building’s exterior), the assumption was that the assailant had jumped out of the window, avoiding detection.\n\nShortly thereafter, the police pinpointed a prime suspect: a black man who had once dated Phillips’ mother, Tandy Cyrus. Despite other prominent suspects (including another of Tandy’s ex-boyfriends, who happened to be a sheriff’s deputy), Clarkson University soccer coach Oral Hillary was treated as the prime suspect.\n\nThe program focuses on the crime early on but then follows the limited investigation. Like the investigation itself, the show zeroes in on Hillary and his possible role in the crime. Some of the documentary’s first interviews suggest that many believe that Hillary was responsible, creating the impression that the culprit is obvious (an impression that the police also seemed to have).\n\nAfter the series sets the stage for the audience to potentially believe in Hillary’s guilt, the program then dramatically transitions by introducing the man himself. Smartly twisting the audience’s mindset, the show then brings a whole new perspective into the story.\n\nHillary speaks out about his relationship with the victim’s mother and as the show progresses, plenty of questions arise about his treatment by the police and why he was chosen to be the focal point of the investigation. Was it about race? Was it about the fact that he had started dating a woman who was previously involved with the sheriff’s deputy? There are no easy answers and director Liz Garbus realizes that, bringing up obvious questions about why the criminal case was handled this way.\n\nThe show does feature opposing viewpoints and there are several people featured here who still insist that Hillary was the killer. When seen in that light, some of the actions of the police department can be seen as motivated by good intentions but many of those actions also raise serious and undeniable questions about the investigation.\n\nThe second part of the two-part documentary begins by focusing more on a civil case that Hillary brings against his small community. Although the town gets put under the radar, so too does Hillary. He testifies in the civil case, putting his own life under the microscope. Although the early investigation seemed painfully (and questionably) simple, Garbus’s strong direction ultimately shows how complicated the case eventually became.\n\nUndeniably, this two part documentary is difficult to watch. The details about the crime itself are heartbreaking. The ways in which the case was handled are shocking and surprising. There are no easy or clear resolutions at the end. However, the program captures the complicated case well and it carefully touches upon some sensitive subjects without becoming too preachy.\n\nWho Killed Garrett Phillips isn’t as clear-cut as its title suggests but it’s definitely worth a look.", "description": "The new HBO documentary Who Killed Garrett Phillips is more .09/02/2019 3:19:48AM EST.", "authors": ["John Hanlon", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/images/2019/213/5ce6c227-cd95-49cf-839b-4ab58564488c.png"}