{"pub": "marketwatch", "url": "https://marketwatch.com/story/stock-market-set-to-climb-toward-records-on-busiest-day-of-earnings-season-2019-10-24", "downloaded_at": "2019-10-24 13:56:37.212134+00:00", "title": "S&P 500 climbs toward record on busiest day of earnings season", "language": "en", "text": "U.S. stock benchmarks on Thursday mostly rose toward all-time highs at the open, in a session that will mark the busiest day of the third-quarter earnings cycle and one that will see a key European central banker bid adieu in his final policy meeting of an eight-year tenure.\n\nHow are major indexes faring?\n\nThe Dow Jones Industrial Average DJIA, -0.22% fell 21 points, or less than 0.1%, at 26,811, after an initial burst higher at the open, those for the S&P 500 index SPX, +0.04% gained 6 points, or 0.2%, at 3,011, not far from its July 26 closing record at 3,025.86. The Nasdaq Composite Index COMP, +0.42% added 51 points, or 0.6%, at 8,170.\n\nOn Wednesday, the Dow rose 45.85 points, or 0.2%, to finish at 26,833.95, while the S&P 500 index added 8.53 points to reach 3,004.52 a gain of 0.3%. The Nasdaq Composite Index COMP, +0.42% advanced 15.50 points, or 0.2%, closing at 8,119.79.\n\nWhat’s driving the market?\n\nMarkets inched higher as a quartet of Dow components and some 45 of the S&P 500 index components deliver their latest quarterly update, with investors waxing somewhat sanguine after better-than-feared results from Tesla Inc. Microsoft MSFT, +1.57% and a number of other high-profile companies.\n\nInvestors, however, paid some attention to the final statements from European Central Bank President Mario Draghi, who delivered his final policy meeting in his tenure. His successor Christine Lagarde, the former International Monetary Fund chief, was in attendance at the policy meeting, Draghi confirmed at a news conference.\n\nRead: Draghi saved the euro, but leaves ECB at crossroads\n\nDraghi leaves Lagarde a fractious ECB that saw divisions over monetary easing measures embarked upon last month, including a recent spate of bond buying. European Central Bank left its main deposit facility rate at negative 0.5% and its main lending rate at 0%. The rate-setting Governing Council repeated that it expects to keep rates at “present or lower levels” until inflation, which has remained stubbornly low, “robustly” converges with its target of near but just below 2%. It also reiterated that it will begin a controversial bond-buying program at a pace of €20 billion a month beginning in November.\n\nThe ECB meeting comes ahead of the Federal Reserve’s two-day Oct. 29-30 policy meeting, where market participants are widely expecting a third consecutive interest rate cut of 25 basis points, as the central bank attempts to avert a slowdown that has gripped much of the developed world.\n\nIndeed, the German economy, the largest in the European Union, is continuing to struggle, new data released Thursday show, with the difficulties of its export-oriented base extending to the service sector as global trade dries up.\n\nThe IHS Markit flash German manufacturing PMI inched up to 41.9 in October from September’s decade-worst 41.7, which is still a reading that shows the factory segment of the country’s economy in dire straits. Readings below 50 indicate contraction.\n\nIn economic data, durable-goods orders dropped 1.1% last month, the government said Thursday. Economists surveyed by MarketWatch had forecast a 0.8% decline. The decline over the past 12 months steepened to 5.4%, marking the biggest yearly dropoff since the middle of 2016.\n\nMeanwhile, U.S. initial jobless claims, a rough way to measure layoffs, fell by 6,000 to 212,000 in the seven days ended Oct. 19, holding near a 50-year low.\n\nLooking ahead, at 9:45 a.m. Eastern Time, a flash reading of manufacturing and services activity is estimated to come in at 50.9 in the composite purchasing managers index, which provides an early estimate of current private sector output for October.\n\nNew-home sales for September will be released at 10 a.m., with 698,000 sales forecast.\n\nWhich stocks are in focus?\n\nTesla shares TSLA, +17.08% were rising 18.5% after the electric-car maker surprised investors by reporting a profit for the third quarter, allaying investors’ fears that it was prioritizing growth and production over profit.\n\nOpinion: Tesla is profitable again. How long will it last this time?\n\nCheck out: Tesla bull praises ‘Picasso-like’ quarter, but others question whether profit can be sustained\n\nFord Motor Co. F, -5.27% fell 5% after the car maker lowered its full-year target, sparking worries that a broad restructuring at the company isn’t succeeding in driving earnings growth.\n\nTwitter Inc. TWTR, -17.02% shares are plunging 20% after the social-media company fell short on its third-quarter financial metrics despite delivering better user growth than expected.\n\nMicrosoft Corp. MSFT, +1.57% reported fiscal first-quarter profit of $10.7 billion, or $1.38 a share, on revenue of $33.1 billion, up from $1.14 a share on sales of $29.08 billion a year ago. Analysts on average expected earnings of $1.25 a share on revenue of $32.15 billion, according to FactSet. Shares of the technology giant were 1.6% higher.\n\nPayPal Holdings Inc. PYPL, +9.58% rose 8.5% after the payments company posted better-than-expected results in its latest quarter with a 19% rise in revenues\n\nMaterials science company Dow DOW, +4.36% said third-quarter net profit dropped to $333 million, or 45 cents a share, from $1.01 billion, or $1.36 a share. Sales fell 15% to $10.76 billion, on lower prices as global energy prices fell. Shares of Dow gained 5.2%.\n\nEbay EBAY, -7.70% dropped 8.2% after the online marketplace forecast its first quarterly revenue decline in four years.\n\nHow are other markets performing?\n\nThe 10-year Treasury note yield TMUBMUSD10Y, -1.33% was little changed at 1.761% on Thursday.\n\nOn the oil front, December West Texas Intermediate crude CLZ19, +0.09% was modestly higher at $56.08 a barrel on the New York Mercantile Exchange, down 0.6%, after rising on Wednesday.\n\nGold for December delivery on Comex GCZ19, +0.38% gained 0.4% at $1,501.20 an ounce on Comex after gaining 0.6% on Wednesday.\n\nThe ICE U.S. Dollar Index DXY, +0.01%, which tracks the performance of the greenback against six major rivals, edged up less than 0.1% at 97.496.\n\nElsewhere, the Stoxx Europe 600 SXXP, +0.53% rose 0.6% at 397.48.\n\nIn Asia, China’s CSI 300 index 000300, -0.01% fell less than 0.1% to 3,870.67 and the Shanghai Composite Index SHCOMP, -0.02% was virtually flat to close at 2,940.92, while Hong Kong’s Hang Seng Index HSI, +0.87% jumped 0.9% to reach 26,797.95, more than erasing its decline from the previous session. Japan’s Nikkei 225 NIK, +0.55% rose 0.5% to 22,750.60.", "description": "U.S. stock benchmarks on Thursday mostly rise toward all-time highs at the open, in a session that will mark the busiest day of the third-quarter earnings...", "authors": ["Mark Decambre"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GX421_bull_ZG_20181031142002.jpg", "published_at": "2019-10-24"}