{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7617381/Then-none-ITV-did-not-feature-non-white-hosts-entire-day.html", "downloaded_at": "2019-10-27 04:07:42.811116+00:00", "title": "Then there were none! ITV did not feature any non-white hosts for an entire day", "language": "en", "text": "After it was revealed that ITV featured just one ethnic minority star over an entire day, bosses vowed to tackle diversity.\n\nBut efforts appear to have gone backwards, when the channel failed to feature a single non-white host on the schedules last Wednesday.\n\nWith many of its big names on holiday for half-term, ITV had an opportunity to put a more diverse range of faces centre stage.\n\nChristine Lampard stood in for Lorraine Kelly on her morning chat show. The afternoon ITV line-up – David Dickinson’s Real Deal, Tenable, Tipping Point and The Chase – all featured white faces\n\nBut while ethnic minorities were represented in wider roles, the key anchor positions all went to white stars.\n\nGood Morning Britain hosts Piers Morgan and Susanna Reid were covered by Ben Shephard and Kate Garraway, while Ruth Langsford and Eamonn Holmes stood in for Holly Willoughby and Phillip Schofield on This Morning.\n\nIn the past, both programmes have employed ethnic minority stars such as Rochelle Humes, Ranvir Singh and Adil Ray as holiday cover. Christine Lampard stood in for Lorraine Kelly on her morning chat show.\n\nLater, Loose Women – which has three non-white panellists on its roster – opted instead for Andrea McLean, Janet Street-Porter, Stacey Solomon and Gloria Hunniford.\n\nGood Morning Britain hosts Piers Morgan and Susanna Reid were covered by Ben Shephard and Kate Garraway, while Ruth Langsford and Eamonn Holmes stood in for Holly Willoughby and Phillip Schofield on This Morning\n\nThe afternoon ITV line-up – David Dickinson’s Real Deal, Tenable, Tipping Point and The Chase – all featured white faces.\n\nThe lunchtime news was read by Lucrezia Millarini, the evening bulletin by Alastair Stewart and Tom Bradby hosted News At Ten.\n\nThe popular 8pm slot was filled by Paul O’Grady’s For The Love Of Dogs show and Robert Peston presented his politics show between 10.45pm and 11.40pm.\n\nThe rest of Wednesday’s schedule – 18 hours of programming – included Doc Martin, Emmerdale and Coronation Street.\n\nEarlier this month, The Mail on Sunday revealed how the only non-white face on ITV during 18 hours of programming on Tuesday, October 8, was ITN newsreader Nina Hossain. ITV said at the time that it was ‘fully committed to continuing to improve’.\n\nLast night, the channel said it considered last Wednesday’s schedule diverse as there were ethnic minority stars in presenting roles.\n\nA spokesman pointed out that Ranvir Singh and Andi Peters had been part of the Good Morning Britain presenting team and Anushka Asthana was Robert Peston’s co-host.", "description": "Efforts appear to have gone backwards, when the channel failed to feature a single non-white host on the schedules last Wednesday with many of its big names on holiday for half-term.", "authors": ["Katie Hind Showbusiness Editor For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/00/20228892-0-image-a-19_1572130923380.jpg", "published_at": "2019-10-26"}