{"pub": "thestreet", "url": "https://realmoney.thestreet.com/jim-cramer/jim-cramer-welcome-to-a-market-filled-with-fear-15105777", "downloaded_at": "2019-09-26 20:54:08.010548+00:00", "published_at": "2019-09-26", "title": "Jim Cramer: Welcome to a Market Filled With Fear", "language": "en", "text": "Welcome to a market that is frantically trying to price in everything and anything, a market filled with fear, a market wrought with greed.\n\nHow can you tell these things?\n\nLet's go over the points that are causing the erratic behavior because they are tells of bigger things than just earnings. They are tells of what the collective masses think will happen and in many ways they are contradictory with each other.\n\nFirst, and more important, there are people who, once again, believe that we going into a recession and that a recession's doing to happen sooner than later.\n\nHow do I know this? Because at the worst moments of this market today, of the moments when it looked like everything had to come down, buyers at first stood at the stocks of Kimberly-Clark (KMB) , Procter & Gamble (PG) and McDonald's (MCD) , and then when things looked particularly hopeless, these same buyers started walking their stocks up. That's right, instead of walking away and letting the stocks go down as they most surely would have if the buyers hadn't been standing there, they had the audacity of making themselves right instantly. Only arrogant, stupid buyers do this kind of thing. Only real bozos think they are so right that they buy up on a day like today. But that's what they did and it is a sign of pure panic as these are the stocks that do well in a recession.\n\nSecond were the people who are trying to price in an Elizabeth Warren presidency. Warren's now the official frontrunner according to the polls and she is no fan of certain groups of stocks, especially the managed care stocks. Today an analyst came out and said the opportunity in the stock of Cigna Corp. (CI) is the best in twenty years of coverage. If Warren weren't the putative leader that stock would have been up a great deal and it would have a ton of pin action.\n\nInstead, it's the opposite. The analyst picked the wrong date to make the case for the stock because if we go to a single-payer system as Warren wants, there will be no need for a UnitedHealth Group (UNH) at all. So why did I advise club members of Action Alerts PLUS to buy some in the thick of things?\n\nWell, there's the fact that I have never seen it cheaper. There's the fact that has a 2% yield. There's the fact that it's about as oversold of any stock I can recall. There's the fact that it's down more than 70 points from the high. And there is the fact that we don't even know if Warren is going to win and we don't know if she will be able to get anything done about health care at all if the Republicans keep the Senate. In short, this stock is the most fragile in a world of Warren, but this company is making oodles of money and can't be counted out so easily.\n\nThe impact of Warren is pretty much everywhere today. Ever since she started showing that she was pulling away from the pack we began to get aggressive selling in the winners, the Oktas (OKTA) , Twilios (TWLO) and the Amazons (AMZN) . Why? Because these are companies where investors have huge gains and they don't have dividends or buybacks to protect themselves. They are at the mercy of investors who expect that taxes are going to go much higher on capital gains under Warren so why not take those gains now? They are from people who are scared that capital gains taxes will be as high as income taxes or even higher. They can't take any chances, so they are ringing the register now.\n\nI don't know when the selling will end. I do know that when we get these swoons at times they last for weeks on end, sometimes as much as two months, before the selling exhausts itself. Bulls have to hope that the selling exhausts itself or that there are enough buyers, including companies themselves, to absorb the selling. Bears have to think that as long as Warren is leading in the polls then the selling of the winners won't let up.\n\nWhat's aiding the bears? Pretty simple: the mainstream media just writes article after article about how President Trump is finished because of something he did with Ukraine and how it was covered up by other people in the administration. They make it sound very much like Watergate, where Nixon covered up various misdeeds including a break in at the Democratic National Committee headquarters. When I read the articles I feel like there are plenty of people who think that Trump's done in one form or another and Biden seems to be caught up in some web that's ruining his chances.\n\nA week ago, it looked like Speaker of the House, Nancy Pelosi, was not going to back impeachment proceedings and that meant there could be a good chance that the fight against Trump would be at the ballot box not the Senate after the House votes impeachment.\n\nThat seems all gone now and the bears are huge winners especially because that's Warren's best shot at the presidency.\n\nTo make matters worse the bears know that it seems politically impossible for Speaker Pelosi to get behind the president for the United States, Mexico and Canada treaty, something that many businesses are counting on to make their numbers in 2020. How can Pelosi negotiate with the man she is trying to kick out of office? Maybe it is possible, but it seems very unlikely.\n\nOh and, of course, if the Chinese smell blood, there's not going to be any trade deal with Trump. I figure they read the same papers we do and are emboldened to stick things out.\n\nFinal bearish plank? The IPO market is really beginning to fall apart as I expected would happen by this time after all of this new supply. First, we have the SmileDirectClub (SDC) fiasco, with a stock that was priced at $23 and then closed down 28% on the first day. It is now $13.\n\nThen there is the clown show of WeWork, which couldn't come public because of horrendous governance issues that left the CEO in the cold and out of the job.\n\nThen there's the total breakdown of the Lyft (LYFT) , which opened at $87 -- although it was quoted as up to $100 at one point and is now at $41 and Uber (UBER) , which was priced at $45 and is now at $31.\n\nAll of these lead up to today's allegedly red-hot Peloton (PTON) IPO, which was priced at $29 and immediately went to a discount. Why not, it fits the pattern of what this market has turned on: high-growth stocks that don't make any money.\n\nIt's not going to be easy to figure out how to price in a recession, an impeachment and an election of a candidate long perceived to be anti-capitalistic.\n\nFor what it is worth, I think the likelihood of Trump being impeached grows greater because the House is Democratic-controlled, but the Senate not finding any guilt, increases by the day. That's a lot to wade through, although as I showed you the other day President Clinton endured a similar trajectory and the market ultimately rallied.\n\nNevertheless, until the IPO spigot is shut down -- there's just not enough money to handle all of these deals -- until people realize the unlikely nature of Trump being convicted by a two-thirds majority of the Republican-controlled Senate, until there's a built-in view that no trade deals will be done, and until investors believe that Elizabeth Warren is not the devil incarnate, we are going to get days like this, maybe lots of them.\n\nSo, get used to it because it's real hard to fight this very nasty tape.", "description": "Jim Cramer: Welcome to a Market Filled With Fear...KMB", "authors": ["Jim Cramer", "Welcome To A Market Filled With Fear", "The Impact Of Elizabeth Warren Is Pretty Much Everywhere Thursday.", "Stocks Quotes In This Article", "Bob Lang", "Paul Price", "Doug Kass", "Bruce Kamich", "Jim", "Rev Shark"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/f32fafa4-99cb-11e9-805e-a99e0df973b4.png"}