{"pub": "cnn", "url": "https://us.cnn.com/2019/09/02/opinions/assad-strategy-terrorizing-civilians-hospitals-jonathan-allen/index.html", "downloaded_at": "2019-09-22 07:17:09.744802+00:00", "title": "Terrorizing civilians and bombing hospitals is a core part of Assad's strategy", "language": "en", "text": "Jonathan Allen was appointed UK Deputy Permanent Representative to the United Nations in New York in August 2017. He was the director of national security at the Foreign & Commonwealth Office from 2015 until 2017. The views expressed in this commentary belong to the author. View more opinion at CNN.\n\n(CNN) In war zones, ambulances and hospital roofs are often clearly marked with a red cross or crescent to avoid accidental air strikes or other attacks. In Idlib, in the northwest of Syria, where the civil war has stretched into its eighth year, the UN has also shared the coordinates of medical facilities with Bashar al-Assad's forces and their Russian allies in order to avoid inadvertent attacks.\n\nDespite this deconfliction system, these hospitals have been repeatedly hit since the start of the current offensive in April. In northwest Syria, the US-based human rights group Physicians for Human Rights (PHR) received reports of 46 attacks on health care facilities -- and confirmed 16 of them. At least 14 of these facilities were on the UN's deconfliction list, according to several members of the UN Security Council in a formal diplomatic petition that was reviewed by Reuters\n\nNo matter how much Russia and Syria try to deny their targeting civilians, given that this information was readily shared, it seems apparent that these are not accidents of war or inadvertent attacks.\n\nWe should not be surprised. Over the course of the Syrian conflict, there have been at least 578 attacks on health-care facilities and 890 deaths of medical personnel, according to PHR. More than 90% of these attacks were perpetrated by the Syrian regime or the Russian government (or both), according to the PHR.\n\nTargeting health care facilities is a war crime . Syria claims , in a July 16 letter to the UN, that all health-care facilities in Idlib have been rendered \"inoperative,\" and can no longer be considered \"civilian objects\" under humanitarian law. But the UN emergency relief coordinator challenged those claims and pointed to facilities that continue to be recognized and supported by the UN, including the medical center at Maarrat al-Numan. Russian military has cooperated closely with the regime and their planes have also taken part in the bombing raids.\n\nTerrorizing civilians is a core part of Assad's strategy. The Syrian people have been targeted by their own government for daring to ask for a fundamental human right that so many of us take for granted -- the right to elect their leadership and have a say in their future. More than 5.6 million people have fled Syria since the start of the conflict in 2011.\n\nStaying in Syria is risky, and detention by the regime is often a death sentence.\n\nAmina Khoulani, the co-founder of Families for Freedom, an organization that helps those who are unlawfully detained in Syria, shared her story -- one thousands of other Syrian families can relate to -- with the United Nations Security Council this month. Her three brothers were detained for peacefully demonstrating for a free Syria, she told the UN. After years of hoping for their release, she received evidence that all three died in detention.\n\nThe Syrian regime has denied systematic abuse in its prison system. But government memos obtained by the New York Times show officials who report directly to Assad ordered mass detentions and were aware of deaths from torture, filthy conditions and other atrocities.\n\nMany like Khoulani have fled the country. Meanwhile, there are over six million internally displaced people , many of whom find themselves in Idlib, the last stronghold against the regime. For many of these people, there is nowhere left to run. Members of the Security Council are supporting a resolution calling for an immediate cessation of hostilities to protect civilians and allow humanitarian access.\n\nIt is desperately sad that the Security Council has not been able to protect Syrians from these war crimes -- including chemical weapons attacks committed by their own government.\n\nThis is not a failure of will by the whole Security Council. We have been prevented from acting by Russia, through its employment of the veto, which it has used 12 times since the start of the conflict. China has also exercised its veto power with regards to resolutions on Syria.\n\nAs we demand that the Assad regime cease its crimes against its people, we have created investigatory and evidence-gathering bodies to ensure that those ordering and carrying out attacks are one day brought to justice. The Independent International Commission of Inquiry on the Syrian Arab Republic was set up by the Human Rights Council to investigate allegations of violations of international human rights law. The International Impartial and Independent Mechanism was established by the General Assembly to assist in the investigation and prosecution of persons responsible for the most serious crimes committed in Syria under international law.\n\nAfter an intervention by 10 members of the Security Council, the UN Secretary-General is setting up Board of Inquiry to investigate attacks on deconflicted sites and UN-supported facilities in Idlib.\n\nGet our weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\n\nkilling children, Peace in Syria will not be realized until a comprehensive political solution is widely acceptable to the Syrian people. Until that happens, we must not lose our capacity for outrage for what the Syrian regime is doing to its people: using chemical weapons, torturing political prisoners targeting civilian infrastructure and bombing hospitals.\n\nWe must not stop listening to those who bear witness. We must not let eight years of brutality normalize us to more. We must redouble our efforts to achieve a ceasefire in Idlib and humanitarian access.\n\nWe must let the regime know, from Assad down to his commanders and soldiers on the ground, that we will not rest until those who ordered and carried out these attacks are held accountable for their crimes.", "description": "Jonathan Allen writes that the Syrian regime must be held to account for its war crimes -- namely terrorizing civilians, torturing political prisoners, targeting civilian infrastructure and bombing hospitals.", "authors": ["Opinion Jonathan Allen"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190530143121-05-idlib-0526-super-tease.jpg", "published_at": "2019-09-02"}