{"pub": "abcnews", "url": "https://abcnews.go.com/Business/tap-best-pictures-memories-curated-google-photos/story?id=65592620", "downloaded_at": "2019-09-13 18:18:58.893348+00:00", "title": "See your most memorable pictures with Google Photos new feature", "language": "en", "text": "Google Photos has added a new memories feature that's like a personalized social media highlight reel to bring your favorite photos back to the top of your feed and your mind.\n\nInterested in Google? Add Google as an interest to stay up to date on the latest Google news, video, and analysis from ABC News. Add Interest\n\nThe team behind the Google photo library and sharing app announced Thursday that the new feature will use machine learning to curate what appears in Memories.\n\n\"You’ll see photos and videos from previous years at the top of your gallery in a new feature we’re calling Memories. While you might recognize this stories format from social media, these memories are your personal media, privately presented to you so you can sit back and enjoy some of your best moments,\" Shimrit Ben-Yair, the director of Google Photos, said in a post about the announcement.\n\nTake a stroll down memory lane. New @googlephotos features help you revisit your best moments, including a new Memories feature at the top of your gallery → https://t.co/YoMeog06fO pic.twitter.com/uur6loXERA — Google (@Google) September 12, 2019\n\nThe layout shows circular thumbnail bubbles at the top of the screen, which will feel familiar to people who use Instagram stories. Users can tap to see a full screen carousel highlight of the memories along with the date and location from those featured photos.\n\nInstead of parsing through a photo stream to find the best quality picture, Google Photos uses AI technology to find \"the best ones.\"\n\nWe’re also making it easier to find the photos you’re looking for. Now, you can search your photos by the text that’s in them.\n\n\n\nAnd once you find the photo, you can copy the text from it using #GoogleLens — now even faster with a suggested action. pic.twitter.com/uykYVUU29R — Google Photos (@googlephotos) September 12, 2019\n\nKelly McCarthy\n\nThe app also added a new feature to make it easier to find photos. For example, if you were to search for the word \"pizza\" the app would use computer learning to identify all your photos that have the word or an image of pizza.\n\nAdditionally, Google Photos said it understands \"that you might not want to revisit all of your memories, so you’ll be able to hide certain people or time periods, and you have the option to turn this feature off entirely.\"\n\nWith memories, users can also share photos directly to friends or family within the app.\n\nPhotos can be added to an ongoing, private conversation thread so all the shared photos are in one place that can be easily saved across iOS and Android.\n\nThe company also announced a new service to help bring memories off your phone and into your home.\n\nGet your photos off your phone and into your home.\n\n\n\nRolling out today, people in the US can get 4x6 photo prints from Google Photos for same day pickup at Walmart or CVS Pharmacy..https://t.co/AEQCLesWzT pic.twitter.com/uxcPJDs1QC — Google Photos (@googlephotos) September 12, 2019\n\nUsers can now print individual 4 by 6-inch photos directly from the Google Photos app and get same-day pick up at CVS Pharmacy or Walmart print centers. Prints start at just $0.25 per photo.\n\nGoogle Photos allows unlimited photo and video storage for free, up to 16MP and 1080p, accessible from any phone, tablet, or computer on photos.google.", "description": "Google Photos has added the memories feature that uses computer learning to bring your best photos back to the top of your photo stream.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Technology/google-photos-app-ht-190913_hpMain_16x9_992.jpg", "published_at": "2019-09-13"}