{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/ex-ceo-of-google-africa-bitcoin-a-gift-that-will-change-humanity", "downloaded_at": "2019-10-18 08:51:43.264360+00:00", "title": "Ex-CEO of Google Africa: Bitcoin a ‘Gift’ That Will Change Humanity", "language": "en", "text": "Computer scientist and general manager of WeWork South Africa, Stafford Masie, has said that Bitcoin (BTC) will change the future of humanity more than any other technological innovation.\n\nIn a keynote delivered at the SingularityU South Africa Summit on Oct. 16, Masie — formerly the CEO of Google Africa — said that Bitcoin’s provision of an exchange of value without intermediaries is the greatest gift mankind has ever received technologically.\n\nRevolutionary for global trade\n\nMasie argued that while the crypto wallet is “misunderstood, misused, misrepresented and viewed as complicated,” it will revolutionize global trade. Its main potential, he continued, is not for developed and already highly digitized economies, nor for cash-dominated informal economies, but for what he dubbed “third economies” in which barter systems still prevail:\n\n“The third economy is an economy where people don’t have access to electronic forms of distributing value or cash [...] Think of the people who live two hours outside Shanghai, China’s central coast. They will use Bitcoin to trade and unlock international transactions outside of the existing frameworks in a manner that you and I cannot imagine.”\n\nMasie also took pains to address fundamental misconceptions about Bitcoin, such as its alleged hackability — stressing that “it’s the exchanges that can be hacked, not the Bitcoin.”\n\nIn parallel to his advocacy of decentralization, Masie took stock of the rise of tech corporations as a watershed for global markets:\n\n“When combined, Apple, Amazon, Alphabet, Facebook and Microsoft’s net asset value represents the same value as S&P 500 companies combined and this is extraordinary because we have never seen the concentration of wealth like this in history. Combined, these companies have value that equates to the gross domestic product rates of some countries.”\n\nWeWork’s woes\n\nWeWork — which notoriously saw breakneck growth — pulled its planned $47 billion initial public offering earlier this year amid a spate of controversies over its business model and corporate governance.\n\nEarlier this week, reports surfaced that the firm was poised to sack 2,000 of its employees imminently — roughly 13% of its workforce.\n\nThis September, Cointelegraph published an analysis of the prospects for crypto adoption in South Africa, the second-largest economy on the continent, which some recent surveys suggest has the highest ratio of crypto owners among internet users, at 10.7%, in the world.", "description": "Computer scientist and general manager of WeWork South Africa Stafford Masie says that Bitcoin will change the future of humanity more than any other tech innov...", "authors": ["Marie Huillet"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvOTJlODYzMjVhYTZjZDdmNzkyMzNiODE2YmM2ODViNjUuanBn.jpg", "published_at": "2019-10-18"}