{"pub": "mirror", "url": "https://mirror.co.uk/news/world-news/loyal-dog-waits-roadside-four-20673584", "downloaded_at": "2019-10-22 13:31:03.777952+00:00", "title": "Loyal dog waits by roadside for four years at exact spot where he lost his owner", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA stray dog waited four years for his owner to return at the exact spot where the pet jumped from a moving truck.\n\nPassing biker Anuchit Uncharoen saw the dog twice on a highway in Roi-Et, northeastern Thailand, last month.\n\nHe stopped to check on the dog and was told by the locals that it had been sitting at the same place for the last four years.\n\nResident Saowaluck Pinnuvech, 45, said that she found the dog at that spot in early 2016.\n\nShe said: \"I found this dog since 2016, back then he was so skinny and he had skin lesions.\n\n(Image: ViralPress)\n\n\"I rode a motorcycle past this road and saw him everyday for a week, so I asked the people about his owner and the locals told me that he was a stray dog.\n\n\"They said he had been waiting there since the previous year.\n\n\"I took him to the vet and adopted him myself and named him Leo, but after a couple of days he was missing from the house and I found him at this spot again so I let him stay here and have been coming to feed him everyday.\"\n\nAnuchit decided to share the story of Leo and a video online, which prompted the dog's owner to come forward.\n\nVideo shows Leo sitting by the roadside and looking out as the cars drove past.\n\n(Image: ViralPress)\n\n(Image: ViralPress)\n\nOwner Noi Sittisarn, 64, said her dog Bong Bong had gone missing after jumping down from her pickup truck in 2015.\n\nShe added: \"I was travelling on this road but then I noticed that Bong Bong was missing from the trunk.\n\n\"Me and my husband drove around to find him but we did not find him and we did not know where he could be.\"\n\nAs she went back to the spot on September 9, Leo bounded over excitedly to Noi and let her to rub his head.\n\nHowever, he refused to go home when she carried him to the pickup truck.\n\n(Image: ViralPress)\n\nIt appeared that Bong Bong needed some time to adjust his feelings so Noi promised to go back again the next day.\n\nHowever, that night Saowaluck called Noi and cried as she confessed that she wanted to keep the dog herself because she had become attached to him.\n\nNoi said that she was more than happy to let the dog stay with Saowalack. She said: \"I have no intention to refuse her request.\n\n\"Due to her good care of the dog I believed she and the dog will be happy together but I would like her to keep the dog in her house.''\n\nSaowaluck promised to take the dog home and will take a good care of him while Noi is happy to take the dog back, if Saowaluck no longer wants him.", "description": "The dog jumped off from his owner's truck on a highway in Thailand and remained on the same spot until they were reunited", "authors": ["Tiffany Lo", "Image", "Viralpress"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20676856.ece/ALTERNATES/s1200/2_PAY-NEWSLINK9636572_103361jpgi.jpg", "published_at": "2019-10-22"}