{"pub": "npr", "url": "https://npr.org/2019/09/26/764329165/disney-ceo-bob-iger-has-lessons-on-fostering-creativity-and-acquiring-it", "downloaded_at": "2019-09-26 14:49:12.858792+00:00", "title": "Disney CEO Bob Iger Has Lessons On Fostering Creativity — And Acquiring It", "language": "en", "text": "Disney CEO Bob Iger Has Lessons On Fostering Creativity — And Acquiring It\n\nEnlarge this image toggle caption Drew Angerer/Getty Images Drew Angerer/Getty Images\n\nBefore Bob Iger took over as CEO of The Walt Disney Co. in 2005, Disney's stock value was stagnant. Its studios, networks and theme parks had lost some of their magic.\n\n\"We were embattled and somewhat discouraged and not as optimistic as we needed to be,\" he says. \"And we needed to find our way.\"\n\nHow Iger turned the company around is chronicled in his new business memoir, The Ride of a Lifetime: Lessons Learned from 15 Years as CEO of The Walt Disney Company. The book is being published as he looks toward his retirement in 2021.\n\nHe writes about working his way up the entertainment ladder, starting with menial jobs on soap operas and game shows at ABC to leading the TV network's sports and entertainment divisions. As CEO of Disney, he oversees 12 Disney theme parks around the world, movies, TV shows, cable channels and more.\n\nFor all of his hits, Bob Iger has also had some flops. When he was head of entertainment for ABC, he presided over an epic failure: a musical TV series starring police officers.\n\nCop Rock was the brainchild of the late Steven Bochco, whose credits include the hit TV police dramas Hill Street Blues and NYPD Blue. In his book, Bob Iger writes he \"didn't regret trying\" Cop Rock.\n\n\"When you take risks you have to be willing to process failure, because there is inevitable failure in creativity,\" Iger says.\n\nThe Ride of a Lifetime Lessons Learned from 15 Years As CEO of the Walt Disney Company by Robert Iger Hardcover, 246 pages | purchase close overlay Buy Featured Book Your purchase helps support NPR programming. How?\n\nIger believes in \"taking big swings.\" And before the Cop Rock fiasco, one of those swings knocked it out of the park — at least initially.\n\nIger persuaded his bosses at ABC to broadcast Twin Peaks, a riveting but oddball murder mystery created by filmmaker David Lynch.\n\n\"Twin Peaks was in a way the Game of Thrones of its time,\" Iger says. \"Television was somewhat tame at that point still, and this was unlike anything that was on — extremely well-executed and a very compelling story.\"\n\nIt gave Bob Iger huge credibility in Hollywood's creative community. In his book, he writes that suddenly he was getting calls from major movie directors Steven Spielberg and George Lucas, who wanted to know what they might be able to do for ABC.\n\nThe first season of Twin Peaks was a sensation. But it didn't last. And here's where Bob Iger learned a lot about working with creative storytellers.\n\nDavid Lynch was known for offbeat films, not a TV series that needed to deliver new plot twists each week. Iger says Lynch didn't want to answer the central question to the Twin Peaks mystery: Who killed Laura Palmer?\n\n\"David was arguing that if he solved the murder no one would want to come back,\" Iger says. \"That would be it. And I argued the opposite. And ultimately I prevailed. It was not easy, and the series failed.\n\n\"And looking back I'm sorry that I pushed it that far with David although I will say: Even though I have incredible respect for David, one of the problems with the series was there wasn't much else to it from a story perspective. I didn't understand that as much then.\"\n\nIn his book, Iger writes that managing the creative process requires both empathy and resilience. To turn Disney around, Iger set about acquiring other companies — starting with Pixar, the studio behind a number of animated classics, including Toy Story and The Incredibles.\n\nIger also struck deals to buy Marvel, Lucasfilm and, most recently, 21st Century Fox. He says that in each case, he has tried to keep each company's culture intact.\n\n\"There's a culture and a way of life at the company that you've bought that sometimes can be integral to the creative process or the process of creating product at that company,\" Iger says. \"And if you go about it in too heavy-handed a way, you can destroy spirit and culture and a sense of purpose — and in doing so, destroy the very essence of what you bought, or reduce value.\"\n\nAs CEO, Iger turned Disney into one of the largest entertainment companies in the world. But he was not a shoo-in for the job. Far from it.\n\nIn 2005, Disney was in terrible shape, and at the time, Iger was then-CEO Michael Eisner's No. 2. Iger says that to get the job, he worked on winning over members of the Disney board, the shareholders and — most importantly — the people he would lead.\n\nJennifer Lee, who recently became chief creative officer of Walt Disney Animation Studios, says Iger \"leads with trust.\"\n\n\"He has all the faith in us being grounded when we need to be grounded,\" Lee says. \"But he does know that, to move forward, you have to able to be bold.\"\n\nIger is not without criticism. Disney has some 200,000 employees, and the company's treatment of those at the low end of the pay scale has come under attack.\n\nDisney heiress Abigail Disney has decried the enormous wage gap between workers at Disney theme parks, who can make less than $20 per hour, and its executives, whose salaries are in the multimillions. In response, The Walt Disney Co. points to its $150 million investment in employee educational support as a driver to higher wages, as well as child care benefits and flexible schedules.\n\nIger says that when he was fighting for the job of CEO, it was vital to have the support of the people inside Disney .\n\n\"It starts with the people who work at the company,\" he says. \"You're not going to be admired on the outside unless you're admired on the inside.\"\n\nIn his book, he writes about where his personal ambition comes from. He grew up in a mostly working-class town on Long Island, New York. His father, a World War II veteran, had trouble keeping a steady job and had been diagnosed with manic depression. Iger says he grew up watching his dad feel like a failure.\n\n\"Even though I remind him a number of times that he should be looking at accomplishment in a different way — he had raised two kids (I have a younger sister), and I thought that was an accomplishment in itself,\" Iger says. \"But seeing his disappointment with himself — which was something that not only created a dissatisfaction, but an anger really at himself — I really promised myself that I would not be him in that regard.\"\n\nIn Iger's new book, optimism is atop his list of \"principles necessary for true leadership.\" As for his favorite Disney character:\n\n\"As a kid I always liked Tinker Bell for some reason,\" he says. \"I don't know, there was something impish about Tinker Bell way back. When I say that to people, they kind of look at me like: 'Huh?' \"\n\nNina Gregory edited this story for broadcast.", "description": "The head of The Walt Disney Co. has a new book, The Ride of a Lifetime. It's a memoir of what he has learned in 15 years there — encompassing the purchases of Pixar, Lucasfilm and 21st Century Fox.", "authors": ["Elizabeth Blair"], "top_image": "https://media.npr.org/assets/img/2019/09/25/bob-iger_wide-1c06b71b9d1690df84cb75231c00e5edca06c366.jpg?s=1400", "published_at": "2019-09-26"}