{"pub": "yahoo", "url": "https://finance.yahoo.com/news/starbucks-sbux-q4-report-growth-223910522.html", "downloaded_at": "2019-10-30 09:04:10.865307+00:00", "title": "Starbucks (SBUX) Q4 Report: Will the Growth Narrative Continue?", "language": "en", "text": "Starbucks SBUX is set to report its Q4 earnings results after the closing bell on Wednesday, October 30. The coffee giant has seen its shares climb 30% in 2019 thus far, outpacing the broader food and beverage retail market’s 18.5% run. The company has been able to increase comp sales through its beverage and technology innovation.\n\nThrough its tech and beverage expansion, Starbucks successfully alleviated the worries about the company’s growth trajectory from 2018. Its expansion into international markets has also helped spur optimism about how far the beverage giant can go.\n\nTech and Menu Innovation Stimulate Growth\n\nThe company’s CEO and former tech executive, Kevin Johnson, has helped stimulate growth in its beverage sales by developing more cold coffee drinks, driving afternoon sales, which was an area that struggled in 2018. The business also continues to grow its My Starbucks Rewards program and integrate more tech features into its Starbucks digital app. One of the most important innovations in that digital ecosystem is Starbucks Delivers, which the firm continues to expand.\n\nStarbucks first delved into the delivery realm in China, where the rising popularity of food delivery led to a partnership with Alibaba’s BABA Ele.me food delivery service. The difference was immediately noted after the partnership was formed. Since the partnership was announced just over a year ago, Starbucks' figures in China have improved, with Chinese same-store sales increasing 6% last quarter versus a 2% decrease in the prior-year quarter. The company’s success in the Chinese market has led the business to expand its delivery operations into the US market as well.\n\nStarbucks is using Uber Eats UBER in the US to establish its delivery presence. The firm started an initial test run in Miami then moved on to denser populated cities like Boston, Chicago, New York, and others. Then came an additional push into the urban markets of Seattle, Houston, Dallas, and Orange County in California. Customers ordering through Uber Eats will still be able to customize orders as if they were ordering through the Starbucks app and will have access to about 95% of Starbucks' menu.\n\nOutlook\n\nWith the latest expansion, Starbucks Delivers will cover 16 US markets, and the company aims to complete its nationwide rollout by the end of 2020. When it does, the US will mark the 15th country in which Starbucks is now delivering its food and beverages to homes and businesses. The delivery initiatives have made Starbucks a pioneer in the restaurant space.\n\nHowever, it recently saw its Hong Kong stores vandalized in the recent protests after Maxim’s Group, who owns Starbucks’ licenses in Hong Kong and Macao, was associated with being in favor of Beijing and against the protests. Starbucks operates about 3,922 stores in China, and around 200 of those locations are licensed to Maxim's in Hong Kong and Macao. Hong Kong accounts for 4% of Starbucks' stores in China and 2% of all its Asian stores, making them large enough to weigh on Chinese comp sales.\n\nOur Q4 consensus estimates forecast the coffee icon to see a bottom-line gain of 12.9% to $0.70 per share while its net sales reach $6.64 billion for a 5.35% jump. Geographically, the Americas are projected to gain 7.26% to $4.56 billion and the EMEA region is predicted to decline 12.1% to $234.8 million. The China/Asia Pacific segment is estimated to grow 8.83% to $1.32 billion. Total Q4 comp sales are forecasted to grow 3.8%.\n\nBottom Line\n\nStarbucks looks poised to report another strong quarter as its menu and digital innovations have steered the company back on a strong growth trajectory. The company’s initiative to further expand its delivery operations in the entire US should provide a boost to the company’s financial figures in the future.\n\nThe company’s expansion in China is still in its infancy, but the progression it has made in the foreign market is promising despite the geopolitical headwinds. Continued innovation in the company’s offerings and services should help prolong the company’s run.\n\nLooking for Stocks with Skyrocketing Upside?\n\n\n\nZacks has just released a Special Report on the booming investment opportunities of legal marijuana.\n\n\n\nIgnited by new referendums and legislation, this industry is expected to blast from an already robust $6.7 billion to $20.2 billion in 2021. Early investors stand to make a killing, but you have to be ready to act and know just where to look.\n\n\n\nSee the pot trades we're targeting>>\n\n\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n\n\nAlibaba Group Holding Limited (BABA) : Free Stock Analysis Report\n\n\n\nStarbucks Corporation (SBUX) : Free Stock Analysis Report\n\n\n\nUber Technologies, Inc. (UBER) : Free Stock Analysis Report\n\n\n\nTo read this article on Zacks.com click here.\n\n\n\nZacks Investment Research", "description": "Starbucks (SBUX) is set to report its Q4 earnings results after the closing bell on Wednesday, October 30.", "authors": ["Christopher Vargas"], "top_image": "https://s.yimg.com/uu/api/res/1.2/iyGeQFGoZYVP8J8bLMxfqA--~B/aD00MDA7dz02MzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/99ba349c4eac0255aadbb1fbcc06cd96", "published_at": "2019-10-28"}