{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/boris-johnson-jennifer-arcuri-model-relationship-business-mayor-a9116156.html", "downloaded_at": "2019-09-23 07:32:32.215674+00:00", "title": "Jennifer Arcuri: Boris Johnson repeatedly refuses to deny affair with ex-model awarded public funds and access", "language": "en", "text": "Boris Johnson has refused to answer questions about his relationship with a young businesswoman who was handed a privileged place on his overseas trade trips when London mayor.\n\nThe allegations about the access – plus £126,000 in public money – granted to model-turned-tech-entrepreneur Jennifer Arcuri threaten to dog the prime minister on his trip to the United Nations.\n\nMr Johnson was a regular visitor to Ms Arcuri's flat in Shoreditch, East London, according to a report in The Sunday Times, and attended numerous events promoting her fledgling company.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nBut, when asked six times about the explosive allegations by reporters on his plane to New York, the prime minister gave the same reply: “I’m here to talk about what we are doing at the UN.”\n\nThe prime minister refused to say whether he denied any conflict of interest, dodged the issue of whether an inquiry was needed to clear up the matter and declined to say if he and Ms Arcuri had been lovers.\n\nLabour has demanded an investigation into the possible misuse of public funds and called on Mr Johnson to resign if he is found guilty of wrongdoing.\n\nAccording to The Sunday Times, Ms Arcuri, who was in her late twenties at the time of the controversy, described Mr Johnson as “one of her best friends”.\n\nIt said evidence showed that, in 2013, her new business received £10,000 in sponsorship cash from an organisation that the future prime minister was responsible for as London mayor.\n\nShe was given a £15,000 government grant in 2014, under a programme to encourage foreign entrepreneurs to build businesses in Britain - Ms Arcuri is an American citizen - and, in 2018, a further £100,000 award.\n\nMs Arcuri was also given preferential treatment when it came to joining overseas trade missions led by Mr Johnson, the report said.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Inside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nHer business was alleged to have failed to meet the eligibility criteria for any of the three trade trips she attended in the space of just a year.\n\nInitial decisions to turn her down for two of those trips were overturned after intervention by Mr Johnson and his close team in the mayor's office, it was claimed.\n\nShape Created with Sketch. Parent confronts Boris Johnson in hospital Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Parent confronts Boris Johnson in hospital 1/10 The father of a young girl, who is being treated in the Acorn childrens' ward, expresses his anger over hospital waiting times to Prime Minister Boris Johnson during his visit to Whipps Cross University Hospital in Leytonstone, east London PA 2/10 PA 3/10 PA 4/10 AP 5/10 PA 6/10 PA 7/10 PA 8/10 PA 9/10 PA 10/10 PA 1/10 The father of a young girl, who is being treated in the Acorn childrens' ward, expresses his anger over hospital waiting times to Prime Minister Boris Johnson during his visit to Whipps Cross University Hospital in Leytonstone, east London PA 2/10 PA 3/10 PA 4/10 AP 5/10 PA 6/10 PA 7/10 PA 8/10 PA 9/10 PA 10/10 PA\n\nOne internal email was said to show how she was given access to a New York trade mission after she discussed the matter with the then-mayor and he was said to have been happy for her to take part.\n\nAs mayor, Mr Johnson was bound by the Greater London Authority's code of conduct “to declare any private interests relating to their public duties and to take steps to resolve any conflicts arising in a way that protects the public interest”.\n\nHe was also barred from providing any undue benefits to friends.\n\nDowning Street had declined to comment on the allegations.", "description": "Boris Johnson has refused to answer questions about his relationship with a young businesswoman who was handed a privileged place on his overseas trade trips when London mayor. The allegations about the access – plus £126,000 in public money – granted to model-turned-tech-entrepreneur Jennifer Arcuri threaten to dog the prime minister on his trip to the United Nations.", "authors": ["Rob Merrick"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/22/11/jennifer-arcuri3.png", "published_at": "2019-09-23"}