{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/crypto-news-from-the-german-speaking-world-sept-30-oct-5-in-review", "downloaded_at": "2019-10-06 00:21:05.964807+00:00", "title": "Crypto News From the German-Speaking World: Sept. 30 – Oct. 5 in Review", "language": "en", "text": "The German-speaking world has experienced another week full of exciting developments in the crypto industry, with Liechtenstein approving the new Blockchain Act, Iota Foundation joining the European climate research community and Germany taking a firm stand against stablecoins.\n\nHere is the past week of crypto and blockchain news in review, as originally reported by Cointelegraph auf Deutsch.\n\nLiechtenstein approves new Blockchain Act\n\nOn Oct. 3, the Parliament of Liechtenstein approved the Token and TT Service Provider Act, also known as the Blockchain Act, which aims to improve investor protection, combat money laundering and establish clarity. The new law will make Liechtenstein the first country to have comprehensive regulation of the token economy. Liechtenstein’s Prime Minister Adrian Hasler said:\n\n\"With the TVTG an essential element of the financial center strategy of the government is implemented and Liechtenstein is positioned as an innovative and legally secure location for providers in the token economy.”\n\nIota joins European Union climate research community\n\nOn Sept. 30 Cointelegraph auf Deutsch reported that the Iota Foundation has joined the EIT Climate KIC research community of the EU-funded European Institute for Technology (EIT). In addition to research institutions such as the TU Berlin and the TU Munich, the EIT Climate KIC includes several other companies and think tanks in Germany. Together the companies hope to develop new products and services in relation to important climate issues and problems.\n\nGermany: Stablecoins should not become an alternative to the Euro\n\nThe German government announced a desire to prevent stablecoins such as Facebook's planned Libra coin \"as an alternative to the legal tender established” on Oct. 2, adding that:\n\n\"Banknotes issued by the European Central Bank and national central banks are the only banknotes that are legal tender in the Euro area. From the point of view of the Federal Government, it will be necessary to ensure that \"stablecoins\" do not establish themselves as an alternative to the legal currency, thereby calling the existing monetary system into question.\"\n\nAs of Sept. 17, German Vice Chancellor and Finance Minister Olaf Scholz said during a panel discussion in Berlin that Facebook’s planned crypto coin Libra will be clearly rejected, adding:\n\n“We cannot accept a parallel currency. [...] You have to reject that clearly.”\n\nFinance Minister Scholz wants digital Euro\n\nAs of Oct. 3, Scholz was advocating the idea of launching a digital Euro coin. The German finance minister stated that such a digital payment system would be beneficial for Europe and added that they “should not leave the field to China, Russia, the US or any private providers.”\n\nHowever, Mario Draghi, president of the European Central Bank, recently said that stablecoins and cryptocurrency in general are of little value, adding:\n\n“Thus far, stablecoins and crypto-assets have had limited implications in these areas and are not designed in ways that make them suitable substitutes for money.”\n\nSavedroid: Takeover brings crypto-fintech to the stock market\n\nOn Oct. 5, Cointelegraph auf Deutsch reported that Frankfurt-based fintech company Savedroid was acquired by Advanced Bitcoin Technologies AG (ABT). Per the report, the acquisition will bring the fintech startup to the stock market. Cointelegraph reported in October 2018, that German investors in Savedroid had lost between 40 and 92 percent of their investment.", "description": "This week’s selected cryptocurrency and blockchain news from the German-speaking world, courtesy of Cointelegraph auf Deutsch", "authors": ["Joeri Cant"], "top_image": "https://images.cointelegraph.com/images/740_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy8yZGIyMDllNjdiOGRjZDA2OGY4NWYyNDkyYzVhODI1Zi5qcGc=.jpg", "published_at": "2019-10-05"}