{"pub": "fox", "url": "https://foxbusiness.com/money/how-to-save-retirement-help-family-finances", "downloaded_at": "2019-10-12 12:59:44.721660+00:00", "title": "How to save for retirement while helping family with finances", "language": "en", "text": "A recent survey showed more than half of U.S. investors have provided or currently provide financial assistance, personal assistance or both to their adult children or extended family members -- and that's excluding tuition payments.\n\nContinue Reading Below\n\nSo how does one save for retirement while helping out the family financially?\n\nThe regional president of Wells Fargo Advisors' Northern Region Mary Sumners shared her tips with FOX Business:\n\n1. Save for unexpected health care costs\n\n\"Individuals are living longer [and] health care costs are rising,\" Sumners told FOX Business.\n\nSumners is right, according to the Wells Fargo survey. Over half of investors were estimating they would pay less than $200,000, but the estimated costs are more than $300,000, which includes long-term care and does not include what Medicare would cover.\n\nSumners suggested setting up a realistic expectation of how much health care will actually cost when you retire and then building a plan to make sure you can pay for that later.\n\n\"Have those conversations about whether something like long-term care insurance or longevity insurance fits into the picture, something that can help not only your parents but may protect you because it is a situation that none of us want to fall into where an aging parent might need long-term care and that can quickly devastate your savings if you're not prepared for that,\" Sumners said\n\n2. Get better at saving in general\n\n\"Let's be honest, Americans aren't the best savers in the world,\" Sumners explains. \"Every time you get a raise, put half of it toward your savings. It feels a lot easier to save money you've never seen. If you get a bonus, put that toward your savings or a big part of [your] tax refund.\"\n\n\"You've got to pay yourself first. You really do have to take care of yourself.\" - Mary Sumners, Wells Fargo Advisors\n\nSumners said putting bonus money toward savings is better than trying to reducing your discretionary spending.\n\nMore importantly, Sumners said it's about saving early and often, planning ahead, being disciplined and staying focused.\n\n\"The message is 'get out there, start early saving, put that money aside,\" Sumners said. \"Take advantage of every tax-advantaged program and account that's available to you.\"\n\nShe said it's crucial to grab all the free money available to you, including an employer match on a 401(k).\n\n3. Be careful about incurring debt\n\n\"Be smart about student loan debt,\" Sumners said. \"Really be smart about credit-card debt.\"\n\nSumners said it's important that when we make big purchases that we're keeping our ultimate financial goals in mind.\n\n\"I think as the population ages ... investors are watching their parents who maybe haven't saved enough, they watch students [and] adult children come out of college with student debt,\" Sumners said.\n\nDebt can lead to stress, which Sumners emphasized is something a person can eliminate by planning.\n\n\"If you're stressed out about making financial decisions, you make significant mistakes.\" - Mary Sumners, Wells Fargo Advisors\n\n4. Ask yourself: How do you want to live while you're retired?\n\n\"Six out of 10 respondents said the experience of caring for a family member changed how they wanted to be cared for,\" Sumners said to FOX Business. \"So many of them ... said it's going to influence their own saving rates in order to make sure that they don't fall into the same situation later in life.\"\n\nSumners said while there's no hard-and-fast rule for how to save enough for retirement, it's good to ask yourself what you want to accomplish while you're retired.\n\n\"What are your hopes and dreams?\" Sumners suggests asking. \"What do you want your money to do in the future? Do you want to buy a home? Do you want to buy a car? That vacation that you might want to take? Travel the world? Support grandkids in college?\"\n\nIt's only after you get all of those goals written down and documented that an adviser can help you look at the path that will help you get there, and the path that will help you to not only get there but keep you on track.\" - Mary Sumners, Wells Fargo Advisors\n\n5. Plan, plan and then plan some more\n\n\"If the individual doesn't have a plan themselves, and they're reacting to these needs coming at them day-to-day, they might not even realize that it's impacting their long-term financial stability,\" Sumners advises.\n\nShe said it's critical for people to try to understand the importance of having a comprehensive financial plan to work toward their retirement savings goal.\n\n\"I think it's really just about discipline. It's about having a plan, having a way to amass that wealth and put that money aside.\" - Mary Sumners, Wells Fargo Advisors\n\nSumners said it's a shame the school system doesn't emphasize financial education and that burden often falls on parents, who might be struggling with their own financial literacy themselves.\n\n\"Sometimes parents try to have the conversation, but kids don't necessarily hear the conversation and sometimes, it's too late,\" Sumners said. \"But I would say, it's never too late.\"\n\nSumners admits sometimes it's hard to get people to picture themselves in the future, so planning for that can be difficult.\n\n\"If we can get people to visualize themselves in their later years, I think they'll understand the importance of stepping into that saving role,\" Sumners said.\n\n6. Educate yourself\n\nUnfortunately, since the schooling system so often falls short in teaching everyone how to be more financially sound, it's important to do as much research as you can, Sumners mentioned.\n\n\"I don't know why the education system leaves it out,\" she said.\n\nBut Sumners said one thing parents can teach their children when trying to increase their financial literacy is the idea of helping yourself before helping others. Sumners compared it to when you're on a plane and the flight attendants recommend securing your oxygen mask before helping others.\n\nWe need to make sure to instill in our children the importance of helping others from a position of strength of stability.\" - Mary Sumners, Wells Fargo Advisors\n\n\"It's the analogy that comes to mind for me is someone who, without a life preserver, is perhaps trying to save somebody who's drowning,\" Sumners said. \"You run the risk of drowning yourself if you're not protecting yourself.\"\n\nSumners said there are many online resources people can use that can help people set financial goals and stick to them. But if you'd rather have someone in person, there are options for that, too.\n\nCLICK TO READ MORE ON FOX BUSINESS\n\n\"Working with an adviser and making sure that you have professional assistance is always a good idea when talking about finances,\" Sumners said. \"It's an opportunity for you to benefit from somebody who's helping lots of other people like you and can help.\"", "description": "The regional president of Wells Fargo Advisors' Northern Region Mary Sumners shared her retirement savings tips with FOX Business.", "authors": ["Blair Shiff"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/iStock-879351286.jpg?ve=1&tl=1", "published_at": "2019-09-20"}