{"pub": "dailymail", "url": "https://dailymail.co.uk/travel/travel_news/article-7503797/Virgin-Atlantic-unveils-Boeing-747-Star-Wars-Millennium-Falcon-paint-job.html", "downloaded_at": "2019-10-05 06:40:04.977888+00:00", "title": "Virgin Atlantic unveils a Boeing 747 with a Star Wars Millennium Falcon paint job", "language": "en", "text": "Advertisement\n\nAt an airport far far away you'll find a Virgin Atlantic 747 that has been decked out with a jaw-dropping Star Wars paint job.\n\nThe jumbo jet is adorned with a huge Millennium Falcon and a Star Wars: Galaxy's Edge logo that's 144 feet from end to end.\n\nVirgin Atlantic said the entire livery took weeks to produce and uses 14,000 millimetres of ink.\n\nThe Virgin Atlantic jumbo jet that has been given a new paint job featuring the Millennium Falcon from the Star Wars saga\n\nThe themed plane is called The Falcon. The entire livery took weeks to produce and uses 14,000 millimetres of ink\n\nThe themed plane, called 'The Falcon', will transport holidaymakers from London Gatwick Airport to Orlando, Florida.\n\nThere they will be able to experience Star Wars: Galaxy's Edge, which opened at Walt Disney World Resort last month.\n\nJoe Thompson, managing director of Virgin Holidays, said: 'We are incredibly proud to see The Falcon take flight, featuring the iconic Millennium Falcon, from the much-loved Star Wars saga, as it wings passengers to experience the thrilling new Star Wars: Galaxy's Edge land at Walt Disney World Resort in Florida.\n\n'Over the past three decades, we have taken millions of British holidaymakers to enjoy the magic of Disney and we know that so many of our customers have been excited about planning their trip to experience this new land. We hope those lucky enough to board The Falcon will enjoy their journey with us even more.'\n\nDave Napper, senior engineer at Virgin Atlantic, said: 'It was a very exciting brief to be able to redesign our aircraft livery to represent something as iconic as the Millennium Falcon and it's not something that you get to do every day.\n\n'We have many Star Wars fans within the company who jumped at the chance to get involved in some way, and we cannot wait to see The Falcon take flight.'\n\nThe aircraft will transport holidaymakers from London Gatwick Airport to Orlando, Florida, where they can visit Star Wars: Galaxy's Edge at Walt Disney World Resort\n\nAs well as The Falcon official plane unveiling, Virgin Holidays has launched The Ultimate Virgin Holidays Star Wars Experience – a curated themed holiday experience to Walt Disney World Resort in Florida, which will take off between February 15 and 22, 2020.\n\nThe experience includes return flights from Gatwick to Orlando, access to Star Wars: Galaxy Edge an hour before the park opens, the chance to meet Star Wars characters, a Star Wars themed dinner with a Disney Imagineer and accommodation at a Walt Disney World resort hotel.\n\nTo celebrate the concept, the travel firm has launched a social media competition, encouraging members of the public who spot the plane to capture and share their images of it for the chance to win two seats on board The Ultimate Virgin Holidays Star Wars Experience.\n\nThe images need to be tagged with both Virgin Holidays and Virgin Atlantic and include #TheFalcon in the photo caption.\n\nAll entries received by Wednesday 9 October will be entered into a prize draw.", "description": "The themed plane will transport holidaymakers from London Gatwick Airport to Orlando, Florida. There they will be able to experience Star Wars: Galaxy's Edge at Walt Disney World Resort.", "authors": ["Jennifer Newton For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/25/15/18922750-0-image-a-108_1569423060083.jpg", "published_at": "2019-09-25"}