{"pub": "bbc", "url": "https://bbc.com/news/world-asia-india-50120613", "downloaded_at": "2019-10-21 05:37:09.382636+00:00", "title": "India and Pakistan blame each other over Kashmir shelling", "language": "en", "text": "Image copyright Getty Images Image caption Tensions between the two countries have ratcheted up in 2019\n\nIndia and Pakistan have blamed each other for shelling across the line of control, the de facto border that divides the disputed region of Kashmir.\n\nBoth sides say they retaliated only after the other violated a ceasefire in place since 2003, allegedly killing civilians and soldiers on both sides.\n\nThe nuclear-armed neighbours have already fought two wars and a limited conflict over Kashmir.\n\nBut this year tensions between the rivals sharply intensified.\n\nIn February, India launched air strikes against militants in Pakistani territory in response to a suicide attack in Kashmir which killed 40 Indian soldiers. The Pakistan-based Jaish-e-Mohammad (JeM) group said it had carried out that attack.\n\nIn August, India stripped the part of Kashmir it administers of its partial autonomy, sparking sharp criticism from Pakistan. Since then Pakistani Prime Minister Imran Khan has been lobbying for international support against the move, which he has described as \"illegal\".\n\nDelhi and Islamabad both claim Kashmir in full, but control only parts of it.\n\nImage copyright Getty Images Image caption Pakistan says India targeted the homes of civilians across the border\n\nA major escalation in hostilities on the border this year also threatens a ceasefire that was agreed in 2003. The latest round of shelling occurred on Sunday in the border villages of Titwal and Tangdhar in Kashmir's Kupwara district but both sides provided differing accounts of what happened.\n\nIndia accused Pakistan of targeting civilians and killing one man and injuring three others. The chief of the Indian army, General Bipin Rawat, told reporters that India retaliated by targeting militants and killing at least six Pakistani soldiers and destroying three camps.\n\nSkip Twitter post by @ANI #WATCH Army Chief General Bipin Rawat on Indian Army used artillery guns to target terrorist camps in PoK: On the basis of reports that we have been getting, 6-10 Pakistani soldiers have been killed, 3 camps have been destroyed. Similar no. of terrorists have also been killed... pic.twitter.com/a19gOD90Ab — ANI (@ANI) October 20, 2019 Report\n\nBut Pakistan's army spokesman Major General Asif Ghafoor said it was India that had violated the ceasefire, \"deliberately targeting civilians\". He said nine Indian soldiers were killed and several injured in retaliatory fire.\n\nSkip Twitter post by @OfficialDGISPR Indian unprovoked CFVs in Jura, shahkot & Nousehri Sectors deliberately targeting civilians. Effectively responded. 9 Indian soldiers killed several injured. 2 Indian bunkers destroyed.\n\nDuring exchange of fire 1 soldier & 3 civilians shaheed, 2 soldiers & 5 civilians injured. — DG ISPR (@OfficialDGISPR) October 20, 2019 Report\n\nIndia's home ministry says there have been over 2,000 \"unprovoked\" ceasefire violations across the de facto border by the Pakistani army so far this year, which have killed 21 Indians.\n\nPakistan says more than 45 people, including 14 soldiers, died in firing by Indian forces from across the border in 2019.", "description": "The nuclear-armed rivals exchanged fire across the de facto border, a fresh escalation of tensions.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/142EE/production/_109307628_gettyimages-1176205048.jpg", "published_at": "2019-10-21"}