{"pub": "reuters", "url": "https://in.reuters.com/article/southkorea-swinefever/south-korea-detects-first-african-swine-fever-outbreak-ministry-idINKBN1W12X0", "downloaded_at": "2019-09-17 00:56:29.955790+00:00", "published_at": "2019-09-17", "title": "South Korea on highest alert after African swine fever found", "language": "en", "text": "SEOUL (Reuters) - South Korea has raised its animal disease alert to the highest level after discovering its first outbreak of deadly African swine fever at a pig farm in Paju, a town near its border with North Korea, the agriculture ministry said on Tuesday.\n\nThe case was reported less than four months after North Korea reported its first outbreak in late May.\n\nKim Hyeon-soo, South Korea’s agriculture minister, told reporters on Tuesday that in addition to raising the alert level, nearly 4,000 hogs would be culled to prevent the spread of the virus.\n\n“We will make all efforts to stop the spread of African swine fever through swift disinfection measures,” Kim said.\n\nThe ministry also ordered a nationwide movement ban of hogs and related livestock for 48 hours while looking into the source of the virus, he said.\n\nAfrican swine fever is highly contagious and nearly 100% fatal to swine herds. It occurs among pigs and wild boars, transmitted by ticks and direct contact between animals. There is no vaccine for the disease, but it does not affect humans.\n\nThe first outbreak of African swine fever in East Asia was reported in China in early August 2018. Since then, the deadly virus has spread to all Chinese provinces and regions, as well as to other Asian nations, including Vietnam and the Philippines.\n\nSouth Korea, Asia’s fourth-largest economy, does not import any pork products or live pigs from China due to China’s history of foot-and-mouth disease outbreaks. It mainly imports from the United States and Germany, and pork imports account for about a third of the country’s total pork supplies.\n\nAlthough this is the first time African swine fever has hit South Korea, an incidence of foot-and-mouth disease was confirmed in March 2018 at a hog farm, the country’s first discovery since February 2017.\n\nSouth Korea has a pig population of 11.3 million, according to Statistics Korea, and pork, cheaper than beef, is South Korea’s most popular meat, particularly pork belly for barbecue. Pork consumption per person in 2018 was 27.0 kg, according to the agriculture ministry data.\n\nThe outbreak has not yet been reflected in South Korea’s retail pork prices. The average retail price of local pork belly was 2,013 won ($1.70) per 100 gram (0.22 lb) as of Sept.16, down from 2,206 won per 100 gram a year earlier, according to data from state-run Korea Agro-Fisheries & Food Trade Corp.\n\nSlideshow (5 Images)\n\nIn the first eight months of this year, South Korea imported 374,961 tonnes of pork, down 3.6% from 388,772 tonnes over the same period a year earlier, according to customs data. In 2018, South Korea’s pork imports were over 570,000 tonnes.\n\nFollowing the discovery of African swine fever, shares of animal medicine suppliers Eagle Veterinary Technology and Cheil Bio soared as much as 30%.\n\nShares of chicken-related firms including Maniker and Harim also surged nearly 30%.", "description": "South Korea has raised its animal disease alert to the highest level after discovering its first outbreak of deadly African swine fever at a pig farm in Paju, a town near its border with North Korea, the agriculture ministry said on Tuesday.", "authors": ["Joori Roh", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190917&t=2&i=1430881139&w=1200&r=LYNXMPEF8G17V"}