{"pub": "news24", "url": "https://fin24.com/Economy/Africa/zimbabwe-crisis-cellphone-tariffs-double-petrol-price-jumps-12-20191030", "downloaded_at": "2019-10-30 11:27:18.666171+00:00", "title": "Zimbabwe crisis: Cellphone tariffs double, petrol price jumps 12%", "language": "en", "text": "Amid a growing economic disaster, Zimbabweans are facing steep hikes in cellphone rates and fuel prices this week.\n\nThe Zimbabwe Energy Regulatory Authority (ZERA) announced on Tuesday a 12% increase in the price of petrol from Z$14,97 to Z$16,75 (R15.57 using Tuesday’s exchange rate of Z$1: R0,932) while that of diesel increased from Z$15,64 to Z$17,47 (R16.24).\n\n\n\nAccording to the statement issued by ZERA, the fuel price increase was driven by the weakening of the Zimbabwean dollar against the US dollar which is used to import fuel.\n\nThe exchange rate used stood at Z$15,57 per US$1 weakening from an exchange rate of Z$13 per US$1.\n\nMeanwhile the telecoms regulator, Postal and Telecommunications Regulatory Authority of Zimbabwe (Potraz) approved a 95% increase in mobile tariffs across board.\n\nThe increase comes after the regulator approved another 182% increase as recently as August 2019.\n\nJustifying the increase, Potraz said the current tariff threshold that was set in August 2019 have been rendered \"unsustainable as the operating environment has further deteriorated due to inflationary pressures.\"\n\n\"Accordingly, the Authority has found it necessary to review tariff thresholds for telecommunication services by up to 95.39% based on the Telecommunication Price Index (TPI) that was computed in consultation with all operators.\n\n\"In view of the foregoing, and guided by the Act, all public switched and mobile operators may adjust their tariffs in line with the above thresholds for approval by the Authority,\" reads Protraz's statement.\n\nThe latest adjustment will see on-net calls per minute cost 96 cents (Zimbabwean dollars) or 89.28 South African cents, up from 48 cents (Z$) or 44.64 cents (SA).\n\nThe new price and tariff increase come at a time the country's statistics agency (Zimstat) said the Total Consumption Poverty Line (TCPL) for an average of five persons per household stood at $2 192.00 (R2 038) in September 2019.\n\nThe poverty datum line (PDL) represents the cost of a given standard of living that must be attained if a person is deemed not to be poor.\n\nThe lowest paid government worker in Zimbabwe earns $1,030 roughly (R958).", "description": "The telecoms regulator hiked tariffs by 95% this week - after a 182% increase in August.", "authors": ["Crecey Kuyedzwa"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/5486/d5e3f7204c5e4d02bcc2ad8350105052.jpg", "published_at": "2019-10-30"}