{"pub": "fox", "url": "https://foxbusiness.com/markets/boris-johnson-brexit-extension-deadline-eu", "downloaded_at": "2019-10-20 12:32:15.267834+00:00", "title": "Boris Johnson asks for Brexit extension after Parliament forces his hand", "language": "en", "text": "UK Prime Minister Boris Johnson's promise that his country will leave the European Union by Oct. 31 may be in jeopardy — because of a request he made.\n\nContinue Reading Below\n\nJohnson sent an unsigned letter to the EU late Saturday seeking a delay to Britain's impending departure from the bloc, as required by law. But he followed it with a signed letter indicating that he does not favor another Brexit extension.\n\n\"While it is open to the European Council to accede to the request mandated by Parliament or to offer an alternative extension period, I have made clear since becoming Prime Minister, and made clear to Parliament again today, my view, and the government's position, that a further extension would damage the interests of the U.K. and our EU partners, and the relationship between us,\" Johnson wrote to European Council President Donald Tusk.\n\nEU officials have not responded to the request and say consultations are underway. The formal granting or denial of an extension by the bloc may not be made until the Brexit deadline is just a few days away, but most signs indicate the EU would prefer an extension to an abrupt U.K. departure from the bloc without a deal in place.\n\n\"It now looks unlikely that we will\" leave by Halloween, Brexit Party leader Nigel Farage told \"FOX & Friends\" Sunday. \"The anger that is building among British voters is unlike anything we have seen before.\"\n\nJohnson's letters came after another tumultuous day in the House of Commons, which worked in a Saturday session for only the first time since the Falklands War in 1982. For hours, British lawmakers issued both ringing endorsements and scathing condemnations of Johnson's Brexit deal, only to kick any decision on it down the road by passing an amendment withholding approval for the deal until laws enabling it are passed. That could take days, or even weeks.\n\nJohnson has been determined to take the country out of the 28-nation bloc on Oct. 31, but lawmakers are trying to avoid a no-deal Brexit, which economists say would wreak damage on the U.K. economy.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nThe Associated Press contributed to this report.", "description": "Johnson sent two different letters to the EU.", "authors": ["Evie Fordham"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/AP19292382533390-e1571571921413.jpg?ve=1&tl=1", "published_at": "2019-10-20"}