{"pub": "yahoo", "url": "https://news.yahoo.com/activists-strikes-hit-iran-backed-065755160.html", "downloaded_at": "2019-09-10 02:20:17.599058+00:00", "title": "Syria says Israel was behind airstrike in country's east", "language": "en", "text": "Spanish U.N peacekeepers patrol the Lebanese side of the Lebanese-Israeli border in the southern village of Kfar Kila, Lebanon, Monday, Aug. 26, 2019. Lebanon's state-run National News Agency said Monday that Israel's air force attacked a Palestinian base in the country's east near the border with Syria. Lebanese President Michel Aoun told the U.N. Special Coordinator for Lebanon, Jan Kubis, that the attacks violate a U.N. Security Council resolution that ended the 2006 war between Israel and Hezbollah. (AP Photo/Mohammed Zaatari)\n\nBEIRUT (AP) — Unknown warplanes targeted an arms depot and posts of Iranian-backed militias in eastern Syria, near the Iraqi border, killing at least 18 fighters in a nighttime attack, Syrian opposition activists said Monday. A Syrian security official said Israeli jets staged the airstrikes, but denied there were any casualties.\n\nThe attack comes amid rising tensions in the Middle East and the crisis between Iran and the U.S. in the wake of the collapsing nuclear deal between Tehran and world powers.\n\nAn official with an Iranian-backed militia in Iraq also blamed Israel for the airstrikes that hit in the eastern Syrian town of Boukamal early Monday. There was no immediate comment from Israel, which views Iran as its greatest threat and has allegedly struck Iran-linked targets as far away as Iraq in recent weeks.\n\nIsrael frequently attacks Iranian targets in Syria and is believed to have recently crash-landed drones in southern Beirut in a stronghold of the Iranian-backed Hezbollah group.\n\nIsraeli Prime Minister Benjamin Netanyahu said last month that Iran has no immunity anywhere and that the Israeli military forces \"will act — and currently are acting — against them.\"\n\nAccording to the Britain-based Syrian Observatory for Human Rights, the airstrikes began late Sunday and continued after midnight, killing 18 Iranian and pro-Iranian fighters and also causing extensive damage.\n\nThe Sound and Pictures, a local activist collective in eastern Syria, gave a higher death toll, saying 21 fighters were killed and 36 wounded. The collective said the strikes targeted positions belonging to Iranian militias and those of Iraq's Popular Mobilization Forces, a mostly Iran-backed Shiite militia, but did not say who the dead and wounded were.\n\nA Syria-based official for the Iraqi militia claimed that Israel was behind the attack, adding that four missiles fired by warplanes hit a post manned by Iranian gunmen and members of Lebanon's Hezbollah group.\n\nThe official, who spoke on condition of anonymity because he was not authorized to talk to the media, said there were no Iraqi casualties in the strike, which he said hit about 3 kilometers (2 miles) from the Iraqi border.\n\nA Syrian security official cited by the government-controlled Syrian Central Military Media said the Israeli planes targeted a military camp that was being set up by the Syrian army and its allies. It said the structure was deserted at the time and the strike did not cause any casualties, contrary to the reports.\n\nThe official claimed the planes used Jordanian airspace and were \"aided\" by American forces stationed at the Tanf garrison, near Syria's eastern border with Jordan. \"We hold the Americans and Israelis responsible for these acts of aggression which cross the red lines,\" said the official, who was not named.\n\nMeanwhile, the Israeli military had no comment on the airstrike but said rockets launched from Syria on Monday fell short and did not land in Israel. The military said the rockets were launched from the outskirts of Damascus by Shiite militants operating under the Iranian Revolutionary Guard. The military said it holds the Syrian government responsible for the attempted attack.\n\nAlso Monday, Lebanon's Hezbollah said it shot down an Israeli drone over southern Lebanon, shortly after it crossed from Israel amid rising tensions along the border between the two countries in recent weeks.\n\nA Hezbollah statement said the drone was downed with \"suitable weapons\" over the village of Ramieh and that the militants now have it. The statement did not elaborate further.\n\nThe Israeli military said a \"drone on a routine mission in northern Israel fell,\" without elaborating on what it was doing or how it was downed. It said that the drone was \"simple\" and that there was no risk of a breach of information if it fell into enemy hands. The military said the drone went down Sunday, not Monday, and the reason for the discrepancy was not clear.\n\nLast month, Hezbollah leader Hassan Nasrallah said his group would confront and shoot down any Israeli drones that enter Lebanese airspace, raising the potential for conflict amid heightened tensions.\n\nNasrallah spoke after authorities said one alleged Israeli drone crashed in a Hezbollah stronghold in southern Beirut, landing on the roof of a building that houses Hezbollah's media office, and another exploded and crashed in a plot behind the building, causing material damage.", "description": "Unknown warplanes targeted an arms depot and posts of Iranian-backed militias in eastern Syria, near the Iraqi border, killing at least 18 fighters in a nighttime attack, Syrian opposition activists said Monday.  A Syrian security official said Israeli jets staged the airstrikes, but denied there were", "authors": ["Bassem Mroue", "Qassim Abdul-Zahra"], "top_image": "https://s.yimg.com/uu/api/res/1.2/fQtpSKYV8YoO_Ng7B1w6vA--~B/aD0zNDU2O3c9NTE4NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/d9adc98450d84250c98eeb66b4a4e158", "published_at": "2019-09-09"}