{"pub": "dailymail", "url": "https://dailymail.co.uk/home/event/article-6170937/Goes-like-rocket-just-shame-looks-dont-thrill.html", "downloaded_at": "2019-10-07 12:29:40.355190+00:00", "title": "Goes like a rocket! (just a shame the looks don’t thrill)", "language": "en", "text": "VW Polo GTi\n\n(to look at)\n\nRating:\n\n(for everything else)\n\nRating:\n\nMy kids are already thinking about Christmas. It’s the only way they can cope with the prospect of yet another year at school, from the mandatory sentence of 14 years that has been dished out to them. They have my deepest sympathy. School either starts too soon or goes on for far too long, take your pick. It only takes half that time to become a rocket scientist or a brain surgeon – what the heck’s that about?\n\nIt’s also very much Christmas in my business, which is why, between now and December, all sorts of characters are clamouring to get on the type of radio show I do, to flog their wares. Not that this is at all a bad thing: it’s actually a very good thing, providing a glut of juicy content and colourful contributors.\n\nLike Simon Reeve this week, ‘that nice empathetic travel reporter’, as many people see him. Or how about, instead, the former 20-something who wrote the only book about super-terrorism and Osama bin Laden pre-9/11, called The New Jackals? It went on to become a New York Times bestseller. I know this because I read about it in his latest book, Step By Step, Reeve’s autobiography. It’s fantastic.\n\nThe VW Polo GTi. Firing up the engine gives rise to an unexpectedly raspy and rather exciting exhaust noise from the exact same power plant as the one in the new Golf GTi\n\nTake That are popping in next Friday to promote their 30th anniversary tour and Greatest Hits album, Rod Stewart is due to perform live in the studio, as are Seasick Steve and Tom Odell. Movie-wise, Michael Caine’s new pic, The King Of Thieves, is out this weekend and I’m particularly looking forward to the Freddie Mercury biopic, Bohemian Rhapsody, which is out on October 24.\n\nWhat’s not to like about any of that? But here’s the thing: if you fancy treating yourself to a new car for Crimbo, the end of this month is deal weekend. The end of the third quarter, when all the sales guys will be at their most ‘accommodating’ in the push to hit their pre-Xmas targets, thus bagging their much-deserved Christmas spends.\n\nIn which case, new Polo GTi anyone? Sure, it’s not the legend that is the Golf GTi, nor the outgoing Beetle, for which the death knell sadly chimes, but it is almost £10k cheaper than a Golf and miles more fun to drive than a Bug.\n\nFirst off, though, let’s get the downside out of the way.\n\nDear VW, why oh why didn’t you make your latest GTi incarnation more exciting to look at?\n\nIt’s dull. Like, really dull. It’s a GTi for crying out loud, and, what is more, a 2018 GTi. It’s just about OK from the front, but there endeth any further allure.\n\nWhat a waste. It has the odd clean line or two, but so does an ironing board. It’s also too high at the back, like the rear suspension is petrified of what the design team was about do next.\n\nInside is a different story, however. The signature tartan Golf GTi seats are present and correct, both in the front and rear, smaller but perfectly formed and supportive.\n\nFrom the pilot’s point of view, the driving position is excellent and the interior vista is spiced up with bare metal inserts (colour-matched to the exterior) on the main dash, central console and around the door-pulls.\n\nThe main info screen works well and the instruments are clear, so all is good. My only gripe is the lack of a central armrest – with plenty of room in between the front seats, the space is crying out for one.\n\nTECH SPEC Price £23,155 Engine 2.0-litre petrol Gearbox Six-speed DSG Power 200hp 0-60mph 6.7 seconds Top speed 147mph First year road tax £205 Fuel economy 47.9mpg\n\nNow to the best bit: firing up the engine gives rise to an unexpectedly raspy and rather exciting exhaust noise from the exact same power plant as the one in the new Golf GTi (albeit not quite as tweaked, fizzing and hot). Regardless, this causes one to suspect that more fun may be on offer here than it first appeared.\n\nWhich turns out to be precisely the case. This may not be the quickest supermini hot hatch on the market today, with 200hp and a 0-60mph time of 6.7 seconds, but I can’t imagine any of its main rivals ‘feel’ significantly quicker without completely ragging the granny out of them.\n\nWithin seconds I was having a whale of a time, flicking from one driving mode to the next while alternating between manual paddle-shift and auto transmission to see which combination produced the best pops, bangs and gurgles.\n\nThe six-speed DSG gearbox is not exactly lightning-quick up and down the cogs but by no means is it laggy or jumpy either. ‘This is amazing, Dad, for a Polo!’ squealed number one son. I couldn’t disagree. Purists will, of course, lament the lack of a third pedal and an old-fashioned manual set-up, but worry not, it’s on the way, apparently.\n\nUp front there could be twitchiness in the form of torque steer, as we are talking a considerable amount of oomph being channelled through the front wheels only. But no, not a bit of it. As always, the gurus at VW seem to have totally sussed the challenges of front-wheel drive. Try as one might to agitate and agonise proceedings, the nose remains firmly planted at all times.\n\nIt’s just about OK from the front, but there endeth any further allure. What a waste\n\nGeneral handling is also extremely stable, instilling confidence from the off and leading to limitless smiles out on the road.\n\nThe traction controls can be deselected but frankly there’s little point with a GTi pocket-rocket that’s set up as well as this. The brakes are bigger than ever before, as is the boot, two further reasons to contemplate a note to Santa.\n\nBut it’s the value for money this whole package represents that is the real carrot: prices start at £21.5k for this five-door and mine came in at a touch over £23k including plenty of options. That’s mightily impressive.\n\nIt’s just a real bummer that good looks aren’t part of that, especially when you cast your eye over the current crop of handsome Golfs, Ups and Sciroccos.\n\nFive stars for everything else then, but only three (and that’s being generous) for the torso. An aesthetic opportunity missed. Alas.", "description": "First off, though, let’s get the downside out of the way. Dear VW, why oh why didn’t you make your latest GTi incarnation more exciting to look at?", "authors": ["Chris Evans Event For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/i/newpix/2018/09/15/12/5032AFF600000578-0-image-a-6_1537011563618.jpg", "published_at": "2018-09-15"}