{"pub": "nationalreview", "url": "https://nationalreview.com/the-morning-jolt/the-nba-shamelessly-panders-to-china", "downloaded_at": "2019-10-10 15:13:35.620747+00:00", "title": "The NBA Shamelessly Panders to China", "language": "en", "text": "Outside the NBA Store in New York City (Brendan McDermid/Reuters)\n\nMaking the click-through worthwhile: deeply ominous signs at home and abroad, as NBA teams start taking steps to stifle any expression of criticism against China by fans; and the American abandonment of the Kurds bears its first bitter fruit.\n\nThe NBA Starts Enforcing China’s Speech Restrictions on American Soil\n\nYou should see the “Google Uighurs” sign that arena security removed from Capitol One arena last night, as the Washington Wizards played a preseason game against the Guangzhou Long-Lions. It’s barely bigger than an 8×11 sheet of paper. The man holding it is not obstructing anyone’s view — it’s an NBA preseason game on a weeknight, there are tons of empty seats — and he’s not being profane, disruptive, or creating any problem for any other fans.\n\nAdvertisement\n\nAdvertisement\n\n“No political signs,” the security guy says — and to the extent we can read his body language, at least initially he doesn’t appear eager to enforce this edict. But when asked if he knows what the Uighurs are, he responds, “I’m not interested in having a political conversation.”\n\nI presume he has never, as the sign recommended, googled to learn more about the Uighurs. There are anywhere from one million to two million Uighurs in concentration camps in Western China. Human rights organizations have detailed that those camps are rife with torture, abuse, rapes, forced abortions, and sterilizations. The Chinese government is destroying traditional Uighur burial grounds and paving over their graveyards. The Chinese government is attempting to completely erase Uighur culture; what we are witnessing is a slow-motion state-sponsored genocide.\n\nAdvertisement\n\nBut arena staff, presumably taking their instructions from Wizards owner Ted Leonsis and/or the NBA as a whole, believed “Google Uighurs” is too political a sign to have at the game. The Washington Wizards have welcomed and saluted Joe Biden at their games, but that wasn’t too political. Players wore “I can’t breathe” t-shirts after Eric Garner’s death, but that wasn’t too political. (Apparently the NBA is fine with protesting American police brutality, but not Hong Kong police brutality.) The Miami Heat wore hoodies in warmups “in solidarity with Trayvon Martin” in 2012, and two years earlier, the Phoenix Suns wore “Los Suns” jerseys to protest that controversial Arizona immigration law. So clearly some forms of political protest are not merely tolerated or accepted but endorsed by NBA teams.\n\nAdvertisement\n\nBut any protest relating to China is unacceptable.\n\nAnother pro-Hong Kong sign was taken away by security during the United States National Anthem. It was taken away before the singer got to the lyric “in the land of the free and home of the brave.” Please consult your doctor before consuming such painfully concentrated doses of irony.\n\nAdvertisement\n\nCesar Conda says he saw another fan kicked out for chanting, “free Hong Kong.” (As Conda notes, fans yell exceptionally rude things at the referees or opposing players and no one minds.) Candice Bucker has video footage of security confronting another pair of fans. Patrick Hedger says he got kicked out.\n\nAdvertisement\n\nA spokesman for the Wizards contends no one was asked to leave the game. In other news, the Chinese government contends that “most people” have been released from the concentration camps. (Never mind that footage from drones posted last week shows hundreds of people bound and blindfolded being unloaded off a train into camps.)\n\nMeanwhile, up in New York, building security told a man protesting outside NBA headquarters that he couldn’t stand too close to the building.\n\nWe are living through a clash of two systems — one free, and one unfree, and the battlefield is right here in our own country. It is not “a time for choosing,” as Ronald Reagan said in his famous speech; the choice has already been made. And many of the biggest, wealthiest, and most powerful institutions in this country have made their choice: They support the unfree side and will voluntarily enforce its edicts.\n\nIf you’ve ever wondered what could unite Representative Alexandria Ocasio-Cortez and Senator Ted Cruz, as well as . . . this is it. They, along with Senator Ben Sasse, Senator Tom Cotton, Senator Ron Wyden, Representative Mike Gallagher, and others have written to NBA Commissioner Adam Silver and urged him to “suspend NBA activities in China until government-controlled broadcasters and government-controlled commercial sponsors end their boycott of NBA activities and the selective treatment of the Houston Rockets, and emphasize that the association will stand unified in the face of future efforts by Chinese government-controlled entities to single out individual teams, players, or associates for boycotts or selective treatment,” and “reevaluate the NBA’s training camp in Xinjiang, where up to a million Chinese citizens are held in concentration camps as part of a massive, government-run campaign of ethno-religious repression.”\n\nAdvertisement\n\nOver in Slate, Tom Scocca points out the ugly truth that Silver and the rest of the NBA don’t want to confront: If the Chinese government had this kind of a furious and heavy-handed reaction to a tweet, they’re only going to get worse in the future.\n\nAdvertisement\n\nChina has already played its hand. If Hong Kong is non-negotiable, there’s nothing to discuss. The subject will become more sensitive, not less, if the Hong Kong police move from tear gas and rubber bullets to the routine use of live ammunition, or if the People’s Liberation Army moves in. Would the NBA muzzle its employees then? Would the players and staff of a globally prominent American company censor their own feelings to protect the Chinese market? Why not take the stand before it gets to that?\n\nAdvertisement\n\nI am sure that the tweet from Houston Rockets general manager Daryl Morey deeply offended the Chinese government. You know what ought to offend all of us? Running concentration camps and brutal crackdowns and then expecting Americans to restrict the speech of other Americans on behalf of those running those concentration camps and brutal crackdowns.\n\nWe’re Abandoning the Kurds\n\nBehold, the fruits of a sudden change in American policy in the Middle East: “Fighting lit up the sky early Thursday as Turkish troops pressed their air and ground offensive against United States-allied Kurdish fighters in northern Syria. At least 16 Kurds were reported to have been killed, one monitoring group said.”\n\nTo say the members of the U.S. military who worked with and fought alongside the Kurds against ISIS are distraught is an understatement. “I am ashamed for the first time in my career,” one told Fox News’ Jennifer Griffin. “We met every single security agreement. The Kurds met every single agreement. There was NO threat to the Turks – NONE – from this side of the border. This is insanity.”\n\nAdvertisement\n\nMembers of the military are not infallible, but when everyone at the Pentagon, everyone in the intelligence community, and all of our allies and every expert on the region thinks a decision is a bad move, it takes a remarkably obstinate man to insist that he’s right and everyone else who’s been studying this region from the beginning is wrong. There is a willful blindness to the consequences and a message sent to every country and population around the world. The Kurds did everything the United States could possibly want against a foe that stunned the world with its cruelty, brutality, barbarism, and bloodthirstiness. And once our commander in chief believed we didn’t need them anymore — which is different from actually not needing them anymore — our country chatted with Recep Erdogan and let the Turks tear them apart.\n\nIt’s fascinating to see the president’s defenders insisting that we have to acquiesce to this long-desired military aggression on the part of the Turks. Funny, Turkey’s been our NATO ally all along, and up until last week, we believed it was a priority to keep the Turks — our fair-weather allies against ISIS — and the Kurds, our all-weather allies against ISIS, from going at each other.\n\nThe departure of U.S. forces means we’re no longer around to help the Kurds imprison 11,000 captured ISIS fighters. We’re apparently taking up “about five dozen” of the worst of the worst with us. Great, that means there are only 10,940 or so ISIS fighters who could break out during the upcoming fighting.\n\nBut apparently we don’t have to worry about ISIS fighters escaping, because, President Trump declared, “they’re going to be escaping to Europe. That’s where they want to go, they want to go back to their homes.” I guess we’re just cool with thousands of ISIS fighters running around Europe now.\n\nGee, it’s a good thing no Americans live in Europe.\n\nADDENDA: On this week’s The Editors podcast, Rich, Charlie, the soon-to-be-much-missed David French, and I discuss impeachment, the NBA, and Syria.", "description": "NBA teams are taking steps to stifle any expression of criticism against China by fans.", "authors": ["Jim Geraghty", "Victor Davis Hanson", "John Mccormack", "Rich Lowry", "Andrew C. Mccarthy", "A. G. Hamilton", "Zachary Evans", "Alexandra Desanctis", "Read More", "The American Conservative"], "top_image": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/nba-store-manhattan.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-10"}