{"pub": "yahoo", "url": "https://sg.sports.yahoo.com/rodgers-revival-leicester-dreaming-again-003710244--sow.html", "downloaded_at": "2019-10-24 04:56:51.627552+00:00", "title": "Rodgers revival has Leicester dreaming again", "language": "en", "text": "Revitalised by the appointment of manager Brendan Rodgers and free-scoring form of Jamie Vardy, Leicester City are once again upsetting the applecart of the Premier League's top six.\n\nThree years on from a remarkable title triumph that allowed football fans across the world to dream, third-placed Leicester could leapfrog defending champions Manchester City into second in the table with victory at Southampton on Friday.\n\nThe Foxes have more points after their opening nine game of the season than Claudio Ranieri's side managed in 2015/16 when they went on to beat odds of 5,000/1 to be crowned champions of England.\n\nThe standards set in recent seasons by City and European champions Liverpool, who already hold an eight-point lead over Leicester at the top of the table, mean the chances of matching that remarkable feat look just as slim now.\n\nHowever, Leicester do harbour realistic ambitions of a return to the Champions League by becoming the first side outside City, Liverpool, Tottenham, Chelsea, Arsenal and Manchester United to break into the top four in four seasons.\n\nWhen Rodgers took over in February, a squad filled with talented young players plus the title-winning experience of Vardy and goalkeeper Kasper Schmeichel was languishing in the bottom half of the table.\n\nSince then only City, Liverpool and Chelsea have taken more points than Leicester.\n\n- Rehabilitated reputation -\n\nRodgers endured a whirlwind ride in just over three years in charge at Liverpool, coming agonisingly close to ending the club's long wait for a league title in 2013/14 before being sacked in October 2015.\n\nHe rehabilitated his reputation with seven trophies in two-and-a-half seasons at Celtic before returning to the Premier League with an immediate impact.\n\n\"Leicester are built like you would like to build a team,\" said Liverpool manager Jurgen Klopp earlier this month, whose side needed a 95th minute penalty to beat the Foxes 2-1 at Anfield earlier this month.\n\n\"If you get a point against Leicester it will be a success for 95 percent of all the teams.\"\n\nSheffield United, Bournemouth, Tottenham, Newcastle and Burnley have already been put to the sword by Rodgers's men with Vardy very much the constant threat.\n\nThe former England striker has scored 15 times in 20 games under Rodgers.\n\n“He is a remarkable player. He is a world-class striker, there's no question about that,\" said Rodgers after Vardy's latest strike against Burnley.\n\n\"His numbers are phenomenal. He is always ready, and playing against teams that sit deep he can still find a way to score a goal.\n\n\"To be consistently at the level he can be at, it takes a huge amount of concentration.\"\n\nIndeed, Rodgers has even taken his other attacking players to task leaving too much of the goalscoring burden on the 32-year-old.\n\n\"There's no doubt we can get better,\" added Rodgers. \"The mentality is getting better and that is the exciting thing I have with this group, there is so much more to come from them.\"\n\nRodgers may soon also have even more talent at his disposal.\n\nLeicester's bright start to the campaign has come despite not spending most of the £80 million ($103 million) they received from Harry Maguire's move to Manchester United in August.\n\nAccording to reports on Thursday, the club are ramping up their plans to splash some of that cash in the January transfer window to take full advantage of the floundering fortunes of United, Arsenal and Tottenham to break the glass ceiling of the top four.", "description": "Revitalised by the appointment of manager Brendan Rodgers and free-scoring form of Jamie Vardy, Leicester City are once again upsetting the applecart of the Premier League's top six.  Three years on from a remarkable title triumph that allowed football fans across the world to dream, third-placed", "authors": ["Kieran Canning"], "top_image": "https://s.yimg.com/uu/api/res/1.2/kcSWUD3T.tHSNtxgUg3X8Q--~B/aD01MTE7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_sg/News/AFP/93da9ead8e81e0d72000ba3c44ed6c32426723e0.jpg", "published_at": "2019-10-24"}