{"pub": "independent", "url": "https://independent.co.uk/environment/extinction-rebellion-london-belgian-princess-esmerelda-arrest-billingsgate-climate-latest-news-a9153621.html", "downloaded_at": "2019-10-13 00:23:50.807565+00:00", "title": "Extinction Rebellion: Belgian princess among 1,300 arrested over climate demonstrations in London", "language": "en", "text": "A Belgian princess is among almost 1,300 people arrested in London this week during mass demonstrations demanding government action to tackle the global climate crisis.\n\n63-year-old Princess Esmeralda Dereth was among those arrested after she joined a sit-in protest in Trafalgar Square on Thursday, she told Belgian journalists.\n\nSpeaking to Belgian newspaper L’Echo, she said: “The more people from all sections of society protest, the greater the impact will be.”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nShe also tweeted: “Today along with many other protesters I was arrested and put in police custody. The climate emergency calls on all of us to put pressure on governments to act with urgency.”\n\nThe princess, who is the daughter of the late Leopold III of Belgium and his second wife Lilian Baels, Princess of Rethy, told the media she had been held in a police van for questioning for around five hours.\n\nShape Created with Sketch. Mont Blanc 100 years on: Climate change impact revealed Show all 7 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Mont Blanc 100 years on: Climate change impact revealed 1/7 Mont Blanc aerial photographs from 1919 (left) and 2019 (right) The images show the impact that climate change has had upon the mountain's glaciers Walter Mittelholzer, ETH-Bibliothek Zürich/Dr Kieran Baxter, University of Dundee 2/7 Walter Mittelholzer's biplane ETH-Bibliothek Zürich 3/7 Mont Blanc aerial photographs from 1919 (left) and 2019 (right) Walter Mittelholzer, ETH-Bibliothek Zürich/Dr Kieran Baxter, University of Dundee 4/7 Walter Mittelholzer ETH-Bibliothek Zürich 5/7 Mont Blanc aerial photographs from 1919 (left) and 2019 (right) Walter Mittelholzer, ETH-Bibliothek/Dr Kieran Baxter, University of Dundee 6/7 Dr Kieran Baxter photographing Mont Blanc in 2019 Dr Alice Watterson, University of Dundee 7/7 Dr Kieran Baxter in front of the glacier Dr Alice Watterson, University of Dundee 1/7 Mont Blanc aerial photographs from 1919 (left) and 2019 (right) The images show the impact that climate change has had upon the mountain's glaciers Walter Mittelholzer, ETH-Bibliothek Zürich/Dr Kieran Baxter, University of Dundee 2/7 Walter Mittelholzer's biplane ETH-Bibliothek Zürich 3/7 Mont Blanc aerial photographs from 1919 (left) and 2019 (right) Walter Mittelholzer, ETH-Bibliothek Zürich/Dr Kieran Baxter, University of Dundee 4/7 Walter Mittelholzer ETH-Bibliothek Zürich 5/7 Mont Blanc aerial photographs from 1919 (left) and 2019 (right) Walter Mittelholzer, ETH-Bibliothek/Dr Kieran Baxter, University of Dundee 6/7 Dr Kieran Baxter photographing Mont Blanc in 2019 Dr Alice Watterson, University of Dundee 7/7 Dr Kieran Baxter in front of the glacier Dr Alice Watterson, University of Dundee\n\nThe Metropolitan Police said: “As of 9.30hrs on Saturday, 12 October, there have been 1,290 arrests in connection with the ongoing Extinction Rebellion protests across London.”\n\nOn Saturday more than 100 healthcare professionals joined the sixth consecutive day of climate change protests in London.\n\nDoctors, nurses and medical students were among those demonstrating at Jubilee Gardens, near oil giant Shell’s London HQ, on Saturday in the “Health March for the Planet”.\n\nSeveral protesters leading the crowd wore hospital face masks, while others carried Extinction Rebellion flags and signs reading: “Climate change is a health issue.”\n\nAlex Turner, 36, a paediatric and emergency doctor from Bristol who was wearing his blue scrubs and stethoscope, told PA: “We are meeting outside Shell because they are one of the biggest companies involved in the oil and energy industry, and they have real power to decarbonise that industry.\n\n“We are protesting illegal levels of air pollution.”\n\nAnother protester said raising awareness about the effects of climate change on health is part of their “duty of care as healthcare professionals”.\n\nMeanwhile, former Paralympic cyclist James Brown appeared in court on Saturday morning charged with causing a public nuisance during the group’s protest at London City Airport on Thursday.\n\nThe 55-year-old, who is visually impaired, is accused of climbing on top of a British Airways plane and gluing himself to it, Westminster Magistrates’ Court heard.\n\nMr Brown denied causing a public nuisance and is due to stand trial on 8 November.\n\nSpeaking to reporters after the hearing, Mr Brown said: “I am not denying what I did, but I was compelled to do what I did because of my concerns for the future of my children.\n\n“We also know that non-violent civil disobedience has proven itself time and time [again] in history to bring about radical social change, and that is exactly what we need right now to divert us from this catastrophic path we are on.”\n\nDistrict Judge John Zani granted Mr Brown conditional bail, prohibiting him from going within one mile of any airport in the UK.\n\nOn Saturday, Extinction Rebellion-led protests against pollution and demanding action on the climate crisis were held in cities all over the world, including Dublin, Israel, Melbourne, Buenos Aires, Rome, Paris and Berlin, among many others.\n\nAdditional reporting by PA", "description": "A Belgian princess is among almost 1,300 people arrested in London this week during mass demonstrations demanding government action to tackle the global climate crisis. 63-year-old Princess Esmeralda Dereth was among those arrested after she joined a sit-in protest in Trafalgar Square on Thursday, she told Belgian journalists.", "authors": ["Harry Cockburn"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/12/18/princess-esmerelda-belgium.jpg", "published_at": "2019-10-12"}