{"pub": "cnbc", "url": "https://cnbc.com/2019/09/24/softbank-has-a-multi-million-dollar-protection-in-weworks-ipo.html", "downloaded_at": "2019-09-25 04:37:37.691345+00:00", "title": "WeWork investors like SoftBank have an obscure protection worth millions in a devalued IPO", "language": "en", "text": "Investors like SoftBank have an obscure protection that will grant them hundreds of millions in shares if WeWork's IPO value is lower than they bought in at in the private market.\n\nThe fine print is known as a ratchet, and speaks to the opaque nature of private markets and sky-high valuations. The real estate start-up's parent company was valued at $47 billion after its last funding round from SoftBank.\n\nIn the case of the WeWork's parent company, it was a \"partial ratchet\" disclosed on page 115 of its S-1 filing. If the stock price comes in below a certain price in the IPO, investors like SoftBank will receive additional shares as compensation.\n\nIf triggered, these protections usually result in only a few million dollars worth of extra shares, according to Matthew Kennedy, senior IPO market strategist at Renaissance Capital. But because SoftBank's latest round was so large and the possible down-round was looking to be less than half of that, the provision was expected to result in the world's largest IPO ratchet.\n\n\"As a result, the founder and employees would see their own shares diluted,\" Kennedy said. \"It doesn't look good for common shareholders to see that extra dilution on top of a down around.\"\n\nThe provision could grant existing shareholders $200 million to $500 million worth of additional shares, most of which would go to SoftBank, Kennedy said. For example, if WeWork's market cap came in at less than $14.5 billion post-IPO, the total value of additional shares issued to SoftBank under the provision would be more than $400 million.\n\nThese ratchet arrangements are not uncommon. It's often seen as a win-win for late stage investors who might want a guarantee they won't lose too much money. Late-stage Square investors were granted a full ratchet when it went public in 2014 that amounted in a $93 million in additional shares, according to Renaissance. A clause in Chegg's IPO resulted in $146 million in additional shares, while Box issued $67 million worth of additional shares.\n\nAswath Damodaran, professor of finance at the Stern School of Business at New York University, said ratchets are often \"glossed over\" because they rarely kick in. The WeWork case is \"unprecedented\" since the venture capital valuation was so high. That \"combination\" makes it a \"potentially dangerous situation,\" he said.\n\n\"We really don't know what these clauses are,\" he said. \"If I were a potential public market investor in WeWork, I would need complete disclosure on share count — tell me what's going to happen after the offering.\"\n\nDamodaran, sometimes referred to as the \"Dean of Valuation,\" recently analyzed the company's IPO filing and estimated that WeWork's equity is worth $14 billion — about 70% below its latest private market valuation.", "description": "The provision speaks to how opaque private valuations can be and the type of protection venture capital investors are able to negotiate.", "authors": ["Kate Rooney"], "top_image": "https://image.cnbcfm.com/api/v1/image/104465787-1569343235171gettyimages-681409884r.jpg?v=1569343255", "published_at": "2019-09-24"}