{"pub": "yahoo", "url": "https://news.yahoo.com/army-officers-impeachment-testimony-quandary-183838473.html", "downloaded_at": "2019-10-30 09:05:42.017278+00:00", "title": "Army officer tells impeachment inquiry of gaps in Trump's Ukraine transcript", "language": "en", "text": "A decorated army officer and the top Ukraine expert on the national security council has reportedly told House impeachment investigators that the White House transcript of a call between the presidents of the US and Ukraine left out important words and phrases.\n\nThe New York Times cited three sources familiar with Alexander Vindman’s testimony on Tuesday who said the omissions included Donald Trump making reference to recordings of the former vice-president Joe Biden and Volodymyr Zelenskiy making reference to Burisma, the company for which Biden’s son Hunter worked.\n\nLt Col Vindman tried to edit the White House reconstruction of the call to correct the omissions, but some of his edits were not incorporated into the transcript, according to the report.\n\nRelated: Democrats set to unveil Trump impeachment resolution as inquiry ramps up – live\n\nThe arrival of Vindman tipped Republicans into a spiral of internal conflict over how far to go – and what lines were unacceptable to cross – in defending the US president.\n\nVindman appeared on Capitol Hill wearing his US army dress uniform, which bore a combat infantry badge and a Purple Heart medal, bestowed when he was wounded by an improvised explosive device in Iraq.\n\nLike prior testimony in the month-old impeachment process, Vindman’s opening statement, published the night before, had the potential to be extraordinarily damaging for Trump.\n\nA top Ukraine expert, Vindman, 44, described his alarm at witnessing Trump and others attempting to force Ukraine into a charade designed to harm Trump’s political rival Joe Biden and sow doubts about Russian tampering in the 2016 US election.\n\nThat alleged conduct is at the heart of the impeachment inquiry, which could result in charges against Trump of abuse of power and other offenses.\n\n“I did not think it was proper to demand that a foreign government investigate a US citizen, and I was worried about the implications for the US government’s support of Ukraine,” Vindman testified.\n\nTop Democrats later said his testimony was “extremely disturbing” and called him “very credible”.\n\nTrump’s defenders zeroed in on the fact that Vindman was born in Ukraine, having left the Soviet Union in the 1970s with his family when he was three – a story celebrated in news reports at the time as a quintessential tale of American promise.\n\nAfter joining the army, serving in multiple overseas deployments, and earning a master’s degree from Harvard in Russian, Eastern Europe and Central Asian studies, Vindman worked for the White House.\n\nBut that did not protect him from attack on Tuesday by Trump, who expressed outrage on learning that Vindman was one of the aides who listened to a July call Trump held with the Ukrainian president, Volodymyr Zelenskiy.\n\nVindman was the first White House official to provide direct testimony on the contents of the 25 July call, which to this point have not been disputed by any party in the impeachment inquiry, including the White House, which last month released a summary of the call.\n\n“Why are people that I never even heard of testifying about the call?” Trump tweeted. He then accused Vindman of being a “Never Trumper”, or a dyed-in-the-wool Trump critic, but the claim was quickly debunked in multiple reports.\n\nThat did not stop Trump’s defenders in the media from attacking Vindman as disloyal.\n\n“Here we have a US national security official who is advising Ukraine, while working inside the White House, apparently against the president’s interest, and usually, they spoke in English,” said Fox News host Laura Ingraham. “Isn’t that kind of an interesting angle on this story?”\n\nHer guest, John Yoo, a former George W Bush administration lawyer infamous for drafting a framework for torture, agreed. “You know, some people might call that espionage,” Yoo said.\n\nBut the backlash in the Republican ranks, rare where Trump is involved, was unusually harsh.\n\n“That guy’s a Purple Heart. I think it would be a mistake to attack his credibility,” John Thune, the second-ranking Republican in the Senate, told Politico. “You can obviously take issue with the substance and there are different interpretations about all that stuff. But I wouldn’t go after him personally. He’s a patriot.”\n\nCongresswoman Liz Cheney of Wyoming, the daughter of former vice-presidentDick Cheney, and a member of the House Republican leadership, echoed Thune in a press conference.", "description": "Lt Col Vindman reportedly said omissions included references to Joe Biden and BurismaLt Col Alexander Vindman arrives for a closed-door deposition at the US Capitol in Washington DC on Tuesday. Photograph: Mandel Ngan/AFP via Getty ImagesA decorated army officer and the top Ukraine expert on the national", "authors": ["Tom Mccarthy In New York"], "top_image": "https://s.yimg.com/uu/api/res/1.2/X3q9fX1PJcorm97b9cdb2A--~B/aD0zMDA7dz01MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/the_guardian_765/8245449c40157967af5bd02b1a64a793", "published_at": "2019-10-30"}