{"pub": "politico", "title": "A new strategy on climate: Try to outlast Trump", "url": "https://politico.com/story/2019/08/30/trump-climate-strategy-1695813", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:10:56.697285+00:00", "text": "French President Emmanuel Macron (center-right) attended the G-7 summit session on climate change last weekend — President Donald Trump did not. | Andrew Parsons - Pool/Getty Images environment A new strategy on climate: Try to outlast Trump\n\nWorld leaders and major companies intent on dealing with climate change have settled on a strategy for handling President Donald Trump: snub him.\n\nWhen Trump’s Environmental Protection Agency this week proposed withdrawing Obama-era rules to limit emissions of methane from oil and gas wells or pipelines, major oil companies said they wanted the rules to remain. Some of the world’s largest automakers are ignoring the administration’s attempt to do away with rising fuel efficiency mandates. And when Trump skipped a climate change session at the G-7 summit last weekend, other world leaders said they were better off without him.\n\nStory Continued Below\n\n\"We know his position … and at the G-7 we did not have [an] objective to convince him to return,” French President Emmanuel Macron said of Trump after hosting this week's summit.\n\nTrump’s scorn for collective action to address global environmental consequences could have a lasting impact, freeing other leaders like Brazil’s Jair Bolsonaro to pursue their own nationalist policies. But the world leaders who are still committed to addressing climate change are now looking beyond Trump’s tenure.\n\n“They’re just trying to wait it out and hope he’s not there next year,” said Alden Meyer, the director of strategy and policy with the Union of Concerned Scientists, who has participated in international climate meetings since 1991.\n\nThe shift comes just ahead of a United Nations climate summit, where countries are expected to announce more ambitious goals to meet scientists’ increasingly urgent calls for action. Global leaders have largely given up on trying to convince Trump to abandon his pledge to ditch the Paris climate deal signed by his predecessor.\n\nMorning Energy newsletter The source for energy and environment news — weekday mornings, in your inbox. Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nInstead, United Nations Secretary-General António Guterres is trying to head off Trump’s dampening effect. He has met with officials from several G-20 countries to encourage new, bold commitments beyond those made when crafting the 2015 Paris climate accord in exchange for giving them a plum speaking spot at the U.N. climate summit that begins Sept. 23, Meyer said.\n\n\"If you look at the U.S. society, you see states, you see cities [and] you see businesses that are leading in relation to climate action. It’s not only governments that matter,\" Guterres said at the G-7, according to Fox Business. \"It’s the capacity of civil society, the business community and local authorities that will determine the level of emissions and the contribution of the country to the climate action. And so I am very optimistic about the American society and its capacity to deliver in relation to climate action.\"\n\nMany companies have also resisted Trump's deregulatory push, believing that weakening efforts to confront global warming will make them less competitive over the long term.\n\nLarge oil producers such as BP, Exxon and Shell have said they will continue working on methane reductions, despite the administration's announced rollbacks, and major automakers such as Ford and Honda have rejected the administration's proposed fuel-efficiency rollbacks and agreed to abide by tougher standards in a landmark deal with California announced in July.\n\nOn a call with reporters Thursday, EPA acting air chief Anne Idsal said the methane rule rollback “seeks to stop burdensome and costly federal regulations\" on oil and natural gas that provide minimal environmental benefit. \"Oil and gas are very valuable resources.\"\n\nWhile industry groups like the American Petroleum Institute praised the administration’s move, several individual companies called for keeping the Obama-era rules intact.\n\n“BP has been clear in its position that EPA should directly regulate methane emissions from new and existing sources,” the company said in a statement Thursday. “We believe this is the most effective way to protect the environment and maximize the benefits of natural gas.”\n\nEven as the world tries to move on without him, Trump's stance both emboldens leaders of developing countries to prioritize fossil fuel or agricultural development and also limits pressure on China and India, which must rapidly reduce emissions for the world to avoid devastating climate change. While other G-7 members have sought to apply pressure to Bolsonaro to do more about the fires raging in the Amazon, Trump has defended him.\n\n“The rise of right-wing populism throughout the world is a severe threat to climate change,” said Jason Bordoff, the National Security Council director of climate change and energy under Obama. “The Trump administration’s dismissal of climate change is really damaging. It does discourage other countries.”\n\nposter=\"http://v.politico.com/images/1155968404/201908/2949/1155968404_6077354855001_6077358172001-vs.jpg?pubId=1155968404\" true\n\nCountries in the G-20, an organization of the world’s largest economies, are playing the U.S. election waiting game in two major ways: Some are delaying bolder commitments and others are slow-walking projects, according to Andrew Light, a former Obama State Department official who is now at the World Resources Institute.\n\nLight suggested other nations' updated pledges would likely be stronger with a Democratic president, as it would send an international signal that the U.S. plans to reengage on climate change. A Democratic president would also likely resurrect international programs designed to enhance opportunities for U.S. businesses to provide technical support, investment and technology for other nations' energy transition plans.\n\n\"I’ve been saying that 2020 is going to be a very long 2020,\" Light said.\n\nBut Trump has fundamentally “upset the apple cart” on a range of international subjects, and that will remain true even after he leaves office, said Sarah Ladislaw, director of the energy and national security program at the Center for Strategic and International Studies.\n\nShe said the divide between how right-wing nationalist leaders viewed climate change as an affront to sovereignty and progressive populists saw it as a call to action seemed tough to bridge.\n\n“It was really sort of pronounced at the G-7 to see how deep that schism in that worldview is. It’s going to take a lot of creativity from people in climate diplomacy,” she said.\n\nBen Lefebvre contributed to this report.", "description": "The world leaders who are still committed to addressing climate change are now looking beyond Trump’s tenure.", "authors": ["Zack Colman"], "top_image": "https://static.politico.com/0e/b5/8b6181c243e0acb9f43fbcd54d93/190830-donald-trump-macron-gty-773.jpg"}