{"pub": "businessinsider", "url": "https://businessinsider.co.za/mandatory-south-african-sign-language-training-under-pan-south-african-language-board-pledge-2019-10", "downloaded_at": "2019-10-04 17:10:21.104538+00:00", "title": "Sign language training could be mandatory for many South Africans, especially police and social workers, by next week", "language": "en", "text": "The Pan South African Language Board has published a draft charter on South African Sign Language that will become final next week if nobody objects to it.\n\nIt creates obligations that will make sign language more commonly available in a range of situations, including anywhere front-line staff often deal with deaf people.\n\nIt also requires all television programmes to carry sign language interpretation.\n\nFor more stories go to www.BusinessInsider.co.za.\n\nThe South African government and other employers could by next week be obliged to provide at least some training in South African Sign Language to large swathe of staff – and some classes of employees could be required to spend more than a month in advanced-level sign language classes.\n\nOn Friday the Pan South African Language Board, a constitutional body with broad powers to monitor how the state treats different languages, gazetted a draft South African Sign Language Charter. The document, it says, \"applies to all segments of the South African society\" and \"creates obligations\" to protect the linguistic rights of the deaf community.\n\nThe document will become final if it receives no objections by Friday, 11 October, the Board said.\n\nThe charter requires anyone planning a meeting, conference, or similar event to consult deaf persons \"well in advance\" to make sure an interpreter of their choice is available.\n\nIt also stipulates that all televisions programmes must come with both close captions or subtitles and South African Sign Language interpretation.\n\nBanks, hospitals, and public transport points will be required to make public announcements through either sign language or close captioning, and \"front facing/and front-line employees at all entities\" will have to receive ongoing training that includes sensitisation to the needs of deaf people.\n\nAlthough it is not clear that the Board has such power, the document specifies a basic level of training for a wide range of people, including employees of private companies.\n\n\"[South African Sign Language] awareness and training should be mandatory to all staff members in the employ of government including municipalities, non-governmental organisations or in the private sector,\" one clause reads.\n\nMore advanced training in sign language will be required for staff \"who provide essential and support services and deal more frequently with Deaf people, for example social workers, police officers\".\n\nThe specified level of training requires students to be capable of holding a sustained, complex conversation in sign language. Courses to achieve such proficiency cost in the region of R6,000 per person and take around 240 hours to complete, or about a month and a half if evenly spread over workdays.\n\nReceive a daily email with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "A draft pledge from the Pan South African Language Board creates an obligation for private employers, and especially the state, to ensure employees can communicate in South African Sign Language.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9303/a15a0c9010a94e939fc9b584e4a1695f.png", "published_at": "2019-10-04"}