{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/16/WS5da671d4a310cf3e35570b25.html", "downloaded_at": "2019-10-16 03:57:18.341203+00:00", "title": "Exporters bank on BRI gains amid dark trade clouds", "language": "en", "text": "By Qiu Quanlin in Guangzhou | China Daily | Updated: 2019-10-16 09:26\n\nVisitors check out a treadmill on display at the China Import and Export Fair in Guangzhou, capital of Guangdong province. [Photo by Song Jinyu/For China Daily]\n\nLeading Chinese exporters remained optimistic on growth prospects in the overseas markets on Tuesday, despite slowing global growth and rising trade protectionism.\n\n\"We have made several breakthroughs in technology and maintained an advantage in production costs, after years of innovation in the development of various products,\" said Zhu Zhaoheng, sales director of Guangdong Hongyu Ceramics Co Ltd.\n\nThe company, based in Foshan, a manufacturing base in the heart of the Pearl River Delta region, along with some 25,000 domestic exporters, is optimistic of higher sales during the biannual China Import and Export Fair. Internationally known as the Canton Fair, the event is long regarded as the barometer of China's trade performance.\n\nAccording to Zhu, the company has maintained stable business growth in the Middle East, Southeast Asia and Australian markets in the past few years since it entered the international market in 2000. \"We will continue to look for opportunities to boost sales in the emerging markets,\" he said.\n\nZhu said the company is especially optimistic on growth prospects in markets across the Belt and Road Initiative economies. \"We are confident about transactions during this year's Canton Fair, thanks to years of innovation and quality of our products,\" he said.\n\nAccording to Xu Bing, spokesman of the Canton Fair, the biannual trade event had become one of the important platforms for trade between China and BRI markets. Buyers from the BRI markets accounted for up to 45 percent of the total international buyers during the fair in the past six years, according to Xu.\n\n\"We are building stronger cooperation with business associations related to the Belt and Road Initiative,\" he said.\n\nAccording to Xu, 53 industrial and commercial organizations from 35 countries and regions involved with the Belt and Road Initiative had established partnerships with the Canton Fair organizers.\n\nChina's foreign trade maintained stable performance from January to September, increasing 2.8 percent year-on-year, according to the General Administration of Customs.\n\nOf the total trade volume of 22.91 trillion yuan ($3.23 trillion) in the past three quarters, the country's exports expanded by 5.2 percent, while imports dropped 0.1 percent year-on-year.\n\nTrade between the world's second largest economy and the Association of Southeast Asian Nations, one of China's top two trading partners, hit 3.14 trillion yuan in the first nine months, up 11.5 percent year-on-year, according to the customs sources.\n\n\"Looking ahead, China's trade will maintain stable growth, with more exporters focusing on quality and innovation, despite slower global economic growth and rising trade protectionism,\" said Xu.\n\nAccording to Xu, buyers from 210 countries and regions have confirmed their participation in the Canton Fair, which opened on Tuesday in Guangzhou, the capital of Guangdong province.", "description": "Leading Chinese exporters remained optimistic on growth prospects in the overseas markets on Tuesday, despite slowing global growth and rising trade protectionism.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/16/5da671d4a310cf3e97a16690.jpeg", "published_at": "2019-10-16"}