{"pub": "breitbart", "url": "https://breitbart.com/national-security/2019/10/29/biden-mocks-trumps-foreign-policy-whats-the-plan-stan", "downloaded_at": "2019-10-30 00:06:09.835819+00:00", "title": "Biden Mocks Trump’s Foreign Policy: ‘What’s the Plan, Stan?’", "language": "en", "text": "Former Vice President Joe Biden mocked President Donald Trump’s foreign policy in an interview with the Washington Post on Tuesday, saying Trump had no idea what he was doing: “What’s the plan, Stan?” Biden asked.\n\nBiden criticized Trump’s foreign policy 48 hours after the president announced to the nation that Abu Bakr al-Baghdadi, the leader of the so-called “Islamic State” (ISIS), had been killed in a confrontation with U.S. forces.\n\nAccording to Biden, Trump would be unable to repeat the success of that raid because of his decision to pull U.S. troops out of Syria.\n\n“There’s no coherence. He has no foreign policy. He seems to act on a whim. … The way he is operating in Syria has made it highly unlikely that we would be able to repeat an event like [the Baghdadi raid] any time soon,” Biden told the Post, adding that he wants to leave a residual U.S. force in Syria.\n\nBiden did not explain exactly how he would do that, given that there is no congressional authorization for the use of military force in Syria beyond the 2001 resolution on the fight against terrorists in the wake of the 9/11 terror attacks.\n\nThe former vice president also told the Post that he had wanted to keep troops in Iraq in 2011, though the Post‘s Josh Rogin correctly pointed out that President Barack Obama had wanted a withdrawal to fulfill his campaign promises.\n\nBiden believes he has superior foreign policy credentials, thanks in part to his eight years in the Obama administration and his leadership of the Senate Foreign Relations Committee. But critics have argued that Biden has been wrong every time it counted. In Iraq, for example, he opposed the Gulf War in 1991, supported the Iraq War in 2002, and then proposed a sectarian partition of the country rather than the military “surge” that ultimately worked. Biden also worsened a rupture with Israel by condemning it in 2010 for building apartments in a Jewish neighborhood in Jerusalem.\n\nBiden was also responsible for the Obama administration’s policy on Ukraine at a time when Russia was advancing and the U.S. was refusing to provide military assistance. His son, Hunter Biden, was serving on the board of a Ukrainian oil and gas company, Burisma, creating a conflict of interest that Biden has never explained.\n\nTrump claims credit for defeating ISIS; for attacking Syria in response to its use of chemical weapons; for isolating Iran; for creating a regional Arab-Israeli alliance; for holding Russia back in Eastern Europe; for confronting China, both economically and militarily; and for starting nuclear talks with North Korean leader Kim Jong-un, among other achievements. Most recently, he brokered a cease-fire between Turkey and Syrian Kurds, using economic pressure.\n\nJoel B. Pollak is Senior Editor-at-Large at Breitbart News. He earned an A.B. in Social Studies and Environmental Science and Public Policy from Harvard College, and a J.D. from Harvard Law School. He is a winner of the 2018 Robert Novak Journalism Alumni Fellowship. He is also the co-author of How Trump Won: The Inside Story of a Revolution, which is available from Regnery. Follow him on Twitter at @joelpollak.", "description": "Joe Biden mocked Trump's foreign policy in an interview with the Washington Post on Tuesday, saying Trump had no idea what he was doing.", "authors": ["Joel B. Pollak"], "top_image": "https://media.breitbart.com/media/2019/08/IMG_6296-640x335.jpg", "published_at": "2019-10-29"}