{"pub": "cnbc", "url": "https://cnbc.com/2019/10/29/airbus-confirms-huge-sale-of-300-jets-to-indias-indigo-airline.html", "downloaded_at": "2019-10-29 15:03:47.940841+00:00", "title": "Airbus confirms huge sale of 300 jets to India's IndiGo airline", "language": "en", "text": "A protective cover sits on a wing engine fitting of an undelivered Airbus Group SE A320neo passenger jet, operated by IndiGo, a unit of Interglobe Enterprises Ltd., as it stands on the tarmac at Toulouse-Blagnac airport in Toulouse, France, on Sunday, May 15, 2016.\n\nIndia's budget carrier IndiGo has placed a firm order for 300 new aircraft from Airbus, with the European plane-maker saying it was one of the biggest orders ever agreed by a single airline operator.\n\nAll of the new planes will be from the A320neo range, making the Indian airline the world's biggest buyer of planes from Airbus's popular single-aisle family. The order will be a mix of A320neo, A321neo and A321XLR aircraft.\n\n\"We are delighted that IndiGo, one of our early launch customers for the A320neo, continues to build its future with Airbus, making Indigo the world's biggest customer for the A320neo Family,\" Airbus Chief Executive Officer Guillaume Faury said in a statement Tuesday.\n\nWhen using the latest published list prices for the aircraft, the deal would be worth around $33 billion in revenue to the European plane-maker. However, a steep discount is typically negotiated by airlines.\n\nThe latest purchase means that IndiGo has now ordered 730 planes from the A320 family.\n\nRiyaz PeerMohamed, chief aircraft acquisition and financing officer of IndiGo, said in the statement that the new planes will allow IndiGo to reliably \"maintain its strong focus on lowering operating costs and delivering fuel efficiency.\"\n\nPeerMohamed added that the choice of engine manufacturer would be made at a later date. No delivery schedule for the planes was announced.\n\nAirbus shares are around 1.6% higher for the session. The plane-maker's stock has risen more than 50% in 2019.\n\nLast week, U.S. budget carrier Spirit Airlines confirmed it had agreed on a provisional deal to buy 100 Airbus single-aisle jet planes.", "description": "At list prices the deal would be worth around $33 billion in revenue to the European plane-maker.", "authors": ["David Reid"], "top_image": "https://image.cnbcfm.com/api/v1/image/106210041-1572357322417gettyimages-531672482.jpeg?v=1572357370", "published_at": "2019-10-29"}