{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/23/doncic-porzingis-debut-carries-mavs-past-wizards-1", "downloaded_at": "2019-10-24 05:19:54.054963+00:00", "title": "Doncic-Porzingis debut leads Mavericks past Wizards, 108-100", "language": "en", "text": "DALLAS — Luka Doncic won a showdown with Bradley Beal because the star Dallas guard stayed in the game while his Washington counterpart was ejected after the last of several fourth-quarter exchanges between the two.\n\nNot long after, Kristaps Porzingis had a one-handed dunk on an alley-oop to help the Mavericks turn away a late rally by the Wizards.\n\nPerhaps not exactly how the Mavericks saw the European pair tag-teaming on the way to a win in their long-awaited first game together, but effective nonetheless.\n\nDoncic had 34 points and nine rebounds, Porzingis finished off his 23 points with the game-sealing dunk in the final minute and the Mavericks beat the Wizards 108-100 in the season opener Wednesday night.\n\n“It’s just hoops,” Beal said. “You see it when I got kicked out, he came over and he was the first one to dap me. We weren’t fighting. That was just basketball, trying to frustrate him. He was kicking our butt. Had to do something.”\n\nWashington rookie Rui Hachimura, the first Japanese-born player drafted in the first round, had 14 points and 10 rebounds. The ninth overall pick out of Gonzaga scored his first points before Porzingis hit his first bucket as a Maverick.\n\nThe Wizards had cut a 23-point deficit going into the fourth quarter to seven when Doncic and Beal were called for double technicals with 1:09 remaining. Beal was ejected when he was almost immediately whistled for a second technical.\n\nDoncic missed the free throw and a 3-pointer, but the Mavericks kept the ball alive and Jalen Brunson found a cutting Porzingis for the slam.\n\nPorzingis missed his first four shots before taking a break and coming back to score nine points in the final 2:45 of the first quarter. The 7-foot-3 Latvian acquired in a blockbuster deal with the New York Knicks before the trading deadline last season was 7 of 16 from the field.\n\nDoncic and Porzingis traded long 3-pointers throughout the game, finishing 7 of 16 between them (4 of 9 for Doncic, 3 of 7 for Porzingis). Doncic was 12 of 19 overall to help the Mavericks win their opener for the first time in four years.\n\nThe Slovenian guard and reigning NBA rookie of the year could have played with Porzingis last season, but the Mavericks decided to let the 2018 All-Star continue recovering from a knee injury in what ended up being his final game for the Knicks 20 months ago.\n\n“It’s finally here,” Porzingis said. “I just want to enjoy the moment. I don’t want to put too much pressure on myself when I’m out there. Most importantly I’m here to win. I’m not here to chase something individually.”\n\nBeal scored 19 points less than a week after the All-Star guard signed a $72 million, two-year extension that will go through the 2022-23 season, with a player option after that. The Wizards are without his backcourt mate, John Wall, who tore an Achilles tendon last December.\n\n“Give our guys credit, they battled back and then they cut the lead to a respectable number,” coach Scott Brooks said. “Brad came in and almost made it more interesting than the final score.”\n\nTIP-INS\n\nWizards: Moritz Wagner was 3 of 4 on 3-pointers and scored 13 points before the second-year player fouled out with three minutes left in his Washington debut. … Thomas Bryant had 14 points and 11 rebounds.\n\nMavericks: Dallas still isn’t sure how much longer Dwight Powell will be out with a left hamstring strain sustained early in training camp. The sixth-year player is expected to start at center when he’s ready. … G Tim Hardaway Jr. left the game in the second quarter after injuring his right ankle but returned before halftime.\n\nRUI’S DEBUT\n\nHachimura scored six points in the first quarter and finished 7 of 15 from the field. The 6-8 forward missed all three of his 3-point attempts, including one with the Wizards down nine points just inside two minutes. “This is just the beginning,” Hachimura said.\n\nLIFE AFTER DIRK\n\nThe first look for Dallas fans at the Doncic-Porzingis pairing came in the Mavericks’ first game at American Airlines Center without German star Dirk Nowitzki.\n\nTheir last home game without the only NBA player to spend all 21 seasons with the same franchise was April 14, 1998, a 111-95 loss to the Los Angeles Lakers at Reunion Arena. Nowitzki retired at 40 after last season as the league’s highest-scoring foreign-born player.\n\nUP NEXT\n\nWizards: At Oklahoma City on Friday night. The three-game trip is the club’s longest to open the season since 1983-84. The Southwest swing end in San Antonio with the first back-to-back. It’s the only visit to all three places for the Wizards in the regular season.\n\nMavericks: At New Orleans on Friday night.\n\n___\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Luka Doncic won a showdown with Bradley Beal because the star Dallas guard stayed in the game while his Washington counterpart was ejected after the last of several fourth-quarter exchanges between the two.", "authors": ["The Washington Times Http", "Schuyler Dixon"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/23/wizards_mavericks_basketball_23047_c0-0-2251-1313_s1200x700.jpg?26e08b70b8141e17f628b566d9339ef7cf0c2287", "published_at": "2019-10-23"}