{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7583127/Possessed-schoolboy-held-knife-throat-THROAT-INFECTION-triggered-outbursts.html", "downloaded_at": "2019-10-18 10:37:10.399906+00:00", "title": "'Possessed' schoolboy held a knife to his throat after a THROAT INFECTION triggered outbursts", "language": "en", "text": "An eight-year-old boy was left 'possessed' after a throat infection triggered a strange condition which caused him to have random outburst, laughing fits and tics.\n\nJack MacLaine, now 10, began complaining of a sore throat in January 2018, but when the symptoms died down his parents thought nothing of it.\n\nA few days later the normally-outgoing youngster, from Dumfries, refused to go to football training when he was overcome with anxiety.\n\nHis parents Alison, 44, and Neil, 64, were baffled when he told them he 'didn't deserve friends' and was 'going to take his clothes off and sit outside until he froze to death'.\n\nThe youngster's behaviour became increasingly erratic over four months, during which time he held a knife to his throat and told his parents he wanted to 'go to heaven'.\n\nHe was eventually diagnosed with PANDAS syndrome, an overreaction by the immune system to a bacterial infection.\n\nIt results in infection-killing antibodies attacking brain cells, causing a variety of erratic behavioural changes, such as obsessive compulsive disorder (OCD) and tics.\n\nJack MacLaine, 10, from Dumfries, refused to go to football training one Saturday when he was overcome with anxiety. He later came home and said he 'wanted to die'\n\nMother Alison, 44, said Jack 'changed overnight' in January 2018\n\nJack's PANDAS has affected the whole family. His sister, Cara (pictured), has become wary of the big brother she once so adored, Mrs MacLaine said\n\nJack's mother said: 'He was a really sociable eight-year-old. He loved playing football, doing gymnastics, martial arts and being with his friends.\n\n'But in January 2018 that changed overnight.'\n\nChildren with PANDAS can suffer with a range of what appear to be mental health symptoms, all of which flare up in the wake of an infection by the streptococcus group of bacteria — a common cause of sore or ‘strep’ throat.\n\nThe first signs something was wrong with Jack was a on a normal Saturday when he was playing football.\n\nMrs MacLaine said: 'When we got back in the car to go home, he just kept apologising over and over. He was saying, \"I do not deserve to have friends,\" and, \"I do not deserve to play football\".\n\n'Then that became, \"I do not deserve to live\". He said, \"When we get home I'm going to take my clothes off and sit outside until I freeze to death\".\n\n'We were really shocked as he'd never said anything like it before. We were asking him if something had happened.\n\n'We thought maybe when he'd been out playing that a bigger person had done something awful to him.\n\n'He kept saying that nothing had happened and he couldn't explain why he felt like that.\n\n'There was one moment when he was jumping up and down on my neck laughing this evil laugh and when he spoke it was like it wasn't his voice. It was as if he was possessed.'\n\nThat night he kept asking his horrified parents why they would not help him to die.\n\nJack's behaviour became increasingly erratic over four months, during which time he held a knife to his throat and told his parents he wanted to 'go to heaven'\n\nMrs MacLaine said doctors at the child and adolescent mental health services (CAMHS) thought her son might have autism but it was so sudden it didn't make sense\n\nThe following day, his parents discovered a note he had written saying: 'I'm really sorry I don't want to live anymore. I want to be in heaven.'\n\nWHAT IS PANDAS? Pediatric autoimmune neuropsychiatric disorders associated with streptococcal infections ( or 'PANDAS') an autoimmune response to a streptococcal infection It is a fairly recently described disorder, having only been recognised since the 1990s. It is diagnosed if there is a history of abrupt development of a number of neuropsychiatric symptoms - for instance, shouting and screaming. This must be associated with a group A streptococcal infection: the type of bacteria causing strep throat. Medication and cognitive behavioral therapy (CBT) are the primary treatments for PANDAS. Source: MedicineNet\n\nTerrified in case he attempted suicide, his mother made an appointment with their GP, who made an urgent referral to the child and adolescent mental health services (CAMHS).\n\nRecalling the appointment, Mrs MacLaine said: 'He was playing with the toys on the floor and was in his own little world. He did not look like Jack, he looked like a lost little boy.\n\n'They thought he might have been on the autistic spectrum, but before this there was nothing suggesting that. It was so sudden and made no sense.\n\n'At one point he looked terrified, his pupils were really dilated and we weren't sure if he recognised us or if he thought we were strangers.'\n\nOver the ensuing weeks, Jack developed vocal tics and a stutter. He regressed to playing with baby toys and watching Thomas the Tank Engine, which he had not seen since he was three.\n\nThe boy would repeat meaningless phrases, screech, or bark like a dog and became sensitive to noise and smells.\n\nHis mother added: 'He was very irritable. We felt like we were walking on eggshells around him. He had really severe mood swings and really isolated himself. He couldn't cope with people.\n\nJack developed a restricted diet and stopped sleeping in his bed, telling his parents he didn't deserve to sleep in a nice comfy bed. Pictured in his bed\n\nJack was sent for MRI scans of his brain, but nothing was found. It sent him and his family into more turmoil because they hoped it would reveal some answers\n\n'One of us talking was enough to set him off and he could be extremely aggressive towards me.\n\nTHE SYMPTOMS OF PANDAS Pans and Pandas can, in many cases, be cured with antibiotics. They share some of these symptoms: Sudden onset of obsessive compulsive disorder, tics or severely restricted food intake combined with two or more of the following: Anxiety, including separation anxiety, irrational fears and panic episodes. Sudden mood changes and/or depression. Irritability, aggression and/or severe defiant behaviour. Hyperactivity. Sudden deterioration in school performance. Involuntary movement and/or sensory abnormalities (eg, finding textures unbearable). Regression — a loss of behavioural and/or developmental skills. Insomnia and/or sleep problems. Involuntary urination/bed-wetting and/or a need to urinate frequently. Hallucinations or delusions.\n\n'There was one moment when he was jumping up and down on my neck laughing this evil laugh and when he spoke it was like it wasn't his voice. It was as if he was possessed.'\n\nJack developed a restricted diet and would live off pasta and cheese for months which he would eat in his room alone.\n\nHe also stopped sleeping in his bed, telling his parents he didn't deserve to sleep in a nice comfy bed.\n\nMrs MacLaine said: 'He would wander around looking for the most uncomfortable place to sleep. Eventually, we managed to persuade him to stay on the sofa bed downstairs.\n\n'It was such a severe change in him that there had to be an explanation.'\n\nThroughout the ordeal Jack was still going to school, but there were times when he would really struggle.\n\nMrs MacLaine said: 'He would have a full blown temper tantrum at the school gates, like a two-year old.'\n\nJack was seen by a paediatrician in March 2018 who referred him for an MRI scan and an electroencephalogram (EEG), which is used to find problems related to electrical activity in the brain.\n\nBut the results showed nothing unusual and it was suggested he could have an anxiety disorder, having ruled out autism.\n\nMrs MacLaine said: 'I know it sounds shocking, but I was hoping the MRI would show something that would explain it.\n\n'When it came back completely normal I felt strangely disappointed that my child had a normal brain.\n\n'I thought Jack would be happy that his brain was normal, but he was completely devastated.\n\n'He burst into tears and said, \"This has made me feel worse that there's no reason. This makes me want to die even more\".'\n\nUnexpected triggers would send Jack into a 'possessed' state, where he would laugh evily, bark and repeat meaningless phrases. Pictured with Cara\n\nAfter a Skype consultation, a doctor diagnosed Jack, pictured with Cara in happier times, with PANDAS. He was put on antibiotics straight away\n\nAfter conducting some online research, Mrs MacLaine came across PANDAS and contacted consultant paediatrician Dr Tim Ubhi at the Children's e-Hospital, an online service providing expert paediatric advice to parents and their children.\n\nAfter a skype consultation in May 2018, he diagnosed PANDAS and devised a treatment plan of antibiotics and ibuprofen - an anti-inflammatory painkiller - which Jack's doctor agreed to.\n\nPANDAS, paediatric autoimmune neuropsychiatric disorder, was identified relatively recently in 1998. It's prevalence is unknown, but the PANDAS Network believes it could affect one in 200 children.\n\nAlthough it is recognised by the World Health Organization, only a small number of doctors have heard of the condition, meaning many children are misdiagnosed with other conditions such as autism for years.\n\nIf PANDAS is caught early it can be effectively treated and can be reversible.\n\nMrs MacLaine said: 'I felt like he was the first person to listen to me.\n\n'Dr Ubhi suggested it could have been caused by a strep infection at the back of the throat, because his strep levels were raised.\n\n'Looking back, about a week before it happened, Jack was complaining of a sore throat, but that was it.'\n\nWithin a couple of days of taking antibiotics in May - after four months of torment - Jack was like his old self again.\n\nIt's been difficult to get Jack's antibiotics on repeat prescription, and so his PANDAS returns. He is pictured during an episode\n\nMrs MacLaine said Jack developed 'weird obsessions' such as avoiding stepping on seagull poo while on holiday. He is pictured with Cara\n\nBut, after two weeks, he went down to a maintenance dose of antibiotics and started to deteriorate again - talking about running away and becoming homeless.\n\nMrs MacLaine said: 'All the thoughts about dying had come back. And then it became harder to get the medication in him, because he didn't want to get better, he wanted to die.\n\n'There was one occasion when he'd just come off them and out of the blue he held a knife to his throat and said he was going to die.. We weren't prepared for it, so his sister saw all this happening, which was awful.\n\n'Now we are in this cycle of when he's on antibiotics he is okay, but when he comes off them he deteriorates again.'\n\nMrs MacLaine said it can be difficult for Jack to get his ongoing antibiotics prescribed, meaning that, at times, his treatment has been fragmented.\n\nShe said: 'I think partly because there's no published studies demonstrating that long-term antibiotics are beneficial and there's a reluctance to prescribe them because there's concerns about us becoming resistant to them.'\n\nDuring a family break to the Haven Holiday park in Aire, Scotland, in July, Jack - off antibiotics at the time - really struggled.\n\nMrs MacLaine said: 'He developed really weird obsessions, like he became scared of steps and stairs and of walking on seagull poo. We were by the seaside, so it would take us hours to get anywhere.'\n\nOne of the saddest consequences of Jack's illness has been the damage it has done to his relationship with Cara, who has become wary of the big brother she once so adored.\n\n'They were like two peas in a pod before all this, then he withdrew and was really irritable and she didn't understand what it was about,' Mrs MacLaine said.\n\n'But she is a constant source of love and optimism to us all.\n\n'For Neil and me it has felt, at times, like we have been judged by everyone. The fact Jack could hold it together sometimes, particularly at school, meant some medics thought it was a lack of boundaries at home causing the problem.\n\n'One even suggested we take up parenting classes.'\n\nThe family hope Jack will grow out of PANDAS because there are studies that suggest so.\n\n'But there is a lack of research, so we really don't know,' Mrs MacLaine said. 'There's still a long way to go in terms of getting this illness properly recognised.\n\n'Jack's missed out on two years of his childhood, but throughout it he has been really strong and brave. Whatever life throws at him now he will be able to handle it.'\n\nMrs MacLaine has joined forces with the charity PANS PANDAS UK to raise awareness of the illness.", "description": "Jack MacLaine, now 10, 'changed overnight' in January 2018, his mother, Alison, 44 said. The youngster, from Dumfries, said suicidal thoughts. He was finally diagnosed with PANDAS.", "authors": ["Vanessa Chalmers Health Reporter For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/11/19877248-0-image-a-35_1571392942165.jpg", "published_at": "2019-10-18"}