{"pub": "investing.com", "url": "https://ng.investing.com/news/forex-news/pound-having-best-two-days-in-a-decade-on-pivotal-brexit-moment-64736", "downloaded_at": "2019-10-11 13:16:42.869933+00:00", "title": "Pound Having Best Two Days in a Decade on Pivotal Brexit Moment", "language": "en", "text": "(Bloomberg) -- After spending almost the whole year betting Brexit woes would weaken the pound, traders are now on red alert as the potential for a divorce deal sends sterling flying higher.\n\nThe U.K. currency jumped the most over two days since 2009 after Thursday’s positive meeting between Prime Minister Boris Johnson and Ireland’s Premier Leo Varadkar. That was followed by further supportive comments, before a recommendation that Britain and the European Union enter into line-by-line negotiations on a Brexit accord.\n\nMarkets are taking these developments to be a game-changer. One-month options have never shown a stronger bias in favor of contracts to buy the pound, based on Bloomberg data going back to 2003. U.K. bank stocks surged along with domestically focused equities and government bonds sank for a third day.\n\nThe “pivotal moment” of a meeting between the British and Irish leaders was enough to convince strategists at Deutsche Bank AG (DE: ) to terminate a recommendation to sell sterling. Further progress on talks before the end of the month would risk greater pain for traders betting against the currency, and also spell danger for holders of U.K. government bonds and stocks.\n\n“We cannot recall a time during the Brexit process of the last year at which the Irish government raised expectations to this extent,” wrote Oliver Harvey and George Saravelos, strategists at Deutsche Bank (DE: ), who forecast correctly in 2015 that the pound would drop to its weakest level since 1985 in the following years. “We are no longer negative on the pound.”\n\nThe pound stormed higher after Varadkar and Johnson said Thursday they could see a pathway to a deal before the Brexit deadline of Oct. 31. While much uncertainty still remains, if Ireland -- one of the most important protagonists in talks -- sees a way forward, that could at the least help avoid a crash exit, the worst-case outcome for the U.K. economy and the pound.\n\nEuropean Council President Donald Tusk said Friday he has received “promising signals” that a Brexit deal is possible. A meeting between the European Commission’s chief negotiator Michel Barnier and his British counterpart Stephen Barclay was also described by both sides as being “constructive.” Barnier recommended Brexit negotiations enter a process in which the two sides discuss drafts of legal text in secret, according to people familiar with the matter.\n\nRisk reversals, a barometer of market sentiment and positioning, surged for options that benefit from a stronger sterling. And demand for pound calls, which give the right to buy the currency, outweighs that for puts at a 2:1 ratio since the Johnson-Varadkar meeting, according to data from the Depository Trust & Clearing Corporation.\n\nIt’s potentially bad news for hedge funds and asset managers, which were structurally short the U.K. currency, holding a net position close to record highs, according to U.S. Commodity Futures Trading Commission data.\n\nThe gained 1.7% to $1.2649 by 12:57 p.m. in London Friday, following a 1.9% jump on Thursday. U.K. government bonds fell, sending 10 basis points higher to 0.68% as a Brexit deal may bode well for the economy and inflation.\n\nThe currency may rally even more should a lack of bad news between the negotiating parties begin to turn into materially good news, according to Nomura International Plc strategist Jordan Rochester. The bank is recommending investors short the euro versus sterling. The pound jumped 1.3% to 87.34 pence per , reaching its strongest level since May.\n\nThe U.K.’s index rose 0.4%, but underperformed a rally of more than 1.5% for the STOXX Europe 600 Index as a stronger pound may dent earnings from abroad. Both Royal Bank of Scotland Group (LON: ) Plc and Lloyds Banking Group Plc (LON: ) climbed more than 10%, rallying with homebuilders, domestically focused stocks on the index, and Irish equities.\n\nInvestors remain more cautious on sterling’s longer-term prospects.\n\nWhile demand for options that look for a weaker pound has waned, the market is still biased in favor of downside protection. That may partly reflect the dollar’s allure amid global growth concerns and trade jitters. A further improvement in market sentiment could come from trade talks between the U.S. and China, and that in turn may see bets on a stronger pound gain additional traction.", "description": "Pound Having Best Two Days in a Decade on Pivotal Brexit Moment", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/content/pic2b8daa6e0f8baf720cc8a7c5dd4596f2.jpg", "published_at": "2019-10-11"}