{"pub": "cnn", "url": "https://cnn.com/2019/09/27/world/meanwhile-in-america-9-27-intl/index.html", "downloaded_at": "2019-09-27 09:29:42.519892+00:00", "title": "Meanwhile in America: \"A corrupt human tornado\"", "language": "en", "text": "In the blink of an eye, Donald Trump has landed on the fast track to impeachment, consumed by a scandal that's breathtaking even by his own epic standards . Here's a recap of the case so far, all the more damaging for its simplicity:\n\nWhat happens next? There's no turning back for Democrats, who may already have the House majority needed to make Trump the third impeached president in US history. But in a subsequent Senate trial, the betting is that Republicans -- cowed by their pro-Trump constituents -- would vote to keep the President in office. House Speaker Nancy Pelosi is promising an expedited process. But it could be months before Trump's fate is known.\n\nAs CNN's Jake Tapper noted, America's 38th President, Gerald Ford, called Watergate \"a long national nightmare.\" Today's Americans are just at the start of theirs.\n\nSubscribe to this email or share with a friend by clicking here.\n\n\"A corrupt human tornado\"\n\nThat's Hillary Clinton describing the experience of losing to Trump's relentless force of nature in the 2016 election. \"It was like applying for a job and getting 66 million letters of recommendation and losing to a corrupt human tornado,\" she told CBS Sunday Morning host Jane Pauley.\n\nWhile they might agree with the former secretary of state's sentiments, Democrats may frown at her intervention. Trump would relish changing the subject to his vanquished 2016 rival as he faces an impeachment battle.\n\nAdieu, Chirac\n\nHe was the man who was right about Iraq. Unlike George W. Bush, Hillary Clinton, Joe Biden and other US political giants, the former French President, who died Thursday, predicted America's invasion would end in a quagmire.\n\nChirac loved America. He toured the country as a student in the 1950s and was noticed in New Orleans as a \"dashing young Frenchman.\"\n\nHalf a century later, he drew on past connections when he tried to stop America going to war. \"I am telling my American friends. Beware. Be Careful,\" Chirac said in an interview with CNN's Christiane Amanpour on the eve of the US assault that toppled Saddam Hussein.\n\n\"Think it over seriously before you take action that is not necessary and that can be very dangerous, especially in the fight against international terrorism.\"\n\nFor his pains, Chirac was castigated in the most fervent anti-French hysteria in the modern history of America's oldest alliance. He was accused of personal and political betrayal and of dishonoring US sacrifices to liberate France in World War II. Republican lawmakers even stripped the \"French\" off their menus, replacing it with \"Freedom\" fries.\n\nOne of their ringleaders Walter Jones, a Republican from North Carolina, also died this year. Chirac might not have known it, but Jones — like many US politicians -- came to deeply regret supporting a \"shock and awe\" war that turned into a disaster.\n\nChirac, who was President between 1995 and 2007, was 86.\n\nOne more thing about Chirac\n\nThe prescient president also warned of environmental collapse -- a major issue for current French president Emmanuel Macron, and a point of disagreement between Macron and Trump.\n\n\"A very serious issue that we have to consider, although it is not often mentioned,\" Chirac said, \"is the serious and soon-to-be irreversible depletion of our planet's resources if we go on exploiting it as we are.\"\n\n\"That indeed is a very real problem that we should discuss together on the basis of scientific evidence and scientific forecasts, to try and amend the situation and put things right,\" he said. \"To make amends for our past madness.\"\n\n\"Conflicts start, but they never end\"\n\nRobert Mardini, head of the International Committee of the Red Cross's delegation to the UN, spoke to Meanwhile in America this week about the endlessness of war. \"We know how difficult it is to stop conflict,\" he said. \"Look at our top 10 or 15 operations -- we've been present there on average for 35 years. New conflicts start, but they never end.\"\n\n19%, 22%, 27%, 27%, 31%\n\nNever trust a poll -- but what about five? Those are Elizabeth Warren's recent polling figures among black voters, in Iowa, in New Hampshire, nationally, and among New Hampshire voters over age 65. CNN's Harry Enten argues that the slate of polls showing Warren gaining \"everywhere\" can't be ignored.\n\nToday, a criminal cartel case involving JP Morgan, Citigroup and Deutsche Bank resumes in Australia, more climate strikes kick off around the world, and Prince Harry follows his mother Diana's footsteps through the minefields of Angola. In a heady last day of the UN's high-level week, Chinese FM Wang Yi, Indian PM Narendra Modi and Pakistani PM Imran Khan will address the General Assembly.\n\nAfter such a tempestuous week, everyone needs a break. Settle on the couch this weekend for the Aussie Rules Grand Final between Richmond and GWS Giants at the MCG. Hosts Japan play Ireland in the Rugby World Cup. It's Real Madrid v Atlético Madrid in the El Derbi Madrileño on Saturday. Russia hosts the F1 Grand Prix and Super Bowl champs New England Patriots meet the surprising 3-0 Buffalo Bills on Sunday.\n\nAnd on the big screen, as Washington sorts through Trump's dirty laundry, get a refresher on the Panama Papers with Meryl Streep's new movie \"The Laundromat,\" about an American from the Midwest trying to navigate the scheming world of offshore financial services.", "description": "What happens next? There's no turning back for Democrats, who may already have the House majority needed to make Trump the third impeached president in US history. But in a subsequent Senate trial, the betting is that Republicans -- cowed by their pro-Trump constituents -- would vote to keep the President in office. House Speaker Nancy Pelosi is promising an expedited process. But it could be months before Trump's fate is known.", "authors": ["Analysis Stephen Collinson", "Caitlin Hu"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190917133751-rectangle-meanwhile-in-america-super-tease.png", "published_at": "2019-09-27"}