{"pub": "yahoo", "url": "https://news.yahoo.com/indiana-attorney-general-faces-hearing-155355895.html", "downloaded_at": "2019-10-20 12:39:02.110731+00:00", "title": "Indiana attorney general faces hearing on future as lawyer", "language": "en", "text": "FILE - In this Oct. 3, 2019, file photo, Indiana Attorney General Curtis Hill holds a press conference in South Bend, Ind. Lawyers for Hill are trying to block two women from testifying about previous sexual misconduct allegations as he faces claims that he drunkenly groped four women at a bar last year. The state's attorney disciplinary commission wants the women to testify about Hill's actions when he was the Elkhart County prosecutor before becoming attorney general in 2017. (Robert Franklin/South Bend Tribune via AP, File)\n\nINDIANAPOLIS (AP) — The professional future of Indiana's attorney general is at stake with a disciplinary hearing that threatens his law license after allegations that he drunkenly groped four women at a bar last year.\n\nA former state Supreme Court justice will open a perhaps weeklong hearing Monday on the professional misconduct complaint against Republican Curtis Hill. Hill disputes the claims from a state lawmaker and three legislative staffers that he inappropriately touched their backs or buttocks during a party at an Indianapolis bar celebrating the end of the 2018 legislative session.\n\nHill has rebuffed calls from Republican Gov. Eric Holcomb and other state leaders to resign. The Indiana Supreme Court will ultimately decide whether to impose any sanctions on Hill's law license, which he needs to serve as the state's top lawyer.\n\nA look at the case:\n\nTHE ALLEGATIONS\n\nThe allegations were made by Munster Democratic Rep. Mara Candelaria Reardon and one Republican and two Democratic legislative staffers.\n\nReardon alleges Hill slid his hand down her back, underneath her dress and grabbed her buttocks. One staffer says Hill used his hand to rub up and down her back. Another says he grabbed her wrist and moved both of their hands over her buttocks. The third staffer says Hill put his arm around her waist and pulled her close.\n\nA special prosecutor declined to file charges against Hill and a state inspector general's report determined he didn't break any ethics rules, although it cited eyewitnesses who called Hill's behavior inappropriate and \"creepy.\"\n\nThe disciplinary commission alleges Hill committed professional misconduct by carrying out misdemeanor battery against all four women and felony sexual battery against the woman whose wrist he grabbed.\n\nHILL'S DEFENSE\n\nHill, who had been viewed as a rising African American star in the Republican Party, maintains he didn't intentionally do anything wrong.\n\nHe acknowledged in legal filings that he drank three glasses of wine, a vodka martini and a shot of whiskey over several hours that night. His attorneys also wrote that Hill \"has an engaging personality and often physically interacts with others by placing a hand on the other person's arm, shoulder or back. He also has some difficulty hearing in one ear, so he is prone to leaning close to people with whom he is conversing, especially in loud environments.\"\n\nHill also argues that the case is improper because he was cleared by the special prosecutor and any conduct at the party shouldn't be subject to law license sanctions.\n\nHe plans to testify at his disciplinary hearing.\n\nIndiana University law school professor Jennifer Drobac, an expert on sexual harassment law, said she agreed with the disciplinary commission's arguments that Hill should be held to a higher standard because of his position as state government's top lawyer.\n\n\"It makes a difference when he engages in what, to the lay person, looks like an unlawful manner,\" Drobac said. \"It also sets a horrible example for other people in the state.\"\n\nEXTRAORDINARY HEARING\n\nThe appointment of former Justice Myra Selby to oversee the case certainly reflects its importance. Selby, 64, was a top adviser to Democratic Gov. Evan Bayh when he picked her as the state's first woman and African American justice in 1995. She stepped down from the court in 1999 and is currently a partner with the Indianapolis-based law firm Ice Miller.\n\nSelby has set aside a week for the hearing. She will serve essentially as the judge as the lawyers present witnesses, evidence and arguments.\n\nHill has a high-powered defense team that includes Donald Lundberg, who led the state attorney disciplinary commission for nearly two decades until 2010, and James Voyles, one of the state's top defense lawyers whose past clients include boxer Mike Tyson during his 1992 rape trial and Indianapolis Colts owner Jim Irsay after a 2014 arrest for driving under the influence of powerful painkillers.\n\nLongtime disciplinary commission attorneys Seth Pruden and Angie Ordway will represent the agency.\n\nWHAT HAPPENS NEXT\n\nSelby has at least several weeks to complete a report to the Supreme Court on her findings and any recommended disciplinary action. The five-member court — all appointed by Republican governors — has no deadline for a decision. Options include dismissing the complaint, a reprimand and temporary suspension or permanently removal of Hill's law license.\n\nState law requires the attorney general to be \"duly licensed to practice law in Indiana,\" but doesn't go into further detail.\n\nHill's term runs through 2020.", "description": "The professional future of Indiana's attorney general is at stake with a disciplinary hearing that threatens his law license after allegations that he drunkenly groped four women at a bar last year.  A former state Supreme Court justice will open a perhaps weeklong hearing Monday on the professional", "authors": ["Tom Davies"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ZTm9mt7wJh20HUHr22Qqcw--~B/aD0yMjYwO3c9MzM5MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/610a50b898bfd87b1e52cb1d04f39f02", "published_at": "2019-10-19"}