{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/rep-trey-gowdy-announces-election-2018/story?id=52745867", "downloaded_at": "2019-10-10 00:45:20.103170+00:00", "title": "Former GOP Rep. Trey Gowdy joins Trump's impeachment defense team", "language": "en", "text": "Former South Carolina Rep. Trey Gowdy, a colorful congressman who led the Republican investigation into Hilary Clinton and the terrorist attacks in Benghazi, Libya, will help defend President Donald Trump as faces the Democratic-led impeachment investigation.\n\nInterested in Republican Party? Add Republican Party as an interest to stay up to date on the latest Republican Party news, video, and analysis from ABC News. Add Interest\n\n“I am pleased to announce that former Congressman Trey Gowdy is joining our team as Counsel to the President. I have known Trey for years and worked with him when he served in Congress. His legal skills and his advocacy will serve the President well,\" Jay Sekulow, one of the president's top lawyers, said in a statement Wednesday night.\n\n\"Trey’s command of the law is well known and his service on Capitol Hill will be a great asset as a member of our team,\" Sekulow said.\n\nIt was unclear what specific role Gowdy would play in the current White House strategy of not cooperating with the investigation, but when word got out that he was being considered, a television clip from 2012 surfaced showing him saying it is \"wrong\" to withhold documents from Congress regardless of politics.\n\n“The notion that you can withhold information and documents from Congress, no matter whether you're the party in power or not in power is wrong! Respect for the rule of law must mean something irrespective of the vicissitudes of political cycles!” Gowdy said during a hearing in the House Committee on Oversight and Government Reform.\n\nA former federal prosecutor, Gowdy, known for his dramatic speaking style and appearance, was first elected to the House in 2010, riding the tea party wave.\n\nAs chair of the House committee tasked with investigating the 2012 terrorist attack on an American diplomatic compound in Benghazi, Libya, Gowdy vaulted into the national spotlight for his intense and critical questions about whether then- Secretary of State Hillary Clinton could have prevented the attack or dealt with it more effectively.\n\nGowdy joined a string of GOP committee chairmen who decided to leave Congress as the GOP faced a challenging 2018 midterm election which resulted in the Democrats taking back the House of Representatives.\n\nIn a statement, Gowdy said that he would return to practicing law instead of seeking a fifth term.\n\nThere is a time to come and a time to go. This is the right time, for me, to leave politics and return to the justice system. Full statement here ? pic.twitter.com/7I8AApqvs1 — Trey Gowdy (@TGowdySC) January 31, 2018\n\nPablo Martinez Monsivais/AP\n\nGowdy was often criticized by Democrats for how he conducted the investigation into the 2012 Benghazi attacks, and the Democratic Congressional Campaign Committee (DCCC) released a statement slamming Gowdy for just that.\n\n“Rep. Gowdy’s tenure in Congress made a mockery of Congressional oversight and his eagerness to use the deaths of brave Americans overseas in service of his partisan, political goals is a dark and shameful chapter in the history of the House of Representatives,\" DCCC Deputy Communications Director Patrick Burgwinkle wrote.\n\nJ. Scott Applewhite/AP\n\nOther Republican members of Congress and U.S. Ambassador to the United Nations Nikki Haley, formerly the Governor of South Carolina, all praised Gowdy.\n\nSome friends of Trey Gowdy need talk him out of retiring. America needs a smart forceful congressman like him — ChuckGrassley (@ChuckGrassley) January 31, 2018\n\nNext year won’t be the same without @TGowdySC to work & hang out with.Both professionally & personally he is truly one of a kind. — Marco Rubio (@marcorubio) January 31, 2018\n\nI always said the reason @TGowdySC was amazing at his job was bc he disliked politics so much. Trey, thank you for your impatience, sacrifice, and fight to make our country a more just place. SC and our country thank you for your service. I thank you for your friendship. ???? — Nikki Haley (@nikkihaley) January 31, 2018", "description": "Former Rep. Trey Gowdy potentially coming to Trump's defense in impeachment inquiry. Gowdy stepped down from Congress in 2018 after serving for eight years.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/trey-gowdy1-ap-mem-180131_16x9_992.jpg", "published_at": "2019-10-09"}