{"pub": "fox", "url": "https://foxnews.com/opinion/rebecca-grant-cease-fire-halting-fighting-between-turks-and-kurds-in-syria-faces-uncertain-future", "downloaded_at": "2019-10-18 06:08:31.769509+00:00", "title": "Rebecca Grant: Cease-fire halting Syria fighting between Turks and Kurds faces uncertain future", "language": "en", "text": "The cease-fire agreement reached Thursday by the U.S. and Turkey to halt Turkish military operations against Kurdish forces in Syria for five days is just the first step in long and hard bargaining that lies ahead if further fighting is to be averted.\n\nNo one knows if the cease-fire will hold, much less what will happen after it expires.\n\nVice President Mike Pence and Secretary of State Mike Pompeo led a delegation that reached the agreement with Turkish President Recep Tayyip Erdogan in nearly five hours of talks in Ankara.\n\nTURKEY-SYRIA CEASE-FIRE: SENIOR US MILITARY SOURCE 'HIGHLY SKEPTICAL' OF DEAL\n\nUnder the agreement, Kurdish-led forces are supposed to withdraw from a 20-mile wide safe zone on the Syria-Turkey border while the cease-fire is in effect. Turkish military operations are supposed to end once the Kurdish withdrawal is completed.\n\nHowever, Fox News reported that “a very senior U.S. military source who spent years designing the U.S. anti-ISIS strategy with both the Kurds and Turks … expressed skepticism” about the cease-fire because thousands of Kurds live within the buffer zone.\n\nTurkey will very likely conduct more cross-border attacks against the Kurds in Syria if the buffer zone plan collapses.\n\nUnder the best-case scenario, the next few days could give the Turks and Kurds the chance to put a security mechanism in place, and U.S.-Turkey relations could improve from the low-point caused by the Turkish invasion of northeast Syria, where Syrian Kurds had established an autonomous region.\n\nKARL ROVE CALLS SYRIA-TURKEY CEASE-FIRE AN 'AMAZING ACCOMPLISHMENT,' CREDITS POMPEO, PENCE\n\nBut whatever happens, the Trump administration’s work to broker a cease-fire was an honorable act and a reminder that America is willing to put in the effort in hopes of achieving peace and saving lives.\n\nIt’s remarkable that Turkey agreed to any cease-fire at all.\n\nU.S. Defense Secretary Mark Esper and Army Gen. Mark Milley, who is chairman of the Joint Chiefs of Staff, urged Turkey in numerous phone calls not to carry out its invasion. Turkey did it anyway. Few people familiar with the long-running animosity between the Turks and Kurds were surprised.\n\nIt’s important not to lose sight of the fact that a big reason why the U.S. faces very bad choices today between supporting NATO ally Turkey versus Kurdish forces who joined America in defeating the ISIS terrorist group is because of actions by President Barack Obama’s administration.\n\nObama’s inattention to the rise of ISIS forced the creation of the predominantly Kurdish force called the Syrian Defense Forces – a name picked with U.S. help to replace the name of the Kurdish fighters known as the YPG.\n\nObama and Secretary of State John Kerry had to know they were starting down a dark path. They knew Turkey opposed the YPG because of its close connection to designated Kurdish terrorist groups in Turkey, so hoped that rebranding the group with a new name would be a good public relations move.\n\nMany challenges must be overcome if the cease-fire reached Thursday is to continue beyond five days. Since the U.S. withdrew its small number of troops allied with the Syrian Kurds along the border with Turkey, the Kurds have invited Syrian troops to return to the area to protect them from Turkish forces.\n\nWhile Turkey wants a 20-mile buffer zone inside Syria, nations and groups that fought and defeated ISIS want thousands of ISIS prisoners guarded. The Kurdish forces were doing much of the guarding; under a new arrangement, it could fall to President Bashar Assad’s Syrian forces, to the Kurds, to Turkey, or to a combination of all three.\n\nSyria, Russia, the U.S., European nations and others in the anti-ISIS coalition want to prevent the regeneration of ISIS. That can be done by the military forces of Iraq, Syria and Turkey. The goal is to prevent the Mafia-like takeover of oil fields and towns that supported the ISIS caliphate from 2014 to 2018.\n\nAnd if they need help, the U.S. and other nations in the Defeat-ISIS Coalition could bring airpower and other military pressure to bear, though U.S. forces won’t be going back into northeastern Syria under the Trump administration. President Trump has made that clear and so has Defense Secretary Esper.\n\n“I will not place American service members in the middle of a longstanding conflict between the Turks and the Kurds,” Esper said. “This is not why we are in Syria.”\n\nAs for the senior U.S. military officials who are complaining about withdrawal of U.S. forces that backed the Kurds, that’s to be expected. American military men and women always feel bad about loosening ties forged in battle.\n\nWhen the U.S. pulled all forces out of South Vietnam in 1975, American military members had the same sorts of feelings about leaving their South Vietnamese allies. There will be emotions as well about pulling out from Afghanistan – if we ever do it.\n\nAmericans would like clean victories. They rarely happen.\n\nBut a few points here. First, the Kurds are being portrayed as a longtime ally and strategic partner. It’s simply not true. Our alliance with the Kurds – created to defeat our common enemy ISIS – is about five years old.\n\nKurdish forces were eager to get arms from the U.S. and especially to get support from massive U.S. airpower that bombed ISIS fighters.\n\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\n\nSometimes the headlines make it sound like the Syrian Kurds defeated ISIS all by themselves. But the Kurds did not carry the anti-ISIS fight alone. The Iraqi military fought very hard to drive out ISIS. So did anti-ISIS air forces, led by the U.S., which dropped over 100,000 bombs on ISIS targets from 2015 to 2019, according to U.S. Central Command. That’s more than double the bombs dropped in the 1991 Persian Gulf War.\n\nThe Syrian Kurds are good fighters but are also master political players. They publish glossy pictures of well-dressed soldiers, often women. They leapt at the chance to blame Trump for the Turkish invasion of Syria, fitting in with roiling U.S. domestic politics.\n\nAnd the Kurds are agile. They lost no time allying with the Assad regime in Syria after U.S. troops withdrew.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nIt’s also been very clear that our European allies are not willing to go to bat for Kurds in Syria, although several European nations condemned the latest Turkish move into Syria – as they did with previous such attacks by Syria Turkey.\n\nFaced with uncertainty, President Trump often says that “we’ll see what happens.” That’s a good way to sum up the giant question marks hanging over what awaits Turkish and Kurdish forces in Syria, along with the Assad regime, Russia, the U.S., ISIS and others operating in the war-torn nation.\n\nCLICK HERE TO READ MORE BY REBECCA GRANT", "description": "The cease-fire agreement reached Thursday by the U.S. and Turkey to halt Turkish military operations against Kurdish forces in Syria for five days is just the first step in long and hard bargaining that lies ahead if further fighting is to be averted.", "authors": ["Rebecca Grant", "Rebecca Grant Is A National Security Analyst Based In Washington", "D.C.", "She Earned Her Ph.D. In International Relations The London School Of Economics At Age Then Worked For Rand", "On The Staff Of The Secretary Of The Air Force", "Chief Of Staff Of The Air Force. Since Founding Iris Independent Research", "She Has Specialized In Research For Government", "Aerospace Industry Clients Ranging Analysis Of Military Campaigns To Projects On Major Technology Acqusition Such As The Bomber."], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/17/694940094001_6095646431001_6095643792001-vs.jpg", "published_at": "2019-10-18"}