{"pub": "bbc", "url": "https://bbc.com/news/in-pictures-49607327", "downloaded_at": "2019-09-07 02:14:36.469026+00:00", "title": "Week in pictures: 31 August", "language": "en", "text": "Our selection of some of the most striking news photographs taken around the world this week.\n\nImage copyright Andrew Milligan / Reuters Image caption Boris Johnson wrestles with a bull at Darnford Farm, Banchory near Aberdeen, Scotland. The prime minister has faced a week in which his brother Jo resigned as MP and a minister, and opposition parties refused to back his demand for a general election before the EU summit in mid-October.\n\nImage copyright Ahmad Al-Basha / Getty Images Image caption Yemeni children attend class on the first day of the new academic year in the city of Taez. Their school was damaged last year in an air strike during fighting between the Saudi-backed government forces and the Huthi rebels.\n\nImage copyright Munir Uz Zaman / Getty Images Image caption Bangladeshi patients suffering from dengue fever receive treatment at the Shaheed Suhrawardy Medical College and Hospital in Dhaka.\n\nImage copyright Anna Turley / AFP Image caption Leader of the House of Commons, Jacob Rees-Mogg, reclines across seats during a Brexit debate. Mr Rees-Mogg was criticised for his body language and told to \"sit up man!\".\n\nImage copyright Andrew Milligan / PA Media Image caption First Minister Nicola Sturgeon cuts the hair of David Torrance SNP MSP at the Scottish Parliament in Edinburgh, raising nearly £1,500 for the cancer support charity Maggie's Centre in Kirkcaldy. Mr Torrance had been growing his hair for a year.\n\nImage copyright Laurent Emmanuel / Getty Images Image caption A lightning strike above the Vittorio Emanuele II Monument and its equestrian statue in Rome during a thunderstorm.\n\nImage copyright Guillem Sartorio / Getty Images Image caption Looters in South Africa take items from an alleged foreign-owned shop during a riot in the Johannesburg suburb of Turffontein. Police fired tear gas, rubber bullets and stun grenades in an attempt to quell the unrest. The country's police minister, Bheki Cele, said \"criminality rather than xenophobia\" was to blame for the \"senseless violence\".\n\nImage copyright Brendan Smialowski / Getty Images Image caption A view of the damage caused by Hurricane Dorian in Marsh Harbour, Great Abaco Island, in the northern Bahamas. The country's government has warned that the death toll will be \"staggering\".\n\nImage copyright PAul Faith / Getty Images Image caption Irish Prime Minister Leo Varadkar (second right) and his partner Matthew Barrett (right) welcome US Vice President Mike Pence (centre left) and Second Lady Karen Pence (left) to Farmleigh House in Phoenix Park, Dublin. The US vice-president and his wife were on a two-day visit to the Republic of Ireland, arriving on Monday. He said the US recognised the \"unique challenges\" regarding the Irish border and Brexit.\n\nImage copyright Guy Bell / Shutterstock Image caption Art installation The Ship of Tolerance by Ilya and Emilia Kabakov makes a colourful scene on the River Thames in central London. The art piece, part of the Totally Thames celebration, is dedicated to educating and connecting children from different continents, cultures, and identities through the language of art.\n\nAll photographs belong to the copyright holders as marked.", "description": "A selection of the best news photographs from around the world, taken over the past week.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/F927/production/_108638736_2f769b69-f6a1-4a2b-a0f2-a2cb7396bc3d.jpg", "published_at": "2019-09-06"}