{"pub": "reuters", "url": "https://reuters.com/article/us-micron-tech/micron-launches-new-hard-drives-to-challenge-intel-in-data-centers-idUSKBN1X32FE", "downloaded_at": "2019-10-25 00:13:24.179740+00:00", "title": "Micron launches new hard drives to challenge Intel in data centers", "language": "en", "text": "SAN FRANCISCO (Reuters) - Idaho-based memory chipmaker Micron Technology on Thursday challenged rival Intel Corp with a new line of hard drives aimed at data centers, just as the two companies are on the cusp of formally ending a joint venture of more than a decade that developed the technology.\n\nMicron Technology's hard drive for data center customers is presented at a product launch event in San Francisco, U.S., October 24, 2019. REUTERS/Stephen Nellis\n\nMicron and Intel worked together starting in 2006 to bring to market what is called 3D cross-point memory technology. The technology uses three-dimensional features on storage chips to make them faster.\n\nMicron said a year ago that it would buy out Intel’s share of the joint venture, called IM Flash Technologies, for $1.5 billion in cash and the assumption of $1 billion of Intel’s share of the venture’s debt. The deal will close this month, leaving Micron in full control of a factory built in Utah to make the chips.\n\nHard drives made with the new chips are faster than previous solid-state drives. That has captured the interest of data center owners carrying out computing jobs like deep learning, where artificial intelligence software ingests huge amounts of data to learn new tasks.\n\nIntel released a second generation of its version of the technology earlier this year. Micron is now jumping into the market, testing it with what a handful of customers.\n\n“This is just the very, very beginning,” Micron Chief Executive Sanjay Mehrotra told Reuters at a launch event in San Francisco. “These kinds of technologies do take multiple years before are they broadly deployed.”\n\nMicron launched its Intel competitor Thursday, a device it calls X100. The device itself is a hard drive that can be plugged directly into a server, and Micron claims it is faster than its rival due in part to a piece of technology called a controller that take instructions from the server’s computing brain about which data to read or write on the hard drive.\n\nMicron developed the controllers internally and is hoping they will set its products apart in the memory market, where supply and demand dynamics can produce dramatic shifts in prices.\n\nMehrotra’s strategy since taking over as chief executive in 2017 has been to increase the number of storage products that include technologies beyond just commodity memory chips. About half of the company’s storage revenue now comes from such products, versus 20% when he arrived, he said.\n\n“This is hugely attractive,” Mehrotra said of differentiating features. “We are making strong progress there.”", "description": "Idaho-based memory chipmaker Micron Technology on Thursday challenged rival Intel Corp with a new line of hard drives aimed at data centers, just as the two companies are on the cusp of formally ending a joint venture of more than a decade that developed the technology.", "authors": ["Stephen Nellis", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191024&t=2&i=1444642796&w=1200&r=LYNXMPEF9N1RY", "published_at": "2019-10-24"}