{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/ellen-degeneres-drama-escalated-194500797.html", "downloaded_at": "2019-10-10 03:05:51.672530+00:00", "title": "The Ellen DeGeneres Drama Has Escalated", "language": "en", "text": "Ellen DeGeneres ruffled feathers (and then some) on Monday after she defended her friendship with former U.S. President George W. Bush on her daytime talk show. “Just because I don’t agree with someone on everything doesn’t mean that I’m not going to be friends with them,” she told the audience (and over 28 million viewers to date on Instagram and Twitter combined). “When I say ‘be kind to one another,’ I don’t mean only the people that think the same way that you do, I mean be kind to everyone,” she said.\n\nDeGeneres’s take earned the praise of many, including fellow celebrities like Reese Witherspoon, Kendall Jenner, Jamie Foxx, Jennifer Garner, Orlando Bloom, and Lenny Kravitz.\n\nI can’t get over this. Celebs are insane. pic.twitter.com/wKe2d00LzW — Bustopher Walken (@Douchetoevsky) October 8, 2019\n\nHowever, many also took issue with DeGeneres and co.'s willingness to overlook Bush’s history, including his decision to march the country into war in Iraq, Pakistan, and Afghanistan following the 9/11 terrorist attacks, which resulted in the deaths of 250,000 civilians, according to a study by Brown University. He has also been accused of war crimes.\n\nThis is a bad take and you should re-examine it. Sometimes you have to be kind by protecting other people and holding the powerful, especially powerful criminals, to account.\n\n\n\nGWB is a war criminal. Treating him normally normalizes war crimes.\n\n\n\n— 👻 Online Voting 👻 / Matt W (@MJWhitehead) October 9, 2019\n\nYou know what's \"interesting\" about this whole rehabilitation Bush/Ellen BS is that the same will be done with the racist in charge.\n\n\n\n\"You know he's not so bad. I mean yeah, sure kids in cages and supremacy and all that but he's pretty funny...\"\n\n\n\n— Lilliam Rivera (@lilliamr) October 9, 2019\n\nEllen killed people with kindness, Bush killed people with torture and bombs. Friends ‘til the end. pic.twitter.com/0ItaSGYYma — Tim Hendricks (@Saltwatertattoo) October 9, 2019\n\n(With love to Reese and Ellen—whom I don’t know) People who lost loved ones in New Orleans and elsewhere during Katrina because of a failed response by FEMA might find this kind of answer a little pat https://t.co/KFmajSvBmk — Soledad O'Brien (@soledadobrien) October 9, 2019\n\nSome went as far as to categorize the social media division as more of a class conflict than a partisan issue.\n\nPrivilege is Ellen DeGeneres explaining her friendship with George Bush by saying \"just because I don’t agree with someone on everything doesn’t mean I’m not gonna be friends with them,\" as if what they disagree about is who was best dressed at the Emmys or what the best mayo is — noah michelson (@noahmichelson) October 8, 2019\n\nIf George Bush killed a million white women, I don't think Ellen would be talking about her friend George Bush. But since it's a million dead Iraqis and Afghans, no big deal. — Remi Kanazi (@Remroum) October 8, 2019\n\nthis whole thing is really not more complicated than class solidarity https://t.co/Oc1KvZYsGr — Emma Roller (@emmaroller) October 9, 2019\n\nThe fact that Ellen made friends with George W. Bush is proof that class is one of the most important divides in American life.\n\n\n\nShe goes on TV and makes jokes about yukking it up with rich friends.\n\n\n\nShe'll never meet the millions of poor people whose lives he ruined. pic.twitter.com/aSNDQj6nLT\n\n\n\n\n\n\n\n— Arlen Parsa (@arlenparsa) October 8, 2019\n\nRELATED: People Are Mad at Ellen DeGeneres for Sitting Next to George W. Bush at a Football Game\n\nJameela Jamil was one of the few celebrities to publicly take the opposition, tweeting that she’s “learning today about the full extent of Bush’s heinous presidency” and can “now understand the rage.”\n\nOoooof learning today about the full extent of Bush’s heinous presidency... we weren’t taught much about him at school, we just heard he was stupid...(we were dealing with our own epic nightmare of a prime minister back then). What a monstrous leader. I now understand the rage.. — Jameela Jamil 🌈 (@jameelajamil) October 9, 2019\n\nThis response elicited a backlash of its own, with people tweeting that she should have known earlier, as she was in her twenties when he left office.\n\njameela jamil claiming to be an activist but having to google the Iraq war despite having been in her 20s when it was happening is why I know anything I put my mind to will happen. it's actually inspirational. from today im an engineer. — 🦎 (@zamarudd) October 9, 2019", "description": "The talk show host's viral meditation on kindness has sparked a major conflict on social media.", "authors": ["Isabel Jones"], "top_image": "https://s.yimg.com/uu/api/res/1.2/2MYWlJGgCs7.UefTxe_ncg--~B/aD0xODc0O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/instyle_846/cc768131c2f86ac973fd565d2d5d4c90", "published_at": "2019-10-09"}