{"pub": "washingtonpost", "url": "https://washingtonpost.com/technology/2019/09/20/amazon-google-other-tech-employees-protest-support-climate-action", "downloaded_at": "2019-09-20 22:51:38.172048+00:00", "title": "Amazon, Google, other tech employees protest in support of climate action", "language": "en", "text": "\n\nGoogle employee Zachary Siegel holds a sign outside his office Friday before marching with other workers to participate in a climate strike rally at City Hall in San Francisco. (Eric Risberg/AP)\n\nThousands of workers at the nation’s largest tech companies were expected to walk off their jobs Friday to urge industry and world leaders to address climate change more aggressively, part of a larger wave of demonstrations expected to draw millions of people across the globe.\n\nThe group Amazon Employees for Climate Justice said more than 1,800 Amazon employees in 25 cities pledged to walk out. Google Workers for Action on Climate tweeted that they expected about 700 workers to strike as of Thursday. Similar groups that said they were representing employees at Microsoft, Facebook, Twitter, Square and other major tech companies tweeted that they also expected significant numbers of employees to walk out.\n\nHundreds gathered Friday outside Amazon’s headquarters in downtown Seattle as part of the demonstrations. Participants chanted, “Hey hey, ho ho, fossil fuels have got to go” and held signs with messages such as “Amazon, Let’s lead. Zero Emissions By 2030.”\n\nRebecca Sheppard, 28, works in Amazon’s air, science and tech group to make the online retail giant’s planes more efficient.\n\nShe said she thought about quitting last year over her concerns about Amazon’s massive carbon footprint, but colleagues discouraged her, saying she could effect change by sticking around.\n\n“We’ve just got to double down,” she said about employee efforts to produce change.\n\n(Amazon founder and chief executive Jeff Bezos owns The Washington Post.)\n\n[‘I hope the politicians hear us’: Millions of youth around the world strike for action]\n\nThe strike is being held in advance of a Monday climate summit at the United Nations. U.N. Secretary-General António Guterres has insisted that instead of bringing “fancy speeches” with them to the meeting, the countries must offer concrete commitments such as reaching net zero emissions by 2050 or eliminating the construction of coal-fired power plants.\n\nStrike organizers expected more than 1,000 events to take place in the United States alone.\n\nThe tech workers joined millions of youths from more than 150 countries around the world who skipped school Friday in solidarity with the movement. Among them was 16-year-old Swedish climate activist Greta Thunberg, who has given a speech before the United Nations, met with political and business leaders, and has been nominated for a Nobel Peace Prize for her work.\n\nFacebook released a statement Friday expressing its support for employees who chose to walk out and said that the company is “building sustainability into our operations as well as engaging the global community on this important issue with our products.”\n\nMicrosoft declined to comment. Google, Twitter and Square were not immediately available to comment.\n\nAt Amazon, the walkout came a day after Bezos announced a “Climate Pledge” that would require signatories to meet the goals of the Paris climate agreement a decade early. The pledge also requires regular measuring and reporting of emissions, as well as obtaining net zero carbon across businesses by 2040, among other stipulations.\n\n[U.S. takes a low profile as nations gather in New York to debate steps to combat climate change]\n\nBezos said Amazon would be the first company to sign the pledge. Critics, who have long claimed Amazon does little to offset the emissions it produces, say the pact lacks transparency and standardized rules for what is measured and reported.\n\nAmazon declined to comment on the walkout.\n\nIn Seattle, workers who walked out held signs that opposed deals with gas and oil companies. The crowd booed when a speaker noted that Amazon funds climate-denying lobbyists. There was also a speaker from Google.\n\nSarah Read, a user experience researcher with Prime Video, said Thursday’s announcement shows employees are having an impact. She said she believes the Climate Pact is related to an employee-sponsored shareholder resolution that would have required the company create a plan to address climate change, a resolution that failed in spring.\n\n[Amazon CEO Jeff Bezos announces new ‘Climate Pledge’ ahead of employee protests]\n\n“It’s a direct response to Amazon employees standing up, speaking out and saying this is important to them,” Read said.", "description": "Tech workers walked out Friday to demand better environmentalism from their employers, joining millions of expected protesters around the world.", "authors": ["Marie C. Baca", "Breaking News Technology", "Business Reporter", "Jay Greene", "Reporter Focused On Technology Coverage In The Pacific Northwest", "September At Pm", "Marie C. Baca Is The Washington Post'S Breaking News Technology", "Business Reporter In San Francisco.", "Jay Greene Is A Reporter For The Washington Post Who Is Focused On Technology Coverage In The Pacific Northwest."], "top_image": "https://www.washingtonpost.com/resizer/EIOXUSvFPSQ69Js3mnQgYi0GQJ8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/SE7VOFW3ZUI6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-20"}