{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/13/chief-justice-drug-courts-failing-to-keep-up-with-", "downloaded_at": "2019-09-13 19:23:17.752689+00:00", "title": "Chief Justice: Drug courts failing to keep up with needs", "language": "en", "text": "FRANKFORT, Ky. (AP) - Kentucky’s drug court program has failed to keep up with surging demand for its treatment services in a state grappling with addiction woes, the state’s chief justice said Friday while signaling that he’ll seek funding to expand the services.\n\nTestifying before a state legislative committee, Chief Justice John D. Minton Jr. said drug courts and similar specialty courts are serving fewer than 2,500 people at a time when Kentucky faces the worst drug epidemic in its history.\n\nThat’s not even “scratching the surface of the need,” Minton told lawmakers.\n\n“The stark truth is that our current drug court model has become insufficient to address the burgeoning needs of Kentuckians with substance use disorders,” he said.\n\nDrug courts provide court-supervised treatment so people can stay out of jail. Participants take part in counseling and education programs and must undergo drug tests.\n\nThe inability to meet the demand means the state is “missing an opportunity at early intervention in a huge way,” the chief justice said.\n\nThe result is that many people who could be treated through drug courts end up in prison, he said.\n\nSince their inception in 1996, the Kentucky’s drug courts have proven effective in helping offenders rehabilitate their lives for much less than the cost of incarceration, Minton said.\n\nAdult drug courts are offered in all but three of Kentucky’s 120 counties, according to the state Administrative Office of the Courts. There are also five veterans treatment courts, one mental health court and one DUI court, it said. Lawmakers allocated $19.2 million from the state’s General Fund for the specialty courts program in the current fiscal year, the agency said.\n\nMinton told the lawmakers that his budget requests for the state’s judiciary next year will include looking for ways to expand drug courts. Republican Rep. Jason Nemes of Louisville said he was “heartened” to hear that Minton wants to expand the reach of those courts.\n\nDuring his more than hourlong presentation, the chief justice also updated lawmakers on initiatives to make the courts more efficient. He also said the court system needs to be a participant in discussions on relieving overcrowding in Kentucky jails.\n\nThe Lexington Herald-Leader recently reported that Kentucky overwhelms its local jails by using them to house thousands of state inmates for whom there’s no space in the state’s prisons, all of which are full. The crowding has led to deaths, serious injuries and a failure to rehabilitate inmates, the newspaper reported.\n\nMinton also repeated his support for “sensible pretrial justice reform,” but said that those changes alone won’t solve jail overcrowding. Kentucky activists, defense attorneys and lawmakers have called for changes in how the judicial system handles financial bail, and the issue will be looming when lawmakers meet in next year’s legislative session.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Kentucky's drug court program has failed to keep up with surging demand for its treatment services in a state grappling with addiction woes, the state's chief justice said Friday while signaling that he'll seek funding to expand the services.", "authors": ["The Washington Times Http", "Bruce Schreiner"], "top_image": "", "published_at": "2019-09-13"}