{"pub": "thehill", "url": "https://thehill.com/homenews/senate/464954-murkowski-warns-against-rushing-to-conclusions-on-trump-impeachment", "downloaded_at": "2019-10-09 02:07:16.191901+00:00", "title": "Murkowski warns against rushing to conclusions on Trump impeachment", "language": "en", "text": "Sen.(R-Alaska) said she is troubled that some have already made a decision on whethershould be impeached over his actions toward Ukraine.\n\n\"What I find equally troubling is that even before there has been any considered review, that people have decided.\" Murkowski said. \"There is either 'absolutely, you must get rid of him tomorrow' viewpoint or 'he must stay in and no questions asked.'\"\n\nADVERTISEMENT Murkowski added that she wants to follow a \"process\" and gather \"facts on the ground,\" including making sure she isn't making decisions based on her party controlling the White House.\n\nMurkowski's comments come as House Democrats are at the start of an impeachment inquiry centered on Trump's dealings with Ukraine.\n\nMurkowski, part of a dwindling number of moderate senators, has been reserved about weighing in on the impeachment inquiry led by House Democrats.\n\n\"In terms of the formal impeachment inquiry — that lies in the House of Representatives. Right now the Senate doesn’t have a part in this until the House reviews and they act. Until the point the Senate has a role in this, Senator Murkowski will wait to see the process play out in the House,\" a spokesperson for Murkowski told an Alaska TV station\n\nMurkowski, speaking at a recent health care event in Alaska, said she finds the impeachment fight that has engulfed the country to be \"troubling.\"Murkowski told reporters late last month that she found Trump's call with Ukrainian President Volodymyr Zelensky, during which Trump urged Zelensky to \"look into\" the Bidens, to be \"very concerning.\"", "description": "Sen.", "authors": [], "top_image": "https://thehill.com/sites/default/files/murkowskilisa_071019as_lead.jpg", "published_at": "2019-10-09"}