{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/sadistic-teen-sexual-activity-girl-20757256", "downloaded_at": "2019-10-30 23:24:35.700940+00:00", "title": "'Sadistic' teen had sexual activity with girl, 13, while on bail for torturing boy", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA teenager has been jailed after admitting he had sexual activity with a 13-year-old girl while he was on trial for sadistically torturing another teen.\n\nKyle Ashton, 19, has been branded a danger to the public.\n\nAt the time of the offending he was on bail and standing trial at Birmingham Crown Court, where he faced charges of wounding a 15-year-old boy with intent and false imprisonment.\n\nAshton had originally pleaded not guilty at Warwick Crown Court to nine charges of sexual activity with a child and one of attempting to engage in penetrative sexual activity with her, reports Leicestershire Live.\n\n(Image: Getty Images/iStockphoto)\n\nBut when the case was listed again at the request of his lawyers, Ashton changed his pleas to guilty.\n\nAnd after hearing that the offences began while he was standing trial, Judge Anthony Potter imposed an extended prison sentence on him.\n\nProsecutor John O’Higgins said in May the mother of a 13-year-old girl checked her phone and saw material which disturbed her because it showed contact with an unknown man.\n\n“She turned detective and traced him through Facebook, then got a friend to make contact with him posing as a teenager.\n\n“In that conversation the friend posed as a 15-year-old child who was a virgin, and the defendant indicated that he would have sex with her.”\n\n(Image: BPM MEDIA)\n\nSo the 13-year-old’s mother contacted the police, and when an officer spoke to the girl she revealed that they had first made contact through Facebook, and the chat quickly became sexual.\n\nThey began to meet after exchanging intimate pictures, and over about a month various sexual activities had taken place with him at his mother’s home in Nuneaton.\n\nThey included several incidents of digital penetration of her by Ashton, oral sex and sexual intercourse.\n\nWhen Ashton, of Hinckley, was arrested, he accepted the sexual activity had taken place, but claimed the girl, who accepted she had said she was 14, had misled him about her age and told him she was 16.\n\nMr O’Higgins pointed out that the offences had begun at a time while Ashton was on bail during the trial in Birmingham, which led to him being convicted of wounding with intent and false imprisonment.\n\nAshton was jailed for three years consecutive to an eight-year sentence he is already serving, with a three-year extended period on licence.\n\nAs a result, he will not begin serving it until he would have been due to be freed from the eight-year sentence – and will then have to spend at least two of the three years in jail before the Parole Board will even consider his release.\n\nIf he is freed before serving the full sentence, he will be on licence for the rest of the period and for a further three years, Judge Potter said.", "description": "The victim's mother had a friend pose as a young virgin on Facebook to track down Kyle Ashton, 19, Birmingham Crown Court heard", "authors": ["Paul Beard", "Image", "Swns.Com", "Getty Images Istockphoto", "Bpm Media"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20757414.ece/ALTERNATES/s1200/0_SWNS_TEEN_TORTURERS_001.jpg", "published_at": "2019-10-30"}