{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7600865/Megan-Barton-Hanson-looks-glum-discovering-ex-Chelcee-Grimes-DMing-woman.html", "downloaded_at": "2019-10-22 15:21:30.905155+00:00", "title": "Megan Barton Hanson looks glum after discovering she and ex Chelcee Grimes were DMing the same woman", "language": "en", "text": "She and Chelcee Grimes ended their relationship last week after discovering they were both messaging the same woman.\n\nAnd, Megan Barton Hanson, 25, looked glum as she stepped out in Paris on Tuesday clad in a camel coloured mac and a burgundy beret, after MailOnline revealed the scandalous reason for her recent split.\n\nThe Love Island star failed to raise a smile as she was seen constantly looking at her phone while going to Ladurée cafe on the Champs-Élysées, before taking a stroll near L'église de la Madeleine with her mother.\n\nGlum: Megan Barton Hanson, 25, looked glum as she stepped out in Paris on Tuesday, after MailOnline revealed the scandalous reason for her recent split from Chelcee Grimes\n\nOpting for a decidedly French look, Megan gave her beret and coat a tougher twist as she strolled along in chunky Dr Martin style ankle boots.\n\nThe newly-single reality star donned a simple black top and slipped into a white checked mini skirt, but kept the cold at bay somewhat with sheer black tights.\n\nShe carried her belongings in a small padded black top-handle tote, but kept her mobile phone in her hand at all times, regularly checking the screen.\n\nMegan's brunette hair extensions were styled into effortless waves and a dewy make-up look her allowed her full pout to draw the most attention.\n\nPouty: The newly-single Love Island star failed to raise a smile as she enjoyed a day in the French capital after finding out she and her ex girlfriend had been messaging the same woman\n\nOops! Megan and Chelcee Grimes (pictured together last month) split after discovering they were both messaging the same woman\n\nChic: Megan looked chic in a camel coloured mac and a burgundy beret and was seen constantly looking at her phone\n\nGlam: Megan's brunette hair extensions were styled into effortless waves and a dewy make-up look her allowed her full pout to draw the most attention\n\nStylish: Opting for a decidedly French look, Megan gave her beret and coat a tougher twist as she strolled along in chunky Dr Martin style ankle boots\n\nMegan's outing in Paris comes as she and ex girlfriend Chelsee Grimes, 27, were exposed by newly-single nightlife entrepreneur Teddy Edwardes.\n\nThe tattooed beauty tweeted: 'I've got a girl and her girlfriend in my DMs but neither of them know the other is doing it.'\n\nA source told MailOnline Teddy, 29, had been receiving texts from both Megan and Chelcee, despite them being together, and the Love Island star's ex-girlfriend Demi Sims, 23, was also messaging the businesswoman.\n\nLayered look: The newly-single reality star donned a simple black top and slipped into a white checked mini skirt, but kept the cold at bay somewhat with sheer black tights\n\nKeeping check: She carried her belongings in a small padded black top-handle tote, but kept her mobile phone in her hand at all times, regularly checking the screen\n\nStressed out? Megan paced through Paris while regularly checking her phone\n\nStanding out: Although she blended in well as she wandered through Paris, her deep red beret meant she still stood out\n\nAn insider revealed: 'Megan and Chelcee were just as bad as each other. They were both sending messages to Teddy without the other one knowing.\n\n'Demi was also thrown into the mix. She was sending texts to Teddy as well.\n\n'After Teddy tweeted about the love triangle, Demi sent her post to Megan to stir the pot between her and Chelcee. Megan and Chelcee had huge rows and ended it.'\n\nMailOnline has contacted representatives for Megan, Chelcee and Demi for comment.\n\nCaught out: The ex-couple were exposed by Teddy Edwardes (pictured in June) after she claimed she was receiving messages from a girl and her girlfriend\n\nExposing the truth: Businesswoman Teddy said neither Megan or Chelcee knew the other girl was sending her texts while they were still in a relationship\n\nIt was revealed last week that former stripper Megan and footballer Chelcee had parted ways after over a month of dating.\n\nDays before their break-up, Teddy tweeted: 'I've got a girl and her girlfriend in my DMs but neither of them know the other is doing it.\n\n'When do I break the news or do I carry on and mind my business?'\n\nTeddy, who's the founder of events company LICK, which puts on club nights for queer women, is newly-single after being in a relationship for three years.\n\nMegan and TOWIE star Demi had a brief fling after meeting on E4 reality show Celebs Go Dating earlier this year.\n\nBut Demi was left devastated after Megan claimed they had 'no sexual chemistry' and their relationship left her doubting if she was even gay.\n\nDemi said that in recent weeks Megan reached out to make peace and that she apologised for her unkind remark.\n\nThe TOWIE star explained: 'I had her blocked on everything so she reached out to my sister and was like, \"Can you tell Demi to unblock me?\"\n\n'She was in America at the time with her girlfriend Chelcee. I unblocked her because I wanted to know what she had to say and she kindly apologised for everything she had done.\n\nLove triangle: A source told MailOnline Megan and Chelcee had huge rows over the messages, which caused the end of their six week romance\n\nExes: An insider revealed to MailOnline that Megan's ex-Demi Sims (pictured together in July) was also messaging Teddy and she showed Megan her tweet to 'stir the pot'\n\n'She knew she was in the wrong with everything she had done to me. She apologised and we wished each other the best. I was really shocked because I didn’t expect her to ever apologise.\n\n'It felt really nice and it made my heart warm a bit more. I had a bitter frost towards her because of everything she did to me but when she apologised it made everything better.'\n\nPrior to her brief relationships with Demi and Chelcee, Megan dated her Love Island co-star Wes Nelson, 21.\n\nThe couple met on the ITV2 dating show in 2018 and moved in together after leaving the villa, but parted ways six months later.\n\nWes is now in a relationship with 2019 Love Island star, model Arabella Chi, 29.", "description": "The Love Island star, 25, failed to raise a smile as she was seen constantly looking at her phone while going to Ladurée cafe on the Champs-Élysées, on Tuesday", "authors": ["Ellie Phillips", "Sarah Packer For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/15/20038976-0-image-a-15_1571754990346.jpg", "published_at": "2019-10-22"}