{"pub": "yahoo", "url": "https://finance.yahoo.com/news/canopy-growth-cgc-bears-remain-173438110.html", "downloaded_at": "2019-10-03 08:37:06.700746+00:00", "published_at": "2019-10-01", "title": "Canopy Growth (CGC): The Bears Remain in Control", "language": "en", "text": "Canopy Growth (CGC) has been on a downward spiral lately, with part of it being the result of growing negative sentiment in the cannabis industry, and partly because of its own disappointing performance, where it has under performed on revenue and growth toward profitability on a sequential basis.\n\nIn a recent note from Bank of America analyst Christopher Carey, he pointed out the temporary weakness in the Canadian market that will have a detrimental impact on the performance of the company, resulting in it downgrading the stock and lowering its price target. Carey believes expectations for Canopy Growth remain too high; I agree with that assessment at this time. (To watch Carey's track record, click here)\n\nThe Canadian market\n\nWhether it's Canopy Growth or another Canadian-based cannabis company, a major issue in Canada is outside their control, which is the snails pace at which retail outlets are receiving their licenses, and the prior weak due diligence Health Canada performed on prospective licensees. To this day a number of those that have received licenses haven't even started building their stores.\n\nThat, along with relative few licenses, means demand from customers isn't being met, and that has pushed them toward the black market. That is expected to significantly change in the second half of 2019, but for now, it remains an issue.\n\nThe city of Toronto and province of Ontario have had the most negative impact on the Canadian cannabis sector, because until recently, Toronto itself only have 5 retail outlets for consumers to buy cannabis from. That's important because Ontario is by far the largest Canadian market.\n\nAt a time when there should be hundreds of retail outlets to buy from, it's still only in the low double-digits in that region.\n\nCarey said in a note to clients that there is currently approximately \"3 and a half months of flower inventory in the channel in Canada and eight and a half months of oil.\"\n\nWith the slow roll out of stores, and existing stores reporting slow sales, the analyst concludes it'll take time to work through the existing inventory. This isn't because of weak demand, but because of a lack of retail outlets to sell in.\n\nWhile derivatives should eventually boost sales after being approved of in Canada in October, the fact is sales won't start until the latter part of December 2019, which means the first real impact it'll have on Canopy Growth won't be until after the first calendar quarter of 2020.\n\nLack of positive catalysts\n\nIn the short term, I see more pain for Canopy Growth. It has committed to buying the rights of Acreage Holdings as its major entry point into the U.S. market. Unfortunately, there is little chance the U.S. will legalize pot at the federal level.\n\nThe major policy of the Trump administration concerning cannabis is to allow the states to make up their own minds on the legalization issue. It is more likely that all the individual states will legalize marijuana medically or recreationally, than it is to be legalized federally.\n\nIf I'm correct in my outlook, it means Canopy Growth is going to sit on Acreage Holdings for a long time without getting any benefit from the proposed deal.\n\nAt the same time, it lags behind major competitor Aurora Cannabis (ACB), which by far as the largest global footprint, with a presence in 25 countries.\n\nStory continues", "description": "Canopy Growth (CGC) has been on a downward spiral lately, with part of it being the result of growing negative sentiment in the cannabis industry, and partly because of its own disappointing performance, where it has under performed on revenue and growth toward profitability on a sequential basis. In", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/n0iU5kzrGdyi2plo.Tg0yQ--~B/dz0wO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/tipranks_452/a1a828f027575d48830c93eb8d32b6a8"}