{"pub": "realclearpolitics", "url": "https://washingtonexaminer.com/opinion/columnists/democrats-stuck-in-watergate-mode-bungle-lewandowski-testimony", "downloaded_at": "2019-09-18 23:22:52.071334+00:00", "title": "Democrats, stuck in Watergate mode, bungle Lewandowski testimony", "language": "en", "text": "Have Democrats on the House Judiciary Committee figured out what President Trump did to them? By the looks of their questioning of Corey Lewandowski on Tuesday, the answer is no.\n\nDemocrats chose the former Trump campaign manager for their first hearing after declaring the committee is considering impeaching the president. They apparently thought Lewandowski would elaborate on his extensive testimony to special counsel Robert Mueller and also on his testimony from earlier investigations by other House and Senate committees.\n\nInstead, Lewandowski jerked Democrats around — and around and around. He delayed. He asked for specific citations when anyone referred to the Mueller report. He repeated, over and over, his instructions from the Trump White House not to discuss his conversations with the president.\n\n“The White House has directed that I not disclose the substance of any discussion with the president or his advisers to protect executive branch confidentiality,” Lewandowski said, over and over and over.\n\nCommittee Chairman Jerrold Nadler was visibly frustrated from the start. \"'When you refuse to answer these questions, you are obstructing the work of our committee,\" Nadler said. \"You are also proving our point for the American people to see: The president is intent on obstructing our legitimate oversight. You are aiding him in that obstruction.\"\n\n\"And I will remind you,\" Nadler continued, \"that Article 3 of the impeachment against President Nixon was based on obstruction of Congress.\"\n\nPerhaps Nadler thought that was a killer argument. But rather than highlight similarities between the Trump-Russia affair and Watergate, Nadler's reference to Richard Nixon served to show the differences — and why Democrats are having so much trouble getting an impeachment effort off the ground.\n\nArticle 1 of the impeachment of Nixon began with an underlying crime: that agents of his reelection committee broke into Democratic National Committee headquarters. In Trump-Russia, the underlying crime — the DNC hack — was committed by Russians in Russia without any involvement of the Trump campaign. Article 1 then went on to accuse Nixon and his men of engaging \"in a course of conduct or plan designed to delay, impede, and obstruct the investigation of such illegal entry; to cover up, conceal and protect those responsible; and to conceal the existence and scope of other unlawful covert activities.\"\n\nThat was the heart of the Nixon impeachment, that the president obstructed the special counsel's investigation into Watergate.\n\nBut Trump and his team, faced with a special counsel investigation, made a radically different decision. Beyond refusing to testify to special counsel Mueller — which Mueller never demanded he do — Trump cooperated fully with the investigation. Trump, who could have followed a Nixonian course of claiming executive privilege over all sorts of material, instead opened up the White House to Mueller's investigators. Trump directed his people to testify and turn over thousands of documents to Mueller.\n\nDon McGahn, the White House counsel, famously testified for 30 hours before Mueller's prosecutors. All other key figures testified as well. That included Lewandowski, who said Tuesday that he spent hours with the Mueller team.\n\nThe fact is, House Democrats know what they know about the Trump-Russia matter, and in particular about alleged obstruction of justice in the White House, because Lewandowski and others in the Trump circle cooperated so fully with the Mueller investigation. They did so at the specific direction of the president.\n\nAnd now, Democrats want to press a case of obstruction of justice against Trump.\n\nWhat happened Tuesday was the second part of the Trump strategy. The first part was to cooperate with law enforcement. The second part was to not cooperate with congressional impeachment efforts.\n\nTrump has refused to allow White House aides and former aides to testify before the impeachment panel; at the direction of the White House, two former aides, Rick Dearborn and Rob Porter, refused to appear alongside Lewandowski Tuesday. McGahn, also at the direction of the White House, has refused to testify before the committee. The House has gone to court to compel McGahn's testimony, but a favorable decision is not guaranteed and in any event will take a long time.\n\nLewandowski, who never worked in the White House, did appear and made clear he would address the specific contents of the Mueller report. Indeed, when he was asked to confirm this or that passage in the report, he did. In that sense, his testimony was like that of Mueller himself, who sought to stay within the boundaries of the report when he testified before Congress.\n\nThe Trump-Russia affair is the anti-Watergate in the sense that the president and his team cooperated extensively with the special counsel, which will make the Judiciary Committee's task of pressing an obstruction of justice case against them all the more difficult.\n\nBut what about Nadler's specific point, about Article 3 of the Nixon impeachment? (For the curious, Article 2 accused Nixon of abusing federal powers to go after his enemies.) Article 3 charged that Nixon \"failed without lawful cause or excuse to produce papers and things as directed by duly authorized subpoenas issued by the Committee on the Judiciary of the House of Representatives.\"\n\nOf course, House leaders, if they can muster 218 votes, can impeach the president for virtually anything they choose. But practically, they need a court to rule that the needs of their impeachment inquiry outweigh any White House claims of privilege. Again, Democrats are looking back to the days of Watergate, when U.S. v. Nixon said the needs of a criminal trial outweighed the president's claim of privilege. But of course, with Mueller, Trump has already cooperated with the criminal investigation.\n\nThe bottom line is that Trump has flummoxed Watergate-fixated Democrats with a simple strategy: cooperate with the special counsel. In not cooperating with the Judiciary Committee leadership, he is in effect arguing that he has already cooperated with the important investigation and does not have to cooperate with a political investigation on Capitol Hill, especially when the House leadership cannot decide whether it is a formal impeachment proceeding or not.\n\n", "description": "Have Democrats on the House Judiciary Committee figured out what President Trump did to them? By the looks of their questioning of Corey Lewandowski on Tuesday, the answer is no.", "authors": [], "top_image": "https://mediadc.brightspotcdn.com/dims4/default/660ae5c/2147483647/strip/true/crop/2290x1202+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F40%2Fd9%2F279232864ca6ba1c8957a196b298%2Fap-19260849451611.jpg", "published_at": "2019-09-18"}