{"pub": "rt", "url": "https://rt.com/sport/471840-conor-mcgregor-frankie-edgar-nate-diaz-scrum", "downloaded_at": "2019-10-25 16:06:38.208700+00:00", "title": "‘I would love to compete with him’: Conor McGregor targets Frankie Edgar fight, but also has eyes on Nate Diaz (VIDEO)", "language": "en", "text": "Conor McGregor made all the right noises as he faced reporters in Moscow following his press conference in the city on Thursday as he explained why his ideal next opponent would be former UFC lightweight champion Frankie Edgar.\n\nSpeaking with renewed passion and enthusiasm, McGregor spoke with great respect as he paid tribute to former UFC 155-pound champion Edgar and explained why he would love to face “The Answer” on his UFC return on January 18 in Las Vegas.\n\nChatting to reporters in a media scrum following his press conference at Telegraph Hall McGregor said: “The original return bout that I wanted was Frankie Edgar. He's a legend of the sport, he's spoke very respectfully of my name.\n\n“He said he would one day like to tell his grandkids that he fought Conor McGregor, and I thought that was very admirable of him. And, like I said, a former lightweight world champion. He's fought in featherweight and he's making the move to bantamweight – he's not bantamweight yet – but I wish him well.”\n\nAlso on rt.com 'We will settle it, once and for all': Conor McGregor announces UFC return and vows to face Khabib Nurmagomedov again (VIDEO)\n\nMcGregor’s ultimate goal is to gain a rematch with UFC lightweight champion Khabib Nurmagomedov and win back the UFC title he never lost inside the octagon. And the Irishman explained that Edgar would offer the perfect test for his skills as he looks to build himself back up towards a rematch with “The Eagle” in 2020.\n\n“His similarities to Khabib are quite stark,” he said of Edgar.\n\n“He's a good solid boxer on the back foot, a lot of outer movement, and he shoots on the single-leg a lot. So it would be good preparation for me to climb my way back, so that's why I was eager for that.\n\n“And the fact that Frankie's such a legend of the game, I would love to give him the opportunity to face me, and give him that dream payday. For whatever reason, the UFC are not interested, but I believe we will do it at some stage.”\n\nBack in the days when McGregor was at the top of the UFC’s featherweight division the Dubliner was linked with a fight with Edgar, and even shared a respectful conversation through the cage with the American after he finished Jose Aldo at UFC 194.\n\nAlso on rt.com McGregor mobbed: Watch UFC star Conor McGregor get swamped by fans as he leaves Moscow press conference (VIDEO)\n\nAt the time, a match between the two made a lot of sense, but McGregor then moved up to lightweight to take on – and defeat – Eddie Alvarez and become a two-division champion, leaving Edgar in limbo.But now McGregor says the time is right for the pair to finally meet.\n\n“We have been rivals for so many years, myself and Frankie,” he explained.\n\n“They said I was running from Frankie back when I was on the featherweight climb. I was 'afraid' to fight Frankie, which is ludicrous. But this is the game we are in. I was 'afraid' to fight him then, and I'm 'cherry-picking' him now. So you can't win sometimes with this game, but I am eager to face Frankie at some stage in the future.\n\n“I have a lot of respect for him. His skills are admirable and I would love to compete with him. There are stylistic matchups, and that's a specific style I want to develop and get better at, so that was my thinking behind that.”\n\nAnd while he spoke in glowing terms about one day facing Edgar, McGregor also made clear the fact that he’d be more than happy to step back up to 170 pounds and face his old foe Nate Diaz once again at welterweight. He also didn’t rule out a possible title tilt at 170 pounds in the future.\n\n“Most certainly, yes,” he said.\n\n“Look, if I'm facing for this ‘Bad Mother F***er’ title, that's 170. I have fought Nathan Diaz at 170. Nathan has fought Rory MacDonald, Nathan has fought multiple people at 170. Now he's facing Jorge and he's only recently beat Pettis at 170. Most certainly I would go for the 170 world title, yes.”\n\nAlso on rt.com 'I wouldn't go to Dagestan to take a s**t': 6 sizzling responses from Conor McGregor's Moscow press conference Q&A\n\nMcGregor is clearly keen to return to the fray sooner rather than later, and he explained that he’s in the process of improving his day-to-day routine to ensure he’s always close to fighting weight, regardless of the division he ends up competing in.\n\n“Whatever the weight class, I'm going to keep my weight a specific weight,” he explained.\n\n“Realistically, 155 is my prime weight. You could probably stretch that out to maybe 160 to ease the cut a little bit, but I'm going to get myself into prime condition, get my body fat real low, and I'm going to maintain it. Then whichever weight class it is in, it does not matter.\n\n“I have fought in multiple different weight divisions. I have fought in welterweight, I have fought in lightweight, I have fought in featherweight. And the opponents I have faced people in middleweight, welterweight, lightweight, featherweight and even now bantamweight – Jose Aldo, I believe, is looking to drop down, as well as Frankie Edgar.\n\n“So my scope of connection to this game spans across all weight divisions and I'm very very happy about that, very excited about that, that I have that connection to so many people in the sport that I love.”", "description": "Conor McGregor made all the right noises as he faced reporters in Moscow following his press conference in the city on Thursday as he explained why his ideal next opponent would be former UFC lightweight champion Frankie Edgar.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5db2f5d920302758bb686873.jpg", "published_at": "2019-10-25"}