{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/pregnant-jenna-dewan-flaunts-baby-20556336", "downloaded_at": "2019-10-11 00:24:20.728687+00:00", "title": "Pregnant Jenna Dewan flaunts her baby bump in romantic shoot with new man Steve Kazee", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nJenna Dewan has given fans a glimpse of an upcoming pregnancy photo shoot by sharing behind-the-scene snaps on her Instagram account on Thursday.\n\nThe actress radiates beauty in the snaps that show her posing in a white lace semi-sheer gown with a baby pink bow around the middle.\n\nThe glowing star, 38, had her raven locks down in loose curls that framed her pretty face.\n\nSome of the images showed the gorgeous actress working the camera amongst leafy foliage as she appeared to be on location in a private garden.\n\nIn another she wrapped herself around her new man Steve Kazee, 43, as he gazed at her lovingly.\n\n(Image: Instagram)\n\nThe Step-Up star wrote next to the gallery of images: \"BTS of the @people shoot out on stands this week! What a special day..We talk love, new beginnings and my book #gracefullyyou. And as you can see, I lived my full fairy self in this shoot.\"\n\nJenna announced that she was expecting a baby with Steve in May.\n\n(Image: Instagram)\n\n(Image: Instagram)\n\nThe American also has a six-year-old daughter with ex husband Channing Tatum.\n\nJenna confirmed the news to PEOPLE, and said: \"We are beyond overjoyed and couldn't be happier to be expanding our family!\"\n\n(Image: Instagram)\n\n(Image: FilmMagic)\n\nThe couple have been dating since last year, following Jenna's divorce from Channing after nine years together.\n\nIn April 2018 Channing and Jenna announced the end of their marriage.\n\nThe former flames fell in love on the set of 2006 film Step Up and went on to wed in July 2009.\n\nChanning has now moved on with UK singer Jessie J.", "description": "Channing Tatum's ex has shared behind-the-scene images from a upcoming magazine shoot", "authors": ["Sara-Aisha Kent", "Image", "Instagram", "Filmmagic"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20556311.ece/ALTERNATES/s1200/0_Jenna-Dewan.jpg", "published_at": "2019-10-10"}