{"pub": "indiatimes", "url": "https://indiatimes.com/trending/human-interest/dr-annappa-n-bali-bailhongal-belagavi-district-rs-10-fee-karnataka-378262.html", "downloaded_at": "2019-10-21 11:30:36.932176+00:00", "title": "Selfless Dedication: This 79-YO Doctor Treats His Patients And Charges Only Rs 10 As Fee", "language": "en", "text": "Most of us want to be successful, earn for ourselves and our family, and settle in that lifestyle. However, there are those rare selfless beings, who dedicate their lives to others and make use of their career to serve society. Dr Annappa N Bali is one such man. He charges a fee of Rs 10 from patients coming to him from economically-weaker sections.\n\nThe 79-year-old works in the town of Bailhongal in Belagavi district, Karnataka, and most of his patients hail from financially-weaker sections. Daily, he treats somewhere between 75 to 150 patients everyday, and more than 50% of them are treated free of cost.\n\nThe rest of the patients are treated for a minimal fee of Rs 10 which includes all medicines, injections and other treatments. He is helped by three people at his clinic to manage the line of patients that starts forming early morning.\n\nThe New Indian Express\n\nAccording to The New Indian Express, Dr Bali himself faced financial problems in his childhood. He managed to complete his MBBS and then get a job, and now feels he has no need to chase after money. “I know what bitter poverty is like - I have tasted it too,” The New Indian Express quoted him as saying.\n\nDon't Miss 7.4 K SHARES 5.8 K SHARES 2.8 K SHARES 7.3 K SHARES 8.2 K SHARES\n\nDr Bali recalls his childhood when his family faced severe financial problems. He says he was able to get education by staying at a free boarding school. “Later, I was helped by some people and was able to complete my MBBS at KMC, Hubballi. Then, I got a diploma in ENT in Mysuru in 1978,” he says. “I have no reason to chase money now. I just want peace of mind, which I get by treating poor patients,” he further said.\n\nThe reason Dr Bali does not provide free treatment to all his patients is because he feels that not all will understand the importance of it. So, he only provides free treatment to those who are in desperate need, whom he can identify.\n\nHe is not only selflessly helping the poor, but is also inspiring people with his spirit and dedication to work, and let's face it, that's not something everyone can do.", "description": "Most of us want to become successful, earn for ourselves and our family and settle in that lifestyle. However there are those rare selfless being who dedicate their lives to others and make use of their career to serve the society. Dr Annappa N Bali is one such man. He charges a fee of Rs. 10 to patients coming to him from economically weaker sections.", "authors": ["Shreya Chauhan"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/doctor_1571650976_800x420.jpg", "published_at": "2019-10-21"}