{"pub": "businessinsider", "url": "https://businessinsider.com/e-commerce-startup-verishop-raises-an-additional-125-million-2019-10", "downloaded_at": "2019-10-10 00:05:18.480997+00:00", "title": "Ex-Snap exec Imran Khan has raised an additional $12.5 million for his e-commerce startup Verishop", "language": "en", "text": "The e-commerce startup Verishop has raised another $12.5 million, sources familiar with the deal confirmed to Business Insider.\n\nRakuten Ventures, Lightspeed Venture Partners, Madrona Venture Group, and the real-estate company Simon Property Group participated in the pre-Series B round.\n\nFormer Snap Chief Strategy Officer Imran Khan's 4-month-old e-commerce marketplace focuses on fashion, beauty, and wellness products.\n\nClick here for more Prime stories.\n\nFormer Snap Chief Strategy Officer Imran Khan has raised another $12.5 million for his e-commerce startup Verishop, for a total of $30 million raised, sources familiar with the deal confirmed to Business Insider.\n\nRakuten Ventures, Lightspeed Venture Partners, Madrona Venture Group, and the real-estate company Simon Property Group participated in the pre-Series B round. The company has raised $30 million to date, with Lightspeed Venture Partners leading its Series A round with an investment of $17.5 million in November, Axios reported. With the latest round, the company has a theoretical value of about $100 million, a source familiar with the company said.\n\nKhan's 4-month-old e-commerce marketplace focuses on fashion, beauty, and wellness. He's pitched it as a higher-end alternative to Amazon, buying, warehousing, and selling products from the likes of Diane von Furstenberg's DVF, Finders Keepers, and Ursa Major. He ultimately wants to build an affordable luxury version of the French company LVMH.\n\nRead More: Former Snap CSO Imran Khan has launched his new e-commerce startup Verishop, which industry experts say can solve for some of Amazon's key weaknesses\n\nKhan's plan also includes launching private-label brands to show that it can handle product fulfillment and make competitive products of its own. It has rolled out its first such brands — the skin-care line Ghost Democracy, the athleisure wear line Lett, and the women's clothing line Billie.\n\nThe idea is for these brands to be sold in physical stores too. Ghost Democracy is set to open a pop-up store at the Westfield Century City shopping center in Los Angeles later this month.", "description": "Rakuten Ventures, Lightspeed Venture Partners, Madrona Venture Group, and Simon Property Group participated in the pre-Series B round.", "authors": ["Tanya Dua"], "top_image": "https://image.businessinsider.com/5d9e07da3b33a7441e08f9e5?width=1200&format=jpeg", "published_at": "2019-10-09"}