{"pub": "usatoday", "url": "https://usatoday.com/story/news/politics/2019/10/30/barack-obama-tells-woke-youth-get-over-quickly/4095362002", "downloaded_at": "2019-10-30 23:26:00.139369+00:00", "title": "'That's not bringing about change': Obama advises 'woke' young people not to be so judgmental", "language": "en", "text": "USA TODAY\n\nFormer President Barack Obama has a message for the \"politically woke\" crowd that has become prolific on social media in recent years: Get over it.\n\nObama called out young progressives for being too ideologically rigid and judgmental during an interview Tuesday moderated by \"Grown-ish\" star Yara Shahidi at the Obama Foundation Summit in Chicago.\n\n\"This idea of purity and you're never compromised and you're always politically woke and all that stuff, you should get over that quickly,\" the two-term Democrat said. \"The world is messy. There are ambiguities. People who do really good stuff have flaws. People who you are fighting may love their kids and share certain things with you.\"\n\nObama said he has particularly noticed the trend on college campuses he has visited with his daughter Malia. He described it as a \"danger\" that is \"accelerated by social media.\"\n\nHe said some young people appear to think that the way to bring about change \"is to be as judgmental as possible about other people, and that's enough.\"\n\nCriticizing people on Twitter for doing something wrong or for a poor choice of words gives those critics a sense of self-satisfaction, he said.\n\n\"Then I can sit and feel pretty good about myself because, man, you see how woke I was, I called you out,\" Obama said. \"That's not activism. That's not bringing about change. If all you're doing is casting stones, you're probably not going to get that far. That's easy to do.\"\n\nThe comments were widely applauded on social media in a rare moment of bipartisan agreement.\n\nConservative Fox News host Tomi Lahren said it was good to hear Obama \"standing up for our rights and our values of the First Amendment.\"\n\nLahren said Obama's comments made some people \"remember that we used to think Barack Obama was bad,\" but in contrast to today's Democratic leaders, \"Obama is looking like the voice of reason.\"\n\n\"That's when you know the Democratic Party has gotten this bad,\" she said.\n\n\"Dear 2020 Dems: Listen to Obama. It's important,\" tweeted John Schindler, a national security columnist for the New York Observer.\n\nUniversity of New Mexico psychology professor Geoffrey Miller tweeted that Obama went after \"the cheap-talk virtue-signaling at the heart of woke online cancel culture.\" Miller was censured by UNM in 2013 for a tweet that was deemed insensitive to overweight people.\n\n\"Monty Python\" actor John Cleese said, \"I very much like what Obama says about 'woke.'\"\n\n\"Truer words have never been spoken,\" said drag queen Monét X Change, a former contestant on \"RuPaul's Drag Race.\"\n\n\"Obama is right, but he's not criticizing \"cancel culture\" alone (whatever you think that is),\" tweeted Tablet magazine writer Yair Rosenberg. \"He's criticizing attempts to force normal people into black-and-white good/evil boxes, because most humans are more complicated than that and shouldn't be reduced to their worst tweet.\"\n\nAlthough most responded positively to Obama's remarks on Twitter, Mother Jones' Ben Dreyfuss said the 44th president \"must be getting 'ok boomer'd' hard on ticktock.\"", "description": "\"That's not bringing about change. If all you're doing is casting stones, you're probably not going to get that far,\" the former president said.", "authors": [], "top_image": "https://www.gannett-cdn.com/presto/2019/10/30/USAT/3baae1c7-c99d-494d-8f39-14de14225003-AP_Obama_Foundation_Summit.JPG?crop=3348,2511,x0,y0&width=3200&height=2401&format=pjpg&auto=webp", "published_at": "2019-10-30"}