{"pub": "reuters", "url": "https://ca.reuters.com/article/topNews/idCAKBN1WX0LD-OCATP", "downloaded_at": "2019-10-18 08:04:48.896481+00:00", "title": "Trading tires: How the West fuels a waste crisis in Asia", "language": "en", "text": "NABIPUR, India/KULAI, Malaysia (Reuters) - When night falls in the Indian village of Nabipur, the backyard furnaces come to life, burning waste tires from the West, making the air thick with acrid smoke and the soil black with soot.\n\nFILE PHOTO: A worker passes steel wires and a tyre at a tyre pyrolysis plant in Kulai, Johor, Malaysia August 7, 2019. REUTERS/Edgar Su\n\nNot long ago, Nabipur was a quiet farming village in northern India. Now the village is home to at least a dozen furnaces burning a steady stream of tires to make low-quality oil in a process known as pyrolysis.\n\nGlobal trade in waste tires has almost doubled in the past five years, mainly to developing countries like India and Malaysia, according to customs data provided to the United Nations.\n\nBritain is currently the largest exporter, followed by Italy and the United States. India is by far the biggest buyer, accounting for 32% of global imports last year, up from 7% five years ago, the U.N. data shows.\n\nMany of the tires are sent to recycling operations that comply with emissions and waste disposal regulations. But there is also a vast trade to backyard pyrolysis operations that do not, according to local authorities.\n\nIn May, Reuters revealed that a mass poisoning in southern Malaysia had links to companies engaged in pyrolysis.\n\nUsing unpublished customs data and interviews with dozens of industry sources, Reuters documented a growing international trade in waste tires that pollute the communities that host them, according to local authorities and health experts.\n\nFor many developed countries, shipping tires abroad is cheaper than recycling them domestically. That helped drive international trade in rubber waste to nearly 2 million tonnes in 2018, equivalent to 200 million tyres, from 1.1 million tonnes in 2013.\n\nThe trade has also been fed by ravenous fuel demand for industrial furnaces in countries like India, the emergence of inexpensive Chinese pyrolysis equipment, and weak regulations worldwide. FACTBOX on the tyre trade:\n\nUNSUSTAINABLE\n\nTires are not defined as hazardous under the Basel Convention, which governs trade in dangerous waste, meaning there are few restrictions on trading them internationally unless specified by the importing country.\n\nIn most countries, including China and the United States, the majority of scrap tires are handled domestically and dumped in landfills, recycled or used as fuel in factories producing products like cement and paper.\n\n(GRAPHIC: Recycling and reuse of tires - here)\n\nPyrolysis supporters say the process can be a relatively clean way of disposing of tires and turning them into useful fuel. However, controlling emissions and processing waste residue from the burning of a product that is made up a wide range of chemicals, and synthetic and natural rubber is expensive and difficult to make profitable on a mass scale.\n\nState-of-the-art plants can cost tens of millions of dollars, whereas basic Chinese-made pyrolysis equipment is available from online retailers for as little as $30,000.\n\nAn Indian government audit found that as of July 2019 there were 637 licensed pyrolysis plants countrywide, of which 270 were not complying with environmental standards and 116 had been shut down.\n\nThe audit said most operators used rudimentary equipment that exposed workers to fine carbon particles and led to dust, oil and air pollution leaking into the plant and surroundings. Industry sources say several hundred more unlicensed pyrolysis businesses are operating across India.\n\nPyrolysis plants have mushroomed in the southern Malaysian state of Johor over the last decade, industry sources said, where they supply fuel for ships.\n\nAt one plant visited by Reuters near the Johor town of Kulai, Bangladeshi immigrants covered in carbon dust shovelled tires imported from Australia and Singapore into a Chinese-made furnace. They lived onsite in a hut next to the kilns.\n\n“People don’t know where old tyres go,” said the owner, who gave his name only as Sam. “But if my factory doesn’t exist, where will the tires go?” He said he had a license to operate. Reuters could not verify this.\n\nThe environmental impact of pyrolysis in places like India and Malaysia is making some exporting countries take notice.\n\nAustralia, a major exporter of tyres to Southeast Asia and India, said in August it would ban waste exports, including tires, although it did not give a timeline.\n\nAustralia was “aware of allegations of unsustainable processing of waste tires in some importing countries” and did not want “to be part of such practices”, said a spokesman for Trevor Evans, the official who oversees waste reduction.\n\nBurning tyres without adequate emissions controls can release numerous toxic chemicals and gases into the environment, as well as particulates, said Lalit Dandona, head of the India State-Level Disease Burden Initiative, a group of research bodies mapping health issues across India.\n\n(GRAPHIC: What's in a tire? - here)\n\nHe said the short-term effects for those exposed to smoke from burning tires included skin irritation and lung infections and that prolonged exposure could result in heart attacks and lung cancer. Other government bodies worldwide, including the U.S. Environmental Protection Agency, have made similar conclusions. In a 1997 report, the EPA said emissions from burning tires included dioxins, sulphur oxides and a range of metals including mercury and arsenic.\n\nFROM BRITAIN TO INDIA\n\nMany of the tires that end up in Indian villages like Nabipur start their lives in Britain. Indian waste tire imports from Britain alone in 2018 amounted to 263,000 tonnes - 13% of the total volume of tires traded worldwide - compared with 48,000 tonnes in 2013.\n\n(GRAPHIC: Where India imports its waste tires - here)\n\nMost European countries require tyre manufacturers and suppliers to organize tire collection and treatment, meaning there are more home-grown recycling operations. There are no such requirements in Britain, however, which means that small firms can easily obtain licenses to collect waste tires and sell them abroad.\n\nBritain’s Department for Environment, Food and Rural Affairs (DEFRA) said it fully implements the rules of the Basel Convention but needs to do more about waste tires. DEFRA said it planned to make producers more responsible for old tires, as well as increase monitoring of shipments.\n\n(GRAPHIC: Top tire waste importing countries - here)\n\nOnce in India, the tires are dispersed between recyclers who shred them for use in road-building or sports fields, firms that burn them as cheap fuel to make cement or bricks, and legal and illegal pyrolysis plants, importers and exporters said.\n\nIndia’s Automotive Tyre Manufacturers’ Association estimates that most imported waste tyres end up in pyrolysis plants, according to the group’s deputy director, Vinay Vijayvargia.\n\nFaced with a growing backlash from environmental groups and residents living near pyrolysis plants, India is considering banning all but the most sophisticated operations. The country’s environmental court is expected to rule on the proposed ban in January.\n\nGARBAGE DUMP\n\nSix years ago, there were no pyrolysis plants in Nabipur, 70 miles south of New Delhi. Now there are 10, with most operating at night to avoid scrutiny, residents said. Reuters visited three small plants in the village.\n\nAt one, tires embossed with ‘Made in Germany’ and ‘Made in U.S.A.’ lay strewn on the floor and thick sludge seeped from pipes protruding from incineration drums. Most tires used for vehicles in India are made domestically.\n\nWorkers wore no safety equipment, and their skin and clothes were covered in black soot. The owner, Pankaj, said a trader sells him tires imported from abroad.\n\nVillagers said they have suffered from breathing difficulties and eye and throat infections since the plants began expanding, and farmers had found black dust in their soil.\n\nReuters could not independently verify the claims. It was also not possible to verify if the operations were licensed.\n\n“Used tires are not available locally, so they import from abroad,” said Shiva Choudhary, a businessman who leases out construction equipment in Nabipur. “They clean their own country and dump their garbage on us.”", "description": "When night falls in the Indian village of Nabipur, the backyard furnaces come to life, burning waste tires from the West, making the air thick with acrid smoke and the soil black with soot.", "authors": ["John Geddie", "Sudarshan Varadhan", "Joe Brock", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191018&t=2&i=1442201826&w=1200&r=LYNXMPEF9H0G1-OCATP", "published_at": "2019-10-18"}