{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7587587/Police-Scotland-prank-Met-colleagues-plastering-STICKERS-vans.html", "downloaded_at": "2019-10-18 10:36:47.186612+00:00", "title": "Police Scotland prank their Met colleagues by plastering STICKERS onto their vans", "language": "en", "text": "Police Scotland are at war with their Met colleagues after plastering cheeky stickers to their vans as they are drafted in to help with Brexit and Extinction Rebellion protests.\n\nScottish officers have stuck hundreds of 'Keeping London Safe' stickers to Metropolitan Police vehicles that include the phrase 'Lovely Jubbly' - a nod to Del Boy in Only Fools and Horses.\n\nImages posted on Twitter showed the design attached to a Met van, with one London officer Kelvin Robbins writing: 'You cheeky wotsits' with three laughing emojis.\n\nOfficers from rival forces say it is payback for the 'I've Met the Met' stickers, which over the years have been plastered on police from across the UK as they visit London to help police the capital.\n\nScottish officers have stuck hundreds of 'Keeping London Safe' stickers to Metropolitan Police vehicles that include the phrase 'Lovely Jubbly' - a nod to Del Boy in Only Fools and Horses\n\nOfficers from rival forces say the sticker war is payback for the 'I've Met the Met' stickers, which over the years have been plastered on police from across the UK as they visit London to help police the capital\n\nThe Met launched the stickers as part of an outreach drive in the 1980s, and were intended to be handed out to children.\n\nAfter finding one of the Police Scotland stickers on his van during the Extinction Rebellion Protests this week, PC James Lewis wrote on Twitter: 'Lovely bit of mutual aid stickering down here at the XR demonstrations!\n\n'Thank you @policescotland Your level of humour is greatly appreciated as is your assistance down here at these times!\n\n'Give me a shout if you are free and I'll gladly join you for a beer!'\n\nOfficers from Police Scotland have been called in to assist the Met in policing the capital in the wake of Brexit protests and Extinction Rebellion demonstrations\n\nAnother officer wrote: 'Fantastic... you snooze you lose. I suspect this may mean war.'\n\nDuring the Olympics in 2012 the Met was criticised by officers when a constable was disciplined for putting a sticker on a police van from a Welsh force.\n\nThe officer received 'management action' but was also referred to the Directorate of Professional Standards.\n\nA second officer was also investigated but no action was taken in that case.", "description": "Scottish officers have stuck hundreds of 'Keeping London Safe' stickers to Metropolitan Police vehicles that include the phrase 'Lovely Jubbly' - a nod to Del Boy in Only Fools and Horses.", "authors": ["Ed Riley For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/10/19875162-0-image-a-18_1571390205881.jpg", "published_at": "2019-10-18"}