{"pub": "nytimes", "url": "https://nytimes.com/2019/10/07/us/politics/trump-turkey-syria.html", "downloaded_at": "2019-10-07 06:01:27.165279+00:00", "title": "Trump Endorses Turkish Military Operation in Syria, Shifting U.S. Policy", "language": "en", "text": "“Allowing Turkey to move into northern Syria is one of the most destabilizing moves we can do in the Middle East,” Representative Ruben Gallego, an Arizona Democrat and former Marine who served in the Iraq war, said on Twitter on Sunday night. “The Kurds will never trust America again. They will look for new alliances or independence to protect themselves.”\n\nMr. Erdogan has demanded a “safe zone” for his nation to run 20 miles deep and 300 miles along the Turkish-Syrian border east of the Euphrates. That area, he has said, would be reserved for the involuntary return of at least a million Syrian refugees now inside Turkey. Mr. Erdogan has threatened to send a wave of Syrian migrants to Europe instead if the international community does not support the initiative to send them back to Syria.\n\nSince early August, the American and Turkish militaries have been working together on a series of confidence-building measures — including joint reconnaissance flights and ground patrols — in a 75-mile-long strip of that 300-mile border area.\n\nAmerican-backed Kurdish forces have pulled back several miles and destroyed fortifications in that area.\n\nThe pace of these operations has not been fast enough for Mr. Erdogan, and last week he began indicating that he planned to launch an incursion across the border. He did the same thing over the summer, prompting a flurry of American diplomatic activity bolstered by the military confidence-building measures.\n\nDefense Secretary Mark T. Esper and Gen. Mark Milley, the new chairman of the Joint Chiefs of Staff, both called their Turkish counterparts last week to try and reduce tensions. But unresolved threats from Turkey apparently resulted in the decision by Mr. Trump on Sunday.", "description": "The operation would sweep away American-backed Kurdish forces near the border in Syria. The White House said U.S. forces “will no longer be in the immediate area.”", "authors": ["Eric Schmitt", "Maggie Haberman"], "top_image": "https://static01.nyt.com/images/2019/11/06/world/06dc-military-1sub/06dc-military-1sub--facebookJumbo.jpg", "published_at": "2019-10-07"}