{"pub": "dailybeast", "url": "https://thedailybeast.com/coleen-rooney-and-rebekah-vardy-real-housewives-of-soccer-go-to-war-over-instagram-mole-hunt", "downloaded_at": "2019-10-09 18:31:57.680473+00:00", "title": "Real Housewives of Soccer Go to War Over Instagram Mole Hunt", "language": "en", "text": "It was a lengthy investigation, one that was carefully planned and meticulously executed over the course of several months.\n\nAnd when the big reveal came, it was delivered in stunning style, with a sensational and dramatic denouement.\n\nThe key players in this tale of skulduggery and social-media espionage are the wives of former England soccer captain and MLS star Wayne Rooney, who now plays for D.C. United, and Jamie Vardy, a striker, who used to play alongside Rooney in the English national soccer team.\n\nColeen Rooney explained in a lengthy social-media post that she had set out to uncover the mole in her closed Instagram group who was leaking personal stories to the newspapers. By a process of elimination—she eventually blocked all but one of her followers from seeing her Insta stories—she planted fake stories and waited to see if they would appear in the British tabloid newspaper The Sun.\n\nThe latest of these concerned the basement of her house being flooded; The Sun hastily removed the story from its website today. Another claimed the Rooneys were planning to jet to Mexico for gender-selection treatment.\n\nThe only account left to read these totally false stories belonged to one Rebekah Vardy.\n\nColeen’s next move was to take to Twitter and Instagram to blow the whistle on her fellow WAG—British tabloid slang for the wives and girlfriends of soccer stars.\n\nSocial-media users and British journalists—outside of The Sun newspaper—hooted with delight at the detective work of the D.C. United star’s partner who was soon dubbed “WAGatha Christie.”\n\nRebekah Vardy was quick to launch a speedy counterattack of the kind that made her husband famous on the sports field. She said Coleen was wrong to accuse her of leaking the stories and should have called her first. She suggested that her own Instagram account must have been hacked and accessed by a third party, who was then feeding the private stories to The Sun.\n\nThe meme-loving referees of social media seem to have come down almost unanimously on Rooney’s side.\n\nThere have been persistent rumors that, off the field, they and especially their wives, didn’t get along, despite the women being pictured sitting together in the bleachers cheering on their spouses during England’s unsuccessful Euro 2016 campaign. Those rumors exploded into the public on Wednesday.\n\nThe bad blood is believed to go back to the ill-fated 2016 tournament. At the time, former England boss Roy Hodgson, asked about the alleged rift, said: “I haven’t got a clue what you are referring to. There are absolutely no problems in football terms between Wayne Rooney and Jamie Vardy. In fact quite the reverse, they are very close friends, both on the field and off the field.”\n\nThat supposed friendship now looks about as likely as the U.S. winning the 2022 Men’s World Cup.", "description": "Their husbands are both legends of British sport, but rumors of a difficult relationship off the field burst into the open today with a dramatic online fight between their wives.", "authors": ["Tom Sykes"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_576,w_1024,x_0,y_23/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1570618073/GettyImages-173102808_ofryql", "published_at": "2019-10-09"}