{"pub": "metro", "url": "https://metro.co.uk/2019/10/29/eastenders-spoilers-sharon-mitchell-shocked-as-ben-reveals-mel-owen-harboured-hunter-11003677", "downloaded_at": "2019-10-30 00:05:23.534202+00:00", "title": "EastEnders spoilers: Sharon shocked as Ben reveals Mel harboured Hunter", "language": "en", "text": "Mel Owen (Tamzin Outhwaite) has been making Sharon Mitchell’s (Letitia Dean) life a living hell in EastEnders over the last couple of months, but it seems as if the tables might finally be set to turn, as Sharon learned a shocking secret about her adversary courtesy of Ben Mitchell (Max Bowden) during tonight’s episode.\n\nSharon returned from her trip to Portugal last night, and informed Mel that she’d managed to acquire a villa on her behalf. As she’d fulfilled Mel’s wishes, she was hopeful that the blackmail would come to an end — but little did she know that it was only just the beginning, as Mel threatened to reveal her secret to Phil (Steve McFadden) if she refused to continue meeting her demands.\n\nAs a result of these demands, Sharon found herself with no choice but to negotiate with Ruby (Louisa Lytton) over the sale of E20.\n\nAdvertisement\n\nAdvertisement\n\nRuby called round to the Mitchell household to discuss terms but the pair ended up coming to blows, with Sharon reminding the young woman that it was her dad who was responsible for Dennis Rickman’s (Nigel Harman) death.\n\nAs Ruby discussed the sale of the club with Lisa (Lucy Benjamin), an inquisitive Ben overheard and proceeded to confront Sharon about why she’s selling something she holds so dear.\n\nSharon revealed that Mel’s the reason she’s being forced to sell up, as she can no longer get along with her after Phil attempted to stop her from organising Hunter’s (Charlie Winter) funeral.\n\nKnowing that Sharon could do with some dirt on Mel, Ben revealed that Mel harboured Hunter prior to the siege. Sharon’s shocked, but as Ben departed the E20 office, it became apparent that Sharon now has the leverage she needs.\n\nWill this new information finally put an end to Mel’s demands?\n\nWill Sharon counteract Mel’s blackmail with blackmail?\n\nEither way, Sharon has the upper hand, so Mel had better watch out!\n\nEastEnders continues Thursday 31stOctober at 7:30pm on BBC One.\n\nMORE: EastEnders spoilers: Mel Owen exposes Sharon Mitchell and Keanu Taylor’s secret publicly?\n\nMORE: 12 soap spoiler pictures: EastEnders engagement, Coronation Street feud, Emmerdale betrayal, Hollyoaks revenge\n\nAdvertisement Advertisement", "description": "With Mel proving to be a thorn in Sharon's side, Ben gave her the leverage she needs to get the upper hand.", "authors": ["Stephen Patterson"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/ben-mitchell-and-sharon-mitchell-in-eastenders_1572347981.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-29"}