{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/food/tom-sietsemas-7-favorite-places-to-eat-right-now/2019/10/18/0d4e6a3a-ee99-11e9-8693-f487e46784aa_story.html", "downloaded_at": "2019-10-22 14:02:26.141894+00:00", "title": "Tom Sietsema’s 7 favorite places to eat right now", "language": "en", "text": "Bresca\n\nMaybe you’ve heard. Chef-owner Ryan Ratino is whipping up another restaurant, upstairs from Bresca. When it rolls out, hopefully before New Year’s Eve, Jônt is expected to showcase an upscale bar and a progressive tasting menu, the latter influenced by Ratino’s interest in fermentation.\n\nAD\n\nUntil then, it’s nice to have a place like Bresca in which to cool our heels. The dining room, enlivened with a carpet of moss on one wall and gold-colored fish heads on another, is no copycat of anything else around town. Same for his innovative cooking, often informed, says the chef, by a question: “What makes things taste better?”\n\nAD\n\nTangy buttermilk pooled around lightly poached scallops, shaved plum and shimmering orange roe, I’d submit. Ribbons of lardo draped over green tomato on smoky toast points, I’d put forth. Beef tendon puffed up like chicharrones, cloaked with shaved beef and fortified with fermented black beans? The mound is messy, marvelous fun.\n\nAny meal is more intoxicating when it begins with Bresca’s signature cocktail: Bees Knees, presented in a bee-shaped, glass-and-stainless-steel vessel that causes heads to turn — and lips to smack.\n\n1906 14th St. NW. 202-518-7926. brescadc.com. Small to medium plates, $15 to $26\n\nAfghan Bistro\n\nAD\n\nNo one who’s been here shows up without a reservation. The family-run Afghan Bistro is small and cramped but also warmhearted and enormously pleasing. Thus, Monday night looks like Saturday night everywhere else. The list of specials is as long as some restaurant’s standing menus. One attraction: tender chunks of veal and spiced greens atop a mound of fragrant brown rice and inside a frame of shredded carrots sweetened with plump raisins. Another: Pumpkin-stuffed dumplings in a bowl of chickpeas, lentils and minced beef, the surface of everything ringed with yogurt and fragrant with fresh dill.\n\nAD\n\nWhich is not to slight the regular menu. It, too, is a long parade of Afghan comforts, from crisp turnovers stuffed with dark greens and cilantro, cooled by a dip in avocado chutney, to marinated lamb chops, smoky from the grill and easy to whittle to the bone. A young dining companion opted for the sleeper on the menu: one of the area’s best hamburgers. Thanks to a brioche bun and sumac, garlic, lemon pepper and paprika in the seasoning, the sandwich is far from kid’s stuff.\n\n8081 Alban Rd., Springfield. 703-337-4722. afghanbistro.com. Dinner entrees, $14. 50 to $35 (lamb platter).\n\nJoselito Casa de Comidas\n\nThe chef at one of my favorite destinations on the Hill refuses to serve anything he deems inauthentic to what he grew up on. “I prefer to be honest” about Spanish flavors, says Madrid native David Sierra. So I have to ask: Is pasta tossed with chorizo and manchego really a thing back home? Turns out pasta with meat sauce was what a younger, fussier Sierra would get when dining out with his father, or at home when his mother was spoiling him. All I know is, the combination of penne, racy sausage and grated Spanish cheese baked into lacy chips makes a strapping and satisfying meal. Even better, it’s offered in a black-and-white dining room that looks as if has been airlifted from abroad.\n\nAD\n\nAD\n\nThe family photographs of owner Javier Candon lend a warm personal touch, and marble tables and tile floors add Old World elegance. Let your appetite guide you. Dishes are available in three portion sizes; my exploration of the list over the years uncovers mostly gems. Right now, I’m all about the shrimp carpaccio, a fan of lightly broiled seafood jazzed up with a lime and uni vinaigrette. Sierra previously cooked at the standard-bearer Fiola Mare in Georgetown, experience that explains not just the freshness in his cooking, but the beauty. Visit during Hemingway Hour at the bar (nightly from 4 to 7 p.m.) and you get 20 percent off your bill.\n\n660 Pennsylvania Ave. SE. 202-930-6955. joselitodc.com. Tapas, $9 to $17.\n\nModena\n\nTo get to your seat at the successor to Bibiana, you pass an antipasti cart that owner Ashok Bajaj imported from Italy and that chef John Melfi dresses with dishes as fetching as they are delicious. That’s your prompt to ease into a meal with crimson roasted red peppers bright with basil and lemon, sheep’s milk ricotta tart flavored with a changing seasonal vegetable or perhaps a salad of blood orange tossed with shaved fennel.\n\nAD\n\nAD\n\nI figured squid stuffed with spicy sausage, a recipe inspired by Melfi’s late grandmother, was my favorite plate, but only until I met its match: blushing veal roast garnished with crisp sweetbreads and pickled chanterelles. The chef’s cooking is Italian but not beholden to any region. Sometimes, as with the stuffed squid, set off with dots of avocado puree, a worldly touch sneaks in. Bottom line: It’s grand to have Melfi, sidelined by illness for more than a year, cooking again, and in such a dashing setting.\n\nMurals of Italian landmarks and splashes of blue are a fine backdrop for one of the best lunch deals in town: three elegant courses for $30.\n\n1100 New York Ave. NW. 202-216-9550. modenadc.com. Dinner entrees, $24 to $36.\n\nQ by Peter Chang\n\n“Save room for dessert” isn’t my usual advice at area Chinese restaurants. Then again, Q by Peter Chang excels at just about everything it does, chocolate sesame cake included. The “Uncle Pichet” referenced on the sweets list is no less than Pichet Ong, the craftsman behind the glorious confections at Brothers and Sisters in Washington’s Line hotel. Lisa Chang, the restaurant empire’s pastry chef, is behind the occasional cookie that finds its way, gratis, to customers as long as the day’s batch lasts. Go early to get in on the treat, a touch sweet with brown sugar but mostly a trumpet blast of chiles, pepper and 5-spice powder.\n\nAD\n\nAD\n\nBut I’m getting ahead of myself. First, you want to peruse the list of specials, which might highlight fluffy, ginger-lit crab meat balls splashed with housemade XO sauce or scallops and shrimp set in a brilliant “jade juice” coaxed from kale, onion and stock. The latter combination hides beneath a rice cracker dome, shards of which can be used as scoops for the pleasure in the bowl. You can pretty much point anywhere on the menu and strike gold. Steamed beef ribs take on the flavor of their lotus wrap, and pea shoot tips, glossy and crisp, are a delightful way to get your vegetables. Like dessert, wine is shown thought at Q, and the service is tops. Go, diner, go!\n\n4500 East-West Hwy., Bethesda. 240-800-3722. qbypeterchang.com. Dinner entrees, $16 to $38.\n\nVia Sophia\n\nColin Clark is this Italian arrival’s best asset. Before coming to the Hamilton Hotel downtown, the chef put in time at two of Washington’s most popular dining destinations, Fiola Mare in Georgetown and Le Diplomate in Logan Circle. Now he’s dishing out pasta and pizza of distinction across from Franklin Square.\n\nAD\n\nAD\n\nClark’s linguine and clams rely on little more than slightly undercooked pasta tossed with fresh seafood, garlic and chile flakes; his pie scattered with spicy salami, Fresno chiles and a drizzle of honey employs a whole-wheat crust that picks up welcome char in an 800-degree oven. From crudo to budino, the menu is a crowd-pleaser.\n\n“I want everything to feel very Italian,” says Clark. “But I want to surprise people a little bit.” Beef tartare, for instance, weaves in sharpeners of chopped sun-dried tomatoes and aged pecorino cheese. The dining room is too bright for my taste and the service varies from spot-on to “Where’s my waiter?” But I’ll put up with both for a tasteful trick or a great grilled fish.\n\n1001 14th St. NW. 202-218-7575. viasophiadc.com. Dinner entrees, $24 to $90 (for steak for two)\n\nZaytinya\n\nYou have to hand it to ThinkFoodGroup. The local restaurant company co-created by José Andrés is a master of small plates, be they Spanish (Jaleo), Mexican (Oyamel) or Middle Eastern (this place). Even better, the dozens of choices take into consideration the way a range of diners like to eat. Zaytinya makes me think I could become a vegetarian. The baba ghanoush — a beautiful swirl of smoke, silk and garlic — and crisp falafel, herb-packed chickpea fritters arranged on tahini sauce, are that compelling. Then I try the lemon-kissed fried squid, flanked with garlicky Greek yogurt, or lamb bacon nestled in lettuce cups with sun-dried tomato tzatziki, and think otherwise. The menu, right through a dessert of walnut ice cream paired with yogurt mousse and honey gelee, seems flawless.\n\nAD\n\nAD\n\nAs for the dining room, I love the waterfall framed in glass up front and the sweep of the interior, but not the pita crumbs I find on my chair when I sit down or the roar of the crowd no matter the time of my visit. Maybe those problems will be addressed early next year, when the restaurant undergoes a refresh. Meantime, as long as weather allows, take your mezze on the patio out front.\n\n701 Ninth St. NW. 202-638-0800. zaytinya.com. Small plates, $5 to $20.\n\nMore from Food:\n\nAD", "description": "This month’s list includes places that almost, but didn’t quite, make it into the fall dining guide.", "authors": ["Tom Sietsema", "Food Critic"], "top_image": "https://www.washingtonpost.com/resizer/uYRAJ60Ac5EX79PoF51Mu0PvIH4=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7AWZQKHJLUI6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-18"}