{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/conservatives-reaction-to-the-1619-project-is-disappointing--and-instructive/2019/09/09/2acfad58-d33c-11e9-9610-fb56c5522e1c_story.html", "downloaded_at": "2019-09-09 23:21:24.068781+00:00", "title": "Conservatives’ reaction to the ‘1619 Project’ is disappointing — and instructive", "language": "en", "text": "A replica of a house for slaves is seen at Monticello, home of Thomas Jefferson, who drafted the Declaration of Independence. (Carlos Barria/Reuters)\n\nColumnist\n\nConservative reaction to the New York Times’ “1619 Project” — an attempt to tell the story of slavery and its lasting effect on American political, economic and social structures — has been both disappointing and instructive.\n\nI am not referring here to thinkers (the term is employed loosely) who consciously embrace a philosophy of white supremacy. Though resurgent and repellent, they do not constitute the mainstream of conservative thinking on race.\n\nI am thinking instead of conservative writers who argue that the 1619 Project is a prime example of leftist ideological overreach — that its (mainly African American) authors see the country entirely through the prism of its sins and intend to “delegitimize” the American experiment. In making this case, some conservatives have offered excuses — or at least mitigations — for the moral failures of the Founders on matters of race. The institution of slavery, we are assured, was historically ubiquitous. The global slave trade, we are reminded, involved not just Americans but Arabs and black Africans. Other countries, we are told, took more slaves than America, treated them worse and liberated them later.\n\nThe attempt here is to defend the honor of the American experiment by denying the uniqueness of its hypocrisy on slavery. In one way or another, all these arguments ask us to consider the inadequacies of the Founders within the context of their times.\n\nBut to deny the uniqueness of American guilt on slavery is also to deny the uniqueness of its aspirations. Americans are required to have ambiguous feelings about many of the country’s Founders precisely because of the moral ideals the Founders engraved in American life. The height of their ambitions is also the measure of their hypocrisy. It should unsettle us that the author of the Declaration of Independence built a way of life entirely dependent on human bondage.\n\nThis leads to an unavoidably complex form of patriotism. We properly venerate not the Founders, but the standards they raised and often failed to meet. This is their primary achievement: They put into place an ideological structure that harshly judged their own practice and drove American democracy to achievements beyond the limits of their vision.\n\nOne thing we cannot do is excuse the Founders according to the standards of their time. In the mid to late 18th century, there was plenty of compelling moral thinking on the issue of slavery.\n\nIn 1759, Quaker Anthony Benezet wrote “Observations on the Enslaving, Importing and Purchasing of Negroes,” which presented eyewitness accounts of the cruelties of the slave trade. Benezet called slavery “inconsistent with the gospel of Christ, contrary to natural justice and the common feelings of humanity, and productive of infinite calamities to many thousand families, nay to many nations, and consequently offensive to God the father of all mankind.”\n\nIn 1776, the year independence was declared, Presbyterian pastor Samuel Hopkins wrote “A Dialogue Concerning the Slavery of the Africans,” which he dedicated to the Continental Congress. Hopkins was alert to the incongruity of the American cause, urging his readers to “behold the sons of liberty oppressing and tyrannizing over many thousands of poor blacks who have as good a claim to liberty as themselves.”\n\nIn 1778, another minister, Jacob Green, preached a fast-day sermon referring to slavery as a “most cruel, inhuman, unnatural sin.” He also pointed out the discrediting inconsistency of a country that was dedicated to liberty and yet tolerant of slavery: “What foreign nation can believe that we who so loudly complain of Britain’s attempts to oppress and enslave us, are, at the same time, voluntarily holding multitudes of fellow creatures in abject slavery . . . ?”\n\nAmerica’s Founders stand accused by the best, most humane standards of their own time. When Jefferson wrote about natural rights on his mountaintop prison for black people, many of his contemporaries knew he was, on this issue, a total hypocrite.\n\nAmerica’s story is not one of initial purity and eventual decay. It is the story of a radical principle — the principle of human equality — introduced into a deeply unjust society. That principle was carried forward by oppressed people who understood it better than many of the nation’s Founders. Denied the blessings of liberty, African Americans became the instruments by which the promise of liberty was broadly achieved. The victims of America’s moral blindness became carriers of the American ideal.\n\nThis story is not simple to tell. But it is miraculous in its own way. And it is good reason to be proud of America.\n\nRead more from Michael Gerson’s archive, follow him on Twitter or subscribe to his updates on Facebook .", "description": "America’s Founders stand accused by the best, most humane standards of their own time.", "authors": ["Michael Gerson", "September At Pm", "Michael Gerson Is A Nationally Syndicated Columnist Who Appears Twice Weekly In The Post."], "top_image": "https://www.washingtonpost.com/resizer/iFqO-4mSvOrGhseHAivO2p0R06Q=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/Y4BYPNGTIQI6TFQQ7NLMKURODQ.jpg", "published_at": "2019-09-09"}