{"pub": "washingtonpost", "url": "https://washingtonpost.com/nation/2019/09/05/jacob-wohl-felony-security-california", "downloaded_at": "2019-09-05 10:29:15.962174+00:00", "title": "Conservative activist Jacob Wohl charged with felony in California", "language": "en", "text": "\n\nJacob Wohl, a conservative activist and conspiracy theorist, faces arraignment in October on a felony count of illegally selling a security.\n\nIn 2016, an Arizona man called prosecutors in Riverside, Calif., to report that he’d been ripped off. Two men in the Southern California town who claimed to be running a hedge fund had taken $75,000 from him, he said, and then promptly lost it all. The tipster later killed himself.\n\nBut his claim helped spark a three-year investigation that has now resulted in a felony charge against both men — one of whom, Jacob Wohl, has since become a headline-generating conservative activist and conspiracy theorist.\n\nWohl, 21, appeared in court on Wednesday and now faces arraignment in October for one count of selling an unregistered security, as first reported by the Daily Beast. He didn’t immediately return a message late Wednesday.\n\nThe criminal case is the latest turn in a whiplash career that has seen Wohl transform from a stock-trading wunderkind (later banned from an industry group) to a President Trump-backing Twitter figure (later booted off the platform) to the activist behind botched attempts to smear former special counsel Robert S. Mueller III and South Bend, Ind., Mayor Pete Buttigieg (D) with fabricated sexual assault claims.\n\n[Meet the GOP operatives who aim to smear the 2020 Democrats — but keep bungling it]\n\nWohl’s new legal troubles date back to a series of firms he ran with a partner named Matthew Johnson. Riverside prosecutors began looking into the pair in June 2016 following the complaint from the Arizona man, who is identified only as “David” in court documents.\n\nIn July 2016, a senior investigator with the Riverside County District Attorney’s Office contacted Wohl’s firm, Montgomery Assets, posing as a real estate agent representing an investor. Montgomery Assets purported to invest in “real estate, hedge funds,” and “private equity,” prosecutors said.\n\nAfter chatting with Johnson and Wohl for about a month, the investigator and an undercover Riverside Police detective set up a deal to invest $100,000 in a fund that supposedly bought and flipped derelict houses for a profit. They were promised a 17 percent return in a year, according to court documents.\n\nAbout a month later, the Arizona Corporation Commission sent Wohl a cease-and-desist order, noting that Montgomery Assets misrepresented its “size, the experience of its employees, and the risk” of its investments. Wohl agreed to a $5,000 fine and $32,000 in restitution in that case — neither of which he had paid as of last June, reported The Washington Post’s Manuel Roig-Franzia and Beth Reinhard.\n\n[Twitter suspends far-right activist Jacob Wohl for creating accounts to allegedly manipulate the U.S. presidential election]\n\nWohl defended his business practices at the time, telling The Post that the lack of criminal charges or lawsuits “are good indications I’ve never done anything wrong.”\n\nIn the years since, Wohl made a name for himself, first as an ardent Trump supporter and then as a dirty trickster who openly aimed to sully the reputations of those he saw as the president’s enemies.\n\nLate last year, Wohl and lobbyist Jack Burkman called a news conference and promised testimony from a woman who would claim Mueller had raped her; the woman never showed and Mueller asked the FBI to probe whether the pair offered her money. (They deny doing so.) In April, they gathered reporters again, this time to level sexual assault claims against Buttigieg — even though the supposed victim had already recanted and said he was pressured into making the false claim.\n\nWohl also authored a document, reported by the Daily Beast, suggesting raising $1 million to put out false information about Democratic candidates to swing betting markets.\n\nIt’s not clear why California prosecutors waited to file charges, though the case’s three-year statute of limitations was nearly up, according to The Daily Beast.\n\nIn court documents, prosecutors say the $100,000 deal “appeared to be an offer to sell a security” by Wohl and Johnson, and that the security wasn’t qualified with the California Department of Business Oversight as state law requires.\n\nIt’s not clear from court documents if either Wohl — who lists a current residence in the nearby town of Corona, Calif. — or Johnson have an attorney yet.", "description": "Wohl faces the charges in California over a company he ran in 2016.", "authors": ["Tim Elfrink", "Editor Of The Morning Mix", "September At Am", "Tim Elfrink Joined The Washington Post In He'S The Editor Of Morning Mix."], "top_image": "https://www.washingtonpost.com/resizer/BQAvcpLYSsgeDfPdeyDoycSFVio=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TOWM7PUDWZAAHLFFQD6UO5ADZQ.jpg", "published_at": "2019-09-05"}