{"pub": "cbs", "url": "https://cbsnews.com/news/epicured-meal-delivery-caters-to-people-with-restrictive-diets", "downloaded_at": "2019-10-16 20:35:38.153747+00:00", "title": "Epicured meal delivery caters to people with restrictive diets", "language": "en", "text": "Even people with the most restrictive diets can indulge in gourmet cuisine from Michelin-starred chefs thanks to Epicured, a subscription meal-delivery service that caters to people who suffer from a range of health conditions, including Crohn's and celiac diseases.\n\nThe food startup's co-founders, Richard Bennett and Renee Cherkezian, say they are committed to better integrating nutrition and healthcare, so that good-tasting food can be a part of patients' lives.\n\n\"The idea of using nutrition in the healthcare system is something we want to promote not just for what people call chronic disease management but for prevention,\" Bennett told CBSN.\n\nCherkezian said she was inspired by caring for a friend who was undergoing cancer treatment. \"I saw the impact nutrition and a healthy diet had on recovery, so I wanted to hone in on my culinary skills,\" she said.\n\nShe balanced two gigs — her full-time job as a nurse and an internship with chef David Burke — to gain practical experience before launching Epicured.\n\nAll of Epicured's meals are gluten-free and suitable for those who follow what's called a low-FODMAP diet, meaning they have trouble breaking down short-chain carbohydrates.\n\nEpicured substitutes beans, onions and garlic in chili for FODMAP friendly vegetables, measuring each ingredient to the gram.\n\nThe duo, who met as freshman at Georgetown University, say their paths crossed 20 years later after independent careers in finance (Bennett) and nursing (Cherkezian). Their long-term history is part of what makes them good business partners, Bennett said.\n\n\"If you don't have a deep relationship before you get into business together, it's a yellow flag for me,\" he said.", "description": "Subscription meal-delivery service makes gluten-free food for people who suffer from a range of conditions", "authors": ["Megan Cerullo"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/10/16/cdd02cec-b4c5-4ee2-bff2-39f51edefd8b/thumbnail/1200x630/60ee19046cfe587855ee363a1a4ae514/screen-shot-2019-10-16-at-11-33-25-am.png", "published_at": "2019-10-16"}