{"pub": "metro", "url": "https://metro.co.uk/2019/10/12/rihanna-finally-confirmed-one-detail-new-albums-title-10906291", "downloaded_at": "2019-10-12 13:03:15.399320+00:00", "title": "Rihanna has finally confirmed one detail about new album's title", "language": "en", "text": "Rihanna has set the record straight about the alleged album title of R9 (Picture: Getty Images)\n\nThere aren’t many details to work with when it comes to Rihanna highly-anticipated new album, loving titled R9 by fans.\n\nAnd while the singer still isn’t in a position to reveal what the official title just yet, she is dismissing all the false info that’s been put out online.\n\nSpeaking at the launch of her chic visual autobiography in New York City, the Man Down singer set the record straight about the rumour she registered ‘Private Loving’ as a song and title for R9.\n\n‘That’s…no, that’s not true,’ Rihanna responded. ‘That’s not gonna be the title of any album of mine.’\n\n‘You know what… the this is when I have more information, you’ll be the first to know. And I will gladly vomit that out here on the red carpet.’\n\nAdvertisement\n\nAdvertisement\n\nHowever, Rih has slowly been sharing details about the album, recently revealing it’s reggae-inspired.\n\nThe Man Down singer might not have a title yet, but it definitely isn’t Private Loving (Picture: Getty Images)\n\n‘I like to look at it as a reggae-inspired or reggae-infused album,’ she explained to Vogue. ‘It’s not gonna be typical of what you know as reggae. But you’re going to feel the elements in all of the tracks.’\n\nThe 31-year-old went on to say: ‘Reggae always feels right to me. It’s in my blood. It doesn’t matter how far or long removed I am from that culture, or my environment that I grew up in; it never leaves.’\n\nAll we know so far is that there will be a reggae-inspired vibe to her new music (Picture: Invision/AP)\n\nWhile we wait, fans will be able to buy the star’s luxurious new coffee table book which is basically just the Rihanna photo album of dreams.\n\nConsidering the fact that project has been five years in the making, something tells us we could still have a long while to go before any new music is released by the star.\n\nThe Rude Boy singer has also been enjoying success with her Savage x Fenty lingerie range.\n\nAdvertisement\n\nAdvertisement\n\nRih’s brand has become famous not only for the inclusive designs and scorching campaign pictures, but also for her game-changing runway shows.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Rihanna is queen of our hearts as she rocks leopard print for book launch\n\nMORE: Rihanna turned down Super Bowl appearance because she ‘couldn’t be a sellout’", "description": "Rihanna still isn't in a position to reveal what the official title of her album is but she's dismissing this rumour about R9.", "authors": ["Nola Ojomu"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_89526615_1570882340.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-12"}