{"pub": "townhall", "url": "https://townhall.com/tipsheet/juliorosas/2019/10/30/us-military-power-is-overall-marginal-report-n2555613", "downloaded_at": "2019-10-30 23:19:43.978898+00:00", "title": "The US Military's Power Is Overall 'Marginal': Report", "language": "en", "text": "In the Heritage Foundation's annual report on the state of the U.S. military, they found the overall condition of the country's armed forces to be \"marginal\" in their ranking system.\n\nThe findings of the 2020 Index Of U.S.Military Strength, which was released on Wednesday, is based on the conservative think tank's assessments of each of the military branches' capacity, capability, and readiness. The scale goes from \"very \"weak,\" \"weak,\" \"marginal,\" \"strong,\" and \"very strong\":\n\n\"As reported in all previous editions of the Index, the common theme across the services and the U.S. nuclear enterprise is one of force degradation caused by many years of underinvestment, poor execution of modernization programs, and the negative effects of budget sequestration (cuts in funding) on readiness and capacity in spite of repeated efforts by Congress to provide relief from low budget ceilings imposed by the Budget Control Act of 2011 (BCA) through two-year budget agreements that either waived the BCA caps or provided extra funding in contingency accounts not subject to BCA limits. Subsequent to new guidance provided by then-Secretary of Defense James Mattis in the 2018 NDS, the services undertook efforts to reorient from irregular warfare to large-scale combat against a peer adversary, but such shifts take time and even more resources.\"\n\nBroken down into the branches, the Army was given a \"very strong,\" the only one given, in readiness, but was \"weak\" in capacity, The Navy and Marine Corps were also assessed to be \"weak\" in their capacity, while being \"marginal\" in the other two areas. The Air Force was rated as being \"marginal\" in all three categories.\n\n\"In the aggregate, the United States’ military posture is rated 'marginal' and features both positive and negative trends: progress in bringing some new equipment into the force, filling gaps in manpower, and rebuilding some stocks of munitions and repair parts alongside worrisome trends in force readiness, declining strength in key areas like trained pilots, and continued uncertainty across the defense budget,\" the Heritage Foundation concluded.\n\nPrior to their Index's rollout, Secretary of the Navy Richard V. Spencer told reporters how years of continuing resolutions (CRs) and sequestration harmed military readiness.\n\n\"If you were to say the Budget Control Act and continuing resolutions and sequestration was to control spending, and I don't know if they were actually considering what it did to readiness, but we were put into this situation...well, ten continuing resolutions later we still provide security for the United States of America and our allies,\" he said, adding that because the military has shown they can work with CRs, Congress has had the mindset the military can work with a CR for another year.\n\n\"Yeah we will, but what will we look like on the other side?,\" Spencer asked.", "description": ".10/30/2019 19:15:56PM EST.", "authors": ["Julio Rosas", "Matt Vespa", "Katie Pavlich", "Bronson Stocking"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2017/233/20aced9a-5c29-4c30-8166-a8a21a9feafc.jpg", "published_at": "2019-10-30"}