{"pub": "guardian", "url": "https://theguardian.com/football/2019/sep/23/lionel-messi-virgil-van-dijk-the-best-fifa-awards", "downloaded_at": "2019-09-24 00:55:17.087368+00:00", "title": "Lionel Messi’s enduring luminous talent marks him out as The Best", "language": "en", "text": "It is easy to become a little inured but his achievements are astonishing – 54 goals, the European golden boot and Champions League top-scorer\n\nWas it ever really in doubt? Lionel Messi is The Best: it’s official. On a night of pomp, power‑play and deliciously terrible tuxedos Messi won his seventh major player of the year award in Milan on Monday, a first Fifa The Best gong to go with his five Ballons d’Or and one edition of the now defunct World Player of the Year.\n\nVirgil van Dijk had been many people’s favourite to win the vote. Instead this was a case of Messi redux, a first such award since his 2015 Ballon d’Or. During which time Cristiano Ronaldo, his counterpart in the shared modern Goat‑dom, has hoovered up four of these increasingly overblown prizes. But not so now as Ronaldo came third and was left doing his best to project a veneer of magnanimous approval while Messi took the silver cup.\n\nLionel Messi and Megan Rapinoe named Fifa footballers of the year Read more\n\nThe women’s award was won by Megan Rapinoe, reward for a spectacular World Cup. Coaches of the year were Jürgen Klopp and Jill Ellis. And Fifa will be pleased with its work, another act of brand primping, of shoulders flexed, of power reasserted.\n\nIt is the fourth time the The Best awards have been staged. They are a re-working of the old world player of the year which, in a rare outbreak of good sense, was folded into the Ballon d’Or in 2010. Nature abhors an awards vacuum and The Best was relaunched in 2016.\n\nTo date the top two, the best of The Best, has read Ronaldo-Messi, Ronaldo-Messi, Modric-Ronaldo, and now Messi-Van Dijk. There will be some disappointment, and not just among Liverpool fans, that Van Dijk failed to take top spot. Victory in Milan would have garlanded a remarkable rise for a 28-year-old centre-back who was turning out in mid-table with Southampton just over a year and a half ago; an elite footballer with no great frills or showy innovation in his game, exemplar instead of the low-throttle skills of defensive intelligence, solidity and leadership.\n\nQuick guide The Best: Fifa award winners Show Hide Men's player: Lionel Messi (Barcelona and Argentina)\n\nWomen's player: Megan Rapinoe (Reign FC and USA)\n\nMen's coach: Jürgen Klopp (Liverpool)\n\nWomen's coach - Jill Ellis (USA)\n\nMen's goalkeeper: Alisson Becker (Liverpool and Brazil)\n\nWomen's GK: Sari Van Veenendaal (Atlético Madrid/Netherlands)\n\nPuskas award for best goal - Daniel Zsori (Debrecen v Ferencvaros)\n\nFan award - Silvia Grecco (Palmeiras)\n\nFair play award - Marcelo Bielsa and Leeds United\n\nFIFPro men's world XI - Alisson; Matthijs De Ligt, Marcelo, Sergio Ramos, Virgil Van Dijk; Frenkie De Jong, Eden Hazard, Luka Modric; Cristiano Ronaldo, Kylian Mbappé, Lionel Messi.\n\nFIFPro women's world XI - Van Veenendaal; Lucy Bronze, Nilla Fischer, Kelley O'Hara, Wendie Renard; Julie Ertz, Amandine Henry, Rose Lavelle; Marta, Alex Morgan, Megan Rapinoe.\n\nAll individual prizes in football are a bit jarring. Marketing campaigns and the cult of celebrity culture may tell us otherwise but fetishising the individual goes against the essence of all team sport. Real footballing beauty, and indeed any meaningful concept of success, lies in the collective.\n\nIn this light there will be a temptation for some to see a hint of convenience to this result. Messi remains a mega-brand, sponsor‑catnip and perfect podium-candy for the unctuous Gianni Infantino. Lest we forget, Messi was banned for three months from international football this year after accusing referees at the Copa América of bias, all of which is apparently forgotten when it comes to nights such as these.\n\nYet there is an unarguable kind of sense here. This was a straight vote. The three-man shortlist was drawn up by “a panel of football experts” and votes cast by national team coaches and captains and a group of Fifa-approved “fans from all over the world”.\n\nMessi is a mega-brand, perfect podium candy for the unctuous Gianni Infantino\n\nAt the end of which the presence of Van Dijk on the podium is a welcome turn and even quite revolutionary. This is a player whose interest lies entirely in improving the combined effect of his team. If Liverpool are the best club team in the world right now, Van Dijk has been the engine to this success, just as Liverpool’s rise is a triumph of team-building, the submersion of the individual in the collective will. It is a process acknowledged now at the most vainglorious of awards dos.\n\nMessi is still a deserving winner. It is easy to become a little inured to this, but his numbers are once again astonishing. During the qualifying period, 9 July 2018 to 13 July this year, Messi played 58 games and scored 54 goals. He captained Barcelona to the La Liga title, won the European golden boot and was also Champions League top-scorer.\n\nLeeds United and Marcelo Bielsa win Fifa fair play award for Aston Villa game Read more\n\nAgainst this Van Dijk played 59 games, played a part in 29 clean sheets and was man of the match in the Champions League final. Ronaldo scored 31 goals in 47 games, won a Serie A title and captained Portugal to Nations League glory, a wonderful effort aged 34 and in a new team, even for a high‑functioning replicant super-being.\n\nStill, though, Messi is something else. His legs have slowed a little and his role altered. But he remains a luminous, transcendent talent, with the power to ennoble even an occasion as inane and vacuous as The Best. Frankly one could have given him the gong just for his performance at Wembley against Tottenham, when he passed and dribbled and generally performed at a level that would surely match anything ever seen on an English pitch.\n\nSo for now put out more flags and keep dishing up those chunks of metal. As with Ronaldo, we will feel the true weight of that much‑garlanded presence only when it is finally gone.", "description": "It is easy to become a little inured but Lionel Messi’s achievements are astonishing – 54 goals, the European golden boot and Champions League top-scorer", "authors": ["Barney Ronay"], "top_image": "https://i.guim.co.uk/img/media/17ee83e0a428547990d9827863937a3f17f86d03/0_0_7578_4547/master/7578.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a640f593dd00211d2f93fec74d8b80b6", "published_at": "2019-09-23"}