{"pub": "investing.com", "url": "https://ph.investing.com/news/commodities-news/preciousgold-climbs-1-as-attacks-on-saudi-facilities-spur-safehaven-demand-51745", "downloaded_at": "2019-09-16 13:06:06.174910+00:00", "title": "PRECIOUS-Gold climbs 1% as attacks on Saudi facilities spur demand", "language": "en", "text": "PRECIOUS-Gold climbs 1% as attacks on Saudi facilities spur demand\n\n* Oil surges about 20%, world stocks slide\n\n* Fed, BoJ meetings in focus later in the week\n\n* Near-term support for gold sits around $1,500/oz - analyst\n\n\n\n(Updates prices)\n\nBy Brijesh Patel\n\nSept 16 (Reuters) - Gold rose more than 1% on Monday after\n\nan attack on key oil facilities in Saudi Arabia inflamed worries\n\nover the stability of the Middle East, driving investors to seek\n\nrefuge in assets seen as a haven from risk.\n\nA 20% bounce in oil prices in response to the attack also\n\nraised concerns over a potential rise in inflationary pressures,\n\nagainst which gold is often perceived as a hedge.\n\nSpot gold was up 1% at $1,503.60 per ounce as of 1138\n\nGMT, while U.S. gold futures GCcv1 rose 0.8% to $1,511.80 per\n\nounce.\n\n\"The reaction is driven by two factors - one is that people\n\nare treating gold as some sort of inflation hedge in this\n\nenvironment,\" said Julius Baer analyst Carsten Menke.\n\n\"The second and the most important factor is the increase in\n\ngeopolitical tensions, (with) uncertainties related to this\n\nevent,\" he added. \"People are seeking shelter in the gold\n\nmarket.\"\n\nYemen's Iran-aligned Houthi group claimed responsibility for\n\nthe attack on two plants at the heart of Saudi Arabia's oil\n\nindustry on Saturday, which knocked out more than half the\n\nkingdom's output. U.S. President Donald Trump on Sunday said the United States\n\nwas \"locked and loaded\" for a potential response to the attack\n\nafter a senior official in his administration said Iran was to\n\nblame. Gold is often used as a safe store of value during times of\n\npolitical and financial uncertainty.\n\nWhile the attack sparked the biggest one-day rise in gold\n\nprices in nearly two weeks, an easing of tensions may lead to a\n\nswift retracement, analysts said.\n\n\"Near-term support for bullion sits around the psychological\n\n$1,500,\" MKS PAMP said in a note. \"However the fluid nature of\n\nthe Saudi Arabia situation may see gold test back toward $1,480\n\n- $1,485 should there be no further escalation.\"\n\nThe attacks sparked supply fears in the oil market, sending\n\ncrude prices to four-month highs, while weak economic data from\n\nChina sapped investors' appetite for riskier assets. MKTS/GLOB\n\nCentral banks globally are facing increasing pressure to\n\ndole out monetary support for flagging economies as the\n\nU.S.-China trade dispute hurts trade and business sentiment.\n\nInvestors are looking forward to the outcome of the U.S.\n\nFederal Reserve and Bank of Japan's policy meetings on\n\nWednesday, for signals on their future policy path. FEDWATCH\n\nGold tends to appreciate on expectations of lower interest\n\nrates, which reduce the opportunity cost of holding non-yielding\n\nbullion.\n\nElsewhere, silver jumped 2.4% to $17.85 an ounce and\n\nplatinum XPT= gained 0.9% to $956.70. Palladium XPD= climbed\n\n1.2% to a record high of $1,626.81 per ounce.\n\n\n\n", "description": "PRECIOUS-Gold climbs 1% as attacks on Saudi facilities spur demand", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/indicatornews_3_800x533_L_1412601605.jpg", "published_at": "2019-09-16"}