{"pub": "marketwatch", "url": "https://marketwatch.com/articles/steve-mnuchin-a-50-year-treasury-is-in-demand-51568324501", "downloaded_at": "2019-09-13 11:14:46.683760+00:00", "title": "Podcast: Smile Direct Drops 28%, and Two More Numbers to Know", "language": "en", "text": "Three numbers to start your day:\n\n—by the European Central Bank on Thursday. The central bank also plans to buy $22 billion of bonds every month. It’s all part of a new economic stimulus plan, which the ECB says, will run “for as long as necessary.”\n\nThe new program is more aggressive than expected. It’s aimed at reviving the sluggish growth in the economies that share the euro currency. But it also means that the eurozone will have negative interest rates for some time to come. And it raises questions about what else the central bank could do if economic conditions deteriorate further.\n\nThe U.S. Government Pays $1.6 Billion in Interest on its Debt\n\n—a day. Those borrowing costs have led the Treasury Department to consider issuing a 50-year Treasury bond next year, Treasury Secretary Steven Mnuchin told CNBC.\n\nIn 2017, when the U.S. Treasury Department looked into ultra-long bonds, Wall Street was opposed to the idea.\n\nWill investors be more receptive this time around? The Treasury Secretary says “We think there is some demand for it.”\n\nShares of Smile Direct Club Fell 28% on Thursday\n\n—their first day of trading. SmileDirect sells clear plastic teeth aligners directly to consumers.\n\nIt’s the first American company since at least 2008 to raise more than $1 billion and price its IPO above the range and still tumble on its stock market debut. That’saccording to Bloomberg.\n\nAnother initial public offering is about to make its debut. Shares of the cyber security company Cloudflare will begin trading on the New York Stock Exchange later today.\n\nNumbers by Barron’s is our daily podcast. Find out more here.\n\nWrite to host Jeffrey Cane at jeffrey.cane@barrons.com", "description": "Negative interest rates are here to stay in the Eurozone. Why Treasury Secretary Mnuchin is considering a 50-year Treasury bond. And SmileDirect tumbles 28% on first day of trading.", "authors": [], "top_image": "https://asset.barrons.com/public/resources/images/ON-DD596_Pod_we_OR_20190802122832.jpg", "published_at": "2019-09-13"}