{"pub": "afr", "url": "https://afr.com/companies/sport/everest-and-caulfield-cup-give-top-jockeys-tough-choices-20191018-p531uz", "downloaded_at": "2019-10-18 02:03:35.068160+00:00", "title": "Everest and Caulfield Cup give top jockeys tough choices", "language": "en", "text": "James McDonald, who will ride exciting Perth sprinter Arcadia Queen in The Everest, admits he’s torn.\n\n“Ideally I’d love to be riding in both places,” he says. “The Caulfield Cup is one of the majors and The Everest is a great race, so it was a big decision to make. But I wanted to ride Arcadia Queen.”\n\nJames McDonald pilots exciting mare Arcadia Queen to an easy win last month. Getty\n\nOne of the beneficiaries of this clash is Melbourne-based jockey Michael Walker. The mercurial New Zealander has picked up the ride on Caulfield Cup favourite Finche in place of regular jockey Kerrin McEvoy, who will ride Redzel in The Everest.\n\nMcEvoy partnered Redzel to win the first two editions of The Everest, and it’s the fifth favourite for the race again this year, so it’s not hard to understand McEvoy’s decision. And Walker is only keeping the saddle warm, with McEvoy confirmed to ride the import in the Melbourne Cup.\n\nTalking to AFR Weekend at track work at Caulfield this week, Walker says the Everest puts Sydney’s jockeys in a particular bind.\n\n“For the Melbourne guys there are only a select few horses that will go for an Everest, so that makes it a little bit easier. But for the Sydney jockeys, you can see how many horses have come down from there for the Caulfield Cup,” he says.\n\n“I’d hate to be in their position – I think it’s a lot harder for them.”\n\nAdvertisement\n\nWalker says top jockeys will generally try to retain the rides on the best horses, and it is the programs of these horses that decide where a jockey will ride.\n\n“I can guarantee you the top jockeys know where their horses are going and how they’re going,” he says.\n\n“If you’ve got the right horse to win a million-dollar race, you’ll travel.”\n\nThe Everest isn’t the only clash Racing NSW has created as it has pushed aggressively to shake Melbourne’s position as the country’s racing capital.\n\nClashes far from ideal\n\nThe Golden Eagle, a new $7.5 million race to be run for the first time this year at Randwick over 1600 metres, will also give jockeys a headache on November 2, when Flemington plays host to the prestigious Derby Day, with its four group ones.\n\nMark Guest, who manages McDonald, says the clashes are far from ideal for the industry and many of its participants. An easy solution, he says, would be to hold one meeting on Saturday and one on Sunday, giving both the chance to attract maximum attention – and all of the best riders.\n\n“Time will tell if we made the right decision,” he says of McDonald’s decision to ride in The Everest. “But we shouldn’t have a decision to make.”\n\nAdvertisement\n\nChampion jockey Damien Oliver will stay in Melbourne on Saturday to take the ride on Mustajeer, the fourth favourite in the Caulfield Cup.\n\nNow in the twilight of his career, but still riding as well as anyone, Oliver takes a strategic view of the clashes.\n\n“It spreads the riding ranks a little thinner, so it gives more people more opportunities,” he says.\n\n“The participants are the winners in it, whether they’re in Sydney or Melbourne. It’s an extraordinary amount of money that The Everest is offering, but there’s fantastic prizemoney on offer here.”", "description": "Australia's top jockeys are torn between prizemoney and prestige on one of the biggest weekends on the racing calendar.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.3531%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/aef1b932e00900632ba3e8aef220dbd4ac16126d", "published_at": "2019-10-18"}