{"pub": "fox", "url": "https://foxnews.com/entertainment/olivia-newton-john-cancer-third-time", "downloaded_at": "2019-09-28 01:17:24.688241+00:00", "title": "Olivia Newton-John opens up about battling cancer for the third time: ‘I have much to live for’", "language": "en", "text": "Olivia Newton-John is vowing to stay strong during her third battle with breast cancer.\n\nThe 71-year-old is opening up about being faced again with the devastating disease once more to “CBS This Morning” co-host Gayle King in an interviewing airing on Sunday.\n\nOLIVIA NEWTON-JOHN SHARES HER MINDSET AMID CANCER BATTLE: 'I'M STRONG'\n\n“I’m happy,” the singer/actress reflected on her life today. “I’m lucky. I’m grateful. I have much to live for. And I intend to keep on living it.”\n\nBack in March of this year, People magazine reported the Australian star was in the midst of treating stage 4 breast cancer. She was first diagnosed in 1992 and then secretly overcame a bout in 2013. Her most recent diagnosis came in 2017.\n\n“‘Why me?’ has never been a part of it,” said Newton-John. “But I never felt victimized. I never felt, ‘Why not?’ Maybe deep down I knew there was a reason or a purpose for it, or maybe I needed to create one to make it OK for myself. Because, again, it’s a decision: ‘How am I gonna deal with it?’”\n\nJOHN TRAVOLTA PRAISES ‘GREASE’ CO-STAR OLIVIA NEWTON-JOHN AMID HER CANCER BATTLE: ‘I’M VERY PROUD OF HER’\n\nDespite fighting cancer for the third time, Newton-John said she doesn’t dwell on the details concerning her prognosis.\n\n“In my opinion, if they give you a percentage — you know, ‘These many women get this and they live this long,’ you can create that and make it happen,” she explained. “I think I know what the statistics are. But I put them away: I’m gonna live longer than that. I’ve made that decision. And I don’t buy into the statistics, ‘cause I think they can make you really nervous.”\n\nKing, 64, also asked Newton-John if she ever thought about death.\n\nSNOOP DOGG'S 10-DAY OLD GRANDSON DIES\n\n“You have to think about it,” said Newton-John. “I mean, it’s part of life. And, of course, if you have a cancer diagnosis, your death is kind of there. Whereas most people, we don’t have a clue when we’re gonna die. And I could die tomorrow; a tree could fall on me. So, it’s just that we have that knowledge that we could die. But I’m not — I try not to think about it too much.”\n\n“I try to meditate and be peaceful about it, and know that everyone I love is there, so there’s something to look forward to,” she added.\n\nOLIVIA NEWTON-JOHN REVEALS SHE'S BATTLING CANCER FOR THIRD TIME\n\nIn November, California-based Julien’s Auctions will be putting numerous pieces from Newton-John’s personal clothing collection up for bid, including the iconic leather jacket and skin-tight pants she wore at the finale of the hit 1978 film “Grease.”\n\nThe clothes, along with a costume her character wrote in “Xanadu” and outfits she performed in while promoting her “Physical” tour in 1982 (among several other pieces from her wardrobe), will hit the auction block during the Icons & Idols “two-day music extravaganza” on Nov. 1 and Nov. 2 at the Standard Oil Building in Los Angeles.\n\nA portion of the proceeds from the auction will benefit the Olivia Newton-John Cancer Centre near her hometown of Melbourne, Australia.\n\nOLIVIA NEWTON-JOHN RECALLS TRANSFORMING INTO ‘BAD SANDY’ IN ‘GREASE,’ GIVES FANS CANCER BATTLE UPDATE\n\nBack in August of this year, Newton-John told Fox News she has been optimistic about her cancer fight.\n\n“I’m doing great,” she said at the time. “Last year in September I was bedbound. I was lucky enough to be in my own hospital in Melbourne. I spent my 70th birthday at my wellness center. It couldn’t have been more wonderful. My nieces and nephews were there, my best friend was there. It was really quite beautiful. And I’m so proud of the center so it’s a great honor to raise funds for it.”\n\nNewton-John recalled how she was in “incredible pain” before learning of her diagnosis.\n\n“I thought it was sciatic for a very long time,” she admitted. “It got much, much worse and I just couldn’t walk. I had a break, which I discovered through some X-rays. But pain. Pain really because it’s in my bones. That’s how I knew.”\n\nOLIVIA NEWTON-JOHN DISMISSES REPORTS SHE'S NEAR DEATH FROM CANCER\n\n“I don’t call it remission — I just say I’m living with it,” continued Newton-John about her health status. “I’m living with it very well. To think that you could get rid of every single cell is not really reality at this point. But I’m feeling great. Things are shrinking. I’m taking a lot of herbs because my husband worked in the Amazon and he’s incredibly knowledgeable.\n\n“And I use cannabis extracts, which has helped me incredibly. They’ve helped me ween off morphine, which I was using for my [cancer-induced pelvis fracture] because I was in a lot of pain. Cannabis will not kill you but these opiates will. I’m an advocate of it, very much so.”", "description": "Olivia Newton-John is vowing to stay strong during her third battle with breast cancer.", "authors": ["Stephanie Nolasco"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2017/05/31/694940094001_5454234659001_5454225916001-vs.jpg", "published_at": "2019-09-27"}