{"pub": "hotair", "url": "https://hotair.com/archives/jazz-shaw/2019/10/07/nyc-protections-illegal-aliens", "downloaded_at": "2019-10-07 23:33:15.223217+00:00", "title": "More NYC protections for illegal aliens", "language": "en", "text": "You may recall that New York City recently implemented new rules put forward by the Commission on Human Rights making it illegal to call an illegal alien an illegal alien. (With hefty fines of up to a quarter-million dollars for those who disobey.) As it turns out, however, that was only the opening act. The Hill has been digging into the new rules and found even more that should leave most sane people with their jaws hanging open.\n\nMany of these apply to employers, making sure that they don’t make it too difficult for illegals to get a job (in violation of federal law). And if you do anything that might help ICE agents identify and detain an illegal alien, you’ll probably be in hot water as well.\n\nThe NYC Commission on Human Rights (Commission) has announced new guidelines for New York’s Human Rights Law that will make it easier for undocumented aliens to live and work in New York without being detected by immigration authorities. The guidelines designate conduct that facilitates immigration enforcement or makes it harder for undocumented aliens to remain in New York as “unlawful discrimination,” and the Human Rights Law has steep penalties to deter New Yorkers from doing these things… But the guidelines in fact go much further. They violate the constitutional rights of lawful New York residents in order to protect undocumented alien residents. What’s more, making it easier for undocumented aliens to live and work in New York illegally is prohibited by a federal harboring provision that makes providing such assistance a criminal offense.\n\nI used to believe that marijuana laws were the only cases where state (or municipal) laws conflicted wildly with federal laws, but we may have found another example. The laws impacting employers appear to be some of the most egregious.\n\nFor example, if someone comes to your office to apply for a job and brings the correct number of identifying documents accepted by the city (including a utility bill or bank statement), you are forbidden from asking any additional questions about their citizenship status or probing further. It turns out that E-Verify isn’t mandatory in New York State (big surprise), but employers aren’t forbidden to use it. But if your new applicant has turned over the documents and you run them through E-Verify just to be on the safe side, you might wind up running afoul of these new rules.\n\nJust for the record, illegal aliens in New York City are allowed to get a city identification card and can easily get a utility bill or other accepted documents. But it’s also a felony to hire illegals. Fun times, eh?\n\nIf you happen to be a landlord or a person selling their home in the Big Apple, be careful. You can’t refuse to rent or sell based on the prospective renter or buyer being in the country illegally. That will lead to crippling fines as well.\n\nAnd don’t think about calling ICE if you find out someone is an illegal alien. If you do, you might wind up being guilty of “discriminatory behavior” and find yourself in front of a judge. What the city is ignoring here is the fact that following many of these new rules will put actual citizens in jeopardy of being in violation of federal laws against harboring illegal aliens or aiding and abetting them. Honestly, I can’t wait for the lawsuits to start flying after the first time somebody is tagged with a massive fine under these new rules.", "description": "Good grief", "authors": ["Jazz Shaw", "John Sexton", "Ed Morrissey"], "top_image": "https://hotair.com/wp/wp-content/uploads/2018/10/MayorDeBlasio.jpg", "published_at": "2019-10-07"}