{"pub": "foxbusiness", "url": "https://foxbusiness.com/media/seinfeld-reruns-heads-back-to-cable", "downloaded_at": "2019-09-23 17:24:05.426670+00:00", "title": "'Seinfeld' returns courtesy of Viacom, Sony Television", "language": "en", "text": "It turns out that \"Seinfeld\" is the master of its own domain in the cable world and will be making a return with Viacom.\n\nContinue Reading Below\n\nThe multimedia conglomerate announced over the weekend that it acquired exclusive rights for the show from Sony Television, which includes its 180 episode catalog. Starting in Oct. 2021, \"Seinfeld\" reruns will air on Viacom’s entertainment channels, including Comedy Central, Paramount Network and TV Land.\n\nTicker Security Last Change %Chg VIA VIACOM INC. 26.84 +0.22 +0.81% SNE SONY 59.20 +0.07 +0.13%\n\nFans can also watch the iconic series with authenticated video on-demand services that are approved by Viacom.\n\nThe deal was inked as a joint venture “for an undisclosed sum and a loaf of marble rye after a spirited Festivus feats of strength competition\" the companies jested.\n\nAdvertisement\n\n“We’re extremely proud to bring this little-known series to our viewers. With the right programming and promotion, we believe we’ll finally get \"Seinfeld\" the recognition it truly deserves, as merely the greatest sitcom of all-time,” said Kent Alterman, President of Comedy Central, Paramount Network, TV Land and Vandelay Industries, in a statement.\n\nExecutives from Sony also demonstrated excitement about the move.\n\nJohn Weiser, President, First Run Television for Sony Pictures Television said, “'Seinfeld' airing on Comedy Central and the Viacom networks brings together the greatest comedy of all time, with the best brands in cable.”\n\n“'Seinfeld' airing on Comedy Central and the Viacom networks brings together the greatest comedy of all time, with the best brands in cable. This was a tremendous team effort and we are delighted to be working with the first class executives at Viacom who are experts in programming and promotion. For a show about ‘Nothing,’ this is really ‘Something!’” Sony Pictures Television’s President John Weiser.\n\nTicker Security Last Change %Chg NFLX NETFLIX INC. 263.02 -7.73 -2.85%\n\nThis acquisition comes shortly after \"Seinfeld’s\" 30th anniversary this past July and six days after Netflix announced it acquired the streaming rights to the show as well.\n\nCLICK TO READ MORE ON FOX BUSINESS", "description": "The hit show 'Seinfeld' is making a comeback.", "authors": ["Cortney Moore"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/seinfeld-Getty-001.jpg?ve=1&tl=1", "published_at": "2019-09-22"}