{"pub": "financialpost", "url": "https://o.canada.com/travel/a-visit-to-grise-fiord-canadas-most-northerly-community", "downloaded_at": "2019-10-10 15:09:19.498056+00:00", "title": "A visit to Grise Fiord, Canada's most northerly community", "language": "en", "text": "Canada’s most northerly community answers to the names Aujuittuq or Grise Fiord. The first is an Inuit name that means “the place that never thaws out” in Inuktitut. The second comes from Norwegian explorer Otto Sverdrup and means “pig fiord” for the grunting sound that walrus herds make and the fact this spot is tucked between cliffs at the mouth of a gorgeous fiord.\n\nI’ll use Grise Fiord to match what it says at the post office counter where I mailed a postcard. It’s also the name that’s emblazoned on the hamlet’s logo along with a bronze muskox — not a walrus — standing on snow beneath the mountains in the sun.\n\nA beauty day\n\n“You guys came on a perfect day,” says Jessie Ningiuk. “It’s not sunny, but it’s good.”\n\nIt’s actually a perfectly reasonable zero, give or take a few degrees, the September morning we visit with Adventure Canada while cruising the Northwest Passage through Nunavut. Fun fact: Not only are Grise Fiordians the northernest of northerners, the Inuit hamlet is said by some to be one of the coldest communities in the world.\n\n“I don’t think so,” says a skeptical Ningiuk. “The mountain blocks the windchill. It’s colder in places that are flat.”\n\nEven September is chilly\n\nThe tight-knit community, on the southern side of Ellesmere Island at Jones Sound, boasts stunning mountains that are perfect for sledding and for “one crazy guy who snowboards” (look it up on YouTube). But experts have also calculated that the average yearly temperature is minus 16.5 Celsius and that puts this place in the running for coldest community honours.\n\n“Yeah, that’s possible,” concedes Ningiuk, who was cold enough to wear ski gloves and a down jacket with his ball cap and sneakers. He figures it must drop to minus 50 or minus 60 before everything shuts down. I’m Canadian enough to know the horror of minus 40, but anything beyond that is daunting.\n\n135 people, one postal counter\n\nSpeaking of people, Grise Fiord has 129 of them according to the last Canadian census, or 135 of them if you ask locals for the current count. With our four-hour visit, that number temporarily climbs north of 300 although we work hard to spread ourselves out.\n\nIt is a strange and fascinating thing when cruise ships — even small ones like ours — come calling. Nunavut has about 39,000 citizens scattered across 26 communities that aren’t linked by roads, so what precious few visitors there are each year must arrive by plane or ship, like our 198-passenger Ocean Endeavour.\n\nLocal wheels\n\nAdventure Canada expedition leader Jason Edmunds always works with communities to develop a plan that’s about “connections and what they want to show us” instead of just what we might want to see. The company only goes where it is welcome.\n\nAn Inuk from Labrador, Edmunds loves showcasing Inuit Nunangat, the Inuit homeland in Canada that encompasses autonomous land claims regions in Nunavut, Nunavik (Quebec), Nunatsiavut (Labrador) and the Inuvialuit Settlement Region (Northwest Territories and Yukon). My Out of the Northwest Passage cruise zig-zags through Canada’s youngest territory before crossing Baffin Bay to Greenland, a self-governing Danish territory and Inuit stronghold.\n\nStrict protocols\n\n“We think there’s an opportunity for all of us arriving with open minds and open hearts to actually be changed,” Edmunds says at our first briefing. He urges us to always be respectful, never point cameras into homes, never pat sled dogs, always ask permission before taking photos, and to talk with people and not about people.\n\nWhile expedition cruises revolve around taking Zodiacs to see wildlife, historical sites and natural wonders, there are always community visits. On the Nunavut leg of our 17-day journey we explore Kugluktuk, Nunavut’s most westerly community and the place that inspired the film The Grizzlies, and Gjoa Haven, the hamlet on King William Island that calls itself the “Land of the Franklin Expedition” because it’s close to the wrecks of Sir John Franklin’s HMS Erebus and HMS Terror. These larger communities, with about 1,500 people each, welcome us with elaborate drum dances, square dances, heritage centre visits and art sales.\n\nA welcome ceremony\n\nGrise Fiord is challenging because of its tiny population and recent death of a beloved elder, Peter Flaherty. His funeral keeps getting delayed because it’s too windy for planes to land. At the same time, he loved greeting the cruise ships and the community has been looking forward to our visit and so they ask us to kill time for a day and come a day late.\n\nWe are the third, and likely final, cruise ship to pass by during the short, ice-free summer.\n\nBut the funeral is rescheduled once again for just after our morning visit. “We had some plans for a cultural show. I don’t see anybody here for that,” host Jimmy Qaapik, an Anglican deacon, apologizes during a welcome in the community hall. “I’m not sure what we are going to do.” He gamely answers questions — everything from how to live with permafrost (nothing is built underground) and the size of the school (about 35 students), to how mail arrives (twice a week by plane) and when the sea ice comes (October to July).\n\nThe funeral, explains Qaapik, will take place in the room we will soon vacate. “I’m sorry we don’t have enough chairs for everybody, but I think we’re a little bit over the limit of what we should have in the building. You have doubled the town.” He gets another big laugh when answering where the teachers come from: “From the south,” he says, before adding, “everywhere is south of here.”\n\nSouvenir shopping\n\nFor Nunavut communities, we are advised to bring cash for soapstone sculptures and other art sold in gift shops and by people on the street. We freely browse the Northern or Co-op stores for snacks. But in Grise Fiord, we are asked to mail our postcards and buy only souvenirs at the Co-op as the community is waiting for the Sealift, a cargo ship that comes just once or twice a year with provisions.\n\nA simple airstrip\n\nHow much can you really learn about a community in four hours? A lot, if you pay attention.\n\nWhen we land on the shore in Zodiacs, we break into groups for guided walking tours. Ningiuk points out the RCMP and game warden offices, school, health centre, year’s supply of fuel, truck that delivers water to the 50 homes, and the unpaved airstrip. “It’s a pretty sketchy runway,” he admits, “but it works.”\n\nBountiful land\n\nI love a bright yellow Inuktitut and English sign that says “Warning: Polar bears & musk-ox may be in area.” It’s near a picnic area with four colourful tables and a haunting monument. A dozen polar bears might wander into town every year, explains Ningiuk, but the muskoxen haven’t been seen lately and neither have the caribou. We do not speak of walrus.\n\nNingiuk plucks a handful of brown, braided Arctic heather leaves from the ground, explaining how they work as firewood “to cook seal or boil tea.” He reports that their local glaciers are receding and that one mountain’s snow cap is already gone. As we wait our turn to see the monument, he casually shares a frightening cell phone video of a wolf stalking him while he dogsledded once without a gun or knife to defend himself.\n\nSobering monument\n\nThe late Peter Flaherty’s brother Johnny is at the monument and asks me to take his picture with his daughter and granddaughter who are visiting from Iqaluit. He mentions that his biological grandfather was Robert Flaherty, the director behind the famed 1922, black-and-white, silent docudrama Nanook of the North.\n\nThe 2010 monument, carved by Looty and Matthew Pijamini from a granite boulder, shows a distraught Inuit mother clutching her daughter. A plaque reads: “In memory of Inuit landed here in 1953 & 1955, and those who came after. They came to these desolate shores to pursue the Government’s promise of a more prosperous life. They endured and overcame great hardship, and dedicated their lives to Canada’s sovereignty in these lands and waters.”\n\nA compelling story\n\nI am embarrassed to know so little of this Cold War-era relocation of Inuit, the broken promise to let them return home after two years if they wished, and their long fight for a federal apology and compensation. Larry Audlaluk, one of the remaining “exiles,” pops into the community hall to talk to us after greeting the plane that finally arrives.\n\nHe was just a boy when his family was brought to this area from Kuujjuaq, Quebec, but he heard the stories of the hardships they survived in new terrain with different animals, no houses and barely any basic food supplies. His family eventually returned to what is now Nunavik but he considers Grise Fiord home. He asks us to relay that his community should be treated like “regular Canadians” and that the hamlet “has nothing.”\n\n“I always say they built this country from east to west — they never finished going up here,” Audlaluk says matter-of-factly. “Even to this day, they haven’t finished the job. I can say that — I’m a Canadian taxpayer.”\n\nA one-bridge town\n\nThe community hall welcome wraps up with thank-you songs from two of our musicians, Marshall Dane and expedition host David Newland. “The last Zodiac (back to the ship) is at 12:30,” Qaapik announces. “It’s 11:42. Lots of time. No rush. You’re more than welcome to walk around at your leisure.”\n\nYou can accomplish a lot in 48 minutes.\n\nI pick up a Grise Fiord pin and a calendar full of photos of people enjoying the outdoors and gathering inside for community feasts. Then I wander over the one bridge in town, past barking sled dogs, to Audlaluk’s house to admire the Canadian flag he flies as a show of patriotism and a reminder of the time Canada treated the Inuit as “human flagpoles.” Ningiuk happens by in his truck and offers a lift to the nearby beach. We chat about his love of country music and mine of outlaw country.\n\nI had only the smallest taste of tiny Grise Fiord, but hope to one day return to “the place that never thaws out” — preferably in winter — to search for majestic muskox and grunting walrus.", "description": "It doesn't get more northern than the hamlet of Grise Fiord in Nunavut, where 135 people embrace one of the coldest climates in the world.", "authors": ["Updated", "October"], "top_image": "https://postmediacanadadotcom.files.wordpress.com/2019/09/jessie-ningiuk-at-warning-sign-credit-jennifer-bain-e1569246335468.jpeg", "published_at": "2019-10-10"}