{"pub": "yahoo", "url": "https://news.yahoo.com/ap-fact-check-trump-misfires-205925734.html", "downloaded_at": "2019-10-09 19:06:06.121311+00:00", "title": "AP FACT CHECK: Trump misfires on economy, Syria, impeachment", "language": "en", "text": "President Donald Trump participates in a briefing with senior military leaders in the Cabinet Room at the White House in Washington, Monday, Oct. 7, 2019. (AP Photo/Carolyn Kaster)\n\nWASHINGTON (AP) — Battling an impeachment inquiry, President Donald Trump is misrepresenting facts as he blasts his investigators and seeks to highlight the administration's efforts to fulfill campaign pledges on the economy and war in the Middle East .\n\nIn tweets and public remarks, the president minimized the risk of withdrawing U.S. support for Kurdish fighters in Syria, suggesting that most of the foreign fighters captured in the U.S.-led campaign against the Islamic State group and being held by the Kurds are from European countries that can reclaim them. That's incorrect; only a small portion of the fighters are from Europe.\n\nTrump made a groundless assertion that the Democratic leaders heading the impeachment inquiry , House Speaker Nancy Pelosi and Rep. Adam Schiff, should be impeached, not him. There are no provisions in the Constitution for the impeachment of lawmakers and no grounds for doing so based on what he alleges.\n\nThe president and his GOP allies also exaggerated median income growth for U.S. households as well as the U.S. investments made by Japanese automakers while unveiling a limited trade agreement with Japan. Trump said that Japanese companies are building many car plants in the U.S., which is not true.\n\nA look at the claims:\n\nSYRIA and TURKEY\n\nTRUMP: \"So many people conveniently forget that Turkey is a big trading partner of the United States, in fact they make the structural steel frame for our F-35 Fighter Jet.\" — tweet Tuesday.\n\nTHE FACTS: Actually, Turkey won't be providing the steel for U.S. F-35 fighter jets much longer.\n\nThe Trump administration removed Turkey from the F-35 program in July because the Turks refused to cancel the purchase of a Russian S-400 air defense system that is incompatible with NATO forces. At the time, the White House said the S-400 would compromise the F-35 program and aid Russian intelligence.\n\nAs part of that process, the U.S. will stop using any Turkish supplies and parts by March.\n\n___\n\nTRUMP: \"We quickly defeated 100% of the ISIS Caliphate, ...including capturing thousands of ISIS fighters, mostly from Europe. But Europe did not want them back, they said you keep them USA!\" — tweet Monday.\n\nTHE FACTS: The foreign fighters captured are not \"mostly\" from Europe.\n\nThe U.S.-backed Kurdish forces have custody of thousands of captured Islamic State militants. They include about 2,500 highly dangerous foreign fighters from Europe and elsewhere whose native countries have been reluctant to take them back. An additional 10,000 or so captured fighters are from Syria and Iraq.\n\nTrump has said it will now be up to countries in the region to decide what to do with captured fighters, and he warned of retribution in response to any future attacks.\n\n___\n\nIMPEACHMENT\n\nTRUMP: \"Adam should be Impeached!\" — tweet Tuesday.\n\nTRUMP: \"Nancy Pelosi knew of all of the many Shifty Adam Schiff lies and massive frauds perpetrated upon Congress and the American people, in the form of a fraudulent speech ...This makes Nervous Nancy every bit as guilty as Liddle' Adam Schiff for High Crimes and Misdemeanors ... I guess that means that they, along with all of those that evilly 'Colluded' with them, must all be immediately Impeached!\" — tweet Sunday.\n\nTHE FACTS: There's no danger that either Schiff or Pelosi, who last month launched impeachment proceedings against Trump, will be impeached themselves. That's because House members cannot be impeached under the Constitution.\n\nThe House does have the power to expel one of its members by a two-thirds vote, but there are little grounds for it based on what Trump alleges.\n\nTrump is overstating Schiff's exaggerations, which the president describes as \"lies and massive frauds.\" The California Democrat, in what he said was a parody during a committee hearing last month, was mocking the president's pleas in his July call to Ukrainian President Volodymyr Zelenskiy, as Trump does with his critics routinely.\n\nSchiff made clear he was providing an account that was in \"essence\" what he believed Trump was conveying to Zelenskiy, when \"shorn of its rambling character.\"\n\nThe House has expelled only five of its own , based on charges of members supporting the Confederacy during the Civil War or bribery and corruption.\n\n___\n\nECONOMY\n\nRONNA MCDANIEL, Republican National Committee chair: \"New data is out on median income growth: Under Barack Obama, incomes rose $11 a month. Under @realDonaldTrump, incomes are rising at $161 a month. That's huge!\" — tweet Monday, retweeted by Trump.", "description": "Battling an impeachment inquiry, President Donald Trump is misrepresenting facts as he blasts his investigators and seeks to highlight the administration's efforts to fulfill campaign pledges on the economy and war in the Middle East .  In tweets and public remarks, the president minimized the risk", "authors": ["Hope Yen", "Tom Krisher", "Josh Boak"], "top_image": "https://s.yimg.com/uu/api/res/1.2/O4XS.wJ3yx4Ph0VbqvzzBw--~B/aD00MTIxO3c9NjE4MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/e1b28ca0004ab5e48c7c0703893e7f9b", "published_at": "2019-10-08"}