{"pub": "hotair", "url": "https://hotair.com/archives/ed-morrissey/2019/09/30/stephanopoulos-schiff-trump-said-bad-make-dialogue", "downloaded_at": "2019-10-01 00:11:14.857697+00:00", "title": "Stephanopoulos to Schiff: If what Trump said was so bad, why make up dialogue?", "language": "en", "text": "Kudos to George Stephanopoulos for asking the obvious question after last week’s stunt at the House Intelligence Committee — although Adam Schiff seemed surprised by it. “If the facts are as damning as you say,” ABC’s This Week host asked, “why make up dialog for dramatic effect, even if it’s a parody, as you say?”\n\nSchiff never gets around to actually answering that question, nor does he have one for another of Stephanopoulos’ questions (via Twitchy):\n\nABC’s George Stephanopoulos confronts Adam Schiff for “making up” President Trump’s phone call pic.twitter.com/JT0j5clYnr — Steve Guest (@SteveGuest) September 29, 2019\n\nSTEPHANOPOULOS: You have been criticized by the president and others for comments you made in your opening statement at the hearing on Thursday. I want to show a bit of it right here. SCHIFF: I’m going to say this only seven times so you better listen good. I want you to make up dirt on my political opponent, understand? Lots of it. This is in sum and character what the president was trying to communicate. STEPHANOPOULOS: That was you making up dialogue, putting it in the president’s mouth. If the facts are as damning as you say, why make up dialog for dramatic effect, even if it’s a parody, as you say? SCHIFF: Well, George, you’re right the call speaks for itself. And it is plenty damning, but let’s not pretend that this is really what the president is upset with me about. I can tell you exactly why the president is furious with me, and that is because when I learned that a whistle-blower had filed a complaint and urgent complaint that was being withheld from congress, and no one knew about this yet, I went public to demand that we get that complaint. I scheduled a hearing with the acting director to force the director to come in as I said at the time to explain to the American people why he was the first director to withhold a complaint from congress. That had the effect of forcing the White House to produce that complaint, which I then made public. That also had the effect of forcing them to release that call record. That’s what the president is furious with me about. The president believes that it is his god-given right to shake down foreign leaders for help in his re-election, and he should not be encumbered by the public finding out about it. That’s what has incensed the president. And I am willing to take the brunt of that. And I have to say once again how grateful I am to the courage of the whistle-blower. All I did was expose that complaint. The whistle-blower — had the whistle-blower not come forward, none of us would have known of the corrupt conduct the president of the United States was engaged in.\n\nNone of this answers Stephanopoulos’ question. If the transcript really showed all of what Schiff claims, why not just quote from it? Schiff could even have done a dramatic reading of it to highlight all of the examples of “shaking down” Volodymyr Zelensky for help in his re-election. Schiff could have just offered a couple of quid pro quo quotes.\n\nInstead, we got parody … the precise thing into which is what Schiff has transformed himself over the past two years. It would be a lot easier to take anything Schiff says seriously if he hadn’t destroyed his credibility by claiming for two years that he’d seen objective evidence of Trump colluding with Russian intelligence, only to have Robert Mueller confirm that no such evidence exists. This is a case of derangement, and Schiff just made it even more public in his opening statement — so much so that Stephanopoulos had no choice but to point out the obvious.\n\nIt’s not as if the Zelensky call isn’t troublesome and doesn’t raise questions about Rudy Giuliani’s activities in Ukraine. It does, however, make it clear that Schiff can’t conduct a credible investigation into it. It’s certainly not evidence for impeachment, except perhaps as parody.\n\nSpeaking of which, here’s the other question from Stephanopoulos that Schiff couldn’t quite answer:\n\nSTEPHANOPOULOS: Why has there not been a full House vote authorizing these impeachment proceedings? That happened in the case of Richard Nixon, it happened in the case of Bill Clinton and it happened with Andrew Johnson. SCHIFF: Well, look, I tried an impeachment case some years ago in the Senate involving a corrupt judge. As far as I recall, we didn’t have a vote in the — in the full House to formally — STEPHANOPOULOS: For the presidential impeachments you have. SCHIFF: Well, it’s certainly not necessary as a matter of constitutional law that we have a vote. All that’s necessary is that we conduct the impeachment inquiry in the manner that we’re doing, that we, through the Judiciary Committee, and Chairman Nadler has already done this, declared themselves to be pursuing an impeachment inquiry, and now this is the formal position of the entire caucus and our leadership. So, a vote isn’t required.\n\nStephanopoulos wasn’t asking about black-letter law; he was reminding Schiff of the seriousness of impeachment. The precedent for taking it seriously is to have the full House vote first on whether it is serious, not have two committee chairs go on a flier for their own purposes. Maybe at some point, Schiff and Nadler will just tell us this was all parody.", "description": "\"Why has there not been a full House vote authorizing these impeachment proceedings?\"", "authors": ["Ed Morrissey", "John Sexton", "Jazz Shaw"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/schiff-abc2.png", "published_at": "2019-09-30"}