{"pub": "dailymail", "url": "https://dailymail.co.uk/money/bills/article-1607475/Energy-bills-As-prices-rise-winter-really-worth-switching-best-fixed-rate-deals.html", "downloaded_at": "2019-10-05 08:00:04.106269+00:00", "title": "Best energy deals: How to switch supplier and find cheap deals", "language": "en", "text": "As the colder weather draws in, and the heating goes on, now's the time to make sure you are not paying over the odds for your gas and electricity.\n\nTo boot, typically the end of summer sees many of the previous year's fixed-rate deals come to an end. Those who fail to switch, are automatically moved onto their provider's more expensive deal, adding hundreds of pounds to annual bills.\n\nBut moving suppliers doesn't have to be a hassle. Below we explain how to search for the right deal for you, which providers offer the cheapest rates and what switching involves.\n\nIf you've never switched supplier, you could save a lot of money by moving to a different firm\n\nGolden rule - ditch the standard variable rate tariff\n\nStandard variable rate tariffs (SVT) are the out of contract deals your energy provider will move you to once your fixed deal ends.\n\nPeople who have been on an SVT for the last 12 months instead of switching to a cheap fixed deal could have over-paid by around £325 on average, according to uSwitch.\n\nPlus these are the tariffs which energy suppliers can hike costs on.\n\nThe Big Six's grip on the energy market is slowly beginning to loosen as more and more households ditch them for smaller suppliers.\n\nThese energy minnows now dominate the best-buy tables as well as often offering better service.\n\nAnd you might be surprised by how simple the switching process can actually be.\n\nThose on the hunt for a better deal have heaps of choice whether it is a long-term fix, variable rate or tariff from a smaller or green supplier you are looking for.\n\nAlthough the savings from switching are not quite as big as they were a few years ago switching should remain a key part of your personal finance maintenance.\n\nIf you are one of the millions of people who have NEVER switched (i.e. stuck with your original supplier), then you could also save a big chunk of cash.\n\nIf you want to cut straight to comparison, you can compare energy tariffs, with the choice of entering your own energy use, using our energy price comparison tool.\n\nThings to remember\n\nYour bill will show two costs - a fixed standing rate charge and the price per unit (or Kwh of energy used).\n\nOnline plans paid by direct debit are still the most competitively priced and if you have never switched, choosing one of these will save you the most money.\n\nYou can either opt for a variable rate tariff, where the price can go up or down or a fixed rate tariff which gives you a secure price on each unit of electricity you use for a set period.\n\nSavings: tricks & traps 1) Regular meter readings: Make sure you check every time you receive a bill, rather than relying on an estimate by your energy provider's estimate. 2) Change to online bills: You could save up to 10 per cent. 3) Avoid prepayment meters if you can, and swap to a billed meter. Even if you have to pay to get one, it's probably worth it for the savings you'll gain. 4) If you're in financial trouble some companies offer special deals, which help ease any difficulties you might be facing. But don't just assume this will be the cheapest option - make sure you still do your homework. 5) Dual fuel (gas and electricity from the same supplier) is not always the cheapest option. 6) Monthly direct debit payments could save you 5 to 10 per cent as companies are more confident that customers won't default and earn interest on any overpayments. Check any extra payments are refunded at the end of the year. 7) Swot up on how to lower your energy use: This guide gives you a few top tips to help you save more money by cutting your gas and electricity use", "description": "Energy price tariffs are in a constant merry-go-round with suppliers constantly battling to pinch customers from each other. We show you how to win.", "authors": ["Emma Gunn", "Grace Gausden For This Is Money", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/06/21/15/15089304-0-image-a-12_1561128281324.jpg", "published_at": "2019-06-21"}