{"pub": "yahoo", "url": "https://finance.yahoo.com/news/amazon-uses-thirdparty-sellers-data-to-build-private-labels-145813238.html", "downloaded_at": "2019-09-27 16:31:55.391261+00:00", "title": "Revealed: How Amazon uses third-party seller data to build a private label juggernaut", "language": "en", "text": "Amazon’s hybrid model of being a retailer and a marketplace may have served its customers well. But the dual role has rattled third-party sellers on its platform and drawn antitrust scrutiny in the U.S. and Europe.\n\nOne of Amazon’s businesses that regulators are looking into is the e-commerce giant's expanding private-label products, as third-party sellers — who are essentially business partners of Amazon's and generating over half of its sales — have long worried that Amazon uses their own sales data to compete against them. Two former employees at Amazon revealed to Yahoo Finance that the team used information from third-party sellers to develop Amazon private label products, including AmazonBasics, one of its most successful private labels. They also raised questions about Amazon’s lax control over employees’ access to marketplace data.\n\nThe former employees say the internal data are much more sophisticated than the information available in the public domain, or any third-party tools built for sellers. Employees can view aggregated data such as search interest and also pull reports from Amazon’s data warehouse on specific products to help them decide what Amazon should make, according to those employees, who asked for anonymity because they have signed non-disclosure agreements or fear retribution from Amazon.\n\nBy putting search inquiries in the data warehouse, the employees said they were able to analyze various datasets from the marketplaces, including the list of top-selling and trending products in certain categories, pricing points, return data and reviews.\n\nAmazon Basics, a private label brand of Amazon providing low-cost, basic technology and other home products, has achieved major success. (Photo by Smith Collection/Gado/Getty Images) More\n\nOne former employee, who worked on building AmazonBasics, said they would use the metrics to decide on an “inspiration product,” then order it from the seller and try to reverse engineer it. They worked with the sourcing team, who are usually based in China, to find a manufacturer.\n\nIn a statement to Yahoo Finance, an Amazon spokesperson said the company has policies in place and specifically forbids employees from the above behavior. Amazon wouldn't confirm if employees who work on developing its private label products can look up third-party sellers’ data. In June, Amazon's CEO Worldwide Consumer Jeff Wilke said the company doesn't allow anyone to have access to individual sellers’ data in order to build a private-label product.\n\n“We train employees extensively on it, have technical controls in place, and audit compliance vigorously. Any employee in violation of this policy would face severe consequences,” the spokesperson said.\n\nWilke also said the data Amazon uses is “just the best-seller list” that is “fairly available to anybody. So the things that we end up making in private labels are the things that sell the most that are at the top of search results,” he said.\n\nIn a letter to the House Judiciary Committee in July, the company reiterated it prohibits the use of data related specifically to individual sellers in its private-label strategy. “Like other retailers, we use aggregated store data (e.g., total sales) and customer shopping behavior (e.g., search volume) to identify the categories and products with high customer demand over a given time period,” it wrote. Former employees said the use of data doesn’t target individual sellers—but they looked at specific products and categories.\n\n‘Free-for-all’ access to data\n\nThe team at Amazon who works to develop private labels falls under the retail team, which is a separate department from Amazon Marketplace. Two teams operate individually, with different management and financial goals. But they share the same access to the data warehouse, which makes it possible for the retail team to use the data from marketplace sellers to develop private labels, according to former employees.\n\nStory continues", "description": "Former Amazon employees confirm third-party sellers' concern on how their data are used. Regulators are taking a closer look.", "authors": ["Krystal Hu"], "top_image": "https://s.yimg.com/uu/api/res/1.2/EgHfYZPpH8noE28Ui8xv8Q--~B/aD05ODc7dz0yODQzO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/233c2340-e139-11e9-bbf3-107e9dedcaf2", "published_at": "2019-09-27"}