{"pub": "news24", "url": "https://news24.com/World/News/first-transgender-couple-married-in-cuba-20190719", "downloaded_at": "2019-10-19 11:30:06.041280+00:00", "title": "First transgender couple married in Cuba", "language": "en", "text": "A transgender couple married in Cuba this week, a first on the island nation where sexual minorities have long suffered discrimination.\n\nThe couple had to register their civil union according to the official genders on their identity documents, though.\n\n\"This legal act doesn't violate Cuban law because it's about two people whose legally registered gender is female and male, even though that's incoherent with the gender identities of Ramses and Dunia,\" said the state's national sex education centre (CENESEX,) which is run by Mariela Castro, an LGBT rights campaigner and the daughter of former president Raul Castro.\n\nRamses, a transgender man, and Dunia, a transgender woman, were married on Tuesday at Havana's San Francisco de Paula Marriage Palace, which is run by the justice ministry.\n\nThe couple had previously come across obstacles to their marriage plans but CENESEX gave them legal help, notably in explaining that there was no legal requirement to dress at the ceremony according to the gender on their identification documents.\n\nBoth individuals are awaiting gender reassignment surgery, which is free in Cuba.\n\nFollowing Fidel Castro's 1959 communist revolution, sexual minorities were stigmatised and homosexuals harassed, or even sent to \"re-education\" camps.\n\nThey found themselves marginalized and excluded from public employment, a policy for which Castro later apologised.\n\nThe wind has changed over the last decade, though, in large part driven by Mariela Castro.\n\nCuba's new constitution, ratified in April, bans discrimination based on gender and defines marriage as \"a social and legal institution\", and not just a \"union between a man and a woman\", as was the case before.\n\nThat has paved the way for reform to the Family Code over the next two years, which could see gay marriage legalised.\n\nGET THE NEWS at your fingertips and download the News24 app for Android here now. Get it for your iPhone here.\n\nKEEP UPDATED on the latest news by subscribing to our FREE newsletter.\n\n- FOLLOW News24 on Twitter", "description": "A transgender couple married in Cuba this week, a first on the island nation where sexual minorities have long suffered discrimination.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9006/37f0fc6e5534438bb0f2d12edd02e980.jpg", "published_at": "2019-07-19"}