{"pub": "yahoo", "url": "https://yahoo.com/entertainment/james-franco-sued-for-alleged-sexual-exploitation-a-look-at-the-accusations-against-him-002656202.html", "downloaded_at": "2019-10-05 12:38:35.883873+00:00", "title": "James Franco sued for alleged sexual exploitation: A timeline of the accusations against him", "language": "en", "text": "James Franco has been sued by two women who claim they were sexually exploited at his acting school. Sarah Tither-Kaplan and Toni Gaal, former students, allege in their lawsuit that Franco and his partners \"engaged in widespread inappropriate and sexually charged behavior\" towards female students at the now-closed Studio 4. A lawyer for the 41-year-old actor denied their accusations calling it a \"publicity-seeking lawsuit.\"\n\nThe lawsuit caps off a tumultuous few years for the Spring Breakers star, who slowly began to reemerge after sexual misconduct allegations were raised against him in 2018. Here is a timeline of the accusations:\n\nApril 2014\n\nFranco, then 35, admitted to hitting on a 17-year-old girl on Instagram. The actor's exchange with a Scottish teenager visiting New York went viral after she shared screenshots of their private conversation, in which she revealed her age. (\"You're single? What's the hotel? Should I rent a room?\" he wrote.)\n\nFranco admitted to using \"bad judgment,\" exclaiming, \"I'm guess I'm, you know, embarrassed, and I guess I'm just a model of how social media is tricky.\" He added, \"In my position, not only do I have to go through the embarrassing rituals of meeting someone, but sometimes it gets published for the world.\"\n\nJanuary 8, 2018\n\nFranco's awards season kick-off turned into the beginning of the actor's #MeToo moment. As The Disaster Artist star accepted his Golden Globe award for Best Actor in a Comedy or Musical, actress Ally Sheedy called him out in a series of since-deleted tweets.\n\n\"James Franco just won. Please never ever ask me why I left the film/tv business,\" she wrote, later adding, \"Why is a man hosting? Why is James Franco allowed in? Said too much. Nite love ya @goldenglobes.\" The Breakfast Club star, who worked with Franco on the off-Broadway play The Long Shrift in 2014, never expanded on her comments.\n\nDuring the awards show, Tither-Kaplan made her first public accusations against Franco.\n\nI love and care about James. Always will. But loving someone does not mean enabling them. Sometimes it means holding them accountable so they can do better. — Sarah Tither-Kaplan🌈 (@sarahtk) January 8, 2018\n\nAnd actress Violet Paley accused Franco of sexual misconduct against her and her 17-year-old friend.\n\nCute #TIMESUP pin James Franco. Remember the time you pushed my head down in a car towards your exposed penis & that other time you told my friend to come to your hotel when she was 17? After you had already been caught doing that to a different 17 year old? — Violet Paley (@VioletPaley) January 8, 2018\n\nPaley admitted to having a consensual relationship with the actor, which she said made it harder \"to come forward with this.\"\n\nanother reason it’s been hard to come forward about this. we did have a consensual relationship as well. unfortunately & fortunately, there are others who went through this same thing as me with him, and worse. I’m glad I am strong enough to speak up for all of us despite trolls — Violet Paley (@VioletPaley) January 9, 2018\n\nJanuary 9, 2018\n\nFranco addressed the accusations on The Late Show With Stephen Colbert.\n\n\"OK, first of all, I have no idea what I did to Ally Sheedy,\" he began. \"I directed her in a play off-Broadway. I had nothing but a great time with her — total respect for her. I have no idea why she was upset. She took the tweet down. I don’t know.\"\n\nAs for the other tweets, Franco said he hadn't read them, but had heard what they said.\n\n\"The things that I heard that were on Twitter are not accurate,\" he said. \"I completely support people coming out and being able to have a voice because they didn’t have a voice for so long, so I don’t want to — I don’t want to, you know, shut them down in any way. It’s, I think, a good thing and I support it.\"\n\nJanuary 10, 2018\n\nThe actor continued his awards season campaign, but it quickly turned into an apology tour. On Late Night With Seth Meyers, he stuck to a similar script.\n\n\"One of the things that I’ve learned is that this is a conversation that needs to be had,\" Franco said. \"There are people and women and others that have not been a part of this conversation, and I truly believe — and [it is] why I was wearing the pin — is that they need to be a part of this conversation. So I support them.\"", "description": "A look at all of the allegations against the actor.", "authors": ["Taryn Ryder"], "top_image": "https://s.yimg.com/uu/api/res/1.2/McGi1JEdQsLvuqhaDKjIsg--~B/aD0yODY3O3c9MzUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/d42ee6a0-e626-11e9-af6f-3a8e22aa24a8", "published_at": "2019-10-05"}