{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/london-fire-brigade-faulted-in-new-report-on-grenfell-tower-tragedy/2019/10/30/b108ac4e-fa97-11e9-9e02-1d45cb3dfa8f_story.html", "downloaded_at": "2019-10-30 11:37:40.911722+00:00", "title": "London Fire Brigade faulted in new report on Grenfell Tower tragedy", "language": "en", "text": "On June 14, 2017, a small fire began in a kitchen fridge on the fourth floor of Grenfell Tower. Within minutes, the fire was crawling — at alarming speed — up the facade of the 24-story public housing building. The fire was the deadliest in modern British history and provoked a national conversation about the yawning gap between the country’s haves and have-nots.\n\nAD\n\nIn a statement, Grenfell United, a group that represents some of the survivors and relatives, said that “while nothing can ever bring back our loved ones that passed away in the fire, this is a strong report.” They also said that “senior officers” in the London Fire Brigade “must stop hiding behind the bravery of their front line fire fighters.”\n\nAD\n\nMartin Moore-Bick, the retired judge who chairs a public inquiry into the fire, praised the bravery of individual firefighters, but said there were systemic failings within the fire services that meant their readiness for the fire was “gravely inadequate.”\n\nHe wrote there were “serious shortcomings in the response of the LFB [London Fire Brigade], both in the operation of the control room and on the incident ground.”\n\nHe specifically criticized the brigade’s “stay put” strategy. Residents were told to stay in their apartments rather than flee the burning building. This advice remained in place for almost two hours following the first call to emergency services. Moore-Bick said that if they had dropped that advice an hour before they did, there would have been “fewer fatalities.” He also said that the main reason “why the flames spread so rapidly up the building” was its combustible cladding, which will be examined further in the next stage of the inquiry.\n\nAD\n\nAD\n\nFirefighters hit back at the criticism. Matt Wrack, general-secretary of the Fire Brigades Union, told the BBC that by the time the firefighters arrived at the scene, the building was already “a death trap.” He also said that individual firefighters were being “subjected to a degree of scrutiny which government ministers are avoiding.”\n\nParliament is expected to debate the findings of the report later on Wednesday.\n\nThe so-called “stay put” advice is commonly given because it’s often safer for residents to stay inside high-rise concrete buildings, which are built so that fires don’t leap from apartment to apartment. Staying put means that residents don’t run out into smoke-filled corridors or get in the way of busy firefighters.\n\nAD\n\nAhmed Chellat previously told The Washington Post how he pleaded with Faouzia El-Wahabi, his sister-in-law, on the phone for her and her family to leave their 21st-floor apartment, but she told him that emergency services told her to “stay put” and that they were coming to get her. She died in the blaze with her family.\n\nAD\n\nThe report also criticized the head of the fire brigade Dany Cotton, who upset relatives and survivors when she told the inquiry that she wouldn’t change anything that they did on the night.\n\nMoore-Bick said that her comment was “remarkably insensitive.” Cotton has already announced that she would retire next year.\n\n“The commissioner’s evidence that she would not change anything about the response of the LFB on the night, even with the benefit of hindsight, only serves to demonstrate that the LFB is an institution at risk of not learning the lessons of the Grenfell Tower fire,” Moore-Bick wrote.\n\nThe day after the fire, then-Prime Minister Theresa May announced a public inquiry, promising that “no stone will be left unturned.” Today’s 935-page report, some of which was leaked to the British press earlier in the week, covers the events on the night of the fire. The second phase of the inquiry will begin in the new year and will focus on the events leading up to the night of the fire, such as how the tower came to be wrapped in combustible cladding.\n\nAD", "description": "A damning new report is critical of fire brigade’s “stay put” advice.", "authors": ["Karla Adam", "London Correspondent Covering The United Kingdom"], "top_image": "https://www.washingtonpost.com/resizer/39syd-jjI51kXzn_HVq4CXQGtYc=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VGL2NWX3AYI6TCIGVNVWBXUREQ.jpg", "published_at": "2019-10-30"}