{"pub": "indiatimes", "url": "https://indiatimes.com/news/india/with-leaders-doing-politics-over-73-deaths-helpless-bihar-flood-victims-have-nowhere-to-go-377219.html", "downloaded_at": "2019-10-06 11:34:08.800910+00:00", "title": "With Leaders Doing Politics Over 73 Deaths, Helpless Bihar Flood Victims Have Nowhere To Go", "language": "en", "text": "With Leaders Doing Politics Over 73 Deaths, Helpless Bihar Flood Victims Have Nowhere To Go\n\nWith Leaders Doing Politics Over 73 Deaths, Helpless Bihar Flood Victims Have Nowhere To Go\n\nIronic as it may sound but the northern state of Bihar, which has long had a track-record of underdevelopment and perennial issues gnawing at its existence, has once again been ravaged by water-logging caused due to incessant rain.\n\nBut the stalwart politicians from the state are indulging in blame game and shedding off their collective failure from preventing the trail of deaths and destruction that continues to thwart the daily life in the state.\n\nLocal residents of a flood affected area interact with members of National Disaster Response Force (NDRF) in Patna on October 2, 2019. AFP PHOTO\n\nThe state capital of Patna is faced with numerous hardships as roads remain waterlogged. Heavy rainfall and waterlogged roads in Patna and its nearby regions have troubled the locals for last many days.\n\nDon't Miss 482 SHARES 1 K SHARES 236 SHARES 162 SHARES\n\nNews agency IANS reported that at least 400 people are being treated for dengue in Patna, as floating animal carcasses and garbage spouted concerns of spreading disease in the city that is home to about 30 lakh residents. Chemicals are being sprayed in flood water by Patna Municipal Corporation in the city.\n\nPatients and their relatives rest in beds as they wade through floodwaters during heavy monsoon rain at waterlogged Nalanda Medical College and Hospital in Patna in the northeastern state of Bihar on September 28, 2019. AFP PHOTO\n\nSeveral regions of Patna as well as other smaller towns and villages in the state are under water for over a week and the situation has been blamed on malfunctioning pumps by authorities, who now say they hope to pump out most of inundated parts by this weekend.\n\nIn the meanwhile, hundreds of people staged protests against the state government for its mishandling of the crisis. Dozens of roads were blocked and slogans critical of the ruling dispensation -- the JDU-BJP alliance -- were raised vociferously by the people whose lives continues to hang in balance even now.\n\nUnion minister Giriraj Singh attacked the Nitish Kumar government for its “inept” handling of the Bihar floods and this has led to skirmishes between the alliance partners. The JDU has now hit back at the criticism. Mr Singh had said that the NDA \"owed an apology to the people of Patna\".\n\nRush of waterlogged flood victims trying to take relief food packets at Rajendra Nagar in Patna. BCCL\n\nTaken aback by his criticism, leaders of the JD(U) headed by Nitish Kumar came out with a barrage of attacks against Singh and his party.\n\n\"He (Giriraj Singh) is not even comparable to a speck of dust on Nitish Kumar's feet. One does not become a leader just by chanting the name of Mahadev (Lord Shiva) every now and then,\" JD(U) spokesman Sanjay Singh was quoted as saying by news agency PTI.\n\nThe blame game is increasing further as even bureaucrats and officials tasked for the proper functioning of the drains remain clueless about whose failure led to such a devastating scenario. The politicians from the ruling government are blaming each other, while the opposition is attacking the government relentlessly.\n\nA boy using makeshift to reach destination in the flood water of Ganga at Anta Ghat in Patna on Monday. BCCL\n\nPeople are losing their cool and composure as the saga of devastation is coupled with lack of accountability and frequent blame games.\n\nAccording to IANS, a sub-divisional magistrate (SDM) was attacked by angry flood victims in Bhagalpur district but was rescued by security guards. SDM Ashish Narayan was attacked by flood victims in Navtolia village when he was on a visit to assess the flood situation.\n\nState Deputy CM was himself evacuated by NDRF but people are blaming him in the choicest of words and have begun to ask if he couldn’t secure himself, his family and his neighbours, how would he guarantee the safety of an entire state under his command. Sushil Modi had reportedly closed his window when the neighbours sought his help and protests have now reached his front yard.\n\nFlood victims at near Toll plaza NH-77 Muzaffarpur to Sitamarhi Highway road. BCCL\n\nFurther, the residents of Patna are also complaining that the authorities that just a couple of days ago, the traffic cops were at almost every road of the city to challan people but they were nowhere to be found when all roads have been choked by water-logging. A police official was also reportedly beaten up by residents in the Rajendra Nagar area of Patna.\n\nWith Inputs From Agencies", "description": "Several regions of Patna as well as other smaller towns and villages in the state are under water for over a week and the situation has been blamed on malfunctioning pumps by authorities, who now say they hope to pump out most of inundated parts by this weekend.", "authors": ["Saket Suman"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/flood_1570349107_800x420.jpg", "published_at": "2019-10-06"}