{"pub": "reuters", "url": "https://ca.reuters.com/article/businessNews/idCAKBN1W20Z3-OCABS", "downloaded_at": "2019-09-17 10:39:04.857723+00:00", "title": "Budweiser APAC launches second IPO attempt, targets up to $6.6 billion", "language": "en", "text": "FILE PHOTO: Portfolio beer brands of Budweiser Brewing Company APAC Ltd are displayed during a news conference on the company's IPO in Hong Kong, China July 4, 2019. REUTERS/Andrew Geoffrey Jackson/File Photo\n\nHONG KONG (Reuters) - Anheuser-Busch InBev NV (ABI.BR) kicked off a second attempt to spin off its Asian business in Hong Kong with the launch of an IPO on Wednesday worth up to $6.6 billion in what is poised to be the world’s second largest IPO this year.\n\nThe Belgium-based brewing giant, which in July tried to raise up to $9.8 billion through an initial public offering of Budweiser Brewing Company APAC Ltd, said on Tuesday that it would re-launch its deal on Wednesday offering 1.3 billion shares at between HK$27-$30 ($3.45-$3.83) apiece.\n\nThe new offering includes a rare “upsize” option that will enable the company to sell up to 40% more shares. Assuming it exercises the option in full at the top end of the range, the sale could raise up to $6.6 billion before any regular overallotment option is included.\n\nThe company would raise up to $4.8 billion without the upsize option.\n\nProceeds will help AB InBev, the world’s largest brewer, reduce with a debt burden of over $100 billion, accumulated following the purchase of rival SABMiller in late 2016.", "description": "Anheuser-Busch InBev NV kicked off a second attempt to spin off its Asian business in Hong Kong with the launch of an IPO on Wednesday worth up to $6.6 billion in what is poised to be the world's second largest IPO this year.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190917&t=2&i=1430790219&w=1200&r=LYNXMPEF8G0NL-OCABS", "published_at": "2019-09-17"}