{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/09/trump-demanded-ukraine-smear-biden.html", "downloaded_at": "2019-09-23 17:32:17.121820+00:00", "title": "Trump Blurts Out to Reporters That He Pressured Ukraine to Smear Biden", "language": "en", "text": "Photo: Screenshot via Fox News\n\nOver the past two days, President Trump has drained most of the remaining mystery from the world’s least mysterious crime drama. In a series of comments to the media, the president casually revealed that yes, he had pressured Ukraine’s president to investigate Joe Biden, and yes, he had tied that demand to military aid.\n\nAn old editor of mine who once worked the police beat for a newspaper told me most murder investigations are solved with the police arriving at the crime scene to see a man holding a gun and weeping about why he did it. The political ecosystem, though, is not structured to handle such cut-and-dried scenarios. Concerns must be raised, hearings must be held, money must be followed.\n\nMitt Romney commendably broke ranks to denounce Trump’s abuse of his authority to discredit Biden. Yet he felt it necessary to phrase his condemnation in the hypothetical. “If the President asked or pressured Ukraine’s president to investigate his political rival, either directly or through his personal attorney, it would be troubling in the extreme,” Romney tweeted. “Critical for the facts to come out.”\n\nIf? The facts have come out! Rudy Giuliani literally told a newspaper reporter last spring that he was pressuring Ukraine’s president to investigate Biden (“We’re meddling in an investigation”) and that he was doing so not for the U.S. government but for the personal benefit of Trump, his client. (“I’m going to give [Ukraine] reasons why they shouldn’t stop [the investigation] because that information will be very, very helpful to my client and may turn out to be helpful to my government.”)\n\nSo Trump’s campaign to pressure Ukraine to investigate Biden, through the grossly improper channel of his personal lawyer, was established fact. The only remaining question was how overtly Trump used the lure of military aid to compel Ukraine’s cooperation. The Washington Post reported a couple of weeks ago that the aid was being held up as leverage. Trump has blurted out his scheme to the media in recent days.\n\nYesterday, a reporter asked Trump if he had mentioned the name of Joe Biden or his son in his phone call with Ukraine’s president. Trump did not answer directly but did make it clear that “corruption” was his code word for his demand to investigate Biden. He also made clear that he connected the Biden investigation to aid for Ukraine:\n\nReporter: Can you say whether, on this call, you raised Joe Biden or his son’s name with Ukraine?\n\nTrump: Well, I don’t even want to mention it, but certainly I’d have every right to. I’d have every right to. If there’s corruption, and we’re paying lots of money to a country, we don’t want a country we’re giving massive aid to to be corrupting our system, and we don’t want it to be corrupt in any way.\n\nTrump’s decoding is crucial because it removes his mob-boss-like ability to give himself plausible deniability for his threats. He’s making it explicit that his references to corruption in Ukraine mean investigating “bogus” charges against Biden.\n\nAlso Sunday, Trump told reporters his conversation was “largely” devoted to the subject of “corruption” — i.e., Biden:\n\nThe conversation I had was largely congratulatory, was largely corruption, all of the corruption taking place, was largely the fact that we don’t want our people like Vice-President Biden and his son [contributing] to the corruption already in Ukraine.\n\nTrump has previously dismissed the Wall Street Journal report that he repeated his demand to investigate Biden about eight times, but Trump’s own account is that the conversation was “largely” devoted to this very topic!\n\nAnd in remarks to reporters today, he reaffirmed his belief that it is proper to withhold aid from Ukraine to compel the country to investigate Biden (again expressed through the code of “corruption”):\n\nIt’s very important to talk about corruption. If you don’t talk about corruption, why would you give money to a country that you think is corrupt?\n\nAlso this morning, Giuliani refused to say if it was totally untrue that Trump had threatened to withhold aid from Ukraine:\n\nBartiromo: Did the president threaten to cut off aid to Ukraine? Giuliani: No, no. That was a false story. Bartiromo: 100 percent? Giuliani: Well, I can’t tell you if it’s 100 percent.\n\nEverybody seems to want the mystery to string out longer so Democrats can build support for impeachment and the handful of concerned Republicans can test public opinion. But what if Trump and Giuliani don’t want to hide it?", "description": "In a series of comments to the media, President Trump revealed that yes, he pressured Ukraine’s president to investigate Joe Biden, and yes, he tied the demand to military aid. Rudy Giuliani said he could not “100 percent” deny Trump withheld aid.", "authors": ["Jonathan Chait"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/09/23/23-trump-un-biden.w1200.h630.jpg", "published_at": "2019-09-23"}