{"pub": "axios", "url": "https://nbcdfw.com/news/local/Mass-Shooting-Reported-at-Homecoming-Party-in-Greenville-Outside-of-Dallas-563934821.html", "downloaded_at": "2019-10-27 12:02:47.004235+00:00", "title": "2 Killed, 14 Hurt as Gunman Opens Fire on Hundreds at Homecoming Party in Greenville, Outside of Dallas", "language": "en", "text": "Buddy Oxford, Chief Deputy with the Hunt County Sheriff's Office, gives an update on a shooting that left 2 dead and 14 injured late Saturday night near Greenville. (Published 23 minutes ago)\n\nHunt County Sheriff's Department is expected to provide another update at about 8 a.m. Sunday.\n\nTwo people are dead and at least 14 others were hurt when a person opened fire on a crowd of hundreds attending at a homecoming party in Greenville, outside of Dallas, late Saturday night.\n\nBuddy Oxford, Chief Deputy of the Hunt County Sheriff's Office, held a news conference just before 5 a.m. Sunday and said the shooting took place at about 11:45 p.m. Saturday at The Party Place, a private party venue west of Greenville where more than 750 people were gathered to celebrate Texas A&M University at Commerce's homecoming weekend.\n\nOxford said the shooter is at-large, his identity is unknown and that no motive is known for the shooting. He added that a description was also not yet available and that witnesses are \"not being cooperative,\" saying they didn't see anything.\n\n2 Killed, At Least 10 Shot at Greenville's The Party Venue (Raw Video)\n\nRaw video of the scene near Greenville, Texas, Oct. 27, 2019, where at least 10 people are believed to have been shot at a homecoming party. (Published 2 hours ago)\n\nOxford said deputies were called to the party venue at about 11:30 p.m. after learning cars were being parked along Highway 380. After about 15 minutes, deputies began hearing gunshots and called for assistance. Oxford said as people began running from the building, deputies couldn't tell whether the shots were coming from inside the venue or the back side of the building.\n\nDeputies at the scene did not fire their weapons, Oxford said, because they never saw the gunman. When the shooting subsided, Oxford said deputies found two people dead inside and the gunman was nowhere to be found.\n\nOxford said 14 people sought medical treatment for various injuries; a Texas Ranger reported earlier that at least 10 people had been shot.\n\nThose injured in the shooting were from Fort Worth, Arlington, Cedar Hill, Dallas, Commerce and Greenville, according to Oxford. The victims were taken to hospitals in Greenville, Quinlan, Commerce, Lake Point and Rowlett. Three people were airlifted from the scene to Plano Medical City Hospital. No further information is known about the condition of the survivors.\n\nGraphic video posted online showed several people unresponsive on the ground and bleeding, some receiving CPR, while other people can be heard screaming in the background.\n\nTexas A&M University Commerce Police tweeted there was no active shooter situation on campus, which is about 18 miles away from the party location, and that \"there was an event outside Greenville that may or may not have involved students at this time.\" The party was not believed to be a sanctioned homecoming event and officials said security was provided at the party.\n\nReporter Films Escape Surrounded By Fire\n\nNBC Bay Area Reporter Bob Redell and his crew had to evacuate when flames got too close. Redell filmed the escape. (Published Thursday, Oct. 24, 2019)\n\nGreenville is in Hunt County, about 40 miles northeast of Dallas.", "description": "Two people are dead and at least 14 others were hurt when a person opened fire on a crowd of hundreds attending at a homecoming party in Greenville, outside of Dallas Saturday night.", "authors": [], "top_image": "https://media.nbcdfw.com/images/1200*675/hunt-county-sheriff-380-the-party-place-shooting.jpg", "published_at": "2019-10-27"}