{"pub": "thestreet", "url": "https://realmoney.thestreet.com/investing/hasbro-s-plunge-could-be-just-a-shakeout-but-let-s-wait-for-now-15137226", "downloaded_at": "2019-10-23 14:58:12.744982+00:00", "title": "Hasbro's Plunge Could Be Just a Shakeout, but Let's Wait for Now", "language": "en", "text": "For the first Executive Decision segment of \"Mad Money\" Tuesday, Jim Cramer spoke with Brian Goldner, chairman and CEO of toymaker Hasbro Inc. (HAS) , which saw its shares plunge nearly 17% Tuesday after reporting a brutal third quarter that was hurt by tariffs.\n\nGoldner said Hasbro continues on its plan to return to profitable growth in 2019 and this past quarter's weakness was a direct result of fears over tariffs. He said some customers who were worried about tariffs canceled their direct import orders and chose instead to buy through the traditional supply chain. Hasbro then struggled to supply enough inventory to its supply chain to meet the increased demand. Goldner said these effects will be temporary.\n\nWhen asked about Hasbro's outlook, Goldner was bullish going into the holiday season. He said there are big movie events coming and merchandise for those movies has already hit store shelves.\n\nHasbro is also working to expand its intellectual property ownership. Goldner said owning the brand allows Hasbro to tell more stories and bring those stories to global audiences. These brands are also more profitable than partner licensed merchandise.\n\nCramer told viewers to use Tuesday's weakness to buy shares of HAS, which he said areonly affected by things it cannot control. Let's check the charts to see what they suggest.\n\nIn this daily bar chart of HAS, below, we can see that price gaps or price voids are not an uncommon event with the shares of HAS. Hasbro gapped down Tuesday below the 50-day moving average line and closed below the rising 200-day moving average line. Prices found support in May around $95, so that might provide support again. The On-Balance-Volume (OBV) line showed a steady rise from March right up to its peak this month, so longs may have been very surprised with a sharp decline from the stock. The Moving Average Convergence Divergence (MACD) oscillator was not far above the zero line before Tuesday's gap down, so traders had a minor heads up that HAS did not have much trend strength.\n\nIn this weekly bar chart of HAS, below, we can see that prices have quickly retraced about 50% of the prior rally from late December. Sometimes long-term buyers wait for a 50% retracement before buying. HAS is below the cresting 40-week moving average line. The weekly OBV line has stagnated the past five to six months and never confirmed the new price highs made this year. This is a large bearish divergence. The MACD oscillator just crossed to the downside for a take profits sell signal.\n\nIn this Point and Figure chart of HAS, below, we can see a developed top formation and a potential downside price target of $76. The $95 area looks like it might provide support.\n\nBottom line strategy: A lot of damage has been done to the charts of HAS. Prices have retraced 50% of the prior advance and are down in an area of potential support, but that does not mean we are guaranteed a bottom or a reversal. Keep your powder dry and let's see if others are willing to step in to be buyers.", "description": "Hasbro Inc.'s (HAS) shares have fallen to an area of potential technical support after the toymaker posted disappointing earnings Tuesday, but that does not mean a bottom or a reversal is guaranteed; investors would do well to wait to see if buyers step in....HAS", "authors": ["Bruce Kamich", "Hasbro'S Plunge Could Be Just A Shakeout", "But Let'S Wait For Now", "The Toymaker'S Shares Have Fallen To An Area Of Potential Support After Posting Disappointing Earnings", "But That Does Not Mean A Bottom Or A Reversal Is Guaranteed.", "Stocks Quotes In This Article", "Bob Ciura", "Doug Kass", "Carolyn Boroden", "Bob Lang"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/d086554e-2baa-11e9-8537-e9bf00b4057e.jpg", "published_at": "2019-10-23"}