{"pub": "foxnews", "url": "https://foxbusiness.com/economy/jpmorgan-ceo-jamie-dimon-talks-zero-interest-rates", "downloaded_at": "2019-09-10 23:34:28.241076+00:00", "title": "JPMorgan CEO Jamie Dimon talks zero interest rates", "language": "en", "text": "JPMorgan CEO Jamie Dimon, like many others, thought interest rates would be \"heading up not down\" this year until the Federal Reserve pivoted, cutting rates for the first time in a decade in July and then signaling another cut is likely coming next week.\n\nContinue Reading Below\n\nNow, the straight-talking bank chief says he and his team are eyeing the possibility of rates falling to zero.\n\n\"I don't think we'll have zero rates in the U.S. but we're thinking how to be prepared for it as a normal course of risk management,\" he said during a Q&A at Barclays Global Financial Services Conference on Tuesday.\n\nTicker Security Last Change %Chg JPM JP MORGAN CHASE & CO. 116.87 +1.47 +1.27%\n\nLower interest rates make it more challenging for banks to make money compared to higher rates in which banks can charge consumers more to borrow. Even so, Dimon said he remains focused on \"building the business\" and that includes the quest for \"more deposit accounts ... more deposits.\"\n\nAdvertisement\n\nFederal Reserve Chair Jerome Powell has been a lightning rod for President Trump who has steadily hammered the Fed in tweets over rates being too high as Japan, China and eurozone countries cut rates.\n\nLast month, Powell said, the economic outlook remains strong, despite uncertainties resulting from the U.S.-China trade war, slowing global growth and muted inflation. Powell alluded to the \"eventful\" weeks since the Fed's previous meeting and acknowledged there are growing signs of a global slowdown, especially in China and Germany.\n\nCurrently, traders are pricing in a 90 percent-plus chance that the Fed will cut rates this month, as tracked by the CME's FedWatch Tool.\n\nDespite a looming rate cut, Dimon said the \"U.S. consumer is chugging along\" even amid the face of a slowing economy.\n\nCLICK HERE TO GET THE FOX BUSINESS APP", "description": "Dimon was expecting higher, not lower rates this year.", "authors": ["Suzanne O'Halloran"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/01/0/0/jamie-Dimon-AP.jpg?ve=1&tl=1", "published_at": "2019-09-10"}