{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/anti-gay-pastor-served-for-allegedly-defying-court-ruling-i-will-come-out-and-preach-the-same-message-20191030", "downloaded_at": "2019-10-30 23:18:41.077032+00:00", "title": "Anti-gay pastor served for allegedly defying court ruling: ‘I will come out and preach the same message’", "language": "en", "text": "A Cape Town pastor, who may find himself behind bars for defying a court order barring him from making anti-gay comments, accused the SA Human Rights Commission (SAHRC) on Wednesday of trying to make an example of him.\n\n\n\n\"Even if they lock me up, I will come out and preach the same message. They might as well just leave me there,\" Reverend Oscar Bougardt told News24.\n\nBougardt was served with a notice of motion last week, wherein the SAHRC asked that he serve 30 days behind bars as per the order handed down by the Equality Court in May 2018.\n\nHe confirmed he had served the commission with a notice of intention to oppose and was in the process of compiling his answering affidavit.\n\nBougardt reached a settlement with the SAHRC in 2014 following anti-gay statements. He agreed to stop making hateful comments about the LGBTQI+ community, but continued, nonetheless.\n\nHe referred to gay people as \"perverted\" and advocated for criminalisation, saying they should \"deal with them like they do in Nigeria\".\n\nIn January 2017, Bougardt told News24 that, like anti-gay US pastor Steven Anderson, he believed homosexuality was a sin.\n\n\"Why should we be tolerant of their criminal lifestyle? Ninety-nine percent of paedophiles stem from homosexuality.\n\n\"I'm saying so because it is proven that 99% of the paedophiles have a homosexual background. They are blaming their previous lifestyle on what happened. Go and read up on it.\"\n\nAnti-gay comments\n\nLast year, Bougardt was sentenced to 30 days in prison, suspended for five years, for contempt of court after he disregarded a court order barring him from making anti-gay comments.\n\nJudge Lee Bozalek in the Equality Court in Cape Town said his comments advocated hatred and were clearly discriminatory.\n\nJudge Bozalek added Bougardt held a position of authority in his community and was educated enough to know there would be legal consequences for his behaviour.\n\nOn Wednesday, he maintained he had not made himself guilty of contempt, reiterating that he had not said anything harmful or derogatory about the LGBTQI+ community.\n\n\"I am being victimised by the SAHRC and [LGBTQI+] community because I brought missionaries from Pastor Anderson's church here. They want to tell me who I can associate with,\" Bougardt said.\n\nIn 2016, Anderson was effectively barred from entering South Africa when then-home affairs minister Malusi Gigaba announced he would not be granted a visa.\n\nA reverend at the Calvary Hope Ministries in Delft, Bougardt said his church preached what the Bible said - that homosexuality was \"an abomination\".\n\n\"We don't marry homosexuals. We encourage monogamous relationships and no sex before marriage.\"\n\nBut during their \"soul winning\" campaign, which saw them go door-to-door in Delft, no mention was made about homosexuality, he argued.\n\nHis social media posts, Bougardt maintained, focused on the Bible and what it preached.\n\n\"What about my right to freedom of association, religion and speech? The SAHRC can't take that away from me.\"\n\nAfter being served with the papers, Bougardt in a Facebook post over the weekend said his crime was \"preaching the Bible\".\n\n\"I am really fed up of these persecution, but if this is the price I have to pay for the Gospel, bring it on, so be it [sic].\"\n\nThe SAHRC's Zena Nair told MambaOnline it hoped to have Bougardt's suspended jail sentence enforced because he had violated the judge's ruling.", "description": "A Cape Town pastor, who may find himself behind bars for defying a court order barring him from making anti-gay comments, accused the SA Human Rights Commission of trying to make an example of him.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/4837/cc9184cb073640949667b81023520b47.jpg", "published_at": "2019-10-30"}