{"pub": "washingtonpost", "url": "https://washingtonpost.com/nation/2019/09/14/more-than-fetal-remains-found-home-states-most-prolific-abortion-doctor", "downloaded_at": "2019-09-15 00:05:57.572707+00:00", "title": "Fetal remains found in home of dead abortion doctor Ulrich George Klopfer of South Bend’s Women’s Pavilion", "language": "en", "text": "Investigators arrived at Klopfer’s home and found 2,246 fetal remains, according to the sheriff’s office. The coroner’s office took possession of them.\n\nNo evidence indicates that medical procedures were performed at Klopfer’s home, and his family is cooperating with the investigation, the sheriff’s office said. No other information was immediately available.\n\nKlopfer is considered Indiana’s “most prolific” abortion doctor, with tens of thousands of procedures performed, the South Bend Tribune reported. The state suspended his medical license in 2016 for failing to exercise reasonable care and for violating notice and documentation requirements, the Tribune reported. The Women’s Pavilion shut down the same year.\n\nSome Democrats are angry that abortion, women’s rights were ignored at debate\n\nIn Indiana, fetal remains must be buried or cremated. Rep. Jackie Walorski (R-Ind.) said in a statement that she would consider proposing federal legislation related to the disposal of aborted fetus’ remains. Walorski also called on state and federal authorities to conduct a full investigation into Klopfer.\n\nJeanne Mancini, president of the antiabortion March for Life, said the fetal remains allegedly at Klopfer’s home are a reminder that it is “outrageous” that abortion activists and many politicians advocate for fewer regulations on the procedure.\n\n“We urge a thorough investigation of this case so that justice may be done, and so that the public becomes aware of what really happens inside America’s abortion industry,” Mancini said in a statement.\n\nThe macabre discovery of fetal remains contains echoes of the case of Kermit Gosnell, a Philadelphia doctor who is serving a life sentence after a jury in 2013 convicted him of murder for snipping the spinal cords of three babies who lived for a few moments outside the womb. Investigators found dismembered remains in milk jugs and glass jars inside Gosnell’s clinic.\n\nThe remains allegedly found at Klopfer’s home also resonate because of his clinic’s location in South Bend, whose mayor is 2020 Democratic presidential hopeful Pete Buttigieg. Antiabortion circles buzzed this month about Buttigieg’s remark on the radio show “The Breakfast Club” that the Bible says “life begins with breath.”\n\nRead more:\n\nDemocrats’ leftward shift on third-trimester abortion\n\nWhy the N.Y. City Council made the ‘painful’ decision to repeal its ban on conversion therapy\n\nWhat we know about the mysterious vaping-linked illness and deaths\n\n‘Stop me if you can’: Teen arrested for allegedly threatening ‘slaughter’ at abortion clinic", "description": "Indiana previously had suspended Ulrich George Klopfer's medical license for failing to exercise reasonable care and for violating notice and documentation requirements.", "authors": ["Marisa Iati", "General Assignment", "Metro Reporter"], "top_image": "https://d1i4t8bqe7zgj6.cloudfront.net/thumbnails/5d7d535d4cedfd0009a051b0/2019-09-14T204051Z_3_OVAWMXOM7_RTRMADC_0_USA-INDIANA.jpg", "published_at": "2019-09-14"}