{"pub": "news24", "url": "https://news24.com/Columnists/Mpumelelo_Mkhabela/mpumelelo-mkhabela-did-the-da-just-kill-itself-in-the-name-of-liberalism-20191024", "downloaded_at": "2019-10-25 16:42:07.941101+00:00", "title": "Mpumelelo Mkhabela: Did the DA just kill itself in the name of liberalism?", "language": "en", "text": "Mpumelelo Mkhabela: Did the DA just kill itself in the name of liberalism?\n\nThe fallout in the DA is a result of the failure by the dominant faction to appreciate concerns of all South Africans and to redirect the fears of whites – both genuine and unfounded – toward solutions for the country's problems, writes Mpumelelo Mkhabela.\n\nThe turmoil in the Democratic Alliance (DA) is a symptom of South Africa's unresolved problem: race and its role in economic development and nation building.\n\nSouth Africa is an artificially constructed entity of which the making is incomplete. It is an outcome of political developments spanning centuries: divided kingdoms, colonial conquests, wars, apartheid and eventually, constitutional democracy. The denominator in many of these stages was race and its role in economic development and nation building.\n\nFor the first time in 1994, we arrived at the stage of constitutional democracy after the realisation that, different as we are in race, language, culture and historical experiences, we have to live with one another, governed by the same rules and enjoying the same rights within the territory defined as South Africa. The painful history and what we seek to achieve is well summarised in the preamble to the Constitution.\n\nThe Constitution acknowledges race and its impact over the years. It also provides the legal basis on which the legacy of the past can be addressed without denying the beneficiaries or descendants of the beneficiaries of exploitative policies equal citizenship.\n\nThe redress of historical injustices is one of the most important aspects of our constitutional order. It's also the trickiest if there is no appreciation among both blacks and whites of the necessity to do it responsibly in a constructive manner.\n\nRacial redress is one of many factors critical for our next stage of political development where constitutional democracy must either have substantive meaning for all South Africans or else some populist lunatic will campaign for its overthrow.\n\nWe can already see such threats emerging even though South Africans are too sophisticated to be hoodwinked by self-serving lovers of the finer things in life. And many are confident of their own agency to change things. Regardless of our shortcomings, we are definitely not a docile nation.\n\nRacial rhetoric and threats to overthrow the constitutional order must be rendered futile by galvanised South Africans of all races, making sure transformation initiatives yield positive results and there's no relapse that can be used to justify perpetual redress as if black people are naturally dependent on redress.\n\nAs a matter of fact, there are black people who have long overcome the apartheid legacy thanks to their own efforts and transformation initiatives by responsible corporate citizens and the state. The fact that some black businesspeople were successful when it was a crime for them to operate businesses in parts of the country is phenomenal.\n\nWhites feel under siege\n\nThe corruption that often accompanies economic transformation initiatives must be fought vigorously with the same energy we use to fight those who resist transformation. It's not an either or. This can happen if overwhelmingly South Africans of all racial backgrounds are in a hurry to genuinely address inequalities arising from our history while preventing new forms of injustices which might serve to trigger a fresh round of racial grievances.\n\nBut there's already a grievance among whites who feel they are under siege. This is where the DA hasn't got a clue how to deal with the situation. There is fear of black racial domination which has united white liberals and nationalists.\n\nCompounding this fear is another fear which is shared by many South Africans, including blacks: the prospects of a failed state as a result of wrong policy choices and corruption. The dominant faction in the DA has elevated the fear of black racial domination above the fear shared by South Africans across racial and class lines.\n\nFormer DA leaders Tony Leon and Helen Zille demonstrated this with notable exasperation in two separate lectures. The lectures show that they no longer felt home in the party they once led because it was increasingly in favour of policies that acknowledged the legacy of historical injustices and the need for redress.\n\nBoth lectures wrestle with the question of race and the supposed liberal answer to it in the South African context. Make no mistake, the two are well-read individuals who summon their scholarship to get their sharp points across.\n\nLeon delivered the \"Liberty Lecture\" hosted by the Friedrich Naumann Foundation and the Institute of Race Relations. In it, he refers to the US Chief Justice who criticised the idea of using race as a proxy for disadvantage. \"The way to stop discriminating on the basis of race is to stop discriminating on the basis of race,\" Leon quotes the Chief Justice as having said. He clearly agrees with him.\n\nNot so with the DA election manifesto under Mmusi Maimane which he criticises for having created a formula that suggests race-based redress is vital for justice. \"This in turn is referenced to an undeniable and hugely relevant fact of South African life, also cited by the DA in the same manifesto: 'millions of people still trapped by our legacy of racially exclusionary policy (sic) in grinding poverty, with no real chance of escape or a better life'.\"\n\nThe failure of liberal thinking\n\nLeon argues that race-based redress is not liberal. He says if liberalism is about rights and ambitions, and affirmation of the individual citizen, \"self-evidently, it cannot be indifferent to poverty an inequality\". However, he has a problem with the focus on race groups. The focus should be on the individual.\n\nThe weakness of this \"liberal\" thinking is the failure to acknowledge that black people were not oppressed as individuals. They were oppressed collectively as a race.\n\nWhile you empower each individual, you can't lose focus of the bigger group. In fact, oppression created bonds that might take long to unravel, in the same way it created bonds among the privileged white groups.\n\nThe formation of the ANC in 1912 to unite all black tribes in the fight against colonialism is an example of how oppression created bonds of resistance.\n\nSimilarly, the fear of black majority domination and the increasing white grievance is not individual, but group-based. Leon is part of this group.\n\nZille lacks understanding of racism\n\nOn 25 July 2019, Zille delivered her \"Keep on Fighting Lecture\". It was a clarion call-type lecture hosted by the Liberal Club. In it, she refers to the US tennis star Serena Williams who once remarked: \"The day I stop fighting for the equality of the people who look like me will be the day I'm in the grave.\" Zille criticises the Business Day newspaper for giving Williams a green light for her expressed sentiment instead of reminding her that \"you don't have to look like someone to fight for their dignity and equality\".\n\nZille goes further: \"Banding together with people who look like you is the most basic biological form of social cohesion, and while it is powerful and understandable, we need to constantly seek to transcend this. When we get beyond what people look like, to what they stand for and believe, we will really be making progress.\"\n\nZille seems to be making sense, but her sense ends where she has no way of understanding how, notwithstanding her wealth, Williams, like many African-Americans, continue to suffer from racism.\n\nZille also makes a \"liberal\" mistake of suggesting that when blacks fight for the same issues together it constitutes \"biological populism\". While it is true that some people use race for opportunistic reasons (for example AfriForum and BLF) there are genuine issues that black people deal with not primarily due to pigmentation but because of the social experiences they are subjected as a result of being black.\n\nZille goes on to refer to her real fears.\n\n\"But this (transcendent race,) could be a pipedream if biological populism manages to create a groundswell for a racial majority to rally behind an authoritarian interventionist state that erodes the freedoms necessary to facilitate development and economic growth. And even if this does happen in South Africa it won't be the first.\"\n\nShe then refers to post-Nazi communism and post-colonial repression in Zimbabwe as examples.\n\nThe fallout in the DA is a result of the failure by the dominant faction to appreciate concerns of all South Africans and to redirect the fears of whites – both genuine and unfounded – toward solutions for the country's problems.\n\nThere's the real possibility that the failure might have the unintended consequence of a truly illiberal outcome: a government unconstrained by a powerful opposition because someone decided to kill the DA in the name of liberalism.\n\n- Mkhabela is a regular columnist for News24.\n\n** Want to respond to the columnist? Send your letter or article to voices@news24.com with your name, profile picture, contact details and location. We encourage a diversity of voices and views in our readers' submissions and reserve the right not to publish any and all submissions received.\n\nDisclaimer: News24 encourages freedom of speech and the expression of diverse views. The views of columnists published on News24 are therefore their own and do not necessarily represent the views of News24.", "description": "The fallout in the DA is a result of the failure by the dominant faction to appreciate concerns of all South Africans and to redirect the fears of whites toward solutions for the country's problems, writes Mpumelelo Mkhabela.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9516/0739edf481ed43f4b028f21e9128cb80.jpg", "published_at": "2019-10-25"}