{"pub": "businessinsider", "url": "https://businessinsider.com/student-loan-repayment-debt-snowball-make-loans-fair", "downloaded_at": "2019-10-19 16:21:57.559937+00:00", "title": "A 28-year-old who paid off $102,000 in student loans used the debt snowball method to 'make her loans fair'", "language": "en", "text": "Mandy Velez graduated from the University of Pittsburgh in 2013 with $75,000 in debt.\n\nShe calculated that if she made monthly payments as expected, she would be paying her loans until she was in her mid-50s.\n\nShe decided to pay off her loans sooner instead. She used the debt snowball method to pay off her loans sooner, ultimately reducing the high amount she'd have to pay in interest that she felt was unfair.\n\nIn the end, she paid off $102,000 in total of student loans — $27,000 more than she actually borrowed. If she'd made minimum payments into middle age, she calculates she would have paid about $96,000 in interest alone.\n\nRead more personal finance coverage.\n\nA few months after Mandy Velez graduated from the University of Pittsburgh with a bachelor's degree in English and communications, she was in for a shock. She calculated that if she were to make the minimum monthly payment on her $75,000 loans every month, she'd pay them off around the year 2046.\n\nShe calculated that if she paid the minimum payment as long as her loan balances suggested, she'd have paid over $96,000 in interest alone — more than she borrowed originally. \"I was like, 'This is ridiculous,'\" she told Business Insider. \"There has to be a better way than taking the 20 or 30-some years that it's telling me I would need to pay them off.'\"\n\nShe had three public student loans totaling $30,500, with interest rates between 9% and 12%. Additionally, she had two federal loans, one direct subsidized student loan and one unsubsidized, totaling $45,091 at 6%. If she could pay off her loans faster, she reasoned, she could avoid having the interest add up and pay more than she had to.\n\nShe felt it was unfair that the loans that helped her earn her bachelor's degree had such high interest rates attached. \"I have always been a person who, if I feel like if things aren't fair, I have to find a way to make them fair,\" Velez told Business Insider. She aimed to pay them off by the time she turned 30, but ended up doing it in just six years, two years early.\n\nShe started researching student loan repayment methods, and came upon the debt snowball and debt avalanche methods. The debt snowball method makes minimum payments on all debts while putting extra cash toward the smallest debts first, to eliminate them and move on to the others. The debt avalanche focuses on eliminating the debts with the highest interest rates first, rather than the smallest. Velez chose the debt snowball method, and focused on eliminating her student loans one by one.\n\n\"My loan payment came first, and then I had to figure out my life around that,\" Velez said, \"whether that meant living farther away from where I worked and have a long commute, or the jobs that I decided to take, apply for, or turn down.\"\n\nShe'd lived in New York City the whole time she was paying on her loans, and had worked jobs with salaries between $40,000 and $80,000 per year. She had roles at various startups, publications, and even took temp roles. She now works as a senior social editor at The Daily Beast.\n\nHer sacrifices became more intense as she got into the final stretch. \"Particularly this past January, I literally gave up time with my partner and my friends,\" said Velez. She cut her grocery budget to only the essentials. She also took on side hustles to help earn a few extra bucks by babysitting and walking dogs, once even taking a role as an extra in a TV show that filmed overnight. \"The side hustles, they brought in so much extra income that I was able to increase my debt snowball with,\" she said.\n\n\"Once I committed to it, it just kind of happened. It really felt like a sport,\" Velez told Business Insider.\n\nShe ended up not only meeting her goal of paying off her loans by 30, but exceeding it, and finished paying off her college debts on August 2, 2019, at 28 years old.\n\nIn the last eight months of her debt repayment, she paid over $32,000. In the end, she paid a total of about $102,000, including $27,000 in interest on top of her $75,000 worth of loans.\n\nIn celebration of the end of her six-year journey, she had a funeral for her loans in a New York City cemetery. \"This is what it takes to get out of debt simply for having an education that you had to get loans for,\" she said.", "description": "She calculated that if she made monthly student loan payments as expected, she would be paying her loans until she was in her mid-50s.", "authors": ["Liz Knueven"], "top_image": "https://image.businessinsider.com/5da767e9cc4a0a26cd28b508?width=1200&format=jpeg", "published_at": "2019-10-19"}