{"pub": "yahoo", "url": "https://news.yahoo.com/r-kellys-lawyer-blamed-toenail-210906663.html", "downloaded_at": "2019-10-30 23:28:03.053554+00:00", "title": "R. Kelly's lawyer blamed a toenail infection for the rapper's missed court appearance, but recovery from such an injury doesn't require isolation", "language": "en", "text": "E. Jason Wambsgans/Chicago Tribune via AP\n\n\n\n\n\nIn a video from CBS Chicago reporter Megan Hickey, R. Kelly's lawyer Steve Greenberg told journalists that the rapper was absent from court due to a toe infection that required his toenail be removed.\n\nKelly \"didn't want to come today because the process where you're handcuffed to other inmates and so forth, someone can step on your foot,\" Steve Greenberg, Kelly's lawyer, said.\n\nAlthough dealing with a toenail infection can be uncomfortable or even a bit painful, a podiatrist said it's a manageable condition that shouldn't hinder someone from walking, even if it's stepped on.\n\nVisit Insider's homepage for more.\n\nR. Kelly missed his federal court hearing in Chicago on Wednesday, and according to his attorney, it's all because of the rapper's toe.\n\nIn a video from CBS Chicago reporter Megan Hickey, Kelly's lawyer Steve Greenberg is shown addressing a group of reporters and explaining that his client is absent due to a toe infection that required Kelly's toenail be removed.\n\n\"He's in a walking boot because of that,\" Greenberg said, adding that Kelly \"didn't want to come today because the process where you're handcuffed to other inmates and so forth, someone can step on your foot. They step on your foot and your toenail falls off, it can be quite painful.\"\n\nAt the end of the video, one reporter asks, \"Which toenail?\" but the clip ends before Greenberg responds.\n\nTweet Embed:\n\n//twitter.com/mims/statuses/1189557240749056000?ref_src=twsrc%5Etfw\n\nTOE PROBLEM: R. Kelly did not appear in federal court today because his attorney says he had an infection in his toe. Toenail had to be removed and he was worried that someone would step on it. @cbschicagopic.twitter.com/hkVMuTChpZ\n\nAlthough dealing with a toenail infection or missing toenail can be uncomfortable, a podiatrist said it's a manageable condition that shouldn't hinder someone from walking.\n\nIf someone were to step on a person's infected toe, \"the worst-case scenario would be permanent damage, which means it won't grow back,\" or will grow back in a disfigured way, Dr. Miguel Cunha, a Manhattan-based podiatrist and founder of Gotham Footcare, told Insider.\n\nInfections often cause toenails to loosen or fall off\n\nsoaking feet More\n\nShutterstock\n\nGreenberg didn't disclose the cause of Kelly's toe infection and subsequent nail removal, but these infections are typically due to injury to the area, fungus, or the autoimmune condition psoriasis, according to Healthline.\n\nSometimes medications, chemicals, or serious illness can cause a toe infection, but those causes are rare. Fungal infections, however, are more common, especially in athletes, people with diabetes, and those with weakened immune systems, according to the CDC.\n\nToe infections can often cause a person's toenail to loosen or completely fall off, according to Rocky Mountain Foot and Ankle Care. In other cases, portions of a toenail or the entire toenail may be removed to treat the infection.\n\nOther times, an infection requires a part of the toenail to be removed, according to Manhattan-based podiatrist Dr. Hillary Brenner.\n\n\"I haven't seen Kelly's toe so I can't comment on his condition, but when my patients have toe infections I remove the border of the nail,\" Brenner told Insider.\n\nUsually patients can return to business as usual right after treatments\n\nAccording to Cunha, once the nail is removed, a podiatrist will apply a topical antibiotic and cover the infected area. Sometimes, doctors recommend a patient wear a surgical boot to relieve pressure from the area, and if the infection is severe, oral antibiotics could also be needed, Cunha said.\n\nDraining some fluid from the toe may also be required, but Brenner said it's a \"pretty straightforward\" procedure and patients can go about their days as usual following treatment.\n\nStill, it requires some care: \"You should also cover it with an antibiotic or neosporin and Band-Aid to protect the area while you are waiting for your nail to grow back,\" Cunha said. \"Wrap the area with gauze or a Band-Aid when you're out and about, but take it off before going to bed in order to let it breath.\"", "description": "Podiatrists say most people can go about their days as usual after being treated for a toenail infection.", "authors": ["Julia Naftulin"], "top_image": "https://s.yimg.com/uu/api/res/1.2/EJ8qQv04dazlyBR3fUsyMg--~B/aD0xODAwO3c9MjQwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/insider_articles_922/0dede02577613e071b3ef44dc04cecb7", "published_at": "2019-10-30"}