{"pub": "thehill", "url": "https://thehill.com/policy/defense/468019-senate-chairman-introduces-skinny-defense-policy-bill", "downloaded_at": "2019-10-29 23:56:35.028073+00:00", "title": "Senate chairman introduces 'skinny' defense policy bill", "language": "en", "text": "Senate Armed Services Committee Chairman James Inhofe (R-Okla.) on Tuesday officially introduced his “skinny” defense policy bill, which he is billing as a backup plan if lawmakers can’t agree on a larger bill by the end of the year.\n\n“A skinny bill is simple. It extends necessary authorities for military operations, takes care of the servicemembers and their families, and authorizes essential military construction and acquisition programs,” Inhofe said. “That’s it.”\n\nADVERTISEMENT\n\nThe skinny National Defense Authorization Act (NDAA) is being introduced amid stalled negotiations on a more comprehensive NDAA.\n\nBoth Inhofe and his House counterpart, Armed Services Committee Chairman Adam Smith David (Adam) Adam SmithOvernight Defense: Latest on al-Baghdadi's death | Trump weighs releasing raid video | Pentagon reveals 2 suspects captured in raid | House to vote on impeachment procedures | Border wall fight stalls defense bill On The Money: Trump wall fight endangers must-pass defense bill | Slumping Halloween sales spook analysts | Survey finds business hiring has fallen | Dems eye tax hikes on corporations, financial transactions Trump wall endangers must-pass defense bill MORE (D-Wash.), have blamed an impasse over President Trump Donald John TrumpJudge schedules hearing for ex-Trump aide who refused to appear in inquiry READ: Army officer to tell investigators he twice reported concerns over Trump's Ukraine dealings Murkowski, Collins say they won't co-sponsor Graham's impeachment resolution MORE’s border wall for tripping up the talks.\n\nInhofe and Smith both said Tuesday progress has not been made on wall issues since last week.\n\nTrump has tapped into about $6.1 billion in Pentagon funding in order to build the wall on the U.S.-Mexico border, including about $3.6 billion in military construction funds and $2.5 billion in counter-drug funds that were transferred from various other Pentagon accounts.\n\nHouse Democrats, furious at what they describe as Trump circumventing Congress, included in the NDAA provisions to ban the use of Pentagon funds on the wall and limit the Pentagon’s ability to transfer money between accounts.\n\nThe Senate’s version of the NDAA, meanwhile, includes none of that and would backfill the $3.6 billion in military construction funding taken for the wall.\n\nWith just about 20 legislative days left in the year, Inhofe said he introduced a skinny NDAA in case it’s needed to renew authorities that expire at the end of the year.\n\nInhofe told reporters Tuesday he has been working with Deputy Defense Secretary David Norquist to identify the line items in the NDAA that must pass by the end of the year.\n\nThe 67-page bill covers authorizations for military construction projects, transfer authorities, special and bonus pay for troops, pay for civilians in conflict zones, authority to buy F-35 fighters jets in “economic order quantities” from 2021 to 2023, operations and maintenance for cyber capabilities, counter-ISIS authorities and authorization for the supply line for operations in Afghanistan, among others.\n\nBase pay for troops, including a planned 3.1 percent pay raise, would continue with or without the NDAA.\n\nA GOP committee aide stressed that the skinny NDAA is “intended to be brought up only in the event both sides can’t reconcile their differences in a timely fashion” and that “it is not intended to be the only NDAA Congress considers this year.”\n\nBut the skinny bill, too, appears doomed in the House over the wall.\n\nSmith has said he doesn’t support a skinny bill because it wouldn’t restrict Trump’s ability to use Pentagon funding on the wall. He reiterated Tuesday he views the skinny bill as a “no-go.”\n\n“A skinny bill is pretty much a no-go, particularly the one that Sen. Inhofe introduced. It doesn’t do anything,” Smith said. “I’m pretty firmly opposed to the skinny bill.”\n\nInhofe, though, said he thinks the pressure to pass an NDAA — which has been signed into law for the past 58 years — will be too much for Democrats to ultimately vote against his skinny bill.\n\n“If he wants to say publicly that he doesn’t want to pay our troops for risking their lives for his safety, then you’ll have a new member,” Inhofe said of Smith. “It does everything that our troops need to fight a war.”", "description": "Senate Armed Services Committee Chairman James Inhofe (R-Okla.) on Tuesday officially introduced his “skinny” defense policy bill, which he is billing as a backup plan if lawmakers can’t agree on a larger bill by the end of the year.", "authors": [], "top_image": "https://thehill.com/sites/default/files/inhofejames_071119as_lead.jpg", "published_at": "2019-10-29"}