{"pub": "foxbusiness", "url": "https://foxbusiness.com/media/fcc-cbs-fine-272000-eas-tone-young-sheldon", "downloaded_at": "2019-09-10 23:27:21.451191+00:00", "title": "FCC hammers CBS with $272,000 Fine", "language": "en", "text": "The Federal Communications Commission has no tolerance for the misuse of the Emergency Alert System.\n\nContinue Reading Below\n\nThe FCC proposed a $272,000 fine for CBS for allegedly airing a simulated emergency alert tone during an episode of “Young Sheldon” broadcast nationally on April 12, 2018, according to Variety.\n\n“Young Sheldon” is a sitcom starring Iain Armitage. He plays Sheldon Cooper, a 9-year-old High School student. The episode in question includes a sound effect accompanying a tornado warning, which resembled emergency alert system tones, the FCC said in a statement explaining the fine.\n\nThe current action comes on the heels of massive fines by the FCC in August when the government agency went after networks ABC, AMC, and Discovery for similar offenses on shows like, “The Walking Dead,” “Jimmy Kimmel Live!” and “Lone Star Law.” At that time, the FCC levied more than $600,000 in fines for abusing the alert system.\n\nThe FCC notification delivered to CBS is known as a Notice of Apparent Liability of Forfeiture which will give the offending network time to respond and defend its actions. The government agency will then have an opportunity to amend its ruling before formally handing down the fine.\n\nAdvertisement\n\nThe agency explained that the current actions against CBS for broadcasting simulated emergency tones during non-emergencies is not only a violation of FCC rules but it also creates a serious public safety concern especially during actual emergencies such as the damage caused by Hurricane Dorian during which emergency tones were used throughout affected areas.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nThe agency also said that CBS’ modifications to the EAS tones were still not permissible because the tones used in the episode of “Young Sheldon” were “substantially similar” to actual EAS tones.\n\nAn enforcement advisory from the FCC last month reiterated that broadcasting actual or simulated emergency tones during non-emergencies and outside of testing periods is an FCC violation and “serious public safety concern.”", "description": "FCC hits CBS with $272,000 fine over misuse of EAS tones.", "authors": ["Mike Cherico"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/Iain-Armitage-.jpg?ve=1&tl=1", "published_at": "2019-09-09"}