{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/17/england-jeetan-patel-spin-bowling-coach-new-zealand-tour", "downloaded_at": "2019-10-17 14:26:03.641275+00:00", "title": "England appoint Jeetan Patel as spin-bowling coach for New Zealand tour", "language": "en", "text": "• Warwickshire captain was capped 78 times by New Zealand • Saqlain Mushtaq’s coaching deal not being renewed\n\nEngland’s spinners will be able to draw on local knowledge in New Zealand after Jeetan Patel, the former international who captains Warwickshire, was hired on a short-term coaching deal.\n\nPatel, capped 78 times by New Zealand across all formats and the leading spinner in county cricket over the past decade, will be part of Chris Silverwood’s coaching setup during the five-match Twenty20 series that begins on 1 November in Christchurch.\n\nChris Silverwood brings more homely touch to England’s quest for success Read more\n\nSaqlain Mushtaq was previously England’s spin-bowling coach, having worked with the senior side, the Lions and the under-19s for 100 days per year. But it is understood the former Pakistan spinner’s deal is not being renewed.\n\nAshley Giles, the director of England cricket, knows Patel from his time at Warwickshire, first when head coach of the side that won Division One in 2012 and then latterly as the club’s sporting director.\n\nAn off-spinner by trade, the 39-year-old Patel will work with two leggies in Adil Rashid and the uncapped Matt Parkinson. Moeen Ali, who is on an agreed break from Test consideration, is also rested for the white-ball leg of the tour.\n\nPatel, due to meet the England squad in Christchurch next week, is keen to pursue coaching after he calls time on his playing career and has been granted special dispensation from New Zealand and Wellington to miss the first three matches of the Plunket Shield campaign.\n\nThe deal is the second to follow Silverwood’s appointment England’s new head coach last week, with Paul Collingwood having also signed permanently as an assistant coach after previously working on a series-by-series basis.\n\nSilverwood and Giles have now switched attention to the vacancy left by the former’s promotion; an interim fast‑bowling coach is being sought for the New Zealand tour before the pair consider candidates for the full-time position.", "description": "England’s spinners will be able to draw on local knowledge in New Zealand after Jeetan Patel, the former international who captains Warwickshire, was hired on a short-term coaching deal", "authors": ["Ali Martin"], "top_image": "https://i.guim.co.uk/img/media/89f07a76eba46756ac79ea5c06e8fa914b5d8ca7/0_38_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1744323fb50afddbda02ff75c12b037c", "published_at": "2019-10-17"}