{"pub": "theverge", "url": "https://theverge.com/2019/7/2/20677847/solar-eclipse-how-to-watch-total-live-stream-nasa-time-date", "downloaded_at": "2019-10-05 14:27:18.320204+00:00", "title": "How to watch today’s total solar eclipse if you’re not in a small portion of South America", "language": "en", "text": "This afternoon, another total solar eclipse will grace the skies over the Earth, but this time, most of the show will take place over the Pacific Ocean. Unlike the Great American Eclipse of 2017, which cut through the heart of the United States, this one will only be visible for a short stretch over the bottom of South America. Don’t fret: there are plenty of live streams that will provide coverage of the eclipse online for those who want their astronomical fix.\n\nSolar eclipses occur on average every 18 months or so, whenever the Moon passes directly between the Sun and Earth on its orbit around our planet. When this lucky alignment occurs, the Moon casts its shadow on select portions of the Earth. This region of darkness is known as the path of totality, and it forms a relatively narrow trail across the planet. Anyone standing within this path will see the Sun completely blocked by the Moon for minutes at a time. (Our explainer for the 2017 eclipse gives details on how it works, though the geography is different.)\n\nTomorrow is eclipse day! ☀️ For those in the path of the total solar eclipse, the Moon will block out the Sun's bright face, revealing the Sun's corona. We'll be sharing views from the path of totality starting at 3pm ET / 12pm PT on July 2: https://t.co/Tm367fCjSP pic.twitter.com/USFpEz169U — NASA Goddard (@NASAGoddard) July 1, 2019\n\nThis year’s path of totality will start in the middle of the southern Pacific at around 12:55PM ET, though the event won’t occur over any major land for anyone to see. Eventually, the Sun will start dimming over Chile at 3:22PM ET, with the first totality occurring over land at 4:38PM ET. The total eclipse will then pass through Argentina and end near Buenos Aires at 4:44PM ET, just before the Sun sets over the country.\n\nFor those who aren’t making the trek out to Chile and Argentina to see this, there are plenty of resources broadcasting the show. NASA will host live views from South America between 3 and 6PM ET, and the agency will provide coverage with commentary in both English and Spanish from 4 to 5PM ET. The Weather Channel will also be live-streaming between 4 and 5PM ET on its website. Slooh, which provides views from robotic telescopes, will offer live coverage from its observatories in Chile and Argentina between 3:15 and 5:40PM ET.\n\nThat means there are a few different options to see this eclipse virtually. And if for some reason you miss this eclipse, another one will pass through South America a little farther south than this one in 2020. The next big total solar eclipse to pass through North America is set for 2024, when the path of totality will cross from Mexico to Maine.", "description": "This afternoon, another total solar eclipse will grace the skies over the Earth, but this time, most of the show will take place over the Pacific Ocean. Unlike the Great American Eclipse of 2017, which cut through the heart of the United States, this one will only be visible for a short stretch over the bottom of South America. Don’t fret: there are plenty of live streams that will provide coverage of the eclipse online for those who want their astronomical fix.", "authors": ["Loren Grush", "Jul"], "top_image": "https://cdn.vox-cdn.com/thumbor/z4zLTLR4REZ32XkH_xDqe5s_W8M=/0x114:1779x1045/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18274610/1153136787.jpg.jpg", "published_at": "2019-07-02"}