{"pub": "washingtonpost", "url": "https://washingtonpost.com/technology/2019/09/23/facebook-removes-pro-trump-i-love-america-page-that-was-run-by-ukrainians", "downloaded_at": "2019-09-24 00:54:27.701621+00:00", "title": "Facebook removes pro-Trump ‘I Love America’ page that was run by Ukrainians", "language": "en", "text": "A Facebook page called “I Love America” that featured patriotic themes, rippling flags and pro-Trump memes was closed Monday after it turned out to be run by Ukrainians.\n\nFacebook took action against the page — which had 1.1 million followers — and several affiliated ones after a report in Popular Information, a politically themed online newsletter, detailed the page’s Ukrainian management and remarkable reach. The report said “I Love America” was founded in 2017 but had moved heavily into pro-Trump content and conservative memes in recent weeks, building a huge audience in the process.\n\nData showed the “I Love America” pages collectively generated tens of millions of “interactions,” a metric capturing how many people like, share or comment on a post, on par with several of the largest American news sites. “I Love America” also reposted memes from Russian sources, such as the Internet Research Agency, the St. Petersburg troll farm that faces criminal charges stemming from its efforts to manipulate the 2016 presidential election.\n\nThe problem of foreigners controlling political pages aimed at Americans is a persistent issue on Facebook. Macedonian businessmen ran the “Vets for Trump” Facebook page for several months after one of them hijacked it in March. It took until August for the longtime administrators — who were in fact veterans who supported President Trump — to regain control of the page.\n\n[The Facebook page ‘Vets for Trump’ was hijacked by a North Macedonian businessman]\n\nFacebook initially did not act against “I Love America,” according to Popular Information, which quoted the company saying that it didn’t violate the platform’s rules against “coordinated inauthentic behavior.” After the story spread widely on Monday, Facebook removed the page, citing alleged violations of its policies against spam and fake accounts.\n\n“We are removing these pages for violating our policies against spam and fake accounts and are continuing to investigate for any further violations,” Facebook spokesman Andy Stone said.\n\nFacebook removed nine pages in all, including several devoted to dogs and others with political content, including “I Love Jesus Forever” and “God Bless Donald Trump and God Bless America.” The pages appeared to work in concert by cross-posting content, according to Popular Information.\n\nFacebook said it had not detected links to any nation-state actor but that its investigation was still ongoing.\n\nAmong the several politically charged memes posted by “I Love America” was one showing the image of a grieving widow with text reading, “THOSE WHO DISRESPECT OUR FLAG HAVE NEVER BEEN HANDED A FOLDED ONE” — a reference to the flags given to the families of service members and veterans after they die. This meme was previously posted by the Internet Research Agency.", "description": "Facebook took action against the page — which had 1.1 million followers — and several affiliated ones after a report in Popular Information detailed the page’s Ukrainian management and remarkable reach.", "authors": ["Craig Timberg", "National Reporter Covering Technology", "September At Pm", "Craig Timberg Is A National Technology Reporter For The Washington Post. Since Joining The Post In", "He Has Been A Reporter", "Editor", "Foreign Correspondent", "He Contributed To The Post S Pulitzer Prize-Winning Coverage Of The National Security Agency."], "top_image": "https://www.washingtonpost.com/resizer/NQ0OqxYFF34nXPEKlXMn7GpuMnY=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DQJX3SDYXAI6TJ57ZCSDXBHOGE.jpg", "published_at": "2019-09-23"}