{"pub": "nationalreview", "url": "https://nationalreview.com/corner/donald-trump-and-masculinity-in-decline", "downloaded_at": "2019-10-05 06:18:14.752903+00:00", "title": "Donald Trump and Masculinity In Decline", "language": "en", "text": "President Donald Trump speaks at the National Prayer Breakfast in Washington, D.C., February 7, 2019. (Kevin Lamarque/Reuters)\n\nGlenn Beck is a friend of mine, but this is just nuts. From the Daily Beast:\n\nThe formerly anti-Trump Beck, speaking on his eponymous TheBlaze TV show, joined his pal Pat Gray for a discussion of the decline of masculinity and President Trump’s success in such a march toward progress: There are no examples of men being men. James Bond. That’s it. A movie. There’s no male role models. Would you agree with that? So Donald Trump: here’s a guy who marries a supermodel, is like, ‘Yeah, I can make it with any model I want.’ He’s over the top, but he fights back, he doesn’t flinch… he is the almost cartoon of an alpha dog. You know what I mean? And I think because we have taken alpha dogs and shot them all, when he comes to the table there’s a lot of guys that are out there goin’ ‘Damn right!’\n\nI’ve been arguing for a long time now that one of the problems with Trumpism is the way people feel the need to redefine their definitions of good character so that Trump can clear the bar. It’s like cutting a yardstick down to two feet so you can call something a yard long.\n\nThis tendency is wildly at odds with all of the people — many of the same people — who also argue that Trump’s personal shortcomings are irrelevant when measured against his policy victories. Logically, you can’t simultaneously argue that he’s a role model and that it doesn’t matter he’s not a role model. And yet people do it every day.\n\nI have no objection with the contention that Trump displays aspects of maleness that are unfashionable on parts of the left. But since when is picking a supermodel for your third wife an act of modeling ideal male behavior? Part of the argument of conservatism is that there will always be “alpha dogs” — i.e. leaders, role models, whatever — but that not all alpha dogs are equal. Mob bosses are alpha dogs. Stalin was an alpha dog. Harvey Weinstein is an alpha dog. You know who else was an alpha dog? George Washington, William F. Buckley Jr., Douglas MacArthur.\n\nGood men and bad men alike “fight back.” But the fighting back isn’t the ultimate measure of what makes them good. What they fight back about is. And how they fight back matters, too. Fighting back with insults, lies, and slander isn’t manly, it’s juvenile.\n\nThe masculinity that Donald Trump represents is not representative of what conservatives used to mean by good character. And to suggest otherwise trims another couple inches off the yardstick.", "description": "You can’t simultaneously argue that Trump's a role model and that it doesn’t matter he’s not a role model.", "authors": ["Jonah Goldberg", "Andrew C. Mccarthy", "Alexandra Desanctis", "Kevin D. Williamson", "Jim Geraghty", "John Yoo", "Kyle Smith", "David French", "Mairead Mcardle", "Read More"], "top_image": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2019/02/trump-prayer-breakfast.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-03-06"}