{"pub": "independent", "title": "Michael Jackson accuser Wade Robson responds to Dave Chappelle's 'disgusting' jokes about Leaving Neverland", "url": "https://independent.co.uk/arts-entertainment/tv/news/michael-jackson-wade-robson-dave-chappelle-leaving-neverland-sexual-abuse-a9082986.html", "language": "en", "published_at": "2019-08-28", "downloaded_at": "2019-09-02 09:05:23.168021+00:00", "text": "Wade Robson, one of the two men who accused Michael Jackson of sexual abuse in the Leaving Neverland documentary, has responded to Dave Chappelle‘s new skit about the matter, calling it “disgusting”.\n\nChappelle brings up the HBO documentary in his new Netflix special Sticks and Stones, released on Monday.\n\nIn the Netflix special, Chappelle says of Robson and James Safechuck (the other man who testifies in Leaving Neverland): “I don’t believe these motherf***ers.”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHe goes on to mock Robson and Safechuck’s allegations, saying at one point: “I mean, it’s Michael Jackson. I know more than half the people in this room have been molested in their lives, but it wasn’t no goddamn Michael Jackson, was it?\n\n“This kid got his d*** sucked by the King of Pop. All we get is awkward Thanksgivings for the rest of our lives. You know how good it must have felt to go to school the next day after that s****?”\n\nShape Created with Sketch. Leaving Neverland – photos show Michael Jackson with his accusers Show all 9 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Leaving Neverland – photos show Michael Jackson with his accusers 1/9 Michael Jackson with accuser Wade Robson Sundance Insitute 2/9 Accuser Wade Robson meeting Michael Jackson for the first time Channel 4 3/9 Michael Jackson with the Robson family Channel 4 4/9 Michael Jackson at the home of accuser James Safechuck Channel 4 5/9 Dan Reed approached the Michael Jackson documentary with 'all the scepticism and rigorousness that I would approach a story about a terrorist attack' Channel 4 6/9 Michael Jackson leaves the courtroom on a break at the Santa Barbara County Courthouse for the second day of closing arguments in his child molestation trial in Santa Maria, California, 2005 AFP/Getty 7/9 Michael Jackson accuser Wade Robson Channel 4 8/9 James Safechuck, another of Jackson's accusers Channel 4 9/9 Leaving Neverland director Dan Reed Channel 4 1/9 Michael Jackson with accuser Wade Robson Sundance Insitute 2/9 Accuser Wade Robson meeting Michael Jackson for the first time Channel 4 3/9 Michael Jackson with the Robson family Channel 4 4/9 Michael Jackson at the home of accuser James Safechuck Channel 4 5/9 Dan Reed approached the Michael Jackson documentary with 'all the scepticism and rigorousness that I would approach a story about a terrorist attack' Channel 4 6/9 Michael Jackson leaves the courtroom on a break at the Santa Barbara County Courthouse for the second day of closing arguments in his child molestation trial in Santa Maria, California, 2005 AFP/Getty 7/9 Michael Jackson accuser Wade Robson Channel 4 8/9 James Safechuck, another of Jackson's accusers Channel 4 9/9 Leaving Neverland director Dan Reed Channel 4\n\nRobson responded to Chappelle’s bit in remarks to TMZ, telling the website he found Chappelle’s content “disgusting, irresponsible and inexcusable”.\n\nAccording to the website, Robson said he doesn’t personally care whether Chappelle believes him, but believes ”we can and should do better than this”.\n\nLeaving Neverland was released in March 2019.\n\nIt has since earned five Emmy nominations, including one for Outstanding Documentary or Nonfiction Special.\n\nThe ceremony will take place on 22 September.\n\nThe Independent has contacted Netflix for comment.", "description": "Wade Robson, one of the two men who accused Michael Jackson of sexual abuse in the Leaving Neverland documentary, has responded to Dave Chappelle‘s new skit about the matter, calling it “disgusting”. Chappelle brings up the HBO documentary in his new Netflix special Sticks and Stones, released on Monday.", "authors": ["Clémence Michallon"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/28/21/screen-shot-2019-08-28-at-4.09.00-pm.png"}