{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/boris-johnson-pledges-win-christmas-election-deliver-new-year-brexit-11008775", "downloaded_at": "2019-10-30 07:54:29.310955+00:00", "title": "Boris Johnson pledges to win Christmas election and deliver New Year Brexit", "language": "en", "text": "Prime Minister Boris Johnson leaves the Houses of Parliament after winning an election vote (Picture: Reuters)\n\nIt was fourth time lucky for the Prime Minister last night as he secured support for a 12 December election at the eleventh hour.\n\nBoris Johnson has pledged to win the election before Christmas and finally take Britain out of the EU at the start of the New Year.\n\nThe PM has said he is prepared for a ‘tough’ election battle after MPs cleared the way for the first December poll in almost a century.\n\nMr Johnson left Westminster last night with a smile on his face after attempting to rally Tory MPs by telling them it was time to ‘get Brexit done’.\n\nAfter passing in the Commons, the one-page Bill enabling the election to be held on 12 December now goes to the House of Lords, but it is unlikely to be held up in the unelected upper chamber.\n\nAdvertisement\n\nAdvertisement\n\nOnce it receives the royal assent, it will pave the way for Parliament to be dissolved on 6 November, marking the start of the campaign in earnest.\n\nIn the end, the Bill passed the Commons by 438 votes to 20 – although a vote to alter the date, which Downing Street warned would scupper the whole thing, was much closer with a Government majority of just 20.\n\nMr Johnson admitted it will be a ‘tough’ election (Picture: AFP)\n\nLabour leader Jeremy Corbyn said the election is a ‘once-in-generation’ chance to transform the country (Picture: PA)\n\nThe Conservatives go into the campaign in buoyant mood, with one opinion poll at the weekend putting them 16 points ahead of Labour.\n\nAddressing his MPs at Westminster however, Mr Johnson cautioned against any complacency.\n\nHe said: ‘It’s time for the country to come together, get Brexit done and go forward.\n\n‘It’ll be a tough election and we are going to do the best we can.’\n\nThe Prime Minister is aiming to restore the Tories’ Commons majority lost by Theresa May in 2017 so he can finally end three years of deadlock and get his Brexit deal through Parliament.\n\nBut he faces an uphill battle as he failed to deliver on his promise to deliver Brexit by 31 October ‘do or die’.\n\nNigel Farage’s Brexit Party is expected to give the Tories are tough challenge and the Conservatives may suffer at the ballot box if the NHS is hit by a winter flu crisis.\n\nA pre-Christmas poll means voter turnout is likely to be down due to the dark December nights.\n\nA final thumbs up from the PM as he enters Number 10 late last night (Picture: Reuters)\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nJeremy Corbyn finally decided to back the election bid yesterday, saying it offered a ‘once-in-generation’ chance to transform the country.\n\nAdvertisement\n\nAdvertisement\n\nIt was the Labour leader’s decision which enabled Mr Johnson to get it through the Commons.\n\nHe had been under intense pressure to relent after the Liberal Democrats and the SNP said at the weekend that they would be prepared to support a December poll.\n\nHowever, many Labour MPs are deeply unhappy at the prospect fearing that they are heading for another election defeat.\n\nOnly 127 of the party’s 244 MPs voted for the election while more than 50 signed an amendment calling for the poll to be delayed until May 2020.\n\nMr Corbyn sought to characterise the election as a contest between Conservatives ‘who think they are born to rule’ and Labour’s programme of radical reform.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "It was fourth time lucky for the Prime Minister last night as he secured support for a 12 December election at the eleventh hour. Boris Johnson has pledged to win...", "authors": ["Zoe Drewett"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_93729627_1572419914.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-30"}