{"pub": "arstechnica", "url": "https://arstechnica.com/science/2019/10/virgin-galactic-reaches-deal-to-fly-italian-researchers-into-space", "downloaded_at": "2019-10-05 11:04:35.201989+00:00", "title": "Italy signs an agreement to fly on VSS Unity for research missions", "language": "en", "text": "On Wednesday, Virgin Galactic signed an agreement with the Italian Air Force to have humans fly on board its suborbital spacecraft and conduct scientific research.\n\nThe deal marks the first time a government has bought a ride on a private, suborbital space mission to conduct any kind of human-led experiments. The first research flight could take place as early as next year, the company said.\n\n“We’re delighted to work with the Italian Air Force to further space-based research and technology development through this historic mission,\" Virgin's chief executive, George Whitesides, said in a news release.\n\nDuring such a mission, the VMS Eve aircraft will release the rocket-powered VSS Unity spacecraft in flight, after which the vehicle will fire its engines to ascend to an altitude above 80km. After the rocket motor shuts down, researchers can then get out of their seats to work during a few minutes of microgravity. The tests the researchers plan to do include studying the biological effects of the transitional phase from gravity to microgravity on the human body and better understanding the chemistry of green fuels.\n\nThe announcement is significant for a couple of reasons. First, with a notional mission date of 2020, it buttresses the idea that Virgin Galactic may finally move into commercial operations with VSS Unity next year. The agreement also suggests that there may be a fairly robust market for suborbital spaceflight research.\n\nTo date, Virgin has conducted two spaceflights with VSS Unity. In December 2018, and then February 2019, the company flew its spacecraft to an altitude of 82.2 and 89.9km, respectively. Since the February flight, the company has been readying the spacecraft for commercial operations, including modifying the interior of the vehicle.", "description": "The first research flight could take place as early as next year.", "authors": ["Eric Berger"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/10/unitu1-760x380.jpg", "published_at": "2019-10-02"}