{"pub": "businessinsider", "url": "https://businessinsider.com/samba-tv-acquires-dtc-focused-data-sharing-firm-wove-2019-10", "downloaded_at": "2019-10-11 19:46:49.315129+00:00", "title": "An ad-tech firm has acquired a startup to help teach big brands direct-to-consumer tricks", "language": "en", "text": "Ad-tech firm Samba TV has acquired Wove to help advertisers use first-party data in targeting and measuring TV ads.\n\nWove, which works with direct-to-consumer brands like Frey, Plated, and Parachute, helps advertisers anonymously share data that's used for ad targeting in email and social media campaigns.\n\nWove is the third company that Samba TV has bought in the past year to solve advertisers' problems like frequency capping and measurement, said Samba TV CEO and co-founder Ashwin Navin.\n\nClick here for more BI Prime stories.\n\nAs more marketers shift towards using first-party data to target ads, TV measurement firm Samba TV is acquiring Wove, a small data firm that specializes in helping direct-to-consumer companies manage data.\n\nWove helps DTC companies share anonymized customer data with each other so they can target better. For example, DTC laundry brand Frey uses Wove to share lookalike audiences with other brands, Adweek reported in May. According to its website, Wove's clients also include big DTC brands Parachute, Plated, and ClassPass.\n\nUntil now, Wove has focused on email and social advertising and will now build data products that help marketers advertise on TV using first-party data, according to Ashwin Navin, CEO and co-founder of Samba TV.\n\nIn one example, he said Wove's technology will be able retarget web surfers with TV ads.\n\nWove has raised $12 million and is founded by former Liveramp employees Eddie Siegel, Armaan Sarkar, and Chris Taylor.\n\nWith privacy regulation growing, big platforms like Facebook and Google are favoring first-party data in their advertising products. Navin also said marketers are starting to question the accuracy of third-party data.\n\n\"The problem with over-the-top television is that it's not cookie-based and it's generally not targeted today,\" he said. \"If it's going to be targeted and measured in the future, it will be with first-party data.\"\n\nRead more: Sweeping regulations like California's upcoming privacy bill threaten to wipe out the advertising industry. These 10 tech companies are trying to help marketers survive.\n\nSambaTV wants to fix problems like frequency capping and measurement\n\nNavin wouldn't disclose terms of the deal but said it's being funded using Samba TV's Series B funding of $30 million in 2017. Samba TV used the fund to acquire two other companies in the past year: Screen6 and Axwave.\n\nNavin said Samba TV has broke even for \"a number of years,\" and that the acquisitions are meant to fill targeting and measurement holes in Samba TV's tech stack.\n\nScreen6's ID software matches advertisers' data to cap the number of ads people see in a given timeframe. Axwave tracks when and where ads on linear and connected TVs run, which Samba TV matches with its own viewership data to analyze reach and frequency, Navin said.\n\n\"We believe strongly in the potential of using first-party data in the television space and over-the-top,\" he said. \"We think that model is going to be much more privacy-compliant and valuable to advertisers and consumers.\"", "description": "Wove is the third company that Samba TV has bought in the past year to tackle advertisers' issues like frequency capping and measurement.", "authors": ["Lauren Johnson"], "top_image": "https://image.businessinsider.com/5d94ee3f950a860f4819e584?width=1200&format=jpeg", "published_at": "2019-10-11"}