{"pub": "npr", "url": "https://npr.org/2019/09/26/764664179/boeing-assumed-737-max-pilots-could-quickly-respond-to-cockpit-warnings-ntsb-say", "downloaded_at": "2019-09-26 20:48:03.928839+00:00", "title": "Boeing Assumed 737 Max Pilots Could Quickly Respond To Cockpit Warnings, NTSB Says", "language": "en", "text": "Boeing Assumed 737 Max Pilots Could Quickly Respond To Cockpit Warnings, NTSB Says\n\nEnlarge this image toggle caption Elaine Thompson/AP Elaine Thompson/AP\n\nFederal transportation investigators say Boeing should reevaluate the way it prepares pilots to respond to emergencies and faulted the aircraft maker for making assumptions about the design of cockpit systems in the first safety analysis released since two crashes of 737 Max planes killed 346 people.\n\nThe National Transportation Safety Board on Thursday issued seven recommendations after probing the events that led up to crashes in Indonesia and Ethiopia, when aircraft design flaws took the planes into steep dives that pilots were unable to correct.\n\nNTSB investigators concluded that Boeing underestimated a pilot's response time to a plane's nose pitching down. A key assumption, the report found, was that pilots could quickly figure out what was wrong and correct for it amid multiple and cascading error messages.\n\n\"Thus, the NTSB concludes that aircraft systems that can more clearly and concisely inform pilots of the highest priority actions when multiple flight deck alerts and indications are present would minimize confusion and help pilots respond most effectively,\" the report says.\n\nIn both crashes, the \"stick shaker\" was activated, which rattles a cockpit's control columns, in addition to other lights flashing and alert sounds.\n\nThe Max planes have been grounded since March, when a Boeing 737 Max 8 operated by Ethiopian Airlines crashed, killing all 157 passengers aboard. Five months earlier, another Max 8 jet, operated by Indonesia's Lion Air, crashed after departing Jakarta, killing 189 people. In each incident, failing automated anti-stall systems miscalculated the position of the plane's nose, causing the planes to plunge from the sky.\n\nThe report found that \"neither Boeing's system safety assessment nor its simulator tests evaluated how the combined effect of alerts and indications might impact pilots' recognition of which procedure(s) to prioritize.\"\n\nNTSB Chairman Robert Sumwalt said in a statement that the crews in the planes did not react in the ways Boeing and federal aviation officials had anticipated.\n\nThe incorrect assumptions \"were used in the design of the airplane and we have found a gap between the assumptions used to certify the MAX and the real-world experiences of these crews, where pilots were faced with multiple alarms and alerts at the same time,\" Sumwalt said.\n\nThe safety board asked the Federal Aviation Administration to examine whether other aircraft were approved without taking into account how the design of alarm systems could distract pilots from quickly regaining aircraft stability.\n\nInvestigators also recommended that the FAA notify international regulators about alarm system vulnerabilities highlighted in the report.", "description": "Safety board Investigators concluded that Boeing underestimated pilot response time to multiple and cascading error messages resulting from the airplane's automated stall-prevention system.", "authors": [], "top_image": "https://media.npr.org/assets/img/2019/09/26/ap_19227823689191_wide-02f88825556a441fa56d94c183f455cb2713998b.jpg?s=1400", "published_at": "2019-09-26"}