{"pub": "news.com.au", "url": "https://news.com.au/video/id-5348771529001-6097624822001/EXCLUSIVE--Clements-says-Bill-Shorten-knew-of-massive-Chinese-donations", "downloaded_at": "2019-10-25 22:22:27.725381+00:00", "title": "news.com.au — Australia’s #1 news site", "language": "en", "text": "The former boss of NSW Labor has claimed then-opposition leader Bill Shorten was aware of donations from sources linked to the Chinese community during the 2016 federal election campaign. In an exclusive interview with Sky News, Jamie Clements claimed Mr Shorten and other MPs knew about the handouts. Mr Clements was asked by Sky News host Sharri Markson about whether Mr Shorten and other MPs had knowledge of the donations. “Of course they did,” Mr Clements said. “At the end of the day, it was the campaigns for their seats. It was Bill Shorten's campaign to become prime minister those donations were funding, of course.\" Mr Clements gave evidence to the ICAC earlier this month on a separate matter - about $100,000 in cash delivered to NSW Labor headquarters in an Aldi shopping bag while he was general secretary in 2015. He did not suggest that Mr Shorten knew about the $100,000 donation specifically. Mr Clements is now calling for the party to reform - providing a written submission to the party's internal review. A spokesperson for Bill Shorten told Sky News “Bill Shorten was the first party leader to ban foreign donations from these guys – before the Liberals. The ICAC investigation said explicitly this investigation was not into Mr Shorten. He had no personal knowledge of the NSW donation splitting controversy aired at ICAC. Huang & Lok donated to both major parties and Liberal figures such as Peter Dutton attended lunch with Huang.” Image: News Corp Australia", "description": "Watch the Latest News.com.au Videos including Featured News Videos and Sports Videos and News Highlights. View more News.com.au Videos and Breaking News and Featured Entertainment Videos online at News.com.au", "authors": [], "top_image": "https://news.com.au/wp-content/themes/vip/newscorpau-nca/assets/dist/img/common/favicon/favicon-1024x1024.png", "published_at": "2019-10-25"}