{"pub": "fox", "url": "https://foxnews.com/entertainment/kanye-west-kim-kardashian-backlash-comments-sexy-clothes", "downloaded_at": "2019-10-25 22:28:44.285274+00:00", "title": "Kanye West addresses Kim Kardashian backlash after he commented on wife's 'sexy' clothes", "language": "en", "text": "Kanye West addressed the backlash he received after commenting on his wife, Kim Kardashian-West, wearing sexy clothes that he said affected his soul.\n\nThe “Jesus is King” rapper addressed the issue in an interview for Neats 1’s Zane Lowe on Apple Music after he caught heat earlier this month when an episode of “Keeping Up With the Kardashians” depicted him questioning Kim’s Thierry Mugler corset dress for the 2019 Met Gala.\n\n“I suffer and I appreciate the suffering because we can feel a little bit of what Jesus experienced, but I suffer on social media,” West explained (via People). “There are other married men that I know are happy to hear me say that.\n\nKANYE WEST DISCUSSES PORN ADDICTION, BANNED 'JESUS IS KING' TEAM FROM PREMARITAL SEX\n\n“Social media prompts women, in particular, to put out content that they wouldn’t in the past,” he added. “When I was younger and I wanted to see something like that I had to pay someone who was older … Now I have friends who have kids in high school and it’s readily available.”\n\nOn the hit reality series’ Oct. 13 episode, it was revealed that West was upset with his wife over the skintight look and triggered her anxiety.\n\n\"Like the corset, underwear, all that vibe, I just feel like I just went through this transition of being rapper, and lookin' at all these girls,\" Kanye said to Kim back in May (via People). \"And then looking at my wife like, 'Oh, my girl needs to be just like these other girls, showing her body off, showing this, showing that'... I didn't realize that that was affecting my soul and my spirit as someone that's married and loved, the father of what's about to be four kids. A corset is a form of underwear. It's hot. It's like, it's hot for who though?\"\n\nKANYE WEST ON FINDING FAITH DURING 2016 HOSPITALIZATION: I’M ‘NOW A SON OF GOD’\n\nThe makeup and fashion mogul retaliated in her own defense, saying \"The night before [the Met Gala] you're going to come in here and say you're not into the corset look? You're giving me really bad anxiety... I don't need any more negative energy.\"\n\nTo that, Kanye replied, \"You are my wife and it affects me when pictures are too sexy.\"\n\nKardashian-West fired back and ended the argument by saying, \"You built me up to be a sexy person and have confidence! Just because you're on a journey and you're in a transformation, doesn't mean I'm in the same spot with you.\"\n\nAfter that, a visibly upset Kanye stormed out of the room muttering, “OK.”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nHowever, it seems that the argument eventually blew over and the superstar couple posed together on the red carpet at the Met Gala. Kardashian's \"wet\" look went on to be one of the most famous and discussed looks of the evening.\n\nFox News' Viktoria Ristanovic contributed to this report.", "description": "Kanye West addressed the backlash he received after commenting on his wife, Kim Kardashian-West, wearing sexy clothes that he said affected his soul.", "authors": ["Tyler Mccarthy"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/AP-Kanye-West-Service.jpg", "published_at": "2019-10-25"}