{"pub": "breitbart", "url": "https://breitbart.com/the-media/2019/10/30/ann-coulter-hes-a-one-man-ukrainian-lobby", "downloaded_at": "2019-10-30 23:25:29.542179+00:00", "title": "Ann Coulter: Alexander Vindman, the One-Man Ukrainian Lobby", "language": "en", "text": "As a guest at a dinner party in Georgetown, I stormed in and started bossing everyone around.\n\nFirst, I demanded that the foyer be painted a different color and wainscoting be added to the dining room. Then I had my hosts assemble their children so I could give them all different names. Before making my exit, I grabbed two legs of turkey off the entree platter and stuffed them in my purse.\n\nI have a second confession. None of that happened. But if it had, I would be exactly like Lt. Col. Alexander S. Vindman.\n\nHe was born in Ukraine and raised there until age 3 1/2, when he was invited to our country. As you’ve no doubt heard, he served in our military. Thank you for your service, Colonel!\n\nNow he is the top Ukrainian adviser on the National Security Council. Of all the people who could look out for the U.S.’s interests vis-a-vis Ukraine, we got someone who was born there.\n\nAs such, Vindman was permitted to listen to a phone call the president of the United States made to the president of Ukraine — a completely unnecessary, pro forma task.\n\nSo, naturally, when he had a policy disagreement with President Trump pertaining to the country he was born in, he thought he had a responsibility to agitate for removal proceedings against the duly elected U.S. president, just as I might have taken issue with the carpets in the Georgetown townhouse.\n\nFor some reason, we keep hearing about Col. Vindman’s valor and patriotism. I don’t doubt that he’s a super swell guy. But unless I missed it in the newspapers at the time, I don’t believe he was elected president in 2016. In fact, there’s a specific constitutional provision that prevents Col. Vindman from ever being president: He wasn’t born here.\n\nStudy question: Why might the framers have added that clause?\n\nIt would be bad enough if Col. Vindman’s policy disagreement with the president had to do with U.S. policy on Mexico or North Korea. But it was about the country where Col. Vindman was born.", "description": "Ann Coulter writes: \"there's a specific constitutional provision that prevents Alexander Vindman from ever being president: He wasn’t born here.\"", "authors": ["Ann Coulter"], "top_image": "https://media.breitbart.com/media/2018/05/coulter-headshot-640x480-640x480.jpg", "published_at": "2019-10-30"}