{"pub": "thenextweb", "url": "https://thenextweb.com/gaming/2019/10/14/fortnite-black-hole", "downloaded_at": "2019-10-14 23:16:48.268758+00:00", "title": "With shit-all else to do, Fortnite goes on vacation", "language": "en", "text": "Fortnite‘s done gone and destroyed its own world, booting all of its battle royale-addicted players out of their wonderlands and into the black void of space. I guess when you’ve conquered everything, it stands to reason you’d take a little vacation — and in the meantime we’re all staring at a black hole.\n\nLast night, as the coup de grace of Fortnite‘s tenth season, a black hole sucked up the entire map and booted all of its players out. Fortnite has effectively gone dark — the official Twitch channel is showing nothing but the black hole surrounded by swirling blue mist. No one’s exactly sure when it’s going to come back, though of course everyone’s losing their collective minds trying to figure it out. Remember when Overwatch used to drum up interest in its newest characters with hints designed to provoke wild, speculative guessing IRL (the Sombra ARG being the best it ever got)? Yeah, this is a lot like this, only somewhat more cosmic in scope.\n\nDid your @fortnitegame suck you & everything else into a black hole? Can’t help you there. But death-by-black-hole is a thing, and there might even be an entire universe on the other side.https://t.co/Toio6gpgdv — Neil deGrasse Tyson (@neiltyson) October 13, 2019\n\nFortnite is, of course, still one of the world’s most popular games (if not the most), meaning there are a lot of players now with not much else to do. I’m not sure if the devs just wanted a vacation, or if they were tired of everyone knowing the secrets of the map and wanted to start fresh. Either way, the black hole is actually kind of tranquil the longer you look at it.\n\nIf you’re not aware, Fortnite has these bizarre cataclysms every now and then. My personal favorite was the arrival of Thanos and the Infinity Gauntlet, because I’m a sucker for a good marketing partnership. To give developer Epic Games some credit, it seems to have realized its primary enemy isn’t another game, but boredom. The onslaught of time and ennui can kneecap even the world’s most successful game. So it throws these big old digital monkey wrenches into the works at least once a season.\n\nThe gaming world seems to be split primarily into two people: those who still play Fortnite religiously, and those who left it behind a while back. At least, that’s the impression you’d get from those in the latter camp, as the joke surrounding the black hole swiftly centered around one punchline: “Fortnite players have to go outside/find other games/get lives/do literally anything else.”\n\nWe have better holes to stare at than #Fortnite — Pornhub ARIA (@Pornhub) October 13, 2019\n\nStill, this isn’t the first time Fortnite players have been forced to find a way of occupying themselves — the game’s gone down for maintenance before. I’d kill to see if Apex Legends or Realm Royale are experiencing a monumental upsurge in users right now as the battle royale junkies hunt for their next fix.\n\nIs it a publicity stunt? Oh, indubitably. Is it still a pretty hilarious way to simultaneously reset the map and give the massive player base a chance to poke their heads out of their metaphorical groundhog burrows? Heck yes it is.\n\nRead next: The Google Nest Mini sure looks a lot like the Home Mini", "description": "Fortnite has hit the mother of all reset buttons by destroying its map with a black hole. Now its players are left with not much to do.", "authors": ["Rachel Kaser"], "top_image": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2FFortnite-Black-Hole.jpg&signature=1c388c70cfddd6072741ac42de965617", "published_at": "2019-10-14"}