{"pub": "japantoday", "url": "https://japantoday.com/category/tech/focus-more-businesses-turn-to-mixed-reality-technology-in-employee-training", "downloaded_at": "2019-10-23 10:53:29.815008+00:00", "title": "More businesses turn to mixed-reality technology in employee training", "language": "en", "text": "By Junko Horiuchi\n\nCorporate Japan's growing need to rely on new technologies to cope with a shrinking workforce was on show at the recently held CEATEC technology exhibition in Tokyo, with service industry companies turning out in greater numbers this year.\n\nAs more and more skilled workers reach retirement across various industries in rapidly graying Japan, businesses are turning to new technologies to hand down field experience and knowledge to younger workers.\n\nEast Nippon Expressway Co, operator of expressways and toll roads in Japan, is one of the companies adopting \"mixed reality\" technology as it seeks to boost training of inspection and maintenance personnel.\n\n\"We are increasingly required by the government to conduct checks on roads but our skilled workers are aging and cannot work at their fullest anymore. So we needed to rely on high tech to share and pass on their know-how to the younger employees,\" said Masaki Ishiguro, official in charge of maintenance at the firm, also known as Nexco East.\n\nThe Tokyo-based company demonstrated its technology for inspecting the inside of infrastructure facilities where human eyes cannot reach at the Combined Exhibition of Advanced Technologies, held earlier this month.\n\nIn Nexco's initiative, a person wearing a headset equipped with cameras and sensors can see the internal structures of bridges and roads such as reinforced steel bars, foundations and cylindrical frameworks.\n\n\"It is crucial to understand the inside structures of bridges and roads for maintenance and inspection and to detect damage and cracks in girders or hollow cavities in lining surfaces of tunnels,\" Ishiguro said.\n\n\"But making judgements about these structures by solely referring to paper drawings is difficult, especially for younger, inexperienced workers,\" he said. \"So we would have a skilled worker train the employees using the headset. They learn a lot faster and better.\"\n\nPreviously, skilled workers and younger employees repeatedly conducted training at actual sites. But this is becoming a thing of the past as more skilled inspectors reach retirement age and the number of facilities needed to be checked continues to increase due to aging, Ishiguro said.\n\nANA Holdings Inc, meanwhile, is going beyond its traditional field as an airline and developing avatar robotics technology in cooperation with other firms and local governments to offer new services.\n\nIt has developed an avatar robot called \"newme,\" which has a tablet-sized monitor on a stick-like body that is controlled remotely. The tablet shows the real-time facial expressions of the operator through video.\n\nThe airline, also grappling with a shortage of staff, said trainers for flight attendants can give lectures via the newme robots to employees at various locations.\n\n\"We can share intelligence and skills instantaneously by using avatar robotics technology,\" said ANA Holdings CEO Shinya Katanozaka in his speech at CEATEC, adding the company is also developing other types of avatar such as one with a robotic hand.\n\n\"For example, a globally acclaimed chef can give lectures on cooking or a top doctor can train those seeking to become doctors simply by connecting him or herself to the avatars located remotely.\"\n\nAstellas Pharma Inc. and a Japanese unit of Microsoft Corp have jointly developed a tool to support communication between doctors and patients by using mixed-reality technology.\n\nA patient wearing Microsoft's HoloLens headset can see precision-level three-dimensional graphics of their own body parts in consultation with doctors.\n\n\"It really puts us in the center of the decisions that we have to make about our own care,\" said Rodney Clark, vice president of IoT sales at Microsoft during a speech at CEATEC. \"That's really critical as we move forward from a medical perspective.\"\n\nAstellas said it hopes the mixed-reality technology will allow patients to better understand their illnesses and treatments.\n\n© KYODO", "description": "Corporate Japan's growing need to rely on new technologies to cope with a shrinking workforce was on show at the recently held CEATEC technology exhibition in Tokyo, with service industry companies turning out in greater numbers this year. As more and more skilled workers reach retirement across various industries in…", "authors": ["Jj Jetplane", "Melissa Shimosato", "No Business"], "top_image": "https://japantoday.com/images/japan-today-social.jpg", "published_at": "2019-10-22"}