{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201909202965/market-snapshot-dow-and-sp-500-set-to-test-record-highs-as-trump-administration-said-to-exempt-china-products-from-tariffs", "downloaded_at": "2019-09-20 12:54:50.255449+00:00", "title": "MARKET SNAPSHOT: Dow And S&P 500 Set To Test Record Highs As Trump Administration Said To Exempt China Products From Tariffs", "language": "en", "text": "By Mark DeCambre, MarketWatch\n\nQuadruple witching day on Wall Street\n\nU.S. stocks on Friday were on track to open near records as investors looked beyond a litany of central-bank decisions of the past week and focused on signs of improving China-U.S. trade developments.\n\nHowever, some investors expect some volatility in the market given it's quadruple witching day On Wall Street, the quarterly expiration of futures and options on indexes and stocks at the same time, sometimes spurring volatility and higher volumes.\n\nHow are markets performing?\n\nFutures for the Dow Jones Industrial Average were climbing 60 points, or 0.2%, at 27,138, those for the S&P 500 rose 7.10 points, or 0.2%, to 3,015, while Nasdaq-100 futures advanced 24.75 points to reach 7.942.75, a climb of 0.3%.\n\nOn Thursday (link), the Dow fell 52.29 points, or 0.2%, to end at 27,094.79, while the S&P 500 index clung to a gain of 0.09 point, or less than 0.1%, to close at 3,006.82. The Nasdaq Composite Index added 5.49 points, or 0.1%, finishing at 8,182.88. The S&P 500 traded as high as 3,021.99 earlier Thursday -- within striking distance of its all-time closing high of 3,025.86 set on July 26.\n\nWhat's driving the market?\n\nWall Street stocks were trending upward to end the week, with reports that President Donald Trump was exempting hundreds of Chinese products from tariffs, according to Politico (link), citing documents from the U.S. Trade Representative, which indicate that Christmas tree lights, pet supplies and plastic straws are among some of the products being exempted.\n\nThe exemption list is set to be published later Friday by the USTR, according to CNBC (link), with the move, perhaps, offering a modicum of optimism for investors.\n\nThe exemptions also come as lower-level Washington and Beijing delegates are meeting for a second day to set the stage for more substantive tariff talks in early October\n\nMeanwhile, St. Louis Federal Reserve President James Bullard explained his dissent from the Federal Open Market Committee's decision on Wednesday to reduce rates by a quarter of a percentage point, marking the second rate cut in as many Fed meetings. Bullard, in a statement released Friday morning, said he advocated for a more substantial 50 basis-point cut because he thinks the manufacturing sector already appears to be in recession.\n\nBullard said \"signs that the U.S. economic growth is expected to slow in the near horizon,\" in his statement on the St. Louis Fed's website (link).\n\nOn Wednesday, during a news conference to discuss the rate decision, Fed Chairman Jerome Powell said the central bank would do what was needed to keep the U.S.'s economic expansion going.\n\nThat appeared to include increasing the Fed's balance sheet, if only to address a recent spike in short-term, money-market rates and add more liquidity to Wall Street. \"It is certainly possible that we will need to resume the organic growth of the balance sheet earlier than we thought,\" Powell said. \"We'll be looking at this carefully in coming days and taking it up at the next meeting,\" he said.\n\nBeyond Bullard' statement, a number of Fed speakers are on deck, including New York Federal Reserve Bank President John Williams, who will speak in Zurich at 8:15 Eastern Time about monetary policy.\n\nBoston Federal Reserve Bank President Eric Rosengren, who was one of the dissenters in Wednesday's Fed decision, advocated for holding rates steady, will speak at 11:20 a.m. at New York University, while Dallas Federal Reserve Bank President Robert Kaplan is slated to participate in a question-and-answer at 1 p.m. in Texas.\n\nHow did other markets trade?\n\nIn commodities, oil futures rose, with West Texas Intermediate crude for October delivery on the New York Mercantile Exchange rose 61 cents, or 1.1%, to trade at $58.79 a barrel.\n\nGold rose 0.3% to trade at $1,510.90 an ounce, while the U.S. dollar, as measured by the ICE U.S. Dollar Index , a gauge of the buck against a basket of leading rivals, edged 0.1% higher.\n\nBond yields rose Thursday afternoon. The 10-year U.S. note was little changed at 1.779%, while the 2-year was slightly higher at 1.747%.\n\n(END) Dow Jones Newswires\n\nSeptember 20, 2019 07:40 ET (11:40 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-09-20"}