{"pub": "yahoo", "url": "https://news.yahoo.com/us-meets-china-russia-pakistan-164025584.html", "downloaded_at": "2019-10-26 11:18:18.444345+00:00", "title": "US meets China, Russia and Pakistan to talk Afghan peace", "language": "en", "text": "FILE - In this Feb. 8, 2019, file photo, Special Representative for Afghanistan Reconciliation Zalmay Khalilzad at the U.S. Institute of Peace, in Washington. Representatives of Russia, China, the United States and Pakistan have agreed that negotiation is the only road to peace in Afghanistan, including an early resumption of direct U.S. talks with the Taliban. In a statement released at the end of meetings in Moscow on Friday, Oct. 25, China, Russia and Pakistan called on Washington to return to the negotiation table with the Taliban and sign an agreement that will set the stage for Afghans on both sides of the protracted conflict to start face-to-face discussions on what a post-war Afghanistan would look like. Khalilzad had a preliminary peace deal with the Taliban until President Donald Trump in September declared the talks dead after a series of attacks killed several people, including a U.S. soldier. (AP Photo/Jacquelyn Martin, File)\n\nISLAMABAD (AP) — Representatives of Russia, China, the United States and Pakistan have agreed that negotiation is the only road to peace in Afghanistan, including an early resumption of direct U.S. talks with the Taliban.\n\nThe day-long talks in Moscow on Friday came ahead of an intra-Afghan dialogue to be hosted by China. The Beijing talks, which initially were to be held next week, have been postponed, according to officials familiar with the talks. Speaking on condition they not be identified because of they were not authorized to talk about the subject, they said the postponement would be brief but no new date was given.\n\nWhen the China talks take place, they will be the first face-to-face discussions between Afghan warring sides since July. Even President Ashraf Ghani, who has objected to any talks not led by his government, said late Friday that he would send representatives.\n\nThere has been no official announcement of a postponement, but previous intra-Afghan talks have been delayed while both sides squabbled over participants.\n\nEarlier on Friday, a government official, who also spoke on condition of anonymity for the same reason, had said Ghani was opposed to participation in the talks.\n\nIt wasn't clear what changed Ghani's mind or whether he had requested a postponement, but a number of prominent Afghans from Kabul are expected to attend the China meeting, including former President Hamid Karzai, who has been a strong proponent of direct talks with the Taliban. He participated in earlier sessions of talks with the Taliban held in Moscow.\n\nThe Taliban delegation to China will be led by Mullah Abdul Ghani Baradar, co-founder of the movement, who spent eight years in a Pakistani jail after he secretly opened peace talks in 2010 with Karzai, who was president at the time. Baradar was arrested in a joint American CIA and Pakistani anti-terrorism agency operation. Neither Pakistan nor the United States were ready for peace talks with the Taliban in 2010, Karzai previously told The Associated Press.\n\nThe Taliban are the strongest they have been since being ousted in 2001 by a U.S.-led coalition holding sway in nearly 50% of the country.\n\nIn a draft statement released at the end of Friday's meeting in Moscow, China, Russia and Pakistan called on Washington to return to the negotiation table with the Taliban and sign an agreement that will set the stage for Afghans on both sides of the protracted conflict to start face-to-face negotiations on what a post-war Afghanistan would look like.\n\nAfter nearly a year of direct talks, U.S. envoy Zalmay Khalilzad had all but signed a peace deal with the Taliban until President Donald Trump in September declared the talks dead after a series of Taliban attacks killed several people, including a U.S. soldier.\n\nIt's not clear what it would take for Trump to agree to restart talks, but the U.S. president has insisted he wants American troops out of Afghanistan and an end to American involvement in what has become their longest military engagement.\n\nTrump has vowed at recent rallies to make good on his 2016 campaign promise to end American involvement in what he has described as endless wars, including Afghanistan, generating fears among some observers of a surprise tweet suddenly ordering troops home.\n\nFriday's statement called for a reduction in violence, which some observers say might convince Trump to agree to renewed talks.\n\nThe United Nations, however, earlier this month called for all sides to reduce their attacks, which have caused more than 8,000 civilian casualties so far this year. The casualties have been caused by all sides in the conflict, including stepped-up U.S. airstrikes in combat operations.\n\nThe representatives, which have met previously, agreed to meet again.\n\n___\n\nAssociated Press writer Tameem Akhgar in Kabul, Afghanistan, contributed to this report.", "description": "Representatives of Russia, China, the United States and Pakistan have agreed that negotiation is the only road to peace in Afghanistan, including an early resumption of direct U.S. talks with the Taliban.  The day-long talks in Moscow on Friday came ahead of an intra-Afghan dialogue to be hosted by China", "authors": ["Kathy Gannon"], "top_image": "https://s.yimg.com/uu/api/res/1.2/x45.zV28dC8cCBTUzmVDyQ--~B/aD0yNDM5O3c9MzMxNjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/efa62515a4ce8a035f8aafd1a6e9e9b2", "published_at": "2019-10-26"}