{"pub": "wsj", "url": "https://wsj.com/articles/new-u-s-powers-help-target-terrorist-financing-treasury-official-says-11568247532?mod=rsswn", "downloaded_at": "2019-09-12 07:25:11.505084+00:00", "title": "Foreign Banks Risk Losing Dollar Access Under Expanded U.S. Counter-Terror Powers", "language": "en", "text": "The U.S. plans to use expanded counterterrorism powers to target foreign financial institutions that facilitate terrorist financing, leaders of terrorist groups and those participating in terrorist training over the internet, a U.S. Treasury Department senior official said.\n\n“Foreign financial institutions should be on notice that the U.S. government will fully utilize this new authority if they are found to be, in any way, facilitating the malign activities of U.S. designated terrorist groups, their members and their supporters,” Sigal Mandelker, the Treasury undersecretary for terrorism and financial intelligence, said in prepared remarks for a speech Wednesday at the International Institute for Counterterrorism’s annual summit in Israel.\n\nThe Trump administration this week unveiled details of an updated counterterrorism executive order that significantly expanded U.S. counterterrorism powers. The Trump administration also imposed sanctions on dozens of individuals and entities allegedly involved with terror groups.\n\nTreasury and the U.S. State Department have blacklisted about 400 people and entities under antiterror authorities over the past two years, representing nearly one-third of all such designations since the Sept. 11, 2001, attacks. Those figures underscore the Trump administration’s focus on sanctions as a primary foreign-policy tool across the geopolitical spectrum.\n\nWith the newly updated executive order, the U.S. can now impose secondary sanctions for any person, business or financial institution found to have handled transactions with all individuals and entities designated as terrorists by the U.S., Ms. Mandelker said in the speech.\n\nNewsletter Sign-up\n\nForeign financial institutions at risk of such secondary sanctions include money services businesses, cryptocurrency exchangers and administrators, in addition to banks, she said. The action could cut off their access to the world’s biggest economy and most-used currency critical to most of the world’s trade and finance.\n\nThe executive order also expanded the U.S. government’s ability to swiftly target alleged leaders and officials of terrorist groups and those participating in terror training over the internet and other telecommunications platform, in addition to those participating in terror training camps, she said.\n\nUnder the new rules, the two departments responsible for imposing sanctions no longer need to develop detailed dossiers tying top officials or agents involved in terror groups to specific attacks or acts, said Nathan Sales, the State Department’s top counterterror official.\n\n“If you’re out in the dark corners of the internet getting bomb-making instructions, if you’re going to a Hezbollah training camp, that fact alone is now a sufficient basis for you to be designated under our sanctions authorities,” he said, referring to the Iran-backed Lebanese group designated by the U.S. as a terror organization.\n\nEric Lorber, a former top Treasury sanctions official, said the new powers are a significant change from past authorities not only in making it easier to issue terror sanctions, but also because now any financial institution found handling transactions for entities blacklisted as terrorists or their supporters is at risk being cut out of the U.S. financial system.\n\n“This is a real expansion of authority,” said Mr. Lorber, now at the Foundation for Defense of Democracies, a Washington think tank. “While most financial institutions would not have done business with designated terrorists even before this new authority, this action makes clear that the U.S. Treasury is willing to take serious steps to punish those financial institutions that do.”\n\nWrite to Mengqi Sun at mengqi.sun@wsj.com and Ian Talley at ian.talley@wsj.com", "description": "The U.S. plans to use expanded counterterrorism powers to target foreign financial institutions that facilitate terrorist financing, leaders of terrorist groups and those participating in terrorist training over the internet, a senior U.S. Treasury Department official said.", "authors": ["Mengqi Sun", "Ian Talley", "Mengqi.Sun Wsj.Com", "Ian.Talley Wsj.Com"], "top_image": "https://images.wsj.net/im-106442/social", "published_at": "2019-09-12"}