{"pub": "yahoo", "url": "https://news.yahoo.com/mainland-china-troops-police-not-122254452.html", "downloaded_at": "2019-10-10 18:45:43.084244+00:00", "title": "Mainland China troops and police not part of Hong Kong police operations - govt", "language": "en", "text": "HONG KONG, Oct 10 (Reuters) - China's mainland army and police are not part of Hong Kong police operations, the city's government said on Thursday, responding to Internet rumours the People's Liberation Army (PLA) and mainland police were involved in trying to quell pro-democracy unrest.\n\nThe PLA has a garrison in Hong Kong but troops have remained in barracks since the protests started four months ago, leaving local police to handle the often violent and massive protests.\n\nThe PLA's top brass has warned that violence in Hong Kong is \"absolutely impermissible\".\n\nSome protesters believe undercover mainland security forces have been part of the Hong Kong police operations.\n\n\"In response to rumours on the Internet saying that there were members of the People's Liberation Army or mainland law enforcement agencies joining the law enforcement operations of the Hong Kong Police Force, the Hong Kong Special Administrative Region Government today seriously clarified that the rumours are false and groundless,\" the government said in statement.\n\nOn Sunday, Chinese soldiers issued a warning to Hong Kong protesters who shone lasers at their barracks in the city, in the first direct interaction between mainland military forces and protesters.\n\nThe PLA garrison in Kowloon district warned a crowd of a few hundred protesters they could be arrested for targeting its troops and barrack walls with laser lights.\n\nOne officer shouted through a loudhailer in broken Cantonese, the main language of Hong Kong: \"Bear consequences for your actions.\"\n\nIn August, Beijing moved thousands of troops across the border into Hong Kong in an operation state news agency Xinhua described at the time as a routine \"rotation\".\n\nHong Kong has seen four months of often violent and sometimes massive protests, sparked by a now-withdrawn China extradition bill but which has morphed into a pro-demoracy movement.\n\nThe unrest is the city's worst political crisis since 1997, when Britain handed Hong Kong back to China, and poses the biggest popular challenge to Chinese President Xi Jinping since he came to power in 2012. (Reporting by Twinnie Siu; Writing by Michael Perry; Editing by Giles Elgood)", "description": "China's mainland army and police are not part of Hong Kong police operations, the city's government said on Thursday, responding to Internet rumours the People's Liberation Army (PLA) and mainland police were involved in trying to quell pro-democracy unrest. The PLA has a garrison in Hong", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/FOd.yhJjLj8UE_C7y66z6g--~B/aD0zMzM0O3c9NTAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/e8c83650-eb5a-11e9-b6a7-c0dcb82395c4", "published_at": "2019-10-10"}