{"pub": "euronews", "url": "https://euronews.com/2013/11/16/eu-myanmar-summit-ends-on-hopeful-note", "downloaded_at": "2019-10-05 11:14:02.785516+00:00", "title": "EU-Myanmar summit ends on hopeful note", "language": "en", "text": "The EU has concluded its big summit with the authorities in Myanmar, a country throwing off dictatorship and coming in from the cold of international isolation and threatened trade sanctions.\n\nFor three days the EU task force has sought ways to boost trade and other ties, and help Myanmar’s transition to democracy after 50 years of military rule.\n\n“I am here to encourage you to invest in the right way, in the truly responsible way, which is taking into consideration the political and legal dimensions of investment,” warned Aung San Suu Kyi.\n\nWith endorsement from Myanmar’s nobel-prize-winning dissident, now leading the opposition in parliament, the EU wants to be first in line when it comes to rebuilding the country.\n\n“In partnership, you know, it’s not about coming to impose it’s coming to say: these are the things we know. European countries represented here, European businesses represented here, from all over the EU know very well the journey that has to be taken for a nation to come from oppression to freedom, and they want to support this country on that journey,” said the EU’s Foreign Policy chief Catherine Ashton.\n\nMore recently Myanmar has faced increasing problems with ethnic groups, notably muslims who live on the northen border with Bangladesh, posing another threat to democratic change.\n\n“The European Union supports the progress made by the country and came to strengthen the bonds of political end economic cooperation. But this visit is also to show the concerns about inter-ethnic violence and new reports of arrests of human rights activists,”\n\nsays euronews’ Isabel Marques da Silva in Myanmar.", "description": "The EU has concluded its big summit with the authorities in Myanmar, a country throwing off dictatorship and coming in from the cold of international", "authors": [], "top_image": "https://static.euronews.com/articles/archive/1000x563_archive.jpg", "published_at": "2013-11-16"}