{"pub": "reuters", "url": "https://in.reuters.com/article/uk-usa-trump-whistleblower/trump-impeachment-inquiry-hears-more-evidence-of-outside-efforts-to-influence-ukraine-policy-idINKBN1X811F", "downloaded_at": "2019-10-30 23:53:47.212047+00:00", "title": "Impeachment testimony shows high-powered U.S. lobbyist's role in Ukraine scandal", "language": "en", "text": "WASHINGTON (Reuters) - A Republican former congressman-turned-lobbyist repeatedly pushed for the dismissal of U.S. Ambassador to Ukraine Marie Yovanovitch, an action later taken by President Donald Trump after he was urged to do so by his personal lawyer Rudy Giuliani, a U.S. diplomat said in testimony on Wednesday.\n\nCatherine Croft and Christopher Anderson, Ukraine specialists at the State Department, became the latest current and former U.S. officials called as witnesses in the Democratic-led impeachment inquiry against the Republican president in the House of Representatives.\n\nCroft said in her opening statement to lawmakers, posted online by the Washington Post, that she was repeatedly contacted by lobbyist Robert Livingston, who urged the firing of Yovanovitch.\n\nIn the latest move in the fast-moving impeachment inquiry, former White House national security adviser John Bolton has been asked to testify next week, said a source familiar with the matter.\n\nAccording to the testimony of other officials, Bolton was alarmed by a White House effort to pressure the president of Ukraine to investigate a Trump political rival.\n\nBolton, who was fired by Trump in September after the pair clashed over how to handle foreign policy challenges, has not commented publicly on the impeachment effort.\n\nCroft, who testified for roughly five hours on Wednesday, was a member of the National Security Council staff at the White House starting in July 2017 and leaving in July 2018.\n\nShe said Livingston characterized Yovanovitch as an ‘Obama holdover’ who was associated with liberal activist George Soros.\n\nSoros is a wealthy financier often assailed by conservatives and known for his support of liberal causes. Barack Obama was Trump’s Democratic predecessor.\n\n“It was not clear to me at the time - or now - at whose direction or at whose expense Mr. Livingston was seeking the removal of Ambassador Yovanovitch,” Croft said.\n\nThe impeachment inquiry focuses on a July 25 telephone call in which Trump asked Ukrainian President Volodymr Zelenskiy to investigate Democratic political rival Joe Biden, a former U.S. vice president, and his son Hunter, who had served as a director for Ukrainian energy company Burisma. Trump has denied wrongdoing.\n\nTrump abruptly removed Yovanovitch in May after allies of the president leveled unsubstantiated charges of disloyalty and other allegations against her.\n\nGiuliani has said he went to Trump and the State Department as part of his effort to have her removed from the post at a time when he was seeking to persuade Ukraine to open an investigation of Biden, a leading contender for the Democratic nomination to face Trump in the November 2020 U.S. election.\n\nLivingston played a prominent role in the Republican-led drive to impeach Democratic President Bill Clinton in the 1990s. Livingston was yet another well-connected Republican advocating against Yovanovitch, including Trump’s son Donald Trump Jr., Giuliani and former Republican congressman Pete Sessions.\n\nLobbying disclosure filings with the Justice Department showed Livingston’s firm represented two Ukrainian clients in Washington. They are former Ukrainian Prime Minister Yulia Tymoshenko, who mounted an unsuccessful run for president this year in the election won by Zelenskiy in a landslide in April, and an association of Ukrainian metal producers.\n\nThe filings showed a connection between Livingston’s firm and Giuliani, showing that Republican former congressman Bob McEwen of Ohio, working as a consultant to the Livingston Group, introduced Tymoshenko to Trump’s lawyer last December.\n\nThe filings also showed that Livingston called Croft in May 2018, and contacted Anderson in November and December 2018.\n\nLivingston, from Louisiana, was once one of the most powerful Republicans in Washington and had been in line to become House speaker. But he quit in 1998, saying he could not lead the effort to impeach Clinton for lying about a sexual relationship with an intern because he himself had engaged in an extramarital affair.\n\nHis firm did not immediately respond to a request for comment.\n\n‘SURROUNDED BY ENEMIES’\n\nCroft said she told Fiona Hill, Trump’s former top Russia adviser, and George Kent, a senior State Department Ukraine expert, about Livingston’s efforts concerning Yovanovitch but was “not aware of any action that was taken in response.”\n\nAnderson, in his opening statement seen by Reuters, also mentioned Giuliani’s actions. Before Zelenskiy’s inauguration in May, Anderson said that “my colleagues and I saw a tweet by Rudolph Giuliani” alleging that Ukraine’s incoming leader “was surrounded by enemies of President Trump.” Anderson said he sought to counter that “negative narrative.”\n\nU.S. foreign service officer Catherine Croft, who once served as a deputy to then-Special Envoy for Ukraine Kurt Volker, arrives to testify as part of the U.S. House of Representatives impeachment inquiry into U.S. President Trump led by the House Intelligence, House Foreign Affairs and House Oversight and Reform Committees on Capitol Hill in Washington, U.S., October 30, 2019. REUTERS/Siphiwe Sibeko\n\nIn her own testimony this month, Yovanovitch said she did not know Giuliani’s motives for attacking her and that she believed she was ousted based on “unfounded and false claims by people with clearly questionable motives.”\n\nTrump’s nominee to become U.S. ambassador to Russia, John Sullivan, testified in his Senate confirmation hearing on Wednesday that he knew earlier this year about Giuliani’s involvement in the campaign to oust Yovanovitch.\n\nAsked by Democratic Senator Bob Menendez whether it is “ever appropriate” for a president to use the power of his office to seek investigations of domestic political opponents, Sullivan replied: “I don’t think that would be in accord with our values.”\n\nGiuliani has admitted sending to Secretary of State Mike Pompeo a packet of information in March including a document describing a discredited theory promoted by Trump allies that Yovanovitch was installed in her post in Kiev by Soros and that unless she was removed, Soros “has as much, or more power over Yovanovitch as the president and the Secretary of State.”\n\n‘LOVE TO KNOW’\n\nDemocratic Representative Gerald Connolly said he was shocked to hear of Livingston’s role, adding: “We would love to know what possessed him to recommend the firing of an honorable career foreign service ambassador who was doing a good job in protecting U.S. interests and trying to promote democracy in Ukraine.” Another House Democrat, Peter Welch, called Livingston’s actions “disgraceful.”\n\nThe July telephone call is at the heart of the congressional inquiry into whether Trump misused the power of his office for personal political gain and, if so, whether that rises to the level of “high crimes and misdemeanors” that merit impeachment and removal from office under the Constitution.\n\nIf the Democratic-led House approves formal charges against Trump, the Republican-controlled Senate would hold a trial on whether to remove him from office.\n\nTrump made his request to Zelenskiy for an investigation into the Bidens after withholding $391 million in security aid approved by Congress to help Ukraine fight Russian-backed separatists in eastern Ukraine. Zelenskiy agreed to Trump’s requests. The aid was later provided.\n\nAnderson, who began his testimony in the afternoon, and Croft described Trump’s negative view toward Ukraine even as other State Department and White House officials underscored Kiev’s importance to U.S. national security in the face of Russian aggression.\n\nIn November 2018, Anderson said, Russia escalated the conflict when its forces attacked and seized Ukrainian military vessels heading to a Ukrainian port.\n\n“While my colleagues at the State Department quickly prepared a statement condemning Russia for its escalation, senior officials in the White House blocked it from being issued,” Anderson said.\n\nSlideshow (12 Images)\n\nSeparately, the House Rules Committee opened a debate on legislation laying out procedures for the next steps in the impeachment inquiry. Republicans, who have accused Democrats of trampling on Trump’s rights and keeping the process too secret, sought to win greater powers to subpoena witnesses and documents and to further open up proceedings of the Intelligence Committee, which plays a key role in the probe.\n\nTrump has urged Republicans to fight the impeachment effort.\n\n“This Impeachment nonsense is just a continuation of the Witch Hunt Hoax,” he tweeted on Wednesday, exhorting Republicans to “go with Substance and close it out!”", "description": "A Republican former congressman-turned-lobbyist repeatedly pushed for the dismissal of U.S. Ambassador to Ukraine Marie Yovanovitch, an action later taken by President Donald Trump after he was urged to do so by his personal lawyer Rudy Giuliani, a U.S. diplomat said in testimony on Wednesday.", "authors": ["Susan Cornwell", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191030&t=2&i=1446540904&w=1200&r=LYNXMPEF9T159", "published_at": "2019-10-30"}