{"pub": "thehill", "url": "https://thehill.com/policy/technology/overnights/465751-hillicon-valley-warren-calls-out-facebook-political-ad-policies", "downloaded_at": "2019-10-15 00:03:13.772164+00:00", "title": "Hillicon Valley: Warren takes on Facebook over political ads | Zuckerberg defends meetings with conservatives | Civil liberties groups sound alarm over online extremism bill", "language": "en", "text": "Welcome to Hillicon Valley, The Hill's newsletter detailing all you need to know about the tech and cyber news from Capitol Hill to Silicon Valley. If you don't already, be sure to sign up for our newsletter with this LINK.\n\nWelcome! Follow the cyber team, Maggie Miller (@magmill95), and the tech team, Emily Birnbaum (@birnbaum_e) and Chris Mills Rodrigo (@chrisismills)\n\nWARREN CALLS OUT ZUCKERBERG: Sen. Elizabeth Warren Elizabeth Ann WarrenSanders can gain ground by zeroing in on corruption Biden praises Buttigieg for criticizing GOP attacks: 'That's a good man' Warren enters crucial debate with big momentum MORE's presidential campaign is targeting Facebook's policies for political advertisements with a new ad that purposefully makes the false claim that the company and its CEO, Mark Zuckerberg Mark Elliot ZuckerbergWarren targets Facebook with ad claiming Zuckerberg supports Trump Key Democrat presses FTC over Facebook settlement's 'dangerous precedent' On The Money: Fed officials saw rising risk of recession | Ocasio-Cortez, Cruz blast NBA for 'outrageous' response to China | Prospects dim for trade breakthrough with China MORE, have endorsed President Trump Donald John TrumpWHCA calls on Trump to denounce video depicting him shooting media outlets Video of fake Trump shooting members of media shown at his Miami resort: report Trump hits Fox News's Chris Wallace over Ukraine coverage MORE.\n\nWarren and other critics have blasted Facebook in recent days over its refusal to take down a Trump campaign ad that accuses Democratic candidate Joe Biden Joe BidenTrump hits Fox News's Chris Wallace over Ukraine coverage Schiff: Whistleblower testimony might not be necessary Trump warns Democrats will lose House seats over impeachment MORE of corruption without evidence. Facebook has defended allowing the ad to stay on its platform.\n\nADVERTISEMENT\n\n\"Breaking news: Mark Zuckerberg and Facebook just endorsed Donald Trump for re-election,\" the mock Warren ad states. \"You're probably shocked, and you might be thinking, 'how could this possibly be true?' Well, it's not. (Sorry.)\"\n\n\"But what Zuckerberg *has* done is given Donald Trump free rein to lie on his platform -- and then to pay Facebook gobs of money to push out their lies to American voters,\" the ad continues.\n\n\"If Trump tries to lie in a TV ad, most networks will refuse to air it. But Facebook just cashes Trump's checks,\" the ad states. \"Facebook already helped elect Donald Trump once. Now, they're deliberately allowing a candidate to intentionally lie to the American people. It's time to hold Mark Zuckerberg accountable.\"\n\nAsked about the Warren ad, a Facebook spokesperson told The Hill in a statement on Saturday that the company \"believes political speech should be protected.\"\n\n\"If Senator Warren wants to say things she knows to be untrue, we believe Facebook should not be in the position of censoring that speech,\" the spokesperson said.\n\nRead more here.\n\nMORE ZUCKERBERG: Facebook CEO Mark Zuckerberg defended himself on Monday afternoon after receiving pushback over a report that he has recently held a string of private meetings with conservative politicians, pundits and journalists.\n\nBehind closed doors over the past several months, Politico reported, Zuckerberg has been meeting with top GOP figures including Sen. Lindsey Graham Lindsey Olin GrahamFurious Republicans prepare to rebuke Trump on Syria Democrats to offer resolution demanding Trump reverse Syria decision Army officer calls Syria pullback 'a stain on the American conscience' MORE (R-S.C.), Fox News host Tucker Carlson Tucker CarlsonShepard Smith leaving Fox News Tucker Carlson criticizes Trump's Ukraine call Maddow on going to dinner with rivals Hannity, Cuomo: 'I doubt they eat the same things' MORE, and conservative radio show host Hugh Hewitt.\n\nThe meetings, many of which have reportedly taken place in Zuckerberg's California homes, reportedly addressed issues including allegations that Facebook routinely censors right-wing voices, a claim that has little evidence and that Facebook has vehemently denied.\n\n\"There's some press today discussing dinners I've had with conservative politicians, media and thinkers,\" Zuckerberg posted on Facebook following Politico's report. \"To be clear, I have had dinners with lots of people across the spectrum on lots of different issues all the time.\"\n\n\"Meeting new people and hearing from a wide range of viewpoints is part of learning,\"\n\nZuckerberg added. \"If you haven't tried it, I suggest you do!\"\n\nAccording to Politico, the dinner attendees have also included commentator Ben Shapiro, a fellow at the right-leaning American Enterprise Institute, and Fox News contributor Byron York.\n\nA senior Trump administration official told Politico, \"The White House is looking for meaningful steps from Facebook on a number of fronts\" and cited \"competition, free speech for everybody including conservatives, and privacy. Nominal outreach won't cut it.\"\n\nRead more on Zuckerberg's pushback here.\n\nCRITICISM OVER ONLINE EXTREMISM BILL: Civil liberties and technology groups have been sharply critical of a draft bill from House Homeland Security Committee Democrats on dealing with online extremism, saying it would violate First Amendment rights and could result in the surveillance of vulnerable communities.\n\nOver the summer, Democrats circulated an early draft of the bill seeking input from stakeholders, but the proposal received almost immediate pushback. Civil liberties groups want to rework the bill entirely, questioning whether government should play any significant role in identifying and combating online extremism.\n\nDemocrats had planned to mark up the legislation last month, but pulled the bill at the last minute, with a spokesman telling The Hill it was \"not ready.\" The spokesman said the committee is still hoping to mark it up by the end of the month, calling the legislation \"still fluid.\"\n\nThe opposition from civil society groups is another challenge in an already tough legislative path. Democratic lawmakers had already faced concerns from Republicans, who say the bill should scale back its scope.\n\n\"Right now, the Homeland Security Committee's efforts should be narrowly focused on addressing illegal terrorist activity not protected by the Constitution, while ensuring that the First Amendment is respected,\" Rep. Mike Rogers Michael (Mike) Dennis RogersCivil liberties groups sound alarm over online extremism bill Extremists find new home in online app Telegram China cheats — and we let them MORE (R-Ala.), the ranking member on the committee, said in a statement to The Hill.\n\nThe wrangling over the bill is highlighting how complicated it can be for the federal government to act against online radicalization without running into First Amendment concerns.\n\nAccording to a copy of the bill circulated in September and obtained by The Hill, the National Commission on Online Platforms and Homeland Security Act would create a 12-member commission of experts who would work up recommendations for Congress to address online extremism while taking \"individual privacy civil liberties\" into account. The members would be appointed by Republicans and Democrats in Congress and the president.\n\nBut the government-appointed body would be given the power to subpoena communications, a sticking point that raised red flags for First Amendment advocates concerned about government surveillance.\n\nRead more on the opposition to the bill here.\n\nCYBER KUDOS: Democratic Sens. Elizabeth Warren (Mass.) and Cory Booker Cory Anthony BookerRepublicans wrestle with impeachment strategy O'Rourke campaign says path to victory hinges on top 5 finishes in Iowa, Nevada O'Rourke raises .5 million in third quarter MORE (N.J.) are the 2020 presidential candidates with the highest level of cybersecurity awareness, according to an industry report released on Monday, with former tech entrepreneur Andrew Yang Andrew YangO'Rourke campaign says path to victory hinges on top 5 finishes in Iowa, Nevada Hillicon Valley: Google, Reddit to testify on tech industry protections | Trump joins Amazon-owned Twitch | House to vote on bill to combat foreign interference O'Rourke raises .5 million in third quarter MORE ranking last.\n\nBoth Warren and Booker received an A-, while Yang scored a D+. Sen. Amy Klobuchar Amy Jean KlobucharRepublicans wrestle with impeachment strategy Klobuchar takes shots at health and education plans supported by Sanders and Warren O'Rourke campaign says path to victory hinges on top 5 finishes in Iowa, Nevada MORE (D-Minn.) and former Vice President Joe Biden also scored badly, with Klobuchar receiving a C, and Biden a C-.\n\nOther top scorers included Sen. Bernie Sanders Bernie SandersSanders wishes Ocasio-Cortez happy birthday Video of fake Trump shooting members of media shown at his Miami resort: report Sanders can gain ground by zeroing in on corruption MORE (I-Vt.), with a B+, and President Trump, who received a B grade.\n\nThe findings come from a \"report card\" compiled by website security group SiteLock on 12 of the top 2020 presidential candidates. SiteLock evaluated cyber awareness based on how integrated cybersecurity was in a candidate's platform, how often the candidate discussed it, and the actions taken in relation to cybersecurity by the candidate.\n\nSome of the factors SiteLock used to make these evaluations were whether a candidate had ever been involved in a data breach, whether campaign email addresses had been found on the dark web, if the candidate had publicly supported legislation on cybersecurity issues and whether the candidate had a published privacy policy on their campaign website.\n\nSiteLock also scanned candidate websites to ascertain how at-risk they were to cyberattacks, finding that 58 percent of the candidates' sites use out-of-date software.\n\n\"Technically, anything short of perfect cybersecurity awareness practices should be viewed as a security flaw because it only takes a single vulnerability to fall victim to a bad actor,\" SiteLock wrote in a blog post announcing the report card findings. \"The fact that not one candidate can be credited with a perfect score proves that cybersecurity awareness is an overlooked issue.\"\n\nRead more here.\n\nA CAN'T MISS HEARING: House Transportation and Infrastructure Committee Chairman Peter DeFazio Peter Anthony DeFazioHere are the Democrats who aren't co-sponsoring an assault weapons ban To stave off a recession, let's pass a transportation infrastructure bill The Hill's 12:30 Report: Trump issues Taliban warning at Sept. 11 memorial MORE (D-Ore.) on Monday sent letters to ride-sharing giants Uber and Lyft warning them not to miss an upcoming hearing.\n\n\"I intend to pursue legislative solutions to address numerous issues plaguing the ride hailing industry, many of which will be raised at this hearing,\" DeFazio wrote in letters to Uber CEO Dara Khosrowshahi and Lyft CEO Logan Green.\n\n\"These include conditions governing your partnerships with States and local governments and transit agencies, the labor impacts of your business model, and disturbing reports of public safety problems among those who use your platform. If you do not send a representative to testify at the hearing, you leave the Committee little choice but to make these policy decisions without your input.\"\n\nThe hearing in question, called \"Examining the Future of Transportation Network Companies: Challenges and Opportunities,\" is scheduled for this Wednesday.\n\nDeFazio wrote in the letters that his committee has had \"numerous conversations\" with the two ride-sharing companies but has been unable to secure a representative to testify from either.\n\nLyft did not immediately respond to requests for comment on the letters. Uber confirmed to The Hill that it had received the letter but did not provide comment on its contents.\n\nRead more here.\n\nLIGHTER CLICK: Getting wild on a Monday\n\nAN OP-ED TO CHEW ON: Ronan Farrow exposes how the media protects the powerful\n\nNOTABLE LINKS FROM AROUND THE WEB:\n\nHow photos of your kids are powering surveillance technology (The New York Times)\n\nWill China's revised cybersecurity rules put foreign firms at risk of losing their secrets? (South China Morning Post)\n\nDigital dystopia: How algorithms punish the poor (The Guardian)", "description": "Welcome to Hillicon Valley, The Hill's newsletter detailing all you need to know about the tech and cyber news from Capitol Hill to Silicon Valley.", "authors": [], "top_image": "https://thehill.com/sites/default/files/warrenelizabeth_100219getty.jpg", "published_at": "2019-10-14"}