{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/bitcoin-price-chart-now-looks-ridiculous-after-record-gains-analyst", "downloaded_at": "2019-10-28 09:49:20.693505+00:00", "title": "Bitcoin Price Chart Now Looks ‘Ridiculous’ After Record Gains: Analyst", "language": "en", "text": "Bitcoin (BTC) held above $9,000 on Oct. 28 as a weekend of bullish madness continued to captivate markets.\n\nCryptocurrency market daily overview. Source: Coin360\n\nBitcoin price mulls next move amid $8.8K warning\n\nData from Coin360 showed volatility remaining elevated for Bitcoin on Monday, with swings between $9,100 and $9,900 characterizing the past 24 hours.\n\nOn Friday, news that China was officially embracing blockchain technology appeared to reawaken enthusiasm across cryptocurrency markets. After trailing at $7,400 for several days, BTC/USD suddenly exploded, hitting local highs of nearly $10,500 early Saturday morning.\n\nThose levels have since consolidated, with the press time price of $9,400 nonetheless corresponding to 3-day gains of 25%.\n\nBitcoin seven-day price chart. Source: Coin360\n\nChina fuelled the mood once more as the week began, Cointelegraph reporting on the news a major national bank had sealed an investment deal in a Bitcoin wallet provider.\n\nDespite the excitement being tangible among market participants, however, not everyone was convinced the new highs would endure.\n\n“The chart obviously looks completely ridiculous now and CME are going to open with a gap to the upside if prices remain like this,” Cointelegraph contributor filbfilb told subscribers of his dedicated Telegram channel over the weekend.\n\nFilbfilb added he expected BTC/USD to return to levels around $8,800.\n\nAltcoin markets show a clear divide\n\nAltcoins likewise maintained higher levels after rising precipitously in line with Bitcoin. However, it was Chinese projects which showed a clear advantage for traders.\n\nBoth Tron (TRX) and NEO (NEO) delivered considerably stronger performances than the average top twenty cryptocurrency, both rising around 23% in the past 24 hours. Tezos (XTZ) and Zcash (ZEC) also showed progress with 8% gains.\n\nEther (ETH), the largest altcoin by market cap, meanwhile saw sideways movements on Monday, with daily gains of just 1.5% to $182.\n\nEther seven-day price chart. Source: Coin360\n\nThe overall cryptocurrency market cap hit $250 billion, with Bitcoin’s share at 68%.", "description": "After a weekend of upward momentum during which markets hit as high as $10,500, Bitcoin retraced some of its progress but managed to retain most of its gains", "authors": ["William Suberg"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvM2E2MjNiN2UzNWMxYTJiN2FmMjM1Mjc3NTI1NDhiZGQuanBn.jpg", "published_at": "2019-10-28"}