{"pub": "yahoo", "url": "https://news.yahoo.com/abandoned-u-syria-kurds-ally-120932465.html", "downloaded_at": "2019-10-14 23:31:45.302248+00:00", "title": "Abandoned by U.S. in Syria, Kurds Find New Ally in U.S. Foe", "language": "en", "text": "DOHUK, Iraq — Kurdish forces long allied with the United States in Syria announced a new deal Sunday with the government in Damascus, a sworn enemy of Washington that is backed by Russia, as Turkish troops moved deeper into their territory and President Donald Trump ordered the withdrawal of the U.S. military from northern Syria.\n\nThe sudden shift marked a major turning point in Syria’s long war.\n\nFor five years, U.S. policy relied on collaborating with the Kurdish-led forces both to fight the Islamic State group and to limit the influence of Iran and Russia, which support the Syrian government, with a goal of maintaining some leverage over any future settlement of the conflict.\n\nOn Sunday, after Trump abruptly abandoned that approach, U.S. leverage appeared all but gone. That threatened to give President Bashar Assad and his Iranian and Russian backers a free hand. It also jeopardized hard-won gains against Islamic State — and potentially opened the door for its return.\n\nThe Kurds’ deal with Damascus paved the way for government forces to return to the country’s northeast for the first time in years to try to repel a Turkish invasion launched after the Trump administration pulled U.S. troops out of the way. The pullout has already unleashed chaos and bloodletting.\n\nSyrian refugee children play under posters depicting President Recep Tayyip Erdogan of Turkey at a camp on the outskirts of Kahramanmaras in southeastern Turkey on Aug. 31, 2019. (Mauricio Lima/The New York Times) More\n\nThe announcement of the deal Sunday evening capped a day of whipsaw developments marked by rapid advances by Turkish-backed forces and the escape of hundreds of women and children linked to Islamic State from a detention camp. As U.S. troops were redeployed, two U.S. officials said the United States had failed to transfer five dozen “high value” Islamic State detainees out of the country.\n\nTurkish-backed forces advanced so quickly that they seized a key road, complicating the U.S. withdrawal, officials said.\n\nThe invasion ordered by President Recep Tayyip Erdogan of Turkey, which came after a green light from Trump, is aimed at uprooting the Syrian Democratic Forces, a Kurdish-led militia that has been a key partner in the fight against the Islamic State group. Turkey sees the group as a security threat because of its links to a Kurdish separatist movement it has battled for decades.\n\nThe Turkish incursion has killed scores of people, and left Kurdish fighters accusing the United States of betrayal for leaving them at the Turks’ mercy. That is what led them to strike the deal with Damascus, which said Sunday that its forces were heading north to take control of two towns and to fight the “Turkish aggression.”\n\nTurkey’s invasion upended a fragile peace in northeastern Syria and risks enabling a resurgence of Islamic State, which no longer controls territory in Syria but still has sleeper cells and supporters.\n\nSince the Turkish incursion began Wednesday, ISIS has claimed responsibility for at least two attacks in Syria: one car bomb in the northern city of Qamishli and another on an international military base outside Hasaka, a regional capital farther to the south.\n\nTrump has said repeatedly that the United States has taken the worst ISIS detainees out of Syria to ensure they would not escape. But in fact the U.S. military took custody of only two British detainees — half of a cell dubbed the Beatles that tortured and killed Western hostages — U.S. officials said.", "description": "DOHUK, Iraq -- Kurdish forces long allied with the United States in Syria announced a new deal Sunday with the government in Damascus, a sworn enemy of Washington that is backed by Russia, as Turkish troops moved deeper into their territory and President Donald Trump ordered the withdrawal of the U.S", "authors": ["Ben Hubbard", "Charlie Savage", "Eric Schmitt", "Patrick Kingsley"], "top_image": "https://s.yimg.com/uu/api/res/1.2/VOAljcL0rUvFhQ6EKpozTw--~B/dz0wO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_new_york_times_articles_158/f4bfdd76e2af30df590eb5a91ce5c301", "published_at": "2019-10-14"}