{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/16/dwayne-haskins-gets-first-team-reps-after-case-kee", "downloaded_at": "2019-10-16 23:44:45.062866+00:00", "title": "Dwayne Haskins gets first-team reps after Case Keenum given off day", "language": "en", "text": "ASHBURN — Redskins rookie Dwayne Haskins received all the first-team reps in practice Wednesday as quarterback Case Keenum rested with right shoulder and foot injuries.\n\nInterim coach Bill Callahan said Keenum’s off day was planned; the veteran will still play Sunday against the San Francisco 49ers. But with Keenum sidelined for the afternoon, Haskins was able to further develop.\n\nCallahan said he has been pleased with the 22-year-old’s progress.\n\n“It’s invaluable for a backup to take starting reps, especially at the beginning of the week in terms of putting your plan together and laying it out there and making all the adjustments, whether it’s new communication, new formations, handling the shift-motion game,” Callahan said. “I thought he did a really good job today, so his growth is starting to show in practice and also in his preparation. He’s in earlier, he’s out later, so it’s all coming to fruition.\n\n“It’s going to take a little time, but it’s good to see him take a major step today in practice.”\n\nKeenum was inconsistent in his return to the lineup Sunday against the Miami Dolphins. He completed just 52% of his passes, but threw for two touchdowns. After Washington’s win, Callahan said he saw enough in Keenum for the 31-year-old to start again next week.\n\nSpeaking to reporters in Miami, Keenum described his performance as “really ugly,” saying he has to improve. Miami almost pulled off a last-second upset, but failed to convert a game-winning two-point conversion at the end of the game.\n\nThat could have been avoided entirely if Keenum and the offense had put up more points.\n\n“The receivers did a great job,” Keenum said. “I’ve got to get the ball to them in key situations and not make it as interesting as it was.”\n\nKeenum, though, isn’t in jeopardy of losing his job. Instead, the Redskins are letting him rest. He suffered a foot injury in Week 3 against the Chicago Bears and hasn’t been fully healthy since.\n\nWednesday also marked the first time that Keenum was listed with a shoulder injury.\n\nKeenum wasn’t the only veteran who got a day off Wednesday. Running back Adrian Peterson (quad) and cornerback Josh Norman (thigh and hand) also missed practice to rest.\n\nCallahan said resting Keenum was “strictly’ for the quarterback’s benefit, not so Haskins could get the reps.\n\nIt is an added bonus, however.\n\nRookie wide receiver Terry McLaurin, who was also Haskins‘ teammate at Ohio State, said the first-rounder is getting more comfortable in the huddle.\n\n“He’s speaking more clear and more concise,” McLaurin said. “So I feel like he’s visualizing things a lot better. He’s making the plays that need to be made on the practice field. He’s controlling what he can control. … Obviously he wants to be out there, but whether he’s taking first-team reps or scout-team reps, he’s treating that like a game-like situation.\n\n“I feel like that is only going to help his development. … I have all the confidence in the world that Dwayne is going to get to where he needs to get.”\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Redskins rookie Dwayne Haskins received all the first-team reps in practice Wednesday as quarterback Case Keenum rested with right shoulder and foot injuries.", "authors": ["The Washington Times Http", "Matthew Paras"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/13/Redskins_Dolphins_Football_46835.jpg-4fba7_c0-173-4154-2596_s1200x700.jpg?8d5f0a954bef189c81b5b072238c9636633816ba", "published_at": "2019-10-16"}