{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7586247/Security-guard-fired-using-n-word-telling-white-student-stop-using-slur.html", "downloaded_at": "2019-10-18 01:24:44.613776+00:00", "title": "Security guard is fired for using the n-word when telling a white student to stop using the slur", "language": "en", "text": "In a brief Facebook post made on Wednesday, Marlon Anderson shared that he was fired from the Madison Metropolitan School District\n\nA Wisconsin security guard is appealing his termination after he was fired for allegedly telling a student not to call him the n-word, using the slur himself - which is against school policy.\n\nIn a brief Facebook post made on Wednesday, Marlon Anderson shared that he was fired from the Madison Metropolitan School District.\n\nHe claimed that a student repeatedly called him a 'b***h a*s n***a.'\n\n'I responded \"do not call me n***a !\" And I got fired,' Anderson said in the post that has been shared more than 500 times and has more than 1000 shares.\n\nHe explained to the Wisconsin State Journal that he had been responding to a call to assist the assistant principal at West High School in escorting a disruptive student.\n\nThe student - identified as being black - reportedly shoved the administrator's hand and started shouting obscenities at Anderson that included the n-word.\n\nHe was assisting an incident at West High School when a student - identified as black - started using the slur against him\n\nAnderson shares he felt 'targeted' by the assistant principal at the school who held a radio near the guard as he and the student talked\n\nAs Anderson told the student not to call him that, he claims the assistant principal turned on the mic on their radio and moved it so other staff radios could hear what he was saying.\n\nAnderson shares he felt 'targeted' as a result.\n\nThe security guard said that he has been called the slur by students from both East and West High School 'many times.' Those moments often end in 'restorative conversations' between him and the students.\n\nAnderson is appealing the termination and has the backing of his community, who feel the policy is 'lazy'\n\nWest High Principal Karen Boran sent an email to parents on Wednesday to inform them of the 'serious incident' that involved 'a staff member using a racial slur with students.'\n\n'As you know, our expectation when it comes to racial slurs has been very clear,' Boran said. 'Regardless of context or circumstance, racial slurs are not acceptable in our schools.'\n\nBoran added that the zero-tolerance approach 'has been applied consistently and will continue to be applied consistently.'\n\n'I also want to ask for your partnership as we work to make our school climate the very best it can be for all of our students and our staff,' she added.\n\nSuperintendent Jane Belmore reiterated the sentiment, adding that there 'has been shared several times through communication and professional development.'\n\nIn the last school year, there were at least seven cases where employees were either fired or resigned for using the slur.\n\nAnderson is appealing the termination and has the backing of his community, who feel the policy is 'lazy.'\n\n'MMSD needs to modify this lazy, harmful and whole-punched policy that allows it to avoid doing the real work that any HR department should do by looking at the context in which such a word (or any other) is used,' explained Kaleem Caire, former CEO of the Urban League of Greater Madison.\n\n'They are an academic institution and should be educating themselves and young people about the use of words like N****r, not running from it.\n\nShe later added: 'Marlon should get his job back plus back-pay. Sometimes leaders have to admit they made a mistake rather than hide behind the mistakes they’ve made. It feels like that is what MMSD is doing here.\n\nThey committed to a flawed policy that was reactionary and not well thought through.", "description": "In a brief Facebook post made on Wednesday, Marlon Anderson shared that he was fired from the Madison Metropolitan School District after telling the student not to call him the slur.", "authors": ["Matthew Wright For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/00/19863328-0-image-a-21_1571356303620.jpg", "published_at": "2019-10-17"}