{"pub": "cbc", "url": "https://cbc.ca/sports/olympics/summer/trackandfield/caster-semenya-gold-medal-track-worlds-1.5280619", "downloaded_at": "2019-09-13 00:57:25.652149+00:00", "published_at": "2019-09-12", "title": "Sports-no-CBC", "language": "en", "text": "Caster Semenya is finally getting her gold medal from the 2011 world championships after Russian runner Maria Savinova was stripped of the title for doping.\n\nBut Semenya won't attend a medal reallocation ceremony at the upcoming world championships in Doha, Qatar, South Africa's track federation said on Thursday.\n\nSemenya was barred from defending her latest 800-metre world title in Doha because she has refused to follow new IAAF rules requiring her to medically reduce her natural testosterone level to be allowed to compete in certain races, including her favourite event.\n\nInstead, Athletics South Africa will receive the medal from the world track body on Semenya's behalf in Doha and decide on an appropriate event to hand the medal to Semenya in South Africa, it said.\n\nThe medal reallocation is happening after the Court of Arbitration for Sport in 2017 upheld Savinova's doping ban, nullifying her results from 2010 to 2013. She was also stripped of her 2012 Olympic gold in the 800 metres. That title has also gone to Semenya, who finished second in that race, too.\n\nSemenya, who has two Olympic and three world titles in the 800, has, since July, not been allowed to compete at top-level track meets in distances from 400 metres to one mile because she has refused to take hormone-suppressing medication in line with rules introduced by the IAAF last year.\n\nSecond appeal underway\n\nSemenya has challenged the rules twice in court. She lost at the Court of Arbitration for Sport this year and her second legal appeal is still being considered by the Swiss supreme court.\n\nIf she fails in court a second time, Semenya may also be unable to defend her Olympic title next year in Tokyo.\n\nSemenya is one of several elite female athletes with a differences of sex development condition, which results in male and female biological characteristics. She was legally identified as female at birth and has identified as female her whole life but was born with the typical male XY chromosome pattern and has testosterone levels higher than the typical female range.\n\nThe IAAF says testosterone gives her an unfair athletic advantage over other female runners and she must reduce it if she wants to run at the Olympics, world championships and Diamond League meetings.\n\nThe contentious rules require Semenya to lower her testosterone to below a level specified by the IAAF and keep it there for at least six months prior to a major race.\n\nShe could run in races outside the restricted events without any medical intervention, which would mean moving up to the 3,000 or 5,000 metres or dropping down to the 200 metres.\n\nSemenya announced last week she was joining a South African soccer club and will play for it in 2020 but later denied that meant she was retiring from athletics.\n\nShe wrote on Twitter: \"Being a footballer doesn't mean I'm no longer a track and field athlete. Just making things clear.\"", "description": "Caster Semenya is finally getting her gold medal from the 2011 world championships after Russian runner Maria Savinova was stripped of the title for doping.", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5280631.1568295338!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/south-korea-athletics-worlds.jpg"}