{"pub": "independent", "title": "Tory leadership race: Why British people deserve a second Brexit referendum", "url": "https://independent.co.uk/voices/brexit-boris-johnson-tory-leadership-race-peoples-vote-a8958451.html", "language": "en", "published_at": "2019-06-14", "downloaded_at": "2019-09-02 07:42:38.419195+00:00", "text": "If you were going to come up with a democratic way of settling the Brexit crisis, it would not look like this: a few dozen journalists chasing around a handful of Tory MPs to carefully staged events, where they court the less than 0.25 per cent of our population that happens to make up the most right-wing and Eurosceptic Conservative Party membership in the party’s history.\n\nThe victor of this hard-right beauty pageant will become prime minister and get the chance to impose their own personal brand of destructive Brexit on the people of Britain, without democratic consent.\n\nBoris Johnson, the charlatan-in-chief widely regarded as a shoo-in for the top job, says he is ready to inflict a catastrophic no deal on the country. His even more ideological rival Dominic Raab has refused to rule out suspending parliament so he can impose no deal against the will of parliament and the country, without a single vote or word of debate.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nShape Created with Sketch. Biggest lies told by Boris Johnson Show all 5 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Biggest lies told by Boris Johnson 1/5 Made-up quote for The Times Johnson was sacked from The Times newspaper in the late 1980s after he fabricated a quote from his godfather, the historian Colin Lucas, for a front-page article about the discovery of Edward II’s Rose Palace. “The trouble was that somewhere in my copy I managed to attribute to Colin the view that Edward II and Piers Gaveston would have been cavorting together in the Rose Palace,” he claimed. Alas, Gaveston was executed 13 years before the palace was built. “It was very nasty,” Mr Johnson added, before attempting to downplay it as nothing more than a schoolboy blunder. PA 2/5 Sacked from cabinet over cheating lie Michael Howard gave Boris Johnson two new jobs after becoming leader of the Conservatives in 2003 – party vice-chairman and shadow arts minister. He was sacked from both positions in November 2004 after assuring Mr Howard that tabloid reports of his affair with Spectator columnist Petronella Wyatt were false and an “inverted pyramid of piffle”. When the story was found to be true, he refused to resign. PA 3/5 Broken promise to boss In 1999 Johnson was offered editorship of The Spectator by owner Conrad Black on the condition that he would not stand as an MP while in the post. In 2001 he stood - and was elected - MP for Henley, though Black did allow him to continue as editor despite calling \"ineffably duplicitous\" PA 4/5 Misrepresenting the people of Liverpool As editor of The Spectator, he was forced to apologise for an article in the magazine which blamed drunken Liverpool fans for the 1989 Hillsborough disaster and suggested that the people of the city were wallowing in their victim status. “Anyone, journalist or politician, should say sorry to the people of Liverpool – as I do – for misrepresenting what happened at Hillsborough,” he said. PA 5/5 ‘I didn’t say anything about Turkey’ Johnson claimed in January, that he did not mention Turkey during the EU referendum campaign. In fact, he co-signed a letter stating that “the only way to avoid having common borders with Turkey is to vote Leave and take back control”. The Vote Leave campaign also produced a poster reading: “Turkey (population 76 million) is joining the EU” 1/5 Made-up quote for The Times Johnson was sacked from The Times newspaper in the late 1980s after he fabricated a quote from his godfather, the historian Colin Lucas, for a front-page article about the discovery of Edward II’s Rose Palace. “The trouble was that somewhere in my copy I managed to attribute to Colin the view that Edward II and Piers Gaveston would have been cavorting together in the Rose Palace,” he claimed. Alas, Gaveston was executed 13 years before the palace was built. “It was very nasty,” Mr Johnson added, before attempting to downplay it as nothing more than a schoolboy blunder. PA 2/5 Sacked from cabinet over cheating lie Michael Howard gave Boris Johnson two new jobs after becoming leader of the Conservatives in 2003 – party vice-chairman and shadow arts minister. He was sacked from both positions in November 2004 after assuring Mr Howard that tabloid reports of his affair with Spectator columnist Petronella Wyatt were false and an “inverted pyramid of piffle”. When the story was found to be true, he refused to resign. PA 3/5 Broken promise to boss In 1999 Johnson was offered editorship of The Spectator by owner Conrad Black on the condition that he would not stand as an MP while in the post. In 2001 he stood - and was elected - MP for Henley, though Black did allow him to continue as editor despite calling \"ineffably duplicitous\" PA 4/5 Misrepresenting the people of Liverpool As editor of The Spectator, he was forced to apologise for an article in the magazine which blamed drunken Liverpool fans for the 1989 Hillsborough disaster and suggested that the people of the city were wallowing in their victim status. “Anyone, journalist or politician, should say sorry to the people of Liverpool – as I do – for misrepresenting what happened at Hillsborough,” he said. PA 5/5 ‘I didn’t say anything about Turkey’ Johnson claimed in January, that he did not mention Turkey during the EU referendum campaign. In fact, he co-signed a letter stating that “the only way to avoid having common borders with Turkey is to vote Leave and take back control”. The Vote Leave campaign also produced a poster reading: “Turkey (population 76 million) is joining the EU”\n\nIt should not need repeating that a no-deal Brexit would be the single most self-destructive act by a modern British government in living memory. It would far surpass the military and diplomatic humiliation of the Suez Crisis, in both the breadth and depth of the damage it will cause. Economically, the Treasury's own analysis makes clear the pain, poverty and punishment it would inflict on the most vulnerable people across the country.\n\nTo impose this without the consent of the British public would be a democratic and constitutional outrage. As the grim consequences of no deal emerge, what’s left of the public’s faith in politicians would collapse like a house of cards. The righteous and justified anger of ignored Remainers would simmer for generations to come.\n\nWith the looming October deadline, the British people only have this summer and autumn to force their way back into the conversation on Brexit.\n\nThat’s why The Independent’s Final Say and People’s Vote campaign is launching an all-out nationwide offensive with rallies in 15 towns and cities in every corner of the country. It will start in Leeds on 22 June and culminate in a massive, historic march in London on 12 October.\n\nWhile Westminster descends further into chaos, narcissism and acrimony the people must be heard. This is a historic moment that all of us who care about the future of our economy, democracy and our union must seize.\n\nThe bleak alternative is sitting back and watching a new prime minister attempt to out-Brexit Nigel Farage, by making the split from the EU as harsh and painful as possible and alienating Britain from its closest allies.\n\nThree years ago, Johnson joined Farage in promising a deal that had all the benefits of EU membership without any of the responsibilities. The pair of snake-oil salesmen peddled the lie that Brexit would improve the NHS, strengthen the economy and improve our standing in the world. After three years of pain, broken promises, endless negotiations and global humiliation, it is clear that this was a con.\n\nBut Johnson and Farage are still at it, shamelessly claiming that people really voted for an extreme version of Brexit or even no deal at all. The truth is that it has never been the “will of the people” to put jobs, livelihoods, our NHS and the integrity of the United Kingdom in jeopardy. That was not on the ballot paper in 2016, and a majority of both parliament and the public reject it now.\n\nThe escalating Brexit crisis isn’t going to be solved by a new prime minister backed by a deeply unrepresentative fraction of the population. It can only be solved by the British people.\n\nThat’s why those who believe a People’s Vote offers the only way out of this crisis will be making our voices are heard at rallies and events across Britain, demanding the Final Say. And it is why, at the moment of truth, on 12 October we will gather in London from every corner of the land to say with one voice: Let us be heard.\n\nThis summer is our opportunity to show the new prime minister – and parliament – that only the people can stop us making a historic mistake.\n\nDavid Lammy is the Labour MP for Tottenham and a leading supporter of the People’s Vote campaign", "description": "If you were going to come up with a democratic way of settling the Brexit crisis, it would not look like this: a few dozen journalists chasing around a handful of Tory MPs to carefully staged events, where they court the less than 0.25 per cent of our population that happens to make up the most right-wing and Eurosceptic Conservative Party membership in the party’s history.", "authors": ["David Lammy"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/06/14/09/boris-johnson.jpg"}