{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/17/poll-most-working-class-swing-voters-say-u-s-too-involved-in-middle-east", "downloaded_at": "2019-10-18 01:12:49.578137+00:00", "title": "Poll: Most Working Class, Swing Voters Say U.S. 'Too Involved' in Syria", "language": "en", "text": "A plurality of working class and swing voters agree with President Trump that the United States is “too involved” in the Middle East, a new poll finds.\n\nA Rasmussen Poll reveals that most likely voters tend to side with Trump in saying that the U.S. is too involved in Middle East conflicts, with a plurality of 37 percent saying so. Meanwhile, less than 20 percent said the U.S. should be more involved, and 36 percent said the current level of involvement is about right.\n\nSwing voters by a wider plurality of 42 percent say the U.S. is too involved in the Middle East, with only 16 percent wanting more U.S. involvement. Another 34 percent of swing voters said the current level of involvement is about right.\n\nMost working class voters, those with only a high school degree, agree with Trump that the U.S. is too involved in the Middle East. About 43 percent of Americans with only a high school degree say the U.S. is too involved as opposed to just 30 percent who said the current level of involvement is about right. Only 17 percent of these working class voters said the U.S. should be more involved in Middle East conflicts.\n\nDespite rebukes from Sen. Mitt Romney (R-UT), Rep. Dan Crenshaw (R-TX), and former President George W. Bush, most Republican voters side with Trump’s “America First” foreign policy agenda, with 41 percent saying the U.S. is too involved in the Middle East and about 40 percent saying the current level of engagement is about right. Only 12 percent of GOP voters said they want more U.S. involvement in the Middle East.\n\nGetting the U.S. out of foreign wars is especially popular with young Americans, who are the most likely to agree with Trump on the issue. A plurality of 45 percent of young likely voters between 18 and 33 said the U.S. is too involved in the Middle East. Another 30 percent said the current level of involvement is about right, and less than 20 percent said they wanted to see more U.S. involvement.\n\nMost recently, the Trump administration announced that up to 1,000 U.S. troops would be withdrawn from northern Syria in an effort to bring American soldiers home following more than a decade of U.S. involvement in Middle East conflict.\n\nJohn Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.", "description": "A plurality of working class and swing voters agree with President Trump that the United States is \"too involved\" in the Middle East.", "authors": ["John Binder"], "top_image": "https://media.breitbart.com/media/2019/10/American-soldier-in-Middle-East-640x335.jpg", "published_at": "2019-10-17"}