{"pub": "breitbart", "url": "https://breitbart.com/news/canadian-police-illegally-shared-info-on-huawei-exec-lawyers-3", "downloaded_at": "2019-10-07 01:11:05.316943+00:00", "title": "Canadian police illegally shared info on Huawei exec: lawyers", "language": "en", "text": "Vancouver (AFP) – Canadian police illegally shared details of Meng Wanzhou’s phone with US authorities, lawyers said Thursday, in a bid to have an extradition case against the top Huawei executive thrown out.\n\nThe 47-year-old chief financial officer of the Chinese telco giant was detained during a stopover at Vancouver airport last December on a US warrant.\n\nThe United States wants to put Meng on trial for fraud for allegedly violating Iran sanctions and lying about it to US banks — accusations her lawyers dispute.\n\nMeng’s lawyers alleged that Canadian border agents and police conducted a “covert criminal investigation” of the Huawei executive on behalf of the American Federal Bureau of Investigations.\n\nThis included the unlawful sharing of serial numbers of her phone and other electronic devices, her defense team claimed.\n\nProsecutors disputed the charges in court filings, saying that Canadian officers were following standard procedures and that Meng’s lawyers were on a “fishing expedition.”\n\nMeng’s team is seeking to prove that her rights were violated during her arrest, in an attempt to put pressure on Canadian authorities to reconsider a decision to proceed with her extradition.\n\nThey have also alleged that she was questioned by Canadian border officers for three hours without being advised of her rights or told of the warrant for her extradition.\n\nMeng’s detention caused an unprecedented diplomatic rift between Canada and China.\n\nNine days after Meng’s arrest, Beijing detained two Canadians — former diplomat Michael Kovrig and businessman Michael Spavor — accusing them of espionage in a move widely viewed as retaliation.\n\nChina has also blocked billions worth of Canadian agricultural shipments, while Canada has rallied the support of allies including Britain, France, Germany and the US, as well as the EU, NATO and the G7.\n\nMeng’s defense, arguing that the case is politically motivated, has also pounced on US President Donald Trump’s remarks that he might seek to have the charges against Meng dropped in exchange for trade concessions from China.\n\nCanada has insisted that it was following the rule of law in Meng’s case, while calling the arrest of its two nationals arbitrary.\n\nIt sacked its ambassador to China in January for suggesting that Meng had a “strong case” against extradition, citing Trump’s remarks.", "description": "Vancouver (AFP) – Canadian police illegally shared details of Meng Wanzhou’s phone with US authorities, lawyers said Thursday, in a bid to", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/06/d6f2f7_huawei-chief-financial-officer-meng-wanzhou-wearing-an-ankle-monitor-is-640x335.jpg", "published_at": "2019-10-06"}