{"pub": "npr", "url": "https://npr.org/2019/09/27/765162483/kristin-chenoweth-is-doing-it-for-the-girls", "downloaded_at": "2019-09-28 01:02:57.070230+00:00", "title": "Kristin Chenoweth Is Doing It 'For The Girls'", "language": "en", "text": "Kristin Chenoweth Is Doing It 'For The Girls'\n\nEnlarge this image toggle caption Krista Schlueter/Courtesy of the artist Krista Schlueter/Courtesy of the artist\n\nWith nearly 30 years in show business, Kristin Chenoweth has won an Emmy and a Tony Award for both her singing and acting. In one of her most famous roles, she sang her way through Oz in a story about sisterhood — the award-winning musical Wicked. Still, Chenoweth says some people are surprised to learn that she's a singer.\n\n\"It's so funny when people come up to me and they're like, 'Oh, I didn't know you sang.' And I'm like, 'What?!,'\" Chenoweth says.\n\nSo, it felt appropriate that Chenoweth's latest album, called For The Girls, honors all the singers that have shaped Chenoweth as a performer. On the album, Chenoweth covers songs originally recorded by women who inspire her and in some cases, those women even join her on the tracks.\n\nChenoweth puts her own spin on classic's from all across the pop music sphere — from Doris Day's \"When I Fall In Love\" to Barbra Streisand's \"The Way We Were.\" Across the album's 12 tracks, there many duets, but Chenoweth says she didn't set out to make this a duets album.\n\n\"It started evolving,\" she says. \"I said, 'You know, Steve [Tyrell], if it's going to be for the girls, I've got to have some of my favorite singers on there.\"\n\nYouTube\n\nOne of the album's standouts, \"I'm A Woman\" — originally popularized by Peggy Lee — features guest vocals from Jennifer Hudson and Reba McEntire. Chenoweth says she directed each woman to put their own spin on their verse regardless of what the arrangement called for.\n\n\"You know what? I don't know how it worked but it did,\" Chenoweth says. \"With three different voices, it just goes to show you there are no more rules anymore.\"\n\nChenoweth counts her duet with Dolly Parton on the song \"I Will Always Love You\" as one of her proudest accomplishments with this album — \"I get goose bumps and I start to cry still,\" she says with a laugh.\n\n\"When I first met her many, many years ago, she said 'I'm like you and you're like me' and I was like 'What?!',\" Chenoweth remembers. \"And I thought, Well, I'm definitely lacking a couple things that we can't mention [laughs] but she was so very kind and I thought if I ever got to sing with her I'd want to sing that song but I never thought she'd give it to me. And she said yes.\"\n\nYouTube\n\nFor The Girls, out now, marks Chenoweth's third album under Concord Records. The artist spoke with NPR's Ari Shapiro about collecting voices from cross generations for the album, jumping out of her comfort zone and adapting classic songs into her own. Hear their conversation at the audio link.", "description": "On her latest album, For The Girls, Kristin Chenoweth covers classic songs originally recorded by women who inspire her and duets with Dolly Parton, Ariana Grande and more.", "authors": ["Ari Shapiro", "Lauren Hodges", "Sarah Handel"], "top_image": "https://media.npr.org/assets/img/2019/09/27/kc_rt_005_wide-fc01c26b66a414a658e814969b65c4bd9a9d8e1f.jpg?s=1400", "published_at": "2019-09-27"}