{"pub": "breitbart", "url": "https://breitbart.com/national-security/2019/10/17/assad-speaks-syrian-army-will-attack-turkey-through-all-legitimate-means", "downloaded_at": "2019-10-18 01:10:08.892523+00:00", "title": "Assad Speaks: Syria Will Attack Turkey 'Through All Legitimate Means'", "language": "en", "text": "Syrian dictator Bashar al-Assad commented personally on Turkey’s invasion of Syrian Kurdistan Thursday, warning that his military “will respond and confront” Turkey’s “terrorism … in all its forms in any region of Syrian territory.”\n\nTurkish President Recep Tayyip Erdogan announced last week that he would invade Syrian Kurdistan (Rojava) to remove the People’s Protection Units (YPG/YPJ) and the Syrian Democratic Forces (SDF), an umbrella group largely composed of YPG fighters. The SDF is an ally of the United States largely responsible for the defeat of the Islamic State in its “capital,” Raqqa.\n\nThe Turkish military and the Free Syrian Army (FSA), a coalition of largely Arab anti-Assad forces including some jihadist elements, launched “Operation Peace Spring” with the objective of creating a “safe zone” for Arab refugees currently in Turkey to return to Syria. The “safe zone” would be Rojava, now stripped of its native Kurdish population.\n\nThe Syrian Democratic Council, the political wing of the SDF, accused Turkey of “genocide” and chemical weapons use on Wednesday.\n\nThe SDF came to an agreement with Turkey and the Assad regime, brokered by Russia, this week that would allow the Syrian military to occupy places currently under Kurdish control in exchange for protection from Erdogan. Erdogan agreed to some of that deal, particularly the Syrian military occupation of Kobani, a key Kurdish border city between Turkey and Syria.\n\nAssad, who had mainly spoken through his foreign ministry officials on “Operation Peace Spring” in the past, threatened a complete military onslaught against Turkey in a meeting with Iraqi National Security Adviser Faleh al-Fayyad Thursday, according to his state-run Syrian Arab News Agency (SANA).\n\n“President al-Assad affirmed that external greed in countries of our region has never stopped throughout history, adding that the Turkish criminal aggression which launched by Erdogan’s regime on our country comes in the context of this greed whatever it has raised of false mottoes,” SANA reported, “so it is a blatant invasion and a clear aggression to which Syria has responded it in many places through striking its agents and terrorists, and Syria will respond and confront it with all its forms in any region of Syrian territory through all available legitimate means.”\n\nSANA accused Turkish forces on Wednesday of looting civilian homes, burning them down, and “beating women” in Kurdish villages. The Turkish government has repeatedly rejected accusations of harming civilians or of ethnic cleansing, though it has admitted that the objective of “Operation Peace Spring” is to repopulate Rojava with Arab refugees.\n\nSANA had previously quoted a Syrian foreign ministry “source” calling “Operation Peace Spring” “an outrageous violation of the international law,” but condemning the Kurdish groups for allying with the United States.\n\n“They have been previously warned during the meetings with them against the dangers of that project and to not be tools serving the US policy against their homeland, but these organizations have insisted on being tools in the hands of foreigners,” SANA claimed.\n\nThe Turkish invasion began after President Donald Trump announced that he would be relocating 50 troops out of Rojava, as the only legal reason for troop deployment there was to fight the Islamic State or al-Qaeda, which were no longer a threat in the area. Kurdish officials have accused Trump of “betrayal” for withdrawing the troops, which they believe provided Turkey with a legitimate reason to stay out of Rojava: fear of accidentally injuring or killing a fellow NATO member soldier.\n\nAssad’s threats towards Erdogan are the latest in years of invective hurled against each other. Both sides have called each other terrorists and accused each other of war crimes.\n\nIn 2016, Erdogan announced that he was preparing an invasion of Syria “to end the rule of the tyrant Assad, who terrorizes with state terror,” and “not any other reason.” He has claimed more recently that his true enemy in Syria is the YPG, but Assad’s forces appear to be preparing for Erdogan’s war not to end with them.\n\nA year later, Erdogan said of Assad, “Assad is definitely a terrorist who has carried out state terrorism. It is impossible to continue with Assad. How can we embrace the future with a Syrian president who has killed close to a million of his citizens?”\n\nIn response, Assad’s foreign ministry accused Erdogan of supporting “takfiri terrorism,” a term Shiites typically use for Sunni jihadists.\n\nIn February, Erdogan admitted that Ankara was maintaining “low-level” communications with the Assad regime.\n\n“Even if it’s your enemy, you will not break the rope completely. Because you might need that rope some time,” he said at the time.\n\nErdogan and Assad appear to agree that the United States is a terrorist ally. Erdogan accused the United States of being “on the side of coups and terror” in 2016; Assad has repeatedly told the United States to “stop supporting terrorists.” As recently as Thursday, columns in pro-Erdogan Turkish media were referring to America as “the patron of terror,” citing Washington’s longstanding alliance with the Kurds.\n\nUnder President Barack Obama, the United States supported the Free Syrian Army.\n\nFollow Frances Martel on Facebook and Twitter.", "description": "Syrian dictator Bashar al-Assad commented on Turkey's invasion of Syria, warning that his military \"will confront\" Turkey's \"terrorism.\"", "authors": ["Frances Martel"], "top_image": "https://media.breitbart.com/media/2019/09/Assad-640x335.jpg", "published_at": "2019-10-17"}