{"pub": "reuters", "url": "https://reuters.com/article/us-china-trade-talks/china-says-will-work-with-the-u-s-to-address-each-others-core-concerns-idUSKBN1WY02D", "downloaded_at": "2019-10-19 11:20:57.156768+00:00", "title": "China says will work with the U.S. to address each other's core concerns", "language": "en", "text": "NANCHANG, China (Reuters) - Chinese Vice Premier Liu He said on Saturday that China will work with the United States to address each other’s core concerns on the basis of equality and mutual respect, and that stopping the trade war would be good for both sides and the world.\n\nFILE PHOTO: China's Vice Premier Liu He hands a letter from China's President Xi Jinping to U.S. President Donald Trump during their meeting in the Oval Office of the White House in Washington, U.S., October 11, 2019. REUTERS/Yuri Gripas/File Photo\n\n“The two sides have made substantial progress in many fields, laying an important foundation for the signing of a phased agreement,” Liu, also the chief negotiator in the trade talks, told a virtual reality conference in Nanchang, the capital of southeastern Jiangxi province.\n\n“Stopping the escalation of the trade war benefits China, the U.S and the whole world. It’s what producers and consumers alike are hoping for,” Liu said in a rare public speech about the trade war.\n\nChina and the United States reached a limited deal last week toward ending the trade war that has roiled global markets and hammered world growth. Both sides are working toward a written agreement.\n\nChina’s third-quarter economic growth slowed to an annual 6.0%, its weakest pace in almost three decades as the bruising trade war hit factory production and investment sentiment.\n\nLiu said on Saturday that China will step up investment in core technologies to accelerate economic restructuring, adding economic prospects remain “very bright”.\n\n“We’re not worried about short-term economic volatility. We have every confidence in our ability to meet macroeconomic targets for the year,” he said.\n\nLiu said improved relations between China and the United States benefited the world.\n\n“Growth in Sino-U.S. economic and trade cooperation is connected to peace, stability and prosperity of the whole world,” he said.\n\n“China and the U.S. can meet each other half way, based on equality and mutual respect, addressing each other’s core concerns, striving to create a good environment and achieving both sides’ common goals.”\n\nThe International Monetary Fund estimated that a tentative trade deal reached by Washington and Beijing last week could reduce the harm done by tit-for-tat tariffs imposed by both countries over the past 15 months.\n\nInstead of dragging global growth down by 0.8%, the impact might be limited to 0.6%, Managing Director Kristalina Georgieva said on Thursday.", "description": "Chinese Vice Premier Liu He said on Saturday that China will work with the United States to address each other's core concerns on the basis of equality and mutual respect, and that stopping the trade war would be good for both sides and the world.", "authors": ["David Kirton", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191019&t=2&i=1442542927&w=1200&r=LYNXMPEF9I02A", "published_at": "2019-10-19"}