{"pub": "hotair", "url": "https://hotair.com/archives/allahpundit/2019/10/01/john-bolton-source-whistleblower", "downloaded_at": "2019-10-02 00:35:48.962271+00:00", "title": "Was John Bolton a source for the whistleblower?", "language": "en", "text": "Having speculated wildly about this very scenario yesterday, I feel obliged to pass along someone else’s slightly better informed wild speculation on the same topic.\n\nThis may not even count as “wild,” come to think of it. Cockburn makes it sound here like his source has reason to believe that *Trump* sees Bolton’s hand in all this.\n\nDid the ‘Stache help expose a scandal that could conceivably end Trump’s presidency? I’m guessing “no,” but…\n\nOne veteran political consultant in Washington tells Cockburn that Trump is afraid Bolton is the mastermind behind all the damaging leaks on his secret dealings with the Ukrainians; the whistleblower’s Deep Throat, if you will. This, he believes, is why Trump’s cheerleader in the Senate, Lindsay Graham, keeps asking who was feeding the CIA whistleblower who came forward with details of a call between Trump and the Ukrainian president (in which Trump asked for dirt on the Democratic frontrunner, Joe Biden). Graham tweeted: ‘It is imperative we find out which White House official talked to the whistleblower and why. Why didn’t they lodge the complaint?’ The price of Graham’s support, the political consultant thought, would be an eventual military strike on Iran. He went on: ‘Watch Bolton’s role in all this. If he is in mix then Trump has real problems. I hear that Trump was obsessed with Bolton when he [Trump] was in New York. When Trump says the real whistleblower is a spy and should be treated as such, he’s threatening Bolton. Bolton would not play his game in Korea, Iran, Russia or Ukraine. This is Trump’s Achilles heel.’ All of this is pure speculation but interesting speculation nonetheless. The next time Bolton pops up to make a speech criticizing his old boss, perhaps someone should ask him if he was aware of contents of the call with the Ukrainian president back in July – and if he was, did he do anything about it?\n\nLogically, if Bolton were feeding the whistleblower information, you would expect the two to have been in proximity — i.e., you’d expect the whistleblower to work in the field of national security and to have White House access, just like the National Security Advisor. If so, the topic of Trump’s call with Zelensky might have conceivably come up between them in the course of official business. Or, if Bolton were feeding information to the whistleblower surreptitiously in hopes of seeing it reported to Congress, the fact that they worked in the same place in the same field would have given them an “innocent” reason to converse frequently, without anyone becoming suspicious at the time.\n\nAs it turns out, if you believe the New York Times, the whistleblower does work in national security and was stationed at 1600 Pennsylvania Avenue for some period of time. He’s a CIA officer and was “detailed to work at the White House at one point,” the paper claimed. Hmmmm!\n\nWe have means and opportunity, then. But what about motive? The whistleblower complaint was submitted to the ICIG by August 12. Bolton wasn’t fired until September 10. If Bolton is a source, why’d he stay on the job knowing/expecting that the complaint would eventually land in Democrats’ hands and the resulting investigation would sniff him out as a source? It’s easy to imagine the ‘Stache seeking revenge on Trump with damaging leaks after his termination. But while he was still NSA?\n\nOn the other hand, he had been marginalized in his role by the president by mid-August and even sporadically humiliated by him, like when he was sent to Mongolia while Trump met Kim Jong Un at the DMZ. It’s not hard to imagine him bearing Trump a grudge while he still held his position in the West Wing. Maybe Bolton was whispering to the whistleblower about Ukraine not knowing or expecting what the guy might do with the information; maybe he thought he’d simply leak it to the media instead of filing a formal complaint that would trigger a Democratic investigation that risked sniffing Bolton out as a source. Once Bolton realized that he would probably be outed, maybe that was his cue to finally “resign” as NSA and bail out before things got hairy.\n\nOne question, though. How much direct contact would the National Security Advisor have with a random CIA officer detailed to the White House? Bear in mind that Bolton was known for not bothering much with traditional natsec mechanisms like the National Security Council, in which case his opportunities to interact with junior intel people in the building were probably even more limited than most NSAs’ were. If you want to believe Bolton’s a source, you need to explain how he arrives at the decision to share potentially explosive dirt about presidential misconduct with some dude who normally doesn’t even work inside the building. Did Bolton know the whistleblower before the guy arrived at the White House? Why would he have trusted him enough to leak to him?\n\nMy strong suspicion is that he had no involvement in the whistleblower process, or certainly no direct involvement. Maybe something happened where Bolton told a deputy what Trump said to Zelensky, the deputy told his own deputy, and that deputy told the whistleblower. I don’t think Bolton intended for anything to be revealed — although I also wouldn’t put it past him to start corroborating details for the media about what went on with Ukraine now that he’s unemployed again. Bolton and Mike Pompeo have been on the outs for months and lo and behold we found out yesterday that Pompeo was on the call with Trump and Zelensky on July 25. How’d the press nail that fact down? I wonder.\n\nHere’s Bolton yesterday making his disagreements with Trump’s North Korea policy plain.", "description": "Hmmmm.", "authors": ["Ed Morrissey", "John Sexton", "Jazz Shaw", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/10/b-1.jpg", "published_at": "2019-10-01"}