{"pub": "news.com.au", "url": "https://heraldsun.com.au/technology/accc-issues-urgent-warning-on-20000-cars-with-critical-takata-airbags/news-story/f1598cdca4084d302f1b7b6d14e1fdfe", "downloaded_at": "2019-10-05 10:35:01.568928+00:00", "title": "Takata issues urgent recall on airbags for Honda, BMW, Toyota cars", "language": "en", "text": "The consumer watchdog has warned owners of 20,000 cars on Australian roads to stop driving them “immediately” due to a potentially deadly defect.\n\nThe 20,000 cars fitted with Takata airbags are already subject to a recall, but the Australian Competition and Consumer Commission has now classified the vehicles as “critical” and says they shouldn’t be driven until the explosive airbags are replaced.\n\nFull list here: Takata airbags, is your car affected?\n\n“Classification as ‘critical’ means manufacturers have assessed these airbags as being particularly unsafe. A Takata airbag misdeployment can result in death or serious injury, even in a minor collision,” ACCC deputy chair Delia Rickard said.\n\nThe critical airbags are part of a sub-category of faulty Takata airbags that have been identified as posing an increased risk.\n\nmedia_camera More than 3.3 million Takata airbags have been replaced so far.\n\nThe terms of the recall mean drivers are entitled to have their car towed to the dealer for replacement, and may be entitled to a loan vehicle as well.\n\n“We encourage all drivers to check if their vehicle is affected, even if they have checked before, and to act immediately to have their airbag replaced,” Ms Rickard said.\n\nDON’T DRIVE THESE CARS UNTIL THEY’RE FIXED\n\nBMW (7909 vehicles affected)\n\n• E39 5-Series (2002-2003)\n\n• E46 3-Series (2001-2006)\n\n• E53 X5 (2003)\n\nHONDA (6043 vehicles affected)\n\n• City (2012)\n\n• CR-V (2011)\n\n• Insight (2012-2013)\n\n• Jazz (2012-2014)\n\n• Jazz Hybrid (2012-2013)\n\n• Civic (2006-2011)\n\n• Legend (2007-2012)\n\n• Accord (2001-2007)\n\n• MDX (2003-2006)\n\nMITSUBISHI (3254 vehicles)\n\n• Triton (2007-2014)\n\nHOLDEN\n\n• Cruze (2010)\n\nTOYOTA\n\n• Echo (2003-2005)\n\n• Rav4 (2003-2005)\n\nMany of the vehicles on the list are fitted with Takata’s even more problematic “Alpha” airbags, which left the factory with a range of defects.\n\nProperly manufactured airbags have a roughly 0.27 per cent chance of rupturing when deployed, but with Takata’s Alpha airbags that number can be as high as 50 per cent.\n\nConsumers can check whether their car is affected by contacting their carmaker or entering their vehicle identification number on their website, by visiting ProductSafety.gov.au, or the Federal Chamber of Automotive Industries (FCAI) website IsMyAirbagSafe.com.au.\n\nYou can also text 0487 AIRBAG for more information.\n\nThe FCAI revealed last month more than eight million people have used the website to check their vehicle so far, and 1.3 million have identified a vehicle with faulty airbags.\n\nThe Takata airbag recall has been the world’s largest automotive recall, affecting millions of motorists.\n\nA Victorian Department of Transport spokesperson said: “Our priority is to ensure everyone is safe on the road which is why, in line with the ACCC’s strict advice, we’re urging affected vehicle owners not to drive their cars and to contact their local dealer immediately to get the dangerous airbags replaced.\n\n“As soon as the ACCC confirms manufacturers have exhausted all options to contact affected owners the Department will begin implementing registration sanctions.\n\n“This will inconvenience some drivers but the Department will take this urgent action as soon as possible to protect motorists from the deadly airbags.”\n\nRELATED: VicRoads lashed over Takata airbag safety\n\nRELATED: Takata knew about defects as early as 2000\n\nMore than 3 million airbags have already been replaced, but there are still another 483,071 that need fixing urgently.\n\nThe government issued a compulsory recall last year after an investigation by the ACCC.\n\nBefore that, Takata had issued recalls that eventually bankrupted the company in 2017.\n\nTwenty-nine reported deaths and 320 injuies around the world have been linked to Takata airbags, including one death in Australia.\n\nA NSW Coroner’s Court inquest into the death of Huy Neng Ngo, 58, has heard the fatal injuries he suffered when his Honda CR-V’s faulty Takata airbag deployed were comparable to being shot.\n\nMr Ngo died after a relatively minor crash at Cabramatta in Sydney’s west on July 13, 2017.\n\nHe had reportedly been scheduled to have the airbags replaced two days earlier but his appointment was postponed.\n\nRELATED: Drastic action on deadly airbags\n\nNews Corp Australia’s national motoring editor Richard Blackburn said motorists who had deliberately avoided getting their airbags replaced needed to stop being stubborn.\n\n“These things are just ticking time bombs and anyone who hasn’t had theirs fixed by now needs to. You shouldn’t be driving a car with one of these airbags,” Mr Blackburn said.\n\nAll states and territories with the exception of Victoria, now have the power to cancel or deny registration for recalled vehicles that haven’t had their airbags replaced.\n\nThe automotive industry has been steadily completing the recall, but has faced difficulty from reluctant customers.\n\nRELATED: Deadly airbags remain a danger on our roads\n\nOne of the problems manufacturers face is tracking them down, according to Mr Blackburn.\n\n“It’s illegal for a dealer to sell the cars on without having the airbags fixed but there’s nothing stopping private sellers,” he said.\n\n“We’re getting down to the last of the lost, but the problem is the cars have changed hands multiple times and each time it gets harder to track the owner down.”\n\nDo you think people should have their registration denied for not fixing their airbags? Comments below\n\nOriginally published as ‘Stop driving now’: 20,000 cars affected", "description": "The consumer watchdog has urged owners of these 20,000 vehicles to stop driving them immediately due to a potentially deadly defect.", "authors": [], "top_image": "https://cdn.newsapi.com.au/image/v1/15e370288a04a743216ad3cde2c2160c", "published_at": "2019-10-04"}