{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7617341/Kamikaze-Kids-new-level-Sam-Underhill-Tom-Curry-blew-New-Zealand-apart.html", "downloaded_at": "2019-10-27 00:07:00.375298+00:00", "title": "Kamikaze Kids go to new level as Sam Underhill and Tom Curry blew New Zealand apart", "language": "en", "text": "Whack. Hello New Zealand, I'm Sam Underhill. Whack. And I'm Tom Curry.\n\nThe old talk of the All Blacks not knowing the names of Englishmen resurfaced this week before this epic semi-final — but now they know. Now the world knows about the Kamikaze Kids who blew New Zealand apart.\n\nThat was the name Eddie Jones gave the duo when he first started the pair together against Ireland this summer.\n\nEngland have played five Tests with Tom Curry and Sam Underhill on the flanks\n\nEngland have played five Tests with Curry and Underhill on the flanks, and not just won them all, but completely dominated in each.\n\nCurry, 21, was nine years old the last time New Zealand lost at the World Cup. Underhill was 11. Their whole lives the All Blacks have not just been good, but practically invincible. Screw that, they seemed to say in Yokohama, how do you like it up you New Zealand?\n\nThe dynamic duo have just 32 caps between them, but surely years left together at this rate.\n\nUnderhill, particularly, was loving it. The 126-cap, double World Cup-winning All Black captain Kieran Read was marmalised with one massive hit, then Jordie Barrett dawdled near his own line and was eviscerated. It was surely the most destructive an England forward has been in the tackle.\n\n'You have got to be good at something and I can't kick,' was the 23-year-old's gloriously matter-of-fact summation of his smashing show. 'Defence is always a good indicator of where a team is at mentally because the majority of it is just effort.\n\n'This is the best experience of my life, never mind rugby, I can't think what would top this. It is awesome. It is a bit surreal at the moment because we are in it (the final) but I have loved every minute of it.'\n\nCurry, 21, was nine years old the last time New Zealand lost a match at the World Cup\n\nEngland turned the ball over no less than 16 times in the stupendous semi-final. There have been so many years where those in white have been totally outgunned at the breakdown, by Richie McCaw, David Pocock, Michael Hooper, Sam Warburton and Justin Tipuric — hell, even John Barclay, Hamish Watson and Mathieu Bastareaud as recently as last year.\n\nBut now Jones has two firing cannons in his arsenal.\n\nBoth have been nurtured by 2003 hero, turned team manager, Richard Hill.\n\nHill used to ring up Curry when he was 15 — analysing his matches, checking on his progress — and he spotted Underhill when he played in Wales for Cardiff University and then the Ospreys.\n\nHow he would have danced in delight seeing them tear apart the 'most dominant team in sport' to take themselves one step from immortality.\n\nIt is ridiculous to think that, at 26, Billy Vunipola is the elder statesman of this incredible back row. He is starring too, but has been left in awe of the 'Curryhill' combination.\n\n'They're like the Duracell Bunnies, they just go all day!' Vunipola smiled after the win.\n\n'It allows me to rest, so I can help in other ways. I just kick back and watch them do their thing. The work they put in is quite inspiring for me and the rest of the team. It's not just the hits but the turnovers, the work with the ball, and for two lads that are quite young on this stage I hope they have many more caps ahead of them, and stay injury-free.\n\n'I don't know who started going to the gym earlier between the two of them, but those boys started early!\n\n'Unders doesn't have a neck as his back is so big, and Curry is the same. He's massive.\n\n'They are inspiring guys like me who are older than them. I hope they can keep that up as they have been on fire.\n\n'At the moment they are smashing it.'\n\nLiterally. Whack, whack, whack, all the way to the final.", "description": "WILL KELLEHER AT THE YOKOHAMA STADIUM: Whack. Hello New Zealand, I'm Sam Underhill. Whack. And I'm Tom Curry. The old talk of the All Blacks not knowing their names resurfaced.", "authors": ["Will Kelleher For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/21/20225458-0-image-a-9_1572121470716.jpg", "published_at": "2019-10-26"}