{"pub": "independent", "title": "‘I worked and paid taxes here for a decade. Now I can’t feed my kids’: Family on brink of homelessness after Home Office revokes UK status over tax error", "url": "https://independent.co.uk/news/uk/home-news/home-office-tax-status-uk-family-homeless-pakistan-immigration-a8789901.html", "language": "en", "published_at": "2019-02-23", "downloaded_at": "2019-09-02 09:05:38.203186+00:00", "text": "“This used to be my children’s toy room. Now all five of us sleep in here.” Ikram Ullah gestures into a room on the ground floor of a shared house in East Ham. A single and double bed wedged together cover most of the floor. His baby son’s cot, along with a wardrobe and a chest of drawers, cram into the remaining space.\n\nThe 42-year-old’s daughters, aged five and four, huddle together at the end of the bed playing games on an iPad. His four-month-old son sleeps soundly in his cot. Noreen, Ikram’s wife, perches on the edge of the bed, apologising profusely that she can’t even offer to make a cup of tea.\n\nJust over a year ago, the family had been renting the whole house. Having lived in Britain for a decade, Ikram owned his own business selling cars and was generating an annual turnover of £160,000. His UK-born daughters had their own bedrooms. The couple were looking to buy a home, and were excited to be expecting their third child.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nBut their lives were transformed when, in 2018, Ikram’s application for indefinite leave to remain was refused due to minor amendments to his tax records. He was stripped of his right to work, leaving the family with no income. As the months went on, they had to sell the children’s toys, and eventually scale down to renting just a single room – just to be able to eat.\n\n“My kids are suffering,” says Ikram. “I can’t buy food for them. I go to Tesco after 4pm and buy reduced expired food, which I’ve never done before. I used to buy a lot of things for them before 2018. But then I had to start selling. I sold all of their toys so that I could feed them.”\n\nShape Created with Sketch. UK news in pictures Show all 50 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. UK news in pictures 1/50 1 September 2019 Members of the Royal Southern Yacht Club and the Island Sailing Club take part during the annual cricket match between the clubs, which takes place on the Bramble Bank sandbank in the middle of the Solent at low tide PA 2/50 31 August 2019 Anti-Brexit protesters demonstrate at Whitehall in London SWNS 3/50 30 August 2019 One of the iconic 'Girl with Balloon' artworks by anonymous street artist Banksy is carried near one of the original locations the artwork appeared at on the Southbank in London AP 4/50 29 August 2019 The sun rises over the sculpture \"The Couple\" by artist Sean Henry, at Newbiggin-by-the-sea in Northumberland PA 5/50 28 August 2019 A person wearing a Boris Johnson 'head' digs a grave at the foot of a tombstone during a protest organised by Avaaz and Best for Britain, outside Downing Street in London PA 6/50 27 August 2019 Nat Lofthouse statue is covered in flags at the University of Bolton Stadium, Bolton Action Images via Reuters 7/50 26 August 2019 Performers take part in Notting Hill Carnival. Nearly one million people were expected to attend Sunday and Monday's carnival to celebrate Caribbean culture. AFP/Getty 8/50 25 August 2019 A competitor swims in the World Bog Snorkelling Championships in Llanwryd Wells, Powys. Reuters 9/50 24 August 2019 People flock to Bournemouth beach as a heatwave spells potentially record high temperatures for the bank holiday weekend. PA 10/50 23 August 2019 Fans of Bury FC deliver a symbolic coffin to the club's home at Gigg Lane as the continuation of their membership to the football league lies in doubt. The club will lose their membership at midnight if they don't find a buyer or prove that they have the means to pay off their debts. PA 11/50 22 August 2019 Labour Leader Jeremy Corbyn and Shadow DEFRA Secretary Sue Hayman during a visit to Rakefoot Farm, Castlerigg, Keswick where they are highlighting the danger of a No Deal Brexit to sheep farmers. PA 12/50 21 August 2019 Festival goers walk along the towpath of the River Thames as they arrive for the Reading Festival at Richfield Avenue. PA 13/50 20 August 2019 Police officers gather to pay their respects at the scene near Ufton Lane, where Thames Valley Police officer PC Andrew Harper, 28, died on Thursday. Jed Foster, 20, has appeared at Reading Magristrates' Court where denied any involvement with the murder. PA 14/50 19 August 2019 A fire that broke out at the site of Village Bakery on Coed Aben Road, Wrexham Industrial Estate in Wales. Jord_wxm29/Twitter/PA 15/50 18 August 2019 England fielders crowd Pat Cummins as he see's out the final over during day five of the second Ashes Test match against Australia at Lord's Cricket Ground. The test ended in a draw. Getty 16/50 17 August 2019 Glew (centre) and Monroe Adams (right) pose for a selfie with a member of the public outside DragWorld London 2019, Europe's largest drag convention, featuring drag stars from the US and UK during a two-day event at Olympia, London. PA 17/50 16 August 2019 A grey seal with fishing net tangled around its neck amongst the colony on the beach at Horsey in Norfolk, as RSPCA data show the number of animals affected by plastic litter is at an all-time high, with incidents increasing by 22% in just four years. PA 18/50 15 August 2019 A flock of sheep are herded past government buildings in London by members of Farmers for a People's Vote, a campaign group. PA 19/50 14 August 2019 Swedish climate activist Greta Thunberg speaks during a press conference at the Mayflower Marina in Plymouth, southwest England, on August 14, 2019, ahead of her journey across the Atlantic to New York, aboard the Malizia II IMOCA class sailing yacht, where she will attend the UN Climate Action Summit next month. - A year after her school strike made her a figurehead for climate activists, Greta Thunberg believes her uncompromising message about global warming is getting through -- even if action remains thin on the ground. The 16-year-old Swede, who sets sail for New York this week to take her message to the United States, has been a target for abuse but sees that as proof she is having an effect. AFP/Getty Images 20/50 12 August 2019 A hare runs on a moor near Ripon, North Yorkshire. PA 21/50 11 August 2019 Britain’s Jamie Chadwick wins first-ever W Series title. She pocketed a prize of £410,000 and, having been signed as a development driver for Williams, she keeps up her hopes of making it into Formula One. Getty 22/50 10 August 2019 People gather on the beach as a raft carrying people dressed as clowns heads to shore during the annual Whitby Regatta in Whitby, England. At over 170 years old, the Whitby Regatta is thought to be the oldest sea regatta on the northeast coast of England and draws thousands of visitors each year. Getty 23/50 9 August 2019 Burryman Andrew Taylor, gets a nip of whisky using a straw, from resident Mary Hamblin, 82, as he parades through the town of South Queensferry, near Edinburgh, encased in burrs. The parade takes place on the second Friday of August each year and although the exact meaning of this tradition has been lost through the years it is thought to have begun in the 17th Century. The tradition is believed to bring good luck to the towns people if they give him whisky offered through a straw or a donation of money. PA 24/50 8 August 2019 A mosque is seen amongst residential housing from the air during a mass take off at the annual Bristol hot air balloon festival in Bristol. Reuters 25/50 7 August 2019 An Asiatic lioness eats meat during feeding time ahead of World Lion Day at London Zoo. Reuters 26/50 6 August 2019 Beer enthusiasts taste beer and ale during The Great British Beer Festival at Kensington Olympia in west London. The Great British Beer Festival, organised by the Campaign for Real Ale (CAMRA), brings hundreds of real ales, international beers and real ciders and perries under one roof. AFP/Getty Images 27/50 5 August 2019 Australia's Nathan Lyon celebrates after taking the wicket of England's Joe Root during day five of the first Ashes test at Edgbaston. The hosts were on the end of a thumping, as Australia won the first test by 251 runs. Getty 28/50 4 August 2019 Franky Zapata stands on his jet-powered \"flyboard\" prior to landing on St. Margaret's Bay in Dover, during his attempt to fly across the 35-kilometre (22-mile) Channel crossing. The Frenchman achieved his aim today, on his second attempt, after having spent years developing the jet-powered hoverboard. AFP/Getty 29/50 3 August 2019 A Cricket fan wears a Donald Trump inflatable, during day three of the first Ashes test cricket match between England and Australia at Edgbaston in Birmingham. AP 30/50 2 August 2019 An RAF Chinook helicopter flies in sandbags to help repair the dam at Toddbrook Reservoir which was damaged in heavy rainfall. PA 31/50 1 August 2019 Stuart Broad celebrates after taking the wicket of David Warner during day one of the first Ashes test between England and Australia at Edgbaston. England fans celebrated the loss of David Warner and Cameron Bancroft dismissals by waving sandpaper after they both faced bans for their roles in the Sandpaper scandal last year. Australia were all out for 284 after Steve Smith frustrated the hosts with a total of 144. He helped drag his side from 122-8. Getty 32/50 31 July 2019 A collapsed bridge near Grinton, North Yorkshire, after parts of the region had up to 82.2mm of rain in 24 hours on Tuesday. PA 33/50 30 July 2019 Acrobats Beren d'Amico, Louis Gift and Charlie Wheeller, from Barely Methodical Troupe perform a routine on Calton Hill in Edinburgh as they bring their debut show Bromance to the Edinburgh Fringe. PA 34/50 29 July 2019 Theresa the robotic waitress at The Tea Terrace's Cobham branch in Surrey. Theresa represents the 6th Generation of robotic waitresses which were first launched in Japan a few years ago. The robot comes with autonomous navigation; automatic obstacle avoidance, voice conversation, and automatic dish delivery. It integrates core technologies in automatic control, multi-sensor perceptual collision avoidance and route planning. PA 35/50 28 July 2019 Competitors during the World Stinging Nettle Eating Championship at The Bottle Inn in Marshwood. Competitors are served 2-foot long stalks of stinging nettles from which they pluck and eat as many leaves as possible. Getty 36/50 27 July 2019 A woman in character as La Muerte from film The Book of Life, during the MCM Manchester Comic Con which see thousands of sci-fi fans, gamers, comic collectors, movie buffs and anime enthusiasts visit Manchester Central. PA 37/50 26 July 2019 England's Jonny Bairstow takes the catch to dismiss Ireland's William Porterfield during their test march at Lord's. Ireland were bowled out for 38 in their second innings in just 15.4 overs - the second lowest total in Test match history. Action Images via Reuters 38/50 25 July 2019 Hamza and Haris splash in the water feature beside the National Football Museum in central Manchester, as the UK braces itself to encounter the hottest July day on record. PA 39/50 24 July 2019 Boris Johnson waves as he enters 10 Downing Street following his appointment as Prime Minster by the Queen. The former London mayor and foreign secretary won his leadership bid by beating Jeremy Hunt in the Tory race the day before. Theresa May stepped down following her resignation as Conservative Party leader on 7 June. EPA 40/50 23 July 2019 Swimmers have fun in the sea on a giant inflatable Flamingo, South Beach,Tenby, Pembrokeshire. Reuters 41/50 22 July 2019 New Liberal Democrat leader Jo Swinson addresses the audience onstage after she was named as Sir Vince Cable's successor. Swinson beat fellow candidate Ed Davey by 47,997 votes to 28,021 votes. Getty 42/50 21 July 2019 Adam Peaty broke his own world record in the men's 100 metre breaststroke at the World Championships in Gwangju, South Korea. The 24-year-old smashed the previous record of 57.10 seconds he set at last year's European Championships to win in 56.88. In doing so, the Britain achieved one of his career goals of becoming the first man to break the 57-second barrier in the event. Reuters 43/50 20 July 2019 London artist Helen Marshall's People's Moon project, a giant photographic mosaic shown at the exact hour 50 years ago that Apollo 11 landed the first people on the Moon, at Piccadilly Circus, London. PA 44/50 19 July 2019 Players from Uganda and Malawi during their Netball World Cup match at the M&S Bank Arena, Liverpool. PA 45/50 18 July 2019 Artist Steve Messam poses next to his monumental landscape artwork 'Hush' which hangs in the moors of Teesdale on July 18, 2019 in Barnard Castle, England. The outdoor installation is inspired by the geology, mining history and landscape of the area. The North Pennines AONB Partnership commissioned the installation which hangs over Bales Hush, a deep gauge in the terrain created when miners flushed the area with water to reveal the geological riches below. Hundreds of metres of recyclable saffron yellow fabric blow in the wind. Getty 46/50 17 July 2019 Buckingham Palace staff arrange the dining table, a copy of Queen Victoria's reign dessert table, as part of an exhibition at Buckingham Palace, in London. The exhibition marks the 200th anniversary of the birth of Queen Victoria. AP 47/50 16 July 2019 The Inveraray pipe band parades through the town at the start of the Highland Games in Inverarary, Scotland. Getty 48/50 15 July 2019 Extinction Rebellion Activists block roads near the Tron Clock tower in Glasgow. Getty 49/50 14 July 2019 Serbia's Novak Djokovic raises the winner's trophy after beating Switzerland's Roger Federer during their men's singles final on day thirteen of the 2019 Wimbledon Championships at The All England Lawn Tennis Club. AFP/Getty 50/50 13 July 2019 The referee counts Nathan Gorman out as Daniel Dubois looks on during the British Heavyweight Title fight between Daniel Dubois and Nathan Gorman at The O2 Arena in London. Getty 1/50 1 September 2019 Members of the Royal Southern Yacht Club and the Island Sailing Club take part during the annual cricket match between the clubs, which takes place on the Bramble Bank sandbank in the middle of the Solent at low tide PA 2/50 31 August 2019 Anti-Brexit protesters demonstrate at Whitehall in London SWNS 3/50 30 August 2019 One of the iconic 'Girl with Balloon' artworks by anonymous street artist Banksy is carried near one of the original locations the artwork appeared at on the Southbank in London AP 4/50 29 August 2019 The sun rises over the sculpture \"The Couple\" by artist Sean Henry, at Newbiggin-by-the-sea in Northumberland PA 5/50 28 August 2019 A person wearing a Boris Johnson 'head' digs a grave at the foot of a tombstone during a protest organised by Avaaz and Best for Britain, outside Downing Street in London PA 6/50 27 August 2019 Nat Lofthouse statue is covered in flags at the University of Bolton Stadium, Bolton Action Images via Reuters 7/50 26 August 2019 Performers take part in Notting Hill Carnival. Nearly one million people were expected to attend Sunday and Monday's carnival to celebrate Caribbean culture. AFP/Getty 8/50 25 August 2019 A competitor swims in the World Bog Snorkelling Championships in Llanwryd Wells, Powys. Reuters 9/50 24 August 2019 People flock to Bournemouth beach as a heatwave spells potentially record high temperatures for the bank holiday weekend. PA 10/50 23 August 2019 Fans of Bury FC deliver a symbolic coffin to the club's home at Gigg Lane as the continuation of their membership to the football league lies in doubt. The club will lose their membership at midnight if they don't find a buyer or prove that they have the means to pay off their debts. PA 11/50 22 August 2019 Labour Leader Jeremy Corbyn and Shadow DEFRA Secretary Sue Hayman during a visit to Rakefoot Farm, Castlerigg, Keswick where they are highlighting the danger of a No Deal Brexit to sheep farmers. PA 12/50 21 August 2019 Festival goers walk along the towpath of the River Thames as they arrive for the Reading Festival at Richfield Avenue. PA 13/50 20 August 2019 Police officers gather to pay their respects at the scene near Ufton Lane, where Thames Valley Police officer PC Andrew Harper, 28, died on Thursday. Jed Foster, 20, has appeared at Reading Magristrates' Court where denied any involvement with the murder. PA 14/50 19 August 2019 A fire that broke out at the site of Village Bakery on Coed Aben Road, Wrexham Industrial Estate in Wales. Jord_wxm29/Twitter/PA 15/50 18 August 2019 England fielders crowd Pat Cummins as he see's out the final over during day five of the second Ashes Test match against Australia at Lord's Cricket Ground. The test ended in a draw. Getty 16/50 17 August 2019 Glew (centre) and Monroe Adams (right) pose for a selfie with a member of the public outside DragWorld London 2019, Europe's largest drag convention, featuring drag stars from the US and UK during a two-day event at Olympia, London. PA 17/50 16 August 2019 A grey seal with fishing net tangled around its neck amongst the colony on the beach at Horsey in Norfolk, as RSPCA data show the number of animals affected by plastic litter is at an all-time high, with incidents increasing by 22% in just four years. PA 18/50 15 August 2019 A flock of sheep are herded past government buildings in London by members of Farmers for a People's Vote, a campaign group. PA 19/50 14 August 2019 Swedish climate activist Greta Thunberg speaks during a press conference at the Mayflower Marina in Plymouth, southwest England, on August 14, 2019, ahead of her journey across the Atlantic to New York, aboard the Malizia II IMOCA class sailing yacht, where she will attend the UN Climate Action Summit next month. - A year after her school strike made her a figurehead for climate activists, Greta Thunberg believes her uncompromising message about global warming is getting through -- even if action remains thin on the ground. The 16-year-old Swede, who sets sail for New York this week to take her message to the United States, has been a target for abuse but sees that as proof she is having an effect. AFP/Getty Images 20/50 12 August 2019 A hare runs on a moor near Ripon, North Yorkshire. PA 21/50 11 August 2019 Britain’s Jamie Chadwick wins first-ever W Series title. She pocketed a prize of £410,000 and, having been signed as a development driver for Williams, she keeps up her hopes of making it into Formula One. Getty 22/50 10 August 2019 People gather on the beach as a raft carrying people dressed as clowns heads to shore during the annual Whitby Regatta in Whitby, England. At over 170 years old, the Whitby Regatta is thought to be the oldest sea regatta on the northeast coast of England and draws thousands of visitors each year. Getty 23/50 9 August 2019 Burryman Andrew Taylor, gets a nip of whisky using a straw, from resident Mary Hamblin, 82, as he parades through the town of South Queensferry, near Edinburgh, encased in burrs. The parade takes place on the second Friday of August each year and although the exact meaning of this tradition has been lost through the years it is thought to have begun in the 17th Century. The tradition is believed to bring good luck to the towns people if they give him whisky offered through a straw or a donation of money. PA 24/50 8 August 2019 A mosque is seen amongst residential housing from the air during a mass take off at the annual Bristol hot air balloon festival in Bristol. Reuters 25/50 7 August 2019 An Asiatic lioness eats meat during feeding time ahead of World Lion Day at London Zoo. Reuters 26/50 6 August 2019 Beer enthusiasts taste beer and ale during The Great British Beer Festival at Kensington Olympia in west London. The Great British Beer Festival, organised by the Campaign for Real Ale (CAMRA), brings hundreds of real ales, international beers and real ciders and perries under one roof. AFP/Getty Images 27/50 5 August 2019 Australia's Nathan Lyon celebrates after taking the wicket of England's Joe Root during day five of the first Ashes test at Edgbaston. The hosts were on the end of a thumping, as Australia won the first test by 251 runs. Getty 28/50 4 August 2019 Franky Zapata stands on his jet-powered \"flyboard\" prior to landing on St. Margaret's Bay in Dover, during his attempt to fly across the 35-kilometre (22-mile) Channel crossing. The Frenchman achieved his aim today, on his second attempt, after having spent years developing the jet-powered hoverboard. AFP/Getty 29/50 3 August 2019 A Cricket fan wears a Donald Trump inflatable, during day three of the first Ashes test cricket match between England and Australia at Edgbaston in Birmingham. AP 30/50 2 August 2019 An RAF Chinook helicopter flies in sandbags to help repair the dam at Toddbrook Reservoir which was damaged in heavy rainfall. PA 31/50 1 August 2019 Stuart Broad celebrates after taking the wicket of David Warner during day one of the first Ashes test between England and Australia at Edgbaston. England fans celebrated the loss of David Warner and Cameron Bancroft dismissals by waving sandpaper after they both faced bans for their roles in the Sandpaper scandal last year. Australia were all out for 284 after Steve Smith frustrated the hosts with a total of 144. He helped drag his side from 122-8. Getty 32/50 31 July 2019 A collapsed bridge near Grinton, North Yorkshire, after parts of the region had up to 82.2mm of rain in 24 hours on Tuesday. PA 33/50 30 July 2019 Acrobats Beren d'Amico, Louis Gift and Charlie Wheeller, from Barely Methodical Troupe perform a routine on Calton Hill in Edinburgh as they bring their debut show Bromance to the Edinburgh Fringe. PA 34/50 29 July 2019 Theresa the robotic waitress at The Tea Terrace's Cobham branch in Surrey. Theresa represents the 6th Generation of robotic waitresses which were first launched in Japan a few years ago. The robot comes with autonomous navigation; automatic obstacle avoidance, voice conversation, and automatic dish delivery. It integrates core technologies in automatic control, multi-sensor perceptual collision avoidance and route planning. PA 35/50 28 July 2019 Competitors during the World Stinging Nettle Eating Championship at The Bottle Inn in Marshwood. Competitors are served 2-foot long stalks of stinging nettles from which they pluck and eat as many leaves as possible. Getty 36/50 27 July 2019 A woman in character as La Muerte from film The Book of Life, during the MCM Manchester Comic Con which see thousands of sci-fi fans, gamers, comic collectors, movie buffs and anime enthusiasts visit Manchester Central. PA 37/50 26 July 2019 England's Jonny Bairstow takes the catch to dismiss Ireland's William Porterfield during their test march at Lord's. Ireland were bowled out for 38 in their second innings in just 15.4 overs - the second lowest total in Test match history. Action Images via Reuters 38/50 25 July 2019 Hamza and Haris splash in the water feature beside the National Football Museum in central Manchester, as the UK braces itself to encounter the hottest July day on record. PA 39/50 24 July 2019 Boris Johnson waves as he enters 10 Downing Street following his appointment as Prime Minster by the Queen. The former London mayor and foreign secretary won his leadership bid by beating Jeremy Hunt in the Tory race the day before. Theresa May stepped down following her resignation as Conservative Party leader on 7 June. EPA 40/50 23 July 2019 Swimmers have fun in the sea on a giant inflatable Flamingo, South Beach,Tenby, Pembrokeshire. Reuters 41/50 22 July 2019 New Liberal Democrat leader Jo Swinson addresses the audience onstage after she was named as Sir Vince Cable's successor. Swinson beat fellow candidate Ed Davey by 47,997 votes to 28,021 votes. Getty 42/50 21 July 2019 Adam Peaty broke his own world record in the men's 100 metre breaststroke at the World Championships in Gwangju, South Korea. The 24-year-old smashed the previous record of 57.10 seconds he set at last year's European Championships to win in 56.88. In doing so, the Britain achieved one of his career goals of becoming the first man to break the 57-second barrier in the event. Reuters 43/50 20 July 2019 London artist Helen Marshall's People's Moon project, a giant photographic mosaic shown at the exact hour 50 years ago that Apollo 11 landed the first people on the Moon, at Piccadilly Circus, London. PA 44/50 19 July 2019 Players from Uganda and Malawi during their Netball World Cup match at the M&S Bank Arena, Liverpool. PA 45/50 18 July 2019 Artist Steve Messam poses next to his monumental landscape artwork 'Hush' which hangs in the moors of Teesdale on July 18, 2019 in Barnard Castle, England. The outdoor installation is inspired by the geology, mining history and landscape of the area. The North Pennines AONB Partnership commissioned the installation which hangs over Bales Hush, a deep gauge in the terrain created when miners flushed the area with water to reveal the geological riches below. Hundreds of metres of recyclable saffron yellow fabric blow in the wind. Getty 46/50 17 July 2019 Buckingham Palace staff arrange the dining table, a copy of Queen Victoria's reign dessert table, as part of an exhibition at Buckingham Palace, in London. The exhibition marks the 200th anniversary of the birth of Queen Victoria. AP 47/50 16 July 2019 The Inveraray pipe band parades through the town at the start of the Highland Games in Inverarary, Scotland. Getty 48/50 15 July 2019 Extinction Rebellion Activists block roads near the Tron Clock tower in Glasgow. Getty 49/50 14 July 2019 Serbia's Novak Djokovic raises the winner's trophy after beating Switzerland's Roger Federer during their men's singles final on day thirteen of the 2019 Wimbledon Championships at The All England Lawn Tennis Club. AFP/Getty 50/50 13 July 2019 The referee counts Nathan Gorman out as Daniel Dubois looks on during the British Heavyweight Title fight between Daniel Dubois and Nathan Gorman at The O2 Arena in London. Getty\n\nHe added: “People who come to the UK illegally have rights. We came to this country legally; I contributed to the economy for years; my kids were born here – yet they have no rights.”\n\nIkram is currently appealing the decision, but the hearing isn’t until July. Noreen, a trained nutritionist, has meanwhile been told by the Home Office that in order to appeal her refusal, she must return to Pakistan – which would mean paying for an air ticket and spending an unknown period of time with her baby in a country where they have no home.\n\nThe family’s situation marks the latest in a string of cases in which highly skilled migrants have been ordered to leave the UK for making minor and legal amendments to their tax records. The Home Office is currently being challenged in court over the decisions, which are based on a section of immigration law designed to remove people who pose a threat to national security.\n\nNo longer able to access free healthcare following the refusal, Noreen started being charged by the NHS for her maternity care – a bill that has now racked up to more than £9,600. Unable to pay it, the couple is now terrified to set foot in a doctor’s surgery or hospital.\n\n“He has eczema,” says Noreen, pointing to the dry, red patches on her son’s face and neck. “But we are scared to take him to the GP because they will increase our bill.” She signals tearily towards her child’s fabric-clad hands and adds: “I’m having to instead use socks to cover his hands, to stop him from scratching.”\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nAina and Anya, the two girls, appear largely oblivious to the gravity of the situation. They prance around on the two beds and excitedly exhibit the few toys and possessions they have been able to keep, speaking in perfect English as they show off their drawings on the wall. But their father says they are beginning to understand what is happening.\n\nThe Ullah family has the support of their local MP, who has tried to raise their case with the Home Office a number of times, but received no meaningful reply. Stephen Timms, of the Labour Party, said the family’s suffering was “unquestionably” part of the government’s “hostile environment”.\n\n“Mr Ullah has been refused leave to remain because he once made a correction to his tax affairs, which thousands of people do every year, and it’s done and it’s finished and that’s the end of it,” the MP said.\n\n“But the Home Office has dug that out and is now using it as a basis of refusing what otherwise would be his permission to carry on living and working in the UK.\n\n“It is a very, very hostile environment that’s been created for people who are simply earning a living, contributing to the economy, getting on with their lives.”\n\nIkram says the family will be eating the plain bread of what is meant to be a pizza base for dinner. He gets out a plastic bag of the flat breads, which he explains were given to him for free by the local pizza takeaway owner.\n\n“We are not criminals. I thought the UK was known for human rights, but I look at my kids in this situation and I feel like they are treated worse than animals. It’s inhumane,” he says.\n\n“I have been the target of this hostility and my children are paying the price each and every minute of their lives. I live with this every day and I am hopeful to get justice one day.”\n\nA Home Office spokesperson said: “An appeal has been lodged in this case and is pending. It would therefore be inappropriate to comment at this time.”\n\nYou can donate towards helping Ikram and his family here.", "description": "“This used to be my children’s toy room. Now all five of us sleep in here.” Ikram Ullah gestures into a room on the ground floor of a shared house in East Ham. A single and double bed wedged together cover most of the floor. His baby son’s cot, along with a wardrobe and a chest of drawers, cram into the remaining space.", "authors": ["May Bulman"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/02/21/08/ullah-family.jpg"}