{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/trump-impeachment-latest-poll-fox-news-ukraine-call-democrats-joe-biden-a9149911.html", "downloaded_at": "2019-10-10 08:35:56.253447+00:00", "title": "Fox News poll shows more than half of Americans think Trump should be impeached", "language": "en", "text": "A Fox News poll has found that a majority of US voters want Donald Trump to be impeached.\n\nThe White House said on Wednesday it would refuse to co-operate with the inquiry being led by House Democrats into whether the president should be removed from office – with lawyers rejecting the move as “baseless” and “constitutionally invalid”.\n\nHowever public support continues to swing against Mr Trump – with the latest poll carried out for his preferred media network, Fox News, finding a majority believe he should no longer sit in the Oval Office.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIn a survey of 1,003 voters across the US, 51 per cent said they thought he should be impeached, a rise on the previous month’s 42 per cent.\n\nOnly 43 per cent of respondents said the House of Representatives should not vote for his removal – with the most prominent reason given for opposing the action being that the president “did nothing wrong”.\n\nShape Created with Sketch. Trump protests: President visits Texas and Ohio after mass shootings Show all 31 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Trump protests: President visits Texas and Ohio after mass shootings 1/31 Miami Valley Hospital, Dayton Demonstrators chant as they protest the arrival of President Donald Trump outside Miami Valley Hospital after a mass shooting that occurred in the Oregon District AP 2/31 El Paso Trump headed to El Paso, after visiting Dayton, Ohio to offer a message of healing and unity, but he was met by hostility in both places by people who fault his own incendiary words as a contributing cause to the mass shootings AP 3/31 El Paso, University Medical Centre US President Donald Trump greets first responders as he visits El Paso Regional Communications Centre AFP/Getty 4/31 El Paso, University Medical Centre An anti-Trump protestor holds a sign as police are lined up outside University Medical Centre Getty 5/31 El Paso AP 6/31 El Paso AFP/Getty 7/31 Miami Valley Hospital, Dayton AP 8/31 El Paso Democratic presidential candidate Beto ORourke hugs a woman at a makeshift memorial outside Walmart honoring victims of the mass shooting there which left 22 people dead. Getty 9/31 El Paso AFP/Getty 10/31 El Paso AP 11/31 El Paso, University Medical Centre Reuters 12/31 El Paso, University Medical Centre President Trump and First Lady Melania Trump greet PFC Glendon Oakley (second right), who saved several lives during the mass shooting in Texas AFP/Getty 13/31 Miami Valley Hospital, Dayton AP 14/31 El Paso, University Medical Centre Reuters/Amanda Voisard 15/31 El Paso Beto ORourke consoles a man at the makeshift memorial outside Walmart Getty 16/31 El Paso, University Medical Centre An anti-Trump demonstrator yells near police outside the University Medical Centre Reuters 17/31 El Paso AFP/Getty Images 18/31 Dayton President Donald Trump and First Lady Melania Trump arrive at Wright-Patterson Air Force Base AP 19/31 El Paso Makeshift memorial for victims of the shooting that left a total of 22 people dead at the Cielo Vista Mall Walmart AFP/Getty Images 20/31 Miami Valley Hospital, Dayton AP 21/31 President Trump greets Dayton Mayor Nan Whaley as he arrives at Wright-Patterson Air Force Base AFP/Getty 22/31 Miami Valley Hospital, Dayton AP 23/31 Dayton Damon Smith presents a message to President Donald Trump beside a makeshift memorial in Dayton AP 24/31 Miami Valley Hospital, Dayton Demonstrators gather in front of an inflatable \"Baby Trump\" to protest the presidents arrival AP 25/31 Miami Valley Hospital, Dayton AP 26/31 El Paso A photo of victim Javier Amir Rodriguez, a 15-year-old sophomore Getty 27/31 Dayton AFP/Getty 28/31 El Paso A message is left for Donald Trump AFP/Getty 29/31 El Paso AFP/Getty 30/31 El Paso People hug at the makeshift memorial AFP/Getty 31/31 El Paso People pray at the makeshift memorial AFP/Getty 1/31 Miami Valley Hospital, Dayton Demonstrators chant as they protest the arrival of President Donald Trump outside Miami Valley Hospital after a mass shooting that occurred in the Oregon District AP 2/31 El Paso Trump headed to El Paso, after visiting Dayton, Ohio to offer a message of healing and unity, but he was met by hostility in both places by people who fault his own incendiary words as a contributing cause to the mass shootings AP 3/31 El Paso, University Medical Centre US President Donald Trump greets first responders as he visits El Paso Regional Communications Centre AFP/Getty 4/31 El Paso, University Medical Centre An anti-Trump protestor holds a sign as police are lined up outside University Medical Centre Getty 5/31 El Paso AP 6/31 El Paso AFP/Getty 7/31 Miami Valley Hospital, Dayton AP 8/31 El Paso Democratic presidential candidate Beto ORourke hugs a woman at a makeshift memorial outside Walmart honoring victims of the mass shooting there which left 22 people dead. Getty 9/31 El Paso AFP/Getty 10/31 El Paso AP 11/31 El Paso, University Medical Centre Reuters 12/31 El Paso, University Medical Centre President Trump and First Lady Melania Trump greet PFC Glendon Oakley (second right), who saved several lives during the mass shooting in Texas AFP/Getty 13/31 Miami Valley Hospital, Dayton AP 14/31 El Paso, University Medical Centre Reuters/Amanda Voisard 15/31 El Paso Beto ORourke consoles a man at the makeshift memorial outside Walmart Getty 16/31 El Paso, University Medical Centre An anti-Trump demonstrator yells near police outside the University Medical Centre Reuters 17/31 El Paso AFP/Getty Images 18/31 Dayton President Donald Trump and First Lady Melania Trump arrive at Wright-Patterson Air Force Base AP 19/31 El Paso Makeshift memorial for victims of the shooting that left a total of 22 people dead at the Cielo Vista Mall Walmart AFP/Getty Images 20/31 Miami Valley Hospital, Dayton AP 21/31 President Trump greets Dayton Mayor Nan Whaley as he arrives at Wright-Patterson Air Force Base AFP/Getty 22/31 Miami Valley Hospital, Dayton AP 23/31 Dayton Damon Smith presents a message to President Donald Trump beside a makeshift memorial in Dayton AP 24/31 Miami Valley Hospital, Dayton Demonstrators gather in front of an inflatable \"Baby Trump\" to protest the presidents arrival AP 25/31 Miami Valley Hospital, Dayton AP 26/31 El Paso A photo of victim Javier Amir Rodriguez, a 15-year-old sophomore Getty 27/31 Dayton AFP/Getty 28/31 El Paso A message is left for Donald Trump AFP/Getty 29/31 El Paso AFP/Getty 30/31 El Paso People hug at the makeshift memorial AFP/Getty 31/31 El Paso People pray at the makeshift memorial AFP/Getty\n\nThe results of the poll also suggested the president’s messaging on Democratic rival Joe Biden and his son Hunter are not making an impact on the American public.\n\nMr Trump and his lawyer, Rudy Giuliani, have repeatedly implied the former vice-president pressured the government of Ukraine to sack the nation’s prosecutor general, who was investigating a company which had his son on the board.\n\nThe allegation, and whether or not the president pressured the eastern European government to investigate the claim, is at the centre of the move to remove Mr Trump from the White House.\n\nHowever, respondents to the poll appeared to be indifferent to the alleged actions of Mr Biden. Asked how troubling they find the allegations against the former vice-president, 32 per cent said not at all – while only 19 per cent said they found the claims “extremely” troubling.\n\nIn turn, the majority of respondents - 38 per cent - said they found Mr Trump’s dealings with the Ukrainian president extremely troubling, compared to 26 per cent who said the situation was not troubling at all.\n\nMeanwhile 66 per cent said it was not appropriate for the president to ask foreign leaders to investigate his rivals – compared to 25 per cent who said such actions would be appropriate.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nThe poll is the latest to find public support for impeachment growing as proceedings against the president gain pace.\n\nHowever, while Democrats in the house are likely to rule in favour of the president’s removal, it is unlikely the Republican-controlled Senate will endorse the move.\n\nIn order for that to happen — a situation that would force Mr Trump from office, making Mike Pence the next commander-in-chief — roughly 20 Republicans would need to abandon Mr Trump, and join a unified Democratic front.\n\nNo US president has ever been removed from office by a vote of impeachment.\n\nIn 1974 Richard Nixon resigned before a vote could take place, while both Bill Clinton in 1998 and Andrew Johnson in 1868 both retained their positions after they were not removed by the senate.", "description": "A Fox News poll has found that a majority of US voters want Donald Trump to be impeached.", "authors": [], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/09/21/urn-publicid-ap.org-e57a7db0d2314669a5f0eb37654adea9.jpg", "published_at": "2019-10-10"}