{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/is-the-us-economy-slowing-or-stalling-thats-the-question-after-the-jobs-report ", "downloaded_at": "2019-10-05 03:50:03.438211+00:00", "title": "Is the US economy slowing or stalling? That's the question after the jobs report", "language": "en", "text": "Crawling or stalling? That's the question hanging over the US economy amid fresh evidence the once-hot labour market is losing steam.\n\n[WASHINGTON] Crawling or stalling? That's the question hanging over the US economy amid fresh evidence the once-hot labour market is losing steam.\n\nNonfarm payrolls expanded by 136,000 in September, according to a Labor Department report Friday that missed the median estimate of economists. That brought the average gain this year to 161,000, compared with 223,000 throughout 2018. On top of that, average hourly earnings rose 2.9 per cent from a year earlier, the weakest rate since mid-2018.\n\nYet the unemployment rate declined to a fresh half-century low of 3.5 per cent, with the pace of hiring remaining above what's needed to accommodate population growth. And pay for production and nonsupervisory workers held up better than the overall numbers.\n\nMarkets appeared to take the report as a sign growth would hold up. Traders of Fed funds futures slightly reduced the amount of easing they expect from the US central bank this year and marginally trimmed their expectations for a third straight rate cut this month. US stocks rose though the Treasury yield curve flattened and the US dollar remained lower.\n\nsentifi.com Market voices on:\n\n\"The picture is complicated,\" said James Sweeney, chief economist at Credit Suisse Group. The labour market is slowing, but there are \"no signs that we're suddenly falling into a recession or something like that\".\n\nWages and employment are still relatively solid. But risks continue to hang over the world's largest economy, including President Donald Trump's trade policy and weakness abroad, while the effect of last year's tax cuts keeps wearing off. Mr Trump took the chance to boast about the jobless rate on Twitter, but manufacturing jobs declined for the second time this year.\n\nFriday's report caps a week of US economic data that whipsawed stocks and sent already-low Treasury yields tumbling, led by a key manufacturing gauge that sank deeper into contraction with the worst reading in a decade. A slowdown also threatens Mr Trump's re-election prospects next year, with the president frequently staking his message on a strong economy.\n\nThe data offer a contrast with characterizations by Fed chairman Jerome Powell and his colleagues at recent meetings that job gains have been \"solid\", though they may still have room to stick with that assessment. Late Thursday, Fed vice-chairman Richard Clarida said the economy remains on solid footing and recession risks aren't \"particularly elevated under appropriate monetary policy\".\n\nMr Powell is scheduled to deliver opening remarks at 2pm in Washington at a Fed event, followed by comments from governors Lael Brainard and Randal Quarles.\n\n\"This is a muddled middle sort of report,\" Mohamed El-Erian, chief economic adviser to Allianz SE, said in an interview on Bloomberg Television. \"It's not weak enough to confirm that weakness is spreading from global manufacturing throughout the economy, but not strong enough to suggest that we are immune.\" Mr El-Erian is a Bloomberg Opinion columnist.\n\nWHAT BLOOMBERG ECONOMISTS SAY\n\nThe muted factory-recession impact evident in the latest jobs data is testament to the resilience of economic growth at present.\n\nThis is wholly consistent with Bloomberg Economics' assessment that growth will slow below 2 per cent in the back half of the year, while recession risk remains low.\n\nRevisions were a bright spot, adding 45,000 jobs for the prior two months, though the three-month average still fell to 157,000 from 171,000.\n\nThe job gains were concentrated in health care and professional and business services. Retail employment contracted for an eighth-straight month, while construction payroll growth remained tepid.\n\nManufacturers subtracted 2,000 jobs, continuing a trend toward weaker growth and damping one of Mr Trump's key campaign messages. It likely reflects the slowdown at factories, seen also in data from the Institute for Supply Management, which points to slower production and orders amid weakening demand for goods.\n\nAverage hourly earnings were little changed from the prior month, missing estimates for a gain, while the 2.9 per cent annual wage gain fell below all estimates in Bloomberg's survey of economists. Pay for production and nonsupervisory workers held up, though, with a gain of 3.5 per cent, down only slightly from a decade-high of 3.6 per cent.\n\nThe U-6, or underemployment rate, slipped to 6.9 per cent, the lowest since 2000, from 7.2 per cent. Some analysts see this as a more accurate reflection of the labour market as it includes part-time workers who'd prefer a full-time position and those who aren't actively looking.\n\nBLOOMBERG", "description": ": THE BUSINESS TIMES Government & Economy - [WASHINGTON] Crawling or stalling? That's the question hanging over the US economy amid fresh evidence the once-hot labour market is losing steam. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/05/nz_nyc_051047_0.jpg?itok=4mIhh1Cl", "published_at": "2019-10-05"}