{"pub": "independent", "url": "https://independent.co.uk/life-style/health-and-families/mental-health-seaside-town-coast-study-depression-anxiety-income-a9127666.html", "downloaded_at": "2019-10-01 11:45:15.996986+00:00", "title": "Mental health: Living in a seaside town reduces risk of anxiety and depression, study suggests", "language": "en", "text": "Living next to the sea is good for your mental health, a new study has found.\n\nResearchers from Exeter University found that those living around half a mile from the coast are less likely to experience mental health problems such as anxiety and depression.\n\nThe team say the results suggest the coast may act as a “protective zone” for psychological wellbeing and also highlight the importance of so-called “Blue Health” – the link between health and the natural environment.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nFor the study, researchers analysed data on more than 26,000 Brits taken from the Health Survey for England.\n\nThe physical and mental wellbeing of the participants was then compared to their proximity to the coast.\n\nShape Created with Sketch. Margate city guide Show all 6 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Margate city guide 1/6 The sandy beach at Margate istock 2/6 Margate has skyrocketed in popularity over the last five years Getty/iStock 3/6 Turner Contemporary ushered in a new era for Margate Flickr/Angus Willson 4/6 The gallery offers an eclectic rolling programme of exhibitions Flickr/diamond geezer 5/6 The new-look Dreamland harkens back to its Victorian roots Dreamland 6/6 One of the bathrooms at Reading Rooms 1/6 The sandy beach at Margate istock 2/6 Margate has skyrocketed in popularity over the last five years Getty/iStock 3/6 Turner Contemporary ushered in a new era for Margate Flickr/Angus Willson 4/6 The gallery offers an eclectic rolling programme of exhibitions Flickr/diamond geezer 5/6 The new-look Dreamland harkens back to its Victorian roots Dreamland 6/6 One of the bathrooms at Reading Rooms\n\nAfter adjusting for external factors, the scientists found people who live less than a kilometre from the coast are around 22 per cent less likely to have symptoms of a mental health disorder, compared to those who live 50km or more away.\n\nFor those from low income households who live less than a kilometre from the coast, the impact is even greater with people around 40 per cent less likely to have symptoms, than those earning the same amount living more than 50km away.\n\nPublished in the journal Health and Place, the findings suggest access to the coast could help to reduce these health inequalities in towns and cities.\n\nDr Jo Garrett, lead author of the study, said: “Our research suggests, for the first time, that people in poorer households living close to the coast experience fewer symptoms of mental health disorders.\n\n”When it comes to mental health, this 'protective' zone could play a useful role in helping to level the playing field between those on high and low income.“\n\nDr Mathew White, environmental psychologist at the University of Exeter, agreed, adding: ”This kind of research into blue health is vital to convincing governments to protect, create and encourage the use of coastal spaces.\n\n“We need to help policy makers understand how to maximise the wellbeing benefits of 'blue' spaces in towns and cities and ensure that access is fair and inclusive for everyone, while not damaging our fragile coastal environments.”", "description": "Living next to the sea is good for your mental health, a new study has found.", "authors": ["Sarah Young"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/01/11/family-beach.jpg", "published_at": "2019-10-01"}