{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/golf/article-7560639/Tapio-Pulkkanen-tops-round-leaderboard-Italian-Open-unheralded-Finn-shoots-seven-under.html", "downloaded_at": "2019-10-11 00:24:29.497030+00:00", "title": "Tapio Pulkkanen tops first-round leaderboard at Italian Open as unheralded Finn shoots seven-under", "language": "en", "text": "Unheralded Finn Tapio Pulkkanen putted superbly to take a first-round lead at the Italian Open on Thursday as Justin Rose survived a shaky start to lurk two shots behind in Rome.\n\nPulkkanen, in his second season on the European Tour, reeled off four successive birdies on his front nine and never looked back in a bogey-free seven-under-par 64 at Olgiata Golf Club.\n\n'I didn't make any bogeys so it was good. I made a lot of long putts,' he said after earning a one-stroke lead over South African-born Slovakian Rory Sabbatini.\n\nTapio Pulkkanen carded a bogey-free round to take the first-round lead at Olgiata Golf Club\n\nEnglishman Rose was among a group of five on 66, while local favourite Francesco Molinari shot 71 at the $7 million event that is part of the exclusive Rolex Series.\n\nPulkannen has been a solid performer in his brief career, and is feeling confident as he chases his first victory.\n\n'First year was a learning year,' he said. 'Second year feeling more comfortable. I feel like my putter is really hot so I can make some birdies on the weekend.'\n\nPulkkanen putted superbly and will hope to carry that form with him over the weekend\n\nFormer world number one Rose was over par early on, but salvaged a decent score.\n\n'I had a tough run from the second hole to the sixth hole, didn't play very well, rode the storm really well,' he said.\n\n'Putting was what I was most happy with today. I really rolled the ball well from 10-15 feet. I walked off the golf course saying I made the most of that round for sure.'", "description": "Unheralded Finn Tapio Pulkkanen putted superbly to take a first-round lead at the Italian Open on Thursday as Justin Rose survived a shaky start to lurk two shots behind in Rome.", "authors": ["Reuters Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/22/19560738-0-image-a-65_1570743796321.jpg", "published_at": "2019-10-10"}