{"pub": "cbc", "url": "https://cbc.ca/life/style/transitional-toppers-10-jackets-to-take-you-into-fall-1.5271577", "downloaded_at": "2019-09-06 12:13:11.170462+00:00", "title": "CBC Life", "language": "en", "text": "There's a lot to look forward to in September, like seasonal lattés, and especially cute coats — the weather isn't cold enough to force you to surrender to the bulkier stuff just yet. Fall outerwear options are still solid, look and feel good, and make perfect layering companions.\n\nSince there's no shortage of options, here are the top styles to add to your fall wardrobe that nail both style and functionality.\n\nAvailable in six vibrant shades, this packable puffer provides warmth without bulk and looks good to boot. It's easy to discreetly stow away (it packs into the interior pocket) or slip on when the weather's acting temperamental.\n\nPrimaLoft Packable Puffer Jacket, $69, Joe Fresh\n\nThis semi-transparent, waterproof raincoat lets you show off a bright outfit even on the gloomiest rainy day. More importantly, it'll keep the rain out, protecting your pocket essentials, and let air through so you don't lock in sweat.\n\nWomen's Original Cropped Waterproof Smock: White, $185, Hunter\n\nThis hooded coat with its loose fit is ideal for fall layering. The double-faced wool keeps you warm when it gets chilly, while the longer length perfectly complements all your midi-length skirts and dresses.\n\nDouble Face Hooded Coat, $99.90, Uniqlo\n\nA trench coat is a wardrobe staple and especially handy during transitional weather. This modern update eschews the classic silhouette for a more relaxed fit, while also showing off elegant details like a notched lapel and gathered cuffs.\n\nElima Trench, $298, Club Monaco\n\nWith its signature ribbed sleeves, this royal-approved Sentaler coat (worn by the Duchess of Cambridge, Kate Middleton) keeps you warm and stylish. It works as a statement piece on its own, and instantly elevates any outfit.\n\nWrap Coat with Ribbed Sleeves, $1,295, Sentaler\n\nA classic moto jacket is another must for taking you between seasons. This one swaps leather for vegan suede, with metal hardware and a cropped length giving it an extra dose of cool. Go for olive green instead of your usual black.\n\nVegan Suede Moto Jacket, $215, Banana Republic\n\nThrowing on a blazer is the easiest way to avoid wearing actual outerwear for as long as possible. Opt for tweed so you can lean into the cooler weather with its cozy fabric. The frayed hem detail lets you dress it up or down.\n\nButtons Tweed Blazer, $179.99, Mango\n\nAn insulated bomber jacket is a go-to for crisp fall mornings. This neutral goes-with-everything jacket looks good without being flashy. Throw it on over an oversized shirt and leave it open or zip it up over a tee.\n\nSemira Style Jacket, $270, Arc'teryx\n\nCreated as part of a capsule collection with popular fitness studio Barry's Bootcamp, this jacket livens up your workouts with its flashy foil finish, stowable hood and water-repellent fabric. You also don't need the gym as an excuse to wear it.\n\nLululemon X Barry's Stronger As One Jacket, $168, Lululemon\n\nUpgrade your jean jacket with this reversible version, which lets you wear it two perfect-for-fall ways. Keep it subtle by showing off just a hint of leopard print or go wild by embracing the animal print.\n\nLevi's Oversized Reversible Faux Fur Trucker Jacket, $224.06, Shopbop\n\nMishal Cazmi is a Toronto-based beauty and fashion writer and founder of 100 ML. Follow her at @mishalcazmi.", "description": "Jackets that look stylish and weather-appropriate in this tricky in-between season.", "authors": [], "top_image": "https://i.cbc.ca/1.5271702.1567700348!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/fall-coats-ft-img.jpg", "published_at": "2019-09-05"}