{"pub": "realclearpolitics", "url": "https://amgreatness.com/2019/10/12/trumps-foreign-policy-deals-properly-with-tyrants", "downloaded_at": "2019-10-13 11:38:12.233842+00:00", "title": "Trump's Foreign Policy Deals Properly with Tyrants", "language": "en", "text": "Over at PJ Media, my friend Roger L. Simon makes some sage observations about the proper conduct of foreign policy among great powers in general and, in particular, about the behavior of President Trump with respect to this important arena of human endeavor.\n\nRoger’s first point has two parts, a strophe, as it were, and an antistrophe.\n\nThe strophe involves a patent moral dimension. We should not conceal—from others or from ourselves—the moral caliber of the leaders with whom we deal. Besides the United States, the world’s only other colossus is China. Not only does it preside over the second largest economy in the world, it is also eagerly and aggressively arming itself and asserting its prerogatives throughout Asia and, increasingly, throughout the world.\n\nMoreover, China has a dismal human rights record, a fact that is daily bruited about the Western world by reports of China’s savage treatment of the Uyghurs, for example, their efforts to create a surveillance state by imposing a system of “social credit” on its citizens, and its militant treatment of the protestors in Hong Kong.\n\nLast week’s flood of stories about the craven behavior of the National Basketball Association, Nike, Apple, and other American business interests that talk woke but act like hypocrites when their bottom line is threatened has simply reinforced what we all knew about those horrible people (I mean those running Apple, Nike, etc.) They wear bluejeans and eschew ties, they talk about love and “saving the environment,” but they instantly kowtow to tyrannical hegemons the moment it will aid their balance sheet.\n\nRoger’s antistrophe is itself in two parts. The first acknowledges all that I’ve just said—China is a Communist tyranny, it treats its people horribly, it is a threat to world peace and stability. The second part begins with a big fat but. “But,” says Roger, “it’s the most populous country in the world and, even though it brutally oppresses its minorities, not to mention the democracy protestors, many views, submerged as they may be, exist among its people, even among the Communist Party leadership. (Look up Lin Biao, if you don’t believe me.) Xi is the maximum leader for life—until he isn’t.” That codicil “until he isn’t” is worth keeping in mind: dictators are like the Michelin Man. They are big and imposing until they deflate, a contingency that is often as sudden as it is unexpected.\n\nWhat all this means is that we turn our backs on China at our peril and, at the end of the day, its detriment. China is a fact of life. We may not like it. We have to deal with it.\n\nThis complicated reality, Roger observes, means that any U.S. president “has to walk a tightrope. . . . It’s incumbent on us to find the better, more moderate parts of the regime and subtly encourage them (forming economic ties that work is one way) while still making sure that as Americans we see and sympathize with the cause of the democracy demonstrators.”\n\nAnd here’s the surprising thing—surprising, anyway, to those representing the establishment consensus about foreign policy—“Trump has done a rather accomplished job of this for a ‘diplomatic amateur.’” He issues blistering criticisms of “pandering” (Roger’s mot juste), hypocritical mountebanks like NBA managers Steve Kerr and Gregg, putting the world on notice about what he personally thinks about the Chinese regime’s behavior (he abominates it).\n\nAt the same time, just as he did with Kim Jong-un and Vladimir Putin, he publicly makes nice with President Xi and his official representatives. Witness the “mini” trade deal he struck Friday with Chinese Vice Premier Liu He at the White House. (I say “mini” because that’s how the deal was described, but it did send the Dow up more than 300 points. What happens if Trump manages a maxi deal with China?)\n\nA smiling presidential face and kind words for Putin, surprise photo-ops with Kim, this Oval Office honor for Liu He, with a side dish of praise for his “good friend President Xi”: it drives some people nuts. Roger says it’s the “CNNs of the world,” which is true as far as it goes. But the Left pounces on Trump for such public displays of affection directed at such rogues because they believe it will undermine his authority and, ultimately, his legitimacy. The folks who are really upset whenever Trump plants a metaphorical kiss on the dimple of some dictator are the fraternity of NeverTrump neo-cons (and repentant neo-cons like poor Max Boot).\n\nThe bottom like, however, is this. Trump’s actions are “a strategy.” (“Obviously,” says Roger. It is obvious to me. But is it obvious to Bill Kristol, to Pastor David French, to Jonah Goldberg?) It is indeed true, as Roger acknowledges that “It’s not clear the extent to which it will work.” But here’s payday: “if it does even some of the time, it’s miles ahead of what his predecessors ever did.”\n\nCommit that to memory.\n\nIt’s become a chestnut, part of the folklore about Trump, that while he might Tweet or say incontinently mean or rude things about people, his many detractors swish about the place baying for his blood, plotting impeachment and/or prosecution. As one friend of mine put it, Trump’s only impeachable offense was being elected in the first place. That was the unforgivable tort, the original sin that only political death might wipe away.\n\nLess often commented on is the point that Roger Simon makes here: That Trump’s coddling of the dictatorial mind is not capitulation but a steely eyed gambit to get part—he hopes all, or a lot, but at least some—of what he and what the United States wants. Sure, it’s a risky gambit. But the dismal performance of U.S. foreign policy over the last few decades should make us appreciate Trump’s creativity and cunning.\n\nIt’s especially rich that some of the sharpest criticism of Trump on this issue is coming from some of the architects and enablers of that litany of self-absorption and failure. Meanwhile, what if Trump strikes a big trade deal with China? What if he manages to get Kim to denuclearize? What if he lures the mad mullahs in Iran into the 21st century? He hasn’t managed it yet. But so far he’s had a lot more success than did Obama with his spineless habit of “leading from behind.”", "description": "", "authors": [], "top_image": "https://amgreatness.com/wp-content/uploads/2019/10/GettyImages-1159107054.jpg", "published_at": "2019-10-12"}