{"pub": "cbc", "url": "https://cbc.ca/radio/asithappens/france-s-metoo-founder-vows-to-fight-back-after-being-fined-29k-for-defamation-1.5300087", "downloaded_at": "2019-09-28 21:29:56.772236+00:00", "title": "CBC Radio", "language": "en", "text": "The woman credited with launching France's version of the #MeToo movement says she won't be silenced by a defamation lawsuit and a $29,000 fine.\n\nSandra Muller, a U.S. based French journalist, was ordered by a Paris court on Wednesday to pay €22,000 ($28,976 Cdn) for defaming a media executive she accused of sexual harassment.\n\nShe plans to appeal the ruling.\n\n\"The message is clear. It's like, just stay quiet, shut up and we don't want to hear your voice,\" Muller told As It Happens host Carol Off.\n\n\"They wanted to make me an example, and they will make me a martyr.\"\n\n'Squeal on your pig'\n\nIn October 2017, at the height of the global movement against sexual misconduct, Muller launched the hashtag #balancetonporc, which roughly translates as \"squeal on your pig\" or \"expose your pig.\"\n\nShe posted a message on Twitter encouraging women in France to come forward with stories about workplace harassment and to name their harassers.\n\nHer harasser, she tweeted, was former TV executive Eric Brion, who made sexually explicit comments to her at a Cannes Film Festival cocktail party in 2012.\n\nIn the tweet, she claimed Brion said to her: \"You have big breasts. You are my type of woman. I will make you orgasm all night.\"\n\nMuller, left, and her lawyer Francis Szpiner, right, plan to appeal the ruling. (Thibault Camus/The Associated Press)\n\nMuller was covering the festival as a journalist.\n\n\"I wasn't at the bar or, you know, or in the street. It was a professional event,\" she said. \"When you are a journalist, you are not all the time in your desk.\"\n\nBrion, former head of television channel Equidia, has never denied making the comments. In a 2017 column in La Monde, he apologized for his \"inappropriate remarks\" and drunken \"boorishness,\" but said they do not constitute harassment.\n\nHe took her to court over the tweets, arguing that they harmed him his professional reputation by unfairly linking him to alleged serial abusers like movie executive Harvey Weinstein.\n\nThe court ruled in his favour, ordering Muller to delete her tweets and pay Brion for damages and legal fees.\n\nBrion hailed the ruling on Twitter as a \"victory of true justice\" after \"two years of rare violence.\"\n\n'Right to flirt'\n\nDuring the trial, Brion's lawyer Marie Burguburu defended her client's \"right to flirt.\"\n\nMuller says ideas around what constitutes harassment are looser in France than North America, but that under no circumstances were Brion's comments an acceptable form of flirtation.\n\n\"I'm sorry, but it's not seduction. I like seduction. We can go in the street and if some guys, they come and they want to speak with us and they are polite and nice with us, we can speak with them,\" she said.\n\n\"Honestly, if he had told me, 'You have beautiful hair, beautiful eyes, I would like to go with you to watch a movie,' obviously this tweet would not have existed at all.\"\n\nShe says she's worried about the ruling's implication for other women, especially in France, who are facing harassment.\n\n\"I was afraid that victims will lose hope. I was afraid that victims, maybe they wouldn't want to speak out again,\" she said. \"You have to keep going, speak out, don't be afraid, don't be scared.\"\n\nWritten by Sheena Goodyear with files from The Associated Press. Interview with Sandra Muller produced by Rachel Levy-McLaughlin.", "description": "The woman credited with launching France's version of the #MeToo movement says she won't be silenced by a defamation lawsuit and a $29,000 fine.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5300567.1569611991!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/france-sexual-misconduct.jpg", "published_at": "2019-09-27"}