{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/26/trump-slams-schiff-pious-threatens-court-action-ag", "downloaded_at": "2019-09-26 20:58:24.544785+00:00", "title": "Trump slams Schiff as 'pious,' threatens court action against impeachment", "language": "en", "text": "A defiant President Trump said Thursday he might go to court to fight House Democrats’ impeachment effort, saying their attempt to “tie up our country” shouldn’t be allowed.\n\n“There should be a way of stopping it, maybe legally through the courts,” Mr. Trump told reporters upon arriving in Washington from New York. “But they’re going to tie up our country.”\n\nHe said while the new impeachment furor is engulfing Washington, “We can’t talk about gun regulation, we can talk about anything because frankly they [Democrats] are so tied up, they’re so screwed up, nothing gets done except when I do it.”\n\nThe president spoke to reporters just after the House Permanent Select Committee on Intelligence questioned acting Director of National Intelligence Joseph Maguire about a whistleblower’s complaint against the president that has become the basis for an impeachment inquiry.\n\n“Another witch hunt, here we go again,” Mr. Trump said. “It’s [committee Chairman] Adam Schiff and his crew, making up stories and sitting there like pious, whatever you want to call them. It’s just a really a disgrace. It’s a terrible thing for our country.”\n\nThe president said Democrats “are going to lose the election and they know it.”\n\n“That’s why they’re doing it,” he said of impeachment. “We’ve done so many things that are so incredible with tax cuts and regulations, and I have to put up with Adam Schiff on an absolutely perfect phone call to the new president of Ukraine.”\n\nMr. Trump ignored the press and walked straight to a group of supporters when his helicopter, Marine One, touched down on the South Lawn of the White House.\n\nOne woman had tears in her eyes as she shook Mr. Trump’s hand and appeared to say “Thank you” to the president.\n\nDemocrats accuse Mr. Trump of threatening to withhold $391 million in military aid to Ukraine unless its president agreed to investigate Democratic front-runner Joseph R. Biden and his son Hunter, who had a lucrative post with a Ukrainian gas company while the elder Biden was vice president.\n\nMr. Trump denies any wrongdoing and said there should be an investigation of the younger Biden’s profiteering in Ukraine and China while his father was a top emissary of the Obama administration.\n\n“Adam Schiff doesn’t talk about Joe Biden and his son walking away with millions of dollars from Ukraine, and then millions of dollars from China — walking away in a quick meeting, walking away with millions of dollars,” Mr. Trump said. “He doesn’t talk about Joe Biden firing a prosecutor, and if that prosecutor’s not fired, he’s not going to give him money from the United States of America.”\n\nIn 2016, Mr. Biden threatened to withhold $1 billion in loan guarantees unless Ukraine fired its top prosecutor, whose office had been investigating the gas company. Obama officials said they wanted the prosecutor ousted because he was ignoring corruption.\n\n• Tom Howell Jr. contributed to this story.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "A defiant President Trump said Thursday he might go to court to fight House Democrats' impeachment effort, saying their attempt to \"tie up our country\" shouldn't be allowed.", "authors": ["The Washington Times Http", "Dave Boyer"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/26/trump_81606_c0-219-5228-3267_s1770x1032.jpg?27219db99735a41af2307613cced7db54214e639", "published_at": "2019-09-26"}