{"pub": "thehill", "url": "https://thehill.com/policy/healthcare/467391-warren-faces-tough-choices-on-funding-medicare-for-all", "downloaded_at": "2019-10-25 00:00:47.154476+00:00", "title": "Warren faces tough choices on funding 'Medicare for all'", "language": "en", "text": "It’s the multitrillion dollar question everyone is trying to answer, including Sen. Elizabeth Warren Elizabeth Ann WarrenSaagar Enjeti questions Warren's authenticity on 'Medicare for all' All-female panel to moderate November Democratic primary debate Ocasio-Cortez grills Zuckerberg over political ad policy MORE (D-Mass.): How do you pay for “Medicare for all,” a proposal that would dramatically reshape the entire U.S. health care system?\n\nWarren, a Democratic candidate for president, says she will soon release a plan to pay for Medicare for all after facing criticism for evading questions about the proposal's potential tax implications for the middle class.\n\nBut while any plan to pay for Medicare for all would likely require a middle-class tax increase, experts say, the issue of funding is complex and would also need a slew of other revenue options as well.\n\n“We’re talking about a very substantial increase in revenues,” said Linda Blumberg of the Urban Institute, which recently released a cost estimate for a Medicare for all-style plan.\n\n“With that large of an increase in revenue needed, my guess is a mix of different revenue sources would be looked at.”\n\nBlumberg specifically mentioned income tax increases; value-added taxes, which are popular in European countries; and other taxes to recapture what households and employers had already been spending on health care under the current system.\n\nWarren has struggled to answer questions about how she would pay for Medicare for all.\n\nThere are disagreements about how much the single-payer system would cost, which make it difficult to figure out how to pay for it.\n\nWhile the Urban Institute estimated in a report released earlier this month that a single-payer system similar to Medicare for all would require an additional $34 trillion in federal government spending over 10 years, other studies have pegged it at more or less.\n\nBut the question that keeps arising during the Democratic presidential debates is whether Medicare for all would require a tax increase for the middle class.\n\nA plan to finance Medicare for all is unlikely to avoid raising taxes on the middle class — Sen. Bernie Sanders Bernie SandersSaagar Enjeti questions Warren's authenticity on 'Medicare for all' All-female panel to moderate November Democratic primary debate Senate rejects Dem measure to overturn IRS rules on SALT deduction cap MORE (I-Vt.), the author of the proposal and a fellow presidential candidate, has said as much.\n\n“There’s not enough money from the rich and corporations to finance that,” said Marc Goldwein, senior vice president and senior policy director for the Committee for a Responsible Federal Budget.\n\nBut he notes that “doesn’t mean the middle class would have to pay more. There would be higher taxes, but no premiums and no cost sharing.”\n\nWhat a middle-class family pays under Medicare for all will depend on the financing details that are eventually hammered out. But Warren has said she wouldn’t sign a bill that would increase “costs” for the middle class.\n\n“Costs will go up for the wealthy. They will go up for big corporations. And for middle-class families, they will go down,” she said at the most recent debate earlier this month.\n\n“I will not sign a bill into law that does not lower costs for middle-class families.”\n\nWhile experts say increasing taxes on the rich is not enough to finance all of the additional federal spending needed to pay for Medicare for all, it could raise a significant amount.\n\nIncreasing taxes on the rich could involve raising the top two individual income tax rates, which are 35 percent and 37 percent; increasing the corporate income tax rate, which is currently 21 percent; and taxing capital gains.\n\nRobert Pollin, a professor of economics at the University of Massachusetts Amherst, who supports Medicare for all and has worked with Sanders and Warren, says much of the plan can be funded by redirecting money the government is already spending on health care programs like Medicaid and Medicare. Medicare for all, which he estimates to cost about $2.9 trillion a year, would further save money, he argues, by cutting out much of the administrative costs associated with the private insurance industry.\n\nHe also recommends imposing a net worth tax of 0.38 percent on anyone making more than $1 million a year to generate $200 billion annually.\n\nPollin also supports a 3.75 percent national sales tax that excludes items deemed essential like housing and food.\n\nSince businesses would no longer provide health insurance to their employees under Medicare for all, he also recommends an 8 percent tax on all business income, with exceptions for small operations, that would raise $600 billion annually.\n\nSanders has similarly suggested a 7.5-percent payroll taxes on businesses, also with exemptions for small businesses, estimating it would generate $3.9 trillion over ten years.\n\nSanders has also suggested a 4-percent income-based “premium” paid by households, that wouldn’t be paid by low-income families.\n\nAdditionally, those making more than $250,000 a year would pay an increased tax rate, topping 52 percent for households making more than $10 million a year.\n\nHis recommended changes to income tax rates would raise $1.8 trillion over ten years, he estimates.\n\nSome experts say Medicare for all could be funded by looking at other areas of the federal budget.\n\n“We are vastly overspending on the Pentagon,” said Lindsay Koshgarian, who directs the National Priorities Project at the Institute for Policy Studies, and wrote about the issue for a recent op-ed in The New York Times. She found $300 billion in annual savings that could be invested in Medicare for all.", "description": "It’s the multitrillion dollar question everyone is trying to answer, including Sen. Elizabeth Warren (D-Mass.): How do you pay for “Medicare for all,” a proposal that would dramatically reshape the entire U.S.", "authors": [], "top_image": "https://thehill.com/sites/default/files/warrenelizabeth_071919getty.jpg", "published_at": "2019-10-24"}