{"pub": "yahoo", "url": "https://finance.yahoo.com/news/osram-shrugs-off-doubts-back-064314583.html", "downloaded_at": "2019-09-16 12:01:21.828904+00:00", "title": "Osram Feeds Union Anger After Backing $4.1 Billion AMS Offer", "language": "en", "text": "(Bloomberg) -- Osram Licht AG recommended a 3.7 billion-euro ($4.1 billion) takeover bid from AMS AG on the basis of price, risking a backlash from labor groups concerned over potential job cuts that may come with the deal.\n\nThe terms of AMS’s 38.50 euro-a share proposal eclipse Osram’s lingering concerns about how the takeover will be funded, the German lighting maker said in a statement on Monday. The Munich-based former Siemens AG unit had previously backed a lower offer from private equity groups Bain Capital and Carlyle Group LP.\n\nThe show of support for AMS gives the Austrian sensor maker a boost in a months-long battle for Osram, which came into play after a series of profit warnings more than halved its share price over the course of a year. Bain and Carlyle are considering increasing their 3.4 billion euro offer, people familiar with the matter said last month, which could switch the initiative back their way.\n\nOsram said differences remain with ASM over “some important strategic elements” that require further discussion, though that may not be enough to appease unions and employee representatives, who make up half of Osram’s supervisory board. They have questioned AMS’s planned savings from the deal, saying they would lead to job losses and facility closures in Germany. IG Metall, which represents Osram workers, “strongly opposes” the AMS deal, a spokeswoman said on Friday.\n\n“Our commitments are the same if not better than that of Bain and Carlyle,” AMS Chief Executive Officer Alexander Everke told reporters in Munich.\n\nOsram shares traded 0.5% higher at 37.70 euros per share as of 10:24 a.m. in Frankfurt, while AMS declined as much as 4.9% in Zurich.\n\nInvestor Support\n\nMeetings between AMS and its investors across Europe, the U.S. and Asia over the last two weeks revealed “strong support” for its plan to buy Osram, AMS said in a separate statement on Monday. It reduced the minimum acceptance rate for its offer to 62.5% from 70%, though won’t be able to count on Osram CEO Olaf Berlien, who will not tender his personal stock.\n\nAMS shareholders still need to approve a capital raise to finance the transaction that will increase debt, but that “will be reduced to where it was before the deal within two years,” Everke said.\n\nThe bidding war began in July, when AMS offered to counter a bid from Bain and Carlyle. AMS’s proposal was cleared last week by the country’s financial watchdog, allowing offers to remain open until Oct. 1.\n\n(A previous version of this story corrected to say Osram recommended, not rejected, the offer by AMS.)\n\nTo contact the reporter on this story: Oliver Sachgau in Munich at osachgau@bloomberg.net\n\nTo contact the editors responsible for this story: Anthony Palazzo at apalazzo@bloomberg.net, John Bowker, Andrew Noël\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Osram Licht AG recommended a 3.7 billion-euro ($4.1 billion) takeover bid from AMS AG on the basis of price, risking a backlash from labor groups concerned over potential job cuts that may come with the deal.The terms of AMS’s 38.50 euro-a share proposal eclipse Osram’s lingering concerns", "authors": ["Oliver Sachgau"], "top_image": "https://s.yimg.com/os/mit/media/p/common/images/favicon_new-7483e38.svg", "published_at": "2019-09-16"}