{"pub": "cbs", "url": "https://cbsnews.com/news/the-life-of-prince-revealed-in-the-beautiful-ones", "downloaded_at": "2019-10-28 00:25:13.591939+00:00", "title": "The life of Prince, revealed in \"The Beautiful Ones\"", "language": "en", "text": "Prince Rogers Nelson was rock and roll royalty. A favorite son of Minneapolis, he sold more than 100 million records, won seven Grammys, and even headlined at the Super Bowl. He won an Academy Award for his classic, \"Purple Rain.\"\n\nBut after some 20 gold records and hundreds of performances, he had a change of heart. The elaborate productions were past; just Prince, a piano, and a microphone.\n\nAnd he decided to write a memoir.\n\nDan Piepenbring was a 29-year-old unknown writer in New York. Prince had a history of finding new talent, and word got out the musician wanted someone untried for the project. So, Piepenbring sent a heartfelt pitch letter – perhaps, he worried, too heartfelt. \"It was immensely flattering. I compared him to Mozart. And I stand by that comparison. But the second I pressed 'send' on that email, I reread it, and it just seemed so over the top. And I really worried that I had done myself in.\"\n\nSpiegel & Grau\n\nBut less than 48 hours later, he was summoned to Prince's studio at Paisley Park, outside of Minneapolis.\n\nCorrespondent Jamie Yuccas asked, \"Were you surprised that he even wanted to meet with you?\"\n\n\"I was very surprised. I mean, I had never written a book before.\"\n\n\"Did you feel like you were living in this alternate universe once this all started happening?\" asked Yuccas.\n\n\"It was so confusing. I mean, I had no idea what was going to happen next. We were embarking on this very intimate project. And I almost immediately felt like I was in over my head.\"\n\nWith Piepenbring's help, Prince started handwriting his story, a story he had never told before.\n\nYuccas asked, \"What were his ambitions for the book?\"\n\n\"He said that if he wanted the book to be about one overarching thing, it would be freedom, and the freedom to create, and to inspire communities of people, especially black communities, to own what they create, and to support one another in that act of creation.\"\n\nThen, just as the project got rolling came the shocking news of Prince's death from a drug overdose at age 57, on April 21, 2016.\n\nBut Piepenbring kept going with the memoir. He would spend the next three years sorting through a blizzard of Prince's notes, photographs and drawings to put together the memoir \"The Beautiful Ones,\" out this week.\n\nPiepenbring said, \"His handwriting is beautiful. I mean, he has this very fluid script. But then it's also so unruly. It seems to be coming out of him so quickly that it verges on illegible a lot of the time.\"\n\nHe also used symbol: an eye for I, and the letter U for you. \"It's almost like a magic eye puzzle,\" Piepenbring said. \"You have to stare at it, and then suddenly the words come together, and you can read this amazing story of his childhood.\"\n\nHe was the son two local jazz musicians. By age 17, Prince was following in their footsteps, writing and recording songs of his own.\n\nPrince played and recorded at Moon Sound Studios in uptown Minneapolis. Between recording sessions, the studio tapped Robert B. Rivkin to be Prince's errand boy. \"My job became to drive Prince around,\" he said. \"Now we're talking about a 1974 Pinto woody wagon, olive green, drivin' around.\"\n\n\"Nothing sexier than that!\" laughed Yuccas.\n\n\"We had a car and I was getting paid to drive him around, and money to go to the movies and stuff. We spent seven months in that car, talking about his vision, his dream.\"\n\n\"When did you know he was something special?\"\n\n\"Instantly,\" Rivkin replied. \"He put his hand on the keyboard, put his left hand on the guitar and did a run and sang the same note at the same time.\"\n\n\"Did you ever see anybody else ever do that?\"\n\n\"Never.\"\n\nRivkin would become Bobby Z, a drummer in the band Prince and the Revolution.\n\nOne night, while on tour, he witnessed Prince's songwriting genius first-hand: \"So, everybody gets in their room and turns on HBO. And there's a show called 'The Man Who Saw Tomorrow,' and it was Orson Welles talking about Nostradamus. And it kept saying, '1999. 1999.'\n\n\"And so the next day the natural thing is, like, watercooler talk, like, 'Did you see that?' right? And he had already had the song written. And that was Prince.\"\n\nThe song became the title track for the breakthrough album that shot Prince to stardom.\n\nBackup singer Jill Jones remembers when \"1999\" came together at Paisley Park: \"I was in one of the bedrooms sleeping, and he was in the studio downstairs. And it was, like, 3:00. I was in my pajamas when we went and recorded everything. And he'd been working all by himself.\"\n\nPrince was famous for writing, composing and playing all day, and through the night. To call him prolific is an understatement. In his lifetime, he released hundreds of songs.\n\nAnd then there were those stories about a \"vault\": a treasure trove of unreleased Prince compositions.\n\nTurns out that vault really does exist. Troy Carter, who was once Lady Gaga's manager, now manages Prince's music. \"If I live to be over 100, there would still be enough material to outlive me,\" he said.\n\n\"So, do you think 100 years' worth of material?\" asked Yuccas.\n\n\"If the estate decided to release a project per year, I would say absolutely, yes. More than enough material.\"\n\n\"That's a lot of music!\"\n\n\"Yes. It's a lot of Prince!\" Carter laughed.\n\nFormer bandmate Bobby Z. gave Yuccas a glimpse of the riches the vault contains, playing an unreleased song from the \"1999\" tour.\n\n\"It takes you back to that arena that night,\" he said.\n\nBack to a time when Prince was holding court – a talent so timeless that even in death the power of his music lives on.\n\nYou can stream the new Prince album \"Originals\" by clicking on the embed below (Free Spotify registration required to hear the tracks in full):\n\n\n\nFor more info:\n\n\n\nStory produced by John Goodwin.", "description": "Begun just months before his death in 2016, a memoir by the legendary singer-songwriter is now being published – and a vault of his unreleased music is beginning to disclose its secrets", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/10/27/f7a2cdeb-61b2-4d6c-89c1-42b105b69d89/thumbnail/1200x630/aff0e3ca2f154a3ce2da205e105cbffa/prince-the-beautiful-ones-memoir-promo.jpg", "published_at": "2019-10-27"}