{"pub": "cbc", "url": "https://cbc.ca/news/business/home-price-heloc-spending-1.5291558", "downloaded_at": "2019-09-20 22:37:55.081940+00:00", "title": "When house prices rise, Canadians borrow against their homes and boost their spending | CBC News", "language": "en", "text": "As Canadian home prices rose from 2014 to 2017, many households tapped the growing value in their homes for other spending, according to study by Bank of Canada economists.\n\nAbout two million households used home equity lines of credit (HELOCs), but another 380,000 got mortgage financing to raise equity, taking advantage of interest rates that fell in 2015, the researchers say in an analysis released Friday.\n\nThat led to an increase of 0.5 per cent in GDP annually because of increased spending, proving the importance of home values to boost consumption and renovation spending, according to researcher Anson Ho.\n\n\"Total equity extraction peaked at $89 billion in 2017. Of this, $49 billion was through HELOCs and $40 billion through mortgage refinancing,\" the study found.\n\nIt's generally been a good thing for the economy. Household spending would have been materially lower without equity extraction, the researchers say.\n\nWhere the money goes\n\nAbout 25 per cent of the spending went to home renovations and another quarter went to consumption of other big-ticket items, including cars and furniture. Only about 28 per cent went to debt consolidation, with another 22 per cent going to investments.\n\nThe study found household spending tends to rise with home prices. Canadians find it easier to borrow against their homes as values rise.\n\nIn 2017, household spending jumped 3.5 per cent, while house prices rose an average of 13 per cent across the country.\n\nStarting in 2015, Albertans were big on tapping HELOCs and refinancing mortgages to tide them over the drop in oil prices.\n\nConversely, house prices stalled or fell in 2018 and stock markets stumbled. That led to a decline in consumer spending and in borrowing against homes. That could have had a negative impact of 0.1 per cent on the GDP, the researchers found.\n\n\"If this collateral effect is strong, it could leave the economy more vulnerable to adverse events, such as a large decline in house prices,\" the study said.", "description": "As Canadian home prices rose from 2014 to 2017, many households tapped the value in their homes for other spending, according to an analysis by Bank of Canada economists, and that gave a material boost to the economy as a whole.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5291618.1569007249!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/fedbudget-renos-20090128-topix.jpg", "published_at": "2019-09-20"}