{"pub": "telegraph", "url": "https://telegraph.co.uk/gymnastics/2019/10/13/joe-fraser-wins-britains-first-gold-parallel-bars-end-memorable", "downloaded_at": "2019-10-13 18:37:57.529978+00:00", "title": "Joe Fraser wins Britain's first gold parallel bars to end memorable World Gymnastics Championships", "language": "en", "text": "A memorable weekend in Stuttgart ended in triumphant scenes as 20-year-old Joe Fraser was hoisted onto his team-mates’ shoulders. Fraser had just scored a major personal breakthrough by becoming Great Britain’s first world champion on the parallel bars.\n\nFraser’s triumph came by the narrowest of margins – just one-sixtieth of a mark – after he exactly replicated his qualifying score of 15.000. His routine was marked out by his precise and unwavering handstands, which earned him the highest difficulty rating in the field. There was only one inaccuracy – a slight step forward after landing his dismount. But that was enough to leave him sweating as he waited through the remaining four routines.\n\nAfter the British team had matched their best-ever day at the World Championships on Saturday – when Max Whitlock won the pommel-horse final for the third time, and both Downie sisters also claimed their first individual medals – this result leaves Stuttgart feeling like a roaring success.\n\nA haul of four medals fell one short of the Glasgow World Championships of 2015, when both men’s and women’s teams stood on the podium. But this was the first time that Great Britain had claimed two world golds in the same year, and all without the home advantage that they enjoyed four years ago.", "description": "A memorable weekend in Stuttgart ended in triumphant scenes as 20-year-old Joe Fraser was hoisted onto his team-mates’ shoulders.", "authors": ["Simon Briggs", "Paul Hayward"], "top_image": "https://www.telegraph.co.uk/content/dam/gymnastics/2019/10/13/TELEMMGLPICT000212928997-xlarge_trans_NvBQzQNjv4BqM37qcIWR9CtrqmiMdQVx7KmTKXIomgWFyyVc9h-5QJw.jpeg?imwidth=1200", "published_at": "2019-10-13"}