{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/sep/14/few-acts-more-horrific-former-us-priest-jailed-for-30-years-for-child-sexual-abuse", "downloaded_at": "2019-09-14 05:27:28.277817+00:00", "title": "'Few acts more horrific': former US priest jailed for 30 years for child sexual abuse", "language": "en", "text": "Catholic priest Arthur Perrault convicted of ‘long-term’ abuse of altar boy in New Mexico in 1990s\n\n'Few acts more horrific': former US priest jailed for 30 years for child sexual abuse\n\nA former Roman Catholic priest who fled to Morocco before he was returned to the United States and convicted of sexually abusing an altar boy in New Mexico in the 1990s, has been sentenced to 30 years in prison.\n\nThe US district judge, Martha Vazquez, imposed the sentence on Arthur Perrault, 81, a onetime Air Force chaplain and colonel.\n\n“There are few acts more horrific than the long-term sexual abuse of a child,” said the US attorney, John Anderson, in a statement. “At long last, today’s sentence holds Perrault accountable for his deplorable conduct.”\n\nChild sexual abuse inquiry to be held into religious organisations Read more\n\nPerrault was convicted by a federal jury in April on six counts of aggravated sexual abuse and one count of abusive sexual contact with a minor in 1991 and 1992 at Kirtland Air Force Base in Albuquerque and at the Santa Fe National Cemetery, prosecutors said.\n\nThe victim, now an adult, testified that Perrault befriended him when he was 9 years old, showering him with gifts and trips before sexually assaulting him, prosecutors said.\n\nAlthough he was convicted of abusing just one victim, prosecutors alleged in court filings that Perrault was a serial child molester who abused numerous young people over more than 30 years as a priest in New Mexico and Rhode Island.\n\nAt his trial, seven other alleged victims testified that Perrault, ordained in 1964, abused them during the 1960s, 1970s and 1980s.\n\nThe Catholic church has been roiled by allegations of sexual abuse since 1992, when the Boston Globe newspaper revealed a decades-long cover-up by church hierarchy of sexual misconduct by its clergy.\n\nThe US Catholic church has paid out more than $3bn to settle clergy abuse cases, according to BishopAccountability.org which tracks the issue.\n\nUnder federal law, a convicted defendant must serve at least 85% of a sentence, meaning Perrault will likely die in prison.\n\nPerrault fled the United States in 1992 when his criminal conduct became public, prosecutors said. He was located in Morocco, where he was arrested in 2017 following his indictment on the sex charges, and was extradited to New Mexico.", "description": "Catholic priest Arthur Perrault convicted of ‘long-term’ abuse of altar boy in New Mexico in 1990s", "authors": [], "top_image": "https://i.guim.co.uk/img/media/2caf60439360f5b0b25b4aa4113890ca6d6d0ed1/0_68_2000_1200/master/2000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2f8713b0d1b8c48b2c2861d8fa593201", "published_at": "2019-09-14"}