{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7562931/Astronomers-reveal-violent-flaring-centre-black-hole.html", "downloaded_at": "2019-10-11 19:40:20.717096+00:00", "title": "Footage reveals radiation blazing out of a black hole 10,000 light years away from the Earth", "language": "en", "text": "Astronomers have created footage of a violent flaring phenomenon at the centre of a black hole in our solar system.\n\nScientists from the University of Southampton used state-of-the-art cameras to capture the dramatic event in more detail than ever before.\n\nAnd using the data from these observations they have created a slowed down and illustrated animation of what the process could look like.\n\nThe 40-second clip depicts the black hole – which is 10,000 light years away, within our own Milky Way – shooting out giant beams of radiation as its immense gravitational pull and magnetic fields interact with matter it's sucking in.\n\nThese huge explosions can spit out considerably more energy than our Sun in the blink of an eye.\n\n(Video contains flashing images)\n\nResearchers from the University of Southampton used their own telescope observations from the Canary Islands and radiation data from a NASA instrument on the International Space Station to recreate the flashing black hole at the centre of black hole system MAXI J1820+070\n\nGraduate student John Paice, who created the movie, said: 'The movie was made using real data, but slowed down to 1/10th of actual speed to allow the most rapid flares to be discerned by the human eye.\n\n'We can see how the material around the black hole is so bright, it’s outshining the star that it is consuming.\n\n'And the fastest flickers last only a few milliseconds – that’s the output of a hundred Suns and more being emitted in the blink of an eye.'\n\nMr Paice's footage shows space debris and gas rotating around the black hole, which is named MAXI J1820+070.\n\nThis black hole system weighs about seven times as much as our Sun but that's compressed into an area smaller than the City of London.\n\nThe team combined their observations from a telescope in the Canary Islands with X-rays from an NASA observatory on the International Space Station.\n\nFlares like these are hard to observe, the researchers said, because they're so far away, so faint and happen so quickly.\n\nAnd although this isn't the first time they've been found, it's a far more detailed and accessible version of it than has been produced in the past.\n\nA Southampton colleague of Mr Paice's, Dr Poshak Gandhi, has found something similar on two separate occasions.\n\nAstronomers this year achieved what was thought to be impossible and captured the first ever real photograph of a black hole. The now-famous picture depicts a supermassive black hole at the centre of the galaxy Messier 87, 54million light years away from Earth. The image shows a bright ring formed as light bends in the intense gravity around a black hole that is 6.5billion times more massive than the Sun\n\n'The fact that we now see this in three systems strengthens the idea that it is a unifying characteristic of such growing black holes,' Mr Paice said.\n\n'If true, this must be telling us something fundamental about how plasma flows around black holes operate.\n\n'Our best ideas invoke a deep connection between inspiralling and outflowing bits of the plasma.\n\n'But these are extreme physical conditions that we cannot replicate in Earth laboratories, and we don’t understand how nature manages this. Such data will be crucial for homing in on the correct theory.'\n\nThe team published their findings in the Monthly Notices of the Royal Astronomical Society: Letters.", "description": "Astronomers from the University of Southampton used their own telescope observations and radiation data from a NASA instrument on the ISS to create the detailed video.", "authors": ["Sam Blanchard For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/13/wire-19587626-1570797271-483_636x382.jpg", "published_at": "2019-10-11"}