{"pub": "reuters", "url": "https://reuters.com/article/us-wto-aircraft-whisky/scotch-whisky-association-says-tariffs-will-hurt-scotland-urges-restraint-idUSKBN1WI0RD", "downloaded_at": "2019-10-03 09:42:13.509497+00:00", "published_at": "2019-10-03", "title": "Scotch Whisky Association says tariffs will hurt Scotland, urges restraint", "language": "en", "text": "LONDON (Reuters) - A move by the United States to slap a 25% tariff on single malt Scotch whisky will damage the industry and hurt jobs and investment in Scotland, the sector’s trade association said on Thursday, as it urged restraint on all sides.\n\nWashington on Wednesday said it would slap 10% tariffs on European-made Airbus (AIR.PA) planes and 25% duties on a range of products including French wine, Scotch whiskies and cheese from across the continent as punishment for illegal EU aircraft subsidies.\n\nThe United States is Scotch whisky’s largest and most valuable single market, with over 1 billion pounds of the product being exported there last year.\n\nThe association said despite the issue being over aircraft subsidies, single-malt whisky represented over half of the total value of UK products on the U.S. tariff list, amounting to over $460 million.\n\n“The tariff will undoubtedly damage the Scotch Whisky sector,” Scotch Whisky Association Chief Executive Karen Betts said in a statement.\n\n“The tariff will put our competitiveness and Scotch Whisky’s market share at risk,” she said. “We expect to see a negative impact on investment and job creation in Scotland, and longer term impacts on productivity and growth across the industry and our supply chain.”\n\nBetts urged the United States, the European Union and the United Kingdom to de-escalate the trade dispute, adding that exports going both ways between Britain and the United States had grown strongly over the last 25 years when there were no tariffs on spirits.", "description": "A move by the United States to slap a 25% tariff on single malt Scotch whisky will damage the industry and hurt jobs and investment in Scotland, the sector's trade association said on Thursday, as it urged restraint on all sides.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png"}