{"pub": "washingtonpost", "url": "https://washingtonpost.com/arts-entertainment/2019/10/03/why-joker-became-one-most-divisive-movies-year", "downloaded_at": "2019-10-04 01:21:38.269172+00:00", "published_at": "2019-10-03", "title": "Why ‘Joker’ became one of the most divisive movies of the year", "language": "en", "text": "\n\nJoaquin Phoenix in \"Joker.\" (Niko Tavernise/Warner Bros. Pictures/AP)\n\nThe mind of an alienated young loner builds toward a delusional boil. Robert De Niro appears in this gritty city narrative, in which a political candidate promises to make the electorate great again.\n\nThat is the tale of “Taxi Driver,” Martin Scorsese’s bloody bicentennial-year release that remains bracingly relevant. But that description also applies to Todd Phillips’s “Joker,” which stars Joaquin Phoenix as the deranged, gun-toting “vigilante” opposite De Niro — and draws inspiration from “Taxi Driver” and other urban outcast movies of that era.\n\nThe two films have something else in common: “Joker,” like “Taxi Driver” four decades ago, has stirred roiling controversy over its depictions of violence and hate. The discourse continues even as the movie is projected to gross more than $75 million in its domestic debut this weekend — and has so far been cast as both pop-culture villain and victim, depending on whom you ask.\n\n“The whole issue about the violence in the movie kind of exploded,” “Taxi Driver” star Jodie Foster told the Hollywood Reporter in 2016, in recalling how her movie was both booed and cheered at Cannes, where it received the Palme d’Or before going on to receive a best picture Oscar nomination.\n\nNow, Phillips’s film — set in the Batman family’s Gotham City of the early ’80s — is also making headlines for its subject matter against the backdrop of real-world terrorism, including recent mass shootings in Texas, Ohio and California.\n\nThe questions are coming rapid-fire from so many commentators and online commenters: Is this the wrong movie at the wrong time? Does “Joker” glamorize a killer or simply hold a mirror to society? Will this portrayal be embraced by other sick young men bent on justifying their violence?\n\nIn response, the director has gone on the defensive in his remarks. On Wednesday, after “Joker” screened at the New York Film Festival, Phillips said it is “very responsible” for his film to affix real-world implications to violence, adding: “Isn’t that a good thing to take away the cartoon element of violence that we’ve become so immune to?\"\n\nJust a few weeks ago, “Joker” was picking up the best film prize at the Venice Film Festival; now, its studio, Warner Bros., has limited journalistic access to the movie’s talent, perhaps to avoid adding fuel to any public-relations fires — though all the headlines could help stoke its box office. (The studio did not make Phillips, his co-writer and the producers available for this story.)\n\nAfter seeing “Joker” in Venice, Vanity Fair critic Richard Lawson wrote that the film “may be irresponsible propaganda for the very men it pathologizes. Is 'Joker’ celebratory or horrified? Or is there simply no difference?”\n\n“It’s perfectly fair for critics and fans to question whether or not this is the right film at the right time,” says Andrew Farago, co-author, with Gina McIntyre, of the new book “Batman: The Definitive History of the Dark Knight in Comics, Film, and Beyond,” “and it’s perfectly fair for the filmmakers to engage in that discussion however they see fit.”\n\n“I think it’s an important discussion to have,” Farago adds, “whether you view the film as a reflection of modern society or the wrong film at the wrong time, or as simple escapism.”\n\n\n\nJoaquin Phoenix, left, and director Todd Phillips attend the \"Joker\" premiere at Alice Tully Hall during the New York Film Festival on Wednesday. (Brent N. Clarke/Invision/AP)\n\n“Joker” has faced more scrutiny than other recent films that have evil clowns (“It”) or high body counts (the “John Wick” franchise) or even other Joker movies (“Suicide Squad”). Some comics-industry experts believe that’s because “Joker” checks so many boxes of pointed public debate, including guns, mass shootings and mental illness — even as Phillips has chalked up some of the response to outrage being “a commodity.\"\n\n“Joker” is also stirring memories of the tragedy around another Gotham-set film, the 2012 Aurora, Colo., mass shooting that killed 12 people at a screening of Warner Bros./DC’s “The Dark Knight Rises.” The new film won’t screen at that theater after Aurora victims’ relatives raised concerns about the film’s gun violence.\n\nWarner Bros. released a statement last month in response to those concerns, saying that the studio “believes that one of the functions of storytelling is to provoke difficult conversations around complex issues.”\n\n“Make no mistake: neither the fictional character Joker, nor the film, is an endorsement of real-world violence of any kind,” the statement said. “It is not the intention of the film, the filmmakers or the studio to hold this character up as a hero.”\n\nAuthor Brad Meltzer, whose work includes crime fiction and the Justice League of America, notes how the Batman associations to the Aurora massacre are still with us. “Even though it’s been proven that the shooter in that Colorado theater wasn’t dressed as the Joker,” he says — referring to a rumor that the shooter’s appearance and utterances were inspired by the Joker — “the images and pain still rightfully linger.”\n\n“Joker’s” homage to “Taxi Driver” bears the reminder of another violent attack: a fan’s obsession with the 1976 movie, including with the then-12-year-old Foster, preceded his assassination attempt of President Ronald Reagan.\n\n“Joker” arrives as the United States averages more than one mass shooting per day. Security presence at the film’s screenings, in such cities as New York, Los Angeles and Chicago, will be increased, according to reports.\n\nFor all the headlines, “Joker” is hardly an outlier. “There’s a long tradition in pop culture of audiences embracing antiheroes and, in many cases, outright villains, and taking away a completely different message than the filmmakers intended,” says Farago, curator of the Cartoon Art Museum in San Francisco. “Comic and movie fans online quote Heath Ledger’s Joker and Tom Hardy’s Bane much more readily than Christian Bale’s Batman. Readers see Rorschach in Alan Moore and Dave Gibbons’s comic ‘Watchmen’ as a cool action hero and not a damaged sociopath.”\n\nThe Joker has had many incarnations since making his comic-book debut in 1940. Jerry Robinson, the co-creator of the character, said during a Washington Post interview a decade ago that he marveled at how Ledger mined the villain for fresh depths in 2008′s “The Dark Knight.” And “Joker” executive producer Michael E. Uslan said in June that after seeing images from “The Shining,” he knew Jack Nicholson could deliver a darkly maniacal performance as the Joker — two decades after Cesar Romero played the Clown Prince of Crime for campy laughs in TV’s “Batman.”\n\n“One of the things about the Joker is, it’s so easy for people to project anything onto that adaptable character,” says Travis Langley, a Henderson State University psychologist and author of the new book “The Joker Psychology: Evil Clowns and the Women Who Love Them.\"\n\nLangley notes that Phillips has even given his Joker an array of traits and symptoms that suggest no single mental disorder, further underscoring the character’s mutability.\n\nUnlike the more cartoonish interpretations of the Joker, Phoenix’s performance feels more rooted in the real — and such near-realism can disturb the viewer more than art painted in broad genre strokes, industry experts say.\n\n“I think the moment scary entertainment seems ‘real,’ it moves into a different part of our consciousness,” Meltzer says. “Escapism disappears, and we’re left with real fear.”\n\nThen, “when it feels too much like real life, the smiles disappear, which really is the point of the Joker,” he says. “The character is meant to make you uncomfortable.”\n\nRead more:\n\nHow Tim Burton’s ‘Batman’ radically changed the superhero-movie landscape 30 years ago\n\nOur definitive ranking of Joker performances, from Jack Nicholson to Joaquin Phoenix", "description": "The Joaquin Phoenix film about the Batman villain has faced blowback for its portrayal of violence.", "authors": ["Michael Cavna", "Writer Artist For Comic Riffs", "Covering Visual Storytelling", "Cartoon Art Illustration", "Comedy Satire", "October At Pm", "Writer Artist Visual Storyteller Michael Cavna Is Creator Of The Comic Riffs Column", "Graphic-Novel Reviewer For The Washington Post'S Book World."], "top_image": "https://www.washingtonpost.com/resizer/qLweiTgWeBFBVmpEu25lybu_hDc=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/XNX5UOMO2NARHN5XIT2DTQJP6M.jpg"}