{"pub": "reuters", "url": "https://uk.reuters.com/article/us-ericsson-probe/ericsson-makes-1-2-billion-provision-to-settle-u-s-probes-flags-third-quarter-hit-idUKKBN1WB00F", "downloaded_at": "2019-09-26 01:35:01.981158+00:00", "title": "Ericsson makes $1.2 billion provision to settle U.S. probes, flags third quarter hit", "language": "en", "text": "FILE PHOTO: The Ericsson logo is seen at the Ericsson's headquarters in Stockholm, Sweden June 14, 2018. REUTERS/Olof Swahnberg/File Photo\n\n(Reuters) - Mobile telecom gear maker Ericsson (ERICb.ST) said on Thursday its third-quarter results will be hit by a 12 billion Swedish krona (996 million pounds) provision it was making for U.S. investigations.\n\nThe investigations, by the U.S. Securities and Exchange Commission and the Department of Justice, are linked to the company’s compliance with the U.S. Foreign Corrupt Practices Act (FCPA), Ericsson said in a statement.\n\nThe Swedish company said it estimated a monetary sanction of $1 billion, along with additional related costs, to settle the investigations.\n\n“The process to find a resolution is still ongoing,” Ericsson said.\n\nThe company has identified breaches of its code of ethics and of the FCPA during the course of the investigation, Ericsson said, adding that the breaches were the outcome of many deficiencies, including the company’s failure to react to red flags and inadequate internal controls.\n\n“We have to recognise that the company has failed in the past,” Ericsson Chief Executive Borje Ekholm said.\n\nThe Stockholm-based company said it has improved its compliance programs, without providing further details.\n\nBesides the financial provision, the company said it also expects the investigations to cause reputational damage to Ericsson that will have an adverse impact.\n\nEricsson said it initially received questions from the SEC in 2013 and from the DOJ in 2015, adding it has been cooperating with the authorities.", "description": "Mobile telecom gear maker Ericsson said on Thursday its third-quarter results will be hit by a 12 billion Swedish krona (996 million pounds) provision it was making for U.S. investigations.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190926&t=2&i=1433948645&w=1200&r=LYNXMPEF8P005", "published_at": "2019-09-26"}