{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7510333/Raphaels-masterpieces-National-Gallery-major-new-exhibition.html", "downloaded_at": "2019-10-05 06:52:19.067249+00:00", "title": "Raphael's masterpieces to be put on show at the National Gallery in a major new exhibition", "language": "en", "text": "A major new retrospective of works by Raphael will launch next year at the National Gallery to mark the 500th anniversary of his death.\n\nOne of the first ever exhibitions to explore the complete career of the renaissance master, the new show will focus on his other multimedia disciplines as well as his painting.\n\nThe wide-ranging show will feature the Italian's architecture, archaeology, poetry, and design for sculpture, tapestry, prints, and the applied arts.\n\nThe large scale exhibition will showcase the Italian's sculpture, tapestry, paintings and much more\n\nThe National Gallery has managed to secure and a number of impressive loans from some of the world's biggest museums for the blockbuster show, which will launch in October 2020.\n\nAs well as the 10 works from the National Gallery's collection of Raphaels, curators have borrowed works from the Louvre, Musei Vaticani, Galleria degli Uffizi, National Gallery of Art (Washington DC), and the Museo Nacional del Prado.\n\nWorks which cannot be physically displayed, such as the monumental frescoed rooms in the Vatican Palace, known as the Stanze of Raphael, will be presented in other 'innovative' ways.\n\n'His painting is so familiar and iconic for very good reasons and so many people associate him with that but he applied the principles of his painting in everything he did,' Matthias Wivel, curator of 16th century Italian paintings at the gallery, told the London Evening Standard.\n\nWorks by Raphael will launch next year at the National Gallery to mark the 500th anniversary of his death.\n\n'There will be works never seen in the UK before or never seen outside of where they reside now, it will be the broadest in scope we've seen and it's surprising there has never been a show that's taken this approach before.'\n\nMr Wivel said that Raphael 'shows us the things we should aspire to, he represents our ideals better than any other visual artist.'\n\nWhile he was only working for two decades before his death at 37 in 1520, Raphael is still recognised today as the supreme High Renaissance painter.", "description": "A major new retrospective of works by the Italian renaissance artist Raphael will launch next year at the National Gallery to mark the 500th anniversary of his death.", "authors": ["Daily Mail Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/27/01/18990280-0-image-a-9_1569544704322.jpg", "published_at": "2019-09-27"}