{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/28/WS5db6a6b3a310cf3e35574047.html", "downloaded_at": "2019-10-28 09:49:15.429117+00:00", "title": "Tibetan female intellectual federation set up in Lhasa", "language": "en", "text": "chinadaily.com.cn | Updated: 2019-10-28 16:28\n\nWomen attend the inaugural meeting of the Female Intellectual Federation of the Tibet Autonomous Region on Oct 27, 2019. [Photo/chinanews.com]\n\nThe Female Intellectual Federation of the Tibet Autonomous Region, the first spontaneously organized association by Tibetan female intellectuals of varied ethnic groups, was established in Lhasa on Sunday, Xinhua reported.\n\nThe first executive committee of the federation was elected and a constitution was passed at its inaugural meeting the same day.\n\n\"The establishment of the federation offers a platform for mutual exchange among female intellectuals in Tibet,\" said Gyatso Lhamo, deputy secretary and chairwoman of the Party Committee of the Women's Federation of Tibet.\n\nShe hoped the federation will play a leading role in engaging more Tibetan women in innovation and entrepreneurship, strengthening ethnic solidarity and building a prosperous Tibet.\n\nPenpa Lhamo, director of the South Asia Institute of the Tibetan Academy of Social Sciences and chairwoman of the federation's executive committee, said female intellectuals are the biggest beneficiaries of the gender equality policy that has been effectively implemented in Tibet, and should contribute their strength to the advancement of regional economic and social development.\n\nAt present, there are a total of 77 female intellectual representatives of varied ethnic groups in the federation, among which 10 hold a doctorate, over 30 have a master's degree, and over 10 have returned from overseas after completing their studies, according to the report.\n\nThe educational level of women and children in Tibet has been continuously improving in the past 60 years. The proportion of female students in general higher education, postgraduate and adult higher education are all above 50 percent.\n\nTibetan women who receive special allowances as outstanding experts, scholars and technicians from the State Council and the regional government account for 12.74 percent and 17.78 percent of recipients, respectively. Females account for 27.45 percent of lead researchers in Tibet, according to statistics from the regional government.", "description": "The Female Intellectual Federation of the Tibet Autonomous Region, the first spontaneously organized association by Tibetan female intellectuals of varied ethnic groups, was established in Lhasa on Sunday, Xinhua reported.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/28/5db6a6b3a310cf3e97a345e7.jpeg", "published_at": "2019-10-28"}