{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/fearless-liverpools-title-belief-made-20738370", "downloaded_at": "2019-10-28 00:33:44.081046+00:00", "title": "Fearless Liverpool's title belief made Tottenham victory inevitable", "language": "en", "text": "Get the biggest Liverpool FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThe most impressive thing was no-one ever showed any sign of doubt.\n\nEven at 1-0 down with the clock ticking down, you never really thought Liverpool would not come back and win.\n\nThere is not even a murmur of discontent from the crowd, the players keep going, Jurgen Klopp roars them forward and you almost wait for the inevitable.\n\nThey were brilliant, they had to be to emerge victorious from a game of such high quality.\n\nOf course Liverpool were going to win because that is what they do - even when they are up against it, even when players are tired after a Champions League trip in midweek and even when a few are clearly carrying niggles.\n\n(Image: Getty Images)\n\nIt sums up their attitude, their unshakeable belief in this season’s title race as they made it a 12 straight wins at Anfield where they have not dropped points since being held by Leicester last January.\n\nThat is some run. There is no sense of fear, no worry about expectation, no-one needs reminding they have not won the title for 29 years because they are fully embracing the challenge.\n\nYou always knew that Mo Salah would score when he ran up to take the 75th minute penalty. No matter soon after he was hobbling around on the touchline with a huge ice pack strapped to his ankle. There is no stopping him.\n\n(Image: REUTERS)\n\nIt re-established Liverpool’s six point lead over Manchester City and the two sides meet here in a fortnight when, if Klopp’s men can show the same mental strength, they can take another huge step towards the title.\n\nThis place just sucks the ball towards goal and, as the tension rose, you could see Tottenham retreating back into their shells as Liverpool pinned them back with wave after wave of attack.\n\nThe defining moment of the match, right back Serge Aurier’s reckless clumsy challenge to concede the penalty, only served to highlight what has gone wrong for Mauricio Pochettino’s men this season.\n\n(Image: Offside via Getty Images)\n\nForget every other bit of transfer business in the summer, allowing Kieran Trippier to leave for Atletico Madrid and be replaced by Aurier is by far and away the worst. Aurier is a shocking liability, miles away from being good enough and with a big mistake in every game.\n\nIt undid all of Tottenham’s hard work as they had defended valiantly, Harry Kane scored and stand-in keeper Paulo Gazzaniga was the best player on the pitch even in defeat.\n\nTottenham stunned Liverpool by going ahead after just 47 seconds when Heung-Min Son led a counter attack, his shot deflected off Dejan Lovren, hit the woodwork and there was Kane to head home to go joint third on 174 goals in Tottenham’s all-time list.\n\n(Image: Getty Images)\n\nBut from then on, Gazzaniga had to pull off a string of sensational saves as he defied Roberto Firmino, Salah, Virgil van Dijk.\n\nIn contrast, Tottenham had very little to offer as one rare break saw Kane and Christian Eriksen go close.\n\nBut Son missed Tottenham’s best chance to kill the game off. Son outstripped Lovren on the break, rounded Liverpool keeper Alisson and then smashed his shot against the bar. The game slipped away in that moment.\n\n(Image: CameraSport via Getty Images)\n\nFour minutes later, Fabinho’s lofted ball put Spurs under pressure, Danny Rose looked to have pushed Firmino but, while Liverpool were appealing, Jordan Henderson smashed home his first goal of the season and his first at Anfield since December 2015.\n\nLiverpool won it with 15 minutes left. Aurier tussled with Mane, then lost the ball, lost his man and tripped the Liverpool forward. It was a stonewall yet clumsy penalty. Salah smashed it home.\n\nTottenham kept pressing until the end as Rose, Son and Toby Alderweireld went close but Liverpool were not letting this one slip.", "description": "The Reds showed true character to come from behind against Spurs but they never looked like losing", "authors": ["John Cross", "Image", "Getty Images", "Reuters", "Offside Via Getty Images", "Camerasport Via Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20737792.ece/ALTERNATES/s1200/0_Liverpool-FC-v-Tottenham-Hotspur-Premier-League.jpg", "published_at": "2019-10-27"}