{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7539425/NASA-reschedules-female-spacewalk-canceled-March-weekend.html", "downloaded_at": "2019-10-05 08:32:06.102540+00:00", "title": "NASA reschedules first-ever all-female spacewalk that was canceled in March for Oct 21", "language": "en", "text": "Two astronauts are taking one giant leap for women in the first-ever all-female spacewalk.\n\nNASA astronauts Christina Koch and Jessica Meir are scheduled to venture outside of the International Space Station on October 21 for the fourth spacewalk of 10 scheduled over the next three months.\n\nAlthough 15 women have performed a spacewalk, each time they were accompanied by their male colleagues.\n\nThe American space agency had previously set a day back in March for this all-female endeavor, but had to cancel the event due to a lack of properly fitted spacesuits.\n\nScroll down for video\n\nNASA astronauts Christina Koch (left) and Jessica Meir (right)` are scheduled to venture outside of the International Space Station on October 21 for the fourth spacewalk of 10 scheduled over the next three months\n\nNASA is hosting a spacewalk marathon starting this month, which will carry out through December.\n\nThe events could ultimately set a new record for most spacewalks completed in a short time, but the purpose of this marathon is to complete repair and upgrades to the International Space Station (ISS), Astronomy.com reported.\n\nThe first spacewalk is set to kick-off this Sunday, October 6 at 7:50 AM, which will focus on replacing batteries outside the ship with updated lithium-ion versions.\n\nAnd the next five will make repairs to the space station’s Alpha Magnetic Spectrometer, which is used in a dark matter experiment – each of the spacewalks are set to last for six and a half hours.\n\nNASA is hosting a spacewalk marathon starting this month, which will carry out through December. The marathon will also go down in history for the first-ever all-female spacewalk. Pictured is Christina Koch and Jessica Meir, set to make the spacewalk on Oct. 6\n\nThe marathon will also go down in history for the first-ever all-female spacewalk.\n\nHowever, it was set to be astronaut Anne McClain, not Jessica Meir, who was to participate, but she head back home to Earth in June – missing her chance to make history.\n\nBoth Koch and McClain needed medium-sized torso components for their space suits.\n\nWhile two were available, the second set of protective clothing couldn't be configured in time for the walk.\n\nKoch was then paired up with Nick Hague to perform her duties, until her best friend joined her on the ISS last week – and Koch welcomed her with a heartwarming tweet.\n\nAn International Space Station astronaut captured the jaw-dropping moment that the Soyuz MS 15 spacecraft launched into space – and aboard was her best friend.\n\nInternational Space Station astronaut captured a jaw-dropping moment smoke soars above the Earth as the Soyuz MS 15 spacecraft launched into space – and aboard the craft was her best friend\n\nNASA flight engineer, Christina Koch, shared the snap on Twitter celebrating 'what it looks like from @Space_Station when your best friend achieves her lifelong dream to go to space'.\n\nThe image shows the Soyuz MS-15 spaceflight leaving Earth and heading to the International Space Station (ISS).\n\nThe craft is taking three people to the ISS: Roscosmos cosmonaut Oleg Skripochka, Hazzaa Ali Almansoori from the United Arab Emirates and Jessica Meir, NASA astronaut and Koch's best friend – the mission has been named 'Expedition 61'.\n\nKoch and Meir met during astronaut training and are not being reunited in space where they will work together until February 2020.\n\n'What it looks like from @Space_Station when your best friend achieves her lifelong dream to go to space,' wrote Koch in a tweet.\n\nThe interstellar show could be seen from the ground and some people shared the image for the world to enjoy\n\n'Caught the second stage in progress! We can't wait to welcome you on board, crew of Soyuz 61!'\n\nThe Soyuz successfully docked to the ISS at 3:42 p.m. EDT on the same day of the launch.\n\nDuring Expedition 61, crew members will install new lithium-ion batteries for two of the station's solar array power channels through a series of spacewalks, according to NASA.\n\nLater in the mission, spacewalkers are scheduled to upgrade and repair the Alpha Magnetic Spectrometer (AMS), a key science instrument housed outside the station to study dark matter and the origins of the universe.\n\nFrom left to right are astronauts Nicole Aunapu Mann, Anne McClain, Jessica Meir, and Christina Hammock Koch\n\nAnd the ISS mission hits a milestone of its own.\n\nWhen Koch heads home, she will have completed 355 days in space, which is the longest single spaceflight by a woman.\n\nKoch has shared other stunning images of her view from space in the past.\n\nEarlier this year, the NASA astronaut shared a detailed image of the Earth transition from day into night.\n\nEarlier this year, the NASA astronaut shared a detailed image of the Earth transition from day into night\n\nKoch shared the stunning image on twitter and stating that a filter was not used\n\n'A couple times a year, the @Space_Station orbit happens to align over the day/night shadow line on Earth,' Koch wrote.\n\n'We are continuously in sunlight, never passing into Earth's shadow from the Sun, and the Earth below us is always in dawn or dusk.\n\n'Beautiful time to cloud watch. #nofilter,' she added.\n\nThe International Space Station orbits roughly 220 miles above the Earth and completes one trip around our planet every 92 minutes, according to NASA.\n\nWHAT IS THE INTERNATIONAL SPACE STATION? The International Space Station (ISS) is a $100 billion (£80 billion) science and engineering laboratory that orbits 250 miles (400 km) above Earth. It has been permanently staffed by rotating crews of astronauts and cosmonauts since November 2000. Research conducted aboard the ISS often requires one or more of the unusual conditions present in low Earth orbit, such as low-gravity or oxygen. ISS studies have investigated human research, space medicine, life sciences, physical sciences, astronomy and meteorology. The US space agency, NASA, spends about $3 billion (£2.4 billion) a year on the space station program, a level of funding that is endorsed by the Trump administration and Congress. A U.S. House of Representatives committee that oversees NASA has begun looking at whether to extend the program beyond 2024. Alternatively the money could be used to speed up planned human space initiatives to the moon and Mars.\n\nIt travels at an astonishing 17,200 miles per hour, which allows astronauts to be able to see as many as 15 or 16 sunrises and sunsets every day.\n\nThat amounts to tens of thousands of sunsets and sunrises viewed of the course of a year. For example, retired US astronaut Scott Kelly observed 10,944 sunrises and sets during his year in space.", "description": "NASA astronauts, Christina Koch and Jessica Meir, are taking one giant leap for women on Earth in the first-ever all-female spacewalk set to take place on Oct 21 outside the ISS.", "authors": ["Stacy Liberatore For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/23/19317660-0-image-a-9_1570229686881.jpg", "published_at": "2019-10-04"}