{"pub": "cbs", "url": "https://cbsnews.com/news/what-is-treason-and-who-can-be-convicted-of-it", "downloaded_at": "2019-10-01 00:11:13.965393+00:00", "title": "What is treason and who can be convicted of it?", "language": "en", "text": "The impeachment inquiry against President Trump has now touched on a rare and widely misunderstood American crime: treason. Since Sunday, the president has said twice on Twitter that Representative Adam Schiff of California should be questioned and arrested for \"treason\" after Schiff, in a House hearing, rephrased Mr. Trump's remarks to Ukraine's president in their infamous phone call.\n\nThe president has previously tweeted treason accusations against others, including The New York Times and FBI agents.\n\nMeanwhile, treason also ties into an impeachment inquiry, since it's one of only two specific crimes for which a president can be impeached. The Constitution says the grounds for impeachment are \"Treason, Bribery, or other high Crimes and Misdemeanors.\"\n\nMr. Trump is facing an impeachment inquiry over a phone call where he asked the Ukrainian president to investigate the Biden family, which Democrats have called an attempted interference in the 2020 election. (House Democrats have not accused Mr. Trump of treason.)\n\nBut a look at the slim history of treason cases in U.S. history shows there's little chance Mr. Trump or Schiff — or anyone else in the federal government, for that matter — would ever face a treason charge. Their behavior does not fit the definition of treason — but also, treason cases have been nearly nonexistent in the U.S. for decades.\n\nTreason is the only crime that is explicitly defined in the U.S. Constitution, which describes it as when someone \"owing allegiance to the United States, levies war against them or adheres to their enemies, giving them aid and comfort within the United States or elsewhere.\"\n\nThe Constitution says that a person convicted of treason should \"suffer death,\" or be imprisoned for at least five years and fined at least $10,000, in addition to being banned from holding office. But it adds that no one can be convicted of treason \"unless on the testimony of two witnesses to the same overt act or on confession in open court.\"\n\nThis definition frames treason as a crime committed during war, making it distinct from seemingly similar charges such as conspiracy and espionage. The requirement for two witnesses or an open confession also makes it less likely that prosecutors would bring a treason charge.\n\nThere have been barely 30 treason cases in U.S. history. According to the National Constitution Center, most treason cases were associated with America's armed conflicts, such as the Whiskey Rebellion, the Civil War and the two World Wars.\n\nBut after World War II, treason essentially fell off the map. The last treason conviction in the U.S. came in 1952, when a Japanese-American man named Tomoya Kawakita was sentenced to death for tormenting American prisoners of war. But President Dwight Eisenhower commuted the sentence to life imprisonment and Kawakita was eventually released from prison and barred from the U.S.\n\nSince 1954, there has been only one treason case in the U.S. In 2006, a man named Adam Gadahn was indicted for treason for making propaganda videos for al-Qaeda. Federal prosecutors said Gadahn, who at the time was a fugitive living overseas, \"gave al-Qaeda aid and comfort... with intent to betray the United States.\" Gadahn was killed in an airstrike in Pakistan in 2015 and never faced trial for treason.\n\nA study from the Florida State University Law Review argued that treason charges fell out of favor after Congress created a new wave of federal crimes against the country following World War II. This allowed prosecutors to charge defendants for potentially treasonous behavior without being bound by the Constitution's requirements for treason convictions.\n\n\"As the number of federal statutes criminalizing conduct that could also be considered treasonous increased, it became less likely that a federal prosecutor would bring a charge of treason given the array of options now available,\" it said.", "description": "President Trump has accused several of his rivals, including a congressman, of \"treason\"", "authors": ["Jason Silverstein"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2018/04/03/e24f6fff-9ce4-4064-806e-85819a82323c/thumbnail/1200x630/ed290e7b1aa1a34566ba12b768b4c5eb/ap-18093449831162.jpg", "published_at": "2019-09-30"}