{"pub": "yahoo", "url": "https://sg.finance.yahoo.com/news/aar-air-upgraded-strong-buy-130001187.html", "downloaded_at": "2019-10-24 14:07:03.991016+00:00", "title": "AAR (AIR) Upgraded to Strong Buy: Here's Why", "language": "en", "text": "AAR (AIR) could be a solid addition to your portfolio given its recent upgrade to a Zacks Rank #1 (Strong Buy). An upward trend in earnings estimates -- one of the most powerful forces impacting stock prices -- has triggered this rating change.\n\nThe Zacks rating relies solely on a company's changing earnings picture. It tracks EPS estimates for the current and following years from the sell-side analysts covering the stock through a consensus measure -- the Zacks Consensus Estimate.\n\nSince a changing earnings picture is a powerful factor influencing near-term stock price movements, the Zacks rating system is very useful for individual investors. They may find it difficult to make decisions based on rating upgrades by Wall Street analysts, as these are mostly driven by subjective factors that are hard to see and measure in real time.\n\nTherefore, the Zacks rating upgrade for AAR basically reflects positivity about its earnings outlook that could translate into buying pressure and an increase in its stock price.\n\nMost Powerful Force Impacting Stock Prices\n\nThe change in a company's future earnings potential, as reflected in earnings estimate revisions, has proven to be strongly correlated with the near-term price movement of its stock. That's partly because of the influence of institutional investors that use earnings and earnings estimates for calculating the fair value of a company's shares. An increase or decrease in earnings estimates in their valuation models simply results in higher or lower fair value for a stock, and institutional investors typically buy or sell it. Their transaction of large amounts of shares then leads to price movement for the stock.\n\nFor AAR, rising earnings estimates and the consequent rating upgrade fundamentally mean an improvement in the company's underlying business. And investors' appreciation of this improving business trend should push the stock higher.\n\nHarnessing the Power of Earnings Estimate Revisions\n\nEmpirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock movements, so it could be truly rewarding if such revisions are tracked for making an investment decision. Here is where the tried-and-tested Zacks Rank stock-rating system plays an important role, as it effectively harnesses the power of earnings estimate revisions.\n\nThe Zacks Rank stock-rating system, which uses four factors related to earnings estimates to classify stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), has an impressive externally-audited track record, with Zacks Rank #1 stocks generating an average annual return of +25% since 1988. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here >>>>.\n\nEarnings Estimate Revisions for AAR\n\nThis airplane maintenance company is expected to earn $2.62 per share for the fiscal year ending May 2020, which represents a year-over-year change of 11%.\n\nAnalysts have been steadily raising their estimates for AAR. Over the past three months, the Zacks Consensus Estimate for the company has increased 1.4%.\n\nBottom Line\n\nUnlike the overly optimistic Wall Street analysts whose rating systems tend to be weighted toward favorable recommendations, the Zacks rating system maintains an equal proportion of 'buy' and 'sell' ratings for its entire universe of more than 4000 stocks at any point in time. Irrespective of market conditions, only the top 5% of the Zacks-covered stocks get a 'Strong Buy' rating and the next 15% get a 'Buy' rating. So, the placement of a stock in the top 20% of the Zacks-covered stocks indicates its superior earnings estimate revision feature, making it a solid candidate for producing market-beating returns in the near term.\n\nYou can learn more about the Zacks Rank here >>>\n\nThe upgrade of AAR to a Zacks Rank #1 positions it in the top 5% of the Zacks-covered stocks in terms of estimate revisions, implying that the stock might move higher in the near term.\n\n\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n\n\nAAR Corp. (AIR) : Free Stock Analysis Report\n\n\n\nTo read this article on Zacks.com click here.", "description": "AAR (AIR) has been upgraded to a Zacks Rank 1 (Strong Buy), reflecting growing optimism about the company's earnings prospects. This might drive the stock higher in the near term.", "authors": ["Zacks Equity Research"], "top_image": "https://s.yimg.com/uu/api/res/1.2/9AtPTGsv3rRwshs47Yg0wA--~B/aD01OTg7dz05MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/21b1f011539d3e31c28282071d344177", "published_at": "2019-10-24"}