{"pub": "hotair", "url": "https://hotair.com/archives/allahpundit/2019/09/30/grandparents-virginia-sixth-grader-three-white-classmates-didnt-assault-cut-hair", "downloaded_at": "2019-10-01 00:13:29.669954+00:00", "title": "Grandparents of Virginia sixth-grader: Her three white classmates didn’t assault her and cut her hair after all", "language": "en", "text": "“Why are we even hearing about this?” you’re asking. “How is this national news?”\n\nWell, the sort of progressive whom you would expect to go all-in on this story did in fact go all-in on this story:\n\nYou are beautiful, Amari Allen. You are courageous & strong. You are loved. You see, Amari, you may not feel it now, but you have a power that threatens their core. I can't wait to watch you use it and thrive. Stay strong. https://t.co/57rtAYby3h — Rashida Tlaib (@RashidaTlaib) September 28, 2019\n\nThe sheer age of the children involved also helped make it headline news for three minutes last week, before it was crowded out by the latest on impeachment. Racial hate crimes are abhorrent but racial hate crimes committed by pre-teens are “sign of the apocalypse” material, an irresistible peg for stories about America regressing on race relations.\n\nBut this story had an extra media-friendly angle. The school at which the alleged incident took place happens to be the school at which Mike Pence’s wife, Karen, teaches art part-time, a fact many reports made a point of noting even though it had nothing to do with the allegations. The implication was that Trump’s effect on racial harmony had supposedly been demonstrated in the most lurid way in the place where his own VP’s wife works.\n\nBut no, it hadn’t. The girl made it up.\n\nThe 12-year-old, who is African American, said three white boy students held her down in a school playground a week ago during recess, covered her mouth, called her insulting names and used scissors to cut her hair… “To those young boys and their parents, we sincerely apologize for the pain and anxiety these allegations have caused,” [her] grandparents wrote in a statement sent to The Washington Post by the school. “To the administrators and families of Immanuel Christian School, we are sorry for the damage this incident has done to trust within the school family and the undue scorn it has brought to the school. To the broader community, who rallied in such passionate support for our daughter, we apologize for betraying your trust.” “We understand there will be consequences and we’re prepared to take responsibility for them,” the statement continued. “We know that it will take time to heal, and we hope and pray that the boys, their families, the school and the broader community will be able to forgive us in time.”\n\nThat’s an admirably forthright apology, especially considering that her grandmother had called for the three boys to be expelled. And 12-year-olds deserve leeway to make mistakes, although … inventing a hate crime that involved the police and drew major media attention is a pretty big one. She was awfully convincing too, shedding tears for the cameras in a local news interview last week.\n\nTONIGHT AT 11: “One of them put my hands behind my back. One of them covered my mouth. They kept on laughing and calling me names,” said Amari who had her locs cut by bullies at a private #VA school. #Springfield I was heartbroken just listening to this. Smh. @wusa9 pic.twitter.com/B1DtIlHXDE — Mikea Turner (@MikeaTurnerTV) September 27, 2019\n\nHow’d they figure out she was lying? According to the local NBC affiliate, footage from security cameras at the school proved that she and the boys weren’t at the scene of the attack at the time the girl claimed it happened. She ‘fessed up and is now seeking counseling. One obvious question is what her motive was; the girl had claimed that the three boys bullied her repeatedly over the past month, calling her “ugly,” taking away her lunches, etc. Her family’s lawyer told NBC today that she still insists that she’s been bullied, just not to the point of anyone holding her down and cutting her hair. (The school had no record of her being bullied as of three days ago.) Did she invent the attack as revenge, or as a way to make the school’s staff pay closer attention to how other students were treating her?\n\nAnd how did the attack scenario occur to her? Did she read about an incident like that somewhere or fabricate the whole thing?\n\nAnyway, there’s a lesson here for the media but that lesson won’t be heeded so let’s not even bother.", "description": "Hoax.", "authors": ["Ed Morrissey", "John Sexton", "Jazz Shaw"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/m-6.jpg", "published_at": "2019-09-30"}