{"pub": "npr", "url": "https://npr.org/sections/goatsandsoda/2019/10/22/764764473/a-gambian-nurse-fights-pain-without-pills", "downloaded_at": "2019-10-23 17:15:34.702605+00:00", "title": "Fighting Pain Without Opioids: How One Nurse In The Gambia Does It", "language": "en", "text": "Fighting Pain Without Opioids: How One Nurse In The Gambia Does It\n\nEnlarge this image toggle caption Samantha Reinders for NPR Samantha Reinders for NPR\n\nGrowing up in the Gambia in West Africa, Nabia Drammeh always knew she wanted to be a nurse. \"My auntie was a nurse,\" she says. \"I used to go to the clinic and see the way she works. I told her, 'I really want to be a nurse in the future!' So I've loved this job since when I was a child.\"\n\nThe 27-year-old graduated from nursing school in 2012 and has been a nurse ever since.\n\nShe now works at the Brufut health clinic just outside the Gambian capital of Banjul.\n\nIt's a modest government clinic housed in a cluster of single-story cement buildings.\n\n\"The cases we see here are mostly malaria cases, pneumonia cases, ear problems,\" she says.\n\nDrammeh and her colleagues at the clinic also treat a lot of urinary tract infections. They stitch up cuts from minor car crashes. They deal with sick kids and fractures from farming accidents. One constant among most of the cases, Drammeh says, is pain.\n\n\"Eighty to 90 percent of patients that come here already have pain,\" she says. Patients arrive with back pain, muscle pain, stomach pain.\n\nIt's what drives people to her clinic. It's what most of her patients often want to talk about first.\n\n\"Most of the cases that come here are in pain either physically or psychologically,\" she says.\n\nSo you might think that Drammeh would want to dole out powerful opioid-based medications that have been shown to provide incredible reductions in pain. But she doesn't. And it's not just because she doesn't have any opioids.\n\n\"When taking care of the pain you don't only deal with drugs,\" Drammeh says with a hint of indignation. \"Drugs are last when it comes to nursing.\"\n\nThe Gambia is one of the poorest countries in the world. Even doctors at the main teaching hospital in Banjul, the capital, don't have regular access to opioids or other powerful pain meds. The leading pain medications in the Gambia are paracetamol and ibuprofen, generic versions of Tylenol and Advil.\n\nBut Drammeh says this lack of painkillers is not a problem. Her goal as a nurse isn't to exterminate that pain. The pain is a clue to help her find the real underlying problem.\n\nInstead of drugs Drammeh uses her \"nursing skills\" to address a patient's pain.\n\n\"First of all we have to receive the patient well,\" she says. \"Show the person that he or she is welcome [at the clinic].\"\n\nAnd then she lets them know that a solution to their pain exists. A burning urinary tract infection — there's medicine for that. A pounding headache? could be a sign of malaria and a dose of malaria pills will do the trick.\n\n\"You need to use your nursing skills to reassure the patient,\" she says. \"Show the patient that there is life ahead.\"\n\nJust convincing a patient that their particular health problem can be treated will cause their pain to go down, she says.\n\ntoggle caption Samantha Reinders for NPR\n\nBut first, Drammeh insists, you have to connect with the patient and win their trust.\n\n\"Tell the patient that this thing is normal, that we have many patients that come here with that problem or even more serious cases than that problem,\" she says. \"But they were treated and they've gone home.\"\n\nWhat she doesn't do is rush to quell the patient's pain with drugs.\n\nAnd it's not just her.\n\nEven at the maternity ward at this clinic, midwife Rohey Jallow says they don't give pregnant women any pharmaceutical pain relief during labor.\n\n\"It's not needed,\" Jallow says. \"Most of the time it's not needed here.\"\n\nLike Drammeh she also sees her role as comforting the patient, letting the woman know that pain is normal in childbirth and that she will get through it.\n\nShe reassures the moms that the baby will come eventually. \"Pain is part of it,\" she tells the women in labor. \"When there is no pain, the baby will not come.\" In many medical settings in the United States, clinicians start by trying to treat the pain. Jallow and Drammeh don't work that way. Drammeh explains how a woman had come in earlier in the day complaining of lower back pain. The patient seemed uncomfortable to be talking in the open courtyard.\n\n\"So I saw it in her that she could not express herself there,\" Drammeh says. \"So I told her, if you want I can take you privately so I can know what the problem really is.\" They slipped off to an empty part of the ward.\n\nIt turns out the woman with back pain also had hemorrhoids and had been constipated for weeks. Drammeh told the woman that she must deal with the constipation immediately. She advised her to add more fruit to her diet and gave her laxatives and some hemorrhoid cream.\n\n\"I made her understand that these are the medicines that can take care of you.\"\n\nBy using her nursing skills to address the underlying problem, she says, the woman's back pain will go away. \"It works. It's very effective,\" she declares. \"So that is the best way of managing pain.\"", "description": "As the U.S. grapples with the opioid crisis, pain medication is in short supply in some other parts of the world. One nurse in the Gambia explains how she addresses pain with tools other than drugs.", "authors": ["Jason Beaubien"], "top_image": "https://media.npr.org/assets/img/2019/09/26/gambia-nurse---pain-11_wide-6bb2fe6377171be2ca13d2f4dfb3a6f6bd5110e0.jpg?s=1400", "published_at": "2019-10-22"}