{"pub": "reuters", "url": "https://in.reuters.com/article/india-sensex-nifty-stocks/corrected-nifty-sensex-soar-5-as-government-cuts-taxes-to-prop-up-growth-idINKBN1W50C4", "downloaded_at": "2019-09-20 08:20:09.359406+00:00", "title": "Corrected: Nifty, Sensex soar 5% as government cuts taxes to prop up growth", "language": "en", "text": "(Corrects to 25.17% from 25.75% in second paragraph)\n\nA broker reacts while trading at his computer terminal at a stock brokerage firm in Mumbai, December 28, 2017. REUTERS/Danish Siddiqui/Files\n\nBy Chris Thomas\n\n(Reuters) - Indian shares surged over 5% on Friday and were set for their best day in more than a decade after the government announced deep cuts in corporate taxes to revive flagging growth in Asia’s third largest economy.\n\nFinance Minister Nirmala Sitharaman said the effective corporate tax rate would be lowered to 25.17% from 30% and scrapped the minimum alternative tax for domestic companies.\n\n“The reduction in corporate tax rate will “augur well for our economy,” Reserve Bank of India chief Shaktikanta Das said, speaking at a conference in Mumbai.\n\nThe broader NSE index jumped as much as 5.2% to 11,256.15, while the benchmark BSE index jumped 5.3% to 37,990.47.\n\nThe rupee INR=D4) rose as much as 0.9% to 70.68 against the dollar, its strongest level since Aug 9, while the yield on benchmark 10-year bond rose to 6.71% versus 6.57% in early trading.\n\nShares of top private-sector lender HDFC Bank Ltd, soared nearly 10% - their most in over six years, sending the Nifty Bank index up 6.7%.\n\n“The markets have been asking for a big fiscal stimulus and the government has delivered,” said Rusmik Oza, head of fundamental research at Kotak Securities in Mumbai.\n\nCorporate earnings may see an almost 12% jump in the next quarter for full tax paying companies due to the cut, and the markets can go up nearly 10%, Oza said, adding that foreign investors would cheer these measures.\n\nThe Nifty Auto index jumped 7.9%, its sharpest intraday climb since July 2011, with Eicher Motors Ltd surging 24%.", "description": "Indian shares surged over 5% on Friday and were set for their best day in more than a decade after the government announced deep cuts in corporate taxes to revive flagging growth in Asia's third largest economy.", "authors": ["Chris Thomas", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190920&t=2&i=1431860140&w=1200&r=LYNXMPEF8J09W", "published_at": "2019-09-20"}