{"pub": "thehill", "url": "https://thehill.com/policy/international/465550-trump-releases-50-million-to-protect-ethnic-and-religious-minorities-in", "downloaded_at": "2019-10-13 03:47:50.807192+00:00", "title": "Trump releases $50 million to protect ethnic and religious minorities in Syria", "language": "en", "text": "President Trump Donald John TrumpFederal prosecutors investigating Giuliani: report House Foreign Affairs Committee Chairman and top Republican to introduce sanctions bill against Turkey Trump lashes out at 2020 Dems, impeachment inquiry MORE on Saturday authorized the release of $50 million in emergency assistance to Syrian human rights groups and other organizations working to protect civilians in the war-torn country.\n\nA statement from the White House Saturday evening said the funds would \"provide emergency financial assistance to Syrian human rights defenders, civil society organizations, and reconciliation efforts directly supporting ethnic and religious minority victims of the conflict.\"\n\nADVERTISEMENT\n\n\"It will also go toward increased accountability, removal of explosive remnants of war, community security for stabilization assistance, documenting human rights abuses and international humanitarian law violations, and support for survivors of gender-based violence and torture,\" read the statement.\n\nTrump faced heavy criticism from lawmakers in both parties following his administration's announcement this week that it would withdraw troops from the northern region of Syria currently targeted by a Turkish military action aimed at Kurdish militant groups that aided the U.S. and coalition forces against the Islamic State (ISIS).\n\nBoth Republicans and Democrats accused Trump of allowing a U.S. ally to be attacked or even destroyed by a North American Treaty Organization (NATO) member, while Trump has attempted to deflect criticism by pointing to his campaign promise to withdraw the U.S. from so-called \"endless wars\" in the Middle East.\n\n\"Don’t forget they are fighting for their land. They haven’t helped us fighting for our land,\" Trump told the Values Voters Summit Saturday night. “Let them have their borders, but I don’t think our soldiers should be there for the next 15 years guarding a border between Turkey and Syria when we can’t guard our own borders.“", "description": "President Trump on Saturday authorized the release of $50 million in emergency assistance to Syrian human rights groups and other organizations working to protect civilians in the war-torn country.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_101019getty.jpg", "published_at": "2019-10-13"}