{"pub": "yahoo", "url": "https://news.yahoo.com/greta-thunberg-faces-down-trump-in-political-cartoon-140223663.html", "downloaded_at": "2019-09-26 15:10:27.883350+00:00", "title": "'Fearless girl' Greta Thunberg faces down Trump in new political cartoon", "language": "en", "text": "Greta Thunberg, the Swedish 16-year-old environmental activist, delivered an impassioned speech at the United Nations Climate Action Summit on Monday in New York City, cementing her status as the voice for young activists, as well as a role model for others with Asperger syndrome. However, it also made her a target for people who disagree with her beliefs.\n\nThunberg, who sailed to New York City from Sweden on a zero-emissions racing yacht, called out world leaders at the summit for stealing \"my dreams and my childhood with your empty words\" and for \"failing\" to protect the earth as entire ecosystems collapse due to climate change.\n\nOn the same day of her speech, Trump retweeted a video of Thunberg’s speech, writing, \"She seems like a very happy young girl looking forward to a bright and wonderful future. So nice to see!\"\n\nShe seems like a very happy young girl looking forward to a bright and wonderful future. So nice to see! https://t.co/1tQG6QcVKO — Donald J. Trump (@realDonaldTrump) September 24, 2019\n\nWhile not directly mentioning Trump, Thunberg changed her Twitter bio on Tuesday to incorporate his comments: \"A very happy young girl looking forward to a bright and wonderful future.\" It has since been changed back to: \"16 year old climate and environmental activist with Asperger’s.”\n\nJ.D. Crowe, a political cartoonist, published a cartoon on AL.com on Wednesday featuring Thunberg posing as the \"Fearless Girl\" statue, facing off against President Trump, depicted as the “Charging Bull,” or “Wall Street Bull.”\n\n“Fearless Girl,” a sculpture by Kristen Visbal, was installed in 2017 directly opposite the Charging Bull for International Women's Day in New York City. The plaque at the “Fearless Girl” sculpture, which has since been moved to stand in front of the New York Stock Exchange, reads \"Know the power of women in leadership. SHE makes a difference.\"\n\nThe reactions to Crowe's cartoon were mixed.\n\n\"Some of y'all must have been very different from me at 16. I was not ignorant of ecological matters, nor was I easily led. Neither is Greta. God bless her!\" one person wrote.\n\n\"Oh please, just sit down. Help your mom clean house,\" one commented.\n\n\"Indeed, she is not a scientist. But we adults are ignoring the real scientists anyway, and to our own peril,\" another shared.\n\nMany commenters went further to mock the activist, stating she was either coached on what to say, or theorized she was older than she stated and a paid actor. Some were quick to dismiss her, much like conservative commentator Michael Knowles, who called Thunberg a \"mentally ill Swedish child” during his Monday night appearance on Fox News.\n\nOn Wednesday, Thunberg took to Twitter to address the \"haters.\"\n\nHere we go again...\n\nAs you may have noticed, the haters are as active as ever - going after me, my looks, my clothes, my behaviour and my differences.\n\nThey come up with every thinkable lie and conspiracy theory. (Thread->) pic.twitter.com/5rS2VpZj00 — Greta Thunberg (@GretaThunberg) September 25, 2019\n\n\"As you may have noticed, the haters are as active as ever - going after me, my looks, my clothes, my behaviour and my differences. They come up with every thinkable lie and conspiracy theory,\" Thunberg tweeted.\n\n\"It seems they will cross every possible line to avert the focus, since they are so desperate not to talk about the climate and ecological crisis. Being different is not an illness and the current, best available science is not opinions - it’s facts,\" she added. \"I honestly don’t understand why adults would choose to spend their time mocking and threatening teenagers and children for promoting science, when they could do something good instead. I guess they must simply feel so threatened by us.\"\n\nI honestly don’t understand why adults would choose to spend their time mocking and threatening teenagers and children for promoting science, when they could do something good instead. I guess they must simply feel so threatened by us. -> — Greta Thunberg (@GretaThunberg) September 25, 2019\n\nShe suggests not giving such commenters attention.", "description": "A political cartoonist in Alabama depicted the environmental activist facing down President Donald Trump as the \"Charging Bull.\"", "authors": ["Hope Schreiber"], "top_image": "https://s.yimg.com/uu/api/res/1.2/4Y_B4GgwdrZkrJPYXLoZ9Q--~B/aD01NDA7dz05NjA7c209MTthcHBpZD15dGFjaHlvbg--/http://d.yimg.com/hd/cp-video-transcode/prod/2019-09/25/5d8ba822ee664c43a152c6a3/5d8ba822ee664c43a152c6a4_o_U_v2.jpg", "published_at": "2019-09-26"}