{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-netherlands-family/dutch-psychologists-helping-probe-over-family-found-locked-away-in-room-idUKKBN1WX1EU", "downloaded_at": "2019-10-18 11:49:55.203400+00:00", "title": "Dutch psychologists helping probe over family found locked away in room", "language": "en", "text": "FILE PHOTO: A general view of a remote farm where a family spent years locked away in a cellar, according to Dutch broadcasters' reports, in Ruinerwold, Netherlands October 16, 2019. REUTERS/Eva Plevier\n\nAMSTERDAM (Reuters) - Dutch police called in psychologists to help them get to the bottom of what happened to a family found locked away in a farmhouse room where they appeared to have lived in seclusion for years.\n\nPolice discovered six people, who claimed to be five siblings and their ailing father, at the farm in the north of the Netherlands on Monday after a tip from a man believed to be a brother who said he had escaped.\n\nPolice detained the 67-year-old man believed to be the father of the family on Thursday on charges of unlawful detention, a form of abuse and money laundering. The last charge related to a cache of cash discovered at the farm.\n\nOn Tuesday, a 58-year-old man who paid the rent on the farmhouse was taken into custody on similar charges.\n\n“We have called in specialised help,” police spokesman Anthony Hogeveen said on Friday, adding that more than four days after the discovery of the family, investigators were still in the dark about how the family ended up in the room.\n\n“This is an extraordinary situation. With a team of psychologists we are trying to understand what we see,” police chief Janny Knol said in a Dutch television interview.\n\nPolice said the children were never registered at birth and had never gone to school, both of which are required by law in the Netherlands. “Basically we know nothing of them,” Knol said.\n\nThe six people found in the locked room have been moved to accommodation in a holiday park.", "description": "Dutch police called in psychologists to help them get to the bottom of what happened to a family found locked away in a farmhouse room where they appeared to have lived in seclusion for years.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191018&t=2&i=1442272640&w=1200&r=LYNXMPEF9H15X", "published_at": "2019-10-18"}