{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/drayton-manor-prosecuted-over-death-20644343", "downloaded_at": "2019-10-18 01:07:33.780088+00:00", "title": "Drayton Manor to be prosecuted over death of girl, 11, who fell from water ride", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA popular theme park is to be prosecuted following the death of a young schoolgirl on one of its rides.\n\nEvha Jannath, 11, died after plunging from the Splash Canyon Rapids ride while on a trip to Drayton Manor in May 2017.\n\nShe was airlifted to hospital following the incident at the Staffordshire park but could not be saved by medics.\n\nEvha was on an organised trip with teachers and classmates from the fee-paying Jame’ah Girls Academy in Leicester.\n\nDrayton Manor was closed for several days after the tragedy as the Health and Safety Executive inspected the ride.\n\n(Image: SWNS.com)\n\n(Image: PA)\n\nA post-mortem revealed the schoolgirl, from Belgrave, Leicester, died from blunt force chest trauma and drowning.\n\nIn March police said the circumstances of Eva’s death did not meet the threshold for gross negligence or corporate manslaughter.\n\nThey closed their 22-month probe but formally handed the investigation over to the Health and Safety Executive.\n\nThe HSE announced today that theme park operator Drayton Manor Park Ltd is to be prosecuted.\n\n(Image: Tom Maddick / SWNS.com)\n\n(Image: SWNS.com)\n\nIt will face a charge under Section 3 of the Health and Safety at Work Act once an inquest into Evha’s death is completed.\n\nShe was on a raft with four classmates, while several teachers were on one behind, when the accident happened.\n\nAccording to the brother of a girl in the same raft as her, she vanished “in an instant” after standing up to move seats.\n\nHe also claimed park staff initially did not believe her horrified friends when they tried to raise the alarm.\n\n(Image: SWNS.com)\n\n(Image: Tom Maddick / SWNS.com)\n\n(Image: SWNS.com)\n\nEvha's father Muhammed Suable Islam said after her death: “I have no tears left in my eyes because I have cried so much.”\n\nThe Splash Canyon Rapids ride has remained closed since the tragedy.\n\nAn inquest into Evha's death takes place in November.\n\nA spokesperson from Drayton Manor Park, said: “It would not be appropriate for us to comment until the inquest concludes.”", "description": "Evha Jannath died after falling from the Splash Canyon Rapids ride at Drayton Manor in Staffordshire in 2017", "authors": ["Image", "Pa", "Swns.Com", "Tom Maddick"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20644359.ece/ALTERNATES/s1200/0_Drayton-Manor-Theme-Park-incident.jpg", "published_at": "2019-10-17"}