{"pub": "guardian", "url": "https://theguardian.com/football/blog/2019/sep/29/ole-gunnar-solskjaer-manchester-united-sacking-not-stop-rot", "downloaded_at": "2019-09-29 07:54:23.518948+00:00", "title": "Ditching Ole Gunnar Solskjær will not stop the rot at Manchester United | Jonathan Wilson", "language": "en", "text": "All in all, it’s been an excellent week for Manchester United. There was progress in the Carabao Cup and the announcement of record revenues of £627.1m. What more could anybody want?\n\nExcellent, that is, as long as you don’t worry about details such as the limp 2-0 defeat at West Ham last Sunday. Or that the weekend kicked off with United eighth in the Premier League table. Or that a club with a proud cavalier tradition have scored just 18 goals in their last 20 games. Or that the one outfielder of undoubted outstanding quality spent the summer trying to leave. Or that Old Trafford, essentially undeveloped in more than two decades, has an entirely appropriate air of shabbiness. Or that this is, relative to the rest of the league, the worst Manchester United squad in at least 30 years. Or that the share price has fallen 36% since its peak at the end of August last year.\n\nIt is that last detail that might prompt the most concern in the United boardroom. Revenues may be at record levels but last week United announced a fourth-quarter loss of £22.2m. Failure to qualify for the Champions League this season will make that hard to recover, particularly if United do not finish in the top four again this season.\n\nFacebook Twitter Pinterest Manchester United team line-ups from 1999, 2004, 2009, 2014 and 2019. Photograph: No Credit\n\nOn-pitch underperformance is finally beginning to hit the bottom line. The problem now is the rot runs so deep it is in danger of toxifying everything. It’s easy to say that Alexis Sánchez was past it when he arrived at United, but Fred wasn’t. Éric Bailly wasn’t. Henrikh Mkhitaryan wasn’t. United have become a club that drag players down.\n\nThen there are those who once bristled with promise and then stagnated: Adnan Januzaj, Luke Shaw, Phil Jones, Anthony Martial and Jesse Lingard. The danger of that pattern continuing seems all the more acute now United have switched to signing youth.\n\nDaniel James has had a very good start to his United career. He has scored three goals, all of them of supreme quality. He is undoubtedly a player of great potential. But he is 21, came into the Swansea side only last season and had never played a Premier League game before August. He is somebody to be bedded in slowly, to be given time to develop. He should not be United’s main creative threat and it’s unfair to saddle him with that burden.\n\nIt’s true in part that James has been thrust front and centre by injuries but that itself only raises further questions. How have United ended up with a squad so imbalanced that a couple of absentees can have such a profound impact? And just why have United already suffered so many noncontact injuries this season? Bad luck can happen, of course, but you don’t have to be Twitter’s Dutch fitness maven Raymond Verheijen to wonder whether Ole Gunnar Solskjær’s summer of sweat may have been counterproductive.\n\nThe squad Solskjær inherited from José Mourinho ran less on average than any other in the Premier League. That’s not necessarily to say it was unfit, more that Mourinho’s aversion to pressing meant running was far less important to his side than it is for many others.\n\nSolskjær then tried to implement a running game and for almost three glorious months it worked, bringing 14 wins in 17 games. Then fatigue set in, injuries mounted and United won just two of their last 12 games of last season. The 3-1 victory at Paris Saint-Germain in the Champions League now represents a cliff edge.\n\nThat’s the generous explanation, and it was one the club were keen to push through summer tours, in which all anybody seemed to talk about was how hard they were working. There is probably some truth to that theory but, as with everything else at United these days, it raises more questions than it answers.\n\nFirst, the issue of why the injuries have recurred. Perhaps United overdid it in the summer or, as was suggested last week, day-to-day training is in some way flawed. It may simply be misfortune but the point is wider than the injuries: there can be no confidence now in United’s structures. There was much sneering when Manchester City, on dismissing Roberto Mancini in 2013, spoke of the need for a “holistic” approach, but United now is what happens when there is nothing holistic about a club beyond the general atmosphere of decline. What does it say about planning at the club if they replace one manager with another whose style is so different that players get injured trying to keep up?\n\nFacebook Twitter Pinterest Paul Pogba, Manchester United’s one outfield player of outstanding quality, spent the summer trying to leave. Photograph: Martin Rickett/PA\n\nIn that sense, Solskjær can be portrayed as a patsy. It increasingly appears that his early success lay less in his being Solskjær than in his being not‑Mourinho, while his appointment was characteristic of a leadership that blows with the wind, pursuing short-term popularity without any grand plan. But it may be that a squad this piecemeal, patched together from the remnants of four very different managers’ inclinations under a board that has demonstrated little in the way of football expertise, makes the act of management almost impossible.\n\n‘I never said it was going be easy’: Ole Gunnar Solskjær is staying positive Read more\n\nEd Woodward, United’s executive vice-chairman, has insisted patience will be shown towards Solskjær. That makes sense in as much as the manager doesn’t seem the biggest problem at the club. Paul Scholes has suggested that it will take “four or five” transfer windows to make United competitive again, but why would a leadership that has presided over such decay for the past six years suddenly be able to put it right in two?\n\nAt the investors’ conference call this past week, shareholders raised only two questions with the CEO: about how the loan system works and about expansion in China, where the club’s app is now producing country-specific content. As an indication of the lack of football expertise and where the club’s priorities lie, it was exemplary. But this cannot endure.\n\nProlonged exile from the Champions League will surely dull the lustre even of Manchester United. All those noodle partners and official lubricants presumably didn’t sign up to be associated with scraps for Europa League qualification.\n\nFor Woodward and United, far more serious questions are coming.", "description": "By now the malaise at Old Trafford has deep roots stretching back several years and several managers – only equally deep systemic change will put it right", "authors": ["Jonathan Wilson"], "top_image": "https://i.guim.co.uk/img/media/b0d7cda24d86e8494a3cdae35596e0c8e3ff9ffc/0_25_2770_1662/master/2770.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tb3BpbmlvbnMucG5n&enable=upscale&s=47ec99c96c1fa33c247cfb7d8bf47764", "published_at": "2019-09-29"}