{"pub": "townhall", "url": "https://townhall.com/columnists/larryelder/2019/09/19/kirk-the-best-brother-ever-rip-n2553341", "downloaded_at": "2019-09-19 06:01:31.624411+00:00", "title": "Kirk, the Best Brother Ever, R.I.P.", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nMy brother, Kirk Randolph Elder, died suddenly and unexpectedly, 16 days before his 70th birthday. He and Tresta, his wife of 41 years, had planned a trip to Hawaii, where they were going to celebrate Kirk's birthday.\n\nKirk was a retired supervisor at an oil refinery, and we were extremely close. He started coming on my radio show about four years ago, reluctantly at first. We'd discuss politics, culture and sports. A registered Democrat, he and I often disagreed. Yet, week after week, I received letters from listeners who called him their \"favorite Democrat.\" Kirk always showed respect for Republicans -- and, yes, even Trump supporters -- with whom he differed on policy but whose motives he never maligned.\n\nA Vietnam-era vet, Kirk enlisted in the Navy. A few years ago, I introduced Kirk to Joseph, a Marine vet who served in Iraq and is now a cop with the Los Angeles Police Department. Hearing of Kirk's death, Joseph wrote: \"Kirk enlisted when enlisting was not popular. Your brother was a petty officer third class, E-4, the equivalent rank of a corporal noncommissioned officer in the Marine Corps. That's the rank I achieved, but he did it in a shorter period of time. It's the first enlisted rank of command and control of others. To achieve this rank in the Navy, he had to be a leader. He also received a National Defense Service Medal.\"\n\nKirk had four children, two sons and two daughters, and loved -- truly loved -- being a father. He had no enemies. Everyone liked him.\n\nOn the radio, he often talked about his \"favorite watering hole\" and his discussions, mostly sports, with its \"regulars.\" After he died, I asked Tresta for the name and location of that bar. I went there. I walked up to some men sitting at the bar, asked if they knew Kirk and introduced myself as his brother. Within minutes, I was surrounded by people who offered their condolences and told story after story about their fun battles with Kirk over his support for the Los Angeles Raiders. They told me of his kindness and generosity and how he bought birthday and Christmas presents for the bar staff.\n\nGrowing up, I had friends who had older brothers and complained that they bullied them. Kirk, though big and strong, never bullied Dennis and me, something I didn't truly appreciate until I was much older. Because of his gentleness, I thought of him as soft -- until he beat the crap out of the neighborhood bully who'd started a fight. Who knew Kirk had that in him? About the vanquished tough guy, my mother said, \"He picked on the wrong kid.\"\n\nKirk dragged my little brother and me to every Elvis Presley movie, including the bad ones, and a lot were bad. Because Kirk was the oldest, my parents gave him the movie and popcorn money along with permission to choose the movie. So off to the latest Elvis movie we went. Kirk embraced Muhammad Ali, then called Cassius Clay. Our boxing-savvy father dismissed the \"Louisville Lip\" as an upstart loudmouth and predicted Clay's \"destruction\" in the upcoming fight with the heavyweight champ, the seemingly invincible Sonny Liston. Liston lost. Kirk crowed.\n\nWe played Little League hardball but on opposing teams. A pitcher, Kirk mowed me down in our little backyard and in the streets where we played. But in the two times our Little League teams squared off with him pitching, I managed to hit two triples, two doubles and three singles. He denied \"easing up\" on me, but to this day I wonder.\n\nA few years before my father died, I visited Dad, finding him in the garage \"throwing out old stuff.\" Thank goodness I stopped Dad before he threw out \"some old letter\" he'd written. Dad, for whatever reason, felt he would die at age 36. So he wrote Kirk, then 2 years old, this letter of advice and guidance:\n\nMay 4, 1951\n\nKirk, my Son, you are now starting out in life -- a life that Mother and I cannot live for you.\n\nSo as you journey through life, remember it's yours, so make it a good one. Always try to cheer up the other fellow.\n\nLearn to think straight, analyze things, be sure you have all the facts before concluding and always spend less than you earn.\n\nMake friends, work hard and play hard. Most important of all, remember this: The best of friends wear out if you use them.\n\nThis may sound silly, Son, but no matter where you are on the 29th of September (Kirk's birthday), see that Mother gets a little gift, if possible, along with a big kiss and a broad smile.\n\nWhen you are out on your own, listen and take advice but do your own thinking and concluding, set up a reasonable goal and then be determined to reach it. You can and will. It's up to you, Son.\n\nYour Father,\n\nRandolph Elder\n\nR.I.P. Kirk Randolph Elder.\n\nLarry Elder is a bestselling author and nationally syndicated radio talk show host. To find out more about Larry Elder, or become an \"Elderado,\" visit www.LarryElder.com. Follow Larry on Twitter @LarryElder. To read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate website at www.creators.com.", "description": "My brother, Kirk Randolph Elder, died suddenly and unexpectedly, 16 .09/19/2019 1:58:46AM EST.", "authors": ["Larry Elder", "Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/261/8df6bf3e-f699-492b-b23d-3bf8781ea3dd.png", "published_at": "2019-09-19"}