{"pub": "zdnet", "url": "https://www.zdnet.com/article/cannabis-on-a-blockchain-security-matters-files-patent-for-plant-tracking", "downloaded_at": "2019-09-03 23:44:11.398565+00:00", "title": "Cannabis on a blockchain: Security Matters files patent for plant tracking", "language": "en", "published_at": "2019-09-03", "text": "Supply chain-focused blockchain technology company Security Matters has lodged a patent application in the United States pertaining to materials and methods used in the marking, classification, and identification of seeds and plants.\n\nexecutive guide Marijuana means business Everything you need to know about the cannabis industry. Read More\n\nThe Australian Securities Exchange (ASX)-listed company said its patent can be applied to mark, track, and manage the supply chain of cannabis plants, cannabis products, and products containing cannabis derived ingredients.\n\nSecurity Matters said the patent covers the use of its own chemical solution for marking plants that can be completed during any of the six stages of plant growth and cultivation, as well as directly to the seed prior to planting.\n\nSee also: Cannabis authentication system roots out counterfeit weed\n\nSecurity Matters has commenced the commercialisation of its technology that uses a hidden chemical-based \"barcode\" to permanently \"mark\" any object -- solid, liquid, or gas.\n\nThe barcode is read by accessing the corresponding stored data, which is recorded and protected using blockchain technology.\n\n\"The marking solution can be applied to the seed or plant via a coating, irrigation, and fertilisation method and is used for product authentication, supervision and supply chain management of the plant and plant by-products,\" the company said in a statement issued to the ASX on Monday.\n\nAccording to CEO and founder Haggai Alon, the two key considerations for any cannabis company are the ability to trace its origin and to control and monitor its content to establish in which application the final product will be used.\n\nSee also: Marijuana means business: Everything you need to know about the cannabis industry [PDF download] (TechRepublic)\n\n\"SMX's technology has the ability to do this and can ensure both needs are met without the requirement for complex genetic modification or negative impact to the cannabis seed, plants, or plant products,\" Alon said.\n\n\"This patent application supports SMX's business model, to partner with global leading companies, and indicates our ability to create a digital twin from raw material to finished product.\"\n\nThe company said lodging the patent secures its technology and provides a platform to advance and expand operations within the agricultural and cannabis sectors, \"providing an end-to-end security and transparency solution with information kept securely on the blockchain for customers\".\n\nWhile Security Matters is headquartered in Ketura, Israel, and trades publicly down under, the consumption of cannabis is currently illegal, except for medicinal use, in Australia.\n\nRELATED COVERAGE", "description": "In particular, the solution can be applied to mark, track, and manage the supply chain of cannabis plants, cannabis products, and products containing cannabis derived ingredients.", "authors": ["Asha Barbaschow"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2014/10/04/852a1d01-4b5e-11e4-b6a0-d4ae52e95e57/thumbnail/770x578/a631d4ec577e29491e8a9a9976d78517/marijuana.jpg"}