{"pub": "townhall", "url": "https://townhall.com/tipsheet/timothymeads/2019/09/06/black-unemployment-rate-hits-record-low-n2552729", "downloaded_at": "2019-09-07 02:14:56.491529+00:00", "title": "Black Unemployment Rate Hits Record Low", "language": "en", "text": "Let's keep the MAGA train rolling, folks. After the great news that the Fed is not predicting a recession anytime soon, the latest jobs numbers also indicate that black unemployment is the lowest its ever been in the United States since the government began tracking this figure.\n\nThe Bureau of Labor Statistics reported Friday that black unemployment fell to 5.5% in August.\n\nAs Richard Walters of the GOP said, \"New jobs report shows higher wages, higher labor participation rate, and lowest black unemployment ever on record. @realDonaldTrump continues to deliver for all Americans on the economy!\"\n\nNew jobs report shows higher wages, higher labor participation rate, and lowest black unemployment ever on record.@realDonaldTrump continues to deliver for all Americans on the economy! https://t.co/KMP375AbA6 — Richard Walters (@rww_gop) September 6, 2019\n\nEven CNN admitted this was good news. Here's part of the breakdown they gave:\n\nThe previous record low of 5.9% was set in May 2018. The unemployment rate for black women fell to a record 4.4% from 5.2% in July. The unemployment rate for black men crept up to 5.9% from 5.8%. But the previous month's rate was a record, so the rate is still near its historic low. Unemployment among workers who identify themselves as Hispanic or Latino also fell in August to 4.2%, which matched a record low set earlier this year.\n\nResponding to this news, the president on Twitter said, \"The Economy is great. The only thing adding to 'uncertainty' is the Fake News!\"", "description": ".09/06/2019 22:12:15PM EST.", "authors": ["Timothy Meads", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/214/8f34ffd7-7efd-4c72-aa91-376cff220e51.png", "published_at": "2019-09-06"}