{"pub": "thehill", "url": "https://thehill.com/homenews/administration/466210-trump-turns-pelosis-meltdown-criticism-around-she-is-a-very-sick", "downloaded_at": "2019-10-17 01:48:30.673645+00:00", "title": "Trump turns Pelosi's 'meltdown' criticism around: 'She is a very sick person'", "language": "en", "text": "President Trump Donald John TrumpWarren defends, Buttigieg attacks in debate that shrank the field Five takeaways from the Democratic debate in Ohio Democrats debate in Ohio: Who came out on top? MORE on Wednesday blasted Speaker Nancy Pelosi Nancy PelosiTrump-GOP tensions over Syria show signs of easing Democratic debate starts with immediate question on Trump impeachment White House, Pentagon, Giuliani reject House subpoenas MORE (D-Calif.) following a heated meeting at the White House, questioning her mental fitness and commitment to the country.\n\n\"Nancy Pelosi needs help fast! There is either something wrong with her 'upstairs,' or she just plain doesn’t like our great Country,\" Trump tweeted.\n\n\"She had a total meltdown in the White House today,\" he continued. \"It was very sad to watch. Pray for her, she is a very sick person!\"\n\nNancy Pelosi needs help fast! There is either something wrong with her “upstairs,” or she just plain doesn’t like our great Country. She had a total meltdown in the White House today. It was very sad to watch. Pray for her, she is a very sick person! — Donald J. Trump (@realDonaldTrump) October 17, 2019\n\nADVERTISEMENT\n\nPelosi's office did not immediately respond to a request for comment.\n\nTrump's attack on the Speaker closely mirrored her own criticism of the president shortly after the White House meeting disbanded.\n\n\"I pray for the president all the time and I tell him that. I pray for his safety and that of his family,\" Pelosi said at the Capitol. \"Now we have to pray for his health, because this was a very serious meltdown on the part of the president.\"\n\nThe president chided Pelosi on Twitter earlier Wednesday evening by sharing photos that he claimed showed her having an \"unhinged meltdown.\" But the idea did not have the desired effect, and Pelosi made the image of her standing up and confronting the president her cover image on Twitter.\n\nTrump's tweets came as he sought to recast the narrative surrounding Wednesday afternoon's meeting with Democrats and Republicans at the White House. The barbs also underscored the deteriorating state of Trump's relationship with Pelosi as he faces an impeachment inquiry led by House Democrats.\n\nThe White House meeting was intended to focus on the response to Turkey as it carries out an offensive in northern Syria that has led to bloodshed and uncertainty in the region. Trump has dug in on his decision earlier this month to pull U.S. troops out of northern Syria even as lawmakers in both parties have warned him of the consequences of the move.\n\nBut the gathering quickly devolved into a war of words. Democrats said Trump called Pelosi a \"third-rate politician\" and claimed he hated ISIS more than her. The president called former Defense Secretary James Mattis James Norman MattisUS leaves dozens of 'high value' ISIS detainees behind amid Syria retreat: report White House officials stand by Syria withdrawal, sanctions delay amid bipartisan pushback Sunday shows — Officials rush to Trump's defense on Syria, sanctions MORE \"overrated\" and did not appear to have a plan to contain ISIS, Democratic aides said.\n\nJust prior to the meeting, the House passed a resolution in a 354-60 vote that rebuked Trump’s decision to retreat from Syria.\n\nWhite House press secretary Stephanie Grisham Stephanie GrishamSenate Dem to offer bill making threats, attacks against news media a federal crime CNN host says she takes Trump supporter's violent video 'personally' White House condemns violent video MORE defended Trump's conduct as \"measured, factual and decisive,\" and called Pelosi's decision to walk out \"baffling, but not surprising.\"\n\n\"While Democratic leadership chose to storm out and get in front of the cameras to whine, everyone else in the meeting chose to stay in the room and work on behalf of this country,\" Grisham said in a statement.", "description": "President Trump on Wednesday blasted Speaker Nancy Pelosi (D-Calif.) following a heated meeting at the White House, questioning her mental fitness and commitment to the country.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_pelosinancy_091817gn_lead.jpg", "published_at": "2019-10-17"}