{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7572091/Video-footage-shows-Bachelor-shooting-date-multiple-times.html", "downloaded_at": "2019-10-14 23:25:28.423839+00:00", "title": "Video footage shows The Bachelor shooting a date multiple times", "language": "en", "text": "It should come as no surprise that ABC's The Bachelor has scripted moments throughout the show as contestants search for true love.\n\nBut behind-the-scenes footage shared by Reality Steve, a blogger dedicated to sharing inside looks and spoilers about reality shows, showed how unromantic dates can be after Bachelor Peter Weber, 28, and his date were forced to do multiple takes when leaving a location.\n\nPeter started filming his season of The Bachelor, airing in January, last month and was on a date with Kelsey Weier, 28, in Cleveland, Ohio, when the behind-the-scenes footage was filmed by onlookers.\n\nTime for love: The Bachelor started filming its upcoming season last month with Peter Weber\n\nTake one: Peter, 28, was spotted at a bowling alley in Cleveland, Ohio, on a date with a woman named Kelsey Weier when onlookers caught footage of them leaving\n\nTake two: He and his date Kelsey Weier, were filmed multiple leaving the bowling alley because producers kept making them reshoot the shot\n\nThere were three shots in total shared on the Reality Steve Twitter page to show the different takes Peter and his date Kelsey Weier had to go through to satisfy the cameras.\n\nIn each of the shots, Peter draped his arm over Kelsey's shoulders as they walked out of the bowling alley.\n\nThey appeared to partake in normal conversation during the walk until they boarded a trolley waiting for them to take the couple to another location.\n\nAny romance potentially blooming between the couple was lost as they were surrounded by fans and onlookers watching the multiple takes of Peter and Kelsey walking out of the bowling alley.\n\nIt was also made more awkward after producers would pull Peter away from his date to then discuss with him ways to improve for the following take.\n\n(VIDEO): Peter and Kelsey leaving Corner Alley and getting on the trolley pic.twitter.com/TW5q28CyuK — RealitySteve (@RealitySteve) October 4, 2019\n\n(VIDEO): Oh wait, they needed to do multiple takes on them walking out... pic.twitter.com/AcHjrRx55M — RealitySteve (@RealitySteve) October 4, 2019\n\nStill filming: Multiple videos showed the awkwardness of the one-on-one date because Peter and Kelsey had to keep shooting one particular moment\n\nCut! One man appeared to get in a way of the filming during one video, forcing the couple to film the shot again\n\nThis behind-the-scenes footage was shocking to some fans, who had know idea just how produced the reality show was before seeing the video.\n\n'Ugh just shows how produced this is,' one commenter wrote.\n\nAnother person wanted to understand how someone could genuinely find love in the overly produced environment of the reality show.\n\n'Do they actually get to enjoy each other's company, or is it all \"getting the right shot\"? How can you even form a connection with someone with you can't even get to know them because you're always making the shots \"correct\",' the person questioned.\n\nAnother person wrote: 'That’s pathetic that they even need to stage ppl walking out naturally. Someone needs to write a book about everything else going on behind the scenes.'\n\nLooking for love: Peter was on the date with Kelsey (right). He started filming his season last month, which will air in January\n\nThe release of this footage comes as it was revealed last week that Peter was taken to the hospital in Costa Rica after suffering an injury that resulted in 22 stitches on the man's head.\n\nHe was reportedly carrying two cocktail glasses when he had a 'freak accident' and fell, Radar Online first reported.\n\n'Peter suffered a freak accident. He got a cut on his head, he did get stitches but he’s 100 per cent OK and production is already back underway,' franchise host Chris Harrison said in a statement to The Hollywood Reporter.\n\n'He’s still the dashing, handsome pilot we’ve all dreamed of.'\n\nPeter continued filming with stitches in his head for the last week, all of which viewers will probably get to see once the season airs in January.", "description": "The Bachelor started filming its upcoming season last month with Peter Weber. Peter, 28, was spotted at a bowling alley in Cleveland, Ohio, on a date.", "authors": ["Danielle Zoellner For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/18/19703626-0-image-a-68_1571075223953.jpg", "published_at": "2019-10-14"}