{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/18/caffe-greco-rome-oldest-cafe-fears-closure", "downloaded_at": "2019-10-18 11:39:39.072855+00:00", "title": "'The most important people have been here': Rome's oldest cafe fears closure", "language": "en", "text": "Caffè Greco has welcomed patrons from Charles Dickens to Princess Diana – but a rent hike is forcing the management company out\n\nStellario Baccellieri has been Caffè Greco’s artist in residence for more than 40 years, capturing the conviviality of Rome’s oldest coffee bar on canvas every day and painting the portraits of its illustrious patrons.\n\n“I’ve seen everything and everyone,” he said on a recent visit by the Guardian, as he pointed towards a closed-off area where the Italian capital’s cultural and political elite would meet to debate in bygone times. “The most important people have been here … this place is not only a bar, it’s a museum.”\n\nBaccellieri’s role and the fate of Caffè Greco, which opened in 1760 on the Via Condotti, close to the Spanish Steps, now hang in the balance as a date looms for the bar’s management company, Antico Caffè Greco, to leave the property.\n\nFacebook Twitter Pinterest Stellario Baccellieri in Caffè Greco. Photograph: Angela Giuffrida\n\nEveryone from Charles Dickens, Henry James, Orson Welles and John Keats, who lived a stone’s throw away, to Audrey Hepburn, Sophia Lauren, Elizabeth Taylor and Princess Diana have passed through its doors. Memorabilia attests to the day in 1890 when Buffalo Bill swung by for coffee with a group of cowboys. Three hundred works of art hang on the bar’s burgundy walls.\n\nCaffè Greco has weathered wars and countless political and economic upheavals, but a bitter financial dispute is testing its resilience. The issue began in September 2017, when Antico Caffè Greco’s lease expired and the property’s owner, the Israelite Hospital – a privately-run hospital that operates within Italy’s public health system – wanted to raise the monthly rent from €18,000 to €120,000. A legal battle ensued and a judge eventually ruled that the management firm must vacate the property next Tuesday.\n\n“The sentence is incomprehensible and the rent hike extortionate,” said Carlo Pellegrini, the owner of Antico Caffè Greco. “We would be ready to pay more rent to keep the cafe open but not six times the amount we’re paying now. I feel very angry, but we will fight this.”\n\nItalia Nostra, a heritage group, has joined the battle for the bar’s survival, organising a series of cultural events in the days leading up to the potential closure.\n\n“The idea of Caffé Greco disappearing off the face of the Earth, from the memory of Rome residents and tourists who make a point of having a coffee there, is absolutely intolerable,” said Vanna Mannucci, the vice-president of Italia Nostra’s Rome unit. “I don’t care who earns how much, what matters for me is that this historic and cultural place remains.”\n\nCaffé Greco, its furnishings and artworks have actually been protected property since 1953, when the Italian government stipulated that regardless of who manages the premises, the bar must remain intact.\n\nThe Israelite Hospital, which has three medical facilities in Rome, inherited the property about 80 years ago. Until now, the hospital and the various management companies that have run the bar, including Antico Caffè Greco, which took over in 2000, have co-existed peacefully.\n\nCaffè Greco is surrounded by plush stores on the Via Condotti and there have been reports that the Italian luxury brand Moncler was keen to take over the lease.\n\nFabio Perugia, a spokesman for the Israelite Hospital, insisted that the bar would not close.\n\nFacebook Twitter Pinterest An espresso in Caffé Greco can set you back €7. Photograph: Stefano Politi Markovina/Alamy\n\n“Caffè Greco has been there for 250 years and it will continue to be there,” he said. “The law says that nothing can be changed. The only difference will be a new manager.”\n\nPerugia added that the rent figure requested was in line with the market rate and that the money would be invested in the Israelite hospital.\n\n“It’s not a figure that we are looking for, it’s what other managers are willing to pay.” He was unable to say whether a new firm had been found, just that “there are many potential managers who would like to take over the bar”.\n\nCaffè Greco draws a steady crowd of Rome residents and tourists, although its coffee doesn’t come cheap. Drinking an espresso while standing at the bar is a reasonable €1.70, but having it served at a table by one of the bow-tied staff costs €7.\n\nPellegrini and Italia Nostra are calling for the recently reappointed culture minister, Dario Franceschini, to intervene to ensure the bar’s survival before Tuesday’s deadline.\n\n“The minister is always attentive to maintaining historical establishments,” said Mattia Morandi, Franceschini’s spokesperson. “And the ministry will reinforce the restrictions already in place for Caffè Greco, which must remain the spectacular place that it is and cannot be developed into another type of business.”", "description": "Caffè Greco has welcomed patrons from Charles Dickens to Princess Diana – but a rent hike is forcing the management company out", "authors": ["Angela Giuffrida"], "top_image": "https://i.guim.co.uk/img/media/5b68235946ae67a805ae90b79fd4db2cfcd6987e/0_0_5231_3138/master/5231.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6160b6be81c80fbebdec04d24fc84cbc", "published_at": "2019-10-18"}