{"pub": "yahoo", "url": "https://news.yahoo.com/trump-says-impeachment-given-experience-210158769.html", "downloaded_at": "2019-10-27 03:59:54.637553+00:00", "title": "Trump says impeachment has given him experience with broken criminal justice system", "language": "en", "text": "COLUMBIA, S.C. — President Donald Trump on Friday told a criminal justice forum at a historically black college that the impeachment investigation has given him a greater understanding of those incarcerated or unfairly prosecuted.\n\nApparently claiming his innocence in light of a deepening impeachment probe, Trump vowed to “ensure that our justice system is fair for every single American.”\n\nAnd he suggested toward the end of his address at Benedict College that his experience with investigations throughout his presidency made him more aware of the plight of those at risk of being unfairly treated by the criminal justice system.\n\n“You know I have my own experience, you know that,” he said. “You see what’s going on with the witch hunt. It’s a terrible thing that's going on in our country — no crimes — it’s an investigation in search of a crime.”\n\nThe comparison came after Trump caused a furor earlier this week by comparing the impeachment inquiry to a “lynching.” Tishaura Jones, the Democratic co-chair of the host group, the 20/20 Bipartisan Justice Center, earlier condemned his comments as being “in poor taste” and “inflammatory,” but the group didn’t disinvite Trump from delivering his speech at the historically black college.\n\nTrump used much of his address to defend his signature criminal justice reform law, after traveling down to South Carolina for a speech tailored to appeal to African American voters ahead of his reelection campaign.\n\nIn remarks at the 2019 Second Step Presidential Justice Forum, a title that alluded to the landmark criminal justice reform legislation he signed into law last year, the First Step Act, the president acknowledged that criminal justice was not “initially” a pillar of his first campaign.\n\nBut he told the audience that once he took office, he heard from — and was sold on the idea — by religious, local and law enforcement leaders who implored him to tackle injustices in the criminal justice system “on behalf of this forgotten community.”\n\nThe president used much of his remarks to applaud local politicians in attendance at the event, and stepped aside multiple times to allow for a few words from several attendees who had been released from prison as a result of the First Step Act. He also brought up Alice Johnson, who was released from prison after intervention from Kim Kardashian West.\n\n“I’m standing here today saying this is what a second chance looks like,” she told the audience.\n\nThe president was awarded the Bipartisan Justice Award at the top of his speech, telling the audience later that the prize would sit at a “very high level” in the Oval Office.\n\nTrump touted his efforts to assemble “a historic coalition” of lawmakers last year to shepherd the First Step Act through Congress, an effort headed in the White House by Trump’s son-in-law and adviser Jared Kushner. “We had them so liberal you couldn't believe it and so conservative you couldn’t believe it,” Trump said of congressional supporters of the bill.\n\nKushner attended the speech and could be seen at the side of the room applauding frequently throughout Trump’s remarks.\n\nTrump was also accompanied on the trip by acting White House chief of staff Mick Mulvaney, who had previously represented a South Carolina district in Congress, HUD Secretary Ben Carson, national security adviser Robert O’Brien, Sen. Lindsey Graham (R-S.C.), social media director Dan Scavino and Rep. Ralph Norman.\n\nThe conference will hear this weekend from a number of Democratic presidential candidates, including former Vice President Joe Biden, South Bend Mayor Pete Buttigieg, and Sens. Cory Booker of New Jersey, , Bernie Sanders, the independent from Vermont, and Elizabeth Warren of Massachusetts. Kamala Harris of California pulled out of the event in protest at Trump's award.\n\nTrump has been making a hard play to get African Americans to vote for him next year, even though he received only 8 percent of that group’s vote in 2016. Late this past summer, the Trump campaign quietly reached out to prominent African Americans about joining a coalition to help increase Republican support in the black community.\n\nTrump’s campaign is telling African Americans they should disregard the president’s inflammatory rhetoric and instead focus on the strong economy, the passage of criminal justice reform, record low unemployment among African Americans and the creation of Opportunity Zones designed to increase investment in poorer cities.", "description": "President Donald Trump on Friday told a criminal justice forum at a historically black college that the impeachment investigation has given him a greater understanding of those incarcerated or unfairly prosecuted. Trump used much of his address to defend his signature criminal justice reform law, after", "authors": ["Daniel Lippman", "Caitlin Oprysko"], "top_image": "https://s.yimg.com/uu/api/res/1.2/leUbP4MFK9CeQ5RjHVdOjA--~B/aD03NzM7dz0xMTYwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/politico_453/9a04f495d23f8d1df62f8f7a09937168", "published_at": "2019-10-26"}