{"pub": "yahoo", "url": "https://sports.yahoo.com/world-series-preview-come-proverbial-120048903.html", "downloaded_at": "2019-10-23 15:11:49.653925+00:00", "title": "World Series Preview: We have come to the proverbial “pivotal Game 2”", "language": "en", "text": "Some fun facts in the wake of the Nationals stealing one on the road from Gerrit Cole and the Astros last night:\n\nBefore last night the Astros hadn’t lost a Cole start since July 12 and hadn’t lost a Cole start at home since May 22;\n\nJuan Soto became only the fourth player to homer in the World Series before turning 21. The others who have done it: Miguel Cabrera, Andruw Jones and Mickey Mantle. Cabrera’s 2003 Marlins and Mantle’s 1952 Yankees won. Jones’ 1996 Braves lost;\n\n18 of the last 22 teams to win Game 1 of the World Series have gone on to win it all.\n\nScroll to continue with content Ad\n\nThose first two are just neat trivia. The last one is a bit more foreboding for the Astros. The last two, I guess, can go together in that the World Series in which Andruw Jones homered at age 20 was also a World Series in which the team which won Game 1 — and Game 2 for that matter — lost, with the 1996 Braves falling to the Yankees. Encouraging on some level? I dunno. What do you do when your invincible hero gets beat up by a kid? You reach a bit, I suppose.\n\nYou also turn to the next hero and hope for better things:\n\nThe Game: World Series Game 2: Washington Nationals vs. Houston Astros\n\nThe Time: 8:08 PM Eastern\n\nThe Ballpark: Minute Maid Park, Houston Texas\n\nThe Network: Fox\n\nThe Starters: Stephen Strasburg vs. Justin Verlander\n\nThe Upshot:\n\nAnother night, another fantastic starting pitching matchup, with two Cy Young Award candidates — really, if either of them finish lower than second in the voting in their respective leagues it’ll be an upset — facing off.\n\nThere is obviously pressure on Justin Verlander here, as it’ll be a Very Bad Thing if the Astros fall down 0-2, at home no less, in this series.\n\nStory continues\n\nBut there is also pressure on Stephen Strasburg. Not just in a “every game in the World Series is laden with pressure” way, but in a “the Nationals really, really need him to go deep into this game” way.\n\nWashington won last night, but they did so in a way that reveals one of their weaknesses. Max Scherzer got the win but he labored, only going five innings on over 100 pitches. Because Dave Martinez really only has two relievers he can trust in Daniel Hudson and Sean Doolittle, he made the bold move to use presumptive Game 3 starter Patrick Corbin for an inning of relief. It worked and, since he only threw 21 pitches the Nats can probably call it a defacto bullpen side session between starts and can count on him in Game 3. But Martinez, not wanting to stretch Corbin, also had to use Tanner Rainey — who gave up a run — as a bridge to Hudson — who gave up a run — and Doolittle. The two big guns each had to go longer than an inning.\n\nWhich is to say that the Nats would really prefer not to have to rely too much on their bullpen this evening. Or, if they do have to do that, they’d really prefer it not to be a close game, so they can maybe get some of their lower leverage arms some work to save the higher leverage arms for later. There are only so many starting pitchers you can press into service when you’re playing a best-of-seven series over nine days.\n\nThe one they have going tonight, though, is a good one who is 3-0 with a 1.64 ERA in the 2019 postseason. He has also given the Nats nineteen innings in his three starts, so there’s reason to believe he can do exactly what is needed to be done here. It’s just a matter of executing.\n\nAs for Houston: if Stephen Strasburg shuts them down and Justin Verlander can’t get the job done, hoo boy, they’re in some serious trouble. They will have fired their two best bullets to no effect and will have to go on the road with their third starter, albeit a better-than-usual third starter, and Brad Peacock/bullpen arms in the first two games in hostile territory. Not what you want.\n\nBut, as is the case with Washington and Strasburg, the Astros should have confidence in their co-ace. Tonight’s start will be Verlander’s 30th career postseason appearance. He’s 14-9 with a 3.26 ERA in the playoffs and. While his 1-2, 3.70 ERA this postseason is not a Verlander-esque line, he has still held opposing batters to a .205 average and a 1.07 WHIP. Not bad given the level of competition and the pressure. He’s going to be tough for Nats hitters to deal with. And, if he’s smart, he’s not gonna give Juan Soto a good pitch to hit all night.\n\nIt’s an overused phrase in sports, but we’re facing the proverbial “pivotal Game 2.” An Astros win — especially one that has Strasburg leaving earlier than he planned — essentially re-sets the series. A Nats win — especially one in which the Nats bullpen can be re-set — puts Houston in a big hole.", "description": "The deeper into the game Stephen Strasburg goes, the deeper the hole in which the Astros will find themselves becomes", "authors": ["Craig Calcaterra"], "top_image": "https://s.yimg.com/ny/api/res/1.2/p3TXb6z4_kvO1MRt6gEKaw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MDcuMg--/https://s.yimg.com/uu/api/res/1.2/9FTcAgYEv5OKO4mYkYX4BA--~B/aD0xMDYwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/nbcsports.com/d7727de3f49954a56c844f9294c22dc2", "published_at": "2019-10-23"}