{"pub": "fox", "url": "https://foxnews.com/media/cnn-don-lemon-john-kasich-trump-apologist", "downloaded_at": "2019-10-08 05:13:16.632423+00:00", "title": "Don Lemon asks John Kasich if he's 'confused' about Ukraine call transcript in tense exchange", "language": "en", "text": "CNN anchor Don Lemon on Monday asked Ohio governor-turned-CNN commentator John Kasich if he was \"confused\" by the transcript of President Trump's call with the Ukrainian president and then went on to suggest that he's a Trump \"apologist.\"\n\nLemon insisted that \"anybody with half a brain\" knows what Trump was saying to President Volodymyr Zelensky after reading the transcript and called it \"obvious.\"\n\n\"Wait, wait, wait, you can't say stuff like that,\" Kasich reacted. \"You can't say that.\"\n\n\"John, did you read the transcript?\" Lemon asked.\n\n\"Yeah, I read the transcript,\" Kasich responded.\n\n\"Well, were you confused by what it meant?\" Lemon shot back.\n\nCNN'S VAN JONES SAYS DEMS FACE 'LOSE-LOSE SITUATION' WITH IMPEACHMENT\n\nKasich told Lemon that he \"did not see a clear quid pro quo\" but expressed his support for an investigation, but that apparently wasn't good enough for the CNN anchor.\n\n\"John, if you asked me to do something, if you said, 'Don, I need something from you' and I said to you, 'John, yes, but I need you to do me a favor though,' what does that mean?\" Lemon pressed Kasich.\n\nThe former governor didn't directly answer him.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Then you are doing exactly what the apologists are doing,\" Lemon said. \"Then you are not helping people understand the real problem, then you are part of the problem.\"\n\nKasich, an outspoken Trump critic who never offered his endorsement during the 2016 election, warned Lemon if impeachment does not receive any support from Republican lawmakers, it will \"not help this country.\"", "description": "CNN anchor Don Lemon asked Ohio governor-turned-CNN commentator John Kasich if he was \"confused\" by the transcript of President Trump's call with the Ukrainian president and then went on to suggest that he's a Trump \"apologist.\"", "authors": ["Joseph Wulfsohn", "Joseph A. Wulfsohn Is A Media Reporter For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Screen-Shot-2019-10-07-at-11.13.44-PM.png", "published_at": "2019-10-08"}