{"pub": "cnn", "url": "https://cnn.com/2019/10/09/middleeast/iraq-protests-footage-arwa-damon-color-intl/index.html", "downloaded_at": "2019-10-09 18:45:49.444342+00:00", "title": "Iraqi protesters say they have videos of government atrocities. An internet blackout is stopping the world from seeing them", "language": "en", "text": "Baghdad, Iraq (CNN) By night, Baghdad's streets are eerily quiet, punctuated with smatterings of gunfire -- be it a single shot or something more sustained and intense.\n\nRoads leading to popular protest areas are blocked off, lined with security forces slumped up against buildings or napping on the hoods of their Humvee vehicles.\n\nThis relative calm belies the chaos that erupted over the past week as thousands protested across the country against government corruption, lack of basic services and growing unemployment.\n\nThe scale of the protests took the government by surprise; officials have attempted to regain control by imposing curfews and internet blackouts.\n\nOn Saturday night, the Saudi-owned al-Arabiya TV station said masked men beat up their employees and smashed equipment. A number of other local stations also said their offices were targeted.\n\nActivists have viewed the attacks as part of a broader effort to suppress the media. Many also claim the government is afraid of what will happen if countless videos showing atrocities are uploaded once the country is back online.\n\nThe government says it only shoots when fired on, but those who took part in the demonstrations dispute that. They claim security forces and Iranian-backed militias are deliberately shooting into the crowds.\n\nIraq's army has admitted to the use of \"excessive force\" against protesters in al-Sadr district, according to a statement posted to the Iraqi state security Facebook page on Monday.\n\nIraq's Prime Minister Adel Abdul Mahdi ordered the withdrawal of military troops from the area and their replacement with federal police \"due to the events witnessed in al-Sadr last night, and the use of excessive force that breach the rules of engagement,\" the statement read. \"Accountability measures have commenced to hold the commanding officers responsible.\"\n\nIraqi security forces fire tear gas while anti-government protesters set fires in Baghdad on October 5.\n\nAt least 104 people were killed and 6,107 injured during violent protests in Baghdad and elsewhere this week, Iraq's Interior Ministry spokesman Maj. Gen. Saad Maan said Sunday.\n\nIraqi President Barham Salih in a televised speech Monday condemned using lethal force against protesters in Baghdad and ordered the opening of a \"a judicial investigation\" into the deaths.\n\n\"Targeting peaceful demonstrators and security forces by live bullets, and targeting the media and journalists is unacceptable in Iraq that we have embraced and pledged to make it a democracy in which the rights and freedoms are respected,\" Salih said.\n\nInstead of quelling the anger, the government's violent crackdown has ended up fueling the young protesters' rage.\n\nThe presence of security forces has kept demonstrations away from the main squares, but protesters continue to try to gather in other areas across the capital.\n\nOn a Baghdad overpass looking at the orange flames in the distance piercing the dark night, a group of demonstrators said they were all university graduates. All of them declined to give their names.\n\n\"I studied law, but the only work I found was in a hair salon,\" a 26-year-old told CNN. \"My friend was killed the day before yesterday.\"\n\nA protestor gestures in front of security forces during a demonstration on October 2.\n\nAnother protester, who studied physical education and is unemployed, screamed, \"We want a country we can live in, it's been 16 years!\"\n\nAfter suffering for decades under President Saddam Hussein and sanctions, the US-led invasion in 2003 brought with it even more hardship and violence. There was the rise of the insurgency, al Qaeda in Iraq, Shia militias, the sectarian bloodletting, and ISIS.\n\nNow that, relatively speaking, the security situation has improved Iraqis no longer have patience with those who wield power. Successive governments have pledged to improve the lives of the population. All have failed to deliver.\n\nSilenced\n\nIraqi security forces have detained 454 people since protests erupted in several Iraqi cities last week Ali Akram al-Bayati, a member of the Independent High Commission for Human Rights of Iraq, told CNN.\n\nOf those, 287 have been released.\n\nActivists said government security forces are detaining injured protesters from hospitals and also some of their relatives in an attempt to silence them.\n\n\"We are afraid to take the wounded to the hospitals, we are afraid we will get detained,\" one demonstrator who did not want his identify revealed, told us. \"Stop the killing, listen to what they (the demonstrators) want, send them someone from the government to say I am here to talk to you, what do you need.\"\n\nCNN has reached out to the Ministry of Health and Interior for comment on this claim.\n\nThe demonstrator shows us a series of videos he says he filmed over the last few days, since the demonstrations began. The videos have not been uploaded online yet due to the internet blackout.\n\n\"The government doesn't want these images to get out, they are afraid of this,\" he said.\n\n\"Look, this is from the first day, you can see how the government is advancing and hear the gunfire,\" he said, pointing to one clip. \"This is from the third day, this man, he has a gunshot wound to the head. And keep watching, you can hear people calling for help, and then you will see another man shot in the chest and collapsing. He died. We dragged his body and somehow got out of there.\n\n\"I thought to myself, I am going to die. I thought about my children. And I thought about the families of those I just watched die,\" he said of the protests, which he described as terrifying.\n\nLong power outages, rising unemployment and rampant government corruption have led to growing discontent in recent years. Many in the country have limited access to basic services such as electricity and clean water, and the unemployment level is around 10%. For the country's youth, that figure stands at around 30%, according to the UN\n\nMany of those demonstrating are young Iraqi adults, bereft of choices and opportunities.\n\n'We need to be the ones to create change'\n\nIraq's Prime Minister Mahdi has described the protesters' demands as \"righteous,\" and over the weekend he issued a first package of decisions intended to address their demands.\n\nThose include reforms and programs to reduce unemployment, and to provide job opportunities and loans.\n\nThe government has also stated it will treat those killed in the protests, both demonstrators and security forces, as martyrs. This status grants their families certain rights and privileges; those wounded will be treated at the full expense of the government.\n\nIn a heartfelt speech on Monday night, President Salih pledged to bring those who fired on demonstrators accountable and condemned violence.\n\n\"Keep your protests peaceful and do not allow those who exploit situations to steal this homeland from you ... Our young people and our people have the right to express their opinion. The Constitution guarantees this, and any confiscation of this right is unacceptable and unconstitutional. Peaceful demonstration is a constitutionally guaranteed and democratic right,\" he said\n\nDemonstrators chant slogans during a protest in the Iraqi capital on October 2.\n\nThe President added that the \"looters and criminals who confronted the demonstrators and the security forces with live bullets are the enemies of this homeland and the enemies of the people.\"\n\nBut the population -- especially the young -- are fed up with hollow promises. Until they see real change they vow they will continue to try to demonstrate, but the violence is taking its toll.\n\nActivists now want the United Nations Security Council to step in and take action against what they say is a brutal reaction by the government to the protests.\n\n\"We will demonstrate tomorrow and the next day and the next,\" said the young protester who showed us his video.\n\n\"My father-in-law called and ordered me to come home or else he said I wouldn't have a wife to come home to. But I said no,\" the man recalled. \"We need to be the ones to create change -- I won't leave a country like this to my children.\"\n\nA Martyr of the Demonstrations\n\nThe wails of pain of those who loved 20-year-old Murtada al-Muhamadawi are soul crushing. At his funeral Muhamadawi's surviving five brothers are wrecked by grief, his father stunned into silence and unable to speak, his mother had cried so much she says she doesn't have any tears left.\n\nThe men are gathered outside as a religious leader chants Shia mourning hymns for the departed. Muhamadawi's male friends and family embrace his photograph with tears streaming down their faces.\n\n\"My darling, my brother,\" Mazen, one of Muhamadawi's elder brothers cries out, while rocking back and forth.\n\nThe women are gathered inside, where his mother, Hayat, sits next to his image.\n\n\"He's so handsome my son. He will live on as a hero, my son is a hero. He wanted to defend his rights, the rights of the youth,\" Hayat says, her face covered, according to mourning tradition. \"He was my friend, not just my son, he's my friend, I don't know ...\" her voice trails off as she sobs.\n\nMuhamadawi had told her he would be going out to demonstrate. \"They thought it was time to say enough, that the population had to end its slumber,\" she recalls.\n\nHe was gunned down, shot in the chest, and died in the street on the first day, his family says. Muhamadawi was studying political science, he wanted to be an officer in the army, to serve his country. His country never gave him that chance.\n\n\"Where is the government? Why have they not come to see us?\" Hayat asks angrily. \"Please tell my son's story. Promise me.\"\n\nHayat swears if the government does not live up to its promises this time she will send her remaining sons into the streets. She also vows that she will gather together the other mothers of protest martyrs and join them in demonstration.\n\n\"They took my son's voice.\" she says. \"So now I will use mine.", "description": "By night, Baghdad's streets are eerily quiet, punctuated with smatterings of gunfire -- be it a single shot or something more sustained and intense.", "authors": ["Arwa Damon", "Brice Laine", "Kareem Khadder"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191009121729-baghdad-protestor-killed-iraq-intl-vpx-super-tease.jpg", "published_at": "2019-10-09"}