{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/18/fitzpatrick-attacking-fresh-start-with-steelers", "downloaded_at": "2019-09-18 23:46:24.401077+00:00", "title": "Fitzpatrick attacking fresh start with Steelers", "language": "en", "text": "PITTSBURGH (AP) - Minkah Fitzpatrick walked into the locker room fresh off the first practice of the rest of his football life, noticed the semi-circle of cameras and microphones running three deep around his locker and took a step back while his new teammates roared in laughter.\n\nHow quickly things change.\n\nOn Monday, the versatile defensive back was in Miami wondering if he could find an escape route from the rebuilding Dolphins.\n\nOn Wednesday, he was in Pittsburgh, the latest addition to a high-profile if currently underperforming defense still confident it can help the Steelers emerge from an early 0-2 hole.\n\nFitzpatrick spent two hours running with the first team less than 48 hours removed from a trade in which the Steelers sent three draft picks - including a first-rounder in 2020 - to the Dolphins for the safety they coveted when he came out of Alabama in 2018.\n\nFitzpatrick didn’t fall far enough in the first round for Pittsburgh to grab him a year ago, yet the Steelers didn’t hesitate to pick up the phone when starter Sean Davis was lost for an extended period with a torn labrum in his right shoulder that sent him to injured reserve.\n\nAsked if the circumstances and the price tag it cost to bring him in adds any extra pressure, Fitzpatrick smiled and shrugged.\n\n“The main thing to me is just doing my job, communicating with my teammates,” Fitzpatrick said. “And with that will come big plays.”\n\nPittsburgh could certainly use them. The Steelers are winless through two weeks for just the second time since 2002 due in part to an inability to get necessary stops. New England lit them up in a 30-point blowout in the opener and Seattle scored three second-half touchdowns last Sunday to win in Pittsburgh for the first time in 20 years.\n\nWhile the Steelers did produce a pair of turnovers deep in Seahawks territory - including a fumble recovery by rookie linebacker Devin Bush in the fourth quarter that let the Steelers get within two with 5:34 to go - they also let Seattle quarterback Russell Wilson run around enough to run out the clock.\n\nEnter Fitzpatrick, who grew frustrated with his role with the struggling Dolphins. He moved all over the field in Miami, playing everything from safety to cornerback to nickel-back to linebacker in dime packages.\n\nHe declined to get into specifics about what went wrong with the Dolphins and said he’s fine doing whatever Steelers coach Mike Tomlin asks.\n\nTomlin said he plans to play Fitzpatrick exclusively at free safety on Sunday when Pittsburgh visits San Francisco (2-0). Whether Tomlin actually sticks to the plan or will be tempted to experiment with Fitzpatrick remains to be seen.\n\n“I think right now it’s important to anchor me down because I’m learning an entirely new system,” Fitzpatrick said. “Once I learn the system more, I’ll be able to move around a little bit. It’s part of my game. It’s one of the reasons they wanted me around.”\n\n49ers coach Kyle Shanahan called it “very hard” for any player to be effective after just three practices with a new team but added that Fitzpatrick is “a different dude mentally,” one who probably won’t take long to get up to speed in Pittsburgh.\n\nThe Steelers have had issues with communication in the early going, with blown coverages leading to three touchdowns against the Patriots.\n\nThings were a bit better against the Seahawks, but Seattle still piled up 425 yards. While stressing “football is football,” Fitzpatrick allowed getting a crash course in the terminology is going to take a not insignificant amount of effort.\n\n“Just got to learn and simplify the game so I can go out there and play fast,” Fitzpatrick said. “A lot of it is word association.”\n\nThe trade re-unites him in a way with safety Terrell Edmunds. The two worked out together in Florida while prepping for the 2018 draft. Both went in the first round, with Fitzpatrick going to Miami with the 11th pick and the Steelers grabbing Edmunds with the 28th selection. While Edmunds admitted he was surprised when Pittsburgh moved aggressively to bring Fitzpatrick in, it didn’t take long for Fitzpatrick to provide a reminder of why the Steelers coveted him 18 months ago.\n\n“Of course you could see that he’s smart out there,” Edmunds said. “He’s trying to communicate the best way he can. He’s getting comfortable out there. First day, he didn’t really have many mistakes, if any. We was just out there playing ball.”\n\nPittsburgh needs cohesion to materialize quickly. The Steelers will head west this weekend without quarterback Ben Roethlisberger, who is out for the season with a right elbow injury. Roethlisberger’s absence gives the defense less margin for error. Fitzpatrick’s arrival could help ease some of the burden. Either way, the Steelers are aware they need to get better, quickly.\n\n“We’ve got to get the wins,” Edmunds said. “That’s the mindset to get the wins and we haven’t been playing well enough all around.”\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Minkah Fitzpatrick walked into the locker room fresh off the first practice of the rest of his football life, noticed the semi-circle of cameras and microphones running three deep around his locker and took a step back while his new teammates roared in laughter.", "authors": ["The Washington Times Http", "Will Graves"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/18/steelers_fitzpatrick_football_92827_c0-126-3000-1875_s1770x1032.jpg?85e3f3a90d2b6cb216aa7875ca9e51bf768c5416", "published_at": "2019-09-18"}