{"pub": "independent", "url": "https://independent.co.uk/life-style/jennifer-lopez-sued-paparazzi-photo-instagram-alex-rodriguez-lawsuit-copyright-infringement-a9147936.html", "downloaded_at": "2019-10-09 00:54:02.173091+00:00", "title": "Jennifer Lopez sued for $150,000 by paparazzi for posting photo of herself", "language": "en", "text": "Jennifer Lopez is being sued for copyright infringement for posting a photo of herself taken by paparazzi to her Instagram account.\n\nThe federal lawsuit was filed by Splash News and Picture Agency for $150,000 over a picture of Lopez holding hands with Alex Rodriguez in New York City, which the singer shared to her Instagram account in 2017.\n\nAccording to court documents obtained by E! News, the picture agency claims that it is the owner and exclusive copyright holder of the photo - and that Lopez did not have permission to share the picture.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“Plaintiff never licensed the photograph to the defendant,” the court documents read. “Nevertheless, Lopez used it without authorisation or permission from plaintiff to do so.\n\n“Specifically, Lopez or someone acting on her behalf copied the photograph and distributed it on Instagram, via the @jlo account, on a story posted 7 November 2017.”\n\nShape Created with Sketch. Jennifer Lopez's best fashion moments Show all 26 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Jennifer Lopez's best fashion moments 1/26 The singer attended the CFDA Fashion Awards at the Brooklyn Museum in June 2019 wearing a bright orange crop top and skirt by Ralph Lauren collection. The outfit reportedly had 43,200 crystals applied to the top, which added extra sparkle to the brightly-hued look. Getty Images 2/26 Lopez wore a sparkly backless silver gown by Versace, teamed with a bejewelled cap to the 'Camp: Notes on Fashion'-themed Met Gala in May 2019. Getty Images for The Met Museum/ 3/26 A futuristic blue and navy dress by Zuhair Murad was chosen for the 2019 Vanity Fair Oscar part in February. FilmMagic 4/26 Lopez posed with her fiance, Alex Rodriguez, at the 91st Academy Awards in February 2019 wearing a Tom Ford-sleeved silver dress. FilmMagic 5/26 For the Grammy Awards in February 2019, the trained dancer wore a white embellished Ralph and Russo dress. The look was styled with a white wide-brimmed hat. Getty Images 6/26 To promote her film Second Act in December 2018 in Miami, Lopez opted to wear a bright lime green-coloured midi dress with exaggerated shoulder detailing. Getty Images 7/26 The mother-of-two wore a hot pink tulle gown with a detachable train by Giambattista Valli to the premiere of her film Second Act in December 2018. Getty Images 8/26 The 'Get on the floor' crooner wore an oversized white shirt and thigh-high denim boots in New York City in July 2018. The look was styled with a mini black Birkin bag. BuzzFoto via Getty Images 9/26 The 'Jenny from the Block' singer wore a Balmain ecclesiastical-inspired dress to the 2018 Met Gala in May, which ran under the theme 'Heavenly Bodies: Fashion and the Catholic Imagination'. The outfit featured a feathered skirt and a high-leg slit. Getty Images 10/26 Lopez's embroidered nude-gold coloured Zuhair Murad gown dazzled at the TIME 100 Gala in April 2018. The outfit was styled with a pair if Jimmy Choo shoes and jewellery from Lorraine Schwartz. Getty Images for Time 11/26 The Guess campaign model wore a pale blue dress and matching fur wrap to the Guess Spring 2018 Campaign Reveal party in January 2018. Getty Images for Guess, Inc. 12/26 The Selena actor looked sophisticated in a black long-sleeved dress with an exaggerated slit to The Robin Hood Foundation's 2018 benefit in May. Getty Images for Robin Hood 13/26 This dusty pink-hued dress with a thigh-high slit and a plunging neckline stood out among the A-list attendees' looks at the 59th Grammy Awards in February 2017. WireImage 14/26 The singer looked ethereal in a light blue Valentino gown at the 'Rei Kawakubo/Comme des Garçons'-themed 2017 Met Gala. The singer, who teamed the look with a sheer cape, attended the event with her now fiance, Alex Rodriguez. WireImage 15/26 In April 2017, Lopez shocked onlookers with this black, long-sleeved Julien MacDonald gown with cutout and mesh detailing. The look was paired with a pair of black heels and a matching-coloured clutch bag. Getty Images 16/26 The 50-year-old star wore an off-the-shoulder Eli Saab Haute Couture light peach-coloured dress with knot detailing to a NBC Universal Upfront event in May 2017. Getty Images 17/26 The New Yorker walked the red carpet at the 2015 Billboard Music Awards in May that year wearing a white Charbel Zoe Couture gown with embroidery detailing that cascaded down onto the dress' train.. FilmMagic 18/26 For the 'China: Through The Looking Glass'-themed Met Gala in May 2015, the singer wore a one-shoulder Atelier Versace illusion gown. Getty Images 19/26 At the 87th Annual Academy Awards at the Hollywood & Highland Centre in February 2015. Lopez looked regal in this nude-coloured Elie Saab gown. Getty Images 20/26 The singer wore a bejeweled Charbel Zoe dress to the MTV Music Video Awards in August 2014. The look was styled with a pair of embellished silver-coloured heels and a matching clutch bag. Getty Images 21/26 A Marchesa gold-hued dress with a plunging neckline and train was the fashion choice du jour for Lopez at the 66th Annual Golden Globe Awards in January 2009. Getty Images 22/26 For the 75th Annual Academy Awards in March 2003, the budding actor wore a pale green off-the-shoulder Valentino gown with Harry Winston jewellery. Getty Images 23/26 For her wedding to dancer Cris Judd in September 2001, the fashion icon wore a Chantilly lace gown by Valentino. WireImage 24/26 The Annual Latin Grammy Awards in September 2000 provided the perfect opportunity for the singer to wear this baby pink-hued halterneck gown. Lopez attended the event with her then partner, Sean 'Puffy' Combs. Getty Images 25/26 Who can forget the moment when Lopez walked the red carpet at the 42nd Grammy Awards wearing this naval-plunging green Versace gown? Getty Images 26/26 At her 30th birthday party in July 1999, the star was photographed wearing a two-piece red outfit with matching heels. The LIFE Picture Collection via 1/26 The singer attended the CFDA Fashion Awards at the Brooklyn Museum in June 2019 wearing a bright orange crop top and skirt by Ralph Lauren collection. The outfit reportedly had 43,200 crystals applied to the top, which added extra sparkle to the brightly-hued look. Getty Images 2/26 Lopez wore a sparkly backless silver gown by Versace, teamed with a bejewelled cap to the 'Camp: Notes on Fashion'-themed Met Gala in May 2019. Getty Images for The Met Museum/ 3/26 A futuristic blue and navy dress by Zuhair Murad was chosen for the 2019 Vanity Fair Oscar part in February. FilmMagic 4/26 Lopez posed with her fiance, Alex Rodriguez, at the 91st Academy Awards in February 2019 wearing a Tom Ford-sleeved silver dress. FilmMagic 5/26 For the Grammy Awards in February 2019, the trained dancer wore a white embellished Ralph and Russo dress. The look was styled with a white wide-brimmed hat. Getty Images 6/26 To promote her film Second Act in December 2018 in Miami, Lopez opted to wear a bright lime green-coloured midi dress with exaggerated shoulder detailing. Getty Images 7/26 The mother-of-two wore a hot pink tulle gown with a detachable train by Giambattista Valli to the premiere of her film Second Act in December 2018. Getty Images 8/26 The 'Get on the floor' crooner wore an oversized white shirt and thigh-high denim boots in New York City in July 2018. The look was styled with a mini black Birkin bag. BuzzFoto via Getty Images 9/26 The 'Jenny from the Block' singer wore a Balmain ecclesiastical-inspired dress to the 2018 Met Gala in May, which ran under the theme 'Heavenly Bodies: Fashion and the Catholic Imagination'. The outfit featured a feathered skirt and a high-leg slit. Getty Images 10/26 Lopez's embroidered nude-gold coloured Zuhair Murad gown dazzled at the TIME 100 Gala in April 2018. The outfit was styled with a pair if Jimmy Choo shoes and jewellery from Lorraine Schwartz. Getty Images for Time 11/26 The Guess campaign model wore a pale blue dress and matching fur wrap to the Guess Spring 2018 Campaign Reveal party in January 2018. Getty Images for Guess, Inc. 12/26 The Selena actor looked sophisticated in a black long-sleeved dress with an exaggerated slit to The Robin Hood Foundation's 2018 benefit in May. Getty Images for Robin Hood 13/26 This dusty pink-hued dress with a thigh-high slit and a plunging neckline stood out among the A-list attendees' looks at the 59th Grammy Awards in February 2017. WireImage 14/26 The singer looked ethereal in a light blue Valentino gown at the 'Rei Kawakubo/Comme des Garçons'-themed 2017 Met Gala. The singer, who teamed the look with a sheer cape, attended the event with her now fiance, Alex Rodriguez. WireImage 15/26 In April 2017, Lopez shocked onlookers with this black, long-sleeved Julien MacDonald gown with cutout and mesh detailing. The look was paired with a pair of black heels and a matching-coloured clutch bag. Getty Images 16/26 The 50-year-old star wore an off-the-shoulder Eli Saab Haute Couture light peach-coloured dress with knot detailing to a NBC Universal Upfront event in May 2017. Getty Images 17/26 The New Yorker walked the red carpet at the 2015 Billboard Music Awards in May that year wearing a white Charbel Zoe Couture gown with embroidery detailing that cascaded down onto the dress' train.. FilmMagic 18/26 For the 'China: Through The Looking Glass'-themed Met Gala in May 2015, the singer wore a one-shoulder Atelier Versace illusion gown. Getty Images 19/26 At the 87th Annual Academy Awards at the Hollywood & Highland Centre in February 2015. Lopez looked regal in this nude-coloured Elie Saab gown. Getty Images 20/26 The singer wore a bejeweled Charbel Zoe dress to the MTV Music Video Awards in August 2014. The look was styled with a pair of embellished silver-coloured heels and a matching clutch bag. Getty Images 21/26 A Marchesa gold-hued dress with a plunging neckline and train was the fashion choice du jour for Lopez at the 66th Annual Golden Globe Awards in January 2009. Getty Images 22/26 For the 75th Annual Academy Awards in March 2003, the budding actor wore a pale green off-the-shoulder Valentino gown with Harry Winston jewellery. Getty Images 23/26 For her wedding to dancer Cris Judd in September 2001, the fashion icon wore a Chantilly lace gown by Valentino. WireImage 24/26 The Annual Latin Grammy Awards in September 2000 provided the perfect opportunity for the singer to wear this baby pink-hued halterneck gown. Lopez attended the event with her then partner, Sean 'Puffy' Combs. Getty Images 25/26 Who can forget the moment when Lopez walked the red carpet at the 42nd Grammy Awards wearing this naval-plunging green Versace gown? Getty Images 26/26 At her 30th birthday party in July 1999, the star was photographed wearing a two-piece red outfit with matching heels. The LIFE Picture Collection via\n\nThe paparazzi agency also alleges that the 50-year-old was informed of her infringement in a letter dated December 2017, and that Lopez’s use of the photo negatively impacted the amount of money the company could have made.\n\n“The photograph is creative, distinctive and valuable,” the company stated in court documents. “Because of the subject’s celebrity status, and the photograph’s quality and visual appeal, plaintiff (and the photographer it represents) stood to gain revenue from licensing the photograph. But defendant’s unauthorised use harms the existing and future market for the original photograph.\n\n“The Instagram post made the photograph immediately available to Lopez’s tens of millions of followers… who would otherwise be interested in viewing licensed versions of the photograph in the magazines and newspapers that are plaintiff’s customers.”\n\nIn addition to the $150,000, the agency is also seeking an injunction against Lopez that would stop her and her team from posting the photo in the future, according to the court documents.\n\nEarlier this year, paparazzi photo agency Xclusive-Lee attempted to sue Gigi Hadid for copyright infringement after the model shared one the company’s photos to her Instagram account.\n\nAt the time, Hadid shared a lengthy post to Instagram in which she said that she thought the lawsuit was “absurd”.\n\nExplaining the emotional toll the paparazzi can have on those whose picture they are pursuing, Hadid said that she found the picture on Twitter and had “no way of knowing” which photographer took it.\n\n“To the paparazzi, I understand that this is how you make your living, and I respect that this is something I must accept with my job. But there is a line,” Hadid wrote.\n\nThe case was eventually dismissed after a New York district judge found that the picture agency had not secured the official copyright registration for the photo by the time it filed the lawsuit, according to Business Insider.\n\nPreviously, Khloe Kardashian, 50 Cent, Jessica Simpson and Ariana Grande have also faced copyright infringement lawsuits after sharing paparazzi photographs of themselves to Instagram.", "description": "Jennifer Lopez is being sued for copyright infringement for posting a photo of herself taken by paparazzi to her Instagram account. The federal lawsuit was filed by Splash News and Picture Agency for $150,000 over a picture of Lopez holding hands with Alex Rodriguez in New York City, which the singer shared to her Instagram account in 2017.", "authors": ["Chelsea Ritschel"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/08/17/gettyimages-1020286544.jpg", "published_at": "2019-10-08"}