{"pub": "cbc", "url": "https://cbc.ca/radio/history-of-butter-tarts-1.5316827", "downloaded_at": "2019-10-14 23:19:17.699724+00:00", "title": "CBC Radio", "language": "en", "text": "Canada is a large country filled with a rich Indigenous history as well as centuries of diverse immigration, so it's difficult to know what makes something iconically Canadian.\n\nBut if there's one dessert food that's widely touted as quintessentially Canadian, it's probably the butter tart.\n\nThese simple, gooey, incredibly sweet tarts are a national treasure, even appearing on a Canada Post stamp, but some food enthusiasts say it might be time to strip them of their iconic status and make way for something new.\n\nListen to Emma Waverman and Alison Broverman's CBC Radio special about the history of the butter tart:\n\nButter tarts are a national treasure, even appearing on a Canada Post stamp, but some food enthusiasts say it might be time to strip them of their iconic status and make way for something new. 25:00\n\nIn order to understand the significance of the butter tart, you first need to know the confection's history. And it turns out, there's more than one theory about how the tarts came to be here.\n\nConflicting histories\n\nThe first published recipe describing the butter tart as we know it was published in 1900 in The Women's Auxiliary of the Royal Victoria Hospital Cookbook in Ontario.\n\nBut many believe that the origins are far older. According to the Canadian Encyclopedia, butter tarts are a result of the filles du roi, or the King's Daughters, who were young French women sent to Quebec in the 17th century. It's thought they brought along their own European desserts and adapted a version of French sugar pie with ingredients that were accessible to them.\n\nToronto baker Omila Tickeram sells her butter tarts at various festivals in Ontario under the brand Omi's Sweets N Treats. (Emma Waverman/CBC)\n\n\"But I think that's rubbish,\" said Elizabeth Baird, former food editor at Canadian Living and author of Classic Canadian Cooking: Menus for the Seasons.\n\nBaird says butter tarts were originally known as \"border tarts.\"\n\nThat's likely because \"a lot of immigrants around the turn of the century, and before that, were from Scotland — specifically the border area,\" she said.\n\nThose Scottish immigrants living in rural Canada were likely the ones to adapt their own recipes, she said.\n\nPerhaps the most Canadian thing about the butter tart is the assumption that it was created somewhere else, says Liz Driver, author of Culinary Landmarks: A Bibliography of Canadian Cookbooks.\n\n\"Why is it that we can't just accept that we made something ourselves?\" Driver said.\n\nDriver says she believes butter tarts were invented by ordinary people in rural Ontario, which today is home to two popular Butter tart tours — one in Wellington County and one in Kawartha Northumberland — as well as several butter tart festivals.\n\n\"It's absolutely completely believable that something did sort of rise up out of the grassroots,\" she said.\n\n'We're better than the butter tart'\n\nGiving food a national identity is \"often an overt political act,\" Lenore Newman, author of Speaking in Cod Tongues: A Canadian Culinary Journey, said.\n\nNewman says the idea of Canadian cuisine really didn't exist until The 1967 International and Universal Exposition in Montreal, which coincided with Canada's centennial.\n\nThe years that followed were a tumultuous time, she said, ripe with conversations about Quebec separatism and Canadian identity.\n\n\"There was a lot of discussion on how to bring Canada together,\" Newman said.\n\nLenore Newman is the author of Speaking in Cod Tongues: A Canadian Culinary Journey. (Submitted by Lenore Newman)\n\nBut butter don't hold that same power of Canadian nostalgia for everyone.\n\n\"As a dessert, perfectly fine,\" Ann Hui, the Globe and Mail's national food reporter and author of Chop Suey Nation, said. \"But as a national icon, as being our national dessert … I just think we're better than the butter tart.\"\n\nHui says that a national dessert should ideally be something everyone can enjoy, especially as Canada continues to evolve and become a more diverse country.\n\nAnn Hui is the Globe and Mail's national food reporter. (Tracy Fuller/CBC)\n\n\"I think that people's palates are definitely diversifying and something that is really interesting with different cultures is their palates often have a different tolerance for sweetness and so what may be considered perfectly fine for some, for a lot of cultures is probably cloying and what I kind of describe as sickly sweet,\" she said.\n\nWhile trips to the cottage and hockey seem to be ubiquitous Canadian images, for others across the country, this is \"not going to ring true,\" she said.\n\n\"In 2019, with the Canada that we have now that is so diverse and is so rich with people from different cultures and different perspectives, I think that maybe it is a good time to revisit those icons and those ideas of what a Canadian symbol is and isn't,\" she said.\n\n'If you believe it is part of history, then it is'\n\nBut the butter tart is evolving in response to diversifying tastes. At At butter tart festivals across the country, you'll find all sorts of spins on the treat — gluten-free, pumpkin cheesecake, chai spiced, coconut and even Caesar cocktail, to name a few.\n\nSome of the unique twists on the butter tart were on display at the Queensway Butter Tart Festival. (Alison Broverman/CBC)\n\nThey also offer a big opportunity for Canadian bakers like Toronto's Omila Tickeram.\n\nTickeram's family is from Trinidad, where butter tarts are not a cultural staple. But they've become part of her Canadian dream.\n\nThe money she makes selling them at butter tart festivals, under the brand Omi's Sweets N Treats, will help her take her family on vacation this year and hopefully help her open up her own bakery one day, she said.\n\n\"If you believe that it is iconic, that it is part of our history, then yes, it is,\" she said.\n\n\"My mom didn't make it. But being a baker, it's something you can create and make your own. So if you believe it is part of history, then it is.\"", "description": "These simple, gooey, incredibly sweet tarts are a national treasure, even appearing on a Canada Post stamp, but some food enthusiasts say it might be time to strip them of their iconic status and make way for something new.", "authors": [], "top_image": "https://i.cbc.ca/1.4401928.1568306553!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/butter-tarts.jpg", "published_at": "2019-10-14"}