{"pub": "cbc", "url": "https://cbc.ca/news/canada/newfoundland-labrador/nl-peak-beer-1.5307476", "downloaded_at": "2019-10-13 03:48:42.650465+00:00", "title": "Has N.L. hit peak beer? Brewers struggle as ACOA funding dries up | CBC News", "language": "en", "text": "Baie Verte's first craft brewery had nearly everything it needed: a saltbox house on the bay, a refined beer menu, even a distinct logo.\n\nBut for all the sweat and tears poured into Little North Brewhouse, it won't be opening its doors any time soon.\n\nDespite Little North's application to the Atlantic Canada Opportunities Agency — the federal government's foremost economic growth engine for the region — co-owner Brandon Philpott said the funding hasn't materialized for his planned brewery as it has for the province's other taprooms.\n\nAnd according to the letter ACOA sent him in June, the money for craft brewers in Newfoundland and Labrador may have dried up entirely.\n\n\"People can't even produce what they can sell right now. Our market is so far from flooded,\" Philpott sighed.\n\n\"ACOA single-handedly killed the brewery industry in this province from any further development.\"\n\nBrandon Philpott, left, and Jerry Ball are two of six co-owners trying to get Little North Brewhouse in Baie Verte off the ground. (Supplied by Brandon Philpott)\n\nPhilpott, who teamed up with five partners to breathe life into the Baie Verte microbrewery, says ACOA made an arbitrary, and ultimately harmful, decision not to review their application.\n\nHe holds up the single-page letter they received in response.\n\n\"To date, we have made significant investment in several microbreweries, distilleries and wineries through the province,\" it reads.\n\n\"However, it is now the agency's position that we require a longer-term understanding of the performance of the sector, the level of risk and repayment results from our existing investments.\"\n\nACOA was watching for \"suitable market growth\" before investing further, the letter said.\n\nWhen Philpott called, he said he was told the policy went into effect April 1. On pressing to see the policy in writing, Philpott says the ACOA official told them the policy was more of an unofficial position.\n\n\"They're saying 'We don't know' — and that's the best answer we could get out of them — 'so we're not going to fund it,\"\" Philpott said.\n\nPhilpott says ACOA has some explaining to do. (Sherry Vivian/CBC)\n\nIt's a blow for the brewery hopefuls, who spent more than a year and hundreds of hours on a laminated, spiral-bound business plan covering every detail down to the pint glasses.\n\n\"We've spent so much time looking up stats, going through legislation, rules, regulations,\" Philpott said.\n\nHe believes ACOA's decision not to look at their application caused a ripple effect, leaving the brewery completely stalled as other funding agencies say they'll wait for ACOA's lead before pitching in themselves.\n\n\"It does seem a little bit weird that funding has stopped,\" said Justin Fong, head of the N.L. Craft Brewers Association.\n\n\"There's room for more breweries in Newfoundland right now, so hopefully ACOA will start reinvesting again soon.\"\n\nImmature market\n\nACOA's decision likely isn't concern over market saturation so much as it's a conservative investment strategy in an immature market, says beer expert Chris Conway, who co-owns Landwash Brewery in Mount Pearl.\n\nBrewers outside the province have also noticed ACOA's inconsistencies.\n\nIn Nova Scotia, the agency seemed to pull back as the market boomed only to begin accepting applications again a year later, said Kirk Cox, executive director of the province's craft brewers' association.\n\nPhilpott says months of labour meant the brewery's application should have been assessed. (Sherry Vivian/CBC)\n\nACOA declined to comment on the letter to Philpott, and when asked by CBC, wouldn't confirm details about its apparent decision to cease funding breweries in Newfoundland and Labrador.\n\nPhilpott says all of ACOA's other provincial offices told Little North they were accepting applications, prompting him to submit an access-to-information request for clarity.\n\nPreviously, ACOA contributed hundreds of thousands of dollars to both existing and startup taprooms: Port Rexton Brewing Company has received $941,620 in loans and grants, while Quidi Vidi Brewing Company was recently approved for $315,000 for an automatic canner.\n\nAccording to public data, the agency provided funding to breweries in other Atlantic provinces after issuing its letter to Philpott.\n\nFar from 'peak beer,' applicant says\n\nPhilpott argues ACOA has focused most of its funding outside the central region, with 80 per cent so far going to a cluster of businesses on the Avalon and still more to tourism hotspots like Bonavisa and Twillingate.\n\n\"Providing government funds to the private sector is supposed to be in a decentralized manner,\" he said. \"That's far from that.\"\n\nPhilpott points out that, by his calculations, Newfoundland and Labrador — despite consuming more beer than any other province in the country — also has the fewest brewhouses per capita in the Atlantic.\n\nAll of that adds up to a market with room to grow, he says.\n\nRevitalizing outports\n\nIn his other role as mayor of Baie Verte, Philpott says he's been looking for ways to muscle the former mining town onto the map as a tourist destination.\n\nA brewery would have helped, he says.\n\n\n\nTourism Minister Bernard Davis agrees — but says his department, although it welcomes any opportunities to grow the industry, hasn't spoken to ACOA about its apparent about-face and has no plans at present to lobby the agency to continue funding microbreweries.\n\nPhilpott, who says he's received letters of support from both his MHA and MP, doesn't plan to back down until he's satisfied Newfoundland and Labrador reaches craft beer parity with the rest of the region.\n\n\"We are so far behind the other Atlantic provinces, it's not even funny.\"\n\nRead more from CBC Newfoundland and Labrador", "description": "A startup brewery in Baie Verte says federal loan agencies are stepping back from the province's rapidly growing microbrewery scene, stalling further growth.", "authors": ["Reporter Writer", "Malone Mullin Reports For All Platforms In St. John'S. She Previously Worked On The Web Desk At Cbc Toronto", "Cbc Vancouver.", "Read More Articles Malone Mullin", "Follow Malone Mullin On Twitter"], "top_image": "https://i.cbc.ca/1.5309516.1570215719!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/brandon-philpott.jpg", "published_at": "2019-10-07"}