{"pub": "nyt", "url": "https://nytimes.com/2019/09/04/opinion/uber-driver-pay.html", "downloaded_at": "2019-09-04 23:40:07.173682+00:00", "title": "Opinion | Uber Has a Plan to Treat Drivers Better. If Only We Could Trust It.", "language": "en", "published_at": "2019-09-04", "text": "Uber and Lyft say that classifying drivers as employees might threaten their business models and force them to let go of many of their drivers. The companies are calling for legislation or a ballot initiative under which drivers would remain independent contractors but still receive an array of labor rights, including a minimum pay and the ability to unionize. The companies argue that their proposal is not a mere compromise but a genuine advance in labor protections. By enshrining rights for independent contractors into state law, they would be preserving the flexibility that their drivers covet, while also advancing a new model for labor in the era of software-driven “gig” work.\n\nIf you didn’t know anything about Uber’s past, you might be tempted to buy into the sunny proposal. Surveys show that many Uber and Lyft drivers only want to drive part time, between other jobs, and they are not enthusiastic about some of the strictures that might come with classification as employees. Adding protections and unionization to independent-contract work could well be a step forward for them.\n\nYet every time I find myself feeling optimistic about ways to accommodate and tame Uber’s rise, I remember: Oh, yeah. This is Uber we’re talking about. This is the company that barged into cities across the planet and operated an enormously consequential and dangerous service without anyone’s consent. Then, when challenged by authorities, the company’s entire M.O. was to fight hard and fight dirty. Wouldn’t we be fools to trust it now?\n\nAs “Super Pumped” documents in hair-raising detail, Uber’s growth was fueled by military-grade black-ops programs to thwart law enforcement, competitors and the press. It treated any skepticism, and even the very notion of corporate ethics, as a challenge to be fought to the death. Uber’s recklessness is sometimes seen as an aberration — the fault of one bad apple, Travis Kalanick, the company’s take-no-prisoners founder. But for much of Uber’s rise, its culture was also encouraged and celebrated by investors, employees and much of the tech industry — the worse the company behaved, the more strongly it came to believe that it was actually “crushing it,” in Mr. Kalanick’s bro-ese, and the more it was showered with fresh rounds of investment to crush it some more.\n\nThe entire saga begs for stringent oversight of Silicon Valley’s start-up engine, but that’s not a lesson anyone seems to have learned. “Everyone involved from the beginning is now filthy rich,” Mike Isaac told me last week. “They have not suffered any ostracism in the Valley. Travis is still investing in companies. He’s still going to the Met Gala. He’s not been cast out of well-to-do society.”", "description": "The company’s drivers deserve to be classified as full-fledged employees.", "authors": ["Farhad Manjoo"], "top_image": "https://static01.nyt.com/images/2019/09/04/opinion/04manjooWeb/04manjooWeb-facebookJumbo.jpg"}