{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/africa/tunisias-presidential-election-is-set-to-test-the-arab-springs-only-democracy/2019/09/13/aca9ed6c-d3d1-11e9-8924-1db7dac797fb_story.html", "downloaded_at": "2019-09-13 19:21:49.400240+00:00", "title": "Tunisia’s presidential election is set to test the Arab Spring’s only democracy", "language": "en", "text": "A woman passes a wall of campaign posters in Tunis On Sept. 4. Voters go to the polls Sunday to pick a successor to President Beji Caid Essebsi, who died in July. (Hassene Dridi/AP)\n\nTunisians head to the polls Sunday for a presidential election seen as crucial test for the country, the only democracy to emerge from the Arab Spring revolts of 2011 but a distinctly fragile one as it struggles with economic woes and the threat of Islamic extremism.\n\nThe election, just the second here to choose a president, comes two months after the death of 92-year-old President Beji Caid Essebsi, who was elected in 2014. Before its revolution, the former French colony had two rulers after gaining independence in 1956.\n\nNow, 26 candidates are vying to succeed Essebsi. They include secularists, moderate Islamists and populists, as well as the first openly gay candidate seeking to lead an Arab state and a media tycoon who is in prison.\n\nThe peaceful run-up to Sunday’s vote is the latest sign of the fledgling North African democracy’s unique standing. In a region ruled by dictators and monarchs, where elections are usually rigged and civil strife has beset societies since the Arab Spring, Tunisia has held televised presidential debates — a first in the Arab world.\n\nIn contrast, all the credible candidates in Egypt’s presidential election last year were arrested or pushed out, allowing the country’s autocratic leader, Abdel Fatah al-Sissi, to easily win again.\n\n[In Egypt’s presidential election, a strongman’s only challenger is barely campaigning]\n\n\n\nPresidential candidate Selma Elloumi (center) visits the old city of Tunis on Friday, the last day of the campaign. (Mohamed Messara/EPA-EFE/Shutterstock)\n\n“In a region where democratic behavior is in short supply, Tunisia has an outsized impact,” said Daniel Twining, head of the International Republican Institute, who is here with a team of observers to monitor the vote. “Tunisia’s example can be a source of inspiration if their democratic institutions remain resilient and lay the foundation for a more stable and prosperous country.”\n\nIndeed, neighboring Algeria and Sudan are experiencing Tunisia-like moments. Street protests in Algeria, now unfolding for more than 30 weeks, have not only forced out long time President Abdelaziz Bouteflika but continue to demand democratic reforms. In Sudan, demonstrations toppled dictator Omar al-Bashir, and a power-sharing agreement signed last month has moved the country a step closer to full democracy.\n\nTunisia’s own democracy has been tested before. In 2013, the assassination of several secular leaders, allegedly by Islamists, triggered protests and militant attacks on police. Tensions between Islamists and secularists grew, dividing the public. Civil society groups joined forces to unite the battling factions, actions that garnered them the 2015 Nobel Peace Prize.\n\nYet even as Tunisia’s path today shows signs of a maturing democracy, the country faces multiple challenges to its stability. Unemployment is growing, while living standards have fallen, following public spending cuts mandated by an International Monetary Fund-backed loan program. Regular protests have erupted over the poor economic conditions.\n\nThat concerns observers, in large part because Tunisia’s revolution, which ignited the wave of populist revolts in Egypt, Libya, Yemen and elsewhere eight years ago, was fueled as much by rising prices as by the corrosive dictatorship of Zine al-Abidine Ben Ali, who later fled into exile.\n\n“The defining issue of this year’s election is whether the Tunisian state can meet the social and economic needs of its people,” wrote Anthony Dworkin, a Tunisia analyst with the European Council on Foreign Relations in an essay Thursday. “The revolution of 2011 led to a genuinely competitive political system but has not delivered any democratic dividend to Tunisia’s citizens.”\n\nThe lack of jobs and other opportunities was a key reason thousands of Tunisian youths left to fight in the wars in Syria and Iraq — more recruits than from any other country. Many joined al-Qaeda and the Islamic State.\n\nWith those groups largely defeated, hundreds of Tunisian militants have returned to an economy worse than when they left. Tunisian and regional officials worry many more will return to spread their ideology and violence, potentially derailing the Arab Spring’s only success story.\n\n[Tunisia feared the return of militants from abroad. The threat now is those who never left.]\n\nThe country has already become a target. In 2015, the Islamic State claimed responsibility for two attacks — in the resort town of Sousse and at the Bardo Museum here in the capital — that killed scores, mostly foreign tourists. The following year, Islamic State fighters crossed over from neighboring Libya and attacked the border town of Ben Guerdane.\n\nA few weeks before Essebsi’s death, the group claimed two suicide bombings in Tunis.\n\nAffiliates of both the Islamic State and al-Qaeda are actively recruiting locals, especially in impoverished interior and border areas, according to Tunisian and Western security officials. Western diplomats and counterterrorism experts say that addressing Tunisian’s socioeconomic crisis is critical to preventing the radicalization of its youth.\n\nToday, though, the lack of economic progress and wrangling among the country’s myriad political parties have spawned widespread public mistrust of the political system, according to various public surveys and analysts.\n\nVoter apathy has soared. The turnout for presidential and parliamentary elections in 2014 was 63 percent and 68 percent respectively. In last year’s municipal elections, it was 34 percent.\n\nEssebsi’s death forced Sunday’s election to be moved forward by two months, leaving less time for electoral authorities to prepare. The former president was at times controversial, but he was widely credited as being the glue that held Tunisia’s secularists and the influential moderate Islamist party, Ennahda, together in a coalition government. The union, some observers say, prevented civil strife and was praised as a model of political tolerance and harmony.\n\nWith his death, the election has become a free-for-all, with credible candidates of all political stripes seeking his mantle. The outcome could realign the country’s political landscape, analysts said.\n\nEssebsi’s death “solidified the demise of his political party and isolated his son, Hafedh Caid Essebsi, who is now in exile in France and has no political future,” said a Western analyst who spoke on the condition of anonymity because she is an election observer. “It also paved the way for new faces and voices to enter the political scene.”\n\nThe new faces include Mohamed Moncef, the country’s interim president from the fall of Ben Ali to 2014; Youssef Chahed, the current prime minister; and Abdelfattah Mouru, the first member of Ennahda to run for president since the revolution. Then, there is Abir Moussi, an unexpected candidate, since she professes support for Ben Ali.\n\nNabil Karoui, a top contender, was arrested and charged with corruption and tax evasion, allegations the media mogul has denied. But under Tunisian law, he can still run for the presidency from his jail cell.\n\nWith a candidate requiring 50 percent of the votes to win outright, a runoff is widely expected.\n\nThe central question here: Will Tunisians turn out in large numbers to vote, lending more credibility to their democracy?\n\nSome analysts see promise in the millions who watched the televised debates. And the electoral commission has reported more than 1.5 million new voters in a nation of 11 million people.\n\n“Many Tunisians have grown angry and frustrated with the political institutions and leaders,” said the Western analyst. “This is a chance for a fresh start and for people to reinvigorate their democratic spirit.”\n\nRead more\n\nNo nationality heeded the call to come fight for ISIS like Tunisians did. Now they’re stuck.\n\nMeet Souad Abderrahim, the first female mayor of Tunisia’s capital in 160 years\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "description": "Sunday’s vote, following President Beji Caid Essebsi’s death while in office, is an unpredictable free-for-all featuring 26 candidates.", "authors": ["Sudarsan Raghavan", "Cairo Bureau Chief Covering North Africa", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/1L1XeLf4nfdP5pEJLw1vC-qePe4=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5HEMYYGWGEI6TFQQ7NLMKURODQ.jpg", "published_at": "2019-09-13"}