{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-chile-protests/one-million-chileans-march-in-santiago-city-grinds-to-halt-idUKKBN1X41NH", "downloaded_at": "2019-10-26 06:54:04.274964+00:00", "title": "One million Chileans march in Santiago, city grinds to halt", "language": "en", "text": "By Dave Sherwood and Natalia A. Ramos Miranda\n\nDemonstrators carry a giant Chilean national flag during a protest against Chile's state economic model in Santiago, Chile October 25, 2019. REUTERS/Ivan Alvarado\n\nSANTIAGO (Reuters) - As many as a million Chileans protested peacefully late into the evening on Friday in the capital Santiago in the biggest rallies yet since violence broke out a week ago over entrenched inequality in the South American nation.\n\nProtesters waving national flags, dancing, banging pots with wooden spoons and bearing placards urging political and social change streamed through the streets, walking for miles (km) from around Santiago to converge on Plaza Italia.Traffic already hobbled by truck and taxi drivers protesting road tolls ground to a standstill in Santiago as crowds shut down major avenues and public transport closed early ahead of marches that built throughout the afternoon.\n\nBy mid-evening, most had made their way home in the dark ahead of an 11 p.m. military curfew.\n\nSantiago Governor Karla Rubilar said a million people marched in the capital - more than five percent of the country’s population. Protesters elsewhere took to the streets in every major Chilean city.\n\n“Today is a historic day,” Rubilar wrote on Twitter. “The Metropolitan Region is host to a peaceful march of almost one million people who represent a dream for a new Chile.”\n\nSome local commentators estimated the Santiago rally well over the million mark, describing it as the largest single march since the dying years of the dictatorship of Augusto Pinochet.\n\nChile’s unrest is the latest in a flare-up of protests in South America and around the world - from Beirut to Barcelona - each with local triggers but also sharing underlying anger at social disparities and ruling elites.\n\nProtests in Chile that started over a hike in public transport fares last Friday boiled into riots, arson and looting that have killed at least 17 people, injured hundreds, resulted in more than 7,000 arrests and caused more than $1.4 billion of losses to Chilean businesses.\n\nChile’s military has taken over security in Santiago, a city of 6 million people now under a state of emergency with night-time curfews as 20,000 soldiers patrol the streets.\n\nClotilde Soto, a retired teacher aged 82, said she had taken to the streets because she did not want to die without seeing change for the better in her country.\n\n“Above all we need better salaries and better pensions,” she said.\n\nChile’s center-right President Sebastian Pinera, a billionaire businessman, trounced the opposition in the most recent 2017 election, dealing the center-left ruling coalition its biggest loss since the country’s return to democracy in 1990.\n\nBut as protests ignited this week, Pinera scrapped previous plans and promised instead to boost the minimum wage and pensions, ditch fare hikes on public transportation and fix the country’s ailing health care system.\n\n“We’ve all heard the message. We’ve all changed,” said Pinera on Twitter following the peak of the rallies. “Today’s joyful and peaceful march, in which Chileans have asked for a more just and unified Chile, opens hopeful paths into the future.”\n\nStill, many protest placards, chants and graffiti scrawled on buildings around the city call for his exit.\n\nRelated Coverage Chile protesters block access to lithium operations - local leader\n\nMULTICOLORED CROWD\n\nAs crowds of colorful demonstrators stretched along Santiago’s thoroughfares as far as the eye could see, the noise of pots and pans being clanged with spoons, a clamor that has become the soundtrack for the popular uprising, was ear-splitting.\n\n“The people, united, will never be defeated,” the crowds chanted over the din.\n\nBy early evening there had been no signs of violence or clashes with the security forces, who maintained a significant but low-key presence inside paint-spattered and stone-dented armored vehicles parked in side streets.\n\nBeatriz Demur, 42, a yoga teacher from the suburb of Barrio Brazil, joined a stream of demonstrators shuffling toward Plaza Italia with her daughter Tabatha, 22.\n\n“We want Chile to be a better place,” said Demur. “The most powerful have privatized everything. It’s been that way for 30 years.”Eyeing the crowds packing the square, her daughter said: “I have waited for this a long time ... It’s not scary, it’s exciting. It means change.”\n\nAnali Parra, 26, a street hawker, was with her daughter Catalina, 9, and five-month-old son Gideon Jesus, his buggy decked in streamers and an indigenous Mapuche flag.\n\n“This isn’t going to go away,” Parra said. “Pinera should just go now.”\n\n‘URGENT’ REFORMS\n\nOn Friday morning, trucks, cars and taxis had slowed to a crawl on major roads, honking horns and waving Chilean flags. “No more tolls! Enough with the abuse!” read bright yellow-and-red signs plastered to the front of vehicles.\n\nMany bus drivers in Santiago also staged a walk-off on Friday after one of their number was shot.\n\nWhile much of wealthy east Santiago has remained calm under evening lockdown, the poorer side of the city has seen widespread vandalism and looting.\n\nPinera told the nation on Thursday he had heard the demands of Chileans “loud and clear.”\n\nHe has sent lawmakers legislation to overturn a recent hike in electricity rates, and called for reforms to guarantee a minimum wage of $480 a month and introduce state medical insurance for catastrophes. [nL2N2760H6]\n\nSeated with a group of elderly Chileans over lunch on Friday, Pinera put finishing touches on a bill to hike minimum pensions by 20%. “We must approve these projects with the urgency that Chileans demand,” Pinera said.\n\nLawmakers pushing the reforms forward were nonetheless forced to evacuate the country’s Congress in the port city of Valparaiso earlier in the day when angry protesters rushed the building, overwhelming security forces.\n\nSlideshow (23 Images)\n\nAn online poll conducted by local company Activa Research of 2,090 people between Oct. 22-23 found 83% of respondents said they supported the goals of the demonstrators, but 72.5% opposed violence as a method of protest.\n\nThe principal causes of the protests were low salaries, high utility prices, poor pensions and economic inequality, it said.", "description": "As many as a million Chileans protested peacefully late into the evening on Friday in the capital Santiago in the biggest rallies yet since violence broke out a week ago over entrenched inequality in the South American nation.", "authors": ["Dave Sherwood", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191026&t=2&i=1445064778&w=1200&r=LYNXMPEF9P03D", "published_at": "2019-10-26"}