{"pub": "fox", "url": "https://foxnews.com/politics/lindsey-graham-somebody-needs-to-look-at-the-bidens-but-not-china", "downloaded_at": "2019-10-07 00:14:40.470536+00:00", "title": "Lindsey Graham vows to have whistleblowers testify publicly if Democrats impeach Trump", "language": "en", "text": "Senate Judiciary Committee Chairman Lindsey Graham, R-S.C., vowed to expose the anonymous whistleblowers against President Trump if Democrats move forward with impeachment; at the same time, he warned against Trump having China pursue an investigation of Joe Biden.\n\nA second unidentified whistleblower was confirmed Sunday morning, reportedly with firsthand information to support some of the allegations another whistleblower made in a complaint filed in August regarding a July 25 phone call between Trump and Ukrainian President Volodymyr Zelensky. Graham said that if Democrats follow through on their desire to impeach Trump, he will make sure that the whistleblowers will have to come forward and testify.\n\nGIULIANI SAYS MEDIA TRIED TO COVER UP CORRUPTION ALLEGATIONS LEVELED AGAINST 'HONEY BOY' BIDEN\n\n\"Here’s what’s going to happen: if the whistleblowers' allegations are turned into an impeachment article it’s imperative that the whistleblower be interviewed in public, under oath, and cross-examined,” Graham told Fox News' \"Sunday Morning Futures,\" promising that \"if that doesn't happen in the House, I'll make sure it happens in the Senate.\"\n\nGraham pointed to the need for Trump to be able to confront his accusers, saying, \"There can be no valid impeachment process unless the president can confront the witnesses against him.\"\n\nThe complaint accused Trump of using military aid as leverage to pressure Ukraine into investigating Hunter Biden's business dealings with Ukrainian energy company Burisma Holdings, and former Vice President Joe Biden's efforts to have Ukraine fire the prosecutor who was investigating the firm.\n\n\"I think it’s ridiculous to say the president did something wrong based on the phone call,\" Graham said, adding that Trump did not suggest any quid pro quo tying the military aid to the Biden investigation, which was being spearheaded by Trump's personal attorney Rudy Giuliani.\n\nGiuliani, meanwhile, has been vocal about alleged wrongdoing on the part of the Bidens in both Ukraine and China. The former New York City mayor claims that Hunter Biden received money from both Ukraine and China as part of a \"pay for play\" scheme to curry favor with the then-vice president. Trump has suggested that China should investigate Biden for the alleged corruption. Graham, however, advised against such a thing.\n\n\"I think that's a bad idea,\" Graham told host Maria Bartiromo. \"I don't trust anything coming out of China against Biden, Trump, me or you.\"\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nThat does not mean he thinks the Bidens should get a pass.\n\n\"Somebody needs to look at the Bidens, whether or not they violated the law,\" he said. \"They sure as hell looked at the Trumps. Somebody needs to look at the Bidens.\"", "description": "Senate Judiciary Committee Chairman Lindsey Graham, R-S.C., defended President Trump against the looming threat of impeachment by vowing to let Trump face his currently anonymous accusers, while also maintaining that it would be a \"bad idea\" for the president to have China investigate Joe Biden.", "authors": ["Ronn Blitzer"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/ENC3_132108244568530000.jpg", "published_at": "2019-10-06"}