{"pub": "washingtonpost", "url": "https://washingtonpost.com/travel/2019/09/06/more-people-are-traveling-world-than-ever-number-coming-america-is-dropping", "downloaded_at": "2019-09-07 02:23:35.989323+00:00", "title": "More people are traveling the world than ever. But the number coming to America is dropping.", "language": "en", "text": "Travelers can’t get enough of globe-trotting. But have they had enough of the United States?\n\nAccording to the World Tourism Organization, a United Nations agency, the number of international tourist arrivals around the world reached 1.4 billion last year. That represented a 6 percent increase, and the organization forecast the number to grow by 3 or 4 percent this year.\n\nBut in the first half of this year, the number of international visitors coming to America has actually dropped nearly 1.7 percent. That’s according to preliminary data from the Commerce Department’s National Travel and Tourism Office, which shows that slightly more than 37 million foreign travelers came to the country between January and June.\n\nAccording to a forecast from the U.S. Travel Association, an industry trade group, the outlook for 2019 is for visitor numbers to remain just about the same as last year. Even if that holds true and the country doesn’t see a dip for the full year, the news is not good.\n\n“It’s generally going to be underperforming,” says David Huether, the group’s senior vice president of research.\n\n[D.C. drew a record number of visitors in 2018, even as foreign travel fell]\n\nThere’s a grab bag of reasons for the downturn, observers say. The latest version of a monthly report from the travel association, out this week, warns that foreign visits to the country remain vulnerable.\n\n“Ongoing global economic cooling, prolonged and expanding trade tensions, and uncertainty surrounding the Trump administration remain major risks to international traveler sentiment,” the report says.\n\nThe value of the dollar also remains strong, making travel more expensive for visitors from other countries, Huether says.\n\nTrade wars with China could cost the country 1.9 million inbound visitors and $11 billion in spending between 2018 and 2020, according to research from the consultancy Tourism Economics, part of Oxford Economics. Through July, travel from China is down 3.7 percent compared with last year, according to Commerce Department figures. That’s on top of a drop last year, the report says.\n\n[Gun violence in America prompts Amnesty International and a growing list of countries to issue travel warnings]\n\n“Someone should care about this as much as they care about U.S. auto manufacturing or agriculture,” says Adam Sacks, president of Tourism Economics. “Given the size of the traveling class in China and how much that’s grown, and the strong desirability that the U.S. holds in Chinese travel intentions, we’d expect to see growth in the range of 10 percent. Instead, we saw a 5.7 percent decline.”\n\nChina warned its citizens about traveling to the United States in June, naming gun violence, robberies and theft as risks. Citing two mass shootings over the same weekend in August, the governments of Uruguay and Venezuela, as well as Amnesty International, issued travel warnings of their own.\n\nHuether said the U.S. Travel Association is considering ways to see whether concerns about gun violence keep potential tourists away.\n\n“It’s easy to believe that incidents like these could have an effect on travel, but we can’t at this point conclusively say, based on the data that’s available,” he said in an interview last month. “We are going to be exploring ways to see if we can measure that.”\n\nFurthermore, Sacks says, there is a larger issue of public sentiment that should worry the nation. He believes some potential visitors might be staying away because they disagree with policies on immigration or the U.S. withdrawal from the Paris climate agreement. Sacks said he has heard anecdotally from clients about conventions and other travel groups that have canceled plans to visit on moral grounds.\n\n“There’s going to be pockets of the traveling public that, out of protest for unfavorable U.S. policies, are not traveling to the U.S.,” Sacks says.\n\nRead more:\n\nChina warns against traveling to the U.S., citing ‘shootings, robberies and theft’\n\nThese are the airports with the best and worst TSA wait times\n\nDo you know how to tip in America? Take this quiz to test your knowledge.", "description": "The decrease isn't steep, but any decline is seen as alarming, given the overall rise in global tourism.", "authors": ["Hannah Sampson", "Reporter Focusing On Travel News", "September At Pm", "Hannah Sampson Is A Staff Writer At The Washington Post For The Way", "Where She Reports On Travel News."], "top_image": "https://www.washingtonpost.com/resizer/qsWKyYPe8nDTSjmLV-pU8jC6mB0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QOJUW64BHZD4ZIXUR6UGYBNLPA.jpg", "published_at": "2019-09-06"}