{"pub": "businessinsider", "url": "https://businessinsider.my/dc-universe-invites-fans-to-pitch-unscripted-series-ideas-2019-10", "downloaded_at": "2019-10-04 07:44:25.703591+00:00", "title": "DC Universe is inviting fans to pitch unscripted TV series inspired by ‘all things DC’", "language": "en", "text": "caption “Titans” source DC Universe\n\nThe DC Universe streaming service is inviting fans to pitch original unscripted series.\n\nDC Universe announced the project at New York Comic Con on Thursday.\n\nThe winner’s pitch will be produced by creative agency Ideas United and launched on DC Universe.\n\nVisit Business Insider’s homepage for more stories.\n\nThe DC Universe streaming service promises to be the “ultimate DC membership” for fans and it’s about to become more fan centric.\n\nDC Universe, a hub for DC fans that includes original TV shows and a catalog of digital comics, announced at New York Comic Con on Thursday a new initiative called “DC You Unscripted.” The service is partnering with creative agency Ideas United and has invited fans to pitch original unscripted series inspired by “all things DC.” The winning submission will be produced and air on DC Universe.\n\nREAD MORE: WarnerMedia still plans to offer DC Universe as a standalone service as it prepares HBO Max for launch\n\nThe project is open for pitches from Thursday to November 18. Anyone in the US who is 18-years-old or over and a member of the Ideas United network can submit ideas. Those interested can register with Ideas United here and learn more about the the project at DCUunscripted.com.\n\n“During the submission process, talent and fan enthusiasts alike will be able to submit their unscripted/reality video series ideas ranging from game shows to game play to hot food and hot takes,” DC Universe said.\n\nThose who pitched the top 10 entries will be able to meet industry professionals in Los Angeles. From there, the top three finalists will have their ideas produced by Ideas United and the overall winner’s series will launch on DC Universe.\n\nDC Universe launched last September and has since released four original series, with the adult animated series “Harley Quinn” and the live-action “Stargirl” on the docket. The second season of its first original, “Titans,” debuted last month. “Doom Patrol” season two and “Young Justice: Outsiders” season four are also in the works.\n\n“Swamp Thing” is the only DC Universe original to be canceled so far. It was cut after one season, despite positive reviews and a big investment in the series. Speculation swirled after the cancellation that DC Universe would be folded into Warner Media’s upcoming streaming service, HBO Max, but there are no immediate plans for that.", "description": "Business Insider - The streaming service DC Universe, a hub for DC superhero fans, announced the new initiative at New York Comic Con on Thursday.. Read more at businessinsider.my", "authors": ["Travis Clark", "Business Insider Us"], "top_image": "https://static.businessinsider.my/sites/3/2019/10/5d94fc3531c9690e881edaf7.png", "published_at": "2019-10-04"}