{"pub": "independent", "url": "https://independent.co.uk/independentpremium/israel-election-results-netanyahu-government-a9110841.html", "downloaded_at": "2019-09-18 23:46:18.794466+00:00", "title": "‘The spell has been broken’: Netanyahu the ‘wizard’ has lost his magic touch and Israel will forever be changed", "language": "en", "text": "No one was chanting “magician” when a hoarse Benjamin Netanyahu took to the stage of his half-empty elections headquarters at 3am on Wednesday.\n\nThere was no impassioned kiss with his wife Sara, no cascade of blue and white glitter, no indoor towering fireworks like the last time.\n\nInstead, he stood at the podium alone to deliver a speech where he appeared to completely ignore reality by refusing to concede defeat in Tuesday’s unprecedented second elections.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHis wife and leading members of his party (including those rumoured to be trying to take his throne) smiled woodenly.\n\nDespite mounting one of the fiercest campaigns of his career, promising everything from annexing the entire West Bank to delaying the vote to launch a war with Gaza, the exit polls, and later partial results, showed a slim defeat to his archrival: the centrist Blue and White party.\n\nWorse still, the polls showed his right-wing bloc fell significantly short of the 61 seats needed to form a ruling coalition.\n\nInstead of the usual cries of “King Bibi” and “wizard”, a few hundred supporters chanted against the prospects of a unity government: an idea being pushed by his arch-rival Benny Gantz, the ex-army chief behind Blue and White, which would likely see Mr Netanyahu excluded.\n\nNetanyahu’s troublesome ex-defence Minister Avigdor Lieberman, who scuppered his coalition-building attempt earlier this year, also threw his weight behind the unity idea.\n\n“Israel needs a strong and Zionist government. There won’t, and cannot be, a government that relies on anti-Zionist Arab parties that deny the very existence of Israel as a Jewish and democratic state,” the prime minister said pulling out his one final card: fear of the left.\n\nBut it fell flat against the echoing walls and platters of uneaten sandwiches: the wizard of diplomacy and elections had finally run out of spells.\n\nDahlia Scheindlin, a prominent pollster who has worked on seven elections campaign, said that while the final results were still unknown, the “one thing that is certain: it is not a win for Netanyahu”.\n\n“In his speech he doesn’t seem to realise the campaign over,” she continued.” He doesn’t seem to realise people voted already. He is not going to improve his bargaining position.”\n\nMr Netanyahu had sought a clear victory with his right-wing partners to secure immunity from three expected corruption trials.\n\nThe only way for him to form that right-wing immunity government would be to try to tempt Mr Lieberman, whose party Yisrael Beiteinu secured nine seats, to rejoin the fold.\n\nBut Scheindlin pointed out that would mean offering mind-boggling concessions given Mr Lieberman has already announced he would only back a unity government with Blue and White.\n\nOtherwise, Mr Netanyahu would have to consent to an alliance with Blue and White who have said they would join forces with Likud but not if Netanyahu is in power.\n\nThe options for staying in power remain extremely limited.\n\nAnd so Anshel Pfeffer, an expert on the prime minister, who wrote biography The Turbulent Life and Times of Benjamin Netanyahu, said that for first time in a decade it appeared that there might be a new era post Netanyahu. If so it would spark a paradigm shift in Israeli politics.\n\nNetanyahu is the longest-serving premier in Israel’s history, having been in office since 2009, surpassing in July even the country’s founding father Ben Gurion.\n\n“The feeling that he can do whatever he wants, that he is a magician and all-powerful disappeared last night,” Pfeffer told The Independent.\n\n“Israeli politics have been built around Netanyahu. The Likud will no longer be the same party. The whole Right will have to reinvent itself,” he said.\n\nEven the centre and left would have to find a new identity after sculpting their position as one entirely determined by their opposition to Netanyahu, he continued.\n\n“Israeli politics has been defined not by ideology but by how much parties love or hate Netanyahu.”\n\nSo what next if he is pushed from power?\n\nShape Created with Sketch. Israel election: Netanyahu battles to hang on to power Show all 20 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Israel election: Netanyahu battles to hang on to power 1/20 An Israeli man holding his dog casts his ballot EPA 2/20 Chief Rabbi of the Vizhnitz (Hasidic Dynasty) Israel Hager (left), casts his ballot AFP/Getty 3/20 Israeli Prime Minister Benjamin Netanyahu and his wife Sara casts their votes AFP/Getty 4/20 A man takes a selfie with his mobile phone as he casts his ballot Reuters 5/20 AFP/Getty 6/20 Israel's former defence minister Avigdor Lieberman and his wife Ella cast their ballots AFP/Getty 7/20 Israeli children accompany their father during Israel's parliamentary election at a polling station AFP/Getty 8/20 Blue and White party leader Benny Gantz and his wife Revital vote AP 9/20 Israeli Prime Minister Benjamin prepares to vote AP 10/20 A family votes in the settlement of Tekoa AP 11/20 Ballots lies on a table AFP/Getty 12/20 Israel's former justice minister Ayelet greets supporters after casting her ballot AFP/Getty 13/20 AFP/Getty 14/20 A mother takes a photograph of her daughter near a ballot box Reuters 15/20 Children stand with their relative as they place his vote in a ballot box Reuters 16/20 A woman holds her dog's leash as she prepares to vote Reuters 17/20 AFP/Getty 18/20 AFP/Getty 19/20 Israel's head of the Joint List alliance Ayman Odeh casts his ballot accompanied by his family AFP/Getty 20/20 EPA 1/20 An Israeli man holding his dog casts his ballot EPA 2/20 Chief Rabbi of the Vizhnitz (Hasidic Dynasty) Israel Hager (left), casts his ballot AFP/Getty 3/20 Israeli Prime Minister Benjamin Netanyahu and his wife Sara casts their votes AFP/Getty 4/20 A man takes a selfie with his mobile phone as he casts his ballot Reuters 5/20 AFP/Getty 6/20 Israel's former defence minister Avigdor Lieberman and his wife Ella cast their ballots AFP/Getty 7/20 Israeli children accompany their father during Israel's parliamentary election at a polling station AFP/Getty 8/20 Blue and White party leader Benny Gantz and his wife Revital vote AP 9/20 Israeli Prime Minister Benjamin prepares to vote AP 10/20 A family votes in the settlement of Tekoa AP 11/20 Ballots lies on a table AFP/Getty 12/20 Israel's former justice minister Ayelet greets supporters after casting her ballot AFP/Getty 13/20 AFP/Getty 14/20 A mother takes a photograph of her daughter near a ballot box Reuters 15/20 Children stand with their relative as they place his vote in a ballot box Reuters 16/20 A woman holds her dog's leash as she prepares to vote Reuters 17/20 AFP/Getty 18/20 AFP/Getty 19/20 Israel's head of the Joint List alliance Ayman Odeh casts his ballot accompanied by his family AFP/Getty 20/20 EPA\n\nThe group most severely impacted by this change would be the Ultraorthodox, who have been the most loyal supporters of Mr Netanyahu.\n\nHe, in turn, has protected their interests including not approving changes to military draft regulations forcing Orthodox young men into conscription.\n\nThat will change if Mr Lieberman, who has called for a secular unity government, and Benny Gantz, a former army chief, is in power.\n\nThe other group who may be the most affected are the Arab and Palestinian citizens of Israel.\n\nThe Arab Joint List, which is currently coming in third with 13 seats, would for the first time in history become the official opposition if the Likud and Blue and White, the two biggest parties, form a unity government.\n\n“It will redefine Arab Israeli politics. As the official opposition they would have briefings with the prime minister, get a designated office, be given the right to respond,” Pfeffer explained.\n\n“It would put them in the public eye in a way that Arab parties have never been before.”\n\nFor now, the scramble to build a coalition continues and Mr Netanyahu is not backing down.\n\nBut as Pfeffer concludes, one thing is for certain: “His spell has been broken.”", "description": "No one was chanting “magician” when a hoarse Benjamin Netanyahu took to the stage of his half-empty elections headquarters at 3am on Wednesday. There was no impassioned kiss with his wife Sara, no cascade of blue and white glitter, no indoor towering fireworks like the last time.", "authors": ["Bel Trew"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/18/16/rtx73epx.jpg", "published_at": "2019-09-18"}