{"pub": "investing.com", "url": "https://newsbtc.com/2019/09/19/ethereum-uptrend-remains-strong-as-bitcoin-falters", "downloaded_at": "2019-09-19 23:50:11.609912+00:00", "title": "Ethereum Uptrend Remains Strong as Bitcoin Falters", "language": "en", "text": "Ethereum (ETH) has been incurring significant upwards momentum over the past several days and weeks and has been able to sustain its upwards momentum despite the drop in the aggregated crypto markets that occurred over the past 24-hours.\n\nThis upwards momentum has allowed the cryptocurrency to surge to fresh monthly highs, and analysts are now noting that ETH may be able to drag the entire crypto markets up during the next coming days and weeks.\n\nEthereum Surges Past $220 as Bulls Roar\n\nAt the time of writing, Ethereum is trading up over 4% at its current price of $222.87, which marks a significant surge from its recent lows of $175 that were set last week.\n\nThis upwards momentum has proven to be very positive for the aggregated crypto market and has come as most other major altcoins are surging higher.\n\nAs for what could be driving this upwards surge, multiple analysts have pointed to improving fundamentals as one potential catalyst for an ETH bull run, while others have also noted that multiple metrics may be pointing to the possibility that ETH is currently being accumulated by investors.\n\nSentiment, a crypto market insights provider, spoke about this in a recent tweet, pointing to declining ETH token circulation and a declining “active coin” number as signs that Ethereum is currently being accumulated.\n\n“There’s also a number of metrics suggesting accumulation: 1. Token Circulation (# of unique ETH being used each day) continues to decline over the past 5 months… 2. Ethereum’s maximal mean age (avg. age that each coin has remained in its current address) continues to rise… 3. # of active coins over a period of 90 days has begun to decline as of recently,” they explained in the thread seen below.\n\n3. # of active coins over a period of 90 days has begun to decline as of recently: Source: https://t.co/rGvvCISdBM pic.twitter.com/YINCPRAAHC — Santiment (@santimentfeed) September 18, 2019\n\nWill ETH Extend Its Upwards Momentum?\n\nBecause Bitcoin is currently trading sideways in the lower-$10,000 region, it is highly likely that any upwards BTC movement could further perpetuate ETH’s momentum and send it surging even higher.\n\nBig Cheds, a popular crypto analyst on Twitter, spoke about Ethereum in a recent tweet, explaining that its latest upwards movement marks a notable breakout over its upper Bollinger Band, which may mean that further gains are imminent.\n\n“$ETH #Ethereum – 4 hour – Big breakout,” he explained.\n\nThe coming hours may prove to be quite illuminating for ETH’s near-term price action, as Bitcoin’s price action may ultimately bolster ETH’s current surge and could allow it to post significantly higher gains.\n\nFeatured image from Shutterstock.", "description": "Analysts are noting that multiple metrics signal that Ethereum is currently undergoing an accumulation period, which may justify further gains for ETH.", "authors": [], "top_image": "https://www.newsbtc.com/wp-content/uploads/2019/09/shutterstock_1030451626-5-1200x780.jpg", "published_at": "2019-09-19"}