{"pub": "fox", "url": "https://foxbusiness.com/markets/steven-mnuchin-fundamental-agreement-china-trade", "downloaded_at": "2019-10-14 23:20:00.183298+00:00", "title": "Mnuchin insists US reached 'fundamental agreement' in China trade talks", "language": "en", "text": "Treasury Secretary Steven Mnuchin on Monday insisted the U.S. and China had reached a \"fundamental agreement ... subject to documentation\" during trade talks in Washington last week.\n\nContinue Reading Below\n\n\"We made substantial progress last week in the negotiations,\" Mnuchin told CNBC. \"China has agreed on agriculture that they're gonna take off tariffs on agriculture ... We've reached a fundamental agreement.\"\n\nU.S. tariff hikes set to be levied on Chinese goods on Oct. 15 were put off because of the negotiations, and Mnuchin said he anticipates not moving forward with Dec. 15 tariffs because he believes a deal will be in place by then.\n\nMnuchin said financial services were dealt with in phase one while other aspects of the services market would be dealt with in phase two.\n\nThe Treasury secretary explained how the next round of negotiations will move forward now that bargaining on phase one of a trade deal was on the books.\n\n\"The next phase of deputy level calls is going on this week. [U.S. Trade Representative Robert] Lighthizer and myself will have a principal level call with Vice Premier [Liu He] next week,\" Mnuchin said, adding that the two sides will \"meet in Chile to finish the deal\" during the Asian-Pacific Economic Cooperation meetings in mid-November.\n\nHe pushed back against the notion that the deal was still up in the air, after state-owned newspaper China Daily wrote that \"Champagne should probably be kept on ice, at least until the two presidents put pen to paper.\"\n\nThe phase one agreement came days before customs data released Monday by Beijing showed Chinese exports to the U.S. fell 17.8 percent to $36.5 billion in September, evidence the trade war is taking a toll on the world's second-largest economy. The U.S. is the biggest buyer of Chinese goods.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nFOX Business' Jonathan Garber contributed to this report.", "description": "Mnuchin explained how the next round of negotiations will move forward.", "authors": ["Evie Fordham"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/AP19252464275663.jpg?ve=1&tl=1", "published_at": "2019-10-14"}