{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/breaking-missing-joy-morgan-body-20554447", "downloaded_at": "2019-10-10 18:40:33.091335+00:00", "title": "Missing Joy Morgan: Body found in woodland confirmed as murdered student midwife", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA body found in woodland has been confirmed as murdered student midwife Joy Morgan.\n\nPolice were called by a member of the public at 7.43am on Saturday 5 October to report they had found what they suspected to be a human body in Stevenage.\n\nThe body was found in woodland just outside of an area previously searched by officers.\n\nIt has now been confirmed that the body is that of Joy Morgan, described by her mum as a 'star' in a devastating tribute.\n\nJoy, 20, who was living in Hatfield was last seen in Ilford on 26 December 2018 when she attended a church event.\n\nIn February of this year she was reported missing after she failed to attend her studies at the University of Hertfordshire.\n\n(Image: INS News Desk/INS News Agency Ltd)\n\n(Image: Margesson Photography / Archant)\n\nA fellow church goer was subsequently arrested and charged with her murder.\n\nIn August this year, Shohfah El-Israel, 40, of London, was found guilty of her murder.\n\nHe is currently serving a life sentence with a minimum term of 17 years.\n\nEl-Israel refused to reveal where her body was dumped despite her family's pleas.\n\n(Image: PA)\n\nA post-mortem carried out on Tuesday could not establish the cause of death and further tests will be carried out.\n\nDetective Chief Inspector Justine Jenkins, from the Bedfordshire, Cambridgeshire and Hertfordshire Major Crime Unit, said: \"My thoughts are with Joy’s family at this difficult time and while nothing can end their pain, I hope that this gives them closure and I am glad that they will now have the opportunity to say goodbye to Joy.\"\n\nCarol Morgan, Joy’s mum, said: \"Joy was so beautiful and completely lived up to her name – she brought joy to all our lives.\n\n\"Our family has been living a nightmare and we miss her so, so much.\n\n\"Joy was studying to be a midwife and would have graduated by now.\n\n\"I know she would have been amazing as a midwife.\n\n\"I was so proud of her and I always will be. She was our star.\"", "description": "A body was found by a member of the public in Stevenage, just outside of an area previously searched by officers", "authors": ["Danya Bazaraa", "Image", "Hertfordshire Police", "Ins News Desk Ins News Agency Ltd", "Margesson Photography", "Archant", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20528604.ece/ALTERNATES/s1200/0_BREAKING-Missing-Joy-Morgan-Police-searching-for-murdered-student-midwife-find-body-in-woodland.jpg", "published_at": "2019-10-10"}