{"pub": "time", "url": "https://time.com/4433139/healthy-snack-ideas-that-fill-you-up", "downloaded_at": "2019-10-22 20:38:17.493694+00:00", "title": "9 Foods That Help Prevent Snacking", "language": "en", "text": "Some experts say the whole concept of “healthy snacking” is an oxymoron. The human body, they argue, wasn’t built to accommodate the average American’s habit of cramming in snacks between meals. “Even three meals [a day] might be too much,” says Dr. Valter Longo, director of the University of Southern California’s Longevity Institute.\n\nOthers agree. Bouts of fasting, or giving your gut extended breaks from food digestion, may fire up all sorts of disease-limiting, life-extending cellular processes, says Luigi Fontana, a professor of nutritional science at Washington University in St. Louis and Italy’s University of Brescia.\n\nSo if you think stocking healthy foods means you can raid the fridge or cabinet any time and engage in some guilt-free noshing, Longo and Fontana would argue otherwise.\n\nBut if you just can’t make it until your next meal, there are some science-backed appetite appeasers that, even in small doses, should tide you over.\n\nSauerkraut\n\nA pile of research suggests fermented foods support your gut’s microbiotic health. In particular, a type of bacteria called Lactobacillus—often used to make the fermented cabbage dish sauerkraut—can help quiet your appetite and may also improve your body’s ability to regulate blood sugar. Just be sure the sauerkraut you pick up isn’t loaded with sugar.\n\nPistachios\n\nIn both healthy adults and those suffering from metabolic diseases like diabetes, eating pistachios helps knock down hunger while supporting healthy post-meal insulin responses. One 2015 study found people who added pistachios to their diets for 10 weeks had healthier levels of blood fatty acids. The authors of that 2015 credit a pistachio’s monounsaturated and polyunsaturated fatty acids for the nut’s health perks.\n\nChickpeas\n\nCrack open the hummus and grab some falafel! Adding chickpeas and other legumes to a meal or snack can help you feel up to 31 percent fuller, research shows. (How do they measure this stuff?) Gut health and bowel function also improve among regular chickpea eaters, found a recent study from Australia.\n\nSpinach\n\nIt isn’t the sexiest snack food. But spinach and other leafy greens are packed with plant membranes called “thylakoids” that increase fullness and cut your cravings for sweet treats, according to a 2015 study from Swedish researchers. Just don’t boil your spinach; you’ll knock out three-quarters of its nutrient content.\n\nBeans\n\nLoaded with digestion-slowing fiber and satisfying protein, beans are one of the first foods dieticians mention when asked about ultra-filling foods that can help curb your hunger. Even among those not trying to lose weight, adding beans to their diets resulted in lost pounds, found a 2016 study in the American Journal of Clinical Nutrition.\n\nGinger\n\nThere’s far, far too much talk these days about foods that can “rev your metabolism.” But there’s some strong data to suggest certain compounds in ginger—much like the capsaicin found in spicy peppers—can increase your body’s metabolic rate while simultaneously reducing your appetite. Try grating some fresh ginger onto your spinach or beans.\n\nEggs\n\nA hardboiled egg might be the most filling snack on the planet. Eggs are a complete source of protein amino acids. They also quiet down the gut hormone ghrelin, which triggers hunger and cravings. Yes, it’s okay to eat egg yolks again, experts now say.\n\nPopcorn\n\nBelieve it or not, popcorn is an antioxidant rich, stomach-filling whole grain. Even though a small bowl of it is mostly air, the sight of it helps fool your brain into believing you’ve had a big snack, which helps quell your appetite. Just prepare your own air-popped kernels on the stove; the pre-bagged microwave varieties tend to come coated with all kinds of unhealthy chemicals, experts warn.\n\nCoffee\n\nIt’s probably not the first thing you’d reach for when hunger comes calling. But drinking brewed coffee can lower your gut’s levels of the appetite-fueling hormone ghrelin, according to a recent study from German and Austrian researchers. More research has linked coffee to lower body weights and longer lives.\n\nContact us at editors@time.com.", "description": "If you can’t make it until your next meal, there are some science-backed appetite appeasers that, even in small doses, should tide you over.", "authors": ["Markham Heid"], "top_image": "https://timedotcom.files.wordpress.com/2015/11/50-healthiest-foods-popcorn.jpg?quality=85&w=1200&h=628&crop=1", "published_at": "2015-11-05"}