{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/syria-kurds-vow-form-human-shields-fend-looming-push-191007205116067.html", "downloaded_at": "2019-10-07 23:31:33.866841+00:00", "title": "Syria: Kurds vow to form 'human shields' to fend off looming push", "language": "en", "text": "Kurdish civilians in northeastern Syria are planning to stage open-ended sit-ins in areas near the border with Turkey in response to a looming Turkish military operation, according to local activists and journalists.\n\nSitting in \"huge tents\", people of all ages have begun gathering in the towns of Ras al-Ain, Tal Abyad and Kobane.\n\n\"[They] want to stand as human shields to prevent a Turkish advance,\" said Arin Sheikhmous, an activist based in Qamishli, where hundreds also gathered outside a United Nations office to call for international action.\n\nThe gatherings on Monday came a day after the United States announced its decision to withdraw troops from the northeastern region.\n\n191007145220366\n\nWashington's move cleared the way for Ankara to launch its long-threatened offensive and left the Kurdish-led Syrian Democratic Forces (SDF) across the border at risk of being attacked by Turkey, which considers them as \"terrorists\".\n\nAnkara is yet to reveal the exact scope of its planned incursion, but has long said it wants to create a so-called \"safe zone\" into neighbouring Syria's northeast region. It has previously suggested it would carry out operations east of the Euphrates River.\n\nThe SDF, which spearheaded the US-led campaign against ISIL, described Washington's withdrawal announcement as a \"stab in the back\" but promised to \"defend our land at all costs\".\n\nFounded in 2015, the SDF says it wants to create an autonomous federation in northern Syria along the lines of the Rojava region. The umbrella group's makeup largely consists of Kurdish YPG fighters and smaller groupings of Arab, Turkmen and Armenian forces. It now controls a vast area stretching 480km (300 miles) from east of the Euphrates to the border with Iraq - about a quarter of Syria.\n\nAccording to Sheikhmous, all segments of society in the region including Kurds, Arabs and Syriacs - an ancient Christian population - oppose a possible Turkish incursion.\n\n\"We're all scared because if Turkey sets foot in the area, then there will be massacres,\" the 31-year-old said.\n\nThere are nearly five million people in the northeastern region, including hundreds of thousands of internally displaced Syrians who fled government-led offensives in other parts of the war-torn country, according to local officials.\n\n\"It's the only area that has been spared from an all-out destructive offensive in the country's civil war,\" Sheikhmous said. \"And we want to keep it this way.\"\n\n'Secure our border'\n\nAnkara, which considers the YPG-led SDF an extension of the outlawed Kurdistan Workers' Party (PKK), has long made it clear it wants to clear the border area from \"terrorist elements\".\n\n191007141408983\n\nThe PKK has waged a decades-long armed campaign for autonomy in Turkey, in a conflict that has killed an estimated 40,000 people.\n\nTurkey also says it wants to implement the \"safe zone\", stretching 32km (20 miles) into Syria's northeast region, to create the necessary conditions for the return of some two million of the more than 3.6 million refugees it hosts on its soil.\n\n\"Our goal is to secure our border, just as any country cares about their border security,\" Ibrahim Kalin, spokesman for Turkish President Recep Tayyip Erdogan, told Al Jazeera on Monday.\n\n\"We have to take care of our border security and make sure the Syrian refugees go back to their homes that they've come from, securely and voluntarily.\"\n\nThe looming Turkish move comes less than two years after Ankara's second foray in northern Syria where it seized Afrin, west of the Euphrates.\n\nKurdish officials said in March 2018 the operation forced some 150,000 people to flee, while over the last year or so locals and rights groups have accused Turkish-backed militias of committing a series of abuses against civilians, including arbitrary detentions and enforced disappearances.\n\n\"In Afrin, we saw atrocities that we cannot allow our children to go through,\" Sheikhmous said.\n\nFor its part, Turkey says its incursion brought stability to the region and enabled the return of hundreds of thousands of refugees.\n\nStill, for people at the Ras al-Ain sit-in, the threatened operation was a cause of major concern.\n\n\"Older men here especially, who have developed a strong connection to the land, fear that a Turkish assault will inevitably lead to demographic change of the whole region,\" local journalist Baderkhan Ahmed told Al Jazeera.\n\n\"This is why civilians are promising to remain here for days,\" he said. \"They're worried about the fate of their sons, their daughters and their homes.\"\n\nKalin, however, said on Monday Ankara had \"no interest\" in occupying or changing the demographics in northeastern Syria.\n\nAccording to Wladimir van Wilgenburg, an expert on Kurdish politics in Syria, a Turkish offensive would potentially displace thousands of people.\n\n\"Already some civilians started to flee to other cities further away from the border, ahead of a potential Turkish assault,\" he said.\n\nAhmed, meanwhile, said that many at the Ras al-Ain sit-in expressed worries over the lack of safer areas to flee towards, with many saying they would resort to heading towards Deir Az Zor and Raqqa in the centre of the northeastern region and others suggesting they may seek crossing over to the Kurdish-controlled Iraqi north.\n\n'Heavy price'\n\nAlthough US President Donald Trump defended his surprise decision to withdraw US troops from northern Syria - a move slammed by both Republicans and Democrats in the US - he also threatened to \"destroy and obliterate\" Turkey's economy if Ankara went \"off limits\".\n\n191007155006383\n\nMeanwhile, the UN said it was \"preparing for the worst\" while the European Union warned Turkey's expected move would \"exacerbate civilian suffering\", cause \"massive displacement\" and undermine political efforts to end Syria's long-running war.\n\nInternational aid groups such as Save the Children also expressed \"deep concern\" and called for \"urgent steps\" to ensure the safety of civilians.\n\nYet, Kurds in Syria said they still felt abandoned.\n\n\"This area paid a heavy price in its fight against ISIL,\" Evin Berdevk, a Kurdish women's rights activist in Syria, told Al Jazeera.\n\n\"We managed to defeat an entity that attempted to take us back to the dark ages,\" she said, referring to the victory over ISIL after fierce battles that saw the SDF lose 11,000 of its fighters.\n\n\"We have borne the brunt of it,\" Berdevk added.\n\n\"This is why we thought at least, we'd get the support we deserve from the world ... But what we fear now is total extermination.\"", "description": "Turkey has long warned of operation in the region to set up 'safe zone' to host Syrian refugees and push out enemies.", "authors": ["Farah Najjar"], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/7/b29389fb9d524da298973bcaa9b41bbb_18.jpg", "published_at": "2019-10-07"}