{"pub": "breitbart", "url": "https://breitbart.com/news/missouri-agency-tracked-planned-parenthood-patients-periods", "downloaded_at": "2019-10-30 00:09:58.991408+00:00", "title": "Missouri agency tracked Planned Parenthood patients’ periods", "language": "en", "text": "ST. LOUIS (AP) — Missouri’s health department director on Tuesday said he tracked the menstrual cycles of Planned Parenthood patients as part of an effort to identify what the agency says were “failed abortions” at a St. Louis clinic.\n\nDepartment of Health and Senior Services Director Randall Williams made the revelation during the second day of an administrative hearing to determine whether Missouri’s only abortion clinic will lose its license to perform the procedure.\n\nWilliams said an investigator made a spreadsheet at his request that included the dates of patients’ last periods, The Kansas City Star reported. He said the goal was to find women who needed multiple procedures to complete an abortion.\n\nThe head of the St. Louis clinic called the move “deeply disturbing.”\n\n“Missouri’s top health official, Randall Williams, scrutinized menstrual cycles of women in this state in order to end abortion access,” Yamelsie Rodriguez, president and CEO of Reproductive Health Services of Planned Parenthood of the St. Louis Region, said in a statement.\n\nMissouri House Minority Leader Crystal Quade, a Democrat from Springfield, called for an investigation to see if patient privacy was compromised or if laws were broken. She also was critical of Williams’ actions.\n\n“State law requires the health department director to be ‘of recognized character and integrity,'” Quade said in a statement. “This unsettling behavior calls into question whether Dr. Williams meets that high standard.”\n\nThe state had moved to revoke the clinic’s license in June, citing concerns about a series of “failed abortions,” and a lack of cooperation from some of the doctors involved.\n\nWhile Williams said concerns about the clinic are “grave,” he said the issues are “imminently fixable.” He believes there are solutions that both the state and Planned Parenthood would agree to that would allow for licensure.\n\nPlanned Parenthood says there are no deals on the table.\n\nWrangling over the license began when an investigator involved in a March inspection of the clinic found that a woman had undergone an abortion that took five attempts to complete. William Koebel, director of the section of the health department responsible for abortion clinic licensing, said Monday that the clinic failed to provide a “complication report” for that incident.\n\nThat failure led the health department to launch an investigation of other instances where women were required to undergo multiple procedures before an abortion was completed, Koebel said.\n\nAs part of that investigation, the state obtained medical records of women who had abortions at the clinic. They found four women who required multiple procedures, including one where the physician apparently missed that a woman was pregnant with twins. The woman underwent two procedures five weeks apart.\n\nPlanned Parenthood officials contend the state “cherry-picked” a handful of difficult cases out of thousands of otherwise successful abortions. They have accused the state of using the licensing process as a tool to eliminate abortions in Missouri, saying the state is among several conservative-led states seeking to end abortion through tough new laws and tighter restrictions.\n\nThe Administrative Hearing Commission isn’t expected to rule on the licensing issue until February at the earliest. In the meantime, the clinic remains open.\n\nMissouri would become the first state since 1974, the year after the Supreme Court’s Roe v. Wade decision, without a functioning abortion clinic if the license is revoked.\n\nMissouri is among several states to pass new restrictions on abortions in the hope that the increasingly conservative U.S. Supreme Court will eventually overturn Roe v. Wade. Gov. Mike Parson, a Republican, signed legislation in May banning abortions at or beyond eight weeks of pregnancy, with exceptions for medical emergencies but not for rape or incest. The law is on hold while a legal challenge plays out in court.\n\nWhile the Missouri case unfolded, Planned Parenthood quietly built a new abortion clinic in Illinois, just across the Mississippi River from St. Louis, in part to meet demand from Missouri residents. The clinic in Fairview Heights opened Wednesday.\n\nMissouri women have been increasingly getting abortions at the Hope Clinic for Women in Granite City, Illinois, another St. Louis suburb. Deputy Director Alison Dreith said 58% of the abortions performed at the Hope Clinic through August of this year involved Missouri women, compared with 37% involving Illinois women.\n\nAnother abortion clinic sits in Overland Park, Kansas, a Kansas City suburb. The clinic is 2 miles (3 kilometers) from the state line. Information from the state of Kansas shows about 3,300 of the 7,000 abortions performed there last year involved Missouri residents.", "description": "ST. LOUIS (AP) — Missouri's health department director on Tuesday said he tracked the menstrual cycles of Planned Parenthood patients as part of an effort", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/29/b67fed_abortion-missouri-24147-sreenivasa-rao-dandamudi-left-commissioner-missouri-640x335.jpg", "published_at": "2019-10-29"}