{"pub": "mirror", "url": "https://mirror.co.uk/news/us-news/policeman-called-fruity-told-tone-20754152", "downloaded_at": "2019-10-30 02:25:05.858715+00:00", "title": "Policeman called 'fruity' and told to tone down his 'gayness' gets £14.7m payout", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA police sergeant who was told to tone down his 'gayness' to get a promotion has won a £14.7million payout.\n\nKeith Wildhaber was passed over for promotion 23 times, with his superiors reportedly believing he was 'way too out there with his gayness'.\n\nIn 2014, Sgt Wildhaber, who is gay, was told to tone down his homosexuality by police commissioner board member John Saracino, it is claimed.\n\nThe policeman told a court: \"It was devastating to hear.\"\n\nHe added that it felt like he had been 'punched in the gut', according to the BBC .\n\n(Image: Universal News And Sport (Europe))\n\nSt Louis County Police Department chief, Guy Means, reportedly told one witness that Sgt Wildhaber was 'way too out there with his gayness' and called him 'fruity'.\n\nAfter complaining, the sergeant was moved to the midnight shift at a police station further away from his home.\n\nHe was awarded £14.7million in damages for discrimination and being the victim of retaliation.\n\nSt Louis County Council's county executive tweeted: \"Our police department must be a place where every community member and every officer is respected and treated with dignity.\n\n\"Employment decisions in the department must be made on merit and who is best for the job.\n\n\"The time for leadership changes has come and change must start at the top. We will begin with the appointment of new members to the police board, which oversees the police chief.\"\n\nMr Saracino reportedly declined to comment.", "description": "Police sergeant Keith Wildhaber won £14.7million after he was discriminated against by St Louis County Police Department", "authors": ["Matthew Dresch", "Image", "Universal News And Sport", "Europe"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20754148.ece/ALTERNATES/s1200/0_US-officer-told-to-tone-down-gayness-wins-$19m.jpg", "published_at": "2019-10-30"}