{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/23/1933741/0/en/Integra-Resources-SEDAR-Files-NI-43-101-Technical-Report-for-the-DeLamar-Project-Preliminary-Economic-Assessment.html", "downloaded_at": "2019-10-23 10:04:40.697435+00:00", "title": "Integra Resources SEDAR Files NI 43-101 Technical Report for the DeLamar Project Preliminary Economic Assessment", "language": "en", "text": "Preliminary Economic Assessment Highlights:\n\n\n\nAfter-tax NPV (5%) of C$472 million (US$358 million) and 43% After-Tax IRR at US$1350/oz Au and US$16.90 /oz Ag\n\nProduction scenario focused primarily on resources amenable to heap leaching with a proposed 27,000 tonne per day heap leach facility complemented by a 2,000 tonne per day milling facility\n\nYear 2 to 6 average annual production of 148,000 oz AuEq (126,000 oz Au and 1,796,000 oz Ag)\n\nLife-of-mine (“LOM”) all-in sustaining cash costs (“AISC”) of US$619/oz net of silver by-product or US$742/oz on an AuEq co-product basis\n\nInitial capital expenditure (“Capex”) of C$213 million (US$161 million).\n\nVANCOUVER, British Columbia, Oct. 22, 2019 (GLOBE NEWSWIRE) -- Integra Resources Corp. (TSXV:ITR ; OTCQX:IRRZF) (the “Company” or “Integra”) is pleased to announce that it has filed on SEDAR the independent NI 43-101 Technical Report (the “Report”) for the maiden Preliminary Economic Assessment (“PEA”) for the DeLamar Gold-Silver Project located in southwest Idaho, USA.\n\nThe Report filed today contemplates a production scenario that outlines surface oxide and transitional mineralization at the Florida Mountain and DeLamar Deposits within an overall resource that can be processed by heap leaching. A further component of milling is anticipated to process mineralization from the unoxidized mineralization at Florida Mountain. The PEA was completed by Mine Development Associates (“MDA”) of Reno, NV, conducted under the direction of Timothy Arnold, Integra’s Vice President of Project Development, and includes contributions from the consulting teams at McClelland Laboratories (Reno) (“McClelland”), Woods Process Services (Denver) (“Woods”), Welsh Hagen (Reno) (“WH”) and EM Strategies (Reno) (“EMS”). The PEA Report is available on SEDAR under the Company’s profile, and on the Company’s website at:\n\nhttps://www.integraresources.com/site/assets/files/2572/pea_ni43-101delamarfloridamtn2019_oct_22_2019_final.pdf\n\nThe 2019 PEA, which includes resources from the Company’s Updated Resource Estimate (please click the following link: https://integraresources.com/site/assets/files/2663/2019-06-17_nr_itr_t7hg7g9s.pdf ), demonstrates the robust economics of the project. Assuming a gold price of US$1,350 per ounce, and a discount rate of 5%, the DeLamar Project’s estimated after-tax NPV is C$472.0 M and after-tax IRR is 43%. The payback period for DeLamar is 2.4 years after-tax. As is common, Project economics are sensitive to metal price assumptions, though remain very viable in the downside case and extremely robust in the upside case, as seen in Table 2 below and in the sensitivity analysis in the Report.\n\nEconomic and Operational Highlights\n\nTable 1. Overview of PEA Technical Inputs and Financial Assumptions\n\nDELAMAR PEA: Technical Inputs and Financial Assumptions Economic Assumptions Gold Price US$1,350/oz Silver Price US$16.90/oz Exchange Rate (C$/US$) 1.32 Discount Rate 5% Contained Metals Contained Gold ounces 1,243,820 Contained Silver ounces 46,129,538 Contained AuEq ounces 1,821,293 Mining Mine Life 10 years Open Pit Mining Rate: min/waste tpd 53,751 Strip Ratio (Waste: Mineralization) 1.09 Total Tonnage Mined (t) 196,190,238 Total Mineralized Material Mined (t) 93,749,888 Processing Processing Throughput: Heap-leaching /Milling 27,000 tpd / 2,000 tpd Average Diluted Gold Grade (g/t) - HL 0.39 g/t Average Diluted Silver Grade (g/t) - HL 15.21 g/t Average Diluted AuEq Grade (g/t) - HL 0.58 g/t Average Diluted Gold Grade (g/t) - Milling 0.80 g/t Average Diluted Silver Grade (g/t) - Milling 17.18 g/t Average Diluted AuEq Grade (g/t) - Milling 1.02 g/t Production Gold Recovery: Heap-leaching/Milling 83% / 90% Silver Recovery: Heap-leaching/Milling 34% / 80% LOM Payable Gold ounces 1,031,179 LOM Payable Silver ounces 16,602,692 LOM Payable AuEq ounces 1,239,020 Years 1-10 Avg Annual Production - Gold 103,118 Years 1-10 Avg Annual Production - Silver 1,660,269 Years 1-10 Avg Annual Production - AuEq 123,902 Years 2-6 Avg. Annual Production - Gold 125,989 Years 2-6 Avg. Annual Production - Silver 1,795,845 Years 2-6 Avg. Annual Production -AuEq 148,471 Operating Costs per Tonne Mining Costs ($/t mined) US$2.00 Mining Costs ($/t processed) US$4.18 Processing Costs ($/t processed) – Heap Leach US$2.79 Processing Costs ($/t processed) – Milling US$9.07 Processing Costs ($/t processed) – Combined US$3.08 G&A Costs ($/t processed) US$0.55 Total Site Operating Cost ($/t processed) US$7.82 Cash Costs and All-in Sustaining Costs LOM Cash Cost ($/oz) Au, net-of-silver by-product US$469/oz LOM Cash Cost ($/oz) AuEq, co-product US$617/oz LOM AISC ($/oz) Au, net-of-silver by-product US$619/oz LOM AISC ($/oz) AuEq, co-product US$742/oz Capital Expenditures Pre-Production Capital Expenditures ($ million) (1) US$142.0 Working Capital / Cash for Reclamation Bond ($ million) US$19.0 Florida Mill (Plant & Tailings in Yr 2) ($ million) US$41.3 Other Production Capex / Sustaining Capital Expenditures ($ million) US$93.4 Reclamation Cost ($ million) US$20.0 Economics After-Tax IRR 43% After-Tax NPV (5%) (US$ million) US$357.6 After-Tax NPV (5%) (C$ million) C$472.0 After-Tax NPV (8%) (US$ million) US$284.4 After-Tax NPV (8%) (C$ million) C$375.5 Pre-Tax IRR 49% Pre-Tax NPV (5%) (US$ million) US$437.3 Pre-Tax NPV (5%) (C$ million) C$577.2 Pre-Tax NPV (8%) (US$ million) US$351.2 Pre-Tax NPV (8%) (C$ million) C$463.6 After-Tax Payback period (years) 2.4 Average Annual after-tax net free cash flow (Year 1 to year 10) ($ million) C$81.1 LOM net after-tax free cash flow ($ million) C$697.2 1) Mobile equipment financing could reduce the pre-production capex by up to ~C$34.8 million (US$26.4 million), assuming a 20% cash down.\n\n\n\nTable 2. After-Tax NPV and IRR Sensitivities Assuming No Mobile Equipment Financing (PEA Case)\n\n\n\nPEA Prices Downside Upside Gold Price (US$/oz) $1,350 $1,200 $1,500 Silver Price (US$/oz) $16.90 $15.00 $19.00 After-Tax NPV(5%) (Million) C$ 472.0 / US$ 357.6 C$ 330.5 / US$ 250.4 C$ 615.0 / US$ 465.9 After-Tax IRR (%) 43% 32% 54% Payback (years) 2.4 3.0 1.9 Average Annual Free Cash Flow (Million) C$81.1 C$64.1 C$98.4\n\nQualified Persons & Technical Report\n\nThe scientific and technical information contained in this news release has been verified and approved by Tim Arnold, Integra’s Vice President of Project Development, of Reno, Nevada, a professional engineer and \"Qualified Person\" within the meaning of NI 43-101, Thomas Dyer, a PE within the state of Nevada, a Registered Member of the SME with expertise in mining and economic analysis and a “Qualified Person” within the meaning of NI 43-101, Jack McPartland, a member of MMSA, with special expertise in metallurgy/processing and a “Qualified Person” within the meaning of NI 43-101, Jeffrey Woods, Principle Consulting Metallurgist at Woods Process Services of Denver, Colorado, a registered member of the SME and MMSA and “Qualified Person” within the meaning of NI 43-101, John D. Welsh, Senior Principal of Welsh Hagan Associates and independent of the Company, a registered professional engineer and “Qualified Person” within the meaning of NI 43-101.\n\nThe DeLamar and Florida Mountain mineral resource estimates were prepared by Mine Development Associates of Reno, Nevada under the supervision of Michael Gustin. Mr. Gustin is a Qualified Person and is independent of the Company as defined by NI 43-101.\n\nFurther information about the PEA referenced in this news release, including information in respect of data verification, key assumptions, parameters, risks and other factors, can be found in the NI 43-101 technical report for the DeLamar Project that will be filed on SEDAR under Integra’s profile at www.sedar.com.\n\nAbout Integra Resources\n\nIntegra Resources is a development-stage company engaged in the acquisition, exploration and development of mineral properties in the Americas. The primary focus of the Company is advancement of its DeLamar Project, consisting of the neighbouring DeLamar and Florida Mountain Gold and Silver Deposits in the heart of the historic Owyhee County mining district in south western Idaho. The first exploration program in over 25 years began on the DeLamar Project in 2018, with more than 30,000 meters drilled to date. The management team comprises the former executive team from Integra Gold Corp. For additional information, see “Technical Report and Updated Resource Estimates for the DeLamar and Florida Mountain Gold – Silver Project, Owyhee County, Idaho, USA”, dated July 30, 2019.\n\nON BEHALF OF THE BOARD OF DIRECTORS\n\nGeorge Salamis\n\nPresident, CEO, and Director\n\nCONTACT INFORMATION\n\nCorporate Inquiries: Chris Gordon, chris@integraresources.com\n\nCompany website: www.integraresources.com\n\nOffice phone: 1 (604) 416-0576\n\nCautionary Statement Regarding Forward Looking Statements\n\nThis news release contains “forward-looking information” and “forward-looking statements” (collectively, “forward-looking statements”) within the meaning of the applicable Canadian securities legislation. All statements, other than statements of historical fact, are forward-looking statements and are based on expectations, estimates and projections as at the date of this news release. Any statement that involves discussion with respect to predictions, expectations, beliefs, plans, projections, objectives, assumptions, future events or performance (often, but not always using phrases such as “plans”, “expects”, “is expected”, “budget”, “scheduled”, “estimates”, “forecasts”, “intends”, “anticipates”, or “believes” or variations (including negative variations) of such words and phrases, or state that certain actions, events or results “may”, “could”, “would”, “might” or “will” be taken, occur or be achieved) are not statements of historical fact and may be forward-looking statements. . In this news release, forward-looking statements relate, among other things, to: statements about the estimation of mineral resources; magnitude or quality of mineral deposits; anticipated advancement of mineral properties or programs; future operations; future exploration prospects; the completion and timing of mineral resource estimates and PEA; future growth potential of Integra; and future development plans.\n\nThese forward-looking statements, and any assumptions upon which they are based, are made in good faith and reflect our current judgment regarding the direction of our business. Management believes that these assumptions are reasonable. Forward-looking information involves known and unknown risks, uncertainties and other factors which may cause the actual results, performance or achievements of the Company to be materially different from any future results, performance or achievements expressed or implied by the forward-looking information. Such factors include, among others: risks related to the speculative nature of the Company’s business; the Company’s formative stage of development; the Company’s financial position; possible variations in mineralization, grade or recovery rates; actual results of current exploration activities; actual results of reclamation activities; conclusions of future economic evaluations; business integration risks; fluctuations in general macroeconomic conditions; fluctuations in securities markets; fluctuations in spot and forward prices of gold, silver, base metals or certain other commodities; fluctuations in currency markets (such as the Canadian dollar to United States dollar exchange rate); change in national and local government, legislation, taxation, controls regulations and political or economic developments; risks and hazards associated with the business of mineral exploration, development and mining (including environmental hazards, industrial accidents, unusual or unexpected formation pressures, cave-ins and flooding); inability to obtain adequate insurance to cover risks and hazards; the presence of laws and regulations that may impose restrictions on mining; employee relations; relationships with and claims by local communities and indigenous populations; availability of increasing costs associated with mining inputs and labour; the speculative nature of mineral exploration and development (including the risks of obtaining necessary licenses, permits and approvals from government authorities); and title to properties. Although the forward-looking statements contained in this news release are based upon what management of Integra believes, or believed at the time, to be reasonable assumptions, Integra cannot assure its shareholders that actual results will be consistent with such forward-looking statements, as there may be other factors that cause results not to be anticipated, estimated or intended.\n\nForward-looking statements contained herein are made as of the date of this news release and the Company disclaims any obligation to update any forward-looking statements, whether as a result of new information, future events or results, except as may be required by applicable securities laws. There can be no assurance that forward-looking information will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. Accordingly, readers should not place undue reliance on forward-looking information.\n\nNeither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.", "description": "", "authors": ["Integra Resources Corp."], "top_image": "http://www.globenewswire.com/Attachment/LogoDisplay/480291?filename=480291.jpg&size=1", "published_at": "2019-10-23"}