{"pub": "yahoo", "title": "Kiss’ Paul Stanley: ‘Prayers and Sympathy Are Not Enough’ After Odessa Mass Shooting", "url": "https://news.yahoo.com/kiss-paul-stanley-prayers-sympathy-210345982.html", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 09:03:22.739804+00:00", "text": "Click here to read the full article.\n\nKiss’ Paul Stanley called for action on gun violence in America following the latest mass shooting in Odessa and Midland, Texas, where seven people were killed and over 20 injured.\n\n“We don’t have more ‘crazy’ or ‘mentally unstable’ people in the US. What we DO have are commonplace mass shootings with automatic and semi-automatic high powered firearms,” the guitarist tweeted Sunday. “THAT cannot be disputed. Tell me what we and our government must do. Prayers and sympathy are not enough.”\n\nMore from Rolling Stone\n\nOn Saturday, the shooter – described in news reports as a white male in his mid-30s with “an AR-type weapon” – went on a shooting rampage in Odessa, a Texas city less than 300 miles east of El Paso, which also recently witnessed a mass shooting. Following a routine traffic stop, the shooter “proceeded on a shooting spree in the City of Odessa” and hijacked a mail carrier before authorities killed the suspect during a shootout in a movie theater parking lot.\n\nStanley’s tweet drew the usual ire of Second Amendment defenders, who told the Kiss singer to stick to music. “I DON’T KNOW THE ANSWER but am asking for everyone’s thoughts. Anyone who thinks I should ‘stay in my lane’ should leave now,” Stanley responded.\n\n“This is MY house. If you DO have opinions why shouldn’t I? In this case I will leave up some of those dopey comments for your enjoyment. Not again.”\n\nWe don’t have more “crazy “ or “mentally unstable “ people in the US. What we DO have are commonplace mass shootings with automatic and semi-automatic high powered firearms. THAT cannot be disputed. Tell me what we and our government must do. Prayers and sympathy are not enough. pic.twitter.com/KpWZa0xJcY — Paul Stanley (@PaulStanleyLive) September 1, 2019\n\n\n\n\n\nSee where your favorite artists and songs rank on the Rolling Stone Charts.\n\n\n\nSign up for Rolling Stone’s Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.\n\n\n\n", "description": "\"We don’t have more 'crazy' or 'mentally unstable' people in the US. What we DO have are commonplace mass shootings with automatic and semi-automatic high powered firearms\"", "authors": ["Daniel Kreps"], "top_image": "https://s.yimg.com/uu/api/res/1.2/tZCop1jF8fVDDa6lDgFMkQ--~B/aD0yMzMzO3c9MzUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/rollingstone.com/0d7b8289ae2dbef1f7d112bce3a1df13"}