{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7562573/Man-31-faces-jail-asking-sex-farm-animals.html", "downloaded_at": "2019-10-11 13:15:25.188305+00:00", "title": "Man, 31, faces jail for asking to have sex with farm animals", "language": "en", "text": "Richard Decker (pictured), 31, stands accused of attempting to initiate sexual contact with farm animals in New Jersey\n\nA man in New Jersey has been jailed pending trial for attempting to solicit animals from local farms and stables to have sex with.\n\nVernon resident, Richard Decker, 31, is said to have sent letters and emails to stables and farms across Sussex County in August 2018 asking if he could use their animals - mainly horses and cows - for sex.\n\nThe prosecution alleges that Decker turned nasty when farmers rejected his written requests and he left metal tire deflation devices in their driveways. He is also accused of sending abusive letters and emails.\n\nHe was arrested at the beginning of this month and faces 22 charges with crimes allegedly committed all over the state.\n\nJudge N Peter Conforti approved an prosecution application to detain Decker on Wednesday, saying that he didn't know any release conditions that would 'ensure the safety of the public.'\n\nThe prosecutor said that Decker's tire deflation devices had caused damage to many of those who refused to give him their animals.\n\nPolice said they searched the house the 31-year-old shares with his mother and brother and found the deflation spikes along with a haul of other destructive objects.\n\nRichard Decker, 31, sent letters and emails to stables and farms across Sussex County in August 2018 asking if he could use their animals - mainly horses and cows - for sex\n\nThey also found a homemade .22 caliber weapon which he was not licensed to produce, explosives and flash powder attached to two arrows.\n\n'He never had contact with anyone directly and the explosives were basically firecrackers,' Decker's defense lawyer argued, according to the New Jersey Herald.\n\n'They were stored in jars with no intent to use against anyone.'\n\nThe judge, however, disagreed.\n\nAmong the 22 indictable offences Decker faces are: Fourth-degree procuring an animal in any kind of sexual manner or initiate any sexual conduct with an animal, second-degree possession of explosives and fourth-degree knowingly manufacturing firearms.", "description": "A 31-year-old New Jersey man has been detained pending trial for allegedly seeking farm animals to have sex with. When rejected, Richard Decker, laid metal spikes on the farmers' driveways.", "authors": ["Ryan Fahey For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/11/19583948-0-image-a-81_1570791452509.jpg", "published_at": "2019-10-11"}