{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7544149/Jack-Nowell-Mako-Vunipola-frame-England-changes-promised-France-clash.html", "downloaded_at": "2019-10-07 00:15:25.178496+00:00", "title": "Jack Nowell and Mako Vunipola in frame for England as changes promised for France clash", "language": "en", "text": "They are top of their pool with maximum points and were the first team to clinch a quarter-final place at this World Cup. But England are determined to remain upwardly mobile, which is where Jack Nowell and Mako Vunipola come in.\n\nNot so long ago the pair were concerned casualties, but now they have returned to action as pedigree reinforcements. At times, both men feared they would not make it to Japan, but their persistence in drawn-out rehab led to comebacks on Saturday, as Argentina were put to the sword.\n\nEddie Jones selected Exeter wing Nowell and Saracens prop Vunipola in his squad of 31, in the hope that they would pull through in time to have a meaningful impact at this tournament.\n\nJack Nowell and Mako Vunipola have returned to action as pedigree reinforcements\n\nNow, as the head coach seeks further improvements, he has two more Lions at his disposal for the clash with France in Yokohama in five days. England can be better, much better, but their predicament is a highly encouraging one.\n\nWhile the Pumas were doomed once Tomas Lavanini had been rightly sent off at Tokyo Stadium, the victors stayed patient and systematically took them apart. It was their third consecutive bonus-point win. This was supposed to be a ‘pool of death’, remember?\n\nInstead, the English campaign is gathering momentum. Four years ago, it had fallen off a cliff. No wonder Mako Vunipola was satisfied as he reflected on the contrast.\n\n‘We spoke about that earlier,’ said the loosehead. ‘It’s just about savouring the feeling. It was very different four years ago.’\n\nIn his quest to keep raising standards, Jones will consider promoting Nowell, a player he admires greatly. Jonny May is a shoo-in on one flank but Jones has often spoken about how he likes the balance of having one express-pace wing and one who offers extreme work-rate, so Nowell could challenge Anthony Watson for the other wide role.\n\nThe England campaign is gathering momentum, rather than falling off a cliff like four years ago\n\nThat would have seemed a distant prospect a month or so ago, as Nowell’s recovery from ankle surgery was interrupted by an emergency appendix operation in Italy while England were holding a ‘heat camp’ in Treviso.\n\nAsked if he feared that he would miss this tournament, Nowell said: ‘A lot of times. I had my appendix out. I’ve been close to coming back, then I’ve hit a hurdle. But I’ve always wanted to be here.\n\n‘I’ve driven so hard to be involved in this World Cup and was backed by Eddie as well. I could quite easily have been sent home but they spent a bit of time on me and to be able to give back is very nice.’\n\nHe certainly did give back on Saturday. A promising cameo off the bench was capped by a superb try, as Nowell bounced off a group of three defenders and finished well in the right corner. ‘I was quite shocked I was still on my feet to be honest,’ he said.\n\nMako Vunipola was brought on in place of the limping Joe Marler and the pair will vie for the right to wear the No 1 shirt.\n\nNowell’s recovery from ankle surgery was interrupted by an emergency appendix operation\n\nJones is likely to give the returning man a start against France to prepare him for the knock-out phase to follow.\n\nVunipola is still striving for match sharpness but on his day he is the world’s best loosehead, so his availability is a major bonus.\n\nWould he feel ready to start the next game? ‘Yeah, yeah,’ said the 28-year-old. ‘They have looked after me well enough and they have the confidence that if they need me to start, I will. It is not up to me. I have to do my bit and compete as hard as I can to try and be part of this team.’\n\nEngland and France will go into their encounter on Saturday having both qualified for the last eight. That scenario will raise questions about whether they will indulge in selection rotation and lack an edge of intensity.\n\nVunipola dismissed any such notion. ‘We want to win everything we play in,’ he said.\n\nElliot Daly had his best Test at full back against Argentina so it makes sense to leave him there\n\nThat is the right tone. England must aim to dispatch France as a stepping stone towards a likely quarter-final against Australia. That is not a prospect to trouble them, after six consecutive victories over the Wallabies during Jones’ time in charge.\n\nBeyond that the All Blacks will surely await, but the other route may well feature Wales and South Africa — back-to-back danger.\n\nThe quest to keep improving should mean a certain amount of stability. Against Argentina, Elliot Daly had his best Test at full back, so it perhaps makes sense to leave him there next weekend. Courtney Lawes could start in the second row after blasting off the bench against the Pumas, while Lewis Ludlam strengthened his case for another start if Tom Curry earns a deserved rest.\n\nEngland’s pack are emerging as a thunderous force and behind them George Ford is pulling the strings with majestic authority at No 10. But alongside him, Owen Farrell had an off-day against Argentina. Rarely has he appeared so hesitant and unsure. There were four missed shots at goal in the first half and he kept running into trouble after the break.\n\nEngland will need the best of Owen Farrell at the business end of this tournament\n\nIf the captain was suffering the effects of Lavanini’s high tackle nine days after he was on the receiving end of a similar assault by USA flanker John Quill, he must be handled with care.\n\nThere is no way Jones would leave him out of a knock-out match but there is an argument that a week off would be justified.\n\nEngland need the best of Farrell at the business end of this tournament.", "description": "They were the first team to clinch a quarter-final place at this World Cup but England are determined to remain upwardly mobile, which is where Jack Nowell and Mako Vunipola come in.", "authors": ["Chris Foy For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/22/19371698-0-image-a-40_1570396142976.jpg", "published_at": "2019-10-06"}