{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-eu-ireland/ireland-would-consider-brexit-extension-if-uk-sought-one-pm-varadkar-idUKKBN1WJ1GV", "downloaded_at": "2019-10-05 00:08:42.936696+00:00", "title": "Ireland would consider Brexit extension if UK sought one - PM Varadkar", "language": "en", "text": "FILE PHOTO: Ireland's Prime Minister Leo Varadkar speaks during the 2019 United Nations Climate Action Summit at U.N. headquarters in New York City, New York, U.S., September 23, 2019. REUTERS/Lucas Jackson\n\nCOPENHAGEN (Reuters) - Irish Prime Minister Leo Varadkar said on Friday that if Great Britain were to request an extension to its Brexit deadline he would consider it, adding that an extension would be preferable to the UK crashing out of the European Union.\n\n“My preference is that we come to an agreement and that we have a deal by the middle of October,” Varadkar said during a meeting with Danish Prime Minister Mette Frederiksen in Copenhagen.\n\n“But if the UK government were to request an extension, of course we would consider it. But I think most EU countries would really only consider it for a good reason, and that reason would have to be put forward. But certainly an extension would be better than ‘no deal’,” he said.\n\nThe BBC reported earlier on Friday that British Prime Minister Boris Johnson will send a letter to the European Union asking for a Brexit delay if no divorce deal has been agreed by Oct. 19.\n\nVaradkar also said that the Brexit deal agreed with former prime minister Theresa May allowed for checks to take place in ports and airports and not along the land border.\n\n“The difficulty with what Prime Minister Johnson has put on the table is that on the face of it, it appears to create two borders - checks at the ports and airports and also near the land border,” Varadkar said.\n\n“I think there is a long way to go before we can back an agreement that actually carries the support of the people of Northern Ireland and the people of the Republic of Ireland as well,” he said.", "description": "Irish Prime Minister Leo Varadkar said on Friday that if Great Britain were to request an extension to its Brexit deadline he would consider it, adding that an extension would be preferable to the UK crashing out of the European Union.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191004&t=2&i=1437036678&w=1200&r=LYNXMPEF9310B", "published_at": "2019-10-04"}