{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/gary-neville-jamie-carragher-react-20663766", "downloaded_at": "2019-10-21 09:47:53.271045+00:00", "title": "Gary Neville and Jamie Carragher react to Man Utd and Liverpool goals", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Manchester United FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nGary Neville and Jamie Carragher produced amusingly predictable reactions to the respective goals by Man Utd and Liverpool on Sunday.\n\nThe two fierce rivals met in the Premier League clash at Old Trafford and played out a 1-1 draw.\n\nMarcus Rashford had given United the lead in the first half before a late Adam Lallana strike earned Liverpool a share of the spoils.\n\nThe game was not without incident however, with a foul on Divock Origi in the build-up to Rashford's goal not penalised, despite referee Martin Atkinson consulting with VAR.\n\nNeville and Carragher were both in the gantry commentating for Sky Sports, and were caught on camera when both goals went in.\n\n(Image: Offside via Getty Images)\n\nAfter Rashford had turned in Daniel James' cross, Carragher immediately pointed to Origi laying on the floor where he had been fouled.\n\nNeville meanwhile punched the air in aggressive celebration at his former club taking the lead.\n\nLiverpool had a goal ruled out by VAR for handball soon after, when Sadio Mane was adjudged to have controlled with his arm before sticking the ball in the net.\n\n(Image: Getty Images)\n\nThe Reds were on the brink of equalling Man City's 18 consecutive wins in the Premier League, but could not get the necessary win on United turf.\n\nThey did however rescue a point late on when Andy Robertson's cross found its way through a sea of bodies to substitute Adam Lallana at the back post to tap in.\n\nNeville was visibly annoyed, sitting back down on his stool and taking a big swig of his water.\n\nEx-Liverpool defender Carragher lapped up in the celebrations, performing a mini dance while pulling a teasing look at the camera.\n\nThe result still leaves Liverpool top of the Premier League table, six points clear of defending champions Man City.\n\nUnited meanwhile remain stranded in the bottom half in 13th, but will be buoyed by the result and performance against their rivals.", "description": "The two pundits were in rival corners for the clash between their old clubs at Old Trafford as the points were shared", "authors": ["Darren Wells", "Image", "Offside Via Getty Images", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20664097.ece/ALTERNATES/s1200/0_MAIN-Jamie-Carragher-Gary-Neville.jpg", "published_at": "2019-10-21"}