{"pub": "yahoo", "url": "https://finance.yahoo.com/news/why-ford-stock-set-rise-170308232.html", "downloaded_at": "2019-10-16 21:15:19.870115+00:00", "title": "Why Ford Stock Is Set to Rise After 2020 Product Unveiling", "language": "en", "text": "After Ford stock (NYSE:F) tested the $8.50 level, a price not seen since the first quarter of this year, low valuations and a high dividend yield should attract investors in the coming weeks.\n\nSource: Roberto Galan / Shutterstock.com\n\nSure, sales in China plunged in the third quarter, but investors are counting on other positive catalysts ahead. So why should investors buy the dip in F stock?\n\nFord Sales Weaken in China\n\nInvestor interest in Ford stock waned by late summer, undermining the analysts who collectively have an average price target of $10.50. On Oct. 11, Ford said sales in China fell 30.3% to 131,060 vehicles. The drop sounds worse than it is because the company enjoyed strong sales in the same period last year.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nIt also followed a second-quarter where China V Emission Standard stock clearance actions drove sales higher. Branding activities, such as the “extraordinary driving experience” campaign should support stronger sales in the next few quarters. Ford has new solid product refreshes that will appeal to Chinese customers: Focus Active, Edge ST and ST-Line, new Taurus and Territory EV.\n\nIn the U.S., Ford reported Q3 sales fell 4.9% to 580,251 units. Truck sales rose ~9% in September, but SUV sales fell 10.5% which is unacceptable. When this market is running hot and offsets the drop in car demand, Ford cannot afford to underperform.\n\nStill, Ford’s entry-level SUV Ecosport sales grew 11% in the quarter while Expedition sales rose 48%. The positive trend for SUVs in the small and large categories may lift sales in the coming quarters. Add a Phase 1 trade deal between the U.S. and China and Ford stock could rebound from here.\n\n\n\n\n\nNew Product Lineup for 2020\n\nThe new SUV models will set Ford on the path for stronger sales in 2020, carrying over from the momentum that started this year. Most notably, Escape and Explorer models are in the middle of a launch, but Ford is not updating just the interior and exterior designs. Technology and powertrain updates are as consumers would expect, but this time around, the SUV has a completely new refresh. This change is as big as when Ford redesigned its F-150 with a new aluminum alloy.\n\nThe SUV assembly plant is progressing well now that Ford will have enough inventory to deliver to dealers. As it ramps up advertising, investors should look for Ford reporting better year-over-year sales in the SUV category.\n\nIn the truck segment, Ford reported sales of over 900,000 units for the year through to September. It is on-pace to sell 1.2 million units for the year. And with strong demand for the F-series and Ranger at a strength not seen in over a decade, F stock is too cheap at 6.5 times forward earnings. Profit margins are solid, helped by higher prices and lower incentives. Ford will clearly gain market share, after growing Ranger sales in Q3, while van sales set an all-time record of 65,288 units.\n\nYour Takeaway on F Stock\n\nFord is in a good position to benefit from sales of new 2020 models, especially in the SUV category. It has some 2019 units in inventory but since 2020 models are already selling, profit margins will inch higher throughout next year. Fusion and Fiesta sales are winding down, which might weigh on the calendar Q4 results and next year. But the absence of Focus, Taurus, and C-Max sales will not offset the strong sales of Escape, Ranger, and the F-series. At a recent price of around $9.00 a share and a dividend of almost 7%, investors should buy Ford at current levels.\n\nThe author owns shares of Ford.\n\nMore From InvestorPlace\n\nThe post Why Ford Stock Is Set to Rise After 2020 Product Unveiling appeared first on InvestorPlace.", "description": "After Ford stock (NYSE:F) tested the $8.50 level, a price not seen since the first quarter of this year, low valuations and a high dividend yield should attract investors in the coming weeks.Source: Roberto Galan / Shutterstock.com Sure, sales in China plunged in the third quarter, but investors are", "authors": ["Chris Lau"], "top_image": "https://s.yimg.com/uu/api/res/1.2/sYjT8nruZa2asxwFc11Cww--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/investorplace_417/555e89beed27303c7d7963ec7ab703b9", "published_at": "2019-10-15"}