{"pub": "yahoo", "url": "https://news.yahoo.com/migrants-refuse-help-french-navy-152514461.html", "downloaded_at": "2019-10-30 06:56:52.291705+00:00", "title": "Migrants refuse help from French navy, preferring UK Border Force rescue instead", "language": "en", "text": "Life jackets left on a beach near Dover after up to 23 migrants crossed the Channel to enter the UK last night. Oct 28, 2019. - STEVE FINN PHOTOGRAPHY\n\nMigrants in the English Channel refused to be rescued by the French authorities after ditching their outboard motor halfway across the Channel in a bid to get rescued by British authorities\n\nUp to 23 illegal migrants are thought to have entered British waters using two inflatable dinghies.\n\nOne group were spotted by a cross channel ferry as they fired flares after their dinghy began sinking a couple of miles from the British coast.\n\nAround 14 people on board the stricken dinghy were spotted by the crew of the DFDS passenger ferry, shortly after dawn.\n\nThe Telegraph understands that the migrants, whose identity is unknown, refused to be rescued by the French naval vessel Roan, preferring instead to wait until they were within reach of a nearby UK Border Force cutter, at which point they ditched their boat’s motor so there was no way of returning to France.\n\nA source told the Telegraph the occupants of the two boats had been “playing up mid-Channel and firing flares in the air” in a bid to avoid rescue by the French authorities.\n\nThe UK Border Force cutter, Vigilant, picked up one group, but the other boat made it to Shakespeare Beach near Dover around 9am on Monday morning. Life jackets and clothing were later found on the beach.\n\nThe captain of the DFDS ferry raised the alarm when the tiny inflatable was sighted in its path across the Channel from France – one of the busiest shipping lanes in the world.\n\nThe freight and passenger ship circled the overcrowded dinghy for several minutes, according to MailOnline, while the Dover Coastguard dispatched a helicopter and two rescue boats to save the stranded migrants.\n\nBritish trucker Martin Cassidy told how passengers watched in horror when they saw the dangerous state of the tiny boat.\n\n\"The dingy was very low in the water and the migrants were firing flares asking to be rescued,\" he said.\n\nHe said an announcement over the tannoy at around 6.45am had told passengers to expect a delay to their crossing.\n\n\"I looked out of the window and saw this tiny orange boat. You could tell it was a migrant dingy. They were about two miles from the coast of Britain. It was a very cold night, the water was quite choppy, so they must have been getting very wet,\" he told MailOnline.\n\n\"The ferry kept a safe distance from the dingy but kept circling until a coastguard helicopter came over and then we saw two coastguard boats coming out of the port of Dover,\" he added.", "description": "Migrants in the English Channel refused to be rescued by the French authorities after ditching their outboard motor halfway across the Channel in a bid to get rescued by British authorities", "authors": ["Telegraph Reporters"], "top_image": "https://s.yimg.com/uu/api/res/1.2/AAGxHZZAKwD2prc7vUTiUw--~B/aD02NTg7dz0xMDUzO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-GB/the_telegraph_818/5d9d4cc065527752bf126313d1eeb518", "published_at": "2019-10-28"}