{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/11/who-is-marie-yovanovitch-diplomat-slated-to-testify-on-ukraine-and-trump", "downloaded_at": "2019-10-11 19:36:24.430075+00:00", "title": "Who is Marie Yovanovitch, the diplomat defying Trump to testify on Ukraine?", "language": "en", "text": "Yovanovitch is appearing before Congress to give her account on a subject at the centre of impeachment proceedings\n\nBy the time it was clear in November 2016 that Donald Trump had become the 45th president of the United States, it was already morning in Ukraine.\n\nA stunned hush fell on America House in Kyiv, a cultural centre where the US embassy was throwing a breakfast election party. Trump was an unknown quantity to everyone watching the big screen where the results were being called.\n\nJust one person was entirely unfazed, the US ambassador, Marie Yovanovitch.\n\n“She was pitch perfect,” said Nina Jankowicz, who was on a Fulbright fellowship working in the Ukrainian foreign ministry at the time. “She said: this is how elections work. We have every faith in our electoral processes and whatever the result, we will honour the decision.”\n\nYovanovitch is no longer ambassador, having been removed in May before her posting was finished, after having been accused of disloyalty in the far-right media. In his infamous 25 July phone conversation with the new Ukrainian president, Volodymyr Zelenskiy, Donald Trump referred to her simply as “the woman” who, he predicted darkly, was “going to go through some things”.\n\nTrump, the whistleblower and the comic: key players in the Ukraine scandal Read more\n\nMarie Yovanovitch has indeed been through “some things” and she will go through more after Friday, when the 60-year-old diplomat appeared before Congress to give her account of events in US-Ukrainian relations over the past few years, a subject which is at the centre of impeachment proceedings in Congress.\n\nSince leaving Kyiv, Yovanovitch has been on sabbatical at the Institute for the Study of Diplomacy at Georgetown University, but is still a serving foreign service officer.\n\nHer decision to appear seems to be in defiance of a block imposed by the secretary of state, Mike Pompeo, ordering state department officials not to give depositions to the congressional impeachment hearings.\n\nThat decision looks like it may have opened a crack in the dam. A former senior director for Europe and Russia at the national security council, Fiona Hill, is due to speak to the House committees on Monday. And Gordon Sondland, current ambassador to the EU has said he will respond to a subpoena to appear next Thursday.\n\nPompeo’s claim that the House committees were seeking to “intimidate, bully and treat improperly” state department officials has drawn accusations of hypocrisy, particularly in light of his treatment of Yovanovitch.\n\nHe appears to have bowed to pressure from the White House by pulling her out of Kyiv two months before her posting was due to end, and failed to speak out in her defence when she was smeared by rightwing pundits and talkshow hosts.\n\nPompeo likes to claim he has brought “swagger” to the state department, but the treatment of Yovanovitch and the state department’s embroilment in the impeachment scandal has badly hit morale at the organisation.\n\n“This has been a hard time for the professional people, especially in the state department. For this to happen to someone they revere and for Pompeo not to come out and defend one of theirs is disheartening for people working in that building,” said Michael McFaul, a former ambassador to Russia.\n\nIn picking on Yovanovitch, the detractors have chosen a tough target. She has had a stellar career, serving as ambassador under three presidents to three countries (a rare distinction), Kyrgyzstan, Armenia and Ukraine, as well as senior adviser to the under secretary of state for political affairs.\n\nUkraine texts show how Trump has warped the state department Read more\n\nShe is one of the state department’s foremost experts on Russia, Ukraine and the surrounding region. She was born in Canada to Soviet emigrants and grew up speaking Russian, and is known to friends and colleagues as Masha. Her parents moved to the US when she was young and she became a naturalised US citizen in her teens, studying history and Russian studies at Princeton, and doing her postgraduate studies at the Pushkin Institute and the National War College.\n\nFormer colleagues all describe her as meticulous, calm under pressure, supremely qualified and steeped in the nonpartisan culture of professional diplomacy, all which set her apart from the campaign donors who are given an increasing share of ambassadorial posts.\n\n“She is whip smart; and by nature, cautious, meticulous, very much someone who follows the rule book. And with great integrity, so she follows instructions and stays within policy guidelines, but she’s also not going to do anything that she believes is wrong,” said John Herbst, a former ambassador to Ukraine. Yovanovitch served as Herbst’s deputy from 2003 to 2004.\n\nWhen Yovanovitch returned to Ukraine as ambassador in 2016, one of the main points of contention between Washington and Kyiv was corruption, and the failure of the government of Petro Poroshenko to tackle it effectively.\n\nLike her predecessor, Geoffrey Pyatt, Yovanovitch kept up the pressure even as the Poroshenko government was quietly dropping its anti-corruption drive. As a result she earned the enmity of the prosecutor general, Yuriy Lutsenko.\n\nAfter Trump’s election, according to former officials, Yovanovitch lost a good deal of her clout because the Ukrainians to whom she was talking began to suspect she was not speaking for the White House, which had its own agenda. Lutsenko and others looked instead for other channels, like Trump’s personal lawyer, Rudy Giuliani.\n\nThat split widened when Yovanovitch would not help Giuliani look for compromising material about Hunter Biden, the son of the Democratic frontrunner for next year’s presidential election.\n\nRudy Giuliani: Ukraine sources detail attempt to construct case against Biden Read more\n\n“She refused to allow her embassy to be dragged into some sort of effort to concoct dirt for political purposes,” a former official said, adding that she was also not prepared to bend the rules by using personal devices for off-the-books conversations, a mistake made by the former special envoy to Ukraine, Kurt Volker. Volker’s messages, reflecting enthusiastic cooperation with Giuliani, made him look complicit. He has resigned from that part-time envoy job and also lost his academic post.\n\nYovanovitch has yet to provide her version of what happened in those critical months leading to her ouster, either in person, or through friends and colleagues.\n\nDaniel Fried, a former assistant secretary of state for Europe who has known Yovanovitch for 25 years, said: “The fact that she has been dead quiet after her shabby treatment, that she didn’t leak, didn’t complain directly or indirectly, demonstrates more about her character than any words I could say.”", "description": "Yovanovitch is expected to appear before Congress to give her account on a subject at the centre of impeachment proceedings", "authors": ["Julian Borger"], "top_image": "https://i.guim.co.uk/img/media/4899eb540f2ecfc91ea22bba31661ec51e89ab5c/0_39_2243_1345/master/2243.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c5a9994f05c021d5e889d3b9a1d3ae39", "published_at": "2019-10-11"}