{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/james-jordan-slams-strictly-using-20734722", "downloaded_at": "2019-10-27 11:53:34.886626+00:00", "title": "James Jordan slams Strictly for using Kevin as Neil's replacement instead of Gorka", "language": "en", "text": "Get the biggest Strictly Come Dancing stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nJames Jordan has hit out at Strictly Come Dancing bosses as Kevin Clifton stepped in to replace Alex Scott's injured partner Neil Jones, as he thinks Gorka Marquez would've been a better choice.\n\nFormer pro dancer James, 41, seemed to be disappointed over the decision to replace Neil Jones with Kevin Clifton.\n\nKevin, 37, stepped in last minute to perform with Alex Scott, 35, as Neil sustained an injury just before the live show - but James Jordan disliked the idea and would have preferred to see Gorka, 29.\n\nTaking to Twitter , the former pro dancer shared with his 261,000 followers: \"Where's Neil???\"\n\nFollowing the reveal of Kevin replacing Neil, he then added: \"Kevin to the rescue…\"\n\nIn spite of his previous post, James pointed out in a separate tweet: \"Shame they didn't use Gorka to step in for Neil…\"\n\n(Image: TV Grab)\n\nSome fans agreed with James as they tweeted back to share their thoughts.\n\nOne fan wrote: \"I agree I thought the whole point of having the 'extra' dancers was in the event of an injury one of them can step in rather than a previously eliminated pro. They only way that should happen is if there was no extras\"\n\nWhile another penned: \"Agreed 100% - will turn Alex into (even more of) a comedy contestant - not sure what Gorka has done to be dropped & surely the non partnered dancers should have a chance before someone who’s already been voted out? But then - Clifton. I rest my case.\"\n\n(Image: TV Grab)\n\n\"I said that!! Give the guy a chance this year. Making sense as always James!\" a third added.\n\nIt comes as former footballer Alex and her partner Neil have said there is no romance between them, and they are too \"immersed\" in the show to consider otherwise.\n\n(Image: BBC/Guy Levy)\n\nNeil has also said that he is content being single after splitting from his wife and co-star Katya Jones, and that he is not interested in going on dating apps to find love.\n\nAlex and Neil’s chemistry on the dancefloor sparked some speculation among fans, but Alex swiftly batted off the rumours, saying: \"It's great that everyone can see how well me and Neil get on, and that we do have this great partnership and it's not just for TV.\n\n(Image: BBC/Guy Levy)\n\n\"But we're not thinking anything about that. We're together all the time training, and we're so immersed in Strictly and doing everything for the show, so that stuff hasn't even entered our thoughts.\"", "description": "The former Strictly pro slammed bosses on Twitter as Kevin stepped in for Neil with just 45 minutes to learn the routine", "authors": ["Brogan-Leigh Hurst", "Image", "Tv Grab", "Bbc Guy Levy"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20734835.ece/ALTERNATES/s1200/0_Screenshot-2019-10-26-at-201138.jpg", "published_at": "2019-10-27"}