{"pub": "cbc", "title": "", "url": "https://cbc.ca/news/health/hormone-replacement-therapy-breast-cancer-lancet-1.5266440", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:00:34.459409+00:00", "text": "New findings published in the Lancet medical journal provide more certainty than ever that hormone replacement therapy (HRT) is associated with an increased risk of breast cancer.\n\nThe risk is higher than previously thought — and persists years after women stop taking the treatment — says Gillian Reeves, one of the study's co-authors and a professor with the cancer epidemiology unit at the University of Oxford.\n\n\"Our role here is to provide really credible evidence about the risks associated with menopausal hormone use,\" Reeves told CBC News.\n\n\"So that … women together with health professionals can actually make a much more informed decision about whether or not they really want to take it.\"\n\nAlthough Canadian doctors are applauding the comprehensive nature of the findings, they emphasize that women suffering from debilitating symptoms of menopause — hot flashes, lack of sleep, mood swings and others — need to weigh their cancer risk against the potential benefits of HRT.\n\n\"Every decision to go on hormonal replacement therapy or not is an individualized decision,\" said Dr. Iris Gorfinkel, a family physician in Toronto who has read the study.\n\n\"It's not a slam dunk, [not] one answer for everybody.\"\n\nRisk varies with hormones, duration\n\nThe new research is a meta-analysis, in which Reeves and a team of scientists combed through more than 50 previous studies involving more than 100,000 post-menopausal women in Western countries who had developed breast cancer.\n\nAfter analyzing the data, the team determined that the risk of developing breast cancer during — and years after — HRT varied depending on the type of hormones taken and how long women took them.\n\nAmong those who never took HRT, 63 out of 1,000 women would develop breast cancer over a 20-year period from age 50 and 69 inclusive, the researchers said.\n\nFor women who took HRT comprised of daily doses of estrogen and progesterone for five years, there was one additional case of breast cancer for every 50 users compared to those who had never taken it.\n\nThat heightened risk diminished to one additional case in 70 for women who took progesterone only intermittently, and to one additional case in 200 among those who took estrogen only.\n\nBe 'very careful' explaining risk\n\nThe fact that the breast cancer risk appeared to decrease with estrogen-only therapy may prompt women to ask why they can't skip the progesterone that is commonly part of HRT. But it's not that simple, according to Dr. Dustin Costescu, associate professor of obstetrics and gynecology at McMaster University in Hamilton.\n\nThat's because progesterone has a protective effect on the lining of the uterus — and using estrogen alone is associated with endometrial cancer.\n\nThe new research is valuable, Costescu says, because although the link between HRT and breast cancer is \"not new,\" it offers more specific information about the nature of the risk that doctors can discuss with patients.\n\nThe findings of a recent study help remind women of the 'short-term benefit and a long-term risk' of hormone replacement therapy, says Dr. Dustin Costescu of McMaster University. (McMaster University)\n\nBut it's important to be clear about how the risk is calculated — especially because this analysis looked at a 20-year timeframe for developing cancer.\n\n\"Giving a number about the risk of breast cancer over 20 years is not a risk statistic that most gynecologists or patients would be familiar with,\" Costescu said. \"We just have to be very careful … because if people think that's a per-year risk then that would be very confusing and shockingly high.\"\n\nIn reality, the breast cancer numbers presented in the paper are \"slightly higher than what we've historically discussed with patients, but they're not that far off the mark in terms of previous risk estimates,\" he said.\n\nBut the findings are still important, Costescu said, because they confirm that the risk is real and provide specific estimates that doctors can discuss with women considering HRT.\n\nThe researchers also found that the increased risk of developing breast cancer increased with longer-term use of HRT — approximately doubling when women took the therapy for 10 years compared to five. They also found very little risk among women who took hormone replacement therapy for less than a year.\n\n\"[The study] does help remind women that there is a short-term benefit and a long-term risk in terms of using these medications,\" Costescu said.\n\nMany of the patients he sees whose severe symptoms of menopause are alleviated by HRT would be willing to take on the relatively small increased breast cancer risk, he said.\n\n\"We also have to recognize that menopause hormone therapy is still a valid choice for women who have significant effects on their quality of life,\" Costescu said.\n\n'Life-changing' symptoms\n\nBlanca Tovar Verma, 52, made that choice when she started taking HRT about six months ago.\n\n\"I had heard about menopause, but I never thought it would be this strong and so life-changing,\" Tovar Verma said. \"I was one of those women who thought I can do it on my own. You know, let's eat healthy, drink a lot of water, let's exercise.\"\n\nBut her hot flashes and night sweats became so overwhelming, she was lucky to get three hours of sleep a night. Constantly exhausted, she had trouble functioning at work.\n\nPreviously an energetic and positive person who loved her busy life, Tovar Verma reached a point of \"desperation\" as she was overcome by irritability and impatience.\n\nBlanca Tovar Verma, who has always been an energetic and positive person, says she didn't recognize the person she became when menopause hit, and decided the benefits of hormone replacement therapy outweighed the increased risk of breast cancer. (Blanca Tovar Verma)\n\n\"One day I was thinking, 'Who's this person? This is not the person I know. This is not the Blanca I know,'\" she said.\n\nTovar Verma reached out to Gorfinkel, her family doctor, for help. The two talked about the chance of breast cancer associated with HRT and determined that, as a non-smoker who was physically active with no family history of the disease, Tovar Verma's other risk factors were low.\n\n\"We decided to try, and I emphasize try, to see how hormonal replacement therapy would work for her,\" Gorfinkel said.\n\nIt did — and Tovar Verma now feels like herself again.\n\n\"I'm really glad I did it,\" she said.\n\nBut Gorfinkel emphasized that the treatment is not permanent, giving three- to six-month prescriptions at a time. She and Tovar Verma also watch closely for any indication of breast cancer through mammograms.\n\n\"It didn't matter to her the risks, because the benefits so outweighed the risks,\" Gorfinkel said.\n\n\"The question ultimately is 'How bad are those symptoms and do those symptoms impact enough negatively in her life to warrant hormonal replacement therapy?'\"", "description": "New findings published in the Lancet medical journal say the risk of breast cancer associated with hormone replacement therapy is higher than previously thought, but doctors say women need to weigh the risk against the severity of menopause symptoms.", "authors": ["Nicole Ireland Is A Cbc News Journalist With A Special Interest In Health", "Social Justice Stories. Based In Toronto", "She Has Lived", "Worked In Thunder Bay", "Ont.", "Iqaluit", "Nunavut", "Beirut"], "top_image": "https://i.cbc.ca/1.5266767.1567212240!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/dr-iris-gorfinkel-and-blanca-tovar-verma.jpg"}