{"pub": "cbc", "url": "https://cbc.ca/radio/asithappens/whistleblower-complaint-points-to-a-trump-cover-up-says-democratic-congresswoman-1.5298292", "downloaded_at": "2019-09-26 23:47:05.912175+00:00", "title": "CBC Radio", "language": "en", "text": "The whistleblower complaint about U.S. President Donald Trump clearly demonstrates that he broke the law and abused his office's power to cover it up, says Democratic Rep. Norma J. Torres.\n\nA redacted version the complaint at the centre of an impeachment probe against Trump was released on Thursday. It alleges Trump used his presidential power to \"solicit interference from a foreign country in the 2020 U.S. election.\"\n\nAt the heart of the allegations is a July 25 phone call in which Trump asks Ukrainian President Volodymyr Zelensky to launch a corruption investigation against Democratic presidential hopeful Joe Biden and his son.\n\nThe White House claims the complaint \"shows nothing improper.\"\n\nTorres, a member of the U.S. House of Representatives for California, spoke to As It Happens host Carol Off. Here is part of their conversation.\n\nWhat does the whistleblower complaint do for the case for impeachment of Donald Trump?\n\nThe whistleblower complaint is critical to the investigation, and I think that should continue to be our focus of an impeachment investigation.\n\nIt's [clear] that the law was violated when the president asks for assistance to investigate a political opponent from a foreign country.\n\nFrom left, Ukraine President Volodymyr Zelensky, Democratic presidential candidate Joe Biden and U.S. President Donald Trump. (Sean Gallup, Tom Brenner, Chip Somodevilla/Getty Images)\n\nWe got a memo of a phone call, a rough transcript of what transpired between President Zelensky and President Trump. What other information does this whistleblower complaint add to that conversation that has been reported?\n\nIt's unfortunate that the memo of the phone call is not complete and it is not a transcript of what actually was the full conversation. It is 10 minutes of a 30-minute phone call that I think, you know, clearly identified that the president violated the law by asking another country to investigate his opponent in this election.\n\nNot only did he do that, but now he has dragged in a private citizen, his personal attorney, and possibly implicated the attorney general of the United States, Mr. William Barr. Who else is going to be implicated in this? Who else is covering up these illegal actions that the president is conducting under the flag of the White House?\n\nWhat does [the whistleblower complaint] say about how the White House knew, how people who would listen to the phone call, what indication is it that they knew that there was something seriously wrong with what had happened in that phone call?\n\nThe whistleblower complaint identifies that there were several people listening and they all came to that same conclusion that a statement had been made, a request had been made by the president of the United States, that was illegal.\n\nWhere are the notes of all of those people that were in the room? And why is the process of secret, top secret and classified information, being utilized to cover up for the illegal political practices of the president of the United States?\n\nThis is a screenshot of the tweet that disappeared from Donald Trump's Twitter feed just before 1 p.m ET.\n\nWhat is it that raised alarm bells about this for the whistleblower?\n\nThe cover-up began, from the administration's perspective, when those notes were removed, were put into a classified system, instead of leaving it in the computer system that they utilize to store day-to-day activities.\n\nIf this was truly a typical phone call that happened between two presidents or two leaders of two nations, there was no reason other than a political reason to cover up a criminal act on behalf of the president to hide that act.\n\nThat's the argument that the whistleblower, the anonymous whistleblower at this point, gives us. The White House says that the whistleblower has no first-hand knowledge, that he or she was not on the phone call, did not witness anything, has heard of this from others who were there, so second- or third-hand information. Do you really have a smoking gun with this? How can you really prove what the whistleblower says is true?\n\nWe absolutely know that what the whistleblower has been reporting is true.\n\nThe president himself has admitted on national television that he did ask for assistance.\n\n[Trump's] personal attorney [Rudy Giuliani], who is also implicated, has come out and, on national TV, has also admitted to asking for assistance from a foreign government.\n\nThat is unlawful. Both of them should know that.\n\nAnd so you feel what the whistleblower is saying can be corroborated?\n\nAbsolutely. It's been collaborated by the suspects themselves.\n\nMr. Trump, as we know, he likes a fight. He likes a good circus. Are you offering it to him?\n\nThe bottom line here is that if he wants to talk about politics, we can look at, you know, the last three years, where Democrats have been winning in every election. Where we haven't won, in deep red states, congressional districts, we have been the closest that we have ever been to winning in those elections.\n\nWe don't have to take this chance that we are taking.\n\nThis is an issue of right and wrong. And this is an issue of standing up for the rule of law, of standing up for our constitution and standing up for democracy.\n\nU.S. House Speaker Nancy Pelosi said Thursday that Trump tried to cover up an attempt he made to pressure Ukraine into investigating Biden. (Al Drago/Reuters)\n\nIs this damaging to Joe Biden?\n\nAny time the president uses the power of his office, the power of his staff, the power of allies, foreign allies, to win an election is damaging not only to a candidate running in that election against him, but it's damaging to our American values to having open and transparent elections. And that's what we need to focus on.\n\nWritten by Sheena Goodyear. Produced by Katie Geleff. Q&A has been edited for length and clarity.", "description": "The whistleblower complaint about U.S. President Donald Trump clearly demonstrates that he broke the law and abused his office's power to cover it up, says Democratic Rep. Norma J. Torres.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5298931.1569532206!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/guatemala-pelosi.jpg", "published_at": "2019-09-26"}