{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/the-world-just-had-another-month-of-record-heat", "downloaded_at": "2019-10-08 12:11:20.110271+00:00", "title": "The World Just Had Another Month Of Record Heat", "language": "en", "text": "September heat. (Image: C3S)\n\nThe summer of shocking global heat has continued into the spring. New data released by the Copernicus Climate Change Service (C3S), the European Union’s climate agency, shows that last month tied for the hottest September on record. This adds to the stunning string of record or near-record heat the northern hemisphere has been dealing with since June and underscores the growing severity of the climate crisis.\n\nThe data released on Friday reveals that this past September was 1.2 degrees Celsius above the pre-industrial average. It was also 0.57 degrees Celsius above the average September measured from 1981 to 2010, putting it “virtually on par” with September 2016, according to a C3S blog post announcing the findings. The agency’s data show just a few hundredths of a degree difference, which when you’re measuring the global average means both Septembers were virtually the same.\n\nExtreme heat roasted the eastern U.S., Alaska and portions of China and Mongolia. The Arctic was also exceptionally warm, which in part contributed to sea ice there bottoming out at its second-lowest extent ever recorded. A large portion of West Antarctica and the surrounding seas were also freakishly warm (by polar standards) with temperature more than 6 degrees Celsius above the 1981-2010 average.\n\nAlone, the record would be worrying enough. But after the summer the world has had, it’s downright alarming. June 2019 was the warmest June ever recorded while August 2019 was the second-warmest iteration of the month on record. Then there’s July, which was the hottest month ever recorded on Earth. Add in the September heat record, and you’ve got the makings of an extremely, no good, very hot year.\n\nWhat makes the records stand out all the more is the absence of El Niño, a natural climate pattern marked by warm waters in the eastern Pacific. It tends to boost the global average temperature.\n\nThe previous June, July and September records all came in 2016, the year of a Super El Niño that roasted the eastern Pacific and upped the global average temperature to previously unseen levels. That the new spate of records are happening without a natural assist only underscores how much carbon pollution is changing our climate.\n\nAnd there’s little sign of a respite in October. The eastern U.S. just dealt with a record-breaking heat wave that saw the mercury climb into the 90s as far north as New York. Extremely not normal! And on Friday, Kuwait set an all-time October heat record for the northern hemisphere.\n\nData collected by Etienne Kapikian, a scientist with the French weather service who tracks heat records, show that temperatures climbed to a stifling 47.6 degrees Celsius in the Kuwait-Saudi Arabia border town of Al Wafra.\n\nWhile it’s unlikely that 2019 will end up being the hottest year on record, it’s basically guaranteed to land as one of the top five warmest years, all of which have happened in [checks notes] the last five years. Well then.", "description": "The summer of shocking global heat has continued into the spring. New data released by the Copernicus Climate Change Service (C3S), the European Union’s climate agency, shows that last month tied for the hottest September on record. This adds to the stunning string of record or near-record heat the northern...", "authors": ["Tegan Jones"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/fzdkyoqevutkzea9kl0r.jpg", "published_at": "2019-10-08"}