{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-eu-court/anti-brexit-campaigners-claim-victory-as-scottish-court-delays-decision-on-extension-law-idUKKBN1WO14L", "downloaded_at": "2019-10-09 12:53:05.783359+00:00", "title": "Anti-Brexit campaigners claim victory as Scottish court delays decision on extension law", "language": "en", "text": "LONDON (Reuters) - Anti-Brexit campaigners claimed victory after Scotland’s highest court decided on Wednesday to wait before ruling whether to force Prime Minister Boris Johnson to seek a delay to Britain’s EU divorce date if he has not struck a deal in the next 10 days.\n\nFILE PHOTO: Britain's Prime Minister Boris Johnson meets with European Parliament President David Sassoli (not pictured), at Downing Street, in London, Britain October 8, 2019. Aaron Chown/Pool via REUTERS\n\nAn alliance of rebels in Johnson’s Conservative Party and opposition lawmakers voted through a law, known as the Benn Act, last month which requires him to ask for a Brexit delay if there is no deal in place by Oct. 19.\n\nThe chances of any agreement with the European Union by next week appear slim at the moment with Irish Prime Minister Leo Varadkar saying there were big gaps between the two sides.\n\nJohnson has said Britain will leave the bloc on Oct. 31 as scheduled and that he would rather be “dead in a ditch” than ask for any further delay. However, he has also said he would not break the law, without explaining that apparent contradiction.\n\nThis week, anti-Brexit campaigners asked Scotland’s Court of Session to issue an order stating Johnson must abide by the Benn Act and to send a letter to the European Union on his behalf if he refused to do so himself, using a power known as “nobile officium”.\n\nThe court said normally it would have rejected the challenge, and indicated it was reluctant to see judges brought into the ferocious Brexit debate.\n\n“The court may only interfere in that debate if there is demonstrable unlawfulness which it requires to address and to correct,” the judge said. “At present there has been no such\n\nunlawfulness.”\n\nBut they said they had decided to delay consideration of the case until Oct. 21, after the date Johnson will have had to ask for an extension if no divorce deal had been agreed.\n\n“It is clear that there will be changes in circumstances over the next 10 days,” the court’s three judges said in their ruling.\n\n“The court will for these reasons continue consideration of the reclaiming motion and the petition to the ‘nobile officium’ until Monday, 21 October, by which time the position ought to be significantly clearer.”\n\nGovernment lawyers had told the court that Johnson accepted that he must carry out the requirements of the Benn Act, even though he has publicly rejected asking for any further delay.\n\n“We have extracted from him a promise that he will comply with the law,” said Jo Maugham, a tax lawyer who was one of those behind the Scottish case.\n\n“If he breaks that promise, he will face the music - including possible contempt proceedings. And the courts are likely to make good any failure on his part, including signing the Benn Act letter.”\n\nJohnson’s office said it had no comment on the case.", "description": "Anti-Brexit campaigners claimed victory after Scotland's highest court decided on Wednesday to wait before ruling whether to force Prime Minister Boris Johnson to seek a delay to Britain's EU divorce date if he has not struck a deal in the next 10 days.", "authors": ["Michael Holden", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191009&t=2&i=1438790614&w=1200&r=LYNXMPEF980TV", "published_at": "2019-10-09"}