{"pub": "townhall", "url": "https://twitchy.com/sarahd-313035/2019/09/09/yikes-dem-rep-joe-cunninghams-wife-shares-way-too-much-information-in-rant-about-her-ridiculous-obamacare-coverage-video", "downloaded_at": "2019-09-09 23:18:58.837237+00:00", "title": "Yikes! Dem Rep. Joe Cunningham’s wife gets a little too personal in rant about her ‘ridiculous’ Obamacare coverage [video]", "language": "en", "text": "Dinner at Democratic Rep. Joe Cunningham’s house should be pretty interesting tonight, thanks to his wife’s candor:\n\nNew video: Dem congressman Joe Cunningham's wife is outraged her taxpayer-subsidized Obamacare plan doesn't pay for her therapy, their marriage counselinghttps://t.co/HQLyf1g4Iy pic.twitter.com/3NXD4qD98c — Brent Scher (@BrentScher) September 9, 2019\n\nOh man.\n\nMore from the Washington Free Beacon:\n\nDemocratic congressman Joe Cunningham’s wife is furious that their taxpayer-subsidized healthcare plan declined to pay for therapy sessions, according to a rant on an insurance bill she posted on Instagram. The South Carolina Democrat is currently serving his first term in Congress, where members are given access to Obamacare “gold” plans from Blue Cross Blue Shield and are responsible for paying about a quarter of the premiums. The plan is apparently not good enough for his wife, Amanda Cunningham, who told her Instagram followers she would be urging her husband to do something about it. … Cunningham’s office did not respond to an inquiry into whether he agrees with his wife’s assessment of the plan, but he wouldn’t be the first freshman member dissatisfied with the Obamacare plan they’re given.\n\nWell, maybe he doesn’t want to discuss that sort of thing in public, you know?\n\nSounds like the congressman needs to have a chat with his wife about privacy. And maybe some other stuff.\n\nLet's see, she is ranting about their marriage counseling cost in public and telling her husband to do something about it in public. No problems here. — MTB (@nsewanswers) September 9, 2019\n\nJoe: get the hell out of there. — BravoKilo (@BravoKiloActual) September 9, 2019\n\nNow i can see why they’re in marriage counseling — Alex Mascitti (@alexmascitti) September 9, 2019\n\ngood luck with that marriage — Zman (@daytrader133) September 9, 2019\n\nOh and I predict their marriage is toast from her oversharing their personal business. — commonsense (@commonsense258) September 9, 2019\n\nI think this video should take care of any marital problems… — B.T. Mattison (@BT_Mattison) September 9, 2019\n\nMeanwhile, we’re really sorry that our tax dollars aren’t enough for her.", "description": "joe cunningham", "authors": ["Sarah D", "Posted At Pm On September", "Sarah D."], "top_image": "https://twitchy.com/wp-content/uploads/2019/01/michael-scott-cringe-face_new.jpg", "published_at": "2019-09-09"}