{"pub": "thehill", "url": "https://thehill.com/opinion/judiciary/466057-turley-why-more-questions-remain-after-hunter-bidens-interview", "downloaded_at": "2019-10-16 20:54:56.809389+00:00", "title": "Turley: Why more questions remain after Hunter Biden's interview", "language": "en", "text": "“Say it nicer.” No words better sum up the news coverage of Hunter Biden. That instruction given from him to ABC News reporter Amy Robach came after she noted that he was “in and out of rehab” several times for dependency on drugs ranging from cocaine to crack. In fact, the media has been “saying it nicer” for weeks, telling readers and viewers there is “no finding of wrongdoing” by the son of Joe Biden Joe BidenWarren defends, Buttigieg attacks in debate that shrank the field Five takeaways from the Democratic debate in Ohio New study: Full-scale 'Medicare for All' costs trillion over 10 years MORE while avoiding any substantive discussion of his controversial business dealings.\n\nDuring the interview, Hunter Biden moved between muted apologies and indignant denials about alleged efforts to cash in on his father being vice president. The interview was galling for those critical of this common form of corruption. For three decades, I have written about the practice of giving lucrative jobs and contracts to the spouses and children of powerful politicians as a way of gaining influence in Washington.\n\nHunter Biden’s deals are textbook examples of how political families become rich from public service. Still, many in the media continue to repeat Joe Biden’s position that “no one has asserted my son did a single thing wrong.” That, of course, is untrue. Even if the deals did not amount to crimes, they were wrong. They have always been wrong, but both parties have always protected these deals as a dirty little secret.\n\nADVERTISEMENT\n\nHunter Biden appeared to struggle to find his identity in explaining his foreign deals. He was asked why he accompanied his father on an official trip to China in 2013, shortly before he signed a deal with the Bank of China to manage $1.5 billion in investments. He replied, “I have traveled everywhere with my dad.” The problem is he was 43 years old at the time. He was definitely not some oversized lap child.\n\nAfter admitting that he probably was given such lucrative deals because of his dad, he suggested the opposite. Pressed about his credentials to be a director of a Ukrainian energy company, he said, “I was vice chairman of the board of Amtrak for five years. I was the chairman of the board of the United Nations World Food Program. I was a lawyer for Boies Schiller Flexner, one of the most prestigious law firms in the world.”\n\nIndeed, he was given those positions, but they raise the same concerns over whether he earned them. Hunter Biden has the prototypical resume of the progeny of the powerful in Washington. He seemed to land jobs far beyond his experience or proven skills. Most law school graduates work for six years just to make junior partner in a firm. Yet, directly out of law school in 1996, he was given a lucrative position with MBNA America, a bank that was not only a campaign contributor to his father but a business actively lobbying for lending changes in Congress. His father, then a powerful senator, supported changes that benefited the bank.\n\nWithin a couple years of graduating, Hunter Biden amazingly ascended to the position of executive vice president. He was then given a position in the Commerce Department before he became an industry lobbyist. In 2006, President Bush made him a member of the board of directors of Amtrak. No one seriously argued at the time that his resume even remotely qualified him for that position, any more than his assuming the board chairmanship of the United Nations World Food Program.\n\nAt the time, Democratic Senator Tom Carper of Delaware explained that Hunter Biden was qualified to get on the board of Amtrak because “Hunter Biden has spent a lot of time on Amtrak trains.” He was then given a position with the law firm of Boies Schiller Flexner while establishing an investment firm. Frankly, his entire resume is filled with high paying positions but few known accomplishments to justify them.\n\nADVERTISEMENT\n\nIn a key exchange in the interview, Robach asked about Hunter Biden going with his father on an official trip to China. Shortly after that trip on Air Force Two, he signed a deal with Chinese businessman Jonathan Li and an investment firm worth as much as $1.5 billion in Chinese capital, including funding from the Bank of China. Robach correctly noted that President Trump Donald John TrumpWarren defends, Buttigieg attacks in debate that shrank the field Five takeaways from the Democratic debate in Ohio Democrats debate in Ohio: Who came out on top? MORE is completely wrong in claiming that Hunter Biden walked away with $1.5 billion or made millions from the deal. Indeed, Hunter Biden insisted he did not made a dime on the deal.\n\nBut Robach then moved on without addressing the obvious point that Hunter Biden hoped to get a cut from a business seeking $1.5 billion. He simply failed in the effort. Saying that you failed to make a ton of money hardly gives you the ethical high ground. He also brushed over the fact that, during the official visit, he had his father take a photo with his business partner. He insisted it was a wonderful coincidence of a friend staying at the same hotel. Nor was he pressed on why, if his deal had made no money for years, he only decided to resign this month.\n\nHunter did admit that his deal with Burisma Holdings, the Ukrainian energy company, may have shown “poor judgment” but not because it was an effort at influence peddling. Nor because he took $50,000 a month from one of the most corrupt figures in Ukraine or because he got the deal when his father controlled billions in loans and aid to Ukraine. He said, “I gave a hook to some very unethical people to act in illegal ways to try to do some harm to my father. That is where I made the mistake.”\n\nIn other words, he broke the cardinal rule of the progeny of the powerful to never allow your personal enrichments to become public controversies. Ultimately, the real impact of this controversy turns on any responsibility of Joe Biden. During his interview, Hunter Biden insisted, “I did not have any discussions with my father before or after I joined the board as it related to it, other than that brief exchange that we had.”\n\nRobach repeated that while ignoring an obvious contraction. This is where the spin moves from nice to nonsense. The point of the original question to Joe Biden was whether he knew his son was doing business in Ukraine when the vice president dangled more than $1 billion in loans in front of the Ukrainian government. Joe Biden denied any knowledge when he said, “I have never spoken to my son about his overseas business dealings.”\n\nADVERTISEMENT\n\nThe Washington Post adopted this spin in its dubious “fact check” in which it acknowledged that Hunter Biden did tell his father about the deals but, since Joe Biden just told his son to be “careful,” the publication concluded that is “not much of a discussion.” However, that is not the point here. The point is that Joe Biden knew of a glaring conflict in what anyone would recognize as an obvious effort at influence peddling.\n\nIn response to this, Joe Biden has declared, “I can tell you now, if I am your next president, I am going to build on the squeaky clean transparent environment that we had in the Obama Biden White House.” That is a rather odd statement since his own son’s controversial deals in Ukraine and China occurred during that administration, as did controversial payments to the Clintons and their foundation from foreign interests. That is not exactly the model many of us have in mind. In the end, it is hard to say much of this in a “nicer” way, but the questions must be asked.\n\nJonathan Turley is the Shapiro Professor of Public Interest Law at George Washington University. You can follow him on Twitter @JonathanTurley.", "description": "His deals raise the issue of influence peddling by family members of powerful politicians.", "authors": [], "top_image": "https://thehill.com/sites/default/files/hunterbiden_04122016_0.jpg", "published_at": "2019-10-16"}