{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/23/holy-site-security-concerns-international-religiou", "downloaded_at": "2019-10-24 04:53:52.682047+00:00", "title": "Holy site security concerns international religious freedom panel", "language": "en", "text": "Members of the U.S. Commission on International Religious Freedom spoke out Wednesday in Washington on how to secure holy sites amid an increase of attacks against houses of worship around the world.\n\nFrom the destruction of the Tomb of Jonah by the Islamic State to the Chinese government bulldozing Tibetan monasteries, a global uptick in violence targeting houses of worship drew condemnation during the commission’s panel discussion.\n\nThe wave of violence over the last few years intimidates and silences already marginalized faiths, panelists said, blaming Islamic State, Boko Haram, anti-Semitic white nationalists and other non-state actors.\n\nCommission Chairman Tony Perkins observed that Christians, Muslims, Jews and other faith practitioners have seen antagonists turn “sacred and peaceful spaces into unimaginable sites of bloodshed.”\n\nMr. Perkins, who is also president of the Family Research Council, pointed to a gunman’s attack on a synagogue in Germany two weeks ago on Yom Kippur in which two people died, calling the assault “another sobering example of the reemergence of anti-Semitism around the world.”\n\nSam Brownback, U.S. ambassador-at-large for international religious freedom, told the panel that President Trump has authorized $25 million for the State Department to train security forces how to protect religious relics and sites. He asked for more funding, even from private sources, to restore destroyed sites.\n\n“I honestly hope that this is the small end of the funding,” Mr. Brownback said. “The bigger end is how do you crowdsource on something.”\n\nIn her opening statement, commission Vice Chair Gayle Manchin noted instances of overt violence and subtler actions such as government’s video surveillance of holy sites and the Iranian regime locking the doors of a Christian church that have rattled the faithful.\n\n“We are also deeply troubled and concerned about the less overt tactics that threaten them,” Ms. Manchin said. “These are more scary than overt actions.”\n\nOther disturbing trends included the destruction of Uighur cemeteries in northwest China and gun attacks like that at the Tree of Life synagogue in Pittsburgh last year.\n\n“These attacks were not supposed to happen in the United States,” said panelist Hassan Abbas, professor of the Near East South Asia Strategic Studies Centre at the National Defense University in Washington. “The currency of our conversations has become violent.”\n\nTangible solutions remain elusive. One international response forwarded by Miguel Angel Moratinos, the U.N. High Representative for the Alliance of Civilizations, imagined mapping — by Google and international observers — of holy sites and places of worship.\n\nThe ability of powerful nations like China and Russia to continue to persecute religious minorities appeared a bulwark, as evidenced by the recent incursion of Turkish forces into Northern Syria, a Kurdish region, with many diverse faiths.\n\nCommissioner Gary Bauer noted the commission had become aware of Chinese officials pressuring other nations indebted to Beijing to not attend the second ministerial on religious liberty, held in July in Washington.\n\n“I will have a dialogue with them and try to identify the problem,” Mr. Moratinos said.\n\nPanelists also looked at physical security measures at places of worship. Mr. Perkins noted that the synagogue in Halle, Germany, on Yom Kippur had installed security cameras and fortified its main entrance, measures that likely saved dozens of lives. The funding came from the Jewish Agency for Israel, the world’s largest Jewish nonprofit.\n\nMs. Manchin asked if the “new normal will be security around the churches.”\n\n“I think we have to find the right balance,” replied Mr. Moratinos. “If you go to church or mosque or synagogue it is a special moment for each person.”\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Members of the U.S. Commission on International Religious Freedom spoke out Wednesday in Washington on how to secure holy sites amid an increase of attacks against houses of worship around the world.", "authors": ["The Washington Times Http", "Christopher Vondracek"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/23/10232019_ap-171806672859098201_c0-1573-2104-2800_s1200x700.jpg?e660781c6319b6cc46d1f2472ae028f727fdc93d", "published_at": "2019-10-23"}