{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/us-stocks-show-signs-life-after-worst-day-this-year-2019-10-1028573266", "downloaded_at": "2019-10-03 09:39:27.797232+00:00", "published_at": "2019-10-03", "title": "US stocks are showing signs of life after a bloodbath wiped out the Dow's gains for the year", "language": "en", "text": "John Gress/Reuters\n\nUS futures showed signs of life on Thursday after a two-day bloodbath.\n\nThe Dow Jones Industrial Average slumped more than 3% in two days, wiping out its gains for the year, while the FTSE 100 plunged 3.2% on Wednesday, its biggest drop in more than three years.\n\n\"Ugly is the only way to describe it,\" Neil Wilson, chief market analyst for Markets.com, said in a morning note. \"Not quite free-fall or panic, but very ugly.\"\n\nVisit Markets Insider's homepage for more stories.\n\nUS futures showed signs of life on Thursday after a two-day bloodbath. The Dow Jones Industrial Average slumped more than 3% in two days, wiping out its gains for the year, while the FTSE 100 plunged 3.2% on Wednesday, its biggest drop in more than three years.\n\n\"Ugly is the only way to describe it,\" Neil Wilson, chief market for Markets.com, said in a morning note. \"Not quite free-fall or panic, but very ugly.\"\n\n\"Investor confidence has crumbled,\" he added, pointing to a lethal cocktail of weak US manufacturing and payroll data, talk of impeaching President Donald Trump, escalating protests in Hong Kong, a potential no-deal Brexit, and the prospect of a US-EU trade war.\n\nTraders see a growing risk of tit-for-tat tariffs after the World Trade Organization authorized the US this week to retaliate against illegal Airbus subsidies with $7.5 billion worth of annual tariffs on EU goods. The watchdog is expected to announce the level of retaliation the EU can take against the US over Boeing subsidies early next year.\n\nFollowing the WTO's green light, the Trump administration announced it would slap tariffs of 10% on large civil aircraft from France, Germany, Spain, and the UK, and impose duties of 25% on EU products such as wine, cheese and whiskies, starting October 18, according to Reuters.\n\nHere's the market roundup as of 9:30 a.m. in London (4:30 a.m. EST):\n\nEuropean equities were mixed with France, Spain, and Italy's benchmark indexes up more than 0.6%, but Britain's FTSE 100 down 0.3%. Germany's DAX was closed for a national holiday.\n\nAsian indexes closed broadly lower with the Shanghai Composite down 0.9% and Japan's Nikkei down 2%. Hong Kong's Hang Seng rose 0.4%.\n\nUS stocks were set to rebound with futures underlying the Dow Jones Industrial Average and S&P 500 up 0.4%, and Nasdaq futures up 0.5%.\n\nOil prices climbed with West Texas Intermediate up 0.3% at $52.80, and Brent crude up 0.2% at $57.80.", "description": "US futures showed signs of life on Thursday after a two-day bloodbath. The Dow Jones Industrial Average slumped more than 3% in two days, wiping out its g...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d95aa67625ac91a061e074c-2400/2012-09-13t120000z597184097gm1e89e054l01rtrmadp3usa.jpg"}