{"pub": "ccn", "url": "https://ccn.com/bitcoin-to-head-to-7400-in-the-near-term", "downloaded_at": "2019-10-05 13:03:33.447756+00:00", "title": "Bitcoin to Head to $7,400 in the Near-Term Warns Technical Analyst", "language": "en", "text": "Bitcoin’s bounce from lows of $7,714.70 on September 30th gave bulls a solid reason to be optimistic.\n\nAt that point, the number one cryptocurrency shed over 44% of its value from the 2019 top of $13,880. To some traders, this price action is not out of the ordinary. More importantly, they expect bitcoin to resume its uptrend soon.\n\nUnfortunately, the bounce was short-lived and bitcoin resumed its bearish trend. While this move caught many retail investors off guard, one experienced analyst anticipated the move. In fact, the full-time trader believes that there’s more blood to come.\n\nTop Crypto Consolidation After the Breakdown is Bearish\n\nThe dominant cryptocurrency became bearish after it broke down from a large descending triangle on Sept. 24. While it did bounce less than a week later, bitcoin failed to take out resistance of $8,500. That’s a bearish signal to technical analyst TraderSZ.\n\nThe full-time trader shared a chart with CCN and said,\n\nThat’s my thoughts…I believe we [are] head[ed] lower.\n\nLooking at the analyst’s chart, he predicted that bitcoin will dive below $8,200 and then convert the support into resistance. That call has actually taken place. Bitcoin is currently trading close to $8,000 and falling rapidly despite oversold conditions.\n\nBased on the chart, we might be seeing the prelude to the dive to $7,400.\n\nWyckoff Analyst: ‘Bitcoin Is Making a Major Low Here’\n\nIt is not all gloom and doom for the king of cryptocurrencies. We spoke to Todd Butterfield, the owner of the Wyckoff Stock Market Institute. He believes that bitcoin is creating a higher low setup. He said,\n\nI am still of the opinion that Bitcoin is making a MAJOR low here and will begin a move to all-time highs very soon.\n\nWhen asked about the chances of the cryptocurrency to dump to $7,400, the top Wyckoff expert replied,\n\nMy current preferred count is that we rally from here. Worse case I think we have quick dunk to $7,400 then straight up.\n\nDisclaimer: The above should not be considered trading advice from CCN. The writer owns bitcoin, Ethereum, and other cryptocurrencies. He holds investment positions in the coins but does not engage in short-term or day-trading.", "description": "", "authors": [], "top_image": "https://www.ccn.com/wp-content/uploads/2019/10/Bitcoin.jpg", "published_at": "2019-10-04"}