{"pub": "guardian", "url": "https://theguardian.com/lifeandstyle/2019/oct/20/i-cant-come-to-terms-with-my-boyfriends-female-friendships-mariella-frostrup", "downloaded_at": "2019-10-20 06:53:30.188052+00:00", "title": "I can’t come to terms with my boyfriend’s female friendships | Dear Mariella", "language": "en", "text": "The dilemma My partner of three years sent a female colleague a pornographic joke, and I can’t get over it. He said they’ve been friends since school days, but it doesn’t sit right with me. He can’t explain why he did it, apart from banter, and he thought she would find it funny. He’s said it won’t happen again and he made an error of judgment. Ten days before this he invited a female golfing colleague to his house for a curry (albeit with his male lodger). It sends out the wrong message, and if he feels this is acceptable, what else is he capable of? My mind is running riot. I know I have trust issues – my ex was unfaithful at least six times, and the reason I found out about the pornographic text was because I checked his phone. He’s the love of my life and he feels the same. There has always been strong chemistry between us and I don’t want to let my past get in the way, but I’m really struggling.\n\nMariella replies Poor you. Having endured the ravages of paranoid (and sometimes not so paranoid) jealousy in my youth, I know how agonising it can be. Luckily, it’s a debilitating condition that most of us manage to control over time. Allowed to flourish, jealousy becomes your master, sapping emotional energy and any hope of happiness.\n\nLast time I checked, a romantic union is sustained on the basis of mutual trust and desire. No partnership can survive the scrutiny, strictures and control you’re enforcing. This will lead to the very deceit you’re fearful of, based on the reasonable desire on your partner’s part to have freedom of choice when it comes to his friendships. Hooking up isn’t about placing your beloved in lockdown. It’s about finding someone you can open up to, who enhances your life experience and whom you place in pole position in your affections. That doesn’t mean they should enter a state of purdah, curtail all encounters with the opposite sex, strike friends bearing proscribed genitalia from their address book and only make single-sex social engagements.\n\nRisqué jokes and a curry are not the cliff edge of salacity\n\nWe know that love is an irrational collision of pheromones and feelings, an arbitrary emotional reaction to another human being. Jealousy is also irrational, but deserves inclusion as envy’s cousin on the list of seven deadly sins. Jealousy is born of fear, laced with insecurity and topped with a heady mix of personal, often historic foibles that make every case unique.\n\nSending a long-term friend a pornographic joke may raise questions about your boyfriend’s sense of humour, but that doesn’t make it an entrée to an affair. Having supper with a sporting colleague is perfectly reasonable behaviour – and even more so in the company of a flatmate. Most of us no longer live in a society where every encounter with the opposite sex is a match-making moment – and how much better off we are for that. Here in the 21st century, those who are sexually compatible also regard each other as equals, work shoulder to shoulder, and play and party together. And we do all that without it having to end in sexual intercourse – often enjoying interactions more because of that.\n\nYou ask what else your partner is capable of if he can send risqué jokes and share curries with golfing friends, as though those two activities represent the cliff edge of salacity. I’d argue that there’s nothing healthier than a man who still considers other women his friends, while choosing you to be his lover. You’ve already identified the real problem you are struggling with and it’s one of trust. Like innocence, it’s something we should assume and place in others until, and only if, they prove themselves not to be worthy of our assumptions.\n\nYour insecurity, currently playing havoc with your imagination, is damaging your ambition for a healthy relationship and is, ironically, the element most likely to prevent you achieving it. Affectionately referred to as a “little green monster”, jealousy is not, in fact, benign. It’s expansive, both in the person feeling it and in its ability to wreak destruction in our romantic lives. So, whether with expert help or a decided determination to overcome your pattern of distrust, I would urge you to tackle it. Obviously, I can’t promise that your partner will be faithful for ever and, as I don’t know him, I can’t even confirm he’s worthy of your trust. I do know, however, that a relationship built on suspicion, where your energy is focused on policing your partner rather than enjoying him, is a relationship doomed to disaster.\n\nWith the best will in the world, your surveillance powers aren’t omnipotent, and if your man is intent on enjoying extra-curricular activities, he’ll find a way. What a squandering of your time and energy it is to focus on curtailing them. You’d be far better developing a great and irresistible relationship rather than invading your boyfriend’s privacy and keeping tabs on who he mingles with when he’s not in your eyeline. Your toxic levels of jealousy are as likely to destroy your relationship as any infidelity. Obsessive control is neither healthy nor tolerable and the sooner you deal with the origins of your trust issues the better for all concerned.\n\nIf you have a dilemma, send a brief email to mariella.frostrup@observer.co.uk. Follow her on Twitter @mariellaf1", "description": "You must master your jealously or it will play havoc with your relationship, says Mariella Frostrup", "authors": ["Mariella Frostrup"], "top_image": "https://i.guim.co.uk/img/media/d8ae1aa6b58d9ab10cd9f8260306a3d93c13364c/0_0_5581_3349/master/5581.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=91fd01aac9983c44b3c2cf2e72d16850", "published_at": "2019-10-20"}