{"pub": "cbs", "url": "https://cbsnews.com/news/uber-unveils-new-feature-samantha-josephson-death-as-rideshare-industry-faces-scrutiny-over-passenger-safety", "downloaded_at": "2019-09-26 15:07:24.635183+00:00", "title": "Uber unveils new safety features amid scathing report", "language": "en", "text": "An explosive new Washington Post report raises fresh questions about how Uber handles passenger safety. It focuses on Uber's \"special investigations unit\" which handles some of the worst incidents reported by passengers. The Post says agents in the unit are coached to put the company ahead of passenger safety -- allegations Uber disputes.\n\nThe report comes as the ride-hailing company unveils new safety features it hopes could prevent the kind of fatal error police believe South Carolina college student Samantha Josephson made when she mistook a car for her Uber earlier this year.\n\nTracey Breeden, a former police officer who now heads women's safety at Uber, told CBS News' Kris Van Cleave, the company \"really felt the responsibility to step up, even though that was not an Uber driver … but to step up and see what more we could do to create a safer environment.\"\n\nSoon a new optional verification system will require a driver to get a PIN code from their rider before a trip can start.\n\n\"The driver enters the PIN, you get an indication, a notification on your phone saying yes this is the right car,\" explained Sachin Kansal, Uber's senior director of safety product management. \"Whether it's checking the license plate, checking the name and now with the PIN verification, you should confirm that before you get in the car.\"\n\nUber wants to take this PIN verification system a step further by having your phone seamlessly talk to the phone of the Uber you've called. It will then tell you when the right vehicle has pulled up, that your ride is verified and this is the car to get into.\n\nNext month – first in Los Angeles and then elsewhere – riders can text 911 from inside the app, automatically sending the vehicle description, license plate, current location and destination. You'll also be able to report safety issues during a ride.\n\nWired editor-in-chief Nick Thompson said the changes Uber is making are smart and will help, but added that there are \"so many riders and so many passengers they are not going to make the entire problem of passenger safety go away.\"\n\nThe new features come as the ride-sharing industry at large faces scrutiny over passenger safety. This month, more than a dozen women sued competitor Lyft alleging it mishandled reports of sexual assault. Lyft says \"safety is fundamental\" adding it launched 14 new safety features this year.\n\nUber is facing similar lawsuits and there are new questions about the company's handling of sexual assault claims. The Washington Post reports the company has a three-strikes system but executives have made exceptions to keep drivers on the road. One former investigator says she was made to feel her first priority was to protect Uber, not the customer.\n\n\"Investigators do not report any of the incidents that happen on the Uber app to law enforcement,\" former Uber investigator Lilli Flores told The Washington Post. \"The lack of communication between the rideshare apps really puts people in a very dangerous position.\"\n\nBut Uber's Tracey Breeden told us as soon as a sexual assault or misconduct is reported, the driver is removed from the platform. Asked how often the company receives these reports, Breeden said, \"We're doing 17 million trips across the world every day. Every day. And it does happen.\" But she couldn't answer how many reports they see per year.\n\n\"Those are numbers that I don't have, and that's why we're creating this transparency report, and that information is coming,\" she said.\n\nThat would be a first for the industry but Uber was not able to tell CBS News when that transparency report would be available.\n\nLyft's full statement to CBS News:\n\n\"Safety is fundamental to Lyft, and since day one we have worked hard to design policies and features that protect riders and drivers. These include professional criminal background checks, driver and license plate information in the Lyft app, real-time ETAs and the ability to share your route and ETA with a friend, a two-way rating system, a dedicated Trust & Safety team available through a 24/7 Critical Response Line, and digital receipts.\n\nSince we were founded in 2012, we have continually strengthened and invested in the safety of our community. Just this year, we rolled out 14 additional safety features, including continuous criminal monitoring, enhanced identity verification, emergency assistance so riders and drivers can contact 911 from within the Lyft app, initiatives to better predict if someone needs help in a ride, and more. We also announced a partnership with RAINN, the nation's largest anti-sexual violence organization, to roll out require sexual violence prevention education. This important work never stops, and we are continually developing new tools and processes to strengthen our platform.\"", "description": "The company hopes this new technology could prevent the kind of fatal error police believe a college student made earlier this year", "authors": [], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/09/26/89bf098e-87f4-44a6-8483-17de141ae5cc/thumbnail/1200x630/1531aace28736e63ea2ae8ca4a523973/nfa-van-cleave-uber-safety-needs-gfx-frame-1702.jpg", "published_at": "2019-09-26"}