{"pub": "reuters", "url": "https://in.reuters.com/article/us-global-forex/dollar-firm-as-markets-wary-over-rising-mideast-tensions-wait-for-fed-idINKBN1W2035", "downloaded_at": "2019-09-17 13:10:34.299255+00:00", "title": "Dollar firm as markets wary over rising MidEast tensions, wait for Fed", "language": "en", "text": "LONDON (Reuters) - The dollar stood tall against other major currencies on Tuesday as geopolitical risks encouraged investors to flock to the relative safe-appeal of the greenback before a U.S. central bank policy meeting this week, where a rate cut is widely expected.\n\nFILE PHOTO: U.S. one hundred dollar notes are seen in this picture illustration taken in Seoul February 7, 2011. REUTERS/Lee Jae-Won/File Photo\n\nThough oil prices pulled back slightly after surging to four-month highs on Monday, they remained about 15% higher than Friday’s close as markets remain wary over the threat of a military response to attacks on Saudi Arabian crude oil facilities.\n\n“The dollar is in demand as risk sentiment remains weak and it will be difficult for the Fed to overcome already dovish market expectations,” said Manuel Oliveri, an FX strategist at Credit Agricole in London.\n\nTraders widely expect the Fed will cut interest rates by a quarter of a percentage point on Wednesday, and one more cut is largely priced in before the end of 2019.\n\nAgainst a basket of its rivals .DXY, the greenback edged up 0.1% to 98.66, heading toward a more than a two-year high of 99.37 earlier this month.\n\nThe Australian dollar led losers, falling 0.5% after the after the Reserve Bank of Australia flagged an easing bias in meeting minutes.\n\n“They no longer talk about an accumulation of evidence in order to ease again, and highlight risks to the global economy,” said National Australia Bank Senior FX Strategist Rodrigo Catril. “It certainly sounds a lot more dovish than before.”\n\nThe drop in the Aussie also pulled the kiwi lower, with the New Zealand dollar NZD= weakening 0.4%. against the greenback.\n\nThe dollar’s gains were also bolstered by an overnight spike in dollar funding costs.\n\nThe overnight rate in the repurchase agreement (repo) market USONRP=GCMN jumped to 4.10% from 2.29% late on Friday, its highest levels seen since the start of the year. Analysts attributed the rise to quarterly federal tax payments and supplies.\n\n(Graphic: Dollar positions, here)", "description": "The dollar stood tall against other major currencies on Tuesday as geopolitical risks encouraged investors to flock to the relative safe-appeal of the greenback before a U.S. central bank policy meeting this week, where a rate cut is widely expected.", "authors": ["Saikat Chatterjee", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190917&t=2&i=1430782672&w=1200&r=LYNXMPEF8G0NB", "published_at": "2019-09-17"}