{"pub": "wsj", "url": "https://wsj.com/articles/corporate-tech-spending-helps-lift-u-s-economy-11569367000?mod=rsswn", "downloaded_at": "2019-09-25 13:42:52.775794+00:00", "title": "Corporate Tech Spending Helps Lift U.S. Economy", "language": "en", "text": "The U.S. economy is getting a boost as companies pour money into software aimed at driving productivity and revenue growth, creating well paid jobs at the same time.\n\nMany of these companies are in industries or regions not traditionally considered advanced technology hubs.\n\nCarl Ceresoli, chief technology officer of Pacers Sports & Entertainment, the management company of the Indiana Pacers National Basketball Association team, said his information-technology department has roughly doubled in size within the past two years. The company has been investing in software, cloud computing and other resources to improve everything from selling tickets to guarding against cyberattacks, he said: “Software can help you sell more tickets because all this data is now available at your fingertips.”\n\nRamped-up spending on enterprise software, and the associated indirect impact of increased productivity and higher-paying jobs, last year added an estimated $1.6 trillion to U.S. gross domestic product, which totaled $20.5 trillion, according to a report by technology research and lobby group Software.org: the BSA Foundation. The 2018 figure was up from $1.3 trillion in 2016, the report said.\n\nBSA’s board of directors includes executives from Microsoft Corp. , Salesforce.com Inc., International Business Machines Corp. , Adobe Inc. and other large tech companies.\n\nThe U.S. enterprise software industry has expanded by 19% in the past three years, or nearly twice as fast as the overall economy, according to the report.\n\nVictoria Espinel Photo: BSA |The Software Alliance\n\n“A lot of what enterprise software companies do is to help other companies do what they do better, and that clearly has an impact on the economy,” said Victoria Espinel, the group’s president and chief executive.\n\nThe group’s estimates also include the indirect impact of increased software spending by companies outside of the tech sector as they hire more tech workers with big paychecks and more money to spend, she said.\n\nThe report found that states including Nevada, Wyoming, Colorado, Montana and Utah were particularly lifted by new tech jobs, with more than 20% of their 2018 economic growth coming from growth in the software industry.\n\nMost of the economic gains tracked by the group resulted from the spread of high-paying IT jobs. The U.S. has 14.4 million software-related workers, including 3.1 million employed directly by software companies, the report said.\n\nSoftware developers last year earned an average annual salary of $114,000, or roughly twice the average, the report said.\n\n“Higher wages generate more economic activity,” Ms. Espinel said.\n\nBhaskar Ghosh, group chief executive of technology services at consulting firm Accenture PLC, said the way companies invest in and use enterprise technology has a direct impact on their ability to boost revenue.\n\nHe said companies investing strategically in technologies, such as artificial intelligence and cloud computing, are performing “dramatically better than companies that are not.” Research shows that these companies on average are expanding revenue at double the rate of tech laggards, he added, citing the findings of an Accenture report set to be released later this month.\n\nInformation-technology trade group CompTIA estimates that tech is the third largest contributor to the U.S. economy behind manufacturing and government.\n\nTim Herbert, CompTIA’s senior vice president for research and market intelligence, said calculating the total impact of enterprise technology on the economy is difficult, since many of the traditional measures of productivity used by economists haven’t been adapted to how businesses and workers operate today.\n\nFor instance, there is no set method for assigning a dollar value to efficiency and productivity gains achieved by using mapping and navigation tools, Mr. Herbert said: “You pay for them indirectly via your broadband or wireless phone bill, but that understates the true value of the time savings and efficiency gains across the economy.”\n\nGlobal IT spending is expected to reach a total of $3.79 trillion by year-end, up 1.1% from 2018, according to enterprise IT research firm Gartner Inc.\n\n“We spend less and less time on tasks that don’t add value and these aren’t measured in GDP,” as a result of new software tools, said John-David Lovelock, a Gartner research vice president.\n\nMr. Lovelock said the big problems that software solves are difficult to quantify, even as they improve daily life—from doing away with expense reports to ordering pizza.\n\nWrite to Angus Loten at angus.loten@wsj.com", "description": "The U.S. economy is getting a boost as companies pour money into software aimed at driving productivity and revenue growth, creating well paid jobs at the same time.", "authors": ["Angus Loten", "Angus.Loten Wsj.Com"], "top_image": "https://images.wsj.net/im-110522/social", "published_at": "2019-09-24"}