{"pub": "cnn", "url": "https://us.cnn.com/2019/09/11/opinions/james-bond-as-a-woman-pierce-brosnan-thomas/index.html", "downloaded_at": "2019-09-22 07:18:31.045286+00:00", "title": "A female James Bond? It's the last thing we need (opinion)", "language": "en", "text": "Holly Thomas is a writer and editor based in London. She tweets @HolstaT . The opinions expressed in this commentary are solely those of the author. View more opinion articles on CNN.\n\nThere has been some confusion over the latest movie in the franchise, which does not actually replace James Bond (still played by Daniel Craig) with a woman, but instead gives a woman -- played by Lashana Lynch -- the codename of 007.\n\nIn detangling this plot point, which would have been far more fun to discover in the cinema, the question of whether it's time for a woman to be Bond has taken center stage. Some have protested this as a \"feminist snowflake \" notion, while others, including leading men Brosnan, Craig Chris Hemsworth and perennial Bond candidate Idris Elba, have suggested it's time for the titular character to have \"something different.\" This is a perfectly fine idea. But a more pertinent question might be: Why can't we make more female heroes to begin with?\n\nThere is no doubt that a woman could make a compelling Bond. Women are every bit as capable of playing seductive alcoholics with gambling issues as men are, and it would be wonderful to see how a female star made the part her own. But updating Bond by way of Adam's rib-ing him into a woman distracts from the necessity of characters and franchises which belong to women from the beginning.\n\nBeyond the obvious point that more female heroes are long overdue, it's worth noting that the ones who already exist are incredibly profitable. A 2018 survey showed that out of 350 box office hits between 2014 and 2017, those featuring a female lead outperformed those starring men -- despite the fact that women occupied less than a third of those roles. Films which passed the Bechdel test -- which measures whether two female characters have a conversation about something other than a man -- also performed better.\n\nAn example of this success is 2017's \"Wonder Woman.\" Having fought for years to get the film made, director Patty Jenkins' labor of love defied all expectations. \"Wonder Woman\" smashed the then-box office record for a superhero origin story (until Brie Larson's \"Captain Marvel\" topped that this year), became the biggest film directed by a woman and remains the most successful DC Universe film to date.\n\nOne of the loveliest things about Gal Gadot's portrayal of Wonder Woman was that it didn't inhabit the traditional male template for a comic book hero. Rather than \"beat the guys at their game,\" she played it on her own terms. She was tender and vulnerable, and her willingness to bring softness to the role - cooing at a baby, gasping at the flavor of ice cream - made the character multifaceted, and no less convincing a warrior.\n\nThe most interesting characters played by women in recent years have been the ones who ignore gendered expectations of what makes a compelling main character. \" Killing Eve \"'s psychopath Villanelle, played by Jodie Comer, is cold, calculated and utterly selfish. Eve -- played by Sandra Oh -- is her match, not because her goodness compensates for Villanelle's brutality, but because she is as interesting and conflicted in her own right. Eve is not perfectly loyal, or selfless or pure. As the series continues, she becomes as driven by her own interests and desires as Villanelle. They are both fascinating because the roles were theirs to begin with, offering the fantastically talented writers and actors the scope to build them from the ground up.\n\nThere should continue to be challenges of all kinds to the status quo in film and TV. When Jodie Whittaker was announced as the thirteenth -- and first female -- Doctor Who, the Internet furor over whether she would live up to favorites like David Tennant, and the ridiculous #NotMyDoctor hashtag, was a loud distraction from the commentary on her own merits as an actor.\n\nEven though the character of the doctor - who is just an alien masquerading as human -- is not classically masculine in the way that James Bond is, the conversation around Whittaker's casting had the same sickening template as those surrounding \"female versions\" of everything -- be that \"female president,\" \"female comedian\" or (for my money the nadir) -- \"girl boss.\" Whittaker was an excellent Dr. Who, and every bit as worthy of the role as any man. But she may have been accepted more easily if women were more regularly accepted as a first choice.\n\nGet our weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\n\nIn this context, it might be more interesting to reimagine the dated, misogynist character of Bond. While some might find it comforting to be served the exact same character again and again, watching a man from the 1950s negotiate the now-aging Millennium can only get more awkward. Bond's most interesting moments in recent years have been either in his adaptations -- the tender shower scene with Eva Green's Vesper Lynd in \"Casino Royale\" -- or when he tries and fails to order a martini at the juice bar in Spectre. Perhaps rather than a battle of the sexes over the part of a chauvinist relic from a time when burgers were thought to be exotic, it might be better to give women many, many more new leading roles, and let men shoulder the burden of Bond's evolution.", "description": "Perhaps rather than a battle of the sexes over the part of a chauvinist relic from a time when burgers were thought to be exotic, it might be better to give women many, many more new leading roles, and let men shoulder the burden of Bond's evolution, says Holly Thomas.", "authors": ["Opinion Holly Thomas"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/121004033508-pierce-brosnan-bond-story-top.jpg", "published_at": "2019-09-11"}