{"pub": "nyt", "url": "https://nytimes.com/2019/08/30/books/review/podcast-christopher-ketcham-this-land.html", "downloaded_at": "2019-09-04 03:46:08.454784+00:00", "title": "The Ruining of the American West", "language": "en", "published_at": "2019-08-30", "text": "Subscribe: iTunes | Google Play Music | How to Listen\n\nThe public lands system of the West is in trouble. Though technically land held in common by all American citizens and managed by the federal government, they are also used by the cattle industry. On this week’s podcast, Christopher Ketcham says that this “multiple use is really multiple abuse. And you have widespread degradation of the environment and in many places a catastrophic assault on ecological health across the public lands.”\n\nKetcham is an environmental reporter who’s spent a good deal of his adulthood roaming the mountains and deserts of the West. In “This Land” he laments what he sees as the exploitative ranching practices destroying the public lands.\n\n“Do we want to cede hundreds of millions of acres of our public land to a single industry that profits from the dissemination of an invasive species at the cost of native wildlife?” Ketcham asks. “That’s the question.”\n\nImage\n\nGretchen McCulloch visits the podcast this week to discuss her new book, “Because Internet: Understanding the New Rules of Language,” which explores the way that the Internet has created its own new forms of language. Talking about emojis, McCulloch says, “The first emoji that really caught my attention and imagination was the heart eyes emoji ... it conveys something that I want to be able to convey: admiration, enjoyment, and oh I’m in love with this thing.”", "description": "Christopher Ketcham talks about “This Land,” and Gretchen McCulloch discusses “Because Internet.”", "authors": [], "top_image": "https://static01.nyt.com/images/2019/08/30/books/30podcast-cover/30podcast-cover-facebookJumbo.jpg"}