{"pub": "townhall", "title": "It’s Not Just The Former Canadian Prime Minister Hoping Hurricane Dorian Hits Florida Because Of Trump", "url": "https://townhall.com/tipsheet/mattvespa/2019/08/30/its-not-just-the-former-canadian-prime-minister-hoping-hurricane-dorian-hits-florida-because-of-trump-n2552425", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:15:53.278669+00:00", "text": "Leah wrote about how classlessCanada’s former prime minister has been on social media as Hurricane Dorian barrels towards the Florida coast. The storm is expected to reach category four strength before making landfall. It’s a major hurricane. It could cost lives and property damage. American families’ homes could be devastated, but screw those people because Trump is president or something. Former Canadian Prime Minister Kim Campbell made those hopes known concerning Dorian directly hitting Mar-a-Lago. Yet, she’s not alone (via Newsmax):\n\nDavid Leavitt, an award-winning multimedia journalist also called for a direct hit on the exclusive club, and essentially blamed Dorian on Trump.\n\n“Trump: Climate change is a hoax,” he tweeted. “Here’s a Category 4 hurricane with 130+ mph winds aimed right at Mar-a-Lago, with my compliments.”\n\nAfter being hammered on Twitter for her classless tweet, Campbell also brought climate change into the equation.\n\n“As there are in Puerto Rico- sorry you don’t get snark- but Trump’s indifference to suffering is intolerable!” she said. “Wd also help if he tackled climate change which is making hurricanes more destructive! Instead, he will remove limits on methane! Get a grip!”\n\nShe’s correct that the Trump administration announced plans Thursday to relax regulation on methane emissions, but that didn’t contribute to Dorian’s fury. Moreover, Florida hurricanes have become less frequent, according to a report by The Economist.\n\nIn addition, the World Health Organization proclaimed that the United States was one of the cleanest countries on the planet.", "description": ".09/02/2019 3:15:20AM EST.", "authors": ["Matt Vespa", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/238/41ebc7b1-2841-48fe-b9e1-ac928b3cf272.png"}