{"pub": "nytimes", "url": "https://nytimes.com/2019/10/11/opinion/turkey-syria-military-operation.html", "downloaded_at": "2019-10-11 19:42:59.593341+00:00", "title": "Opinion | Why Turkey Took the Fight to Syria", "language": "en", "text": "Before proceeding with this operation, we have taken all steps to minimize risk to civilians and prevent a humanitarian crisis. Over the past several years, Turkey has provided shelter to large numbers of refugees from northeastern Syria, including Arabs, Kurds and Turkmens.\n\nMost of them, including over 300,000 Kurds, were driven from their homes by the terrorists. We have extended to them safety, shelter and livelihood in Turkey. We have shared our bread and the benefits of our public services. Turkey is the biggest humanitarian spender in the world and host to most refugees worldwide.\n\nTurkey has established a reliable pattern in the last three years. Turkey’s operations in northwestern Syria — in 2016-7 in and around Jarabulus and 2018 in Afrin — cleared a vast area of the terrorist presence. In the aftermath of those operations the communities that suffered under the terrorists started living in peace and benefiting from orderly governance. Some 365,000 refugees returned to their home in northwestern Syria.\n\nWe have instituted public services, including schools for over 230,000 students. Six hospitals with 55 ambulances employ over 2,000 Syrian and Turkish personnel in liberated areas in northwestern Syria. Scores of recreational and sports facilities were built, including a soccer stadium. Businesses were rehabilitated and a border gate was opened to facilitate trade. Agriculture and animal husbandry started receiving material support.\n\nCompare Turkey’s previous operations to the destruction of Raqqa by the coalition and you will see how carefully we manage counterterrorism operations. The lessons learned in those operations will help us make it even better this time around.\n\nThe P.K.K. and the P.Y.D./Y.P.G. have been blackmailing the global community by claiming that the fight against Daesh would falter without them. But the fight against those brutal terrorists will not falter, especially if our allies stay the course and cooperate with Turkey. We are the only nation that put boots on the ground against Daesh.\n\nThe fight against Daesh and other terrorist organizations will have to continue with everyone’s contributions and cooperation. Several European countries have been reluctant to allow the return of their citizens who joined the group. However, wishing away the problem cannot be the policy. They must shoulder their share of the burden.", "description": "The Turkish foreign minister says the military operation is necessary for national security and to help displaced Syrians return home.", "authors": ["Mevlut Cavusoglu"], "top_image": "https://static01.nyt.com/images/2019/10/11/opinion/11Cavusoglu1/11Cavusoglu1-facebookJumbo.jpg", "published_at": "2019-10-11"}