{"pub": "cnn", "title": "Earth's moon is shrinking and quaking, study says", "url": "https://cnn.com/2019/05/13/world/moon-shrinking-quakes-scn/index.html", "language": "", "published_at": "2019-05-13", "downloaded_at": "2019-09-02 07:33:42.032668+00:00", "text": "(CNN) The moon is slowly shrinking over time, which is causing wrinkles in its crust and moonquakes, according to photos captured by NASA's Lunar Reconnaissance Orbiter.\n\nUnlike Earth, the moon doesn't have tectonic plates. Instead, as the moon's interior has cooled over the last several hundred million years, it has caused the surface to wrinkle as it shrinks. Unlike the flexible skin of a grape when it shrinks into a raisin, the moon's brittle crust breaks. This creates stair-step cliffs called thrust faults as part of the crust is pushed up and over another close part of the crust.\n\nThere are now thousands of cliffs scattered across the moon's surface, averaging a few miles long and tens of yards high. The orbiter has taken photos of more than 3,500 of them since 2009. In 1972, Apollo 17 astronauts Eugene Cernan and Harrison Schmitt had to ascend one of these cliffs, the Lee-Lincoln fault scarp, by zig-zagging the lunar rover over it.\n\nThis is a view of the Taurus-Littrow valley and its cliffs, explored by Apollo 17 astronauts.\n\nToday the moon is 50 meters \"skinnier\" because of this process. And as it shrinks, the moon actively produces moonquakes along the faults. Researchers re-analyzed seismic data they had from the moon to compare with the images gathered by the orbiter.\n\nData from the seismometers placed on the moon during the Apollo 11, 12, 14, 15 and 16 missions revealed 28 moonquakes recorded between 1969 and 1977. Researchers compared the location of the epicenters for those quakes with the orbiter imagery of the faults. At least eight of the quakes occurred due to activity along the faults. This rules out the possibility of asteroid impacts or rumblings from the moon's interior.", "description": "The moon is slowly shrinking over time, which is causing wrinkles in its crust and moonquakes, according to photos captured by NASA's Lunar Reconnaissance Orbiter.", "authors": ["Ashley Strickland"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190513135251-moon-fault-lines-apollo-missions-super-tease.jpg"}