{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7579305/Victoria-Beckham-reveals-feels-confident-shes-older.html", "downloaded_at": "2019-10-16 14:13:12.806279+00:00", "title": "Victoria Beckham reveals she feels 'more confident' now that she's older", "language": "en", "text": "Victoria Beckham has revealed she has become more confident in herself as she has got older.\n\nThe fashion designer, 45, appeared on Wednesday's edition of This Morning where she told how she used to have 'little paranoias' when she was younger.\n\nShe said: '[I] definitely feel more confident now. Definitely. There were things that I used to, little paranoias that I used to have when I was younger about myself that I just don’t care so much about now that I’m older.\n\nInterview: Victoria Beckham, 45, has revealed she has become more confident in herself as she has got older\n\n'You know, I think it’s about focusing on the good bits and just being kind to yourself, you know. I mean, I think everybody should be kind to themselves and kind to each other.'\n\nThe former Spice Girl also discussed her dedication to fitness, putting her physique down to her exercise regime.\n\nShe said: 'I exercise a lot. I used to be a dancer before I was in the Spice Girls. My plan was to be a dancer and then everything changed.\n\n'So exercise and dance has always been key to me. But I enjoy it. I put on my own playlist and I dance and it makes me feel good.\n\nMemories: The fashion designer appeared on Wednesday's edition of This Morning where she told how she used to have 'little paranoias' when she was younger (pictured in 1997)\n\n'It makes me feel happy and I think it’s finding a form of fitness that you enjoy ultimately. I think you have to enjoy it.'\n\nIt comes after Victoria previously told how she also keeps healthy by drinking a lot of water and by telling herself that red wine is good for her.\n\n'Lots and lots of water,' she said. And I tell myself that it’s healthy to drink red wine, I heard that once!\n\n'And I think that it was probably the wine industry that said that, but I like it so I kind of throw that into the conversation as well.'\n\nVictoria said: 'There were things that I used to, little paranoias that I used to have when I was younger about myself that I just don’t care so much about now that I’m older'\n\nShe added: 'I think it’s about focusing on the good bits and just being kind to yourself, you know. I mean, I think everybody should be kind to themselves and kind to each other'\n\nHealth: The former Spice Girl also discussed her dedication to fitness, putting her physique down to her exercise regime\n\nVictoria was recently quizzed by Hoda Kotb on NBC's Today show about the 'secret sauce' that has kept her and husband David, 44, together for so long.\n\nAdmitting they always put their four children first, she said: 'The kids are our priority, everything we do revolves around the children. We both work really hard, we love what we do professionally.\n\n'We support each other, we're very lucky to have found each other and lucky that we're growing together.'\n\nThe pair tied the knot in July 1999 and have children Brooklyn, 20, Romeo, 17, Cruz, 14, and Harper, eight, together.\n\nRelationship: It comes after Victoria revealed she and husband David always put their children first in their relationship (pictured in November 2015)\n\nFamily: Victoria and David are parents to (L-R) Romeo, 17, Brooklyn, 20,Cruz, 14, and Harper, eight, together\n\nReminiscing about their first encounter two years prior to their wedding, Victoria admitted: 'It was love at first sight.'\n\nQuizzed about how they make their family unit work despite their busy schedules, Victoria said 'communication is key'.\n\n'We're very present in the kids' lives. We love our family, everything we do revolves around them', she added.\n\n'I think it's just being focused, working hard, having a great support team around us. And both of our parents help out with the kids.'\n\nThis Morning airs weekdays at 10:30am on ITV.", "description": "The fashion designer, 45, appeared on Wednesday's edition of This Morning where she told how she used to have 'little paranoias' when she was younger.", "authors": ["Sean O'Grady For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/12/19785012-0-image-a-120_1571225717341.jpg", "published_at": "2019-10-16"}