{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7619617/England-bed-hot-headed-tag-New-Zealand-win-Maro-Itoje-King-turnover.html", "downloaded_at": "2019-10-28 13:37:40.419322+00:00", "title": "England put to bed hot-headed tag in New Zealand win with Maro Itoje King of the turnover", "language": "en", "text": "Remember when England could not keep their heads? Remember when the battle of the breakdown was consistently a massacre in the penalty count in favour of their opponents?\n\nThat all changed on Saturday. In the 2018 Six Nations, England’s lowest ebb under Eddie Jones, those in white failed that challenge in every match bar conceding nine against Italy.\n\nIt was 10 versus Wales, 13 against Scotland, when Hamish Watson and John Barclay took the mickey at Murrayfield, 15 against France, with Mathieu Bastareaud on song, and 11 to the Irish at Twickenham.\n\nEngland have long been characterised for their lack of discipline and ability to gift penalties\n\nFast-forward 18 months and, thanks in no small part to Tom Curry, 21, and Sam Underhill, 23, the number of penalties England have conceded has plummeted. In this tournament they have been caught out just 36 times in five matches, compared to 58 in that 2018 Six Nations.\n\nAnd when it comes to turnovers, Maro Itoje has risen as the king. He has taken 10 turnovers here, including three in the All Blacks win.\n\nThis was the third match in which Itoje had picked an opponent’s pocket more than three times in a match — no one else in Japan has achieved that feat once.\n\nIn 18 months England coach Eddie Jones has addressed his side's discipline issues to keep cool\n\nNot far behind him are the Kamikaze Kids. Curry has nicked five at the World Cup and Underhill three, and the pair have only conceded two penalties each in the whole tournament.\n\nCurry spoke about England’s marked improvement when it comes to discipline.\n\n‘It was a big focus for us this week,’ he said. ‘At international level, penalties and kicks at goal and kicks to touch create a massive platform for the opposition.\n\n‘The All Blacks are no different. We knew how strong their set-piece was so that starts from our discipline. We can’t let them get a foothold in the game because once they build up momentum it’s really hard to get it back.\n\nMaro Itoje has embodied Englajnd's coolness with a tournament-high of 10 turnovers\n\nEngland youngsters Sam Underhill (L) and Tom Curry (C) have lead the front pack superbly\n\n‘You have got to have that element of pushing the boundaries but at the end of the day, once you have trained it into yourself, you are not giving those half-yard penalties, not giving those silly ruck penalties, it does come out on the pitch.\n\n‘You don’t want to be that guy giving the penalties away. Always learning.’\n\nAt last, comes the cry from every England fan. Not before time.\n\n*STATISTICS used with assistance from Simon Gleave, head of sports analysis at Gracenote, who is working as a Rugby World Cup analyst.", "description": "WILL KELLEHER IN YOKOHAMA: England have long been known for their inability to keep their cool, with their ill-discipline proving to be their biggest weakness in competitions gone by.", "authors": ["Will Kelleher For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/19/20253676-0-image-a-52_1572206008864.jpg", "published_at": "2019-10-27"}