{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7545499/China-calls-normal-footage-shows-shackled-blindfolded-Muslim-prisoners.html", "downloaded_at": "2019-10-07 12:28:26.724244+00:00", "title": "China calls it 'normal' after footage shows shackled and blindfolded Muslim prisoners", "language": "en", "text": "China has claimed that its authorities were carrying out 'normal' tasks after shocking footage purported to show hundreds of shackled and blindfolded Muslim prisoners being transferred.\n\nThe drone video, believed to be taken in Xinjiang in western China, shows the detainees being led from trains with their heads shaven, eyes covered and hands bound.\n\nThe video, uploaded to social media and unverified, appeared as the United States is increasing its pressure on Beijing over what it says is the systematic oppression of Muslims.\n\nSocial media footage purports to show Uighur Muslim prisoners being transferred in China\n\nWith their heads shaven, eyes covered and hands bound, the detainees are seen wearing purple vests with the words 'Kashgar Detention Center' written on their backs in the clip\n\nThe alleged prisoners are also seen in the clip sitting in rows outside what appears to be a train station watched by dozens of SWAT officers.\n\nMany of them, thought to be ethnic minority Uighurs, are seen wearing purple vests with the words 'Kashgar Detention Center' written on their backs.\n\nUS officials believed the footage to be authentic.\n\nUN experts and activists say at least one million ethnic Uighurs and other Muslims are held in the detention centres in Xinjiang. China describes them as 'training centres' helping to stamp out extremism and give people new skills.\n\nFormer detainees have revealed that Muslims were forced to eat pork and speak Mandarin in those internment camps.\n\nChina has also kept thousands of Uighur children away from their Muslim parents before indoctrinating them in camps posing as schools and orphanages, recent evidence shows.\n\nThe detainees are seen sitting in rows in a train station watched by dozens of SWAT officers\n\nThe clip then shows them being taken away by the SWAT officers to an unknown location\n\nA Western intelligence official was able to verify the movement of some 500 prisoners earlier this year from Kashgar to Korla in Xinjiang, a Muslim-dominant region in western China\n\nMuslims make up about two per cent of the 1.4 billion population in China. However, as the country is so populous, its Muslim population is expected to be the 19th largest in the world in 2030.\n\nThe Muslim population in China is projected to increase from 23.3 million in 2010 to nearly 30 million in 2030.\n\nThe clip, filmed by a Chinese-made DJI drone, was posted to YouTube last month by a user known as 'Fear on War'.\n\nWords in the video suggest the scene was captured in Bayingolin Mongol Autonomous Prefecture, an autonomous prefecture for Mongols in southern Xinjiang.\n\nA pervasive security apparatus has subdued the ethnic unrest that has long plagued China's north-western Xinjiang region. Chinese officials have largely avoided comment on the re-education camps, but some said that ideological changes are needed to fight separatism\n\nUighurs and other Muslim minorities in Xinjiang have been told to vow loyalty to the Communist Party of China and the country's leader Xi Jinping. Pictured, a woman walks past a screen showing images of Chinese President Xi Jinping in Kashgar on June 4, 2019\n\nAuthorities in China's Xinjiang region have rounded up an estimated one million mostly Muslim Turkic-speaking minorities into internment camps in what they call an 'anti-terror' campaign\n\nNathan Ruser, a researcher at the Australian Strategic Policy Institute, said the footage was likely to have been taken at the Korla West Train Station in Korla after analysing the footage, according to Mr Ruser's tweets.\n\nKorla is a city of 550,000 people in Bayingolin Mongol Autonomous Prefecture.\n\nAuthorities of Xinjiang said: 'Transporting inmates by judicial authorities (is related) to normal judicial activities.'\n\nIn a statement to CNN, the authorities said: 'Cracking down on crimes in accordance with law is the common practice of all countries.'\n\nThey added: 'Xinjiang's crackdown on crimes has never been linked to ethnicities or religions.'\n\nA Western intelligence official believed the footage to be authentic. The official was able to verify the movement of some 500 prisoners earlier this year from Kashgar to Korla, according to CNN.\n\nOmir Bekali cries as he details the psychological stress endured while in a Chinese internment camp. The programme aims to rewire detainees' thinking and reshape their identities\n\nA European security source also claimed that the footage was genuine and showed up to 600 Uighur Muslim prisoners being moved earlier this year.\n\nThe source told Sky News last month: 'This is typical of the way the Chinese move this type of prisoner.'\n\nNew York-based Human Rights Watch said the footage demonstrates the 'gross human rights violations' against Uighurs from Beijing.\n\nIt called for an independent investigation into China's treatment of its Muslim residents.\n\nA spokesperson from the group told MailOnline: 'While HRW hasn't yet corroborated this footage, it raises the specter of many of the same kinds of gross human rights violations against Uyghurs we have documented - especially mass arbitrary detention and lack of access to family or counsel.\n\n'It underscores the urgent need for an independent investigation; Chinese authorities lost all credibility on this issue months ago by denying these abuses even exist.'\n\nUighur men are seen leaving a mosque after prayers in Xinjiang's Hotan city on May 31, 2019\n\nChina is systematically indoctrinating Uighur Muslim children with detainee parents in what has been described as 'children's education camps', investigation has shown (file photo)\n\nRadical Muslim Uighurs have killed hundreds in recent years, and China considers the region a threat to peace in a country where the majority is Han Chinese. Armed police and soldiers are common sight in Xinjiang after ethnic unrest in capital Urumqi left nearly 200 people killed\n\nUS Secretary of State Mike Pompeo last week blasted China over its treatment of Uighur Muslims.\n\nPompeo reserved his toughest criticism for China in a keynote speech at a Vatican conference on religious freedom.\n\n'When the state rules absolutely, it demands its citizens worship government, not God. That's why China has put more than one million Uighur Muslims ... in internment camps and is why it throws Christian pastors in jail,' he said.\n\n'When the state rules absolutely, God becomes an absolute threat to authority,' he said.\n\nA building of what is officially called a vocational skills education centre in Hotan, Xinjiang\n\nMuslim trainees work in a factory in the Hotan Vocational Education and Training Center\n\nPompeo had previously called Beijing's treatment of the country's ethnic Uighur minority among 'the worst stains on the world'.\n\nBeijing slammed Pompeo's remarks as 'lies'.\n\n'The lies of American politicians can't trick people around the world and will only further expose the purpose of their hidden political motives,' said Chinese foreign ministry spokeswoman Hua Chunying.\n\n'We express our strong dissatisfaction and resolute opposition to these US officials who disregard the facts... and seriously interfere in China's internal affairs,' she told reporters at a press briefing in Beijing.\n\nUS Secretary of State Mike Pompeo last week said China 'demands its citizens worship government, not God' in a keynote speech at a Vatican conference on religious freedom\n\nChina has come under international scrutiny over its policies in the north-western region of Xinjiang, where as many as one million Uighurs and other mostly Muslim minorities are being held in re-education camps, according to the 2018 findings of an independent UN panel.\n\nAfter initially denying their existence, Beijing now defends the camps, which it calls 'vocational education centres', as a necessary measure to counter religious extremism and terrorism.\n\nBut former inmates and rights groups say individuals are subjected to political indoctrination and abuse.", "description": "The video, uploaded to social media and unverified, appeared as the United States is increasing its pressure on Beijing over what it says is the systematic oppression of Muslims.", "authors": ["Billie Thomson For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/10/19386470-0-image-a-2_1570440310430.jpg", "published_at": "2019-10-07"}