{"pub": "investing.com", "url": "https://ng.investing.com/news/forex-news/forexdollar-falls-as-oil-attacks-send-investors-to-safety-50940", "downloaded_at": "2019-09-16 02:21:23.353906+00:00", "title": "FOREX-Dollar falls as oil attacks send investors to safety", "language": "en", "text": "FOREX-Dollar falls as oil attacks send investors to safety\n\n* Attacks on Saudi oil facilities drive risk-off trade\n\n* Dollar weakens as yen, oil-correlated currencies rise\n\n* Fed, BoJ in focus later in the week\n\nSINGAPORE, Sept 16 (Reuters) - The dollar fell while\n\nsafe-havens and currencies of oil producing countries rallied on\n\nMonday, following an attack on Saudi Arabian refining facilities\n\nthat disrupted global oil supply and heightened Middle East\n\ntensions.\n\nOil prices surged more than 15% following the strikes on two\n\nplants, including the world's biggest petroleum processing\n\nfacility in Abqaiq, knocked out more than 5% of global oil\n\nsupply. Yemen's Iran-aligned Houthi group claimed responsibility for\n\nthe damage, but the U.S. has pointed the finger directly at\n\nIran. The Canadian dollar CAD=D3 rose 0.5% in morning trade in\n\nAsia to 1.3224 per dollar. The Norwegian krone rose\n\nalmost 0.6% to 8.9363 per dollar.\n\nBoth currencies often move together with the oil price\n\nbecause the countries are major oil exporters.\n\nThe attacks wiped out last week's ebullient risk appetite\n\nand prompted U.S. President Donald Trump tweeted the United\n\nStates was \"locked and loaded\" for a response.\n\nThe safe-haven Japanese yen and Swiss franc each lifted at\n\nleast 0.3% on the dollar. The yen JPY=EBS hit 107.60 per\n\ndollar and the franc touched $0.9871. Gold jumped\n\nby 1%.\n\nAgainst a basket of currencies the dollar was 0.2%\n\nlower at 98.053.\n\n\"If that part of the reason for last week's fall in oil and\n\nimprovement in geopolitical risk sentiment was the news of John\n\nBolton's sacking ... and thoughts this was a precursor to some\n\nform of rapprochement between Trump and Iran, then it is no\n\nlonger valid,\" said Ray Attrill, head of FX strategy at National\n\nAustralia Bank in Sydney.\n\nBeyond oil, currency markets are awaiting the outcome of\n\ncentral bank meetings in the U.S. and Japan this week and\n\ncrucial economic data in Australia and New Zealand that could\n\ndetermine the rates outlook in the Antipodes.\n\nMuch of the risk appetite on display last week was driven by\n\nsigns of a thaw in U.S.-China trade tensions, with both sides\n\noffering olive branches ahead of trade talks next month.\n\nHowever with few solid signs of progress, sentiment remains\n\nfragile.\n\n\"Geopolitical risks and central bank rhetoric remain key\n\ndrivers of risk this week,\" Australia and New Zealand Banking\n\nGroup analysts said in a note.\n\nIn the United States, investors who had begun trimming\n\nexpectations for a U.S. Federal Reserve rate cut on Wednesday\n\nare now certain rates will fall and divided only over how much.\n\nFEDWATCH\n\nMarkets also expect the Bank of Japan to push interest rates\n\nfurther into negative territory, with a third of economists\n\npolled by Reuters last week expecting stimulus to be ramped up.\n\nJapanese markets are closed on Monday for a public holiday.\n\nChina's premier on Monday said maintaining national economic\n\ngrowth above 6% is difficult, with protectionism weighing.\n\nRetail sales and industrial production figures due on Monday\n\nare likely to give further insight into the health of the\n\nworld's second-largest economy. The Chinese yuan was flat in\n\nmorning trade offshore CNH= .\n\nThe pound GBP=D3 held last week's gains, as fears of\n\nBritain crashing out of the European Union without a divorce\n\ndeal ebbed, while a news report on Friday also raised hopes that\n\na deal could be secured by Oct. 31. It steadied just under its highest since July 25 at $1.2491.\n\nThe euro EUR=D3 was steady at $1.1077.", "description": "FOREX-Dollar falls as oil attacks send investors to safety", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/sign_AUD_USD_b._800x533_L_1414405839.jpg", "published_at": "2019-09-16"}