{"pub": "businessinsider", "url": "https://businessinsider.my/trans-fats-linked-to-increased-risk-alzheimers-dementia-2019-10", "downloaded_at": "2019-10-25 16:23:52.356956+00:00", "title": "Eating lots of trans fats like packaged donuts and margarine could make you 75% more likely to get Alzheimer’s", "language": "en", "text": "caption Trans fats in fried and processed foods are bad for your brain as well as your heart, new research says. source Shutterstock\n\nTrans fatty acids, or trans fats, are a type of fat that has long been linked to health risks, including heart disease.\n\nNew research has found that trans fats may also significantly increase the risk of Alzheimer’s and other forms of dementia, by as much as 75%.\n\nAlthough the FDA banned Trans fats in the US in 2018, they can still be found in some processed foods manufactured before that date. They’re also found naturally in meat and dairy.\n\nVisit INSIDER’s homepage for more.\n\nTrans fatty acids, a type of unsaturated fat often used in food processing and added to fried food, snacks, and pastries, have long been associated with “bad” cholesterol, heart disease, and other health problems.\n\nThere’s now evidence to suggest that they’re also linked to Alzheimer’s and other forms of dementia, according to research published Wednesday in the journal Neurology.\n\nResearchers from Kyushu University, Kobe University, and Nakamura-Gakuen University in Japan tracked 1,628 elderly Japanese residents without dementia for 10 years, including by taking blood samples and analyzing their diets.\n\nThey found that those with the highest levels of trans fats in their blood were 52% to 75% more likely to develop dementia than people with the lowest levels of trans fats. This was the case even after adjusting for other dietary and lifestyle factors, including total calorie intake and consumption of other types of fats.\n\nThe researchers also pinpointed sweet pastries as the strongest contributor to higher trans fats levels in the blood, followed by margarine.\n\n“This study is important as it builds upon prior evidence that dietary intake of trans fats can increase risk of Alzheimer’s dementia,” neurologist Dr. Richard Isaacson, director of the Alzheimer’s Prevention Clinic at Weill Cornell Medicine in New York, told CNN. Isaacson wasn’t involved in the study.\n\ncaption Sweet pastries were the strongest contributor to higher trans fat levels in the blood, according to the study. Meat and dairy naturally has some trans fats. source LauriPatterson/Getty Images\n\nTrans fats are banned in the US, but some products still contain them\n\nThe FDA banned trans fats in the U.S. in 2015, with the regulation taking effect in June 2018. The World Health Organization has plans to eliminate trans fats from foods worldwide by 2023.\n\nBut some foods like margarine, cookies, snacks, and other processed foods still contain artficial trans fats since the FDA extended the deadline to June 2019 to allow companies to reformulate their products. Those items containing trans fats can still be sold until January 2021, according to the FDA.\n\n“In the United States, the small amounts still allowed in foods can really add up if people eat multiple servings of these foods, and trans fats are still allowed in many other countries,” study author Dr. Toshiharu Ninomiya, a professor at Kyushu University in Fukuoka, Japan, said in a statement.\n\nOther foods, such as meat and dairy, naturally contain some trans fats. Beef, lamb, cheese, and butterfat contain small amounts of trans fats, but it’s not clear if these are as bad for cholesterol levels as artificial trans fats, according to the American Heart Association.\n\nThe association recommends avoiding trans fat as much as possible. To start, be wary of items containing hydrogenated vegetable oils, a common source of trans fat.\n\nRead more:\n\nSome doctors say women should avoid cheese due to its link to breast cancer\n\nNew dietary guidelines suggest people should keep eating red meat and processed meat, but nutrition experts says the report is irresponsible\n\nThere’s nothing dangerous about high-fructose corn syrup. Here are 6 times we’ve gotten the risks of food additives wrong.", "description": "Business Insider - The 10-year study of elderly Japanese adults confirmed that trans fats, which are banned in the US, aren't only bad for the heart.. Read more at businessinsider.my", "authors": [], "top_image": "https://static.businessinsider.my/sites/3/2019/10/5db1ea0e045a315b6f26e593.png", "published_at": "2019-10-24"}