{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/brit-taken-hostage-kuwait-15-20526626", "downloaded_at": "2019-10-07 00:21:59.032721+00:00", "title": "Brit taken hostage in Kuwait at 15 relives moment Saddam Hussein released him", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA hostage of Saddam Hussein has relived the dramatic moment the Iraqi dictator released him.\n\nAlan Barnett was 15 when his India-bound plane landed in Kuwait during the first Gulf War in 1990.\n\nThe teenager, on his way back to boarding school, and his fellow passengers were held under guard at the airport for 10 days before being transferred to Baghdad.\n\nThings were looking bleak for Alan until they were moved on to Hillah and Saddam visited. After a group photo with the hostages a woman called Pat told the leader Alan’s age.\n\n(Image: SWNS)\n\nAlan vividly recalls her words : “Pat said to him, ‘Mr President, this boy is only 15-years-old and his parents don’t know if he is alive. Is there anything you can do for him?’.\n\n“He paused and turned and said something to the interpreter.\n\n\"The interpreter looked stunned and said, ‘The President of Iraq has just asked if you would like to go home?’.\n\n\"At that point I burst into tears. It was an overwhelming sense of joy and bewilderment.”\n\nAlan was given $500 and put on a plane to Jordan, where British Airways reps escorted him back to London to reunite him with his family.\n\n(Image: Bath Chronicle / SWNS)\n\nAlan, now a 44-year-old accountant living in Bath, said: “Clearly Saddam Hussein was an evil man, but he was also a product of his upbringing.\n\n“His stepfather would beat him with iron rods and he was in gangs. That’s not to excuse what he did.”\n\nThe married dad of two said: “I had never felt any animosity towards him. I was grateful I was released but I never felt in danger.”\n\nBritons among the plane’s 367 passengers and crew were held by Saddam’s regime for five months.", "description": "Alan Barnett was on his way back to boarding school in India - but when his plane landed in Kuwait - he was held under guard at the airport for 10 days", "authors": ["Louie Smith", "Image", "Bath Chronicle", "Swns"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20525735.ece/ALTERNATES/s1200/1_Alan-Barnett.jpg", "published_at": "2019-10-06"}