{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/snap-stock-price-jumps-after-morgan-stanley-share-upgrade-2019-10-1028577550", "downloaded_at": "2019-10-04 17:01:39.615663+00:00", "title": "Snap climbs after Morgan Stanley issues three-pronged praise in stock upgrade (SNAP)", "language": "en", "text": "Lucy Nicholson/Reuters\n\nSnap traded as much as 5.9% higher early Friday after Morgan Stanley upgraded the company and praised three elements of its business.\n\nThe Snapchat-parent's improved ad revenue, operating efficiencies, and profitability outlook prompted the bank's analysts to bump their price target to $17 per share from $14 and upgrade the stock to \"equal-weight\" from \"underweight.\"\n\nContinued investment in partnerships, original content and daily active user growth would make the firm more positive on Snap stock, the analysts' note said.\n\nWatch Snap trade live here.\n\nSnap Inc. traded as much as 5.9% higher early Friday after Morgan Stanley upgraded the Snapchat-parent and praised three key elements of its business.\n\nThe Snapchat-parent's improved ad revenue growth, cost efficiencies, and profitability prompted a stock upgrade, Morgan Stanley analysts wrote in the Friday note.\n\n\"At a high level, we have underestimated Snap's stronger top and bottom-line execution and ability to drive growth and upward revisions,\" the analysts wrote.\n\nThe team of analysts led by Brian Nowak upgraded the stock to \"equal-weight\" from \"underweight,\" and bumped their price target to $17 per share from $14.\n\nRead more: 'It's become table stakes': Some media buyers say Snapchat is becoming a mainstay for clients, with some increasing ad spending as much as 40%\n\nA collection of new products have allowed advertisers to better optimize spending on Snapchat, the note said. There's \"room for higher monetization\" in North America as per-user ad revenue remains relatively low compared to Snap's peers, according to the analysts.\n\nPaired with improved operating efficiencies, the revenue boost should send Snap's margins higher through the next few years, the analysts said. The company is \"executing at a materially higher level from a revenue and [operating expenses] perspective,\" they added.\n\nMorgan Stanley noted that growth in daily active users and \"on-platform innovation\" are necessary for an \"overweight\" rating upgrade. Continued investment in original content and partnerships would also increase positive sentiment toward Snap stock, the note said.\n\nSnap traded at $14.47 as of 11:25 a.m. Friday, up roughly 163% year-to-date.\n\nThe company has 11 \"buy\" ratings, 25 \"hold\" ratings, and three \"sell\" ratings from analysts, with a consensus price target of $17.33, according to Bloomberg data.\n\nNow read more markets coverage from Markets Insider and Business Insider:\n\nA flood of new data from the US and eurozone suggests recession risks are flashing red. Here's a full rundown of the wreckage.\n\n'Wow America': Trump questions how he can be impeached with US unemployment at a 50-year low\n\nRead the memo Refinery29 leaders sent to staff about Vice Media buying the company\n\nMarkets Insider", "description": "Snap traded as much as 5.9% higher early Friday after Morgan Stanley upgraded the company and praised three elements of its business. The Snapchat-parent'...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d9740e355824d07d96a8e0a-2000/rtsxkb2.jpg", "published_at": "2019-10-04"}