{"pub": "independent", "url": "https://independent.co.uk/news/world/middle-east/turkey-syria-us-trump-self-defence-pentagon-isis-kurds-a9153061.html", "downloaded_at": "2019-10-12 11:15:31.258927+00:00", "title": "US warns Turkey it has right to self-defence after shells hit near American base in Syria", "language": "en", "text": "The US has warned Turkey that it has a right to self-defence as the Pentagon confirmed US forces near the town of Kobane came under Turkish artillery fire on Friday evening.\n\nMark Esper, the US defence secretary, said Turkey risks “serious consequences” by continuing its offensive against Kurdish-held areas in Syria, which came after Donald Trump withdrew US troops from the border this week.\n\n“The explosion occurred within a few hundred metres of a location outside the Security Mechanism zone and in an area known by the Turks to have US forces present,” Navy Captain Brook DeWalt said in a statement.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“The US demands that Turkey avoid actions that could result in immediate defensive action.”\n\nAll US troops were accounted for with no injuries after the incident and US forces have not been withdrawn from Kobane, the spokesperson said.\n\nShape Created with Sketch. Turkey launches offensive into Syria Show all 25 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Turkey launches offensive into Syria 1/25 Turkish soldiers with armored vehicles EPA 2/25 A woman flees with her children during Turkish bombardment on Syria's northeastern town of Ras al-Ain AFP/Getty 3/25 AFP/Getty 4/25 The first group of Turkish infantry prepare to enter Syria on the border Getty 5/25 Civilians flee AFP/Getty 6/25 Smoke billows from targets inside Syria AP 7/25 Turkish armoured vehicles enter Syria in Akcakale Getty 8/25 Civilians leave as smoke rises from Ras al-Ain AFP 9/25 A multi-rocket launcher fires in an unknown location Turkish Defence Ministry via Reuters 10/25 People wave as Turkish soldiers prepare to cross the border Getty 11/25 Girls stand together in Ras al Ain town Reuters 12/25 A woman walks as smoke billows following Turkish bombardment in Syria's northeastern town of Ras al-Ain AFP/Getty 13/25 A Turkish army's tank drives down from a truck towards the border with Syria AFP/Getty 14/25 Turkish jet taxis on tarmac after returning to a military base in southeast Diyarbakir Reuters 15/25 A Turkish armored vehicle drives down a road during a military operation in Kurdish areas of northern Syria EPA 16/25 People sit on belongings at a back of a truck as they flee Ras al Ain town Reuters 17/25 Turkey-backed Syrian opposition fighters enter Tel Abyad AFP/Getty 18/25 Civilians flee AFP/Getty 19/25 People flee Tal Abyad North Press Agency/Reuters TV 20/25 People wave as Turkish soldiers prepare to cross the border into Syria Getty 21/25 Civilians flee with their belongings AFP/Getty 22/25 AFP/Getty 23/25 Turkish President Recep Tayyip Erdogan, right, speaks with Defense Minister Hulusi Akar, left, as they watch the operation by Turkish forces in Kurdish areas EPA 24/25 Smoke rises from the Syrian town of Tal Abyad AFP/Getty 25/25 Turkey-backed members of Syrian National Army prepare for moving to Turkey with heavy armed vehicles EPA 1/25 Turkish soldiers with armored vehicles EPA 2/25 A woman flees with her children during Turkish bombardment on Syria's northeastern town of Ras al-Ain AFP/Getty 3/25 AFP/Getty 4/25 The first group of Turkish infantry prepare to enter Syria on the border Getty 5/25 Civilians flee AFP/Getty 6/25 Smoke billows from targets inside Syria AP 7/25 Turkish armoured vehicles enter Syria in Akcakale Getty 8/25 Civilians leave as smoke rises from Ras al-Ain AFP 9/25 A multi-rocket launcher fires in an unknown location Turkish Defence Ministry via Reuters 10/25 People wave as Turkish soldiers prepare to cross the border Getty 11/25 Girls stand together in Ras al Ain town Reuters 12/25 A woman walks as smoke billows following Turkish bombardment in Syria's northeastern town of Ras al-Ain AFP/Getty 13/25 A Turkish army's tank drives down from a truck towards the border with Syria AFP/Getty 14/25 Turkish jet taxis on tarmac after returning to a military base in southeast Diyarbakir Reuters 15/25 A Turkish armored vehicle drives down a road during a military operation in Kurdish areas of northern Syria EPA 16/25 People sit on belongings at a back of a truck as they flee Ras al Ain town Reuters 17/25 Turkey-backed Syrian opposition fighters enter Tel Abyad AFP/Getty 18/25 Civilians flee AFP/Getty 19/25 People flee Tal Abyad North Press Agency/Reuters TV 20/25 People wave as Turkish soldiers prepare to cross the border into Syria Getty 21/25 Civilians flee with their belongings AFP/Getty 22/25 AFP/Getty 23/25 Turkish President Recep Tayyip Erdogan, right, speaks with Defense Minister Hulusi Akar, left, as they watch the operation by Turkish forces in Kurdish areas EPA 24/25 Smoke rises from the Syrian town of Tal Abyad AFP/Getty 25/25 Turkey-backed members of Syrian National Army prepare for moving to Turkey with heavy armed vehicles EPA\n\nAt least 30 civilians have been killed in Syria since the Turkish 'Operation Peace Spring' began on Wednesday, the UK-based Syrian Observatory for Human Rights reported on Saturday.\n\nTurkey’s Defence Ministry has said US forces were not targeted and it was returning fire from Kurdish fighters that originated near the base close to Kobane.\n\n“The firing was ceased as a result of the issue being relayed to us by the US,” the ministry said.\n\nTop Pentagon officials have stressed the need for Turkey to avoid endangering US forces inside Syria, which numbered about 1,000 before the offensive began.\n\nAlthough the US does not plan on firing on Turkey, which is a Nato ally, the Pentagon has noted the US troops’ right to defend themselves.\n\n“Everyone is fully aware that we are the United States military. We retain the right of self-defence,” General Mark Milley, the chairman of the Joint Chiefs of Staff, said.\n\nThe White House has also threatened to “shut down the Turkish economy” with sanctions over its military action.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nTurkey’s offensive began days after Mr Trump spoke with Recep Tayyip Erdogan, the Turkish president, and ordered US troops to withdraw from northern Syria.\n\nLord Robertson, a former UK defence secretary and secretary-general of Nato, said Mr Trump’s decision showed the importance of Nato and international military alliances.\n\n“At the moment we are in a situation where the Trump administration's capricious way of dealing with foreign policy has led to complete confusion in the world today and has allowed some very bad actors to take centre stage,” Lord Robertson said.\n\nThe Trump administration has been accused by Kurdish leaders and US lawmakers of abandoning its allies by withdrawing troops.\n\nTurkey has said its aim is to defeat the Kurdish YPG militia, who have led the fight against Isis in Syria, and said that the military operation will continue.\n\nMore than 100,000 people have been forced to flee their homes since the offensive began on Wednesday, according to the UN.\n\nAgencies contributed to this report", "description": "The US has warned Turkey that it has a right to self-defence as the Pentagon confirmed US forces near the town of Kobane came under Turkish artillery fire on Friday evening.", "authors": ["Conrad Duncan"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/12/11/Syria-border.jpg", "published_at": "2019-10-12"}