{"pub": "cbs", "url": "https://cbsnews.com/news/syria-turkey-mark-esper-secretary-of-defense-us-preparing-to-evacuate-all-troops-from-northern-syria-face-the-nation", "downloaded_at": "2019-10-13 23:33:40.489923+00:00", "title": "U.S. \"preparing to evacuate\" remaining troops from northern Syria, defense secretary says", "language": "en", "text": "Washington — The U.S. is \"preparing to evacuate\" about 1,000 U.S. troops from northern Syria \"as safely and quickly as possible,\" Defense Secretary Mark Esper told \"Face the Nation\" in an interview Sunday.\n\nThe move comes a week after President Trump announced the repositioning of several dozen American troops embedded with Kurdish forces in northern Syria, opening the door for a Turkish offensive against the Syrian Defense Forces (SDF), the main U.S. allies in the fight against ISIS.\n\n\"In the last 24 hours, we learned that [the Turks] likely intend to extend their attack further south than originally planned, and to the west,\" Esper said. \"We also have learned in the last 24 hours that the ... SDF are looking to cut a deal, if you will, with the Syrians and the Russians to counterattack against the Turks in the north.\"\n\nEsper told \"Face the Nation\" the troops remaining in the country were caught between Turkish forces and the SDF. According to the United Nations, more than 100,000 internally displaced people are fleeing the violence.\n\n\"And so we find ourselves, we have American forces likely caught between two opposing advancing armies, and it's a very untenable situation,\" Esper said. \"So I spoke with the president last night, after discussions with the rest of the national security team, and he directed that we begin a deliberate withdrawal of forces from northern Syria.\"\n\nAsked if the U.S. had the authority to return fire, Esper said U.S. troops \"have the right to self defense and we will execute it if necessary.\"\n\nShortly after the initial pullback last week, Turkey began its onslaught, attacking the northern part of the country. On Saturday, the fourth day of the offensive, Turkish forces captured a key border town from the SDF. ISIS prisoners were also able to escape imprisonment when Turkish artillery hit a prison compound.\n\nWhile the U.S. move is a gift to the government of Turkish President Recep Tayyip Erdogan, it's seen as a stark betrayal of the Kurds who have fought alongside U.S. forces for years to defeat ISIS. The Kurds, former U.S. officials and senior Republican lawmakers have warned the U.S. pullout from the region could give ISIS room to rebuild, and send a message that the U.S. is willing to abandon close allies when the political winds change.", "description": "\"We have American forces likely caught between two opposing advancing armies,\" Secretary Mark Esper told \"Face the Nation\"", "authors": ["Emily Tillett", "Margaret Brennan"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/10/13/bb90c9e7-574d-470f-ad0a-03d7a2f2fed7/thumbnail/1200x630g3/3a061ea96a338b5e7c18a0e74b51a96e/esper.png", "published_at": "2019-10-13"}