{"pub": "investing.com", "title": "Ripple Price (XRP) Primed For More Downsides Near Term", "url": "https://newsbtc.com/2019/09/02/ripple-price-xrp-primed-for-more-downsides-near-term", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-02 07:50:41.311297+00:00", "text": "Ripple price is trading in a downtrend below the $0.2600 and $0.2650 supports against the US dollar.\n\nThe price is likely to extend its decline as long as it is below the $0.2650 level.\n\nThere is a key bearish trend line forming with resistance near $0.2570 on the hourly chart of the XRP/USD pair (data source from Kraken).\n\nThere could be an upside correction, but the price is likely to face sellers near $0.2600 or $0.2620.\n\nRipple price is facing a lot of hurdles on the upsides against the US Dollar and bitcoin. XRP price remains at a risk of more downsides unless it settles above $0.2650.\n\nRipple Price Analysis\n\nThis past week, we saw a significant decline in bitcoin, Ethereum and ripple against the US Dollar. XRP broke the key $0.2650 and $0.2600 support levels to enter a bearish zone. Moreover, there was a close below $0.2650 and the 100 hourly simple moving average. It opened the doors for more downsides and the price traded towards the $0.2500 level. A swing low was formed near $0.2460 and later the price corrected higher.\n\nA decent support base was formed near $0.2475 and recently the price corrected above $0.2500. Moreover, there was a break above the $0.2550 resistance. However, the price struggled to gain momentum above $0.2600. The recent swing high was formed near $0.2605 and the price dipped back towards $0.2500. The recent low was formed at $0.2507 and the price is currently correcting higher.\n\nIt traded above $0.2550 plus the 50% Fib retracement level of the recent decline from the $0.2605 high to $0.2507 low. However, the $0.2580 level seems to be acting as a strong resistance. Additionally, ripple price failed near the 76.4% Fib retracement level of the recent decline from the $0.2605 high to $0.2507 low. More importantly, there is a key bearish trend line forming with resistance near $0.2570 on the hourly chart of the XRP/USD pair.\n\nTherefore, an upside break above the $0.2580 and $0.2600 levels is needed for more upsides. The next key resistance is near the $0.2620 level (the previous support). Having said that, the price must break the $0.2650 resistance to move back into a positive zone.\n\nLooking at the chart, ripple price is facing a lot of hurdles on the upside near $0.2600 and $0.2620. On the downside, an immediate support is at $0.2500. The main support is at $0.2475, below which the price could tumble towards $0.2400.\n\nTechnical Indicators\n\nHourly MACD – The MACD for XRP/USD is struggling to gain pace in the bullish zone.\n\nHourly RSI (Relative Strength Index) – The RSI for XRP/USD is currently near the 50 level.\n\nMajor Support Levels – $0.2520, $0.2500 and $0.2475.\n\nMajor Resistance Levels – $0.2580, $0.2600 and $0.2620.", "description": "Ripple price is facing a lot of hurdles on the upsides against the US Dollar and bitcoin. XRP price remains at a risk of more downsides unless it settles above $0.2650.", "authors": [], "top_image": "https://www.newsbtc.com/wp-content/uploads/2018/02/Ripple_Price_XRP_USD_Analysis7.jpg"}