{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/07/alex-ovechkin-throwing-first-pitch-before-game-deepens-capitals-nationals-connection", "downloaded_at": "2019-10-07 20:09:35.772781+00:00", "title": "Alex Ovechkin throwing the first pitch before Game 4 deepens the Capitals-Nationals connection", "language": "en", "text": "\n\nAlex Ovechkin will throw out the first pitch ahead of Game 4 at Nationals Park on Monday. (Alex Brandon)\n\nWashington Capitals assistant coach Blaine Forsythe gritted his teeth in his St. Louis hotel room Tuesday night as he nervously watched the National League wild-card game. It was the night before the Capitals’ season-opening win against the St. Louis Blues, and Forsythe, like many other Capitals players and coaches, had stayed up to watch the Nationals stage a dramatic comeback on their way to advance to the NL Division Series against the Los Angeles Dodgers.\n\nFrom watching the wild-card game from their hotel rooms in St. Louis, to finding nearby eateries during their trip to New York to watch Game 2 because their hotel wasn’t showing the game, to some players attending Game 3 Sunday night, the Capitals are one of the Nationals’ biggest supporters.\n\n“I was probably more nervous watching that wild-card game than Game 5 of the Stanley Cup finals two years ago,” Forsythe said. “I was a nervous fan. It was a lot tougher to watch than be a part of just because we all want them to do so well. We saw the way the city reacted with what we did a couple years ago, and we’re hoping that can happen for them too because we will be part of it for sure.”\n\nMonday night, with the Nationals facing elimination in Game 4, captain Alex Ovechkin will be throwing out the first pitch, as he did three days after the Capitals won the Stanley Cup. Then, he was joined on the field by his teammates, all sporting red Nationals T-shirts, to kick off what would be an alcohol-fueled day of celebration, as they took turns holding up the Stanley Cup in a private suite to rousing applause from the happy locals.\n\nIt was the merging of both fan groups at once, and now, it’s the Capitals turn to reciprocate. Currently, the Capitals’ “Hard Hat” award is in the form of a Nationals batting helmet. The award is given to the most deserving player of the night.\n\nForsythe said the team jokingly had thrown out the idea of having the award in the form of a Nats batting helmet after watching the wild-card game, and players loved it. So, with little Nationals gear available to them in St. Louis, the team improvised, buying a red batting helmet and putting a paper Nats logo on it. Defenseman Martin Fehervary got the honor of wearing it the first night, after his NHL debut. Then, when the team traveled to New York to play the Islanders, the Nationals equipment staff sent the Capitals a real batting helmet to use.\n\nCapitals “Hard Hat” award is currently in the form of a Nationals batting helmet. It will eventually change, but now it’s in support of the Nats’ postseason run.\n\n\n\nAlso an excuse for another shaving cream + Samsonov face pic for the timeline. pic.twitter.com/wMQ4XgBLyN — Samantha Pell (@SamanthaJPell) October 5, 2019\n\nOne of the most supportive Capitals has been center Evgeny Kuznetsov.\n\nKuznetsov, who said he is one of the few Russians who “actually likes baseball” and “baseball is not boring” to him, attended both the wild-card game and Game 3 of the NLDS on Sunday. Opening the season on a three-game suspension for inappropriate conduct, Kuznetsov instead took the opportunity to watch the wild-card game in person. He was caught on video doing his famously joyful prancing bird celebration after the comeback win and high-fiving anyone around him as chaos ensued.\n\n“I like spending time over there, and plus I like this type of atmosphere, especially in this type of game, you know?” he said. “It is not just to support D.C. sports; it is showing respect to our fans and to D.C. fans that even if we still like some other teams, we still support our culture.”\n\nThe 27-year-old said he knew nothing about baseball until six years ago, when he first joined the Capitals. Recently, he became more invested, watching more baseball during the offseason because “there is not much on TV during the summer.” Kuznetsov said one of his good friends is a New York Yankees fan, so “just to piss him off” he got into the habit of watching baseball games and rooting for any team but the Yankees. Now Kuznetsov is fully on board with the Nationals.\n\n“I mean always when one of your team play better and better every year, you try to get involved,” Kuznetsov said. “When your team suck, it is hard to cheer for them, right? It is hard to be involved. You know, I am one of those people who always believe in the teams on the bottom.\"\n\nKuznetsov said he does not have a relationship with any of the Nationals, but would like to.\n\n“I mean, I wish!” Kuznetsov said. “I see them a couple times in the locker room, but you know, what am I going to tell them? ‘Hey what’s up?’ They have a pretty busy schedule.\"\n\nGoaltender Braden Holtby is one of the biggest baseball fans in the Capitals’ dressing room, growing up playing the sport in Canada. Holtby played baseball instead of hockey during the summer months, at catcher and shortstop, until he signed professionally for hockey. He rooted mainly rfor the Toronto Blue Jays during his childhood, briefly also watching the Montreal Expos.\n\n“Growing up there, [baseball and hockey] went hand in hand,” he said. “I didn’t like one more than the other; it just so happens that there is a little more opportunity for hockey players in Canada. The season in Western Canada is a little longer for hockey.”\n\nHoltby knew some former Nats, such as Bryce Harper, better than the current ones, but he still enjoys crossing paths with the players and believes in their playoff chances.\n\n“That team is awesome,” Holtby said. “Looks like they have fun and a lot of good guys on that team so it is easy to get behind them. It is really fun to watch.”\n\nFor Forsythe, supporting the Nationals has been nothing new. He became close friends with outfielder Adam Eaton three years ago when their wives made introductions. With sons the same age and Forsythe a big baseball fan and Eaton a hockey fan, the two got along well. Forsythe wore a Nationals hat on the ice the morning of the wild-card game.\n\n“I think there has always been more of an open connection between the two teams for some reason,” Forsythe said. “Whatever it is, I think it’s only grown, and obviously over the last few years, both teams have been having a little it of success. We get a lot of support from them, whether it is in the playoffs or when they are around and there are always guys at the games or at practices and stuff. The least we can do is return the favor.”\n\nRead more on the Washington Capitals:\n\nWith Evgeny Kuznetsov’s return, Capitals make cap-related roster moves\n\nMeet Captain, the Capitals’ new puppy and service dog in training\n\nWe asked Capitals players to draw themselves (and other things)\n\nCapitals name defenseman John Carlson an alternate captain", "description": "\"We saw the way the city reacted with what we did a couple years ago,\" Capitals assistant coach Blaine Forsythe said, \"and we’re hoping that can happen for them too because we will be part of it for sure.”", "authors": ["Samantha Pell", "Reporter Covering High School Sports", "October At Am", "Samantha Pell Covers High School Sports For The Washington Post. She Was Previously An Intern In The Sports Department In The Summer Of"], "top_image": "https://www.washingtonpost.com/resizer/iAVoKpDYRpz951LJWdYumnCUiig=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/5ICEKDTMC4I6RIZVYRID2BA6V4.jpg", "published_at": "2019-10-07"}