{"pub": "breitbart", "url": "https://breitbart.com/news/wada-compliance-arm-to-rule-on-russia-doping-data-next-month", "downloaded_at": "2019-10-29 02:21:55.066997+00:00", "title": "WADA compliance arm to rule on Russia doping data next month", "language": "en", "text": "Montreal (AFP) – The World Anti-Doping Agency (WADA) said on Monday its compliance arm will review allegations that Russia manipulated key data at the centre of its state-sponsored doping scandal by the end of November.\n\nIn a statement, WADA said it had received responses from Russian authorities to a series of “detailed and technical questions” by the agency’s Intelligence and Investigations Department.\n\nRussia handed over thousands of files and samples from its Moscow anti-doping laboratory in January, a key condition for its reinstatement by WADA in 2018.\n\nHowever, last month it emerged that some of the files had been manipulated, raising the prospect of a fresh suspension of Russian athletes.\n\nLast week, Russia’s anti-doping chief, Yuri Ganus, said he expected the country to be banned from next year’s Tokyo Olympics and the next Winter Olympics, blaming unnamed Russian officials for doctoring the data handed over to WADA.\n\nWADA said on Monday that Russia’s responses to its queries would be reported to the agency’s Compliance Review Committee (CRC), which would in turn decide whether to recommend action against Russia.\n\nWADA said while no “fixed timeline” could be given for the process, the CRC would likely consider the investigation team’s findings “before the end of November.”\n\nWADA’s executive committee would then meet “as soon as possible” thereafter to discuss what action to take.", "description": "Montreal (AFP) – The World Anti-Doping Agency (WADA) said on Monday its compliance arm will review allegations that Russia manipulated key data at", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-28"}