{"pub": "marketwatch", "url": "https://marketwatch.com/story/volker-urged-ukraines-zelensky-to-convince-trump-he-would-investigate-corruption-2019-10-22", "downloaded_at": "2019-10-22 20:45:10.444092+00:00", "title": "Volker urged Ukraine’s Zelensky to convince Trump he would investigate corruption", "language": "en", "text": "Associated Press Kurt Volker, a former special envoy to Ukraine, departs an Oct. 3 closed-door interview with House investigators as part of the impeachment investigation of President Donald Trump.\n\nWeeks before President Trump and Volodymyr Zelensky’s July phone call, U.S. diplomat Kurt Volker told the Ukrainian president he needed to convince Trump he was willing to investigate corruption and alleged Ukrainian 2016 election interference, according to a person familiar with the former envoy’s recent testimony to Congress.\n\nVolker, then the U.S. special representative for Ukraine negotiations, pulled Zelensky aside at a conference in Toronto on July 2 to urge him to make clear his commitment to investigating corruption and alleged 2016 election interference, said the person familiar with the testimony to House committees conducting the impeachment inquiry. Doing so, the diplomat told Zelensky, would help overcome the stream of adverse information about Ukraine that Trump was hearing from his personal attorney, Rudy Giuliani, the person said.\n\nWhile alerting Zelensky about Giuliani’s influence, Volker advised the Ukrainian president to appear willing to adopt some of the Trump attorney’s agenda.\n\nAn expanded version of this story is available at WSJ.com.\n\nPopular on WSJ.com:\n\nWhite House personnel director tells Trump top DHS picks are ineligible\n\nNeumann to exit WeWork with up to $1.7 billion as SoftBank takes control", "description": "Weeks before President Trump and Volodymyr Zelensky’s July phone call, U.S. diplomat Kurt Volker told the Ukrainian president he needed to convince Trump he...", "authors": ["Dustin Volz", "Rebecca Ballhaus", "Byron Tau"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS642_volker_ZG_20191004000747.jpg", "published_at": "2019-10-22"}