{"pub": "businessinsider", "url": "https://pedestrian.tv/bites/neil-perry-rockpool-dining-group-wage-theft-accusation", "downloaded_at": "2019-10-24 05:19:52.292972+00:00", "title": "Celeb Chef Neil Perry’s Restaurant Group Accused Of Massive $10M Wage Theft", "language": "en", "text": "Celebrity chef Rick Perry‘s prestigious Rockpool Dining Group (RDG) restaurant chain has been accused of screwing its staff members out of at least $10 million, according to a huge new complaint put to the Fair Work Ombudsman.\n\nAccording to restaurant workers union Hospo Voice, managers at RDG venues across Australia tampered with timesheet software to disguise the number of hours worked by staff, demanded staff work up to 100-hour weeks without adequate compensation, and exploited migrant workers who feared their visa sponsorships would be rescinded if they spoke up.\n\nThe union says law firm Maurice Blackburn has now urged the Ombudsman to punish “one of the most egregious cases of wage theft Australia has seen yet.”\n\nIf the Ombudsman rules in favour of the complaint, the compensation figure could top the $7.8 million fellow celebrity chef George Calombaris coughed up for underpayment across his Made Establishment group.\n\nIn a statement, Maurice Blackburn principal lawyer Josh Bornstein said the allegations shot down the idea that restaurant chains were underpaying staff members due to confusing industrial relation laws.\n\n“The falsification of timesheets disproves the employer narrative of complex awards and honest mistakes and shows the underpayments for what they really are, a deliberate effort to cheat workers out of their minimum legal entitlements,” Bornstein said.\n\nTim Kennedy, national secretary of United Workers Union, said “wage theft is a business model” and a “deliberate choice.”\n\nWhen questioned by The Sydney Morning Herald, a RDG spokesperson said the group would not comment on the new allegations over concerns they pertain to a separate legal action filed against the group.\n\nREAD MORE A Former Chef Is Suing Neil Perry's Rockpool For Years Of Underpayment\n\nThe Fair Work Ombudsman also told the outlet they’re staying mum during its investigation.\n\nWhile Perry doesn’t have a hand in the everyday operations at RDG, he remains the group’s most notable figure and is internationally recognised as a face of Australia’s dining scene.\n\nHe copped flak as RDG’s figurehead last year when the group was forced to fork out $1.6 million in back pay to staff in separate circumstances. Worth noting: that backpay only covered the period between 2017 and 2018.\n\nAll of this seems likely to put the restaurant industry under a fair bit of stress, but probably not as much stress as underpaid workers face across Australia.", "description": "Law firm Maurice Blackburn has filed a new complaint with the Fair Work Ombudsman.", "authors": ["David Adams"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/10/perry-new.jpg", "published_at": "2019-10-24"}