{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/trump-uttered-what-many-supporters-consider-blasphemy-heres-why-most-will-probably-forgive-him/2019/09/13/685c0bce-d64f-11e9-9343-40db57cf6abd_story.html?tid=pm_pop", "downloaded_at": "2019-09-15 00:03:11.826532+00:00", "title": "Trump uttered what many supporters consider blasphemy. Here’s why most will probably forgive him.", "language": "en", "text": "President Trump took the Lord’s name in vain Thursday in remarks to Republican members of Congress. (Nicholas Kamm/AFP/Getty Images)\n\nPresident Trump has had trouble with a number of the Ten Commandments.\n\nThere’s the adultery. There’s the prohibition against giving false witness, for a man who has made more than 12,000 false or misleading claims during his presidency.\n\nAnd then there’s this commandment: Thou shalt not take the Lord’s name in vain.\n\nThat’s the one the president violated again on Thursday night, when he joked about “goddamn windmills” while talking with House Republicans in Baltimore about energy policy.\n\nFor some of the president’s evangelical supporters, Trump’s occasional use of the word “goddamn” is a bridge too far, even for a president whose behavior they’ve grown accustomed to excusing as they fervently support his policies.\n\n“I certainly do not condone taking the Lord’s name in vain. There is a whole commandment dedicated to prohibiting that,” said the Rev. Robert Jeffress, a Texas megachurch leader who is one of Trump’s most outspoken evangelical advisers and supporters. “I think it’s very offensive to use the Lord’s name in vain. I can take just about everything else, except that,” when it comes to off-color language.\n\n[Why evangelicals will stand by Trump in 2020]\n\nTrump has been urged in the past to cease using this particular word. A state senator from West Virginia, Paul Hardesty, told Politico in August that he got calls from three constituents after one Trump rally alone. He wrote a letter to the White House: “Never utter those words again.”\n\nAt that rally, the president had told a North Carolina crowd about the Islamic State, “They’ll be hit so goddamn hard,” and had recalled warning a businessman, “If you don’t support me, you’re going to be so goddamn poor.”\n\nThis was the same Greenville rally at which Trump’s supporters chanted “send her back” about Rep. Ilhan Omar (D-Minn.), a chant Democrats decried as racist. But it was the blasphemy that spurred some West Virginians to call their Trump-supporting state senator to ask him to do something about the president’s language.\n\nThat’s not surprising to Timothy Jay, a retired psychology professor who made it his business for 40 years to be the world’s leading expert on swear words.\n\n“I’ve done surveys where I ask people: What’s the most offensive word?” Jay said. “Some [religious] women would say the word ‘f---,’ but they wouldn’t say ‘Jesus Christ.’ Some of my interviewees have said, ‘We could say ‘f---’ and ‘s---’ at home, but we weren’t allowed to use profane language.”\n\nProfanity, Jay notes, is not the same as obscenity. An obscenity is a crude term for a bodily function. Profanity demeans something from the sacred realm — for example, misusing the words ‘hell’ or ‘damn,’ which in some Christian interpretations ought to be reserved for talking only about God’s role in judging the dead.\n\nBlasphemy is a specific type of profanity — an insult to God.\n\n[Donald Trump uses the rhetorical strategies of Cicero, the greatest orator in history]\n\nAmerican culture tends to consider obscenities to be more taboo. An f-bomb sounds much more crude to most listeners than “hell” or “goddamn” or an exclamation of “Jesus Christ.”\n\n“Theologically, that’s backwards,” said Karen Swallow Prior, an English professor at Liberty University, the conservative evangelical school in Virginia. “You can look at any culture and see what it values by its swear words. Whatever it is that it values most, those are the things that will have words related to them that are verboten.”\n\nIn other words, she said, Christians ought to hold the sacred in much higher esteem than the body or sex acts — and thus to care much more about words that demean the sacred. When she teaches her students at Liberty about the plays “Who’s Afraid of Virginia Woolf?” and “Death of a Salesman,” shows replete with sexual expressions and coarse arguments, she lectures: “As Christians, the most offensive thing probably should be Willy Loman’s taking of the Lord’s name in vain throughout the play.”\n\nShe noted that Christian squeamishness about vulgar bodily terms arises out of the Victorian era, not the early church, and can change with the times. “Martin Luther had quite a mouth,” she said.\n\nJeffress agreed that profanity is more problematic than other crass language. Asked to compare Trump’s use of “goddamn” to his infamous reference to certain nations as “shithole countries” — a statement which several evangelical pastors did condemn — Jeffress said the worse offense was the profanity.\n\n“I would never condone taking the Lord’s name in vain,” he said. “When it comes to other types of foul language, that’s a concern, but it’s certainly not the major concern when we’re in a virtual battle for the soul of the nation.”\n\nLanguage aside, Trump remains highly popular among evangelical voters. Almost 70 percent of white evangelicals told Pew Research Center this year that they approve of his performance in office. Most evangelicals support him for appointing conservative Supreme Court justices, restricting abortion access and LGBT rights, favoring Israel and other policy priorities.\n\n[‘He gets it’: Evangelicals are thrilled by Trump’s first term]\n\nJeffress said he hears from pastors and congregants in conservative parts of the country who are concerned about Trump’s language, including the insults he uses on Twitter. But the president is not losing their votes, the evangelical leader said.\n\n“He enjoys a tremendous amount of support from people of faith not because of his language, but in spite of his language,” Jeffress said. “Most Americans did not oppose the salty language of General Patton. All they cared about was that he led us to victory. Many Christians believe we are in a war … for the culture, a war for the soul of America.”\n\nIn his speech in Baltimore on Thursday, Trump came out swinging against many of his favorite targets, including his 2016 rival Hillary Clinton and several of his prospective 2020 rivals, for whom he engaged in another of his favorite rhetorical moves: name-calling. He referred to “Sleepy Joe,” “Crazy Bernie” and “Pocahontas.”\n\nHe arrived at the profanity when he turned to criticizing wind power, with an incorrect description of the technology.\n\n“The energy is intermittent. If you happen to be watching the Democrat debate and the wind isn’t blowing, you’re not going to see the debate. ‘Charlie, what the hell happened to this debate?’ He says, ‘Darling, the wind isn’t blowing. The goddamn windmill stopped,’” Trump said to the Republican congressmen, who laughed.\n\nWind power does not stop powering appliances when the wind stops blowing.\n\nTrump is not alone in the 2020 field in employing strong language once considered unfit for polite discussion. Sen. Bernie Sanders (I-Vt.), Sen. Amy Klobuchar (D-Minn.) and New York Mayor Bill de Blasio (D) have all said “damn” in Democratic debates. Rep. Tim Ryan (D-Ohio), Andrew Yang and Julián Castro have all used obscenities in debates, interviews or tweets.\n\nFormer congressman Beto O’Rourke has become so well-known for cursing on the campaign trail that his campaign sells official $30 T-shirts that use the words “hell” and “f*cked up.”\n\nBut Jay, the expert who has published decades of research studies on swearing, says that Democrats remain deeply cautious about one taboo when it comes to language: terms that are offensive on the basis of gender or race.\n\nThat’s another taboo that Trump has long ago crossed.", "description": "Many evangelicals are deeply offended by Trump’s continued use of a certain word, but they back him on judges, abortion and a host of other issues.", "authors": ["Julie Zauzmer", "Reporter Covering Religion", "Faith", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/EddyiI8nPz6mADzWn0KKNV57VOE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/A52PSCGWQQI6TFQQ7NLMKURODQ.jpg", "published_at": "2019-09-13"}