{"pub": "huffpost", "url": "https://huffpost.com/entry/donald-trump-brett-kavanaugh-new-accusations_n_5d7f998ae4b077dcbd61b4c5", "downloaded_at": "2019-09-16 23:13:09.380510+00:00", "title": "Trump Says Brett Kavanaugh Is The One 'Being Assaulted' Amid New Accusations", "language": "en", "text": "President Donald Trump argued that Brett Kavanaugh is really the one “being assaulted” in the wake of new sexual misconduct allegations against the recently appointed Supreme Court justice.\n\n“The one who is actually being assaulted is Justice Kavanaugh,” Trump tweeted Monday morning. “Assaulted by lies and Fake News!”\n\nTwo New York Times reporters published an op-ed on Saturday detailing new sexual assault allegations against Kavanaugh. A former classmate of Kavanaugh’s told reporters Robin Pogrebin and Kate Kelly that he once saw Kavanaugh with his pants down while his friends pushed his penis into the hands of a female student during a dorm party at Yale University.\n\n“The New York Times walks back report on Kavanaugh assault claim.” @foxandfriends The one who is actually being assaulted is Justice Kavanaugh - Assaulted by lies and Fake News! This is all about the LameStream Media working with their partner, the Dems. — Donald J. Trump (@realDonaldTrump) September 16, 2019\n\nTrump offered more support for Kavanaugh in an additional tweet, quoting “Fox & Friends.”\n\n“Just Out: ‘Kavanaugh accuser doesn’t recall incident,‘” Trump tweeted, attributing the quote to Fox News’ morning show. “DO YOU BELIEVE WHAT THESE HORRIBLE PEOPLE WILL DO OR SAY. They are looking to destroy, and influence his opinions ― but played the game badly. They should be sued!”\n\nTrump earlier came to Kavanaugh’s defense on Sunday, tweeting that the justice should “start suing people for [libel], or the Justice Department should come to his rescue.”\n\nPrior to this most recent allegation, three women accused Kavanaugh of sexual assault or misconduct. One of the three, Dr. Christine Blasey Ford, delivered an emotional testimony in front of the entire country about her accusation that Kavanaugh attempted to rape her when the two were in high school. Despite her powerful testimony, Kavanaugh was confirmed to the Supreme Court last October.\n\nKavanaugh has denied all allegations of sexual assault.\n\nTrump, who has himself been accused of sexual misconduct by over 20 women, has been an outspoken supporter of his controversial Supreme Court pick. The president has praised Kavanaugh as “an incredible individual, great intellect, great judge” with an “impeccable history in every way.”", "description": "The president again came to Kavanaugh's defense on Monday in the wake of new sexual assault accusations against the controversial Supreme Court justice.", "authors": ["Women'S Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d7f9bdf3b00002b88d4b462.jpeg?cache=wb8cnaywa5&ops=1778_1000", "published_at": "2019-09-16"}