{"pub": "politico", "url": "https://politico.eu/article/falter-vienna-austria-election-sebastian-kurz-finances", "downloaded_at": "2019-09-27 03:53:11.107390+00:00", "title": "The alt-weekly roiling Vienna", "language": "en", "text": "VIENNA — Florian Klenk is no stranger to abuse.\n\nAs the editor of Falter, a Vienna-based alternative weekly, Klenk and his colleagues are regularly dismissed as Bolsheviks, the “revolutionary guard of political correctness,” and worse.\n\nThat the newspaper and its staff would stand accused by other journalists of aiding and abetting the opposition in the final stretch of Austria’s election campaign came as a surprise to Klenk, however.\n\n“If I’m the opposition then they’re the governing parties,” the defiant editor told POLITICO in an interview this week, referring to his critics in the Austrian press.\n\nKlenk’s crime: a Falter investigation that uncovered former Chancellor Sebastian Kurz’s secret campaign budget.\n\nUnder Florian Klenk, Falter has turned more toward hard-nosed investigative journalism.\n\nThe Falter investigation — relying on leaked accounting data — revealed that Kurz’s Austrian People’s Party has relied on extremely creative bookkeeping for everything from office supplies to catering to avoid running afoul of campaign spending limits. More damaging: It cast a shadow over Kurz’s carefully choreographed wholesome image, revealing his lavish spending habits, including a €600 bill for grooming and a more than €7,000 private-jet trip to Rome.\n\nThe affair has thrust Klenk, 46, and his newspaper, housed above a pool hall in downtown Vienna, into the center of the campaign for Sunday's election. It has also cast light on the murky connections between Kurz’s party and some of Austria's leading media outlets. Most important, Falter's travails illustrate how even in developed Western European democracies, political parties are successfully using social media and other digital tools to quash or discredit unfavorable stories.\n\nDefending 'the system'\n\nKurz’s People's Party responded to Falter's reporting by claiming the party had been hacked and asserting — without offering details — that the accounting data the paper published had been manipulated.\n\nDismissing the affair as “ballpointgate,” Kurz, 33, said the real story is the trespasses against his party.\n\n“There was a targeted attack on the People’s Party servers in order to steal data, manipulate it and then make it public,” he said earlier this month. “That’s not just an attack on the People’s Party but an attack on the democratic system.”\n\nFor good measure, the People’s Party sued Falter, seeking a court order to prevent the paper from claiming it had broken the law.\n\nThe People's Party also sowed doubt about the story online, relying on Kurz’s Facebook account, which has more than 800,000 followers, and the party’s small army of social media experts.\n\nThe strategy worked. Within days, instead of chasing down the details of the People’s Party accounting — which Klenk offered to share with other news outlets — the media’s focus shifted to the question of who was behind the hack and why.\n\nThe editor of Kurier, one of Austria’s largest newspapers, suggested Klenk was working hand-in-glove with the Social Democrats.\n\nKurz’s party leads by a wide margin, and there’s little question that he will win Sunday's election.\n\nKronen Zeitung, Austria’s best-selling tabloid, went even further. In a 164-word diatribe, columnist Michael Jeannée, an ardent backer of Kurz, lambasted Klenk, calling him “unscrupulous” and “peddler of untruths.”\n\nJeannée, who is known as the right-wing tabloid’s hitman (“If you’re old enough to steal, you’re old enough to die,” he wrote several years ago after Austrian police shot a 14-year-old in the back), then took aim below the belt. The only difference between Klenk and a controversial former Austrian Green party leader, he wrote, is that Klenk hasn’t been accused of sexual misconduct. Klenk responded by suing for defamation.\n\nHello, handsome\n\nGoing by the polls, the affair will not play a big role in voters’ minds when they go to the polls on Sunday.\n\nKurz’s party leads by a wide margin, and there’s little question that he will win. The People’s Party is expected to come first with 34 percent of the vote, according to POLITICO’S Poll of Polls, followed by the Social Democrats with 22 percent and the far-right Austrian Freedom Party with 20 percent.\n\nThough Kurz’s relationship with both of those parties is difficult, there’s a chance he could pursue a coalition with either.\n\nA third option is a so-called Dirndl coalition (named after the colors of the traditional dress). That would be a three-way tie-up with the Greens, who are expected to garner 12 percent of the vote, and the liberal Neos, who are projected to win 8 percent.\n\nAUSTRIA NATIONAL PARLIAMENT ELECTION POLL OF POLLS\n\nFor more polling data from across Europe visit POLITICO Poll of Polls.\n\nKurz’s last government, an alliance with the Freedom Party, collapsed in May after a video emerged of its then-leader appearing to solicit an illegal campaign donation from a woman in Ibiza he believed to be a wealthy Russian.\n\nFalter was in the middle of that scandal as well, working alongside Germany’s Süddeutsche Zeitung, which released the video together with German weekly Der Spiegel.\n\nFounded in 1977, Falter (German for Butterfly) was long known for its anti-establishment, often subversive take on Austrian society.\n\nFor most if its existence, it was primarily focused on cultural and political commentary. Under Klenk, it has turned more toward hard-nosed investigative journalism.\n\nIn a media landscape that has for decades been dominated by outlets dependent on the largesse of political parties and the state, Falter's unrepentant independence has made it stand out.\n\nIt has come at a price.\n\n“We’re not doing anything out of the ordinary. What we’re doing is holding up a mirror to what’s out of the ordinary\" — Florian Klenk, editor of Falter\n\nThough Falter has never been a favorite of Kurz’s People’s Party, its coverage of the conservative bloc in recent years has made it a target.\n\nAfter Kurz was elected in 2017, it put Kurz on its cover with the headline “Neofeschist” (fesch means handsome in German).\n\nThe paper also uncovered a series of scandals in the party and in the Freedom Party. Last year, for example, a leading Freedom Party candidate was forced to step down after the paper revealed that his right-wing fraternity had published a song book with antisemitic lyrics. The paper also uncovered a memo from the leadership of the interior ministry, then controlled by the Freedom Party, ordering Austrian police to avoid giving information to Falter and other critical media.\n\n'Holding up a mirror'\n\nKurz’s government responded to the scrutiny by cutting all government-funded advertising on Falter’s pages, costing the paper about €500,000 a year.\n\nIt also tried to subvert the paper’s coverage by handing its scoops to other media.\n\nWhen Falter discovered in July that a Kurz associate had secretly shredded a number of hard drives from the chancellery after the coalition fell, party officials handed the story to the Kurier, Klenk said.\n\nDespite those pressures, or maybe because of them, Falter’s following is on the rise.\n\nOver the past decade, its readership has tripled. Though it only sells about 45,000 copies every week and reaches about 3 percent of the population directly, its influence in Austria, a country of nearly 9 million, is considerable because other media, including the dominant public broadcaster, ORF, are forced to chase its scoops.\n\nWhat’s more, Klenk, an early adopter of Twitter, has built a considerable following across the German-speaking world. He is also a regular presence on Austrian television. That exposure has made the perpetually unshaven Vienna native something of a media celebrity in the country.\n\nIt’s an unlikely success for the editor of a paper with only about 30 editorial employees, half of whom are freelance.\n\nKlenk said the recent reaction to Falter’s coverage has made him worry about the evolution of Austria’s political culture. He insists the only ideology he and his colleagues are pursuing involves offering good journalism.\n\n“We’re not doing anything out of the ordinary,” he said. “What we’re doing is holding up a mirror to what’s out of the ordinary.”", "description": "A series of scoops has thrust Austria’s Falter newspaper into the center of the country’s election campaign.", "authors": ["Matthew Karnitschnig", "Jakob Hanke", "Hans Von Der Burchard", "Judith Mischke"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/09/belgaimage-150188595-full-1200x628.jpg", "published_at": "2019-09-25"}