{"pub": "scmp", "url": "https://yp.scmp.com/news/features/article/112591/predators-how-their-friendship-helps-them-training-feeling-their-bodies", "downloaded_at": "2019-10-05 22:18:37.939475+00:00", "title": "The Predators on how their friendship helps them in training, feeling their bodies grow stronger, and gearing up for the Mud Race", "language": "en", "text": "Seven weeks down, three more to go.\n\nThe Predators – six Young Post readers who were selected to take part in the Up Your Game Challenge and are undergoing two months of personal training at F45 Sheung Wan, along with tailored consultation from nutritionist Wynnie Chan – are just 18 days away from competing in the Mud Race 2019.\n\nWith less than three weeks till the big day, we caught up with the students, some of whom are in the thick of the HKDSEs, to see how they’re feeling.\n\nI still can’t believe I’ve been given the opportunity to take part. I’m still finding the workouts tough, but I am really beginning to enjoy the intensity and rigorousness of them. What I particularly enjoy about training sessions at F45 is that the workouts are never the same; so we always have something new to challenge us and push us further.\n\nThe fact that my teammates and I are doing this together makes the entire process more memorable, too. As they say, “Friends that sweat together, stay together”.\n\nThe sense of camaraderie within our team is strengthening with every session. The small things we do, whether it’s giving each other a high-five after completing training or walking to the MTR together, have really brought us closer as a team.\n\nAnother aspect of this challenge that I’m really enjoying is the diet. I have noticed a gradual shift in my eating choices; I’m starting to substitute junk food for healthier options, such as nuts or fruit. The best part about the diet is that no one is forcing me to eat in a certain way, I’m making my own decision to eat more healthily. This whole process has been great, and I’m extremely excited for the Mud Race.\n\nSaanchi Shah, 15, King George V School\n\nAfter training for seven weeks, I feel like my whole body has become stronger. I also feel a lot more confident and motivated.\n\nThe intensity of our workouts increases every week, and that’s hard, but I keep on trying so our team can do well in the Mud Race. I’m so glad we also have the help of a nutritionist so we can reach our full fitness potential.\n\nMoreover, I’ve made good friends doing this challenge; they’re all so nice and work so hard every Saturday at training. No matter how tired we are, we all encourage each other – that’s what being part of a team is all about. I think we’ll continue to hang out even after the race is done, because friendships are precious.\n\nI want Young Post readers to know that team spirit and communication are so important when you’re part of a group. They’re the key to success.\n\nLaw Ka-yi, 19, HKU Space Po Leung Kuk Stanley Ho Community College\n\nIt’s been seven weeks of training! I’m so overwhelmed, nervous and excited. I am nervous about the race because I’m still not sure if I’m ready – although I do feel my muscles have become stronger with training.\n\nMy goal now is to gain more arm muscle so I can tackle the obstacles in the Mud Race; I’m still not very good at the monkey bars, for example.\n\nOur team has been training so hard and I am looking forward to seeing us cross the finish line! When we’re together it’s like a chemical reaction: we have so much fun and we joke with each other a lot. I will miss my teammates a lot after the race.\n\nIn addition to training, we are following the eating plans designed for us by Wynnie. While I find it quite easy to follow when I prep my own meals, eating out is much harder, as I have to spend more time looking for healthier options every time. Still, it’s a skill that I can use for the rest of my life.\n\nJust a few weeks to go! See you all in the battlefield, we’ll have so “mud” fun together!\n\nEsther Choy Lok-yiu, 16, PAOC Ka Chi Secondary School\n\nVideo of Up your game: Mud, sweat and tears\n\n\n\nI have learned so much during the training sessions, and become a lot more motivated. I set new goals for myself before each session so that by the end, I feel a sense of accomplishment.\n\nMoreover, my teammates are very supportive and we keep each others’ spirits up. Whenever I feel like I want to give up, I look to them for support and motivation.They have become a source of fuel for me and I have realised that you can achieve a lot when you have the support of others.\n\nRegardless of where we are from or what goals we have, we all feel like giving up at some point in our lives. We should all remember that hard work pays off. Surround yourselves with positive energy, and be a source of positivity for others, too. What goes around comes around.Lastly, remember that at the end of the day, persistence prevails.\n\nMohammad Ans, 18, CSBS Mrs Aw Boon Haw Secondary School\n\nSeven weeks in, I feel like I’ve gradually become more confident with the training. Even though physically I still struggle to keep up, mentally I now have the tenacity and grit to stick it out and do my best regardless of how I’m feeling. My team has been amazing; we’ve become more comfortable around each other, and cheer each other on before, during, and after each session.\n\nThe eating plan is still quite hard to work into the busy life of a final-year student about to graduate, but I have noticed it’s has helped me to feel more energised and less bloated, which is a welcome change!\n\nWhat I’ve found surprising is that the more gruelling a training session is, the more I appreciate it after it’s done. I now get satisfaction from finishing a workout and feeling the soreness in my muscles the next day. Knowing that I put my all into completing the exercise, even if my all may be comparatively less impressive than others’, is incredibly rewarding.\n\nAngelina Wang, 17, Chinese International School\n\nThis experience keeps getting better. The team and the training are amazing, and my physical ability has improved a lot.\n\nAt our sessions, I’ve tried cardio and strength training, both of which have helped to build my body strength. I also feel mentally and physically fittercompared to the first lesson. Now I can complete the training session properly, which gives me a sense of accomplishment that boosts my confidence.\n\nThe team’s chemistry has improved a lot since we first met, too. We now share a close bond. I can tell that everyone is giving their all. Ans motivates me a lot. He wants to become a pro athlete, and I can see how determined he is to achieve that goal. Seeing how driven he is makes me want to do better. Whenever I want to give up, Ansis the one who keeps me going.\n\nI have high hopes for the team and I believe that we’ll do amazingly in the Mud Race.\n\nDavid Cheng, 18, St Joseph’s Anglo-Chinese School\n\nYou might also like\n\nMeet the Predators: Six HK students and the friendships, challenges, and strength they're finding on their health and fitness journey\n\nHow stretching everyday can benefit your physical and mental health, and improve your problem solving skills\n\nHow to balance exercise and nutrition to improve your fitness, health, and lifestyle", "description": "With their training well under way, and with three weeks till the Race, the students look back on the journey so far", "authors": [], "top_image": "https://yp.scmp.com/sites/default/files/styles/900x506/public/images/7p0cdsqk.jpg", "published_at": "2019-10-05"}