{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7528595/Teenager-17-rushed-hospital-overdosing-NUTMEG.html", "downloaded_at": "2019-10-11 20:31:32.905133+00:00", "title": "Teenager, 17, is rushed to hospital after overdosing on NUTMEG", "language": "en", "text": "A teenager was scrambled to hospital in a trance-like state after overdosing on the popular spice nutmeg.\n\nParamedics found the 17-year-old pacing and muttering under his breath, unable to answer the most 'simple' of questions, vomiting and making involuntary muscle movements.\n\nInitially baffled by the mysterious symptoms, doctors later discovered the boy had snorted a tablespoon of nutmeg - which does not show up in drug screenings.\n\nThe unnamed boy, who is thought to be from New York, survived his overdose, to which there is currently no antidote.\n\nBut now medics are using his unusual case to highlight the harmful effects of the common festive spice often added to lattes.\n\nBecause unbeknownst to most people who sprinkle the ingredient on their food and drink, nutmeg contains an oil which breaks down into MMDA - a psychedelic drug similar to the recreational MDMA.\n\nUnbeknownst to most cooks who sprinkle the ingredient on their food and drink, nutmeg contains a substance which synthesises MMDA - a psychedelic drug similar to the recreational MDMA\n\nSince 1512 nutmeg has been traded across the world and is a popular festive spice added to dishes and drinks including custards, eggnog, punches and lattes. But it can be toxic in large amounts\n\nLead author Professor Bernard Beckerman of the City University of New York told the story of the unnamed teenager in the Complementary Therapies in Medicine journal.\n\nOn a Friday night, emergency service crews were scrambled to his parents' home after receiving reports of a 'disoriented male'.\n\nThey arrived to find him pacing the living room while talking to himself in a clear state of unrest.\n\nThe paramedics began asking him some routine questions - the boy gazed at them with big dilated pupils and was incapable of responding coherently.\n\nThe crew tried to apply an oxygen mask, but the restless unnamed boy took it off before suddenly walking away, seemingly involuntarily, and throwing up.\n\nNutmeg contains an oil compound which is a mixture of myristicin, elemicin, eugenol and safrole which trigger the overdose\n\nThe teenager was then stretchered into an ambulance and whisked to hospital for treatment.\n\nHis parents – who said they last saw him earlier on in the afternoon in a 'normal state of health' – revealed he wasn't taking any medications.\n\nThey also told doctors that they weren't aware of him ever using any illicit drugs, according to the case report.\n\nBut, suspecting an overdose, the medics asked to rummage through the boy's room and found a cannabis-filled cigarette stashed away in a desk drawer along with a half-empty bottle of ground nutmeg.\n\nBoth items were taken with them to the hospital and turned over to the emergency department medical staff.\n\nHow much nutmeg is poisonous and what can it do to your body? Only two people are believed to have died from nutmeg overdoses since the spice was first discovered in the 16th Century. Scientists have said that a toxic dose is two to three teaspoons (10-15g). Meanwhile one tablespoon (15g) is the dosage for an anticholinergictoxic episode, which could prove fatal. But as well as its negative effects, nutmeg has been found to have some benefits. Pros Aphrodisiac: An experiment in male rats exhibited heightened sexual activity when fed nutmeg. It is believed that this was caused by the spice's eugenol content which has been shown to have vasodilatory properties. Antimicrobia: Nutmeg has been shown to fight harmful bacteria and fungi, particularly in oral cavities. Antioxidant: Oils in nutmeg have been shown to have such antioxidant effects by reducing nitric oxide production. Cancer: Testing conducted by the National Cancer Institute found evidence of antileukemic activity in the nutmeg plant. Cons CNS: Testing in rats showed nutmeg inhibited central nervous system activity. This can cause anxiety, confusion, dizziness, drowsiness, euphoria, giddiness, headache, hyperactivity and hallucinations. Cardiovascular: Ttachycardia, hypotension and flushing. Gastrointestinal: burning epigastric pain, thirst and nausea. Peripheral: hypothermia, numbness, sweating, double-vision. Psychiatric: depression, suicidal thoughts.\n\nIn hospital, the teenager admitted to snorting 'at least' one tablespoon of nutmeg – an amount considered to be a 'toxic dose'.\n\nDrug testing then confirmed he had not taken any other substances, including cocaine, cannabis, speed or powerful sleeping drugs.\n\nDoctors at the hospital, which hasn't been identified, contacted the local poison control centre for advice on treating nutmeg overdose cases.\n\nThe teenager was given intravenous fluids and oxygen to support him, but there is currently no antidote for a nutmeg overdose.\n\nHis symptoms cleared after 24 hours. Both he and his family were counselled on the dangers of toxic substances, including nutmeg.\n\nAlthough there have only been two nutmeg-related deaths, Professor Beckerman has warned that the household spice is extremely potent even in small doses.\n\nJust a few spoonfuls can be fatal. This is because nutmeg contains an oil compound which is a mixture of myristicin, elemicin, eugenol and safrole which trigger the overdose.\n\nMyristicin is particularly potent as it breaks down into MMDA, a psychedelic substance similar to the recreational MDMA drug.\n\nWhile it is believed to have benefits as an aphrodisiac and an antioxidant, nutmeg has also been linked to psychiatric illness such as depression and physical problems such as nausea, double-vision and hypothermia.\n\nHallucinations can also be caused from overdoses, as can other neurological effects such as anxiety and slurred speech.\n\nThe effects of consuming an overdose of nutmeg are visible within between half an hour to eight hours of ingestion.\n\nProfessor Beckerman wrote: 'Clinicians believe that since the side effects of nutmeg can be so discomforting, patients rarely abuse the spice a second time.\n\n'Therefore, the potential for recurrent use is expected to be minimal.'\n\nHowever, because it does nutmeg does not show up in drugs screenings it is particularly hard to identify and may result in misdiagnosis.\n\nAnd even if nutmeg poisoning is pinpointed, there are no current cures and only relaxing treatments of benzodiazepines are available.", "description": "Paramedics in New York found the 17-year-old pacing and muttering under his breath, unable to answer the most 'simple' of questions, vomiting and making involuntary muscle movements.", "authors": ["Jack Elsom For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/13/19585736-0-image-a-27_1570797131376.jpg", "published_at": "2019-10-11"}