{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/celebrities/2019/10/07/hailey-baldwin-shares-pictures-wedding-dress-justin-bieber/3903213002", "downloaded_at": "2019-10-07 23:33:20.018962+00:00", "title": "Hailey Bieber shares stunning wedding dress photos from 'the most special day of my life'", "language": "en", "text": "CLOSE Justin Bieber and Hailey Baldwin celebrated their nuptials with a wedding. Stars like Kendall Jenner and Justine Skye were in attendance. USA TODAY\n\nHailey Bieber is reminiscing about the \"most special day of my life.\"\n\nOne week after tying the knot (again) to Justin Bieber during a South Carolina ceremony, the model took to Instagram to share special details from their big day, including her custom Off-White wedding dress designed by Virgil Abloh.\n\n\"Thank you for making my vision come to life and creating my dream dress,\" Bieber wrote to Abloh, the founder of Off-White and artistic director for Louis Vuitton's men's wear collection. \"I’m forever grateful I got to wear your beautiful creation.\"\n\nAbloh described the moment he said \"I do\" to Bieber on his Instagram account: \"When @haileybieber asks if you want to design a wedding dress... that’s a 'yes' too. love you guys since time, for time.\"\n\nSouth Carolina wedding: Justin Bieber shares first photos of 'my bride' Hailey Baldwin\n\nBieber's off-the-shoulder, lace gown featured a sweetheart neckline with long sleeves, a mermaid skirt and long train. She paired her one-of-a-kind wedding dress with an embroidered veil that had \"TILL DEATH DO US PART\" stitched in Abloh's signature block lettering at the end.\n\nBieber also shared sweet snapshots of the newlyweds sharing a smooch. The angles offered fans another look at her wedding gown, showcasing the low back design.\n\nThe lovebirds flashed their new bling in another photo, including their wedding bands, Bieber's equally stunning engagement ring and Justin's wedding gift to himself: An Audemars Piguet watch.\n\n\"9.30.19,\" she captioned the slideshow of black-and-white pictures, writing \"last Monday was the most special day of my life.\"\n\nJustin, 25, shared color versions of the wedding photos with his 22-year-old \"bwide.\" He added, \"Even thugz get married.\"\n\nMore: Justin Bieber goes country with new Dan + Shay collaboration '10,000 Hours'\n\nThe Biebers, who first tied the knot in September 2018, celebrated their wedding with many famous faces, including Billy Baldwin,Kylie Jenner (and daughter Stormi), Kendall Jenner, Kris Jenner, Usher, country duo Dan + Shay, Kenny Hamilton and Bieber's longtime manager, Scooter Braun.\n\nMore: Justin Bieber hits back at PETA after controversy over his exotic cats Sushi and Tuna\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/celebrities/2019/10/07/hailey-baldwin-shares-pictures-wedding-dress-justin-bieber/3903213002/", "description": "One week after tying the knot to Justin Bieber during a South Carolina ceremony, Hailey Baldwin shared special details from their big day.", "authors": ["Cydney Henderson", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/01/USAT/efcb0109-5229-41fd-9396-84a8b039b8d7-VPCLIFE_BIEBER_WEDDING_DESK_THUMB2.00_00_39_13.Still004.jpg?crop=1911,1075,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-07"}