{"pub": "townhall", "url": "https://townhall.com/tipsheet/leahbarkoukis/2019/10/03/biden-goes-after-scared-trump-n2554114", "downloaded_at": "2019-10-03 23:26:16.151611+00:00", "published_at": "2019-10-03", "title": "Biden Pushes Back Against Trump: You're 'Not Going to Destroy Me'", "language": "en", "text": "Former Vice President Joe Biden hit back at President Trump on Wednesday during a stump speech in Nevada, vowing that the commander in chief is “not going to destroy me.”\n\n“Let me make something clear to Trump and his hatchet men and the special interests funding his attacks against me,” Biden said in Reno. “I’m not going anywhere. You’re not going to destroy me. And you’re not going to destroy my family. I don’t care how much money you spend or how dirty the attacks get.\"\n\nJoe Biden hits back at Trump in Reno speech: pic.twitter.com/xu74dXSmEM — Byron York (@ByronYork) October 3, 2019\n\nBiden went on to claim that Trump’s recent attacks against him were because he’s afraid of losing to him.\n\n“He did it because, like every bully in history—he’s afraid. He’s afraid of just how badly I would beat him next November,” Biden said, referring to the phone call between Presidents Trump and Zelensky in which Democrats allege he pressed the Ukrainian leader to investigate the Biden family.\n\nNew excerpts of @JoeBiden’s speech blasting Trump in Reno tonight\n\n\n\n\"Now because of the courageous actions of a whistleblower, Trump’s scheme has been exposed. He did it because, like every bully in history—he’s afraid. He’s afraid of just how badly I would beat him next November” — Arlette Saenz (@ArletteSaenz) October 2, 2019\n\nThe shots came after Trump referred to Biden and his son, Hunter, as “stone-cold crooked,\" earlier in the day.\n\nPresident Trump: \"Biden and his son are stone-cold crooked -- and you know it.\" pic.twitter.com/aBuvOeWqSn — The Hill (@thehill) October 3, 2019\n\n“His son walks out with millions of dollars. And the kid knows nothing,\" Trump said, referring to Hunter's business dealings in Ukraine and China.", "description": ".10/03/2019 19:24:19PM EST.", "authors": ["Leah Barkoukis", "Matt Vespa", "Timothy Meads"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/267/ea372bfa-9ed3-4293-a51a-fa1712a12657.png"}