{"pub": "investing.com", "url": "https://investing.com/analysis/deal-or-no-deal--pound-holds-bid-200473405", "downloaded_at": "2019-10-15 11:20:47.677253+00:00", "title": "Deal Or No Deal – Pound Holds Bid", "language": "en", "text": "Market Drivers October 15, 2019\n\nHope springs for Brexit deal\n\nEZ slightly better\n\n1.87% +0.44%\n\n1.69%\n\n$52/bbl\n\n$1493/oz\n\n( ) $8300\n\nEurope and Asia:\n\nGBP UK 3.8% vs. 3.7%\n\nEUR ZEW -22 vs. -27\n\nNorth America:\n\nNo data\n\nIt’s been another night of Brexit drama in FX markets with rumors, headlines and statements dominating trade in cable as the unit swing back and forth on the latest state of negotiations.\n\nAfter rallying hard at the start of London open the pair topped out ahead of the 1.2700 figure and then drifted towards 1.2600 as Michelle Barnier poured cold water on hopes of a deal just yet. Mr. Barnier said to have told EU27 members that the latest proposals were not enough for a deal.\n\ntumbled on the news but held bid ahead of the 1.2600 figure as the default assumption of the market remains that no deal will result in a delay extension rather than the last-minute crash out of UK from EU.\n\nAs we’ve noted many times before if Mr. Johnson is serious about delivering Brexit then he will have to sacrifice the DUP and their insistence on a hard Northern Ireland customs border and try to sell the deal in Parliament to moderate Torries and Brexit leaning Laborites. Whether he will ultimately succeed remains to be seen, but the market has essentially assumed that regardless of what happens the UK will remain in EU until a deal is done.\n\nStill, the pair remains vulnerable to disappointment if not deal in principle is agreed to at today’s EU 27 summit. Talks can go until October 31st, but an agreement today would be a coup for Mr. Johnson who would enjoy a massive PR boost as he tries to convince Parliament to approve the deal.\n\nWhile cable remains the center of focus and the primary volatility trade in FX, elsewhere the action is very quiet, with the rest of the major contained to narrow ranges as markets await more progress on US-China talks. With no major events on the eco calendar, the rangebound trading could continue for the rest of the day.", "description": "Forex Analysis by Boris Schlossberg covering: GBP/USD, XAU/USD, DAX, Nikkei 225. Read Boris Schlossberg's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-15"}