{"pub": "marketwatch", "url": "https://marketwatch.com/story/trump-announces-preliminary-trade-deal-with-china-2019-10-11", "downloaded_at": "2019-10-12 00:18:24.739385+00:00", "title": "Trump announces preliminary trade deal with China", "language": "en", "text": "President Donald Trump on Friday said the U.S. and China had reached a “very substantial phase one deal” on trade, as stocks closed sharply higher Friday, with analysts pinning the rally on optimism over the U.S.-China trade talks.\n\nTreasury Secretary Steven Mnuchin said the U.S. would not implement tariff hikes on Chinese goods that had been set for next week, but U.S. Trade Representative Robert Lighthizer said there had not been a decision on tariffs slated for December, and Chinese technology giant Huawei wasn’t part of the preliminary deal.\n\nThere was agreement on intellectual-property issues, currency matters and financial services, and the deal includes up to $40 billion or $50 billion in purchases of U.S. agricultural products, Trump said. He estimated it would take three to five weeks to put the deal into writing. U.S. and Chinese officials expect to meet in Chile in five or six weeks.\n\nEarlier Friday, a Bloomberg News report citing unnamed sources said the U.S. and China had reached a partial trade agreement that could help lead to a truce in their trade war and lay the groundwork for a broader deal.\n\nThis week’s U.S.-China trade talks have come amid expectations about a “mini-deal” that would potentially involve concessions ahead of a larger agreement, such as China offering to buy more American agricultural products or the U.S. pulling back on tariffs.\n\nThe Dow industrials DJIA, +1.21% SPX, +1.09% closed higher by more than 300 points on Friday, but off their best level for the session.\n\nTESTIMONY IN IMPEACHMENT INQUIRY\n\nIn impeachment-related news, the U.S. ambassador to the European Union, Gordon Sondland, said Friday that he will testify on Thursday before House committees leading the impeachment inquiry even though the Trump administration has directed him not to testify. The inquiry, announced last month by House Democrats, is centered on how Trump asked his Ukrainian counterpart to investigate Biden and his son.\n\nAlso Friday, the former U.S. ambassador to Ukraine, Marie Yovanovitch, testified that Trump pressured the State Department to remove her from her position. She was ousted after insisting that requests to Ukrainian officials from Rudy Giuliani, Trump’s personal lawyer, for investigations be relayed through official channels, according to an Associated Press report citing a former diplomat.\n\nTRUMP JOINS AMAZON’S TWITCH\n\nIn a fresh effort to reach supporters directly as he does with his Twitter TWTR, +2.07% account, the president has joined Amazon.com’s AMZN, +0.68% Twitch, a live-streaming service for videogame players. That’s even though he has frequently criticized the e-commerce giant and its CEO, Jeff Bezos, who also owns The Washington Post.\n\nTrump’s Twitch channel on Friday featured messages about watching an upcoming campaign rally and donating to his re-election effort. Other politicians are on Twitch, too — such as Democratic presidential hopeful Bernie Sanders, who also has been an Amazon critic.\n\nSign up for Trump Today and more MarketWatch newsletters.", "description": "President Donald Trump says the U.S. and China reached a “substantial phase one deal” on trade, as stocks closed sharply higher Friday, with analysts giving...", "authors": ["Victor Reklaitis", "Money", "Politics Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT183_trump__ZG_20191011163254.jpg", "published_at": "2019-10-11"}