{"pub": "townhall", "url": "https://townhall.com/columnists/veroniquederugy/2019/09/12/trumps-tariff-and-trade-aches-and-pains-n2552950", "downloaded_at": "2019-09-12 07:14:12.660420+00:00", "title": "Trump's Tariff and Trade Aches and Pains", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nOn the campaign trail, candidate Donald Trump said that, if elected, \"We're going to win so much. You're going to get tired of winning. You're going to say, 'Please Mr. President, I have a headache. Please, don't win so much.'\" Unfortunately, Trump's definition of winning seems to mean flexing his presidential muscles, beating his chest and changing his mind without hesitation -- all with an utter disregard for the actual impact of his policies on the economy and American workers.\n\nThe president's profound misunderstanding of what victory looks like is particularly visible in his multifront attack on trade and globalization. All in the name of putting America first, he withdrew from the Trans-Pacific Partnership, treated our trade partners like enemies, forced a renegotiation of NAFTA with no clear idea of whether the new deal (the United States-Mexico-Canada Agreement) could ever be ratified, implemented tariffs to fight imaginary national security menaces and started a trade war with China without any clearer strategy than his willingness to jack up tariffs at all costs.\n\nUnfortunately, the impact of Trump's behavior and policies leaves most of us Americans with more than a headache. After two great years in which American factories added 170,000 jobs annually, they are now entering a somber phase. The continued uncertainty driven by the Trump trade war is working to undo the productive impact of the 2017 tax reform. Capital expenditures are falling and, with them, the hope of further increases in worker productivity and wages. Higher production costs for the industries downstream of the numerous tariffs make it harder for factories to hire -- or, in some cases, keep -- their workers. So in 2019, manufacturing jobs increased by only 44,000 -- a 75% reduction in the rate of growth.\n\nBloomberg senior writer Shawn Donnan notes, \"Nationally, the U.S. has not yet seen a collapse in factory jobs,\" but Pennsylvania has lost 8,300 manufacturing jobs this year, and Wisconsin has lost 4,000 -- which could cost the president a lot of votes in November of next year. U.S. and foreign tariffs are also contributing to a slowdown in export markets, and, coupled with the many stock market nosedives over the past year and a half, it's no surprise that we just had a contraction in manufacturing output.\n\nYet Trump is undeterred and shows no signs that he'll consider adopting a new strategy. He even claims that all is good under the glare of his trade war, since Uncle Sam collects vast sums of tariff revenues and the economy is growing. Even when he admits that his trade policy is taking a toll on Americans, he argues that this cost is worth it because to him, \"this is much more important than the economy.\"\n\nTell that to the firms that are now trying to compete with Chinese rivals. For instance, Johan Eliasch, the chairman and CEO of Head Penn Sports Group explains how the Trump tariffs on Chinese-made tennis balls are propping up the now-Chinese-owned Wilson and hurting its American competitor, Penn. As Eliasch's commentary in The Wall Street Journal explains, Penn produces its balls in China while Wilson produces its balls in Thailand. By penalizing Chinese imports, Trump is giving a leg up to the competition.\n\n\"Come back to the United States,\" Trump might respond. The reality, however, is that shifting supply out of China isn't easy for companies who are also supplying the Asia market from there. Eliasch notes that it would take \"five years to shift its manufacturing out of China. If meanwhile we try to charge our U.S. customers more to compensate for the tariffs, we're bound to lose market share to Wilson and its Chinese owners.\"\n\nMany U.S. companies in China share this experience. A recent survey by the American Chamber of Commerce in China shows that 41% of the respondents considered relocating or had relocated manufacturing facilities outside of China, but only 6% were considering moving back to the United States. Southeast Asia was the top destination.\n\nFor months now, farmers have faced higher farm equipment prices, the loss of foreign markets and higher loan delinquency because of the trade war. Total tariff revenues collected from American consumers have increased by 73% year on year in the first half of 2019. Farmers and taxpayers have Trump's \"winning\" to thank for that. So, yeah, Mr. President, \"Please, don't win so much.\"\n\nVeronique de Rugy is a senior research fellow at the Mercatus Center at George Mason University. To find out more about Veronique de Rugy and read features by other Creators Syndicate writers and cartoonists, visit the Creators Syndicate webpage at www.creators.com.", "description": "On the campaign trail, candidate Donald Trump said that, if .09/12/2019 3:14:10AM EST.", "authors": ["Veronique", "De Rugy", "Beth Baumann", "Alex Nitzberg"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2017/315/001b40a9-82c1-4982-8c1a-67f023ba6144.jpg", "published_at": "2019-09-12"}