{"pub": "thehill", "url": "https://thehill.com/homenews/state-watch/467861-chicago-mayor-slams-trump-visit-to-city-insulting-ignorant-buffoonery", "downloaded_at": "2019-10-29 13:59:32.744104+00:00", "title": "Chicago mayor slams Trump visit to city: 'Insulting, ignorant buffoonery'", "language": "en", "text": "Chicago Mayor Lori Lightfoot (D) on Monday slammed President Trump Donald John TrumpJudge schedules hearing for ex-Trump aide who refused to appear in inquiry READ: Army officer to tell investigators he twice reported concerns over Trump's Ukraine dealings Murkowski, Collins say they won't co-sponsor Graham's impeachment resolution MORE's visit to the city as \"insulting, ignorant buffoonery.\"\n\nADVERTISEMENT\n\n\"It's no surprise that @realDonaldTrump brought his insulting, ignorant buffoonery to Chicago,” the mayor tweeted following Trump's Monday visit. \"Luckily, in this city, we know the truth and we will not let anyone — no matter how high the office — denigrate who we are as a people or our status as a welcoming city.\"\n\n\"Rather than belittle Chicago's communities with hateful and dishonest rhetoric, he needs to go back to D.C. and face his fate,\" Lightfoot added.\n\nIt's no surprise that @realDonaldTrump brought his insulting, ignorant buffoonery to Chicago. Luckily, in this city, we know the truth and we will not let anyone — no matter how high the office — denigrate who we are as a people or our status as a welcoming city. — Mayor Lori Lightfoot (@chicagosmayor) October 28, 2019\n\nRather than belittle Chicago's communities with hateful and dishonest rhetoric, he needs to go back to D.C. and face his fate. — Mayor Lori Lightfoot (@chicagosmayor) October 28, 2019\n\nThe mayor also defended Chicago Police Superintendent Eddie Johnson, who Trump blasted after Johnson boycotted the president's appearance.\n\n\"President Trump knows as much about policing as he does running a fair and transparent government. I stand by the Superintendent for living up to the values of this great city and its residents,\" she wrote.\n\nPresident Trump knows as much about policing as he does running a fair and transparent government. I stand by the Superintendent for living up to the values of this great city and its residents. — Mayor Lori Lightfoot (@chicagosmayor) October 28, 2019\n\nTrump's Monday visit, during which he spoke at the International Association of Chiefs of Police, was his first to Chicago as president. In the wide-ranging speech, he slammed the city’s crime rate and policies protecting undocumented immigrants.\n\n“Here’s a man that could not bother to show up for a meeting of police chiefs ... in his hometown and with the president of the United States. And you know why? It’s because he’s not doing his job,” Trump said of Johnson during the speech.\n\nJohnson responded Monday, saying that the city would partner with Trump if the partnership \"reflects who we are as Chicagoans.\"\n\n\"This president is known for doing a lot of talking about the city of Chicago. But if he's truly ready to roll up his sleeves to partner with us, so are we — as long as that partnership reflects who we are as Chicagoans,” he said.\n\nTrump has often criticized Chicago over its gun violence issues.", "description": "Chicago Mayor Lori Lightfoot (D) on Monday slammed President Trump's visit to the city as \"insulting, ignorant buffoonery.\"", "authors": [], "top_image": "https://thehill.com/sites/default/files/lightfootlori_090319getty.jpg", "published_at": "2019-10-29"}