{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/harry-dunns-family-sue-wife-20749971", "downloaded_at": "2019-10-30 00:07:20.987013+00:00", "title": "Harry Dunn's family to sue wife of US diplomat who fled to States after his death", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThe family of Harry Dunn are to sue the wife of a US diplomat who fled to the States after his death.\n\nThey are also starting legal action against Donald Trump's administration for \"lawless misconduct\".\n\nHarry, 19, died after being knocked off his motorbike near RAF Croughton, a US spy base, on August 27.\n\nAnne Sacoolas is believe to have hit the teenager after driving on the wrong side of the road and returned to America soon after the incident.\n\nHarry's family have been fighting a high-profile campaign to get Mrs Sacoolas to return to the UK to answer questions.\n\nThe family have already started a case against the Foreign Office over the decision to grant her immunity.\n\nEarlier this month his parents visited Donald Trump at the White House where the president had arranged for Mrs Sacoolas to meet them but they declined.\n\nSpokesperson for Harry Dunn's family Radd Seiger told Sky News he has instructed lawyers in the US and they will sue Mrs Sacoolas for civil damages and the Trump administration for misconduct and cover-up.\n\n(Image: PA)\n\n\"We are bringing claims against both Mrs Sacoolas in the USA for civil damages as well as the Trump administration for their lawless misconduct and attempt to cover that up,\" said a statement.\n\n\"No one is above the law and the family are determined to ensure that this never happens to another family again.\n\n\"It will be Harry's memorial. His legacy.\"\n\n(Image: REUTERS)\n\nMr Seiger said the US government had tried to \"twist and contort the laws on diplomatic immunity\" and called the White House attempt to get the family and Mrs Sacoolas in the same room a \"disgusting stunt\".\n\n\"The Trump administration is not only hell bent on breaking international laws, rules and conventions on diplomatic immunity, but they have no care or concern for the welfare of Harry's family or any real intent on finding a solution,\" said their spokesman.\n\n(Image: PA)\n\nHe added: \"President Trump told mum Charlotte at the meeting that we would look to approach the problem from a different angle, but the family have heard no further and have no faith in his words.\"\n\nLast week British police confirmed they would interview Mrs Sacoolas under caution in the US.", "description": "President Donald Trump has failed to deliver on the pledge he made to Harry's parents at the White House, says a family spokesman", "authors": ["Tom Davidson", "Image", "Pa", "Reuters"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20642174.ece/ALTERNATES/s1200/2_JS194969190.jpg", "published_at": "2019-10-29"}