{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/30/irans-ayatollah-khamenei-ordered-saudi-oil-strike-", "downloaded_at": "2019-10-01 00:11:27.411209+00:00", "title": "Exiles offer evidence of Iran's direct link to attack on Saudi oil facilities", "language": "en", "text": "The largest resistance group to the Iranian regime said Monday it had evidence that Tehran carried out the devastating Sept. 14 attack on Saudi Arabian oil facilities from a base inside Iran.\n\nThe National Council of Resistance of Iran (NCRI) held a Washington press conference to release a 22-page report based on its intelligence network inside Iran. The group, which has headquarters in Albania, said its sources indicated that the authorization for the strike, using cruise missiles and drones, came from the top mullah.\n\n“Ali Khamenei, supreme leader of the regime, directly ordered the commanders of the operation to a conduct the attack,” the NCRI report said.\n\nIran has denied attacking Saudi Arabia, and Iran-backed Houthi rebels in Yemen, fighting a brutal war against a Saudi-led coalition, have said they carried out the attack.\n\nThe Trump administration has yet to officially blame Tehran, as Saudi, U.S., European and U.N. investigators probe the attack. But U.S. officials said privately that there is mounting evidence that the resistance group is correct.\n\nThe council, working through member group the People’s Mujahedeen of Iran (MEK), says it has developed a large network of sources inside the Islamic regime. It has revealed in the past nuclear developments and facilities that were later confirmed by U.S. intelligence.\n\nThe council’s report said the MEK “has obtained exclusive and top-secret information sourced from inside the Iranian regime detailing the missile and drone attack carried out by the Iranian regime against the oil facilities of Saudi Arabia in Abqaiq and Khurais on September 14, 2019.”\n\nThe report said the Islamic Revolutionary Guard Corps, Iran’s most powerful military group, “directed it at every step.”\n\nIt deployed commanders with expertise in drone and long-range warfare from Tehran to Khuzestan province in southwest Iran. There, the Omidiyeh air base unleashed Ya-Ali cruise missiles introduced in 2014.\n\nIran’s Supreme National Security Council approved the strike at a July 31 meeting attended by President Hassan Rouhani and Foreign Minister Mohammad Javad Zarif, the report said, at a time when escalating U.S. sanctions were taking a harsh toll on the Iranian economy.\n\nThe Saudi attack “was a blatant act of war that Khamenei, Rouhani, Zarif and other regime heads were responsible for in deciding, approving and implementing” the mission, said Alireza Jafarzadeh, the council’s Washington office deputy director.\n\nA defiant Mr. Zarif appeared on “Meet the Press” on Sunday and warned that “any war that the United States starts, it won’t be able to finish.” He called President Trump, who has held off on a retaliatory strike against Iran, a “bully.”\n\n“All we do is protect ourselves,” he said. “We are not at war with Saudi Arabia.”\n\nMr. Zarif was a negotiating partner with Secretary of State John F. Kerry in 2015 to hammer out a 10-year nuclear deal signed by the U.S., Russia, China and leading European powers. Mr. Trump withdrew from the pact last year and has begun ratcheting up economic sanctions that the regime calls an act of war.\n\nAlso attending the war session was the commander of Iran’s Islamic Revolutionary Guard Corps, Qassem Soleimani. The IRGC’s air commander, the report said, “took the lead in implementing the operation.”\n\nThe MEK said its sources inside Iran suggest a new attack is being planned. It said the IRGC has moved units to the base since Sept. 22. “There is no information on their orders,” the report said.\n\nThe report contained satellite images of the military base, missile production plants and the locations of tunnels used to hide the weapons.\n\nThe Iranian regime has fiercely condemned the NCRI, accusing it of trying to entice the U.S. and other powers to overthrow the government in Tehran. Last October, French authorities froze assets of Iran’s intelligence agency in response to a suspected plot targeting the exile group’s annual meeting in Paris.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The largest resistance group to the Iranian regime said Monday it had evidence that Tehran carried out the devastating Sept. 14 attack on Saudi Arabian oil facilities from a base inside Iran.", "authors": ["The Washington Times Http", "Rowan Scarborough"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2018/08/13/Iran_US_27596.jpg-6eec5_c0-0-2500-1457_s1770x1032.jpg?0fe0070a1052bfe99ea41a6259e31e206339a006", "published_at": "2019-09-30"}