{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/sen-elizabeth-warren-reiterates-she-was-fired-from-a-teaching-job-because-she-was-pregnant/2019/10/08/dad7ff48-e9ee-11e9-9306-47cb0324fd44_story.html", "downloaded_at": "2019-10-09 00:49:04.103230+00:00", "title": "Sen. Elizabeth Warren reiterates she was fired from a teaching job because she was pregnant", "language": "en", "text": "She added: “This was 1971, years before Congress outlawed pregnancy discrimination — but we know it still happens in subtle and not-so-subtle ways. We can fight back by telling our stories. I tell mine on the campaign trail, and I hope to hear yours.”\n\nAD\n\nAD\n\nThe anecdote about her tenure at Riverdale elementary school in northern New Jersey is a key part of her stump speech, used to connect with women in her audiences. In Warren’s telling, the episode is straightforward and echoes an experience that many other young women had in the 1970s.\n\nBut some political adversaries seized on a newly surfaced video of Warren telling the story with a different emphasis — in 2007, before she was in elected office — along with freshly uncovered school board documents from the early 1970s to raise doubts about Warren’s account.\n\nRepublicans also compared the issue to Warren’s past claim that she was Native American, which resulted in her apology last year to tribes, which themselves determine their membership.\n\nAD\n\n“Uh-oh! It sure sounded good when Warren told that story but maybe it was like her ancestry – too good to be true and offered up to advance her cause,” Republican strategist Karl Rove said on Twitter.\n\nAD\n\nYet while the story has played repeatedly on Fox News and conservative outlets, it is not clear the new materials contradict Warren’s recounting of the episode in a material way.\n\nIn the March 2007 interview, which was posted on social media last week by a writer for the leftist Jacobin Magazine, Warren stressed that to keep teaching she would have had to do additional graduate school work because she didn’t have proper certification to stay on.\n\n“I went back to graduate school and took a couple of courses in education and said, ‘I don’t think this is going to work out for me,’ ” Warren said in the interview with an official at the University of California at Berkeley. “I was pregnant with my first baby, so I had a baby and stayed home for a couple of years, and I was really casting about, thinking, ‘What am I going to do?’ ” She later decided to attend law school, she said.\n\nAD\n\nAD\n\nWarren does not mention the certification issue while campaigning, focusing on being shown the door when school officials realized she was pregnant.\n\nWarren’s campaign accounted for the different explanations by saying she has opened up more about episodes of past discrimination now that she is a public official. She made her first run for office in 2012.\n\nOn Monday, the Washington Free Beacon, a conservative site, published minutes from Riverdale Board of Education meetings from 1970 and 1971 that showed Warren was initially hired to teach part time in August 1970 and then rehired for a second year in April 1971, when she was about five months pregnant.\n\nAD\n\nThe records also show that two months later, in June 1971, Warren resigned from the teaching position. She gave birth to her first child in September 1971.\n\nAD\n\nWarren said the job offer for the second year was rescinded once she was visibly pregnant.\n\nMembers of the school board could not immediately be reached for comment. But two former teachers who worked at Riverdale elementary school at the same time as Warren, first interviewed by CBS News, told The Washington Post that non-tenured pregnant teachers like Warren could be fired without cause. The two did not recall her.\n\n“Back in those days it was very common for people not to be rehired if they were pregnant,” said Trudy Randall, who began teaching at the school in 1968.\n\nSharon Ercolano said it was well known among young teachers that a pregnancy could end their careers.\n\n“At that time, that was kind of the practice,” Ercolano said. “I was a young teacher fresh out of college. That was one of the things you were kind of warned about.”\n\nAD", "description": "Her statement came after critics said she had misstated the reason she left a long-ago elementary school position.", "authors": ["Annie Linskey", "National Political Reporter Focused On The Presidential Campaign"], "top_image": "https://www.washingtonpost.com/resizer/GL6hpFC-uI8HU1TEBQIY6loJmSY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7LL5KTXKDII6TEYGI7FQGJH5IQ.jpg", "published_at": "2019-10-08"}