{"pub": "theverge", "url": "https://theverge.com/interface/2019/10/23/20927076/marc-benioff-trailblazer-book-salesforce-ceo-capitalism", "downloaded_at": "2019-10-23 10:27:52.075232+00:00", "title": "Salesforce CEO Marc Benioff: “capitalism as we know it as dead”", "language": "en", "text": "The Interface is a daily column about the intersection of social media and democracy. Subscribe to the newsletter here .\n\nThe first billionaire I ever interviewed was Marc Benioff, the CEO of Salesforce. It was the summer of 2011, and I was working on a profile of his surging interest in philanthropy, which had vaulted him into the uppermost ranks of the city’s donors. Benioff declined to talk to me at first, but eventually he relented, and he had me over to his very nice house in San Francisco to talk about his journey from workaholic salesman at Oracle to public company CEO.\n\nOne thing I took away from the conversation was that Benioff, much more than the other CEOs I had spoken with up to that point, framed every discussion in terms of values. It was why, he said, he had set aside 1 percent of his company’s shares to fund a philanthropic foundation, which exists to this day. It was why he gave all of his employees time off each year to volunteer. It was why he donated to causes including education, homelessness, and the city’s children’s hospital, to which he ultimately gave $100 million.\n\nI came away thinking that, whatever the ethics of being a billionaire (or relying on their whims to fund philanthropic efforts), on balance San Francisco was lucky to have a business leader who so regularly put his money where his values are.\n\nIn the years since, Benioff has become a prominent critic of social networks, which he has accused of acting irresponsibly. Last week, and not for the first time, he called Facebook “the new cigarettes,” and called for Section 230 to be abolished. (As Alex Kantrowitz pointed out at the time, this would create a lot of problems for Salesforce’s lawyers.)\n\nPossibly related to all this, Benioff has a new book out. It’s called Trailblazer, and it presents a kind of have-your-cake-and-eat-it-too approach to business leadership in which doing the right thing is always hard, but always creates the most value in the end.\n\nI’m not all that interested in entrepreneurial hustle porn, but I am interested in local billionaires who have a lot to say about social networks. (Facebook opinions aside, of course, Benioff also once tried and failed to acquire Twitter.) And Salesforce has also seen its share of the sort of employee activism that this year have roiled Google, Amazon, and Microsoft — in Salesforce’s case, over its contract with Customs and Border Protection.\n\nAnd so, in the days before his book came out, I hopped on the phone for my first conversation with Benioff in almost a decade. A lightly edited transcript of our conversation follows.\n\nCasey Newton: So the book opens with with you at Davos, telling your peers that you think it’s time for regulators to come in and do what CEOs won’t. And I wondered how you would rate the work that regulators have done since then, either in America or abroad?\n\nMarc Benioff: They’re getting better. But it’s still too little, too late. There is still a lack of understanding of what’s happening with social media that works with data, and the lack of regulation that the companies need to be held accountable. Even in political advertising, they need to be held accountable to the trust and truth that all journalism is held accountable to, right? You know, government can’t do it alone. It’s about business and government.\n\nI also will say, some of the regulators that we work with have come a long way in the last 18 or 24 months. But it’s got to go faster. And this is a moment in time when we need better ethics when it comes to what’s happening on the internet. Tech companies can’t wash their hands [of] what people are doing with their products, right? These companies have to take responsibility for their products, [which can] spread conspiracy theories, or place knowingly false advertising, or end up with journalists being jailed in different countries. And this is the key point of the book.\n\nYou take a rather dim view of the big social networks, Facebook in particular. But in the past, I’ve also heard you talk about the value of the “social enterprise.” And it seems like there was a time where you were really enthusiastic about what these networks could do for businesses and their customers. Was there a moment when your feelings about social networks and their responsibilities started to change?\n\nWell, I think that inside companies, social networks can create more transparency and trust. And in theory, public networks should also have that same transparency and trust. But because they’ve been taken over by robots and by organizations that are trying to spread darkness and negativity and falsehoods, that’s when it breaks down. That doesn’t happen inside of a company, because employees will walk out if that happens.\n\nAnother social network that you feel strongly about in the book is Twitter. And you tell this amazing story about how the day you went to pitch the bankers on lending you the money to buy it, you tripped and cut your leg open, and and felt like maybe that was an omen, and abandoned the project completely. And between that and what we know about the history of this company, do you ever feel like Twitter is just cursed, Marc?\n\nBecause that’s been my own feeling writing about it now for nine years.\n\nI use the product every day. And I think it’s a product that still has tremendous potential. But their vision of what safety is, and trust and truth — still can be elevated at a higher level.\n\nReading your account of trying to buy it, I got the sense that you wish your folks had supported you a little bit more on that purchase. Do you wish you were running it today?\n\nWhen I look at that, I just say that was not meant to be. That I listened to all my stakeholders, and I walked away. There’s a lot of people who have challenged me on that decision. But the reality is, I’m running a public company. It’s not my company. It’s a company that I run in partnership with all of my stakeholders. And that’s why I wrote the book Trailblazer, because that’s how I think all companies should be run.\n\nThis is the first book you’ve written since we started seeing these big waves of activity from tech workers over political issues. And you write about how difficult it was to navigate through your own employees’ frustrations with Salesforce’s CBP contract. What was it like for you to find a compromise there. And do tech workers have more leverage over CEOs than they used to?\n\nWell, as I said, these tech companies can’t wash their hands of what people do with their products. I can’t wash my hands of what people do with my product. We have responsibility for how our products are being used. That’s why I created an Office of Ethical and Humane Use. But it’s also why that Office of Ethical and Humane Use came to us in the last month or so and said, “Hey, we need to ban military assault weapons. We need to ban certain firearms. We have to ban military weapons. We can’t have those sold in our commerce cloud.”\n\nAnd, look, everyone’s not going to agree with us all the time on what we’re doing. But I will have a process and an ethical team who I think is making very good decisions.\n\nI’ve been struck over the past few years, seeing these kinds of uprisings at so many tech companies — do you have a thought on why it is suddenly that the tech workers are getting a sense of their own power?\n\nI think they realized that we need a new capitalism — that capitalism as we know it is dead. That they have the ability to be part of the new capitalism, and that means that they can bring their values to work. That these values can create value for them and for the companies they work for. And that businesses have to move this new capitalism — a more fair and equal sustainable way of doing business, that values all stakeholders as well as shareholders. And one of those key stakeholders is the employees themselves.\n\nI write mostly about the big social networks. If the the CEOs of those networks were to take one thing away from this book, what would you want that to be?\n\nThat nothing is more important than the trust you have with your customers, employees, partners, shareholders, and all stakeholders. And trust has to be your highest value. People either trust you or they don’t. Every person needs to ask the question: what is our highest value? And if trust isn’t your highest value, then what is it? If your highest value is power and control, or money, or innovation or anything else, it’s not correct.\n\nThe Ratio\n\nToday in news that could affect public perception of the big tech platforms.\n\nTrending up: Facebook committed to spending $1 billion to address the housing crisis in California. That’s real money — when Microsoft made a similar move to benefit Seattle, it mustered a measly $500 million.\n\nTrending down: On the other hand, that antitrust probe into Facebook is quickly taking shape, with nearly every state attorney general joining.\n\nGoverning\n\n⭐ Forty-six state attorneys general have joined the antitrust probe into Facebook. The ever-growing list reflects growing unease with the size and power of Silicon Valley, says Tony Romm at The Washington Post:\n\nThe expanded roster of states and territories taking part in the investigation reflects lingering, broad concerns among the country’s competition watchdogs that “Facebook may have put consumer data at risk, reduced the quality of consumers’ choices, and increased the price of advertising,” said New York Attorney General Letitia James in a statement.\n\nSeparately, New York Attorney General Letitia James met with federal investigators on Monday to discuss the case against Facebook. (Jeff Horwitz, John D. McKinnon and Deepa Seetharaman / The Wall Street Journal)\n\nA bipartisan group of lawmakers introduced a new bill that could force tech giants like Facebook and Google to build more open APIs. The goal of The “Augmenting Compatibility and Competition by Enabling Service Switching” (ACCESS) Act is to encourage competition by requiring big tech companies to make their services interoperable with products from other companies. (Makena Kelly / The Verge)\n\n“I believe this is something that needs to get built, but I understand we’re not the ideal messenger right now,” Mark Zuckerberg says of Libra in his prepared testimony for Wednesday.\n\nFacebook is mounting a damage-control effort in Washington DC to defend Libra ahead of Wednesday’s hearings. Mark Zuckerberg and David Marcus have separately met with members of the House and World Bank to discuss lawmakers’ concerns. (Cecilia Kang and Nathaniel Popper / The New York Times)\n\nOne of the lawmakers Zuckerberg met with — House Financial Services Committee chairwoman Maxine Waters — will grill him Wednesday during a Libra hearing. Initially, Sheryl Sandberg was supposed to testify, but she bowed out, saying she didn’t have the expertise. (Christopher Stern / The Information)\n\nFrom a closer look at yesterday’s account removals: Facebook eliminated a network of Russian-backed accounts posing as concerned locals in swing states. They mainly posted content praising President Trump and attacking Joe Biden. (Tony Romm and Isaac Stanley-Becker / The Washington Post)\n\nJoe Biden immediately capitalized on Facebook’s discovery, posting a series of ads that read: “The Russian Facebook trolls are back — and this time, they’re going after my campaign,” before asking for a $5 donation. (Cat Zakrzewski / The Washington Post)\n\nBut Russia isn’t only posting pro-Trump content — Researchers at Graphika did a deep dive on the IRA CopyPasta Campaign, finding accounts posing as Americans on both sides of the aisle.\n\nThe Federal Trade Commission shut down two companies involved in deceptive social media marketing. One sold fake likes, retweets, and followers on social media. The other posted fake product reviews on Sephora. (Shelby Brown / CNET)\n\nWebsites posing as local news outlets are popping up all over Michigan. Their stories, sometimes promoted via Facebook ads, mimic the look of regional news publications but have a pronounced conservative viewpoint. It’s unclear who is funding the sites. (Carol Thompson / Lansing State Journal)\n\nIndustry\n\n⭐ ISIS militants have been posting short propaganda videos on TikTok, an app better known for its viral memes and dance videos. TikTok’s parent company, ByteDance, recently hired thousands of moderators to help catch this type of content, the Wall Street Journal’s Georgia Wells reports:\n\nThe videos—since removed, in line with the app’s policy—featured corpses paraded through streets, Islamic State fighters with guns, and women who call themselves “jihadist and proud.” Many were set to Islamic State songs. Some included TikTok filters, or images, of stars and hearts that stream across the screen in an apparent attempt to resonate with young people. “We pledge allegiance ’til death,” voices sang in Arabic in one of the videos, which appear to have been posted in recent weeks. The posts from approximately two dozen accounts, identified by social-media intelligence company Storyful, appeared to target TikTok’s users as part of a new show of strength—and possible enlistment tool—as U.S. troops withdraw from Syria. Islamic State has focused on online propaganda since its inception, including using social media to spread its message, setting it apart from other jihadist groups.\n\nParents are using tracking apps like Life360 to watch their kids at college. Kids, in turn, are turning “life under Life360” into a TikTok meme and teaching each other how to get around the app’s location tracking settings. (Abby Ohlheiser / The Washington Post)\n\nSnap announced that it added 7 million users and generated more money than expected during the last quarter. This is starting to feel like a comeback. (Ashley Carman / The Verge)\n\nFacebook’s VP of product, ads, and pages, Rob Goldman, announced he’s leaving the company after more than seven years. Goldman is a nice guy and sometimes played the role of “Facebook executive defending the company on Twitter” — one of its most fearsome assignments.\n\nFacebook employees sometimes turn to reverse-engineering expert Jane Manchun Wong to learn about what their co-workers are building. Wong can be a better source than internal communications when it comes to what products are coming next, according to this profile. (Salvador Rodriguez / CNBC)\n\nThe CEO of crowdfunding platform Patreon announced a $50,000 annual grant for creators. The fund is independent from the company, but fits squarely into its vision for how modern artists work. (Adi Robertson / The Verge)\n\nA wild story about a ring of drug traffickers in Europe running an encrypted phone company — and the unfortunate fate of a crime blogger who got swept up in their world. (Joseph Cox / Vice)\n\nA fascinating in-depth video on how someone can go from being a normal web user to an alt-right internet troll. (Innuendo Studios / YouTube)\n\nAnd finally...\n\nSo me and Alyssa took our engagements pictures yesterday. She found a Pinterest picture that she wanted to try and recreate\n\n.\n\n.\n\n.\n\nI botched it pic.twitter.com/oSSUCB4o6A — Big Stack Dibbles Jr (@collinhewett17) October 20, 2019\n\nTalk to us\n\nSend us tips, comments, questions, and Marc Benioff quotes: casey@theverge.com and zoe@theverge.com.", "description": "Salesforce CEO Marc Benioff just released a new book, Trailblazer. The outspoken executive talks to us about trust, worker uprisings, and the time he tripped and decided not to buy Twitter", "authors": ["Casey Newton", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/yNoQdCEAoY9Zg_G_1SkE6HjH76Y=/0x392:5477x3260/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19310737/1181492900.jpg.jpg", "published_at": "2019-10-23"}