{"pub": "cbc", "url": "https://cbc.ca/books/why-anar-ali-wrote-a-novel-about-a-muslim-family-dealing-with-hard-times-in-a-new-country-1.5276591", "downloaded_at": "2019-10-22 13:33:43.365002+00:00", "title": "Why Anar Ali wrote a novel about a Muslim family dealing with hard times in a new country | CBC Books", "language": "en", "text": "Anar Ali is a novelist and screenwriter who was born in Tanzania, grew up in Alberta, and now lives in Toronto. Her 2009 short story collection, Baby Khaki's Wings, was a finalist for the Commonwealth Writer's Prize, the Trillium Book Award and the Danuta Gleed Literary Prize.\n\nHer latest, Night of Power, is a novel rooted in her own experience as a South Asian woman who lived in Africa. The novel looks at a Muslim family who were forced to move to Canada when Idi Amin expelled South Asians from Uganda. Making a life in Canada proves harder than it seems for each family member — and mounting issues of ambition, identity and expectations lead to tragedy.\n\nAli talks with CBC Books about how she wrote Night of Power.\n\nExamining gender roles and the patriarchy\n\n\"This story was sitting and marinating with me for a long time. I wanted to look at what it means to be a woman in a patriarchal society while also understanding what it is to be a man. Patriarchy also creates oppression for men; they're forced into spaces that they don't always want or don't always understand. They're sometimes being oppressive without even realizing it.\n\nPatriarchy also creates oppression for men; they're forced into spaces that they don't always want or don't always understand.\n\n\"The book looks at old school and contemporary ways around how we think about men and how they treat women. This is especially true looking at the stereotypical views that are around in the Muslim world or in communities of people of colour.\"\n\nScreenwriter and novelist\n\n\"Although I've worked as a screenwriter in film and TV, I was working on Night of Power first. I had never even considered a career in TV and film, but the book was taking me so long to write. Working as a screenwriter helped me as a novelist. I realized I was always thinking about my writing in a very visual and cinematic way.\n\n\"There hasn't been much written about my community in Canadian fiction. I was feeling what I think a lot of writers of colour feel, which is a feeling of voicelessness. I remember reading an American writer like Toni Morrison, who really inspired me to write within these silences.\"\n\nDiverse experiences\n\n\"This book was inspired by my experiences but I realized later I was inspired by Death Of A Salesman. This is almost like that but set in an immigrant family. It would be amazing if someone read Night of Power and felt connected to it in some way. I just love the fact that there are so many different and diverse Canadian writers out there. That means there's not one definitive immigrant experience which is fascinating to see.\"\n\nUnpacking trauma\n\n\"I was also looking at the traumas that second generation immigrants like myself carry around. This type of trauma is very different from what our parents had. I wanted to give voice to that and connect the two generations in some way. A lot of times when we think about immigrating to a new country, we think it's about starting fresh start and with a clean slate. But, of course, we haven't left everything behind.\n\nA lot of times when we think about immigrating to a new country, we think it's about starting fresh start and with a clean slate. But, of course, we haven't left everything behind.\n\n\"In the case of this particular South Asian community, they're going back different continents and subcontinents, from India to Africa and to North America. They're so keen to get rid of that history because they want to be seen as model immigrants. I understand those fears, and I understand them deeply. But it does something to your body.\"\n\nAnar Ali's comments have been edited for length and clarity. You can see more interviews from the How I Wrote It series here.", "description": "The screenwriter and author shines a light on diverse South Asian Canadian experiences with her debut novel, Night of Power.", "authors": [], "top_image": "https://i.cbc.ca/1.5221688.1564082552!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/night-of-power-by-anar-ali.jpg", "published_at": "2019-10-03"}