{"pub": "time", "url": "https://time.com/5698144/democrats-2020-campaign-lgbtq-town-hall", "downloaded_at": "2019-10-11 03:58:49.777680+00:00", "title": "2020 Democratic Candidates Join LGBTQ Town Hall", "language": "en", "text": "(LOS ANGELES) — Democratic presidential candidates took a detour Thursday from a 2020 campaign roiled by the impeachment inquiry of President Donald Trump to make a play for support within a key party constituency: LGBTQ voters.\n\nAt a time of anxiety for many members of the LGBTQ community, who see gains in equality under former President Barack Obama being rolled back or threatened by the Trump administration, rivals for the Democratic nomination promised an aggressive agenda to end workplace discrimination, improve health care and ensure protections for those who face threats or worse as members of the LGBTQ community.\n\nJoe Biden stated the obvious at the televised forum, hosted by the Human Rights Campaign Foundation and broadcast partner CNN, when he noted that the Democratic candidates generally agree on most priority issues for LGBTQ voters.\n\nAppearing in successive, separate town halls, the candidates — nine in all — expressed their concern for equality and acceptance and criticized the Trump administration while weaving in personal stories to drive points home.\n\nThe Brief Newsletter Sign up to receive the top stories you need to know right now. View Sample Sign Up Now\n\nBiden recalled announcing his support for same-sex marriage as vice president ahead of President Barack Obama — “It caused no consternation at all,” he said — and talked about how his father schooled him to accept a relationship between two men because “they love each other.”\n\nPete Buttigieg recalled his slow realization in his 20s that he was a gay man and explained that being gay didn’t mean he understood the experiences of everyone in the diverse LGBTQ community, such as a transgender black person.\n\nAnd Elizabeth Warren earned a roar of laughter from the audience in a Los Angeles theater with her response to a question about how she would respond if someone told her marriage was between one man and one woman.\n\n“I’m going to assume a guy said that,” she said, “And I’m going to say: Just marry one woman. I’m cool with that. Assuming you can find one.”\n\nCandidates began releasing statements ahead of the event near downtown Los Angeles. Kamala Harris said she would appoint a chief advocate for LGBTQ affairs in the White House. Warren released a lengthy plan that she said would secure LGBTQ rights and equality. Bernie Sanders, who is recovering in Vermont after a heart attack and will not attend, said in a statement that the nation “must not let Donald Trump and the Supreme Court take us backward on LGBTQ rights.”\n\nThe 2020 campaign is unfolding at a time when polling shows significant backing for LGBT rights. A Pew Research Center poll in March pegged Americans’ support for same-sex marriage at 61%. A Gallup poll found that 71% support allowing transgender people to serve in the military, a stance at odds with Trump’s efforts to sharply restrict their military presence.\n\nIn the 2016 presidential contest, Democrat Hillary Clinton dominated among voters who identified as lesbian, gay, bisexual or transgender in her loss to the Republican Trump.\n\nAmong issues that came up repeatedly: The Supreme Court is weighing whether a landmark civil rights law protects LGBTQ people from discrimination in employment, and the Trump administration has reversed course from the Obama administration and has sided with employers who argue that the civil rights law does not protect LGBT people.\n\nThe administration also has moved to restrict military service by transgender men and women, proposed allowing certain homeless shelters to take gender identity into account in offering someone a bed for the night and concluded in a 2017 Justice Department memo that federal civil rights law does not protect transgender people from discrimination at work.\n\nIn a statement, Trump’s campaign said the president “stands in solidarity with all LGBTQ allies and is dedicated to creating a safer and stronger America for all citizens regardless of their sexual orientation, gender, religion, race, or ethnicity.” The statement said that the administration has launched a global effort to end the criminalization of homosexuality and that Trump is dedicated to ending the HIV epidemic in the United States.\n\nCory Booker recalled the long fight over civil and women’s rights and promised to bring the same urgency to the campaign for LGBTQ equality.\n\nThe New Jersey senator didn’t give a direct answer when asked if religious groups should lose their tax-exempt status if they engage in discrimination against the LGBTQ community. “There have to be consequences for discrimination,” he said while declining to answer yes or no to the question.\n\nThe Human Rights Campaign Foundation said it was the first time in history that a major cable news network will air a presidential event devoted to LGBTQ issues.\n\nLBGTQ-rights activists said they are eager to hear how the Democratic candidates intend to distinguish themselves on issues important to the community.\n\n“It’s very nice to say, ‘I support LBGT equality,’ but how do you overcome the challenges that we face in our community? That’s what we want to hear,” Human Rights Campaign President Alphonso David told reporters.\n\n“We are not interested in the soundbites,” he added.\n\nContact us at editors@time.com.", "description": "Democratic presidential candidates took a detour from the impeachment inquiry to make a play for support with LGBTQ voters", "authors": ["Michael R. Blood"], "top_image": "https://timedotcom.files.wordpress.com/2019/10/joe_biden_democrats_lgbtq_2020_campaign.jpg?quality=85&w=1200&h=628&crop=1", "published_at": "2019-10-11"}