{"pub": "marketwatch", "url": "https://marketwatch.com/story/twitter-to-ban-most-political-advertisements-2019-10-30", "downloaded_at": "2019-10-30 23:19:34.684234+00:00", "title": "Twitter to ban most political advertisements", "language": "en", "text": "SAN FRANCISCO — Twitter is banning most political advertising from its service, saying social media companies give advertisers an unfair advantage in proliferating highly targeted, misleading messages.\n\n“While internet advertising is incredibly powerful and very effective for commercial advertisers, that power brings significant risks to politics, where it can be used to influence votes to affect the lives of millions,” Twitter TWTR, +0.03% CEO Jack Dorsey tweeted Wednesday in a series of tweets announcing the new policy.\n\nWe’ve made the decision to stop all political advertising on Twitter globally. We believe political message reach should be earned, not bought. Why? A few reasons…🧵 — jack 🌍🌏🌎 (@jack) October 30, 2019\n\nFacebook FB, -0.56% has taken fire since it disclosed earlier in October that it will not fact-check ads by politicians or their campaigns, which could allow them to lie freely. CEO Mark Zuckerberg told Congress last week that politicians have the right to free speech on Facebook.\n\nThe issue suddenly arose in September when Twitter, along with Facebook and Alphabet’s GOOGL, +0.00% GOOG, -0.11% Google, refused to remove a misleading video ad from President Donald Trump’s campaign that targeted former Vice President Joe Biden, a leading Democratic presidential candidate.\n\nIn response, Democratic Sen. Elizabeth Warren, another presidential hopeful, ran her own ad on Facebook taking aim at Zuckerberg. The ad falsely claimed that Zuckerberg endorsed President Donald Trump for re-election, acknowledging the deliberate falsehood as necessary to make a point.\n\nCritics have called on Facebook to ban all political ads. These include CNN chief Jeff Zucker, who recently called the company’s policy of allowing lies “absolutely ludicrous” and advised the social media giant to sit out the 2020 election until it can figure out something better.\n\nGoogle and Facebook did not have immediate comments on Twitter’s policy change.\n\nMontana Gov. Steve Bullock, who is running a 2020 Democratic presidential campaign, retweeted Dorsey’s announcement, adding the comment “Good. Your turn, Facebook.”\n\nDorsey said the company is recognizing that advertising on social media offers an unfair level of targeting compared to other mediums. It is not about free speech, he asserted.\n\n“This isn’t about free expression. This is about paying for reach. And paying to increase the reach of political speech has significant ramifications that today’s democratic infrastructure may not be prepared to handle,” he tweeted. “It’s worth stepping back in order to address.”\n\nTwitter currently only allows certified campaigns and organizations to run political ads for candidates and issues. It will ban both types of political ads.\n\nThe company said some exceptions will be made, including ads that encourage voter turnout. It will describe those in a detailed policy it plans to release on Nov. 15.\n\nFederal campaigns are expected to spend the majority of advertising dollars on broadcast and cable channels during the 2020 election, according to advertising research firm Kantar, and about 20% of the total $6 billion in spending on digital ads.\n\nTwitter’s policy will start on Nov. 22.", "description": "Twitter is banning all political advertising from its service, saying social media companies give advertisers an unfair advantage in proliferating highly...", "authors": ["Associated Press"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GX451_twitte_ZG_20181031200356.jpg", "published_at": "2019-10-30"}