{"pub": "investing.com", "url": "https://ng.investing.com/analysis/tesla-3q-preview-earnings-could-show-first-quarterly-sales-decline-in-7-years-20506", "downloaded_at": "2019-10-23 10:32:47.393027+00:00", "title": "Tesla 3Q Preview: Earnings Could Show First Quarterly Sales Decline In 7 Years", "language": "en", "text": "* Reports 3Q 2019 results on Wednesday, Oct. 23, after the close\n\n* Revenue expectation: $6.47 billion\n\n* EPS expectation: ($0.45)\n\nTesla (NASDAQ: ) has been fighting a tough battle, attempting to turn around the negativity that has blighted its shares for months and cast dark shadows over its once-glittering future. When the pioneering maker of electric cars reports its third-quarter today, it has to prove that it’s winning the struggle.\n\nThe biggest challenge for the company’s ambitious but controversial CEO, Elon Musk, is to show the company can make profits that are sustainable, when car sales are improving.\n\nEarlier this month, Tesla reported that it delivered a record 97,000 units in 3Q, including 79,600 Model 3 sedans, plus 17,400 of the more expensive Model S cars and Model X crossovers. The company's statement didn’t mention whether it’s still expecting to deliver the 360,000 to 400,000 vehicles it had predicted for this year. It will need to sell an additional 105,000 cars in the last three months of the year to hit the low end of that forecast.\n\nBut the encouraging October delivery report also had bad news hidden in it. Many analysts believe that more sales of the lower-priced Model 3 sedans have most likely hurt revenue in the third-quarter, making Musk’s goal of achieving profitability more elusive. Model 3 sedans, which start at $38,990 in the U.S., are less than half the cost of the cheapest Model S or X.\n\nShares Under Pressure\n\nThese concerns have kept Tesla stock under pressure throughout the year. It’s down about 25% for the year to $255.58 at yesterday's close, but it has recovered almost half of its losses since June when it was trading 46% lower.\n\nTesla Weekly Chart\n\nIf analysts' consensus forecast proves correct, Tesla will report a third, straight quarter of losses today, while sales could fall to $6.47 billion from the same period a year ago when the company had reported revenue of $6.8 billion. Analysts at Credit Suisse and RBC Capital Markets are among those predicting Tesla will post lower revenue for the third quarter versus a year ago. If that happens, it will be a first for the company since 2012 — the year the Model S started production.\n\nThe most important detail in this earnings report, in our view, will be information about the automaker’s drive to contain costs. In the short-run, that’s one of the most important factors that could improve the bottom-line and keep more cash in Tesla’s coffers to help it pursue its expansion.\n\nBottom Line\n\nTesla’s stock offers a good example of an investment where you have to decide between growth and cash flows. Elon Musk’s mission of producing an economical electric car is an admirable and noble goal, but it’s not clear how long it will take for the company to start making a profit and rewarding its investors.\n\nTesla’s premium valuations when compared to other carmakers will only be justified if Musk can show that the company can deliver more cars and make money as well. Due to these lingering worries, we aren’t yet ready to change our negative view on Tesla, notwithstanding the positive surprise on deliveries this month.", "description": "Shares Analysis by Investing.com (Haris Anwar/Investing.com) covering: Tesla Inc. Read Investing.com (Haris Anwar/Investing.com)'s latest article on Investing.com UK.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-23"}