{"pub": "bbc", "url": "https://bbc.com/news/world-us-canada-49643015", "downloaded_at": "2019-09-09 23:24:34.481175+00:00", "title": "Theft charges for couple who spent $100k from bank transfer mistake", "language": "en", "text": "Image copyright Getty Images\n\nA Pennsylvania couple has been charged with theft after spending thousands of dollars their bank mistakenly deposited in their account.\n\nRobert and Tiffany Williams received $120,000 (£97,000) in error and then spent nearly all of it, according to an affidavit.\n\nThe couple also faces over $100,000 in overdraft fees, having purchased an SUV and other goods, police say.\n\nThe affidavit says the couple admitted knowing the money was not theirs.\n\nMr and Mrs Williams, 36 and 35 respectively, have been charged with theft and receiving stolen property. They have been released on bail.\n\nOn Monday, they appeared in court in Lycoming County, and waived their rights to a preliminary hearing. The pair have not commented to US media and it is unclear whether they have obtained legal counsel.\n\nThe couple received the erroneous deposit in their BB&T bank account on 31 May, state trooper Aaron Brown told the Williamsport Sun-Gazette newspaper. The money was meant to go to an investment firm.\n\nThe error was noticed on 20 June, and the money was taken out of the Williams' account and deposited correctly.\n\nBut police said by this time, the couple had already spent around $107,000 of the money without contacting the bank.\n\nThe Williams' purchased a Chevrolet Traverse, two four-wheelers, a camper, a race car and other household goods, according to the complaint. They also gave $15,000 to help friends.\n\nYou might also be interested in:\n\nWhen she was contacted by bank officials, Mrs Williams told them \"she no longer had the funds because she had already paid off bills\", Mr Brown wrote in the criminal complaint, according to CBS News.\n\n\"[Tiffany Williams] told the bank her husband had spent a great portion of the funds and purchased a four-wheeler. She said she would speak to her husband and attempt to construct a repayment agreement.\"\n\nHowever, the bank was unable to contact the couple after that conversation.\n\nWhen investigators spoke to the couple in July, both \"admitted to knowing the mislaid money did not belong to them, but they spent it anyway\". Before the accidental deposit, their account had an average balance of $1,000.\n\nBB&T bank told CNN in a statement: \"While we can't comment on the specifics of this issue due to client privacy practices, we always work as quickly as possible to address any issue that affects our clients.\"", "description": "A Pennsylvania couple spent nearly all of a mistaken transfer on an SUV and other items, police say.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/DC84/production/_108725465_gettyimages-628161012.jpg", "published_at": "2019-09-09"}