{"pub": "cbs", "url": "https://cbsnews.com/news/aaron-dean-case-former-fort-worth-officer-speaks-out-murder-charge-atatiana-jefferson-death-2019-10-15", "downloaded_at": "2019-10-16 00:26:44.041584+00:00", "title": "Former Fort Worth cop: \"I'm afraid when I get stopped\"", "language": "en", "text": "Fort Worth, Texas – Aaron Dean, a white former police officer, is out on bond after being arrested and charged with murder for shooting Atatiana Jefferson, a 28-year-old black woman, inside her Texas home. He was responding to a neighbor's call for a wellness check.\n\nDean resigned before he could be fired from the Fort Worth Police Department Monday.\n\nThe family is relieved Dean was arrested, but they said more needs to be done to change the police department, CBS News correspondent Omar Villafranca reports. We spoke to a former Fort Worth officer who echoed that sentiment.\n\n\"As a black female, former police officer, I'm afraid when I get stopped,\" Larhonda Young said Monday. She said she doesn't trust the department's officers, and she feels Jefferson's death represents a clear breach of protocol.\n\n\"Officers are shooting before assessing the situation,\" Young said. \"If that officer had simply knocked on the door, that young lady would be alive today.\"\n\nBody camera footage shows the moment he shot and killed Jefferson in her home on Saturday. The video shows Dean never identified himself as a police officer. He was responding to a 2 a.m. wellness call from Jefferson's neighbor, who could be heard saying on the call, \"The front doors have been open since 10 o'clock.\" But Interim Police Chief Ed Kraus said it may not have been clear there was no emergency.\n\n\n\n\"If they thought they had something more criminal, then a more tactical response would be warranted,\" Kraus said.\n\nJefferson's siblings, Ashley and Adarius Carr, said it's a sign the department has to change what their attorney called \"a brutal culture of policing.\"\n\n\n\n\"No guns should've been out. There was no threats,\" Ashley said. For Adarius, when he heard the gunshot came through a window, he thought, \"That's drive-by material.\"\n\nKraus agrees: There's no excuse for Dean's actions.\n\n\n\n\"What can you tell members of the community who have told us incidents like this are why they do not trust Fort Worth police?\" Villafranca asked him.\n\n\"I tell them, I get it,\" Kraus said. \"We're trying to ensure that they act and react… with the servant's heart, instead of a warrior's heart.\"\n\n\n\nWhile Dean has been charged with murder, the investigation won't end there. City officials in Fort Worth have presented a preliminary case to the FBI to review his actions for possible civil rights violations.\n\nEditor's note: This article has been updated to clarify that Larhonda Young resigned from the department.", "description": "A white former police officer is out on bond after being arrested and charged with murder for shooting​ a black woman inside her Texas home", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/15/e1ab27f0-656a-453b-a8b3-c1870d190315/thumbnail/1200x630/bd5a5173b3b86e1a7e80f7fe61729c58/ctm-1015-retired-fort-worth-police-officer.jpg", "published_at": "2019-10-15"}