{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-eu-spain/britains-barclay-urges-eu-to-be-flexible-creative-over-brexit-idUKKBN1W40OM", "downloaded_at": "2019-09-19 09:43:02.111859+00:00", "title": "Britain's Barclay urges EU to be flexible, creative over Brexit", "language": "en", "text": "MADRID (Reuters) - Britain’s Brexit minister Stephen Barclay urged the European Union to show flexibility and creativity over Brexit on Thursday, saying the Irish backstop arrangement “has to go” and that Britain was prepared to leave without a deal if needed.\n\nBritain's Brexit Secretary Stephen Barclay delivers a speech during a breakfast meeting in Madrid, Spain, September 19, 2019. REUTERS/Sergio Perez\n\nBarclay was speaking in Madrid just six weeks before the date on which Prime Minister Boris Johnson has vowed to take Britain out of the European Union by Oct. 31 “do or die”.\n\nBritain wants a deal but both sides must work to reach one, Barclay said.\n\n“The prize of a deal should focus the minds of both sides on this need for creativity and flexibility,” he said.\n\n“So let’s work creatively to secure a deal, a deal the UK is committed to get in, a deal without a backstop ... a deal which indeed will pass both the UK parliament and the European parliament.”\n\nHe listed issues with the Irish arrangement which made it impossible to accept, including the difficulty of guaranteeing it would be temporary.\n\n“The backstop will not be agreed with the United Kingdom. The UK parliament has already rejected it three times,” he said.\n\nA deal to leave the EU would help manage issues including the treatment of international business groups like British Airways and Iberia airlines operator IAG (ICAG.L) and logistics around the British territory of Gibraltar, Barclay said.\n\nHe added that the conservative government would abide by an upcoming Supreme Court ruling on the parliament suspension ordered by Johnson.\n\nBritain’s top judicial body, the Supreme Court, is hearing a third and final day of legal arguments on Thursday over whether Johnson acted unlawfully when he suspended parliament in the run-up to Brexit.\n\nBarclay said he will meet EU Brexit negotiator Michel Barnier on Friday.", "description": "Britain's Brexit minister Stephen Barclay urged the European Union to show flexibility and creativity over Brexit on Thursday, saying the Irish backstop arrangement \"has to go\" and that Britain was prepared to leave without a deal if needed.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190919&t=2&i=1431520802&w=1200&r=LYNXMPEF8I0GK", "published_at": "2019-09-19"}