{"pub": "breitbart", "url": "https://breitbart.com/national-security/2019/10/26/u-s-and-western-democracies-pressure-accuse-bolivia-socialist-evo-morales-of-rigged-presidential-vote", "downloaded_at": "2019-10-27 00:13:44.195605+00:00", "title": "Bolivia: U.S. Suggest Socialist Evo Morales Rigged Re-election", "language": "en", "text": "The United States and other Western democracies are pressuring Bolivian socialist Evo Morales to agree to a second-round run-off against his opponent Carlos Mesa after the former claimed victory in a presidential election that critics suggest was rigged.\n\nMorales declared himself the victor on Thursday morning, with official results appearing to show him winning the first round outright. With 99.99 percent of the ballots counted on Thursday night, he supposedly took 47 percent while his challenger, former President Carlos Mesa, took 36.5 percent.\n\nOpponents claim Bolivia’s electoral authorities manipulated the vote count in favor of Morales, who will now serve his fourth term in office three years after successfully amending the country’s constitution to scrap term presidential limits and allow himself to seize power indefinitely.\n\nIn a statement on Friday, the European Union said that it “fully shares” the view of the Organization of American States that there should be a second round.\n\n“The interim OAS (Organisation of American States) mission report has identified substantial shortcomings of the electoral process, notably the unexpected interruption of the publication of the voting results, that undermine the necessary credibility and transparency,” the statement read.\n\nThe statement continued:\n\nThe European Union fully shares the OAS assessment that the Bolivian authorities should finalize the ongoing counting process and that the best option would be to hold a second round to restore trust and ensure the full respect of the democratic choice of the Bolivian people. We call on all parties to refrain from violence and from making declarations that are divisive. A constructive approach is essential for national peaceful reconciliation.\n\nIn a communique issued by Colombia’s Foreign Ministry on behalf of themselves, the United States, Brazil, and Argentina, the four countries also insisted they would “only recognize results that reflect the will of the Bolivian people.”\n\nBolivia has been rocked by violent demonstrations taking place across the country. Many participants are warning that the country is sliding towards a socialist dictatorship similar to Nicolás Maduro’s regime in Venezuela and Cuba’s longterm communist rule.\n\nA mysteriously delayed vote count in Bolivia's presidential election has sparked protests and accusations of fraud. President Morales looked close to securing a 4th term after the vote count resumed pic.twitter.com/oONF1P7J5e — Bloomberg TicToc (@tictoc) October 23, 2019\n\nSuspicions of vote-rigging were raised on Sunday evening after the Supreme Electoral Tribunal (TSE) abruptly halted an electronic quick count for 24 hours as it showed the two leading candidates were headed to a second-round run-off, with 84 percent of the votes counted. Yet after counting resumed, Morales suddenly gained a ten-point lead, sparking widespread suspicion about such an irregularity.\n\nPosting on Twitter on Friday, Morales appeared to show no intention of not accepting the results, having already accused opponents of instigating a U.S.-backed “coup.”\n\n“We are not alone, we are strengthened with the truth and the struggle for the unity and dignity of our beloved Bolivia,” he wrote. “The people won again. We will not fall into provocation or confrontation. The democratic and peaceful struggle will carry on.”\n\nNo estamos solos, estamos fortalecidos con la verdad y la lucha por la unidad y dignidad de nuestra querida Bolivia. El pueblo ganó nuevamente. No vamos a caer en la provocación ni en la confrontación. La lucha democrática y pacífica continuará. — Evo Morales Ayma (@evoespueblo) October 25, 2019\n\nFollow Ben Kew on Facebook, Twitter at @ben_kew, or email him at bkew@breitbart.com.", "description": "Western democracies are pressuring Bolivia to agree to a second-round run-off against his opponent Carlos Mesa.", "authors": ["Ben Kew"], "top_image": "https://media.breitbart.com/media/2019/10/Evo-Morales-640x335.jpg", "published_at": "2019-10-26"}