{"pub": "yahoo", "url": "https://finance.yahoo.com/news/chaotic-repo-funding-market-fell-160538207.html", "downloaded_at": "2019-09-18 05:12:22.697782+00:00", "title": "Chaotic Repo Funding Market Fell Asleep at the Wheel", "language": "en", "text": "(Bloomberg Opinion) -- For the past two days, a usually under-the-radar part of critical market plumbing has captivated traders. It’s probably best summarized by this chart:\n\nIt doesn’t take an ardent follower of the rates on overnight general collateral repurchase agreements to recognize a sharp spike. The funding rate rose more than 600 basis points to as high as 8.75%. These kinds of sharp increases happen from time to time around the end of a quarter but rarely in the middle of a month.\n\nIn simple terms, the repo market matches up those who need short-term liquidity with those who want a safe short-term investment. So at certain points in the past 24 hours, it cost 8.75% to obtain cash for one day, even when pledging virtually risk-free Treasuries as collateral. The rate normally fluctuates closely in line with the range of the fed funds rate, which is now 2% to 2.25%.\n\nThe implications of this move are open to interpretation. For those who see doomsday around the corner, “this time the funding squeeze could have dire consequences for not only the economy but the market.” For those with a bit more tempered attitude, like Thomas Simons at Jefferies LLC, “it’s difficult for the dealer community. But it’s not systemically threatening.”\n\nIndeed, within minutes of an announcement by the Federal Reserve Bank of New York that it would conduct its first overnight system repurchase agreement in a decade, the rate settled back down to 2.5%. The bank said it would lend cash to primary dealers against collateral like Treasury securities for up to $75 billion to keep the fed funds rate steady. Some bond traders had called for an intervention 19 hours earlier.\n\nAnd yet, just to add to the confusion, the New York Fed abruptly canceled the operation because of technical difficulties, swiftly pushing the overnight funding rate back to 6%. It was eventually successful, with the bank taking $53.2 billion of Treasuries and securities.\n\nPerhaps the strangest part about all of this chaos is that it was something of a slow-moving train wreck that all parties could have at least partially seen coming, even if few were expecting anything quite this dramatic. Bloomberg News’s Stephen Spratt explained what happened:\n\nWhat happened was an unfortunate coincidence — just as companies were withdrawing cash from money markets to pay corporate tax, a glut of new bonds appeared on the market as the U.S. government sold some $78 billion of 10- and 30-year debt last week.\n\nWith just $24 billion of bonds maturing in the period, this became one of three occasions this year when the imbalance between debt redemption and cash needed to buy new Treasuries exceeded $50 billion.\n\nSuddenly there was a scarcity of dollars at the same time as a glut of Treasuries, which banks typically lend out to investors with spare cash through repurchase agreement. …\n\n“Repo pressure is almost entirely a settlement story with $54 billion of net supply in Treasury coupons landing on already very crowded dealer balance sheets,” Blake Gwinn, head of front-end rates at NatWest Markets, wrote in a research note.\n\nThis kind of mismatch doesn’t just come out of nowhere — in fact, some analysts were writing about an impending squeeze more than a month ago. “Funding costs were aggravated by a lack of anticipation of an event that should have been more visible in advance,” said Jim Vogel at FTN Financial Capital Markets. “Term repo rates showed no bump earlier this month to bridge over the obvious one-day pressures that were due on Monday.”\n\nIt’s easy to get bogged down in the repo market’s terminology and details. But I come back to a phrase used in an article by Bloomberg News’s Liz Capo McCormick and Alexandra Harris around this time last year. Repos, they said, “grease the wheels of debt trading.” Importantly, panic in the market also “helped speed up the demise of Lehman and Bear Stearns Cos. in the span of six months.”\n\nThis is not a market that every investor in every asset class needs to understand in-depth. But they need to have confidence that those who are intimately involved in repo aren’t asleep at the wheel. It might not be all that reassuring, for example, that Simon Potter, the former head of the New York Fed's markets group, departed abruptly earlier this year. On its face, the banking system seems more resilient than it was in 2008 thanks to tighter regulations, but that’s come at the cost of a shrinking amount of repo even as the size of the U.S. Treasury market has ballooned.\n\nStory continues", "description": "(Bloomberg Opinion) -- For the past two days, a usually under-the-radar part of critical market plumbing has captivated traders. It’s probably best summarized by this chart:It doesn’t take an ardent follower of the rates on overnight general collateral repurchase agreements to recognize a sharp spike", "authors": ["Brian Chappatta"], "top_image": "https://s.yimg.com/uu/api/res/1.2/f7dp4pdpmu0vY03EYSOTmg--~B/aD03NzA7dz0xMjk2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_opinion_268/8711c0148b19aa920113f3d1978e267f", "published_at": "2019-09-17"}