{"pub": "foxbusiness", "url": "https://foxbusiness.com/healthcare/michigan-ban-flavored-ecigarettes-vaping-health-concerns", "downloaded_at": "2019-09-04 23:48:07.697701+00:00", "published_at": "2019-09-04", "title": "Michigan is first state to ban flavored e-cigarettes amid vaping health concerns", "language": "en", "text": "Michigan is set to become the first state to ban flavored e-cigarettes over health concerns for young people.\n\nContinue Reading Below\n\nThe ban will last six months, at which point it can be renewed for another six months, The Washington Post reported. It prohibits retail and online sales of vaping products with sweet, fruity, mint and menthol flavors.\n\nGov. Gretchen Whitmer told the Post that sweet flavors draw young people to use nicotine and could leave them with long-term health consequences. She said the state’s health department found youth vaping is a public health emergency.\n\n“My number one priority is keeping our kids safe,” Whitmer tweeted. “Right now, companies selling vaping products are using candy flavors to hook children on nicotine and misleading claims to promote the belief that these products are safe.”\n\nThe ban also prohibits vaping products from being described as “safe,” “clear” or “healthy,” according to the report. Businesses will have 30 days to comply with the ban.\n\n“We’re taking important steps to protect Michigan’s youth,” Michigan Department of Health & Human Services Director Robert Gordon tweeted. “'Bubble gum' is a good flavor for bubble gum, not a nicotine product.”\n\nE-cigarette companies like industry leader Juul Labs have faced several probes from federal and state authorities into how vaping products have been marketed. The Food and Drug Administration has considered pushing flavored e-cigarettes to a separate, age-restricted section of stores. Attempts to regulate the industry have prompted a lawsuit by the trade group Vapor Technology Association against the FDA.\n\nJuul said last month that it was implementing efforts to stop young people from using its products, including new “retail access control standards” that are designed to prevent anyone underage from buying its products.\n\nThe company has also supported laws setting the minimum age for tobacco including vaping products to 21.\n\n“Underage vaping is a serious problem,” Juul Labs CEO Kevin Burns said in a recent press release. “Juul Labs is committed to preventing underage use and has taken the most aggressive actions of anyone in the industry to proactively curb underage use.”\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nBut there are still questions about the long-term effects of vaping, regardless of age. The American Lung Association said it “is very troubled by the evolving evidence about the impact of e-cigarettes on the lungs.”\n\nThe Centers for Disease Control and Prevention said last week that it was investigating 215 severe lung disease cases that may be related to e-cigarette use. In Michigan, health officials said last week that they were investigating six lung infections that were related to vaping, the Detroit Free Press reported.", "description": "The ban prohibits retail and online sales of vaping products with sweet, fruity, mint and menthol flavors.", "authors": ["James Leggate"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/05/0/0/Juul.jpg?ve=1&tl=1"}