{"pub": "guardian", "url": "https://theguardian.com/lifeandstyle/ng-interactive/2019/sep/29/designer-es-devlin-all-the-worlds-her-stage", "downloaded_at": "2019-09-29 23:33:49.025154+00:00", "title": "Designer Es Devlin: all the world’s her stage", "language": "en", "text": "AUTUMN DESIGN PART 1 • INDEX Editor's letter The right design can make a radical difference. It can change lives and save the planet. The latest issue of the Observer's Design magazine is full of designers and artists who are rethinking the way the world works from the ground up. Fashion designers who don’t think we should make more clothes. Researchers looking at moss, fungus and meat for new construction materials. We also mark the anniversary of the group the New Alchemists, a research group from the 60s who first saw the magic in renewable energy and a sustainable way of living. Enjoy. Alice Fisher Part 1 Es Devlin. All the world's her stage From theatre sets to arena shows for Kanye West, stage designer Es Devlin has waved her magic wand over them all. Now it’s her turn in the spotlight\n\n\n\nEs Devlin, the 48-year-old British set designer, is often asked where her ideas come from. These ideas – “stage sculptures”, she calls them – might take the form of the ingenious revolving glass box that encloses the performers in director Sam Mendes’s production of The Lehman Trilogy, transferring to Broadway next year after a sold-out run in London’s West End, or an outsize replica of Miley Cyrus’s tongue that the singer slid down on her 2014 Bangerz tour. Or it could be 200,000 pieces of mirror fixed by hand on to columns for a Louis Vuitton runway show or a pair of hands 25m high emerging from Lake Constance in Austria, tossing playing cards in the air for a production of Bizet’s Carmen.\n\nSo, yes, ideas, ridiculous ones, lots of them. At first, Devlin tried to answer these inquiries honestly. Most of her ideas, she would reply, come just after she has woken up. She loves that moment when she’s lying in bed, in a totally dark room, maybe jetlagged, and the only light is the faint edge round the curtains. There’s something very stage-like about it. She sets an initial alarm – “a very gentle one” – then a proper one, to allow for 20 minutes of meditative dozing. “It’s a lovely liminal space,” she says. “You can really luxuriate in what your mind would be like if you didn’t have to do anything. It’s really important.”\n\nThe problem is that people really hate this answer. “They almost want the, you know, map coordinates,” she goes on, laughing. “‘Where are the ideas? Come on! Don’t fob me off with some bullshit about sleeping.’”\n\nDevlin inside the stage set she designed for The Hunt, Rupert Goold’s adaptation of Thomas Vinterberg’s film. Photograph: Phil Fisk/The Observer\n\nDevlin being Devlin, she has come up with another, more evocative answer. “I picked a space, which is a corridor,” she explains, as we sit in the garden of her house in Dulwich, south London. Devlin recalls that she spent a lot of her childhood in corridors. First of all, she has “a really big mouth”, which meant she was always being kicked out of class. Second, she’s very smiley, and this infuriated her teachers even more: “They’d go, ‘Esmerelda, wipe that grin off your face!’” Now, looking back, Devlin realises that corridors can be magical places. She might hear snatches of a physics class in one room, some poetry from another, a music lesson taking place down the hall, teachers having a gossip. “But I’m the only person who’s listening to all of that together,” she exclaims. Then she stops: “The next thing is just not forgetting it.”\n\nPeople tend to find this response a bit more satisfying.\n\nOver 25 years, Devlin has established herself as the world’s most influential set designer. She began in theatre – via a degree in English literature from Bristol University and a foundation course at Central Saint Martins – and it’s here that her impact has been especially profound. When she started out, theatre felt like a dying art form: predictable, staid, classic texts played for audiences in their dotage. Today it feels vibrant: a place where you switch off your phone (a radical idea), sit with other people (even more challenging) and experience entertainment that, when it’s finished, will exist only in the memories of the people who were there. Some of Devlin’s most notable stage sets include Benedict Cumberbatch’s Hamlet at the Barbican in 2015, a witty, clinical take on American Psycho at the Almeida and the National Theatre’s 1998 revival of Harold Pinter’s Betrayal. (On opening night, Pinter was doing a meet-and-greet and said, “Have you met Es Devlin? She wrote the play.”)\n\nDevlin’s lake stage for Bizet’s Carmen at Bregenz festival in Austria. Photograph: 172028009672/courtesy of Es Devlin\n\nDevlin – who is petite but strong-looking and today, as she often is, dressed head-to-toe in black, an exact match for her hair, which is knotted in a bun – thinks her job as a set designer in the theatre is to find “little chinks in the armour of the brain”. When she gets it right, complex ideas and even archaic language suddenly make perfect sense to an audience. “You get these tiny opportunities where people relax enough to feel that everything is familiar and they can follow the story,” she says. “We all know that feeling when we go to the theatre and we’re either relaxed knowing we’re in good hands, or anxious because we’re in crap hands and it’s going to be a shit night.”\n\nDevlin’s theatre work led organically to designing sets for music shows. A turning point, she acknowledges, was when Kanye West saw images of the stage set she created with the Chapman brothers for the British post-punk band Wire in 2003. This led to Devlin and West working together from 2005 for almost a decade, including on his 2011 Watch the Throne tour, where West and Jay-Z stood on giant LED cubes on to which images and lights were projected. She created the set for Adele’s first concerts for five years in 2016, spent two years on U2’s Innocence & Experience arena show and somehow managed to bring an 80ft animatronic human figure to life for Take That.\n\nAll of these set designs are technically dazzling, but Devlin is adamant that her work should never overshadow the performers. She also hopes there’s a coherence in thought and process in everything she does. “Moving between genres,” she says, “you can see there’s a spinning cube that might happen at the Serpentine Gallery, it might happen at the National Theatre and it might happen on a Beyoncé stage. People never really, not recently anyway, come along and say, ‘I want one of these.’ It’s more, ‘Here’s the music, this is the day of the show, let’s begin.’”\n\nMiley Cyrus emerges from her own mouth, as designed by Devlin, on her 2014 tour. Photograph: Courtesy Es Devlin\n\nIn recent times, though, a significant change has taken place for Devlin. For most of her career, her job has mainly been to bring someone else’s vision to life. But now she’s coming in earlier in the process and as an artist herself. Mendes is collaborating with her on a play that hasn’t even been written yet: the visuals are just as important as the words, if not more so. Likewise, Abel Tesfaye, the Canadian R&B artist known as the Weeknd, has brought in Devlin long before his fourth album is completed to establish how the stage set for his tour will look. Devlin’s also been asked by Pitzhanger, a country home in west London owned by the architect Sir John Soane in the early 1800s and reopened this year as a gallery, to make a sculpture there. Hers will be the second show, following Anish Kapoor’s.\n\n“It’s been the secret plan all along,” Devlin whispers theatrically, about these new projects that place her firmly at centre stage. “No, it wasn’t a plan. You just grow. What I’ve noticed is that you get to a point in your practice and you radiate that, and then people pick up on it.”\n\nWe meet in the afternoon, at 4pm, and Devlin’s already been to Paris, had a meeting with Nicolas Ghesquière, creative director at Louis Vuitton, and come back. Now, she talks for more than two hours without remotely flagging. There’s a story that, while she was in labour with her second child, she was simultaneously sending plans to the singer Shakira – I ask her if I’ve heard it right, though I suspect I know the answer.\n\n“That’s sadly true,” she replies. “Felix Barrett [founder of the theatre company Punchdrunk] was working on that with me. And, yeah, he came down to King’s hospital to chat about Shakira in between contractions.”\n\nThe Weeknd performs before one of Devlin’s postapocalyptic sets. Photograph: courtesy of Es Devlin\n\nDevlin insists she has slowed down now: partly because of her children (she has two, a daughter Ry and son Ludo, with her husband Jack Galloway, a costume designer), and partly because of where we’re sitting. The family bought their house in 2016 and Devlin says she is especially besotted with the garden: it has a woodland feel with plants flowering over the spring and summer like “a slow-motion fireworks display”. The only indication that we’re not deep in the country are the gentle pock-pock of tennis balls from the club next door and a beep-beep-beep of train doors opening at a nearby station. Devlin says that when a new project comes in, she decides to take it based on whether it excites her enough to leave her children and her garden behind.\n\nDevlin’s design studio is based on the ground floor of her house in two soundproofed rooms. She usually has between eight and 10 employees, mainly women, including teachers from the Bartlett School of Architecture and the Royal College of Art, dotted between props and prototypes from previous projects. The studio is currently home to around 15 projects at different stages of development. Top of the list when we meet in July is the Pitzhanger commission, which has just opened. “They said to me, ‘Do whatever you want,’” she recalls. This, it turns out, is a dangerous thing to say to Devlin. She came back and said that she wanted to fill the gallery with a sprawling map. “But it’s not a map of the world in any recognisable way,” she clarifies. “It’s a map that charts, in my subjective opinion, each moment of major perspective shift in the course of our species.” She roars at the ridiculousness of what she’s saying. “So a minor ambition then.”\n\nSome background might be helpful here. When she was six, Devlin’s parents moved the family from Surbiton in west London to Rye on the south coast. “They went for a romantic weekend on the advice of my Auntie Pru and they bought a house, which was a really dumb thing to do because they hadn’t sold their other house,” Devlin says. “But anyway.” One of the landmarks of the town was a handmade, 1:100 scale model of Rye in Victorian times, complete with sound and light effects. The Story of Rye was made by a local couple – a retired teacher and an electrical engineer – and had a voiceover, Devlin recalls, recounting pertinent historical facts in “this terribly cheesy actor-y voice”.\n\nIf only by repeated exposure, Devlin became mildly obsessed with this model. So when Pitzhanger called, she wondered if she might do her take on it. Again, Devlin being Devlin, the stakes have been raised exponentially. Her tour of the major “perspective shifts” in history will start at the beginning of time and go through to today, finishing on the shores of Bangladesh with the tides rising. Along the way, there will be nods to cave paintings, the period of Confucius, the pyramids, Nicolaus Copernicus’s Frombork tower, the Enlightenment, the trenches of the second world war, the street where Rosa Parks took her seat on a bus, Cape Canaveral and Cern.\n\nAn artist’s impression of the ‘Poem Pavilion’ that Devlin will create for next year’s Dubai Expo. Photograph: Courtesy of Es Devlin\n\nThe work – which is not remotely complete when we meet – is, Devlin accepts, hard to explain. “I have demonstrated it with a quarter of a lemon and two mirrors, that might be the easiest way,” she muses. “The room is rectangular, so you are in this squashed elliptical. It’s effectively like being inside a rugby ball.” Devlin hopes that the room, which will be all white, will be a space for contemplation of where we’ve got to as a species and especially the damage we are inflicting on the planet. But it will also be an intriguing, unsettling experience to just stand in. “The curator, John Leslie, said, ‘Es, you do a lot of telling the story. This is an art gallery, you are coming in to make a sculpture, allow people to find it. And you’ll leave it open to so many more interpretations.’”\n\nAs for what’s next, Devlin knows what she’s doing until 2023. There’s Mendes and the Weeknd, she’s designing the UK Pavilion for Expo 2020 in Dubai, she is writing her own theatre piece and has projects with the choreographers Wayne McGregor and Akram Khan. It’s exhausting hearing Devlin just run through her to-do list – presumably she’s not taking on anything more, I ask. She smiles mischievously. “If the context is not inviting, I say no, which is a lot of the time. Or the context might be inviting, but my brain is full. So then I just say, ‘Let me go to sleep. Let me see if I wake up in the next few days with any way of doing it and I’ll tell you what it is.’”\n\nEs Devlin: Memory Palace runs at the Pitzhanger Gallery until 12 January 2020", "description": "From theatre sets to arena shows for Kanye West, the stage designer has waved her magic wand over them all. Now it’s her turn in the spotlight", "authors": ["Tim Lewis"], "top_image": "https://i.guim.co.uk/img/media/40a3dd47a58d9bd3f89992454cdae0d15d7c9028/0_456_7015_4208/master/7015.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8f2b7921213af6bcced21f585dc6be71", "published_at": "2019-09-29"}