{"pub": "metro", "url": "https://metro.co.uk/2019/10/08/love-islands-zara-mcdermott-compares-ariana-grande-ahead-x-factor-celebrity-10883685", "downloaded_at": "2019-10-08 15:54:29.221123+00:00", "title": "Love Island's Zara McDermott compares herself to Ariana Grande", "language": "en", "text": "We can’t wait for the proof… (Picture: Getty/Rex)\n\nLove Island star Zara McDermott has claimed to have a ‘similar tone’ to Ariana Grande, ahead of the launch of The X Factor: Celebrity.\n\nZara has joined Samira Mighty, Eyal Booker and Wes Nelson for the new supergroup who will be going up against the likes of Hayley Hasselhoff and Megan McKenna on Simon Cowell’s new talent show.\n\nFans have never heard Zara sing before so it’s a bold claim from the reality star but if she can reach those pitches that Ariana can reach, we’ll be very impressed.\n\nSpeaking to new! magazine, the former islanders also revealed that they’ve ‘all always had a passion for music’ and that the four of them were ‘singing all the time’ in the villa.\n\n‘Wes would sing in the shower. Him and Samira would harmonise and we’d all get involved,’ said Eyal.\n\nLove Island’s X Factor supergroup, Wes Nelson, Zara McDermott, Eyal Booker and Samira Mighty (Picture: PA)\n\nReality star Megan McKenna, Glee’s Kevin McHale, EastEnders’ Jonny Labey will all be competing in the Unders category, and the Overs is comprised of journalist Martin Bashir, actress Victoria Ekanoye and talk show host Ricki Lake.\n\nAdvertisement\n\nAdvertisement\n\nIn the groups will be a Love Island supergroup comprised of Wes Nelson, Samira Mighty, Eyal Booker and Zara McDermott.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nBen Foden, Thom Evans and Levi Davis will also be teaming up for a group, along with Brendan Cole and Jeremy Edwards.\n\nA new trailer for the show saw Simon, Nicole and Louis listening to the celebs do their thing in a luxury Hollywood venue.\n\nAmerican Idol judges Howie Mandel and Randy Jackson also make an appearance, and will no doubt be giving their opinion on our famous faces.\n\nThe X Factor Celebrity starts Saturday 12 October at 8.35pm.\n\nMORE: Doom Eternal delayed until March 2020, Doom 64 goes multiformat\n\nMORE: Geri Horner ‘encouraging Cheryl to date mature men’ after failed relationship with Liam Payne", "description": "Love Island's Zara McDermott will appear on The X Factor: Celebrity with a voice like Ariana Grande.", "authors": ["Rebecca Lewis"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/ariana-zara-7e1f_1570546846.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-08"}