{"pub": "thehill", "url": "https://thehill.com/homenews/house/466608-pelosi-arrives-in-jordan-with-bipartisan-congressional-delegation", "downloaded_at": "2019-10-20 03:31:48.898065+00:00", "title": "Pelosi arrives in Jordan with bipartisan congressional delegation", "language": "en", "text": "Speaker Nancy Pelosi Nancy PelosiCummings to lie in state at the Capitol House Republicans 'demand the release of the rules' on impeachment Overnight Health Care — Presented by National Taxpayers Union —Dem wants more changes to Pelosi drug pricing bill | Ebola outbreak wanes, but funding lags | Johnson & Johnson recalls batch of baby powder after asbestos traces found MORE (D-Calif.) arrived in Jordan on Saturday, where the House's top Democrat is leading a bipartisan delegation of lawmakers to meet with top Jordanian officials.\n\nA statement from the Speaker's office Saturday night confirmed that Pelosi and a number of lawmakers including Rep. Mac Thornberry William (Mac) McClellan ThornberryFurious Republicans prepare to rebuke Trump on Syria Five ways Trump's Syria decision spells trouble Cheney slated to introduce bill to place sanctions on Turkey MORE (R-Texas), a ranking member on the House Armed Services Committee and the delegation's lone Republican member, had met with officials at the U.S. embassy as well as the country's King Abdullah II and other top officials.\n\nADVERTISEMENT\n\n“Our bipartisan delegation is visiting Jordan at a critical time for the security and stability of the region,” Pelosi said in the statement. “With the deepening crisis in Syria after Turkey’s incursion, our delegation has engaged in vital discussions about the impact to regional stability, increased flow of refugees, and the dangerous opening that has been provided to ISIS, Iran and Russia.”\n\nDuring their meetings at the U.S. embassy, Pelosi and other lawmakers also thanked U.S. service members serving as part of a Marine detachment, according to the release.\n\nHer visit to Jordan comes just days after a showdown at the White House with President Trump Donald John TrumpFlorida GOP lawmaker says he's 'thinking' about impeachment Democrats introduce 'THUG Act' to block funding for G-7 at Trump resort Kurdish group PKK pens open letter rebuking Trump's comparison to ISIS MORE over his decision to withdraw of U.S. troops from northeastern Syria amid a Turkish offensive. A photo of the meeting quickly went viral in the hours after it was released with both Pelosi and Trump accusing one of other of \"melting down\" during the discussion.", "description": "Speaker Nancy Pelosi (D-Calif.) arrived in Jordan on Saturday, where the House's top Democrat is leading a bipartisan delegation of lawmakers to meet with top Jordanian officials.", "authors": [], "top_image": "https://thehill.com/sites/default/files/pelosinancy_101519gn3_lead.jpg", "published_at": "2019-10-20"}