{"pub": "independent", "url": "https://independent.co.uk/life-style/fashion/jennifer-lopez-versace-jungle-green-dress-milan-watch-video-donatella-a9119556.html", "downloaded_at": "2019-09-25 13:53:39.783643+00:00", "title": "Jennifer Lopez reveals how she recreated her iconic green Versace jungle dress", "language": "en", "text": "Jennifer Lopez sent fashion fans into a frenzy when she closed the Versace show during Milan Fashion Week in a remake of her iconic jungle green dress.\n\nNow, the actor is giving her supporters a chance to see how much work went into making the fashion moment even more memorable than the first with a 15-minute behind-the-scenes video.\n\nOn Tuesday, the \"I'm Real\" singer shared the clip to her YouTube channel with the title: “The Versace Dress: Then & Now. I Closed The Show!!!”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe video begins by following the actor as she meets with Donatella Versace to try on the dress for the very first time.\n\nThe pair discuss how they will introduce J.Lo’s appearance on the runway, with Versace revealing she will command Google to show her “the real jungle dress”, before the singer emerges.\n\nShape Created with Sketch. Jennifer Lopez's best fashion moments Show all 26 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Jennifer Lopez's best fashion moments 1/26 The singer attended the CFDA Fashion Awards at the Brooklyn Museum in June 2019 wearing a bright orange crop top and skirt by Ralph Lauren collection. The outfit reportedly had 43,200 crystals applied to the top, which added extra sparkle to the brightly-hued look. Getty Images 2/26 Lopez wore a sparkly backless silver gown by Versace, teamed with a bejewelled cap to the 'Camp: Notes on Fashion'-themed Met Gala in May 2019. Getty Images for The Met Museum/ 3/26 A futuristic blue and navy dress by Zuhair Murad was chosen for the 2019 Vanity Fair Oscar part in February. FilmMagic 4/26 Lopez posed with her fiance, Alex Rodriguez, at the 91st Academy Awards in February 2019 wearing a Tom Ford-sleeved silver dress. FilmMagic 5/26 For the Grammy Awards in February 2019, the trained dancer wore a white embellished Ralph and Russo dress. The look was styled with a white wide-brimmed hat. Getty Images 6/26 To promote her film Second Act in December 2018 in Miami, Lopez opted to wear a bright lime green-coloured midi dress with exaggerated shoulder detailing. Getty Images 7/26 The mother-of-two wore a hot pink tulle gown with a detachable train by Giambattista Valli to the premiere of her film Second Act in December 2018. Getty Images 8/26 The 'Get on the floor' crooner wore an oversized white shirt and thigh-high denim boots in New York City in July 2018. The look was styled with a mini black Birkin bag. BuzzFoto via Getty Images 9/26 The 'Jenny from the Block' singer wore a Balmain ecclesiastical-inspired dress to the 2018 Met Gala in May, which ran under the theme 'Heavenly Bodies: Fashion and the Catholic Imagination'. The outfit featured a feathered skirt and a high-leg slit. Getty Images 10/26 Lopez's embroidered nude-gold coloured Zuhair Murad gown dazzled at the TIME 100 Gala in April 2018. The outfit was styled with a pair if Jimmy Choo shoes and jewellery from Lorraine Schwartz. Getty Images for Time 11/26 The Guess campaign model wore a pale blue dress and matching fur wrap to the Guess Spring 2018 Campaign Reveal party in January 2018. Getty Images for Guess, Inc. 12/26 The Selena actor looked sophisticated in a black long-sleeved dress with an exaggerated slit to The Robin Hood Foundation's 2018 benefit in May. Getty Images for Robin Hood 13/26 This dusty pink-hued dress with a thigh-high slit and a plunging neckline stood out among the A-list attendees' looks at the 59th Grammy Awards in February 2017. WireImage 14/26 The singer looked ethereal in a light blue Valentino gown at the 'Rei Kawakubo/Comme des Garçons'-themed 2017 Met Gala. The singer, who teamed the look with a sheer cape, attended the event with her now fiance, Alex Rodriguez. WireImage 15/26 In April 2017, Lopez shocked onlookers with this black, long-sleeved Julien MacDonald gown with cutout and mesh detailing. The look was paired with a pair of black heels and a matching-coloured clutch bag. Getty Images 16/26 The 50-year-old star wore an off-the-shoulder Eli Saab Haute Couture light peach-coloured dress with knot detailing to a NBC Universal Upfront event in May 2017. Getty Images 17/26 The New Yorker walked the red carpet at the 2015 Billboard Music Awards in May that year wearing a white Charbel Zoe Couture gown with embroidery detailing that cascaded down onto the dress' train.. FilmMagic 18/26 For the 'China: Through The Looking Glass'-themed Met Gala in May 2015, the singer wore a one-shoulder Atelier Versace illusion gown. Getty Images 19/26 At the 87th Annual Academy Awards at the Hollywood & Highland Centre in February 2015. Lopez looked regal in this nude-coloured Elie Saab gown. Getty Images 20/26 The singer wore a bejeweled Charbel Zoe dress to the MTV Music Video Awards in August 2014. The look was styled with a pair of embellished silver-coloured heels and a matching clutch bag. Getty Images 21/26 A Marchesa gold-hued dress with a plunging neckline and train was the fashion choice du jour for Lopez at the 66th Annual Golden Globe Awards in January 2009. Getty Images 22/26 For the 75th Annual Academy Awards in March 2003, the budding actor wore a pale green off-the-shoulder Valentino gown with Harry Winston jewellery. Getty Images 23/26 For her wedding to dancer Cris Judd in September 2001, the fashion icon wore a Chantilly lace gown by Valentino. WireImage 24/26 The Annual Latin Grammy Awards in September 2000 provided the perfect opportunity for the singer to wear this baby pink-hued halterneck gown. Lopez attended the event with her then partner, Sean 'Puffy' Combs. Getty Images 25/26 Who can forget the moment when Lopez walked the red carpet at the 42nd Grammy Awards wearing this naval-plunging green Versace gown? Getty Images 26/26 At her 30th birthday party in July 1999, the star was photographed wearing a two-piece red outfit with matching heels. The LIFE Picture Collection via 1/26 The singer attended the CFDA Fashion Awards at the Brooklyn Museum in June 2019 wearing a bright orange crop top and skirt by Ralph Lauren collection. The outfit reportedly had 43,200 crystals applied to the top, which added extra sparkle to the brightly-hued look. Getty Images 2/26 Lopez wore a sparkly backless silver gown by Versace, teamed with a bejewelled cap to the 'Camp: Notes on Fashion'-themed Met Gala in May 2019. Getty Images for The Met Museum/ 3/26 A futuristic blue and navy dress by Zuhair Murad was chosen for the 2019 Vanity Fair Oscar part in February. FilmMagic 4/26 Lopez posed with her fiance, Alex Rodriguez, at the 91st Academy Awards in February 2019 wearing a Tom Ford-sleeved silver dress. FilmMagic 5/26 For the Grammy Awards in February 2019, the trained dancer wore a white embellished Ralph and Russo dress. The look was styled with a white wide-brimmed hat. Getty Images 6/26 To promote her film Second Act in December 2018 in Miami, Lopez opted to wear a bright lime green-coloured midi dress with exaggerated shoulder detailing. Getty Images 7/26 The mother-of-two wore a hot pink tulle gown with a detachable train by Giambattista Valli to the premiere of her film Second Act in December 2018. Getty Images 8/26 The 'Get on the floor' crooner wore an oversized white shirt and thigh-high denim boots in New York City in July 2018. The look was styled with a mini black Birkin bag. BuzzFoto via Getty Images 9/26 The 'Jenny from the Block' singer wore a Balmain ecclesiastical-inspired dress to the 2018 Met Gala in May, which ran under the theme 'Heavenly Bodies: Fashion and the Catholic Imagination'. The outfit featured a feathered skirt and a high-leg slit. Getty Images 10/26 Lopez's embroidered nude-gold coloured Zuhair Murad gown dazzled at the TIME 100 Gala in April 2018. The outfit was styled with a pair if Jimmy Choo shoes and jewellery from Lorraine Schwartz. Getty Images for Time 11/26 The Guess campaign model wore a pale blue dress and matching fur wrap to the Guess Spring 2018 Campaign Reveal party in January 2018. Getty Images for Guess, Inc. 12/26 The Selena actor looked sophisticated in a black long-sleeved dress with an exaggerated slit to The Robin Hood Foundation's 2018 benefit in May. Getty Images for Robin Hood 13/26 This dusty pink-hued dress with a thigh-high slit and a plunging neckline stood out among the A-list attendees' looks at the 59th Grammy Awards in February 2017. WireImage 14/26 The singer looked ethereal in a light blue Valentino gown at the 'Rei Kawakubo/Comme des Garçons'-themed 2017 Met Gala. The singer, who teamed the look with a sheer cape, attended the event with her now fiance, Alex Rodriguez. WireImage 15/26 In April 2017, Lopez shocked onlookers with this black, long-sleeved Julien MacDonald gown with cutout and mesh detailing. The look was paired with a pair of black heels and a matching-coloured clutch bag. Getty Images 16/26 The 50-year-old star wore an off-the-shoulder Eli Saab Haute Couture light peach-coloured dress with knot detailing to a NBC Universal Upfront event in May 2017. Getty Images 17/26 The New Yorker walked the red carpet at the 2015 Billboard Music Awards in May that year wearing a white Charbel Zoe Couture gown with embroidery detailing that cascaded down onto the dress' train.. FilmMagic 18/26 For the 'China: Through The Looking Glass'-themed Met Gala in May 2015, the singer wore a one-shoulder Atelier Versace illusion gown. Getty Images 19/26 At the 87th Annual Academy Awards at the Hollywood & Highland Centre in February 2015. Lopez looked regal in this nude-coloured Elie Saab gown. Getty Images 20/26 The singer wore a bejeweled Charbel Zoe dress to the MTV Music Video Awards in August 2014. The look was styled with a pair of embellished silver-coloured heels and a matching clutch bag. Getty Images 21/26 A Marchesa gold-hued dress with a plunging neckline and train was the fashion choice du jour for Lopez at the 66th Annual Golden Globe Awards in January 2009. Getty Images 22/26 For the 75th Annual Academy Awards in March 2003, the budding actor wore a pale green off-the-shoulder Valentino gown with Harry Winston jewellery. Getty Images 23/26 For her wedding to dancer Cris Judd in September 2001, the fashion icon wore a Chantilly lace gown by Valentino. WireImage 24/26 The Annual Latin Grammy Awards in September 2000 provided the perfect opportunity for the singer to wear this baby pink-hued halterneck gown. Lopez attended the event with her then partner, Sean 'Puffy' Combs. Getty Images 25/26 Who can forget the moment when Lopez walked the red carpet at the 42nd Grammy Awards wearing this naval-plunging green Versace gown? Getty Images 26/26 At her 30th birthday party in July 1999, the star was photographed wearing a two-piece red outfit with matching heels. The LIFE Picture Collection via\n\n“I love drama”, Versace says to Lopez, before telling her the moment is “going to be massive”.\n\nThe camera then follows Lopez as she tries on the gown, instructing seamstresses to make the back lower and the bodice tighter, stating: “We want it to stay as chic as the first dress”.\n\nOn the day of the show, Lopez gets her hair and makeup done in her hotel room before making her way to the show venue where she is greeted by Versace who says: “I can’t stop looking at you”.\n\nLater, the actor is joined by American Vogue editor Anna Wintour who congratulates Lopez on her “amazing success” and admits she “can’t wait” to see her latest movie, Hustlers.\n\nAfter slipping into the iconic dress and undergoing last-minute touch ups, Lopez prepares to take the stage but not before speaking to her fans via an Instagram Live.\n\n“Twenty years ago I wore a certain dress and it kind of made a little bit of a splash at that time,” Lopez says.\n\n“Right now, we’re about to have another moment at Milan Fashion Week. That’s all I’m gonna say.”\n\nThe video then cuts to out-takes of the catwalk show, showing every single person on the front row standing to their feet as Lopez stormed the runway in a bid to capture the moment on their phones.\n\nAfter the show, Lopez ventured backstage to applause where she was joined by Versace and models including Kaia Gerber, Kendall Jenner and Bella Hadid.\n\nThe lengthy video concludes with Lopez dancing the night away at the Versace after party in a long-sleeved mini dress from the spring/summer 2020 collection alongside the designer and Gigi Hadid.\n\nLopez first wore the green jungle dress to the Grammy Awards in 2000, a move that inspired the creation of Google Images.\n\nIn 2015, former Google CEO and executive chairman Eric Schmidt wrote an essay on Project Syndicate explaining how the singer’s dress inspired the invention.\n\n“People wanted more than just text,” he wrote. “This first became apparent after the 2000 Grammy Awards, where Jennifer Lopez wore a green dress that, well, caught the world’s attention.\n\n“At the time, it was the most popular search query we had ever seen. But we had no surefire way of getting users exactly what they wanted: J-Lo wearing that dress. Google Image Search was born.\"", "description": "Jennifer Lopez sent fashion fans into a frenzy when she closed the Versace show during Milan Fashion Week in a remake of her iconic jungle green dress. Now, the actor is giving her supporters a chance to see how much work went into making the fashion moment even more memorable than the first with a 15-minute behind-the-scenes video.", "authors": ["Sarah Young"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/21/09/gettyimages-1169905140.jpg", "published_at": "2019-09-25"}