{"pub": "yahoo", "url": "https://news.yahoo.com/1-trump-administration-blocks-u-131045610.html", "downloaded_at": "2019-10-09 07:12:13.184668+00:00", "title": "UPDATE 7-White House says it will refuse to cooperate with impeachment inquiry", "language": "en", "text": "* Trump derides impeachment probe as 'a kangaroo court'\n\n* Sondland 'stands ready to testify,' his lawyer says\n\n* Pelosi: Blocking witnesses is evidence of obstruction (Updates with letter)\n\nBy Richard Cowan and David Morgan\n\nWASHINGTON, Oct 8 (Reuters) - The White House said on Tuesday it would refuse to cooperate with a \"baseless, unconstitutional\" congressional impeachment inquiry, setting Republican President Donald Trump on a collision course with the Democratic-led U.S. House of Representatives.\n\n\"Your unprecedented actions have left the president with no choice,\" lawyer Pat Cipollone said in a letter to Democratic House leaders. \"In order to fulfill his duties to the American people, the Constitution, the Executive Branch and all future occupants of the Office of the Presidency, President Trump and his administration cannot participate in your partisan and unconstitutional inquiry under these circumstances.\"\n\nThe letter came shortly after the Trump administration on Tuesday abruptly blocked a key witness in the Ukraine scandal from appearing before a congressional impeachment inquiry.\n\nThe U.S. State Department said the U.S. ambassador to the European Union, Gordon Sondland, a Trump political donor, would not be allowed to appear, even though he had already flown from Europe to do so. Trump decried the Democratic-led inquiry into whether he abused his office in the pursuit of personal political gain as a \"kangaroo court.\"\n\nDemocratic lawmakers denounced the move, calling it an attempt to obstruct their inquiry and said they would subpoena Sondland, to compel him to submit to questions. The State Department did not respond to requests for comment on why Sondland had been blocked from speaking to lawmakers just hours before his scheduled appearance.\n\nThe move was the White House's most aggressive response yet to the inquiry, which has cast a pall over Trump's campaign to win back the White House in 2020. A whistleblower complaint about a July 25 phone call in which Trump pressed his Ukrainian counterpart, Volodymyr Zelenskiy, to investigate his political rival, former Vice President Joe Biden, prompted the inquiry.\n\nThe investigation could lead to the approval of articles of impeachment - or formal charges - against Trump in the House of Representatives. A trial on whether to remove him from office would then be held in the U.S. Senate. Republicans who control the Senate have shown little appetite for ousting Trump.\n\n(Reporting by Richard Coawn and David Morgan, additional reporting by Patricia Zengerle, Makini Brice, Lisa Lambert, Mark Hosenball in Washington and Karen Freifeld in New York; Writing by Doina Chiacu; Editing by Cynthia Osterman and Peter Cooney)", "description": "The White House said on Tuesday it would refuse to cooperate with a \"baseless, unconstitutional\" congressional impeachment inquiry, setting Republican President Donald Trump on a collision course with the Democratic-led U.S. House of Representatives.  \"Your unprecedented actions have left", "authors": ["Richard Cowan", "David Morgan"], "top_image": "https://s.yimg.com/uu/api/res/1.2/CoBYK8na05m3AKEx2haElA--~B/aD0zNjQ4O3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://s.yimg.com/os/creatr-images/2019-10/f6b83140-e9f0-11e9-bffd-8b6a004dbfa4", "published_at": "2019-10-08"}