{"pub": "businessinsider", "url": "https://businesstimes.com.sg/stocks/singapore-shares-slump-14-after-us-manufacturing-data-shock ", "downloaded_at": "2019-10-02 12:51:05.767194+00:00", "published_at": "2019-10-02", "title": "Singapore shares slump 1.4% after US manufacturing data shock", "language": "en", "text": "TWO sessions into the month and market sentiment has already greatly whipsawed, with the local benchmark more than erasing Monday's gains as investors were jolted by US recession fears after August factory activity hit levels not seen since June 2009.\n\nThe impact of protests in Hong Kong, which are becoming increasingly violent with a protestor shot by police on Tuesday, also weighed on sentiment.\n\nSingapore's Straits Times Index (STI) closed at 3,103.45, tumbling 42.58 points or 1.4 per cent.\n\nIt was very much the same picture in other Asia-Pacific markets. Australia, Hong Kong, Japan, Malaysia and South Korea all closed lower. Markets in China remain closed for the Golden Week celebrations and will resume trading only on Oct 8.\n\nsentifi.com Market voices on:\n\nWhile Singapore equities were a sea of red, liquidity in the market remained relatively low. Trading volume on Wednesday clocked in at 917.35 million securities. Total turnover came to S$1.04 billion. Decliners trumped advancers 277 to 118.\n\nYangzijiang Shipbuilding was the STI's most active counter with 84.6 million shares traded. It closed down six Singapore cents or 6 per cent at S$0.94.\n\nThe banking trio were among the benchmark's main laggards. DBS Group Holdings dropped S$0.47 or 1.9 per cent at S$24.77, OCBC Bank fell S$0.22 or 2 per cent at S$10.77 while United Overseas Bank finished at S$25.48, shedding S$0.42 or 1.6 per cent.", "description": ": THE BUSINESS TIMES Stocks - TWO sessions into the month and market sentiment has already greatly whipsawed, with the local benchmark more than erasing Monday's gains as investors were jolted by US recession fears after August factory activity hit levels not seen since June 2009. . Read more at The Business Times.", "authors": ["Navin Sregantan"], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png"}