{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7618699/Lizzie-Cundy-51-puts-stylish-display-amid-Danny-Cipriani-drama.html", "downloaded_at": "2019-10-28 00:36:07.571963+00:00", "title": "Lizzie Cundy, 51, puts on stylish display amid Danny Cipriani drama", "language": "en", "text": "She claimed to have enjoyed a fling with rugby star Danny Cipriani before the hunk began suing her book publishers over revelations about their alleged sex life.\n\nBut Lizzie Cundy put her troubles behind her on Saturday by spending the evening at the newly opened Cha Cha Mayfair cocktail and seafood bar.\n\nThe former WAG, 51, posed in a racy pair of bright pink leggings which she paired with a frilled off the shoulder top.\n\nNew leaf: Lizzie Cundy, 51, put her romantic troubles behind her on Saturday by spending the evening at the newly opened Cha Cha Mayfair cocktail and seafood bar\n\nLizzie added to her funky look with a stunning pair of knee-high heeled boots which sparkled with rows of sequins.\n\nThe star enjoyed a drink at the new venue before she posed in naughtily at the bar by standing one leg.\n\nIn another snap she sat beaming with her legs crossed and her caramel flecked tresses worn in soft waves.\n\nThe beauty's latest outing comes after her relationship with nightclub boss Jeremy Gordeno ended.\n\nGood combination: The former WAG posed in a racy pair of bright pink leggings which she paired with a frilled off the shoulder top\n\nStanding out: Lizzie added to her funky look with a stunning pair of knee-high heeled boots which sparkled with rows of sequins\n\nA catch: In another snap she sat beaming with her legs crossed and her caramel flecked tresses worn in soft waves\n\nJeremy had been spending an increasing amount of time with mother-of-one Francesca Hodge, who is 32 years his junior and the daughter of his former fiancée.\n\nPictures emerged of Francesca sitting on the millionaire nightclub boss's lap in a bar, which have angered Francesca's mother, Candice Hodge.\n\nGordeno was seeing Candice, 39, for two years before he began a relationship with former WAG Ms Cundy earlier this year.\n\nHe reflected on the end of his 10-month relationship in a statement after he was dumped by Lizzie, saying that said events outside of his control put the relationship under huge strain.\n\nSplitsville: The beauty's latest outing comes after her relationship with nightclub boss Jeremy Gordeno ended (The pair pictured in September)\n\nBut Candice told MailOnline that the real reason the relationship ended was because she has struck up a closeness with Francesca.\n\nIn the statement Gordeno praised Lizzie calling her 'fun and beautiful Lizzie'.\n\n'I will always be very fond of Lizzie,' he said. 'But events outside our control put our relationship under huge strain. I have come to realise it's best we stay just friends.'\n\nHowever Lizzie who was previously married to footballer Jason Cundy, insisted she had dumped him when she told MailOnline: 'I ended it. I want nothing more to do with him. I'm shocked and horrified by recent events'.\n\nAnd Lizzie recently appeared on the Jeremy Vine Show to discuss the news that rugby player Danny, 31, is suing the publishers of her book, Tales From The Red Carpet.\n\nDefiant: Lizzie recently appeared on the Jeremy Vine Show to discuss the news that rugby player Danny Cipriani, 31, is suing the publishers of her book, Tales From The Red Carpet\n\nLizzie said: 'Well I was very nice [about him]. I thought I was very complimentary, I mean, I gave him a nine out of 10.'\n\nThe men on the show said if Lizzie had said those words about them, they would be sending her bouquets of flowers, not trying to sue and she agreed.\n\nShe said: 'It has been bit of a tough week, but I am here, and strong. I am OK. I'm smiling.'\n\nTaking to Instagram soon after the show, she shared a snap of her outfit and wrote: 'Loving the @jeremyvineon5 show today . Feisty debates..... and no I won’t be gagged!'\n\nResponse: Danny's lawyers have stated that he did not give his consent for the material to be published and is now demanding up to £50,000 worth of damages from Lizzie's publishers\n\nIn Lizzie's book’s second chapter, The Romeo of Richmond, she rated her saucy romp with the rugby star as 'nine out of ten on the naughty scale' and also claimed that he gave her 'the greatest kiss of all time.'\n\nHowever, despite the praise, Danny's lawyers have stated that he did not give his consent for the material to be published and is now demanding up to £50,000 worth of damages from Lizzie's book publishers.\n\nIn paperwork filed at the High Court in London, Danny's lawyer's Clintons have now filed for a gagging order against Lizzie's publishers, Soho Friday Media, stating that the book breaches his right to privacy and data protection rules.\n\nDetailing the romance from 2010, the brunette wrote in her book:\n\nLizzie said: 'Well I was very nice [about him]. I thought I was very complimentary, I mean, I gave him a nine out of 10'\n\n'I remember thinking I had never ever been kissed like that in my entire life, and in that first initial moment, I realised what I had been missing all those years.'\n\nIn response to the legal action, Soho Friday Media offered the statement: 'Lizzie was extremely nice and complimentary about Danny and is surprised at his reaction as she only told the half of it. We are now dealing with it with our lawyers.'\n\nLizzie has now told MailOnline: 'I was surprised to hear Danny wants to sue my publishers for saying he was good in bed. I was very complimentary and kind in my book about Danny. We had great chemistry.\n\nIt's her life: Lizzie later shared this picture of herself on Instagram and wrote that she 'won't be gagged' as it's her story to tell", "description": "The former WAG, 51, posed in a racy pair of bright pink leggings which she paired with a frilled off the shoulder top.", "authors": ["Harry Howard For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/13/20244396-0-image-a-87_1572182530228.jpg", "published_at": "2019-10-27"}