{"pub": "huffpost", "url": "https://huffpost.com/entry/g7-doral-andrew-napolitano-emoluments-violation-trump_n_5da9057fe4b04c4d24e9a6d5", "downloaded_at": "2019-10-18 02:03:27.523059+00:00", "title": "Fox News' Andrew Napolitano: Hosting G-7 At Trump Resort Is 'Profound' Emoluments Breach", "language": "en", "text": "Fox News legal analyst Judge Andrew Napolitano criticized President Donald Trump’s decision to host the next Group of Seven summit at his own golf resort in Miami as a “direct and profound” violation of the emoluments clause of the Constitution.\n\nTrump has “bought himself an enormous headache now” with his choice for next year’s summit, Napolitano explained Thursday on Fox Business. “This is about as direct and profound a violation of the emoluments clause as one could create.”\n\nThe emoluments clause of the Constitution prohibits federal officeholders from receiving gifts or payments from foreign governments. It’s designed to prevent the president from being influenced by gifts or cash from foreign entities. The Doral setup is “exactly what the emoluments clause was written to prohibit,” Napolitano said.\n\nActing White House chief of staff Mick Mulvaney announced the decision Thursday. He told reporters during a press briefing that the Trump National Doral is the “best place” to host the summit and dismissed concerns that the president would personally profit from the choice of venue. Mulvaney said there’s “no issue of him profiting on this in any way, shape or form,” because the event will be provided “at cost,” which would be determined by Trump’s golf resort. Critics point out that the business also will greatly benefit financially from the worldwide exposure such an event would bring.\n\nIn any case, the Constitution “does not address profits,” Napolitano noted.\n\n“It addresses any present, as in a gift, any emolument, as in cash, of any kind whatever — I’m quoting the emoluments clause — from any king, prince or foreign state,” he emphasized.\n\nHouse Judiciary Chairman Jerry Nadler (D-N.Y.) called the decision among the most “brazen examples yet of the president’s corruption. He is exploiting his office and making official U.S. government decisions for his personal financial gain.”\n\nCheck out what else Napolitano had to say in the video up top.", "description": "This is \"exactly what the emoluments clause was written to prohibit,\" the legal analyst said on Fox Business.", "authors": ["Trends Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5da914e02100000e15ad323c.png?cache=rsv4diuuix&ops=1778_1000", "published_at": "2019-10-18"}