{"pub": "fox", "url": "https://foxnews.com/sports/women-are-having-a-greater-impact-on-nba-than-ever-before", "downloaded_at": "2019-10-17 10:32:49.475019+00:00", "title": "Women are having a greater impact on NBA than ever before", "language": "en", "text": "Practice is over and Boston Celtics assistant coach Kara Lawson is still working.\n\nShe stands under the basket rebounding and giving feedback to rookie guard Carsen Edwards as he shoots from different spots on the court. After swishing his final three attempts he jogs over to her.\n\n\"Thanks, coach,\" Edwards says before exchanging a high-five with Lawson.\n\nWelcome to the new-look NBA, in which women's footprints are directly impacting every aspect of the game — from broadcasting booths, to officiating, coaching on the sidelines, front-office executives to ownership.\n\nLawson is one of a record 11 women serving as assistant coaches in the NBA this season. While former WNBA star Swin Cash and Sue Bird are working in NBA front offices.\n\n\"It's not a fad,\" said Basketball Hall of Famer Nancy Lieberman. \"It's opportunities going to very accomplished women who have given their life to the game.\"\n\nWhile it may not be a fad, it is a recent trend.\n\nLieberman remembers a time when the presence of women was hard to spot, or at best found only behind the scenes.\n\nThe 61-year-old — who has broken barriers as a player, as a coach in the WNBA, head coach in NBA G League and in the NBA as assistant — learned quickly that building relationships was the skeleton key to erasing gender hurdles and opening opportunities in the league. That, along with an occasional assist from forward thinking men like former coach Don Nelson, who in 2009 hired her as the head coach of the Texas Legends, the Dallas Mavericks' G League affiliate.\n\nSeveral have continued Nelson's vision, including San Antonio Spurs Greg Popovich, who made Becky Hammon the NBA's first full-time assistant in 2014; current Mavericks' coach Rick Carlisle (he hired Jenny Boucek as assistant in 2017) and the Sacramento Kings organization, which has been responsible for hiring three women as assistants (Lieberman, Boucek and Lindsay Harding). Even the BIG3, spearheaded by founder and entertainer Ice Cube, is helping normalize the idea of women leading men, Lieberman said.\n\n\"I remember Donnie did an interview and he said, 'Maybe the best man for the job isn't a man at all.' He had a list of criteria he wanted to hit for his head coach. And I hit those,\" Lieberman said.\n\nThe women who have broken into the NBA ranks are garnering respect from players for their experience and basketball knowledge.\n\nCeltics guard Gordon Hayward said Lawson has already made her presence felt.\n\n\"She's been good as far as just the experience she has as a basketball player,\" Hayward said. \"Reading the game and kind of little things she sees coaching on the sideline. Having somebody that well-versed in basketball, that experience is good.\"\n\nEarlier this month, Wizards assistant Kristi Toliver was on the court helping the Mystics win their first WNBA championship. On the sideline, Washington NBA All-Stars John Wall and Bradley Beal were wearing the Wizard assistant's WNBA jersey and dancing from the stands .\n\nNBA players are treating the feedback from Toliver and the other women in the league with the same reverence they give their male counterparts.\n\n\"The biggest thing I learned is to share your voice and what you've learned,\" Toliver said. \"Doing that has helped me communicate with my guys.\"\n\nToliver is in a unique salary situation since she coaches for the Washington Wizards and plays for the Washington Mystics — both owned by same franchise. She was only paid about $10,000 with the Wizards last year because of WNBA salary cap rules. WNBA teams can only pay all their players a combined $50,000 in offseason to supplement pay and Washington only had $10,000 left to pay Toliver.\n\nThere are no such hiccups in New Orleans, where Pelicans guard Frank Jackson said he always expected to benefit from Cash and Teresa Weatherspoon, who was hired as a New Orleans assistant this season.\n\n\"They were ballers,\" Jackson said. \"They were good at their craft and I've taken a lot from both of them. ... I've always had open eyes and open ears to anyone who plays this game.\"\n\nThe 21-year-old Jackson knows of the women's exploits because he has witnessed it firsthand. And he is not alone. The WNBA has been around since most players were teenagers, and is older than others; the league was launched in 1996.\n\n\"As the years go on, they're going to get more and more recognition,\" said Jackson, in his third year out of Duke. \"Girls can hoop, too. ... I just think as times change, you'll see more and more.\"\n\nCash believes the NBA is realizing having more women is important to growing the league's overall brand, business and bottom line.\n\n\"The reality is and the statistics prove it, is that having women included in your business helps you get more inclusion, helps you get the diversity you need,\" she said. \"Diversity of thought, not just Black, White, Asian, Latino, whatever.\"\n\nStephanie Ready, a former assistant in the then D-League, said a big factor in the opportunities women are getting are coming because the younger generation of NBA executives, such as 76ers general manager Elton Brand. She said the new crop of hiring managers are doing a better job of recognizing what women bring to the table and as the older generation retires, it will get even better.\n\n\"Some people will age out,\" said Ready, one of the first women to be a men's assistant on the collegiate level with Coppin State and a former broadcaster with the Charlotte Hornets who now currently covers the NBA for TNT and Yahoo. \"By that I mean the old regime of men who thought that only men could do these jobs.\"\n\nRichard Lapchick, who tracks racial and gender hiring numbers for the NBA, NFL, NHL and MLB, has long lauded the NBA as being the leader in gender hiring practices. He credits the leadership of Commissioner Adam Silver, who said the league needed to increase the number women coaches and referees in the NBA.\n\nAlong with the record number of female assistants, five women referees will be working NBA games this upcoming season.\n\nLapchick also believes the NBA will soon have its female head coach. Whether that is Hammon in San Antonio remains to be seen. But whoever it is, Lapchick said the move would go a long way in putting even more women in position to make basketball decisions.\n\n\"I'd be surprised if it doesn't happen before the next season,\" he said, \"or during the next season.\"", "description": "Practice is over and Boston Celtics assistant coach Kara Lawson is still working.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/NBA-Kara-Lawson.jpg", "published_at": "2019-10-17"}