{"pub": "dailybeast", "url": "https://washingtonpost.com/nation/2019/01/29/roger-stone-wanted-wikileaks-email-dump-distract-access-hollywood-tape-associate-claims", "downloaded_at": "2019-10-26 11:18:22.589984+00:00", "title": "Roger Stone wanted WikiLeaks dump to distract from ‘Access Hollywood’ tape, Mueller witness says", "language": "en", "text": "The striking simultaneity fulfilled the hope of Trump confidant Roger Stone, according to Jerome Corsi, a conservative author and former Stone associate who was subpoenaed over the summer for questioning by special counsel Robert S. Mueller III.\n\n“I had one call from Roger, as I recall it — Roger disputes this — on the day that WikiLeaks did begin in October dropping the final emails on John Podesta, in which Roger was essentially saying, ‘We’ve got this timing issue because the Billy Bush tape is going to be released, and we’d like to have Assange begin releasing emails now,’” Corsi told MSNBC’s Ari Melber on Monday. Bush was the “Access Hollywood” anchor who appeared with Trump in the clip from 2005, in which the host of “The Apprentice” describes using his stardom to grope and kiss women.\n\nAD\n\nAD\n\nStone was indicted Friday, accused by the special counsel of lying to Congress about his quest for information about WikiLeaks’ plans to release information damaging to the Democratic candidate. According to the indictment, Stone was assigned this quest by “senior Trump Campaign officials.” And he allegedly enlisted two friends and intermediaries in the effort, including Corsi, identified in the indictment as “Person 1.”\n\nWhether Stone had a hand in the advantageous timing, by influencing the dissemination of the purloined emails, could help investigators answer the question of why he, and others in Trump’s orbit, allegedly lied in responding to congressional queries about possible collusion between the Republican campaign and Russian officials who interfered in the race. When asked by Melber why Stone lied, Corsi said, “I failed to take the mind-reading course at Harvard. You’ll have to ask Roger.”\n\nStone has repeatedly denied conspiring with WikiLeaks, asking Friday on CNN, “Where is the WikiLeaks collaboration?”\n\nAD\n\nAD\n\nCorsi acknowledged that he could not “prove” that the longtime Republican operative and self-described “dirty trickster” had taken steps to influence the timing of the email dump. Instead, he merely shared his recollection of their phone conversation, which he also recounts in his book, “Silent No More: How I Became a Political Prisoner of Mueller’s ‘Witch Hunt.’” In the 192-page book, Corsi writes that Stone asked him to see if he “could get Assange to begin dropping the Podesta emails on top of the Washington Post exposé.”\n\nCorsi said that he did not have a good mechanism for doing so, but that he made some halfhearted attempts, including issuing “some tweets.”\n\nResponding to the book’s claims in November, Stone told the Daily Caller that the allegations were “preposterous.” On Instagram this month, he labeled Corsi a “pathological liar,” also identifying him as “Judas,” a disciple of Jesus who, in the telling of the Gospels, betrayed him.\n\nAD\n\nAD\n\nA best-selling author who boasts a PhD in political science from Harvard, Corsi is a prolific conspiracy theorist. On his YouTube channel, in appearances on Fox News Channel and in his many published books, he has peddled hateful falsehoods, doubting the veracity of official accounts of the attacks of Sept. 11, 2001, and denying that President Barack Obama was born in the United States.\n\nDespite his well-documented tendency to take liberties with the truth, Corsi does have demonstrable links to figures in Trump’s inner circle, including to Stone. Moreover, he had an audience with the special counsel. Corsi’s stepson, Andrew Stettner, also received a subpoena to testify, and the action was seen as a sign that Mueller is keenly focused on the right-wing gadfly, whose causes — from the “birther” movement to conspiracies about the “deep state” — are also Trump’s.\n\nCorsi said he gave 40 hours of testimony to Mueller’s team and on Sunday told CNN’s Jake Tapper that he would be “happy to testify” against Stone.\n\nAD\n\nAD\n\n“I will affirm that what is in the indictment about me is accurate,” Corsi said. There is at least one piece of evidence, however, that he maintains is inaccurate — one that he wrote. He has disclaimed any direct ties to WikiLeaks, contradicting an August 2016 email cited in the indictment in which he appeared to alert Stone to Assange’s plans for “2 more dumps,” which promised to be “very damaging.”\n\nCorsi told MSNBC that Mueller “was convinced” of his link to Assange, who is residing under asylum at the Ecuadoran Embassy in London. After 20 hours spent detailing all possible contacts tying him to the WikiLeaks founder, Corsi claimed, “We couldn’t find anyone. I certainly couldn’t find anyone.”\n\nHe said that he had told Mueller’s team about his recollections of the phone call concerning the timing of the “Access Hollywood” tape.\n\nAD\n\nAD\n\nAsked whether the special counsel was interested, Corsi said, “Absolutely.”\n\nIn a tweet the day before the WikiLeaks dump, Stone previewed the coming threat to Clinton’s campaign. His Twitter account has since been suspended.\n\n\"Julian Assange will deliver a devastating expose on Hillary at a time of his choosing,” he wrote on Oct. 6, 2016. “I stand by my prediction. #handcuffs4hillary”\n\nSpeaking to Fox News host Sean Hannity on Monday, Stone accused prosecutors of “trying to criminalize legitimate political inquiry.” He noted that he had not been charged with conspiracy, observing, “If they could have made that case, they would have.”\n\nHe also predicted that Mueller would conclude by accusing both the president and the vice president of collusion. “That way they can make Nancy Pelosi president. She can make Hillary Clinton vice president.” He called this scenario a “nightmare.”\n\nStone also vowed not to turn on the president.\n\n“I am not going to testify against him because I possess no negative information,” he said. “There is no Russian collusion. This is a witch hunt.”\n\nAD", "description": "Jerome Corsi said he has told the special counsel about a conversation with Stone in which the Trump confidant, who was indicted on Friday, expressed his desire for the release of emails damaging to Hillary Clinton to coincide with the publication of the videotape showing Trump bragging about sexual assault.", "authors": ["Isaac Stanley-Becker", "National Political Reporter"], "top_image": "https://www.washingtonpost.com/resizer/xemK8RslZfgd4eog8KeNICYJe1s=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RPE4OMRDIMI6TNNUDUMN7N5QQQ.jpg", "published_at": "2019-01-29"}