{"pub": "zdnet", "url": "https://www.zdnet.com/article/use-less-cellular-and-wi-fi-data-with-ios-13s-low-data-mode", "downloaded_at": "2019-10-09 18:40:04.306493+00:00", "title": "Use less cellular and Wi-Fi data with iOS 13's Low Data Mode", "language": "en", "text": "Not everyone has an unlimited data plan, and the combination of 4G networks, fast Wi-Fi, and modern smartphones can burn through data at quite an astounding rate. But iOS 13 has a feature to help reduce the amount of data you use.\n\nIf you can find it.\n\nMust read: iOS 13: Security and privacy settings you need to tweak and check\n\nThe feature is called Low Data Mode, and similar to how Low Power Mode works for the battery, this is a tweak to get you out of a jam, as opposed to something you use all the time.\n\nFirst, here's where it is. For cellular data go to:\n\nSettings > Cellular > Cellular Data Options and activate Low Data Mode\n\nFor Wi-Fi connections, this is a per-connection setting, and to activate this feature go to:\n\nSettings > Wi-Fi > click on the \"I\" next to the connection you want to limit and flip the toggle on Low Data Mode\n\nSo, what are the implications of activating Low Data Mode?\n\nWhen this setting is switched on, iOS will turn off Background App Refresh for apps (similar to Low Power Mode) and will no longer download apps and music in the background, FaceTime will lower the audio and video quality, and any media streamed using Apple apps will be degraded.\n\nThird-party apps will be unaffected, except for Background App Refresh being disabled.\n\nI've also found that this is a great way to slow down battery usage when I'm somewhere with poor signal strength.\n\nOn, and you have to remember to deactivate this when you no longer need it (so make a mental note of where the setting lives so you can find your way back to it).\n\nSee also:", "description": "Don't have an unlimited data or internet plan and finding that your iPhone or iPad is burning through data too fast? Paying for Wi-Fi by the megabyte? Are you coming to the end of your cellphone billing cycle and running out of data? iOS 13's Low Data Mode will help you out.", "authors": ["Adrian Kingsley-Hughes"], "top_image": "https://zdnet3.cbsistatic.com/hub/i/r/2019/10/09/22cea0ad-e2ef-4bbf-bf97-98973e2ad5c8/thumbnail/770x578/1ce89c08eb4995f2ec572b4f5872359c/img-2688x.jpg", "published_at": "2019-10-09"}