{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7533415/Expert-reveals-youve-eating-cheese-wrong.html", "downloaded_at": "2019-10-05 12:46:18.001691+00:00", "title": "Expert reveals why you've been eating cheese all wrong", "language": "en", "text": "The chilly months are all about good, hearty meals - but you could be ruining some of your favourite dishes before you've even started by preparing your cheese all wrong.\n\nFrom eating it straight out of the fridge to making it sweat in cling film, UK-based Edward Hancock, founder of online British brand The Cheese Geek, has revealed how foodies are decreasing the quality of the popular dairy snack.\n\n'An incredible amount of craftsmanship has gone into every single piece of cheese we eat, creating the most wonderful, balanced environment for flavour creation,' he explained.\n\n'For the consumer, our only responsibility is to store the cheese well, and eat it quickly.'\n\nSpeaking exclusively to FEMAIL, the expert has unveiled his top tips for ensuring your cheese tastes its best...\n\nEdward Hancock, founder of online British brand The Cheese Geek, from the UK, has explained why you could have been eating your cheese all wrong\n\nNEVER KEEP IN A PLASTIC WRAP\n\nFor cheese-lovers, it is imperative that their delicious dairy treat tastes its best for as long as possible.\n\nBut a big mistake is to preserve your cheese by keeping it in a plastic wrap like cling film - unless you constantly refresh the wrapping.\n\n'The key issue with storing cheese is the balance between it \"drying out\" or \"sweating,\" said The Cheese Geek founder.\n\n'If the cheese dries out, it will lose its flavour, texture and character, but if it sweats, it will be more prone to unwanted mold growth, and development of unsavoury flavours and smells.\n\n'Cheesemongers will often use cling film for display cheese, as they will refresh it regularly, allowing it to breathe.\n\nEdward's top tips 1. Never keep in a plastic wrap 2. Don't eat straight from the fridge 3. Keep the rind 4. Avoid freezing 5. Steer clear of grated cheese 6. Only buy what you can eat 7. Use different knives for different cheeses\n\n'They will also usually shave the face of the cheese that has been exposed to the cling film off, as it can affect the flavour.\n\n'But ultimately, cling film is not an ideal wrapping option - unless you are going to constantly refresh it.'\n\nHe added: 'A far better option is specifically designed cheese wrap or even beeswax wrap for the environmentally conscious.\n\n'This is designed with a wax membrane on the inside that allows the cheese to breathe, and does allow some moisture to escape.'\n\nDON'T EAT STRAIGHT FROM THE FRIDGE\n\n'Whatever you store your cheese in, it is crucial to allow it to get to room temperature before serving,' said Edward.\n\n'You should allow the cheese to breathe for around 15 to 30 minutes so that the full flavour is released.\n\n'Cheese is a living, breathing thing, and all that flavour goes into stasis in the fridge.'\n\nHe continued: 'When storing cheese in the fridge, it is always preferable to use the salad drawer or an enclosed compartment, as it will be less dry than the rest of the fridge, and probably less cold as well!'\n\nAVOID FREEZING\n\nSome foodies suggest freezing the dairy product to preserve it for longer - and while this might be true, it can also affect the taste.\n\nEdward revealed that a big mistake is to preserve your cheese by keeping it in cling film - unless you constantly refresh the wrapping. Pictured, stock image\n\n'Unless you are talking about cheap grated cheddar for a cheese toastie, freezing is an absolute no-no,' explained Edward.\n\n'Soft and moist cheeses will be ruined, and hard ones may physically appear fine, but they will have been robbed of all their delicious complexity and flavour.'\n\nKEEP THE RIND\n\nRinds - which are the outside shell on cheeses that form during the cheese-making process - should be kept on when possible.\n\n'The rind protects the cheese, and so should never be removed apart from when eating,' said Edward.\n\n'Once a cheese is cut, it will very slowly begin to deteriorate from its \"perfect\" state. But keeping the rind on can prevent this slightly.'\n\nTHE BEST WAY TO PRESENT YOUR CHEESES It is always a good idea to have a variation in colour, shape and style of cheese when presenting a dairy dish to guests. 'It is also visually far more impressive to have less different cheeses, and bigger wedges of each one,' said Edward. 'Generally speaking, we like to stick to four to five cheeses. These would incorporate two hard cheeses, ideally one younger and fresher one, and a matured crumbly one, and possibly a variety of milks- so a cow's milk and sheep's milk.' He continued: 'We would then suggest a soft cheese (like Camembert or Brie), and finally a blue one.' 'If you are going for five, you could have a washed-rind cheese, like Epoisses or Stinking Bishop.' 'It is also really important to get the order right - you want to start with the hard cheeses, mild first then more mature. 'Next the soft, and finally the blue and washed-rind. Otherwise you will blow your palate and ruin the ability to taste the more mild cheeses. 'If you were keen on a fresh, light goat's cheese, we would recommend starting with that ahead of the hard cheeses.'\n\nHe continued: 'Whole cheeses - thanks to the rind - can quite happily be stored outside the fridge, but they must be out of sunlight.'\n\nSTEER CLEAR OF GRATED\n\nPre-grated cheese should be avoided if possible - depending on how much you value convenience.\n\n'Any shredded cheese (other than perhaps Parmesan) will probably have something added to ensure it doesn't get all stuck together,' explained Edward.\n\n'If you buy pre-grated cheddar, and compare it to freshly grated, you will notice it is far harder, melts more slowly - and not as well - and has an almost floury texture.'\n\nHe added: 'Pre-grated Parmesan, or similar, is a bit better, but the closer you eat a cheese to initial cut, the better.'\n\n'When you grate fresh, from a larger piece, that cheese will have remained fresher for longer, and taste a lot better.'\n\nONLY BUY WHAT YOU CAN EAT\n\n'Unless you have a larder that mimics maturing rooms and you are buying all of your cheese whole, then you shouldn't buy the dairy product to store,' advised Edward.\n\n'Buy enough cheese to eat within a few days. Great cheese should be eaten as close to first cutting as possible.\n\n'Artisan cheese will not keep well, forming unwanted molds far quicker. It will also taste nothing like it could.'\n\n'Meanwhile, a mass-produced cheese such as Cathedral City will probably last months in the fridge, and just dry out slightly, but suffer no other real discernible changes.'\n\nUSE DIFFERENT KNIVES FOR DIFFERENT CHEESES\n\n'Ideally you should use one knife for your hard cheeses, one for your soft dairies, and another for your blues,' he said.\n\n'Otherwise, you are going to get some serious flavour contamination and it will negatively affect the flavour.'\n\nThe Cheese Geek, coined The Modern Cheesemonger, has announced the roll out of its first cheese app, which delivers the dairy foods straight to consumers.", "description": "UK-based Edward Hancock, founder of online British brand The Cheese Geek, has revealed how foodies are decreasing the quality of the popular dairy snack due to their lack of correct preparation.", "authors": ["Jessica Green For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/16/19303226-0-image-a-25_1570202436779.jpg", "published_at": "2019-10-05"}