{"pub": "reuters", "url": "https://uk.reuters.com/article/us-rosneft-contracts-euro/rosneft-says-switched-contracts-to-euros-from-dollars-amid-u-s-sanctions-idUKKBN1X31JT", "downloaded_at": "2019-10-24 15:03:01.755161+00:00", "title": "Rosneft says switched contracts to euros from dollars amid U.S. sanctions", "language": "en", "text": "VERONA/MOSCOW (Reuters) - Russia’s largest oil company Rosneft (ROSN.MM) has fully switched the currency of its contracts to euros from U.S. dollars in a move to shield its transactions from U.S. sanctions, its chief executive Igor Sechin said on Thursday.\n\nFILE PHOTO: U.S. dollar and Euro banknotes are seen in this picture illustration taken May 3, 2018. REUTERS/Dado Ruvic/File Photo\n\nRosneft’s switch to the euro is seen as part of Russia’s wider-scale drive to reduce dependence on the dollar, but it is unlikely to quickly boost the euro’s role for Russia given the negative interest rates it carries.\n\n“All our export contracts are already being implemented in euros and the potential for working with the European currency is very high,” Sechin told an economic forum in Italy’s Verona.\n\n“For now, this is a forced measure in order to limit the company from the impact of the U.S. sanctions.”\n\nReuters reported earlier this month that state-controlled Rosneft set the euro as the default currency for all its new export contracts.\n\nWashington has threatened to impose sanctions on Rosneft over its operations in Venezuela, a move which Rosneft says would be illegal.\n\nMoscow has been hit by a raft of other financial and economic sanctions from Washington over its role in the Ukrainian crisis and alleged meddling in the U.S. elections. Russia denies any wrongdoing.\n\nLast year, Rosneft exported oil and oil products worth 5.7 trillion roubles ($89 billion), according to its reports.\n\nLIMITED IMPACT FOR NOW\n\nRosneft’s switch to the euro comes amid attempts by Russian companies to work out ways to carry out international transactions without the U.S. dollar.\n\nRussian President Vladimir Putin has called for de-dollarisation that should help limit exposure to the lasting risk of more U.S. sanctions, while the Russian central bank has lowered the amount of U.S. Treasuries in its reserves in 2018.\n\nThe switch to the euro has its downside as, under the current policy of the European Central Bank, financial institutions are required to pay interest for parking excess reserves with the bank, known as negative interest rates.\n\n“There is no sense in storing money under negative interest rates,” said Alexander Losev, head of Sputnik Asset Management.\n\nGiven the negative rates, Rosneft’s switch to operations in euros is capable of increasing the amount of euro conversion as Rosneft will seek to ditch the currency for those that are of more use for its operations, market experts say.\n\nThe euro’s share in Russia’s exports has been on the rise since 2015 but Rosneft’s adoption of it is unlikely to have an impact on the Russian currency market, said a manager at one of Russia’s state-controlled banks.\n\nOther experts agree, saying that Rosneft will still need to convert its euros for tax payments and other needs in Russia.\n\nFILE PHOTO: Chief Executive of Rosneft Igor Sechin attends a meeting of Russian President Vladimir Putin with Indian Prime Minister Narendra Modi on the sidelines of the Eastern Economic Forum in Vladivostok, Russia September 4, 2019. Sputnik/Mikhail Klimentyev/Kremlin via REUTERS\n\nA senior forex dealer at a state-controlled bank also said the impact of Rosneft’s move on the rouble will be negligible.\n\nThe Moscow Exchange (MOEX.MM) said Rosneft’s move will increase the euro share in its overall trade turnover.\n\nPreviously, the share of euro trade on the Moscow Exchange has been increasing only marginally. Over the past year, the euro/rouble share in overall FX turnover on Russia’s main bourse stood at 12%, up from 11% in 2017 and 9% in 2016.", "description": "Russia's largest oil company Rosneft has fully switched the currency of its contracts to euros from U.S. dollars in a move to shield its transactions from U.S. sanctions, its chief executive Igor Sechin said on Thursday.", "authors": ["Olesya Astakhova", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191024&t=2&i=1444532167&w=1200&r=LYNXMPEF9N1EY", "published_at": "2019-10-24"}