{"pub": "metro", "url": "https://metro.co.uk/2019/10/16/zoe-kravitz-told-urban-cast-dark-knight-rises-10931512", "downloaded_at": "2019-10-16 21:07:14.394478+00:00", "title": "Zoe Kravitz was told she was too 'urban' to be in a Batman film", "language": "en", "text": "Zoe in The Dark Knight Rises is what we deserved (Picture: Getty, Warner Bros)\n\nLong before the amazing Zoe Kravitz was cast as Catwoman, she was told she was too ‘urban’ for a role in a Batman movie.\n\nThe star tried to get an audition for Christopher Nolan’s 2012 film The Dark Knight Rises, which starred Christian Bale as Batman and Tom Hardy as Bane.\n\nShe told Nylon Magazine in 2015: ‘In the last Batman movie [The Dark Knight Rises], they told me that I couldn’t get an audition for a small role they were casting because they weren’t “going urban”.\n\n‘It was like, “What does that have to do with anything?” I have to play the role like, “Yo, what’s up, Batman? What’s going on wit chu?”’\n\nYeah, you read that right.\n\nApparently sometime between 2010 and now, Warner Bros. realised that Zoe is worthy of whatever role she wants.\n\nAdvertisement\n\nAdvertisement\n\nOn Monday, it was announced she is set to star as Selina Kyle aka Catwoman in the upcoming film The Batman alongside Robert Pattinson, who plays a young Bruce Wayne.\n\nWe’re so ready for the coolest Catwoman yet (Picture: KCS Presse / MEGA)\n\nThe movie will focus on Bruce Wayne’s transformation into the rich and troubled Caped Crusader.\n\nDirector Matt Reeves teased that his idea for the trilogy is ‘very much a point of view-driven, noir Batman tale.’\n\n‘It’s told very squarely on his shoulders, and I hope it’s going to be a story that will be thrilling but also emotional,’ he added. ‘It’s more Batman in his detective mode than we’ve seen in the films.’\n\nZoe – who is the daughter of Lenny Kravitz and Lisa Bonet – was congratulated by friends and family for her role.\n\nStepdad Jason Momoa told her: ‘I’m so proud of u zozo bear. On and off screen OHANA. DC WB ohana Lola and Wolfies big sister is CAT WOMAN.\n\n‘Unbelievable so freaking stoke. Your going to have so much fun Aloha P bear [sic].’\n\nZoe will be playing alongside Robert Pattinson (Picture: Andrew Toth/Getty Images for Entertainment Weekly)\n\nImagine being Catwoman, while having a rock star, the world’s most elegant mum, and Aquaman/Khal Drogo as your step dad.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nThe Kravitz/Momoa’s are already too cool for the entire world.\n\nAdvertisement\n\nAdvertisement\n\nZoe responded to her stepdad: ‘LOVE YOU PAPABEAR! love that aquaman and catwomen spend the holidays together from now on.’\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: The Batman may have found villain as Vincent D’Onofrio teases involvement after Zoe Kravitz casting\n\nMORE: What has new Catwoman star Zoe Kravitz been in and how is she related to Jason Momoa?", "description": "Zoe Kravitz was once told that she couldn't audition for Christopher Nolan's The Dark Knight Rises because she was too 'urban'.", "authors": ["Zara Woodcock"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_90171954_1571247524.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-16"}