{"pub": "usatoday", "url": "https://usatoday.com/story/sports/2019/10/10/college-football-matchup-tony-dorsett-earl-campbell/3929450002", "downloaded_at": "2019-10-10 18:35:56.156525+00:00", "title": "Dick Butkus advances, Tony Dorsett vs. Earl Campbell next in college football GOAT contest", "language": "en", "text": "CLOSE\n\nDefense ruled over offense earlier this week when Dick Butkus received 55% of the vote to defeat fellow Illinois star Red Grange and advance to the Final Four of the USA TODAY Sports college football GOAT competition.\n\nBut voters now must decide who's the most dangerous offensive players with Pittsburgh's Tony Dorsett taking on Texas star Earl Campbell in the second matchup in the Elite Eight. The winner moves onto the Final Four.\n\nVoting starts today and runs through Saturday.\n\nWe're down to the Elite 8 in our bracket to name the greatest college football player of all-time.\n\n\n\nWith help from the @WeAreAFCA, we made the bracket. But we need you to vote for the best.\n\n\n\nOur next matchup pits two former Heisman Trophy-winning RBs. https://t.co/U7AsStN7f3 — USA TODAY Sports (@usatodaysports) October 10, 2019\n\nIn four seasons at Pittsburgh, Dorsett had yearly rushing totals of 1,686, 1,004, 1,686 and 2,150 for a career total of 6,526. He scored 59 touchdowns and averaged 5.9 yards per carry.\n\nIn four seasons at Texas, Campbell posted yearly rushing totals of 928, 1,118, 653 and 1,744 for 4,443 yards. He scored 40 touchdowns and averaged 5.8 yards per carry.\n\nBoth players are past Heisman Trophy winners.\n\nIn the last round, Campbell upset Archie Griffin and Dorsett defeated Walter Payton to reach the Elite Eight.\n\nNext week's matchups: Barry Sanders, Oklahoma.State vs. Herschel Walker, Georgia and Charles Woodson, Michigan vs. Peyton Manning, Tennessee.", "description": "Dick Butkus moves on as Tony Dorsett and Earl Campbell face-off next in our quest to determine the greatest college football player of all-time.", "authors": ["Kevin Allen", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/26/USAT/8bc73dc3-9d50-413a-a001-27ef3f4fbf0f-XXX_C01_Tony_Dorsett.jpg?crop=2699,1518,x0,y479&width=3200&height=1680&fit=bounds", "published_at": "2019-10-10"}