{"pub": "cnn", "url": "https://cnn.com/2019/10/15/sport/prix-de-larc-de-triomphe-longchamp-paris-2019-spt-intl/index.html", "downloaded_at": "2019-10-15 15:22:13.846965+00:00", "title": "48 hours in Paris among racing's beautiful people", "language": "en", "text": "Paris (CNN) Shafts of autumn sunshine glint off the golden grandstand as the Scotsmen in natty suits sip drinks on the lawns of Longchamp and reflect on the night before.\n\nFriday's sleep-sapping evening took in the Moulin Rouge, the famous cabaret near Montmartre, but this morning they're at another iconic Parisian venue to see an extravaganza of a four-legged kind.\n\nThey are among the lead elements of the international racing tribe who descended in their thousands for the prestigious Qatar Prix de l'Arc de Triomphe weekend at the historic Longchamp course on the western edge of Paris.\n\nFor now, they've got space to stretch out and look ahead to one of racing's most revered days. \"It won't be like this tomorrow,\" says David van der Hoeven, resplendent in a brown check suit.\n\n'The racing, Paris, the culture'\n\nThe seven friends are all committed racing enthusiasts, all with part shares in horses back home. They're also financial advisers, but the joke is that owning race horses \"would be terrible financial advice.\"\n\n\"It's a mug's game,\" says Van der Hoeven, despite it emerging he was one of three owners of a horse called Aurora's Encore, which won the 2013 Grand National, the world-famous steeplechase at Aintree in England.\n\nOn the other side of the grandstand, two elegantly dressed English women, Pamela and Sarah, pose for a photo in front of a life-size bronze statue of famed French racehorse Gladiateur\n\nTheir Friday evening in Paris had been rather different, a night at the Opera watching \"La Traviatta.\" This is their 13th trip, a tradition inspired by Pamela's love for the horse Dylan Thomas -- her late mother was a fan of the Welsh poet of the same name -- which won the Arc, as Sunday's big race is known, in 2007.\n\nThe Arc, Europe's richest race worth 5 million euros ($5.5 million), has been the unofficial European championship for middle-distance horses since its inauguration in 1920.\n\nIt has crowned some of the most celebrated horses in the sport, its status enhanced by the aura, romance and setting in the City of Light.\n\n\"It's the whole thing, the racing but also Paris, the culture, a chance to have some fabulous food and some nice wine and just have a break,\" says Pamela.\n\nLongchamp welcomed about 45,000 racing fans for Arc weekend.\n\nAbout 45,000 visitors will attend over the two days with a third expected to come in a great invasion from Britain and Ireland. All will have their own story, but this year there appears to be a common thread\n\n\"We always go to Royal Ascot and the Arc's always been on the list, but Enable was the final motivation we needed,\" says Londoner Tony Cawley as he peers over the parade ring. He is speaking about the wonder horse Enable, who is bidding for a record third straight Arc.\n\nAnother win would elevate her to \"immortal\" status in racing, says her jockey Frankie Dettori . She is already the people's favorite.\n\nJUST WATCHED Enable looks to win unprecedented third Prix de L'Arc de Triomphe Replay More Videos ... MUST WATCH Enable looks to win unprecedented third Prix de L'Arc de Triomphe 02:13\n\n'It's the Arc, isn't it?'\n\nMuch of the pre-racing chat revolves around Longchamp's gleaming grandstand, which replaced an historic stone edifice as part of a $145 million redevelopment. Designed by renowned architect Dominique Perrault, its four stories tilting forward are said to evoke a galloping horse.\n\nEnglishman Colin Mayes, sitting on a wooden bleacher on the first floor, says it looks like a \"supermarket.\" Others admire its presence, if not the colour, which Perrault claims matches the autumnal hues of the woody surrounds of the Bois de Boulogne, above which pokes the top two thirds of Eiffel Tower.\n\nRe-branded ParisLongchamp, the Arc returned in 2018 after a two-year residency at Chantilly, but organizers were slammed for long queues and inadequate betting and catering facilities\n\nThe British and Irish, it seems, are far more partial to drinking and gambling than the locals. \"Just teething problems,\" says Russell Provan, one of the Scots. But some of Colin's friends had refused to come this year because of the debacle.\n\n\"I did, because it's the Arc, isn't it?\" said Colin, who first visited Longchamp in 1970.\n\nThe new grandstand of ParisLongchamp opened for Arc weekend in 2018.\n\nIt appears organizers have listened to the gripes. Bars abound, inside the grandstand and around the concourse and leafy lawns -- 8 euros ($9) for a pint of beer, 12 euros ($13) for a glass of champagne -- and there are plenty of pop-up food stalls.\n\nThe official blurb says there are nearly 400 betting terminals, arranged in rows like slot machines in a casino. Those preferring some form of human interaction opt for roaming operators in green vests or the betting windows, marked \"Pariez ici\" (Bet here).\n\nThe tilting stand is said to evoke a galloping race horse.\n\n'Drink champagne, wear beautiful clothes'\n\nNoticeable among the gently swelling crowd is the number of Japanese visitors\n\nThe Arc has become a holy grail for fans from Japan, which is still seeking a first ever winner in the race.\n\nThey visit in such numbers that there are signs in Japanese, Japanese speaking information assistants and specialist betting stations. There are 90 accredited journalists from Japan, more than last year.\n\nAbout 50 million euros ($55 million) will be wagered on the race worldwide, with half of that in Japan and Hong Kong, according to organizers.\n\n\"It's a very important objective and a symbolic race. It's every horseman's dream in Japan to win the Arc,\" says Yasu Koike, who is over from Tokyo to visit friends but can't resist a second trip to Longchamp after seeing Japanese horse Orfevre edged into second in 2013.\n\nAnd what of the locals? \"French people are not like the British, they are not big fans of racing but they talk about the Arc,\" says Le Parisien journalist Romain Poree.\n\n\"It's an event, not really a sports event. They like betting, so it's more of a game. They come because they can drink champagne and wear beautiful clothes, but they don't come to support certain horses.\"\n\nCarly Gasper (left) and Marie Brown were among those in spectacular outfits at Longchamp.\n\n'Nervous'\n\nAs Saturday morning turns to early afternoon, spectators watch on lazily as racing begins. Cheering is low key. Polite applause is de rigueur for now. Cigar smoke wafts in the autumn air.\n\nLes tribunes de #ParisLongchamp sont déjà bien garnies à moins d'une heure du début des courses de la journée ! #QPAT 😍 pic.twitter.com/I1CYOLvtVX — ParisLongchamp (@paris_longchamp) October 6, 2019\n\nThe 48-year-old Dettori has his first ride of the weekend in the fourth race, the lucrative Prix de Royallieu. He wins on a horse named Anapurna, also trained by Enable's handler, the Newmarket-based John Gosden . It's an encouraging sign for the combination, and the ebullient Dettori dusts off his trademark flying dismount back in the winner's circle.\n\nAsked, inevitably, how he is feeling about Sunday's big race the colorful Italian says: \"If I tell you I wasn't nervous I'd be lying. We are trying to scale a mountain that's never been scaled before. It is no gimme.\"\n\nGosden's towering son Thaddeus deputises for his father in the ring, and he tells Longchamp TV host Liz Price that Enable is \"very happy\" after traveling over through the channel tunnel.\n\nOysters and dark chocolate\n\nThroughout the afternoon the atmosphere remains one of genteel enjoyment, save for one group of English lads whose beery chanting is more akin to a football match.\n\nDuring the eighth race, the Qatar Prix du Cadran, a Frenchman in pink trousers and glasses is on his feet, pumping his fists and shouting, \"Allez ... allez ... allez.\"\n\nPhotos: 10 of the most picturesque racecourses Photos: 10 of the most picturesque racecourses Meydan Racecourse, Dubai – Boasting the world's first five-star trackside hotel, restaurants and a museum, Dubai's Meydan Racecourse is a first-class racing destination. Hide Caption 1 of 10 Photos: 10 of the most picturesque racecourses St. Moritz, Switzerland – St. Moritz is known for world-class skiing, glitz, glamor and...horse racing? The venue for the White Turf event, held three days a year, isn't your typical racecourse. Instead, it's held on a frozen lake. Hide Caption 2 of 10 Photos: 10 of the most picturesque racecourses Flemington Racecourse, Australia – Flemington is Australia's oldest metropolitan racecourse and home to the famous Melbourne Cup. The revamped venue was first used in 1840 when the town of Melbourne was just five years old. Hide Caption 3 of 10 Photos: 10 of the most picturesque racecourses Piazza del Campo, Italy – Simply put, there is no racecourse in the world quite like the Piazza del Campo in Italy. Its origins date back to medieval times when jockeys rode buffalo. The piazza is packed with spectators with racing around the outside. Hide Caption 4 of 10 Photos: 10 of the most picturesque racecourses Happy Valley, Hong Kong – Happy Valley Racecourse was built in 1845 to provide horse racing for expat Britons living in Hong Kong. It's surrounded by giant apartments and skyscrapers -- giving visitors an unusually beautiful scenic view. Hide Caption 5 of 10 Photos: 10 of the most picturesque racecourses Ascot, England – Just the name \"Ascot\" conjures visions of royalty, elegance, high fashion and world-class racing. The racecourse was opened in 1711 by Queen Anne, and Royal Ascot is still one of the most celebrated meetings on the calendar. Hide Caption 6 of 10 Photos: 10 of the most picturesque racecourses Chantilly, France – Spectacular and timeless, historic Chantilly sits in front of the 16th-century Chateau de Chantilly and the majestic Great Stables (pictured) amid forests 30 miles north of Paris. Hide Caption 7 of 10 Photos: 10 of the most picturesque racecourses Laytown Races, Ireland – Laytown Races is the only official beach race in Europe. Situated on the Irish coast, the 150-year-old tradition attracts more than 5000 regular visitors every year. Horses race along the sands on a makeshift course. Hide Caption 8 of 10 Photos: 10 of the most picturesque racecourses Goodwood Racecourse, England – The rolling Sussex countryside unfolds in front of one of the most iconic venues in flat racing. Goodwood has hosted racing since 1802 and offers the perfect setting for the famous Glorious Goodwood meeting. Hide Caption 9 of 10 Photos: 10 of the most picturesque racecourses Cheltenham Racecourse, England – Cheltenham is a shrine to jump racing against the idyllic backdrop of the Cotswold hills. It hosts the prestigious Cheltenham Festival every March, the highlight of the world's jump racing calendar. Hide Caption 10 of 10\n\nHe is very excited when a horse called Holdthasigreen wins, and he hugs a number of women in his party before clambering upwards over the seats.\n\nShortly afterwards, he can be seen bounding onto the podium in the winner's circle behind the grandstand with a grin as shiny as the silverware he is accepting. It turns out he's one of the owners and has just won a slice of $190,000.\n\nAs dusk encroaches, the racing tribe trickles back into every nook of Paris, where life continues oblivious. At a pavement bistro on Rue Cler, American tourists swap tales of European tours, while a waiter gives a French couple the inside scoop on the best way to eat oysters. \"Chocolat noir et puis l'huitre,\" he nods.\n\nRacegoers relax during the Prix de l'Arc de Triomphe weekend at Longchamp.\n\n'E-Day'\n\nSunday dawns with hammering rain, but it's not enough to short-circuit the electricity buzzing around the course.\n\nSaturday's returning tide of racegoers has been swelled by a great wave crashing into Longchamp for Arc day. It's like an international jamboree in sharp suits and colorful hats.\n\nThe hype is everywhere. The Racing Post newspaper's front page headline screams \"E-Day,\" while Paris Turf has an image of Enable emerging through the Arc de Triomphe under the headline \"Histoire.\"\n\nPlenty sport pink and green -- the colours of Enable's owner Khalid Abdullah, worn by Dettori when she races. There is even an official Enable merchandise tent selling bags, hats and placards.\n\nThe Arc is a firm favorite of Japanese fans. Some were supporting Enable Sunday.\n\nLongchamp's dress code is \"laissez faire\" -- upper class Parisians in understated chic mingle with ordinary \"turfistes\" in jeans and sneakers.\n\nBut the style factor has definitely gone up a notch from yesterday. A pair of English women from County Durham turn heads with their spectacular outfits.\n\n\"We love racing anyway, but we're here for Enable, we're just rooting for her,\" says Marie Brown, sporting a sparkly sequined rainbow number alongside her friend Carly Gasper in a stunning red dress with burgundy hat.\n\nStyle is at the forefront for most racegoers at ParisLongchamp.\n\nThe sun is out muscling the clouds and Longchamp bubbles to easy beats as racegoers flood in. The Scotsmen, with fresh suits and fresh drinks, reveal they attended a Q&A with Dettori the night before. All is well in Enable world, they report.\n\nVan der Hoeven tells the tale of his Grand National win, and how, because the horse was a late entry, he was actually in Crete on a pre-arranged family holiday at the time. That evening was \"slightly surreal,\" he says, as he scoured a small Greek village for something resembling champagne to drink.\n\nRacegoer David van der Hoeven watches the action through binoculars.\n\nHullabaloo\n\nAmong the sizeable Japanese contingent, Masaki Izuka from Sapporo is soaking up the atmosphere in the stands. He's with a group of friends on a tour to France for five days. \"My dream is to come here,\" he says. \"It's wonderful. This race No.1.\"\n\nThe Arc is the fourth race of the day, off at 16:05 local time. In a sure sign the showpiece is approaching, the tree-lined parade ring is filling up fast with racing's \"beau monde.\" Expensive hair, expensive shoes.\n\nLongchamp's leafy parade ring is reserved for racing's smart set.\n\nSoon, the Arc jockeys file in behind placards bearing their horse's name and colors, and disperse to join connections -- the name given to all the people directly associated with the horse -- for a quick meet and greet and a final chat on tactics.\n\nIt's a horsey hullabaloo in designer outfits as sharp-elbowed media types duck and dive, trying to get a word or the best shots.\n\nAt the eye of the storm, the diminutive Dettori chats with the imposing Gosden, who stands calmly with his hands behind his back, brown fedora on head.\n\nEnable approaches, led around by groom Imran Shawani. \"Right, here we go then,\" says Dettori and he gives her a pat on the nose as she strides past before grabbing her reins, planting his left boot in the stirrup and mounting up in one fluid motion with the assistance of Gosden.\n\nOne lap of the packed paddock to urgings of \"Come on, Frankie\" from the massed punters, and then they file out to parade in front of the grandstands. Cue more chanting of Dettori's name.\n\nThe 2019 Arc field leaves the stalls at Longchamp.\n\nSimmering\n\nThose spectators who haven't already secured a vantage point rush to the course side of the grandstand, straining for a view of the race, or at least a TV screen.\n\nThere is a hush as the field sets off at a lick, disappearing briefly behind a copse before emerging to climb to the high point of the course ahead of a sweeping downhill right-hander into the final straight.\n\nEnable tracks the leaders from fourth ... and then third .. and then she pours on the power to surge clear with 300 meters left to run.\n\nCelebrations are simmering in the crowd, fists half-raised, roars beginning in the back of throats ... but eyes are drawn to a red rocket tracking like a tracer on the outside ... 100 meters to go .. .Enable is still clear ... 80 meters ... Enable leads ... 50 ... Waldgeist is alongside ... 20 ... Waldgeist is in front ...\n\nWaldgeist flashes across the line first and jockey Pierre-Charles Boudot, in red silks, punches the air.\n\nGroans and intakes of breath reverberate around Longchamp. People look at friends and strangers wide-eyed, mouths open. Really? Enble didn't win? No fairytale ending? No feel-good vibes and later boasts of \"I was there\"?\n\nA pall of deflation hangs in the air, save for the minority who have backed Waldgeist. He's lost three times to Enable but won the French Derby this year.\n\nWaldgeist (left) dashes Enable's hopes of a record third straight Arc title.\n\n'Beautiful weekend'\n\nBack in the ring, Dettori slips quickly off Enable, no flamboyant flying dismount this time. Tight-jawed and drawn, he is enveloped by a thicket of reporters. He offers a few sentences, the gist being that the rain-softened ground is to blame, before seeking solace in the privacy of the weighing room.\n\nSomewhere else in the maelstrom, a more upbeat Gosden tells Aly Vance for CNN's Winning Post he is \"very proud\" of Enable, given a record of two wins and a second in the Arc.\n\n\"How can we love her any less,\" is the view of Teddy Grimthorpe, racing manager to Prince Khalid.\n\nThe scenes of jubilation for party-pooper-in-chief Boudot, veteran trainer Andrew Fabre and the German owners of Waldgeist are almost overshadowed by the general sense of disbelief.\n\nFor Boudot it is a first victory. \"I can die now,\" laughs the 26-year-old. Fabre offers a quick reaction on a record-extending eighth Arc win, but first since 2006. \"The start of an impressive run,\" jokes the quietly spoken Frenchman, who at 73 is approaching the end of his career.\n\nBoudot wins a later race, the Qatar Prix de la Foret, to make it six winners for the weekend. He is living the dream. He has become an instant celebrity and signs countless autographs and poses for selfies.\n\nBy now there is a chill in the late afternoon air. The die-hards are making a good fist of drinking the bars dry. Others mingle around the concourse and the parade ring, reflecting. \"We were all here to see Enable, everyone wanted her to win,\" says Natalie Asper, who came up from Switzerland with her cousin.\n\n\"We're disappointed. Shocked, but not surprised. \"Still... it's been a beautiful weekend.\"", "description": "Shafts of autumn sunshine glint off the golden grandstand as the Scotsmen in natty suits sip drinks on the lawns of Longchamp and reflect on the night before.", "authors": ["Rob Hodgetts At Longchamp"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191014113403-prix-de-larc-de-triomphe-hats-paris-longchamp-super-tease.jpg", "published_at": "2019-10-15"}