{"pub": "yahoo", "url": "https://news.yahoo.com/lynching-every-sense-lindsey-graham-221742269.html", "downloaded_at": "2019-10-23 12:27:29.805539+00:00", "title": "'This is a lynching, in every sense': Lindsey Graham says Trump's impeachment description 'accurate'", "language": "en", "text": "WASHINGTON – As many other lawmakers condemned President Donald Trump's assertion that the impeachment inquiry against him amounted to a \"lynching,\" Sen. Lindsey Graham defended the comment and told reporters Tuesday that he thought the president's assessment was \"accurate.\"\n\n\"This is a sham. This is a joke,\" the South Carolina Republican said, condemning Democrats' handling of the inquiry. He complained that interviews were not being made public, that House Republicans were not allowed to call witnesses and that the whistleblower who filed the complaint that sparked the inquiry was allowed to remain anonymous.\n\n\"This is a lynching, in every sense,\" Graham said. \"This is un-American.\"\n\nHe said lynching involves people \"who are out to get somebody for no good reason\" and who take \"the law in their own hands.\"\n\n\"Yes, African-Americans were lynched, other people have people lynched throughout history,\" Graham said. \"What does lynching mean? That a mob grabs you, they don't give you a chance to defend yourself, they don't tell you what happened to you, they just destroy you.\"\n\nIn a tweet earlier Tuesday, Trump had shared his concerns about the precedent set by the impeachment inquiry and argued that it was being conducted \"without due process or fairness or any legal rights.\"\n\n\"All Republicans must remember what they are witnessing here – a lynching,\" he tweeted.\n\nSo some day, if a Democrat becomes President and the Republicans win the House, even by a tiny margin, they can impeach the President, without due process or fairness or any legal rights. All Republicans must remember what they are witnessing here - a lynching. But we will WIN! — Donald J. Trump (@realDonaldTrump) October 22, 2019\n\nJaime Harrison, an African American Democrat challenging Graham for his seat, has called on the GOP senator to learn more about the history of lynching in South Carolina by joining him as a new museum on African American history breaks ground. Harrison wrote in a campaign email that Graham’s comments were “invoking our hate-filled past to defend Donald Trump.”\n\n“For three generations in South Carolina, we have understood the evil history of lynching in our state,” Harrison said in an email asking for campaign donations.\n\n“I don’t know why @LindseyGrahamSC has turned his back on Southern Carolina values, but he has,” Harrison tweeted.\n\nThe Congressional Black Caucus quickly condemned Trump's comment.\n\n\"Lynching is a horrific stain on our country’s history,\" Rep. Karen Bass, D-Calif., the Congressional Black Caucus chairwoman, said in a statement. \"The president’s tweet is comparing a constitutional process to the prevalent and systematic brutal torture and murder of thousands, I repeat, thousands of African Americans in this country. It's unacceptable.\"\n\nSen. Tim Scott, South Carolina's other Republican senator, did not condemn Trump's tweet but he said he \"wouldn't use the word lynching.\" Scott, who is African-American, said he understood Trump's \"absolute rejection\" of the impeachment process, which he called a \"political death-row trial.\"\n\nContributing: David Jackson, Jeanine Santucci\n\nThis article originally appeared on USA TODAY: Lindsey Graham agrees, impeachment 'a lynching in every sense'", "description": "\"What does lynching mean? That a mob grabs you, they don't give you a chance to defend yourself,\" Lindsey Graham said.", "authors": ["William Cummings", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/O.9prIZ9HIgTV8rv1ZkicQ--~B/aD0zMTM5O3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/10a8a63376f5539cead56ecdfaaed275", "published_at": "2019-10-23"}