{"pub": "independent", "url": "https://independent.co.uk/independentpremium/politics-explained/boris-vote-deal-parliament-numbers-spartans-dup-brexit-a9138471.html", "downloaded_at": "2019-10-04 01:21:51.161222+00:00", "published_at": "2019-10-03", "title": "Does Boris Johnson have the votes for parliament to pass his deal, if the EU agrees to it?", "language": "en", "text": "The Brexit see-saw is that if a deal is acceptable to the EU, it will be defeated in the House of Commons; and if there are the votes for a proposal in the Commons, it will be unacceptable to the EU.\n\nTheresa May got an agreement with the EU first; Boris Johnson is trying it the other way round, putting together a plan that can win support in parliament before trying to agree it with the EU27. Can he make the see-saw balance?\n\nHe seems to have the votes he needs in the Commons. This may seem surprising, given that he has expelled 21 MPs from the parliamentary Conservative party, and upset Labour MPs with his insensitive comments about their safety.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nSo let us go through the numbers. We start with the third and final vote on Theresa May’s deal on 29 March, when she was 30 votes short of the majority she needed.\n\nSince then, the Conservatives have lost one seat to the Liberal Democrats – in the Brecon & Radnorshire by-election. That means, if all the MPs who voted for May’s deal would vote for Johnson’s deal, he needs 31 MPs who refused to vote for hers.\n\nShape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty\n\nFirst, will all those who voted for a deal last time vote for it this time? In particular, what about the MPs who had the Tory whip removed? Of the 21, 16 voted for May’s deal. The other five voted against, because they are opposed to any form of Brexit. I assume they will vote against any deal Johnson can negotiate – and that includes his brother Jo Johnson, now that he is not in government. One of them – Sam Gyimah – has joined the Liberal Democrats, joining Phillip Lee, another EU supporter who voted against May’s deal and who defected before he could be expelled.\n\nAnd I assume the 15 who voted for the deal will vote for Johnson’s version, along with Amber Rudd, who resigned the whip voluntarily. Several of them – Alistair Burt, David Gauke, Greg Clark, Steve Brine and Stephen Hammond – asked supportive, or at least not hostile, questions when the prime minister made his statement in parliament yesterday. I assume that, if there is a deal and they vote for it, they would have the whip restored.\n\nSo where would Johnson get 31 extra votes from? He starts with 10 of the Democratic Unionist Party, which has surprisingly welcomed the proposal, despite it retaining the harder regulatory border in the Irish Sea from May’s deal. There are suggestions that not all 10 are on board with the leadership line, but none has broken cover yet.\n\nThen there are the 28 Tory Eurosceptic MPs who voted against May’s deal. Four of them now have government jobs, including Priti Patel and Theresa Villiers. Two others supported his proposal in the Commons yesterday – Mark Francois and Steve Baker – while two more spoke without revealing their intentions – Bill Cash and Peter Bone.\n\nMy guess is that almost all of them will back a deal if the DUP does.\n\nAnd Johnson has a cushion, in the form of 12 Labour MPs and one Lib Dem (Norman Lamb), who didn’t vote for May’s deal but who are prepared to vote for a new deal in order to avoid further delay. Of the 12, Stephen Kinnock, Ruth Smeeth and Gareth Snell have already indicated that they were not deterred by the prime minister’s controversial comments last week. “If Dublin and Brussels are happy, then we’re happy,” said Kinnock.\n\nIf we assume that eight of the 28 Tory “Spartans” refuse to vote for a new deal, along with Sylvia Hermon, the independent Northern Ireland unionist, who has sounded unhappy with the proposal, and perhaps half of the Labour “MPs for a Deal” group – then Johnson would have 36 more votes than May did.\n\nIn other words, he would clear the fence by six votes. In a full turnout in the Commons, he would have a majority of 11. That is not exactly the “pretty solid majority” of which Michael Gove spoke on Wednesday, but it is certainly winnable.\n\nThe problem is that, during the negotiations, if there are any, Johnson will have to make concessions – the see-saw will tip back and the numbers in the Commons might change again.", "description": "The Brexit see-saw is that if a deal is acceptable to the EU, it will be defeated in the House of Commons; and if there are the votes for a proposal in the Commons, it will be unacceptable to the EU.", "authors": ["John Rentoul"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/25/22/boris-parliament-supreme-court.jpg"}