{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/today-in-mma-history-the-birth-of-pride-fc", "downloaded_at": "2019-10-12 00:23:09.398779+00:00", "title": "Today in MMA History: The birth of PRIDE FC", "language": "en", "text": "(Editor’s note: This story originally published on Oct. 11, 2017.)\n\nBy the time he showed up at the Tokyo Dome on Oct. 11, 1997, for a fight against a pro wrestler who he was practically guaranteed to beat at an event dubbed PRIDE 1, Rickson Gracie was already an MMA legend. What else do you expect when you’ve got over 400 fights and no defeats?\n\nYeah, well. About that.\n\nOfficially, Gracie had won a pair of one-night vale tudo tournaments in Japan back in 1994 and ‘95. Before that, he won a couple fights at home in Brazil. In order to get a number that reached into the hundreds you had to count streets fights, gym fights, beach fights, maybe even a training session or 12. Even other members of the Gracie clan dismissed the record as a bit of mathematically dubious hype. You got the sense that if Gracie had nudged you out of the way while boarding a crowded subway some time in the early ‘90s, there was a good chance you were added to his tally.\n\nStill, one thing you had to give him was that in all the officially recorded and documented fights throughout the decade, Gracie seemed to understand something that his competitors had not even begun to grasp. At a time when other grapplers were rubbing two sticks together, hoping for a little smoke, Gracie might as well have been walking around with a flamethrower.\n\nHe combined this knowledge with genuinely impressive athleticism. Unlike his brother Royce, who was chosen to represent the family in the UFC events that had begun a few years before in part because of his unimpressive physique, Rickson was a physical specimen – not overly muscular, but fit and strong, with a torso carved from wood.\n\nHe was also a fierce competitor, known not just for his submissions, but also for achieving dominant positions on the mat and punishing opponents with punches. Other Gracie jiu-jitsu fighters might choke you until you tapped. Rickson was the one who could punch you until he felt like choking you – or not.\n\nThis is part of how he ended up in the Tokyo Dome on that night when PRIDE was born, 20 years ago today. Just getting him into the ring with pro wrestling star Nobuhiku Takada was a victory of sorts. At least it was a big enough deal to merit a brand new show with a new name, one that would offer Japanese fight fans a mix of the combat sports they’d already proven to love.\n\nAnd with Gracie involved, a long-standing wish of the Japanese pro wrestling scene was about to be granted. Whether they’d still want it once they got it, that was another question.\n\nOct11.1997 20 years ago today, The very 1st PRIDE Fighting Championships event took place in Tokyo, Japan The birth of a historic era pic.twitter.com/QD9bRt8Sqj — MMA History Today (@MMAHistoryToday) October 11, 2017\n\nSee, Gracie was already a fairly big deal in the Japanese fight scene at the time, but he became a much bigger deal once the even more popular pro wrestlers started gunning for him. In Japan, mixed rules fighting events had existed for years with events like Shooto, K-1, and Pancrase, where PRIDE commentator Bas Rutten first built his name.\n\nBut even the scripted pro wrestling matches in Japan often aimed for a higher degree of fighting realism than many of those elsewhere. The pro wrestlers were expected to be true tough guys. They challenged – and actually fought – pro boxers like Muhammad Ali and Trevor Berbick. Takada in particular prided himself as a guy who could really fight, sometimes even genuinely knocking out opponents in bouts that were supposed to be works, as he did to former sumo wrestler Koji Kitao.\n\nBut every form of combat sports thrives on novelty to some extent. Fight promoters wanted something new and fresh, something that would combine the Japanese love for everything from pro wrestling to kickboxing to mixed martial arts. They also wanted a pair of names big enough to draw a real crowd, which is how Gracie soon became a favorite target for pro wrestling callouts.\n\nThe PRIDE FC theme was so powerful. https://t.co/LGCtwS3yup — MMA History Today (@MMAHistoryToday) October 11, 2017\n\nAs Gracie would later tell UFC commentator Joe Rogan on his podcast, he didn’t think much of those challenges at first.\n\n“One of the friends I had in Japan came and said, ‘Mr. Gracie, they’re talking a lot about you, and you should have an official answer for that … because people will start thinking you’re afraid,’” Gracie said. “So I said OK, and I (made) a letter stating I would never fight in their ring, because they’re not legit, they fix fights … but if he wants to come and fight in my (style of) event … he’s welcome to come and we’re going to face each other, for sure.”\n\nOne man did come. Yoji Anjo, a Japanese pro wrestler who would later fight in the UFC, showed up at Gracie’s academy in Southern California with photographers and a film crew in tow. According to legend, he soon made it clear that he intended to force Gracie to honor his pledge to fight for honor rather than money.\n\nGracie let Anjo in, but kept the film crew outside. The only extant recording of the gym fight that followed still belongs to Gracie, and the tape would later assume an almost mythical status. Those who were fortunate enough to see it offered detailed accounts of Gracie taking Anjo down and beating him bloody from full mount. Only when he was satisfied that Anjo had learned his lesson did he choke him out, leaving him unconscious in a pool of his own blood to be photographed by the media that Gracie now allowed into the gym.\n\n(As Gracie would reportedly remark about the incident later: “If we fight for money, I’ll stop hitting you when you ask me to. If we fight for honor, I’ll stop hitting you when I feel like it.”)\n\nWhen word of this beating spread back in Japan, thanks in part to a judicious use of the video evidence, the target on Gracie’s back only grew. The powers that be saw the marketing potential of a fight between the genuine martial artist Gracie and the superstar pro wrestler Takada, who’d been a popular figure in Japan since the ’80s. The promoters with Kakutougi Revolution Spirits (KRS) liked the idea enough to offer Gracie the promise of a true fight – no fixes or funny business – and at a price he couldn’t refuse.\n\nAnd so, Gracie vs. Takada was on. With it, a new event called PRIDE was spawned. Nearly 48,000 people showed up to the Tokyo Dome to see it on that October day in 1997, and the lineup offered a little bit of everything, for better and worse.\n\nFor instance, there was the curtain-jerker between pro wrestler Kazunari Murakami and “Big” John Dixson, who was known in those early days for his insistence on keeping his T-shirt on when he fought.\n\nIf you were expecting a true, unscripted fight, then the bout was suspicious, to say the least. Dixson took Murakami down early and then stood up to relinquish top position after making little effort to do damage on the mat.\n\n“This is strange,” remarked English-language commentator Bas Rutten, who would years later make a similar pronouncement about a fight featuring Takada and UFC champion Mark Coleman, which is almost universally thought to have been fixed.\n\nAfter an almost too perfect hip throw to put Dixson down, Murakami quickly locked up an armbar that Dixson made no attempt to defend against before tapping out.\n\nIn the next fight, however, things got a little too real when Gary Goodridge knocked Oleg Taktarov out cold with a looping right hand, then added two more heavy punches as Taktarov lay face down and motionless on the mat.\n\nSeveral minutes later, Taktarov would be stretchered out of the ring, still unconscious, looking for all the world like a dead man while Goodridge reclined in his corner with an ice pack on his leg.\n\nThen there was the 30-minute draw between Renzo Gracie and Akira Shoji, which was notable in part for a preview of what would become a persistent problem in PRIDE events – the ropes.\n\nWhile the boxing ring made for more fan- and camera-friendly viewing, it also made things tricky for fighters. Early in the fight, with Gracie attached to Shoji’s back, Shoji made the surface work in his favor when he slipped through the ropes to escape, calmly planting his feet on the floor and walking around the ring to re-enter at a safer point.\n\nAfter that came another suspect bout between the sumo wrestler turned pro wrestler Kitao, who required a belt to keep his gi pants up as he took on Australian pro wrestler, powerlifter, and former semi-famous criminal Nathan Jones.\n\n(Side note: Jones, who you might remember from his role as a big, scary bad guy in “Mad Max: Fury Road,” was once known for ripping cell doors off their hinges after being arrested for a string of armed robberies in the mid ‘80s and sentenced to 12 years in Australia’s notorious Boggo Road prison at the age of 17. Upon his release, he began participating in powerlifting competitions such as “The World’s Strongest Man,” where he broke his arm in an arm-wrestling challenge, but was eventually “discovered” by martial arts movie star Jackie Chan.)\n\nFor a fight that Jones would later admit was fixed, there wasn’t much action. Kitao took him down early, then moved to side control and, after a lot of grunting, finished with an Americana arm lock that was far from technically proficient.\n\nJones would later claim that PRIDE had gotten him to throw the bout by promising him legit fights later on, though those never materialized. In a 2015 interview he referred to the fight as “a real sore point in my life.”\n\n(Check out the full Kitao vs. Jones fight above, courtesy of UFC Fight Pass.)\n\nThe lone kickboxing match featured Ralph White and Branko Cikatic fighting in cumbersome gloves that mimicked the size of those used in boxing, but featured the fingered design of MMA gloves. It would end early, and in a controversial no-contest, after Cikatic kicked a downed White in the head, immediately raising an enormous lump on White’s forehead.\n\nBut even after that, the lowlight of the event was a 30-minute draw between former UFC fighters Dan Severn and Kimo Leopoldo, which had Rutten and his English-language broadcast partner Stephen Quadros pleading for action by the end.\n\n“The corner is happy!” Rutten said incredulously after the fight finally ended. “They’re happy and smiling, yay, yay, yay.”\n\n“Well, they’re happy because he went the distance with Dan Severn,” said Quadros. “But to go into a fight with your mission just to make it the distance, why even take the fight?”\n\nBut then at last it was time for the main event, the fight Japan had been waiting for. Not that those in the know were expecting much from it.\n\nOn the English-language broadcast, both Rutten and Quadros openly expressed doubts that Takada had any chance in the bout. At one point, Rutten began to tell an anecdote about Takada coming to train at his gym in Beverly Hills, before breaking off and remarking, “I don’t think he’s going to win this fight.”\n\n“Why wouldn’t Rickson take this fight?” asked Quadros. “You’re talking money here. … But the question remains, can Nobuhiko Takada make his mixed martial arts debut against, of all people, Rickson Gracie – who Royce Gracie, who has won three UFC titles, says is 10 times better than him? Chances are good he’s not going to win.”\n\n“I really don’t see it,” said Rutten.\n\nTheir skepticism would turn out to be well-founded. Gracie came patiently plodding after Takada in the early going, with his stiff standup style on full display – hands low, chin up, almost daring his opponent to attack. Takada jogged around the perimeter of the ring, seemingly content not to lose for at least a couple minutes.\n\nWhen Gracie finally managed to trap Takada in the corner, digging for a single-leg takedown, Takada looped one arm around the ropes and waited for some friendly intervention from the referee, which was quick in coming.\n\n“Rickson can’t be happy with that,” said Quadros. “He had the leg. The takedown was imminent.”\n\nAs Gracie argued with the referee and glared at Takada, he might have been forgiven for wondering whether the fight was going to be on the level after all. But moments after the restart, he would scoop Takada up for a double-leg slam, moving immediately to mount. Takada would try his best to hold on from bottom, but he had little in the way of actual skills from his back. Soon Gracie got enough separation to lock up the armbar, and Takada resisted only briefly before submitting.\n\n“That was a quick one, folks,” said Quadros. “Rickson Gracie continues his undefeated streak with an armbar victory over the most famous pro wrestler in Japan, Nobuhiko Takada.”\n\n“Beautiful armbar,” said Rutten. “But, man, I saw it coming 40 seconds before. Takada should work a little bit more on submissions, I guess.”\n\nTakada’s poor performance was a disappointment to many Japanese fans. Even if they didn’t necessarily expect him to win, they still expected more than they got. He would request and eventually receive a rematch against Gracie, which he also lost after a slightly better showing.\n\nAs would become clear in the years that followed, Takada was no MMA fighter. It didn’t stop him from fighting a total of nine times under the PRIDE banner, however, because why would it?\n\nAs the promoters of that first event learned, a couple big names and a few strange spectacles was often enough to fill a colossal arena in Japan. PRIDE would do it many times in the nearly 10 years that followed before its demise.\n\nToday it lives on only in old DVDs, in the UFC Fight Pass video library, and in the increasingly hazy memories of those who lived through a unique era in MMA, both in and out of the ring.\n\nOct11.1997 Rickson Gracie competes in PRIDE FC's first ever main event, & finishes Nobuhiko Takada with an armbar pic.twitter.com/31wwB759YT — MMA History Today (@MMAHistoryToday) October 11, 2017\n\n“Today in MMA History” is an MMAjunkie series created in association with MMA History Today, the social media outlet dedicated to reliving “a daily journey through our sport’s history.”", "description": "It took a pro wrestler, a jiu-jitsu legend, and a gym beating caught on tape but seen only by a precious few to get to PRIDE's debut event.", "authors": ["Ben Fowlkes", "John Morgan", "Nolan King", "Christian Stein", "Mike Bohn", "Matt Erickson"], "top_image": "https://usatmmajunkie.files.wordpress.com/2017/10/rickson-gracie-pride-1-video.jpg?w=1000&h=576&crop=1", "published_at": "2019-10-11"}