{"pub": "atlantic", "url": "https://theatlantic.com/science/archive/2016/01/the-venus-fly-trap-counts-the-struggles-of-its-prey/424782", "downloaded_at": "2019-10-20 05:11:53.380250+00:00", "title": "Venus Flytraps Are Even Creepier Than We Thought", "language": "en", "text": "We start with a fly. It lands within the open halves of the flytrap’s trap, drawn there by the red color and fruity smell. The inner surfaces of the traps are minefields, dotted with stiff hairs. When one of these is bumped by a bumbling fly, it triggers a spike of calcium ions that send an electrical impulse through the lobes, much like those that travel along your neurons.\n\nA single impulse means nothing; it could be triggered by wind-blown debris hitting a hair, or perhaps a falling raindrop. To avoid closing its traps for such false alarms, the flytrap is programmed to await a second signal.\n\nThe first impulse sets a secret timer, and what the fly does in the next 20 seconds will determine its fate. If it avoids the hairs, it will live. If it bumps a second one, it sets off another electrical impulse, which raises the trap’s calcium levels above a critical threshold. The plant responds by sending water into its leaves, which rapidly change shape from convex (bent outwards) to concave (bent inwards).\n\nIn other words, the trap snaps shut.\n\nThe fly is imprisoned but not dead. It struggles, knocking the trigger hairs even further and sending off more electrical impulses, around one per minute. The third impulse raises the trap’s calcium levels even further, prompting it to produce a hormone called jasmonate. In many plants, jasmonate is a touch hormone, which is released by wounds and injuries and coordinates programs of defense and repair. In the Venus fly trap, jasmonate doubles as a carnivory hormone. It primes the gland cells in the trap to start making digestive enzymes, which they finally do once they detect a fifth electrical impulse.\n\nThe plant carefully calibrates the supply of these enzymes to meet the demand for them. A large fly struggles more furiously, knocks more trigger hairs, and sets off more electrical impulses. The plant responds by making proportionally more jasmonate, and secreting proportionally more digestive enzymes.\n\nAfter six to seven hours, the trap becomes hermetically sealed, and fills with fluid. The fly, cut off from the outside world and deprived of oxygen, asphyxiates—which is merciful, considering what happens next. The fluid inside the trap becomes incredibly acidic, dropping to a pH of 2. It also fills with meat-disintegrating enzymes. It turns into what Hedrich calls a “green stomach.”\n\nThe stomach takes several days to digest the dead fly, and the flytrap keeps up the assault of acid and enzymes by tasting its meal. The dead fly isn’t setting off any electrical impulses any more, but in as-yet-unpublished work, Hedrich has shown that the trap is also lined with chemical sensors. These can detect the chitin in the fly’s shell and the substances in its blood. So, as long as the plant can taste something to digest, it will keep digesting.", "description": "When it comes to digesting its prey, the plant is a calculating killer.", "authors": ["Ed Yong"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2018/07/RTR24XKT/facebook.jpg?1531434078", "published_at": "2016-01-21"}