{"pub": "cbc", "url": "https://cbc.ca/sports/hockey/nhl/nhl-flames-flyers-recap-oct-15-1.5321843", "downloaded_at": "2019-10-16 05:10:23.872404+00:00", "title": "CBC Sports", "language": "en", "text": "Michael Frolik lost his helmet on his first shift of the game and scored on his second.\n\nFrolik's goal in his 800th NHL game helped the Calgary Flames down the visiting Philadelphia Flyers 3-1 on Tuesday.\n\nThe 31-year-old Czech's first goal of the season was the 154th of a career, now in its 13th season and fifth as a Flame.\n\nFrolik has also played for the played for the Florida Panthers, Chicago Blackhawks and Winnipeg Jets.\n\n\"Eight hundred, it's a special number and I was definitely excited for sure,\" Frolik said. \"Couldn't go better, to score on the second shift.\"\n\nAndrew Mangiapane also scored and Elias Lindholm added an empty-net goal for Calgary (3-3-1), which halted a two-game losing skid.\n\nRittich earns 3rd win\n\nDavid Rittich posted 21 saves for the win to improve to 3-2 in starts this season.\n\nHis team trailing 2-0 after two periods, defenceman Matt Niskanen countered for the Flyers early in the third period to halve the deficit.\n\nBrian Elliott made 35 saves in his first start of the season for the Flyers (2-1-1), who cap a three-game road trip Wednesday against the Edmonton Oilers.\n\nThe Flyers opened their regular season in Prague against the Chicago Blackhawks and returned to Philadelphia for one home game before hitting the road again in Western Canada.\n\n\"It hasn't seemed to affect us. Maybe it did tonight. I don't know,\" Niskanen said. \"It's not an ideal situation but I don't think anybody in here is going to use that as an excuse.\n\n\"We just had two days off. We should be fresh, ready to go. We weren't good enough in the first two periods.\"\n\nWith Elliott pulled for an extra attacker, the Flyers couldn't produce an equalizer in the final two minutes of regulation.\n\nRittich lofted a clearing pass headed for the opposing net halfway down the ice, but the puck dribbled to the left to the disappointment of those wanting to see a goalie goal.\n\nElliott 'strong' against former team\n\nElliott, who was Calgary's No. 1 goaltender for a season in 2016-17, rebuffed Lindholm twice in the first four minutes of the third.\n\nTravis Konecny fed Niskanen in the high slot from behind the net for Philadelphia's first goal of the game at 4:58.\n\nKonecny's assist was his seventh point in four games.\n\n\"If there is anything positive to take from tonight's game, I would say it's the play of our goaltender Brian Elliott who played a really strong game,\" Flyers head coach Alain Vigneault.\n\n\"He did what a goaltender is supposed to do, which is give your team a chance to win. He gave us a chance to come back in the third.\n\n\"We definitely did not play the way we wanted to. We didn't execute and we didn't make any plays with the puck.\n\n\"We're going to have an opportunity to jump back tomorrow and do a better job.\"\n\nFlames goal waived off for kicking\n\nTrailing by a goal, Philadelphia pressed early in the second period.\n\nRittich repelled an all-alone Oskar Lindblom in the first minute and shut down James van Reimsdyk twice in the slot four minutes in.\n\nMangiapane made it 2-0 at 14:15. Flames captain Mark Giordano dished the puck to Mangiapane at the point and his low knuckler beat Elliott stick side.\n\nA Calgary goal with five seconds remaining in the opening period was waived off. Officials ruled Sean Monahan kicked the puck into Philadelphia's net.\n\nFrolik scored at 1:35 of the first period. He knocked down a clearing attempt by Flyers defenceman Justin Braun, took three strides and whipped the puck over Elliott's glove with a wrist shot.\n\nThe Flames are at home to the Detroit Red Wings on Thursday.", "description": "Michael Frolik scored in his 800th NHL game to help the Calgary Flames down the visiting Philadelphia Flyers 3-1 on Tuesday.", "authors": [], "top_image": "https://i.cbc.ca/1.5322319.1571197475!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/giroux-brodie-101519.jpg", "published_at": "2019-10-16"}