{"pub": "businessinsider", "url": "https://businessinsider.my/kuala-lumpur-had-the-third-highest-visitor-arrivals-in-apac-last-year-and-the-longest-average-visitor-stay-in-the-top-5", "downloaded_at": "2019-09-04 08:11:00.907626+00:00", "title": "Kuala Lumpur had the third-highest visitor arrivals in APAC last year – and the longest average visitor stay in the top 5", "language": "en", "published_at": "2019-09-04", "text": "Kuala Lumpur welcomed 13.8 million overnight visitors last year, making it the third-most visited city in APAC. The Straits Times\n\nKuala Lumpur welcomed 13.8 million overnight visitors last year, making it the third-most visited APAC city in 2018, Mastercard revealed in its new report on Wednesday (September 4).\n\nWith an average stage of 5.7 days, KL was also the city with the longest average visitor stay among the top five cities. According to Mastercard, each visitor spent an average of US$142 (RM598) in the bustling Malaysian city every day.\n\nAccording to the Mastercard Asia Pacific Destinations Index 2019, Thailand’s Bangkok was the most-visited city in the region, with a staggering 22.8 million overnight international visitors in 2018. Singapore ranked second, with 14.7 million visitors.\n\nThe payments technology company’s index ranks 161 cities in APAC based on information from third-party sources and public data.\n\nLast year, the top 20 cities attracted nearly half (49.8 per cent) of all international overnight arrivals to the 161 destinations on the index, it said.\n\nMastercard\n\nAt one day, Chiba in Japan (19th place), had the lowest average stay recorded on the top 20. In comparison, visitors to Sydney in Australia (17th place) spent an average of 22 days per trip – the highest of the top 20.\n\nHowever, Sydney also recorded the second-lowest average daily expenditure among the top 20. At US$83, it was just slightly above Hanoi’s US$78.\n\nAmong the top 20, Shanghai – at 12th place with 6.1 million visitors – recorded the highest daily visitor spend of US$285.\n\nJapan dominates top 20\n\nJapan’s charm is also proving to be undeniable. According to Mastercard, for the second consecutive year, Nippon was the only market that managed to take up 25 per cent of the top 20 rankings.\n\nIts Okinawa island is also one of the region’s fastest-growing destinations, nudging out Kyoto to join the top 20 list for the first time in 10 years. According to Mastercard, Kyoto has risen 109 places since the index started in 2009.\n\nTop 5 cities attracted 25% of total spending\n\nAccording to Mastercard, the top five most popular destinations – Bangkok, Singapore, Kuala Lumpur, Tokyo and Seoul – were recipients of 22 per cent of all overnight visitors to the region, and collected more 25 per cent of total international travel spending recorded in the region.\n\nThis was “primarily driven by explosive growth in outbound travel from mainland China”, it said.\n\nRegionally, there were 342.2 million business and leisure trips, up from 159.1 million in 2009, Mastercard said. Travel spending also more than doubled, rising from US$117.6 billion in 2009 to US$281.1 billion last year.\n\nChinese travellers still the most influential\n\nMainland China continues to exert the greatest influence over travel patterns and expenditure flows, the report said.\n\nOvernight arrivals by mainland Chinese travellers in markets across Asia Pacific surged from 10.5 million in 2009 to 62.4 million in 2018.\n\nNot surprisingly, mainland China is also amongst the top three source markets of outbound travellers for a whopping 82 cities in Asia Pacific.\n\nApart from China, South Korea and Japan are the next biggest Asian origin markets behind the rising travel expenditure and overnight arrivals across the region.\n\nIn 2018, mainland China accounted for 18.2 percent of international overnight arrivals within the region, while South Korea contributed 9.1 per cent and Japan made up 6 per cent.\n\nThe report also named India as a market to watch, with 14.9 million outbound travellers originating from there in 2018. Around half (49.3 per cent) of these travellers visited Asia Pacific. At the top of Indian travellers’ lists: Singapore, Bangkok, Kuala Lumpur, Pattaya and Bali.\n\nRead also:", "description": "Business Insider - There were 62.4 million mainland Chinese travellers in Asia Pacific last year, up from 10.5 million in 2009.. Read more at businessinsider.my", "authors": ["Jessica Lin"], "top_image": "https://static.businessinsider.my/sites/3/2019/09/st-KualaLumpurTourist.jpg"}