{"pub": "independent", "title": "Serena Williams shares throwback picture from daughter’s birth to celebrate her second birthday", "url": "https://independent.co.uk/life-style/health-and-families/serena-williams-daughter-olympia-alexis-ohanian-photo-birth-throwback-a9087636.html", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:42:29.884523+00:00", "text": "Serena Williams has shared a throwback picture from the day her daughter was born in celebration of the two-year-old's birthday.\n\nOn 1 September 2017, Williams gave birth to Alexis Olympia Ohanian Jr., her first child with her husband Alexis Ohanian, co-founder of social news platform Reddit.\n\nThe tennis player has spoken openly on multiple occasions about the distress she experienced during childbirth, revealing in February 2018 that she \"almost died\" due to a series of complications.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nOn the day of her daughter's second birthday, Williams posted a photograph on Instagram which shows her holding her newborn daughter, while her husband looks on attentively.\n\n\"The last two years have been my greatest accomplishment,\" the 37-year-old's caption read.\n\nSeveral Instagram users left heartfelt comments underneath the post.\n\n\"This photo just made me tear up. So beautiful,\" wrote model Ashley Graham, who is currently expecting her first child with her husband, film director Justin Ervin.\n\n\"Three of the sweetest humans on this earth,\" commented actor Colton Haynes.\n\nShape Created with Sketch. Every Serena Williams outfit from French Open through the years Show all 16 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Every Serena Williams outfit from French Open through the years 1/16 2019 AFP/Getty 2/16 2018 Getty 3/16 2016 Getty 4/16 2015 Getty 5/16 2014 Getty 6/16 2013 Getty 7/16 2012 AFP/Getty 8/16 2010 AFP/Getty 9/16 2009 AFP/Getty 10/16 2008 Getty 11/16 2007 AFP/Getty 12/16 2004 Getty 13/16 2003 Getty 14/16 2002 Getty 15/16 2001 Getty 16/16 1999 Getty 1/16 2019 AFP/Getty 2/16 2018 Getty 3/16 2016 Getty 4/16 2015 Getty 5/16 2014 Getty 6/16 2013 Getty 7/16 2012 AFP/Getty 8/16 2010 AFP/Getty 9/16 2009 AFP/Getty 10/16 2008 Getty 11/16 2007 AFP/Getty 12/16 2004 Getty 13/16 2003 Getty 14/16 2002 Getty 15/16 2001 Getty 16/16 1999 Getty\n\nWilliams is currently competing in the US Open in an effort to achieve a record-tying 24th Grand Slam win.\n\nOn Monday, the tennis star shared a photograph of her and Alexis Olympia on Twitter, writing that she tries to spend as much time as she can with her daughter.\n\n\"She keeps me going especially during tournaments,\" Williams tweeted.\n\n\"Although the popcorn machine has her attention here, I know she's watching and learning to see how I persevere.\"\n\nFor all the latest news on Serena Williams, click here.", "description": "Serena Williams has shared a throwback picture from the day her daughter was born in celebration of the two-year-old's birthday. On 1 September 2017, Williams gave birth to Alexis Olympia Ohanian Jr., her first child with her husband Alexis Ohanian, co-founder of social news platform Reddit.", "authors": ["Sabrina Barr"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/01/14/serena-williams-insta-photo.jpg"}