{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7624355/Grandmother-Yulara-plans-retirement-winning-1million-lottery.html", "downloaded_at": "2019-10-29 06:16:27.417150+00:00", "title": "Grandmother from Yulara plans retirement after winning $1million in the lottery", "language": "en", "text": "A grandmother who became a Lotto millionaire overnight says she will now be able to retire and spend time with her family.\n\nThe ecstatic woman from Yulara in the Northern Territory scored the division one prize of $1million during the Lotto draw on Monday.\n\nShe also raked in an additional $3,190.20 after her System 7 QuickPick entry won division three six times.\n\nA grandmother from Yulara in the Northern Territory has won $1million from Monday's Lotto draw (stock image)\n\nThe grandmother learned of her life-changing news while she was walking into work and says she was 'shaking like a leaf'.\n\n'I don't know how I am going to go to work today but I will because I won't be doing it much longer,' she said after receiving the call.\n\n'I've struggled all my life and I got home from work last night and I thought to myself ''all I want to do is retire''.'\n\nThe winning numbers in Monday's Lotto draw were 38, 18, 43, 30, 45 and 25, while the supplementary numbers were 37 and 12.\n\n'I will retire so I can spend more time with my children and grandchild. I also want to help them out as much as I can,' she said.\n\n'I'm going to buy myself a brand new car. I've never owned a new car in my life and my car is falling apart.\n\n'It has just come at a great time as I was so ready to retire!'\n\nThe grandmother purchased her ticket online from thelott.com.\n\nOz Lotto is offering a $5million prize on Tuesday, while Thursday's Powerball has $12million up for grabs.", "description": "The ecstatic woman from Yulara in the Northern Territory scored the division one prize of $1million during the Lotto draw on Monday.", "authors": ["Paula Ahillon For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/03/20309166-0-image-a-17_1572318727511.jpg", "published_at": "2019-10-29"}