{"pub": "news24", "url": "https://news24.com/World/News/british-pm-on-defensive-again-over-groping-claim-20190930", "downloaded_at": "2019-10-05 10:37:01.391429+00:00", "title": "British PM on defensive again over groping claim", "language": "en", "text": "Britain's Boris Johnson is known for his colourful love life but the accusation he grabbed a young woman's thigh when he was a magazine editor risks a scandal as he seeks to unite his party over Brexit.\n\nThe prime minister, who is attending his Conservative party's conference in Manchester, northwest England, is accused of giving a female journalist's leg \"a squeeze\" while at a private lunch 20 years ago.\n\nJohnson never comments on his personal life but his spokesman issued a clear denial - an acknowledgement that the claim is more serious than gossip about his affairs.\n\nIt follows accusations that Johnson gave special access to a US businesswoman with whom he is alleged to have had a relationship when he was mayor of London.\n\nHe denies any impropriety, but it is yet another headache after his defeats in parliament and the courts over his pledge to leave the EU on October 31, come what may.\n\nPowerful men\n\nIn an article published in The Sunday Times, journalist Charlotte Edwardes described a boozy lunch in the offices of The Spectator magazine around two decades ago, when Johnson was editor.\n\nShe was sitting next to him and wrote that \"under the table I feel Johnson's hand on my thigh. He gives it a squeeze\".\n\n\"His hand is high up my leg and he has enough inner flesh beneath his fingers to make me sit suddenly upright.\"\n\nShe said a woman she spoke with after the dinner, who was sitting on Johnson's other side, said the same thing happened to her.\n\nJohnson was married at the time to his second wife. They are now divorced and he currently lives with his girlfriend Carrie Symonds.\n\nDowning Street said Edwardes' claim was \"untrue\", and the prime minister himself denied it in a television interview, while refusing to comment further.\n\nBut health minister Matt Hancock said he knew Edwardes well, and \"I entirely trust what she has to say\".\n\nFormer Conservative minister Justine Greening, who is now an independent MP, said the claim was \"deeply concerning\".\n\nIt went \"to the heart of this question about character and integrity of people in public life and what standards the electorate have a right to expect,\" she told BBC radio.\n\nThe allegation comes two years after defence minister Michael Fallon quit following revelations he tried to kiss a journalist.\n\nOpposition Labour lawmaker Dawn Butler added: \"What is it about powerful men feeling entitled to harass women? Boris Johnson has serious questions to answer.\"\n\nA feminist\n\nYet at the party conference in Manchester, many delegates were sanguine - while a number of female Conservatives offered their support for Johnson.\n\n\"He's a decent person. I think he cares a great deal about women and girls,\" former defence minister Penny Mordaunt told a fringe meeting.\n\nMP Rachel Maclean highlighted Johnson's campaigning against female genital mutilation, declaring him \"a feminist\".\n\nFleur Butler, national chairman of the Conservative Women's Organisation, told AFP the claim related to a time when \"the world was a different place\".\n\nShe said she did not know if the claim was true but added: \"It's really important though for the party to say that we do not accept this type of behaviour moving forward.\"\n\nBrexit first\n\nJohnson is no stranger to personal scandal, most recently over a noisy row with Symonds that resulted in police being called to their flat in south London.\n\nThere are concerns that the latest claims could damage Johnson's standing with women, who are already less likely to support him.\n\nA YouGov survey this week found 44 percent of men thought Johnson was likeable, compared to 34 percent of women.\n\nOne female Conservative member in her 20s, speaking on condition of anonymity, told AFP: \"I think it's a really big issue.\n\n\"There are still some older members of the Conservative party who don't treat women as they should.\"\n\nBut for many in Manchester, the biggest issue remains Brexit - and they believe Johnson is the man who can deliver that, regardless of anything else.\n\n\"We need to get somebody to get Brexit done,\" Margaret Dane, a retired Tory party member, told AFP.\n\nAs for the squeezing allegation, she added: \"I'll just have to discount the fact that it might be the truth.\"\n\nOthers dismissed it as yet another story \"dredged up\" to discredit the prime minister.\n\n\"It should be looked into. But so much is coming out, I think people are getting immune to it,\" said 48-year-old councillor Julian Goodrich.", "description": "Britain's Boris Johnson is known for his colourful love life but the accusation he grabbed a young woman's thigh when he was a magazine editor risks a scandal as he seeks to unite his party over Brexit.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8899/51906158a9f241f7878773c3fd3c7776.jpg", "published_at": "2019-09-30"}