{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/david-cameron-boris-johnson-brexit-deal-greasy-pig-harrogate-a9161176.html", "downloaded_at": "2019-10-18 11:40:09.553955+00:00", "title": "David Cameron calls Boris Johnson a ‘greased piglet’ before backing Brexit deal", "language": "en", "text": "David Cameron says Boris Johnson is a “greasy pig” but he would back the new Brexit deal if he was still an MP.\n\nThe former premier made the comments during a talk to promote his book For The Record in Harrogate’s Crown Hotel, North Yorkshire.\n\nSpeaking on Thursday evening, Mr Cameron said: “The thing about the greased piglet is that he manages to slip through other people’s hands where mere mortals fail.”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHe then called on current MPs to get behind the deal and vote it through, adding that he suspects getting the bill passed through parliament will be “tight”.\n\nThe former prime minister added: “The country voted to leave the European Union, the best way to leave is with a deal, I think a no-deal Brexit would be bad for the economy and bad for the union.\n\nShape Created with Sketch. David Cameron's biggest controversies Show all 8 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. David Cameron's biggest controversies 1/8 Pig-gate A book released by Conservative peer Lord Ashcroft alleged that an MP and Oxford contemporary of David Cameron had allegedly seen a photograph of Mr Cameron performing a sex act on a pig while at university. Downing Street did not comment on the allegations and the peer said they could have been a case of mistaken identity David Hartley/REX Shutterstock 2/8 ‘Swarm’ of migrants In July 2015 David Cameron referred to refugees coming into Europe from the Middle East and North Africa as a “swarm”. He was criticised for using the language, which critics said was dehumanising Getty 3/8 Child tax credits In April 2015 David Cameron was asked whether he’d cut child tax credits. “No, I don’t want to do that,” he said, saying that he rejected reports that he would. Shortly after the election the Government unveiled cuts to child tax credits EPA 4/8 Cycling to work As leader of the opposition David Cameron was regularly photographed cycling to work. In early 2006 he was photographed cycling but with a driver in a car carrying his belongings. It was suggested at the time the cycling was just for show and that having two vehicles on the road instead of one was wasteful Rex 5/8 Andy Coulson David Cameron employed former News of the World editor Andy Coulson as government communications director from 2010. After stepping down from the post due to coverage of the phone hacking affairs, Mr Coulson was later found guilty of conspiracy to intercept voicemails. He served a short prison sentence AFP 6/8 His personal windmill Early in his leadership of the Conservative David Cameron made an effort to change the party’s image by making eco-friendly gesures. As one of these gestures, the future PM put a wind turbine on his house. However, the turbine later had to be removed after neighbours condemned it as an eyesore and the council’s planning committee said it had been put in the wrong place Getty 7/8 Funeral selfie David Cameron was pictured posing for a ‘selfie’ with Danish PM Helle Thorning-Schmidt and Barack Obama at Nelson Mandela’s funeral. Some in the press criticised the prime minister for showing in an inappropriately low level of respect for the gravity of the occasion AFP/Getty Images 8/8 Eating a hotdog with a knife and fork The Prime Minister was pictured eating a hotdog with a knife and fork in the run up to the 2015 general election. He was accused of being “posh”. “I had a very privileged upbringing... I've never tried to hide that,” he said Reuters 1/8 Pig-gate A book released by Conservative peer Lord Ashcroft alleged that an MP and Oxford contemporary of David Cameron had allegedly seen a photograph of Mr Cameron performing a sex act on a pig while at university. Downing Street did not comment on the allegations and the peer said they could have been a case of mistaken identity David Hartley/REX Shutterstock 2/8 ‘Swarm’ of migrants In July 2015 David Cameron referred to refugees coming into Europe from the Middle East and North Africa as a “swarm”. He was criticised for using the language, which critics said was dehumanising Getty 3/8 Child tax credits In April 2015 David Cameron was asked whether he’d cut child tax credits. “No, I don’t want to do that,” he said, saying that he rejected reports that he would. Shortly after the election the Government unveiled cuts to child tax credits EPA 4/8 Cycling to work As leader of the opposition David Cameron was regularly photographed cycling to work. In early 2006 he was photographed cycling but with a driver in a car carrying his belongings. It was suggested at the time the cycling was just for show and that having two vehicles on the road instead of one was wasteful Rex 5/8 Andy Coulson David Cameron employed former News of the World editor Andy Coulson as government communications director from 2010. After stepping down from the post due to coverage of the phone hacking affairs, Mr Coulson was later found guilty of conspiracy to intercept voicemails. He served a short prison sentence AFP 6/8 His personal windmill Early in his leadership of the Conservative David Cameron made an effort to change the party’s image by making eco-friendly gesures. As one of these gestures, the future PM put a wind turbine on his house. However, the turbine later had to be removed after neighbours condemned it as an eyesore and the council’s planning committee said it had been put in the wrong place Getty 7/8 Funeral selfie David Cameron was pictured posing for a ‘selfie’ with Danish PM Helle Thorning-Schmidt and Barack Obama at Nelson Mandela’s funeral. Some in the press criticised the prime minister for showing in an inappropriately low level of respect for the gravity of the occasion AFP/Getty Images 8/8 Eating a hotdog with a knife and fork The Prime Minister was pictured eating a hotdog with a knife and fork in the run up to the 2015 general election. He was accused of being “posh”. “I had a very privileged upbringing... I've never tried to hide that,” he said Reuters\n\n“I think it’s much better to leave with a deal, and I think Boris has done well to achieve that deal. I hope he’ll get it through parliament, I suspect he will but it will be tight.”\n\nAnswering questions from BBC’s James Landale, Mr Cameron said: “At the end of the day, I think this is quite close to what was talked about in the 2017 manifesto, and it is a way of leaving with a deal, so I think that is the right thing to do.\n\n“We can’t go on being stuck. You can’t rule out having a general election if parliament cannot pass this deal and is still stuck, and you cannot rule out a second referendum.”\n\nThe event was the first night of Harrogate’s literature festival and Mr Cameron was frequently heckled.\n\nA small group of protesters formed outside the hotel prior to his talk and at one stage when discussing the reasons why he called the EU referendum, a woman stood up and shouted: “I think the good people of Harrogate came here to hear an apology from you.”\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nMr Cameron described the years following the referendum as “very painful for the country”.\n\nIn his book, the former prime minister claimed he “didn’t believe” Boris Johnson genuinely wanted to leave the EU but campaigned for it to further his career.\n\nHe added that Mr Johnson wanted to be the “darling of the party” and “didn’t want to risk allowing someone else with a high profile – Michael Gove in particular – to win that crown”.\n\nMr Cameron’s choice of words to describe Mr Johnson as a “greased pig” comes after the so-called Pig-gate scandal in 2015.\n\nIt followed after an uncorroborated anecdote that during university he put a “private part of his anatomy” into a dead pig’s mouth as part of an initiation ceremony for the Piers Gaveston Society.\n\nMr Cameron denounced the story as “false and ludicrous” in his autobiography, following years of pointedly refusing to comment.", "description": "David Cameron says Boris Johnson is a “greasy pig” but he would back the new Brexit deal if he was still an MP. The former premier made the comments during a talk to promote his book For The Record in Harrogate’s Crown Hotel, North Yorkshire.  Speaking on Thursday evening, Mr Cameron said: “The thing about the greased piglet is that he manages to slip through other people’s", "authors": ["Matt Drake"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/18/10/David-Cameron.jpg", "published_at": "2019-10-18"}