{"pub": "fox", "url": "https://foxnews.com/world/earthquake-albania-injured-damage-homes-cars", "downloaded_at": "2019-09-22 15:18:07.055596+00:00", "title": "5.8 magnitude earthquake strikes Albania, injures 105 fleeing cracking homes, officials say", "language": "en", "text": "A 5.8 magnitude earthquake in Albania injured more than 100 people trying to escape their cracking homes as scores of aftershocks shook the country’s western coast on Saturday.\n\nThe quake struck 8 miles north of the port city of Durres around 2:04 p.m., sending shockwaves as far as the capital Tirana, located about 23 miles to the east, Albania's defense ministry said.\n\nTWO TEENAGERS ARRESTED OVER AUSTRALIAN BUSHFIRE; FIREFIGHTERS CONTINUE TO BATTLE AT LEAST 50 BLAZES\n\n“All our neighbors came out screaming,” a 67-year-old retiree in Tirana called Agim told Reuters. “Thank God it did not last long -- about 20 seconds. It was a nightmare on the 10th floor. I don’t remember a more powerful one than this.”\n\nOfficials described the quake as the most powerful to strike the country in the last 30 years, according to the outlet. More than 100 aftershocks have since rattled the region.\n\nAt least 105 residents suffered minor injuries as they bolted from their homes, officials said. Many who had fled were staying in temporary shelters as experts inspected nearly 600 damaged homes around the country Sunday.\n\nAt least one home collapsed while other buildings were heavily damaged, authorities said. A photo of a six-story building in Tirana with a crack cleaved all the way down its center followed reports of other homes and structures fracturing during the quake.\n\nFalling debris also crushed cars in Tirana. Photos showed cars parked outside the Faculty Geology buildings with their front halves flattened underneath a pile of collapsed bricks.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nPower and water facilities in Tirana, Durres and some other western and central districts were also knocked out. Defense Minister Olta Xhacka said \"luckily oil wells were not damaged.\"\n\nPrime Minister Edi Rama said he had phone calls from his Italian, French, German and other European counterparts offering assistance.\n\nLocated along the Adriatic and Ionian Seas, Albania is earthquake-prone and registers seismic activity every few days.\n\nThe Associated Press contributed to this report.", "description": "A 5.8 magnitude earthquake in Albania injured more than 100 people trying to escape their cracking homes as scores of aftershocks shook the country’s western coast on Saturday.", "authors": ["Stephen Sorace"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Albania-earthquake.jpg", "published_at": "2019-09-22"}