{"pub": "abcnews", "url": "https://abcnews.go.com/US/texas-officer-dies-cold-blooded-manner-traffic-stop/story?id=65914013", "downloaded_at": "2019-09-28 10:19:19.601978+00:00", "title": "Man charged in 'cold blooded' fatal shooting of Texas police officer during traffic stop", "language": "en", "text": "A man with an active parole violation has been arrested and charged with capital murder for the fatal shooting of a Houston sheriff’s deputy during a routine traffic stop Friday, authorities say.\n\nOfficer Sandeep Dhaliwal of the Harris County Sheriff's Office had initiated a traffic stop and was apparently walking back to his patrol car when the suspect \"caught him by surprise,\" ran up, and shot him in the back of the head \"in a very cold blooded manner,\" Sheriff Ed Gonzalez said at a press conference.\n\nHarris County Sheriffs Office\n\nDhaliwal was rushed to the hospital in critical condition and died a few hours later.\n\nThe Harris County Sheriff's Office announced late Friday that they had arrested Robert Solis, 47, and charged him with capital murder in Dhaliwal's death.\n\nHarris County Sheriff's Office Maj. Mike Lee said that deputies immediately checked dash cam video inside Dhaliwal's squad car to get an image of the suspect, who officers than located inside a business about a quarter of a mile from where Dhaliwal was shot, according to Houston ABC station KTRK\n\nAt this time, our @HCSOTexas family would like to give thanks from the bottom of our hearts for the outpouring of support, prayers, and love we have received. We mourn the loss of a wonderful father, husband, son brother, friend, and last but not least, a Texas Peace Officer. pic.twitter.com/1j5rRhhMxb — Ed Gonzalez (@SheriffEd_HCSO) September 27, 2019\n\n\"A deputy observed that he looked a little nervous and put him in custody, and that did turn out to be our shooter,\" Lee said, adding that the weapon believed to have been used in the shooting was recovered in the parking lot of the business.\n\nSolis had an active parole violation warrant for aggravated assault with a deadly weapon dating back to January 2017, authorities said.\n\n\"He has a lengthy criminal history, on parole, probably knew he was going to go back to jail and did not want to go back to jail,\" Lee said of Solis. \"It was senseless.\"\n\nDhaliwal was the first member of the Sikh community to join Harris County's sheriff's office, and was a \"pioneer\" in the department, Gonzalez told reporters. He said the fallen deputy had recently returned from a volunteer mission to Puerto Rico, according to KTRK.\n\n\"There are no words to convey our sadness,\" Gonzalez said.\n\nABC News' Matthew Fuhrman and Alyssa Pone contributed to this report.", "description": "A man with an active parole violation has been arrested and charged with capital murder for the fatal shooting of a Houston sheriff’s deputy during a traffic stop Friday.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/solis-hcso-20190928_hpMain_16x9_992.jpg", "published_at": "2019-09-28"}