{"pub": "japantoday", "url": "https://japantoday.com/category/tech/ai-based-facial-expression-recognition-tech-accurately-detects-subtle-changes-in-expression", "downloaded_at": "2019-10-18 01:07:11.707150+00:00", "title": "AI-based facial expression recognition tech accurately detects subtle changes in expression", "language": "en", "text": "Fujitsu Laboratories Ltd and Fujitsu Laboratories of America has announced the development of an AI facial expression recognition technology that detects subtle changes in facial expression with a high degree of accuracy. The new technology was developed in collaboration with Carnegie Mellon University School of Computer Science.\n\nOne of the obstacles for facial expression recognition technology is the difficulty in providing large amounts of data required to train detection models for each facial pose, because faces are usually captured with a wide variety of poses in real-world applications. To address the problem, Fujitsu said it has developed a technology to adapt different normalization process for each facial image.\n\nFor example, when the angle of the subject's face is oblique, the technology can adjust the image to more closely resemble the frontal image of the face, allowing the detection model to be trained with a relatively small amount of data. The technology can accurately detect subtle emotional changes, including uncomfortable or nervous laughter, confusion, etc.-even when the subject's face is moving in a real-world context.\n\nFujitsu said it anticipates that the new technology will find use in a variety of real-world applications, including communication facilitation for employee engagement and to improve workplace safety for drivers and factory workers.\n\n© Japan Today", "description": "Fujitsu Laboratories Ltd and Fujitsu Laboratories of America has announced the development of an AI facial expression recognition technology that detects subtle changes in facial expression with a high degree of accuracy.  The new technology was developed in collaboration with Carnegie Mellon University School of Computer Science.  One of the…", "authors": ["Japan Today"], "top_image": "https://japantoday.com/images/japan-today-social.jpg", "published_at": "2019-10-17"}