{"pub": "politico", "url": "https://politico.com/story/2019/09/05/donald-trump-hurricane-dorian-alabama-1482815", "downloaded_at": "2019-09-06 12:08:01.780895+00:00", "title": "Was Trump really wrong about Hurricane Dorian’s threat to Alabama?", "language": "en", "text": "President Donald Trump relied on days-old projections and computer models of Hurricane Dorian’s possible path when he said incorrectly that the storm was forecast to hit Alabama. | Chip Somodevilla/Getty Images White House Was Trump really wrong about Hurricane Dorian’s threat to Alabama?\n\nPresident Donald Trump has been widely ridiculed for insisting that Alabama faced a grave threat from Hurricane Dorian and for even showing off a Sharpie-doctored map that added the state to the storm’s potential path of destruction.\n\nBut was he really wrong?\n\nStory Continued Below\n\nSure, the pushback has been swift, even from official sources. Shortly after Trump tweeted on Sunday that Alabama was among the states that would be hit “harder than anticipated” by Dorian, the National Weather Service office in Birmingham quickly clarified that “Alabama will NOT see any impacts” from the storm.\n\nBut rather than acknowledge his mistake — or that, at best, he was providing information based on days-old forecasts that had long been superseded by better guidance — Trump has dug in on his claim that Alabama was in the path of Dorian, until it turned northward toward the Carolinas.\n\nSo what’s the real story? Here are five things to know about Dorian, Trump, Alabama and the rest of the Southeastern U.S.:\n\nThe National Hurricane Center never predicted Dorian would affect Alabama.\n\n\n\nThe map Trump showed off in the White House on Wednesday — the unaltered version, at least — was a five-day forecast from the National Hurricane Center issued at 11 a.m. on Aug. 29. The “cone of uncertainty” included most of Florida, excluding the panhandle west of the “Big Bend” area, and a little bit of southeastern Georgia.\n\nFive days is as far out as the National Hurricane Center will go. Hurricanes — the most powerful synoptic scale systems in weather — are unpredictable. In fact, the National Hurricane Center cautions that four or five days out, tropical systems will remain in the cone only 60 percent or 70 percent of the time.\n\nposter=\"http://v.politico.com/images/1155968404/201909/169/1155968404_6083737993001_6083745742001-vs.jpg?pubId=1155968404\" true\n\nPressed by reporters about it on Wednesday, Trump insisted, at one point last week, there was a “95 percent” chance of Dorian impacting Alabama. But no part of Alabama was ever in the forecast cone, which is accurate 60 percent or 70 percent of the time five days in advance.\n\nThe only probabilistic measure of an impact on Alabama ever issued by the National Hurricane Center was a product that predicts the chance of tropical storm-force winds of 39 miles per hour or greater occurring in a five-day period. The greatest odds for any site in Alabama to receive winds of tropical storm intensity was 11 percent, in a forecast issued on Aug. 30.\n\nThat chance quickly diminished to 0 percent.\n\nLonger-term computer guidance did suggest, for a time, that Dorian could enter the Gulf of Mexico.\n\n\n\nJust because the National Hurricane Center forecast never predicted any significant impact on Alabama from Dorian doesn’t mean it was impossible. Defending himself late Wednesday, Trump posted an image borrowed from the South Florida Water Management District.\n\nThe image, which according to a time stamp was generated on Aug. 28, features many deterministic computer models plotting potential tracks for the center of Dorian. Some of those models did suggest the center of Dorian could move through the Florida peninsula and into the Gulf of Mexico, where it could make a second landfall along the Northern Gulf Coast, including Alabama.\n\nBut computer models aren’t forecasts; they’re tools for forecasters.\n\n\n\nNo weather forecaster would take the output of a single computer model — or even multiple models — and portray it as a weather forecast. Experienced forecasters blend these models with other data and their own skills to produce the most accurate forecast.\n\nTwo days before Trump’s first tweet mentioning a supposed threat to Alabama, it was clear — both from the models and the forecasts — that Dorian would turn north and northeastward either over Florida or before it reached Florida, meaning Alabama and the rest of the Gulf Coast would be spared.\n\nIt’s a federal crime to provide false weather forecasts, but Trump enjoys protections as president.\n\n\n\nThe National Weather Service has been part of the Commerce Department since the 1940s, when it was known as the U.S. Weather Bureau. According to its website, it makes forecasts “for the protection of life and property and enhancement of the national economy.”\n\nPOLITICO Playbook newsletter Sign up today to receive the #1-rated newsletter in politics Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nAnd as part of that role, Congress passed a law that makes it illegal to pass along a false forecast as an official Weather Service project. According to federal law, “Whoever knowingly issues or publishes any counterfeit weather forecast or warning of weather conditions falsely representing such forecast or warning to have been issued or published by the Weather Bureau, United States Signal Service, or other branch of the Government service, shall be fined under this title or imprisoned not more than ninety days, or both.”\n\nThe Justice Department says the president can’t be indicted for violating federal law, and it’s unlikely a doctored weather map would result in the kind of special counsel investigation that dogged Trump’s presidency over Russian meddling in the 2016 presidential election.\n\nAlabama was spared, but Dorian could still wreak havoc.\n\n\n\nAs of midafternoon Thursday, the center of Dorian was located about 60 miles south of Myrtle Beach, S.C., or 110 miles south-southeast of Wilmington, N.C.\n\nThe center of Dorian has thus far remained just offshore, but the storm is still lashing the Southeastern coast with dangerous storm surge, damaging winds, heavy rain and tornadoes.\n\nDorian is now headed toward the vulnerable Outer Banks of North Carolina, which are sandwiched between the Atlantic Ocean to the east and the Pamlico and Albermarle sounds to the west. That could result in even stronger winds and storm surge inundating the Outer Banks than have been seen from Florida north through South Carolina.\n\n", "description": "What’s the real story? Here are five things to know about Dorian, Trump, Alabama and the rest of the Southeastern U.S.", "authors": ["Steven Shepard"], "top_image": "https://static.politico.com/1f/51/e6d0c3884f93a1fd7478d9d166a1/20190905-trump-oval-dorian-gty-773.jpg", "published_at": "2019-09-05"}