{"pub": "wsj", "url": "https://wsj.com/articles/canadas-oil-market-finds-outlet-in-u-s-demand-11568289600?mod=rsswn", "downloaded_at": "2019-09-12 12:45:38.583729+00:00", "title": "Canada’s Oil Market Finds Outlet in U.S. Demand", "language": "en", "text": "TORONTO—A glut of oil in Canada is easing, thanks to higher demand for dense crude from U.S. Gulf Coast refineries and government-imposed production cuts that have offset a shortage of pipeline capacity.\n\nCanadian oil stockpiles have fallen to their lowest level since November 2017, with inventories dropping below 26 million barrels as of Aug. 30, according to data provider Genscape.\n\nThe development is a shift from roughly a year ago. Back then, Canadian oil prices traded at a discount of more than $51 a barrel to the U.S. benchmark, according to S&P Global Platts. The reason? Congested pipelines prevented the country’s producers from getting their oil out.\n\nA resulting increase in inventories, which added to the pressure on prices, prompted the Alberta provincial government in December to order producers to cut output. This year, a U.S. embargo on Venezuelan oil has narrowed the gap between Western Canadian Select and U.S. West Texas Intermediate. On Wednesday, the difference was about $13 a barrel.\n\nIn January, the U.S. imposed sanctions on the South American country’s state-owned oil giant, putting at risk roughly 500,000 barrels of shipment a day. Canadian exports to the U.S. have jumped, as refiners along the Gulf Coast scrambled to fill the gap.\n\n“The U.S. Gulf is structurally short of heavy, sour crudes,” said RBC Capital Markets energy analyst Michael Tran, referring to the grade of dense crude oil produced in Venezuela and Canada.\n\nWhile output from U.S. oil companies has been plentiful, much of the crude produced from shale drilling is “light,” meaning it has a low density, and “sweet,” or low in sulfur. Many U.S. refineries are configured to process some heavy, sour crude to produce fuels like gasoline and diesel.\n\nThe U.S. imported an average 3.58 million barrels a day from Canada for the four weeks ended Aug. 30, according to the U.S. Energy Information Administration. That was an 8% gain from the four-week average recorded at the end of last year and a 3% increase from the end of August 2018.\n\nSan Antonio-based Valero Energy Corp. has boosted its Canadian content to record levels. The company processed more than 190,000 barrels of Canadian oil a day during its second quarter, according to the refiner. The company expects rail shipments from Canada to continue rising, and its refineries have enough capacity for more than 300,000 barrels a day, said Gary Simmons, a senior vice president at Valero, during an earnings call in July.\n\nThe increase in U.S. demand has allowed producers like Calgary-based Cenovus Energy Inc. to push more oil south by rail. Most Canadian crude exports go to the U.S.\n\nNewsletter Sign-up\n\nCenovus more than doubled the amount of oil it shipped by rail to the U.S. Gulf Coast during the second quarter to nearly 36,000 barrels a day, Chief Executive Alex Pourbaix said in a July call with analysts. The company plans to roughly triple that amount to around 100,000 barrels by the end of the year, he added.\n\nCanadian National Railway Co. reported that it had moved an average of 200,000 barrels of crude a day in June, a 33% jump from April.\n\nOverall, Canadian crude oil exports to the U.S. by rail hit 8.6 million barrels in June, a 41% jump from a year earlier, according to the most recently available data from Canada’s National Energy Board.\n\nBut Canadian oil prices would have to fall below current levels to justify the rail shipments. Moving a barrel from terminals in Alberta to the U.S. Gulf Coast costs between $9 and $12 a barrel by pipeline and between $15 and $20 by rail.\n\nThat cost exceeds the current premium of U.S. crude to Canadian, putting shippers’ profits at risk. As things stand, a shipper could lose between $2 and $7 for every barrel sent to the Gulf by rail.\n\nCanadian exports to the U.S. have jumped. The Syncrude Canada facility in the Athabasca Oil Sands near Fort McMurray, Alberta, in September 2018. Photo: Ben Nelms/Bloomberg News\n\nThat scenario is causing some producers to pull back, despite the demand from U.S. refiners. Imperial Oil Ltd. , which is majority-owned by U.S. energy giant Exxon Mobil Corp. , for example, said it had increased rail shipments through the second quarter and expects to ramp down shipments in August and September.\n\nTo receive our Markets newsletter every morning in your inbox, click here.\n\nWrite to Vipal Monga at vipal.monga@wsj.com", "description": "A glut of oil in Canada is easing, thanks to higher demand for dense crude from U.S. Gulf Coast refineries and government-imposed production cuts that have offset a shortage of pipeline capacity.", "authors": ["Vipal Monga", "Vipal.Monga Wsj.Com"], "top_image": "https://images.wsj.net/im-106362/social", "published_at": "2019-09-12"}