{"pub": "atlantic", "url": "https://theatlantic.com/ideas/archive/2019/09/free-speech-campus/598549", "downloaded_at": "2019-09-21 10:08:41.982313+00:00", "title": "Why I Cover Campus Controversies", "language": "en", "text": "They feel embattled by Donald Trump’s rise. And with Trumpism ascendant, they have trouble grasping why anyone other than a fascist or a useful idiot would spend time or effort talking about campus excesses.\n\nThat critique is worth taking seriously.\n\nConor Friedersdorf: The corruption of ‘privilege’\n\nThe Yale philosophy professor Jason Stanley, the author of How Fascism Works, thinks the entire West is under attack from a fascistic right that gains power in part by demagogically attacking academics.\n\nStoking false narratives about tenured radicals is one way those fascists pander to prejudice against intellectuals, Jews, and diversity; undermine the structurally liberalizing force of academic freedom; and consolidate support among authoritarians. Abroad, Stanley notes Viktor Orbán’s successful effort to oust Central European University from Hungary. He draws a connection between that situation and the fact that conservative legislators in red states are slashing funds for public university systems. And he believes that populist-right media outlets are mining the unrepresentative behavior of powerless undergraduates as fuel for cynical, sinister propaganda.\n\n“The attack on the universities for being stacked with liberals was a central part of the Trump campaign and will be in 2020,” he wrote this week. “The idea that universities are ‘crushing free speech’ and supposedly promoting liberalism while suppressing other voices, has been central not just to the Trump campaign, but to Republican politics in many states. To ignore the political effects of this message is duplicitous.” Citing recent public-opinion data from Pew, he added that “the recent divide on attitudes to universities, because of the well-funded attack on them, has become one of the larger partisan divides in the United States. In short: since 2015 it has become a partisan political issue.” And, he warned, “Don’t trust anyone who discusses ‘liberal indoctrination in universities,’ or ‘suppression of free speech and religious liberty,’ who evades the issue that this is one of the major recent political success strategies of the Republican Party.”\n\nStanley regards public conversation about higher education as a proxy war between liberals and authoritarians. And he urges everyone sympathetic to liberalism to avoid giving unintentional assistance to a fascistic right that critiques universities to sow the seeds of their destruction.\n\nLike Stanley, I am an opponent of Trumpism and right-wing efforts to weaken higher education. And I agree that there are intellectually dishonest actors on the right who seize on campus controversies in cynical gambits to undermine their ideological opponents and liberalism more generally.\n\nSo why don’t I shut up about what I see as academia’s flaws?\n\nCalls to do so remind me of the period directly after the 9/11 terrorist attacks. A sizable, earnest cohort on the right correctly perceived the rise of Islamofascist terrorist groups bent on destroying the West––and had trouble understanding why anyone other than a fellow traveler or a useful idiot would spend time or effort criticizing the excesses of Western foreign policy or the mistreatment of American Muslims, knowing that such efforts could be manipulated by propagandists and recruiters.", "description": "Should journalists care about the speech wars in the era of Donald Trump?", "authors": ["Conor Friedersdorf", "Staff Writer At"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/GettyImages_612037304/facebook.jpg?1569015174", "published_at": "2019-09-21"}