{"pub": "metro", "url": "https://metro.co.uk/2019/10/15/thief-jailed-12-years-running-police-officer-stolen-patrol-car-10925566", "downloaded_at": "2019-10-15 23:09:43.553844+00:00", "title": "Thief jailed for 12 years for running over police officer with stolen patrol car", "language": "en", "text": "Mubashar Hussain still tried to resist arrest despite being Tasered by officers (Picture: PA)\n\nA court was shown harrowing footage of a car thief running over a police officer in a hijacked patrol car before speeding off at up to 97mph.\n\nMubashar Hussain, 29, shattered the pelvis of PC Gareth Phillips and nearly reversed over another officer’s head as he tried to escape arrest in Birmingham’s Moseley area.\n\nThis was after overpowering several officers after police swooped in and Tasered him at the wheel of a Range Rover which had been stolen the night before.\n\nHe was jailed for 12 years today after pleading guilty to causing grievous bodily harm to PC Phillips with intent to resist arrest along with 11 other offences during a brief video-link appearance last month.\n\nBirmingham Crown Court was shown bodycam and helicopter-filmed footage of Hussain struggling with officer trying to handcuff him after he got out of the 4X4.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nPolice examine the Range Rover stolen by Hussain and Ghafoor (Picture: SWNS)\n\nSickening helicopter footage shows Hussain reversing a stolen police car into officers (Picture: PA)\n\nHussain removed barbs left in his skin by a Taser fired by officers as he tried to shift the Range Rover back into gear after it was trapped between two police cars.\n\nAdvertisement\n\nAdvertisement\n\nOpening the case against Hussain on Tuesday, Andrew Smith QC, prosecuting, said Hussain was wearing a balaclava when he reversed the 4X4 away from an arriving police car.\n\nMeanwhile his accomplice Ahsan Ghafoor threw a house brick at oncoming officers.\n\nSeveral unmarked and marked cars had been sent to the scene after the Range Rover was seen driving dangerously, in convoy with another vehicle stolen from a furniture store car park.\n\nPC Phillips, who was was discharged from hospital last month after surgery, was among several officers who arrived at the scene on August 10 in three police vehicles.\n\nHe was in court for the sentencing hearing, but left along with several other people when recordings of the events were played.\n\nPC Philips was paid a visit by his pet dog Diesel while he recovered in hospital (Picture: SWNS)\n\nWest Midlands Police head of road policing Supt Dave Twyford leaves Birmingham Crown Court alongside PC Gareth Phillips (Picture: PA)\n\nFootage shows officers Tasering Hussain as he tried to resist arrest (Picture: PA)\n\nHussain was jailed for 12 years for GBH and 11 other offences (Picture: SWNS)\n\nMr Smith said Hussain, who has four previous conviction for crimes involving dangerous driving, ‘remained resistant even when a Taser device was used against him’.\n\nFootage shows Ghafoor being handcuffed and pinned to the ground near the Range Rover as Hussain emerged from the driver’s door.\n\nMr Smith added: ‘He began to get out of the car and was determined to use his physical strength to resist the police officers.\n\nAdvertisement\n\nAdvertisement\n\n‘Mr Hussain was described as looking in a rage and fired up. He reached the unmarked police car behind the Range Rover, despite being Tasered once more.’\n\nHe got into the drivers seat and reversed the police BMW, which had been left with its engine running due to the swift nature of the events, the court heard.\n\nDescribing the aftermath of Hussain driving over PC Phillip’s pelvic region, Mr Smith said: ‘The effect was immediately distressing.\n\nHelicopter footage shows Hussain on the run after knocking down PC Gareth Phillips (Picture: PA)\n\nAhsan Ghafoor was jailed for 28 months (Picture: SWNS)\n\nPolice officers at the scene in Sparkbrook, where Hussain stole the police BMW (Picture: SWNS)\n\n‘This was an extremely shocking and frightening incident for all of the police officers involved.’\n\n‘This series of recordings capture the critical events in a manner that requires no detailed commentary.’\n\nHussain, of no fixed address, was arrested in the Sparkbrook area by armed police after abandoning the police car and heading into a dessert shop, where he disguised himself in an apron and then punched a chasing officer.\n\nAddressing Hussain Judge Mark Wall QC, said: ‘You are a habitual dangerous driver. The level of your offending is increasing and not diminishing.\n\n‘The police made efforts to detain you. They took hold of you, ripped off your balaclava and Tasered you when you persistently refused to co-operate.\n\n‘None of this deterred you from your efforts to avoid being arrested.\n\nHe took shelter in a dessert shop before punching an officer who tried to arrest him (Picture: PA)\n\nPolice swooped in on the stolen Range Rover and wedged it between two cars (Picture: PA)\n\nPC Phillips has been left with ‘potentially life changing’ injuries (Picture: PA)\n\n‘PC Phillips has been left with potentially life-changing injuries. The surgeon who treated him regarded them as life-threatening.\n\nAdvertisement\n\n‘His victim impact statement makes it clear that the incident has had a dramatic impact on himself and his wife.’\n\nHussain admitted causing grievous bodily harm with intent to resist arrest, two counts of vehicle theft, dangerous driving, two counts of driving while disqualified, two counts of assault, assaulting an emergency worker, aggravated vehicle-taking, and two charges of having no insurance.\n\nHe was given a five year driving ban and an extended five year licence period following his eventual release.\n\nGhafoor, 24, of Sparkhill, Birmingham, was jailed for 28 months after admitting two counts of car theft and three driving offences including dangerous driving, having no insurance and driving other than in accordance with a licence.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Mubashar Hussain was jailed at Birmingham Crown Court for mowing down Gareth Phillips of West Midlands Poilice in a BMW after being Tasered.", "authors": ["James Hockaday"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_90045852_1571172429.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-15"}