{"pub": "metro", "url": "https://metro.co.uk/2019/10/14/disabled-woman-prisoner-bedroom-neighbours-wind-chimes-10912833", "downloaded_at": "2019-10-14 23:23:22.888118+00:00", "title": "Disabled woman a ‘prisoner’ in her bedroom ‘because of neighbour’s wind chimes’", "language": "en", "text": "Chrissie Bradby says she’s a prisoner in her own home (Picture: BNPS)\n\nA brain-damaged woman claims she is left ‘screaming in pain’ every time she hears her neighbour’s wind chimes.\n\nChrissie Bradby, 56, has a neuromuscular disease called dystonia which makes her muscles contract uncontrollably.\n\nShe says it’s made worse by high-pitched noises like car alarms, but for months she has been trying to escape noise coming from the garden next door.\n\nThe mother-of-one alleges it’s all down to some noisy wind chimes that have left her a ‘prisoner’ in her own home.\n\nMs Bradby says she is forced to hide upstairs in her bedroom, as it’s the only room where she can’t hear them.\n\nShe told Metro.co.uk: ‘They’re actually nine feet from my dining room window.\n\nChrissie Bradby suffers from a neuromuscular disease called dystonia (Picture: BNPS)\n\nChrissie Bradby claims high-pitched noises leave her screaming in pain (Picture: BNPS)\n\n‘I can also hear them in my bathroom and in my stairwell. The other only place I don’t hear them is in my bedroom.\n\nAdvertisement\n\nAdvertisement\n\n‘So I’ve been a prisoner in my bedroom except when I’ve had to go out and get shopping.’\n\nMs Bradby, who is unemployed and on disability benefit, says she has never been able to tolerate high pitched noises, with certain sounds leaving her in a ‘state of complete exhaustion’.\n\nShe said: ‘I’ve ended up screaming with pain. It’s been a gradual deterioration in my health.\n\n‘I have a very rare neuromuscular disease called dystonia and I’ve had brain surgery to halt it. That’s left some small brain damage. Not intellectually or anything like that, it’s physical.’\n\nShe added: ‘These wind chimes have been up since March. It started with headaches and nerve pain on my left side.\n\n‘And now I’m getting very strong muscle spasms and I’m getting auras as if I’m going to have an epileptic fit.\n\nChrissie says she is forced to hide upstairs in her bedroom (Picture: BNPS)\n\n‘I’ve had to triple the medication I take and I also have to use alcohol to help me relax.\n\n‘Otherwise I’m just a ball of tension and pain. My doctor has given me a letter to show to the police.\n\n‘It’s not a legal matter because there is no law that prevents them from hanging these wind chimes right next to my boundary.’\n\nMs Bradby claims Quay Living, which rents out the property in Poole, Dorset, have accused her of being anti-social and will not move the wind chimes.\n\nAdvertisement\n\nAdvertisement\n\nHelen Challis, a partner at Quay Living, said they had reported Ms Bradby to the police for harassing their tenants and warned her not to contact them.\n\nChrissie alleges she’s had to triple her medication to cope with the wind chimes (Picture: BNPS)\n\nMs Challis refused to add any further comment.\n\nAn officer from the council’s environmental health department did investigate the dispute and found that even in ‘high winds’, there was no was ‘no significant noise’ from the wind chimes.\n\nKelly Ansell, director of communities at Bournemouth, Christchurch and Poole Council, said: ‘BCP Council has investigated, attended both properties and worked with colleagues from Environmental Health to access any noise from the wind chimes.\n\n‘Even during high winds, the noise has not been deemed to be significant. We will not be taking any further action.’\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "She claims the high-pitched wind chimes leave her screaming in pain.", "authors": ["Joe Roberts"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_88804431_1571068500.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-14"}