{"pub": "news.com.au", "url": "https://news.com.au/sport/rugby/rugby-world-cup/rugby-world-cup-2019-world-reacts-to-englands-semifinal-victory-over-all-blacks/news-story/60e5e06d974239c08bc6eff927e36b9f", "downloaded_at": "2019-10-27 00:03:56.529307+00:00", "title": "Rugby World Cup 2019: England beat All Blacks, reaction, Steve Hansen, Eddie Jones, Niall Horan", "language": "en", "text": "Rugby World Cup: The All Blacks gave a typically stirring rendition of the Haka, however this time around England were prepared to step forward and meet them.\n\nEngland have stunned the world with an incredible 19-7 win over the All Blacks to seal a place in the World Cup final.\n\nFrom the opening moments of the game, it was heated and tense with a remarkable stare down over the haka.\n\nAnd from there England proceeded to dominate their way past the back-to-back titleholders.\n\nHere’s how everyone reacted to the boilover.\n\nMissed England v New Zealand? Stream the Kayo Mini replay with KAYO SPORTS on your TV, computer, mobile or tablet. Get your 14-day free trial and start streaming instantly\n\nHANSEN SNAPS AT ‘DISRESPECTFUL’ QUESTION\n\nNew Zealand coach Steve Hansen lashed out at a journalist in the post-match press conference, slamming a “disrespectful” question and offering him to “spend some time outside”.\n\nIn shades of Michael Cheika’s final press conference of the World Cup, a reporter asked captain Kieran Read if the side was “hungry” enough.\n\nWhile the captain delivered a gracious answer, Hansen gave a furious response.\n\n“I think it’s quite a disrespectful question to suggest that the All Blacks turned up not hungry,” Hansen said.\n\n“They’re desperate to win the game — just because I’ve asked them at halftime to get hungrier doesn’t mean they didn’t turn up to be hungry.\n\n“There’s a big difference and if you want to spend some time outside, I’ll give you a rugby education on that one.\n\n“To turn up and say that an All Blacks team comes to a semi-final of the Rugby World Cup with the amount of ability and the history that it’s had behind it — that’s a pretty average question, I reckon.”\n\n\"If you want to spend some time outside, I'll give you a rugby education on that one\" 😳.#RWC2019 #ENGvNZL #bbcrugby pic.twitter.com/qc6JqXGrkd — BBC Sport (@BBCSport) October 26, 2019\n\nHansen admitted England played “tremendous footy” and that the side deserved the win with their ruthless approach.\n\n“You can’t give them half a sniff because they will take it,” Hansen said.\n\nThe Daily Telegraph’s rugby reporter Jamie Pandaram savaged some of Hansen’s decisions with other piling on for some tactical decisions that didn’t pay off.\n\nHansen stuffed up. SBW should’ve started, and lineout target backfired with England dominating turnovers. Gatland or Scott Robertson need to start the rebuild for 2023 #NZLvENG #RWC2019 — Jamie Pandaram (@JamiePandaram) October 26, 2019\n\nHansen will have a real mauling for some of his decisions around selection in this game and tournament. #ENGVSNZL — Darren Waters (@darrenwaters) October 26, 2019\n\nHow do I get picture in picture of Hansen disintegrating? #NZLvENG — Matt Rowley (@MattRowley) October 26, 2019\n\nSTUNNED ALL BLACKS’ CLASSY CUP MOMENT\n\nThe All Blacks were understandably shell-shocked after the loss.\n\nWith the likes of inspirational captain Read retiring and Hansen moving on from his post as coach, it’s bound to be a big shift for New Zealand rugby.\n\nA bloodied Read spoke emotionally after the game, ending his incredible career with a remarkable first — his first loss for New Zealand in three World Cups.\n\n\"It's pretty hard to put it into words ... but you gotta give England credit, they started extremely well\"\n\n\n\nAll class from @AllBlacks skipper Kieran Read after his side's Semi Final loss to England 🏴󠁧󠁢󠁥󠁮󠁧󠁿 #ENGvNZL 🇳🇿 #RWC2019 pic.twitter.com/WNr5gaCegQ — 10 Sport (@10SportAU) October 26, 2019\n\nWhile some were questioning England’s haka challenge before the match, there was clear respect by both teams after full-time.\n\nDespite vanquishing the all-conquering All Blacks, England formed a guard of honour for New Zealand, clapping the Kiwis off the field.\n\nGreat respect shown by two great teams after a tough 80 minutes on the pitch.#ENGvNZL #RWC2019 #WebbEllisCup pic.twitter.com/12OO0XvK2f — Rugby World Cup (@rugbyworldcup) October 26, 2019\n\nAfter a battle that left both sides bloodied and beaten and nursing injuries, there was plenty of respect between the teams.\n\nHow much class is there in the game of Rugby? THE most physical of games! At the end of the game.... respect shown by both sides and congratulatory hand shakes..... followed by a guard of honour by each team. Football could learn a lot! — Dean Andrews (@Deanoandrews) October 26, 2019\n\nThis is what sport is all about 👏\n\n\n\nAn 80 minute battle for a place in rugby's showpiece game but afterwards it's all about respect 🤝\n\n\n\n🏴󠁧󠁢󠁥󠁮󠁧󠁿 Sport. Unites. Us 🇳🇿#RWC2019 #ENGvNZL #WebbEllisCup #RWCYokohama pic.twitter.com/bH0kdtn2Wb — Laureus (@LaureusSport) October 26, 2019\n\nKING EDDIE MASTERMINDS ENGLISH DOMINATION\n\nEngland coach Eddie Jones inspired a team to a World Cup final for the second time after guiding the Wallabies to the big dance in 2003 in Australia.\n\nJones was also a consultant for South Africa on their way to the 2007 win as well as guiding Japan to a shock victory over the Springboks at the 2015 World Cup.\n\nBut despite masterminding this latest upset he downplayed the result, saying England had ”another week of action in the comp now”.\n\n“You want to go right to the death and we’re in the death now,” he told the BBC. “We’ve got another week to enjoy ourselves and work as a team. Our players made a commitment to each other that they’d enjoy the World Cup and I think we’re seeing that.”\n\nIt’s actually been a trend for English sides this year with the cricket side also claiming the World Cup for the first time.\n\nWhile it is the fourth time England have made the Rugby World Cup final, it would be the second title for the nation if they were able to lift the trophy next Saturday night.\n\nBut the parallels between the cricket and rugby triumphs were clear, with the Barmy Army dropping a slice of gold on Twitter to celebrate the victory.\n\nIt came as the world reacted the result.\n\nFormer English rugby stars were all for it.\n\nImmense!! Individually and together as a team....immense! On to next week's final. Can't wait! — Jonny Wilkinson (@JonnyWilkinson) October 26, 2019\n\nThe greatest 41st birthday ever ... Manu, Maro, Ford, underhill, curry ... everyone amazing .. watched in paradise @Soneva_Kiri #discoversoneva #paradise Wales in the final?? — Austin Healey (@IamAustinHealey) October 26, 2019\n\nBut the result hit too close to home for New Zealand cricketer Jimmy Neesham.\n\nI think that just about covers it. pic.twitter.com/IAetFuXk4W — Jimmy Neesham (@JimmyNeesh) October 26, 2019\n\nEnglish football great Gary Lineker was also the voice of many people in England who were jumping on the bandwagon after moving past the world’s best.\n\nI’m already an expert on this rugby malarchy, and confidently predict that England will beat the Germans in the final. Come On England. — Gary Lineker (@GaryLineker) October 26, 2019\n\nBut not all are happy with the bandwagon fans with former One Direction star Niall Horan slamming the fairweather supporters.\n\nThe thoughts of listening to so called English rugby fans now, makes me sick. — Niall Horan (@NiallOfficial) October 26, 2019\n\nThey are phenomenal. One of the best performances I’ve seen in a long time but...... the fans will be unbearable — Niall Horan (@NiallOfficial) October 26, 2019\n\nHansen selection of Barrett at 6 isn't working. England tight five hammering NZ with unbelievable defense but also offering so much going forward. Ford has options everywhere. Impressive #ENGvNZL — Darren Waters (@darrenwaters) October 26, 2019\n\nSKIPPER’S NOW ICONIC SMIRK\n\nThe haka stare down was a brilliant piece of theatre to start the game with England illegally walking over the halfway line in a V formation.\n\nThe haka drama also delivered one of the iconic images of the World Cup, with English skipper Owen Farrell smirking at the All Blacks’ traditional war dance.\n\nBBC reporter James Waterhouse said on Twitter it “will age brilliantly. Or terribly.”\n\nTurns out it worked out alright for the Poms.\n\nAfter the match, Farrell said his side wanted to get in their faces.\n\n“We didn’t want to just stand there and let them come at us,” he said. “We wanted to keep a respectful distance, but we didn’t want to stand in a flat line and let them come at us.”\n\nThis was actually brilliant, and part of the psychological warfare that the Haka represents. #AllBlacks taken aback. Our boys make own visual, V for Victory. Owen Farrell’s confident, amused face. Undermined NZ before the whistle even blew. https://t.co/cvj2xW3J2u — Louise Mensch (@LouiseMensch) October 26, 2019\n\nThe moment I saw Owen Farrell smirk at the haka I knew it would be England’s day. An absolutely MONUMENTAL performance by every Englishman on that pitch. #ENGvNZL #RWC19 #CarryThemHome 🏴󠁧󠁢󠁥󠁮󠁧󠁿🌹 pic.twitter.com/UNTwtxGpys — Jess Long (@JessCiara) October 26, 2019", "description": "England have stunned the world with an incredible 19-7 win over the All Blacks to seal a place in the World Cup final.", "authors": ["Andrew Mcmurtry"], "top_image": "https://cdn.newsapi.com.au/image/v1/133c5e4be0471b83e2fa56b37f23e2aa?width=650", "published_at": "2019-10-26"}