{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/education/a-historically-black-college-in-maryland-is-growing--by-enrolling-hispanic-white-and-international-students/2019/10/09/64185318-def3-11e9-be96-6adb81821e90_story.html", "downloaded_at": "2019-10-09 22:06:13.465659+00:00", "title": "A historically black college in Maryland is growing — by enrolling Hispanic, white and international students", "language": "en", "text": "No one expects that only Catholic students will enroll at Notre Dame, Morgan President David Wilson says. So why should anyone be surprised that a historically black college or university would recruit students of other races?\n\nAD\n\n“Morgan has never said to a student, ‘You can’t come here because of your race,’ unlike the traditionally white institutions in the state of Maryland,” Wilson said. “Morgan is an HBCU. It will always be an HBCU.”\n\nAD\n\nHistorically black schools across the country are making similar diversity pushes, partly because African American enrollment alone is not enough to sustain them when traditionally white schools are doing more to recruit minorities.\n\nIn Morgan’s case, the rise in enrollment shows that a years-long campaign to become more diverse is having some effect. The growth is especially significant as a coalition of HBCU advocates remains locked in litigation with the state over allegations that Maryland for decades fostered segregation in its higher education system by providing more money to traditionally white schools at the expense of historically black ones.\n\nAD\n\nSince 2006 — the year the coalition filed its lawsuit — Hispanic student enrollment at Morgan has more than quadrupled, jumping from 60 students to more than 260.\n\nAD\n\nWhite enrollment at Morgan, the largest of the state’s four HBCUs, went up 30 percent in that time period. The number of Asian students nearly doubled, and international student representation exploded.\n\nMeanwhile, the number of African Americans held relatively flat, although they now represent 79 percent of the student population.\n\nThe pattern is seen at HBCUs across the country. In 2017, about 25 percent of students enrolled at historically black institutions were not African American. Just a quarter of a century earlier, national data show, nonblack students accounted for only about 15 percent of students at these schools.\n\nAD\n\nHBCU leaders are proud of their institutions’ history of providing an education to black students at a time other state universities barred them. But they are also clear about their goal for the future: continuing to enroll more diverse student bodies.\n\nAD\n\nThe reasons are both philosophical and practical.\n\n“HBCUs wisely are opening themselves up to students beyond the black community in order to remain sustainable. The ones who don’t do that are probably going to close,” said Anthony Bradley, a professor at the King’s College in New York who studies HBCUs.\n\n“Is it going to change on-campus culture? Yes. Will it change some of their traditions? Yes. Will things be lost? Absolutely. But if they are going to survive, given the competition for African American students, they don’t have a choice to have a moral debate about whether this change is good or bad.”\n\nAD\n\nMalaika Geffrard of Atlanta chose to attend Morgan State because she wanted to be in a place where most everyone — from the professors to the janitorial staff — looked like her. After going to predominantly white schools throughout her childhood, she thought a historically black institution would bring her the kind of peace that comes with knowing a teacher won’t make a snide comment about her hair, she said.\n\nAD\n\nStill, Geffrard embraces the growing diversity on campus.\n\n“Yes, new faces are coming into our space,” the 23-year-old Morgan junior said. “But that doesn’t change the purpose of our space.”\n\nRachel Field, 19, has loved getting to know people from other backgrounds, especially after leaving what she described as “the least diverse high school” where nearly everyone in her 69-person graduating class in Arizona was white, as she is. She believes an educational experience like hers at Morgan — being a member of the majority thrust into the minority — can help people break down stereotypes.\n\nAD\n\nAlthough racial diversity at Morgan rose since 2006, a wider lens reveals the white student population still lags behind where it was in the decades after the U.S. Supreme Court’s landmark school desegregation decision in Brown v. Board of Education.\n\nAD\n\nMaryland’s historically black institutions reported 18 percent white undergraduate enrollment in 1976, according to court documents. By 2008, the figure had dropped to 3 percent.\n\nDuring that period, in-demand programs — such as a master of business administration degree — offered at the state’s HBCUs were copied by predominantly white schools, which is a basis for the lawsuit. If the HBCUs had more one-of-a-kind programming, the plaintiffs’ lawyers argue, they would be able to recruit more students of all backgrounds.\n\nAD\n\n“Morgan has always strived to have a diverse student body,” said attorney Mike Jones, who represents the coalition that sued the state on behalf of Maryland’s HBCUs. “The only thing that has stood in the way has been the lack of programmatic and financial resources.”\n\nSteeped in history\n\nTwo years after the Civil War ended, a Baltimore church founded what would become Morgan State University. The school stayed private until 1939, when the state purchased it to create an institution for African Americans who were legally denied entry to Maryland’s white schools.\n\nAD\n\nIt was designated an HBCU in 1965, a status held today by roughly 100 institutions nationally.\n\nAD\n\nToday, many of these schools are a celebration of black culture. There are exuberant marching bands, famous homecoming celebrations and “Soul Food Wednesdays” in the cafeterias. A digital sign at the entrance to Morgan’s campus occasionally displays the message: “Where Black Lives Have Always Mattered.”\n\nFor decades, HBCUs educated much of the black middle class, boasting alumni such as Toni Morrison, Oprah Winfrey and Spike Lee. But their role within the American education ecosystem is evolving.\n\nAt a handful of historically black colleges across the country, African American students are now in the minority. Bluefield State in West Virginia — created to educate the children of black coal miners — was 85 percent white last fall. One of the country’s largest historically black institutions, St. Philip’s College in Texas, is 56 percent Hispanic.\n\nAD\n\nAD\n\nA 1968 Bluefield State graduate, William White, told Time magazine that when he returned to the campus and found it to be majority white, it was “the worst feeling I’ve ever had in my life.”\n\nBlack students are still in the majority at Maryland’s four HBCUs. At Morgan State, Bowie State and Coppin State, African American enrollment hovers around 80 percent. At the University of Maryland, Eastern Shore, it’s 63 percent.\n\nHans Cooper, UMES vice president for enrollment management, said the school’s unique programs — majors such as aviation management and construction management technology — attract students from all backgrounds.\n\nStill, some HBCU leaders say they have to contend with reputation concerns when trying to recruit. Some schools nationally have been beset by financial problems, accreditation difficulties, poor graduation rates and declining enrollment.\n\nAD\n\nCoppin State is looking to recruit students of diverse backgrounds not only to stanch a dramatic enrollment decline — a 32 percent drop since 2006 — but also because administrators believe it could improve the school.\n\n“We do believe that an educational experience that is diverse and has students from various ethnic and economic backgrounds is the richest kind of educational experience to afford students,” said Mickey L. Burnim, Coppin’s interim president.\n\nSome HBCUs nationwide are seeing a new wave of interest, which administrators have anecdotally tied to President Trump’s divisive rhetoric.\n\nJavier Renderos grew up in Prince George’s County, where about 65 percent of people are black and 20 percent are Hispanic.\n\nHe saw Morgan as a place of comfort at a time of increased racial tensions. Though he is not black, he says that as a Latino he understands the sting of racism and appreciates the solace an HBCU campus brings.\n\nNow a senior, he says he’s noticed more and more students who look like him on campus.\n\n“I’d rather be a minority among other minorities,” Renderos, 21, said. “I felt more comfortable being amongst what I grew up around.”\n\nA changing campus\n\nSigns of increased diversity are apparent at Morgan. A new multicultural sorority is built on the idea of creating an academic and social network for Latina women. The first student to speak in the university’s promotional video is a white woman. The school opened a Division of International Affairs five years ago.\n\nForeign students, especially from Saudi Arabia and Kuwait, are a booming demographic at HBCUs. At Morgan, 738 international students were enrolled in fall 2018, up from 286 in 2006. These students often pay full tuition, a monetary boost for schools that often serve students from low-income families relying on financial aid.\n\nA couple weeks into the school year, the Latinx Student Association and the Caribbean Student Association hosted a “Rep Your Flag” event in the student center. They blasted upbeat music and took pictures with the flags symbolizing their heritage.\n\nStudents from both organizations say they have seen more interest in the past few years.\n\nSophomore Alexandrea Leger, who identifies as Afro-Latina, said she appreciates that at Morgan, she’s not seen as just a person of color.\n\n“We’re seen as people,” said Leger, 19. “You’re going to be a minority your whole life. It’s nice to have this time to be part of a majority.”", "description": "HBCUs across the country are making similar pushes to diversify their campuses.", "authors": ["Talia Richman"], "top_image": "https://www.washingtonpost.com/resizer/K3KUiPxPhL9SCojvyQYiAUZWKuQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/56IDLDXBLAI6TPT7JTEFAF6DN4.jpg", "published_at": "2019-10-09"}