{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7580443/Sheffield-United-boss-Chris-Wilder-says-team-confident-prepare-host-Gunners.html", "downloaded_at": "2019-10-16 21:42:09.907968+00:00", "title": "Sheffield United boss Chris Wilder says his team are confident as they prepare to host Gunners", "language": "en", "text": "Sheffield United manager Chris Wilder has promised his players will be full of confidence going into Monday night's home clash with Arsenal.\n\nThe Blades have made a decent to the Premier League season and are 13th having picked up nine points from eight games, with two wins and a point away at Chelsea.\n\nWhile Arsenal are sitting in third place, just a point behind second-placed Manchester City, Wilder believes his side can come away with a result after narrowly losing to leaders Liverpool in their last home game.\n\nChris Wilder's men took a point away at Chelsea and narrowly lost to league leaders Liverpool\n\n'Arsenal are an historic, iconic club and it is another brilliant fixture for us as a football club,' he said.\n\n'I thought we played well against Liverpool but we need to pick up something from the game this time and we believe we can do that. We went after Liverpool when we could and picked our times, and we will do that against Arsenal.\n\n'We are competitive and we fancy our chances and we are bullish. At the same time, however, understanding the threat and pace and power that Arsenal have in the top end of the pitch - we must respect that.'\n\nThe Blades will make their return to Premier League action in front of the television cameras on Monday night, giving boss Chris Wilder extra time to finalise his plans following the international break.\n\nThe Blades are hopeful of making an impact in the league this season after being promoted\n\nInjured trio John Fleck, Oli McBurnie and David McGoldrick will be given every opportunity to prove their fitness ahead of the game. McGoldrick missed Republic of Ireland's Euro 2020 qualifiers with the groin injury, while fellow striker McBurnie pulled out of the Scotland squad with a knee problem.\n\nMeanwhile, midfielder Fleck made his Scotland debut in the defeat in Russia before also withdrawing from the squad through injury ahead of the win against San Marino.\n\nWilder said: 'We'll give them as much time as possible. They are important players for us so we will give them enough time and opportunities to be available for Monday night.\n\n'We can't take risks on them and take a big gamble of sticking them out there, that wouldn't be fair on the fit players either.'\n\nArsenal will provide a stern test at Bramall Lane, with Unai Emery's side unbeaten since August\n\nGoalkeeper Dean Henderson has already returned fit and well from England duty and Wilder is hoping Republic of Ireland trio Enda Stevens, John Egan and Callum Robinson do likewise.\n\nHe said: 'The international boys will be back in today, so fingers crossed that they come back healthy - and early indications are that they are okay.\n\n'We've talked about how proud we are that a few of our boys are involved on the international scene now and a couple of them had tough games last night for the Republic (of Ireland).\n\n'We want as much time to prepare as possible and playing on the Monday night does give us an extra couple of days to do that, which we need when we are coming up against a side as tough as Arsenal.'", "description": "The Blades have made a promising start to the Premier League season having picked up nine points from eight games, with two wins and a point away at Chelsea.", "authors": ["Pa Sport Staff"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/17/19796634-0-image-a-20_1571243974139.jpg", "published_at": "2019-10-16"}