{"pub": "businessinsider", "url": "https://businessinsider.com/white-claw-vs-truly-which-hard-seltzer-better-2019-9", "downloaded_at": "2019-09-12 23:44:15.288444+00:00", "title": "We compared leading hard seltzer brands White Claw and Truly — and the winner was clear", "language": "en", "text": "There may be a temporary White Claw shortage, but that doesn't mean we can't compare the top-selling hard seltzer brand with one of its main competitors: Truly.\n\nEven as the days grow shorter and the air turns brisker, demand for the unofficial drink of the summer is showing no signs of stopping. While White Claw is \"working around the clock to increase supply given the rapid growth\" — according to Sanjiv Gajiwala, senior vice president of marketing at White Claw, speaking to Business Insider last week — we figured we'd see if it's worth the wait.\n\nLooking strictly at ingredients, White Claw and Truly are nearly identical. Both are brewed using a mix of seltzer water, a gluten-free alcohol base, and a touch of flavor. A can of each sets you back just 100 calories and contains 5% alcohol by volume. The only difference comes down to carbs — while White Claw has 2 grams, Truly has just 1.\n\nRead more: White Claw says it's 'working around the clock' to increase production of the wildly popular hard seltzer amid complains of shortages across the US\n\nWhat Truly lacks in carbs it makes up for in flavors. The brand boasts 13 total flavors across variety packs of tropical, citrus, and berry, as well as a rosé-flavored water. Meanwhile, White Claw keeps it simple with five core, fruit-based flavors and its limited-edition flavorless offering called \"Pure.\"\n\nA group of fellow Business Insider colleagues and I recently sampled select flavors from both brands and found that when it comes to hard seltzer, there's a reason White Claw is flying off shelves. Despite its structural similarities with Truly, White Claw just tasted better all around. The group unanimously came to the conclusion that Claw is indeed the law.\n\nRead more of our thoughts on both, and why we thought White Claw came out on top, below.", "description": "Business Insider tested White Claw and competitor Truly to compare the two leading brands. In the end we couldn't deny that Claw is the law.", "authors": ["Bethany Biron"], "top_image": "https://amp.businessinsider.com/images/5d79594a2e22af0987013067-1920-960.jpg", "published_at": "2019-09-12"}