{"pub": "heritage", "url": "https://heritage.org/immigration/commentary/liberals-try-derail-census-case-fake-news", "downloaded_at": "2019-09-04 04:12:42.856586+00:00", "published_at": "2019-09-04", "title": "Liberals Try to Derail Census Case With Fake News", "language": "en", "text": "Some liberals are terrified that the Supreme Court will allow the Trump administration to reinstate a citizenship question on the census. Why? Because they do not want accurate information about the number of noncitizens living in the United States. Their latest ploy is an attempt to “improperly derail” the resolution of this case, the Justice Department wrote in a letter this month. They are relying on the kind of false claim that President Trump would call fake news, arguing government lawyers “lied” about the reasons for reinstating the citizenship question on the census.\n\nAt the heart of the motion by the plaintiffs to reopen the evidence and sanction the government is their claim, which the Justice Department itself says “borders on frivolous,” that Thomas Hofeller, a Republican National Committee redistricting expert, had supposedly influenced the decision to reinstate the citizenship question through a 2015 study, and that Trump administration officials failed to reveal his involvement. The circumstances under which lawyers for the plaintiffs got hold of this study and other possibly privileged documents are highly questionable from an ethical perspective. The New York Times wrote the estranged daughter of Hofeller gave lawyers his computer files after he passed away last year.\n\nHis study, which was never published, pointed out the likely effect on redistricting. If citizen population is used to draw district lines rather than total population, Republicans may benefit, as would Hispanics, a majority of whom vote for Democrats. His conclusions are hardly earth shattering. I wrote about this likely effect in 2015, as did others, when the Supreme Court was reviewing the use of citizen population in the redistricting process in Sue Evenwel versus Greg Abbott. It is certainly no big secret.\n\nThe plaintiffs also try to make much about Hofeller pointing out problems with the accuracy of the citizenship data from the American Community Survey sent by the Census Bureau to a limited number of households. Why? Because John Gore, former assistant attorney general for civil rights, listed the same problems when his office sent a letter to the Commerce Department in 2017 asking that a citizenship question be reinstated to assist in enforcing the Voting Rights Act. This, according to lawyers for the plaintiffs, is evidence of some secret official conspiracy.\n\nBut as the Justice Department correctly tells the Supreme Court, the problems with the American Community Survey are publicly known and have been “discussed in case law and academic literature for years.”The Justice Department says the claim by the plaintiffs that Gore relied on the unpublished study is false. It says the plaintiffs provided no evidence that Gore read or “was even aware of the existence” of the unpublished study. Such evidence “does not exist” and there is “no smoking gun\" on this.\n\nThe claim by the plaintiffs is “pure speculation”due to supposed “striking similarities” between the study and the letter. But according to the Justice Department, even a “cursory comparison of the two documents” shows that they are “not strikingly similar.” In fact, the “pattern matching exercise reads more like the product of a conspiracy theorist than a careful legal analysis.”The letter is actually much more similar to the briefs filed in Sue Evenwel versus Greg Abbott. It is probably no surprise the letter bears what some may consider similarities to, for instance, the brief filed by former Census Bureau directors. Other briefs in the case also used similar language about known problems with the American Community Survey.\n\nThe Justice Department says the plaintiffs showed no evidence to support their claims, other than speculation that the study somehow got to the Justice Department through “mysterious and unidentified channels.” But the Justice Department says the study was never in possession of Gore. The plaintiffs also offered this nonsensical claim about supposedly not knowing that Gore himself had a draft letter from a private expert for the Commerce Department. But the Justice Department turned over that draft to the plaintiffs months ago. They never asked Gore about the draft letter, and their “obliviousness is not a valid basis to sanction the government.”\n\nThe bottom line is that the challengers have produced no evidence that government officials lied or hid the reasons for adding the citizenship question to the census. The Justice Department says this is a “baseless attack” on its integrity, based on “nothing more than fevered speculation” and “supposed new evidence” that the plaintiffs had known about for months. This is a last ditch effort to prevent the Supreme Court from ruling in favor of the Trump administration. That may or may not happen, since one cannot predict how the justices will rule. But it is much ado about nothing and must certainly not derail the resolution of the case.", "description": "Some liberals are terrified that the Supreme Court will allow the Trump administration to reinstate a citizenship question on the census. Why? Because they do not want accurate information about the number of noncitizens living in the United States. Their latest ploy is an attempt to “improperly derail” the resolution of this case, the Justice Department wrote in a letter this month.", "authors": ["Hans Von Spakovsky", "Election Law Reform Initiative", "Senior Legal Fellow", "Hans Von Spakovsky Is An Authority On A Wide Range Of Issues", "Including Civil Rights", "Civil Justice", "The First Amendment"], "top_image": "https://www.heritage.org/themes/heritage/src/images/bell.png"}