{"pub": "businessinsider", "url": "https://businessinsider.com/9-19-2019-report-the-future-of-life-insurance-b-2019-9", "downloaded_at": "2019-09-19 09:38:49.536279+00:00", "title": "[Report] Future of Life Insurance Industry: Insurtech & Trends in 2018", "language": "en", "text": "Life insurance is a fundamentally difficult product to sell; it requires people to think about their deaths without promising any immediate returns.\n\nBII\n\nAnd, despite tech innovations and the development of personalized services in other areas of finance, life insurance remains largely unchanged.\n\nLuckily, there is a small but growing pocket of insurtech startups looking to modernize it. These companies are finding ways to digitize life insurance to appeal to consumers — and they're giving incumbents the opportunity to revamp traditional offerings, either by partnering with them or using their technology.\n\nBusiness Insider Intelligence, Business Insider's premium research service, has forecasted the shifting landscape of life insurance in the The Future of Life Insurance report. Here are the key problems insurtechs are tackling: Business Insider Intelligence\n\nLack of education: Forty percent of US consumers told the Life Insurance and Market Research Association (LIMRA) that they feel intimidated by the life insurance application process, often drastically overestimating its cost and facing uncertainty about how much or which type of coverage to buy.\n\nForty percent of US consumers told the Life Insurance and Market Research Association (LIMRA) that they feel intimidated by the life insurance application process, often drastically overestimating its cost and facing uncertainty about how much or which type of coverage to buy. Inconvenient application process: It can take weeks or months for coverage to take effect because of the sheer number of meetings and parties combing through paperwork in each round of the application process. The risk for the insurer often warrants reviews from the carrier, a team of underwriters, a broker, and even a medical examiner.\n\nIt can take weeks or months for coverage to take effect because of the sheer number of meetings and parties combing through paperwork in each round of the application process. The risk for the insurer often warrants reviews from the carrier, a team of underwriters, a broker, and even a medical examiner. Low customer loyalty: Life insurance tends to be a \"set it and forget it\" type of purchase, with very few people revisiting it after buying. Insurers and consumers therefore have limited contact for most of the relationship — with the exception of an annual bill, of course.\n\nLife insurance tends to be a \"set it and forget it\" type of purchase, with very few people revisiting it after buying. Insurers and consumers therefore have limited contact for most of the relationship — with the exception of an annual bill, of course. Inefficient data management and processing: The aggregate data life insurers rely on is typically fed into algorithms that make broad assumptions about particular populations, and often incorporate outdated medical documentation — all of which can delay applications and result in unnecessary rejections.\n\nWant to learn more?\n\nThe need for modernization in life insurance is clear: Overall sales are slowing and policy ownership is hitting record lows. And because it's such a tightly-regulated space, innovation from incumbents has stagnated — but they're not helpless. Consumer-focused and insurer-focused startups have emerged to offer new technologies and process improvements.\n\nThe Future of Life Insurance report from Business Insider Intelligence looks at the two main strategies life insurtechs are adopting to drive change in this market, for the benefit of both buyers and sellers. In full, the report discusses best practices incumbents and startups should adopt to steer clear of the risks attached to applying emerging technologies to such a tightly regulated product.\n\nInsurtech startups will soon set new industry standards and consumer expectations around this complex product. That, in turn will serve as a catalyst for innovation among legacy players.\n\nCompanies included in this report: Ladder, Haven Life, Getsurance, Tomorrow, Fabric, Atidot, AllLife, Royal London, Polly, Life.io, Legal & General, Vitality, Discovery, John Hancock, Dai-ichi Life.\n\nIn full, the report:\n\nExplains the factors contributing to a swell in global noncash payments\n\nExamines shifts in the roles of major industry stakeholders, including issuers, card networks, acquirer-processors, POS terminal vendors, and gateways\n\nPresents forecasts and highlights major trends and industry events driving digital payments growth\n\nIdentifies five trends that will shape the payments ecosystem in the year ahead\n\nInterested in getting the full report? Here are two ways to access it:\n\nPurchase & download the full report from our research store. >> Purchase & Download Now Subscribe to a Premium pass to Business Insider Intelligence and gain immediate access to this report and over 100 other expertly researched reports. As an added bonus, you'll also gain access to all future reports and daily newsletters to ensure you stay ahead of the curve and benefit personally and professionally. >> Learn More Now Join thousands of top companies worldwide who trust Business Insider Intelligence for their competitive research needs. >> Inquire About Our Corporate Memberships Current subscribers can read the report here.\n\nThe choice is yours. But however you decide to acquire this report, you've given yourself a powerful advantage in your understanding of the fast-moving world of Insurtech.", "description": "The Future of Life Insurance report from Business Insider Intelligence looks at the two main strategies life insurtechs are adopting to drive change in this market, for the benefit of both buyers and sellers.", "authors": ["Shelagh Dolan"], "top_image": "https://amp.businessinsider.com/images/5b6b190b1982d8c4308b4806-640-320.jpg", "published_at": "2018-09-06"}