{"pub": "metro", "url": "https://metro.co.uk/2019/10/12/jose-mourinho-was-against-fred-joining-manchester-united-in-52million-deal-10904213", "downloaded_at": "2019-10-12 02:07:39.647672+00:00", "title": "Jose Mourinho didn't want Man Utd to sign Fred and only agreed for one reason", "language": "en", "text": "The Brazilian has struggled to live up to his significant price tag at Old Trafford (Picture: Getty)\n\nJose Mourinho was not in favour of the signing of Fred but reportedly felt Manchester United’s transfer team would not bring in a new midfielder if he vetoed the move.\n\nThe Brazilian has struggled since leaving Shakhtar Donetsk in a £52million deal in the summer of 2018, with his first-team opportunities limited under both Mourinho and successor Ole Gunnar Solskjaer.\n\nIn the final six Premier League games of Mourinho’s tenure, Fred played just once – 17 minutes against Fulham – while he has only started eight league games under Solskjaer.\n\nFred made his first Premier League start of the season in the defeat to Newcastle (Picture: Getty)\n\nThe likes of Scott McTominay and Andreas Pereira have been preferred to Fred and he has only made one start in the Premier League this season as a result, in last Sunday’s 1-0 defeat away to Newcastle.\n\nAdvertisement\n\nAdvertisement\n\nUnited’s decision to spend so much on Fred has been heavily criticised, though The Athletic claim Mourinho never wanted him in the first place.\n\nThe Portuguese coach endured a frustrating summer transfer window, denied the centre-back signing he had made a priority, and was left with just Fred, Diogo Dalot and backup keeper Lee Grant.\n\nAlthough Mourinho had the power to veto signings, he sensed a lack of backing from the club’s hierarchy and only agreed to sign Fred because he felt he would not receive a new midfielder at all if he turned his nose up at the Brazilian.\n\nThe Athletic’s report also claims that Mourinho changed his mind suddenly on a host of pre-agreed targets at the tail-end of the 2017-18 season, which partly accounted for the lack of backing.\n\nMourinho didn’t rate Fred but felt he was better than no new midfielder at all (Picture: Getty)\n\nFred has failed to pull up any trees under Solskjaer, with the Norwegian saying of the midfielder over the summer: ‘Well, I think you’re not surprised when a player who has played in Ukraine finds it a little bit hard in the beginning. But we know the talent is there.\n\n‘We’ve seen, towards the end of [last] season, what Fred can give us: the PSG game, the Arsenal and Man City games. And, of course, he’s one that we hope is going to take another step this season. Hopefully, missing 10 days of our pre-season [to get married] won’t set him back too much.’\n\nAdvertisement\n\nAdvertisement", "description": "Jose Mourinho was not in favour of the signing of Fred but reportedly felt Manchester United’s transfer team would not bring in a new midfielder if he vetoed the move....", "authors": ["Metro Sport Reporter"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1178207638_1570838658.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-12"}