{"pub": "yahoo", "url": "https://news.yahoo.com/lebanon-shiites-mark-ashura-show-anti-israel-defiance-132444762.html", "downloaded_at": "2019-09-11 07:27:46.283411+00:00", "title": "Lebanon Shiites mark Ashura in show of anti-Israel defiance", "language": "en", "text": "Supporters of the Lebanese Shiite movement Hezbollah beat their chests as they march during a religious mourning procession on Ashura, in a suburb of Beirut (AFP Photo/ANWAR AMRO)\n\nBeirut (AFP) - Anti-Israeli chants rang through the streets of a Hezbollah bastion in the Lebanese capital on Tuesday as thousands of black-clad Shiites commemorated the seventh-century killing of Prophet Mohammed's grandson.\n\n\"We have taught Israel that our people are not weak,\" the men cried, beating their chests in unison, during an Ashura commemoration marking the killing of Imam Hussein in battle by Caliph Yazid's forces.\n\nThis year's ceremony comes shortly after a series of confrontations between Hezbollah and Israel, including an exchange of cross-border fire at the start of the month.\n\nStanding behind the crowd, a black banner tied around his head, Mohammad Ali praised the September 1 Hezbollah missile attack on Israel that triggered the border flare-up.\n\n\"For years, our families and our children have slept in bunkers because of the Israelis,\" said the 49-year-old.\n\n\"Now it is their turn to sleep in bunkers,\" he told AFP. \"The era of defeat is over.\"\n\n- Message to Israel -\n\nFrom sunrise, thousands of men gathered in Beirut's southern suburbs, a Hezbollah bastion and target of an August 25 drone attack that the movement blamed on Israel.\n\nSome were crouched on the floor crying, tears streaming down their faces, as they listened to a recital of Hussein's death.\n\nOthers sat in prayer as the recital blasted from speakers, interrupted only by the sporadic weeping of the narrator.\n\nSome carried black flags at the ceremony which came one day after Hezbollah said it had downed and seized an Israeli drone as it flew across the Lebanese border.\n\nIn the procession, thousands marched towards a main square, watched by Hezbollah forces deployed on rooftops and on sides of the road.\n\nIn a televised speech broadcast live, Hezbollah chief Hassan Nasrallah said his movement would respond to any Israeli attack on Lebanon.\n\n\"In the event of an attack on Lebanon, in any form whatsoever, there will be an adequate response to the aggression,\" Nasrallah warned.\n\nThe cross-border fire on September 1 came a week after an Israeli strike killed two Hezbollah operatives in Syria as well as the drone attack in south Beirut.\n\nStanding behind a metal barricade on a sidewalk, Fawzi Fawaz said Tuesday's huge turnout sent a message to Israel.\n\n\"These masses show Israel... the great power of the resistance,\" the 66-year old from south Lebanon said, Hezbollah's yellow banner wrapped around his neck.\n\n- Sacrifice -\n\nNearby, dozens of black-clad young men were hunched on the floor, pictures of Hezbollah \"martyrs\" tied to their foreheads in yellow fabric.\n\nAnother participant, Lokman Hakim, said the Shiite movement's battle against Israel drew inspiration from the original battle of Hussein.\n\n\"Imam Hussein some 1500 years ago... rose up against injustice and persecution,\" the 22-year-old student said, with a picture of a Hezbollah fighter killed in Syria in 2013 on his forehead.\n\nAccording to Shiite belief, Hussein went knowingly to his death at the hands of Yazid's forces in what is now Iraq.\n\nThe ideal of self-sacrifice is a key tenet of Shiite Islam to this day.\n\nCarrying yellow Hezbollah flags, fathers of the movement's fallen stood in line, some carrying portraits of their children who died fighting with Hezbollah in either Syria or south Lebanon.\n\nYassin Hamad, a frail and elderly man, said he has lost two his sons -- one in a 2005 Hezbollah operation against Israel in southern Lebanon and the second in Syria in 2014.\n\n\"I still have five sons and they are all on the same path\" of resistance, he told AFP.", "description": "Anti-Israeli chants rang through the streets of a Hezbollah bastion in the Lebanese capital on Tuesday as thousands of black-clad Shiites commemorated the seventh-century killing of Prophet Mohammed's grandson.  \"We have taught Israel that our people are not weak,\" the men cried, beating", "authors": ["Hashem Osseiran"], "top_image": "https://s.yimg.com/uu/api/res/1.2/VTCocJyk6Z.UQtHSpzL8lw--~B/aD01MDA7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/f7e9b0ed10f4fee8c1564db41f6339f1d1e0248a.jpg", "published_at": "2019-09-10"}