{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/22/WS5daec3d6a310cf3e35571f0b.html", "downloaded_at": "2019-10-22 13:31:27.986762+00:00", "title": "Hebei increases clean energy for winter heating", "language": "en", "text": "By ZHANG YU in Shijiazhuang | chinadaily.com.cn | Updated: 2019-10-22 16:54\n\nTechnicians instruct a villager on how to use electrical heating in a village in Shijiazhuang, North China's Hebei province, on Oct 25, 2018. [Photo/IC]\n\nAbout 2.2 million households in North China's Hebei province will replace coal with clean energy for heating during the upcoming winter, as one of the province's efforts to improve air quality.\n\nAccording to the Ministry of Ecology and Environment, winter heating with clean energy is the most important measure for improving air quality in the Beijing-Tianjin-Hebei cluster and neighboring areas, which can help reduce concentration of PM2.5 by more than one-third.\n\nAs of last year, over five million households in the province have started using clean energy for heating, including natural gas, electricity, photovoltaic, optothermal and alcohol-based fuel.\n\nUse of coal in rural areas will be monitored by the provincial bureau of ecology and environment, according to the conference.\n\nAlong with video surveillance, infrared alarm systems and flight inspection by unmanned aerial vehicles, each village will also have three inspectors to prevent villagers' reusing coal for heating, the bureau said.\n\nFor areas which haven't started the replacement, households need to use clean coal for heating. To ensure that, the province has examined 310 batches of coal to be used this winter in the province, from which more than 3,617 tons of inferior coal were confiscated, Hebei Daily reported.\n\nDuring the past several years, Hebei province, previously supported by traditional heavy and high-polluting industries, has taken various measures to fight air pollution and improve air quality. Last year, it got the best result since 2013 when the monitoring for PM2.5 started.\n\nThe average concentration of PM2.5 was reduced to 56 micrograms per cubic meter in 2018, down 48.1 percent compared with the density in 2013, the bureau said.", "description": "About 2.2 million households in North China's Hebei province will replace coal with clean energy for heating during the upcoming winter, as one of the province's efforts to improve air quality.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/22/5daec3d6a310cf3e97a276aa.jpeg", "published_at": "2019-10-22"}