{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7581563/Mummy-Diaries-fans-admit-broke-watching-Arthur-two-face-fear-walk-sand.html", "downloaded_at": "2019-10-16 23:18:04.413983+00:00", "title": "Mummy Diaries fans admit they broke down watching Arthur, two, face his fear and walk on the sand", "language": "en", "text": "Mummy Diaries fans admitted they were left feeling emotional after watching two-year-old Arthur Shepherd combat his fears and walk on a sandy beach.\n\nHis mum Billie, 29, revealed that her little boy had never walked on the sand before during their holidays and was left wiping away tears following the special moment.\n\nThe Shepherd family had been spending the summer in Marbella, Spain, and during one sun-drenched day at the beach the family attempted to face his fear.\n\nEmotional: Mummy Diaries fans admitted they were left feeling emotional after watching two-year-old Arthur Shepherd combat his fears and walk on a sandy beach\n\nDiscussing the issue, Billie said: 'Arthur has never walked on the sand. Every time we try and put him down he'll crunch his legs up. He'll just sit in shade by himself.'\n\nA clip from the show saw dad Greg, 33, try and place Arthur's feet on the floor however the youngster appeared uncomfortable and began crying.\n\nHowever the couple were determined to help Arthur walk on the beach, and quick-thinking Greg decided to try and distract his son with a game of football.\n\nFacing his fears: His mum Billie, 29, revealed that her little boy had never walked on the sand before during their holidays and was left wiping away tears following the special moment\n\nMoments later Arthur appeared to have forgotten all about his dislike of the feel of sand, and began kicking the ball back to his dad on the shoreline.\n\nBillie got visibly emotional as she watched Arthur running along the shore and said: 'It sounds silly but for us it was a really big moment. I'll always remember that Arthur walked on the sand in Spain You know you think when its such a big thing - I can't believe it!'\n\nMany viewers admitted that they also felt emotional watching the moment, with one writing: 'Loved loved #mummydiaries this week! So emotional seeing Arthur walk on the sand what a big moment.\n\nSpecial: The Shepherd family had been spending the summer in Marbella, Spain, and during one sun-drenched day at the beach the family attempted to face his fear\n\nDiscussing the issue, Billie said: 'Arthur has never walked on the sand. Every time we try and put him down he'll crunch his legs up. He'll just sit in shade by himself'\n\nMany viewers admitted that they also felt emotional watching the moment, with one writing: 'Loved loved #mummydiaries this week! So emotional seeing Arthur walk on the sand what a big moment'\n\nFootie mad: However the couple were determined to help Arthur walk on the beach, and quick-thinking Greg decided to try and distract his son with a game of football\n\n'Perfect families! do NOT want this series to end next week really is my FAVE I even got my boyfriend into it. @SamathaFaiers @BillieFaiers.'\n\nWhile another said: '@BillieFaiers @GregShepherd I actually had a tear in my eye seeing Arthur walk on the sand. #MummyDiaries #isthelittlething.'\n\nAnother added: 'Why am I crying at Arthur Shep walking on the sand? I need to get a grip.' #MummyDiaries\n\nOne fan related to Billie's tearful reaction and said: 'I'm with @BillieFaiers! It's the littlest thing as a mum that just makes you so proud and well up. #MummyDiaries.\n\nLoving life: Moments later Arthur appeared to have forgotten all about his dislike of the feel of sand, and began kicking the ball back to his dad on the shoreline", "description": "Mummy Diaries fans admitted they were left feeling emotional after watching two-year-old Arthur Shepherd combat his fears and walk on a sandy beach.", "authors": ["Charlotte Dean For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/00/19812294-0-image-a-79_1571267081050.jpg", "published_at": "2019-10-16"}