{"pub": "atlantic", "url": "https://theatlantic.com/entertainment/archive/2019/09/emmys-2019-phoebe-waller-bridges-big-night-fleabag/598579", "downloaded_at": "2019-09-23 04:26:49.328493+00:00", "title": "A ‘Ridiculous’ Emmys Night for Fleabag", "language": "en", "text": "The show’s second season presented a refreshing exploration of the sisters’ relationship, and that tenderness extended beyond the script. Soon after Waller-Bridge’s writing win, the show’s director, Harry Bradbeer, was awarded a trophy of his own. After noting that “something like Fleabag only comes along once in your life,” he expressed gratitude toward Waller-Bridge for trusting him with her vision: “Thank you for coming into my life like some kind of glorious grenade.”\n\nWaller-Bridge and Fleabag managed to land two more surprising wins tonight. The auteur claimed the award for Outstanding Actress in a Comedy Series, beating out Julia Louis-Dreyfus, the much heralded star of Veep, and Rachel Brosnahan, of the Emmy favorite The Marvelous Mrs. Maisel. Naturally, Waller-Bridge approached this win with the same irreverence that animates her series: “I find acting really hard and really painful but it’s all about this,” Waller-Bridge said, jokingly echoing her earlier acceptance speech.\n\nBefore the end of the night, Fleabag won the biggest award it was nominated for: Outstanding Comedy Series, beating out heavyweights including The Marvelous Mrs. Maisel, Barry, The Good Place, and Veep. “This is just getting ridiculous,” Waller-Bridge quipped after taking the stage yet again, this time with her cast and crew. “Fleabag says thanks,” she added.\n\nThe appeal of Waller-Bridge’s work, whether Fleabag or Killing Eve, stems in large part from its subtle yet unflinching examination of women’s interiority. Waller-Bridge’s characters are complex, but they’re not written as psychological case studies. Fleabag, despite her self-hatred, is still allowed to feel good, to experience moments of satisfaction and breakthrough amid her suffering. Waller-Bridge relished writing the show’s small rebellions. “The thing I really got off on was putting a female character out there that was all-knowing about sex and one step ahead, who knew what the guys were thinking before they thought it and yet still played slightly dumb to them,” Waller-Bridge told The Cut in 2017. “Oh God, it brought me so much pleasure.”\n\nThe actor and writer has never seemed naive about the importance of her work in a television landscape that remains dominated by men. As she said early during the ceremony, “It’s really wonderful to know a dirty, pervy, angry messed-up woman can make it to the Emmys.” Whether she was talking about herself or Fleabag was for viewers to decide.\n\nWe want to hear what you think about this article. Submit a letter to the editor or write to letters@theatlantic.com.", "description": "The acclaimed Amazon series created by Phoebe Waller-Bridge swept the comedy category, beating out heavyweights such as Veep and The Marvelous Mrs. Maisel.", "authors": ["Hannah Giorgis"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/AP_19266039442167/facebook.jpg?1569202690", "published_at": "2019-09-23"}