{"pub": "businessinsider", "url": "https://businessinsider.com/andrew-yang-announces-universal-basic-income-raffle-for-10-families-2019-9", "downloaded_at": "2019-09-13 01:04:55.177850+00:00", "title": "Andrew Yang announces a raffle to give 10 families a $12,000 annual universal basic income at the Democratic debate", "language": "en", "text": "2020 presidential candidate Andrew Yang— who is running on a platform of giving every American a universal basic income of $1,000 a month — announced at the third Democratic debate that he will hold a raffle to give 10 families $12,000 a year.\n\nThe raffle, first reported by Politico, will begin online next week, and will give each family $1,000 a month. The universal basic income program, which Yang calls the Freedom Dividend, is his flagship campaign proposal.\n\n\"It's time to trust ourselves more than our politicians,\" Yang said. \"My campaign will now give a Freedom Dividend of $12,000 per year to 10 families. This is how we will get our country working for us again, the American people.\"\n\nYang argues that the Freedom Dividend would not only help ameliorate economic inequality but would reward unpaid work like childcare and housework, boost innovation by providing entrepreneurs with more leeway to start new businesses, and give everyday workers more leverage to demand better working conditions from their employers.\n\nYang, a former entrepreneur, is the main candidate in the race sounding the alarm about the effects of automation on the American economy, particularly how it could eliminate jobs in the trucking and retail sectors.\n\nBeyond the Freedom Dividend, Yang also advocates for other progressive policies and expansive social programs including a single-payer Medicare for All healthcare system, free community college, and nationwide marijuana legalization.\n\nRead more:Andrew Yang is running for president in 2020. Here's everything we know about the candidate and how he stacks up against the competition.\n\nBut Yang is through-and-through a capitalist and rejects the notion that a universal basic income constitutes socialism.\n\n\"This is not socialism, this is capitalism where income doesn't start at zero,\" Yang told CBS of his universal basic income plan in March. \"If you think about where Americans are going to spend this money, they're going to spend it at their local businesses, their main street economy.\"\n\nYang has shot up to the top tier of the 2020 field in recent months and has over 200,000 unique donors thanks to his extremely online base of supporters known as the #YangGang.\n\nThe Yang Gang has transformed Yang's initially longshot candidacy into a serious one, and Yang has now outlasted several US members of Congress and Governors in the race.", "description": "\"It's time to trust ourselves more than our politicians,\" Yang said. \"My campaign will now give a Freedom Dividend of $12,000 per year to 10 families.\"", "authors": ["Grace Panetta"], "top_image": "https://amp.businessinsider.com/images/5cc9b0f7021b4c05cb46bfd3-1920-960.jpg", "published_at": "2019-09-12"}