{"pub": "vice", "url": "https://vice.com/en_asia/article/9kek4p/the-war-on-drugs-is-coming-for-vapes-and-its-not-going-to-end-well", "downloaded_at": "2019-09-12 07:09:47.448715+00:00", "title": "The War on Drugs Is Coming for Vapes, and It's Not Going to End Well", "language": "en", "text": "This article originally appeared on VICE US.\n\nDonald Trump has decided to freak out about vaping.\n\nOn Wednesday, White House officials announced they were asking the Food and Drug Administration (FDA) to consider taking all flavored e-cigarettes off the market. The edict came just days after the agency informed JUUL Labs, which controls over two-thirds of America's e-cig market, that it had broken federal regulations by allegedly publicizing its product as a safer alternative to cigarettes. It was yet another blow to the vaping behemoth that has faced rampant criticism over vape use by teenagers.\n\nMarketing aside, skepticism of e-cigarette companies like JUUL has reached a new level in recent weeks as a public-health crisis has seemingly spread across the country, with at least 450 cases of vape-related illnesses already reported, and, as of Tuesday, six reported deaths. The desire to take quick action, as Trump is suggesting, is understandable—even though public-health experts have yet to land on a definitive cause for these mysterious cases. (Many of them, but not all, have been blamed on THC oil, or user innovation, i.e. altering your rig or mixing your own e-liquid.)\n\nBut experts and legal vaping advocates VICE spoke to pointed out that supply-side intervention never worked in the war on drugs. That made it all the more bizarre that it might become the policy weapon of choice now, in 2019. In fact, experts and legal vaping advocates said, bans at the federal or state or local level could just serve to worsen the problem they're trying to prevent by encouraging the kind of at-home or illicit experimentation that may have helped bring about the recent spike of vape-linked illnesses in the first place.\n\n\"Prohibition is just a bad idea,\" said Leo Beletsky, a professor of law and health sciences at Northeastern University, later adding, \"Enacting sweeping bans on e-cigs risks throwing the baby out with the bathwater by pushing users toward traditional cigarettes and illicit markets for e-cigs. All of this plays into the hands of traditional tobacco companies and is likely to create more public-health harm, not less.\"\n\n\"Right now, there's no 'black market' in vaping products in America, but there is an already-bustling gray market of rogue eBay and social media sellers who don't check customer IDs,\" added Gregory Conley, the president of the American Vaping Association, an advocacy group backed by the e-cigarette industry that pushes vaping as a means to quit smoking cigarettes. \"With ingredients in e-liquid being cheap and readily available, flavor bans are likely to increase do-it-yourself mixing. All it takes is one teenager using a flavor that isn't used in commercially available e-liquids to get several people sick.\"\n\nNate Allbee, a vaping advocate and a spokesperson for the JUUL-funded Coalition for Reasonable Vaping Regulation, which is fighting against a lawmaker-proposed ban in San Francisco, compared what's going on with vaping now to the reaction to cannabis in the 1930s, when the federal government essentially began the war on drugs that continues to this day. \"It was a combination of fear, misinformation, and politicians wanting to make a name for themselves that formed the hysteria around marijuana,\" he said, emphasizing that the greatest side effect was the formation of the black market, which \"is still ruining people's health and lives.\"\n\n\"Part of the problem with vaping is that it's so new we don't even have the language to talk about what's happening,\" Allbee continued. \"There is a clear distinction between the two types of vaping: what people call an e-cigarette that delivers nicotine, and what probably should be called an 'e-joint,' which delivers marijuana. Instead, people use the terms vaping, JUULing, vape pens, weed pens, and e-cigarettes interchangeably.\"\n\nE-cigarette industry players and their advocates could only be expected to oppose blanket bans that would sap their bottom line. But experts without ties to the industry suggested this approach to the crisis was lacking in nuance—and setting the stage for a potential repeat of past mistakes. And even if a national ban doesn't go into effect, long-expected federal regulation in the form of FDA oversight of vaping products could be coming, and it would have an awkward relationship with what's going on in states like Michigan, which recently moved to ban flavored e-cigarettes sales at the state level.\n\n\"I find it quite ironic that as of May 2020 [when FDA regulation was scheduled to kick in], the only states whose vaping products will not be regulated are those which are now banning flavored e-cigarettes—their vaping products will only be sold on the black market, while in all other states, e-cigarettes will be tightly regulated,\" Michael Siegel, a prominent tobacco-control expert and a professor of community health sciences at Boston University, said before Trump's announcement Wednesday.\n\nOf course, many critics have suggested next May isn't soon enough, and have been asking that the products, especially the flavors most attractive to teenagers, be off the market until such a review. But a more measured strategy—regulation that does not amount to a ban—continues to be the preferred one of those well-versed in the history of supply-side drug intervention.\n\nThen again, some experts conceded the situation looked increasingly difficult to resolve in the short term no matter the strategy.\n\n\"Making things illegal tends to make them more dangerous,\" said Peter Grinspoon, a primary care physician at Massachusetts General Hospital and an instructor at Harvard Medical School. \"Who knows what the solution is here? Go back in time and un-invent vapes? What do you actually do?\"\n\nSign up for our newsletter to get the best of VICE delivered to your inbox daily.\n\nFollow Alex Norcia on Twitter.", "description": "\"Making things illegal tends to make them more dangerous.\"", "authors": [], "top_image": "https://video-images.vice.com/articles/5d794552d174ca00086a894d/lede/1568229800463-banning-vapes-is-the-war-on-drugs-in-2019.png?crop=1xw:1xh;center,center&resize=1200:*", "published_at": "2019-09-12"}