{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/forever-21-history-success-to-bankruptcy-reports-2019-9", "downloaded_at": "2019-10-01 00:14:04.954444+00:00", "title": "How Forever 21 went from a fast-fashion powerhouse to bankruptcy and a troublesome future", "language": "en", "text": "Forever 21, once one of the world's leading clothing retailers, has fallen on hard times. It filed for Chapter 11 bankruptcy protection on Sunday.\n\nThe company was founded in 1984 and pulled in $700,000 in sales in its first year. Today there are 794 Forever 21 stores worldwide.\n\nFounders Jin Sook and Do Won \"Don\" Chang had a combined net worth of $5.9 billion at the company's peak in 2015, Forbes reported. They were no longer billionaires as of July, according to Forbes' estimates.\n\nhad a combined net worth of $5.9 billion at the company's peak in 2015, Forbes reported. They were no longer billionaires as of July, according to Forbes' estimates. On Sunday, Forever 21 announced its bankruptcy filing in a letter to shoppers, writing: \"Once we complete a reorganization, Forever 21 will be a stronger, more viable company that is better positioned to prosper for years to come. We look forward to continuing to provide you with the great service and curated assortment of merchandise that you expect from us.\"\n\nHere is the complete story of Forever 21, from its quick rise to become a top teen retailer to its slowdown and uncertain future.\n\nVisit Business Insider's homepage for more stories.\n\nOnce a hot spot for teen clothing, Forever 21 has filed for Chapter 11 bankruptcy protection.\n\nBut before its struggles, Forever 21 seemed unstoppable.\n\nThe company was founded by husband-and-wife duo Jin Sook and Do Won \"Don\" Chang after they emigrated from South Korea to Los Angeles in 1981. The pair opened their first store, then called Fashion 21, in 1984 and pulled in $700,000 worth of sales in the first year.\n\nThe retailer thrived through the early 2000s, eventually peaking in 2015 when its founders were worth a record high of $5.9 billion combined, Forbes reported. Today, Forbes estimates that the cofounders are no longer billionaires.\n\nOn Sunday, Forever 21 announced its bankruptcy filing in a letter to shoppers, writing: \"Once we complete a reorganization, Forever 21 will be a stronger, more viable company that is better positioned to prosper for years to come. We look forward to continuing to provide you with the great service and curated assortment of merchandise that you expect from us.\"\n\nA representative for the company told Business Insider in a statement that the company planned to close most of its locations in Asia and Europe but to continue operations in the US, Mexico, and Latin America. Forever 21 will close up to 178 stores in the US and as many as 350 globally.\n\nHere's the story of the company, from its quick rise to global prominence to its slow downfall into uncertainty.", "description": "Forever 21 has filed for Chapter 11 bankruptcy protection. We traced the history of the teen retailer.", "authors": ["Shoshy Ciment"], "top_image": "https://image.businessinsider.com/56c9c2776e97c623048b88f0?width=1200&format=jpeg", "published_at": "2019-09-30"}