{"pub": "hotair", "url": "https://hotair.com/archives/john-s-2/2019/09/25/former-mp-punished-failing-hail-justin-trudeau-great-feminist", "downloaded_at": "2019-09-25 23:28:52.922421+00:00", "title": "Former MP: ‘I was punished for failing to hail Justin Trudeau as a great feminist’", "language": "en", "text": "Former Canadian Member of Parliament Eva Nassif was elected as the representative of Vimy, an area north of Montreal, in 2015. She was expected to run for reelection next month but suddenly dropped out of the race. Today, Nassif claims she was pushed out of her safe seat by the Liberal Party because she failed to praise Prime Minister Justin Trudeau as a feminist.\n\nThe mystery began last month when Nassif unexpectedly announced she would not be running for re-election. From the CBC:\n\nEva Nassif bade farewell to her constituents Thursday evening, posting a lengthy resignation letter to social media. “Recent events of a personal nature motivate this decision, which I do not take lightly,” she wrote. But riding president Giuseppe Margiotta told The Canadian Press that Nassif was pushed out without any reason given. The entire executive in the riding was “stunned” by the recent developments, he said. Margiotta blames the Liberal Party of Canada for leaving his local riding association “in the dark.” He said he wrote to party leaders demanding an explanation, but his email was left unanswered.\n\nWhy was Nassif pushed out? No one would say. Sources in the Party told the CBC off the record that she had failed to meet minimum requirements for door-knocking and fundraising. But local sources in the party discounted that, saying Nassif had met all of the requirements. Today, Nassif said the real reason for her departure was that she failed to praise Trudeau after he was involved in a scandal featuring his female Attorney General:\n\nNassif was one of 50 women that the Liberals helped elect in the 2015 campaign but she wasn’t allowed to run in this election and says she it is all because she wouldn’t post supportive messages of Trudeau on social media. “I was punished for failing to hail Justin Trudeau as a great feminist in the wake of SNC-Lavalin when I didn’t post anything,” Nassif told the Globe. If you remember those days after Jody Wilson-Raybould and Jane Philpott left the Liberal caucus back in March, female Liberal MPs took to Twitter and Facebook to post praise for Trudeau as a strong leader for women. The posts were often identical and were obviously centrally written. Nassif told the Globe that she didn’t post them because “I am authentic.”\n\nThe story is actually worse than that. Trudeau was accused of waging an unethical campaign to protect an engineering company called SNC-Lavalin from prosecution. He and his office applied pressure to Jody Wilson-Raybould, repeatedly asking her to find a way to reach a non-prosecution agreement with the company. After she testified about the pressure campaign, Trudeau demoted her. Both Wilson-Raybould and another female minister who quit over the scandal were then expelled from the Liberal Party.\n\nIt was not a good look for a “feminist” Prime Minister. In fact, shortly after the two high profile women were cast out of the party, Trudeau appeared at an event called Daughters of the Vote which was intended to lead more women toward involvement in politics. About 50 female delegates at the event stood and turned their backs on Trudeau.\n\nDozens of young women here for Daughters of the Vote turn their backs as Trudeau speaks -in solidarity with Ms Wilson-Raybould and Ms Philpott pic.twitter.com/aAhdlDHrcS — Peter Julian (@MPJulian) April 3, 2019\n\nAnd so, while all of this was happening, the Liberal Party sent out other female ministers to defend Trudeau’s “feminist” credentials. From the Globe and Mail:\n\nTourism Minister Melanie Joly defended Mr. Trudeau’s record comments to reporters Wednesday morning, suggesting Ms. Wilson-Raybould and Ms. Philpott were not team players. “We have a strong Prime Minister that is a feminist. We have a feminist agenda. Our record speaks for itself. As to my two colleagues, I would argue that loyalty and feminism are two different things. … You [either] want to work in a team or you don’t.”\n\nMP Eva Nassif wasn’t willing to be part of the team propping up Trudeau so she was ousted. For Trudeau, feminism means women in his party praise him as a feminist or else.", "description": "\"...Nassif was pushed out without any reason given.\"", "authors": ["John Sexton", "Jazz Shaw", "Ed Morrissey", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/Eva-Nassif.jpg", "published_at": "2019-09-25"}