{"pub": "cnn", "url": "https://cnn.com/2019/10/22/football/concussion-in-football-ifab-fifpro-marco-van-basten-spt-intl/index.html", "downloaded_at": "2019-10-23 15:58:17.184601+00:00", "title": "Concussion in football: Temporary substitutions could be on the way", "language": "en", "text": "(CNN) The image of Jan Vertonghen retching at the side of the pitch, barely able to keep his feet, was one that shocked viewers around the world and raised serious questions about football's concussion protocols.\n\nIn the 32nd minute of the Champions League semifinal against Ajax, Tottenham's Belgian defender had just been involved in a sickening collision with teammate Toby Alderwiereld, before falling to the ground and slamming his face into the turf.\n\nThe clash left a visibly disoriented Vertonghen with a deep cup and blood pouring from his nose but, after an assessment from Tottenham's medical team, he changed his blood-stained shirt and returned to the field.\n\nHis return, however, lasted a matter of minutes before he had to be held upright and helped down the tunnel by two members of Tottenham's staff.\n\nSpurs' medical team, for their part, followed football's concussion protocols and after the game announced that Vertgonghen had not suffered a concussion.\n\nBut the incident drew widespread criticism and led Chris Nowinski, co-founder and CEO of the Concussion Legacy Foundation, to say: \"international soccer's concussion protocols are the worst in the world. Their substitution rules are archaic and not based on current clinical care for concussion.\"\n\nJan Vertonghen had to be helped from the pitch after being allowed to play on following a head injury.\n\nOn Wednesday, these protocols -- or perceived lack of them -- will be discussed by the International Football Association Board (IFAB) in Zurich, including the addition of a temporary substitute to allow for a 10-minute concussion assessment window instead of the current three-minute test.\n\nFormer Dutch international Marco van Basten, one of only five players to win the Ballon d'Or three times, told CNN it is a step in the \"right direction.\"\n\nDuring his career, the 54-year-old had to spend a night in hospital for concussion after an opposition goalkeeper kicked his head instead of the ball.\n\n\"It's helpful for football, for football players to understand more about how the body functions and the mind functions,\" he said. \"It's difficult to make a good law, a good regulation.\n\n\"You should say: 'Okay if something happens -- what happened with the Tottenham player -- you need 10 minutes to understand how heavy the concussion is.'\n\n\"So for these 10 minutes, maybe you should have the possibility to put (another) player on, otherwise it's 10 against 11.\"\n\n'Easy to blame somebody'\n\nDr. Edwin Goedhart, head of sports medicine at the Dutch Football Federation (KNVB), agrees with Van Basten and told CNN a temporary substitution would alleviate pressure on doctors to rush players back onto the pitch.\n\n\"I agree that three minutes is too little (time) in some cases, not at all, but in some cases too little,\" he said. \"It's always difficult from a distance to see what's happening on the pitch.\n\n\"The communication between the player and the doctor, the player and a coach and the doctor and the coach is very individualized and so it's very easy to blame somebody or something, while you don't know what's really happening.\n\n\"If you look at those rules for a substitution, I think for a doctor it would be great because you get more time and you don't put pressure on the coach to get (the player) back on, otherwise you are only left with 10 and that can cause unrest and annoyance with coaches.\"\n\nVertonghen's injury raised serious questions about the way football deals with player concussions.\n\nGoedhart says a combination of the current three-minute test and the proposed 10-minute assessment would be his preferred solution.\n\nNot every contact with the head should result in an immediate 10-minute substitution, Goedhart posits, as often players need to return to the field for 30 seconds to a minute to ensure they are healthy enough to continue.\n\n\"(My choice) would be not to take them out immediately,\" Goedhart says. \"Because that gives a problem that perhaps it could also be misused or abused as a tactical maneuver and if that happens, then we're back to the beginning again.\n\n\"I would be happy with a three-minute rule and if the doctor decides if you need more time, then go over to a 10-minute rule.\"\n\nProfessional to recreational\n\nFew football federations around the world are arguably doing as much as the KNVB when it comes to player concussion assessments.\n\nEvery Dutch national team, including all teams at youth level, are screened before going to play abroad, giving each player a \"baseline test,\" Goedhart says.\n\nThis makes is easier for the medical staff to spot a suspected concussion should there be any change of results in a subsequent screening.\n\nBut education in the KNVB, too, is key, as well as looking out for footballers below the professional level.\n\nEvery Dutch national team, including youth teams, are giving screenings for concussion.\n\n\"What we try to do is to educate the doctors, all the team physicians so that they know what to do in certain circumstances,\" Goedhart says. \"We also educate the coaches and our new coaches when they come to be active in professional football.\n\n\"We educate them in a group about what the consequences are and how you should deal with it.\n\n\"For the recreational athletes -- because they are there as well, it's not only happening in professional levels -- we have installed a concussion clinic at our medical center, which actually helps and supports people get back on a route to play to their level of sport.\"\n\nEx-pros at risk of dementia\n\nThis week, a landmark study released by the University of Glasgow revealed for the first time a link between a higher rate of death due to dementia in former professional footballers.\n\nLed by consultant neuropathologist Dr. Willie Stewart, researchers compared the causes of death in more than 7,600 ex-professional male Scottish footballers and 23,000 members of the public.\n\nThe study showed that the former players were around a three and a half times more likely to die from neurodegenerative disease.\n\n\"This is the largest study to date looking in this detail at the incidence of neurodegenerative disease in any sport, not just professional footballers,\" Stewart said. \"A strength of our study design is that we could look in detail at rates of different neurodegenerative disease subtypes.\n\n\"This analysis revealed that risk ranged from a five-fold increase in Alzheimer's disease, through an approximately four-fold increase in motor neurone disease, to a two-fold Parkinson's disease in former professional footballers compared to population controls.\"\n\nFormer footballer Jeff Astle, who died aged 59, had been suffering from CTE.\n\nSeveral high-profile cases in recent years , notably in American football, have started to draw a link between contact sport and the neurodegenerative disease Chronic Traumatic Encephalopathy, known as CTE.\n\nThe disease, which can only be detected post-mortem, can cause changes in mood, behavioral problem and in some cases can lead to dementia.\n\nIn a parallel study led by Stewart, post-mortem examinations identified CTE \"in a high proportion of brains of former contact sports athletes,\" including professional footballers.\n\nThe prevalence of CTE in former American footballers -- around 13 times more confirmed incidences than soccer, according to the Concussion Legacy Foundation -- was part of the reason behind US Soccer's decision to ban children aged 10 and under from heading the ball in 2015.\n\nThe NFL and NHL, as well as the NCAA, had faced lawsuits relating to head injuries in athletes and US Soccer's ban resolved a class-action lawsuit brought against it by a group of parents and players.\n\nHowever, Goedhart believes that while preventing young children -- whose brains are more vulnerable -- undoubtedly has benefits of protection, it also has its downsides.\n\n\"It's very important that you know exactly how to use your muscles, how to brace your neck with your muscles for proper heading,\" he says. \"If you have not learned this in your youth, how can you do it in a proper way when you were older?\n\nFormer Dutch international Marco van Basten had to spend a night in the hospital for concussion during his career.\n\n\"If that (heading) is not allowed anymore, youngsters try to get the ball out using their foot so you get a foot-head contact instead, which is much more dangerous than what you initially wanted.\n\n\"We think that you should not organize long heading drills with heavy balls, instead use light, deflated balls, just to learn a technique. Then if you're ready for it at an older age, you'll be back for it.\"\n\nFrom Van Basten's perspective as a striker, knowing how to manipulate and protect your body when contesting a header is equally as important.\n\n\"I fully agree with Dr. Goedhart, if you are a youth, you have to learn how to use your head,\" he says. \"With heading it's important that the ball is not that heavy and it's good to grow up with that way of playing.\n\n\"Talking about youth (players) not really heading the ball I don't agree with. The way you use your head during football, I don't believe that's a big problem.\n\n\"It becomes dangerous if it's head against head or you have elbow against head, then it can be a little bit dangerous -- but it's (important) even to use your arms in the right way, which often protects against head against head.\"", "description": "The image of Jan Vertonghen retching at the side of the pitch, barely able to keep his feet, was one that shocked viewers around the world and raised serious questions about football's concussion protocols.", "authors": ["Matias Grez"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190502115516-jan-vertonghen-ii-super-tease.jpg", "published_at": "2019-10-22"}