{"pub": "politico", "url": "https://politico.com/magazine/story/2019/09/03/donald-trump-expert-227997", "downloaded_at": "2019-09-03 23:45:14.884927+00:00", "title": "Donald Trump, Expert", "language": "en", "published_at": "2019-09-03", "text": "Shawna Chen is a former Politico editorial intern.\n\nOver the weekend, President Donald Trump asserted that he knows more about hurricanes than the experts.\n\nAlabama, Trump declared on Twitter, was among the states that could be hit by Hurricane Dorian, which is approaching Florida’s Atlantic coast. The statement was promptly refuted by the National Weather Service in Birmingham, the National Oceanic and Atmospheric Administration and others saying that Alabama is not expected to be affected—yet Trump repeated his claim.\n\nStory Continued Below\n\nThe president’s insistence might have surprised weather forecasters, but it’s far from the first time he’s waded into a debate by immediately high-handing the experts. In the course of his presidency, Trump has claimed detailed knowledge about topics as wide-ranging as drones, forest management, horse track conditions and technology.\n\nWe’ve combed Trump’s Twitter feed, interviews and other public statements since he took office. What follows is only a sampling of the striking list of things on which the president is, by his own account, an expert.\n\n\n\n***\n\nAirplanes: “Airplanes are becoming far too complex to fly. Pilots are no longer needed, but rather computer scientists from MIT. I see it all the time in many products. Always seeking to go one unnecessary step further, when often old and simpler is far better.” —March 12, 2019, Twitter\n\nForest management: “There is no reason for these massive, deadly and costly forest fires in California except that forest management is so poor. Billions of dollars are given each year, with so many lives lost, all because of gross mismanagement of the forests. Remedy now, or no more Fed payments!” —November 10, 2018, Twitter\n\nWater management: “California wildfires are being magnified & made so much worse by the bad environmental laws which aren’t allowing massive amount of readily available water to be properly utilized. It is being diverted into the Pacific Ocean. Must also tree clear to stop fire from spreading!” —August 6, 2018, Twitter\n\nBasic human technologies: “The Democrats are trying to belittle the concept of a Wall, calling it old fashioned. The fact is there is nothing else’s that will work, and that has been true for thousands of years. It’s like the wheel, there is nothing better. I know tech better than anyone, & technology.” —December 21, 2018, Twitter\n\nAdvanced human technologies: “Having a drone fly overhead—and I think nobody knows much more about technology, this type of technology certainly, than I do.” —January 3, 2019, White House briefing\n\nSafety: “I know more about drones than anybody. I know about every form of safety that you can have.” —January 2, 2019, Cabinet meeting\n\nSteam-powered catapults: “You know the catapult is quite important. So, I said what is this? ‘Sir, this is our digital catapult system.’ He said, ‘Well, we’re going to this because we wanted to keep up with modern [technology].’ I said, ‘You don’t use steam anymore for catapult?’ ‘No sir.’ I said, ‘Ah, how is it working?’ ‘Sir, not good. Not good. Doesn’t have the power. You know the steam is just brutal. You see that sucker going, and steam’s going all over the place. There’s planes thrown in the air.’ It sounded bad to me. Digital. They have digital. What is digital? And it’s very complicated, you have to be Albert Einstein to figure it out. And I said—and now they want to buy more aircraft carriers. I said, ‘What system are you going to be?’ ‘Sir, we’re staying with digital.’ I said, ‘No you’re not. You going to goddamned steam. The digital costs hundreds of millions of dollars more money, and it’s no good.’” —May 8, 2017, interview with Time magazine\n\nThe 14th Amendment: “So-called Birthright Citizenship, which costs our Country billions of dollars and is very unfair to our citizens, will be ended one way or the other. It is not covered by the 14th Amendment because of the words ‘subject to the jurisdiction thereof.’ Many legal scholars agree.” —October 31, 2018, Twitter\n\nNewspaper sourcing: “When you see ‘anonymous source,’ stop reading the story, it is fiction!” —August 29, 2018, Twitter\n\nHorse-racing regulation: “The Kentucky Derby decision was not a good one. It was a rough & tumble race on a wet and sloppy track, actually, a beautiful thing to watch. Only in these days of political correctness could such an overturn occur. The best horse did NOT win the Kentucky Derby - not even close!” —May 5, 2019, Twitter\n\nThe small-truck business: “The reason that the small truck business in the U.S. is such a go to favorite is that, for many years, Tariffs of 25% have been put on small trucks coming into our country. It is called the ‘chicken tax.’ If we did that with cars coming in, many more cars would be built here.” —November 28, 2018, Twitter\n\nUSPS: “Why is the United States Post Office, which is losing many billions of dollars a year, while charging Amazon and others so little to deliver their packages, making Amazon richer and the Post Office dumber and poorer? Should be charging MUCH MORE!” —December 29, 2017, Twitter\n\nJapanese auto-import regulations: “It’s called the bowling ball test. Do you know what that is? That’s where they take a bowling ball from 20 feet up in the air, and they drop it on the hood of the car. And if the hood dents, then the car doesn’t qualify. Well, guess what, the roof dented a little bit, and they said, nope, this car doesn’t qualify.” —March 14, 2018, fundraiser in Missouri\n\nThe economy: “I think I know about it better than [the Federal Reserve].” —October 11, 2018, to reporters\n\nThe solar system: “For all of the money we are spending, NASA should NOT be talking about going to the Moon - We did that 50 years ago. They should be focused on the much bigger things we are doing, including Mars (of which the Moon is a part), Defense and Science!” —June 7, 2019, Twitter\n\nWindmills: “Hillary wanted to put up wind … And they say the noise [of windmills] causes cancer.” —April 2, 2019, fundraiser in Washington\n\n… and again: “If a windmill is within two miles of your house, your house is practically worthless. They make noise. They’re intermittent. They kill your birds. They break down all the time. You have to replace them every 10 years because they wear out. And they cost a fortune. And they need subsidy. Other than that, they’re quite good.” —August 1, 2019, rally in Cincinnati, Ohio\n\nArticle II: “Take a look at one other thing. It’s a thing called Article II. Nobody ever mentions Article II. It gives me all of these rights at a level that nobody has ever seen before. We don’t even talk about Article II.” —July 12, 2019, interview with reporters", "description": "It’s not just hurricanes. The president has claimed mastery of everything from forest management to horse racing.", "authors": ["Shawna Chen", "Michael Grunwald"], "top_image": "https://static.politico.com/50/05/8326e26343cf8ef3894caf673bda/190903-chen-trump-ap.jpg"}