{"pub": "abcnews", "url": "https://abcnews.go.com/International/wireStory/australia-asks-israel-quickly-extradite-alleged-pedophile-66461861", "downloaded_at": "2019-10-23 09:46:48.863555+00:00", "title": "Australia asks Israel to quickly extradite alleged pedophile", "language": "en", "text": "Australia's prime minister said on Wednesday he will raise with Israel's next administration the need for a quick resolution to a 5-year-old extradition battle over an Israeli educator accused of child sex abuse in an Australian school.\n\nPrime Minister Scott Morrison issued a statement after meeting at Parliament House with sisters Dassi Erlich and Nicole Meyer, who were allegedly abused by Malka Leifer when she was principal of Melbourne's ultra-Orthodox Adass Israel school.\n\nThe 52-year-old fled to Israel in 2008 after the allegations emerged.\n\n\"My government is strongly committed to ensuring that justice is served in the case of Malka Leifer,\" Morrison said. \"We call for the matter to be resolved transparently and quickly.\"\n\n\"We also reaffirm our commitment to have Malka Leifer extradited to Australia to face 74 charges of child sexual abuse,\" Morrison added.\n\nErlich told reporters outside Parliament House that she and her sister wanted the government \"to do more.\"\n\n\"Enough is enough. We don't want platitudes, we want action,\" Erlich said.\n\n\"This has taken a tremendous toll on both of our lives. Traveling back and forth, not seeing any results, the frustrations, knowing at some point she might get bail, it's had an emotional toll on our lives,\" Erlich said.\n\nMeyer, her sister, said: \"We're not just doing it for ourselves. We're trying to give a message to all survivors that even if you have been abused, life can go on; justice should be served.\"\n\nGovernment lawmaker Dave Sharma, who was Australian ambassador to Israel in 2014 when the extradition request was made, and opposition lawmaker Josh Burns joined the sisters at a news conference to demonstrate that Australia's major political parties were united in a bid to bring Leifer to justice.\n\nSharma said that after more than 60 Israeli court hearings, \"we seem to be no closer to having Malka Leifer extradited.\"\n\n\"We are here today to send a very clear message to Israel that this case is a high priority for Australia and it's one we will be ceaseless in pursuing and it's one that unless resolved soon will have an impact on the broader relationship,\" Sharma said.\n\nIsrael's Supreme Court last week upheld an appeal against a decision to release Leifer from jail to house arrest. Prosecutors argue she is feigning mental illness to dodge extradition.\n\nThe appeals court overturned a Jerusalem court's decision a week earlier to grant Leifer release to house arrest \"in order to give adequate response to concerns that the accused will flee or obstruct justice.\"\n\nIsraeli Prime Minister Benjamin Netanyahu announced this week that he has failed to form a majority government in parliament, marking a major setback for the embattled leader that plunges the country into a new period of political uncertainty.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/WireAP_08b245665ee746c7ba6efcd2edee7f18_16x9_992.jpg", "published_at": "2019-10-23"}