{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/28/nhs-chiefs-attempt-blacklist-homeopathy-amid-anti-vax-fears", "downloaded_at": "2019-10-28 00:31:21.755124+00:00", "title": "NHS chiefs attempt to blacklist homeopathy amid anti-vax fears", "language": "en", "text": "NHS leaders have gone to war on homeopathy by attempting to have the practice blacklisted amid fears it is fuelling anti-vax propaganda.\n\nThe chief executive and medical director of NHS England have written to the Professional Standards Authority (PSA), the statutory body that oversees healthcare regulation, urging it to strip accreditation from the Society of Homeopaths (SoH).\n\nThey argue that endorsing the society affords it a “veneer of credibility” that lures vulnerable patients towards “bogus treatments”.\n\nIn particular, the health chiefs accuse homeopaths of propagating “mis-information” about vaccines.\n\nIt follows the release of a major report last week which showed the uptake of pre-school vaccines is declining.\n\nThe SoH is the professional body of around 1,000 registered homeopaths, imposing a code of conduct and setting educational standards.\n\nIn April the PSA controversially renewed the society’s accreditation, despite accusations that its rules are not sufficiently strict to prevent members touting “cures” for autism.\n\nThe decision has provoked a judicial review action from the Good Thinking Society, an “anti-quack” pressure group, which is expected to be heard in the coming weeks.\n\nHomeopathy on the NHS was banned completely in 2017.\n\nMr Stevens said last night: “Anything that gives homeopathy a veneer of credibility risks chancers being able to con more people into parting with their hard-earned cash in return for bogus treatments which at best do nothing, and at worst can be potentially dangerous.\n\n“Whether touted as a miracle cure or as protection from serious diseases - like so-called homeopathic vaccines - homeopathy is no replacement for rigorously tried and tested medical treatments delivered or prescribed by properly-qualified professionals, and by stopping people seeking expert help, misinformation and ineffective remedies pose a significant risk to people’s health.”", "description": "NHS leaders have gone to war on homeopathy by attempting to have the practice blacklisted amid fears it is fuelling anti-vax propaganda.", "authors": ["Henry Bodkin", "Health Correspondent", "Benedict Spence", "Michael Gove", "Nick Timothy"], "top_image": "https://www.telegraph.co.uk/content/dam/health-fitness/2018/04/09/TELEMMGLPICT000003825968-xlarge_trans_NvBQzQNjv4BqXfJMPfENEq5oPh9E8lUElbXot50Qc_vM60sRY4jpCKQ.jpeg?imwidth=1200", "published_at": "2019-10-28"}