{"pub": "yahoo", "url": "https://finance.yahoo.com/news/spirit-airlines-must-face-lawsuit-154124447.html", "downloaded_at": "2019-09-12 11:40:58.176928+00:00", "title": "Spirit Airlines must face lawsuit over 'gotcha' carry-on bag fees: court", "language": "en", "text": "A logo of low cost carrier Spirit Airlines is pictured on an Airbus plane in Colomiers near Toulouse\n\nBy Jonathan Stempel\n\nNEW YORK (Reuters) - A federal appeals court revived a lawsuit by Spirit Airlines passengers who said the low-cost carrier blindsided them by imposing unexpected carry-on bag fees on tickets bought through Cheapoair, Expedia, Priceline and Travelocity.\n\nThe 2nd U.S. Circuit Court of Appeals in Manhattan said 22 passengers could sue for breach of contract because there was no evidence that Spirit promptly notified them about the fees, and there were \"ambiguities\" in the prices they would pay.\n\nSpirit and its lawyers did not immediately respond to requests for comment.\n\nCompared with many carriers, Spirit relies more on ancillary fees to offset the financial drag from lower base fares.\n\nThe plaintiffs accused the Miramar, Florida-based carrier of knowing that its online travel agents hid the \"gotcha\" bag fees they would have to pay at the airport.\n\nThey said these fees often exceeded the cost of their tickets, and totaled millions of dollars a year.\n\nSpirit countered that federal law precluded the lawsuit, and that its \"contract of carriage\" specifically provided that a passenger could take one carry-on bag into the cabin, for a fee.\n\nThe appeals court returned the case to U.S. District Judge William Kuntz in Brooklyn, who had dismissed it last November.\n\n\"This is a great victory for air travelers nationwide,\" the plaintiffs' lawyer John Hermina said in an interview. He said his clients will pursue their case in the district court.\n\nOn Tuesday, Spirit advertised carry-on bag fees for an Oct. 1 flight to Fort Lauderdale, Florida, from New York's LaGuardia Airport ranging from $28, if booked on its website, to $65, if paid at the gate. Base fares ranged from $26 to $121.99.\n\nThe case is Cox et al v Spirit Airlines Inc, 2nd U.S. Circuit Court of Appeals, No. 18-3484.\n\n\n\n\n\n(Reporting by Jonathan Stempel in New York; Editing by Richard Chang)", "description": "A federal appeals court revived a lawsuit by Spirit Airlines passengers who said the low-cost carrier blindsided them by imposing unexpected carry-on bag fees on tickets bought through Cheapoair, Expedia, Priceline and Travelocity.  The 2nd U.S. Circuit Court of Appeals in Manhattan said 22 passengers", "authors": ["Jonathan Stempel"], "top_image": "https://s.yimg.com/uu/api/res/1.2/tcWoOhNz0RUON46_9jnDKw--~B/aD0yOTI7dz00NDk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters-finance.com/04089ec45349f49b4c9572b665db8fe3", "published_at": "2019-09-10"}