{"pub": "businessinsider", "url": "https://businessinsider.com/who-is-tom-steyer-bio-age-family-key-positions-2019-7", "downloaded_at": "2019-10-14 23:28:40.326031+00:00", "title": "Tom Steyer is running for president. Here is everything we know about the candidate and how he stacks up against the competition.", "language": "en", "text": "Who is Tom Steyer?\n\nCurrent job: Billionaire environmental activist and political megadonor.\n\nAge: 62\n\nFamily: Steyer is married to his wife Kathryn Taylor, and together they have four grown children.\n\nHometown: New York, NY, but he lives in San Francisco, California.\n\nPolitical party: Democratic.\n\nPrevious jobs: Former hedge-fund investor.\n\nWho is Tom Steyer's direct competition for the nomination?\n\nBased on a recurring series of national surveys we conduct, we can figure out who the other candidates competing in Steyer's lane are, and who the broader opponents are within the party.\n\nSteyer only recently declared his entrance in the race and we've included him in recent editions of the survey. As it stands, we have inadequate information to draw conclusions about the viability of his candidacy and the direct competition that exists within the declared candidates.\n\nInsider has been conducting a recurring poll through SurveyMonkey Audience on a national sample to find out how different candidate's constituencies overlap. We ask people whether they are familiar with a candidate, whether they would be satisfied or unsatisfied with that candidate as nominee, and sometimes we also ask whether they think that person would win or lose in a general election against President Donald Trump.\n\nWhat are Tom Steyer's policy positions?\n\nOn healthcare : Steyer favors expanding healthcare coverage to more Americans, saying in 2018 he would like to see \"Medicare for all who want it.\" He's also said that \"healthcare is a right.\" He criticized pharmaceutical companies who profited off the opioid crisis in his campaign announcement video.\n\n:\n\nOn climate change : Steyer is pledging to declare climate change a national emergency on his first day in office, which differs from other candidates' plans as it relies on the emergency powers of the presidency. \"On day one, we'd do a bunch of things including reentering [the Paris climate accords], freeze and reverse the Trump rulemaking, we'd establish a cabinet level position, put a climate lens on all purchasing ... and if Congress couldn't pass a Green New Deal, [we] would set clean energy standards,\" Steyer said of his climate plan. The campaign has estimated it would cost $2.3 trillion. The billionaire environmental activist is also calling for stronger international cooperation to combat climate change. Steyer founded an environmentally-focused political action committee in 2013 that became NextGen America, which spent $96 million during the 2016 election cycle to support climate-friendly candidates, mostly Democrats.\n\n: On campaign finance : Steyer wants to overturn the \"Citizens United\" Supreme Court decision to reduce the influence of money in politics. In a press release announcing his candidacy, Steyer said, \"The only way for us to solve the urgent problems facing our country is to loosen the stranglehold that corporations have over our politicians and return political power to the American people.\" The billionaire liberal activist would also restructure the Federal Election Commission, characterizing it in his plan as currently \"plagued by internal dysfunction\" and \"broken.\"\n\n: On abortion : The Democratic megadonor wants to protect a woman's right to abortion, vowing in 2017 that his NextGen group wouldn't \"work for a single candidate who is not pro-choice.\"\n\n: On guns: Steyer is supportive of pushing for more gun control laws, having called on young voters after the 2018 Marjory Stoneman Douglas shooting in Fl to push \"for gun reform now\" in a Facebook video.\n\nOn criminal justice reform: Steyer has criticized the cost of bail as being needlessly high for people of color. He said in a tweet: \"Bail in this country is injustice perpetuated by greed and motivated by oppression. Black, brown, and poor people are being held because they do not have the resources to be free. There is no justice in our justice system.\"\n\nOn foreign policy : Steyer hasn't elaborated on his foreign policy views, but he criticized President Donald Trump for \"turning allies into enemies\" in a tweet.\n\n: On taxes: The California billionaire is in favor of raising taxes on the wealthy, though its not clear to what extent. Back in 2017, Steyer called on Trump to raise his taxes during the Republican push to pass the tax law. \"We need to make sure that we're not in a society that is unbalanced and unfair and where the richest Americans are taking advantage of everybody else,\" Steyer said at the time.\n\n\n\nWhat are Tom Steyer's political successes?\n\nSteyer lobbied then-President Barack Obama to not approve the Keystone XL oil pipeline, arguing it'd be too harmful to the environment. Obama shot down the project, but its been revived under Trump.\n\nHe spent over $100 million to support Democratic candidates in the 2018 midterms, helping the party recapture the House. Steyer has also been forcefully advocating for Trump's impeachment, further thrusting the debate onto the national stage.\n\nHow much money has Tom Steyer raised?\n\nHe has not filed with the Federal Election Commission, but Steyer will reportedly spend $100 million of his fortune to run.\n\nCould Tom Steyer beat Donald Trump?\n\nInsider doesn't have enough polling data available, but will have details on this once we assemble a significantly sized base of respondents familiar with him.\n\nWhere does Tom Steyer stand on impeaching Trump?\n\nSteyer was one of the earliest proponents of impeachment and founded Need To Impeach in 2017, nine months after Trump took office.\n\nOn October 13, Steyer said at the Ohio Democratic Party's 2019 State Dinner that a Republican victory in the 2020 election could be \"the end of the world.\"\n\n\"We are in the fight of our lives,\" Steyer said. \"Everything is on the table in 2020. They think so too, because they think if they lose in 2020, the rules are going to be fair and they're never going to win again. And they're right. If we win in 2020, they're done forever. But it's scary for us, too, because if they win, literally it could be the end of the world.\"\n\nHow do Democratic voters feel about Tom Steyer's qualifications?\n\nINSIDER has conducted polling about how voters feel about candidate attributes or qualifications. We asked respondents about a list of possible qualifications and if they made them more likely or less likely to vote for a candidate for president.\n\nFor example, among respondents who said they'd vote in the Democratic primary, 19% said a candidate being a college professor made them likelier to support them, while 4% said it made them less likely to, for a +15% net favorability. We can then see how different candidates' resumes stack up compared to those preferences.\n\nAttributes perceived as most valuable include his past as an activist (+28%) and Ivy league education (+7%).\n\nAttributes considered to be a liability based on the preferences of self-reported Democratic voters include his time as a foundation owner (-4%), a business owner (-11%), his little time in government (-22%) and that he grew up rich (-42%).\n\nRead more of our stories on Tom Steyer:\n\nBillionaire activist Tom Steyer just jumped into the 2020 Democratic field after previously ruling out a presidential run\n\nThe billionaire leading the charge to impeach Trump is calling on Democrats to get the ball rolling after the Mueller report\n\nBillionaire Democratic donor Tom Steyer says 2020 presidential candidate Pete Buttigieg is the 'real deal'\n\nTrump lashes out at Tom Steyer, calling him a 'crazed & stumbling lunatic' days after a suspicious package was sent to the liberal billionaire", "description": "Billionaire environmental activist Tom Steyer is making climate change and the environment a central part of his 2020 platform.", "authors": ["Joseph Zeballos-Roig"], "top_image": "https://image.businessinsider.com/5d24b55ca17d6c09be4ba4b7?width=1200&format=jpeg", "published_at": "2019-10-14"}