{"pub": "cnn", "url": "https://cnn.com/2019/10/16/tech/virgin-galactic-beth-moses-spacesuit/index.html", "downloaded_at": "2019-10-16 23:15:41.006129+00:00", "title": "A Q&A with Beth Moses, the first passenger ever on Virgin Galactic's space plane", "language": "en", "text": "Yonkers, New York (CNN Business) Beth Moses is the first person to fly into space as a passenger aboard a commercial spacecraft.\n\nMoses, an aerospace engineer who is Chief Astronaut Instructor at Virgin Galactic , became the first woman to receive the commercial astronaut designation from the US Air Force after her flight landed in February.\n\nThat's when she flew aboard the company's rocket-powered plane, riding in the cabin behind the craft's two pilots. It was the company's second test flight to reach the edge of space. The craft traveled at speeds topping 2,300 miles per hour and climbed more than 55 miles into the sky, where Moses experienced her first view of the cosmos through the plane's cabin windows.\n\nSoon, paying customers will be aboard Galactic's space plane called VSS Unity. It's Moses' job to ensure the 600-plus customers who are paying up to $250,000 for the experience enjoy the ride.\n\nShe sat down with CNN Business at an event in New York where the company unveiled the spacesuits Under Armour designed for its passengers. The interview has been edited for length and clarity.\n\nWere there any specific requests you had for the spacesuit designs?\n\nI have to give full credit and a shout out to Under Armour and Galactic teams. Both in my flight and in mock up testing and training, I discussed how harnesses lay on the suit, and where we might add padding or avoid seams so that the whole thing works well.\n\nIn every way possible, the suit and the seat and the ship should get out of the way and just support the experience. It's a real delicate design balance, and I think they've gotten it pitch perfect between function and design.\n\nYou've told CNN Business before that your main goal is to prepare customers so they can enjoy the trip. How was your experience?\n\nI didn't have the luxury of being a customer who was there to enjoy it. I had the job of testing it, which was a very strict timeline. Now having said that, of course, I purposely checked out the view from all the windows to see if there was a great, particular place that people should not miss in the cabin.\n\nI also tested different ways of getting out of my seat and looking out the window, which customers can do when they reach microgravity. They can literally just unclip and gaze out the window while floating. And don't swim. Everybody thinks they're going to swim around, but swimming doesn't do anything in microgravity.\n\nHow long were you weightless?\n\nI had a little bit less than five minutes in weightlessness, and that's about what our customers will have as well.\n\nWhat types of G forces did you experience?\n\nIt actually maxed out at about three and a half G, three times the load of gravity. Customers may experience a little more depending on how high the flight goes. When we start commercial services, we'll find that sweet spot.\n\nWhat was the flight like?\n\nEvery moment of my flight, even the ones that you could characterize as intense, were enjoyable, comfortable, exhilarating. The positive side of intense.\n\nAs you might imagine, one is launch, 60 seconds under rocket power going three times the speed of sound. Phenomenal. The maximum G load only lasts for about two breaths, and it's not uncomfortable or overly dramatic.\n\nWill passengers have to wear any sort of helmet or oxygen supply?\n\nNope! The cabin is fully pressurized. There's nothing built into the suit that is necessary for the customers to master in order to stay safe. The ship takes care of all of that.\n\nDid you need a helmet on your flight?\n\nWhat I tested was essentially using the ship as the helmet, we used a padded ceiling and padded walls.\n\nBeth Moses looks back at Earth during her February 22 spaceflight.\n\nOne of the findings on my flight was that we had contoured that lining, and I recommended that we change those contours so that they're thicker in certain areas.\n\nWhat testing is left ?\n\nThere will be test flights with mission specialists in the cabin. When we start commercial service we'll have four passengers in the cabin, so we'll grow to that point in our test program beforehand. As we have more ships in the fleet we'll increase to a passenger count of six.\n\nWhat tips will you give customers?\n\nMy biggest advice is to simply relax.", "description": "Beth Moses is the first person to fly into space as a passenger aboard a commercial spacecraft.", "authors": ["Jackie Wattles", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190507051113-beth-moses-earth-view-super-tease.jpg", "published_at": "2019-10-16"}