{"pub": "nymag", "url": "https://vulture.com/2019/10/living-with-yourself-season-1-episode-3-recap-green-tea.html", "downloaded_at": "2019-10-19 10:49:59.757977+00:00", "title": "Living With Yourself Season 1 Episode 3 Recap: ‘Green Tea’", "language": "en", "text": "Has Living Wwith Yourself blown up its premise too soon?\n\nThat’s the main thought that passed through my head at the end of “Green Tea,” when Miles, in a jealous rage over his doppelgänger celebrating his (entirely deserved) victory, shows himself, to the utter shock of his wife, his co-workers, and Miles 2.0. This was bound to happen at one time or another— and, if I had to guess, the reveal would have been accidental — but it’s happening after only three half-hour episodes of the show, which deliberately shuts down what might have been a rich source of screwball comedy and metaphysical observation. It’s not like, say, the Michael Keaton movie Multiplicity is some kind of masterpiece, but it did exploit the premise for laughs. Living With Yourself plainly has a separate agenda.\n\nWhat makes it lamentable — or what makes it seem lamentable, anyway — is the fun of watching the two versions of Miles work together in some respects and deviate in others. When Miles 2.0 opts not to skedaddle to the tropics as planned, the timing turns out to be surprisingly good for Miles, who’s utterly confused about the expectations that he’s set at work and at home and needs help connecting the dots. It’s like the classic episode of Seinfeld where George misses the details of a project and has to ask his boss and others questions that might give him some insight into what, exactly, he’s supposed to be doing. (At one point, he and Jerry sit in a diner, scanning for clues from the lyrics of Petula Clark’s “Downtown.”) They need each other to be a single plausible person — or at least the inferior Miles needs a boost from his more inspired double.\n\nAs with the last episode, “Green Tea” circles back to a moment in an earlier episode for a change of perspective, this time passing the baton — in the form of a wedding ring — from Miles 2.0 to original-flavor Miles. Miles is grateful to have his life back, but his relief doesn’t last long: In just half a day, Miles 2.0 has set a standard for competence and charisma far higher than he’s capable of reaching. Miles returns to work the conquering hero for his winning pitch on the Hillston account, but now comes the hard work of realizing a vision that didn’t originate with him and that he honestly finds a little cheesy. The better version of him has sketches of farm animals with slogans attached, but that’s not enough for Miles to fake his way through meetings successfully, especially with the big pitch to Hillston on the horizon.\n\nStill, Miles figures correctly that he has Miles 2.0 over a barrel. He’ll agree to step in at work and certain domestic situations because “you want your old life back and you’d take whatever crumb you can get.” And so Miles creates an exciting opportunity for himself: He can send Miles 2.0 to excel at the stuff he doesn’t like, such as working his day job and entertaining guests with his wife, and he can dust off the play he’d always wanted to complete. Both are still conscientious enough to leave the intimacies with Kate exclusively to old Miles, so pecks on the cheek before work and a lovemaking session after the party is his terrain. It doesn’t seem doable in the long term because Miles 2.0 will naturally want more of what Miles has, but when they enter into this arrangement, neither of them seem to realize how quickly it will go south.\n\nBefore then, however, “Green Tea” makes some good observations about what we might actually do with the free time we fantasize about. Writing a play sounds like an appealing idea, a return to the cooler and more creative self that he’d abandoned for a career in marketing. But it turns out writing is hard. What’s easier, from the second day and beyond, is indulging in the most popular forms of 21st-century time-wasting: watching funny pet videos and pornography on the internet and playing a Candy Crush variant on his phone. (True confession: Your humble freelance recapper is currently on Level 4,863 of Candy Crush. It is my greatest achievement.) Miles also takes to a little day-drinking, too. Why not? What does he have to stay sober for?\n\nNevertheless, it eats at him at Miles 2.0 is getting all the laughs and plaudits while he’s AirPlay-ing porn on his flatscreen. So he decides to prove his meddle by studying up on the Hillston pitch and making the presentation to the old man himself. He fumbles badly, but not enough to sink the account. It’s his conversation after the meeting with Hillston that adds a crucial ethical component to what he’s doing. Hillston recognizes that Miles’s pitch didn’t come from him, and he tells a story about essentially condemning another child to death in a concentration camp by claiming he stole a ration when, in fact, it was young Hillston who’s done the stealing. Frankly, the shock value of a story like that knocks Living With Yourself off balance, but Hillston’s words have a chilling resonance nonetheless: “I don’t mind a cheater,” he says. “But if you’re going to cheat, do it right. However you came up with that campaign of yours, don’t stop.” In the rush to get ahead in life and business, he implies, nothing is off limits.\n\nAnd so when Miles 2.0 follows him around in a station wagon and smashes his driver’s side door to enjoy his victory lap at Fridays, Miles decides that the two are officially at war. He’s not interested in continuing to siphon ideas from his superior self, as Hillston suggests, but in sabotaging the entire charade. The episode ends with Miles finishing Miles 2.0’s joke, the one that got a big laugh at Kate’s house party, and with that, the jig is officially up. It’s an impulsive act, with no real consideration of the consequences. Miles just feels like his doppelgänger is getting the better of him, and this evens the score.\n\nDouble Yous\n\n• It’s not clear how either Miles thought they could get away with the money missing from a shared bank account. I was under the impression that Miles was drawing from a secret account to pay for the procedure, but that appears not to be the case. So he’d be in trouble with Kate sooner or later.\n\n• The episode gets its name from the contrast between Miles’s standard drink order, a Coke, and Miles 2.0’s healthier choice of green tea. Miles tries to change his order, but the show implies that he cannot fight his true nature.\n\n• Good to see the seasoned and talented Alia Shawkat as Miles’s half-sister, who knew about his double because Miles 2.0 has been keeping in touch. (And has been much better about supporting her work.) It’s not clear yet what role she will play in the narrative, but she’s a (mostly) nonjudgmental presence in Miles and Miles 2.0’s life, and thus a place for him to retreat.\n\n• “What do you think of the teal?” “What are you, a magician?”\n\n• If you pause over Miles’s play, it will confirm your suspicion that it’s terrible. The stage directions involve a computer screen projected over him with words like “ARTISTRY,” “GENIUS” and “FAILURE.” The first line: “I think it was Matisse who said, ‘Creativity takes courage.’ If that’s true, I’m screwed.” There is no second line.\n\n• Shawkat’s line about Miles being jealous of his doppelgänger (“You are making incredible advances in the field of feeling sorry for yourself”) makes me suspect that the show is abandoning the secret co-existence of Miles and Miles 2.0 too early, but perhaps it’s anxious to turn the page for a reason.\n\nVULTURE NEWSLETTER Keep up with all the drama of your favorite shows! Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.", "description": "Miles decides that he and Miles 2.0 are officially at war, and blows up the series’ premise. A recap of ‘Green Tea,’ episode 3 of season 1 of Living With Yourself on Netflix, starring Paul Rudd.", "authors": ["Scott Tobias"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/11/living-with-yourself-recaps/living-with-yourself-ep-3.w1200.h630.jpg", "published_at": "2019-10-19"}