{"pub": "realclearpolitics", "url": "https://msn.com/en-us/news/politics/trump-envoys-pushed-ukraine-to-commit-to-investigations/ar-AAIfE00", "downloaded_at": "2019-10-04 13:12:17.349177+00:00", "title": "Trump Envoys Pushed Ukraine to Commit to Investigations", "language": "en", "text": "© Erin Schaff/The New York Times Kurt D. Volker on Thursday on Capitol Hill.\n\nWASHINGTON — Two of President Trump’s top envoys to Ukraine worked on a statement for the country’s new president in August that would have committed Ukraine to pursuing investigations sought by Mr. Trump into his political rivals, according to three people briefed on the effort and documents released Thursday night.\n\nTheir work on the statement is new evidence of how Mr. Trump’s fixation with conspiracy theories linked to Ukraine began driving senior diplomats to bend American foreign policy to the president’s political agenda in the weeks after a July 25 call between the two leaders.\n\nSign Up For the Morning Briefing Newsletter\n\nThe statement was worked on by Gordon D. Sondland, the United States ambassador to the European Union, and Kurt D. Volker, then the State Department’s special envoy to Ukraine, according to the documents and the three people who have been briefed on the statement. Rudolph W. Giuliani, Mr. Trump’s personal lawyer and the de facto leader of a shadow campaign to push the Ukrainians to press ahead with investigations, provided the critical element of the language, Mr. Volker told House Democratic investigators on Thursday, a person familiar with his testimony said.\n\nThe Ukrainians never released the statement. But if they had, Mr. Trump’s aides would have effectively pressured a foreign government to give credence to allegations intended to undercut one of the Democratic Party’s leading 2020 presidential candidates — former Vice President Joseph R. Biden Jr. — without leaving Mr. Trump’s fingerprints on it.\n\nMr. Volker spent Thursday on Capitol Hill being questioned by House investigators as Democrats pursued their impeachment inquiry into Mr. Trump’s actions.\n\nLate Thursday, House Democrats released a series of texts between Mr. Volker, Mr. Sondland and Andriy Yermak, a top aide to the Ukrainian president, Volodymyr Zelensky, that also showed that officials in both countries understood that Mr. Trump would not grant Mr. Zelensky an Oval Office meeting he was seeking until Ukraine agreed to make a public commitment to the investigations being sought by the American side.\n\nThe texts also showed the three men discussing language for the proposed statement. On the morning of Aug. 13, Mr. Volker sent Mr. Sondland language they wanted added to an earlier draft sent by the Ukrainians.\n\n“We intend to initiate and complete a transparent and unbiased investigation of all available facts and episodes, including those involving Burisma and the 2016 U.S. elections, which in turn will prevent the recurrence of this problem in the future,” Mr. Volker said in what appears to be the language he was proposing.\n\nMr. Sondland quickly replied, “Perfect,” adding that they should send it along to an adviser to the Ukrainian president.\n\nFour days later, Mr. Sondland texted Mr. Volker, asking if they still wanted the Ukrainian president “to give us an unequivocal draft” specifically citing the two issues that Mr. Trump has been focused on: Burisma, the Ukrainian energy company that had put Mr. Biden’s younger son, Hunter Biden, on its board, and Mr. Trump’s belief that Ukraine had interfered in the 2016 American elections to benefit Hillary Clinton.\n\nMr. Volker replied: “That’s the clear message so far …”\n\nUnder questioning on Capitol Hill, Mr. Volker told House Democratic investigators that the language including specific references to Burisma and the 2016 election had come from Mr. Giuliani, the person familiar with his testimony said.\n\nMr. Volker told the House investigators that the Ukrainians had earlier proposed language promising a statement on fighting corruption that did not specifically mention Burisma and 2016. When Mr. Giuliani was shown that original language, Mr. Volker told the House, he indicated to Mr. Volker that it was not sufficient and said the Ukrainians should be asked for specific public commitments to investigate Burisma and 2016.\n\nBy Mr. Volker’s account, according to the person familiar with his testimony, he was eventually told by Mr. Yermak that the Ukrainian government could not agree to the language being sought by Mr. Giuliani. Mr. Volker told Mr. Yermak that he was right, and the idea was dropped, according to the account Mr. Volker provided the House.\n\nThe idea behind the statement was to break the Ukrainians of their habit of promising American diplomats and leaders behind closed doors that they would look into matters and never follow through, the people briefed on it said. According to the account provided by Mr. Volker to the House, the idea of the Ukrainians providing a statement had originated with Mr. Giuliani in a conversation he had with Mr. Yermak.\n\nIt is unclear if the statement was delivered to Mr. Zelensky, but no statement was released publicly under his name. Around that time, the Ukrainian officials indicated to the Americans that they wanted to avoid becoming more deeply enmeshed in American politics.\n\nThe drafting of the statement, which came in the weeks after the July 25 phone call between Mr. Trump and Mr. Zelensky, was an effort to pacify Mr. Trump and Mr. Giuliani and to normalize relations between the two countries as Ukraine faced continuing conflict with Russia. Mr. Sondland and Mr. Volker believed that Mr. Giuliani was “poisoning” Mr. Trump’s mind about Ukraine and that eliciting a public commitment from Mr. Zelensky to pursue the investigations would induce Mr. Trump to more fully support the new Ukrainian government, according to the people familiar with it.\n\nThe texts released by House Democrats late Thursday night corroborated this characterization.\n\nIn the hours before the July 25 phone call between Mr. Trump and Mr. Zelensky, Mr. Volker texted Mr. Yermak that he had “Heard from White House” that “we will nail down date” for the official Oval Office visit coveted by the Ukrainians, “assuming President Z convinces trump he will investigate” the claims that Ukrainian officials tried to sabotage Mr. Trump’s 2016 campaign.\n\nThe topic of the investigations came up during the July call between Mr. Trump and Mr. Zelensky, and Mr. Zelensky appeared open during the conversation to Mr. Trump’s request that he coordinate with Attorney General William P. Barr and Mr. Giuliani. Within weeks Mr. Volker and Mr. Sondland were strategizing about the draft statement with Mr. Yermak.\n\nThe texts suggest that, after the presidential call, negotiations picked up about a statement that would mention the investigations and satisfy Mr. Trump.\n\nOn Aug. 10, Mr. Yermak expressed a willingness “to make this declaration and mention all these things,” but noted that, first, the Ukrainians wanted to receive “guarantees for future visit” to Washington. “Once we have a date, will call for a press briefing, announcing upcoming visit and outlining vision for the reboot of US-UKRAINE relationship, including among other things Burisma and election meddling in investigations,” Mr. Yermak texted.\n\nMr. Volker replied, “Sounds great!”\n\nMr. Giuliani said he was aware of the statement but that it was not written at his behest.\n\nMr. Giuliani said that the statement was being handled by Mr. Sondland and Mr. Volker, and that he was not sure if Mr. Trump was involved in it.\n\n“I don’t have any information that would suggest that it was at his request, but I can’t tell you it wasn’t, either,” he said.\n\nHe said he believed that the statement was intended to be delivered as part of a series of announcements by Mr. Zelensky’s government about the confirmation of new prosecutors and other officials.\n\n“He was supposed to do something, or say something, to assure everybody — meaning our people — that he was going to take serious action about corruption,” Mr. Giuliani said. “I know that the investigations — which would be the collusion, the Burisma investigation — would be included in it, but it would have been part of an overall statement about dealing with corruption in an aggressive way.”\n\nThe White House did not respond to a request for comment. Aides to Mr. Zelensky did not immediately respond to requests for comment sent in the overnight hours in Ukraine.\n\nDespite Mr. Trump’s accusations of corruption on the part of the Bidens, no evidence has surfaced that the former vice president knowingly took any steps to help his son or the gas company that paid him as a board member.\n\nMr. Trump’s regular suggestions that Ukraine, rather than Russia, was responsible for the 2016 hacking of the Democratic National Committee have been thoroughly debunked. While some Ukrainian officials expressed opposition to Mr. Trump in 2016, claims by Mr. Trump and his former campaign chairman, Paul Manafort, that documents released in Ukraine that year implicating Mr. Manafort in financial fraud were falsified or doctored have not been substantiated.\n\nBut Mr. Trump’s continued efforts to press Ukraine to investigate those matters has drawn in a growing number of his aides, including Mr. Volker, who stepped down last week at the State Department’s special envoy for Ukraine, and Mr. Sondland, who has taken an increasingly prominent role in dealing with Kiev.\n\nMr. Sondland, 62, made a fortune in hotels, and has been a prominent Republican donor and fund-raiser for years.\n\nHe backed out of his role as a host of a fund-raiser for Mr. Trump in 2016 citing Mr. Trump’s disparaging comments toward immigrants and the family of a slain Muslim American soldier.\n\nBut Mr. Sondland donated $1 million through his companies to the inaugural committee for Mr. Trump, who subsequently tapped Mr. Sondland last year to be United States ambassador to the European Union.\n\nThe role traditionally has not focused heavily on Ukraine, which is not part of the European Union, but Mr. Sondland increasingly worked to establish himself as a central figure in Ukraine policy, administration officials said.\n\nMr. Sondland came to be seen in the administration as more loyal to Mr. Trump than was Mr. Volker, an acolyte of Senator John McCain, an outspoken critic of the president.\n\nMr. Sondland told reporters last month that he saw Ukraine as among a handful of “low-hanging fruit” policy areas where the European Union could work together with Washington to improve relations.\n\nMr. Sondland raised some hackles at the State Department and in the National Security Council when he asked to be included in the United States delegation that attended Mr. Zelensky’s inauguration, according to people familiar with the events. Mr. Sondland attended an Oval Office meeting afterward with other members of the delegation — which also included Mr. Volker; the energy secretary, Rick Perry; and Senator Ron Johnson, Republican of Wisconsin — to brief Mr. Trump on the delegation’s impressions of Mr. Zelensky.\n\nWhen the delegation praised Mr. Zelensky and urged Mr. Trump to fully support the new Ukrainian government, the president was dismissive. “They’re terrible people,” Mr. Trump said of Ukrainian politicians, according to people familiar with the meeting. “They’re all corrupt, and they tried to take me down.”\n\nMr. Sondland continued building a relationship with Mr. Zelensky, hosting him at a June dinner at the United States mission to the European Union in Brussels, and meeting him again in Kiev in July with Mr. Volker on the day after Mr. Trump’s phone call with Mr. Zelensky.\n\nReporting was contributed by Nicholas Fandos and Peter Baker from Washington, Maggie Haberman from New York, and Matina Stevis-Gridneff from Brussels.", "description": "WASHINGTON — Two of President Trump’s top envoys to Ukraine worked on a statement for the country’s new president in August that would have committed Ukraine to pursuing investigations sought by Mr. Trump into his political rivals, according to three people briefed on the effort and documents released Thursday night.", "authors": [], "top_image": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAIfWSB.img?h=169&w=300&m=6&q=60&o=f&l=f&x=949&y=208", "published_at": "2019-10-04"}