{"pub": "marketwatch", "url": "https://marketwatch.com/story/taliban-car-bomb-rocks-afghan-capital-near-us-embassy-area-2019-09-05", "downloaded_at": "2019-09-05 10:29:31.370546+00:00", "title": "Taliban car bomb rocks Afghan capital near U.S. Embassy area", "language": "en", "text": "KABUL, Afghanistan (AP) — A car bomb rocked the Afghan capital on Thursday and smoke rose from a Kabul neighborhood housing the U.S. Embassy, the NATO Resolute Support mission and other diplomatic missions. At least three people were killed and another 30 wounded, a hospital director said.\n\nThe Taliban claimed responsibility for the attack, saying they targeted three vehicles of “foreigners” as they tried to enter the heavily guarded Shashdarak area where the Afghan national security authorities have offices.\n\nIt was the second major blast by the militant group in Kabul this week while a U.S. envoy has been in town briefing officials on a U.S.-Taliban deal “in principle” to end America’s longest war.\n\nInterior Ministry spokesman Nasrat Rahimi said the car bomb exploded on a main road, destroying at least 12 vehicles, and police quickly sealed off the area. The blast appeared to target a checkpoint in Shashdarak.\n\nThree bodies and 30 wounded people were brought to nearby Wazir Mohammad Akbar Khan hospital, said its director, Gul Ahmad Ayubi.\n\nAn Associated Press reporter on the phone with the U.S. Embassy when the blast occurred heard sirens begin blaring there.\n\nA Taliban suicide bombing in eastern Kabul on Monday night — which the insurgents said targeted a foreign compound — killed at least 16 people and wounded more than 100, almost all of them local civilians.\n\nThe attacks are again raising questions in Kabul and in Washington about the dangers of trusting the Taliban to make peace after nearly 18 years of fighting.\n\nThe Afghan government has expressed serious concerns about the U.S.-Taliban deal, which U.S. envoy Zalmay Khalilzad has said only needs the approval of President Donald Trump to become final.\n\nKhalilzad says 5,000 U.S. troops would withdraw from five bases in Afghanistan within 135 days of a final deal. Between 14,000 and 13,000 troops are currently in the country.\n\nThursday’s blast occurred as Afghan presidential adviser Waheed Omer was speaking to reporters, warning that difficult days were ahead and describing the U.S.-Taliban deal as moving with “excessive speed.”\n\nThe Afghan government on Wednesday said it shares the concerns raised by several former U.S. ambassadors to Afghanistan. Their joint statement warned that a full U.S. troop withdrawal that moves too quickly and without requiring the Taliban to meet certain conditions, such as reducing violence, could lead to “total civil war.”\n\nThe Taliban, at their strongest since their 2001 defeat by a U.S.-led invasion, want all of the approximately 20,000 U.S. and NATO troops out of Afghanistan immediately, while the U.S. seeks a withdrawal in phases that would depend on the Taliban meeting certain conditions such as a reduction in violence.\n\nThe U.S. also seeks Taliban guarantees that they will not allow Afghanistan to become a haven from which extremist groups such as al-Qaida and the local affiliate of the Islamic State group can launch global attacks.", "description": "A car bomb rocked the Afghan capital on Thursday and smoke rose from a Kabul neighborhood housing the U.S. Embassy, the NATO Resolute Support mission and...", "authors": ["Associated Press"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ721_taliba_ZG_20190905041557.jpg", "published_at": "2019-09-05"}