{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7559613/Channel-5-unleashes-brand-new-dating-series-Posh-Date.html", "downloaded_at": "2019-10-11 00:54:39.480474+00:00", "title": "Channel 5 unleashes its brand new dating series 'My Posh Date'", "language": "en", "text": "Channel 5 has unveiled a brand new show, which will see British singletons from different social backgrounds agree to meet for a blind date.\n\nMy Posh Date, created by the makers of the nation's much-loved series First Dates, will see whether love can flourish across the class divide.\n\nDuring its very first episode, set to air at 10pm tonight, viewers will see privately educated Sam trying to woo special needs teacher Amy with his favourite pastime - punting.\n\nQuietly confident that his date will never have been a date quite like it, the investment broker will tell viewers: 'I highly doubt that someone has taken her for a punt before.'\n\nDuring the new Channel 5 show, My Posh Date, viewers will see privately educated Sam (left) meet special educational needs teacher Amy (right)\n\nViewers will watch Sam try to woo Amy with his picnic which consists of strawberries and prosecco\n\nThe couple, who come from different social backgrounds, will try to see if love can flourish across the class divide\n\nUnaware of what is waiting in store, Amy tells viewers: 'I don't have any experience of being around people who are really wealthy. '\n\nAs the blind date commences, viewers will watch in anticipation as Amy admits to Sam that she has never heard of a punt.\n\nDressed in a leather jacket and mini skirt, Amy admits to Sam: 'Never in my life I don't even know what it is.'\n\nAs the comical scenes unfold, Sam is seen armed with strawberries and prosecco for his lucky lady, while Amy clambers onto the flat-bottomed boat and tries and engage in conversation.\n\nFor their very first date Sam will take Amy punting but little does he know she has never heard of his favourite pastime before\n\nThe pair, who are meeting for the very first time, will try and see if there is a spark between them\n\nFollowing their romantic ride along the canal, Sam and Amy take a stroll to the nearby park to indulge in a posh picnic prepared by the broker himself.\n\nHowever before long disaster erupts as Amy's attempts at opening a champagne bottle see the bubbly beverage spill all over her.\n\nA startled Sam says: 'Are you okay? You're a bit wet.'\n\nTaking her cue to poke fun at the situation, Amy replies: 'Wet everywhere, and not even the good type.'\n\nAs the pair continue with their picnic, the topic of conversation soon turns to fast food and kebabs, with Sam admitting to Amy he has never indulged in the meaty treat.\n\nElsewhere viewers will meet gas fitter Jack from Lewisham and his blind date trainee barrister Holly\n\nPrior to meeting Holly, Jack's mother (right) will admit to the cameras that she is worried about the idea of her son dating a posh girl\n\nAs Holly makes her way to Jack's home she will admit to viewers that she grew up in an area surrounded by fields rather than high-rise buildings\n\nMaking the confession he says: 'Unfortunately I didn't pack the kebabs. I like to sit down at a table when I eat.'\n\nElsewhere viewers will also meet gas fitter Jack from Lewisham and trainee barrister Holly who come from very different backgrounds.\n\nJack is seen eagerly anticipating Amy's arrival to his home with his supportive mother, who is worried about the idea of her son dating a 'posh girl'.\n\nConfessing her fears to the cameras, Jack's mother says: 'I'm obviously worried about it. I don't like girls that are overdone and the way girls talk is important.'\n\nThe pair will sit down for a drink as viewers watch with anticipation to see if love can flourish between them\n\nPrior to meeting Jack, the trainee barrister tells viewers that she is nervous about the blind date\n\nViewers will eagerly watch the couple as they try to find common ground despite coming from different social backgrounds\n\nShe continues: 'She's from a totally different background so obviously I'll be weighing her up'.\n\nAs the mother-son duo wait for Holly to arrive, the trainee barrister is seen making her way through streets that look very different from where she was raised.\n\nShe admits to viewers: 'So this is my first time in Lewisham, from what I see of it it is obviously up and coming. I grew up with fields we certainly didn't have any high rise buildings. I'm like a fish out of water.\n\n'I am nervous there is quite a lot riding on this.'\n\nThe very first My Posh Date will air at 10pm on Channel 5 on October 10.", "description": "Channel 5 has unveiled a brand new show, which will see British singletons from different social backgrounds agree to meet for a blind date.", "authors": ["Bhvishya Patel For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/18/19552340-0-image-a-27_1570730278689.jpg", "published_at": "2019-10-10"}