{"pub": "breitbart", "url": "https://breitbart.com/sports/2019/10/14/lebron-james-laments-nbas-hard-week-as-crackdown-hong-kong-protests-continues", "downloaded_at": "2019-10-15 08:01:52.411838+00:00", "title": "LeBron James Laments NBA’s ‘Hard Week’ as Crackdown on Hong Kong Protests Continues", "language": "en", "text": "On Tuesday night, NBA star and social justice warrior LeBron James said that Rockets General Manager Daryl Morey “wasn’t educated,” when he posted a pro-democracy tweet in support of Hong Kong almost two weeks ago.\n\nIn addition, James cited the “negative” side-effects of free speech and pointed out that Morey’s tweet could have caused physical harm.\n\nWatch:\n\nLeBron says he believes Rockets GM Daryl Morey wasn’t educated when he spoke about Hong Kong and that his tweet could have hurt a lot of people, including financially pic.twitter.com/UMj71DPQH7 — Darren Rovell (@darrenrovell) October 15, 2019\n\nShortly after those comments began going viral on social media, James took to Twitter to try to defuse the situation by saying that he had no issue with the substance of Morey’s tweet, only the timing of it.\n\nMy team and this league just went through a difficult week. I think people need to understand what a tweet or statement can do to others. And I believe nobody stopped and considered what would happen. Could have waited a week to send it. — LeBron James (@KingJames) October 15, 2019\n\nLet me clear up the confusion. I do not believe there was any consideration for the consequences and ramifications of the tweet. I’m not discussing the substance. Others can talk About that. — LeBron James (@KingJames) October 15, 2019\n\nFar from clearing up the confusion, LeBron’s tweets seem to only add to it.\n\nIf the Lakers star merely had an issue with the timing of Morey’s tweet, he could have just said that. Instead, James said that Morey “wasn’t educated on the situation at hand.” Which sounds a lot more like James had issue with the substance of Morey’s tweet.\n\nIt’s also interesting that LeBron – not a college graduate – believes that Morey – a graduate of Northwestern and MIT – “wasn’t educated” on the issue. Does LeBron believe he knows more about the issues between Hong Kong and mainland China than Morey does? Morey’s tweet was simply a message of support for democracy. Does James believe the alternative to democracy is the better alternative? If democracy is the best answer (it is) then why would anyone need to be reeducated for supporting it?\n\nNot to mention James’ lamenting of the NBA’s “hard week” in China, while pro-democracy demonstrators were facing violent police crackdowns in some cases less than 50 miles from the luxury hotels where NBA players were staying.\n\nLeBron James will likely get many opportunities to answer these questions in the coming days. In taking a story that was fading from the headlines and breathing new life into it, James has needlessly and recklessly reignited the flames of the NBA-China controversy. Moreover, in defending China and attacking Morey, he has thrown his weight behind a ruthlessly oppressive dictatorship which stands against every principle he has spent the last few years claiming to believe in.\n\nFollow Dylan Gwinn on Twitter @themightygwinn", "description": "On Tuesday night, NBA star and social justice warrior LeBron James said that Rockets General Manager Daryl Morey \"wasn't educated,\"", "authors": ["Dylan Gwinn"], "top_image": "https://media.breitbart.com/media/2019/10/Getty-Images_Zhizhao-Wu-640x335.jpg", "published_at": "2019-10-14"}