{"pub": "nyt", "url": "https://nytimes.com/2019/09/04/world/europe/brexit-boris-johnson-parliament.html", "downloaded_at": "2019-09-04 23:48:09.665987+00:00", "published_at": "2019-09-04", "title": "U.K. Lawmakers Batter Johnson Again, Defying Him on Brexit and Election", "language": "en", "text": "However the wrangling in Parliament comes out in the coming days, most analysts believe that an election is inevitable in the near future after years of stalemate over Brexit, and is probably the only way to break the cycle of endless and fruitless debate.\n\nThe latest crisis was precipitated by Mr. Johnson’s decision last week to suspend the sittings of Parliament in September and October, a move that prompted claims that he was subverting the conventions of Britain’s unwritten constitution. It also provoked legal challenges, and on Wednesday a judge in Scotland ruled against a challenge seeking to invalidate Mr. Johnson’s decision to prorogue Parliament for five weeks.\n\nHis initial decision galvanized his critics in the Conservative Party who believed that Mr. Johnson’s intention was to unite Brexit supporters behind him ahead of an election, rather than to negotiate a new exit deal with the European Union.\n\nThe rebellion, and the purge of those Conservative members of Parliament, was the culmination of Downing Street’s unusually aggressive tactics. Some of the party’s best-known and most respected lawmakers were ejected from their political home, in some cases after decades of service.\n\nThose disciplined include two former chancellors of the Exchequer: Philip Hammond, who left the post only a few weeks ago; and Kenneth Clarke, the longest-serving lawmaker in Parliament.\n\nOut, too, went Nicholas Soames, grandson of Winston Churchill and the grandest and most colorful of the Tory grandees. His voice close to cracking, Mr. Soames announced that he would not run again in the next election after almost 37 years in Parliament.", "description": "After lawmakers seized control of Brexit from the prime minister, they doubled down by rejecting his request for an October election. Though a setback for Mr. Johnson, it may be only temporary.", "authors": ["Stephen Castle"], "top_image": "https://static01.nyt.com/images/2019/09/03/world/04brexit1-promo2/04brexit1-promo2-facebookJumbo-v5.jpg"}