{"pub": "investing.com", "url": "https://in.investing.com/equities/coral-india-finance-and-housing-bo", "downloaded_at": "2019-10-16 06:47:24.341729+00:00", "title": "Coral India Finance and Housing Ltd Share Price - Investing.com India", "language": "en", "text": "Coral India Finance and Housing Ltd (CORI) BSE Add to/Remove from a Portfolio Add to Portfolio\n\n10.10 -1.83 -15.34% 11:56:07 - Real-time Data. Currency in INR Disclaimer ) - Real-time Data. Currency in Type: Equity Market: India ISIN: INE558D01021 S/N: 531556 Volume: 1,117\n\nBid/Ask: 10.10 / 10.42\n\nDay's Range: 10.10 - 10.96\n\nCoral India Finance 10.10 -1.83 -15.34%\n\nCORI Overview\n\nPrev. Close 11.93 Day's Range 10.1 - 10.96 Revenue 153.4M Open 10.81 52 wk Range 9.21 - 22.9 EPS 1.95 Volume 1,117 Market Cap 503.78M Dividend (Yield) 0.20 (1.68%) Average Volume (3m) 2,257 P/E Ratio 5.34 Beta N/A 1-Year Change - 25.2% Shares Outstanding 49,879,000 Next Earnings Date Nov 01, 2019\n\nWhat is your sentiment on Coral India Finance? or Members' Sentiments: Bullish Bearish Vote to see community's results!\n\nType 5 mins 15 mins Hourly Daily Monthly Moving Averages Strong Sell Strong Sell Strong Sell Strong Sell Strong Sell Technical Indicators Strong Sell Strong Sell Strong Sell Strong Sell Strong Sell Summary Strong Sell Strong Sell Strong Sell Strong Sell Strong Sell\n\nFilter Table By: Candle Sticks Characteristics: Time Frame ALL 15 30 1H 5H 1D 1W 1M Type ALL Bullish Bearish Pattern Indication ALL Reversal Continuation Reliability High / Mid / Low High / Mid High Only Apply Restore Default Settings\n\nPattern Timeframe Reliability Candles Ago Candle Time Completed Patterns Abandoned Baby Bullish 5H 2 Oct 14, 2019 13:30 Bullish Engulfing 5H 2 Oct 14, 2019 13:30 Abandoned Baby Bullish 1H 2 Oct 14, 2019 14:30 Bullish Engulfing 1H 2 Oct 14, 2019 14:30 Bullish Engulfing 1W 5 Sep 08, 2019\n\nCoral India Finance and Housing Ltd Company Profile\n\nCoral India Finance and Housing Limited is an India-based housing development company, which is engaged in the business of finance, construction, development and maintenance of properties. The Company's main products and services are investment and construction. The Company operates through two segments: Investment and Construction. The Company has developed projects spread across commercial complexes and residential developments. Its projects include Coral Garden Square Bungalow Scheme, Coral Garden Twin Bungalow Scheme and Coral Heights. Read More\n\nStart Trading With Top Industry Brokers\n\nBrokers Regulation Minimum Deposit Malta Financial Services Authority (Malta), Dubai Financial Services Authority (United Arab Emirates), Financial Market Supervisory Authority (Switzerland), The Securities and Futures Commission (Hong Kong) $1000 Start Trading Financial Services Commission (British Virgin Islands) $1 Start Trading\n\nYour ability to comment is currently suspended due to negative user reports. Your status will be reviewed by our moderators. Please wait a minute before you try to comment again.\n\nDisclaimer: Fusion Media would like to remind you that the data contained in this website is not necessarily real-time nor accurate. All CFDs (stocks, indexes, futures), cryptocurrencies, and Forex prices are not provided by exchanges but rather by market makers, and so prices may not be accurate and may differ from the actual market price, meaning prices are indicative and not appropriate for trading purposes. Therefore Fusion Media doesn't bear any responsibility for any trading losses you might incur as a result of using this data. Fusion Media or anyone involved with Fusion Media will not accept any liability for loss or damage as a result of reliance on the information including data, quotes, charts and buy/sell signals contained within this website. Please be fully informed regarding the risks and costs associated with trading the financial markets, it is one of the riskiest investment forms possible.", "description": "Access detailed information about the Coral India Finance and Housing Ltd (CORI) Share including Price, Charts, Technical Analysis, Historical data, Coral India Finance Reports and more.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/investing_300X300.png", "published_at": "2019-07-30"}