{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/sportsnews/article-7563665/Ex-Wales-star-David-Cotterill-cheated-team-mates-400-000-faces-legal-action.html", "downloaded_at": "2019-10-11 20:38:10.212163+00:00", "title": "Ex-Wales star David Cotterill 'cheated team-mates out of £400,000' and faces legal action", "language": "en", "text": "Former Wales international David Cotterill is facing legal action from at least seven former team-mates after being accused of cheating them out of a combined total of almost £400,000, Sportsmail can reveal.\n\nThe recently retired winger, who won 24 senior caps during a 14-year career which finished at Indian club Atletico de Kolkata last January, owes tens of thousands of pounds to at least seven current and former players after allegedly convincing them to invest in property schemes and asking for short-term loans, many of which have not been repaid.\n\nCotterill's debts to fellow professionals are understood to total £370,000, with the money owed ranging from £5,000 to £120,000. The loan arrangements and payments were made between 2014 and 2018, during which time he was a regular for Wales, being a member of the squad alongside Gareth Bale and Aaron Ramsey that reached the semi-finals of the 2016 European Championship in France.\n\nDavid Cotterill is facing legal action from at least seven former team-mates over investments\n\nThe former Wales international was a part of the Euro 2016 side that reached the semi-finals\n\nFor most of that period Cotterill was playing in the Championship with Birmingham having had two spells in the Premier League with Wigan and Swansea before returning to his first club Bristol City in 2017 and ultimately finishing his career in the Indian Super League.\n\nCotterill's largest outstanding liability is over £120,000, which is owed to a senior player currently at a Championship club, while he also owes five other players sums in excess of £35,000.\n\nAll seven players have instructed lawyers in the hope of regaining their investments after some complained of being spoken to aggressively by Cotterill when dealing with him directly. Most of those owed money are still playing, while one has retired but remains in the game and is a coach at an EFL club.\n\nSportsmail has seen legal documents pertaining to some of Cotterill's loans, and been told about his methods by multiple sources. The 31-year-old's sales pitch, which was often targeted at younger players, was reportedly to offer quick returns for investors providing lump sums in cash, with promises of profits of between 10 and 20 per cent within a couple of months.\n\nAt the height of his career, Cotterill was a £2million signing for Premier League side Wigan\n\nIn one loan agreement which has been seen by Sportsmail Cotterill writes to an investor: 'Further to our conversation earlier you have agreed to invest £35,000 to receive £4,000 profit, plus investment back, within 8 weeks of the money hitting the bank account. The investment will be going into a property, but the agreement between the parties is below.'\n\nCotterill has admitted that he has outstanding debts to several players, acknowledging he has made mistakes, but is trying to make amends. His explanation for failing to repay many of the loans is that they were taken out at a time when he was suffering from depression and alcohol dependency, problems which led him to set up his own foundation earlier this year.\n\nSeveral of Cotterill's investors have told Sportsmail that they are experiencing from some of the mental health problems his charity is dedicated to combatting however, with many suffering from anxiety over the loss of life savings and developing other problems as a result of years spent attempting to recover lost earnings.\n\nHis last club in the UK was Birmingham City, before ending his career in India with ATK in 2018\n\nCotterill is also experiencing financial problems, to the extent that he has recently moved back in with his parents, but has begun the process of attempting to pay back some of the money.\n\nHe is understood to have made some repayments through Individual Voluntary Arrangements (IVA's) set up under the Insolvency Act with his creditors, although several payments have been missed and others have been for the incorrect amount. One player has had a statutory demand for £60,000 ignored.\n\nCotterill, who at the height of his club career was a £2million signing for Premier League Wigan Athletic in 2006 before being sold to Swansea for £600,000 three years later, appears to have used the money he borrowed from team-mates to help fund a glamorous lifestyle.\n\nHis Instagram page shows trips to five-star resorts in Mykonos, sees him photographed in Ibiza and Paris as well as having pictures from his wedding day in June 2017 at the exclusive Aynhoe Park in Northamptonshire, where packages start from £20,500.\n\nThe former midfielder married his wife Tamika in 2017 at Aynhoe Park in Northamptonshire\n\nPackages at the exclusive venue where the pair were wed in June 2017 start from £20,500\n\nPictures posted on the ex-professional's Instagram also show holidays in Mykonos and Paris\n\nCotterill has been open about suffering from mental health problems and alcoholism since his retirement last year, and has set up a foundation in his own name with a view to helping those experiencing similar problems.\n\nHe first spoke about his depression in an interview with the BBC September 2018 before revealing he was struggling with alcoholism seven months later. On his Linkedin profile he describes himself as a Mental Health Consultant and he gives talks to players, clubs and other charities, including some this week.\n\nThe David Cotterill Foundation was incorporated in July 2019 and registered to an address in Cardiff. Cotterill, his wife Tanika - whom he has separated from - and business partner Wayne Matthews are listed as directors for a charity that has yet to file any accounts, with a confirmation statement due next August.\n\nThe Foundation have hosted Mental Health Anonymous workshops in Cardiff and worked with at least three EFL clubs. A quote attributed to him on the charity's website claims he was offered 'very limited support' within football as a player.\n\nCotterill declined to comment.", "description": "EXCLUSIVE INVESTIGATION:David Cotterill is facing legal action from at least seven former team-mates after being accused of cheating them out of a combined total of almost £400,000.", "authors": ["Matt Hughes", "Harry Slavin For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/16/19597202-0-image-a-47_1570808983594.jpg", "published_at": "2019-10-11"}