{"pub": "fox", "url": "https://foxnews.com/tech/fifa-20-glitch-exposes-players-personal-details", "downloaded_at": "2019-10-04 17:05:16.841478+00:00", "title": "'FIFA 20' video game glitch exposes players' personal details", "language": "en", "text": "A glitch in the new \"FIFA 20\" video game has exposed the personal details of a number of players.\n\nGame developer EA Sports tweeted on Thursday that some players noticed the leak when they were on the registration portal page for the EA Sports FIFA 20 Global Series competition. Players in the Global Series can qualify to compete in an eWorld Cup tournament.\n\n16-YEAR-OLD WINS $3M PLAYING 'FORTNITE'\n\n“At approximately 1pm UK Time, we announced the registration portal page for the EA SPORTS FIFA 20 Global Series. Shortly after, we learned that some players trying to register were seeing the information of other players who had already signed up through the registration page,” said EA Sports in a statement. “We immediately took action to shut down the site by 1:30pm UK Time. We were able to root cause the issue and implement a fix to be clear that information is protected. We’re confident that players will not see the same issue going forward.”\n\nEA Sports, a division of video game giant Electronic Arts, said it thinks 1,600 players were potentially affected by the issue. “We are taking steps to contact those competitors with more details and protect their EA accounts,” the video game publisher added.\n\nUNOPENED 1987 NINTENDO VIDEO GAME FOUND IN ATTIC, EXPECTED TO SELL FOR $10G\n\nThe popular FIFA series is one of Electronic Arts’ big-name titles. During the company’s fiscal year 2019, more than 45 million unique players participated in “FIFA 18” and “FIFA 19” on console and PC, the company explained in its quarterly results released in May.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\n\"FIFA 20\" was released on Sept. 27, 2019.\n\nFollow James Rogers on Twitter @jamesjrogers", "description": "A glitch in the new \"FIFA 20\" video game has exposed the personal details of a number of players.", "authors": ["James Rogers"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/FIFA20Getty2019.jpg", "published_at": "2019-10-04"}