{"pub": "nytimes", "url": "https://nytimes.com/2016/11/22/magazine/billionaires-vs-the-press-in-the-era-of-trump.html", "downloaded_at": "2019-09-15 00:09:29.802947+00:00", "title": "Billionaires vs. the Press in the Era of Trump", "language": "en", "text": "Superrich plaintiffs, however, aren’t subject to the same market forces. They can treat suing the press as an investment, with the payoff being, at a minimum, the expense and time required for the other side to produce documents and sit for depositions. In February 2012, the magazine Mother Jones published a story about the Idaho billionaire Frank VanderSloot, a major donor to a “super PAC” that supported the Republican presidential candidate, Mitt Romney. In 1999, in response to a documentary, he sponsored billboards that asked, “Should public television promote the homosexual lifestyle to your children?” The magazine wrote that VanderSloot “outed” a gay reporter, Peter Zuckerman, and “bashed” Zuckerman and his reporting after he helped break a story in 2005 about a history of pedophilia by a Boy Scouts camp counselor in Idaho Falls. The portrayal of VanderSloot was based partly on several ads that he placed in The Idaho Falls Post Register. VanderSloot was upset at the story’s implications for the Boy Scouts, and the ads called Zuckerman a “homosexual” and attacked him for having “a personal ax to grind.”\n\nVanderSloot sued Mother Jones for libel over the article. “They wanted to give me a public beating because I made a sizable donation to Mitt Romney,” he told me. VanderSloot, who owns an online health-shopping club, also said the Mother Jones article cost him customers.\n\nOver three years of proceedings, which included turning over internal emails, Mother Jones racked up about $2.5 million in legal fees. Insurance didn’t cover the whole cost. “The suit was a huge drain on us,” Clara Jeffery, editor in chief of the magazine, told me. “We’re still digging our way out.”\n\nJudge Darla Williamson finally threw out VanderSloot’s suit in October 2015, finding that Mother Jones’s statements about him were either substantially true or opinions protected by the First Amendment. But Williamson took the unusual step of including a section in her opinion partially supporting his underlying complaint, accusing the magazine of “mudslinging” rather than recognizing its approach as squarely within the tradition of investigative journalism. Despite his defeat, VanderSloot declared himself “absolutely vindicated” and announced that he was creating a “Guardian of True Liberty Fund” to aid other people who want to sue the “liberal press.” The fund has grown to between $1 million and $2 million, he told me, with five times that amount pledged, so that “as soon as something hits we think is worth it, we can go after it.”\n\nIt was another billionaire, Peter Thiel, who realized the full potential of bankrolling other people’s lawsuits. Thiel, an influential figure in Silicon Valley who was a founder of PayPal and sits on the board of Facebook, is now an adviser to Donald Trump. Thiel and other Silicon Valley executives were regular targets of Gawker’s aggressive reporting and mockery. In 2007, the site ran an article titled “Peter Thiel Is Totally Gay, People.” Thiel didn’t sue on his own behalf. But he secretly paid a Hollywood lawyer, Charles Harder, at least $10 million to sue Gawker on behalf of a suite of plaintiffs. Neither Thiel or Harder will say how many suits Thiel funded, but Harder has filed at least five against the website and its writers and editors. (He also represents Melania Trump in a $150 million suit in the United States against the British tabloid The Daily Mail and a Maryland blogger for calling her an “escort.”) When Thiel’s role was revealed by Forbes magazine, Thiel said his goal was “less about revenge and more about specific deterrence.” Asked in October about his secrecy, Thiel said, “Transparency would have turned it into this very different narrative” that “it’s this billionaire trying to squash the First Amendment.” (He declined to comment for this article.)\n\nLast March, while Thiel’s role remained hidden, one of the suits he funded went to trial in Florida. The plaintiff, the aging wrestler-entertainer Hulk Hogan, sued Gawker for violating his privacy by publishing a brief video clip in October 2012 that showed him having sex. Hogan, whose real name is Terry G. Bollea, testified that he was emotionally devastated. Yet when he learned of the existence of the sex tape seven months earlier, Hogan appeared on “TMZ Live,” joking about having sex with “several brunettes.”", "description": "A small group of superrich Americans — the president-elect among them — has laid the groundwork for an unprecedented legal assault on the media. Can they succeed?", "authors": ["Emily Bazelon"], "top_image": "https://static01.nyt.com/images/2016/11/27/magazine/27libel/27libel-facebookJumbo-v5.jpg", "published_at": "2016-11-22"}