{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/nfl/article-7538675/NFL-partners-Royal-Mint-produce-special-coin-commemorating-100th-anniversary-NFL.html", "downloaded_at": "2019-10-05 08:20:00.692213+00:00", "title": "NFL partners with the Royal Mint to produce special coin commemorating 100th season of the NFL", "language": "en", "text": "The NFL has unveiled a limited-edition commemorative medallion, produced by the Royal Mint, ahead of the first NFL game to be played at the Tottenham Hotspur Stadium.\n\nThe special coin, which is also to commemorate the NFL's 100th season this year, will be given to every player, coach and official involved in Sunday's game between the Chicago Bears and the Oakland Raiders.\n\nFormer NFL cornerback and NFL Show pundit Jason Bell posed with the coin, as did NFL ambassador and GB hockey gold medalist Sam Quek.\n\nThe Commemorative coin was produced by the Royal Mint in partnership with the NFL\n\nNFL Ambassador and 2016 GB hockey gold medalist Sam Quek with the medallion\n\nEx-NFL player Jason Bell, who is seen on the BBC's NFL coverage, also poses with the coin\n\nThe Managing Director of NFL UK, Alistair Kirkwood, said: 'Our collaboration with The Royal Mint is a fitting tribute for the NFL's 100th season, and the first ever fixture at the new Tottenham Hotspur Stadium.\n\n'It is a truly memorable way to kick-off this year's London Games and is an honour to be recognised in this manner by one of the UK's most historic institutions.'\n\nThe coin not only has the helmets of both the Bears and the Raiders incorporated on it, but it also has the emblem for the 2019 London Games and has references to the 100th season and Tottenham's stadium.\n\nDirector of Consumer for the Royal Mint, Nicola Howell, also commented: 'The Royal Mint is famous for creating coins and medals commemorating the world’s most iconic sports and athletes.\n\nThe medallion showing the 2019 London Games Logo - there are four games in the capital\n\n'We were delighted to partner with the NFL to mark their 100th season.\n\n'We have created 500 medallions to celebrate the occasion, and on Sunday one of these exclusive pieces will kick start the action when it’s used in the coin toss.'\n\nSunday's inaugural match at the Tottenham Hotspur Stadium kicks off at 6:00pm - it is the first of two matches this season, in a partnership between the NFL and Tottenham Hotspur set to last for 10 years.", "description": "The special coin, which is also to commemorate the NFL's 100th season this year, will be given to every player, coach and official involved in Sunday's inaugural game at the stadium.", "authors": ["Kieran Jackson For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/16/19304480-0-image-a-18_1570204352478.jpg", "published_at": "2019-10-04"}