{"pub": "investingcom", "url": "https://investing.com/news/forex-news/carney-says-brexithit-pound-looks-like-emerging-market-currency-1974598", "downloaded_at": "2019-09-11 00:46:49.185903+00:00", "title": "Carney Says Brexit-Hit Pound Looks Like Emerging Market Currency", "language": "en", "text": "© Reuters. Carney Says Brexit-Hit Pound Looks Like Emerging Market Currency\n\n(Bloomberg) -- Pound volatility is at emerging-market levels and U.K. assets are set for a substantial repricing once the Brexit outcome becomes known, according to Bank of England Governor Mark Carney.\n\nCarney made the comparison, which echoes a long-standing quip on trading desks, at an event in New York on Tuesday. When asked to comment on the current level of the pound, the governor initially dodged the question, before highlighting the heightened level of volatility of U.K. assets.\n\n“Sterling volatility, as you would know, is at emerging market levels and has decoupled from other advanced economy pairs for obvious reasons,” Carney said. “A variety of other indicators show financial markets are going to move substantially in one way or another depending on the outcome of” Brexit.\n\nThe U.K. currency has seen some extreme highs and lows over the past few months as the endgame approaches, rallying to $1.32 in May before plunging below $1.20 earlier this month. The turmoil even raised sterling volatility above that of the Turkish lira earlier this year.\n\nThe currency has fallen close to 20% since the 2016 referendum and its fate remains highly dependent on the outcome of Britain’s exit from the European Union. Sterling would rally to $1.33 on a Brexit deal and plunge to $1.10 on a no-deal exit, according to a recent Bloomberg survey.\n\nStill, Carney’s comments come as implied volatility on the pound-dollar pair has actually taken a leg lower with the confirmation that U.K. lawmakers are on an enforced holiday until mid-October. A one-month gauge of price swings fell to the lowest in over a month Tuesday, with a similar move seen in the three-month as lawmakers voted to force Prime Minister Boris Johnson to seek a Brexit delay if he can’t secure a deal next month.\n\nIn further comments on markets, Carney reiterated remarks made in Jackson Hole, Wyoming last month that there’s a risk of falling into a global liquidity trap. While inverted yield curves were not the strongest vote of confidence in the global economy, “it’s easier to invert the curve now than previously,” he said.\n\nA global economic slowdown was underway, but there was fiscal space to counter the situation, Carney said, adding that he doesn’t see negative interest rates as a tool in the U.K.", "description": "Carney Says Brexit-Hit Pound Looks Like Emerging Market Currency", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB750SH_L.jpg", "published_at": "2019-09-10"}