{"pub": "usatoday", "url": "https://usatoday.com/story/sports/soccer/2019/10/05/reina-saves-penalty-as-milan-wins-2-1-at-genoa/40269449", "downloaded_at": "2019-10-05 22:10:11.904760+00:00", "title": "Reina saves penalty as Milan wins 2-1 at Genoa", "language": "en", "text": "CLOSE\n\nMILAN (AP) — Pepe Reina made up for an earlier error by saving a stoppage-time penalty as AC Milan came from behind to win 2-1 at Genoa on Saturday and snap a three-match losing streak in Serie A.\n\nBoth sides ended a dramatic match with 10 men.\n\nMilan coach Marco Giampaolo was under pressure after his side had picked up just six points from the opening six rounds.\n\nReina was a late replacement for regular Milan goalkeeper Gianluigi Donnarumma, who felt sick after the warmup. The veteran Spaniard was at fault for the opener as he misjudged Lasse Schone's 30-yard free kick, which gave Genoa the lead four minutes before the break.\n\nTheo Hernandez leveled for Milan early in the second half and matters went from bad to worse for Genoa five minutes later, when defender Davide Biraschi was shown a straight red card for handball and Franck Kessie converted the resulting penalty.\n\nHowever, Milan also had a player sent off when Davide Calabria was shown a second yellow card for a shirt tug on Genoa forward Christian Kouamé, 11 minutes from time.\n\nGenoa was handed a golden opportunity to snatch a point when it was awarded a 93rd-minute penalty after Reina was harshly judged to have fouled Kouamé but the 37-year-old keeper saved Schone's spot kick.\n\nOTHER MATCHES\n\nSampdoria coach Eusebio Di Francesco's job is under threat after his last-place team lost 2-0 at Hellas Verona for its sixth defeat in seven matches.\n\nMarash Kumbulla headed in a corner for his first Serie A goal in the ninth minute and Verona sealed the result with a Nicola Murru own-goal.\n\nSpal had also lost five of its opening matches but beat Parma 1-0, with Gabriel Strefezza providing an assist for Andrea Petagna in the first half and getting sent off for a second yellow card in the 70th minute.\n\n___\n\nMore AP soccer: https://apnews.com/apf-Soccer and https://twitter.com/AP_Sports\n\nCopyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "Pepe Reina made up for an earlier error by saving a stoppage-time penalty as AC Milan came from behind to win 2-1 at Genoa on Saturday and snap a three-match losing streak in Serie A", "authors": ["Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/642155f5d61f77691fd28101a96a88ef8bb5a062/c=0-164-3072-1892/local/-/media/2019/10/05/USATODAY/usatsports/afba712b8112406a8a8adc836df2c848.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-05"}