{"pub": "cryptocoin", "url": "https://cryptocoin.news/token-news/october-15-2019-zilliqa-zil-up-1-38-31156", "downloaded_at": "2019-10-15 11:21:21.602439+00:00", "title": "October 15, 2019: Zilliqa (ZIL): Up 1.38%", "language": "en", "text": "Zilliqa: What’s the Latest Regarding its Price?\n\nAt the time of this writing, Zilliqa has a price of $0.005745 USD, which puts it up by approximately 1.38% from yesterday. Yesterday’s up day is a reversal of the day before it; in terms of trend, though, note that the current price is now 4.71% above its 20 day moving average, and is currently in an up trend over the past 14 days. Zilliqa’s expected trading range — as forecasted by the Bollinger bands indicator, which determines a range based on momentum and volatility over the past two weeks — is between $0.004823 and $0.00615. Price’s current proximity to the top of the range may make selling an attractive opportunity to traders interested in trading the range.\n\nTrade Zilliqa (ZIL) and over 500 other cryptos across ten different exchanges — all from one app. Try Quadency.\n\nThe market capitalization of Zilliqa, or the amount of US dollars it would take to buy up all the circulating coins, is currently estimated to be $50 million.\n\nUpdate on Transactions and Holders\n\nOver the past 24 hours, 24 transfers have been added to the blockchain recording transactions amongst holders of Zilliqa. Regarding a tally of holders, Yesterday saw Zilliqa’s wallet count drop by 0. To provide context, we’d rank this token as 33 out of the 35 Ethereum tokens in our index based on percentage growth in engagement over the past 7 days.\n\nHow are the Strong Holders of Zilliqa Faring?\n\nOf the coin’s total money supply, the richest 1,0000 wallets currently own 98.28%. If we focus on exchanges, which may be an correlated with liquidity and greater confidence in the currency, the exchange wallets that are in the top 1,000 wallets own 10.02% of the currency’s total money supply. The week over week growth rate in the share of the total supply of the top 1,000 wallets has changed by 0.01%; as for the share of the total supply owned by exchange wallets within the top 1,000 wallets, that has changed by 0.17%.\n\nHow Much Development is Occurring?\n\nIn terms of how active the software development team working on Zilliqa is, it may be worth observing that the last time any work pertaining to code was done on their GitHub code repository was on October 14, 2019, or approximately 1 days before. To understand how code development is progressing, we can observe growth rates over the past 30 days in the number of open issues and the number of watchers: open issuers have been growing at about 0.37 per day, while the number of followers watching Zilliqa’s repositories is growing by 0.87.\n\nThe Latest on Zilliqa and Social Media\n\nIn the past day, Zilliqa’s Twitter followers and Reddit subscribers went up by 12 and 1, respectively. Traders interested in following Zilliqa has the biggest presence on Twitter, where it has 66,309 users engaged. Use this link to follow Zilliqa on Twitter.\n\nWhere to Buy\n\nYou can trade Zilliqa, listed under the symbol ZIL, through the following exchanges: Gate, Yobit, Binance, DDEX, Ethfinex.\n\nArticle by SixJupiter", "description": "", "authors": [], "top_image": "https://cryptocoin.news/wp-content/uploads/2019/04/zilliqa.jpg", "published_at": "2019-10-15"}