{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/2-key-indicators-show-eth-bnb-could-rally-as-bitcoin-price-eyes-9k", "downloaded_at": "2019-10-11 05:58:41.303743+00:00", "title": "2 Key Indicators Show ETH, BNB Could Rally as Bitcoin Price Eyes $9K", "language": "en", "text": "After several months of difficulty, many altcoins such as Ether (ETH), Chainlink (LINK) and Binance Coin (BNB) finally show signs of life on the charts providing hope for a new bull-run.\n\nAs 2019 nears its end, Bitcoin price (BTC) looks back on an overall positive year. Crypto’s largest asset rose from $3,330 to $13,880 in the first half of the year before retracing down to $7,715 several months later.\n\nAltcoins shared in the exuberance surrounding Bitcoin’s parabolic price rise, with the majority of top market cap cryptocurrencies posting notable gains. After painting its 2019 high of $13,880, however, Bitcoin declined in price, posting lower highs. During this period, altcoins lost all momentum they had gained during Bitcoin’s price run, spiraling into strong downtrends.\n\nThe state of the altcoin market seems to have changed though, as Bitcoin’s market dominance falls and many digital assets start to show positive market data. Some altcoin projects have also come forward with announcements, adding positive sentiment to the scene.\n\nDaily crypto market performance. Source: Coin360.com\n\nBitcoin dominance is falling\n\nAs the cryptocurrency market leader, Bitcoin often paves the way for altcoins in one form or another. Many analysts often look to Bitcoin’s market dominance as a metric for altcoin health.\n\nBTC % Dominance daily chart. Source: TradingView\n\nBitcoin dominance shows the amount of money in the crypto market that is currently invested in Bitcoin, comparative to the rest of the altcoins. At press time, Bitcoin dominance holds at 66%, which means 66% of the money in the crypto space currently is invested directly in Bitcoin.\n\nAt the height of the last monumental alt season in January 2018, Bitcoin dominance visited levels as low as 35%, while most altcoins tallied drastic gains on a daily basis.\n\nBitcoin dominance currently heads in the right direction for an altcoin recovery, down 4% from its 2019 high. TradingView shows that Bitcoin dominance has fallen below the 100-day moving average (MA), successfully flipping the level to resistance as shown by a failed retest of the level.\n\nBitcoin dominance also shows a break in market structure, tallying a lower high on its most recent significant bounce up to 71.90%, followed by a lower low. Barring any significant negative news for Bitcoin or the overall cryptocurrency space, a downward trend in Bitcoin dominance likely will result in positive price action for altcoins, as has been the case in the past.\n\nAltcoins showing signs of life\n\nSeveral top market cap altcoins have perked up in recent days, touting rising numbers fueled by announcements, project developments and bottoming chart patterns. One might wonder if positivity from a few altcoins is enough to spark the ever-elusive altcoin season the crypto market has waited for so patiently.\n\nChainlink (LINK) is perhaps the most exuberant altcoin at present and it’s chart suggests that the asset is beginning an uptrend.\n\nA recent tweet from blockchain analytics platform Glassnode also revealed increased activity regarding Chainlink’s Oracle. “Since May, an ETH/USD reference data contract has sent 330,000+ transactions of 0.333 $LINK to various oracle addresses,” Glassnode said. “At around 5k a day, this represents over 80% of daily transfers.”\n\nLINK Transfer Count chart. Source: Glassnode\n\nPopular analyst Nicholas Merten, the host of one of crypto’s top YouTube channels, DataDash, also listed LINK as his favorite crypto asset for 2020 in a recent video, describing the project’s use case as the rationale.\n\nBinance Coin buoyant despite refuted Alipay rumors\n\nThis week Binance Coin (BNB) rallied more than 9% after Binance announced compatibility with Alibaba’s Alipay service and popular messaging platform WeChat, opening the door for fiat payments on the exchange. Less than 24-hours later Alipay and WeChat strongly refuted this announcement and Binance CEO Changpeng Zhao issued a tweet attempting to clarify the situation.\n\nThis news could be the jumpstart BNB needs to turn its downtrend around. Prior to the news, BNB hit a local bottom of $14.25, currently sitting at $17.47 at press time. The digital asset, however, still needs to prove itself in terms of a reversal.\n\nOne of crypto-Twitter’s most well-known traders, The Crypto Dog, has his sights set on $20 for BNB.\n\n“BNB one of my largest bags right now,” he said, adding, “I've got $20 in sight.” He also noted, “I don't have confidence in us seeing a pull-back, but if I had to, I'd add at retest around $16.30.”\n\nBNB USDT 4-hour chart. Source: TradingView\n\nIn contrast, however, Oct. 10 saw Alipay restrict any involvement with crypto assets in conjunction with its app, CoinTelegraph reported. Alipay’s action seems counterintuitive to Binance’s announced Alipay compatibility.\n\nSeveral altcoins show possible bottoming patterns\n\nAnother popular trader on crypto-Twitter, The Crypto Monk, posted several charts of top market cap altcoins, noting similar bottoming patterns on all of them.\n\n“So many alts (especially the majors) printing the same structure,” he said. “It's that time of the year where we toss a coin to choose a position?” The trader pointed to TRX, Ether, XRP and IOTA charts specifically.\n\nTRX, Ether, XRP and IOTA daily charts. Source: TradingView\n\nMarket analyst Michaël van de Poppe, also known as Crypto Michael, additionally pointed out that the entire altcoin market cap shows potential.\n\n“Checking the altcoin market cap, it doesn't look bad at all as long as we keep this green area (which was previously found a support before the big bull hype),” he said referring to support denoted on his, shown below.\n\n“Some consolidation and ready to go,” he added.\n\nCRYPTOCAP TOTAL2 2-day chart. Source: TradingView\n\nSentiment for the crypto space as a whole appears to be changing, given the fact that several charts no longer show assets wallowing hopelessly in strong downtrends. The presence of positive news and other market data also adds to the changing winds.\n\nWhile the current data paints an encouraging picture for many altcoins, these rallies could be short-lived as they’re still heavily reliant on Bitcoin performance. Nevertheless, the recent upswing of BNB ahead of BTC is encouraging.\n\nBut if Bitcoin price takes another downward dive, history has shown that the entire cryptocurrency market will likely follow. Meanwhile, with less than 220 days before the next Bitcoin halving, the market waits in anticipation of other positive factors to push up the price.\n\nThe views and opinions expressed here are solely those of (@benjaminpirus) and do not necessarily reflect the views of Cointelegraph. Every investment and trading move involves risk. You should conduct your own research when making a decision.", "description": "As Bitcoin price consolidates, several altcoins are posting gains and providing the rationale for a period of market-wide gains", "authors": ["Benjamin Pirus"], "top_image": "https://images.cointelegraph.com/images/740_IGh0dHBzOi8vczMuY29pbnRlbGVncmFwaC5jb20vc3RvcmFnZS91cGxvYWRzL3ZpZXcvZGI0NGUwMzI1NTBmNDAyYjg2YzQ3Mjg3ZTU3OGM5OGQuanBn.jpg", "published_at": "2019-10-11"}