{"pub": "usatoday", "url": "https://usatoday.com/story/tech/reviewedcom/2019/10/22/best-beauty-gifts-2019-gg-19/3929715002", "downloaded_at": "2019-10-22 20:51:53.647077+00:00", "title": "20 amazing gifts for beauty, makeup, and skincare lovers", "language": "en", "text": "20 amazing gifts for beauty, makeup, and skincare lovers\n\nBest gifts for beauty 2019 (Photo: Reviewed / Jackson Ruckar / Betsey Goldwasser)\n\n— Our editors review and recommend products to help you buy the stuff you need. If you make a purchase by clicking one of our links, we may earn a small share of the revenue. However, our picks and opinions are independent from USA Today’s newsroom and any business incentives.\n\nHolidays are for giving gifts that people won’t necessarily splurge on for themselves but that they’ll cherish if given to them. It’s a time to spring for the extra-special hairbrush that’ll make an everyday chore more luxurious, or for a beauty subscription box that encourages experimentation with new makeup and skincare products. No matter who is on your list, we have something they’ll love. These are the best beauty gifts of 2019, according to Reviewed.\n\n1. For the one who loves a fresh blowout: Our top-rated hair dryers\n\nBest gifts for beauty 2019: Bio Ionic GrapheneMX and Revlon 1875W Infrared Hair Dryer (Photo: Reviewed / Betsey Goldwasser / Jackson Ruckar)\n\nThe thrill of a smooth, sleek, speedy blowout cannot be underestimated. Our favorite hairdryer is worth the investment. The Bio Ionic GrapheneMX Professional Dryer takes wet hair to out-the-door-ready in minutes with its ultra-powerful airflow and three heat settings. If you’re looking to spend (a lot) less, we also love the Revlon 1875 Infrared Hair Dryer—it’s lightweight, easy to use, and gives a poof-less, fast blow-dry.\n\n2. For the one who wants shiny, tangle-free locks: A hairbrush upgrade\n\nBest gifts for beauty 2019: Beauty by Earth Boar Bristle Hair Brush (Photo: Beauty by Earth)\n\nMany of us grab any old hair brush at the drugstore and don’t think much of it. But this one from Beauty by Earth takes quality up a few notches and even rivals the cult-favorite brush from Mason Pearson at a fraction of the price. This brush claims to condition the hair by distributing its natural oils using boar and nylon bristles. Your gift recipient is sure to thank you for their new hair-saver.\n\nGet the Beauty by Earth Boar Bristle Hair Brush on Amazon for $17.99\n\n3. For the one whose morning routine needs a boost: A light-up mirror\n\nBest gifts for beauty 2019: DeWeisn Tri-Fold Mirror (Photo: Reviewed / Jackson Ruckar)\n\nThe best way to get ready in the morning is to be able to see the task at hand. Applying makeup or face-shaving is a whole lot easier with proper lighting and a good mirror. From our testing, our favorite DeWeisn Tri-Fold Mirror has super-bright, adjustable lighting, a clear reflection, and three magnification options. No more applying makeup—or nicking the skin—in the dark!\n\nGet the DeWeisn Tri-Fold Mirror on Amazon for $23.98\n\n4. For the one who can’t be bothered with a nail salon: A manicure kit\n\nBest gifts for beauty 2019: Esarora Manicure Set (Photo: Esarora)\n\nEveryone, everyone should have a manicure kit to turn to when a hangnail appears or a brow hair grows out of place. This 18-piece one from Esarora features cosmetic scissors, tweezers, nail clippers, cuticle pushers and nippers, and more. It has all your recipient needs for grooming the hands, feet, and face in this one portable case.\n\nGet the Esarora Manicure Set on Amazon for $15.85\n\n5. For the one who wants beach waves year-round: Our favorite curling iron\n\nBest gifts for beauty 2019: Beachwaver S1 Curling Iron (Photo: Reviewed / Jackson Ruckar)\n\nWhether the goal is tight ringlets or soft waves, this curling iron from Beachwaver delivers. It stood out during our testing because of its motorized rotating wand, easy-to-use controls, and well-designed handle that’s comfortable to hold throughout the curling process. This is a must-try for anyone desiring curly locks.\n\nGet the Beachwaver S1 Curling Iron on Amazon for $129\n\n6. For the one with dry skin: A cult-favorite body cream\n\nBest gifts for beauty 2019: Sol de Janeiro Brazilian Bum Bum Cream (Photo: Sol de Janeiro)\n\nIf you’re thinking that all lotions are the same, there are over 4,000 people on Sephora ready to tell you otherwise. Sol de Janeiro’s Brazilian Bum Bum Cream is considered a body-care must-have because of its fast-absorbing formula that supposedly tightens and smooths the look of skin while it moisturizes. But what’s more, people are over the moon for its warm and spicy scent, with notes of salted caramel, pistachio, and vanilla—no, it’s not edible.\n\nGet the Sol de Janeiro Brazilian Bum Bum Cream at Sephora for $45\n\n7. For the one who could use some pampering: Our favorite foot spa\n\nBest gifts for beauty 2019: Ivation Foot Spa (Photo: Reviewed / Betsey Goldwasser / Ivation)\n\nWe put our feet through a lot—squeezing them into shoes that don’t quite fit, wearing flimsy sandals with no arch support, and traipsing through puddles in improper footwear. A foot bath is a spa-like experience that anyone can enjoy on their tired feet. After testing, our favorite is the Ivation Foot Spa Massager, which features adjustable heating, massage rollers, water jets, and a timer. We promise, after your giftee tries it once, it will not be relegated to the back of the closet.\n\nGet the Ivation Foot Spa Massager on Amazon for $79.99\n\n8. For the one who experiments with eye makeup: A shadow palette and brushes\n\nBest gifts for beauty 2019: Urban Decay Naked3 Palette and Real Techniques Enhanced Eye Set (Photo: Urban Decay / Real Techniques)\n\nWhether your giftee is new to makeup or a semi-pro, an eyeshadow palette is perfect for experimenting with color and improving technique. Urban Decay’s Naked palettes are among the most popular, with thousands of devotees. The Naked3 features shimmery and matte rose gold-hued neutral shades. For a more complete gift, include the Real Techniques Enhanced Eye Set, which comes with a crease brush, fine liner brush, medium shadow brush, shading brush, and eyelash separator.\n\n9. For the one who always has a fresh mani: An LED nail lamp\n\nBest gifts for beauty 2019: SunUV LED Nail Lamp (Photo: SunUV)\n\nIf there was an option to always have a sleek manicure without ever having to go to the nail salon, who wouldn’t take it? Our tester loved the SunUV lamp because it works with any gel nail polish. It has a sensor to turn on when polished finger or toenails are placed inside, and the bottom plate is easy to clean in between each use.\n\nGet the SUNUV LED UV Nail Lamp on Amazon for $39.99\n\n10. For the one who’s passionate about skincare: An exfoliating serum\n\nBest gifts for beauty 2019: Sunday Riley Good Genes All-In-One Lactic Acid Treatment (Photo: Sunday Riley)\n\nBehind the Sunday Riley Good Genes All-In-One Lactic Acid Treatment is a sea of fans waiting to sing its praises at any moment. The serum claims to clarify and smooth the skin using lactic acid, brighten the appearance of dark spots with licorice and lemongrass extracts, and soothe redness with prickly pear extract. Expensive? Yes. But there are more than 2,500 reviewers who say it’s worth every penny.\n\nGet the Sunday Riley Good Genes All-In-One Lactic Acid Treatment at Sephora for $158\n\n11. For the one who wants sleek, straight strands: Our must-have flat iron\n\nBest gifts for beauty 2019: Paul Mitchell Neuro Smooth Iron (Photo: Reviewed / Jackson Ruckar)\n\nStraightening the hair becomes infinitely easier and quicker with a stellar flat iron. The Paul Mitchell Neuro Smooth Flat Iron stood out on our tests for its 1.25-inch plates that hold hair firmly and smoothly without snagging, its easy-to-use heat adjustments, and its customizable auto shut-off. The results—a sleek, shiny ‘do—are worth the higher-than-some price tag.\n\nGet the Paul Mitchell Neuro Smooth Flat Iron on Amazon for $150\n\n12. For the one who loves a clean face: Our favorite facial cleansing brush\n\nBest gifts for beauty 2019: Clarisonic Mia Smart (Photo: Clarisonic)\n\nWe all have that one part of our daily routine that we look forward to. If cleansing the face is your giftee’s favorite time of day, consider wrapping up a facial brush. The Clarisonic Mia Smart came out on top during our testing because it leaves the skin feeling thoroughly cleaned without stripping it of moisture. Mia Smart is compatible with all Clarisonic brush heads, is adjustable in intensity, and has a waterproof handle that’s comfortable to hold.\n\nGet the Clarisonic Mia Smart on Amazon for $169\n\n13. For the one who plays with makeup: Sephora’s subscription box\n\nBest gifts for beauty 2019: Play! by Sephora Monthly Subscription Box (Photo: Reviewed / Jackson Ruckar)\n\nIf you’re not sure exactly what your favorite beauty junkie would want in a gift, a monthly subscription box of samples is just the ticket. Our favorite is the Play! by Sephora Monthly Subscription Box, which includes five sample-sized makeup, skincare, and hair care products for $10 per month.\n\nGet the Play! by Sephora Monthly Subscription Box for $10\n\n14. For the one who wants a glowing complexion: A charcoal face mask\n\nBest gifts for beauty 2019: Bio Miracle Skin Therapy Detoxifying Peel-Off Mask Treatment (Photo: Reviewed / Betsey Goldwasser)\n\nFace masks are easy crowd-pleasers for skincare fanatics. This peel-off mask from Bio Miracle claims to remove blackheads, impurities, and excess oil, and minimize the appearance of pores. It’s a dupe of the popular Boscia Luminizing Black Charcoal Mask, but at its lower price, you can give three for the price of one.\n\nGet the Bio Miracle Skin Therapy Detoxifying Peel-Off Mask Treatment on Amazon for $10.46\n\n15. For the one who hates waxing: A facial hair removal wand\n\nBest gifts for beauty 2019: Finishing Touch Flawless (Photo: Reviewed / Jackson Ruckar)\n\nThe best gifts are ones that fulfill a need you didn’t even know you had. A great example of this is the Finishing Touch Flawless, a battery-powered facial hair remover that uses a spinning wand head to pare down unwanted hair at the skin's surface without causing it to grow back darker or coarser. During testing, we found that it’s gentle on the skin and catches all of the hair, leaving zero mess. Goodbye waxing!\n\nGet the Finishing Touch Flawless on Amazon for $16.99\n\n16. For the one who runs hot: A cooling facial roller\n\nBest gifts for beauty 2019: Esarora Ice Roller (Photo: Esarora)\n\nAfter a workout or on a hot day, using ice-cold products on the skin feels incredible. This ice roller from Esarora is similar to a jade roller, which is used to work in facial treatments and increase blood circulation, but packs a freezing punch. With over 2,000 Amazon reviews and a 4.7-star rating, this little device makes a big impact on many people’s skin routines. Not to mention, cooling products are said to reduce the signs of aging.\n\nGet the Esarora Ice Roller on Amazon for $11.99\n\n17. For the one who craves straight but voluminous hair: A straightening brush\n\nBest gifts for beauty 2019: Amika Polished Perfection Straightening Brush 2.0 (Photo: Reviewed / Jackson Ruckar)\n\nIf you’re giving to someone who likes to straighten naturally curly hair—and wants an alternative to a flat iron, which can leave locks looking flat—we suggest this heated straightening brush from Amika. It takes kinky, curly hair to straight and sleek with just a few passes. Yes, it’s that simple.\n\nGet the Amika Polished Perfection Straightening Brush 2.0 at Sephora for $120\n\n18. For the one who's always on the go: A travel makeup case\n\nBest gifts for beauty 2019: Relavel Travel Makeup Case (Photo: Relavel)\n\nThere’s nothing worse than aimlessly shuffling through luggage to find a lip gloss that migrated to the bottom of the bag. To make traveling a bit easier for your on-the-go loved ones, give them a makeup or toiletry case, like this one from Relavel. Over 1,500 Amazon shoppers agree that this case is a must-have, with its several compartments, including designated storage for makeup brushes.\n\nGet the Relavel Travel Makeup Case on Amazon for $18.98\n\n19. For the Fenty fiend: The Pro Filt’r foundation and sponge\n\nBest gifts for beauty 2019: Fenty Beauty Pro Filt'r Soft Matte Longwear Foundation and beautyblender original (Photo: Fenty Beauty / beautyblender)\n\nAny makeup lover is sure to rejoice when opening this fan-favorite foundation and beauty sponge kit. This complexion perfecter from Fenty Beauty—founded by R&B singer Rihanna—is widely praised for its diverse shade range, coverage that layers from light to heavy, and long-lasting wear. In your gift, toss in a beautyblender, a reusable, edgeless sponge with a tapered tip. The duo is sure to give a smooth complexion that’ll last all day.\n\n20. For the one who wants to avoid frizzy hair: A silk pillowcase and microfiber hair towel\n\nBest gifts for beauty 2019: Aquis Original Microfiber Hair Towel and Slip Silk Pillowcase (Photo: Aquis / Slip)\n\nFriction between your hair and a regular cotton or polyester pillowcase can cause damage and breakage. If you’re buying for someone who wants to avoi tangles, breakage, and frizz (a.k.a., everyone), consider a silk pillowcase. This one from Slip comes in a queen and king size, as well as a variety of colors to suit your recipient's style. While you're at it, pick up a microfiber towel, like this one from Aquis, that dries the hair without stripping it of moisture or causing breakage.\n\nThe product experts at Reviewed have all your shopping needs covered this holiday season. Follow Reviewed on Facebook, Twitter and Instagram.\n\nRead or Share this story: https://www.usatoday.com/story/tech/reviewedcom/2019/10/22/best-beauty-gifts-2019-gg-19/3929715002/", "description": "These are must-have holiday gifts for any beauty lover.", "authors": ["Jessica Kasparian", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/21/USAT/59486db6-f27a-4263-a4b9-fca36122629c-best-gifts-unique-2019-HERO-gg19.jpg?crop=1593,896,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-22"}