{"pub": "businessinsider", "url": "https://businessinsider.my/typhoon-faxai-japan-tokyo-photos-death-toll-injuries-2019-9", "downloaded_at": "2019-09-10 23:28:36.734192+00:00", "title": "Typhoon Faxai brings record-breaking winds and strong rain to Japan, killing 3 and leaving thousands of stranded at the airport", "language": "en", "text": "caption Collapsed steel advertising boards caused by Typhoon Faxai are seen at Edogawa ward in Tokyo, Japan September 9, 2019. source REUTERS/Kiyoshi Takenaka\n\nOne of the strongest typhoons in recent years hit eastern Japan on Monday, bringing with it wind gusts of 207 kmh (128 mph), the strongest ever recorded in the city of Chiba.\n\nAt least three people have died as a result of the powerful typhoon, Kyodo News Agency reported on Tuesday local time.\n\nMore than 160 flights were canceled and scores of train lines closed for hours. Roughly 14,000 people were stranded at Narita Airport on Monday night, Kyodo said, citing Narita International Airport Corp.\n\nSome minor landslides occurred and a bridge was washed away, while as many as 930,000 houses lost power at one point, national broadcaster NHK said.\n\nVisit Business Insider’s homepage for more stories.\n\nTOKYO (Reuters) – One of the strongest typhoons to hit eastern Japan in recent years struck just east of the capital Tokyo on Monday, with record-breaking winds and stinging rain damaging buildings and disrupting transport.\n\nAt least three people have died as a result of the powerful typhoon, Kyodo News Agency reported on Tuesday local time.\n\nMore than 160 flights were canceled and scores of train lines closed for hours, snarling the morning commute for millions in a greater Tokyo area with a population of some 36 million. Roughly 14,000 people were stranded at Narita Airport on Monday night, Kyodo said, citing Narita International Airport Corp.\n\nDirect train service between Narita airport and the capital remained severely limited into the evening, with thousands of irritated travelers packed into a key transport hub for both the Rugby World Cup starting later this month and next year’s Tokyo Olympics.\n\n“They simply had no contingency plan…,” one weary traveler who lives in Tokyo said of the scene, in which people crowded the exit areas and food ran out in airport stores.\n\ncaption A crowd of passengers is seen as they wait for operations of train services to resume in a snarl caused by Typhoon Faxai at Urawa station in Saitama, north of Tokyo, Japan September 9, 2019. source Kyodo/via REUTERS\n\n“They let planes land … and thousands of passengers were disgorged into an airport that was cut off – no buses, no JR trains. The only connection was a private train running every half hour half way to Tokyo.”\n\nThe man, who said he arrived just before 4 p.m. local time and only caught a bus at 7:30 p.m. after standing in line, added: “My wife said: what if this happens during the Olympics?”\n\nTyphoon Faxai, a Lao woman’s name, slammed ashore near the city of Chiba shortly before dawn, bringing with it wind gusts of 207 kmh (128 mph), the strongest ever recorded in Chiba, national broadcaster NHK said.\n\nA woman in her fifties was confirmed dead after she was found in a Tokyo street and taken to hospital. Footage from a nearby security camera showed she had been smashed against a building by strong winds, NHK reported.\n\nAn 87-year-old man died after being crushed by a fallen tree in Chiba Prefecture, while a 47-year-old died while he was fixing a power generator at Maritime Self-Defense Force’s Yokosuka base in Kanagawa Prefecture, Kyodo said, citing police.\n\nAnother woman in her 20s was rescued from her house in Ichihara, east of Tokyo, after it was partly crushed when a metal pole from a golf driving range fell on it. She was seriously injured.\n\n“There was a huge grinding noise, I couldn’t figure out what it was. Then I looked up and saw a big hole in the roof, but I was so keyed up I couldn’t figure out what had happened,” a neighbor said.\n\ncaption Houses and cars damaged by a collapse of the perimeter netting of a golf training field due to strong winds of Typhoon Faxai are seen in Ichihara, east of Tokyo, Japan September 9, 2019. source Kyodo/via REUTERS\n\nSome minor landslides occurred and a bridge was washed away, while as many as 930,000 houses lost power at one point, NHK said, including the entire city of Kamogawa. But the number of homes without power had dropped to 840,000 by early Monday afternoon, the Ministry of Economy, Trade and Industry said.\n\nSome concrete electric poles were snapped off at their bases, while electricity towers in Chiba were toppled over. Some panels of a floating solar power plant southeast of Tokyo were on fire.\n\nThe Japan Atomic Energy Agency said a cooling tower at its research reactor at Oarai, which has not been in operation since 2006 and is set to be decommissioned, had fallen, but there was no radiation leakage, impact on workers or the surrounding environment.\n\nA Sony Corp (6758.T) spokesman said operations at its plant in Kisarazu, southeast of Tokyo, were suspended due to power outages. The company could not say when the plant, which assembles PlayStation gaming consoles, would reopen.\n\nTwo Nissan factories west of Tokyo, including its Oppama plant, suspended operations due to flooding, NHK said.\n\nAbout four to five typhoons make landfall in Japan every year, but it is unusual for them to do so near Tokyo. NHK said Faxai was the strongest storm in the Tokyo area in several years.\n\ncaption Not working traffic signals are seen in a blackout caused by Typhoon Faxai in Kisarazu, Chiba prefecture, Japan September 9, 2019. source REUTERS/Issei Kato\n\nStreets normally busy with commuters walking or bicycling were deserted, with winds just east of Tokyo shaking buildings.\n\nMetal signs were torn from buildings, trucks overturned, the metal roof of a petrol station torn off and glass display cases destroyed, scattering sidewalks with broken glass.\n\nTrees were uprooted throughout the metropolitan area, some falling on train tracks to further snarl transport.\n\nSome 2,000 people were ordered to leave their homes at one point because of the danger of landslides, NHK said.\n\nParts of the high-speed Tokaido Shinkansen train line were halted but service resumed after several hours. It took hours for other lines to resume, packing stations with impatient commuters fanning themselves in the humid air.\n\nTemperatures shot up to unseasonably hot levels in the wake of the storm, prompting authorities to warn of the danger of heatstroke.\n\nReporting by Elaine Lies, Chris Gallagher, Linda sieg, Kiyoshi Takenaka and Makiko Yamazaki; Editing by Robert Birsel/Mark Heinrich", "description": "Business Insider - One of the strongest typhoons to hit eastern Japan in recent years struck just east of Tokyo on Monday, with wind gusts of up to 128 mph.. Read more at businessinsider.my", "authors": ["Reuters", "Rosie Perper"], "top_image": "https://static.businessinsider.my/sites/3/2019/09/5d776afb6f24eb3314536862.png", "published_at": "2019-09-10"}