{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/ali-abdelaziz-i-guarantee-kamaru-usman-will-make-an-example-out-of-colby-covington", "downloaded_at": "2019-10-11 20:15:12.029446+00:00", "title": "Ali Abdelaziz: I guarantee Kamaru Usman will make an example out of Colby Covington", "language": "en", "text": "LOS ANGELES – Ali Abdelaziz has often had his predictions come to fruition.\n\nAnd as welterweight champion Kamaru Usman heads into his title fight vs. Colby Covington at UFC 245, Abdelaziz is making another bold prediction.\n\n“I guarantee you Dec. 14, Usman is going to make an example out of him,” Abdelaziz told MMA Junkie this week. “And he’s going to put fear into the rest of the division.”\n\nThere’s no love lost between Abdelaziz and Covington, who had an altercation in Las Vegas at the buffet of the Palms Casino Resort, where Usman had to hold his manager back. Someone from Covington’s team proceeded to call police, and Abdelaziz allegedly is scheduled for a court date in the near future.\n\nAbdelaziz will make sure to not get involved in the buildup of this fight that has certainly become personal. He’d rather let Usman (15-1 MMA, 10-0 UFC) handle business.\n\n“I’m not going to give this guy more of my time because he have a problem in his hands,” Abdelaziz said. “He have a Nigerian nightmare in his hands. They can promote this fight. The reason he’s using my name, I got more Instagram followers than he does. I’m sorry, I do. All he does is try to separate this great, beautiful country. Americans, they don’t do that.\n\n“If you want to talk bad about me, go ahead. I’m not going to get mad anymore. If I see you again, I’m not going to swing at you because he’s going to do two things: He’s not going to hit back, and he’s going to call the cops. I’m in a lose-lose situation.”\n\nHaving already predicted certain outcomes for his clients, Abdelaziz went on to say that Usman is destined for greatnesss, which will be on display at UFC 245 in his first title defense against Covington.\n\n“I said it before, Henry Cejudo is going to beat Demetrious (Johnson), he’s going to beat T.J. (Dillashaw), everybody said ‘Oh no, Khabib (Nurmagomedov).’ I said he’s going to beat Conor (McGregor)’s (expletive). ‘Oh, Conor’s going to knock him out’. I’m saying this today: Kamaru Usman will go down as one of the greatest welterweights of all time.”\n\nYou can watch the Dominance MMA CEO dish on numerous topics in the video above, including Covington, Conor McGregor, Anthony Johnson, fighter unionization, and more.", "description": "Dominance MMA CEO Ali Abdelaziz is going to bat for his fighter in a big way ahead of UFC 245.", "authors": ["Farah Hannoun", "John Morgan", "Mike Bohn", "Christian Stein", "Dave Doyle", "Nolan King", "Mma Junkie Staff"], "top_image": "https://usatmmajunkie.files.wordpress.com/2018/11/kamaru-usman-ufc-fight-night-129-1.jpg?w=1000&h=576&crop=1", "published_at": "2019-10-11"}