{"pub": "reuters", "url": "https://in.reuters.com/article/uk-nigeria-captives/nigerian-police-rescue-67-from-inhuman-conditions-at-islamic-school-idINKBN1WT2EN", "downloaded_at": "2019-10-14 23:28:21.656738+00:00", "title": "Nigerian police rescue 67 from \"inhuman\" conditions at Islamic \"school\"", "language": "en", "text": "MAIDUGUIRI, Nigeria (Reuters) - Police in northern Nigeria rescued nearly 70 men and boys from a second purported Islamic school where they were shackled and subjected to “inhuman and degrading treatments.”\n\nPeople are pictured after being rescued by police in Sabon Garin, in Daura local government area of Katsina state, Nigeria October 14, 2019. REUTERS/Stringer NO RESALES. NO ARCHIVES\n\nThe raid in Katsina, the northwestern home state of President Muhammadu Buhari, came less a month after about 300 men and boys were freed from another supposed Islamic school in neighbouring Kaduna state where they were allegedly tortured and sexually abused. [nL5N26I2B3]\n\n“In the course of investigation, sixty-seven persons from the ages of 7 to 40 years were found shackled with chains,” Katsina police spokesman Sanusi Buba said in a statement. “Victims were also found to have been subjected to various inhuman and degrading treatments.”\n\nThe raid occurred on October 12 in Sabon Garin in the Daura local government area of Katsina state. Police issued a statement on Monday and said they were working to reunite the victims with their families.\n\nPolice arrested one man, 78-year-old Mallam Bello Abdullahi Umar, for running what they called an “illegal detention/remand home.”\n\nLawai Musa, a trader who lived near the centre, told Reuters by phone that families sent unruly men and boys there believing it was an Islamic teaching facility that would straighten them out and teach them Islamic beliefs.\n\n“The way he is treating the children is un-Islamic” he said. “We are not happy, they were treated illegally.”\n\nIslamic schools, known as Almajiris, are common across the mostly Muslim north of Nigeria. Muslim Rights Concern (MURIC), a local organisation, estimates about 10 million children attend them.\n\nIn June, President Buhari, himself a Muslim, said the government planned to ban the schools, but would not do so immediately. After the incident in Kaduna, the president issued a statement calling on traditional authorities to work with government to expose “unwanted cultural practices that amount to the abuse of children.”\n\nBuhari’s office declined to immediately comment on the Katsina raid, saying it would issue a statement after a full briefing from police.\n\n“The command enjoins parents to desist from taking their children/wards to illegal, unauthorized or unapproved remand/rehabilitation centres,” the police statement said.\n\n(The story refiles to fix garbled names throughout)", "description": "Police in northern Nigeria rescued nearly 70 men and boys from a second purported Islamic school where they were shackled and subjected to \"inhuman and degrading treatments.\"", "authors": ["Ahmed Kingimi", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191014&t=2&i=1440862056&w=1200&r=LYNXMPEF9D1U0", "published_at": "2019-10-14"}