{"pub": "yahoo", "url": "https://news.yahoo.com/1-british-police-39-bodies-084529304.html", "downloaded_at": "2019-10-23 10:11:42.531740+00:00", "title": "UPDATE 5-British police find 39 dead in truck container, arrest driver", "language": "en", "text": "* Police find 39 bodies in a container\n\n* One man from Northern Ireland arrested\n\n* Truck believed to have come from Bulgaria (Changes dateline, adds nearby worker)\n\nBy Hannah McKay\n\nGRAYS, England, Oct 23 (Reuters) - British police found the bodies of 39 people inside a truck container believed to have come from Bulgaria at an industrial estate to the east of London on Wednesday.\n\nThe discovery was made in the early hours after emergency services were alerted to people in the container, on a gritty industrial site in Grays, about 20 miles from central London.\n\nPolice said the driver of the truck, a 25-year-old man from Northern Ireland, had been arrested on suspicion of murder. Prime Minister Boris Johnson said he was appalled.\n\n\"I am receiving regular updates and the Home Office will work closely with Essex Police as we establish exactly what has happened,\" Johnson said on Twitter. \"My thoughts are with all those who lost their lives & their loved ones.\"\n\nPolice said the truck was thought to have entered Britain at Holyhead, a North Wales port that is a major entry point for traffic from Ireland, on Saturday and to have originally started its journey in Bulgaria.\n\nThe victims, 38 adults and one teenager, were all pronounced dead at the scene after they were found at the Waterglade Industrial Park, not far from docks on the River Thames.\n\nBulgaria's foreign ministry said it could not confirm at this stage whether the truck had started its journey from the country.\n\n\"We are still checking the information, published in the British media and we're contacting the authorities,\" foreign ministry spokeswoman Tsvetana Krasteva said.\n\nPolice officers in forensic suits were on Wednesday inspecting a large white container on a red truck next to warehouses at the site. Police had sealed off the surrounding area of the industrial estate with large green barriers as they carried out their investigation.\n\n\"This is a tragic incident where a large number of people have lost their lives. We are in the process of identifying the victims, however I anticipate that this could be a lengthy process,\" said Chief Superintendent Andrew Mariner, from Essex Police.\n\n\"We have arrested the lorry driver in connection with the incident who remains in police custody as our enquiries continue.\"\n\nNearby businesses said they had been unable to gain access to their units on the site due to the large police cordon.\n\n\"The police came in the night - they have closed the whole area,\" said a worker at a nearby cafe, who declined to give his name.\n\nIn Britain's biggest illegal immigrant tragedy in 2000, British customs officials found the bodies of 58 Chinese people crammed into a tomato truck at the southern port of Dover. (Writing by Michael Holden; Additional reporting by William Schomberg and Kate Holton in London and Angel Krasimirov in Sofia; Editing by Guy Faulconbridge and Alex Richardson)", "description": "", "authors": ["Hannah Mckay"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-23"}