{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7548317/More-companies-asking-background-questions-widen-talent-pool--report.html", "downloaded_at": "2019-10-07 23:38:19.237529+00:00", "title": "More companies asking background questions to widen...", "language": "en", "text": "Many firms now ask new recruits for details about their background – such as the school they attended, or if their parents are university-educated, according to a new report.\n\nOthers are asking for details of where new employees grew up and if they were eligible for free school meals – a key measure of poverty.\n\nThe questions are asked as part of measures introduced by businesses to ensure they are open to all candidates, and that they are finding, and recruiting, talented workers from all types of backgrounds, the Social Mobility Foundation said.\n\nThe charity has produced a new Social Mobility Employer Index, listing what it says are the 75 UK employers that have taken the most action to widen access in the workplace.\n\nThe index is based on 125 firms, collectively employing over 1.1 million people in the UK, which took part in a survey, answering questions about the actions they are taking in key areas such as working with young people, routes into work and recruitment and selection.\n\nAround half (51%) said they ask their new entrants and employees if their parents went to university, while a similar proportion (53%) asked about the type of school the recruit attended.\n\nCompanies were praised for opening their doors to a wider pool of talent (Philip Toscano/PA)\n\nIn addition, almost 40% asked whether someone was eligible for free dinners at school, nearly a fifth asked for the postcode where a new employee grew up and 17% asked for details of parents’ occupations.\n\nThe survey also found that 99% of those polled said they feel their clients want their workforce to be diverse in terms of gender, 96% feel clients want diversity in terms of race and 85% in terms of socio-economic background of workers.\n\nThe index concluded that PwC is taking the most action on social mobility, followed by KPMG UK LLP, and then water company Severn Trent.\n\nThe list includes firms from a number of sectors, including banks, engineering companies, Government departments and retailers along with British intelligence agency MI6.\n\nAlan Milburn, chairman of the Social Mobility Foundation, said: “Social mobility is becoming a cause for more and more of our country’s top employers.\n\n“When politics is weak, society needs to be strong – so it is welcome a growing number of employers are stepping up to the plate.\n\n“They recognise the need to open their doors to a wider pool of talent both to address growing public concerns about unfairness and to reap the business benefits from having more diverse workforces.\n\n“The onus is now on all of our country’s top employers to do the same.”", "description": "The index concluded PwC is taking the most action on social mobility, followed by KPMG UK LLP and Severn Trent.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/00/wire-19418038-1570489463-587_636x382.jpg", "published_at": "2019-10-07"}