{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3064347&cloc=joongang|home|foreign", "downloaded_at": "2019-10-05 13:06:11.652312+00:00", "title": "[TABLE TALK] Korea and Jordan break fast together at sunset", "language": "en", "text": "From left, Ambassador of Jordan to Korea Adel Adaileh, his wife Eman Aldomur and their daughter Jude Adaileh enjoy the traditional dish of Jordan, called Mansaf, to observe Iftar, a breaking of the fast during Ramadan, on May 28 at the diplomatic residence in central Seoul. [PARK SANG-MOON]\n\nIf you could recommend one book to read about your country, which would it be and why?\n\nWe are asking these questions to ambassadors in Seoul for our latest public diplomacy series, “Table Talk.” The book, its author and what they say about the country is discussed over a table full of national dishes. What better way to start an exploration of a new land than through food, good writing and a personal guide dedicated to building bridges between countries — right here in Korea? - Ed.\n\nAmbassador of Jordan to Korea Adel Adaileh leads the group of guests at his residence in central Seoul in prayer during the evening prayer time on May 28. [PARK SANG-MOON]\n\nThe day begins at 3 a.m. during Ramadan for Eman Aldomur, wife of the ambassador of Jordan to Korea.“I would go into the kitchen to start preparing something light for the family to eat before we pray,” Aldomur said. “Once we start to pray from sunrise, we fast until sunset, focusing on praying, reading the Quran and spending time with God, while we go about our daily activities. Ramadan is one of the five pillars of Islam and it is mainly a month of worshipping God, focusing on God more than other activities.”Muslim communities around the world fast from sunrise to sunset and pray to God at least five times a day in this season, which lasted from May 5 to June 3 this year. They pray wherever they can, in their homes, offices and mosques if they are available in vicinity.“You would be surprised to hear this, but there are more than 60 mosques in Korea,” said Adel Adaileh, ambassador of Jordan to Korea. “We also have more than 50 prayer halls in universities and hospitals prepared for the Muslim communities in Korea.”But as much as fasting and praying unites Muslims around the world, so does the act of breaking their fast.“We celebrate Iftar with families and friends, and they don’t have to be Muslim to celebrate together,” said Adaileh. “Some Christian friends would invite us to their home to break the fast together, and they would try to make the time suitable to our prayer times.”The Iftar on May 28 at the ambassador’s residence in central Seoul was joined by staff members of the Jordanian Embassy in Seoul and members of Jordanian community in Korea.“This is my family in Korea,” said Aldomur as she opened the door to welcome Nash’at Al-Hadid, Nadine Bisharat, Amer Issa and Mohammad Almiqdadi, staff members of the embassy, and Mahmoud Al Qawasmeh, a consultant at Korea Health Industry Development Institute and head of the Jordanian community in Korea.They broke their fast with dates from Jordan while talking about their latest endeavors in Korea.“I work as a consultant to give advice to the Korean pharmaceutical companies on how best to export their products to the Middle Eastern region,” said Al Qawasmeh.“Jordan’s health sector developments are quite advanced in the region, and this was one of the areas that His Majesty the King focused on during his most recent visit to Korea,” said Adaileh.King Abdullah II of Jordan last visited South Korea in September 2015.He published a book, “Our Last Best Chance,” in 2011 about his experiences in mediating for peace in the Middle East and diplomatic excursions outside of the region, including to North Korea in 1993, which are described with frank details and a bit of humor.As the crowd at the residence enjoyed the plate of Mansaf (a traditional lamb, yogurt and rice dish) together, the conversation inevitably turned to some of their loved ones back in Jordan.“On any given day in my phone calls with my daughter back home, BTS is almost always mentioned,” Al Qawasmeh said. “I don’t understand how but they sure have her heart.”Praying between their meals, the Jordanians talked into the night around a table full of Awameh (sweet fried dough balls), Arabic coffee and chai tea.“This is the norm during Ramadan,” said Jude Adaileh, daughter of the ambassador. “The night is just beginning for many of us,” she said.The following are edited excerpts of the conversation with the ambassador and his family about observing Ramadan in Korea as well as about Jordan’s latest foreign policy with their neighbors and their counterparts in the Far East.: Any analysis of the King’s meetings abroad, his meetings, speeches, dialogues concentrate on Palestinian issues, because all issues of peace process between Palestinians and Israelis directly affect Jordan, especially in relation to borders, refugees, water, security and issues pertaining to Jerusalem.Jordan has always been affected by its geopolitical, geographical, demographic and economic situation in its foreign policy and international relations. Therefore Jordanian foreign policy is based on a number of key pillars including stability and security, the protection of higher national interests and the responsibility for the Palestinian cause.: It is difficult to answer because each will give an answer according to his or her perspective. If you look at the Middle East, it is the hottest area in the world, with some 90 percent of the world’s natural resources that operate the industrial mechanism all over the world. So naturally there are different voices and perspectives on how best to solve some issues unique to the area.: King Abdullah visited Korea five times in the last 15 years. Jordan, like Korea, is not rich in natural resources. So His Majesty the King focused on developing human resources, just as Korea did.Additionally, Jordan’s health sector developments are quite advanced in the region, and this was one of the areas that His Majesty the King focused on during his visit to Korea last time.Jordan and Korea are also working closely on renewable energy. His Majesty succeeded in creating partnerships between Jordanian and Korean companies to work together on developing renewable energy sources in Jordan, including solar, wind and nuclear. For instance, K-water is working with Jordan’s Ministry of Water and Irrigation and another Korean company is constructing a wind farm in the country at the moment.: I would go into the kitchen to start preparing something light for the family to eat before we pray. Usually our day begins around 3 a.m., as we gather together for a quick meal before we start fasting and praying throughout the day.: Then we would break the fast after sunset, often with friends and families, and this is called the Iftar.: We celebrate Iftar with families and friends, and they don’t have to be Muslim to celebrate together. Some Christian friends would invite us to their home to break the fast together, and they would try to make the time suitable to our prayer times.: I have Christian friends whose families would not cook during the day so that Muslims living around them would not smell the food being cooked while they are fasting.Adel Adaileh: This is actually a question we get asked often. The person who is cooking has the right to taste the food just to check the saltiness.Eman Aldomur: Yes, or it leads to disasters sometimes (laughs). One time I prepared juice for my children and I made a mistake because I put salt instead of sugar.Adel Adaileh: You cannot imagine. After Iftar, there is even traffic jam at nighttime, as most people are leaving their home — some are going to mosques to pray and some are going to visit their friends and families. People start their life during the night.Eman Aldomur: During Ramadan you connect with your relatives even more than usual. And not just with your relatives but your neighbors and especially your neighbors in need. One important aspect of Islam is charity. At the beginning of the month of Ramadan, many families fill boxes with oil, rice, canned food and other basic necessities and send them to neighbors in need or to orphanages and other facilities.Directions1. Directions for Laban Jameed available online.2. Put in a pot 35 pounds of lamb, two large onions, peeled and cut in half, four cardamom pods, and pour water, just enough to cover the meat and bring to a boil.3. Bring Laban Jameed to a boil in a separate uncovered pot and add to the pot of meat. Boil until meat is cooked.4. For rice: boil six cups of water, add one tablespoon of ghee, a half tablespoon turmeric, a pinch of cardamom and a pinch of salt. Add four cups of rice and boil until rice is fluffy.5. Layer a big communal platter with flat bread, top with rice, lamb and garnish with toasted almonds and pine nuts. Serve with the Laban Jameed stock.Directions1. In a bowl, mix two cups of flour, two teaspoons of sugar, one tablespoon of corn starch, two cups of warm water and two teaspoons of instant yeast.2. Cover the bowl and let it rest in a warm place for about one hour. Then mix the dough to get rid of trapped air bubbles.3. In a skillet, pour enough oil to fry the dough, and place over heat. Scoop small portions of the dough with a teaspoon and, using another teaspoon, slide and drop the dough in the skillet to fry in small rounded shapes.4. Let the Awameh balls fry until they float to the surface. Strain in colander and drop in cold sugar syrup for a few minutes to allow it to get absorbed.5. Remove from syrup and serve.BY ESTHER CHUNG [chung.juhee@joongang.co.kr]", "description": "", "authors": [], "top_image": "https://pds.joins.com/jmnet/koreajoongangdaily/_data/photo/2019/06/16181330.jpg", "published_at": "2019-06-16"}