{"pub": "businessinsider", "url": "https://businessinsider.com/integrated-cbd-raises-50-million-in-debt-and-equity-2019-10", "downloaded_at": "2019-10-09 19:11:33.996017+00:00", "title": "Growth-stage venture capital in the cannabis and CBD industry is getting harder to come by. So Integrated CBD raised debt.", "language": "en", "text": "Integrated CBD, an industrial-scale CBD oil manufacturer, closed a $50 million funding round on Tuesday.\n\nThe company raised from a mix of debt and equity investors.\n\nCEO Patrick Horsman told Business Insider why taking on debt was advantageous for a growing CBD company.\n\nClick here for more BI Prime stories and subscribe to our weekly cannabis newsletter, Cultivated.\n\nFor CBD companies, growth stage equity capital is getting harder to come by.\n\nThat's why Patrick Horsman, the CEO of Integrated CBD, an industrial-scale hemp oil manufacturer, took a novel approach in fundraising. He took on debt.\n\nIntegrated CBD closed a $50 million funding round on Tuesday, raising a mix of equity and debt from investors. The bulk of the debt, $30 million, was provided by an undisclosed $7.5 billion hedge fund.\n\nUnlike its high-inducing cousin, THC, CBD, or cannabidiol, is federally legal in the US. That means that institutional investors are able to lend to CBD-only facilities, lowering the cost of capital for operators.\n\nRead more: Square's top lawyer explains what's behind the company's push into the trendy CBD space\n\nAnd it could become a huge market. Analysts at the investment bank Cowen expect CBD to become a $16 billion market in the US alone by 2025.\n\nIntegrated CBD's CEO, Patrick Horsman, told Business Insider in a Tuesday interview that manufacturing CBD at an industrial scale takes a lot of capital to get off the ground. He didn't want to put his company at a disadvantage by paying high-interest rates or diluting too much of his and his cofounders' equity in the company.\n\nIntegrated CBD CEO and founder Patrick Horsman Courtesy of Integrated CBD\n\n\"We're trying not to pay a cannabis premium to investors,\" Horsman said.\n\nAccording to the specifics of the deal, Integrated CBD is giving up a small number of warrants to the debt investor and paying back the money with an interest rate in the low teens.\n\n\"So that's pretty attractive given some of the financing options we're seeing in the cannabis industry,\" Horsman said. Because of the history of cannabis — and the murky conflict between state and federal law in the US — cannabis and hemp companies often pay upwards of 20% when they take on debt.\n\n\"It had been a really good fundraising environment until June,\" Horsman said. But since public cannabis stocks saw their share prices plummet over the summer, the private markets have tightened up accordingly.\n\n\"Some of the banks have egg on their face from deals this summer,\" Horsman said. \"The spigot hasn't completely turned off but investors are being a lot more careful writing checks.\"\n\nIn any case, Integrated CBD has been on fundraising tear this year. Since January, Horsman said the company raised a $3.3 million pre-seed round from friends and family. In March, the CBD manufacturer closed a $10 million seed round, and then brought in another $15 million through an equipment lease facility that was used to help build out their main hemp-oil producing facility in Arizona.\n\nRead more: A California company tested 20 popular CBD products and found 'insanely high levels' of dangerous chemicals and misleading labels\n\nHorsman said the company closed on the debt facility in late August, and then brought in another $20 million from equity investors over the past few weeks as part of the Series A round. The equity investors, Horsman said, are mostly a mix of family offices, hedge funds, and some hedge fund managers Horsman had in his network who ended up investing their personal money into Integrated CBD.\n\nNavy Capital, a cannabis-focused hedge fund in New York, also participated in an earlier financing round. \"Capital drying up in cannabis has made it a great time to deploy to differentiated stories where valuations are at reasonable levels with the thesis still fully intact,\" Sean Stiefel, Navy Capital's CEO, said in an email.\n\nLooking to raise $100 million this year alone\n\nHorsman said the company has already engaged bankers to raise a Series B, though he declined to disclose the name of the bank. His goal is to raise $100 million this year, in order to build out the company's 10,000-acre hemp farm in Arizona — they planted their first organic-certified crop in June. It's also building an extraction and manufacturing facility to produce the CBD oil at an industrial scale near Phoenix\n\nThe facility is set to launch in the first quarter of next year, and Horsman said he is hiring engineers and managers from a recently decommissioned Honeywell plant in the area to staff the facility.\n\nBesides the capital projects, Integrated CBD is building out its sales, engineering, and accounting and finance teams, Horsman said.\n\nBecause of what Horsman says is \"widespread fraud\" in the organic space, Integrated CBD has also partnered with Verified Organic, a blockchain-based system for ensuring the entire seed-to-sale supply chain of CBD oil is, in fact, certified organic.", "description": "The CEO of Integrated CBD, an industrial hemp and CBD manufacturer, breaks down how he raised a fresh $50 million in an exclusive to Business Insider.", "authors": ["Jeremy Berke"], "top_image": "https://image.businessinsider.com/5d9df52b3b33a721fe2af678?width=1200&format=jpeg", "published_at": "2019-10-09"}