{"pub": "afr", "url": "https://afr.com/politics/federal/we-pay-our-taxes-big-business-frustrated-over-its-reputation-20191018-p531xk", "downloaded_at": "2019-10-18 02:03:27.554314+00:00", "title": "'We pay our taxes': Big business frustrated over its reputation", "language": "en", "text": "\"Australians can and should have confidence that the largest companies operating here are paying the right amount of tax,\" she said.\n\n\"While the ATO can claim credit for some amendments collected from large corporate taxpayers, the amount collected voluntarily has also increased. And although there is an amount attributable to ATO compliance activity, almost all of that amount relates to differences in view on interpretative issues, not non-compliance with the law.\"\n\nCorporate Tax Association executive director Michelle de Niese. Sahlan Hayes\n\nShe said extra compliance activities in the ATO's justified trust program, which targets the top 100 and top 1000 firms, had not reflected the high value of voluntary tax compliance.\n\nThe perception that large companies don't pay their tax is down to \"mixed media messaging\", changes to the law which politicians attribute to addressing corporate tax avoidance and entrenched misunderstanding about how the system works.\n\n\"These factors continue to drive public scepticism around Australia's largest corporate taxpayers and the system in which they operate, despite those taxpayers and that system contributing almost $100 billion in revenue per annum and earning a world leading compliance rate of 96 per cent, \" Ms de Niese said.\n\n\"The public should take heart in the fact that no other sector in the economy is more compliant or is as heavily scrutinised by the ATO than large corporates — as it should be.\"\n\nShe said costly compliance activities must be justified and resources should be directed to where the most risk of tax avoidance exists.\n\nAdvertisement\n\nLast month ATO deputy Jeremy Hirschhorn said Australia has some of the best compliance by large corporations anywhere in the world.\n\nGovernments are estimated to lose as much as $650 billion a year through worldwide corporate tax avoidance. Mr Hirschhorn believes the ATO is on track to reach 98 per cent but acknowledges \"suspicion and scepticism\" from the public.\n\nSmall businesses avoiding or mistaking tax liabilities cost the budget more than $11 billion a year, while the cost from individuals not paying their full liabilities in 2014-15 was $8.7 billion or a gap of 6.4 per cent.", "description": "The Tax Office's latest corporate tax estimates shows the net income tax gap for large corporate groups was $2 billion or 4 per cent of potential revenue.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.5298%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_95/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/a4cdc480ea36825fea1428b8c49c1f5138722e9c", "published_at": "2019-10-18"}