{"pub": "metro", "url": "https://metro.co.uk/2019/10/20/this-banana-phone-can-be-yours-for-the-ripe-price-of-32-10950671", "downloaded_at": "2019-10-20 17:02:40.552077+00:00", "title": "This banana phone is the perfect Christmas gift", "language": "en", "text": "‘Yellow, it’s me.’ (Picture: Banana Phone)\n\nOver time, we’ve conformed to a particular aesthetic of mobile phone.\n\nSleek, rectangular devices with a full touch screen and no physical keypads have taken the place of hot pink Motorola flip phones, the *groundbreaking* LG Chocolate and that Hiptop/Sidekick phone that you’d see in like every RnB music video circa 2004.\n\nIt goes without saying that feeling the cold aluminum of your iPhone in your hands isn’t quite as nice as holding a more novelty device, like Spongebob’s conch shell phone, or the hamburger landline from Juno.\n\nIn a world with so many different tastes, how do we get by with such plain-looking phones?\n\nFortunately, a tech company in San Francisco has designed a handset that will add some much-needed potassium to your smartphone game.\n\nThe Banana Phone is a banana-themed Bluetooth device that you can use to take calls by pairing it with your incredibly standard and non-yellow smartphone.\n\nBehold: the banana phone. It will pair to your smartphone and last up to 10 hours. (Picture: Banana Phone)\n\nThe wireless handset does not discriminate, with functionality to connect with either iPhone and Android Devices.\n\nAdvertisement\n\nAdvertisement\n\nIt’s also rechargable with a micro USB, has a 30ft Bluetooth range and 10 hour talk time. That means a lot of time for heart-to-hearts using your trusty banana.\n\nPicture this. Your long-distance partner calls, and you answer on the banana phone. They proceed to tell you that it’s just not working out and that the relationship is over. This is pretty sad news, but it doesn’t feel so bad because you’re hilariously clutching a banana to your ear, right?\n\nThe same goes for happy occasions. The boss calls to announce you’ve got the promotion? The banana phone will make it even more memorable. Estate agent phones to let you know they’ve accepted your offer on the house? The banana phone is literally a good luck charm. Mum calls to tell you your great uncle has died, leaving you with a considerable fortune? Well it looks like you’re buying 10 more banana phones.\n\nYou could look this ripe, if you like. (Picture: Reshma Trilochun)\n\nThe original banana phone was the result of a successful Indiegogo campaign in 2017, in which the developers raised £34,551 for the project. The phone has since been revised to include some new updates such as extended battery life.\n\nThe banana phone has also been constructed from ethically sourced materials including 100% recycled ABS plastics. The packaging is also 100% fully recyclable cardboard.\n\nThe folks behind the company are also members of 1% for the Planet, and thus contribute 1% of annual sales directly to conservation efforts of fellow banana-lovers/gorillas in the Democratic Republic of Congo and Rwanda.\n\nAdvertisement\n\nAdvertisement\n\nYou can find this ripe little device on Amazon for £32.\n\nMORE: You can now buy a mini hot tub just for your testicles\n\nMORE: What I Own: Jade, a 26-year-old blogger who saved a £27,000 deposit for a two-bedroom flat in Harlow\n\nMORE: Thrifty mum wears 10p charity shop evening gown to black-tie event\n\nAdvertisement Advertisement", "description": "The Banana Phone is a banana-themed Bluetooth device that you can pair with your plain old smartphone to take calls.", "authors": ["Serena Coady"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_90833913_1571577322.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-20"}