{"pub": "politico", "url": "https://politico.com/newsletters/morning-cannabis-preview/2019/09/13/cannabis-banking-action-in-the-senate-475739", "downloaded_at": "2019-09-13 18:27:22.643153+00:00", "title": "Cannabis banking action in the Senate?", "language": "en", "text": "Cannabis banking action in the Senate? Presented by the National Cannabis Roundtable\n\nWelcome to the POLITICO Pro Cannabis preview newsletter. Free access to the preview newsletter is available through Sept. 30, 2019.\n\nQuick Fix\n\n— The Senate could be the first to move a cannabis banking bill, now that Banking Committee Chairman Mike Crapo is interested in taking action. It doesn’t mean he supports legalization at the federal level.\n\n— The Congressional Black Caucus will hear from cannabis industry executives today on how opening up banking access to cannabis businesses could help minority business owners.\n\n— Harvest Health CEO Steve White said the industry needs to do a better job coordinating its efforts on Capitol Hill and presenting lawmakers with a coherent message about what legislative changes they’re seeking.\n\nA message from the National Cannabis Roundtable: The National Cannabis Roundtable advances 21st century cannabis policy in the United States. We advocate for common sense federal regulation, tax equity, financial services reform, social justice and support changing federal law to acknowledge states’ rights to regulate and manage their own cannabis policies. Learn more at https://nationalcannabisroundtable.org/\n\nBUT FIRST…\n\nIT’S FRIDAY, SEPTEMBER 13. WELCOME TO POLITICO’S DAILY CANNABIS NEWSLETTER. ABC’s #demdebate moderators brought up marijuana last night, but no one really took the bait. Sens. Kamala Harris and Cory Booker both talked generally about drug policy, but no one zeroed in on it. Until (after they finally) do, make sure to send us cannabis news, tips or feedback at nfertig@politico.com or @natsfert. And follow us on Twitter: @POLITICOPro. Read more about our mission in our inaugural issue.\n\nDriving the Day\n\nMARIJUANA BANKING BILL GETS MAJOR BOOST FROM TOP REPUBLICAN — The chairman of the Senate Banking Committee wants to hold a vote this year on legislation that would enable banks to serve cannabis-related businesses, in what would be a major victory for the marijuana industry.\n\nIn an interview with POLITICO’s Zachary Warmbrodt, Senate Banking Chairman Mike Crapo (R-Idaho) said he does not support lifting the federal ban on marijuana. But Crapo said he wants to resolve legal and economic conflicts arising in the growing number of states that allow medical or recreational sales.\n\n\"We're working to try to get a bill ready,\" he said. \"I'm looking to see whether we can thread the needle.\"\n\nThe Senate has been seen as a huge impediment to enacting any marijuana legislation this year, with many top Republicans — including Senate Majority Leader Mitch McConnell — wary of boosting an industry that remains illegal under federal law. Crapo, who represents a state that has not legalized marijuana, has not previously said that he was planning to hold a vote in his committee.\n\nWhat happens next? The House later this year is expected to pass legislation that would shield banks from federal penalties if they work with cannabis businesses — although it’s been held up by concerns among legalization advocates and some Democrats that the bill fails to do anything to address economic equity or criminal justice reform.\n\nIn the Senate, Sens. Jeff Merkley (D-Ore.) and Cory Gardner (R-Colo.) have introduced cannabis banking legislation. But Crapo told Zach he may write a new bill: \"We may craft our own bill or we may work with them to craft any amended legislation.\"\n\nOn The Hill\n\nThe Congressional Black Caucus hosts a conversation on cannabis banking at 9 a.m. Eastern this morning. The panel will include Chanda Macias — owner of National Holistic Healing Center, Gerrel Oliver with Pura Vida Investments, Amber Littlejohn of the Minority Cannabis Business Association and Charlie Bachtell the CEO of Cresco Labs, and it will be moderated by Gia Moron, president of Women Grow. Its focus is on how banking impacts the minority cannabis business community and promotes social equity.\n\nJudiciary Chairman Jerry Nadler ’s Marijuana Opportunity Reinvestment and Expungement Act of 2019, the MORE Act, gained two more cosponsors this week: Rep. Mark Pocan (D-Wisc.) and Rep. Raúl Grijalva (D-Ariz.). The MORE Act is a comprehensive bill that includes criminal justice reform and social equity programs, and it’s one of two cannabis bills getting attention in the House right now.\n\nU.S. reps. from Florida, Donna Shalala and Matt Gaetz , introduced bipartisan legislation to expand cannabis research on Thursday. The Expanding Cannabis Research and Information Act would reclassify cannabis to a category with fewer restrictions under federal drug laws. Marijuana now falls in the most restrictive category, making it difficult for researchers to study. The bill would set a national cannabis research agenda and direct the Department of Health and Human Services to collect data on the substance.\n\nThe State of Marijuana\n\nMURPHY’S EXPUNGEMENT PLAN SHORT ON VOTES — The New Jersey Senate won’t take up Governor Phil Murphy’s changes to a bill that would have wiped out some criminal records on Thursday that was initially tied to a marijuana legalization package that stalled in the legislature last session, POLITICO New Jersey’s Matt Friedman reports.\n\nWhy did the governor veto the bill? The original legislation required those eligible for expungement to petition the courts themselves, a burden to an individual who can’t afford an attorney. States increasingly are adopting technological solutions to automate the expungement process. Murphy cited Pennsylvania’s computerized process for identifying eligible cases as an example that the New Jersey bill could follow. Expect to see similar provisions as other state legislatures consider marijuana legalization.\n\nAlso in New Jersey… Murphy announced the creation of a task force to study the harms of vaping on Thursday, POLITICO New Jersey’s Ryan Hutchins reports. Senate President Steve Sweeney said he wants to draft a bill to ban vape products, but he hadn’t yet determined how the bill would affect marijuana vaping. Both Sweeney and Murphy hope to legalize recreational marijuana.\n\nCALIFORNIA LEGISLATURE PASSES CANNABIS DONATION BILL — The state legislature sent Gov. Gavin Newsom a bill that would allow cannabis retailers to give marijuana to needy patients without paying taxes on it. POLITICO California’s Alex Nieves reports that only businesses that are authorized retailers would be allowed to give away marijuana. The state’s seed-to-sale tracking system still needs to be updated to handle the giveaways.\n\nWhy is this necessary? Marijuana legalization often comes with unintended consequences, and California’s legalization law was no exception. Back in the days of the state’s unregulated medical marijuana market, cannabis cooperatives would give away medical marijuana to patients in need. The state’s legalization law essentially barred cannabis businesses from continuing the practice unless they paid excise taxes on the marijuana they were donating.\n\nINTERSTATE COMMERCE MOVEMENT SPREADS OUTSIDE OREGON — In June, Oregon Governor Kate Brown signed into law a bill that allows Oregon to export marijuana should the federal government OK interstate commerce. Craft Cannabis Alliance played a major role in getting that bill passed and is setting its sights on other states. CEO Adam Smith told POLITICO he is already working with trade groups and business leaders in California to pass similar legislation. The final goal is to have a multi-state trade framework laid out by the end of 2020, while simultaneously lobbying the federal government to pass legislation — like the State Cannabis Commerce Act introduced last month — or a DOJ memo that protects states that ship marijuana across state lines.\n\nUNITED STATES DEPARTMENT OF CANNABIS\n\nTHE LATEST ON VAPING — The FDA told senators a flavored e-cigarette ban is coming within weeks, but there’s still no word on marijuana. Meanwhile, states are starting to act: Massachusetts may require all marijuana companies to list the ingredients in vape cartridges, and Oregon is asking dispensaries to pull and products from their shelf they think may be unsafe and requiring them to put up warning signs.\n\nMeanwhile, the CDC updated the number of cases nationwide, based on new criteria. Some 380 cases in 36 states have been confirmed — or probably are related to — e-cigarette or vape use. The number decreased from 450 because the CDC stopped counting “possible” cases and counted only those that are confirmed or probably attributable to e-cigs or cannabis vapes. The CDC also said it is “coordinating a multi-state investigation.” Massachusetts Cannabis Commissioner Shawn Collins confirmed that the state health department has been in close communication with the CDC and FDA. “I think the more we can pull our resources together and at least talk to each other — it isn’t happening in a bubble,” Collins said. “I think other states have legalized cannabis industries that are probably asking themselves the same questions.”\n\nIndustry Intel\n\nHARVEST HEALTH CEO: LACK OF UNITY HURTING CANNABIS INDUSTRY ON CAPITOL HILL — Harvest Health and Recreation CEO Steve White said he believes the country is on an inevitable path toward full legalization of cannabis. But the 45-year-old founder of the Phoenix-based company — which announced the acquisition of Verano Holdings for $850 million in March — sees challenges in working with lawmakers in Washington who don’t know much about the rapidly growing industry.\n\n“We’re focused on legitimization and education,” White told our Paul Demko during an interview at the Watergate Hotel in Washington on Thursday morning.\n\nBut White also worries that the proliferation of cannabis industry groups seeking to influence policy on Capitol Hill is making progress more difficult. The reason: Lawmakers might not be getting a consistent message about what legislative changes would help cannabis companies succeed.\n\n“It’s always been a problem for this industry,” White said. “It’s a little bit like watching 6-year-olds playing soccer. Everybody chases the ball — and the ball’s going all over the place.”\n\nAt the top of Harvest’s agenda on Capitol Hill: legislation that would enable banks to do business with cannabis companies without fear of federal punishment. But White argues that access to banking is crucial if smaller companies are going to gain a foothold in the cannabis marketplace.\n\n“Banks are not going into poor communities and offering big loans with favorable terms,” White said. “It doesn’t happen. Even the large cannabis companies face issue with access to capital.”\n\nAround the World\n\nResearchers found that drug-testing devices commonly used by Australian police to detect impaired driving are not very reliable. The devices, which supposedly detect cannabis impairment by measuring THC concentration in saliva, returned false negatives when THC concentrations were high, and also returned false positives when THC concentrations were low. The devices have not been adopted in the U.S., though startups and governments are funding their development.\n\nMovers and Shakers\n\nTim Brown is joining hemp CBD company Ojai Energetics as a business partner. He formerly served as president and CEO of Nestlé Waters North America and president and chief operating officer of Chobani.\n\nKathy Casey is joining hemp CBD company HeavenlyRx as chief customer officer. She was previously vice president at Kellogg’s.\n\nGil Christie is joining Green Flower Media as EVP of Enterprise Solutions & Investor Education. He was previously the founder and CEO of Fitch Learning.\n\nA message from the National Cannabis Roundtable: The cannabis boom in America is real and growing. A diverse group of patients, veterans, bankers, law enforcement officers and many others supporting cannabis reform demonstrates a fundamental shift in our culture. 93 percent of Americans support cannabis marijuana reform and a strong majority support adult use. There are billions of dollars in new tax revenues on the line. There is the promise of almost a million jobs. New medical research gives hope to suffering patients. It’s vital that politicians respond to the overwhelming public sentiment for cannabis reform. The National Cannabis Roundtable seeks to educate policymakers and advocate for legislative change at the federal level and unlock the potential of this dynamic new industry. Learn more at https://nationalcannabisroundtable.org/\n\nBy the Numbers\n\n12 years — That’s the length of a prison sentence for an Oklahoma woman who sold $31 worth of cannabis. She was eventually paroled but is back in jail over unpaid court fees in the 2010 case.\n\n2,835 — That’s the number of illegal marijuana businesses in California discovered in an audit by the United Cannabis Business Assn. There are only 873 licensed cannabis sellers in the state.\n\nPot-Pourri\n\n— Prosecutors in Idaho dropped marijuana trafficking charges against an Oregon man who was transporting industrial hemp through the state. The man pleaded guilty to a lesser charge, avoiding prison time.\n\n— A Bronx judge called out NYPD officers for using the smell of marijuana to justify traffic stops and searches, The New York Times reports. A marijuana legalization bill that stalled in the state legislature would have forbidden police from using the smell of weed for searching vehicles.\n\n— The smell of weed is causing tension between marijuana growers and residents in California. The Wall Street Journal reports that Santa Barbara officials welcomed large-scale cannabis cultivators for the tax revenue. But now, residents are pushing back.\n\nFollow us on Twitter Paul Demko @pauldemko\n\n\n\nNatalie Fertig @natsfert\n\n\n\nMona Zhang @zhangmona\n\nFollow Us", "description": "The latest on vaping — Cannabis messaging on the Hill", "authors": ["Follow Us On Twitter"], "top_image": "https://static.politico.com/da/f5/44342c424c68b675719324b1106b/politico.jpg", "published_at": "2019-09-13"}