{"pub": "washingtonpost", "url": "https://washingtonpost.com/outlook/2019/09/05/how-fantasy-sports-boom-reflects-changing-nature-masculinity", "downloaded_at": "2019-09-05 10:29:36.758141+00:00", "title": "How the fantasy sports boom reflects the changing nature of masculinity", "language": "en", "text": "\n\nThe National Football League logo is displayed during the 2019 NFL Draft in Nashville. The season kicks off Thursday, and millions of fantasy football fans will be ready. (Steve Luciano/AP)\n\nMichael Serazio, an assistant professor of communication at Boston College, is the author, most recently, of \" The Power of Sports: Media and Spectacle in American Culture .\"\n\n“I believe in rough games and rough, manly sports,” President Teddy Roosevelt once blustered. “I do not feel any particular sympathy for the person who gets battered about a good deal so long as it is not fatal.”\n\nFor Roosevelt, and for many other men through millennia, sports were a hotblooded endeavor. They aestheticized ancestral toil — in the fields, in the factories — as competitive ballet.\n\nToday, sports culture has become clinical, wonkish and hyper-rationalized. There’s never been a greater obsession with statistically converting the physical exuberance of athletic activity and venerating those who can do it well.\n\nDaniel Okrent is partly to thank for that.\n\nForty years ago this autumn, Okrent birthed fantasy baseball — imaginary rosters stitched together from players from around Major League Baseball to compete statistically against others’ imaginary rosters. Okrent says he fantasized about being a general manager rather than the star slugger “because I was a [crummy] athlete.”\n\nA few decades hence, some 60 million fellow crummy athletes play fantasy sports, enriching a multibillion-dollar annual market. With the NFL season starting Thursday night, you can find us poring over roster details, mock drafts and statistical arcana.\n\nThe growth has reshaped sports leagues and media and sapped what used to be traditional team loyalties — that much is obvious. But fantasy has also redefined sports manhood by reflecting changing labor ideals.\n\n[Daily fantasy sports sites say their users aren’t gambling. They’re wrong.]\n\nHistorically, sports have offered parables about how men are supposed to behave, both on and off the field, and therefore within and beyond the workplace. Among scholars, it’s pretty much taken for granted that sports help uphold a toxic masculinity — that strong, aggressive and rugged male ideal that Roosevelt so fetishized a century ago.\n\nThis is not how famed Oakland A’s GM Billy Beane relates to sport, nor how you or I do as fantasy players, wheeling and dealing in his likeness. Yet Roosevelt’s fetish was as much a product of his time as is ours with fantasy.\n\nFor at the turn of the 20th century, masculinity found itself in similar “crisis” in American culture: An agrarian age was subsumed by the new industrial world, with different jobs offered and different demands made upon the bodies, livelihoods and, therefore, dignities of men. As machines replaced what had previously been accomplished by beefy dint, fears became widespread — a perceived atrophy of not just muscles, but the visible index of patriarchal power.\n\nAgainst that backdrop, organized sports emerged and helped assuage anxieties. They offered alleged proof of masculine superiority and a tantalizing space where heroes still modeled “pioneer traits” — where pure muscle and raw effort foretold survival destiny.\n\nBrawn, however, counts for much less on a résumé in 2019. And fantasy sports offer men similar metaphors of what work should be rewarded.\n\nTake this sexist recent DraftKings ad: “Former accountant Derek Bradley,” an awestruck narrator announces, as the camera pans over the marble statue of a skinny, pasty fellow, clutching wads of cash and being scaled by tiny women. “Fantasy baseball took him from a guy with holes in his underpants to a guy with bikini models in them.”\n\nThis is what “the end of men” apparently looks like: a postindustrial economy that is, as the Atlantic’s Hanna Rosin puts it, “indifferent” to men’s strength and size, evidenced by the Great Recession’s demolition of explicitly physical trades such as manufacturing and construction.\n\nSports have undergone the same profound digital disruption. Nowadays, data is, in and of itself, a competitive arena for sports participation (not to mention economic primacy, driving tech stocks skyward).\n\nFantasy gets us to think and feel about sports fundamentally differently than traditional fandom — more in keeping with those hyper-quantified norms. The longer you play, the more you wind up adjusting lineups each Sunday morning with the player’s name and photo invisible to you; it’s merely an equation to be solved, a string of data to be leveraged for competitive advantage. Is that really so different from how the titans of tech look upon us all?\n\n[Sports were already politicized. And sports culture is deeply conservative.]\n\nFantasy schools us in “vicarious management” — a new mode of fandom consciousness where we identify with ownership regimes rather than disposal player properties. It’s given rise to a post­-“Moneyball” “cult” of the GM, in which fans idolize a great and powerful Oz behind the scenes, wearing khakis, talking on a cellphone and algorithmically unlocking “aha!” insights on spreadsheets.\n\nFranchises have thus been bolstering their scouting staff with analysts, engineers and software developers in the hopes of excavating some statistical advantage unseen by the naked, qualitative eye. Unparalleled amounts of player performance data and biometric information are now subjected to regular regression analysis that wasn’t even conceivable a few years ago: from panoptic basketball “smart courts” to MLB sensory compression sleeves and bat sensors to player DNA sequencing. The front office of the world champion Houston Astros boasted a former NASA bio-mathematician — not exactly the “dumb jock” stereotype held aloft for decades of sports culture.\n\nIn turn, young skippers who can manage by metrics slowly supplant an obsolete old guard with a disruption-loving lack of sentimentality: “There will be two kinds of coaches around the world,” predicts one executive at a sports tech firm. “There are going to be coaches that believe in this kind of analytics and engage with it and there are going to be former coaches.”\n\nThey’re not the only American workers being told their operating system is out of date.\n\nFor four decades, fantasy has modeled these labor ideals for us. Billy Beane — and, for that matter, every Monday morning quarterback swaggering into the office, chest puffed out from his fantasy roster’s weekend domination — no longer typify Roosevelt’s “rough, manly” sportsman ideal. We now celebrate sports in a more bloodless, number-crunching fashion.\n\nIt’s still just play, but fantasy gaming has foreshadowed much about the future of work — and perhaps manhood as well.", "description": "Labor ideals in sports have changed, along with the labor market in the broader world.", "authors": ["Michael Serazio", "An Assistant Professor Of Communication At Boston College", "Is The Author", "Most Recently", "Of", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/H60K3K67c-O_gPR3M6EWvuFcAh4=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QIPI2JDITMI6TJUYFKHYBDE47M.jpg", "published_at": "2019-09-05"}