{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7576203/Boris-Johnsons-Tories-extend-leader-Labour-WALES-Boris-Johnson-new-poll-shows.html", "downloaded_at": "2019-10-15 16:53:28.206755+00:00", "title": "Boris Johnson's Tories extend their leader over Labour in WALES under Boris Johnson, new poll shows", "language": "en", "text": "The Tories have surged into a four-point lead over Labour in Wales, a shock new poll suggests.\n\nBoris Johnson's party is on 29 per cent, an increase of five per cent in what is one of the left-wing party's traditional heartlands.\n\nJeremy Corbyn's party was also up by 3 per cent, with both parties benefiting from a decline in support for the Brexit Party and the Greens.\n\nIt doubles the Conservative lead in the Welsh Barometer, conducted by ITV Wales and Cardiff University, from two per cent in the last survey in July.\n\nIt predicts a swing would be large enough to win the Tories 17 Welsh seats, including Brecon and Radnorshire, which it lost to the Lib Dems in an August by-election.\n\nBoris Johnson's party is on 29 per cent, an increase of five per cent in what is one of the left-wing party's traditional heartlands\n\nSome 56 per cent of 1,032 people polled said that Brexit was the largest single factor in the coming election. And a resounding 89 per cent of prospective Tory voters would support a No Deal Brexit, the survey found.\n\nProfessor Roger Awan-Scully, of the University of Cardiff, tolds ITV: 'Our latest Welsh Political Barometer poll is a fitting reflection of the uncertain political times in which we are living.\n\n'The Conservatives will be greatly encouraged by their rise in support since our last poll.\n\nJeremy Corbyn's party was also up by 3 per cent, with both parties benefiting from a decline in support for the Brexit Party and the Greens\n\n'By contrast, despite a modest recovery since our last poll, Welsh Labour look to be on the defensive.\n\n'Both for Westminster and the Assembly they currently seem on course to lose significant ground. But perhaps what the poll most reinforces is the extent of the current divides within a Wales, and a UK, in which the defining political issue is Brexit.\n\nWith momentous developments on that issue possibly just days away, the electoral landscape could soon be witnessing further turmoil.'", "description": "The Tories have surged into a four-point lead over Labour, with Boris Johnson's party on 29 per cent, an increase of five per cent in what is one of the left-wing party's traditional heartlands.", "authors": ["David Wilcock", "Whitehall Correspondent For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/17/19749268-0-image-a-56_1571156285487.jpg", "published_at": "2019-10-15"}