{"pub": "reuters", "url": "https://reuters.com/article/us-eu-ommission-life/liberal-socialist-meps-want-european-way-of-life-title-ditched-idUSKBN1WI2B6", "downloaded_at": "2019-10-04 02:36:23.807810+00:00", "title": "Liberal, socialist MEPs want 'European Way of Life' title ditched", "language": "en", "text": "BRUSSELS (Reuters) - Liberal and socialist lawmakers at the European Parliament called on Thursday for a new title of European Commission Vice President for Protecting our European Way of Life to be scrapped because of its “toxic” far-right connotations.\n\nFILE PHOTO: EU Commission President-designate Ursula Von der Leyen leads a seminar of the new European Commission designated executives at the Chateau du Lac hotel in Genval, Belgium, September 12, 2019. REUTERS/Francois Lenoir/File Photo\n\nUrsula von der Leyen, the incoming president of the EU’s executive, announced last month that Greece’s Margaritis Schinas would be given the title, but it has been sharply criticized and she is under increasing pressure to drop it.\n\nSchinas, a former member of the European Parliament (MEP) and a long-serving Commission official, found himself in the crosshairs of liberal and socialist lawmakers during a three-hour confirmation hearing on Thursday.\n\nKicking off the hearing by Parliament’s committees on civil liberties and justice, and culture and education, Spanish socialist Juan Fernando Lopez Aguilar asked Schinas to explain his future role.\n\n“What do you mean? What does it mean? Because surely, we can agree there’s a European way of life but we need to also agree as to the content,” said Lopez Aguilar, who chairs the civil liberties committee.\n\nDutch liberal Sophia in ‘t Veld called it a toxic title which has been embraced by the far right.\n\n“The title needs to go. Full stop. So my advice to you: drop the dog whistle and work with us for the next five years for a European Union that is open and inclusive,” she said.\n\nGerman socialist Birgit Sippel was equally critical.\n\n“Your title plays to the right wing,” she said.\n\nSchinas gave a spirited defense of the title, which he had initially attached to his Twitter profile but has since removed. He now describes himself as Commissioner-designate for migration, security, social rights, education, culture and youth.\n\n“At its core, being European means protecting the most vulnerable in our societies. It means healthcare and welfare systems that all can access. It means having the same opportunities. It means promoting culture and sport as core elements of our systems,” he said.\n\nParliament will vote on the Commission as a whole on Oct. 23 before it can take office.", "description": "Liberal and socialist lawmakers at the European Parliament called on Thursday for a new title of European Commission Vice President for Protecting our European Way of Life to be scrapped because of its \"toxic\" far-right connotations.", "authors": ["Foo Yun Chee", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191004&t=2&i=1436852318&w=1200&r=LYNXMPEF9302A", "published_at": "2019-10-04"}