{"pub": "nymag", "url": "https://vulture.com/2019/10/succession-season-2-cousin-greg.html", "downloaded_at": "2019-10-07 04:07:55.525484+00:00", "title": "Succession Season 2: Nicholas Braun on Cousin Greg", "language": "en", "text": "Nicholas Braun. Photo: Andrew Toth/Getty Images for Entertainment Weekly\n\nNicholas Braun, otherwise known as Cousin Greg on Succession, had a lengthy conversation with Vulture ahead of the HBO show’s second season, but a lot has happened since then: We’ve learned what “boar on the floor” means, watched Cherry Jones fake-serve a dinner roast, and wondered if a cruise scandal might take down Waystar Royco. In light of Sunday night’s episode, “DC,” and with next week’s finale on the horizon, we caught up with Braun to talk all things Succession, including Kendall’s rap, how much trouble Greg might be in after Tom’s disastrous congressional testimony, the current whereabouts of those cruise documents, and whether Greg the Egg could ever jump to the dark side.\n\nLet’s talk about Kendall’s rap. Greg seemed like he was pretty into it!\n\nI think Greg supported Kendall’s expression of himself. Greg was just cheering him on. They’re like roommates. They live in the same building, and I think Kendall was going over his rap with Greg ahead of the ceremony. So it wasn’t a surprise to Greg. He might’ve even known some of the lyrics, and he was pretty psyched about how it was received.\n\nHow many times did Jeremy Strong launch into that performance?\n\nI can’t remember how many times. It was definitely enjoyable every single time. It didn’t get old, ever. He worked really hard on it, Jeremy, and he just destroyed it. He surprised everyone that he was actually very good at rapping. Who knew? But in the pilot he’s rapping to the Beastie Boys. That’s the first thing out of his mouth. Maybe we should’ve known better.\n\nHis Logan jersey, Jeremy finagled one of those for me, which was really nice. So I’ve got an L to the OG jersey back in New York.\n\nDo you wear it around? If people don’t recognize you already, they definitely will if they see you in that shirt.\n\nIt’s me representing the Roy family, Roys’ family values, and I think the streets of New York will respond well to it. Hopefully, they’ll just start singing that hook. It’s pretty catchy: L to the OG.\n\nI also want to ask about the term “Gregxit.” Have you incorporated that into your daily vocab yet, or not so much?\n\nAs Nick, I have not been using the term Gregxit.\n\nIt wouldn’t make a lot of sense.\n\nBut it is definitely one of the best lines that they gave me this season. I got the script and I was like, “Oh my God, of course. How did we not think of it before?” But I never would have thought of it because these guys are just on another level. I cherished that line and really wanted to make sure that it felt like an actual thing I’m saying, not just because it’s a great line, but because Greg actually is debating whether he has to leave, or whether he’s saying that as a bluff to Logan to gauge his reaction.\n\nDo you think Logan is serious when he tells Greg that he likes him, or is he just trying to keep him in the fold to spite his brother?\n\nIt’s a little bit of both. Greg wouldn’t have been able to hang around so long unless Logan did see some potential in him. I also think the brother dynamic is always going to be there. However he can get one over on his brother, he’s going to take that opportunity. Logan always wants to win.\n\nGreg turned down a quarter of a billion dollars from his grandfather. Why do you think he did that? What does he get from being around the Roys that makes him willing to turn down such a huge fortune?\n\nHe’s making a really good salary, but $250 million would be crazy. Obviously, it’s not all about the money. It’s about what that family makes him feel like. He’s a single child with a single mother and a grandfather who’s such a downer. There are human draws to this other side of the family. It’s more exciting. It’s more chaotic and obviously some of their values aren’t the same as his, but he’s living this dream life. He’s drunk on it, maybe addicted to it, and he’s just too deep to pack up his bags and call it quits. And then what? Wait for his grandpa to die and have a bunch of money? And then what? He’s forming relationships, he’s learning skills, he’s getting to put on a suit and go to work every day, and he’s getting to fly to hunting trips. All the spoils are just too great.\n\nThe big focus of the “DC” episode is the congressional hearing. Based on what’s discussed during the testimony, members of Congress are aware of the documents that Tom and Greg destroyed. How much trouble, on a scale of one to 10, could Greg potentially be in?\n\nHe could go to jail. There would be real legal problems for him. If they wanted to prosecute him, they would have a case. If jail is 10, then 10. Maybe it’s a white collar jail, so it’s a nine and a half? He’s not in with the murderers. But yeah, that could definitely be a really, really bad situation.\n\nBut he also saves at least a couple documents. I assume that decision will be significant in some way, right?\n\nThose documents still do exist. He also tried to voice memo the document burning a bit. So he’s got a couple of pieces that he might be able to play, depending on what he actually salvaged out of that pit.\n\nWas that vague enough for you?\n\nThat was perfectly vague and yet quasi-informative.\n\nGood, good, good.\n\nGreg can seem so naive, but then he does something like grabbing those documents to cover his own butt. It’s also hard to gauge where exactly he fits on the spectrum of good people and bad people. Is that something that you wrestle with as you’re playing him?\n\nYeah, definitely. Greg lives in that gray area. He’s more on the ethical, moral, decent values side of the coin than most of the Roys, but all of us are susceptible to doing bad things to get what we think we want. Yeah, he’s slipping from his own moral compass. But at the same time, he might do the right thing with the document, you know? Or he might take over a department and be a source of decency at ATN or wherever he gets put.\n\nI believe that Greg he is a source of good, but it’s fun to see what feels right in terms of letting him get tarnished. I don’t know how far that will go, but it’s definitely something that Jesse [Armstrong] and I try to navigate — let Greg get influenced, but maybe not completely, fully manipulated, by the way that they do things.\n\nIs he capable of going completely to the dark side?\n\nI don’t know. There’s some stuff that happens in the finale that feels like Greg is stretching himself in ways to … yeah. Oh shit. I want to tell you stuff, but I can’t. In the finale, he gets put up against some walls and makes decisions that are indicative of how far he is willing to go to be a Roy.\n\nAt the end of this week’s episode, Logan says to Shiv that they need to make a “blood sacrifice.” I’m not asking you to tell me, but would Greg be a potential sacrifice? He’s blood, but he’s not super-close blood. Even though he has a connection to the documents, he’s not quite as central as someone like Tom or Kendall. What can you say about that?\n\nI can say that there are a lot of names on the table for the blood sacrifice, and Greg is in that mix. But yeah, that’s all I can say.\n\nIf things do get hairier for Greg, whether it’s in the finale or at some other point in the future, which of his qualities do you think is most likely to serve him well?\n\nGreg is a bit of a shape shifter. If he gets into a sticky situation, he usually shifts into the right thing. He’s been watching and learning a lot from these people. He’s equipping himself with the right stuff. He’s a pretty good liar. In the pilot, he has this phone call with his mother where he tells her about he picked up a hitchhiker who was smoking weed in his car. Really, he was just smoking weed in his car. Maybe he can’t fool his mom, but generally, he’s a good liar. That helps him turn into stuff that he isn’t, necessarily.\n\nWell, I hope he becomes Tom’s boss at some point. Just because I would like to watch that dynamic play out.\n\nOh my gosh, how fun that would be? Oh man. I don’t know how that would happen. I feel like that’s just too delicious. But hopefully, there’s something like that. As long as I get to keep working with Matthew [Macfadyen], I’ll be happy in any capacity.\n\nEven when he’s throwing water bottles at you.\n\nHe could do that every week and I’d be just fine with it.", "description": "A conversation with Nicholas Braun, who plays Cousin Greg on Succession, about the episode “DC” and the Succession season two finale.", "authors": ["Jen Chaney"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/04/04-nicholas-braun-chat-room-silo.w1200.h630.jpg", "published_at": "2019-10-07"}