{"pub": "cbc", "url": "https://cbc.ca/kidsnews/post/nic-sick-teen-reacts-to-canadas-first-serious-vaping-illness", "downloaded_at": "2019-09-20 22:39:37.254487+00:00", "title": "Nic sick: Teen reacts to Canada’s first serious vaping illness", "language": "en", "text": "‘Never touching a vape again,’ teen says\n\nTyler Barone remembers the first time he got \"nic sick.\"\n\nHe was hanging out at a friend’s house, chatting and vaping — and then it dropped like a bomb.\n\n“It comes over you like a wave,” the 18-year-old Montrealer said. “You feel like you’re about to pass out, you’re really dizzy and then there’s chronic vomiting.”\n\n“It’s like having a really bad flu,” he said. “No one wants to experience that.”\n\nThat was one of the reasons Tyler decided to quit vaping for good about five months ago — five years after he started.\n\nIt also helps explain why he wasn’t surprised to hear that a high school student in Ontario was put on life support after coming down with a serious illness linked to vaping.\n\nIn this case, it was a respiratory illness — meaning it affected their breathing.\n\nWhen the news came out on Sept. 18, health officials said it was the first known case of its kind in Canada.\n\nThe teen has now been released from hospital and is doing fine.\n\nBut an investigation is underway by Canada’s chief medical officer of health to figure out exactly what happened.\n\nThere have been hundreds of similar cases in the United States, including at least seven deaths.\n\nVaping is the word used to describe what happens when you inhale vapour — often containing nicotine — using a vape pen or e-cigarette. (Aliaksandr Barouski/Shutterstock)\n\nIn Canada, it’s illegal for anybody under the age of 18 to buy vaping products.\n\nThey’re highly addictive and some researchers say vaping can lead to smoking.\n\nTyler remembers having to fight the urge to vape.\n\n“It’s not fun craving something,” he said. “You can’t focus.”\n\nTyler Barone said he first tried an e-cigarette in Grade 8. He experimented with vaping off and on for about five years, but now he says he’s quit for good. (Charles Contant/CBC)\n\nTyler said it’s hard to tell if other students at his school, John Abbott College, are taking the warnings about vaping seriously.\n\n“It’s hard to pinpoint where we’re at,” he said, but in general “people don’t listen until it’s too late.”\n\nIn the meantime, Tyler said he’s happy to put vaping behind him for good — and to speak out about why he quit.\n\n“I am never touching a vape again. That’s 100 per cent for sure.”\n\nThere have been hundreds of severe respiratory illnesses linked to vaping in the U.S., but experts are calling this a first for Canada. (Jonathan Dupaul/CBC)", "description": "A Quebec teen who recently quit vaping reacts to news of the first known case of a serious respiratory illness linked to vaping in Canada.", "authors": [], "top_image": "https://www.cbc.ca/kidsnews//content/_card_resize/Vaping_thumbnail.jpg", "published_at": "2019-09-19"}