{"pub": "vice", "url": "https://vice.com/en_us/article/59nqka/dont-tell-aoc-ilhan-omar-and-rashida-tlaib-their-bernie-endorsement-isnt-feminist", "downloaded_at": "2019-10-19 10:56:46.900705+00:00", "title": "Don't Tell AOC, Ilhan Omar, and Rashida Tlaib Their Bernie Endorsement Isn't Feminist", "language": "en", "text": "The news that Reps. Ilhan Omar, Alexandria Ocasio-Cortez, and Rashida Tlaib will throw their collective political weight behind Sen. Bernie Sanders’ presidential campaign pissed off some white feminists this week.\n\n\n\nBoth Sanders and Sen. Elizabeth Warren had aggressively sought the endorsement of the four influential women of color known collectively as “The Squad” (the fourth, Ayanna Pressley, has yet to officially support a presidential candidate). Some women even saw the decision to support Sanders as a betrayal of the progressive ethos. Among them was Jane Eisner, the director of academic affairs at the Graduate School of Journalism at Columbia University, who jumped to criticize the representatives’ decision in a since-deleted tweet.\n\n“I find it fascinating that women of color overlook female and minority candidates to endorse a white guy,” Eisner wrote.\n\nEven as Sanders and Warren themselves have taken great pains to treat each other cordially in public, some of Warren’s supporters have been especially vocal in their criticism of the democratic socialist’s supporters so far this cycle. Political pundit Emily Tisch Sussman, for example, argued in September that anyone supporting Sanders over Warren was inherently sexist because Warren’s “plans have evolved” and are “more detailed” than Sanders’.\n\nBut it’s safe to assume “The Squad” doesn’t need white feminists to help them understand which candidate best supports their feminist principles. The criticism is especially rich, considering Omar, Ocasio-Cortez, Tlaib, and Pressley have each achieved numerous milestones when they were elected in 2018. Collectively, they represent the first Muslim women in Congress; the first Palestinian-American woman in Congress; the first Somali-American in Congress; the youngest woman in Congress; and the first Black women elected to Congress by Minnesota and Massachusetts.\n\nTo decry their or anyone’s support for Sanders over Warren as anti-feminist is less than helpful to the greater cause of gender equality, and more of an oversimplification of what feminism actually is—or is supposed to be. By removing the agency of these women of color to choose a candidate that best aligns with their political ideology, critics are reducing complex politicians to one-dimensional figures.\n\nThat is not how any of these women see themselves. Omar, in a video explaining her endorsement, said she had decided to endorse Sanders because he “built a movement and continues to build a movement that transcends gender, ethnicity, religion.”\n\nLike Sanders has been for decades, Omar, Ocasio-Cortez and Tlaib all identify as democratic socialists—a fact that places them in stark contrast with Warren, a self-described “capitalist.” All three representatives have been supportive of Warren and many of her policies throughout the campaign trail. Ocasio-Cortez and Warren have worked together as lawmakers to usher the Green New Deal to Congress. Just last week, Tlaib and Warren put out a video together about the impact of environmental racism in Detroit.\n\nBut to act as if Warren is inarguably the evolved form of the Vermont senator is simplistic at best. Sanders’ policy proposals on many issues that affect women could be considered more progressive than Warren’s—specifically when it comes to addressing low-income women of color. While Warren wants to reduce rents for Americans by 10 percent, Sanders supports national rent control. While Warren only recently changed her previously unwaivering pro-Israel views, Sanders has condemned the Israeli occupation of Palestine since the 1980s. And while Warren’s newfound support of Medicare for All has left some questioning her commitment to the issue, Sanders has supported single-payer healthcare for decades.\n\n“It’s good to see [Sanders and Warren] working together to push the national conversation further left,” Moumita Ahmed and Kat Brezler, co-founders of the group Feminists for Bernie Sanders, said in a statement to VICE. “Still, he is anti-capitalist, she is not. We don’t see a future for true feminism without a future that is no longer burdened by capitalism.”\n\nConsidering their politics, the congress members’ decision to support Sanders over Warren shouldn’t surprise anyone. As the people with the most progressive records in Congress, Omar, Ocasio-Cortez, and Tlaib’s endorsement of the candidate with the most progressive policy proposals makes sense, even if that candidate doesn’t mirror their own identities.\n\n“Voting for a woman doesn’t mean voting for policies that support women,” said Ahmed and Brezler. “Conflating the two is a dangerous display of identity politics.”\n\nCorrection: A previous version of this article incorrectly stated that Rep. Ocasio-Cortez campaigned with Elizabeth Warren for other progressive candidates in 2018.\n\nSign up for our newsletter to get the best of VICE delivered to your inbox daily.\n\nFollow Leila Ettachfini on Twitter .", "description": "It’s safe to assume women of color don't need white feminists to explain which candidate best supports their principles.", "authors": [], "top_image": "https://video-images.vice.com/articles/5da9cec428a0ce000a3363bc/lede/1571409833752-GettyImages-1155806835.jpeg?crop=1xw:0.7638xh;0xw,0.1102xh&resize=1200:*", "published_at": "2019-10-18"}