{"pub": "atlantic", "url": "https://theatlantic.com/books/archive/2019/09/sarah-m-brooms-yellow-house-historical-feat/596464", "downloaded_at": "2019-09-25 23:27:49.404364+00:00", "title": "How to Write the Book No One Wants You to Write", "language": "en", "text": "Read: Hurricane Katrina’s uncharted diaspora\n\nA hybrid project, The Yellow House required a lucid and thoughtful structure. “I made no distinction then or now between the house, my family, the street, New Orleans East, New Orleans, America. Those were all the same subject to me,” Broom told me. “And so how I did it structurally, first, I started with a family timeline: ‘In 1914, X happened.’ Then I layered on top of the family timeline the city timeline. Then I layered atop the city timeline, almost like a painting—there’s an actual file where this happens—I layered American history, and then I layered on top of that New Orleans East history. In that way, I could see very clearly the interstices where things met up. And then I could understand the story differently.”\n\nBroom found that the absence of her home and the memories that collected there drove the framework of The Yellow House. “I knew when I started collecting evidence, so to speak, that I was trying to find the architecture of the book,” she said. “I needed to know where the beams were and what was the supporting wall. I literally thought of it as a house because I knew that I was trying to put a lot in it.” Using movement, not unlike sections of a piece of music, Broom found “a structure that felt a little malleable, where within each segment there could be differences in rhythm, and pace, and tone, and overall feeling, so that theoretically you could move the pieces around and still have a story.” The constant motion shares a double meaning with the themes of the book—migration and the threat of gentrification. “The book itself needed to feel and have this sense that this kind of displacement and scattering—inside the city and even now, just with people getting kicked out of neighborhoods and the rent being too high,” Broom said. “The book would contain this feeling that things were moving all over the place and needed to be gathered back together again.”\n\nThe Yellow House’s destruction, first by the flood then by the city’s demolition of what remained, and the subsequent diaspora of her family, left Broom with an aching sense of absence. To confront this, she inserted herself more fully into the fabric of the book. As a teenager, she took two unreliable city buses from New Orleans East to the French Quarter to her job as a barista. As a successful adult, Broom returned to the city’s most historic district, a space that depends on the African American service workers who often cannot afford to live within its boundaries. Once behind the counter, Broom was now the local.\n\nShe sought to upend the conventional wisdom about this tourist-heavy area at the port of New Orleans, once a site of slave trading but now a fantasy that thrives on hedonistic behavior, southern charm, and decadence. “I’m always trying to make it about me in the French Quarter, about the interactions I’m having and how I’m seeing it specifically so I could turn these very trotted-out ideas on their head,” she told me. “If you’re trying to sort of examine the underbelly of something, you have to be able to move with the discovery and be malleable, so to speak.”", "description": "Sarah M. Broom’s The Yellow House is a feat—a memoir and historical narrative created amid governmental bureaucracy and resistance from some of her subjects.", "authors": ["Lauren Leblanc"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/08/Sarah_Broom/facebook.jpg?1569425249", "published_at": "2019-09-25"}