{"pub": "townhall", "url": "https://townhall.com/tipsheet/mattvespa/2019/10/02/wow-fairfax-cop-reportedly-suspended-for-working-with-ice-n2554020", "downloaded_at": "2019-10-02 15:27:18.910888+00:00", "published_at": "2019-10-02", "title": "WOW: Fairfax Cop Reportedly Suspended...For Working With ICE", "language": "en", "text": "We all know sanctuary city/county politics is insane. It’s a new favorite pastime for liberals. They know it irks Trump and Republicans, so they enact policies that have put the public at risk. The reasoning is nonsense. Supposedly, these laws allow illegal aliens to report crimes without fear of deportation. Evidence for that is pretty slim. As of now, it just shields those who have broken federal immigration laws from being deported. It keeps those who shouldn’t be here from being deported because liberals want their voters. That’s the long game. Fill it to the brim with illegals, get them amnesty, and on a pathway to citizenship. It doesn’t matter if they drive intoxicated, rape, or murder. They want their votes.\n\nIn Virginia, it looks like people of this sanctuary mindset, and the anti-Immigration and Customs Enforcement feelings that come with it, landed him a suspension for merely working with immigration authorities (via Fox5DC):\n\n\n\n\n\nA Fairfax County police officer has been suspended after authorities say he violated policy by alerting federal immigration authorities he was detaining a driver who missed his deportation hearing. The officer encountered the man when he responded to a car accident at the corner of Harrison Lane and South King’s Highway. The officer became aware of ICE’s warrant once he checked DMV records and discovered that the driver didn’t have a license. While searching the driving record, he received a notification that the driver was wanted by ICE for a civil, administrative hearing for failing to report to a deportation hearing. When he found out that ICE was looking for the driver, the officer kept him at the scene. Since 2007, Fairfax County Police policy bars officers from alerting the Bureau of Immigration and Customs Enforcement when they encounter someone wanted on administrative immigration violation, provided that the individual is not otherwise being taken into custody. Chief Edwin Roessler issued a statement Tuesday saying one of his officers temporarily detained an individual involved in a Sept. 21 traffic accident and who had no driver's license after learning he was wanted by ICE.\n\n“Our county is one of the most diverse counties in the nation and no one should have the perception that FCPD is acting as a civil immigration agent for ICE,” Roessler said in a statement. “This matter damages our reputation and the longstanding policy that I have stated many times that our officers shall not act as immigration agents.”\n\nAnd yes, these sanctuary city/anti-ICE positions did exist long before Trump was elected in 2016, though the Left has injected steroids into its advocacy. Townhall has reason to believe, via sound sources, that the chief of police has known about this incident for quite some time.", "description": ".10/02/2019 11:24:30AM EST.", "authors": ["Matt Vespa", "Cortney O'Brien", "Guy Benson", "Timothy Meads", "Katie Pavlich"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/261/81328ae7-2dad-48ca-8411-de83052234b2.png"}