{"pub": "cnbc", "url": "https://cnbc.com/2019/09/30/heres-why-the-forever-21-bankruptcy-means-really-bad-news-for-malls.html", "downloaded_at": "2019-10-01 04:28:09.946632+00:00", "title": "Here's why the Forever 21 bankruptcy could be really bad news for US mall owners", "language": "en", "text": "A Forever 21 bankruptcy was not on U.S. mall owners' wish lists ahead of this holiday season.\n\nThe teen apparel retailer on Sunday night announced it was filing for Chapter 11 bankruptcy, planning to close nearly 200 locations in the U.S. Forever 21 has 815 stores globally, and expects to exit most of its locations in Asia and Europe.\n\nForever 21's filing comes amid a wave of announced store closures in the U.S., many of them in shopping malls, which are set to eclipse a record this year. So far in 2019, major retailers announced plans to shutter 8,558 stores in the U.S., while opening 3,446, according to a tracking by Coresight Research. Last year, there were 5,844 closures and 3,258 openings, Coresight said. The firm is anticipating announced closures could top 12,000 this year, marking a new high.\n\nMultiple retail real estate analysts who spoke with CNBC agree, however, that Forever 21 store closures could cause mall owners like Simon Property Group and Macerich more trouble than when other apparel retailers shut down.\n\nThe average Forever 21 store is close to 40,000 square feet but there are some locations that span more than 100,000, which is more like the size of a traditional department store. Larger locations can prove to be much more difficult to fill. Landlords are already dealing with the aftermath of a Sears bankruptcy filing last October, with store closures continuing to drip out, and empty Toys R Us locations, which have been vacant for more than a year.\n\nForever 21 had been aggressive with its real estate expansion, often scooping up locations left vacant by department stores. In 2008, Forever 21 and Kohl's won a bid to take over some of California-based Mervyns' locations, after the department store went bankrupt. Forever 21 ultimately moved into more than a dozen of Mervyns' massive shops, offering it more space to house its party dresses, jeans, graphic tees and crop tops.\n\nThe following year, Forever 21 and Macy's won a deal to take over some of Gottschalk's real estate after the department went bankrupt.\n\n\"There are outcomes that could be very detrimental to the mall REITs,\" Vince Tibone, a lead retail analyst on Green Street Advisors' retail team, said in a recent interview. Because of the size of some of their stores, some Forever 21 closures in malls could trigger co-tenancy clauses, he added, which means surrounding retailers would then have the ability to either break their leases or try to negotiate rents, leading to more of a ripple effect.\n\nAt one point, two of Forever 21's largest landlords, Simon Property Group and Brookfield Property Partners, were trying to come up with a restructuring deal where they would take a stake in the company to keep it afloat. It would've been similar to when Simon and GGP, which is now owned by Brookfield, bought teen apparel retailer Aeropostale out of bankruptcy back in 2016. But talks between Forever 21 and its landlords fell through, according to a person familiar with the talks.\n\nSimon and Brookfield are listed in court papers as two of Forever 21's biggest unsecured creditors. Simon is owed $8.1 million, while Brookfield is owed $5.3 million, and Macerich $2.7 million.\n\nAccording to Simon's latest quarterly report, Forever 21 was its seventh-largest tenant in terms of how much rent it brings in, with 99 stores. Simon said Forever 21 takes up 0.8% of total square feet of its U.S. properties.\n\nMacerich's latest annual report shows Forever 21 as its second-largest tenant in terms of percentage of rent, only behind L Brands, with 30 stores. It lists eight of those as anchor stores.\n\nBrookfield in its latest annual report lists Forever 21 as its fifth-biggest tenant in terms of rent exposure, accounting for 2.2% of minimum rents.\n\nTaubman's latest annual report lists Forever 21 as the No. 1 tenant in terms of square footage, with 17 stores.\n\nRepresentatives from Simon, Brookfield, Macerich, Taubman, CBL, Pennsylvannia REIT, Washington Prime Group and Unibail-Rodamco-Westfield didn't immediately respond to CNBC's request for comment.\n\nForever 21 also operates 15 Riley Rose stores, which sell beauty products, according to court documents. It's unclear if any of those locations will be closing. The company hasn't yet released a master list of store closures.\n\nA spokeswoman said in an email to CNBC, \"Forever 21's restructuring will focus on maximizing the value of our U.S. footprint and shuttering certain international locations ... and we do not expect to exit any major markets in the U.S.\"\n\nMacerich shares were down nearly 2% on Monday morning, while CBL shares fell about 2%, Taubman shares were down more than 2%, Simon shares were falling nearly 1% and Washington Prime shares were unchanged.\n\nMany have blamed the bankruptcy on not only the fact that Forever 21 grew too large but also that consumers began to think that the quality of its clothing deteriorated over time. In its bankruptcy filing, the company acknowledged that supply chain issues led to lower quality over time.\n\n\"I think [Forever 21] is more a victim of people not wanting their clothes to fall apart,\" said Bill Read, executive vice president of leasing, acquisitions and business development at Birmingham, Alabama-based Retail Specialists. \"But I think they can survive if they right-size the ship and keep their better stores.\"\n\n— CNBC's Lauren Hirsch contributed to this report.", "description": "Forever 21 on Sunday night announced it was filing for Chapter 11 bankruptcy, planning to close nearly 200 locations across the U.S.", "authors": ["Lauren Thomas"], "top_image": "https://image.cnbcfm.com/api/v1/image/106156195-1569864137410rtx75cys.jpg?v=1569864203", "published_at": "2019-09-30"}