{"pub": "yahoo", "url": "https://news.yahoo.com/elizabeth-warren-trade-policy-could-alienate-us-trading-partners-202012152.html", "downloaded_at": "2019-10-30 14:39:13.573669+00:00", "title": "Elizabeth Warren's trade policy could alienate US trading partners", "language": "en", "text": "\n\n\n\nDemocratic presidential candidate Sen. Elizabeth Warren, D-Mass., speaks at a campaign event at Dartmouth College, Thursday, Oct. 24, 2019, in Hanover, N.H. (AP Photo/Elise Amendola) More\n\nPresident Trump has proven how influential the White House is in setting trade policy without Congressional approval through his implementation of tariffs on billions of dollars in goods from China and Europe. Similarly, if Massachusetts Sen. Elizabeth Warren were to win the 2020 election, she’d have wide latitude to pursue her agenda.\n\nAt the Democratic debates, Warren – who is among the frontrunners, according to a recent CNN poll – has indicated that she would change trade policy by prioritizing the best interests of American workers. And according to a new note published by Barclays, Warren’s proposals would be a significant shift in U.S. policy.\n\nFirst, Warren views trade policy as a separate issue from national security, and would introduce an eligibility test for trade agreements with foreign countries that focuses on their labor and human rights, anti-bribery and anti-trafficking, religious freedom and track record for fighting tax evasion. Meaning, if a potential U.S. trade partner, like India or Mexico, doesn’t have adequate anti-trafficking safeguards in place or a poor record on labor rights, Warren wouldn’t do business with them. Future trade agreements would be subject to these pre-conditions and current ones would be renegotiated in order to be in compliance.\n\nClimate change would also factor into Warren’s trade policies: her plan would require foreign governments to join the Paris Climate agreement, which the U.S. plans to officially withdraw from on Nov. 4. Included in Warren’s plan is a requirement that countries the U.S. has trade agreements with eliminate all domestic fossil fuel subsidies.\n\nBarclays analyst Shawn Golhar says this condition is unlikely to be met by many countries. Warren’s plans would be counterproductive and “may prove to be too disruptive,” he says.\n\n“If she maintains a firm line with these preconditions… she will likely not be able to strike an agreement with China. In addition she would further tie human rights to trade agreements,” Golhar writes in his report.\n\nThey run the risk of making a Warren administration have to “withdraw from every trade agreement where the partner country has some level of subsidies for the fossil fuel industry,” Golhar says.\n\nWarren has said she would not repeal Trump’s tariffs on the first day of her administration. However, by prioritizing labor and human rights while prohibiting all subsidies to fossil fuels in trade policies with China, she may have an even tougher time than Trump in reaching a trade deal.\n\nMore from Sibile:\n\nCertain American men are dying ‘deaths of despair’\n\nElizabeth Warren scares Wall street for good reason\n\nBankrate: Nearly half of US isn’t prepareds for a recession as economic clouds gather\n\nEric Trump: China is one of the reasons Donald Trump ran for president\n\nJobs report: Here’s why you’re not earning more despite record low unemployment", "description": "Here’s why Elizabeth Warren risks alienating US trading partners if she doesn’t soften stance.", "authors": ["Sibile Marcellus"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Y_6YdpMuCNbnp0lEfvmvnA--~B/aD0yNzgxO3c9NDE3MTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/92637eb0-fa81-11e9-bfd7-157f83458762", "published_at": "2019-10-29"}