{"pub": "washingtonpost", "title": "‘Why don’t we get the field?’: Use of playing field pits an elite private school against D.C. public schools", "url": "https://washingtonpost.com/local/social-issues/why-dont-we-get-the-field-use-of-playing-field-pits-an-elite-private-school-against-dc-public-schools/2019/08/31/5081b5de-ca5c-11e9-a1fe-ca46e8d573c0_story.html", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:09:21.518383+00:00", "text": "An elite private school has been granted special access to a public playing field in Northwest Washington in exchange for funding upgrades to the site. But the deal with D.C. officials has some residents and politicians calling foul on a move they say shortchanges public school students.\n\nThe deal between the Maret School and the D.C. Department of Parks and Recreation allows Maret exclusive use of the field at the Jelleff Recreation Center during the hours of highest demand, 3:30 p.m. to 5:30 p.m., on weekdays for the next decade, according to Marjo Talbott, Maret’s head of school. In exchange, the school is spending about $950,000 to improve the turf field, add a fence and renovate the recreation center building, Talbott said.\n\nIn response, a coalition of public school parents, elected officials and area residents is petitioning Mayor Muriel E. Bowser (D) to reverse the deal.\n\nThe online petition, which had garnered more than 1,000 signatures as of Sunday afternoon, asks Bowser and the Department of Parks and Recreation to “share the prime hours more equitably with the many public school students desperate to find a place to play too.”\n\n[‘NO EXCESSIVE BARKING’: A Chevy Chase dog park divides the rich and powerful]\n\nIt is “harmful [and] irresponsible . . . to give — for the next decade — all the after-school hours at a public playing field to just one private school although several public schools nearby lack adequate field space,” reads the petition, launched last week.\n\nOn Sunday, D.C. Council member Elissa Silverman (I-At Large) sent out a news release with the letter she sent to the Department of Parks and Recreation and the D.C. Department of General Services calling for the contract to be revisited. Silverman asked for additional information about the process that led to the agreement with Maret. She concluded the letter with a request for answers by Sept. 15, when the council is scheduled to return from its recess.\n\nSilverman said she would work with fellow council member Trayon White Sr. (D-Ward 8), who is chair of the Committee on Recreation and Youth Affairs, to look at how the decision was made.\n\nJelleff is a public rec center. DC government owns it, and DC residents should have priority. I disagree with @DCDPR & @DCDGS to give a private school priority over public fields. I’ll be asking our agencies to reverse this, and working w the @councilofdc rec chair @trayonwhite https://t.co/XA2ZGAaisQ — Elissa Silverman (@tweetelissa) August 30, 2019\n\nThe Jelleff field is across from the public Hardy Middle School, which enrolled about 400 students in sixth through eighth grades in the 2017-2018 academic year, according to D.C. Public Schools.\n\nMaret, a K-12 institution, typically enrolls 650 students and charges about $35,000 per pupil per year.\n\nBowser did not respond to a request for comment last week.\n\nDelano Hunter, director of the Parks and Recreation Department, said in a statement that the department is “proud to move forward investments that minimize costs” to D.C. taxpayers.\n\n“We will continue working with the community to ensure all residents enjoy these renovations for years to come,” Hunter said.\n\nTalbott said Maret is performing a public service by repairing the field, and she noted that its reserved time in the afternoons totals just 10 percent of daylight hours.\n\nMaret already shares with Hardy, she said: It allows the middle school to use Jelleff from 4 p.m. to 5:30 p.m. almost every Wednesday throughout the fall.\n\n“All of our city schools are strapped with limited space, and we work to share as much as possible our use of Jelleff,” Talbott said.\n\n“I would emphasize that the facilities wouldn’t even be there if it hadn’t been for Maret investing originally,” she added, referencing a deal forged about a decade ago between Maret and the Department of Parks and Recreation. That agreement granted Maret prime-time access to Jelleff for 10 years after the school promised to pay about $2.4 million to turf over the field — which was then in poor condition — install outdoor lights, remodel the adjacent outdoor pool and improve Jelleff’s recreation center.\n\n[An elite D.C. girls’ school thought its founding nuns taught slaves to read. Instead, they sold them off for as much as they could.]\n\nThe deal signed this summer extends the older agreement, which is set to expire in 2020, according to Talbott. It is a continuation Maret has long been planning for and expecting, she said.\n\nAware of the expiration date, opponents began contacting department officials in January, according to neighborhood commissioner Kishan Putta, one of the petition’s authors and a D.C. Council candidate for Ward 2.\n\nThe eight commissioners for the area sent a letter to the department in March requesting that the agency be \"highly transparent\" as it decided whether to continue the deal with Maret and that it consider the needs of all community members — including the Jelleff Boys and Girls Club, which hosts a free after-school program at the site from about 3 p.m. to 8 p.m. weekdays.\n\nStudents enrolled in that program, which serves about 100 children every day from all of the District’s eight wards, have long been frustrated by their lack of access to a field, according to Bob Stowers, the longtime director of the club.\n\nThe Department of Parks and Recreation met multiple times with Putta and neighborhood commissioner Elizabeth Miller throughout the year, Putta said.\n\nHe said that at the commissioners’ urging, the agency hosted a public hearing about the field in May and that the overwhelming majority of attendees spoke out against the Maret deal.\n\nTalbott gave a different account of the meeting, saying she saw substantial support for the private school’s plan and widespread appreciation of its willingness to pay to update Jelleff.\n\nPutta and Miller learned that the contract with Maret would be extended during a private meeting last month with Department of Parks and Recreation officials, Putta said.\n\nPutta and other critics contend that the way the department reached its agreement with Maret was not transparent, an allegation Talbott disputed.\n\nMaret submitted a request to extend the deal at the beginning of July, she said, and the Department of Parks and Recreation replied within 30 days, as required.\n\n“We’ve been totally above board on this,” she said.\n\n[Students at elite Sidwell Friends projected swastikas during assembly]\n\nMartin Welles, the vice president of the Parent Teacher Organization at Hardy Middle School, said many parents there are angry about the situation. Welles said his three children, all of whom play sports, must travel hours across the city, often in traffic, to reach fields for their practices and competitions.\n\nBecause they must leave school early to arrive on time to their athletic commitments, his children collectively missed about 60 full classes last academic year, Welles said.\n\nAll when they could be using “the spot literally right across the street,” he added.\n\nStowers, meanwhile, said he has run out of answers for children who participate in the Boys and Girls Club after-school program, the vast majority of whom are public school students.\n\n“We line them up, take them outside on the concrete that abuts the field, and they’re up against the fence watching the private school kids,” Stowers said. “They notice it, and they ask: ‘Why? Why don’t we get the field?’ ”", "description": "The Department of Parks and Recreation has given the Maret School exclusive use of a public field during peak times, angering some public school parents.", "authors": ["Hannah Natanson", "Reporter Covering Social Issues In The D.C. Metro Area", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/JIZ7T2cHNSYZgn3Bu-wOxu-I_fA=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ESTJKVGLPMI6TFQVR4NDFFROAQ.jpg"}