{"pub": "nymag", "url": "https://vulture.com/2019/10/movie-review-frankie-starring-isabelle-huppert.html", "downloaded_at": "2019-10-24 23:54:34.822805+00:00", "title": "Isabelle Huppert Arranges a Morbid Family Vacation in Frankie", "language": "en", "text": "Isabelle Huppert in Frankie. Photo: Sony Pictures Classics\n\nFrançoise Crémont — Frankie to her friends, and you’d know if you were one of them — is a famous actress, and she’s dying. For a sense of how she’s handling this development, all you really need to know is that she is played by the gloriously unsentimental Isabelle Huppert. There’s a scene, halfway through, in which Frankie figures out that her husband, Jimmy (Brendan Gleeson), has conspired with her ex-husband, Michel (Pascal Greggory), to casually bring her by a local spring that happens to be famed for its healing water. She’s not moved by the gesture — she’s furious. “Can’t you pretend that you accept my fate?” she snaps, impatient with their excuses about how it couldn’t do any harm to try. Frankie may have made peace with her own impending mortality, but it hasn’t necessarily left her inclined to indulge the grief of her loved ones.\n\nFrankie, which director Ira Sachs wrote with Mauricio Zacharias, takes place over the course of the family vacation that Frankie has arranged for/inflicted on those loved ones. She’s chosen the Portuguese seaside town of Sintra, a lavishly beautiful setting for a gathering that everyone’s trying to pretend isn’t overshadowed by death. Luckily for them, the multinational bunch has packed plenty of personal turmoil with which to distract themselves. Frankie’s British stepdaughter Sylvia (Vinette Robinson) has been contemplating a separation from her husband, Ian (Ariyon Bakare), leaving their teenage daughter, Maya (Sennia Nanua), caught uncomfortably in between. Frankie’s French son Paul (Jérémie Renier), forever unhappy in love, is on the verge of a move to New York, where, she worries, he’ll be isolated and cut off. She invited her friend Irene (Marisa Tomei), an American makeup artist, with an eye toward setting the two up, and is only mildly discouraged by the fact that Irene arrives with a boyfriend, Gary (Greg Kinnear), in tow.\n\nThey’re a messy group, and Frankie is a messy movie that spreads itself too thin over this sprawling cast of characters. Sachs is a master of small domestic scenes that accumulate almost imperceptibly into something momentous, from his 2012 document of loving a drug addict Keep the Lights On to the escalating gentrification tensions of 2016’s Little Men. His greatest movie, 2014’s Love Is Strange, is a tragedy about a long-term couple (played by John Lithgow and Alfred Molina) losing their home, but it’s one that unfolds in such deceptively light installments that it takes the main characters themselves a while to acknowledge the horror of what’s actually happening to them. Sachs is less interested in dramatic confrontations than in the encounters that might lead up to or follow them — and in Frankie, those impulses are followed to an end point, in which there’s no sense of build at all, and in which the various story lines don’t resolve themselves so much as they dissolve in the sunlight. It’s an obstinate sort of anti-drama.\n\nThat said, Frankie, for all of its refusal to give into any kind of traditional narrative satisfaction, is rife with terrific little moments. Different combinations of characters come together to offer different angles on the complicated family history on display, casting new light on behavior we’ve already witnessed. I’m particularly partial to the scene in which Paul, exasperated by all of his mother’s well-intentioned attempts to provide for him in anticipation of her death, deliberately torpedoes his first meeting with Irene by telling an illuminating, spectacularly inappropriate anecdote. By that point, we already know that the two are unlikely to hit it off because another of the film’s highlights is an exquisitely awkward exchange between Irene and Gary that shows them to be on different pages on the issue of settling down. Gary, poor guy, isn’t great at reading the room — later, he’ll get caught in the rain with Frankie, who slices and dices him in conversation in ways he doesn’t even seem to notice.\n\nTomei is wonderful in Frankie, her earthy warmth existing in perfect harmony with Huppert’s wry aloofness — but the movie keeps wandering away from the friends in favor of some frustrating digressions. There’s the Portuguese tour guide who talks about his wife’s jealousy when he goes away for months for work, and there’s the day that Maya spends at the beach in the company of a local boy, one that ends abruptly and ambiguously. The latter might tie into the lost paradise that the movie sometimes references — the beach is supposedly named after the apple that tempted Eve, and it’s also the place where Paul’s relationship with his family ruptured, years ago. But if so, the connection feels subterranean to the point of being unreachable. Frankie is so determined to steer away from any obvious beats about mourning or regret that it ends up evading any reading at all. Its final close-up of Huppert finds her giving an enigmatic half-smile, and then the camera pulls back to show us the family standing along a cliffside, as though regretful about even giving us a chance to guess what’s on her mind.", "description": "Isabelle Huppert plays a dying matriarch in Ira Sachs’s ensemble drama “Frankie,” which also stars Marisa Tomei, Brendan Gleeson, Greg Kinnear, Jérémie Renier, and the gorgeous Portuguese seaside town of Sintra.", "authors": ["Alison Willmore"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/23/23-frankie.w1200.h630.jpg", "published_at": "2019-10-24"}