{"pub": "investing.com", "url": "https://investing.com/news/stock-market-news/day-ahead-top-3-things-to-watch-1970508", "downloaded_at": "2019-09-05 00:39:43.698182+00:00", "published_at": "2019-09-04", "title": "Day Ahead: Top 3 Things to Watch", "language": "en", "text": "© Reuters.\n\nInvesting.com – Here’s a preview of the top 3 things that could rock markets tomorrow.\n\n1. U.S. Data Deluge: Jobs, Services in Focus\n\nThe economic data calendar for Thursday is packed with top-tier economic data, including updates on the labor market, factory orders and services activity.\n\nAhead of Friday’s nonfarm payrolls due Friday, traders will look for a readthrough on the labor market with the release of ADP’s measure of private sector employment for August.\n\nThe report comes at 8:15 AM ET (12:15 GMT).\n\nEconomists, on average, expect that rose by 148,000 last month, down from a gain of 156,000 in July.\n\nThe Labor Department, at 8:30 AM ET, releases its weekly report on jobless claims -- people who filed for unemployment insurance. Economists forecast that remained unchanged at 215,000 from the previous week.\n\nAn ISM survey on service sector activity is due at 10 AM ET.\n\nEconomists expect data for August to show an uptick to a reading of 54, above July’s reading of 53.7.\n\nAnd July factory orders are expected to have risen 1%, stronger than the 0.6% rise posted in June.\n\n2. Crude Inventories in Spotlight as Oil Rallies\n\nThe releases its petroleum report on Thursday, with oil prices latching onto the rally in risk assets and buoyed by expectations for another drawdown in oil stockpiles.\n\nAhead of the EIA report, the American Petroleum Institute released data, which often serves as an early indication of weekly petroleum levels, showing crude stockpiles rose by 0.4 million barrels last week.\n\nThe EIA is expected to report a drawdown in crude stockpiles of 2.49 million barrels.\n\nrallied 4.3% to settle at $56.20 a barrel.\n\n3 . Lululemon Earnings Due\n\nLululemon Athletica (NASDAQ: ) reports results after Thursday's closing bell.\n\nThe sportswear retailer earnings of 89 cents per share on revenue of about $845 million.\n\nAs well as earnings, margins will likely come under scrutiny as the company has ramped up markdowns, particularly in menswear, despite plans to more than double its men’s business in the next five years.\n\n“We see a beat in the cards for Lulu driven by strength in top line, but remain nuetral, given less visibility into the promotional cadence and particularly in men’s business, coupled with premium valuation,” Wedbush said in a note.\n\nIn its first-quarter earnings report, Lululemon raised its guidance for the full financial year to between $3.73 billion and $3.77 billion in revenue and between $4.51 to $4.58 in earnings per share.\n\nShares rose 0.65% on Wednesday and are up 48.6% this year. The stock is one of the top 15 performers in 2019", "description": "Day Ahead: Top 3 Things to Watch", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEE070NK_L.jpg"}