{"pub": "metro", "url": "https://metro.co.uk/2019/10/07/chelsea-star-fikayo-tomori-remembers-broke-diego-costas-nose-training-10879289", "downloaded_at": "2019-10-07 23:32:02.896499+00:00", "title": "Chelsea star Fikayo Tomori remembers how he broke Diego Costa’s nose in training", "language": "en", "text": "Tomori once broke Costa’s nose in training (Picture: Getty)\n\nFikayo Tomori may be enjoying a break-out season for Chelsea, but the 21-year-old once risked the wrath of Diego Costa when he broke the striker’s nose in training.\n\nThe centre-back was only 18 when he clashed with Chelsea’s former talisman, a notorious hothead, during a session at Cobham.\n\nTomori faced a wave of messages and taunts from his team-mates after the incident and was relieved Costa decided against taking revenge.\n\nHe said: ‘I was still in school and I didn’t know I had done it in training. It was an accident.\n\nCosta was forced to wear a face mask after the clash of heads (Picture: Getty)\n\n‘We both went up for a header, I had to flick the ball backwards and he tried to score.\n\n‘He headed the back of my head and broke his nose.\n\n‘I didn’t know I had done it until the next day when it was all over the papers.\n\nAdvertisement\n\nAdvertisement\n\n‘I was getting a lot of messages like I meant to do it, but it was alright.\n\n‘He didn’t kick me in training after that. I got a little bit of stick. It was light hearted, a lot of banter.\n\nTomori was called up to the England squad last week (Picture: Getty)\n\n‘I got back to school and people were asking about it. My mates had all seen it.’\n\nTomori is in line to make his debut for England after accepting a call-up from Gareth Southgate.\n\nThe defender was also eligible to play for Canada and spoke to his family before making the decision to link up with England.", "description": "Fikayo Tomori may be enjoying a break-out season for Chelsea, but the 21-year-old once risked the wrath of Diego Costa when he broke the striker's nose in training. The centre-back...", "authors": ["Coral Barry"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1159486418_1570487552.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-07"}