{"pub": "thehill", "url": "https://thehill.com/hilltv/rising/466295-poll-voters-almost-evenly-divided-on-trumps-syria-withdrawal", "downloaded_at": "2019-10-18 01:06:22.234403+00:00", "title": "Poll: Voters almost evenly divided on Trump's Syria withdrawal", "language": "en", "text": "Voters are almost evenly split on President Trump Donald John TrumpGOP congressman slams Trump over report that U.S. bombed former anti-ISIS coalition headquarters US to restore 'targeted assistance' to Central American countries after migration deal Trump says lawmakers should censure Schiff MORE’s withdrawal of U.S. troops from northern Syria, according to a Hill-HarrisX poll released on Thursday.\n\nThe survey showed that 33 percent of registered voters support the withdrawal, while 37 percent oppose it. Another 30 percent said that they were unsure about the move.\n\nWhen broken down by party, more than half — 51 percent — of Republicans back Trump’s decision, compared to just 21 percent of Democrats and 27 percent of independents.\n\nThe opposite was true among Democrats, with 53 percent opposing the move. Thirty-eight percent of independents and 19 percent of Republicans were also against the withdrawal.\n\nThe survey comes as Trump faces pushback from both Democrats and Republicans alike over his decision to withdrawal U.S. troops from Syria earlier this month.\n\nLawmakers have said the pullback represents a betrayal of the Kurds, who are considered a key U.S. ally in the fight against ISIS.\n\nSenate Majority Leader Mitch McConnell Addison (Mitch) Mitchell McConnellPatient advocates launch drug pricing ad campaign Overnight Defense — Presented by Boeing — House passes resolution rebuking Trump over Syria | Sparks fly at White House meeting on Syria | Dems say Trump called Pelosi a 'third-rate politician' | Trump, Graham trade jabs War of words at the White House MORE. (R-Ky.) said Thursday that he was “encouraged” by a House resolution formally opposing Trump’s withdrawal, but he warned that it wasn’t enough.\n\n\"I believe it's important that we make a strong forward-looking strategic statement. For that reason my preference would be for something even stronger than the resolution that the House passed yesterday, which has some serious weaknesses,\" McConnell said from the Senate floor.\n\nBut Trump has repeatedly defended his decision, saying the U.S. cannot keep fighting “endless wars.”\n\nThe lack of U.S. military presence, meanwhile, has paved the way for a Turkish invasion into Syria, making Kurdish forces and civilians vulnerable. Ankara has long sought to launch an offensive against the Kurds, who it considers a domestic terrorist group.\n\nThe Hill-HarrisX poll was conducted among 1,001 registered voters. The margin of error for the full sampling is plus or minus 3.1 percentage points.\n\n—Tess Bonn", "description": "Voters are almost evenly split on President Trump’s withdrawal of U.S. troops from northern Syria, according to a Hill-HarrisX poll released on Thursday.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_10162019_1.jpg", "published_at": "2019-10-17"}