{"pub": "fox", "url": "https://foxbusiness.com/media/warnermedia-the-big-bang-theory-hbo-max-streaming-deal", "downloaded_at": "2019-09-18 05:10:11.094651+00:00", "title": "‘Big Bang Theory’ ups the ante in TV's red hot streaming wars", "language": "en", "text": "WarnerMedia has closed a massive deal to exclusively stream the smash CBS sitcom, “The Big Bang Theory,” on the planned new HBO Max streaming service. It is the the latest salvo in the streaming arms race which has seen billions spent in a matter of hours.\n\nContinue Reading Below\n\n“The streaming wars are relentless, and this is just another example of that,” Peter Csathy founder and chairmen of CREATV Media told FOX Business. “You have all the behemoths going after one another to get the biggest title they can to serve their marketing so that we subscribe to them instead of all the other relentless competition.”\n\nOn Monday, Netflix scooped up the rights to the classic comedy \"Seinfeld\" for a price reportedly north of $500 million. Less than 24 hours later, Warner swooped in on \"Big Bang\" for a reported $1 billion. Both of these come on the heels of:\n\nNBCUniversal, paying $500 million for exclusive domestic streaming rights to \"The Office\" for its new service, Peacock -- NBC unveiling that name today.\n\nPeacock also revealed it has picked up the rights to another hit comedy, \"Parks and Recreation\" for an undisclosed sum.\n\nHBO Max striking again paying out $425 million over five years ($85 million per year) to move mega-hit Friends from Netflix and onto its fledgling service\n\nThe high-flying numbers -- especially the billion-plus on \"Big Bang\" -- could prove problematic longtime streaming analyst Dan Rayburn told FOX Business. “It potentially could be a bad thing for Warner to overspend on something like 'Big Bang,' \" said Rayburn, “We haven’t seen any data, none of the platforms have shared any research that says, if we just get this one series, or one show like the ‘Big Bang’ or ‘Seinfeld,’ that all of a sudden we will get more subscribers,” says Rayburn.\n\nAmazon, Netflix and other streaming services have been notoriously secretive about releasing viewership information.\n\nAdvertisement\n\nLanding a big show may not breed the brand loyalty \"over-the-top\" services (OTT) are seeking. There has yet to be any data released that shows any notable viewing habits.\n\n“Consumers are going to turn between services, and binge-watch shows over here for three months then switch to another service and go there for two months,\" sayid Rayburn, \"we are definitely going to see a lot of that next year.\"\n\nWhile there may be no absolute proof that these classic comedies are worth the prices they are commanding, \"Big Bang Theory\" has a pedigree that intimates it might be worth the investment. Starring Jim Parsons, Kaley Cuoco, Mayim Bialik and Johnny Galecki, “The Big Bang Theory” ran for 12 seasons, and 279 episodes which will make for some binge-worthy watching for new fans subscribing to HBO Max set to debut in the spring of 2020. It was nominated for 46 primetime Emmy awards and when it became available to cable and local TV stations for syndication in 2010, it sold for a reported $2 million an episode.\n\nEveryone from networks to studios to streamers likely understands that these mind-boggling price tags are part of the brave new world of media. “There is no question that the cost to license and produce content will continue to go up,” said Rayburn.\n\nAdded media veteran Csathy, \"It is a total arms race that has been going on for some time already and now that Disney, HBO Max and WarnerMedia are entering, it is a whole new world.”\n\nSeveral of these deals have impacted longtime streaming leader Netflix, but Rayburn believes it has been a blessing in disguise.\n\n“That is why you see Netflix and others saying, hey, we are going to reduce the amount of content we have overall in our catalog but we are going to produce content ourselves that we think will be higher quality, to keep you from turning off,\" said Rayburn, \"Part of the reason they are doing that is because it is cheaper than having to license someone’s back catalog,”\n\nComcast's new NBCUniversal based offering, Peacock, is looking to take classic library product and stream it with \"reboots\" of some of those titles. Tuesday the service announced it will offer \"new\" episodes of “Battlestar Galactica,” and classic episodes of “Saved By the Bell,” featuring original cast members including Elizabeth Berkley and Mario Lopez, and “Punky Brewster” starring Soleil Moon. There is no bidding for any of these series as they are already owned by Universal Studios and NBC.\n\nDisney+, which is launching this fall, is also dipping into the Marvel and \"Star Wars\" catalogs tapping characters and stories for new series that are known, but outside of the feature films have a limited library.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nRayburn states that it was the push towards originals that changed the streaming game -- not the licensed sitcoms. “Netflix realized that they had to do original content to differentiate and if one season of ‘House of Cards’ cost $50 million dollars to produce, we will get a lot more bang for our buck than licensing content that people aren’t going to watch or isn’t as popular with a larger amount of viewers,” said Rayburn.\n\n“One series like ‘Friends’ or ‘The Big Bang Theory’ will not make or break any streaming service. People were freaking out when Netflix was to lose 'Friends,' but I don’t know anyone that canceled Netflix because they can’t watch Friends,” said Rayburn.", "description": "WarnerMedia deal for The Big Bang Theory is latest move in streaming wars arms race.", "authors": ["Mike Cherico"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/07/0/0/HBO-max.jpg?ve=1&tl=1", "published_at": "2019-09-17"}