{"pub": "nymag", "url": "https://nymag.com/article/2019/09/toronto-canada-travel-guide-things-to-do-where-to-stay.html", "downloaded_at": "2019-09-04 23:40:23.341747+00:00", "title": "The Urbanist’s Guide to Toronto", "language": "en", "published_at": "2019-09-04", "text": "The Urbanist Insider travel recommendations from local experts. A night at Seoul Shakers. Photo: Michael Graydon & Nikole Herriott/Michael Graydon\n\nLong considered the center of Canada’s self-contained universe, Toronto has seen considerable growth, culturally and commercially, over the past decade. Or, to quote hometown hero Drake, “Shit is hot up in the 6 right now.” And not just because of the Raptors’ recent NBA championship or the Museum of Contemporary Art’s multimillion-dollar makeover. Researchers at Ryerson University declared Toronto the continent’s fastest-growing city earlier this summer, with new-arrival numbers (around 77,000 people last year) far outpacing those of Phoenix, San Antonio, Fort Worth, and Seattle. But much like North America’s other top-ten cities in terms of population totals and pressing redevelopment plans (Houston, L.A., New York), Ontario’s capital is often caught between its steadfast ambition and looming concerns over affordability and sustainability. That doesn’t seem to be deterring residents from riding out the rising costs and extortionate real estate. Torontonians are very passionate about being Torontonians. A lot of that has to do with the city’s diversity; as of the last census, more than half of its 2.73 million people identified as “visible minorities,” and 46.1 percent fell under “foreign born.” Couple that with the sheer density and scale of Toronto’s 140 official neighborhoods and you’re left with a detailed snapshot of Canada itself. The fall, when the air is crisp and comforting (and before things get dreary), is the ideal time to explore its extremely accessible green spaces, eclectic food scene, and back-alley clothing boutiques.\n\n1. Art Four Ways\n\nAccording to Rachel Hilton, the managing director of MoCA, which unveiled its long-awaited new location in Toronto’s Junction Triangle last year.\n\nAvoid Crowds in a Former Tank House\n\nCorkin Gallery\n\n“The Distillery District, just southeast of downtown, is a bit of a tourist destination, but I love this big space (7 Tank House Ln.) — a 10,000-square-foot former tank house — because it’s a refuge from the hordes, and its nooks and crannies are a great backdrop for large-scale work like last spring’s Leopold Plotek exhibit.”\n\nVisit a Museum Inside a Museum\n\nThe Henry Moore Sculpture Centre at the Art Gallery of Ontario\n\n“It’s the only permanent gallery I always visit when I’m at the AGO (317 Dundas St. W), and it’s one of the largest public collections of Moore’s work. It’s usually very quiet and serene here and feels like I have a private audience with all the pieces.”\n\nSee the World’s Only Airport-Installed Richard Serra\n\nTilted Spheres at Toronto Pearson Airport\n\n“When I’m flying, I make a point of walking through this immense work, a tunnel-like structure of four curved metal pieces standing sentinel amidst two duty-free shops. I’m really happy to see the Greater Toronto Airports Authority invest in this great Serra piece, whether travelers appreciate it as art or not.”\n\nHang Out in a Giant Canoe Above the Highway\n\nTom Thomson’s Canoe\n\n“Public art doesn’t get more Canadian than a big canoe — big enough for you to stand in. It’s down by the waterfront, near the CN Tower, overlooking the expressway traffic. Douglas Coupland (one of the curators of our forthcoming ‘Age of You’ exhibition) created it as a tribute to the great landscape painter and Group of Seven member Tom Thomson.”\n\n2. Classic Pho and Cacio e Pepe With Wontons\n\nTraditional and newfangled takes on the city’s world-class Asian cuisine, recommended by chefs and restaurateurs.\n\nSushi Kaji (left) and Vit Béo. Photo: SUSHI_KAJI/INSTAGRAM; JAMESHUNG15/INSTAGRAM. Sushi Kaji (left) and Vit Béo. Photo: SUSHI_KAJI/INSTAGRAM; JAMESHUNG15/INSTAGRAM.\n\nKorean\n\nOld School: Korean Village Restaurant, 628 Bloor St. W\n\n“It’s over-the-top: palm trees and Polaroids of famous people. And the owners treat you like royalty. I get the spicy kimchee, pork belly, and fried chicken.” —Grant van Gameren, executive chef of Bar Isabel and Piquette\n\nNew School: Seoul Shakers, 1241 Bloor St. W\n\n“I appreciate chef Leemo Han’s design sense; all of his spots feel like they have been there forever — like a secret gem only the people there know about. Get the Korean tacos.”\n\nJapanese\n\nOld School: Sushi Kaji, 860 the Queensway\n\n“Most of the ingredients are imported from Japan, and nothing is à la carte; there are three different tiers of tasting menus instead. The quality never wavers.” —Jen Agg, writer and restaurateur\n\nNew School: Sakai Bar, 1576 Dundas St. W\n\n“Chef Eric McDonald is cooking at such a high level, especially considering how young he is — he just turned 23. I dream about their seasonal vegetables with umeboshi beurre blanc.”\n\nChinese\n\nOld School: Kenny’s Noodle Restaurant, 4733 Steeles Ave. E\n\n“I go here for baked rice with Portugese-style chicken, a Hong Kong café dish that was fusionized in Macau and Canada. Add cheese on top and it’s a weird colonial British casserole.” —Craig Wong, executive chef and co-owner of Patois\n\nNew School: Alma, 1194 Bloor St. W\n\n“Chef Anna Chen has worked at Italian restaurants, so she mixes that training with Chinese food. She makes a pasta with pork wontons and soy sauce, kind of like a take on cacio e pepe.”\n\nVietnamese\n\nOld School: Pho Linh, 1156 College St.\n\n“The best classic pho in town. It’s also one of the only places that has bánh cuon (rice-flour rolls stuffed with pork) and bánh bèo (mini-pancakes topped with dried shrimp).” —Len Senater, owner of the Depanneur\n\nNew School: Vit Béo, 858 Bloor St. W\n\n“There are a lot of bánh mì places, but here they serve scratch-made sandwiches with a serious flavor profile; it’s like the difference between grabbing a fast-food burger and sitting down for a real-deal homemade burger.”\n\n3. The One Sandwich to Eat\n\nAccording to Anthony Rose, executive chef and co-founder of Wilder and Rose restaurant group.\n\n“Peameal-bacon sandwiches are the only thing served at Carousel Bakery (St. Lawrence Market, 93 Front St. E). Oh man, I love this shit — griddled and cured pork loin with cornmeal as the crust. The counterperson will say, ‘Whatcha want?’; you say, ‘One sandwich, double meat.’ That’s it. Now dress said sandwich with pickled hot peppers, mayonnaise, and some yellow mustard. And just a few steps away are some awesome butter tarts and ridiculously good Nanaimo bars at Eve’s Temptations.”\n\n4. Want to Get a Torontonian Talking?\n\nBroach one of these pressing issues.\n\nBig Tech’s Takeover\n\nCanada has courted highly skilled workers with fast-tracked visas since 2017, making it much easier for Silicon Valley staples like Uber, Amazon, and Google to set up shop in Toronto. According to a report by CBRE Group, Inc., the city’s tech sector is now ranked right behind San Francisco’s and Seattle’s. While some are praising Toronto’s position as a prime destination for engineers, others worry about its impact on homegrown businesses and housing costs.\n\nGun Violence\n\nToronto is on track to set a record for its highest number of shootings in a single year since 2004. A spike over the summer resulted in $4.5 million of government funding, an expanded task force on guns and gangs, and a growing debate over gun control. Prime Minister Justin Trudeau and Mayor John Tory met about the issue last month but avoided backing a widespread handgun ban, which could become a point of contention in October’s federal election.\n\nThe Opioid Crisis\n\nA rise in opioid-related overdoses has generated heated discussions over prevention strategies and action plans throughout Ontario. It has also earned Premier Doug Ford (the brother of former mayor Rob Ford) some harsh criticism over his decision to close several of Toronto’s safe-injection sites.\n\n5. Where Locals Would Stay\n\nIf they weren’t locals.\n\nGladstone Hotel (left) and The Broadview Hotel. Photo: THE AURA ROOM DESIGNED BY SARAH KEENLYSIDE; STUART MCLEOD. Gladstone Hotel (left) and The Broadview Hotel. Photo: THE AURA ROOM DESIGNED BY SARAH KEENLYSIDE; STUART MCLEOD.\n\n$\n\nGladstone Hotel\n\n1214 Queen St. W, from $189\n\n“Each room is unique and designed by a Toronto artist. (There’s the Blue Line Room and Surreal Gourmet Room.) The gallery space upstairs is always showcasing interesting contemporary work, and the bar hosts regular karaoke nights. It also has the coolest vintage elevator in Toronto.” —Evalyn Parry, artistic director of Buddies in Bad Times Theatre\n\n$$\n\nThe Broadview Hotel\n\n106 Broadview Ave., from $254\n\n“The rooms are comfortable in a familiar way: Natural organic toiletries from Graydon Skincare are a nice touch, and each room has vinyl collections from Tiny Record Shop. The rooftop bar has incredible views of the city and surprisingly comfortable barstools. The bar menu is perfect for sharing — the miso black cod is a standout.” —Sarra Tang, head designer and owner of Hoi Bo\n\n$$$\n\nThe Ritz-Carlton\n\n181 Wellington St. W, from $565\n\n“Even if you’ve stayed at other Ritz-Carltons, this one really gives you the feel of Canada: There are inlays of maple leafs in the lobby area, and the bar and restaurant menus have both leaned into local produce, meats, and seafood.” —Cameron Bailey, artistic director and co-head of the Toronto International Film Festival\n\n6. A Bloordale Crawl\n\nStephen Fowler, owner of used bookstore the Monkey’s Paw, offers a tour through his neighborhood’s main drag, where Toronto’s past, present, and future coexist.\n\n1. Vena’s Restaurant, 1263 Bloor St. W\n\n“Hole-in-the-wall source for West Indian curry and roti. Proclaims itself the ‘Best Roti in Town’ and may well be. I’m a very loyal customer.”\n\n2. Ransack the Universe, 1207 Bloor St. W\n\n“A somewhat mad but completely diverting vintage shop packed with housewares, objects, and oddities.”\n\n3. Wenona Craft Beer Lodge, 1269 Bloor St. W\n\n“A pub with a rustic Canadiana theme and a formidable rotating list of Ontario microbrews on tap. Gets pretty raucous on trivia night.”\n\n4. COO Café Bread or Rice, 1049 Bloor St. W\n\n“This is a curious but very sweet mom-and-pop sit-down place serving modest Japanese-inspired comfort food. Almost impossible to describe, so I send everyone there to find out for themselves.”\n\n5. Wise Bar, 1007 Bloor St. W\n\n“A small, urbane bar with a nice patio out back. My current favorite for meeting up with friends.”\n\n6. Kink Toronto, 975 Bloor St. W\n\n“Discreet and approachable sex toys and fetish gear, much of it handmade by local artisans.”\n\n7. Siberia Vintage, 955 Bloor St. W\n\n“Definitely the coolest of several vintage-clothing shops on this strip.”\n\n7. An Indie Rocker’s Itinerary\n\nKevin Drew — co-founder of the record label Arts & Crafts and the iconic local rock band Broken Social Scene — picks out some key venues.\n\nThe Phoenix Concert Theatre. Photo: SUICIDALDOGS/INSTAGRAM\n\nFor Mid-Size Live Shows\n\nThe Phoenix Concert Theatre (410 Sherbourne St.)\n\n“This room can soar. The best show I saw here was actually Phoenix at the Phoenix when they were blowing up.”\n\nFor New Bands and Saisons\n\nBurdock (1184 Bloor St. W)\n\n“A place for musicians to try out tunes on a small stage. It serves its own beer, which is up there with the city’s best DIY breweries.”\n\nFor the Best Jukebox in Town\n\nCommunist’s Daughter (1149 Dundas St. W)\n\n“Michael Johnson hosts a great Monday vinyl night. You play the A side of an album, and then he asks if people want to hear the B side or choose a mystery album. A classic Toronto evening.”\n\n8. And for the Hockey Fans …\n\nSportscaster Andi Petrillo (CBC Sports, TSN, and CPL) offers a suggestion.\n\nPhoto: Courtesy of Vendor\n\n“A lot of pubs are near one another. One of the biggest is Real Sports Bar & Grill (15 York St.). It’s right by the Scotiabank Arena, where the Raptors and Maple Leafs play. They have TVs everywhere — even in the bathroom — so you won’t miss a thing. Nearby is the Rec Room (255 Bremner St.), which is a kind of arcade for adults. They hold something called Puck Talks. They’re intimate shoot-the-breeze sessions with former hockey players and insiders, usually about 30 minutes before the game starts.”\n\n9. What to Take Back Home\n\nPhoto: Courtesy of Vendor\n\nA custom six-pack from Left Field Brewery\n\nThis craft brewery (36 Wagstaff Dr.) specializes in hoppy and hazy IPAs but also dabbles in dynamic one-offs like a Mojito Sour.\n\nGender-neutral clothing from In Objects We Trust\n\nHead down a back alley for the showroom (1190 Queen St.) of this unisex brand known for bold pieces that wouldn’t look out of place at Opening Ceremony.\n\nCheese-free Canadiana from Drake General Store\n\nThe Drake Hotel’s gift shop (1150 Queen St. W) sells a popular line of onesies and milk-bag pins.\n\n10. Easy Escapes\n\nTurtles and nude beaches are all under an hour away.\n\nFor Kayaking and Bird-Watching\n\nThe Humber Marshes\n\nIn the city\n\n“They’re one of the few remaining river-mouth marshes in Toronto, and they provide a breeding habitat for ducks, turtles, and fish — 60 species live there. We are the closest store to the river, so I’d say come to us, where you can rent kayaks or tandem canoes. I’d start paddling near Sir Casimir Gzowski Park (2001 Lake Shore Blvd. W), then go north up to Etienne Brûlé Park and back.” —Kelly McDowell, president of the Complete Paddler\n\nPhoto: Unsplash\n\nFor Clothing-Optional Beaches\n\nToronto Islands\n\n15 minutes by ferry\n\n“They are so close, and once you get there, it’s like you’re in another world — this pastoral landscape with an incredible panoramic view of the city. Centre Island is the most popular, and Hanlan’s Point is famous for its nude beach, if that’s what you’re in the mood for.” —Cameron Bailey\n\nPhoto: Unsplash\n\nFor Waterfalls and Hiking Trails\n\nHamilton\n\n45 minutes by car\n\n“Hamilton is known as the city of waterfalls. I’d start by grabbing a morning coffee and snack at Synonym (328 James St. N). I like going to Devil’s Punchbowl in the winter; it becomes an icy cliff then, and you can walk inside it. Tew Falls and Sherman Falls are both beautiful spots to explore in warmer months.” —Juli Daoust Baker, co-owner of Mjölk\n\n*A version of this article appears in the September 2, 2019, issue of New York Magazine. Subscribe Now!", "description": "Long considered the center of Canada’s self-contained universe, Toronto has seen considerable growth, culturally and commercially, over the past decade. Or, to quote hometown hero Drake, “Shit is hot up in the 6 right now.”", "authors": ["Andrew Parks"], "top_image": "https://pixel.nymag.com/imgs/daily/urbanist/2019/08/magazine/urbanist-toronto.w1200.h630.jpg"}