{"pub": "cbc", "title": "", "url": "https://cbc.ca/news/technology/farmers-almanac-winter-forecast-science-1.5266435", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:21:32.372836+00:00", "text": "Canadians love our weather words. And just this week we've been treated to a new phrase, thanks to the Farmers' Almanac: a winter \" polar coaster .\"\n\n\"The Farmers' Almanac, which provides 16 months of weather forecasts for seven zones in one compact book, is predicting that the worst of the bitterly cold winter conditions will affect areas east of the Rockies all the way to the Appalachians,\" the annual publication reads.\n\nIt also says that Canada can expect a \" teeth-chattering \" winter, with below-normal temperatures from coast to coast to coast.\n\nConversely, The Old Farmer's Almanac is predicting above-normal temperatures everywhere except southern B.C., which they say will experience colder-than-average temperatures in January and February.\n\n\"It just shows you they're all over the place. And one of them is bound to be right,\" said David Phillips, senior climatologist with Environment and Climate Change Canada. \"If you don't like the one forecast, go and look at the other.\"\n\nHow exactly do these almanacs predict a season?\n\nAccording to the Old Farmer's Almanac it's \"solar science,\" which means looking at sunspot activity; climatology, looking at prevailing weather patterns; and meteorology, studying the atmosphere.\n\nCanada's senior climatologist, David Phillips, says scientists examine a multitude of data that includes water temperatures in oceans around the world, ice conditions and land conditions rather than the moon phases almanacs claim to use. (CBC)\n\nThe Farmers' Almanac, on the other hand, says it relies on \"a specific and reliable set of rules that were developed back in 1818 by David Young … that is both mathematical and astronomical.\"\n\n\"Basically in the 1800s, when the almanac was first formed, the editor, David Young — who was a mathematician, a calculator, an astronomer and a farmer — he recognized weather was important to farmers,\" said Peter Geiger, editor of the Farmers' Almanac.\n\n\"So he developed a mathematical formula that gets applied to sunspot activity, planet positions, the effect the moon has on the Earth, and those are the components along with the math to do the weather.\"\n\nBut this isn't how scientists try to look to forecasting seasons.\n\n'No science into it'\n\n\"It blows it out of the water in terms of any credibility. Talk about moon phases and sunspots?\" Phillips said.\n\n\"I mean, moon phases? I always say to people that Halifax has the same moon phases as Vancouver, but my God, the weather can be totally different.\"\n\nInstead, Phillips explains, climatologists examine a multitude of data that includes water temperatures in oceans around the world, ice conditions and land conditions, as well as the current season.\n\nThat's not something you can do if you're forecasting seasons ahead, as the almanacs do.\n\n\"They came out with their forecast now, but they had to prepare it probably eight months ago because of publication dates,\" Phillips said.\n\n\"So when you think about the fact that we can't even get it right tomorrow, and then when you're trying to get it right a year and a half in advance, it just really is the joke it is. I mean, they could be right by the law of averages, but there's just no science into it.\"\n\nTorontonians are no strangers to winter weather, although they and other Canadians will have to wait a while before they know exactly what to expect this year. (Grant Linton/CBC)\n\nForecasting the weather is tricky business. It's fairly well understood that accuracy decreases the further out you go. Phillips said the rate of accuracy for forecasting the current day is roughly 95 per cent; two days drops to roughly 88 per cent; and seven days drops to about 75 per cent.\n\nAnother factor to take into account is climatologists dealing with a world they've never seen due to climate change.\n\nIn fact, winters in Canada have warmed up by almost 3.4 C since record-keeping began, Phillips said, with some regions — like the Canadian Arctic — facing far warmer temperatures than normal.\n\nWhen asked how the Farmers' Almanac took climate change into consideration, Geiger said, \"You can't look at climate change and say, 'Ah, this is climate change' because climate has been changing for hundreds of thousands of years.\n\n\"I look back at what happened; in the '30s it was hot and dry, and in the '70s it was very cold and it was very active, the storms were very big. I think when you look back, there have been collection of years where it's been very hot, very cold.\"\n\nWhile there haven't been any recent studies on the accuracy of farmers' almanacs' seasonal forecasts, a paper published in the journal Weatherwise in 1981 found that, rather than the claim held by The Old Farmer's Almanac that they forecast with 80 per cent accuracy, the reality was it was closer to 52 per cent , slightly greater than chance.\n\nAs for the Farmers' Almanac, Geiger said they don't track statistics on accuracy, but he's been told it's close to 80 per cent.\n\n\"I don't know statistically how accurate it is except it seems to do pretty well, and people follow it and use it, and I'm OK with that,\" he said.\n\nPhillips said Canadians might not want to focus so much on the winter ahead; there's still fall to go. His department plans to release that seasonal outlook on Sunday.\n\n\"You don't go from summer to winter,\" Phillips said. \"Canadians, we ignore those transition seasons ... but there's still a lot of weather to enjoy.\"", "description": "Worried about the \"polar coaster\" forecast by the Farmers' Almanac? Don't fret: Forecasting months ahead reduces accuracy and we still have fall to go.", "authors": ["Senior Reporter", "Nicole Has An Avid Interest In All Things Science. As An Amateur Astronomer", "Nicole Can Be Found Looking Up At The Night Sky Appreciating The Marvels Of Our Universe. She Is The Editor Of The Journal Of The Royal Astronomical Society Of Canada", "The Author Of Several Books."], "top_image": "https://i.cbc.ca/1.5019723.1550168974!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/cold-regina-weather-2019-february.jpg"}