{"pub": "businessinsider", "url": "https://businesstimes.com.sg/garage/fitch-downgrades-wework-after-aborted-ipo-leaves-financing-hole ", "downloaded_at": "2019-10-02 00:36:17.267319+00:00", "title": "Fitch downgrades WeWork after aborted IPO leaves financing hole", "language": "en", "text": "[NEW YORK] Global credit rating agency Fitch Ratings on Tuesday downgraded WeWork's credit rating by two notches to \"CCC+\", putting the Softbank-backed office-sharing firm deep into junk territory a day after it abandoned an initial public offering.\n\nWeWork, whose parent We Company lost US$1.9 billion in 2018, had hoped to raise at least US$3 billion in the abandoned IPO and borrow a further US$6 billion in a loan from banks that was contingent on the listing.\n\n\"In the absence of an IPO and associated senior secured debt raise, WeWork does not have sufficient funding to meet its growth plan,\" Fitch wrote in a note.\n\nAdditionally, Fitch warned that there is a potential for WeWork's customers, particularly big companies, to \"hesitate to sign membership agreements\" given the current flux. It said there was no evidence of this yet.\n\nWeWork's rating outlook is also negative, Fitch added.\n\nGet the latest on startups\n\nand business news Terms & conditions Sign up\n\nWeWork declined to comment.\n\nMonday's decision to scrap the IPO marked the conclusion of a tumultuous few weeks for WeWork, which failed to excite investors who raised concerns about its ballooning losses and a business model that involves taking long-term leases and renting out spaces for a short term.\n\nFellow ratings agency Standard & Poor's last week downgraded WeWork to \"B-\" from \"B\".\n\nBoth \"CCC+\" and \"B-\" are junk bond ratings reserved for corporate borrowers judged to be higher risk to lenders.\n\nWeWork is in discussions with banks as well as its largest investor SoftBank Corp about potential alternative funding, two sources familiar with the matter told Reuters on Monday.\n\nFitch said it could revisit the rating if WeWork was \"able to negotiate a firmly committed financing plan and demonstrate successful implementation of any turnaround plan\".\n\nWeWork's 7.875 per cent junk bond was last trading at about 84 US cents on the dollar, according to MarketAxess, a significant discount to face value, which indicated investor concerns about repayment or doubts about the company securing alternative financing.\n\nWeWork's new co-CEOs Artie Minson and Sebastian Gunningham, who replaced ousted founder and chief executive Adam Neumann last week, have talked about the need to return to WeWork's core business of renting out trendy office space to freelancers and enterprises. That would pull the company back from the fringe activities Mr Neumann had forayed into, such as education.\n\nGiven that, Fitch expects WeWork \"will face material restructuring cash charges as it reduces its workforce, which had reached over 12,500 in the second quarter\".\n\nWeWork had under US$2.5 billion in unrestricted cash at the end of June and is due to receive US$1.7 billion from SoftBank in 2020, according to Fitch, which estimated that would provide for four-to-eight quarters of funding, without taking into account any potential restructuring costs.\n\nREUTERS", "description": ": THE BUSINESS TIMES Garage - [NEW YORK] Global credit rating agency Fitch Ratings on Tuesday downgraded WeWork's credit rating by two notches to \"CCC+\", putting the Softbank-backed office-sharing firm deep into junk territory a day after it abandoned an initial public offering. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/garage/images/BTGaragedefault600.jpg", "published_at": "2019-10-02"}