{"pub": "cbs", "url": "https://cbsnews.com/news/trump-in-syria-the-ceasefire-is-far-from-a-victory-republican-senators-criticize-trumps-syria-strategy", "downloaded_at": "2019-10-19 11:00:08.239344+00:00", "title": "\"The 'ceasefire' is far from a victory\": Top Republican senators slam Trump's Syria strategy", "language": "en", "text": "After Vice President Mike Pence brokered a five-day ceasefire with Turkey on Thursday, President Trump hailed the agreement as a milestone in the region. But some top Senate Republicans appeared less convinced, expressing concerns with both the ceasefire and the president's overall Syria strategy.\n\n\"The 'ceasefire' is far from a victory,\" tweeted Senator Mitt Romney. \"Iran has been given a stronger hand in Syria,\" the Utah Republican wrote in another tweet. \"Russia's influence in the Middle East has been greatly enhanced.\"\n\nRomney is one of the Republicans who have been most critical of Mr. Trump. But even the president's Senate allies, including Majority Leader Mitch McConnell and Senator Lindsey Graham, have expressed concerns.\n\nIn a Friday op-ed in The Washington Post, McConnell wrote that \"withdrawing U.S. forces from Syria is a grave strategic mistake,\" that \"will leave the American people and homeland less safe, embolden our enemies, and weaken important alliances.\"\n\nMcConnell also targeted Mr. Trump's repeated pledge to \"end America's endless wars.\" \"As neo-isolationism rears its head on both the left and the right,\" he wrote, \"we can expect to hear more talk of 'endless wars.' ... America's wars will be 'endless' only if America refuses to win them.\"\n\nSenator Graham also shared his concerns, tweeting that General Mazloum Abdi, the commander of the Syrian Democratic Forces, is \"concerned about the cease-fire holding and was emphatic that he will never agree to the ethnic cleansing of Kurds that is being proposed in Ankara.\"\n\n\"I hope we can find a win-win situation,\" Graham said, \"but I share General Mazloum's concerns. I also told him that Congress will stay very involved and is extremely sympathetic to the plight of the Kurds.\"\n\nThat stands in contrast to Mr. Trump, who said on Wednesday that the Kurds were \"no angels.\"\n\nTheir comments came after a tumultuous week and a half of foreign relations. In early October, Mr. Trump called for the withdrawal of U.S. troops from northern Syria, where they had been working with Kurdish allies to defeat ISIS. While Mr. Trump asked Turkish President Recep Tayyip Erdogan not to invade the region, Erdogan nevertheless launched an offensive that has thrown the region into chaos.\n\nOn Thursday, Pence brokered a five-day ceasefire. But within hours, reports surfaced of continued attacks on northern Syria.\n\nMr. Trump said on Friday afternoon that the violence was \"eliminated quickly\" and that Turkey was \"back to a full pause,\" but the reports led to fears that Turkey won't abide by the ceasefire.\n\nThe greater concern for Senate Republicans, however, appears to be not whether the ceasefire will be respected, but what impact the withdrawal of U.S. troops from northern Syria will have. They, along with others, fear that the pullout will reverse the progress made against ISIS and other terror groups.\n\n\"Even if the five-day cease-fire announced Thursday holds, events of the past week have set back the United States' campaign against the Islamic State and other terrorists,\" McConnell wrote in his op-ed.\n\nMcConnell added that \"there is no substitute for American leadership,\" and called for the U.S. to \"retain a limited military presence in Syria and maintain our presence in Iraq and elsewhere in the region.\"\n\nThe majority leader also urged the U.S. to \"redouble international efforts to pressure the Assad regime ... [and] finally pass the Caesar Syria Civilian Protection Act to hold the regime accountable for its atrocities.\"", "description": "Senate Majority Leader Mitch McConnell said \"America's wars will be 'endless' only if America refuses to win them\"", "authors": ["Caroline Cournoyer"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/18/7d0ed089-aceb-421e-8e8c-c5b115cd41af/thumbnail/1200x630/467848414b39146916f52ae6f8c0e2f9/gettyimages-854248790.jpg", "published_at": "2019-10-19"}