{"pub": "huffpost", "url": "https://huffpost.com/entry/britain-france-germany-iran-saudi-attack_n_5d892e90e4b0d2694652e898", "downloaded_at": "2019-09-24 00:53:25.208374+00:00", "title": "Britain, France And Germany Blame Iran For Saudi Attack", "language": "en", "text": "UNITED NATIONS, Sept 23 (Reuters) - France, Britain and Germany said on Monday it is clear Iran was responsible for an attack on Saudi oil facilities on Sept. 14 and called on Tehran to agree to negotiations on its nuclear and missile programs as well as regional security issues.\n\n“The time has come for Iran to accept a long term negotiation framework for its nuclear program, as well as regional security issues, which include its missile programs,” the three governments said in a joint statement.\n\nFrench President Emmanuel Macron, British Prime Minister Boris Johnson and German Chancellor Angela Merkel met during the annual United Nations gathering of world leaders to coordinate their strategy on Iran as the European parties seek to save a 2015 nuclear deal and defuse tensions between Washington and Tehran.\n\n“It is clear to us that Iran bears responsibility for this attack. There is no other plausible explanation,” a statement by the three leaders said.\n\nWith Johnson laying the blame on Iran earlier in the day, it was the first time Paris and Berlin had done so.\n\nThe three countries said they remained committed to the 2015Iran nuclear deal, but demanded that Tehran return to full compliance after reneging on some of its commitments.\n\n“We are committed to continuing our diplomatic efforts to create conditions and facilitate dialog with all relevant partners interested in de-escalation of tensions in the MiddleEast,” they said. (Reporting by John Irish; editing by Grant McCool)", "description": "The heads of the three countries, who met during the United Nations summit, said it was clear Iran was responsible for an attack on Saudi oil facilities ...", "authors": [], "top_image": "https://img.huffingtonpost.com/asset/5d89327d2100003200db26ec.jpeg?cache=cniq3y84iw&ops=1778_1000", "published_at": "2019-09-23"}