{"pub": "politico", "url": "https://politico.com/news/2019/10/07/bernie-sanders-corporate-donations-dnc-036157", "downloaded_at": "2019-10-07 12:07:33.906346+00:00", "title": "Sanders unveils plan to stop corporate donations to Dem convention", "language": "en", "text": "“Our grassroots-funded campaign is proving every single day that you don’t need billionaires and private fundraisers to run for president,” Sanders said in a statement. “We’ve received more contributions from more individual contributors than any campaign in the history of American politics because we understand the basic reality that you can’t take on a corrupt system if you take its money.”\n\nSanders’ policy comes days after he was released from the hospital following a heart attack. His team has sought to project a business-as-usual tone, with two of his campaign co-chairs, Rep. Ro Khanna (D-Calif.) and Mayor Carmen Yulín Cruz of San Juan, Puerto Rico, stumping for Sanders over the weekend in Iowa and New Hampshire.\n\nSanders’ platform against corporate money also puts a spotlight on the candidate’s fundraising operation, which is powered almost exclusively by small-dollar donors. Sanders raised $25.3 million in the third quarter of the year, more than any other Democratic presidential candidate, but that news has been subsumed somewhat by his health scare.\n\nIn addition to trying to change the way the convention is funded, Sanders’ plan also seeks to bar corporate contributions for inaugural events and limit individual donations to $500 apiece.\n\nSanders’ policy puts the DNC in a difficult situation, and could potentially reignite tensions between the party organization and his campaign. DNC officials went to K Street last month to explain how corporations could contribute to the 2020 convention, which will be held in Milwaukee. Some lobbyists have been concerned that a candidate such as Sanders or Elizabeth Warren may try to halt corporate donations if they receive the party’s nomination.\n\nConvention CEO Joe Solmonese said at the time that the DNC is not expecting to return any contributions, no matter who wins the primary. It is unclear how the Sanders team would address such a situation, or what would happen during a brokered convention, but the campaign is adamant that it would not allow any corporate funding for the event.\n\n“Bernie Sanders fights for the people, cannot be bought and is under no obligation to fulfill any transaction with a corporation trying to corruptly buy access,” said Josh Orton, Sanders’ national policy director. “A Bernie Sanders convention will be a people-powered convention.”\n\nSanders also vows in his proposal to try to pass a constitutional amendment “that makes clear that money is not speech and corporations are not people,” and replace what his campaign calls the “worthless” Federal Election Commission with a Federal Election Administration proposed by former Sens. John McCain and Russ Feingold. He wants to pass public-financing laws for all federal elections, and allow voters to use “universal small-dollar vouchers” to donate to candidates as well. Several of Sanders’ proposals would require congressional approval.", "description": "", "authors": [], "top_image": "https://static.politico.com/65/07/5e7fe2a74dfcb2ae559f74a09bfb/20191006-bernie-sanders-ap-773.jpg", "published_at": "2019-10-07"}