{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/coronation-streets-katie-mcglynn-gives-20533986", "downloaded_at": "2019-10-07 23:35:37.572808+00:00", "title": "Coronation Street's Katie McGlynn gives 'trigger warning' over 'tough' cancer storyline", "language": "en", "text": "Get the biggest soaps stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nCoronation Street star Katie McGlynn has opened up about the difficulties of playing a character dying of cervical cancer in harrowing scenes on the long running soap.\n\nThe 26-year-old actress has played Sinead Tinker on the ITV soap for more than six years and will bow out later this year as the character succumbs to her illness.\n\nSpeaking to Mirror Online exclusively at the Inside Soap Awards in London on Monday night, the actress opened up about the difficulties she has faced playing the role as she prepares to walk away from the Cobbles for good.\n\nAnd attending the event at Sway bar in Covent Garden in a striking white ensemble, Katie said she is overwhelmed by the response fans have had to her character’s storyline.\n\n(Image: PA)\n\n“It's all been heartbreaking. I think this kind of storyline triggers so many things... there's so many sad things that strike a chord with people,” she said.\n\nKatie hinted her character’s suffering hasn’t even begun as she feels Sinead is in denial about her situation - despite only being given weeks to live by doctors.\n\n“I think they're both still in denial,” Katie said candidly from the Awards red carpet.\n\n“I think Sinead's still in denial - she's in a wheelchair and she's got a lot of pride so when she comes to the realisation that she's got to be in a wheelchair, she's not happy about it,” she added.\n\n(Image: PA)\n\nKatie said she is looking forward to new challenges in the future as she prepares to walk away from the soap after six years.\n\n“I’ve got some projects that I just want to do for me and I'm doing the pantomimes but nothing's set in stone,” she revealed.\n\nHowever, it sounds like the emotional scenes she has been working through on Corrie may have left her drained.\n\n“It’s been a tough year so I just want to breathe and see what happens,” she said.\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nThe star recently revealed to This Morning that she'd sobbed on set throughout her last episode.\n\n\"It's heartbreaking, but it's real life. When we were doing scenes that day, I thought that I can't imagine this happening to me,\" she said.\n\nIt comes after Katie had a big leaving party to celebrate filming her final scenes on Corrie where she was joined by cast-mates including Sally-Ann Matthews, Georgia Taylor and Jane Danson.\n\n(Image: ITV)\n\nKatie has previously spoken out about the impact of Sinead’s tragic storyline.\n\nShe proudly revealed nurses have contacted her to tell her that the number of women going for smear tests has soared since the tragic plot unfolded.\n\nKatie said: \"It’s messages like this that make it all worthwhile. Feel privileged to be a part of this storyline.\"", "description": "EXCLUSIVE: The soap star chatted to Mirror Online at the 2019 Inside Soap Awards in London on Monday night", "authors": ["Rose Hill", "Image", "Pa", "Itv"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20533164.ece/ALTERNATES/s1200/0_Inside-Soap-Awards-2019-London.jpg", "published_at": "2019-10-07"}