{"pub": "fox", "url": "https://foxbusiness.com/markets/fed-president-leaning-on-economic-backdrop", "downloaded_at": "2019-10-11 20:01:26.450061+00:00", "title": "Minneapolis Fed’s Kashkari says US economy needs some support", "language": "en", "text": "Minneapolis Federal Reserve President Neel Kashkari told Maria Bartiromo on Friday that the economic backdrop may lead him to support another rate cut.\n\nContinue Reading Below\n\n“I think the data is a little bit mixed,” he said on FOX Business’ Maria Bartiromo’s Wall Street. “Generally speaking, I think we should be providing some support to the economy. I think right now rates are roughly around neutral. I think I’m going to be in favor of another rate cut. How many more we have to go, it’ll depend on the data.”\n\nThe Federal Reserve is widely expected to cut rates another quarter-point during its next meeting. The September meeting minutes released this week showed a clear divide over whether or not to cut rates in the near-term.\n\nKashkari, who is not a voting member of the fed this year but participates in meetings concerning policy, said, on one hand, the economy is good.\n\n“The U.S. consumer is still very strong. Most Americans have jobs. Their wages are slowly increasing. Families have money in their pockets and they’re spending it,” he said. \"That’s 70% of the economy.”\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nOn the other hand, he said, uncertainty, especially around trade is putting businesses on edge.\n\n“Businesses seem to be pulling back. They seem to be nervous,\" he said. \"We’ve heard that they’re nervous about the trade war. Investment seems to be slowing. That’s a concerning signal.”\n\nWatch the full interview at 9 p.m. ET on FOX Business.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM", "description": "The economic backdrop may lead him to support another rate cut.", "authors": ["Julia Limitone"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/08/0/0/money-istock.jpg?ve=1&tl=1", "published_at": "2019-10-11"}