{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/26/mississippi-states-hill-thriving-amid-increased-wo", "downloaded_at": "2019-09-26 07:52:34.335168+00:00", "title": "Mississippi State's Hill thriving amid increased workload", "language": "en", "text": "STARKVILLE, Miss. (AP) - Something will have to give Saturday when Mississippi State brings the Southeastern Conference’s leading rusher into No. 7 Auburn to face one of the league’s stingiest run defenses.\n\nMississippi State’s Kylin Hill has run for over 100 yards in each of his team’s first four games and has a total of 551 yards rushing - 143 more than anyone else in the SEC.\n\nAuburn (4-0, 1-0 SEC) features one of the nation’s top defensive lines and allows just 89.5 rushing yards per game to rank second in the SEC. That group will be seeking revenge after Auburn lost 23-9 to Mississippi State (3-1, 1-0) last season.\n\n“They have a lot of experience, a couple of NFL guys on the defensive line,” Hill said. “The majority of the success we had last year was the play calling by coach (Joe) Moorhead, and he called the right plays against the right defense.”\n\nHill rushed for 126 yards and former Mississippi State quarterback Nick Fitzgerald ran for 195 yards against Auburn last season.\n\nNow that Fitzgerald has departed, Hill has taken over as the featured player in Mississippi State’s rushing attack.\n\nLast year, Hill had 117 rushing attempts in 11 games. After four games in 2019, Hill has already totaled an SEC-leading 91 carries.\n\nThe only Football Bowl Subdivision players with more carries are Oklahoma State’s Chuba Hubbard (103), Boston College’s A.J. Dillon (99) and Florida State’s Cam Akers (98).\n\n“Historically, backs in this offense have had well over 200 carries,” Moorhead said. “We utilized the quarterback in the run game more last year, and now that we’re throwing it better, we are seeing better numbers and giving some of those carries to the tailback instead of the quarterback. I believe Kylin can carry this workload by the way he approaches it and how he’s prepared himself.”\n\nHill has 20 rushes that covered 10 yards or more - the most of any FBS player. Hill either leads or is tied for the lead in nine different offensive categories in the SEC.\n\nAuburn coach Gus Malzahn praised Hill’s explosiveness and cited a play from Mississippi State’s 28-13 victory over Kentucky last week in which he dove across the goal line from over 4 yards away.\n\n“He’s a veteran guy, he’s been there and done that,” Malzahn said. “He’s one of the best in our league.”\n\nHill says he’s benefited from Mississippi State’s improved passing game.\n\nA year ago, Mississippi State quarterbacks completed just 51.5 percent of their pass attempts. This year, Tommy Stevens and Garrett Shrader have combined to complete 64 percent of their passes.\n\n“Once the passing game gets going it takes a lot of pressure off me,” Hill said. “Right now we’re a very balanced team.”\n\nHill and the Bulldogs will face a big challenge trying to match the success they had against Auburn last season, when they rushed for 349 yards.\n\nAuburn has held three of its first four opponents this season below 100 yards rushing. Auburn’s Derrick Brown is the reigning SEC defensive lineman of the week after teammate Marlon Davidson earned that honor each of the previous two weeks.\n\nMississippi State utilized a lot of pre-snap motion last year to keep the Tigers’ defense off stride. Moorhead said his offense will need to do more of the same Saturday to succeed against a defensive line that he considers among the best in the country.\n\n“We were fortunate to do that last year and we did some things to keep them off-balanced, maybe some misdirection things that we had not normally done,” Moorhead said. “But you are not going to just line up and run the ball downhill on these guys. It doesn’t work that way and we have to find creative ways to find space and angles.”\n\n___\n\nMore AP college football: http://apnews.com/tag/Collegefootball and http://www.twitter.com/AP_Top25\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Something will have to give Saturday when Mississippi State brings the Southeastern Conference's leading rusher into No. 7 Auburn to face one of the league's stingiest run defenses.", "authors": ["The Washington Times Http", "Paul Jones"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/26/kentucky_mississippi_st_football_44286_c0-206-4921-3075_s1770x1032.jpg?e2b56d88622cbb994a2b2cedc0bbc9af5218c8f6", "published_at": "2019-09-26"}