{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7549329/Nutritionist-reveals-bad-habits-teaching-kids-mealtimes.html", "downloaded_at": "2019-10-08 10:03:52.222497+00:00", "title": "Nutritionist reveals the bad habits we are teaching are kids at mealtimes", "language": "en", "text": "Establishing a healthy relationship with food is important from a young age, but encouraging our children to eat healthily can feel like a constant battle for many parents - especially those who work long hours.\n\nWith us Brits leading busier lives, we're left with less time for loved ones – and with more to distract us and entertain us, that quality time can be even harder to come by.\n\nOnce upon a time, mealtimes were a sacred and special time to chat and discuss your day with your family, but that's steadily on the decline.\n\nResearch from Scandinavian nursery brand Stokke, makers of the Tripp Trapp highchair, recently found that just half of us typically enjoy family mealtimes at the dinner table.\n\nEstablishing a healthy relationship with food is important from a young age, but encouraging our children to eat healthily can feel like a constant battle for many parents (stock image)\n\nBut according to Charlotte Stirling-Reed, a specialist in child nutrition, it's crucial that parents try to carve out time to eat together with their kids when they can.\n\n'The idea of eating together as a family for every meal will probably seem unrealistic for most of us,' Charlotte admitted.\n\n'However, whenever we can, it's really worthwhile making the most of time together eating, as infants and toddlers pick up so much about what to eat and how to eat from watching us and others around them at mealtimes.\n\n'I love the idea of family mealtimes, whenever possible. Even if this just means mum or dad sitting down with baby or grandparents joining children at the table while they eat after school. It all can make a big impact on the enjoyment of mealtimes.'\n\nEqually, Charlotte argues it's important we don't teach our little ones 'bad habits' at the dinner table. Here she identifies where some families could be going wrong...\n\nAccording to Charlotte Stirling-Reed, a specialist in child nutrition, it's crucial that parents try to carve out time to eat together with their kids when they can\n\n1. Not eating together\n\n'This is the biggest bad habit we are all guilty of,' Charlotte said.\n\n'Simple but often challenging, aiming to eat to sit and eat together whenever possible is the first step to healthy, happy mealtimes!\n\n'Children learn the skills of eating, social skills and even what foods they enjoy by first copying others. So even if it's just you and your baby or child, having you as a part of their mealtime makes a huge different to how they enjoy they food and makes dinner part of a routine.'\n\nCharlotte suggested that not eating together as a family is a bad habit we all tend to be guilty of (stock image)\n\n2. Setting a bad example\n\n'If your own diet consists of chips and fried chicken, your children will soon pick up on that and want the same themselves,' Charlotte pointed out.\n\n'So even if it means changing some of your eating habits, it's important that your child has an opportunity to see you eating and enjoying a healthy diet.'\n\nIf you struggle with healthy foods, Charlotte recommends trying to involve other family members who you know eat well.\n\n'Role models have a massive influence on baby and toddler eating habits,' she added.\n\n3. Setting too many mealtime rules\n\nMaking mealtimes too pressured and setting mealtimes rules, such as clearing your plate, eating all your vegetables first, or sitting at the table until everyone has finished, can end up making mealtimes less enjoyable for kids, according to Charlotte.\n\nMaking mealtimes too pressured and setting mealtimes rules, such as clearing your plate, eating all your vegetables first, or sitting at the table until everyone has finished, can end up making mealtimes less enjoyable for kids (stock image)\n\nShe suggested sticking to rules that you know are 100 per cent necessary, matter to you and avoid too much pressure for children to 'eat up' their meal.\n\n'It's good to keep mealtimes light and enjoyable to help children want to be a part of them,' she explained.\n\n4. Making separate meals\n\nIt is not uncommon for parents to make sperate meals for everyone in the family - or even for parents to create multiple meals for a single child at dinnertime, only to have each and every one rejected.\n\n'This isn't good for your child, for your sanity as a parent,' Charlotte observed. 'To avoid allowing dinnertime to become a dreaded battle and help your fussy child, offer a choice between one or two healthy options. For example, \"do you want Weetabix or Porridge?\" Or, \"do you want potatoes or pasta today?\"\n\n'This way, you're allowing them some independence whilst still being in control of they food they're eating.'\n\nAlternatively, Charlotte suggested trying to have one option that everyone eats. 'It's good for you and your children to eat the same meals, and see you eating similar foods to encourage them to eat a wide variety themselves,' she added.\n\n5. Offering too many alternatives\n\nResearch has shown time and time again that babies and children learn to like what is familiar to them.\n\nOffering alternatives only teaches children that they can control the food they eat, and as soon as they understand this they will exploit it to the maximum\n\nIf you offer your child broccoli and they reject it and you never offer it again, they won't ever learn to like it and their diet is being restricted.\n\nCharlotte said: 'Next time a meal is refused, without much comment put it in the fridge for later. Offering alternatives only teaches children that they can control the food they eat, and as soon as they understand this they will exploit it to the maximum.'\n\n6. Giving all your attention to the fussy eater\n\n'In most instances, any attention given to food refusal simply encourages it, so don't give all your attention to the fussy eater!' Charlotte warned.\n\n'Instead, give your attention to the people around the table, whether it be dad, brother or sister, who are eating well and enjoying their food. Offer lots of praise for good eating behaviour, such as \"well done Daddy, you've eaten ALL your broccoli\", and talk about the aspects of the meal you enjoyed.\n\n'It might not work straight away, but your child will finally realise that they get more attention at dinner from eating well than from being fussy.'\n\nIf the whole family sitting together can't happen every day in your home, Charlotte recommends trying to make an effort to do so at least once a week.\n\n7. Forcing or coaxing your child into eating\n\nCharlotte advises avoiding trying to force or coax your child into eating, even if you're worried they're not consuming enough food.\n\nCharlotte advises avoiding trying to force or coax your child into eating, even if you're worried they're not consuming enough food\n\n'It can establish a negative relationship with food, and can also be dangerous,' she said.\n\n'Young children are actually excellent at knowing when they are hungry and when they are full. If we override these signals, they are likely to have less understanding of their appetite as they grow older.'\n\n8. Using distractions such as televisions, toys or phones\n\nAccording to the research undertaken by Stokke, over two thirds of parents try to use distractions to get their children to eat something unconsciously.\n\nHowever, this simply teaches your children that food is bad or unimportant. Even if distractions might make feeding slightly easier in that moment it time, using them tells children that eating is something we need to 'be over and done with' as quickly as possible.\n\nCharlotte warned that they also distract from what can be an important social occasion for a family too.\n\nCharlotte warned that digital devices distract from what can be an important social occasion for a family too (stock image)\n\n'Often, this also sets yourself up for difficulties in the future as your child experiences eating in new situations, for instance at friend's house or at nursery,' she said.\n\n'If you want your child to grow up to love their food, you need to show them that the delicious and varied foods you eat at home are worth attention and time.'\n\n9. Offering the same foods every week\n\nIt's so easy to get stuck offering the same foods each week, but boredom is one of the biggest reasons for children going off food and acting up at the dinner table.\n\nBy offering a variety of foods, not only are you exposing your children to a variety of tastes, flavours and nutrients, but you're also preventing them getting fed up.\n\n'This is definitely easier said than done, so try making some bulk meals at the weekend and then tapping into them during the week,' Charlotte suggested.\n\n'Menu plans can really work for some families too.'", "description": "Charlotte Stirling-Reed, a UK-based specialist in child nutrition, warns it's crucial that parents try to carve out time to eat together with their kids as they pick up habits - good and bad - from them.", "authors": ["Hayley Richardson For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/09/19433534-0-image-a-234_1570524487639.jpg", "published_at": "2019-10-08"}