{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7566673/As-war-WAGs-hots-defiant-Coleen-Rooney-parties-till-4am.html", "downloaded_at": "2019-10-13 00:31:43.365620+00:00", "title": "As war of the WAGs hots up, defiant Coleen Rooney parties till 4am", "language": "en", "text": "Coleen Rooney has told Rebekah Vardy 'bring it on' for their bitter legal battle following Rooney's claims that Vardy had been selling fake stories from her private Instagram to a newspaper\n\nColeen Rooney is steeling herself for a bitter legal battle with Rebekah Vardy, defiantly telling friends: ‘Bring it on.’\n\nThe 33-year-old wife of former England captain Wayne Rooney sparked an extraordinary war of words last week by accusing her rival WAG of leaking stories from her private Instagram account to a newspaper.\n\nMrs Vardy, 37, who is married to Leicester striker Jamie Vardy, angrily denied the claim and threatened to sue for libel.\n\nBut a close friend of Mrs Rooney last night told The Mail on Sunday: ‘Coleen’s view is, “Bring it on.” She has got the evidence – it’s all there.\n\n‘Coleen’s evidence is bullet-proof and she stands by it all. If Rebekah wants to sue, she’s welcome to. Coleen will fight her and the proof is there. If it’s in court, it’s not ideal but Coleen will follow it through.’\n\nAs fellow WAGs divided their loyalties between the two women, Mrs Rooney partied until the early hours yesterday. Dressed in a black leather mini-dress, she joined the 40th birthday celebrations of close friend Leanne Brown at Vanitas bar in Manchester, drinking champagne and vodka cocktails until 4am. She was seen laughing with friends including Leanne, the wife of former Manchester United and England defender Wes Brown.\n\nBy contrast, Mrs Vardy was seen in tears yesterday as she and her husband arrived back at their home in Lincolnshire after a holiday in Dubai.\n\nThe astonishing row began on Wednesday when Mrs Rooney revealed details of her investigation into the source of a series of stories about her family.\n\nColeen enjoyed partying out until 4am (pictured left) while Rebekah Vardy was seen in tears yesterday as she and her husband arrived back in Lincolnshire after a holiday in Dubai (pictured right last month)\n\nIn a ploy that earned her the nickname ‘Wagatha Christie’, the mother of four planted fake stories on her social media accounts. She then blocked all of her followers except Mrs Vardy, who still had access to her messages. The whodunnit-style trap was so secret that the Rooneys only told their management teams about it a few hours before the bombshell announcement publicly named Mrs Vardy as the culprit.\n\nMrs Vardy has now referred the claims to her lawyers and suggested the stories could have been leaked by hackers who broke into her Instagram account. Asked if she had argued with Mrs Rooney about the claims, she replied: ‘That would be like arguing with a pigeon. You can tell it that you are right and it is wrong, but it’s still going to s*** in your hair.’\n\nColeen teamed her frock with a pair of barely-there black heels, which boosted her petite frame as she was spotted leaving the venue looking bleary-eyed\n\nFormer Real Housewives of Chesire star Tanya Bardsley arrives on the arm of Premiere League star and husband Phil, while wearing a vibrant 80s style party-dress\n\nFriends of Mrs Vardy, who is seven months pregnant, say the spat is putting her unborn child’s health at risk. ‘We’ve got a pregnant woman here who shouldn’t be subjected to all this abuse,’ said fellow WAG Nicola McLean, who shares an agent with Mrs Vardy. ‘Coleen Rooney – she’s a mother. She knows this is not acceptable.’\n\nMrs Rooney’s camp say she is incensed by the attacks and believes her actions were not only justified but also necessary to draw a red line for herself and other women.\n\nShe is understood to be particularly keen to hear the findings of a forensic lawyer hired by Mrs Vardy to examine access to the Instagram account in order to find out who may have sold the fake stories. ‘Coleen went public on this because the stories about her went public,’ said a source. ‘Why shouldn’t she have a right to do the same? She did make it very clear that it was Rebekah Vardy’s account that was doing this [leaking the stories].\n\nFormer Manchester United and England Defender Wes Brown arrived hand-in-hand with his wife Leanne Brown who donned a sleek plunge-necked bodysuit to celebrate her 40th birthday\n\n‘There have been times this week when she has been very, very angry at things that have been said. It has been a rollercoaster but she knows she’s in the right and that’s what matters.’\n\nThe source said Mrs Rooney is protective of the next generation of England WAGs, such as Fern Hawkins, who is engaged to Manchester United defender Harry Maguire, Megan Davison, the fiancee of Everton goalkeeper Jordan Pickford, and Katie Goodland, who is married to captain Harry Kane.\n\n‘These young girls are vulnerable to people wanting to sell them out,’ said the insider.\n\nThe full statement: Coleen made these claims on Instagram after discovering she had been betrayed by someone close to her, concluding that it was Rebekah's account\n\n‘Some of them fear something similar could happen to them but Coleen feels by doing this, it puts a marker down.’\n\nFriends say that Wayne, 34, has not spoken to Jamie Vardy about the situation.\n\n‘He has no interest in getting involved with any of it,’ said a source. ‘Football is football and he thinks Jamie takes the same view. He is extremely supportive of Coleen. The girls need to fight this out themselves.’", "description": "Coleen Rooney partied until 4am for friend Leanne Brown's 40th in Manchester as Rebekah Vardy arrived home in tears after holiday in Dubai. Coleen told Vardy 'bring it on' for legal battle.", "authors": ["Katie Hind Showbusiness Editor For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/21/19634152-0-image-a-102_1570913031380.jpg", "published_at": "2019-10-12"}