{"pub": "investing.com", "url": "https://ca.investing.com/news/stock-market-news/us-shares-lower-at-close-of-trade-dow-jones-industrial-average-down-119-1982321", "downloaded_at": "2019-10-09 01:13:08.095003+00:00", "title": "U.S. shares lower at close of trade; Dow Jones Industrial Average down 1.19%", "language": "en", "text": "© Reuters. U.S. shares lower at close of trade; Dow Jones Industrial Average down 1.19%\n\nInvesting.com – U.S. equities were lower at the close on Tuesday, as losses in the , and sectors propelled shares lower.\n\nAt the close in NYSE, the declined 1.19%, while the index fell 1.56%, and the index fell 1.67%.\n\nThe biggest gainers of the session on the were Walmart Inc (NYSE: ), which rose 0.30% or 0.35 points to trade at 117.58 at the close. Home Depot Inc (NYSE: ) fell 0.03% or 0.07 points to end at 226.67 and McDonald’s Corporation (NYSE: ) was down 0.38% or 0.81 points to 211.11 in late trade.\n\nBiggest losers included Dow Inc (NYSE: ), which lost 2.92% or 1.32 points to trade at 43.85 in late trade. Cisco Systems Inc (NASDAQ: ) declined 2.89% or 1.38 points to end at 46.39 and JPMorgan Chase & Co (NYSE: ) shed 2.23% or 2.55 points to 111.82.\n\nThe top performers on the S&P 500 were Motorola Solutions Inc (NYSE: ) which rose 1.76% to 170.75, Newmont Goldcorp Corp (NYSE: ) which was up 1.73% to settle at 38.92 and L3Harris Technologies Inc (NYSE: ) which gained 1.69% to close at 209.25.\n\nThe worst performers were Nektar Therapeutics (NASDAQ: ) which was down 13.34% to 16.18 in late trade, Waters Corporation (NYSE: ) which lost 6.92% to settle at 208.01 and PerkinElmer Inc (NYSE: ) which was down 6.22% to 79.10 at the close.\n\nThe top performers on the NASDAQ Composite were Asure Software Inc (NASDAQ: ) which rose 23.01% to 8.34, Lifeway Foods Inc (NASDAQ: ) which was up 17.31% to settle at 2.44 and Cinedigm Corp (NASDAQ: ) which gained 15.48% to close at 0.9700.\n\nThe worst performers were Superconductor Technologies Inc (NASDAQ: ) which was down 57.61% to 0.1950 in late trade, Histogenics Corp (NASDAQ: ) which lost 31.55% to settle at 1.280 and Ritter Pharmaceuticals Inc (NASDAQ: ) which was down 28.68% to 0.271 at the close.\n\nDeclining stocks outnumbered rising ones by 2120 to 731 and 80 ended unchanged; on the Nasdaq Stock Exchange, 2050 fell and 567 advanced, while 85 ended unchanged on the New York Stock Exchange.\n\nThe , which measures the implied volatility of S&P 500 options, was up 13.55% to 20.28.\n\nIn commodities trading, Gold Futures for December delivery was up 0.44% or 6.55 to $1510.95 a troy ounce. Meanwhile, Crude oil for delivery in November fell 0.30% or 0.16 to hit $52.59 a barrel, while the December Brent oil contract rose 0.02% or 0.01 to trade at $58.11 a barrel.\n\nEUR/USD was up 0.04% to 1.0958, while USD/JPY fell 0.01% to 107.06.\n\nThe US Dollar Index Futures was up 0.17% at 98.830.", "description": "U.S. shares lower at close of trade; Dow Jones Industrial Average down 1.19%", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEA7S0VT_L.jpg", "published_at": "2019-10-08"}