{"pub": "metro", "url": "https://metro.co.uk/2019/10/17/amanda-holden-leads-global-gift-gala-glam-caroline-flack-david-walliams-eva-longoria-hit-red-carpet-10939031", "downloaded_at": "2019-10-18 01:08:12.822082+00:00", "title": "Amanda Holden, David Walliams, Caroline Flack dazzle at Global Gift Gala", "language": "en", "text": "The stars came out in force (Picture: Rex, Getty)\n\nThe stars flocked to this year’s Global Gift Gala tonight with Amanda Holden leading the glamorous a-list squad, with the likes of Eva Longoria, Strictly’s AJ Pritchard and Saffron Barker, and David Walliams also gracing the red carpet.\n\nBritain’s Got Talent judge Amanda was pretty hard to miss on the red carpet as she donned a red gown with a plunging neckline and cut-outs around the side of her thighs.\n\nAfter strutting along the red carpet, the 48-year-old met up with David Walliams and Caroline Flack once inside.\n\nElsewhere on the red carpet, Desperate Housewives actress Eva Longoria shone to the gods in a sequin power suit and hugged her pal, Melanie Griffith, as they posed for photos.\n\nThe Hollywood stars, who are honorary chairs of the charity, had spent time with children at a special needs school, Haringey’s Vale, in north London on Wednesday.\n\nAdvertisement\n\nAdvertisement\n\nWalliams, 48, did the honours of hosting the prestigious event which was held at the Kimpton Fitzroy London Hotel.\n\nProceeds from the Global Gift Gala go towards the Global Gift Foundation, a non-profit organisation that aims to create a positive impact on the lives of women, children and families around the world.\n\nCaroline was all about the colour and shine (Picture: Rex Features)\n\nAmanda found a unique way to work a side split (Picture: Getty Images)\n\nPaloma was honoured with the empowerment award (Picture: Rex Features)\n\nMelanie, Paloma and Eva had a good ol’ catch up on the red carpet (Picture: Rex Features)\n\nEva knew how to rock a power suit (Picture: Rex Features)\n\nMelanie and Eva are co-chairs of the Global Gift Gala (Picture: Getty Images)\n\nDenise Van Outen oozed sophistication (Picture: Rex Features)\n\nKatie and her man Richard Sutton make quite the dashing couple (Picture: Getty Images)\n\nGary Dourdan jetted in from the US (Picture: Getty Images)\n\nMelanie visited children at a special needs school as part of the Global Gift Gala (Picture: Rex Features)\n\nPaloma Faith was scheduled to perform at the swanky event and to receive the empowerment award for being her amazing inspirational self.\n\nBefore heading into the gala, Strictly Come Dancing stars AJ Pritchard and Saffron Barker revealed how they are getting along after being forced to pull out of rehearsals due to the YouTuber’s back injury.\n\nSpeaking to Metro.co.uk on the red carpet, Saffron admitted: ‘It definitely has affected it, we haven’t been able to do as many hours as we would have liked to, from what we have done previously.\n\nAdvertisement\n\nAdvertisement\n\n‘It’s only getting harder, the competition. So we have struggled. But we’re getting through it. Our last day has been successful.’\n\nAJ added: ‘We just can’t get it done as many times. We’ve just got to be efficient, getting it done, and then going for dinner!’\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Amanda Holden slips into sparkly jumpsuit as she supports Jamie Theakston after charity bike ride\n\nMORE: Amanda Holden in fierce row with company over ‘celebrity status’ treatment: ‘Didn’t ask for anything special’", "description": "Eva Longoria, David Walliams, Amanda Holden and Strictly Come Dancing stars AJ Pritchard and Saffron Barker attended the Global Gift Gala.", "authors": ["Alicia Adejobi"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/global-gift-gala_1571348826.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-17"}