{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-poland-israel-beatings/polands-foreign-ministry-condemns-attack-on-israeli-students-idUKKCN1VT0RI", "downloaded_at": "2019-09-08 23:27:15.640991+00:00", "title": "Poland's foreign ministry condemns attack on Israeli students", "language": "en", "text": "WARSAW (Reuters) - Poland’s foreign ministry on Sunday condemned violence against a group of Israeli students beaten at a Warsaw nightclub early on Saturday, following criticism that Polish leaders are not doing enough to denounce antisemitism.\n\nEarlier this year, the World Jewish Congress condemned the burning of an effigy of Judas in the Polish town of Pruchnik and hundreds of far-right supporters marching in Warsaw against a U.S. law on restitution of Jewish property seized during or after World War Two.\n\nPoland was home to one of the world’s biggest Jewish communities before it was almost wiped out by Nazi German occupiers who set up death camps such as Auschwitz on Polish soil.\n\n“(The Polish ministry of foreign affairs) condemns acts of aggression carried out by or against foreigners in Poland. The matter of the beating of (Israeli) citizens by foreigners on Polish territory is being clarified by the police...,” Poland’s ministry of foreign affairs said in a tweet published on Sunday.\n\nThe group of Israelis were attacked around 5 a.m. on Saturday a spokesman for the Warsaw police told Reuters, adding that two of those attacked were hospitalized while four in total were injured.\n\n“We noticed some pushing and shoving, and from the window we heard cursing,” Yotam Kashpizky, one of the students who was attacked, told Israel’s Channel 13 TV on Sunday, adding that his nose and eye socket were broken.\n\nKashpizky’s twin brother, Barak, condemned the attack in a Facebook post on Sunday, adding that the attack was carried out by a “group of Arabs”.\n\nThe police spokesman did not confirm the nationality of the attackers.", "description": "Poland's foreign ministry on Sunday condemned violence against a group of Israeli students beaten at a Warsaw nightclub early on Saturday, following criticism that Polish leaders are not doing enough to denounce antisemitism.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-08"}