{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7580475/TOWIEs-Courtney-Green-flashes-abs-joins-Chloe-Brockett-Saffron-Barker-filming.html", "downloaded_at": "2019-10-16 21:34:25.882016+00:00", "title": "TOWIE's Courtney Green flashes her abs and joins Chloe Brockett and Saffron Lempriere for filming", "language": "en", "text": "She has agreed to bury the hatchet following her row with newbie Olivia Attwood.\n\nAnd following their truce, Courtney Green headed to filming alongside her pal Chloe Brockett and their co-star Saffron Lempriere in Essex on Wednesday afternoon.\n\nThe TOWIE star, 24, displayed her honed midriff in a white crop top, which she layered with a statement pale pink houndstooth jacket with button detailing.\n\nPretty in pink! Courtney Green headed to filming alongside her pal Chloe Brockett and their co-star Saffron Barker in Essex on Wednesday afternoon.\n\nCourtney added a casual edge to her daytime look with a pair of rolled up tracksuit bottoms, while also rocking a pair of chunky white trainers.\n\nThe reality star carried a navy leather bag in her hand, which was no doubt full of all of her belongings for the outing with her gal pals.\n\nThe brunette beauty glammed up her look by wearing her luscious locks in big bouncy curls, while completing her look with a bold smokey-eye and nude lip.\n\nGlam: Also showcasing her flair for fashion was Chloe B, who donned a pair of skintight PVC leggings teamed with some moc crock heeled ankle boots\n\nStarry-eyed: Saffron Lempriere opted for a cool monochrome look including a pretty star-print blouse\n\nSizzling: Chloe, who joined the show during the last series, also rocked a black T-shirt and a blue denim blazer with gold buttons up the front of the garment\n\nAlso showcasing her flair for fashion was Chloe B, who donned a pair of skintight PVC leggings teamed with some moc crock heeled ankle boots.\n\nChloe, who joined the show during the last series, also rocked a black T-shirt and a blue denim blazer with gold buttons up the front of the garment.\n\nShe wore a red leather cross body bag across her waist and styled her brunette locks in a loose blown out style with a signature full face of make-up.\n\nSultry: The brunette beauty glammed up her look by wearing her luscious locks in big bouncy curls, while completing her look with a bold smokey-eye and nude lip\n\nSaffron opted for an entirely monochrome look, as she rocked a black and white star-print blouse complete with a chic neck tie in the same pattern.\n\nShe teamed her outfit with a fluffy black gilet and a pair of distressed black jeans, as well as a pair of black leather ankle boots.\n\nDuring Sunday's episode of the show Courtney and her BFF Chloe Meadows could be seen consoling their friend Amber Turner as she continued to fret over her relationship with boyfriend Dan Edgar.\n\nAmber admitted she has 'insecurities' over her relationship with Dan.\n\nInsisting her hunk has been negatively influenced by his close pal Diags, the former blogger, 26, complains to her pals Courtney Green and Chloe Meadows: 'I don't think its fair for Diags to make comments.\n\n'Of course Dan is not going to be the same person. I think Dan feels very under pressure, Diags is very much for 'pro-single' Dan. I've always liked Diags, but he's never got anything nice to say about me or my relationship.'\n\nChic: She teamed her outfit with a fluffy black gilet and a pair of distressed black jeans, as well as a pair of black leather ankle boots", "description": "The TOWIE star,  24, displayed her honed midriff in a white crop top, which she layered with a statement pale pink houndstooth jacket with button detailing.", "authors": ["Charlotte Dean For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/17/19796814-0-image-a-16_1571243080223.jpg", "published_at": "2019-10-16"}