{"pub": "businessinsider", "url": "https://businessinsider.com/judge-rules-in-favor-of-harvard-in-asian-discrimination-case-2019-10", "downloaded_at": "2019-10-02 02:29:05.181863+00:00", "title": "Harvard discrimination trial ends in win for affirmative action, but Supreme Court battle may loom on the horizon", "language": "en", "text": "A federal judge has ruled in favor of Harvard University in a discrimination case that was, in effect, a ruling on affirmative action. The judge rejected a lawsuit claiming Harvard discriminated against Asian-Americans when it used race as a factor in its admissions process.\n\nRead more: Asian-American groups are saying affirmative action hurts their chances to get into Ivy League schools\n\nFederal District Court Judge Allison D. Burroughs issued the decision on Tuesday in Massachusetts saying, \"Harvard's admission program passes constitutional muster,\" according to NPR, and that \"ensuring diversity at Harvard relies, in part, on race-conscious admissions.\"\n\nThe suit, which was brought forward by the advocacy group Students for Fair Admissions argued that Harvard considered race too prominently in its admissions decisions in a way that unfairly disadvantaged Asian-American applicants.\n\nThe group says that an analysis of 160,000 students' admissions records showed that Asian-Americans systematically were scored lower for \"personality\" characteristics while scoring higher on tests, GPA, and extra-curricular activities.\n\nThe US Supreme Court has ruled that affirmative action may be used by universities to help minority applicants gain entry to college, but Students for Fair Admissions argued that these programs had the unintended effect on discriminating against Asian-American and white students.\n\nIn her 130-word page opinion Burroughs said that Harvard's admissions process wasn't perfect but said she wouldn't \"dismantle a very fine admissions program that passes constitutional muster, solely because it could do better,\" according to CNN.\n\nBurroughs went on to give a defense of the benefits of racial and economic diversity in the classroom.\n\n\"The students who are admitted to Harvard and choose to attend will live and learn surrounded by all sorts of people, with all sorts of experiences, beliefs and talents,\" Burroughs said according to The New York Times. \"They will have the opportunity to know and understand one another beyond race, as whole individuals with unique histories and experiences. It is this, at Harvard and elsewhere that will move us, one day, to the point where we see that race is a fact, but not the defining fact and not the fact that tells us what is important, but we are not there yet.\"\n\nStudents for Fair Admissions Founder Edward Blum Reuters\n\nSince it emerged in the 1960s as a means to counteract years of racial discrimination, affirmative action has come under repeated judicial attacks by its opponents. In the most recent example, in 2016, the US Supreme Court upheld the considerations of race in admissions by a vote of 4-3 in Fisher vs. The University of Texas. That ruling occurred under a Supreme Court where the conservative justice Anthony Kennedy was the deciding vote.\n\nThough Tuesday's ruling comes as an immediate victory for Harvard, some legal experts anticipate that Students for Fair Action will appeal the case all the way to the Supreme Court, where it will meet a Supreme Court recently made by two appointments from Republican Donald Trump.\n\nRead more:\n\nAsian-American groups are saying affirmative action hurts their chances to get into Ivy League schools\n\nHarvard records show discrimination against Asian-Americans: group\n\nThe Supreme Court just ruled in favor of affirmative action in college admissions", "description": "While the ruling was a short term win for Harvard, Students for Fair Admissions is expected to appeal the case to the Supreme Court.", "authors": ["Mack Degeurin"], "top_image": "https://image.businessinsider.com/5d93c58921214c43d6140805?width=1200&format=jpeg", "published_at": "2019-10-01"}