{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7614547/Transgender-man-gave-birth-does-not-want-called-mother-continue-legal-fight.html", "downloaded_at": "2019-10-25 22:36:35.216257+00:00", "title": "Transgender man who gave birth but does not want to be called 'mother' will continue legal fight", "language": "en", "text": "Freddy McConnell, 32, who is originally from Deal, Kent, wants to be registered as father or parent, pictured with his son\n\nA transgender man who has given birth but does not want to be described as 'mother' on a birth certificate, is set to continue a legal battle.\n\nFreddy McConnell, 32, who is originally from Deal, Kent, wants to be registered as father or parent.\n\nA judge ruled against him after a High Court trial in London but lawyers have been given the go-ahead to take his case to the Court of Appeal.\n\nCourt officials say a judge has concluded, after analysing written submissions, that Mr McConnell has an arguable case and can appeal.\n\nThey say no date has yet been fixed for any appeal hearing.\n\nSir Andrew McFarlane, president of the Family Division of the High Court, ruled against Mr McConnell in September.\n\nHe concluded that people who had given birth were legally mothers, regardless of their gender.\n\nLawyer Karen Holden, who represented Mr McConnell and is the founder of A City Law Firm, had said she was disappointed.\n\nA judge ruled against Mr McConnell after a High Court trial in London but lawyers have been given the go-ahead to take his case to the Court of Appeal\n\nShe said Sir Andrew's ruling highlighted how the law was slow 'to keep up to modern society'.\n\nMr McConnell, a multimedia journalist who works for The Guardian, was biologically able to get pregnant and give birth but had legally become a man when the child was born.\n\nA registrar told him that the law required people who give birth to be registered as mothers.\n\nHe took legal action against the General Register Office, which administers the registration of births and deaths in England and Wales.\n\nMr McConnell (pictured in the documentary Seahorse: The Dad Who Gave Birth) was fighting in the High Court to be recognised by the government as the child's father and not mother\n\nMr McConnell was able to give birth naturally, filmed in the documentary Seahorse: The Dad Who Gave Birth having a water birth (pictured in a birthing pool)\n\n'There is a material difference between a person's gender and their status as a parent,' said Sir Andrew, in a ruling.\n\n'Being a \"mother\", whilst hitherto always associated with being female, is the status afforded to a person who undergoes the physical and biological process of carrying a pregnancy and giving birth.\n\n'It is now medically and legally possible for an individual, whose gender is recognised in law as male, to become pregnant and give birth to their child.\n\n'While that person's gender is \"male\", their parental status, which derives from their biological role in giving birth, is that of \"mother\".\n\nMr McConnell started taking testosterone aged 25 and had breast tissue removed a year later, but never had a hysterectomy to remove his uterus because he had not ruled out wanting children.\n\nMr McConnell conceived through IVF treatment after using a sperm donor. He also stopped taking testosterone in a bid to become pregnant.\n\nMr McConnell started his journey to fatherhood in 2016 and had to stop taking testosterone so that he could conceive. On his second attempt Freddy fell pregnant using a sperm donor\n\nLawyers say the child will be the first person born in England and Wales not to legally have a mother if the claim succeeds.\n\nMr McConnell was filmed over three years as part of a documentary.\n\nThe film 'Seahorse: The Dad Who Gave Birth', shows Freddy giving up testosterone so that he is able to conceive and ends up living in gender limbo.\n\nAfter a few months carrying his son, Mr McConnell bemoans: 'If all men got pregnant then pregnancy would be taken so more seriously and talked about.\n\nAfter one failed attempt, Freddy falls pregnant on his second try using a sperm donor and shares the moment with his mum\n\n'F***, it’s f***ing awful. If men had to go through this all the time you would never hear the end of it.'\n\nHe also explains that being filmed for the documentary was much more difficult than he anticipated.\n\n'I think I totally underestimated the difficulty of being on camera and being filmed a lot. I remember thinking “this is really odd I’ll get used to it”, but I never got used to it.'\n\nHe said of his decision to undertake his journey: 'This is a film about me having a baby. But what I feel like I’m going through isn’t me having a baby or pregnancy, it’s a much more fundamental total loss of myself.'", "description": "Freddy McConnell, 32,  from Deal, Kent, wants to be registered as father or parent. He is set to continue his legal battle after lawyers given go-ahead to take his case to the Court of Appeal.", "authors": ["Emily Webber For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/18/20190096-0-image-a-8_1572023258914.jpg", "published_at": "2019-10-25"}