{"pub": "yahoo", "url": "https://finance.yahoo.com/news/1-ecbs-lautenschlaeger-says-resigning-121822575.html", "downloaded_at": "2019-09-27 15:03:01.355687+00:00", "title": "UPDATE 1-ECB's Lautenschlaeger says resigning was best course of action - email", "language": "en", "text": "(Adds context)\n\nFRANKFURT, Sept 26 (Reuters) - Sabine Lautenschlaeger, who said on Wednesday she would quit as a European Central Bank board member, told staff she regretted leaving her post early but thought this was the best course of action given her situation.\n\nHer comments in an internal email sent to ECB staff suggested Lautenschlaeger's decision was probably the result of professional, rather than personal, considerations.\n\nA sceptic regarding the ECB's aggressive stimulus policy under President Mario Draghi, Lautenschlaeger was among nine of 25 ECB policymakers who earlier this month opposed a decision to resume bond purchases in a bid to boost inflation.\n\n\"As you can imagine, it was a very difficult decision for me to take, but I find myself in a situation in which this is the best course of action,\" Lautenschlaeger, Germany's appointee to the ECB's board, said in Wednesday's email, seen by Reuters.\n\nSuggesting her decision had been sudden, Lautenschlaeger acknowledged that her resignation would disrupt the ECB's work, even though she will stay until the end of next month \"in order to leave things in good order\".\n\nShe concluded by thanking staff and expressing regret for her early departure.\n\n\"I have truly enjoyed working with all of you, and I regret that our collaboration is ending earlier than expected,\" Lautenschlaeger added. (Reporting by Francesco Canepa Editing by Alison Williams)", "description": "Sabine Lautenschlaeger, who said on Wednesday she would quit as a European Central Bank board member, told staff she regretted leaving her post early but thought this was the best course of action given her situation.  A sceptic regarding the ECB's aggressive stimulus policy under President Mario", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-09-26"}