{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/home/need-a-house-cleaner-here-are-hiring-tips-to-ensure-your-home-is-both-tidy-and-secure/2019/10/07/d71c6f3e-e489-11e9-b403-f738899982d2_story.html", "downloaded_at": "2019-10-08 15:07:57.245847+00:00", "title": "Need a house cleaner? Here are hiring tips to ensure your home is both tidy and secure.", "language": "en", "text": "“Having a housekeeper is a luxury, but so worth it.” says Dan DiClerico of HomeAdvisor, which connects homeowners with a variety of service professionals. “Living in a clean home is money well spent.” Still, he cautions, “expect to spend time to find the right person.” Here’s how to stop messing around and ensure your house is both clean and secure.\n\nDecide what kind of cleaning service you want. Do you want a professional cleaning service? Or will you be happier with an individual? A professional cleaning company ensures someone always shows up to clean your home. You aren’t responsible for screening employees, handling paperwork or carrying insurance. On the other hand, turnover tends to be high, so you may not get the same crew every time.\n\nAD\n\nAD\n\nHalloween costs can be scary. Here are smart and creative ways to save.\n\nWith an independent cleaner, you can establish a more personal relationship, communicate your needs just once and even negotiate additional services such as child care, folding laundry or letting the dog out. Still, if an individual gets sick and is a no-show, you’re out of luck. And you may need to pay federal and state taxes and carry workmen’s compensation. “In our surveys, we find consumers who employ individuals tend to be more satisfied than those who use cleaning services,” says Kevin Brasler, executive editor at Consumers’ Checkbook (checkbook.org), a D.C.-based independent nonprofit consumer group that evaluates the quality and prices of local services.\n\nGet recommendations. Your best resources are family, friends, neighbors and co-workers. Personal recommendations are really the best way to get a sense of a potential employee’s work ethic, level of responsibility and trustworthiness. Put social media to work by posting on Facebook or Nextdoor. I found my latest housekeeper by asking members of my Pilates class for referrals. One classmate had gone through the same hunt about six months before and found a reliable cleaner who was willing to take on another client.\n\nMake a list of needs in advance. Even if you‘ve had a house cleaner before, now’s the time to evaluate or reevaluate your needs. Perhaps your situation has changed, and you require more or fewer cleanings per month. Perhaps certain rooms need only a quick dusting instead of a full-blown cleaning during each visit. Children and pets might have arrived or departed. Was there something your previous cleaner didn’t do to your liking but didn’t seem worth mentioning? Write it down so you don’t forget to bring it up.\n\nAD\n\nAD\n\nSchedule a meet-and-greet. Whether you’re hiring an individual or a service, you need to meet with the provider for a frank conversation. Ask them to describe what services they do and don’t provide. Spell out your expectations and explain any problems or issues with previous housekeepers. Do a complete room-by-room walk-through. Point out any problem areas. It’s vital that you detail what you are picky about. If you want every knickknack picked up, dusted and put back in place, say so. Ask for references and contact those employers.\n\nStick around for the first few cleanings. “You don’t have to follow them around the house, but this give cleaners the chance to say, ‘This is more than I expected,’ and you the opportunity to make sure they understand what’s important, especially if you have any items you deem precious,” Brasler said.\n\nCalculate the costs. According to Brasler, Checkbook.org estimates that hiring a service to do a weekly cleaning of an average home with an average mess runs $125 to $150 per visit. Some cleaning services are $70 or less and some exceed $250 even in the same market. HomeAdvisor’s estimates the average cost of cleaning a home is $167. DiClerico says self-employed cleaners tend to be cheaper on average, charging $50 to $90 for two hours. Frequency of cleaning is a factor, with some cleaners charging less if they come weekly instead of monthly. And you may pay less if you provide your own cleaning supplies or more if you want the interior of your refrigerator wiped down. Still, don’t be swayed by price alone. “A lower price doesn’t mean lousy work or a higher price equal great work,” Brasler says.\n\nAD\n\nAD\n\nUnderstand what “bonded and insured” really means. Not much. “Services that advertise as bonded mean they have a type of bond that protects the company from theft by employees. It doesn’t protect the homeowner,” Brasler says. Instead, professional services should carry general liability insurance to protect you should the housekeeper accidentally break a window, as well as workers’ compensation insurance. Ask for a copy of the certificate of coverage. A reputable firm will be happy to provide it. If you hire an individual, check with your insurance agent to see if workers’ compensation is part of your homeowner’s policy. If not, it usually costs only a few dollars to add and covers medical care and lost wages should your housekeeper be injured in your home.\n\nRealize trust takes time. Unless you always arrange to be home when your house cleaner arrives, there will come a point when you have to give them keys and/or alarm codes. If you are using a professional service, ask who keeps track of keys and who has access to them. For individuals, you may want to start by leaving a key in a designated “safe” spot for them to use for each cleaning. Eventually there will come a time when you feel comfortable enough giving them their own. DiClerico says some homeowners are using so-called “smart locks” that allow the user to punch a specific code into a keypad or smartphone app to unlock and lock the door. An interesting note: Brasler reports that of all the complaints about house cleaning filed at Checkbook.org, the vast majority are not theft, but showing up late or not showing up at all.\n\nMore from Lifestyle:\n\nWhy installing a smart doorbell might be a clever move\n\nWhat to buy (and not to buy) at the dollar store\n\nKayaks, ukuleles, neckties: The weird and useful things you can check out from local libraries\n\nAD", "description": "Do a lot of work in advance, such as deciding what kind of service you want, calculating costs and making a list of requirements.", "authors": ["Laura Daily"], "top_image": "https://www.washingtonpost.com/resizer/UBvrYucislgVWGItj0IXNvoGSnM=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JSE25LXG24I6TMFGHUBXEG4F54.jpg", "published_at": "2019-10-07"}