{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7597727/Kate-Upton-praises-Houston-Astros-player-husband.html", "downloaded_at": "2019-10-22 13:43:17.699383+00:00", "title": "Kate Upton praises Houston Astros player husband", "language": "en", "text": "The Houston Astros have made it to the World Series for the second time in two years.\n\nAnd delighted Kate Upton took to Instagram to congratulate her husband, pitcher Justin Verlander, on the victory.\n\nThe 27-year-old supermodel Insta-storied a photo of Verlander holding up the team's American League Championship trophy in addition to video footage of the team making the big win.\n\n'WORLD SERIES BOUND!!! So proud of you @justinverlander!! CONGRATS ASTROS!!' Upton captioned a photo of Verlander giving her a mid-air embrace.\n\nWinning: 'WORLD SERIES BOUND!!! So proud of you @justinverlander!! CONGRATS ASTROS!!' Kate Upton captioned this photo of Justin Verlander giving her a mid-air embrace\n\nSmack! Kate Upton took to Instagram to congratulate her husband, pitcher Justin Verlander, on the victory; she is seen after he won Game 5 of the ALDS at Minute Maid Park on October 10\n\n'WORLD SERIES BOUND!!! So proud of you @justinverlander!! CONGRATS ASTROS!!' Upton captioned a photo of Verlander giving her a mid-air embrace.\n\nJust two days before the Astros won Game 6 against the Yankees, Upton took her and Verlander's 11-month-old daughter Genevieve to Game 4 at Yankee Stadium in New York.\n\nGenevieve was decked out in a custom-printed jean jacket that featured Verlander's name and uniform number plus the Astros logo.\n\nJoy: Verlander and Upton took a selfie as the confetti fell\n\nExcitement: Verlander and Upton celebrated with family after the win\n\n'Go Daddy! We are ready for #Game4 !!! #goastros @justinverlander,' Upton captioned the photo of little Genevieve eagerly watching from the stands.\n\nVerlander and Upton wed in Italy on Nov. 4, 2017 only days following Verlander's appearance in the World Series - which scored the team's first-ever MLB championship win against the Los Angeles Dodgers.\n\n'It’s such a crazy dream-come-true moment and two of those happened within a span of a couple days,' Verlander told People in March 2018.\n\nPrecious: Just two days before the Astros won Game 6 against the Yankees, Upton took she and Verlander's 11-month-old daughter Genevieve to Game 4 at Yankee Stadium in New York City\n\n'Two life-changing events happened in the same week; it just doesn’t happen like that too often. As my brother-in-law loves to point out at the wedding, it was pretty much the pinnacle of my life, and now from there, it’s downhill! All in good jest, you know.'\n\n'It was such an amazing week with two things that you can’t beat it,' he added.\n\n'It was the best experience ever, and I don’t take it for granted.'\n\nGame 1 of the 2019 World Series featuring the Houston Astros versus the Washington Nationals air Tuesday at 8 p.m. EST.", "description": "The Houston Astros have made it to the World Series for the second time in two years. And Kate Upton took to Instagram to congratulate her husband, pitcher Justin Verlander, on the victory.", "authors": ["Marisa Okano For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/20/20005748-0-image-a-12_1571686855994.jpg", "published_at": "2019-10-21"}