{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/europe/prime-minister-boris-johnson-accused-of-groping-a-journalist/2019/09/30/96f7a672-e375-11e9-a6e8-8759c5c7f608_story.html", "downloaded_at": "2019-10-01 00:09:20.566350+00:00", "title": "Prime Minister Boris Johnson accused of groping a journalist", "language": "en", "text": "“Untrue,” says 10 Downing Street.\n\nHe’s also accused of abusing his position as mayor of London to grant favorable treatment to a friend, U.S. entrepreneur Jennifer Arcuri.\n\nArcuri, who received thousands of pounds from a government agency that Johnson oversaw, told friends she and Johnson were having an affair, according to British news reports.\n\nAD\n\nJohnson claims to have “no interest to declare” in Arcuri’s firm.\n\nHe has additionally prompted outrage among female lawmakers for seeming to dismiss their suggestion that his martial rhetoric — accusing his opponents of “surrender” — encourages threats against them.\n\nAD\n\nWidower of murdered lawmaker and Boris Johnson’s sister join criticism of prime minister’s language in Brexit debate\n\nOver the weekend, the Sunday Times announced, “On the second anniversary of #MeToo, our new columnist recalls a scandalous encounter with the prime minister.”\n\nThe new columnist is Charlotte Edwardes, and her first column told of how Johnson groped her and another woman at a magazine lunch.\n\nEdwardes described the atmosphere at the Spectator in the late 1990s, when Johnson was editor and she was a contributor.\n\nAD\n\nIt was, she wrote, “essentially a magazine for old Tories, but also a place famous for hiring pneumatic twentysomething interns with posh degrees. No one minds calling these clean-skinned, shiny-eyed girls ‘totty,’ even to their clean-skinned, shiny-eyed faces. They are not Bambis in the forest exactly. They are smoking, drinking, knowing. They witness the back-room mischief of the political classes. Which is fun.”\n\nAD\n\nShe set the mood for the luncheon as “louche, loud, risque.”\n\nEdwardes reported, “Wine is poured; wine is drunk.”\n\nAnd then: “I’m seated on Johnson’s right; on his left is a young woman I know. I can’t remember any Bambis that day. Maybe we were the Bambis. More wine is poured; more wine is drunk. Under the table, I feel Johnson’s hand on my thigh. He gives it a squeeze. His hand is high up my leg and he has enough inner flesh beneath his fingers to make me sit suddenly upright.”\n\nAD\n\nAfter Johnson’s flak-catchers denied the allegations, Edwardes replied on Twitter, “If the prime minister doesn’t recollect the incident then clearly I have a better memory than he does.”\n\nWho is Boris Johnson? His life in photos.\n\nThe allegations about Johnson’s relationship with Arcuri, the U.S. businesswoman, relate to a different period of his life.\n\nArcuri moved to London in 2011 for a one-year MBA degree. Shortly after, she met Johnson — she was 27; he was 47 and mayor of London.\n\nAD\n\nArcuri set up a company called Innotech, which held discussions or “summits” with tech entrepreneurs, politicians and policymakers. The group’s first keynote speaker was Johnson, according to British news reports.\n\nAD\n\nAccording to the Sunday Times, Arcuri’s technology company received thousands of pounds of public money from the mayor’s promotional agency.\n\nArcuri was also invited to join Johnson on three foreign trade missions, to Singapore and Malaysia, New York, and Tel Aviv, despite not being eligible to take part in them, the paper said. On two of the trips, the mayor’s office intervened to ensure she could come, the paper said.\n\nThe paper said she told friends she was having a sexual affair with Johnson, raising questions about a conflict of interest.\n\nOn Friday, the issue was referred to a police watchdog, which is considering whether the prime minister should be investigated for misconduct in public office.\n\nAD\n\nAD\n\nSpeaking on “The Andrew Marr Show” on Sunday, Johnson insisted that “everything was done with full propriety.”\n\nSenior ministers in Johnson’s newly assembled cabinet have been called upon to defend the prime minister.\n\nChancellor Sajid Javid endorsed Johnson’s denials about the Spectator lunch.\n\n“I talked to the prime minister about that, and, first of all, he couldn’t be clearer, absolutely clear, that they are completely untrue, and I totally trust him on that,” Javid told the BBC.\n\nConservative lawmaker Rachel Maclean defended Johnson’s feminist credentials.\n\n“I am a feminist,” she said. “I am proud to say that and I’m proud to be part of a government that is led by a feminist.”\n\nAD\n\nAnother member of Johnson’s cabinet, Matt Hancock, said that he knew the accusing journalist well and described her as “trustworthy.”\n\nAD\n\nSince taking office in July, Johnson has been widely criticized for his use of language in relation to women.\n\nMany thought he crossed a line when he seemed to call Labour leader Jeremy Corbyn a “big girl’s blouse” during his first prime minister’s questions. He also called former prime minister David Cameron a “girly swot” — a schoolboy taunt for overly diligent students — in a leaked cabinet paper.\n\nHis casual dismissal of female lawmakers’ concerns over threats of violence last week also drew widespread criticism.\n\nAD\n\nIn the latest YouGov poll, there was a notable gender gap in terms of Johnson’s likability, with 44 percent of men and 34 percent of women saying they find Johnson “likable.”\n\nMandu Reid, leader of the Women’s Equality Party, said, “Following the example of men like Nigel Farage and Donald Trump, Johnson uses a calculated blend of racism, sexism and buffoonery to appeal to his base and present himself as a populist ‘man of the people.’ This is not only gross, it is also dangerous.”\n\nAD\n\nJohnson’s professional and private relationships have made headlines before.\n\nIn 2004, he was fired from a Conservative Party leadership post after lying about an affair with a Spectator staffer. Johnson, who was married at the time, had originally told reporters the claim was an “inverted pyramid of piffle.”\n\nAD\n\nMore recently, police were called to his home in the summer following a noisy spat he had with his girlfriend, Carrie Symonds.\n\nU.K. Supreme Court rules Prime Minister Boris Johnson suspended Parliament illegally\n\nThe ‘rebel alliance’ teamed up to thwart Boris Johnson’s plans. Can it stay united to steer Brexit?\n\nBoris Johnson has four options to escape his Brexit mess. One of them is to go to jail.\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "description": "Downing Street denies the allegation that he grabbed Charlotte Edwardes’s thigh at a 1999 lunch.", "authors": ["William Booth", "London Bureau Chief", "Karla Adam", "London Correspondent Covering The United Kingdom"], "top_image": "https://www.washingtonpost.com/resizer/KgaMZ6P2Yqfzy3YsibocXvuBdas=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HHLWT4HDSMI6TNAD644ITGMC2I.jpg", "published_at": "2019-09-30"}