{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/11/dutch-court-clears-doctor-in-landmark-euthanasia-t", "downloaded_at": "2019-09-11 13:54:22.897325+00:00", "title": "Dutch court clears doctor in landmark euthanasia trial", "language": "en", "text": "THE HAGUE, Netherlands (AP) - A Dutch doctor was acquitted Wednesday in a landmark trial that prosecutors and physicians hope will help clarify how the country’s 2002 euthanasia law can be applied to people with severe dementia.\n\nThe doctor, who was not named in court, was cleared of any wrongdoing in carrying out euthanasia three years ago on a 74-year-old woman. The patient was given fatal doses of drugs despite some indications she might have changed her mind since declaring in writing that she wanted euthanasia.\n\nThe court ruled that in rare cases of euthanasia that were being performed on patients with severe dementia - and who had earlier made a written request for euthanasia - the doctor “did not have to verify the current desire to die.”\n\nJudges at The Hague District Court ruled that the doctor met all criteria for carrying out euthanasia under the Dutch law legalizing mercy killing by physicians. Applause broke out among the dozens of people who attended the hearing.\n\nThe doctor was accused of not acting with due care because, prosecutors alleged, she made insufficient efforts to find out whether the patient still wanted to die. To carry out the euthanasia, the physician drugged the patient’s coffee without her knowledge and then had family members restrain the woman while delivering the fatal injection.\n\nProsecution spokeswoman Sanne van der Harg said prosecutors would carefully study the judgment before deciding whether to appeal.\n\nSteven Pleiter of the Euthanasia Expertise Center welcomed the verdict.\n\n“It feels good for people in the Netherlands that this is a clear view of the judges and court that it is possible to give euthanasia to a person who is not mentally competent any longer,” he said.\n\nUnder Dutch law, people are eligible for euthanasia if they make a considered, voluntary request for it and if their suffering is hopelessly “unbearable.” Patients can draw up a written request for euthanasia to be performed sometime in the future, in an advance directive, which should specify the conditions determining when they want to be euthanized. Doctors must also seek the advice of at least one other independent physician before killing the patient.\n\nEuthanasia cases among people with advanced dementia are extremely rare; there have been fewer than 20 cases since the procedure was legalized in 2002.\n\n“The most important issue we have to judge as doctors is whether there’s unbearable suffering for the patient,” said Dr. Rene Heman, president of the Royal Dutch Medical Association.\n\nHe said the organization is working on guidelines for how doctors should handle euthanasia cases in people with advanced dementia.\n\n“As a doctor, you need to make sure people don’t change their minds,” he said.\n\nDutch investigators began scrutinizing the case last September, marking the first time a doctor was criminally investigated for euthanasia.\n\nThe 74-year-old woman had renewed her living will about a year before she died, writing that she wanted to be euthanized “whenever I think the time is right.” Later, the patient said several times in response to being asked if she wanted to die: “But not just now, it’s not so bad yet!” according to a report from the Dutch regional euthanasia review committee.\n\nIn announcing the verdict, the court said the patient no longer recognized her own reflection in the mirror.\n\nSuzanne van de Vathorst, an associate professor who specializes in ethics and end-of-life issues at Erasmus University, said euthanizing patients with severe dementia puts a considerable burden on doctors.\n\n“There’s a living, breathing person in front of you who is not aware that you’re performing euthanasia,” she said. “This is a very difficult thing to do and we cannot oblige doctors to do this.”\n\nThe Netherlands is one of five countries that allow doctors to kill patients at their request, and one of two, along with Belgium, that grant the procedure for people with mental illness.\n\nThe trial of a Belgian psychiatrist charged with improperly euthanizing a woman with autism is set to be heard later this year.\n\n___\n\nCheng reported from London.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "A Dutch doctor was acquitted Wednesday in a landmark trial that prosecutors and physicians hope will help clarify how the country's 2002 euthanasia law can be applied to people with severe dementia.", "authors": ["The Washington Times Http", "Mike Corder", "Maria Cheng"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/11/netherlands_euthanasia_23941_c0-229-4032-2579_s1770x1032.jpg?0e2d100522c2e3017e0887cf5d7aa6a6f7829432", "published_at": "2019-09-11"}