{"pub": "yahoo", "url": "https://news.yahoo.com/steve-bannon-pelosi-winning-impeachment-191804353.html", "downloaded_at": "2019-10-28 13:33:55.156003+00:00", "title": "Steve Bannon: Pelosi is ‘Winning’ the Impeachment Battle", "language": "en", "text": "Click here to read the full article.\n\nDuring a Sunday interview with host John Catsimatidis on his New York radio show called “The Answer,” former White House Chief Strategist Steve Bannon said House Speaker Nancy Pelosi is “winning” the battle to impeach President Donald Trump.\n\nBannon says his motives for speaking out are to help fend off impeachment, so he’s promoting a new podcast called “War Room: Impeachment” because “we gotta get organized right now,” Bannon said.\n\nMore from Rolling Stone\n\nBannon told Catsimatidis that he’s been warning Trump supporters that Pelosi “is going to impeach the president of the United States on two counts: one, abuse of power, the other, obstruction of justice.” He added, “Many of the Trump allies, the followers… the deplorables were in shock.”\n\nBannon spoke to the urgency of the matter as he sees it, which is a great tact while promoting a podcast that caters to a cult-like following, saying that Trump supporters “gotta wake up to this process that Nancy Pelosi is running. She’s running the most sophisticated political warfare, the most sophisticated political disinformation campaign, and they’re winning right now. And we gotta get organized right now.”\n\nBannon went on to say that his aim is to “give people the facts and the details of the witnesses, the testimony, the legal arguments” of the impeachment inquiry, with the ultimate goal of making sure Trump is “acquitted.”\n\nBannon went on to say that he called it back in 2018. “As soon as President Trump and Republicans lost control of the House because of Paul Ryan and these feckless House Republicans that did not fight to save the House, we said back then in 2018, that the [Democrats] were going to impeach the president. Well, they are moving for it now.”\n\nIn other Bannon-related news, in November he is expected to to appear as a witness for the government testifying against Trump ally Roger Stone. According to the National Law Journal, Bannon has not been subpoenaed. Stone has been charged with lying to a congress and attempting to “persuade a witness to provide false testimony.”\n\nBest of Rolling Stone\n\nSee where your favorite artists and songs rank on the Rolling Stone Charts.\n\n\n\nSign up for Rolling Stone’s Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.\n\n\n\n", "description": "Trump supporters “gotta get organized right now,” the former White House chief strategist said", "authors": ["Peter Wade"], "top_image": "https://s.yimg.com/uu/api/res/1.2/v9hRKJ_04Y1FgqLOpLCQDg--~B/aD0xMzMzO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/rollingstone.com/980c8728a459d3c305e5f9c2d7b9c31a", "published_at": "2019-10-27"}