{"pub": "breitbart", "url": "https://breitbart.com/national-security/2019/09/30/afghanistan-u-n-taliban-must-join-us-peace-we-continue-fight", "downloaded_at": "2019-10-05 05:57:24.299755+00:00", "title": "Afghanistan at the U.N.: Taliban Must ‘Join Us in Peace'", "language": "en", "text": "National Security Advisor Dr. Hamdullah Mohib of Afghanistan told the U.N. General Assembly on Monday that his country remains committed to becoming a peaceful and stable democracy despite constant attacks from the Taliban.\n\nHe took great encouragement from the Taliban’s inability to sabotage the elections held two days before he spoke, and stressed that a peace plan is still viable if the Taliban is willing to sign off on it.\n\nReading between the lines, Mohib’s address conveyed irritation that the Afghan government has been largely sidelined during talks between the U.S. and the Taliban. He worked to make the case that no agreement reached without the full involvement and agreement of the government in Kabul would be accepted by the Afghan people.\n\nDr. Mohib began his presentation by expressing pride in the elections held in Afghanistan over the weekend, an election whose outcome remained uncertain at the time he spoke.\n\n“Around three million Afghans faced the threat of terrorism and risked their lives to vote in our young democracy’s fourth presidential election. Those who voted included men, women, and the very old – some voting perhaps for the last time – and the very young, those voting for the very first time of many times,” he said.\n\n“We all voted, not just for a president, but we voted for democracy,” he said. “We voted for our constitution. We voted for freedom and sovereignty. We voted for prosperity and connectivity. We voted for peace, and we voted for the Islamic Republic of Afghanistan.”\n\nMohib saluted the professionalism of Afghan security forces for thwarting many of the hundreds of terrorist attacks launched during the election and preventing all of those designed to inflict mass casualties. He thanked “the international community, particularly NATO countries” for standing by his country as it rebuilt and “re-imagined a new Afghanistan based on Islamic values, Afghan traditions, and hope for a permanent escape from our bloody past.”\n\nMohib said Afghanistan has established itself as a stable and battle-tested democracy, but warned, “Uncertainty lies with those who stand in the way of peace.”\n\n“To the Taliban and their foreign sponsors, hear this now, a message from the Afghan people: Join us in peace or we will continue to fight,” he said.\n\nMohib said the current generation of Afghans was “born and raised in war,” and Afghanistan has become a country “driven and defined by the expectations of its youth.”\n\n“No matter the outcome of the presidential elections, one thing is clear: peace is, and will remain, the government’s priority,” he declared, recalling the “unconditional offer of peace” extended to the Taliban last year by incumbent President Ashraf Ghani and the three-day nationwide ceasefire in June 2018 that looked like a hopeful step forward.\n\nMohib credited the women of Afghanistan with being the first to rally around the government’s “roadmap to peace,” recalling how thousands of women were consulted last year to determine “what would be acceptable to them in peace agreements.”\n\n“As we prepare to take the next step in this process, we are committed to the principles of inclusivity, sustainability, and dignity,” he said. “The Afghan people have demanded a cease-fire to immediately stop the bloodshed. They have demanded that talks must happen between Afghans, and they have demanded that the Islamic Republic must be preserved as the foundation of our nation-state.”\n\n“Peace is our common objective and terrorists are our common enemy,” he said as he thanked the international community for its support. “We must not rush the former at the risk of empowering the latter.”\n\nMohib urged:\n\nToday, Afghans fight on the front lines of terrorism so that others can maintain peace in their homes and on their land. But peace is not a permanent state of being. Peace requires care, and constant reappraisal undertaken by partners who share the same values, even as the front lines between war and peace across this globe shift. The terrorists that Afghan soldiers are holding at bay today pose a threat to us all. Terrorism is an idea, as much as it is a form of violence. We must continue to work together to extinguish the ideologies behind terrorism wherever they may exist.\n\nMohib implied that other nations in the region could do more to impede “the flow of terrorist fighters, the recruitment and resources that allow them to remain lethal,” a goal that is often discussed but not always addressed through decisive action.", "description": "National Security Adviser Dr. Hamdullah Mohib says Afghanistan's government remains committed to peace, democracy, and stability.", "authors": ["John Hayward"], "top_image": "https://media.breitbart.com/media/2019/09/GettyImages-1172544867-640x335.png", "published_at": "2019-09-30"}