{"pub": "indiatimes", "url": "https://indiatimes.com/technology/news/jennifer-aniston-s-instagram-debut-with-the-rest-of-the-friends-literally-broke-the-internet-377959.html", "downloaded_at": "2019-10-16 13:44:48.817468+00:00", "title": "Jennifer Aniston's Instagram Debut With The Rest Of The 'Friends' Literally Broke The Internet", "language": "en", "text": "You might have missed it, but Hollywood star Jennifer Aniston joined Instagram earlier today. She made her debut to the platform in style, her first photo being of herself with her 'Friends' co-stars. Unfortunately, it seems Instagram wasn't ready for it at all.\n\nReuters\n\nAniston posted a photo of herself hanging out with Friends co-stars Courteney Cox, Lisa Kudrow, Matt LeBlanc, David Schwimmer and Matthew Perry. The picture was probably one heck of a nostalgia trip for the likely millions of Friends fans out there. They were probably all immediately scrambling to like the photo, comment, and follow Aniston, and it may have overloaded Instagram's servers.\n\n\"We are aware that some people were having issues following Jen's profile,\" an Instagram rep wrote in an email to CNET, after fans began to complain they couldn't follow her on Instagram. \"We are thrilled to have this 'Friend' as part of the Instagram community! As of now, people should be able to access and follow her profile with no problems.\"\n\nDon't Miss 1.4 K SHARES 144 SHARES\n\nAniston took it in her stride, telling one indignant fan that bemoaned not being able to follow her, \"Sorry, I think I broke it.\" At the very least though, the problem was fixed later. Now, less than 24 hours after her debut on Instagram, she's already amassed 7.5 million followers, and all off a single (frankly potato quality) group selfie. And that single post has received over 9 million likes and close to 400,000 comments.\n\nIt's only natural, after all the show was a major global phenomenon. And fans have long-since been clamouring for a reunion, whether onscreen or off. And this photo followed close on the heels of the 25th anniversary of the show back in September this year.\n\nBased on comments to the media, the photo wasn't planned either. All of the cast members just happened to have free time at the same time and gathered at Cox's home for dinner. \"Lightning in a bottle,\" Aniston said", "description": "You might have missed it, but Hollywood star Jennifer Aniston joined Instagram earlier today. She made her debut to the platform in style, her first photo being of herself with her 'Friends' co-stars. Unfortunately, it seems Instagram wasn't ready for it at all.", "authors": ["Gwyn D'Mello"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/jennifer_aniston_1571229456_800x420.jpg", "published_at": "2019-10-16"}