{"pub": "politico", "url": "https://politico.eu/article/the-coming-tug-of-war-european-commission-hearings-parliament-new-commissioners", "downloaded_at": "2019-10-10 03:14:02.240099+00:00", "title": "The coming tug-of-war", "language": "en", "text": "Fight. Fight. Fight!\n\nThe incoming European commissioners, led by President Ursula von der Leyen, will fight climate change. They want to fight to protect the European way of life. They aim to fight the imperialism of big tech companies, to fight for data privacy and against fake news; to fight monopolies, tax fraud, illegal state aid, and corruption. They also want to fight for social protections, especially for workers threatened by globalization, and to fight against nationalism and extremism. And they've pledged to build a new culture of common strategic thinking, so that EU countries can fight security threats — together.\n\nSo much fighting. No wonder Vice President-elect Margrethe Vestager showed up for her confirmation hearing on Tuesday wearing a camouflage dress.\n\nBut with the new team of Commission supremos now sharply in focus, thanks largely to the more than two dozen public hearings over the last two weeks, there is also a clear risk that commissioners could end up fighting each other — for power, for resources, especially over scarce budget funds, for prominence, or even, in the case of those with weaker portfolios, just for relevance.\n\nSuch internal conflicts are par for the course in Brussels, including in the early years of the current Commission, when Günther Oettinger, then commissioner for digital economy and society, clashed with Digital Vice President Andrus Ansip.\n\nThe Parliament has already flexed its newfound muscle by rejecting at least two Commission nominees.\n\nThe new College of Commissioners is not quite set. Sylvie Goulard, the French nominee, is still fighting to win confirmation. And von der Leyen still needs to replace the Romanian and Hungarian nominees, who got knocked out by the European Parliament over concerns about their fitness to serve.\n\nBut it's already clear that von der Leyen's decision to put forward an organizational chart that looks less like a pyramid and more like a scoop of Rotkohl has heightened the risk of friction, given that many commissioners will have overlapping responsibilities, or are tasked with policy objectives that require them to depend on other commissioners to allocate money or provide logistical cooperation.\n\nConsider Frans Timmermans, the Dutch Social Democrat, who will serve as vice president for the Green New Deal. Timmermans is charged with leading the push to make Europe the world's first carbon-neutral continent, and he has already laid out an array of aggressive policy goals. But virtually everything he hopes to accomplish depends on economic and financial policies controlled by the two other executive vice presidents, Valdis Dombrovskis, a conservative, and Vestager, a liberal — not to mention the budget commissioner, Johannes Hahn of Austria, who will also report directly to von der Leyen.\n\nDombrovskis, who has the weird portfolio of \"an economy that works for people,\" will be responsible for the commissioners handling economic and financial affairs; trade; employment; and regional policy. That could leave the former Latvian prime minister struggling for a place in the spotlight with two of his purported subordinates: former Italian Prime Minister Paolo Gentiloni, who will be financial affairs commissioner; and Phil Hogan, the future trade commissioner.\n\nVestager, meanwhile, will likely find her rival in the mirror. During her confirmation hearing on Tuesday, members of the European Parliament repeatedly questioned the Danish competition czar about how she would be able to continue in her current role as the EU's top antitrust enforcer, while simultaneously taking on responsibility for promoting a digital agenda.\n\nPut another way, how will the woman famous for issuing Apple a €13 billion tax bill also be able to work closely with Silicon Valley and encourage entrepreneurs in Europe and around the world to develop the EU's digital sector?\n\nVon der Leyen has said the goal of her circular organizational structure is to promote teamwork. And perhaps it will. But all in all, one-third of the College — nine commissioners — will report directly to the president, putting her very much in the position of having to resolve differences of opinion. And as a rule, the European Commission never runs short of differences of opinion.\n\nEven if von der Leyen is able to build and maintain the Kumbaya Commission, other fights inevitably lie ahead — especially on the inter-institutional front, with the Parliament and with national leaders on the European Council.\n\nThe Parliament has already flexed its newfound muscle by rejecting at least two Commission nominees, and hauling several others over the coals before letting them squeak through. MEPs insist they will continue to exert stronger influence, including by holding von der Leyen to her promise to give them a virtual right of legislative initiative — by taking up proposals favored by a majority in Parliament.\n\nChallenges can also be expected to come from the Council, the traditional check on Commission ambitions. Margaritis Schinas, the soon-to-be vice president for protecting our European way of life, whose portfolio controversially includes migration, will have to find a path equally acceptable to Budapest and Rome, to Athens and Warsaw.\n\nSchinas can't be hugely optimistic given the trouble national ministers gathered in Malta this week had reaching an agreement on how to relocate asylum seekers rescued at sea — never mind accepting a more sweeping proposal from the EU's executive branch on rewriting all asylum and migration rules.\n\nThe migration and asylum portfolio highlights what will likely be the biggest fight confronting not just von der Leyen and the new commissioners but all of Brussels: the fight to come up with new ideas for solving excruciatingly difficult policy problems, and broad political consensus to put those ideas in motion.\n\nClimate\n\nTurning the green goals into reality risks becoming a major jostle for power in the Commission.\n\nTimmermans has the lofty title: first executive vice president for the European Green Deal. But von der Leyen’s two other executive vice presidents actually hold the purse strings.\n\nThe setup means Timmermans lacks control over the economic tools — investment programs, sustainable finance regulation, and the EU budget — to implement his green promises. The commissioners who report to him are also not directly in charge of some of the most crucial policy areas, such as setting up a “Just Transition Fund” fund to help regions weather the low-carbon shift, rewrite energy taxation rules, and implement a carbon border tax — all assigned to commissioners who report to Dombrovskis.\n\nMigration\n\nLeave it to migration to cause potential conflict between Sweden and Greece.\n\nThe Swedish commission nominee, Ylva Johansson, was nicknamed the “come back” commissioner during her confirmation hearing, because of her reluctance to give details about how, in her role overseeing home affairs, she would move the EU forward on migration. Instead, she told MEPs, “I’ll come back to you.”\n\nJohansson will share responsibility for migration policy with Schinas while the EU’s new foreign policy chief, the Spaniard Josep Borrell, is also keen to play a role.\n\nSome EU officials expect the conflict over the issue to be embodied in Johansson, a social democrat, and Schinas, a conservative, with the Greek pressed by his party to prevent migration policy from shifting too far to the left. Johansson will report to Schinas, who until recently was the Commission’s chief spokesman. Schinas may know Brussels better; but Johansson was a three-time government minister.\n\n“I find difficult to see how a minister can respond to a former spokesperson, however talented he is,” said an EU official.\n\nEU Budget\n\nVon der Leyen made a plethora of policy promises after she was unexpectedly nominated to be the EU’s top executive, and her new commissioners in their own hearings reiterated her pledges ranging from the Just Transition Fund for coal-dependent regions to investing funds in a closer partnership with Africa.\n\nBut the new Commission will take office with talks among member states over the 2021-2027 EU budget already in full swing. The governments’ negotiations are based on a 2018 Commission proposal for a budget of €1.134 trillion, which includes cuts to popular spending programs in areas like agriculture and regional development.\n\nBecause the Commission is not expecting any new funding for its proposed policy programs, von der Leyen could end up clashing with the Council — and even her home country, Germany — over which policies should get funding out of the limited pot. Commissioners could also end up competing with one another over as limited funds. If they do, blaming the U.K. will be little consolation.\n\nArtificial Intelligence\n\nRobots are hot.\n\nWhen it comes to artificial intelligence, few of Europe’s incoming commissioners seem to fully understand what they’re talking about — but everyone wants to be involved.\n\nShortly after she was nominated, von der Leyen pledged to push legislation on artificial intelligence within her first 100 days in office. And as AI is a whole set of technologies, affecting virtually every industrial sector, a number of her future commissioners will have to help her deliver on that promise.\n\nAt the forefront, there's Vestager and, potentially, Goulard, who is nominated to oversee the internal market. Others expected to try to get a piece of the AI action include the future health commissioner, Stella Kyriakides, and the future transport commissioner. The initial AI legislation will likely focus on high-risk applications such as medical devices or self-driving cars, which fall under their portfolios.\n\nThere’s also the future justice commissioner, Didier Reynders, who will scrutinize some of the legal ramifications of AI technology. Andfinally Věra Jourová, the vice president for transparency, said during her confirmation that she views it as her responsibility to make sure AI won’t violate the fundamental rights of European citizens.", "description": "Portfolio overlaps in the new European Commission could lead to teamwork — or confusion.", "authors": ["David M. Herszenhorn", "Raoul Ruparel", "Laurens Cerulus"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/10/Conflicting-Interests-310x210-FA-01_feat-1200x628.jpg", "published_at": "2019-10-10"}