{"pub": "bbc", "url": "https://bbc.com/news/uk-politics-49805174", "downloaded_at": "2019-09-24 13:41:48.467653+00:00", "title": "Brexit: Is Labour's policy logical or confusing?", "language": "en", "text": "Image copyright PA Media Image caption Labour delegates voted against composite 13 which would have seen the party backing Remain in any future referendum.\n\nThirteen was lucky for the Labour leader.\n\nTo use the jargon, the 'composite', a plan to force him to campaign straight away to stay in the EU failed.\n\nA vote was taken by a show of hands that the chair of the session wasn't even sure which way it had gone to start with, admitting, \"I thought it was one way, Jennie [the party's general secretary and vital ally of Jeremy Corbyn] said something else.\"\n\nThe chants of 'Oh Jeremy Corbyn' rang out around the room as activists absorbed the result, that they, and most of the unions had got their way after hours of vigorous debate and lobbying even by some of the party's most senior MPs.\n\nThe policy will not, therefore, change.\n\nSo Labour will go into the general election without picking a side in the toxic Brexit debate.\n\nFor the leader's inner circle, that is a perfectly logical position to take - the only way that Labour can appeal to voters on both sides of the argument.\n\nBut to scores of Labour MPs and swathes of the party's members, it is not just a confusing policy to explain on the doorstep but a political mistake for a party whose heart is with Remain.\n\nOne senior figure told me: \"If you need a flow chart to explain your position you are going to lose a general election.\"\n\nThe argument was won today though less on the merits of the neutral policy, but by the way the conversation turned into a test of loyalty to Jeremy Corbyn.\n\n\"Back the leader,\" members cried out from the platform.\n\nHis biggest union backer proclaimed \"I implore you, give him the backing he needs.\"\n\nDuring some moments of the debate it felt not so much a discussion about what the right policy is for the party, or indeed the country, but a contest to see how many delegates would swear allegiance to the leader.\n\nGiven how bumpy the last few days have been there are plenty of people in Brighton who confess privately they are desperately worried about the state of the play.\n\nOne senior member of Mr Corbyn's team told me \"we're in a very bad place.\"\n\nAnother member of the shadow cabinet told me this week the party may as well have \"big arrows above us saying we're going to lose\" saying the leadership is \"bonkers and bunkered\".\n\nThere seem to be precious few Labour MPs actually here this year. Their absence telling.\n\nOf course the view of doom is far from universally shared.\n\nAnother frontbencher said \"it's just all nonsense - once we get into an election it won't even be about Brexit.\"\n\nAnd the delegates here today plainly disagree, backing the leader in that crucial vote.\n\nImage copyright Getty Images Image caption Shadow Brexit secretary Sir Keir Starmer said he was \"disappointed\" by the vote\n\nBut it's worth remembering that most of the members in Brighton this week are part of the Corbyn-backing Momentum campaign group - party insiders estimate as many as 75 per cent are from that side of the party where loyalty to the leader is the order of the day.\n\nSo the vote today was won by Jeremy Corbyn with his effective political fan club and most of the unions.\n\nLabour in Brighton today had to choose between staying in the EU, and sticking with their leader.\n\nThey chose him. But not without controversy, and it has not closed down the arguments over the EU.\n\nAnd the classic choice for political parties is whether to please themselves, or please the wider public to win.", "description": "Labour delegates have voted on a Brexit policy but it has not closed down arguments over the EU.", "authors": ["Laura Kuenssberg", "Political Editor"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/A480/production/_108921124_a61b1650-f67c-4bef-8867-29c7cd33a11d.jpg", "published_at": "2019-09-23"}