{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/18/WS5da91e1da310cf3e355713e9.html", "downloaded_at": "2019-10-18 03:21:53.842811+00:00", "title": "Experts promote public science literacy at forum", "language": "en", "text": "By Zhang Zhihao | China Daily | Updated: 2019-10-18 10:06\n\n[Photo/IC]\n\nExperts at the second World Conference on Science Literacy in Beijing, which concluded on Thursday, called for international science communities to collaborate and promote public science literacy and help achieve the sustainable development goals.\n\nWan Gang, president of the China Association for Science and Technology, said the two-day conference drew more than 600 science communicators and representatives from 28 countries and 35 science institutions worldwide to share their experiences and knowledge and forge a new consensus in improving public science literacy.\n\n\"Global issues that are affecting humanity's sustainable development are becoming more acute,\" he said. \"Improving public science literacy is the basic component of ensuring scientific and technological progress achieving global sustainable development.\"\n\nScientific literacy is often defined as the ability to understand scientific ideas and incorporate scientific methods and thoughts to make better decisions in life.\n\nMarielza Oliveira, director of the UNESCO office in Beijing, said her organization also highly values science communication because strong science literacy among the public can enhance a nation's talent pool and innovative capability, as well as help it achieve its sustainable development goals.\n\nThe world's scientific communities need to work together to promote global science literacy, especially in developing countries, she said. Women and teens are also key target demographics that should be encouraged to learn about - and possibly pursue a career in - science and technology.\n\nIn recent years, China has increased efforts to make science more accessible to the public, particularly in rural and remote regions. Last year, 174 science museums offered free admission, attracting around 48.7 million visitors.\n\nAlso last year, 1,538 vehicles carrying science exhibition packages toured the country. These science communication caravans conducted more than 217,000 science activities and served about 230 million people.\n\nLisa Bailey, senior exhibitions manager of the MOD. science museum at the University of South Australia, said communicating important science ideas to industries and the public is crucial for turning research into products that will have an impact on the world.\n\n\"I believe China expanding scientific outreach with science centers and museums is a good thing,\" she said. \"It allows young people to experience science in an immersive and interactive way.\"\n\nJules Hoffmann, the Nobel laureate in Physiology or Medicine in 2011, said scientists must do more to engage and educate the public about basic research, dispel myths regarding controversial technologies and encourage youth to get interested in science.", "description": "Experts at the second World Conference on Science Literacy in Beijing, which concluded on Thursday, called for international science communities to collaborate and promote public science literacy and help achieve the sustainable development goals.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/18/5da91e1da310cf3e97a1d7df.jpeg", "published_at": "2019-10-18"}