{"pub": "yahoo", "url": "https://sports.yahoo.com/josh-gordon-antonio-brown-figure-100233418.html", "downloaded_at": "2019-09-09 23:22:52.126241+00:00", "title": "Josh Gordon on Antonio Brown: He has to figure out his own way", "language": "en", "text": "Josh Gordon made his return to regular season action on Sunday night and he kicked off the scoring for the Patriots with a 20-yard touchdown in the first quarter.\n\nGordon would go on to catch three passes for 73 yards in his first game since being reinstated from suspension and said after the game that he is “extremely filled with gratitude every day” that he has the chance to play with the team again.\n\nScroll to continue with content Ad\n\nGordon will be welcoming a new addition to the receiving corps on Monday when Antonio Brown‘s signing becomes official. Gordon has had to answer questions about his fit in New England and he was asked about what advice he’d give to Brown about fitting in. He said Brown is “going to have to figure out his own way” and shared what he’s learned from his own experience.\n\n“For me, initially it was a culture shock,” Gordon said. “It was definitely different. I think as I grew in this environment and got to observe other young men move and organize and act professionally, expectations were high. It wasn’t anything more than what I think they knew that they could do was being asked of them. I was like, “Alright, this is the way it’s done here.” I could either get with it, or look for a transition somewhere else. It’s tough, but if this is what you want to do, I think this is the best place to be.”\n\nThe Patriots offense hit the ground running on Sunday night. Brown’s addition could have them moving at light speed as long as he figures things out quickly.", "description": "Josh Gordon made his return to regular season action on Sunday night and he kicked off the scoring for the Patriots with a 20-yard touchdown in the first quarter. Gordon would go on to catch three passes for 73 yards in his first game since being reinstated from suspension and said after the game that", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/FLJLYZBUPe3crfxph6VJwQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/PWaz6SxmmpEqw1CCRLTfEg--~B/aD0zOTY7dz03MDQ7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/profootballtalk.nbcsports.com/88a9422cc65ad52cb977443136fc936f", "published_at": "2019-09-09"}