{"pub": "rt", "url": "https://rt.com/news/471411-us-base-books-bible-flag-syria", "downloaded_at": "2019-10-21 13:19:12.405325+00:00", "title": "‘Come and take it’: Here’s what US troops left behind at abandoned base in Syria (PHOTOS)", "language": "en", "text": "US troops making a hasty retreat from northern Syria left behind a colorful assortment of literature and patriotic paraphernalia, ranging from Harry Potter books to provocative flags.\n\nPhotos from the abandoned US military base in Manbij shed light on what American soldiers did to pass the time during their uninvited stay.\n\nThe photographic evidence suggests that at least one soldier enjoyed reading Harry Potter. For added diversity, the discarded literature also included a Tom Clancy paperback and a Bible.\n\nPax Americana at abandoned Manbij base: Literature edition.\n\n\n\nLet’s be honest, were we expecting any other books except these ones? pic.twitter.com/5ByIAOHVgN — Serge (@Zinvor) October 21, 2019\n\nFor reading-adverse troops, there were also plenty of video games. At least one devoted soldier-gamer had even brought along a map of the fictional city from Grand Theft Auto.\n\nThere were also stacks of DVDs and, in a display of true American-ness, a fridge full of Coca-Cola. Scavengers also found basketballs and footballs at the site.\n\nGamers RISE UP at abandoned American base in Manbij:\n\n\n\n-Rainbow Six Siege\n\n-Call of Duty: Black Ops 3 (featuring: UNO)\n\n-A map of Los Santos, fictional city setting of GTA: San Andreas pic.twitter.com/6wOVCxRE9o — Serge (@Zinvor) October 21, 2019\n\nAn RT crew that filmed inside the deserted base last week found furniture, personal belongings and even an unfinished meals.\n\nAlso on rt.com Left in a hurry: RT films inside abandoned US military base at Manbij, Syria (VIDEOS, PHOTOS)\n\nWhile rushing out the door, the soldiers also apparently forgot to bring their ‘come and take it’ flag, so Russian media came and took pictures with it. Originating from the ancient Greek term ‘molon labe,’ the flag is a symbol of US military defiance, and, in this case, of stinging irony.\n\nRussian Journalist with US molon labe flag at abandoned American base in Syria pic.twitter.com/QMvgkRQJh4 — DoC© (@DocPakistan) October 20, 2019\n\nThey also left behind a rather indecorous greeting to Russia, perhaps to offset the bitterness for the abandoned flag.\n\nThe troops pulled out of the base, located southwest of the northern city of Manbij, last Tuesday. The retreat followed the decision by the US President Donald Trump to withdraw American personnel prior to the Turkish operation against Kurdish-led militias. US forces have since crossed into western Iraq, where they may or may not finish reading all the Harry Potter books.\n\nLike this story? Share it with a friend!", "description": "US troops making a hasty retreat from northern Syria left behind a colorful assortment of literature and patriotic paraphernalia, ranging from Harry Potter books to provocative flags.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5dad7f3a2030274d5d6900c1.JPG", "published_at": "2019-10-21"}