{"pub": "americanconservative", "url": "https://theatlantic.com/magazine/archive/1996/09/home-from-nowhere/376664", "downloaded_at": "2019-10-23 08:28:50.144740+00:00", "title": "Home From Nowhere", "language": "en", "text": "It is no small irony that during the period of America's greatest prosperity, in the decades following the Second World War, we put up almost nothing but the cheapest possible buildings, particularly civic buildings. Compare any richly embellished firehouse or post office built in 1904 with its dreary concrete-box counterpart today. Compare the home of a small-town bank president of the 1890s, with its massive masonry walls and complex roof articulation, with the flimsy home of a 1990s business leader, made of two-by-fours, Sheetrock, and fake fanlight windows. When we were a far less wealthy nation, we built things with the expectation that they would endure. To throw away money (painfully acquired) and effort (painfully expended) on something certain to fall apart in thirty years would have seemed immoral, if not insane, in our great-grandparents' day.\n\nThe buildings our predecessors constructed paid homage to history in their design, including elegant solutions to age-old problems posed by the cycles\n\n\"Home From Nowhere\"\n\nAdditional illustrations by Catherine Johnson\n\nof weather and light, and they paid respect to the future in the sheer expectation that they would endure through the lifetimes of the people who built them. They therefore embodied a sense of chronological connectivity, one of the fundamental patterns of the universe: an understanding that time is a defining dimension of existence -- particularly the existence of living things, such as human beings, who miraculously pass into life and then inevitably pass out of it.\n\nChronological connectivity lends meaning and dignity to our little lives. It charges the present with a vivid validation of our own aliveness. It puts us in touch with the ages and with the eternities, suggesting that we are part of a larger and more significant organism. It even suggests that the larger organism we are part of cares about us, and that, in turn, we should respect ourselves and our fellow creatures and all those who will follow us in time, as those preceding us respected those who followed them. In short, chronological connectivity puts us in touch with the holy. It is at once humbling and exhilarating. I say this as someone who has never followed any formal religious practice. Connection with the past and the future is a pathway that charms us in the direction of sanity and grace.\n\nThe antithesis to this can be seen in the way we have built things since 1945. We reject the past and the future, and this repudiation is manifest in our graceless constructions. Our residential, commercial, and civic buildings are constructed with the fully conscious expectation that they will disintegrate in a few decades. This condition even has a name: \"design life.\" Strip malls and elementary schools have short design lives. They are expected to fall apart in less than fifty years. Since these things are not expected to speak to any era but our own, we seem unwilling to put money or effort into their embellishment. Nor do we care about traditional solutions to the problems of weather and light, because we have technology to mitigate these problems -- namely, central heating and electricity. Thus in many new office buildings the windows don't open. In especially bad buildings, like the average Wal-Mart, windows are dispensed with nearly altogether. This process of disconnection from the past and the future, and from the organic patterns of weather and light, done for the sake of expedience, ends up diminishing us spiritually, impoverishing us socially, and degrading the aggregate set of cultural patterns that we call civilization.", "description": "Can the momentum of sprawl be halted? America's zoning laws, intended to control the baneful effects of industry, have mutated, in the view of one architecture critic, into a system that corrodes civic life, outlaws the human scale, defeats tradition and authenticity, and confounds our yearning for an everyday environment worthy of our affection.", "authors": ["James Howard Kunstler"], "top_image": "https://cdn.theatlantic.com/assets/static/b/theatlantic/img/default-thumbnail.png", "published_at": "1996-09-01"}