{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/a-perfect-mixture-of-summer-and-fall-in-washington-just-in-time-for-vulture-awareness-day/2019/09/07/1477c020-d1d6-11e9-87fa-8501a456c003_story.html", "downloaded_at": "2019-09-08 11:56:08.353635+00:00", "title": "A perfect mixture of summer and fall in Washington, just in time for ‘International Vulture Awareness Day’", "language": "en", "text": "It was a day that seemed to display Washington in its early September best, a glowing Saturday that blended the finest attributes of summer with the crisp pleasures of autumn.\n\nBy amusing coincidence, Saturday was also observed as a day of awareness for a bird with one of the less savory reputations in the avian world.\n\nIn a tweet, the National Zoo took note: “Happy International Vulture Awareness Day!” It was a reminder that the zoo’s collection includes two of the remarkable Rüppell’s griffon vultures.\n\nIf any birds merit recognition for their abilities, it may be those, because, according to the zoo, Rüppell’s griffon vultures have been documented flying above 36,000 feet, surely a worthy achievement.\n\nThe mention of vultures and their day, particularly in a city such as Washington, also prompts thoughts of vultures’ role in one of the best-known political cartoons.\n\nIn 1871, a cartoon by Thomas Nast was published, portraying a New York City political boss and his associates as winged predators who had fed upon the city’s taxpayers. In the drawing, they perch on a crag, awaiting the end of a storm of protest.\n\nIt is captioned “Let Us Prey.”\n\nSaturday in Washington seemed to show not one sign of the devastating storm, Hurricane Dorian, that roared in the Atlantic Ocean for days.\n\nIt was a delightfully dry, sunny, 86-degree day with an average wind speed of less than 7 mph.\n\nRead more:\n\nLocal newsletters: Local headlines (8 a.m.) | Afternoon Buzz (4 p.m.)\n\nLike PostLocal on Facebook | Follow @postlocal on Twitter | Latest local news", "description": "The mention of vultures in such a political city prompts thoughts of a well-known cartoon.", "authors": ["Martin Weil", "Local Reporter", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/2CjPNwqvXHPS_2RpuRTKY-p3eVo=/1484x0/www.washingtonpost.com/pb/resources/img/twp-social-share.png", "published_at": "2019-09-07"}