{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201910082664/market-snapshot-dow-futures-drift-lower-as-lower-level-china-us-trade-negotiations-get-under-way", "downloaded_at": "2019-10-08 11:39:41.938600+00:00", "title": "MARKET SNAPSHOT: Dow Futures Drift Lower As Lower-level China-U.S. Trade Negotiations Get Under Way", "language": "en", "text": "By Mark DeCambre, MarketWatch\n\nThe U.S. put 28 Chinese entities on a blacklist\n\nU.S. stocks on Tuesday were poised to slip for a second session in a row as investors focused on Sino-American trade talks, with the latest developments making it unclear that a grand resolution can be achieved soon.\n\nHow are benchmarks performing?\n\nFutures for the Dow Jones Industrial Average fell 146 points, or 0.5%, to reach 26,296, those for the S&P 500 fell 13.75 points, or 0.5%, to 2,923.75, while Nasdaq-100 futures retreated 35.75 points to reach 7,704.25, a decline of 0.5%.\n\nOn Monday, the Dow fell 95.70 points, or 0.4%, to close at 26,478.02, while the S&P 500 index gave up 13.22 points, or 0.5%, to end at 2,938.79. The Nasdaq Composite Index lost 26.18 points, or 0.3%, to finish at 7,956.29.\n\nWhat's driving the stock market?\n\nWall Street's focus on trade relationships between the U.S. and China have been heightened this week as discussions between lower-level officials, leading to higher-level delegates on Oct. 10-11, are kicking off.\n\nHowever, recent developments this week have made it difficult for investors to anticipate that a sweeping tariff agreement between the world's largest economies can be achieved soon, with a import duties set to be implemented on $250 billion worth of Chinese goods to 30% from 25% set to take effect Oct. 15.\n\nLate Monday, the U.S. blacklisted 28 Chinese companies (link) because of their alleged role in human-rights violations against Muslim minorities ahead of the high-level discussions which will be led by China Vice Premier Liu He on Thursday.\n\nThat said, Chinese commodity buyers have reportedly increased investments in U.S. soybeans, with the Wall Street Journal reporting that \"farm exports, new purchasing deals and prices have all been climbing again in recent weeks.\"\n\n\"It seems that investors are reluctant to assume a clear direction ahead of the high-level trade negotiations between US and Chinese officials on Thursday and Friday,\" wrote Charalambos Pissouros, senior market analyst at brokerage JFD Group.\n\nLooking ahead, investors will be watching data on producer prices, which could help guide economists' and investors' expectations for stubbornly low inflation that has mostly run below the Federal Reserve's 2% annual target.\n\nHow are other markets trading?\n\nThe yield on the 10-year U.S. Treasury note was 1.537% on Tuesday, up from 1.553% late Monday in New York.\n\nGold for December delivery picked up $2.10 an ounce, or 0.1%, to trade at $1,506.50 an ounce on Comex after settling at $1,504.40 on Monday (link).\n\nWest Texas Intermediate crude-oil for November delivery traded up 0.2% at $52.64 a barrel, early Tuesday.\n\nIn Asian trade, Hong Kong's Hang Seng Index rose 0.3% to 25,893.40, the China CSI 300 gained 0.6%, and Japan's Nikkei 225 rose 1%. The Stoxx Europe 600 declined 0.8%.\n\nRelated:European stocks drift lower on China worries and LSE stumbles (link)\n\n(END) Dow Jones Newswires\n\nOctober 08, 2019 06:20 ET (10:20 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-08"}