{"pub": "cbc", "url": "https://cbc.ca/news/canada/saskatoon/ryan-straschnitzki-adidas-humboldt-broncos-1.5302726", "downloaded_at": "2019-10-01 00:11:35.859412+00:00", "title": "'What a role model:' Paralyzed Bronco makes Adidas ad, hall of fame nominee list | CBC News", "language": "en", "text": "An ad shows a serious Ryan Straschnitzki taping up his hockey stick and pulling on an Adidas jersey before he slides away on an ice sled.\n\n\"As a kid I always dreamed of playing for Team Canada ... and I still do,\" Straschnitzki narrates in the commercial.\n\n\"You know, when one door closes, another one opens.\"\n\nThe 20-year-old from Airdrie, Alta., was paralyzed from the chest down after a bus carrying the Humboldt Broncos junior hockey team crashed into a semi truck that ran a stop sign in April 2018.\n\nSixteen people were killed and 13, including Straschnitzki, were injured in the collision in rural Saskatchewan.\n\nShortly after the crash, Straschnitzki made it his goal to join Canada's sledge hockey team and win a gold medal at the Paralympic Games.\n\nHis positive attitude caught the attention of Adidas and he signed a three-year deal with the sportswear company earlier this year.\n\nInitially, Straschnitzki was hired to participate in Adidas Canada's hockey and training campaigns and programs.\n\nBut the 60-second inspirational ad popped up online this week.\n\n\"They did a really good job and made me look good, so I can't complain,\" Straschnitzki told The Canadian Press.\n\n\"I mean, my dad always bugs me I've got a face for radio,\" he said with a laugh.\n\nCanada's Sports Hall of Fame has also shortlisted Straschnitzki and 16 other athletes for its first ever People's Choice Award. The top four will be honoured with trophies at an induction ceremony in Toronto in late October.\n\nCheryl Bernard, the hall of fame's president and an Olympic curling silver medallist, said Straschnitzki was a natural choice because of his resilience, grit and hard work. The attention he has brought to sledge hockey and his message is inspiring.\n\n\"What a role model,\" she said.\n\n\"I'm absolutely certain there's been some horrible nights and days, and I look at what he's done and I don't think I would have it in me. And I think that message is what the public needs to see.\"\n\nTo be inducted into the hall of fame, athletes have to be retired for at least four years, said Bernard. The People's Choice Award is open to current athletes, who are champions of their sports and communities.\n\n\"We are basically starting to build a portfolio of future hall of famers.\"\n\nStraschnitzki said he takes being a role model seriously and has been inspired by wheelchair athlete Rick Hansen, who reached out to him after the bus crash.\n\nTwo weeks ago, Straschnitzki returned to Humboldt for the first time since the collision when the Broncos held their season opener.\n\nStraschnitzki said he also wanted to be there to support former teammate Graysen Cameron of Olds, Alta., who was also injured in the bus crash, as he returned to play with the team.\n\nThere was a sense of relief in being back, Straschnitzki said.\n\n\"It's like nothing has changed. It was the same atmosphere.\n\n\"The town loves to go to the games.\"\n\n", "description": "Ryan Straschnitzki's positive attitude caught the attention of Adidas and he signed a three-year deal with the sportswear company earlier this year.", "authors": [], "top_image": "https://i.cbc.ca/1.4825676.1561686443!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/hko-sask-bus-crash-straschnitzki-20180915.jpg", "published_at": "2019-09-30"}