{"pub": "nyt", "url": "https://nytimes.com/2019/09/20/sports/pac-12-tv-recruiting.html", "downloaded_at": "2019-09-20 22:39:47.657535+00:00", "title": "In Pac-12 Football: Empty Seats, TV Woes and Recruiting Gaps", "language": "en", "text": "That’s how long the Pac-12 will have to wait to see if Scott’s big bet pays off: the decision not to partner with ESPN or Fox in forming the Pac-12 Network (as other conference networks have) while waiting to cash in on a bidding war for all its TV rights when they expire — a battle among not just traditional networks but also newer contenders like Amazon and Google.\n\nOr so the hope goes.\n\nAt the moment, it has been a costly decision. Not only is the conference left with far less money, it also has far lower viewership because cable and satellite companies aren’t compelled by a partner like ESPN or Fox to take the Pac-12 Network as part of a bundle of sports networks. As a result, the Pac-12 Network, which was introduced seven years ago, is in only 18 million homes, less than a third of the audience for the SEC Network and the Big Ten Network, and about half of that for A.C.C. Network, which started in August.\n\n“We determined that we didn’t want to sell the Pac-12 Network — there was anticipation that it would grow — and when the landscape changed, we’d be able to negotiate a better deal and cash in,” Ray Anderson, Arizona State’s athletic director, said. “That’s been a painful wait.”\n\n“If we hit it in 2024, we can reduce the gap significantly,” Anderson added. “That being said, there is frustration that the money isn’t flowing as quickly as it was originally promised.”\n\nAmong the signs of distress: The Pac-12 has begun to seek private equity partners for its network, and Scott has urged the schools to consider occasional 9 a.m. kickoffs for home games beginning next season to take advantage of a national broadcast window on Fox.\n\n“Different people will have different points of view,” Scott said of the early kickoffs. “But I feel like it’s my job to regularly think outside the box.”\n\nTV revenue, Scott said, accounts for 25 percent to 40 percent of university athletic budgets.\n\nIn a conference that prides itself on the breadth of its athletic programs, particularly in the so-called Olympic sports, lower TV revenue translates largely into lower salaries, fewer staff members and fewer resources for the moneymakers: football and men’s basketball.", "description": "The chasm is growing between the Pacific-12 Conference and its Power Five counterparts. And its rescue hopes are pinned on a new TV deal in 2024.", "authors": ["Billy Witz"], "top_image": "https://static01.nyt.com/images/2019/09/20/sports/19subpac-12-print/19pac-12-facebookJumbo.jpg", "published_at": "2019-09-20"}