{"pub": "mirror", "url": "https://mirror.co.uk/news/us-news/man-arrested-after-having-sex-20717014", "downloaded_at": "2019-10-25 00:49:29.752987+00:00", "title": "Man arrested after 'having sex with stuffed Olaf and unicorn in supermarket'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA man was arrested after he was seen having sex with a giant stuffed Olaf and a stuffed unicorn in a supermarket.\n\nCody Christopher Meader is said to have sexually assaulted a pair of “large stuffed animal toys” inside a Target store in Florida.\n\nPolice said they arrested the 20-year-old on a criminal mischief charge, reports The Smoking Gun.\n\nAs detailed in a criminal complaint Meader entered the retailer around 2pm on Tuesday and approached a display of merchandise featuring characters from the Disney film Frozen.\n\nIt is claimed by police that he then selected a “large Olaf stuffed toy” and proceeded to place it on the floor of the Target.\n\nHe then began to 'dry hump' the cinematic snowman, according to a police report.\n\n(Image: Daily Record)\n\nIt is alleged he then returned the tainted Olaf to the display before entering the toy department, where he “selected a large unicorn stuffed animal and began to ‘dry hump’ this item.”\n\nAfter consorting with the stuffed animals, Meader, who lives in St. Petersburg, was detained while still inside the store.\n\nThey said after being read his rights, Meader reportedly “admitted to doing ‘stupid stuff’.\"\n\nPolice say the stuffed items were “removed from the store floor” and destroyed.\n\nAccording to the complaint, Meader’s father told police that “def has a history of this type of behaviour” but it appears he has no criminal history.\n\nHe was charged with criminal mischief and booked into the county jail on the misdemeanour count.\n\nAfter later posting a $150 bond, he was released from custody.", "description": "Cody Christopher Meader, 20,  is said to have sexually assaulted a pair of “large stuffed animal toys” inside a Target store in Florida", "authors": ["Chris Murphy", "Image", "Pinellas County Sheriff'S Office", "Daily Record"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20717102.ece/ALTERNATES/s1200/0_Man-arrested-after-having-sex-with-stuffed-Olaf-and-unicorn-in-supermarket.jpg", "published_at": "2019-10-24"}