{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/tech-stocks-how-uber-lyft-become-profitable-glen-kacher-picks-2019-9", "downloaded_at": "2019-09-27 12:09:04.357086+00:00", "title": "A hedge fund manager who oversees $2 billion lays out the road to profitability for Uber and Lyft — and explains why they have a unique bull case compared to WeWork", "language": "en", "text": "Uber and Lyft have created a duopoly in the US ridesharing market that puts them on the road to profitability, according to Glen Kacher, the chief investment officer and founder of $2 billion Light Street Capital.\n\nKacher juxtaposed their business models with WeWork's to illustrate why they should not be lumped together with other unprofitable tech companies that are tapping the public markets for capital.\n\nClick here for more BI Prime stories.\n\nIt would not be far-fetched to formulate an overarching bear case against the slew of unprofitable companies that are going public.\n\nYou could even invoke the dreaded b-word: bubble. High-profile companies like Uber and Lyft are raising money through initial public offerings this year at the fastest pace since the height of the dotcom boom in 2000, according to Bloomberg data.\n\nPeloton's stumble in its first trading session Thursday — the third-worst mega-IPO debut since the financial crisis — spotlighted these money-losing companies once again.\n\nBut instead of generalizing, Glen Kacher — the chief investment officer and founder of Light Street Capital — would rather study each company's fundamentals to unearth the strong long-term bets.\n\nHe is bullish on two companies that fit the bill of the tech-startup mania: Uber and Lyft. Lyft's stock has tanked 47% since its IPO while Uber has fallen 24%. Uber reported a $5.2 billion loss in the second quarter and Lyft bled $644 million in the same period.\n\nDespite these numbers and the concerns of other investors, Kacher sees a road to profitability for both companies.\n\n\"Yes, absolutely\" was his response when asked to confirm that he was invested in both companies at CNBC's recent Delivering Alpha conference.\n\nHe added: \"We look at ridesharing and say, 'the end market is huge.'\"\n\nRead more: The managing partner of Andreessen Horowitz explains why his firm is investing in a budding technology that 'will be applied in almost every area'\n\nBesides the size of the addressable market, Kacher sees an advantage that other parts of the sharing economy do not have.\n\nTo drive home his point, he singled out WeWork, the shared-office company that was once one of the most valuable startups in the US but had to postpone its IPO after intense scrutiny of its business model and executives.\n\n\"If you rent a room that has five desks for your startup, there's not that much pooling efficiency,\" Kacher said.\n\nHe continued: \"Those five desks are only used by your employees. But in an Uber or a Lyft situation, that car drives around multiple cities in a day and may have 15 or 20 riders ... that's a very unique economic solution as opposed to WeWork that's just carving a floor up into very tiny little spaces.\"\n\nKacher also sees the ridesharing market in the US as a well-oiled duopoly. Led by Uber, both companies are flexing their pricing power and raising fares to try and offset their losses.\n\nLyft is inadvertently benefiting from the fact that Uber is fighting in ridesharing and food-delivery markets outside the US, Kacher said. Lyft is really only playing in \"one and a half markets\" — the US and Canada — but can also improve its margins by following Uber's lead and raising prices, he added.\n\nLight Street, which manages $2 billion in global technology assets, had invested in both firms before they went public. The stakes are worth nearly $137 million, data from regulatory filings compiled by Bloomberg show.", "description": "Led by Uber, they've created a duopoly in the US that puts them on the road to profitability, according to Light Street Capital's Glen Kacher.", "authors": ["Akin Oyedele"], "top_image": "https://image.businessinsider.com/5d8d0aed2e22af6597103085?width=1200&format=jpeg", "published_at": "2019-09-27"}