{"pub": "reuters", "url": "https://uk.reuters.com/article/us-bangladesh-ridesharing/motorbike-ride-sharing-alleviates-dhaka-traffic-chaos-idUKKBN1WC098", "downloaded_at": "2019-09-28 12:06:48.468023+00:00", "title": "Motorbike ride sharing alleviates Dhaka traffic chaos", "language": "en", "text": "(This September 27 story corrects name of Pathao Chief Executive to Hassan M. Elius, not Hassan Melius, in paragraphs 6, 7.)\n\nFILE PHOTO: Vehicles are seen stuck in a heavy traffic after office hours during Ramadan in Dhaka July 7, 2014. REUTERS/Andrew Biraj\n\nBy Rafiqur Rahman\n\nDHAKA (Reuters) - Ride-sharing motorbike services are surging in popularity in the Bangladeshi capital of Dhaka, where nightmare traffic often means that walking is faster than traveling by car or bus.\n\nCongestion in Dhaka, one of the world’s most crowded cities with a population of 20 million, eats up 3.2 million working hours per day, according to a 2017 World Bank study. Average traffic speeds have dropped to 7km per hour from 21km/h over the last decade, only slightly faster than the average walking speed.\n\nThe debut of app-based ride-sharing services in May 2015 has helped to alleviate this problem. These days, service providers like Uber Technologies Inc (UBER.N), Pathao, Shohoz and OBHAI transport hundreds of thousands of people everyday on motorcycles, navigating narrow alleys and congested traffic lanes.\n\n“Sharing a bike ride saves me a lot of time, I can reach anywhere on time,” said Khadija Khan, a private-sector employee who often hitches a bike ride.\n\nThe ride-sharing industry in Bangladesh is worth an estimated 22 billion taka ($260 million) and accounts for about 23% of the transport sector in the country, according to a 2018 study by the Policy Research Institute of Bangladesh (PRI).\n\nLocal motorcycle ride-sharing service Pathao now has over five million users and more than 200,000 registered drivers, according to its chief executive, Hassan M. Elius.\n\n“A trip which previously used to take two hours with uncomfortable rides on rickshaws and buses, now only takes 40 minutes,” Elius said. “That not only saves time but also increases productivity.”\n\nThe advent of motorbike sharing apps is not only providing relief to commuters used to wasting hours in gridlocked traffic, it is also creating employment opportunities for thousands.\n\n“For a young man like me from a low-income family, it is a big source of income,” said student Lokman Hossain, who owns a motorbike.\n\nHowever, unskilled bike drivers and reckless driving are often cited as one of the main reasons for a recent spike in traffic accidents in Bangladesh. More than 4,000 people die in road accidents each year, one of the world’s highest rates.\n\nMassive student protests sparked by the death of two teenagers mowed down by a speeding bus in the capital last July led to street battles and the use of tear gas and rubber bullets by police.\n\nThe following month, the country’s cabinet approved raising the maximum jail sentence for rash driving deaths to five years from three.", "description": "Ride-sharing motorbike services are surging in popularity in the Bangladeshi capital of Dhaka, where nightmare traffic often means that walking is faster than traveling by car or bus.", "authors": ["Rafiqur Rahman", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190927&t=2&i=1434384225&w=1200&r=LYNXMPEF8Q07X", "published_at": "2019-09-28"}