{"pub": "reuters", "url": "https://in.reuters.com/article/cricket-india-corruption/bcci-probes-match-fixing-approaches-in-womens-game-and-regional-league-idINKBN1W20TY", "downloaded_at": "2019-09-17 10:43:18.667378+00:00", "title": "BCCI probes match fixing approaches in women's game and regional league", "language": "en", "text": "NEW DELHI (Reuters) - The Indian cricket board has launched investigations into suspected match fixers who approached a member of the women’s national team and players in a regional Twenty20 league, its anti-corruption head said on Tuesday.\n\nThe shadow of a man falls on a backdrop with the logo of the India's cricket board BCCI before the start of a news conference to announce its cricket team's coach, in Mumbai, August 16, 2019. REUTERS/Francis Mascarenhas/File Photo\n\nA case has been registered against two suspects in Bengaluru after they approached a member of the Indian women’s team, Ajit Singh, the head of the Anti-Corruption Unit at the Board of Control for Cricket in India (BCCI), told Reuters by telephone.\n\n“She was approached before a home series by people who expected her to be part of the India squad and wanted her to play according to their script,” Singh said without identifying the player.\n\n“She asked them to call to another number, recorded the conversation and reported the approach to us,” Singh said.\n\nIn another incident, several players in this year’s Tamil Nadu Premier League (TNPL) were approached by suspected fixers.\n\n“We are trying to find out what their purpose was. They tried to contact through social media. The moment these players realised something was wrong, they cut out the approaches and reported to us,” Singh said.\n\nSingh said no player was being probed.\n\n“I consider it a success of our education programme that in both cases, the players did the right thing by reporting the approaches.\n\nIndian Premier League (IPL), BCCI’s showpiece Twenty20 competition, was blighted by illegal betting with former India paceman Shanthakumaran Sreesanth handed a ban following a spot-fixing scandal in 2013.\n\nThe Chennai and Rajasthan franchises were also subsequently suspended from the IPL for two years after key officials from both teams were found guilty of illegal betting.", "description": "The Indian cricket board has launched investigations into suspected match fixers who approached a member of the women's national team and players in a regional Twenty20 league, its anti-corruption head said on Tuesday.", "authors": ["Amlan Chakraborty", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190917&t=2&i=1430776978&w=1200&r=LYNXMPEF8G0LA", "published_at": "2019-09-17"}