{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7565307/Heavy-rain-winds-lash-Tokyo-strong-typhoon-approaches.html", "downloaded_at": "2019-10-12 07:01:03.550535+00:00", "title": "Heavy rain and winds lash Tokyo as strong typhoon...", "language": "en", "text": "Heavy rain and strong winds have pounded Tokyo as a powerful typhoon forecast as the worst in six decades approached landfall.\n\nTyphoon Hagibis, closing in from the Pacific, brought heavy rainfall in wide areas of Japan ahead of its landfall, including Shizuoka and Mie prefectures, south-west of Tokyo, as well as Chiba to the north, which had suffered power outages and damaged homes from last month’s typhoon.\n\nUnder gloomy skies, a tornado ripped through Chiba on Saturday, overturning a car in the city of Ichihara and killing a man inside, city official Tatsuya Sakamaki said.\n\nThe Isuzu River swollen by Typhoon Hagibis, in Ise, central Japan (Kyodo News via AP)\n\nFive people were also injured when the tornado ripped through a house. Their injuries were not life-threatening, Mr Sakamaki said.\n\nThe rains caused rivers to swell, flipped anchored boats and whipped up sea waters in a dangerous surge along the coast, flooding some residential neighbourhoods and leaving people to wade in ankle-deep waters.\n\nAuthorities also warned of mudslides, common in mountainous Japan.\n\nRugby World Cup matches, concerts and other events have been cancelled. Flights were grounded and train services halted. Authorities acted quickly, with warnings issued earlier this week, including urging people to stay indoors.\n\nThe typhoon that hit the Tokyo region in 1958 left more than 1,200 people dead and a half-million houses flooded.\n\nSome 17,000 police and military troops have been called up, standing ready for rescue operations.\n\nA woman films surging waves as Typhoon Hagibis approaches at a beach in Kumano, Mie prefecture (Toru Hanai/AP)\n\nHagibis, which means “speed” in Filipino, was advancing north-northwestward with maximum sustained winds of 100 miles per hour, according to the Japan Meteorological Agency.\n\nIt was expected to make landfall near Tokyo later on Saturday, unleashing up to 20 inches of rains and then blow out to sea eastward.\n\nEvacuation advisories have been issued for risk areas, including Shimoda city, west of Tokyo.\n\nDozens of evacuation centres were opening in coastal towns, and people were resting on gymnasium floors, saying they hoped their homes were still there after the storm passed.\n\nThe storm has disrupted this nation’s three-day weekend, which includes Sports Day on Monday.\n\nQualifying for a Formula One auto race in Suzuka was pushed to Sunday. The Defence Ministry cut a three-day annual navy review to a single day on Monday.\n\nAll Nippon Airways and Japan Airlines grounded most domestic and international flights scheduled at the Tokyo, Osaka and Nagoya airports.\n\nCentral Japan Railway Co said it will cancel all bullet train service between Tokyo and Osaka except for several early on Saturday trains connecting Nagoya and Osaka. Tokyo Disneyland was closed.\n\nGinza department stores and smaller shops throughout Tokyo shuttered ahead of the typhoon.", "description": "Authorities also warned of mudslides, common in mountainous Japan.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/07/wire-19618776-1570861726-753_636x382.jpg", "published_at": "2019-10-12"}