{"pub": "guardian", "url": "https://theguardian.com/fashion/2019/sep/03/high-heels-and-an-icy-glare-how-the-trump-era-brought-back-dynasty-dressing", "downloaded_at": "2019-09-03 23:43:09.656890+00:00", "title": "High heels and an icy glare: how the Trump era brought back Dynasty dressing", "language": "en", "published_at": "2019-09-03", "text": "What would Alexis Colby wear? This autumn, fashion is embracing the style pioneered by the 80s soap opera – and emulated by the women in the White House\n\nOnce upon a time, the most talked-about family in the US was a collection of narcissists and nepotists, a flash, brash bunch with vast, brittle egos who loved to brag about their wealth and show off their designer wardrobes. They picked high-profile fights with anyone who crossed them and kept a global audience mesmerised with their provocative put-downs.\n\nOK, so the Carringtons didn’t try to buy Greenland or muscle their way into chats with world leaders at the G20. But the lifestyle espoused in the 80s soap opera Dynasty helped create a blueprint – in tone, aesthetic and optics – for the Trump White House. Life has now imitated art.\n\nFacebook Twitter Pinterest Flash and brash ... Krystle Carrington (Linda Evans), Dominique Deveraux (Diahann Carroll) and Alexis Colby (Joan Collins) in Dynasty. Photograph: Bob D’Amico/Walt Disney/Getty Images\n\nBut the reality takes cartoon villainy to lengths that the Dynasty scriptwriters would have baulked at. The Trump era, in which the villains are all too real, has ushered in a misty-eyed nostalgia for Dynasty. Alexis Colby – one eyebrow raised in prelude to some withering comeback, cupid’s bow lipsticked with the precision of a scalpel – is on designer moodboards all over fashion this season.\n\nJoan Collins was recently announced as a poster girl for Charlotte Tilbury’s Airbrush Flawless foundation. There are 12 models in the main campaign image – including Miss Fame from RuPaul’s Drag Race, Tilbury herself, the usual gorgeous twentysomethings and the YouTuber Em Ford – but only one star. The other 11 wear spaghetti-strap slips and the odd understated piece of jewellery; Collins wears a ruched satin gown with sparkling embroidery and enormous diamond earrings. Her hair is styled in the same gravity-defying hot-brushed waves that she wore as Alexis in the 80s.\n\nAt the age of 86, Collins is enjoying a fashion renaissance. Last year, she starred in a campaign for Kurt Geiger. Photographed in a pair of the brand’s towering, lipstick-red high heels, she recalled that one of her favourite Dynasty outfits was “the grey silk jersey wrap dress worn with a fur cape trimmed with grey fox and a matching hat and boots”. (Note how at home that look would be in Melania Trump’s wardrobe.)\n\nCollins has deliberately blurred her real life with that of the fictional Alexis, because she knows that owning the Dynasty slot awards her prime airtime in popular culture. This year, she attended the camp-themed Met Gala wearing an all-white, feather trimmed Valentino gown with diamond tiara, collar and earrings. On Twitter, she explained that she had come as herself, captioning her look: “I’m Alexis Morell Carrington Colby Dexter Rowan.” Talking about yourself in the third person, with a bombastic embrace of ego? Alexis is very, very 2019.\n\nFacebook Twitter Pinterest Glam dram ... Moschino’s autumn ad campaign, created by Jeremy Scott and Steven Meisel and starring Gigi Hadid, Joan Smalls and Irina Shayk. Photograph: Moschino\n\nJeremy Scott, Moschino’s creative director, has an infallible instinct for the zeitgeist. (At the VMAs last week, he dressed Lizzo, the woman of the hour, in a floor-length red sequin gown with “SIREN” emblazoned in capital letters.) Alongside the veteran photographer Steven Meisel, he created a homage to Dynasty – starring the models Gigi Hadid, Joan Smalls and Irina Shayk – for Moschino’s autumn advertising campaign. The models wear tiny cocktail dresses and enormous fur coats with a thick frosting of diamonds. In one scene, Smalls sprays the contents of her martini over a shagpile carpet as she flounces up from a white chaise longue with a hip-swinging swagger. Shayk wields a champagne bottle as a weapon, while Hadid’s impressively voluminous yet chaotically side-swept bouffant suggests she got caught up in a catfight in an upscale hair salon.\n\nDynasty represents “the power of television” in fashion, Scott has said. He credits the producer Aaron Spelling and the costume designer Nolan Miller with shaping “so much of our American, and ultimately world, view of glamour”. Like Killing Eve and Stranger Things in this decade, Dynasty used fashion to help make itself unmissable viewing.\n\nFacebook Twitter Pinterest Undeniably Alexis ... a luxe charcoal-wool tailored coat at Saint Laurent’s autumn/winter 2019 show. Photograph: Yanshan Zhang/Getty Images\n\nSaint Laurent’s autumn/winter catwalk show in Paris in February opened with a luxe charcoal-wool tailored coat with vast power shoulders, which framed a plunging, cleavage-focused wisp of black organza worn beneath. In its overtly sexualised boardroom power-dressing, it was undeniably Alexis. At Alessandra Rich – the designer where every young socialite buys her gowns these days – high-shine eveningwear comes with high hemlines and belts as wide and glittering as any worn in the boxing ring. Escada’s new campaign – featuring Rita Ora in head-to-toe ice-white tailoring finished with rows of gold buttons, backcombed hair and a cool, icy glare – is pure Dynasty. Zara has a blazer-dress in a bombastically loud poppy print, with a matching belt, for £99.99. Of course, charity and secondhand stores have long been a rich hunting ground for Dynasty-chic: look for shiny fabrics, gathered shoulders, brooch-detailing and black-and-white graphics.\n\nBut Dynasty fashion is as much about the mood music it brings as it is about a look. Both Melania and Ivanka Trump are power-dressers who weaponise their femininity. Their wardrobes for the state visit to the UK in June were lavish, with hourglass tailoring, high heels and a penchant for snowy white: all tropes that the Colby and Carrington women embraced on screen, back when the dynasty in question was a fantasy.\n\nDespite the butter-wouldn’t-melt, all-white looks, the embrace of the Dynasty aesthetic in the real world represents our willingness to play the bad guy. What made Alexis and her co-stars so compelling was their unabashed embrace of ego, their refusal to play nice. In Dynasty, the bad guys didn’t just get the best lines; they got the best of everything. Contrary to narrative traditions, this was a show in which the good guys did not necessarily triumph. So, it is more than a little alarming to find it so resonant today.\n\nBut hey, it made for good television. And, more importantly, it makes for some great fashion.", "description": "What would Alexis Colby wear? This autumn, fashion is embracing the style pioneered by the 80s soap opera – and emulated by the women in the White House", "authors": ["Jess Cartner-Morley"], "top_image": "https://i.guim.co.uk/img/media/aa0a9cb6bcaaf78e2101c310e3178961b5cc8c1f/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a63a48f08a65ef82281ffc57fcd09499"}