{"pub": "independent", "url": "https://independent.co.uk/independentpremium/neom-nicola-elliott-wellness-branding-business-analysis-a9101376.html", "downloaded_at": "2019-09-15 00:16:02.497292+00:00", "title": "View from the top: Neom founder Nicola Elliott", "language": "en", "text": "Neom is widely recognised as one of UK’s first and fastest growing wellbeing brands, with retail sales of over £25m in 2019 - but founder and Creative Director Nicola Elliott is still amazed to see how far her co-creation has come. “I still feel surprised that people know what Neom is, let alone buy our products” she told the Independent with understandable pride.\n\nMs Elliott and her partner Olivier Mennell launched Neom in 2005, running it from her flat. “Neom wasn’t a zero-to-hero success, we really built it brick by brick. I think anyone starting their own business have to be prepared for a long journey. It definitely took longer than I thought It would, but we now have a very steady brand with a strong following.” In fact, when she started shipping orders for her Neom candles - the brand’s first products - Ms Elliott had a strict rule. Less than five candles sold meant she had to take the bus from her flat to the post office; five or more meant she would allow herself to take a cab and put that in the company’s expenses.\n\nFourteen years later, Neom is a multi-channel business with close to 100 employee. Its home fragrance and skincare ranges are sold through leading UK department stores such as John Lewis and Selfridges. It also has a thriving online business and four of its own retail stores - two in London, one in Leeds and one in Guildford.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nSo what’s the secret of the brand’s success? “There was confidence and a clear vision of where we wanted to go with the brand from the beginning and you have to have that. You also need to be original and true to your vision - I think that’s what got us this far. If you keep telling your story, and if you are genuine from the very start, people will buy into it.'' Creating the brand and the story behind its products, is the creative part of the business that Ms Elliott, a former journalist and editor, enjoys the most.\n\nIf you keep telling your story, and if you are genuine from the very start, people will buy into it.\n\nWhile studying, Ms Elliott went through nine work placements and worked at glossie magazines such as Heat, InStyle and Marie Claire before becoming an editor at Glamour. “From an early age I always thought I would be a journalist. In many ways it was my dream job. But at the time I was working a hectic 60 hours a week, the lack of sleep and stress started taking a toll on my health and it was the same for the colleagues around me.” This inspired Ms Elliott to train as an aromatherapist after work. In parallel to her job she started creating therapeutic treatments by blending essential oils for her friends and her boyfriend. Not only did she develop a passion and interest for the wellbeing industry but It also made her feel better.\n\nWhen it comes to finding a business partner Ms Elliott thinks the most important thing is to look for somebody who’s got the skills set that you haven’t got.\n\nThe day before she decided to make her career switch she got a job offer for an editor-in-chief's position at a magazine that has since folded. “It was exciting and twice the salary that I was on, so I rang my father to share the news and there was just silence. He said ‘if you take this job you’ll always be working for someone else and that will be your path’.”\n\nInstead Ms Elliott quit her job at Glamour and partnered up with Olivier Mennell, an old family friend, who was working as a private equity analyst. “It was a leap of faith but I was 28, I had no children and I had that confidence that comes from being young, when you don’t have that much too lose.'' Together the pair came up with the name Neom by merging their initials and created their first batch of their product with £15,000. “I had an old car that I managed to sell for £7000 and Oliver won £8,000 in a game show, so we used that money to create our first five candles,” Ms Elliott said.\n\nWhen it comes to finding a business partner Ms Elliott thinks the most important thing is to look for somebody who’s got the skills set that you haven’t got. “If you're trying to build a business, Choose a partner who has complementary skills to you. I always took care of the creative side at Neom. My role is to bring the brand to life so people can get involve in it and fall in love with it. Oliver typically takes care of the financial and operational side of the business”\n\nIn our stressful world, the wellness industry which includes nutrition, fitness, cosmetics and more, is now worth £4.2 trillion worldwide, according to the Global Wellness Institute. So how can Neom standout in an over-saturated market? “When we launched there was hardly anyone in the market. I had to go around training people about the difference between an organic carrot and a normal carrot. That education part was taking up a lot of my time, so in a way it is easier now even though it's more competitive.“\n\nAll Neom products are made in Britain, from ethically sourced and sustainable origins and use only natural, organic ingredients and no artificial perfumes. It’s particular relevant today following Michael Gove’s annoucement earlier this year that scented candles ought to be banned, due to their chemical compounds which unbeknown to many can be extremely toxic. Ms Elliott said: “This is a problem that Neom has always sought to combat and is why all of our candles are hand-poured in the UK and made from sustainably sourced 100 per cent natural vegetable waxes and essential oils.”\n\n“Neom also always aimed to inspire people to improve their wellbeing, we wanted to create a lifestyle, not just pretty candles in a nice box. That’s why almost all of our blends have a story and they’re based on real people and the issues they had. For example, my Energy Boost collection was blended for my husband, a PE teacher who needed an energy kick after a day of playing football.”\n\nWe wanted to create a lifestyle, not just pretty candles in a nice box. That’s why almost all of our blends have a story and they’re based on real people and the issues they had.\n\nMs Elliott, who is now a mother-of-two says juggling motherhood with running a business can be challenging: “I am lucky to have a really supportive husband and we share all our parenting responsibilities 50/50. I also find it a bit easier now that my kids are bit older, but of course I still get it wrong a lot. ”It’s this whole concept of balance, as woman, you need to cut yourself some slack and do what you can.I don't always succeed, I suppose like many other working women but we have to be less harsh on ourselves when we fail. We also need to find time for yourself, even little moments for your own mental health”\n\nA massive reader, Ms Elliot says getting into a warm bath and reading a book helps her take the stress away before going to bed. She is also applying Neom's core business values at home by sharing her passion and tips with her daughter Alexa: “I really want her to understand the benefits of using natural products and to know what she’s putting her on her skin. I want her to understand the benefits of Vitamin D or what are the properties of grape seed oil. Thankfully, she’s really into it.”", "description": "Neom is widely recognised as one of UK’s first and fastest growing wellbeing brands, with retail sales of over £25m in 2019 - but founder and Creative Director Nicola Elliott is still amazed to see how far her co-creation has come. “I still feel surprised that people know what Neom is, let alone buy our products” she told the Independent with understandable pride.", "authors": ["Zlata Rodionova"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/11/15/neom-wellbeing.jpg", "published_at": "2019-09-14"}