{"pub": "cbc", "url": "https://cbc.ca/news/health/vaping-illness-cdc-1.5295811", "downloaded_at": "2019-09-25 04:37:12.439892+00:00", "title": "U.S. CDC expects hundreds more cases of vaping-related illness | CBC News", "language": "en", "text": "Hundreds more Americans have been sickened by a severe vaping-related illness, with the official tally set to be updated on Thursday, according to a U.S. health official speaking at a congressional hearing on Tuesday.\n\nThe House of Representatives began public hearings this week about the mystery vaping-related lung disease that, as of last week, had sickened 530 people in 38 states. The illness has claimed nine lives.\n\n\"We believe that probably hundreds more [cases] have come in since the numbers we released last week,\" said Anne Schuchat, principal deputy director of the Centers for Disease Control (CDC).\n\nShe noted that latest-generation vaping devices use \"nicotine salts\" that boost the amount of the addictive substance that reaches the brain, presenting a particular risk to younger consumers, whose brains are still developing.\n\n\"It feels like that's kind of vaping on steroids,\" said Representative Raja Krishnamoorthi, chairman of the subcommittee on economic and consumer policy, as he called for further investigation.\n\nCDC principal deputy secretary Dr. Anne Schuchat speaks before a House oversight subcommittee hearing on lung disease and e-cigarettes in Washington on Tuesday. (Andrew Harnik/The Associated Press)\n\nSchuchat emphasized that the CDC has still not identified any specific product or compound — including tetrahydrocannabinol (THC), the high-inducing component of marijuana, or Vitamin E acetate — that is linked to all cases of the illness.\n\nThe CDC, which has activated its emergency operations centre to co-ordinate an investigation, has advised that people quit vaping if they can. Canadian health officials have given the same advice.\n\n\"I think based on what we're seeing in the U.S, it's something that we're very concerned about and that we need to make a concerted effort across Canada to put together reporting and monitoring system so that we can see if this issue is impacting Canadians,\" Dr. Theresa Tam, Canada's chief public health officer, said Monday on CBC's Power & Politics.\n\nTam said Health Canada's voluntary database of consumer device incidents includes three reports from two provinces, including one from London-Middlesex and one dating back to 2018.\n\nProvinces need to gather more information to determine if the reports could be cases, Tam said.\n\n\"Everything that we're doing in public health and in the regulatory domain should be about preventing youth who have previously not smoked, not vaped, not go into vaping because vaping is not without harm,\" she said.\n\nDr. Bonnie Henry, British Columbia's provincial health officer, said last week B.C. has no suspected or confirmed cases. She's aware of one report under investigation.\n\nA man over age 50 who used e-cigarettes died in Kansas as state health officials prepared to join the waves of experts testifying before Congress on Wednesday, Kansas Governor Laura Kelly announced.\n\n\"Today, I am saddened to announce the death of a second Kansan in association with this outbreak,\" the governor said in a statement, noting the man had underlying medical conditions.\n\nAt Tuesday's subcommittee hearing, Dr. Ngozi Ezike of the Illinois Department of Public Health urged Congress to ban flavoured vaping products, \"which are particularly targeted to young people.\"\n\nOn Wednesday, the acting commissioner of the Food and Drug Administration will appear before a House energy and commerce subcommittee and be asked about the public health threats of e-cigarettes.\n\nMassachusetts declares emergency\n\nFor those who continue vaping, public health officials urge consumers to avoid buying vaping products on the street, using marijuana-derived oil with the products or modifying a store-bought vape product.\n\nThe governor of Massachusetts declared a public health emergency on Tuesday and ordered a four-month ban on the sale of vaping products in the state.\n\nThe state will block all sales of e-cigarettes and supplies, both those used for tobacco and marijuana, which is legal in the state, Republican Governor Charlie Baker and state officials told a news conference.\n\nConvenience store owners who rely on the foot traffic brought in by the sale of vaping products are going to be concerned by the decision, said Jon Hurst, president of the Retailers Association of Massachusetts.\n\n\n\n\"There are clearly some issues there. The question is, what's the problem? Is it the product being sold on the shelves by companies like Juul, or is it the off-brand stuff coming from other countries and sold on the internet?\" Hurst said. \"I hope we can all work together and find out what is the problem and find a solution soon.\"\n\nAs of Tuesday, 61 cases of potential cases of lung disease related to the use of electronic cigarettes and vaping in Massachusetts have been reported to the state.\n\nThe move goes further than New York state and Michigan, which this month banned the sale of flavoured vaping products, out of concern that those products appeal to children.\n\nThe ban took immediate effect and will last through Jan. 25, officials said.", "description": "CDC believes probably hundreds more cases of vaping-related illness have come in since last week's numbers.", "authors": ["Thomson Reuters"], "top_image": "https://i.cbc.ca/1.5295835.1569356125!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/vaping-illness-massachusetts.jpg", "published_at": "2019-09-24"}