{"pub": "businessinsider", "url": "https://businessinsider.com/opening-bell-september-18-2019-9", "downloaded_at": "2019-09-18 12:51:47.996475+00:00", "title": "10 things you need to know before the opening bell", "language": "en", "text": "Associated Press\n\nHere is what you need to know.\n\n1. Today is Fed day and markets are looking quiet ahead of an expected rate cut. \"How many more are there to come?\" one analyst asked of Fed cuts to interest rates.\n\n2. WeWork CEO Adam Neumann told employees he's 'humbled' by the collapse of the firm's IPO. The boss reportedly regretted how the process was handled, and said he has lessons to learn about running a public company.\n\n3. The EU accuses Boris Johnson of only 'pretending' to negotiate a Brexit deal. Johnson's negotiators have so far only presented the EU with a draft of the withdrawal agreement with the backstop scrubbed out.\n\n4. South Korea ramped up its trade war with Japan by making it 3 times harder for companies to export goods there. Japan had already downgraded South Korea's status as a trading partner.\n\n5. China could be the biggest loser from the Saudi Arabia oil attack. An expert told Business Insider that China has been one of the largest buyers of Saudi oil since 2009, and could be hurt by a halt to the country's oil exports.\n\n6. India bans e-cigarettes in a setback for Juul and Philip Morris. Finance Minister Nirmala Sitharaman told a media briefing that an executive order will be passed to ban the products, which the government believes will advance its tobacco-control efforts.\n\n7. Saudi Arabia promises 'material evidence' linking Iran to oil attack. Tehran has denied involvement in the September 14 attacks on oil plants, including the world's biggest crude processing facility, that initially knocked out half of Saudi Arabia's production.\n\n8. Stocks are muted on Wednesday morning. S&P 500 and Nasdaq futures are both down (-0.2%). In Europe, the Dax (+0.1%) opened higher as did the Euro Stoxx 50 (+0.2%). In Asia, the Nikkei (-0.2%) closed lower as did the Hang Seng (-0.1%) but the Shanghai Composite (+0.3%) rose.\n\n9. There is a stack of earnings out today. General Mills releases its earnings later and Kingfisher published its results this morning.\n\n10. Today is Fed day and market watchers are waiting to see if the central bank announces a rate cut. Data on housing will also be released later.", "description": "Here is what you need to know.  1. Today is Fed day and markets are looking quiet ahead of an expected rate cut. 'How many more are there to come?' on...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d82033b2e22af638615b7c2-2400/aee55122667b40f78657a293ba2c83dc.jpg", "published_at": "2019-09-18"}