{"pub": "yahoo", "url": "https://yahoo.com/entertainment/maddison-brown-said-she-apos-220646001.html", "downloaded_at": "2019-10-12 07:00:47.751560+00:00", "title": "Maddison Brown Said She'd Be 'Too Insecure' to Marry a Hemsworth 4 Months Before Being Spotted With Liam", "language": "en", "text": "Maddison Brown has been a Liam Hemsworth admirer for a while.\n\nThe Dynasty actress, who was recently spotted with the Australian actor, made an appearance on the Zach Sang Show in June, where she revealed that she would be too \"insecure\" to marry a Hemsworth brother.\n\nDuring her interview with the show's co-star, Liz Gillies, Brown, 22, played a game of \"F, Marry, Kill\" which involved Australian stars Hugh Jackman, Liam and Chris Hemsworth as a package deal, and Margot Robbie. Prior to answering, Maddison -- an Aussie herself -- was very vocal about her interest in Liam.\n\nMaddison eventually decided that she would kill Hugh, marry Margot and \"F\" the Hemsworth brothers. \"I would f**k the Hemsworth brothers, but at the same time, both of them,\" she jokingly said, adding, \"I couldn't marry them. I'm too insecure. I would be like, 'You're too attractive. You are never allowed to leave the house.'\"\n\nNow almost four months later, Maddison and Liam were snapped holding hands on Thursday in New York City. The two also enjoyed a meal at Sant Ambroeus restaurant and rode the subway together.\n\nMaddison's outing with Liam marks the first time the Hunger Games star has been spotted showing PDA with another woman since his split from 26-year-old Miley Cyrus in August. He officially filed for divorce from Miley on Aug. 21 after she was snapped kissing Brody Jenner's ex, Kaitlynn Carter, during a trip to Italy in pictures obtained by ET.\n\nSee more on Maddison and Liam's recent outing in the video above.\n\nRELATED CONTENT:\n\nLiam Hemsworth Seen Holding Hands With 'Dynasty' Star Maddison Brown\n\nWhy Fans Think Miley Cyrus Is Shading Liam Hemsworth in 'Don't Call Me Angel' Music Video\n\nLiam Hemsworth Is All Smiles While Vacationing With Family After Miley Cyrus Split\n\nRelated Articles:\n\n\n\n", "description": "The actress' comments came before she was spotted holding hands with Liam this week.", "authors": ["Liz Calvario"], "top_image": "https://s.yimg.com/uu/api/res/1.2/reP4DP4mD9UMBl2Q49zzOg--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/homerun/etonline.tv/8f73b31a8bdc9721f93491289248707d", "published_at": "2019-10-12"}