{"pub": "cbc", "url": "https://cbc.ca/news/world/bahamas-dorian-damage-1.5275344", "downloaded_at": "2019-09-08 23:28:07.510292+00:00", "title": "Rebuilding a struggle on Bahamas island smashed by hurricane | CBC News", "language": "en", "text": "The streets are filled with smashed cars, snapped power cables, shattered trees and deep silence.\n\nAt the airport and dock, hundreds of people clamour for seats on airplanes and berths on ships arriving with aid and departing with people who lost their homes when deadly Hurricane Dorian struck the Bahamas.\n\nNearly a week after disaster roared in from the sea, the rest of Marsh Harbour on Abaco Island felt empty Saturday. A hot wind whistled through stands of decapitated pine trees and homes that collapsed during the most powerful hurricane in the northwestern Bahamas' recorded history.\n\nRescue teams were still trying to reach some Bahamian communities isolated by floodwaters and debris after the disaster that killed at least 44 people.\n\nThe U.S. Coast Guard said it has rescued a total of 290 people in the northern Bahamas following the hurricane. Six MH-60 Jayhawk helicopters and nine cutters are helping in the aid effort, while the government of the Bahamas says more than 900 members of the Bahamian police and military are on Abaco and Grand Bahama islands to help with hurricane relief.\n\nMilitary personnel drive past damage in the wake of Hurricane Dorian in Marsh Harbour. (Loren Elliot/Reuters)\n\nThe government also says 120 Jamaican security personnel arrived in the Bahamas on Saturday evening, and 100 troops from Trinidad and Tobago are to arrive Sunday as part of the aid effort in the wake of Hurricane Dorian.\n\nDue to the considerable air traffic, Bahamaian officials banned non-aid flights over the Abaco and Grand Bahama islands. The National Emergency Management agency also threatened to revoke flight permission from any pilots charging fees to fly people from the islands.\n\nThe struggle to stay\n\nNo official figures were available, but much of the population of Marsh Harbour, home to most of the roughly 20,000 residents of Abaco, seemed to have already left. Many were staying with relatives in the capital, Nassau, others with family in Florida and other parts of the United States.\n\nIn Marsh Harbour's Murphy Town neighbourhood, on a hill overlooking the azure sea, Jackson Blatch and his son-in-law were already rebuilding. In a blazing midday sun they stripped damaged shingles from Blatch's roofs and tossed them into his truck, parked below the eaves of a home he built by hand.\n\nLike a few other Abaco residents, Blatch is staying on an island pulverized by nature.\n\n\"Everybody says, 'Leave.' Leave and go where?\" Blatch asked. \"My plan is to rebuild this island. I have a lot to offer.\"\n\nJackson Blatch starts repairs on the roof of his home in Marsh Harbour. Many in his neighbourhood have been forced to leave. (Fernando Llano/The Associated Press)\n\nBlatch has power from a generator, drinking water, food and the help of his son-in-law, 25-year-old Moses Monestine.\n\n\"I don't have a mortgage. I don't want to go to Nassau,\" he said. \"I don't want to go to the United States. I don't want to depend on anyone.\"\n\nThough Blatch is determined to stay, many others have chosen to leave, catching rescue flights to Nassau. A week after the hurricane plowed into the archipelago nation of 400,000 people, the capital city faced a wave of thousands of evacuees fleeing such hard-hit areas as Marsh Harbour, where some 90 per cent of the infrastructure is damaged or destroyed.\n\nAbaco resident Bernard Forbes evacuates the island with the help of Global Support and Development personnel. (Loren Elliott/Reuters)\n\nThere are roughly 70,000 people in need of food and shelter, according to the United Nations World Food Program's estimate. Interviews with evacuees this week shone light on the extent of Dorian's destruction. Survivors avoided death, but have lost homes, jobs and hospitals.\n\n\"Home is more than four walls and a roof — it's the neighbourhood where people live, their friends and neighbours, their livelihoods, comfort, and security for the future. Losing all these things at once is heartbreaking,\" said Jenelle Eli, a spokeswoman for the American Red Cross, which is helping with the relief.\n\n\"People are concerned about their next step, but also how they'll earn an income and what their lives will look like in the future.\"\n\nBahamian officials acknowledged on Saturday that Nassau will strain to house all the people that need shelter.\n\nMore aid needed\n\nThe Red Cross said it had committed an initial $2.6 million to help, and Norwegian energy company Equinor said on Sunday it will clean up an onshore oil spill discovered this week at its Bahamas storage terminal.\n\nMeanwhile, the United Nations said eight tonnes of food supplies were on the way by ship. Some 14,700 ready-to-eat meals as well as logistical and telecommunications equipment are being delivered, said Herve Verhoosel, spokesman for the World Food Programme.\n\n\"The needs remain enormous,\" Verhoosel said.\n\nMany in Marsh Harbour echo that claim, and complain aid has been too slow in arriving.\n\n\"They haven't done a thing to help us down here,\" shouted Tepeto Davis, a 37-year-old tile contractor who slammed on the brakes of his pickup truck and backed up to talk to reporters.\n\nBoxes of Meals-Ready-to-Eat (MRE) are seen at an airport in Treasure Cay, Bahamas. Roughly 14,700 are being sent by the World Food Program. (Marco Bello/Reuters)\n\n\"We are suffering out here and no one cares about us. We've had to funnel gasoline out of destroyed cars to get injured people back and forth. There's no gas, there's no food, no medicine, and no water.\"\n\nAnd those who were receiving aid in Nassau worried that they were still a long way from being able to rebuild their lives.\n\n\"The government says everyone's being fed, and that's good,\" said Anthony Morley, 61, who fled Marsh Harbour and was staying at Breezes, a Nassau resort where local volunteers have subsidized rooms for survivors. \"But for food I can fish. What I need is a house. I don't have a bed, a refrigerator. I don't even have a Bible.\"", "description": "After Hurricane Dorian devastated large parts of the Bahamas, killing at least 44, community members and international organizations are struggling to rebuild. At the same time, some who survived the storm complain there has been a lack of aid.", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5275395.1567968540!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/hurrican-dorian-aftermath-on-abaco-island.jpg", "published_at": "2019-09-08"}