{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201909/09/WS5d759bd1a310cf3e3556a604.html", "downloaded_at": "2019-10-05 13:39:51.735489+00:00", "title": "TV series on relics gives viewers an easy way to understand history", "language": "en", "text": "By Wang Ru | China Daily | Updated: 2019-09-09 08:24\n\nMembers of the TV production team and the publishing staff with readers at the book launch in Beijing last month.[Photo provided to China Daily]\n\nMost regular viewers of Chinese television are familiar with this line: \"You have received a message from a national treasure, please check.\" This is because it is the first sentence of every episode of Every Treasure Tells a Story, a hit documentary series which introduces cultural relics of ancient China.\n\nThe series, which began airing in 2018, is a big success thanks to its vivid explanations about cultural relics. Namesake books have also recently been published in Chinese, English, French and Spanish by China International Communication Center.\n\nThe documentary series is expected to run for four 25-episode seasons, with each five-minute-long episode introducing one cultural relic. Now that the first two seasons have been aired, books related to the series and the relics featured have also been published.\n\nChen Lujun, the director of the center, says it was an honor to publish this series of books.\n\nAccording to Chen, the books are loyal to the documentary. The production team tried their best to be faithful to the scenes and language of the documentary. Also, the books have more content than the documentary did.\n\n\"Books and documentaries are different kinds of media. When we adapt a documentary into a book, we try to add some background information so that readers can better understand the subject,\" says Chen.\n\nChen also says that the cultural relics bore the weight of a rich Chinese culture, which attracted not only the Chinese, but also foreigners. So, the books had also to be published in foreign languages.", "description": "Most regular viewers of Chinese television are familiar with this line: \"You have received a message from a national treasure, please check.\" This is because it is the first sentence of every episode of Every Treasure Tells a Story, a hit documentary series which introduces cultural relics of ancient China.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201909/09/5d75b72ea310cf3e979b591f.jpeg", "published_at": "2019-09-09"}