{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/sep/27/indian-hunger-striker-released-immigration-detention-texas-ajay-kumar", "downloaded_at": "2019-09-27 15:01:30.470645+00:00", "title": "Indian hunger striker released from immigration detention in Texas", "language": "en", "text": "An Indian immigrant who lost a third of his weight during a 70-day hunger strike over the rejection of his asylum claim has won temporary release after a year in US detention.\n\nRevealed: man force-fed in Ice custody at risk due to 'substandard care' says doctor Read more\n\nAjay Kumar, 33, bowed with his hands clasped together in a traditional Indian greeting as he walked away from a detainee processing center in El Paso, Texas, with a tracking device around his ankle: a condition of his release.\n\nHe was accompanied by human rights activists, who had been galvanized by medical personnel force-feeding him. The painful procedure involves pumping liquid food into the stomach via a tube through his nose.\n\nImmigration and Customs Enforcement (Ice) officials agreed to a deal last week in which Kumar and another Indian national resumed eating on a promise that they would be released, according to their lawyers. The men began eating again Saturday and had been kept under medical observation.\n\nKumar said he felt “very good”, even though he lost nearly 50 pounds during his hunger strike, dropping from 150 pounds at the start of his hunger strike to 107 pounds. Kumar said he has regained about 10 pounds but still feels in pain.\n\n“I got my freedom,” Kumar said. “I’ve been waiting a long time for this.”\n\nKumar and fellow Indian detainee Gurjant Singh began their hunger strike on 8 July after rejection of their asylum claims and denial of bond. They had spent almost a year in an Ice detention facility in Otero, New Mexico, and had not been charged with a crime. They believe the judge did not consider the facts of their cases individually.\n\nSingh has not been released but his attorney, Jessica Miles, said she hopes it will be later on Friday.\n\nKumar told immigration officials he fled India because he feared beatings, torture and death at the hands of Prime Minister Narendra Modi’s ruling Bharatiya Janta party. He said he was attacked twice by BJP members for his work promoting the opposition Indian National Lok Dal party, including a beating that had him bedridden for more than a month, according to a doctor’s note included in his asylum application.\n\nIce declined to comment on their release.\n\nAccording to court documents, an Ice doctor urged local immigration officials to release Kumar, citing his failing health and commitment to continuing the hunger strike. Ice granted his release two days later.\n\nThe agency is required to monitor Kumar and Singh’s health due to a court order that admonished Ice for the detainees’ substandard medical care.\n\nKumar will live with a human rights advocate in Las Cruces, New Mexico while he regains weight and appeals his asylum case.\n\n\n\n", "description": "Ajay Kumar, 33, who had refused food for 70 days and lost a third of his weight, must now wear electronic tag", "authors": ["Associated Press"], "top_image": "https://i.guim.co.uk/img/media/d8e45e32683246c54eb702aefa57349e100d374c/0_110_3300_1980/master/3300.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b7dc10e79023388e5c378d67911c2ef4", "published_at": "2019-09-27"}