{"pub": "independent", "url": "https://independent.co.uk/life-style/gadgets-and-tech/news/google-climate-change-denial-donation-contribution-a9151761.html", "downloaded_at": "2019-10-11 12:32:20.852597+00:00", "title": "Google gave 'substantial' amounts of money to climate change deniers", "language": "en", "text": "Google has made donations to more than a dozen organisations that deny climate change, according to newly uncovered documents.\n\nGroups like the Competitive Enterprise Institute (CEI) and the American Conservative Union received “substantial” contributions from the technology giant, a Google transparency document reveals.\n\nThese groups actively campaigned against climate legislation – in stark contrast to Google’s public pledge to take urgent action against the climate crisis.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nA statement on the transparency section of Google’s website distances itself from the agendas of the companies that it works with or gives financial donations to.\n\n“Google’s sponsorship or collaboration with a third party organisation doesn’t mean that we endorse the organisations’ entire agenda, its events or advocacy positions nor the views of its leaders or members,” it states.\n\nShape Created with Sketch. Climate change: Greenland ice cap accelerated retreating Show all 22 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Climate change: Greenland ice cap accelerated retreating 1/22 Getty Images 2/22 Getty Images 3/22 Getty Images 4/22 Getty Images 5/22 Getty Images 6/22 Getty Images 7/22 Getty Images 8/22 Getty Images 9/22 Getty Images 10/22 Getty Images 11/22 Getty Images 12/22 Getty Images 13/22 Getty Images 14/22 Getty Images 15/22 Getty Images 16/22 Getty Images 17/22 Getty Images 18/22 Getty Images 19/22 Getty Images 20/22 Getty Images 21/22 Getty Images 22/22 Getty Images 1/22 Getty Images 2/22 Getty Images 3/22 Getty Images 4/22 Getty Images 5/22 Getty Images 6/22 Getty Images 7/22 Getty Images 8/22 Getty Images 9/22 Getty Images 10/22 Getty Images 11/22 Getty Images 12/22 Getty Images 13/22 Getty Images 14/22 Getty Images 15/22 Getty Images 16/22 Getty Images 17/22 Getty Images 18/22 Getty Images 19/22 Getty Images 20/22 Getty Images 21/22 Getty Images 22/22 Getty Images\n\nFormer Google chairman Eric Schmidt was questioned in 2014 about Google supporting a climate change-denying pressure group, to which he responded that it was “some sort of mistake”.\n\nHe told the radio host who questioned him about it that Google “should not be aligned with such people” and said that it wouldn’t happen again.\n\nBut the company continues to provide financial backing to controversial groups, with a spokesperson telling The Guardian: “We’re hardly alone among companies that contribute to organisations while strongly disagreeing with them on climate policy.”\n\nIn September, Google employees joined workers from other tech firms in a mass walkout to support the Global Climate Strike.\n\nIn a blog post at the time, the Google Workers for Action on Climate group highlighted some of the deals and funding that the company was involved with that contradicted its public stance on climate change.\n\n“Google Cloud makes significant revenue licensing infrastructure, machine learning, and engineering talent to fossil fuel companies, promising to help them extract fuel reserves faster,” the post stated.\n\n“Also, Google invests in the deadly status quo. In 2018 the company funded 111 members of Congress who voted against climate legislation at least 90 per cent of the time.”\n\nAhead of the worker strike, Google announced “the biggest corporate purchase of renewable energy in history”, which included 18 new energy deals that will increase its portfolio of wind and solar agreements by 40 per cent.\n\nThe workers group hopes Google will go further than this by ending all contracts with fossil fuel companies and eliminate funding for climate-denying lobbyists and politicians.\n\n“As individuals, we may feel alone in facing climate change,” the group stated. “But if we act together – if we act now – we can build a better future.”", "description": "Google has made donations to more than a dozen organisations that deny climate change, according to newly uncovered documents. Groups like the Competitive Enterprise Institute (CEI) and the American Conservative Union received “substantial” contributions from the technology giant, a Google transparency document reveals.", "authors": ["Anthony Cuthbertson"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/28/15/coal-power-plant.jpg", "published_at": "2019-10-11"}