{"pub": "financialpost", "url": "https://business.financialpost.com/news/economy/world-urgently-needs-to-quicken-steps-to-reduce-global-warming-imf", "downloaded_at": "2019-10-10 18:27:08.224109+00:00", "title": "IMF warns world must take urgent steps to reduce global warming with carbon taxes the best way to do it", "language": "en", "text": "WASHINGTON — Countries around the world should urgently begin accelerating efforts to reduce greenhouse gas emissions, and the best way to do that is through implementation of carbon taxes and global cooperation, the International Monetary Fund said on Thursday.\n\n“Global warming causes major damage to the global economy and the natural world and engenders risks of catastrophic and irreversible outcomes,” the global lender said in a semi-annual report released ahead of the IMF and World Bank fall meetings of finance leaders and policymakers next week.\n\nThe stark warning was issued as protests continue to demand immediate action to cut carbon emissions and avert an ecological disaster. On Monday, thousands of climate-change protesters took to the streets in cities around the world, launching two weeks of peaceful civil disobedience.\n\nUN climate scientists warned last month that if greenhouse gas emissions are not slashed the world must face a reality of cities vanishing under rising seas, rivers running dry and marine life collapsing.\n\nIn its Fiscal Monitor report on Thursday, the IMF noted the long-term goal of the 2015 Paris Agreement was to limit temperature rises to 2 degrees Celsius (3.6 degrees Fahrenheit), but that current global commitments to reduce emissions were consistent with warming of 3 degrees Celsius.\n\nThe Fund also noted that many countries are set to miss their own targets and that the United States has said it will pull out from the Paris climate deal in 2020.\n\n“Implementation of existing commitments is therefore a first-step priority, but mechanisms to boost action at a global level are urgently needed,” the report said.\n\nCarbon taxes, which would raise the cost of fossil fuels, would be the most comprehensive means of tackling global warming, according to the report, as it would make people and businesses reduce emissions, convert energy or switch to greener power sources.\n\nImplementing a carbon tax of US$75 per ton would have the greatest impact in reducing emissions, with the price of coal rising more than 200 per cent above baseline levels in 2030.\n\nThe cost of electricity and gasoline would also rise considerably and by varying degrees in countries. Gasoline prices would rise 5 per cent to 15 per cent in most countries, the IMF said, “well within the bounds of price fluctuations experienced during the past few decades.”\n\nA global price floor would be the most efficient way of doing this, but another option would be for advanced economies to have a higher floor price or for them to provide financial and technical support to emerging market countries in exchange for their commitment to more ambitious targets, the report said.\n\nThe Fund estimates that the US$75-per-ton carbon tax would prevent 725,000 premature air pollution deaths overall in the Group of 20 industrialized nations by 2030, a lot of them in China.\n\nHELPING THOSE IN NEED\n\nThe need to tackle climate change has become pressing, particularly among the G20 countries, as the potential impact on economic growth and financial stability has become more apparent.\n\nMost of the G20 central banks, including the European Central Bank and People’s Bank of China, have signed up to the Network for Greening the Financial System, an information-sharing group. The IMF, whose majority shareholder is the United States, also joined last month.\n\nA main difficulty with a carbon tax is how politically feasible it would be in many countries, given it would lead to higher energy costs until cheaper green alternatives became widespread.\n\nTo that end, governments must give people and businesses incentives to reduce emissions without derailing economic growth, the IMF report noted, as it cited the contrasting examples of France and Sweden.\n\nFrench President Emmanuel Macron’s suspension of a US$50-per-ton carbon tax in 2018 following a public backlash was due to “the perceived unfairness of the tax, which was introduced at the same time as broader tax reductions seen as benefiting the wealthy,” the report said.\n\nSweden, which introduced a carbon tax of US$28 per ton in 1991 that has since risen to US$127 a ton, introduced the emissions-cutting mechanism along with a reduction in income taxes for low and middle-income households, and competitive concerns were addressed through lower initial rates for industries.\n\n“Finance ministers can play a key role by undertaking carbon taxation or similar pricing, adjusting broader tax and expenditure policy as part of a comprehensive strategy, ensuring adequate budgeting for investment in R&D and support for cleaner technologies, and coordinating strategies internationally,” the IMF said in its report.\n\n© Thomson Reuters 2019", "description": "IMF says implementing a carbon tax of US$75 per ton would have the greatest impact in reducing emissions", "authors": ["Lindsay Dunsmuir"], "top_image": "https://financialpostcom.files.wordpress.com/2019/10/coal.jpg", "published_at": "2019-10-10"}