{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7539657/Donald-Trump-hints-slavery-telling-young-black-leaders-African-Americans-built-nation.html", "downloaded_at": "2019-10-05 07:29:54.409817+00:00", "title": "Donald Trump hints at slavery telling young black leaders: 'African Americans built this nation'", "language": "en", "text": "Donald Trump hinted at slavery at a Friday afternoon event while speaking at a youth leadership summit for black Republicans at the White House.\n\nTrump said African-Americans are beginning to get credit for their contribution to the national fabric in unscripted remarks at the White House event.\n\n'African Americans built this nation. You built this nation. You know, you're just starting to get real credit for that. I don't know if you know that,' he said. 'You're just starting to get - you built the nation. We all built it. But you were such a massive part of it.'\n\nHe also spoke about his friendship with Kanye West and the rapper's wife Kim Kardashian, cracking himself up as he said, 'I get along with Kanye for a long time. You saw the way he, when he was with the White House. He puts the hat on.\n\n'I think for one day, I went up through the polls, like through the roof, I tell you. He is, with the African-American community, they like Kanye, and they like Kim Kardashian. I tell you.'\n\nDonald Trump hinted at slavery at a Friday afternoon event while speaking at a youth leadership summit for black Republicans at the White House\n\nThe president whacked a litany of enemies in his remarks at the East Room reception that capped off another whirlwind week in Washington, where Democrats moved to expand their impeachment inquiry by compelling the White House and State Department to produce a tranche of sensitive documents.\n\nLawmakers on the House Intelligence, Foreign Affairs and Oversight Committees are reviewing the administration's communication with Ukraine in response to a whistle-blower complaint.\n\nTrump blasted Democrats, their 'deep state cronies,' and what he described as the 'fake news media' for colluding to 'nullify' the last presidential election in the East Room.\n\nHe claimed that 'radical left Democrats' are on a 'craven quest for power and money and other things' that he declined to describe on television.\n\n'Maybe when the cameras are off, we'll have to talk,' he told attendees of the event.\n\nThe president preceded to mock California Congressman Adam Schiff, who he called 'Shifty Schiff,' for a four Pinocchio rating in the Washington Post.\n\nA fact-checker for the paper had rated Schiff's claim that the committee never spoke to the whistle-blower as false earlier in the day.\n\n'He lies like a son of a gun,' said Trump of the House Intel chairman.\n\nIn a nod to the assault he's facing for the pleas he made to Ukraine and China to investigate Joe Biden and the former vice president's son, he said: 'My administration is fighting with ....everyone.'\n\n'We will do what we have to do but we will stop defrauding all of the people in our country, because they have defrauded the people in our country,' he said of the opposing political party.\n\nTrump said African-Americans are beginning to get credit for their contribution to the national fabric in unscripted remarks at the White House event\n\nHe said blacks in particular are being mislead by Democrats claiming to be looking out for their best interests.\n\nTrump reminisced about his 2016 plea to the black community to vote for him, asking 'what the hell do you have to lose' in a Michigan speech.\n\n'And I'll never forget, and my people came, Sir that wasn't very nice,' he said. 'And you went me with me, and you did get a good vote, I have to say.'\n\nHe mentioned criminal justice reform and the incarceration of Alice Johnson, a black woman whose sentence he commuted after Kim Kardashian came to the White House to lobby on her behalf, as one of the ways he's improved conditions in America for blacks.\n\nRetelling the story of Johnson's release, the president said, 'And Kanye West came, and Kim came, and they said, president could you do this. I said do what?'\n\n'We pardoned her, and we worked it so that she was going to be able to get out, a form of a pardon where she could get out,' he assessed.\n\nTrump said he considering commutations for some of Johnson's former fellow inmates based on several of her recommendations.\n\n'And I guarantee you those are great people. They've been in there also for many many years,' he said. 'She's smart. After all those years, she knows the good. And I have no doubt that it will work out. And we're getting them out now. We're in the process of getting them out to be with their families.'", "description": "Donald Trump hinted at slavery at a Friday afternoon event while speaking at a youth leadership summit for black Republicans at the White House.", "authors": ["Francesca Chambers", "Senior White House Correspondent For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/00/19318196-0-image-a-83_1570231268630.jpg", "published_at": "2019-10-04"}