{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7596479/Exclusive-outdoor-picnic-aimed-recreating-glamour-French-high-society-turns-chaos.html", "downloaded_at": "2019-10-21 15:07:57.971424+00:00", "title": "Exclusive outdoor picnic aimed at 'recreating glamour of French high society' turns to chaos", "language": "en", "text": "Guests of the exclusive Diner en Blanc al fresco dining experience were promised an evening so glamorous it would leave them wondering 'whether it had all been a dream'.\n\nBut in reality the 'chic picnic' turned into a nightmare with miserable punters complaining of being crammed into a muddy field and forced to queue for hours for their champagne.\n\nRather than recreating the 'glamour of French high society', the outdoor event in Battersea Park has been branded the 'most underwhelming, over-priced and disorganised event' ever.\n\nMiserable punters of the 'glamorous' Diner en Blanc picnic complained of being crammed into a muddy field and forced to queue for hours for their champagne\n\nGuests complained that they were crammed into a marquee and had to keep getting up so other punters could get round them\n\nGuests of Diner en Blanc, which has been running for 31 years, are asked to wear elegant white and are only told the location at the last minute.\n\nThe event is hosted in cities across the globe and has historically taken over jaw-dropping landmarks which wowed diners, such as the Eiffel Tower.\n\nYet in London on Friday, guests were dismayed to find their £25 ticket gained them entry to 'a marquee in a local park'.\n\nGareth Davies, 40, from London, said: 'Usually these things are at the Eiffel Tower, or Hyde Park or Sydney Opera House, so being in London we were expecting something iconic.\n\n'Where did we end up? A smelly, dangerous tent in the middle of Battersea Park with one toilet for 500 people.\n\n'After paying around 250 quid for tickets, table rental, wine, food and white clothes (and the bus ride to get there) we had to walk in the dark through the park in the mud, and then wait outside the venue for over an hour as the police deemed it unsafe on health and safety grounds.\n\n'Finally when we get in to the tent all hell broke loose, nobody knew where they were sitting, people had rented tables and the food that people ordered didn't turn up.\n\nIn London on Friday, guests of the annual Diner en Blanc al fresco dining experience were dismayed to find their £25 ticket gained them entry to 'a marquee in a local park'\n\nThe event is hosted in cities across the globe and has historically taken over jaw-dropping landmarks which wowed diners, such as the Eiffel Tower, which made guests at the Battersea Park marquee all the more underwhelmed\n\n'It was chaos and even the volunteers didn't know what was going on.\n\n'Half way through the night, inside a big tent with only one exit jammed with 500 people, they handed out sparklers!\n\n'Imagine the fire risk of 500 people lighting sparklers and waving them around? I saw at least four people burn their clothes and the whole place could have gone up in flames. We ended up leaving as it was so bad! The organisers didn't care either.'\n\nSocial media also erupted with complaints of sloppy organisation akin to that of the 2017 Fyre Festival - the notorious island party which left guests stranded.\n\nAmy Parry wrote on Facebook: 'This was our very own local Fyre Festival.\n\n'Last night was the most underwhelming, over-priced and disorganised event I have ever been to.'\n\nShe added that she had paid for a 'bus or boat' ticket to be taken to the venue in style, but instead 'rode the local 44 bus'.\n\nWriting on the event's page, she lambasted the organisers for missing almost all the items in her £45 hamper, which took well over an hour to arrive.\n\nWhen the supposed luxury hampers eventually arrived, guests were up and arms to discover it comprised a few olives, a small salad garnish, and a few morsels of cheese and meat\n\nGuests complained that organisers allowed people to use sparklers in the jam-packed tent with only one exit\n\nSome champagne packages reportedly cost up to £99 per person.\n\nMs Parry added: 'The tables were rammed in so we spent all night (well the final hour once we finally had a table and some food) getting up and down to let people by.\n\n'It was in a marquee in a local park and not at all the experience I see online from other events that are at amazing landmarks.\n\n'So disappointed. Will be seeking a refund for goods both misrepresented and undelivered.'\n\nEunice Akinyi, who said he was part of the volunteer staff at the event, claimed the organisation was chaotic and the venue was 'disgusting'.\n\nSocial media erupted with complaints of sloppy organisation akin to that of the Fyre Festival in 2017 - the notorious island party which left guests stranded\n\nStarted in 1988 initially in Paris, Diner en Blanc attracts over 17,000 guests from around the world each year.\n\nHyping up the London event, its website said: 'Le Dîner en Blanc recalls the elegance and glamour of high French society, and guests engage one another, knowing that they are taking part in a truly magical event.\n\n'There are no disruptions: no car traffic, no pedestrian traffic — only amazed and astonished looks from passersby observing the scene before them.'\n\nLast year, the London event was hosted at Somerset House on the Strand and received glowing reviews.\n\nDiner en Blanc did not immediately respond to MailOnline's request for comment.", "description": "Rather than recreating the 'glamour of French high society', the outdoor event in Battersea Park has been branded the 'most underwhelming, over-priced and disorganised event' ever.", "authors": ["Jack Elsom For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/15/19995744-0-image-a-56_1571669916557.jpg", "published_at": "2019-10-21"}