{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/boxing/article-7566881/Josh-Warrington-demolishes-Sofiane-Takoucht-two-rounds-retain-IBF-featherweight-title.html", "downloaded_at": "2019-10-13 00:32:41.825226+00:00", "title": "Josh Warrington demolishes Sofiane Takoucht in two rounds to retain IBF featherweight title", "language": "en", "text": "Josh Warrington electrified Leeds and beamed a warning to his rival world featherweight champions with a hurricane of a performance on a chill Leeds night.\n\nSofiane Takoucht, the French challenger for his IBF world title was struck by a remorseless succession of lightning bolts.\n\nIt was all over with eight seconds of the second round still remaining.\n\nJosh Warrington put in a ruthless performance to brush aside Sofiane Takoucht in Leeds\n\nWarrington was cool and calculated, winning the contest inside two rounds\n\nThe 28-year-old started quickly, with intensity, and immediately had Takoucht on the back foot\n\nTakoucht was bowled over twice in that stunning stanza and although he kept swinging he needed the intercession by referee Bob Williams to spare him serious harm.\n\nThis was the performance Warrington needed to demand that the likes of Leo Santa try to disprove is assertion that ‘I’m the best featherweight in the world. ‘ The Warringtoneers were out in force.\n\nThe First Direct Arena was teeming with expectation and their man had promised to be back at his best after the lacklustre effort and marginal victory in that scuffling fight with Kid Galahad.\n\nSettling into his rhythm, Warrington soon started landed punches with power and consistency\n\nTakoucht was sent toppling to the canvas in the second round and simply failed to recover\n\nComing through the count, Takoucht looked unsteady and Warrington was primed to attack\n\nThe question the faithful needed answering was whether Warrington would be more highly motivated against a French challenger few of them would have heard of before.\n\nWarrington admitted he paid less than full attention to his preparations for Galahad and vowed not to let slip again the standards which had powered him to world title winning victory over Lee Selby and a brilliant defence against Carl Frampton.\n\nHe also knew that if he is to break out of the local mould he needed an eye-catching performance against Takoucht.\n\nReferee Bob Williams had to step in to spare the Frenchman some serious harm\n\nWarrington wagged his finger to the adoring mass and bathed in the glory of his victory\n\nPromoter Frank Warren had warned that the rival world champions in his division would continue to avoid him unless he forced the public’s attention upon them.\n\nWarrington’s entrance to the ring was heralded by a military pipe and drum band.\n\nHe took close order at once, landing crisply to the body as well as head of the taller Frenchman from the opening bell.\n\nThis was more like the relentless, all action Warrington they love - and Takoucht quickly learned to hate.", "description": "Josh Warrington electrified Leeds and beamed a warning to his rival world featherweight champions with a hurricane of a performance on a chill Leeds night.", "authors": ["Jeff Powell For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/23/19638878-0-image-a-4_1570920882012.jpg", "published_at": "2019-10-12"}