{"pub": "dailymail", "url": "https://dailymail.co.uk/money/pensions/article-7512647/Fixed-fee-595-probate-service-seeks-undercut-lawyers-banks.html", "downloaded_at": "2019-10-05 08:00:19.522467+00:00", "title": "Fixed fee £595 probate service seeks to undercut lawyers and banks", "language": "en", "text": "A fixed-fee probate service aimed at under-cutting banks and solicitors that charge a percentage of an estate has been launched by online wills specialist Farewill.\n\nThe firm will help customers get probate - a necessary step to take control over a loved one's estate - for either £595 or £1,045, depending on its size. A Government fee of £155 is payable on top.\n\nSome lawyers will charge an hourly rate to sort out probate, but many will levy a percentage of an estate ranging from 1 per cent to 5 per cent plus VAT for probate and other services involved in administration of a will. Banks and probate specialists also charge on a percentage basis.\n\nWith estates sizes affected substantially by property values, this can lead to charges of thousands or tens of thousands of pounds for probate.\n\nAdmin after a death: Probate is a necessary step to get control over a loved one's estate\n\nLloyds Bank's estate administration service charges 2.5 per cent up to £1million and 1.25 per cent on the amount above that, with a minimum charge of £2,000.\n\nFor a £450,000 estate, with a home worth £350,000 and savings, investments and belongings worth £100,000, this would mean a bill of £11,250.\n\nMany executors of wills opt to handle the paperwork and apply for probate themselves to save thousands of pounds in legal bills.\n\nIn these cases the Government fee is higher at £215 - though massive and controversial hikes have been announced, and then delayed.\n\nCritics argue that solicitor and banks probate charging approach has become increasingly unfair, because years of house price inflation means that a home can massively raise the value of an estate, yet it costs little or no extra to deal with probate applications involving a modest house compared with one worth a lot more.\n\nFarewill, of which This is Money's parent company DMGT owns a stake through its DMG Ventures arm, charges its flat lower rate for estates worth below £325,000 - the basic threshold at which they become liable for inheritance tax.\n\nIt charges a flat fee of £1,045 for estates worth more than that.\n\nDan Garrett, chief executive and co-founder of the firm, says: 'Farewill wants to fly the flag for grieving families by offering a more supportive and transparent alternative to dealing with probate.\n\n'When you call us for the first time, the first thing we’ll do is help you work out if you need professional help. We never assume you do.'\n\nFarewill says confusion and lack of knowledge around what probate involves, particularly after a sudden death, can lead families to overpay for professional services they may not need.\n\nIt explains that getting probate involves filling in a tax form and doing other paperwork to obtain a document that unlocks a deceased person's assets, and is needed after half of all deaths.\n\nLloyds Bank's estate administration service charges 2.5% on estates up to £1million\n\nBut the firm says it's important to distinguish between this and full estate administration, which is the legal process after a death to sort out someone’s affairs from start to finish, like closing accounts and paying beneficiaries.\n\nFarewill says a family can pay up to £18,000 - a 5 per cent fee plus VAT - on an estate worth £300,000 for full administration services.\n\nMeanwhile, the Government planned to hike its probate fees last April by up to 2,700 per cent for the largest estates, but the final stage in the process requires parliamentary time so increases have been delayed for now.\n\nIn future, it will cost nothing for estates under £50,000, which is more lenient than the current £5,000 threshold for exemption. But £250 will be levied on estates worth £300,000-£500,000, rising to £6,000 for those worth £2million-plus.\n\nCritics say the increased fees are 'effectively a tax on wealth', which is expected to raise £150million to pay for running the Ministry of Justice, and don't reflect actual administration costs.\n\nThe Government has denied that they are a tax, and said of the new regime: 'Our system will see thousands of bereaved families paying no probate fees at all – protecting an additional 25,000 estates each year.\n\n'Fees are vital to the effective running of our courts and tribunals, ensuring access to justice and protecting vulnerable victims.'\n\nA surge in applications as grieving families sought to beat the hikes, alongside a drastic overhaul involving staff cuts, office closures, new IT systems and changes to work processes, have prompted long delays to grants of probate since the spring.\n\nSolicitors for the Elderly recently met with officials, and were told things were getting back to normal and application approvals should soon be back to pre-March timings.", "description": "Farewill will help people get probate, a necessary step to take control over an estate. A Government fee of £155 is payable on top. Many executors apply for probate themselves to save on legal bills.", "authors": ["Tanya Jefferies For Thisismoney.Co.Uk", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/09/27/16/19006800-0-image-a-10_1569596944221.jpg", "published_at": "2019-10-04"}