{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/transfer-news/arsenal-ace-eddie-nketiah-wanted-20569058", "downloaded_at": "2019-10-13 03:50:09.397726+00:00", "title": "Arsenal ace Eddie Nketiah wanted by Bristol City after bench role at Leeds", "language": "en", "text": "Get the biggest Arsenal FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nArsenal youngster Eddie Nketiah is wanted by Bristol City after struggling for game time at Leeds United.\n\nNketiah has scored four goals in eight games on loan at Leeds this season - but all of his appearances in the Championship have come from the bench.\n\nArsenal ideally want the 20-year-old striker to be in the starting XI to gain as much first-team experience as possible.\n\nIndeed, Gunners boss Unai Emery wanted Nketiah to stay and provide competition at the Emirates, but the centre-forward chose to go on loan .\n\nBristol City boss Lee Johnson wanted to take Nketiah on loan before he chose Leeds.\n\n(Image: PA)\n\nJohnson still needs a striker to fire his side's Championship promotion push - and with the Gunners having an option to recall Nketiah in January, the Robins chief will try again to land the hotshot in the new year, according to The Sun .\n\nNketiah admits Emery wanted him to stick around at the Emirates and provide cover for Alexandre Lacazette and Pierre-Emerick Aubameyang, but he knew he needed to get regular game time.\n\n\"The manager wanted me to stay so it’s really confidence-boosting for me that he had me in his plans,\" Nketiah told the Mail.\n\n\"But I felt like it was a good step for me to come to Leeds.\n\n(Image: Stuart MacFarlane)\n\n\"I hope it’s a good year that can leave me in good stead going back to Arsenal to fight for a place.\n\n\"There were a lot of options, there were options for me to go to Germany but me, my family and the club decided Leeds was the best place.\"\n\nBristol City are currently sixth in the Championship, one place behind Leeds but level on points, with both teams two points off top two West Brom and Nottingham Forest.", "description": "Striker has fired four goals for Leeds but Gunners want him to start and could recall him in January", "authors": ["Gareth Bicknell", "Image", "Pa", "Stuart Macfarlane"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article18786490.ece/ALTERNATES/s1200/0_Arsenal-Training-Session.jpg", "published_at": "2019-10-13"}