{"pub": "businessinsider", "url": "https://businessinsider.my/origin-of-modern-humans-botswana-africa-2019-10", "downloaded_at": "2019-10-30 02:27:08.834817+00:00", "title": "Every person alive today descended from a woman who lived in modern-day Botswana about 200,000 years ago, a new study finds", "language": "en", "text": "caption The Khoisan people of Botswana share mitochondrial DNA with the last matrilineal common ancestor of all humans alive today. source Shutterstock\n\nAnatomically modern humans, or Homo sapiens sapiens, emerged in Africa about 200,000 years ago. But the precise location from which they originated has remained uncertain.\n\nNow a new study suggests modern humans’ ancestral homeland was in modern-day Botswana, just south of the Zambezi River.\n\nResearchers narrowed in on that area using genetic analysis.\n\nThis finding supports the theory that our modern human ancestors migrated out of Africa, rather than evolving in different pockets around the world simultaneously.\n\nSome anthropologists are skeptical of the new findings, however.\n\nVisit Business Insider’s homepage for more stories.\n\nA group of researchers say they’ve pinpointed the ancestral homeland of all humans alive today: modern-day Botswana.\n\nIn a new study published in the journal Nature, scientists analyzed mitochondrial DNA – genetic information that gets passed down the female line – from more than 1,200 people across myriad populations in Africa. By examining which genes were preserved in people’s DNA over time, the anthropologists determined that anatomically modern humans emerged in what was once a lush wetland in Botswana, south of the Zambezi River.\n\nThough scientists agree that modern humans (Homo sapiens sapiens) arose in Africa around 200,000 years ago, they’ve remained uncertain about exactly where on the continent that evolutionary milestone occurred. The new study offers an answer to that question and also undermines the idea that our ancestors emerged in East Africa, as limited fossil evidence suggests.\n\nThe anthropologist Vanessa Hayes, the senior author of the new paper, said in a press conference that the findings suggested “everyone walking around today” could trace their mitochondrial DNA back to this “human homeland.”\n\nA vast wetland cradled our human ancestors\n\nTo trace the geographic origin of our ancestors, Hayes and her colleagues examined mitochondrial DNA (mtDNA) from people living in southern Africa, such as the Khoisan.\n\nmtDNA, which is passed down the maternal line, is often used to trace human ancestry because it isn’t mixed with paternal DNA. That means it changes less over time and leaves a clearer link to distant relatives.\n\nWhen it comes to mtDNA, modern humans all share a group of genes called the L macro-haplogroup. This L-branch is split into two subgroups: L1-6 and L0. The latter can be found in the peoples of southern Africa, and that’s what Hayes’ team analyzed. Eva Chan, a coauthor of the study, said this was the “by far the largest L0 study to date.”\n\nBy pulling on that genetic string, the researchers were able to figure out that every person alive today descended from a woman who lived in modern-day Botswana about 200,000 years ago.\n\nThe region this ancestor came from, called the Makgadikgadi-Okavango paleo-wetland, was near the modern Okavango Delta and peppered with lakes and greenery.\n\ncaption Okavango Delta in modern-day Botswana is similar to the lush wetland that nourished our human ancestors. source Via Wikimedia Commons\n\nThe team’s analysis, which also included reconstructions of what the area’s climate was like at the time, revealed that Homo sapiens sapiens lived in this homeland for about 70,000 years. Then, as the climate changed, our ancestors dispersed in two waves: First, a group spread northeast 130,000 years ago, then others left in a second migration to the southwest 110,000 years ago.\n\nAccording to Hayes, these migrating groups likely followed herds of animals out of the region.\n\nThis timeline runs counter to the one some scientists have created based on fossil evidence, however. The oldest-ever specimens of anatomically modern humans – skulls and other fossils dating back 195,000 years – were found in Ethiopia, which led many anthropologists to think of eastern Africa (rather than southern Africa, as the new study suggests) as the birthplace of our modern ancestors.\n\nThe new genetic analysis also offers credence to the idea that all modern humans evolved in one place in Africa before migrating to current-day Europe, Asia, and Australia – what’s known as the “Out of Africa” hypothesis – rather than evolving separately in multiple places around the world at the same time.\n\ncaption A 2017 map of Homo sapiens’ dispersal routes out of Africa indicates the origin point of our modern ancestors as being in East Africa, not southern Africa. source Katerina Douka and Michelle O’Reilly/Flickr\n\nAccording to the study authors, the two-wave migration out of Botswana “paved the way for modern humans to later migrate out of Africa, and ultimately across the world.”\n\nAn anthropologist questions the findings, however\n\nBut the anthropologist Ryan Raaum, who researches African population genetics at Lehman College, thinks the new study has a significant flaw. According to Raaum, the researchers didn’t go back far back enough on the genetic timeline.\n\nThough Hayes’ research pinpointed where the L0 haplogroup originated, he said, the mitochondrial DNA of most people in the world can be traced back to the L1-6 subgroup of the L-branch, not L0. So to find a “single origin” for our species, Raaum said, researchers should find a genetic predecessor who lived before the genetic split between L0 and L1-6 occurred.\n\n“Where I get a little lost in the weeds is when they expand out to argue that these data indicate a southern African origin for anatomically modern humans,” he told Business Insider. “The data do not.”\n\ncaption The anthropologist Vanessa Hayes learns how to make fire with Juǀ’hoansi hunters in Namibia. Some of these hunters offered DNA samples for her study. source Chris Bennett, Evolving Picture, Sydney, Australia\n\nRaaum added that he didn’t like the phrase “ancestral homeland” in general, since modern humans likely had multiple homelands scattered around the African continent.\n\n“I increasingly think that there probably wasn’t a single population in which modern humans evolved. If that is the case, there is no ‘homeland,'” he said.\n\nThe researchers said they’d need more DNA to make further conclusions\n\nAnother issue with Hayes’ team’s findings is that an mtDNA analysis examines only maternal DNA.\n\nTwo parts of the cell carry DNA: the nucleus, where most of our genetic material resides, and the mitochondria. Nuclear DNA (nDNA) is inherited from both parents and is what passes along the Y chromosome; mitochondrial DNA, on the other hand, is passed down from only the mother.\n\nnDNA is rare in the fossil record, which is why studies like Hayes’ often don’t examine it. But that means such research can’t examine the entire genome of our ancestral populations.\n\nIn 2014, anthropologists pinpointed the oldest known modern-human lineage based on Y chromosome data. This population was at most 160,000 years old and in central western Africa. So every person alive today likely descended from a man who lived in a different part of the continent than the homeland Hayes and her colleagues suggest.\n\nHayes noted that a full genome analysis could yield different results: “There could be other origins and other lineages – it’s a possibility,” she said during the press conference.\n\nBut whether or not Botswana was the cradle of life for everyone alive today, the new research certainly suggests this part of Africa was an oasis for our ancestors – a significant addition to our understanding of human evolution.\n\n“People want know where they came from,” Hayes said.", "description": "Business Insider - Modern humans emerged in Africa around 200,000 years ago. Now a research team has figured out where on the continent our ancestors originated.. Read more at businessinsider.my", "authors": ["Aylin Woodward", "Business Insider Us"], "top_image": "https://static.businessinsider.my/sites/3/2019/10/5db351c6dee0191b5c1dd168.png", "published_at": "2019-10-28"}