{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7573761/Metallica-fans-slam-concert-organisers-not-refunding-postponed-shows.html", "downloaded_at": "2019-10-15 08:07:43.684153+00:00", "title": "Metallica fans slam concert organisers for not refunding postponed shows", "language": "en", "text": "Metallica fans were left devastated when the heavy metal band postponed their first Australian tour in six years back in September.\n\nAnd now, it appears they've have been dealt another harsh blow, as concert organisers have delayed refunding money for the now cancelled shows.\n\nMetallica took to Twitter on September 28 to confirm they'd cancelled all of their shows, citing lead singer James Hetfield's recent rehab admission as the reason why.\n\nSad news! Metallica has been forced to cancel all of its Australian shows. Pictured (L-R) James Hetfield, Kirk Hammett, Lars Ulrich and Robert Trujillo\n\n'We are truly sorry to inform our fans and friends that we must postpone our upcoming tour of Australia and New Zealand,' the band stated.\n\n'As most of you probably know, our brother James has been struggling with addiction on and off for many years. He has now, unfortunately, had to re-enter a treatment program to work on his recovery again.'\n\nIt is unclear what 'addiction' James is being treated for, but the 56-year-old previously went to rehab in July 2001 to treat an alcohol issue.\n\nIn need of respite! Metallica took to Twitter to confirm they'd cancelled all of their shows, citing lead singer James Hetfield's (pictured) recent rehab admission as the reason why\n\nCandid confession! The band stated on Twitter: 'As most of you probably know, our brother James (pictured) has been struggling with addiction on and off for many years'\n\nThe band continued: 'All tickets purchased to the shows in Australia and New Zealand, including Enhanced Experiences and Black Tickets, will be fully refunded.'\n\nTicketmaster, which issued tickets for Sydney, Melbourne, Perth and Brisbane, also shared the message on its Facebook page, with a link for refund information.\n\nAccording to the ticketing authority, refunds were expected to take between three and seven days, depending on who issued the ticket.\n\nSpeaking out! The band issued a heartfelt message on Twitter in September after it was revealed they had cancelled all of their Australian shows\n\nBut with fans still yet to receive their refunds, many have taken to social media to slam the organisers, who they say are not following through on their promise.\n\n'@Ticketmaster_AU any idea when the refund for Metallica will go through? It's been more than the indicated 10 days now,' one person wrote.\n\n'Hey @Ticketmaster_AU how long until we get our refund for Metallica/Slipknot tickets??' another person stated.\n\nBacklash! With fans still yet to receive their refunds, many have taken to social media to slam the organisers, who they say are not following through on their promise\n\nA third person added: 'Still no refund for Metallica? How slow is this process? Getting beyond a joke now.'\n\nTicketmaster issued a follow-up response to the backlash on October 11, which stated: 'We thank you for your ongoing patience while we process your refunds.\n\n'Rest assured, refunds have commenced and we are working as quick as we can to get your money back to you.'\n\nDon't worry! The band previously stated: 'All tickets purchased to the shows in Australia and New Zealand, including Enhanced Experiences and Black Tickets, will be fully refunded'\n\nAccording to Ticketek, which is responsible for ticket sales in Adelaide, the issuer has processed '98 per cent' of refunds, with only a few still to be completed.\n\n'The Ticketek team is working hard to ensure these specific Metallica fans get their refunds as soon as possible,' a Ticketek spokesperson told the Herald Sun.\n\nDaily Mail Australia has reached out to Ticketmaster for comment.", "description": "Metallica fans have been dealt another harsh blow, as concert organisers have delayed refunding money for the now cancelled shows.", "authors": ["Mark Brook For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/06/19723776-0-image-a-74_1571118554158.jpg", "published_at": "2019-10-15"}