{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/11/we-cant-do-anything-china-accused-of-muffling-voices-of-hong-kong-supporters", "downloaded_at": "2019-09-11 07:26:29.879220+00:00", "title": "'We can't do anything': China accused of muffling voices of Hong Kong supporters", "language": "en", "text": "Advocacy groups say activists in mainland China are being threatened or detained for posting messages of support or retweeting news stories\n\n'We can't do anything': China accused of muffling voices of Hong Kong supporters\n\nChen Siming, a 58-year-old Chinese activist, has followed the protests in Hong Kong from afar, feeling inspired but also helpless.\n\nFrom across the border in the southern province of Hunan, Chen does what he can to support the thousands calling for greater democracy in Hong Kong. In late August, he and more than 20 others posted online selfies of themselves covering their right eye, a gesture of solidarity for a young Hong Kong woman who says she was badly injured during a clash between police and protesters.\n\nLast week, Chen was summoned “for a chat” with the police – the sixth time he has been questioned by police, who also interrogated more than 20 others who posted the self portraits. The police threatened Chen with imprisonment and suggested his son could be badly affected. The police call him every day to check his whereabouts.\n\n“They play hard and soft at the same time. Sometimes they say good things and sometimes they threaten you. They try all kinds of ways,” he said.\n\nFacebook Twitter Pinterest Chen Siming covering his eye in solidarity with Hong Kong protesters Photograph: Twitter\n\nBut Chen has not been dissuaded. He regularly “jumps” China’s great firewall to access foreign news sites and posts links in a Wechat group of more than 200 people. Every few days censors shut down the group, but he and his friends keep reopening it. The group is now on its 20th iteration.\n\n“I feel deeply ashamed that we can’t do anything. Morally speaking, if you don’t condemn a crime, you are complicit in it,” he added.\n\nChen is one of dozens of Chinese intellectuals, activists, and regular people in the mainland who support the protests in Hong Kong but have had their voices muffled by Chinese authorities. On the mainland officials have been quick to censor Hong Kong-related news that has not been sanctioned and detain the few activists who have travelled to to the special administrative region.\n\nIn the lead up to China’s 1 October National Day, when the country celebrates 70 years of the founding of the People’s Republic of China, authorities are more sensitive than usual. Chen and other Chinese activists have been ordered not to travel to Hong Kong until after 10 October.\n\nChinese Human Rights Defenders, a rights advocacy group, has documented more than 20 cases of mainland Chinese being threatened or detained for posting messages of support, traveling to Hong Kong, or just retweeting news stories about the protests.\n\nQuick guide What are the five demands of the Hong Kong protesters? Show Hide The complete withdrawal of the proposed extradition bill Hong Kong’s leader, Carrie Lam, has said her government will formally withdraw the bill that ignited months of protests. Hong Kong residents had feared it could be used by China to extradite people for political reasons. They want guarantees that it cannot be reintroduced at a later date. Withdrawal of the use of the word 'riot' in relation to the protests Protesters want the government to officially recognise that their movement has been a series of legitimate protests, rather than a riot, as has been stated in official communications. Unconditional release of arrested protesters and charges against them dropped Hundreds of people have been arrested in recent weeks, and the protesters are demanding that all of them be freed, and that no convictions should stand against any of them. An independent inquiry into police behaviour Police use of force has escalated since the demonstrations began, while protesters have also resorted to increasingly violent measures. Demonstrators say an inquiry into police brutality is the number-one priority. Implementation of genuine universal suffrage Hong Kong's chief executive is currently selected by a 1,200-member committee, and nearly half of the 70 legislative council seats are filled by limited electorates representing different sectors of the economy. The protesters want to be able to vote for their leaders in free and open democratic elections. Photograph: Anushree Fadnavis/X06783\n\n“The government’s battle for Hong Kong is also being fought in mainland cities,” wrote Frances Eve, deputy director of research. “The Chinese government is working overtime to threaten and detain mainlanders from sharing and commenting on the protests in Hong Kong for fear of what it may spark back home”.\n\nChen Quishi, a Beijing-based lawyer who traveled to Hong Kong in mid-August, saw his Weibo account shut down a few days after he published three videos of anti-government protests that were then reposted by others on Youtube. He was called back to Beijing and on Tuesday said he had to report to “leaders” what he was doing in Hong Kong and how his videos were reposted.\n\nAvoid irresponsible remarks on Hong Kong, China warns UK MPs Read more\n\n“I can understand. It is almost the national anniversary, so it is quite sensitive,” Chen Qiushi said.\n\nWei Xiaobing, an activist in Zhejiang province, was held for 15 days in June after he shared a Facebook post and a tweet that said: “keep it up Hong Kong!”\n\nChina’s propaganda machine has been in overdrive over the last two months, depicting the protesters as rioters seeking to overthrow the government, but activists say many people see through it.\n\n“Actually a lot of young people on the mainland support Hong Kong but because of the suppression, the constant monitoring, they dare not speak out loudly,” said Lu, a 25-year old resident of Shenzhen, just across the border from Hong Kong, who began going to the protests in June out of curiosity.\n\nLu said he was shocked by scope and size of the protests and on 7 July, when demonstrators marched to a Kowloon rail station linking China and Hong Kong, he decided to join.\n\nHong Kong’s protesters have scored one for democracy, but the struggle is far from over | Simon Tisdall Read more\n\nAfter nervously crossing the border into Hong Kong that morning with a pair of clothes to change into, a pen and paper, he locked himself in a bathroom at a KFC. Trembling, he wrote the words on a sign that he held up that day: “I’m from mainland China, I am thankful to Hong Kong people! Don’t give up, fight for freedom!’\n\nA little more than a month later after Lu attended several more protests, he was detained for 10 days in Shenzhen. He has now fled to Thailand and is debating what to do next.\n\n“I really feel guilty and shameful. The price of this struggle should have been borne by us. Now Hong Kong people are bleeding for us and even losing their lives,” he wrote in an essay on Medium.\n\nFacebook Twitter Pinterest Lu Freedom attending a protest in Hong Kong, holding a sign that reads ‘I’m from mainland China, I am thankful to Hong Kong people! Don’t give up, fight for freedom!’ Photograph: Twitter\n\n“It is our indifference, indulgence and indifference that has lead to more and more arrogance of this dictatorship until it endangers everyone,” Lu added.\n\nThe police have also ordered Chen to delete his account or his posts on Twitter, where he is also active, but he refused.\n\nChen believes more regular Chinese citizens would support the protests if they had the right information. “Many people don’t know what is going on at all,” he said.\n\n“Like our compatriots in Hong Kong, we can’t go back. We must stand out. To support the people of Hong Kong is to support ourselves,” he said.\n\n\n\n\n\n", "description": "Advocacy groups say activists in mainland China are being threatened or detained for posting messages of support or retweeting news stories", "authors": ["Lily Kuo"], "top_image": "https://i.guim.co.uk/img/media/734255b19daf49420b315a185a2dd826f4deb080/0_84_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0242f6b803187a3cd9b3ffbd653725b7", "published_at": "2019-09-11"}