{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/style/trump-brushes-off-political-controversy-to-wine-and-dine-australia-at-state-dinner/2019/09/20/827a4db8-dbea-11e9-bfb1-849887369476_story.html", "downloaded_at": "2019-09-21 07:12:56.125608+00:00", "title": "Trump brushes off political controversy to wine and dine Australia at state dinner", "language": "en", "text": "\n\nPresident Trump looks on as he and first lady Melania Trump host Australian Prime Minister Scott Morrison and his wife, Jennifer Morrison, at the state dinner on Sept. 20. (Ricky Carioti/The Washington Post)\n\nThe president's lovely Friday night was not to be disturbed. While the rest of Washington concerned itself with reports that he had pressured Ukraine's leader to investigate the son of a major political adversary, President Trump brushed the matter aside.\n\n\"It's a ridiculous story,\" he told the media pool that morning, referring to an intelligence official's whistleblower complaint. \"I've had conversations with many leaders. They're always appropriate. I think Scott can tell you that.\"\n\nThat's Australian Prime Minister Scott Morrison, to the rest of us. He joined Trump in the Oval Office hours ahead of the state dinner, one of the last vestiges of traditional public performance in a presidency that has continually defied convention. (One could point to Trump's hostile call with the ally nation's previous prime minister, Malcolm Turnbull, as proof of his un­or­tho­dox style.)\n\nClear skies overhead, Trump and Morrison toasted each other and their countries' alliance while standing behind a lectern in the White House Rose Garden.\n\n\"Americans and Australians hold within our hearts a great love of family, a profound allegiance to our fellow citizens, a deep respect of law and liberty, and a determination to protect our independence at any cost,\" Trump said to a crowd of nearly 180 attendees.\n\nMorrison echoed the sentiment, raising a glass \"to 100 years of mateship, and to 100 more.\"\n\nJoining the tuxedoed leaders and their wives, Melania Trump in a sea foam J. Mendel gown and Jennifer Morrison in sparkly navy blue, were the guests who arrived earlier that evening to the sounds of \"Everything's Coming Up Roses.\" High spirits engulfed the White House, as everyone else also seemed to have brushed the past week's news far, far away.\n\nSaid Rep. Kevin McCarthy (R-Calif.), the House minority leader, \"I think it will be a great evening.\"\n\n[At second state dinner, Melania Trump’s dress is as quiet and dutiful as her]\n\nAll the president's men made appearances in the arrival area, an unusual display of very public solidarity. Vice President Pence, Secretary of State Mike Pompeo, Attorney General William P. Barr, new national security adviser Robert O'Brien and most of Trump's Cabinet, joined by their spouses, strode by reporters with all smiles and no comments.\n\n\n\nWhat the guest list lacked in Trumps — Ivanka and Jared Kushner, both advisers to the president, who attended last year's state dinner for the French president, spent Friday evening at a lavish wedding in Rome — it more than made up for in staffers. There was a buzzy new couple, Stephen Miller and Katie Waldman, followed by Kellyanne Conway, who attended the dinner sans husband George (which was probably for the best).\n\nSupreme Court Justice Clarence Thomas made a rare public outing with his wife, Ginni, as did the ghosts of Christmas Past: Henry and Nancy Kissinger, who walked past reporters slowly, and with pairs of aides and wheelchairs close behind.\n\nPlus, Trump's kitchen cabinet: Fox's Lou Dobbs and Maria Bartiromo, as well as Rudolph W. Giuliani, unbowed when asked about the Ukraine-centric tirade he delivered Thursday night on CNN.\n\n\"Hahahaha,\" he chortled, grinning broadly.\n\n\n\nStephen Miller, a senior adviser to President Trump, left, and Katie Waldman arrive at the state dinner. (Patrick Semansky/AP)\n\nGlamour, in short supply, manifested in the form of celebrity chef — and former \"Celebrity Apprentice\" contestant — Curtis Stone, and the golfer Greg Norman, who said he was trying to lure Trump down under for the President's Cup in December. (This happened to be a topic of conversation in the Oval earlier in the day, when Morrison also invited Trump and complimented the president's game by telling reporters that he \"certainly swings a club way better than I do.\") Asked if the president spends too much time with his clubs, Norman, a legend in the sport, remarked that \"no one can golf too much.\"\n\n[The complete guest list for the state dinner]\n\nIt was the perfect early autumn weather for a night in the Rose Garden, a more modest setting in which the Obamas hosted German Chancellor Angela Merkel just over eight years ago. Trump's guests dined on tables dressed in ombre yellow and green cloths — a nod to Australia's national colors, green and gold, drawn from the national flower, the golden wattle. Champagne grapes and candied ginger were nestled among the place settings, while the meal was served on china from the Clinton and George W. Bush services.\n\nAccording to the White House, the three-course dinner paid homage \"to Australia's special blend of culinary adaptations from its various cultures, not unlike the diverse food traditions of the United States.\"\n\nThat translated to sunchoke ravioli dressed with a lemony Parmigiano-Reggiano sauce and shaved vegetables; a Dover sole served with a fennel mousseline and summer squash blossoms; and, for dessert, gussied-up apple pie made with Lady apples from the Pacific Northwest and Mid-Atlantic trees.\n\nIt was a famously American way to finish off the night, during which the prime minister compared Trump to one of the most famous presidents in American history.\n\n\"This, of course, was once the home of President Teddy Roosevelt, who I have always greatly admired,\" Morrison said. \"He was also a New Yorker. He was also unconventional.\"\n\nTrump smiled, and the dinner guests laughed at the sole acknowledgment of presidential roguery on this otherwise traditional night.\n\nEmily Heil and Jura Koncius contributed to this report.", "description": "It was all about “100 years of mateship” at the event honoring Prime Minister Scott Morrison.", "authors": ["Sonia Rao", "Pop Culture Reporter", "Roxanne Roberts", "Feature Reporter", "September At Pm", "Sonia Rao Is A Pop Culture Reporter. She Attended Boston University", "Wrote For The Boston Globe Before Coming To The Post As A Style Intern In She Officially Joined The Features Department In", "Roxanne Roberts Is A Reporter Covering Washington'S Social", "Political", "Philanthropic Power Brokers. She Has Been At The Washington Post Since"], "top_image": "https://www.washingtonpost.com/resizer/n8bkYLHaW0cBSYMqPCFe6ztmJ1w=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HYLDYGW4DII6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-20"}