{"pub": "metro", "url": "https://metro.co.uk/2019/10/29/nine-year-old-boy-told-not-doodle-class-lands-job-decorating-restaurant-drawings-11002030", "downloaded_at": "2019-10-29 08:42:20.652987+00:00", "title": "Boy told not to doodle in class decorates restaurant with his drawings", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nJoe Whale, nine, kept getting into trouble for doodling during classtime.\n\nRather than shutting down the habit of scribbling in his workbook, Joe’s parents decided to encourage his creativity by sending their son to an after-school art class.\n\nHis teacher recognised Joe’s talent and posted his work all over Instagram, which led to something pretty wonderful.\n\nNumber 4, a restaurant in Shrewsbury, contacted Joe’s teacher to ask if the nine-year-old could come to the building and decorate the dining room with his drawings.\n\nAdvertisement\n\nAdvertisement\n\nEvery day after school Joe’s dad drives him to the restaurant so he can doodle his ideas straight on the wall. Once he’s all done, the work will remain there permanently.\n\nJoe was told to stop doodling in class (Picture: CATERS NEWS AGENCY)\n\nDad Greg said: ‘Joe is a really talented little boy, he’s excelling at school, he’s a great footballer and cricketer, but drawing is definitely what he is most passionate about.\n\n‘It’s actually quite annoying, he’s better than me at most things.\n\n‘He was in school getting frustrated at the little amount of art he could do so he used to doodle on the table’s whiteboard in class and get into trouble for doodling\n\n‘His mum and I decided to get him into an art class outside of school called Bloom, he’s been there for about six weeks and he loves every minute of it.\n\n‘His drawings blew his teacher away and they gave him his own wall to keep doodling on which he does every week when he goes there.\n\n‘A few weeks into his classes, his teacher asked if she could post his work on her Instagram for everyone to see and a short while later we got another call from her about a restaurant who had seen his work.\n\nHe now spends hours doodling on the wall of the dining room (Picture: Caters News Agency)\n\n‘They wanted to get Joe into their restaurant to complete an art piece on their wall, and it was in their main dining area, we were over the moon.\n\nAdvertisement\n\nAdvertisement\n\n‘I asked Joe and he of course leapt at the chance to do it so we have been going there after school where for a couple of hours a night he’ll put his creativity on their wall.\n\n‘Joe loves doodling and we’re so proud of everything he’s achieving, the fact that a completely independent business has asked our nine-year old son to do a professional piece of work for them is incredible.’\n\nGreg posted Joe’s work on LinkedIn, where it quickly racked up more than 1,500,000 views and comments.\n\nHis art teacher said she recognised Joe’s skills right away.\n\n‘I first met Joe several weeks ago, he was a bit frustrated at school because he couldn’t doodle as much as he wanted to and had been asked to stop,’ said Kerry.\n\n‘I asked his parents for some of his work to assess his level and could not believe what I was looking at, we moved him into an older class straight away.\n\n‘His work is very exact and immaculate, it’s very balanced, he goes straight to ink and creates perfect work straight from the start, no practising beforehand.’\n\nCan he decorate our offices next?\n\nMORE: Narcissists are less likely to experience stress and depression, suggests new research\n\nMORE: The 4 best facials in London to avoid the curse of winter skin\n\nAdvertisement Advertisement", "description": "Joe Whale, nine, kept getting into trouble for doodling during classtime. Rather than shutting down the habit of scribbling in his workbook, Joe's parents decided to encourage his creativity by...", "authors": ["Ellen Scott"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_93534856_1572337332.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-29"}