{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7626943/Bear-wanders-Colorado-mans-backyard-roll-snow-play-soccer-ball.html", "downloaded_at": "2019-10-30 00:13:38.420540+00:00", "title": "Bear wanders into a Colorado man's backyard to roll around in the snow and play with a soccer ball", "language": "en", "text": "A playful bear in Colorado took a break from preparing for hibernation to play with a soccer ball on a snowy day.\n\nThe bear wandered into the backyard of Boulder resident Scott Willhite who captured the surprising moment.\n\nHe told Storyful that he was inside home with two sons when the furry animal waltzed into view on Sunday.\n\n'I was talking on the phone when I suddenly saw a bear walking through the backyard,' he said.\n\nScott Willhite of Boulder, Colorado, captured the moment a black bear (pictured) rolled around in the snow and played with a soccer ball in his backyard\n\nThe video shows the bear tearing into a soccer ball next to the family's trampoline as it rolls around on the snow covered ground.\n\nPieces of snow and foam get caught in his fur as Willhite's two boys looked on in awe.\n\nHe said: 'The boys loved it and could not stop giggling. The ball, however, did not fare well.'\n\nPictured: The bear lounging in Willhite's backyard as he and his two sons watch from inside their home\n\nOne person joked that 'there's a child in the house who's going to need a new soccer ball for Christmas!'\n\nPeople on social media fell in love with the rambunctious bear.\n\nOne woman wrote: 'We can all learn from animals. Even though they have to work hard to gather food and feed their families, they still take time to “live in the moment“ and play and enjoy life!'\n\nAnother said: 'Cuteness Overload... From a distance of course.'\n\nOne person joked about the destroyed soccer ball.\n\nHe said: 'I think there's a child in the house who's going to need a new soccer ball for Christmas!'\n\nThe National Weather Service reported that some parts of Boulder received 7.5 inches of snow on Sunday.\n\nLater this year, this black bear (pictured) and other bears will go into hibernation until mid-March\n\nEarlier this month, Colorado saw a surprise burst of snowfall after temperatures dropped from the 70s to the 20s in just 24 hours.\n\nRoadways became hectic and authorities recorded at least 200 car crashes in Denver alone.\n\nAs the weather becomes colder, black bears will begin to hibernate.\n\nThe Colorado Parks & Wildlife say that black bears are the only type of bear found in the state and there were as many as 20,000 bears as of 2016.\n\nBears will go into hibernation around November and will typically not emerge until mid-March.", "description": "Scott Willhite of Boulder, Colorado, captured the cute moment a black bear wandered into his backyard to roll around in the snow and play with his sons soccer ball on October 26", "authors": ["Lauren Edmonds For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/17/20339976-0-image-a-8_1572371177902.jpg", "published_at": "2019-10-29"}