{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/trumps-decisions-on-syria-bear-all-the-hallmarks-of-his-america-first-foreign-policy/2019/10/14/99e31242-eec7-11e9-89eb-ec56cd414732_story.html", "downloaded_at": "2019-10-15 12:29:05.574999+00:00", "title": "Trump’s decisions on Syria bear all the hallmarks of his ‘America First’ foreign policy", "language": "en", "text": "But the Syria decision underscores as perhaps nothing Trump has done to date the limitations of his foreign policymaking. Trump’s action has put the Kurdish forces who have been reliable U.S. allies in the fight against Islamic State forces at the mercy of a Turkish invasion. It has scrambled alliances to the benefit of Syrian President Bashar al-Assad and Russian President Vladimir Putin. It also could allow the Islamic State to reconstitute itself militarily.\n\nAD\n\nAD\n\nThe Syria decision is the most flagrant example of policy by impulse and tweet, rather than by a serious and deliberative process, which some past advisers have said Trump eschews. Trump’s approach has produced few if any major foreign policy victories. Instead, it has led to instability, confusion and mixed signals. Its effect has been to undermine traditional alliances, significantly weaken the United States in the world and give rise to the sense that America is no longer a reliable partner.\n\nPast presidents, including his two immediate predecessors, former presidents Barack Obama and George W. Bush, have faced criticism over military and foreign policy decisions. But rarely has a president been faced with such overwhelming and bipartisan opposition to a national security pronouncement as Trump for his withdrawal of U.S. forces from northern Syria.\n\nSenate Majority Leader Mitch McConnell (R-Ky.) warned Monday of a “strategic calamity” in the Middle East if the current policy is not altered, saying it threatens to jeopardize “years of hard-won progress in the fight against ISIS.” Meanwhile, the number of elected officials or experienced foreign policy strategists in support of the president can be counted on very few hands.\n\nAD\n\nAD\n\nThe spur-of-the-moment action by the president came after a telephone call with Turkish President Recep Tayyip Erdogan and caught nearly everyone by surprise. It was one more case of a president who prefers to operate through personal interaction, through one-on-one conversations, taking his cues from leaders at the other end of the telephone line or across the table, including adversaries, rather than the advice of the advisers around him.\n\nHe has sided with Putin over the U.S. intelligence community on the issue of Russian interference in the 2016 presidential election. He has banked on a personal relationship with North Korean leader Kim Jong Un, who has written him what Trump calls wonderful “love letters” to produce a deal that would eliminate that country’s nuclear capabilities — so far to no conclusion.\n\nHe has been party to the rehabilitation of Saudi Crown Prince Mohammed bin Salman, who has been identified by U.S. intelligence as almost certainly having ordered the gruesome murder of Jamal Khashoggi, a Washington Post columnist.\n\nAD\n\nAD\n\nThe disjointedness has been on display for the past week, ever since Trump announced an initial pullback in northern Syria. That amounted to opening the door for Erdogan to do what he long has wanted to do, which was to order Turkish forces to go in and suppress the Kurdish fighters. When Trump saw the objections, he tried to suggest he hadn’t done what he did. He sent out a tweet with a warning to Erdogan. “If Turkey does anything that I, in my great and unmatched wisdom, consider to be off limits I will totally obliterate and destroy the Economy of Turkey,” he wrote.\n\nLater, when the U.S. forces still left in northern Syria appeared to be in the Turkish crosshairs, he ordered a full withdrawal. On Monday, he indicated that a small force would be kept in southern Syria. Continuing the head-spinning series of moves, and under intense criticism, he later called on Erdogan to implement a cease-fire.\n\nTrump also imposed sanctions on Turkey, after having given Erdogan the space to launch the invasion. Sanctions are a preferred weapon of choice in foreign policy. If there is a problem on the horizon, he turns to sanctions — or tariffs — as a solution. He thinks in terms of dollars and cents rather than grand strategy. Who is buying what from the United States? Who is taking advantage of the United States? Who can be punished or bullied for what Trump sees as taking advantage?\n\nAD\n\nAD\n\nWhen Trump pulled the United States out of the Iran nuclear agreement, against the wishes of U.S. allies who were party to that agreement, he imposed sanctions in an effort to apply new pressure on the Iranians. He and his advisers claim the sanctions are biting. For now, however, the Trump policy toward Iran has resulted in more aggression rather than less by the Iranian regime. Time will tell whether his approach was shrewd or misguided. The administration’s harsher sanctions against North Korea are credited with contributing to the start of negotiations, but those negotiations are now stalled.\n\nTrump zigs and zags because he has few foreign policy anchors and few convictions, only that others have taken advantage of the United States for decades. He lacks a knowledge of history and brings no particular context to his decision-making. Ignoring the contribution the Kurds have made to the fight against Islamic State, Trump justified the decision to let the Kurds fend for themselves by saying they were not part of the alliance that stormed the beaches of Normandy on D-Day in World War II.\n\nHe also noted that the Kurds and Turks have fought one another for centuries, offered as a reason for the United States to stay out of such a long-standing conflict. Others might see it differently, as one more example of the complexities of the Middle East and the challenges that have presented every U.S. administration dating back decades.\n\nAD\n\nAD\n\nTrump’s frustrations with the tangled politics in the Middle East have been shared by other presidents, but it has long been an article of American policy that the United States can try to play a constructive role through its presence and leadership, diplomatically and sometimes militarily.\n\nThe president’s actions over the past week have had a destructive impact in Syria. Now he is trying to mitigate the damage, perhaps too late. What the world has seen might be an extreme case of Trump’s foreign policy decision-making, but it flows from the same impulses that have long guided him in his approach to the rest of the world.\n\nAD", "description": "His actions have had a destructive impact on Kurdish allies, generating some of the harshest criticism of his presidency.", "authors": ["Dan Balz", "Chief Correspondent Covering National Politics", "The Presidency"], "top_image": "https://www.washingtonpost.com/resizer/gkKrEhYcz3Q9cLhvPznU9fOpfFs=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7Q4CCAXO6AI6TBUT6SD6IZ4EVI.jpg", "published_at": "2019-10-14"}