{"pub": "metro", "url": "https://metro.co.uk/2019/10/15/emily-ratajkowski-even-tan-strips-off-miami-beach-10923840", "downloaded_at": "2019-10-15 16:29:55.905379+00:00", "title": "Emily Ratajkowski is all in for an even tan as she strips off on Miami beach", "language": "en", "text": "Emily looked stunning in a black swimsuit (Pictures: MEGA)\n\nEmily Ratajkowski has proven she’s all in for an even tan as she stripped off on the beach while enjoying a chilled day in Miami.\n\nWe’re getting major holiday envy right now.\n\nThe model, who previously opened up alongside Kourtney Kardashian about her secrets to being confident, looked mega chilled as she enjoyed a day on the beach.\n\nEmily, 28, looked stunning in a black swimsuit (from her own brand of course) as she rocked a leopard print hat and enjoyed a beer. Why not?\n\nThe star enjoyed a relaxing beach day (Picture: MEGA)\n\nPulling her swimsuit down, she went topless at points to avoid an uneven tan – although she appeared to suffer a spot of sunburn on her thigh.\n\nDon’t shun the factor 50, girl. It works wonders.\n\nThe star could also be seen diving into a Ariel Levy’s memoir The Rules Do Not Apply as she enjoyed her relaxing day.\n\nAdvertisement\n\nAdvertisement\n\nThe Gone Girl actress previously opened up about being a body positivity activist, admitting she grew up ‘ashamed’ of her body.\n\nShe’s avoiding an uneven tan at all costs (Picture: MEGA)\n\n‘I’m really about body positivity, for me I grew up and I developed super young. I was criticised at 13,’ she explained to People.\n\n‘I felt really ashamed of my body but I’ve come full circle, and now I’m like, “Do your thing!” I really want young girls to see that and feel that way about themselves.’\n\nMeanwhile, she previously shared her thoughts on having inner confidence alongside Kourtney, explaining: ‘[When I post nude pictures on Instagram] the initial reaction is, “Oh my god, naked again” or “She’s so stupid” and “Do you have nothing else to offer?”\n\n‘But actually, I’m running a business out of this. It’s about personal branding.’\n\nShe added on Poosh.com: ‘I love the idea of white, older men in suits saying they don’t take me seriously [in business] while I make more money than them.’\n\nPreach, girl.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Emily Ratajkowski basically wore flip flop heels in Paris and looked slightly dangerous\n\nMORE: Emily Ratajkowski grew up ‘ashamed’ of her body because she ‘developed super young’", "description": "Emily Ratajkowski is all in for an even tan as she strips off on beach", "authors": ["Louise Griffin"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_90009776_1571152843.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-15"}