{"pub": "reuters", "url": "https://in.reuters.com/article/us-brazil-trade/brazil-aims-to-forge-more-trade-accords-as-bolsonaro-heads-to-asia-idINKBN1WU328", "downloaded_at": "2019-10-15 23:54:42.047634+00:00", "title": "Brazil aims to forge more trade accords as Bolsonaro heads to Asia", "language": "en", "text": "Brazil's President Jair Bolsonaro looks on during a ceremony at the Planalto Palace in Brasilia, Brazil, October 15, 2019.REUTERS/Adriano Machado\n\nBRASILIA (Reuters) - Brazil aims to conclude free trade agreements between the South American free trade bloc Mercosur and Singapore and South Korea by next year, as it also eyes deals with several other Asian countries, a Brazilian diplomat said on Tuesday.\n\nMercosur will hold initial trade talks with Vietnam and Indonesia later this year, while it could seek to expand an existing trade deal with India and is also interested in an accord with Japan, said Reinaldo José de Almeida Salgado, the Foreign Ministry’s secretary for bilateral negotiations with Asia.\n\nBrazil is the largest economy in the four-country Mercosur bloc that also includes Uruguay, Paraguay and Argentina and therefore plays a major role in its trade negotiations held by the group.\n\nSalgado made the remarks in a briefing on Brazilian President Jair Bolsonaro’s trip to Japan and China, which takes place next week amid the country’s efforts to expand trade with the region.\n\nThere are currently no plans to initiate free trade talks between China and Mercosur, he said.\n\nSalgado said he expects that other agreements will be signed between China and Brazil in connection with Bolsonaro’s visit. For the agriculture sector, the agreements would be related to “four or five specific products,” he said\n\nAgreements with China related to renewable energy, investment and transportation are also possible, he said.\n\nBrazil wants to send a message that it is open for business, Salgado said.\n\n“We don’t intend to be selective in relation to trade opening,” Salgado said.", "description": "Brazil aims to conclude free trade agreements between the South American free trade bloc Mercosur and Singapore and South Korea by next year, as it also eyes deals with several other Asian countries, a Brazilian diplomat said on Tuesday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191015&t=2&i=1441284211&w=1200&r=LYNXMPEF9E246", "published_at": "2019-10-15"}