{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/lorraine-kelly-exposes-unrecognisable-x-20558554", "downloaded_at": "2019-10-11 12:54:54.638261+00:00", "title": "Lorraine Kelly exposes 'unrecognisable' X Factor: Celebrity star Jeremy Edwards", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nLorraine Kelly managed to expose the true intentions of X Factor: Celebrity stars Jeremy Edwards and Brendan Cole.\n\nThe Holby City actor and former Strictly Come Dancing star are taking to the stage for the celebrity version of the ITV singing contest.\n\nThe celebs are looking to impress judges Simon Cowell, Louis Walsh and Nicole Scherzinger and scoop a record deal.\n\nBut Lorraine joked that the friends, who could be the Robson and Jerome of a generation, just wanted to have a \"jolly\" in LA.\n\nAsking why they decided to take part, Lorraine said: \"It wasn’t that you wanted a jolly in Los Angeles by any chance?\"\n\n(Image: ITV)\n\n(Image: ITV)\n\nGiggling Jeremy replied: \"I love that you see straight through us Lorraine. Everyone is giving it all 'I always wanted to be this singer'.\n\n\"We are like 'you want to pay us to go to Beverly Hills? First class Beverly Wilshire?' Boom.\"\n\nWhile Brendan added: \"We worked very hard.\"\n\n(Image: ITV)\n\n(Image: BBC)\n\nLorraine viewers took to Twitter after noticing how different Jeremy looked form his Hollyoaks days.\n\nOne viewer said: \"OMG! Look at Jeremy Edwards!! Ha! I had to google him to see if he was the person I thought he was!!\"\n\n\"He's totally different to his hollyoaks days!! I had the biggest crush on him back then....,\" added another.\n\nA third said: \"He's definitely looking like a dad these days :)\"\n\n(Image: ITV)\n\n(Image: ITV)\n\nBrendan explained that the pals , who have known each other for over a decade, did got to \"muck around\" but also took the competition seriously.\n\nJeremy added: \"Brendan had the gig. They were interested in Brendan for obvious reasons. Some people like you.\n\n\"He gave me a call. He said 'look dude I don’t want to do it on my own, you want to come? I said 'yes'. We just had the best time. I think you’ll be pleasantly surprised.\"\n\n(Image: ITV)\n\n(Image: ITV)\n\nThe pair joked that pulling out some dance moves would be their secret weapon if the singing goes wrong.\n\nBrendan also pointed out that he had switched allegiances from the BBC to ITV.\n\nOn Strictly, he said: \"My friends are still there. I’ve watcheda couple of the episodes, not all of them.\n\n\"The great thing about this, I had 15 fanatic years on Strictly. I’m proud of the whole thing. That chapter has passed and now I’m on the other channel.\"\n\n*Lorraine airs weekdays on ITV at 8.30am", "description": "The Holby City actor confessed Lorraine had seen 'straight through' him and former Strictly dancer Brendan Cole", "authors": ["Kyle O'Sullivan", "Image", "Itv", "Bbc"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20558591.ece/ALTERNATES/s1200/0_EHP_CHP_111019Lorraine_5871JPG.jpg", "published_at": "2019-10-11"}