{"pub": "independent", "url": "https://independent.co.uk/travel/hotels/barcelo-montecastillo-hotel-review-golf-course-jerez-spain-cadiz-a9094676.html", "downloaded_at": "2019-09-07 02:09:32.459602+00:00", "title": "Barceló Montecastillo review: Is this Spain’s best hotel for golfers?", "language": "en", "text": "In a nutshell: A health-focused hotel with a world-famous golf course, two professional football pitches (used by Premier League teams) and even a 19th-century castle, all within its grounds.\n\nThe neighbourhood\n\nSet on the outskirts of Jerez de la Frontera in the Andalusia region of southern Spain, this hotel is situated in the country’s oldest wine-growing district. Jerez is one of three towns that form a geographical triangle inside of which the microclimate is ideal for producing sherry.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThat’s why it’s the most popular tipple in the region, with Barceló Montecastillo serving every possible type, so expect to try plenty during your stay.\n\nBesides the sherry, the nearest beach and the charming port city of Cádiz are only 30 minutes away by car, while the train station and airport are a 10-minute drive.\n\nThe vibe\n\nLocated in the heart of the Andalusian countryside, the tranquillity of this hotel will appeal to anyone trying to escape the buzz of city life. Apart from the occasional low hum from the Formula One racing circuit next door (there’s a private driveway for racing cars to drive straight from the track to the hotel), you’ll hear only the sound of the various bird species that live in the grounds.\n\nAround a third of the clients are return visitors, so there’s a friendly vibe within the restaurants and communal areas. And children are welcome, with plenty of family-friendly activities on offer.\n\nThe look\n\nNewly refurbished, the whole resort has a timeless luxury to it. Guest rooms and communal areas feature beautiful old oak furniture, while a neutral colour palette throughout makes rooms feel cosy yet spacious.\n\nThe main restaurant opens out onto a large terrace overlooking the golf course, which allows for al fresco dining throughout the day. But the most attractive part is the restored 19th-century castle that towers over the golf course. It comes with its own terrace and is now used as a conference space or wedding venue.\n\nBed and bath\n\nThere are 124 rooms in the main five-star hotel, including five suites. If you’d prefer a villa, either with one or two separate bedrooms, there are 20 to pick from in the surrounding grounds. A smaller four-star hotel opened last year, too. Located next to the children’s swimming pool, it has 49 rooms and 18 villas.\n\nThe superior room we stayed in, situated in the main five-star hotel, had a huge bed with plenty of soft linen and pillows to bury yourself in at night. There’s also heaps of space, with a separate seating and desk area located next to the bed. But the large balcony was our favourite spot; overlooking the golf course, it was a peaceful place to watch the sunset.\n\nFood and drink\n\nRestaurant El Lagar is the main place to eat, serving breakfast, lunch and dinner. Depending on the day, there’s a mix of traditional Spanish dishes and international cuisine, which you sample while soaking up the Andalusian sunshine on the terrace.\n\nOur top dishes were the duck and strawberry salad and chilled pea soup with mango sorbet (both with sherry, of course). Plus the breakfast smoothies, made fresh each morning.\n\nCafe Ricardo’s, a snack bar located next to the main restaurant, has a more relaxed atmosphere. There’s a smaller pool bar located next to the adults-only pool too, which serves drinks and snacks throughout the day.\n\nPools, spas and public areas\n\nThere’s so much to do in this hotel that you may struggle to fit it all in. Firstly, head to the spa. It has an indoor hydrotherapy circuit, saunas, a hydro-massage bathtub, a swimming pool, gym and six treatment rooms. Then there are two outdoor swimming pools, one for adults and the other for kids – the latter has a play area in the middle.\n\nThere’s also an outdoor play area and kids club, both within the resort. Two Fifa-approved football pitches designed by Sir Alex Ferguson, a jogging track, tennis courts, four paddleboard courts and an 18-hole golf course designed by ex-professional golfer Jack Nicklaus, all provide plenty of opportunities to get your exercise fix.\n\nNuts and bolts\n\nRoom count: 124 rooms and 20 villas in the main five-star hotel; 49 rooms and 18 villas in the new four-star\n\nFreebies: Bottled water and chocolates with the turn-down service\n\nIn the bathroom: Pure Herbs toiletries\n\nWifi: Free\n\nExtra charges: Laundry, airport transfers and the babysitting service – parking is free though\n\nMinibar prices: A beer, still water and a packet of crisps are all €2.50 (£2.25) each\n\nDisability access: There are three disabled rooms available\n\nPet policy: Dogs and cats are allowed in the villas\n\nBottom line\n\nBest thing: The large number of facilities available to guests\n\nWorst thing: The swimming pools don’t open until 11am\n\nPerfect for: Golfers and families\n\nNot right for: Partygoers\n\nInstagram from: The main restaurant’s outdoor terrace at sunset for a beautiful shot of the golf course and lake\n\nRoom rate: From £80, B&B\n\nbarcelomontecastillo.com", "description": "In a nutshell: A health-focused hotel with a world-famous golf course, two professional football pitches (used by Premier League teams) and even a 19th-century castle, all within its grounds. The neighbourhood", "authors": ["Zoe Galloway"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/06/15/barcello-hote-golf-course-and-castle.jpg", "published_at": "2019-09-06"}