{"pub": "americanconservative", "url": "https://nytimes.com/interactive/2019/07/01/nyregion/nyc-pride-portraits.html?smid=nytcore-ios-share", "downloaded_at": "2019-10-25 22:05:04.114540+00:00", "title": "‘Gay,’ ‘Femme,’ ‘Nonbinary’: How Identity Shaped the Lives of These 10 New Yorkers", "language": "en", "text": "The words we use to identify ourselves can give insight into our values, our personality, our appearance, our profession and our passions.\n\nBut identity is complex, and is becoming even more so as the vernacular of L.G.B.T.Q. identity continues to evolve.\n\nWe had submissions ranging from a 34-year-old Disney-obsessed, transgender woman to a 63-year-old Nuyorican AIDS activist who is H.I.V. positive. Many respondents listed multiple, intersecting identities, and some discussed seeking acceptance and community and finding it right here in New York City.\n\nAs these unique descriptions poured in, we were reminded that we are all humans with a story to tell.\n\n“I feel like with all I’ve been through that my life is a calling. That I have a purpose,” he said. “I’m here to say: I am here. Who can I help? What else can I do?”\n\nWest recently left a position as a senior design director for a shoe brand, but it does not mean he is slowing down or thinking about retirement. That’s just not who he is, he said.\n\n“I’m here as proof. You just keep on,” he said. “Don’t give up. Live your life. Take advantage of it.”\n\nThe current outlook on H.I.V. and AIDS is different than it was 33 years ago. There are treatment plans involving medicines that manage the disease and some believe a cure is on the horizon . But still, West said, he knows that being diagnosed can take a mental and emotional toll on the newly diagnosed, especially if they are young, poor and black.\n\nWest said he shared his story with the hope that it inspired others: “It’s important to me that people, especially the young black boys out there, understand you can continue living your life.”\n\nHis career would continue on with fanfare: vice president of footwear at Ann Taylor; senior design director at Tommy Hilfiger and Calvin Klein; top roles at Target and American Outfitters. “In spite of what I’ve been through,” he said,” I’ve pursued my dreams.”\n\n“Your guess is as good as mine,” he said when asked how he believed he survived, relatively unscathed. “All I know is I have survived. And I’m not only happy about that. I’m very proud about that.”\n\nWhile his friends and millions more around the world succumbed to the virus that causes AIDS, West not only managed to live, he did so while barely experiencing any major symptoms of the crippling disease.\n\nHe was a shoe designer, working alongside the couturiers at the Givenchy headquarters in Paris. He had already achieved a great deal in his career. By the time he was in his 30s, the poor, black boy from southeast Washington D.C. had graduated from the Pratt Institute and moved to Europe, where he would spend more than a decade designing footwear — in France as well as Italy and Germany — for brands like Christian Dior, Louis Feraud and Esprit de Corp Europe. If the run ended, he thought, it had been a good one.\n\nBut once West’s own H.I.V. positive diagnosis arrived, the end, he felt, was near: “It was a death sentence.”\n\nA gay man living in Paris in 1986, he was attending, he said, a funeral a week. He had lost a dozen acquaintances to what was being called “the gay plague” and would go on to lose dozens more, including his close friend, Patrick Kelly, the trailblazing black fashion designer .\n\nAt 33, Melvin West knew it was only a matter of time — months maybe, a year for sure — before he would be dead.\n\n“It’s like, oh yeah, we have to go out and live authentically,” she said.\n\n“One thing I think about a lot is: How many humans does a human in New York look at, as opposed to anywhere else in the world? Not even in L.A. would someone come across so many people, because you’re in your car half the time. But in New York, most of us don’t own cars. Something really special about queerness, broadly, in New York City is that we have to be more visibly out more often, just as a result of how the city works.”\n\nA military veteran, Bishop has lived in the South and Pacific Northwest. But it is New York City, she said, where her role as a provocateur feels most natural.\n\nA commitment to being political is central to Bishop’s identity as a self-described kinky, femme, polyamorist dyke. She likes women and sex and she wants you to know that about her.\n\nFeminine, Bishop argued, is often seen as docile, tame and meek. But femme for her is a way of “weaponizing femininity” and repurposing it. “It’s a reclamation of this thing that is so often seen as less than. Taking it and empowering it,” she said. “It’s a rose with its thorns intact.”\n\nShe considers her use of ‘femme,’ for example, strategically chosen for etymological focus on the feminine. “There’s something powerful in the erasure of the masculine,” she said.\n\nTo understand the words Bishop employs to describe herself is to understand Bishop herself. “I exist very politically,” she said.\n\nBishop feels there’s a growing danger, particularly as a member of the L.G.B.T.Q. community, in getting too safe and too innocuous.\n\nAnd although “queer” has been resurrected by L.G.B.T.Q. millennials, Bishop is not interested in the word. She said it, like Pride itself, had been co-opted and commandeered.\n\nIt’s why she prefers calling herself a dyke instead of a lesbian and why she will coyly call herself a pervert, knowing full well the impact of that word.\n\n“I’m evolving more each day, taking things step-by-step to be more different and confident in trying new things,” Argueta said. “Really, it’s all a learning experience of me trying to figure out who I am.”\n\nArgueta feels most comfortable expressing their masculine identity, but said they were entertaining the idea of embracing makeup as a kind of first step toward more deliberate feminine gender expression. That might be as far as Argueta goes in changing their outward appearance, they said. Or it might not.\n\n“Sometimes I feel like a boy and I express myself more masculinely,” they said. “But sometimes I feel like a girl. Why should I be put into a box?”\n\n“I began to think: Why should I have to act a certain way?” Argueta said.\n\nArgueta became a Brooklyn resident in 2017 while enrolled at Baruch College. It was during this time that they began to spend more time in New York’s L.G.B.T.Q. communities and learn more about identity, expression and attraction.\n\n“Moving to New York City gave me a greater understanding of who I was,” Argueta said.\n\n“We call it machismo. Men are expected to be very masculine and manly and to be interested in women,” Argueta said. “But that wasn’t me.”\n\nLiving on the outskirts of heteronormativity was a struggle where Argueta grew up, they said. An immigrant, they came to the United States from El Salvador with their family when they were 7, planting their roots in the predominantly Latino Brentwood community in Long Island.\n\nGenderfluid describes a person who does not solely identify as one gender identity or another, choosing instead to have the flexibility to fluctuate between genders or express multiple genders simultaneously. Pansexuality describes a person who experiences attraction to people regardless of their sex or gender identity.\n\n“Here” for Argueta is the realization that they are genderfluid and pansexual.\n\n“I just remember thinking: This can’t be it,” they said. “I know it’s cliché, but getting here has been a journey.”\n\nArgueta has always known they weren’t straight. They remember having feelings for boys as early as middle school. But after they told their mother they might be bisexual they couldn’t fight a lingering curiosity.\n\nYet wading through that murkiness of uncertainty, they said, they have discovered a kind of truth, and by extension a semblance of their identity.\n\nIf there is one thing Marvin Argueta — who uses they, them and theirs pronouns — is sure about, it is that they are, in fact, unsure.\n\n“When I was a kid struggling with this stuff, and there was nothing in my world that could support me,” Bliss said, “it was the community in Buffalo of butch dykes and high femmes that taught me what love looks like.”\n\nTen years ago, Bliss and her longtime partner, Maria, had a son, Mateo. Then in 2015, the couple married, just days after the Supreme Court passed the decision that legalized same-sex marriage.\n\n“You could still walk around the street holding your girlfriend’s hand, but it was just a lot riskier,” she said.\n\nIt was a time when, Bliss said, being openly gay in the city was more common, but there was still discrimination against the L.G.B.T.Q. community.\n\n“There used to be this energy in the city,” she said. “There was never air-conditioning and so it was like every door would be open, and you could always hear the music pouring out into the street.”\n\nAfter graduating from Sarah Lawrence College in 1993, where she studied creative writing, Bliss moved to the East Village. In the city, she waited tables for cash and danced nights away at local gay clubs.\n\nAn older lesbian, who ran a local gay bar called M.C. Comptons, would let Bliss and other youths run the coat check as a means of subtle exposure to the culture.\n\n“That’s why I say I was raised by butch dykes and high femmes,” she said of the women who ran the group. “It was honestly, for lack of a better term, a safe space to a kid who was gay.”\n\nAs a teenager, curious and exploring her sexuality, Bliss joined the Gay and Lesbian Youth of Buffalo, where she connected with peers and attended information sessions.\n\n“One of the reasons I moved to New York is I didn’t want to be the only one,” she said. “I didn’t want to be the only lesbian. I didn’t want to be the only Asian-American. I didn’t want to be the only brown person.”\n\nAdopted by a couple who found her at an orphanage near the U.S. Air Force base where they lived, Bliss was raised in the suburbs of Buffalo, N.Y. She said she had always dreamed of living in New York City, and collected magazine clippings and pictures of the city, plastering them on her bedroom wall.\n\nIt was the 1970s in the Philippines when a young mother checked into a hospital just outside the country’s capital city of Manila, gave birth to a daughter and walked out, leaving her newborn child behind.\n\nThe lizard, whom Gervich calls “Geedy,” was just one more untraditional aspect of their and Allison’s relationship: Not every couple decides to raise a reptile together, they said.\n\nIn the meantime, much of Gervich’s time is spent taking care of King Geedorah, their 8-year-old bearded dragon, named after the Kaiju monster in “Godzilla.”\n\n“For my own child’s journey,” Gervich said, “I would tell them: ‘Listen to yourself. Trust yourself. And really listen to what your heart says because the world is filled with these competing voices telling you to doubt yourself.”\n\nGervich thought of the adversity their child might face, but took comfort in the idea of being able to console them through experience and insight.\n\n“Times are different but the journey is still hard, and you never really figure yourself out and you can still have doubts,” Gervich said. “Especially for nonbinary people, the doubts aren’t just, ‘Do I really want this thing?’ But it could even feel like a question of ‘Am I real? Am I really feeling this?’”\n\nThey are considering female hormone therapy, but they put the idea on hold in an effort to start a family.\n\nIn 2012, Gervich and Allison moved to Brooklyn to find better career opportunities and found a sense of belonging in the city. Gervich landed a job as an assistant editor at an independent media company and has fully embraced their nonbinary gender identity.\n\n“I couldn’t have continued on this journey without her,” they said.\n\n“I came out to her at about the six-month mark, around the time she was moving in,” they said. As their relationship progressed, so did Gervich’s gender identity. According to Gervich, Allison, through love, had come to appreciate Gervich’s progressively developing feminine qualities.\n\nGervich met their wife at an Oktoberfest party while attending college in Portland, Ore. That night, the couple stepped outside to take a cigarette break, even though they were both trying to quit smoking at the time.\n\n“When you’re faking it all the time, you just never feel good,” they said. “While I had queer friends, who I loved, I just couldn’t accept it about myself.”\n\nGervich was raised in West Des Moines, Iowa, and transferred schools when they were young because of bullying. They responded to the bullying by trying to embrace masculinity.\n\n“My wife would be ‘Mom,’” they said. “And I think what we settled on is that our child would call me ‘Baba.’”\n\n“My wife and I are trying to start a family in the next few years, and we’re trying to do it the old-fashioned way,” said Gervich, whose wife, Allison, was assigned female at birth and identifies as a woman. The two have been together for about a decade and were married two years ago at a farm in Hillsdale, N.Y.\n\nFor Jacob “Jayne” Gervich, an assistant film editor from South Slope, Brooklyn — who uses the pronouns they, them, and theirs — identity felt like an elusive concept. Gervich, who was assigned male at birth, went from small-town Midwest boy to a self-proclaimed nonbinary trans-femme film editor and homemaking spouse. And one description they hope to attain in the future: a loving parent.\n\nThey are in a new home now, and he said the entire process had helped him realize he’s stronger than he knew. “I couldn’t be who I am if I didn’t go through the things I’ve gone through,” he said. “I just feel like I should take that and help others, you know?”\n\nLarson-Curry said he and his wife (who is a veteran and also transgender) experienced a period of homelessness when friends they were sharing an apartment with, angry at their relationship, forced them out.\n\nLarson-Curry also calls himself a “gamer geek,” and said he would like to use that hobby and his interest in web design to one day create websites and apps that help veterans, the homeless and transgender people with resources, like where to find a housing, a suitable doctor, or a mental health professional.\n\n“I remember looking in the mirror and saying, ‘This is the person I’ve been seeing my whole life. This is who I want everybody to see.’ That was just really helpful in confirming that, yes, this is definitely me.”\n\nBy 2016, with the support of his parents, Larson-Curry began taking testosterone. About a year ago he began to see certain changes — his face became more structured, his voice a bit deeper. The effect, he said, was remarkable.\n\n“My self-confidence has been raised significantly since I figured out this is my identity,” he said.\n\n“My friends were the first ones to help me realize I wasn’t just gender queer. That what I was experiencing was something more.”\n\nHe tried for years to live with the dissonance. Maybe, he thought, he was a tomboy. Then, when he became attracted to girls, he thought maybe he was bisexual. At the age of 19, Larson-Curry told his close friends how much he disliked wearing women’s clothing — and they helped him find his truth.\n\n“As trans folks, we understand we’re born in the wrong body, we just want our mind and body to match.”\n\nAt the time, Larson-Curry identified as a girl. But even at the age of nine, he knew that it wasn’t a fit. He knew people weren’t seeing the real him.\n\n“I was asked to play the role of the older guy, so I got to wear my dad’s clothes,” Larson-Curry said. “I just remember being so much more happy in that role. I remember feeling free.”\n\nHe was in a fourth grade musical, and he and his classmates were tasked with performing the Beatles hit “When I’m Sixty Four,” a song about lovers growing old together.\n\n“I want people to know,” he added, “that I consider that a beautiful thing. It’s not a sin, it’s a blessing.”\n\n“I used to say being gay is just one part of me and not an important part of me,” he said. “But now I feel like it’s an extremely important part of who I am and it defines and it characterizes how I see the world, how I move in the world and how I interact with people.”\n\nAs he has become more comfortable in his life, Jawaid’s thinking has shifted over the years.\n\nHe often thinks back to his mother’s reaction when he first told her he was gay. “She would stay up at night and just cry. She thought being gay was a disease, then a disability, then a phase.”\n\n“It was extremely difficult to reconcile the different worlds in which I existed,” he said. “One that is much more accepting of L.G.B.T. culture, almost to the point of being shocked that I would be apprehensive about my sexuality, and the other completely the opposite, not even understanding what being gay means.”\n\nThere were more contradictions, Jawaid said, when he came to the United States for college and found himself in a culture completely different from the one he was used to.\n\n“There were a lot of contradictions that were exposed to me,” he said, “and I realized this system could not be as true as I thought it was.”\n\nWith that question came doubt, and the realization that he had other questions. Why was he allowed to live in comfort while others around him suffered?\n\nGrowing up, Islam was the pillar of Jawaid’s life. He said he was “very religious,” praying five times a day and striving to live as piously as he could. But as he entered his teenage years, he found himself attracted to men. “I remember thinking: Why would God make me like this but then tell me that this is wrong?”\n\n“Even now, I can only think of one gay, South Asian man, and that is Tan France,” he said, referring to one of the stars of “Queer Eye,” the popular Netflix reboot. “We have to have more.”\n\nStill, Jawaid has faced challenges. “Growing up, I didn’t have any role models who were like me,” he said.\n\n“I don’t think I have that kind of fear, living in New York City and being so privileged,” said Jawaid, a graduate of Princeton University and the co-founder of Isometric Studio , an architecture and design firm he runs with his partner, Andy Chen.\n\nMahmud was shot and killed in 2015 after hosting a debate at The Second Floor.\n\nLike Jawaid, Sabeen Mahmud was born and raised in Karachi Pakistan. She had become a well-known progressive human rights activist, and the founder of The Second Floor, a progressive cafe and popular queer-affirming space in Karachi aimed at fostering open dialogue.\n\nWhen Waqas Jawaid considered the risks, to both himself and his family, of sitting with The New York Times to share his thoughts as a gay, partnered Pakistani man at odds with the Islamic faith, he first thought about his friend Sabeen Mahmud.\n\n“Of course transitioning is going to be a process,” Kozub said, “but at the same time, now that I’m embracing this part of my identity, there is a part of me that feels like I can finally move on with who I am. I can finally accomplish what I want without compromise.”\n\nComing out is not solely the action of informing loved ones about your sexual or gender identity, she said, but a deep introspective process of discovering who you are.\n\nIn May, Kozub, who double-majored in journalism and American studies, graduated from Fordham University as class valedictorian. She used her deadname (a reference to the name she was given at birth) one last time to mark the beginning of a new chapter.\n\nBut holding onto those accomplishments gave her a sense of victory. “I did this thing and I’m still choosing the path I want anyway,” she said.\n\nBeing an Eagle Scout, which she reached in 2015, has “taken on a deeper meaning for me since coming out as a trans woman,” Kozub said. “I initially had this impulse where I felt like I had to shed, disown or reorganize things in my life that didn’t line up with my gender identity.”\n\n“I felt that if I got the rank of Eagle,” she said, “I’d be crossing a threshold that’s seen as one of the most prestigious accomplishments of young manhood,” she said.\n\nFrom an early age, she dreamed of becoming an Eagle Scout, the highest rank in the scouts.\n\n“The two biggest things that I was expected to accomplish in my life were both entirely dependent on me identifying as a man,” she said.\n\nKozub, who was assigned male at birth, grew up with her parents and brother in a suburban home in Woodbridge, N.J, attended the same all-boys Catholic high school as her father and brother and joined the Boy Scouts.\n\n“I had gotten to the point that I realized how miserable I was,” Kozub said. “My life just felt joyless and mechanical. I was successful in my academics, I was successful in my career aspirations, but I still just felt this deep unfulfillment. I remember thinking, ‘I’m achieving more than I ever dreamed of. Why do I feel so joyless? How do I move on from here? Because something needs to change.’”\n\nOn Easter Sunday this year, Sophie Kozub, 21, overcame the most daunting tribulation she had faced in her life to date: She came out as a transgender woman.\n\n“I thought I knew something about community before that moment,” she said, “but the unconditional support I got from my friends really taught me the value of community.”\n\nIn the aftermath, Stewart’s friends in the Sirens Women’s Motorcycle Club helped clean her house, did her laundry and more.\n\nAnd then, in 2011, Stewart herself was badly injured while riding her motorcycle in Red Hook. A car hit her as she came to a stop at a red light. The accident shattered her pelvis and caused nine breaks in her lumbar spine and rib damage.\n\nIt was riding, and the community she found through it, that helped her through a number of trying times. She has lost two significant others: one former partner died in a motorcycle accident when she was struck by a truck while riding, another girlfriend died from cervical cancer.\n\n“Riding a motorcycle just felt like the one thing I was meant to do,” she said. “It was part of me. It was freedom. It was excitement. It was and it continues to be, for all the women that I know who ride, incredibly empowering.”\n\nStewart, who now works as a scenic artist and sculptor, put up with the harassment because she loved her work and excelled at it. But her true calling was riding motorcycles. She learned to ride on the sloping streets of San Francisco, where she spent a year living in 1981 after a bad breakup. Yet this was another activity, she said, that she took flak for from men.\n\nIt took working twice as hard each day, she said, to earn the little respect she was given.\n\nWhile working at the Metropolitan Opera, she was told she should have been home making babies and that she was taking jobs away from deserving men.\n\nIn the mid-1980s, Stewart attended New York University’s graduate program for scenic design. Later, she became a member of the Stagehands union, and landed an apprenticeship in the prop shop of the Metropolitan Opera.\n\nStewart — a lesbian, motorcycle safety activist and feminist — is no stranger to gender-based harassment. At 17, she left a difficult home life on Long Island for the freedom of an apartment in the East Village.\n\nShe went on: “I mean, my life hasn’t been easy, but every single time I have an adverse experience, I feel like I’ve been given all these tremendous tools to overcome it.”\n\n“I swear, I’m the luckiest person on Earth,” Cheryl Stewart, 56, said, while eating lunch at a table alongside the Red Hook waterfront, her motorcycle helmet resting at her feet.\n\n“I am a Stonewall survivor only recently sharing memories of that night.” Owen Levy, 72\n\nOn the night of June 28, 1969, Owen Levy was standing in front of the Stonewall Inn while gay men and a few drag queens danced inside.\n\nLevy, who was 22 at the time, liked the Stonewall Inn because at a time when most gay clubs, — or “wrinkle rooms,” as he liked to call them — had a customer base of older gentleman, the Stonewall Inn had a younger crowd and a good jukebox.\n\nThat night, he was waiting outside for his friend, Robin. The two planned on meeting up and dancing for a bit.\n\nRobin arrived at almost the exact same time as the police.\n\n“Let’s go across the street,” Levy recalled saying to Robin. The two men crossed the street and turned back to face the bar, not knowing that they would witness an event that 50 years later, would draw millions to New York City in commemoration.\n\nLevy has spent most of his career as an entertainment publicist, living in both New York City and Berlin, but now focuses on writing. He has published two books that discuss gay identity, including “A Brother’s Touch,” which is set in the 1970s, in a post-Stonewall New York.\n\nHis novel, he said, draws from his own experiences at a time when most people did not speak openly about their sexuality, and treated being gay like a secret club.\n\n“I realize that many younger people don’t know how it was, but this was why the police could just walk into a gay bar like Stonewall and make people’s lives difficult,” Levy said. “The biggest fear a lot of these guys had was losing their job or getting their name in the papers by being busted in a gay bar.”\n\nThe days that followed were more significant than the night itself, Levy said. He attended meetings in the first days of activism that followed Stonewall, mostly, he said, because Robin had a crush on a prominent organizer.\n\n“In the early days, if you could talk and you were relatively smart, you were a leader,” Levy said. “That’s what this movement needed at the time, a few people who were aggressive, willing and didn’t feel that they were going to be punished for being gay.”\n\nRobin died years later during the AIDS crisis, the second big war of their time, Levy said. The two men stayed close until his death.", "description": "New York has long been a haven for L.G.B.T.Q. people seeking acceptance and community. We spoke to some of those people about the ways in which their identities have changed and shaped their lives.", "authors": ["Aaron Randle", "Derek M. Norman", "Annie Tritt", "Written Derek M. Norman", "Photographs Annie Tritt"], "top_image": "https://static01.nyt.com/images/2019/06/27/nyregion/00pridevoices-hp-1/00pridevoices-hp-1-facebookJumbo-v2.jpg", "published_at": "2019-07-01"}