{"pub": "afr", "url": "https://afr.com/companies/mining/syrah-says-mysterious-madagascan-rivals-cutting-graphite-exports-20191021-p532p4", "downloaded_at": "2019-10-21 13:17:21.382940+00:00", "title": "Syrah says mysterious Madagascan rivals cutting graphite exports", "language": "en", "text": "Asked whether Syrah was a lower cost producer than the Madagascan rivals, Mr Verner said the rivals were private companies and information was scarce as a result.\n\n''It is privately funded, Chinese-driven and the addition of that material to the market is not something we anticipated coming in the volumes that it did,'' he said on Monday.\n\n\"The fact that it is private limits our ability to assess that. We know they have slightly more attractive logistic costs than we do.''\n\nBut Mr Verner said trade data suggested the Madagascan shipments to China had reduced since August, implying the Madagascan rivals were unlikely to be profitable at current graphite prices.\n\n''We see that over the last two months, according to the data that we have been able to collect and break down, that Madagascan imports into China have significantly decreased, and we see that aligning with the period that prices began to fall,'' he said.\n\n''We draw the conclusion there that the profitability ... is extremely challenging.\"\n\nThe weighted average graphite price received by Syrah in the three months to September 30 was $US391 ($570) per tonne; down from $US457 per tonne in the three months to June 30 and $US469 per tonne in the first three months of 2019.\n\nAdvertisement\n\nSyrah's unit costs were $US567 per tonne in the first half of 2019, but the company expects unit costs in 2020 to be about 20 per cent lower than 2019 levels.\n\nA feasibility study conducted by Syrah in 2015 was based on graphite prices of $US1000 per tonne over the life of the mine.\n\nMr Verner said the grades at Balama were more than double the average grade at Chinese graphite mines, and China's emergence as an importer of graphite in 2019 was a fundamental shift in graphite markets.\n\nDespite the tough times, Mr Verner said he still believed that Balama would play a critical role in supplying the world with graphite in the future.\n\nSyrah shares closed 6¢ lower at 38¢; the company's lowest share price since February 2012.\n\nThe stock has lost close to 95 per cent of its value since peaking in June 2016.\n\nMore than 17 per cent of shares in the company were sold short on October 15, suggesting many investors believe the stock has further to fall.\n\nSyrah was the most shorted stock on the ASX on October 15, according to shortman.com.\n\nAdvertisement", "description": "Struggling graphite miner Syrah says its mysterious Madagascan rivals are reducing exports amid a harsh price slump.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2716%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/3d92e0c643dae7c922134b92a494a9ffb6a32754", "published_at": "2019-10-21"}