{"pub": "hotair", "url": "https://hotair.com/archives/john-s-2/2019/10/24/vp-pence-nba-acting-like-wholly-owned-subsidiary-communist-china", "downloaded_at": "2019-10-25 03:31:28.589748+00:00", "title": "VP Pence: The NBA is ‘acting like a wholly-owned subsidiary’ of communist China", "language": "en", "text": "Vice President Mike Pence gave a speech today on US-China relations at the Woodrow Wilson Center in Washington, DC. The first ten minutes or so of Pence’s speech focused on the Trump administration’s record regarding trade. A bit later, Pence turned to the situation in Hong Kong, saying “Hong Kong is a living example of what can happen when China embraces liberty.” He also said, “To the millions in Hong Kong who have been peacefully demonstrating to protect your rights these past months, we stand with you.”\n\n“Today, China is not only exporting hundreds of billions of dollars in unfairly traded goods to the United States but lately China’s also been trying to export censorship, the hallmark of the regime, by exploiting corporate greed,” Pence said. He added, “Far too many American multi-national corporations have kowtowed to the lure of China’s money and markets by muzzling not only criticism of the Chinese Communist Party but even affirmative expressions of American values.\n\n“Nike promotes itself as a so-called social-justice champion, but when it comes to Hong Kong, it prefers checking its social conscience at the door. Nike stores in China actually removed their Houston Rockets merchandise from their shelves to join the Chinese government in protest against the Rockets’ general manager’s seven-word tweet which read, ‘Fight for freedom, stand with Hong Kong.’\n\n“And some of the NBA’s biggest players and owners, who routinely exercise their freedom to criticize this country, lose their voices when it comes to the freedom and rights of the people of China. In siding with the Chinese communist party and silencing free speech, the NBA is acting like a wholly-owned subsidiary of that authoritarian regime. A progressive corporate culture that willfully ignores the abuse of human rights is not progressive it is regressive. When American corporations, professional sports, pro athletes embrace censorship, it’s not just wrong it’s un-American. American corporations should stand up for American values here at home and around the world.”\n\nNike and the NBA have been playing at woke politics in the public sphere for a while now. They are both happy to claim the mantle of defender of human rights so long as they can market the image to kids who buy sneakers. But when it counts, when there’s no upside in it for them, they quietly side with the censors. I think this is what people on the left would call a teachable moment.\n\nYou can see the full speech below. The section on Hong Kong starts at around 22 minutes.", "description": "\"...it's not just wrong it's un-American.\"", "authors": ["John Sexton", "Ed Morrissey", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/10/Mike-Pence.jpg", "published_at": "2019-10-24"}