{"pub": "businessinsider", "url": "https://businessinsider.com/wework-ipo-we-company-history-founder-story-timeline-adam-neumann-2019-8", "downloaded_at": "2019-10-30 23:28:00.366711+00:00", "title": "The history of WeWork — from its first office in a SoHo building to pushing out CEO and cofounder Adam Neumann", "language": "en", "text": "WeWork cofounder Adam Neumann is expected to step down as chairman of the board after giving up his CEO title in September.\n\nWeWork's biggest investor, Softbank, is taking over the troubled company and giving Neumann $1.7 billion ($1 billion for stock Neumann will sell, a $185 million consulting fee, and $500 million in credit) to step down, according to The Wall Street Journal.\n\nThe nine-year-old co-working-space startup publicly filed for its IPO in August as part of The We Company, and has been in turmoil since. Its IPO has been shelved, and two WeWork executives — Arthur Minson and Sebastian Gunningham — took over as co-CEOs after Neumann left his CEO post.\n\nBut before its IPO plans were plagued by uncertainty and intense scrutiny, co-founder Adam Neumann opened the first WeWork space in the SoHo neighborhood of New York City in 2010. Since then, the company has rebranded as The We Company and expanded into other ventures, including co-living subsidiary WeLive and the \"conscious entrepreneurial school\" WeGrow, among others.\n\nRead on for the history of WeWork leading up to its first failed IPO attempt and the controversy surrounding Neumann.\n\nMelia Robinson originally authored this post, which has since been updated. Additional reporting by Lisa Eadicicco.\n\nRead more: WeWork isn't even close to being profitable — it loses $219,000 every hour of every day.", "description": "Cofounder Adam Neumann is expected to step down as chairman after leaving his CEO post in September — here's the history of his co-working startup.", "authors": ["Rebecca Aydin"], "top_image": "https://image.businessinsider.com/5d51e7671a700d0dc638b783?width=1200&format=jpeg", "published_at": "2019-10-22"}