{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/4/yanks-twins-epitome-of-baseballs-3-true-outcomes", "downloaded_at": "2019-10-05 03:49:08.159807+00:00", "title": "Yanks, Twins epitome of baseball's 3 True Outcomes", "language": "en", "text": "NEW YORK (AP) - Not until the 42nd pitch of the night was a ball was put in play to a fielder.\n\nThere were five home runs, 25 strikeouts, 14 walks, 13 pitchers and just 15 hits.\n\nThe New York Yankees’ 10-4 win over the Minnesota Twins in their AL Division Series opener on Friday was the epitome of what Major League Baseball has evolved into in 2019.\n\nA 4-hour, 15-minute meeting between power-packed offenses was dominated by the Three True Outcomes - homers, walks, strikeouts - when the defense is superfluous other than the pitcher and catcher.\n\n“Certainly entertaining. It’s harrowing to watch but it’s also it’s very refreshing when you know your team’s up and can score in bunches and it’s not going to take five to six hits,” Twins general manager Thad Levine was saying during batting practice. “The seven, eight, nine hitters in these lineups could be hitting three, four, five for other teams. And I don’t think that’s lost on either of the teams that are playing today.”\n\nIn a season with a 6,776 home runs, 11% above the previous high, strikeouts set a record for the 12th straight season - exceeding hits for the second year in a row after never doing so before since professional big league ball launched in 1871.\n\nImagine what Nolan Ryan and Randy Johnson might be doing these days? It is not farfetched to imagine the Ryan Express and Big Unit fanning 500 per season.\n\nAs for batters, the Steroid Era’s bulked-up boppers have been replaced by Stat Age sluggers. Their science-based swings send juiced-up balls soaring over supercomputer-developed shifts, designed by team science departments that sift through more data nightly than the sport produced in the entirety of its first century.\n\n“Why would I want to put the ball on the ground for the most part?” the Yankees’ Aaron Judge said. “Ninety-nine percent of the time it’s on the ground, it’s an out.”\n\nSwing high, swing low but swing hard.\n\n“I’m going to get my A swing off as much as I can rather than take a B or C swing and put it on the ground,” Judge said. “I’ve got three strikes. Why not take three chances to get one out of the park?”\n\nFun for batters, yes? For pitchers, not so much, especially in ballparks like new Yankee Stadium with its famous short porch in right.\n\nWhen Minnesota put two runners on in the eighth inning against J.A. Happ while trailing by six runs, the Yankees had closer Aroldis Chapman start to warm up. And even though the huge lead held into the ninth, Chapman entered for the final three outs.\n\n“Really, there’s never a settling game here,” said Jake Odorizzi, Minnesota’s Game 3 starter. “A team can pretty much put up runs at any point with the characteristics of the stadium, the way we’re built especially. I think we’re made for instant offense. It has the makings of some interesting games.”\n\nMinnesota outhomered the Yankees 3-2, just like the Twins did over the regular season (307 to 306). But all long balls were with the bases empty.\n\nBy time Eddie Rosario fouled out to end the game on the 362nd pitch, the seats were more than half-empty.\n\nExciting? Yes.\n\nEntertaining? Perhaps, perhaps not.\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Not until the 42nd pitch of the night was a ball was put in play to a fielder.", "authors": ["The Washington Times Http", "Ronald Blum"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/04/alds_twins_yankees_baseball_53488_c0-119-2856-1784_s1770x1032.jpg?ca57bb3c4cd767e494cfc31cf99976c98cf589b5", "published_at": "2019-10-04"}