{"pub": "washingtontimes", "title": "US Open Glance: Past champions Nadal, Cilic meet on Day 8", "url": "https://washingtontimes.com/news/2019/sep/1/us-open-glance-past-champions-nadal-cilic-meet-on-", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:01:46.985143+00:00", "text": "NEW YORK (AP) - LOOKAHEAD TO MONDAY\n\nTwo former U.S. Open men’s champions meet for the second straight night as the remaining quarterfinal spots are filled. Rafael Nadal, the No. 2 seed who has won three titles at Flushing Meadows, faces Marin Cilic, whose only Grand Slam title came at the 2014 U.S. Open. Nadal is trying to reach his ninth straight quarterfinal at a major tournament, while the 22nd-seeded Cilic aims to improve to 6-0 in fourth-round matches at the U.S. Open. A night after 2016 U.S. Open winner Stan Wawrinka advanced when defending champion Novak Djokovic retired from their match, Nadal or Cilic will move on to play either No. 6 seed Alexander Zverev or No. 20 Diego Schwartzman, who both seek a third Grand Slam quarterfinal. Defending women’s champion Naomi Osaka is in action along with surprising unseeded Americans Taylor Townsend and Kristie Ahn, while teenagers Coco Gauff and Caty McNally play their third-round doubles match against Victoria Azarenka and Ash Barty, the French Open singles champ who won the 2018 U.S. Open doubles title with CoCo Vandeweghe.\n\nMONDAY’S FORECAST\n\nChance of showers. High of 77 degrees (25 C).\n\nSUNDAY’S WEATHER\n\nMostly cloudy. High of 77 degrees (25 C).\n\nSUNDAY’S KEY RESULTS\n\nMen’s fourth round: No. 23 Stan Wawrinka beat No. 1 Novak Djokovic 6-4, 7-5, 2-1 (retired); No. 3 Roger Federer beat No. 15 David Goffin 6-2, 6-2, 6-0; No. 5 Daniil Medvedev beat Dominik Koepfer 3-6, 6-3, 6-2, 7-6 (2); Grigor Dimitrov beat Alex de Minaur 7-5, 6-3, 6-4.\n\nWomen’s fourth round: No. 18 Wang Qiang beat No. 2 Ash Barty 6-2, 6-4; No. 16 Johanna Konta beat No. 3 Karolina Pliskova 6-7 (1), 6-3, 7-5; No. 5 Elina Svitolina beat No. 10 Madison Keys 7-5, 6-4; No. 8 Serena Williams beat No. 22 Petra Martic 6-3, 6-4.\n\nSTAT OF THE DAY\n\n9 - Number of games Roger Federer has lost in his last two matches, after he began the tournament by dropping the opening set in his first two rounds for the first time in his 19 appearances.\n\nQUOTE OF THE DAY\n\n“I would do the same tomorrow.” - Patrick Mouratoglou, Serena Williams’ coach, when asked whether he had any regrets about trying to send her signals during last year’s U.S. Open final.\n\n___\n\nMore AP Tennis: https://apnews.com/apf-Tennis and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "LOOKAHEAD TO MONDAY", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/01/us_open_tennis_89302_c0-185-2265-1505_s1770x1032.jpg?51cccc4184a3754f6d5a6627c384579b7295b3ff"}