{"pub": "wsj", "url": "https://blogs.wsj.com/experts/2019/09/23/the-tax-benefits-of-a-partial-roth-conversion/?mod=rsswn", "downloaded_at": "2019-09-24 13:46:03.981461+00:00", "title": "The Tax Benefits of a Partial Roth Conversion", "language": "en", "text": "A common misconception is that a Roth IRA conversion is all or nothing, says WSJ Wealth Management Expert Peter Lazaroff.\n\nA common misconception is that a Roth IRA conversion is all or nothing, says WSJ Wealth Management Expert Peter Lazaroff. Photo: Getty Images/iStockphoto\n\nPeter Lazaroff is chief investment officer at Plancorp and blogs at peterlazaroff.com\n\nIt always hits our clients at some point after age 50. Retirement is no longer a mirage off in the distance—it’s a real event that’s coming into sharper focus. With that clarity comes new questions about turning retirement savings into retirement income.\n\nThe decade or so before retirement is critical because it’s your best chance to manage taxes now and in the future, particularly when required minimum distributions (RMDs) kick in at age 70½. If you’ve saved a lot in an IRA, then you’re going to have to take big RMDs and, potentially, pay high taxes on those withdrawals.\n\nMore In Wealth Management Why Most Annuities Aren’t Inflation-Adjusted (and Why That’s a Problem)\n\nWhy I Kicked My College Graduate Out of the House\n\nThe Problem With Bonds in a Retirement Portfolio\n\nGot a Raise? Here's How Much of It You Need to Save for Retirement\n\nWhen Income-Sharing Agreements Are--and Aren’t--the Better Option for Student Loans\n\nThe reality, of course, is that we all pay taxes. But you shouldn’t pay any more than necessary. That’s why I often suggest transferring some of your traditional IRA savings into a Roth IRA with a Roth conversion. With a Roth conversion, you move money out of your traditional IRA, pay the taxes on it upfront, and have a new source of tax-free retirement income.\n\nA common misconception, however, is that a Roth IRA conversion is all or nothing. But, in fact, you can convert smaller amounts over several years. And when you get the timing and size of those conversions right, you can stay within your current tax bracket while reducing the size of your traditional IRA and future RMDs.\n\nEssentially, you’re making smaller tax payments over time—rather paying than a boatload of taxes later in retirement--and, hopefully, less taxes overall.\n\nThe biggest benefit from a partial Roth conversion comes when your current tax rate is lower than your expected tax rate will be when RMDs kick in at age 70½. In those cases, you can calculate the exact amount of IRA assets you can afford to convert each year while staying within your current, relatively low tax bracket.\n\nFor many of our clients who choose to retire in their 60s, we find the sweet spot for partial Roth conversions is in the years after retirement and up to age 70½.\n\nConsider a couple who retire at age 65 with a $3 million portfolio, $1 million of which is saved in a traditional IRA. Their joint income has dropped from the $250,000 they were earning before retirement to about $50,000 mostly taken income on their taxable investments—dropping them into the 12% tax bracket.\n\nThis lower income bracket gives the couple a lot of headroom to convert savings from their traditional IRA without increasing their current tax bracket, so they might decide to convert $27,000 each year for five years to reduce their IRA balance by $135,000. This helps reduce the couple’s RMDs and related taxable income they must realize after age 70½.\n\nIn this particular example, someone may determine they will move beyond the 22% tax bracket and into the 24% tax bracket once they start receiving Social Security benefits. In this situation, a case can be made for converting a larger portion of your IRA and move into a higher tax bracket today, but still remain at a lower bracket than where you expect to be at the point you are taking RMDs.\n\nIf you are not able to take advantage of the years between retirement and age 70½ to perform such super-charged Roth conversions, there are other ways to get similar benefits. But what works for you will depend greatly on your own circumstances.\n\nFor example, you might stretch a partial conversion out over a longer period—say, from age 60 to age 70. This approach could allow you to convert smaller sums each year, keeping your annual income within your existing tax bracket and still removing a big chunk from your traditional IRA by the time RMDs kick in.\n\nYou also might be able to use tax deductions to offset the cost of a given year’s conversion. A good example of this is using a donor-advised fund to maximize the tax benefit of your charitable donations while also reducing the cost of a partial Roth conversion. For business owners, accelerating expenses or delaying income into a specific calendar year can also help manage the taxes associated with a partial Roth conversion.\n\nFor many people, a partial Roth conversion helps make sure you don’t overpay the government—while reducing the chance of a nasty surprise like a staggering tax bill after age 70.\n\nYou can email Mr. Lazaroff at reports@wsj.com.\n\nRead the latest Wealth Management report.", "description": "A common misconception is that a Roth IRA conversion is all or nothing, says WSJ Wealth Management Expert Peter Lazaroff.", "authors": ["Peter Lazaroff"], "top_image": "https://si.wsj.net/public/resources/images/B3-FA604_rothta_P_20190920122752.jpg", "published_at": "2019-09-23"}