{"pub": "investing.com", "url": "https://za.investing.com/analysis/where-oil-and-gold-fail-sugar-gives-investors-its-own-high-200431310", "downloaded_at": "2019-10-04 09:20:05.630249+00:00", "title": "Where Oil And Gold Fail, Sugar Gives Investors Its Own High", "language": "en", "text": "Away from the madness in and intrigue in , another commodity has been having a drama of its own over the past month. , which fell to a near one-year low just four weeks ago, has catapulted to beyond seven-month highs.\n\nThe fundamental story in sugar is a supply squeeze in its second largest producer, India.\n\nBut the technical narrative is what’s getting investors excited, or rather, giving them that sugar high.\n\nVery Undervalued?\n\nEric Scoles, commodities strategist at RJO Futures in Chicago, laid it out well:\n\n“I’m not worried about the world running out of sugar any time soon, but I think sugar is very undervalued.”\n\n“My opinion: As far as bullish opportunities go, this market is looking sweet.”\n\nRaw sugar’s most-active December contract on ICE Futures U.S. settled down for the first time in four sessions on Thursday, dropping 1.2% to 12.74 cents per lb. In the three days prior to that, it gained a net 11.5%.\n\nLongest Winning Streak Since June\n\nSugar 300-Min Chart - Powered by TradingView\n\nSince hitting a 11-½ month low of 10.68 cents on Sept. 12, sugar has been on a roll, rising in six of out of every 10 sessions.\n\nJust before Thursday’s drop, it hit 12.93 cents, its highest price since the week ended Feb. 24.\n\nThe commodity is also on track to post its third straight weekly rise in the current week, a tally that will give it a gain of more than 16%.\n\nDean Popplewell, analyst at New York-based brokerage OANDA, noted that it would be sugar’s longest winning streak since June.\n\nHe added, primarily citing India’s production deficit:\n\n“Sugar is enjoying a bull run amid concerns about tightening global supply. Estimates for the 2020/21 season suggest a shortfall of seven million tons.”\n\nSome Calling Caution...\n\nBut Popplewell also raised some cautionary flags:\n\n“There are a number of technical resistance points to the upside.”\n\n“The 55-week moving average is at 12.06, the 200-day moving average is at 12.08 and the 100-week moving average is at 12.24.”\n\nInvesting.com has a “Strong Buy” recommendation for raw sugar on its Daily Technical Outlook, projecting a resistance as high as 13.11 cents for the December contract.\n\n...Others Greater Highs\n\nHowever, Scoles of RJO Futures made an even higher call:\n\n“You should note on the chart that last year, at nearly this exact same time, prices fell below 12.50 temporarily, before spiking up from roughly 12.30 to about 14.80 in just 3 weeks.”\n\nSugar has also sealed the highest gains among all commodities over the past month, gaining 16%. In comparison, gold is down almost 1% while oil has lost more than 6%.", "description": "Commodities Analysis by Investing.com (Barani Krishnan/Investing.com) covering: XAU/USD, Gold Futures, Crude Oil WTI Futures, US Sugar #11 Futures. Read Investing.com (Barani Krishnan/Investing.com)'s Commodities Analysis on Investing.com South Africa.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-04"}