{"pub": "nymag", "url": "https://thestrategist.co.uk/article/best-long-iphone-android-phone-charger-anker-powerline.html", "downloaded_at": "2019-10-15 14:57:08.564038+00:00", "title": "This Comically Long Phone Charger Is Virtually Indestructible", "language": "en", "text": "2 items in this article It comes in white, gold and black, too. Photo: Courtesy the retailer\n\nThe friend who gave it to me is technologically obsessed and prone to spending hours researching the very best of whatever electronic item he’s bent on purchasing. After much careful consideration, he deemed the PowerLine+ to be the gold standard of cables — “the world’s most durable cable,” he said as he gifted it to me. So far, he’s been dead right. Here’s something small that will make your life instantly better: an extra-long (I’m talking a full ten feet in length) charging cable, made by Anker and available for Apple or Android phones.\n\nFor two years, I’ve used it every single day. In my house, I’ll drag it along everywhere I go. I can lie on any end of the couch and still charge my phone, or lie all the way down in bed (rather than awkwardly perch on one elbow next to the power strip), or even just ride in the backseat of a car with the phone plugged into the cigar socket and still use my phone while charging it. (Why are power outlets always located in the least convenient places possible?) Two full years of heavy use later, it hasn’t split, torn, bent, or even started to fray — and I’ve yanked, twisted, stretched, and dropped it repeatedly.\n\nMy tech-savvy friend also introduced me to the idea of line loss — meaning that with most longer charging cables, your device will charge slower — but Anker has perfected technology that allows it to actually go even faster (of course they’ve named it PowerIQ). The PowerLine+ takes all of my devices from one percent to a full charge in just about an hour. Unlike other cords I’ve tried, it also has a slim charging end, so it works with almost any phone case — even my bulky Otter Box case, which, as a person who drops her phone at least twice per day, I have to say is a godsend.\n\nAnker PowerLine+ Lightning Cable (10ft) Charging Cable £15 at Amazon UK Buy\n\nAnother Strat-endorsed phone accessory\n\nLuMee Duo for iPhone 8/7/6s/6 An Otter Box is great for protecting your phone, but when you want a case that can illuminate you for the perfect selfie, get the LuMee: “First of all: the light. You’ll find that it’s beyond embarrassing to use the LuMee Duo in public (you’re flashing a blazing rectangle of light onto yourself and everyone in the vicinity, after all), but it produces undeniably perfect photos. Turn it on and you’re awash in a warm (or incandescent, depending on your preference) radiance that’s almost angelic.” £18 at Amazon UK Buy\n\nget the strategist newsletter Actually good deals, smart shopping advice, and exclusive discounts. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.\n\nThe Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.", "description": "The best iPhone charger is ten feet long, very durable, and works for the Android as well — the PowerLine+ by Anker.", "authors": ["Alison Freer"], "top_image": "https://pixel.nymag.com/imgs/daily/strategist/2017/09/11/11-phone-charger.w1200.h630.jpg", "published_at": "2019-10-15"}