{"pub": "breitbart", "url": "https://breitbart.com/news/economists-who-study-poverty-win-nobel-prize", "downloaded_at": "2019-10-14 11:30:25.389374+00:00", "title": "Economists who study poverty win Nobel Prize", "language": "en", "text": "STOCKHOLM (AP) — The 2019 Nobel Prize in Economic Sciences was awarded Monday to Abhijit Banerjee, Esther Duflo and Michael Kremer “for their experimental approach to alleviating global poverty.”\n\nBanerjee and Duflo are both at the Massachusetts Institute of Technology and have authored several books together, while Kremer is at Harvard University.\n\nDuflo, who was woken up by Goran Hansson, secretary general of the Royal Swedish Academy of Sciences, said that getting the prize “incredibly humbling.”\n\nDuflo, who was born in 1972 in Paris, is the youngest ever to receive the economics prize. She is also only the second woman to win the economics prize, after Elinor Ostrom in 2009.\n\nDuflo noted that the profession was not always welcoming to women.\n\n“Showing that it is possible for a woman to succeed and be recognized for success I hope is going to inspire many, many other women to continue working and many other men to give them the respect that they deserve like every single human being,” she said.\n\nOfficially known as the Bank of Sweden Prize in Economic Sciences in Memory of Alfred Nobel, the award wasn’t created by the prize founder, but is considered to be part of the Nobel stable of awards.\n\nIt was created by Riksbanken, the Swedish central bank, in 1968, and the first winner was selected a year later.\n\nWith the glory comes a 9 million-kronor ($918,000) cash award, a gold medal and a diploma.\n\nLast week, six Nobel prizes were given — medicine, physics and chemistry plus two literature awards, and the coveted Peace Prize.\n\nAll but the winner of the Peace Prize receive their awards on Dec. 10 — the anniversary of Nobel’s death in 1896 — in Stockholm. The winner of the Peace Prize receives the award in Oslo, Norway.\n\n___\n\nOlsen reported from Copenhagen.\n\n___\n\nRead more stories on the 2019 Nobel Prizes by The Associated Press at https://www.apnews.com/NobelPrizes", "description": "STOCKHOLM (AP) — The 2019 Nobel Prize in Economic Sciences was awarded Monday to Abhijit Banerjee, Esther Duflo and Michael Kremer \"for their experimental", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/14/8b748c_nobel-economics-91184-esther-duflo-in-friday-oct-23-2015-file-photo-esther-640x335.jpg", "published_at": "2019-10-14"}