{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/oasis-wonderwall-wasnt-really-meg-20742334", "downloaded_at": "2019-10-30 10:48:54.121411+00:00", "title": "Oasis' Wonderwall wasn't really about Meg Matthews as Noel Gallagher unveils true inspiration", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nNoel Gallagher and Meg Matthews were once the epitome of Britpop cool, captivating fans with their wild lives and rock star antics.\n\nThe Oasis star's home was the sprawling Supernova Heights - the Primrose Hill party pad at the centre of some of their artsy gang's most debauched tales.\n\nAnd ultra-cool neighbours Jude and Sadie Frost, Kate Moss, Davinia Taylor, Ewan McGregor, Rhys Ifans, and, of course, 'our kid' Liam Gallagher, formed the inner sanctum of their glitzy circle.\n\nIt was against that backdrop that Oasis released their ninth single, Wonderwall, 24 years ago today - a song Noel reportedly said he'd written on a rainy Tuesday night for Meg.\n\n\"It's about my girlfriend, Meg Matthews,\" he was quoted as telling NME in 1996.\n\n(Image: PA Archive/PA Images)\n\n(Image: Front Page Media)\n\n\"She had a company which folded and she was feeling a bit sorry for herself. The sentiment is that there was no point in her feeling down, she has to sort my life out for me because I'm in bits had the time.\"\n\nDespite now being one of the most streamed tracks on Spotify, the song only made it to number two in the UK charts with Robson and Jerome's I Believe keeping it off the top spot.\n\nIt was originally supposed to be called Wishing Stone and be sung by Noel - although he later gave Liam a choice between that and Don't Look Back In Anger.\n\n(Image: Front Page Media)\n\n(Image: PA Archive/PA Images)\n\nNoel hinted he'd been high as a kite when he penned it. Asked by Spin magazine what songs he'd written whilst not on drugs, he admitted, \"None. Before 1997, I hadn't written a song without the aid of the old Colombian marching gear.\"\n\nAll that changed when he decided to move to the country and get clean after making Standing On The Shoulder Of Giants in 2000.\n\nAdmitting he and Meg “met through drugs”, he told The Guardian he was worried how they'd be without them.\n\n\"Our relationship was surrounded by drugs. We got married when we were p***ed, though we weren't drunk when we decided to get married,\" he said.\n\n\"When I decided I was going to come off it and change the way I lived, in the beginning it was like - how's that gonna be with our relationship? Am I still gonna like her?\"\n\n(Image: PA)\n\n(Image: Richard Young/REX/Shutterstock)\n\nDespite realising that he did indeed still like her, they split just eight months after the birth of their daughter Anais.\n\nAnd in 2002, Noel stated that Wonderwall actually had nothing to do with his ex.\n\n“The meaning of that song was taken away from me by the media who jumped on it, and how do you tell your missus it’s not about her once she’s read it is?\" he told the BBC.\n\nSo who was it about?\n\n\"It’s a song about an imaginary friend who’s gonna come and save you from yourself,\" he explained.\n\nMeg - who is believed to have pocketed £4million in the split - was understandably confused.\n\n\"All of a sudden when I was getting divorced he said it wasn't about me, so I don't really understand.\" Meg told the Telegraph in 2005.\n\nShe entered rehab in 2008 to overcome alcohol abuse and deal with unresolved emotions over the split.\n\n(Image: Getty Images)\n\n(Image: Getty)\n\n\"I hadn't dealt with my divorce... I mean I was heart-broken about me and Noel but I never... I couldn't let anyone see how badly it hurt me, so for five years I pretended that it didn't matter,\" she told the Daily Mail.\n\nNoel went on to marry Sara MacDonald in 2011, and while he still speaks to Meg for the sake of their daughter, the latter previously said there's no love lost.\n\n\"He's a great dad and he loves Anais to death and whatever went on between us doesn't affect her, but we're not the best of mates,\" she said.\n\n\"When I see him, I feel no emotion, no feelings, which is amazing because before I'd be full of it. Now, I can sit and chat with him like a normal adult. But we don't have anything in common any more - except our precious beautiful daughter. I'll always be grateful to him for her.\"", "description": "Noel Gallagher was quoted as saying he wrote Oasis track Wonderwall for his then wife, Meg Matthews, but it turns out that wasn't the case", "authors": ["Frances Kindon", "Image", "Pa Archive Pa Images", "Front Page Media", "Pa", "Richard Young Rex Shutterstock", "Getty Images", "Getty"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article10255996.ece/ALTERNATES/s1200/0_PROD-Noel-Gallagher-and-Meg-Matthews-ed.jpg", "published_at": "2019-10-30"}