{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/how-schools-are-being-designed-to-minimize-the-number-of-deaths-during-a-mass-shooting", "downloaded_at": "2019-09-05 00:42:21.416615+00:00", "title": "How American Schools Are Being Designed To Minimise The Number Of Deaths During A Mass Shooting", "language": "en", "published_at": "2019-09-05", "text": "Superintendent Bob Szymoniak demonstrates how his new high school in Michigan is being designed with places to hide from mass shooters (Screenshot: NBC News/YouTube)\n\nLockdown drills have become the norm in America as schools across the U.S. are forced to grapple with the threat of potential mass shootings every single day. Now, these schools are also being designed in new ways to minimise the number of deaths during a mass shooting. And this segment from NBC News shows just how strange things have gotten in the country.\n\nNBC News took a tour of a new school in Fruitport, Michigan that’s being designed with places where students can hide in the event of a mass shooting. Politicians have done absolutely nothing to protect America’s schoolkids, and while school administrators feel powerless to provide real safety from firearms, they’re scrambling to find design solutions for a political problem.\n\nThe segment is truly heartbreaking when you remind yourself that none of this is necessary in other wealthy countries.\n\n“No more lockers in the hallways, instead short lockers in a common area, so teachers can see 900 students at once.”\n\n“It was designed as a curve for a couple of reasons. And one of the reasons is to cut down on the line of sight of an active shooter.”\n\n“And we also installed these wing-walls to provide safety for students to hide behind if there’s a threat down the hallway.”\n\n“A grant from Michigan state police paid for impact-resistant film on the windows, and a special system to lock down specific sections of the school.”\n\n“Inside classrooms, another important wing-wall. ‘If, God forbid, there were an active shooter, and we’re back here, he can’t see us.’”\n\n“’Right, you could fit about 30 students in here sight unseen.’”\n\nThe part that the segment doesn’t address? What if the school shooter gains access to the lockdown mechanism? Presumably, there would be some kind of control panel that allowed administrators to lock people into certain sections of the school, but any school shooter could then hypothetically use that same system to their advantage, locking hundreds of kids into one area and shooting them.\n\nRemember that “common area” where teachers can see 900 students at once? What’s to stop a shooter from gaining access to the lockdown system and trapping kids before mowing them down with an assault rifle? The safety systems raise hundreds of questions like this and can potentially make students a lot less safe.\n\nMass shootings are a uniquely American problem, and yet politicians continue to tell their fellow Americans that nothing can be done to fix it. Republicans keep saying that it’s a “mental health issue,” while insisting that assault weapons are just a part of life. But every country in the world has people struggling with mental health issues.\n\nOnly one advanced nation has a gun problem where 17-month old babies are injured in random mass shootings and it’s simply accepted as a tragic but inevitable part of life.\n\nThere have been 297 mass shootings in the U.S. this year, as of August 31, defined as at least four people wounded or killed from firearms during a single event. Shootings inside churches and schools tend to get all the media attention, but the vast majority of mass shootings don’t get much media attention as a gun control issue.\n\nFor example, a 14-year-old in Alabama killed five members of his family on Monday. And the NRA will tell Americans that there simply should’ve been more guns at the scene, because the only thing that stops a bad guy with a gun is a good guy with a gun. Or whatever other bullshit talking point they’ve decided on today.\n\nYou can watch the entire NBC News segment on how schools are being designed to minimise deaths on YouTube. Or not. Sometimes we just need a mental break from it all. And if you need some peace today, give yourself permission. Maybe check out the “Funniest Dachshund Wiener Dog Compilation 2019\" on YouTube. It’s very good. And nobody gets shot just trying to live their life.", "description": "Lockdown drills have become the norm in America as schools across the U.S. are forced to grapple with the threat of potential mass shootings every single day. Now, these schools are also being designed in new ways to minimise the number of deaths during a mass shooting. And this segment from NBC News shows just how...", "authors": ["Sarah Basford", "Brian Kahn"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/f9qavixzmmpfydapju4v.jpg"}