{"pub": "news24", "url": "https://city-press.news24.com/News/divisive-in-death-the-battle-over-mugabe-rages-on-20190915", "downloaded_at": "2019-10-05 11:13:42.331209+00:00", "title": "Divisive in death: The battle over Mugabe rages on", "language": "en", "text": "News Divisive in death: The battle over Mugabe rages on\n\nAfter a tumultuous week, punctuated by twists and turns regarding the burial of former Zimbabwean leader Robert Mugabe, his family and government finally agreed to have him buried at the National Heroes Acre. But this may not be the end of the controversies characterising his after-life even as regional leaders gathered for a funeral service in Harare yesterday.\n\nMugabe died in Singapore last week at the age of 95. He had been ousted from power following a military coup in November 2017 which catapulted his former deputy, Emmerson Mnangagwa, into power.\n\nHowever, Mnangagwa’s and Mugabe’s families have been at loggerheads over the burial place of the former Zimbabwean nationalist. Earlier in the week, some Mugabe relatives told the local media that he had turned down being buried at the national shrine, the Zimbabwe National Heroes Acre in Harare, apparently to spite Mnangagwa whom he felt had betrayed him.\n\n“It is heating up; and it’s only starting to happen. There is pressure on the Mugabe family that they are taking this too far. And in any case, they stand to lose much if they do not come to terms with government,” said a government official who was part of the negotiations between the state and the Mugabe family over his burial.\n\n“All week we have been discussing his burial and this has disturbed business. It has been frustrating dealing with people who feel entitled to be above the law. And they do this when they know regional leaders who were close to Mugabe were getting ready to attend his sendoff,” he added.\n\nMnangagwa and Mugabe’s widow, Grace, reached an agreement after lengthy consultations involving close allies and family members of the late president. The agreement was aimed at having a win-win situation for both sides which meant that a private burial would be allowed while Mugabe’s final resting place will be at the National Heroes Acre.\n\n“The decision is that he will be buried at the National Heroes Acre at a private ceremony and up to Sunday, the state will preside over all deliberations which will be public,” Leo Mugabe, his nephew and family spokesperson told City Press on Friday.\n\nCatholic cleric Father Fidelis Mukonori said this week he wanted Robert Mugabe to get a great sendoff – befitting the kind of leader the former president was, as he left a mark on the national, regional and international political scene.\n\n“They have to agree and let him rest in peace. He fought a big fight and should now depart peacefully. The world will miss him more when the dust has settled,” Mukonori said.\n\nHowever, even as regional leaders and former presidents such as Thabo Mbeki, Jacob Zuma and others started arriving in Harare for yesterday’s funeral service, confusion and controversy still characterised Mugabe’s after-life as it emerged that he would only be buried next month.\n\nThis, after a visit to the National Heroes Acre where the Mugabe family – including chiefs and other traditional leaders from his Zvimba rural home – joined government officials in choosing a burial site for the former president.\n\nMnangagwa told journalists late on Friday that his predecessor’s burial would take longer because government would be building a special grave for the former leader at the national shrine.\n\n“We’re building a mausoleum for our founding father at the top of the hill at the Heroes Acre. It won’t be finished so we will only bury him after we have completed the structure,” he said.\n\nMugabe’s nephew Leo also separately confirmed this, stating that it would take up to 30 days for the special grave to be constructed – separate from those of other liberation war heroes buried there.\n\nThis effectively meant that a ceremonial state burial for Mugabe that had been planned for today was cancelled. Insiders said this also meant that negotiations would continue on whether Mugabe’s burial would still be private or would now be a public ceremony.\n\n“The importance of this is that more consultations will follow because there is a feeling among some members of the family that they can’t deny Mugabe a big sendoff in line with what he used to do for others. That is also one of the issues behind the cancellation of the ceremonial burial that was set for Sunday [today],” a close member of Mugabe’s immediate family told City Press yesterday morning.\n\nMbeki appeared to hint that Mugabe was on the verge of giving up power in 2017. He said on arrival in Harare that he had last seen Mugabe in 2017 to discuss his departure from office.\n\n“We worked together in solving some arising issues in Zimbabwe.\n\n“The last time we met was in 2017 when we were discussing his retirement. He will be sadly missed,” Mbeki said.\n\nYesterday, other current and former regional leaders from Botswana, Malawi, Zambia and Namibia attended the funeral service for Mugabe at the National Sports Stadium.\n\nThey were also hosted for a luncheon by Mnangagwa later in the afternoon.\n\nPresident Cyril Ramaphosa was among mourners at the National Sports Stadium for the funeral programme. Ramaphosa used the occasion to apologise to the rest of Africa for the recent xenophobic attacks in South Africa.\n\nSince announcing his predecessor’s death, Mnangagwa has been at pains to unite Zimbabweans since coming into power through a military coup two years ago.\n\nMugabe’s death has again fuelled divisions and tensions in Zimbabwe but the country’s leader has been calling for unity.\n\n“Today, let us put aside our differences and come together as we remember the past and look to the future as one proud, independent and free nation,” Mnangagwa told those gathered.\n\nAfter yesterday’s service, Zimbabweans now embark on a lengthy funeral wake as they await completion of the construction of Mugabe’s final resting place, even as some people still insist that the actual burial place will be in Zvimba, where his body will lie in state at the nearby Kutama Mission.\n\nWith more consultations likely in the next few weeks until Mugabe’s burial, Zimbabweans feel his funeral has been as controversial and divisive as he was in life.\n\n“Wherever they agree to bury him, the old man should now just be buried. He is a key liberator for Zimbabwe but also a tormentor and now even after his death he continues to cause problems,” said 33-year-old Mercy Gore as she jostled to view Mugabe’s body at Rufaro Stadium on Thursday. “They should just bury him.”", "description": "Even in death, he remains a divisive figure, with the state and his family engaged in a bitter tussle.", "authors": ["Memory Mataranyika", "Tawanda Karombo In Harare"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9231/79c020b4f38f4ad796b12c2645a260fe.jpg", "published_at": "2019-09-15"}