{"pub": "aljazeera", "url": "https://network.aljazeera.com/pressroom/al-jazeera-wins-stevie%C2%AE-award-communications", "downloaded_at": "2019-10-26 08:45:10.915709+00:00", "title": "Al Jazeera wins Stevie® Award for Communications", "language": "en", "text": "Al Jazeera Media Network wins a “Bronze Stevie® Award” at the International Business Awards for communications. The award was presented to Mohamed Sidi, Head of Corporate Communications of the Network, in the category of \" Communications Professional of the Year\", during a ceremony held in Vienna that honored the 2019 winners on Saturday, October 19th.\n\nUpon receiving the award, Mohamed Sidi Head of Corporate Communications of the Network, said: “I am honored to be here today to receive this prestigious award. I am thankful to the members of the jury and would like to highlight that such success would not have been possible without the collective effort of my colleagues. I am also indebted to the guidance and continued support of the Global Brand and International Communications Divisions’ management.\"\n\nCommenting on the award, Abdulla Alnajjar, Al Jazeera's Executive Director of Global Brand and Communications, said: \"We are proud of the work put forth by the communications teams and their achievements. The Stevie® Award is another recognition on a long list of prestigious international awards received by Al Jazeera reflecting its excellence and professionalism”.\n\nIt is noteworthy that “Tawasul”, Al Jazeera’s internal communications platform, was nominated for best internal communication platform on a global level. The annual Stevie® awards are granted to honor best practices and management achievements in different categories.\n\nThese awards have been dubbed by the New York Post as the Oscar of the business. This year, The International Business Awards received over 4,000 nominations from 74 countries with more than 1,000 experts who participated in the global process to select the winners.", "description": "", "authors": [], "top_image": "https://network.aljazeera.com/sites/aj_corporate/files/tawasulstevie2019.jpg", "published_at": "2019-10-26"}