{"pub": "cbc", "url": "https://cbc.ca/news/business/saudi-canada-oil-1.5285476", "downloaded_at": "2019-09-17 10:38:32.108237+00:00", "title": "What the attack on Saudi oil facilities could mean for Canada's oilpatch and Keystone XL | CBC News", "language": "en", "text": "The secure supply of Canadian oil to the United States could recapture the attention of American decision-makers following the recent attack on Saudi Arabian oil facilities, experts say.\n\nIndustry and government leaders around the world are still assessing the impact of Saturday's drone strikes on the state-owned Saudi Aramco facilities.\n\nThe attack disrupted about five per cent of global crude supplies, sending oil prices soaring.\n\nThe news also saw Canadian energy stocks surge by double digits during Monday's trading amid concerns the impact on oil markets could last months.\n\nCanadian crude — overshadowed by soaring U.S. shale oil production in recent years — could receive greater focus with renewed discussion about secure energy supplies, said Rory Johnston, a commodity economist at Scotiabank.\n\nThe Abqaiq oil processing facility targeted by the attack is some 330 kilometres northeast of the Saudi capital of Riyadh. (CBC)\n\n\"Historically, we've seen more of the sentiment toward the Canadian oil sector as being couched in terms of oil security, which as a concept has kind of fallen by the wayside,\" Johnston said.\n\n\"This will likely raise that energy security narrative back to the forefront of public discussion, which all else equal, should benefit the Canadian oilpatch as a source of secure supply — politically secure and right next door to the United States.\"\n\nWhile Canadian pipeline constraints make it difficult for oil companies to get more Alberta oil to market currently, Johnston said, a shift in the conversation could fuel further political pressure to build projects like Keystone XL, which has struggled in the face of legal, environmental and political challenges in the U.S.\n\n\"It wouldn't necessarily accelerate the timeline of these types of projects being built,\" he said.\n\n\"I think what this does is just lessens the risk that we're going to see further delays.\"\n\nAlberta 'the most secure major source of energy': Kenney\n\nAberta Premier Jason Kenney, who was in New York on Monday to meet with institutional investors, also emphasized the message that Alberta is \"the most secure major source of energy\" in the world.\n\n\"The strike on Saudi refineries should be a wake-up call,\" he posted to social media.\n\nKenney was also reported Monday to be looking at easing mandatory oil production cuts in Alberta following those attacks.\n\nAmerican interest in secure supplies of oil from Canada was particularly strong after the terror attacks on Sept. 11, 2001, said Christopher Sands, an expert on energy policy at Johns Hopkins University in Washington, D.C.\n\nSmoke is seen following a fire at Aramco facility in the eastern city of Abqaiq, Saudi Arabia, on Saturday. Since the facility was attacked, global oil prices have surged. (Hamad I Mohammed/Reuters)\n\nThat changed during the Obama administration, he said, with greater emphasis on the environment.\n\nSands said the situation with Saudi Arabia may have Americans looking at Alberta, but it could underscore for some lawmakers how important it is Canada build on its own pipeline capacity and ensure security of its oil.\n\n\"You don't have enough capacity, and this makes us think you need redundant capacity because what if something goes wrong?\" said Sands, adding that ensuring the security of existing energy infrastructure is key.\n\nTim McMillan, president of the Canadian Association of Petroleum Producers, said the current situation in Saudi Arabia may provide more incentive to expedite projects like Keystone XL and Enbridge's Line 3, which would carry more oil from Alberta to the U.S.\n\nBut he added that even with President Donald Trump \"pushing these projects, it has been a challenge with the U.S. court system and some of the other delay tactics that opponents are using.\"\n\nThough McMillan said he's confident those projects will be built, he added he was \"less confident\" that the U.S. legal system will move any faster.\n\n\"But why on earth is Canada so beholden to the United States when we have the world's second-largest coastlines, where we have a close connection to the growing markets in Asia?\" he added.\n\nRoger McKnight, chief petroleum analyst at En-Pro International, says the impact of the attack on Saudi oil facilities likely means higher gasoline prices in Canada as early as Wednesday. (Graham Hughes/The Canadian Press)\n\nWhile Canadian producers still face challenges in getting oil to market, whether by pipeline or by rail, Ian Nieboer, managing director at RS Energy Group, said they should benefit from higher oil prices.\n\nThe question everyone is trying to answer, he said, is how long will the situation last.\n\n\"The outage itself and its duration is probably the first and most pronounced fundamental impact,\" he said.\n\n\"The longer term and more structural piece is, is there some sort of risk premium [on oil prices] that maybe enters the market as you think about the politics of the Middle East and now really the circumstances that led to this weekend's attack,\" Nieboer said.\n\nAs for gasoline prices, Roger McKnight, chief petroleum analyst at En-Pro International, says it likely means higher gasoline prices in Canada as early as Wednesday. He said it's unclear how long it's going to last.\n\nWe have no idea … where this thing is going to go because it's completely out of anyone's control. - Roger McKnight, chief petroleum analyst at En-Pro International\n\n\"We have no idea … where this thing is going to go because it's completely out of anyone's control,\" McKnight said.\n\n\"And the Saudis are going to keep things kind of close to the vest because they don't want to really upset the market completely. But the facts are facts. Five per cent of crude supply goes off the market, and prices have to go up.\"", "description": "The secure supply of Canadian oil to the United States could recapture the attention of American decision-makers following the recent attack on Saudi Arabian oil facilities, experts say.", "authors": [], "top_image": "https://i.cbc.ca/1.5283843.1568617941!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1167981222.jpg", "published_at": "2019-09-17"}