{"pub": "independent", "url": "https://independent.co.uk/news/business/news/monsoon-accessorize-cva-collapse-peter-simon-a9162006.html", "downloaded_at": "2019-10-19 10:57:10.794011+00:00", "title": "Monsoon Accessorize future hangs in balance despite turnaround deal", "language": "en", "text": "High street fashion chain Monsoon Accessorize remains in a critical condition despite securing a restructuring deal, according to new accounts filed at Companies House.\n\nThe retailer's future remains in the hands of founder Peter Simon, who committed £30m in loans to support the business following its company voluntary arrangement (CVA) restructuring deal.\n\nMonsoon Accessorize said it believes it can continue using £12m of the owner's loans, but may need to call on Mr Simon for the extra £18m unsecured loan if trading conditions substantially worsen, the accounts said.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nBut the company's auditors said that management forecasts show targets are set to be missed, meaning access to a further £18m to keep the business afloat may not be available.\n\nThe report, signed by auditors at BDO, says covenants “are expected to be breached”.\n\nShape Created with Sketch. Death of the British high street? The retailers affected Show all 9 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Death of the British high street? The retailers affected 1/9 Toys 'R' Us Customers shop at a Toys 'R' Us store. The retail chain announced plans to shut all of its US stores, becoming one of the biggest casualties of the retail shakeout amid the rise of e-commerce. The debt-plagued company announced that it has filed a motion for bankruptcy court approval to liquidate its US operations, a move that could hit 33,000 jobs. The UK retailer failed to find a buyer and said their 105 Toys R Us stores would remain open until further notice, with administrators appointed to begin \"an orderly wind-down\". AFP/Getty 2/9 New Look New Look announced it will shut 60 stores and cut 980 jobs as part of a restructuring plan agreed with its creditors. PA 3/9 Maplin A Maplin store displays closing down notices after the company went into administration. Reuters 4/9 Claire's Accessories (US only) People walk past a Claire's store in downtown Chicago. The chain that has pierced the ears of millions of teens has filed for Chapter 11 bankruptcy protection. The accessories chain said that its stores will remain open as it restructures its debt. AP 5/9 Carpetright Carpetright announced that it has secured £12.5m of emergency funding from one of its largest shareholders and that it is exploring the opportunity of seeking approval for a restructuring plan under which it would slash rents and shut stores to avoid going into administration. Reuters 6/9 MOSS BROS. Suits specialist Moss Bros has reported a drop in earnings and profit in 2017, blaming a “tough end to the year” and stock shortages which hurt sales. Chief executive Brian Brick said: “Going forward, we are planning for an extremely challenging retail environment, not least because of the uncertain consumer environment and significant cost headwinds.” PA 7/9 Mothercare Mothercare warned over profits after UK sales plunged in the run-up to Christmas 2017, with consumer spending falling in both stores and online. PA 8/9 House of Fraser The Chinese owner of House of Fraser plans to sell its majority stake in the troubled department-store chain, adding to the upheaval on the UK’s shopping streets. Getty Images 9/9 Conviviality - Bargain Booze Bargain Booze owner Conviviality could be heading for administration after failing to secure emergency funding, placing 2,500 jobs at risk. AFP/Getty 1/9 Toys 'R' Us Customers shop at a Toys 'R' Us store. The retail chain announced plans to shut all of its US stores, becoming one of the biggest casualties of the retail shakeout amid the rise of e-commerce. The debt-plagued company announced that it has filed a motion for bankruptcy court approval to liquidate its US operations, a move that could hit 33,000 jobs. The UK retailer failed to find a buyer and said their 105 Toys R Us stores would remain open until further notice, with administrators appointed to begin \"an orderly wind-down\". AFP/Getty 2/9 New Look New Look announced it will shut 60 stores and cut 980 jobs as part of a restructuring plan agreed with its creditors. PA 3/9 Maplin A Maplin store displays closing down notices after the company went into administration. Reuters 4/9 Claire's Accessories (US only) People walk past a Claire's store in downtown Chicago. The chain that has pierced the ears of millions of teens has filed for Chapter 11 bankruptcy protection. The accessories chain said that its stores will remain open as it restructures its debt. AP 5/9 Carpetright Carpetright announced that it has secured £12.5m of emergency funding from one of its largest shareholders and that it is exploring the opportunity of seeking approval for a restructuring plan under which it would slash rents and shut stores to avoid going into administration. Reuters 6/9 MOSS BROS. Suits specialist Moss Bros has reported a drop in earnings and profit in 2017, blaming a “tough end to the year” and stock shortages which hurt sales. Chief executive Brian Brick said: “Going forward, we are planning for an extremely challenging retail environment, not least because of the uncertain consumer environment and significant cost headwinds.” PA 7/9 Mothercare Mothercare warned over profits after UK sales plunged in the run-up to Christmas 2017, with consumer spending falling in both stores and online. PA 8/9 House of Fraser The Chinese owner of House of Fraser plans to sell its majority stake in the troubled department-store chain, adding to the upheaval on the UK’s shopping streets. Getty Images 9/9 Conviviality - Bargain Booze Bargain Booze owner Conviviality could be heading for administration after failing to secure emergency funding, placing 2,500 jobs at risk. AFP/Getty\n\nIf that happened, it would be up to Mr Simon to decide whether to hand the money over to the business to continue trading, renegotiate a new loan deal, or let the retailer collapse.\n\nThe auditors said the fact that Mr Simon could choose not to hand over the £18m facility if covenants are breached means “there can be no guarantee that funding sources will be available should they be needed”.\n\nThe company's ability to continue as a “going concern” therefore hangs on its ability to trade using just the £12m loan, or ensure it can access the extra funding, the accounts said.\n\nHowever, Monsoon Accessorize said it has performed ahead of forecasts for the first month of the new financial year.\n\nThe company also delivered positive underlying profits, of £1.2m in the 2018 full-year, and has continued to post positive earnings for the 2019 full-year.\n\nThe group said that trading since 2018 has been “extremely difficult” as it battled “depressed consumer spending” in the UK.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nMonsoon Accessorize suffered “slower growth in online sales” as like-for-like retail sales continued to decline in the most recent year, it said.\n\nThe stark warning comes less than a month after the retailer started to implement its CVA, after British Land dropped a legal challenge against it last month.\n\nWithout the CVA, which involves landlords agreeing to rent cuts, Monsoon Accessorize's owners claimed the chain would collapse.\n\nHowever, British Land demanded Mr Simon stump up extra money in return for agreeing to the CVA.\n\nRent reductions will take place across 135 of Monsoon's 258 stores in the UK.\n\nThe retailer plummeted to a £22.5m pre-tax loss for the year to August 2018, from a £2.2m loss a year earlier, according to the recently filed accounts.\n\nTurnover fell by 4.6 per cent to £296.4m for the year as its Monsoon Ladies and Monsoon Children brands both suffered like-for-like declines.\n\nPA", "description": "High street fashion chain Monsoon Accessorize remains in a critical condition despite securing a restructuring deal, according to new accounts filed at Companies House. The retailer's future remains in the hands of founder Peter Simon, who committed £30m in loans to support the business following its company voluntary arrangement (CVA) restructuring deal.", "authors": ["Henry Saker-Clark"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/29/14/istock-471820341.jpg", "published_at": "2019-10-18"}