{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/19/giants-launch-daniel-jones-era-against-wary-buccan", "downloaded_at": "2019-09-19 23:50:13.361206+00:00", "title": "Giants launch Daniel Jones era against wary Buccaneers", "language": "en", "text": "TAMPA, Fla. (AP) - No disrespect to Daniel Jones.\n\nThe Tampa Bay Buccaneers feel the key to beating the New York Giants is slowing down Saquon Barkley, not necessarily exploiting the inexperience of a rookie quarterback who’ll be making his first NFL start when the teams meet Sunday.\n\n“For us, we’ve got to stop No. 26. It all starts and ends with him,” Bucs coach Bruce Arians said. “Then we’ll try to contain the quarterback because he’s a heck of a lot more mobile than the other guy.”\n\nThe “other” guy is Eli Manning, benched this week with the Giants (0-2) off to a slow start with a sputtering offense and even worse defense. The two-time Super Bowl MVP has been New York’s starting quarterback since the 10th game of 2004, Manning’s rookie season.\n\nJones was the sixth overall pick in this year’s draft, and the Bucs (1-1) insist they aren’t underestimating him or the Giants’ offense, which despite averaging 420 yards per game has only scored four touchdowns the past two weeks.\n\n“I think Daniel Jones is a very bright guy. He had a heck of a preseason. They wouldn’t be making this call if he didn’t have a great preseason and them thinking he could do the job,” Arians said, referring to the rookie completing 29 of 34 passes for 416 yards, two TDs and no interceptions.\n\n“I think the biggest thing is just keeping him off balance,” Arians added of the approach to defending an inexperienced quarterback. “First and foremost, stop the run. Stop the run, try to take the easy bootlegs away and make them play from the pocket.”\n\nTampa Bay’s rejuvenated defense did a good job of slowing down Christian McCaffrey in beating Carolina last week, however stopping Barkley poses an even bigger challenge.\n\nThe second-year pro is the NFL’s second-leading rusher with 227 yards and a touchdown through two games. He 152 yards from scrimmage and scored three TDs - two rushing, one receiving - in New York’s 38-35 victory over the Bucs last season.\n\nThe Bucs limited McCaffrey to 37 yards rushing and 16 receiving, and even closed out a six-point victory over the Panthers with a confidence-building goal-line stand, though Arians cautions against comparing Sunday’s task.\n\n“They’re on different planets. Saquon’s bigger, stronger, faster,” Arians said. “He’s got more 50-yard runs than anybody I’ve seen in a long time.”\n\nJONES FILE\n\nIf there is a concern about Jones, it’s ball security. He lost three fumbles during the preseason, one on a snap and two after being hit in the backfield. His only action in the regular season was mop-up duty in the season-opening loss to the Cowboys. The mobile 6-foot-5 Duke product lost another fumble at the end of a scramble on a play where he could easily have gotten out of bounds.\n\n“You never really know when something like this is going to happen. My job is to be ready and to continue to improve,” Jones said. “I feel like I have been able to do that.”\n\nAS WINSTON GOES\n\nTampa Bay quarterback Jameis Winston played poorly in Week 1, tossing a pair of interceptions that were returned for touchdowns in a 14-point loss to San Francisco. He didn’t turn the ball over against Carolina while throwing for a modest 208 yards and one TD. In three career games against the Giants, he’s thrown five TD passes vs. one interception.\n\n“It’s a week to week league, so every game we’ve got to know going into the game we can’t beat ourselves,” Winston said. “If the team is good and they outplay us, we can live with that. But we can’t live with beating ourselves.”\n\nTHIRD DOWN\n\nThe Giants have been horrible on third-down plays and that’s one of the reasons New York has made the move to Jones. After two games, the Giants are 5 of 23 on third down, or 21.7%. The Cowboys and Bills have combined to convert 11 of 23, or almost 48%.\n\nHere’s the result. New York has 31 points. The defense has given up 63. Opponents have averaged almost 32:28 in time of possession. New York is 0-2 for the sixth time in seven seasons.\n\nRING OF HONOR\n\nFormer Bucs star cornerback Ronde Barber will be inducted into the team’s Ring of Honor at halftime. The twin brother of ex-Giants running back Tiki Barber played 16 seasons from 1997 to 2012 and is the only player in NFL history with more than 25 sacks (28) and 40 interceptions (47) in a career. He was a key performer on the dominating Tampa Bay defense that keyed the franchise’s only Super Bowl run in 2002. His father was Arians’ college roommate at Virginia Tech.\n\n___\n\nAP Sports Writer Tom Canavan in East Rutherford, New Jersey, contributed to this report.\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "No disrespect to Daniel Jones.", "authors": ["The Washington Times Http", "Fred Goodall"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/17/giants_jones_football_33885_c0-134-3213-2007_s1770x1032.jpg?8fe0010090315154949e082df37b1358fde9efb4", "published_at": "2019-09-19"}