{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7580359/NBC-exec-defends-networks-handling-Matt-Lauer-claims.html", "downloaded_at": "2019-10-18 01:09:51.851965+00:00", "title": "NBC exec defends network's handling of Matt Lauer claims", "language": "en", "text": "A senior NBC executive defended the network following stunning allegations from Ronan Farrow's new book, Catch and Kill, claiming that in two decades they had 'never heard any complaints about Matt Lauer' but conceded that there were multiple sexual harassment complaints against other senior broadcasters and executives.\n\nThe network dealt with more than half a dozen complaints about harassment which included 'less than five' against 'extremely visible' on-air talent or executives without any being terminated, the former executive revealed.\n\nThey were demoted, reassigned, or banned from being promoted to supervisory positions but retained their roles – with the knowledge of NBC's legal department and senior managers.\n\nThe disclosure comes after journalist Ronan Farrow threw NBC News into fresh crisis with his book, Catch and Kill, which claims that executives ordered him to stop reporting on Weinstein after the Hollywood mogul put pressure on the network.\n\nA former senior executive at NBC has claimed the network never heard any complaints about their biggest star Matt Lauer in the 20 years he worked there\n\nRonan Farrow's new book, Catch and Kill, claims NBC had known about Lauer's alleged sexual misconduct long before he was fired in November 2017\n\nFarrow claims that Weinstein used information about alleged sexual assault claims that had been gathered about Today show anchor Matt Lauer to help his campaign to keep the complaints against him secret.\n\nFarrow left NBC, published his Weinstein expose in the New Yorker, and revealed last week that Lauer is also accused of anal rape by a former NBC News producer who has received a seven-figure payout from the network.\n\nMegyn Kelly, who decamped from Fox News to NBC and had been seen as a major coup for the network, called for an independent investigation at NBC following the Lauer scandal during an appearance on Fox News on Wednesday night - something that both Fox News and CBS did after claims of sexual misconduct and abuse of power came to light.\n\nKelly, who was terminated 13 months into a three-year contract at NBC following pro-blackface comments, told Tucker Carlson Tonight: 'There's a question of the faith and confidence of the public and the reporting of NBC on matters involving itself. To me as a lawyer, it's just always better if you send it outside.\n\n'Then people can have more faith in it and if there's nothing to hide, you have no worries about it. You have nothing to worry about.'\n\nNow DailyMail.com can disclose that between 2001 and 2008, the network dealt with a string of complaints 'confidentially.'\n\nThe former senior executive said none of them involved Matt Lauer – meaning that other on-air talent were found to have committed sexual harassment but allowed to keep their jobs.\n\nThe findings of sexual harassment will raise questions over the underlying culture at NBC News and also has the potential to drag executives at other networks, including Jeff Zucker, now president of CNN, into the scandal.\n\nNone of the complaints from the 2000s were as bad as those levelled at Lauer, which as well as rape, include a claim that he exposed himself to a producer in his office and called her 'a tease.'\n\nA former executive with knowledge of the complaints and their outcomes characterized them as including 'creepy old man' misconduct and a 'poor love-sick supervising manager.'\n\n'There are women who still work at NBC news, who were complaining about actions of superiors, co-workers. It happens,' the former executive said.\n\nLauer, 61, was fired after an NBC producer claimed the host had sexually assaulted her in 2014. The accuser was later identified as 35-year-old Brooke Nevils, in Farrow's book\n\nNevils claimed Lauer anally raped her in his hotel room during the 2014 Winter Olympic Games in Sochi, Russia. Above she is pictured at the event with colleague Meredith Vieira\n\nGroup shot: She was photographed a few seats away from Lauer (above with a fan, Al Roker and Meredith Vieira) in an image taken at the game and again in a photo that was posted to social media (Nevils circled in yellow)\n\n'By the very nature of it, everything was kept confidential. There was never a consideration for public flogging as there seems to be an appetite for right now.'\n\nThe source told DailyMail.com that in two decades at NBC, 'I never heard any complaints about Matt Lauer. I also want to make clear that he's no friend of mine.\n\n'So the idea that this was serial? I'd like to know how that happened and I didn't know about it.\n\n'This is not the Matt Lauer apology tour. But I do understand that if something like this had happened and had been reported, it would be brought to the highest levels immediately.\n\n'Given Matt's position and his relationship with Jeff Zucker, it is quite possible that he could have gone directly to Jeff and dealt with it.\n\n'If I'm to believe Andy Lack, and I'm not sure I do believe Andy Lack, but let's take him at his word right now, he says as soon as he heard about it, he took action and he discharged Matt Lauer.'\n\nZucker spent more than two decades at NBC Universal and served as the company's president and CEO from 2007 to 2011, according to his official bio. He oversaw all of the company's television properties, prior to NBCU, from 2004 until 2007 and was president of NBC Entertainment from December 2000 until May 2004.\n\nHe joined NBC News in 1989 as a field producer for Today and spent eight years as executive producer of the morning show.\n\nHe has been President of CNN Worldwide since 2013 and was named as chairman of WarnerMedia News and Sports earlier this year.\n\nAndy Lack is currently chairman of NBC News and MSNBC, after returning to the company in April 2015. He was previously president of NBC News from 1993 until 2001, according to Bloomberg.\n\nIn 2013, an alleged settlement was made over Lauer with Today producer, Melissa Lonner (pictured that year) who told anchor Ann Curry in 2010 that Lauer had exposed himself and propositioned her\n\nCurry, who previously starred alongside Lauer until 2015, allegedly told two senior executives to do something about the host\n\nNBC News and NBC Universal declined to comment.\n\nSteve Capus was president of NBC News from August 2005 until March 2013. He went on to become executive producer of CBS Evening News but stepped down in January 2018.\n\nNeal Shapiro was President of NBC News from 2001 until 2005. He is now president and CEO of WNET, PBS' flagship station in New York.\n\nThe US Agency for Global Media, where Capus is a senior advisor, did not respond to a request for comment. WNET and CNN did not respond to requests for comment.\n\nCertain guidelines and procedures governed how complaints were handled, the source said.\n\n'Complainants would come forward and they would be handled confidentially to determine an appropriate course of action. By the way, that was not done in a silo. It was done with NBC News management, the law department, and with the most senior executives. That would all get bubbled up.\n\n'Wrongdoers could be demoted, reassigned, sometimes they were off the list of people who could possibly be promoted to a supervisory position. Those are all confidential things.\n\n'It was confidentiality, in all disciplinary actions, for all employees.\n\n'Andy Lack has his issues and Noah's got his issues but I know how they operate as executives. They were really smart men and they really drove people, sometimes in very antagonistic ways.'\n\nThe ex-senior NBC exec also told DailyMail.com that they found that Farrow's claims 'strained credibility' but said that they did not dispute Nevils' allegation.\n\n'It's incredibly serious. It should be prosecuted. That's not something for some schmo in an HR department and their boss to determine whether or not something should happen.\n\n'I am not saying that this woman is saying anything other than what is her understanding of the truth. I wasn't there. I don't have any love or affection for any of the people who are being cast as villains here.'\n\nAhead of the book's release, NBC News president Noah Oppenheim (pictured right with chairman Andy Lack) addressed staff and attempted to diffuse Farrow's allegations\n\nThe source suggested if there had been complaints, it is 'quite possible' Lauer could have gone to former NBC President and CEO Jeff Zucker 'and dealt with it.' Zucker was at NBC until 2011 and is now president of CNN\n\nThe source also questioned Farrow's ability to present a whole picture of NBC.\n\n'How long was Ronan at NBC News for? Well, I was at NBC for 20 years.\n\n'He's describing a culture that I don't recognize and frankly I have trouble believing it.'\n\nThe former exec also questioned Farrow's claims of network of hush payments.\n\n'For Farrow, a guy who's there for three years to come out with all of these kind of pronouncements, it's like wait a minute - who are you?'\n\nThe source added: 'I'm just concerned that there's a very broad brushstroke being applied to a proud and longstanding operation with a lot of people who I respect.\n\n'But it's made up of people and people who might have screwed up.'\n\nOne of the most explosive allegations in Farrow's book comes from Brooke Nevils, a 35-year-old NBC producer, who alleges that Lauer, who made $20m-a-year at NBC, anally raped her in his hotel room during the 2014 Winter Olympic Games in Sochi, Russia.\n\nLauer has denied the allegation and has described their interactions, which continued after the alleged assault, as 'consensual'.\n\nLast week, Farrow claimed that NBC had known about Lauer's alleged sexual misconduct long before he was fired in November 2017.\n\n'There were seven nondisclosure agreements, and multiple were with Matt Lauer accusers years before this incident with Brooke Nevils and the firing,' Farrow told George Stephanopoulos on ABC.\n\nFarrow added that there were 'a chain of secret settlements at this company that were covered up with victims of harassment and assault. Some of them about Lauer. Some about others in the company. This was a pattern.'\n\nIn a leaked memo on Monday, NBC News president Noah Oppenheim addressed staff and attempted to diffuse Farrow's allegations.\n\nLast week, DailyMail.com learned that veteran producers and correspondents at the network had grilled Oppenheim during a conference call over whether Nevils had used the word 'assault' while making her complaint against Lauer and why staff had not been told about it.\n\nOppenheim dodged the question and said that Nevils 'has her right to privacy on that.'\n\nHis answer was met with mocking laughter from staffers and the correspondent shot back: 'I'm pretty sure she's waived that right. We deserve answers from you.'\n\nMonday's letter from Oppenheim did not name Nevils but called Lauer's actions 'abhorrent' and said 'his abuses should never have happened.'\n\nThe lengthy memo then breaks down three examples that 'we can find that Farrow alleges are Lauer-related before 2017, with even minimal detail, involve employees who by their own admission made no complaint to management, and whose departure agreements were unrelated to Lauer and completely routine'.\n\nIn Catch and Kill, Farrow writes that in 2017, after Lauer was fired, staffers grilled network senior management about their knowledge of complaints about Lauer before the immediate two days leading up to his firing.\n\nFarrow writes that 'many in the building had heard complaints about Lauer long before that.'\n\nNoah Oppenheim told them that while Lauer's behavior was 'unacceptable', the breach was of professional, not criminal, standards of conduct.'\n\nAccording to the book, one producer, Rich McHugh, who had worked closely with Farrow on the Weinstein investigation, asked Noah Oppenheim: 'Prior to Monday, a lot of us have heard rumors of stuff about Matt… let's just say that. Prior to Monday, was NBC aware of any allegations of sexual misconduct against Matt?'\n\n'No,' Oppenheim said. 'We went back and looked, and, as we said in the statement, there has not been an allegation made internally in twenty years' in 'any place where there would be a record of such a thing.'\n\nFarrow describes this as 'qualifying language' – 'that there would be no formal HR records about a figure of Lauer's importance was practically an assumption', noting that case was similar when it came to Weinstein and Bill O'Reilly at Fox News.\n\nHe goes on to write: 'Over the course of 2018, I'd learn of seven claims of sexual misconduct raised by women who worked with Lauer. Most of the women could point to documents or other people they'd told to back up their accounts. Several said they had told colleagues, and believed the network knew about the problem.'\n\nIn 2011-2012, Farrow alleges that NBC had 'brokered nondisclosure agreements with at least seven women who had experienced alleged harassment or discrimination within the company'.\n\nSome were unrelated to Lauer. Two of those were with women who alleged harassment from two senior executives who later left the company.\n\nIn 2017, NBC allegedly brokered an agreement with a woman who accused Dateline producer David Corvo of sexually harassing her. Corvo at one point had been overseeing Farrow's Weinstein story at NBC.\n\nOne 'on-air personality' signed an NDA in 2012 after Lauer and another senior exec 'made lewd remarks' about her on open-mics during broadcasts.\n\n'I was like a hanging piece of meat,' she told Farrow. She added that her career 'took a sharp nosedive' after she rebuffed the advances. She did not make a formal report 'because she doubted the efficacy of the company's HR department…'\n\nIn 2013, another settlement was made over Lauer with Today producer, Melissa Lonner, who told anchor Ann Curry in 2010 that Lauer had exposed himself and propositioned her.\n\nLonner asked Curry, and another on-air personality, not to report her name, fearing for her career. But Curry told two senior executives to do something about Lauer.\n\nIn 2017, a senior team member of the Today show received a seven-figure payout for signing an NDA, Farrow reports.\n\n'She had also mentioned Lauer and sexual harassment to one senior vice president'.\n\nIn addition, Farrow also notes Variety's reporting soon after Lauer was fired, 'several women… complained to executives at the network about Lauer's behavior, which fell on deaf ears given the lucrative advertising surrounding Today'.\n\nThe complaints were described as an 'open secret' including that he had given one co-worker a sex toy with an explicit note about using it on her and liked to play 'f**k/marry/kill' during commercial breaks.\n\nAt a comedy roast of Lauer at a private club in 2008, Katie Couric openly joked about Lauer's indiscretions, according to the book.\n\nIn 2006, Lauer allegedly made inappropriate comments about Meredith Vieira, saying: 'Keep bending over like that. It's a nice view.'\n\nAddie Collins also told Farrow that Lauer had 'aggressively, almost obsessively, hit on her in 2000' and that she had begun a sexual relationship with him, 'afraid for her job, afraid of retaliation'.\n\nThe New York Times also reported that in 2001, a former NBC employee had sex with her over a chair in his office. She said that she felt 'helpless' during the encounter and passed out. Lauer's assistant took her to a nurse.", "description": "A senior NBC executive told DailyMail.com the network 'never heard any complaints about Matt Lauer' in the host's 20-year career, but admitted it dealt with complaints about other on-air 'talent.'", "authors": ["Louise Boyle In New York For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/18/19796704-0-image-a-73_1571246245301.jpg", "published_at": "2019-10-17"}