{"pub": "guardian", "url": "https://theguardian.com/politics/blog/live/2019/sep/12/brexit-latest-news-operation-yellowhammer-claims-government-has-taken-considerable-steps-to-avert-no-deal-dangers-in-yellowhammer-live-news", "downloaded_at": "2019-09-12 11:37:13.277567+00:00", "title": "Brexit: Boris Johnson denies lying to Queen about reasons for prorogation - live news", "language": "en", "text": "09:50\n\nLord Hope, a former supreme court judge who is now the convenor of cross-bench peers in the Lords, has rejected claims that MPs can now re-enter the House of Commons after yesterday’s Scottish court ruling that prorogation was illegal.\n\nHope, a former lord president of Scotland’s courts, said appeal judges in Edinburgh were right not to order Boris Johnson to reconvene parliament before the supreme court hears the Scottish case alongside the English and Northern Irish challenges next week.\n\nSpeaking on BBC Radio Scotland, Hope said:\n\n[On] Tuesday morning at 1.30, parliament was prorogued and it was prorogued to a given date on the command of Her Majesty, and you can’t just go back in and start without that order being set aside. Quite how you do that is a matter of parliamentary procedure and I just don’t know quite what the answer is meantime.\n\nHope, who was deputy president of the supreme court until his retirement as a judge in 2013, said he expected a speedy decision by the nine judges hearing the supreme court case.\n\nThree days are set aside but I rather doubt it will take three days. And I’m sure they will issue a judgement as soon as they possibly can, maybe for reasons given later because like everybody else, they understand the urgency of this. And it really would be a nonsense if they didn’t issue a decision until parliament resumes on 14 October. So they’ll certainly lean over backwards to get a decision out as soon as they possibly can.\n\nIt was “complete nonsense” and “baseless” for Downing Street sources and government ministers to suggest the Scottish judges were politically biased.", "description": "Rolling coverage of the day’s political developments as they happen", "authors": ["Andrew Sparrow", "Severin Carrell"], "top_image": "https://i.guim.co.uk/img/media/456baffc4d17d11a5722c097d439c2ac7291c8c6/0_142_4675_2804/master/4675.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=22e7812bb2411076f21ff0a505aaecc8", "published_at": "2019-09-12"}