{"pub": "atlantic", "url": "https://theatlantic.com/entertainment/archive/2019/09/goldfinch-review/597910", "downloaded_at": "2019-09-12 23:38:18.714432+00:00", "title": "The Goldfinch Movie Adaptation Is Faithful to a Fault", "language": "en", "text": "The Goldfinch centers on 13-year-old Theo Decker (played by Oakes Fegley and, as an adult, by Ansel Elgort), who, in the aftermath of the Met bombing, which kills his mother, swipes Carel Fabritius’s gorgeous 1654 painting, The Goldfinch, from the museum walls. For two and a half hours, viewers are shuttled between past and present storylines as Theo recovers from his loss, settles in with a new family, and gets mixed up with high-end art forgers and teen party animals. The stolen masterwork is irrelevant to most of these plot developments. In the book, it looms in the background as a symbol for Theo’s memories of trauma, his love for his mother, and the emotional meaning that humans can attach to the art around them.\n\nBut Crowley and Straughan just can’t find a way to communicate all of that on-screen. Theo locks away his feelings after the death of his mother; because the script lacks Tartt’s long internal passages, he appears as a blank slate: a polite, quiet, intermittently thoughtful boy who can never quite leave behind the childhood event that defined him. Much of the narration is provided by Elgort, a fitfully charming actor whose best performance to date (in 2017’s Baby Driver) was a largely silent one. His flat voice-over conveys nothing but the facts of Theo’s life—any real emotion is absent.\n\nWright gives the warmest, most comfortable performance of the film’s ensemble as the absentminded art dealer Hobie, a gentle craftsman who appreciates Theo’s eye for detail. Still, like most of the cast, he isn’t given much to do except wander in and out of Theo’s life, ruminating on the profundity of art and beauty. Another section of the movie is concerned with Boris (Finn Wolfhard), a Ukrainian hell-raiser who becomes teenage Theo’s best friend; while those scenes at least have some energy, they’re too screeching and annoying to resonate. Kidman, as the blue-blooded socialite who takes Theo in after his mother dies, is probably most on The Goldfinch’s wavelength—she’s placid and only occasionally suggests the turmoil churning below the surface.\n\nLovely though Deakins’s photography is, the shot that stuck out to me the most was one of lint floating in the recycled atmosphere of an airplane, a mundane bit of ephemera representing Theo’s malaise. It’s pretty, but static, something to contemplate rather than something propulsive. Intriguing ideas and images like this one pop up throughout the film to hang in the air, but are quickly forgotten as Theo proceeds with more anemic plot description. The Goldfinch is like a museum piece, a stately and handsome-looking thing that’s utterly lacking in momentum.\n\nAfter two meandering hours, the story finally picks up some speed for the final act, as a grown-up Boris (Aneurin Barnard) resurfaces in Theo’s life and engulfs him and his precious painting in a gangland adventure. Yet despite its ample length, Straughan’s script doesn’t build much narrative runway for this high-stakes caper, which seems to exist simply because something interesting has to happen at the end of all this ponderousness. Watching The Goldfinch is like having the plot of a novel read to you—not the novel itself, but merely its long and winding synopsis, a bite-size summary that still manages to feel endless.\n\nWe want to hear what you think about this article. Submit a letter to the editor or write to letters@theatlantic.com.", "description": "John Crowley’s take on Donna Tartt’s hit 2013 novel sticks closely to its source material, but fails to capture what makes the story compelling.", "authors": ["David Sims"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/finch/facebook.jpg?1568262586", "published_at": "2019-09-12"}