{"pub": "reuters", "url": "https://in.reuters.com/article/uk-athletics-world-viewership/organisers-blame-late-starts-and-boycott-for-empty-stadium-idINKBN1WF1S7", "downloaded_at": "2019-10-01 00:20:58.352552+00:00", "title": "Organisers blame late starts and boycott for empty stadium", "language": "en", "text": "DOHA (Reuters) - The embarrassingly low attendance at the world athletics championships was blamed on late start times and a boycott of the country by other nations in the region by the event’s organisers on Monday.\n\nAthletics - World Athletics Championships - Doha 2019 - Women's 200 Metres Heats - Khalifa International Stadium, Doha, Qatar - September 30, 2019 General view of empty seats in the stadium REUTERS/Kai Pfaffenbach\n\nAthletes, pundits and global television audiences have widely criticised the poor turnout at the air-conditioned Khalifa Stadium over the first three days of competition.\n\nThe 48,000-capacity venue was barely half full for the men’s 100 metres final on Saturday.\n\nOn Sunday, when the women’s 100 metres headlined the action, it was almost completely empty and pole vault bronze medallist Ekaterini Stefanidi said it was the smallest crowd she had competed in front of this year, including at the Greek national championship.\n\nThe absence of cheering fans meant the United States team who won the inaugural 4x400 metres mixed relay title on Sunday opted not to run a lap of honour and disappeared straight down the exit tunnel.\n\nThe public have also been absent from the road races, held near the waterfront.\n\nHowever, there were considerably more fans in the stadium on Monday, including a noisy contingent of Ethiopian supporters, for a programme which included the men’s 5000 metres and 400 metres hurdles finals.\n\nThere were also several groups of fans, each wearing identical shirts, dotted around the stadium which appeared to be slightly over half full.\n\nThe local organising committee (LOC) said in a statement that attendances on Friday and Saturday were “solid” but were “down on our expectations” on Sunday, which they said “coincided with the start of the working week in Qatar”.\n\n“The challenge we face with a competition schedule that is geared to support global TV viewership is that some finals are not starting until the late evening,” it said.\n\n“This impacts on the number of spectators remaining until the end of the session.”\n\nThe LOC also suggested that local audiences were more interested in middle-distance races than sprint events and said it was “confident with our additional communications (that) we will see more attendees for longer periods”.\n\nIt then mentioned the boycott imposed on Qatar by Bahrain, Saudi Arabia, United Arab Emirates and Egypt, who accuse the Gulf state of supporting terrorism, which it denies.\n\n“Our vision was for a first world championships in the Middle East. An IAAF World Athletics Championships that would welcome the world and connect to new fans. Despite facing unique challenges as hosts, in terms of the political (boycott), that ambition remains,” it said.\n\nThe four boycotting nations have, however, sent athletes to Doha, and Bahrain won bronze in the 4x400 mixed relay.\n\n“It is disappointing,” said Stefanidi. “I was all for bringing the event to new areas, different environments like the Middle East too because we needed to promote the sport.”\n\nHowever, women’s 100 metres winner Shelly-Ann Fraser-Pryce was indifferent.\n\n“I actually did notice the stadium wasn’t full but it’s part of athletics,” the Jamaican said after Sunday’s race. “Doha got the rights to host the championship, you just have to give and take. I just wanted to put on a good performance focus, I tried not to focus on the crowd.”\n\nJustin Gatlin, silver medallist in the men’s 100 metres on Saturday, took a similar view, saying: “When we are on the track, I think it doesn’t matter whether there are 100 people watching or 100,000 people watching. We want to be able to put on a great show.”\n\nThe LOC said the athletes competing at the Khalifa Stadium have “relished the experience”.\n\n“The controlled temperature conditions on the track have been ideal and fitting for world-class performances and will remain so,” it said.", "description": "The embarrassingly low attendance at the world athletics championships was blamed on late start times and a boycott of the country by other nations in the region by the event's organisers on Monday.", "authors": ["Brian Homewood", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190930&t=2&i=1435660532&w=1200&r=LYNXMPEF8T14A", "published_at": "2019-09-30"}