{"pub": "fox", "url": "https://foxnews.com/politics/california-newsom-abortion-pill-college-campus-students-for-life-america-lawsuit", "downloaded_at": "2019-10-12 06:47:14.735985+00:00", "title": "Pro-life group promises legal aid to those hurt by California's college 'abortion pill' law", "language": "en", "text": "The pro-life group Students for Life of America (SLA) said Friday it would offer legal assistance to any students or health care workers whose “conscience rights” were threatened by a new California law that requires all public universities in the state to supply students with the “abortion pill” at on-campus clinics.\n\nCalifornia Gov. Gavin Newsom, a Democrat, signed the bill into law Friday. It requires all 34 campuses in the University of California and California State University systems to provide the abortion medication on-campus to women who are less than 10 weeks pregnant. It is to take effect in 2023 as long as a state commission can raise more than $10 million in private donations to pay for it.\n\nCALIFORNIA GOVERNOR SIGNS MEASURE REQUIRING UNIVERSITIES TO PROVIDE ABORTION MEDS\n\n“California just ensured women will die in their dormitory bathrooms, bleeding out alone from the abortion pill,” SLA President Kristan Hawkins wrote on Twitter, reacting to Newsom's action. “The #prolifegen will not stand for this. We will fight to protect the preborn and their mothers, as well as the conscience rights of campus health center workers. #sb24”\n\n“California just ensured women will die in their dormitory bathrooms, bleeding out alone from the abortion pill.” — Kristan Hawkins, president, Students for Life of America\n\n“#SB24 in California forces all public colleges to assist with dangerous toilet bowl abortions,” Students for Life also said on Twiiter. “If you are a student or employee who is worried how this affects your #consciencerights message us and we will assist you. The fight is not over.”\n\nHawkins, who also heads Students for Life Action, continued her argument in a separate statement.\n\n“Governor Newsom’s reckless support for a new abortion pill distribution scheme on California college and university campuses will put students’ lives at risk and put schools at risk of lawsuits as conscience rights are violated,” she wrote.\n\nIn addition to helping students and healthcare workers in California, Hawkins said her organization is looking into providing legal assistance to women in other states whose legislatures are considering similar bills.\n\n“Student fees underwrite the costs of the healthcare centers on campuses, which will now be required to distribute deadly chemical abortion pills,” Hawkins continued. “And healthcare professionals will also be forced to hand them out no matter the consequences to women’s health, but Students for Life of America will make sure to connect these victims of conscience right violations with legal help to stop the spread of a bad idea that is only good for propping up abortion vendors like Planned Parenthood.”\n\nMedication abortion involves taking two pills — the first, taken at the clinic, blocks the hormone progesterone, while the second, taken days later at home without the supervision of a medical professional, produces a result similar to a miscarriage.\n\n'Protected right'\n\nThe bill’s author, state Sen. Connie Leyva, D-Chino, a told the Associated Press: “Abortion is a protected right, and it is important that everyone — including college students — have access to that right, if they so choose.\"\n\n“Abortion is a protected right, and it is important that everyone — including college students — have access to that right, if they so choose.\" — California state Sen. Connie Leyva, D-Chino\n\n“After three years of working to expand access to medication abortion at our public universities, I'm ecstatic that #SB24 was signed into law! Today, California stood on the right side of history by protecting and prioritizing the right to choose,’ Levya also said in a statement. “Just because you have a constitutional right, if you don’t have access to that constitutional right, then it’s really no right at all. I’m tired of women being shamed.”\n\n'Other states ... go backward'\n\nNewsom, upon signing the bill, pointed to several Republican-led states, including Georgia, Kentucky and Mississippi, that have passed laws banning abortions at around six weeks into pregnancy once a fetal heartbeat is detected.\n\n“As other states and the federal government go backward, restricting reproductive freedom, in California we are moving forward, expanding access and reaffirming a woman’s right choose,” Newsom said at news conference Friday, according to the Sacramento Bee. “We’re removing barriers to reproductive health -- increasing access on college campuses and using technology to modernize how patients interact with providers.”\n\n“As other states and the federal government go backward, restricting reproductive freedom, in California we are moving forward, expanding access and reaffirming a woman’s right choose.” — California Gov. Gavin Newsom\n\nFormer California Gov. Jerry Brown vetoed a similar bill last year, arguing it was not necessary because abortion services were readily available off campus. Newsom, a former mayor of San Francisco who became governor in January, said the law is needed \"as other states and the federal government go backward, restricting reproductive freedom.\"\n\nOther pro-life reactions\n\nOther Religious and pro-life groups also opposed the bill.\n\nLive Action President Lila Rose said the law \"turns universities into abortion centers.\"\n\nMaria Jose Fernandez, legislative advocate for the California Catholic Conference, said the law is \"trying to limit the alternatives for women.\"\n\n\"We're giving them the option to terminate a life, but what about those who want to continue on with that pregnancy? Where is the help for those women?\" Fernandez told The Associated Press.\n\nBishop Jaime Soto, president of the California Catholic Conference, implored Catholics and other Christians in an open letter to pray for the dissolution of SB 24 in order to shield “infants and young college-age women from the scourge of abortion,” the Los Angeles Times reported.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nThe state's Republicans voted against the measure in committee hearings. A handful of Assembly Democrats abstained during floor debates. The Department of Finance, under Newsom’s office, also opposed the bill, citing a lack of resources, personnel expertise and private funds to support a program of such “size, scope or content.”\n\nAlso Friday, Newsom signed a law clarifying that Planned Parenthood can prescribe birth control via teleconference without a video chat, as it can in other states.\n\nJodi Hicks, president and CEO of Planned Parenthood Affiliates of California, said the bill signings show \"that California understands reproductive health care is health care. And health care is a human right.\"\n\nThe Associated Press contributed to this report.", "description": "The pro-life group Students for Life of America (SLA) said Friday it would offer legal assistance to any students or health care workers whose “conscience rights” were threatened by a new California law that requires all public universities in the state to supply students with the “abortion pill” at on-campus clinics.", "authors": ["Danielle Wallace", "Kristan Hawkins", "President", "Students For Life Of America", "California State Sen. Connie Leyva", "California Gov. Gavin Newsom"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/07/POLS-Gavin-Newsom.jpg", "published_at": "2019-10-12"}