{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/11/WS5d9fbee0a310cf3e3556fcbd.html", "downloaded_at": "2019-10-11 03:59:43.114185+00:00", "title": "Games' medals honor fighting, hardworking spirit", "language": "en", "text": "(Clockwise from top) Medals, a trophy and ceremonial dresses for the 7th International Military Sports Council Military World Games are unveiled in Wuhan, Hubei province, on Thursday. The Games will officially kick off on Oct 18. LI WEI/FOR CHINA DAILY\n\nThe executive committee of the 7th International Military Sports Council Military World Games unveiled the medals and trophies for the games in Wuhan, Hubei province, on Thursday.\n\nThe medals, 81 millimeters in diameter and 5 millimeters thick, integrate Chinese cultural elements－including the Great Wall, plum blossoms, Wuhan's iconic Yellow Crane Tower and five-pointed star－with the regular council logo and emblem of the games.\n\nAccording to the committee, the medals highlight military features and the spirit of military sports. The three five-pointed stars represent servicemen, troops and military affairs, and together resemble three running individuals that form the Chinese character zhong, meaning people.\n\nThe committee said the flying dove carries the meaning of world peace and athletes' fighting and hardworking spirit. The number seven indicates the 7th games, and the auspicious clouds represent not only good blessings, but also the city of Wuhan, which is known as the hometown of white clouds and yellow cranes.\n\nThe five petals of the plum blossom, the flower of Wuhan, are also linked to the five Olympics rings that embody the \"faster, higher and stronger\" spirit.\n\nThe medal design opened for public solicitation in May 2018 and was finalized after rounds of appraisals. The production, guided by state-level artists, went through 20 processes including molding, pressing and gold plating.\n\nThe 7th Military World Games will kick off on Oct 18 and run until Oct 27. This year's event will see about 10,000 military athletes from over 100 member states of the International Military Sports Council compete in 27 events including parachuting, aeronautics and naval pentathlons.\n\nThe event's website said on Wednesday that after four years of planning, \"all is fully prepared\" for next week.\n\nThe main news center also started running on Thursday. The center will help coordinate news reports, organize news conferences, operate the event's information platform and provide other services for registered media from all over the world.\n\nThe center offers 350 workstations for journalists, and the main news conference hall can host 210 people. According to the media service center, a record of more than 4,000 media professionals have registered for the event.\n\nNew technologies will be applied in the event's reporting. Ultra high-definition 4K and 8K and 5G networks will cover many sports venues and be used to broadcast opening and closing ceremonies. Xinhua News Agency will launch full-scale livestreaming using 5G communication networks and the world's first virtual AI anchor.", "description": "", "authors": [], "top_image": "http://img2.chinadaily.com.cn/images/201910/11/5d9fda75a310cf3e97a096b5.jpeg", "published_at": "2019-10-11"}