{"pub": "nationalreview", "url": "https://nationalreview.com/corner/the-urgency-of-the-green-new-deal-will-only-give-the-state-mob-like-power", "downloaded_at": "2019-10-05 06:22:33.342065+00:00", "title": "Green New Deal & Mob Rule -- Deal's Urgency Gives the State Mob-Like Power", "language": "en", "text": "Rep. Alexandria Ocasio-Cortez and Sen. Ed Markey (at right) hold a news conference for their proposed “Green New Deal” on Capitol Hill, Washington, D.C., February 7, 2019. (Jonathan Ernst/Reuters)\n\nIn last week’s sub-par G-File I ended with a riff on socialism and gangsterism. I wrote:\n\nWhat’s interesting to me is how thin the line between this form of politics [gangsterism] and socialism (or fascism) is. The most important thing about the rule of law — including property rights — is that it insulates society from this form of politics.\n\nI should have mentioned that the idea that the state is a criminal enterprise is a very old one. Here’s Albert J. Nock:\n\nThe State’s criminality is nothing new and nothing to be wondered at. It began when the first predatory group of men clustered together and formed the State, and it will continue as long as the State exists in the world, because the State is fundamentally an anti-social institution, fundamentally criminal. The idea that the State originated to serve any kind of social purpose is completely unhistorical. It originated in conquest and confiscation—that is to say, in crime. It originated for the purpose of maintaining the division of society into an owning-and-exploiting class and a propertyless dependent class— that is, for a criminal purpose. No State known to history originated in any other manner, or for any other purpose. Like all predatory or parasitic institutions, its first instinct is that of self-preservation. All its enterprises are directed first towards preserving its own life, and, second, towards increasing its own power and enlarging the scope of its own activity. For the sake of this it will, and regularly does, commit any crime which circumstances make expedient.\n\nAs I write in my book, I think Nock was right about the origins of the state, but he was wrong about the liberal-democratic form of government championed to one extent or another by Burke, Locke, Hayek, and the Founders, among others. A society based on the idea of neutral rules, applicable to all equally, is an explicit rejection of the Big Man or Stationary Bandit model that all — or most — states originated from.\n\nWhat I left out of the G-File was the necessary condition for slipping out of the rule of law and into the rule of faction: Urgency.\n\nAs I argued in my essay on the moral equivalent of war in the new issues, urgency — i.e. crisis, war, etc. — is what causes people to say “there’s no time to argue!” and this empowers the state. The idea that “there is no time to argue” is fundamentally anti-democratic because democracy is about disagreement not agreement.\n\nMy late brother once pointed out to me that the Mafia, or organized crime generally, thrives wherever time is hugely important. He drove a fish truck out of the old Fulton Fish Market and he saw some of this first hand. Fish have a short shelf-life and that’s why the mob had suppliers and buyers over a barrel. Similarly, the mob was notoriously embedded in the newspaper-delivery truck racket. If you can’t deliver newspapers on time, the newspapers become, literally, old news and therefore worthless.\n\nTim Carney recently noted that the key reason why the Green New Deal will become a cronyist-fecal festival is the need to rush.\n\n“A Green New Deal,” their resolution reads, “must be developed through transparent and inclusive consultation, collaboration, and partnership with frontline and vulnerable communities, labor unions, worker cooperatives, civil society groups, academia, and businesses.”\n\nBut you can’t have this intricate, collaborative, and inclusive process unless you take a very long time. The entire premise of this moon-shot, new deal, grand mobilization is that we don’t have a lot of time before the planet melts.\n\nIf these “Green Dealers” get their way, things will be rushed and thus centrally planned. Our world wars show what happens when Washington starts “reorganizing” our economy toward some pressing immediate need. Namely, we get lots of corporatism and profiteering.\n\nThe very premise of the Green New Deal is that there’s no time to argue, and that gives the state mob-like power.\n\nThe exact same logic applies to President Trump’s emergency declaration, as Christian Vanderbrouk discusses here. The system thwarted Trump, so Trump wants to thwart the system. Trump himself said he didn’t need to do this, he just wanted to do it faster. The urgency for Trump is personal and political but the logic is the same. Time is of the essence and so there’s no time for arguing.\n\nSomething to Consider If you enjoyed this article, we have a proposition for you: Join NRPLUS. Members get all of our content (including the magazine), no paywalls or content meters, an advertising-minimal experience, and unique access to our writers and editors (conference calls, social-media groups, etc.). And importantly, NRPLUS members help keep NR going. Consider it? If you enjoyed this article, and were stimulated by its contents, we have a proposition for you: Join NRPLUS. LEARN MORE", "description": "The very premise of the Green New Deal is that there’s no time to argue, and that gives the state mob-like power.", "authors": ["Jonah Goldberg", "Andrew C. Mccarthy", "Alexandra Desanctis", "Kevin D. Williamson", "Jim Geraghty", "John Yoo", "Kyle Smith", "David French", "Mairead Mcardle", "Read More"], "top_image": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2019/02/green-new-deal-cortez-markey.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-02-19"}