{"pub": "breitbart", "url": "https://breitbart.com/news/australian-couple-charged-with-spying-in-iran-released", "downloaded_at": "2019-10-05 06:10:13.896786+00:00", "title": "Australian couple charged with spying in Iran released", "language": "en", "text": "Sydney (AFP) – An Australian travel-blogging couple who were being detained in Iran on charges of spying have been released, Australian Foreign Minister Marise Payne said Saturday.\n\nPerth-based Jolie King and Mark Firkin had been documenting their journey from Australia to Britain on social media for the past two years but went silent after posting updates from Kyrgyzstan and Pakistan about three months ago.\n\nThey were alleged to have used a drone to take pictures of “military sites and forbidden areas”, an Iranian judiciary spokesman said last month.\n\nFollowing “very sensitive negotiations” with Tehran, the couple have been released, Payne said Saturday.\n\n“They are being returned to Australia and they will be reunited with their family,” she told reporters in Sydney.\n\n“They are in good spirits and they are in good health,” she added.\n\nBut negotiations over the fate of Melbourne University Academic Kylie Moore-Gilbert, a third Australian accused of “spying for another country”, were ongoing, Payne said.\n\nUniversity lecturer Moore-Gilbert, who specialises in Middle East politics with a focus on Gulf states, had been detained for “some months” before King and Firkin in an unrelated case.\n\n“She has been detained for some considerable time and has faced the Iranian legal system and has been convicted and sentenced,” the foreign minister said.\n\n“We don’t accept the charges on which she was convicted and we would seek to have her returned to Australia,” Payne added, declining to comment further.\n\nNews of the arrests last month came after Canberra announced it would contribute a frigate and surveillance aircraft to a US-led mission to protect shipping through the Strait of Hormuz, with tensions high in the Gulf region.\n\nPayne has maintained the cases of those detained were not related to diplomatic tensions.", "description": "Sydney (AFP) – An Australian travel-blogging couple who were being detained in Iran on charges of spying have been released, Australian Foreign", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/04/727450_negotiations-fate-melbourne-university-academic-kylie-moore-gilbert-640x335.jpg", "published_at": "2019-10-04"}