{"pub": "breitbart", "url": "https://breitbart.com/2020-election/2019/10/16/bernie-sanders-promises-jobs-for-tens-of-millions-of-americans-during-debate", "downloaded_at": "2019-10-16 21:10:27.317853+00:00", "title": "Bernie Sanders Promises Jobs for ‘Tens of Millions’ of Americans During Debate", "language": "en", "text": "Sen. Bernie Sanders (I-VT) promised jobs for “tens of millions of Americans” during the fourth Democrat debate in Westerville, Ohio, Tuesday night.\n\nBernie Sanders on whether or not his administration will create jobs for every American that will lose their job to automation: \"Damn right we will\" #DemDebate pic.twitter.com/kSrWcLoQ4e — CNN Politics (@CNNPolitics) October 16, 2019\n\n“You say your federal jobs guarantee is part of the answer to the threat of automation, that tens of millions of Americans could end up losing their jobs. Are you promising that you will have a job for every single one of those Americans?” asked CNN anchor Erin Burnett.\n\n“Damn right we will,” Sanders quickly responded, highlighting his plan to combat climate change as one way to create 20 million additional jobs in the economy.\n\n“These jobs will be good-paying, union jobs with strong benefits and safety standards in steel and auto manufacturing, construction, energy efficiency retrofitting, coding and server farms, and renewable power plants,” according to an outline of Sanders’ “Green New Deal” plan on his campaign website.\n\n“We will also create millions of jobs in sustainable agriculture, engineering, a reimagined and expanded Civilian Conservation Corp, and preserving our public lands,” the outline continued.\n\nSanders’ climate plan also included nationalizing most of the U.S.’s energy production and drastically reducing carbon emissions. He has acknowledged his plan may cause job losses in the energy industry and promised to provide public assistance to those workers.\n\n“We will guarantee five years of a worker’s current salary, housing assistance, job training, health care, pension support, and priority job placement for any displaced worker, as well as early retirement support for those who choose it or can no longer work,” according to the climate plan.\n\nBut Sanders had said during the debate that despite these promised jobs for “tens of millions of Americans,” taxes will also have to go up. When Sanders spoke about his “Medicare for All” bill on Tuesday, he acknowledged that “taxes will go up.”", "description": "Sen. Bernie Sanders (I-VT) promised jobs for \"tens of millions of Americans\" during the fourth Democrat debate Tuesday night.", "authors": ["Katherine Rodriguez"], "top_image": "https://media.breitbart.com/media/2019/10/bernie-animated-pointing-debate-getty-640x335.jpg", "published_at": "2019-10-16"}