{"pub": "cbc", "url": "https://cbc.ca/news/canada/ottawa/chiarelli-pens-denial-blames-mob-mentality-1.5307454", "downloaded_at": "2019-10-03 23:30:05.867956+00:00", "published_at": "2019-10-03", "title": "Ottawa councillor denies allegations he asked job applicant about going braless | CBC News", "language": "en", "text": "In his first public statement since CBC News reported allegations of inappropriate comments and behaviour, Ottawa Coun. Rick Chiarelli denied accusations directed at him, referring to the rising number of complaints as \"an apparent mob mentality.\"\n\nIn the past month, CBC News reported allegations from seven women — including two named former employees — that Chiarelli sent one staffer to a strip club to spy on another city councillor, that he asked a job applicant about not wearing a bra to work events and another applicant if she had ever considered stripping.\n\nI can say, without reservation, that I have never treated a member of my staff [including job candidates] in a sexually harassing, discriminatory or inappropriate 'gender-based' fashion. - Ottawa Coun. Rick Chiarelli\n\nLast week, through his lawyer, Chiarelli denied those accusations. Late Thursday morning, he issued a personal statement for the first time.\n\n\"I can say, without reservation, that I have never treated a member of my staff [including job candidates] in a sexually harassing, discriminatory or inappropriate 'gender-based' fashion,\" Chiarelli said in the statement.\n\nHe also said he retained legal counsel in July after he learned he was \"being targeted\" over his attempts to bring greater transparency to the LRT [light rail transit] procurement process.\n\nChiarelli also said in the statement he was made aware that one of his political adversaries was \"attempting to persuade a number of women to join an organized group to speak negatively about me.\"\n\nHe said he's speaking out now because he feels he owes it to his \"loyal constituents\" and to his \"loving wife\" and \"three wonderful, accomplished daughters.\" He added: \"Their love and support is what keeps me going at this difficult time.\"\n\nHealth issues\n\nThe longtime College ward councillor said his ability to respond to the allegations earlier had been hampered \"by ongoing and serious medical challenges,\" and alluded to \"some troubling suggestion that my recent request for approved medical leave is disingenuous and/or opportunistic, and related to some reluctance or inability, on my part, to address these allegations.\"\n\nChiarelli said that's not true, and that he has been dealing with \"well-documented and objectively verifiable health issues since the middle of August.\"\n\nLast week, CBC News reported Chiarelli was vacationing in Prague with his family two days after he said he was rushed to the emergency room. In a statement to CBC News, the councillor said doctors advised him to vacation with his family rather \"than to deal with all the stress alone.\"\n\nIn an unprecedented move on Sept. 25, council did not grant Chiarelli's request for a formal leave of absence, calling the request \"premature.\"\n\nWrong complaints process: Chiarelli\n\nThe councillor also wrote that the allegations that have been raised don't fall under the purview of the city's integrity commissioner, whom CBC News learned is investigating at least three formal complaints related to this matter.\n\nChiarelli said his own lawyer has told him that the \"vast majority of the allegations\" raised against him would be \"properly and thoroughly covered by protections and processes set out in the Ontario Human Rights Code.\"\n\nThat process would entitle the councillor to know the identity of his accuser, and would let his lawyer \"test the veracity\" of the allegations through cross-examination, the councillor said in his statement.\n\nAccording to the code of conduct for Ottawa city councillors, all members \"have a duty to treat members of the public, one another and staff with respect and without abuse, bullying or intimidation, and to ensure that their work environment is free from discrimination and harassment.\"\n\nHuman rights code, harassment policy also apply\n\nIt also states that the Ontario Human Rights Code and, where applicable, the City's Violence and Harassment in the Workplace Policy, can apply to councillors' behaviour in conjunction with the code of conduct.\n\nThe integrity commissioner keeps the names of the complainants confidential from the councillor, although the commissioner may provide details of the alleged behaviour or event that would allow Chiarelli to deduce the complainant's identity.\n\nThe complaints process gives the integrity commissioner sole discretion to suspend an investigation if a complaint has been made to another body, but it's not clear if that has happened in this case.", "description": "In his first public statement since CBC News reported allegations of inappropriate comments and behaviour, Ottawa Coun. Rick Chiarelli denied accusations directed at him, referring to the rising number of complaints as \"an apparent mob mentality.\"", "authors": [], "top_image": "https://i.cbc.ca/1.4449470.1513290184!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/coun-rick-chiarelli.jpg"}