{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3069255&cloc=joongangdaily|home|newslist1", "downloaded_at": "2019-10-20 13:00:37.444558+00:00", "title": "Seoul-Beijing defense talks resume after a gap", "language": "en", "text": "South Korea is set to resume high-level defense talks with China today, the first time since Beijing cut off military discussions as a result of Seoul’s decision to deploy American Terminal High Altitude Area Defense (Thaad) batteries on its soil in 2015.After flying to Beijing on Sunday, South Korean Vice Defense Minister Park Jae-min is set to take part in the fifth bilateral vice ministerial strategic defense dialogue with Lt. Gen. Shao Yuanming, deputy chief of the Joint Staff Department of China’s Central Military Commission, on Monday and Tuesday.The talks, which South Korea’s Ministry of National Defense said would cover security conditions and other related issues, are the only bilateral discussions to regularly take place between high-ranking officials since they were first agreed upon at a defense ministers’ meeting in July 2011.Park and Shao are expected to discuss matters of security relating to North Korea, as well as Chinese and Russian jets’ intrusions into South Korea’s exclusive Air Defense Identification Zone, or Kadiz, in July, - an incident that drew heavy protest from Seoul. Park is also set to pay a courtesy visit to Chinese Defense Minister Wei Fenghe, according to the Defense Ministry.The two sides met a total of four times from 2011 to 2014, going back and forth between Seoul and Beijing. In 2015, however, after the United States publicly announced it was considering deploying the Thaad batteries to South Korea, Beijing withdrew from the talks, saying the antimissile system represented a threat to China’s national security.The Park Geun-hye administration in 2016 eventually agreed to station the batteries in Seongju County, North Gyeongsang, justifying the deployment by saying the system was meant to deter North Korea’s growing arsenal of ballistic missiles.Starting from 2017, the Thaad batteries were installed in Seongju, and in retaliation, China imposed a series of economic retaliations on Korea, like banning group tours to the country and sanctioning Korean pop culture content.The measures dealt a significant blow to South Korea’s economy, with Chinese tourism in Korea reduced by half in 2017. Relations have slowly recovered.According to Bank of Korea data from Oct. 8, Korea received 3.9 million Chinese tourists from January to August this year, levels comparable to the years before the Thaad row.Park Jae-min’s visit testifies to such a recovery in relations, with the two sides expected to agree to setting up further communication channels. Beijing, however, is likely to bring up the Thaad issue again, given that its most recent defense white paper claimed the batteries “gravely damaged” the strategic balance in the Asia-Pacific region. Park is also slated to attend the Beijing Xiangshan Forum, an annual multilateral defense forum that China has hosted since 2006, to deliver a speech. North Korea’s Vice Defense Minister Kim Hyong-ryong arrived in Beijing on Thursday to take part in the forum, though a recent cold spell in inter-Korean ties makes it unclear whether the two Koreas’ officials will engage one another.In last year’s Xiangshan Forum, Kim held an impromptu meeting with South Korea’s then-Vice Minister Suh Choo-suk for 10 minutes, in which the two sides confirmed each other’s commitment to uphold a military agreement made at September’s inter-Korean summit in Pyongyang.BY SHIM KYU-SEOK [shim.kyuseok@joongang.co.kr]", "description": "", "authors": [], "top_image": "http://static.joins.com/joongang_15re/profile_koreajoongangdaily_200.png", "published_at": "2019-10-20"}