{"pub": "yahoo", "url": "https://news.yahoo.com/1-strong-earthquake-hits-philippines-124347089.html", "downloaded_at": "2019-10-16 14:08:18.738887+00:00", "title": "UPDATE 2-Strong quake in Philippines sends people scrambling", "language": "en", "text": "(Adds buildings cracked, blackout, quote from witness)\n\nBy Neil Jerome Morales\n\nMANILA, Oct 16 (Reuters) - A magnitude 6.4 earthquake struck central Mindanao in the southern Philippines on Wednesday, opening cracks in some buildings, sending residents running from shops and offices and knocking out power.\n\nThere were no immediate reports of casualties from the earthquake, which also shook Davao City, the hometown of President Rodrigo Duterte and among the most populous cities in the country.\n\nThe United States Geological Survey said the quake struck 69 km (43 miles) north-northwest of General Santos, Mindanao at 1137 GMT (7.37 p.m.). The epicentre was about 80 km southwest of central Davao.\n\n\"We felt a very strong jolt and there was a blackout. I saw people rushing down. We were panicking, heading to the exit,\" said Naru Guarda Cabaddu, a hotel consultant visiting Kidapawan City, between the epicentre of the quake and Davao.\n\nThe quake struck at a depth of 14 km (9 miles).\n\n\"So far, we are on rapid assessment mode. There's no major damage based on initial report,\" Kidapawan City Mayor Joseph Evangelista told CNN Philippines channel. \"No reports have come in that we have casualties.\"\n\nRenato Solidum, head of the Philippines seismic agency told ANC news channel there was a chance of aftershocks after the quake, considered strong and capable of causing severe damage.\n\n\"Aftershocks can happen. Some can be felt most likely in low intensities. But we cannot remove the possibility of similar intensities that can be felt in the epicentral area,\" he said.\n\nThe Philippines is on the geologically active Pacific Ring of Fire and experiences frequent earthquakes. (Additional reporting by Peter Blaza; Editing by Matthew Tostevin and Alison Williams)", "description": "A magnitude 6.4 earthquake struck central Mindanao in the southern Philippines on Wednesday, opening cracks in some buildings, sending residents running from shops and offices and knocking out power.  There were no immediate reports of casualties from the earthquake, which also shook Davao City, the", "authors": ["Neil Jerome Morales"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-16"}