{"pub": "investing.com", "url": "https://investing.com/news/economic-indicators/strong-consumers-keep-us-q3-gdp-growing-at-19-investment-falls-2007608", "downloaded_at": "2019-10-30 14:37:42.562650+00:00", "title": "Strong Consumers Keep U.S. Q3 GDP Growing at 1.9%; Investment Falls", "language": "en", "text": "© Reuters.\n\nInvesting.com - The U.S. economy grew quickly than expected in the third quarter, as a strong labor market supported consumer spending. But business investment fell sharply under the shadow of the U.S.-China trade war.\n\ngrew at an annualized rate of 1.9% in the three months to September, the Commerce Department said in its initial estimate on Wednesday.\n\nThat topped economists’ forecasts for growth of 1.6%, although it was down from 2.0% in the previous quarter.\n\nOn a straight year-on-year comparison, third-quarter GDP was up 2.0% from a year earlier, the weakest rate since the final quarter of 2016. That reflected to a large degree a sharp drop in business investment. Non-residential investment fell at an annualized 3.0% in the quarter, the Commerce Department said. Even the strength in consumer spending was relative: its growth slowed to 2.9% from 4.6% in the second quarter.\n\nThe U.S. economy hasn’t grown at an annualized rate below 2% for nearly three years, with the exception of the fourth quarter of 2018. Hiring and consumer spending rose as tax cuts last year sent growth surging.\n\nJeroen Blokland, an economist with asset manager Robeco, said that the economy had slowed to a rate \"roughly equal to potential growth, down from above 3% in 2018 when the economy was on #tax steroids.\"\n\nThe numbers came out only hours before the Federal Reserve is expected to cut interest rates for the third time this year. Although the headline rate may suggest less of a need to cut rates, Dean Baker, senior economist at the Center for Economic and Policy Research, noted that the price components of the GDP report were still within the Fed's comfort zone for inflation.\n\nCore personal consumption expenditures, the Fed's preferred measures of inflation, rose just 1.7% last year, \"still well below Fed's 2.0 percent target,\" Baker said. He also noted that the savings rate, at 8.1%, offered some reassurance that strong consumption isn't being financed by an unsustainable rise in borrowing.\n\nU.S. stock and bond markets were little changed by the data, suggesting that the numbers had done little to change expectations of what the Fed will do. The was effectively unchanged at 97.447.", "description": "Strong Consumers Keep U.S. Q3 GDP Growing at 1.9%; Investment Falls", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEB1Q0LH_L.jpg", "published_at": "2019-10-30"}