{"pub": "cnn", "url": "https://cnn.com/2019/10/24/health/flavor-ban-worked/index.html", "downloaded_at": "2019-10-24 04:51:53.894109+00:00", "title": "One town's flavor ban seemed to work to cut youth vaping", "language": "en", "text": "(CNN) Limiting kids' access to flavored tobacco products like e-cigarettes, smokeless tobacco and cigars seems to work, according to a new study that looks at two towns that took different approaches to vaping in Massachusetts. That will come as good news to the governments that are adding more restrictions on flavors.\n\nThe number of kids who used flavored tobacco has increased significantly nationwide and studies find that kids who use flavors may be more likely to develop a regular tobacco habit.\n\nThis study, running in Thursday's edition of the American Journal of Preventive Medicine , found that laws that limit kids' access to flavored products worked to change that trend.\n\nIn Lowell, after the policy went into place, the number of flavored products sold per retailer decreased significantly and so did kids' use of all tobacco products, not just products with flavor.\n\nWhile the students who were surveyed in both towns did not report any change in opinion about how difficult it was to get flavored products, there were big differences in how many kids used or bought them.\n\nUse of any flavored tobacco product decreased in Lowell after the policy went into place, whereas the use of flavored tobacco products increased in Malden.\n\nThe use of any non-flavored tobacco product also changed. It decreased in Lowell, whereas use of any non-flavored tobacco product increased in Malden, the study found.\n\nThe town's restrictions on sales seemed to have an impact as soon as 6 months after the policy went into effect, the study found.\n\nTwo parts of the policy seemed to have the biggest impact, according to the study.\n\nRetailers did seem to comply with the restrictions, which may have been helped by a rigorous enforcement program created to police sales, the study found.\n\nThe other aspect of the policy that seemed to make a difference was the awareness the policy brought to the issue.\n\nEarlier studies have shown that if kids live in communities with strong regulations that focus on clean air and on limiting youth access to tobacco products, the area is perceived to be more \"anti-smoking,\" and this change in social norms has an impact on youth smoking rates.\n\nThe authors also think that kids had less access to cars in Lowell, so they may not have had an easy way to get to other towns without restrictions. The sample size on that issue was too small to determine if that was a real factor.\n\nThe study did not look at individual behavior, focusing instead on community change -- but it does seem to suggest that restrictive policies focused on removing flavored tobacco products from shelves could actually work to curb youth tobacco use. The authors hope to follow up with the students in the future to see if the trends continue.\n\nCesar Pungirum , Lowell's Tobacco Control Director, said he is really happy to hear that his town is being used as a positive example. He said prior to the change in the policy, he would see flavored products advertised everywhere in convenience stores and gas stations throughout the town.\n\n\"If you looked at the pattern of these products, they were packaged and priced to attract younger people and with the hope of securing new users, and most of these were flavored products,\" Pungirum said. \"I brought it to the attention of the Board of Health in 2016 and they agreed it was the right thing to do to move these into adult only tobacco stores.\"\n\nLowell has put restrictions on flavors for tobacco products, allowing them to be sold only in adults only tobacco stores\n\nNow, Lowell only has about five or six retail stores that sell them, Pungirum said. \"They are limited quite successfully,\" he said. He adds you can't just have a policy though, you have to keep up with the enforcement of the policy. \"That's the only way these policies really work.\"\n\nHis next goal is to get all vaping products out of the convenience stores and gas stations, and restricted to the adults only tobacco shops, if the commonwealth doesn't ban the products all together. Massachusetts has had a four-month ban on the sale of all e-cigarettes and vaping products; a judge ruled Monday that it could only stand until October 28. The commonwealth has to make changes to the order if it wants the ban to continue.\n\nPungirum would also like to close a loophole in the current policy, and restrict mint and menthol product sales to just these stores. Both proposals are before the board.\n\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\n\n\"We've come a long way, but vaping products seem to be the go-to tobacco products, what's trendy now, and it's causing some people to get sick and to die. We want to make sure that doesn't happen.\"", "description": "Limiting kids' access to flavored tobacco products like e-cigarettes, smokeless tobacco and cigars seems to work, according to a new study that looks at two towns that took different approaches to vaping in Massachusetts. That will come as good news to the governments that are adding more restrictions on flavors.", "authors": ["Jen Christensen"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191008144410-go-ask-dad-vaping-super-tease.jpg", "published_at": "2019-10-24"}