{"pub": "breitbart", "url": "https://breitbart.com/news/three-dead-in-chile-protest-violence", "downloaded_at": "2019-10-20 08:21:03.135350+00:00", "title": "Three dead in Chile protest violence", "language": "en", "text": "Santiago (AFP) – Three people died in a fire in a supermarket being ransacked in the Chilean capital early Sunday, as protests sparked by anger over social and economic conditions rocked one of Latin America’s most stable countries.\n\nSantiago’s Mayor Karla Rubilar told reporters two people burned to death in the blaze and another later died in hospital, after the huge store controlled by US retail chain Walmart was looted.\n\nThey were the first deaths in two days of violent unrest in which protesters have set buses on fire, burned metro stations and clashed with riot police in the city of seven million — despite a curfew starting at 0100 GMT Sunday.\n\nThe protests were triggered by an unpopular hike in metro fares, which President Sebastian Pinera announced Saturday he was suspending.\n\nHe appealed to people taking to the streets, saying “there are good reasons to do so,” but calling on them “to demonstrate peacefully” and saying “nobody has the right to act with brutal criminal violence.”\n\nBut clashes later erupted in Plaza Italia, ground zero of Friday’s violence, and outside the presidential palace.\n\nProtesters again set buses on fire in downtown Santiago, leading to the suspension of services.\n\n“We’re sick and tired, enough already. We’re tired of them screwing around with us. Politicians only do what they want to do, and turn their backs on all reality,” said Javiera Alarcon, a 29-year-old sociologist protesting in front of the presidential palace, which was surrounded by police and military vehicles.\n\nAFP video showed security forces blasting a crowd with water cannon, and riot police wrestling young protesters into vans.\n\n“Having analyzed the situation and the appalling actions that occurred today, I have made the decision to suspend freedoms and movement through a total curfew,” said Army General Javier Iturriaga, who is overseeing security during the state of emergency.\n\nLater on Saturday, the mayors of Valparaiso region and Concepcion province also announced states of emergency.\n\nDozens of protesters torched a building belonging to Chile’s oldest newspaper El Mercurio in Valparaiso city on Saturday evening, while elsewhere in the port city a metro station, supermarkets and other stores were burned.\n\n– #ChileDesperto –\n\nThe unrest was sparked by a hike in metro fares, which increased from 800 to 830 peso ($1.13 to $1.17) for peak-hour travel, after a 20-peso hike in January.\n\nPinera announced Saturday he was suspending the fare hike, after the entire metro system was shut down the day prior with protesters burning and vandalizing dozens of stations, leaving some completely charred.\n\nThe Santiago Metro, at 140 kilometres (90 miles), is the largest and most modern in South America and a source of great pride for Chileans.\n\nPeople awoke Saturday to a ravaged city as burned-out buses, bikes and garbage littered streets patrolled by soldiers — the first such deployment since Chile returned to democracy in 1990 after the rightwing Augusto Pinochet dictatorship.\n\nDemonstrators shouted “enough with abuse,” while the hashtag #ChileDesperto — Chile awake — made the rounds on social media.\n\nPinera’s conservative government has been caught flat-footed by the worst social upheaval in decades.\n\nIt declared the state of emergency late Friday and ordered hundreds of troops into the streets.\n\nPeople were infuriated by a photo of Pinera eating pizza in a restaurant with his family while the city burned.\n\nThroughout Friday, rampaging protesters clashed with riot police in several parts of the capital while the headquarters of the ENEL Chile power company and a Banco Chile branch — both in the city center — were set on fire and heavily damaged.\n\nThe state of emergency is initially set for 15 days and restricts freedom of movement and assembly.\n\n– Government ‘perplexed and dazed’ –\n\nThe unrest started as a fare-dodging protest mainly by students against the hike in metro ticket prices, blamed on rising oil prices and a weaker peso.\n\nThere had been several fare-dodging actions in recent days, organized on social media, but the protests escalated Friday, tapping into general discontent among many Chileans.\n\nChile has the highest per capita income of Latin America at $20,000, with expected economic growth this year of 2.5 percent and just two percent inflation.\n\nBut there is an undercurrent of frustration with rising health care and utility costs, low pensions and social inequality.\n\nThe metro fare hike served to wake up a society that was averse to violence after the horrors of the Pinochet dictatorship from 1973-1990, which left more than 3,200 people dead or missing, sociologists say.", "description": "Santiago (AFP) – Three people died in a fire in a supermarket being ransacked in the Chilean capital early Sunday, as protests sparked by anger over", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/19/008eae_protesters-argue-chilean-soldiers-clashes-in-santiago-on-19-2019-dead-in-640x335.jpg", "published_at": "2019-10-19"}