{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/new-details-on-microsofts-dual-screen-windows-os-leak", "downloaded_at": "2019-10-27 04:02:54.135016+00:00", "title": "New Details On Microsoft's Dual-Screen Windows OS Leak", "language": "en", "text": "Illustration: Microsoft\n\nWhile Microsoft has been pretty tight-lipped so far about Windows 10X, an upcoming variation of its OS expected to debut with the Surface Neo, a leak this week appears to give us a closer look at how the company plans to customise the user experience for dual-screen devices.\n\nA Twitter user known in part for previous Microsoft leaks, WalkingCat, spotted what seems to be some kind of internal document that somehow accidentally went live Friday with details about Windows 10X. It was pulled before we got our eyes on it, but reports have been trickling in from other outlets that were quicker on the draw.\n\nPreviously Microsoft hinted that its taskbar would be receiving a makeover for a uniquely dual-screen interface, and, per the Verge, this apparently incorporates “a series of ‘levers’” to customise its base model on “both clamshells and foldables”—which means Windows 10X will likely be available for more traditional laptops too. The notifications centre will also reportedly feature additional configuration options.\n\nGiven that Microsoft’s marketing its 2020-planned Surface Neo and smaller Surface Duo as amalgamations of a laptop, phone, and tablet, these options will likely let users move between more traditional interfaces for these devices, hopefully letting them pick and choose their favourite elements to mash together into something new as well.\n\nMicrosoft has also suggested its Start Menu is up for similar tweaks, and it’ll purportedly be rebranded as the Launcher with Windows 10X. “Search is seamlessly integrated with web results, available apps, and specific files on your device. Recommended content is dynamically updated based on your most frequently and recently used apps, files, and websites,” the document explains according to the Verge.\n\nUnlocking your device should also get a bit easier. According to an Engadget report, Microsoft is doing away with its lock “curtain” with this OS, instead having its Windows Hello facial recognition software trigger instantly when you wake your device.\n\nMicrosoft hasn’t commented publically on these leaks yet, so it’s still all technically speculation for now. The company did not immediately respond to Gizmodo’s request for inquiry.", "description": "While Microsoft has been pretty tight-lipped so far about Windows 10X, an upcoming variation of its OS expected to debut with the Surface Neo, a leak this week appears to give us a closer look at how the company plans to customise the user experience for dual-screen devices....", "authors": ["David Nield", "George Dvorsky"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/pp0avvfzadtwrzfwapaq.jpg", "published_at": "2019-10-27"}