{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/oct/14/harold-bloom-literary-critic-yale-professor-dies-89", "downloaded_at": "2019-10-14 23:22:11.319371+00:00", "title": "Harold Bloom, author and literary critic, dies at age 89", "language": "en", "text": "He prided himself on making scholarly topics accessible to readers and wrote the bestsellers The Western Canon and The Book of J\n\nHarold Bloom, the eminent critic and Yale professor whose seminal The Anxiety of Influence and melancholy regard for literature’s old masters made him a popular author and standard-bearer of Western civilization amid modern trends, died Monday at age 89.\n\nBloom’s wife, Jeanne, said that he had been failing health, although he continued to write books and was teaching as recently as last week. Yale says Bloom died at a New Haven, Connecticut, hospital.\n\nBloom wrote more than 20 books and prided himself on making scholarly topics accessible to the general reader. Although he frequently bemoaned the decline of literary standards, he was as well placed as a contemporary critic could hope to be. He appeared on bestseller lists with such works as “The Western Canon” and “The Book of J,” was a guest on “Good Morning America” and other programs and was a National Book Award finalist and a member of the American Academy of Arts and Letters\n\nHis greatest legacy could well outlive his own name: the title of his breakthrough book, The Anxiety of Influence. Bloom argued that creativity was not a grateful bow to the past, but a Freudian wrestle in which artists denied and distorted their literary ancestors while producing work that revealed an unmistakable debt.\n\nHe was referring to poetry in his 1973 publication, but “anxiety of influence” has come to mean how artists of any kind respond to their inspirations. Bloom’s theory has been endlessly debated, parodied and challenged, including by Bloom.\n\nBloom openly acknowledged his own heroes, among them Shakespeare, Samuel Johnson and the 19th century critic Walter Pater. He honored no boundaries between the life of the mind and life itself and absorbed the printed word to the point of fashioning himself after a favorite literary character, Shakespeare’s betrayed, but life-affirming Falstaff. Bloom’s affinity began at age 12 and he more than lived up to his hero’s oversized aura in person. For decades he ranged about the Yale campus, with untamed hair and an anguished, theatrical voice, given to soliloquies over the present’s plight.\n\nThe youngest of five children, he was born in 1930 in New York’s East Bronx to Orthodox Jewish immigrants from Russia, neither of whom ever learned to read English. Bloom’s literary journey began with Yiddish poetry, but he soon discovered the works of Hart Crane, T S Eliot, William Blake and other poets. He would allege that as a young man he could absorb 1,000 pages at a time.\n\nHe graduated in 1951 from Cornell University, where he studied under the celebrated critic M H Abrams, and lived abroad as a Fulbright Scholar at Pembroke College, Cambridge. After earning his doctorate degree from Yale in 1955, he joined the school’s English faculty. Bloom married Jeanne Gould in 1958 and had two sons.\n\nIn the ’50s, he opposed the rigid classicism of Eliot. But over the following decades, Bloom condemned Afrocentrism, feminism, Marxism and other movements he placed in the “school of resentment”. A proud elitist, he disliked the Harry Potter books and slam poetry and was angered by Stephen King’s receiving an honorary National Book Award. He dismissed as “pure political correctness” the awarding of the Nobel Prize for literature to Doris Lessing, author of the feminist classic The Golden Notebook.\n\n“I am your true Marxist critic,” he once wrote, “following Groucho rather than Karl, and take as my motto Groucho’s grand admonition, ‘Whatever it is, I’m against it.’”\n\nIn The Western Canon, published in 1994, Bloom named the 26 crucial writers in Western literature, from Dante to Samuel Beckett, and declared Philip Roth, Thomas Pynchon and Don DeLillo among the contemporary greats. Shakespeare reigned at the canon’s center.\n\nMany, however, had their own harsh criticism of Bloom. He was mocked as out of touch and accused of recycling a small number of themes. “Bloom had an idea; now the idea has him,” British critic Christopher Ricks once observed.\n\nBloom’s praises were not reserved for white men. In The Book of J, released in 1990, Bloom stated that some parts of the Bible were written by a woman. (He often praised the God of the Old Testament as one of the greatest fictional characters). He also admired Virginia Woolf, Jane Austen, George Eliot and Emily Dickinson and the hundreds of critical editions he edited include works on Toni Morrison, Maya Angelou and Amy Tan. Bloom did write a novel, The Flight to Lucifer, but was no more effective than most critics attempting fiction and later disowned the book. In The Anatomy of Influence, a summation released in 2011, Bloom called himself an epicurean who acknowledged no higher power other than art, living for “moments raised in quality by aesthetic appreciation”.\n\nHis resistance to popular culture was emphatic, but not absolute. He was fond of the rock group The Band and fascinated by the Rev Jimmy Swaggart and other televangelists. He even confessed to watching MTV, telling The Paris Review in 1990 that “what is going on there, not just in the lyrics but in its whole ambience, is the real vision of what the country needs and desires. It’s the image of reality that it sees, and it’s quite weird and wonderful.”", "description": "He prided himself on making scholarly topics accessible to readers and wrote the bestsellers The Western Canon and The Book of J", "authors": ["Associated Press"], "top_image": "https://i.guim.co.uk/img/media/d0c565d307e8ab13a413185c7fc69f187aacd874/0_187_4896_2938/master/4896.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=374e144f9adf2b6977539ec11efabe8b", "published_at": "2019-10-14"}