{"pub": "yahoo", "url": "https://news.yahoo.com/worlds-oceans-mountains-big-trouble-090100637.html", "downloaded_at": "2019-09-27 00:05:20.806483+00:00", "title": "World's oceans and mountains are in big trouble from climate change, UN report says", "language": "en", "text": "The world's oceans and mountains are in peril, and so are we, according to a major new report from United Nations climate scientists released early Wednesday.\n\nThe \"Special Report on Oceans and the Cryosphere\" offers a bleak picture. It warns that the world's oceans have reached or are nearing critical tipping points: Oceans have gotten warmer, more acidic and are losing oxygen, resulting in a cascade of negative effects that are wreaking havoc on coral and other marine ecosystems, threatening the collapse of the world’s fisheries and turbocharging deadly hurricanes and tropical storms.\n\nIn an unprecedented effort, teams of scientists from the U.N.'s Intergovernmental Panel on Climate Change explored the farthest corners of Earth, from the highest Alpine regions to the deepest oceans, said Ko Barrett, panel vice chair and a NOAA deputy assistant administrator for research, \"and even in these remote places climate change is evident.\"\n\nAs glaciers and ice sheets have melted faster, and rising temperatures have warmed the surface of the sea, the planet's marine zones have absorbed the heat, Barrett said. But the systems are now at or near overload.\n\n\"For decades, the ocean has been acting like a sponge ... but it can't keep up,\" Barrett said. \"The consequences for nature and humanity are sweeping and severe.\"\n\nGreta Thunberg takes on UN: How dare you look away?\n\nThe scientists confirmed clear links between ice loss and rising seas and an array of impacts, including fiercer hurricanes and storms in the Atlantic Ocean.\n\nIn the U.S., most of the East and West coasts will experience what were once \"hundred-year\" floods on an annual basis, even if greenhouse gas emissions are sharply reduced, and unless major investments are made to adapt to the coming high waters, the report says.\n\nGlobally, preparing for the floods as seas rise could cost hundreds of billions of dollars per year. In the absence of major adaptation efforts, extreme coastal flooding will become common by the end of the century due to sea-level rise, according to the report.\n\nBut the consequences of continuing on a high emissions trajectory are even starker, the authors conclude: Under a low-emissions scenario, managing the impacts of climate change will be expensive but possible. Doing little or nothing will result in catastrophic impacts.\n\n“This report should erase any doubts about the peril that climate change poses for the health of the ocean and, as a consequence, for human well-being,\" said John Tanzer of the World Wildlife Fund's global oceans program. \"From coral reefs and mangroves to fish populations and coastal habitats, climate change and human pressures are rapidly destroying the natural capital that supports the lives and livelihoods of hundreds of millions of people around the world.\"\n\nArctic sea ice keeps shrinking: Polar bears may disappear\n\nThe report, finalized by IPCC scientists along with representatives of 110 countries in Monaco this week, comes the day after an urgently convened Climate Action Summit at U.N. headquarters in New York. Youth activist Greta Thunberg castigated world leaders at the start of the session, saying \"This is all wrong. I shouldn't be up here, I should be back in school on the other side of the ocean.\"\n\nThunberg, 16, her voice cracking, told the global leaders they were failing. \"For more than 30 years the science has been crystal clear. How dare you continue to look away?\"\n\nBut the world's largest polluters – the U.S., China and India – sat on the sidelines or pledged little to nothing in terms of ratcheting down harmful carbon dioxide and other industrial gases that continue to pile up at unprecedented levels in the Earth's atmosphere.\n\nIndia's Prime Minister Narendra Modi did vow to more than double renewable energy, as President Donald Trump, a surprise last-minute attendee, listened quietly in the audience. About 70 small and medium countries, most of whom are already grappling with the climate crisis, did pledge further cuts, even though their collective emissions are relatively small.", "description": "Both U.S. coasts face annual hundred year floods even if greenhouse gases are lowered. But doing nothing would be worse, UN scientists say.", "authors": ["Janet Wilson", "Doyle Rice", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Rf9qmE77mhILpGVrh.B4Ww--~B/aD00NTA7dz0zNjA7c209MTthcHBpZD15dGFjaHlvbg--/http://d.yimg.com/hd/cp-video-transcode/1009217/65cb79a9-02b8-4a7f-8aab-1362c984a8d9/91fe7102-9982-585b-9f27-cf068fc0abbc/data_3_0.jpg?s=0934d9d804c275fcaf2293e2378a9716&c=824aa0951e8394826b508be5fae1f49f&a=tripleplay4us&mr=0", "published_at": "2019-09-25"}