{"pub": "breitbart", "url": "https://breitbart.com/2020-election/2019/10/25/fact-check-joe-biden-is-not-the-democrat-frontrunner", "downloaded_at": "2019-10-25 22:23:16.111742+00:00", "title": "Fact Check: Joe Biden Is Not the Democrat Frontrunner", "language": "en", "text": "Former Vice President Joe Biden claims to still be the Democrat frontrunner in an upcoming 60 Minutes interview.\n\nBiden, who has fallen behind rivals like Sens. Bernie Sanders (D-VT) and Elizabeth Warren (D-MA) in both fundraising and polling, was asked by CBS News’s Norah O’Donnell if he still considered himself the candidate to beat in the field of 2020 Democrats.\n\n“I know I’m the frontrunner. Find me a national poll with a notable – a couple exceptions. The last four that have come out – but look, this is a marathon,” Biden responded. “This is a marathon.”\n\nThe former vice president maintained the claim even after pushback by O’Donnell, who noted both Warren and Sanders have significantly more money in their campaign coffers.\n\n“I just flat beat them,” Biden said, before adding, “We’re on a course to do extremely well. I’m not worried about being able to fund this campaign. I really am not, truly.”\n\nContrary to the former vice president’s assertion, most media outlets on both the left and right have deemed him to no longer be the frontrunner. In particular, outlets like Politico and The Washington Post have pointed to polls showing Biden well behind his rivals in the early caucus and primary states.\n\nSince starting this campaign in late-April, Biden has dropped from leading by as much as double digits in states like Iowa, New Hampshire, and Nevada. A poll released from Iowa this week showed the former vice president in fourth place, trailing not only Sanders and Warren, but also South Bend Mayor Pete Buttigieg.\n\nIowa Democratic Caucus: Warren 28 (+4 Since last Month)\n\nButtigieg 20 (+7)\n\nSanders 18 (+2)\n\nBiden 12 (-4)\n\nKlobuchar 4 (+1)\n\nHarris 3 (-2)\n\nSteyer 3 (+1)\n\nGabbard 2 (-4)\n\nYang 2 (-1)\n\nEveryone else 1% or less Iowa State University/@Civiqs Pollhttps://t.co/TFEtJZaDBB — Political Polls (@PpollingNumbers) October 24, 2019\n\nIn New Hampshire, where Biden once led by more than 15 percentage points, the former vice president has been eclipsed by neighboring state rival, Warren. In fact, Biden has not led Warren in the first primary state since mid-September.\n\nCBS News Poll – New Hampshire Democratic primary (change from last): Warren 32 (+5)\n\nBiden 24 (-2)\n\nSanders 17 (-8) Same story as the rest of the Democratic polls at the moment – Warren climbing up as Biden slides and Bernie slowly fades away. pic.twitter.com/eQzbnovCkR — Josh Jordan (@NumbersMuncher) October 13, 2019\n\nNEW Monmouth poll among registered New Hampshire Democrats and unaffiliated voters who are likely to participate in the 2020 N.H. Democratic primary: Warren – 27%\n\nBiden – 25%\n\nSanders – 12%\n\nButtigieg – 10%\n\nHarris – 3%\n\nBooker – 2%\n\nGabbard – 2%\n\nKlobuchar – 2%\n\nSteyer – 2%\n\nYang – 2% — Amanda Golden (@amandawgolden) September 24, 2019\n\nA similar situation has played out nationally, although to less of a degree. In the weeks after Biden first announced his campaign, he led the field by as much as 32 percentage points. In comparison, a Quinnipiac Poll from this week found the former vice president trailing Warren, 21 percent to 28 percent, respectively. A similar Quinnipiac Poll taken just before the most recent Democrat presidential primary, which most pundits agreed was not Biden’s best performance, had seen Warren leading the former vice president more narrowly, 30 percent to 27 percent.\n\nOther national polls from around the same time, found Biden similarly displaced as the frontrunner:\n\n#National @YouGovUS/@TheEconomist Poll (RV, 10/13-15):\n\nWarren 29%\n\nBiden 25%\n\nSanders 13%\n\nButtigieg 7%\n\nHarris 5%\n\nGabbard 3%\n\nKlobuchar 2%\n\nYang 2%\n\nO'Rourke 2%\n\nBooker 1%\n\nBennet 1%\n\nDelaney 1%\n\nSteyer 1%\n\nCastro 0%\n\nWilliamson 0%\n\nRyan 0%\n\nMessam 0\n\nSestak 0\n\nBullock 0https://t.co/uSdkD01Van — Political Polls (@Politics_Polls) October 17, 2019\n\nNational Democratic Primary:\n\nWarren 29%\n\nBiden 27%\n\nSanders 12%\n\nButtigieg 7%\n\nHarris 6%@AvalancheStrat 10/1-4https://t.co/j1LTmpnlqI — Political Polls (@Politics_Polls) October 17, 2019\n\nBiden’s squandered lead in the polls has coincided with a drop-off in fundraising. Even though Biden started the race with a strong funding advantage, due to his connections with high-dollar donors, the former vice president ended the most recent fundraising quarter well behind his competitors. In between July and the end of September, Biden only raised $15.2 million. The sum was dwarfed by that raised by Sanders ($25.3 million), Buttigieg ($19.1 million), and Warren ($24.6 million).\n\nPosing more of a problem for the former vice president, however, is that his campaign has spent heavily since announcing in late-April, depleting his total cash on hand to just $9 million at the end of the third quarter. His rivals, on the other hand, still have campaign coffers brimming with cash, especially Sanders who finished the reporting period with more than $33 million on hand.\n\nAll of that has led to even Biden’s former Obama administration colleagues, such as David Axelrod, acknowledging he is no longer the frontrunner.", "description": "Former Vice President Joe Biden claimed to still be the Democrat frontrunner in a soon to be 60 Minutes interview.", "authors": ["Haris Alic"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-1173655366-2-640x335.jpg", "published_at": "2019-10-25"}