{"pub": "independent", "url": "https://independent.co.uk/life-style/fashion/karl-lagerfeld-death-chanel-fendi-chloe-best-looks-style-runway-creative-director-a8786506.html", "downloaded_at": "2019-09-08 12:55:09.005436+00:00", "title": "Karl Lagerfeld’s most memorable designs throughout his career", "language": "en", "text": "News of Karl Lagerfeld’s death has left the fashion world in mourning, prompting many to look back on the creative director's unrivalled legacy in the industry.\n\nThe Hamburg-born designer was one of the most prolific figures in the business, having spent almost 70 years honing his design talents across a spectrum of brands including Balmain, Chloé and Fendi, where he simultanesously served as creative director.\n\nLagerfeld also launched an eponymous label in 1984, but it was his work at Chanel that saw him internationally recognised as the \"Kaiser\" of fashion.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nDuring his tenure at the luxury French fashion house, where he had held the role of artistic director from 1983, the designer spearheaded a number of looks that became synonymous with the brand, from tweed suits to layered pearl necklaces.\n\nMany of these were revived creations of founder Coco Chanel’s archived signatures, including the interlocking “C” monogram, the tweed suit and the famous chain handbag strap.\n\nShape Created with Sketch. Karl Lagerfeld's most iconic designs Show all 13 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Karl Lagerfeld's most iconic designs 1/13 70s chic at Chloé Before he worked at Chanel, Lagerfeld designed for bohemian-inspired label Chloé. Here, he's pictured alongside a model ahead of showcasing his spring ready-to-wear collection in 1974 for the French fashion house. While there, Lagerfeld became renowned for cementing the label's romantic roots via bold prints and flowing dresses. Rex Features 2/13 His first collection for Chanel Lagerfeld presented his first collection for Chanel in January 1983, which was widely praised by the press at the time for reinvigorating the brand by bringing hemlines up and adding some pizzazz to the label's accessory line. AFP/Getty Images 3/13 The power suit Thanks to Chanel, the suit has become one of the most adored silhouettes during the 21st Century, with a focus on bolero jackets, tweeds, and chiffons. Following years experimenting with denim, faux rips, hot pants, and concrete beads on the suits, for his spring/summer 2016 haute couture collection the designer hinted at the brand’s focus on sustainability, adorning one suit from the collect with finely cut pieces of wood. AFP/Getty Images 4/13 The interlocking logo It's one of the most recognisable logos in the world, but the famous interlocking \"C\" logo might not be on Chanel's products today had it not been for Lagerfeld. The designer modernised the label when he took over as artistic director in 1983, proceeding to put the now-iconic logo on a whole host of Chanel garments and accessories. Some believe the double \"c\" stands for Coco Chanel, in reference to the brand's founder. But others claim it was inspired by a visit by Chanel herself to Château de Crémat in Nice, where she's believed to have attended several parties hosted by her friend, socialite Irene Brez. Here, the logo is seen on one of Chanel's most sought-after products: the chain-strap handbag. 5/13 The pink ruffle gown It was the gown that sparked a thousand \"oohs\" and \"aahs\". Lagerfeld ended his spring/summer 2017 show with a thrilling ruffled pink gown as modeled by Lily Rose Depp, whose casting in the show was made all the more significant given that her mother, Vanessa Paradis, was also a model for the brand. Getty Images 6/13 The Fendi 'baguette' It is probably Fendi's most famous item. The slim, baguette bag was designed by Silvia Venturini Fendi, who is the only family member still working at the Italian label. But under Lagerfeld's reign, it has become a cult fashion item, having been reworked season to season with new designs continuously emerging. Getty Images 7/13 CC-logo-ed guitar At Chanel's spring/summer 2009 ready-to-wear collection, the designer sent one model down the runway carrying a CC-logo-ed guitar and matching case. AFP/Getty Images 8/13 The Dying Swan dress Lagerfeld might be better-known for his fashion designs, but he also dabbled in costume and produced this tutu for the English National Ballet in 2009 as part of a special production by the dance company Ballets Russes, for whom Coco Chanel was a benefactor. Getty Images 9/13 The 'lampshade' dress Keira Knightley struck a distinctive silhouette in this Chanel dress, which she wore to Paris Fashion Week in 2014 to attend the brand's autumn/winter show. The corseted layer dress was from the brand's couture spring 2014 collection. AFP/Getty Images 10/13 The multi-layered pearl necklace One of Lagerfeld's most contemporary contributions to Chanel was accessories. The multi-layered pearl necklace continues to be a prominent feature of his collections, and have been firm favourites among celebrities, too. In 2006, it even made an appearance in the cult fashion film \"The Devil Wears Prada\", in which it was worn by lead actor Anne Hathaway to illustrate her character's newfound fashionable taste. Getty Images 11/13 The Karl Lagerfeld x H&M collaboration In 2004, Lagerfeld was the first designer to collaborate with the Swedish retailer, who has been partnering with major fashion brands ever since. The collection prompted huge excitement among Lagerfeld's fans as they reveled in the fact that they could now purchase his designs as a lower price point. Getty Images 12/13 The pregnant bride For the Chanel autumn 2014 couture show finale, Largerfeld walked hand-in-hand with a seven-month pregnant model down the catwalk. The model was dressed in a crêpe de Chine dress with a gold, brocade cape and a line of buttons along the bodice. The model’s hair was teased into a quiff. AFP/Getty Images 13/13 Cara Delevigne's space-age outfit for the Met Gala The model has been a Chanel muse for several years and chose to support the brand at the 2017 Met Gala by wearing a dramatic sci-fi-inspired suit. The suit featured a plunging neckline and bold shoulders, contrasting with the star's smooth metallic-painted silver bald head. The model-turned-actor accessorised the look with a dusting of silver body glitter and a wide silver belt at the waist. 1/13 70s chic at Chloé Before he worked at Chanel, Lagerfeld designed for bohemian-inspired label Chloé. Here, he's pictured alongside a model ahead of showcasing his spring ready-to-wear collection in 1974 for the French fashion house. While there, Lagerfeld became renowned for cementing the label's romantic roots via bold prints and flowing dresses. Rex Features 2/13 His first collection for Chanel Lagerfeld presented his first collection for Chanel in January 1983, which was widely praised by the press at the time for reinvigorating the brand by bringing hemlines up and adding some pizzazz to the label's accessory line. AFP/Getty Images 3/13 The power suit Thanks to Chanel, the suit has become one of the most adored silhouettes during the 21st Century, with a focus on bolero jackets, tweeds, and chiffons. Following years experimenting with denim, faux rips, hot pants, and concrete beads on the suits, for his spring/summer 2016 haute couture collection the designer hinted at the brand’s focus on sustainability, adorning one suit from the collect with finely cut pieces of wood. AFP/Getty Images 4/13 The interlocking logo It's one of the most recognisable logos in the world, but the famous interlocking \"C\" logo might not be on Chanel's products today had it not been for Lagerfeld. The designer modernised the label when he took over as artistic director in 1983, proceeding to put the now-iconic logo on a whole host of Chanel garments and accessories. Some believe the double \"c\" stands for Coco Chanel, in reference to the brand's founder. But others claim it was inspired by a visit by Chanel herself to Château de Crémat in Nice, where she's believed to have attended several parties hosted by her friend, socialite Irene Brez. Here, the logo is seen on one of Chanel's most sought-after products: the chain-strap handbag. 5/13 The pink ruffle gown It was the gown that sparked a thousand \"oohs\" and \"aahs\". Lagerfeld ended his spring/summer 2017 show with a thrilling ruffled pink gown as modeled by Lily Rose Depp, whose casting in the show was made all the more significant given that her mother, Vanessa Paradis, was also a model for the brand. Getty Images 6/13 The Fendi 'baguette' It is probably Fendi's most famous item. The slim, baguette bag was designed by Silvia Venturini Fendi, who is the only family member still working at the Italian label. But under Lagerfeld's reign, it has become a cult fashion item, having been reworked season to season with new designs continuously emerging. Getty Images 7/13 CC-logo-ed guitar At Chanel's spring/summer 2009 ready-to-wear collection, the designer sent one model down the runway carrying a CC-logo-ed guitar and matching case. AFP/Getty Images 8/13 The Dying Swan dress Lagerfeld might be better-known for his fashion designs, but he also dabbled in costume and produced this tutu for the English National Ballet in 2009 as part of a special production by the dance company Ballets Russes, for whom Coco Chanel was a benefactor. Getty Images 9/13 The 'lampshade' dress Keira Knightley struck a distinctive silhouette in this Chanel dress, which she wore to Paris Fashion Week in 2014 to attend the brand's autumn/winter show. The corseted layer dress was from the brand's couture spring 2014 collection. AFP/Getty Images 10/13 The multi-layered pearl necklace One of Lagerfeld's most contemporary contributions to Chanel was accessories. The multi-layered pearl necklace continues to be a prominent feature of his collections, and have been firm favourites among celebrities, too. In 2006, it even made an appearance in the cult fashion film \"The Devil Wears Prada\", in which it was worn by lead actor Anne Hathaway to illustrate her character's newfound fashionable taste. Getty Images 11/13 The Karl Lagerfeld x H&M collaboration In 2004, Lagerfeld was the first designer to collaborate with the Swedish retailer, who has been partnering with major fashion brands ever since. The collection prompted huge excitement among Lagerfeld's fans as they reveled in the fact that they could now purchase his designs as a lower price point. Getty Images 12/13 The pregnant bride For the Chanel autumn 2014 couture show finale, Largerfeld walked hand-in-hand with a seven-month pregnant model down the catwalk. The model was dressed in a crêpe de Chine dress with a gold, brocade cape and a line of buttons along the bodice. The model’s hair was teased into a quiff. AFP/Getty Images 13/13 Cara Delevigne's space-age outfit for the Met Gala The model has been a Chanel muse for several years and chose to support the brand at the 2017 Met Gala by wearing a dramatic sci-fi-inspired suit. The suit featured a plunging neckline and bold shoulders, contrasting with the star's smooth metallic-painted silver bald head. The model-turned-actor accessorised the look with a dusting of silver body glitter and a wide silver belt at the waist.\n\nIn 2004, he collaborated with high street giant H&M, marking the first in a series of designer partnerships for the Swedish retailer.\n\nMeanwhile, over at Fendi, Lagerfeld is largely credited for constantly reinventing the label's famous baguette bag, which became such a cult fashion item that actor Sarah Jessica Parker described it as a \"very big deal\" for her Sex and the City character, Carrie Bradshaw, to carry one in the television series.\n\nBut Lagerfeld's artistic talents did not end with fashion, he also designed the costumes for the English National Ballet in 2009 for a special performance by the legendary dance company Ballets Russes in honour of their centenary.\n\nLook back on some of the inimitable designer's most pioneering looks by clicking through the gallery above.", "description": "News of Karl Lagerfeld’s death has left the fashion world in mourning, prompting many to look back on the creative director's unrivalled legacy in the industry.", "authors": ["Olivia Petter", "Katie O'Malley"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/02/19/15/lagerfeldpregnancyrunway.jpg", "published_at": "2019-09-08"}