{"pub": "cnbc", "url": "https://cnbc.com/2019/10/11/savings-accounts-besides-ally-offering-2-percent-interest.html", "downloaded_at": "2019-10-11 19:36:49.567716+00:00", "title": "Ally lowered rates on its high-yield savings account again—here are some alternatives", "language": "en", "text": "But in a crowded field, there are plenty of other finance companies vying to hold your money. Here are the companies currently offering over 2% on savings.\n\nThe drop comes as the Federal Reserve debates cutting its benchmark short-term interest rate again. While those rate cuts can help consumers taking out a mortgage or personal loan, it also means that savings account rates suffer .\n\nAlly, one of the most popular online banks, informed account holders it's dropping the interest rate on its high-yield savings account from 1.9% to 1.8% today , following previous cuts earlier in the year from a high of 2.2%.\n\nSavings rates can change at any time, but with an influx of fintech companies like Robinhood, Wealthfront and Credit Karma now in the banking game, savers can still earn over 2%, at least for now.\n\nRobinhood announced this week that it's relaunching its cash management account with a 2.05% APY, though there is no confirmed release date for this account.\n\nAs noted above, most of the fintech companies, save Vio, are not chartered as banks, meaning that the products they're offering are not technically savings accounts. They partner with other regional banks, which hold savers' money and provide FDIC insurance. Savers should research all of their options thoroughly, and get a handle on the banks the companies partner with, before opening an account.\n\nAnd while they're still offering APYs above 2%, Betterment's rate has fallen since July, when it was at a peak of 2.69%, and Wealthfront's from 2.57%. With additional rate cuts from the Fed, they could fall further.\n\nIf you're happy with Ally, there's no need to make a switch: The national average APY rate sits at 0.09% for savings accounts, according to the FDIC, so Ally's 1.8% rate is still 20 times higher.\n\nDon't miss: Here's what to know before signing up for a high-yield savings account at a robo-advisor\n\nLike this story? Subscribe to CNBC Make It on YouTube!", "description": "Ally, one of the most popular online banks, informed account holders it's dropping the interest rate on its high-yield savings from 1.9% to 1.8% today, following previous cuts earlier in the year from a high of 2.2% APY. Here are some alternatives.", "authors": ["Alicia Adamczyk"], "top_image": "https://image.cnbcfm.com/api/v1/image/106176985-1570803352854business-laptop-using-technology-people-using-laptop-laptop-computer_t20_xv1zgb.jpg?v=1570803378", "published_at": "2019-10-11"}