{"pub": "fox", "url": "https://foxbusiness.com/media/joker-movie-aurora-shooting-survivors-letter-warner-bros", "downloaded_at": "2019-09-25 04:37:27.036786+00:00", "title": "‘Joker’ movie moves Aurora shooting survivors to pen Warner Bros. letter", "language": "en", "text": "The victims of the Aurora, Colorado, mass shooting have reached out to Warner Bros. with a plea as the release date for the latest Batman movie, \"Joker,\" approaches.\n\nContinue Reading Below\n\nJoaquin Phoenix stars in “Joker,” Todd Phillips’ sinister, R-rated film about the origin of the Batman villain. Survivors of the massacre which took place during a 2012 screening of another Batman film featuring the villain, “The Dark Knight Rises,” have asked Warner Bros not to show \"Joker\" in the same theater where the mass shooting took place seven years ago, according to The Hollywood Reporter.\n\nIn lieu of showing the film to Aurora audiences, some of the survivors and family members of victims have asked the studio to donate funds to groups focused on helping victims of mass shootings.\n\nImage 1 of 7 ▼ The family of the late Heath Ledger, including mother Sally Bell, sister Kate Ledger, and father Kim Ledger, accept the Oscar for best supporting actor on Heath Ledger's behalf for his work in \"The Dark Knight\" during the 81st Academy Awards in Hollywood, California February 22, 2009. REUTERS/Gary Hershorn (UNITED STATES) (OSCARS-SHOW)\n\n\"We are calling on you to be a part of the growing chorus of corporate leaders who understand that they have a social responsibility to keep us all safe,\" the letter states, according to The Hollywood Reporter which received a copy.\n\nIn a prepared statement, Warner Bros. said that the company extended its deepest sympathy to all the victims of mass shootings, and the company has had a long history of donating to victims of violence, including the victims and survivors of the Aurora shooting. The company wants policymakers to enact bi-partisan legislation to address the issue of mass shootings.\n\nAdvertisement\n\nAt the same time, Warner Bros. believes that one of the functions of storytelling is to provoke difficult conversations around complex issues. Make no mistake: neither the fictional character Joker, nor the film, is an endorsement of real-world violence of any kind. It is not the intention of the film, the filmmakers or the studio to hold this character up as a hero.\"\n\nJames Holmes, the shooter who murdered 12 people and injured 70 inside the Aurora Cinemark Theater using an assault rifle and other guns, is currently serving life in prison.\n\nMovie fan and Aurora shooting survivor Pierce O’Farrill, which was shot three times at point-blank range with a pistol describes to FOX Business the scene inside the Aurora theater that day.\n\n“I was in the theater… I was in the third row. I saw the gunman come in and I saw the tear gas go flying across the screen,\" said O'Farrill who still has a bullet lodged in his left arm.\"I watched him open fire and I got down and I prayed.”\n\nSandy Phillips' 24-year-old daughter Jessica Ghawi was not as lucky. She is still haunted by the horrible event that took her daughter's life and is not at all interested in seeing Joaquin Phoenix in the film.\n\n\"I don’t need to see a picture of [Holmes]; I just need to see a 'Joker' promo and I see a picture of the killer,\" Phillips toldThe Hollywood Reporter.\n\nPhillips, who created a gun advocacy group 'Survivors Empowered' helped write the letter to Warner Bros. partly because she feels shootings are becoming too common and she fears audiences will continue to emulate mentally ill antihero’s like Phoenix’s character.\n\nO'Farrill said that he was not asked to sign the letter, and that he likely would not have signed the letter because he doesn't feel the shooting should invalidate Second Amendment rights to bear arms.\n\n“I am an old fashioned constitutionalist, I love the constitution and I am a second amendment guy all the way. If you start to ask them to not show the movie in theaters… that is too close to that first amendment right,\" says O'Farrill. \"It is a different film, and I get that James Holmes got the idea from Heath Ledger’s Joker, but even if it wasn’t for that film, the kid was so sick he was going to hurt people.”\n\nO’Farrill also explained to FOX that he did not blame gun makers, Warner Bros or the theater for what happened to him and he did not participate in any of the class action lawsuits that followed his tragedy.\n\nIt remains to be seen if the latest, dark, violent portrayal of the Clown Prince of Crime from the Batman comics will insight more violence.\n\n“I don’t think the new Joker film will inspire more shootings, for me it is not a concern,\" O'Farrill said. \"There is evil in this world, it is just an unfortunate reality, it is going to happen.”.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "Aurora shooting survivors send letter to Warner Bros about new Joker movie.", "authors": ["Mike Cherico"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/joker-banner.jpg?ve=1&tl=1", "published_at": "2019-09-24"}