{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/tributes-boy-14-who-died-20571354", "downloaded_at": "2019-10-13 18:39:58.838414+00:00", "title": "Tributes to boy, 14, who died in 'stolen' car crash during police chase", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA 14-year-old boy who died after a suspected stolen car crashed while being chased by police has been named locally.\n\nLeo Gradwell was believed to have been behind the wheel of the Fiat 500 when it smashed into two other cars in a street in Wigan, Greater Manchester on Friday afternoon.\n\nTwo other boys in the car were also injured in the crash, a 14-year-old, who suffered minor injuries and a 15-year-old who is fighting for his life in hospital.\n\nLeo's picture was placed at the scene of the tragedy alongside balloons spelling out his name and messages from his siblings, the Manchester Evening News reports\n\nOne said: \"Leo I love you so much. I'll always think of you and you'll never be forgotten. Lots of love your baby sister Casey Moo.\"\n\n(Image: MEN WS)\n\nDozens of friends have also paid tribute to him on social media.\n\nOne friend wrote: \"Yesterday and last night honestly was the hardest.\n\n\"To wake up at 4.20 to check my phone for any news and to see leos passed just an hour before was literally the worst pain I could of ever felt, not only did he help me through everything but he was the strongest most kindhearted lad I ever knew, still can’t wrap my head around what’s happened, all this from some silly mistake they made, seeing him the way he was broke my heart, cannot imagine what his family are going through.\n\n\"My heart really does go out to his family.\n\n\"RIP Leo Gradwell, will miss you so much.\"\n\nAnother widely shared message on Facebook reads: \"Let’s turn Facebook bright and beautiful for LEO! R.I.P LEO GRADWELL FLY HIGH.\n\n\"Let’s make Facebook bright in remembrance for Leo.\"\n\nLeo was taken to hospital, but sadly passed away in the early hours of Saturday.\n\nPolice say the chase began when the Fiat failed to stop for police on Warrington Road in Abram at around 1.25pm.\n\nThe crash is thought to have taken place close to a bend on the 40mph road near a farmer's field and a row of bungalows.\n\n(Image: MEN WS)\n\nThe crash has been referred to the Independent Office for Police Conduct by GMP’s Professional Standards Branch.\n\nThe office said: \"We have made initial contact with the boy's family to explain our involvement and express our condolences.\"\n\n\"Anyone who witnessed events leading up to the collision is asked to contact the IOPC on 0800 096 9070 or email: witness@policeconduct.gov.uk.\"\n\nIn a statement yesterday Sergeant Jon McColl, of GMP’s Serious Collision Investigation Unit, said: \"First and foremost, I would like to extend our deepest sympathies to the family of the boy who passed away this morning.\n\n\"The Serious Collision Investigation Unit is continuing with enquiries so that the full circumstances surrounding the collision can be established.\"", "description": "Leo Gradwell was believed to have been behind the wheel of the Fiat 500 when it smashed into two other cars in a street in Wigan, Greater Manchester on Friday afternoon", "authors": ["Brendan Mcfadden", "Beth Abbit", "Damon Wilkinson", "Image", "Men Ws"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20571365.ece/ALTERNATES/s1200/0_First-picture-of-boy-14-who-died-in-crash-during-police-chase.jpg", "published_at": "2019-10-13"}