{"pub": "investing.com", "url": "https://investing.com/analysis/weekly-cot-report-dollar-bears-throw-in-the-towel-200466916", "downloaded_at": "2019-09-23 09:09:41.383713+00:00", "title": "Weekly COT Report: Dollar Bears Throw In The Towel", "language": "en", "text": "Large Speculative Positioning\n\nAs of Tuesday 17th September:\n\nTraders increased net-long exposure to the USD by $2.2 billion, taking bullish exposure to a 3-month high of $15.4 billion\n\nBullish exposure to the was at a 29-month high\n\nTraders were the least bearish on in 6-months\n\nNet-short exposure on hit a record high\n\nDXY Large Speculative Positioning\n\nDXY: Traders are their most bullish on the USD index since April 2017. However, its sudden jump to new highs has been fuelled by a sharp decline in short positions, with bears closing -9,599 short contacts. We’re yet to see the index break to new highs, but bears fleeing could be the first steps towards such an event.\n\nAUD Large Speculative Positioning\n\nNZD Large Speculative Positioning\n\nAUD: Traders are their least bearish on the Aussie in 6 months, having reduced gross-short exposure. That we’ve not see an increase of longs suggests it could be corrective behaviour as opposed to a turnaround, but worth noting none the less as prices remain near multi-year lows as bears lose interest. And this was despite that fact that Tuesday’s RBA minutes saw a higher chance of a 25 bps cut next month.\n\nLarge Speculative Positioning (As % Of Open Interest)\n\nNZD: Net-short exposure hit a record high, although it was achieved on the closer of longs as opposed to initiation of fresh shorts. Still, with net and gross short exposure at record levels, it’s highly possible we’re at or approaching a sentiment extreme. So bears beware.\n\nAs of Tuesday 17th September:\n\nMinor changes to gold positioning saw bears remain sidelined\n\nBearish exposure on hit a 6-week low\n\nBullish exposure to hit a 6-week high\n\nGold Large Speculative Positioning\n\nGold: Despite its epic rally, bears remain hesitant to commit and bulls remain defiant. With prices holding above $1500, it’s possible bulls are carving out a corrective low. So we’ll continue to monitor this key level as it could prove to be the springboard for next advance, or the trigger for a deeper correction..\n\nOriginal Post", "description": "Forex Analysis by City Index (Matt Simpson) covering: AUD/USD, XAU/USD, USD/NZD, US Dollar Index Futures. Read City Index (Matt Simpson)'s latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-23"}