{"pub": "reuters", "url": "https://reuters.com/article/us-saudi-aramco/media-visit-saudi-oil-plant-damaged-in-strike-blamed-on-iran-idUSKBN1W40VN", "downloaded_at": "2019-09-20 22:59:49.831768+00:00", "title": "Media visit Saudi oil plant damaged in strike blamed on Iran", "language": "en", "text": "ABQAIQ, Saudi Arabia (Reuters) - Saudi Arabia on Friday took media on a tour of oil facilities damaged by attacks that Washington and Riyadh blame on Iran, showing melted pipes and burnt equipment, as Tehran vowed wide retaliation if heightened tensions boil over into hostilities.\n\nThe kingdom sees the Sept. 14 strikes on its Khurais and Abqaiq facilities — the worst attack on Gulf oil infrastructure since Iraq’s Saddam Hussein torched Kuwaiti oilfields in 1991 — as a test of global will to preserve international order.\n\nU.S. President Donald Trump said on Friday the United States was imposing sanctions on Iran’s central bank over the attack. U.S. Treasury Secretary Steven Mnuchin said the bank was Tehran’s last source of funds.\n\nAsked about the possibility of a military response on Iran, Trump said the United States was always prepared and that a military strike was always a possibility.\n\nIran denies involvement in the attack, which initially halved oil output from Saudi Arabia, the world’s largest petroleum exporter. Responsibility was claimed by Yemen’s Houthi movement, an Iran-aligned group fighting a Saudi-led alliance in Yemen’s four-year-old conflict.\n\nAt Abqaiq, one of the world’s largest oil processing plants, reporters saw a punctured, blackened stabilizer tower that Khalid Buraik, Saudi Aramco vice-president for southern area oil operations, said would have to be replaced.\n\nAs reporters examined a shattered separator dome draped with a red tape labeled “Danger”, Buraik said 15 towers and facilities had been hit at Abqaiq, but it would regain full output capacity by the end of September.\n\nAt Khurais oilfield to the west, which the Saudi defense ministry says was hit by four missiles, Reuters reporters were shown repair work under way, with cranes erected around two burnt-out stabilization columns, which form part of oil-gas separation units, and melted pipes.\n\n“We are confident we are going back to the full production we were at before the attack (on Khurais) by the end of September,” Fahad Abdulkarim, Aramco’s general manager for the southern area oil operation, told reporters.\n\n“We are working 24/7...This is a beehive.”\n\nDEBRIS\n\nWorkmen wearing red high visibility jackets and white helmets moved through the site, a large compound the size of several football stadiums containing interconnected structures of piping and towers.\n\nA mound of blackened debris lay on the ground. An executive said the scorched mess once covered much of the surface of the facility but now only a small mound is left.\n\nSome workers sprayed what appeared to be water on the ground. Mobile cranes and water trucks stood near the crumpled, mangled remains of a fire-damaged stabilization tower.\n\nThe Sept. 14 attacks intensified a years-long struggle between Saudi Arabia and Iran, who are locked in a sometimes violent contest for influence in several flashpoints around the Middle East.\n\nSaudi Minister of State for Foreign Affairs Adel al-Jubeir said on Thursday the attacks were an “extension of the Iranian regime’s hostile and outlawed behavior”.\n\nIran has warned the United States against being dragged into a war in the Middle East and said it would meet any offensive action with a crushing response.\n\nTehran amplified that message on Friday when a senior Revolutionary Guards commander said Iran would respond from the Mediterranean to the Indian Ocean against any U.S. plots.\n\nView of the damaged site of Saudi Aramco oil facility in Abqaiq, Saudi Arabia, September 20, 2019. REUTERS/Hamad l Mohammed\n\n“If the Americans think of any plots, the Iranian nation will respond from the Mediterranean, to the Red Sea and to the Indian Ocean,” said General Yahya Rahim-Safavi, a senior adviser to Iran’s supreme leader, state news agency IRNA reported.\n\nCOALITION\n\nLebanon’s Iranian-backed Hezbollah movement warned Saudi Arabia against betting on a war against Iran “because they will destroy you,” its leader Sayyed Hassan Nasrallah said.\n\n“Your house is made of glass and your economy is made of glass. Like the glass cities in the UAE,” he said.\n\nU.S. Secretary of State Mike Pompeo had called the attacks an “act of war” but on Thursday he said Trump, who has ordered more sanctions on Iran, wants a peaceful solution to the crisis.\n\nIran’s foreign minister on Friday questioned Pompeo’s remarks and listed repeated Iranian diplomatic initiatives.\n\n“Coalition for Peaceful Resolution?,” Mohammad Javad Zarif said on Twitter, and listed eight diplomatic initiatives by Iran since 1985, including a peace plan for Yemen in 2015.\n\nHe later said Saudi Arabia and its ally the United Arab Emirates seemed to wish to “fight Iran to the last American”.\n\nOil prices were on track for their biggest weekly jump since January, lifted by rising Middle East tensions after the attack. Brent crude was up more than 7% from last Friday’s close at $64.69 a barrel, U.S. West Texas Intermediate was $58.47.\n\nChinese President Xi Jinping told Saudi King Salman in a phone call that China condemned the attack and called on all parties to avoid escalating the situation, Xinhua reported.\n\nSlideshow (23 Images)\n\nDespite being a relatively low-profile diplomatic player in the Middle East, China has close economic and energy relations with both Saudi Arabia and Iran.\n\nRussian Foreign Minister Sergei Lavrov said groundless accusations against Iran over the attacks were inflaming tensions, Interfax news agency reported.", "description": "Saudi Arabia on Friday took media on a tour of oil facilities damaged by attacks that Washington and Riyadh blame on Iran, showing melted pipes and burnt equipment, as Tehran vowed wide retaliation if heightened tensions boil over into hostilities.", "authors": ["Stephen Kalin", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190920&t=2&i=1432001624&w=1200&r=LYNXMPEF8J1BO", "published_at": "2019-09-20"}