{"pub": "guardian", "url": "https://theguardian.com/sport/2019/sep/17/wales-rob-howley-successful-player-coach-betting", "downloaded_at": "2019-09-17 23:28:25.066327+00:00", "title": "Rob Howley: a successful player and coach who struggled to win hearts", "language": "en", "text": "“The future can wait,” were the final words Rob Howley uttered in the last interview he gave as Wales’s attack coach, the day after the World Cup squad was announced at the beginning of this month. The question now is whether a man who captained his country, toured with the Lions five times as a player and coach, scored the winning try for Wasps in a European Cup final against Toulouse and oversaw the 2013 Six Nations title campaign, which ended with a thumping victory over England, has a future in the game after the Welsh Rugby Union received information related to him betting on matches.\n\nWales's Rob Howley sent home from World Cup amid betting investigation Read more\n\nAs he was flying home to consider his defence before an independent panel that will be convened if it is found he has a case to answer, Stephen Jones, who was to succeed him as attack coach after the World Cup, was setting out in the opposite direction. Warren Gatland has tried to keep his side flying under the radar as the head coach plotted making his exit after 12 years in charge with the Webb Ellis Cup in his grasp, but he has it all to do after an emergency landing six days before their opening match against Georgia.\n\nAfter news leaked out, the Welsh Rugby Union was quick to release a statement that pointed out that it had acted immediately after recently receiving information, which had to mean after the squad flew to Japan a week ago, and that Howley had cooperated fully in discussions. It added that a panel would be convened if required, a clear reminder of innocence before guilt is proved, but at the age of 48, Howley will not have the future in the game he envisaged whatever the outcome.\n\nIn his last interview, he refused to comment on his future, saying the World Cup was all that mattered, but in recent days he had been linked with the job of Italy head coach, although he was in a long queue of names. He had the CV, part of the most successful Wales coaching team since the 1970s, assistant on three Lions tours and involved in the game in all 24 years of the professional era, yet for all his success and personal charm, he was never popular with supporters (as was shown by the early comments on social media after news of his return home leaked out), never one to sugar-coat his remarks and self-possessed.\n\nFacebook Twitter Pinterest Howley (left) has worked under Warren Gatland (right) in recent years. Photograph: Andrew Fosker/Seconds Left/REX/Shutterstock\n\nIt was the same when he was a player. When he made his name as a young scrum-half with Bridgend, he resembled Brynmor Williams, the Wales and Lions scrum-half whose career unfortunately overlapped with that of Gareth Edwards, a darting menace around the fringes, all-seeing and with the pace of a wing in an age when scrum-halves had considerably more freedom than they do today. He left Bridgend for Cardiff in 1996, the year he won the first of his 59 caps, and two years later he was captaining Wales.\n\nYet even as captain, a position he held when Graham Henry took over as the Wales coach in 1998, Howley never enjoyed public popularity, as was shown when he was summarily relieved of the position. He held court to journalists at his home, where he expressed his bewilderment, and the most contented of his playing days were at Wasps, where he spent his final two years under Gatland and Shaun Edwards, who in 2008 was to join him as part of Wales’s management team.\n\nGatland and Edwards are leaving Wales after the World Cup with reputations enhanced, heroes in a foreign land, but there will be few tears dropping for Howley, who has taken the blame for the side’s economical style over the years even though, under him, players such as George North, Liam Williams, Jonathan Davies, Leigh Halfpenny and latterly Josh Adams have prospered. It was Ian McGeechan who first appointed Howley as a Lions assistant coach, having picked him as a player in 1997, and with the ruthlessness Gatland has shown to established and successful players once he feels they have left their best days behind them, so he did not keep Howley with him through loyalty.\n\n“The Welsh public are knowledgeable about the game and thoughtful,” said Howley in his final interview, “but we do live in a goldfish bowl.”\n\nIt is one he is returning to, far earlier than he expected, and he will attract little sympathy in an age in which image counts for so much. For whatever reason, one of the most approachable and cordial figures in the game, who enjoyed considerable success as a player and as a coach, was given little credit. If it hurt, he never showed it, but he will feel it now as he battles to save first his reputation and then salvage what he can of a career that, no matter what anyone says, has until this week been coated in silver.", "description": "The Wales attack coach, who has been sent home over betting claims, has rarely enjoyed public popularity", "authors": ["Paul Rees"], "top_image": "https://i.guim.co.uk/img/media/73ef635fd596e6dbd25e3ded457333eb9932cae8/0_24_2048_1228/master/2048.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ca2f2897bf4931924c4a165b864228c9", "published_at": "2019-09-17"}