{"pub": "yahoo", "url": "https://news.yahoo.com/roofstock-helps-make-real-estate-investing-affordable-145800509.html", "downloaded_at": "2019-10-28 00:40:01.731663+00:00", "title": "This startup helps make real estate investing affordable", "language": "en", "text": "Real estate investment is now in reach for people who never thought they could afford it.\n\nFintech company Roofstock lets investors buy and then rent out single-family homes on its online marketplace, giving them access to low-cost homes —often less than $100,000 — in the U.S.\n\n“What we have done is broken down the geographic barriers, so you don’t have to own where you live,” said Roofstock CEO Gary Beasley. “Millennials [are] buying multiple homes on the site and having them managed for them, so you could actually own the properties without living in the homes.”\n\nThe company manages the investment end-to-end, performing due diligence on the property, including inspections, neighborhood research and title searches, before an investor buys it. Investors never even have to see the property. To build trust with remote buyers, the company provides a 30-day money back guarantee, said Beasley.\n\nSome 93% of Roofstock’s customers buy from out-of-state, with most buyers coming from expensive coastal markets. The popular markets where customers buy are lower-priced with an established rental market, he said, with top markets including Atlanta, Indianapolis, Birmingham, Houston and San Antonio.\n\n“You could actually get on the investment bandwagon in other parts of the country where you could actually afford to buy,” said Beasley. “People looking for more flexibility and optionality in their investment strategy and where they live.”\n\nBeasley said that its typical buyers finance 70% of the purchase through government-subsidized loans through Fannie Mae and Freddie Mac. “You can build a nice portfolio using that government-backed financing,” he said. “It’s quite attractive.”\n\nRoofstock has closed $2 billion worth of transactions since it was founded less than four years ago.\n\nSarah Paynter is a reporter at Yahoo Finance. Follow her on Twitter @sarahapaynter\n\nRead the latest financial and business news from Yahoo Finance\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.\n\nMore from Sarah:\n\nReal estate developers are turning to affordable rentals\n\nBethenny Frankel on real estate: ‘Don’t worry about taking your losses on a sell’\n\nWant to buy a condo? Financing just got a little easier", "description": "Fintech company Roofstock makes real estate investment possible without even having to see the property.", "authors": ["Sarah Paynter"], "top_image": "https://s.yimg.com/uu/api/res/1.2/3AsMBuF6tuW2img6AO51JA--~B/aD0zNjc5O3c9NTUxOTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/0fc5ca20-f76c-11e9-a53f-b47bf0991f01", "published_at": "2019-10-27"}