{"pub": "axios", "url": "https://npr.org/sections/health-shots/2019/06/07/730404539/mental-health-parity-is-still-an-elusive-goal-in-u-s-insurance-coverage", "downloaded_at": "2019-10-28 09:50:12.045902+00:00", "title": "'Mental Health Parity' Is Still An Elusive Goal In U.S. Insurance Coverage", "language": "en", "text": "'Mental Health Parity' Is Still An Elusive Goal In U.S. Insurance Coverage\n\nEnlarge this image toggle caption Gary Waters/Ikon Images/Getty Images Gary Waters/Ikon Images/Getty Images\n\nAmanda Bacon's eating disorder was growing worse. She had lost 60% of her body weight and was consuming only about 100 calories a day.\n\nBut that wasn't sick enough for her Medicaid managed-care company to cover an inpatient treatment program. She was told in 2017 that unless she weighed 10 pounds less — which would have put her at 5-foot-7 and 90 pounds — or was admitted to a psychiatric unit, she wasn't eligible for coverage.\n\n\"I remember thinking, 'I'm going to die,' \" the Las Cruces, N.M., resident recalls.\n\nEventually, Bacon, now 35, switched to a plan that paid for treatment, although she says it was still an arduous process getting the services approved.\n\nMany patients, like Bacon, struggle to get insurance coverage for their mental health treatment, even though two federal laws were designed to bring parity between mental and physical health care coverage. Recent studies and a legal case suggest serious disparities remain.\n\nThe 2008 Mental Health Parity and Addiction Equity Act required large group health plans that provide benefits for mental health problems to put that coverage on an equal footing with physical illness. Two years later, the Affordable Care Act required small-group and individual health plans sold on the insurance marketplaces to cover mental health services, and do so at levels comparable with medical services. (In 2016, parity rules were also applied to Medicaid managed-care plans, which cover the majority of people in that federal-state health program for low-income residents.)\n\nThe laws have been partially successful. Insurers are no longer permitted to write policies that charge higher copays or deductibles for mental health care, nor can they set annual or lifetime upper-limits on how much they will pay for such care. But advocates for patients say insurance companies still interpret mental health claims more stringently than those for physical illness.\n\n\"Insurance companies can easily circumvent mental health parity mandates by imposing restrictive standards of medical necessity,\" says Meiram Bendat, a lawyer leading a class-action lawsuit against a mental health subsidiary of UnitedHealthcare.\n\nIn a closely watched ruling, a federal court in March sided with Bendat and patients who alleged the insurer was deliberately shortchanging mental health claims. Chief Magistrate Judge Joseph Spero of the U.S. District Court for the Northern District of California ruled that United Behavioral Health wrote its guidelines for treatment much more narrowly than common medical standards, covering only enough care to stabilize patients \"while ignoring the effective treatment of members' underlying conditions.\"\n\nUnitedHealthcare works to \"ensure our products meet the needs of our members and comply with state and federal law,\" says spokeswoman Tracey Lempner.\n\nSeveral studies, though, have found evidence of disparities in insurers' decisions.\n\nGrowing gap in coverage in hospitals\n\nIn February, researchers at the Congressional Budget Office reported that private insurance companies are paying 13% to 14% less for mental health care than Medicare does.\n\nThe insurance industry's own data show a growing gap between coverage of mental and physical care in hospitals and skilled nursing facilities. For the five years ending in 2017, out-of-pocket spending on inpatient mental health care grew nearly 13 times faster than all inpatient care, according to inpatient data reported in February by the Health Care Cost Institute, a research group funded by the insurance companies Aetna, Humana, UnitedHealthcare and Kaiser Permanente. (Kaiser Health News is not affiliated with Kaiser Permanente.)\n\nAnd a 2017 report by the actuarial firm Milliman found that an office visit with a therapist is five times as likely to be out-of-network, and thus more expensive, than a primary care appointment.\n\nIn this environment, only half of the nearly 8 million children who have been diagnosed with depression, anxiety or attention deficit hyperactivity disorder receive treatment, according to a February research letter in the medical journal JAMA Pediatrics. Fewer than 1 in 5 people with substance use disorder are treated, a national survey suggests, and, overall, nearly 6 in 10 people with mental illness get no treatment or medication, according to the National Institute Of Mental Health.\n\nAmanda Bacon, who is still receiving care for her eating disorder, remembers fearing that she wouldn't get treatment. She was at one point rushed to an emergency room for care, but after several days in the hospital she was sent home, no closer to getting well.\n\nToday, because of her disability, Bacon's primary medical insurance is through Medicare, which has paid for treatment that her earlier Medicaid provider, Molina Healthcare, refused. She has been treated in four inpatient programs in the past two years — twice through Presbyterian Centennial Care, a Medicaid plan she switched to after Molina, and twice though her current Medicare plan. Bacon is also enrolled in a state-run Medicaid plan.\n\nMolina says it can't comment on Bacon's case. \"Molina complies with mental health parity laws,\" say spokeswoman Danielle Smith, and it \"applies industry-recognized medical necessity criteria in any medical determinations affecting mental health.\"\n\nThe 'wrong criteria'\n\nDr. Eric Plakun, CEO of the Austen Riggs Center, a psychiatric hospital and residential program in Massachusetts, says that often insurers are \"using the wrong criteria\" for what makes something medically necessary. They pay enough only to stabilize a patient's condition, Plakun says, but not enough to improve their underlying illness. He was one of the experts who testified in the case before Judge Spero in California.\n\nInsurers say they recognize the importance of mental health care coverage and that they are complying with the law.\n\nCathryn Donaldson, a spokeswoman for the trade group America's Health Insurance Plans, says the industry supports parity, but that it is also harder to prove when a mental health treatment is needed.\n\nCompared with the data on medical and surgical care, she says, the data and standards to measure mental health care \"trail far behind.\" She cited a 2016 study of Minnesota hospitals, where nearly one-fifth of the time patients spent in psychiatric units occurred after they were stabilized and ready to be discharged.\n\n\"Just like doctors use scientific evidence to determine the safest, most effective treatments,\" insurers do the same to cover treatment \"consistent with guidelines showing when and where it's effective for patients,\" Donaldson says.\n\nHealth plans commonly apply several controls that limit their coverage of mental health care. And these strategies by insurers are legal — unless they are applied more strictly for mental health care than medical care.\n\nFor example, they often require patients to try cheaper options first, a strategy called \"fail first.\" Patients referred by their doctors to a residential program for opioid addiction, for example, might be denied coverage by their insurers until they try — and fail — to improve at a less expensive part-time out-patient program.\n\nHiring doctors, nurses and pharmacists to review claims is another technique.\n\nDr. Frederick Villars, who reviews mental health claims for Aetna, remembers arguing with insurers to approve treatment when he was a practicing psychiatrist. His team decides what Aetna will cover based on clinical standards, he says. And providers upset about a coverage decision \"are well aware of what these guidelines are.\"\n\n\"It's not a pleasant process,\" Villars says, \"but it's the only tool that exists in this setting to try to keep costs under control.\"\n\nKaiser Health News is a nonprofit, editorially independent program of the Kaiser Family Foundation. It is not affiliated with Kaiser Permanente. Graison Dangor is a journalist living in Brooklyn.", "description": "The Affordable Care Act and other U.S. laws sought to put insurance coverage for mental health conditions on equal footing with coverage for physical conditions. But patients say that's not happening.", "authors": ["Graison Dangor"], "top_image": "https://media.npr.org/assets/img/2019/06/06/gettyimages-515791745_wide-5c9e334a23e0740cd82c96f47c51819670e59290.jpg?s=1400", "published_at": "2019-06-07"}