{"pub": "time", "url": "https://time.com/5703025/hong-kong-legislative-council-carrie-lam-protest", "downloaded_at": "2019-10-17 08:05:57.162754+00:00", "title": "Chaos Returns to Hong Kong's Legislature", "language": "en", "text": "Hong Kong’s new legislative season continued its disastrous start Thursday after the city’s top official was prevented from carrying out a question-and-answer session on her policies for the coming year. Several pro-democracy lawmakers were ejected from the proceedings for unruly conduct and the session, which had to be suspended twice, eventually broke up in disarray.\n\nThe chaotic scenes were a repeat of yesterday’s fiasco, when Chief Executive Carrie Lam was unable to give her annual policy address in the chamber and was instead forced to flee, under a torrent of abuse, to deliver the speech by video two hours later.\n\nThe latest curtailed meeting is only the second to be held in the chamber since it underwent a $5 million renovation after anti-government protesters ransacked it in July, and augurs poorly for Hong Kong, where a fledgling movement for full democracy is pitted against an unrepresentative, Beijing-backed government headed by Lam.\n\nThe chief executive was swamped in verbal abuse from the opening of the session. “Don’t be our chief executive—go be the leader of China,” shouted the chairman of the main opposition Democratic Party, Wu Chi-wai, as he was being dragged out of the meeting. “Leave! The earlier the better! You talk trash and you are very unwelcome here!”\n\nLegislator Claudia Mo yelled “Carrie Lam is a liar!” before being escorted out. Several of her colleagues followed. Many wore black t-shirts that read “Five demands, not one less”—a slogan of the Hong Kong protests. Others held up placards with images of Carrie Lam with bloodied hands, conveying their anger at her refusal to hold an independent inquiry into alleged police brutality.\n\nLam, who was only able to take questions from three pro-government lawmakers before the meeting broke up, appealed across the divide.\n\n“Despite the chaos going on in society, despite the dissatisfaction towards the government, we will still work hard to restore the normal operations of society,” she said. “I hope all lawmakers can let the government operate normally.”\n\nBut she also repeated her refusal to take any initiative contrary to the “One Country, Two Systems” formula by which Hong Kong is governed, whereby the enclave is promised a high degree of autonomy in exchange for acknowledging Beijing’s sovereignty. Her stance underscores the difficulty of reaching a political compromise in the former British colony, where calls for self-determination have grown during five months of unrest.\n\nMeanwhile, Hong Kong is braced for another weekend of unrest, with a march called for Sunday to the West Kowloon rail terminus. The facility is seen as a symbol of Beijing’s presence in Hong Kong because it connects travelers to the mainland Chinese high-speed rail network and because mainland Chinese customs and immigration laws apply in parts of the complex, to the dismay of many Hongkongers.\n\nJimmy Sham, a leader of march organizer Civil Human Rights Front, was hospitalized in a stable condition Wednesday evening after being attacked by several men wielding hammers, local media reported. It is the second time he has been attacked in two months.\n\n—With reporting by Hillary Leung / Hong Kong\n\nContact us at editors@time.com.", "description": "Chaotic scenes broke out again Thursday after Hong Kong's top official was prevented from carrying out a question-and-answer session.", "authors": ["Time Staff"], "top_image": "https://timedotcom.files.wordpress.com/2019/10/gettyimages-1176305293.jpg?quality=85&w=1200&h=628&crop=1", "published_at": "2019-10-17"}