{"pub": "metro", "url": "https://metro.co.uk/2019/10/15/kevin-de-bruyne-recovers-groin-injury-returns-manchester-city-training-10923291", "downloaded_at": "2019-10-15 15:09:13.273499+00:00", "title": "Kevin de Bruyne injury latest as Man City star returns to training", "language": "en", "text": "Kevin de Bruyne is back in training for Manchester City (Picture: Getty Images)\n\nKevin de Bruyne looks set to return to the Manchester City side this weekend after recovering from a groin strain.\n\nThe Belgian midfielder missed City’s last two games with the injury but was pictured back in training on Monday and should be ready and available for the trip to Crystal Palace on Sunday.\n\nThe Premier League champions posted a range of images from their training session on Monday, which also featured Sergio Aguero and John Stones.\n\nAguero did not feature for Argentina over the international break, with Argentina manager Lionel Scaloni saying: ‘Sergio Aguero is not here because he’s been carrying a problem and has not been training 100 per cent with his club,’\n\nThe striker started City’s last game, the shock defeat at home to Wolves on 6 October, and appears to be available again this weekend.\n\nAdvertisement\n\nAdvertisement\n\nStones has been out of action since the 3-2 defeat to Norwich on 14 September with a thigh problem and his return to training will be welcome news for Pep Guardiola who has been short of centre-backs.\n\nAymeric Laporte is out until 2020 with a knee injury, which has left Guardiola with a lack of central defenders, leading to Nicolas Otamendi and Fernandinho filling the void.\n\nWhether Stones is ready to return at Selhurst Park is yet to be confirmed, but he is nearing a place in the first team squad, having returned to training.\n\nDe Bruyne’s return fits with the time line predicted by Guardiola when he picked up the injury, with the Spaniard saying after City’s win over Dynamo Zagreb on 1 October: ‘It’s not serious but today he could not play.\n\n‘We will see for Sunday. Right now, I don’t know. Maybe he can get fit. We will see. After the international break he will be ready.’\n\nThe Belgian has been in superb form this season, scoring twice and providing eight assists in the Premier League – four more than any other player.\n\nMORE: Liverpool’s Trent Alexander-Arnold welcomes Kevin de Bruyne comparison and eyes midfield role\n\nMORE: Pep Guardiola provides Kevin De Bruyne fitness update ahead of Manchester City vs Wolves", "description": "Kevin de Bruyne looks set to return to the Manchester City side this weekend after recovering from a groin strain. The Belgian midfielder missed City's last two games with the...", "authors": ["Metro Sport Reporter"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_80619729_1571147953.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-15"}