{"pub": "foxnews", "url": "https://foxbusiness.com/money/heres-how-much-you-should-have-in-your-401k-to-reach-retirement-goals", "downloaded_at": "2019-10-01 09:26:35.082300+00:00", "title": "Here’s how much you should have in your 401k to reach retirement goals", "language": "en", "text": "Save now so you can spend later.\n\nContinue Reading Below\n\nThat’s the simple money advice that’s easier said than done for most Americans when it comes to saving for retirement.\n\nHalf of adults between 18 and 34 have not saved any money for retirement, according to a new report from Morning Consult. Just 39 percent of adults surveyed who are saving started in their 20s; nearly a quarter began saving in their 30s; 15 percent in their 40s and 6 percent in their 50s, the findings show.\n\nProlonging retirement savings means having to work later in life as many Americans become increasingly saddled with debt. The median total of debt for households headed by someone 65 or older in 2016 was $31,300 – that’s 2 ½ times higher than it was in 2001.\n\nFor those just starting to save at age 25 or before 30, Los Angeles-based certified financial planner David Rae says to follow the 10 percent rule, allocating at least 10 percent of your salary to your 401(k).\n\n“Contributing 10 percent to a 401(k) in your mid 20s can cut the risk of running out of money in retirement by around 30 percent,” Rae said, explaining: “There’s a little breathing room for some who started saving late, or are paying down debt. You do want to focus on getting your student loans and credit card debt under control, but it’s still important to try and really do that 10 percent number even if you have to include your employee match to get there,” Rae told FOX Business.\n\nHow to save\n\nYou don’t want to put retirement money into a regular savings account. It should be invested in a tax-advantaged retirement plan like a 401(k) or Roth IRA, Rae advises.\n\nTo start, if your employer has a sponsored 401(k) plan, take advantage of it as soon as possible. They may offer a match, which means they’ll contribute that same amount you do up to a certain dollar amount. If your company offers a 5 percent match for example, and you put in 5 percent of your salary, that totals 10 percent of your income that goes into the tax-advantaged account. Rae says employees should strive to save 10 percent of their own income even if they get a company match. (You can invest up to $19,000 into your 401K account per year).\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\n“You doubled your money overnight, and you don’t owe any taxes,” Rae said.\n\nIf your employer doesn’t offer a 401(k) plan, Rae says to set up a Roth IRA and put in a certain amount of money each month automatically so you don’t have to think about it.\n\nRae says employees should strive to save at least 15 percent of their income towards retirement in their 40s, and 20 percent at 50 to stay on track.\n\n“Hopefully by then your career is advancing, you’re getting a raise or you’re saving more each year. Assuming you want to retire at 67 or 68, ideally you have around 17x your salary so you don’t have to cut back,\" Rae said.\n\nFull retirement age varies from 65 to 67, depending on your year of birth. The earliest a person can start receiving Social Security retirement benefits is age 62. The full retirement age currently is 66 for those born between 1943 and 1954.\n\n“Even if you’re struggling [to save] start tiny. Even if you put in 1 percent and increase it every few months, you won’t even notice the money, and you’re building the habit of saving,” Rae said.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "How much money you should have saved now to stay on track for retirement.", "authors": ["Jeanette Settembre"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/05/0/0/Retirement-Feature.jpg?ve=1&tl=1", "published_at": "2019-09-06"}