{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/24/WS5db1127aa310cf3e3557248e.html", "downloaded_at": "2019-10-24 04:30:01.563017+00:00", "title": "Typhoon-battered Japan braces for more heavy downpours", "language": "en", "text": "Xinhua | Updated: 2019-10-24 10:54\n\nApples are floating on a puddle triggered by Typhoon Hagibis in Nagano, Japan on Oct 22, 2019. [Photo/IC]\n\nTOKYO - Heavy rain is once again expected to pound Japan, with areas still recovering from extensive flooding brought by Typhoon Hagibis earlier this month likely to be hit again, the weather agency here said Thursday.\n\nThe agency said that as a result of a low pressure system, torrential rain is expected to lash both western and eastern regions of the country through Friday.\n\nWith rainfall during the 24 hours through Friday morning possibly reaching as much as 300 mm in the Shikoku region in western Japan and 250 mm in the Tokai region, the Japan Meteorological Agency (JMA) warned of flooding.\n\nAs for the Kanto region, which includes Tokyo, the agency said up to 200-mm rain is forecast over the 24 hours through Saturday morning, and the northeastern prefecture of Tohoku is expected to receive up to 150-mm rain.\n\nAreas including hard-hit northeastern regions, where more than half of the over 80 typhoon-related deaths occurred, that are still recovering in the wake of Typhoon Hagibis, the most powerful typhoon to strike Japan in decades, have been warned of further flooding and landslides, the JMA said.\n\nThe government has said the damage caused to the agricultural sector alone by Typhoon Hagibis, spanning farming, forestry and fisheries industries, has surpassed 87 billion yen.\n\nThousands remain in evacuation centers and some homes are still without running water. Ongoing recovery and restoration efforts could be severely hampered by the fresh downpours forecast through Friday, local officials said.\n\nPotentially adding more turmoil to typhoon-battered Japan, the weather agency has also warned of another typhoon that could approach the archipelago bringing strong winds and downpours.\n\nThe weather agency advised people to be on alert for violent gusts of winds and wave surges that could reach as high as 10 meters.", "description": "Heavy rain is once again expected to pound Japan, with areas still recovering from extensive flooding brought by Typhoon Hagibis earlier this month likely to be hit again, the weather agency here said Thursday.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/24/5db1127aa310cf3e97a2b792.jpeg", "published_at": "2019-10-24"}