{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/30/WS5db937f2a310cf3e3557479f.html", "downloaded_at": "2019-10-30 07:54:29.357825+00:00", "title": "University of Rochester to recruit more Chinese students", "language": "en", "text": "By Zhong Nan | chinadaily.com.cn | Updated: 2019-10-30 15:12\n\nProfessor Huang Yufeng leads a marketing analytics class at the Simon Business School, a part of the University of Rochester in New York state, in October 2017. [Photo provided to chinadaily.com.cn]\n\nAs the flame of \"going global\" and the entrepreneurial spirit burn bright in China, Simon Business School, a part of the University of Rochester in New York state, plans to recruit more Chinese students to enrich their international experiences via specialized degree courses.\n\nMany opportunities come from Chinese companies' fast pace in developing global markets via diversified investment and trade activities, international industrial capacity cooperation and the tangible growth of the Belt and Road Initiative, said Andrew Ainslie, dean of the Simon Business School.\n\nAs a top five school for economics and finance in the United States, the school offers both master's degrees and MBA programs to students throughout the world. Chinese and Indian citizens are among the international students pursuing these programs.\n\n\"In comparison with other business schools, we have something called STEM designation,\" Ainslie said. \"If a program is STEM (Science, Technology, Engineering and Mathematics) designated, that means the students on their Optional Practical Training, or OPT, at the end of the student's visa, instead of having one-year OPT in the US, they get three-year OPT. That's really helpful for foreign students to gain more work experience.\"\n\nThere are many more options. The companies love it, because they know now they can recruit a foreign student for three years instead of one year, said Ainslie, who also is a marketing professor.\n\nThe school recently gave a STEM designation to every single degree and specialization. So people go into consulting, marketing, finance and accounting, he added.\n\nThough the China-US trade dispute has led to a decline in student applications to US universities overall, Ainslie stressed that the school has been working hard to help candidates through the visa process,\n\n\"I don't think it is going to be there for the long term, I think this is short term,\" he said.\n\nAccording to a survey in May by Vision Overseas Consulting Co, a subsidiary of New Oriental Education and Technology Group, and Kantar Millward Brown of 6,228 students who planned to study overseas or returned to China after studying abroad, about 6 percent had work experience, up from 4 percent a year ago.\n\nAbout half of these students wanted to pick up advanced knowledge from abroad and 44 percent wanted to have better employment prospects.\n\n\"An overseas education experience makes job candidates more independent and equips them with a global mindset and communication skills important for future career and promotion opportunities,\" said Zhang Yuxin, a professor at Shanghai Normal University.", "description": "As the flame of \"going global\" and the entrepreneurial spirit burn bright in China, Simon Business School, a part of the University of Rochester in New York state, plans to recruit more Chinese students to enrich their international experiences via specialized degree courses.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/30/5db937f2a310cf3e97a38f45.jpeg", "published_at": "2019-10-30"}