{"pub": "independent", "url": "https://independent.co.uk/sport/live/south-africa-vs-italy-live-stream-rugby-world-cup-2019-rwc-latest-score-updates-watch-online-tv-a9142656.html", "downloaded_at": "2019-10-04 09:17:30.902044+00:00", "title": "Rugby World Cup 2019, South Africa vs Italy LIVE: Latest score and updates", "language": "en", "text": "Follow the latest updates live from the Pool B shootout at the Rugby World Cup between South Africa and Italy.\n\nThe Springboks’ hopes of reaching the quarter-finals are on the line following their tournament-opening defeat against New Zealand, who look to be on course to clinch top spot.\n\nBut it’s currently Italy who lead the way in the pool with 10 points from an available 10, following impressive wins over Canada and Namibia, and Conor O’Shea’s side will be harbouring hopes of repeating their upset victory over South Africa three years ago that would be enough to send them into quarter-finals for the first time in their history. Follow the live action below.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nRugby World Cup latest news South Africa vs Italy starts at 10:45am BST\n\nSpringboks likely to crash out if they suffer defeat\n\nItaly currently top Pool B but face Springboks and All Blacks back-to-back\n\nThe Springboks lost Jesse Kriel this week to a tournament-ending injury, with Saracens' World Cup joker Damian Willemse called up in his stead. This seems an odd move - Kriel is a centre, while Willemse is a player best suited to full-back, where South Africa have plenty of cover. Willemse is an electric runner with ball in hand and was raised a fly-half, so provides versatility, but it seems peculiar that Rassie Erasmus has opted not to call in a specialist centre. And there could be yet more bother for the South African squad... Team News - Italy Italy have, in essence, had two more warm-up fixtures, with neither Canada nor Namibia providing truly stiff opposition. Twice they have threatened 50 points with two differently constructed sides, leaving Conor O'Shea in the rather rare position of having legitimate selection decisions to be made. And make them he has. Jake Polledri was simply superb against Canada and continues in the back row, with Sergio Parisse coming back in. Tito Tebaldi is selected ahead of Callum Braley at scrum-half, while Luca Morisi starts at outside centre, pushing the electric and eclectic Michele Campagnaro to the left wing. Jayden Hayward starts a second successive game at inside centre. Team News - South Africa Back come the South African big guns after the Springboks rested the majority of their stars for the win over Namibia, making just three changes to the team that lost to New Zealand. Lood de Jager was exceptional against Namibia and gets the nod in the second row, and there are two alterations from that All Blacks clash ahead of him - Tendai Mtawarira starts at loosehead, while Bongi Mbonambi retains his place after a two-try performance last time out. We are now more than halfway through the Rugby World Cup pool stages, and teams are beginning to clarify their contendership. England are two-from-two and looking good, Wales have beaten Australia and appear ready to mount a serious title tilt, and Italy lead Pool B from New Zealand and South Africa. Wait, what? Yes, by virtue of two bonus point victories to open their tournament, Italy do indeed lead the pool, but that may well change this morning. It is South Africa against Italy in Fukuoka, and kick-off is an hour away... Advertisement Welcome to The Independent's live coverage of today's Rugby World Cup action, with South Africa and Italy set to meet in Pool B in a crucial match that will decide who is heading for the quarter-finals and who heads for the exit. After losing their opening match against the All Blacks, South Africa know they cannot afford a second defeat of the pool stage. But while they would normally expect to beat Italy quite comfortably, Conor O'Shea's side have taken a maximum 10 points from their opening two games to sit at the top of the pool. The match is due to kick off at 10:45am BST [6:45pm Japan Standard Time].\n\nWhen is it?\n\nSouth Africa vs Italy takes place on Friday 4 October at the Shizuoka Stadium Ecopa.\n\nWhen does it start?\n\nThe match kicks off at 6:45pm Japan Standard Time, which is 10:45am BST.\n\nWhere can I watch it?\n\nLive coverage of the match will be shown on ITV 4 and the ITV Hub from 10:15am BST.\n\nTeams\n\nSouth Africa: Le Roux; Kolbe, Am, De Allende, Mapimpi; Pollard, De Klerk; Mtawarira, Mbonambi, Malherbe; Etzebeth, De Jager; Kolisi, Du Toit, Vermeulen.\n\nReplacements: Marx, Kitschoff, Koch, Snyman, Mostert, Louw, Jantjies, Steyn.\n\nItaly: Minozzi; Benvenuti, Morisi, Hayward, Campagnaro; Allan, Tebaldi; Lovotti, Bigi, Ferrari; Sisi, Budd; Steyn, Polledri, Parisse.\n\nReplacements: Zani, Quaglio, Riccioni, Zanni, Ruzza, Negro, Braley, Canna.\n\nOdds\n\nSouth Africa to win: 1/25\n\nItaly to win: 25/1\n\nDraw: 80/1\n\nPrediction\n\nSouth Africa 35-10 Italy: Springboks boss Rassie Erasmus has made a few changes from what is normally considered his strongest line-up, but they should still be too powerful for Italy to take anything out of the game. That said, Italy have had plenty of time to prepare for the match, and could benefit from having faced the two easier teams in the pool already.", "description": "Follow the latest updates live from the Pool B shootout at the Rugby World Cup between South Africa and Italy. The Springboks’ hopes of reaching the quarter-finals are on the line following their tournament-opening defeat against New Zealand, who look to be on course to clinch top spot.", "authors": ["Harry Latham-Coyle", "Jack De Menezes"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/04/08/south-africa.jpg", "published_at": "2019-10-04"}