{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/ap/article-7569459/49ers-remain-unbeaten-20-7-win-slumping-Rams.html", "downloaded_at": "2019-10-14 00:03:23.108661+00:00", "title": "49ers remain unbeaten with 20-7 win over slumping Rams", "language": "en", "text": "LOS ANGELES (AP) - Jimmy Garoppolo passed for 243 yards and ran for a touchdown, and the San Francisco 49ers remained unbeaten with a dominant defensive performance in a 20-7 victory over the struggling Los Angeles Rams on Sunday.\n\nGeorge Kittle had eight catches for 103 yards for the Niners (5-0), who held Los Angeles' once-unstoppable offense to 165 yards in coach Kyle Shanahan's first victory over Rams coach Sean McVay in a game in which both of these NFC West rivals were playing their starters.\n\nThese longtime coaching colleagues' teams are going in opposite directions after this one-sided showdown at the Coliseum. San Francisco used its possession offense and a sturdy defense to stay alongside New England as the NFL's only unbeaten teams, while the Rams (3-3) are on their first three-game losing streak of McVay's 2½-year tenure.\n\nTevin Coleman rushed for an early touchdown for San Francisco, while Garoppolo was mostly effective despite two turnovers. The Niners didn't score a touchdown in the final 27 minutes, but they're off to their fourth 5-0 start in franchise history, and their first since 1990.\n\nWith Todd Gurley sitting out to rest his bruised thigh, Los Angeles couldn't move the ball in its least productive performance of McVay's tenure. Robert Woods rushed for a touchdown on the opening drive for the Rams, who then managed 48 net yards on their next eight drives combined.\n\nSan Francisco won a defense-dominated game by thoroughly throttling the defending NFC champions' once-impressive passing game. Jared Goff went 13 of 24 for a career-low 78 yards while failing to get comfortable behind a porous offensive line, and the Rams didn't manage a completion longer than 12 yards while going 0 for 9 on third down.\n\nSan Francisco 49ers running back Tevin Coleman (26) runs around Los Angeles Rams strong safety John Johnson (43) to score a touchdown during the first half of an NFL football game Sunday, Oct. 13, 2019, in Los Angeles. (AP Photo/John Locher )\n\nThe Niners' offense wasn't significantly better during a first half in which both teams turned the ball over at the opponents' 1, but San Francisco capitalized on Rams rookie Darrell Henderson's fumble on the opening snap of the second half for a short go-ahead TD drive capped by Garoppolo's sneak.\n\nSan Francisco then took control, moving the ball deliberately and thoroughly shutting down the Rams. The Niners led 20-7 when Garoppolo's fumble was returned to the San Francisco 36 with 8:40 to play, but the Rams promptly turned it over on downs.\n\nEverything looked fine for the Rams while McVay called seven consecutive runs on their opening drive. Malcolm Brown, the longtime backup grabbing a starring role with Gurley out, racked up 40 yards on five carries before Woods scored on a beautifully designed end-around.\n\nIt was the Rams' first touchdown in a first quarter since last Dec. 30, and it was the first rushing touchdown allowed by the 49ers this season.\n\nIt was also the only real highlight of the Rams' miserable day.\n\nSan Francisco answered with Coleman's TD run capping a 75-yard drive prolonged by a third-down penalty on Los Angeles. The Niners drove to the Rams 1 again, but Garoppolo's atrocious throw at the goal line was easily intercepted by Marcus Peters.\n\nLos Angeles then reached the Niners 1 on third down, but ran two straight running plays up the middle for no gain.\n\nHenderson, a third-round pick with one career carry before this game, had two impressive runs in the first half - but he dropped a pitchout from Goff on the opening play of the second half, and Arik Armstead recovered at the Rams 17. San Francisco easily scored on the short field.\n\nThe Niners again drove to the Los Angeles 2, but Garoppolo overthrew a wide-open Coleman on third down.\n\nINJURIES\n\n49ers: They played without both of their starting offensive tackles, Mike McGlinchey and Joe Staley.\n\nRams: LG Joe Noteboom was taken to the locker room on a cart during the first quarter after he injured his right knee. The second-year pro didn't return. ... S John Johnson was ruled out with an injured shoulder in the second half. ... Gurley missed his first game of the season, as did LB Clay Matthews, their sacks leader. CB Aqib Talib sat out with bruised ribs.\n\nUP NEXT\n\n49ers: Visit the Washington Redskins on Sunday.\n\nRams: Visit the Atlanta Falcons on Sunday.\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nLos Angeles Rams wide receiver Robert Woods (17) score a a touchdown against the San Francisco 49ers during the first half of an NFL football game Sunday, Oct. 13, 2019, in Los Angeles. (AP Photo/Alex Gallardo)\n\nSan Francisco 49ers quarterback Jimmy Garoppolo throws against the Los Angeles Rams during the first half of an NFL football game Sunday, Oct. 13, 2019, in Los Angeles. (AP Photo/Alex Gallardo)\n\nSan Francisco 49ers quarterback Jimmy Garoppolo (10) throws to running back Matt Breida (22) as Los Angeles Rams outside linebacker Samson Ebukam (50) defends during the first half of an NFL football game Sunday, Oct. 13, 2019, in Los Angeles. (AP Photo/Alex Gallardo)\n\nSan Francisco 49ers tight end George Kittle (85) stiff-arms Los Angeles Rams cornerback Marcus Peters (22) during the first half of an NFL football game Sunday, Oct. 13, 2019, in Los Angeles. (AP Photo/Alex Gallardo)", "description": "LOS ANGELES (AP) - Jimmy Garoppolo passed for 243 yards and ran for a touchdown, and the San Francisco 49ers remained unbeaten with a dominant defensive...", "authors": ["Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/00/wire-19670950-1571009931-229_636x382.jpg", "published_at": "2019-10-13"}