{"pub": "independent", "title": "Serena Williams facing injury concern ahead of US Open quarter-final", "url": "https://independent.co.uk/sport/tennis/serena-williams-us-open-quarter-final-latest-injury-update-a9088416.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:05:50.844643+00:00", "text": "Serena Williams charged into the US Open quarter-finals on Sunday but it may have come at a price as the six-times champion suffered a right ankle injury.\n\nWilliams, who twisted her left ankle during a quarter-final loss at the Australian Open, said she did not think the latest injury serious but added it was too soon to tell.\n\n“I usually know if it’s horrible early on. I mean, I had a really bad ankle sprain in January. I was like, instantly, ‘No, this can’t happen. I’m finally healthy,’” Williams said after her 6-3 6-4 win over Petra Martic.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“But I’ll see tomorrow. So far I’m good. I have been managing it. We’ll see tomorrow.”\n\nWilliams rolled her ankle in the fifth game of the second set, having raced to the net and landed hard on her right foot after a backhand volley that sailed long.\n\nShape Created with Sketch. US Open 2019 - best pictures Show all 25 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. US Open 2019 - best pictures 1/25 Day one A plane comes in over the New York City skyline as seen from the Arthur Ashe Stadium AFP/Getty Images 2/25 Day one The opening ceremony before the match of Serena Williams of the US against Maria Sharapova from Russia AFP/Getty Images 3/25 Day one Maria Sharapova of Russia returns the ball to Serena Williams AFP/Getty Images 4/25 Day one Roger Federer of Switzerland throws balls to members of the public after defeating Sumit Nagal AFP/Getty Images 5/25 Day two Garbine Muguruza of Spain hits a return against Alison Riske AFP/Getty Images 6/25 Day two Garbine Muguruza of Spain serves against Alison Riske AFP/Getty Images 7/25 Day two Dominic Thiem of Austria against Thomas Fabbiano of Italy AFP/Getty Images 8/25 Day three Novak Djokovic of Serbia receives treatment between games against Juan Ignacio Londero of Argentina AFP/Getty Images 9/25 Day three Novak Djokovic of Serbia celebrates after defeating Juan Ignacio Londero AFP/Getty Images 10/25 Day three Serena Williams of the US celebrates her wictory against Caty McNally AFP/Getty Images 11/25 Day three Roger Federer of Switzerland celebrates after defeating Damir Dzumhur of Bosnia and Herzegovina AFP/Getty Images 12/25 Day four Taylor Townsend of the US reacts after winning against Simona Halep AFP/Getty Images 13/25 Day four Coco Gauff of the US reacts to winning her match against Timea Babos of Hungary AFP/Getty Images 14/25 Day four Alexander Zverev of Germany celebrates after defeating Frances Tiafoe of the US AFP/Getty Images 15/25 Day six Naomi Osaka of Japan consoles Coco Gauff EPA 16/25 Day six Naomi Osaka of Japan consoles Coco Gauff USA TODAY Sports 17/25 Day six Rafael Nadal of Spain serves against Hyeon Chung of Korea USA TODAY Sports 18/25 Day six Rafael Nadal from Spain serves to Hyeon Chung from Korea AFP/Getty Images 19/25 Day six Hyeon Chung of South Korea hits a return to Rafael Nadal of Spain EPA 20/25 Day six Gael Monfils of France celebrates after his match against Denis Shapovalov of Canada USA TODAY Sports 21/25 Day six Nick Kyrgios of Australia reacts vs Andrey Rublev EPA 22/25 Day six Andrey Rublev of Russia celebrates winning his Men's Singles third round match against Nick Kyrgios of Australia Getty Images 23/25 Day seven Novak Djokovic retired from his US Open clash with Stanislas Wawrinka due to a left shoulder injury AFP/Getty 24/25 Day seven Roger Federer made light work of David Goffin Reuters 25/25 Day seven Johanna Konta celebrates beating Karolina Pliskova on her way to the quarter-finals Getty Images 1/25 Day one A plane comes in over the New York City skyline as seen from the Arthur Ashe Stadium AFP/Getty Images 2/25 Day one The opening ceremony before the match of Serena Williams of the US against Maria Sharapova from Russia AFP/Getty Images 3/25 Day one Maria Sharapova of Russia returns the ball to Serena Williams AFP/Getty Images 4/25 Day one Roger Federer of Switzerland throws balls to members of the public after defeating Sumit Nagal AFP/Getty Images 5/25 Day two Garbine Muguruza of Spain hits a return against Alison Riske AFP/Getty Images 6/25 Day two Garbine Muguruza of Spain serves against Alison Riske AFP/Getty Images 7/25 Day two Dominic Thiem of Austria against Thomas Fabbiano of Italy AFP/Getty Images 8/25 Day three Novak Djokovic of Serbia receives treatment between games against Juan Ignacio Londero of Argentina AFP/Getty Images 9/25 Day three Novak Djokovic of Serbia celebrates after defeating Juan Ignacio Londero AFP/Getty Images 10/25 Day three Serena Williams of the US celebrates her wictory against Caty McNally AFP/Getty Images 11/25 Day three Roger Federer of Switzerland celebrates after defeating Damir Dzumhur of Bosnia and Herzegovina AFP/Getty Images 12/25 Day four Taylor Townsend of the US reacts after winning against Simona Halep AFP/Getty Images 13/25 Day four Coco Gauff of the US reacts to winning her match against Timea Babos of Hungary AFP/Getty Images 14/25 Day four Alexander Zverev of Germany celebrates after defeating Frances Tiafoe of the US AFP/Getty Images 15/25 Day six Naomi Osaka of Japan consoles Coco Gauff EPA 16/25 Day six Naomi Osaka of Japan consoles Coco Gauff USA TODAY Sports 17/25 Day six Rafael Nadal of Spain serves against Hyeon Chung of Korea USA TODAY Sports 18/25 Day six Rafael Nadal from Spain serves to Hyeon Chung from Korea AFP/Getty Images 19/25 Day six Hyeon Chung of South Korea hits a return to Rafael Nadal of Spain EPA 20/25 Day six Gael Monfils of France celebrates after his match against Denis Shapovalov of Canada USA TODAY Sports 21/25 Day six Nick Kyrgios of Australia reacts vs Andrey Rublev EPA 22/25 Day six Andrey Rublev of Russia celebrates winning his Men's Singles third round match against Nick Kyrgios of Australia Getty Images 23/25 Day seven Novak Djokovic retired from his US Open clash with Stanislas Wawrinka due to a left shoulder injury AFP/Getty 24/25 Day seven Roger Federer made light work of David Goffin Reuters 25/25 Day seven Johanna Konta celebrates beating Karolina Pliskova on her way to the quarter-finals Getty Images\n\nSeeded eighth, Williams took about 15 seconds to get to her feet but won the next two points to earn a crucial break for a 3-2 lead and then took a medical timeout so a trainer could look at her already-wrapped ankle.\n\nHer coach, Patrick Mouratoglou, later told reporters that Williams was not in too much discomfort.\n\n“It doesn’t seem -- there is the video, but what is more important is how she feels and how the ankle looks. The ankle looks okay,” said Mouratoglou.\n\n“She doesn’t feel much pain. She feels, but it’s acceptable. And we will know tomorrow when it’s going to be cold.”\n\nWilliams, who is seeking a record-tying 24th Grand Slam title and her first since the 2017 Australian Open, will face China’s Wang Qiang in the quarter-finals.\n\nReuters", "description": "Serena Williams charged into the US Open quarter-finals on Sunday but it may have come at a price as the six-times champion suffered a right ankle injury. Williams, who twisted her left ankle during a quarter-final loss at the Australian Open, said she did not think the latest injury serious but added it was too soon to tell.", "authors": ["Sports Staff"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/02/10/serena-williams.jpg"}