{"pub": "yahoo", "url": "https://news.yahoo.com/brexit-vote-commons-could-delayed-155700425.html", "downloaded_at": "2019-10-20 06:55:07.445319+00:00", "title": "Brexit vote in Commons could be delayed in extraordinary move by MPs to prevent risk of no-deal", "language": "en", "text": "Saturday’s vote to decide Brexit is set to be delayed, after an extraordinary procedural move by MPs who fear the UK could still crash out of the EU without a deal.\n\nAn amendment to Boris Johnson’s motion – intended to be the ‘meaningful vote’ he craves – would withhold approval until the full legislation to implements the deal is put into law.\n\nBut the practical impact of the amendment passing would be to render the vote essentially meaningless, making it likely it would be pulled together.\n\nThe respected Institute for Government said MPs would only have “considered the matter” and not approved the deal.\n\nWith Labour expected to back the amendment, tabled by exiled Tory Oliver Letwin, it seems almost certain to pass if selected by John Bercow on Saturday morning.\n\nThe drama came as the result of the vote – if it is held – remained on a knife-edge, with No 10 buoyed by winning over some Labour rebels while whittling down opposition in its own ranks.\n\nThe amendment has been tabled to close a loophole in the Benn Act, designed to ensure Mr Johnson must seek to delay Brexit if a deal has not been approved by 11pm on Saturday.\n\nAs it stands, it would allow the prime minister to escape the commitment if the vote passed tomorrow, even though a full bill is also needed – leaving open the risk of a crash-out on 31 October, if it failed to pass.\n\n\n\n\n\nMore follows…\n\n\n\n\n\nRead more\n\nHardline Tories back Brexit deal 'to pave way for no-deal next year'", "description": "Saturday’s vote to decide Brexit is set to be delayed, after an extraordinary procedural move by MPs who fear the UK could still crash out of the EU without a deal.An amendment to Boris Johnson’s motion – intended to be the ‘meaningful vote’ he craves – would withhold approval until the full legislation", "authors": ["Rob Merrick"], "top_image": "https://s.yimg.com/uu/api/res/1.2/frGZy5SuU3w97tEEraRnPg--~B/aD0zOTU7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/73d8aebb6e8eb62fbd58bdb39ea760cc", "published_at": "2019-10-18"}