{"pub": "yahoo", "url": "https://sports.yahoo.com/keita-time-reach-best-form-074133826.html", "downloaded_at": "2019-09-26 23:51:56.188901+00:00", "title": "Keita will take time to reach best form for Liverpool, Klopp warns", "language": "en", "text": "Jurgen Klopp urged patience with Naby Keita after the Liverpool midfielder made his return to action during Wednesday's 2-0 EFL Cup win over MK Dons.\n\nThe Guinea international has been sidelined with a muscular problem since early August, meaning his only previous appearance this season came in the Community Shield meeting with Manchester City.\n\nJames Milner and teenage defender Ki-Jana Hoever got the goals and youngster Harvey Elliott caught the eye in Liverpool's win at Stadium MK.\n\nScroll to continue with content Ad\n\nIt was sometimes heavier going for Keita during his 63 minutes on the field, but Klopp insisted that was to be expected.\n\n\"Obviously he looked good in moments, he looked really good in moments, but he has to adapt to the position again,\" he told reporters.\n\n\"You see it with Ox [Alex Oxlade-Chamberlain] as well. Naturally you move much more and stuff like this, you find each other much more, but that's how it is.\n\n\"He was out for a while, but in moments you saw what an incredible player he is and how important he will be for us.\n\n\"We don't have to rush it now hopefully, but we can use him now and that's good, good for us. There's a long season to go and everything will be fine.\"\n\nKeita's next opportunity to get some minutes under his belt comes on Saturday, when leaders Liverpool travel to Sheffield United in the Premier League.", "description": "Naby Keita completed 63 minutes in Liverpool's EFL Cup win at MK Dons – his first action since early August.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/V5Sbjt1dFYSLcaRAYYG8Ww--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/.EBI8HNh7vwxA4PXnGImUA--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-GB/homerun/omnisport.uk/957d6695108fcf81fa4cc38e885f9003", "published_at": "2019-09-26"}