{"pub": "foxnews", "url": "https://foxnews.com/us/tennessee-high-school-student-bullied-same-clothes-gifts-classmates", "downloaded_at": "2019-09-17 23:27:09.585357+00:00", "title": "Tennessee student bullied for wearing same clothes gets special gifts from classmates", "language": "en", "text": "A Tennessee high school student who reportedly was bullied for wearing the same clothes every day got a generous set of gifts from his classmates, as seen in a heartwarming video.\n\nMichael Todd, a high school freshman in Memphis, said his first three weeks at Martin Luther King Jr. College Preparatory High School were a nightmare because students mocked him for wearing the same clothes, as Fox 13 reported.\n\n\"I've been bullied my entire life,\" Todd said.\n\nHe added, \"I really don't have clothes at home. My mom can't buy clothes for me because I'm growing too fast.\"\n\nMAN DONATES KIDNEY TO STRANGER AFTER FINDING NOTE IN EBAY PACKAGE\n\nA video of high school football players Kristopher Graham and Antwan Garrett giving Todd his gifts in a school hallway last week went viral on social media. It showed the two MLK Prep students handing Todd a bag filled with shirts, shorts, shoes and other items.\n\n\"When I saw people laugh at him and bully him, I felt like I need to do something,\" Graham said.\n\nHe then reportedly went through his closet and texted Garrett, who told Graham he had brand-new shoes he could give Todd.\n\nMISSOURI MOTHER OF 6 FEEDS HUNGRY CHILDREN IN HER NEIGHBORHOOD, REPORT SAYS\n\n\"He wasn't smiling, and I was like, 'I think this is going to make you smile,'\" Graham said. \"I said, ‘We're in the same third period.' He was like, 'yeah.' I said, 'I apologize for laughing at you, and I want to give something to you to make it up.'\"\n\n\"I was very happy,\" Todd said describing the moment he received the gifts. \"I was shocked completely.\"\n\n\"Graham said, \"I almost cried when he told me, he was like, 'you two [are] the only two to actually ever give me a gift.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nPeople from different states who saw the viral video reportedly offered to send Todd clothes as well.\n\nTodd called the football players \"awesome,\" telling them, \"you guys are the best guys of my entire life.\"", "description": "A Tennessee high school student who reportedly was bullied for wearing the same clothes every day got a generous set of gifts from his classmates, as seen in a heartwarming video.", "authors": ["Talia Kaplan", "Talia Kaplan Is A Reporter For Foxnews.Com. Follow Her On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Student-gift.jpg", "published_at": "2019-09-17"}