{"pub": "fox", "url": "https://foxbusiness.com/industrials/top-uaw-aide-charged-with-conspiracy", "downloaded_at": "2019-09-20 22:39:08.243081+00:00", "title": "UAW aide charged with bribery as workers continue strike", "language": "en", "text": "As 46,000 members of the United Auto Workers union walked the picket line seeking higher pay on day five of the strike against General Motors, a former top aide to United Auto Workers Vice President Joe Ashton was charged by federal prosecutors with receiving $123,000 during a bribery and kickback conspiracy that defrauded union workers.\n\nJeff Pietrzyk, 74, of Grand Island, New York, is facing charges of conspiring with Ashton and former UAW leader Mike Grimes to receive millions in kickbacks and bribes from union vendors who received rigged contracts to produce union-branded watches, jackets and backpacks, according to the court filing.\n\nContinue Reading Below\n\nA UAW training center that is jointly operated and financed by UAW and GM awarded the contracts according to The Detroit News.\n\nProsecutors allege that Pietrzyk received more than $100,000 during the alleged conspiracy. He is the 11th person to be formally charged in a corruption scandal that has implicated the top levels of the UAW, including President Gary Jones and former President Dennis Williams.\n\nUnited Auto Workers President Gary Jones speaks during the opening of their contract talks with General Motors in Detroit on July 16, 2019.\n\nMany of the details included in the criminal case Friday were already known from Grimes’ investigation when he was charged by prosecutors with wire fraud conspiracy and money laundering in August.\n\nGrimes admitted receiving $1.5 million in bribes from union vendors and pled guilty to wire fraud conspiracy and money laundering on Sept. 4. He now awaits sentencing and faces more than four years in federal prison.\n\nAdvertisement\n\nPietrzyk was charged with wire fraud and money laundering conspiracies in a criminal information, which means a guilty plea is expected. Wire fraud conspiracy is punishable by up to 20 years in prison while money laundering conspiracy is a 10-year felony.\n\nPeter Henning, a Wayne State University law professor and former federal prosecutor, told The Detroit News that the criminal filing Friday appears designed to pressure Ashton into cooperating with federal investigators, who already have secured Grimes' conviction, and added “This is their game plan.”\n\nThe criminal filing accuses Pietrzyk of teaming with Grimes and a former UAW senior leader whom prosecutors identify as \"Union Official 1.\" That official - who is accused of demanding $550,000 in kickbacks and bribes from union vendors - is Ashton, four sources familiar with the investigation revealed to The Detroit News last month.\n\nProsecutors claim that the alleged conspiracy lasted over a decade, from 2006 until July 2018.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "Top UAW aide charged with bribery and kickback conspiracy", "authors": ["Jason Schott"], "top_image": "https://a57.foxnews.com/media.foxbusiness.com/BrightCove/854081161001/201909/2664/0/0/854081161001_6086785032001_6086783368001-vs.jpg?ve=1&tl=1", "published_at": "2019-09-20"}