{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7618569/Strictlys-Emma-Weymouth-reveals-sadness-children-NEVER-meeting-paternal-grandmother.html", "downloaded_at": "2019-10-28 00:35:57.277476+00:00", "title": "Strictly's Emma Weymouth reveals sadness over her children NEVER meeting their paternal grandmother", "language": "en", "text": "Viscountess Emma Weymouth has revealed her sadness over her children never meeting their paternal grandmother.\n\nThe Strictly Come Dancing star, 33, has two sons - John, five, and Henry, two - with husband Ceawlin Thynn, Viscount Weymouth, who is the heir of the 7th Marquess of Bath, Alexander Thynn, 87.\n\nCeawlin's mother, Anna Thynn, Marchioness of Bath, lives in France but still visits Longleat, where she lives in a flat upstairs - however she's never met her grandchildren.\n\nBoth she and her husband boycotted Emma and Ceawlin's wedding in 2013 because his son removed several of his lurid self-painted murals from the walls of Longleat House.\n\nIn 2015, Ceawlin claimed his mother said to him: 'Are you sure about what you're doing to 400 years of bloodline?' in reference to the colour of Emma's skin.\n\nViscountess Emma Weymouth has revealed her sadness over her children never meeting their paternal grandmother. The Strictly Come Dancing star, 33, has two sons - John, five, and Henry, two - with husband Ceawlin Thynn, Viscount Weymouth\n\nCeawlin's mother, Anna Thynn, Marchioness of Bath, lives in France but still visits Longleat, where she lives in a flat upstairs - however she's never met her grandchildren\n\nSpeaking to the Sunday Times Magazine, Emma 'sinks into the back of her chair and gives a tiny shrug' when asked if it made her sad that her children haven't met their paternal grandmother, and explained that 'all families have their complications'.\n\n'That's something that's not particularly news to us,' she went on. 'So I feel very grateful for the family we've made.'\n\nThe viscountess also admitted she 'probably should have had counselling' after experiencing 'a bleed on the brain' while pregnant with John, which resulted in her needing an emergency C-section and doctors battling to save her life.\n\nEmma had hypophysitis, which is an inflammation of the pituitary gland. Describing the ordeal as 'horrendous', Emma said she was 'very scared afterwards'.\n\nCeawlin's mother, Anna Thynn, Marchioness of Bath, pictured with her husband Alexander Thynn, 87, lives in France but still visits Longleat, where she lives in a flat upstairs - however she's never met her grandchildren\n\nThis week's Strictly Come Dancing Halloween special saw Emma and partner Aljaz Skorjanec reach fifth on the leaderboard with a score of 30 points\n\n'I got very, very frightened of everything,' she told the publication, adding that she does talk about it a lot, but never sought professional help - something she admits she 'should have'.\n\nIn order to have their second son Henry, the couple paid £60,000 to use a surrogate in America, as Emma said putting her own life at risk again to extend their family was 'not an option'.\n\nThis week's Strictly Come Dancing Halloween special saw Emma and partner Aljaz Skorjanec reach fifth on the leaderboard with a score of 30 points after performing a Charleston to A Little Party Never Killed Nobody by Fergie feat. Q-Tip and GoonRock.\n\nThe post came just days after Emma narrowly escaped the axe after ending up in the bottom two against Dev Griffin, 34, and his partner Dianne Buswell\n\nYesterday we told how a voting scandal hit Strictly Come Dancing after a boss at Emma Weymouth's stately home of Longleat told staff their votes for the Viscountess would be reimbursed.\n\nHead of Animal Operations at the safari park Darren Beasley told staff that Longleat's marketing director James Bailey would pay and they should keep their phone bills as receipts.\n\nThe post came just days after Emma narrowly escaped the axe after ending up in the bottom two against Dev Griffin, 34, and his partner Dianne Buswell.\n\nAccording to the Telegraph, Emma is said to be 'completely devastated' by the scandal, and claims she was 'unaware' of the manager's actions.\n\nA voting scandal has hit Strictly Come Dancing after a boss at Emma Weymouth's stately home of Longleat told staff their votes for the Viscountess would be reimbursed in a post on Facebook\n\nHead of Animal Operations at the safari park Darren Beasley told staff that Longleat's marketing director James Bailey would pay\n\nThe post, sent to 109 people, read: 'So news just in... If anyone wants to help keep lady Emma in Strictly on Saturday and does the phone votes then I am authorised to get James Bailey to pay for your call.\n\n'So keep your phone bill as proof, tell your partners, mums, dads, cousins, granny and the dog if he can dial that number for Lady Emma & Aljaz.\n\n'Phoning this week will be free because Longleat will pay. Let's keep them in for another week. Happy voting.'\n\nEmma became the chatelaine of the Longleat Estate in Wiltshire when she married Ceawlin Thynn, Viscount Weymouth\n\nThe safari park welcomes 1.3million people every year and has an annual income of £3.5million.\n\nEmma became the chatelaine of the Longleat Estate in Wiltshire when she married Ceawlin. A Longleat spokesperson told The Sun: 'It was not our policy or practice to reimburse people for votes.\n\nThey added: 'No one sought payment from Longleat or any team member, so no one acted on the message and it had no effect on the actual votes.'\n\nA Strictly spokesman said: 'The BBC takes fairness extremely seriously and this has had no impact on the public vote.' Longleat were approached for comment.", "description": "The Strictly Come Dancing star, 33, has two sons - John, five, and Henry, two - with husband Ceawlin Thynn, Viscount Weymouth, who is the heir of the 7th Marquess of Bath and his wife Anna.", "authors": ["Hayley Richardson For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/11/20241974-0-image-a-158_1572176427030.jpg", "published_at": "2019-10-27"}