{"pub": "euronews", "url": "https://euronews.com/2019/10/19/european-countries-halted-arm-exports-to-turkey-but-why-haven-t-they-done-the-same-for-sau", "downloaded_at": "2019-10-19 11:43:12.323774+00:00", "title": "European countries halted arm exports to Turkey but why haven't they done the same for Saudi Arabia?", "language": "en", "text": "Several European countries including the United Kingdom, France, and Germany, have temporarily halted arms exports to Turkey over the country's military incursion into northern Syria.\n\nThe operation, which has been ongoing for almost a week, has so far resulted in hundreds of deaths among Kurdish-led Syrian Democratic Forces (SDF), according to the Syrian Observatory for Human Rights.\n\nBut this reaction from EU countries has also directed a spotlight to the bloc's other arms trading partners — most notably Saudi Arabia, which is involved in a controversial war in Yemen.\n\nA Saudi-led coalition has been fighting against rebels in Yemen since 2015 in a conflict that has led to the confirmed deaths or injuries of nearly 18,000 people, with the actual number believed to be higher.\n\nAround 24.1 million people in the country are also in need of some kind of humanitarian or protection assistance, the UN Office for the Coordination of Humanitarian Affairs said in a 2018 report, calling it the worst humanitarian crisis in the world.\n\nBut despite these figures — and with the war edging close to its sixth year — many EU countries have had a somewhat delayed response when it comes to arms deals with the Saudis, while some haven't really responded at all.\n\nSo, which countries are involved?\n\nUnited Kingdom\n\nThe UK didn't halt its arms exports to Saudi Arabia until June 2019, when the UK Court of Appeal found the exports licenses were unlawful because the government at the time had failed to properly assess violations to international humanitarian law and the risk to civilians.\n\nBut in late September, Trade Secretary Liz Truss said there had been three \"inadvertent\" breaches of the arms ban, two of which she revealed in a letter to the committee on arms exports controls, and another of which was revealed to parliament.\n\nFrance\n\nFrance has exported armoured vehicles to the Saudis, which Peter Wezeman, a senior researcher with the Stockholm International Peace Research Institute (SIPRI), said was \"the kind of equipment that you would likely see end up either in Yemen, or on the border with Yemen, or being used with the conflict of Yemen\".\n\nIn 2018, Saudi Arabia was ranked at France's second-biggest client with more than €1 billion in arms exports, a report on the country's arms exports presented to parliament showed.\n\nIn May, French President Emmanuel Macron said he \"acknowledges\" the sale of French weapons to Saudi Arabia, with assurances that they are \"not used against civilians\".\n\nFrench defence minister Florence Parly has also said the country's government had not recently sold any arms that were being used in Yemen, but leaked documents released earlier this year suggest otherwise.\n\nGermany\n\nThe German government stopped exporting arms to Saudi Arabia in October 2018 after the killing of Washington Post journalist Jamal Khashoggi at the Saudi consulate in Istanbul.\n\nIts ban on exports is to last until March 2020, which is an extension from the first deadline, which passed last month.\n\nBut despite this position, the memorandum does not include other parties that are fighting as part of the Saudi-led coalition, leading to criticisms that the German government is still contributing arms that are, in turn, used in the Yemen war.\n\nSpain\n\nIn 2018, Spain announced that it was suspending its arms exports to Saudi Arabia, citing what it says could be implied as \"the direct use of this type of armament against a civilian population\".\n\nHowever, the Spanish government backtracked on this decision just a few weeks later after the Saudis threatened to scrap a construction deal that would see thousands of people in southern Spain lose their jobs. They haven't changed their position since.\n\nWhy would EU countries halt arms to Turkey for the conflict, but not to Saudi Arabia for the same reasons?\n\nThere are a number of reasons, but two in particular stand out: business and alliances.\n\nFrance, Germany, the United Kingdom, Spain and Italy are all among the world's top ten biggest exporters of arms, while Saudi Arabia is also the world's biggest importer of arms.\n\nTurkey, in comparison, is the 13th biggest importer of arms.\n\nBetween 2013-17, the largest arms supplier to the Saudis was by far the US (61%).\n\nBut this was also followed by the UK (23%), France (3.6%), Spain (2.4%), Switzerland (1.8%), Germany (1.8%) and Italy (1.5%) respectively, according to SIPRI data.\n\nSo have countries been more reluctant to sanction one of their biggest clients because of economic reasons? Not necessarily, he said.\n\n\"You could ask whether Turkey is less of an important market than Saudi Arabia, but this is not the case for Germany, at least, for which Turkey has been (an important client) for a long time,\" Wezeman said.\n\nMeanwhile, EU countries have long alliances with the Saudis, but not with the Houthis.\n\nMeanwhile, the West may be part of NATO alongside Turkey, but they also have alliances with the Kurds, who were a crucial partner in the fight to defeat Islamic State (IS).\n\nFor Wezeman, how countries choose their allegiance does not always seem logical, as in terms of its proximity and importance in NATO, one would think that EU countries would be less inclined to sanction Turkey than Saudi Arabia.\n\nBut the partnership with the Kurds will have definitely played a role in the EU countries' decision to halt arm exports to Turkey, according to the expert.\n\nWezeman said that the proximity with Turkey could have more of a direct impact on Europe.\n\n\"The fight against IS is particularly important for Europe whereas what happens in Yemen has no immediate impact, doesn't lead to refugees or potential terrorists coming to Europe.\"\n\nHe also highlighted that the role of morality and adherence to international humanitarian can also play a role in a country's decision to halt arm exports.\n\n\"In Germany, there is a significant arm industry and they were keen to get a substantial arm contract with Saudi Arabia. They had a very good chance of selling tanks and in the end, the German government took the decision not to take those steps.\"\n\nHowever, the expert noted that political perspectives on arm trade differ from country to country, taking the example of France or the UK where moral considerations play a smaller role than the business aspect unlike Germany, Sweden, or Norway where it's the other way around.\n\nREAD MORE:", "description": "European countries halted arm exports to Turkey but why haven't they done the same for Saudi Arabia?", "authors": ["Rachael Kennedy"], "top_image": "https://static.euronews.com/articles/stories/04/23/48/58/1000x563_cmsv2_101b4010-1f13-5bb4-8a69-334e25584d64-4234858.jpg", "published_at": "2019-10-19"}