{"pub": "nymag", "url": "https://vulture.com/article/best-streaming-horror-tv-shows.html", "downloaded_at": "2019-10-29 23:59:40.649223+00:00", "title": "10 Great Under-the-Radar Horror Shows to Stream This Halloween", "language": "en", "text": "Marianne is streaming on Netflix. Photo: Netflix\n\nIt’s Halloween week, and if you need some bingeing recommendations for while you carve that last-minute pumpkin or eat candy corn until you feel sick, fear not: Vulture has some suggestions for you. With Castle Rock season two now streaming on Hulu, and Nickelodeon airing its resurrection of Are You Afraid of the Dark?, here are some complementary programs that can serve as alternatives to your standard Halloween and Hocus Pocus marathons. From demons in France to haunted towns in Argentina to zombies of the future and the past, these ten scary shows should keep you going for the rest of October and beyond.\n\nBeyond the Walls\n\nThis French miniseries is three episodes long, so it’s great for a short binge commitment. In Beyond, a young woman inherits an apartment from a man she does not know, but when she arrives, she finds that his dead body has been sitting inside it for years. Likely against all better judgment, the woman decides to stay in the apartment anyway and discovers that there’s an entire world within its walls — as in literally within them — waiting to pull her in. Streaming on YouTube.\n\nBlack Summer\n\nBlack Summer is a spin-off of the zombie series Z Nation, which ran for five seasons on Syfy. Set within the Z universe, this Netflix-based series opens just weeks after the end of the world and focuses on a woman named Rose (Jamie King) who is separated from her daughter and must go through hell and high water with a group of postapocalypse refugees to try to find her. These are the real bad days post-civilization, before any new order has been established. That makes it tonally darker than the series it draws from, but with only one season so far, it’s not a long, bleak kind of binge commitment. Streaming on Netflix.\n\nThe Chalet\n\nAfter a group of friends gather for a reunion at a chalet in the French Alps, they become trapped and cut off from the outside world. As typically happens when friends come together in shows like these, a secret from the past emerges that makes everything more chaotic. Set between two timelines that are 20 years apart, The Chalet is rife with betrayal, paranoia, revenge, and grisly discoveries. Streaming on Netflix.\n\nChannel Zero\n\nThis dearly departed anthology series that ran for four seasons on Syfy is one of the best horror shows you’ll find anywhere. Each season brings to life a different “creepypasta” — horror stories and images that have made their way around the internet — and does an amazing job of creating living nightmares that slowly unfold before you. It also has some amazing monsters, like the tooth child from season one, schizophrenia personified in season three, and the incredible Pretzel Jack (played by contortionist “Twisty” Troy James) from season four. Channel Zero is surreal, long-form art-house horror, and it will burrow deep under your skin. Streaming on Shudder.\n\nGhoul\n\nHere’s another miniseries option for you. Ghoul is an Indian program set in a military-detention facility in a near-future version of the country, which has become an oppressive totalitarian state. Out of dedication to the ruling regime, a young woman turns her father over to the authorities for being a dissident, and she eventually ends up as a soldier on detail at the prison where he was sent. As she tries to figure out where he is and what happened to him, a high-priority prisoner is brought in for interrogation. But this prisoner is no man, and the officers responsible for black-bagging and torturing people who come through the facility will have to answer for their transgressions. Streaming on Netflix.\n\nKingdom\n\nThis South Korean series takes zombies and makes an epic period piece. As Vulture said in its review of the still underappreciated show, “Kingdom was inspired by a historical plague that swept through Korea during the Joseon dynasty, killing thousands in days. But in this telling, the disease is metaphorical as well as medical. This is a story about the effects of corruption and official incompetence and how the powerful trample the powerless in times of crisis.” And its visual style is amazing, to boot. Streaming on Netflix.\n\nThe Kirlian Frequency\n\nThis animated series has had only one season so far, and it became widely available on Netflix for the first time earlier this year. With just five episodes of about ten minutes each, you can clear through it quickly, making it a wonderful, weird hit of the strange and the unusual. Kirlian is set in an Argentine town of the same name that’s a hotbed of supernatural activity; the main featured character is a radio DJ who talks his community through the spooky nights, when folks might encounter witches, vampires, ghosts, werewolves, or other creatures of the dark. Fans of Welcome to Night Vale or those who otherwise enjoy dropping into the small-town lives of an atypically creepy community should enjoy Kirlian. Streaming on Netflix.\n\nMarianne\n\nAnother French series, Marianne came out this summer and is one of the best spooky shows on Netflix by far. It also has an all-time scary villain thanks to a performance from Mireille Herbstmeyer as the doomed Madame Daugeron. (Truly, she is keep-you-up-at-night, haunt-your-nightmares terrifying.) Marianne centers on the author Emma Larsimon, who got famous by writing a series of horror novels in which her protagonist is locked in an epic battle with a demon named Marianne. When Emma publishes her final book in the series and resolves to leave horror stories behind, the very real Marianne that inspired her novels gets extremely pissed that her stories will no longer be told, and Emma has to revisit her past in hopes of finally defeating her nemesis. Streaming on Netflix.\n\nNOS4A2\n\nBased on the book of the same name by Joe Hill, NOS4A2 follows a woman named Vic with a beyond-human ability to find lost things, which puts her in the path of the supernaturally evil Charlie Manx. Manx satiates himself with the souls of children, and once he has used them up, he leaves their remains in a terrible place called Christmasland, where every day is, you guessed it, Christmas. Unhappiness is illegal in Christmasland, despite the fact that it has a bunch of soulless children in it, and Vic is the only person capable of possibly stopping Manx and saving the kids. And if you’re wondering how to pronounce NOS4A2 it’s … Nosferatu. Streaming on AMC.\n\nOutcast\n\nThe Walking Dead’s Robert Kirkman created this series (based on his comic of the same name), which revolves around a man who has been battling demonic possessions since he was little. And we don’t mean other people’s possessions — we mean his own, which makes him a veritable revolving door of demons. He connects with a reverend to try to help others who are battling the forces of evil, and in the meantime he starts uncovering secrets about his past that may explain his unique problem. Outcast ran for four seasons, so if you’re looking for a more substantial world to get lost in, it can balance out the bite-size TV options here. Streaming on Amazon.", "description": "It’s Halloween week, and if you need some bingeing recommendations for while you carve that last-minute pumpkin or eat candy corn until you feel sick, fear not: Vulture has some suggestions for you.", "authors": ["Jordan Crucchiola"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/29/29-marianne-new.w1200.h630.jpg", "published_at": "2019-10-29"}