{"pub": "fox", "url": "https://foxbusiness.com/money/eric-trump-american-dream-alive-and-well", "downloaded_at": "2019-10-01 00:11:23.481657+00:00", "title": "Eric Trump: The American Dream is alive and well", "language": "en", "text": "The American Dream alive and kicking, and will only get stronger thanks to President Trump, his son Eric said Monday.\n\nContinue Reading Below\n\n“The American dream… is back and it's alive and well,” he told FOX Business’ Stuart Varney in response to whether the American Dream is dead and criticisms that his father isn't the American Dream because he got a head start from his father.\n\n“And you see that when you see the markets, you see that when you see these great companies coming out and succeeding. You guys we're talking about Peleton earlier… I mean you watch these companies go from a simple concept into something that's incredible, something that's a brand and… that's really what my father did,” he added.\n\nAnd it wasn’t just business, he said. Trump also prospered on the hit reality TV show \"The Apprentice.\"\n\n“Whoever thought that we were all going to be on a reality TV show we’re not exactly reality TV-type people…. He believed dearly in something and he thought a country was going in a wrong direction and he goes you know what kids, let's give it a chance, let's give it a shot at his family and you know he achieved something that was incredible,” he said.\n\n“We achieved something that was incredible and something that is so much bigger than what we are and it shows that the American dream is alive and under him I think the American dream is going to be stronger than it was ever before.”\n\nTrump added that \"America is the greatest country in the world.\"\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "Eric Trump tells \"Varney & Co.\": 'The American dream is going to be stronger than it was ever before”", "authors": ["Julia Limitone"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/02/0/0/add962b8-43a0fa4dcdb147148ad77658b1b7530a.jpg?ve=1&tl=1", "published_at": "2019-09-30"}