{"pub": "cnn", "title": "The ultimate geek's guide to Tokyo", "url": "https://cnn.com/travel/article/tokyo-geek-guide/index.html", "language": "en", "published_at": "2018-12-18", "downloaded_at": "2019-09-02 07:32:17.081509+00:00", "text": "Tokyo (CNN) — Otaku, which means \"your house\" in Japanese, was a term used to (snidely) describe people with obsessive hobbies. To wit: An otaku was seen as a shut-in.\n\nWhile originally used to negatively characterize people with interests in anime and manga comics, the label, first coined by essayist Akio Nakamori in the 1980s, has grown to include a wide variety of fandoms and is no longer used with disdain.\n\nThere's a warm community for cos-players, online gamers, railfans (otaku preoccupied with trains), music lovers and countless other subcultures. A growing number of people in Japan now self-identify as otaku -- and it's a judgment-free zone.\n\nNowhere is the thriving otaku culture more on display than the futuristic Japanese capital of Tokyo , where several whole neighborhoods tend to a diverse range of desires and obsessions.\n\nGeeks, rejoice!\n\nIkebekuro is the Tokyo ward that's home to Sunshine City, a building complex with a 60-story skyscraper at its center and countless attractions. Joshua Mellin\n\nGetting there: Fly Kawaii with Hello Kitty\n\nStart your geek adventure directly from the boarding gate by flying with Japan's most adorable icon, Hello Kitty, on EVA's themed airplanes featuring a fleet of Sanrio character designs.\n\nThe light-hearted livery provides a calming distraction for the long-haul journey. With welcome videos starring the whole family of Sanrio characters and in-flight food shaped as various characters, the planes's novelties even include Hello Kitty animated safety instructions and barf bags.\n\nDeparting from Los Angeles and Chicago, the current connecting flight to Tokyo (Narita) sports a design featuring foodie-favorite Gudetama (the lazy, depressed egg) who is content to shoulder the stress of flying.\n\nHello Kitty fans will want to start their trip with an international Hello Kitty flight. Currently, this is possible through Los Angeles or Chicago. Joshua Mellin\n\nBut Hello Kitty fans won't be deprived once they reach their destination as Tokyo offers seemingly no end of opportunities to soak up the Hello Kitty culture. Keio Plaza Hotel's Princess Kitty and Kitty Town rooms don't just include bedding and wallpaper but countless Hello Kitty details from wake-up calls from Kitty White, to \"Do Not Disturb\" signs and Hello Kitty room service.\n\nAnd Hello Kitty stores are sprinkled throughout Tokyo.\n\nRelated content Take a look at Japan's new Hello Kitty Shinkansen\n\nShinjuku: City of the beast\n\nAs you descend the technicolor stairwell into Tokyo's Robot Restaurant, it's like stepping into an alternate realty. Here's how it all comes together.\n\nShinjuku is one of the 23 special wards in Tokyo, essentially a borough. Bolstered by its central location, it's perhaps the most prominent of all of Tokyo's distinct neighborhoods and very, very busy.\n\nThe general geeky vibe in this area is underscored by Godzilla Road's neon main street — a grand shrine to the rubber-suited golden age of Japan's greatest Kaiju. Nearly 40 feet tall and modeled on 1992's Godzilla vs. Mothra, Hotel Gracery's life-size Godzilla head roars and spits mock fire (a convincingly lit mist) hourly from noon to 8 p.m. daily.\n\nAn accompanying light show also includes other nearby buildings appearing to crack and burn. Accessible for a close-up view via the eighth-floor lobby, the \"Godzilla Hotel\" even has themed rooms with windows that are at eye level with the giant, menacing lizard.\n\nShinjuku's Godzilla Road is an impressive neon street in the center of it all. The street is literally a shrine to the rubber-suited golden age of Japan's greatest Kaiju or strange creature. Joshua Mellin\n\nEasily one of the most bizarre attractions in Tokyo, you will leave forever wondering what you've just witnessed.\n\nThe third-floor bar proudly offers Western drinks and refreshments (order the French toast and hash browns) while a band dressed as robots plays wedding-band-like renditions of songs such as ABBA's \"Mamma Mia,\" \"Ave Maria,\" and assorted anime themes — and that's just the pre-show reception.\n\nThe main event, located in the basement, delivers completely as advertised with a dizzying array of sword-wielding robots, mecha-dinosaurs, dancers and explosive pyrotechnics as the ticket says: \"Dancing!! Kicking up the excitement!! Wildly swinging around!!\"\n\nTo reveal more would spoil the experience.\n\nAkihabara electric town: Tokyo's geek mecca\n\nLocated in Tokyo's wild Akihabara area, Super Potato is filled with retro video games and equipment. Video by Black Buddha\n\nSometimes called \"The Town of Otaku,\" Akihabara, one of Tokyo's most vibrant neighborhoods, is the center of anime and video game culture in Tokyo. Its brightly-colored arcade buildings resemble cartridges themselves, brimming with an abundance of games boasting the newest technologies.\n\nAll within a few blocks are four multi-leveled SEGA-branded arcades, labeled simply SEGA Akihabara 1-4.\n\nA high concentration of manga, model and trading card shops can be found surrounding the arcades. Legendary video game store Super Potato boasts nearly any game ever produced and is noted for a museum-like collection of obscure retro games.\n\nAlso popular in this district are themed restaurants, notably anime-inspired maid cafes and a range of cat, owl and hedgehog cafes.\n\nAkihabara is Tokyo's center of anime and video game culture. It's often the first stop for vistors to Japan looking for cool, geeky stuff. Joshua Mellin\n\nLining Akihabara's side streets are a myriad of electronics stores offering all manner of specialized gadgets and parts ranging from one-man stalls to sleek major retailers.\n\nSofmap operates six stores in the micro-neighborhood alone, each specializing in a particular department. Radio Kaikan, whose bright yellow neon sign is iconic to the district, is home to 30 independent stores, notable for their toys and collectibles.\n\nA few blocks from the flashy Electric Town is the nearly 1,300-year-old Kanda Myojin Shinto Shrine. Popular with the warrior class of the Edo Period, it has become a place where local gamers go to bless their systems against fault.\n\nIt's a lot to take in and deserves at least a half day of exploring.\n\nOdaiba: Man-made island starring Gundam\n\nFor any fan of the anime series \"Gundam,\" a trip to the man-made island of Odaiba grants an instant reward as a functioning life-size Unicorn Gundam Statue greets visitors at Diver City Tokyo Plaza. At over 60 feet tall, the RX-0 Unicorn Gundam is nearly the height of the shopping center it keeps watch over.\n\nFour times a day the imposing, full scale model demonstrates a swift transformation from unicorn mode to destroy mode. Lasting just a few short minutes, shows take place several times throughout the day.\n\nFans of the anime series Gundam will absolutely want to take a trip to the man-made island of Odaiba, where a functioning life-size Unicorn Gundam Statue greets visitors. Joshua Mellin\n\nLocated within Diver City is The Gundam Base Tokyo, a library-like fan store showcasing examples of every Gundam kit ever produced, as well as a quiet work area for customers to build their own models with professional kit-builders to consult with.\n\nRelated content Tokyo's top hotels from moderate to ridiculous in price\n\nIkebekuro's Sunshine City: Subculture central\n\nMore relaxed than Shinjuku and Akihabara's busy entertainment areas, the up-and-coming Ikebekuro disctrict is particularly welcoming to niche subcultures.\n\nAnchored by Sunshine City, a building complex with a 60-story skyscraper at its center, Ikebekuro is a good stop after you've explored the multi-level stores lining Akihabara's streets.\n\nThe Pokemon Center Mega Tokyo is located in Ikebekuro, an up-and-coming Tokyo district home to myriad niche subcultures. Joshua Mellin\n\nSunshine City doesn't just sound like a location from Pokemon, it's also home to Pokemon Center Mega Tokyo, the ultimate store for fans of the Nintendo video game.\n\nHere's where to find obscure Pokemon editions along with large figures of fan favorites Mewtwo, Charizard and, of course, Pikachu.\n\nBut you don't have to be a Pokemon fan to appreciate Sunshine City. Here is where passionate fandoms of all anime cartoons flock for organized fan gatherings and meet ups. It's where to go for pin-trading and trading-card bartering.\n\nBut failing interest in all of that, there's a strong cos-play scene in the district's Naka-ikebukuro Park. Watch (or join in) as people don elaborate costumes and play their favorite characters.\n\nTokyo Dome: Japan's national pastime\n\nBaseball's roots in Japan stretch back to the 1870s, and the country proudly proclaims it as a national pastime. (It's fitting that Tokyo will host the return of baseball to the Olympics in 2020.)\n\nFew sporting events are more exciting than a Japanese baseball game and few fans as passionate as the ones at The Tokyo Dome, home to The Yomiuri Giants, \"The New York Yankees of Japan.\"\n\nA visit to The Tokyo Dome, home to The Yomiuri Giants, \"The New York Yankees of Japan\" is a must for baseball lovers and geeks alike. Joshua Mellin\n\nAlong with distinct food offerings such as Takoyaki (little fried balls of dough stuffed with Octopus) and pork katsu sandos, a game at Tokyo Dome includes a boisterous cheering section in the bleachers, equipped with thundersticks (the inflatable noise makers) and gigantic team flags.\n\nWith a compact pep band leading organized cheers and songs, the banging drums and daunting chants make for a competitive atmosphere to the final out.\n\nFan of the game or not: You will be entertained.\n\nHarajuku: Fashionistas dress the part\n\nCNN Travel takes a mini-trip around Harajuku, Tokyo's most fashion-forward neighborhood\n\nThis internationally-known fashion district in Tokyo is famous for the defiantly bold and colorful style named after the neighborhood, its streets acting as fashion runways for outrageous outfits.\n\nWhile it's hard to resist the vortex of Takeshita Street, the shoulder-to-shoulder pedestrian shopping strip located directly off the Harajuku train station, with its enticing larger-than-your-head rainbow cotton candy and dizzying array of brand shops, intrepid shoppers will be rewarded by stepping outside its cramped and hectic quarters.\n\nAdjacent Cat Street assumes a more relaxed avenue to stroll and shop, with resale stores focused on higher-end brands. Close by, Harajuku Chicago boasts a wide variety of vintage clothing to peruse including baseball-team Happi coats and traditional kimonos.\n\nTokyu Plaza Omotesando Harajuku's mirrored entranceway makes for a multi-dimensional photo shoot location to show off your trendy threads. Joshua Mellin\n\nOne of the most distinctive boutiques in the district is Sukajyan Dept. A tiny souvenir jacket store on Omotesando Avenue, it's packed with the impressive collection of designer Ken Kakinuma (Conan O'Brien and Kanye West are proud owners).\n\nPopularized by returning World War II servicemen as souvenirs, the outerwear became popular among Japanese youth and is now decidedly a popular symbol of the country's fashion ethos.\n\nOnce you've coordinated the perfect outfit, Tokyu Plaza Omotesando Harajuku's mirrored entranceway makes for a multi-dimensional photo shoot location to show off your trendy threads.\n\nBeyond the district: Mascot-spotting\n\nMascots are so common in Tokyo that at times they seem to blend into the crowd unnoticed. It's not just districts or sports teams — it seems every event, brand or obscure municipal office has its own mascot. It's not unusual to see Kumamon the bear giving a casual pep talk to the Japanese women's handball team or drumming cat Nyango Star rocking out in a Harajuku department store.\n\nMascots, they're just like us!\n\nThey're chronicled on twitter by @mondo_mascots, an account run by British-born, Tokyo-based Chris Carlier. Carlier figures the popularity of mascots are \"an extension of Japan's love of novelty and 'kawaii' things.\"\n\nRelated content The viral Twitter account celebrating Japan's mascot culture\n\nThese fun-loving, cute characters have grown out of a tradition to honor righteous symbols of Japanese culture. Shibuya, for example, the district home to the famous Shibuya Crosswalk, celebrates Hachikō, the ever-loyal Japanese Akita dog, as a symbol in the neighborhood, even designing their local buses in his likeness.\n\nCarlier says he's most excited about Chiitan: \"the accident-prone otter, who posts slapstick videos online every day.\"", "description": "Otaku culture includes a wide variety of Japanese fandoms. This geek's guide to Tokyo shows you where to go and what to do.", "authors": [], "top_image": "https://dynaimage.cdn.cnn.com/cnn/w_1200/http%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F181127184622-02-tokyo-geek-guide-akihabara-electric-town-super-tease.jpg"}