{"pub": "investing.com", "url": "https://za.investing.com/news/general/reputational-harm-goes-handinhand-with-being-charged-court-tells-zuma-1965590", "downloaded_at": "2019-10-12 06:56:16.856301+00:00", "title": "Reputational Harm Goes Hand-In-Hand With Being Charged, Court Tells Zuma", "language": "en", "text": "© Reuters.\n\n\n\n\n\n\n\n\n\n\n\nThe Pietermaritzburg High Court rejected Jacob Zuma’s claim that he would suffer prejudice if he went on trial for his corruption trial, saying that the seriousness of the offences he faced far outweighed that concern.\n\nEarlier on Friday, Zuma was dealt a blow, with the court dismissing his application for a permanent stay of prosecution, meaning he must stand trial from Tuesday next week.\n\nZuma, who is facing charges of corruption, money laundering and racketeering linked to the multi-billion-rand arms deal, previously argued for the case to be struck off the roll, saying the charges were politically motivated and that the unreasonable delays had prejudiced him.\n\nBut the court found that he and the NPA were complicit in the delays.\n\nWhen Jacob Zuma argued for this corruption case to be struck from the roll, he claimed his reputation had been damaged badly as a result of the unreasonable delays in getting the case to trial.\n\nIn fact, he said the consequence of the delays was that his name was now synonymous with corruption.\n\nJudges Thoba Poyo-Dlwati, Bhekisisa Mnguni and Esther Steyn were not convinced.\n\nThey ruled that the reputational harm which Zuma claimed to have suffered went hand-in-hand with being charged.\n\nThe judges said that the seriousness of the offences that the former president was facing outweighed any prejudice which he claimed he would suffer if the trial proceeded.\n\nThey went further to add that, in any event, this reputational damage did not seem to have prevented Zuma from ascending to the highest office in the country.\n\n\n\n\n\n\n\n\n\n\n\nThe post Reputational Harm Goes Hand-In-Hand With Being Charged, Court Tells Zuma appeared first on iAfrica.com.", "description": "Reputational Harm Goes Hand-In-Hand With Being Charged, Court Tells Zuma", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB8211O_L.jpg", "published_at": "2019-10-12"}