{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/03/flashback-obamas-war-on-whistleblowers-more-prosecuted-as-spies-than-ever-before", "downloaded_at": "2019-10-05 05:46:25.283751+00:00", "title": "Flashback–‘Obama’s War on Whistleblowers’: More Prosecuted as Spies than Ever Before", "language": "en", "text": "The Obama administration waged war on whistleblowers during its tenure, reportedly prosecuting at least eight leakers under the Espionage Act – more than under all former presidents combined.\n\nMembers of the Obama administration also reportedly retaliated against whistleblowers, namely those linked to the federal government’s gun-walking scandal known as Operation Fast and Furious.\n\nUntil Obama took power, the government had almost entirely reserved the Espionage Act for spies.\n\nReferring to the former president on January 13, 2017, the Washington Times noted, “When he entered office in 2009 and waged a war against this community.”\n\nMeanwhile, other apparent leaks, made by individuals described by the Guardian as “administration insiders” in March 2015, went “entirely unpunished or” were “treated, as in the case of General David Petraeus, as misdemeanors.”\n\nAs of late June, President Donald Trump’s administration had indicted three potential whistleblowers under the Espionage Act.\n\nAt least two of the defendant whistleblowers pleaded guilty to violating the Espionage Act, the Reporters Without Borders group noted in May.\n\nThe Obama administration, however, is known for normalizing the use of the statute against journalists’ sources in the government.\n\nEven the liberal Washington Post noted early in the Trump administration, “Trump rages about leakers. Obama quietly prosecuted them.”\n\nNevertheless, Democrats have blasted Trump for lambasting intelligence community information leakers that triggered House Democrats’ impeachment inquiry as spies.\n\nOn Wednesday, House Intelligence Committee Chairman Adam Schiff (D-CA) told reporters that Trump’s attack on the CIA “whistleblower” that triggered the impeachment investigation is unacceptable.\n\nTrump’s comparison of the “whistleblower’s” source as a “spy” amounts to an “incitement of violence,” Schiff said.\n\nIn a joint press conference with House Speaker Nancy Pelosi (D-CA), Schiff added that Trump wants to characterize the whistleblower as “treasonous,” adding:\n\nLet’s not make a mistake here, the president wants to make this all about the whistleblower and suggest that people come forward with evidence of his wrongdoing are somehow treasonous and should be treated as traitors and spies.\n\nSchiff, who came into office in 2013, has been silent about Obama using the Espionage Act to target whistleblowers.\n\nIndividuals prosecuted under Obama include U.S. Army intelligence analyst Chelsea Manning.\n\nIn May 2017, the government released Manning after serving only seven out of a 35-year sentence for leaking thousands of military and U.S. Department of State documents to WikiLeaks in 2010.\n\nObama also used the Espionage Act to charge Edward Snowden, the former National Security Agency contractor, who remains in Russia.\n\nUnder Obama, the U.S. Department of Justice (DOJ) targeted whistleblowers for leaking information to journalists and even attempted to prosecute the reporters who received and published the data.\n\nThe Washington Times pointed out:\n\nMr. Obama’s Department of Justice and FBI spied on The Associated Press, secretly wading through their reporters’ phone records, in an effort to chill potential federal whistleblowers. His administration targeted Fox News reporter James Rosen as a criminal co-conspirator under the Espionage Act for simply talking to one of his sources in the State Department and reporting on it.\n\nNear the end of his administration, it appeared the former president had a change of heart and showed an interest in protecting government whistleblowers and other official leakers.\n\nHe implemented executive-branch directives and signed a bill into law to protect whistleblowers and members of the inspector general community.", "description": "The Obama administration waged war on whistleblowers, reportedly prosecuting at least eight leakers under the Espionage Act.", "authors": ["Edwin Mora"], "top_image": "https://media.breitbart.com/media/2019/08/GettyImages-1140810621b-640x335.jpg", "published_at": "2019-10-03"}