{"pub": "fox", "url": "https://foxbusiness.com/markets/wework-cant-afford-the-severance-costs-delays-layoffs-report", "downloaded_at": "2019-10-22 15:10:18.703297+00:00", "title": "WeWork postpones layoffs because it can't afford to pay severance", "language": "en", "text": "The latest issue to plague the cash-strapped communal office-space company WeWork: It can’t afford to cut costs, The Wall Street Journal reported.\n\nContinue Reading Below\n\nWeWork, which pulled its initial public offering amid scrutiny of its debt and mounting financial losses, delayed layoffs of thousands of employees because it didn't have the cash for their severance pay, the Journal reported, citing sources it didn't identify.\n\nJust days after withdrawing a proposal to take the company public in late September, WeWork alerted staff of far-reaching job cuts expected to hit by the end of October, Bloomberg reported earlier this month.\n\nWhile executives didn’t specify how many jobs were on the line, people familiar with the plans told Bloomberg the cuts would affect about 2,000 employees, or 16 percent of the workforce. Affected workers include product managers, engineers and data scientists, according to The Information.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nThe company's co-founder and CEO, Adam Neumann, was forced to step down from the top role amid the public stock offering's collapse as well as criticism of personal spending and questionable behavior.\n\nWeWork's rescue by Japanese conglomerate SoftBank, reported by the Journal on Tuesday, may also force him to step down as non-executive chairman, a role he had retained.\n\nAs the company unraveled, its valuation plummeted to about $8 billion from an earlier high of nearly $47 billion, the Journal reported.\n\nThe Associated Press contributed to this report.", "description": "The cuts may affect about 2,000 employees, or 16 percent of the company's workforce, Bloomberg has reported.", "authors": ["Daniella Genovese"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/02/0/0/wework.jpg?ve=1&tl=1", "published_at": "2019-10-22"}