{"pub": "guardian", "url": "https://theguardian.com/football/2019/oct/13/krasimir-balakov-bulgaria-gareth-southgate-england-euro-2020-qualifier", "downloaded_at": "2019-10-13 23:34:30.898545+00:00", "title": "Bulgaria’s Krasimir Balakov says English game has more of an issue with racism", "language": "en", "text": "Krasimir Balakov has insisted English football has more of a problem with racism than Bulgaria despite the Euro 2020 qualifier on Monday night being held in a partially closed stadium. Uefa imposed sanctions after incidents during Bulgaria’s matches against Kosovo and the Czech Republic in June.\n\nBalakov, Bulgaria’s manager, also accused England of increasing tension in the build-up to the match after the Chelsea striker Tammy Abraham claimed that Gareth Southgate’s side would walk off the pitch if they are on the receiving end of racist chanting.\n\nEngland’s Gareth Southgate seeks to calm racism row with Bulgaria Read more\n\nIn response last week the Bulgarian football union president, Boris Mihaylov, urged Uefa to take action against England, and Balakov – a member of the celebrated side that reached the semi-finals of the 1994 World Cup – was similarly dismissive about the potential for any issues.\n\n“What I can say is that I don’t think we have a problem,” he said. “In the Bulgarian championship, we have a lot of players of different ethnicities and skin colour. I don’t think we have as big a problem like, for example, England do. I would like to focus on football because at the end of the day we are all civilised Europeans and we are all working for this sport. That is all that matters.”\n\nAsked to elaborate on his comments about England, Balakov said: “What I meant was that in the Bulgarian championship we’ve not had such problems. While there have been incidents in various levels of English football involving racism, which I consider something normal because it’s a big country with a very diverse population. But we don’t have this problem in Bulgaria, I can assure you of that.”\n\nFacebook Twitter Pinterest England’s manager Gareth Southgate said: ‘I’ve always said we have as many issues in our own country to resolve as anywhere else.’ Photograph: Vadim Ghirdă/AP\n\nUefa has ordered that 5,000 of the 46,340 seats at the Vasil Levski Stadium will remain empty for the game against England, reduced to 3,000 against the Czech Republic a month later. The sanction for “racist behaviour” related to a banner supporting Bulgarian national resistance in Prague and what the Bulgarian press officer described as “a third party chant by a small group of people” during the 3-2 home defeat by Kosovo.\n\nAsked how confident he was that home supporters will behave, Balakov said: “My personal opinion is I can never be certain of what will happen. But I do not think we should continue talking about something that has not even happened yet and to increase the tension in the build-up to the game. You said what you had to say, we replied and said what we had to say and I think we should leave it at that.”\n\nThe last time England played in Sofia in 2011, Bulgaria were fined €40,000 after monkey chants were aimed at Ashley Young, Ashley Cole and Theo Walcott, with Harry Kane admitting that the players had discussed how they would respond if there is any repeat on Monday. “There’s obviously a protocol in place but from my point of view and the players’ point of view we’re here to do a job on the football pitch,” he said. “Hopefully we don’t have to cross that bridge.”\n\nSouthgate said: “We are guests in another country. I’ve always said we have as many issues in our own country to resolve as anywhere else. We had to prepare our players because of what happened in Montenegro but outside of that we trust the authorities to make sure everything is in place.”\n\nBulgaria go into the match bottom of Group A having failed to register a victory in their six matches so far but are already assured of a playoff after finishing second in their Nations League group last year.\n\nBalakov, who spent most of his playing career at the German side Stuttgart but also served under Sir Bobby Robson at Sporting Lisbon, took over in May and has lost four of his five matches so far, with the exception being the 0-0 draw against Montenegro in Podgorica on Friday.\n\nFacebook Twitter Pinterest Harry Kane scores from the spot during England’s 4-0 win over Bulgaria at Wembley Stadium. Photograph: Robin Jones/Getty Images\n\nThe manager admitted he is hoping to take advantage of England’s frailty at the back but was wary of being too positive about their chances of causing an upset after a disastrous display from his own defenders in the 4-0 defeat at Wembley in September.\n\nHe said: “Every team has a weak spot and if we can counter the English team’s dynamism and answer it then we will have a chance. In terms of individual and team quality, the difference is extremely big but we have to count on the team’s character and everyone being at their best to get a good result.\n\n“We sincerely hope to exploit those defensive mistakes but we had similar problems in London. Two or three of the goals came from our own mistakes so I can definitely answer your question after tomorrow’s game.”", "description": "Bulgaria’s manager, Krasimir Balakov, pointed to ‘incidents of racism’ in English football as he responded to England player fears of racist chanting before the Euro 2020 qualifier in Sofia", "authors": ["Ed Aarons"], "top_image": "https://i.guim.co.uk/img/media/bcef07bedeab20de47f33c0fed351b7a765c763a/0_119_3500_2101/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=90f96df7a385c36ff017845f65565bfa", "published_at": "2019-10-13"}