{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7580197/Rudy-Giuliani-repeatedly-urged-Trump-kick-Turkish-cleric-blamed-alleged-coup-attempt.html", "downloaded_at": "2019-10-16 21:29:29.667854+00:00", "title": "Rudy Giuliani repeatedly urged Trump to kick out a Turkish cleric blamed for alleged coup attempt", "language": "en", "text": "Rudy Giuliani may have pursued another instance of shadow diplomacy by urging Donald Trump in 2017 to hand over Turkish cleric living in exile in the U.S. to the Turkish government.\n\nReceiving Fethullah Gulen is a top priority for Turkish President Recep Tayyip Erdogan, and former administration told The Washington Post that the president's personal attorney insisted Trump ejected Gulen from the country.\n\nThe claims are the latest in a saga involving Giuliani's attempts, from his position outside government, to attempt to influence foreign policy.\n\nGulen – currently residing in Pennsylvania – is a permanent U.S. resident who Erdogan demands be returned to Turkey to stand trial on charges of plotting a coup attempt against him in 2016. But the Turkish cleric denies any involvement in such a plot.\n\nA former administration official said Giuliani would bring up the issue of kicking Gulen out of the U.S. and handing him over to the Turkish government frequently, and described the topic as Giuliani's 'hobby horse.'\n\nRudy Giuliani is now being accused of pushing for Donald Trump to extradite Turkish cleric Fethullah Gulen\n\nGulen (pictured), is a Turkish preacher residing in Pennsylvania\n\nurkish President Recep Tayyip Erdogan (pictured) has been demanding that Gulen be returned to Turkey to stand trial on charges of plotting a coup attempt against him in 2016\n\nAnother official said the former New York City mayor would bring up the issue so often officials were concerned he was making the case on behalf of Erdogan.\n\n'We're not going to arrest [Gulen] to do a solid for Erdogan,' a second official told the Post in describing the internal thinking on the matter.\n\nTrump and Giuliani's supposed conversations in 2017 regarding Gulen fell within the same year Giuliani was representing Reza Zarrab, a Turkish Iranian accused of corruption.\n\nGiuliani is already facing criticism for his efforts to get the Ukrainian government to investigate Trump's political rival Joe Biden, and his son Hunter Biden. His communications with Ukrainian government led to questions of his involvement in U.S. foreign policy.\n\nThe new claims come as Trump withdrew troops from northern Syria just ahead of a Turkish invasion on Kurdish forces in that region.\n\nThe president was widely advised against withdrawing troops from such an unstable area, and critics and allies alike have chastised Trump.\n\nOfficials who used to work in the administration say that Trump seemed receptive to Giuliani's proposal to hand over Gulen to Turkey and also claim the president referred to Erdogan as 'my friend.'\n\nProsecutors are already looking into potential lobbying violations against Giuliani.\n\nTrump's personal attorney is not a registered foreign lobbyist, and he would be required to become one if he were to be paid to lobby the U.S. government on policy matters regarding a foreign interest.\n\nThe former Republican mayor, however, told the Post he never represented or attempted to represent Turkey.\n\nWhen asked to discuss if he advocated for Gulen's extradition, Giulani texted a Post reporter, 'can't comment on it that would be complete attorney client privilege but sounds wacky.'\n\nHe also texted 'Bull' when he was told several people described the conversation to the Post.\n\nGiuliani is a feirce Trump defender who has been accused of several instances of shadow foreign diplomacy and is being probed for potential lobbying violations\n\nIn December, Trump told his Turkish counterpart that his administration would take a look at Turkey's extradition request of Gulen. And one month later, a U.S. delegation met with Turkish officials to discuss the request, Turkish state media reported at the time.\n\nGiuliani is a vehement defender of Trump and has become the center of attention surrounding the Ukraine scandal after a whistle-blower revealed the nature of Trump's July conversation with Ukrainian President Volodymyr Zelensky.\n\nGiuliani appeared to get more heavily involved in Ukraine after former special counsel Robert Mueller's Russia investigation concluded.\n\nHe also reportedly pushed for the removal of then-Ambassador to Ukraine Marie Yovanovitch and was successful in persuading the president to prematurely call her back to the U.S. months early from her three-year assignment in Ukraine.\n\nFederal investigators are also examining Giuliani's business relationship with two former associates, Lev Parnas and Igor Fruman, who were arrested last week on campaign finance charges.\n\nA federal grand jury in New York has issued a subpoena for former Republican congressman Pete Sessions of Texas to hand over records and other information on his interactions with Giuliani and his two associates.\n\nGiuliani has denied any wrongdoing.", "description": "Rudy Giuliani may have pursued another instance of shadow diplomacy by urging Donald Trump in 2017 to hand over Turkish cleric living in exile in the U.S. to the Turkish government.", "authors": ["Katelyn Caralle", "U.S. Political Reporter For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/16/19795714-0-image-a-2_1571241392306.jpg", "published_at": "2019-10-16"}