{"pub": "metro", "url": "https://metro.co.uk/2019/10/22/emmerdale-spoilers-deadly-boat-explosion-rips-apart-cain-moira-dingle-tonight-10961982", "downloaded_at": "2019-10-22 13:23:56.698632+00:00", "title": "Emmerdale spoilers: Who dies in Cain, Moira and Nate boat explosion?", "language": "en", "text": "Moira Dingle (Natalie J Robb) has been on the receiving end of some pretty explosive climaxes recently, courtesy of Nate Robinson (Jurell Carter) – but none quite as life changing as this as her secret betrayal of Cain (Jeff Hordley) reaches a terrifying conclusion. But who will live and who will die as the battling trio are ripped apart by a deadly explosion?\n\nCain has found out from Pete Barton (Anthony Quinlan) that Moira has been having an affair with Nate and he is on the warpath. Having sent Moira and Nate off together, Cain follows and surprises Moira – before suggesting that they all bond on a fishing trip on the lake.\n\nMoira and Nate soon sense that something is amiss but they’re a little too late as they are at Cain’s mercy on the waters. With Moira downstairs preparing food, Cain confronts Nate over what he has been doing with Moira and Nate is unapologetically flippant about it, even boasting about what they got up to.\n\nAdvertisement\n\nAdvertisement\n\nCain sees red and launches a violent attack against Nate and things spiral out of control, with Moira unable to stop the warring pair, who appear to be scrapping to the death. And there is set to be a further bombshell as the truth about Nate’s identity comes to light in dramatic fashion.\n\nBut things are about to get even more dangerous when Moira is knocked into the water in the fracas and finds her leg caught. As she is unable to break the surface of the water, a growing inferno spreads through the boat and causes a catastrophic explosion, leaving all lives in jeopardy.\n\nSuddenly this affair doesn’t seem to have been the best idea – will they all emerge unscathed or has the infidelity ended in tragedy?\n\nEmmerdale airs an hour long episode on Tuesday 22nd October at 7pm on ITV.\n\nAdvertisement Advertisement", "description": "Devastating scenes tonight.", "authors": ["Duncan Lindsay"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_91165597_1571742132.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-22"}