{"pub": "guardian", "url": "https://theguardian.com/tv-and-radio/2019/sep/20/emmys-2019-game-of-thrones-television", "downloaded_at": "2019-09-20 08:16:30.937614+00:00", "title": "Emmys 2019: Game of Thrones leads the race but can it rule for the last time?", "language": "en", "text": "Emmys 2019: Game of Thrones leads the race but can it rule for the last time?\n\nThe divisive final season of Game of Thrones is set to do battle for one last time this weekend as it heads into the Emmys with a record 32 nominations.\n\nEmmys 2019 predictions: who will win, and who should win? Read more\n\nHBO’s hit fantasy drama has already beaten Frasier to become the most awarded scripted television series in Emmys history, and after winning last year’s trophy for outstanding drama, it’s predicted to do the same again. Earlier this month, the show picked up 10 awards at the Creative Arts Emmys that reward technical achievement, a strong sign of Academy support.\n\nBut America’s biggest night of television is also set to be one of its most competitive. While the final seasons of awards stalwarts Game of Thrones and Veep may well go out with a bang, they face off against an acclaimed set of newcomers, including Succession, Pose, Killing Eve, Fleabag, Schitt’s Creek and Bodyguard. Earlier this year at the Golden Globes, Killing Eve’s Sandra Oh and Bodyguard’s Richard Madden beat out their more established and frequently nominated competitors.\n\nGame of Thrones also enters the fray after arguably its most critically unpopular season. If the show does dominate Sunday’s ceremony it will represent a bittersweet victory for HBO, which has yet to replicate the show’s success with any of its blockbuster follow-ups. The network is currently in production for a prequel series starring Naomi Watts.\n\nThis year’s nominees have also been criticised for their lack of diversity with just 24 above-the-line nominations for actors of colour, down from 2018’s record 38 nods. Three major categories, lead actress in a comedy, supporting actress in a drama and supporting actress in a comedy, contain only white nominees. Throughout its history, just 10% of Emmy winners in the major acting categories have been of colour. Diverse winners this year could include Oh as well as the cast of Ava DuVernay’s Netflix miniseries When They See Us.\n\nFacebook Twitter Pinterest Jharrel Jerome in When They See Us. Photograph: Atsushi Nishijima/Netflix\n\nThe Selma director’s acclaimed drama about the Central Park Five boasts 11 nominations but faces off in one of the toughest categories of the night, for limited series, against ratings hit Chernobyl. “The international reception to Chernobyl took many industry insiders by surprise,” nominated star Jared Harris said. “My hope is that its impact emboldens programmers to keep taking risks to not only delight, but also challenge their audiences.”\n\nAfter a mixed reception for last year’s hosts, Saturday Night Live duo Colin Jost and Michael Che, this year has followed on from many awards shows in the past year by going host-less. Producer Don Mischer has claimed the decision will allow the show, airing this year on Fox, to be “a little more unpredictable”. Presenters this year include Angela Bassett, Gwyneth Paltrow, Naomi Watts, Phoebe Waller-Bridge, Viola Davis, Ben Stiller and the cast of Keeping Up with the Kardashians.\n\n“If you have a host and an opening, that’s 15 or 20 minutes you can‘t have to salute the shows,” Fox Entertainment’s chief executive, Dan Collier, said. “This is a pretty unique year for some of America’s favorite shows going away.” The night is set to include on-stage cast reunions for both Game of Thrones and Veep.\n\nIn recent years, the red carpet has been enlivened with political fashion statements and on Sunday, many stars are reported to be showing their support for the Memphis-based non-profit St Jude children’s research hospital. Hollywood costume designer Arianne Phillips has created a gold pin which has been distributes to stars in attendance.\n\nLast year’s biggest winners were Game of Thrones and the Amazon comedy The Marvelous Mrs Maisel. The year also brought the ceremony’s lowest ratings to date, down 11% from 2017.", "description": "A host-less ceremony pits the divisive final season of the awards juggernaut against fresher contenders", "authors": ["Benjamin Lee"], "top_image": "https://i.guim.co.uk/img/media/f5e122864e954b50986b61367e75eb6073a32290/233_0_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f7178a4c565acff77b0175d1319b9ec3", "published_at": "2019-09-20"}