{"pub": "investing.com", "url": "https://ph.investing.com/news/commodities-news/update-1oil-climbs-but-still-set-for-big-weekly-loss-over-demand-worries-62196", "downloaded_at": "2019-10-04 07:45:34.403213+00:00", "title": "UPDATE 2-Oil climbs but set for big weekly loss over demand worries", "language": "en", "text": "UPDATE 2-Oil climbs but set for big weekly loss over demand worries\n\nCommodities 36 minutes ago (Oct 04, 2019 15:09)\n\n© Reuters. UPDATE 2-Oil climbs but set for big weekly loss over demand worries * Brent down 6.6% for the week, WTI 6% lower\n\n* Weak data, demand concerns drive prices lower this week\n\n* Supply concerns fade as Saudi fully restore output\n\n\n\n(Updates prices, adds analyst quote)\n\nBy Roslan Khasawneh\n\nSINGAPORE, Oct 4 (Reuters) - Oil futures were higher ahead\n\nof the weekend but remained on track for large weekly losses on\n\nfears that slower global economic growth will hurt fuel demand,\n\neven as Saudi Arabia said it has fully restored oil output after\n\nrecent attacks.\n\nBrent crude oil futures rose 12 cents, or 0.2%, to\n\n$57.83 a barrel by 0703 GMT, while U.S. West Texas Intermediate\n\n(WTI) crude futures rose 9 cents, or 0.2%, to $52.54.\n\n\"Today in Asia I believe we are seeing some pre-weekend\n\nbuying, mostly as a risk hedge against anything happening in the\n\nMiddle East over the weekend,\" said Jeffrey Halley, a senior\n\nmarket analyst at OANDA in Singapore.\n\nStill, for the week, Brent was down 6.6%, marking its\n\nlargest weekly loss since December. WTI was down 6% for the\n\nweek, its biggest decline since July.\n\n\"The supply side of the equation will continue to weigh on\n\noil as full Saudi Arabia production returns much faster than\n\nexpected,\" Halley said.\n\nWeak U.S. services sector and jobs growth data on Thursday\n\nadded to worries about global oil demand and exacerbated fears\n\nthat a protracted U.S.-China trade war could push the global\n\neconomy into a recession.\n\n\"Concerns about global oil demand are rising, and next\n\nweek's U.S.-China trade talks, the significant X factor, will be\n\nparticularly important, given the sharp drop in the oil price\n\nover the last week,\" said Stephen Innes, Asia Pacific market\n\nstrategist at AxiTrader.\n\nSaudi Arabia's energy minister, Prince Abdulaziz bin Salman,\n\nalso said on Thursday the world's top crude oil exporter has\n\nfully restored oil output after attacks on its facilities last\n\nmonth knocked out more than 5% of global oil supply.\n\n\n\nRecent data showing a slowdown in U.S. shale output and\n\ndrilling activity, however, could lend some support.\n\n\n\n\"Continued falls in drilling activity has seen monthly\n\ngrowth in U.S. shale oil output fall, from 150 thousand barrels\n\nper day (kbpd) to only 50 kbpd,\" said ANZ Bank on Friday.\n\n\"This is likely to linger well into 2020.\"\n\n\n\n\n\nUPDATE 2-Oil climbs but set for big weekly loss over demand worries", "description": "UPDATE 2-Oil climbs but set for big weekly loss over demand worries", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC3G0FO_L.jpg", "published_at": "2019-10-04"}