{"pub": "townhall", "url": "https://bearingarms.com/cam-e/2019/10/28/dave-chappelle-reason-for-second-amendment", "downloaded_at": "2019-10-29 01:16:27.207359+00:00", "title": "Dave Chappelle Says There’s A Reason For The Second Amendment", "language": "en", "text": "Comedian Dave Chappelle was honored with the Mark Twain Prize for American Humor at the Kennedy Center this past weekend, and Chappelle used the occasion to tout his support for the Second Amendment right alongside the First Amendment.\n\nChappelle informed the audience “I did not write a speech.” During his impromptu remarks, he defended freedom of speech when talking about comedians he knows who are “very racist.” “(I) don’t get mad at ’em, don’t hate on ’em,” he said. “Man, it’s not that serious. The First Amendment is first for a reason. Second Amendment is just in case the First one doesn’t work out.”\n\nThis might be the first time someone’s ever spoke supportively of the right to keep and bear arms during the Kennedy Center awards, but it’s not the first time Chappelle has spoken about gun ownership and gun control. In his most recent special for Netflix, the comedian riffed on buying a gun after moving to a farm in rural Ohio.\n\nChappelle says he hates guns, but he owns several. He says he doesn’t want them, but he feels like he should have them, because of where he lives and the problems from the opioid epidemic. In his telling, what really prompted him to get a gun, however, was seeing a guy with a rifle strapped across his back walking through Chappelle’s rural farmland. Chappelle so disliked that feeling of not being able to protect yourself that he went down to a local store (a Kmart, as Dave tells it) and bought himself a shotgun. It’s entirely possible that Chappelle made up the entire story, but if he did, he didn’t do it to make some sort of roundabout point in favor of gun control. I won’t spoil it for you, because his special really is worth watching, but there is no “haha look at the ignorant gun owners” punch line to be found. The closest you’ll find is his suggestion that if we really want gun control, every African American needs to buy a gun. Having said that, I assume that Chappelle, like almost every celebrity out there, supports more gun control laws, but there’s no point in the Netflix special where he demands Congress reinstate a semi-auto ban or anything like that.\n\nEven though he was surrounded by a gaggle of celebrities who’ve endorsed all kinds of gun control laws, Chappelle didn’t call for a gun ban or sign on to Beto O’Rourke’s compensated confiscation plan at the Kennedy Center honors. Instead, he offered an amusing take on why he supports the freedoms protected by the Bill of Rights, as well as heartfelt thanks for the opportunities and friendships he’s had over the years.\n\n“An honor like this would be special anywhere it happened, but the fact that it’s happening here in Washington does make me feel like I’ve closed some sort of circle,” he said. “And I came home and everyone’s OK. My friends still love me and everything still feels right.”\n\nCongratulations to Dave Chappelle for a well-deserved honor, and thanks for speaking up in support of some of our most important rights.", "description": "Receiving the Mark Twain Prize for American Humor, the comedian says the Second Amendment is there in case \"the First one doesn't work out.\"", "authors": ["Cam Edwards", "Author'S Bio", "Cam Edwards Has Covered The Amendment For More Than Years As A Broadcast", "Online Journalist", "As Well As The Co-Author Of", "Heavy Lifting", "Grow Up", "Get A Job", "Start A Family", "Other Manly Advice"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/239/45c4ce72-bd72-4314-9837-6ac7e646c195.png", "published_at": "2019-10-28"}