{"pub": "nationalreview", "url": "https://nationalreview.com/news/barr-defends-durhams-probe-into-origins-of-russiagate-slams-comeys-failure-of-leadership", "downloaded_at": "2019-10-29 00:18:05.681948+00:00", "title": "Barr Defends Durham’s Probe Into Origins of Russiagate, Slams Comey’s ‘Failure of Leadership’", "language": "en", "text": "Attorney General William Barr (File photo: Erin Scott/Reuters)\n\nU.S. Attorney General William Barr told Fox News in an interview Monday that John Durham’s probe into the origins of the Mueller investigation, which was recently elevated to a criminal investigation, “is making great progress.”\n\n“He’s a 35-year veteran of the department, great reputation for non-partisanship. He was selected by two Democratic attorney generals to do sensitive investigations for them,” Barr said of Durham, the U.S. Attorney for Connecticut. “He’s a by-the-book kind of guy. He’s thorough and fair, and I’m confident he’s going to get to the bottom of things.”\n\nLast week, reports broke that the Justice Department has elevated the status of Durham’s administrative probe to a criminal inquiry. The news caused a mixed reaction on Capitol Hill, with House Democratic chairmen Jerry Nadler and Adam Schiff decrying the Department of Justice as “a vehicle for President Trump’s political revenge.” Representative Doug Collins (R., Ga.), the ranking Republican on the House Judiciary Committee, defended the move as “an effort to deliver truth and accountability.”\n\nOn Thursday, Senate Democrats on the Judiciary Committee sent a letter to Barr which questioned the attorney general’s impartiality in conducting the probe while in the midst of impeachment.\n\n“Impartial enforcement of the law is essential to give the American public confidence in the Justice Department’s work,” the letter reads. “Your personal connection to these matters creates the appearance of a conflict of interest and gives rise to questions about whether the Department is being used to advance the President’s personal interests.”\n\nSchiff said on ABC News’ “This Week with George Stephanopoulos” Sunday that he thinks the Durham probe is “illegitimate.”\n\n“You can assign good people to do an illegitimate investigation. You can assign good people to investigate the president’s political rivals. It doesn’t mean that the investigation is any less tainted. This is tainted because of the motivation which is a political one to serve the president’s political interests,” he said.\n\nBarr also took a swipe at former FBI Director James Comey on Monday, saying current director Christopher Wray has been “outstanding in the support and responsiveness they’ve given” to Durham.\n\n“As you know, I’ve said previously that I felt there was a failure of leadership at the bureau in 2016 and part of 2017, but since Director Wray and his team have taken over there’s been a world of change. I think that he is restoring the steady professionalism that’s been a hallmark of the FBI,” Barr said.", "description": "Last week, reports broke that the Justice Department has elevated the status of Durham’s administrative probe to a criminal inquiry.", "authors": ["Tobias Hoonhout", "Andrew C. Mccarthy", "Matthew Continetti", "Ramesh Ponnuru", "Rich Lowry", "Dan Mclaughlin", "Michael Brendan Dougherty", "Read More", "The American Conservative", "The Week"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/william-barr-doj.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-28"}