{"pub": "yahoo", "url": "https://news.yahoo.com/us-fed-signals-rate-cut-market-odds-fluctuate-013028861.html", "downloaded_at": "2019-09-18 05:13:54.938806+00:00", "title": "US Fed signals rate cut as market odds fluctuate", "language": "en", "text": "Fed Chairman Jerome Powell has said the central bank will \"act as appropriate\" to sustain GDP growth (AFP Photo/ANDREW CABALLERO-REYNOLDS)\n\nWashington (AFP) - Expectations are high for the US Federal Reserve to deliver the year's second interest rate cut on Wednesday as members conclude a hotly-anticipated policy meeting in Washington.\n\nWith the meeting underway, central bank officials on Tuesday also moved for the first time in a decade to prevent market fluctuations from pushing short-term interest rates beyond the Fed's control.\n\nUS Federal Reserve Chairman Jerome Powell has sent strong signals in recent weeks that a rate cut is coming, vowing that policymakers stand ready to \"act as appropriate\" amid \"significant risks\" to the economy -- notably President Donald Trump's trade wars.\n\nHe is due to make his announcement at 1800 GMT on Wednesday afternoon.\n\nMeanwhile, the New York Fed on Tuesday announced emergency measures to pump billions into the banking system through arrangements known as repurchase agreements in order to bring down short-term lending rates.\n\nElsewhere, futures markets, which project the odds of a rate cut, fluctuated wildly during the day on Tuesday. After a rate cut appeared a near certainty last week, the odds were cut to about even shortly after 2200 GMT.\n\nHowever, futures are influenced by movements in the effective Fed funds rate, which had bounced higher earlier Tuesday as liquidity on short-term financing markets began to dry up due to a host of conditions, including an increase in the available of Treasury securities from accelerated government borrowing.\n\n- Manufacturing gets a bounce -\n\nFurthermore, the weekend's attacks on Saudi oil installations caused crude prices to skyrocket on Monday, raising fears of worsened instability in the Middle East and a sustained increase in prices. Oil prices cooled somewhat on Tuesday.\n\nAhead of the meeting, Wall Street treaded water, with stocks making minor gains.\n\nThe Fed cut the key policy rate in July for the first time in more than a decade, after four rate hikes last year, putting the range at 2.0 to 2.25 percent.\n\nBut economic data in recent weeks has complicated the picture, showing firming inflation along with rising wages and consumer spending, prompting some to say fears for the world's largest economy may be overdone.\n\nThe Fed also reported Tuesday that US manufacturing, which had been hit hard by Trump's trade wars, had recovered somewhat in August, driving US industrial output up more than economists had expected.\n\nOxford Economics estimates the Fed will cut three more times this year, leaving the Fed's benchmark lending rate a full percentage point lower at the end of the year, erasing all of the 2018 rate hikes.\n\nKathy Bostjancic, Oxford's chief US financial economist, told AFP the Fed was still likely to cut interest rates despite the changing the predictions on futures markets .\n\n\"It does not change the fundamental need and expectation for the Fed to lower the target range tomorrow,\" she said late Tuesday.", "description": "Expectations are high for the US Federal Reserve to deliver the year's second interest rate cut on Wednesday as members conclude a hotly-anticipated policy meeting in Washington.  With the meeting underway, central bank officials on Tuesday also moved for the first time in a decade to prevent market", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/XWRILRe3GZTj053qRe_e2Q--~B/aD01NDQ7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/4a801e0d63db531b924d34ab9d3e0303e77a4d31.jpg", "published_at": "2019-09-18"}