{"pub": "wsj", "title": "CFOs Say They Underestimated Challenges of Lease-Accounting Standard", "url": "https://wsj.com/articles/cfos-say-they-underestimated-challenges-of-lease-accounting-standard-11567192119?mod=rsswn", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:04:42.735583+00:00", "text": "Many U.S. public companies underestimated the difficulties of complying with a new lease-accounting standard, finance chiefs say. Their stumbles could inform private companies that are now preparing for the transition.\n\nThe Financial Accounting Standards Board in the past year began requiring public companies to report operating leases on their balance sheets in an effort to increase transparency for investors and lenders.\n\nThe transition has proven to be a heavier-than-expected lift for many companies.\n\nAbout two-thirds of companies in the later stages of implementing the standard—those evaluating and deploying software and migrating data—have experienced difficulties, according to a study from LeaseQuery, an Atlanta accounting software company.\n\nThose late-stage challenges don’t align with expectations: Just 37% of companies in the early stages of implementation anticipated the transition would be difficult, according to the survey of more than 200 finance professionals, mostly from public U.S. companies.\n\nNewsletter Sign-up\n\nPrivate companies have been watching closely because their turn to transition is coming up. FASB, which sets U.S. accounting standards, advanced a proposal last month to give private companies an extra year—extending the deadline to fiscal years beginning after Dec. 15, 2020—to comply with the leasing standard. Companies have until Sept. 16 to comment on the proposal.\n\nThe transition to the new standard can involve the time-consuming process of tracking down lease agreements and contracts across offices, sometimes scattered around the world.\n\nExecutives of some public companies have said on earnings calls that the standard’s impact on net income has been minimal. But the transition itself posed some unexpected hurdles.\n\nGenesis Healthcare Inc., a Kennett Square, Pa.-based post-acute health-care provider, for instance, had to chase down hundreds of small equipment leases, finance chief Tom DiVittorio said.\n\nMr. DiVittorio anticipated searching for leases for medical equipment and copy and fax machines, but he soon realized he needed to find less obvious ones such as a lease embedded in a service agreement.\n\n“Even people in our nursing facilities who need to be focused on patient care had to help us dig up leases,” said Mr. DiVittorio, whose company didn’t participate in the survey.\n\nMr. DiVittorio said his biggest regret was spending too much time searching for a software tool to accommodate all of Genesis’s leases. The company never found one. His advice to future companies adapting to the standard: “Learn in Excel what you really need out of software and go find it.”\n\nGriffin Capital Essential Asset REIT Inc., an El Segundo, Calif.-based commercial-property landlord, relied heavily on “practical expedients,” or additional guidance that FASB provided during the transition, to lessen confusion.\n\n“After really studying this and understanding how the guidelines evolved, we were able to carefully go through it and provide the information we needed,” said Javier Bitar, CFO of the real-estate investment trust. “Private companies will have the benefit of our experience.”\n\nCompanies that are lessees on a large volume of leases could run into issues because it could give their balance sheet a larger “gross-up,” or service payments on top of base rent, Mr. Bitar said. To deal with this, companies should consult with their lenders, he said.\n\nAdam Aron, chief executive of the Leawood, Kan.-based movie theater chain AMC Entertainment Holdings Inc., says the standard is creating market confusion. He railed against several providers of financial data on an Aug. 8 earnings call, accusing them of erroneously categorizing operating leases as debt.\n\n“As viewed on the data streams of these providers, AMC became wildly over-levered and AMC shares became stunningly expensive—all this despite no change in cash, no change in interest payments and no change in the operations of AMC’s business,” Mr. Aron said on the call.\n\nWrite to Mark Maurer at mark.maurer@wsj.com\n\nCorrections & Amplifications\n\nAn earlier version of this article misspelled Javier Bitar’s last name. (Aug. 30, 2019)", "description": "Many U.S. public companies underestimated the difficulties of complying with a new lease-accounting standard, finance chiefs say. Their stumbles could inform private companies that are now preparing for the transition.", "authors": ["Mark Maurer"], "top_image": "https://images.wsj.net/im-102974/social"}