{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7580377/Study-shows-giant-dinosaurs-evolved-different-cooling-systems-avoid-suffering-heat-stroke.html", "downloaded_at": "2019-10-16 21:37:53.918749+00:00", "title": "Study shows that giant dinosaurs evolved different cooling systems to avoid suffering heat stroke", "language": "en", "text": "Giant dinosaurs evolved various different cooling mechanisms to avoid heat stroke — with some possibly even panting like dogs to keep cool, a study has found.\n\nThe approaches to cooling used by large dinosaurs would have been different from those employed by their smaller cousins.\n\nJust like elephants and other large mammals today, the gigantic reptiles would have been particularly vulnerable to warm weather.\n\nUsing special 3D imaging techniques, researchers have identified multiple areas of heat exchange that would have kept giant dinosaurs' brains cool.\n\nScroll down for video\n\nGiant dinosaurs evolved various different cooling mechanism to avoid heat stroke — with some possibly even panting like dogs to keep cool, a study has found\n\n'The brain and sense organs like the eye are very sensitive to temperature,' said lead paper author and anatomist Ruger Porter of the Ohio University Heritage College of Osteopathic Medicine.\n\n'Animals today often have elaborate thermoregulatory strategies to protect these tissues by shuttling hot and cool blood around various networks of blood vessels.'\n\n'We wanted to see if dinosaurs were doing the same things.'\n\nFamous gigantic dinosaurs such as the long-necked sauropods or armoured ankylosaurs evolved big bodies independently from their smaller-bodied ancestors.\n\n'Small dinosaurs could have just run into the shade to cool off,' said paper co-author and palaeontologist Lawrence Witmer.\n\n'But for those giant dinosaurs, the potential for overheating was literally inescapable.'\n\n'They must have had special mechanisms to control brain temperature, but what were they?'\n\nThe answer, the researchers argue, lies in basic, everyday physics.\n\n'One of the best ways to cool things down is with evaporation,' argued Professor Porter.\n\n'The air-conditioning units in buildings and cars use evaporation, and it's the evaporative cooling of sweat that keeps us comfortable in summer.'\n\n'To cool the brain, we looked to the anatomical places where there's moisture to allow evaporative cooling, such as the eyes and especially the nasal cavity and mouth.'\n\nJust like elephants and other large mammals today, the gigantic reptiles would have been particularly vulnerable to warm weather. Pictured, different dinosaurs developed different internal mechanisms in order to keep cool\n\nTo do this, the research duo turned to the modern-day relatives of dinosaurs — birds and reptiles.\n\nIn these animals, evaporation of moisture in the nose, mouth, and eyes serves to cool blood on its way to the brain.\n\nThe team obtained the carcasses of birds and reptiles that had died of natural causes from zoos and wildlife rehabilitation facilities.\n\nUsing a special CT scanning technique that highlights both arteries and veins, they traced blood flow from the sites of evaporative cooling to the brain.\n\nThey also precisely measured the bony canals and grooves that convey the blood vessels.\n\n'The handy thing about blood vessels is that they basically write their presence into the bones,' said Professor Porter.\n\n'The bony canals and grooves that we see in modern-day birds and reptiles are our link to the dinosaur fossils.'\n\n'We can use this bony evidence to restore the patterns of blood flow in extinct dinosaurs and hopefully get a glimpse into their thermal physiology and how they dealt with heat.'\n\nProfessors Porter and Wimter, pictured, turned the modern-day relatives of dinosaurs — birds and reptiles — to work out how their prehistoric cousins would have stayed cool\n\nThe results showed that large-bodied dinosaurs used different approaches to keep their brains cool.\n\nSmaller dinosaurs — such as the goat-sized pachycephalosaur Stegoceras — had a very balanced vascular pattern, with no single cooling region being particularly emphasised.\n\n'That makes physiological sense because smaller dinosaurs have less of a problem with overheating,' explained Professor Porter.\n\n'But giants like sauropods and ankylosaurs increased blood flow to particular cooling regions of the head, far beyond what was necessary to simply nourish the tissues.'\n\nThis unbalanced vascular pattern allowed the thermal strategies of large dinosaurs to be more focused.\n\nSauropods like Diplodocus and Camarasaurus used both the nasal cavity and mouth for cooling — whereas ankylosaurs such as Euoplocephalus used only the former.\n\n'It's possible that sauropods were so large — often weighing dozens of tons — that they needed to recruit the mouth as a cooling region in times of heat stress,' said Professor Porter.\n\n'Panting sauropods may have been a common sight!'\n\nWHAT ARE SAUROPODS? Sauropods were the first successful group of herbivorous dinosaurs, dominating most terrestrial ecosystems for more than 140 million years, from the Late Triassic to Late Cretaceous. They had long necks and tails and relatively small skulls and brains. They stretched to 130 feet (40 metres) and weighed up to 80 tonnes (80,000kg) - 14 times the weight of an African elephant. Sauropods were the first successful group of herbivorous dinosaurs, dominating most terrestrial ecosystems for more than 140 million years, from the Late Triassic to Late Cretaceous They were widespread - their remains have been found on all the continents except Antarctica. They had nostrils high up on their skulls - rather than being located at the end of the snout like those of so many other terrestrial vertebrates. Some fossils shows that these nostril openings were so far up the skull that there were very close to the eye openings. Sauropods such as the Diplodocus began to diversify in the Middle Jurassic about 180 million years ago. Source: University of California Museum of Paleontology\n\nOne problem that the researchers encountered was that many of the theropod dinosaurs — such as the 10-ton T. Rex — were also gigantic.\n\nHowever, the duo's analysis showed these creatures had a balanced vascular pattern — just like small-bodied dinosaurs.\n\n'This finding had us scratching our heads until we noticed the obvious difference - theropods like Majungasaurus and T. Rex had a huge air sinus in their snouts,' explained Professor Witmer.\n\nLooking closely at the bones showed a richly supply of blood vessels — pumping air in and out every time the animal opened and closed its mouth.\n\n'An actively ventilated, highly vascular sinus meant we had another potential cooling region,' said Professor Witmer.\n\n'Theropod dinosaurs solved the same problem — but in a different way.'\n\nThe full findings of the study were published in the journal Anatomical Record.", "description": "Using special 3D imaging techniques on dino relatives (birds and reptiles), experts in Ohio have identified multiple areas of heat exchange that would have kept giant dinosaurs' brains cool.", "authors": ["Ian Randall For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/17/19796506-0-image-a-10_1571242541640.jpg", "published_at": "2019-10-16"}