{"pub": "reuters", "url": "https://reuters.com/article/us-netflix-results/stock-market-tunes-in-to-netflix-after-subscriber-bounce-idUSKBN1WW1O9", "downloaded_at": "2019-10-17 14:44:01.198429+00:00", "title": "Stock market tunes in to Netflix after subscriber bounce", "language": "en", "text": "(Reuters) - Wall Street cheered a rebound in Netflix subscribers in the third quarter, driving shares in the firm 9% higher on Thursday even as analysts warned conservative estimates for the next three months may be a hint of less certain times ahead.\n\nFILE PHOTO: The Netflix logo is shown in this illustration photograph in Encinitas, California October 14, 2014. REUTERS/Mike Blake/File Photo\n\nThe video-streaming pioneer is bracing for the launch next month of Walt Disney Co’s (DIS.N) Disney+ and Apple Inc’s (AAPL.O) Apple TV+ after years when it has been left largely to develop and garner content from Hollywood studios unthreatened.\n\nThat has stirred the first outright concerns among financial investors about the company’s ability to fight deep-pocketed rivals, a feeling that was exacerbated by a shock slide in subscribers last quarter - the first in eight years.\n\nShares in the company have fallen 22% since that report in mid-July. After Wednesday’s third quarter results, they were back trading nearly 20% higher overall on the year.\n\n“In the race to capture the major share of audience in the global market, nobody is close to where Netflix is,” said James Fattal, an analyst with financial markets platform Investing.com.\n\n“Its original content for places like India and some European markets will mean the company will continue to be favored in the early years of these streaming wars.”\n\nStill, nine Wall Street brokerages cut their price target on the stock while one previous bull, Macquarie, downgraded its rating to neutral.\n\nAnother house, Needham, projected the company would lose 10 million of its roughly 60 million U.S. subscribers over the course of 2020 unless it lowers prices, and several analysts noted the company’s own “prudent” estimates for subscriber growth into the end of 2019.\n\n“In some ways Netflix has defied the naysayers in Q3, coming close enough to guidance and delivering impressive revenue and earnings growth,” Macquarie analysts said.\n\n“We think it will be hard ... to grow much more in the US, and we suspect pricing power is limited.”\n\n(This story corrects to say rival services will launch next month, not this month, in paragraph two)", "description": "Wall Street cheered a rebound in Netflix subscribers in the third quarter, driving shares in the firm 9% higher on Thursday even as analysts warned conservative estimates for the next three months may be a hint of less certain times ahead.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191017&t=2&i=1441871190&w=1200&r=LYNXMPEF9G16S", "published_at": "2019-10-17"}