{"pub": "abcnews", "url": "https://abcnews.go.com/US/russell-bucklew-convicted-murderer-illness-put-death-missouri/story?id=65996208", "downloaded_at": "2019-10-02 12:51:26.344696+00:00", "published_at": "2019-10-01", "title": "Russell Bucklew, convicted murderer with serious illness, put to death in Missouri", "language": "en", "text": "Russell Bucklew, a convicted murderer who fought against receiving the death penalty over concerns about an illness, was executed Tuesday evening by the state of Missouri.\n\nBucklew had argued for months that the death penalty would qualify as cruel and unusual punishment due to blood-filled tumors that had grown in his head, neck and throat. He argued that a tumor on his neck could burst when given lethal injection and cause him to choke on his own blood.\n\nLawsuits had postponed his execution date three times.\n\nBucklew had sued the Missouri Department of Corrections, and Director Anne Precythe, in case that went all the way to the U.S. Supreme Court. The case was argued from November 2018 until the court issued a ruling in the state's favor in April. The ruling was 5-4 in favor of the Missouri Department of Corrections.\n\nMissouri Department of Corrections via AP, File\n\n\"We mourn the unnecessary, unlawful execution of Russell Bucklew tonight,\" Cassandra Stubbs, director of the Capitol Punishment Project at the American Civil Liberties Union, said in a statement issued after the execution was carried out. \"Missouri carried out an execution that risked torture and violated international law, despite Mr. Bucklew's remorse and exemplary prison record. To think that killing this man -- who was terminally ill and had been a model prisoner for 23 years -- was worth the stain on our democracy and our humanity is a disgrace.\"\n\nBucklew was convicted in the 1996 killing of a man connected to his ex-girlfriend, Stephanie Ray, after she broke up with him. According to court documents, Bucklew broke into the home of the man where she was staying after he threatened her with a knife. He shot and killed the man, Michael Sanders, and shot at and missed Ray's 6-year-old son. He pistol-whipped Ray, breaking her jaw, kidnapped her and drove her to a secluded area where he raped her at gunpoint. He then got into a shootout with police officers, wounding one of them.\n\nHe later broke out of jail and attacked Ray's mother with a hammer, according to court records.\n\nBucklew had first claimed the risk of the blood clots rupturing just hours before he was first to be executed, according to the Supreme Court.\n\nSupreme Court Justice Neil Gorsuch wrote in the majority decision from April that unconstitutional punishments are those that \"intensify the sentence of death with a (cruel) 'superaddition' of 'terror, pain, or disgrace.'\" He ruled that Missouri's plan to execute Bucklew with pentobarbital would not.\n\nJulie Smith/The Jefferson City News-Tribune via AP, File\n\nBucklew tried to offer an alternative method of execution, but the court also shot that down.\n\n\"His main claim now was that he would experience pain during the period after the pentobarbital started to take effect but before it rendered him fully unconscious,\" wrote Gorsuch. But, he also noted that the lower courts found Bucklew \"produced no evidence that his proposed alternative … would significantly reduce the risk.\"\n\nAfter his appeal to the Supreme Court was denied, he reached out to Missouri Gov. Mike Parsons hoping to be granted clemency. Parsons turned down the request Tuesday, hours before Bucklew was executed.\n\nAccording to the ACLU, the execution at the Eastern Reception Diagnostic and Correctional Center took 23 minutes and was carried out after he had been cut off mid-sentence on a call with his attorneys Tuesday evening.\n\nActivists had protested outside Parsons' office and the courthouse on Tuesday hoping to halt the death sentence.\n\nABC News' Devin Dwyer contributed to this report.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/russell-bucklew-execution-ap-mo-20191001_hpMain_16x9_992.jpg"}