{"pub": "guardian", "url": "https://theguardian.com/football/2019/sep/26/mauricio-pochettino-nothing-broken-mindset-changes", "downloaded_at": "2019-09-26 23:46:26.871211+00:00", "title": "Spurs have to fix collateral damage even if Pochettino says ‘nothing is broken’ | David Hytner", "language": "en", "text": "Tottenham manager opens up on Champions League and World Cup agony after his side’s two wins from eight matches\n\nFor Mauricio Pochettino the context was unhappiness – specifically a question about his unhappiness; the impression that he has struggled to embrace his new project at Tottenham, which hit another obstacle on Tuesday with the Carabao Cup penalty shoot-out defeat at League Two Colchester.\n\nTottenham crash out of Carabao Cup to Colchester on penalties Read more\n\nIt was the prompt for the manager to go into soul-baring mode as he chronicled the two major disappointments of his footballing life; the first being the 2002 World Cup finals when he was a centre-half for Argentina. Pochettino has spoken before about the moment when Michael Owen tumbled under his challenge to win a penalty for England, which David Beckham scored to condemn Argentina to a 1-0 defeat in the second group game.\n\nThere has been a slightly jokey edge to Pochettino’s comments, which essentially distil into his contention that Owen had dived. How can England claim to be the home of fair play?! His audience have normally laughed along, throwing in a few retorts about cynical Argentinian defenders. But until now nobody in England has realised how badly it affected him.\n\n“It was always my massive dream to play in a World Cup and OK, we played but three [group] games and we went home,” Pochettino said. “There was the penalty with Owen. For three or four years we had been unbeaten but we arrived in circumstances that were the worst and we were out in the group stage. I closed myself away in my room and I didn’t go out for 10 days.”\n\nFacebook Twitter Pinterest Mauricio Pochettino talks to his players before the penalty shootout at Colchester, which Tottenham would lose. Photograph: Tottenham Hotspur FC/Getty Images\n\nThe second was the Champions League final defeat that Pochettino’s Spurs suffered against Liverpool last season. He had been desperate to win his first trophy as a manager and, after the unexpected and epic run to the final, he could almost touch the ultimate prize. It simply made what happened next – the strangely flat performance from his players – even more difficult to bear.\n\nColchester’s Luke Prosser: ‘My family are Spurs and they were going mad’ Read more\n\n“It was more than a dream [to win] and I felt so disappointed,” Pochettino said. “I took a train to Barcelona [where he has a house] the day after and, again, you are like depressed.”\n\nThe new season has been testing for Pochettino and Spurs, scarred by the home defeat by Newcastle and the throwing away of leads at Arsenal, Olympiakos and Leicester, which brought two draws and a defeat, respectively. After Colchester, the team’s record shows only two wins from eight games. Yet Pochettino has been through worse. He even said that the early months of his first season at Spurs were tougher than what he is currently enduring.\n\nIt was Pochettino’s day to put on a show of defiance, to summon perspective and get his messages across away from the prickly heat of a post-match press conference. He spoke for almost 50 minutes, sometimes switching into Spanish to ensure clarity, and it added up to a rallying cry which he hopes can spark an upturn, beginning at home to Southampton.\n\nThe Fiver: sign up and get our daily football email.\n\nAs previously the discussion was framed by the internal politics of the summer, taking in recruitment and the desire of a clutch of players to leave. It had been the same story in the summer of 2018. This time there was intense speculation over Christian Eriksen, Toby Alderweireld and Jan Vertonghen – each of whom has now entered the final year on his contract – plus Danny Rose, Serge Aurier and Victor Wanyama. In the end all six stayed.\n\nCarabao Cup shocks and the death of Sahar Khodayari – Football Weekly Extra Read more\n\nPochettino argued the distractions had gravely undermined the club until the closure of the European transfer window on 2 September and it was wrong to expect the players would be able to refocus in the blink of an eye; that the togetherness of the squad would instantly return to normal. But he stressed he would do everything possible to fix what he called the collateral damage. “Nothing is completely broken,” Pochettino said, with regard to relationships within the squad. “It’s just that sometimes, temporarily, the mindset can change and then to get back on track takes time or solutions. It’s only been three weeks [since the European window closed]. Your circumstances and your mental preparation as an athlete don’t just change overnight.”\n\nIt was put to Pochettino that with the stadium move having been completed and three new faces added to the squad, the club might appear better off when compared to last season, when they were renting Wembley until April and made no signings.\n\n“Who says that?” Pochettino replied, his opposition to the idea plain. “Challenges appear, personal circumstances appear. It doesn’t mean more names make a better team. It doesn’t follow that, if you have a £1.2bn stadium, you will win more games. Football is not an ordinary business. Ninety-nine per cent of the time two plus two is not four. That is why football is so complex and why a lot of managers are sacked.”\n\nQuick guide Follow Guardian sport on social media Show Hide Twitter: follow us at @guardian_sport Facebook: like our football and sport pages Instagram: our favourite photos, films and stories YouTube: subscribe to our football and sport channels Photograph: Chesnot/Getty Images Europe\n\nPochettino made the point that nobody is the same after they play a Champions League final. “The perception and expectation is different,” he said. “It creates a new circumstance for the club which is different again and we need to find a solution.”\n\nFootball League rejects proposal to readmit Bury into League Two Read more\n\nThe most pressing matter on the field is the team’s lack of pressing. “Collectively, we need to press better,” Pochettino said. “I was talking with some players – it’s like when you go with friends to play five-a-side. No one wants to go in goal. You want to play with the ball. You don’t want to be chasing people and running in behind. Maybe we lose this balance.\n\n“There is another part to the game – having the will to recover the ball, this aggressivity, and we drop a little bit in this collectively. This is the key point we need to fix.”\n\nPochettino argued the team’s performances were “not as bad as the feeling and atmosphere that we create” and, ever self-assured, he remains convinced that Spurs can take the most difficult final step to silverware with him.\n\n“I believe and hope this, yes,” he said. “If not, you are going to see quickly.”", "description": "Mauricio Pochettino, Tottenham’s manager, opens up on Champions League and World Cup agony after his side’s uncertain start to the season that has yielded two wins from eight games", "authors": ["David Hytner"], "top_image": "https://i.guim.co.uk/img/media/7d0839f0f00532b7971332ef2561566436aef7b5/438_148_2588_1553/master/2588.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d6c1c949ca92a7534c969c90a9646035", "published_at": "2019-09-26"}