{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/home/how-the-national-arboretum-got-its-ferns-and-became-a-civic-treasure/2019/10/28/bb52d5d4-ef8f-11e9-b648-76bcf86eb67e_story.html", "downloaded_at": "2019-10-29 13:52:51.801142+00:00", "title": "How the National Arboretum got its ferns and became a civic treasure", "language": "en", "text": "Another important feature is a path that circles through the woods so that you create a journey that is not repeated. You don’t need acres of land to achieve all this, just a vision and a determination to make it happen (plus some dough).\n\nAD\n\nAD\n\nA person with such a vision was Edith Bittinger, a name now lost to subsequent generations of Washingtonians but who, 60 years ago, led the effort to carve out Fern Valley at the U.S. National Arboretum. Fern Valley is, admittedly, more than a patch. The woods occupy about four acres, but the principles of woodland gardening transcend the scale.\n\nBittinger thought big. She led an army of volunteers, mostly women, who took an overgrown, existing stand of hardwoods and created the components I mentioned. The garden was a joint project of the National Capital Area Garden Clubs and the arboretum, the horticultural research arm of the U.S. Agriculture Department. The partners arranged for some serious additional infrastructure — bridges, steps and rustic benches and a 60-ton limestone wall — that added much additional character to the place.\n\nSuch a garden sucks up plants, and at its dedication in May 1960, Bittinger and her cohorts tallied the numbers. Seventy workers from 21 area garden clubs had planted 4,000 ferns of 47 species, and 2,000 native herbaceous plants representing 90 species. That was just for starters. At the time, Bittinger was 85.\n\nAD\n\nAD\n\nBeyond its creation, the establishment of this shaded pleasure garden set the tone for civic Washington to convince the USDA that the arboretum should be more than just a research farm. Most of the decorative gardens and attractions at the arboretum arrived after Fern Valley.\n\n“These women had a clear focus and wanted to create something. That garden caused the arboretum to be seen in a different way,” said Cherie Lejeune, president of the garden club organization. Today, it represents 65 garden clubs in greater Washington.\n\nBittinger came to it as a connoisseur of hardy ferns, and in its early days Fern Valley more closely resembled the northern forest of her native New England. Original plantings of white pine and hemlocks have faded, and the dominant trees are white and chestnut oaks, tulip poplar and American beeches. In addition to its northern plants, it is organized to present flora from the Mid-Atlantic ecosystems. The garden also features an adjoining meadow, but that was for another day.\n\nAD\n\nAD\n\nI asked its curator, Joan Feely, to show me some of the ground-layer plants, recognizing that this was the end of the growing season and such gardens look their perkiest in the spring, when the phlox is ablaze, the trilliums are up, and the deciduous azaleas add their floral grace notes. I was also mindful that we had been weeks without rain, and even with irrigation, a woodland garden this year isn’t going to go out in a blaze of color and vigor.\n\nThe idea of “forest bathing” or replenishing the soul in a woodland walk is trendy, but a stroll through Fern Valley is simply a reminder that ’twas ever thus. Mothers take their small children here just to connect them to nature, Lejeune said.\n\nThe other value in such a place is in discovering just how many wonderful varieties of wildflowers, grasses and ferns are available to the woodland gardener, and how limited is the common plant palette.\n\nAD\n\nAD\n\nThe upper reaches, near the entrance, have seen tree loss in recent years and the brighter light has made New England and calico asters and various goldenrods happy but such shade lovers as sedges not so content. Ferns remain a staple of the garden, and once they are established by formative pampering, they are happy in tough locations, Feely said. “There are some wonderful ferns that grow at the base of beech trees,” she said, pointing to the Christmas fern, evergreen but prone to lie flat after a hard freeze. A little farther along are whole drifts of the hardy but deciduous native ginger, Asarum canadense, which spreads assertively in rich humus but is easily controlled.\n\n“Sedges are just amazing,” Feely said. “They can do anything if you have the right sedge.”\n\nIf you want fine textures, Carex pensylvanica and C. eburnea fit the bill beautifully. The former spreads by stolons, the latter is a more obedient clumper.\n\nAD\n\nAD\n\nThe black-stemmed white wood aster was putting out the last of its little daisies. “It’s nicely drought tolerant and spreads where you need it to go,” she said.\n\nThere are some lingering but flowerless jewelweeds, which have a tendency to invade wet areas. Again, they can be easily removed, but leaving a few offers a fueling station to southbound hummingbirds in September.\n\nThe lacy fronds of the maidenhair fern, which are still looking good, “sweeten up the soil a little,” and Feely drew my attention to a neighboring clump of the broad beech fern. “It’s not quite indestructible but does well,” she said, pointing out that all the fronds are aligned in a flat plane except the base pair, which spread in different directions.\n\nAD\n\nOn the other side of the path, a clump of waterleaf (Hydrophyllum canadense) was thriving against a tree stump. It resembles heuchera in its eye-catching lobed leaves but will grow in wet areas that would quickly doom the heuchera. In the vicinity was the star-flowered Solomon’s seal (Smilacina stellata), about half the size of the more common false Solomon’s seal and “a nice tough ground cover,” Feely said.\n\nAD\n\nOne other plant stuck in my mind: a southern species of hawthorn named parsley hawthorn for its foliage shape. So few species of this lovely small tree seem to do well in heat and humidity, but here the old, sinewy Crataegus marshallii was stretching to a gap in the canopy.\n\nThese woods are full of such unexpected treasures, and its narrative is a lesson in the enduring power of community foresight and action. “It’s not a fairy tale,” Lejeune said. “It’s a great, true story.”\n\nAD\n\nTip of the Week\n\nExamine houseplants and tropicals before bringing them indoors and discard any that are full of whitefly, scale, mealybugs or other tenacious pests. Keepers can be sprayed outdoors with a light horticultural oil or insecticidal soap. Soaking pots in a tub for an hour or two will dislodge soil-dwelling pests such as ants.\n\n— Adrian Higgins\n\nMore from Lifestyle:\n\nAD", "description": "Fern Valley reminds us that the pleasures of a woodland garden existed long before “forest bathing” became trendy.", "authors": ["Adrian Higgins", "Gardening Columnist"], "top_image": "https://www.washingtonpost.com/resizer/3IqnFIgo6g7fRU3ycVtkt_F41oo=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/F4LRBTHPOUI6TNSIO26PQ3VWPY.jpg", "published_at": "2019-10-28"}