{"pub": "thehill", "url": "https://thehill.com/hilltv/rising/467726-gop-lawmaker-defends-facebook-over-political-ad-policy", "downloaded_at": "2019-10-29 00:19:57.669644+00:00", "title": "GOP senator defends Facebook over political ad policy", "language": "en", "text": "Sen. Marsha Blackburn Marsha BlackburnDemocrats ask appropriators to block funding for USDA move Melania Trump makes first solo visit to Capitol Hill House passes third bill aimed at preventing foreign election interference MORE (R-Tenn.) is defending Facebook amid criticism over its policy that exempts political advertisements from being fact-checked.\n\nThe social network announced earlier this month that it would allow politicians to run ads on its platform even if they include false information. Blackburn said that she has personally been affected by the network’s new policy with “factually incorrect ads” run against her but she argued that free speech should be the top priority.\n\n“I’ve had millions of dollars of ads run against me that were factually incorrect,” Blackburn told Hill.TV at the Politicon political convention over the weekend. “While I disagree with that content and I disagree with their putting that type content up, I also realize that free speech and political speech is an imperative.”\n\nBlackburn’s comments come as Facebook faces increased scrutiny over its new political ad policy. Most of the more intense criticism has come from Democrats.\n\nRep. Alexandria Ocasio-Cortez Alexandria Ocasio-CortezTlaib endorses Sanders at Detroit campaign rally Sanders, Tlaib make donations to Detroit marching band Facebook Green New Deal ad tests Ocasio-Cortez's concerns about the platform MORE (D-N.Y.) grilled Facebook CEO Mark Zuckerberg over the policy during a House Financial Services Committee hearing last week when she asked him whether she could run ads targeting Republicans in primaries saying that they voted for the Green New Deal.\n\nThough Zuckerberg said he thought lying was bad, he added that it depends on the context in which the political ad shows up. The company has also previously argued that private companies shouldn't control what political candidates can or cannot say.\n\nThis was not the first time Facebook has defended its new ad policy.\n\nEarlier this month, Facebook declined to remove an ad pushing unsubstantiated claims against former Vice President Joe Biden Joe BidenBiden: Trump 'an idiot' for saying Russian interference a 'hoax' Biden: 'I know I'm the frontrunner' in 2020 race 2020 Democrats set sights on corporate tax hike MORE. The video accused the former vice president of pressuring Ukrainian officials to drop an investigation into a company where his son Hunter Biden sat on the board.\n\nFacebook reportedly stated in a letter that its decision to let the ad stand was \"grounded in Facebook's fundamental belief in free expression, respect for the democratic process, and belief that in mature democracies with a free press, political speech is already arguably the most scrutinized speech there is.\"\n\n— Tess Bonn", "description": "Sen. Marsha Blackburn (R-Tenn.) is defending Facebook amid criticism over its policy that exempts political advertisements from being fact-checked.", "authors": [], "top_image": "https://thehill.com/sites/default/files/zuckerbergmark_102319as2_lead.jpg", "published_at": "2019-10-28"}